{
  "name": "Elizabeth Black",
  "homepage": "https://www.kcl.ac.uk/people/elizabeth-black",
  "status": "success",
  "content": "Elizabeth Black | King's College London Skip to main contentProfessor Elizabeth Black Professor of Artificial IntelligenceResearch interestsComputer scienceContact details+44 020 7848 2694elizabeth.black@kcl.ac.ukBiographyAbout Elizabeth Black is a Professor of Artificial Intelligence in the Department of Informatics, where she is a member of the Reasoning and Planning research group. She is the Director of the UKRI Centre for Doctoral Training in Safe and Trusted Artificial Intelligence, which brings together academics from King's College London and Imperial College London to deliver a 4-year PhD programme focussed on the use of model-based artificial intelligence (AI) techniques for ensuring the safety and trustworthiness of AI systems. She also serves as a member of the steering committee of COMMA international conference series on Computational Models of Argument, and as an Editorial Board Member of the journal Autonomous Agents and Multi-Agent Systems. Professor Black is a Fellow of the Higher Education Academy. She received her PhD in Computer Science from University College London in 2007, on the topic of argument inquiry dialogues. Prior to joining King's in 2011, Elizabeth worked as a post-doctoral research assistant at the University of Oxford and held a Marie-Curie Intra-European Fellowship at the University of Utrecht. Research interests Safe and trusted artificial intelligence Intelligent agents and multi-agent systems Argumentation theoretic models of agent reasoning, communication and dialogue Strategic considerations for argumentation-based dialogues Responsible development of artificial intelligence technologies More information Research Profile Research Funding Personal Website PublicationsResearchResearchReasoning and PlanningThe group focuses on the fundamental AI challenge of creating, representing and reasoning. NewsNews08 May 2024King's part of major project to empower regulators and end-users to make AI saferThe project is the first of its kind to give people without a technical background the tools to audit AI systemsTechnology & Science04 April 2024King's academics look into crystal ball in new future gazing sci-fi anthologyResearchers in AI from across three different faculties provided expert reflections on energy, healthcare and education in the near futureHealthSocietyTechnology & Science01 March 2024King's AI researchers appointed as Turing Fellows to tackle societal challengesThree King's academics from the Department of Informatics have been named as Turing Fellows for 2024-25Technology & Science14 November 2023King's Supervisory Excellence Award Winners 2023We are delighted to announce the winners of the 2023 King’s Supervisory Excellence Awards and the new Mentoring & Support Awards. UniversityStudent20 July 2021Dr Elizabeth Black advising new government AI taskforceDr Elizabeth Black to advise new government taskforce on how AI can help the UK reach climate change targets.Technology & Science31 October 2019Giving students the skills they need to succeed in a globalised worldThe Departments of War Studies, Chemistry and Informatics are pleased to announce the launch of their new innovative online module for students, ‘Professional...08 May 2018Athena SWAN Bronze Award for Informatics The Department of Informatics is pleased to announce that it has been awarded an Athena SWAN Bronze Award. Athena SWAN is a UK charter that recognises the...Technology & ScienceEventsEvents10JunInformatics Research Showcase 202410 June 2024 10:00 to 14:00The 2024 Informatics Research Showcase provided a unique opportunity to meet with King’s academics and Informatics students.Please note: this event has passed.FeaturesFeatures30 October 2023Reimagining AI Futures - Dr Elizabeth Black: Trustworthy AIThe AI revolution is here, but can it be trusted? Dr Elizabeth Black talks us through what’s needed to trust AI and the trade-offs we’ll face in a future...Technology & SciencePublicationsResearchNewsEventsFeaturesResearchReasoning and PlanningThe group focuses on the fundamental AI challenge of creating, representing and reasoning. News08 May 2024King's part of major project to empower regulators and end-users to make AI saferThe project is the first of its kind to give people without a technical background the tools to audit AI systemsTechnology & Science04 April 2024King's academics look into crystal ball in new future gazing sci-fi anthologyResearchers in AI from across three different faculties provided expert reflections on energy, healthcare and education in the near futureHealthSocietyTechnology & Science01 March 2024King's AI researchers appointed as Turing Fellows to tackle societal challengesThree King's academics from the Department of Informatics have been named as Turing Fellows for 2024-25Technology & Science14 November 2023King's Supervisory Excellence Award Winners 2023We are delighted to announce the winners of the 2023 King’s Supervisory Excellence Awards and the new Mentoring & Support Awards. UniversityStudent20 July 2021Dr Elizabeth Black advising new government AI taskforceDr Elizabeth Black to advise new government taskforce on how AI can help the UK reach climate change targets.Technology & Science31 October 2019Giving students the skills they need to succeed in a globalised worldThe Departments of War Studies, Chemistry and Informatics are pleased to announce the launch of their new innovative online module for students, ‘Professional...08 May 2018Athena SWAN Bronze Award for Informatics The Department of Informatics is pleased to announce that it has been awarded an Athena SWAN Bronze Award. Athena SWAN is a UK charter that recognises the...Technology & ScienceEvents10JunInformatics Research Showcase 202410 June 2024 10:00 to 14:00The 2024 Informatics Research Showcase provided a unique opportunity to meet with King’s academics and Informatics students.Please note: this event has passed.Features30 October 2023Reimagining AI Futures - Dr Elizabeth Black: Trustworthy AIThe AI revolution is here, but can it be trusted? Dr Elizabeth Black talks us through what’s needed to trust AI and the trade-offs we’ll face in a future...Technology & Science(S)5.12Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 6339,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:58"
}