{
  "name": "Elizabeth Bradley",
  "homepage": "https://www.cs.colorado.edu/~lizb",
  "status": "success",
  "content": "Liz Bradley Complex Systems Group Department of Computer Science Joint Appointment with Department of Electrical and Computer Engineering Home Research Publications Vita Contact Other affiliations: The Department of Applied Mathematics The Santa Fe Institute (member of the external faculty) The University of Colorado Biofrontiers Institute (member of the Council) The Computing Research Association's Computing Community Consortium (chair emerita) Fall Office Hours: By appointment; please email me to set up a time. Course Materials: Chaotic Dynamics (CSCI 4446/5446) MOOC on Nonlinear Dynamics (through the Santa Fe Institute's Complexity Explorer website) New PhD Student Seminar (CSCI 6000). This is way outdated but contains some useful material, so I've left it up here. Current Research Collaborators: Morgan Byers, PhD student, Computer Science. Lily Cothren, PhD student, Electrical and Computer Engineering. Karine Gibbs, Associate Professor, Plant & Microbial Biology, University of California Meredith MacGregor, Assistant Professor, Physics & Astronomy, Johns Hopkins University Jim Meiss, Professor, Applied Mathematics. Corey Murphey, PhD student, Computer Science (in collaboration with Jed Brown and Allison Hilger, and accomplished open-water swimmer). Here's a nice feature about Corey from the CS Department website Orit Peleg, Assistant Professor, Computer Science. Here's a photo of some of those people at the 2025 Dynamics Days conference. Graduate/Postgraduate Research Alumni: Jenny Abernethy is at CSIRO in Australia. Zach Alexander took a position at Microsoft Research. Srinivas Bhaskar took a position at Google. Nancy Collins took a position at NCAR. Varad Deshmukh is a Research Scientist at Meta. Matt Easley is Associate Dean of Joint Warfighting and Professor, College of Information and Cyberspace, National Defense University. Joshua Garland is an Associate Research Professor in the Global Security Initiative, Arizona State University. Here's a nice feature about him from DSWeb and a link to his thesis. James Garnett is somewhere in the Pacific Northwest. Golnar Gharooni Fard took a postdoc position in Maha's group at Harvard. Kenny Gruchalla leads the scientific visualization group at NREL. Stephen Heck took a position at Sandia. Rhonda Hoenigman is an Associate Teaching Professor at the University of Colorado Boulder. Joe Iwanski is at the Dwight Englewood School outside New York City. Ryan James took a postdoc position in Jim Crutchfield's group at UC Davis. Samantha Molnar is at NREL. Todd Mytkowicz took a position at Microsoft Research. Mike Neuder is doing a PhD with David Parkes at Harvard. Tom Peacock is a Professor of Mechanical Engineering at M.I.T. Laura Rassbach de Vesine is at DataDog. Vanessa Robins is an Associate Professor in Fundamental and Theoretical Physics at the Australian National University. Natalie Ross took a position at Google. Reinhard Stolle is with Audi's autonomous vehicles division. Josh Stuart is a Professor of Biomolecular Engineering at UC Santa Cruz, and the winner of CU's 2006 Kalpana Chawla award. Click here to read about some of what Josh has been up to lately. Elizabeth White is a research professor at the University of Chicago. Contact Information: Email: lizb(at)cs[dot]colorado{dot}edu Phone: +1-303-492-5355 Fax: +1-303-492-2844 Mail: University of Colorado 430 UCB Department of Computer Science Boulder, CO 80309-0430 USA",
  "content_length": 3432,
  "method": "requests",
  "crawl_time": "2025-12-01 13:05:58"
}