{
  "name": "Elke A. Rundensteiner",
  "homepage": "http://davis.wpi.edu/dsrg/MEMBERS/rundenst",
  "status": "success",
  "content": "Welcome to Elke's WPI Home Page - Funding Elke A. Rundensteiner's WPI Home Page home research teaching funding links awards students I am Full Professor in the Computer Science Department of Worcester Polytechnic Institute (WPI). I received my B.S. degree (Vordiplom) from the Johann Wolfgang Goethe University, Frankfurt, West Germany, in 1984, a Master's degree from the Florida State University, Tallahassee, in 1987, and my Ph.D. degree from the University of California, Irvine, in 1992; all in Computer Science. I have received numerous honors and awards, including a Fulbright Scholarship, a NSF Young Investigator Award in databases in 1994, and an Intel Young Investigator Engineering Award from the Engineering Foundation. I have been investigating database technology for non-conventional applications for over ten years.  I am a  member of IEEE and ACM. My teaching and research interests are in the areas of databases, information and software systems. In particular, currently on-going projects include continuous streaming data processing, large-scale data warehousing over dynamic and distributed information sources, data-centric web site management and web/XML middleware services, XML query optimization and XML query caching, middle layer transformation and information integration technology, database change management, large-scale information visualization and discovery, to just name a few. I'm running the Database Systems Research Group (DSRG) here at WPI. Student Involvement: Undergraduate Projects: I advise MQPs in the general area of database systems, including distributed data servers and integration, the WWW and databases, visual interfaces, and intelligent knowledge bases. For a quick view at projects I'm most interested in in 2004/2005, please view here. Some of the currently on-going as well as already completed MQP or IQP projects can be seen here. General MQP topics of interest to me include . Project-related funding is available from NSF in the form of REUs (restricted for American citizens). Graduate Projects: I am working with Ph.D. and Master's students on research in the general area of database systems; project descriptions and students working on DSRG projects are listed on DSRG homepage . Key research publications in DSRG can be found at DSRG Publications page, and will give a good insight into some of the activities in DSRG. Prior to joining WPI, I was faculty member at University of Michigan, Ann Arbor and worked with about 10 PhD. students, and MS students and undergraduate students there; some of the projects with University of Michigan students can be found here. At times, I have RA positions for research projects funded by NSF, IBM and other sponsors available. For further information contact me directly. Surface Mail: Elke A. Rundensteiner Computer Science DepartmentWorcester Polytechnic Institute 100 Institute Road Worcester, MA 01609.E-mail: rundenst AT cs.wpi.edu Phone:  508.831.5815 Fax:  508.831.5776 Office: 238 Fuller LabsCS. Dept:  508.831.5357 Top Links WPI CS Homepage DSRG at WPI DBLP Bibliography DBWorld © 2007 Elke A. Rundensteiner | Design by Andreas Viklund",
  "content_length": 3153,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:03"
}