{
  "name": "Ellis Horowitz",
  "homepage": "http://www.ellishorowitz.com",
  "status": "success",
  "content": "Ellis Horowitz Homepage Ellis Horowitz Emeritus Professor of Computer Science & Electrical Engineering E-mail: horowitz@usc.edu A complete Curriculum Vitae is here See also his Wikipedia Entry Horowitz Final Lecture Slides (ppt) Horowitz Final Lecture Video Biography Dr. Ellis Horowitz is currently Emeritus Professor of Computer Science and Electrical Engineering at the University of Southern California. He received his B.S. degree from Brooklyn College and his Ph.D. in computer science from the University of Wisconsin - Madison. He was on the faculty there and at Cornell University. He has also been a visiting Professor at M.I.T. and the Israel Institute of Technology (Technion). Dr. Horowitz has held numerous academic administrative jobs including Associate Chairman of Computer Science at the University of Wisconsin. At U.S.C. he was chairman of the Computer Science Department from 1990 to 1999. After completing his term as Computer Science department chairman, Dr. Horowitz was appointed Director of Information Technology and Distance Education in USC's Viterbi School of Engineering. Part of his responsibilities included the Distance Education Network (DEN). As Director he oversaw an operation that offers more than 200 graduate engineering courses per year to more than 1,000 students. Originally courses were delivered by closed circuit satellite broadcast, but under Dr. Horowitz DEN converted their course delivery to Internet webcast. Dr. Horowitz is the author of ten books and over eighty journal articles and refereed conference proceedings on computer science subjects ranging from data structures, algorithms, and software design to computer science education. He has been a principal investigator on research contracts from NSF, AFOSR, ONR, and DARPA. He is a past associate editor for the journals Communications of the ACM and Transactions on Mathematical Software. He was an IBM Scholar from 1989-1993. His Erdos number is 4 Dr. Horowitz is an active consultant to the legal community, specializing in intellectual property issues. He has participated in several landmark cases including Yahoo v Google, RIAA v Kazaa, and RIAA v LimeWire. He was the founder and CEO of Quality Software Products, a California Corporation, from 1983 - 1993. The company designed and developed UNIX application software that was sold worldwide. Here is a list of my doctoral students and doctoral ancestors Current Teaching I am no longer teaching classes and I have officially retired as of May 15, 2025. Two courses I originally developed, CSCI 571 Web Technologies and CSCI 572 Information Retrieval and Web Search Engines, both of which are quite popular and achieved large graduate enrollments, I have handed off to others who are capably handling them. Published Books 1.\tPractical Strategies for Developing Large Software Systems, edited collection, Addison-Wesley Publishing Co., March 1975. 2.\tFundamentals of Data Structures, Computer Science Press, division of W.H. Freeman, New York, August 1976 (with S. Sahni). Over 250,000 copies sold worldwide. Translated into Portuguese, Chinese, French, German, Korean. Derived Versions Fundamentals of Data Structures in Pascal, Computer Science Press, division of W.H. Freeman, New York, 1983. Fundamentals of Data Structures in Turbo Pascal, Computer Science Press, division of W.H. Freeman, New York, 1988. Fundamentals of Data Structures in C, Computer Science Press, division of W.H. Freeman, New York, 1992. Fundamentals of Data Structures in C++, Computer Science Press, division of W.H. Freeman, New York, 1995. (with S. Sahni) Fundamentals of Data Structures in C++, Second Edition, Silicon Press, Summit, New Jersey, 2007. (with S. Sahni) 3.\tFundamentals of Computer Algorithms, Computer Science Press, division of W.H. Freeman, New York, September 1978 (with S. Sahni). Translated into German. Derived Version Computer Algorithms in C++, Computer Science Press, division of W.H. Freeman, New York, September 1996 (with S. Sahni and Sanguthevar Rajasekaran) Computer Algorithms, Computer Science Press, division of W.H. Freeman, New York, September 1998 (with S. Sahni and Sanguthevar Rajasekaran) 4.\tProgramming Languages: A Grand Tour, edited collection, Computer Science Press, division of W.H. Freeman, New York, First Edition 1983, Second Edition 1986. 5.\tFundamental Concepts of Programming Languages, Computer Science Press, division of W.H. Freeman, New York, 1983. 6.\tObject Oriented Databases and Applications to CASE, Networks, and VLSI CAD, Prentice-Hall, Englewood Cliffs, New Jersey, 1990, with R. Gupta. 7.\tSoftware Cost Estimation with COCOMOII, Prentice Hall, New Jersey, 2000 (with Boehm, Abts, Brown, Chulani, Clark, Madachy, Reifer and Steece) Some Personal Data Family Married to Maryanne Horowitz, Professor of History at Occidental College (see also her Wikipedia entry). Maryanne specializes in the French and Italian Renaissance periods, primarily 16th Century. Three children, Pipi, Edward and Ira, with spouses Pipi and Nicole, married: 2013, Eddie and Michelle, married: 2008, Ira and Nell, married: 2011, and five grandchildren Kai Noah (b. 10/2/2010), Lennon Sky (b. 1/24/2013), Asa Taicheng (b. 04/06/2014), Eva Yiling (b. 4/7/2017). and Elle Peiching (b. 3/6/2019). Favorite Vacation Spot (Summer) Jackson Hole, Wyoming, Home of Grand Teton National Park and the Gros Ventre mountain range, I have visited Jackson Hole more than one dozen times. Favorite hikes include Rendezvous Mountain (either up or down, mostly down), and the Jenny Lake trail to Hidden Falls. Favorite Vacation Spot (Winter) Hawaii, (of course), which island, take your pick, they are all wonderful, though we have a preference for Maui. Kaanapali Beach has a lot to offer, and Wailea is so mellow. Favorite Recreation Activities For more than 20 years Allan Spivak and I have ridden the Marvin Braude Bike Trail, from just south of the Santa Monica Pier to the Redondo Pier, and back. Allan and I have also done some notable, special bike rides including The 1996 AIDS Ride from San Francisco to Los Angeles and here are photos of Allan and I when we biked along with Lance on his last Tour de France in 2005. We have done the LA River Ride numerous times, most recently in 2019. Alas, my long time racquetball player and business partner, Larry Flon passed away on January 6, 2016. I continued to play for a few more years, this time with William G. J. Halfond at the USC Lyon Center. But as of 2022 I have officially retired from racquetball as my back has strenuously objected to the twisting. Palisades Fire and a New Chapter On Jan. 7, 2025 our home, along with many others was destroyed in the Palisades fire. Fortunately Maryanne and I left early that morning, not realizing we would never be back. We already had an apartment near three grandchildren living in Chino Hills and that has become our new, \"permanent\" home. Living in a small two bedroom apartment is just like when we started out as newlyweds. With one car we go everywhere together. With three loving grandchildren, son and daughter-in-law, and each other, and insurance money for the lost house, we are beyond lucky. UPDATE: We have settled into a new home in Chino Hills. Below is a photo of our family taken on Mother's Day, 2025, Top Row: Ira, Maryanne, Ellis, Eddie, and Kai; Bottom Row: Nell, Asa, Eva holding Elle, Lennon and Michelle;and Nugget",
  "content_length": 7408,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:08"
}