{
  "name": "Elvin Isufi",
  "homepage": "https://sites.google.com/site/elvinisufihp",
  "status": "success",
  "content": "Elvin IsufiSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeContactOffice: 5. E. 220Van Mourik Broekmanweg 62628 XE Delft - The NetherlandsE-mail: e.isufi-1@tudelft.nlHello and welcome!I work as Associate Professor of graph machine learning at the Delft University of Technology (TU Delft), The Netherlands. Among the different things, I co-founded and co-direct AIdrolab --one of the 24 TU Delft AI Labs-- where we research foundamental and applied graph-based data processing for water networks and flood modeling. Prior to joining TU Delft as faculty, I spent some time as a postdoctoral researcher at The University of Pennsylvania (UPENN) and obtained my Ph.D. degree at TU Delft. I did my master's and bachelor's studies at The University of Perugia in Italy. I have been privileged to be guided by some great mentors throughout my career including Prof. Alejandro Ribeiro (postdoc), Prof. Geert Leus (Ph.D.), and Prof. Paolo Banelli (master and bachelor). My group investigates the role of stucture in relational data with a focus on analyzing, processing and learning from such information, ultimately, bringing artificial intelligence (AI) techniques closer to critical infrastructure networks. We combine signal processing theory with geometric deep learning to design AI methods that are principled, tractable and reliable. This research is carried out together with an outstanding team of Ph.D. students and collaborators that you can find here.This webpage is meant to provide some up-to-date information about the list of publications, the research thrusts, student-related information. Find also my Google Scholar and LinkedIn profiles.Prospective M.Sc. students: If you are looking for a thesis project, get some inspiration by the current projects here, to the past theses here, or research themes here. Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 1892,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:10"
}