{
  "name": "Emad Shihab",
  "homepage": "http://das.encs.concordia.ca/members/emad-shihab",
  "status": "success",
  "content": "Emad Shihab | DAS Lab Skip to main contentEmad ShihabI am a Full Professor and Concordia Research Chair in the Department of Computer Science and Software Engineering at Concordia University. My general research area is Software Engineering. I am particularly interested in Mining Software Repositories, Software Quality Assurance, Software Maintenance, Empirical Software Engineering, Mobile/wearable Applications and Software Architecture. I mine historical project data and apply Data Mining, Artificial Intelligence and Statistical Analysis techniques in order to build pragmatic solutions that practitioners can use to maximize their software quality with the least amount of resources. Some of my research has been done in collaboration with and/or adopted in industry by companies such as Avaya, Microsoft, BlackBerry and Ericsson.Publications​JournalsH. Samaana, D. E. Costa, A. Abdellatif, and E. Shihab, \"Opportunities and security risks of technical leverage: A replication study on the NPM ecosystem,\" in Empirical Software Engineering, 2025 PDF BibTeXS. Khatoonabadi, A. Abdellatif, D. E. Costa, and E. Shihab, \"Predicting the First Response Latency of Maintainers and Contributors in Pull Requests,\" in IEEE Transactions on Software Engineering, 2024 PDF BibTeXJ. Latendresse, S. Abedu, A. Abdellatif, and E. Shihab, \"An Exploratory Study on Machine Learning Model Management,\" in ACM Transactions on Software Engineering and Methodology, 2024 PDF BibTeXA. Abdellatif, G. Ghiasi, D. E. Costa, E. Shihab, and T. Tajmel, \"SE4AI: A Training Program Considering Technical, Social, and Professional Aspects of AI-based Software Systems,\" in IEEE Software: Software Engineering Educating and Training, 2023 PDF BibTeXS. Khatoonabadi, D. E. Costa, S. Mujahid, and E. Shihab, \"Understanding the Helpfulness of Stale Bot for Pull-based Development,\" in ACM Transactions on Software Engineering and Methodology, 2023 PDF BibTeXA. J. Jafari, D. E. Costa, E. Shihab, and R. Abdalkareem, \"Dependency Update Strategies and Package Characteristics,\" in ACM Transactions on Software Engineering and Methodology, 2023 PDF BibTeXS. Mujahid, R. Abdalkareem, and E. Shihab, \"What are the characteristics of highly-selected packages? A case study on the npm ecosystem,\" in Journal of Systems and Software, 2023 PDF BibTeXM. Alfadel, D. E. Costa, and E. Shihab, \"Empirical Analysis of Security Vulnerabilities in Python Packages,\" in Empirical Software Engineering Journal, 2023 PDF BibTeXM. Alfadel, D. E. Costa, E. Shihab, and B. Adams, \"On the Discoverability of Npm Vulnerabilities in Node.Js Projects,\" in ACM Transactions on Software Engineering and Methodology, 2022 PDF BibTeXK. Badran, P. Cote, A. Kolopanis, R. Bouchoucha, A. Collante, D. Costa, and E. Shihab, \"Can Ensembling Pre-processing Algorithms Lead to Better Machine Learning Fairness?,\" in IEEE Computer SI: Software Engineering for Responsible AI, 2022 PDF BibTeXS. Khatoonabadi, D. E. Costa, R. Abdalkareem, and E. Shihab, \"On Wasted Contributions: Understanding the Dynamics of Contributor-Abandoned Pull Requests,\" in ACM Transactions on Software Engineering and Methodology, 2022 PDF BibTeXY. Kashiwa, R. Nishikawa, Y. Kamei, M. Kondo, E. Shihab, R. Sato, and N. Ubayashi, \"An empirical study on self-admitted technical debt in modern code review,\" in Information and Software Technology, 2022 PDF BibTeXM. Elshafei, D. E. Costa, and E. Shihab, \"Toward the Personalization of Biceps Fatigue Detection Model for Gym Activity: An Approach to Utilize Wearables' Data from the Crowd,\" in Sensors, 2022 PDF BibTeXA. J. Jafari, D. E. Costa, R. Abdalkareem, E. Shihab, and N. Tsantalis, \"Dependency Smells in JavaScript Projects,\" in IEEE Transactions on Software Engineering (TSE), 2021 PDF BibTeXX. Chen, R. Abdalkareem, S. Mujahid, E. Shihab, and X. Xia, \"Helping or not helping? Why and how trivial packages impact the npm ecosystem,\" in Empirical Software Engineering Journal (EMSE), 2021 PDF BibTeXS. Mujahid, D. E. Costa, R. Abdalkareem, E. Shihab, M. A. Saied, and B. Adams, \"Towards using package centrality trend to identify packages in decline,\" in IEEE Transactions on Engineering Management Journal, 2021 PDF BibTeXM. S. Afzali Arani, D. E. Costa, and E. Shihab, \"Human Activity Recognition: A Comparative Study to Assess the Contribution Level of Accelerometer, ECG, and PPG Signals,\" in Sensors, 2021 PDF BibTeXA. Abdellatif, K. Badran, D. Costa, and E. Shihab, \"A Comparison of Natural Language Understanding Platforms for Chatbots in Software Engineering,\" in IEEE Transactions on Software Engineering (TSE), 2021 PDF BibTeXM. A. R. Chowdhury, R. Abdalkareem, E. Shihab, and B. Adams, \"On the Untriviality of Trivial Packages: An Empirical Study of npm JavaScript Packages,\" in IEEE Transactions on Software Engineering (TSE), 2021 PDF BibTeXD. E. Costa, S. Mujahid, R. Abdalkareem, and E. Shihab, \"Breaking Type-Safety in Go: An Empirical Study on the Usage of the unsafe Package,\" in IEEE Transactions on Software Engineering (TSE), 2021 PDF BibTeXJ. Hoyos, R. Abdelkareem, S. Mujahid, E. Shihab, and A. E. Bedoya, \"On the Removal of Feature Toggles,\" in Empirical Software Engineering (EMSE), 2021 PDF BibTeXM. Elshafei, D. E. Costa, and E. Shihab, \"On the Impact of Biceps Muscle Fatigue in Human Activity Recognition,\" in Sensors, 2021 PDF BibTeXM. Elshafei, and E. Shihab, \"Towards Detecting Biceps Muscle Fatigue in Gym Activity Using Wearables,\" in Sensors, 2021 PDF BibTeXJ. Chen, W. Shang, and E. Shihab, \"PerfJIT: Test-level Just-in-time Prediction for Performance Regression Introducing Commits,\" in IEEE Transactions on Software Engineering (TSE), 2020 PDF BibTeXR. Abdalkareem, S. Mujahid, and E. Shihab, \"A Machine Learning Approach to Improve the Detection of CI Skip Commits,\" in IEEE Transactions on Software Engineering (TSE), 2020 PDF BibTeXA. Abdellatif, K. Badran, and E. Shihab, \"MSRBot: Using Bots to Answer Questions from Software Repositories,\" in Empirical Software Engineering (EMSE), 2020 PDF BibTeXA. Abdellatif, Y. Zeng, M. Elshafei, E. Shihab, and W. Shang, \"Simplifying the Search of npm Packages,\" in Information and Software Technology, 2020 PDF BibTeXR. Abdalkareem, V. Oda, S. Mujahid, and E. Shihab, \"On the impact of using trivial packages: an empirical case study on npm and PyPI,\" in Empirical Software Engineering (EMSE), 2020 PDF BibTeXJ. Han, E. Shihab, Z. Wan, S. Den, and X. Xia, \"What do Programmers Discuss about Deep Learning Frameworks,\" in Empirical Software Engineering (EMSE), 2020 PDF BibTeXR. Abdalkareem, S. Mujahid, E. Shihab, and J. Rilling, \"Which Commits Can Be CI Skipped?,\" in IEEE Transactions on Software Engineering (TSE), 2019 PDF BibTeXM. T. Rahman, P. C. Rigby, and E. Shihab, \"The modular and feature toggle architectures of Google Chrome,\" in Empirical Software Engineering (EMSE), 2019 PDF BibTeXG. Sierra, E. Shihab, and Y. Kamei, \"A Survey of Self-admitted Technical Debt,\" in Journal of Systems and Software (JSS), 2019 PDF BibTeXA. Dehghani, O. Sarbishei, T. Glatard, and E. Shihab, \"A Quantitative Comparison of Overlapping and Non-Overlapping Sliding Windows for Human Activity Recognition Using Inertial Sensors,\" in Sensors, 2019 PDF BibTeXM. Yan, X. Xia, E. Shihab, D. Lo, J. Yin, and X. Yang, \"Automating Change-level Self-admitted Technical Debt Determination,\" in IEEE Transactions on Software Engineering (TSE), 2018 PDF BibTeXH. Valdivia-Garcia, E. Shihab, and M. Nagappan, \"Characterizing and predicting blocking bugs in open source projects,\" in Journal of Systems and Software (JSS), 2018 PDF BibTeXS. Mujahid, G. Sierra, R. Abdalkareem, E. Shihab, and W. Shang, \"An Empirical Study of Android Wear User Complaints,\" in Empirical Software Engineering (EMSE), 2018 PDF BibTeXM. Hassani, W. Shang, E. Shihab, and N. Tsantalis, \"Studying and Detecting Log-Related Issues,\" in Empirical Software Engineering (EMSE), 2018 PDF BibTeXE. Maldonado, E. Shihab, and N. Tsantalis, \"Using Natural Language Processing to Automatically Detect Self-Admitted Technical Debt,\" in IEEE Transactions on Software Engineering (TSE), 2017 PDF BibTeXR. Abdalkareem, E. Shihab, and J. Rilling, \"What Do Developers Use the Crowd For? A Study Using Stack Overflow,\" in IEEE Software: SI on Crowdsourcing for Software Engineering, 2017 PDF BibTeXR. Abdalkareem, E. Shihab, and J. Rilling, \"On code reuse from StackOverflow: An exploratory study on Android apps,\" in Information and Software Technology, 2017 PDF BibTeXQ. Huang, E. Shihab, X. Xia, D. Lo, and S. Li, \"Identifying self-admitted technical debt in open source projects using text mining,\" in Empirical Software Engineering, 2017 PDF BibTeXM. Arif, W. Shang, and E. Shihab, \"An empirical study on the discrepancy between performance testing results from virtual and physical environments,\" in Empirical Software Engineering, 2017 PDF BibTeXX. Xia, D. Lo, E. Shihab, and X. Wang, \"Automated Bug Report Field Reassignment and Refinement Prediction,\" in IEEE Transactions on Reliability (ToR), 2016 PDF BibTeXA. T. Misirli, E. Shihab, and Y. Kamei, \"Studying High Impact Fix-inducing Changes,\" in Empirical Software Engineering Journal (EMSE), 2016 PDF BibTeXC. Rosen, and E. Shihab, \"What are mobile developers asking about? A large scale study using stack overflow,\" in Empirical Software Engineering (EMSE), 2016 PDF BibTeXX. Xia, D. Lo, E. Shihab, X. Wang, and X. Yang, \"ELBlocker: Predicting blocking bugs with ensemble imbalance learning,\" in Information and Software Technology Journal (IST), 2015 PDF BibTeXH. Khalid, E. Shihab, M. Nagappan, and A. E. Hassan, \"What do mobile app users complain about? A study on free iOS apps,\" in IEEE Software, 2015 PDF BibTeXX. Xia, D. Lo, E. Shihab, X. Wang, and B. Zhou, \"Automatic, high accuracy prediction of reopened bugs,\" in Automated Software Engineering, 2014 PDF BibTeXE. Shihab, A. Ihara, Y. Kamei, W. M. Ibrahim, M. Ohira, B. Adams, A. E. Hassan, and K. Matsumoto, \"Studying Re-opened Bugs in Open Source Software,\" in Empirical Software Engineeri",
  "content_length": 34818,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:16"
}