{
  "name": "Emanuel H. Rubensson",
  "homepage": "https://katalog.uu.se/empinfo/?id=N9-880",
  "status": "success",
  "content": "Emanuel Rubensson - Uppsala universitet Emanuel Rubensson Universitetslektor vid Institutionen för informationsteknologi; Beräkningsvetenskap Telefon: 018-471 29 81E-post: emanuel.rubensson@it.uu.seBesöksadress: Hus 10, Regementsvägen 10Postadress: Box 337751 05 UPPSALA Ladda ned kontaktuppgifter för Emanuel Rubensson vid Institutionen för informationsteknologi; Beräkningsvetenskap Akademiska meriter: Docent, excellent lärare Publikationer Senaste publikationer A unifying framework for higher order derivatives of matrix functions Rubensson, Emanuel H. Ingår i SIAM Journal on Matrix Analysis and Applications, s. 504-528, 2024 DOI för A unifying framework for higher order derivatives of matrix functions Susceptibility formulation of density matrix perturbation theory Niklasson, Anders M. N.; Habib, Adela; Finkelstein, Joshua D.; Rubensson, Emanuel H. Ingår i Journal of Chemical Physics, 2024 DOI för Susceptibility formulation of density matrix perturbation theory The Chunks and Tasks Matrix Library Rubensson, Emanuel H.; Rudberg, Elias; Kruchinina, Anastasia; Artemov, Anton G. Ingår i SoftwareX, 2022 DOI för The Chunks and Tasks Matrix Library Ladda ner fulltext (pdf) av The Chunks and Tasks Matrix Library Quantum Perturbation Theory Using Tensor Cores and a Deep Neural Network Finkelstein, Joshua; Rubensson, Emanuel H.; Mniszewski, Susan M.; Negre, Christian F. A. et al. Ingår i Journal of Chemical Theory and Computation, s. 4255-4268, 2022 DOI för Quantum Perturbation Theory Using Tensor Cores and a Deep Neural Network Sparse approximate matrix-matrix multiplication for density matrix purification with error control Artemov, Anton G.; Rubensson, Emanuel H. Ingår i Journal of Computational Physics, 2021 DOI för Sparse approximate matrix-matrix multiplication for density matrix purification with error control Ladda ner fulltext (pdf) av Sparse approximate matrix-matrix multiplication for density matrix purification with error control Alla publikationer Artiklar i tidskrift A unifying framework for higher order derivatives of matrix functions Rubensson, Emanuel H. Ingår i SIAM Journal on Matrix Analysis and Applications, s. 504-528, 2024 DOI för A unifying framework for higher order derivatives of matrix functions Susceptibility formulation of density matrix perturbation theory Niklasson, Anders M. N.; Habib, Adela; Finkelstein, Joshua D.; Rubensson, Emanuel H. Ingår i Journal of Chemical Physics, 2024 DOI för Susceptibility formulation of density matrix perturbation theory The Chunks and Tasks Matrix Library Rubensson, Emanuel H.; Rudberg, Elias; Kruchinina, Anastasia; Artemov, Anton G. Ingår i SoftwareX, 2022 DOI för The Chunks and Tasks Matrix Library Ladda ner fulltext (pdf) av The Chunks and Tasks Matrix Library Quantum Perturbation Theory Using Tensor Cores and a Deep Neural Network Finkelstein, Joshua; Rubensson, Emanuel H.; Mniszewski, Susan M.; Negre, Christian F. A. et al. Ingår i Journal of Chemical Theory and Computation, s. 4255-4268, 2022 DOI för Quantum Perturbation Theory Using Tensor Cores and a Deep Neural Network Sparse approximate matrix-matrix multiplication for density matrix purification with error control Artemov, Anton G.; Rubensson, Emanuel H. Ingår i Journal of Computational Physics, 2021 DOI för Sparse approximate matrix-matrix multiplication for density matrix purification with error control Ladda ner fulltext (pdf) av Sparse approximate matrix-matrix multiplication for density matrix purification with error control A density matrix approach to the convergence of the self-consistent field iteration Upadhyaya, Parikshit; Jarlebring, Elias; Rubensson, Emanuel H. Ingår i Numerical Algebra, Control and Optimization, s. 99-115, 2021 DOI för A density matrix approach to the convergence of the self-consistent field iteration Localized inverse factorization Rubensson, Emanuel H.; Artemov, Anton G.; Kruchinina, Anastasia; Rudberg, Elias Ingår i IMA Journal of Numerical Analysis, s. 729-763, 2021 DOI för Localized inverse factorization Ladda ner fulltext (pdf) av Localized inverse factorization Quantum-Based Molecular Dynamics Simulations Using Tensor Cores Finkelstein, Joshua; Smith, Justin S.; Mniszewski, Susan M.; Barros, Kipton et al. Ingår i Journal of Chemical Theory and Computation, s. 6180-6192, 2021 DOI för Quantum-Based Molecular Dynamics Simulations Using Tensor Cores Mixed Precision Fermi-Operator Expansion on Tensor Cores from a Machine Learning Perspective Finkelstein, Joshua; Smith, Justin S.; Mniszewski, Susan M.; Barros, Kipton et al. Ingår i Journal of Chemical Theory and Computation, s. 2256-2265, 2021 DOI för Mixed Precision Fermi-Operator Expansion on Tensor Cores from a Machine Learning Perspective Parallelization and scalability analysis of inverse factorization using the chunks and tasks programming model Artemov, Anton G.; Rudberg, Elias; Rubensson, Emanuel H. Ingår i Parallel Computing, 2019 DOI för Parallelization and scalability analysis of inverse factorization using the chunks and tasks programming model Linear scaling pseudo Fermi-operator expansion for fractional occupation Mniszewski, Susan M.; Perriot, Romain; Rubensson, Emanuel H.; Negre, Christian F. A. et al. Ingår i Journal of Chemical Theory and Computation, s. 190-200, 2019 DOI för Linear scaling pseudo Fermi-operator expansion for fractional occupation On-the-fly computation of frontal orbitals in density matrix expansions Kruchinina, Anastasia; Rudberg, Elias; Rubensson, Emanuel H. Ingår i Journal of Chemical Theory and Computation, s. 139-153, 2018 DOI för On-the-fly computation of frontal orbitals in density matrix expansions Ergo: An open-source program for linear-scaling electronic structure calculations Rudberg, Elias; Rubensson, Emanuel H.; Salek, Pawel; Kruchinina, Anastasia Ingår i SoftwareX, s. 107-111, 2018 DOI för Ergo: An open-source program for linear-scaling electronic structure calculations Parameterless stopping criteria for recursive density matrix expansions Kruchinina, Anastasia; Rudberg, Elias; Rubensson, Emanuel H. Ingår i Journal of Chemical Theory and Computation, s. 5788-5802, 2016 DOI för Parameterless stopping criteria for recursive density matrix expansions Locality-aware parallel block-sparse matrix–matrix multiplication using the Chunks and Tasks programming model Rubensson, Emanuel H.; Rudberg, Elias Ingår i Parallel Computing, s. 87-106, 2016 DOI för Locality-aware parallel block-sparse matrix–matrix multiplication using the Chunks and Tasks programming model Ladda ner fulltext (pdf) av Locality-aware parallel block-sparse matrix–matrix multiplication using the Chunks and Tasks programming model Graph-based linear scaling electronic structure theory Niklasson, Anders M. N.; Mniszewski, Susan M.; Negre, Christian F. A.; Cawkwell, Marc J. et al. Ingår i Journal of Chemical Physics, 2016 DOI för Graph-based linear scaling electronic structure theory Canonical density matrix perturbation theory Niklasson, Anders M. N.; Cawkwell, Marc J.; Rubensson, Emanuel H.; Rudberg, Elias Ingår i Physical Review E. Statistical, Nonlinear, and Soft Matter Physics, 2015 DOI för Canonical density matrix perturbation theory Ladda ner fulltext (pdf) av Canonical density matrix perturbation theory Interior eigenvalues from density matrix expansions in quantum mechanical molecular dynamics Rubensson, Emanuel H.; Niklasson, Anders M. N. Ingår i SIAM Journal on Scientific Computing, 2014 DOI för Interior eigenvalues from density matrix expansions in quantum mechanical molecular dynamics Ladda ner fulltext (pdf) av Interior eigenvalues from density matrix expansions in quantum mechanical molecular dynamics Chunks and Tasks: A programming model for parallelization of dynamic algorithms Rubensson, Emanuel H.; Rudberg, Elias Ingår i Parallel Computing, s. 328-343, 2014 DOI för Chunks and Tasks: A programming model for parallelization of dynamic algorithms Controlling errors in recursive Fermi–Dirac operator expansions with applications in electronic structure theory Rubensson, Emanuel H. Ingår i SIAM Journal on Scientific Computing, 2012 DOI för Controlling errors in recursive Fermi–Dirac operator expansions with applications in electronic structure theory Ladda ner fulltext (pdf) av Controlling errors in recursive Fermi–Dirac operator expansions with applications in electronic structure theory Comment on \"On the optimal symmetric purification scheme of the one-particle density matrix\" [Chem. Phys. Lett. 511 (2011) 159–160] Rubensson, Emanuel H. Ingår i Chemical Physics Letters, s. 84-85, 2012 DOI för Comment on \"On the optimal symmetric purification scheme of the one-particle density matrix\" [Chem. Phys. Lett. 511 (2011) 159–160] Nonmonotonic recursive polynomial expansions for linear scaling calculation of the density matrix Rubensson, Emanuel H. Ingår i Journal of Chemical Theory and Computation, s. 1233-1236, 2011 DOI för Nonmonotonic recursive polynomial expansions for linear scaling calculation of the density matrix Assessment of density matrix methods for linear scaling electronic structure calculations Rudberg, Elias; Rubensson, Emanuel H. Ingår i Journal of Physics, 2011 DOI för Assessment of density matrix methods for linear scaling electronic structure calculations Bringing about matrix sparsity in linear-scaling electronic structure calculations Rubensson, Emanuel H.; Rudberg, Elias Ingår i Journal of Computational Chemistry, s. 1411-1423, 2011 DOI för Bringing about matrix sparsity in linear-scaling electronic structure calculations Kohn–Sham density functional theory electronic structure calculations with linearly scaling computational time and memory usage Rudberg, Elias; Rubensson, Emanuel H.; Salek, Pawel Ingår i Journal of Chemical Theory and Computation, s. 340-350, 2011 DOI för Kohn–Sham density functional theory electronic structure calculations with linearly scaling computational time and memory usage Automatic Selection of Integral Thresholds by Extrapolation in Coulomb and Excha",
  "content_length": 13520,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:16"
}