{
  "name": "Emanuele Viola",
  "homepage": "http://www.ccs.neu.edu/home/viola",
  "status": "success",
  "content": "Emanuele Viola's home page Emanuele “Manu” Viola Professor Khoury College of Computer Sciences Northeastern University Theory of computation at Northeastern University. Email: (title of book)@gmail.com Office: 440 Huntington Av., #338 West Village H (WVH) Mail: 360 Huntington Av., #202 WVH Boston, MA 02115 Curriculum vitae. Book draft: Mathematics of the impossible: The complexity of computation My blog: Thoughts Pseudorandom post: Is the computer ever slow? I want to know why. But I am not interested in explanations grounded in human choice. I want to know if there is an intrinsic, mathematical reason why some tasks take longer than others. Below: teaching, including videos and slides, papers, including surveys and preprints, research team, including students, some posts about my research, and more, including from the Nineties and fiction. Teaching Slides These slides are released under Creative Commons License Attribution-Noncommercial-No Derivative Works 3.0 United States. Also, let me know if you use them. Theory of computation: introduction. mathematical background. regular languages and finite automata. context-free languages. computability and Turing machines. Kolmogorov complexity. complexity, P and NP. Algorithms: introduction; big Oh; bubble and counting sort, annotated. divide and conquer, annotated. dynamic programming and greedy algorithms. data structures. graph algorithms. linear programming. flow. NP-hardness reductions, an updated subset of the complexity slides above. approximation algorithms. More slides can be found in this directory. Videos Videos for an online course on algorithms. Videos for an online course on theory of computation. On my Youtube channel you can find the videos above and others. Select classes Complexity theory, Spring 2023, Textbook. Special topics in complexity theory Fall 2017. Gems of Theoretical Computer Science Spring 2009. Online class on theory of computation Online class on algorithms Research PapersCommunication complexity of pointer chasing via the fixed-set lemma To appear in Theory of Computing Document Pseudorandom bits for non-commutative programs With Chin Ho Lee In Conf. on Computational Complexity (CCC), 2025 Document Boosting uniformity in quasirandom groups: fast and simple With Harm Derksen and Chin Ho Lee In IEEE Symp. on Foundations of Computer Science (FOCS), 2024 Document Pseudorandomness, symmetry, smoothing: I With Harm Derksen and Peter Ivanov and Chin Ho Lee In Conf. on Computational Complexity (CCC), 2024 Document Quasirandom groups enjoy interleaved mixing With Harm Derksen Discrete Analysis, 2023 Document On correlation bounds against polynomials With Peter Ivanov and Liam Pavlovic In Conf. on Computational Complexity (CCC), 2023 Document New sampling lower bounds via the separator In Conf. on Computational Complexity (CCC), 2023 Document  Slides Efficient resilient functions With Peter Ivanov and Raghu Meka In ACM-SIAM Symp. on Discrete Algorithms (SODA), 2023 Document Fooling polynomials using invariant theory With Harm Derksen In IEEE Symp. on Foundations of Computer Science (FOCS), 2022 Document Affine extractors and AC0-Parity With Xuangui Huang and Peter Ivanov In Workshop on Randomization and Computation (RANDOM), 2022 Document Pseudorandom bits and lower bounds for randomized Turing machines Theory of Computing, vol. 18, num. 10, pp. 1--12, 2022 Document On Hardness Assumptions Needed for ``Extreme High-End'' PRGs and Fast Derandomization With Ronen Shaltiel In ACM Innovations in Theoretical Computer Science conf. (ITCS), 2022 Document Mixing in non-quasirandom groups With W. T. Gowers In ACM Innovations in Theoretical Computer Science conf. (ITCS), 2022 Document  Video Approximate Degree-Weight and Indistinguishability With Xuangui Huang To appear in ACM Trans. Computation Theory Document Fourier growth of structured F2-polynomials and applications With Jaroslaw Blasiok and Peter Ivanov and Yaonan Jin and Chin Ho Lee and Rocco A. Servedio In Workshop on Randomization and Computation (RANDOM), 2021 Document Fourier conjectures, correlation bounds, and Majority In Coll. on Automata, Languages and Programming (ICALP), 2021 Document  Video Average-case rigidity lower bounds With Xuangui Huang In Computer Science Symp. in Russia (CSR), 2021 Document New lower bounds for probabilistic degree and AC0 with parity gates To appear in Theory of Computing Document AC0 unpredictability To appear in ACM Trans. Computation Theory Document More on bounded independence plus noise: Pseudorandom generators for read-once polynomials With Chin Ho Lee Theory of Computing, vol. 16, pp. 1--50, 2020 Document Lower bounds for data structures with space close to maximum imply circuit lower bounds Theory of Computing, vol. 15, pp. 1-9, 2019 Document Sampling lower bounds: boolean average-case and permutations SIAM J. on Computing, vol. 49, num. 1, 2020 Document  Slides How to Store a Random Walk With Omri Weinstein and Huacheng Yu In ACM-SIAM Symp. on Discrete Algorithms (SODA), 2020 Document Constant-error pseudorandomness proofs from hardness require majority ACM Trans. Computation Theory, vol. 11, num. 4, pp. 19:1--19:11, 2019 Document What do humans perceive in asset returns? With Jasmina Hasanhodzic and Andrew Lo Journal of Portfolio Management, vol. 45, num. 4, pp. 49-60, 2019 Press coverage: Financial Times (link), MIT Technology Review In Northern Finance Association (NFA), 2012 In Southern Economic Association (SEA), 2012 Ten years after its deployment, the game was taken out of commission in 2018 due to repeated attacks to the server Document Indistinguishability by adaptive procedures with advice, and lower bounds on hardness amplification proofs With Aryeh Grinberg and Ronen Shaltiel In IEEE Symp. on Foundations of Computer Science (FOCS), 2018 Document Revisiting Frequency Moment Estimation in Random Order Streams With Vladimir Braverman and David P. Woodruff and Lin F. Yang In Coll. on Automata, Languages and Programming (ICALP), 2018 Document The coin problem for product tests With Chin Ho Lee ACM Trans. Computation Theory, vol. 10, num. 3, 2018 Document Local Expanders With Avi Wigderson Computational Complexity, vol. 27, num. 2, pp. 225-244, 2018 Document Bounded independence plus noise fools products With Elad Haramaty and Chin Ho Lee SIAM J. on Computing, vol. 47, num. 2, pp. 295-615, 2018 Preliminary version in Conf. on Computational Complexity (CCC), 2017 Document Block-symmetric polynomials correlate with parity better than symmetric With Frederic Green and Daniel Kreymer Computational Complexity, vol. 26, num. 2, pp. 323-364, 2017 Document  Slides  Code Some limitations of the sum of small-bias distributions With Chin Ho Lee Theory of Computing, vol. 13, 2017 Document Interleaved group products With W. T. Gowers SIAM J. on Computing, vol. 48, num. 3, pp. 554--580, 2019 Preliminary version in IEEE Symp. on Foundations of Computer Science (FOCS), 2016 FOCS Special Issue Slides of talk given at a 2017 workshop on additive combinatorics The journal version includes the results appearing in the STOC 2015 (below) and FOCS 2016 (doc, slides) conference versions Document Bounded Independence versus Symmetric Tests With Ravi Boppana and Johan Hastad and Chin Ho Lee ACM Trans. Computation Theory, vol. 11, num. 4, pp. 21:1--21:27, 2019 Preliminary version in Workshop on Randomization and Computation (RANDOM), 2016 Document Bounded indistinguishability and the complexity of recovering secrets With Andrej Bogdanov and Yuval Ishai and Christopher Williamson In Int. Cryptology Conf. (CRYPTO), 2016 Document Quadratic maps are hard to sample ACM Trans. Computation Theory, vol. 8, num. 4, 2016 Document Local reductions With Hamid Jahanjou and Eric Miles Information and Computation, vol. 261, num. 2, 2018 Preliminary version in Coll. on Automata, Languages and Programming (ICALP), 2015 ICALP Special issue Video of talk given at the Simons institute in 2015 Document  Slides The communication complexity of interleaved group products With W. T. Gowers In ACM Symp. on the Theory of Computing (STOC), 2015 Video of talk given at the FOCS 2014 workshop on higher-order Fourier analysis Document On Randomness Extraction in AC0 With Oded Goldreich and Avi Wigderson In IEEE Conf. on Computational Complexity (CCC), 2015 Document  Slides 3SUM, 3XOR, Triangles With Zahra Jafargholi Algorithmica, pp. 1-18, 2014 Video of talk given at the Simons institute in 2015 Document Short PCPs with projection queries With Eli Ben-Sasson In Coll. on Automata, Languages and Programming (ICALP), 2014 Document Real advantage With Alexander Razborov ACM Trans. Computation Theory, vol. 5, num. 4, pp. 17, 2013 Document Shielding circuits with groups With Eric Miles In ACM Symp. on the Theory of Computing (STOC), 2013 Document On the complexity of information spreading in dynamic networks With Chinmoy Dutta and Gopal Pandurangan and Rajmohan Rajaraman and Zhifeng Sun In ACM-SIAM Symp. on Discrete Algorithms (SODA), 2013 Document The communication complexity of addition Combinatorica, pp. 1-45, 2014 Preliminary version in ACM-SIAM Symp. on Discrete Algorithms (SODA), 2013 Document  Slides Extractors for Turing-machine sources In Workshop on Randomization and Computation (RANDOM), 2012 Document  Slides Substitution-permutation networks, pseudorandom functions, and natural proofs With Eric Miles J. of the ACM, vol. 62, num. 6, 2015 Preliminary version in Int. Cryptology Conf. (CRYPTO), 2012 Document Tight bounds on computing error-correcting codes by bounded-depth circuits with arbitrary gates With Anna Gal and Kristoffer Arnsfelt Hansen and Michal Koucky and Pavel Pudlak IEEE Transactions on Information Theory, vol. 59, num. 10, pp. 6611-6627, 2013 Preliminary version in ACM Symp. on the Theory of Computing (STOC), 2012 Document  Slides Extractors for circuit sources SIAM J. on Computing, vol. 43, num. 2, pp. 355-972, 2014 Preliminary version in IEEE Symp. on Foundations of Computer Scien",
  "content_length": 21983,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:17"
}