{
  "name": "Emanuel Sallinger",
  "homepage": "https://informatics.tuwien.ac.at/people/emanuel-sallinger",
  "status": "success",
  "content": "Emanuel Sallinger — TU Wien Informatics People Overview Professors Scientific Staff Administrative Staff Student Staff External Lecturers By Responsibilities By Committee By Name Related Guest Professors Honoraries Alumni (LinkedIn) #5qw Emanuel Sallinger Univ.Prof. Dipl.-Ing. Mag.rer.soc.oec. Dr.rer.soc.oec. Dr.techn. Research Focus Information Systems Engineering: 20% Logic and Computation: 80% Research Areas Computational Logic, Scalable Artificial Intelligence, Data Extraction and Integration, Reasoning, Knowledge Graph Management Systems, Reasoning in Knowledge Graphs, Knowledge-Based Systems, Scalable Reasoning, Database Theory, Databases, Scalable Systems, Knowledge Management, Database Systems, Knowledge Graphs, Artificial Intelligence, Complexity Theory About My current main research focus is on Knowledge Graphs, including all theoretical and practical aspects. In particular, I am interested in reasoning in such systems, including all of the AI methodologies for that (knowledge-based/logic-based reasoning and machine learning-based reasoning). Within such systems, my interest in achieving scalable solutions, making sure that theory translates into practice.More on this topic can be found at the website of the Knowledge Graph Lab (kg.dbai.tuwien.ac.at) at TU Wien, which I lead.More broadly, my research interests are on scalable knowledge-based information systems and artificial intelligence technologies, in particular on aspects touching both theory and practice. On the theoretical side, this includes the theory of scalable systems, logic, reasoning and complexity. On the practical side this includes database management systems, scalable database and information systems, and knowledge management platforms.For emails in my role of Vice Dean of Academic Affairs for Business Informatics and Data Science, please write primarily to <studiendekanat.informatik@tuwien.ac.at> mentioning that your request is for me, I can get back to you more quickly in that way. Roles Vice Dean of Academic Affairs Business Informatics Full Professor Databases and Artificial Intelligence, E192-02 Contact emanuel.sallinger@tuwien.ac.at +43-1-58801-192205 Favoritenstrasse 9, Room HD0313 vCard from TISS www.dbai.tuwien.ac.at/staff/sallinger Knowledge Graph Lab informatics.tuwien.ac.at/people/emanuel-sallinger tiss.tuwien.ac.at/person/38875 Courses 2025W Bachelor Thesis / 184.691 / PR Doctoral & Master Students Seminar / 181.223 / SE Generative AI / 194.207 / VU Interdisciplinary Project in Data Science / 194.147 / PR Introduction to Semantic Systems / 188.399 / VU Project in Computer Science 1 / 192.021 / PR Project in Computer Science 2 / 192.022 / PR Semi-structured Data / 192.041 / VU Seminar for Master Students in Data Science / 180.772 / SE 2026S Knowledge Graphs / 192.116 / VU Project in Computer Science 1 / 192.021 / PR Project in Computer Science 2 / 192.022 / PR Projects Enterprise Architecture Knowledge Graph for Learning and Exploration 2025 – 2028 / Austrian Research Promotion Agency (FFG) Knowledge Graph-driven Tour Management for Sustainable Waste Processing 2023 – 2025 / Vienna Science and Technology Fund (WWTF) Publications: 192603 / 192942 / 192932 / 193572 / 193568 / 195921 / 203905 / 221242 Scalable Reasoning in Knowledge Graphs 2020 – 2028 / Vienna Science and Technology Fund (WWTF) Publications: 138961 / 140863 / 176492 / 192603 / 192942 / 192932 / 193564 / 193572 / 192584 / 192767 / 193493 / 193571 / 193568 / 192843 / 195921 / 203905 / 210757 / 211306 / 210849 / 211126 / 210850 / 221116 / 221115 / 221114 / 221432 / 221242 / 221002 / 221003 / 221770 / 221005 / 221008 / 55579 / 55580 / 55637 / 55638 / 55676 / 55677 / 55678 / 58323 / 58592 / 58594 / 58719 / 58733 / 58736 / 58738 / 58739 / 58740 / 58742 / 58743 / 58744 Heterogenous Information Integration 2012 – 2017 / Austrian Science Fund (FWF) Publications: 140863 / 147106 / 149494 / 151064 / 53423 / 54796 / 54797 / 54799 / 54843 / 54848 / 54849 / 55397 / 55398 / 55399 / 55791 / 55901 / 55903 / 55976 / 56083 / 56094 / 56095 / 56096 / 56098 / 56099 / 56100 / 56102 / 56490 / 56541 / 56542 / 56544 / 56546 / 56547 / 56548 / 56550 / 56551 / 56661 / 56668 / 56671 / 56672 / 56673 / 56675 / 56676 / 56678 / 57034 / 57051 / 57055 / 57056 / 57057 / 57076 / 57077 / 57575 / 58807 / 58808 / 58809 / 58810 / 58811 / 58812 / 85949 / 86056 Service-Oriented Data Integration 2009 – 2013 / Vienna Science and Technology Fund (WWTF) Publications: 155421 / 155572 / 155674 / 155810 / 163519 / 163666 / 163815 / 166911 / 176218 / 52681 / 52725 / 52806 / 52812 / 53332 / 53335 / 53345 / 53444 / 53674 / 53675 / 53692 / 53702 / 53832 / 53891 / 53892 / 53894 / 54091 / 54149 / 54151 / 54169 / 54174 / 54585 / 54884 / 85030 / 85131 Publications 2026 Semantic-aware query answering with Large Language Models / Atzeni, P., Baldazzi, T., Bellomarini, L., Laurenza, E., & Sallinger, E. (2026). Semantic-aware query answering with Large Language Models. DATA & KNOWLEDGE ENGINEERING, 161, Article 102494. https://doi.org/10.1016/j.datak.2025.102494 Project: KnowledgeGraph (2020–2028) 2025 SpaceKG: Towards exploiting Knowledge Graphs in space systems / Patrignani, L., Laurenza, E., Sallinger, E., Vlad, A., & Gaudenzi, P. (2025). SpaceKG: Towards exploiting Knowledge Graphs in space systems. Acta Astronautica, 236, 967–981. https://doi.org/10.1016/j.actaastro.2025.07.007 Project: KnowledgeGraph (2020–2028) The Temporal Vadalog System / Bellomarini, L., Blasi, L., Nissl, M., & Sallinger, E. (2025). The Temporal Vadalog System. In 32nd International Symposium on Temporal Representation and Reasoning. 32nd International Symposium on Temporal Representation and Reasoning (TIME 2025), London, United Kingdom of Great Britain and Northern Ireland (the). Schloss Dagstuhl. https://doi.org/10.4230/LIPICS.TIME.2025.15 Project: KnowledgeGraph (2020–2028) Vadacode: A Logician-Friendly IDE for Datalog± / Bellomarini, L., Gentili, A., Magnanimi, D., & Sallinger, E. (2025). Vadacode: A Logician-Friendly IDE for Datalog±. Proceedings of the VLDB Endowment, 18(12), 5411–5414. https://doi.org/10.14778/3750601.3750684 Projects: KnowledgeGraph (2020–2028) / SustainGraph (2023–2025) Using ontologies to facilitate healthcare process mining and analysis / Dwyer, O. P., Chammas, L., Sallinger, E., & Davies, J. (2025). Using ontologies to facilitate healthcare process mining and analysis. Journal of Intelligent Information Systems. https://doi.org/10.1007/s10844-025-00942-8 Project: KnowledgeGraph (2020–2028) Proceedings of the 16th Alberto Mendelzon International Workshop on Foundations of Data Management (AMW 2024) / Montoya, G., Sallinger, E., & Vargas-Solar, G. (Eds.). (2025). Proceedings of the 16th Alberto Mendelzon International Workshop on Foundations of Data Management (AMW 2024) (Vol. 3954). ceur. Project: KnowledgeGraph (2020–2028) The Temporal Vadalog System: Temporal Datalog-Based Reasoning / Bellomarini, L., Blasi, L., Nissl, M., & Sallinger, E. (2025). The Temporal Vadalog System: Temporal Datalog-Based Reasoning. Theory and Practice of Logic Programming, 25(2), 168–196. https://doi.org/10.1017/S1471068425000018 Project: KnowledgeGraph (2020–2028) The extended EA ModelSet—a FAIR dataset for researching and reasoning enterprise architecture modeling practices / Glaser, P.-L., Sallinger, E., & Bork, D. (2025). The extended EA ModelSet—a FAIR dataset for researching and reasoning enterprise architecture modeling practices. Software and Systems Modeling, Article 111431. https://doi.org/10.1007/s10270-025-01278-1 Project: KnowledgeGraph (2020–2028) A Datalog Rewriting Algorithm for Warded Ontologies / Benedetto, D., Calautti, M., Hammad, H., Sallinger, E., & Vlad-Starrabba, A. (2025). A Datalog Rewriting Algorithm for Warded Ontologies. In Proceedings of the Thirty-Fourth International Joint Conference on Artificial Intelligence (pp. 4356–4364). https://doi.org/10.24963/ijcai.2025/485 Project: KnowledgeGraph (2020–2028) 2024 Template-based Explainable Inference over High-Stakes Financial Knowledge Graphs / Colombo, A., Baldazzi, T., Bellomarini, L., Sallinger, E., & Ceri, S. (2024). Template-based Explainable Inference over High-Stakes Financial Knowledge Graphs. In Advances in Database Technology - Volume 28 Proceedings 28th International Conference on Extending Database Technology (EDBT 2025) (pp. 503–515). OpenProceedings.org. https://doi.org/10.48786/edbt.2025.40 Project: KnowledgeGraph (2020–2028) INTEND: Human-Like Intelligence for Intent-Based Data Operations in the Cognitive Computing Continuum / Dautov, R., Song, H., Roman, D., Husom, E. J., Sen, S., Balionyte-Merle, V., Firmani, D., Leotta, F., Mathew, J. G., Rossi, J., Balzotti, L., Morichetta, A., Dustdar, S., Metsch, T., Frascolla, V., Khalid, A., Landi, G., Brenes, J., Toma, I., & Paulson, E. (2024). INTEND: Human-Like Intelligence for Intent-Based Data Operations in the Cognitive Computing Continuum. In A. Rula, E. Sallinger, O. Savkovic, I. Ciuciu, I. Toma, J. Xavier Parreira, R. Prodan, H. Song, & A. Soylu (Eds.), Companion Proceedings of the 8th International Joint Conference on Rules and Reasoning (RuleML+RR-Companion 2024). https://doi.org/10.34726/8579 Download: PDF (319 KB) Project: INTEND (2024–2026) “Please, Vadalog, tell me why”: Interactive Explanation of Datalog-based Reasoning / Baldazzi, T., Bellomarini, L., Ceri, S., Colombo, A., Gentili, A., & Sallinger, E. (2024). “Please, Vadalog, tell me why”: Interactive Explanation of Datalog-based Reasoning. In Proceedings 27th International Conference on Extending Database Technology (EDBT 2024) (pp. 834–837). OpenProceedings. https://doi.org/10.48786/edbt.2024.82 Download: PDF (2.52 MB) Project: KnowledgeGraph (2020–2028) Softening Ontological Reasoning with Large Language Models / Baldazzi, T., Benedetto, D., Bellomarini, L., Sallinger, E., & Vlad, A. (2024). Softening Ontological Reasoning with Large Language Models. In A. Rula, E. Sallinger, & O. Savkovic (Eds.), Companion Proceedings of the 8th I",
  "content_length": 47636,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:13"
}