{
  "name": "Emil Sekerinski",
  "homepage": "http://www.cas.mcmaster.ca/~emil",
  "status": "success",
  "content": "Emil Sekerinski Home Biography Publications Supervised Thesis Campus Directions Campus Map Emil Sekerinski ProfessorDepartment of Computing and Software, ITB 215McMaster University, 1280 Main Street West, Hamilton, Ontario, L8S 4L7(905) 525 9140 ext 27276 Office Hours Winter 2025/26: TBA, ITB 215 Recent Courses COMPSCI 2SD3 Concurrent Systems, Winter 25/26 COMPSCI 3TB3 / SFWRENG 4TB3 Syntax-based Tools and Compilers, Winter 25/26 CAS 781 Advanced Topics: Advanced Compiler Design and Optimization, Fall 25/26 CAS 707, Formal Specification Techniques, Winter 23/24 Recent Publications, Talks Hunt, A. and Sekerinski, E. Generating Implementations of Data Type Operations, 14th Workshop on Synthesis, SYNT 2025, July 2025. Yao, S. and Sekerinski, E. An Efficient Implementation of Guard-Based Synchronization for an Object-Oriented Programming Language, Workshop on Programming Language Approaches to Concurrency and Communication-cEntric Software, PLACES 2025, May 2025. Slides Sekerinski, E. On Concurrent Program Algebra and Demonic Automata, International Colloquium on Theoretical Aspects of Computing, ICTAC 2024, November 2024. Slides Sekerinski, E. and Zhou, T Formal Development of a Delay-Tolerant Multicast Protocol for Wireless Sensors, IFIP International Conference on the Internet of Things, IFIPIoT 2024, January 2025. Slides Guo, B. and Sekerinski, E. Simplified Algorithms for Order-Based Core Maintenance, May 2024 Guo, B. and Sekerinski, E. Parallel Order-Based Core Maintenance in Dynamic Graphs, International Conference on Parallel Processing, ICPP 2023, August 2023. Sekerinski, E. and Zhou, T. Democratizing Real-Time Water Quality Monitoring, GWF Finale, May 2023. Guo, B. and Sekerinski, E. Efficient parallel graph trimming by arc-consistency, The Journal of Supercomputing, April 2022. Fadhel, M. and Sekerinski, E. Striffs: Architectural component diagrams for code reviews, ICCQ 2021. Sekerinski, E. Programming in the Multi-Core Era, Revised 2020, talk first given at CAS 20 Years Celebration. Recent Conferences FMTea'24 (Co-Chair) ICTAC'24 (Program Committee) iFM'24 (Program Committee) iFM (Steering Committee) SEW-42 / IWCPS-9 (Program Committee) Last modified 2023-12-28 by Emil Sekerinski",
  "content_length": 2227,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:19"
}