{
  "name": "Emiliano De Cristofaro",
  "homepage": "https://emilianodc.com",
  "status": "success",
  "content": "About - Emiliano De Cristofaro Follow California, USA Email Google Scholar Bluesky LinkedInI’m a Professor at University of California, Riverside. I’m affiliated with the Department of Computer Science and Engineering and the RAISE Institute. From 2013 to 2023, I was at University College London (UCL), where I served as Director of the Academic Center of Excellence in Cyber Security Research (ACE-CSR) and Head of the Information Security Research Group (ISRG).In September 2023, I started the Security and Privacy Advanced research Lab (SPALab). I got my PhD from UC Irvine, advised by Gene Tsudik. While in grad school, I did internships at NEC in Heidelberg (2008), INRIA Rhone-Alpes (2009), and Nokia in Lausanne (2010). After graduating, I worked as a Research Scientist at Xerox PARC from 2011 to 2013.ResearchI am generally interested in impactful research in the broad Information Security field. Over the past few years, I have been focusing on trustworthy machine learning and socio-technical issues on the Web. My research has been published at top-tier conferences in security (IEEE S&P, NDSS, CCS, Usenix Security) and other fields, e.g., ICML, NeurIPS, WWW, IMC, SIGMETRICS, ICWSM, CSCW, etc.My co-authors and I have received best paper awards from IEEE S&P, NDSS, ACM CCS, ACM IMC, ACM CSCW, AAAI ICWSM, and ACM WebSci, the Data Protection by Design Award from the Catalan Data Protection authority, and were runners-up for CSAW Applied Research Competitions and the INRIA-CNIL Privacy Protection Award. In 2025, I was named Distinguished Member of the Association for Computing Machinery (ACM). In 2022 and 2024, I achieved the top-4 security “grand slam” (uh?).EducationPhD in Networked Systems, Sep 2011 University of California, Irvine Dissertation: Sharing Sensitive Information with PrivacyBSc in Computer Science, Jul 2005 University of Salerno, Italy Summa cum Laude, top 1% in graduating classPersonalI was born in Avellino, a small-ish town 40 miles east of Napoli surrounded by the mountains of the Irpinia region. Irpinia is known for its lush, green scenery and medieval castles, the glorious soccer team, hazelnuts, and black truffles, as well as some amazing wines like Taurasi, Fiano di Avellino, and Greco di Tufo.In my free time, I enjoy guerilla activism against pineapple and chicken on pizza. I love traveling, and I’m (kinda) fluent in English, French, and Italian, and can utter enough words to get into trouble in German, Spanish, and Persian. My name is ‘Emiliano’ (first name) + ‘De Cristofaro’ (last name). ‘De’ is not a middle name, so please don’t call me Mr/Dr/Prof. Cristofaro – it’d be like calling Robert De Niro ‘Robert Niro’ (“you talking to me?”).",
  "content_length": 2701,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:20"
}