{
  "name": "Emilio Ferrara",
  "homepage": "http://www.emilio.ferrara.name",
  "status": "success",
  "content": "HUMANS LAB – Emilio Ferrara (Professor of Computer Science at USC) & (HUmans | MAchines | Networks | Social Systems) Lab Emilio Ferrara is a Professor of Computer Science at the Thomas Lord Department of Computer Science (USC Viterbi), Communication (USC Annenberg), and Preventive Medicine (Keck School of Medicine of USC). He’s also a Principal Scientist at the University of Southern California‘s Information Sciences Institute, and Principal Investigator of the Machine Intelligence and Data Science (MINDS) group. The HUMANS LAB‘s research core is Humans & Machines + Networks & Social Systems and this is our team: Core HUMANS Lab Members Emilio Ferrara (PI, Professor) Luca Luceri(Lead Scientist, Research Asst. Prof.) Faith Baca(CS Ph.D.) Charles (Duke) Bickham(CS Ph.D.) Leonardo Blas(CS Ph.D.) Eun Cheol Choi(Comm Ph.D.) Priyanka Dey(CS Ph.D.) Patrick Gerard(CS Ph.D.) Bijean Ghafouri(PolSci Ph.D.) Bumju Jung(Comm Ph.D.) Gabby Pinto(CS Ph.D.) Daniel Ruiz(CS Ph.D.) Zituo Wang(Comm Ph.D.) Victoria Bingxin Xu(CS Ph.D.) Jinyi Ye(CS Ph.D.) Siyi Zhou(Comm Ph.D.) Ashwin Balasubramanian(CS MSc) Shreeya Chand(CS BSc) Shireen Chand(CS MSc) Isabel Epistelomogi(CS BSc) Collin Hargreaves(CS BSc) Daniel Jeong(CS MSc) Francesca Kubica (CS BSc) Grace Li(CS BSc) Allison Lim(CS BSc) Afrin Momin (CS BSc) Nicolo Naoni(CS BSc) Richard Peng(CS BSc) Peiran Qiu(CS BSc) Bryan Ramirez-Gonzalez(CS BSc) Tanishq Salkar(DS MSc) Diya Saraf(CS MSc) Chenning Sun(CDS MSc) Beverlyn Tsai(CS BSc) Christina You(CS BSc) Vito Zou(CS BSc) Alumni Hall of Fame Former Postdocs Alessandro Bessi Director AI R&DNextbit AI Homa Hosseinmardi Assistant ProfessorUCLA Goran MuricPrincipal ScientistInferLink Corp. Anna SapienzaAssistant ProfessorUniversity of Copenhagen Former PhD Students Adam Badawy Principal Data Scientist Capital One Alex BisbergAssistant ProfessorCalPoly SLO Herbert ChangAssistant ProfessorDartmouth Emily ChenPostdocUC Santa Cruz Ashok DebSenior LecturerWest Point Palash GoyalSenior Research Scientist Google Cloud AI Research Julie JiangResearch ScientistMeta Ryan HT KaoResearch ScientistAptima Akira MatsuiAssistant Professor Kobe University Karishma SharmaApplied Scientist Amazon Alex SpangherPostdoc Stanford Shen YanResearch ScientistMeta Yilei ZengSenior ScientistTencent Other Former Lab Members (only members with 1+ year of tenure in the lab) Samar HaiderPhD studentUniversity of Pennsylvania Ankith MohanPhD studentVirginia Tech Zihang Sky EPhD studentNorthwestern University Chiyu WeiPhD student Dartmouth College Huy Tran NghiemPhD studentUniversity of Maryland Liuliu ChenPhD studentUniversity of Melburne Divya ChoudharySenior Research Scientist Samsung Research Dhruv MathewMachine Learning Engineer Quantiphi Yifei Crystal ChenData ScientistFacebook Jaimin Patel👨‍💻 Founder & Builder 👨‍💻Caddi Jinhu Tony QiPhD Student at CUHK Vandana Sreenivasa RaoSearchSalesforce Nikhil JindalSDEAmazon Vikram MudaliarSDE II Amazon Aditya GuptaSDE IIAmazon Weiwei ZhengBig Data Developer Huawei Joyston MenesezSoftware DeveloperUSC School of Social Work Current Appointments Professor of Computer Science (USC Viterbi) (Office SAL 312). By courtesy: Prof. of Preventive Medicine (Keck at USC) and Communication (USC Annenberg) Principal Scientist at the USC’s Information Sciences Institute (Office #939 at ISI in Marina del Rey) Principal Investigator at the Machine Intelligence and Data Science research group and HUMANS Lab Director of the PhD program in Computer Science Associate Department Chair, Computer Science Research Resources The datasets adopted in my research on Social Networks are available on request. The WERW-Kpath algorithm to compute the Kpath Edge Centrality has been released. The CONCLUDE community detection algorithm has been released. The Python Data Scientist toolbox is a list of useful resources, tutorials, and libraries to proficiently use Python for Data Science. GenAI Against Humanity featured by the Montreal AI Ethics Institute December 6, 2023 Social approval prompts more online hate! Our lab’s latest work titled “Social Approval and Network Homophily as Motivators of Online Toxicity” was featured on The Conversation! The article discusses the phenomenon where the act of posting toxic messages on social media is driven by the attention and social approval that the poster receives from like-minded individuals. It suggests that receiving ‘likes’ […] December 5, 2023 Two members of our lab made the Forbes 30 under 30 list! Congratulations to Julie Jiang and Herbert Chang for this incredible accomplishment! December 3, 2023 The Intricacies and Ethical Challenges of Bias in Generative Language Models My latest work titled “Should ChatGPT be biased? Challenges and risks of bias in large language models” has been published on First Monday. In the current era of rapidly advancing artificial intelligence (AI) and machine learning (ML), generative language models like ChatGPT have become increasingly prevalent. These models, which can generate human-like text, have significant […] December 2, 2023 Video-chat about social media manipulation I recorded a podcast interview for @USCAnnenberg on my research career so far, starting from games and w/ highlights about ten years of research on social media manipulation, and the upcoming #Election2020 #ElectionTwitter October 23, 2020 Twitter bots for good, and information contagion! Our latest work, titled “Evidence of complex contagion of information in social media: An experiment using Twitter bots” was published in Plos One on September 22, 2017! In this study, in collaboration with Bjarke Mønsted, Piotr Sapieżyński, and Sune Lehmann from the Denmark Technical University (DTU), we studied the effects of deploying positive interventions on Twitter using […] September 27, 2017 Visit the 2024 Election Integrity Online initiative | Office: Ginsburg Hall 405G | Labs: 403H / 403J",
  "content_length": 5889,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:24"
}