{
  "name": "Emilio Tuosto",
  "homepage": "https://cs.gssi.it/emilio.tuosto",
  "status": "success",
  "content": "Emilio's web page Contact Professor GSSI 67100 L'Aquila (Italy) Viale Rendina, 28 Room P2-16 Office Hours: always keen to meet; just drop me an email to fix a meeting. email ['.'/'dot'] +39 0862 428 0312 Recent talks (full list here) Highlights COORDINATION 2024 The title says almost all. Search supports dynamic and semantic-based composition of services inplemented with different programming languages. June 19, 2024 Pisa A revised overview of quantitative techniques and behavioural types for the course on ‘Challenges and Perspectives of Formal Methods for Trustworthy Software’ - PhD seminars series (University of Pisa and IMT Scuola Alti Studi Lucca). May 16, 2024 Dagstuhl seminar 24051 An overview of quantitative techniques and behavioural types. January 29, 2024 Dagstuhl 2024 A 3-minutes presentation on current work. January 29, 2024 BehAPI GSSI is almost in :) ChorGram One of my favourtie hobbies CIRC Clément Aubert new project on concurrency in reversible computing Formal Methods Europe Site about FM in Europe GSSI seminars I’m organising the seminars at GSSI: contact me if you are interested to give a talk Recent stuff Projects Tools with Elvis Konjoh Selabi, Maurizio Murgia, and Antonio RavaraA coordination approach to distributed systems inspired by smart contractsData-aware coordination with Philipp Haller, Ayman Hussein, Hernán Melgratti, and Alceste ScalasAfter some discussion at Dagstuhl seminar n. 21372, we came up with promising ideas to implement join patternsAn new implementation of join patterns with Florian Wayan Aaron Furbach, Roland Kuhn, and Alceste ScalasWe are definition a compositional mechanism for the swarm protocols defined with Hernán and RolandCompositional swarm protocol We are using sequentialisation for precise race-detection in C-like programsData Races in C with Roland Kuhn and Hernán MelgrattiWe are defining a behavioural typing discipline grounded on local-first principles for P2P networks where peers communicate via event notificationBehavioural types for local-first principles with Agustín Martinez Suñé and Carlos Gustavo PomboWe are defining a dynamic logic indexed with choreographies for the analysis of non-functional properties of communicating systemsChoregraphies and QoS with Franco Barbanera and Ivan LaneseWe are setting an abstract framework for choreographies based on formal languagesChoregraphic automata and formal languages with Alex Coto and Roberto GuancialeModel-driven testing based on choreographies…a first step. We introduce admissible tests and show how to derive them from global specificationsChoregraphy-driven testing with Ugo de’Liguoro and Hernán MelgrattiWe want to equip choreographies with refinement mechanisms in order to enhance modular developmentRefinement of choreographies with Hernán MelgrattiWe advocate a different nature of behavioural specifications that concern more data- than control-flow of protocolsData-driven behavioural specifications DeLiCE: Decentralised Ledgers in Circular Economy PRIN PNRR BehAPI - Behavioural Application Program InterfacesSite leader and Work package leader (Marie Skłodowska-Curie Actions RISE, agreement No 778233, €742,500.00) (1/3/2018 to-date) Involvement in past projects Tool-chain for choreographic developmentChorGram An extension of ChorGram for QoS analysisMoCheQoS Partition refinement for history-dependent automataMIHDA An ad-hoc model checker for security protocols ASPASYA and H-ASPASYA Events Fun & not so fun stuff Concur (deadline: 26/4/2024) ICTCS 2024 (deadline: 2024/06/09) OOPSLA 2024 (deadline: 2024/04/05) DisCoTec (deadline: 2024/02/09) CAV24 (deadline: 2024/01/19) ECOOP 2024 (deadline: 2024/01/17) ETAPS 2024 (deadline: 2023/10/12) FM2024 (deadline: 15 and 19/4/2023) The InFM series, organised by the FME Industry Committee, is a series of talks in which industrial practitioners using Formal Methods in their development take the stage and offer some rare insights into the benefits and potential pitfalls of applying Formal Methods in their domain.InFM: Industry talks on Formal Methods The Story of a Journal Proposal: quoting Cristina: ‘If there’s any lesson to be learned from the ACM Publications Board’s policies on scientific publication is this: pay attention to their policies, then do the exact opposite.’Lopes’ view on conferences vs. journals in CS The title says it all, and probably such crimes are also committed outside the ‘systems’ communitySystems Benchmarking Crimes Publication pressureVardi’s view on publication pressure CS & societiesPhil’s Rogaway insightful lament about be carefulGlobalisation and research… Not so bad after allItalian research is not so bad after all This video is somehow related to researchKen Robinson’s view on education Playing with regular expressionsPuzzles & regex Enclosed is our latest version of Ms. #1996-02-22-RRRRR, that is the re-re-re-revised revision of our paper :))Frustrated authors Das KapitalLectures on Marx’s [Capital V. 1] by David Harvey Latest from eM October 09, 2025: Great event for Giangi! October 04, 2025: Working on Giangi's celebration July 03, 2025: Great week with Roberto Bruni around! June 20, 2025: discotec is almost over :( June 10, 2025: preparing for lille June 02, 2025: Nobuko Yoshida is visiting again! April 27, 2025: done with coordination and forte (almost) April 24, 2025: (https://www.sciencedirect.com/science/article/pii/S0304397525001859?dgcid=coauthor) April 08, 2025: Scince is joy...expecially when you have Franco Barbanera and Marco Carbone around! April 08, 2025: Chris got his PhD today!",
  "content_length": 5575,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:23"
}