{
  "name": "Emily Wall 0001",
  "homepage": "https://emilywall.github.io",
  "status": "success",
  "content": "Emily Wall - Emory CS I am an Assistant Professor in the Department of Computer Science at Emory University. My students and I make up CAV Lab where we focus on cognition and visualization. I completed my Ph.D. in Computer Science at Georgia Tech in 2020. Prospective students interested in working with me should first check out the CAV Lab manual and complete this interest form. My research involves decision making using data visualization and visual analytics. I develop computational strategies to characterize human limitations in decision making (e.g., cognitive bias) and design interventions to promote reflective data analysis and decision making processes. Learn More Upcoming Papers @ CHI 2025 April 2025. Mengyu Chen will present her paper A Novel Lens on Metacognition in Visualization and Shiyao Li will present his paper Confirmation Bias: The Double-Edged Sword of Data Facts in Visual Data Communication at CHI 2025! Data Poetics Event @ Atlanta Science Festival March 2025. Interested in data and/or poetry? Join us for Data Poetics at Supermarket ATL on March 13 @ 7pm as part of the Atlanta Science Festival. Upcoming Papers @ VIS 2024 October 2024. Mengyu Chen will present her paper Unmasking Dunning-Kruger Effect in Visual Reasoning & Judgment and Zhongzheng Xu will present his paper Exploring the Capability of LLMs in Performing Low-Level Visual Analytic Tasks on SVG Data Visualizations at IEEE VIS 2024! New Funded Projects Summer 2024. PI Wall received funding to work on a project titled \"Promoting Metacognition in Visual Analytics\". Information Visualization (CS 441 / 541) Spring 2025 (39 students) | Fall 2023; ASJ (36 students) | Fall 2022 (41 students) | Fall 2021 (26 students) Introduction to CS II (CS 171) Fall 2024 (23 students) Human-Computer Interaction (CS 485 / 584) Spring 2024 (29 students) | Spring 2023 (34 students) | Spring 2022 (40 students)",
  "content_length": 1896,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:24"
}