{
  "name": "Emily Whiting",
  "homepage": "http://cs-people.bu.edu/whiting/#",
  "status": "success",
  "content": "Emily Whiting Toggle navigation Publications CV Emily Whiting Associate Professor, Computer Science Department Director, Shape DeCo Lab | Co-Director, Computer Graphics Lab Boston University CONTACT Center for Computing & Data Sciences Rm 843, Dept of Computer Science Boston University 665 Commonwealth Avenue Boston MA 02215 whiting@bu.edu My research is in the area of computer graphics, with a focus on computational fabrication. My work is motivated by the way advancements in rapid prototyping technology are closing the gap between what we can simulate with computers and what we can build. The effect is rippling through industries from architecture to medicine where it is now possible to manufacture shapes of astounding complexity. Despite innovations in hardware, however, creating customized products that perform a specific function still depends on extensive expert knowledge. In my research I am developing computational tools that consider the full design to manufacturing pipeline, and are guided by the functionality of the objects being created. My research is a cross-pollination of digital geometry processing, engineering mechanics, and rapid prototyping, where the goal is to enable the design of functionally-valid and fabrication-ready real world objects. Bio I am an Associate Professor of Computer Science at Boston University, Director and Founder of the Shape Design & Computation Lab, and Co-Director of the BU Computer Graphics & HCI Lab. I am the recipient of the NSF CAREER Award (2021), Sloan Research Fellowship (2019), BU Innovation Career Development Professorship (2017), NSF CRII Award (2015), and Marie Curie/ETH Zurich Postdoctoral Fellowship (2012). Before joining BU I was an Assistant Professor at Dartmouth College. From 2011-2014 I was a Postdoctoral Fellow at ETH Zurich in the Interactive Geometry Lab with Olga Sorkine-Hornung. I received my PhD (2012) from MIT in Computer Graphics and Building Technology, advised by Frédo Durand and John Ochsendorf. I obtained my SM (2006) in Computational Design from the MIT Department of Architecture, and BASc (2004) in Engineering Science from the University of Toronto. For more information on publications, classes, recent news, and my team members, please visit the Shape DeCo Lab website: shape.bu.edu. News 07.30.2025 Zezhou Sun successfully defended his PhD 06.11.2025 Received unrestricted academic gift from Reality Labs Research, a division of Meta 03.31.2025 Xingjian Han successfully defended her PhD 01.27.2025 Serving on the SIGGRAPH 2025 Program Committee 06.01.2024 Serving on the UIST 2024 Program Committee 05.17.2024 Received a Teach Access Grant 04.01.2024 Serving as Program Co-Chair for Pacific Graphics 2024 Current Lab Members PhDZezhou Sun PhDSam Silverman PhDAbhinit Sati PhDAudrey Ballarin PhDRuichen Richard Liu Alumni PostdocXiaoting Zhang (now Senior Modeling Engineer at Roblox) PostdocChristos Mousas (now Assistant Professor at Purdue University) PhDXingjian Han PhDAthina Panotopoulou (now postdoc at University of Copenhagen) MSBenjamin Verdier (now at Onshape) MSJamie Nelson (now at Akamai Technologies) MSQiwei Zheng (now at Microsoft) MSLingfeng Wang (now at Uber) MSNook Harquail (now at Etsy) MSMarissa Allen UndergradEmilio Latorre UndergradStanley To - BU UROP, Kilichand Keystone program UndergradDennis Henneman (now at MathWorks) UndergradTammy Qiu - College Prize: BU College of Arts & Sciences (now PhD student at Columbia) UndergradAnthea Yichen Li - College Prize: BU College of Arts & Sciences, BU UROP Arts Initiative Summer Research Award (now PhD student at MIT) UndergradLiane Makatura - Dartmouth Presidential Scholar, Adobe Research Women-In-Technology Scholar, Fulbright Scholar (now PhD student at MIT) UndergradLily Xu - Dartmouth Presidential Scholar, Adobe Research Women-In-Technology Honorable Mention (now faculty at Columbia) UndergradAlex Weinberg - Dartmouth Presidential Scholar Recorded Talks TEDxBeaconStreet 2014 \"3D Printing - The Physics of Objects\" Youtube PBS NOVA: The Secret Life of Scientists & Engineers Season 2 Episode 14 PBS Theses Design Of Structurally-Sound Masonry Buildings Using 3D Static Analysis PhD Thesis, MIT 2011 Advisors: John Ochsendorf & Frédo Durand Geometric, Topological & Semantic Analysis of Multi-building Floor Plan Data MS Thesis, MIT Department of Architecture 2006 Supervisor: Seth Teller, Co-supervisor: Takehiko Nagakura, Reader: Axel Kilian Awarded MS Thesis Prize",
  "content_length": 4466,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:26"
}