{
  "name": "Emine Yilmaz",
  "homepage": "https://emineyilmaz.cs.ucl.ac.uk",
  "status": "success",
  "content": "Professor Emine Yilmaz's Home PageSearch this siteEmbedded FilesSkip to main contentSkip to navigationHome Professor EMINE YILMAZ Professor and Turing Fellow Department of Computer Science University College London Amazon Scholar Amazon                                                      Email: emine.yilmaz@ucl.ac.uk Office : UCL Centre for Artificial Intelligence                    90 High Holborn                   University College LondonShort BioI am a Professor and an EPSRC Fellow at University College London, Department of Computer Science. I am also a faculty fellow at the Alan Turing Institute and an ELLIS fellow. At UCL I am one of the faculty members affiliated with the UCL Centre for Artificial Intelligence, where I lead the Web Intelligence Group.I also work as an Amazon Scholar for Amazon, where I work with the Alexa Shopping team and am a co-founder of Humanloop, a UCL spinout company. My research interests lie in the fields of information retrieval and natural language processing. My research in these areas is mainly guided by principles from machine learning, statistics and information theory. I have authored more than 150 papers in these areas (> 6,250 citations, H-index = 39). I have received several awards for my research, including the Karen Sparck Jones Award, a Google Faculty Research Award and a Bloomberg Data Science Research Award. My research has been funded by several funding bodies including EU Horizon 2020, EPSRC, Alan Turing Institute, Google and Bloomberg and Elsevier. I have served in various senior roles, including co-editor-in-chief for the Information Retrieval Journal, a member of the editorial board for the AI Journal and an elected member of the executive committee for ACM SIGIR. I currently serve as an Associate Editor for ACM Transactions on Information Systems and am a member of the Steering Committee for ACM SIGIR Asia-Pacific. I have served in various roles including PC Chair for ACM SIGIR 2024 Perspectives Track, ACM SIGIR 2023 Industry Track (SIRIP), ACM CIKM 2022 Applied Track, ECIR 2020, ACM SIGIR 2018 and ACM ICTIR 2017 Conferences, Panels Chair for The Web Conference (WWW) 2021, Practice and Experience Chair for ACM WSDM 2017, and as the Doctoral Consortium Chair for ECIR 2017. Since 2019 I have been a co-organising the TREC Deep Learning Track, funded by the National Institute of Standards and Technology (NIST). Between 2015-2017 I co-organised the TREC Tasks Track.Please refer to my scholar page or DBLP for a list of publications.I am currently recruiting new PhD students and postdocs. Interested applicants with strong backgrounds in machine learning, probability and statistics are highly encouraged to contact me via email. Group MembersDr Xi Wang, Post-doc researcher (April 2022 - now)Wiem Ren Rim, PhD student (January 2024 - now)Bin Wu, PhD student (October 2023 - now)Varsha Ramineni, PhD student (October 2023 - now)Jordan Massiah, PhD student (January 2023 - now)Hossein Saeed Rahmani, PhD student (November 2022 - now)Yue Feng, PhD student (September 2020 - now)Fanghua Ye, PhD student (September 2019 - now) Previous PhD Students/Post-docsSahan Bulathwella, PhD student (October 2018 - 2022) [now Assistant Professor at UCL]Prochata Sen, Post-doc researcher (December 2021 - 2022) [now Assistant Professor at University of Liverpool]Ruizhe Li, Post-doc researcher (August 2021 - 2022) [now Assistant Professor at University of Aberdeen]Qiang Zhang, PhD student (October 2017 - 2021) [now Assistant Professor at Zhejiang University]Bhaskar Mitra, PhD student (February 2016 – 2021) [now Principal Researcher at Microsoft Research Cambridge]Jarana Manotumruksa, Post-doc researcher (April 2019 - 2020) [now Researcher at OneSpan] Andrew Burnie, PhD student, Turing Institute (September 2017 - 2020) [now Director at ActionAI]Aldo Lipani, Post-doc researcher (October 2018 - 2019) [now Assistant Professor at UCL]Rishabh Mehrotra, PhD student (February 2014 – 2018) [now Director at ShareChat]Manisha Verma, PhD student (November 2013 – 2017) [now Researcher at Amazon]Shangsong Liang, Post-doc researcher (May 2015 – 2017) [now Assistant Professor at Sun-yat-sen University]Latest NewsJune 2023 - Bloomberg will be funding some of our work through the Bloomberg PhD Data Science Fellowship programme.May 2023 - We have four papers accepted to the ACL 2023 Conference.March 2023 - I gave a keynote talk at the StatML Workshop.December 2022 - I gave a keynote talk at the Forty-second SGAI International Conference on Artificial Intelligence.November 2022 - Google is funding some of our work through a Google Research Award.October 2022 - I co-organised the Workshop on Proactive and Agent-Supported Information Retrieval.October 2022 - Our demo paper has been accepted to AAAI 2023.October 2022 - We have a paper accepted for the EMNLP 2022 Conference.September 2022 - I will be serving as a PC Chair for ACM CIKM 2023 Short Papers Track and as Industry Chair for ACM SIGIR 2023.July 2022 - Our work with PhD student Xiao Wu received the best student paper award at ACM ICTIR 2022.July 2022 - I gave a keynote talk at the ACM ICTIR 2022 Conference. July 2022 - We have a paper accepted to ACM SIGDial 2022.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5286,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:27"
}