{
  "name": "Emir Demirovic",
  "homepage": "http://emirdemirovic.com",
  "status": "success",
  "content": "Dr. Emir Demirović Dr. Emir Demirović Associate Professor of Computer Science, TU Delft, The Netherlands I lead the Constraint Solving (\"ConSol\") research group, where we design and implement combinatorial optimisation algorithms to solve a wide range of (real-world) problems. I am also the co-director of the Explainable AI in Transportation lab (\"XAIT\") as part of the Delft AI Labs. I received the Early Career Research Award 2025 from the Association of Constraint Programming, and have been recognised as an ELLIS Scholar by the European machine learning network. My research focus is on solving techniques based on constraint programming, dynamic programming approaches for optimising decision trees, and explainable combinatorial optimisation. I am also interested in the integration of optimisation and machine learning, complexity analysis of robust/resilient notions for combinatorial problems, and industrial applications. I publish in leading AI and ML conferences (e.g., AAAI, NeurIPS) and specialised venues (CP, CPAIOR). I have been invited to scientific events such as Dagstuhl seminars, Lorentz workshops, and a Simons-Berkeley programme. I enjoy organising both incoming and outgoing research visits (e.g., EPFL, ANITI/CNRS, CUHK, Monash University, TU Wien, NII/AIST Japan), and in general highly value collaboration with (inter)national researchers, e.g., co-authored papers with more than 40 researchers. In the past I participated in several algorithmic competitions, scoring first place, e.g., incomplete tracks of MaxSAT Evaluation 2018+, ROADEF/EURO 2012. Competitions serve as a good way of promoting my work beyond publications, e.g., Google OR-Tools adopted some of my ideas. Our approaches on optimising decision trees offer order-of-magnitude runtime improvements whilst support additional constraints. Prior to my appointment at TU Delft, I worked as postdoc at the University of Melbourne (2017-2020), received my PhD from the Vienna University of Technology in 2017, and in between these positions held shorter term posts at a production planning and scheduling company MCP (Vienna, Austria) and the National Institute of Informatics (Tokyo, Japan). Office: 4.E.400, Building 28 Email: e.demirovic@tudelft.nl Publications: Google Scholar Recent highlights Promoted to Associate Professor Early Career Research Award 2025 from the Association of Constraint Programming Invited to give a talk at the European Conference on AI (ECAI'25) Bronze medal in the Fixed Search track of the MiniZinc Challenge 2025 with our constraint programming solver Pumpkin NeurIPS 2023 and 2025 Spotlight papers Donald Knuth mentions our work on certificate generation for constraint programming as promising in his new book (Art of Computer Programming, Volumn 4, Fascicle 7)! Projects We work on both fundamental and applied research, and collaborate with civil engineering, QuTech, and industry. Projects with active funding Projects with reduced capacity Data Science specialised combinatorial optimisation algorithms for trustworthy machine learning, focussing on decision trees SAT/CP general-purpose optimisation techniques based on propositional logic and constraint programming Explainability methods that can provide human-understandable explanations in addition to good performance Applications solving real-world problems such as timetabling, scheduling, and production planning Integration with Machine Learning end-to-end learning with combinatorial problems (predict+optimise) Robust andBi-Objective theory and algorithms beyond conventional optimisation Warm Oscar Oscar is a decent man. He used to clean porches with pleasure. Warm Oscar Oscar is a decent man. He used to clean porches with pleasure. Warm Oscar Oscar is a decent man. He used to clean porches with pleasure. TEAM PhDs/Postdocs MSc/BSc Students Alumni (PhDs/Postdocs) Alumni (MSc/BSc Students) Jeff Smits Research Software Engineer Koos van der Linden PhD candidate, optimal decision trees Maarten Flippo PhD candidate, constraint programming Elif Arslan PhD candidate, ride-sharing, forecasting Konstantin Sidorov PhD candidate, explainable combinatorial optimisation Imko Marijnissen PhD candidate, scheduling for quantum Matthias Horn Postdoc (2022), scheduling Cesar van der Poel Core-guided search for constraint programming Robin Jansen Column generation for employee scheduling Robbin Baauw Conflict analysis for constraint programming Ana Tatabitovska MaxSAT Nevena Gincheva Train shunting with constraint programming Imko Marijnissen MaxSAT, now PhD student Angelos Zoumis Constraint Programming Bob Dorland Scheduling for Quantum Computers Heqi Wang Traffic Predictions Jeroen van Dijk SAT for Multi-Agent Path Finding Thomas Bos Explainable Predictive Maintainance Isha Dijcks Automating Puzzle Generation Andrea Nardi Graph Theory Zhiyi Chen (BSc honours) Algorithm Selection Sander Waij Multi-Agent Path Finding Yorick de Vries Reinforcement Learning for Logistics Maxim Marchal MaxSAT for Correlation Clustering Jens Langerak MaxSAT Max Ligtenberg Predictions for Intensive Care Bhavishya Palavali Algorithm Selection Funding Dutch national funding agency Delft AI Labs TU Delft VoestAlpine",
  "content_length": 5199,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:26"
}