{
  "name": "Emmanuela Orsini",
  "homepage": "https://cseao.github.io",
  "status": "success",
  "content": "Emmanuela Orsini As of February 2023, I am Tenure-Track Assistant Professor in the Department of Computing Sciences at Bocconi University . Before that, I I was a Research Expert in the Computer Security and Industrial Cryptography (COSIC) research group at KU Leuven, Belgium, and a Senior Research Associate in the Cryptography group University of Bristol, UK. I received my PhD in Mathematics and Statistics from University of Milano, and my master's degree in Mathematics from the University of Pisa. My research interests include theoretical and practical aspects of secure computation, practical zero-knowledge constructions, fully homomorphic encryption, post-quantum cryptography, algebraic coding theory and computational algebra. Contact details:Email: emmanuela[dot]orsini[at]unibocconi.it Address: Room 2-C2-03, Via G. Röntgen n. 1, Dept of Computing Sciences, Bocconi University, Milano Tel: +390258365621 Professional activities Leuven COED Days COED meetings Editorial Editorial board member: Mathematical Cryptology, Communications in Cryptology Program Committees I have served (or will serve) on the following program committees for conferences and workshops: - CRYPTO 2024 - EUROCRYPT 2023, CFAIL 2023, TPMPC 2023, ASIACRYPT 2023 - TCC 2022, CANS 2022 - ACM CCS 2021 , 4thZKProof Workshop , ASIACRYPT 2021 , WAHC 2021 (affiliated with ACM CCS), INDOCRYPT 2021 - TCC 2020 , SCN 2020 , PKC 2020 , WAHC 2020 (affiliated with ACM CCS) - WAHC 2019 (affiliated with ACM CCS), IMACC 2019 - SCN 2018 - CANS 2016 - MobiWis2015 Research activities NIST post-quantum standardization First Round Submission Nigel P. Smart, Martin R. Albrecht, Yehuda Lindell, Emmanuela Orsini, Valery Osheter, Kenny Paterson, Guy Peer LIMA: A PQC Encryption Scheme. Website Additional Round Two Contributor Erdem Alkim et al. NewHope: Post-quantum key encapsulation. Website Additional Call for PQ Digital Signatures C. Baum, L. Braun, C. de Saint Guilhem, M. Klooß, C. Majenz, S. Mukherjee, E. Orsini, S. Ramacher, C. Rechberger, L. Roy, P. Scholl FAEST Signature Algorithm. Website Publications More details about my publications can be found here Google Scholar and here DBLP Kelong Cong, Emmanuela Orsini, Erik Pohle, Oliver Zajonc Row Reduction Techniques for n-Party Garbling, CRYPTO 2025 Carsten Baum, Ward Beullens, Lennart Braun, Cyprien Delpech de Saint Guilhem, Michael Klooß, Shibam Mukherjee, Emmanuela Orsini, Sebastian Ramacher, Christian Rechberger, Lawrence Roy, Peter Scholl Shorter, Tighter, FAESTer: Optimizations and Improved (QROM) Analysis for VOLE-in-the-Head Signatures, CRYPTO 2025 Carsten Baum, Ward Beullens, Shibam Mukherjee, Emmanuela Orsini, Sebastian Ramacher, Christian Rechberger, Lawrence Roy, Peter Scholl One Tree to Rule Them All: Optimizing GGM Trees and OWFs for Post-Quantum Signatures, ASIACRYPT 2024 Vincenzo Botta, Michele Ciampi, Emmanuela Orsini, Luisa Siniscalchi, Ivan Visconti Black-Box (and Fast) Non-Malleable Zero Knowledge, CRYPTO 2024. Emmanuela Orsini, Riccardo Zanotto Simple Two-Round OT in the Explicit Isogeny Model, IACR Communications in Cryptology, Volume 1, Issue 1, 2024. Preprint available as (link). Lennart Braun, Cyprien Delpech de Saint Guilhem, Robin Jadoul, Emmanuela Orsini, Nigel P. Smart and Titouan Tanguy ZK-for-Z2K: MPC-in-the-Head Zero-Knowledge Proofs for Z_{2^k}, IMACC 2023. Mariana Gama, Emad Heydari Beni, Emmanuela Orsini, Nigel P. Smart, and Oliver Zajonc MPC With Delayed Parties Over Star-Like Networks , ASIACRYPT 2023. Preprint version (link). Carsten Baum, Lennart Braun, Cyprien Delpech de Saint Guilhem, Michael Klooß, Emmanuela Orsini, Lawrence Roy, and Peter Scholl Publicly Verifiable Zero-Knowledge and Post-Quantum Signatures From VOLE-in-the-Head , CRYPTO 2023. Preprint version (link). Michele Ciampi, Emmanuela Orsini, Luisa Siniscalchi, Four-Round Black-Box Non-Malleable Schemes from One-Way Permutations , TCC 2022. Preprint version ePrint Report 2022/1543. Carsten Baum, Robin Jadoul, Emmanuela Orsini, Peter Scholl, Nigel P. Smart, Feta: Efficient Threshold Designated-Verifier Zero-Knowledge Proofs, ACM CCS 2022 Preprint version ePrint Report 2022/082. Ilaria Chillotti, Emmanuela Orsini, Peter Scholl, Nigel Smart and Barry Van Leeuwen Scooby: Improved Multi-Party Homomorphic Secret Sharing Based on FHE, SCN 2022 . Cyprien Delpech de Saint Guilhem, Emmanuela Orsini, Titouan Tanguy, Michiel Verbauwhede Efficient Proof of RAM Programs from Any Public-Coin Zero-Knowledge System, SCN 2022 . Preprint available as ePrint Report 2022/313. C. Hazay, E. Orsini, P. Scholl, E. Soria-Vazquez TinyKeys: A New Approach to Efficient Multi-Party Computation , Journal of Cryptology (2022) , 35:13 p 1-66. S. S. Burra, E. Larraia, J. B. Nielsen, P. S. Nordholt, C. Orlandi, E. Orsini, P. Scholl, N. P. Smart High Performance Multi-Party Computation for Binary Circuits Based on Oblivious Transfer, Journal of Cryptology, (2021). Full version available as ePrint Report 2015/472 . Cyprien Delpech de Saint Saint Guilhem, Emmanuela Orsini, Titouan Tanguy Limbo: Efficient Zero-knowledge MPCitH-based Arguments, ACM CCS 2021. (eprint). Jan-Pieter D'Anvers, Emmanuela Orsini, Frederik Vercauteren Error Term Checking: Towards Chosen Ciphertext Security without Re-encryption, APKC 2021 . (eprint). Carsten Baum, Cyprien Delpech de Saint Guilhem, Daniel Kales, Emmanuela Orsini, Peter Scholl, Greg Zaverucha Banquet: Short and Fast Signatures from AES, PKC 2021 , 266-297. (eprint). Aner Ben-Efraim, Kelong Cong, Eran Omri, Emmanuela Orsini, Nigel P. Smart, Eduardo Soria-Vazquez Large Scale, Actively Secure Computation from LPN and Free-XOR Garbled Circuits. EUROCRYPT 2021. Full version available as eprint Report 2021/120 Karim Baghery, Cyprien Delpech de Saint Guilhem, Emmanuela Orsini, Nigel P. Smart, Titouan Tanguy Compilation of Function Representations for Secure Computing Paradigms , CT-RSA 2021, 26-50. Full version available as eprint Report 2021/195 Emmanuela Orsini Efficient, Actively Secure MPC with a Dishonest Majority: a Survey. WAIFI 2020 Cyprien Delpech de Saint Guilhem, Emmanuela Orsini, Christophe Petit, Nigel P. Smart Semi-Commutative Masking: A Framework for Isogeny-based Protocols, with an Application to Fully Secure Two-Round Isogeny-based OT. CANS 2020 Full version available as eprint Report 2018/648 Carsten Baum, Emmanuela Orsini, Peter Scholl, Eduardo Soria-Vazquez Efficient Constant-Round MPC with Identifiable Abort and Public Verifiability, CRYPTO 2020 Full version available as eprint Report 2020/767 Emmanuela Orsini, Nigel P. Smart, Frederik Vercauteren Overdrive2k: Efficient Secure MPC over Z_2k from Somewhat Homomorphic Encryption, CT-RSA 2020 . Full version available as eprint Report 2019/153 Abdelrahaman Aly, Emmanuela Orsini, Dragos Rotaru, Nigel Smart, Tim Wood Zaphod: Efficiently Combing LSSS and Garbled Circuits in SCALE , WAHC@CCS 2019. Cyprien Delpech de Saint Guilhem, Lauren De Meyer, Emmanuela Orsini, Nigel P. Smart BBQ: Using AES in Picnic Signatures , SAC 2019. Full version available as eprint Report 2019/781 Carmit Hazay, Emmanuela Orsini, Peter Scholl, Eduardo Soria-Vazquez Concretely Efficient Large-Scale MPC with Active Security (or, TinyKeys for TinyOT) , ASIACRYPT 2018 . Full version available as eprint Report 2018/843 Carmit Hazay, Emmanuela Orsini, Peter Scholl, Eduardo Soria-Vazquez Efficient MPC from Syndrome Decoding (or: Honey, I Shrunk the Keys) , CRYPTO 2018 . Full version available as eprint Report 2018/208 Martin R. Albrecht, Emmanuela Orsini, Kenneth G. Paterson, Guy Peer, Nigel P. Smart. Tightly Secure Ring-LWE Based Key Encapsulation with Short Ciphertexts , ESORICS 2017. Full version available as eprint Report 2017/354. Marcel Keller, Emmanuela Orsini, Dragos Rotaru, Peter Scholl, Eduardo Soria- Vazquez and Srinivas Vivek. Faster Secure Multi-Party Computation of AES and DES Using Lookup Tables . ACNS 2017. Full version availaible as eprint Report 2017/378. Fabrizio Caruso, Emmanuela Orsini, Massimiliano Sala, Claudia Tinnirello On the shape of the general error locator polynomial for cyclic codes. In IEEE Transactions on Information Theory, 63(6): 3641-3657, 2017. Full version available as Arxiv 1502.02927. Michele Orrù, Emmanuela Orsini, Peter Scholl Actively Secure 1-out-of-N OT Extension with Application to Private Set Intersection , CT-RSA 2017. Full version availaible as eprint Report 2016/933. Emmanuela Orsini, Joop van de Pol, Nigel P. Smart Bootstrapping BGV Ciphertexts with a Wider Choice of p and q , IET Information Security (invited), Volume 10, Issue 6, p. 348-357, November 2016. Marcel Keller , Emmanuela Orsini, Peter Scholl MASCOT: Faster Malicious Arithmetic Secure Computationwith Oblivious Transfer , ACM CCS 2016. Full version availaible as eprint Report 2016/505. Carsten Baum, Emmanuela Orsini, Peter Scholl Efficiently Secure Multiparty Computation with identifiable abort, TCC 2016. Full version available as ePrint Report 2016/187. Ashish Choudhury, Emmanuela Orsini, Arpita Patra, Nigel P. Smart Linear Overhead Robust MPC with Honest Majority Using Preprocessing, SCN 2016. Full version available as ePrint Report 2015/705 . Tore Kasper Frederiksen, Marcel Keller, Emmanuela Orsini, Peter Scholl A Unified Approach to MPC with Preprocessing using OT, ASIACRYPT 2015(1). Full version available as ePrint Report 2015/901. Marcel Keller, Emmanuela Orsini, Peter Scholl Actively Secure OT Extension with Optimal Overhead , CRYPTO(1) 2015. Full version available as ePrint Report 2015/646 . Emmanuela Orsini, Joop van de Pol, Nigel P. Smart Bootstrapping BGV Ciphertexts with a Wider Choice of p and q , PKC 2015. Full version available as ePrint Report 2014/408. Enrique Larraia, Emmanuela Orsini, Nigel P. Smart Dishonest Majority Multi-Party Computation for Binary Circuits , CRYPTO 2014. Full version available as ePrint Report 2014/101 . Ashish Choudhury, Jake Loftus, Emmanuela Orsini, Arpita Patra, Nigel P. Smart Between a Rock and a Hard Place: Interpolating between ",
  "content_length": 14210,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:33"
}