{
  "name": "Emmanuel Abbe",
  "homepage": "https://people.epfl.ch/emmanuel.abbe",
  "status": "success",
  "content": "Emmanuel Abbé — People - EPFL Emmanuel Abbé Editer le profil Professeur ordinaire emmanuel.abbe@epfl.ch +41 21 693 20 78 https://sma.epfl.ch/~abbe Professeur ordinaire, Chaire de mathématiques de la science des données (SB/IC) EPFL SB MATH MDS1 MA C2 543 (Bâtiment MA) Station 8 1015 Lausanne +41 21 693 20 78 +41 21 693 25 50 Local: MA C2 543 EPFL > SB > MATH > MDS1 Web site: Site web: https://mds.epfl.ch/ Professeur ordinaire, Laboratoire de mathématique de la science des données (IC/SB) EPFL IC IINFCOM MDS2 INR 112 (Bâtiment INR) Station 14 1015 Lausanne +41 21 693 20 78 Local: INR 112 EPFL > IC > IINFCOM > MDS2 Professeur ordinaire, SMA - Enseignement EPFL > SB > SB-SMA > SMA-ENS Web site: Site web: https://sma.epfl.ch/ Professeur ordinaire, SSC - Enseignement EPFL > IC > IC-SSC > SSC-ENS Web site: Site web: https://ssc.epfl.ch Professeur ordinaire, SIN - Enseignement EPFL > IC > IC-SIN > SIN-ENS Web site: Site web: https://sin.epfl.ch vCard Données administratives Mission Chair of Mathematical Data Science (SB/IC) The research in the chair of Mathematical Data Science (MDS) focuses on the mathematical principles that underpin the analysis and design of information and data science technologies. As branches of mathematics, this involves probability, statistics, and discrete mathematics, and as specific fields, machine learning and information theory.  Please consult http://deepfoundations.ai/ for postdoc applications. Biographie Emmanuel Abbe received his Ph.D. degree from the EECS Department at the Massachusetts Institute of Technology (MIT) in 2008, and his M.S. degree from the Department of Mathematics at the Ecole Polytechnique Fédérale de Lausanne in 2003. He was at Princeton University as an assistant professor from 2012-2016 and an associate professor from 2016, jointly in the Program for Applied and Computational Mathematics and the Department of Electrical Engineering, as well an associate faculty in the Department of Mathematics at Princeton University since 2016. He joined EPFL in 2018 as a Full Professor, jointly in the Mathematics Institute and the School of Computer and Communication Sciences, where he holds the Chair of Mathematical Data Science.  He is the recipient of the Foundation Latsis International Prize, the Bell Labs Prize, the NSF CAREER Award, the Google Faculty Research Award, the Walter Curtis Johnson Prize, the von Neumann Fellowship from the Institute for Advanced Study, the IEEE Information Theory Society Paper Award, and a co-recipient of the Simons-NSF Mathematics of Deep Learning Collaborative Research Award.  Prof. E. Abbe is also a Global Expert at the Geneva Science and Diplomacy Anticipator (GESDA), a member of the Steering Committee of the Center for Intelligent Systems (CIS), EPFL, and director interim of the College des Sciences, EPFL. Show more Publications Sélection de publications E. Abbe, S. Li, A. SlyFOCS'21 Proof of the Contiguity Conjecture and Lognormal Limit for the Symmetric Perceptron E. Abbe, P. Kamath, E. Malach, C. Sandon, N. SrebroNeurIPS'21 Spotlight On the power of differentiable learning versus PAC and SQ learning E. Abbe, E. Boix-Adsera, M. Brenner, G. Bresler, D. NagarjNeurIPS'21 The staircase property: how hierarchical structure can guide deep learning E. Abbe, E. Cornacchia, Y. Gu, Y. PolyanskiyCOLT'21 Best Student Paper Award Stochastic block model entropy and broadcasting on trees with survey E. Malach, P. Kamath, E. Abbe, N. SrebroICML'21 Quantifying the Benefit of Using Differentiable Learning over Tangent Kernels A. Asadi, E. Abbe Maximum Multiscale Entropy and Neural Network Regularization E. Abbe, J. Fan, K. Wang An l_p theory of PCA and spectral clustering E. Abbe, S. Li, A. Sly Learning sparse graphons and the generalized Kesten-Stigum Threshold E. Abbe, C. Sandon Polytime universality and limitations of deep learning E. Abbe, A. Shpilka, M. YeInformation Theory Trans. Reed-Muller codes: theory and algorithms, E. Abbe, C. SandonNeurIPS 20 On the universality of deep learning E. Abbe, M. YeFOCS 19 Reed-Muller codes polarize Min Ye, Emmanuel AbbeISIT 19 Recursive projection-aggregation decoding of Reed-Muller codes Amir R. Asadi, Emmanuel AbbeJMLR Chaining Meets Chain Rule: Multilevel Entropic Regularization and Training of Neural Nets Emmanuel Abbe, Enric Boix-AdseràISIT 19 Subadditivity Beyond Trees and the Chi-Squared Mutual Information E. Abbe, E. Boix, P. Ralli, C. SandonSIAM Journal on Mathematics of Data Science Graph powering and spectral robustness E. Abbe, E. BoixAnnals of Applied Probability An Information-Percolation Bound for Spin Synchronization on General Graphs A. Asadi, E. Abbe, S. VerduNIPS 18 Chaining mutual information and tightening generalization bounds E. Abbe, L. Massoulié, A. Montanari, A. Sly, N. SrivastavaMathematical Statistics and Learning (MSL) 18 Group syncrhonization on grids M. Ye, E. AbbeICML 18 Communication-computation efficient gradient coding A. Sankararaman, E. Abbe, F. BaccelliInformation and Inference: A Journal of the IMA Community Detection on Euclidean Random Graphs E. Abbe, T. Bandory, W. Leeb, J. Pereira, N. Sharon, A. SingerInformation Theory Trans. Multireference alignment is easier with an aperiodic translation distribution E. Abbe, J. Fan, K. Wang, Y. ZhongAnnals of Statistics Entrywise eigenvector analysis of random matrices of low expected rank E. Abbe, S. Kulkarni, E. LeeJMLR Generalized nonbacktracking bounds on the influence E. AbbeJMLR Community detection and stochastic block models: recent development E. Abbe, S. Kulkarni, E. LeeNIPS 17 Nonbacktracking bounds on the influence in cascade models E. Abbe, J. Pereira, A. SingerISIT 16 Sample complexity of the Boolean multireference alignment problem E. Abbe, C. SandonCPAM Proof of the achievability conjectures in the general stochastic block model E. Abbe, C. SandonNIPS 16 oral Detection in the stochastic block model with multiple clusters: proof of the achievability conjectures, acyclic BP, and the information-computation gap E. Abbe, C. SandonNIPS 15 Recovering communities in the general stochastic block model without knowing the parameters E. Abbe, C. SandonFOCS 15 Community detection in the general stochastic block model: fundamental limits and efficient recovery algorithms E. Abbe, A. Shpilka, A. WigdersonSTOC 15 Reed-Muller codes for random erasures and erros Y. Desphande, E. Abbe, A. MontanariJournal Information and Inference: A Journal of the IMA Asymptotic mutual information for the balanced binary SBM E. Abbe, Y. WigdersonISIT 15 High-girth matrices and polarization E. Abbe, A. Bandeira, G. HallInformation Theory Trans. Exact recovery in the stochastic block model E. Abbe, N. Alon, A. BandeiraISIT 14 Linear Boolean classification, coding and \"the critical problem\" E. Abbe, A. Bandeira, A. Bracher, A. SingerTransactions on Network Science and Eng. Decoding graph labels from censored correlations: phase transition and efficient recovery E. Abbe, A. MontanariJournal Theory of Computing Conditional random fields, planted constraint satisfaction and entropy concentration E. Abbe, A. MontanariRandom Structures and Algorithms On the concentration of the number of solutions of random satisfiability formulas N. Goela, E. Abbe, M. GastparInformation Theory Trans. Polar codes for broadcast channels E. Abbe, A. Khandani, A. W. LoAmerican Economical Review (AER) Privacy-preserving methods in systemic risk Show more Enseignement & Phd Enseignement Mathematics Communication SystemsComputer Science Doctorants Pushkin Denys, Senouf Ortal Yona, Shashkov Vladyslav, A dirigé les thèses EPFL de Cornacchia Elisabetta , Lotfi Jandaghi Aryo , close Liste complète des adresses et fonctions EPFL SB MATH MDS1 Professeur ordinaire Statut:  Personnel EPFL SB MATH MDS1 MA C2 543 (Bâtiment MA) Station 8 1015 Lausanne +41 21 693 20 78 +41 21 693 25 50 Local: MA C2 543 EPFL > SB > MATH > MDS1 EPFL IC IINFCOM MDS2 Professeur ordinaire Statut:  Personnel EPFL IC IINFCOM MDS2 INR 112 (Bâtiment INR) Station 14 1015 Lausanne +41 21 693 20 78 Local: INR 112 EPFL > IC > IINFCOM > MDS2 EPFL SB SB-SMA SMA-ENS Professeur ordinaire Statut:  Personnel EPFL > SB > SB-SMA > SMA-ENS EPFL IC IC-SSC SSC-ENS Professeur ordinaire Statut:  Personnel EPFL > IC > IC-SSC > SSC-ENS EPFL IC IC-SIN SIN-ENS Professeur ordinaire Statut:  Personnel EPFL > IC > IC-SIN > SIN-ENS",
  "content_length": 8357,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:32"
}