{
  "name": "Emmanouil Pountourakis",
  "homepage": "https://drexel.edu/cci/about/directory/P/Pountourakis-Emmanouil",
  "status": "success",
  "content": "Emmanouil Pountourakis | Drexel CCI Skip to main content Emmanouil PountourakisAssistant ProfessorComputer Science Phone215.895.0503Emailep556@drexel.eduWebsite(s)cs.drexel.edu/~ep556 Emmanouil PountourakisAssistant ProfessorComputer ScienceBiographyEmmanouil Pountourakis, PhD is an assistant professor of computer science at the College of Computing & Informatics (CCI) at Drexel University. Prior to joining Drexel's faculty, Pountourakis was a postdoctoral fellow in the Wireless Network and Communications Group at University of Texas at Austin and a research fellow for the Spring 2018 Real Time Decision Making program at the Simons Institute for the Theory of Computing. He earned his PhD in 2017 in the Theory group at Northwestern University, and is completing a post doc at the University of Texas at Austin. His research focus is primarily in algorithmic game theory.Research AreasAI, Machine Learning, and RoboticsTheoretical Foundations of Computer ScienceResearch InterestsAlgorithmic mechanism designAcademic Distinctions PhD in Computer Science, Northwestern University Postgraduate Diploma in Informatics & Telecommunications, University of Athens CV Select Publications Evdokia Nikolova, Emmanouil Pountourakis, and Ger Yang “Optimal Mechanism Design with Risk-Loving Agents”. To appear in Conference in Web and Internet Economics (WINE 2018) Shuchi Chawla, Kira Goldner, Benjamin Miller, and Emmanouil Pountourakis “Aversion to Uncertainty and Its Implications for Revenue Maximization”. Symposium on Discrete Algorithms (SODA 2018) Nicole Immorlica, Brendan Lucier, Emmanouil Pountourakis, and Sam Taggart “Repeated Sales with Multiple Strategic Buyers ”. Economics and Computation (EC 2017) Nick Gravin, Nicole Immorlica, Brendan Lucier, and Emmanouil Pountourakis. “Procrastination with variable present bias”. Economics and Computation (EC 2016) Saeed Alaei, Jason Hartline, Rad Niazadeh, Emmanouil Pountourakis and Yang Yuan.“Optimal Auctions vs. Anonymous Pricing”. Foundations of Computer Science (FOCS 2015) Journal version to appear in the Special Issue of Games of Economic Behavior (GEB 2018) Emmanouil Pountourakis and Guido Sch ̈afer. “Mechanisms for Hiring a Matroid Base without Money”. Symposium on Algorithmic Game Theory (SAGT 2014). Georgios Askalidis, Nicole Immorlica, Augustine Kwanashie, David Manlove, Emmanouil Pountourakis. “Socially Stable Matchings in the Hospitals/Residents Problem.” Workshop on Algorithms and Data Structures (WADS 2013). Eric Angel, Evripidis Bampis, Alexander Kononov, Dimitris Paparas, Emmanouil Pountourakis, Vassilis Zissimopoulos. “Clustering on k-Edge-Colored Graphs”. International Symposioum on Mathematical Foundations of Computer Science (MFCS 2013). Nicole Immorlica and Emmanouil Pountourakis. “On Budget-Balanced Group-Strategyproof Cost-Sharing Mechanisms”. Workshop on Internet Economics (WINE 2012). Awards & Recognition Murphy Fellowship, Northwestern University, 2010 - 2011 Zoi Soutsou Fellowship, University of Athens, 2008 - 2009",
  "content_length": 3019,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:29"
}