{
  "name": "Emma Liying Li",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/emmali",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Emma Li Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffEmma LiMr Ethan KellyZhen Tian Dr Emma Li Senior Lecturer (School of Computing Science) telephone: 01413304484 email: Liying.Li@glasgow.ac.uk S103 Lilybank Gardens,, Glasgow,, Scotland, G12 8RZ Import to contacts https://orcid.org/0000-0003-4200-0669 Biography Dr Emma Li is a Senior Lecturer in Responsible & Interactive Artificial Intelligence at the School of Computing Science, a supervisor of the UKRI Centre for Doctor Training in Socially Intelligent Artificial Agents (Social AI CDT), and an affiliated staff at School of Engineering. Before joining University of Glasgow, she was a senior lecturer at Northumbria University at Newcastle, UK. She leads the Interactive and Trustworthy AI lab working on human-robot interaction and cyber security. Our research goal is to accelerate human-robot partnership into industry and society. She has successfully delivered 6 projects and published 50 peer reviewed papers. Her recent work on robot behaviour-based user authentication received a best workshop paper award in IEEE INFOCOM 2021. Her lab has access to the state-of-the-art industrial tele-robotic arm platform (e.g., Franka Emika and UR3e/UR5e Robots) and mobile robot platform (e.g., HUSKY and Jackal unmanned ground vehicles) at University of Glasgow. She is interested in data-driven AI design and experiments in robotics systems for a variety of applications, e.g., social & health care, industry, service, etc. Service She is a peer review college member for EPSRC. She leads the school Understandable Autonomous Systems Theme, which covers a wide range of technologies to ensure that developed autonomous systems are transparent, safe and trustworthy. Google Scholar Page: https://scholar.google.com/citations?user=kaDrMqwAAAAJ&hl=en Research interests Research interests: HCI and Human-robot interaction for a variety of applications, e.g., social & health care, industry, service, etc. The goal is to accelerate human-robot partnership into industry and society. Privacy protection and trustworthy robotic system using behaviour biometrical information to enhance the trust between human and robots/IoT devices. Research groupsGlasgow Systems Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015Number of items: 32.2025 Yu, Rongyu, Chen, Kan, Deng, Zeyu, Wang, Chen, Kizilkaya, Burak ORCID: https://orcid.org/0000-0002-7429-7527 and Li, Emma ORCID: https://orcid.org/0000-0003-4200-0669 (2025) Haptic-Based User Authentication for Tele-robotic System. In: 2025 34th IEEE International Conference on Robot and Human Interactive Communication (RO-MAN), Eindhoven, the Netherlands, 25-29 August 2025, (Accepted for Publication) Diao, Yufeng, Zhang, Yichi, De Martini, Daniele, Zhao, Philip Guodong ORCID: https://orcid.org/0000-0002-9920-8244 and Li, Emma Liying ORCID: https://orcid.org/0000-0003-4200-0669 (2025) Task-oriented co-design of communication, computing, and control for edge-enabled industrial cyber-physical systems. IEEE Journal on Selected Areas in Communications, (doi: 10.1109/JSAC.2025.3574605) (Early Online Publication) Xu, Xiangmin, Meng, Zhen, Li, Emma ORCID: https://orcid.org/0000-0003-4200-0669, Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200, Zhao, Philip G. and Bretin, Robin ORCID: https://orcid.org/0000-0003-2918-1901 (2025) Understanding Dynamic Human-Robot Proxemics in the Case of Four-Legged Canine-Inspired Robots. In: 2025 IEEE International Conference on Robotics and Automation, Atlanta, GA, USA, 19-23 May 2025, pp. 7808-7814. ISBN 9798331541392 (doi: 10.1109/ICRA55743.2025.11128622) Yang, Jiaming, Meng, Zhen, Xu, Xiangmin, Chen, Kan, Li, Emma Liying ORCID: https://orcid.org/0000-0003-4200-0669 and Zhao, Philip G. (2025) Task-Oriented Edge-Assisted Cooperative Data Compression, Communications and Computing for UGV-Enhanced Warehouse Logistics. In: IEEE Consumer Communications & Networking Conference, Las Vegas, NV, USA, 10–13 January 2025, ISBN 9798331508050 (doi: 10.1109/CCNC54725.2025.10976157) Yu, Rongyu, Kizilkaya, Burak ORCID: https://orcid.org/0000-0002-7429-7527, Meng, Zhen, Li, Emma ORCID: https://orcid.org/0000-0003-4200-0669 and Zhao, Philip (2025) Robot adversarial attack on keystroke dynamics based user authentication system. IEEE Robotics and Automation Letters, 10(5), pp. 4850-4857. (doi: 10.1109/LRA.2025.3550727) Diao, Yufeng, Zhang, Yichi, She, Changyang, Zhao, Philip Guodong ORCID: https://orcid.org/0000-0002-9920-8244 and Li, Emma Liying ORCID: https://orcid.org/0000-0003-4200-0669 (2025) Aligning Task- and Reconstruction-Oriented Communications for Edge Intelligence. IEEE Journal on Selected Areas in Communications, (doi: 10.1109/JSAC.2025.3559121) (Early Online Publication) 2024 Ghosh, Bishal, Li, Emma ORCID: https://orcid.org/0000-0003-4200-0669 and Guha, Tanaya ORCID: https://orcid.org/0000-0003-2167-4891 (2024) Active Listener: Continuous Generation of Listener’s Head Motion Response in Dyadic Interactions. In: IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2025), Hyderabad, India, 6-11 April 2025, ISBN 9798350368741 (doi: 10.1109/ICASSP49660.2025.10889429) Avogaro, Andrea, Toaiari, Andrea, Cunico, Federico, Xu, Xiangmin, Dafas, Haralambos, Vinciarelli, Alessandro ORCID: https://orcid.org/0000-0002-9048-0524, Li, Emma ORCID: https://orcid.org/0000-0003-4200-0669 and Cristani, Marco (2024) Exploring 3D Human Pose Estimation and Forecasting from the Robot’s Perspective: The HARPER Dataset. In: IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2024), Abu Dhabi, UAE, 14-18 Oct 2024, pp. 5828-5835. ISBN 9798350377705 (doi: 10.1109/IROS58592.2024.10802238) Dafas, Haralambos, Li, Emma ORCID: https://orcid.org/0000-0003-4200-0669 and Cross, Emily (2024) Walking the Line: Assessing the Role of Gait in a Quadruped Robot’s Perception. In: 33rd IEEE International Conference on Robot and Human Interactive Communication (RO-MAN 2024), Pasadena, California, USA, 26-30 Aug 2024, pp. 1339-1345. ISBN 9798350375022 (doi: 10.1109/RO-MAN60168.2024.10731163) 2023 Yu, Rongyu, Kizilkaya, Burak ORCID: https://orcid.org/0000-0002-7429-7527, Meng, Zhen, Li, Emma ORCID: https://orcid.org/0000-0003-4200-0669, Zhao, Guodong ORCID: https://orcid.org/0000-0002-9920-8244 and Imran, Muhammad ORCID: https://orcid.org/0000-0003-4743-9136 (2023) Robot Mimicry Attack on Keystroke-Dynamics User Identification and Authentication System. In: 2023 IEEE International Conference on Robotics and Automation (ICRA), London, UK, 29 May - 02 Jun 2023, pp. 9879-9884. ISBN 9798350323658 (doi: 10.1109/ICRA48891.2023.10161423) 2022 Huang, Long, Meng, Zhen, Deng, Zeyu, Wang, Chen, Li, Liying ORCID: https://orcid.org/0000-0003-4200-0669 and Zhao, Guodong ORCID: https://orcid.org/0000-0002-9920-8244 (2022) Toward verifying the user of motion-controlled robotic arm systems via the robot behavior. IEEE Internet of Things Journal, 9(22), pp. 22422-22433. (doi: 10.1109/JIOT.2021.3121623) 2021 Huang, Long, Mengy, Zhen, Deng, Zeyu, Wang, Chen, Li, Emma ORCID: https://orcid.org/0000-0003-4200-0669 and Zhao, Guodong ORCID: https://orcid.org/0000-0002-9920-8244 (2021) Extracting Human Behavioral Biometrics From Robot Motions. 27th Annual International Conference on Mobile Computing and Networking (MobiCom 2021), New Orleans, USA, 31 Jan-4 Feb 2021. (Accepted for Publication) Chang, Bo, Li, Liying ORCID: https://orcid.org/0000-0003-4200-0669, Zhao, Guodong ORCID: https://orcid.org/0000-0002-9920-8244, Chen, Zhi and Imran, Muhammad Ali ORCID: https://orcid.org/0000-0003-4743-9136 (2021) Autonomous D2D transmission scheme in URLLC for real-time wireless control systems. IEEE Transactions on Communications, 69(8), pp. 5546-5558. (doi: 10.1109/TCOMM.2021.3075680) Huang, Long, Meng, Zhen, Deng, Zeyu, Wang, Chen, Li, Liying ORCID: https://orcid.org/0000-0003-4200-0669 and Zhao, Guodong ORCID: https://orcid.org/0000-0002-9920-8244 (2021) Robot Behavior-Based User Authentication for Motion-Controlled Robotic Systems. In: WiSARN 2021: International Workshop on Wireless Sensor, Robot and UAV Networks, 10 May 2021, ISBN 9781665447140 (doi: 10.1109/INFOCOMWKSHPS51825.2021.9484589) Tong, Xin, Meng, Zhen, Zhao, Guodong ORCID: https://orcid.org/0000-0002-9920-8244, Li, Liying ORCID: https://orcid.org/0000-0003-4200-0669 and Chen, Zhi (2021) How to Quantify Packet Importance for Real-Time Control: A Feature-Oriented Perspective. In: 17th IEEE International Conference on Factory Communication Systems (WFCS 2021), 09-11 Jun 2021, ISBN 9781665424790 (doi: 10.1109/WFCS46889.2021.9483612) Chang, Bo, Kizilkaya, Burak ORCID: https://orcid.org/0000-0002-7429-7527, Li, Liying ORCID: https://orcid.org/0000-0003-4200-0669, Zhao, Guodong ORCID: https://orcid.org/0000-0002-9920-8244, Chen, Zhi and Imran, Muhammad Ali ORCID: https://orcid.org/0000-0003-4743-9136 (2021) Effective age of information in real-time wireless feedback control systems. Science China Information Sciences, 64(2), 120303. (doi: 10.1007/s11432-020-3090-5) Kizilkaya, Burak ORCID: https://orcid.org/0000-0002-7429-7527, Meng, Zhen, Zhao, Guodong ORCID: https://orcid.org/0000-0002-9",
  "content_length": 31635,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:28"
}