{
  "name": "Emma Dixon",
  "homepage": "https://emmaedixon.wordpress.com",
  "status": "success",
  "content": "Emma Dixon Skip to content Emma Dixon I am an Assistant Professor at Clemson University, in the School of Computing in the Human-Centered Computing Division, with a joint appointment in Industrial Engineering. I am affiliated with the Institute for Engaged Aging and the Human-Factors Institute. My research interests are in the fields of Human-Computer Interaction (HCI) and Human Factors. Much of my work is related to health information technology and the accessibility of technology for neurodivergent populations. I am the director of the EQUI-Tech Lab, where we take a mixed methods approach, using qualitative methods to ground our work deeply in situated understanding of people’s experiences, participatory design methods to democratize the technology design and development process, and quantitative methods to test the usability of emerging technologies. Some topics I’m interested in: Neurodiversity and Cognitive Accessibility Health management of Neurodegenerative and Chronic Conditions Human-Centered Artificial Intelligence Online Information Behaviors I received my PhD from the University of Maryland, College Park, in Information Studies with a focus in HCI in 2022. My research was funded by the National Science Foundation Graduate Research Fellowship and NIDILRR. During my PhD, I was a member of the Trace Research and Development Center and the HCIL. Prior to pursuing my doctorate degree, I completed my Bachelor’s of Science in Industrial Engineering at Clemson University. News I’m thrilled to announce I and my collaborators, Drs Kristina Randall and Nianyi Li, have been awarded an NSF Human-Centered Computing grant for our ongoing research investigating the feasibility of object recognition systems providing individuals with intellectual and developmental disabilities with workplace task support! In addition, my collaborator, Dr. Alisha Pradhan, and I have been awarded an NSF Human-Centered Computing grant to investigate the concept of future proofing for age-related changing cognitive abilities using smart objects as assistive technology. Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Subscribe Subscribed Emma Dixon Sign me up Already have a WordPress.com account? Log in now. Emma Dixon Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website search previous next tag category expand menu location phone mail time cart zoom edit close",
  "content_length": 2663,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:26"
}