{
  "name": "Emmanouil Benetos",
  "homepage": "http://www.eecs.qmul.ac.uk/~emmanouilb",
  "status": "success",
  "content": "Emmanouil Benetos | Home Emmanouil Benetos Home CV Research People Publications Teaching Links Introduction I am currently Reader in Machine Listening and Director of Research at the School of Electronic Engineering and Computer Science of Queen Mary University of London. Within Queen Mary, I am member of the Centre for Digital Music, Centre for Multimodal AI, Centre for Intelligent Sensing, and Digital Environment Research Institute, and I co-lead the School's Machine Listening Lab. My main research topic is computational audio analysis, also referred to as machine listening or computer audition - applied to music, urban, everyday and nature sounds. I have been Royal Academy of Engineering / Leverhulme Trust Research Fellow in resource-efficient machine listening, Turing Fellow at the Alan Turing Institute, Royal Academy of Engineering Research Fellow, and have been principal- and co-investigator for several funded research projects in the intersection of machine learning and audio. I am also Deputy Director for the UKRI Centre for Doctoral Training in Artificial Intelligence and Music (AIM). On academic service, I am currently secretary for the International Society for Music Information Retrieval (ISMIR), vice-chair of the EURASIP Acoustic, Speech and Music Signal Processing Technical Area Committee (ASMSP TAC), member of the IEEE Technical Committee on Audio and Acoustic Signal Processing (AASP TC) and chair of its education subcommittee, associate editor for the IEEE/ACM Transactions on Audio, Speech, and Language Processing, and associate editor for the EURASIP Journal on Audio, Speech, and Music Processing. Contact: School of Electronic Engineering and Computer Science Queen Mary University of London London E1 4NS Office: Room Eng403, Engineering Building tel: +44 (0) 20 7882 6206 emmanouil.benetos at qmul.ac.uk 2025 Emmanouil Benetos (Εμμανουήλ Μπενέτος)",
  "content_length": 1894,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:30"
}