{
  "name": "Emmett Witchel",
  "homepage": "https://www.cs.utexas.edu/users/witchel",
  "status": "success",
  "content": "Emmett Witchel Emmett Witchel Home Research Teaching Service Recent publications (Complete publications) (Google scholar) (dblp) (CV) Y. Huang, H. Chen, N. Ni, Y. Sun, V. Chidambaram, D. Tang, E. Witchel OSDI 25 Tigon: A Distributed Database for a CXL Pod (code) Zhipeng Jia, Emmett Witchel SOSP 21 Boki: Stateful Serverless Computing with Shared Logs (slides) (video) (code) J. Kim, I. Jang, W. Reda, J. Im, M. Canini, D. Kostić, Y. Kwon, S. Peter, E. Witchel SOSP 21 [best paper] LineFS: Efficient SmartNIC Offload of a Distributed File System with Pipeline Parallelism (slides) (video) Y. Hu, Z. Zhu, I. Neal, Y. Kwon, T. Cheng, V. Chidambaram, E. Witchel [best paper] TxFS: Leveraging File-System Crash Consistency to Provide ACID Transactions ATC 18 T. Hunt, Z. Zhu, Y. Xu, S. Peter, E. Witchel [best paper] OSDI 16 Ryoan: A Distributed Sandbox for Untrusted Computation on Secret Data M. Silberstein, B. Ford, I. Keidar, E. Witchel [runner-up best paper] ASPLOS 13 GPUfs: Integrating a File System with GPUs Complete publications Code on github Teaching CS 380L: Advanced Operating Systems Fall 25, Spring 25, Fall 23, Spring 23, Spring 16, Fall 14, Fall 13, Fall 11, Spring 10, Fall 06, Fall 05 CS 371M: Mobile Computing Spring 24, Fall 22, Spring 20, Fall 19, Fall 18, Spring 18, Fall 16, Fall 15 Complete teaching Popular graphs Graphs disabled by noscript Graphs disabled by noscript Â© Emmett Witchel | using Resolved Emmett Witchel Professor of Computer Science ACM Fellow witchel at cs dot utexas.edu GDC 6.432 Group members Newton Ni Yibo Huang Haowei Chen Alumni Service ASPLOS: 24, 22, 20, 19 (Co-Chair), 17, 16, 14, 13, 10, 08 SOSP/OSDI: 26 (OSDI), 25 (SOSP), 25 (OSDI) , 24 general co-chair of SOSP, 23, 20, 19, 15, 14, 11, 10 EuroSys: 24 USENIX ATC: 24, 23, 14, 12, 08 IEEE S&P: 20 17 Complete service",
  "content_length": 1820,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:34"
}