{
  "name": "Emre Akbas",
  "homepage": "http://user.ceng.metu.edu.tr/~emre",
  "status": "success",
  "content": "Emre Akbas, Ph.D. - Middle East Technical University (METU) Emre Akbaş Associate professor at the Department of Computer Engineering, Middle East Technical University. My office hours Short bio: I am an associate professor at the Department of Computer Engineering, Middle East Technical University (METU). Before joining METU, I was a researcher at the Vision and Image Understanding Lab at the University of California Santa Barbara, where I worked with Prof. Miguel Eckstein. I received my PhD degree from the University of Illinois at Urbana-Champaign. My advisor was Prof. Narendra Ahuja. During my PhD, I was a research assistant at the Computer Vision and Robotics Lab at the Beckman Institute for Advanced Science and Technology. Research group ~ Publications ~ Teaching ~ CV New textbook: Signals and Systems: Theory and Practical Explorations with Python by Fatos Yarman Vural and Emre Akbas, from Wiley is finally out! If you are teaching a Signals and Systems course, please consider using this book as your textbook or auxiliary resource. See an excerpt from the ebook here or here. Recent highlights from our research group: Oct. 2024 – Our paper “A comparison of deep learning models for proton background rejection with the AMS electromagnetic calorimeter” by Raheem K. Hashmani, Emre Akbas, Bilge Demirkoz published at Machine Learning: Science and Technology. Jul. 2024 – Our paper “Bucketed Ranking-based Losses for Efficient Training of Object Detectors” by Feyza Yavuz, Baris Can Cam, Adnan Harun Dogan, Kemal Oksuz, Emre Akbas, Sinan Kalkan is accepted to European Conference on Computer Vision (ECCV) 2024! Jul. 2024 – Our paper “A multi-level multi-label text classification dataset of 19th century Ottoman and Russian literary and critical texts” by Gokcen Gokceoglu, Devrim Cavusoglu, Emre Akbas, Özen Nergis Dolcerocca is accepted to ACL Findings 2024! Apr. 2024 – Our paper “MoCap-to-Visual Domain Adaptation for Efficient Human Mesh Estimation from 2D Keypoints” by Bedirhan Uguz, Ozhan Suat, Batuhan Karagoz and Emre Akbas is accepted to the 2nd Workshop on Reconstruction of Human-Object Interactions held in conjuction with the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) 2024! Feb. 2024 – Our paper “RankED: Addressing Imbalance and Uncertainty in Edge Detection Using Ranking-based Losses” by Bedrettin Cetinkaya, Sinan Kalkan and Emre Akbas is accepted to the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) 2024! Oct. 2023 – Nermin Samet received the “METU Thesis Award” given by the Graduate School of Natural and Applied Sciences, METU. Mar. 2023 – Emre Akbas gave a talk on imbalance problems in object detection and ranking based loss functions at IMAGINE research group, Ecole des Ponts ParisTech. Feb. 2023 – Emre Akbas gave a talk on imbalance problems in object detection and ranking based loss functions, in the graduate seminar class at the School of Computing and Augmented Intelligence, Arizona State University. Dec. 2022 – Emre Akbas gave an invited talk at the ACCV Workshop on “Deep Learning-Based Small Object Detection from Images and Videos”. Nov. 2022 – Our paper “Correlation Loss: Enforcing Correlation between Classification and Localization” by Fehmi Kahraman, Kemal Oksuz, Sinan Kalkan and Emre Akbas is accepted to AAAI 2023! Aug. 2022 – Our paper “HoughNet: Integrating near and long-range evidence for visual detection” by Nermin Samet, Samet Hicsonmez and Emre Akbas is accepted to the IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)! Jul. 2022 – Our paper “Streaming Multiscale Deep Equilibrium Models” by Can Ufuk Ertenli, Emre Akbas and R. Gokberk Cinbis is accepted to the European Conference on Computer Vision (ECCV) 2022! Jun. 2022 – Kemal Oksuz received the “Thesis of the Year Award” given by the Graduate School of Natural and Applied Sciences, METU. His advisors were Sinan Kalkan and Emre Akbas. Apr. 2022 – Emre Akbas received the “Young Scientist Award” given by the Science Academy, Turkey. Mar. 2022 – Our paper “Does depth estimation help object detection?” by Bedrettin Cetinkaya, Sinan Kalkan and Emre Akbas is accepted to Image and Vision Computing! Jan. 2022 – Our paper “One Metric to Measure them All: Localisation Recall Precision (LRP) for Evaluating Visual Detection Tasks” by Kemal Oksuz, Baris Can Cam, Sinan Kalkan and Emre Akbas is accepted to the IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)! Oct. 2021 – Our paper “Mask-aware IoU for Anchor Assignment in Real-time Instance Segmentation” by Kemal Oksuz, Baris Can Cam, Fehmi Kahraman, Zeynep Sonat Baltaci, Sinan Kalkan and Emre Akbas is accepted to the British Machine Vision Conference (BMVC)! Aug. 2021 – Our paper “HPRNet: Hierarchical Point Regression for Whole-Body Human Pose Estimation” by Nermin Samet and Emre Akbas is accepted to Image and Vision Computing! Jul. 2021 – Our paper “Rank & Sort Loss for Object Detection and Instance Segmentation” by Kemal Oksuz, Baris Can Cam, Emre Akbas and Sinan Kalkan is accepted to ICCV’2021 for oral presentation! May 2021 – Our paper “Adversarial Segmentation Loss for Sketch Colorization” by Samet Hicsonmez, Nermin Samet, Emre Akbas and Pinar Duygulu is accepted to ICIP’2021! Feb. 2021 – Nermin Samet will be serving in the organization committee of the Women in Computer Vision workshop at CVPR2021. Paper Submissions are open until March 12th. All vision researchers are invited. Dec. 2020 – Emre Akbas received the ODTÜ Parlar Vakfı Araştırma Teşvik Ödülü (Research Incentive Award). Sep. 2020 – Our paper entitled “A Ranking-based, Balanced Loss Function Unifying Classification and Localisation in Object Detection” by Kemal Oksuz, Baris Can Cam, Emre Akbas and Sinan Kalkan is accepted to NeurIPS2020 as a spotlight paper! Links: pdf, repository. Sep. 2020 – Our work GANILLA has been featured in “The Batch”, a new weekly newsletter from deeplearning.ai. Aug. 2020 – We gave an invited talk at the “Beyond mAP: Reassessing the Evaluation of Object Detectors” workshop at ECCV2020. The title of the talk was “Unified Evaluation and Training of Object Detectors using Localization-Recall-Precision (LRP)”. The talk is available on YouTube. Aug. 2020 – The invited talks by Bernt Schiele, Boqing Gong, Ming-Hsuan Yang, Vittorio Ferrari and Tengyu Ma in our ECCV2020 workshop on “Imbalance Problems in Computer Vision” are now available on YouTube. Presentations of contributed papers can also be found at the page. Aug. 2020 – Our paper entitled “Reducing Label Noise in Anchor-Free Object Detection” by Nermin Samet, Samet Hicsonmez and Emre Akbas is accepted to the British Machine Vision Conference (BMVC). Links: pdf, repository Jul. 2020 – Our paper entitled “HoughNet: Integrating near and long-range evidence for bottom-up object detection” by Nermin Samet, Samet Hicsonmez and Emre Akbas is accepted to the European Conference on Computer Vision (ECCV). Links: pdf, repository Jun. 2020 – Our paper entitled “Low-level multiscale image segmentation and a benchmark for its evaluation” by Emre Akbas and Narendra Ahuja is accepted to Computer Vision and Image Understanding (CVIU). Mar. 2020 – Our paper entitled “Imbalance Problems in Object Detection: A Review” by Kemal Oksuz, Baris Can Cam, Sinan Kalkan and Emre Akbas is accepted to IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI). Links: pdf, repository, publisher’s page. Feb. 2020 – We will be organizing an ECCV2020 workshop on “Imbalance Problems in Computer Vision” in August 2020. Please consider contributing. Links: workshop home, call for papers. Feb. 2020 – We will be offering a new graduate course CEng 796 - Deep Generative Models in Spring 2020. Instructors are Gokberk Cinbis and Emre Akbas. Jan. 2020 – Our paper entitled “GANILLA: Generative adversarial networks for image to illustration translation” by Samet Hicsonmez, Nermin Samet, Emre Akbas and Pinar Duygulu is accepted to Image and Vision Computing. Links: pdf, code, publisher’s page. Dec. 2019 – Our paper entitled “Generating positive bounding boxes for balanced training of object detectors” by Kemal Oksuz, Baris Can Cam, Emre Akbas and Sinan Kalkan is accepted to IEEE Winter Conference on Applications of Computer Vision (WACV) 2020. Links: pdf, code, publisher’s page. More Last updated on 2025-09-24. Created using pandoc.",
  "content_length": 8638,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:38"
}