{
  "name": "En-Hong Chen",
  "homepage": "http://staff.ustc.edu.cn/~cheneh",
  "status": "success",
  "content": "En-Hong Chen's Homepage En-Hong Chen Ph.D., Professor, IEEE Fellow, ACM Distinguished Member Vice Dean Faculty of Information and Intelligence, University of Science and Technology of China (USTC) Vice Director State Key Laboratory of Cognitive Intelligence Director Anhui Province Key Laboratory of Big Data Analysis and Application Correspondence Telephone: +86-551-63601558 Email: Homepage: http://staff.ustc.edu.cn/~cheneh Office: Room 625, Diansan Building, West Campus of USTC Mail: En-Hong Chen, School of Computer Science and Technology, University of Science and Technology of China (USTC), Hefei, Anhui,230027 [Brief Biography] [Selected Publications] [Academic Activities] [Awards] [Courses] Brief Biography I am a Professor, vice dean of Faculty of Information and Intelligence of University of Science and Technology of China(USTC), CCF Fellow, IEEE Fellow, ACM Distinguished Member, winner of the National Science Fund for Distinguished Young Scholars (in 2013), and member of the Decision Advisory Committee of Shanghai (Since June, 2018). I am also the vice director of the National Engineer Laboratory for Speech and Language Information Processing, the director of Anhui Province Key Laboratory of Big Data Analysis and Application, and the chairman of Anhui Province Big Data Industry Alliance. I received my B.S degree from Anhui University in 1989, Master degree from Hefei University of Technology in 1992 and Ph.D degree in computer science from USTC in 1996. My current research interests are data mining and machine learning, especially social network analysis and recommender systems. I have published more than 200 papers on many journals and conferences, including international journals such as IEEE Trans, ACM Trans, and important data mining conferences, such as KDD, ICDM, NeurIPS. My research is supported by the National Natural Science Foundation of China, National High Technology Research and Development Program 863 of China, etc. I won the Best Application Paper Award on KDD2008, Best Research Paper Award on ICDM2011, Outstanding Paper Award on FCS2016, and Best Student Paper Award on KDD2024. Selected Publications 2025 Rui Zhou, Hao Wang, Wei Guo, Qinglin Jia, Wenjia Xie, Xiang Xu, Yong Liu, Defu Lian, Enhong Chen*. MIT: A Multi-Tower Information Transfer Framework Based on Hierarchical Task Relationship Modeling. In Companion Proceedings of the ACM on Web Conference 2025 (WWW '25). 651–660. [Link] Xiang Xu, Hao Wang, Wei Guo, Luankang Zhang, Wanshan Yang, Runlong Yu, Yong Liu, Defu Lian, Enhong Chen*. Multi-granularity Interest Retrieval and Refinement Network for Long-Term User Behavior Modeling in CTR Prediction. The 31th ACM SIGKDD Conference on Knowledge Discovery & Data Mining (KDD '25). Accepted. [Link] Yufei Ye, Wei Guo, Jin Yao Chin, Hao Wang, Hong Zhu, Xi Lin, Yuyang Ye, Yong Liu, Ruiming Tang, Defu Lian, Enhong Chen*. Recommendation Model with Feature Interaction Enhanced Transformer. In Companion Proceedings of the ACM on Web Conference 2025 (WWW '25). 557–566. [Link] Jiaqing Zhang, Mingjia Yin, Hao Wang, Yawen Li, Yuyang Ye, Xingyu Lou, Junping Du, Enhong Chen*. Tucker decomposition based dataset distillation method for sequential recommendation. In Proceedings of the ACM on Web Conference 2025 (WWW '25). 3994–4003. [Link] Junhao Yu, Yan Zhuang, Yuxuan Sun, Weibo Gao, Qi Liu, Mingyue Cheng, Zhenya Huang, Enhong Chen*. TestAgent: An Adaptive and Intelligent Expert for Human Assessment. ACL 2025. Accepted. [Link] Jiayu Liu, Zhenya Huang, Qi Liu, Zhiyuan Ma, Chengxiang Zhai, Enhong Chen. Knowledge-Centered Dual-Process Reasoning for Math Word Problems with Large Language Models. IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE). 2025. Accepted. Xinjie Sun, Kai Zhang, Qi Liu, Shuanghong Shen, Fei Wang, Yuxiang Guo, Enhong Chen. DASKT: A Dynamic Affect Simulation Method for Knowledge Tracing. IEEE Transactions on Knowledge and Data Engineering (IEEE TKDE). [Link] Yuze Zhao, Tianyun Ji, Wenjun Feng, Zhenya Huang, Qi Liu, Zhiding Liu, Yixiao Ma, Kai Zhang, Enhong Chen. Unveiling the Magic of Code Reasoning through Hypothesis Decomposition and Amendment. The Thirteenth International Conference on Learning Representations (ICLR '25). [Link] Xin Lin, Zhenya Huang, Zhiqiang Zhang, Jun Zhou, Enhong Chen. Explore What LLM Does not Know in Complex Question Answering. The 39th Annual AAAI Conference on Artificial Intelligence (AAAI '25). 24585–24594. [Link] Guanhao Zhao, Zhenya Huang, Cheng Cheng, Yan Zhuang, Qingyang Mao, Xin Li, Shijin Wang, Enhong Chen. Multi-Perspective Consolidation Enhanced Cognitive Diagnosis via Conditional Diffusion Model. The 39th Annual AAAI Conference on Artificial Intelligence (AAAI '25). 1174–1182. [Link] Yuanhao Pu, Defu Lian, Xiaolong Chen, Jin Chen, Ze Liu, Enhong Chen. Understanding the Effect of Loss Functions on the Generalization of Recommendations. The 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD '25). [Link] Yan Zhuang, Qi Liu, Zachary A. Pardos, Patrick C. Kyllonen, Jiyun Zu, Zhenya Huang, Shijin Wang, Enhong Chen. Position: AI Evaluation Should Learn from How We Test Humans. The Forty-second International Conference on Machine Learning (ICML '25). Accepted. Kai Zhang, Weiyin Gong, Qi Liu, Junyu Lu, Meikai Bao, Xukai Liu, Linbo Zhu, Enhong Chen. Intelligent Interaction Platform for Personalized Digital Tutor: Advancing Empathetic and Adaptive Learning Experiences. In Companion Proceedings of the ACM on Web Conference 2025 (WWW '25). 2947–2950. [Link] 2024 Shuanghong Shen, Qi Liu, Zhenya Huang, Yonghe Zheng, Minghao Yin, Minjuan Wang, Enhong Chen*. A Survey of Knowledge Tracing: Models, Variants, and Applications. IEEE Transactions on Learning Technologies (TLT). 2024. [Link] Qi Liu, Zheng Gong, Zhenya Huang, Chuanren Liu, Hengshu Zhu, Zhi Li, Enhong Chen*, Hui Xiong. Multi-Dimensional Ability Diagnosis for Machine Learning Algorithms. SCIENCE CHINA Information Sciences (SCIS). 2024, Accepted. [Link] Junhao Yu, Yan Zhuang, Zhenya Huang, Qi Liu, Xin Li, Rui Li, Enhong Chen*. A Unified Adaptive Testing System Enabled by Hierarchical Structure Search. The Forty-first International Conference on Machine Learning (ICML '24). 57803 - 57817. [Link] Jiayu Liu, Zhenya Huang, Tong Xiao, Jing Sha, Jinze Wu, Qi Liu, Shijin Wang, Enhong Chen*. SocraticLM: Exploring Socratic Personalized Teaching with Large Language Models. The 38th Annual Conference on Neural Information Processing Systems (NeurIPS'24, Spotlight). 85693–85721. [Link] Tong Xiao, Jiayu Liu, Zhenya Huang, Jinze Wu, Jing Sha, Shijin Wang, Enhong Chen*. Learning to Solve Geometry Problems via Simulating Human Dual-Reasoning Process. The International Joint Conference on Artificial Intelligence (IJCAI '24). 6559–6568. [Link] Liyang He, Zhenya Huang, Chenglong Liu, Rui Li, Runze Wu, Qi Liu, Enhong Chen*. One-bit Deep Hashing: Towards Resource-Efficient Hashing Model with Binary Neural Network. ACM MULTIMEDIA 2024 (ACM MM '24). 7162–7171. [Link] Liyang He, Zhenya Huang, Jiayu Liu, Enhong Chen*, Fei Wang, Jing Sha, Shijin Wang. Bit-mask Robust Contrastive Knowledge Distillation for Unsupervised Semantic Hashing. In Proceedings of the ACM on Web Conference 2024 (WWW '24). 1395–1406. [Link] Leyan Deng, Chenwang Wu, Defu Lian, Enhong Chen*. Learning from highly sparse spatio-temporal data. Advances in Neural Information Processing Systems (NeurIPS '24). 94022–94046. [Link] Zheng Zhang, Le Wu, Qi Liu, Jiayu Liu, Zhenya Huang, Yu Yin, Yan Zhuang, Weibo Gao, Enhong Chen. Understanding and Improving Fairness in Cognitive Diagnosis. SCIENCE CHINA Information Sciences (SCIS). 2024, 67(5): 152106. [Link] Qingyang Mao, Zhi Li, Qi Liu, Likang Wu, Hefu Zhang, Enhong Chen. Promoting Machine Abilities of Discovering and Utilizing Knowledge in a Unified Zero-shot Learning Paradigm. ACM Transactions on Knowledge Discovery from Data (ACM TKDD). 2024, 19(1): 1–26. [Link] Yuanhao Pu, Rui Fan, Jin Chen, Zhihao Zhu, Defu Lian, Enhong Chen. Automated Sparse and Low-Rank Shallow Autoencoders for Recommendation. ACM Transactions on Recommender Systems (TORS). 2025, 3(3): 1–26. [Link] Chenwang Wu, Defu Lian, Yong Ge, Min Zhou, Enhong Chen. Attacking Social Media via Behavior Poisoning. ACM Transactions on Knowledge Discovery from Data (TKDD). 2024, 18(7): 1–27. [Link] Chenwang Wu, Defu Lian, Yong Ge, Min Zhou, Enhong Chen, Dacheng Tao. Boosting Factorization Machines via Saliency-Guided Mixup. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI). 2024, 46(6): 4443–4459. [Link] Xin Lin, Tianhuang Su, Zhenya Huang, Shangzi Xue, Haifeng Liu, Enhong Chen. A Knowledge-Injected Curriculum Pretraining Framework for Question Answering. The ACM Web Conference 2024 (WWW '24). 1986–1997. [Link] Shuaike Li, Kai Zhang, Qi Liu, Enhong Chen. MindBridge: Scalable and Cross-Model Knowledge Editing via Memory-Augmented Modality. The 63st annual meeting of the Association for Computational Linguistics (ACL '24). Accepted. [Link] Jin Zhang, Ze Liu, Defu Lian*, Enhong Chen. Generalization Error Bounds for Two-stage Recommender Systems with Tree Structure. The 38th Annual Conference on Neural Information Processing Systems (NeurIPS '24). 37070–37099. [Link] Wenjia Xie, Hao Wang, Luankang Zhang, Rui Zhou, Defu Lian, Enhong Chen. Breaking Determinism: Fuzzy Modeling of Sequential Recommendation Using Discrete State Space Diffusion Model. The 38th Annual Conference on Neural Information Processing Systems (NeurIPS '24). 22720–22744. [Link] Yuanhao Pu, Xiaolong Chen, Xu Huang, Jin Chen, Defu Lian, Enhong Chen. Learning-Efficient Yet Generalizable Collaborative Filtering for Item Recommendation. The 41st International Conference on Machine Learning (ICML '24). [Link] Mingjia Yin, Hao Wang*, Wei Guo, Yong Liu, Suojuan Zhang, Sirui Zhao, Defu Lian, Enhong Chen. Dataset Regeneration for Sequential Recommendation. The 30th ACM SIGKDD Conference on Knowledge Discovery & Data Mining (KD",
  "content_length": 102598,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:36"
}