{
  "name": "Ender Özcan",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/ender.ozcan",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Ender ÖzcanProfessor of Computer Science and Operational Research, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsTeaching and LearningResearchPublications Contact workRoom C86 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/aender.ozcan@nottingham.ac.ukhttps://people.cs.nott.ac.uk/pszeo/ BiographyEnder Özcan is a Professor of Computer Science and Operational Research with the Computational Optimisation and Learning (COL) Lab in the School of Computer Science at the University of Nottingham, UK (UoN). He received his PhD from the Department of Computer and Information Science at Syracuse University, NY, USA in 1998. He worked as a lecturer in the Department of Computer Engineering at Yeditepe University, Istanbul, Turkiye from 1998-2007. He established and led the ARTIficial Intelligence research group from 2002. He served as the Deputy Head of the Department from 2004-2007. Prof Özcan was appointed as a senior research fellow in 2008 to the EPSRC funded LANCS initiative, one of the largest Science and Innovation Rewards given by EPSRC (Engineering and Physical Sciences Research Council, UK). He has been an academic at the University of Nottingham since then. He is currently Director of the Faculty of Science Doctoral Training Centre in Artificial Intelligence. Prof Özcan is an internationally-leading scientist in computational optimisation for intelligent decision support, underpinned by hyper-heuristics/metaheuristics combined with data science, tackling challenging real-world problems. His pioneering work at the interface of Computer Science, Artificial Intelligence and Operational Research has been extensively exploited and extended by other researchers, resulting in high number of citations, plenaries/keynotes at conferences, invited talks/guest lectures and tutorials. Currently, he is ranked within the World's top 2% scientists in Artificial Intelligence based on a recent study by Elsevier BV and Stanford University. Prof Özcan has over 150 refereed publications at reputable venues. He served as an Executive Committee member for the LANCS initiative. He was the Deputy Director of the EPSRC's National Taught Course Centre in Operational Research (NATCOR). He is a Senior Member of IEEE, an elected member of the EPSRC, and College Research Foundation - Flanders (FWO) Peer Review College. Prof Özcan contributed and has been contributing to the funded projects worth over £14m in total to date as principal investigator and co-investigator/named researchers, supported by various funding bodies, including the EPSRC, European Commission, The Royal Society, TSB, Innovate UK and TUBITAK. Prof Özcan is a co-founder and co-chair of the EURO Working Group on Data Science Meets Optimisation. He is Associate Editor of the Journal of Scheduling and International Journal of Applied Metaheuristic Computing, and on the Editorial (Advisory) Board of the Engineering Applications of Artificial Intelligence (EAAI) Journal and International Journal of Intelligent Computing and Cybernetics. He is Steering Committee member and Executive Officer of the International Conference Series on the Practice and Theory of Automated Timetabling (PATAT).Expertise SummaryMy expertise lies at the interface of Computer Science, Artificial Intelligence (AI) and Operational Research, with a focus on intelligent decision support systems embedding data science, mainly machine learning and heuristic,hyper-heuristic and metaheuristic optimisation techniques applied to real-world optimisation problems. Keywords: artificial intelligence, optimisation, intelligent decision support, heuristic, metaheuristic, hyper-heuristic, evolutionary algorithm, adaptive approaches, timetabling, cutting and packingTeaching SummaryI have been teaching informed by my research and scholarly activities exploiting my industrial links, and leading teaching innovation through the development and delivery of the undergraduate… read moreResearch SummaryMy research interests and activities lie at the interface of artificial intelligence, computer science, and operational research: Intelligent decision support systems, search and optimisation,… read moreSelected Publications SONG, H., DENG, B., POUND, M., ÖZCAN, E. and TRIGUERO, I., 2022. A fusion spatial attention approach for few-shot learning Information Fusion. 81, 187-202JERRY SWAN, STEVEN ADRIAENSEN, ALEXANDER E.I. BROWNLEE, KEVIN HAMMOND, COLIN G. JOHNSON, AHMED KHEIRI, FAUSTYNA KRAWIEC, J.J. MERELO, LEANDRO L. MINKU, ENDER ÖZCAN, GISELE L. PAPPA, PABLO GARCÍA-SÁNCHEZ, KENNETH SÖRENSEN, STEFAN VOß, MARKUS WAGNER and DAVID R. WHITE, 2022. Metaheuristics “In the Large” European Journal of Operational Research. 297(2), 393-406RAMAMOORTHY, V.T., ÖZCAN, E., PARKES, A.J., SREEKUMAR, A., JAOUEN, L. and BÉCOT, F.-X., 2021. Comparison of heuristics and metaheuristics for topology optimisation in acoustic porous materials Journal of the Acoustical Society of America. 150(4), 3164-3175JOHN H. DRAKE, AHMED KHEIRI, ENDER OZCAN and EDMUND K. BURKE, 2020. Recent advances in selection hyper-heuristics European Journal of Operational Research. 285(2), 405-428 View all publications I have been teaching informed by my research and scholarly activities exploiting my industrial links, and leading teaching innovation through the development and delivery of the undergraduate courses, specifically: Artificial Intelligence Methods that trails cutting-edge optimisation, namely metaheuristic and hyper-heuristic techniques into the Computer Science curriculum to provide students with an invaluable background and set of skills building on our strengths in this AI field within the School, and Level 3&4 Projects (each being a key component of the degree) that apply an innovative assessment framework and student engagement activities for enhanced student experience driven by continual student feedback. Current ResearchMy research interests and activities lie at the interface of artificial intelligence, computer science, and operational research: Intelligent decision support systems, search and optimisation, including combinatorial optimisation, constraint optimisation, multi-modal optimisation and multi-objective optimisation using heuristics, local search, hyper-heuristics, metaheuristics, in particular memetic algorithms, particle swarm optimisation, hybrid approaches embedding data science techniques and their theoretical foundations. Modelling of and applications to the complex real-world problems, including scheduling, timetabling, cutting&packing, SAT, knapsack problems, TSP, VRP and more, that are at the boundary of artificial intelligence, computer science and operational research, including grouping problems, such as, data clustering, graph colouring and bin packing. SONG, H., DENG, B., POUND, M., ÖZCAN, E. and TRIGUERO, I., 2022. A fusion spatial attention approach for few-shot learning Information Fusion. 81, 187-202JERRY SWAN, STEVEN ADRIAENSEN, ALEXANDER E.I. BROWNLEE, KEVIN HAMMOND, COLIN G. JOHNSON, AHMED KHEIRI, FAUSTYNA KRAWIEC, J.J. MERELO, LEANDRO L. MINKU, ENDER ÖZCAN, GISELE L. PAPPA, PABLO GARCÍA-SÁNCHEZ, KENNETH SÖRENSEN, STEFAN VOß, MARKUS WAGNER and DAVID R. WHITE, 2022. Metaheuristics “In the Large” European Journal of Operational Research. 297(2), 393-406DEVECI, M., ÖNER, S.C., CIFTCI, M.E., ÖZCAN, E. and PAMUCAR, D., 2022. Interval type-2 hesitant fuzzy Entropy-based WASPAS approach for aircraft type selection Applied Soft Computing. 114, 108076TÜRK, S., ÖZCAN, E. and JOHN, R., 2021. Many-objective Optimisation for an Integrated Supply Chain Management Problem Studies in Fuzziness and Soft Computing. 403, 97-111SWAN, J., ADRIAENSEN, S., BROWNLEE, A.E.I., HAMMOND, K., JOHNSON, C.G., KHEIRI, A., KRAWIEC, F., MERELO, J.J., MINKU, L.L., ÖZCAN, E., PAPPA, G.L., GARCÍA-SÁNCHEZ, P., SÖRENSEN, K., VOß, S., WAGNER, M. and WHITE, D.R., 2021. Metaheuristics “In the Large” European Journal of Operational Research. TÜRK, S., DEVECI, M., ÖZCAN, E., CANITEZ, F. and JOHN, R., 2021. Interval type-2 fuzzy sets improved by Simulated Annealing for locating the electric charging stations Information Sciences. 547, 641-666SONG, H., TORRES TORRES, M., ÖZCAN, E. and TRIGUERO, I., 2021. L2AE-D: Learning to Aggregate Embeddings for Few-shot Learning with Meta-level Dropout Neurocomputing. 442, 200-208ÖZCAN, E., BURKE, E.K., DI GASPERO, L., MCCOLLUM, B. and MUSLIU, N., 2021. Preface: The practice and theory of automated timetabling (2018) Annals of Operations Research. 302(2), 339-340DEVECI, M., ÖZCAN, E., JOHN, R., PAMUCAR, D. and KARAMAN, H., 2021. Offshore wind farm site selection using interval rough numbers based Best-Worst Method and MARCOS Applied Soft Computing. 109, 107532CARVALHO, V.R., ÖZCAN, E. and SICHMAN, J.S., 2021. Comparative analysis of selection hyper-heuristics for real-world multi-objective optimization problems Applied Sciences (Switzerland). 11(19), 9153RAMAMOORTHY, V.T., ÖZCAN, E., PARKES, A.J., SREEKUMAR, A., JAOUEN, L. and BÉCOT, F.-X., 2021. Comparison of heuristics and metaheuristics for topology optimisation in acoustic porous materials Journal of the Acoustical Society of America. 150(4), 3164-3175DELIKTAŞ, D., ÖZCAN, E., USTUN, O. and TORKUL, O., 2021. Evolutionary algorithms for multi-objective flexible job shop cell scheduling Applied Soft Computing. 113, 107890JOHN H. DRAKE, AHMED KHEIRI, ENDER OZCAN and EDMUND K. BURKE, 2020. Recent advances in selection hyper-heuristics European Journal of Operational Research. 285(2), 405-428TAYMAZ RAHKAR FARSHI, JOHN H. DRAKE and ENDER O",
  "content_length": 37288,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:37"
}