{
  "name": "Endrowednes Kuantama",
  "homepage": "https://researchers.mq.edu.au/en/persons/endrowednes-kuantama",
  "status": "success",
  "content": "Endrowednes Kuantama - Macquarie University View Scopus Profile Endrowednes Kuantama Dr Lecturer in IoT/Networking, School of ComputingAdvanced Drone Systems Research Centre https://orcid.org/0000-0002-1615-7243 Phone+61 2 9850 4140Emailendrowednes.kuantamamq.eduau h-index 409 Citations 11 h-index Calculated based on number of publications stored in Pure and citations from Scopus 20082025 Research activity per year Personal profile BiographyDr. Endrowednes Kuantama undertook the role of Lecturer in IoT and Networking at Macquarie University's School of Computing in 2023. A distinguished ERASMUS MUNDUS scholar, he successfully completed his doctoral studies at Oradea University, Romania. Before joining Macquarie, Dr. Kuantama served as an Assistant Professor in the Engineering Department at Kyungsung University, South Korea, followed by a position as a Postdoctoral Research Fellow at Macquarie University's School of Computing. Dr. Kuantama is actively involved in pioneering research within the Drone Lab, focusing on cutting-edge areas such as aerial manipulation, the Internet of Drones, control systems, and advanced sensor fusion techniques. His significant contribution to academia is reflected in a robust publication record, with 27 authored works featured in reputable books, conferences, and journals. Beyond his research pursuits, Dr. Kuantama plays a vital role in the academic community. He serves as a dedicated reviewer for the Drone and Aerospace Journal and holds an esteemed editorial board position for the International Journal for Smart Sensing and Intelligent Systems.Research interestsInternet of DronesDesign and implementation of Unmanned Aerial Vehicles for aerial manipulationSensing, recognition, and path planning for autonomous droneMachine learning and data analyticsSLAM algorithms and robotics control system Fingerprint Dive into the research topics where Endrowednes Kuantama is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Quadcopter Engineering 100% Drone Engineering 76% Unmanned Aerial Vehicle Engineering 55% Propeller Engineering 54% Microcontroller Engineering 54% Sensor Fusion Engineering 40% Control System Engineering 25% Level Measurement Engineering 25% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2024 2024 2025 2026 1 Finished 1 Active Projects per year Deep Vision in Autonomous Underwater 3D Mapping for Biodiversity AssessmentKuantama, E. (Primary Chief Investigator), James, A. (Chief Investigator) & Seth, A. (Chief Investigator)1/06/25 → 31/05/26Project: Research Bonding Through Coding Ramakrishnan, C. (Primary Chief Investigator), Roberts, M. (Partner Investigator), Woo, K. (Partner Investigator) & Kuantama, E. (Associate Investigator)19/11/24 → 18/11/25Project: Other Research Outputs Research output per year 2008 2011 2018 2023 2024 2025 26 Conference proceeding contribution 11 Article 1 Chapter 1 Conference paper Research output per year Research output per year Analysis of quadcopter propeller vibration based on laser vibrometerKuantama, E., Moldovan, O. G., Ţarcă, I., Vesselényi, T. & Ţarcă, R., Mar 2021, In: Journal of Low Frequency Noise Vibration and Active Control. 40, 1, p. 239-251 13 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Propeller 100% Quadcopter 100% Rotational Speed 26% Propeller Blade 13% Rotor Speed 6% 15 Citations (Scopus) 145 Downloads (Pure) The design and experimental development of air scanning using a sniffer quadcopterKuantama, E., Tarca, R., Dzitac, S., Dzitac, I., Vesselenyi, T. & Tarca, I., 2 Sept 2019, In: Sensors. 19, 18, p. 1-18 18 p., 3849.Research output: Contribution to journal › Article › peer-review Open AccessFile Quadcopter 100% Source Gas 80% Sampling Point 60% Dynamic Nature 40% Vortex 40% 30 Citations (Scopus) 82 Downloads (Pure) Correction of wind effect on quadcopterKuantama, E. & Tarca, R., 2018, Proceedings of 2018 International Conference on Sustainable Information Engineering and Technology (SIET). Piscataway, NJ: Institute of Electrical and Electronics Engineers (IEEE), p. 257-261 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Quadcopter 100% Propeller 80% Wind Tunnels 40% Air Flow 40% Air Velocity 40% 6 Citations (Scopus) Feedback linearization LQR control for quadcopter position trackingKuantama, E., Tarca, I. & Tarca, R., 2018, 2018 5th International Conference on Control, Decision and Information Technologies (CoDIT). Piscataway, NJ: Institute of Electrical and Electronics Engineers (IEEE), p. 204-209 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Tracking (Position) 100% Feedback Linearization 100% Quadcopter 100% Behavior (Neuroscience) 100% Trajectory Tracking 100% 36 Citations (Scopus) Flight stability analysis of a symmetrically-structured quadcopter based on thrust data logger informationKuantama, E., Tarca, I., Dzitac, S., Dzitac, I. & Tarca, R., Jul 2018, In: Symmetry. 10, 7, p. 1-14 14 p., 291.Research output: Contribution to journal › Article › peer-review Open AccessFile Stability Analysis 100% Quadcopter 100% Rotors 66% Propeller 50% Control System 16% 11 Citations (Scopus) 76 Downloads (Pure) View all 39 research outputs",
  "content_length": 5732,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:37"
}