{
  "name": "Enes Makalic",
  "homepage": "https://research.monash.edu/en/persons/enes-makalic",
  "status": "success",
  "content": "Enes Makalic - Monash University View Scopus Profile Enes Makalic Professor Professor, Department of Data Science & AI https://orcid.org/0000-0003-3017-0871 EmailEnes.Makalicmonashedu Accepting PhD Students 20032024 Research activity per year Personal profile BiographyEnes Makalic is a Professor of Machine Learning at the Department of Data Science and AI, Faculty of Information Technology, Monash University, Melbourne, Australia. He has a lifelong interest in theoretical computer science and a mission to enable global impact through quality teaching and research that emphasizes collaborative, inter-disciplinary partnerships. Since completing his PhD in machine learning, he has spent over 15 years working in Bayesian inference, information theoretic statistics and digital health.Research interestsHis research interests include: Theoretical and applied Bayesian statistics, including model selection and parameter estimation of ultra-high dimensional statistical models;The minimum message length principles of inductive inference, and applications of information theoretic statistics to epidemiology;Image processing and risk prediction, focusing on digital mammography and breast cancer; andStatistical genetics and genomic prediction models for rare, polygenic diseases and traits. Enes is also an active member of the academic community, serving as a reviewer and program committee member for numerous journals and conferences.Monash teaching commitmentEnes has developed and coordinated subjects and short courses in the areas of computer science, biostatistics, survival analysis, and machine learning. He enjoys mentoring students, and has supervised Honours, Masters and PhD students to completion. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationMachine Learning, PhD, Minimum message length inference of artificial neural networks, MONASH UNIVERSITYAward Date: 19 Jun 2007Computer Science, Bachelor of Computer Science (Honours), MONASH UNIVERSITYAward Date: 31 Dec 2002 Research area keywordsStatisticsMachine LearningData ScienceDigital HealthStatistical genomicsInformation Theory Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2017 2017 2019 2021 2026 1 Active 2 Finished Projects per year Centre of Research Excellence in Precision Public Health Approaches to Breast Cancer Screening, Early Detection and Mortality ReductionHopper, J. L. (Primary Chief Investigator (PCI)), Southey, M. (Chief Investigator (CI)), Frazer, H. (Chief Investigator (CI)), Emery, J. D. (Chief Investigator (CI)), Makalic, E. (Chief Investigator (CI)), Reintals, M. (Chief Investigator (CI)), Petrie, D. (Chief Investigator (CI)), Stone, J. L. (Chief Investigator (CI)), Thompson, E. W. (Chief Investigator (CI)), Macinnis, R. (Chief Investigator (CI)), Bickerstaffe, A. (Associate Investigator (AI)), Dite, G. (Associate Investigator (AI)), Boyle, D. (Associate Investigator (AI)), Jenkins, M. A. (Associate Investigator (AI)), Sung, J. (Associate Investigator (AI)), Bondell, H. (Associate Investigator (AI)), Winship, I. M. (Associate Investigator (AI)), Ingman, W. (Associate Investigator (AI)), Britt, K. (Associate Investigator (AI)) & Lee, D. (Associate Investigator (AI))NHMRC - National Health and Medical Research Council (Australia)1/10/21 → 30/09/26Project: Research Improved and automated measures of breast cancer risk based on digital mammography and family history data collected by BreastScreen that will enable tailored screening for breast cancerHopper, J. L. (Primary Chief Investigator (PCI)), Schmidt, D. (Chief Investigator (CI)), Nickson, C. A. (Chief Investigator (CI)), Makalic, E. (Chief Investigator (CI)), Nguyen, L. (Chief Investigator (CI)), Mann, G. B. (Chief Investigator (CI)), Frazer, H. (Chief Investigator (CI)), Dugue, P.-A. (Chief Investigator (CI)), Dite, G. S. (Chief Investigator (CI)) & Evans, J. (Chief Investigator (CI))1/01/19 → 31/12/21Project: Research Development of automated measures from mammograms that predict masking and risk and pilot implementation into a clinical serviceHopper, J. L. (Primary Chief Investigator (PCI)), Schmidt, D. (Chief Investigator (CI)), Makalic, E. (Chief Investigator (CI)), Apicella, C. (Chief Investigator (CI)), Keogh, L. A. (Chief Investigator (CI)), Frazer, H. (Chief Investigator (CI)), Dugué, P.-A. (Chief Investigator (CI)), Highnam, R. (Chief Investigator (CI)), Nguyen, L. (Chief Investigator (CI)) & Evans, J. (Chief Investigator (CI))Cancer Council Victoria 1/01/17 → 3/06/23Project: Research Research output Research output per year 2003 2012 2013 2016 2018 2021 2023 2024 87 Article 29 Conference Paper 3 Meeting Abstract 2 Letter 4 More 2 Review Article 1 Other 1 Comment / Debate Research output per year Research output per year Assessing Pancreatic Fat and Its Correlation with Liver Fat in Suspected MASLD Patients Using Advanced Deep Learning Techniques from MRI ImagesCherrie Fung, H. C., Meneses, J. P., Surendran, N., Kutaiba, N., George, Y., Makalic, E. & Uribe, S., 2 Dec 2024, In: Applied Sciences. 14, 24, 15 p., 11924.Research output: Contribution to journal › Article › Research › peer-review Open Access Associations between pathological features and risk of metachronous colorectal cancerZhang, Y., Win, A. K., Makalic, E., Buchanan, D. D., Pai, R. K., Phipps, A. I., Rosty, C., Boussioutas, A., Karahalios, A. & Jenkins, M. A., 15 Sept 2024, In: International Journal of Cancer. 155, 6, p. 1023-1032 10 p.Research output: Contribution to journal › Article › Research › peer-review Open Access 3 Citations (Scopus) Breast and bowel cancers diagnosed in people ‘too young to have cancer’: A blueprint for research using family and twin studiesHopper, J. L., Li, S., MacInnis, R. J., Dowty, J. G., Nguyen, T. L., Bui, M., Dite, G. S., Esser, V. F. C., Ye, Z., Makalic, E., Schmidt, D. F., Goudey, B., Alpen, K., Kapuscinski, M., Win, A. K., Dugué, P. A., Milne, R. L., Jayasekara, H., Brooks, J. D. & Malta, S. & 11 others, Calais-Ferreira, L., Campbell, A. C., Young, J. T., Nguyen-Dumont, T., Sung, J., Giles, G. G., Buchanan, D., Winship, I., Terry, M. B., Southey, M. C. & Jenkins, M. A., Dec 2024, In: Genetic Epidemiology. 48, 8, p. 433-447 15 p.Research output: Contribution to journal › Article › Research › peer-review Open Access 2 Citations (Scopus) Causation and familial confounding as explanations for the associations of polygenic risk scores with breast cancer: Evidence from innovative ICE FALCON and ICE CRISTAL analysesLi, S., Dite, G. S., MacInnis, R. J., Bui, M., Nguyen, T. L., Esser, V. F. C., Ye, Z., Dowty, J. G., Makalic, E., Sung, J., Giles, G. G., Southey, M. C. & Hopper, J. L., Dec 2024, In: Genetic Epidemiology. 48, 8, p. 401-413 13 p.Research output: Contribution to journal › Article › Research › peer-review Open Access 2 Citations (Scopus) Genetic and environmental causes of variation in an automated breast cancer risk factor based on mammographic texturesYe, Z., Dite, G. S., Nguyen, T. L., MacInnis, R. J., Schmidt, D. F., Makalic, E., Al-Qershi, O. M., Nguyen-Dumont, T., Goudey, B., Stone, J., Dowty, J. G., Giles, G. G., Southey, M. C., Hopper, J. L. & Li, S., 1 Feb 2024, In: Cancer Epidemiology, Biomarkers and Prevention. 33, 2, p. 306-313 8 p.Research output: Contribution to journal › Article › Research › peer-review 1 Citation (Scopus) View all 126 research outputs",
  "content_length": 7921,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:37"
}