{
  "name": "Engin Kirda",
  "homepage": "http://www.ccs.neu.edu/home/ek",
  "status": "success",
  "content": "Engin Kirda Engin Kirda Go to my Google Scholar page About MeCurrently, I am a professor at the Khoury College of Computer Sciences and the Department of Electrical and Computer Engineering at Northeastern University in Boston. Previously, I was tenured faculty at Institute Eurecom (Graduate School and Research Center) in the French Riviera and before that, faculty at the Technical University of Vienna where I co-founded the Secure Systems Lab. Our lab has now become international and is distributed over nine institutions and geographical locations. My current research interests are in systems, software and network security (with focus on Web security, binary analysis, malware detection). Before that, I was mainly interested in distributed systems, software engineering and software architectures. I am very fortunate to work with and have the privilege to advise some very bright Ph.D. students. I am very proud of their achievements! I've also been fortunate to work with some very smart and technically capable post-docs and collaborators around the world. I personally enjoy writing code in different languages (e.g., C, Perl, C#, Java, [recently] Python) and am convinced that computer science students need to be language-independent ;-) I am trying to continue to code as much as possible -- although I have much more admin work to do now... I am also part of the Shellphish hacking group. We regularly participate at the DefCon CTF. Prospective StudentsBEFORE YOU SEND ME AN EMAIL ABOUT BECOMING MY PH.D. STUDENT, please read this. General InformationEducation: Habilitation (Priv.Doz.), Dr. techn., Dipl.-Ing. in Computer Science, Technical University of Vienna Office Hours:Schedule via email Email: ek@ccs.neu.edu (Please note that I get a lot of emails. I try to prioritize when I respond and I try to answer every email. However, please do not get offended if I fail. If you haven't heard from me after a week or so, the mail might have been lost so you might want to try again.) Current Address: Northeastern University - 512-177 (map), 360 Huntington Ave Boston, MA, 02115 USA Telephone: +1 (857) 244-0999 Member of: IEEE, ACM, and Shellphish Former CompanyI was one of the co-founders of Lastline, a company that provided advanced threats intelligence and detection capabilities and services to its customers. Lastline was acquired by VMWare in 2020. Research LabsAt Northeastern, I co-direct the Secure Systems Lab with Long Lu. I am one of the co-founders of the International Secure Systems Lab. A family of independent security research labs that collaborate closely. I am active as a Senior Systems Engineer / Key Scientific Advisor at the Secure Business Austria competence center. I am adjunct professor at the Yokohama National University I am network faculty at Sabanci University. Publications Security Workshops and Conferences \"Only as Strong as the Weakest Link\": On the Security of Brokered Single Sign-On on the Web, T. Innocenti, L. Jannett, C. Mainka, M. Vladenov, E. Kirda, 46th IEEE Symposium on Security and Privacy, May 2025, San Francisco, CA Secure IP Address Allocation at Cloud Scale, E. Pauley, K. Domico, B. Hoak, R. Sheatsley, Q. Burke, Y. Beugin, E. Kirda, P. McDaniel, The Network and Distributed System Security Symposium (NDSS), February 2025, San Diego, CA Enhancing Network Security through Vulnerability Monitoring, R. Williams, A. Gavazzi, and E. Kirda, NSS 2024: 18th International Conference on Network and System Security, Abu Dhabi, UAE, November 2024 Gudifu: Guided Differential Fuzzing for HTTP Request Parsing Discrepancies, B. Jabiyev, A. Gavazzi, K. Onarlioglu, E. Kirda, The 27th International Symposium on Research in Attacks, Intrusions and Defenses (RAID), September 2024, Padova, Italy CO3: Concolic Co-execution for Firmware, C. Liu, A. Mera, E. Kirda, M. Xu, L. Lu, 33rd USENIX Security Symposium, August 2024, Philadelphia, PA SHiFT: Semi-hosted Fuzz Testing for Embedded Applications, A. Mera, C. Liu, R. Sun, E. Kirda, L. Lu, 33rd USENIX Security Symposium, August 2024, Philadelphia, PA Untangle: Multi-Layer Web Server Fingerprinting, C. Topcuoglu, K. Onarlioglu, B. Jabiyev, E. Kirda, The Network and Distributed System Security Symposium (NDSS), February 2024, San Diego, CA MacOS versus Microsoft Windows: A Study on the Cybersecurity and Privacy User Perception of Two Popular Operating Systems, C. Topcuoglu, A. Martinez, A. Acar, S. Uluagac, E. Kirda, Symposium on Usable Security and Privacy (USEC), February 2024, San Diego, CA Assessing the Feasibility of the Virtual Smartphone Paradigm in Countering Zero-Click Attacks N. Shafqat; C. Topcuoglu; E. Kirda; A. Ranganathan, HICSS-57 Hawaii International Conference on System Sciences, January 2024 OAuth 2.0 Redirect URI Validation Falls Short, Literally, T. Innocenti, M. Golinelli, K. Onarlioglu, B. Crispo, E. Kirda, 9th Applied Computer Security Applications Conference (ACSAC2023), 2023, appear. On the Complexity of the Web’s PKI: Evaluating Certificate Validation of Mobile Browsers, M. Luo, B. Feng, L. Lu, E. Kirda, K. Ren, IEEE Transactions on Dependable and Secure Computing, 2023, to appear. download PellucidAttachment: Protecting Users from Attacks via E-mail Attachments, S. Duman, M. Buechler, M. Egele, E. Kirda, IEEE Transactions on Dependable and Secure Computing, 2023, to appear. download Solder: Retrofitting Legacy Code with Cross-Language Patches, R. Williams, A. Gavazzi, E. Kirda, 30th IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER), Macao, China, March 2023 download A Study of Multi-Factor and Risk-Based Authentication Availability, A. Gavazzi, R. Williams, E. Kirda, L. Lu, A. King, A. Davis, T. Leek, 32nd USENIX Security Symposium, Anaheim, California, August 2023 download FRAMESHIFTER: Manipulating HTTP/2 Frame Sequences with Fuzzing, B. Jabiyev, S. Sprecher, A. Gavazzi, T. Innocenti, K. Onarlioglu, E. Kirda, 31st USENIX Security Symposium Boston, MA, August 2022 download A Recent Year On the Internet: Measuring and Understanding the Threats to Everyday Internet Devices, A. Anwar, Y. Chen, E. Kirda, A. Oprea, R.Hodgman, T. Sellers, Annual Computer Security Applications Conference (ACSAC), Austin, Texas, December 2022 download Who's Controlling My Device? Multi-User Multi-Device-Aware Access Control System for Shared Smart Home Environment, A. Sikder, L. Babun, B. Celik, H. Aksu, P. McDaniel, E. Kirda, S. Uluagac, ACM Transactions on Internet of Things, 2022, to appear. download HotFuzz: Discovering Temporal and Spatial Denial-of-Service Vulnerabilities Through Guided Micro-Fuzzing, W. Blair, A. Mambretti, S. Arshad, M. Weissbacher, W. Robertson, E. Kirda, M. Egele, ACM Transactions on Privacy and Security,ACM Trans. Priv. Secur. 25(4): 33:1-33:35, 2022 download SoK: All or Nothing - A Postmortem of Solutions to the Third-Party Script Inclusion Permission Model and a Path Forward, Steven Sprecher, Christoph Kerschbaumer, Engin Kirda, 7th IEEE European Symposium on Security and Privacy (EuroS&P 2022), June 2022, Genoa download D-Box: DMA-enabled compartmentalization for embedded applications, Alejandro Mera, Yi Hui Chen, Ruimin Sun, Engin Kirda, Long Lu, 29th Network and Distributed System Security Symposium, February 2022 download Web Cache Deception Escalates!, S. A. Mirheidari, M. Golinelli, K. Onarlioglu, E. Kirda, B. Crispo, 31st USENIX Security Symposium, August 2022 download T-Reqs: HTTP Request Smuggling with Differential Fuzzing, B.Jabiyev, S.Sprecher, K. Onarlioglu, E. Kirda, In ACM Conference on Computer and Communications Security (CCS), November, 2021 download Game of FAME: Automatic Detection of FAke MEmes, B. Jabiyev, J. Onaolapo, G. Stringhini, E. Kirda, In Conference for Truth and Trust Online (TTO) 2021, October 2021 download Browserprint: An Analysis of the Impact of Browser Features on Fingerprintability and Web Privacy S. A. Akhavani, J. Jueckstock, J. Su, A. Kapravelos, E. Kirda, L. Lu Information Security Conference (ISC) November, 2021 download In-Browser Cryptomining for Good: An Untold Story E. Tekiner, A. Acar, A. S. Uluagac, E. Kirda, A. A. Selcuk, 3rd IEEE International Conference on Decentralized Applications and Infrastructures August, 2021 download FADE: Detecting Fake News Articles on the Web, B. Jabiyev, S. Pehlivanoglu, K. Onarlioglu, E. Kirda, 16th International Conference on Availability, Reliability, and Security (ARES), August, 2021 download SCRUTINIZER: Detecting Code Reuse in Malware via Decompilation and Machine Learning, O. Mirzaei, R. Vasilenko, E. Kirda, L. Lu, A. Kharraz, In 18th Conference on Detection of Intrusions and Malware & Vulnerability Assessment (DIMVA), July 2021 download You’ve Got (a Reset) Mail: A Security Analysis of Email-Based Password Reset Procedures, T. Innocenti, S. A. Mirheidarii, A. Kharraz, B. Crispo, E. Kirda, In 18th Conference on Detection of Intrusions and Malware & Vulnerability Assessment (DIMVA), July 2021 download Ege Tekiner, Abbas Acar, Selcuk Uluagac, Engin Kirda, Ali A. Selcuk, SoK: Cryptojacking Malware, 6th IEEE European Symposium on Security and Privacy, Vienna, Austria, September 2021 download Andrea Mambretti, Alexandra Sandulescu, Alessandro Sorniotti, William Robertson, Engin Kirda, Anil Kurmus, Bypassing memory safety mechanisms through speculative control flow hijacks, 6th IEEE European Symposium on Security and Privacy, Vienna, Austria, September 2021 download Andrea Mambretti, Pasquale Convertini, Alessandro Sorniotti, Alexandra Sandulescu, Engin Kirda, Anil Kurmus, GhostBuster: understanding and overcoming the pitfalls of transient execution vulnerability checkers, In 28th IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER 2021), March 2021 download Bahruz Jabiyev, Omid Mirzaei, Amin Kharraz, Engin Kirda, Preventing Server-Side Request Forgery Attacks, In 36th ACM Symposium on Applied Computing (SAC 2021), Gwangju, Korea, May 2021 download Alejandro Mera, Bo Feng, Long Lu, Eng",
  "content_length": 66233,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:38"
}