{
  "name": "Enkelejda Kasneci",
  "homepage": "https://www.edu.sot.tum.de/hctl/prof-dr-enkelejda-kasneci",
  "status": "success",
  "content": "Prof. Dr. Enkelejda Kasneci - Human-Centered Technologies for Learning Prof. Dr. Enkelejda Kasneci ProfessorshipHuman-Centered Technologies for LearningFurther ResponsibilitiesDirector TUM Center for Educational TechnologiesProgram Head MSc. “AI in Society”AffiliationsTUM School of Social Sciences and TechnologyTUM School of Computation, Information and TechnologyMunich Data Science InstituteMunich Center for Machine Learning Research Focus Ensuring that technology is designed with human-centered principles in mind has never been more important. My research focuses on human-centered technologies, emphasizing the crossroads between multimodal interaction and cutting-edge technological tools like VR, AR, and eye-tracking methodologies. We incorporate AI to foster and facilitate the emergence of innovative learning paradigms and interactive systems that can revolutionize how we learn and interact with media and assistive technologies in our everyday lives. As an academic editor for PlosOne and a committee member for major conferences and journals, I am dedicated to advancing research in multimodal HCI, Human-Centered AI, Educational Technologies, and Eye-Tracking. Short CV Enkelejda Kasneci is a Distinguished Professor (“Liesel Beckmann Distinguished Professorship”) for Human-Centered Technologies for Learning at the School of Social Sciences & Technology and in her second affiliation at the School of Computation, Information and Technology. She is Director of the TUM Center for Educational Technologies, Core Member of the Munich Data Science Institute, Fellow of the Konrad Zuse School of Excellence in Reliable AI, and PI of the Munich Center for Machine Learning. From December 2019 until July 2022, she was Professor for Human-Computer Interaction at the Department of Computer Science at the University of Tübingen and served to this department as the Dean of Studies. As a BOSCH scholar, she received her M.Sc. degree in Computer Science from the University of Stuttgart in 2007. In 2013, she received her PhD in Computer Science from the University of Tübingen. For her PhD research, she was awarded the Research Prize of the Federation Südwestmetall in 2014. From 2013 to 2015, she was a postdoctoral researcher and a Margarete-von-Wrangell Fellow at the University of Tübingen. She established her research and teaching activities at the University of Tübingen from 2015 to 2019 as an assistant professor and head of the Perception Engineering Lab.Courses Awards & Funding (Selection) Selected FundingDFG SPP 2481 Understanding Gaze: UGaze, A. Huckauf, G. Horstmann, E. Kasneci, newly established Priority Programm by the Deutsche Forschungsgemeinschaft (DFG). www.ugaze.de, 2025-2031PrivateEyeXR: Preserving Eye Privacy in Extended Reality - from Data Preprocessing to Model Development, Funded by the Deutsche Forschungsgemeinschaft DFG, Project No. 491966293, P (359.000 EUR), 2026-2029Vision optics with integrated VCSELs and Autofocal lenses (VIVA) - Stand-alone Eye Tracking, EU KDT Call, Project part E. Kasneci (1.125 Mio EUR), EU Horizon-KDT-JU & BMBF, 2024-2027Lead PI for INF at the DFG Collaborative Research Centre - SHARP (TRR419) Simulation-based learning in higher education, Funded by the DFG, 2025-2029Enhancing Teaching Quality with Artificial Intelligence (ETQ-AI) in collaboration with the University of Tübingen and as subproject of the grant Künstliche Intelligenz und Bildung - Hector AI + Education Future Fund, Hector Stiftung II gGmbH, Project part E. Kasneci (244.800 EUR), 2025-2028LeSKI: Lerne Schreiben mit KI, Funding by BMWK/AIF ZIM (220.000 EUR), 2025-2027SARA Kids: A Gamified Reading Assistant, Funding by Dr. Christoph Kuhmann (244.800 EUR), 2025-2028Generative AI for Equity in Education, Roland Berger Foundation (225.000 EUR), 2024-2027AI in Education Lab, E. Kasneci & G. Kasneci, IT-Stiftung Esslingen (600.000 EUR)Remote Video Learner, P. Gerjets, E. Kasneci, U. Trautwein, M Huff, Leibnitz Gemeinschaft, (own part 240.000 EUR), 2023-2025Human-in-the-Loop-AI in Industrial Applications, Research Grant by Liebherr (90.000 EUR), 2023PI in the Project \"Digitalisierungsbezogene und digital gestützte Professionalisierung von MIN-Lehrkräften (DigiProMIN)\", funded by BMBF (own part 163.000 EUR)PrivatEye: Privacy-preserving eye movement data manipulation for VR and AR, Funded by the Deutsche Forschungsgemeinschaft DFG, Project No. 491966293, P (300.000 EUR), 2022-2024The Museum Gaze: Developing Mobile Eye Tracking to Analyze the Beholding of Paintings, Sculptures, and their Display in the Museum Space, Funded by the DFG, Project No. 464052890, (350.000 EUR), 2022-2025Smart sensor technology for telepsychotherapy of children and adolescents, T. Renner, M. Giese, E. Kasneci, M. Menth, H. Lauterbach, German Ministry of Health (own part 240.000 EUR), 2021-2023Selected AwardsTUM Heinz Maier-Leibnitz Medal (2024)TUM Liesel Beckmann Distinguished Professorship (2022)Excellent Technology Transfer Neckar-Alb (2022)Junior-Fellow der Gesellschaft für Informatik (2016-2021)Fast Track Programm der Robert Bosch Stiftung (2016)Südwestmetall-Förderpreis für Nachwuchswissenschaftler (2014)Margarete von Wrangell Fellowship (2013) Invited Talks (Selection) Keynote at the International Symposium on End-User Development (IS-EUD) 2025. “Can Learners Design Their Future? Promoting Agency with Large Language Models in Education”Invited talk on “Augmenting Human Potential through Human-Centered AI and Attention-Aware Systems”, University of Tokyo – Institute of Industrial Science (Interactive Visual Intelligence Lab, Prof. Yusuke Sugano), 2025Keynote speech: Unseen Cues: Imperceptible Gaze Guidance in Extended Reality, Eyes of the Future: Integrating Computer Vision in Smart Eyewear, ECCV 2024Advancing Mathematical Reasoning with Large Language Models, University Würzburg, 2024Stanford Science Colloquium. Towards new ways of learning with Generative AI | Stanford Electrical Engineering , 2023Keynote „ChatGPT für mehr Bildungsgerechtigkeit bei der Tagung „Generation of Change – Chat GPT, Bildungsgerechtigkeit, Klima“ an der Ev. Akademie Tutzing , 2023Künstliche Intelligenz: Welche Potenziale bietet die (blickbasierte) Mensch-Computer-Interaktion? An der Akademie für Lehrerfortbildung und Personalführung (ALP) , 2023Ministerium für Wissenschaft, Forschung und Kunst Baden-Württemberg , 2023Anhörung im Bayerischen Landtag zum Thema \"Chancen und Risiken von KI im Wissenschaftsbetrieb\": Pressemitteilung Wissenschaftsausschuss: Anhörung \"Chancen und Risiken von KI im Wissenschaftsbetrieb\" | Bayerischer Landtag,  2023 Outreach (selection) Interview mit dem SPIEGEL: ChatGPT an Schulen und Hochschulen: Welchen Platz hat KI in Unterricht und Lehre?  ChatGPT can lead to greater equity in education  Interview: wissen.de: Wie ChatGPT Schule und Lernen verändern könnte  Interview mit BR24: Kann ChatGPT Schule ersetzen?  Rotary Magazin Artikel: Titelthema - Mehr Chancen als Risiken  KI in der Schule: Enkelejda Kasneci über Potential und Risiken (faz.net)  ChatGPT: Wie der Chatbot die Schule revolutioniert (handelsblatt.com)  Member of the steering Committee of the ACM Symposium for Eye Tracking Research and Applicatons General Chair of the ACM Symposium on Eye Tracking Research & Applications ETRA 2023 (https://etra.acm.org/2023/) and ETRA 2022 (https://etra.acm.org/2023/) Key Publications Maquiling, V., Kasneci, E., et al. (2025). In Proceedings of the ACM Symposium on Eye Tracking Research & Applications (ETRA ’25). ACM. DOI: 10.1145/3725839 (Best Paper Honorable Mention, ETRA 2025).Kasneci, G., Gasser, U., Hofmann, T. F., Kramer, G., Müller, G., Peus, C., Schönenberger, H., Kasneci, E.: Europe’s AI Imperative: A Pragmatic Blueprint for Global Tech Leadership. Position Paper. https://doi.org/10.31235/osf.io/8uyrc_v1. Technical University of Munich  (2025).Kasneci, E., Seßler, K., Küchemann, et al. (2023). ChatGPT for good? On opportunities and challenges of large language models for education. Learning and Individual Differences, 103, 102274. AbstractGoldberg, P., Sümer, Ö., Stürmer, K., Wagner, W., Göllner, R., Gerjets, P., Kasneci, E & Trautwein, U. (2021). Attentive or not? Toward a machine learning approach to assessing students’ visible engagement in classroom instruction. Educational Psychology Review, 33, 27-49. AbstractSümer, Ö., Goldberg, P., D'Mello, S., Gerjets, P., Trautwein, U., & Kasneci, E. (2021). Multimodal engagement analysis from facial videos in the classroom. IEEE Transactions on Affective Computing. AbstractGao, H., Bozkir, E., Hasenbein, L., Hahn, J. U., Göllner, R., & Kasneci, E. (2021). Digital transformations of classrooms in virtual reality. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. AbstractBozkir, E., Günlü, O., Fuhl, W., Schaefer, R. F., & Kasneci, E. (2021). Differential privacy for eye tracking with temporal correlations. Plos one, 16(8), e0255979. AbstractMore publications can be found here To top Chair for Human-Centered Technologies for Learning Prof. Dr. Enkelejda Kasneci Besucheradresse: Marsstraße 20-22 80335 München Postanschrift: Technische Universität München Arcisstraße 21 80333 München Sekretariat: Talissa Stadler Tel.: +49 89 289 24348",
  "content_length": 9246,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:42"
}