{
  "name": "Enrico M. Malatesta",
  "homepage": "https://cs.unibocconi.eu/people/enrico-maria-malatesta",
  "status": "success",
  "content": "Enrico Maria Malatesta | Department of Computing Sciences Skip to main content Open shareCloseShareClose Enrico Maria Malatesta I graduated in theoretical physics at Sapienza University of Rome under the supervision of Giorgio Parisi in 2015.I then got a PhD in physics at University of Milan in 2018, under joint supervision of Sergio Caracciolo and Giorgio Parisi. From 2018 to 2021 I was a post doc in the artificial intelligence lab in Bocconi University.I am now an assistant professor in Bocconi University.Assistant Professorenrico.malatesta@unibocconi.itDownload the cv (42.06 KB)Research interestsI am mainly interested in the statistical physics of disordered systems (i.e. spin glasses) and their interdisciplinary applications, ranging from constrained optimization problems, to machine learning and high dimensional statistics.  Selected Publications Annesi, Brandon Livio; Lauditi, Clarissa; Lucibello, Carlo; Malatesta, Enrico M.; Perugini, Gabriele; Pittorino, Fabrizio; Saglietti, Luca Star-shaped space of solutions of the spherical negative perceptron PHYSICAL REVIEW LETTERS, 2023 Baldassi, Carlo; Malatesta, Enrico M.; Perugini, Gabriele; Zecchina, Riccardo Typical and atypical solutions in nonconvex neural networks with discrete and continuous weights PHYSICAL REVIEW. E, 2023 Negri, Matteo; Lauditi, Clarissa; Perugini, Gabriele; Lucibello, Carlo; Malatesta, Enrico Storage and learning phase transitions in the random-features Hopfield model PHYSICAL REVIEW LETTERS, 2023 C. Baldassi, C. Lauditi, E. M. Malatesta, R.Pacelli, G. Perugini, R. Zecchina Learning through atypical \"phase transitions'' in overparameterized neural networks arxiv Baldassi, Carlo; Lauditi, Clarissa; Malatesta, Enrico M.; Perugini, Gabriele; Zecchina, Riccardo Unveiling the Structure of Wide Flat Minima in Neural Networks PHYSICAL REVIEW LETTERS, 2021 Baldassi, Carlo; Malatesta, Enrico M.; Zecchina, Riccardo Properties of the geometry of solutions and capacity of multilayer neural networks with rectified linear unit activations PHYSICAL REVIEW LETTERS, 2019 Giorgini L. T.; Jentschura U. D.; Malatesta E. M.; Parisi G.; Rizzo T.; Zinn-Justin J. Two-loop corrections to the large-order behavior of correlation functions in the one-dimensional N -vector model PHYSICAL REVIEW D, 2020 Enrico M. ,malatesta; Giorgio Parisi; Gabriele, Sicuro Fluctuations in the random-link matching problem PHYSICAL REVIEW. E, 2019 Capelli, Riccardo; Caracciolo,sergio; Di Gioacchino,andrea; Malatesta, Enrico M. Exact value for the average optimal cost of the bipartite traveling salesman and two-factor problems in two dimensions PHYSICAL REVIEW. E, 2018Teaching20883COMPLEX SYSTEMS AND PHYSICAL MODELS 30547FOUNDATIONS OF PHYSICS II MenuResearch interestsSelected PublicationsTeaching",
  "content_length": 2774,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:44"
}