{
  "name": "Enrico Tronci",
  "homepage": "https://sites.google.com/di.uniroma1.it/enrico-tronci/home",
  "status": "success",
  "content": "enrico-tronciSearch this siteEmbedded FilesSkip to main contentSkip to navigationEnrico Tronci Teaching & ResearchContactsEnrico TronciComputer Science DepartmentSapienza University of RomeVia Salaria 11300198 RomaItalyTelephone: +39 06 4991 8361Email: tronci@di.uniroma1.itResearch Web Page: https://raise.uniroma1.itLaurea Triennale in InformaticaFALL Semester Ingegneria del Software (SE) - AA 2024/25.Codice OPIS: L6W7560F All info about the course syllabus, material, exams, and projects will be available on the Sapienza e-learning platform: https://elearning.uniroma1.it/ under the course \"Software Engineering - AY 2025/26\". Start date: Monday, 29 September 2025 Class Schedule:Monday 10-13, Aula MagnaThursday  16-18, Aula Magna Please register for the \"Software Engineering\" course on https://elearning.uniroma1.it/  to allow easy communication. Spring Semester Verifica e Validazione dei Sistemi intelligenti / (V&V) - AA 2025/26Codice OPIS corso in presenza: REKUSTJ8Codice OPIS corso in teledidattica: 5U6IQ7F2 Start date:  Class Schedule: Tuesday, 10.30 am - 1 pm, Aula T1, Edificio E, Viale Regina Elena 295, RomaWednesday, 11.00 am - 1 pm, Aula S1, Edificio E, Viale Regina Elena 295, Roma Please register with the \"Verifica e Validazione dei Sistemi intelligenti \" course at https://elearning.uniroma1.it/ to allow easy communication.See course web page on: https://elearning.uniroma1.it/Master's Degree in Computer Science/Laurea Magistrale in InformaticaFALL Semester Automatic Verification of Intelligent Systems (AVIS) - AY 2024/25Codice OPIS: H0KTWIBU All course syllabus information, material, exams, and projects will be available on the Sapienza e-learning platform: https://elearning.uniroma1.it/ under the course \"Automatic Verification of Intelligent Systems - AY 2023/24\". Start date: Monday, 29 September 2025 Class Schedule:Monday 17.00-19.00, Aula G50, Viale Regina Elena 295, Building G.Thursday 11.00-14.00, Aula G50, Viale Regina Elena 295, Building G.  Please register with the \"Automatic Verification of Intelligent Systems\" course on https://elearning.uniroma1.it/  to allow easy communication. See course web page on: https://elearning.uniroma1.it/Thesis and ProjectsLinked to ongoing research projects, I have many theses available for undergraduate students (Laurea Triennale) as well as for graduate students (Laurea Magistrale). Basically all theses involve, at different degrees, methods and tools from Software Engineering (SE), Artificial Intelligence (AI), Reinforcement Learning (RL) and Model Checking (MC). Here is a (non-exhaustive) list of topics: AI, Model-Checking, and Reinforcement Learning for Automated Design of Intelligent SystemsAutomatic Design of Intelligent Systems Automatic Design of Cyber-Physical SystemsAutomatic Design of Software SystemsSimulation-based design of Intelligent Systems from Digital Twins.Automatic anomaly detection and forecasting systems (e.g., predictive maintenance, trading agents, etc).AI, Model-Checking, and Reinforcement Learning for Bioinformatics Identification of biomarkers (e.g., for cancer) from gene expression dataInferring Gene Regulatory Networks from Time Series DataIn-silico trial through digital twins (Virtual Patients) based on Biochemical Networks and data from repositories such as https://elixir-europe.org/services/tag/data-resources AI, Model-Checking, and Reinforcement Learning for Smart GridsSoftware-based management of Smart GridsAutomatic management of electric grids with renewables and energy storage systems Available Industrial Theses Through collaborations with leading Industries, many theses are available for undergraduate (Laurea Triennale) and graduate (Laurea Magistrale) students. Here is a (non-exhaustive) list of topics (in English or Italian, as they were provided). Algoritmi per Fusione dati sensoriali provenienti da veicoli unmanned: la tematica è quella della data-fusione tra i dati provenienti dai sensori afferenti al payload dei veicoli unmanned in movimento, con i dati dei sensori a bordo del veicolo ospitante (es. Nave). Studiare i paper sullo stato dell'arte e progettare/implementare l'algoritmo più idoneo al dominio applicativo. Studenti corso di laurea Magistrale.  Contattere Enrico Tronci: tronci@di.uniroma1.it Data distribution su dati semi-strutturati e gerarchici nel dominio del Comando e Controllo: studiare lo stato dell'arte, analizzare i cots disponibili (es. Apache Kafka) e realizzare i benchmark, al fine di selezionare il più idoneo al dominio applicativo. Studenti corso di laurea Magistrale.  Contattere Enrico Tronci: tronci@di.uniroma1.it Avatar per scenari di training cooperante: alcuni sistemi di Comando e Controllo necessitano la cooperazione di più operatori umani con Ruoli operativi distinti per condurre a compimento una operazione militare (es. Catena di ingaggio). Studiare una soluzione basata sull'Intelligenza Artificiale che possa implementare la virtualizzare di uno degli operatori cooperanti (Avatar) con cui l’operatore fisico in training possa cooperare in esercitazioni con scenari reali e interattivi. Studenti corso di laurea Magistrale.  Contattere Enrico Tronci: tronci@di.uniroma1.it Riconoscimento automatico tramite reti neurali della \"classifica\" di oggetti sensore: le classficazioni di dominio e categoria degli oggetti effettuate dal software dei radar non sono spesso affidabili e necessitano di interazioni dell'operatore per confermare/sovrascrivere quelli proposti. Studiare una soluzione basata sull'intelligenza Artificiale che, tramite una rete neurale, vada a classificare per gli oggetti rilevati dai sensori (radar) connessi con il C2 il \"dominio\" (Land, Surface, Air, Undewater, Space) e la categoria (persone, automobili, carri, navi, imbarcazioni, aerei, droni, uccelli, ecc) basandosi sui dati relativi alla dinamicità della loro cinematica (no immagini). Studenti corso di laurea Magistrale.  Contattere Enrico Tronci: tronci@di.uniroma1.it Data mining sui dati volatili da sensori e da C2: i Big Data sono un tema largamente applicato in molti contesti di business, ma scarsamente nei sistemi real-time o near-real-time come quello del Comando e Controllo, dove la \"volatilità\" dei dati grezzi dei sensori o dei dati elaborati dal C2 hanno una valenza solo nell'istante di utilizzo da parte degli operatori, per poi perdersi a meno di casi specifici. Data la valenza preziosa che al giorno d'oggi viene attribuita ai dati, si richiede di studiare una soluzione che vada a progettare un framework di Data Mining per la memorizzazione dei dati del sistema C2 al fine di supportare l'operatore con feature di inferenza strategico/tattica e business intelligence. Studenti corso di laurea Magistrale.  Contattere Enrico Tronci: tronci@di.uniroma1.itResearchInfo on my research activity: https://raise.uniroma1.itReport abusePage detailsPage updated Report abuse",
  "content_length": 6880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:44"
}