{
  "name": "Enrique Mallada",
  "homepage": "https://mallada.ece.jhu.edu",
  "status": "success",
  "content": "Enrique Mallada's Home Page Skip to content Associate Professor • Electrical & Computer Engineering • (he/him/his) Barton Hall 312 • 3400 N Charles St • Baltimore • MD 21218phone: 410-516-7018 • fax: 410-516-5566 • mallada [at] jhu [dot] edu I have been an associate professor in Electrical and Computer Engineering (ECE) at Johns Hopkins University (JHU) since July 2022. I earned my Ph.D. in ECE with a minor in Applied Mathematics from Cornell University in Jan 2014 under the supervision of an awesome advisor and person, Prof. A. Kevin Tang. Before joining JHU as an assistant professor in Jan 2016, I was a postdoctoral scholar at the Center for the Mathematics of Information (CMI) in the Computational and Mathematical Sciences (CMS) department at Caltech from 2013 to 2015, where I had the pleasure to be mentored by Prof. Steven Low and Prof. Adam Wierman. Originally from Montevideo, Uruguay, I completed my B.S. in Telecommunications Engineering at ORT University, where I was also a research assistant in the MATE group led by Prof. Fernando Paganini, the person who introduced me to the joy of research. Research Interests Networked Systems: coupled oscillators, clock synchronization, saddle-flows, network coherence, distributed coordination, consensus Power Systems: frequency control, inverter-based control, real-time congestion management, electricity markets, reduced-order models Optimization: time-varying optimization, primal-dual algorithms, semidefinite programming, sum-of-squares optimization Machine Learning: reinforcement learning, sparse recovery, subspace preserving recovery, network tomography, multi-armed bandits Recent Talks A complete list of talks can be found here. 2025-07-09: Nonparametric Analysis and Control of Dynamical Systems: Stability, Safety and Policy Improvement, Chinese University of Hong Kong @ Shenzhen. [BibTeX] [Abstract] [Download PDF] This talk presents a novel nonparametric framework for analyzing dynamical systems and synthesizing control policies that relies purely on trajectory data and is designed to exploit GPU parallelization for scalability. The key insight behind this work is to relax strict objectives, such as invariance and optimality, and replace them with weaker conditions that enable a flexible trade-off between accuracy, computational complexity, and sample efficiency. First, we introduce the concept of recurrence, a relaxation of invariance that allows trajectories to leave a set temporarily before returning within a finite time. This relaxed condition serves as a functional substitute for invariance and provides an alternative foundation for analyzing dynamical systems. By leveraging recurrence, we develop integral Lyapunov and barrier function conditions, where function values are required to be eventually monotonic over a finite time window rather than strictly increasing or decreasing. This relaxation offers a more flexible framework for stability and safety verification, enabling a trade-off between verification accuracy and computational complexity. Next, we turn to the policy optimization problem and introduce a class of nonparametric policies designed for continuous action spaces. These policies rely purely on (expert) trajectory data to construct a nonparametric lower bound, Q_lb, on the optimal action-value function Q^⋆. Crucially, we show that this policy representation admits a policy improvement theorem, overcoming a key limitation faced by function approximation methods in continuous action spaces. Building on this result, we develop a practical algorithm that drives continual policy improvement by selectively incorporating new expert demonstrations, ensuring efficient data use while achieving monotonic performance gains. @talk{cuhk-sz25, abstract = {This talk presents a novel nonparametric framework for analyzing dynamical systems and synthesizing control policies that relies purely on trajectory data and is designed to exploit GPU parallelization for scalability. The key insight behind this work is to relax strict objectives, such as invariance and optimality, and replace them with weaker conditions that enable a flexible trade-off between accuracy, computational complexity, and sample efficiency. First, we introduce the concept of recurrence, a relaxation of invariance that allows trajectories to leave a set temporarily before returning within a finite time. This relaxed condition serves as a functional substitute for invariance and provides an alternative foundation for analyzing dynamical systems. By leveraging recurrence, we develop integral Lyapunov and barrier function conditions, where function values are required to be eventually monotonic over a finite time window rather than strictly increasing or decreasing. This relaxation offers a more flexible framework for stability and safety verification, enabling a trade-off between verification accuracy and computational complexity. Next, we turn to the policy optimization problem and introduce a class of nonparametric policies designed for continuous action spaces. These policies rely purely on (expert) trajectory data to construct a nonparametric lower bound, Q_lb, on the optimal action-value function Q^⋆. Crucially, we show that this policy representation admits a policy improvement theorem, overcoming a key limitation faced by function approximation methods in continuous action spaces. Building on this result, we develop a practical algorithm that drives continual policy improvement by selectively incorporating new expert demonstrations, ensuring efficient data use while achieving monotonic performance gains.}, annote = {Enrique Mallada is an Associate Professor of Electrical and Computer Engineering at Johns Hopkins University, where he has been a faculty member since 2016. He received his Ph.D. in Electrical and Computer Engineering with a minor in Applied Mathematics from Cornell University and a Telecommunications Engineering degree from ORT University, Uruguay. Before joining Hopkins, he was a Postdoctoral Fellow at Caltech's Center for the Mathematics of Information. His honors include the Johns Hopkins Alumni Association Teaching Award (2021), NSF CAREER Award (2018), Caltech's CMI Fellowship (2014), and Cornell ECE Director's Thesis Award (2014). His research spans control and dynamical systems, machine learning, and optimization, with applications to safety-critical systems, networks, and power grids.}, date = {07/09/2025}, day = {09}, event = {Chinese University of Hong Kong @ Shenzhen}, host = {Yan Jiang}, month = {07}, role = {Lecturer}, title = {Nonparametric Analysis and Control of Dynamical Systems: Stability, Safety and Policy Improvement}, url = {https://mallada.ece.jhu.edu/talks/202507-CUHK-SZ.pdf}, year = {2025} } 2025-07-09: Nonparametric Analysis and Control of Dynamical Systems: Stability, Safety and Policy Improvement, Tsinghua University. [BibTeX] [Abstract] [Download PDF] This talk presents a novel nonparametric framework for analyzing dynamical systems and synthesizing control policies that relies purely on trajectory data and is designed to exploit GPU parallelization for scalability. The key insight behind this work is to relax strict objectives, such as invariance and optimality, and replace them with weaker conditions that enable a flexible trade-off between accuracy, computational complexity, and sample efficiency. First, we introduce the concept of recurrence, a relaxation of invariance that allows trajectories to leave a set temporarily before returning within a finite time. This relaxed condition serves as a functional substitute for invariance and provides an alternative foundation for analyzing dynamical systems. By leveraging recurrence, we develop integral Lyapunov and barrier function conditions, where function values are required to be eventually monotonic over a finite time window rather than strictly increasing or decreasing. This relaxation offers a more flexible framework for stability and safety verification, enabling a trade-off between verification accuracy and computational complexity. Next, we turn to the policy optimization problem and introduce a class of nonparametric policies designed for continuous action spaces. These policies rely purely on (expert) trajectory data to construct a nonparametric lower bound, Q_lb, on the optimal action-value function Q^⋆. Crucially, we show that this policy representation admits a policy improvement theorem, overcoming a key limitation faced by function approximation methods in continuous action spaces. Building on this result, we develop a practical algorithm that drives continual policy improvement by selectively incorporating new expert demonstrations, ensuring efficient data use while achieving monotonic performance gains. @talk{tsinghua25automation, abstract = {This talk presents a novel nonparametric framework for analyzing dynamical systems and synthesizing control policies that relies purely on trajectory data and is designed to exploit GPU parallelization for scalability. The key insight behind this work is to relax strict objectives, such as invariance and optimality, and replace them with weaker conditions that enable a flexible trade-off between accuracy, computational complexity, and sample efficiency. First, we introduce the concept of recurrence, a relaxation of invariance that allows trajectories to leave a set temporarily before returning within a finite time. This relaxed condition serves as a functional substitute for invariance and provides an alternative foundation for analyzing dynamical systems. By leveraging recurrence, we develop integral Lyapunov and barrier function conditions, where function values are required to be eventually monotonic over a finite time window rather than strictly increasing or decreasing. This relaxation offers a more flexible framework for stability and safety verification, enabling a trade-off between verification accuracy and computational complexity. Nex",
  "content_length": 113204,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:48"
}