{
  "name": "Enrico H. Gerding",
  "homepage": "https://www.ecs.soton.ac.uk/people/eg",
  "status": "success",
  "content": "Professor Enrico Gerding | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Professor Enrico Gerding Professor Research interests artificial intelligence autonomous agents and multi-agent systems algorithmics game theory More research Accepting applications from PhD students. Connect with Enrico Email: eg@ecs.soton.ac.uk Tel: +44 23 8059 9201 ORCID LinkedIn On this page About Research Publications External roles and responsibilities Biography About Research Publications External roles and responsibilities Biography About Professor Enrico Gerding is head of the Agents, Interaction and Complexity (AIC) research group in the Department of Electronics and Computer Science (ECS) at the University of Southampton. He has been an academic at Southampton since 2007. He received his PhD from the Dutch National Center of Mathematics and Computer Science (CWI) in 2004. His research focuses on artificial intelligence, specifically autonomous agents and multi-agent systems. He has more than 130 peer-reviewed publications in high quality conferences, journals and books in this area. Please see the research tab below for details. Enrico has supervised 27 PhD students to completion. He is the director of UKRI AI Centre for Doctoral Training in AI for Sustainability which trains 70 PhD students in the application of AI to improve the environment. Since 2020 he is a board member of the International Foundation for Autonomous Agents and Multiagent Systems (IFAAMAS) which organises the annual Autonomous Agents and Multiagent Systems (AAMAS) conference. He is also local organiser of AAMAS 2021 and AAMAS2023. He teaches the MSc modules Intelligent Agents and Computational Finance. Currently he is a co-I on several funded projects, including the EPSRC-funded AutoTrust platform grant, the Shell-funded Centre for Maritime Futures. PhD Studentships. I'm interested in supervising motivated students in the area of AI and multi-agent systems. Please get in touch to discuss the options and potential topics. Check out the UKRI AI Centre for Doctoral Training in AI for Sustainability which has opportunities for 70 PhD students in the area of AI and environmental sustainability. Research Research interests artificial intelligence autonomous agents and multi-agent systems algorithmics game theory mechanism design and incentive engineering smart grid Current research My main research focuses on applications where autonomous self-interested agents compete in markets and negotiate, and where designing appropriate incentives is important to ensure a well functioning and fair society. My research combines theory, mainly game theory and mechanism design, with practical applications. Specific applications include: autonomous vehicles, the smart grid, online advertising markets, cloud computing, algorithmic trading, ride sharing and data privacy. I'm currently an investigator on the following projects: AutoTrust: Human Centered Internet of Vehicles This EPSRC-funded platfrom grants looks at a wide range of aspects around the Connected and Autonomous Vehicles (CAVs), such as the interaction with autonomous systems (human-to-vehicle interaction), the issue of data privacy and consent, as well as the incentives and optimisation of e.g. traffic flow. Specific topics include: how do platoons form and how can they be used most effectively to improve traffic flow; how can we incentivise better use of public transport and/or shared vehicles (ride sharing); how can we best combine different modes of transport to reduce carbon emissions; how can we ensure that transportation data can be stored securely and used for research purposes; in autonomous vehicles and autonomous systems more generally, how can we reason about concepts such as responsibility and accountability especially when there is shared responsibility of a coalition (e.g. in case of a collision). The project is a collaboration with the Warwick Manufacturing Group (WMG). Investigators on the project in Southampton are: prof m.c. schraefel (PI) and Dr Sebastian Stein. Researchers currently employed on the project include: Dr Vahid Yazdanpanah and Dr Richard Gomer. Forecasting and influencing product returns and fraud rates in a Covid-19 world This ESRC project is led by Dr Gina Frei from the Southampton Business School and is a collaboration between ECS and the business school. The aim is to look at product returns fraud which has been aggravated due to COVID 19. Many retailers are faced with this issue. The project will consider different interventions to reduce fraud and analyse through a combination of interview studies and agent-based modelling. Shell Centre for Maritime Futures This collaboration between Shell Shipping, ECS and Engineering aims to reduce carbon emissions in shipping. The ECS team is building an agent-based simulation platform to simulate trades and shipping routes, which can be used to find the most cost effective CO2 reduction measures over a long-term (5-20 years) time horizon. Past projects include: Meaningful Consent in the Digital Economy Current PhD students: Charles Hutchins, Behrad Koohy, Alex Masterman, Gongewei Shi, Ian Henderson, Hugo Webber, Jessica Newman Past students: Simon Williamson (2010), Bing Shi (2011), Colin Williams (2012), Ali Aseere (2012), Harry Rose (2013), Lampros Savrogiannis (2014), Ash Booth (2016), Chetan Mehra (2016), Chris Hughes (2017), Sofia Ceppi, Mohamed Bakoush (2018), Valerio Restocchi (2018), Radu Pruna (2018), Ibrahem Almansour (2018), Efstathios Zavvos (2019), Laurie Carver (2019), Fatma Habib (2020), Alvaro Perez (2020), Vincent Marmion (2020), Dorota Filipczuk (2021), Jan Buermann (2021), Manuel Nunes (2022), Fan Bi (2022), Nicholas (Nick) Bishop (2022), Phuriwat (Turk) Worrawichaipat (2023), Zhaori (Charles) Guo (2023), Zhongqi Cai (2023) Research projects Completed projects EuroCores Logiccc: Computational Foundations Of Social Choice Researchers: Professor Enrico Gerding Sponsor: ESRC KTI - Dr Enrico Gerding Researchers: Professor Enrico Gerding Sponsor: Crimson Tangerine Ltd Complex Computational Systems Researchers: Professor Enrico Gerding , Professor Adam Prugel-Bennett Sponsor: EPSRC SIMM: Services For Intelligent Mobility Management Researchers: Professor Enrico Gerding Sponsor: EPSRC Meaningful Consent in the Digital Economy Researchers: Professor m.c. Schraefel Professor Enrico Gerding , Professor Michael Vlassopoulos Sponsor: EPSRC Forecasting and influencing product returns and fraud rates in a Covid-19 world Researchers: Gary Wills , Professor Enrico Gerding , Professor PK Senyo , Doctor Steffen Bayer Ethnic minority business data in the UK Researchers: Professor Ajit Nayak Professor Enrico Gerding AutoTrust: Human-Cyber Design for Resiliant, Useful, Usable Internet of Vehicles Researchers: Professor m.c. Schraefel Professor Enrico Gerding , Professor Sebastian Stein Sponsor: EPSRC Publications Adaptive pricing and learning in the multi-market routing problem Behrad Koohy, Vahid Yazdanpanah, Sebastian Stein & Enrico Gerding, 2025 Type: conference Proceedings of the international workshop on AI systems for the environment (AISE-2025) Enrico Gerding, Simon Parsons, Roxana Rădulescu, Samarth Swarup, Zita Vale & Vahid Yazdanpanah, 2025 Type: book A flying ad-hoc network dataset for early time series classification",
  "content_length": 33742,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:46"
}