{
  "name": "Enyi Tang",
  "homepage": "https://software.nju.edu.cn//eytang/index.html",
  "status": "success",
  "content": "软件学院 Enyi Tang Associate Professor PhD Supervisor 电话：(+86) 25-83621360 邮箱： 地址：Software Institute of Nanjing University, Nanjing, Jiangsu, China 办公地址：Room 913, Feiyiming Building 邮编：210093 Research My research interests span numerical system, program analysis, software testing, and AI infrastructure. Now I focus my research on improve software reliability and programming productivity with both the traditional and intelligent techniques. Major Grants National Science Foundation of China (General Program), 62172210, Principal Investigator National Science Foundation of China (General Program), 61772260, Principal Investigator National Science Foundation of China (Youth Fund), 61402222, Principal Investigator Open Foundation of State Key Laboratory for Novel Software Technology in Nanjing University, ZZKT2016B11, Principal Investigator Open Foundation of State Key Laboratory for Novel Software Technology in Nanjing University, ZZKT2014B06, Principal Investigator Open Foundation of State Key Laboratory for Novel Software Technology in Nanjing University, ZZKT2013B09, Principal Investigator National 863 High-Tech Programme of China, 2011AA010103, Participant Selected Publications Shuoxiao Zhang, Enyi Tang*, Haoliang Cheng, Xinyu Gao, An Guo, Jianhua Zhao, Xin Chen, Linzhang Wang, Na Meng, and Xuandong Li. BlockSOP: A blockchain-based software management platform for open collaborative development. Journal of Systems and Software(JSS), 2025,230 Shuoxiao Zhang, Enyi Tang*, Xinyu Gao, Zhekai Zhang, Yixiao Shan, Haofeng Zhang, Ziyang He, Jianhua Zhao, and Xuandong Li. 2025. Exploring the Effectiveness of Open‐Source Donation Platform: An Empirical Study on Opencollective. Journal of Software: Evolution and Process(JSEP), 2025,37(7) Yan Zhao, Enyi Tang, Haipeng Cai, Xi Guo, Wang, Xiaoyin, Na Meng: A Lightweight Approach of Human-Like Playtesting. 2022 IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER 2022), Honolulu, United States, pp 309-320, 2022 Xie Wang, Huaijin Wang, Zhendong Su, Enyi Tang*, Xin Chen, Weijun Shen, Zhenyu Chen, Linzhang Wang, Xianpei Zhang and Xuandong Li. Global Optimization of Numerical Programs via Prioritized Stochastic Algebraic Transformations. In Proceedings of International Conference on Software Engineering (ICSE 2019), Montreal, Canada, pp 1131-1141, 2019 Enyi Tang*, Xiangyu Zhang, Norbert Th. Müller, Zhenyu Chen*, and Xuandong Li. Software Numerical Instability Detection and Diagnosis by Combining Stochastic and Infinite-precision Testing. IEEE Transactions on Software Engineering (TSE), 2017,43(10):975-994 Chucheng Zhang, Haoliang Cheng, Enyi Tang*, Xin Chen, Lei Bu, Xuandong Li. Sketch-Guided GUI Test Generation for Mobile Applications. In: Proceedings of the 32nd IEEE/ACM International Conference on Automated Software Engineering (ASE 2017), USA, 2017 Enyi Tang, Earl T. Barr, Xuandong Li, Zhendong Su. Perturbing numerical calculations for statistical analysis of floating-point program (in)stability, In: Proceedings of the 19th International Symposium on Software Testing and Analysis (ISSTA 2010), New York, USA, pp 131-142, 2010 Enyi Tang, Linzhang Wang, Jianhua Zhao, Xuandong Li. Time-leverage points detection for time sensitive software maintenance. In: Proceedings of the 28th IEEE International Conference on Software Maintenance (ICSM 2012), Riva del Garda,Italy, pp 567-570, 2012 Enyi Tang, Earl Barr, Zhendong Su, Xuandong Li. Program instability detection based on systematically optimized numerical perturbation. SCIENTIA SINICA Informationis, 2014,44(11):1445-1466 Enyi Tang, Xuandong Li. Time-Leverage Points Detection for Software Maintenance. Chinese Journal of Computers, 2013,36(12):2455-2467 Enyi Tang, Yan Zhou, Jiansheng Ou, Xin Chen. Test generation approach guided by linear fitting for condition/decision coverage criteria, Journal of Software, 2016,27(3):593-610 Zuwei Zhao, Shining Feng, Enyi Tang*, Xin Chen, Xuandong Li, Minxue Pan, Chen Zhao. A Symbolic Execution Guided Inner Loop Bound Analysis, Acta Electronica Sinica, 2017 Patents & Software Copyright US 10,719,430 B2, CN202411650905.3, CN202210418068.6, CN202110438904.2, CN201910811776.4, CN201810001948.7, CN201610408581.1, CN201510892012.4, CN201410589530.4, CN201410520726.8, 2015SR149614, 2017R11L1186367, 2017R11L1186400, 2021SR2005323, 2022SR0986384 Professional Activities Co-Editor: Journal of Software 2021(7) PC and Session Chair: SANER 2019,  NASAC 2020 Registration Co-Chairs: APSEC 2017 . Teaching For more information of my courses, please visit our Course Management System(CMS) . Data Structure Linux Programming Software Architecture Multicore Programming Practices of Software Engineering",
  "content_length": 4708,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:44"
}