{
  "name": "Eran Tromer",
  "homepage": "https://cs-people.bu.edu/tromer",
  "status": "success",
  "content": "Eran Tromer Eran Tromer (ערן טרומר) Professor Department of Computer Science and Questrom School of Business Boston University Director of Graduate Studies, Department of Computer Science Office: CDS (665 Commonwealth Ave., Boston, MA) room 947 Office hours: Tuesdays 3:30-4:30pm and Thursdays 3:30-4:00pm e-mail: tromer at.sign bu.edu I am a Professor at Boston University's Department of Computer Science and Questrom School of Business. My research focus is information security, cryptography and algorithms. I am particularly interested in what happens when cryptographic systems meet the real world, where computation is faulty and leaky. I head the Laboratory for Experimental Information Security (LEISec), where my group investigates side-channel information leakage in computers through physical emanations (e.g., acoustic, electric and electromagnetic) and software (e.g., cache contention in local and cloud computing), and networks (e.g., identifying encrypted videos). I cofounded SCIPR Lab, where we construct cryptographic zero-knowledge SNARK proof systems for ensuring the integrity of computation conducted on untrusted, faulty and malicious platforms; and the ZKProof.org standardization effort for such schemes. I'm interested in blockchain-based cryptographic protocols, and am a founding scientist of the Zcash privacy-preserving cryptocurrency which implements our Zerocash protocol, and a founder of Sealance Corp. which builds blockchain-based privacy-preserving financial regulation technology. Other research interests include machine learning security, tamper resilience, homomorphic encryption, special-purpose code-breaking hardware and various aspects of network and systems security. See my publications for more information. I formerly taught and pursued my research at Columbia University, Tel Aviv University, Microsoft Research and MIT, and received my Ph.D. at the Weizmann Institute of Science.",
  "content_length": 1940,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:48"
}