{
  "name": "Erdem Varol",
  "homepage": "https://www.neuroinformaticslab.com",
  "status": "success",
  "content": "Neuroinformatics Lab 0 Neuroinformatics labWe develop computational models and signal processing tools to decode brain connectivity and function using genomics and imaging. We are particularly interested in constructing a bridge between genetics and behavior through interpretable models that operate on multi-modal neural data at molecular, circuit and whole-brain resolutions.Apply for Ph.D. student and postdoctoral positions now (see below). Erdem Varol (PI) I’m an assistant professor at the Department of Computer Science & Engineering at Tandon School of Engineering, NYU. I’m also a part of the VIDA center. Previously, I was a postdoc at the Department of Statistics, Zuckerman Institute, Columbia University with Liam Paninski. Before that, I did my Ph.D. at the Department of Electrical & Systems Engineering at the University of Pennsylvania under Christos Davatzikos. Whilst at Penn, I also received an A.M degree in Statistics from the Wharton School. I recently received the NIH/NIMH K99/R00 award in 2022. I’m originally from Ankara, Turkey and grew up in New York City. I have two basset hounds.Email: ev2240@nyu.eduCV: [Link]Google Scholar: [Link]Twitter: [Link] Team Alex RatzanPh.D student (2023 - present)Previously @ Tufts UniversityWebsite Tianxiao HePh.D student (2023 - present)Previously @ Columbia UniversityWebsite Margaret Conde Paredes(co-advised w/ Attila Losonczy)Ph.D. student (2023 - present)Previously @ UCLWebsite: TBD Sid GoelPh.D. student (2024 - present)Previously @ UC BerkeleyWebsite Visweswar Sirish ParupudiM.S. Student (2025 - present)Previously @ BITS Pilani HyderabadWebsite Nalini RamanathanM.S. student (2024 - present)Previously @ Dartmouth CollegeWebsite Lawrence LuM.S. Student (2025 - present)Previously @ National Taipei University of TechnologyWebsite Uttam SinghM.S. Student (2025 - present)Previously @ NIT RourkelaWebsite Sherlock & Toby the Basset HoundsLab mascots (2017 - present, 2021 - present)Website Subhrajit DeyM.S. Student (2025 - present)Previously @ Jadavpur UniversityWebsite Alumni Chenyi LiM.S. student (2024 - 2025) - Presently PhD student at CornellWebsite Rohaan AdvaniM.S. student (2024 - 2025)Website Aditya ChichgareM.S. student (2024 - 2025)Website Allen HungM.S. student (2024 - 2025)Website Justin HwangM.S. student (2025)Website Rishabh RajM.S. student (2024 - 2025) - Presently at Goldman SachsWebsite Chinmayan PradeepM.S. student (2024 - 2025)Website Akshat Sachin ShahaM.S. student (2024 - 2025)Website Malhar PatelM.S. Student (2024 - 2025) - Presently at AmazonWebsite Daniela ShohamUndergraduate SRI Scholar (2023 - present)Barnard College Rosanne CuiUndegraduate Student (2024 - present)New York University Anusha KumarHigh School Summer Intern (2024 - present)Horace Mann School Publications Link to Google Scholar 2025Neuroimaging endophenotypes reveal underlying mechanisms and genetic factors contributing to progression and development of four brain disorders; J Wen, I Skampardoni, YE Tian, Z Yang, Y Cui, G Erus, G Hwang, E Varol, ...; Nature Biomedical Engineering, 1-18Alternative splicing across the C. elegans nervous system; A Weinreb, E Varol, A Barrett, RM McWhirter, SR Taylor, I Courtney, ...; Nature communications 16 (1), 4508DREDge: robust motion correction for high-density extracellular recordings across species; C Windolf, H Yu, AC Paulk, D Meszéna, W Muñoz, J Boussard, ...; Nature methods, 1-13Decoding neuronal wiring by joint inference of cell identity and synaptic connectivity; HP Gupta, AW Azevedo, K Xing, PA Sims, E Varol, RS Mann; bioRxivIntegrating bulk and single cell RNA-seq refines transcriptomic profiles of individual C. elegans neurons; A Barrett, E Varol, A Weinreb, SR Taylor, RM McWhirter, C Cros, B Vidal, ...; BioRxiv, 2025.01. 26.634951WormID-Benchmark: Extracting Whole-Brain Neural Dynamics of C. elegans At the Neuron Resolution; J Adhinarta, J Dong, T He, J Huang, D Sprague, J Wan, HJ Lee, Z Yu, ...; bioRxiv, 2025.01. 06.631621CellSpliceNet: Interpretable Multimodal Modeling of Alternative Splicing Across Neurons in C. elegans; A Afrasiyabi, J Kovalic, C Liu, E Castro, A Weinreb, E Varol, D Miller, ...; bioRxiv, 2025.06. 22.660966Human single neural and columnar dynamics recorded by intraoperative high-density penetrating electrodes; D Meszena, A Paulk, W Munoz, M Jamali, I Caprara, B Coughlin, ...; Neuroscience Applied 4, 1054332024Exploiting correlations across trials and behavioral sessions to improve neural decoding; Y Zhang, H Lyu, C Hurwitz, S Wang, C Findling, F Hubert, A Pouget, ...; bioRxivGenetic and clinical correlates of two neuroanatomical AI dimensions in the Alzheimer’s disease continuum; J Wen, Z Yang, IM Nasrallah, Y Cui, G Erus, D Srinivasan, A Abdulkadir, ...; Translational psychiatry 14 (1), 4202P-NucTag: on-demand phototagging for molecular analysis of functionally identified cortical neurons; J Shi, B Nutkovich, D Kushinsky, BY Rao, SA Herrlinger, E Tsivourakis, ...; bioRxivAlternative splicing across theC. elegansnervous system; A Weinreb, E Varol, A Barrett, RM McWhirter, SR Taylor, I Courtney, ...Disorganized Inhibitory Dynamics in Hippocampal area CA1 of 22q11. 2 Deletion Mutant Mice; SA Herrlinger, BY Rao, MEC Paredes, AL Tuttman, H Arain, E Varol, ...; bioRxiv, 2024.04. 28.5914642023Bypassing spike sorting: Density-based decoding using spike localization from dense multielectrode probes; Y Zhang, T He, J Boussard, C Windolf, O Winter, E Trautmann, N Roth, ...; Advances in Neural Information Processing Systems 36, 77604-77631; NeurIPS 2023 (Spotlight)Modified Neuropixels probes for recording human neurophysiology in the operating room; B Coughlin, W Muñoz, Y Kfir, MJ Young, D Meszéna, M Jamali, I Caprara, ...; Nature protocols 18 (10), 2927-2953Neuroimaging-AI Endophenotypes of Brain Diseases in the General Population: Towards a Dimensional System of Vulnerability; J Wen, I Skampardoni, YE Tian, Z Yang, Y Cui, G Erus, G Hwang, E Varol, ...; Medrxiv: the Preprint Server for Health SciencesLearning Probabilistic Piecewise Rigid Atlases of Model Organisms via Generative Deep Networks; A Nejatbakhsh, N Dey, V Venkatachalam, E Yemini, L Paninski, E Varol; International Conference on Information Processing in Medical Imaging, 332-343; IPMI 2023. (Oral Presentation)Multimodal microscopy image alignment using spatial and shape information and a branch-and-bound algorithm; S Chen, BY Rao, S Herrlinger, A Losonczy, L Paninski, E Varol; ICASSP 2023-2023 IEEE International Conference on Acoustics, Speech and …Robust online multiband drift estimation in electrophysiology data; C Windolf, AC Paulk, Y Kfir, E Trautmann, D Meszéna, W Muñoz, ...; ICASSP 2023-2023 IEEE International Conference on Acoustics, Speech and …; ICASSP 2023. (Top 3% of papers)Assessment of neuroanatomical endophenotypes of autism spectrum disorder and association with characteristics of individuals with schizophrenia and the general population; G Hwang, J Wen, S Sotardi, ES Brodkin, GB Chand, DB Dwyer, G Erus, ...; JAMA psychiatry 80 (5), 498-507Psychosis brain subtypes validated in first-episode cohorts and related to illness remission: results from the PHENOM consortium; DB Dwyer, GB Chand, A Pigoni, A Khuntia, J Wen, M Antoniades, ...; Molecular psychiatry 28 (5), 2008-2017Subtyping brain diseases from imaging data; J Wen, E Varol, Z Yang, G Hwang, D Dwyer, AF Kazerooni, PA Lalousis, ...; Machine Learning for Brain Disorders, 491-5102022Genetic, clinical underpinnings of brain change along two neuroanatomical dimensions of clinically-defined Alzheimer’s disease; J Wen, Z Yang, IM Nasrallah, Y Cui, G Erus, D Srinivasan, A Abdulkadir, ...Genetic, clinical underpinnings of subtle early brain change along Alzheimer’s dimensions; J Wen, Z Yang, IM Nasrallah, Y Cui, G Erus, D Srinivasan, A Abdulkadir, ...; bioRxiv, 2022.09. 16.508329Schizophrenia imaging signatures and their associations with cognition, psychopathology, and genetics in the general population; GB Chand, P Singhal, DB Dwyer, J Wen, G Erus, J Doshi, D Srinivasan, ...; American Journal of Psychiatry 179 (9), 650-660Three imaging endophenotypes characterize neuroanatomical heterogeneity of autism spectrum disorder; G Hwang, J Wen, S Sotardi, ES Brodkin, GB Chand, DB Dwyer, G Erus, ...; medRxiv, 2022.06. 17.22276543P580. Two Schizophrenia Neuroanatomical Signatures From the PHENOM Consortium and Their Association With Psychopathology, Cognition, and Genetics in the Population-Level Samples; G Chand, P Singhal, DB Dwyer, J Wen, G Erus, E Varol, G Hwang, ...; Biological Psychiatry 91 (9), S323-S324Characterizing heterogeneity in neuroimaging, cognition, clinical symptoms, and genetics among patients with late-life depression; J Wen, CHY Fu, D Tosun, Y Veturi, Z Yang, A Abdulkadir, E Mamourian, ...; JAMA psychiatry 79 (5), 464-474Two schizophrenia imaging signatures and their associations with cognition, psychopathology, and genetics in the general population; GB Chand, P Singhal, DB Dwyer, J Wen, G Erus, J Doshi, D Srinivasan, ...; medRxiv, 2022.01. 07.22268854CeNGEN Integrated mRNA data and bulk noncoding RNA lookup table; A Barrett, E Varol, A Weinreb, SR Taylor, R McWhirter, C Cros, ...Multi-scale semi-supervised clustering of brain images: deriving disease subtypes; J Wen, E Varol, A Sotiras, Z Yang, GB Chand, G Erus, H Shou, ...; Medical Image Analysis 75, 1023042021Three-dimensional spike localization and improved motion correction for Neuropixels recordings; J Boussard, E Varol, HD Lee, N Dethe, L Paninski; Advances in Neural Information Processing Systems 34Non-parametric vignetting correction for sparse spatial transcriptomics images; BY Rao, AM Peterson, EK Kandror, S Herrlinger, A Losonczy, L Paninski, ...; International Conference on Medical Image Computing and Computer-Assisted …Visualizing the organization and differentiation of the male-specific nervous system of C. elegans; T Tekieli, E Yemini, A Nejatbakhsh, C Wang, E Varol, RW Fernandez, ...; Development 148 (18), dev199687Molecula",
  "content_length": 21639,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:50"
}