{
  "name": "Ergun Akleman",
  "homepage": "http://www.viz.tamu.edu/faculty/ergun",
  "status": "success",
  "content": "Viz-A-GoGo 31 Attracts Record Number Of Submissions Showcasing Students’ Artistic Achievements – Texas A&M University College of Performance, Visualization & Fine Arts Skip to content NewsViz-A-GoGo 31 Attracts Record Number Of Submissions Showcasing Students’ Artistic Achievements May 13, 2024 6 min. read Dean Tim McLaughlin addresses the room before the Viz-A-Gogo screening. Photo by Megan HecklingerA year’s worth of creativity by students in the Visualization program was showcased in the 31st annual Viz-a-GoGo at Rudder Theatre on May 4.The screening is the final piece of the annual event, which includes an interactive/gaming showcase, a research symposium and a wide variety of artwork and interactive designs at the exhibition in Rudder Exhibit Hall.Andersen Wood, screening and research symposium director for Viz-a-GoGo and a junior Visualization student, said the event attracted a record number of submissions — more than 1,000 — for the screening and exhibition. A team of students whittled that down to 350 pieces.The screening brought more than 700 people to Rudder Theatre, which shows “how this program really is taking off and growing,” Wood said.“I’m so proud of all the student works that were shown,” he said. “This program produces better and better work each year and this year was no exception. I’m very grateful for all of the students who submitted their work, volunteered to help us set up and tear down the show, as well as the faculty who helped us with scholarships and the research symposium. This show doesn’t exist without a passionate student body, and there’s really nothing else like it on campus.”Tim McLaughlin, interim dean for the College of Performance, Visualization and Fine Arts, spoke before the screening and noted he has been present for all 31 editions of Viz-a-GoGo, first as a graduate student and then as a professional and an educator. He credited students throughout the school’s programs for their ability to excel in multiple areas, describing this as an “and” focus.“In Visualization, they are artists and they are scientists,” he said. “They are designers and they are programmers. They think about things in a different way than most. That gives them a special quality. They’ve come here because these programs allow them the chance to explore both sides of the brain. To work on problems and things that cannot be dealt with without combining the aesthetics and the technical. It’s the ‘and’ — they put it all together. It’s wonderful.” The very-much-alive Glen Vigus speaks before the screening. Photo by Megan Hecklinger.The ScreeningThis year’s theme was “Who Killed Glen?” — a murder mystery in honor of Glen Vigus, longtime faculty adviser for Viz-a-GoGo who also served as director of operations for the College of Performance, Visualization and Fine Arts. Vigus recently retired, and the humorous video clips interspersed throughout the screening featured students investigating his apparent death, with a plot twist at the end.The pieces included animated shorts, video game trailers, graphic design commercials and examples of rendering, shading, character animation, character surfacing and hair grooming. An unlucky mosquito named “Skeeter” starred in three animated shorts. Photo by Megan Hecklinger.A few highlights:“Teach a Fish to Man,” a sweet story of an unlikely friendship between a fisherman and a fish.“Road Rave,” a video game that encourages the user to hit all animals and obstacles on the road instead of avoiding them.“The Early Worm Gets the Bird,” a desert scene in which a bird devours a worm, but is then devoured by a giant sand worm.The pastel environment of “Lumion City,” with a character sitting down to enjoy the sunset alongside a rabbit.The continuing adventures of “Skeeter,” with three shorts starring an unlucky mosquito and a series of slapstick injuries.“Roomblade,” a video game that turns the Roomba into a weapon against some angry bunny characters.“Cluck’d Up,” starring a fox that infiltrates — then gets stuck in — a hen house, and has to resort to an alternate food source when it can’t reach its prey.The live-action short “Distraction,” chronicling a student’s lengthy quest to retrieve a flapping Monopoly dollar from a ceiling panel.“Kitty Bravo in Freefall Failure,” featuring a daredevil cat whose skydiving trip goes terribly wrong with a backpack full of random items instead of a parachute. Bill Jenks and Tim McLaughlin present Andersen Wood with the inaugural Bill Jenks Viz Lab Spirit Award, complete with a Hawaiian shirt. Photo by Megan Hecklinger.The VizziesAwards were given for different mediums, including works on display at Rudder Exhibit Hall. Scholarships from Disney, DreamWorks and Electronic Arts were also announced.The inaugural Bill Jenks Viz Lab Spirit Award, named in honor of a founding father of the Visualization program: Andersen Wood Best in Photography: “Illustration of a Moment Apart,” Li Shen Best in Graphic Design: “Focal Point,” Catherine Bao Best in Digital Flatwork: “Mastercopy of Nurlan Kulibayev’s Work,” Kosi Udeh; “Dangerous Discovery,” Kirsten Benavides Best in Sculpture: “Oscar & Felix,” Grace Wallace Best in Traditional Flatwork: “Ecstasy of Diet Coke,” Sydney Lemmon; “Leif Amundsen’s Journal,” Seth Erwin Best in CG Rendering: “Stylized Fox Groom,” Kathryn King Best in Tech Art: “Stylized Directed Study,” Travis Rainford, Addie O’Neil, Nicholas Mireles, Tim McElaney Runner-Up in Undergraduate Research: “Taste Buds,” Carter Montalbano Best in Undergraduate Research: “Biblical Works,” Gabriella Castro Best in Graduate Research: “Memento Vivere,” Emmalie Hall Best in Game Design: “Infinite Library,” Breck Ortiz, Samantha Braswell, Lydia Harding, Brack Harmon, Hope Poulter, Sammy Reel, Garrett Guerrero Best in Interactive Design: “Minnow,” Heather An and Catherine Bao Best in Time Based: “The Chronicle of Skeeter,” The Skeeter Team Best in Show: “Cluck’d Up,” Lauren Enriquez, Willis Froetschel, Kathryn King, Nimi Parmar, Glenn Powell, Travis Rainford and Gus McClain Felice House, Courtney Starrett and award winner Travis Rainford. And, via Facetime, award winner Sophie Lee. Photo by Megan Hecklinger.ScholarshipsBest Body of Work (Undergraduate): Hayden Hanna Best Body of Work (Graduate): Dominic Nguyen EA Alumni Awards: Hayden Hanna, Macie Landon DreamWorks Alumni Award: Sarah Razook Outstanding Student: Travis Rainford, Sophie Lee, Andersen Wood RAVING (Rising Aggie Vizzers in Gaming) Award: Dylan Florence, Izzy Rollo, Austin Stowe, Veronika Minina Disney Alumni Awards: Farnoush Torkzadeh, “Immersive Museums”; Nikki Moller, “Son of the Underworld”; Alyssa Curran, “Rosie, the 1950s Diner Waitress” Sarah Razook receives an award from Mayet Andreassen. Photo by Megan HecklingerInteractive/Gaming Showcase Photo by Spencer Bryant. Photo by Spencer Bryant. Photo by Spencer Bryant. Photo by Spencer Bryant. Photo by Spencer Bryant. Photo by Spencer Bryant. TagsVisualization Share this News Related News Texas A&M University Again Ranks In The Top 10 Public Schools For Game Design It is the ninth time in the past decade that the university has been ranked in the top 10. Game design is part of the Visualization program, and it is the focus of the LIVE Lab. Lyle Lovett Announced As Hagler Fellow; Will Work With Students, Faculty On Music, Interdisciplinary Projects The four-time Grammy Award winner will be among 11 Hagler Fellows and two Distinguished Lecturers inducted by the Hagler Institute for Advanced Study during its annual gala in February. WATCH NOW: Behind The Scenes Of ‘The Post-America Variety Show,’ Starting Thursday At Rudder Theatre Take a peek behind the curtain with our video that highlights the work by students, staff and faculty to create this devised theatre production. View All News",
  "content_length": 7806,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:55"
}