{
  "name": "Erhardt Barth",
  "homepage": "https://www.inb.uni-luebeck.de/mitarbeiter/mitarbeiter/professoren/erhardt-barth.html",
  "status": "success",
  "content": "Erhardt Barth: Institut für Neuro- und Bioinformatik Zur Navigation springenZum Content springenMOODLE | UNIVIS | Kontakt | Aktuelles | Impressum | Datenschutz | INTERN | English HomeMitarbeiterMitarbeiterFormulareInfos & Downloads AbschlussarbeitenFORSCHUNGDeep Learning LabProjekteAbgeschlossene ProjekteTools & DemosPartnerDissertationenLEHREaktuelle LehrveranstaltungenLunch-SeminarArchiv LehreTECHNOLOGIETRANSFERTechnologietransferAusgründungenPUBLIKATIONEN INB | Institut für Neuro- und Bioinformatik Universität zu Lübeck - INB - Mitarbeiter - Mitarbeiter Prof. Dr.-Ing. Erhardt Barth Stellvertretender Direktor Institut für Neuro- und Bioinformatik Ratzeburger Allee 160 (Geb. 64) 23562 Lübeck Email: erhardt.barth(at)uni-luebeck.de Phone: +49 451 3101 5503 Fax: +49 451 3101 5504 Current research interests Main research interests are in Computer Vision and Machine Learning. A further interest is in biological vision, which is used as a source of inspiration for solving computer vision problems and for building enhanced vision systems that can compensate the strengths and weaknesses of both human and computer vision. Brief biography Prof. Barth leads the research on human and machine vision at the INB. He obtained his Ph.D in Electrical Engineering from the Technical University of Munich in 1994, was a Research Associate at the Department of Communications Engineering in Munich and a Visiting Fellow at the Department of Computer Science, Melbourne University, Australia, where he was supported by the Gottlieb-Daimler and Karl-Benz Foundation. He then was a researcher at the Department of Medical Psychology, University of Munich, and a Klaus-Piltz fellow at the Institute for Advanced Study in Berlin. In 1997/98 he was a member of the NASA Vision Science and Technology Group   at NASA Ames, Moffet Field, California. In May 2000 he received a Schloessmann Award from the Max-Planck Gesellschaft. Since then, he initiated and conducted a number of basic and applied research projects, and started a few companies (e.g. ARTTS, GazeCom, PRC, gestigon). Google Scholar - aktuelle Publikationen 2022 Christian Thiemann, Britta Klitzke, Philipp Martinetz, Philipp Grüning, Thomas Käster, Erhardt Barth, Jan Kramer, and Thomas Martinetz, Automated assessment of immunofixations with deep neural networks, Journal of Laboratory Medicine , vol. 46, no. 5, pp. 331--336, 2022. De Gruyter. Datei: pdf Bibtex: @article{ThKlMaGrKaBaKrMa22, title={Automated assessment of immunofixations with deep neural networks}, author={Thiemann, Christian and Klitzke, Britta and Martinetz, Philipp and Gr{\\\"u}ning, Philipp and K{\\\"a}ster, Thomas and Barth, Erhardt and Kramer, Jan and Martinetz, Thomas}, journal={Journal of Laboratory Medicine}, volume={46}, number={5}, pages={331--336}, year={2022}, publisher={De Gruyter}, url={https://www.degruyter.com/document/doi/10.1515/labmed-2022-0078/pdf} } Philipp Grüning, Thomas Martinetz, and Erhardt Barth, FP-nets as novel deep networks inspired by vision, Journal of Vision , vol. 22, no. 1, pp. 8--8, 2022. The Association for Research in Vision and Ophthalmology. Datei: GrMaBa22.pdf Bibtex: @article{GrMaBa22, title={FP-nets as novel deep networks inspired by vision}, author={Gr{\\\"u}ning, Philipp and Martinetz, Thomas and Barth, Erhardt}, journal={Journal of Vision}, volume={22}, number={1}, pages={8--8}, year={2022}, publisher={The Association for Research in Vision and Ophthalmology}, url={https://www.inb.uni-luebeck.de/fileadmin/files/publications/inb-publications/pdfs/GrMaBa22.pdf} } Hajo Nils Krabbenhöft, and Erhardt Barth, TEVR: Improving Speech Recognition by Token Entropy Variance Reduction, 2022. arXiv. DOI:10.48550/ARXIV.2206.12693 Datei: 2206.12693 Bibtex: @misc{KrBa22, author = {Hajo Nils Krabbenh{\\\"o}ft and Erhardt Barth}, title = {{TEVR}: {I}mproving {S}peech {R}ecognition by {T}oken {E}ntropy {V}ariance {R}eduction}, publisher = {arXiv}, year = {2022}, keywords = {Computation and Language (cs.CL), Sound (cs.SD), Audio and Speech Processing (eess.AS), FOS: Computer and information sciences, FOS: Computer and information sciences, FOS: Electrical engineering, electronic engineering, information engineering, FOS: Electrical engineering, electronic engineering, information engineering, F.2.1; I.2.6; I.2.7}, doi = {10.48550/ARXIV.2206.12693}, url = {https://arxiv.org/abs/2206.12693}, copyright = {Creative Commons Attribution 4.0 International} } 2021 Dominik Mairhöfer, Manuel Laufer, Paul Martin Simon, Malte Sieren, Arpad Bischof, Thomas Käster, Erhardt Barth, Jörg Barkhausen, and Thomas Martinetz, An AI-based Framework for Diagnostic Quality Assessment of Ankle Radiographs, in Proceedings of the Fourth Conference on Medical Imaging with Deep Learning , Heinrich, Mattias and Dou, Qi and de Bruijne, Marleen and Lellmann, Jan and Schläfer, Alexander and Ernst, Floris, Eds. PMLR, 07-.2021. pp. 484--496. Datei: MaLaSiSiBiKaBaBaMa21.pdf Bibtex: @inproceedings{MaLaSiSiBiKaBaBaMa21, title = {An {AI}-based Framework for Diagnostic Quality Assessment of Ankle Radiographs}, author = {Mairh{\\\"o}fer, Dominik and Laufer, Manuel and Simon, Paul Martin and Sieren, Malte and Bischof, Arpad and K{\\\"a}ster, Thomas and Barth, Erhardt and Barkhausen, J{\\\"o}rg and Martinetz, Thomas}, booktitle = {Proceedings of the Fourth Conference on Medical Imaging with Deep Learning}, pages = {484--496}, year = {2021}, editor = {Heinrich, Mattias and Dou, Qi and de Bruijne, Marleen and Lellmann, Jan and Schläfer, Alexander and Ernst, Floris}, volume = {143}, series = {Proceedings of Machine Learning Research}, month = {07--09 Jul}, publisher = {PMLR}, pdf = {https://proceedings.mlr.press/v143/mairhofer21a/mairhofer21a.pdf}, url = {https://www.inb.uni-luebeck.de/fileadmin/files/publications/inb-publications/pdfs/MaLaSiSiBiKaBaBaMa21.pdf}, abstract = {The quality of radiographs is of major importance for diagnosis and treatment planning. While most research regarding automated radiograph quality assessment uses technical features such as noise or contrast, we propose to use anatomical structures as more appropriate features. We show that based on such anatomical features, a modular deep-learning framework can serve as a quality control mechanism for the diagnostic quality of ankle radiographs. For evaluation, a dataset consisting of 950 ankle radiographs was collected and their quality was labeled by radiologists. We obtain an average accuracy of 94.1%, which is better than the expert radiologists are on average.} } Philipp Grüning, and Erhardt Barth, Bio-inspired Min-Nets Improve the Performance and Robustness of Deep Networks, in SVRHM 2021 Workshop NeurIPS , 2021. Datei: GrBa21.pdf Bibtex: @inproceedings{GrBa21, title={Bio-inspired Min-Nets Improve the Performance and Robustness of Deep Networks}, author={Gr{\\\"u}ning, Philipp and Barth, Erhardt}, booktitle={SVRHM 2021 Workshop NeurIPS}, year={2021}, url={https://www.inb.uni-luebeck.de/fileadmin/files/publications/inb-publications/pdfs/GrBa21.pdf} } Hammam Alshazly, Christoph Linse, Mohamed Abdalla, Erhardt Barth, and Thomas Martinetz, COVID-Nets: deep CNN architectures for detecting COVID-19 using chest CT scans, PeerJ Computer Science , vol. 7, pp. e655, 2021. DOI:10.7717/peerj-cs.655 Datei: peerj-cs.655 Bibtex: @article{AlLiAbBaMa21, author={Hammam Alshazly and Christoph Linse and Mohamed Abdalla and Erhardt Barth and Thomas Martinetz}, title = {{COVID-Nets}: deep {CNN} architectures for detecting {COVID-19} using chest {CT} scans}, journal = {PeerJ Computer Science}, volume={7}, pages={e655}, year={2021}, doi = {10.7717/peerj-cs.655}, url = {https://doi.org/10.7717/peerj-cs.655} } Philipp Grüning, Falk Nette, Noah Heldt, Ana Cristina Guerra Souza, and Erhardt Barth, Direct Inference of Cell Positions using Lens-Free Microscopy and Deep Learning, in Medical Imaging with Deep Learning , 2021. pp. 219--227. Datei: GrNeHeSoBa21.pdf Bibtex: @inproceedings{GrNeHeSoBa21, title={Direct Inference of Cell Positions using Lens-Free Microscopy and Deep Learning}, author={Gr{\\\"u}ning, Philipp and Nette, Falk and Heldt, Noah and de Souza, Ana Cristina Guerra and Barth, Erhardt}, booktitle={Medical Imaging with Deep Learning}, pages={219--227}, year={2021}, organization={PMLR}, url={https://www.inb.uni-luebeck.de/fileadmin/files/publications/inb-publications/pdfs/GrNeHeSoBa21.pdf} } Hammam Alshazly, Christoph Linse, Erhardt Barth, and Thomas Martinetz, Explainable COVID-19 Detection Using Chest CT Scans and Deep Learning, Sensors , vol. 21, no. 2, pp. 455, 2021. Multidisciplinary Digital Publishing Institute. Datei: AlLiBaMa21.pdf Bibtex: @article{AlLiBaMa21, author={Hammam Alshazly and Christoph Linse and Erhardt Barth and Thomas Martinetz}, title = {Explainable {COVID-19} {D}etection {U}sing {C}hest {CT} {S}cans and {D}eep {L}earning}, journal = {Sensors}, volume={21}, number={2}, pages={455}, year={2021}, publisher={Multidisciplinary Digital Publishing Institute}, url = {https://www.mdpi.com/1424-8220/21/2/455}, url = {https://www.inb.uni-luebeck.de/fileadmin/files/publications/inb-publications/pdfs/AlLiBaMa21.pdf} } Philipp Grüning, and Erhardt Barth, FP-Nets for Blind Image Quality Assessment, Journal of Perceptual Imaging , vol. 4, no. 1, pp. 10402-1--10402-13, 2021. Datei: GrBa21a.pdf Bibtex: @article{GrBa21a, title={{FP}-{N}ets for {B}lind {I}mage {Q}uality {A}ssessment}, author={Gr{\\\"u}ning, Philipp and Barth, Erhardt}, journal={Journal of Perceptual Imaging}, volume={4}, number={1}, pages={10402-1--10402-13}, year={2021}, url={https://www.inb.uni-luebeck.de/fileadmin/files/publications/inb-publications/pdfs/GrBa21a.pdf} } Hammam Alshazly, Christoph Linse, Erhardt Barth, Sahar Ahmed Idris, and Thomas Martinetz, Towards Explainable Ear Recognition Systems Using Deep Residual Networks, IEEE Access , pp. 1-1, 2021. DOI:10.1109/ACCESS.2021.3109441 Datei: ACCESS.2021.3109441 Bibtex: @article{AlLiBaIdMa21, author = {Hammam Alshazly and Christoph Linse and Erhardt Barth and Sahar Ahmed Idris an",
  "content_length": 22462,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:56"
}