{
  "name": "Erhard Rahm",
  "homepage": "https://dbs.uni-leipzig.de/personen/rahm.html",
  "status": "success",
  "content": "Prof. Dr. Erhard Rahm | Database Group Leipzig Skip to main content Prof. Dr. Erhard Rahm Prof. Dr. Erhard Rahm Mail rahm [at] informatik [dot] uni-leipzig [dot] de Phone +49 341 97 32-220 (Secretary) +49 341 97 32-221 Telefax +49 341 97 32-209 Address Universität Leipzig Fakultät für Mathematik und Informatik, Institut für Informatik, Augustusplatz 10, 04109 Leipzig, Germany  Room: Paulinum 427 Selected TalksData Integration for Knowledge Graphs. Keynote, LWDA Conf., Marburg, Oct 2023Multi-Source Data Matching and Clustering. Virtual Lecture Series on Database Research, Hasso Plattner Institute (HPI) Potsdam, Jan 2022 Record Linkage and PPRL with Clustering of Matches. Virtual TMF workshop oin Record Linkage, May 2021ScaDS.AI topics of database group (data integration for knowledge graphs, privacy-preserving data analysis, analysis of dynamic graph data), April 2020Scalable Graph Data Management and Analytics with GRADOOP. Computer Science Seminar at Australian National University (ANU) and Univ. of Sydney, April 2019Big Data Integration Research at ScaDS. Int. Summerschool on Big Data and Machine Learning, Leipzig, July 2018Privacy-Preserving Record Linkage for Big Data. Invited Talk, 2nd BMBF Big Data All Hands Meeting and Smart Data Innovation Conference, Karlsruhe, Oct. 2017Scalable Graph Analytics. Tutorial 3rd Int. ScaDS Big Data Summer School, Munich, Aug. 2017Holistic Data Integration for Big Data Keynote ADBIS Conference, Prague, Aug. 2016. . PaperScalable and Privacy-Preserving Big Data Integration . Part 1: Big Data Integration. Part 2: Privacy-Preserving Record Linkage, Part 3: Graph-based Data integation and Analytics. Seminars at Big Data Winter School, Bilbao, Feb 2016Scalabale Graph Analytics with GRADOOP Keynote GvDB-Workshop, Gommern, May 2015Big Data Integration Research at the University of Leipzig. Colloquium Talk, Australian National University (ANU), Canberra, Feb. 2015BigData Integration at ScaDS Dresden/Leipzig. Colloquium Talk, RWTH Aachen, Dec. 2014Semantic ontology mappings: How to determine and use them. Colloquium Talk, Univ. of Paris-Sud, Oct. 2014Scalable Matching of Real-World Data. Keynote QDB workshop, Istanbul, Aug. 2012.Generic Schema Matching - Ten Years later. Ten-Year Best Paper Keynote at the VLDB Conf, Seattle, Sep 2011 (together with Phil Bernstein and Jayant Madhavan).Parallel Object Matching in the Cloud. Invited Talk FGDB meeting, HPI Potsdam, Nov. 2011Evolution and Merging of Real-life Ontologies. Keynote at the Italian Database Conference SEBD, Maratea, June 2011.Object Matching for Improving Information Quality. Talk at KIT (TU Karlsruhe), Nov. 2009.Instance-based Matching of Large Ontologies. Invited Talk at GvD Workshop, Rostock, June 2009.Comparing the Scientific Impact of Conference and Journal Publications in Computer Science. Invited Talk at Academic Publishing in Europe (APE) Conf., Berlin, Jan. 2008. PaperDynamic Fusion of Web Data: Beyond Mashups. Keynote XSYM07-Symposium , Vienna, Sep. 2007. PaperData Integration in Bioinformatics and Life Sciences. EDBT Summer School, Bolzano, Sep. 2007Object Matching in Peer-to-Peer Data Integration. Invited Talk at 2nd Int. Workshop on Exchange and Integration of Data (EID), Brixen, June 2006Matching Large Schemas with COMA++, Talk at Microsoft Research, Redmond, March 2005Publicationsorcid.org/0000-0002-2665-1114Books    Complete list of published Books AwardsICDE 2013 Influential Paper AwardVLDB Ten Year Best Paper Award, 2011MSR Outstanding Collaborator Award 2016Best Paper Award, HEALTHINF 2021Best Research Paper Award, ESWC 2018DKE Best Paper Award 2014Best Paper Award, ESWC 2013Best Paper Award, ICDE 2002Papers in “Best of” issues for VLDB 2004, BTW 2011, ADBIS 2013, ADBIS 2017LIFE award for best startup idea, 2012 (3rd place)Gremien/ServiceVize-Präsident der Gesellschaft für Informatik (GI) (seit 2022)Sprecher GI Fachbereich Datenbanksysteme und Informationssysteme (DBIS) (2016-2021) Image gewähltes Mitglied des DFG-Fachkollegiums Informatik (2016-2020,2020-2024)Mitglied im Expertengremium der NFDI (Nationale Forschungsdaten-Infrastruktur), 2019-2022Mitglied im Senatsausschuss Wettbewerb der Leibniz-Gemeinschaft (2021-2025)Wissenschaftlicher Beirat Metop GnmbH, MagdeburgJournal editorships / PC membershipsStudiengangleiter Master Data ScienceTagungsleiter BTW2003 in LeipzigVorsitzender Prüfungsausschuss Informatik (2005-2013)Erasmus coordinator / Beauftrager für Auslandsstudium der Fakultät (1/2006-12/2008)Member of directorial board of Bioinformatic Center (IZBI) LeipzigMember of the Centre for Biotechnology and Biomedicine (BBZ) at the University of LeipzigFurther LinksProf. Rahm in the MediaBiographic informationCeremonial event for Prof. Dr. Erhard Rahm (2024) Dateien Cover Beschreibung Jahr Exploring Privacy-Preserving Record Linkage: A Holistic Framework for Dataset Generation and Detailed Result Analysis Rohde, F. ; Christen, V. ; Rahm, E. VLDB 2025 Workshop: 14th International Workshop on Quality in Databases (QDB’25) 2025 / 9 Slice it up: Unmasking User Identities in Smartwatch Health Data Lange, L. ; Schreieder, T. ; Christen, V. ; Rahm, E. 20th ACM ASIA Conference on Computer and Communications Security (AsiaCCS 2025) 2025 / 8 MPGT: Multimodal Physics-Constrained Graph Transformer Learning for Hybrid Digital Twins Uhrich, B. ; Rahm, E. 2025 IEEE Conference on Artificial Intelligence (CAI) 2025 / 7 SecUREmatch: Integrating Clerical Review in Privacy-Preserving Record Linkage Rohde, F. ; Christen, V. ; Rahm, E. ACM SIGMOD/PODS International Conference on Management of Data 2025 / 6 Leveraging foundation models and goal-dependent annotations for automated cell confluence assessment Joas, M. ; Freund, D. ; Haase, R. ; Rahm, E. ; Ewald, J. Front. Comput. Sci. 2025 / 6 Graph Metrics-driven Record Cluster Repair meets LLM-based active learning Christen, V. ; Obraczka, D. ; Hofer, M. ; Franke, M. ; Rahm, E. ACM Journal of Data and Information Quality 2025 / 6 Federated Learning With Individualized Privacy Through Client Sampling Lange, L. ; Borchardt, O. ; Rahm, E. 10th International Conference on Machine Learning Technologies (ICMLT 2025) [Best Presentation Award] 2025 / 5 Automated Configuration of Schema Matching Tools: A Reinforcement Learning Approach Miazga, M. P. ; Abitz, D. ; Täschner, M. ; Rahm, E. Proc. BTW 2025 2025 / 3 Assessing the Impact of Image Dataset Features on Privacy-Preserving Machine Learning Lange, L. ; Heykeroth, M. ; Rahm, E. 21st Conference on Database Systems for Business, Technology and Web (BTW 2025) 2025 / 3 Multi-Layer Privacy-Preserving Record Linkage with Clerical Review based on gradual information disclosure Rohde, F. ; Christen, V. ; Franke, M. ; Rahm, E. 21st Conference on Database Systems for Business, Technology and Web (BTW 2025) 2025 / 3 Search 2025 / 9: Generating Semantically Enriched Mobility Data from Travel Diaries 2025 / 9: Exploring Privacy-Preserving Record Linkage: A Holistic Framework for Dataset Generation and Detailed Result Analysis 2025 / 8: Slice it up: Unmasking User Identities in Smartwatch Health Data 2025 / 7: MPGT: Multimodal Physics-Constrained Graph Transformer Learning for Hybrid Digital Twins 2025 / 6: Leveraging foundation models and goal-dependent annotations for automated cell confluence assessment",
  "content_length": 7309,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:55"
}