{
  "name": "Eric P. S. Baumer",
  "homepage": "http://ericbaumer.com",
  "status": "success",
  "content": "Eric P. S. Baumer Eric P. S. Baumer Exploring sociocultural dynamics and natural language technologies. News Update: As of July 1, 2025, I am Associate Professor in the Faculty of Information at the University of Toronto. My research blends computational methods and design-oriented approaches to understand sociocultural dynamics around human interactions with natural language technologies. This work inhabits various intersections among human-computer interaction (HCI), artificial intelligence (AI), machine learning (ML), and social computing. Fully understanding the individual and societal experiences around these systems requires close attention to the technical details of their design and implementation. Similarly, any responsible design of such technologies must account for their broader human and social dimensions. To do so, my work integrates computational techniques from natural language processing and machine learning, conceptual orientations from qualitative and interpretivist social science, and design-based methods for human-centered research. This interdisciplinary synthesis contributes concepts and tools that are essential for understanding, for imagining, and for creating, the future of sociotechnical systems. Recent Posts I recently had three submissions accepted to the ACM Conference on Supporting Group Work (GROUP). The first was a paper to which I contributed about online policy discussion, specifically in the context of MTurk. Among other things, this paper offers some nice empirical evidence about the importance of considering opinions with finer grained distinctions than agree vs. disagree. Second is a paper analyzing how different types of regretful experiences on Facebook can lead to different types of non-use. The main take away is that it matters less who feels the regret than who takes the action that ends up being regretted. Third is a curated collection of short design fiction pieces written by students in the class I taught this past spring. It demonstrates the efficacy of design fiction for thinking through ethical issues in computing. Presenting at Algorithms in Culture Leave a reply Moving to Lehigh Leave a reply Two Papers at GROUP Leave a reply Paper in Social Media + Society with Press Coverage Leave a reply Special Issue on Technology Non-use in First Monday Leave a reply Paper in Critical Computing Leave a reply FrameCheck Press Coverage Leave a reply CHI 2015 Conference Report Leave a reply interactions Article on Non-use Leave a reply Associate Professor Faculty of Information University of Toronto Recent PapersOne Rating to Rule Them All? Evidence of Multidimensionality in Human Assessment of Topic Labeling QualityAmin Hosseiny Marani, Joshua Levine, Eric P. S. Baumer. 2022. One Rating to Rule Them All? Evidence of Multidimensionality in Human Assessment of Topic Labeling Quality. In Proceedings of the ACM International Conference on Information & Knowledge Management (CIKM).“It’s Like the Value System in the Loop”: Domain Experts’ Values Expectations for NLP AutomationDilruba Showkat and Eric P. S. Baumer. 2022. “It’s Like the Value System in the Loop”: Domain Experts’ Values Expectations for NLP Automation. In Proceedings of the ACM Conference on Designing Interactive Systems (DIS), 100–122.Of Course it’s Political! A Critical Inquiry into Underemphasized Dimensions in Civic Text VisualizationEric P. S. Baumer, Mahmood Jasim, Ali Sarvghad, and Narges Mahyar. 2022. Of Course it's Political! A Critical Inquiry into Underemphasized Dimensions in Civic Text Visualization. Computer Graphics Forum 41, 3 (EuroVis).Where Do Stories Come From? Examining the Exploration Process in Investigative Data JournalismDilruba Showkat and Eric P. S. Baumer. 2021. Where Do Stories Come From? Examining the Exploration Process in Investigative Data Journalism. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2: 390:1-390:31.A Review on Strategies for Data Collection, Reflection, and Communication in Eating Disorder AppsAnjali Devakumar, Jay Modh, Bahador Saket, Eric P. S. Baumer, and Munmun De Choudhury. 2021. A Review on Strategies for Data Collection, Reflection, and Communication in Eating Disorder Apps. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI), 1–19.",
  "content_length": 4301,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:10"
}