{
  "name": "Eric V. Mazumdar",
  "homepage": "http://users.cms.caltech.edu/~mazumdar",
  "status": "success",
  "content": "Eric Mazumdar I am an Assistant Professor in Computing and Mathematical Sciences and Economics at Caltech. I obtained my Ph.D in Electrical Engineering and Computer Science at UC Berkeley, co-advised by Michael Jordan and Shankar Sastry. My research interests lie at the intersection of machine learning and economics. I am broadly interested in developing the tools and understanding necessary to confidently deploy machine learning algorithms into societal systems. This requires understanding the theoretical underpinnings of learning algorithms in uncertain, dynamic environments where they interact with strategic agents--- including people and other algorithms. Practically, I apply my work to problems in intelligent infrastructure, online markets, e-commerce, and the delivery of healthcare. I am the recipient of a NSF Career Award aimed at studying the strategic interactions that arise in Societal-Scale Systems as well as a Research Fellowship for Learning in Games from the Simons Institute for Theoretical Computer Science. My work is supported by NSF, DARPA, and Amazon research grants. Prior to Berkeley, I received an SB in Electrical Engineering and Computer Science at Massachusetts Institute of Technology (MIT) , where I had the opportunity to work with in the Laboratory for Multiscale Regenerative Technologies as well as in the MIT Computational Biology Group in CSAIL. You can contact me by email at: olastnameoatocaltechodotoedu I keep office hours during academic quarters in my office (ANB 216). I am available during this time for discussions with any students/postdocs who would like to meet. Emailing ahead of time to is preferred in case I am traveling. Preprints/Under review Coupled Wasserstein Gradient Flows for Min-Max and Cooperative Games Lauren Conger, Franca Hoffman, Eric Mazumdar, Lillian Ratliff Tractable Equilibrium Computation in Markov Games through Risk Aversion Eric Mazumdar , Kishan Panaganti, Laixi Shi [PDF] Flow-Based Synthesis of Reactive Tests for Discrete Decision-Making Systems with Temporal Logic Specifications Josefine B. Graebener, Apurva S. Badithela, Denizalp Goktas, Wyatt Ubellacker, Eric Mazumdar, Aaron D. Ames, Richard M. Murray IEEE Transactions of Robotics (Under Submission), 2024 [PDF] Last-Iterate Convergence of Payoff-Based Independent Learning in Zero-Sum Stochastic Games Zaiwei Chen, Kaiqing Zhang, Eric Mazumdar, Asuman Ozdaglar, Adam Wierman. [PDF] Refereed Publications Understanding Model Selection for Learning in Strategic Environments Tinashe Handina, Eric Mazumdar Conference on Neural Information Processing Systems (NeurIPS), 2024 [PDF] Last-Iterate Convergence for Generalized Frank-Wolfe in Monotone Variational Inequalities Zaiwei Chen, Eric Mazumdar Conference on Neural Information Processing Systems (NeurIPS), 2024 Near-Optimal Distributionally Robust RL with General Lp Norms Pierre Clavier, Laixi Shi, Erwan Le Pennec, Eric Mazumdar, Adam Wierman, Matthieu Geist Conference on Neural Information Processing Systems (NeurIPS), 2024 Characterizing Controllability and Observability for Systems with Locality, Communication, and Actuation Constraints Lauren Conger, Yiheng Lin, Adam Wierman, Eric Mazumdar IEEE Conference on Decision and Control (CDC), 2024 [PDF] Follower Agnostic Learning in Stackelberg Games Chinmay Maheshwari, James Cheng, Shankar Sastry, Lillian J. Ratliff, Eric Mazumdar IEEE Conference on Decision and Control (CDC), 2024 [PDF] Two-Timescale Q-Learning with Function Approximation in Zero-Sum Stochastic Games Zaiwei Chen, Kaiqing Zhang, Eric Mazumdar, Asuman Özdaglar, Adam Wierman Conference on Economics and Computation (EC), 2024 [PDF] Rethinking Scaling Laws for Learning in Strategic Environments Tinashe Handina, Eric Mazumdar Econometric Society Interdisciplinary Frontiers (ESIF) conference on Economics and AI+ML, 2024 [PDF] Model-Free Robust ϕ-Divergence Reinforcement Learning Using Both Offline and Online Data Kishan Panaganti, Adam Wierman, Eric Mazumdar International Conference on Machine Learning (ICML), 2024 [PDF] Sample-Efficient Robust Multi-Agent Reinforcement Learning in the Face of Environmental Uncertainty Laixi Shi, Eric Mazumdar, Yuejie Chi, Adam Wierman International Conference on Machine Learning (ICML), 2024 [PDF] A Finite-Sample Analysis of Payoff-Based Independent Learning in Zero-Sum Stochastic Games Zaiwei Chen, Kaiqing Zhang, Eric Mazumdar, Asuman Özdaglar, Adam Wierman Conference on Neural Information Processing Systems (NeurIPS), 2023 [PDF] Distribution Shifts of Strategic Interacting Agents via Coupled Gradient Flows Lauren Conger, Franca Hoffman, Eric Mazumdar, Lillian Ratliff Conference on Neural Information Processing Systems (NeurIPS), 2023 [PDF] Algorithmic Collective Action in Machine Learning Moritz Hardt, Eric Mazumdar, Celestine Mendler-Dünner, Tijana Zrnic (α-β ordering) [PDF] International Conference on Machine Learning (ICML), 2023 [PDF] Designing System Level Synthesis Controllers for Nonlinear Systems with Stability Guarantees Lauren Conger, Sydney Vernon, Eric Mazumdar Conference on Learning for Dynamics and Control (L4DC), 2023 Synthesizing Reactive Test Environments for Autonomous Systems: Testing Reach-Avoid Specifications with Multi-Commodity Flows Apurva Badithela, Josefine B. Graebener, Wyatt Ubellacker, Eric V. Mazumdar, Aaron D. Ames, Richard M. Murray International Conference on Robotics and Automation (ICRA), 2023 [PDF] Decentralized, Coordination- and Communication-Free Algorithms for Learning in Structured Matching Markets Chinmay Maheshwari, S. Shankar Sastry, Eric Mazumdar Conference on Neural Information Processing Systems (NeurIPS), 2022 [PDF] Nonlinear System Level Synthesis for Polynomial Dynamical Systems Lauren Conger, Jing Shuang (Lisa) Li, Eric Mazumdar, Steven Brunton IEEE Conference on Decision and Control (CDC), 2022 [PDF] Langevin Monte Carlo for Contextual Bandits Pan Xu, Hongkai Zheng, Eric Mazumdar, Kamyar Azizzadenesheli, Anima Anandkumar International Conference on Machine Learning (ICML), 2022 [PDF] Fast Distributionally Robust Learning via Min-Max Optimization Yaodong Yu*, Tianyi Lin*, Eric Mazumdar*, Michael I. Jordan International Conference on Artificial Intelligence and Statistics (AISTATS), 2022 [PDF] (* denotes equal contribution) Zeroth-Order Methods for Convex-Concave Minmax Problems: Applications to Decision-Dependent Risk Minimization Chinmay Maheshwari, Chih-Yuan Chiu, Eric Mazumdar, S. Shankar Sastry, Lillian J. Ratliff International Conference on Artificial Intelligence and Statistics (AISTATS), 2022 [PDF] Who Leads and Who Follows in Strategic Classification? Tijana Zrnic*, Eric Mazumdar*, S. Shankar Sastry, Michael I. Jordan Conference on Neural Information Processing Systems (NeurIPS), 2021 [PDF] (* denotes equal contribution) Global Convergence to Local Minmax Equilibrium in Classes of Nonconvex Zero-Sum Games Tanner Fiez, Lillian J. Ratliff, Eric Mazumdar, Evan Faulkner, Adhyyan Narang Conference on Neural Information Processing Systems (NeurIPS), 2021 [PDF] High Confidence Sets for Trajectories of Stochastic Time-Varying Nonlinear Systems Eric Mazumdar, Tyler Westenbroek, Michael I. Jordan, S. Shankar Sastry IEEE Conference on Decision and Control (CDC), 2020 [PDF] Adaptive Control for Linearizable Systems Using On-Policy Reinforcement Learning Tyler Westenbroek, Eric Mazumdar, David Fridovich-Keil, Valmik Prabhu, Claire J. Tomlin, S. Shankar Sastry IEEE Conference on Decision and Control (CDC), 2020 [PDF] Expert Selection in High Dimensional Markov Decision Processes Vicenc Rubies Royo, Eric Mazumdar, Roy Dong, Claire J. Tomlin, S. Shankar Sastry IEEE Conference on Decision and Control (CDC), 2020 [PDF] On Approximate Thompson Sampling with Langevin Algorithms Eric Mazumdar*, Aldo Pacchiano*, Yi-an Ma*, Peter L. Bartlett, Michael I. Jordan International Conference on Machine Learning (ICML), 2020 [PDF] (* denotes equal contribution) Feedback Linearization for Unknown Systems via Reinforcement Learning Tyler Westenbroek*,David Fridovitch-Keil*, Eric Mazumdar*, Shreyas Arora, Valmik Prabhu, Claire Tomlin, S. Shankar Sastry International Conference on Robotics and Automation (ICRA), 2020 [PDF] (* denotes equal contribution) Policy Gradient Algorithms Have No Guarantees of Convergence in Linear Quadratic Games Eric Mazumdar, Lillian J. Ratliff, Michael I. Jordan, S. Shankar Sastry International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2020 [PDF] On Gradient-Based Learning in Continuous Games Eric Mazumdar, Lillian J. Ratliff, S. Shankar Sastry SIAM Journal on Mathematics for Data Science (SIMODS), 2020 [PDF] Inverse Risk-Sensitive Reinforcement Learning via Gradient Methods Lillian Ratliff, Eric Mazumdar IEEE Transactions on Automatic Control (TAC), 2020 [PDF] Local Nash Equilibria are Isolated, Strict Local Nash Equilibria in ‘Almost All’ Zero-Sum Continuous Games Eric Mazumdar and Lillian Ratliff IEEE Conference on Decision and Control (CDC), 2019 [PDF] Convergence Analysis of Gradient-Based Learning in Continuous Games Benjamin, Chasnov, Lillian Ratliff, Eric Mazumdar, Samuel A. Burden Conference on Uncertainty in Artificial Intelligence (UAI), 2019 [PDF] On the Analysis of Cyclic Drug Schedules for Cancer Treatment using Switched Dynamical Systems Margaret Chapman, Eric Mazumdar, Ellen Langer, Rosalie Sears, Claire Tomlin IEEE Conference on Decision and Control (CDC), 2018 [PDF] Gradient-based Inverse Risk-Sensitive Reinforcement Learning Eric Mazumdar, Lillian Ratliff, S. Shankar Sastry IEEE Conference on Decision and Control (CDC), 2017 [PDF] To Observe or Not to Observe: Queuing Game Framework for Urban Parking Lillian Ratliff, Chase Dowling, Eric Mazumdar, Baosen Zhang IEEE Conference on Decision and Control (CDC), 2016 [PDF] Understanding the Impact of Parking on Urban Mobility via Routing Games on Queue–Flow Networks Daniel Calderone, Eric Mazumdar, Lillian Ratliff, S. Shankar Sastry IEEE Conference on Decision and C",
  "content_length": 16423,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:14"
}