{
  "name": "Eric J. Pauwels",
  "homepage": "https://www.cwi.nl/people/1302",
  "status": "success",
  "content": "Eric Pauwels Skip to main content Eric Pauwels Full Name Dr. E.J.E.M. Pauwels Email Eric.Pauwels@cwi.nl Phone +31 20 592 4225 Room M358 Department(s) Intelligent and Autonomous Systems Function(s) Scientific Staff Member Publications All publications Ooms, S., César Garcia, P. S., El Ali, A., Ceolin, D., Hollink, L., Slokom, M., … La Poutré, H. (2024). Technological innovation in the media sector: Understanding current practices and unraveling opportunities. In CHI EA: Extended Abstracts of the CHI Conference on Human Factors in Computing Systems (pp. 533:1–533:7). doi:10.1145/3613905.3637147 Robu, V., Ooms, S., El Ali, A., César Garcia, P. S., Ceolin, D., Hollink, L., … Piersma, N. (2023). Overview of the Netherlands AI, Media and Democracy Lab. van Kampen, J., Knapen, L., van der Mei, R., Pauwels, E., & Dugundji, E. (2022). Yearly development of car ownership in urban and rural environments. In Procedia Computer Science (pp. 101–108). doi:10.1016/j.procs.2022.03.016 Visser, L. R., Kootte, M. E., Ferreira, A. C., Sicurani, O., Pauwels, E., Vuik, C., … AlSkaif, T. A. (2022). An operational bidding framework for aggregated electric vehicles on the electricity spot market. Applied Energy, 308, 118280:1–118280:11. doi:10.1016/j.apenergy.2021.118280 Koohborfardhaghighi, S., & Pauwels, E. (2021). Reinforcement learning for modeling and capturing the effect of partner selection strategies on the emergence of cooperation. In Proceedings of the 18th International Conference on Economics of Grids, Clouds, Systems, and Services, GECON 2021 (pp. 52–65). doi:10.1007/978-3-030-92916-9_5 Berkhout, J., Pauwels, E., van der Mei, R., Stolze, J., & Broersen, S. (2021). Short-term production scheduling with non-triangular sequence-dependent setup times and shifting production bottlenecks. International Journal of Production Research, 59(3), 727–751. doi:10.1080/00207543.2019.1705420 van Kampen, J., Knapen, L., Pauwels, E., van der Mei, R., & Dugundji, E. (2021). Bicycle parking in station areas in the Netherlands. In Procedia Computer Science (pp. 338–345). doi:10.1016/j.procs.2021.03.043 van Kampen, J., Pauwels, E., van der Mei, R., & Dugundji, E. (2021). Understanding the relation between travel duration and station choice behavior of cyclists in the metropolitan region of Amsterdam. Journal of Ambient Intelligence and Humanized Computing, 12, 137–145. doi:10.1007/s12652-020-02856-5 van Kampen, J., Jayaraj, M. A., Pauwels, E., van der Mei, R., & Dugundji, E. (2020). Understanding the relation between distance and train station choice behavior of cyclists in the western region of the Netherlands. In Procedia Computer Science (pp. 98–106). doi:10.1016/j.procs.2020.03.013 Kokabisaghi, K., Pauwels, E., Van Meulder, K., & Dorsman, A. (2019). Are these shocks for real? Sensitivity analysis of the significance of the wavelet response to some CKLS processes. International Journal of Financial Studies, 6(3), 76:1–76:12. doi:10.3390/ijfs6030076 Awards ERCIM Best Working Group Prize - Received WG award as chair person (2005) Current projects with external funding Aligning citizens and systems (ALIGN4energy) Energy Intranets (NEAT) L.INT lectoraat Industriële Digital Twins (None) Courses All courses Multi-Agent Systems(27 oct 2025 - 19 dec 2025) Multi-Agent Systems(1 oct 2023 - 30 nov 2023) Cookies We use cookies. You can read more about this in our cookie statement. Reject Accept",
  "content_length": 3414,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:04"
}