{
  "name": "Eric Poitras",
  "homepage": "https://www.dal.ca/faculty/computerscience/faculty-staff/eric-poitras.html",
  "status": "success",
  "content": "Dr. Eric Poitras - Faculty of Computer Science - Dalhousie University Support Dal Current Students Faculty & Staff Family & Friends Campuses Agricultural Campus (Truro) Halifax Campuses Directory Campus Maps myDal Dal Online Brightspace OpenDal myDal Directory Maps OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal Dalhousie University Study Admissions Campus Life Libraries Research and Innovation Alumni About Dal Faculty of Computer Science For Current Students For Faculty & Staff Home About Current Students Undergraduate Graduate Research News & Events Dr. Eric Poitras Associate Professor Connect with me My research cluster: Computer Science Education I have fellowship opportunities available Faculty of Computer Science Email: eric.poitras@dal.ca Phone: (902) 494 - 1599 Mailing Address: Faculty of Computer Science Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada Research Topics: Computer science education Educational data mining Learning analytics Instructional design Adaptive instructional systems Self-regulated learning Bio Eric Poitras is an Associate Professor in the Faculty of Computer Science at Dalhousie University. His research focuses on the design, implementation, and evaluation of adaptive instructional systems and technologies. He is also interested in the use of educational data mining and learning analytic techniques to model self-regulatory processes in learning about topics in computer science. His work lies at the intersection of computer science education, human-computer interaction, and the learning sciences. Eric has a Ph.D. in the Learning Sciences from McGill University. He spent one year as a postdoctoral researcher in the Learning Environments Across Disciplines (LEADS) research partnership studying intelligent tutoring systems. Before joining the faculty at Dalhousie University, he began his academic career teaching instructional design in the Department of Educational Psychology at the University of Utah. Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada inquiries@cs.dal.ca Contact the Faculty of Computer Science Campus Directory Campus Map Privacy Statement Terms of Use Media Centre Contact the Faculty of Computer Science Campus Directory Campus Map Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada 902-494-2093 inquiries@cs.dal.ca",
  "content_length": 2579,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:08"
}