{
  "name": "Eric A. Brewer",
  "homepage": "https://www.cs.berkeley.edu/~brewer",
  "status": "success",
  "content": "Professor Eric A. Brewer 417 Sutardja Dai Hall University of California at Berkeley Berkeley, CA 94720-1758 (510) 642-8143 FAX: (510) 642-5775 brewer@cs.berkeley.edu Professor, Computer Science Division Founder of the Federal Search Foundation, which built FirstGov (now USA.gov), the portal for the US government.Formerly, Founder and Chief Scientist of  Inktomi Corporation, now part of Yahoo! Office Hours for Fall 2011:  Wed 1-2 (417 Sutardja Dai Hall), plus other times via e-mail Classes Fall 2011 : CS262a: Advanced Topics in Computer SystemsSpring 2010, 2011:  Cellphones as a Computing PlatformFall 2009 : CS262a: Advanced Topics in Computer SystemsSpring 2009:  CS169: Software EngineeringFall 2008: CS262a: Advanced Topics in Computer SystemsSpring 2008: CS294-35: Cellphones as a Computing PlatformSpring 2008: CS262ASpring 2006:  CS262BSpring 2005:  CS169: Software EngineeringFall 2004: CS262a: Advanced Topics in Computer SystemsSpring 2004: CS262b: Advanced Topics in Computer Systems Fall 2003: CS294-12: ICT for Developing Regions (with Richard Newton, Tom Kalil and CMU) Research PublicationsMy primary research interests include technology for developing regions, programming languauge support for concurrency, Internet systems, and databases. Current Projects: TIER: Technology and Infrastructure for Emerging RegionsVideo of my BEARS talk (a good introduction to TIER, about 25 minutes) Ivy: An extension for C with better safety properties that works with legacy C code Past Projects NEST: Network Embedded Systems Technology The Ninja Project on Internet-Scale Services Internet security: ISAAC , which led to the PhDs of David Wagner, Ian Goldberg and Nikita Borisov. Mobile Computing: Daedalus and Bay Area Research Wireless Access Network (BARWAN) Cluster Computing: The Berkeley NOW Project InfoPad Graduate Students: Yahel Ben-David Shaddi Hasan Kurtis Heimerl Kevin Klues Jeremy Rahe Barret Rhoden David Zhu Former PhD Advisees Zach Anderson, Post-Doc at ETH Zurich Nikita Borisov , now a professor at University of Illinois, Urbana-Champaign Yatin Chawathe, now at Google Mike Chen,  now a professor at the National Taiwanese Universitiy (NTU) Mike Demmer, now at Riverbed Bowei Du, was at Aster Data Armando Fox , now a professor at Berkeley Paul Gauthier, co-founder of Inktomi, now at a Groupon Steve Gribble , now a professor at the University of Washington Ian Goldberg, now a professor at Waterloo Barbara Hohlt, now at Intel RJ Honicky, now at Tarana Wireless Bill McCloskey, now at Mozilla Sergui Nedevschi, currently at Tarana Wireless Rabin Patra currently at Tarana Wireless Rusty Sears, now at Yahoo! Research Sonesh Surana, now at Solar Semiconductor Rob von Behren, now at Google David Wagner, now a professor at UC Berkeley Matt Welsh, now a professor at Harvard (co-advised with David Culler) Feng Zhou, now at NetEase (1B+ page view/day Chinese Internet company) Tier Advisees Melissa Ho Joyojeet Pal, now at University of Washington Renee Kuriyan, now a Intel People & Practices Group Jennifer Bussell, now at the Center for Asian Democracy at the University of Louisville Lakshmi Subramanian, now at NYU AwardsACM Infosys Foundation Award, 2009Member, National Academy of EngineeringSIGOPS Mark Weiser Award, 2009Global Leader for Tomorrow for the World Economic ForumACM FellowAlfred P. Sloan Research Fellow Personal Photography Documents: Short bio Press photo brewer@cs.berkeley.eduxx",
  "content_length": 3438,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:56"
}