{
  "name": "Eric Feron",
  "homepage": "https://cemse.kaust.edu.sa/people/person/eric-feron",
  "status": "success",
  "content": "Eric Feron | Computer, Electrical and Mathematical Sciences and Engineering Skip to main content Eric Feron Professor, Electrical and Computer Engineering Principal Investigator, Aerospace and Transportation Systems eric.feron@kaust.edu.sa control systems aerospace software system optimization robotics With 31 years of teaching and research experience, Professor Feron’s work utilizes elementary concepts of control systems, optimization and computer science to address critical issues in modern aerospace engineering and robotics. BiographyEric Feron is an Electrical and Computer Engineering Program professor,  an affiliate of the Mechanical Engineering Program, and the Principal Investigator of the Aerospace and Transportation Systems (ATS) Research Group at KAUST.His research focuses on the development of advanced control and optimization techniques for autonomous systems with applications in aerospace, robotics and transportation. At KAUST, he leads efforts in exploring innovative solutions for complex challenges in these fields, emphasizing safety, reliability and efficiency in autonomous systems' design and operation.His academic journey began in Paris, where he earned a B.S. from École Polytechnique in 1989 and an M.S. from École Normale Supérieure in 1990. He completed his Ph.D. in Aerospace Engineering at Stanford University in 1994. Before joining KAUST in October 2021, he served as a faculty member at the Georgia Institute of Technology and the Massachusetts Institute of Technology’s Aeronautics and Astronautics Department.Throughout his career, he has taught a wide range of courses, including cyber-physical systems, control systems, and flight mechanics, and is a strong advocate for quality online education resources.Professor Feron has contributed significantly to both theoretical advancements and practical implementations in control systems, fostering collaborations across disciplines to drive progress in aerospace engineering. Research InterestsWith 31 years of experience in teaching and research, Professor Feron focuses on applying fundamental concepts of control systems, optimization, and computer science to modern aerospace engineering and robotics. His specific research interests include aerobatic control of uncrewed aerial vehicles, multi-agent operations, air traffic control systems and aerospace software system certification. He is also interested in geometric control systems and control theory in general.Dr. Feron’s ATS research group has made significant technical contributions across a variety of fields, including aerospace engineering, automotive engineering, ocean engineering, biological engineering, electrical engineering, mechanical engineering and robotics, as well as human-machine interaction. These contributions are grounded in a strong foundation of mathematics, computer science and operations research. Education Doctor of Philosophy (Ph.D.) Aerospace Engineering, Stanford University, United States, 1994 QuoteIn hindsight, I believe I have had decent success helping passengers enjoy a better air travel experience and paving the way for the drone era. My team at KAUST will continue to contribute to the general area of transportation systems and mobile robotics. Questions and Answers Why KAUST? It is very exciting to be at KAUST at a time when the Kingdom of Saudi Arabia is undergoing deep technical and societal transformations. As always, Feron feels the challenge set by his new colleagues' own record. He believe much of his work will benefit from what is already happening at KAUST to serve the Kingdom's best interests. Why RISC? Robotics is the integrative systems engineering discipline by excellence. As technology becomes increasingly sharp and knowledge extends, robots are progressively entering all aspects of our world. Robots and humans are bound to develop each other's capabilities in a symbiotic relation that is only beginning and will last for decades. Engage ORCID KAUST Repository KAUST Academic Portal ShareXFacebookLinkedInEmailClipboard Related Sites Electrical and Computer Engineering (ECE) Computer Science (CS) Mechanical Engineering (ME) KAUST Research Conference on Robotics and Autonomy (RobotoKAUST) Aerospace and Transportation Systems (ATS) Related Links Eric Feron list of Publication on Google Scholar LinkedIn Apply for postgraduate study Start your application",
  "content_length": 4387,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:00"
}