{
  "name": "Eric L. Miller 0001",
  "homepage": "https://engineering.tufts.edu/cs/people/faculty/eric-miller",
  "status": "success",
  "content": "Eric Miller | Department of Computer Science Google Scholar ResearchGate Twitter Tufts University Webpage Full Profile Career Highlights / Publications Research Professional Activities Courses / Teaching Activities Eric Miller Professor, Electrical and Computer Engineering Professor, Computer Science Professor, Biomedical Engineering Professor, Mathematics (617) 627-0835 eric.miller@tufts.edu 171 College Avenue Full Profile (facultyprofiles.tufts.edu) Google Scholar ResearchGate Twitter Tufts University Webpage Full Profile Career Highlights / Publications Research Professional Activities Courses / Teaching Activities Research/Areas of Interest Statistical- and physics-based signal and image modeling and processing, tomographic image formation and object characterization, and inverse problems. Applications explored include human performance assessment, materials science, airport security, medical imaging, environmental monitoring and remediation, unexploded ordnance remediation, and automatic target detection and classification. Education Ph.D in Electrical Engineering, Massachusetts Institute of Technology, Cambridge, United States, 1994S.M. in Electrical Engineering, Massachusetts Institute of Technology, Cambridge, United States, 1992S.B. in Electrical Engineering, Massachusetts Institute of Technology, Cambridge, United States, 1990 Biography Eric L. Miller received the BS, MS, and Ph.D. degrees in 1994 all in Electrical Engineering and Computer Science at the Massachusetts Institute of Technology, Cambridge, MA. From 1994-2006 he was on the faculty in the Department of Electrical and Computer and Computer Engineering at Northeastern University. Dr. Miller currently is a Professor of Electrical and Computer Engineering at Tufts University with secondary appointments in the Departments of Mathematics, Biomedical Engineering and Computer Science. He is a Senior Scientists at the Jean Meyer Human Nutrition Research Center on Aging at Tufts University as well as Scientific Manager for Prediction and Data Sciences at the Tufts Center for Applied Brian and Cognitive Sciences. Since October 2024, Dr. Miller has served as the Director of the Engineering Education and Centers Division in the Directorate of Engineering at the US National Science Foundation where he manages a group of over 20 program directors and administrative staff and a budget of over $100M. In that position he acts as a member of the Engineering Directorate leadership team, assesses the needs and trends in research and education related to the Division's programs, implements overall strategic planning and policy setting, provides leadership and guidance to Division staff members, determines funding requirements, prepares and justifies budget estimates, balances program needs, allocates resources, oversees the evaluation of proposals and recommendations for awards and declinations, and represents NSF to relevant external groups.Dr. Miller is a member of Tau Beta Pi, Phi Beta Kappa, Sigma Xi, and Eta Kappa Nu. He received the CAREER Award from the National Science Foundation in 1996 and the Outstanding Research Award from the College of Engineering at Northeastern University in 2002. From 2014-2018, he was a member of the Technical Liaison Committee for the IEEE Transactions on Computational Imaging and was Chair of the SIAM Imaging Sciences Special Interest Group from 2015-2017. From 2003-2015 Dr. Miller served as an Associate Editor for the IEEE Transactions on Geoscience and Remote Sensing and held the same position at the IEEE Transactions on Image Processing from 1999-2003.",
  "content_length": 3607,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:08"
}