{
  "name": "Eric Yu 0001",
  "homepage": "http://www.cs.toronto.edu/~eric",
  "status": "success",
  "content": "Professor Eric Yu - Home Page UofT Home ischool@Toronto Eric Yu Ph.D. Professor Research Interests Creating responsible data science solutions Human-AI collaborative work Architecting the cognitive enterprise Design for digital living Sustainability and other global challenges Research Approach As we create increasingly powerful technology systems, we are faced with potential side-effects that can be harmful or dangerous. Smart phones, the internet, cloud computing, machine learning, and all the other technologies that undergird today's digital world have supercharged the economy and have given us the numerous conveniences of modern living. Yet we worry about security attacks, privacy breaches, biased algorithms, potential displacement by robots and even loss of human dignity. Organizations struggle to remain nimble and resilient in the face of uncertainty and frequent disruptions, while deploying ever more complex software and information infrastructures. My research is premised on the idea that technology systems must be studied within a social context. To create effective and viable information technology systems, one must understand how the systems will impact or transform the surrounding social environment. Prior work In earlier work, I developed the i* modeling framework -- an attempt to use Conceptual Modeling to bridge a social conception of the world and the design of information systems. i* adopts a rather simplistic view of the social world. It consists of actors who depend on each other to achieve what they want. Actors have freedom to choose among alternative means for achieving their goals, but their choices are constrained by mutual dependency relationships among actors. As technology options present themselves, actors seek to reconfigure relationships in ways that would advance their strategic interests. By applying i* modeling, one can explore the potential impacts of various system designs on stakeholders, in search of design options that would better meet the desires and aspirations of all concerned. i*-inspired social modeling has seen applications in business process analysis, requirements engineering, software development methodologies, information security and privacy, and other areas. Many researchers have incorporated social modeling into their modeling methods and techniques, and have enhanced and extended the original proposal in different directions. A version of i* is part of an international standard. The Pressing Need Today's technology systems are becoming ever more entangled in human lives and social relationships, as they mediate more and more of our interactions, in work, play, or leisure. They know us more intimately than we know ourselves or each other, from the data they collect about us. Emerging technologies and trends like virtual worlds and decentralized finance are taking us into uncharted waters. My current research agenda is to develop conceptual modeling techniques that are rich enough to help us analyze today's advancing technology systems in social context, so that we, stakeholders together with systems architects and designers, can choose the right technologies and make wise design choices to attain the desired positive benefits while avoiding the negative consequences. An Approach Based on Conceptual Modeling and Requirements Engineering Techniques The i* framework was inspired by multi-agent concepts in classical AI, where agents are assumed to be rational and can reason about alternative ways of achieving goals. To be able to characterize and reason about today's digital technologies in social context, we expect to derive inspirations from theories and concepts from many disciplines, including social psychology, cognitive science, neuroscience, economics, political science, and others. The expected research outcome will include conceptual modeling language(s) (or features thereof), analysis techniques for drawing conclusions from models, and design techniques to guide the search for solutions to sociotechnical design problems. Knowledge catalogs to guide the modeling and design process may be compiled to provide easy access to pertinent knowledge from source disciplines. A sample of this research approach can be found in this doctoral thesis. Sample software tools supporting i* and related modeling techniques can be found on this iStar wiki page. Recent Presentations: \"Leveraging Knowledge from Humans and from Data: Why Requirements Engineering (Still) Matters\" (video) Keynote talk at IC3K October 2021. \"Conceptual Modeling in the Face of Complex Social Realities\" (video) Keynote talk at ER20 November 2020, on receiving the Peter P. Chen Award. Research Topic Areas 1. Creating responsible data science solutions While machine learning has advanced by leaps and bounds technologically, harnessing the technology in application settings remains a challenge. Treating data science, ML, and AI purely as technology initiatives is bound to lead to deleterious effects in the human social arena. From problem formulation to solution development, such initiatives are fraught with pitfalls and typically require much iterative experimentation and exploration and ongoing adjustments. A data science initiative thus needs to be conceived of as a complex socio-technical endeavour, not only in terms of understanding the target application environment and how it will be transformed through the initiative, but also in its own operation as a project organization with specialized interests and skills intervening in the social environment of the target domain throughout the lifetime of the initiative. To advance the maturity of machine learning solutions development, new methods should address: -    How to recognize the types of expertise and perspectives that each stakeholder - data scientists, machine learning engineers, data engineers, deployment specialists, subject matter experts, end users, business leaders, etc. - bring to an initiative? How to analyze relationships among them so as to identify issues and areas for improvement? -    Can there be systematic techniques for problem understanding and characterization, analogous to those available for conventional information systems development? -    What modeling representations and methods can facilitate mutual understanding of project objectives and solution alternative among  team members and other stakeholders? -    How to reconcile disparate interests, such as concerns for bias and fairness, with accuracy or business efficiency? Are there heuristics or solution patterns that can guide the search for trade-offs that would be acceptable to all parties? Can such techniques facilitate adjustments and fine-tuning of the solution as situations evolve? -    How to make the rapidly expanding knowledge base of solution techniques addressing critical ML issues such as model transparency and explainability readily accessible to solution developers and other stakeholders? Relevant backgrounds: machine learning/AI, software development process and project organizations, requirements engineering (especially non-functional requirements), responsible data science, socio-technical analysis 2. Human-AI collaborative work processes With the rise of the data-driven computing paradigm and increasingly powerful machine learning algorithms, the roles of humans and machines are continually shifting. Current modeling techniques such as BPMN, suitable for facilitating the automation of routinized repetitive work, are inadequate for analyzing the new relationships in organization settings where humans and intelligent machines collaborate to achieve work objectives. A well-designed human-AI collaborative work process would aim to leverage the respective strengths of humans and machines while mitigating their weaknesses. Systems design today needs to consider the socio-technical relationship, such as trust, human and machine learning, and how much and what kinds of flexibility and discretion in human action and decision making to allow.   Some key research challenges for requirements modeling include: -    How to model a software component or service that is capable of learning? -    How to support analysis of varying degrees of automation, depending on the ability of algorithms to handle the task, and the confidence level of the human expert? -    How to represent discretion, responsibility, and accountability? -    How to model human learning, including their adaptation to ML/AI components with varying abilities? e.g, when they adopt workarounds. Relevant backgrounds: business process management (BPM), machine learning/AI, computer-supported collaborative work 3. Architecting the cognitive enterprise Enterprise modeling and architecture methods have expanded in recent years to support business and digital transformation, encompassing capability analysis, ecosystem relationships, business model innovation, and more. These methods however have yet to address the rapid rise of the data-driven paradigm of computing. Today, more and more organizations are adopting data-driven decision making as data from mobile, social, cloud, and sensor networks become readily available, in addition to traditional transactional data. Yet machine learning and AI are mostly deployed opportunistically in isolated applications rather than positioned strategically in the architecture of the overall enterprise. Data-driven computing can vastly augment the cognitive capabilities of an organization to sense and interpret the environment, complementing the power of traditional knowledge-based computing to automate operations. The business and enterprise architect today can conceive the enterprise as comprising of cognitive entities, realized by a mix of human and digital technologies, recognizing their respective capabilities and limitations. Research challenges include: -    How to model the cognitive capabilities and characteristics of humans and machines in order to envision an",
  "content_length": 56484,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:15"
}