{
  "name": "Eric W. Frew",
  "homepage": "https://www.colorado.edu/faculty/frew",
  "status": "success",
  "content": "Home | Eric Frew | University of Colorado Boulder Skip to main content TranslateEnglishSpanishChineseFrenchGermanKoreanLaoNepaliJapaneseTibetanSearchEnter the terms you wish to search for.Other ways to search:Events CalendarCampus MapHomeEric W. FrewProfessor, Aerospace Engineering Sciences Department The ability to understand and predict the dynamic behavior of our planet’s environment over multiple scales remains an outstanding challenge for science and engineering. New robotic sensor networks will enable the shift from remote observation to in situ science in which autonomous systems actively assimilate data and explore. My research vision is to create autonomous airborne scientists and autonomous robotic explorers. My research focuses on establishing the fundamental connections between sensing, communication, and control in robotic sensor networks, with an emphasis on heterogeneous uncrewed aircraft systems. Understanding these connections enables the creation of robust, efficient, persistent robotic sensor networks which can move both sensors and information in the best way to the best locations to make the best forecasts.I have established an interdisciplinary research program based on overlapping areas of interest that include: autonomous flight of heterogeneous uncrewed aircraft systems (UAS), guidance and control of uncrewed aircraft in complex atmospheric phenomena, optimal distributed sensing by autonomous robot teams, miniature self-deploying systems, and field robotics. My group’s work combines the investigation of theoretical issues in autonomous networked systems with the design, implementation, and demonstration of heterogeneous uncrewed aircraft systems. We have developed a fleet of uncrewed aircraft and acquired FAA authorization to fly multiple aircraft together. Highlighted Videos Highlighted Projects Center for Autonomous Air Mobility and Sensing (CAAMS)The Center for Autonomous Air Mobility and Sensing was established in 2022 and is an Industry/University Cooperative Research Center involving the University of Colorado Boulder, Brigham Young University, Penn State University, Texas A&M University, University of Michigan and Virginia Tech. CAAMS is a partnership between academia, industry, and government to offer pre-competitive research in autonomous air mobility and sensing. We blend theoretical advances with hands-on demonstration and assessment in realistic field conditions.Dispersed Autonomy for Marsupial Aerial Robot Teams (MARTS)This project will conduct innovative integration of robotics technologies to create Marsupial Aerial Robot Teams (MARTs) whereby small uninhabited aircraft systems (i.e. drones) carry smaller aircraft to provide observations of the atmosphere. Effective advanced warning systems enabled by the data collected by MARTs could drastically reduce the loss of life and damage caused by severe weather. Aerial robotic systems operating in places too dangerous for humans or expensive single-vehicle systems will need to reason over detailed models and large amounts of data. This project will create and deploy a team of robots that will be like an autonomous airborne meteorologist performing online targeted forecasting.Distributed Autonomous Robotic Information Gathering (DARING)The goal of this work is to develop a framework for distributed autonomous robotic information gathering (DARING) in constrained communication environments by teams of mobile robots. The project will investigate algorithms for decomposing communication- and computation-aware team objectives into local decision-making algorithms that do not rely on persistent network connectivity.Volcanic Emission iNvestigation Utilizing Single-particle In-situ Automated Nephelometry (VENUSIAN)This project is carrying out systems-level testing of an autofluorescence nephelometer (AFN) intended to study the clouds of Venus. Our team will deploy the sensor on a small UAS and conduct data collection flights over an active volcano. These flights will help validate the sensor, improve science return from the Rocket Lab Mission to Venus, and demonstrate a proof of principle for improving volcanic sulfur emission knowledge on Earth.",
  "content_length": 4199,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:14"
}