{
  "name": "Eric Chan-Tin",
  "homepage": "https://chantin.cs.luc.edu/~chantin",
  "status": "success",
  "content": "Eric Chan-Tin Eric Chan-Tin Professor, Department of Computer Science Founding Director of the Loyola Center for Cybersecurity Loyola University Chicago dchantin AT luc.edu Office: Doyle 306 Phone Number: 773-508-8345 Google Scholar Links: Publications, Teaching, Students I am a Professor in the Department of Computer Science at Loyola University Chicago, the Founding Director of the Loyola Center for Cybersecurity, and the Graduate Program Director (GPD) for the MS in Cybersecurity program. I was previously an Assistant/Associate Professor in the Computer Science department at Oklahoma State University. I received my B.A. from Macalester College and my Ph.D. from the University of Minnesota. I am privileged to have worked with Professor Nick Hopper as my adviser. I joined Loyola University Chicago in August 2018 to lead the cybersecurity program. Loyola University Chicago has been designated as a NSA National Center of Academic Excellence in Cyber Defense (NCAE-C) in June 2020, and in 2025, re-designated until 2030. I am the PI for the NCAE-C at Loyola and the Founding Director of the Loyola Center for Cybersecurity. My research and education and outreach efforts have been funded by NSF (3 awards), NSA/NCAE (2 awards), DoD, and industry such as Halliburton, Motorola Solutions Foundation (3 years), and Dr. Scholl Foundation (4 awards). From July 2020 to August 2022, I was the Graduate Program Director (GPD) for the MS in Computer Science and MS in Software Engineering programs. As GPD, I significantly updated the MS curriculum in Computer Science: 1) adding program prerequisites to prepare non-CS undergraduate majors to enter the MS program, and 2) adding three new concentrations in Artificial Intelligence, Cybersecurity, and Computer Systems. From August 2022 to June 2024, I was the faculty Director for the Fellowship Office. Please visit the Fellowship Office website for more information. I am always looking for motivated students (undergraduate, M.S., Ph.D.) to work with me in the research areas below. E-mail me or stop by my office. Also, consider enrolling in one of my classes for Fall or Spring. Undergraduate students should also consider applying for the CAS USRE/Mulcahy or the LUROP programs. If you are a current or prospective student in the MS in Cybersecurity program, please contact gpdcyber@cs.luc.edu If you are looking for more information about the NSF CyberRamblers Scholarship for Service program, please click here. If you are looking for the AI and Cybersecurity workshop for professionals, please click here. Research Interests Network Security Computer Security Distributed Systems Peer-to-peer Networks Anonymity Privacy Intersection of Cybersecurity and Social Science Publications Journals, Conferences/Workshops, Posters Journals Shelia M. Kennison, Maria Andrea Hurtado Morales, K. E. Nelson, and Eric Chan-Tin. \"Gender differences in emoji use: Relationships with personality traits\", Current Psychology, 2025. Eldor Abdukhamidov, Mohammed Abuhamad, Simon S. Woo, Eric Chan-Tin, and Tamer Abuhmed. \"Stealthy Query-Efficient Black-Box Attack against Interpretable Deep Learning\", IEEE Transactions on Reliability, 2025, doi: 10.1109/TR.2025.3551717. Victoria H. Spooner, Eric Chan-Tin, and Shelia M. Kennison. \"Sensation seeking adjective markers (SSAM): Development and validation of a new sensation seeking measure\", Current Psychology, 43, 36416–36424, Dec. 2024. https://doi.org/10.1007/s12144-024-07028-8 Loretta J. Stalans, Madeline Moran, Anna Hart, Eric Chan-Tin, and James Pardonek. \"Being Phished and Reporting Phishing Emails: Emotional and Knowledge Antecedents and Training Gaps\", Journal of Crime and Justice, 1–19, October 2024. https://doi.org/10.1080/0735648X.2024.2415321 Shelia Kennison, Kameryn Fritz, M. Andrea Hurtado Morales, and Eric Chan-Tin. \"Emoji use in Social Media Posts: Relationships with Personality Traits and Word Usage\", Frontiers in Psychology, Volume 15, February 2024, https://doi.org/10.3389/fpsyg.2024.1343022. Eldor Abdukhamidov, Mohammed Abuhamad, Simon S. Woo, Eric Chan-Tin, and Tamer Abuhmed. \"Hardening Interpretable Deep Learning Systems: Investigating Adversarial Threats and Defenses\", IEEE Transactions on Dependable and Secure Computing, 2023. Loretta Stalans, Eric Chan-Tin, Anna Hart, Madeline Moran, and Shelia Kennison. \"Predicting Phishing Victimization: Comparing Prior Victimization, Cognitive, and Emotional Styles, and Vulnerable or Protective E-mail Strategies\", Victims & Offenders, 18:7, 1216-1235, 2023. DOI: 10.1080/15564886.2023.2218369 Shelia Kennison and Eric Chan-Tin. \"Personality and cognitive factors in password security behaviors\", North American Journal of Psychology, 25(3), 599-618, 2023. Anne Wagner, Anna Bakas, Shelia Kennison, and Eric Chan-Tin. \"Comparing Online Surveys for Cybersecurity: SONA and Mturk\", EAI Endorsed Transactions on Security and Safety (SESA), 2022. DOI: 10.4108/eai.8-2-2022.173334 Shelia M. Kennison and D. Eric Chan-Tin. \"Predicting the Adoption of Password Managers: A Tale of Two Samples\", Technology, Mind, and Behavior, November 2021., https://tmb.apaopen.org/pub/5yfwxh2z Shelia M. Kennison, Ian T. Jones, Victoria H. Spooner, and D. Eric Chan-Tin. \"Who creates strong passwords when nudging fails\", Computers in Human Behavior Reports, Volume 4, 2021, ISSN 2451-9588, https://doi.org/10.1016/j.chbr.2021.100132. Anna Bakas, Anne Wagner, Spencer Johnston, Shelia Kennison, and Eric Chan-Tin. “Impact of Personality Types and Matching Messaging on Password Strength”, EAI Endorsed Transactions on Security and Safety, June, 2021. DOI: 10.4108/eai.1-6-2021.170012. Shelia Kennison and Eric Chan-Tin. “Taking Risks with Cybersecurity: Using Knowledge and Personal Characteristics to Predict Self-Reported Cybersecurity Behaviors”, Journal of Frontiers in Psychology, section Cognition, 2020. Weiqi Cui, Jiangmin Yu, Yanmin Gong, Eric Chan-Tin. “Efficient, Effective, and Realistic Website Fingerprinting Mitigation”, EAI Transactions on Endorsed Transactions on Security and Safety, November 2019, DOI: 10.4108/eai.29-1-2019.161977, Zongho Huang, Rui Hu, Richard Guo, Yanmin Gong, Eric Chan-Tin. \"DP-ADMM: ADMM-based Distributed Learning with Differential Privacy\", IEEE Transactions on Information Forensics and Security, July 2019, DOI: 10.1109/TIFS.2019.2931068. Eric Chan-Tin and Rakesh Ravishankar. \"The case for HTTPS: measuring overhead and impact of certificate authorities\", International Journal Security and Networks, Vol. 13, No. 4, pp.261-269, 2018. Tao Chen, Michael Farcasin, and Eric Chan-Tin. \"Smartphone Passcode Prediction\", in IET Information Security, vol. 12, no. 5, pp. 431-437, 9 2018. doi: 10.1049/iet-ifs.2017.0606. Praveen Khethavath, Johnson Thomas, and Eric Chan-Tin. \"Towards an Efficient Distributed Cloud Computing Architecture\", Journal of Peer-to-Peer Networking and Applications, pg 1-17, 2016. Jiyoung Shin, Sunil Kancharlapalli, Michael Farcasin, and Eric Chan-Tin. \"SmartPass: a smarter geolocation-based authentication scheme\", Wiley Security and Communication Networks, n/a, 10.1002/sec.1311, 2015. Eric Chan-Tin, Jiyoung Shin, and Praveen Khethavath. \"Accurate Geolocation using Network Coordinates\", International Journal of Security and Networks (IJSN), 2015. Eric Chan-Tin and Qi Cheng. \"Secure Routing and Scheduling in Ad-Hoc Cognitive Radio Networks for Public Safety\", International Journal of Handheld Computing Research (IJHCR), 5(2), 44-60. doi:10.4018/ijhcr.2014040103, 2015. Michael Farcasin and Eric Chan-Tin. \"Why We Hate IT: Two Surveys on Pre-generated and Expiring Passwords in an Academic Setting\", Wiley Security and Communication Networks, n/a, 10.1002/sec.1184, 2015. Eric Chan-Tin, Victor Heorhiadi, Yongdae Kim, and Nicholas Hopper. \"Hijacking the Vuze BitTorrent Network: All your hop are belong to us\", IET Information Security, December 2014. Eric Chan-Tin, Victor Heorhiadi, Nicholas Hopper, and Yongdae Kim. \" The Frog-Boiling Attack: Limitations of Secure Network Coordinate Systems\", ACM Transactions on Information and Systems Security (TISSEC), 14(3):1-28, November 2011. (@2011 ACM) Peng Wang, James Tyra, Eric Chan-Tin, Tyson Malchow, Denis Foo Kune, Nicholas Hopper, and Yongdae Kim. \"Attacking the kad network - real world evaluation and high fidelity simulation using DVN\", Security and Communication Networks, n/a. doi: 10.1002/sec.172 Nicholas Hopper, Eugene Y. Vasserman, and Eric Chan-Tin. \"How much anonymity does network latency leak?\", ACM Transactions on Information and System Security (TISSEC),13(2):1-28, February 2010. (© 2010 ACM) Peer-Reviewed Conferences/Workshops Madeline Moran, Joshua Honig, Nathan Ferrell, Shreena Soni, Sophia Homan, Eric Chan-Tin and Mohammed Abuhamad. \"Encrypted Network Traffic Analysis: To Website Fingerprinting and Beyond\", IEEE Silicon Valley Cybersecurity Conference (SVCC), June 2025. Eric Chan-Tin and Mohammed Abuhamad. \"Bringing Different Disciplines and Competitions in your Classroom\", CAE in Cybersecurity Symposium, Charleston, SC, April 2025. Madeline Moran, Arrianna Szymczak, Anna Hart, Shelia Kennison and Eric Chan-Tin. \"Deep Dive on Relationship between Personality and Password Creation\", The 29th Australasian Conference on Information Security and Privacy (ACISP), July 2024. Firuz Juraev, Mohammed Abuhamad, Eric Chan-Tin, George Thiruvathukal and Tamer Abuhmed. \"Unmasking the Vulnerabilities of Deep Learning Models: A Multi-Dimensional Analysis of Adversarial Attacks and Defenses\", IEEE Silicon Valley Cybersecurity Conference (SVCC), June 2024. (Best Paper Award) Muhammad Khan, Rachel Gordon, Nimra Khan, Madeline Moran, Mohammed Abuhamad, Loretta Stalans, Jeffrey Huntsinger, Jennifer Forestal and Eric Chan-Tin. \"Identification and Analysis of the Spread of {Mis}information on Social Media\", CSoNet, December 2023. Yong Shao, Kenneth Hernandez, Kia Yang, Eric Chan-Tin and Mohammed Abuhamad. \"Lightweight and Effective Website Fingerprinting over Encrypted D",
  "content_length": 19459,
  "method": "requests",
  "crawl_time": "2025-12-01 13:06:59"
}