{
  "name": "Erich P. Ippen",
  "homepage": "http://web.mit.edu/physics/people/faculty/ippen_erich.html",
  "status": "success",
  "content": "Erich P. Ippen ’62 » MIT Physics Skip to content Erich P. Ippen ’62 Professor of Physics, EmeritusElihu Thomson Professor of Electrical Engineering, Emeritus Ippen is a principal investigator in the Research Laboratory of Electronics (RLE). Research Areas Condensed Matter Experiment (617) 253-8504 ippen@mit.edu Office: 36-319 Lab(s): Optics and Quantum Electronics Group at RLE Affiliated Center(s): Research Laboratory of Electronics (RLE) Research Interests Femtosecond fiber and integrated photonic devices; nanophotonics; ultrafast studies of materials and devices; femtosecond optical clock and arbitrary waveform technologies. RLE: Investigator Profile – Erich P. IppenCourtesy of RLEatMIT | YouTube Biographical Sketch Erich P. Ippen received his SB degree from MIT in 1962 and his PhD from the University of California in 1968. He worked at Bell Laboratories in Holmdel, NJ from 1968 to 1980 before joining the faculty of MIT where he is now Elihu Thomson Professor of Electrical Engineering Emeritus and Professor of Physics Emeritus. He is known for his early work on nonlinear optics in fibers and for pioneering the fields of femtosecond science and technology. In the news In the news On-chip optical filter processes wide range of light wavelengths Silicon-based system offers smaller, cheaper alternative to other “broadband” filters; could improve a variety of photonic devices. Awards & Honors 2020 // Honorary Member, Optica (Formerly OSA) \"For laying the foundations of ultrafast science and engineering, as well as providing inspiring leadership to the optics community.\" 2006 // Frederic Ives Medal (OSA) \"For laying the foundations of ultrafast science and engineering and providing vision and sustained leadership to the optics community.\" 2004 // Charles Hard Townes Award (OSA) \"For his many outstanding, pioneering and sustained contributions to ultrafast science and technology, and fundamental nonlinear optics.\" 2001-02 // James R. Killian, Jr. Faculty Achievement Award (MIT) \"In recognition of his extraordinary contributions to his fields and to the Institute.\" 2000 // President, Optical Society of America 1997 // Arthur L. Schawlow Prize in Laser Science (APS) \"For their pioneering work in developing femtosecond sources and for their leadership in applying these sources in broad areas of science.\" 1989 // American Physical Society Fellow \"For his pioneering work in the generation, measurement, and application to physical systems of picosecond and femtosecond light pulses.\" 1985 // National Academy of Sciences Member 1981 // RW Wood Prize (OSA) \"For his outstanding and pioneering work in optical subpicosecond spectroscopy: his development of mode-locking techniques for dye lasers, which have made possible the investigation of ultrashort phenomena, and his application of these techniques to studies of semiconductors, relaxation in large molecules, and studies of hemoglobin and bacteriorhodopsis.\" Key Publications “High-power thulium lasers on a silicon photonics platform,” N. Li et al., Opt. Lett. 42, 1181-4 (2017) “Octave-spanning coherent supercontinuum generation in silicon on insulator from 1.06 μm to beyond 2.4 μm,” N. Singh et al., Nature, Light Science & Applications, 7, 17131 (2018) “Integrated CMOS-compatible Q-switched mode-locked lasers at 1900nm with an on-chip artificial saturable absorber,” K. Shtyrkova et al., Opt. Exp. 27, 3542-3556 (2019)",
  "content_length": 3414,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:16"
}