{
  "name": "Erich Schubert",
  "homepage": "https://www-ai.cs.tu-dortmund.de/PERSONAL/schubert.html",
  "status": "success",
  "content": "Prof. Dr. Erich Schubert LS 8 General Research Teaching Staff Internal SFB876 German Suche > Hauptnavigation General Research Teaching Staff Prof. Morik Prof. Schubert Staff Alumni Email: erich.schubert tu-dortmund.de Phone: 0231/755-7876 Fax: 0231/755-5105 Room-No.: OH12 4.016 About Professor of Data Mining NEW HOMEPAGE: https://dm.cs.tu-dortmund.de/ No international interships: I do not take international students for an internship for the academic years 2023/2024/2025. Emails asking for an internship are likely to remain unanswered. TU Dortmund students are welcome to talk to me about thesises, of course! Above paragraph applies to internship applications from outside Europe, and has become necessary because of the frequency of such requests with low relevancy. For thesis topics, please see the German version of this page. Image credit: TU Dortmund/Nikolas Golsch Publications Bause/etal/2022a Franka Bause and Erich Schubert and Nils M. Kriege. EmbAssi: embedding assignment costs for similarity search in large graph databases. In Data Mining and Knowledge Discovery, Springer, 2022. Lang/Schubert/2021a Andreas Lang and Erich Schubert. BETULA: Fast Clustering of Large Data with Improved BIRCH CF-Trees. In Information Systems, Vol. 108, pages 101918, 2022. Lenssen/Schubert/2022a Lars Lenssen and Erich Schubert. Clustering by Direct Optimization of the Medoid Silhouette. In Similarity Search and Applications, SISAP, 2022. Schubert/2022a Erich Schubert. Automatic Indexing for Similarity Search in ELKI. In Similarity Search and Applications, SISAP, 2022. Schubert/Lenssen/2022a Erich Schubert and Lars Lenssen. Fast k-medoids Clustering in Rust and Python. In Journal of Open Source Software, Vol. 7, No. 75, pages 4183, The Open Journal, 2022. Schubert/Lenssen/2022b Erich Schubert and Lars Lenssen. Fast k-medoids Clustering in Rust and Python. Zenodo, 2022. Thordsen/Schubert/2022a Erik Thordsen and Erich Schubert. ABID: Angle Based Intrinsic Dimensionality -- Theory and Analysis. In Information Systems, Vol. 108, pages 101989, 2022. Thordsen/Schubert/2022b Erik Thordsen and Erich Schubert. On Projections to Linear Subspaces. In Similarity Search and Applications, SISAP, 2022. Bause/etal/2021a Franka Bause and David B. Blumenthal and Erich Schubert and Nils M. Kriege. Metric Indexing for Graph Similarity Search. In Similarity Search and Applications - 14th International Conference, SISAP 2021, Dortmund, Germany, September 29 - October 1, 2021, Proceedings, Vol. 13058, pages 323--336, Springer, 2021. Boczek/etal/2021a Karin Boczek and Erich Schubert and Jonas Rieger and Carsten Jentsch and Henrik Müller and Jörg Rahnenführer. Mapping the news one transcript at a time: Using subtitle data from streaming services to analyse journalistic coverage. In Future of Journalism Conference, Cardiff, 2021. Boczek/etal/2021b Karin Boczek and Erich Schubert and Jonas Rieger and Carsten Jentsch and Henrik Müller and Jörg Rahnenführer. Automatisierter Programmauftrag: Auswirkungen algorithmischer Gewichtungen auf die Verbreitung von Journalismus in öffentlich-rechtlichen Mediatheken. In Innovationen im Journalismus -- Jahrestagung FG Journalistik/Journalismusforschung der DGPuK, 2021. Reyes/etal/2021a Nora Reyes and Richard Connor and Nils M. Kriege and Daniyal Kazempour and Ilaria Bartolini and Erich Schubert and Jian-Jia Chen (editors). Similarity Search and Applications - 14th International Conference, SISAP 2021, Dortmund, Germany, September 29 - October 1, 2021, Proceedings. Vol. 13058, Springer, 2021. Schubert/2021a Erich Schubert. HACAM: Hierarchical Agglomerative Clustering Around Medoids -- and its Limitations. In Thomas Seidl and Michael Fromm and Sandra Obermeier (editors), Proceedings of the LWDA 2021 Workshops: FGWM, KDML, FGWI-BIA, and FGIR, Online, September 1-3, 2021, Vol. 2993, pages 191--204, CEUR-WS.org, 2021. Schubert/2021b Erich Schubert. A Triangle Inequality for Cosine Similarity. In Similarity Search and Applications - 14th International Conference, SISAP 2021, Dortmund, Germany, September 29 - October 1, 2021, Proceedings, Vol. 13058, pages 32--44, Springer, 2021. Schubert/etal/2021a Erich Schubert and Andreas Lang and Gloria Feher. Accelerating Spherical k-Means. In Similarity Search and Applications - 14th International Conference, SISAP 2021, Dortmund, Germany, September 29 - October 1, 2021, Proceedings, Vol. 13058, pages 217--231, Springer, 2021. Schubert/Rousseeuw/2021a Erich Schubert and Peter J. Rousseeuw. Fast and Eager k-Medoids Clustering: O(k) Runtime Improvement of the PAM, CLARA, and CLARANS Algorithms. In Information Systems, Vol. 101, pages 101804, 2021. Thordsen/Schubert/2021a Erik Thordsen and Erich Schubert. CANDLE: Classification And Noise Detection With Local Embedding Approximations. In Thomas Seidl and Michael Fromm and Sandra Obermeier (editors), Proceedings of the LWDA 2021 Workshops: FGWM, KDML, FGWI-BIA, and FGIR, Online, September 1-3, 2021, Vol. 2993, pages 219--231, CEUR-WS.org, 2021. Thordsen/Schubert/2021b Erik Thordsen and Erich Schubert. MESS: Manifold Embedding Motivated Super Sampling. In Similarity Search and Applications - 14th International Conference, SISAP 2021, Dortmund, Germany, September 29 - October 1, 2021, Proceedings, Vol. 13058, pages 232--246, Springer, 2021. Koprinska/etal/2020a Irena Koprinska and Michael Kamp and Annalisa Appice and Corrado Loglisci and Luiza Antonie and Albrecht Zimmermann and Riccardo Guidotti and Özlem Özgöbek and Rita P. Ribeiro and Ricard Gavaldà and João Gama and Linara Adilova and Yamuna Krishnamurthy and Pedro M. Ferreira and Donato Malerba and Ibéria Medeiros and Michelangelo Ceci and Giuseppe Manco and Elio Masciari and Zbigniew W. Ras and Peter Christen and Eirini Ntoutsi and Erich Schubert and Arthur Zimek and Anna Monreale and Przemyslaw Biecek and Salvatore Rinzivillo and Benjamin Kille and Andreas Lommatzsch and Jon Atle Gulla (editors). ECML PKDD 2020 Workshops - Workshops of the European Conference on Machine Learning and Knowledge Discovery in Databases (ECML PKDD 2020): SoGood 2020, PDFL 2020, MLCS 2020, NFMCP 2020, DINA 2020, EDML 2020, XKDD 2020 and INRA 2020, Ghent, Belgium, September 14-18, 2020, Proceedings. Vol. 1323, Springer, 2020. Lang/Schubert/2020a Andreas Lang and Erich Schubert. BETULA: Numerically Stable CF-Trees for BIRCH Clustering. In Proceedings of the 13th International Conference on Similarity Search and Applications SISAP 2020, Copenhagen, Denmark, pages 281--296, 2020. Thordsen/Schubert/2020a Erik Thordsen and Erich Schubert. ABID: Angle Based Intrinsic Dimensionality. In Proceedings of the 13th International Conference on Similarity Search and Applications SISAP 2020, Copenhagen, Denmark, pages 218--232, 2020. Amsaleg/etal/2019a Laurent Amsaleg and Michael E. Houle and Erich Schubert. Introduction to Special Issue of the 9th International Conference on Similarity Search and Applications (SISAP 2016). In Information Systems, Vol. 80, pages 107, 2019. Ntoutsi/etal/2019a Eirini Ntoutsi and Erich Schubert and Arthur Zimek and Albrecht Zimmermann. 1st Workshop on Evaluation and Experimental Design in Data Mining and Machine Learning (EDML 2019). In Eirini Ntoutsi and Erich Schubert and Arthur Zimek and Albrecht Zimmermann (editors), Proceedings of the 1st Workshop on Evaluation and Experimental Design in Data Mining and Machine Learning co-located with SIAM International Conference on Data Mining (SDM 2019), Calgary, Alberta, Canada, May 4th, 2019., Vol. 2436, pages 1--3, CEUR-WS.org, 2019. Ntoutsi/etal/2019b Eirini Ntoutsi and Erich Schubert and Arthur Zimek and Albrecht Zimmermann (editors). Proceedings of the 1st Workshop on Evaluation and Experimental Design in Data Mining and Machine Learning co-located with SIAM International Conference on Data Mining (SDM 2019), Calgary, Alberta, Canada, May 4th, 2019. Vol. 2436, CEUR-WS.org, 2019. Schubert/Rousseeuw/2019a Erich Schubert and Peter J. Rousseeuw. Faster k-Medoids Clustering: Improving the PAM, CLARA, and CLARANS Algorithms. In Proceedings of the 12th International Conference on Similarity Search and Applications, SISAP 2019, Newark, NJ, October 2-4, pages 171--187, 2019. Schubert/Zimek/2019a Erich Schubert and Arthur Zimek. ELKI: A large open-source library for data analysis - ELKI Release 0.7.5 \"Heidelberg\". In CoRR, Vol. abs/1902.03616, 2019. Houle/etal/2018a Michael E. Houle and Erich Schubert and Arthur Zimek. On the Correlation Between Local Intrinsic Dimensionality and Outlierness. In Proceedings of the 11th International Conference on Similarity Search and Applications (SISAP), Lima, Peru, pages 177-191, 2018. Schubert/etal/2018a Erich Schubert and Andreas Spitz and Michael Gertz. Exploring Significant Interactions in Live News. In Proceedings of the 2nd International Workshop on Recent Trends in News Information Retrieval (NewsIR'18) co-located with 40th European Conference on Information Retrieval (ECIR 2018), Grenoble, France, pages 39--44, 2018. Schubert/etal/2018b Erich Schubert and Sibylle Hess and Katharina Morik. The Relationship of DBSCAN to Matrix Factorization and Spectral Clustering. In Proceedings of the Conference \"Lernen, Wissen, Daten, Analysen\" (LWDA), Mannheim, Germany, pages 330--334, 2018. Schubert/Gertz/2018a Erich Schubert and Michael Gertz. Numerically Stable Parallel Computation of (Co-)Variance. In Proceedings of the 30th International Conference on Scientific and Statistical Database Management (SSDBM), Bolzano-Bozen, Italy, pages 10:1--10:12, 2018. Schubert/Gertz/2018b Erich Schubert and Michael Gertz. Improving the Cluster Structure Extracted from OPTICS Plots. In Proceedings of the Conference \"Lernen, Wissen, Daten, Analysen\" (LWDA), Mannheim, Germany, pages 318--329, 2018. Casanova/etal/2017a Guillaume Casanova and Elias Englmeier and Michael E. Houle and Peer Kröger and Michael Nett and Erich Schubert and Arthur Zimek. Dimensional Testing for Reverse k-Nearest Neighbor Search. In Proceedings of the VLDB Endowmen",
  "content_length": 22341,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:18"
}