{
  "name": "Eric Monteiro",
  "homepage": "https://www.ntnu.edu/employees/eric.monteiro",
  "status": "success",
  "content": "Eric Monteiro - NTNU Eric Monteiro Download press photo Download press photo Foto: Close Eric Monteiro Professor Department of Computer Science eric.monteiro@ntnu.no +4773596751 +4795213088 336 PTS 2 Valgrinda, Trondheim About Professor with primary field of interest is digitalization of organizations. Key concerns include challenges of integration, change and standardization. Particularly interested in the interplay between 'technical' and non-technical design decisions especially in large-scale (\"infrastructural\") projects.  Empirically, my work has focused on the health care sector (Norway and developing countries) and the oil and gas sector. I’m adjuct professor at Univ. of Oslo, Dept. of Informatics, Group on Information Systems/ Global Infrastructures. I’m Senior Editor at MISQ and Information and Organization. I am also AE/advisory board of The Information Society (TIS), IT for development (ITD),  Scandinavian Journal of Information Systems (SJIS) and the International Journal of Standards & Standardization research. I was previously Senior Editor at  Information Systems Research (ISR) and Editor-in-chief of the SJIS (2001-2005). My cv Projects Project member of EXAIGON, NFR financed project on XAI (explainable AI) Management group of BRU21, Management group for SIRIUS (http://www.sirius-labs.no/) NFR SFI centre on Scalable data access in the oil and gas domain with Univ. of Oslo, Oxford Univ. and external partners. Project leader for Digital oil (Doil ) addressing the exploitation of vast amount of sensor based information in the oil and gas industry. Partners are Univ. of Oslo and Studio Apertura. The project is funded (2012-2015) by the Norwegian Research Council (NFR). I’m in the project group of Agile 2.0 on the “scaling” agile methods, KMB within NFR BIA (2014 – 2018) with Sintef as PI. Responsible for the PhD involvement of IDI in the Centre for Integrated Operations (IO centre) within oil and gas. Project partner in Global health eInfrastructues (GHeI) addressing the integration of health information systems in developing countries, together with Univ. of Oslo. The project is funded (2009-2012) by the Norwegian Research Council (NFR). Pnvolved with the FIPP project addressing flexible integration of processes in the public sector, together with the Univ. of Oslo Dept. of Informatics and Technology, innovation and Culture (TIK). The project is funded (2006 – 2009) by the Norwegian Research Council (NFR). Part of the management group of the project ‘Regional communication within and across health organisations’ with the U. of Tromsø. The project is funded (2006 – 2009) by the Norwegian Research Council (NFR). Pnvolved with the HISP project dealing with health information systems in deprived areas in the South, especially Southern and Eastern Africa and South Asia. The project is headed by the Univ. of Oslo. Involved in the ‘Integrated health information system for vaccination in developing countries’ headed by the U. of Oslo. The project is funded (2007 – 2012) by the Norwegian Research Council (NFR). Publications 2025 Røyrvik, Emil André; Monteiro, Eric. (2025) Democracy: Yay or nay? -ISFiT, Samfundet.no. Other presentation Røyrvik, Emil André; Monteiro, Eric. (2025) En vei ut av søvngjengeriet | Klassekampen. Other 2024 Aanestad, Margunn; Hanseth, Ole; Monteiro, Eric; Niemimaa, Marko Ilmari; Ribes, David. (2024) From Methodological Symmetry to Gaia: Latour’s Legacy and Untapped Potential for IS Research. Journal of the AIS Academic article Monteiro, Eric. (2024) Taking the longer road. Scandinavian Journal of Information Systems (SJIS) Academic article Sporsem, Tor Thorsrud; Monteiro, Eric. (2024) Vil du teste KI? Unngå «Tesla-fellen» (https://www.dn.no/innlegg/ki/forskning/helse/vil-du-teste-ki-unnga-tesla-fellen/2-1-1650977). Feature article Monteiro, Eric; Sporsem, Tor Thorsrud. (2024) Vil du teste KI? Unngå «Tesla-fellen». Feature article Sporsem, Tor Thorsrud; Monteiro, Eric. (2024) Are you looking to test new AI tools? Make sure you avoid the ‘Tesla trap’. Feature article Mohanty, Pooja; Grundstrom, Casandra Ann; Monteiro, Eric; Zhang, Zhenyou. (2024) Tensions in the transition of Human-AI Collaboration: A Case Study of the Nordic Renewable Energy Sector. Proceedings of the Annual Hawaii International Conference on System Sciences (HICSS) Academic article Constantinides, Panos; Monteiro, Eric; Mathiasssen, Lars. (2024) Human-AI joint task performance: Learning from uncertainty in autonomous driving systems. Information and organization Academic article 2023 Aaltonen, Aleksi; Alaimo, Cristina; Parmiggiani, Elena; Stelmaszak, Marta; Jarvenpaa, Sirkka; Kallinikos, Jannis. (2023) What is Missing from Research on Data in Information Systems? Insights from the Inaugural Workshop on Data Research. Communications of the Association for Information Systems Academic article Braa, Jørn Anders; Sahay, Sundeep; Monteiro, Eric. (2023) Design Theory for Societal Digital Transformation: The Case of Digital Global Health. Journal of the AIS Academic article 2022 Monteiro, Eric; Constantinides, Panos; Scott, Susan; Shaikh, Maha; Burton-Jones, Andrew. (2022) Qualitative research methods in Information Systems: A call for Phenomen-focused Problematization. MIS Quarterly Academic article Hochwarter, Stefan; Schwarz, Julian; Muehlensiepen, Felix; Monteiro, Eric. (2022) Becoming a Guest: On Proximity and Distance in Mental Health Home Treatment. Computer Supported Cooperative Work (CSCW) Academic article Nordal, Elise; Monteiro, Eric; Smebye, Andreas. (2022) Digital samhandling i bygg- og anleggsbransjen En casestudie av en digital plattform for sirkulær utnyttelse av overskuddsmasser. Masteroppgave i Datateknologi. NTNU NTNU Masters thesis Monteiro, Eric. (2022) Digital oil: Machineries of knowing. MIT Press MIT Press Academic monograph 2021 Hepsø, Vidar; Monteiro, Eric. (2021) From Integrated Operations to Remote Operations: Socio-technical Challenge for the Oil and Gas Business. Academic chapter/article/Conference paper Kaasbøll, Jens Johan; Monteiro, Eric; Asah, Flora Nah. (2021) Challenges and Approaches of Implementing Standard Health Indicators in Hierarchical Organizations: A multisited study. Universitetet i Oslo Universitetet i Oslo Doctoral dissertation Mikalsen, Marius; Monteiro, Eric. (2021) Acting with inherently uncertain data: practices of data-centric knowing. Journal of the AIS Academic article 2020 Østerlie, Thomas; Monteiro, Eric. (2020) Digital sand: The becoming of digital representations. Information and organization Academic article Bandi, Rajendra; Klein, Stefan; Madon, Shirin; Raghavendra, Ranjini; Monteiro, Eric. (2020) IFIPJWC: IFIP Joint Working Conference on the Future of Digital Work: The Challenge of Inequality. Springer Springer Academic anthology/Conference proceedings 2019 Monteiro, Eric; Parmiggiani, Elena. (2019) Synthetic Knowing: The Politics of the Internet of Things. MIS Quarterly Academic article Parmiggiani, Elena; Monteiro, Eric. (2019) Digitized Coral Reefs. Academic chapter/article/Conference paper 2018 Parmiggiani, Elena; Monteiro, Eric. (2018) Shifting Baselines? Recommendations for Green IS. Academic chapter/article/Conference paper Monteiro, Eric; Østerlie, Thomas; Parmiggiani, Elena; Mikalsen, Marius. (2018) Quantifying quality: Towards a Post-Humanist Perspective on Sensemaking. Academic chapter/article/Conference paper Monteiro, Eric. (2018) Reflections on digital innovation. Information and organization Academic article Mikalsen, Marius; Monteiro, Eric. (2018) Data Handling in Knowledge Infrastructures: A Case Study from Oil Exploration. Proceedings of the ACM on Human-Computer Interaction (PACMHCI) Academic article 2017 Roland, Lars Kristian; Sanner, Terje Aksel; Sæbø, Johan Ivar; Monteiro, Eric. (2017) P for platform: Architectures of large-scale participatory design. Scandinavian Journal of Information Systems (SJIS) Academic article 2016 Parmiggiani, Elena; Monteiro, Eric. (2016) A measure of ‘environmental happiness’: Infrastructuring environmental risk in oil and gas offshore operations. Science & Technology Studies Academic article Faraj, Samer; Krogh, Georg von; Monteiro, Eric; Lakani, Karim. (2016) Online community as space for knowledge flows. Information systems research Academic article Yogarajah, Aravinthan; Monteiro, Eric; Dingsøyr, Torgeir. (2016) Smidig utviklingsmiljø: Organisatorisk læring og kommunikasjon - Case studier av retrospektivmøter. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Masters thesis Parmiggiani, Elena; Monteiro, Eric; Østerlie, Thomas. (2016) Synthetic situations in the internet of things. IFIP Advances in Information and Communication Technology Academic article 2015 Almklov, Petter; Monteiro, Eric. (2015) Entifisering og digitalisering av arbeid. Academic chapter/article/Conference paper Parmiggiani, Elena; Monteiro, Eric. (2015) The nested materiality of environmental monitoring. Scandinavian Journal of Information Systems (SJIS) Academic article Parmiggiani, Elena; Monteiro, Eric; Hepsø, Vidar. (2015) The Digital Coral: Infrastructuring Environmental Monitoring. Computer Supported Cooperative Work (CSCW) Academic article 2014 Monteiro, Eric; Pollock, Neil; Williams, Robin. (2014) Innovation in Information infrastructures: introduction to the special issue. Journal of the AIS Academic article 2013 Monteiro, Eric; Pollock, Neil; Hanseth, Ole; Williams, Robin. (2013) From artefacts to infrastructure. Computer Supported Cooperative Work (CSCW) Academic article Hamre, Gro Alice; Monteiro, Eric. (2013) Towards a Socio-technically Resilient Collaborative Medication Process. CEUR Workshop Proceedings Academic article Meum, Torbjørg; Ellingsen, Gunnar; Monteiro, Eric; Wangensteen, Gro; Igesund, Harald. (2013) The interplay between global standards and local practice in nursing. International Journal of Medical Informatics Academic article 2012 Fægri, Tor Erlend; Dingsøyr, Torgei",
  "content_length": 58057,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:14"
}