{
  "name": "Erickson R. Nascimento",
  "homepage": "http://homepages.dcc.ufmg.br/~erickson",
  "status": "success",
  "content": "Erickson R. Nascimento Erickson R. Nascimento bio teaching research publications collaborators Department of Computer Science at Federal University of Minas Gerais (UFMG), Brazil Member of the Computer Vision and Robotics (VeRLab) research group Supported by a CNPq research fellowship Google Scholar, CV Lattes (in Portuguese) [NEW] Paper accepted at IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) 2024 - XFeat: Accelerated Features for Lightweight Image Matching - Visit the GitHub project for code and data! [NEW] Paper accepted at Asian Conference on Computer Vision (ACCV) 2024 - Leveraging Semantic Cues from Large Vision Models for Enhanced Local Feature Correspondence [NEW] Paper accepted at IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) 2023 - Enhancing Deformable Local Features by Jointly Learning to Detect and Describe Keypoints [NEW] Paper accepted at IEEE Transactions on Pattern Analysis and Machine Intellignece (TPAMI) 2023 - Text-driven video acceleration: A weakly-supervised reinforment learning method [arXiv, DOI] [NEW] Paper accepted at British Machine Vision Conference (BMVC) 2022 - Semantic Segmentation under Adverse Conditions: A Weather and Nighttime-aware Synthetic Data-based [arXiv] [NEW] Paper accepted at Computer Vision and Image Understanding (CVIU) 2022 - Learning Geodesic-Aware Local Features from RGB-D Images [arXiv, DOI] [NEW] Paper accepted at WACV 2022 - Creating and reenacting controllable 3D Humans with differentiable rendering [NEW] Paper accepted at NeurIPS 2021 - Extracting Deformation-Aware Local Features by Learning to Deform - Visit the project page for code and data! [NEW] Paper accepted to the International Journal of Computer Vision (IJCV) - A Shape-Aware Retargeting Approach to Transfer Human Motion and Appearance in Monocular Videos - Visit the project page for more information! [NEW] Oustanding reviewer of CVPR 2021 [NEW] Paper accepted to ICRA 2021! - Anytime Fault-tolerant Adaptive Routing for Multi-Robot Teams [NEW] Paper accepted to IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) - A Sparse Sampling-based framework for Semantic Fast-Forward of First-Person Videos - Visit the project page for more information! Paper accepted to Computer & Graphics - Learning to dance: A graph convolutional adversarial network to generate realistic dance motions from audio - Visit the project page for more information! Paper accepted to CVPR 2020 - Straight to the Point: Fast-forwarding Videos via Reinforcement Learning Using Textual Data - Visit the project page for more information! Paper accepted to CVPR 2020 EPIC Workshop - A gaze driven fast-forward method for first-person videos - Visit the project page for more information! Two papers accepted to WACV 2020: Personalizing Fast-Forward Videos Based on Visual and Textual Features from Social Network - Visit the project page for more information! Do As I Do: Transferring Human Motion and Appearance between Monocular Videos with Spatial and Temporal Constraints - Visit the project page for more information! Paper accepted to ICCV 2019 - GEOBIT: A Geodesic-Based Binary Descriptor Invariant to Non-Rigid Deformations for RGB-D images: Visit the project page for more information! Paper accepted to WACV 2019 - Prototypicality effects in global semantic description of objects: Visit the project page for more information! Paper accepted to CVPR 2018 - A Weighted Sparse Sampling and Smoothing Frame Transition Approach for Semantic Fast-Forward First-Person Videos: Visit the project page for more information! Paper accepted to CVPR 2018 Sight and Sound Workshop - Fast forwarding Egocentric Videos by Listening and Watching: Visit the project page for more information! Guest Editor of the Special Issue on Feature representations for medical images and activity understanding - Journal of Visual Communication and Image Representationa (JVCI) Publication chair of ICAR 2019, Program Co-chair of SIBGRAPI 2017 Member of the program committee for: Senior Program Member for AAAI 2022, CVPR 2022, WACV 2022 ICCV 2021, AAAI 2021, WACV 2021, CVPR 2021, ICRA 2021, IROS 2021, SIBGRAPI 2021 CVPR 2020, ECCV 2020, ACCV 2020, WACV 2020, AAAI 2020, IJCAI 2020, ICRA 2020, IROS 2020, ICPR 2020, SIBGRAPI 2020 ICCV 2019, IJCAI 2019, Workshop on Applications of Egocentric Vision (EgoApp) at BMVC 2019, SIBRAPI 2019 AAAI 2018, IROS 2018, SIBRAPI 2018 IJCAI 2017, International Workshop of Egocentric Perception, Interaction and Computing at ICCV 2017. ICRA'14 and ICRA'15, IROS'14 and IROS'16, SIBGRAPI'16 Research areas Egocentric videos Multimodal learning Nonrigid descriptors Participating Media 3D Reconstruction and Modeling Image and Geometrical Descriptors How to find me erickson [at] dcc [dot] ufmg [dot] br Room 6318, DCC - ICEx - UFMG Phone (+55 31) 3409-7597",
  "content_length": 4860,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:20"
}