{
  "name": "Erik Fransén",
  "homepage": "https://www.kth.se/profile/erikf",
  "status": "success",
  "content": "KTH | Erik Fransén Skip to main content Erik FransénProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/erikfDetailsWorks for Division of Computational Science and TechnologyUnit address Lindstedtsvägen 5E-mail erikf@kth.seResearcherResearcher IDORCID IDAbout meI am a professor of Computer Science. I was a visiting professor at Edinburgh University, Centre for Clinical Brain Sciences. I lead research projects in Time-series Machine Learning, Computational Neuroscience and Computational Biology and I teach classes in Computational Biology and Machine Learning. Read about our research relating to the Nobel prize in Physics 2024. Read about our research relating to the Nobel prize in Physiology or Medicine 2021. Läs om vår forskning som relaterar till Nobelpriset i fysiologi eller medicin 2021 (in Swedish). Read about our recent publication in Science, A brain-wide atlas of synapses across the mouse lifespan. Read about our research relating to the Nobel prize in Physiology or Medicine 2014. Läs om vår forskning som relaterar till Nobelpriset i fysiologi eller medicin 2014 (in Swedish). CoursesAdvanced Individual Course in Computational Biology (DD2402), examiner, course responsibleDegree Project in Computer Science and Engineering, Second Cycle (DA239X), examinerDegree Project in Computer Science and Engineering, Second Cycle (DA250X), examinerDegree Project in Computer Science and Engineering, Second Cycle (DA231X), examinerDegree Project in Computer Science and Engineering, specialising in Embedded Systems, Second Cycle (DA248X), examinerDegree Project in Computer Science and Engineering, specializing in Industrial Management, Second Cycle (DA235X), examinerDegree Project in Computer Science and Engineering, specializing in Machine Learning, Second Cycle (DA233X), examinerDegree Project in Computer Science and Engineering, specializing in Systems, Control and Robotics, Second Cycle (DA236X), examinerDegree Project in Electrical Engineering, specializing in Information and Network Engineering, Second Cycle (EA260X), examinerIndividual Course in Computational Biology (FDD3451), examinerMathematical Modelling of Biological Systems (DD2435), course responsible, examinerPortfolioVideo interviews and discussionsLinksProjectsLab membersPublications in Google ScholarCVContact",
  "content_length": 2319,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:23"
}