{
  "name": "Erika Ábrahám",
  "homepage": "http://www-i2.informatik.rwth-aachen.de/i2/eab",
  "status": "success",
  "content": "Erika Abraham Old I2 pages » LuFG I2 » Fachgruppe Informatik » Bibliothek der Informatik » RWTH Aachen » Disclaimer » Prof. Dr. Erika ÁbrahámHead of the junior research group Theory of Hybrid Systems in the Computer Science Department at the RWTH Aachen University.E-mail    abraham at cs.rwth-aachen.dePhone   +49-241/80-21242Fax        +49-241/80-22243Postal address     RWTH Aachen University                               Informatik 2                                D-52056 Aachen                               GermanyVisiting address   Room 4229                               Ahornstraße 55                                52074 AachenResearch Interests My research interests include modeling, synthesis, and analysis of hybrid systems,decision procedures, SMT-solving,non-linear optimization,bounded model checking,analysis of probabilistic systems, counterexample generation.TeachingTheses and examsProjectsPublicationsSchool ActivitiesCurriculum VitaeUpcoming events 20th International Conference on Tools and Algorithms for the Construction and Analysis of Systems (TACAS'14) (co-chair) FORTE 2014: 34th IFIP International Conference on Formal Techniques for Distributed Objects, Components and Systems (co-chair) SFM-14:ESM 14th International School on Formal Methods for the Design of Computer, Communication and Software Systems: Executable Software Models (invited tutorial) 12th International Conference on Formal Modeling and Analysis of Timed Systems (FORMATS'14) (PC member)17th International Conference on Hybrid Systems: Computation and Control (HSCC'14) (PC member) BSc/MSc/Diploma TopicsTeaching WS 2012/13Hybrid Systems Group March 12, 2014We are looking for a HiWi for the Compiler Construction course. If you are interested, please contact Thomas Noll.Sept. 17, 2013Joost-Pieter Katoen has been appointed as a member of the renowned Academia Europaea (Academy of Europe), a European, non-governmental association acting as an Academy whose members are scientists and scholars who collectively aim to promote learning, education and research.July 15, 2013Vacancies for postdoctoral researchers in \"Automated Analysis of Probabilistic Programs\".  Application deadline: August 15, 2013. May 6, 2013Joost-Pieter Katoen has been awarded a Distinguished Professorship from the RWTH Aachen University. April 11, 2013The Hybrid Systems: Computation and Control (HSCC'13) conference in Philadelphia has been very successful: Hongfei Fu received the best student paper award for his paper \"Approximating acceptance probabilities of CTMC-paths on multi-clock deterministic timed automata\".  Besides, the paper by Ilya Tkachev, Alexandru Mereacre, Alessandro Abate and Joost-Pieter Katoen was ranked second in the overall best paper award selection. March 20, 2013Joost-Pieter Katoen has been elected as Steering Committee Chair of ETAPS (www.etaps.org), the largest conference on theory and practice of software in Europe.  He is the first non-UK ETAPS SC chair since the conference was initiated in 1998. More information here.February 6, 2013The Alumni-Magazine of RWTH Aachen University contains an interview with our former PhD student and postdoctoral researcher, Dr. Tingting Han.21 December, 2012HiWi's wanted to work in a new European Space Agency project for enhancing state-of-the-art design and analysis tools (COMPASS) for the next generation European rockets. Need programming and model checking affinity. See here for details and contact.  August 16, 2012We offer openings for several PhD candidates in the area of\"Model-Based Design and Analysis for Dependable Software Systems\".             Deadline for application: September 14, 2012. For further information click here.July 20, 2012The Theory of Hybrid Systems Group offers two jobs as student assistants within the CEBug project. For more information, look here.April 2, 2012Dino Distefano received the prestigious Roger Needham Award for his work on software verification. This award is for a distinguished research contribution in computer science by a UK based researcher who has completed up to 10 years of post-doctoral research. Dr. Distefano was the first PhD student supervised by Joost-Pieter Katoen.March 19, 2012Marijn Jongerden received the German MMB (Messung, Modellierung und Bewertung von Rechensystemen) Award 2012 of the GI/ITG-Committee for Measurement, Modelling and Evaluation of Computing Systems for his PhD-thesis on \"Model-based energy analysis of battery powered systems\". His work was supervised by Boudewijn Haverkort (Twente) and Joost-Pieter Katoen.March 1, 2012Our paper \"Formal Correctness, Safety, Dependability and Performance Analysis of a Satellite\" has been accepted to ICSE 2012 in the track SE in Practice (18% acceptance rate). The paper treats a new satellite from the European Space Agency that was modeled and analyzed with modern tools during the actual satellite design.January 27, 2012Joost-Pieter Katoen will act as DJ in the \"Nacht der Professoren\" in the Apollo bar and cinema. Older news",
  "content_length": 5019,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:31"
}