{
  "name": "Erik Saule",
  "homepage": "https://webpages.uncc.edu/~esaule/public-website/welcome.html",
  "status": "success",
  "content": "Welcome Erik Saule's Homepage Welcome Teaching Research Software Available Projects External Service Grants Contact CV Presentation I am an Associate Professor at the University of North Carolina at Charlotte in the department of Computer Science and I have been a faculty of UNC Charlotte since 2013. I used to hold a post doctoral researcher position at The Ohio State University in the BioMedical Informatics in Umit Catalyurek's High Performance Computing group. I did my PhD in Computer Science under the supervision of Denis Trystram as part of the MOAIS team at LIG laboratory in Grenoble (France). My PhD manuscript is entitled \"Approximation Algorithms for Multi-Objective Scheduling. Application to Parallel and Embedded Systems\" and is available (in french). I used to hold a teaching position (monitorat) at ENSIMAG. See my teaching page for more details. Positions I am currently looking for PhD students interested in any topics pertinent to my research. Though I am particular interested in student willing to work in graph algorithms, cluster computing, accelerators and middleware for HPC. Ideal candidate will have strong background in algorithms and system programming. Contact me if interested. I am currently looking for undergraduate students interested in any topics pertinent to my research. Though I am particular interested in student interested in graph analysis, systems, and high performance computing. Contact me if interested. Projects available I am interested in advising students (undergraduate and graduate) on various projects. Check out the available projects for details. News Our paper \"Experiences on Teaching Parallel and Distributed Computing for Undergraduates\" was recognized as the Best Paper at the EduPar 18 workshop colocated with IPDPS 2018 I was interviewed by Dawn Anderson (State of Digital) about my ECIR 2018 work An article about my involvement with SC17 On being part of an NSF Award to Improve Retention and Engagement for Students On being awarded an NSF CAREER NCDS Data Fellow interview NCDS 2015 Data Fellows are named",
  "content_length": 2079,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:26"
}