{
  "name": "Erik Jan van Leeuwen",
  "homepage": "http://www.erikjanvl.nl",
  "status": "success",
  "content": "Homepage of Erik Jan van Leeuwen Homepage of Erik Jan van Leeuwen Assistant Professor at Utrecht University, The Netherlands Home / Contact Publications CV Essentials Browse my publications and curriculum vitae. My main research interests are: graph algorithms, parameterized algorithms, computational complexity, approximation algorithms, computational geometry, network science, graph neural networks. Recently (last updated: November 2025) Participated in the UU outreach program Talks around town and spoke to visitors of the Utrecht public library about my research. Paper accepted to ACM Transactions on Algorithms: Planar Multiway Cut with Terminals On Few Faces, with Sukanya Pandey. Program committee co-chair for IPEC 2025. Program committee member for STOC 2026. Became Chair of the IPEC Steering Committee. Paper accepted at ICAIF 2025: LAS-GNN: A Graph Neural Network for Temporal Money Laundering Motif Detection, with Stan Verlaan and Ioana Hulpuș. Poster accepted to Netsci 2025: When do Faster Algorithms to Computer Network Diameter Exist?. Invited speaker at SOFSEM 2025. Invited paper in the proceedings on Open Problems and Recent Developments on a Complexity Framework for Forbidden Subgraphs. Contact E-mail:e.j.vanleeuwen@uu.nl Mail address:Utrecht UniversityDept. Inform. & Comput. SciencesBuys-Ballot building K 4.71Winthontlaan 30C3526 KV UtrechtThe Netherlands Visiting address:Room 4.71Buys Ballot buildingPrincetonplein 53584 CC UtrechtThe Netherlands Telephone:+31 30 253 54 32 Publications A list of my publications can be found below. Some of them can also be found through DBLP. I also have a page at Google Scholar. Journal papers T: Planar Multiway Cut with Terminals On Few Faces A: Pandey, S., van Leeuwen, E.J. P: ACM Transactions on Algorithms to appear T: Complexity Framework for Forbidden Subgraphs I: The Framework A: Johnson, M., Martin, B., Oostveen, J.J., Pandey, S., Paulusma, D., Smith, S., van Leeuwen, E.J. P: Algorithmica 87:3 (2025), pp. 429-464. Paper @ Springer T: The Parameterized Complexity of the Survivable Network Design Problem A: Feldmann, A.E., Mukherjee, A., van Leeuwen, E.J. P: Journal of Computer and System Sciences 148 (2025), pp. 103604. Paper @ Elsevier T: Computing Subset Vertex Covers in H-free Graphs A: Brettell, N., Oostveen, J.J., Pandey, S., Paulusma, D., Rauch, J., van Leeuwen, E.J. P: Theoretical Computer Science 1032 (2025), pp. 115088. Paper @ Elsevier T: Parameterized Complexity of Streaming Diameter and Connectivity Problems A: Oostveen, J.J., van Leeuwen, E.J. P: Algorithmica 86:9 (2024), pp. 2885-2928. Paper @ Springer T: Streaming Deletion Problems Parameterized by Vertex Cover A: Oostveen, J.J., van Leeuwen, E.J. P: Theoretical Computer Science 979 (2023), pp. 114178. Paper @ Elsevier T: Few Induced Disjoint Paths for H-free Graphs A: Martin, B., Paulusma, D., Smith, S., van Leeuwen, E.J. P: Theoretical Computer Science 939 (2023), pp. 182--193. Paper @ Elsevier T: Induced Disjoint Paths and Connected Subgraphs for H-Free Graphs A: Martin, B., Paulusma, D., Smith, S., van Leeuwen, E.J. P: Algorithmica 85:9 (2023), pp. 2580-2604. Paper @ Springer T: Upper Bounding Rainbow Connection Number by Forest Number A: Chandran, L.S., Issac, D., Lauri, J., van Leeuwen, E.J. P: Discrete Mathematics 345:7 (2022), pp. 112829. Paper @ Elsevier T: Induced Disjoint Paths in AT-free graphs A: Golovach, P.A., Paulusma, D., van Leeuwen, E.J. P: Journal of Computing and System Sciences 124 (2022), pp. 170-191. Paper @ Elsevier T: Disjoint paths and connected subgraphs for H-free graphs A: Kern, W., Martin, B., Paulusma, D., Smith, S., van Leeuwen, E.J. P: Theoretical Computer Science 898 (2022), pp. 59-68. Paper @ Elsevier T: A Deterministic Polynomial Kernel for Odd Cycle Transversal and Vertex Multiway Cut in Planar Graphs A: Jansen, B.M.P., Pilipczuk, M., van Leeuwen, E.J. P: SIAM Journal on Discrete Mathematics 35:4 (2021), pp. 2387-2429. Paper @ SIAM T: Algorithms for the rainbow vertex coloring problem on graph classes A: Lima, P.T., van Leeuwen, E.J., van der Wegen, M. P: Theoretical Computer Science 887 (2021), pp. 122-142. Paper @ Elsevier T: Subexponential-time algorithms for finding large induced sparse subgraphs A: Novotna, J., Okrasa, K., Pilipczuk, Mi., Rzazewski, P., van Leeuwen, E.J., Walczak, B. P: Algorithmica 83:8 (2021), pp. 2634--2650. Paper @ Springer T: Steiner Trees for Hereditary Graph Classes: A treewidth perspective A: Bodlaender, H.L., Brettell, N., Johnson, M., Paesani, G., Paulusma, D., van Leeuwen, E.J. P: Theoretical Computer Science 867 (2021), pp. 30--39. Paper @ Elsevier T: Ocean Surface Connectivity in the Arctic: Capabilities and Caveats of Community Detection in Lagrangian Flow Networks A: Reijnders, D., van Leeuwen, E.J., van Sebille, E. P: Journal of Geophysical Research: Oceans 126:1 (2020), pp. 1--24. Paper @ Wiley T: Quasi-polynomial time approximation schemes for packing and covering problems in planar graphs A: Pilipczuk, Mi., van Leeuwen, E.J., Wiese, A. P: Algorithmica 82:6 (2020), pp. 1703--1739. Paper @ Springer T: Disconnected cuts in claw-free graphs A: Martin, B., Paulusma, D., van Leeuwen, E.J. P: Journal of Computer and System Sciences 113 (2020), pp. 60--75. Paper @ Elsevier T: Solving Partition Problems Almost Always Requires Pushing Many Vertices Around A: Kanj, I., Komusiewicz, C., Sorge, M., van Leeuwen, E.J. P: SIAM Journal on Discrete Mathematics 34:1 (2020), pp. 640--681. Paper @ SIAM T: Nearly ETH-Tight Algorithms for Planar Steiner Tree with Terminals on Few Faces A: Kisfaludi-Bak, S., Nederlof, J., van Leeuwen, E.J. P: ACM Transactions on Algorithms 16:3 (2020), pp. 28:1--28:30. Paper @ ACM T: Nearly ETH-Tight Algorithms for Planar Steiner Tree with Terminals on Few Faces A: Kisfaludi-Bak, S., Nederlof, J., van Leeuwen, E.J. P: ACM Transactions on Algorithms 16:3 (2020), pp. 28:1--28:30. Paper @ ACM T: Complexity of independency and cliquy trees A: Casel, K., Dreier, J., Fernau, H., Gobbert, M., Kuinke, P., Sanchez Villaamil, F., Schmid, M.L., van Leeuwen, E.J. P: Discrete Applied Mathematics 272 (2020), pp. 2--15. Paper @ Elsevier T: Domination When the Stars Are Out A: Hermelin, D., Mnich, M., van Leeuwen, E.J., Woeginger, G.J. P: ACM Transactions on Algorithms 15:2 (2019), pp. 25:1--25:90. Paper @ ACM T: Subexponential-Time Algorithms for Maximum Independent Set in Pt-Free and Broom-Free Graphs A: Basco, G., Lokshtanov, D., Marx, D., Pilipczuk, M., Tuza, Z., van Leeuwen, E.J. P: Algorithmica 81:2 (2019), pp. 421--438. Paper @ Springer T: Network Sparsification for Steiner Problems on Planar and Bounded-Genus Graphs A: Pilipczuk, M., Pilipczuk, Mi., Sankowski, P., van Leeuwen, E.J. P: ACM Transactions on Algorithms 14:4 (2018), pp. 53:1--53:73. Paper @ ACM T: Independence and Efficient Domination on P6-free Graphs A: Lokshtanov, D., Pilipczuk, M., van Leeuwen, E.J. P: ACM Transactions on Algorithms 14:1 (2018), pp. 3:1--3:30. Paper @ ACM T: Parameterized Algorithms for Recognizing Monopolar and 2-Subcolorable Graphs A: Kanj, I., Komusiewicz, C., Sorge, M., van Leeuwen, E.J. P: Journal of Computer and Systems Sciences 92 (2018), pp. 22--47. Paper @ Sciencedirect T: Polynomial Kernels for Deletion to Classes of Acyclic Digraphs A: Mnich, M., van Leeuwen, E.J. P: Discrete Optimization 25 (2017), pp. 48--76. Paper @ Sciencedirect T: Shortcutting Directed and Undirected Networks with a Degree Constraint A: Tan, R.B., van Leeuwen, E.J., van Leeuwen, J. P: Discrete Applied Mathematics 220 (2017), pp. 91--117. Paper @ Elsevier T: Complexity of Metric Dimension on Planar Graphs A: Diaz, J., Pottonen, O., Serna, M., van Leeuwen, E.J. P: Journal of Computer and System Sciences 83:1 (2017), pp. 132-158. Paper @ Elsevier T: Induced Disjoint Paths in Circular-Arc Graphs in Linear Time A: Golovach, P.A., Paulusma, D., van Leeuwen, E.J. P: Theoretical Computer Science 640 (2016), pp 70-83. Paper @ Elsevier T: Polynomial kernelization for removing induced claws and diamonds A: Cygan, M., Pilipczuk, M., Pilipczuk, M., van Leeuwen, E.J., Wrochna, M. P: Theory of Computing Systems 60:4 (2016), pp. 615-636. Paper @ Springer T: Parameterized Complexity Dichotomy for Steiner Multicut A: Bringmann, K., Hermelin, D., Mnich, M., van Leeuwen, E.J. P: Journal of Computer and System Sciences 82:6 (2016), pp. 1020-1043. Paper @ Elsevier T: The Firefighter Problem on Graph Classes A: Fomin, F.V., Heggernes, P., van Leeuwen, E.J. P: Theoretical Computer Science 613 (2016), pp. 38-50. Paper @ Elsevier T: Finding Disjoint Paths in Split Graphs A: Heggernes, P., Hof, P. van 't, Saei, R., van Leeuwen, E.J. P: Theory of Computing Systems 57:1 (2015), pp. 140-159. Paper @ Springer T: Induced Disjoint Paths in Claw-Free Graphs A: Golovach, P.A., Paulusma, D., van Leeuwen, E.J. P: SIAM Journal on Discrete Mathematics 29:1 (2015), pp. 348-375. Paper @ SIAM T: Algorithms for Diversity and Clustering in Social Networks through Dot Product Graphs A: Johnson, M., Paulusma, D., van Leeuwen, E.J. P: Social Networks 41 (2015), pp. 48-55. Paper @ Sciencedirect T: Parameterized Complexity of Induced Graph Matching on Claw-Free Graphs A: Hermelin, D., Mnich, M., van Leeuwen, E.J. P: Algorithmica 70:3 (2014), pp. 513--560, Special Issue for ESA 2012. Paper @ Springer Paper @ arXiv T: Parameterized Complexity of Firefighting A: Bazgan, C., Chopin, M., Cygan, M., Fellows, M.R., Fomin, F.V., van Leeuwen, E.J. P: Journal of Computer and System Sciences 80:7 (2014), pp. 1285-1297. Paper @ Elsevier T: Integer Representations of Convex Polygon Intersection Graphs A: Müller, T.M., van Leeuwen, E.J., van Leeuwen, J. P: SIAM Journal on Discrete Mathematics 27:1 (2013), pp.  205-231. Paper @ SIAM T: Structure of Polynomial-Time Approximation A: van Leeuwen, E.J., van Leeuwen, J. P: Theory of Computing Systems 50:4 (2012), pp. 641-674. Paper @ Springerlink Tech Rep @ UU T: Parameterized Complexity of the Spanning Tree Congestion Problem A: Bodlaender, H.L., Fomin, F.V., Golovac",
  "content_length": 41739,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:22"
}