{
  "name": "Erik Grönvall",
  "homepage": "https://pure.itu.dk/portal/en/persons/erik-groenvall(1e0534b4-fe3e-4c5e-ad6d-5f1c7df6a14e).html",
  "status": "success",
  "content": "Erik Grönvall - IT-University of Copenhagen Erik Grönvall Associate Professor, Human-Computer Interaction and Design https://orcid.org/0000-0002-7377-6091 Emailerigitudk 20112024 Research activity per year Personal profile CurriculumErik is Associate Professor at the Digital Design department, ITU and since 2021 Head of the Co-design Research Group. Erik’s research is situated within the HCI and CSCW research domains, is often Participatory Design/Co-design driven and may contain electrical or otherwise interactive prototypes that Erik design and build.Erik researches the role technology has in everyday life, the notion of participation, how people appropriate technology and how technology can be designed to better align with the capabilities and needs of diverse users and/or organizations. To investigate these and other aspects of technology use in everyday life, Erik has worked with for example Participatory Design in weak, ill peoples’ homes, PD as a tool for organizational change, Service Design, Care networks, Tele-care and homecare. Erik also engages in technology explorations from an Interaction Design perspective to explore how humans react and relate to (now) technology.Erik has managed several national and international projects (incl. partners from both academia and industry).Erik currently teach Co-Design and Physical Computing at ITU where he previously also taught courses in for example Service Design and Python Programming. KeywordsCo-designCSCWElectronicsHCI: human-computer interactionHealthcareInteraction designInteractive installationsParticipationParticipatory designPhysical computingPrototypingService designshape-changing interfacesTangible interactionWearable computers Fingerprint Dive into the research topics where Erik Grönvall is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Participatory Design Computer Science 100% Infrastructuring Keyphrases 32% Digitization Computer Science 30% Healthcare Keyphrases 30% Cross-organization Keyphrases 25% Design Research Computer Science 25% Case Study Computer Science 23% Service Design Computer Science 23% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2011 2014 2015 2016 2017 2018 2022 2024 29 Article in proceedings 9 Journal article 4 Book chapter 2 Paper 3 More 2 Editorial 1 Conference article Research output per year Research output per year Designing for and with the ‘Digital Citizen’. In Companion Publication of the 2024 ACM Designing Interactive Systems Conference (DIS '24 Companion). Association for Computing Machinery, New York, NY, USA, 467–469. https://doi.org/10.1145/3656156.3658383Kirk, D., Boztepe, S., Christiansson, J., Götzen, A. D., Ehrenberg, N., Grönvall, E., Lawson, S., Linde, P., Saad-Sulonen, J. & Vlachokyriakos, V., 1 Jul 2024, Companion Publication of the 2024 ACM Designing Interactive Systems Conference (DIS '24 Companion). Association for Computing Machinery, p. 467-469 3 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Digital Service 100% Participatory Design 100% Interactive System 100% Shared Resource 100% Internal Service 100% Mapping User Participation in the Design of Digital Public Services: Is PD Relevant?Christiansson, J., Grönvall, E. & Saad-Sulonen, J., Aug 2024, Proceedings of the Participatory Design Conference 2024. New York, NY, United States: Association for Computing Machinery, Vol. 1. Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access User Participation 100% Digital Public Services 100% Public Sector Design 100% Public Sector 100% Public Utilities 100% MusicalAid: A Playful Collaborative Music Tool for People Finding it Difficult to Handle Common InstrumentsGrönvall, E., 11 Feb 2024, TEI '24: Proceedings of the Eighteenth International Conference on Tangible, Embedded, and Embodied Interaction. Association for Computing Machinery, p. 1-6 6 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile People Finding 100% Fine Motorics 100% Collaborative music 100% Collaborative 100% Rhythm 100% Designing the City: Challenges and Opportunities in Digital Public Service DesignBoztepe, S., Glöss, M., Grönvall, E., Christiansson, J. & Linde, P., 29 May 2023, C&T '23: Proceedings of the 11th International Conference on Communities and Technologies: Humanization of Digital Technologies. Association for Computing Machinery, p. 266-269 4 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review File Digital Technology 100% Digital Public Services 100% Public Service Design 100% Service Design 100% Digitization 100% Emergent Collaborations Outside of Organizational Frameworks: Exploring Relevant ConceptsAbou Amsha, K., Grönvall, E. & Saad-Sulonen, J., 29 May 2023, C&T '23: Proceedings of the 11th International Conference on Communities and Technologies. Association for Computing Machinery, p. 163-173 11 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review File Emergent Collaboration 100% Organizational Framework 100% Digitization 100% Activity Theory 100% Educational Psychology 100% View all 47 research outputs Projects Projects per year 2014 2017 2020 2027 2 Active 10 Finished Projects per year CAPE: Civic Agency in Public E-service innovationChristiansson, J. (PI), Saad-Sulonen, J. (CoI), Grönvall, E. (CoI) & Christensen, C. V. (CoI)NordForsk01/10/2020 → 31/12/2023Project: Research File Public Libraries 100% Public Utilities 89% Digital Service 88% Civics 84% Digital Public Services 78% FutureCare: Kvalitativ omsorg i en föränderlig världGrönvall, E. (PI)Linköping Municipality01/05/2020 → 30/04/2021Project: Other In Care 100% COVID-19 100% Healthcare Organizations 100% Coronavirus Disease (COVID) 100% Care Manager 100% CoSoCa: Co-designing social care innovationsGrönvall, E. (PI)Linköping Municipality01/01/2021 → 31/03/2022Project: Other ICT System 100% Design Support 100% Social Care 100% Healthcare Innovation 100% Design Challenges 100% Give&Take: Designing a reciprocal exchange service for a good and engaged senior lifeMalmborg, L. (PI), Sokoler, T. (CoI), Borsotti, V. (CoI), Svanæs, D. (CoI), Grönvall, E. (CoI) & Yndigegn, S. L. (CoI)Innovation Fund Denmark01/05/2014 → 30/04/2017Project: Research Participatory Design 100% Everyday Practice 80% Local Community 51% Senior Citizens 49% Sharing Community 42% Room4Care: Room4CareGrönvall, E. (PI)Danish Agency for Higher Education and Science04/03/2015 → 21/04/2015Project: Research EC Project 100% Project Application 100% Rural Healthcare 100% Healthcare Scenarios 100% View all 12 projects Press/Media Prisnomineret ITU-projekt sikrer effektiv vidensdeling i pleje- og socialsektorenGrönvall, E.12/10/20231 item of Media coveragePress/Media: Press / Media Forskere undersøger digitalisering af omsorgspraksisserFritsch, J., Vallgårda, A., Grönvall, E. & Yndigegn, S. L.28/06/20231 Media contributionPress/Media: Press / Media ' Creepy' maskine giver fysisk ubehag når dine data bliver lækket på netteShklovski, I. & Grönvall, E.22/04/20181 Media contributionPress/Media: Press / Media Digital inspiration til kommunens medarbejdereGronvall, E.18/10/20162 items of Media coveragePress/Media: Press / Media Kommunen arbejder på tværs om digitaliseringGronvall, E.11/10/20161 item of Media coveragePress/Media: Press / Media View all 7 press/media Prizes European Social Services Awards 2023Grönvall, E. (Recipient), 16 Nov 2023Prize: Prizes, scholarships, distinctions Social Workers 100% Social Services 100% Knowledge Platform 100% Workforce Support 100% Knowledge Sharing 100% Activities Activities per year 2014 2014 2024 2024 2 Editor of Research journal 1 Membership in review committee Activities per year Hiring committee for recruitment of assistant/associate professor in Creative Computing (Event)Fritsch, J. (Chair), Yndigegn, S. L. (Member) & Grönvall, E. (Member)Feb 2024 → Jun 2024Activity: Membership types › Membership in review committee Interaction Design and Architecture(s) (Journal)Gronvall, E. (Editor)1 Oct 2014 → 1 Jun 2015Activity: Publication peer-review and editorial work types › Editor of Research journal › Research Personal and Ubiquitous Computing (Journal)Gronvall, E. (Editor)1 Nov 2014 → 30 Dec 2015Activity: Publication peer-review and editorial work types › Editor of Research journal › Research",
  "content_length": 9035,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:23"
}