{
  "name": "Erik D. Demaine",
  "homepage": "http://erikdemaine.org",
  "status": "success",
  "content": "Erik Demaine Erik Demaine Professor • Computer Scientist • Mathematician • Artist • MIT • EECS • CSAIL • TOC • Algorithms Upcoming Events: Exhibitions, Film Showings, Talks Classes Above: 6.849: Geometric Folding Algorithms: Linkages, Origami, Polyhedra, which has freely available video lectures. Papers & Books Above: Books Geometric Folding Algorithms, Games, Puzzles, & Computation, Tribute to a Mathemagician, and A Lifetime of Puzzles. Curved-Crease Sculpture Above: Close-up of “Destructors IV” by Erik and Martin Demaine, folding printed text along curved creases. Curved-Crease Sculpture Above: A large “Curved Crease Sculpture” by Erik and Martin Demaine, on display at Guided By Invoices in Chelsea, New York. Curved-Crease Sculpture Above: “Computational Origami” by Erik and Martin Demaine, part of the Museum of Modern Art permanent collection. Film & Video Above: “Lino Tagliapietra: Glass Magician”, a 13-minute film co-directed by Erik and Martin Demaine. Now streaming free in the USA! Mathematical Fonts/Typefaces Above: “FONT” written in our linkage font, glass squishing font, and conveyer belt font. Prints Above: “Yes/No” (2011), an inked crease pattern that folds simultaneously into a 3D “YES” and a 2D “NO”. Media Appearances Above: Between The Folds, one of two documentaries Erik appears in. Puzzles Above: CSAIL Semi-Annual Meeting Spring 2010 Puzzle, a folding puzzle you can print and try. Software Above: Virtual Glass enables computer-aided design of blown glass, specifically glass cane. Fold & Cut Above: Butterfly made by folding and one complete straight cut. Curriculum Vitæ Last updated December 28, 2024. See also artist CV, last updated on October 24, 2025. About Erik Academic family (co-authors, students, and ancestors) Short biography Research interests Personal details Contact [photo by Martin Demaine] [photo by Donna Coveney] [photo by Martin Demaine] [photo by Stefan Langerman] Name: Erik D. Demaine Email: edemaine@mit.edu URL: http://erikdemaine.org/ Public key: PGP Work number: (+1) 617-253-6871 Fax number: (+1) 617-258-8682 MIT office: 32-G680 (near Kendall/MIT Station on the Boston Subway (MBTA) red line) Assistant: Pepe Abola (32-G568, 617-253-3037, josea525 at mit.edu) Mailing address: Erik Demaine MIT Computer Science and Artificial Intelligence Laboratory 32 Vassar Street Cambridge, Massachusetts 02139 USA Last updated January 23, 2024 by Erik Demaine. — Accessibility",
  "content_length": 2436,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:21"
}