{
  "name": "Erika A. Leal",
  "homepage": "https://sites.baylor.edu/erika_leal",
  "status": "success",
  "content": "Hello World! Skip to content Hello and welcome to my page. I am Dr. Erika Leal, an assistant professor at Baylor University. I also serve as the Director of Research and Development for the Central Texas Cyber Range. My research specializes in cybersecurity, focusing on hardware-assisted software security analysis, malware analysis, and high-performance computing security. I earned my Ph.D. in Computer Science with a specialization in Software and Systems Security from Tulane University under the guidance of Dr. Jiang Ming, and I hold a Bachelor’s degree in Computer Science with a minor in Business Administration from Texas Wesleyan University. At Baylor University, I not only teach courses in cybersecurity, but I am advisor of the Cyber@Baylor club and coach to their competitive team. LinkedIn News I was featured in my undergrad alumni news Texas Wesleyan Grad Leads Cybersecurity Innovation at Baylor Publications Low-entropy Packed Binary Detection via Accurate Hardware Events Profiling, In the proceedings of the IEEE International Symposium on Hardware Oriented Security and Trust (HOST), May 5-8, 2025 Leveraging Hardware Performance Counters for Efficient Classification of Binary Packers, In the proceedings of the 22nd International Conference on Trust, Security, and Privacy in Computing and Communications (TrustCom), Oct 1, 2023 On the Feasibility of Malware Unpacking vis Hardware-Assissted Loop Profiling, In the Proceedings of the 23rd USENIX Security Symposium, August 9, 2023 Assessing Risk in High Performance Computing Attacks, In the Proceedings of the 9th International Conference on Information Systems Security & Privacy (ICISSP 2023), February 22, 2023 Obfuscation-Resilient Executable Payload Extraction From Packed Malware, In Proceedings of the 30th USENIX Security Symposium, April 1, 2021 Current Ph.D. Students Abanisenioluwa Orojo Academic Service Hardware Demonstration Judge, IEEE International Symposium on Hardware Oriented Security and Trust 2025 Coach for Baylor Cybersecurity Team for CCDC (National Collegiate Cyber Defense Competition) & NCL (National Cyber League), Current Technical Program Committee Member for the International Conference for High Performance Computing, Networking Storage and Analysis 2023, 2024 Session Chair for Information Systems Security and Privacy ICISSP, 2023 Diversity Chair for the International Conference for High Performance Computing, Networking Storage and Analysis, 2022 Cybersecurity President at University of Texas at Arlington, 2020 External Reviewer for ACM Computing Surveys, 2021 External Reviewer in ACM Conference on Computer and Communication Security (CSS) 2019, 2020 External Reviewer in International Conference on Information and Communications Security (ICICS) 2019-2021 Contact Me erika_leal[at]baylor[dot]edu Cashion 302, Baylor University Waco TX",
  "content_length": 2855,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:31"
}