{
  "name": "Erik Poll",
  "homepage": "http://www.cs.ru.nl/E.Poll",
  "status": "success",
  "content": "Erik Poll Homepage of Erik Poll I am associate professor in the Digital Security (DiS) research group of ICIS, the Institute for Computing and Information Science, at the Faculty of Science of Radboud University. Address and contact information (photo by Sjoerd van der Hucht) Research My papers, and also reachable via Google scholar and the Radboud University Repository Slides of some talks and pointers to media attention. My core research interest is software security. Most cybersecurity problems originate in software and my research aims to improve security in software engineering through the use of formal methods and, more generally, rigorous and systematic approaches in software engineering such as formal specification and verification, type systems, model-based testing, fuzzing, protocol state fuzzing and the LangSec approach to secure input handling. Case studies in using formal methods for security include EMV, TLS, SSH and internet banking. In more applied security and privacy research I have investigated smartcards, RFID tags, TEEs, payment cards, e-passports, Android key storage, EU digital identity wallets, the MIME standard for email attachments, the OPC-UA standard for industrial systems, smart grids (including smart meters and EV charging), automotive systems and the use of AI in education. Earlier I worked on program specification and verification for Java and Java Card and the design of the formal specification language JML. Research into Java Card in our group resulted in some open-source smartcard software and RFID tools. Some outliers, topic-wise: with Tommy Koens I wrote some papers analysing the (almost invariably flawed) reasons for thinking that blockchain might be a sensible solution for anything and my former PhD student Alex Serban looked at adversarial attacks on AI systems. My current PhD students are Seyed Benham Andarzian, Cristian Daniele, Job Doesburg, Patrick Lodeweegs and Faiz Muhammad. Teaching Web Security (IPC026) Software Security (ISOFSE) - for this course I created lecture notes on Language-Based Security and Secure Input Handling and some demo webpages to ilustrate to complexity of encoding and sanitising data in web applications. Security Protocol Project (IMC066) The master courses I teach are part of the Cyber Security, Cyber Security and AI, and Software Science specialisations in our Computing Science Master. The bachelor courses are part of the cybersecurity track in our Computing Science Bachelor. Other teaching-related stuff: Our local CTF student team, also on Discord. NymaCon, aka HackNijmegen Topics for research internships and thesis projects. Before handing in any draft versions of a thesis or internship report, check my writing checklist Onderwijsmateriaal over cybersecurity voor middelbare scholen (in Dutch) Introductory exercises using Uppaal: model checking for dummies Exercises using JML and ESC/Java2 Organisation and projects I am confidential contact person for PhD students at ICIS. For ACCSS our group hosts the ACCSS mailing list and I maintain the ACCSS announcements on Mastodon. Secure Software Development (SSD) group of CIP-overheid Challenge the Cyber, the foundation that organises the national Dutch CTF as qualifier for the annual European Cyber Security Challenge OWASP Netherlands, the Dutch chapter of OWASP (Open Web Application Security Project) I co-authored the Dutch National Cyber Security Research Agenda (NSCRA III) Thema center Security of Next Generation Infrastructure Conferences, workshops and other events LangSec workshop at IEEE Security & Privacy AFFECT.NL workshop on Automated Finding, Fixing or Exploiting of seCuriTy vulnerabilities, by INTERSECT and the ACCSS working group on Software Security Workshop on Analysis of Network Protocols, Paris, Sept 2024 Fuse5G, the Forum for Uniting Security Experts in 5G INTERSCT conference on Cyber Security for Internet-of-Things I used to organise the FTfJP (Formal Techniques for Java-like Programs) workshop. The workshop is still going strong but I'm no longer involved since 2016. Projects Find2Fix, funded by NWO in KIC Digital Resilience programme, 2025-2029 NOLAI (Nationaal Onderwijslab AI), funded by National Growth Fund, 2022-2032 INTERSECT (Internet of Secure Things), funded by NWO as part of NWA (Nationale WetenschapsAgenda), 2020-2028 iCAVE (Integrated cooperative automated vehicles), 2017-2021, Perspectief project funded by NWO TTW Charge & Go, 2017-2021, funded by EFRO Betuwse Energie Samenwerking, 2017-2021, funded by EFRO",
  "content_length": 4535,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:25"
}