{
  "name": "Erkay Savas",
  "homepage": "http://people.sabanciuniv.edu/~erkays",
  "status": "success",
  "content": "Erkay Savas Erkay SAVAS Teaching News! Publications Weekly Schedule Research Useful Links Bio Resume Personals Erkay Savas, Faculty of Engineering and Natural Science Sabancı University 34956 Orhanlı-Tuzla, Istanbul, Turkey erkays@sabanciuniv.edu http://people.sabanciuniv.edu/erkays Voice: +90 (216) 483 9606 Fax:    +90 (216) 483 9550 skype: erkay Education Ph.D. Electrical and Computer Engineering, Oregon State University, USA (2000) B.S. (1990) and M.S. (1994) degrees in Electrical Engineering from the Electronics and Communications Engineering Department at Istanbul Technical University Teaching CS 303 Logic and Digital System Design: Fall 2004, Fall 2005, Fall 2006, Fall 2007, Fall 2008, Fall 2009, Fall 2010, Fall 2011, Fall 2012, Fall 2013, Fall 2014, Fall 2015, Fall 2019 CS 401 Computer Architectures: Fall 2002, Fall 2003, Spring 2005, Spring 2006, Spring 2008, Spring 2012, Spring 2013, Spring 2014, Spring 2015, Spring 2016 CS 403/534 Distributed Systems: Spring 2003, Spring 2004, Spring 2006, Spring 2007, Spring 2011, Spring 2012, Spring 2014, Spring 2016, Spring 2018, Spring 2019, Spring 2020 CS 411/507 Cryptography: Fall 2002, Fall 2004, Fall 2006, Fall 2008, Fall 2009, Fall 2010, Fall 2012, Fall 2014, Fall 2015, Fall 2017, Fall 2018, Fall 2019, Fall 2020, Fall 2021 CS 517 Advanced Cryptography and Data Security: Fall 2007, Spring 2011, Spring 2013, Spring 2015, Spring 2018, Spring 2019, Spring 2021 EL 310 Hardware Description Languages: Fall 2003 CS 680: Special Topics in Computer Science I -Wireless Ad Hoc Net Security: Fall 2003 Lise Yaz Okulu Bilgisayar Programlama ve Veri Analizine Giris Dersi : Yaz 2019 Analizine Giris Dersi : Yaz 2019 Selected Publications 1. E. Savaş, K. Yumbul, “Enhancing an Embedded Processor Core for Efficient and Isolated Execution of Cryptographic Algorithms”, to appear at Oxford University Press, The Computer Journal, (2014). on line doi: 10.1093/comjnl/bxu040. 2. C. Örencik, E. Savaş, “An efficient privacy-preserving multi-keyword search over encrypted cloud data with ranking”, Distributed and Parallel Databases 32(1): 119-160 (2014). 3. K. Yumbul, S. S. Erdem, E. Savaş: On Selection of Modulus of Quadratic Codes for the Protection of Cryptographic Operations against Fault Attacks. IEEE Trans. Computers 63(5): 1182-1196 (2014). 4. Kazim Yumbul, Erkay Savaş, Övünç Kocabaş, Johann Großschädl: Design and implementation of a versatile cryptographic unit for RISC processors. Security and Communication Networks 7(1): 36-52 (2014). 5. C. Yıldızlı, T. B. Pedersen, Y. Saygın, E. Savaş and A. Levi, \"Distributed privacy preserving clustering via homomorphic secret sharing and its application to (vertically) partitioned spatio-temporal data\", International Journal of Data Warehousing and Mining, Vol.7, No.1, January 2011, 46-66 6. E. Savaş and Ç. K. Koç, \"Finite field arithmetic for cryptography\", IEEE Circuits and Systems Magazine, Vol.10, No.2 2010, 40-56 S 7. T. B. Pedersen and E. Savaş, “Impossibility of unconditionally secure scalar products”, Data & Knowledge Engineering, Elsevier, 68(2009), pp 1059-1070, October 2009. 8. A. O. Durahim, E. Savaş, B. Sunar, T. B. Pedersen, and Ö. Kocabaş, “Transparent code authentication at the processor level”, IET Computers and Digital Techniques, 3(4): 354-372, July 2009. 9. E. Öztürk, B. Sunar and E. Savaş, “A versatile Montgomery multiplier architecture with characteristic three support”, Computers & Electrical Engineering, Elsevier, vol. 35(1): 71-85, January 2009. 10. S. V. Kaya, E. Savaş, A. Levi, and Ö. Erçetin \"Public key cryptography based privacy preserving multi-context RFID infrastructure\", Ad Hoc Networks (Elsevier), vol. 7, no. 1, January 2009, pp. 136 - 152. 11. G. Gaubatz, E. Savas, and B. Sunar, “Sequential Circuit Design for Embedded Cryptographic Applications Resilient to Adversarial Faults”, IEEE Transactions on Computers, 57(1):126-138, January 2008. 12. A. Inan, S. V. Kaya, Y. Saygin, E. Savas, A. A. Hintoglu, A. Levi. “Privacy Preserving Clustering On Horizontally Partitioned Data”. Data and Knowledge Engineering Journal, 63(3): 622-645, December 2007. 13. E. Savas, “A Carry-Free Architecture for Montgomery Inversion”, IEEE Transactions on Computers, IEEE Transactions on Computers, 54(12): 1508-1519, December 2005. 14. E. Savas. M. Naseer, A. A-A. Gutub, and Ç. K. Koç, “Efficient Unified Montgomery Inversion with Multibit Shifting”, IEE Proceedings – Computers and Digital Techniques, 152(4): 489-498, July 2005. 15. E. Savas, “A Carry-Free Montgomery Inversion Algorithm”. Embedded Cryptographic Hardware: Design and Security, editor Nadia Nedjah, Nova Science Publishers, 2004. 16. E. Savas, A. F. Tenca, M. E. Ciftcibasi, C. K. Koc. Multiplier architectures for GF(p) and GF(2^k). IEE Proceedings – Computers and Digital Techniques, 151(2): 147-160, March 2004. 17. B. Sunar, E. Savas, and C. K. Koc. Constructing composite field representations for efficient conversion. IEEE Transactions on Computers, 52(11): 1391-1398, November 2003. 18. T. Yanik, E. Savas, and C. K. Koc. Incomplete modular arithmetic, IEE Proceedings - Computers and Digital Techniques, 149(2): 46-52, March 2002. 19. E. Savas and C. K. Koc. The Montgomery modular inverse - revisited. IEEE Transactions on Computers, 49(7): 763-766, July 2000. Complete List of Publications …",
  "content_length": 5325,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:37"
}