{
  "name": "Erman Ayday",
  "homepage": "https://engineering.case.edu/profiles/exa208",
  "status": "success",
  "content": "Erman Ayday | Case School of Engineering | School of Engineering | Case Western Reserve University Skip to main content Go to case.edu Case School of Engineering × Warning message Erman Ayday cannot be edited as it was published by another site. The content can only be edited at the source site here. Home About Faculty and Staff Directory Erman Ayday Erman Ayday, PhD, MS, BS Email erman.ayday@case.edu Office Location: Olin 402 Associate Professor Department of Computer and Data Sciences Case School of Engineering Privacy enhancing technologies, data security and applied cryptographyy. Research Information Research Interests Privacy enhancing technologies (including online social networks and genomic privacy). Data security and applied cryptography. Big data analytics and statistical inference from big data. Iterative algorithms for trust and reputation management. Trust and reputation management for ad-hoc networks and online services. Information retrieval and recommender systems. Data Privacy, authentication and availability for wireless sensor networks. Game theory for wireless networks. Cyber security for Smart Grid, Delay tolerant, and M2M networks. Publications Yilmaz, E., Ji, T., Ayday, E., & Li, P. (2021). Genomic Data Sharing under Dependent Local Differential Privacy. arXiv preprint arXiv:2102.07357. Halimi, A., Dervishi, L., Ayday, E., Pyrgelis, A., Troncoso-Pastoriza, J., Hubaux, J., Jiang, X., & Vaidya, J. (2021). Privacy-Preserving and Efficient Verification of the Outcome in Genome-Wide Association Studies. arXiv preprint arXiv:2101.08879. Aysen, M., Ayday, E., & Cicek, A Ercument, E. (2020). The Effect of Kinship in Re-identification Attacks Against Genomic Data Sharing Beacons. bioRxiv. Almadhoun, N., Ayday, E., & Ulusoy, \\\"Ozg\\\"ur, E. (2020). Inference attacks against differentially private query results from genomic datasets including dependent tuples. Bioinformatics, 36 (Supplement\\_1), i136--i145. Ayoz, K., Aysen, M., Ayday, E., & Cicek, A Ercument, E. (2020). The effect of kinship in re-identification attacks against genomic data sharing beacons. Bioinformatics, 36 (Supplement\\_2), i903--i910. Yilmaz, E., & Ayday, E. (2020). Collusion-Resilient Probabilistic Fingerprinting Scheme for Correlated Data. arXiv preprint arXiv:2001.09555. Sariyildiz, M., Cinbis, R., & Ayday, E. (2020). Key protected classification for collaborative learning. Pattern Recognition, 104 , 107327. Demirag, D., & Ayday, E. (2020). Tracking and controlling the spread of a virus in a privacy-preserving way. arXiv preprint arXiv:2003.13073. Ayoz, K., Ayday, E., & Cicek, A Ercument, E. (2020). Genome reconstruction attacks against genomic data-sharing beacons. arXiv preprint arXiv:2001.08852. Almadhoun, N., Ayday, E., & Ulusoy, \\\"Ozg\\\"ur, E. (2020). Differential privacy under dependent tuples—the case of genomic privacy. Bioinformatics. \\\"Oks\\\"uz, Abdullah \\cCa\\uglar, Ayday, E., & G\\\"ud\\\"ukbay, U\\ugur, E. (2020). Privacy-Preserving and Robust Watermarking on Sequential Genome Data using Belief Propagation and Local Differential Privacy. bioRxiv. Zhu, X., Ayday, E., & Vitenberg, R. (2019). A privacy-preserving framework for outsourcing location-based services to the cloud. IEEE Transactions on Dependable and Secure Computing. Ayday, E., Naveed, M., & Tang, H. (2019). GenoPri'17: International Workshop on Genome Privacy and Security. IEEE/ACM Transactions on Computational Biology and Bioinformatics, 16 (4), 1322--1323. Zhu, X., Ayday, E., & Vitenberg, R. (2019). A privacy-preserving framework for outsourcing location-based services to the cloud. IEEE Transactions on Dependable and Secure Computing. Sar\\iy\\ild\\iz, Mert B\\\"ulent, Cinbi\\cs, Ramazan G\\\"okberk, & Ayday, E. (2019). Key Protected Classification for Collaborative Learning. arXiv preprint arXiv:1908.10172. Von Thenen, N., Ayday, E., & Cicek, A Ercument, E. (2019). Re-identification of individuals in genomic data-sharing beacons via allele inference. Bioinformatics, 35 (3), 365--371. B\\\"ulent Sar\\iy\\ild\\iz, Mert, G\\\"okberk Cinbiș, Ramazan, & Ayday, E. (2019). Key Protected Classification for Collaborative Learning. arXiv e-prints. Sar\\iy\\ild\\iz, Mert B\\\"ulent, Cinbi\\cs, Ramazan G\\\"okberk, & Ayday, E. (2018). Key Protected Classification for GAN Attack Resilient Collaborative Learning. . Ozercan, H., Ileri, A., Ayday, E., & Alkan, C. (2018). Realizing the potential of blockchain technologies in genomics. Genome research, 28 (9), 1255--1263. Kale, G., Ayday, E., & Tastan, O. (2018). A utility maximizing and privacy preserving approach for protecting kinship in genomic databases. Bioinformatics, 34 (2), 181--189. Sar\\iy\\ild\\iz, Mert B\\\"ulent, Cinbi\\cs, Ramazan G\\\"okberk, & Ayday, E. (2018). Key Protected Classification for GAN Attack Resilient Collaborative Learning. . Deznabi, I., Mobayen, M., Jafari, N., Tastan, O., & Ayday, E. (2018). An inference attack on genomic data using kinship, complex correlations, and phenotype information. IEEE/ACM Transactions on Computational Biology and Bioinformatics (TCBB), 15 (4), 1333--1343. Yilmaz, E., Ferhatosmanoglu, H., Ayday, E., & Aksoy, R. (2018). Privacy-preserving aggregate queries for optimal location selection. arXiv preprint arXiv:1801.02069. G\\\"ursoy, Gamze, Harmanci, A., Tang, H., Ayday, E., & Brenner, S. (2018). When Biology Gets Personal: Hidden Challenges of Privacy and Ethics in Biological Big Data. World Scientific. Ailijiang, A., Bayir, M., Altiparmak, N., Peixoto, D., Arora, V., Assent, I., Athanassoulis, M., Ayday, E., Babalou, S., Bahrami, M., & Others, M. (2018). Appreciation to distributed and parallel databases reviewers. Distrib Parallel Databases, 36 , 1--3. Ozercan, H., Ileri, A., Ayday, E., & Alkan, C. (2018). Realizing the potential of blockchain technologies in genomics. Genome research, 28 (9), 1255--1263. Ayday, E., Jiang, X., & Malin, B. (2018). GenoPri'16: International Workshop on Genome Privacy and Security. IEEE/ACM Transactions on Computational Biology and Bioinformatics. Von Thenen, N., Ayday, E., & Cicek, A Ercument, E. (2018). Re-identification of individuals in genomic data-sharing beacons via allele inference. Bioinformatics, 35 (3), 365--371. Harmanci, A., Tang, H., Ayday, E., & Brenner, S. (2018). When Biology Gets Personal: Hidden Challenges of Privacy and Ethics in Biological Big Data. . Ayday, E., Jiang, X., & Malin, B. (2018). GenoPri'16: International Workshop on Genome Privacy and Security. IEEE/ACM Transactions on Computational Biology and Bioinformatics, 15 (5), 1403--1404. Harmanci, A., Tang, H., Ayday, E., & Brenner, S. (2018). When Biology Gets Personal: Hidden Challenges of Privacy and Ethics in Biological Big Data. . Yilmaz, E., Ferhatosmanoglu, H., Ayday, E., & Aksoy, R. (2017). Privacy-preserving aggregate queries for optimal location selection. IEEE Transactions on Dependable and Secure Computing, 16 (2), 329--343. Kale, G., Ayday, E., & Tastan, O. (2017). Supplementary Materials for A Utility Maximizing and Privacy Preserving Approach for Protecting Kinship in Genomic Databases. . Tuna, G., Kogias, D., Gungor, V., Gezer, C., Ta\\csk\\in, Erhan, C., & Ayday, E. (2017). A survey on information security threats and solutions for Machine to Machine (M2M) communications. Journal of Parallel and Distributed Computing, 109 , 142--154. Ayday, E., Tang, Q., & Yilmaz, A. (2017). Cryptographic solutions for credibility and liability issues of genomic data. IEEE Transactions on Dependable and Secure Computing. Humbert, M., Ayday, E., Hubaux, J., & Telenti, A. (2017). Quantifying interdependent risks in genomic privacy. ACM Transactions on Privacy and Security (TOPS), 20 (1), 3. Tuna, G., Kogias, D., Gungor, V., Gezer, C., Ta\\csk\\in, Erhan, C., & Ayday, E. (2017). A survey on information security threats and solutions for Machine to Machine (M2M) communications. Journal of Parallel and Distributed Computing, 109 , 142--154. Ayday, E., Tang, Q., & Yilmaz, A. (2017). Cryptographic solutions for credibility and liability issues of genomic data. IEEE Transactions on Dependable and Secure Computing, 16 (1), 33--43. Halimi, A., & Ayday, E. (2017). Profile matching across unstructured online social networks: threats and countermeasures. arXiv preprint arXiv:1711.01815. Kale, G., Ayday, E., & Tastan, O. (2017). A utility maximizing and privacy preserving approach for protecting kinship in genomic databases. Bioinformatics, 34 (2), 181--189. Ayday, E., & Humbert, M. (2017). Inference attacks against kin genomic privacy. IEEE Security \\& Privacy, 15 (5), 29--37. Kale, G., Ayday, E., & Tastan, O. (2017). Supplementary Materials for A Utility Maximizing and Privacy Preserving Approach for Protecting Kinship in Genomic Databases. . Deznabi, I., Mobayen, M., Jafari, N., Tastan, O., & Ayday, E. (2017). An inference attack on genomic data using kinship, complex correlations, and phenotype information. IEEE/ACM transactions on computational biology and bioinformatics, 15 (4), 1333--1343. Ayday, E., & Humbert, M. (2017). Inference attacks against kin genomic privacy. IEEE Security \\& Privacy, 15 (5), 29--37. Humbert, M., Ayday, E., Hubaux, J., & Telenti, A. (2017). Quantifying interdependent risks in genomic privacy. ACM Transactions on Privacy and Security (TOPS), 20 (1), 1--31. Yilmaz, A., & Ayday, E. (2017). Collusion-secure watermarking for sequential data. arXiv preprint arXiv:1708.01023. Halimi, A., & Ayday, E. (2017). Profile Matching Across Unstructured Online Social Networks: Threats and Countermeasures. arXiv preprint arXiv:1711.01815. Yilmaz, A., & Ayday, E. (2017). Collusion-Secure Watermarking for Sequential Data. arXiv preprint arXiv:1708.01023. Avllazagaj, E., Ayday, E., & Cicek, A Ercument, E. (2016). Privacy-Related Consequences of Turkish Citizen Database Leak. arXiv preprint arXiv:1605.05847. McLaren, P., RAISARO, J., Aouri, M., Rotger, M., Ayday, E., Bartha, Istv\\'an, E., Delgado, M., Vallet, Y., G\\\"unthard, Huldrych F, Y., Cavassini, M., & Others, M. (2016). Privacy-preserving gen",
  "content_length": 18043,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:35"
}