{
  "name": "Ernst Moritz Hahn",
  "homepage": "https://emhahn.de",
  "status": "success",
  "content": "Ernst Moritz Hahn Ernst Moritz Hahn About me I am an assistant professor at the Formal Methods and Tools (FMT) group at the University of Twente within Mariëlle Stoelinga's project CAESAR. Google Scholar: http://scholar.google.de/citations?user=MH7fSVAAAAAJ ORCID: https://orcid.org/0000-0002-9348-7684 DBLP: https://dblp.uni-trier.de/pid/78/6159.html Research Interests My main research interest is probabilistic model checking. This involves topics such as: Robustness analysis and improvement for deep neural networks stochastic hybrid systems efficient algorithms for deciding linear time logic properties continuous-time Markov chains with infinite state-space parametric and interval Markov models quantum Markov models reinforcement learning of linear-time properties multi-objective model checking stochastic parity games Contact University of Twente Room: Zilverling 3061 E-Mail: e.m.hahn@utwente.nl Lecturing Programme mentor of the Software Technology specialisation University of Twente since 2022 Master programme, in English Instructor “Advanced Logic” University of Twente one time a year since 2020 Master programme, in English Instructor “Probabilistic Model Checking (Software Science)” University of Twente one time every two years since 2022 Bachelor programme, in English Instructor “Languages and Machines” University of Twente one time a year since 2020 Bachelor programme, in English Coordinator of track 3 (FMT) of the BSc research project University of Twente one time a year since 2020 Bachelor programme, in English Instructor for “Theory of Computation” 2019 and 2020 Queen’s University Belfast Bachelor programme, in English Guest Instructor for “Safety and Dependability” 2018 University of Liverpool Master programme, in English Instructor for “Data Networks” summer break 2017 Saarland University Master programme, advanced elective course, in English Instructor for “Quantitative Model Checking” summer term 2017 Saarland University Master programme, advanced elective course, in English Teaching about verification of stochastic models as part of Model Checking lecture for Master and PhD students 2016 Beijing University in English Designing questions and expected answers for an exam for a lecture about probabilistic model checking. 2012 University of Oxford in English Teaching assistant for “Data Networks” Tutoring exercise groups and grading exercise sheets. summer term 2011 Saarland University Master programme, advanced elective course, in English Teaching assistant for “Im Zoo der Automaten” Discussing slides with students, giving advice for improvement. Participation in grading of final talks. winter term 2010/2011 Saarland University Bachelor programme, proseminar, in German Teaching assistant for “Im Zoo der Automaten” Discussing slides with students, giving advice for improvement. Participation in grading of final talks. winter term 2008/2009 Saarland University Bachelor programme, proseminar, in German Teaching assistant for “Quantitative Model Checking” Preparing theoretical and practical exercises for exercise sheets. Tutoring exercise groups and grading exercise sheets. summer term 2010 Saarland University Master programme, advanced elective course, in English Teaching assistant for “Quantitative Model Checking” Preparing theoretical and practical exercises for exercise sheets. Tutoring exercise groups and grading exercise sheets. summer term 2009 Saarland University Master programme, advanced elective course, in English Teaching assistant for “Testing Techniques” Tutoring exercise groups and grading exercise sheets. winter term 2008/2009 Saarland University Master programme, advanced elective course, in English Teaching assistant for “Nebenläufige Programmierung” Tutoring exercise groups and grading exercise sheets. summer term 2008 Saarland University Bachelor programme, mandatory course, in German Teaching assistant for “Embededded Systems” Tutoring exercise groups and grading exercise sheets. Improving course exams. summer term 2007 Saarland University Master programme, advanced elective course, in English Supervision and Evaluation Daily supervisor of PhD student Akshay Dhonti joint PhD project with Audi AG (only full professors can be official supervisors) University of Twente Since September 2020 Supervisor of two Master projects (1 finished, 1 ongoing) University of Twente since 2020 Supervisor of four Bachelor projects and several other Bachelor-level student projects. University of Twente since 2021 Day supervisor of PhD student Stefano Nicoletti, PhD student of Mariëlle Stoelinga University of Twente Since September 2020 Personal tutor of seven Bachelor students Queen’s University Belfast 2019 Supervisor of five Bachelor projects Queen’s University Belfast 2019/2020 Reviewer for the graduate award of OLDIES e.V. (Graduate association of the Carl von Ossietzky Universität Oldenburg) 2015, 2023 Second reviewer of Bachelor thesis “PseuCo meets Java - Code Generation and Execution” by Lisa Detzler Saarland University, 2014 Adviser of Bachelor thesis “Probabilistische Aspekte - AspectKP - ein verteiltes Prozesskalkül” by Christian Josef Köhl Saarland University, 2012 Adviser of Bachelor thesis “Analyse Stochastischer Hybrider Systeme” by Patrick Dubbert Saarland University, 2010 Coadviser of Master thesis “Approximation of Bisimulation in Probabilistic Metric Systems” by Fabian Bendun Saarland University, 2010 Coadviser of Master thesis “Scheduler-Quantified Time-Bounded Reachability for Distributed Input/Output Interactive Probabilistic Chains” by Georgel Ionut Calin Saarland University, 2010 Advice concerning individual questions to individual Bachelor and Master students as well as student assistants, including Frits Dannenberg, Zhimin Wu, Yong Li, Fu Chen, Thomas Neele, Frits Dannenberg, Alexander Graf-Brill, Sascha Zickenrott, Ivan Pryvalov, Li Yi, Thomas Karos, Zhechao Lin, Yuliya Butkova and Dmytro Puzhay. Funding since 2021: Industrial PhD project in collaboration with Audi AG Ingolstadt funded by BMWi as part of the KARLI project (grant 19A21031C). This project about safety guarantees for DNN applications runs for 3 years. Audi pays the salary of the candidate as well as an annual fixed price of EUR 17,000 plus 15% IP surcharge (i.e. 19,550EUR per year). 2021: Established Memorandum of Understanding with Institute of Soft- ware, Chinese Academy of Sciences, to serve as framework for double-degree PhD student projects, to be financed (per PhD stu- dent) by the China Scholarship Council 11/2017 - 10/2018: Marie Skłodowska Curie Individual Fellowship “ PaVeCo - Parametrised Verification and Control”, Project ID 753351 (€195 455 total, ≈£174 889) 12/2013 - 12/2016: PI of the project “Model Checking of Complex and Hybrid Stochastic Systems”, Grant No. 61350110518, 61450110461, 61550110506 of Research Fund for International Young Scientists (extended twice; RMB 200 000/year, ≈£22 840, initially and after first extension; \tRMB 340 000/year, ≈£38 828, after second extension) 6/2013 - 12/2016: Chinese Academy of Sciences fellowship for young international scientists, Grant No. 2013Y1GB0006 (extended twice; RMB 248 000/year, ≈£28 321) 5/2008 – 4/2010: Stipend of the graduate school “Leistungsgarantien für Rechnersysteme”, Deutsche Forschungsgemeinschaft (DFG) Publications Last updated: 2023-01-18 2022 Meilun Li, Andrea Turrini, Ernst Moritz Hahn, Zhikun She, and Lijun Zhang. Probabilistic Preference Planning Problem for Markov Decision Processes. IEEE TSE, 48(5):1545-1559, 2022CORE: A*Citations: 2 Ernst Moritz Hahn, Mateo Perez, Sven Schewe, Fabio Somenzi, Ashutosh Trivedi, and Dominik Wojtczak. An Impossibility Result in Automata-Theoretic Reinforcement Learning. In ATVA, 2022, pages 42-57CORE: A Ernst Moritz Hahn, Mateo Perez, Sven Schewe, Fabio Somenzi, Ashutosh Trivedi, and Dominik Wojtczak. Alternating Good-for-MDPs Automata. In ATVA, 2022, pages 303-319CORE: A Stefano M. Nicoletti, Ernst Moritz Hahn, and Mariëlle Stoelinga. BFL: a Logic to Reason about Fault Trees. In DSN, 2022, pages 441-452CORE: A Ernst Moritz Hahn, Mateo Perez, Sven Schewe, Fabio Somenzi, Ashutosh Trivedi, and Dominik Wojtczak. Reinforcement Learning with Guarantees that Hold for Ever. In FMICS, 2022, pages 3-7CORE: C Chen Fu, Ernst Moritz Hahn, Yong Li, Sven Schewe, Meng Sun, Andrea Turrini, and Lijun Zhang. EPMC Gets Knowledge in Multi-agent Systems. In VMCAI, 2022, pages 93-107CORE: BCitations: 3 2021 Ernst Moritz Hahn and Arnd Hartmanns. Symblicit exploration and elimination for probabilistic model checking. In SAC, 2021, pages 1798-1806Citations: 1 Mariëlle Stoelinga, Christina Kolb, Stefano M. Nicoletti, Carlos E. Budde, and Ernst Moritz Hahn. The Marriage Between Safety and Cybersecurity: Still Practicing. In SPIN, 2021, pages 3-21Citations: 2 Ernst Moritz Hahn, Mateo Perez, Sven Schewe, Fabio Somenzi, Ashutosh Trivedi, and Dominik Wojtczak. Model-Free Reinforcement Learning for Branching Markov Decision Processes. In CAV, 2021, pages 651-673CORE: A*Citations: 2 Ernst Moritz Hahn, Mateo Perez, Sven Schewe, Fabio Somenzi, Ashutosh Trivedi, and Dominik Wojtczak. Model-Free Reinforcement Learning for Lexicographic Omega-Regular Objectives. In FM, 2021, pages 142-159CORE: ACitations: 2 2020 Ernst Moritz Hahn, Mateo Perez, Sven Schewe, Fabio Somenzi, Ashutosh Trivedi, and Dominik Wojtczak. Faithful and Effective Reward Schemes for Model-Free Reinforcement Learning of Omega-Regular Objectives. In ATVA, 2020, pages 108-124CORE: ACitations: 13 Ernst Moritz Hahn, Mateo Perez, Sven Schewe, Fabio Somenzi, Ashutosh Trivedi, and Dominik Wojtczak. Model-Free Reinforcement Learning for Stochastic Parity Games. In CONCUR, 2020, pages 21:1-21:16CORE: ACitations: 9 Ernst Moritz Hahn, Mateo Perez, Sven Schewe, Fabio Somenzi, Ashutosh Trivedi, and Dominik Wojtczak. Good-for-MDPs Automata for Probabilistic Anal",
  "content_length": 23997,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:39"
}