{
  "name": "Ernst Althaus",
  "homepage": "https://www.algorithmics.informatik.uni-mainz.de/people/ernst-althaus",
  "status": "success",
  "content": "Ernst Althaus, Univ.-Prof. Dr. – Algorithmics Office Hours: Arrangement by mail ha-index : 90 since December 2008Professor at the Johannes Gutenberg-Universität MainzHead of the research group on “Algorithmics” December 2009 – December 2015Senior Researcher at the Max-Planck-Institut für Informatik, Saarbrücken April 2007 – November 2008Senior Researcher at the Max-Planck-Insitut für Informatik, SaarbrückenHeading research area “Combinatorial Optmization” October 2005 – March 2007Visiting Professor at the Johannes Gutenberg-Universität MainzHead of the research group on “Theoretical Computer Science” April 2004 – September 2005Head of an independent research group at the Laboratoire lorrain de recherche en informatique et ses applications (LORIA), NancyHeading a research group on “Optimization in Bioinformatics” September 2002 – March 2004Postdoc at the Max-Planck-Insitut für Informatik, Saarbrücken September 2001 – August 2002Postdoc at the International Computer Science Institute, Berkeley, CA May 2001 – August 2001Postdoc at the Max-Planck-Insitut für Informatik, Saarbrücken February 1999 – April 2001Researcher at the Max-Planck-Insitut für Informatik, SaarbrückenPh. D. candidate in Computer Science at University of Saarbrücken (Universität des Saarlandes) and at MPII. January 2008HabilitationUniversität des Saarlandes, Saarbrücken April 2001PromotionSupervisor: Kurt MehlhornTitle: Curve Reconstruction and the Traveling Salesman Problem December 1998DiplomaSupervisor: Kurt MehlhornTitle: Berechnung optimaler Steinerbäume in der Ebene 2025 Blumenstock, M., Althaus, E., Rassau, N., et al. (2025). Sorting Colored Balls in Colored Tubes. In M. Likhachev, H. Rudová, and E. Scala (eds.), Proceedings of the International Symposium on Combinatorial Search (Vols. 18, Issue 1, pp. 11-19). The AAAI Press, Washington, DC, USA. DOI Author/Publisher URL Marianczuk, L., Althaus, E., Irnich, S., Pfetsch, M. E. (2025). A New Relaxation for Tree-Based Problems and Minimum Power-Cost Spanning Trees. In P. Mutzel and N. Prezza (eds.), SEA (Vols. 338, pp. 24:1-24:1). Schloss Dagstuhl – Leibniz-Zentrum für Informatik. Author/Publisher URL 2024 Althaus, E., Hartung, L., and Steiner, R. (2024). A Random Walk Approach to Broadcasting on Random Recursive Trees. DOI Althaus, E., and Schnurbusch, D. (2024). Reducing Treewidth for SAT-Related Problems Using Simple Liftings (Vols. 14594, pp. 175-191). DOI Author/Publisher URL Heilmann, X., Cerrato, M., and Althaus, E. (2024). Differentially Private Sum-Product Networks. ICML. Author/Publisher URL 2023 Althaus, E., Bumpus, B. M., Fairbanks, J., and Rosiak, D. (2023). Compositional Algorithms on Compositional Data: Deciding Sheaves on Presheaves. Author/Publisher URL Althaus, E., Bumpus, B. M., Fairbanks, J. P., and Rosiak, D. (2023). Compositional Algorithms on Compositional Data: Deciding Sheaves on Presheaves. CoRR, abs/2302.05575. Althaus, E., Funke, S., and Schrauth, M. (2023). Privacy Preserving Queries of Shortest Path Distances (Vols. 13799, pp. 94-101). DOI Author/Publisher URL Bammert, L.-M., Kramer, S., Cerrato, M., and Althaus, E. (2023). Privacy-Preserving Learning of Random Forests Without Revealing the Trees. In A. Bifet, A. C. Lorena, R. P. Ribeiro, et al. (eds.), DS (Vols. 14276, pp. 372-386). Springer. Author/Publisher URL 2022 Althaus, E., Berenbrink, P., Brinkmann, A., and Steiner, R. (2022). On the Optimality of the Greedy Garbage Collection Strategy for SSDs. Proceedings of the 42nd IEEE International Conference on Distributed Computing Systems (ICDCS), 78-88. DOI Author/Publisher URL 2021 Althaus, E., Dousti, M. S., Kramer, S., and Rassau, N. J. P. (2021). Fast Private Parameter Learning and Inference for Sum-Product Networks. Author/Publisher URL Althaus, E., and Ziegler, S. (2021). Optimal Tree Decompositions Revisited: A Simpler Linear-Time FPT Algorithm. In C. Gentile, G. Stecca, and P. Ventura (eds.), Graphs and Combinatorial Optimization: from Theory to Applications: CTW2020 Proceedings (pp. 67-78). Cham:Springer International Publishing. DOI Althaus, E., Dousti, M. S., and Kramer, S. (2021). Fast Private Parameter Learning and Evaluation for Sum-Product Networks. CoRR, abs/2104.07353. Althaus, E., Hildebrandt, A., and Mosca, D. (2021). Learning Molecular Classes from Small Numbers of Positive Examples Using Graph Grammars. In Lecture Notes in Computer Science (pp. 3-15). Springer International Publishing. DOI Althaus, E., Schnurbusch, D., Wüschner, J., and Ziegler, S. (2021). On Tamaki’s Algorithm to Compute Treewidths. In D. Coudert and E. Natale (eds.), SEA (Vols. 190, pp. 9:1-9:1). Schloss Dagstuhl – Leibniz-Zentrum für Informatik. Author/Publisher URL Hildebrandt, A. K., Althaus, E., and Hildebrandt, A. (2021). Privately Querying Privacy: Privacy Estimation with Guaranteed Privacy of User and Database Party. 56-72. Author/Publisher URL Häcker, C., Bouros, P., Chondrogiannis, T., and Althaus, E. (2021). Most Diverse Near-Shortest Paths. 229-239. Author/Publisher URL 2020 Althaus, E., Rauterberg, F., and Ziegler, S. (2020). Computing Euclidean Steiner trees over segments. EURO JOURNAL ON COMPUTATIONAL OPTIMIZATION, 8(3-4), 309-325. DOI Author/Publisher URL 2019 Althaus, E., and Ziegler, S. (2019). Optimal Tree Decompositions Revisited: A Simpler Linear-Time FPT Algorithm. CoRR, abs/1912.09144. 2018 Althaus, E., Brinkmann, A., Kling, P., et al. (2018). Scheduling shared continuous resources on many-cores. Journal of Scheduling, 21, 77-92. DOI 2017 Althaus, E., Beber, B., Damm, W., et al. (2017). Verification of linear hybrid systems with large discrete state spaces using counterexample-guided abstraction refinement. Science of Computer Programming, 148, 123-160. DOI Althaus, E., Hildebrandt, A., Mosca, D. (2017). Graph Rewriting Based Search for Molecular Structures: Definitions, Algorithms, Hardness. Federation of International Conferences on Software Technologies: Applications and Foundations, 43-59. 2015 Althaus, E., and Muttary, U. (2015). University Course Timetabling with Conflict Minimization and Elective Courses. 12th Workshop on Models and Algorithms for Planning and Scheduling Problems, 224-229. Althaus, E., Beber, B., Kupilas, J., and Scholl, C. (2015). Improving Interpolants for Linear Arithmetic. In B. Finkbeiner, G. Pu, and L. Zhang (eds.), ATVA (Vols. 9364, pp. 48-63). Springer. Author/Publisher URL 2014 Althaus, E., Hildebrandt, A., Hildebrandt, A. K. (2014). A Greedy Algorithm for Hierarchical Complete Linkage Clustering. International Conference on Algorithms for Computational Biology, 25-34. Hildebrandt, A. K., Dietzen, M., Lengauer, T., et al. (2014). Efficient computation of root mean square deviations under rigid transformations. Journal of computational chemistry, 35, 765-771. Hildebrandt, A., Krupp, M. (2014). Algorithms for the maximum weight connected k-induced subgraph problem. Combinatorial Optimization and Applications, 268-268. Scholl, C., Pigorsch, F., Disch, S., Althaus, E. (2014). Simple interpolants for linear arithmetic. In G. P. Fettweis and W. Nebel (eds.), DATE (pp. 1-6). European Design and Automation Association. Author/Publisher URL 2013 Althaus, E., Kupilas, J., Naujoks, R. (2013). On the low-dimensional Steiner minimum tree problem in Hamming metric. Theoretical computer science, 505, Seiten: 2-10. Author/Publisher URL Hildebrandt, A. K., Althaus, E., Lenhof, H.-P., et al. (2013). Efficient Interpretation of Tandem Mass Tags in Top-Down Proteomics. German Conference on Bioinformatics 2013, 34, 56-67. 2012 Althaus, E., Hoffmann, S., Kupilas, J., and Thaden, E. (2012). A Column Generation Approach to Scheduling of Real-Time Networks – Best Paper Award of International Conference on Computer Science and Applications 2012 (S. I. Ao, C. Douglas, W. S. Grundfest, and J. Burgstone, eds.; pp. 224-229). Newswood Limited. Althaus, E., and Dumitriu, D. (2012). Certifying feasibility and objective value of linear programs. Operations Research Letters, 40(4), 292-297. DOI 2011 Althaus, E., Canzar, S., Elbassioni, K., et al. (2011). Approximation Algorithms for the Interval Constrained Coloring Problem. Algorithmica, 61(2), 342-361. DOI Althaus, E., Altmeyer, S., Naujoks, R. (2011). Precise and efficient parametric path analysis. In J. Vitek and B. D. Sutter (eds.), LCTES (pp. 141-150). ACM. Author/Publisher URL Althaus, E., Altmeyer, S., Naujoks, R. (2011). Symbolic Worst Case Execution Times. In A. Cerone and P. Pihlajasaari (eds.), ICTAC (Vols. 6916, pp. 25-44). Springer. Author/Publisher URL Althaus, E., Becker, B., Dumitriu, D., Kupferschmid, S. (2011). Integration of an LP Solver into Interval Constraint Propagation. In W. Wang, X. Zhu, and D.-Z. Du (eds.), COCOA (Vols. 6831, pp. 343-356). Springer. Author/Publisher URL Althaus, E., Kupilas, J., Naujoks, R. (2011). On the Low-Dimensional Steiner Minimum Tree Problem in Hamming Metric. In M. Ogihara and J. Tarui (eds.), TAMC (Vols. 6648, pp. 308-319). Springer. Author/Publisher URL Althaus, E., Naujoks, R., Thaden, E. (2011). A Column Generation Approach to Scheduling of Periodic Tasks. In P. M. Pardalos and S. Rebennack (eds.), SEA (Vols. 6630, pp. 340-351). Springer. Author/Publisher URL 2010 Althaus, E., Canzar, S., Ehrler, C., et al. (2010). Computing H/D-Exchange rates of single residues from data of proteolytic fragments. BMC Bioinformatics, 11(1). DOI Althaus, E., Hachenberger, P. (2010). Fully Automatic Trunk Packing with Free Placements. CoRR, abs/1008.3773. 2009 Meyer-Baese, A., Cappendijk, S., Althaus, E. (2009). Global uniform stability analysis of biological networks with different time-scales under perturbations. 2009 International Joint Conference on Neural Networks, 2098-2102. DOI Althaus, E., Canzar, S., Ehrler, C., et al. (2009). Discrete Fitting of Hydrogen-Deuterium-Exchange-data of Overlapping Fragments. In H. R. Arabnia and M. Q. Yang (eds.), BIOCOMP (pp. 496-502). CSREA Press. Author/Publisher URL Althaus, E., Dumitriu, D. (2009). Fast and Accurate Bo",
  "content_length": 15483,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:42"
}