{
  "name": "Ersin Uzun",
  "homepage": "https://www.rit.edu/directory/exugci-ersin-uzun",
  "status": "success",
  "content": "Ersin Uzun | RIT RIT Logo with Text Ersin Uzun Katherine Johnson Executive Director ESL Global Cybersecurity Institute Golisano College of Computing and Information Sciences Professor ersin.uzun@rit.edu 585-475-5142 Office Hours By Appointment Office Location GOL-1787 Office Mailing Address 20 Lomb Memorial Dr, GCI 70-1787, Rochester NY 14623 Ersin Uzun Katherine Johnson Executive Director ESL Global Cybersecurity Institute Golisano College of Computing and Information Sciences Professor Bio Dr. Ersin Uzun is the Katherine Johnson Endowed Executive Director of the ESL Global Cybersecurity Institute (ESL-GCI) and a Professor in the Department of Cybersecurity. His current research interests include Usable Security/Privacy, misinformation/deepfake detection and IoT/Networking Security. Prior to joining RIT in 2022,  Dr. Uzun's professional experiences include leading innovation/incubation organizations, establishing technology and open innovation partnerships across public and private sectors, and co-founding, advising and investing in technology startups. In his last role in Silicon Valley, he was the Vice President of Research and the Head of New Ventures at Palo Alto Research Center (PARC). In his career, Dr. Uzun has served in advisory and review boards of Finnish Funding Agency for Technology and Innovation, Research Council of Canada, U.S. National Science Foundation, Scientific and Technological Research Council of Turkey, in program committees of 50+ conferences as well as on the management and advisory boards of various technology startups.Dr. Uzun received his M.S. and PhD from University of California and has over 150 global patents and 50+ publications in the fields of networking, security and privacy. He is also an alum of the Executive Ignite Program of Stanford Graduate School of Business and inductee of University of California Information and Computer Sciences Hall of Fame. ersin.uzun@rit.edu 585-475-5142 Personal Links Google Scholar LinkedIn Areas of Expertise Usable Security and Privacy Network and IoT Security Privacy Enhancing Technologies Applied Cryptography Select Scholarship Publications:SJ Sohrawardi, C Schwartz, E Uzun, M Wright; DeFake: Developing a Usable Tool for Deepfake Awareness and Identification; Human Computer Interaction Consortium 2023C Ghali, G Tsudik, E Uzun; In Content We Trust: Network-Layer Trust in Content-Centric Networking; IEEE/ACM Transactions on Networking 2019V Bindschaedler, S Rane, AE Brito, V Rao, E Uzun; Achieving differential privacy in secure multiparty data aggregation protocols on star networks; ACM on Conference on Data and Application Security and Privacy 2017E Ngai, B Ohlman, G Tsudik, E Uzun, M Wählisch, CA Wood; Can we make a cake and eat it too? A discussion of ICN security and privacy; ACM SIGCOMM Computer Communication Review 2017C Ghali, G Tsudik, E Uzun, CA Wood; Closing the floodgate with stateless content-centric networking; International Conference on Computer Communication and Networks 2017M Mosko, E Uzun, CA Wood; Mobile sessions in content-centric networks; IFIP Networking Conference 2017G Tsudik, E Uzun, CA Wood; Ac3n: Anonymous communication in content-centric networking; IEEE Annual Consumer Communications & Networking Conference 2016E Ngai, B Ohlman, G Tsudik, E Uzun; Information-centric Networking and Security (Dagstuhl Seminar 16251)  Dagstuhl Reports 2016C Tschudin, E Uzun, CA Wood; Trust in information-centric networking: From theory to practice; International Conference on Computer Communication and Networks 2016J Kuriharay, E Uzun, CA Wood; An encryption-based access control framework for content centric networking; IFIP networking conference 2015C Ghali, G Tsudik, E Uzun, CA Wood; Living in a PIT-less World: A Case against Stateful Forwarding in Content-Centric Networking; The Computing Research Repository abs/1512.07755 2015S Rane, J Freudiger, AE Brito, E Uzun; Privacy, efficiency & fault tolerance in aggregate computations on massive star networks; IEEE International Workshop on Information Forensics and Security 2015S Rane, E Uzun; A fuzzy commitment approach to privacy preserving behavioral targeting; ACM MobiCom workshop on Security and privacy 2014P Mahadevan, E Uzun, S Sevilla, JJ Garcia-Luna-Aceves CCN-krs: A key resolution service for CCN; Proceedings of the 1st ACM Conference on Information-Centric Networking 2014CA Wood, E Uzun; Flexible end-to-end content security in CCN; IEEE 11th Consumer Communications and Networking Conference 2014C Ghali, G Tsudik, E Uzun; Needle in a haystack: Mitigating content poisoning in named-data networking; NDSS Workshop on Security of Emerging Networking Technologies 2014C Ghali, G Tsudik, E Uzun; Network-layer trust in named-data networking; ACM SIGCOMM Computer Communication Review 2014J Freudiger, S Rane, AE Brito, E Uzun; Privacy preserving data quality assessment for high-fidelity data sharing; ACM Workshop on Information Sharing & Collaboration 2014I Bilogrevic, J Freudiger, E De Dristofaro, E Uzun; What’s the gist? Privacy-preserving aggregation of user profiles; European Symposium on Research in Computer Security 2014A Kobsa, R Nithyanand, G Tsudik, E Uzun; Can Jannie verify? Usability of display-equipped RFID tags for security purposes; Journal of computer security 2013C Bian, Z Zhu, A Afanasyev, E Uzun, L Zhang; Deploying key management on NDN testbed; UCLA, Peking University and PARC, Tech Report 2013Patents:The list of 150+ patents can be found here . Currently Teaching CSEC-759Graduate Seminar in Computing Security3 CreditsThis course explores current topics in Computing Security. It is intended as a place holder course for faculty to experiment new course offerings in Computing Security undergraduate program. Course specific details change with respect to each specific focal area proposed by faculty.CSEC-799Independent Study1 - 3 CreditsThe graduate independent study offers students the opportunity to investigate a topic not covered in an available course in the MS program in conjunction with a faculty sponsor. Working cooperatively, the faculty sponsor and the student draft a proposal of the work to be completed, the deliverables expected from the student, the number of credits assigned, and the means by which the student’s work will be evaluated. The proposal must be approved by the graduate program director before a student can be registered for independent study. In the News November 14, 2025 Cybersecurity expert shares tips to protect your data from algorithmic pricing Spectrum News speaks to Ersin Uzun, Katherine Johnson Executive Director of the ESL Global Cybersecurity Institute, about how businesses use personal data for advertising and pricing changes. July 8, 2025 AI Empowers Novices to Launch Cyberattacks Communications of the ACM speaks to Ersin Uzun, director of the ESL Global Cybersecurity Institute, and RIT trustee Kevin Surace ’85 (electrical engineering technology) about AI driven attacks. January 27, 2025 NSF awards RIT more than $1 million to develop digital media forensics platform A new RIT project aims to bring order to the chaotic world of digital media forensics. The project in development, led by Endowed Professor of Cybersecurity Matthew Wright, will help combat manipulated media, including deepfakes. July 29, 2025 Uzun co-authors book More News Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 7553,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:42"
}