{
  "name": "Esfandiar Mohammadi",
  "homepage": "https://www.its.uni-luebeck.de/mitarbeiterinnen/esfandiar-mohammadi.html",
  "status": "success",
  "content": "Esfandiar Mohammadi: Institut: ITS Zur Navigation springenZum Content springenAktuelles | Impressum | Datenschutz | English InstitutMitarbeiter*innenThomas EisenbarthEsfandiar MohammadiSebastian BerndtPaula ArnoldJoseph BienhülsJeremy BoyTill EifertMohamed ElGhamrawyTim GellersenJonah HellerKristoffer HempelEike HoffmannTimothy ImortMoritz KirschteNiklas KlingerMarven KummerfeldtJohannes LiebenowNils LooseFelix MächtleFelix MaurerSebastian MeiserAkhil NarahariAnna PätschkePajam PaulsThorsten PeinemannChristopher PeredyMarcel PflaegingTammo PolleClaudius PottAnja RabichJonas SanderInes SchiebahnYara SchüttJan-Niclas SerrFlorian SieckAnnika StrangThore TiemannAlexander TreffJan WichelmannLehreLehrveranstaltungenAbschlussarbeitenAustauschprogramm USAKooperation Universität HamburgCapture The FlagForschungPublikationenDissertationenToolsSeminarProjekteStellenKontaktAdresseAnfahrt ITS | Institut für IT Sicherheit Universität zu Lübeck - Institut für IT Sicherheit - Mitarbeiter*innen - Esfandiar Mohammadi Prof. Dr. Esfandiar Mohammadi Details: mohammadi.eu Ratzeburger Allee 160 23562 Lübeck Gebäude 64, 1. OG, Raum 104 Email: esfandiar.mohammadi(at)uni-luebeck.de Phone: +49 451 3101 6609 Fax: +49 451 3101 6604 2025 Thorsten Peinemann, Paula Arnold, Sebastian Berndt, Thomas Eisenbarth, and Esfandiar Mohammadi, Non-omniscient backdoor injection with a single poison sample: Proving the one-poison hypothesis for linear regression and linear classification, arXiv , Aug. 2025. DOI:10.48550/arXiv.2508.05600 Datei: 2508.05600 Johannes Liebenow, Thorsten Peinemann, and Esfandiar Mohammadi, DP-HYPE: Distributed Differentially Private Hyperparameter Search, arXiv preprint arXiv:2510.04902 , 2025. Weblink: https://arxiv.org/abs/2510.04902 Sebastian Meiser, Debajyoti Das, Moritz Kirschte, Esfandiar Mohammadi, and Aniket Kate, Mixnets on a tightrope: Quantifying the leakage of mix networks using a provably optimal heuristic adversary, in 2025 IEEE Symposium on Security and Privacy (SP) , Los Alamitos, CA, USA: IEEE Computer Society, 2025. pp. 4457-4475. Datei: SP61157.2025.00233 2024 Max Schulze, Yorck Zisgen, Moritz Kirschte, Esfandiar Mohammadi, and Agnes Koschmider, Differentially Private Inductive Miner, in 2024 6th International Conference on Process Mining (ICPM) , Curran Associates, Sep.2024. pp. 89-96. DOI:10.1109/ICPM63005.2024.10680684 ISBN:979-8-3503-6503-0 Datei: 10680684 Johannes Liebenow, Yara Schütt, Tanya Braun, Marcel Gehrke, Florian Thaeter, and Esfandiar Mohammadi, DPM: Clustering Sensitive Data through Separation, in Proceedings of the 2024 ACM SIGSAC Conference on Computer and Communications Security, CCS 2024 , ACM, 2024. DOI:10.48550/arXiv.2307.02969 Datei: arXiv.2307.02969 Marcel Gehrke, Johannes Liebenow, Esfandiar Mohammadi, and Tanya Braun, Lifting in Support of Privacy-Preserving Probabilistic Inference, KI - Künstliche Intelligenz , vol. 38, pp. 225-241, 2024. DOI:10.1007/s13218-024-00851-y Datei: s13218-024-00851-y Johannes Liebenow, Timothy Imort, Yannick Fuchs, Marcel Heisel, Nadja Käding, Jan Rupp, and Esfandiar Mohammadi, PrivAgE: A Toolchain for Privacy-Preserving Distributed Aggregation on Edge-Devices, KI - Künstliche Intelligenz , vol. 38, pp. 183-188, 2024. DOI:10.1007/s13218-023-00823-8 Datei: s13218-023-00823-8 Thorsten Peinemann, Moritz Kirschte, Joshua Stock, Carlos Cotrini, and Esfandiar Mohammadi, S-BDT: Distributed Differentially Private Boosted Decision Trees, in Proceedings of the 2024 ACM SIGSAC Conference on Computer and Communications Security (CCS '24) , New York, NY, USA: Association for Computing Machinery, 2024. pp. 288–302. DOI:10.1145/3658644.3690301 ISBN:9798400706363 Datei: 2309.12041 2022 Moritz Kirschte, Sebastian Meiser, Saman Ardalan, and Esfandiar Mohammadi, Distributed DP-Helmet: Scalable Differentially Private Non-interactive Averaging of Single Layers, arXiv , Nov. 2022. DOI:10.48550/arXiv.2211.02003 Datei: 2211.02003 2021 Debajyoti Das, Sebastian Meiser, Esfandiar Mohammadi, and Aniket Kate, Divide and Funnel: a Scaling Technique for Mix-Networks, IACR Cryptol. ePrint Arch. , pp. 1685, 2021. Datei: 1685 David M. Sommer, Lukas Abfalterer, Sheila Zingg, and Esfandiar Mohammadi, Learning Numeric Optimal Differentially Private Truncated Additive Mechanisms, CoRR , vol. abs/2107.12957, 2021. Datei: 2107.12957 Eike Petersen, Yannik Potdevin, Esfandiar Mohammadi, Stephan Zidowitz, Sabrina Breyer, Dirk Nowotka, Sandra Henn, Ludwig Pechmann, Martin Leucker, Philipp Rostalski, and Christian Herzog, Responsible and Regulatory Conform Machine Learning for Medicine: A Survey of Technical Challenges and Solutions, CoRR , vol. abs/2107.09546, 2021. Datei: 2107.09546 2020 Debajyoti Das, Sebastian Meiser, Esfandiar Mohammadi, and Aniket Kate, Comprehensive Anonymity Trilemma: User Coordination is not enough, in Proceedings on Privacy Enhancing Technologies (PETS/PoPETS) 2020.3 , Sciendo, 2020. DOI:10.2478/popets-2020-0056 Datei: article-p356.xml 2019 David Sommer, Aritra Dhar, Luka Malisa, Esfandiar Mohammadi, Daniel Ronzani, and Srdjan Capkun, Deniable Upload and Download via Passive Participation, in 16th USENIX Symposium on Networked Systems Design and Implementation (NSDI 19) , Boston, MA: USENIX Association, Feb.2019. pp. 649--666. ISBN:978-1-931971-49-2 Datei: sommer Damien Desfontaines, Elisabeth Krahmer, and Esfandiar Mohammadi, Passive and active attackers in noiseless privacy, CoRR , vol. abs/1905.00650, 2019. Datei: 1905.00650 David Sommer, Sebastian Meiser, and Esfandiar Mohammadi, Privacy Loss Classes: The Central Limit Theorem in Differential Privacy, Proceedings on Privacy Enhancing Technologies , vol. 2019, no. 2, pp. 245 - 269, 2019. Sciendo. DOI:https://doi.org/10.2478/popets-2019-0029 Datei: article-p245.xml 2018 Debajyoti Das, Sebastian Meiser, Esfandiar Mohammadi, and Aniket Kate, Anonymity Trilemma: Strong Anonymity, Low Bandwidth Overhead, Low Latency---Choose Two, in In Proceedings of the 39th IEEE Symposium on Security and Privacy (S\\&P) , IEEE, 2018. pp. 170--188. Sebastian Meiser, and Esfandiar Mohammadi, Tight on Budget? Tight Bounds for r-Fold Approximate Differential Privacy, in Proceedings of the 25th ACM Conference on Computer and Communications Security (CCS) , ACM, 2018. 2017 Michael Backes, Aniket Kate, Praveen Manoharan, Sebastian Meiser, and Esfandiar Mohammadi, AnoA: A Framework for Analyzing Anonymous Communication Protocols, Journal of Privacy and Confidentiality , vol. 7, no. 2:5, pp. 163--178, 2017. IEEE. 2016 Michael Backes, Robert Künnemann, and Esfandiar Mohammadi, Computational Soundness of Dalvik Bytecode, in Proceedings of the 23rd ACM Conference on Computer and Communications Security (CCS) , ACM, 2016. 2015 Michael Backes, Esfandiar Mohammadi, and Tim Ruffing, Computational Soundness for Interactive Primitives, in Proc.\\ 20th European Symposium on Research in Computer Security (ESORICS) , Springer, 2015. pp. 125--145. Michael Backes, Fabian Bendun, Matteo Maffei, Esfandiar Mohammadi, and Kim Pecina, Symbolic Malleable Zero-knowledge Proofs, in Proceedings of the 28th IEEE Computer Security Foundations Symposium (CSF) , IEEE, 2015. pp. 412--426. 2014 Michael Backes, Aniket Kate, Sebastian Meiser, and Esfandiar Mohammadi, (Nothing else) MATor(s): Monitoring the Anonymity of Tor's Path Selection, in Proceedings of the 21st ACM Conference on Computer and Communications Security (CCS) , ACM, 2014. pp. 513--524. Michael Backes, Esfandiar Mohammadi, and Tim Ruffing, Computational Soundness Results for ProVerif, in Proceedings of the 3rd Conference on Principles of Security and Trust (POST) , Springer, 2014. pp. 42--62. Michael Backes, Praveen Manoharan, and Esfandiar Mohammadi, TUC: Time-sensitive and Modular Analysis of Anonymous Communication, in Proceedings of the 27th IEEE Computer Security Foundations Symposium (CSF) , IEEE, 2014. pp. 383--397. 12 nächste Mitarbeiter*innenThomas EisenbarthEsfandiar MohammadiSebastian BerndtPaula ArnoldJoseph BienhülsJeremy BoyTill EifertMohamed ElGhamrawyTim GellersenJonah HellerKristoffer HempelEike HoffmannTimothy ImortMoritz KirschteNiklas KlingerMarven KummerfeldtJohannes LiebenowNils LooseFelix MächtleFelix MaurerSebastian MeiserAkhil NarahariAnna PätschkePajam PaulsThorsten PeinemannChristopher PeredyMarcel PflaegingTammo PolleClaudius PottAnja RabichJonas SanderInes SchiebahnYara SchüttJan-Niclas SerrFlorian SieckAnnika StrangThore TiemannAlexander TreffJan Wichelmann Institut für IT-Sicherheit Tel:  +49 451 3101 6600 Email: its.office(at)uni-luebeck.de",
  "content_length": 8532,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:45"
}