{
  "name": "Eshan Chattopadhyay",
  "homepage": "https://www.cs.cornell.edu/~eshan",
  "status": "success",
  "content": "Eshan Chattopadhyay Eshan Chattopadhyay Associate Professor of Computer Science Cornell University email: Phone: (607) 216-9496 I am broadly interested in theoretical computer science and a member of the theory group at Cornell University. Here is a brief bio and a CV. Click here to find a complete list of my publications. I co-organize the Cornell CS theory seminar. Drop me a line if you are interested in giving a talk! Please read this before sending me an email! Current PhD students: Mohit Gurumukhani Noam Ringach Yunya Zhao Oren Renard, co-advised with Nick Spooner. Former PhD Students (with first employment): Jyun-Jie Liao, PhD 2024. (Postdoctoral Researcher at UCSD.) Jesse Goodman, PhD 2023. (Postdoctoral Fellow at UT Austin.) Teaching CS 6810: Theory of Computing. Fall 2021, Fall 2023 , Spring 2026 CS 4820: Introduction to Analysis of Algorithms. Spring 2019 (co-taught with Bobby Kleinberg), Spring 2022, Spring 2023 (co-taught with Katherine Van Koevering), Fall 2025 CS 6817: Analysis of Boolean Functions. Fall 2020, Spring 2025 CS 4814: Introduction to Computational Complexity. Spring 2020, Spring 2021, Fall 2024 CS 6815: Pseudorandomness and Combinatorial Constructions. Fall 2018, Fall 2019, Fall 2022 CSMore Program: Summer 2020 , Summer 2021 . Short introduction to Discrete Structures (pre-2800), co-taught with Éva Tardos. Program Committees: FSTTCS 2017, FOCS 2018, RANDOM 2020 , CCC 2022 , ITC 2022 , STOC 2024, SODA 2025 , ITCS 2025, RANDOM 2025 (PC Chair), FOCS 2025, ITCS 2026 . Some Organizational Activities Co-organizer of the workshop Eastern Great Lakes (EaGL) Theory of Computation Workshop. 2023, 2024 , 2025 DavidFest, a Pseudorandomness Workshop in honor of David Zuckerman's 60th birthday. Co-organizer of the workshop Beyond the Boolean Cube in the program Analysis and TCS: New Frontiers at the Simons Institute, UC Berkeley. Summer 2023 Co-organizer of the workshop Cornell Junior Theorists' Workshop. 2023, 2024 Co-organizer of the workshop titled Randomness Extractors: Constructions and Applications in STOC 2018 Funding: NSF CCF-2514586 , Sloan Research Fellowship, NSF CAREER Award, NSF CRII Other writings Invited survey article: A Recipe for Constructing Two-Source Extractors ACM SIGACT News Complexity Theory Column , June 2020 issue General audience article: How random is your randomness, and why does it matter? with David Zuckerman. Personal: I am married to the wonderful Soubhagya Chattopadhyay.",
  "content_length": 2460,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:44"
}