{
  "name": "Eshed Ohn-Bar",
  "homepage": "https://eshed1.github.io",
  "status": "success",
  "content": "Eshed Ohn-Bar About | News | Team | Publications | Activity | Scholar Eshed Ohn-Bar Assistant Professor Boston University Email: eohnbar [at] gmail [dot] com About At Boston University, I'm heading the Human-to-Everything (H2X) Lab. Our overarching goal is to develop intelligent technologies with robust autonomy and real-time assistance capabilities. Our research spans machine intelligence, computer vision, and systems for human-machine interaction. I'm looking for two PhD students this year. If you are interested in joining the lab to research machine learning and perception for intelligent systems, please email me your CV. News Thank you NSF for a CAREER award on personalizing multimodal agents from user feedback! I'm honored to have received the 2025 BU College of Engineering Early Career Excellence in Research Award. We are co-organizing the fourth workshop on accessibility, computer vision, and agent systems at CVPR 2025 [website and challenge] Read about our collaboration with Motional to ensure autonomous vehicles are accessible to individuals with visual impairments. Thank you NSF for supporting our research in robust mobile systems (grant IIS-2152077). Our Senior Design Project received the BU Engineering Design Excellence Award! We are semifinalists in the DOT Inclusive Design Challenge! Press release More info Best paper award at the Web for All conference. Received a Humboldt fellowship, visiting MPI and working with Andreas Geiger. I am honored to have received the 2017 IEEE Intelligent Transportation Systems Society best PhD dissertation award. Best Student Paper Award Finalist at ICPR 2016. Best Industry Related Paper Award Finalist at ICPR 2014. Best Paper Award at CVPR-AMFG 2013. Team Zhongkai Shangguan (PhD) Hee Jae Kim (PhD) Lei Lai (PhD) Masaki Kuribayashi (PhD, Visiting from Waseda University) Maolin Wei (PhD) Seyed Reza Sajjadinasab (PhD) Jiatong Guo (PhD) Zekai Yin (MS) Adwait Kulkarni (MS) Gaston Longhitano (MS) Tianyou Lou (BS) Shival Shah (BS) Varsha Singh (BS) Audrey Wang (BS) Matthew Kweon (BS) Kevin Liu (BS) Lillian Chung (BS) Past Members Jim Zhang (now at Zoox) Ruizhao Zhu (now at Amazon) Wanzhou Liu (now at UPitt) Zanming Huang (now at OSU) Jason Lee (now at UoWash, Ai2) Shuhei Fujita (now at Arista) Fadi Kidess (now at BU, PhD) Kathakoli Sengupta (now at Wicket) Mariia Kharchenko (now at UMD) Kevin Vogt-Lowell (now at MIT) Shun Zhang (now at UCSD) Luca Guidi (now at UIUC) Matt Boyd (now at MIT) Minglan Zheng (now at CMU) Ameera Iftekhar (now at Anduril) Anish Yennapusa (now at AWS) For code and project pages, please see our GitHub repo. Publications 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 2024 Text to Blind Motion H. Kim, K. Sengupta, M. Kuribayashi, H. Kacorri, E. Ohn-Bar Neural Information Processing Systems (NeurIPS), 2024 [project page] Scalable Early Childhood Reading Performance Prediction Z. Shangguan, Z. Huang, E. Ohn-Bar, O. Ozernov-Palchik, D. Kosty, M. Stoolmiller, H. Fien Neural Information Processing Systems (NeurIPS), 2024 [project page] Unified Local-Cloud Decision-Making via Reinforcement Learning K. Sengupta, Z. Shangguan, S. Bharadwaj, S. Arora, E. Ohn-Bar, and R. Mancuso European Conference on Computer Vision (ECCV), 2024 [project page] Neural Volumetric World Models for Autonomous Driving Z. Huang, J. Zhang, and E. Ohn-Bar European Conference on Computer Vision (ECCV), 2024 [project page] Motion Diversification Networks H. Kim and E. Ohn-Bar Conference on Computer Vision and Pattern Recognition (CVPR), 2024 [project page] Feedback-Guided Autonomous Driving (highlight, top 2.8% of submissions) J. Zhang, Z. Huang, A. Ray, and E. Ohn-Bar Conference on Computer Vision and Pattern Recognition (CVPR), 2024 [project page] Uncertainty-Guided Never-Ending Learning to Drive L. Lai, E. Ohn-Bar, S. Arora, and J. Yi Conference on Computer Vision and Pattern Recognition (CVPR), 2024 [project page] 2023 Learning to Drive Anywhere R. Zhu, P. Huang, E. Ohn-Bar, and V. Saligrama Conference on Robot Learning (CoRL), 2023 [project page] XVO: Generalized Visual Odometry via Cross-Modal Self-Training L. Lai, Z. Shangguan, J. Zhang, and E. Ohn-Bar International Conference on Computer Vision (ICCV), 2023 [project page] Coaching a Teachable Student (highlight, top 2.6% of submissions) J. Zhang, Z. Huang, and E. Ohn-Bar Computer Vision and Pattern Recognition (CVPR), 2023 [project page] 2022 ASSISTER: Assistive Navigation via Conditional Instruction Generation Z. Huang*, Z. Shangguan*, J. Zhang, G. Bar, M. Boyd, and E. Ohn-Bar European Conference on Computer Vision (ECCV), 2022 [code] SelfD: Self-Learning Large-Scale Driving Policies From the Web J. Zhang, R. Zhu, and E. Ohn-Bar Computer Vision and Pattern Recognition (CVPR), 2022 [data] 2021 X-World: Accessibility, Vision, and Autonomy Meet J. Zhang*, M. Zheng*, M. Boyd, and E. Ohn-Bar International Conference on Computer Vision (ICCV), 2021 [evaluation server and data] Learning by Watching J. Zhang and E. Ohn-Bar Computer Vision and Pattern Recognition (CVPR), 2021 2020 Learning Situational Driving E. Ohn-Bar, A. Prakash, A. Behl, K. Chitta, and A. Geiger Computer Vision and Pattern Recognition (CVPR), 2020 Exploring Data Aggregation in Policy Learning for Vision-based Urban Autonomous Driving A. Prakash, A. Behl, E. Ohn-Bar, K. Chitta, and A. Geiger Computer Vision and Pattern Recognition (CVPR), 2020 Label Efficient Visual Abstractions for Autonomous Driving A. Behl, K. Chitta, A. Prakash, E. Ohn-Bar, and A. Geiger International Conference on Intelligent Robots and Systems (IROS), 2020 Virtual Navigation for Blind People: Transferring Route Knowledge to the Real-World J. Guerreiro, D. Sato, D. Ahmetovic, E. Ohn-Bar, K. Kitani, and C. Asakawa International Journal of Human-Computer Studies (IJHCS), 2020 Learning Context-Dependent Personal Preferences for Adaptive Recommendation K. Higuchi, H. Tsuchida, E. Ohn-Bar, Y. Sato, and K. Kitani ACM Transaction on Interactive Intelligent Systems (T-IIS), 2020 2019 A-EXP4: Online Social Policy Learning for Adaptive Robot-Pedestrian Interaction P. Jin, E. Ohn-Bar, K. Kitani, and C. Asakawa International Conference on Intelligent Robots and Systems (IROS), 2019 [pdf | bibtex] Forecasting Time-To-Collision from Monocular Video: Feasibility, Dataset, and Challenges A. Manglik, X. Weng, E. Ohn-Bar, and K. Kitani International Conference on Intelligent Robots and Systems (IROS), 2019 [pdf | demo | code | project | bibtex] Towards Understanding Interaction of Visually Impaired Navigators with Surrounding Pedestrians E. Ohn-Bar, J. Guerreiro, D. Ahmetovic, K. Kitani, and C. Asakawa H-Augmented Workshop, Robotics: Science and Systems (RSS), 2019 [pdf | bibtex] Impact of Expertise on Interaction Preferences for Navigation Assistance of Visually Impaired Individuals D. Ahmetovic, J. Guerreiro, E. Ohn-Bar, K. Kitani, and C. Asakawa Web for All Conference (W4A), 2019 Best Paper Award [pdf | bibtex] 2018 Personalized Dynamics Models for Adaptive Assistive Navigation Systems (oral presentation) E. Ohn-Bar, K. Kitani, and C. Asakawa 2nd Conference on Robot Learning (CoRL), Proceedings of Machine Learning Research, 2018 Acceptance rate: ~7% [pdf | data | bibtex] Variability in Reactions to Instructional Guidance during Smartphone-Based Assisted Navigation of Blind Users E. Ohn-Bar, J. Guerreiro, K. Kitani, and C. Asakawa International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp / IMWUT), 2018 Acceptance rate: ~20% [pdf | bibtex] Human-Interactive Subgoal Supervision for Efficient Inverse Reinforcement Learning X. Pan, E. Ohn-Bar, N. Rhinehart, Y. Xu, Y. Shen, and K. M. Kitani International Conference on Autonomous Agents and Multiagent Systems (AAMAS), 2018 Acceptance rate: 25% [pdf | bibtex] How Context and User Behavior Affect Indoor Navigation Assistance for Blind People J. Guerreiro, E. Ohn-Bar, D. Ahmetovic, K. Kitani, and C. Asakawa Web for All Conference (W4A), 2018 [pdf | bibtex] Modeling Expertise in Assistive Navigation Interfaces for Blind People E. Ohn-Bar, J. Guerreiro, D. Ahmetovic, K. Kitani, and C. Asakawa International Conference on Intelligent User Interfaces (IUI), 2018 Acceptance rate: 23% [pdf | bibtex] Environmental Factors in Indoor Navigation Based on Real-World Trajectories of Blind Users H. Kacorri, E. Ohn-Bar, K. Kitani, and C. Asakawa Conference on Human Factors in Computing Systems (CHI), 2018 Acceptance rate: 26% [pdf | bibtex] SmartPartNet: Part-Informed Person Detection for Body-Worn Smartphones H. Yu, E. Ohn-Bar, D. Yoo, and K. Kitani Winter Conf. on Applications of Computer Vision (WACV), 2018 Acceptance rate: 37% [pdf | bibtex] 2017 Are All Objects Equal? Deep Spatio-Temporal Importance Prediction in Driving Videos E. Ohn-Bar and M. Trivedi Pattern Recognition (PR), 2017 Impact factor: 5.898 [pdf | data and code | project | bibtex] RefineNet: Refining Object Detectors for Autonomous Driving R. N. Rajaram, E. Ohn-Bar, and M. Trivedi IEEE Transactions on Intelligent Vehicles (T-IV), 2017 [pdf | bibtex] Contextual Visual Object Recognition and Behavior Modeling for Human-Robot Interactivity E. Ohn-Bar PhD Thesis, 2017 [pdf] Multi-scale Volumes for Deep Object Detection and Localization E. Ohn-Bar and M. Trivedi Pattern Recognition (PR), 2017 Impact factor: 5.898 [pdf | data | bibtex] 2016 Looking at Humans in the Age of Self-Driving and Highly Automated Vehicles E. Ohn-Bar and M. Trivedi IEEE Transactions on Intelligent Vehicles (T-IV), 2016 [pdf | bibtex] Long-term, Multi-Cue Tracking of Hands in Vehicles A. Rangesh, E. Ohn-Bar, and M. Trivedi IEEE Transactions on Intelligent Transportation Systems (T-ITS), 2016 Impact factor: 5.74 [pdf | data | bibtex] Looking at Pedestrians at Different Scales: A Multiresolution Approach and Evaluations R. N. Rajaram, E. Ohn-Bar, and M. Trivedi IEEE Transactions on Intelligent Transportation Systems (T-ITS), 2016 Impact factor: 5.74 [pdf | bibtex] What Makes an On-road Object I",
  "content_length": 16459,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:44"
}