{
  "name": "Esther Salamí San Juan",
  "homepage": "https://icarus.upc.edu/en/staff-and-collaborators/staff",
  "status": "success",
  "content": "Faculty — Intelligent Communications and Avionics for Robust Unmanned Aerial Systems. ICARUS — UPC. Universitat Politècnica de Catalunya Intelligent Communications and Avionics for Robust Unmanned Aerial Systems. ICARUS Dr. Cristina Barrado Muxí - Associate Professor Computer Architecture Department Universitat Politècnica de Catalunya (UPC) Office C4-013 Esteve Terradas, 7, 08860 Castelldefels (Barcelona), Catalonia - Spain Tel: +34 93 413 72 08 e-mail: cristina.barrado [at] upc.edu Cristina Barrado was born in Barcelona and is a Computer Science Engineer from the Barcelona School of Informatics (Facultat d'Informàtica de Barcelona, FIB) which belongs to the Technical  University of Catalonia (Universitat Politècnica de Catalunya, UPC). She also holds a Ph.D. in Computer Architecture from the same university. Dr. Barrado has been working with UPC since 1989 and currently, she is an associate professor at the School of Telecommunications and Aerospace Engineering of Castelldefels (Escola d'Enginyeria de Telecommunicació i Aeroespacial de Castelldefels, EETAC). Dr. Barrado is currently leading the UAS research activities of the ICARUS research group. Before she was working on the field of parallel computing and automatic compiling. Her PhD Thesis was a proposal for software pilelining of innermost loops using hamiltonian cycles in the data dependence graph. Dr. Barrado participated also in two European projects for scheduling and synchronizing of tasks generated automatically from a finite element linear and non-linear solver. She has been vice-rector of the UPC during the period 2002-2006. From 2006 her research in centered within the ICARUS group. Dr. Enric Pastor Llorens - Associate Professor Computer Architecture Department Universitat Politècnica de Catalunya (UPC) Office C4-102 Esteve Terradas, 7, 08860 Castelldefels (Barcelona), Catalonia - Spain Tel: +34 93 413 71 03 e-mail: enric.pastor [at] upc.edu Enric Pastor was born in Barcelona and is a Computer Science Engineer from the Barcelona School of Informatics (Facultat d'Informàtica de Barcelona, FIB) which belongs to the Technical  University of Catalonia (Universitat Politècnica de Catalunya, UPC). He also holds a Ph.D. in Computer Architecture from the same university. Dr. Pastor has been working with UPC since 1992 and currently, he is an associate professor at the School of Telecommunications and Aerospace Engineering of Castelldefels (Escola d'Enginyeria de Telecommunicació i Aeroespacial de Castelldefels, EETAC). Dr. Pastor co-founded the ICARUS research group and is currently leading it. Before that, his research interests were the development of CAD tools for the automatic design of  synchronous and asynchronous circuits, and CAV tools for the formal verification of concurrent systems. He has published more than 30 journals and conference papers in these fields. Dr. Xavier Prats i Menéndez - Serra i Húnter fellow (Associate Professor) Department of Physics - Aerospace Division Universitat Politècnica de Catalunya (UPC) Office C3-104 Esteve Terradas, 5, 08860 Castelldefels (Barcelona), Catalonia - Spain Tel: +34 93 413 41 25 e-mail: xavier.prats [at] upc.edu Follow @XPratsUPC Xavier Prats was born in Girona and is an Aeronautical Engineer from the National School for Civil Aviation (École Nationale de l'Aviation Civile, ENAC) located in Toulouse (France). He also holds a degree in Telecommunications Engineering from Telecom Barcelona (Escola Tècnica Superior d'Enginyeria de Telecomunicació de Barcelona, ETSETB) which belongs to the Technical  University of Catalonia (Universitat Politècnica de Catalunya, UPC). He received his Ph.D in Aerospace Science and Technology from the same university. Dr. Prats has been working with UPC since 2001 and currently, he is an assistant professor at the School of Telecommunications and Aerospace Engineering of Castelldefels (Escola d'Enginyeria de Telecommunicació i Aeroespacial de Castelldefels, EETAC). Dr. Prats co-founded the ICARUS research group and is currently leading the Air Transportation research activities within it. Before that, he was a researcher of gAGE group at UPC (2002-2005), where he investigated in the domain of satellite navigation systems for civil aviation. Then,  he joined the Advanced Control Systems group (SAC), also at UPC where he developed his doctoral thesis work on aircraft trajectory optimisation. For more information and the complete list of publications, visit his personal homepage. Dr. Angélica Reyes - Assistant Professor Computer Architecture Department Universitat Politècnica de Catalunya (UPC) Office C4-011 Esteve Terradas, 7, 08860 Castelldefels (Barcelona), Catalonia - Spain Tel: +34 93 413 72 20 e-mail: mreyes [at] ac.upc.edu Angelica Reyes is an associate professor in the Computer Architecture Department at the Technical University of Catalonia (UPC), Spain, where she is a member of the Intelligent Communications and Avionics for Robust Unmanned Aerial Systems Research Group. She received her Ph.D. from the UPC in 2003. Her current research interests are in the area of distributed computing, vehicular area networks and unmanned aerial systems. Dr. Pablo Royo Chic - Assistant Professor Computer Architecture Department Universitat Politècnica de Catalunya (UPC) Office C4-006 Esteve Terradas, 7, 08860 Castelldefels (Barcelona), Catalonia - Spain Tel: +34 93 413 71 08 e-mail: pablo.royo [at] upc.edu Pablo Royo was born in Fraga in 1982 and is a Telecommunications Engineer from the School of Telecommunications and Aerospace Engineering of Castelldefels (EETAC) which belongs to the Technical University of Catalonia (UPC). He also holds a Ph.D. in Computer Architecture from the same university. Dr. Royo has been working with UPC since 2006 and currently, he is a lecturer at the EETAC. His research interests include the integration of UAS in non-segregated airspace and the UAS new architectures for the Integration of UAS civil  applications. Dr. Esther Salamí San Juan - Assistant Professor Computer Architecture Department Universitat Politècnica de Catalunya (UPC) Office C4-004 Esteve Terradas, 7, 08860 Castelldefels (Barcelona), Catalonia - Spain Tel: +34 93 413 72 36 e-mail: esther.salami [at] upc.edu Esther Salamí was born in Barcelona and is a Telecommunications Engineer from Telecom Barcelona (Escola Tècnica Superior d'Enginyeria de Telecomunicació de Barcelona, ETSETB) which belongs to the Technical  University of Catalonia (Universitat Politècnica de Catalunya, UPC). She received her Ph.D in Telecommunications Engineering from the same university. Dr. Salamí has been working with UPC since 1998 and currently, he is an associate professor at the School of Telecommunications and Aerospace Engineering of Castelldefels (Escola d'Enginyeria de Telecommunicació i Aeroespacial de Castelldefels, EETAC). For more information and the complete list of publications, visit her personal homepage. Dr. Miguel Valero García - Full Professor Computer Architecture Department Universitat Politècnica de Catalunya (UPC) Office C4-012 Esteve Terradas, 7, 08860 Castelldefels (Barcelona), Catalonia - Spain Tel: +34 93 413 71 06 e-mail: miguel.valero [at] upc.edu Miguel Valero is a Computer Science Engineer from the Barcelona School of Informatics (Facultat d'Informàtica de Barcelona, FIB) which belongs to the Technical  University of Catalonia (Universitat Politècnica de Catalunya, UPC). He also holds a Ph.D. in Computer Architecture from the same university. Dr. Pastor has been working with UPC since 1989 and currently, he is a full professor at the School of Telecommunications and Aerospace Engineering of Castelldefels (Escola d'Enginyeria de Telecommunicació i Aeroespacial de Castelldefels, EETAC). For more information and the complete list of publications, visit his personal homepage. Navigation",
  "content_length": 7863,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:53"
}