{
  "name": "Estrid He",
  "homepage": "https://www.rmit.edu.au/contact/staff-contacts/academic-staff/h/he-dr-estrid",
  "status": "success",
  "content": "Estrid He - RMIT University Estrid He SKIP TO CONTENT Search field Search Search RMIT Australia RMIT Europe RMIT Global RMIT Vietnam RMIT UP RMIT Online Students Alumni Staff Library RMIT Online Courses Courses by study area Undergraduate courses Postgraduate courses Vocational studies Pre-university studies Online courses and degrees Entry pathways Single courses Short courses and microcredentials Courses for international students Contact Study@RMIT Study with us How to apply Fees Scholarships School leaver information Student services Student experience Key dates Frequently asked questions Parents Career advisers Contact Study@RMIT Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Contact Study@RMIT About News Events Maps Careers Contact us Our strategy Governance & management Schools & colleges Respect for Australian Indigenous cultures Our locations and facilities Our heritage Regenerative Futures Research Our research Partnerships Impact Contact Centres and collaborations Research degrees Find researchers Partner Recruit students and graduates Workforce development Collaborate with RMIT Research partnerships Facilities, equipment and services Contact Industry Engagement Giving to RMIT International Study in Australia Apply to RMIT as an international student Courses for international students Contact Study@RMIT Fees and scholarships for international students International student services Key dates and intake information for international students Frequently asked questions Estrid He Dr. Estrid He Senior Lecturer See full profile Details College: School of Computing Technologies Department: School of Computing Technologies Campus: City Campus Australia estrid.he@rmit.edu.au ORCID: 0000-0002-8994-9532 Open to Masters Research or PhD student supervision About Dr Estrid He is a senior lecturer at RMIT University. Estrid was awarded PhD from University of Melbourne in July 2020, where she also worked as a postdoctoral research fellow. Her research primarily focuses on natural language processing, with an emphasis on its applications to data mining and knowledge extraction. She is also passionate about techniques for enhancing the security, safety, and efficiency of existing deep learning models. Expand for full bio Collapse bio Supervisor projects Predicting brain disorders with graph learning 16 Jun 2025 Enhancing Clinical Decision Support Systems through Multimodal Data Mining of Electronic Health Records 23 May 2025 Develop a course and job recommendation system for technological universities using advanced deep learning techniques. 7 Apr 2025 Towards efficient video processing through multimodal foundation models 13 Feb 2025 Health data mining for predicting dementia 20 Jan 2025 Cross-modal information extraction of chemical knowledge 17 Jan 2025 Integration of Spiking Neural Networks with Large Language Models 3 Dec 2024 Optimizing Transfer Learning Domain Generalization 2 Dec 2024 AI Powered RNA Folding and Function Prediction 4 Apr 2024 Enhancing Social Cohesion and Contextual Fairness through Privacy-Preserving Analysis of Heterogeneous Urban Sensing Data using AI 4 Jan 2024 Design and Implementation of an energy-efficient recommendation system and enhance data security through Blockchain in the cloud server. 23 Oct 2023 Enhanced geo-spatial data analytics with large language models 6 Oct 2023 Freeing up hundreds of thousands of researcher hours automating systematic reviews 2 May 2023 Privacy Preservation in Machine Learning Algorithms 30 Mar 2023 Understanding social difficulty and clinical conditions using machine learning 29 Nov 2022 AI in communications for remote healthcare 24 Oct 2022 Neural Network Algorithm and Hardware Accelerator for Optical-wireless Communication Systems 1 Feb 2022 Research interests Data Mining, Natural Language Processing, Deep Learning Acknowledgement of Country RMIT University acknowledges the people of the Woi wurrung and Boon wurrung language groups of the eastern Kulin Nation on whose unceded lands we conduct the business of the University. RMIT University respectfully acknowledges their Ancestors and Elders, past and present. RMIT also acknowledges the Traditional Custodians and their Ancestors of the lands and waters across Australia where we conduct our business - Artwork 'Sentient' by Hollie Johnson, Gunaikurnai and Monero Ngarigo. More information News Events Library Maps Careers Contacts Study with Us Levels of study Online courses and degrees Single courses Applying to RMIT International students Parents Careers advisers Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Research Our research Centres and collaborations Partnerships Research degrees Find researchers Research contacts Partner Workforce development Staff development and training Research partnerships Facilities and equipment services Giving About Our strategy Governance and management Values Sustainability Schools and colleges Our locations and facilities Copyright © 2025 RMIT University | Terms | Privacy | Accessibility | Website feedback | Complaints | ABN 49 781 030 034 | CRICOS provider number: 00122A | TEQSA provider number: PRV12145 | RTO Code: 3046 | Open Universities Australia | RMIT Training Pty Ltd, trading as RMIT University Pathways (RMIT UP), CRICOS Provider Code: 01912G",
  "content_length": 5410,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:53"
}