{
  "name": "Ethan L. Miller",
  "homepage": "https://users.soe.ucsc.edu/~elm",
  "status": "success",
  "content": "Ethan L. Miller, Computer Science and Engineering Dept, University of California Santa Cruz Research Schedule Publications Home Ethan L. Miller Professor Emeritus, Computer Sci & Eng Veritas Presidential Chair Emeritus Information CV ORCID: 0000-0003-2994-9060 NSF IUCRC Center for Research in Storage Systems Storage Systems Research Center Pubs on Google Scholar Current & past students Public key Software & LaTeX files Git tools and tutorials UCSC IEEE Senior Members Teaching 2023–24 None (emeritus) Undergraduate Principles of computer systems design Embedded operating systems Computer architecture Computer security Distributed systems Graduate Advanced topics in computer engineering Advanced topics in computer systems Operating systems Storage systems Distributed systems Computer security Visiting UCSC Campus info (Google Map) Personal Personal home page Personal blog Photos Computer Science and Engineering Department Baskin School of Engineering University of California 1156 High Street, MS SOE3 Santa Cruz, CA 95064 Admin: Cynthia McCarley E-mail: elm «at» ucsc·edu GTalk: elm®ucsc·edu Office: +1 (831) 459-1222 Cell: +1 (831) 295-8432 FAX: +1 (831) 459-1041 All of my contact info is in this vCard. Office: 337A Engineering 2 Hours: By appointment only I retired from active service at UC Santa Cruz on July 1, 2023. Please read this blog post for details. Since I am an emeritus faculty member, I don't have regular teaching duties or service duties. My plan is to continue my research collaborations with colleagues, including those in the Storage Systems Research Center. I don't plan to take on any new students as a primary advisor. However, I will consider co-advising students who want to study in specific research areas: secure file systems and data storage, archival storage and operating systems for non-volatile memories. If you have an interest in either of these areas and an outstanding strong background in computer systems, I'd be happy to consider co-advising you in a Ph.D. in those areas. I'm the Director Emeritus of the NSF I/UCRC Center for Research in Storage Systems (CRSS) and the Associate Director of the Storage Systems Research Center here at UC Santa Cruz, where I explore issues in file and storage systems and, more generally, distributed systems and operating systems. My current projects include file systems for next-generation storage technologies, archival storage systems, file system security, scalable file system indexing, and exascale storage systems. I'm also interested in storage system benchmarks, algorithms to more efficiently manage storage, and information retrieval from very large text and multimedia corpora as well as other problems in computer systems and security. I was named an ACM Distinguished Scientist in 2013, and an IEEE Fellow in 2014. My Erdös number is 3. Contacting me The best way to contact me is via e-mail (see address above). However, I only read email once or twice per day, so if you need a fast response to a short message, please use instant messaging. Voicemail messages aren't a good way to reach me, since I rarely check voicemail. If you want to meet me in person or arrange a phone call, please contact our group's admin, Cynthia McCarley, to set up a meeting time. Last updated 08 Jan 2024 by Ethan L. Miller (elm «at» ucsc·edu)",
  "content_length": 3331,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:56"
}