{
  "name": "Ethan Danahy",
  "homepage": "https://engineering.tufts.edu/cs/people/faculty/ethan-danahy",
  "status": "success",
  "content": "Ethan Danahy | Department of Computer Science Twitter Google Plus Center of Engineering Outreach Full Profile Career Highlights / Publications Research Professional Activities Courses / Teaching Activities Ethan Danahy Research Associate Professor, Center for Engineering Education Outreach Research Associate Professor, Computer Science ethan.danahy@tufts.edu 200 Boston Ave, Room G-810 Full Profile (facultyprofiles.tufts.edu) Twitter Google Plus Center of Engineering Outreach Full Profile Career Highlights / Publications Research Professional Activities Courses / Teaching Activities Research/Areas of Interest design, implementation, and evaluation of different educational technologies Education PhD, Tufts University, Medford, United States, 2007MS, Tufts University, Medford, United States, 2002BS, Tufts University, Medford, United States, 2000 Biography Dr. Ethan Danahy is a Research Associate Professor at Tufts University's Center for Engineering Education and Outreach (CEEO) with a secondary appointment in the Department of Computer Science. He holds graduate degrees in Computer Science and Electrical Engineering from Tufts. Dr. Danahy focuses on designing, implementing, and evaluating educational technologies, exploring ways to enhance interactive pedagogies from K-12 to university classrooms. Specializing in STEAM areas, his work emphasizes creativity, innovation, better documentation, and collaborative learning. Alongside his research, Dr. Danahy serves as the Coordinator of First Year Engineering Courses and teaches courses in intro to engineering design and intro to computing. He also leads the Justice-based Engineering and Data Science Initiative (JEDI), integrating sociotechnical considerations and DEIJ principles into engineering education.He also holds the position of Research Associate Professor within the Department of Computer Science at Tufts University.",
  "content_length": 1900,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:56"
}