{
  "name": "Ettore Merlo",
  "homepage": "https://www.polymtl.ca/expertises/en/merlo-ettore",
  "status": "success",
  "content": "Merlo, Ettore | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Merlo, Ettore Poly Directory Courses Français Directory of Experts Merlo, Ettore Directory of Experts Back to search results Edit my profileHelp Publications Ettore Merlo M.Sc. (Turin), Ph.D. (McGill) Publications Full Professor Department of Computer Engineering and Software Engineering Phone: (514) 340-4711 Ext. 5758 Fax: (514) 340-5139 Room: M-4105 ettore.merlo@polymtl.ca Areas of expertise Cybersecurity Artificial intelligence Intelligent systems applications Software engineering Software and development Primary sphere of excellence in research New Frontiers in Information and Communication Technologies Secondary sphere(s) of excellence in research New Frontiers in Information and Communication Technologies Research interests and affiliations Research interests Software artifact analysis (static, dynamic, and symbolic analysis), Software similarity analysis, Clone detection, Software intellectual property protection, Software evolution analysis, Software re-engineering, Software maintenance, Architectural recovery, Software quality assessment, Software testing, Software application security, User interfaces analysis, Artificial intelligence, Machine learning, Pattern recognition, Bio-informatics. Affiliation(s) Institute for Data Valorization (IVADO), Member Expertise type(s) (NSERC subjects) 2800 ARTIFICIAL INTELLIGENCE (Computer Vision, use 2603) 2604 Intelligent systems applications 2706 Software engineering 2705 Software and development Publications Recent publications Dataset Qin, Q., Li, H., Merlo, E., & Lamothe, M. (2025). Automated, Unsupervised, and Auto-parameterized Inference of Data Patterns and Anomaly Detection [Dataset]. Conference paper Qin, Q., Li, H., Merlo, E., & Lamothe, M. (2025, April). Automated, Unsupervised, and Auto-Parameterized Inference of Data Patterns and Anomaly Detection [Paper]. 47th International Conference on Software Engineering (ICSE 2025), Ottawa, ON, Canada. Journal article Djian, B. P. P., Merlo, E., Gambs, S., & Ngueveu, R. C. (2025). Fairness Evaluation of Neural Networks Through Computational Profile Likelihood. Computational Intelligence, 41(5), 11 pages. Journal article Foalem, P. L., Da Silva, L. M. P., Khomh, F., Li, H., & Merlo, E. (2025). Logging requirement for continuous auditing of responsible machine learning-based applications. Empirical Software Engineering, 30(3), 97 (37 pages). See all publications (136) Teaching Génie du logiciel Analyse et évaluation du logiciel Réingénierie du logiciel. Supervision at Polytechnique COMPLETED Ph.D. Thesis (10) Cassagne, J. (2024). Modus Obfuscandi Analysis of Obfuscation Methods for Correlating Cyber Attacks [Ph.D. thesis, Polytechnique Montréal]. Morovati, M. (2024). Reliability Assessment Methods for Machine Learning-Based Systems [Ph.D. thesis, Polytechnique Montréal]. Laverdière-Papineau, M.-A. (2018). Finding Differences in Privilege Protection and their Origin in Role-Based Access Control Implementations [Ph.D. thesis, École Polytechnique de Montréal]. Sozen, N. (2016). Use of Model-Based Software Product Line Engineering for Certifiable Avionics Software Development [Ph.D. thesis, École Polytechnique de Montréal]. Lavoie, T. M. (2015). Leveraging Software Clones for Software Comprehension: Techniques and Practice [Ph.D. thesis, École Polytechnique de Montréal]. Gauthier, F. (2014). Reverse-Engineering and Analysis of Access Control Models in Web Applications [Ph.D. thesis, École Polytechnique de Montréal]. Letarte, D. (2011). Détection, protection, évolution et test de défaillances à l'aide d'un modèle inter-procédural simple [Ph.D. thesis, École Polytechnique de Montréal]. Coallier, F. (2006). Les pratiques en informatique d'entreprise : un modèle intégrateur [Ph.D. thesis, École Polytechnique de Montréal]. Antoniol, G. (2003). Recovery of traceability links in software artifacts and systems [Ph.D. thesis, École Polytechnique de Montréal]. Ho, T. V. (1999). Un réseau de neurones à décharges pour la reconnaissance de processus spatio-temporels [Ph.D. thesis, École Polytechnique de Montréal]. Master's Thesis (15) Djian, B. P. P. (2025). Computational Profile Likelihood for Fairness Evaluation and Correction of Deep Neural Network Classifiers [Master's thesis, Polytechnique Montréal]. El Aoufir, M. Y. (2023). Classification of Methane Satellite Image Retrievals [Master's thesis, Polytechnique Montréal]. Marhaba, M. (2022). Analysis of CNN Computational Profile Likelihood on Adversarial Attacks and Affine Transformations [Master's thesis, Polytechnique Montréal]. Margier, M. (2021). Analyse de similarité de kits de phishing en PHP, HTML et JavaScript [Master's thesis, Polytechnique Montréal]. Julien, K. (2019). Différences de protection entre les versions d'un logiciel : étude de cas des changements, liens causaux et perspectives pour la réparation automatique des défaillances [Master's thesis, Polytechnique Montréal]. Cloutier, N. (2018). Change-Based Approaches for Static Taint Analyses [Master's thesis, École Polytechnique de Montréal]. Ouellet, M. (2012). Localisation de fonctionnalités par analyse statique dans du code avionique configuré dynamiquement [Master's thesis, École Polytechnique de Montréal]. Lavoie, T. M. (2011). Analyse des propriétés structurelles et computationnelles des clones logiciels [Master's thesis, École Polytechnique de Montréal]. Najem, M. (2009). Model-Checking symbolique pour la vérification de systèmes et son application aux tables de décision et aux systèmes d'éditions collaboratives distribuées [Master's thesis, École Polytechnique de Montréal]. Sandoval, J. (2009). Analyse de liaison dynamique entre gènes candidats et phénotypes associés à la pression artérielle au cours de tests physiologiques [Master's thesis, École Polytechnique de Montréal]. Brunelle, P.-L. (2008). Correction par simulations de tests multiples dans les études d'association génomique familiale [Master's thesis, École Polytechnique de Montréal]. Letarte, D. (2006). Identification de méthodes pour l'évaluation des grammaires de langues naturelles [Master's thesis, École Polytechnique de Montréal]. Balazinska, M. (1999). Reconception de systèmes orientés-objet basée sur l'analyse des clones [Master's thesis, École Polytechnique de Montréal]. Lapierre, S. (1998). Génération automatique de données de test visant la couverture des branches de logiciels écrits en langage C/C++ [Master's thesis, École Polytechnique de Montréal]. Audette, A. (1994). Étude de l'applicabilité des spécifications algébriques à un logiciel existant dans le domaine de la CFAO [Master's thesis, École Polytechnique de Montréal]. Press review about Ettore Merlo June 8, 2020, Le Devoir, Il ne faut pas prendre à la légère la sécurité des outils de recherche de contacts Lettre d'opinion signée par Nora Boulahia Cuppens, Frédéric Cuppens, Michel Dagenais, José Manuel Fernandez, Ettore Merlo et Gabriela Nicolescu, professeurs au Département de génie informatique et génie logiciel de Polytechnique Montréal. Propective StudentStudent ZoneEmployee ZoneMediaFondation & AlumniEmergencyJobs Offers Studies Studies (Registrar)Programs of StudiesSchedule and Courses DirectoryLibraryDepartmentsFinancial Assistance & Bursaries*Technical Societies*Internships & JobsOffice of Student Affairs*Go-Poly Research General Informations*Directory of ExpertsChairs, Groups & LaboratoriesResearch Projects for Graduate Students Company Hiring an Intern or a GraduateAcquiring a TechnologyConducting Partnered Research*Accessing our Research Infrastructure#Develop your Employees About Us General InformationsOfficial DocumentsInternationalWomen & EngineeringSustainable Development*Propolys (Entrepreneuship Support)*GouvernanceDirectories & ServicesPrivacy Notice and Terms of useAccessibilityContact Information & Campus Maps 2500, chemin de Polytechnique Montréal (Québec) H3T 1J4 (514) 340-4711 Follow us! Make a donation",
  "content_length": 8593,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:01"
}