{
  "name": "Euan Freeman",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/euanfreeman",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Euan Freeman Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Euan FreemanMr Ethan KellyZhen Tian Dr Euan Freeman Lecturer (School of Computing Science) telephone: 01413302333 email: Euan.Freeman@glasgow.ac.uk 220A, School of Computing Science, Sir Alwyn Williams Building, Lilybank Gardens Import to contacts https://orcid.org/0000-0002-6586-6951 Biography I am a Lecturer in the Glasgow Interactive Systems Section. My research explores new haptic interaction techniques, to create new digital experiences that take full advantage of our sense of touch and our physical capabilities. My work covers several aspects of haptic interaction, including mid-air gestures, vibrotactile feedback and ultrasound haptic interaction. I also have expertise in acoustic levitation and tangible interaction. I have worked alongside Huawei, Nokia, and Ultraleap. Read more about my work at my personal website: euanfreeman.co.uk Research interests My vision is of computing devices that take advantage of our haptic perceptual capabilities, so that we experience the digital world with the same richness of experience as the physical world. Current computing devices have high definition audio and visual output, but fail to take advantage of our sense of touch. My work addresses this gap. I am generally interested in all areas of haptics, but have expertise in ultrasound haptic feedback and mid-air gesture interaction. Previous projects: LEVITATE: funded by the European Union's H2020 program (#737087, PI: Stephen Brewster), see euanfreeman.co.uk/levitate/ ABBI (Audio Bracelet for Blind Interaction): funded by the EC, see: euanfreeman.co.uk/research/#abbi Research groupsGlasgow Interactive Systems Publications Selected publications Khan, Saiful, Nguyen, Phong H., Abdul-Rahman, Alfie, Bach, Benjamin, Chen, Min, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951 and Turkay, Cagatay (2022) Propagating Visual Designs to Numerous Plots and Dashboards. IEEE Transactions on Visualization and Computer Graphics, 28(1), pp. 86-95. (doi: 10.1109/TVCG.2021.3114828) (PMID:34587060) Rakkolainen, Ismo, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Sand, Antti, Raisamo, Roope and Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 (2021) A survey of mid-air ultrasound haptics and its applications. IEEE Transactions on Haptics, 14(1), pp. 2-19. (doi: 10.1109/TOH.2020.3018754) Mcgill, Mark, Kehoe, Aidan, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951 and Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 (2020) Expanding the bounds of seated virtual workspaces. ACM Transactions on Computer-Human Interaction, 27(3), 13. (doi: 10.1145/3380959) Dhandapani, Gloria, Ferguson, Jamie and Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951 (2021) HapticLock: Eyes-Free Authentication for Mobile Devices. In: 23rd ACM International Conference on Multimodal Interaction (ICMI ’21), Montréal, QC, Canada, 18-22 Oct 2021, pp. 195-202. ISBN 978145038481-0 (doi: 10.1145/3462244.3481001) Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 and Lantz, Vuokko (2016) Do That, There: An Interaction Technique for Addressing In-Air Gesture Systems. In: CHI 2016, San Jose, CA, USA, 7-12 May 2016, (doi: 10.1145/2858036.2858308) Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951 (2021) Enhancing Ultrasound Haptics with Parametric Audio Effects. In: 23rd ACM International Conference on Multimodal Interaction (ICMI ’21), Montréal, QC, Canada, 18-22 Oct 2021, pp. 692-696. ISBN 9781450384810 (doi: 10.1145/3462244.3479951) Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 and Lantz, Vuokko (2014) Tactile Feedback for Above-Device Gesture Interfaces. In: 16th International Conference on Multimodal Interaction, Istanbul, Turkey, Nov 12-16 2014, pp. 419-426. ISBN 9781450328852 (doi: 10.1145/2663204.2663280) Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951 and Wilson, Graham (2021) Perception of Ultrasound Haptic Focal Point Motion. In: 23rd ACM International Conference on Multimodal Interaction (ICMI ’21), Montréal, QC, Canada, 18-22 Oct 2021, pp. 697-701. ISBN 9781450384810 (doi: 10.1145/3462244.3479950) Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Wilson, Graham, Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899, Baud-Bovy, Gabriel, Magnusson, Charlotte and Caltenco, Hector (2017) Audible Beacons and Wearables in Schools: Helping Young Visually Impaired Children Play and Move Independently. In: CHI '17: CHI Conference on Human Factors in Computing Systems, Denver, CO, USA, 6-11 May 2017, pp. 4146-4157. ISBN 9781450346559 (doi: 10.1145/3025453.3025518) Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Williamson, Julie ORCID: https://orcid.org/0000-0002-1816-1393, Subramanian, Sriram and Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 (2018) Point-and-Shake: Selecting from Levitating Object Displays. In: 2018 CHI Conference on Human Factors in Computing Systems, Montréal, QC, Canada, 21-26 Apr 2018, p. 18. ISBN 9781450356206 (doi: 10.1145/3173574.3173592) Cronin, Sean, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951 and Doherty, Gavin (2022) Investigating Clutching Interactions for Touchless Medical Imaging Systems. In: 2022 CHI Conference on Human Factors in Computing Systems (CHI '22), New Orleans, LA, USA, 30 Apr - 05 May 2022, p. 351. ISBN 9781450391573 (doi: 10.1145/3491102.3517512) All publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012Number of items: 46.2025 Di Campli San Vito, Patrizia ORCID: https://orcid.org/0000-0002-2499-8464, Macdonald, Shaun Alexander ORCID: https://orcid.org/0000-0001-6519-318X, Wilson, Graham, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951 and Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 (2025) The future of tactile haptics: emerging technologies and novel applications. In: Vanderdonckt, Jean, Palanque, Philippe and Winckler, Marco (eds.) Handbook of Human Computer Interaction. Springer: Cham. ISBN 9783319276489 (doi: 10.1007/978-3-319-27648-9_117-1) Al-Taie, Ammar ORCID: https://orcid.org/0000-0002-5156-6245, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Pollick, Frank ORCID: https://orcid.org/0000-0002-7212-4622 and Brewster, Stephen Anthony ORCID: https://orcid.org/0000-0001-9720-3899 (2025) evARything, evARywhere, all at once: Exploring Scalable Holistic Autonomous Vehicle-Cyclist Interfaces. In: ACM CHI conference on Human Factors in Computing Systems (CHI 2025), Yokohama, Japan, 26 Apr - 01 May 2025, p. 82. ISBN 9798400713941 (doi: 10.1145/3706598.3713412) Waugh, Kieran ORCID: https://orcid.org/0000-0002-3748-4905, McGill, Mark and Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951 (2025) Everything to Gain: Combining Area Cursors with Increased Control-Display Gain for Fast and Accurate Touchless Input. In: ACM CHI conference on Human Factors in Computing Systems (CHI 2025), Yokohama, Japan, 26 Apr - 01 May 2025, p. 726. ISBN 9798400713941 (doi: 10.1145/3706598.3714021) Wilson, Graham, McCready, Jamie, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Mathis, Florian, Russell, Harvey and McGill, Mark (2025) InterFACE: Establishing a Facial Action Unit Input Vocabulary for Hands-Free Extended Reality Interactions, From VR Gaming to AR Web Browsing. In: ACM CHI 2025, Yokohama, Japan, 26 April - 1 May 2025, p. 607. ISBN 9798400713941 (doi: 10.1145/3706598.3713694) 2024 Macdonald, Shaun ORCID: https://orcid.org/0000-0001-6519-318X, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Pollick, Frank ORCID: https://orcid.org/0000-0002-7212-4622 and Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 (2024) Prototyping and evaluation of emotionally resonant vibrotactile comfort objects as a calming social anxiety intervention. ACM Transactions on Computer-Human Interaction, 31(4), pp. 1-48. 46. (doi: 10.1145/3648615) Al Taie, Ammar Jamal Said ORCID: https://orcid.org/0000-0002-5156-6245, Wilson, Graham, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Pollick, Frank ORCID: https://orcid.org/0000-0002-7212-4622 and Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 (2024) Light it Up: Evaluating Versatile Autonomous Vehicle-Cyclist External Human-Machine Interfaces. In: ACM CHI Conference on Human Factors in Computing Systems 2024, Honolulu, Hawai'i, USA, 11-16 May 2024, ISBN 9798400703300 (doi: 10.1145/3613904.3642019) 2023 Waugh, Kieran, McGill, Mark and Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951 (2023) Proxemic Cursor Interactions for Touchless Widget Control. In: SUI '23: ACM Symposium on Spatial User Interaction Sydney NSW Australia, Sydney, NSW, Australia, 13-15 Oct 2023, ISBN 9798400702815 (doi: 10.1145/3607822.3614525) Bach, Benjamin, Freeman, Euan ORCID: https://orcid.org/0000-0002-6586-6951, Abdul-Rahman, Alfie, Turkay, Cagatay, Khan, Saiful, Fan, Yulei and Chen, Min (2023) Dashboard design patterns. IEEE Transacti",
  "content_length": 44038,
  "method": "requests",
  "crawl_time": "2025-12-01 13:07:59"
}