{
  "name": "Eugene Wu 0002",
  "homepage": "http://www.cs.columbia.edu/~ewu",
  "status": "success",
  "content": "Eugene Wu Eugene Wu Bio Eugene Wu is an associate professor of computer science at Columbia University. He is broadly interested in technologies that help users play with their data. His goal is for users at all technical levels to effectively and quickly make sense of their information. He is interested in solutions that ultimately improve the interface between users and data, and uses techniques borrowed from fields such as data management, systems, crowd sourcing, visualization, and HCI. Eugene Wu received his Ph.D. from MIT, B.S. from Cal, and was a postdoc in the AMPLab. A profile, an obit. Eugene Wu has received the VLDB 2018 10-year test of time award, best-of-conference citations at ICDE and VLDB, the SIGMOD 2016 best demo award, the NSF CAREER, and the Google, Adobe, and Amazon faculty awards. Info ewu@cs.columbia.edu 421 Mudd, 500 W 120th St Twitter: @sirrice BSky: @eugenewu.net Github: sirrice, cudbg OH: Thurs 11:30AM EST 421 Mudd CV Blog Co-Chair: Data, Media & Society Co-Director: DAPLab Advisor: CS+Journalism MS Dual Degree Member: Columbia DB, CS, DSI Joining My focus is on projects in the new Data, Agents, Processes Lab: operating and data systems to support agent automation in practice, and the applications they can enable. A new class of visual analytic systems is one part of it. I am broadly interested in problems where academic research has a competitive advantage. Applicants should read The PhD Application from a Faculty’s Perspective PhDs: read recent work of interest, provide evidence you can conduct research, include “bananas” in the subject line. Postdocs: how you can best make use of the lab? what’s a project we could work on? Include “satsuma” in the subject line. Interns + UGrad + Masters: Fill out this form. Unfortunately, due to time constraints, your best bet is to find and talk to a grad student in the lab instead of emailing me directly. Recent News July-2025: Columbia data management had a strong showing at SIGMOD 2025 with a test-of-time award, best demo award, best paper award at DEEM, 5 papers, a keynote, a workshop, a tutorial, and a panel! Nov-2023: Excited to present our vision of Task-based Dataset Search at CIDR 2024 in January and our vision about using documentation to tackle data ambiguity at the Table Representation Learning Workshop at NeurIPS 2023. Aug-2023: We will be presenting 4 papers at VLDB! Saibot brings differential privacy to task-based dataset search platforms, Joinboost trains decision trees, radom forests, and gradient boosted models within DBMSes faster than ML libraries like LightGBM and XGBoost, Pollock introduces a benchmark and grammar-based formalization for studying CSV loaders, and ConnectorX is the fastest way for DataFrame systems to load data from DBMSes. Excited to see folks in Vancouver! All Publications All Selected DB VIS ML LLM Data Search Please Don’t Kill My Vibe: Empowering Agents with Data Flow Control Charlie Summers, Haneen Mohammed, Eugene Wu CIDR 2026 Multi-Relational Algebra for Multi-Granular Data Analytics Xi Wu, Eugene Wu, Zichen Zhu, Fengan Li, Jeffrey F. Naughton ArXiv 2025 Lineage Capture Trade-offs: A Case Study in DuckDB Haneen Mohammed, Eugene Wu ProvWeek at SIGMOD 2025 DEMO: Fast Hypothetical Update Evaluation Haneen Hohammed, Alexander Yao, Charlie Summers, Hongbin Zhong, Gramit Yeuk-Yin Chan, Subrata Mitra, Lampros Flokas, Eugene Wu ProvWeek at SIGMOD 2025 Compression for High-Performance Lineage Xiaoyu Han, Haneen Mohammed, Charlie Summers, Eugene Wu ProvWeek at SIGMOD 2025 Talk Video Steering Semantic Data Processing With DocWrangler Shreya Shankar, Bhavya Chopra, Mawil Hasan, Stephen Lee, Bjoern Hartmann, Joseph Hellerstein, Aditya Parameswaran, Eugene Wu ArXiv 2025 Towards a Framework for Optimizing Hierarchical Text Segmentation using LLMs Lampros Flokas, Jeffrey Cao, Yujian Xu, Eugene Wu, Xu Chu, Cong Yu DEEM at SIGMOD 2025 Best Paper Award! Prompt Editor: A Taxonomy-driven System for Guided LLM Prompt Development in Enterprise Settings Jeffery Cao, Lampros Flokas, Yujian Xu, Eugene Wu, Xu Chu, Cong Yu SIGMOD Demo 2025 Best Industry Demo Award! Data Cleaning Using Large Language Models Shuo Zhang, Zezhou Huang, Eugene Wu DAIS Workshop at ICDE 2025 A Formalism and Library for Database Visualization Eugene Wu, Xiang Yu Tuang, Antonio Li, Vareesh Bainwala arXiV 2025 Suna: Scalable Causal Confounder Discovery over Relational Data Jiaxiang Liu, Siyuan Xia, Daniel Alabi, Eugene Wu VLDB 2025 Panel: Where Does Database Research Go From Here? Eugene Wu, Raul Castro Fernandez SIGMOD 2025 panel Tutorial: Privacy and Security in Distributed Data Markets Daniel Alabi, Sainyam Galhotra, Shagufta Mehnaz, Zeyu Song, Eugene Wu SIGMOD 2025 tutorial Slides Physical Visualization Design: Decoupling Interface and System Design Yiru Chen, Xupeng Li, Jeff Tao, Lana Ramjit, Ravi Netravali, Subrata Mitra, Aditya Parameswaran, Javad Ghaderi, Dan Rubenstein, Eugene Wu SIGMOD 2025 FaDE: More Than a Million What-ifs Per Second Haneen Mohammed, Alexander Yao, Lampros Flokas, Charlie Summers, Hongbin Zhong, Gramit Chan, Surata Mitra, Eugene Wu VLDB 2025 DocETL: Agentic Query Rewriting and Evaluation for Complex Document Processing Shreya Shankar, Aditya Parameswaran, Eugene Wu VLDB 2025 Blog Post: Where Does Database Research Go From Here? Eugene Wu SIGMOD Blog 2024 Kitana: A Data-as-a-Service Platform Zachary Huang, Pranav Subramaniam, Raul Fernandez, Eugene Wu In Review 2025 Database Theory in Action: Database Visualization Eugene Wu ICDT Database Theory in Action 2025 Slides Design-Specific Transformations in Visualization Eugene Wu, Remco Chang BELIV workshop at IEEE VIS 2024 Data-Centric Text-to-SQL with Large Language Models Zezhou Huang, Shuo Zhang, Kechen Liu, Eugene Wu Table Representation Learning at NeurIPS 2024 DynoClass: A Dynamic Table-Class Detection System Without the Need for Predefined Ontologies Haonan Wang, Kechen Liu, Jiaxiang Liu, Eugene Wu Table Representation Learning at NeurIPS 2024 Transform Table to Database Using Large Language Models Zezhou Huang, Jia Guo, Eugene Wu Tabular Data Analysis (TaDA) Workshop at VLDB2024 spade: Synthesizing Data Quality Assertions for Large Language Model Pipelines Shreya Shankar, Haotian Li, Parth Asawa, Madelon Hulsebos, Yiming Lin, J.D. Zamfirescu-Pereira, Harrison Chase, Will Fu-Hinthorn, Aditya G. Parameswaran, Eugene Wu VLDB 2025 Cocoon: Semantic Table Profiling Using Large Language Models Zachary Huang, Eugene Wu HILDA Workshop at SIGMOD 2024 SET: Searching Effective Supervised Learning Augmentations in Large Tabular Data Repositories Jerry Liu, Zachary Huang, Eugene Wu GUIDEAI Workshop at SIGMOD 2024 Lightweight Materialization for Fast Dashboards Over Joins Zachary Huang, Eugene Wu SIGMOD 2024 Data Ambiguity Strikes Back: How Documentation Improves GPT's Text-to-SQL Zezhou Huang, Pavan Kalyan, Eugene Wu Table Representation Learning Workshop at NeurIPS 2023 The Fast and the Private: Task-based Dataset Search Zezhou Huang, Jiaxiang Liu, Haonan Wang, Eugene Wu CIDR 2024 Slides JoinBoost: Grow Trees Over Normalized Data Using Only SQL Zezhou Huang, Rathijit Sen, Jiaxiang Liu, Eugene Wu VLDB 2023 Saibot: A Differentially Private Data Search Platform Zezhou Huang, Jiaxiang Liu, Daniel Alabi, Raul Castro Fernandez, Eugene Wu VLDB 2023 Pollock: A Data Loading Benchmark Gerardo Vitagliano, Mazhar Hameed, Lan Jiang, Lucas Reisener, Eugene Wu, Felix Naumann VLDB 2023 ConnectorX: Accelerating Data Loading From Databases to Dataframes Xiaoying Wang, Weiyuan Wu, Jinze Wu, Yizhou Chen, Nick Zrymiak, Changbo Qu, Lampros Flokas, George Chow, Jiannan Wang, Tianzheng Wang, Eugene Wu, Qingqing Zhou VLDB 2023 SmokedDuck Demonstration: SQLStepper Haneen Mohammed, Charlie Summers, Sughosh Kaushik, Eugene Wu SIGMOD Demo 2023 Teaching Data Science by Visualizing Data Table Transformations: Pandas Tutor for Python, Tidy Data Tutor for R, and SQL Tutor Sam Lau, Sean Kross, Eugene Wu, Philip Guo DataEd at SIGMOD 2023 Analysis Errors Over Semantic Layers and How To Avoid Them Zezhou Huang, Pavan Kalyan, Eugene Wu HILDA at SIGMOD 2023 DIG: The Data Interface Grammar Yiru Chen, Jeffrey Tao, Eugene Wu HILDA at SIGMOD 2023 Random Forests over Normalized Data in CPU-GPU DBMSes Zezhou Huang, Pavan Kalyan, Rathijit Sen, Eugene Wu DaMoN at SIGMOD 2023 OM3: An Ordered Multi-level Min-Max Representation for Interactive Progressive Visualization of Time Series Yunhai Wang, Yuchun Wang, Xin Chen, Yue Zhao, Fan Zhang, Eugene Wu, Chi-Wing Fu, Xiaohui Yu SIGMOD 2023 NL2INTERFACE: Interactive Visualization Interface Generation from Natural Language Queries Yiru Chen, Ryan Li, Austin Mac, Tianbao Xie, Tao Yu, Eugene Wu VIS nlviz workshop 2022 How Do Captions Affect Visualization Reading? Shelly Cheng, Hazel Zhu, Eugene Wu VIS Viscomm 2022 Extending the View Composition Algebra to Hierarchical Data Eugene Wu arXiV 2022 A Grammar for Hypothesis-Driven Visual Analysis Ashley Suh, Yilan Jiang, Ab Mosca, Eugene Wu, Remco Chang ArXiV 2022 A Sensorless Drone-based System for Mapping Indoor 3D Airflow Gradients Yanchen Liu, Minghui Zhao, Stephen Xia, Eugene Wu, Xiaofan Jiang MobiSys 2022 Demo How I Stopped Worrying About Training Data Bugs and Started Complaining Lampros Flokas, Weiuan Wu, Jiannan Wang, Nakul Verma, Eugene Wu DEEM Workshop 2022 Interactive Interface Generation in Notebooks Jeffrey Tao, Yiru Chen, Eugene Wu SIGMOD 2022 demo PI2: Generating Visual Analysis Interfaces From Queries Yiru Chen, Eugene Wu SIGMOD 2022 View Composition Algebra for Ad Hoc Comparisons Eugene Wu TVCG 2022 Reptile: Aggregation-level Explanations for Hierarchical Data Zachary Huang, Eugene Wu SIGMOD 2022 A Neural Network Solves and Generates Mathematics Problems by Program Synthesis: Calculus, Differential Equations, Linear Algebra, and More Iddo Drori, Sunny Tran, Roman Wang, Newman Cheng, Kevin Liu, Leonard Tang, Elizabeth Ke, Nikhil Singh, Taylor L. Patti, Jayson Lynch, Avi Shporer, Nakul Verma, Eugene Wu, Gilbert Strang P",
  "content_length": 23513,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:04"
}