{
  "name": "Eugene Zhang",
  "homepage": "http://web.engr.oregonstate.edu/~zhange",
  "status": "success",
  "content": "Eugene Zhang's Web Page Home | CV | Research | Other Projects | Hot List Welcome to Eugene Zhang's home page I am a Professor in the School of Electrical Engineering and Computer Science at Oregon State University. My research is in the areas of Computer Graphics, Scientific Visualization, Information Visualization, and Geometry Processing. Visit my research page for my past work. My Complete and Most Recent CV My Current NSF Project: IIS-2437424: EAGER: III: Topological Analysis and Visualization of Time-Varying Symmetric Tensor Fields Latest News 10/18/2024 Peter Oliver presented our work on structure-aware hypergraph visualization at VIS 2024. The talk was well received with questions from researchers. 10/18/2024 Our TopoInVis paper was presented at VIS 2024's Workshop of Topology in Visualization. The talk inspired several questions from researchers. 9/2/2024 Our VIS 2024 paper can now be accessed through arxiv. 8/12/2024 Our TopoInVis paper has been accepted for publication. 7/20/2024 After six rounds of competition, I received Second Place in the 1 Dan Band at 40th US Go Congress. 7/18/2024 Our VIS submission was finally accepted and will be presented at VIS 2024. Congratulations to Peter Oliver. 6/12/2024 Our Vis submissionon on structure-aware hypergraph visualization, has been conditionally accepted by VIS 2023. My student collaborators Brandon Bower (Ph.D. student) Guoning Chen (Ph.D. granted in 2009, faculty at University of Houston) Greg Esch (M.S. granted in 2009, at Zum) Xiaofei Gao (M.S. granted in 2018) Sanaz Golbabaei (M.S. granted in 2016, at Adobe) Mariam Guizani (M.S. granted in 2018) Charles Ison (Ph.D. student) Mizuki Kagaya (M.S. granted in 2009, at Pacific Software Publishing) Zhongzang Ray Lin (M.S. granted in 2010, at Amazon) Patrick Neill (M.S. granted in 2008, at NVidia) Peter Oliver (Ph.D. student) Jonathan Palacios (Ph.D. granted in 2015, at Stellar Science) Darrel Palke (M.S. granted in 2010, at Facebook) Botong Qu (Ph.D. granted in 2021, at Zoox) Ritesh Sharma (M.S. granted in 2017, at PASSUR Aerospace, Inc) Ethan Vrhel (Ph.D. student) Jinta Zheng (Ph.D. granted in 2023, at QualComm) Be sure to check out some images from students taking my past graphics classes. Dr. Yue Zhang and I are running a weekly reading group on computer graphics, scientific visualization, and simulation related topics. I used to run a similar reading group. Contact information: Prof. Eugene Zhang 2111 Kelley Engineering Center School of Electrical Engineering and Computer Science Oregon State University Corvallis, OR 97331 (541)737-8599 (o) zhange@eecs.oregonstate.edu",
  "content_length": 2620,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:05"
}