{
  "name": "Eugene Fiume",
  "homepage": "https://www.sfu.ca/computing/people/faculty/eugenefiume.html",
  "status": "success",
  "content": "People - School of Computing Science - Simon Fraser University School of Computing Science People School of Computing Science About Message From the Director Industry Relations MPCS Advisory Council Job Opportunities Diversity in CS Diversity Committee Webinars Awards and Project Presentations 2025 Explore Computing Science Research Workshop Contact Us CS Intranet People Leadership Faculty Staff Future Students Undergraduates Graduates Current Students Undergraduates Program Requirements Forms Policies Co-op Student Resources Undergraduate Student Research Award (USRA) Academic Enhancement Program (AEP) AEP in the News! Computing Science Peer Tutoring Meet your CS Peer Tutors Research Opportunities Undergraduate Project Showcase Frequently Asked Questions Graduates Program Requirements Policies Forms Financial Support Resources Supervisory Committee Thesis & Defence Internships & Co-op MPCS Co-op Industrial Internships Teaching Assistantships Student Life Research Areas Labs Trustworthy Artificial Intelligence (TAI) Lab Centres & Institutes Chairs Awards Nominations for CS Excellence in Teaching Awards Best Paper Award Seminars Distinguished Lecture Series Industry Talks Series VCR/AI News & Events News Events ICPC Programming Contest About ICPC ICPC PACNW | SFU Support CSIL Linux/UNIX FAQ CSIL Linux/Unix Known Issues Network Lab FAQ CSIL Remote Access CSIL Windows systems Known Issues CSIL Linux/UNIX FAQ Basic Linux Command Line Survival Known Issues How to kill Unix Processes Grads & Researchers Guides & Tips Print, Photocopy & Scan People The School of Computing Science is home to world-renowned faculty driving innovation in AI, cybersecurity, visual computing, and more. Ranked among Canada’s top 5 computing science programs, we are at the forefront of groundbreaking research and technological advancement. Our faculty actively engage in impactful research, global collaborations, and student mentorship. Explore their profiles to learn more and connect with them for guidance on research, industry trends, or academics. Behind the scenes, our talented and hardworking staff form the backbone of the School. Reach out with any questions, and they will connect you with the right resources. We are all here to support your journey at SFU! LEADERSHIP FACULTY STAFF About Overview Message From the Director Industry Relations Overview MPCS Advisory Council Job Opportunities Diversity in CS Overview Diversity Committee Webinars Awards and Project Presentations 2025 Explore Computing Science Research Workshop Contact Us CS Intranet People Overview Leadership Faculty Staff Future Students Overview Undergraduates Graduates Current Students Overview Undergraduates Overview Program Requirements Forms Policies Co-op Student Resources Undergraduate Student Research Award (USRA) Academic Enhancement Program (AEP) AEP in the News! Computing Science Peer Tutoring Meet your CS Peer Tutors Research Opportunities Undergraduate Project Showcase Frequently Asked Questions Graduates Overview Program Requirements Policies Forms Financial Support Resources Supervisory Committee Thesis & Defence Internships & Co-op MPCS Co-op Industrial Internships Teaching Assistantships Student Life Research Overview Areas Labs Overview Trustworthy Artificial Intelligence (TAI) Lab Centres & Institutes Chairs Awards Overview Nominations for CS Excellence in Teaching Awards Best Paper Award Seminars Overview Distinguished Lecture Series Industry Talks Series VCR/AI News & Events Overview News Events Overview ICPC Programming Contest About ICPC ICPC PACNW | SFU Support Overview CSIL Linux/UNIX FAQ Overview CSIL Linux/Unix Known Issues Network Lab FAQ CSIL Overview Remote Access CSIL Windows systems Known Issues CSIL Linux/UNIX FAQ Basic Linux Command Line Survival Known Issues How to kill Unix Processes Grads & Researchers Guides & Tips Overview Print, Photocopy & Scan SFU.CA Search Search This Site SFU.ca SFU Mail goSFU Canvas close",
  "content_length": 3959,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:02"
}