{
  "name": "Euijin Choo",
  "homepage": "https://alleychoo.github.io",
  "status": "success",
  "content": "Dr. Euijin Alley Choo Home R&D Experience Awards Publication Teaching Activities DANS Lab Dr. Euijin Alley Choo Assistant ProfessorDepartment of Computer Science University of Alberta, Edmonton, AB, Canada Office: 7-181 University Commons Email: Academic Profiles: Short Bio Dr. Euijin (Alley) Choo is an Assistant Professor at the Department of Computer Science at University of Alberta, Edmonton, Canada. Prior to joining U of A, she worked as an industrial researcher (postdoctoral) at Qatar Computing Research Institute, a research professor at Korea University, and a visiting assistant professor at University of Missouri, Rolla. She received her Ph.D from North Carolina State University under the supervision of Dr. Min Chi and Dr. Ting Yu in 2015. She also received her dual BS in Computer Science and Mathematics, and MS in Computer Science, at Korea University under the supervision of Dr. Heejo Lee. Her research interest sits at the intersection of security and big data analysis, focusing on AI-based cybersecurity solutions and adversarial attacks. More specifically, it includes security and information assurance in e-commerce, and anomaly detection in network traffic and enterprise logs. Her research has been published in top conferences such as IEEE Symposium on Security and Privacy (S&P), ACM SIGMETRICS, and Usenix Security. She is a PI on various grants supported by industry partners and funding agencies. Due to her broad expertise and the interdisciplinary nature of her research, she actively serves on Technical Program Committees and as a journal reviewer for prominent data and security conferences and journals such as Usenix Security, ACSAC, NDSS, and IEEE TKDE. During her research, she received Provost Fellowship from NC state University and Brain Korea 21 Scholarship from Korea Research Foundation. She was also an awardee of a few travel grants to attend major security conferences including ACM CCS and IEEE S&P. She is truly honored to be a recipient of the best paper award at DBSEC 2015. Notice I'm looking for highly motivated students who are passionate about AI Security research at University of Alberta! If you are interested in working with me, please email me with your CV, transcript, short description about your representative projects, and your role in each project. Read this instruction before contacting me. Recent Talk Recent Selected Research Funding PI: Euijin Choo, \"Mitacs Accelerate Program Grant- Fraud Detection in Financial Graphs\", 2025 May - 2025 Dec, $60,000 PI of UAlberta, Collaborator: Euijin Choo, \"National CyberSecurity Consortium Research & Development - Standard Grant - IntruderInsight: Elevating Cyber Attribution with AI Insights\", 2025 Jan - 2027 Dec, $2,000,000 (PI: ENFOCOM International Corporation) PI: Euijin Choo, \"Mitacs Accelerate Program Grant- An Ensemble Approach for the Robust and Adaptive Anomaly Detection System\", 2024 May - 2026 April, $150,000 PI: Euijin Choo, \"Mitacs Accelerate Program Grant- Secure and Practical Federated Learning with Multi-Key Homomorphic Encryption\", 2023 Sep - 2025 Aug, $120,000, Co-PI: Omid Ardakanian Recent Selected Publication * Students supervised by me Youngdong Jang, Hyunje Park, Feng Yang, Heeju Ko, Euijin Choo, Sangpil Kim \"3D-GSW: 3D Gaussian Splatting for Robust Watermarking\", IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) 2025 (Acceptance Ratio 0.22) Fujiao Ji, Kiho Lee, Hyungjoon Koo, Wenhao You*, Euijin Choo, Hyoungshick Kim, Doowon Kim \"Evaluating the Effectiveness and Robustness of Visual Similarity-based Phishing Detection Models\", 34th USENIX Security Symposium (USENIX Security) 2025 (Acceptance Ratio 0.17) Euijin Choo, Mohamed Nabeel, Doowon Kim, Ravindu De Silva, Ting Yu, Issa Khalil \"A Large Scale Study and Classification of VirusTotal Reports on Phishing and Malware URLs\", ACM on Measurement and Analysis of Computing Systems (ACM SIGMETRICS 2024), Vol. 7, No. 3, pp. 1-26, ACM (Acceptance Ratio 0.14) Euijin Choo, Mohamed Nabeel, Mashael Al Sabah, Issa Khalil, Ting Yu, Wei Wang. \"DeviceWatch: A Data-Driven Network Analysis Approach to Identifying Compromised Mobile Devices with Graph-Inference\", ACM Transactions on Privacy and Security. 2022 Nov 7;26(1):1-32 Mashael Al Sabah, Mohamed Nabeel, Euijin Choo, Yazan Boshmaf \"Content-Agnostic Detection of Phishing Domains using Certificate Transparency and Passive DNS\", In Proceedings of the 25th International Symposium on Research in Attacks, Intrusions and Defenses (pp. 446-459) (RAID)'22, Limassol, Cyprus, Oct 2022. (Acceptance Ratio 0.25) Saravanan Thirumuruganathan, Mohamed Nabeel, Euijin Choo, Issa Khalil, Ting Yu \"SIRAJ: A Unified Framework for Aggregation of Malicious Entity Detectors\", 43rd IEEE Symposium on Security and Privacy (IEEE S&P 2022) (pp. 507-521), May 2022. (Acceptance Ratio 0.15) Research Area Current Research: Data-driven Cybersecurity Intelligence Knowledge Graph and Feature Construction for Anomaly Detection using LLM Attacks and Defenses for Federated Learning Compromised Entity Detection in Network and System Logs Spam Detection in Public Forums Malware Detection Past Research [show] Information Assurance in Electronic Commerce Market Resilience Evaluation of Reputation Systems VM-based Automated Unpacking of Malwares Secure Real-time Media Transmission Maintaining High Media QoS performance Protect QoS of Multimedia Streaming against DoS attack Education Ph.D, Dept. of Computer Science, North Carolina State University, Raleigh, NC, USA, Aug 2009 - July 2015 Dissertation: Information Assurance in Electronic Commerce Market (Advisors: Dr. Min Chi, Dr. Ting Yu) M.S, Dept. of Computer Science and Engineering, Korea University, Seoul, Korea, Mar 2006 - Feb 2008 Thesis: A Lightweight Encryption Scheme for Secure Real-time Multimedia Transmission (Advisor: Dr. Heejo Lee) Dual B.S, Dept. of Computer Science and Engineering, Dept. of Mathematics, Korea University, Seoul, Korea, Mar 2001 - Feb 2006 Graduation Project: Reputation- based Trust Management System for P2P (Advisor: Dr. Heejo Lee)",
  "content_length": 6077,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:07"
}