{
  "name": "Eun Kyoung Choe",
  "homepage": "https://terpconnect.umd.edu/~choe",
  "status": "success",
  "content": "Eun Kyoung Choe Eun Kyoung Choe Contact Eun Kyoung Choe, Associate Professor (\"Eun Kyoung\" is my first name) Email: choe@umd.edu News Fall 24: Back to UMD after a year-long sabbatical at SNU CS Dept, Korea Travel Oct 2024: UbiComp, Melbourne, Australia Eun Kyoung Choe is an Associate Professor in the College of Information at the University of Maryland, College Park. Her research bridges the fields of Human-Computer Interaction (HCI), Health Informatics, and Ubiquitous Computing, with a focus on designing technologies that empower individuals to improve their health and well-being. Recently, she has been investigating the intersection of health and disability, working towards creating accessible health technologies for marginalized populations. Her work has been supported by the NSF's CRII, CAREER, and Medium awards, NIH's R01, NRF (National Research Foundation of Korea), and Microsoft Research. She has been serving on the editorial boards of PACM IMWUT and Foundations and Trends in Human-Computer Interaction. She also co-chaired the Health Subcommittee for CHI from 2021 to 2023. Dr. Choe earned her BS from KAIST, MIMS from University of California, Berkeley, and her PhD in Information Science from University of Washington, where she was honored with a Distinguished Alumni Award in 2024 for her significant contributions to the information field. [CV] [Google Scholar]. Current projects Inclusive and Accessible Health Tracking for the Blind and Low-Vision (BLV) People Personal health tech can help people monitor and manage their health, but current design approaches can unintentionally leave out a significant portion of our population, specifically the blind and low-vision (BLV) community. BLV individuals can’t access many of the features that sighted people can, making it harder to keep track of their health data. This could exacerbate existing health disparities between the BLV population and the sighted population. By understanding their practices and needs, we can design more inclusive technologies that help to close these gaps, ensuring that all individuals, regardless of their vision capabilities, have equal opportunities to manage their health effectively. This research underscores the importance of addressing accessibility challenges and fostering inclusive design opportunities to ensure equitable access to health tracking technologies for all, including the BLV community. Related publication: Lee J.G.W., Lee K., Lee B., Choi S., Seo J., Choe E.K. (2023). Personal Health Data Tracking by Blind and Low-Vision People: Survey Study. JMIR 2023; 25:e43917 [Paper] MyMove: Teachable Activity Trackers For and With Older Adults Activity tracking technologies like FitBits have made inroads in the personal health informatics space over the years. These technologies have their limitations. FitBits under-report slow speeds—for example, people walking with canes or walkers—so are not designed with older adults’ lifestyles and perspectives in mind. We aim to design and build personalized activity tracking systems that better match older adults' lifestyle and physiological characteristics, with a long-term goal of supporting older adults to actively engage in their physical activity. The MyMove system and activity labels along with the sensor data collected from older adults could play a critical role in facilitating personalization. The research team aims to support older adults and other underrepresented populations in fine-tuning the models in activity tracking applications with their own data, so that the applications can reflect their idiosyncratic characteristics. This work is currently funded by NSF. Related publication: Kim, Y.H., Chou, D., Lee, B., Danilovich, M., Lazar, A., Conroy, D.E., Kacorri, H., Choe, E.K. (2022). Mymove: Facilitating older adults to collect in-situ activity labels on a smartwatch with speech. CHI 2022 [Paper] [Website] Achieving Optimal Motor Function in Stroke Survivors via a Human-Centered Approach to Design an mHealth Platform Upper-limb paresis is the most common impairment following a stroke affecting 75% of stroke survivors, which can be more prominent in one of the two limbs. It is clinically important that stroke survivors continue to practice the use of the stroke-affected limb in their home and community settings to maintain the functional level learned in the clinic, but currently, there exists no effective, practical clinical tool. In this project, we propose to develop and validate an mHealth technology that will monitor real-world upper limb activity by leveraging our novel finger-worn accelerometer sensors and provide individually-tailored feedback to encourage affected limb use. This work is currently funded by NIH. Related publications: Jung, H.T., Kim, Y., Lee, J., Lee, S.I., & Choe, E.K. (2022). Envisioning the use of in-situ arm movement data in stroke rehabilitation: Stroke survivors’ and occupational therapists’ perspectives. Plos one, 17(10), e0274142. [Paper] Kim, Y., Jung, H.T., Park, J., Kim, Y., Ramasarma, N., Bonato, P., Choe, E.K., Lee, S.I. (2019). Towards the design of a ring sensor-based mHealth system to achieve optimal motor function in stroke survivors. PACM Interactive, Mobile, Wearable and Ubiquitous Technologies, 3(4), 1-26. [Paper] Previous projects OmniTrack: Semi-automated Tracking to Advance Personal Informatics This research examines a novel self-tracking approach called semi-automated tracking to help people easily engage with a rich set of personal data, such as weight, activities, sleep pattern, and medication use. In principle, being aware of self-tracking data can help people reflect on their health condition and understand how their behavior affects their progress toward goals, making positive influence on people’s health and well-being. In practice, however, self-tracking is hard. Manual tracking approaches such as diaries require much effort, while automated tracking approaches such as wearable sensing tools significantly reduce the tracker’s awareness, accountability, and involvement achieved compared to when a person actively engages in manual tracking. To address these problems, this research proposes to design and develop a semi-automated tracking platform, combining both manual and automated data collection methods. We designed a mobile self-tracking platform called OmniTrack, which helps people design and build trackers based on their diverse tracking needs without programming. This tool can help various stakeholders including Quantified-Selfers who have unique tracking needs, as well as researchers who want to incorporate in-situ data in their research. If you are a researcher wanting to incorporate trackers, to run Ecological Momentary Assessment studies, or to conduct mobile diary studies, please contact us! This work was funded by NSF. Related publications: Luo, Y., Liu, P., Choe, E.K. (2019). Co-Designing Food Trackers with Dietitians: Identifying Design Opportunities for Food Tracker Customization. Proc. ACM Human Factors in Computing Systems (CHI '19). [Acceptance rate 23.8%] [PDF] Kim, Y-H., Choe, E.K., Lee, B., Seo, J. (2019). Understanding Personal Productivity: How Knowledge Workers Define, Evaluate, and Reflect on Their Productivity. Proc. ACM Human Factors in Computing Systems (CHI '19). [Acceptance rate 23.8%] [PDF] Kim, Y-H., Jeon, J.H., Lee, B., Choe, E.K., Seo, J. (2017). OmniTrack: A Flexible Self-Tracking Approach Leveraging Semi-Automated Tracking. Proc. ACM Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT). [PDF] Choe, E.K., Abdullah, S., Rabbi, M., Thomaz, E., Epstein, D.A., Kay, M., Cordeiro, F., Abowd, G.D., Choudhury, T., Fogarty, J., Lee, B., Matthews, M., Kientz., J.A. (2017). Semi-Automated Tracking: A Balanced Approach for Self-Monitoring Applications. IEEE Pervasive Computing. [IEEE Link] [PDF] Personal Data Visualization & Mobile Data Visualization What do you do once you have your own tracking regimen and have collected rich data about yourself? In my work, I examine ways to support self-trackers in leveraging their data through visualizations. In the personal data context, visualizations can help people identify insights, make decisions and act on the insight, and communicate and share insights with others. The personal data context also poses an interesting challenge, that is, the mobile context (i.e., small screen) where people often consume personal data. Despite the increased prevalence of visualization on mobile devices, we are missing a consolidated set of best practices and ways to evaluate mobile data visualization. To help people gain rich insights through visualizations, we need to understand the types of insight that people value and the contexts (or use cases) of how people consume personal data. In my work, I conduct empirical studies to understand how people reflect on their personal data and what insights they gain from visual exploration with personal data. To support richer personal data exploration on mobile devices, I design novel ways to help people explore their personal data on mobile devices (smartphones, tablets, and smartwatches) by leveraging multimodal interaction and provide best practice examples. Related publications & organized workshop: Choe, E.K., Dachselt, R., Isenberg, P., Lee, B. (2019). Mobile Data Visualization. Dagstuhl Seminar. July 14–19, 2019. https://www.dagstuhl.de/19292 Brehmer, M., Lee, B., Isenberg, P., Choe, E.K. (2019). Visualizing Ranges over Time on Mobile Phones: A Task-Based Crowdsourced Evaluation. IEEE TVCG (InfoVis 2018) 25(1): 619–629. [IEEE Link] [PDF][Talk] Choe, E.K., Lee, B., Zhu, H., Riche, N.H., Baur, D. (2017). Understanding Self-Reflection: How People Reflect on Personal Data Through Visual Data Exploration. Proc. EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '17). [Acceptance Rate: 24%] [PDF] [Presentation] Choe, E.K., Lee, B., schraefel, m.c. (2015). Characterizing V",
  "content_length": 11352,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:10"
}