{
  "name": "Eunbyung Park",
  "homepage": "https://silverbottlep.github.io",
  "status": "success",
  "content": "Eunbyung Park Eunbyung Park Department of Artificial Intelligence School of Computing Yonsei University I am an assistant professor at Yonsei University in South Korea, where I lead the V-Lab. Prior to Yonsei University, I worked at SKKU, Microsoft Project Turing and an autonomous driving startup, Nuro. I completed my PhD at University of North Carolina at Chapel Hill in 2019, advised by Prof Alex Berg. During PhD, I was fortunate to work at Google DeepMind, Microsoft Research, Adobe Research, and HP Labs. I am interested in a broad range of machine learning for visual and scientific computing. Recently, I have worked on neural fields architectures, applications, and training algorithms, and solving partial differential equations with data-driven approaches. Education Ph.D., Computer Science at University of North Carolina at Chapel Hill, 2014.09 - 2019.12 M.S., Computer Science at Seoul National University, 2009.03 - 2011.02 B.S., Computer Science at Kyung Hee University, 2002.03 - 2009.02 Work Experience Assistant Professor, Yonsei University, 2025.03 - Present Assistant Professor, SKKU, 2021.02 - 2025.02 Applied Scientist, Microsoft Project Turing, 2020.09 - 2021.02 Research Scientist, Nuro, 2019.06 - 2020.08 Research Intern, Google DeepMind, 2018.06 - 2018.10 Research Intern, Microsoft Research, 2017.06 - 2017.08 Research Intern, Adobe Research, 2016.06 - 2016.08 Research Intern, HP Labs, 2015.06 - 2015.08 News [2025.11] I will serve as an area chair for ICML 2026 [2025.11] LightMarkGS received the best paper award in KIBME 2025! [2025.08] I will serve as an area chair for CVPR 2026 and ICLR 2026 [2025.06] Invited talk at an RSS 2025 Workshop Gaussian Representations for Robot Autonomy: Challenges and Opportunities [2025.04] Invited talk at POSTECH CSE/GSAI Seminar [2025.04] I will serve as an area chair for NeurIPS 2025 [2025.04] Generative Densification was selected as a CVPR 2025 highlight! [2025.04] Invited talk at AI Seminar Series at Dongguk University, 2025 [2025.03] Invited talk at Colloquium on Immersive Media Engineering at SKKU, 2025, Recorded talk (Korean) [2025.02] Three papers got accepted to CVPR 2025! [2025.01] Invited talk at Joint JPEG/MPEG Workshop on Radiance Fields [2024.12] Two papers got accepted to ICLR 2025! [2024.12] Three papers, including DiffuseHigh and CodecNeRF, got accepted to AAAI 2025! [2024.11] DiffuseHigh received the best paper award at JKAIA 2024! [2024.10] Invited talk at SKKU AI Colloqium 2024 Recorded talk (Korean) [2024.09] PEFT Video Compression work was selected as an oral presentation in ACCV 2024! [2024.09] Freq-Mip-AA is considered as a best paper candidate in ICIP 2024! [2024.07] Two papers accepted to ECCV 2024! [2024.05] Our lab received the outstanding young scientist grant from the National Research Foundation! [2024.05] Our lab (with Prof Inki Kim) won the grant from Samsung Science & Technology Foundation! [2024.04] Two CVPR 2024 papers selected as highlights! [2024.02] Two papers accepted to CVPR 2024! [2024.01] CAM was accepted to ICLR 2024 as a spotlight! [2023.11] Invited talk at GIST Colloquium [2023.09] SPINN was accepted to NeurIPS 2023 as a spotlight! [2023.09] Two papers accepted to NeurIPS 2023! [2023.05] Invited talk at UNIST AI graduate seminar [2023.02] Two papers accepted to CVPR 2023! [2023.02] Invited talk about SPINN at CRUNCH Seminars at Brown University [Recorded talk] [2022.11] Invited talk at 2022 KSIAM Annual Meeting [2022.11] PIXEL was accepted to AAAI 2023 [2022.09] NRFF was accepted to ACCV 2022 [2022.08] PIXEL was selected as a spotlight in DLDE-II (NeurIPS 2022 Workshop) [2022.08] SPINN received the best paper award in CKAIA 2022 [2022.07] Streamable Neural Fields was accepted to ECCV 2022 [2022.05] Our lab received the Basic Research Lab (BRL) grant from the NRF [2022.03] Invited talk at Samsung Research [2021.09] Honor to be selected as a EIRIC rising star [2021.06] VSC lab was founded [2021.05] Invited talk at AI Frontiers Summit 2021",
  "content_length": 3994,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:09"
}