{
  "name": "Eunok Paek",
  "homepage": "http://bislab.hanyang.ac.kr/index.php?mid=Professor",
  "status": "success",
  "content": "Professor Skip to menu 검색창 닫기 Professor Professor Eunok Paek Professor, Hanyang University ( Dept. of Computer Science ) Major : Artificial Intelligence, Bioinformatics E-mail: eunokpaek@hanyang.ac.kr Tel: 02-2220-2377 Fax: 02-2299-2377 Room: IT/BT 615 Education Ph. D., Computer Science, Stanford University B. S., Computer Engineering, Seoul National University Employment 1992~1995 Research Inst. of Adv. Comp. Tech., Seoul Nat’l Univ 1995~2000 LG Corporate Institute of Technology 2001 - 2012          Professor, University of Seoul 2012 - present     Professor, Hanyang University Contact Info. - Dept. of Computer Science, Hanyang University, 222 Wangsimni-ro, Seongdong-gu, Seoul 133-791 KOREA. - E-mail: eunokpaek@hanyang.ac.kr - Tel: +82-2-2220-2377 - Fax: +82-2-2299-2377 Research Interests - Bioinformatics: Computational Mass Spectrometry, Systems Biology - Artificial Intelligence: Knowledge Representation, Formal Methods Information Retrieval, Natural Language Understanding Employment - Professor, Hanyang University, Seoul, Korea (2012 - present) - Professor, University of Seoul, Seoul, Korea (2001 - 2012) - Senior Research Engineer, LG Corporate Institute of Technology, Seoul, Korea   (1996 - 2000) - Post-doc. & Research Scientist, Research Inst. of Adv. Comp. Tech., Seoul Nat’l Univ., Seoul, Korea   (1992 - 1995) - Lecturer, Dept. of Computer Engineering, Seoul Nat’l Univ., Seoul, Korea   (1992 - 1995) - Research Assistant, Computer Science Dept., Stanford Univ., Stanford, CA   (1985 - 1991) Education - Ph. D., Computer Science, Stanford University, Stanford, CA   (June, 1991) - B. S., Computer Engineering, Seoul National University, Seoul, Korea   (February, 1985) Honors and Awards - OnBIT academic award, Korean Society of Bioinformatics (2012) - Distinguished Publication Award, Korean Federation of Science and Technology Societies   (1993) - Post-doctoral Fellowship, Korea Science and Engineering Foundation   (1992) - Summa Cum Laude, Seoul National University   (1985) I want to Up LOGIN Sign In User ID Password Keep me signed in. You will be still signed in even when the browser is closed.It is not recommended to use this if you are using a public computer, for your personal information could be violated. Sign In Find Account Info | Sign Up 닫기",
  "content_length": 2289,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:11"
}