{
  "name": "Eunsuk Kang",
  "homepage": "https://eskang.github.io",
  "status": "success",
  "content": "Home | Eunsuk Kang Associate Professor Software and Societal Systems Department School of Computer Science Carnegie Mellon University Software Design and Analysis (SoDA) Group Office: TCS Hall 322 Email: eskang [at] cmu [dot] edu I work mainly at the intersection of software engineering and formal methods. I am especially interested in leveraging rigorous modeling and analysis techniques to design software systems that are safe, secure, and reliable. My current interests include software design, requirements, modeling, specification and verification, system safety, security, and cyber-physical systems. Projects Designing for robustness: What does it mean for software to be robust against an evolving or misbehaving environment? How do we construct systems that are robust by design? (FSE ‘20, ICSE ‘23, CAV ‘23, FM ‘24) (talk) Specification engineering: How do we develop & validate specifications that accurately reflect the user’s intent? How do we best explain or visualize formal abstractions? (ICSE ‘25, PLATEAU ‘25, SoSyM ‘24) Automated reasoning: How do we decompose a complex specification into simpler pieces for scalable analysis? How do we design a system to be more amenable to analysis in the first place? (FMCAD ‘24, NFM ‘24, FSE ‘21) Safe and resilient CPS: Can we identify potential failures in complex CPS before they occur? How do we deal with erorrs in ML-based components to ensure overall system safety? (ICSE ‘25, SEAMS ‘24, NFM ‘24) People Manuel Barros. PhD student (w/ José Orlando Pereira & Alcino Cunha), 2024- Ben-hau Chia. PhD student (w/ Chris Timperley), 2024- Ian Dardik. PhD student, 2022- Andy Hammer. PhD student, 2023- Parv Kapoor. PhD student, 2021- Yiliang (Leo) Liang. PhD student (w/ Josh Sunshine), 2023- Yining She. PhD student, 2022- Changjian Zhang. PhD (w/ David Garlan), 2019-2024. Now: TBD Ben Gafford. MS, 2020-2022. Sumon Biswas. Postdoc, 2022-2024. Now: Faculty at Case Western Reserve. Rômulo Meira-Góes. Postdoc, 2020-2022. Now: Faculty at Penn State. Qishen Zhang. Postdoc, 2023-2025. Now: TBD Teaching 17-423/723: Designing Large-Scale Software Systems (S25, S24) 17-614 & 624: Formal Methods (F25, F23, F22, F21, F20) 17-445/645: SE for AI-enabled Systems (S23, S22, S21, F20, F19) 17-651: Models of Software Systems (F19, F18) Service Program co-chair: SEAMS 2026 Co-organizer: Dagstuhl Seminar on Specification Engineering, 2025 Co-organizer: 3rd International Workshop on Designing Software (@ICSE ‘26) Co-director: CyLab Robotics Security and Privacy Initiative PC: ICSE ‘26, ‘25, ‘24, OOPSLA ‘25, SEAMS ‘25, ‘24, ASE ‘25, ‘23, CAV ‘24, ‘23, MEMOCODE ‘25 ‘24, ‘23, EnviRE ‘24, ‘23 Associate editor, IEEE Transactions on Software Engineering (TSE) Bio Prior to joining CMU, I spent a year working on connected vehicles at Toyota, and was a postdoctoral scholar on the NSF ExCAPE program with Stéphane Lafortune and Stavros Tripakis. I received a PhD in Computer Science at MIT, working with Daniel Jackson. Before MIT, I studied software engineering at the University of Waterloo, where I spent several wonderful terms as an undergraduate researcher in WatForm.",
  "content_length": 3128,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:12"
}