{
  "name": "EunSeok Lee 0001",
  "homepage": "https://sites.google.com/view/skkuselab/about",
  "status": "success",
  "content": "SELAB @SKKUSearch this siteEmbedded FilesSkip to main contentSkip to navigationSoftware Engineering Lab. @ Sungkyunkwan University성균관대학교 소프트웨어공학 연구실성균관대학교 소프트웨어공학 연구실에 방문하신 것을 환영합니다!본 연구실은 1995년 설립되어, 소프트웨어공학 관련 기초 및 응용 연구를 수행하고 있습니다. 현재 Fault Localization, Test Automation, Information Retrieval-based Bug Localization, Auto Program Repair, Regression Testing에 대해 연구하고 있습니다. 이전 연구로는 Self-Adaptive System, Ubiquitous Computing, Autonomic Computing, Agent Technologies and Its Applications, Electronic Commerce and Information Gathering on the Internet, SPICE / CMMI, Intelligent User Interface, Usability Engineering, Ubiquitous Learning에 대해 연구했습니다.The Software Laboratory has been established in 1995. Our research focuses on Fault Localization, Test Automation, Information Retrieval-based Bug Localization, Auto Program Repair, and Regression Testing. Our prior research interest was Self-Adaptive System, Ubiquitous Computing, Autonomic Computing, Agent Technologies, and its applications, Electronic Commerce and Information Gathering on the Internet, Software Engineering, SPICE/CMMI, Intelligent user interface, usability engineering, and Ubiquitous Learning. Research Area Automated Program Repair– Automatically repair software defects based on past history– Provide the reason for the failures and provide possible solutions– Automatically rank the generated patchesFault Localization– Identify the fine-grained locations of bug– Isolate the problematic area from the entire source codeBug Localization–  Rank the suspicious source files for the reported bug– Reformulate bug reports (queries) for relevancy enhancement– Remove noise from bug reports (queries) and source files (search space)Test Automation­ – Verify the correct behavior of the SW– Maximize SW coverage & number of detected faultsContact경기도 수원시 장안구 서부로 2066 성균관대학교 자연과학캠퍼스 산학협력센터 85457호Corporate Collaboration Center #85457, Natural Science Campus, 2066, Seobu-ro, Jangan-gu, Suwon-si, Gyeong gi-do, Korea☎ 031) 290-7220성균관대학교 자연과학캠퍼스경기 수원시 장안구 서부로 2066Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2079,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:09"
}