{
  "name": "Eva Hornecker",
  "homepage": "https://www.uni-weimar.de/en/media/institutes/digital-bauhaus-lab/people/prof-dr-eva-hornecker",
  "status": "success",
  "content": "Bauhaus-Universität Weimar: Prof. Dr. Eva Hornecker Contact and Information Eva Hornecker is a Professor in Human-Computer Interaction at the Bauhaus-Universität Weimar. Her work is located at the intersection between technology, design, and the social sciences. Her research interests focus on the design and user experience of ‘beyond the desktop’ interaction. This includes multitouch surfaces, tangible interaction, whole-body interaction, mobile devices, physical and physically embedded computing, and the social/societal implications of technology. She proposed a unifying tangible interaction framework that helped to establish TEI as an interdisciplinary and diverse research area, and co-founded the international Tangible, Embedded and Embodied Interaction conference series (TEI) in 2007. A particular emphasis of her work is on understanding and designing for people's social interactions with and around novel TEI interfaces. She also is an expert on museum installations and has conducted various studies of visitor behaviour. Recent work focuses on urban space installations.Previously, she was a lecturer (assistant professor) at the University of Strathclyde in the UK, and worked in post-doctoral positions in the UK (University of Sussex, The Open University), Austria (TU Vienna) and New Zealand (HitLabNZ). Eva Hornecker is on the editorial board for the ‚Interacting with Computers’ journal, on the Editorial Advisory Board of the CSCW Journal, and has been a forum editor for ACM’s interaction magazine. Prof. Ursula DammProf. Dr. Bernd FröhlichProf. Dr. Eva HorneckerProf. Dr. Carsten KönkeProf. Dr. Stefan LucksProf. Dr. Volker RodehorstProf. Dr. Benno SteinProf. Dr. Charles Wüthrich Bauhaus-Universität WeimarFaculty of MediaComputer Science and Media Email: eva.hornecker[at]uni-weimar.deWeb: www.uni-weimar.de/medien/hciPhone: +49 (0) 36 43/58 38 87 Research Lab: Human-Computer Interaction Accessibility panel  Simple language Information about the Bauhaus-Universität Weimar in German. Set contrast Read more about this setting Changes from color to monochrome mode contrast active contrast not active switch on activate contrast view switch off deactivate contrast view Darkmode for the lightsensitive Read more about this setting Changes the background color from white to black Darkmode active Darkmode not active switch off deactivate darkmode switch on activate darkmode Click- and Focus-feedback Read more about this setting Elements in focus are visually enhanced by an black underlay, while the font is whitened Feedback active Feedback not active switch off Deactivate Feedback switch on Activate Feedback Animations on this Website Read more about this setting Halts animations on the page Animations active Animations not active switch off disable animations switch on enable animations Close",
  "content_length": 2836,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:15"
}