{
  "name": "Eva Rodríguez",
  "homepage": "https://craax.site.ac.upc.edu/index.php/2022/11/08/dr-eva-rodriguez",
  "status": "success",
  "content": "Dr. Eva Rodríguez – Craax Lab Dr. Eva Rodríguez Contact Information Address Jordi Girona, 1-3. 08034. Barcelona, Spain.. Email eva.rodriguez@upc.edu Phone 934017190 Web page . Eva Rodríguez Short bio Eva Rodríguez received her Ph. D in Computer Science from the Universitat Pompeu Fabra (UPF) in 2007 and her BSc in Telecommunication Engineer from the Universitat Politècnica de Catalunya (UPC) in 2001.She has been with the Department of Computer Architecture, UPC, as an Assistant Professor, since 2005. From 2002 to 2005, she worked as a Researcher with the Department of Technology, UPF. Her Ph. D. thesis focused in the standardization of the protection and governance of multimedia content.Her research focuses on security, privacy, multimedia information retrieval, and object recognition. Participant in several national projects and EU contracts from FP6, FP7 and H2020 programs, in the areas of security and multimedia information management.She has authored several papers, published in international journals and conferences, and she has participated since 2003 in the ISO/MPEG standardization group, contributing to different MPEG standards, as ISO/IEC 21000-4 “Intellectual Property Management and Protection Components”, ISO/IEC 23000-7 “Open release MAF”, MPEG-A and MPEG-M. . Recent Publications Rodriguez, E.; Otero, B.; Canal, R. A Survey of Machine and Deep Learning Methods for Privacy Protection in the Internet of Things. Sensors (Switzerland). 2023. Vol: 23. Issue: 3. pp. 1-24. https://doi.org/10.3390/s23031252 Rodriguez, E.; Valls, P.; Otero, B.; Costa, J.; Verdu, J.; Pajuelo, M.A.; Canal, R. Transfer-learning-based intrusion detection framework in IoT networks. Sensors (Switzerland). 2022. Vol: 22. Issue: 15. pp. 1 – 17. https://doi.org/10.3390/s22155621 Otero, B.; Rodriguez, E.; Rojas, O.; Verdu, J.; Costa, J.; Pajuelo, M.A.; Canal, R. A cost-efficient QoS-aware analytical model of future software content delivery networks. International journal of network management. 2021. Vol: 31. Issue: 4. pp. 1 – 24. https://doi.org/10.1002/nem.2137 Rodriguez, E.; Otero, B.; Gutierrez, N.; Canal, R. A survey of deep learning techniques for cybersecurity in mobile networks. IEEE communications surveys and tutorials. 2021. Vol: 23. Issue: 3. pp. 1920 – 1955. https://doi.org/10.1109/COMST.2021.3086296 Lasheras, A.; Canal, R.; Rodriguez, E.; Cassano, L. Securing RSA hardware accelerators through residue checking. Microelectronics reliability. 2021. Vol: 116. Issue: article 114021. pp.: 1 – 10. https://doi.org/10.1016/j.microrel.2020.114021 Gutierrez, N.; Otero, B.; Rodriguez, E.; Canal, R. Malicious website detection through deep learning algorithms. Machine Learning, Optimization, and Data Science, 7th International Conference, LOD 2021: Grasmere, UK, October 4-8, 2021: revised selected papers, part I. Springer Nature. 2022. pp. 512 – 526. ISBN/ISSN: 978-3-030-95467-3. https://link.springer.com/book/10.1007/978-3-030-95467-3 Gutierrez, N.; Rodriguez, E.; Mus, S.; Otero, B.; Canal, R. Privacy preserving deep learning framework in fog computing. Machine Learning, Optimization, and Data Science, 6th International Conference, LOD 2020: Siena, Italy, July 19-23, 2020: revised selected papers, part I. Springer. 2021. pp. 504 – 515. ISBN/ISSN: 978-3-030-64583-0. https://link.springer.com/book/10.1007/978-3-030-64583-0 Lasheras, A.; Canal, R.; Rodriguez, E.; Cassano, L. Lightweight protection of cryptographic hardware accelerators against differential fault analysis. 2020 26th IEEE International Symposium on On-Line Testing and Robust System Design (IOLTS): July 13-16, 2020, virtual edition: proceedings. Institute of Electrical and Electronics Engineers (IEEE). 2020. pp. 1 – 6. ISBN/ISSN: 978-1-7281-8187-5. https://ieeexplore.ieee.org/xpl/conhome/9151097/proceeding Publications Journals Conference Projects Current Projects PHOENI2X Funded by: Towards a Functional Continuum Operating SystemA European Cyber Resilience Framework with Artificial Intelligence-Assisted Orchestration & Automation for Business Continuity, Incident Response& Information Exchange | Duration: September 2022 until 31 August 2025Read more HORSE Funded by: Holistic, Omnipresent, Resilient Services for Future 6G Wireless and Computing Ecosystems | Duration: 1 January 2023 until 31 December 2025Read more Past Projects Previous Projects (Projects before joining CRAAX) Fast virtual SoC for advanced GPS algorithm evaluation. Duration: 01/11/2019 – 30/04/2020. Disseny d’acceleradors basats en la tecnologia RISC per a la propera generació de computadors (DRAC). Duration: 01/06/2019 – 31/12/2022. Resiliencia Unificada para Sistemas Informáticos. Duration: 01/06/2019 – 31/05/2022. CPU Steal Time in Linux Container Based Infrastructures. Duration: 01/10/2017 – 30/09/2018. Encapsulado de herramientas virtual para una gestión robusta de la heterogeneidad entre capas en sistemas ciberfísicos complejos. Duration: 01/03/2017 – 31/10/2019. Protección, búsqueda e interoperabilidad de contenidos multimedia: nuevas técnicas y aplicaciones. Duration:  01/01/2012 – 30/06/2015. Análisis de video consciente de la privacidad para vigilancia inteligente. PRIVATE. Duration:  15/05/2009 – 14/05/2010. Red de excelencia en adquisición, categorización, análisis e integración de contenidos. CONQUEST. Duration: 01/04/2009 – 31/03/2010. Gestion De Ciclo De Vida De Contenidos Multimedia. Duration: 01/01/2009 – 31/12/2011. GILDDA (Gestión Integral para el Libro Digital: Derechos de Autor, Contenidos y Negocio). Duration: 01/10/2007 – 31/12/2008. Segur@. Seguretat i confiança en la societat de la informació. Duration: 07/09/2007 – 31/12/2010. E2E RM (End to End Rights Management). Duration: 01/07/2007 – 31/12/2008. VISNET II (NETworked audioVISual media technologies). Duration: 30/09/2006 – 01/06/2009. Automating production of cross media content for multichannel distribution. Duration: 01/09/2006 – 31/08/2008. Projecte Machine. Duration: 01/05/2006 – 01/12/2007. DRM-MM (Gestió de Drets Digitals en E-Serveis Multimèdia). Duration: 01/10/2005 – 01/10/2008. Projecte Integrat 2004 – Mòduls Dret i Seguretat. Duration: 01/05/2004 – 31/10/2005. VISNET (NETworked audioVISual media technologies). Duration: 01/12/2003 – 31/12/2005. AgentWeb (Agentes y ontologias para la gestión de derechos digitales y servicios web). Duration: 01/12/2002 – 01/12/2005.",
  "content_length": 6376,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:19"
}