{
  "name": "Eva Rotenberg",
  "homepage": "https://pure.itu.dk/en/persons/eva-rotenberg",
  "status": "success",
  "content": "Eva Rotenberg - IT-University of Copenhagen Eva Rotenberg Professor, Theoretical Computer Science Emailerotitudk 20232025 Research activity per year Fingerprint Dive into the research topics where Eva Rotenberg is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 5 Similar Profiles Data Structure Computer Science 100% Running Time Mathematics 83% Planar Graph Mathematics 71% Edge Mathematics 65% Convex Hull Mathematics 57% Approximates Mathematics 57% Approximation (Algorithm) Computer Science 57% Subgraphs Computer Science 57% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2023 2024 2025 2025 19 Article in proceedings 3 Journal article 1 Paper Research output per year Research output per year A Combinatorial Proof of Universal Optimality for Computing a Planar Convex Hull.van der Hoog, I., Rotenberg, E. & Rutschmann, D., 2025, Annual European Symposium on Algorithms (ESA 2025). Vol. 351. p. 102:1-102:13 13 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access A Dynamic Piecewise-Linear Geometric Index with Worst-Case Guarantees.Gæde, E. T., van der Hoog, I., Rotenberg, E. & Stordalen, T., 2025, 33rd Annual European Symposium on Algorithms: ESA 2025, September 15–17, 2025, Warsaw, Poland. Benoit, A., Kaplan, H., Wild, S. & Herman, G. (eds.). Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik GmbH, p. 64:1-64:18 19 p. 64. (Leibniz International Proceedings in Informatics).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Piecewise Linear 100% Geometric Index 100% Worst-Case Guarantees 100% Separating Line 50% Indexing Data 20% Approximating Klee's Measure Problem and a Lower Bound for Union Volume EstimationBringmann, K., Larsen, K. G., Nusser, A., Rotenberg, E. & Wang, Y., 2025, 41st International Symposium on Computational Geometry: SoCG 2025, June 23–27, 2025, Kanazawa, Japan. Aichholzer, O. & Wang, H. (eds.). Saabrucken/Waden: Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik GmbH, Vol. 332. p. 25:1-25:16 16 p. 25. (Leibniz International Proceedings in Informatics (LIPIcs)).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Measurement Problem 100% Volume Estimation 100% Klee's Measure Problem 100% Running Time 100% Approximates 100% Augmenting Plane Straight-Line Graphs to Meet Parity Constraints.Christiansen, A. B. G., Kleist, L., Parada, I. & Rotenberg, E., 14 Feb 2025, Graph-Theoretic Concepts in Computer Science - 50th International Workshop, WG 2024, Gozd Martuljek, Slovenia, June 19-21, 2024, Revised Selected Papers. Vol. abs/2502.10066. Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Straight Line 100% Parity Constraints 100% Supergraph 100% Line Graph 100% Convex Position 50% Distributed Computation with Local AdviceBalliu, A., Brandt, S., Kuhn, F., Nowicki, K., Olivetti, D., Rotenberg, E. & Suomela, J., 2025, 39th International Symposium on Distributed Computing (DISC 2025): DISC 2025, October 27-31, 2025, Berlin, Germany. Kowalski, D. R. (ed.). Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik GmbH, Vol. 356. p. 12:1-12:19 19 p. 12. (Leibniz International Proceedings in Informatics (LIPIcs)).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access 1-bit 100% Maximum Degree 66% Locally Checkable Labellings 50% Subexponential Growth 37% Main Result 33% View all 23 research outputs Datasets Practical Insertion-Only Convex Hullvan der Hoog, I. (Creator), Reinstädtler, H. (Creator) & Rotenberg, E. (Creator), ZENODO, 8 Oct 2025DOI: 10.5281/zenodo.17109557Dataset: Software Dense Dataset from the paper \"From Theory to Practice: Engineering Approximation Algorithms for Dynamic Orientation\".Großmann, E. (Creator), Hoog, I. V. D. (Creator), Reinstädtler, H. (Creator), Rotenberg, E. (Creator), Schulz, C. (Creator) & Vlieghe, J. M. V. (Creator), ZENODO, 1 Jul 2025DOI: 10.5281/zenodo.15785840Dataset",
  "content_length": 4621,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:17"
}