{
  "name": "Evaggelia Pitoura",
  "homepage": "https://cs.uoi.gr/~pitoura",
  "status": "success",
  "content": "Evaggelia Pitoura Diploma, CEID, Univ. of Patras, Greece, 1990 MSc, Purdue University, USA, 1993 PhD, Purdue University, USA, 1995 Evaggelia Pitoura Professor, CEID, University of Ioannina, GR-45110 Ioannina, Greece Lead Researcher,Archimedes Research Unit, ATHENA RC Phone: +30-26510-08811 (Office) Fax: +30-26510-08890 E-mail: pitoura[@]uoi[.]gr Distributed Management of Data Group [Research][Publications] [Teaching] Miscellaneous] [Professional Activities] (26/8/2023) ÈÝìáôá äéðëùìáôéêþí åñãáóéþí ãéá ôï Áêáäçìáúêü ¸ôïò 2023-2024 êáé äéáäéêáóßá áíÜèåóçò åäþ Research My research focuses on data. PhD Graduates Georgia Koloniari, Assistant Professor, Univ. of Macedonia, Greece Kostas Stefanidis, Associate Professor, Tampere University, Finland Marina Drosou, Software Engineer, Hellenic Ministry of Citizen Protection Konsatntinos Semertzidis, Research Engineer, IBM Research, Ireland Publications M. Drosou and E. Pitoura DisC Diversity: Result Diversification based on Dissimilarity and Coverage PVLDB 2013 (best paper award) K. Semertzidis, E. Pitoura and P. Tsaparas: How people describe themselves on Twitter. DBSocial 2013: 25-30 (best paper award) Preferences and Ranking K. Stefanidis, G. Koutrika and E. Pitoura. A Survey on Representation, Composition and Application of Preferences in Database Systems. ACM TODS, 2011 local copy K. Stefanidis, E. Pitoura and P. Vassiliadis. Managing Contextual Preferences. Information Systems, 2011 local copy K. Stefanidis and E. Pitoura. PerK: Personalized Keyword Search in Relational Databases through Preferences EDBT 2010 local copy K. Stefanidis and E. Pitoura. Fast Contextual Scoring of Database Tuples EDBT 2008 local copy K. Stefanidis, E. Pitoura and P. Vassiliadis. Adding Context to Preferences ICDE 2007. Content Overlays G. Koloniari and E. Pitoura A Game-Theoretic Approach to the Formation of Clustered Overlays IEEE TPDS, 23(4), April 2012 local copy additional material G. Koloniari and E. Pitoura LCA-based Selection for XML Document Collections WWW 2010 local copy G. Koloniari and E. Pitoura. A Recall-based Cluster Formation Game in Peer-to-Peers Systems PVLDB 2009 local copy G. Koloniari and E. Pitoura. Distributed Structural Relaxation of XPath Queries ICDE 2009 local copy K. Lillis and E. Pitoura. Cooperative XPATH Caching, SIGMOD 2008 local copy Diversity M. Drosou and E. Pitoura DisC Diversity: Result Diversification based on Dissimilarity and Coverage PVLDB 2013 (to appear) M. Drosou and E. Pitoura Dynamic Diversification of Continuous Data, EDBT 2012 local copy M. Drosou, K. Stefanidis and E. Pitoura, Preference-Aware Publish/Subscribe Delivery with Diversity , DEBS 2009 Selected V. V. Dimakopoulos and E. Pitoura. On the Performance of Flooding-Based Resource Discovery IEEE TPDS, 17(11) pg 1242-1252, Nov 2006. local copy G. Koloniari and E. Pitoura. Content-based Routing of Path Queries in Peer-to-Peer Systems. EDBT 2004. E. Pitoura and G. Samaras. Locating Objects in Mobile Computing. IEEE Transactions on Knowledge and Data Engineering. Vol. 13, No. 4, pp. 571-592, July/August 2001 E. Pitoura and P. Chrysanthis. Exploiting Versions for Handling Updates in Broadcast Disks, in VLDB 1999. S. Papastavrou, G. Samaras and E. Pitoura. Mobile Agents for Distributed WWW Access, Proceedings of the 15th International Conference on Data Engineering (ICDE99), March 1999 Best Paper Award . E. Pitoura and B. Bhargava. Data Consistency in Intermittently Connected Distributed Systems. IEEE Transactions on Knowledge and Data Engineering 11(6), pp 896-915, Nov/Dec 1999. E. Pitoura, O. Bukhres and A. Elmagarmid. Object-Orientation in Multidatabase Systems, ACM Computing Surveys, Vol. 27, No 2, pp. 141--195, June 1995. Publication list Citations of my work from Google Scholar Teaching Academic Year 2024-2025 Fall 2023: ÌÕÕ701: ÂÜóåéò ÄåäïìÝíùí Spring 2025: ÌÕÅ003: ÁíÜêôçóç Ðëçñïöïñßáò Miscellaneous Greek ACM-W winter school on fairness in AI Professional Activities PC Co-chair for ICDE 2012 Demo PC Co-chair for VLDB 2012 Selected Recent (2010 - ) PC member: SIGMOD 2012, ICDCS2012 SIGMOD 2010 (group leader) WWW 2010 (poster PC co-chair) CIKM 2010 (senior PC member) EDBT 2010 (demo committee) MDM 2010 (seninar co-chair) WISE 2011, EDBT 2011, EDBT 2010, VLDB 2010 (PC member) Past",
  "content_length": 4283,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:18"
}