{
  "name": "Evangelos E. Papalexakis",
  "homepage": "https://www.cs.ucr.edu/~epapalex",
  "status": "success",
  "content": "Vagelis Papalexakis - Ross Family Chair and Associate Professor - University of California Riverside Vagelis Papalexakis, Ross Family Chair and Associate Professor Computer Science & Engineering Department Menu: Home Research Group Publications Teaching Code Research Interests My research broadly spans the areas of data science, signal processing, machine learning, and artificial intelligence. The overarching theme of my work has been the design and development of models and algorithms that can extract actionable and interpretable insights from multi-aspect/multi-modal data, typically with very little or no supervision. A major focus of my research has been on the development and advancement of tensor methods and their applications in high-impact real-world problems. Download my CV Quick links: Computer Science & Engineering Department @ UCR Computer Science Department @ CMU ECE Department @ TUC Contact Email epapalexcs dot ucr dot edu vagelis.papalexakisgmail dot com Location 3132 Multidisciplinary Research Building Computer Science & Engineering Department University of California Riverside 900 University Ave Riverside, CA 92521 USA Web Presence About me Hello there! My name is Vagelis Papalexakis (my 'official' name is Evangelos, but nobody really calls me that) and I come from the beautiful city of Athens, Greece. I received my Electronic & Computer Engineering Diploma and M.Sc at the Technical University of Crete in Chania, under the supervision of Professor Nikos Sidiropoulos. I received my Ph.D from the Computer Science Department of Carnegie Mellon University under the supervision of Professor Christos Faloutsos. Currently, I am an Associate Professor and the Ross Family Chair at the Computer Science & Engineering Department at the University of California Riverside, working broadly on data mining, machine learning, and data science research. You can get a quick idea about my research by browsing through my list of publications. A major focus of my research is tensor decompositions for machine learning and data science. In order to get a better idea of this research area, feel free to check out two relevant recent surveys that I have co-authored: one geared more towards data science practitioners and one geared more towards the fundamental concepts necessary to start algorithmic research in the area. My work has attracted a number of distinctions, including the 2017 SIGKDD Dissertation Award (runner-up), the National Science Foundation CAREER award, the 2021 IEEE DSAA Next Generation Data Scientist Award, and the ICDM 2022 Tao Li Award which awards excellence in early-career researchers. News and travel August 2024 New NSF grant in close collaboration with The University of Texas Rio Grande Valley: CISE MSI: RPEP: CPS: Trustworthy AI for Transportation Cyber-Physical Systems July 2024 Co-organized for the 4th year in a row the Data Science Challenge with Lawrence Livermore National Laboratory! July 2024 Excited to attend and give an invited talk at the 2024 Graph Exploitation Symposium (GraphEx) on Generating Low Rank Graphs July 2024 Excited to co-organize the 2024 Data Science High School Summer Camp at UCR! July 2024 Honored to be appointed the Ross Family Chair in Computer Science May 2024 Delighted to give a remote keynote talk at the TrustLOG@WWW workshop collocated with The Web Conference April 2024 Attended and chaired SIAM SDM 2024 and presented one paper March 2024 Delighted to give a remote talk to the Warner Bros Discovery AI & ML Tech Talk Series! March 2024 Two papers to appear at the Short Paper Track of The Web Conference 2024! One paper in collaboration with Seekr and deals with tensor-based multi-modal news categorization, and the other paper is introducing a GPT text detection benchmark and a tensor-based method. February 2024Attended the Information Theory and Applications (ITA) Workshop in San Diego and presented work on Low-Rank Approximation and Robustness October 2023 Super excited and honored to be co-organizing IEEE DSAA 2024 in San Diego next October! August 2023 Attended KDD’24 in Long Beach! Co-organized the first Southern California Data Science Symposium, as part KDD’24, which was a great success with invited speakers and contributed poster presentations! July 2023: Delivered a week-long seminar on AI and Data Science to Redlands Unified School District students! July 2023: Excited to see our book chapter on Machine Learning for Complex Instrument Design and Optimization being published! July 2023: Our 2023 iteration of the Data Science Challenge with Lawrence Livermore National Lab and UC Merced was a great success! June 2023: Visited Université Paris Cité, Laboratory of Informatics Paris Descartes (LIPADE) and gave a keynote talk as part of the 8th LIPADE Day June 2023: Attended ICASSP’23 and participated in the awards ceremony for the IEEE Signal Processing Society Donald G. Gink Overview Paper Award. May 2023: Extremely honored and excited to be the General Co-Chair for SIAM Data Mining (SDM) 2024! May 2023: Attended the kick-off meeting of our University Transportation Center at the USDOT in Washington DC, and was very honored to meet USDOT Research and Technology Deputy Assistant Secretary and Chief Science Office Robert C. Hampshire February 2023: Extremely honored that our Tensor survey paper is the recipient of the IEEE Signal Processing Society Donald G. Fink Overview Paper Award which \"honors the authors of a journal article that has had substantial impact over several years on a subject related to the Signal Processing Society's technical scope\"! February 2023: Excited and honored to be part of a funded University Transportation Center (UTC) grant by the US Department of Transportation led by The University of Texas Rio-Grande Valley, focusing on Railway Safety! December 2022: Extremely honored to be the recipient of the 2022 ICDM Tao Li Award which rewards excellent early career researchers in data mining September 2022: Paper \"TENALIGN: Joint Tensor Alignment and Coupled Factorization\" accepted as full paper at IEEE ICDM 2022 September 2022: Paper \"APTERA: Automatic PARAFAC2 Tensor Analysis\" accepted at ASONAM 2022 September 2022: Paper \"TensorShield: Tensor-Based Defense Against Adversarial Attacks on Images\" accepted at MILCOM 2022 September 2022: Paper on \"Multi-aspect Matrix Factorization based Visualization of Convolutional Neural Networks\" accepted at IEEE DSAA 2022 August 2022: Paper on \"Unsupervised Multiview Embedding of Node Embeddings\" accepted at Asilomar August 2022: Attended KDD 2022! Great to be back in person!! June 2022: Gave a talk at CISCO Research March 2022: Received a Cisco Research Faculty Award March 2022: Gave a talk at Megagon Labs. February 2022: Gave a talk at the ML Seminar at Vanderbilt University. November 2021 Started as Editor-in-Chief for Elsevier Big Data Research October 2021Received the 2021 IEEE DSAAA Next Generation Data Scientist Award! October 2021Our collaboration paper with Instacart on tensor-based complementary basket recommendation was accepted at IEEE BigData 2021 October 2021 New NSF award (as subaward from University of Texas Rio Grande Valley): NSF CREST - Center for Multidisciplinary Research Excellence in Cyber-Physical Infrastructure Systems (MECIS) September 2021Received a NSF award from the Advancing Discovery with AI-Powered Tools (ADAPT) in the Mathematical and Physical Sciences\" program titled EAGER: ADAPT: Understanding Nonlinear Noise in LIGO: A Machine Learning Approach\"! August 2021Super excited to be Program Chair for SIAM International Conference on Data Mining (SDM) 2022, with Matteo Riondato! August 2021Co-organizing a Data Science Challenge with Lawrence Livermore National Laboratory on ML/Data Science for near-Earth object detection and planetary defense! August 2021: Two papers (Niche Detection in User Content Consumption Data and Mining Bursty Groups from Interaction Data) accepted at CIKM! July 2021: New NSF CNS grant on Scalable Learning from Distributed Data for Wireless Network Management! June 2021: Received the Bourns College of Engineering (BCOE) Distinguished Teaching Award for 2021! June 2021: As of July 1, 2021, I will be an Associate Professor with tenure at the CSE department at UCR! June 2021: Received the NSF CAREER Award on Autonomous Tensor Analysis: From Raw Multi-Aspect Data to Actionable Insights! June 2021: Gave a remote talk at the In-Service Engineering Agent of the Future Data Science Virtual Forum organized by NSWC Corona. March 2021: Gave a remote guest lecture at Eastvale STEM Academcy eSTEM Virtual Expo January 2021:Gave a remote guest lecture/talk at Northeastern University, NetSI Machine Learning with Graphs Seminar, hosted by Tina Eliassi-Rad November 2020:Gave a remote invited talk at the One World Signal Processing Seminar Series. Video of the talk is also available November 2020:Gave a remote invited talk at the AAAI 2020 Fall Symposium on Physics-Guided AI to Accelerate Scientific Discovery September 2020: Gave a remote colloqium talk at Rochester Institute of Technology, hosted by Panos Markopoulos September 2020:Gave a remote talk at Instacart, hosted by Haixun Wang August 2020: Gave a remote talk at the ECE TUC Virtual Summer School on Data Analysis 2020 March 2020: Gave a remote talk at Microsoft Bing Ads Bay Area, hosted by Rukmini Iyer February 2020: Attended ITA 2020 in San Diego, WSDM 2020 in Houston, and SIAM PP 2020 in Seattle. December 2019: Represented UCR and talked about AI research in UCR and my group as part of a UC Congressional Briefing on AI, to members of Congress and staffers December 2019: Gave a keynote at the GTA3 workshop on Graph techniques for adversarial analytics at IEEE Big Data in Los Angeles November 2019: Attended EMNLP 2019 in Hong Kong and helped present our paper on small-sample humor recognition using tensor embeddings October 2019: While in Pittsburgh, I attended and presented at IEEE MLSP and gave a talk at CMU. Sept",
  "content_length": 17880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:20"
}