{
  "name": "Evangelos Karapanos",
  "homepage": "https://www.cut.ac.cy/faculties/comm/cis/staff/evangelos.karapanos/?languageId=1",
  "status": "success",
  "content": "CYPRUS UNIVERSITY OF TECHNOLOGY ΕΛ EN 20 Years CUT myUni Library Faculties Faculty of Communication and Media Studies Department of Communication and Internet Studies Staff Evangelos Karapanos Faculties Faculty of Communication and Media Studies Department of Communication and Internet Studies Staff Evangelos Karapanos Evangelos Karapanos Associate professor Department of Communication and Internet Studies evangelos.karapanos@cut.ac.cy 00357 2500 2315 Dr. Evangelos Karapanos is Associate Professor in the Department of Communication and Internet Studies, the Director of the Persuasive Technologies Lab and the Coordinator of the Doctoral Program of the Department of Communication and Internet Studies of the Cyprus University of Technology (CUT). Dr. Karapanos holds a PhD (cum laude) in Human-Computer Interaction from Eindhoven University of Technology, a MSc in Human-Computer Interaction from University College London, and a BSc in Physics with a specialization in microelectronics from the University of Patras. His expertise is in experience-centred design of interaction with technology. His work is regularly published at [...]top-tier conferences and journals in Human-Computer Interaction and has received more than 2300 citations in the literature (h-index=23, i10-index=41, source: Google Scholar) and a number of awards, including a best paper and a best poster award at Persuasive Technology 2017, an honorable mention for best paper at Ubicomp 2015, the tech challenge for atrocity prevention 2013 Award, and the cum laude distinction for his PhD thesis (given to the top 5% of PhD theses defended annually at the Eindhoven University of Technology). Research Publications Studies Teaching Employment Awards Research Publications Studies Teaching Employment Awards Research His research interests lie in the field of Human-Computer Interaction, with an emphasis on methods of design and evaluation of interactive systems and behavior change technologies in particular. Research Projects A/A Date Title Funded by Project Role 1 2018 Co-inform: Co-Creating Misinformation-Resilient Societies, H2020 Research Team Member 2 2017 U-PHIT: Understanding and designing for the long-term acceptance of Personal Health Informatics Tools Cyprus University of Technology Project Coordinator 3 2016 European Network for the Joint Evaluation of Connected Health Technologies (ENJECT) COST Research Team Member 4 2014 Studying the factors that drive users' long-term engagement with personal health informatics Carnegie Mellon Portugal Project Coordinator 5 2011 Web Security and Privacy – Weaving together technology innovation with human and policy considerations Carnegie Mellon Portugal Project Coordinator 6 2011 Logica Service Design Lab Logica & Regional Government of Madeira Research Team Member 7 2011 DELUX – Delightful Long-Term User Experience: Creating Customer Loyalty TEKES – Finish Funding Agency for Technology and Innovation International Partner 8 2011 TwinTide – towards the evaluation of transectorial IT design and evaluation COST Research Team Member 9 2010 Sustainable Interaction with social Networks, context Awareness and Innovative Services Carnegie Mellon Portugal Research Team Member Publications Monographs and edited books Oinas-Kukkonen, H., Win, K. T., Karapanos, E., Karppinen, P., & Kyza, E. (Eds.). (2019). Persuasive Technology: Development of Persuasive and Behavior Change Support Systems: 14th International Conference, PERSUASIVE 2019, Limassol, Cyprus, April 9-11, 2019, Proceedings (Vol. 11433). Springer. Kyza, E. A., Karppinen, P., Karapanos, E., Win, K. T., & Oinas-Kukkonen, H. (2019). Persuasive Technology: 14th International Conference, PERSUASIVE 2019 Limassol, Cyprus, April 9–11, 2019 Adjunct Proceedings. Ham, J., Karapanos, E., Morita, P. P., & Burns, C. M. (Eds.). (2018). Persuasive Technology: 13th International Conference, PERSUASIVE 2018, Waterloo, ON, Canada, April 18-19, 2018, Proceedings (Vol. 10809). Springer. Karapanos, E. (2013) Modeling Users’ Experiences with Interactive Systems. Studies in Computational Intelligence 436, Springer, Vol 436, isbn 978-3-642-30999-1, pp. 1-164. IN JOURNALS Karapanos, E. (2019). Technology-assisted reconstruction: a new alternative to the experience sampling method. Behaviour & Information Technology, 1-19. Dillahunt, T., Lyra, O., Barreto, M., & Karapanos, E. (2017). Reducing children’s psychological distance from climate change via eco-feedback technologies. International Journal of Child-Computer Interaction, 13, 19-28. Karapanos, E., Gouveia, R., Hassenzahl, M., & Forlizzi, J. (2016). Wellbeing in the Making: Peoples’ Experiences with Wearable Activity Trackers. Psychology of Well-Being, 6(1), 1-17. Karapanos, E., Teixeira, P., & Gouveia, R. (2016). Need fulfillment and experiences on social media: A case on Facebook and WhatsApp. Computers in Human Behavior, 55, 888-897. Karapanos, E. (2015) Sustaining user engagement with behavior-change tools. interactions 22, 4 (June 2015), 48-52. Goncalves, J., Hosio, S., Rogstadius, J., Karapanos, E., & Kostakos, V. (2015). Motivating participation and improving quality of contribution in ubiquitous crowdsourcing. Computer Networks. Niforatos, E., & Karapanos, E. (2015). EmoSnaps: a mobile application for emotion recall from facial expressions. Personal and Ubiquitous Computing, 19(2), 425-444. Liu, Y., Venkatanathan, J., Goncalves, J., Karapanos, E., and Kostakos, V. (2014). Modeling What Friendship Patterns on Facebook Reveal About Personality and Social Capital. ACM Transactions Computer-Human Interaction 21 (3), 20 pages. DOI=10.1145/2617572 http://doi.acm.org/10.1145/2617572 Barreto, M. L., Szóstek, A., Karapanos, E., Nunes, N. J., Pereira, L., & Quintal, F. (2014). Understanding families’ motivations for sustainable behaviors. Computers in Human Behavior, 40, 6-15. Lucero, A., Karapanos, E., Arrasvuori, J., & Korhonen, H. (2014). Playful or Gameful?: creating delightful user experiences. interactions, 21(3), 34-39. Venkatanathan1, J., Kostakos, V., Karapanos, E., and Goncalves, J. (2013) Online Disclosure of Personally Identifiable Information with Strangers: Effects of Public and Private Sharing, Interacting with Computers, First published online: November 12, 2013, doi: 10.1093/iwc/iwt058. Gonçalves, J., Kostakos, V., Karapanos, E., Barreto, M., Camacho, T., Tomasic, A., & Zimmerman, J. (2013). Citizen Motivation on the Go: The Role of Psychological Empowerment. Interacting with Computers, First published online: July 3, 2013. doi: 10.1093/iwc/iwt035 Rogstadius, J., Vukovic, M., Teixeira, C. A., Kostakos, V., Karapanos, E., & Laredo, J. A. (2013). CrisisTracker: Crowdsourced social media curation for disaster awareness. IBM Journal of Research and Development, 57(5), pp1-13. Karapanos, E., Martens J.-B. and Hassenzahl, M. (2012) Reconstructing experiences with iScale, International Journal of Human-Computer Studies, 70 (11), pp. 849-865. Karapanos, E., Barreto, M., Nisi, V., & Niforatos, E. (2012). Does locality make a difference? Assessing the effectiveness of location-aware narratives. Interacting with Computers, 24(4), pp. 273-279. Doerflinger, J., Gross, T.,; Lyra, O., Karapanos, E., Kostakos, V., Cuadrado-Cordero, I., Soria-Morillo, L.M., Gonzalez-Abril, L., Ortega-Ramirez, J.A., Pau de la Cruz, I., Valero Duboy, M.A., Kanjo, E. (2012) ICTD Work, Plus mFeel, Pervasive Computing, IEEE 11 (3), pp.43-45. Niforatos, E., Karapanos, E., & Sioutas, S. (2012). PLBSD: a platform for proactive location-based service discovery. Journal of Location Based Services, 6(4), pp. 234-249. Kujala, S., Roto, V., Väänänen-Vainio-Mattila, K., Karapanos, E., & Sinnelä, A. (2011). UX Curve: A method for evaluating long-term user experience. Interacting with Computers, 23(5), pp. 473-483. Karapanos, E., Zimmerman, J., Forlizzi, J., & Martens, J. B. (2010). Measuring the dynamics of remembered experience over time. Interacting with Computers, 22(5), pp 328-335. Tomico, O., Karapanos, E., Lévy, P., Mizutani, N., & Yamanaka, T. (2009). The repertory grid technique as a method for the study of cultural differences. International Journal of Design, 3(3), 55-63. Funk, M., Rozinat, A., Karapanos, E., Alves de Medeiros, A. K., & Koca, A. (2010). In situ evaluation of recommender systems: Framework and instrumentation. International journal of human-computer studies, 68(8), pp. 525-547. Koca, A., Funk, M., Karapanos, E., Rozinat, A., Aalst, W.M.P. van der, Corporaal, H., Martens, J.B.O.S., Putten, P.H.A. van der, Weijters, A.J.M.M., Brombacher, A.C. (2009). Soft reliability: an interdisciplinary approach with a user-system focus. Quality and Reliability Engineering International, 25(1), pp. 3-20. IN Conference proceedings Konstantinou, L., Caraban, A., & Karapanos, E. (2019). Combating Misinformation Through Nudging. In IFIP Conference on Human-Computer Interaction (pp. 630-634). Springer, Cham. Piccolo, L. S., Joshi, S., Karapanos, E., & Farrell, T. (2019). Challenging Misinformation: Exploring Limits and Approaches. In IFIP Conference on Human-Computer Interaction (pp. 713-718). Springer, Cham. Caraban, A., Karapanos, E., & Goncalves, D., Campos, P. (2019). 23 Ways to Nudge: A Review of Technology-Mediated Nudging in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM. Duro, L., Campos, P. F., Romão, T., & Karapanos, E. (2019). Visual Quotes: Does Aesthetic Appeal Influence How Perceived Motivating Text Messages Impact Short-Term Exercise Motivation?. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (p. LBW0139). ACM. Gouveia, R., Karapanos, E., & Hassenzahl, M. (2018). Activity Tracking in vivo. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 362). ACM. Konstanti, C., & Karapanos, E. (2018). An Inquiry into Goal-Setting Practices with Physical Activity Trackers. In Extended Abstracts of the 2018 CHI Conference on ",
  "content_length": 29815,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:05"
}