{
  "name": "Evan Suma Rosenberg",
  "homepage": "https://illusioneering.cs.umn.edu",
  "status": "success",
  "content": "Illusioneering Lab Immersive User Interfaces Spatial interaction unbounded by the laws of physics. Read More Redirected Walking \"Hacking the senses\" to enable infinite movement in virtual reality. Read More Rapid Content Creation Capture and digitization of real world objects, people, and behaviors. Read More Embodied Interaction Motion and gesture interfaces for health, rehabilitation, and entertainment. Read More Evan Suma Rosenberg, Ph.D. Associate Professor Dept. of Computer Science & Engineering University of Minnesota Office: 6-201 Keller Hall Phone: (612) 301-2560 Email: suma at umn dot edu Curriculum Vitae The Illusioneering Lab advances immersive technologies, develops innovative spatial interaction techniques, and creates impactful experiences in virtual and mixed reality. Immersion Immersive technologies can create compelling illusions of being transported to a distant place or sharing space with someone who is not actually present. Perception Virtual and augmented reality provide new opportunities to study human perception and investigate phenomena that would be impossible to experience in the real world. Interaction Interaction in virtual worlds is inherently spatial and embodied, with emerging applications in data analysis, education, health care, and entertainment. Interested in learning more? Info for Students Recent News Papers Paper accepted to ACM SUI! Fei Wu will present the paper Don’t Block the Ground: Reducing Discomfort in Virtual Reality with an Asymmetric Field-of-View Restrictor at ACM SUI! The conference will be held virtually on November 9-10, 2021. Announcements Congratulations Jerald! Jerald Thomas has been awarded a CRA/CCC Computing Innovation Postdoctoral Fellowship! He will be starting in January at Virginia Tech under the mentorship of Doug Bowman. Papers Best paper at ACM VRST! The lab took home a best paper award from ACM VRST! Towards Physically Interactive Virtual Environments: Reactive Alignment with Redirected Walking was selected as one of the top two papers at the conference (132 submissions, Read more… Announcements Congratulations Courtney! Courtney Hutton Pospick has been selected as a 2020-2021 Achievement Rewards for College Scientists (ARCS) Foundation Scholar! The award is made to graduate-level scholars who have high scholastic records and have been identified for their Read more… Papers Paper accepted to ICAT-EVGE! Fei Wu will present the paper Comparison of Audio and Visual Cues to Support Remote Guidance in Immersive Environments at ICAT-EVGE 2020! Special congratulations to co-author Shreyas Chinnola, who was a high school student at the Read more… Papers Two papers accepted to ACM VRST! The lab has two full papers accepted at ACM VRST 2020! Jerald Thomas will present the paper, Towards Physically Interactive Virtual Environments: Reactive Alignment with Redirected Walking. Evan Suma Rosenberg will present Capture to Rendering Pipeline for Read more… Visit the lab 2-208 Keller HallÂ 200 Union St SEMinneapolis, MN 55455 Get in touch Evan Suma Rosenberg, Ph.D.suma at umn dot edu(612) 301-2560 Contact Us Your Name Your Email Subject Your Message",
  "content_length": 3154,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:19"
}