{
  "name": "Evangelos A. Theodorou",
  "homepage": "https://ae.gatech.edu/people/evangelos-theodorou",
  "status": "success",
  "content": "Evangelos Theodorou Skip to main navigation Skip to main content Evangelos Theodorou External Website Evangelos Theodorou Associate Professor Email Address evangelos.theodorou@gatech.edu Telephone 404-894-8197 Office Building Guggenheim Office Room Number 448A Biography Evangelos Theodorou earned his diploma in electronic and computer engineering from the Technical University of Crete (TUC), Greece in 2001. He has also received a MSc in production engineering from TUC in 2003, a MSc in computer science and engineering from University of Minnesota in spring of 2007 and a MSc in electrical engineering on dynamics and controls from the University of Southern California(USC) in Spring 2010. In May of 2011 he graduated with his PhD, in computer science at USC. After his PhD, he became a postdoctoral research associate with the department of Computer Science and Engineering, University of Washington, Seattle. In July 2014 he joined the faculty of the Daniel Guggenheim School of Aerospace Engineering at Georgia Institute of Technology as assistant professor. His theoretical research spans the areas of control theory, machine learning, information theory and statistical physics. Applications involve autonomous planning and control in robotics and aerospace systems, bio-inspired control and design. Research Lab/Collaborations: Autonomous Control and Decision Systems Laboratory (ACDS) Institute for Robotics and Intelligent Machines (IRIM) Disciplines: Systems Design & Optimization Flight Mechanics & Controls AE Multidisciplinary Research Areas: Robotics, Autonomy, and Human Interactions Education Diploma in Electronic and Computer Engineering, Technical University of Crete, 2001; M.S in Production Engineering and Management, Technical University of Crete, 2004; M.S. in Computer Science and Engineering, University of Minnesota, 2007; M.S. in Electrical Engineering, University of Southern California, 2010; Ph.D in Computer Science, University of Southern California, 2011; Distinctions & Awards Best Research Assistant Fellow in Computer Science USC 2010 USC Myronis Fellowship 2009",
  "content_length": 2104,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:20"
}