{
  "name": "Evangelos P. Markatos",
  "homepage": "https://www.csd.uoc.gr/CSD/index.jsp?custom=evangelos_markatos&lang=en",
  "status": "success",
  "content": "Evangelos Markatos | Computer Science Department - University of Crete Contact Announcements | News Department Brochure GR EN webmailelearneduportal Start Page People Academic Staff Evangelos Markatos Evangelos Markatos A+ A- Professor of Computer Science, University of Crete Department of Computer Science, University of Crete Voutes Campus 700 13 Heraklion Crete, Greece Affiliated Researcher to ICS-FORTH Institute of Computer Science (ICS) Foundation for Research and Technology - Hellas (FORTH) N.Plastira 100, Vassilika Vouton P.O Box 1385 GR-70013 Heraklion, Crete, GREECE Phone: +30 2810 391655 Fax: +30 2810 391601 E-mail: markatosATics.forth.gr http://users.ics.forth.gr/~markatos/ Prof. Evangelos Markatos is a Professor in the Department of Computer Science, University of Crete and the head of the Distributed Computing Systems Laboratory of the Institute of Computer Science, FORTH. Research Interests His research interests are in the broader area of Systems: Internet Systems and Monitoring Systems and Network Security World Wide Web Internet Systems and Technologies Operating Systems Participation in Recent Research Projects CyberSec4Europe: Establishing and operating a pilot for a Cybersecurity Competence Network to develop and implement a common Cybersecurity Research & Innovation Roadmap https://cybersec4europe.eu/ CC-DRIVER: Understanding the drivers of cybercriminality, and new methods to prevent, investigate and mitigate cybercriminal behaviour. https://www.ccdriver-h2020.com/ RAIS: Real-time Analytics for the Internet of Sports. https://rais-itn.eu/ REACT: REactively Defending against Advanced Cybersecurity Threats. https://react-h2020.eu/ FORMOBILE: From Mobile Phones to Court. https://formobile-project.eu/ Brief CV Evangelos Markatos Professor at the Department of Computer Science of the University of Crete, is the head of the Distributed Computing Systems Lab of the Institute of Computer Science, Foundation for Research and Technology - Hellas. Over the past 15 years, Prof. Markatos has served as the Primary Investigator in more than 40 National and European Commission funded projects in the fields of Security, Networking, and High Performance Computing. He has published more than 100 technical papers in scientific archival journals, proceedings of international conferences and workshops related to his fields of expertise. He has also served as a member of the Technical Program Committee of leading conferences, such as ACM ASPLOS, ACM SIGMETRICS, IEEE ICDCS, etc. He has been among the founding members and the First Program Committee co-chair of the EuroSec, the European Workshop on Systems Security, held annually since 2008 in collaboration with EuroSys, the leading European ACM Conference on Computer Systems. Since the early 2000s, Prof. Markatos has been actively involved in activities implementing the European Commission R&D Policy on Information Society. For example, he has been the coordinator of the LOBSTER, NoAH, i-code projects. LOBSTER, in particular, has installed the largest passive Internet monitoring infrastructure in Europe. Prof. Markatos is currently the coordinator of the SysSec Network of Excellence which mobilizes the research Community in Europe to manage threats and vulnerabilities for the Future Internet. Publications List Copyright © 2025, Computer Science Department - Credits - Feedback",
  "content_length": 3384,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:22"
}