{
  "name": "Evangelos Pournaras",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/6446/dr-evangelos-pournaras",
  "status": "success",
  "content": "Professor Evangelos Pournaras | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Professor Evangelos Pournaras Position: Professor of Trustworthy Distributed Intelligence Areas of expertise: distributed intelligence; trustworthy AI; blockchain; collective decision making; digital democracy; computational social systems; Internet of Things; Smart Cities; Smart Grids Email: E.Pournaras@leeds.ac.uk Phone: +44(0)113 343 4810 Website: Github TDI Lab | LinkedIn | Googlescholar | ORCID Profile I am Professor of Trustworthy Distributed Intelligence in the School of Computer Science at University of Leeds. I am also a UKRI Future Leaders Fellow (£1.4M), a Research Associate at the UCL Center of Blockchain Technologies and has also been an Alan Turing Fellow. I have more than 5 years of research experience at ETH Zurich after having completed my PhD studies at Delft University of Technology. I have also been a visiting researcher at EPFL and has industry experience at IBM T.J. Watson Research Center. I have won the Augmented Democracy Prize, the 1st prize at ETH Policy Challenge as well as 5 paper awards and honors, including the listing of two of my project within UNESCO IRCAI Global Top-100 as `outstanding' and `promising'. I have published more than 100 peer-reviewed papers in high impact journals and conferences. I have extensive leadership experience and raised funding for national and EU projects such as H2OforAll, ASSET and SoBigData. Responsibilities School Representative at the Faculty Research Ethics Committee (FREC) Research interests I study socio-technical systems that exhibit distributed intelligence of human and artificial nature and how to build such systems to be trustworthy by design. My research focuses on the foundations (algorithms, models and architectures) and real-world applications in the domains of digital democracy, sustainability, Smart Cities, energy, smart mobility, edge computing, Internet of Things, logistics, supply chain and sharing economies. Awards and Honours Winner of the Mentorship Award, Faculty of Engineering and Physical Sciences, University of Leeds, Partnership Award 2024 Best paper award for the paper: Discrete-choice Multi-agent Optimization: Decentralized Hard Constraint Satisfaction for Smart Cities UNESCO IRCAI 2022 Global Top-100: “Outstanding” for the project: Collective Learning: Human-machine Collective Intelligence at Smart City Scale UNESCO IRCAI 2021 Global Top-100: “Promising” for the project: ASSET: A Value-sensitive AI Approach to Empower Sustainable Consumption GFEI best paper award for the paper: How Value-sensitive Design can Empower Sustainable Consumption Augmented Democracy Prize for the paper: Proof of Witness Presence: Blockchain Consensus for Augmented Democracy in Smart Cities Best demo paper award for paper: Democratizing Data Analytics: Crowd-sourcing Decentralized Collective Measurements Prize for Innovation Upper Austria, ASSET project, category Research & Development 1st prize at ETH Policy Challenge, Empower Polis project Best paper award for the article: Adaptive Self-organization in Distributed Tree Topologies Selected Research Projects & Funding 2022-2026, Digitall-assisted Collective Goverance of Smart City Commons (ARTIO), UKRI Future Leaders Fellowship, PI, £1.4M 2025-2026, Embedding EDI in the Distribution of Research Funding: An AI-assisted Collective Intelligence Approach, AI For Collective Intelligence Rapid Response Fund, PI, £68K 2025-2026, Collective Learning Optimisation Algorithm, UKRI IAA, PI, £119K 2024-2025, Climate Resilient WASH Monitoring, World Health Organisation, Co-I, £158K 2024-2029, Resilient and Flexible Railway Multi-Energy Hub Networks for Integrated Green Mobility, EPSRC, Co-I, £1.18M 2022-2025, Innovative Integrated Tools & Technologies to Protect & Treat Drinking Water from Disinfection Byproducts (DBPs) - H2OforAll, Horizon Europe, PI, €300K 2020-2024, Trust and Legitimation in the Digital Democracy, NRP 77: Digital Transformation, Swiss National Science Foundation, PI, ₣192K 2022-2023, New Edge-Cloud Infrastructure for Distributed Intelligent Computing, Alan Turing Institute, Co-PI, £50K 2021-2022, Socially Responsible AI for Distributed Autonomous Systems, White Rose, PI, £11K 2019-2020, Experience Quality of Life in Winterhur, Citizen Science Center Seed Grant, University of Zurich, Co-I, ₣50K 2019, Self-organizing Systems for Wireless Communications, Competence Centers of Excelent Technologies (COMET), Co-I, €50K 2016-2020, ASSET-Instant Gratification for Collective Awareness & Sustainable Consumerism, Horizon 2020, Co-I, €438K 2015-2019, SoBigData-Social Mining & Big Data Ecosystem, Horizon 2020, Co-I, €918K Research Highlights Another Intelligence: Distributed socio-technical systems to trust for a sustainable and democratic society. This is my inaugural lecture as a Professor of Trustworthy Distributed Intelligence on the 1st of October 2025. You can watch the lecture here and also access my slides below: Data Collectives: This research studies how coordination of data sharing among citizens can recover significant privacy, while reducing costs and risks for service providers. Data collectives is all about a more responsible and purposeful data collection that can help us improve our environment, health, society and democracy. Collective learning: This is a long-standing active research area on the management of large-scale socio-technical systems in Smart Cities using human-centered distributed artificial intelligence. It involves foundamental research on discrete-choice combinatorial optimization problems in decentralized multi-agent systems with a large portfolio of applications that involves among other: energy, transport, edge computing, data sharing, bike sharing, voting. Broader Outreach & Media Coverage Contributor to the report of the UK parliament: Energy Security and AI Pitching collective learning at the 8th United Nations Multi-stakeholder Forum on Science, Technology and Innovation for the Sustainable Development Goals Live TV Interview at the national broadcast media ERT 3: Smart app for environmentally sustainable shopping Live TV Interview at the national broadcast media of ERT 1: A Greek innovates with an app for healthy and sustainable consumption in supermarkers Interview articles at the Greek national news agency (ANAMPA) on augmented democracy and digital democracy <h4>Research projects</h4> <p>Some research projects I'm currently working on, or have worked on, will be listed below. Our list of all <a href=\"https://eps.leeds.ac.uk/dir/research-projects\">research projects</a> allows you to view and search the full list of projects in the faculty.</p> Digitally-assisted Collective Governance of Smart City Commons-ARTIO Qualifications PhD, Delft University of Technology, The Netherlands, 2013 MSc with Distinction in Internet Computing, University of Surrey, UK, 2007 BSc in Technology Education and Digital Systems, University of Piraeus, Greece, 2006 Student education I have a track record of designing and delivering popular courses at University of Leeds and ETH Zurich, informed by cutting-edge research. My teaching involves innovative learning and student engagement approaches based on hackathon-style learning activities and assessments. My approach on cross-disciplinary data science education is published. I have designed the Blockchain Technologies module, which I teach since 2023. I also have experience with creating Massive Open Online Courses (MOOC) such as the “How to Get Into Blockchain” by Coursera. Research groups and institutes Distributed Systems and Services Artificial Intelligence Current postgraduate researchers Alaa Altammami Chuhao Qin Sajan Maharjan Amal Aldawsari Zhuolun Li Sal Butt Linshun Liu Ammar Hamdi Longkun Li <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Projects <li><a href=\"//phd.leeds.ac.uk/project/744-distributed-artificial-intelligence-for-collective-decisions-in-smart-cities\">Distributed Artificial Intelligence for Collective Decisions in Smart Cities</a></li> <li><a href=\"//phd.leeds.ac.uk/project/1856-edge-to-cloud-smart-mobility:-ai-co-optimization-for-future-autonomous-vehicles\">Edge-to-Cloud Smart Mobility: AI Co-optimization for Future Autonomous Vehicles</a></li> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 9212,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:21"
}