{
  "name": "Evanthia Papadopoulou",
  "homepage": "http://search.usi.ch/people/8ad62e7fa5453718517c654c013c13cb/Papadopoulou-Evanthia",
  "status": "success",
  "content": "Papadopoulou, Evanthia | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Evanthia Papadopoulou http://usi.to/i3c Biography Evanthia Papadopoulou is professor of computer science at the Università della Svizzera italiana. She joined USI in 2008, initially as an associate professor, and as professor since 2016. Prior to that she had been a research staff member at the IBM T.J. Watson research center, Yorktown Heights, NY, USA, from 1996 to 2008. Following 2004, she had also been an assistant professor in the department of computer science at the Athens University of Economics and Business, Greece. She holds a BS degree in mathematics from University of Athens, an MS in computer science from University of Illinois at Chicago, and a Ph.D. in computer science from Northwestern University, Evanston, Illinois, December 1995. Her research interests include the design and analysis of discrete algorithms, computational geometry and its applications, robust geometric computing, the implementation of geometric algorithms, and algorithmic aspects of VLSI computer-aided design. For her work on \"Voronoi diagram based VLSI Critical Area Analysis\", she received the IBM outstanding innovation award, August 2006, and the Technical Accomplishment for IBM Research, December 2006. Competence areas Computational Geometry Design and analysis of algorithms Proximity and Nearest Neighbors Triangulations Voronoi diagrams Contact evanthia.papadopoulou@usi.ch tel +41 58 666 4122 East Campus, Sector D, Office D4.06 (Level P4) Via la Santa 1, 6962 Lugano-Viganello Roles Faculty of Informatics Full Professor Dalle Molle Institute for Artificial Intelligence (IDSIA USI-SUPSI) Links Website or personal page Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 2453,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:24"
}