{
  "name": "Evangelia Anna Markatou",
  "homepage": "https://markatou.github.io",
  "status": "success",
  "content": "Lilika Markatou HOME TEACHING FUN Evangelia Anna (Lilika) Markatou e-maile dot a dot markatou at tudelft dot nl BIO I am an assistant professor of cybersecurity at TU Delft. I received my PhD from Brown University, working with Roberto Tamassia. My interests lie in security and cryptography. I am working at the intersection of privacy and security, aiming to develop secure and private protocols that enable users to utilize cloud computing resources without sacrificing their data. Prior to starting my PhD, I was Master student at MIT with a concentration in Theoretical Computer Science. My thesis was on theoretical distributed algorithms, supervised by Nancy Lynch. More specifically, I worked on the SINR model, on various problems like leader election, broadcast, and node locating. I earned my B.S. in Electrical Engineering and Computer Science with a minor in Mathemantics from MIT. PUBLICATIONS Google Scholar Evangelia Anna Markatou, and Roberto Tamassia.\" Reconstructing with Even Less: Amplifying Leakage and Drawing Graphs.\" ACM Conference on Computer and Communications Security (CCS), 2024. Evangelia Anna Markatou, Francesca Falzon, Zachary Espiritu, and Roberto Tamassia.\" Attacks on Encrypted Response-Hiding Range Search Schemes in Multiple Dimensions.\" Proceedings on Privacy Enhancing Technologies, 2023. Francesca Falzon, Evangelia Anna Markatou, Zachary Espiritu, and Roberto Tamassia.\" Range search over encrypted multi-attribute data.\" Proceedings of the VLDB Volume 16, 2023. Espiritu, Zachary, Evangelia Anna Markatou, and Roberto Tamassia. \"Time-and Space-Efficient Aggregate Range Queries over Encrypted Databases.\" ACM Proceedings on Privacy Enhancing Technologies (PETS), 2022. Francesca Falzon, Evangelia Anna Markatou, William Schor, Roberto Tamassia. \"Reconstructing with Less: Leakage Abuse Attacks in Two-Dimensions\" ACM Conference on Computer and Communications Security (CCS), 2021. Francesca Falzon, Evangelia Anna Markatou, Akshima, David Cash, Adam Rivkin, Jesse Stern, Roberto Tamassia. \"Full Database Reconstruction in Two Dimensions\" ACM Conference on Computer and Communications Security (CCS), 2020. Evangelia Anna Markatou, Roberto Tamassia, \"Full Database Reconstruction with Access and Search Pattern Leakage \" Information Security Conference (ISC), 2019. (Best Student Paper Award) Evangelia Anna Markatou, Roberto Tamassia, \"Mitigation Techniques for Attacks on 1-Dimensional Databases that Support Range Queries \" Information Security Conference (ISC), 2019. Magnús M. Halldórsson, Stephan Holzer, and Evangelia Anna Markatou, \"Brief Announcement: Leader Election in SINR Model with Arbitrary Power Control \" Proceedings of the ACM Symposium on Principles of Distributed Computing (PODC). ACM, 2017. Magnús M. Halldórsson, Stephan Holzer, and Evangelia Anna Markatou, \" Leader Election in SINR Model with Arbitrary Power Control \" SIROCCO, 2017 (Best Paper Award) . Emilie Dunham, Molly Kosiarek, Evangelia Anna Markatou, Amanda Wang, \" Limits of Astrometric and Photometric Precision on KBOs \" Publications of the Astronomical Society of the Pacific 126.943 (2014): 863. HONORS AND AWARDS Best Student Paper Award in ISC 2019 for \"Full Database Reconstruction with Access and Search Pattern Leakage\". Best Paper Award in SIROCCO 2017 for \"Leader Election in SINR Model with Arbitrary Power Control\". The Licklider UROP Award for my work during my Masters. © Last update: Aug 12, 2022 Please activate JavaScript.",
  "content_length": 3468,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:18"
}