{
  "name": "Evangelos Triantaphyllou",
  "homepage": "https://www.lsu.edu/eng/cse/people/faculty/triantaphyllou.php",
  "status": "success",
  "content": "Evangelos Triantaphyllou | Computer Science & Engineering Skip to main content Evangelos Triantaphyllou Professor Contact trianta@lsu.edu Office 3272CPatrick F. Taylor Hall Educational Background Dual Ph.D. in Industrial Engineering and Operations Research, Pennsylvania State University, 1990 M.S in Computer Science, Pennsylvania State University, 1988 Dual M.S. in Operations Reearch and Environment, Pennsylvania State University, 1985 Visit Website CSC 4512: Optimization Approaches in Computer Science CSC 4890: Theory of Computation CSC 7442: Data Mining and Knowledge Discovery from Datasets Data Mining Discrete Optimization Multi-Criteria Decision Making Medical Decision Making Computer-aided Decision Making Medical Informatics Triantaphyllou, E., & Yanase, J. (2024). The use of pairwise comparisons for decision making may lead to grossly inaccurate results. Computers & Industrial Engineering, 198, 110653. Hou, F., Triantaphyllou, E., & Yanase, J. (2022). Knowledge, ignorance, and uncertainty: An investigation from the perspective of some differential equations. Expert Systems with Applications, 191, 116325. Triantaphyllou, E., & Yanase, J. (2021). The seven key challenges for life-critical shared decision making systems. International Journal of Medical Informatics, 148, 104377. Triantaphyllou, E., & Yanase, J. (2021). Treatment selection for life-critical shared decision making under ranges of health-state utility scenarios. Journal of Biomedical Informatics, 115, 103604. Triantaphyllou, E., Yanase, J., & Hou, F. (2020). Post-consensus analysis of group decision making processes by means of a graph theoretic and an association rules mining approach. Omega, 94, 102208. Triantaphyllou, E., & Yanase, J. (2020). How to identify and treat data inconsistencies when eliciting health-state utility values for patient-centered decision making. Artificial Intelligence in Medicine, 106, 101882. Triantaphyllou, E., Hou, F., & Yanase, J. (2020). Analysis of the final ranking decisions made by experts after a consensus has been reached in group decision making. Group Decision and Negotiation, 29(2), 271-291. Kujawski, E., Triantaphyllou, E., & Yanase, J. (2019). Response to:“Additive Multicriteria Decision Analysis Models Are Not Misleading Aids for Life-Critical Shared Decision Making”(by J. Dolan). Medical Decision Making. Sep, 6. Yanase, J., & Triantaphyllou, E. (2019). The seven key challenges for the future of computer-aided diagnosis in medicine. International journal of medical informatics, 129, 413-422. Yanase, J., & Triantaphyllou, E. (2019). A systematic survey of computer-aided diagnosis in medicine: Past and present developments. Expert Systems with Applications, 138, 112821. Top This website uses cookies to ensure site visitors get the best experience on our website. By continuing to use this site, you accept our use of cookies and Privacy Statement. To learn more, please visit LSU Privacy Statement. I agree. Search Search Search POPULAR SEARCHES: MajorsAcademic CalendarIs the Dining Hall Food Good? FootballThings to Do on CampusHow Much is Tuition? × Video Modal ©",
  "content_length": 3123,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:22"
}