{
  "name": "Evgenios M. Kornaropoulos",
  "homepage": "https://cs.gmu.edu/~evgenios",
  "status": "success",
  "content": "Evgenios Kornaropoulos – Assistant Professor - George Mason University Evgenios (pronounced ev-YEN-ee-os) Kornaropoulos is an Assistant Professor in the Department of Computer Science at George Mason University. His research is in computer security and privacy with a focus on (1) scalable encrypted systems and (2) the intersection of AI/ML and security. He is the recipient of the NSF CAREER award, the Meta Faculty Award in Security, the Joukowsky Outstanding Dissertation Award, and the Miretta Flytzani-Stephanopoulos Doctoral Thesis Achievement. His research has been funded by the NSF and the Commonwealth Cyber Initiative. Before joining George Mason, he was a Postdoctoral Scholar at the EECS Department of UC Berkeley. He received his Ph.D. in Computer Science at Brown University and also obtained M.Sc. and B.Sc. degrees in Computer Science from the University of Crete, where he was a member of ICS-FORTH. Openings: Our Encrypted Systems Group has openings for motivated Ph.D. students with focus on applied cryptography. Please contact me if you are interested in joining the group. Recent News Nov-25 I am a program committee member of the Machine Learning track of ACM CCS 2026. Send us your cool papers! Aug-25 Our recent project \"When AIOps Become “AI Oops”: Subverting LLM-driven IT Operations via Telemetry Manipulation\" is featured in The Register, Bruce Schneier's Blog on Security! Aug-25 I am a program committee member of the USENIX Security 2026. Send us your cool papers! Jul-25 Our \"Hacking Back the AI-Hacker: Prompt Injection as a Defense Against LLM-driven Cyberattacks\" paper is one of the finalists for the ''Most Epic Achievement'' category at Pwnie Awards 2025! Jul-25 I am a program committee member of the NDSS 2026. Send us your cool papers! Mar-25 I am a program committee member of the IEEE S&P 2026. Send us your cool papers! Feb-25 Will deliver an invited colloquim talk at the Computer Science department of Pomona College! Jan-25 Very excited and honored to receive the NSF CAREER award! Jan-25 Our paper \"LLMmap: Fingerprinting For Large Language Models\" has been accepted at USENIX Security'25! Dec-24 Elevated to IEEE Senior member! Dec-24 I am a program committee member of the Applied Cryptography Track at ACM CCS 2025. Send us your cool papers! Nov-24 Our recent project \"Hacking Back the AI-Hacker: Prompt Injection as a Defense Against LLM-driven Cyberattacks\" is featured in Dark Reading, Bruce Schneier's Blog on Security, AI Cyber Insights, as well as in The Stack! Sep-24 Selected to give a talk titled \"Asymmetric PSI and Its Leakage: A Case Study of the MIGP Protocol\" at the NIST Workshop on Privacy-Enhancing Cryptography (WPEC) 2024! Jul-24 Our Breach Extraction Attacks paper from S&P'24 is one of the finalists for the ''Best Cryptographic Attack'' category at Pwnie Awards 2024. Our work was featured by the College of Engineering and Computing at George Mason! May-24 Will give an invited talk to the Privacy and Cryptography group at Georgetown University hosted by Muthu Venkitasubramaniam about our Breach Extraction Attacks paper from S&P'24. Apr-24 Our paper \"AITIA: Efficient Secure Computation of Bivariate Causal Discovery\" has been accepted at CCS'24! We co-design the machine learning algorithms and the secure computation approach to propose the first efficient privacy-preserving causal discovery protocol! Mar-24 Will give an invited talk to the CASCADE team at École Normale Supérieure about our Breach Extraction Attacks paper from S&P'24. Nov-23 Our paper \"Algorithmic Complexity Attacks on Dynamic Learned Indexes\" has been accepted at VLDB'24! We perform a security assessment of the ALEX dymanic learned index and demonstrate a series of algorithmic complexity attacks. Oct-23 Our cryptanalysis paper \"Breach Extraction Attacks: Exposing and Addressing the Leakage in Second Generation Compromised Credential Checking Services\" has been accepted at IEEE S&P'24! We exploit and fix the cryptographic leakage in the MIGP protocol deployed by Cloudflare. Aug-23 Somiya Chhillar, a M.Sc. student in our CS department, is joining our group! Welcome Somiya! May-23 Will give an invited talk to the (invitation-only)Topical Workshop on Encryption for Secure Search and other Algorithms in Bertinoro, Italy! Apr-23 Tessa Joseph, a junior at the Thomas Jefferson High School for Science and Technology, will join our group for a summer research internship! Welcome Tessa! Mar-23 Serving in the program committee of IEEE Symposium on Security & Privacy (S&P) 2024! Submit your cool papers! Mar-23 Gave an invited talk at the \"Public Key Cryptography and Applications\" symposium of the SIAM Southeastern Atlantic Section Annual Meeting hosted at Virginia Tech! Dec-22 Received a grant from the Commonwealth Cyber Initative (CCI)! The project is titled \"Equitable Healthcare via Ethical and Provable De-identification\". Joint grant with co-PI Rebecca Sutter from the College of Public Health at George Mason. Nov-22 My group and I are attending ACM Symposium on Computer Science and Law 2022 in Washington D.C. Ping me if you are around! Sep-22 Serving in the program committee of Financial Cryptography (FC) 2023 as well as IEEE European Symposium on Security and Privacy (EuroS&P) 2023! Aug-22 Our paper on searchable encryption \"Leakage Inversion: Towards Quantifying Privacy in Searchable Encryption\" has been accepted at CCS 2022! This is the first paper of my PhD student Nathaniel Moyer! Aug-22 Received a Meta Research Award in Security to support the work of my group on Searchable Encryption! Jul-22 Received an NSF SaTC Medium grant as a lead PI! Looking forward to collaborating with Yale University and Brown University on Encrypted Databases. May-22 Received a grant from the Commonwealth Cyber Initative (CCI)! Joint grant with co-PI Giuseppe Ateniese and our industry partner Leidos Inc. May-22 Received the Miretta Flytzani-Stephanopoulos Doctoral Thesis Achievement Award! Apr-22 Gave an invited talk at the Cryptography Technology Group at NIST Dec-21 Our paper on attacks on learned systems \"The Price of Tailoring the Index to Your Data: Poisoning Attacks on Learned Index Structures\" has been accepted at SIGMOD 2022! Sep-21 Our paper on adversarial examples \"Adversarial Examples for k-Nearest Neighbor Classifiers Based on Higher-Order Voronoi Diagrams\" has been accepted at NeurIPS 2021! Aug-21 Gave an invited talk at the Private Computing group of Google NYC Jun-21 You can watch my talk from IEEE S&P'21 Apr-21 I am part of the ACM CCS 2021 program committee. Send us your papers! Jan-21 Gave a (remote) invited talk at Athens Cryptography Day - AtheCrypt 2021. Dec-20 Our paper \"Response-Hiding Encrypted Ranges: Revisiting Security via Parametrized Leakage-Abuse Attacks\" has been accepted at IEEE S&P 2021! Jul-20 Our multi-source secure contact tracing work is out: \"BeeTrace: A Unified Platform for Secure Contact Tracing that Breaks Data Silos\" Aug-20 You can watch my talk from IEEE S&P'20",
  "content_length": 6997,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:24"
}