{
  "name": "Evimaria Terzi",
  "homepage": "https://cs-people.bu.edu/evimaria",
  "status": "success",
  "content": "Home Publications Teaching Misc Evimaria Terzi Professor and Associate Chair for Academics Computer Science Department MCS 280 Boston University 111 Cummington Street Boston, MA, 02215 http://www.cs.bu.edu/~evimaria/ (evimaria@cs.bu.edu) Tel: 617-358-5851 About At BU I am a member of the Data Management Lab@BU. My research interests are in the area of algorithmic data mining with emphasis on (social) network analysis, recommendation systems and urban informatics. A long version of my CV is here (updated Nov. 2018). Research Highlights My Google Scholar page is here. My most recent research statement is here (updated Nov. 2018) A more thorough description of the projects I am working on can be found here. Awards and Funding My research is funded by the following sources: Microsoft Faculty Fellowship (2010) NSF award on Entity Selection and Ranking for Data Mining Applications (2012-2016) NSF CAREER award on On identifying collections with complex objectives (2013-2018) NSF award on Managing and Mining Uncertain Graphs (2013-2016) NSF award on Structural Matrix Completion for Data-Mining Applications, (2014-2017) Award: 1421759 NSF Award: “ SCOPE: A smart-city Cloud-based Open Platform and Ecosystem\", (2014-2017) Nokia Fellowship Nokia Visiting Professor Fellowship for visiting Aalto University, Helsinki, Finland; (7000 euros), 2016 NSF Award: “Team Engineering: Algorithms and Practical Applications” (2018-2021) Hariri Institute Faculty grant: “ Team Formation: Algorithms and Practical Applications”, (in collaboration with BU Spark), ($ 40K), 2018 Gifts from Yahoo! and Google. Students I am working with the following students: Harshal Chaudhari (PhD student) Sofia Nikolakaki (PhD student) Isidora Tourni (PhD student) Andy Huynh (PhD student) Alumni Charalampos Mavroforakis (PhD 2018, currently engineer at Facebook) Behzad Golshan (PhD 2016, currently a research scientist at RIT) Natali Ruchansky (PhD 2016, currently a postdoctoral fellow at USC) Dora Erdos (PhD 2014, currently lecturer and undergraduate program director at BU) Esther Galbrun (post-doc, now a Junior Researcher at INRIA Nancy) Theodoros Lappas (post-doc, now an Assistant Professor at Howe School of Technology Management at Stevens Institute of Technology) George Brova (MA/BA student, now a PhD student at UIUC) Ben Lawson (Undergraduate student, now a quantitative analyst at legendary entertainment) Recent papers A. Anagnostopoulos, C. Castillo, A. Fazzone, S. Leonardi, E. Terzi: ‘‘Algorithms for Hiring and Outsourcing in the Online Labor Market\". ACM SIGKDD 2018. H. A. Chaudhari, M. Mathioudakis, E. Terzi: ‘‘Markov Chain Monitoring\". Siam Data Mining Conference (SDM) 2018. H. A. Chaudhari, J. W. Byers, E. Terzi: ‘‘Putting Data in the Driver’s Seat: Optimizing Earnings for On-Demand Ride-Hailing\". WSDM 2018. more Teaching This semester (Spring 2019) I am teaching for the first time CS330 Introduction to Algorithms My office hours are: Tues: 2:30pm-4pm and Wed: 1:30pm-3pm. In Fall 2018, I was on maternity leave. In the past, I have taught a graduate course on algorithmic data mining (CS 565), and I have recently developed a practical class on data mining called ‘‘Tools for Data Science\" (CS 506). A sample of this class can be found here. In the past I have taught Data Combinatorial structures (CS 131) for four years and multiple seminars. Servince Program co-chair (research track) for ACM SIGKDD 2019. – Journal Track Co-chair for ECML/PKDD 2019. – Program Co-chair of “Social networks and graph analysis track”, in WWW 2015. Page generated 2020-04-27 08:05:14 EDT, by jemdoc.",
  "content_length": 3599,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:26"
}