{
  "name": "Ewa Szczurek",
  "homepage": "https://www.mimuw.edu.pl/~szczurek",
  "status": "success",
  "content": "Computational Medicine ComputationalMedicine research people teaching open positions publications News! 2025: This website is obsolete now. We are working on setting up a new Szczurek lab website. Stay tuned! 2024: Our lab will now set up at Helmholtz Munich, Germany! Part of the lab will continue working in Warsaw. 2023: Ewa Szczurek on sabbatical at Northwestern University in the USA. Responses to emails may be slower :) Research Interests Artificial intelligence, machine learning, deep learning. generative models, probabilistic models, statistical data analysis Computational biology, computational medicine, oncology, antimicrobial resistance, COVID-19, pulmonary diseases Current projects Antimicrobial resistance: variational autoencoders to the rescue! We work out specialized deep generative models to produce synthetic antimicrobial peptides that can kill antibiotic-resistant bacteria. Methods: deep learning, generative models Modeling tumor microenvironment What is the spatial organization of the tumor and its neighborhood? How do they interact? These interesting questions are solved in our lab by analyzing spatial transcriptomics, digitalized tumor imaging, or imaging mass spectrometry data. This work is in collaboration with colleagues from the Oncology Bioinformatics department at Merck, Germany, and with an international consortium called IMMUcan. Methods: probabilistic graphical models, deep learning, machine learning models Drawing the genealogical trees of tumors. Which cancer mutations come first? How do metastases occur? How does drug resistance appear in cancer? Is tumor evloution neutral, or is it driven by selection? These and many more questions about the family history of tumor cells we find very exciting! Find out more on our CONTRA (Computational ONcology TRaining Alliance) website. Methods: probabilistic graphical models, mathematical models Fighting cancer with its own weapons. We are analyzing the phenomenon of synthetic lethality between cancer genes. We can use synthetic lethality for cancer treatment. Once one gene is mutated, we can target its synthetic lethal target in order to kill cancer cells. Learn more on our project website. Methods: statistical tests, survival analysis methods Deep Pathologist! Can deep learning algorithms scale the work of pathologists? We train a deep pathologist on colorectal and lung cancer histological images to recognize multiple tissue types. Methods: deep learning models Modeling efficacy of drugs and drug combinations. Together with colleagues from the Oncology Bioinformatics department at Merck, Germany, we try to understand and predict how drugs work on cancer cell lines. Methods: deep learning, machine learning, statistical models, optimization algorithms Modeling epidemic spread. We were involved in two projects modeling COVID-19 dynamics in Poland: SEIR-based COVID-19 model and microsimulation-based MOCOS (MOdeling COronavirus spread) model. Organized seminars Computational biology and bioinformatics - BOB research seminar Bioinformatics and biomedical data analysis seminar for master students (in Polish) Computational medicine seminar (working seminar of our lab) Past organized conferences Computational Oncology Conference , Apr 11-13, 2022, in Andermatt, Switzerland. Cancer biology and treatment, Sep 2-6, 2019, in Cambridge, UK. Models of evolution, Jun 3-7, 2019, in Barcelona, Spain. Agile Bioinformatics for Agile Science , Feb 3-8, 2019, Cracow, Poland. Handling single cell data workshop, Sep 9-15, 2018, in Warsaw, Poland. CONTRA kick-off meeting and workshop, Jul 15-20, 2018, Bertinoro, Italy. Ewa Szczurek, PhD Associate professorInstitute of Informatics, University of Warsaw Banacha 2, 02-097 Warsaw, Poland room 5580, tel. +48 22 5544 5580, szczurek[at]mimuw.edu.pl Short CV Research experience Visiting associate professor (2023) Northwestern University, Chicago, USA Associate professor (2022-now) University of Warsaw, Poland Habilitation (2020) University of Warsaw, Poland Asisstant professor (2015-2022) University of Warsaw, Poland Fellow (second half 2016) Center for Interdisciplinary Research, Bielefeld, Germany. Postdoc (2012-2014) ETH Zurich, D-BSSE, Switzerland, ETH Fellowship, with Niko Beerenwinkel. Postdoc (2010-2012) Max Planck Institute for Molecular Genetics, Germany, with Martin Vingron. Education PhD (2006-2010) Max Planck Institute for Molecular Genetics,IMPRS programm, with Martin Vingron and Jerzy Tiuryn. Master's (2006) University of Warsaw Master's (2005) Uppsala University Awarded funding EU Innovative Medicine Initiative 2 joint undertaking program (grant 821558); Horizon 2020 and EFPIA, 2019-2024 (joined 2022) Sonata Bis, Polish National Science Centre, 2021-2026 OPUS, Polish National Science Centre, 2020-2023 Horizon 2020 - Marie Sklodowska-Curie Actions Innovative Training network (H2020 MSCA-ITN-2017-766030), 2018-2021 Merck Healthcare, 2017-2024 (2 consecutive grants) POLONEZ Fellowship Programme, MSCA COFUND, Horizon 2020, co-financed by the EU and the Polish National Science Centre, 2017,2018 ETH Zurich Postdoctoral Fellowship Program and the Marie Curie Actions for People COFUND program (grant FEL-13 12–1) 2013,2014 International Max Planck Research Schools (IMPRS) fellowship, 2006-2009 Editorial board Genome Biology Service as program committee ISMB 2024 ISMB/ECCB 2023 RECOMB-CCB 2023 WABI 2021 ISMB/ECCB 2021 RECOMB 2021 RECOMB-CCB 2020 (Program co-chair) RECOMB 2020 RECOMB 2019 RECOMB-CCB 2019 RECOMB 2018 RECOMB-CCB 2018 ACM BCB, 2017 Copyright 2006 Truly Simple. Design by Igor Penjivrag | Download free website templates >",
  "content_length": 5631,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:25"
}