{
  "name": "Ewan Davies",
  "homepage": "https://www.ewandavies.org",
  "status": "success",
  "content": "Ewan Davies Upcoming events 9 Oct 2025 Probability Seminar, University of Colorado Boulder | Boulder, CO Title: A first-order phase transition in the hard-core model 27 Oct 2025 Physics Colloquium, Colorado State University | Fort Collins, CO Title: Phase transitions in statistical physics models Preprints Spectral partitioning of graphs into compact, connected regionsE. Davies, R. Job, M. Kampbell, H. Kim, H. Seo bibabstractarXiv:2506.13982 @article{DJKKS25, title = {Spectral partitioning of graphs into compact, connected regions}, author = {Davies, Ewan and Job, Ryan and Kampbell, Maxine and Kim, Hannah and Seo, Hyojin}, year = {2025}, eprinttype = {arxiv}, eprint = {2506.13982} } This bib entry works best with biblatex/biber, or a modified version of the standard bibtex style \"abbrv\" that includes DOI and arXiv links available here. We define and study a spectral recombination algorithm, SpecReCom, for partitioning a graph into a given number of connected parts. It is straightforward to introduce additional constraints such as the requirement that the weight (or number of vertices) in each part is approximately balanced, and we exemplify this by stating a variant, BalSpecReCom, of the SpecReCom algorithm. We provide empirical evidence that the algorithm achieves more compact partitions than alternatives such as RevReCom by studying a 56×5656\\times 5656×56 grid graph and a planar graph obtained from the state of Colorado. On expectations and variances in the hard-core model on bounded degree graphsE. Davies, J.S. Sandhu, B. Tan bibabstractarXiv:2505.13396 @article{DST25, title = {On expectations and variances in the hard-core model on bounded degree graphs}, author = {Davies, Ewan and Sandhu, Juspreet Singh and Tan, Brian}, year = {2025}, eprinttype = {arxiv}, eprint = {2505.13396} } This bib entry works best with biblatex/biber, or a modified version of the standard bibtex style \"abbrv\" that includes DOI and arXiv links available here. We extend the study of the occupancy fraction of the hard-core model in two novel directions. One direction gives a tight lower bound in terms of individual vertex degrees, extending work of Sah, Sawhney, Stoner and Zhao which bounds the partition function. The other bounds the variance of the size of an independent set drawn from the model, which is strictly stronger than bounding the occupancy fraction. In the setting of triangle-free graphs, we make progress on a recent conjecture of Buys, van den Heuvel and Kang on extensions of Shearer’s classic bounds on the independence number to the occupancy fraction of the hard-core model. Sufficiently strong lower bounds on both the expectation and the variance in triangle-free graphs have the potential to improve the known bounds on the off-diagonal Ramsey number R(3,k)R(3,k)R(3,k), and to shed light on the algorithmic barrier one observes for independent sets in sparse random graphs. Local Weak Degeneracy of Planar GraphsE. Davies, E. Smith-Roberge bibabstractarXiv:2504.21821 @article{DS25, title = {{Local Weak Degeneracy of Planar Graphs}}, author = {Davies, Ewan and {Smith-Roberge}, Evelyne}, year = {2025}, eprinttype = {arxiv}, eprint = {2504.21821} } This bib entry works best with biblatex/biber, or a modified version of the standard bibtex style \"abbrv\" that includes DOI and arXiv links available here. Thomassen showed that planar graphs are 5-list-colourable, and that planar graphs of girth at least five are 3-list-colourable. An easy degeneracy argument shows that planar graphs of girth at least four are 4-list-colourable. In 2022, Postle and Smith-Roberge proved a common strengthening of these three results: with g(v)g(v)g(v) denoting the length of a shortest cycle containing a vertex vvv, they showed that if GGG is a planar graph and LLL a list assignment for GGG where ∣L(v)∣≥max⁡{3,8−g(v)}|L(v)| ≥\\max\\{3,8-g(v)\\}∣L(v)∣≥max{3,8−g(v)} for all v∈V(G)v ∈V(G)v∈V(G), then GGG is LLL-colourable. Moreover, they conjectured that an analogous theorem should hold for correspondence colouring. We prove this conjecture; in fact, our main theorem holds in the still more restrictive setting of weak degeneracy, and moreover acts as a joint strengthening of the fact that planar graphs are weakly 4-degenerate (originally due to Bernshteyn, Lee, and Smith-Roberge), and that planar graphs of girth at least five are weakly 2-degenerate (originally due to Han et al.). The hard-core model in graph theoryE. Davies, R.J. Kang bibabstractarXiv:2501.03379 @article{DK25, title = {The hard-core model in graph theory}, author = {Davies, Ewan and Kang, Ross J.}, year = {2025}, eprinttype = {arxiv}, eprint = {2501.03379} } This bib entry works best with biblatex/biber, or a modified version of the standard bibtex style \"abbrv\" that includes DOI and arXiv links available here. An independent set may not contain both a vertex and one of its neighbours. This basic fact makes the uniform distribution over independent sets rather special. We consider the hard-core model, an essential generalization of the uniform distribution over independent sets. We show how its local analysis yields remarkable insights into the global structure of independent sets in the host graph, in connection with, for instance, Ramsey numbers, graph colourings, and sphere packings. On the occupancy fraction of the antiferromagnetic Ising modelE. Davies, O. LeBlanc bibabstractarXiv:2412.18070 @article{DL24, title = {On the occupancy fraction of the antiferromagnetic Ising model}, author = {Davies, Ewan and Le{B}lanc, Olivia}, year = {2024}, eprinttype = {arxiv}, eprint = {2412.18070} } This bib entry works best with biblatex/biber, or a modified version of the standard bibtex style \"abbrv\" that includes DOI and arXiv links available here. We study the maximum and minimum occupancy fraction of the antiferromagnetic Ising model in regular graphs. The minimizing problem is known to determine a computational threshold in the complexity of approximately sampling from the Ising model at a given magnetization, and our results determine this threshold for nearly the entire relevant parameter range in the case Δ=3∆=3Δ=3. A small part of the parameter range lies outside the reach of our methods, and it seems challenging to extend our techniques to larger Δ∆Δ. Graph structure via local occupancyE. Davies, R.J. Kang, F. Pirot, J.-S. Sereni bibabstractarXiv:2003.14361 @article{DKPS20, title = {Graph structure via local occupancy}, author = {Davies, Ewan and Kang, Ross J. and Pirot, Fran\\c{c}ois and Sereni, Jean-S\\'ebastien}, year = {2020}, eprinttype = {arxiv}, eprint = {2003.14361} } This bib entry works best with biblatex/biber, or a modified version of the standard bibtex style \"abbrv\" that includes DOI and arXiv links available here. The first author together with Jenssen, Perkins and Roberts (2017) recently showed how local properties of the hard-core model on triangle-free graphs guarantee the existence of large independent sets, of size matching the best-known asymptotics due to Shearer (1983). The present work strengthens this in two ways: first, by guaranteeing stronger graph structure in terms of colourings through applications of the Lovász local lemma; and second, by extending beyond triangle-free graphs in terms of local sparsity, treating for example graphs of bounded local edge density, of bounded local Hall ratio, and of bounded clique number. This generalises and improves upon much other earlier work, including that of Shearer (1995), Alon (1996) and Alon, Krivelevich and Sudakov (1999), and more recent results of Molloy (2019), Bernshteyn (2019) and Achlioptas, Iliopoulos and Sinclair (2019). Our results derive from a common framework built around the hard-core model. It pivots on a property we call local occupancy, giving a clean separation between the methods for deriving graph structure with probabilistic information and verifying the requisite probabilistic information itself. Regularity inheritance in hypergraphsP. Allen, E. Davies, J. Skokan bibabstractarXiv:1901.05955 @article{ADS19, title = {Regularity inheritance in hypergraphs}, author = {Allen, Peter and Davies, Ewan and Skokan, Jozef}, year = {2019}, eprinttype = {arxiv}, eprint = {1901.05955} } This bib entry works best with biblatex/biber, or a modified version of the standard bibtex style \"abbrv\" that includes DOI and arXiv links available here. We give a new approach to handling hypergraph regularity. This approach allows for vertex-by-vertex embedding into regular partitions of hypergraphs, and generalises to regular partitions of sparse hypergraphs. We also prove a corresponding sparse hypergraph regularity lemma. Publications Safety Analysis in the NGAC ModelB. Tan, E.S.D. Davies, I. Ray, M.A. AbdelgawadProceedings of the 30th ACM Symposium on Access Control Models and Technologies (2025), 91–98 bibabstractarXiv:2505.06406doi:10.1145/3734436.3734444 @inproceedings{TDRA25, title = {Safety Analysis in the {NGAC} Model}, author = {Tan, Brian and Davies, Ewan S. D. and Ray, Indrakshi and Abdelgawad, Mahmoud A.}, year = {2025}, eprinttype = {arxiv}, eprint = {2505.06406}, isbn = {9798400715037}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, doi = {10.1145/3734436.3734444}, booktitle = {Proceedings of the 30th ACM Symposium on Access Control Models and Technologies}, pages = {91–98}, numpages = {8}, series = {SACMAT '25} } This bib entry works best with biblatex/biber, or a modified version of the standard bibtex style \"abbrv\" that includes DOI and arXiv links available here. We study the safety problem for the next-generation access control (NGAC) model. We show that under mild assumptions it is coNP-complete, and under further realistic assumptions we give an algorithm for the safety problem that significantly outperforms naive brute force search. We also show that real-world examples of mutually exclusive attributes lead to nearly worst-case behavior of our algorithm. Samplin",
  "content_length": 67939,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:26"
}