{
  "name": "Eytan Adar",
  "homepage": "http://www.cond.org",
  "status": "success",
  "content": "Eytan Adar I am a Professor of Information and Computer Science at the University of Michigan. My work is at the boundary of HCI and AI. Specific research projects range from modeling behaviors at a very large-scale (search, social networks evolution, learning, meme and rumor spread, programming, text production and consumption, etc.), integration of AI technologies into user-facing interfaces, and work on visualization. Many of these projects are at Internet scales and give me an excuse to work on lots of different things I like... language, creativity, data/text mining, visualizations, social network analysis, etc. Before grad school I was a researcher at HP Labs' Information Dynamics Group and at Xerox PARC. (recent-ish CV here). Among other things, I am associated with the MISC (HCI-focused) and MIDAS groups. I am one of the founders of ICWSM (which I've chaired multiple times) and have also been Co-General Chair for WSDM and Co-Program Chair for UIST. Work in my group is sponsored by the NSF, IARPA, NIH, the Education Department, Adobe, Microsoft, Facebook, Google, and Yahoo. I work with some awesome students. Some that recently graduated: Elsie Lee-Robbins (PhD, now at the US Postal Commission), John Chung (PhD, now at Midjourney), Aria Collopy (PhD, now at RAND), Matt Burgess (PhD, now at Stitch Fix), Srayan Datta (PhD, now at Google), Licia He (PhD, an independent artist), Jessica Hullman (PhD, Associate Professor at Northwestern), Gierad Laput (MSI, PhD at CMU, now at Apple), and Xin Rong (PhD), Hari Subramonyam (PhD, now AI Fellow at Stanford). I have a blog (which I post to pretty infrequently) and a bluesky account. I tend to load project videos to YouTube I can be reached at eadar-at-umich-dot-edu. Selected Publications Google Scholar and Semantic Scholar profiles, and my latest on arXiv » \"Feminist Interaction Techniques: Deterring Non-Consensual Screenshots with Interaction Techniques\" Li Qiwei, Francesca Lameiro, Shefali Patel, Cristi Isaula-Reyes, Eytan Adar, Eric Gilbert, Sarita Schoenebeck, to appear UIST'24 » \"One vs. Many: Comprehending Accurate Information from Multiple Erroneous and Inconsistent AI Generations\" Yoonjoo Lee, Kihoon Son, Tae Soo Kim, Jisu Kim, John Joon Young Chung, Eytan Adar, Juho Kim, FAccT'24 » \"Causal Pattern Diagrams in Science Texts Support Explanation\" Hari Subramonyam, Eytan Adar, Priti Shah, Colleen M Seifert, ICLS'24 » \"Authors' Values and Attitudes Towards AI-bridged Scalable Personalization of Creative Language Arts\" Taewook Kim, Hyomin Han, Eytan Adar, Matthew Kay, John Joon Young Chung, CHI'24, Honorable Mention Award » \"PromptPaint: Steering Text-to-Image Generation Through Paint Medium-like Interactions\" John Joon Young Chung, Eytan Adar, UIST'23 » \"Artinter: AI-powered Boundary Objects for Commissioning Visual Arts\" John Joon Young Chung, Eytan Adar, DIS'23 » \"Roboviz: A Game-Centered Project for Information Visualization Education\" Eytan Adar, Elsie Lee-Robbins, VIS'22 » \"Affective Learning Objectives for Communicative Visualizations\" Elsie Lee-Robbins, Eytan Adar, VIS'22 » \"Sensible AI: Re-imagining Interpretability and Explainability using Sensemaking Theory\" Harmanpreet Kaur, Eytan Adar, Eric Gilbert, Cliff Lampe, FAccT'22 » \"Artist Support Networks: Implications for Future Creativity Support Tools\" John Joon Young Chung, Shiqing He, Eytan Adar, DIS'22 » \"Composites: A Tangible Interaction Paradigm for Visual Data Analysis in Design Practice\" Hariharan Subramonyam, Eytan Adar, and Steven M. Drucker, Sungsoo Ray Hong, AVI'22 » \"TaleBrush: Sketching Stories with Generative Pretrained Language Models\" John Joon Young Chung, Wooseok Kim, Kang Min Yoo, Hwaran Lee, Eytan Adar, Minsuk Chang, CHI'22 » \"Solving Separation-of-Concerns Problems in Collaborative Design of Human-AI Systems through Leaky Abstractions\" Subramonyam Hariharan, Jane Im, Colleen Seifert, Eytan Adar, CHI'22 » \"FlatMagic: Improving Flat Colorization through AI-driven Design for Digital Comic Professionals\" Chuan Yan, John Joon Young Chung, Kiheon Yoon, Yotam Gingold, Eytan Adar, Sungsoo Ray Hong, CHI'22 » \"VideoSticker: A Tool for Active Viewing and Visual Note-taking from Videos\" Yining Cao, Hariharan Subramonyam, Eytan Adar, IUI'22 » \"Gestural Inputs as Control Interaction for Generative Human-AI Co-Creation\" John Joon Young Chung, Minsuk Chang, and Eytan Adar, IUI'22 Workshop on Human-AI Co-Creation with Generative Models (HAI-GEN) » \"How Can Human-Centered Design Shape Data-Centric AI?\" Hariharan Subramonyam, Colleen Seifert, Eytan Adar, NeurIPS Workshop Human Centered AI, 2021 » \"Visualizing Uncertainty in Probabilistic Graphs with Network Hypothetical Outcome Plots (NetHOPs)\" Dongping Zhang, Eytan Adar, and Jessica Hullman, VIS'21 » \"Learning Objectives, Insights, and Assessments: How Specification Formats Impact Design\" Elsie Lee-Robbins, Shiqing He, and Eytan Adar, VIS'21 » \"Investigating engineering students' consideration of people during concept generation\" Laura R. Murphy, Shanna R. Daly, Nina Makhlouf, Eytan Adar, Sophia Brueckner, Colleen M. Seifert, ASEE'21 » \"The Intersection of Users, Roles, Interactions, and Technologies in Creativity Support Tools\" John Joon Young Chung, Shiqing He, Eytan Adar, DIS'21 » \"Towards A Process Model for Co-Creating AI Experiences\" Hariharan Subramonyam, Colleen Seifert, Eytan Adar, DIS'21 » \"ProtoAI: Model-Informed Prototyping for AI-Powered Interfaces\" Hariharan Subramonyam, Colleen Seifert, Eytan Adar, IUI'21 Best Paper Award » \"Communicative Visualizations as a Learning Problem\" Eytan Adar and Elsie Lee, IEEE Vis'20 » \"Plotting with Thread: Fabricating Delicate Punch Needle Embroidery with X-Y Plotters\" Shiqing He, Eytan Adar, DIS'20, Honorable Mention Award » \"Considering people: An exploratory investigation of engineering student ideation\" Laura R. Murphy, Shanna R. Daly, Colleen M. Seifert, Eytan Adar, Sophia Brueckner, ASEE'20 » \"texSketch: Active Diagramming through Pen-and-Ink Annotations\" Hariharan Subramonyam, Colleen Seifert, Priti Shah, Eytan Adar, CHI'20, Best Paper Award Winner » \"Extracting Inter-community Conflicts in Reddit\" Srayan Datta and Eytan Adar, ICWSM'19 » \"Vocal Shortcuts for Creative Experts\" Yea-Seul Kim, Mira Dontcheva, Eytan Adar, and Jessica Hullman, CHI'19 » \"Affinity Lens: Data-Assisted Affinity Diagramming with Augmented Reality\" Hariharan Subramonyam, Steven M. Drucker, and Eytan Adar, CHI'19, Best Paper Award Winner » \"Discovering Natural Language Commands in Multimodal Interfaces\" Arjun Srinivasan, Mira Dontcheva, Eytan Adar, and Seth Walker, IUI'19 » \"LAMVI-2: A Visual Tool for Comparing and Tuning Word Embedding Models\" Xin Rong, Joshua Luckson, Eytan Adar, tech report, arXiv:1810.11367 » \"SmartCues: A Multitouch Query Approach for Details-on-Demand through Dynamically Computed Overlays\" Hariharan Subramonyam and Eytan Adar, IEEE Vis'18 » \"TakeToons: Script-driven Performance Animation \" Hariharan Subramonyam, Wilmot Li, Eytan Adar, and Mira Dontcheva, UIST'18 » \"The_Tower_of_Babel.jpg: Diversity of Visual Encyclopedic Knowledge Across Wikipedia Language Editions\" Shiqing He, Allen Yilun Lin, Eytan Adar, and Brent Hecht, ICWSM'18, Best Paper Award » \"VizByWiki: Mining Data Visualizations from the Web to Enrich News Articles\" Allen Yilun Lin, Joshua Ford, Eytan Adar, and Brent Hecht, WWW'18 » \"CommunityDiff: Visualizing Community Clustering Algorithms\" Srayan Datta and Eytan Adar, ACM Transactions on Knowledge Discovery from Data, January 2018 » \"Identifying Misaligned Inter-Group Links and Communities\" Srayan Datta, Chanda Phelan and Eytan Adar, to appear, CSCW'18 » \"A generative model for scientific concept hierarchies\" Srayan Datta and Eytan Adar, PLoS One, 13(2): e0193331, February 23, 2018. » \"Learning Word Relatedness over Time\" Guy D. Rosin, Kira Radinsky and Eytan Adar, EMNLP'17 » \"Estimating the Impact of Systems Engineers on Systems Design Processes\" Arianne X. Collopy, Melissa T. Greene, Eytan Adar, Panos Y. Papalambros, ICED'17 » \"Leveraging Semantic Facets for Adaptive Ranking of Social Comments\" Elaheh Momeni, Reza Rawassizadeh, Eytan Adar, ICMR'17 » \"PersaLog: Personalization of News Article Content\" Eytan Adar, Carolyn Gearig, Ayshwarya Balasubramanian, Jessica Hullman, CHI'17 (Video/Demo) » \"Data dialog: facilitating collaborative decision making through data-driven conversations\" Hariharan Subramonyam, Bongshin Lee, Sile O'Modhrain, and Eytan Adar, PervasiveHealth '17 » \"SimpleScience: Lexical Simplification of Scientific Terminology\" Yea-Seul Kim, Jessica Hullman, Matthew Burgess, and Eytan Adar, EMNLP'16 » \"CodeMend: Assisting Interactive Programming with Bimodal Embedding\" Xin Rong, Shiyan Yan, Stephen Oney, Mira Dontcheva, and Eytan Adar, UIST'16 (Video/Demo) » \"VizItCards: A Card-Based Toolkit for Infovis Design Education\" Shiqing He and Eytan Adar, IEEE Vis'16 » \"Prototype Synthesis for Model Laws\" Matthew Burgess, Eugenia Giraudy and Eytan Adar, ACL 2016 » \"Visual Tools for Debugging Neural Language Models\" Xin Rong and Eytan Adar, ICML 2016 Workshop on Visualization for Deep Learning (Best Paper Award) » \"Engineering Information Disclosure: Norm Shaping Designs\" Daphne Chang, Erin L. Krupka, Eytan Adar, Alessandro Acquisti, CHI'16 » \"Link-Prediction Enhanced Consensus Clustering for Complex Networks\" Matthew Burgess, Eytan Adar, and Michael Cafarella, PLoS ONE 11(5): e0153384, May 20, 2016. (also: arXiv:1506.01461) » \"Information Evolution in Social Networks\" Lada A. Adamic, Thomas M. Lento, Eytan Adar, Pauline C. Ng, WSDM'16 (nominated for a best paper award) » \"EgoSet: Exploiting Word Ego-networks and User-generated Ontology for Multifaceted Set Expansion\" Xin Rong, Zhe Chen, Qiaozhu Mei, Eytan Adar, WSDM'16 » \"Hypothetical Outcome Plots Outperform Error Bars and Violin Plots for Inferences about Reliability of Variable Ordering\" Jessica Hullman, Paul Resnick and Eytan Adar, PLoS ONE, 10(11) » \"The Two Cultures and Big Data Research\" Eytan Adar, I/S: A Journal of Law and Pol",
  "content_length": 17257,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:29"
}