{
  "name": "Ezio Bartocci",
  "homepage": "http://www.eziobartocci.com",
  "status": "success",
  "content": "Ezio Bartocci - Technische Universität Wien (TU Wien) Ezio Bartocci Ezio Bartocci Home TrustCPS Group Research Publications Projects Tools Univ.-Prof. Dott. Ric. Ezio Bartocci CPS Research Unit Institute of Computer Engineering Faculty of Informatics Technische Universität Wien Email: name.surname@tuwien.ac.at Tel: (+43)(1) 58801 - 18226 Fax: (+43) (1) 58801 - 18299 Office: Treitlstrasse 3,1040 Vienna, Austria Head of the TrustCPS group (Picture 2025, Credits: M. Farsag) Follow me on LinkedIn I am a Full Professor at TU Wien, where I lead the Trustworthy Cyber-Physical Systems (TrustCPS) Research Group within the Cyber-Physical Systems (CPS) Research Unit. My research focuses on developing formal methods and computational tools that ensure the safety, security, energy-efficiency and correctness of AI-based CPS with a strong emphasis on sustainability. I earned my B.S. in Computer Science, M.S. in Bioinformatics, and Ph.D. in Information Science and Complex Systems from the University of Camerino, Italy. From 2010-2012, I conducted postdoctoral research at Stony Brook University (NY, US), contributing to the American NSF-funded CMACS project (coordinated by the Turing-Award Winner Prof. Edmund Clarke) on computational cardiac dynamics. Since joining TU Wien in 2012 as University Assistant, I became tenure-track Assistant Professor in 2015, Associate Professor in 2019, and I was appointed Full Professor in 2020. I am currently Vice-Chair of the Marie Skłodowska-Curie COFUND doctoral programme LogiCS@TUWien and Coordinator of the TrustCPS Special Interest Group within the TU Wien Cybersecurity Center (CySec). Since 2024, I have been the Chair of the Doctoral College on Trustworthy Autonomous Cyber-Physical Systems, and since 2025, I am serving as Research Focus Coordinator for Computer Engineering at the Faculty of Informatics, TU Wien. My research achievements have been recognized through multiple Best Paper Awards at EMSOFT 2025, QEST 2022, ADHS 2021, and RV 2011, along with the Radhia Cousot Young Researcher Award (SAS 2022) and the EASST Best Software Science Award (ETAPS 2022). News & Activities [+] October 2025 - My former PhD student, Dr. Drishti Yadav was awarded with Runner-up for the Best Dissertation Award Informatics Europe 2025 October 2025 - Our paper “Cumulative-Time Signal Temporal Logic” has received the Best Paper Award at EMSOFT 2025 in Taipei, Taiwan September 2025 - Our project proposal PROMT – Probably the Best Moment to terminate was funded with 880K Euro by Vienna Science Fund and will start on January 2026. August 2025 - Our paper \"Fault Injection for Simulink-based CPS Models: Insights and Future Directions\" has been accepted for publication in ASE (NIER) 2025. July 2025 - Our paper \"Cumulative-Time Signal Temporal Logic\" has been accepted for publication in EMSOFT 2025. July 2025 - Our paper \"A Tree-Shaped Tableau for Checking the Satisfiability of Signal Temporal Logic with Bounded Temporal Operators\" has been accepted for publication in EMSOFT 2025 . July 2025 - Our paper \"OFTEN-DeepRL: On-the-Fly Teaching of Ethical Norms to Deep Reinforcement Learning Agents\" has been accepted for publication in Proc. of ECAI-2025: the 28th European Conference on Artificial Intelligence , 2025. June 2025 - Our paper \"POPACheck: a Model Checker for probabilistic Pushdown Automata\" has been accepted for publication in Proc. of CAV 2025: the 37th International Conference on Computer Aided Verification. May 2025 - Our paper \"Exact Upper and Lower Bounds for the Output Distribution of Neural Networks with Random Inputs\" has been accepted for publication in Proc. of ICML 2025: the 42nd International Conference on Machine Learning. April 2025 - Our paper \"Rule-Guided Reinforcement Learning Policy Evaluation and Improvement\" has been accepted for publication in Proc. of IJCAI 2025: the 33rd International Joint Conference on Artificial Intelligence. January 2025 - Our paper \"Mining Specifications for Predictive Safety Monitoring\" has been accepted for publication in Proc. of the 6th ACM/IEEE International Conference on Cyber-Physical Systems. January 2025 - Our paper \"Quantifying the Satisfaction of Spatio-Temporal Logic Specifications for Multi-Agent Control\" has been accepted for publication in IEEE Transactions on Automatic Control. January 2025 - Our paper \"Signal Feature Coverage and Testing for CPS Dataflow Models\" has been accepted for publication in ACM Transactions on Software Engineering and Methodology. December 2024 - FWF funded our Doctoral college in Automated Reasoning with 2.5 Millions of Euro. Our TrustCPS group will have two PhD positions in formal methods starting from October 2025. November 2024 - Congratulations to Dr.in tech. Drishti Yadav for defending her dissertation “Enhancing Fault Diagnosis in Safety-Critical Cyber-Physical Systems”. July 2024 - Congratulations to Dr.in tech. Ana Oliveira da Costa for defending her dissertation “Design and Verification of Information Flows”. June 2024 - Our paper Probabilistic Loop Synthesis from Sequences of Moments has been accepted for publication in Proc. of QEST/FORMATS 2024 QEST+FORMATS joint conference, which will be held on 9-13 September 2024 in Calgary, Canada. May 2024 - Our paper (Un)Solvable Loop Analysis has been accepted for publication in Formal Methods in Systems Design International Journal. April 2024 - Our paper Adaptable configuration of decentralized monitors has been accepted for publication in Proc. of FORTE 2024 - 44th International Conference on Formal Techniques for Distributed Objects, Components, and Systems. March 2024 - Our paper Verifying Global Two-Safety Properties in Neural Networks with Confidence has been accepted for publication in the Proc. of CAV 2024: the 36th International Conference on Computer Aided Verification February 2024 - Our paper DeepRIoT: Continuous Integration and Deployment of Robotic-IoT Applications has been accepted for publication in the Proc. of DAC 2024: the 61st Design Automation Conference February 2024 - Our European twinning project VASSAL has been funded by the European Union September 2023 - We have established a new Doctoral College on Trustworthy Autonomous Cyber-Physical Systems and we have three positions funded by TTTech Auto and B&C Privatstiftung. July 2023 - Our paper An Energy-Aware Approach to Design Self-Adaptive AI-based Applications on the Edge has been accepted for publication in the Proc. of ASE 2023: the 38th IEEE/ACM International Conference on Automated Software Engineering July 2023 - Our paper Progression for Monitoring in Temporal ASP has been accepted for publication in the Proc. of ECAI 2023: the 26th European Conference on Artificial Intelligence July 2023 - Our paper Mining Specification Parameters for Multi-Class Classification has been accepted for publication in the Proc. of RV 2023: the 23rd International Conference on Runtime Verification July 2023 - Our paper Lightweight Verification of Hyperproperties has been accepted for publication in the Proc. of ATVA 2023: the 21st International Symposium on Automated Technology for Verification and Analysis June 2023 - Our paper Deductive Controller Synthesis for Probabilistic Hyperproperties has been accepted for publication in the Proc. of QEST 2023, the 20th International Conference on Quantitative Evaluation of SysTems, 2023 June 2023 - Our paper Introducing Asynchronicity to Probabilistic Hyperproperties has been accepted for publication in the Proc. of QEST 2023, the 20th International Conference on Quantitative Evaluation of SysTems, 2023 June 2023 - Our paper Mining Hyperproperties using Temporal Logics has been accepted for publication in the Proc. of EMSOFT 2023, the ACM SIGBED International Conference on Embedded Software June 2023 - Our paper Hypernode Automata has been accepted for publication in the Proc. of CONCUR 2023, the 34th International Conference on Concurrency Theory May 2023 - Eleonora Nesterini is awarded with the Marshal Plan Scholarship !! May 2023 - Emery Neufeld successfully defended his Ph.D. thesis: \"Norm Compliance for Reinforcement Learning Agents\" April 2023 - Miroslav Stankovic successfully defended his Ph.D. thesis: \"Moment-Based Loop Analysis\" March 2023 - Our paper TD-Magic: From Pictures of Timing Diagrams To Formal Specifications has been accepted for publication in Proc. of DAC 2023: the 60th Design Automation Conference, 2023 February 2023 - Our paper Provable Correct and Adaptive Simplex Architecture for Bounded-Liveness Properties has been accepted for publication in SPIN 2023, the 29th International Symposium on Model Checking Software, 2023 February 2023 - Michele Chiari was awarded with EU Marie Curie Postdoctoral Fellowship with the project \"CORPORA\" (PI: Michele Chiari, Mentor: Ezio Bartocci) December 2022 - Our project proposal \"TAIGER: Training and Guiding AI Agents with Ethical Rules\" (PI: Agata Ciabattoni, co-PIs: Ezio Bartocci and Thomas Eiter) has been funded by Vienna Science and Technology Fund. We will hire one PostDoc, two PhDs students and three master students. December 2022 - Our paper Property-based Mutation Testing has been accepted for publication in ICST 2023: the 16th IEEE International Conference on Software Testing, Verification and Validation. December 2022 - Our paper Solving Invariant Generation for Unsolvable Loops has been awarded with the Radhia Cousot Young Researcher Best Paper Award at SAS 2022: the 29th Static Analysis Symposium. October 2022 - I have joined the Editorial Board of \"Research Directions: Cyber-Physical Systems\", Cambridge Univ. Press. September 2022 - Our paper Moment-based Invariants for Probabilistic Loops with non-polynomial assignments has been awarded with the Best Paper Award at QEST 2022: the 19th Intern. Conference on Quantitative Evaluation of SysTems. September 2022 - Our paper On Normative Reinforcement Learning via Safe Reinforcement Learning has been accepted for publication in PRIMA 2022",
  "content_length": 18165,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:09"
}