{
  "name": "Fabio Nemetz",
  "homepage": "http://www.bath.ac.uk/comp-sci/contacts",
  "status": "success",
  "content": "Department of Computer Science Skip to main content University of Bath Open search Department of Computer Science Our highly-ranked department offers excellent graduate prospects and strong links to industry. Our research is strongly interdisciplinary and combines practical application with a theoretical understanding. Learn more about our computer science courses, including entry requirements and course structure. Get to know our courses, facilities and students without having to step foot on campus. One of our support technicians gives you a guided tour of the key spaces and facilities available in the Department. Dr Andrew Barnes in the Department of Computer Science is harnessing artificial intelligence to predict storms and extreme weather events all over the world. Find out what our students think about studying computer science at Bath. We offer a range of master's courses including data science, human-computer interaction, machine learning and a generalist course. Find out about our PhD degrees, funding opportunities and how you can apply. We train the next generation of specialists with expertise in AI, its applications and its implications. MSc Computer Science graduate, Jordan Koulouris, is a Software Engineer for Tripadvisor. Find out more about his role and his experience at Bath. Hand gesture controls being developed for the next generation of virtual and augmented reality systems risk excluding millions of people – new research. Scientists have reprogrammed a Roomba to perform four new tasks, showcasing how domestic robots can be harnessed during their downtime to make our lives easier. Home-based cycling game developed at Bath launches on the Meta Quest Store. AI and VR technology keep costs down and motivate exercisers to work harder. AI is transforming industries at an unprecedented pace and this showcase supported collaboration with industry which is key to unlocking its full potential. Major tech companies are investing billions in augmented reality (AR) headsets and smart glasses, but how will this cutting-edge technology enhance daily life? New open access software could be used by clinicians, physiotherapists, sports coaches and athletes to analyse body movements without motion capture suits. Top 10 for student experience for Computer Science in The Times and The Sunday Times Good University Guide 2026 Top 10 for computer science in the Complete University Guide 2026 Top 10 for student satisfaction for computer science in the Complete University Guide 2026 Athena SWAN Bronze Award Our research is strongly interdisciplinary and combines practical application with a theoretical understanding. Find a member of staff in the department. We create advanced motion tracking technologies for use in the entertainment industry, training and athlete performance, and assistive technologies. Our research engineers are working with industrial researchers in leading animation, VFX and games companies. We train the next generation of specialists with expertise in AI, its applications and its implications. Explore our state-of-the-art facilities available for teaching and research with expert support from University staff. We are part of the South West's Digital Engineering Technology and Innovation (DETI) programme. Find out how we are digitally transforming future engineering. The University of Bath is committed to exploring mutually beneficial partnerships with industry. This guide gives you the information you need to get started. View Larger Map Go to X (Formerly Twitter)",
  "content_length": 3548,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:43"
}