{
  "name": "Fabiano Dalpiaz",
  "homepage": "https://www.staff.science.uu.nl/~dalpi001",
  "status": "success",
  "content": "Website of Fabiano Dalpiaz Fabiano Dalpiaz Home Publications Research Teaching Activities Contact Studying the synergies of AI and humans for building trustworthy software. I am professor of Software Production in the Department of Information and Computing Sciences at Utrecht University in the Netherlands. I am principal investigator in the department's Requirements Engineering lab. In my research, I blend artificial intelligence with information visualization in order to increase the quality of the requirements engineering process and artifacts. I devise software tools that assist human analysts and stakeholders in eliciting, expressing and analyzing requirements. Most of my research is validated empirically via experiments and/or collaboration with software companies. I am currently the Editor-in-Chief of Springer Nature's Requirements Engineering Journal, and I am the Steering Committee chair of the REFSQ conference. I served as program co-chair of IEEE RE 2023, REFSQ 2021, RCIS 2020. I was the organization chair for the REFSQ 2018 conference, I am an associate editor for the Business & Information Systems Engineering Journal, and I am on the steering committee of the IEEE RE conferences. I regularly serve on the program committee of international conferences such as RE, CAiSE, REFSQ, ER, MODELS. Before joining Utrecht University in 2013, I was a post-doctoral fellow at the Department of Computer Science, University of Toronto, Canada (2012-2013) and previously at the Department of Information Engineering and Computer Science, University of Trento, Italy (2011-2012). I obtained a Ph.D. from the same university (2006-2011) in the area of self-adaptive systems. For more information, check out my personal website. About me: [resume] [Google Scholar] Selected publications Evaluating Classifiers in SE Research: The ECSER Pipeline and Two Replication Studies (Davide Dell'Anna, Fatma Başak Aydemir, Fabiano Dalpiaz), In Empirical Software Engineering, 2023. [doi] Crowd-based requirements elicitation via pull feedback: Method and case studies (Jelle Wouters, Abel Menkveld, Sjaak Brinkkemper, Fabiano Dalpiaz), In Requirements Engineering, 2022. [doi] On Deriving Conceptual Models from User Requirements: An Empirical Study (Fabiano Dalpiaz, Patrizia Gieske, Arnon Sturm), In Information and Software Technology, volume 131, 2021. [doi] Runtime Revision of Sanctions in Normative Multi-Agent Systems (Davide Dell'Anna, Mehdi Dastani, Fabiano Dalpiaz), In Autonomous Agents and Multi-Agent Systems, 2020. [pdf] Extracting conceptual models from user stories with Visual Narrator (Garm Lucassen, Marcel Robeer, Fabiano Dalpiaz, Jan Martijn E. M. van der Werf, Sjaak Brinkkemper), Requirements Engineering, volume 22, 2017. [pdf] Tweets by FabianoDalpiaz",
  "content_length": 2783,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:43"
}