{
  "name": "Fabián E. Bustamante",
  "homepage": "http://www.cs.northwestern.edu/~fabianb",
  "status": "success",
  "content": "Fabián E. Bustamante (networking and distributed systems) Fabián E. Bustamante Professor Computer Science Northwestern University Director of Research Phenix RTS fabianb@... S. Mudd, 3509 2233 Tech Drive, 3rd Floor Evanston, IL USA 60208 1.847.491-2745 The principle of science, the definition, almost, is the following: The test of all knowledge is experiment. Experiment is the sole judge of scientific 'truth'. But what is the source of knowledge? Where do the laws that are to be tested come from? Experiment, itself, helps to produce these laws, in the sense that it gives us hints. Richard Feynman, The Feynman Lectures on Physics I conduct research on Internet-scale computer networks and distributed systems. My research approach is primarily experimental -- building and evaluating ideas in “the wild”. Much of my work focuses on improving the visibility of measurement on networked systems, leveraging this visibility to characterize them and the infrastructure they rely on, and designing new and improved systems based on the gained insight. As the forces shaping the Internet ecosystem are less purely technical, in recent years I have started to explore the interactions between pervasive networked systems and their broader context, from natural disaster, to political unrest and economics. more? What's New? I am always looking for good students interested in networked systems (distributed systems, networking, wired and mobile systems). Rashna will be presenting \"Of Choices and Control - A Comparative Analysis of Government Hosting\" at the ACM IMC 2024 in Madrid, Spain. Esteban presented our paper on \"Ten years of the Venezuelan crisis - An Internet perspective\" at SIGCOMM 2024 in beautiful Sydney. Walter Willinger and I co-organized an NSF Workshop focused on Internet Survivability. A fantastic, diverse group of participants and some great discussions. Two SIGMETRICS papers back to back, in 2023 looking at global threats towards consolidation and in 2024 on a study of intercontinental long-haul links as the network-layer manifestation of critical transoceanic undersea cables. Oldies but goodies ... Walter Willinger and I, with a lot of help from our co-organizers, run the first NSF workshop focused on Internet resilience and survivability. The report is available at the SIGCOMM CCR. Demand on Internet systems as a proxy for social distancing - read our cool IMC 2021 paper \"Networked Systems as Witnesses - Association Between Content Demand, Human Mobility and an Infection Spread\". A new on IPXs, a great collaboration with Andra Lutu and Diego Perino, from Telefonica Research, and Marcelo Bagnulo, from the Universidad Carlos III de Madrid will appear in ACM SIGCOMM 2021. Nick Feamster and I co-chaired the ACM Internet Measurement Conference 2020. Among the many changes we introduced to the review process, the use of a Review Task Force and Early Rejections seem to be popular and have been adopted by several other great conferences since. A great NSF/FCC workshop on tracking quality of experience in the Internet. The report from it is now available at the SIGCOMM CCR. An op-ed in Pacific Standard on Cuban Internet connectivity My op-ed on Forbes on the right to affordable broadband Blog Fabián E. Bustamante is a Professor of Computer Science at Northwestern University and Director of Research at Phenix, a Chicago-based startup specializing in real-time video streaming at scale. He earned his M.Sc. and Ph.D. in Computer Science from the Georgia Institute of Technology. Prior to that, he studied and taught at Universidad Nacional de La Patagonia San Juan Bosco (Argentina), where he earned both a 3-year and 5-year degree in computer science. His research interests span several areas of experimental systems, with a focus. His group has released numerous open-source systems, collectively used by over 1.5 million people. Fabián is a senior member of ACM and IEEE, and a recipient of the NSF CAREER award, multiple Google Faculty Research Awards, and the Science Foundation of Ireland’s E.T.S. Walton Visitor Award. Curriculum Vitae Recent and representative publications Of Choices and Control - A Comparative Analysis of Government Hosting Rashna Kumar, Esteban Carisimo, Lukas De Angelis Riva, Mauricio Buzzone, Fabián E. Bustamante, Ihsan Ayyub Qazi, Mariano G. Beiro Proc. of the ACM IMC, 2024 Ten years of the Venezuelan crisis - An Internet perspective Esteban Carisimo, Rashna Kumar, Caleb J. Wang, Santiago Klein, Fabián E. Bustamante Proc. of the ACM SIGCOMM, 2024 Towards Re-Architecting Today's Internet for Survivability: NSF Workshop Report Fabián E. Bustamante, John Doyle, Walter Willinger, Marwan Fayed, David L. Alderson, Steven Low, Stefan Savage, Henning Schulzrinne ACM SIGCOMM Computer Communication Review (CCR), 54 (1), pp. 36 - 47, 2024 A hop away from everywhere: A view of the intercontinental long-haul infrastructure Esteban Carisimo, Caleb Wang, Mia Weaver, Fabián E. Bustamante, Paul Barford ACM SIGMETRICS 2024 Each at its own pace: Third-party Dependency and Centralization Around the World Rashna Kumar, Sana Asif, Elise Lee, Fabián E. Bustamante ACM SIGMETRICS 2023 Global Mobile Network Aggregators: Taxonomy, Roaming Performance and Optimization S. Alcalá-Marín, A. Raman, W. Wu, A. Lutu, M. Bagnulo, O. Alay, F.E. Bustamante. ACM MobiSys 2022 Insights from Operating an IP Exchange Provider, A. Lutu, D. Perino, M. Bagnulo, F.E. Bustamante.ACM SIGCOMM 2021 Out of Sight, Not Out of Mind - A User-View on the Criticality of the Submarine Cable Network, S. Liu, Z. Bischof, I. Madan, P. Chan, and F.E. Bustamante. IMC 2020 Where Things Roam: Uncovering Cellular IoT/M2M Connectivity, A. Lutu, B. Jun, A. Finamore, F.E. Bustamante, D. Perino. IMC 2020 AMP up your mobile web experience: Characterizing the impact of Google’s Accelerated Mobile Project, B. Jun, F. E. Bustamante, S-Y. Whang and Z. Bischof. Mobicom 2019 Untangling the world-wide mesh of undersea cables Z. Bischof, R. Fontugne, F.E. Bustamante. HotNets 2018 The Growing Importance of Being Always On -- A first look at the reliability of broadband Internet access, Z. Bischof, F. E. Bustamante, N. Feamster. TPRC46 2018 Mile High WiFI: A First Look At In-Flight Internet Connectivity J. Rula, F. E. Bustamante, J. Newman, A. Molavi Khaki, D. Choffnes. WWW 2018 All publications Teaching Fall 2024: CS-440 Advanced Networking A seminar exploring the challenges with measurement and evaluation of large Internet-scale systems. Tue/Thu 11:00-12:20AM Winter 2025: CS-497 Internet-scale Experimentation A seminar exploring the challenges with measurement and evaluation of large Internet-scale systems. Tue/Thu 11:00-12:20AM Spring 2025: CS-345 Distributed Systems An introduction to distributed systems, reviewing both seminal and recent work in the field. Tue/Thu 11:00-12:20AM Previous Courses Postdocs Esteban Carisimo, Ph.D. Students Santiago Klein, Ph.D. student Rashna Kumar, Ph.D. student Kedar Thiagarajan, Ph.D. student Caleb Wang, Ph.D. student Ying Zhang, Ph.D. student Alumni Byungjin Jun (Ph.D. 2023) -- Professor at the Korean Military Academy in Seoul, South Korea Zach Bischof (Ph.D. 2017) -- Research Scientist at Georgia Tech John Rula (Ph.D. 2017) -- CTO at nZero Mario Sánchez (Ph.D., 2014) -- Facebook John Otto (Ph.D., 2013/14) -- Google David Choffnes (Ph.D., 2010) - Associate Professor at Northestern U. Stefan Birrer (Ph.D., 2008) -- CTO At PhenixP2P Michael Polinski, B.S./M.S. -- Now a Ph.D. student at Northwestern University. Weili Wu (MS 2023) -- Now a Ph.D. student at Georgia Tech. Aman Khalid (MS 2022) -- Now at E Shucheng (Alex) Liu (MS 2021) Sana Asif (MS 2021) Andrew Weiner (MS 2017) -- PhenixP2P James Whang (BS/MS 2017) -- Microsoft Nathan A. Lindquist (BS/MS 2018) -- TIBCO Prashanth Vsanthakrisnan (MS, 2019) -- TIBCO Robert H. Belson (BS/MS, 2019) -- Verizon Ishaan Madan (BS, 2020) -- Apple Sana Asif (MS, 2021) Alex Liu (MS, 2021) Rohit Mandrekar (MS, 2021) ... The complete list ... Selected Professional Activities Program Committees ACM IMC 2025 NSDI 2025 ACM CoNEXT 2024 ACM IMC 2024 Co-chair with Walter Willinger the NSF Workshop: : Towards Re-architecting Today’s Internet for Survivability Past: IEEE ICNP 2022 ACM IMC 2022 ACM CoNEXT 2022 ACM IMC 2021 | PAM 2021 | IEEE ICNP 2021 | NSDI 2020 | CoNEXT 2019 | IMC 2018 | CoNEXT 2018 | EuroSys 2018 | NSDI 2017 | PAM 2017 | ACM SIGCOMM Internet QoE 2017 | IMC 2016 | SIGCOMM 2016 | ACM SIGCOMM Internet QoE 2016 | ACM SIGCOMM LANCOMM 2016 | CoNEXT 2015 | IMC 2015 | EuroSys 2014 | ICDCS 2014 | IEEE P2P 2014 | CoNEXT 2013 | Networking 2013 | ICDCS 2013 | ACM SIGCOMM 2012 ... (A complete list can be found in my CV) Other Professional Service Co-organizer of the first NSF Workshop: Towards Re-architecting Today’s Internet for Survivability, held in Evanston, Illinois in November 2023 Co-chair with Nick Feamster of the ACM IMC 2020 Co-chair with Georgios Smaragdakis of the CoNEXT 2020 Student Workshop. Steering Committee of the NSF Workshop on Overcoming Measurement Barriers to Internet Research (WOMBIR 2021) Steering Committee for Passive and Active Measurement Conference (PAM) General Co-Chair for PAM 2019 Co-organizer of the first NSF/FCC Workshop on Tracking Quality of Experience in the Internet, held in Princeton in October 2015 Co-founder/organizer of ACM SIGCOMM Workshop on Crowdsourcing and crowdsharing of Big (Internet) Data (C2B(I)D) General Co-Chair for SIGCOMM 2014 Editorial board of IEEE/ACM Transactions on Networking - 2014 -- 2018 Chair Steering Committee for IEEE International Conference on Peer-to-Peer Computing - 2013 -- 2015 (member from 2012 -- 2015) Editorial board of IEEE Internet Computing - 2012 -- Present Editorial board of SIGCOMM CCR - 2013 -- 2018 (A complete list can be found in my CV) Affiliations Adjunct Associate Professor School of Computer Science and Statistics, Trinity College Dublin (Ireland) - 2012 -- Present Affiliated Faculty - Northwestern Institute on Complex Systems - founded ",
  "content_length": 11605,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:49"
}