{
  "name": "Fabian Wirth",
  "homepage": "http://www.fim.uni-passau.de/en/dynamical-systems/publications/prof-dr-fabian-wirth",
  "status": "success",
  "content": "Prof. Dr. Fabian Wirth - University of Passau Information for... Information for... Current students Prospective students Academics Early career researchers Businesses Alumni and friends Staff Media representatives Faculties & facilities Administration Central facilities Faculties Faculty of Law Faculty of Social and Educational Sciences Faculty of Humanities and Cultural Studies School of Business, Economics and Information Systems Faculty of Computer Science and Mathematics Central facilities Graduate Centre PICAIS Sports Centre Language Centre University Library Centre for Information Technology and Media Services Teacher Education Centre Central facilities Research Strategy & Science Communication Executive Support Unit for Health and Safety Executive Support Unit for Competency Development in Study and Teaching Executive Support Unit for Process Management Managing Office of the Bavarian Higher Education Digitalisation Association (BHEDA) Research Services Graduate Centre PICAIS Sports Centre Language Centre University Library Centre for Information Technology and Media Services Teacher Education Centre Heading Information for... Faculties & facilities Login Go directly to... Apply Study options Academic Advice Service Course catalogue International Office Careers and Competencies Examinations Office Graduate Centre Student Services Association University Library en de Information for... Faculties & facilities Go directly to... Apply Study options Academic Advice Service Course catalogue International Office Careers and Competencies Examinations Office Graduate Centre Student Services Association University Library Support Login en de Chair of Dynamical Systems Chair of Dynamical Systems Prof. Dr. Fabian Wirth Submitted articles C. King, H. Hamedmoghadam, C. Cassandras, F. Wirth, R. Shorten Dynamic access pricing control for fair and stable resource sharing \t2025 pdf-version R. Heni, A. Mironchenko, F. Wirth, H. Damak, M. Hammami Lyapunov methods for input-to-state stability of time-varying evolution equations \t2025 pdf-version J. Epperlein, F. Wirth Auerbach bases, projection constants, and the joint spectral radius of principal submatrices \t2025 pdf-version Books D. Hinrichsen, A. Pritchard, F. Colonius, T. Damm, A. Ilchmann, B. Jacob and F. Wirth Mathematical Systems Theory III \tLinear Quadratic Control and Adaptive Feedback \tSpringer Cham, 2025 Springer's information page D. Hinrichsen, A. Pritchard, F. Colonius, T. Damm, A. Ilchmann, B. Jacob and F. Wirth Mathematical Systems Theory II \tControl, Observation, Realization, and Feedback \tSpringer Cham, 2025 Springer's information page E. Crisostomi, R. Shorten, S. Stüdli and F. Wirth. Electric and Plug-in Hybrid Vehicle Networks: Optimization and Control. Boca Raton, FL: CRC Press, 2018. CRC's information page M. Corless, C. King, R. Shorten, and F. Wirth. AIMD Dynamics and Distributed Resource Allocation. Vol. 29. Advances in Design and Control. Philadelphia, PA: SIAM, 2016. SIAM's information page V. Blondel, M. Karow, V. Protasov, F. Wirth, eds., Special Issue on the Joint Spectral Radius, Linear Algebra and its Applications 428 (10); 2008. F. Colonius, U. Helmke, D. Prätzel-Wolters, F. Wirth, eds., Advances in Mathematical Systems Theory, Birkhäuser, Boston, 2000. Birkhäuser's information page Patents R.L. Cogill, O. Gallay, C. Lee, Z. Nabi, M. Rufli, R. Shorten, T. Tchrakian, R. Verago, F.R. Wirth, and S. Zhuk. Vehicle and local area security system communications. US Patent US 9598050 B2. 2017. issued 2017/3/21. R.L. Cogill, O. Gallay, C. Lee, Z. Nabi, M.M. Rufli, R. Shorten, T.T. Tchrakian, R. Verago, F.R. Wirth, Jia Y. Yu, and S. Zhuk. Distributed parking space detection, characterization, advertisement, and enforcement. US Patent US 9601018 B2.2017. issued 2017/3/21. R.L. Cogill, C. Lee, Z. Nabi, J. Naoum-Sawaya, M. Rufli, R. Shorten, T. Tchrakian, R. Verago, F. Wirth, and S. Zhuk. System for charging mobile device using an adhoc infrastructure with energy harvesting capabilities. US Patent 9887566B2. 2018. issued 2018/2/6. R.L. Cogill, O. Gallay, C. Lee, Z. Nabi, M. Rufli, R. Shorten, T. Tchrakian, R. Verago, F.R. Wirth, and S. Zhuk. System and method for air-pollutant source localization using parked motor vehicles. US Patent US 995 21 90 B2.2018. issued 2018/4/24. R. Cogill, J. Marecek, M. Mevissen, P. Palmes, R. Shorten, and F.R. Wirth. Disruption forecasting in complex schedules. U.S. Patent No. 11,023,816. 2021. Journal articles A. Kilian, B. Maschke, A. Mironchenko, F. Wirth Infinite-dimensional port-Hamiltonian systems with a stationary interface \tEuropean Journal of Control, Volume 82, 2025 pdf-version J. Epperlein, F.Wirth The joint spectral radius is pointwise Hölder continuous \tLinear Algebra and its Applications, 704, pp. 92 - 122, 2025 pdf-version Lucas Brivadis, Antoine Chaillet, Andrii Mironchenko and Fabian Wirth Forward completeness implies bounded reachable sets for time-delay systems on the state space of essentially bounded measurable functions IEEE Control System Letters, 8, pp. 1667 - 1672, 2024 Antoine Chaillet, Fabian Wirth, Andrii Mironchenko and Lucas Brivadis For time-invariant delay systems, global asymptotic stability does not imply uniform global attractivity IEEE Control System Letters, 8, pp. 484 - 489, 2024 pdf-version P. Ferraro, J. Y. Yu, R. Ghosh, S. E. Alam, J. Marecek, F. Wirth, R. Shorten On unique ergodicity of coupled AIMD flows International Journal of Control, p. 1-11, 2023 pdf-version A. Kilian, B. Maschke, A. Mironchenko, F. Wirth A case study of port-Hamiltonian systems with a moving interface IEEE Control System Letters, 7, p. 1572-1577, 2023 pdf-version J. Marecek,  M. Roubalik, R. Ghosh, R. Shorten, F. Wirth Predictability and Fairness in Load Aggregation and Operations of Virtual Power Plants Automatica, 147, p. 110743, 2023 pdf-version V. Bürgin, J. Epperlein, F. Wirth Remarks on the tail order on moment sequences Journal of Mathematical Analysis and Applications, 512 (1), p. 126135, 2022 pdf-version N. Noroozi, A. Mironchenko, F. Wirth   A relaxed small-gain theorem for discrete-time infinite networks Automatica, 142, p.110363, 2022 pdf-version G. Russo, F. Wirth Matrix measures, stability and contraction theory for dynamical systems on time scales Discrete and Continuous Dynamical Systems - Series B, 2022, 27(6): 3345-3374, 2022 pdf version A. Mironchenko, Ch. Prieur, F. Wirth Local stabilization of an unstable parabolic equation via saturated controls IEEE Transactions on Automatic Control, 66(5):2162-2176, 2021 pdf version B. Jacob, A. Mironchenko, J. Partington, and F. Wirth Non-coercive Lyapunov functions for input-to-state stability of infinite-dimensional systems SIAM Journal on Control and Optimization, 58(5):2952–2978, 2020 pdf version R. Geiselhart, L. Grüne, N. Noroozi, F. Wirth Control of discrete-time nonlinear systems via finite-step control Lyapunov functions Systems & Control Letters 138, 104631, 2020 pdf version N. Noroozi, R. Geiselhart, S.H. Mousavi, R. Postoyan, and F. Wirth. Integral input-to-state stability of networked control systems. IEEE Transactions on Automatic Control 65 (3), pp. 1203-1210, 2020. pdf-version A.R. Fioravanti, J. Marecek, R. Shorten, M. Souza, and F. Wirth On the ergodic control of ensembles. Automatica 108, 108483, 2019. pdf-version F. Wirth, S. Stüdli, J.Y. Yu, M. Corless and R. Shorten. Nonhomogeneous place-dependent Markov chains, unsynchronised AIMD, and network utility maximization. Journal of the ACM (JACM) 66 (4) pp. 1- 37, 2019. pdf-version A. Mironchenko and F. Wirth. Existence of non-coercive Lyapunov functions is equivalent to integral uniform global asymptotic stability. Mathematics of Control, Signals, and Systems 31 (2), pp. 1 - 26, 2019. pdf-version  G. Russo, F. Wirth, and R. Shorten.  On synchronization and consensus in continuous-time networks of nonlinear nodes with state dependent and degenerate noise diffusion.  IEEE Transactions on Automatic Control 64 (1), pp. 389-395, 2019. A. Mironchenko and F. Wirth. Non-coercive Lyapunov functions for infinite-dimensional systems. Journal of Differential Equations 266 (11), pp. 7038-7072, 2019. pdf-version  A. Mironchenko and F. Wirth.  Lyapunov characterization of input-to-state stability for semilinear control systems over Banach spaces. Systems & Control Letters 119, pp. 64-70, 2018. N. Guglielmi, O. Mason, and F. Wirth.  Barabanov norms, Lipschitz continuity and monotonicity for the max algebraic joint spectral radius.  Linear Algebra and its Applications 550, pp. 37–58, 2018. A. Mironchenko and F. Wirth.  Characterizations of input-to-state-stability for infinite-dimensional systems.  IEEE Transactions on Automatic Control 63 (6), pp. 1602–1617, 2018. N. Noroozi, R. Geiselhart, L. Grüne, B.S. Rüffer, and F. Wirth.  Non-conservative discrete-time ISS small-gain conditions for closed sets.  IEEE Transactions on Automatic Control 63 (5), pp. 1231–1242, 2017. M. Liu, F. Wirth, M. Corless, and R. Shorten.  On the stability and convergence of a class of consensus systems with a nonlinear input. Automatica 86, pp. 205–211, 2017. M. Souza, F. Wirth, and R. Shorten.  A note on recursive Schur complements, block Hurwitz stability of Metzler matrices and related results.  IEEE Transactions on Automatic Control 62 (8) (2017), pp. 4167–4172. W. Griggs, J. Y. Yu, F. Wirth, F. Häusler, and R. Shorten. On the design of campus parking systems with QoS guarantees. IEEE Transactions on Intelligent Transportation Systems 17 (5), pp. 1428-1437, 2016. C. M. Kellett, and F. Wirth. Nonlinear scaling of (i)ISS-Lyapunov functions. IEEE Transactions on Automatic Control 61 (4), pp. 1087-1092, 2016. M. Liu, R. Ordonez-Hurtado, F. Wirth, Y. Gu, E. Crisostomi, and R. Shorten. A distributed and privacy-aware speed advisory system for optimising conventional and electric vehicle networks. IEEE Transactions on Intelligent Transportation Systems 17 (5), pp. 1308-1318, 2016. R. Geiselhart and F. Wirth. Relaxed ISS sm",
  "content_length": 55125,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:37"
}