{
  "name": "Fabien Torre",
  "homepage": "https://fabien-torre.fr",
  "status": "success",
  "content": "Fabien Torre Accueil du site Ce site présente mes activités de recherche et mes activités d'enseignement à l'université de Lille, ainsi que d'autres occupations annexes. Présentation de Fabien Torre J'ai été recruté en septembre 2000 à l'Université Lille 3 : Maître de conférences en Informatique (CNU 27). Je suis aujourd'hui rattaché au Département Informatique de la Faculté des Sciences et Technologies de l'Université de Lille. J'ai été élu dans différents conseils de l'université, administrateur de Lille 3 de 2005 à 2008, secrétaire du CHSCT de 2012 à 2015. Au niveau national, j'ai été membre du CNU 27 section informatique de 2011 à 2019. Voir mes pages « responsabilités » pour plus de détails. J'ai enseigné à différents publics au sein de l'UFR IDIST, puis à l'UFR MIME. Aujourd'hui j'enseigne principalement dans les départements de sciences du langage, de sociologie et de lettres modernes pour des cours autour de l'algorithmique et de la programmation pour le traitement automatique des textes. J'interviens également dans le département de mathématiques pour un cours de programmation web. Voir mes pages « enseignement » pour plus d'informations. Pour la recherche, je m'intéresse à l'apprentissage automatique et à l'intelligence artificielle, essentiellement symboliques et appliqués aux données médicales. Voir mes pages « recherche » pour davantage de renseignements. Quelques réalisations Disponibles en ligne : Localisation de terrains de basket (open data, Python, etc.) : en Corse du Sud ou à Lille. Démonstrations d'algorithmes d'Intelligence Artificielle pour les jeux. Interface « boum le mur » pour les exercices de Robot. Jeu de la vie avec canvas HTML5, CSS et JavaScript. Simulations graphiques d'algorithmes d'apprentissage automatique. Animations d'algorithmes de boosting en apprentissage automatique. Preuve que la VC-dimension de trois droites qui votent est au moins 10. Visibles ailleurs (fils Twitter) : Tracés de trajectoires (d'une lune autour de sa planète autour du soleil) dans un canvas html5, en JavaScript. Étude des prénoms donnés en France depuis un siècle à l'aide de scripts Perl. Extraction de certains mots d'un corpus à l'aide d'un concordancier programmé en Perl. Aussi la FAQ LaTeX 2001. Adhésions SPECIF Campus, Société Professionnelle des Enseignants et Chercheurs en Informatique de France. SIF, Société Informatique de France. AFIA, Association Française pour l'Intelligence Artificielle. April, promouvoir et défendre le logiciel libre. Contacts et pointeurs La bêtise, c'est de la paresse. La bêtise, c'est un type qui vit et qui se dit « je vis, je vais bien, ça me suffit ». Il ne se botte pas le cul tous les matins en se disant « c'est pas assez, tu ne sais pas assez de choses, tu ne vois pas assez de choses, tu ne fais pas assez de choses ! » C'est de la paresse, je crois, la bêtise. Une espèce de graisse autour du coeur, une graisse autour du cerveau... Jacques Brel. Web Mastodon Bluesky Facebook Description Survoler un lien de navigation pour lire sa description ici... Licence Le contenu de cette page est mis à disposition selon les termes de la Licence Creative Commons « Attribution - Utilisation Non Commerciale - Partage dans les mêmes conditions ». Une photo au hasard Week-end chevillais. (le 10 mai 2008) Cactus de Pâques, en mai.",
  "content_length": 3317,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:39"
}