{
  "name": "Fabian H. Sinz",
  "homepage": "https://sinzlab.org",
  "status": "success",
  "content": "Neuronal Building Blocks of Intelligence | Neuronal Intelligence Group Previous Next About us Despite huge advances in artificial intelligence (AI), the mammalian brain is still unrivaled in terms of sustainability and speed of learning, and robustness in inference. One central goal of AI research is to build intelligent systems that exceed the capabilities of biological brains. However, to date we know very little about how computations in neuronal circuits give rise to biological intelligence. Our group uses AI both as a testbed and a tool on large scale neuro-physiological and -anatomical data to better understand the constituent elements of neuronal intelligence. We are inspired by the idea that a deeper understanding of computational motifs in cortical circuits can help build the next generation of intelligent systems. We are based at the University Göttingen. We closely collaborate with experimental and computational neuroscientists to develop new tools and experimental paradigms to discover principles of biological intelligence. Find us on BlueSky News September 2025 Pavi’s paper on rendered 3D MEIS got accepted at the NeuREPS workshop 2025! September 2025 Finn’s paper got accepted at NeurIPS 2025! April 2025 The MICrONS package has finally been published in Nature. February 2025 Fabian is co-organizing the CAJAL NeuroAI course 2025. Applications are open now until Marth 7th! We have a great list of faculty covering topics from fly to human, and from anatomical models to reinforcement learning. Jacob Yates – UC Berkeley, USA Martin Schrimpf – EPFL, Switzerland Maria Eckstein – Google DeepMind, UK Patrick Mineault – Amaranth Foundation, USA Carsen Stringer – HHMI Janelia Research Campus, USA Chris Summerfield – Oxford University, UK John Krakauer – Champalimaud, Portugal Memming Park – Champalimaud, Portugal Andreas Tolias – Stanford, USA Jonathan Pillow – Princeton University, USA Shailee Jain – UC San Francisco, USA January 2025 Konsti successfully defended his thesis. Congratulations Dr. Willeke! Collaborators Tobias Rose (University Bonn) Jacob Reimer (Baylor College of Medicine) Tolias Lab (Stanford University) Ecker Lab (University Göttingen) Katrin Franke (University Tübingen/Stanford University) Alexander Gail (Deutsches Primatenzentrum Göttingen) Kathrin Brockmann (University Tübingen) Leif Saager (Universitätsmedizin Göttingen) Günther Hahn (Universitätsmedizin Göttingen) Affiliations sinzlab sinzlab Powered by Bootstrap 4 Github Pages",
  "content_length": 2531,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:34"
}