{
  "name": "Fabian Monrose",
  "homepage": "https://fabianmonrose.github.io",
  "status": "success",
  "content": "fabianmonrose.github.io I am the Julian T. Hightower Chair Professor in Cybersecurity within the School of Electrical and Computer Engineering. I also hold a courtesy appointment in the School of Cybersecurity and Privacy. My research interests include all aspects of computer and network security. Academic Positions 2022–now Julian T. Hightower Chair, College of Engineering and School of Cyber Security and Privacy, Georgia Tech 2017–2022 Kenan Distinguished Professor, Department of Computer Science, UNC Chapel Hill 2012–2017 Professor, Department of Computer Science, UNC Chapel Hill 2008–2012 Associate Professor, Department of Computer Science, UNC Chapel Hill 2007–2008 Associate Professor, Department of Computer Science, Johns Hopkins University 2002–2007 Assistant Professor, Department of Computer Science, Johns Hopkins University Education 1996–1999 New York University, New York, NY Ph.D. in Computer Science Distributed Computing and Systems Lab Advisor: Zvi M. Kedem and Aviel D. Rubin 1993–1996 New York University, New York, NY M.Sc. in Computer Science Distributed Computing and Systems Lab Advisor: Zvi M. Kedem 1989–1993 Barry University, Miami, FL B.Sc. Computer Science Recent Publications (more) Repairing Trust in Domain Name Disputes Practices: Insights from a Quarter-Century’s Worth of Squabbles Boladji Vinny Adjibi, Athanasios Avgeditis, Manos Antonakakis, Alberto Dainotti, Michael Bailey and Fabian Monrose Network and Distributed System Security (NDSS) Symposium, 2026 (to appear). From Concealment to Exposure: Understanding the Lifecycle and Infrastructure of APT Domains Athanasios Avgetidis, Aaron Faulkenberry, Boladji Vinny Adjibi, Tillson Galloway, Panagiotis Kintis, Omar Alwari, Zane Ma,Fabian Monrose, Angelos D. Keromytis, Roberto Perdisci and Manos Antonakakis International Symposium on Research in Attacks, Intrusions and Defenses (RAID), 2025. Seeing is Believing: Interpreting Behavioral Changes in Audio Deepfake Detectors Arising from Data Augmentation Boo Fullwood and Fabian Monrose In 18th ACM Workshop on Artificial Intelligence and Security, 2025. The Guardians of Name Street: Studying the Defensive Registrations of the Fortune 500 Boladji Vinny Adjibi, Athanasios Avgeditis, Manos Antonakakis, Michael Bailey and Fabian Monrose Network and Distributed System Security (NDSS) Symposium, 2025. Understanding LLMs Ability to Aid Malware Analysts in Bypassing Evasion Techniques Miuyin Yong, Kevin Valakuzhy, Mustaque Ahamad, Douglas M. Blough and Fabian Monrose Companion Proceedings of the 26th International Conference on Multimodal Interaction (ICMI), 2024. Comparing Malware Evasion Theory with Practice: Results from Interviews with Expert Analysts Miuyin Yong, Matthew Landen, Frank Li, Fabian Monrose and Mustaque Ahamad USENIX Symposium on Usable Privacy and Security (SOUPS), 2024. CrashTalk: Automated Generation of Precise, Human Readable, Descriptions of Software Security Bugs Kedrian James, Kevin Valakuzhy, Kevin Snow, Fabian Monrose ACM Conference on Data and Application Security and Privacy, 2024. Towards Practical Fabrication Stage Attacks Using Interrupt-Resilient Hardware Trojans Athanasios Moschos, Fabian Monrose and Angelos Keromytis IEEE International Symposium on Hardware Oriented Security and Trust, 2024. Improving Security Tasks Using Compiler Provenance Information Recovered At the Binary-Level Yufei Du, Omar Alwari, Kevin Snow, Manos Antonakakis and Fabian Monrose ACM Conference on Computer and Communications Security, 2023. Honors and Awards 2021 CSSA Graduate Teaching Award UNC Computer Science Department 2015 Undergraduate Students Teaching Award UNC Computer Science Department 2013 Best Student Paper Award IEEE Symposium on Security and Privacy 2012 Outstanding Research in Privacy Enhancing Technologies Privacy Enhancing Technologies 2011 ATT Best Applied Security Paper Award NYU-Poly CSAW 2011 Best Paper Award IEEE Symposium on Security and Privacy 2006 CAREER Award National Science Foundation 1999 Best Overall and Best Student Paper Awards USENIX Security Symposium Recent Courses 2021 Introduction to Computer Security, UNC Chapel Hill 2021 Computer and Network Forensics, UNC Chapel Hill 2020 Technical Communications and Writing in CS, UNC Chapel Hill 2017 Computer Forensics, UNC Chapel Hill 2014 Network Security, UNC Chapel Hill Recent Advising (GT and UNC) 2023–now Boo Fullwood, PhD student 2022–now Vinny Adjibi, PhD student (co-advised) 2024–now Tillson Galloway, PhD student (co-advised) 2022–now Kevin Valakuzhy, PhD student (co-advised) 2020–now Yufei Du, PhD student 2018–now Kedrian James, PhD student (at UNC) 2018–2023 Mac Malone, PhD student 2019–2021 John Lim, Master's student 2020–2022 Kevin Lane, Master's student 2010–2014 Srinivas Krishnan, Master's Student 2015–2017 Roman Rogowski, Master's student 2012–2016 Teryl Taylor, Ph.D. student 2016–2012 Yi Xu, Ph.D student 2010–2015 Andrew M. White, PhD. student 2009–2014 Kevin Z. Snow, PhD. student Recent Doctoral Committees 2019–2021 Omar Alwari, GaTech, GA 2019–2021 Salman Ahmed, Virginia Tech, VA 2018–2021 Tapti Palit, Stony Brook University, NY 2019–2021 Calvin Deutschbein, University of North Carolina, Chapel Hill 2016–2018 Adrian Tang, Columbia University, NY 2014–2017 Chaz Lever, GaTech, GA 2016–2018 Louis Soleyn, University of the West Indies, Barbados 2016–2017 Tracy John, University of the West Indies, Barbados",
  "content_length": 5413,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:34"
}