{
  "name": "Fabio Palomba",
  "homepage": "https://fpalomba.github.io",
  "status": "success",
  "content": "FABIO PALOMBA | Associate Professor FABIO PALOMBAAssociate Professor Fabio PALOMBA fpalomba [at] unisa [dot] it University of Salerno ITALY NEWS: Alessandra Parziale has joined the Gran Sasso Science Institute, and Alfonso Cannavale has joined the SeSa Lab as new Ph.D. students. Congratulations to both: this is a significant milestone in their research journeys! Having been their Master's advisor, I am truly proud to see them take this next step, and I hope to remain part of their journey. I look forward to seeing their research flourish and to celebrating many more of their successes ahead! .01 ABOUT PERSONAL DETAILS Via Giovanni Paolo II, 132, 84084 Fisciano Bio Facts Hobbies BIO ABOUT ME Fabio Palomba is an Associate Professor at the Software Engineering (SeSa) Lab (within the Department of Computer Science) of the University of Salerno. He received the European PhD degree in Management & Information Technology in 2017. His PhD Thesis was the recipient of the 2017 IEEE Computer Society Best PhD Thesis Award. His research interests include software maintenance and evolution, empirical software engineering, source code quality, and mining software repositories. He was the recipient of two ACM/SIGSOFT and one IEEE/TCSE Distinguished Paper Awards at the IEEE/ACM International Conference on Automated Software Engineering (ASE'13), the International Conference on Software Engineering (ICSE'15), and the IEEE International Conference on Software Maintenance and Evolution (ICSME'17), respectively, and Best Paper Awards at the ACM Computer Supported Cooperative Work (CSCW'18) and the IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER'18). In 2019 he was the recipient of an SNSF Ambizione grant, one of the most prestigious individual research grants in Europe, while in 2023 he has awarded with the prestigious IEEE Computer Society Technical Council of Software Engineering Rising Star Award, an early research career recognition assigned for the outstanding contribution to the field of code refactoring and code smells. He serves and has served as a program committee member of various international conferences (e.g., IEEE/ACM International Conference on Software Engineering, IEEE International Conference on Program Comprehension, IEEE International Conference on Software Maintenance and Evolution), and as referee for various international journals (e.g., IEEE Transactions on Software Engineering, Springer's Empirical Software Engineering Journal, Elsevier's Journal of Systems and Software) in the field of software engineering. He is a member of the Steering Committee of ICPC (elected in 2021). He has been program co-chair of SANER 2024 and ICPC 2021, industrial track co-chair of SANER 2022, NIER/ERA track co-chair of ASE 2022, SCAM 2022, and MobileSoft 2022, FOSS Award co-chair of MSR 2022, other than program co-chair of MaLTeSQuE 2018 and 2019. In addition, he has been a member of the organizing committee of ICPC 2015 and SANER 2018. Since 2022, he is Editorial Board Member of the Elsevier's Information and Software Technology Journal (IST). Since 2021, he is Editorial Board Member of the Springer's Empirical Software Engineering Journal (EMSE), where he already was Review Board Member since 2016, and the e-Informatica Software Engineering Journal (EISEJ). Since 2020 he is Review Board Member of the IEEE Transactions on Software Engineering. From 2019 to 2022, he has been Editorial Board Member of ACM Transactions on Software Engineering and Methodology (TOSEM). Since 2019, he is an Editorial Board Member of Elsevier's Journal of Systems and Software (JSS), and Elsevier's Science of Computer Programming (SCICO). For his reviewing activities, he was the recipient of 16 Distinguished/Outstanding Reviewer Awards. FACTS SOME NUMBERS ABOUT ME 920 CUPS OF COFFEE PER YEAR 100+ REVIEWS PER YEAR 2,965 HOURS OF MEETINGS 80+ JOURNAL PAPERS 100+ CONFERENCE PAPERS 300+ THESES (CO-)ADVISED HOBBIES ... AND OTHER FACTS ABOUT ME First and foremost, I am a social drinker. Wine, beer, spirits, everything is fine. But, if I can choose, please give me some Campari Spritz - preferably, without sparkly water, just Campari and sparkly wine. All TV series, especially those telling of political conspiracies (e.g., House of Cards) and supernatural powers (e.g., Fringe), i.e., yes, I like dramas. A long time ago [... in a galaxy far far away], I used to be a (kind of) professional soccer player. Unfortunately, then I started my Ph.D. and I had to decide which career I should have pursued; Now, whenever possible, I still like to play with friends and collagues. Since I cannot play soccer so often, I found a less attractive but still useful e-alternative called PlayStation - Fifa is basically the only game I play with. I am not as good and creative as I am in reality, but still... .02 CAREER ACADEMIC AND PROFESSIONAL POSITIONS now 2025 ASSOCIATE PROFESSOR Salerno UNIVERSITY OF SALERNO Software Engineering (SESA) Lab. 2025 2020 ASSISTANT PROFESSOR Salerno UNIVERSITY OF SALERNO Software Engineering (SESA) Lab. 2019 2018 SENIOR RESEARCH ASSOCIATE Zurich UNIVERSITY OF ZURICH - Switzerland Zurich Empirical Software Engineering Team. 2017 POST-DOC RESEARCHER Delft DELFT UNIVERSITY OF TECHNOLOGY - Netherlands EINDHOVEN UNIVERSITY OF TECHNOLOGY - Netherlands EDUCATION 2017 2014 DEGREE OF EUROPEAN DOCTOR OF PHILOSOPHY (PH.D.) IN MANAGEMENT AND INFORMATION TECHNOLOGY Salerno UNIVERSITY OF SALERNO Funded by University of Salerno and University of Molise. Advisor: Prof. Andrea De Lucia 2013 2011 MASTER’S DEGREE (M.SC.) IN COMPUTER SCIENCE Salerno UNIVERSITY OF SALERNO 110/110 magna cum laude and special commendation by the commission. Advisor: Prof. Andrea De Lucia 2011 2008 BACHELOR’S DEGREE (B.SC.) IN COMPUTER SCIENCE Isernia UNIVERSITY OF MOLISE 110/110 cum laude. Advisor: Prof. Rocco Oliveto QUALIFICATIONS AND LICENCES 2020 ITALIAN SCIENTIFIC QUALIFICATION AS FULL PROFESSOR SECTOR 01/B1 – INFORMATICA Evaluation available at ASN Site. 2019 ITALIAN SCIENTIFIC QUALIFICATION AS FULL PROFESSOR SECTOR 09/H1 – SISTEMI DI ELABORAZIONE DELLE INFORMAZIONI Evaluation available at ASN Site. 2019 ITALIAN SCIENTIFIC QUALIFICATION AS ASSOCIATE PROFESSOR SECTOR 01/B1 – INFORMATICA Evaluation available at ASN Site. 2019 ITALIAN SCIENTIFIC QUALIFICATION AS ASSOCIATE PROFESSOR SECTOR 09/H1 – SISTEMI DI ELABORAZIONE DELLE INFORMAZIONI Evaluation available at ASN Site. 2014 LICENCE OF COMPUTER ENGINEER Campobasso UNIVERSITY OF MOLISE .03 PUBLICATIONS PUBLICATIONS LIST ALL ALL RECOMMENDED JOURNAL PAPERS CONFERENCES WORKSHOPS THESIS BOOK CHAPTERS TAGS ALL TAGS SOFTWARE QUALITY SOFTWARE TESTING SOCIO-TECHNICAL ANALYTICS MOBILE APPS EVOLUTION EMPIRICAL SOFTWARE ENGINEERING TOOL DEMONSTRATIONS DATASETS SYSTEMATIC LITERATURE REVIEW COMPUTER-HUMAN INTERACTION SORTING BY DATE [J90] TOSEM 2025 Sustainability of Machine Learning-Enabled Systems: The Machine Learning Practitioner's Perspective.* ACM Transactions on Software Engineering and Methodology (TOSEM) Software sustainability is a key multifaceted non-functional requirement that encompasses environmental, social, and economic concerns, yet its integration into the development of Machine Learning (ML)-enabled systems remains an open challenge. While previous research has explored high-level sustainability principles and policy recommendations, limited empirical evidence exists on how sustainability is practically managed in ML workflows. Existing studies predominantly focus on environmental sustainability, e.g., carbon footprint reduction, while missing the broader spectrum of sustainability dimensions and the challenges practitioners face in real-world settings. To address this gap, we conduct an empirical study to characterize sustainability in ML-enabled systems from a practitioner’s perspective. Download PDF Journal Empirical Software Engineering Socio-Technical Analytics V. De Martino, S. Lambiase, F. Pecorelli, W.J. van den Heuvel, F. Ferrucci, F. Palomba. Sustainability of Machine Learning-Enabled Systems: The Machine Learning Practitioner's Perspective.* V. De Martino, S. Lambiase, F. Pecorelli, W.J. van den Heuvel, F. Ferrucci, F. Palomba. Journal Empirical Software Engineering Socio-Technical Analytics Abstract. Software sustainability is a key multifaceted non-functional requirement that encompasses environmental, social, and economic concerns, yet its integration into the development of Machine Learning (ML)-enabled systems remains an open challenge. While previous research has explored high-level sustainability principles and policy recommendations, limited empirical evidence exists on how sustainability is practically managed in ML workflows. Existing studies predominantly focus on environmental sustainability, e.g., carbon footprint reduction, while missing the broader spectrum of sustainability dimensions and the challenges practitioners face in real-world settings. To address this gap, we conduct an empirical study to characterize sustainability in ML-enabled systems from a practitioner’s perspective. We investigate (1) how ML engineers perceive and describe sustainability, (2) the software engineering practices they adopt to support it, and (3) the key challenges hindering its adoption. We first perform a qualitative analysis based on interviews with eight experienced ML engineers, followed by a large-scale quantitative survey with 203 ML practitioners. Our key findings reveal a significant disconnection between sustainability awareness and its systematic implementation, highlighting the need for more structured guidelines, measurement frameworks, and regulatory support. Download PDF [J89] JSEP 2025 A Novel, Tool-Supported Catalog of Community Smell Symptoms.* Wiley's Journal of Software: Evolution and Process (JSEP) Software development is a multifaceted endeavor, requiring a profound grasp of both social dynamics and technical intricacies. Poor collaboration often leads to the",
  "content_length": 564666,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:43"
}