{
  "name": "Fabian J. Theis",
  "homepage": "https://www.professoren.tum.de/en/theis-fabian",
  "status": "success",
  "content": "Theis_Fabian Prof. Dr. Dr. Fabian J. Theis Professorship Mathematical Modelling of Biological Systems School TUM School of Computation, Information and Technology Contact Details Business card at TUMonline Academic Career and Research Areas Fabian Theis (b. 1976) conducts research in the field of computational biology. The main focus of his work is the application of machine learning methods to biological questions, in particular as a means of modeling cell heterogeneities on the basis of single cell analyses and also of integrating “omics” data into systems medicine approaches. Professor Theis received PhD degrees in physics and computer science in 2002 and 2003 respectively. After working as a postdoc in Regensburg, Tokyo and Tallahassee, he took up a position as Bernstein Fellow at the Max Planck Institute for Dynamics and Self-Organization in Göttingen. He then joined the German Research Center for Environmental Health, Helmholtz Zentrum München, where he was a group leader at the Institute for Bioinformatics and Systems Biology for six years. In 2009 he was became an Associate Professor at the Chair of Applied Mathematics, TUM. Since 2013 he has been a Full Professor of biomathematics at TUM, where he holds the Chair of Mathematical Modeling of Biological Systems, and director of the Institute of Computational Biology at the Helmholtz Zentrum München. Awards Gottfried Wilhelm Leibniz Prize (2023)Hamburger Wissenschaftspreis (2021)Erwin Schrödinger Prize (2017)ERC-Starting Grant (2010) and ERC Advanced Grant (2022)Heinz Maier-Leibnitz Prize, German Research Foundation (DFG) (2006) Key PublicationsKlein, D., Palla, G., Lange, M., Klein, M., Piran, Z., Gander, M., Meng-Papaxanthos, L.,  Sterr, M., Saber, L., Jing, C., Bastidas-Ponce, A., Cota, P., Tarquis-Medina, M., Parikh, S., Gold, I., Lickert°, H., Bakhti, M., Nitzan, M., Cuturi, M., Theis°, F.J. “Mapping cells through time and space with moscot”. Nature. 2025; 638, 1065–1075.° joint corresponding authorsAbstractSikkema, L., Ramírez-Suástegui, C., Strobl, D.C., Gillett, T.E., Zappia, L., Madissoon, E., Markov, N.S., Zaragosi, L.-E., Ji, Y., Ansari, M., Arguel, M.-J., Apperloo, L., Banchero, M., Bécavin, C., Berg, M., Chichelnitskiy, E., Chung, M-i., Collin, A., CA Gay, A., Gote-Schniering, J., Kashani, B.H., Inecik, K., Jain, M., Kapellos, T.S., Kole, T.M., Leroy, S., Mayr, C.H., Oliver, A.J., von Papen, M., Peter, L., Taylor, C.J., Walzthoeni, T., Xu, C., Bui, L.T., De Donno, C., Dony, L., Faiz, A.,  Guo, M., Gutierrez, A.J., Heumos, L., Huang, N., Ibarra, I.L., Jackson, N.D., Murthy, P.K.L., Lotfollahi, M., Tabib, T., Talavera-López, C., Travaglini, K.J., Wilbrey-Clark, A., Worlock, K.B., Yoshida, M., Lung Biological Network Consortium, van den Berge, M., Bossé, Y., Desai, T.J., Eickelberg, O., Kaminski, N., Krasnow, M.A., Lafyatis, R., Nikolic, M.Z., Powell, J.E., Rajagopal, J., Rojas, M., Rozenblatt-Rosen, O., Seibold, M.A., Sheppard, D., Shepherd, D.P., Sin, D.D., Timens, W., Tsankov, A.M., Whitsett, J., Xu, Y., Banovich, N.E., Barbry, P., Duong, T.E., Falk, C.S., Meyer, K.B., Kropski, J.A., Pe’er, D., Schiller, H.B., Tata, P.R., Schultze, J.L., Teichmann, S.A., Misharin, A.V., Nawijn, M.C., Luecken, M.D.°, Theis, F.J.° “An integrated cell atlas of the lung in health and disease”. Nature Medicine. 2023; 29(6), 1563–1577.° joint corresponding authorsAbstractLange, M., Bergen, V., Klein, M., Setty, M., Reuter, B., Bakhti, M, Lickert, H. Ansari, M. Schniering, J. Schuller, H.B., Pe´er D.°, Theis F.J.° “CellRank for directed single-cell fate mapping”. Nature Methods. 2022; 19, 159–170.° joint corresponding authorsAbstractBergen, V., Lange, M., Peidli, S., Wolf, F. A.°, & Theis, F. J.° “Generalizing RNA velocity to transient cell states through dynamical modeling”. Nature Biotechnology. 2020; 38(12), 1408-1414.° joint corresponding authorsAbstractLotfollahi, M., Wolf, F.A.°, Theis, F.J.° “scGen predicts single-cell perturbation responses.” Nature Methods. 2019; 16, 715-721.° joint corresponding authorsAbstract If you wish your profile to be changed or updated please contact Franz Langer. Attention: JavaScript deactivated Please activate JavaScript to be able to use all website functions such as site search!",
  "content_length": 4241,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:34"
}