{
  "name": "Fabrício Benevenuto de Souza",
  "homepage": "http://homepages.dcc.ufmg.br/~fabricio",
  "status": "success",
  "content": "Fabrício Benevenuto, Associate Professor, UFMG Fabrício Benevenuto Associate Professor (Professor Adjunto) Computer Science Department Federal University of Minas Gerais Room 7317  DCC - ICEx +55 31 3409-7598 fabricio (at) dcc (dot) ufmg (dot) br Bio I am associate professor in the Computer Science Department of Federal University at Minas Gerais (UFMG). I received a Ph.D. in Computer Science from UFMG, in 2010, and my thesis received the CAPES award as the best Brazilian thesis in computer science for that year. During my Ph.D., I held research intern positions at HP Labs (USA) and MPI-SWS (Max Planck Institute for Software Systems). Then, I worked for two years as assistant professor on Federal University of Ouro Preto (UFOP). I was elected an affiliated member of the Brazilian Academy of Science from 2013 to 2017 and, more recently, I received a prestigious scholarship from Humboldt foundation through which I was visiting faculty at MPI-SWS (2017-2018).  I am currently a member of the TikTok Safety Advisory Council. I am actively working on projects related to social media, including social computing, sentiment analysis, and computational journalism. My projects are usually interdisciplinary and involve areas from computer science related to data science, including complex networks, data mining, machine learning and natural language processing. Currently, I am leading a large project against Fake News. My work on these topics has led to a number of important publications, widely cited papers and systems with societal impact. I am keen to accept PhD., MSc. and undergrad students to work in topics that align with my research interests. Feel free to contact me about this to discuss possible topics of mutual interests. Students I'm delighted to be advisor of many talented students from UFMG: Marcio Silva (PhD.) Samuel Guimarães (PhD.) Daniel Kansaon (PhD.) Francielle Vargas (PhD from USP, coadvisor) Bruno Hott (Phd., coadvisor) João Marcos Couto (Msc.) Isadora Salles (Msc.) Isadora Cristina (Msc.) Beatriz Souza (Msc.) Breno Matos (Msc. coadvisor) Vitor Mafra (Msc.) Jonatas Henrique (Msc.) Some Former Students (with their first employment): Philipe Melo (PhD.) joined Federal University of Viçosa as assistant professor. Júlio César Reis (PhD.) joined Federal University of Viçosa as assistant professor. Filipe Ribeiro (PhD.) joined Federal University of Ouro Preto (UFOP) as assistant professor. Matheus Araújo (Msc.) joined the University of Minnesota as PhD. student. Johnnatan Messias (Msc.) joined Max Planck Institute as PhD. Student. Carolina Coimbra (Msc.) joined Max Planck Institute as PhD. Student. Helen Costa (did Msc.) joined Federal University of Ouro Preto (UFOP) as assistant professor. Theo Lins (did Msc.) joined Federal University of Ouro Preto (UFOP) as assistant professor. Carlos Freitas (did Msc.) joined Google Brazil (Belo Horizonte). Leandro Araújo (did Msc.) joined Kunumi, a cognitive computing startup (Belo Horizonte). Manoel Júnior (Msc.) joined Take Blip (Belo Horizonte). Lucas Henrique Lima (Msc.) joined CEFET as substitute professor. Pollyanna Gonçalves (did Msc.) joined Aditi (Belo Horizonte). Bruno Leite Alves (did Msc.) joined ThoughtWorks (Belo Horizonte). Antônio Leite (Msc.) joined SERPRO (Belo Horizonte). Opinion Articles ·      Fake news e a crônica do caixa 2 anunciado. In Folha de São Paulo on April 2018. · Fake News Is Poisoning Brazilian Politics. WhatsApp Can Stop It. In New York Times on November 2018. Systems and Applications Some of our papers are about novel systems. Eleições sem Fake: Many systems to provide transparency along the Brazilian elections and counter misinformation. Media Bias Monitor: We designed a system to quantify the political leaning of thousands of news outlets. Check our ICWSM18 paper for details. Purple Feed: Identifying High Consensus News Posts on Social Media. ScienceTree. Check your Academic Genealogical Tree. Who Makes Trends: Allow users to check demographics behind hashtags in Twitter. Ifeel: A sentiment analysis tool. You can label your dataset with the most important sentiment analysis methods. Cognos: Find experts in topics in Twitter. Who is who in Twitter. Word Cloud describing how users are listed in Twitter. Conference Publications Anatomy of Hate Speech Datasets: Composition Analysis and Cross-dataset Classification. Samuel Guimarães, Gabriel Kakizaki, Philipe Melo, Márcio Silva, Fabricio Murai, Julio CS Reis, Fabrício Benevenuto. In Proceedings of the 34th ACM Conference on Hypertext and Social Media. Roma, Itália. 2023. [PDF] Predicting Sentence-Level Factuality of News and Bias of Media Outlets Francielle Vargas, Kokil Jaidka, Thiago A. S. Pardo, Fabrício Benevenuto. In Proceedings of the Recent Advances in Natural Language Processing (RANLP). Varna, Bulgaria. September, 2023. [PDF] Socially Responsible Hate Speech Detection: Can Classifiers Reflect Social Stereotypes? Francielle Vargas, Isabelle Carvalho, Ali Hurriyetoglu, Thiago A. S. Pardo, Fabrício Benevenuto In Proceedings of the Recent Advances in Natural Language Processing (RANLP). Varna, Bulgaria. September, 2023. [PDF] NoHateBrazil: A Brazilian Portuguese Text Offensiveness Analysis System. Francielle Vargas, Isabelle Carvalho, Wolfgang S. Schmeisser-Nieto, Fabrício Benevenuto, Thiago A. S. Pardo. In Proceedings of the Recent Advances in Natural Language Processing (RANLP). Varna, Bulgaria. September, 2023. [PDF] YouNICon: YouTubes CommuNIty of Conspiracy Videos. Shao Yi Liaw, Fan Huang, Fabricio Benevenuto, Haewoon Kwak, Jisun An. In Proceedings of the Int'l AAAI Conference on Weblogs and Social Media (ICWSM23). Limassol, Cyprus. June, 2023. [PDF] [BibTeX] [Dataset] Characterizing Low Credibility Websites in Brazil through Computer Networking Attributes. Joao M. M. Couto, Julio C. S. Reis, Italo Cunha, Leandro Araujo, and Fabricio Benevenuto. In Proc. of IEEE/ACM Intl. Conf. on Advances in Social Networks Analysis and Mining (ASONAM). 2022. [PDF] [BibTeX] Telegram Monitor: Monitoring Brazilian Political Groups and Channels on Telegram. Shao Yi Liaw, Fan Huang, Fabricio Benevenuto, Haewoon Kwak, and Jisun An. In Proceedings of the 33rd ACM Conference on Hypertext and Social Media (HT22). Barcelona, Spain. June, 2022. [PDF] [BibTeX] Characterizing Sponsored Content in Facebook and Instagram. Emanuelle Martins, Isadora Salles, Fabrício Benevenuto and Olga Goussevskaia. In Proceedings of the 33rd ACM Conference on Hypertext and Social Media (HT22). Barcelona, Spain. June, 2022. [HTML] [BibTeX] Understanding Effects of Moderation and Migration on online Video Sharing Platforms. Gabriel Luís Santos Freire, Tales Panoutsos, Lucas Perez Santos, Fabricio Benevenuto and Flavio Figueiredo. In Proceedings of the 33rd ACM Conference on Hypertext and Social Media (HT22). Barcelona, Spain. June, 2022. [PDF] [BibTeX] EarlyAd: A System for Real-Time Surveillance of Brazilian Early Electoral Ads on Twitter. Marcelo M. R. Araújo, Samuel Guimarães, Marcio Silva, Josemar Caetano, Jonatas Santos, Julio C. S. Reis, Ana P. C. Silva, Fabrício Benevenuto and Jussara M. Almeida. In Proceedings of the 33rd ACM Conference on Hypertext and Social Media (HT22). Barcelona, Spain. June, 2022. [PDF] [BibTeX] Can Online Attention Signals Help Fact-Checkers to Fact-Check? Manoel Horta Ribeiro, Savvas Zannettou, Oana Goga, Fabrício Benevenuto, and Robert West. In Proceedings of the 3rd MEDIATE Workshop as part of ICWSM22. Atlanta, USA. June, 2022. [PDF] [BibTeX] HateBR: Large Expert Annotated Corpus of Brazilian Instagram Comments for Abusive Language Detection. Francielle A. Vargas, Isabelle Carvalho, Fabiana Rodrigues de Góes, Thiago A. S. Pardo, and Fabrício Benevenuto. In Proceedings of the 13th International Conference on Language Resources and Evaluation (LREC). Marseille, France. June, 2022. [PDF] [BibTeX] [Dataset] Rhetorical Structure Approach for Online Deception Detection: A Survey. Francielle Vargas, Jonas DAlessandro, Zohar Rabinovich, Fabrício Benevenuto, Thiago A. S. Pardo. In Proceedings of the 13th International Conference on Language Resources and Evaluation (LREC). Marseille, France. June, 2022. [PDF] [BibTeX] Contextual-Lexicon Approach for Abusive Language Detection. Francielle Vargas, Fabiana Goes, Isabelle Carvalho, Fabrício Benevenuto, Thiago A. S. Pardo. In Proceedings of the Recent Advances in Natural Language Processing (RANLP). Virtual Event. September, 2021. [PDF] [BibTeX] Toward Discourse-Aware Models for Multilingual Fake News Detection. Francielle Vargas, Fabrício Benevenuto, Thiago A. S. Pardo. In Proceedings of the Recent Advances in Natural Language Processing (RANLP)- Student Workshop. Virtual Event. September, 2021. [PDF] [BibTeX] Characterizing (Un)moderated Textual Data in Social Systems. Lucas Lima, Julio C. S. Reis, Fabrício Murai, and Fabricio Benevenuto. In Proceedings of the IEEE/ACM Intl Conference on Social Networks Analysis and Mining (ASONAM 2020). Virtual Event. November, 2020. [PDF] [BibTeX] [Data] Identifying and Characterizing Alternative News Media on Facebook. Samuel S. Guimaraes, Julio C. S. Reis, Lucas Lima, Filipe N. Ribeiro, Marisa Vasconcelos, Jisun An, Haewoon Kwak, and Fabricio Benevenuto. In Proceedings of the IEEE/ACM Intl Conference on Social Networks Analysis and Mining (ASONAM 2020). Virtual Event. November, 2020. [PDF] [BibTeX] Demystifying the Messaging Platforms' Ecosystem Through the Lens of Twitter. Mohamad Hoseini, Philipe Melo, Manoel Júnior, Fabrício Benevenuto, Balakrishnan Chandrasekaran, Anja Feldmann, and Savvas Zannettou. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC 2020). Virtual Event. October, 2020. [PDF] [BibTeX] Understanding Targeted Video-Ads in Children's Content. Flavio Figueiredo, Felipe Giori, Guilherme Soares, Mariana Arantes, Jussara M. Almeida, Fabrício Benevenuto. In Proceedings of the ACM Conference on Hypertext and Social Media (HT20). Virtual Event. July, 2020. [PDF] [BibTeX] A",
  "content_length": 67114,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:53"
}