{
  "name": "Fabrizio Granelli",
  "homepage": "https://www.granelli-lab.org/staff/fabrizio-granelli",
  "status": "success",
  "content": "Fabrizio Granelli | Granelli's Laboratory Fabrizio Granelli Full Prof., Lab Coordinator Home Staff Fabrizio Granelli Fabrizio Granelli is Full Professor at the Dept. of Information Engineering and Computer Science (DISI) of the University of Trento (Italy) and IEEE ComSoc Distinguished Lecturer (2021-2023). From 2012 to 2014, he was Italian Master School Coordinator in the framework of the European Institute of Innovation and Technology ICT Labs Consortium. He was ComSoc Director of Online Content (2016-17) and ComSoc Director of Educational Services (2018-19). He is ComSoc Director for Conference Development (2022-23) and Programme Lead of EIT Digital Master School Cloud and Networking Infrastructures programme (2023+). Prof. Granelli was the Dean of Education of the DISI Department for the period 2015-2017, and coordinator of the research and didactical activities on computer networks within the degree in Telecommunications Engineering. He was advisor of more than 100 B.Sc. and M.Sc. theses and 12 Ph.D. theses. He was IEEE ComSoc Distinguished Lecturer for 2012-15 and Visiting Professor at the State University of Campinas (SP, Brazil) and at The University of Tokyo (Japan).He is ranked #170 among Italian researchers in Electronics and Electrical Engineering (#4440 worldwide).He is author or co-author of more than 250 papers published in international journals, books and conferences in networking, with particular reference to performance modeling, cross-layering, wireless networks, cognitive radios and networks, green networking and smart grid communications.From January 2017 to December 2022, Prof. Granelli was Associate Editor-in-Chief of the IEEE Communications Surveys and Tutorials journal (IF=22 - the HIGHEST among all computer science and telecommunications publications!).Prof. Granelli is Senior Editor of the IEEE Transactions on Green Communications and Networks.Prof. Granelli was Chair of the IEEE Communications Society Technical Committee on Transmission, Access and Optical Systems (TAOS TC), and of the IEEE ComSoc Technical Committee on Communication Systems Integration and Modeling (CSIM TC). He is currently Founded and Chair of the Aerial Communications Emerging Technology Initiative of ComSoc.Publications List (H-index=37 on Google Scholar, 29 on Scopus profile)ORCID Page",
  "content_length": 2327,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:17"
}