{
  "name": "Fabrice Muhlenbach",
  "homepage": "http://perso.univ-st-etienne.fr/muhlfabr",
  "status": "success",
  "content": "Fabrice MUHLENBACH Fabrice MUHLENBACH Maître de Conférences en Informatique Laboratoire Hubert Curien, UMR CNRS 5516 Université Jean Monnet de Saint-Étienne 18 rue du Professeur Benoît Lauras 42000 SAINT-ÉTIENNE FRANCE Tél. : (+33/0) 4 77 91 58 11 Fax : (+33/0) 4 77 91 57 81 Courriel : fabrice.muhlenbach@univ-st-etienne.fr Sommaire Page in English Biographie Enseignements Recherches Publications Responsabilités administratives Animations scientifiques Divers Biographie Situation actuelle : Maître de Conférences en Informatique à lUniversité Jean Monnet de Saint-Étienne depuis septembre 2003, je poursuis ma recherche au sein du laboratoire Hubert Curien, UMR CNRS 5516. Je suis membre de léquipe Connected Intelligence du laboratoire Hubert Curien. Depuis le 1er janvier 2015, avec Pierre MARET, nous encadrons la thèse de doctorat de Pierre-René LHÉRISSON dans le domaine des systèmes de recommandation. De plus, depuis le 1er octobre 2015, avec Djamel A. ZIGHED, nous encadrons la thèse de doctorat dHussein AL-NATSHEH dans les domaines de la fouille de données, de la fouille de textes, des ontologies, des humanités numériques et de linfonomie. Mon activité de recherche se situe dans le domaine général de lintelligence artificielle et concerne lamélioration de processus de recommandation issue de systèmes intelligents. Je travaille aussi dans la thématique de léthique de lintelligence artificielle. Cursus Universitaire : Ma formation pluridisciplinaire sinscrit dans la recherche dun enseignement ayant lesprit des sciences cognitives, avec un accent fortement porté sur linformatique, et plus particulièrement lintelligence artificielle, ainsi que sur la psychologie cognitive. Mes diplômes universitaires témoignent dun parcours peu classique : 1990 : Baccalauréat C, Académie de Strasbourg, Bas-Rhin, France. 1992 : D.U.T. dInformatique à lI.U.T. de Strasbourg-Sud, Bas-Rhin, France. 1994 et 1995 : DEUG et Licence de Psychologie à lUniversité Louis Pasteur de Strasbourg, Bas-Rhin, France. 1996 et 1997 : Licence et Maîtrise de Sciences Cognitives à Lyon, Rhône, France (Lyon2, Lyon1 et lENS de Lyon). 1999 : DEA de Sciences Cognitives à Paris, France (Paris 6, EHESS, Polytechnique, Toulouse 3). 2002 : Doctorat en informatique de lUniversité Lumière (Lyon 2) Enseignements Depuis 2003, jenseigne, ou jai enseigné, les matières suivantes : Master informatique, parcours Données et Systèmes Connectés (DSC) : 1ère année : Analyse et Traitement des données (Cours, Travaux Dirigés et Travaux Pratiques sous R). Master international Cyber-Physical Social Systems (CPS2) : 1ère année : Data Analysis (Travaux Pratiques sous R). 1ère année : Computer Ethics (module Research and Innovation). Master franco-espagnol Machine Learning and Data Mining (MLDM) : 2ème année : Data Mining (Travaux Pratiques sous R). 1ère année : Data Mining (Travaux Dirigés et Travaux Pratiques sous R). 1ère année : Data Analysis (Travaux Pratiques sous R). Master Color in Informatics and MEdia Technology (CIMET) et Master franco-norvégien 3D Multimedia Technology (3DMT) : 1ère année : Data Analysis and Statistics. 1ère année : Data Analysis (Travaux Pratiques sous R). Master dInformatique (web intelligence) : 2e année : Recherche et innovation (anciennement Méthodologie de la recherche) : Éthique de la recherche en informatique. 2e année : Fouille de données (Travaux Pratiques sous R). 1ère année : Fouille de données (Travaux Pratiques sous R). 1ère année : Apprentissage automatique (Réseaux de Neurones Artificiels). 1ère année : Génie logiciel, langage de modélisation unifié UML. 1ère année : Interface Homme-machine (IHM). Licences en Sciences (Informatique, Mathématique, Sciences de la Vie, Sciences de la Terre, Sciences de l'Ingénieur...) : 2e et 3e années : Crédit Libre « Intelligence Artificielle ». Licence dInformatique : 3e année : Intelligence Artificielle et Sciences Cognitives. 2e année : Introduction à lIntelligence Artificielle (TP). 2e année : Systèmes dInformation (Bases de Données Avancées). Licence Professionnelle ATII : Outils de développement de sites web dynamiques (PHP, MySQL, Javascript, AJAX). Langages du web (XML, flux RSS, web 2.0). Mise à niveau en Algorithmique. Mise à niveau tutorée en Programmation. Algorithmique avancée. Introduction à lHTML. Veille technologique. Licence Biologie, Géologie, Chimie : 1ère année : Outils numériques pour les sciences expérimentales (éléments de base sur linformatique et Internet, traitement de texte, tableur, et traitement des données avec R). Auparavant, dans une autre université (Université Lumière, Lyon 2), jai eu loccasion denseigner les matières suivantes : DESS OPSIE (organisation et protection des systèmes dinformation dans lentreprise) : Introduction à lintelligence artificielle. Maîtrise de Sciences Cognitives : Apprentissage numérique et symbolique. Connexionnisme. Licence de Sciences Cognitives : Outils de modélisation - Analyse de données multidimensionnelles. Connexionnisme. DEUG 2ème Année de Sciences Economiques et de Gestion : Informatique (Algorithmie - Programmation en Visual Basic). DEUG 1ère Année de Sciences Economiques et de Gestion : Nouvelles technologies éducatives (NTE). Recherches Thèmes de recherche : Mon activité de recherche se situe dans le domaine général de l'intelligence artificielle et concerne l'amélioration de processus de recommandation issue de systèmes intelligents. Ce questionnement, qui découle de ma formation universitaire en psychologie et sciences cognitives autant qu'en informatique, trouve ces dernières années une issue originale dans la manière de produire des recommandations dans des domaines variés mettant en avant des aspects liés à l'éthique et à la possibilité d'échapper aux « bulles de filtres » (cf. Eli Pariser, The Bubble Filter: What the Internet is Hiding from You, New York: Penguin Press, 2011) que l'on rencontre dans les systèmes de recommandation en raison de certains effets délétères liés à la personnalisation et l'hyper-spécialisation. Spécialiste de l'extraction des connaissances à partir des données, j'ai délaissé les aspects les plus théoriques de ce domaine pour m'intéresser davantage aux applications faisant sens pour les utilisateurs de ces méthodes. Ces travaux ont suivi différentes voies ramenant aux préoccupations fondamentales sur le domaine de l'étude de la nature de l'esprit et sa voie d'investigation par des procédés d'intelligence artificielle. À la question existentielle « qu'est-ce qui fait sens pour l'esprit humain&nsbp;? », je tente d'apporter des contributions qui se manifestent de façon schématique au travers des deux co-encadrements de thèse que je mène à l'heure actuelle : « Qu'est-ce qui représente un intérêt pour une personne lorsqu'elle cherche à étendre son univers culturel ? ». Il s'agit ici des travaux que je mène avec Pierre-René Lhérisson et Pierre Maret. Les systèmes de recommandation classiques fournissent des résultats qui sont issus d'association de similarité maximale entre des items. Dans notre approche, nous faisons l'hypothèse qu'une personne, lorsqu'elle est saturée par la « consommation » d'items culturels semblables (par exemple des écoutes de musique du même genre musical), développe une appétence pour d'autres formes, considérées  »complémentaires » Nos travaux en cours, menés avec une entreprise fournissant des services de streaming spécialisés dans les labels indépendants (1D Lab), ont débouché sur le dépôt d'un brevet industriel et la production de résultats d'expériences réalisées auprès d'utilisateurs humains montrant la pertinence de cette hypothèse. Ajoutons que notre approche a trouvé un auditoire particulièrement intéressé au sein de la communauté des spécialistes de fouille de données mettant en avant les aspects applicatifs, puisque nos travaux ont été gratifiés du premier prix de la conférence ADMA 2017. « Est-ce que des connaissances provenant de thématiques scientifiques différentes de mon domaine d'expertise peuvent faire sens pour moi et m'être utiles ? ». Il s'agit ici des travaux que je mène avec Hussein Al-Natsheh et Djamel A. Zighed, ainsi que Lucie Martinet, alors post-doctorante recrutée à la suite d'un financement du projet ISTEX. Nous nous intéressons ici aux similarités entre textes, notamment issus de différentes disciplines scientifiques, en essayant de voir les apports complémentaires entre les approches sémantiques et les approches statistiques. Des travaux réalisés sur la similarité entre textes (participation à la compétition SemEval en 2017, nous nous sommes orientés vers la possibilité de recommander des articles scientifiques (en utilisant la base du projet ISTEX) en allant au-delà des barrières disciplinaires et linguistiques liées à l'hyper-spécialisation rencontrée dans le domaine de la recherche. Mots clés : Intelligence artificielle, Fouille de données, Fouille de texte, Système de recommandation, Éthique. Publications Les publications ci-dessous sont rangées selon lordre chronologique inverse (pour une catégorie donnée). Brevet : MUHLENBACH, F., LHÉRISSON, P.-R., MARET, P., \"Procédé de sélection automatique d'un contenu multimédia dans une base de données\". Brevet d'invention FR3046269, INPI, Juin 2017. Chapitres de livre / articles dencyclopédie : MUHLENBACH F., LARGERON C., STAN J., \"Recommender Systems Using Social Network Analysis: Challenges and Future Trends\", in R. Alhajj and J. Rokne, editors, Encyclopedia of Social Network Analysis and Mining, 2nd Edition, Springer, 2017. STAN J., MUHLENBACH F., LARGERON C., \"Recommender Systems Using Social Network Analysis: Challenges and Future Trends\", in R. Alhajj and J. Rokne, editors, Encyclopedia of Social Network Analysis and Mining, Springer, pp. 1522-1532, 2014. MUHLENBACH F., RAKOTOMALALA R., \"Discretization of Continuous Attributes\", in J. Wang, editor, Encyclopedia of Data Warehousing and Mining, Idea Group Reference, pp. 397-402, 2005. (HAL). Revues daudience internatio",
  "content_length": 25610,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:49"
}