{
  "name": "Fadel Adib",
  "homepage": "http://www.mit.edu/~fadel",
  "status": "success",
  "content": "Fadel Adib Fadel Adib Home Publications Videos Awards Contact Associate Professor, MIT Co-Founder, Cartesian Systems (startup) Founding Director, Signal Kinetics Research Group MIT Media Lab & Electrical Engineering and Computer Science BRIEF BIO: I am an Associate Professor at the MIT Media Lab and EECS. I direct the Signal Kinetics group which invents new wireless and sensor technologies to interconnect, sense, and perceive the physical world in ways that were not possible before. Our technologies aim to address complex problems in networking, health monitoring, robotics, and ocean IoT. My research has led to multiple startups. I am currently co-founder of Cartesian Systems, a startup that aims to sense the physical world at an unprecedented scale and precision. Prior to that, my PhD research on wireless sensing (ACM SIGMOBILE Dissertation Award) led to Emerald Innovations, whose devices are used for remote health monitoring of thousands of patients. I have received various honors for my work, including being named as one of the world's top 35 innovators under 35, a Young Global Leader by the World Economic Forum, and the ACM SIGMOBILE Rockstar Award. My research was named as one of the 50 ways MIT has transformed computer science, and one of the 103 ways MIT is making a better world. I have had the honor to present my research to multiple heads of state, including demoing to President Obama at the White House. My research has also been broadly featured in public media, and videos featuring my work have reached over 25 million people. Before joining MIT as faculty, I received my Masters (2013) and PhD (2016) in Computer Science from MIT and my Bachelors (2011) from the American University of Beirut. Interested in joining my research group? You can find information on how to apply for MS/PhD, MEng, postdoc, UROP, and software/hardware/ML engineer positions here. Interested in joining my startup? We have openings for full-time ML scientists, engineers, and interns (grad & undergrad) at Cartesian. Research Overview My team's current research on wireless and sensor technologies focuses on four main areas: Ocean IoT: including batteryless networking, underwater GPS, backscatter theory, underwater-to-air communications, battery-free wireless cameras, and underwater AI. Robot/Drone Perception+Manipulation: including RF-Visual reinforcement learning, mechanical search, and drone localization/navigation (with millimeter-wave backscatter tags). Mixed/Augmented Reality: via X-ray vision headsets. Millimeter-wave Imaging: for non-line-of-sight 3D reconstruction and indoor scene reconstruction. My past research includes: Seeing through walls with WiFi: including 3D tracking, gesture recognition, and reconstructing human figures through walls. Smart homes that measure vital signs including breathing, heartbeats, micro-cardiac events, emotions, and stress levels. Batteryless micro-implants for in-body connectivity, sensing, self-reconfigurabiling with security/privacy. RFID (and RFID-vision fusion): localization, tracking, food/liquid sensing, drone-based inventory, reinforcement learning, robotic picking, and augmented reality. Finally, stories behind my research appeared in a poscast interview (with MIT's president, Sally Kornbluth), an MIT News profile (junior faculty journey) and IEEE Spectrum (PhD research). Recent News Check out my latest talk about our research on underwater IoT (SIGCOMM'25): Teaching a new class on wireless and mobile sensing in Fall 2025. We invented mmNorm: a new way for millimeter-wave imaging (3D reconstruction) via surface normal estimation: Our paper won the Best Paper Runner-up and the Best Poster Award at ACM MobiSys'25. Check out this video explainer and demo: Check out MiFly, a new system that enables drone self-localization using millimeter-wave tags (INFOCOM'25) [MIT News story] Gave a keynote at the National Science Foundation on how to pitch your research (tailored to junior faculty). My PhD student Tara Boroushaki is joining Yale as an Assistant Professor (and recruiting PhD students + postdocs for her lab). Curated the World Economic Forum's Strategic Intelligence on Internet of Things. Our startup Cartesian received the highly selective NSF SBIR Phase II Award. Looking to serving on the Advisory Board of the recently-launched Dubai National University. Named as Young Global Leader by the World Economic Forum. Named Great Arab Mind by HH Sheikh Mohammed bin Rashid, VP of UAE and ruler of Dubai (Khaleej Times, The National). Selected Awards & Honors ACM SIGMOBILE Test-of-Time Award (2023) ACM MobiCom Best Paper Award (2023) IEEE RFID Best Paper Award (2023) Nature Electronics Research Highlights (2022) ACM SIGMOBILE Rockstar Award (2022) Sloan Research Fellowship (2021) ONR Early Career Grant (2020) ACM SIGCOMM Best Paper Award (2019) ONR Young Investigator Award (2019) NSF CAREER Award (2019) ACM SIGMOBILE Dissertation Award for the Best Doctoral Dissertation in Wireless Networks and Mobile Computing (2018) Sprowls Award for Best Doctoral Dissertation in Computer Science at MIT (2017) Google Faculty Research Award (2017) AUB Distinguished Young Alumnus Award (2017) Invited to The First-Ever White House Demo Day (2015) Forbes 30 Under 30 (2015) Technology Review's 35 Innovators Under 35 (TR35) (2014) 50 Ways that MIT has transformed Computer Science (X-ray Vision) (2014) William A. Martin Award for Best Master's Thesis in Computer Science at MIT (2013) Highest cumulative GPA in the digitally-recorded history of AUB (2011) My Team Graduate Students: Waleed Akbar (Award Papers in Nature Communications'22 & ACM WUWNet'22 & ACM MobiCom'23) Laura Dodds (MIT Presidential Fellow, MIT EECS Best MEng Thesis Award, Award Papers in IEEE RFID'23 & ACM MobiSys'25) Nazish Naeem (Award Papers in ACM WUWNet'23 & IEEE RFID'23) Maisy Lam (NSF GRFP Fellow, Award Paper in IEEE RFID'23) Jack Rademacher (Award Paper in ACM WUWNet'22) Purui Wang (Award Paper in ACM WUWNet'22) Weitung Chen (MIT Jacobs Presidential Fellow, Award Paper in IEEE RFID'23) Rohan Menon (MIT Jacobs Presidential Fellow) You? We're always looking for ambitous students to join us. We do not require fellowships prior to admission. In fact, most students got their fellowships and even their first paper after joining the lab! Administrative: Aimee Schroeder (Senior Administrative Assistant) Alumni (PhDs and postdocs): Mohamed Radwan Abdelhamid (PhD → Apple, co-advised w/ Anantha Chandrakasan), Reza Ghaffarivardavagh (Postdoc → OpenAI), Yunfei Ma (Postdoc → Alibaba → Uber), Aline Eid (Postdoc → Assistant Professor at University of Michigan, Ann-Arbor), Unsoo Ha (Postdoc → Apple), Ahmed Allam (Postdoc → University of Cincinnati), Sayed Saad Afzal (PhD → Apple), Tara Boroushaki (PhD → Assistant Professor at Yale) Teaching I believe in open and accessible education, and make my teaching material available to the public. Undergraduate: The \"IoT\" Class (Mobile and Sensor Computing), Spring 2018, Spring 2019, Spring 2020, Spring 2021, Spring 2022, Spring 2025 Graduate: How To Wirelessly Sense Almost Anything, Fall 2022 Ocean IoT: Technologies, Industries, Sustainability, Fall 2021 Emerging Wireless and Mobile Technologies, Fall 2020 Computational Wireless Sensing, Fall 2019 Computer Networks, Fall 2017 Press Coverage Subsea Backscatter (PAB, U2B, UBL, VAB) was covered by: The Economist, IEEE Spectrum TechCrunch, World Economic Forum, BBC, National Geographic, dezeen, EE Times, PCMag, ExtremeTech, All About Circuits, MIT News [Front Page], and others. AR with X-Ray Vision (X-AR, RF-AR) was covered by MIT News, Popular Science, Boston.com, Futurism, The Hindu, Cool Hunting, and others. Battery-free Underwater Camera was covered by: MIT News [Front Page], CBC, CNET, National Geographic (Spanish), Aljazeera (Arabic), and others. Robotic RF-Visual Perception & Manipulation (RF-Grasp, RFusion) was covered by: The Wall Street Journal, TechCrunch, Mashable, Engadget, MIT News [Front Page], RFID Journal, CACM, World Economic Forum, BBC, Daily Mail, Interesting Engineering, and others. Underwater-to-air Communications (TARF) was covered by: BBC, Fox News, Smithsonian, Popular Mechanics, IEEE Spectrum, CNET, Engadget, MIT News [Front Page], and other media outlets. Batteryless Micro-implants (IVN, micro-medic) was covered by: Technology Review, Engadget, Boston Herald, Yahoo! News, UPI, Medgadget, Digital Trends, New Atlas, and other media outlets. RFID Micro-sensing (RFind, RFly, TurboTrack, RFIQ) was covered by: MIT News [Front Page], RFID Journal, BBC, IEEE Spectrum, Engadget, CBS This Morning, The Engineer, The Verge, Inverse, Geek, Digital Trends, TechCrunch, New Atlas, MIT News, ZDNet, Tech Xplore, Assembly Magazine, and others. Our White House Demo to President Obama was covered by: The White House Press Office, MIT News, NBC News, The Wall Street Journal and others. Wireless Sensing of Vitals & Emotions (Vital-Radio, EQ-Radio) was covered by: New Scientist, CBS, Scientific American, The Wall Street Journal‎, Forbes, Business Insider, Fast Company, Engadget, NOVA|PBS, Le Figaro, Discovery News, Wired, Daily Mail, Engadget, Medgadget, Gizmodo, and others. Seeing Through Walls (Wi-Vi, WiTrack, RF-Capture) was covered by: The Washington Post, BBC, NBC News, FOX News, The Guardian, Boston Globe, Popular Science, Discovery News, Slashdot, Slate, Technology Review, Fast Company, Wired, Engadget, Bloomberg TV, Daily Mail, Hacker News , Business Insider, Huffington Post, Popular Mechanics, and others. Finally, one of the cool highlights of my research is an entire episode in The Big Bang Theory about our emotion detection device.",
  "content_length": 9688,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:50"
}