{
  "name": "Fadi A. Zaraket",
  "homepage": "http://research-fadi.aub.edu.lb",
  "status": "success",
  "content": "Fadi A. Zaraket's Webpage Fadi A. Zaraket calendar | publications| courses| bio | office Associate Professor Contact Information email: fadi.zaraket@aub.edu.lb office: +961(1)350-000 ext 3484 home: +961(1)350-000 ext 2765 cell: +961(70)139-440 fax: +961(1)744-462 P.O.Box: 11-0236 Riad El Solh, Beirut 1107 2020 Lebanon USA mailing address Electrical and Computer Engineering Department Office: Bechtel 430 ext. 3484 Program correctness automation lab (PCALab) Computational linguistics and infomration extraction Lab (CLIELab) RESEARCH I am actively involved, and always looking for enthusiastic and interested students, in the following research areas. Automatic correctness of programs and logic systems. Formal methods: Static analysis, model checking, logic synthesis, specification based coverage metrics Information extraction from Arabic and medical documents. Data science: Graph entity extraction, entity and relational entity extraction, cross document analysis, Arabic morphological analysis PUBLICATIONS and PATENTS You can find a list of publications here, and two lists of patents here (pending, issued). PROJECTS Program correctness automation lab (PCALab) Computational linguistics and information extraction lab (CLIELab) TEACHING EECE 432 Operating systems, Fall 2017, Spring 2016, Spring 2014, Spring 2013, Spring 2012, Spring 2011, Spring 2010. EECE 330 Data structures and algorithms, Fall 2015, Fall 2012, Fall 2010, Fall 2009. EECE 437 Software architecture and design fundamentals, Spring 2017. EECE 230 Introduction to programming using C++ , Spring 2014, Spring 2013, Fall 2012, Spring 2012. EECE 231 Introduction to programming using C++ and Matlab , Fall 2015, Fall 2014. EECE 637 Advanced pogramming practices, Fall 2014, Fall 2012, Fall 2010, Fall 2009. EECE 636 Logic synthesis and verification , Fall 2017, Fall 2015, Spring 2014, Spring 2012, Spring 2011, Spring 2010. EECE 798E Introduction to computational Arabic, Spring 2012, Spring 2011, Spring 2010. Students Maya Safieddine, working on CAD for logic design and verification towards her PhD. Mohamad Sabra, working on natural language processing for medical text. Masters. Hussein Hayeck, working on natural language processing for Arabic text. Masters. Batoul Shareffedine, working on natural language processing for medical text. Masters. BIOGRAPHY I joined the ECE department at The American University of Beirut in February 2009. I received my PhD in ECE from UT Austin in December 2007. I received my Masters and Bachelor degrees in CCE from The American University of Beirut in February 2001 and July 1996 respectively. I worked at IBM on logic verification and debugging tools between June 2001 and December 2008. I also worked at Sun Microsystems and Santa Cruz Operations on kernel development between April 1999 and June 2001. Click here for my CV. Calendar USA Mailing Address 3 Dag Hammarskjold Plaza 8th Floor New York, NY 10017-2303 USA Directions to my office Bechtel 430 My office is in the Bechtel Engineering Building, 4th floor, office number 430. hits since July 10, 2009 (as counted by www.digits.com).",
  "content_length": 3113,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:55"
}