{
  "name": "Faegheh Hasibi",
  "homepage": "http://hasibi.com",
  "status": "success",
  "content": "Faegheh Hasibi About I am an assistant professor of information retrieval at the Institute of Computing and Information Sciences (iCIS) at the Radboud University. My general research interest lies in the intersection of Information Retrieval and Natural Language Processing, with the primary focus in conversational AI and semantic search systems In particular, I am interested in knowledge grounded  conversational search, entity linking and retrieval, and utilizing knowledge graphs for semantic search tasks. Before joining iCIS, I was working at ASML, researching and developing machine learning solutions for the IC manufacturing industry. I obtained my PhD in Computer and Information Science from the Norwegian University of Science and Technology (NTNU), under the supervision of prof.  Krisztian Balog and prof. Svein Erik Bratsberg.  In 2013, I was an intern at Yahoo! lab Barcelona, working on cross domain entity disambiguation. Research interests: Information retrieval;  Conversational  AI; Semantic search; Natural language processing Updates: – March 2024: Full paper accepted at SIGIR ’24 “Doing Personal LAPS: LLM-Augmented Dialogue Construction for Personalized Multi-Session Conversational Search” – March 2024: Gave an invited talk at CIIR, titled “Conversation Personalization: From Data Collection to Response Generation” – Feb 2024: I serve as a PC chair of SIGIR-AP 2024, to be held in December in Japan – Jan 2024: I serve as chair of ACM ICTIR steering committee for two years – Dec 2023: Tutorial accepted at the Web Conference 2024 – July 2023: Tutorial paper accepted at the CIKM 2023 conference “Data Augmentation for conversational AI” – July 2023: Presented  as a Panelist at the SIGIR 2023 Tutorial “Neuro-Symbolic Representations for Information Retrieval” – March 2023:  Paper accepted at SIGIR 2023 “ MMEAD: MS MARCO Entity Annotations and Disambiguations” – Jan 2023: Severed as the scientific chair of  NWO ICT with Industry 2023 at the Lorentz center, Leiden – Jan 2023: Our report on the SIGIR 2022 Women in IR is published – August 2022: Paper accepted at COLING ’22 “Find the Funding: Entity Linking with Incomplete Funding Knowledge Bases” – August 2022: Paper accepted at CIKM  ’22 “Personal Entity, Concept, and Named Entity Linking in Conversations” – August 2022: Paper accepted at DESIRES ’22 “REBL: Entity Linking at Scale” – June 2022: We have been awarded the Radboud-Glasgow collaboration fund (£18,500) for our proposal “Task-centric personal knowledge graph construction for conversational AI” – March 2022: We’ve been awarded an NWA-ORC grant for our proposal “LESSEN: Low Resource Chat-based Conversational Intelligence” (4.6 million Euros). Stay tuned for two open PhD positions on utilizing knowledge graphs for conversational agents. – March 2022: Full paper accepted at SIGIR 2022 “Entity-aware Transformers for Entity Search.” – February 2022: Invited talk at the German Aerospace Center (DLR), Open Search Colloquium. – January 2022: I will serve as a chair of  the Netherlands ICT with Industry 2023, to be held at the Lorentz center. – December 2021: I’ve been awarded a grant from the Netherlands eScience Center for the proposal “REL 2.0: Multi-lingual and Multi-purpose Entity Linking Toolkit” (140K Euros in-kind). – May 2021: Paper accepted at SIGIR 2021 “Conversational Entity Linking: Problem Definition and Datasets.” – April 2021: I will serve as a program co-chair of ECIR 2022 reproducibility track. – April 2021: Invited talk at the University of Padua on “Smarter Search with Knowledge Graphs: Entity Retrieval and Linking.” – March 2021: Invited talk at Glasgow IR group on “entity linking in documents and conversations.” – Jan 2021: I will serve as the general chair of ICTIR 2021 conference. about Assistant Professor at Radboud University Email: f.last_name@cs.ru.nl Visiting address: ICIS, Room 02.01 Postal address: Toernooiveld 212 6525 EC Nijmegen , The Netherlands Follow @hasibi Tweets by @fhasibi",
  "content_length": 3986,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:51"
}