{
  "name": "Fahad Saeed",
  "homepage": "https://prof-s.github.io",
  "status": "success",
  "content": "Fahad Saeed, Ph.D. Full Professor of Computing and Graduate Program Director, Director: Precision Computational Health and Biomedical Data Science Lab (Saeed Lab) Knight Foundation School of Computing and Information Sciences, Florida International University (FIU) - The State University of Florida at Miami, FL USA Professor (courtesy), Biomolecular Sciences Institute (BSI), Professor (courtesy), Herbert Wertheim School of Medicine, Founder & CEO: AI-NeoTech LLC Mailing Address: 11200 SW 8th St, INNOVATION Complex (Room INV 205), Miami, FL 33199, USA E-mail: fsaeed@fiu.edu Twitter: @Prof_FahadSaeed Phone: +1-305-348-3131 Office: INV 205 Long CV (pdf) Google Scholar Profile Biosketch Dr. Fahad Saeed is Full Professor and Director of Graduate Studies in the Knight Foundation School of Computing and Information Sciences at Florida International University (FIU), Miami FL. He received his PhD in the Department of Electrical and Computer Engineering, University of Illinois at Chicago (UIC) in 2010. He was trained as a Post-Doctoral Fellow and Research Fellow in the Systems Biology Center at National Institutes of Health (NIH), Bethesda MD from Aug 2010 to January 2014 respectively, under the supervision of Mark Knepper. Prior to joining FIU, Prof. Saeed was a tenure-track Assistant Professor in the Department of Electrical & Computer Engineering and Department of Computer Science at Western Michigan University (WMU), Kalamazoo Michigan since Jan 2014. He was tenured and promoted to the rank of Associate Professor at WMU in August 2018. He has served as a visiting scientist in world-renowned prestigious institutions such as Department of Bio-Systems Science and Engineering (D-BSSE), ETH Zurich, Swiss Institute of Bioinformatics (SIB) and Epithelial Systems Biology Laboratory (ESBL) at National Institutes of Health (NIH) Bethesda, Maryland. Prof. Saeed has published 90+ peer-reviewed research papers in leading proceedings, and journals, and 1 Book Chapter, edited 4 Conference Proceedings, 3 special issue journals, and 1 Book. His research is supported by highly competitive grants mainly from National Science Foundation (NSF) and National Institutes of Health (NIH). He has been awarded over US$ 6.85 million in external research funds - with more than US$ 5.45 million as a PI. He was awarded the NSF Research Initiation Initiative (CRII) Award bestowed to young and promising scientists in the first two years of their tenure-track position. Most recently he was awarded the NSF Faculty Early Career Development (CAREER) Award which is NSF's most prestigious award in support of early-career faculty who have the potential to serve as academic role models in research and education. His research has been supported by NVIDIA, Intel/Altera, Xilinx, National Science Foundation (NSF) and National Institutes of Health (NIH). Dr. Saeed has established a global profile as an Independent Researcher and leader in the field, and has been sought as panelist at the National and International funding agencies. These inlucde serving as panelist at various study sections at National Institutes of Health (NIH), National Science Foundation (NSF), NIH NIDDK, National Nuclear Security Administration (NNSA) Department of Energy (DOE), and as International expert and panelist for Croatian Science Foundation (CSF), University of Queensland Diamantina Institute in Australia, Belgium Fund for Scientific Research (F.R.S.- FNRS), and Natural Sciences & Engineering Research Council of Canada. He has served as the program co-chair of the Bioinformatics and Computational Biology (BICoB) Conference and IEEE International Conference on Bioinformatics and Biomedicine (IEEE BIBM). He is also a founding chair of IEEE Workshop on HPC solutions to Big Data Computational Biology (IEEE HPC-BCB). He also serves on the editorial board of Springer Journal of Network Modeling Analysis in Health Informatics and Bioinformatics, on the Editorial board of Journal of the American Society of Nephrology, and as Associate Editor for Frontiers of Digital Public Health (specialty section of Frontiers in Public Health, Frontiers in ICT and Frontiers in Computer Science). He has served on numerous IEEE/ACM program committees and is peer-reviewer for more than a two dozen journals. Dr. Saeed is a Senior Member of ACM and also a Senior Member of IEEE. His honors include ThinkSwiss Fellowship (2007,2008), NIH Postdoctoral Fellowship Award (2010), Fellows Award for Research Excellence (FARE) at NIH (2012), NSF CRII Award (2015), WMU Outstanding New Researcher Award (2016), WMU Distinguished Research and Creative Scholarship Award (2018),  , NSF CAREER Award (2017), FIU KFSCIS Excellence in Applied Research Award (2020). More recently he was recognized as \"Top Scholar” in \"Research and Creative Activities\" by FIU in 2022 Recent Media Coverage \"Wearable devices could help predict seizures\", FIU News, August 2022 Article Link \"NIH Awards FIU $1M to Develop Machine Learning Algorithms to Study Proteins\", HPC Wire, June 2020 Article Link \"FIU researchers think of a way to speed up a vaccine for COVID-19\", Miami Herald, June 2020 Article Link \"Research Grant Helps FIU Professor Reach One Step Closer To Coronavirus Vaccine\", FIU PantherNow, July 2020 Article Link \"NIH awards FIU $1M to develop machine-learning algorithms to study proteins - important for understanding, treating diseases\", FIU News, June 2020 Article Link \"Dr. Saeed awarded prestigious $1 Million R01 grant from National Institute of Health\", SCIS FIU News, May 2020 Article Link Distinguished Research and Creative Scholarship Award: Fahad Saeed\",OVPR WMU, March 2018 Description YouTube Algorithms for Life, WMU Annual Magazine, Summer 2017 Rising Stars in Research, WMU Annual Magazine, Summer 2017 Researchers Snag a prestigious National Prize, WMU News Link, 2017 WMU Assistant Professor receives NSF CAREER Award, CEAS WMU Article Link Surfing with Algorithms, NSF Science Node, March 2016 Working with Powerful Supercomputers, WMU CEAS News, July 2015 Recent Honors Excellence in Research and Creative Activities Award, Knight Foundation School of Computing and Information Science (KFSCIS), FIU, Dec 2024 Editor, PLOS Mental Health, Oct 2023 FIU Top Scholar, Research and Creative Activities , Florida International University, Sept 2022 CEC News Page Associate Editor, Experimental Results, Cambridge University Press, April 2022 Editorial Board Page Keynote Speaker at the 14th International Conference on Bioinformatics and Computational Biology (BICOB). More info here: BiCOB-2022 KeyNote Certificate Excellence in Applied Research Award, School of Computing and Information Science (SCIS), Florida International University (FIU), Dec 2020 Distinguished Research and Creative Scholarship Award, Office of Vice President of Research WMU, Feb 2018 NSF CAREER Award, 2017-2022 Highest Funding Award in a year for computer scientist, WMU 2017 ACM Senior Member, May 2017 Outstanding New Researcher Award, College of Engineering and Applied Science (CEAS), Western Michigan University, Jan 2016 (1 faculty member gets the award in a single year for the entire college consisting of 7 academic departments) IEEE Senior Member, March 2015 NSF CISE Research Initiation Initiative (CRII) Award, Feb 2015 - Feb 2018 Fellows Award for Research Excellence (FARE), National Institutes of Health (NIH), June 2012 (Official award ceremony and US\\$1000 travel grant) Travel award from Swiss Institute of Bioinformatics (SIB), Summers 2009. UIC Graduate Student Council (GSC) travel award for the BiCoB April 2009. Recipient of Think Swiss Scholarship, by the Government of Switzerland for two years (2007 and 2008). Travel award from D-BSSE ETH Zurich, Summers 2008. Funding Prof. Saeed has been awarded over US$ 6.85 million in external research funds - with more than US$ 5.45 million as a PI since 2014 (approx. US$ 700k per year) Most of the external research funds are competitively awarded from Federal Agencies such as National Science Foundation (NSF) and National Institutes of Health (NIH). Intramural funds and computing allocations are not included in this amount. External Research Funds 17. National Institutes of Health (NIH) R35GM153434 [US$ 1.75 million], “Machine­ Learning Models for big data omics”, Fahad Saeed (PI), June 2024 ­- June 2029 (single PI grant: MIRA R35 Outstanding Investigator mechanism) | NIH Reporter Award Page 16. National Science Foundation (NSF) OAC-2312599 [US$ 600,000], ``OAC Core: High Performance Computing Algorithms and Software for large-scale Mass Spectrometry based Omics\", Fahad Saeed (PI), Sept 2023 - Aug 2026 | NSF Award Page 15. National Science Foundation (NSF) TI-2322346 [US$ 275,000], ``STTR Phase I: Patient-Specific System for Early Detection and Identification of Epileptic Seizures \", Saba Mehmood (PI), Fahad Saeed (Co-PI), Oct 2023 - Sept 2024 | NSF Award Page 14. National Science Foundation (NSF) CHE-2304837 [US$ 500,000], ``Development of Multidimensional Ion Mobility-Tandem Mass Spectrometry (IMSn-FT-ICR MSn) Tools for the Characterization of Complex Mixtures\", Francisco Lima (PI), Fahad Saeed (Co-PI), Sept 2023 - August 2026 | NSF Award Page 13. National Science Foundation (NSF) TI-2213951 [US$ 250,000], ``PFI-TT: Artificial Intelligence-enabled Real-time System for Early Epileptic Seizure Detection and Prediction\", Fahad Saeed (PI), August 2022 - July 2024 | NSF Award Page 12. National Science Foundation (NSF) IIP-2143515 [US$ 50,000], ``I-Corps: Utilizing Machine learning and Artificial Intelligence (AI) for Early Detection and Identification of Mental Disorders\", Fahad Saeed (PI), Sept 2021 - Sept 2022 | NSF Award Page 11. National Institutes of Health (NIH) Supplemental- 3R01GM134384-02S1[US$ 100,000],\"Compute-Cluster for Deep-Learning Models for Mass Spectrometry based Proteomics data\" Fahad Saeed (PI), August 2021 - May 2023 | NIH Reporter Award Page 10. National Science Foundation (NSF) OAC-2126253 [US$ 400,000], ``C",
  "content_length": 50309,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:54"
}