{
  "name": "Fahad Panolan",
  "homepage": "https://iith.ac.in/~fahad",
  "status": "success",
  "content": "fahadpanolan Fahad Panolan Home Publications Talks Teaching CV Contact Room No: 112/E, Block-C IIT Hyderbad, Kandi, Sangareddy, 502285. Email : firstname@cse.iith.ac.in dblp Google Scholar ORCID I am an Assistant Professor in the department of Computer Science and Engineering, IIT Hyderabad, India. Prior to joining IITH, I was a PostDoc in the department of Informatics, University of Bergen, Norway, hosted by Prof. Fedor V. Fomin. I obtained PhD in Theoretical Computer Science from The Institute of mathematical sciences, Chennai, India under the supervision of Prof. Saket Saurabh in 2015. Research Interests Parameterized Algorithms and Complexity (a.k.a Multivariate analysis of algorithms) Graph theory and graph algorithms Approximation algorithms Streaming algorithms News Subexponential Parameterized Algorithms on Disk Graphs coauthored with Daniel Lokshtanov (UCSB), Saket Saurabh (IMSc), Jie Xue (NYU Shanghai), and Meirav Zehavi (Ben-Gurion University) is accepted at SODA 2022 Deleting, Eliminating and Decomposing to Hereditary Classes Are All FPT-Equivalent coauthored with Akanksha Agrawal (IITM), Lawqueen Kanesh (NUS Singapore), Daniel Lokshtanov (UCSB), M. S. Ramanujan (University of Warwick), Saket Saurabh (IMSc), and Meirav Zehavi (Ben-Gurion University) is accepted at SODA 2022 Gerrymandering on graphs: Computational complexity and parameterized algorithms coauthored with Sushmita Gupta (IMSc), Pallavi Jain (IIT Jodhpur), Sanjukta Roy (TU Wien) and Saket Saurabh (IMSc) is accepted at SAGT 2021 Diverse Collections in Matroids and Graphs coauthored with Fedor Fomin (UiB), Petr A. Golovach (UiB), Geevarghese Philip (CMI), and Saket Saurabh (IMSc) is accepted at STACS 2021 An FPT Algorithm for Elimination Distance to Bounded Degree Graphs coauthored with Ramanujan M. Sridharan ( University of Warwick), Akanksha Agrawal (IIT Madras), Lawqueen Kanesh (IMSc) and Saket Saurabh (IMSc) is accepted at STACS 2021 EPTAS for k-means Clustering of Affine Subspaces coauthored with Fedor Fomin (UiB), Petr A. Golovach (UiB), Willian Lochet (UiB), and Kirill Simonov (UiB) is accepted at SODA 2021 Events PC member for ESA 2022 Speaker at Recent Trends on Algorithms (Mar 2022) Speaker at ACM Winter School on Algorithms and Lower Bounds (Dec 2021-Jan 2022) PC member for IPEC 2021 PC member for AAAI 2021 Speaker at ACM Winter School on Algorithms for Big Data and Machine Learning (Dec 2020) Speaker at the Workshop Parameterized Complexity 301 Scientific Coordinator, Parameterized Complexity 201 Selected Publications Hitting Topological Minors is FPT. with Fedor V. Fomin, Daniel Lokshtanov, Saket Saurabh and Meirav Zehavi. Proc. Symposium on Theory of Computing(STOC) 2020: 1317-1326 [ ArXiv] Approximation Schemes for Low-Rank Binary Matrix Approximation Problems. with Fedor V. Fomin, Petr A. Golovach, Daniel Lokshtanov, and Saket Saurabh. In ACM Transactions on Algorithms (TALG) ACM Transactions on Algorithms (TALG) 12:1-12:39 (2020) [ ArXiv] Efficient Computation of Representative Families with Applications in Parameterized and Exact Algorithms. with Fedor V. Fomin, Daniel Lokshtanov, and Saket Saurabh. Journal of the ACM(JACM) : 63(4),29(2016) Representative Sets of Product Families. with Fedor V. Fomin, Daniel Lokshtanov, and Saket Saurabh. ACM Transactions on Algorithms (TALG) 13(3): 36:1-36:29 (2017). Deterministic truncation of linear matroids. with Daniel Lokshtanov, Pranabendu Misra, and Saket Saurabh. ACM Transactions on Algorithms (TALG) 14(2): 14:1-14:20 (2018) Lossy Kernelization. with Daniel Lokshtanov, M. S. Ramanujan, and Saket Saurabh. Proc. Symposium on Theory of Computing(STOC) 2017 : 224-237 [Full version] Covering Small Independent Sets and Separators with Applications to Parameterized Algorithms. with Daniel Lokshtanov, Saket Saurabh, Roohani Sharma, and Meirav Zehavi. Proc. ACM-SIAM Symposium on Discrete Algorithms (SODA) 2018 : 2785-2800 Subexponential Algorithms for Rectilinear Steiner Tree and Arborescence Problems. with Fedor V. Fomin, Sudeshna Kolay, Daniel Lokshtanov, and Saket Saurabh. Proc. Symposium on Computational Geometry(SoCG) 2016 : 39:1-39:15 Finding, Hitting and Packing Cycles in Subexponential Time on Unit Disk Graphs. with Fedor V. Fomin, Daniel Lokshtanov, Saket Saurabh, and Meirav Zehavi. Discrete and Computational Geometry (DCG) 1-33 (2019) Copyright © simplestyle_7 | HTML5 | CSS | Website templates",
  "content_length": 4407,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:53"
}