{
  "name": "Faiyaz Doctor",
  "homepage": "https://www.essex.ac.uk/people/docto78602/faiyaz-doctor",
  "status": "success",
  "content": "Faiyaz Doctor | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Faiyaz Doctor People Dr Faiyaz Doctor Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email fdocto@essex.ac.uk Location 4B.525, Colchester Campus Academic support hours Module Supervisor for CE713 Internet of Things Technology Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography I am an academic, innovator and applied technology specialist with over 15 years of experience in the development and application of Artificial Intelligence (AI) techniques in research and commercial areas. Presently I am a Senior Lecturer (Associate Professor) with the School of Computer Science and Electronic Engineering at the University of Essex, U. K where I am founder and head the Intelligent Connected Societies Group, part of the Centre for Computational Intelligence and am member of the Intelligent Embedded Systems and Environments Group. I am also a Director at Interactive Coventry Ltd, steering committee member for the Creative Science Foundation and currently appointed as an Eastern Arc thematic champion for culture, connection and creativity in science and health. Over the course of my career, I have worked in both industrial and academia developing and applying nature inspired Computational Intelligence (CI) approaches for human centred systems related to various real-world domains such as smart environments, elderly care, energy optimization, industrial automation, information analysis, decision-making simulation, control systems and affective computing. I am interested in the development of user and task centred intelligently orchestrated and context aware pervasive computing systems. I am particularly interested in explainable and approximate reasoning techniques based on type-1 and type-2 fuzzy systems, hybrid computational intelligence techniques for real world applications, intelligent agents and AI driven virtual, augmented, and mixed reality systems. I have successfully led and co-led several projects funded through Innovate UK, Harvard University, and the Newton Fund. I am currently institutional lead on a project funded by the Royal Academy of Engineers on capacity building in sub-Saharan Africa and supervising several KTP projects with leading UK businesses. I have published over 80 papers in peer-reviewed international journals, conferences, workshops, books and have two patents. I am an associate editor of the IEEE Transactions on Fuzzy Systems and have guest edited several journal special issues most notably in the Journal of Ambient Intelligence and Smart Environments and the IEEE Transactions on Emerging Topics in Computational Intelligence and MDPI Remote Sensing. I am a fellow of the Higher Education Academy, member of the IEEE and serve on the IEEE Computational Intelligence Society’s Emergent Technologies Technical Committee. Appointments University of Essex Lecturer, Computer Science and Electronic Engineering, University of Essex (1/9/2017 - present) Research and professional activities Research interests Computational Intelligence Nature inspired machine learning and approximate reasoning techniques that include combinations of fuzzy logic systems, neural networks, evolutionary optimisation algorithms, cooperative systems. Key words: Computational Intelligence Open to supervise Fuzzy Systems Type-1 and Type-2 fuzzy system design and applications and hybrid techniques that include deep learning and evolutionary optimisation approaches. Key words: Fuzzy Logic Open to supervise Ambient Intelligence Systems Application and user centred intelligently orchestrated context aware ubiquitous and pervasive computing systems, environments and services. Key words: Ambient Intelligence Open to supervise Intelligent Agents Design and applications of intelligent agents. Key words: Intelligent Agents Open to supervise Data Driven Computational Simulation Modelling Application of bottom up data driven simulation modelling techniques such as Agent Based Models Key words: Simulation Open to supervise Intelligent Immersive Environments Design and applications intelligent virtual and mixed reality systems combining artificial intelligence and machine learning. Key words: Immersive Environments Open to supervise Teaching and supervision Current teaching responsibilities Team Project Challenge (CE165) Application Programming (CE203) Natural Language Engineering (CE314) Current supervision Genghui Qu Degree subject: Computer Science Degree type: Doctor of Philosophy Ismael Hayden Thesis title: Creating an App Outline and Co-Design Guidelines for Artificially Intelligent Driven Software to Support Cbtp Practitioners Working with Clients Experiencing First Episode Psychosis. Degree subject: Clinical Psychology (D Clin Psych) Degree type: Professional Doctorate Aryan Morteza Degree subject: Computer Science Degree type: Doctor of Philosophy Ise Anderson Orobor Thesis title: Multimodal Wearable Fall Risk Assessment for Independent People Living with Dementia Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Kabo Elliot Pule Thesis title: Multi-Objective Resource Optimization of Unmanned Aerial Vehicles and Internet of Things Devices in Time Critical Applications Using Evolutionary Approaches Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 3/1/2024 Publications Journal articles (43) Aloupogianni, E., Doctor, F., Karyotis, C., Tang, R. and Iqbal, R., (2025). Image-based Road Surface Condition Detection Using Transfer Learning. IEEE Transactions on Intelligent Transportation Systems. 26 (11), 19730-19739 Chen, S., Kirton-Wingate, J., Doctor, F., Arshad, U., Dashtipour, K., Gogate, M., Halim, Z., Al-Dubai, A., Arslan, T. and Hussain, A., (2024). Context-Aware Audio-Visual Speech Enhancement Based on Neuro-Fuzzy Modelling and User Preference Learning. IEEE Transactions on Fuzzy Systems. 32 (10), 5400-5412 Al Farsi, A., Petrovic, D. and Doctor, F., (2023). A Non-Iterative Reasoning Algorithm for Fuzzy Cognitive Maps based on Type 2 Fuzzy Sets. Information Sciences. 622, 319-336 Hijji, M., Iqbal, R., Pandey, A., Doctor, F., Karyotis, C., Rajeh, W., Alshehri, A. and Aradah, F., (2023). 6G Connected Vehicle Framework to Support Intelligent Road Maintenance using Deep Learning Data Fusion. IEEE Transactions on Intelligent Transportation Systems. 24 (7), 7726-7735 Areeb, QM., Nadeem, M., Sohail, SS., Imam, R., Doctor, F., Himeur, Y., Hussain, A. and Amira, A., (2023). Filter Bubbles in Recommender Systems: Fact or Fallacy - A Systematic Review. Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery. 13 (6) Karthikeyan, S., Garcia Seco De Herrera, A., Doctor, F. and Mirza, A., (2022). An OCR Post-correction Approach using Deep Learning for Processing Medical Reports. IEEE Transactions on Circuits and Systems for Video Technology. 32 (5), 2574-2581 Doctor, F., Budd, T., Williams, PD., Prescott, M. and Iqbal, R., (2022). Modelling the effect of electric aircraft on airport operations and infrastructure. Technological Forecasting and Social Change. 177, 121553-121553 Khan, M., Obaidat, MS., Hussain, T., Del Ser, J., Kumar, N., Tanveer, M. and Doctor, F., (2021). Fuzzy Logic in Surveillance Big Video Data Analysis: Comprehensive Review, Challenges, and Research Directions. ACM Computing Surveys. 54 (3), 1-33 Maniak, T., Iqbal, R. and Doctor, F., (2021). Hierarchical spatial-temporal state machine for vehicle instrument cluster manufacturing. IEEE Transactions on Intelligent Transportation Systems. 22 (7), 4131-4140 Kiziltepe, RS., Sweeney, L., Constantin, MG., Doctor, F., García Seco de Herrera, A., Demarty, C-H., Healy, G., Ionescu, B. and Smeaton, AF., (2021). An annotated video dataset for computing video memorability. Data in Brief. 39, 107671-107671 Iqbal, R., Doctor, F., More, B., Mahmud, S. and Yousuf, U., (2020). Big Data analytics and Computational Intelligence for Cyber Physical Systems: Recent trends and state of the art applications. Future Generation Computer Systems. 105, 766-778 Iqbal, R., Doctor, F., More, B., Mahmud, S. and Yousuf, U., (2020). Big data analytics: Computational intelligence techniques and application areas. Technological Forecasting and Social Change. 153, 119253-119253 Wei, Z-X., Doctor, F., Liu, Y-X., Fan, S-Z. and Shieh, J-S., (2020). An Optimized Type-2 Self-Organizing Fuzzy Logic Controller Applied in Anesthesia for Propofol Dosing to Regulate BIS. IEEE Transactions on Fuzzy Systems. 28 (6), 1062-1072 Iqbal, R., Maniak, T., Doctor, F. and Karyotis, C., (2019). Fault Detection and Isolation in Industrial Processes Using Deep Learning Approaches. IEEE Transactions on Industrial Informatics. 15 (5), 3077-3084 Goudarzi, S., Anisi, MH., Kama, N., Doctor, F., Soleymani, SA. and Sangaiah, AK., (2019). Predictive modelling of building energy consumptio",
  "content_length": 29879,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:57"
}