{
  "name": "Faizan Ahmed",
  "homepage": "https://people.utwente.nl/faizan.ahmed",
  "status": "success",
  "content": "Dr. F. Ahmed | People Pages: Find employees & contact details | University of Twente Skip to content EEMCS-CS-FMTEEMCS-SERVICES-OLDZilverling 3070faizan.ahmed@utwente.nl+31534893370Business card I am trained as a mathematician and received Ph.D. in mathematical optimization from the University of Twente. I have also obtained PDEng (now EngD)-Mathematics for Industry from the Eindhoven University of Technology; during this time, I was introduced to the world of data science. My experience and research background resulted in two research streams: Applied machine learning and mathematical optimization.OrganisationsFaculty of Electrical Engineering, Mathematics and Computer Science (EEMCS)Computer Science (EEMCS-CS)Formal Methods and Tools (EEMCS-CS-FMT)Services EEMCS (EEMCS-SERVICES)Opleidingsdirecteuren (EEMCS-SERVICES-OLD)Digital Society InstituteAncillary activitiesSaxion University of Applied SciencesDocent/onderzoekerMy primary research interest is applied machine learning for industry and healthcare, especially explainable AI. I am currently engaged in projects related to the application of machine learning for point cloud data, disease prediction/ progression, and data warehousing. Over time, mathematical optimization has become a secondary interest though it is still inspiring to see its applicability in all areas of science and engineering. PublicationsJump to: 2025 | 2024 | 2023 | 2022 | 20212025C-SHAP for time series: An approach to high-level temporal explanations (2025)[Working paper › Preprint]. ArXiv.org. Jutte, A., Ahmed, F., Linssen, J. & van Keulen, M.https://doi.org/10.48550/ARXIV.2504.11159Toward Automated UML Diagram Assessment: Comparing LLM-Generated Scores with Teaching Assistants (2025)In Proceedings of the 17th International Conference on Computer Supported Education, CSEDU 2025 (pp. 158-169) (International Conference on Computer Supported Education, CSEDU - Proceedings; Vol. 2025). Science and Technology Publications, Lda. Bouali, N., Gerhold, M., Ul Rehman, T. & Ahmed, F.https://doi.org/10.5220/00134819000039322024IterSHAP: An XAI-Based Feature Selection Method for Small High-Dimensional Datasets (2024)In Proceedings of the Future Technologies Conference (FTC) 2024, Volume 2 (pp. 526-545) (Lecture Notes in Networks and Systems; Vol. 1155 LNNS). Springer. van Mourik, F., Haeri, M. A., Bukhsh, F. A. & Ahmed, F.https://doi.org/10.1007/978-3-031-73122-8_35Towards Explainable Machine Learning for Prediction of Disease Progression (2024)Applied artificial intelligence, 38(1). Article 2423510. Berendse, S., Krabbe, J., Klaus, J. & Ahmed, F.https://doi.org/10.1080/08839514.2024.2423510Tertiary Review on Explainable Artificial Intelligence: Where Do We Stand? (2024)Machine Learning and Knowledge Extraction, 6(3), 1997-2017. van Mourik, F., Jutte, A., Berendse, S. E., Bukhsh, F. A. & Ahmed, F.https://doi.org/10.3390/make6030098Investigating the Impact of Code Generation Tools (ChatGPT & Github CoPilot) on Programming Education (2024)In Proceedings of the 16th International Conference on Computer Supported Education, CSEDU 2024 (pp. 221-229) (International Conference on Computer Supported Education, CSEDU - Proceedings; Vol. 2). Science and Technology Publications, Lda. Nizamudeen, F., Gatti, L., Bouali, N. & Ahmed, F.https://doi.org/10.5220/0012628000003693Teaching Assistants as Assessors: An Experience Based Narrative (2024)In Proceedings of the 16th International Conference on Computer Supported Education, CSEDU 2024 (pp. 115-123) (International Conference on Computer Supported Education, CSEDU - Proceedings; Vol. 1). Science and Technology Publications, Lda. Ahmed, F., Bouali, N. & Gerhold, M.https://doi.org/10.5220/00126242000036932023Covid severity prediction: Who cares about the data quality? (2023)In Covid severity prediction: Who cares about the data quality? (pp. 225-230). IEEE. Nae, T., Krabbe, J., Bukhsh, F. A., Jayasinghe Arachchige, J. & Ahmed, F.https://doi.org/10.1109/FIT57066.2022.00049EmoClock: Communicating Real-Time Emotional States Through Data Physicalizations (2023)In Lecture Notes in Computer Science (LNCS) - Interact 2023 (pp. 416-425). Springer. Peeters, D., Ranasinghe, C., Degbelo, A. & Ahmad, F.https://doi.org/10.1007/978-3-031-42280-5_26Point cloud analysis of railway infrastructure: a systematic literature review (2023)IEEE Access, 11, 134355-134373. Dekker, B., Ton, B., Meijer, J., Bouali, N., Linssen, J. & Ahmed, F.https://doi.org/10.1109/ACCESS.2023.3337049Semantic Segmentation of Terrestrial Laser Scans of Railway Catenary Arches: A Use Case Perspective (2023)Sensors (Switzerland), 23(1). Article 222. Ton, B., Ahmed, F. & Linssen, J.https://doi.org/10.3390/s230102222022Approximation Hierarchies for the Copositive Tensor Cone and Their Application to the Polynomial Optimization over the Simplex (2022)Mathematics, 10(10). Article 1683. Iqbal, M. F. & Ahmed, F.https://doi.org/10.3390/math101016832021Two methods for the maximization of homogeneous polynomials over the simplex (2021)Computational optimization and applications, 80(2), 523-548. Ahmed, F. & Still, G.https://doi.org/10.1007/s10589-021-00307-1Research profilesGoogle Scholarresearch.utwente.nl profileI teach courses related to Databases, Explainable AI, and Data science. Affiliated study programsMaster Computer ScienceMaster Business Information TechnologyBachelor Creative TechnologyBachelor Business Information TechnologyBachelor Technical Computer ScienceCourses academic year 2025/2026Courses in the current academic year are added at the moment they are finalised in the Osiris system. Therefore it is possible that the list is not yet complete for the whole academic year.192166200 - Capita Selecta I-Tech192199508 - Research Topics CS192199968 - Internship CS192199978 - Final Project CS192399979 - Final Project BIT201300058 - Research Topics BIT201300059 - Internship BIT201300086 - Research Topics 2 CS201400171 - Capita Selecta ST201500371 - Capita Selecta BIT201800524 - Research Topics EIT201900194 - Research Topics I-Tech201900234 - Internship I-Tech202001093 - Practical Component202001190 - Intro. to Math. + Calculus 1A for TCS202001434 - Internship EMSYS202001486 - Capita Selecta EngD (tailored assignm.)202001522 - Capita Selecta EngD (in-company tr.)202001613 - MSc Final Project BIT / CS202200023 - Explainable AI & Ethics202200251 - Capita Selecta DST202200267 - Capita Selecta EngD (tailored assignm.2)202300070 - Final Project EMSYS202400352 - Programming Pearls202400353 - Pearls Project202400425 - Graduation Project II202400810 - Topics in BIT202500203 - Computational Thinking with Python202500204 - Databases, Operating Systems & Networks202500207 - Principles of Object-Oriented Systems202500208 - Advanced Topics in Programming202500213 - Mathematics for pre-masters BIT202500250 - Introduction to Python Programming202500300 - Data Science202500301 - Data Science - Additional Topics202500322 - Data Science for GZW / pre-masters HS202500323 - Data Science for ATLAS - Topics202500324 - Data Science for ATLAS - ProjectCourses academic year 2024/2025192199508 - Research Topics CS192199968 - Internship CS192199978 - Final Project CS192399979 - Final Project BIT201300058 - Research Topics BIT201300059 - Internship BIT201300086 - Research Topics 2 CS201400171 - Capita Selecta ST201500371 - Capita Selecta BIT201800524 - Research Topics EIT201900194 - Research Topics I-Tech201900234 - Internship I-Tech202001066 - Programming202001093 - Practical Component202001190 - Intro. to Math. + Calculus 1A for TCS202001434 - Internship EMSYS202001486 - Capita Selecta EngD (tailored assignm.)202001521 - Capita Selecta EngD (external course)202001522 - Capita Selecta EngD (in-company tr.)202001613 - MSc Final Project BIT + CS202101007 - Data-driven Applications202200021 - Machine Learning for Datatypes202200023 - Explainable AI & Ethics202200251 - Capita Selecta DST202200267 - Capita Selecta EngD (tailored assignm.2)202300070 - Final Project EMSYS202300200 - Data Science202300201 - Data Science - Additional Topics202300202 - Data Science for ATLAS202300336 - Explainable AI202300363 - Internship BIT - CS202400203 - Data Science for GZW202400351 - Computing Fundamental Pearls202400352 - Programming Pearls202400353 - Pearls Project202400366 - Data & Information Theory202400425 - Graduation Project II202400810 - Topics in BITYou can find a list of available graduation projects here:MSc: https://www.utwente.nl/en/eemcs/fmt/education/master-projects/topics/BSc: https://www.utwente.nl/en/eemcs/fmt/education/bachelor-projects/topics/ +31534893370 (work)faizan.ahmed@utwente.nlresearch.utwente.nlGoogle ScholarBusiness card (vCard)AddressUniversity of TwenteZilverling (building no. 11), room 3070Hallenweg 197522 NH EnschedeNetherlandsNavigate to locationUniversity of TwenteZilverling (building no. 11)Hallenweg 197522 NH EnschedeNetherlandsNavigate to locationUniversity of TwenteZilverling 3070P.O. Box 2177500 AE EnschedeNetherlandsOrganisationsFaculty of Electrical Engineering, Mathematics and Computer Science (EEMCS)Computer Science (EEMCS-CS)Formal Methods and Tools (EEMCS-CS-FMT)Services EEMCS (EEMCS-SERVICES)Opleidingsdirecteuren (EEMCS-SERVICES-OLD)Digital Society InstituteAdditional contact informationRoom ZI3070Scan the QR code orDownload vCard",
  "content_length": 9304,
  "method": "requests",
  "crawl_time": "2025-12-01 13:08:58"
}