{
  "name": "Fajri Koto",
  "homepage": "https://mbzuai.ac.ae/study/faculty/fajri-koto",
  "status": "success",
  "content": "Fajri Koto - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Fajri Koto Fajri Koto Assistant Professor of Natural Language Processing Research Interests Professor Koto's research aims to enhance multilingual representation of language models using efficient techniques and transfer learning. He is particularly interested in exploring multilingual NLP in areas such as cultural adaptation in generative models, dialogue systems, knowledge discovery, text and image generation, commonsense reasoning, fairness and trustworthiness, and applications of NLP in education and health. Email Share Prior to joining MBZUAI, Professor Koto obtaind four years of industry experience working at Samsung, KMKLabs, and Amazon. Prior to his current role, Professor Koto was a Postdoctoral Research Fellow at MBZUAI and a core team member of JAIS, the Arabic-centric LLM. In his postdoctoral work, he focused on LLM evaluation and enhancing the multilingual representation of language models. His work has been recognized with the best/outstanding paper awards at CSRR (ACL 2022), EACL 2023, and AACL 2023. Professor Koto holds a PhD in Engineering (Natural Language Processing) from The University of Melbourne under the Australia Awards program. His PhD work focused on enhancing text summarization by exploring discourse, keyphrases, and evaluation systems. Additionally, Professor Koto has three US patents in machine learning applications. Regionally, he is active in NLP communities in the Southeast Asia (SEA) region, where he co-initiated the Indonesian NLP community and the SEA NLP community. Ph.D. in Engineering (Natural Language Processing) from the University of Melbourne, Australia. Master of Computer Science from Universitas Indonesia, Indonesia. Bachelor of Computer Science from Universitas Indonesia, Indonesia. Outstanding Reviewer Award, EACL 2024 Best Resource Paper Award, AACL 2023 Outstanding Paper Award, EACL 2023 SEAMEO-Australia Education Links Award, 2023 Keynote Panelist, ACL 2022 Best Paper Award, CSRR at ACL 2022 1st Place, ALTA 2022 Shared Task Data Science Indonesia Award: Nominee for Data Researcher Awardee of Australia Awards Scholarship (out of 5300+ applicants) for PhD program (2018-2022) Patent US 2020/0082699 A1 \"Personal safety device and operating method therefor\" Patent US 2017/0177797 A1 \"Apparatus and method for sharing personal electronic - data of health\" Patent US 2016/0147387 A1 \"Method and apparatus for displaying summarized data\" Koto has published over 45 papers in top peer-reviewed NLP conferences and journals, including ACL, NAACL, EMNLP, EACL, AACL, COLING, and JAIR. Additionally, he has filed three US patents. Fajri Koto, Haonan Li, Sara Shatnawi, Jad Doughman, Abdelrahman Boda Sadallah, Aisha Alraeesi, Khalid Almubarak, Zaid Alyafeai, Neha Sengupta, Shady Shehata, Nizar Habash, Preslav Nakov, and Timothy Baldwin: \"ArabicMMLU: Assessing Massive Multitask Language Understanding in Arabic\". In Findings of ACL 2024. Fajri Koto, Tilman Beck, Zeerak Talat, Iryna Gurevych, and Timothy Baldwin: “Zero-shot Sentiment Analysis in Low-Resource Languages Using a Multilingual Sentiment Lexicon\". In Proceedings of EACL 2024. Chen Cecilia Liu, Fajri Koto, Timothy Baldwin, and Iryna Gurevych: \"Are Multilingual LLMs Culturally-Diverse Reasoners? An Investigation into Multicultural Proverbs and Sayings”. In Proceedings of the NAACL 2024. Fajri Koto, Nurul Aisyah, Haonan Li, and Timothy Baldwin: \"Large Language Models Only Pass Primary School Exams in Indonesia: A Comprehensive Test on IndoMMLU\". In Proceedings of EMNLP 2023. Fajri Koto, Timothy Baldwin, and Jey Han Lau: \"LipKey: A Large-Scale News Dataset for Absent Keyphrases Generation and Abstractive Summarization”. In Proceedings of COLING 2022. Fajri Koto, Jey Han Lau, and Timothy Baldwin: “Evaluating the Efficacy of Summarization Evaluation across Languages”. In Findings of ACL 2021. Fajri Koto, Jey Han Lau, and Timothy Baldwin: \"Top-down Discourse Parsing via Sequence Labelling\". In Proceedings of EACL 2021. Google Scholar Personal website Related Wednesday, July 30, 2025 Measuring cultural commonsense in the Arabic-speaking world with a new benchmark A team from MBZUAI and other institutions presented a new dataset at ACL, aiming to help AI… ACL benchmark culture Arabic language dataset nlp research natural language processing Read more Thursday, August 22, 2024 A new standard for evaluating Arabic language models presented at ACL MBZUAI's Fajri Koto explains why and how he and other researchers compiled the first benchmark dataset in… natural language processing acl 2024 Arabic LLM dataset llm nlp research Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 6302,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:00"
}