{
  "name": "Fakhri Karray",
  "homepage": "https://uwaterloo.ca/scholar/karray",
  "status": "success",
  "content": "Fakhri Karray | University of Waterloo Skip to main content THIS SITE Fakhri KarrayHOMEAI InstituteTeachingTutorialsResearchResearchBack Research ActivitiesProjectsPublicationsCall for PapersAcademicAcademicBack Editorial PositionsConferencesHonorsPAMI Center uWaterloo Admissions About Waterloo Faculties & academics Offices & services Support Waterloo COVID-19 Skip to main Skip to footer University of Waterloo Menu ProfessorLoblaws Research Chair in Artificial IntelligenceDepartment of Electrical and Computer EngineeringFounding Co-DirectorThe Waterloo Artificial Intelligence Institute Fakhri is the Loblaws Research Chair Professor in Artificial Intelligence in the department of electrical and computer engineering and is the founding co-director of the Waterloo AI Institute. He is the co-author of a textbook on applied artificial intelligence: Soft Computing and Intelligent Systems Design, Addison Wesley Publishing, 2004. He has authored extensively in the general field of pattern analysis and machine intelligence and has been issued 20 patents (US registered). He is the Associate Editor (AE) of the IEEE Transactions on Cybernetics, the IEEE Transactions on Neural Networks and Learning, and served as AE for the IEEE Transactions on Mechatronics, the IEEE Computational Intelligence Magazine. He also serves on the editorial board of the Elsevier Journal of Information Fusion, International Journal of Robotics and Automation, the Journal of Control and Intelligent Systems, and the Journal of Advances in Artificial Intelligence. Recent work of Fakhri and his research team on deep learning-based driver behaviour recognition and prediction has been featured on The Washington Post, Wired Magazine, Globe and Mail, CBC radio and Canada's Discovery Channel. He is the co-founder and Chief Scientist of Yourika.ai. He is a Fellow of the IEEE, a Fellow of the Canadian Academy of Engineering, a Fellow of the Engineering Institute of Canada and the President of the Association for Image and Machine Intelligence. He served as a Distinguished Lecturer for the IEEE and is a Fellow of the Kavli Frontiers of Science (a major research and symposium program of the US National Academy of Sciences)Recent areas of research include:Operational artificial intelligence and machine learningPredictive analytics with application to virtual  careMulti-sensor data fusionCognitive robotics and autonomous machinesSmart mobility and big data analyticsConcept extraction and natural speech understanding Search Contact E5 5029 519-888-4567, ext. 35584 karray@uwaterloo.ca University of Waterloo University of Waterloo 43.471468 -80.544205 200 University Avenue West Waterloo, ON, Canada N2L 3G1 +1 519 888 4567 Contact Waterloo Maps & Directions WatSAFE Accessibility Privacy Copyright Media Careers Feedback facebook twitter youtube instagram linkedin @uwaterloo social directory Log in",
  "content_length": 2893,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:00"
}