{
  "name": "Falk Howar",
  "homepage": "https://ls14-www.cs.tu-dortmund.de/cms/de/mitarbeiter/profs/Howar.html",
  "status": "success",
  "content": "Lehrstuhl 14 der Fakultät Informatik - SE - TU Dortmund Zur Navigation Zum Schnellzugriff Zum Fuß der Seite mit weiteren Services Zum Inhalt Lehrstuhl 14 für Software Engineering Fakultät für Informatik Der Lehrstuhl 14 der Fakultät für Informatik an der TU Dortmund beschäftigt sich mit der Lehre und Forschung in den Bereichen Softwarearchitektur, Geschäftsprozesse sowie den formalen und logischen Grundlagen des Software Engineerings. Diese Forschung dient außerdem als Grundlage für das verbundene Fraunhofer-Institut für Software- und Systemtechnik (ISST). Unser Lehrstuhl ist in drei Arbeitsgruppen aufgeteilt: Die AG SEAL wird vom Lehrstuhlinhaber Prof. Dr. Jakob Rehof geleitet. Die AG Virtual Machining wird von Prof. Dr.-Ing. Petra Wiederkehr geleitet. Die AG Automated Quality Assurance (AQUA) wird von Prof. Dr. Falk Howar geleitet. Prof. Dr. Jakob Rehof AG Software Engineering by Algorithms and Logic (SEAL) © SEAL Prof. Dr.-Ing. Petra Wiederkehr AG Virtual Machining (VM) © VM​/​TU Dortmund Prof. Dr. Falk Howar AG Automated Quality Assurance (AQUA) © Privat Die Arbeitsgruppe SEAL betreibt Forschung zu formaler Logik und Synthese, insbesondere durch Entwicklung formal verifizierter Synthesealgorithmen und deren Umsetzung im (CL)S-Framework. Anwendungen umfassen Forschungs- und Transferprojekte, z.B. zur Synthese von Steuersoftware für cyber-physische Systeme, Hardwaredesigns oder Simulationsmodellen von Fabriken. Die Lehre der Gruppe konzentriert sich auf das Zusammenspiel von Typtheorie und Logik sowie Konzepte der funktionalen Programmierung. Die Arbeitsgruppe VM beschäftigt sich mit der Modellierung, Simulation und Optimierung von realen Fertigungsprozessen. Die Themenschwerpunkte reichen von der Entwicklung von Prozessmodellen zur Beschreibung der geometrischen und physikalischen Eigenschaften über die Analyse von aufgenommenen Sensordaten bis hin zur Online-Anpassung von Prozessen direkt an der Werkzeugmaschine. Die Arbeitsgruppe AQUA forscht zu formalen Methoden im Software Engineering. Dazu gehören die Modellierung von Umgebungsbedingungen, das Formalisieren von Anforderungen, die Prüfung der Anforderungen in einer Umgebungen und die Unterstützung dieser Prozesse durch Werkzeuge, Prozesse und Standards. Die Lehre der Gruppe basiert auf den Forschungsthemen und vermittelt Kenntnisse zu formalen Methoden im Software-Engineering-Kontext. Zum Seitenanfang",
  "content_length": 2400,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:03"
}