{
  "name": "Fan Yao",
  "homepage": "http://fan-yao.com",
  "status": "success",
  "content": "Fan Yao - University of Central Florida I am an Associate professor in the Department of Electrical and Computer Engineering at University of Central Florida. I am leading the Computer Architecture and Systems Research (CASR) lab. My research interests are in the areas of computer architecture, security, machine learning, and energy efficient computing. For students: We have multiple PhD positions available. If you are interested in working with me, please contact me via fan.yao@ucf.edu. For more information, please visit our research group page. News Our work Phantom is accepted in USENIX Security 2025 (Jan. 2025). Our work DeepSteal is crowned as Top Picks in Hardware and Embedded Security 2024 (Jan. 2025). We released the PoC source for DeepVenom (S&P'24) in Github (Sept. 2024). Our work IvLeague is accepted in MICRO ’24. (July 2024) I will be serving in the TPC of HPCA ’2025. (July 2024) Our work WBP is accepted in ECCV ’24. (July 2024) Our work MetaLeak is accepted in ISCA ’24. (March 2024) Our work DeepVenom is accepted in IEEE S&P ’24. (March 2024) Our work PowSpectre is accepted in Asia CCS ’24. (March 2024) One paper is accepted in USENIX Security ’24. (March 2024) My NSF CAREER project is awarded, thanks NSF! (March 2024) I will be serving as the hardware security track chair for ACM GLSVLSI’24. (Jan. 2024) One US Patent has been granted(Jan. 2024) I will be serving as the general co-chair for SEED’24. (August 2023) One paper is accepted in ACM CCS’23. (May 2023) I will be serving as the artifact evaluation chair for IEEE IISWC’23. (May 2023) One paper is accepted in IEEE Micro. (Jan. 2023) Our work D-Shield is accepted in HPCA’23. (Oct. 2022) We released the PoC source for DeepSteal system exploit in Github (June 2022). Our work DeepSteal is accepted in IEEE S&P ’22 (Oakland). (March 2022) One paper is accepted in IEEE HOST ’22. (February 2022) LockedDown is accepted in IEEE EuroS&P ’22. (February 2022) Our collaborative work on far-field GPU EM side channels is accepted in IEEE S&P ’22 (Oakland). (November 2021) Fan is invited to serve in following committees: ISCA’22 (ERC) and DAC’22 (TPC). (October 2021) Our work BranchSpectre is accepted in IEEE Transactions on Computers. (October 2021) Two papers are accepted in SEED’21. (August 2021) Our work LADDER is accepted in MICRO’21. (July 2021) Fan will serve in the External Review Committee (ERC) of MICRO’21. Fan is invited to serve in the PC of the Inaugural IEEE SEED’21 conference. Fan will serve in the program committees of NAS’21, ICCD’21, IISWC’21, and SPSL@ISCA’21. One paper is accepted in DAC ’21 as work-in-progress (Feb. 2021). Our collaborative work on analysis of RAPL-based information leakage is accepted in AsiaCCS’21 (Oct. 2020). We released the PoC source for BranchSpec in Github (Oct. 2020). One recent work is accepted in ICCD ’20 (August 2020). We recieved an award from NSF CNS to explore side channel attacks and defenses in NVM-integrated computing systems (August 2020). We recieved an award from NSF SaTC to investigate ML security issues due to hardware-based model tampering (August 2020). Our work DeepHammer will appear in USENIX Security ’20 (March 2020). Fan will serve in the PC of ICCD ’20 (Feb. 2020). One paper accepted in SAC'20 (Dec. 2019). Fan will serve as a Program Committee member in HPCA’20 (Sept. 2019). COTSKnight will appear in IEEE Micro (June 2019). One paper is accepted in HPDC'19 (June 2019). Our paper (COTSKnight) is accepted in HOST'19 (Feb. 2019). Our research group got awarded with one Amazon AWS research grant, thanks Amazon! (Jan. 2019). Fan will serve as a Program Committee member in ICCD’19 (Nov. 2018). Fan attended the NSF CSR PI meeting at Seattle, WA (Sept. 2018). MORE Publications [MICRO'25] Rethinking Tiling and Dataflow for SpMM Acceleration: A Graph Transformation Framework, Amir Ghazizadeh Ahsaei, Lingxiang Yin, Shilin Tian, Fangzhou Ye, Fan Yao, and Hao Zheng, In IEEE/ACM International Symposium on Microarchitecture (MICRO), 2025. [USENIX'25] Phantom: Privacy-Preserving Deep Neural Network Model Obfuscation in Heterogeneous TEE and GPU System, Juyang Bai, Md Hafizul Islam Chowdhuryy, Jingtao Li, Fan Yao, Chaitali Chakrabarti and Deliang Fan, In USENIX Security 2025 [CCWC'25] RA-BNN: Constructing a Robust & Accurate Binary Neural Network Using a Novel Network Growth Mechanism to Defend Against BFA, Adnan Siraj Rakin, Li Yang, Jingtao Li, Fan Yao, Chaitali Chakrabarti, Yu Cao, Jae-sun Seo, Deliang Fan, In Annual Computing and Communication Workshop and Conference (CCWC), 2025 [MICRO'24] IvLeague: Side Channel-resistant Secure Architectures Using Isolated Domains of Dynamic Integrity Trees, Md Hafizul Chowdhuryy and Fan Yao, In IEEE/ACM International Symposium on Microarchitecture (MICRO), 2024. [ISCA'24] MetaLeak: Uncovering Side Channels in Secure Memory Architectures Exploiting Metadata, Md Hafizul Chowdhuryy, Hao Zheng and Fan Yao, In IEEE/ACM Annual International Symposium on Computer Architecture, 2024. [ECCV'24] WBP: Training-time Backdoor Attacks through Weight Bit Poisoning, Kunbei Cai, Zhenkai Zhang, Qian Lou and Fan Yao, In European Conference on Computer Vision , 2024. [S&P'24] DeepVenom: Persistent DNN Backdoors Exploiting Transient Weight Perturbations, Kunbei Cai, Md Hafizul Chowdhuryy, Zhenkai Zhang and Fan Yao, In IEEE Symposium on Security and Privacy, 2024. [AsiaCCS'24] PowSpectre: Powering Up Speculation Attacks with TSX-based Replay, Md Hafizul Chowdhuryy, Zhenkai Zhang and Fan Yao, In ACM ASIA Conference on Computer and Communications Security, 2024. (Acceptance rate: 19%) [DAC'24] VITA: ViT Acceleration for Efficient 3D Human Mesh Recovery via Hardware-Algorithm Co-Design, Shilin Tian, Chase Szafranski, Ce Zheng, Fan Yao, Ahmed Louri, Chen Chen, Hao Zhen, In ACM/IEEE Design Automation Conference, 2024. [USENIX'24] Invalidate+Compare: A Timer-Free GPU Cache Attack Primitive, Zhenkai Zhang, Kunbei Cai, Yanan Guo, Fan Yao and Xing Gao, In USENIX Security, 2024. [IISWC'23] Decepticon: Attacking Secrets of Transformers, Mujahid Al Rafi, Yuan Feng, Fan Yao, Meng Tang and Hyeran Jeon, In IEEE International Symposium on Workload Characterization, 2023. [PDF] [ICCAD'23] BeKnight: Guarding against Information Leakage in Speculatively Updated Branch Predictor, Md Hafizul Chowdhuryy, Zhenkai Zhang and Fan Yao, In IEEE/ACM International Conference on Computer-Aided Design, 2023. [PDF] [HPCA'23] D-Shield: Enabling Processor-side Encryption and Integrity Verification for Secure NVMe Drives, Md Hafizul Chowdhuryy, Myoungsoo Jung, Fan Yao and Amro Awad, In IEEE International Symposium on High-Performance Computer Architecture, 2023. [PDF] [CCS'23] TunneLs for Bootlegging: Fully Reverse-Engineering GPU TLBs for Fun and Challenging Isolation Guarantees of NVIDIA MIG, Zhenkai Zhang, Tyler Allen, Fan Yao, Xing Gao and Rong Ge, In ACM Conference on Computer and Communications Security, 2023. [PDF] [Micro'23] Understanding and Characterizing Side Channels Exploiting Phase Change Memories, Md Hafizul Chowdhuryy, Rickard Ewetz, Amro Awad and Fan Yao, In IEEE Micro, 2023. [PDF] [TCAD'23] STREAM: Towards READ-based In-Memory Computing for Streaming Based Processing for Data-Intensive Applications, M. Rashed, S. Thijssen, F. Yao, SK Jha and R. Ewetz, In IEEE Trans. on Computer-aided Design of Integrated Circuits and Systems, 2023. [S&P'22] DeepSteal: Advanced Model Extractions Leveraging Efficient Weight Stealing in Memories, Adnan Siraj Rakin+, Md Hafizul Chowdhuryy+, Fan Yao and Deliang Fan (+Co-first authors), In IEEE Symposium on Security and Privacy, 2022. [PDF] [S&P'22] Graphics Peeping Unit: Exploiting EM Side-Channel Information of GPUs to Eavesdrop on Your Neighbors, Zihao Zhan, Zhenkai Zhang, Sisheng Liang, Fan Yao and Xenofon Koutsoukos, In IEEE Symposium on Security and Privacy, 2022. [PDF] [HOST'22] On the Feasibility of Training-time Trojan Attacks Through Hardware-based Faults in Memory, Kunbei Cai, Zhenkai Zhang and Fan Yao, In IEEE International Symposium on Hardware Oriented Security and Trust, 2022. [PDF] [WOOT'22] CLAIRVOYANCE: Exploiting Far-field EM Emanations of GPU to âSeeâ Your DNN Models through Obstacles at a Distance, Sisheng Liang, Zihao Zhan, Fan Yao, Long Cheng and Zhenkai Zhang, In IEEE Workshop on Offensive Technologies colocated with IEEE S&P, 2022. [PDF] [EuroS&P'22] LockedDown: Exploiting Contention on Host-GPU PCIe Bus for Fun and Profit, Mert Side, Fan Yao and Zhenkai Zhang, In IEEE European Symposium on Security and Privacy, 2022. [PDF] [DATE'22] Hybrid Digial-Digital In-Memory Computing, M. Rashed, F. Yao, SK Jha and R. Ewetz, In Design Automation and Test in Europe Conference, 2022. [ASP-DAC'22] STREAM: Towards READ-based In-Memory Computing for Streaming based Data Processing, M. Rashed, S. Thijssen, F. Yao, SK Jha and R. Ewetz, In Asia and South Pacific Design Automation Conference, 2022. [MICRO'21] LADDER: Architecting Content and Location-aware Writes for Crossbar Resistive Memories, Md Hafizul Chowdhuryy, Muhammad R. Haq Rashed, Amro Awad, Rickard Ewetz and Fan Yao, In IEEE/ACM International Symposium on Microarchitecture, 2022. [PDF] [TC'21] Leaking Secrets through Modern Branch Predictor in the Speculative World, Md Hafizul Chowdhuryy and Fan Yao, In IEEE Transactions on Computers, 2021. [PDF] [Code] [TPAMI'21] T-BFA: Targeted Bit-Flip Adversarial Weight Attack, Adnan Siraj Rakin, Zhezhi He, Jingtao Li, Fan Yao, Chaitali Chakrabarti and Deliang Fan, In IEEE Transactions on Pattern Analysis and Machine Intelligence, 2021. [PDF] [SEED'21] NMT-Stroke: Diverting Neural Machine Translation through Hardware-based Faults, Kunbei Cai, Md Hafizul Chowdhuryy, Zhenkai Zhang and Fan Yao, In IEEE International Symposium on Secure and Private Execution Environment Design, 2021. [PDF] [SEED'21] R-SAW: New Side Channels Exploiting Read Asymmetry in MLC Phase Change Memories, Md Hafizul Chowdhuryy, Rickard Ewetz, Amro Awad and Fan Yao, In IEEE International Symposium on Se",
  "content_length": 18629,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:03"
}