{
  "name": "Fan Chen 0001",
  "homepage": "https://homes.luddy.indiana.edu/fc7",
  "status": "success",
  "content": "Fan Chen Fan Chen Assistant Professor Intelligent Systems Engineering School of Informatics and Computing Indiana University Bloomington Other Affiliations QSEc: IU-Quantum Science and Engineering Center LAIC: Luddy Artificial Intelligence Center Email: fc7@iu.edu Tel: (812) 855-0446 Office: MESH 113B 2425 N Milo B Sampson Ln Bloomington IN 47408 Google Map Faculty Profile Google Scholar LinkedIn dblp Biography Fan Chen is an assistant professor in the department of Intelligent Systems Engineering at the Indiana University Bloomington, and is affiliated with IU-Quantum Science and Engineering Center (QSEc) and Luddy Artificial Intelligence Center (LAIC). Dr. Chen received her Ph.D. from the department of Electrical and Computer Engineering at Duke University, her M.S. and B.S. from Tsinghua University and Xi’an Jiaotong University, China, respectively. Her research interests include Quantum Computing, Quantum Security, Environmentally Sustainable Computing, and Hardware Acceleration for Emerging Applications. Dr. Chen is the General Chair of IGSC 2025, the Technical Program Chair of GLSVLSI 2025, IGSC 2024, Posters Track Chair of QCE 2025/2024, Special Session Chair of ISVLSI 2024, chair of SIGDA University Booth at DAC 2022/2021, the Publication Chair of ISLPED 2022/2021, Web and Registration Chair of GLSVLSI 2022, Proceedings Chair of ASAP 2021, Arrangement Chair of GLSVLSI 2021. Dr. Chen is the Technical Program Committee members of over 20 international conference series. Dr. Chen served on the editorial board of IEEE Circuits and Systems Magazine (CAS-M) (2021-2023). She also serves as technical reviewers for over 30+ international conferences/journals, such as IEEE TC, IEEE TCAS-I, IEEE TNNLS, IEEE D&T, IEEE IoT-J, ACM TACO, ACM TODAES, ACM JETC, etc. Dr. Chen is a recipient of the 2024-25 Indiana University Bloomington Outstanding Junior Faculty Award, the 2022 NSF Faculty Early Career Development Program (CAREER) Award, the 2019 Cadence Women in Technology Scholarship. Her research has won the Best Paper Finalists at 2024 Design Automation Conference (DAC), the Best Paper Award (3rd Place) at 2023 IEEE International Conference on Quantum Computing and Engineering (QCE), the Best Paper Award and the Ph.D. forum Best Poster Award at 2018 Asia and South Pacific Design Automation Conference (ASP-DAC). Dr. Chen's contributions to the research community has been acknowledged by the 2024 ACM SIGDA Meritorious Service Award, the 2022 IEEE Best Associate Editor of the Circuits and Systems Society (CASS), and the 2021 Service Recognition Award of Great Lakes Symposium on VLSI (GLSVLSI). Research Interests Quantum Computing, Quantum Security Environmentally Sustainable Computing Accelerator Architecture Design for Emerging Applications I am looking for motivated PhD/master students. Please send me your CV/transcript if you are interested. Undergraduate research positions are also available through Undergraduate Research Opportunities in Computing (UROC) and Sustainability Scholars in Integrated Program in the Environment. Honors and Awards 2025   Indiana University Bloomington Outstanding Junior Faculty Award 2024   ACM SIGDA Meritorious Service Award 2024   DAC Best Paper Finalists 2023   QCE Best Paper Award - 3rd Place 2022   IEEE Best Associate Editor of the Circuits and Systems Society (CASS) 2022   NSF CAREER Award 2021   Service Recognition Award of GLSVLSI 2019   Cadence Women in Technology Scholorship 2018   ASP-DAC Best Paper Award 2018   ASP-DAC Ph.D. forum Best Poster Award Compute Credits 2025   IBM Quantum Credits ($35,000) 2024   IBM Quantum Credits ($70,000) 2023   IonQ Research Credits Program ($10,000) In the News Luddy Schoolâs Fan Chen wins Outstanding Junior Faculty Award (May 1, 2025) Chen earns NSF CAREER Award to advance research improving efficiency of genome sequencing (Jan 27, 2022) Professional Activities and Service Conference General Chair: General Chair, International Green and Sustainable Computing Conference (IGSC), 2025 Conference Technical Program Chair: TPC Chair, ACM Great Lakes Symposium on VLSI (GLSVLSI), 2025 TPC Chair, International Green and Sustainable Computing Conference (IGSC), 2024 Conference Organization Committee (Selected): Posters Track Co-Chair, IEEE International Conference on Quantum Computing and Engineering (QCE), 2024, 2025 Special Session Chair, IEEE Computer Society Annual Symposium on VLSI (ISVLSI), 2024 Vice chair/Chair, SIGDA University Booth at DAC (UBooth@DAC), 2021, 2022 Publication Chair, International Symposium on Low Power Electronics and Design (ISLPED), 2021, 2022 Web and Registration chair, ACM Great Lakes Symposium on VLSI (GLSVLSI), 2022 Publicity Chair, International Green and Sustainable Computing Conference (IGSC), 2022, 2023 Arrangement Chair, ACM Great Lakes Symposium on VLSI (GLSVLSI), 2021 Proceedings Chair, IEEE International Conference on Application-specific Systems, Architectures and Processors (ASAP), 2021 Session Chair, ACM Great Lakes Symposium on VLSI (GLSVLSI), 2020 Conference Technical Program Committee (Selected): Design Automation Conference (DAC) 2021, 2022, 2023, 2024, 2025 IEEE International Conference on Quantum Computing and Engineering (QCE), 2023, 2024, 2025 International Joint Conference on Neural Networks (IJCNN), 2024, 2025 Design, Automation & Test in Europe (DATE), 2025 International Conference on Computer-Aided Design (ICCAD), 2025 Asia and South Pacific Design Automation Conference (ASP-DAC), 2022, 2023, 2024 International Green and Sustainable Computing Conference (IGSC), 2021, 2022 IEEE Computer Society Annual Symposium on VLSI (ISVLSI), 2020, 2021 IEEE International Conference on Artificial Intelligence Circuits and Systems (AICAS), 2021 International Conference on Neural Information Processing (ICONIP), 2020 Journal Editorial: Editorial Board, IEEE Circuits and Systems Magazine (IEEE CAS-M), 2021-2023 Journal Reviewer (Selected): ACM Transactions on Architecture and Code Optimization (TACO) ACM Journal on Emerging Technologies in Computing (JETC) ACM Transactions on Design Automation of Electronic Systems (TODAES) IEEE Transactions on Computers (TC) IEEE Computer Architecture Letters (CAL) IEEE Transactions on Circuits and Systems I: Regular Papers (TCAS-I) IEEE Design and Test of Computers (Design & Test) IEEE Internet of Things (IoT) Journal (IoT-J) IEEE Transactions on Emerging Topics in Computing (TETC) IEEE Embedded Systems Letters (ESL) IEEE Transactions on Nanotechnology (TNANO) IEEE Transactions on Neural Networks and Learning Systems (TNNLS) IEEE Transactions on Biomedical Circuits and Systems (TBioCAS) Others: Organizing Committee,, NSF Principal Investigator (PI) Meeting of the Computer Systems Research (CSR), 2023 Scribe, NSF Workshop on Processing-In-Memory Technolog, 2021 Tutorial on “Efficient and Secure Hardware Accelerator for Deep Neural Networks”, In The workshop for Women in Hardware and Systems Security (WISE), 2021 Scribe, NSF Workshop on Machine Learning Hardware Breakthroughs, 2020",
  "content_length": 7045,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:02"
}