{
  "name": "Fan Zhang 0010",
  "homepage": "http://www.zjuisee.zju.edu.cn/fanzhang/site_en/index.htm",
  "status": "success",
  "content": "Fan Zhang's Homepage Welcome to Fan (Terry) Zhang's Homepage College of Information Science & Electronic Engineering Zhejiang University Home News Publication Research Teaching Information Students Fan (Terry) Zhang Associate Professor College of Information Science & Electronic Engineering Zhejiang University Room 603, Administration Building #38 Zheda Road, Hangzhou, 310027, P.R.China Email: fanzhang at zju.edu.cn Job Position To those who are intersted to join my group as Ph.D. or Postdoc, please click here. To those who are looking for financial aids to support their stay in China, please check here. Brief bio & research interests Prefessor Fan (Terry) Zhang was born in Hang Zhou, a beautiful city in China. After finishing his high school (HangZhou High School) in 1994, he studied Computer Science & Technology at Xi'an Jiaotong University in Shanxi Province, China. His thesis advisor was Professor Qinghua Zheng. In 2001, he was admitted by the School of Information Security and Engineering at Shanghai Jiaotong University in Shanghai, China. He finished his studies in 2004. His was supervised by Professor ShenSheng Zhang and co-supervised by Professor Dawu Gu. In 2011, he graduated from the Department of Computer Science and Engineering at University of Connecticut, USA. His major advisor was Professor Zhijie Jerry Shi. And his associate advisors were Professor Aggelos Kiayias and Professor Sanguthevar Rajasekaran. In 2014, he joined College of Information Science & Electronic Engineering at Zhejiang University. In 2016, he was a visiting scholar at School of Computing, National University of Singapore. He was hosted by Professor Zhenkai Liang. Since 2018, he is jointly appointed by Institute of Cyberspace Research, Zhejiang University, by Alibaba-Zhejiang University Joint Institute of Frontier Technologies, and by Zhejiang Lab. His major research interest is the general cyber security which includes hardware security, system security, network security and more. His special expertises are in the domain of side channel attacks (SCA) and countermeasures, fault attacks, cryptography, and computer architecture. Nowadays, his research interests move to the direction of combining SCA with binary analysis and network attacks, and some interesting topics in blockchain. Last updated date: Copyright©2019: Fan (Terry) Zhang",
  "content_length": 2357,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:03"
}