{
  "name": "Fan Wu 0006",
  "homepage": "http://www.cs.sjtu.edu.cn/~fwu",
  "status": "success",
  "content": "Dr. Fan Wu Fan Wu Home Biography Publications Professional Activities Projects Teaching Research Group Ph.D., Professor, and Department Head Department of Computer Science and Engineering Shanghai Jiao Tong University 3-537 SEIEE Building 800 Dongchuan Road Shanghai 200240, P.R. China Email: fwu@cs.sjtu.edu.cn Phone: +86-21-34206002 RECRUITING I am looking for well motivated students to work on cutting-edge research projects. Both undergraduate and graduate students are welcome! NEWS Mar. 2022 Our paper \"Walle: A Device-Cloud Collaborative Engineering System in Alibaba for Industrial-Strength Machine Learning Tasks\" is accepted to USENIX OSDI 2022. Aug. 2021 Our paper \"SMART: Screen-based Gesture Recognition on Commodity Mobile Devices\" is accepted to ACM MobiCom 2021. May 2021 Two papers are accepted to ACM SIGKDD 2021, including \"We Know What You Want: An Advertising Strategy Recommender System for Online Advertising\" and \"NeuralAuction: End-to-End Learning of Auction Mechanisms for E-Commerce Advertising\". Apr. 2021 Our paper \"Service Provisioning for UAV-Enabled Mobile Edge Computing\" is accepted to IEEE Journal on Selected Areas in Communications (JSAC). Feb. 2021 Our paper \"Strategy-Proof Online Mechanisms for Weighted AoI Minimization in Edge Computing\" is accepted to IEEE Journal on Selected Areas in Communications (JSAC). Dec. 2020 Our paper \"Robust Offloading Scheduling for Mobile Edge Computing\" is accepted to IEEE Transactions on Mobile Computing (TMC). Oct. 2020 Our paper \"Toward Verifiable and Privacy Preserving Machine Learning Prediction\" is accepted to IEEE Transactions on Dependable and Secure Computing (TDSC). Oct. 2020 Our paper \"On Designing Strategy-Proof Budget Feasible Online Mechanism for Mobile Crowdsensing with Time-Discounting Values\" is accepted to IEEE Transactions on Mobile Computing (TMC). Sept. 2020 Our paper \"From Server-Based to Client-Based Machine Learning: A Comprehensive Survey\" is accepted to ACM Computing Surveys (CSUR). Aug. 2020 Our paper \"Billion-Scale Federated Learning on Mobile Clients: A Submodel Design with Tunable Privacy\" is accepted to ACM MobiCom 2020. RESEARCH INTERESTS Mobile Computing and Intelligence, e.g., On-Device Machine Learning and Mobile Crowdsensing Algorithmic Network Economics, e.g., Game-Theoretic Incentives and Online Ad Exchange Data Management, e.g., Safe Data Sharing, Data Pricing, and Data Protection Network Resource Management, e.g., Wireless Spectrum Management and Bandwidth Management Wireless Networking, e.g., Mobile Networking, Ad Hoc Networking, and Wireless Mesh Networking Security, e.g., Privacy Preservation Distributed Computing, e.g., Peer-to-Peer Computing SELECTED PUBLICATIONS Renjie Gu, Chaoyue Niu, Fan Wu, Guihai Chen, Chun Hu, Chengfei Lyu, and Zhihua Wu, From Server-Based to Client-Based Machine Learning: A Comprehensive Survey, to appear in ACM Computing Surveys (CSUR), 2020. (Corresponding Author) Chaoyue Niu, Fan Wu, Shaojie Tang, Lifeng Hua, Rongfei Jia, Chengfei Lv, Zhihua Wu, and Guihai Chen, Billion-Scale Federated Learning on Mobile Clients: A Submodel Design with Tunable Privacy, in Proceedings of the 26th Annual ACM International Conference on Mobile Computing and Networking (MobiCom), online, Sept. 21-25, 2020. (Corresponding Author) Chaoyue Niu, Zhenzhe Zheng, Shaojie Tang, Fan Wu, and Guihai Chen, Online Pricing with Reserve Price Constraint for Personal Data Markets, to appear in IEEE Transactions on Knowledge and Data Engineering (TKDE), 2020. (Corresponding Author) Fan Wu, Shuo Yang, Zhenzhe Zheng, Shaojie Tang, and Guihai Chen, Fine-Grained User Profiling for Personalized Task Matching in Mobile Crowdsensing, to appear in IEEE Transactions on Mobile Computing (TMC), 2020. (Corresponding Author) Youjing Lu, Fan Wu, Shaojie Tang, Linghe Kong, and Guihai Chen, FREE: A Fast and Robust Key Extraction Mechanism via Inaudible Acoustic Signal, in Proceedings of the 20th ACM International Symposium on Mobile Ad Hoc Networking and Computing (MobiHoc), Catania, Italy, Jul. 2-5, 2019. (Corresponding Author) Chaoyue Niu, Zhenzhe Zheng, Shaojie Tang, Xiaofeng Gao, and Fan Wu, Making Big Money from Small Sensors: Trading Time-Series Data under Pufferfish Privacy, in Proceedings of the 38th Annual IEEE International Conference on Computer Communications (INFOCOM), Paris, France, Apr. 29-May 2, 2019. (Corresponding Author) Weichao Mao, Zhenzhe Zheng, and Fan Wu, Pricing for Revenue Maximization in IoT Data Markets: An Information Design Perspective, in Proceedings of the 38th Annual IEEE International Conference on Computer Communications (INFOCOM), Paris, France, Apr. 29-May 2, 2019. (Corresponding Author) Zhenzhe Zheng, Yanqing Peng, Fan Wu, Shaojie Tang, and Guihai Chen, ARETE: On Designing Joint Online Pricing and Reward Sharing Mechanisms for Mobile Data Markets, to appear in IEEE Transactions on Mobile Computing (TMC). (Corresponding Author) Shuo Yang, Dan Peng, Tong Meng, Fan Wu, Guihai Chen, Shaojie Tang, Zhenhua Li, and Tie Luo, On Designing Distributed Auction Mechanisms for Wireless Spectrum Allocation, to appear in IEEE Transactions on Mobile Computing (TMC). (Corresponding Author) Chaoyue Niu, Zhenzhe Zheng, Fan Wu, Xiaofeng Gao, and Guihai Chen, Achieving Data Truthfulness and Privacy Preservation in Data Markets, IEEE Transactions on Knowledge and Data Engineering (TKDE), Volume 31, Issue 1, Pages 105-119, Jan. 2019. (Corresponding Author) Chaoyue Niu, Zhenzhe Zheng, Fan Wu, Shaojie Tang, Xiaofeng Gao, and Guihai Chen, Unlocking the Value of Privacy: Trading Aggregate Statistics over Private Correlated Data, in Proceedings of the 2018 ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), London, UK, Aug. 19-23, 2018. (Corresponding Author) Fan Wu, Tong Meng, Aijing Li, Guihai Chen, and Nitin H. Vaidya, Have You Recorded My Voice: Towards Robust Neighbor Discovery in Mobile Wireless Networks, IEEE/ACM Transactions on Networking (TON), Volume 26, Issue 3, Pages 1432-1445, Jun. 2018. (Corresponding Author) Shuo Yang, Kunyan Han, Zhenzhe Zheng, Shaojie Tang, and Fan Wu, Towards Personalized Task Matching in Mobile Crowdsensing via Fine-Grained User Profiling, in Proceedings of the 37th Annual IEEE International Conference on Computer Communications (INFOCOM), Honolulu, HI, USA, April 15-19, 2018. (Corresponding Author) Chaoli Zhang, Fan Wu, Xiaofeng Gao, and Guihai Chen, Free Talk in The Air: A Hierarchical Topology for 60GHz Wireless Data Center Networks, IEEE/ACM Transactions on Networking (TON), Volume 25, Issue 6, Pages 3723-3737, Dec. 2017. (Corresponding Author) Dan Peng, Fan Wu, and Guihai Chen, Data Quality Guided Incentive Mechanism Design for Crowdsensing, IEEE Transactions on Mobile Computing (TMC), Volume 17, Issue 2, Pages 307-319, Feb. 2018. (Corresponding Author) Zhenzhe Zheng, Fan Wu, Xiaofeng Gao, Hongzi Zhu, Shaojie Tang, and Guihai Chen, A Budget Feasible Incentive Mechanism for Weighted Coverage Maximization in Mobile Crowdsensing, IEEE Transactions on Mobile Computing (TMC), Volume 16, Issue 9, Pages 2392-2407, Sept. 2017. (Corresponding Author) Zhenzhe Zheng, Yanqing Peng, Fan Wu, Shaojie Tang, and Guihai Chen, An Online Pricing Mechanism for Mobile Crowdsensing Data Markets, in Proceedings of the 18th ACM International Symposium on Mobile Ad Hoc Networking and Computing (MobiHoc), Madras, Chennai, India, Jul. 10-13, 2017. (Corresponding Author) Shuo Yang, Fan Wu, Shaojie Tang, Xiaofeng Gao, Bo Yang, and Guihai Chen, On Designing Data Quality-Aware Truth Estimation and Surplus Sharing Method for Mobile Crowdsensing, IEEE Journal on Selected Areas in Communications (JSAC) Special Issue on Human-In-The-Loop Mobile Networks, Volume 35, Issue 4, Pages 1-16, Apr. 2017. (Corresponding Author) Zhenzhe Zheng, Yanqing Peng, Fan Wu, Shaojie Tang, and Guihai Chen, Trading Data in the Crowd: Profit-Driven Data Acquisition for Mobile Crowdsensing, to appear in IEEE Journal on Selected Areas in Communications (JSAC) Special Issue on Game Theory for Networks, Volume 34, Issue 10, Pages 2589-2604, Oct. 2016. (Corresponding Author) Fan Wu, Tianrong Zhang, Chunming Qiao, and Guihai Chen, A Strategy-Proof Auction Mechanism for Adaptive-Width Channel Allocation in Wireless Networks, IEEE Journal on Selected Areas in Communications (JSAC) Special Issue on Spectrum Sharing and Aggregation for Future Wireless Networks, Volume 34, Issue 10, Pages 2678-2689, Oct. 2016. Dongxin Liu, Fan Wu, Linghe Kong, Shaojie Tang, Yuan Luo, and Guihai Chen, Training-Free Indoor White Space Exploration, IEEE Journal on Selected Areas in Communications (JSAC) Special Issue on Spectrum Sharing and Aggregation for Future Wireless Networks, Volume 34, Issue 10, Pages 2589-2604, Oct. 2016. (Corresponding Author) Fan Wu, Dongxin Liu, Zhihao Wu, Yuan Zhang, and Guihai Chen, Cost-Efficient Indoor White Space Exploration Through Compressive Sensing, IEEE/ACM Transactions on Networking (TON), Volume 25, Issue 3, Pages 1686-1702, Jun. 2017. Zhenzhe Zheng, Fan Wu, Shaojie Tang, and Guihai Chen, AEGIS: An Unknown Combinatorial Auction Mechanism Framework for Heterogeneous Spectrum Redistribution in Non-Cooperative Wireless Networks, IEEE/ACM Transactions on Networking (TON), Volume 24, Issue 3, Pages 1919-1932, Jun. 2016. (Corresponding Author) Qianyi Huang, Yang Gui, Fan Wu, Guihai Chen, and Qian Zhang, A General Privacy Preserving Auction Mechanism for Secondary Spectrum Markets, IEEE/ACM Transactions on Networking (TON), Volume 24, Issue 3, Pages 1881-1893, Jun. 2016. (Corresponding Author) Tong Meng, Fan Wu, Aijing Li, Guihai Chen, and Nitin H. Vaidya, On Robust Neighbor Discovery in Mobile Wireless Networks, in Proceedings of the 11th International Conference on emerging Networking EXperiments and Technologies (CoNEXT), Heidelberg, Germany, Dec. 1-4, 2015. (Corresponding Author) Dongxin Liu, Zhihao Wu, Fan Wu, Yuan Zhang, and Guihai Chen, FIWEX: Compressive Sensing Based Cost-Efficient Indoor White Space Exploration, in Pro",
  "content_length": 16275,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:03"
}