{
  "name": "Fan Long",
  "homepage": "http://www.cs.toronto.edu/~fanl",
  "status": "success",
  "content": "Fan Long | Computer Science @ University of Toronto Fan Long Associate Professor Department of Computer Science University of Toronto Bahen Centre for Information Technology, BA3250 📧 fanl [at] cs [dot] toronto [dot] edu 📞 416-978-6055 🎓 Prospective Students 📚 Google Scholar 📄 CV About Research Interests & Recent Updates Research Focus My research interests span programming languages, software engineering, systems security, and blockchain technology. I am actively involved in the Conflux project for building the next generation blockchain platform. Bio Conflux Network Recent News Our paper on how to build multi-VM blockchain accepted to OOPSLA 2025. Paper accepted to ICML 2025 on LLM Type Inference Benchmark! 🚀 Join My Research Lab I am actively recruiting motivated graduate students to work on cutting-edge research in blockchain, AI-powered software engineering, and systems security. View Research Areas Instructions to Contact Me Research Projects Here lists active research projects of my research group. If you are interested in my past research, see this page. 🔧 AI for Software Engineering Machine Learning Software Engineering Automation Leveraging cutting-edge machine learning and large language models to enhance software development automation, reliability, and security. Reliable Automation Combining large language models with formal verification methods to achieve reliable and trustworthy automation in software engineering tasks. Security in LLM Generated Code Investigating security vulnerabilities in LLM-generated code to address emerging challenges in the era of AI-assisted software development. ⛓️ Blockchain Scalability Active High Impact Industry Partnership Building next-generation blockchain systems that can process thousands of transactions per second while maintaining decentralization and security. Our work addresses the fundamental performance bottlenecks in current blockchain systems. Conflux A fast, scalable, and decentralized blockchain system using DAG structure and novel consensus protocol. LVMT LVMT's multi-layer authenticated storage system with vector commitments achieves 2.7x higher blockchain transaction throughput. New Privacy Enabled Blockchains We are working on new blockchain systems that integrate ZKP or MPC techniques to enhance privacy. 🔐 Smart Contract Security Security Formal Methods DeFi Developing techniques to secure smart contracts against vulnerabilities that lead to significant financial losses. Our tools prevent exploits before deployment. FlashSyn FlashSyn's synthesis-via-approximation technique automatically generates flash loan attacks on DeFi protocols, succeeding on 16/18 benchmarks. Trace2Inv Trace2Inv mines and composes smart-contract runtime invariants from historical transaction traces to proactively block attacks—stopping up to 23/27 real-world exploits with ~0.28% false positives and minimal gas overhead. OVer OVer automatically detects and prevents oracle manipulation in DeFi smart contracts by analyzing skewed inputs, computing safe parameter ranges, and synthesizing guards, outperforming prior defenses while finishing in seconds on real protocols. Selected and Recent Publications Here are selected and recent pulications. Full publication list is in this page. TypyBench: Evaluating LLM Type Inference for Untyped Python Repositories Honghua Dong, Jiacheng Yang, Xun Deng, Yuhe Jiang, Gennady Pekhimenko, Fan Long, Xujie Si ICML 2025 [PDF] Demystifying Invariant Effectiveness for Securing Smart Contracts Zhiyang Chen, Ye Liu, Sidi Mohamed Beillahi, Yi Li, and Fan Long FSE 2024 [PDF] Flashsyn: Flash Loan Attack Synthesis via Counter Example Driven Approximation Zhiyang Chen, Sidi Mohamed Beillahi, and Fan Long ICSE 2024 [PDF] Safeguarding DeFi Smart Contracts Against Oracle Deviations Xun Deng, Sidi Mohamed Beillahi, Cyrus Minwalla, Han Du, Andreas Veneris, and Fan Long ICSE 2024 (Distinguished Paper) [PDF] LVMT: An Efficient Authenticated Storage for Blockchain Chenxing Li, Sidi Mohamed Beillahi, Guang Yang, Ming Wu, Wei Xu, and Fan Long USENIX OSDI 2023 [PDF] A Decentralized Blockchain with High Throughput and Fast Confirmation Chenxing Li, Peilun Li, Dong Zhou, Zhe Yang, Ming Wu, Guang Yang, Wei Xu, Fan Long, and Andrew Chi-Chih Yao USENIX ATC 2020 [PDF]",
  "content_length": 4313,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:03"
}