{
  "name": "Fang Liu 0001",
  "homepage": "https://web.xidian.edu.cn/fliu",
  "status": "success",
  "content": "刘芳 | 个人信息 | 西安电子科技大学个人主页 学术信息网 西电导航 关于 使用说明 搜索 系统首页 登录 控制面板 收藏 刘芳的留言板 刘芳的主页:个人信息科学研究学术成果荣誉奖励科研团队课程教学招生信息English 基本信息刘芳　二级教授硕士/博士生导师博士学科：(081203)计算机应用技术硕士学科：(081203)计算机应用技术工作单位：人工智能学院联系方式通信地址：西安电子科技大学224信箱 电子邮箱：f63liu@163.com 办公地点：主楼II区2层228 个人简介        刘芳，女，二级教授，博士生导师，享受国务院特殊津贴的专家，国家自然科学奖获得者，建国七十周年奖章获得者，IEEE高级会员，现为西安电子科技大学华山特聘教授和学术带头人，主要研究方向包括大数据感知与模式识别、机器学习与智能图像处理、多模态学习与因果推理等。目前，刘芳教授的谷歌学术引用量为37000+、H指数为86、i10指数为610+，入选2023年、2024年全球前2%顶尖科学家榜单。在领域内主流期刊（TPAMI、TNNLS、TIP、TCYB、TCSVT、TMM、IF、TGRS、PR、KBS等）和会议（CVPR、ICCV、AAAI、ECCV、ACM MM等）上以通讯作者发表论文数十篇，以第一完成人获国家发明专利100余项，获省部级一等奖励以上成果10余项，培养的博士和硕士多人入选省级、一级学会优秀论文，数十人获国家相关人才计划支持，所指导的学生在领域内主流竞赛（CVPR、ICCV、ECCV、IGRSS等）获得100余项冠亚季军。        刘芳教授长期致力于人工智能核心算法的研究，所开展的基于自然启发的智能优化算法获得国家自然科学二等奖，这是从人类进化的可解释性角度的典型代表性工作，其中特别是针对高维奇异点的检测和识别难题，这也是模型攻击与安全性研究的核心，从表征、学习、优化等角度提出了系列启发式的有效解决办法。刘芳教授参加了包括“973”、国家自然科学基金重点项目等国家科研项目，同时承担和完成了包括“863”、国家自然科学基金和基础科研基金等二十余项国家科研任务，获2004年陕西省创新能手、获陕西省科学技术进步二等奖（1998年）、国家教育部科技进步二等奖（1999年）、2008年陕西省科学技术一等奖、2009年国家教育部自然科学奖一等奖、2009年陕西省高等学校科学技术奖一等奖、2010年陕西省科学技术奖一等奖、2011年教育部高等学校技术发明奖二等奖、2011年中国电子学会电子信息科学技术奖 二等奖、2012年陕西省科学技术奖一等奖、2017年陕西省科学技术奖一等奖和2013年国家自然科学奖二等奖等多项科技奖励。        刘芳教授合作出版了《免疫优化计算、学习与识别》、《智能数据挖掘与知识发现》、《图像多尺度几何分析理论与应用——后小波分析理论与应用》、《自然计算、机器学习与图像理解前沿》、《智能SAR图像处理与解译》、《高分辨遥感影像学习与识别》、《稀疏学习、分类与识别》、《认知计算与多目标优化》、《量子计算、优化与学习》、《深度学习、优化与识别》、《遥感影像深度学习智能解译与识别》、《模式识别》、《简明人工智能》、《人工智能、类脑计算与图像解译前沿》、《遥感脑理论及应用》和《深度学习的理论基础与核心算法》等专著。新闻动态：2025年08月22日，IEEE Transactions on Multimedia +1，恭喜博士生王浩；2025年08月18日，IEEE Transactions on Circuits and Systems for Video Technology +1，恭喜博士生鲍骞月；2025年08月04日，IEEE Transactions on Geoscience and Remote Sensing +1，恭喜李硕博士和本科生冀浩洋；2025年08月01日，恭喜博士后李硕获得2025年陕西省计算机学会优秀博士学位论文; 2025年07月15日，Information Fusion +1，恭喜博士生王浩； 2025年07月05日，ACM MM 2025 +2，恭喜李硕博士和本科生刘星辰，恭喜博士生王佳豪； 2025年06月26日，ICCV 2025 +2，恭喜硕士生缑雪健，恭喜博士生吴兆阳； 2025年06月17日，IEEE Transactions on Pattern Analysis and Machine Intelligence +1，恭喜博士生鲍骞月；2025年06月11日，Pattern Recognition +1，恭喜博士生王梦佳；2025年05月29日，IEEE Transactions on Multimedia +1，恭喜博士生王佳豪；2025年05月27日，IEEE Transactions on Neural Networks and Learning Systems +1，恭喜博士生刘洋；2025年05月07日，IEEE Transactions on Geoscience and Remote Sensing +1，恭喜博士生王佳豪；2025年05月04日，IEEE Transactions on Multimedia +1，恭喜博士生王佳豪；2025年04月24日，Pattern Recognition +1，恭喜博士生王浩；2025年02月27日，CVPR 2025 +1，恭喜李硕博士；2025年02月24日，IEEE Transactions on Multimedia +1，恭喜博士生鲍骞月；2025年02月06日，Knowledge-Based Systems +1，恭喜博士生李鹏芳；2025年02月06日，Pattern Recognition +1，恭喜博士生刘洋；2025年01月02日，IEEE Transactions on Circuits and Systems for Video Technology +1，恭喜李硕博士；近年来部分论文（本人均为通讯作者， 谷歌学术，DBLP）：Hao Wang, Fang Liu*, Licheng Jiao, Jiahao Wang, Shuo Li, Lingling Li, Puhua Chen, Xu Liu. Learning to Prompt with Refining Text Knowledge for Zero-shot Video Action Recognition[J]. IEEE Transactions on Multimedia, 2025. [NEW]Qianyue Bao, Fang Liu*, Licheng Jiao, Yang Liu, Shuo Li, Lingling Li, Xu Liu, Puhua Chen, Wenping Ma. ERFC: Energy-Aware Reinforcement Feedback Calibration for Zero-shot Captioning[J]. IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2025. https://doi.org/10.1109/TCSVT.2025.3601180. [NEW]Shuo Li, Haoyang Ji, Fang Liu*, Licheng Jiao, Xutong Min, Xinyan Huang, Jiahao Wang, Long Sun, Lingling Li, Xu Liu. Fine-Grained Visual-Language Alignment for Remote Sensing Image-Text Retrieval[J]. IEEE Transactions on Geoscience and Remote Sensing (TGRS), 2025. http://doi.org/10.1109/TGRS.2025.3596333. [NEW]Hao Wang, Fang Liu*, Licheng Jiao, Jiahao Wang, Shuo Li, Lingling Li, Puhua Chen, Xu Liu, Wenping Ma. Multi-level vision language interaction learning for cross-model retrieval[J]. Information Fusion, 2025. https://doi.org/10.1016/j.inffus.2025.103481. [NEW]Jiahao Wang, Fang Liu*, Licheng Jiao, Hao Wang, Shuo Li, Lingling Li, Puhua Chen, Xu Liu, Xinyi Wang. FA3T: Feature-Aware Adversarial Attacks for Multi-modal Tracking[C]//The 33rd ACM International Conference on Multimedia (ACM MM 2025). 2025. [NEW]Shuo Li, Xingchen Liu, Fang Liu*, Licheng Jiao, Jiahao Wang, Xinyan Huang, Yanbiao Ma, Puhua Chen, Lingling Li, Xu Liu, Xuejian Gou. Imagining Vision From Language for Few-Shot Class-Incremental Learning[C]//The 33rd ACM International Conference on Multimedia (ACM MM 2025). 2025. [NEW] Xuejian Gou, Fang Liu*, Licheng Jiao, Shuo Li, Lingling Li, Hao Wang, Xu Liu, Puhua Chen, Wenping Ma. Knowledge-Guided Part Segmentation[C]//International Conference on Computer Vision (ICCV 2025), 2025. [NEW] Zhaoyang Wu, Fang Liu*, Licheng Jiao, Shuo Li, Lingling Li, Xu Liu, Puhua Chen, Wenping Ma. Hierarchical Variational Test-Time Prompt Generation for Zero-Shot Generalization[C]//International Conference on Computer Vision (ICCV 2025), 2025. [NEW]Mengjia Wang, Fang Liu*, Licheng Jiao, Shuo Li, Lingling Li, Puhua Chen, Xu Liu, Wenping Ma. VCGPrompt: Visual Concept Graph-Aware Prompt Learning for Vision-Language Models[J]. Pattern Recognition, 2025.  https://doi.org/10.1016/j.patcog.2025.112012. [NEW]Qianyue Bao, Fang Liu*, Licheng Jiao, Yang Liu, Shuo Li, Lingling Li, Xu Liu, Puhua Chen. Visual-Language Scene-Relation-Aware Zero-Shot Captioner[J]. IEEE Transactions on Pattern Analysis and Machine Intelligence, 2025. https://doi.org/10.1109/TPAMI.2025.3581174. [NEW]Jiahao Wang, Fang Liu*, Licheng Jiao, Hao Wang, Shuo Li, Yanbiao Ma, Lingling Li, Puhua Chen, Xu Liu, Mengjia Wang. Adaptive Visual Prompting for Effective Satellite Video Tracking[J]. IEEE Transactions on Multimedia, 2025. [NEW]Yang Liu, Fang Liu*, Licheng Jiao, Qianyue Bao, Shuo Li, Lingling Li, Xu Liu, Puhua Chen, Wenping Ma. Chain-of-Situation Aware Progressive Inference Learning[J]. IEEE Transactions on Neural Networks and Learning Systems, 2025. https://doi.org/10.1109/TNNLS.2025.3576486. [NEW]Jiahao Wang, Fang Liu*, Licheng Jiao, Hao Wang, Shuo Li, Lingling Li, Puhua Chen, Xu Liu, Wenping Ma, Xinyi Wang. Adaptive Multi-modal Visual Tracking with Dynamic Semantic Prompts[J]. IEEE Transactions on Multimedia, 2025. [NEW]Qianyue Bao, Fang Liu*, Licheng Jiao, Yang Liu, Shuo Li, Lingling Li, Xu Liu, Xinyi Wang, Baoliang Chen. Anomaly-Led Prompting Learning Caption Generating Model and Benchmark[J]. IEEE Transactions on Multimedia, 2025. [NEW]Fang Liu*, Jiahao  Wang, Licheng Jiao, Jie Zhang,  Hao Wang, Shuo Li, Lingling Li, Puhua Chen, Xu Liu, Wenping Ma, Shuang Wang, Shuyuan Yang, Xiangrong  Zhang, Yaoyang  Du, Qianyue  Bao, Long Sun, Biao Hou. Remote Sensing Video Tracking: Current Status, Challenges and Future. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 2025. https://doi.org/10.1109/JSTARS.2025.3573572. [NEW]Hao Wang, Fang Liu*, Licheng Jiao, Jiahao Wang, Shuo Li, Lingling Li, Puhua Chen, Xu Liu, Wenping Ma. VLPA-CLIP: Video Language Prompting and Adapting CLIP for efficient video action recognition[J]. Pattern Recognition, 2025, https://doi.org/10.1016/j.patcog.2025.111770. [NEW]Jiahao Wang, Fang Liu*, Licheng Jiao, Hao Wang, Shuo Li, Lingling Li, Puhua Chen, Xu Liu, Wenping Ma. Change Knowledge-Guided Vision-Language Remote Sensing Change Detection[J]. IEEE Transactions on Geoscience and Remote Sensing, 2025. https://doi.org/10.1109/TGRS.2025.3568521. [NEW] Shuo Li, Fang Liu*, Zehua Hao, Xinyi Wang, Lingling Li, Xu Liu, Puhua Chen, Wenping Ma. Logits DeConfusion with CLIP for Few-Shot Learning[C]//Proceedings of the Computer Vision and Pattern Recognition Conference (CVPR 2025). 2025: 25411-25421. [NEW]Yang Liu, Fang Liu*, Licheng Jiao, Qianyue Bao, Shuo Li, Lingling Li, Xu Liu. Knowledge-Driven Compositional action recognition[J]. Pattern Recognition, https://doi.org/10.1016/j.patcog.2025.111452, 2025. [NEW]Pengfang Li, Fang Liu*, Licheng Jiao, Shuo Li, Xu Liu, Puhua Chen, Lingling Li, Zehua Hao. LLM Knowledge-Driven Target Prototype Learning for Few-Shot Segmentation[J]. Knowledge-Based Systems, https://doi.org/10.1016/j.knosys.2025.113149, 2025. [NEW]Shuo Li, Fang Liu*, Licheng Jiao, Lingling Li, Puhua Chen, Xu Liu, Wenping Ma. Prompt-Based Concept Learning for Few-Shot Class-Incremental Learning[J]. IEEE Transactions on Circuits and Systems for Video Technology, https://doi.org/10.1109/TCSVT.2025.3525545, 2025. [NEW]Zehua Hao, Fang Liu*, Licheng Jiao, Yaoyang Du, Shuo Li, Hao Wang, Pengfang Li, Xu Liu, Puhua Chen. Preserving text space integrity for robust compositional zero-shot learning via mixture of pretrained experts[J]. Neurocomputing, https://doi.org/10.1016/j.neucom.2024.128773, 2025. [NEW]Yaoyang Du, Fang Liu*, Licheng Jiao, Shuo Li, Zehua Hao, Pengfang Li, Jiahao Wang, Hao Wang, Xu Liu. Text generation and multi-modal knowledge transfer for few-shot object detection[J]. Pattern Recognition, https://doi.org/10.1016/j.patcog.2024.111283, 2024. Jiahao Wang, Fang Liu*, Licheng Jiao, Yingjia Gao, Hao Wang, Shuo Li, Lingling Li, Puhua Chen, Xu Liu. Visual and Language Collaborative Learning for RGBT Object Tracking[J]. IEEE Transactions on Circuits and Systems for Video Technology, https://doi.org/10.1109/TCSVT.2024.3436878, 2024. Jiahao Wang, Fang Liu*, Licheng Jiao, Hao Wang, Shuo Li, Lingling Li, Puhua Chen, Xu Liu. Multi-modal visual tracking based on textual generation[J]. Information Fusion, https://doi.org/10.1016/j.inffus.2024.102531, 2024. Shuo Li, Fang Liu*, Licheng Jiao, Xu Liu, Puhua Chen, Lingling Li. Mask-Guided Correlation Learning for Few-Shot Segmentation in Remote Sensing Imagery[J]. IEEE Transactions on Geoscience and Remote Sensing, https://doi.org/10.1109/TGRS.2024.3417965, 2024. Yang Liu, Fang Liu*, Licheng Jiao, Qianyue Bao, Long Sun, Shuo Li, Lingling Li, Xu Liu. Multi-grained Gradual Inference Model for Multimedia Event Extraction[J]. IEEE Transactions on Circuits and Systems for Video Technology, 2024. Yang Liu, Fang Liu*, Licheng Jiao, Qianyue Bao, Lingling Li, Yuwei Guo, Puhua Chen. A Knowledge-based Hierarchical Causal Inference Network for Video Action Recognition[J]. IEEE Transactions on Multimedia, 2024.  Jiahao Wang, Fang Liu*, Licheng Jiao, Yingjia Gao, Hao Wang, Lingling Li, Puhua Chen, Xu Liu and Shuo Li. Satellite Video Object Tracking based on Location Prompts[J].",
  "content_length": 16271,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:04"
}