{
  "name": "Fani Deligianni",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/fanideligianni",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Fani Deligianni Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Fani DeligianniMr Ethan KellyZhen Tian Dr Fani Deligianni Senior Lecturer (Computing Science) email: Fani.Deligianni@glasgow.ac.uk pronouns: She/her/hers 321b Sir Alwyn Williams Building, School of Computing Science, Glasgow University, G12 8RZ Import to contacts https://orcid.org/0000-0003-1306-5017 Biography Dr Fani Deligianni’s holds a PhD in Medical Image Computing (Imperial College London), an MSc in Advanced Computing (Imperial College London), an MSc in Neuroscience (University College London) and a MEng (equivalent) in Electrical and Computer Engineering (Aristotle University, Greece). Her PhD work was on augmenting 3D reconstructed models of the bronchial tree with 2D video images acquired during bronchoscopy. Bronchial deformation was modelled based on Active Shape Models (ASM) and a predictive tracking algorithm was incorporated to improve tracking of the endoscopic camera. Her track record includes more than 70 peer-reviewed papers/abstracts/book chapters (25 journals, 4 book chapters) and it has been impactful in the machine learning for healthcare applications, along with medical imaging analysis community as it is reflected by her google scholar h-index 25 and more than 4000 citations. She has received substantial funding from MRC, EPSRC, Royal Society and Academy of Medical Sciences to develop machine learning algorithms to analyse medical images, human motion and neurophysiological data to improve risk prediction and diagnosis of diseases. Furthermore, she investigates machine learning approaches for privacy preservation and digital twins in healthcare. Research interests She is part of the Information, Data & Analysis Section (IDA) section. I lead the Biomedical AI and Imaging Lab which specialises on machine learning approaches to analyse medical images, neuro-physiological signals and human motion. I am also a member of the Computing Technologies for Healthcare theme at the School of Computing Science and the healthcare theme lead and supervisor for EPSRC Centre for Doctoral Training in Diversity led, mission-driven research. I am also coordinating the GWiCS - Glasgow Women in Computing group. My interests include: Medical image computing Statistical machine learning, Human Motion Analysis Neuroimage analysis and Brain Connectivity Deep Learning in Healthcare Applications Clinical Decision Support Systems For more information visit: Google Scholar Personal Webpage Biomedical AI and Imaging Lab GitHub Page Datasets at Open Science Framework News/Events: We are thrilled to announce that our workshop proposal on 'Privacy, Fairness, Accountability and Transparency in Computer Vision' has been officially accepted for presentation at the British Machine Vision Conference (BMVC). PhD/EngD Students: Tahani Aladwani (co-supervise with Christos Anagnostopoulos) Fransesco Dala Serra (co-supervise with Alison ONeil/Canon Medical and Jeff Dalton, PI) Long Qianyu (co-supervise with Christos Anagnostopoulos) Fatima Ghanduri (co-supervise with Christos Anagnostopoulos) Narinder Kaur (co-supervise with Pierpaolo Pelicori, John Cleland) Muhammet Alkan (co-supervise with Ke Yuan, PI) Nicole Lai (co-supervise with Marios Philiastides, PI) Dominik Szczepaniak (co-supervise with Monika Harvey, PI) Qianying Liu (co-supervise with Christos Anagnostopoulos, PI) Kaushik Bhargav Sivangi (co-supervise with Paul Henderson, PI) Yiling Hu (co-supervise with David Porter) Harry Clark (co-supervise with Gregor Thut and Marios Philiastides, PI) Zain Hussain (co-supervise with Jonathan Cavanagh and Craig Ritchie) RAs/Honorary RAs/Fellows: Idris Zakariyya Xiao Gu Alumni: Hester Huijsdens Yola Jones Samuel Leighton Funding and Collaborations: UKRI – Training Grant, Industrial Case Account/Scholarship/Siemens (co-I), 2024-2029 Academy of Medical Sciences, Network Grant (co-I), 2024-2025 NHS Lanarkshire on 'A Technology-driven Preventive  Approach to Frailty and Falls', supported by a fellowship. NHS Golden Jubilee on 'Machine Learning Models for Risk Prediction in Congenital Heart Disease'. EPSRC New Investigator Award on 'Privacy-Preserved Human Motion Analysis for Healthcare Applications', 2022-2025, PI. F. Deligianni Royal Society Semiflex grant on Human Motion and Privacy for Radar/Quantum Technology, 2022-2023, PI. F. Deligianni UKRI CDT on Socially Intelligent Artificial Agents with three PhD Scholarships Coursera course on Deep Learning for Clinical Decision Systems based on EHR, 2020-2021, PI. F. Deligianni 2021 Summer Scholarship, School of Computing Science, University of Glasgow (Matthew Malek-Podjaski) Human Data Interaction EPSRC Network - Human Motion Analysis – Agency, Negotiation and Legibility in Data Handling (EPSRC EPR0451781), PI Dr. Fani Deligianni, 2020-2021. Waire Health - Medical graded wearable sensing devices. CogniHealth is a healthcare technology company, which support people with dementia and their families. CanonMedical with funding for an EngD student via the CDT on Photonics. Distinguished Students' Projects: Privacy-Preserved Human Motion Analysis based on Radar Data, Linda Tran, MSci 2024. Privacy Preservation in Human Motion Analysis, Boondirek Kanjanapongporn, 2024. Human Motion Analysis - Exploration of Traditional Machine Learning and Deep Learning Based Anomaly Detection Algorithms, Titas Jonaitis, 2024. Deep Learning Models for Classification of Real and Synthetic Human Motion, Kiril Mitkov Bikov, 2023. Imputation Strategies for Risk Prediction Models Based on Electronic Health Records, Lee Lok Hang Toby, 2021-2022. Development of Machine Learning Models to Detect Arrhythmia based on ECG data - Explainable Models, Hector J. Jones, 2021-2022. Improving Explainability Using Expected Gradients for ECG Beat Classification, Anuraj Taya, 2021-2022. Adversarial Attention for Human Motion Synthesis, Matthew Malek-Podjaski, MSci, 2021-2022. Machine Learning Applications for the Detection and Disentanglement of Emotional States in Human Motion, 2020-2021, Matthew Malek-Podjaski. (This project is linked to Explainable, Privacy-Preserved Human Motion Analysis) Development of Machine Learning Models to Detect Arrhythmia Based on ECG Data-Interpretability, 2020-2021, Shourya Verma. Teaching: Informed Clinical Decision Making using Deep Learning: Students can enroll to the coursera MOOC here. Data Mining of Clinical Databases Deep Learning in Electronic Health Records Explainable Deep Learning Models for Healthcare Clinical Decision Support Systems PhD/Post-doc Vacancies: I am looking for highly motivated and competitive PhD/postdoctoral candidates to work in developing trustworthy AI systems in healthcare and human motion analysis. If you are interested drop me an email with your CV at fani.deligianni@glasgow.ac.uk). Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2014 | 2013 | 2012 | 2011 | 2010 | 2008 | 2006 | 2005 | 2004 | 2003 | 2002Number of items: 75.2025 Sweetland, Jonathan, Deligianni, Fani ORCID: https://orcid.org/0000-0003-1306-5017 and Murray-Smith, Roderick ORCID: https://orcid.org/0000-0003-4228-7962 (2025) Virtual Reality for the Evaluation of Drone Swarm Control Systems and User Interfaces. In: Autonomous Systems for Security and Defence II, Madrid, Spain, 15-16 Sep 2025, ISBN 9781510693005 (doi: 10.1117/12.3069541) Alkan, Muhammet, Deligianni, Fani ORCID: https://orcid.org/0000-0003-1306-5017, Anagnostopoulos, Christos ORCID: https://orcid.org/0000-0003-1517-6757, Zakariyya, Idris and Veldtman, Gruschen (2025) Digitization and linkage of PDF formatted 12-lead electrocardiograms in adult congenital heart disease. CJC Pediatric and Congenital Heart Disease, 4(5), pp. 263-273. (doi: 10.1016/j.cjcpc.2025.03.006) Chaichakan, Tanatta, Henderson, Paul ORCID: https://orcid.org/0000-0002-5198-7445 and Deligianni, Fani ORCID: https://orcid.org/0000-0003-1306-5017 (2025) Leveraging Pre-Trained Diffusion Models for Unsupervised Medical Image Registration. In: 6th International Conference on Medical Imaging and Computer-Aided Diagnosis (MICAD 2025), London, 19 - 21 Nov 2025, (Accepted for Publication) Liu, Qianying, Gu, Xiao, Henderson, Paul ORCID: https://orcid.org/0000-0002-5198-7445, Dai, Hang and Deligianni, Fani ORCID: https://orcid.org/0000-0003-1306-5017 (2025) Certainty-guided cross contrastive learning for semi-supervised medical image segmentation. IEEE Transactions on Biomedical Engineering, (doi: 10.1109/TBME.2025.3541992) (Early Online Publication) Liu, Qianying, Henderson, Paul ORCID: https://orcid.org/0000-0002-5198-7445, Gu, Xiao, Dai, Hang and Deligianni, Fani ORCID: https://orcid.org/0000-0003-1306-5017 (2025) Learning Semi-Supervised Medical Image Segmentation from Spatial Registration. In: IEEE/CVF Winter Conference on Applications of Computer Vision (WACV 2025), Tucson, AZ, USA, 28 February - 4 March 2025, pp. 6383-6393. ISBN 9798331510831 (doi: 10.1109/WACV61041.2025.00622) Zakariyya, Idris, Tran, Linda, Sivangi, Kaushik Bhargav, Henderson, Paul ORCID: https://orcid.org/0000-0002-5198-7445 and Deligianni, Fani ORCID: https://orcid.org/0000-0003-1306-5017 (2025) Differentially Private Integrated Dec",
  "content_length": 68268,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:09"
}