{
  "name": "Faramarz Famil Samavati",
  "homepage": "http://www.cpsc.ucalgary.ca/~samavati",
  "status": "success",
  "content": "Faramarz Samavati | GIV Group Search Faramarz F. Samavati Professor Department of Computer Science University of Calgary Faramarz Samavati I am a full professor of the Department of Computer Science at the University of Calgary. My main research focus is on Computer Graphics and Visualization. Specifically, I have made contributions to the area of modeling methods for 3D objects. While achieving success in theoretical research, I enthusiastically pursue practical applications related to my primary research. My efforts and leadership on various theory to real-world projects have made contributions to various technological innovations to Digital Earth, Sketch-based modeling, and Medical Visualization. I have more than 150 peer-reviewed publications and eight Best Paper Awards. I have supervised and trained 14 PhD, four Postdoctoral Fellows and more than 40 MSc thesis-based students. I am leading the Graphics, Interaction and Visualization (GIV) research group at the Department of Computer Science. For projects and other ongoing activities in my research team, please refer to GIV webpage. Honours, Awards, and Nominations Established Career Scholarship Excellence Award, Faculty of Science, University of Calgary, Aug 2020. Best Paper Award, Expressive 2017, Brown, A. and Samavati, F.F., Jul 2017. ASTech Nomination & Finalist, 2017, Nominated by the Faculty of Science for Outstanding Leadership in Alberta Technology. Selected by the ASTech Foundation as Award Finalist. The ASTech Awards are Alberta's highest Science and Technology honours. Best Paper Award of 2015 IEEE International Conference on Cyberworlds, Ketabchi, K., Runions, A., Samavati, F.F., Oct 2015. Peak Scholar Award, Honoured by the President of the University of Calgary, Excellence in Entrepreneurship, Innovation, and Knowledge Engagement, Nov 2014. Best Paper Award of 2014 IEEE International Conference on Cyberworlds, Hasan, M., Samavati, F.F., and Jacob, C., Oct 2014. Great Supervisor Award, Faculty of Graduate Studies, University of Calgary, Sep 2014. Digital Alberta Award 2013, Best in Cross-Platform, “Sketch3D”, Jun 2013. Michael Sweeney Award for Best Student Paper in Graphics at the Graphics Interface Conference, 2013. Mahdavi-Amiri, A. and Samavati, F.F., “ACM: Atlas of Connectivity Maps for Semiregular Models”, 2013. IEEE Computer Graphics and Applications 2011 Best Paper Award. Olsen, L, Samavati, F.F., and Jorge, J., “NaturaSketch: Modeling from Images and Natural Sketches”, 2011. Best Paper Award from Computer Graphics International, Ottawa, Canada. Runions, A. and Samavati, F.F., “Partition of Unity Parametrics: A Framework for Meta-Modeling”, 2011. Association for Computing Machinery (ACM) Recognition of Service Award, In Appreciation for Contributions to ACM, Co-Chair, Sixth ACM/Eurographics Symposium on Sketch-Based Modeling and Interaction, Aug 1-2, 2009. Contact samavati@cpsc.ucalgary.ca (403) 210-9454 2500 Campus Drive N.W., Calgary, AB, T2N 1N4, Canada Department of Computer Science, University of Calgary Cite × Copy Download",
  "content_length": 3059,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:14"
}