{
  "name": "Farhad Shirani 0001",
  "homepage": "https://pi-colab.github.io",
  "status": "success",
  "content": "Farhad Shirani · Archive Farhad Shirani Former Assistant Professor Google Scholar, Email, LinkedIn Π-CoLab Archive Farhad Shirani Former Assistant Professor Google Scholar, Email, LinkedIn © 2025. All rights reserved.Last Updated: July 2025 Disclaimer: This site archives the academic work performed at the Privacy, Inference and Communications Laboratory (Π-CoLab) led by Farhad Shirani prior to transitioning to industry in 2025. For current professional activities, please visit LinkedIn profile. Π-CoLab was a group of interdisciplinary researchers focused on topics bridging theory and practice in statistical learning theory, privacy and security, information theory, and wireless communications. Past Research Projects: Explainability and Fairness in Graph Neural Networks: This project developed an information theoretic framework for explainability and fairness in graph neural networks, involving the co-design of GNN architectures and explanation mechanisms. This was a collaborative effort between FIU's Π-CoLab, FIU's XAI-Lab, and several external collaborators. The project was partially supported by NSF grant #CCF-2241057, and built upon work titled 'Factorized Explainer for Graph Neural Networks' [1] and 'Towards Robust Fidelity for Evaluating Explainability of Graph Neural Networks' [2]. Network Privacy and Security: This project focused on quantifying internet users' privacy risks, and was a collaborative effort between FIU's Π-CoLab, FIU's Sec-Lab, NDSU's CS Department, and NYU's NYU Wireless and NYU CCS. The project was supported by NSF grant #CCF-1815821 titled 'An Information Theoretic Framework for Web Privacy'. Significant contributions included [1], [2], and [3]. Wireless Communications: This project focused on wireless communications, consisting of two subprojects: i) energy efficient communication over millimeter wave networks, and ii) resource allocation in cellular systems. The project was supported by NSF grant #CCF-2242700 titled 'Towards Energy-Efficient Millimeter Wave Wireless Networks: A Unified Systems and Circuits Framework'. Significant contributions included [4] and [5]. Multiterminal Information Theory: This project studied the fundamental limits of data compression, communication, and randomness generation over networks. This was a collaboration between FIU's Π-CoLab and University of Michigan's EECS Department. The project was supported by NSF grant #CCF-2132843 titled 'A New Paradigm for Distributed Information Processing, Simulation and Inference in Networks: The Promise of Law of Small Numbers'. Contributions were summarized in a published book [6]. Other contributions included [7] and [8]. Π-CoLab Archive Privacy, Inference, and Communications Laboratory Disclaimer: This site archives the academic work performed at the Privacy, Inference and Communications Laboratory (Π-CoLab) led by Farhad Shirani prior to transitioning to industry in 2025. For current professional activities, please visit (LinkedIn profile). Π-CoLab was a group of interdisciplinary researchers focused on topics bridging theory and practice in statistical learning theory, privacy and security, information theory, and wireless communications. Past Research Projects: Explainability and Fairness in Graph Neural Networks: This project developed an information theoretic framework for explainability and fairness in graph neural networks, involving the co-design of GNN architectures and explanation mechanisms. This was a collaborative effort between FIU's Π-CoLab, FIU's XAI-Lab, and several external collaborators. The project was partially supported by NSF grant #CCF-2241057, and built upon work titled 'Factorized Explainer for Graph Neural Networks' [1] and 'Towards Robust Fidelity for Evaluating Explainability of Graph Neural Networks' [2]. Network Privacy and Security: This project focused on quantifying internet users' privacy risks, and was a collaborative effort between FIU's Π-CoLab, FIU's Sec-Lab, NDSU's CS Department, and NYU's NYU Wireless and NYU CCS. The project was supported by NSF grant #CCF-1815821 titled 'An Information Theoretic Framework for Web Privacy'. Significant contributions included [1], [2], and [3]. Wireless Communications: This project focused on wireless communications, consisting of two subprojects: i) energy efficient communication over millimeter wave networks, and ii) resource allocation in cellular systems. The project was supported by NSF grant #CCF-2242700 titled 'Towards Energy-Efficient Millimeter Wave Wireless Networks: A Unified Systems and Circuits Framework'. Significant contributions included [4] and [5]. Multiterminal Information Theory: This project studied the fundamental limits of data compression, communication, and randomness generation over networks. This was a collaboration between FIU's Π-CoLab and University of Michigan's EECS Department. The project was supported by NSF grant #CCF-2132843 titled 'A New Paradigm for Distributed Information Processing, Simulation and Inference in Networks: The Promise of Law of Small Numbers'. Contributions were summarized in a published book [6]. Other contributions included [7], [8]. Past News December 2023: Paper titled \"Factorized Explainer for Graph Neural Networks\" accepted at the 38th AAAI Conference on Artificial Intelligence. Read the paper. December 2023: Paper accepted in IEEE Transactions on Information Theory: \"A Structured Coding Framework for Communication and Computation over Continuous Networks\". Explore the research. October 2023: $500k grant awarded for \"CCSS: Towards Energy-Efficient Millimeter Wave Wireless Networks: A Unified Systems and Circuits Framework\". Dr. Farhad Shirani serving as project lead. This is a collaborative research project with UC Irvine, and the FIU share is $250k. More about the award. July 2023: ISIT paper acceptance: \"The Privacy-Utility Tradeoff in Rank-Preserving Dataset Obfuscation\". May 2023: ITW paper accepted: \"On non-interactive source simulation via Fourier transform\". May 2023: Another ITW paper accepted: \"Optimal Fault-Tolerant Data Fusion in Sensor Networks: Fundamental Limits and Efficient Algorithms\". December 2022: \"CIF: Small: A New Paradigm for Distributed Information Processing, Simulation and Inference in Networks: The Promise of Law of Small Numbers\". Dr. Farhad Shirani as Principal Investigator. Learn more. Sidebar Toggle s",
  "content_length": 6381,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:12"
}