{
  "name": "Farinaz Koushanfar",
  "homepage": "https://farinaz.eng.ucsd.edu/home",
  "status": "success",
  "content": "Farinaz KoushanfarSearch this siteEmbedded FilesSkip to main contentSkip to navigationFarinaz KoushanfarSiavouche Nemat-Nasser Endowed Chair and ProfessorElectrical & Computer Engineering at UCSDFounding Co-DirectorCenter for Machine-Intelligence, Computing and SecurityOther Center AffiliationsNSF Trust-Hub (Co-PI), NSF TILOS AI InstituteMember of the Editorial BoardThe Proceedings of the IEEEResearchSecure and efficient computing, Co-optimization and customization of massive AI models, Robust safe AI, Hardware/system security, Supply chain management and intellectual property (IP) protection (Watermarking, tracing, attestation), AI-based optimization,  Cryptographically secure privacy-preserving computing (a.k.a., secure multi-party computation or MPC), Zero-knowledge proofs (ZKPs)Fellow of ACM, IEEE, National Academy of Inventors (NAI), and the Kavli Foundation of the National Academy of Sciences (NAS)ResearchProf. Koushanfar’s current research addresses several aspects of secure and efficient computing, with a focus on robust machine learning under resource constraints, hardware and system security, AI-based optimization, intellectual property (IP) protection, as well as cryptographically secure privacy-preserving computing. Her research has made foundational contributions to all of these domains, including invention of the concepts of logic obfuscation/logic locking for both sequential and combinational logic that enabled the first active unique control of chips post-silicon, novel statistical methods for assessing chip security, the first automated co-design of data/algorithm/software/hardware for energy efficient and compact deep learning, invention of co-design methods for creation of low overhead robust and safe AI, the first trigger inversion methodology for detection of AI poisoning attack, creation of the first method for watermarking/ tracing deep learning models and generative output and attestation on trusted platforms, AI-based generic solvers for combinatorial optimization with constraints, creation of physical proofs of provenance, as well as novel co-design and optimization of algorithm and hardware/software, including co-design with cryptographic constructs for privacy-preserving computing. Her work has linked seemingly disparate fields of logic synthesis and cryptographically secure computing requiring Boolean logic/vector computing, creating many new opportunities for researchers and leading to practical methods for managing function nonlinearities in ciphertext domain.NewsFeb 2025: Prof. Farinaz Koushanfar is chairing the UCSD Workshop on Secure AI for Health, Defense, and Beyond!Dec 2024: Prof. Farinaz Koushanfar is inducted to the National Academy of Inventors (NAI) class of 2024 fellows.Aug 2024: Prof. Farinaz Koushanfar has been appointed as the inaugural holder of the Siavouche Nemat-Nasser Endowed Chair In the Jacobs School of Engineering. Aug 2024: CNBC reports on security and privacy of brain-computer interfaces, quoting UCSD ECE faculty experts Prof. Kuzum and Prof. Koushanfar.June 2024: ACES Lab alumna, Dr. Bita Rouhani (PhD 2018 UCSD, Best ECE Dissertation Award), is a recipient of the DAC Under-40 Innovators Award 2024. June 2024: ACES Lab latest graduate, Dr. Shehzeen Hussain, receives the 2024 UCSD Best Dissertation Award in ECE. Shehzeen’s outstanding thesis made foundational contributions to demystifying safe AI and developing efficient generative models.  May 2024: Prof. Farinaz Koushanfar is co-chairing the ACM WiSec 2024 program in Seoul South Korea, the premier conference on Security and Privacy in Wireless and Mobile Networks. Check the exciting program!Sept 2023: ACES Lab alumna, Dr. Azalia Mirhoseini starts her new job as an Assistant Professor of Computer Science at Stanford University. Her lab focuses on developing capable, reliable, and efficient AI systems for solving high-impact, real-world problems. 2023: Prof. Patrick McDaniel and Prof. Farinaz Koushanfar co-lead the decadal review and vision for the United States National Science Foundation (NSF) Secure and Trustworthy Cyberspace (SaTC) billion-dollar program, and co-authored a report to be shared with the US congressional decision makers.Jan 2023: ACES Lab alumna, Dr. Zahra Ghodsi starts her new job as an Assistant Professor of Electrical and Computer Engineering at Purdue University. Her lab focuses on building secure frameworks for emerging intelligent devices and applications, applied cryptography, AI, and systems.ContactPrincipal Investigator:Farinaz Koushanfar, Ph.D., Professor, UCSD Electrical and Computer Engineering4502 Franklin Antonio Hall UC San Diego, MC 0407         9500 Gilman DrLa Jolla, CA 92093-0407Email: fkoushanfar@ucsd.eduPhone:  (858) 246-0251 Fax: (858) 534-2486Admin assistant:Ms. Wyn HughesElectrical and Computer Engineering9500 Gilman Drive, MC 0407Jacobs Hall, Room 2907La Jolla, CA 92093-0407Email: whughes@ucsd.edu  Phone:  (858) 434-3294 Copyright F. Koushanfar (all rights reserved)Report abuseReport abuse",
  "content_length": 5028,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:14"
}