{
  "name": "Farid Melgani",
  "homepage": "https://disi.unitn.it/~melgani",
  "status": "success",
  "content": "Personal Web Site Home Teaching Research Publications Applications Datasets Alumni Dr. Farid Melgani Full Professor of Telecommunications Dept. of Information Engineering and Computer Science, University of Trento, Via Sommarive, 14, I-38123, Trento, Italy Phone: +39-0461-281573 Fax: +39-0461-282093 E-mail: melgani@disi.unitn.it Farid Melgani received the State Engineer degree in electronics from the University of Batna, Algeria, in 1994, the M.Sc. degree in electrical engineering from the University of Baghdad, Iraq, in 1999, and the Ph.D. degree in electronic and computer engineering from the University of Genoa, Italy, in 2003. Since 2002, he has been an Assistant Professor, then an Associate Professor, and currently a Full Professor of Telecommunications at the University of Trento, Italy, where he teaches (taught) pattern recognition, machine learning, radar remote-sensing systems, remote sensing for archaeology, digital transmission, and digital signal processing. From 2007 to 2010, he was the head of the Intelligent Information Processing Laboratory of the Department of Information Engineering and Computer Science of the University of Trento. Since 2011, he is the head of the Signal Processing and Recognition Laboratory, and is currently the Dean of Undergrad and Grad Studies in the same department, as well as the Coordinator of the Ph.D. School in Industrial Innovation at the University of Trento. His research interests are in the fields of signal/image processing/analysis, machine learning, and artificial intelligence. Part of his researches was carried out within research projects funded by the European Space Agency, the Italian Space Agency, the Italian Ministry of the Education, Research and University, and the Italian Ministry of Foreign Affairs. He is a co-author of more than 250 scientific publications. He has about 14000 citations on Google Scholar, an H-Index=53 and about 650 cites/year. He is a referee for about 50 international journals. In 2016, he received the prestigious IEEE Fellow Award for contributions to image analysis in remote sensing.In 2020, he was ranked in Stanford study of the world's top 2% of scientists (exact ranking: 135 among 44176 researchers in his area). He is an Associate Editor of the IEEE Transactions on Geoscience and Remote Sensing, the IEEE Journal on Miniaturization for Air and Space Systems, and the International Journal of Remote Sensing. He was a Member of the Administrative Committee (AdCom) of the IEEE Geoscience and Remote Sensing Society. He is the Founder and General Chair of the IEEE Mediterranean and Middle-East Geoscience and Remote Sensing Symposium (M2GARSS). Last update: April 2022 Copyright © 2007 Free Templates by Zymic - Free Web Hosting - Best Viewed in Mozilla Firefox",
  "content_length": 2784,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:14"
}