{
  "name": "Fariba Sadri",
  "homepage": "http://www.doc.ic.ac.uk/~fs",
  "status": "success",
  "content": "Fariba Sadri Fariba Sadri Department of Computing Imperial College London fs@doc.ic.ac.uk f.sadri@imperial.ac.uk CONTACT            ADMIN            PROFESSIONAL ACTIVITIES            TEACHING            RESEARCH INTERESTS            PUBLICATIONS THE LPS LANGUAGE CONTACT DETAILS Address:                                                                      Email: fs@doc.ic.ac.uk Department of Computing                                                      f.sadri@imperial.ac.uk Imperial College London, 180 Queen's Gate London SW7 2AZ UK. DIRECTOR STUDIES (TAUGHT POSTGRADUATE ) I am Director of Studies and Senior Tutor for the following degrees in the Department of Computing, Imperial College London: MSc Computing MSc Computing (Artificial Intelligence) MSc Computing (Computational Management)* MSc Computing (Machine Learning) MSc Computing (Security and Reliability) MSc Computing (Software Engineering) MSc Computing (Visual Computing and Robotics) MSc Advanced Computing MRes Advanced Computing * To be renamed MSc Computing (Management and Finance) in 2018-19. See here for all MSc and MRes course information. PROFESSIONAL ACTIVITIES Workshop Co-Chair: AmI (European Conference on Ambient Intelligence) 2018 http://www.cyprusconferences.org/ami2018/ General Co-Chair: RuleML+RR (International Joint Conference on Rules and Reasoning) 2017 http://2017.ruleml-rr.org/ Programme Co-Chair: · RuleML 2015, The 9th International Web Rule Symposium, August 2-5, 2015, Freie Universität Berlin, Berlin, Germany http://2015.ruleml.org/ · CLIMA IX (Computational Logic in Multi-Agent Systems), Dresden, Germany, September 2008 · CLIMA VIII (Computational Logic in Multi-Agent Systems), Porto, Portugal, September 2007 · CLIMA I (Computational Logic in Multi-Agent Systems), UK, London, July 2000 · ASAMI  (Second Symposium on Artificial Societies for Ambient Intelligence ), AISB Convention, Aberdeen University, UK, April 2008 · ASAMI (First Symposium on Artificial Societies for Ambient Intelligence) , AISB Convention, Newcastle University, UK,  April 2007 · AmITA (Ambient intelligence technologies and applications), 13th Encontro Português de Inteligência Artificial, EPIA, Portugal 2007 · AmI07 (First International Workshop on Human Aspects in Ambient Intelligence), Darmstadt, Germany, Workshop at the European Conference on Ambient Intelligence, November 2007 Steering Committee Membership · RuleML, since 2015 · HAI, Human Aspects in Ambient Intelligence 2007- 2014 · CLIMA, Computational Logic in Multi-Agent Systems, 2000  2011 Program Committee Membership I am regularly (annually) and have been for many years on the following Programme Committees: · The International Conference on Agents and Artificial Intelligence (ICAART) · The International Conference on Advanced Cognitive Technologies and Applications (COGNITIVE) · The International Conference on Autonomic and Autonomous Systems (ICAS) · International Conference on Information, Process, and Knowledge Management (eKNOW) · International Web Rule Symposium (RuleML) · International Association of Engineers (IAENG  WCE) · International Conference on Industrial, Engineering & Other Applications of Applied Intelligent Systems (IEA/AIE) Other Programme Committees 2015 · IJCAI, International Joint Conference on Artificial Intelligence 2015 · AAMAS, International Conference on Autonomous Agents and Multiagent Systems 2015 2014 · AISC, Artificial Intelligence and Symbolic Computation, 2014 · CLIMA, Computational Logic in Multi-Agent Systems, 2014 · IAT, The IEEE/WIC/ACM International Conference on Intelligent Agent Technology, 2014 · SAI, Science and Information Conference, 2014 · eKNOW, The Sixth International Conference on Information, Process, and Knowledge Management, 2014 · IEA-AIE, International Conference on Industrial, Engineering & Other Applications of Applied Intelligent Systems, 2014 · ICAART, International Conference on Agents and Artificial Intelligence, 2014 · The International Conference on Advanced Cognitive Technologies and Applications, 2014 2006-2013 · The International Conference on Agents and Artificial Intelligence (ICAART) 2010, 2011, 2012, 2013 · Computational Logic in Multi-Agent Systems (CLIMA) 2006, 2007, 2008, 2010, 2011, 2012, 2013 · Agent Oriented Software Engineering (AOSE) 2007, 2008, 2009, 2010, 2011, 2012, 2013 · The International Conference on Advanced Cognitive Technologies and Applications, 2009, 2010, 2011, 2012, 2013 · International Conference on Industrial, Engineering & Other Applications of Applied Intelligent Systems, IEA/AIE 2013 · Workshop on Human Aspects in Ambient Intelligence (HAI) 2007, 2008, 2009, 2010, 2011, 2012, 2013 · The International Conference on Ambient Systems, Networks, and Technologies (ANT) 2010, 2011, 2012 · Brazilian Symposium on Artificial Intelligence (SBIA) 2010, 2011, 2012 · International Conference on Informatics in Control, Automation and Robotics, 2009, 2010 · Portuguese Conference on Artificial Intelligence (EPIA) 2009 · 5th International Conference on Service Systems and Service management (ICSSM), Melbourne, Australia, 2008 · International Conference on Autonomous Agents and Multiagent Systems (AAMAS) 2006, 2007 · International Conference Intelligent Systems and Agents IADIS, Lisbon, Portugal, 2007 · International Conference of Computational Intelligence and Intelligent Systems (ICCIIS'07), London, UK 2007 · Workshop on Ambient Intelligence Technologies and Applications, 13th Encontro Português de Inteligência Artificial, EPIA, Portugal, 2007 · Workshop on Search Techniques for Constraint Satisfaction, 13th Encontro Português de Inteligência Artificial, EPIA, Portugal 2007 · 8th International Workshop on Engineering Societies in the Agents' World, Oct 22-24, Athens, Greece, ESAW 2007 · Symposium on Artificial Societies for Ambient Intelligence, AISB Convention, ASAMI 2007 · IADIS Intelligent Systems and Agents, ISA 2006 Editorship · Guest editor of Special Issue Theory and Practice of Logic Programming (Rule-based Approaches to Advanced Knowledge Representation and Reasoning tasks), to appear in 2018 · Guest editor of The Computer Journal Special Issue on Artificial Societies for Ambient Intelligence, 2009, 2010, 2011, 2012 · Editor for the area \"Multi-Agent Systems\" for the Newsletter of the ALP, Association for Logic Programming, up to 2009 · Guest editor of a Special Issue of the Journal of Engineering Letters related to the International Conference of Computational Intelligence and Intelligent Systems, 2007 · Co-editor of the Special Issue of the Annals of Mathematics and Artificial Intelligence on Logic-based Agents, Vol 37 Nos 1-2, January 2003 · Co-editor of a Special Issue of the ACM Transactions on Computational Logic, volume 2, number 4, October 2001 Invited Tutorials · International Joint Conference on Rules and Reasoning, RuleML+RR 2017, Computational Logic · ICCL International Centre for Computational Logic Summer School, Dresden, Germany, 24th August - 6th September 2008, Logic-Based Multi-Agent Systems · ACAI Summer School, Advanced Course on Artificial Intelligence, Leuven, Belgium, 20-28 August 2007, Logic-Based Multi-Agent Systems · CLIMA Computational Logic in Multi-Agent Systems VI, 2005, Logic-Based Multi-Agent Systems Teaching Current teaching: Logic and AI Programming, an MSc module Past teaching: Databases Database Technology Deductive Databases Introduction to Artificial Intelligence Logic Programming Logic and Declarative programming Prolog Software Engineering Research Interests Past and Present Knowledge Representation and Reasoning in Artificial Intelligence, in particular: · Abductive Logic Programming · Logic-based Multi-Agent Systems · Agent Communication Protocols and Negotiation · Intention Recognition · Education · Underwater Dredging Operation Control · Intelligent Energy Management Recent Grants 2016 CLOUT (Computational Logic for Use in Teaching), Collaboration with InterProlog, Portugal, Imperial College EPSRC Internal Funding Scheme Pathways to Impact Funding 2011-12 LPS - Combining the power of logic programming, production systems, active databases, BDI agents, decision theory in situated intelligent autonomous systems, Industrial collaboration with Logic Programming Associates LPA, Imperial College EPSRC Internal Funding Scheme Pathways to Impact Funding 2002-05 SOCS - A computational logic model for the description, analysis and verification of global and open societies of heterogeneous computes, EU, the European Commission Global Computing Framework Selected Bibliography Reactive Systems · Wielemaker, J.,  Riguzzi, F., Kowalski, R. and Sadri, F., Calejo, M., Lager, F.: Using SWISH to realise interactive web based tutorials for logic based languages, To appear Theory and Practice of Logic Programming (2018) · F. Sadri, H. M. Xu and F.S. Ni:  A Schema for Intelligent Dredging  for Cutter Suction Dredger Using LPS, Proceedings of WORLD DREDGING CONGRESS XXI, June 13 - 17, Miami, Florida, USA (2016) · Kowalski, R. and Sadri, F.: Programming in Logic Without Logic Programming, Theory and Practice of Logic Programming (TPLP), ( 2016) · Kowalski, R. and Sadri, F.: Towards a Logic-Based Framework for Reactive Computing, New Generation Computing, Volume 33, Issue 1, pp 33-67 (2015) · Kowalski, R. and Sadri, F.:  A Logical Characterization of a Reactive System Language, RuleML 2014,  A. Bikakis et al. (Eds.): RuleML 2014, LNCS 8620, pp. 22--36. Springer International Publishing Switzerland (2014) · Kowalski, R. and Sadri, F.: Towards a Logic-Based Unifying Framework for Computing, submitted · Kowalski, R. and Sadri, F.: A Logic-Based Framework for Reactive Systems, 6th International Symposium RuleML Rules on the Web: Research and Application, Antonis Bikakis and Adrian Giurca (Eds), 1-15 (2012) Pdf · Kowalski, R. and Sadri, F.: Teleo-Reactive Abductive Logic Programs, Festschrift for Marek Sergot, Alexander Artikis, Robert Craven, Nihan Kesim, Babak Sadighi, and Kostas Stat",
  "content_length": 28679,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:14"
}