{
  "name": "Farida Cheriet",
  "homepage": "https://www.polymtl.ca/expertises/cheriet-farida",
  "status": "success",
  "content": "Cheriet, Farida | Répertoire des expertises Aller au contenu principal Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission Visitez-nous! Faire un don © Polytechnique Montréal 2025. Poly Bottin Cours Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission © Polytechnique Montréal 2025. Répertoire des expertises Cheriet, Farida Poly Bottin Cours English Répertoire des expertises Cheriet, Farida Répertoire des expertises Retour aux résultats de recherche Modifier ma ficheAide Publications Lien(s) Farida Cheriet Ing. (Algérie), D.E.A. (France), Ph.D. (Montréal) Publications Lien(s) Professeure titulaire Département de génie informatique et génie logiciel Tél. : (514) 340-4711 poste 4277 Téléc. : (514) 340-5139 Local : M-3115 farida.cheriet@polymtl.ca Domaines d'expertise Technologie biomédicale Intelligence artificielle Intérêts de recherche et affiliations Intérêts de recherche Vision artificielle Imagerie médicale Modélisation surfacique de structures anatomiques Fusion d'images multimodales Estimation de mouvement 3D Techniques d'apprentissage Affiliation(s) Laboratoire d'imagerie et de vision 4D (LIV4D), Directrice Institut de génie biomédical, Membre Institut de valorisation des données (IVADO), Membre Type(s) d'expertises (sujets CRSNG) 1901 Technologie biomédicale 2800 INTELLIGENCE ARTIFICIELLE (Vision artificielle, utiliser 2603) Publications Publications récentes Article de revue Gharib, W. S. A. F., Émériaud, G., & Cheriet, F. (2025). A comprehensive review of ICU readmission prediction models: From statistical methods to deep learning approaches. Artificial Intelligence in Medicine, 103126 (16 pages). Article de revue Alsheghri, A., Zhang, Y., Keren, J., Cheriet, F., & Guibault, F. (2025). Automatic margin line extraction using 3D deep learning on digital surface models of prepared teeth for crown generation. Computers in Biology and Medicine, 196(C), 110960. Communication de conférence Lepetit-Aimon, G., Mameri, L., Duval, R., & Cheriet, F. (avril 2025). Enhanced Graph Representation for Reliable Retinal Vessel Analysis: CLSA Population-Based Study [Communication écrite]. 22nd International Symposium on Biomedical Imaging (ISBI 2025), Houston, TX, USA. Communication de conférence Chafi, I., Zhang, Y., Ladini, Y., Cheriet, F., Keren, J., & Guibault, F. (avril 2025). Exploring the Use of Generative Adversarial Networks for Automated Dental Preparation Design [Communication écrite]. 22nd International Symposium on Biomedical Imaging (ISBI 2025), Houston, TX, USA. Voir toutes les publications (255) Enseignement Réseaux de communications numériques. Infographie et interfaces personne-machine. Encadrement à Polytechnique TERMINÉ Thèse de doctorat (29) Lepetit-Aimon, G. (2025). Modélisation topologique du réseau vasculaire rétinien à partir d'image de fond d'oeil [Thèse de doctorat, Polytechnique Montréal]. Khani, M. (2023). Automatic Analysis of the Scoliotic Trunk for Surgery Planning and Outcome Assessment [Thèse de doctorat, Polytechnique Montréal]. Playout, C. (2023). Modélisation interprétable du diagnostic de pathologies rétiniennes par apprentissage profond [Thèse de doctorat, Polytechnique Montréal]. Yahyatabar Arabi, M. E. (2023). Interpretable Learning Models for Acute Respiratory Distress Syndrome Detection from Chest Radiographs [Thèse de doctorat, Polytechnique Montréal]. Tran, D. H. (2022). Deep Learning Model Generalization for Microscopy Image Analysis [Thèse de doctorat, Polytechnique Montréal]. Damseh, R. (2020). Anatomical Modeling of Cerebral Microvascular Structures: Application to Identify Biomarkers of Microstrokes [Thèse de doctorat, Polytechnique Montréal]. Begdouri, A.-H. (2019). Comportement mécanique du tissu cardiaque par flux optique et méthode des champs virtuels [Thèse de doctorat, Polytechnique Montréal]. Girard, F. (2018). Modélisation statistique des structures anatomiques de la rétine à partir d'images de fond d'oeil [Thèse de doctorat, École Polytechnique de Montréal]. Moheb Pour, M. R. (2018). Automatic Mesh-Based Segmentation of Multiple Organs in MR Images [Thèse de doctorat, École Polytechnique de Montréal]. Béliveau, P. (2017). Texture Analysis of Late Gadolinium Enhanced Cardiac Magnetic Resonance Images for Characterizing Myocardial Fibrosis and Infarction [Thèse de doctorat, École Polytechnique de Montréal]. Bendaoudi, H. (2017). Flexible Hardware Architectures for Retinal Image Analysis [Thèse de doctorat, École Polytechnique de Montréal]. Christodoulidis, A. (2017). Segmentation and Characterization of Small Retinal Vessels in Fundus Images Using the Tensor Voting Approach [Thèse de doctorat, École Polytechnique de Montréal]. Piché, N. (2017). Un nouveau descripteur iconique topologique pour l'appariement d'images de structures anatomiques [Thèse de doctorat, École Polytechnique de Montréal]. Zaglam, N. (2017). Analyse automatique de radiographies pulmonaires pour le diagnostic précoce du syndrome de détresse respiratoire aiguë [Thèse de doctorat, École Polytechnique de Montréal]. Aissiou, M. (2016). Early Detection of Doxorubicin-Induced Cardiotoxicity Using Combined Biomechanical Modeling and Multi-Parametric Cardiovascular MRI [Thèse de doctorat, École Polytechnique de Montréal]. Benovoy, M. (2016). Automatic Spatiotemporal Analysis of Cardiac Image Series [Thèse de doctorat, École Polytechnique de Montréal]. Courchesne, O. (2016). Modélisation géométrique 3D des structures anatomiques du tronc humain à partir d'images acquises par résonnance magnétique [Thèse de doctorat, École Polytechnique de Montréal]. Olamaei, N. (2015). 3D Visualization of Microvascular Networks Using Magnetic Particles: Application to Magnetic Resonance Navigation [Thèse de doctorat, École Polytechnique de Montréal]. Assi, K. C. (2014). Modélisation physique des tissus mous du tronc scoliotique pour la simulation de l'apparence post-chirurgicale [Thèse de doctorat, École Polytechnique de Montréal]. Harmouche, R. (2012). Fusion multimodale d'images pour la reconstruction et la modélisation géométrique 3D du tronc humain [Thèse de doctorat, École Polytechnique de Montréal]. Lombaert, H. (2012). Atlas Construction for Measuring the Variability of Complex Anatomical Structures [Thèse de doctorat, École Polytechnique de Montréal]. Séoud, L. (2012). Analyse de la relation entre les déformations scoliotiques du tronc et celles des structures osseuses sous-jacentes [Thèse de doctorat, École Polytechnique de Montréal]. Chevrefils, C. (2010). Construction d'un modèle per-opératoire 3D du rachis pour la navigation en thoracoscopie. [Thèse de doctorat, École Polytechnique de Montréal]. Boisvert, J. (2008). Modèles de la variabilité géométrique du rachis scoliotique [Thèse de doctorat, École Polytechnique de Montréal]. Fallavollita, P. (2008). 3D reconstruction of coronary arteries from angiographic sequences for interventional assistance [Thèse de doctorat, École Polytechnique de Montréal]. Hurtut, T. (2008). Analyse et recherche d'oeuvres d'art 2D selon le contenu pictural [Thèse de doctorat, École Polytechnique de Montréal]. Kadoury, S. (2008). Reconstruction 3D personnalisée de la colonne vertébrale à partir d'images radiographiques non-calibrées [Thèse de doctorat, École Polytechnique de Montréal]. Saddi, K. A. (2008). Recalage non rigide et segmentation automatique d'images de perfusion du foie [Thèse de doctorat, École Polytechnique de Montréal]. Duong, L. (2007). Détection et classification automatique de la colonne vertébrale à partir d'images à rayons-X [Thèse de doctorat, École Polytechnique de Montréal]. Mémoire de maîtrise (47) Haidar, S. (2025). Modélisation Statistique de Formes Dentaires Humaines par Harmoniques Sphériques [Mémoire de maîtrise, Polytechnique Montréal]. Arunachalam, S. (2024). Prediction of the Postoperative Shape of the Trunk After Spinal Surgery Using Deep Learning [Mémoire de maîtrise, Polytechnique Montréal]. Lesec, C. (2022). Analyse automatique d'images histopathologiques de tissus tumoraux micro-disséqués [Mémoire de maîtrise, Polytechnique Montréal]. Lessard, O. (2022). Génération de maillage surfacique de dents par apprentissage profond [Mémoire de maîtrise, Polytechnique Montréal]. Dumas, R. (2021). Segmentation de la couche choroïdienne sur images OCT oculaires par apprentissage profond et applications [Mémoire de maîtrise, Polytechnique Montréal]. Royer-Rivard, R. (2021). Mise en correspondance spatio-temporelle de séquences angiographiques par apprentissage profond [Mémoire de maîtrise, Polytechnique Montréal]. Bélanger Nzakimuena, C. (2020). Automated Analysis of Retinal and Choroidal OCT and OCTA Images in AMD [Mémoire de maîtrise, Polytechnique Montréal]. Elkommos Daoud, Y. (2020). Évaluation de la précision de systèmes d'acquisition de la géométrie 3D du tronc pour la conception de corsets personnalisés [Mémoire de maîtrise, Polytechnique Montréal]. Peskine, Y. B. (2020). Dépistage automatique de la rétinopathie diabétique dans les images de fond d'oeil à l'aide de l'apprentissage profond [Mémoire de maîtrise, Polytechnique Montréal]. Ghesquiere, P. (2018). Segmentation automatique des images de fibres d'ADN pour la quantification du stress réplicatif [Mémoire de maîtrise, École Polytechnique de Montréal]. Lepetit-Aimon, G. (2018). Architecture complètement convolutive à champ d'activation large pour la segmentation sémantique de la vasculature rétinienne dans les images de fond d'oeil [Mémoire de maîtrise, École Polytechnique de Montréal]. Playout, C. (2018). Système d'apprentissage multitâche",
  "content_length": 19020,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:17"
}