{
  "name": "Fatiha Sadat",
  "homepage": "https://professeurs.uqam.ca/professeur/sadat.fatiha",
  "status": "success",
  "content": "Fatiha Sadat | Répertoire des professeures et professeurs - UQAM Fatiha Sadat Professeure Fatiha Sadat Professeure Unité : Département d'informatique Courriel : sadat.fatiha@uqam.ca Téléphone : (514) 987-3000 poste 3885 Langues : Français, Anglais, Arabe, Amazigh, Japonais Domaines d'expertise Analyse de données Apprentissage machine Humanités numériques Informatique Intelligence artificielle Langues autochtones Linguistique computationnelle Sciences cognitives Traitement automatique du langage Liens d'intérêt Google Scholar Page personnelle Enseignement Outils de bureautique et Internet (hors programme) (2026) Bases de données (2026, 2025) Traitement automatique du langage naturel (2026, 2024, 2023, 2021) Traitement Automatique des Langues Naturelles (TALN) (2025) Projet de thèse (2025, 2024) Séminaire en informatique cognitive (2022, 2021) Directions de thèses et mémoires Thèses de doctorat Belainine, Billal. (2023). Modèle intégré pour la génération de dialogue et la traduction automatique à base d'attention. (Thèse de doctorat). Université du Québec à Montréal. Le, Ngoc Tan. (2019). Traduction automatique pour une paire de langues peu dotée. (Thèse de doctorat). Université du Québec à Montréal. Fernandes Da Fonseca, Alexsandro. (2018). Représentation de collocations dans un réseau lexical à l'aide des fonctions lexicales et des formalismes du Web sémantique. (Thèse de doctorat). Université du Québec à Montréal. Mémoires Hansal, Oussama. (2023). Gender bias in the context of indigenous languages and natural language processing. (Mémoire de maîtrise). Université du Québec à Montréal. Kasdi, Soumia. (2023). Reconnaissance d’entités nommées inuktitut pour la traduction automatique neuronale. (Mémoire de maîtrise). Université du Québec à Montréal. Cadotte, Antoine. (2023). La traduction automatique au service de la revitalisation de l'innu-aimun : une approche collaborative pour développer des outils d'assistance. (Mémoire de maîtrise). Université du Québec à Montréal. Cissé, Thierno Ibrahima. (2023). Vérification et correction orthographique automatique pour les langues parlées et très peu dotées : étude de cas sur le Wolof. (Mémoire de maîtrise). Université du Québec à Montréal. Belkhir, Ahmed. (2023). Improving ChatGPT’s emotional intelligence through prompt engineering. (Mémoire de maîtrise). Université du Québec à Montréal. Dekhili, Ghaith. (2020). Apport d'une approche hybride à base de réseaux de neurones et de statistiques pour la reconnaissance des entités nommées en domaines général et restreint. (Mémoire de maîtrise). Université du Québec à Montréal. Mallek, Fatma. (2017). Traduction automatique statistique et adaptation au domaine des médias sociaux. (Mémoire de maîtrise). Université du Québec à Montréal. Belainine, Billal. (2017). Classification supervisée de textes courts et bruités : application au domaine des médias sociaux. (Mémoire de maîtrise). Université du Québec à Montréal. Chakour, Habiba. (2015). Recherche d'information translinguistique basée sur une traduction de requêtes directe et transitive utilisant l'encyclopédie en ligne Wikipédia. (Mémoire de maîtrise). Université du Québec à Montréal. Deffaf, Fatima. (2015). Extraction des entitées nommées par projection cross-linguistique et construction de lexiques bilingues d'entités nommées pour la traduction automatique statistique. (Mémoire de maîtrise). Université du Québec à Montréal. Rapports d'activités et projets d'intervention Hamzaoui, Youssef. (2019). Analyse des sentiments : étude de cas du tourisme. (Rapport d'activités et projet d'intervention). Université du Québec à Montréal. Autres directions et supervisions Julien Guité-Vinet (2023). MODÈLES DE LANGUE POUR LE PROBLÈME DU DICTIONNAIRE INVERSÉ. (Mémoire de Maîtrise en informatique). Université du Québec à Montréal. Sara Meftah (2021). Neural Transfer Learning for Domain Adaptation in Natural Language Processing. (Thèse de doctorat en informatique). Université Paris-Saclay et Commissariat à l'énergie atomique et aux energies alternatives (CEA). Mohamed-Ayoub Tahiri (2020). Construction de représentations universelles multimodales poru une application en liaison avec les agents conversationnels. Projet se stage pour l'obtention d'une Maîtrise en études internationales, option data science. École d'ingénieur HEI (Hautes Etudes Internationales), Lille, France. Patrik Carvalho-Carreira. (2020). Génération de questions pour un chatbot à partir d'un « knowledge graph ». (Projet MITACS - Maîtrise en gestion, Science des données et analytique d'affaires). HEC Montréal. Fu Zhe (2018). Apprentissage non supervisé de la segmentation lexicale automatique du chinois basé sur les réseaux bayésiens avec application aux textes des médias sociaux. (Thèse de doctorat en informatique cognitive). Université du Québec à Montréal. Nizar Gazzawi (2016). Du terme prédicatif au cadre sémantique : méthodologie de compilation d'une ressource terminologique pour les termes arabes de l'informatique. (Thèse de doctorat). Université de Montréal. Mohamed Mahdi Boudabous (2017). Construction d'ontologies arabes basées sur des patrons lexico-sémantiques. (Thèse de doctorat en informatique). Université de Sfax, Tunisie. Rahma Sellami (2016). Exploitation de corpus comparables pour la traduction automatique statistique. (Thèse de doctorat en informatique). Université de Sfax, Tunisie. Razieh Mehri (2014). Inferring Missing Schema from Linked Data using Formal Concept Analysis (FCA). Mémire de Maîtrise en informatique. Université du Québec à Montréal. Ahmed Loubiri (2012). Utilisation d'une Ontologie et du Réseau Social Facebook pour la Modélisation du Contexte pour les Applications Mobiles Dépendantes du Contexte. Mémoire de Maîtrise en informatique. Université du Québec à Montréal. ...",
  "content_length": 5794,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:19"
}