{
  "name": "Fatma Deniz",
  "homepage": "https://www.fatmanet.com",
  "status": "success",
  "content": "Fatma Deniz A cognitive computational neuroscientist and a data scientst working on understanding how the human brain works. Welcome Who am I? I am a Full Professor at the Faculty of Electrical Engineering and Computer Science and Vice President for Digitalization and Sustainability at the Technische Universitaet Berlin. My group is interested in understanding how complex information is encoded in the brain. To understand this we use machine-learning approaches to fit computational models to large-scale brain data acquired during natural tasks. Currently, we explore how more than one language can coexist in the human brain. Before joining the TU Berlin, I was a postdoctoral researcher and exceptional principal investigator at the Helen Wills Neuroscience Institute in UC Berkeley, a Moore-and-Sloan Data Science Fellow at the Berkeley Institute for Data Science , and DAAD postdoctoral fellow at International Computer Science Institute (ICSI) in Berkeley. I did my Ph.D. in Computational Neuroscience at Bernstein Center for Computational Neuroscience in Berlin, obained a M.Sc. in Computer Science from the Technical University of Munich and worked at California Institute of Technology during my master’s thesis. I routinely disregard disciplinary boundaries and follow my curiosity. This makes my work lie at the intersection between data science, neuroscience and artificial intelligence. I design and promote approaches for scientific reproducibility and co-edited a book on reproducibility published here. Here is an online version of the book. I also worked on improving online user authentication applications using image based authentication procedures combined with knowledge gained from cognitive neuroscience (Check MooneyAuth ) and created a database of two-tone Mooney images. E-mail me if you would like to use those for your research. Code is available on GitHub. I am a passionate coder, baker, and I love feeling the resonance when I play the cello which makes me simply happy. Publications Book Kitzes, J., Turek D., Deniz F., editors, The Practice of Reproducible Research: Case Studies in Data Science , UC Press, 2017. Online version book available at https://www.practicereproducibleresearch.org/. Book Chapters Deniz F., \"pyMooney: Generating a Database of Two-Tone, Mooney Images \". In The Practice of Reproducible Research: Case Studies in Data Science. Kitzes, J., Turek D., Deniz F., editors. UC Press, 2017 Turek D., Deniz F., \"Introducing the Case Studies\". In The Practice of Reproducible Research: Case Studies in Data Science. Kitzes, J., Turek D., Deniz F., editors. UC Press, 2017 Journal and conference publications Negi, A.*, Oota, S. R.*, Nunez-Elizalde, A., Gupta, M., Deniz F., Brain-Informed Fine-Tuning for Improved Multilingual Understanding in Language Models. NeurIPS, 2025 (accepted). Chen C., Dupre la Tour T., Gallant J. L., Klein D., Deniz F., The cortical representation of language timescales is shared between reading and listening. Nature Communications Biology 7, 284, 2024 Elfaramawy N. Deniz F. Grunske L., Hilbrich M., Kehrer T., Lamprecht A-L., Mendling J., Weidlich M., On Managing Large Collections of Scientific Workflows. Modellierung 2024 Satellite Events. Gesellschaft für Informatik e.V.. RDiMOD. Potsdam. March 12-15 Gong X. L., Huth A. G., Deniz F., Johnson K., Gallant J. L., Theunissen F. E. Phonemic segmentation of narrative speech in human cerebral cortex. Nature Communications, 14:4309, 2023 Deniz F.*, Tseng C.*, Wehbe L., Dupre la Tour T., Gallant J. L., Semantic representations during language comprehension are affected by context. Journal of Neuroscience, Featured Research March 28th, 2023 Lamarre M., Chen C., Deniz F., Attention weights accurately predict language representations in the brain. Association for Computational Linguistics: EMNLP (Empirical Methods in Natural Language Processing), pages 4513–4529, 2022 Popham S., Huth A. G., Bilenko N. Y., Deniz F., Gao, S. J., Nunez-Elizalde A., Gallant J. L., Visual and linguistic semantic representations are aligned at the border of human visual cortex.Nature Neuroscience 24, 1628-1636, 2021 Ramakrishnan K. and Deniz F., Non-Complementarity of Information in Word-Embedding and Brain Representations in Distinguishing between Concrete and Abstract Words . In Proceedings of NAACL HLT Workshop on Cognitive Modeling and Computational Linguistics (CMCL), 2021 Deniz F., Nunez-Elizalde A.O., Huth A. G., Gallant J. L., The representation of semantic information across human cerebral cortex during listening versus reading is invariant to stimulus modality. Journal of Neuroscience, 39(39):7722-7736, 2019 Wu M.*, Deniz F.*, Prenger R., Gallant J. L., The unified maximum a posteriori (MAP) framework for neuronal system identification. (* First authorship shared), arXiv, https://arxiv.org/abs/1811.01043, 2018 Holdgraf C., Culich A., Rokem A., Deniz F., Ushuzima D., Alegro M., Portable learning environments for hands-on computational instruction: Using container- and cloud-based technology to teach data science. In Proceedings of the Practice and Experience in Advanced Research Computing on Sustainability, Success and Impact (p. 32), ACM, 2017 Castelluccia C., Duermuth M., Golla M., Deniz F.., MooneyAuth: Towards Practical Implicit Memory-based Authentication. In Network and Distributed System Security Symposium (NDSS), 2017 Kizilirmak J. M., Gomes da Silva J. G., Imamoglu F., Richardson-Klavehn A., Generation and the subjective feeling of \"aha!\": Independent contributions to learning from insight. Psychological research 80 (6), 1059-1074, 2015 Castelluccia C., Duermuth M., Imamoglu F., Learning from Neuroscience to Improve Internet Security. ERCIM News, Research and Innovation, 99:46, 2014 Imamoglu F., Heinzle J., Imfeld A., Haynes J.-D., Activity in high-level brain regions reflects visibility of low-level stimuli. Neuroimage, 102:688-694, 2014 Imamoglu F., Kahnt T., Koch C., Haynes J.-D., Changes in functional connectivity support conscious object recognition. Neuroimage, 63:1909-17, 2012 Projects Reproducibility in Science Language Representations in the Brain BOLDpredictions MooneyAuth pyMooney: Mooney image database Visual Awareness Press AI, Sustainability, Politics Süddeutsche Zeitung \"SDGs als Kompass für eine nachhaltige Gestaltung von KI\" (in German) RBB. \"Sam Altman in Berlin: \"Nutzt KI, um nicht abgehängt zu werden\" (in German) AOK Presse und Politik \"Wir erforschen das Gehirn, um die KI besser zu verstehen und umgekehrt (in German) AI and Future ARD-Audiothek. \"Der KI Podcast. Was kommt nach ChatGPT?” (in German) BR24. \"Die Zukunft der KI: Lernen von menschlicher Intelligenz?” (in German) \"MIT Technology Review: “A map of the brain could help to guess what you’re reading” Heise Magazine Technology Review: \"Hirnscan verrät, was Menschen lesen\" (in German) DAAD Worldwide \"Neurowissenschaft und Informatik Hand in Hand\" (in German) Neuroscience SR Mediathek: “Lesen oder Hören? Was ist besser für' s Gehirn?\" Zeit Online: “Ist Hörbuchhören genauso viel wert wie Lesen?\" Tagesspiegel: “Hören oder Lesen?: Ein Blick ins Gehirn zeigt, wann mehr vom Text hängen bleibt\" Discover Magazine: “Audiobooks or Reading? To Our Brains, It Doesn't Matter\" The Daily Californian: “UC Berkeley study finds human brains similarly stimulated by reading, listening” The Telegraph: “End of audiobook snobbery as scientists find reading and listening activates the same parts of the brain” UA Magazine: “Paper or Audio? It’s All the Same to your Brain. End of Story” ScienceDaily: “A map of the brain can tell what you're reading about” Medical News Today: “Listening and reading evoke almost identical brain activity” PhillyVoice: “Reading and listening to books stimulates the same areas of the brain\" India Today: “Whether you are reading or listening, your brain responds the same way to similar content\" MedicalXpress: “A map of the brain can tell what you're reading\" Contact deniz@tu-berlin.de",
  "content_length": 8041,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:21"
}