{
  "name": "Fausto Giunchiglia",
  "homepage": "http://fausto.disi.unitn.it",
  "status": "success",
  "content": "Fausto Giunchiglia Fausto Giunchiglia Researchpaddingpadd Teachingpaddingpadd Publicationspaddingpadd Presentationspaddingpadd Projects The Knowdive Group The DataScientia Initiative Students Elementor #325 Guess â Compute â CompareHow do we come to the guessing?How can we learn how to guess? Professor of Computer Science, University of Trento, EURAI fellow, member of the Academia Europaea. My current research interest: Computational models of the mind and implications on how the known is grounded in the unknown. I studied or had positions at the Universities of Genoa, Stanford, Edinburgh, and at the research center IRST, now Foundation Bruno Kessler (FBK). Around ten Best Paper Awards; more than fifty invited talks; chair of more than ten events, among them: ICDCS 2020, KSEM 2018, ODBASE 2008, IJCAI 2005, Mobiquitous 2004, Context 2003, AOSE 2002, Coopis 2001, KR&R 2000, FLOC 1999. I am/have been editor or editorial board member of around ten journals, among them: Journal of Data Semantics, Journal of Autonomous Agents and Multi-agent Systems, Journal of applied non Classical Logics, Journal of Software Tools for Technology Transfer, Journal of Artificial Intelligence Research. I was member of the IJCAI Board of Trustees, President of IJCAI, President of KR, Inc., Advisory Board member of  KR, Inc., Founder and Steering Committee of the  CONTEXT conference. I have covered all the spectrum from theory to technology transfer and innovation. Some relevant roles: Member of the Panel “Computer Science and Informatics” of the European Research Council (ERC), “ERC Advanced Grantsâ, Chair of the International Advisory board of the Scottish Informatics and Strategic Informatics and Computer Science Alliance (SICSA) of the 10 Scottish Universities; Coordinator of the task-force in charge of the definition of the Italian National Research Program in ICT; Scientific Coordinator of the Italian Platform for the Future Internet, sponsored by the Italian Industrial Association and the Ministry of Research; Co-founder and first president of GraphiTech, a member of the IniGraphicsNet foundation; Co-founder and first Head of the Department of Computer Science and Information Engineering of the University of Trento; Vice-rector of the University of Trento in charge of ICT and innovation. My current innovation interest: How to enable worldwide diversity- aware data-driven social innovation. My profile at Digital University@UnitnMy Research Group: Knowdive@UnitnMy Social Innovation Initiative: DataScientia © 2025 Fausto Giunchiglia",
  "content_length": 2562,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:22"
}