{
  "name": "Faysal Hossain Shezan",
  "homepage": "https://fhshezan.github.io",
  "status": "success",
  "content": "Faysal Hossain Shezan Faysal Hossain Shezan Email: faysal.shezan@uta.edu Google Scholar | DBLP | Twitter News (Archived News) November'25: Received Roots of Dedication-Service Award from UTA! September'25: Our paper on GDPR consent violation got accepted to IEEE S&P'26. Congrats Ying and the team! August'25: Invited to serve TPC in CCS'26 and USENIX'26 July'25: Received NSF grant! Thanks NSF for supporting our research. May'25: Invited to serve TPC in NDSS'26 and IEEE S&P'26 April'25: Received Microsoft Research Award!!! Feb'25: Invited to serve TPC in RAID'25 and IEEE SecDev'25 Jan'25: Our SoK paper on vulnerability repair got accepted to USENIX'25! Oct'24: Invited to serve in CCS 2025 Oct'24: Got CoE Research Experiences for Undergraduates (REU) Program Grant! Sep'24: Invited as Systems Reviewer for WWW 2025 Aug'24: Two exciting projects got departmental REU support. Thanks UTA CSE department! July'24: TPC USENIX 2025 June'24: TPC IEEE S&P 2025 Apr'24: Received Sub-Star award. Thanks College of Engineering for supporting our research on Security and Privacy issues for emerging platforms. Apr'24: TPC NDSS 2025 Jan'24: Organizing a workshop in OurCS@DFW Dec'23: TPC CCS 2024 Dec'23: Received Microsoft Azure credit. Thanks Microsoft! Dec'23: Awarded departmental REU support. Thanks UTA CSE department! Sep'23: TPC ICWSM 2024 Sep'23: Received University of Texas System Rising Stars Award. Thanks UT! Aug'23: TPC The Web Conf 2024 Aug'23: TPC IEEE S&P 2024 Aug'23: Excited to start my new role as an Assistant Professor at UTA! \"How To\"s for my student How to manage your advisor How to do great research How to read research papers How to write a bad paper How to write a good security paper How to have a bad career in research How to present your research work How to have a successful and rewarding career I am an assistant professor at the University of Texas at Arlington. My research focus on the intersection of security & privacy with cyber-physical systems, medical healthcare, software engineering, and machine learning. I am especially interested in data-driven security and privacy analysis in cross-platform interaction of emerging systems and platforms. The goal of my research is to measure the attack surface of the IoT platforms, analyze privacy leakages among inter-connected home automation applications, privacy leakages in medical healthcare, and investigate the enforcement of privacy policies. My work has been published in several top tier security & privacy and system conferences, including- IEEE S&P, USENIX, NDSS, UBICOMP/IMWUT, WWW, PoPETs, SOUPS. My research findings are acknowledged by several well-known companies (such as., Google) and resulted in the publishing of several CVEs. I am fortunate to receive a few awards and recognition during his Ph.D., including- CPS Rising Stars, UVA endowed graduate fellowship award, Link Lab outstanding graduate research award, and several travel grants. I received my PhD at University of Virginia (UVA) under the supervision of Professor Yuan Tian in 2023. I interned at Baidu Research (with Dr. Ping Li and Dr. Yingjie Lao). Before joining UVA, I was a software engineer (in security lab) at Kona Software Lab ltd in Bangladesh. I have completed my bachelor’s degree from the Computer Science and Engineering department of Bangladesh University of Engineering and Technology in 2016. Teaching CSE 4380/5380: Information Security 1 [Fall 2025, 2024, 2023] CSE 4380: Information Security 1 [Spring 2025, 2024] Selected Publications C15. Ying Li, Wenjun Qiu, Faysal Hossain Shezan, Kunlin Cai, Michelangelo van Dam, Lisa Austin, David Lie, Yuan Tian, Breaking the illusion: Automated Reasoning of GDPR Consent Violations, Proceedings of The 46th IEEE Symposium on Security and Privacy, 2026 [pdf] C14. Ying Li, Faysal Hossain Shezan, Bomin Wei, Gang Wang, Yuan Tian, SoK: Towards Effective Automated Vulnerability Repair, Proceedings of The 34th USENIX Security Symposium (USENIX Security), 2025 [pdf] C13. McKenna McCall, Eric Zeng, Faysal Hossain Shezan, Mitchell Yang, Lujo Bauer, Abhishek Bichhawat, Camille Cobb, Limin Jia, Yuan Tian, Towards Usable Security Analysis Tools for Trigger-Action Programming, Symposium on Usable Privacy and Security (SOUPS), 2023 [pdf]. C12. Faysal Hossain Shezan, Minjun Long, David Hasani, Gang Wang, Yuan Tian, SenRev: Measurement of Personal Information Disclosure in Online Health Communities, Proceedings of Privacy Enhancing Technologies Symposium (PoPETs/PETS), 2023 [pdf]. C11. Faysal Hossain Shezan, Zihao Su, Mingqing Kang, Nicholas Phair, Patrick William Thomas, Michelangelo van Dam, Yinzhi Cao, and Yuan Tian, CHKPLUG: Checking GDPR Compliance of WordPress Plugins via Cross-language Code Property Graph, Proceedings of Network & Distributed System Security Symposium (NDSS), 2023 [pdf]. C10. Faysal Hossain Shezan, Yingjie Lao, Minlong Peng, Xin Wang, Mingming Sun, Ping Li, NL2GDPR: Automatically Develop GDPR Compliant Android Application Features from Natural Language, Proceedings of the IEEE Conference on Communications and Network Security (IEEE CNS), 2022 [pdf]. J2/C9. Faysal Hossain Shezan, Hang Hu, Gang Wang, Yuan Tian, VerHealth: Vetting Medical Voice Applications through Policy Enforcement, Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), 2021 [pdf]. [Also presented at The 2021 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 2021).] J1/C8. Yeonjoon Lee, Yue Zhao, Jiutian Zeng, Kwangwuk Lee, Nan Zhang, Faysal Hossain Shezan, Yuan Tian, Kai Chen, Xiaofeng Wang, SPEAKER-RADAR: a Sonar-based Liveness Detection System for Protecting Smart Speakers Against Remote Attackers, Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT), 2020 [pdf]. [Also presented at The 2020 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 2020).] C7. Faysal Hossain Shezan, Hang Hu, Jiamin Wang, Gang Wang, Yuan Tian, Read Between the Lines: An Empirical Measurement of Sensitive Applications of Voice Personal Assistant Systems, Proceedings of the The Web Conference, 2020 [pdf] [slides] [video]. C6. Faysal Hossain Shezan, Kaiming Cheng, Zhen Zhang, Yinzhi Cao, Yuan Tian, TKPERM: Cross-platform Permission Knowledge Transfer to Detect Overprivileged Third-party Applications, Proceedings of the The Network and Distributed System Security Symposium (NDSS), 2020 [pdf] [slides] [video]. C5. Faysal Hossain Shezan, Syeda Farzia Afroze, Anindya Iqbal, Vulnerability Detection in Recent Android Apps: An Empirical Study, Proceedings of the International Conference on Networking, Systems and Security (NSysS), 2017 [pdf]. C4. Ishtiaque Ahmed, Shion Guha,Md. Rashidujjaman Rifat, Faysal Hossain Shezan, Nicki Dell, Privacy in Repair: An Analysis of the privacy Challenges Surrounding Broken Digital Artifacts in Bangladesh, Proceedings of the Information Technologies & International Development (ITID), 2017 [pdf]. C3. Bashima Islam, Faysal Hossain Shezan, Rifat Shahriyar, Privacy in Repair: Challenges around the Broken Digital Objects in Bangladesh, Proceedings of the High Performance Computing and Communications (HPCC), 2016 [pdf].] C2. Ishtiaque Ahmed, Shion Guha,Md. Rashidujjaman Rifat, Faysal Hossain Shezan, Nicki Dell, Privacy in Repair: An Analysis of the privacy Challenges Surrounding Broken Digital Artifacts in Bangladesh, Proceedings of the Information and Communication Technologies and Development (ICTD), 2016 [pdf]. C1. Shah Saifur Rahman, Sayera Sun-um Nusaka, Faysal Hossain Shezan, M. A. Rashid Sarkar, The Development of Low Cost Exercise Monitoring Device for Paralytic, Proceedings of the 2019 IEEE International WIE Conference on Electrical and Computer Engineering (WIECON-ECE), 2015 [pdf].",
  "content_length": 7807,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:23"
}