{
  "name": "Federico Fusco",
  "homepage": "https://sites.google.com/uniroma1.it/federicofusco/home",
  "status": "success",
  "content": "Federico's Web SiteSearch this siteEmbedded FilesSkip to main contentSkip to navigationPersonal Web Site of Federico FuscoWelcome to my Web PageHi, I am Federico Fusco, an Assistant Professor at Sapienza University of Rome. Previously, I was a PostDoc and completed my PhD under the supervision of Stefano Leonardi at the same University.My Research Areas are Algorithmic Game Theory, Online Learning, and Submodular Maximization. I am also generally interested in Algorithms and Machine learning. Some links: DBLP, Google Scholar, Scopus. Short Bio:2025 - present: Assistant Professor (Tenure Track) at Sapienza2023 - 2025: Assistant Professor (Non-Tenure Track) at Sapienza;2022 - 2023: postDoc at Sapienza;2021 - 2022: Student Researcher at Google Zurich;2021: Research Intern at Google Zurich;2018 - 2022:  PhD in Data Science, XXXIV cycle, Sapienza.Contactsemail: federico.fusco (at) uniroma1.itOffice: Room B118. Department of Computer, Control and Management Engineering Antonio Ruberti, Sapienza Università di Roma. Via Ariosto 25, 00185 Roma, ItalyNews:October 2025 - I will give a talk at the Algorithmic Learning in Games Seminars (ALiGS) on my recent FOCS paper. [YouTube] The paper \"Nearly Tight Regret Bounds for Profit Maximization in Bilateral Trade\" with Chris, Simone, and Paul has been accepted at FOCS'25. [arXiv]July 2025 - I will participate to the Archimedes Workshop on Algorithmic Game Theory (website). See you in AthensJuly 2025 - I will participate to the Google Market Algorithms Workshop 2025 (website). See you in Mountain View.I am organizing with Andrea, Stefano, Yuri, Carmine, and Riccardo the Second Workshop on Al­go­rithms, Learn­ing, and Games (ALGA 25) that will be held this Summer in Sardinia. See you there.I am organizing with Andrea, Matteo, and Tom the Workshop on Online Learning & Economics (website) at EC'25. See you there. I am organizing with Martino a tutorial on Bilateral Trade and Online Learning (website) at EC'25. See you there. The paper \"Online Learning in the Random-Order Model\" with Martino, Andrea, Riccardo, Stefano, and Matteo has been accepted at ICML '25. [arXiv]April 2025 - I will participate to the Workshop From Matching to Market (website). See you in Cargese. March 2025 - Talk on Online Learning and Economics available on YouTube [Google Tech Talk]March 2025 - visit to Anupam Gupta at NYU. The paper \"The Cost of Consistency: Submodular Maximization with Constant Recourse\" with Paul, Silvio, Ashkan, Ola, and Morteza has been accepted at STOC'25 [arXiv]Report abuseReport abuse",
  "content_length": 2556,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:27"
}