{
  "name": "Federica Arrigoni",
  "homepage": "https://federica-arrigoni.github.io",
  "status": "success",
  "content": "Federica Arrigoni Short Bio Federica Arrigoni is Associate Professor with the Dipartimento di Elettronica, Informazione e Bioingegneria (DEIB) of the Politecnico di Milano (Italy). She received her MS degree in Mathematics from the University of Milan (Italy) in 2013, and the PhD degree in Industrial and Information Engineering from the University of Udine (Italy) in 2018. Her PhD thesis titled “Synchronization Problems in Computer Vision” was awarded from the Italian Association for Computer Vision, Pattern Recognition and Machine Learning (CVPL) in 2018 and from the University of Udine in 2019. From 2018 to 2020 she was a junior researcher with the Czech Technical University in Prague (Czech Republic), from 2020 to 2022 she worked as an assistant professor (RTD-A) with the University of Trento (Italy), while from 2022 to 2024 she was a tenure-track assistant professor (RTD-B) with the Politecnico di Milano (Italy). She is associate editor of CVIU, she regularly serves as reviewer for CVPR, ECCV and ICCV, and she was acknowledged as an outstanding reviewer at CVPR 2021. She co-organized workshops and tutorials at CVPR 2020, ICCV 2021, CVPR 2022 and ECCV 2024. She is the main author of the paper entitled “Viewing Graph Solvability via Cycle Consistency” that won the Best Paper Honorable Mention at ICCV 2021 (corresponding to top-5 papers out of 1612 accepted papers). Her follow-up paper entitled “Viewing graph solvability in practice” was shortlisted among best paper candidates at ICCV 2023 (corresponding to top 17 papers out of 2161 accepted papers). Her research focuses on geometric problems in 3D Computer Vision. News Oct 1, 2024 I became associate professor at Politecnico di Milano! Oct 4, 2023 Best Paper Finalist at ICCV 2023 - Federica Arrigoni, Tomas Pajdla and Andrea Fusiello. Viewing graph solvability in practice. Jun 1, 2022 I started a new position as a tenure-track assistant professor (RTD-B) at Politecnico di Milano! Oct 12, 2021 Best Paper Honorable Mention at ICCV 2021 - Federica Arrigoni, Andrea Fusiello, Elisa Ricci and Tomas Pajdla. Viewing graph solvability via cycle consistency. https://iccv2021.thecvf.com/iccv-2021-paper-awards Apr 18, 2021 Welcome to my website :)",
  "content_length": 2224,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:25"
}