{
  "name": "Fei-Fei Li 0001",
  "homepage": "http://vision.stanford.edu/feifeili",
  "status": "success",
  "content": "Fei-Fei Li's Profile | Stanford Profiles Fei-Fei Li Sequoia Capital Professor, Denning Co-Director (On Leave) Stanford Institute for Human-Centered AI, Senior Fellow at HAI and Professor, by courtesy, of Operations, Information and Technology at the Graduate School of Business Computer Science On Partial Leave from 01/01/2024 To 12/31/2025 Print Profile Email Profile View Stanford-only Profile Tab Menu Bio Research & Scholarship Teaching Publications Bio Dr. Fei-Fei Li is the inaugural Sequoia Professor in the Computer Science Department at Stanford University, and a Founding Co-Director of Stanford’s Human-Centered AI Institute. She served as the Director of Stanford’s AI Lab from 2013 to 2018. And during her sabbatical from Stanford from January 2017 to September 2018, Dr. Li was Vice President at Google and Chief Scientist of AI/ML at Google Cloud. Dr. Li has served as a Board member or advisor in various public or private companies. She is currently a Co-founder/CEO of World Labs, an AI company focusing on Spatial Intelligence and generative AI.Dr. Fei-Fei Li obtained her B.A. degree in physics from Princeton in 1999 with High Honors, and her PhD degree in electrical engineering from California Institute of Technology (Caltech) in 2005. She has been recognized as the Distinguished Alumni by both Princeton and Caltech in 2020 and 2024 respectively. Dr. Li also holds a Doctorate Degree (Honorary) from Harvey Mudd College. Dr. Fei-Fei Li’s current research interests include AI, machine learning, deep learning, computer vision, robotic learning, and ambient intelligence for healthcare delivery. In the past she has also worked on cognitive and computational neuroscience. Dr. Li has published more than 400 scientific articles in top-tier journals and conferences in science, engineering and computer science. Dr. Li is the inventor of ImageNet and the ImageNet Challenge, a critical large-scale dataset and benchmarking effort that has been widely regarded as one of the three driving forces of the birth of modern AI and deep learning revolution. In 2023, Dr. Li published a science memoir called “The Worlds I See: Curiosity, Exploration and Discovery at the Dawn of AI”, published by Macmillan Publishers.Dr. Li has been working with policymakers nationally and locally to ensure positive and human-centered progress in AI technologies, including a number of U.S. Senate and Congressional testimonies, her service as a special advisor to the Secretary General of the United Nations, a member of the California Future of Work Commission for the Governor of California in 2019 - 2020, and a member of the National Artificial Intelligence Research Resource Task Force (NAIRR) for the White House Office of Science and Technology Policy (OSTP) and the National Science Foundation (NSF) in 2021-2022. She has delivered numerous speeches including to the President of the United States, and the Security Council of the United Nations.Dr. Li is an elected Member of the National Academy of Engineering (NAE), the National Academy of Medicine (NAM) and American Academy of Arts and Sciences (AAAS). She is also a Fellow of ACM, a member of the Council on Foreign Relations (CFR). Among her many recognitions, Dr. Li is a laureate of the VinFuture Prize (2024), a recipient of the Intel Lifetime Achievements Award (2023), the IEEE PAMI Thomas Huang Memorial Prize (2022), the IEEE PAMI Longuet-Higgins Prize (2019), the National Geographic Society Further Award (2019), the IAPR J.K. Aggarwal Prize (2016), the IEEE PAMI Mark Everingham Award (2016), the Alfred Sloan Faculty Award (2011), the NSF CAREER award (2009), the Microsoft Research New Faculty Fellowship (2006), among others. Dr. Li is a keynote speaker at many academic or influential conferences, including the World Economics Forum (Davos), the Grace Hopper Conference 2017 and the TED2015 and TED2024. Dr. Li was recognized as one of the Time Magazine AI100 influencers in 2023, Women in Tech by the ELLE Magazine (2017), a Global Thinker of 2015 by Foreign Policy, and one of the “Great Immigrants: The Pride of America” in 2016 by the Carnegie Foundation, past winners include Albert Einstein, Yoyo Ma, Sergey Brin, et al.(Dr. Li publishes under the name L. Fei-Fei) Academic Appointments Professor, Computer Science Senior Fellow, Institute for Human-Centered Artificial Intelligence (HAI) Professor (By courtesy), Operations, Information & Technology Member, Bio-X Co-Director, Institute for Human-Centered Artificial Intelligence (HAI) Member, Wu Tsai Neurosciences Institute Administrative Appointments Co-Director, Stanford Institute of Human-Centered AI (HAI) (2019 - Present) Director, Stanford Artificial Intelligence Lab (SAIL) (2013 - 2018) Honors & Awards Queen Elizabeth Prize for Engineering, Queen Elizabeth Prize for Engineering Foundation (2025) VinFuture Prize, VinFuture Foundation (2024) Woodrow Wilson Award (\"highest honor to an undergraduate alumni\"), Princeton University (2024) Intel Lifetime Achievements Innovation Award, Intel (2023) Time AI100, Time Magazine (2023) Thomas S. Huang Memorial Prize, IEEE PAMI (2022) Member, American Academy of Arts and Sciences (AAAS) (2021) Member, National Academy of Medicine (NAM) (2020) Member, National Academy of Engineering (NAE) (2020) Distinguished Alumni Award Winner, California Institute of Technology (2020) Member, Council on Foreign Relations (CFR) (2020) Fellow, ACM (2018) Technical Leadership Abie Award, AnitaB.org (2019) PAMI Longuet-Higgins Prize, IEEE (2019) Further Award, National Geographic Society (2019) Best Paper Award, International Conference on Robotics and Automation (ICRA) (2019) WITI@UC Athena Award for Academic Leadership, U.C. Berkeley (2017) J.K. Aggarwal Prize, International Association for Pattern Recognition (IAPR) (2016) One of the 40 “The great immigrants”, Carnegie Foundation (2016) Mark Everingham Prize, IEEE PAMI (2016) Pioneer in AI Research Award, NVidia (2016) One of the Leading Global Thinkers, Foreign Policy (2015) IBM Faculty Fellowship Award, IBM (2014) Fellowship, Alfred P. Sloan (2011) W.M. Keck Foundation Faculty Scholar, Stanford University (2012) Career Award, NSF (2009) New Faculty Fellowship, Microsoft Research (2006) Best Short Course Prize, IEEE ICCV (2005) Postgraduate Fellowship, National Science Foundation (1999 - 2003) Fellowship for New Americans, Paul and Daisy Soros (1999 - 2003) Martin Dale Fellowship, Princeton University (1999 - 2000) Kusaka Memorial Prize in Physics, Princeton University (1999) Best Paper (Runner-Up), IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2010) W.M. Keck Faculty Scholar, Stanford University (2012-2016) Boards, Advisory Committees, Professional Organizations Special Advisor to Secretary General, United Nations (2023 - Present) Member, National AI Research Resource Task Force, White House OSTP and NSF (2021 - 2023) Co-Founder/Chairperson of the Board, AI4ALL (non-profit organization for inclusive AI education) (2015 - Present) Fellow, ACM (2014 - Present) Board of Directors, Computer Vision Foundation (non-profit organization supporting computer vision research) (2019 - Present) Senior Member, IEEE (2003 - Present) Professional Education Ph.D. (Honorary), Harvey Mudd College, Engineering (2022) B.A., Princeton University, Physics (1999) Master, California Institute of Technology, Electrical Engineering (2001) PhD, California Institute of Technology, Electrical Engineering (2005) Contact Academic feifeili@stanford.edu University - Faculty Department: Computer Science Position: Professor University - Faculty Department: Human-Centered Artificial Intelligence Position: Senior Fellow Administrator Harini Sreepathi Administrative Associate harinis@stanford.edu 650-497-9873 (office) Additional Info Mail Code: 9015 Links Curriculum Vitae PDF Stanford Vision and Learning Lab website Current Research and Scholarly Interests AI, Machine Learning, Computer Vision, Robotics, AI+Healthcare, Human Vision 2025-26 Courses AI-Assisted CareBIOE 277, CS 337, MED 277, PSYC 278 (Aut) Deep Learning for Computer VisionCS 231N (Spr) Independent Studies (17) Advanced Reading and ResearchCS 499 (Aut, Win, Spr) Advanced Reading and ResearchCS 499P (Aut, Win, Spr) Curricular Practical TrainingCS 390A (Aut, Win, Spr) Curricular Practical TrainingCS 390B (Aut, Win, Spr) Curricular Practical TrainingCS 390C (Aut, Win, Spr) Directed Reading in NeurosciencesNEPR 299 (Aut, Win, Spr, Sum) Graduate ResearchNEPR 399 (Aut, Win, Spr, Sum) Independent ProjectCS 399 (Aut, Win, Spr) Independent ProjectCS 399P (Aut, Win, Spr) Independent WorkCS 199 (Aut, Win, Spr) Independent WorkCS 199P (Aut, Win, Spr) Master's ResearchCME 291 (Aut, Win, Spr) Part-time Curricular Practical TrainingCS 390D (Aut, Win, Spr) Programming Service ProjectCS 192 (Aut, Win, Spr) Senior ProjectCS 191 (Aut, Win, Spr) Supervised Undergraduate ResearchCS 195 (Aut, Win, Spr) Writing Intensive Senior Research ProjectCS 191W (Aut, Win, Spr) Prior Year Courses 2024-25 Courses AI-Assisted CareCS 337, MED 277 (Aut) Deep Learning for Computer VisionCS 231N (Spr) 2023-24 Courses Deep Learning for Computer VisionCS 231N (Spr) 2022-23 Courses Deep Learning for Computer VisionCS 231N (Spr) Stanford Advisees Postdoctoral Faculty Sponsor Ruohan Zhang Doctoral Dissertation Advisor (AC) Josiah Wong Master's Program Advisor Abi Lopez, Saba Weatherspoon Doctoral Dissertation Co-Advisor (AC) Bailey Trang Nguyen Doctoral (Program) Keshigeyan Chandrasegaran, Zane Durante, Cem Gokmen, Mohammadmahdi Honarmand, Wenlong Huang, Yunfan Jiang, Kyle Sargent, Tiange Xiang All Publications Guest Editorial: Introduction to the Special Section on Graphs in Vision and Pattern Analysis IEEE TRANSACTIONS ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE Bai, S., Torr, P. H. S., Krishna, R., Li, F., Gupta, A., Zhu, S. 2023; 45 (6): 6867-6869 View details for DOI 10.1109/TPAMI.2023.3259779 View details for Web of Science ID 000982475600018 Socially situated a",
  "content_length": 337140,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:37"
}