{
  "name": "Fei Wang 0001",
  "homepage": "https://wcm-wanglab.github.io/index.html",
  "status": "success",
  "content": "Homepage for Group of Professor Fei Wang Home Publications Group Member Presentations Teaching Department of Population Health Sciences Weill Cornell Medicine 425 E 61 St. New York City, NY 10065 Wang Lab Principal Investigator: Fei Wang. PhD. FACMI, FAMIA, FIAHSI, ACM Distinguished Member. Frances and John L. Leob Professor of Medical Informatics. Weill Cornell Medicine. Cornell University. Professor (Primary). Department of Population Health Sciences. Weill Cornell Medicine. Cornell University. Professor (Secondary). Department of Emergency Medicine. Weill Cornell Medicine. Cornell University. Associate Dean for Artificial Intelligence and Data Science. Weill Cornell Medicine. Cornell University. Chief. Division of Health Informatics and Artificial Intelligence. Department of Population Health Sciences. Weill Cornell Medicine. Cornell University. Founding Director. WCM Institute of AI for Digital Health. Weill Cornell Medicine. Cornell University. Founding Co-Director. WCM Data Coordination Center. Weill Cornell Medicine. Cornell University. Senior Faculty Fellow of Clinical AI. Cornell Tech. Senior Technical Advisor. New York Presbyterial Hospital. Adjunct Scientist. Hospital for Special Surgery. Faculty Fellow. Cornell Center for Data Science for Enterprise and Society. Faculty Fellow. Cornell Joan Klein Jacobs Center for Precision Nutrition and Health. Graduate Field Member. Computer Science. Graduate Field Member. Computational Biology. Graduate Field Member. Electrical and Computer Engineering. Graduate Field Member. Information Science. Graduate Field Member. Physiology, Biophysics and Systems Biology. Graduate Field Member. Population Health Sciences. Graduate Field Member. Statistics and Data Science. Graduate Field Member. Tri-Institutional PhD Program on Computational Biology and Medicine. [LinkedIn] [Twitter] [Contact] [Bio] [Vivo] I am looking for postdocs working on the intersection of AI and biomedicine. If you are interested, send me your CV and research statement. Research Interests Our lab is working on developing data mining and machine learning approaches for health data science. Health Data Science Predictive modeling of clinical risks Disease subtyping Computational drug discovery and design Knowledge graph Machine Learning and Data Mining Multi-modal learning Meta-learning and transfer learning Model interpretability and explainability Federated learning Model fairness",
  "content_length": 2435,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:32"
}