{
  "name": "Fei Wang 0014",
  "homepage": "https://finleywang.github.io",
  "status": "success",
  "content": "Fei Wang 王飞 Dr. Fei Wang is currently a Professor at Institute of Computing Technology, Chinese Academy of Sciences (CAS). He belongs to Research Center for Intelligent Equipment Systems and State Key Laboratory of AI Safety. He is working on the research, development, and application of spatio-temporal data mining, timeseries forecasting and AI4Science. Prior to that, he obtained his PhD degree at ICT, CAS under the supervision of Prof. Yongjun Xu. He is now also supervised by Prof. Xueqi Cheng. He published 50+ papers in journals (e.g., The Innovation, TKDE, TVT) and conferences (such as KDD, CIKM, ICDE, VLDB, ICML, AAAI, MM and ACL). His publications collectively gathered 5,300+ citations on Google Scholar, with h-index of 24. Among them, one paper was awarded as Best Paper by the world class journal The Innovation, one paper was awarded as Best Student Paper by DASFAA 2022, several papers (STEP, STID, DSFormer) were selected as the most influential papers ranked by PaperDigest, one paper entered ESI (Essential Science Indicators) Highly Cited Papers. He has served as the Youth Editor of The Innovation (IF=25.7, the 4th among Multidisciplinary Journals over the world; CiteScore=53.4, the 2nd among Multidisciplinary Journals over the world), and PC for prestigious conferences, including KDD, NeurIPS, IJCAI, AAAI, MM and so on. Our lab are actively seeking highly motivated and self-driven students (RA/Master/PhD). If you are interested, feel free to reach out! His research interests mainly lie in: Spatio-temporal (ST) data mining: ST foundation models, ST data synthesis, multi-source ST data fusion, ST model domain generalization. Time series (TS) analysis: TS foundation models, fair and scalable TS benchmarks, TS forecasting in critical scenarios, high-efficiency model. AI for Science: ST/TS data mining in Urban Science, Atmospheric Science, Ocean Science, Marine Science. His academic services include： Organization: Chair of CNCC 2025 Workshop, Publicity Chair of WebST 2025, Program Committee of IEEE CIS Task Force on AI for Time Series and Spatio-Temporal Data. PC Member: AAAI 2026, KDD 2026, Neurips 2025, ACM MM 2025, IJCAI 2025, KDD 2025, KDD 2024, AAAI 2024, AAAI 2023, AAAI 2022. Reviewer: IEEE TPAMI, IEEE TKDD, IEEE TKDE, IEEE TVT, The Innovation, Information Fusion, Pattern Recognition, Knowledge-Based Systems, Neural Networks. His main academic hornors and awards: 2025, “Project of Western Light for Interdisciplinary Team” of CAS 2025, TKDE 24 paper，ESI (Essential Science Indicators) Highly Cited Paper 2025, The Innovation Best Paper Award 2024, The Innovation Best Reviewer Award 2024, The Innovation Best Paper Award 2024, Most Liked Poster Award, Research Summit of Urban Sciences and Human Dynamics 2024, Most Influential CIKM 2022 Papers #1 (2024-09 ranked by PaperDigest) 2024, Most Influential CIKM 2023 Papers #5 (2024-09 ranked by PaperDigest) 2024, Most Influential KDD 2022 Papers #4 (2024-09 ranked by PaperDigest) 2022, Youth Innovation Promotion Association of CAS 2022, DASFAA Best Student Paper (DASFAA 2022) News Nov 09, 2025 Our Paper have been accepted by AAAI 26, congrats to Yujie Li and all coauthors！ Oct 30, 2025 Our BasicTS has now been upgraded to v1.0! Sep 19, 2025 Three Papers have been accepted by NeurIPS 2025, congrats to Yisong, Tangwen and all coauthors！ Aug 02, 2025 Dr. Fei Wang gives a talk about ST Data Compact Learning at NDBC 2025！ Jul 15, 2025 One TKDE paper about MTS heterogeneity has entered ESI high cited papers！ Jul 09, 2025 One Tutorial about MTS heterogeneity has been Accepted by SSTD 2025！ Jun 20, 2025 We have established IEEE CIS Task Force on AI for Time Series and Spatio-Temporal Data! May 15, 2025 Two papers, BLAST and Merlin, are accepted by KDD, congrats to Zezhi and Chengqing! May 12, 2025 Review of Foundation Model and Decision Intelligence is selected as Cover Paper! May 08, 2025 One amazing review about Decision Intelligence is accepted by The Innovation, congrats to all! May 01, 2025 One paper is accepted by ICML，congrats to all! Apr 29, 2025 One paper is accepted by TKDE，congrats to all! Feb 26, 2025 Dr. Fei Wang is selected as Youth Editor of The Innovation! Jan 19, 2025 One amazing review about MetaCity is accepted by The Innovation, congrats to all! Dec 26, 2024 One commentary about AI in autonomous vehicles is accepted by The Innovation, congrats to all! Dec 12, 2024 One commentary about Spatial-Temporal Large Models for Science is accepted by The Innovation, congrats to Zezhi! Dec 10, 2024 Two papers are accepted by AAAI, congrats to all! Nov 04, 2024 One editoral about AI impact on world is published on The Innovation, congrats to all! Selected Publications Innovation Artificial intelligence: A powerful paradigm for scientific research Yongjun Xu, Xin Liu, Xin Cao, Changping Huang, Enke Liu, Sen Qian, Xingchen Liu, Yanjun Wu, Fengliang Dong, Cheng-Wei Qiu, and 38 more authors The Innovation, Nov 2021 Best Paper Award Abs DOI Bib PDF Fei Wang receveid the Best Paper Award 2024 for the contribution to a comprehensive review of AI for Science Artificial intelligence (AI) coupled with promising machine learning (ML) techniques well known from computer science is broadly affecting many aspects of various fields including science and technology, industry, and even our day-to-day life. The ML techniques have been developed to analyze high-throughput data with a view to obtaining useful insights, categorizing, predicting, and making evidence-based decisions in novel ways, which will promote the growth of novel applications and fuel the sustainable booming of AI. This paper undertakes a comprehensive survey on the development and application of AI in different aspects of fundamental sciences, including information science, mathematics, medical science, materials science, geoscience, life science, physics, and chemistry. The challenges that each discipline of science meets, and the potentials of AI techniques to handle these challenges, are discussed in detail. Moreover, we shed light on new research trends entailing the integration of AI into each scientific discipline. The aim of this paper is to provide a broad research guideline on fundamental sciences with potential infusion of AI, to help motivate researchers to deeply understand the state-of-the-art applications of AI-based fundamental sciences, and thereby to help promote the continuous development of these fundamental sciences. @article{XU2021100179, title = {Artificial intelligence: A powerful paradigm for scientific research}, journal = {The Innovation}, volume = {2}, number = {4}, pages = {100179}, year = {2021}, month = nov, issn = {2666-6758}, doi = {https://doi.org/10.1016/j.xinn.2021.100179}, url = {https://www.sciencedirect.com/science/article/pii/S2666675821001041}, author = {Xu, Yongjun and Liu, Xin and Cao, Xin and Huang, Changping and Liu, Enke and Qian, Sen and Liu, Xingchen and Wu, Yanjun and Dong, Fengliang and Qiu, Cheng-Wei and Qiu, Junjun and Hua, Keqin and Su, Wentao and Wu, Jian and Xu, Huiyu and Han, Yong and Fu, Chenguang and Yin, Zhigang and Liu, Miao and Roepman, Ronald and Dietmann, Sabine and Virta, Marko and Kengara, Fredrick and Zhang, Ze and Zhang, Lifu and Zhao, Taolan and Dai, Ji and Yang, Jialiang and Lan, Liang and Luo, Ming and Liu, Zhaofeng and An, Tao and Zhang, Bin and He, Xiao and Cong, Shan and Liu, Xiaohong and Zhang, Wei and Lewis, James P. and Tiedje, James M. and Wang, Qi and An, Zhulin and Wang, Fei and Zhang, Libo and Huang, Tao and Lu, Chuan and Cai, Zhipeng and Wang, Fang and Zhang, Jiabao}, keywords = {artificial intelligence, machine learning, deep learning, information science, mathematics, medical science, materials science, geoscience, life science, physics, chemistry}, } VLDB Decoupled Dynamic Spatial-Temporal Graph Neural Network for Traffic Forecasting Zezhi Shao, Zhao Zhang, Wei Wei*, Fei Wang*, Yongjun Xu, Xin Cao, and Christian S. Jensen Proc. VLDB Endow., Jul 2022 The 3rd-Most Cited paper in VLDB 2022 Abs DOI Bib PDF Code The 3rd-Most Cited paper in VLDB 2022 2022 3/357 We all depend on mobility, and vehicular transportation affects the daily lives of most of us. Thus, the ability to forecast the state of traffic in a road network is an important functionality and a challenging task. Traffic data is often obtained from sensors deployed in a road network. Recent proposals on spatial-temporal graph neural networks have achieved great progress at modeling complex spatial-temporal correlations in traffic data, by modeling traffic data as a diffusion process. However, intuitively, traffic data encompasses two different kinds of hidden time series signals, namely the diffusion signals and inherent signals. Unfortunately, nearly all previous works coarsely consider traffic signals entirely as the outcome of the diffusion, while neglecting the inherent signals, which impacts model performance negatively. To improve modeling performance, we propose a novel Decoupled Spatial-Temporal Framework (DSTF) that separates the diffusion and inherent traffic information in a data-driven manner, which encompasses a unique estimation gate and a residual decomposition mechanism. The separated signals can be handled subsequently by the diffusion and inherent modules separately. Further, we propose an instantiation of DSTF, Decoupled Dynamic Spatial-Temporal Graph Neural Network (D2STGNN), that captures spatial-temporal correlations and also features a dynamic graph learning module that targets the learning of the dynamic characteristics of traffic networks. Extensive experiments with four real-world traffic datasets demonstrate that the framework is capable of advancing the state-of-the-art. @article{10.14778/3551793.3551827, author = {Shao, Zezhi and Zhang, Zhao and Wei, Wei and Wang, Fei and Xu, Yongjun and Cao, Xin and Jensen, Christian S.}, title = {Decoupled Dynamic Spatial-Temporal Graph Neural Network for Traffic Forecasting}, year = {2022}, publisher = {VLDB",
  "content_length": 32568,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:32"
}