{
  "name": "Fei Liu 0033",
  "homepage": "https://eecs.utk.edu/people/fei-liu",
  "status": "success",
  "content": "Fei Liu | Min H. Kao Department of Electrical Engineering and Computer Science Skip to content Skip to main navigation Report an accessibility issue Fei Liu Assistant Professor Contact Biography Research Contact Information Office Address: 612 Min H. Kao BuildingPhone: 865-974-0003E-mail: fliu33@utk.eduEducation PhD Robotics, University of Lyon (INSA de Lyon), France, 2016 MSc Control System and Automation Engineering, INSA de Lyon, France, 2013 BSc Control System and Automation Engineering, Northwestern Polytechnical University, China, 2012 Biography Fei Liu joined the University of Tennessee, Knoxville's Electrical Engineering and Computer Science (EECS) Department as an assistant professor in August 2024. Before joining UT, Liu was a postdoctoral researcher at the Advanced Robotics and Controls Lab at the University of California, San Diego (UCSD). Prior to that, he conducted research both at the Biorobotics Institute and at the Center for Bioinspired Soft Robotics at the Italian Institute of Technology (IIT), Italy. He earned his PhD from INSA de Lyon, one of France's top-ranked engineering institutions. Liu's research interests lie at the intersection of robotics, autonomous systems, and computational AI, with a particular focus on applications in unstructured environments. His work spans various fields, including biomedical, healthcare, manufacturing, industrial, and aerospace sectors. Over the past years, he has authored more than 30 papers in leading journals and conferences such as IEEE RA-L, T-BME, Robotica, ICRA, IROS, RSS, EMBC, among others. He also serves as a reviewer and committee member for these venues. Additionally, he received a nomination for the Best Paper Award at ICRA 2021 for his contributions to autonomous blood suction in surgical robotics. Research Surgical Robotics: robotic manipulation, tool-tissue interaction, intraoperative assistance, and clinical integration. Embodied AI: perception-action coupling, visual learning, sim-to-real transfer, and cross-embodiment skill generalization. Physics-Based Simulation and Modeling: deformation modeling, constraint-based solvers, differentiable simulation, and digital twins. Learning-Based Control and Planning: reinforcement learning, data-driven control, motion planning, and adaptive policy learning. Google Scholar The flagship campus of the University of Tennessee System and partner in the Tennessee Transfer Pathway.",
  "content_length": 2430,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:34"
}