{
  "name": "Fei Dou",
  "homepage": "https://fayedou.github.io",
  "status": "success",
  "content": "Homepage - Fei Dou Fei Dou Assistant Professor (Tenure-Track) School of Computing, the University of Georgia (UGA) Fei Dou is an Assistant Professor in the School of Computing at the University of Georgia. She obtained her Ph.D. in 2023 from the Department of Computer Science and Engineering at the University of Connecticut, where she worked in the Laboratory of Machine Learning & Health Informatics under the supervision of Prof. Jinbo Bi. Her work contributed to fundamental Machine Learning (ML) research for the Internet of Things (IoT) and Cyber-Physical Systems (CPS), particularly in the areas of federated learning, reinforcement learning, and self-supervised learning. Fei’s research focuses on advancing Machine Intelligence for Ubiquitous Computing in Distributed Systems, with an emphasis on scalable, responsible, and context-aware AI solutions. Join Us: Our lab is seeking highly self-motivated PhD students to explore cutting-edge research in AI, machine learning and intelligent sensing. fei_dot_dou_AT_uga_dot_edu Google Scholar GitHub Twitter LinkedIn Warning Problem: The current name of your GitHub Pages repository (\"\") does not match the recommended repository name for your site (\"\"). Solution: Please consider renaming the repository to \"\", so that your site can be accessed directly at \"http://\". However, if the current repository name is intended, you can ignore this message by removing \"{% include widgets/debug_repo_name.html %}\" in index.html. Action required Problem: The current root path of this site is \"\", which does not match the baseurl (\"\") configured in _config.yml. Solution: Please set the baseurl in _config.yml to \"\". Education University of Connecticut (UConn) Department of Computer Science and Engineering, Ph.D. Supervisor: Dr. Jinbo Bi Sep 2018 - May 2023 Honors & Awards Women of Innovation(WOI) Academic Innovation and Leadership, Connecticut 2023 Provost Recognition of Teaching Excellence, University of Connecticut 2017 News 2025 Award Received 2 collaborative EC3 grants from UGA. Sep 30 Paper One paper is accepted in TS4H @ NeurIPS 2025. Congratulations to Jiahui! Sep 04 Paper One paper is accepted in EMNLP 2025. Aug 20 Paper One paper is accepted in ACM Transactions on Embedded Computing Systems (TECS). Aug 12 Paper One paper is accepted in UbiComp/ISWC 2025. Congratulations to Weihang and Zishuai! Jul 17 Paper One paper is accepted in ICCV Findings 2025 for oral presentation. Jul 11 Award Received Sarah H. Moss Fellowship Award. Jul 03 Paper One paper is accepted in UbiComp/IMWUT 2025. May 10 Service Served as a panelist for NSF review panel. Jan 11 2024 Grant Received IAI Interdisciplinary Seed Grant as PI. Nov 06 Paper One paper is accepted in IEEE Transactions on Mobile Computing (TMC 2025). Sep 24 Paper One paper is accepted in PICASSO @ MobiCom 2024. Aug 21 Paper One paper is accepted in UbiComp/IMWUT 2024. Aug 19 Service Served as a panelist for DOE review panel. Jun 15 Award Received IAI Research Award. Apr 22 Paper Two papers are accepted in IEEE ICC 2024, one of the two IEEE Communications Society's flagship conferences. Jan 30 2023 Award I am thrilled and honored to be recognized as the Collegian Winner for the 2023 Women of Innovation (WOI) Academic Innovation and Leadership in Connecticut (one recipient statewide per year)! Please check out the latest news: patch, 8newsnow, UConnToday. Oct 22 Paper Two papers are accepted by NeurIPS 2023! Congratulations to all! Sep 21 Paper Please check our new vision paper on AGI in the IOT. Sep 15 I’m officially joining the School of Computing at the University of Georgia as a Tenure-Track Assistant Professor. Aug 01 Paper One paper is accepted by IEEE IOT-J 2023! May 10 Paper One paper is accepted by IJCAI 2023! Apr 11 Selected Publications (view all ) HELENE: Hessian Layer-wise Clipping and Gradient Annealing for Accelerating Fine-tuning LLM with Zeroth-order Optimization Huaqin Zhao*, Jiaxi Li*, Yi Pan, Shizhe Liang, Xiaofeng Yang, Wei Liu, Xiang Li, Fei Dou, Tianming Liu, Jin Lu (* equal contribution) Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP) 2025 This paper presents HELENE, a memory-efficient and scalable optimizer for fine-tuning large language models, addressing the slow convergence of zeroth-order methods like MeZO by incorporating annealed A-GNB gradients, diagonal Hessian estimation, and layer-wise clipping. HELENE achieves faster, more stable convergence with up to 20× speedup and improved accuracy, and it supports both full and parameter-efficient fine-tuning across large-scale models and tasks. [arXiv] HELENE: Hessian Layer-wise Clipping and Gradient Annealing for Accelerating Fine-tuning LLM with Zeroth-order Optimization Huaqin Zhao*, Jiaxi Li*, Yi Pan, Shizhe Liang, Xiaofeng Yang, Wei Liu, Xiang Li, Fei Dou, Tianming Liu, Jin Lu (* equal contribution) Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP) 2025 This paper presents HELENE, a memory-efficient and scalable optimizer for fine-tuning large language models, addressing the slow convergence of zeroth-order methods like MeZO by incorporating annealed A-GNB gradients, diagonal Hessian estimation, and layer-wise clipping. HELENE achieves faster, more stable convergence with up to 20× speedup and improved accuracy, and it supports both full and parameter-efficient fine-tuning across large-scale models and tasks. [arXiv] Multi-granularity Supervised Contrastive Learning with Online Adaptation for Contactless In-bed Posture Classification Yingjian Song, Haotian Xiang, Zixuan Zeng, Jiayu Chen, Yida Zhang, Zaid Farooq Pitafi, He Yang, Qin Lu, Xiang Zhang, Bradley G Phillips, Fei Dou, WenZhan Song Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (UbiComp/IMWUT) 2025 This paper presents a privacy-friendly, easy-to-deploy in-bed posture classification framework using seismic sensors, integrating a Multi-Granularity Supervised Contrastive Learning (MGSCL) module and an ensemble Online Adaptation (OA) module. The system effectively adapts to individual variations and unlabeled data, achieving high accuracy (91.67%) and F1 score (91.53%) with minimal labeled data in clinical settings, and maintaining strong performance in home environments, highlighting its potential for sleep quality and health monitoring. [Paper] Multi-granularity Supervised Contrastive Learning with Online Adaptation for Contactless In-bed Posture Classification Yingjian Song, Haotian Xiang, Zixuan Zeng, Jiayu Chen, Yida Zhang, Zaid Farooq Pitafi, He Yang, Qin Lu, Xiang Zhang, Bradley G Phillips, Fei Dou, WenZhan Song Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (UbiComp/IMWUT) 2025 This paper presents a privacy-friendly, easy-to-deploy in-bed posture classification framework using seismic sensors, integrating a Multi-Granularity Supervised Contrastive Learning (MGSCL) module and an ensemble Online Adaptation (OA) module. The system effectively adapts to individual variations and unlabeled data, achieving high accuracy (91.67%) and F1 score (91.53%) with minimal labeled data in clinical settings, and maintaining strong performance in home environments, highlighting its potential for sleep quality and health monitoring. [Paper] Self-Supervised Representation Learning and Temporal-Spectral Feature Fusion for Bed Occupancy Detection Yingjian Song, Zaid Farooq Pitafi, Fei Dou, Jin Sun, Xiang Zhang, Bradley G Phillips, WenZhan Song Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (UbiComp/IMWUT) 2024 This paper presents SeismoDot, a bed occupancy detection system that combines self-supervised learning and spectral-temporal feature fusion to improve generalization across diverse environments with limited data. Unlike traditional threshold-based methods, SeismoDot achieves high accuracy and F1 scores across 13 settings and remains effective even when trained on only 20% of the data, demonstrating strong adaptability and efficiency. [Paper] Self-Supervised Representation Learning and Temporal-Spectral Feature Fusion for Bed Occupancy Detection Yingjian Song, Zaid Farooq Pitafi, Fei Dou, Jin Sun, Xiang Zhang, Bradley G Phillips, WenZhan Song Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (UbiComp/IMWUT) 2024 This paper presents SeismoDot, a bed occupancy detection system that combines self-supervised learning and spectral-temporal feature fusion to improve generalization across diverse environments with limited data. Unlike traditional threshold-based methods, SeismoDot achieves high accuracy and F1 scores across 13 settings and remains effective even when trained on only 20% of the data, demonstrating strong adaptability and efficiency. [Paper] Mobilizing Personalized Federated Learning in Infrastructure-Less and Heterogeneous Environments via Random Walk Stochastic ADMM Ziba Parsons, Fei Dou, Houyi Du, Zheng Song, Jin Lu Advances in Neural Information Processing Systems 36 (NeurIPS) 2023 This paper proposes RWSADMM, a novel federated learning algorithm designed for infrastructure-less environments with isolated, heterogeneous nodes connected via wireless links. By leveraging server mobility and enforcing hard constraints among adjacent clients, RWSADMM enables efficient, personalized learning with provable convergence, reduced communication costs, and improved accuracy and scalability over baseline methods. [Paper] [Supplemental] Mobilizing Personalized Federated Learning in Infrastructure-Less and Heterogeneous Environments via Random Walk Stochastic ADMM Ziba Parsons, Fei Dou, Houyi Du, Zheng Song, Jin Lu Advances in Neural Information Processing Systems 36 (NeurIPS) 2023 This paper proposes RWSADMM, a novel federated learning algorithm designed for infrastructure-less environments with isolated, heterogeneous nodes connected via wireless links. By leveraging server mobility a",
  "content_length": 12885,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:29"
}