{
  "name": "Felipe Gonzalez",
  "homepage": "https://research.qut.edu.au/qcr/people/felipe-gonzalez",
  "status": "success",
  "content": "Felipe Gonzalez - QUT Centre for Robotics Skip to content Prof Felipe Gonzalez Home Our People Prof Felipe Gonzalez Please enable JavaScript Please enable JavaScript Find Felipe Gonzalez onFelipe Gonzalez's full profile, contact information and publications are available on: Professor (UAV Navigation, Drones, Aerial Robotics, Game Theory, Ecology) PhD in Aeronautical Engineering (University of Sydney), Private Pilot Licence (PPL) (Other), Chartered Professional Engineer (Other)Dr Gonzalez is an Professor  at the School of Electrical Engineering and Robotics (EER) and a CI in QUT Centre for Robotics (QCR),   Engineering Faculty with a passion for innovation in the fields of aerial robotics and automation. Gonzalez interest is in creating aerial robots, drones or UAVs that possess a high level of cognition using efficient on-board computer algorithms using advanced optimization and game theory approaches that  assist us to understand and improve our physical and natural world. Prof Gonzalez lead the Airborne Sensing Lab at QUT.  He is the co-author of several books in UAV based remote sensing and UAV based design based on evolutionary optimization and game strategies and as of 2018 has published nearly 130 refereed papers. To date he has been awarded $47.1M in chief investigator / partner investigator grants ($30.5M total cash + in-kind contributions). This grant income represents a mixture of sole investigator funding, ARC DP, ARC LIEF, ARC Linkages,CRCs  international, multidisciplinary collaborative grants and funding from industry. He is also a Chartered Professional Engineer, Engineers Australia – National Professional Engineers Register (NPER), a Member Royal Aeronautical Society (RAeS), The IEEE, American Institute of Aeronautics and Astronautics (AIAA) and Holder of a current Australian Private Pilot Licence (CASA PPL) and a Remote Pilot Licence (RePL from CASA) Projects (Chief investigator)Event-based localisation for ultra-fast systemsMulti-UAV Navigation in GPS Denied EnvironmentsSearch and Retrieve with a Fully Autonomous Aerial ManipulatorSemantic based onboard UAV navigationUAV Navigation in GPS Denied EnvironmentsUAV Remote Sensing and AI for Environmental Monitoring in Antarctica and in Polar Regions ProjectsAerial Manipulation for Remote Sensing ApplicationsAerial Mapping of Forests Affected by Pathogens using UAVs, Hyperspectral Sensors and Artificial Intelligence: Myrtle RustAerospace AutonomyAntarctic Science for a Sustainable FutureAssessing the capabilities of digital imaging and Unmanned Aerial Systems (UAS) for species managementAutonomous Mission Planning, Navigation and Geological Feature Recognition using UAVs (Drones)Autonomous UAV decision making under environment and target detection uncertaintyDetection and mapping of exotic weeds using UAS and machine learning: Bitou Bush Case StudyDeveloping pest risk models of Buffel Grass using Unmanned Aerial Systems and Statistical methodsDevelopment and validation of a UAV based system for air pollution measurementsMonitor of pollutants adjacent to a motorway using Unmanned Aerial VehiclesMultiple Target Finding and Action Using Unmanned Aerial SystemsNavigating Under the Forest Canopy and in the Urban JungleUAV Navigation using semantic cuesUAVs with slung/swung loadsUAVs, Hyperspectral Remote Sensing and Machine learning Revolutionizing Reef MonitoringUAVs/ Drones for Agriculture and Plant BiosecurityUnmanned Aerial Vehicles (UAVs) and artificial intelligence revolutionizing wildlife monitoring and conservationUse of UAS and Hyperspectral Remote Sensing for Early detection of Phylloxera Infestation in VineyardsWhen every second counts: Multi-drone navigation in GPS-denied environments Additional information Experience Experience Research  I’m an Professor at the School of Electrical Engineering and Robotics (EER)  and a CI with the QUT Centre for Robotics (QCR) at Queensland University of Technology. My PhD is the field of Multi-disciplinary Design Optimization in Aerospace Systems from the University of Sydney. My research is a nexus of aeronautical engineering, artificial intelligence, and optimisation. The motivation for my work is highly on translating scientific outcomes to address the practical challenges in autonomy, sensor design, sensor integration, data analysis for Unmanned Aerials Systems in remote sensing tasks.  I lead the Airborne Sensing Lab at QUT. I’m part of a team that has attracted over $9M of funding for fundamental and applied research from external competitive sources and have published 1 academic textbook, 3 Book chapters,  22 Journal papers and over 50 internationally peer-reviewed articles.  I am part of a team that has received approximately $ 9 Million in research grants, including:Navigating Under the Forest Canopy and in the Urban Jungle ARC DP 367KEstablishing Advanced Networks for Air Quality Sensing and Analyses ARC LP $445KAssessing the capabilities of digital imaging and Unmanned Aerial Systems for species management: Koala Abundance $80KCRC PB 2164 - Developing Pest Risk models of Buffel Grass using Unmanned Aerial Systems and Statistical Methods $230KCRC PB 2135 Optimizing surveillance protocols using unmanned aerial systems, $870KCreating a more Resilient Queensland - Unmanned aircraft for emergency response and biosecurity (ResQu) $3,500,000 over 3 years, Smart Futures Co-Investment FundSmart Skies project, $3 067k over 3 years, National and International Research Alliance Program (NIRAP),Enhanced Flight Assist Scheme (eFAS) for Automated Aerial Survey of Powerline Networks, $1 104k, CRC for Spatial Information-2Solar Powered Nano-Sensors for Data Acquisition and Surveying in Remote Areas, $540K, National and International Research Alliances Program, (Smart Futures Fund) – NIRAPNovel Aero-structural Design Optimisation Methods AOARD-044078, $67K , the US Air Force Office of Scientific Research (AFOSR)UAV-Drone based Precision Agriculture and Biosecurity  PBCRC2135 – Optimising Surveillance Protocols Using Unmanned Aerial Systems (2015-2017). This project will investigate the sensitivities and capacity of emerging unmanned aerial systems (UASs) and imaging technologies for biosecurity surveillance in viticulture, horticultural and grain industries.Evaluation of UAVs for Weed detection including buffel grass at ARCAA ( 2014-2015)Evaluation of UAVs for Insect Damage in ShorgumEvaluation of UAVsRust in OatsPB CRC 5055  Evaluating UAV's for plant biosecurity (2013-2014) : An ARCAA /QUT/PBCRC to evaluate the use  of UAVs for plant bisoecutiry Dr Gonzalez’s contribution to this project is focused on the leadership aspects of the problem.PBCRC 3032 Flying spore trap project (2009-2010). This project was a scoping study to determine the potential of using an unmanned aerial vehicle, fitted with a spore trap, to detect and monitor spores of plant pathogens. The aim was to develop a sampling system that would have the ability to spatially monitor fungal spores, and protocols to interpret their spatial distribution. This tool will greatly enhance the ability to detect new incursions of fungal pathogens and to enable more accurate delimiting of distribution. The technology will allow for earlier detection of harmful plant pest or disease incursions in difficult areas and provide efficient and effective airborne surveillance. My contribution to this project is focused on the software, hardware design and leadership aspects of the problemUAV-Drone based  Wildlife and conservationKoala Rescu (2014-ongoing)   The aim of this project is to explore Bayesian statistical modelling, artificial intelligence, wireless technology and the use of UAVs to improve the accuracy of population estimates of wildlife.  Reef research UAV-Drone based  Gas Sensing ApplicationsI lead the The Green Falcon Solar Powered UAV for Fire Prevention and Planning (2011-ongoing). This significant technological outcome was awarded the gold medal from the International Federation of Inventors Association and second prize in the EDN Innovation awards for embedded systems design and the gold medal, the innovation iENA 2011 Gold Medal The design was selected to be exhibited at the Melbourne Museum form November 2009 to February 2010.I instigated the project and am the  lead researcher.Green Falcon II Enabling TechnoilogiesAdvanced Autonomy, and advanced Path Planning Tools for UASs :  EAs , RRT, MDP, POMDPI am a PI on the enhanced Flight assist System (eFAS) for automated Aerial Survey of Powerline Networks  The CRCSI Project 4.3.1 enhanced Flight Assist System (eFAS) project extends the 2D aircraft flight path planning, data capture and flight assist concepts developed under CRCSI Project 6.07 and Project 9.07 to an active 3D capability. This enables automated and optimised flight management and planning for large-scale infrastructure aerial surveys. This work also makes a step towards fully autonomous aerial survey with UAVs where a complete 3D planning and automated flight capability is required.I was a PI on the The Smart Skies project (2007-2010). This research program was dedicated to future national airspace technologies with partners in the Queensland State Government, Boeing Research and Technology, and the CSIRO (see http://www.smartskies.com.au/).Dr Gonzalez was a core member of the project. For this work, ARCAA/QUT was awarded a 2010 Engineers Australia (Queensland Division) Excellence Award in the category of Control Systems, Networks, Information Processing and Telecommunications, and a 2010 Business/Higher Education Round Table Award in the category of Best Research & Development Collaboration. I was  the research leader for the characterisation of the hardware based solution for the common information network in regards to manned and unmanned aerial systems. Hierarchical asynchronous parallel evolutionary algorithms for high altitude long endurance UAV design optimisation This project focussed on developing the theory and practical app",
  "content_length": 15431,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:39"
}