{
  "name": "Felix C. Gärtner",
  "homepage": "https://www.cs1.tf.fau.de/person/felix-freiling",
  "status": "success",
  "content": "Felix Freiling - IT Security Infrastructures Lab Simulate organization breadcrumb open Simulate organization breadcrumb close Friedrich-Alexander-Universität IT Security Infrastructures Lab Felix Freiling Felix Freiling Prof. Dr.-Ing. Felix FreilingChairholderDepartment of Computer ScienceChair of Computer Science 1 (IT Security Infrastructures)Room: Room 12.159Martensstr. 391058 ErlangenPhone number: +4991318569901Fax number: +4991318569919Email: felix.freiling@fau.deWebsite: http://www1.informatik.uni-erlangen.de/staff/freilingOffice hoursEach week Mo, 17:00 - 18:00, Room 12.159, während der Vorlesungszeit - Termin vorher mit dem Sekretariat Tel. +49 9131 85-69900 vereinbaren I am a professor of computer science at Friedrich-Alexander-Universität Erlangen-Nürnberg. In my prior life my research focus for a long time was on fault-tolerant distributed algorithms. Today I focus on computer security and forensic computing. Since I work in the area of applied computer security I am constantly trying to cover my traces: From 2002 to 2010 I worked at five different universities under two different names. I don’t have any account in social media, so any account with my name is probably somebody else’s. For my publications, see the page on Publications of the lab, my entry at DBLP, or other sources. For a selection of funded projects of the lab, see the page on Funded Projects of the lab. I support The Cost of Knowledge and currently refrain from reviewing and editorial services to Elsevier. My ORCID is 0000-0002-8279-8401. Announcements My Sprechstunde during the lecture time in the winter semester 2025/2026 is Mondays 17:00 and 18:00. Please indicate in advance to Christine Stief if you plan to come. Official Short Biography Felix Freiling is full professor of Computer Science at Friedrich-Alexander-Universität Erlangen-Nürnberg (FAU) in Germany. His main research focus is on forensic computing, meaning the application of methods from computer science to answer questions of the legal system. He has published numerous papers on the methodological foundations of the field, including acquisition processes of digital evidence, tool support for analysis of digital evidence, and technical aspects of legal admissability. He is one of the founders of the first German professional Bachelors and Masters degree programmes focussing on digital forensics and has trained several generations of expert witnesses therein. He is also the spokesperson of the Research Training Group “Cybercrime and Forensic Computing” funded by Deutsche Forschungsgemeinschaft. Felix Freiling’s Email Policy On December 18, 2008 the number of unanswered messages in my email inbox surpassed 1000. I surrender! On christmas day 2008 I decided to change my email handling policy: In the future, I will treat emails more like I treat telephone calls. I will fix a time interval d and after d time I will completely remove all unanswered email from my inbox that is older than d. This means I will most probably not respond anymore to emails that have not been answered in d time. Currently d is one year, but it may be adjusted. I apologize for any inconvenience this may cause, but I am now convinced that I cannot continue to treat email the same as I treat postal mail. If you need a definitive response from me within a certain time, it is probably more reliable to send a letter by postal mail. Update in April 2009: d is now 6 months. Update in July 2009: d is now 2 months. Update in December 2010: d is now 3 weeks. Update in January 2012: d is now 1 week Update in December 2013: d is now 4 days. Update in December 2014: d is now 2 days. Update in September 2017: d is now 3 days. Update in February 2023: d is now 2 days. Update: Andreas Butz of LMU has a similar email policy. Exams Students planning an oral examination have the chance to visit such an exam as an observer (Hospitation) beforehand under the condition that they do not disturb the exam and the examined student agrees. Internship and Employment Opportunities My lab infrequently offers internships and short or long term employment to interested and well-qualified candidates. I however only reply to normal postal mail or (sometimes) to email which has been sent individually to me. In case you wish to communicate via email and are looking for an internship, please include the code word “ref: nightingale” in the subject of your mail to prove that you prepared an individual email. Memberships Gesellschaft für Informatik e.V. (GI) Forum InformatikerInnen für Frieden und gesellschaftliche Verantwortung e.V Association for Computing Machinery (ACM) Deutschsprachige Anwendervereinigung TeX e.V. (DANTE) Professional activities Symposium on Reliable Distributed Systems (SRDS 2002), Osaka, Japan, PC Member International Conference on Parallel and Distributed Systems (ICPADS 2002), Taiwan, PC Member Workshop on Resource Sharing in Massively Distributed Systems (RESH 2002), PC Member DISC 2004: The 18th Annual Conference on Distributed Computing, PC member Euro-Par 2005, Vice Chair of Topic 8: Distributed Systems and Algorithms 2nd Workshop on Sensor Networks at INFORMATIK 2005, PC member Sicherheit in komplexen, vernetzten Umgebungen, PC member Seventh International Symposium on Self Stabilizing Systems (SSS 2005), PC member First International Workshop on Distributed Algorithms and Applications for Wireless and Mobile Systems (DAAWMS 2005), PC member Workshop on Dependability and Fault Tolerance at ARCS 2006, PC member First International Conference on Availability, Reliability and Security (ARES 2006), PC member Sicherheit – Schutz und Zuverlässigkeit (Sicherheit 2006), member of organizing committee and PC member 8th International Symposium on Stabilization, Safety, and Security of Distributed Systems (SSS 2006), Dallas, PC Member 25th IEEE International Symposium on Reliable Distributed Systems (SRDS 2006), PC Member Sixth European Dependable Computing Conference (EDCC-6), Student Forum PC member 1st International Workshop on Advances in Sensor Networks, PC member Workshop Verlässlichkeit und Fehlertoleranz im Rahmen der ARCS 2007, Zürich, Schweiz, March 12, 2007, PC Member Testing of Software – From Research to Practice Workshop at Software Engineering 2007, PC Member Workshop on Foundations of Fault-Tolerant Distributed Computing (FOFDC 2007), PC member Fourth GI International Conference on Detection of Intrusions and Malware, and Vulnerability Assessment (DIMVA 2007), PC member The First International Workshop on Spoofing, Digital Forensics and Open Source Tools (SDFOST 2007), PC member International Conference on Distributed Computing Systems (ICDCS 2007), Dependability and Fault-Tolerance Area, PC member International Conference on Distributed Event-Based Systems (DEBS 2007), PC member 9th International Symposium on Stabilization, Safety, and Security of Distributed Systems (SSS 2007), PC member First International Workshop on Reliability, Availability, and Security (WRAS 2007), PC member Sicherheit – Schutz und Zuverlässigkeit (Sicherheit 2008), member of organizing committee and PC member 2nd Workshop on Recent Advances on Intrusion-Tolerant Systems (WRAITS 2008), PC member 10th International Symposium on Stabilization, Safety, and Security of Distributed Systems, PC member 12th Internationnal Conference On Principles Of DIstributed Systems (OPODIS 2008), PC member. iNetSec 2009. Open Research Problems in Network Security Workshop, PC member. 5th International ICST Conference on Security and Privacy in Communication Networks (SecureComm 2009), PC member. Digitale Multimedia-Forensik: Techniken und Anwendungsgebiete, Workshop at INFORMATIK 2009, PC member. IMF 2009 – 5th International Conference on IT Security Incident Management & IT Forensics, PC member. The 11th International Symposium on Stabilization, Safety, and Security of Distributed Systems (SSS 2009), Fault-tolerance in distributed systems track and stabilization track, PC member. Sixth European Conference on Computer Network Defense (EC2ND 2010), Berlin, PC member. Sicherheit, Schutz und Zuverlässigkeit (SICHERHEIT 2010), Berlin, PC Chair. The First International Workshop on Dynamic Aspects in Dependability Models for Fault-Tolerant Systems (DYADEM-FTS 2010), Valencia, Spain, PC member. 3rd ACM International Workshop on Reliability, Availability, and Security (WRAS 2010), Zurich, Switzerland, PC member 7th Workshop on Dependability and Fault Tolerance at ARCS 2011, Como, Italy, 2011, PC member International Workshop on Security Issues for Future Internet Social Networks and Devices: connecting Digital World with Social & Real Life (FISN 2011), Crete, Greece, PC member 2nd International Workshop on Logical Aspects of Fault-Tolerance (LAFT 2011), Toronto, Canada, PC member 6th International Conference on IT Incident Management and IT Forensics (IMF 2011), Stuttgart, Germany, PC member 8th Conference on Detection of Intrusions and Malware & Vulnerability Assessment (DIMVA 2011), Amsterdam, The Netherlands, PC member 3rd International ICST Conference on Digital Forensics and Cyber Crime (ICDF2C 2011), Dublin, Ireland, PC member 13th International Symposium on Stabilization, Safety, and Security of Distributed Systems (SSS 2011), Genoble, France, Security Track, PC member The Seventh European Conference on Computer Network Defense (EC2ND) 2011, Gothenburg, Sweden, PC member Sicherheit – Schutz und Zuverlässigkeit (SICHERHEIT 2012), Darmstadt, Germany, PC member and member of organizing committee The Eigth European Conference on Computer Network Defense (EC2ND) 2012, Bristol, UK, PC member The 26th International Symposium on Distributed Computing (DISC 2012), Salvador, Brazil, PC member The 4th International ICST Conference on Security and Privacy in Mobile Information and Communication Szstems (MobiSec 2012), Frankfurt, Germany, PC member The 14th International Symposium on Stabilization, Safety and Security of Distributed Systems (SSS 2012), Toronto,",
  "content_length": 65047,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:38"
}