{
  "name": "Felix Heide",
  "homepage": "https://www.cs.princeton.edu/~fheide",
  "status": "success",
  "content": "Felix Heide Felix Heide Professor Princeton University Princeton Computational Imaging Lab fheide@cs.princeton.edu Latest News: Nov 2025 Spin-out Cephia AI from my lab raises $4M in seed funding ! Oct 2025 I won the Princeton Dean for Research Distinguished Innovation Award ! Aug 2025 New paper on inverse neural rendering for computer vision in Nature Machine Intelligence, and four papers in this year's SIGGRAPH 2025 and SIGGRAPH Asia 2025 ! June 2025 New papers on optical computing in Science Advances and Nature Communication ! March 2025 Research on AI at the speed of light covered in \"A new way of seeing, a new way of computing\" and \"Identifing objects at the speed of light\"! July 2024 We will present two papers at this year's SIGGRAPH 2024 and another two papers at SIGGRAPH Asia 2024 ! April 2024 My group will present 9 fun papers at CVPR 2024. Aug 2023 I won the Significant New Researcher Award at SIGGRAPH 2023! May 2023 Thrilled to announce that Algolux has been acquired! Together with Torc's robotic stack and the deep OEM integration with Daimler Truck AG we will bring Algolux's perception in autonomous trucks on the road at scale ! Feb 2023 I was named a 2023 Sloan Research Fellow. Jan 2023 I got named a Packard Fellow from the Packard Foundation Fellowships for Science and Engineering. Biography I'm a professor of Computer Science at Princeton, where I lead the Princeton Computational Imaging Lab, and I am the Head of AI at Torc Robotics which builds full autonomy stacks for self-driving trucks. I previously founded the startup Algolux which was acquired by Torc and Daimler Trucks. My group at Princeton explores imaging and computer vision approaches that allow computers to see and understand what seems invisible today — enabling super-human capabilities for the cameras in our vehicles, personal devices, microscopes, telescopes, and the instrumentation we use for fundamental research in physics. This includes today's capture and vision challenges, including harsh environmental conditions, e.g., imaging under ultra-low or high illumination or computer vision through dense fog, rain, and snow, imaging at ultra-fast or slow time scales, freezing light in motion, imaging at extreme scene scales, from super-resolution microscopy to kilometer-scale depth sensing, and imaging via proxies using nearby object surfaces as sensors instead. Researching vision systems end-to-end, my work lies at the intersection of optics, machine learning, optimization, computer graphics, and computer vision. I received my Ph.D. from the University of British Columbia, and I was a postdoc at Stanford University. My doctoral dissertation won the Alain Fournier Ph.D. Dissertation Award and the SIGGRAPH outstanding doctoral dissertation award. I was recently named SIGGRAPH Significant New Researcher, Sloan Research Fellow and Packard Fellow. Publications List of recent publications: Neural Atlas Graphs for Dynamic Scene Decomposition and Editing Jan Philipp Schneider, Pratik Singh Bisht, Ilya Chugunov, Andreas Kolb, Michael Moeller, Felix Heide NeurIPS 2025 (Spotlight) HEIR: Learning Graph-Based Motion Hierarchies Cheng Zheng, William Koch, Baiang Li, Felix Heide NeurIPS 2025 LSD-3D: Large-Scale 3D Driving Scene Generation with Geometry Grounding Julian Ost, Andrea Ramazzina, Amogh Joshi, Maximilian Bömer, Mario Bijelic, Felix Heide AAAI 2026 Artifact-Resilient Real-Time Holography Victor Chu, Oscar Pueyo-Ciutad, Ethan Tseng, Florian Schiffers, Grace Kuo, Nathan Matsuda, Albert Redo-Sanchez, Oliver Cossairt, Douglas Lanman, Felix Heide Siggraph Asia 2025 Large-Area Fabrication-Aware Computational Diffractive Optics Kaixuan Wei, Hector A. Jimenez-Romero, Hadi Amata, Jipeng Sun, Qiang Fu, Felix Heide, Wolfgang Heidrich Siggraph Asia 2025 Towards Generalizable and Interpretable Three-dimensional Tracking with Inverse Neural Rendering Julian Ost, Tanushree Banerjee, Mario Bijelic, Felix Heide Nature Machine Intelligence Lidar Waveforms are Worth 40x128x33 Words Dominik Scheuble, Hanno Holzhüter, Steven Peters, Mario Bijelic, Felix Heide ICCV 2025 (Highlight) Self-Supervised Sparse Sensor Fusion for Long Range Perception Edoardo Palladin, Samuel Brucker, Filippo Ghilotti, Praveen Narayanan, Mario Bijelic, Felix Heide ICCV 2025 Collaborative On-Sensor Array Cameras Jipeng Sun, Kaixuan Wei, Thomas Eboli, Congli Wang, Cheng Zheng, Zhihao Zhou, Arka Majumdar, Wolfgang Heidrich, Felix Heide SIGGRAPH 2025 Scenario Dreamer: Vectorized Latent Diffusion for Generating Driving Simulation Environments Luke Rowe, Roger Girgis, Anthony Gosselin, Liam Paull, Christopher Pal, Felix Heide CVPR 2025 Dual Exposure Stereo for Extended Dynamic Range 3D Imaging Juhyung Choi, Jinnyeong Kim, Jinwoo Lee, Samuel Brucker, Mario Bijelic, Felix Heide, Seung-Hwan Baek CVPR 2025 Spatially Varying Nanophotonic Neural Networks Kaixuan Wei, Xiao Li, Johannes Froech, Praneeth Chakravarthula, James Whitehead, Ethan Tseng, Arka Majumdar, Felix Heide Science Advances Beating Spectral Bandwidth Limits for Large Aperture Broadband Nano-optics Johannes Froech, Praneeth Chakravarthula, Jipeng Sun, Ethan Tseng, Shane Colburn, Alan Zhan, Forrest Miller, Anna Wirth-Singh, Quentin Tanguy, Zheyi Han, Karl Boehringer, Felix Heide, Arka Majumdar Nature Communications Computational Imaging with Meta-Optics Johannes Froech, Shane Colburn, David J. Brady, Felix Heide, Ashok Veeraraghavan, Arka Majumdar Optica 2025 Introducing the ML FMEA Paul Schmitt, Heinz Bodo Seifert, Mario Bijelic, Krzysztof Pennar, Jerry Lopez, Felix Heide SAE 2025 Spatio-Temporal Transformer with View-interweaved Attention for Photon-Efficient Depth Sensing Letian Yu, Jiaxi Yang, Bo Dong, Qirui Bao, Yuanbo Wang, Felix Heide, Xiaopeng Wei, Xin Yang AAAI 2025 CtRL-Sim: Reactive and Controllable Driving Agents with Offline Reinforcement Learning Luke Rowe, Roger Girgis, Anthony Gosselin, Bruno Carrez, Florian Golemo, Felix Heide, Liam Paull, Christopher Pal CoRL 2024 Neural Light Spheres for Implicit Image Stitching and View Synthesis Ilya Chugunov, Amogh Joshi, Kiran Murthy, Francois Bleibel, Felix Heide SIGGRAPH Asia 2024 Learned Multi-aperture Color-coded Optics for Snapshot Hyperspectral Imaging Zheng Shi, Xiong Dun, Haoyu Wei, Shiyu Dong, Zhanshan Wang, Xinbin Cheng, Felix Heide, Yifan Peng SIGGRAPH Asia 2024 SAMFusion: Sensor-Adaptive Multimodal Fusion for 3D Object Detection in Adverse Weather Edoardo Palladin, Roland Dietze, Praveen Narayanan, Mario Bijelic, Felix Heide ECCV 2024 Radar Fields: Frequency-Space Neural Scene Representations for FMCW Radar David Borts, Erich Liang, Tim Brödermann, Andrea Ramazzina, Stefanie Walz, Edoardo Palladin, Jipeng Sun, David Bruggemann, Christos Sakaridis, Luc Van Gool, Mario Bijelic, Felix Heide SIGGRAPH 2024 Split-Aperture 2-in-1 Computational Cameras Zheng Shi, Ilya Chugunov, Mario Bijelic, Geoffroi Côté, Jiwoon Yeom, Qiang Fu, Hadi Amata, Wolfgang Heidrich, Felix Heide SIGGRAPH 2024 Neural Single-Shot GHz FMCW Correlation Imaging Cindy Pan, Noah Walsh, Yuxuan Zhang, Zheng Shi, Felix Heide Optics Express 2024 Neural Spline Fields for Burst Image Fusion and Layer Separation Ilya Chugunov, David Shustin, Ruyu Yan, Chenyang Lei, Felix Heide CVPR 2024 Gated Fields: Learning Scene Reconstruction from Gated Videos Andrea Ramazzina, Stefanie Walz, Pragyan Dahal, Mario Bijelic, Felix Heide CVPR 2024 Flow-Guided Online Stereo Rectification for Wide Baseline Stereo Anush Kumar, Fahim Mannan, Omid Hosseini Jafari, Shile Li, Felix Heide CVPR 2024 Cross-Spectral Depth Estimation from RGB and NIR-Gated Stereo Images Samuel Brucker, Stefanie Walz, Mario Bijelic, Felix Heide CVPR 2024 (Highlight) Polarization Wavefront Lidar: Learning Large Scene Reconstruction from Polarized Wavefronts Dominik Scheuble, Chenyang Lei, Seung-Hwan Baek, Mario Bijelic, Felix Heide CVPR 2024 Neural Exposure Fusion for High-Dynamic Range Object Detection Emmanuel Onzon, Maximilian Bömer, Fahim Mannan, Felix Heide CVPR 2024 Dispersed Structured Light for Hyperspectral 3D Imaging Suhyun Shin, Seokjun Choi, Felix Heide, Seung-Hwan Baek CVPR 2024 Spectral and Polarization Vision: Spectro-Polarimetric Real-World Dataset Yujin Jeon, Eunsue Choi, Youngchan Kim, Khalid Omer, Felix Heide, Seung-Hwan Baek CVPR 2024 (Highlight) Robust Depth Enhancement via Polarization Prompt Fusion Tuning Kei Ikemura, Yiming Huang, Felix Heide, Zhaoxiang Zhang, Qifeng Chen, Chenyang Lei CVPR 2024 Neural Étendue Expander for Ultra-Wide-Angle High-Fidelity Holographic Display Ethan Tseng, Grace Kuo, Seung-Hwan Baek, Nathan Matsuda, Andrew Maimone, Florian Schiffers, Praneeth Chakravarthula, Qiang Fu, Wolfgang Heidrich, Douglas Lanman, Felix Heide Nature Communications Roadmap for Optical Metasurfaces Arseniy I. Kuznetsov, Mark L. Brongersma, Felix Heide, et al. ACS Photonics 2024 (Cover Article and Editors Choice) Thin On-Sensor Nanophotonic Array Cameras Praneeth Chakravarthula, Jipeng Sun, Xiao Li, Chenyang Lei, Gene Chou, Mario Bijelic, Johannes Froech, Arka Majumdar, Felix Heide SIGGRAPH Asia 2023 Kissing to Find a Match: Efficient Low-Rank Permutation Representation Hannah Dröge, Zorah Lähner, Yuval Bahat, Onofre Martorell, Felix Heide, Michael Möller NeurIPS 2023 ScatterNeRF: Seeing Through Fog with Physically-Based Inverse Neural Rendering Andrea Ramazzina, Mario Bijelic, Stefanie Walz, Alessandro Sanvito, Dominik Scheuble, Felix Heide ICCV 2023 Diffusion-SDF: Conditional Generative Modeling of Signed Distance Functions Gene Chou, Yuval Bahat, Felix Heide ICCV 2023 Single Depth-image 3D Reflection Symmetry and Shape Prediction Zhaoxuan Zhang, Bo Dong, Tong Li, Felix Heide, Pieter Peers, Baocai Yin, Xin Yang ICCV 2023 Multi-view Spectral Polarization Propagation for Video Glass Segmentation Yu Qiao, Bo Dong, Ao Jin, Yu Fu, Seung-Hwan Baek, Felix Heide, Pieter Peers, Xiaopeng Wei, Xin Yang ICCV 2023 Hexagonal Diffractive Optical Elements Yidan Zheng, Qiang Fu, Hadi Amata, Praneeth Chakravarthula, Felix Heide, Wolfgang Heidrich Opt",
  "content_length": 25211,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:39"
}