{
  "name": "Felipe Orihuela-Espina",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/orihuela-espina-felipe.aspx",
  "status": "success",
  "content": "Dr Felipe Orihuela-Espina - School of Computer Science - University of Birmingham Dr Felipe Orihuela-Espina PhD School of Computer ScienceAssociate Professor in Computer Science Contact details Emailf.orihuela-espina@bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr. Felipe Orihuela-Espina is a Associate Professor in the School of Computer Science. He obtained his PhD in Computer Science from the University of Birmingham (UK) in 2005. Afterwards, he moved to Mexico where he was appointed lecturer at the Universidad Autonoma del Estado de Mexico (UAEMex). He joined Imperial College as a research associate in 2007 and later in 2011 became postdoctoral associated at the Instituto Nacional de Astrofísica Óptica y Electrónica (INAOE). He remained linked to Imperial College as honorary lecturer until 2015. In 2012 he joined INAOE as faculty where he is currently Reader and leads the group on functional optical neuroimaging within the Biosignals Processing Lab. He is currently a member of the National Researchers Systems (SNI 2). He has attracted funding as PI for over 8m MXN, and authored over 90 full-length original research articles including over 40 JCR indexed journal papers. He has carried out research secondments at ETH Zurich  (Switzerland), University College London (UK) and Bosphorus University (Turkey), and a sabbatical at MGH/HST Athinoula A. Martinos Center for Biomedical Imaging (USA). His current research interests include different aspects of optical neuroimaging analysis and interpretation and virtual neurorehabilitation. PhD in Computer Science. University of Birmingham. United Kingdom. Oct 2001 - Aug 2005 MSc in Computer Engineering. University of Seville. Spain. Oct 1997 - Jun 2001 BSc in Computer Engineering with a major in Hardware. University of Huelva. Spain. Oct 1993 - Jun 1997 Dr. Felipe Orihuela-Espina is an Associate Professor in the School of Computer Science. He obtained his PhD in Computer Science from the University of Birmingham (UK) in 2005. Afterwards, he moved to Mexico where he was appointed lecturer at the Universidad Autonoma del Estado de Mexico (UAEMex). He joined Imperial College as a research associate in 2007 and later in 2011 became postdoctoral associated at the Instituto Nacional de Astrofísica Óptica y Electrónica (INAOE). He remained linked to Imperial College as honorary lecturer. In 2012 he joined INAOE as faculty where he lead the group on functional optical neuroimaging within the Biosignals Processing Lab. In September 2021, he came back to the University of Birmingham to join the School of Computer Science as Senior Lecturer. fNIRS neuroimaging analysis and interpretation. My current research interests are data analysis and neuroimaging interpretation; mainly optical neuroimaging (fNIRS). This implies multidisciplinary research from computing (mainly), mathematics and statistics, and a bit of physics (optics) and neuroscience. I am the principal investigator (PI) of the Computational NeuroImaging Lab. Recent publications Article Ward, RJ & Orihuela-Espina, F 2025, 'Crust & Crumb Sampling: Efficient sampling design for high dimensional parameter recovery', Measurement Science and Technology, vol. 36, no. 6, 065410. https://doi.org/10.1088/1361-6501/adde7a BIDS Maintainers, Luke, R, Oostenveld, R, Cockx, H, Niso, G, Shader, MJ, Orihuela-Espina, F, Innes-Brown, H, Tucker, S, Boas, D, Yücel, MA, Gau, R, Salo, T, Appelhoff, S, Markiewicz, CJ, McAlpine, D & Pollonini, L 2025, 'NIRS-BIDS: Brain Imaging Data Structure Extended to Near-Infrared Spectroscopy', Scientific Data, vol. 12, no. 1, 159. https://doi.org/10.1038/s41597-024-04136-9 Stute, K, Gossé, L, Montero Hernandez, S, Perkins, G, Yücel, MA, Orihuela-Espina, F, Mesquita, R, Dehghani, H & Elsherif, M 2025, 'The fNIRS glossary project: a consensus-based resource for functional near-infrared spectroscopy terminology', Neurophotonics, vol. 12, no. 2, 027801. https://doi.org/10.1117/1.NPh.12.2.027801 Dale, R, Zheng, B, Orihuela-Espina, F, Ross, N, O'Sullivan, TD, Howard, S & Dehghani, H 2024, 'Deep learning-enabled high-speed, multi-parameter diffuse optical tomography', Journal of Biomedical Optics, vol. 29, no. 7, 076004. https://doi.org/10.1117/1.JBO.29.7.076004 del Rocío Hernández-Castañón, V, Castillo-Ávila, AA, Reyes-Meza, V, Bianchi-Berthouze, N, Morán, AL & Orihuela-Espina, F 2023, 'Effect of the level of task abstraction on the transfer of knowledge from virtual environments in cognitive and motor tasks', Frontiers in Behavioral Neuroscience, vol. 17, 1162744. https://doi.org/10.3389/fnbeh.2023.1162744 Zaqueros-Martinez, J, Rodriguez-Gomez, G, Tlelo-Cuautle, E & Orihuela-Espina, F 2023, 'Fuzzy Synchronization of Chaotic Systems with Hidden Attractors', Entropy, vol. 25, no. 3, 495. https://doi.org/10.3390/e25030495 Hernández-Román, J, Montero-Hernández, S, Vega, R, Orihuela-Espina, F & Soto, E 2023, 'Galvanic Vestibular Stimulation Activates the Parietal and Temporal Cortex in Humans: A functional near-infrared spectroscopy (fNIRS) Study.', European Journal of Neuroscience, vol. 58, no. 1, pp. 2267-2277. https://doi.org/10.1111/ejn.16041 Dale, R, O'Sullivan, TD, Howard, S, Orihuela-Espina, F & Dehghani, H 2023, 'System derived spatial-temporal CNN for high-density fNIRS BCI', IEEE Open Journal of Engineering in Medicine and Biology, vol. 4, 10073629, pp. 85-95. https://doi.org/10.1109/OJEMB.2023.3248492 Conference contribution Ward, R & Orihuela-Espina, F 2025, Finding the perfect NIRS pipeline. in Proceedings, European Conferences on Biomedical Optics: 22–26 June 2025, Munich, Germany., W1B.1, European Conferences on Biomedical Optics, Optica Publishing Group (formerly OSA), European Conferences on Biomedical Optics, Munich, Germany, 22/06/25. https://doi.org/10.1364/ECBO.2025.W1B.1 Ward, R & Orihuela-Espina, F 2025, Finding the perfect NIRS pipeline. in European Conferences on Biomedical Optics, 22–26 June 2025, Munich, Germany., W1B.1, Proceedings of SPIE, SPIE. Re, R, Contini, L, Contini, D, Orihuela-Espina, F, Torricelli, A & Spinelli, L 2023, Cerebral resting state oscillations study with TD fNIRS. in D Contini, Y Hoshi & TD O'Sullivan (eds), Diffuse Optical Spectroscopy and Imaging IX., 126280I, Proceedings of SPIE - The International Society for Optical Engineering, vol. 12628, SPIE, Diffuse Optical Spectroscopy and Imaging IX 2023, Munich, Germany, 25/06/23. https://doi.org/10.1117/12.2668895 Dale, R, O’Sullivan, TD, Howard, S, Campbell, C, Orihuela-Espina, F & Dehghani, H 2023, High-speed spatial parameter recovery using multi-distance frequency-domain diffuse optical spectroscopy. in S Fantini & P Taroni (eds), Optical Tomography and Spectroscopy of Tissue XV., 1237606, Proceedings of SPIE. Progress in biomedical optics and imaging, vol. 12376, SPIE, Optical Tomography and Spectroscopy of Tissue XV 2023, San Francisco, United States, 30/01/23. https://doi.org/10.1117/12.2651676 Letter Guevara, E, Mesquita, RC & Orihuela-Espina, F 2026, 'Emerging panorama of functional near-infrared spectroscopy in Latin America', Neurophotonics, vol. 13, no. S1, S13002. https://doi.org/10.1117/1.NPh.13.S1.S13002 Review article Almukhtar, A, Caddick, V, Naik, R, Goble, M, Mylonas, G, Darzi, A, Orihuela-Espina, F & Leff, DR 2025, 'Objective Assessment of Cognitive Workload in Surgery: A Systematic Review', Annals of surgery, vol. 281, no. 6, pp. 942-951. https://doi.org/10.1097/SLA.0000000000006370 Short survey Goble, M, Caddick, V, Patel, R, Modi, H, Darzi, A, Orihuela-Espina, F & Leff, DR 2023, 'Optical neuroimaging and neurostimulation in surgical training and assessment: A state-of-the-art review', Frontiers in Neuroergonomics, vol. 4, 1142182. https://doi.org/10.3389/fnrgo.2023.1142182 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 7972,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:37"
}