{
  "name": "Felipe W. Trevizan",
  "homepage": "https://comp.anu.edu.au/people/felipe-trevizan",
  "status": "success",
  "content": "Felipe Trevizan | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Research My research interests lie at the intersection of Artificial Intelligence, Operations Research and Machine Learning including automated planning and scheduling, planning under uncertainty, heuristic search, and reinforcement learning. For more details, see https://felipe.trevizan.org. If you are a prospective or current student looking for research projects, see https://felipe.trevizan.org/students.html for an up-to-date list potential topics. Biography Dr. Felipe Trevizan is currently an Assistant Professor in the School of Computing at the Australian National University (ANU). Previously, Felipe was a Senior Research Scientist at NICTA (now Data61/CSIRO). Felipe earned his Ph.D. in Machine Learning (2013) from Carnegie Mellon University (CMU) under the supervision of Prof. Manuela Veloso. In his thesis, Felipe introduced short-sighted planning, a novel approach to effectively plan under uncertainty. As part of his Ph.D. program, Felipe received a M.Sc. degree (2010) where he showed how to use machine learning techniques to classify the opponent’s strategy in the RoboCup small size league. Before joining CMU, Felipe received his first M.Sc. degree (2006) and his Bachelor of Computer Science degree (2004) from Instituto de Matemática e Estatística at Universidade de São Paulo under the supervision of Prof. Leliane Nunes de Barros. In this M.Sc. thesis, Felipe introduced a new model for planning under uncertainty in which actions can be either probabilistic, non-deterministic or anything in between. For his research project for undergraduates, Felipe programmed Lego Mindstorm robots using deterministic planners and automatic theorem provers. Felipe’s research interests lie at the intersection of Artificial Intelligence, Operations Research and Machine Learning including automated planning and scheduling, reasoning under uncertainty, heuristic search, and reinforcement learning. Along with colleagues and students, Felipe is the co-recipient of the 2016 Kikuchi-Karlaftis Best Paper Award of the Transport Research Board and the Best Paper Award in at the International Conference on Automated Planning and Scheduling (ICAPS) in 2016 and 2017. For more details, see Felipe’s CV, Google Scholar profile and DBLP entry. Activities & Awards For an up-to-date list of my publications, visit https://felipe.trevizan.org/publications.html bars search times",
  "content_length": 2595,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:36"
}