{
  "name": "Felipe Meneguzzi",
  "homepage": "http://www.meneguzzi.eu/felipe",
  "status": "success",
  "content": "Felipe Meneguzzi Felipe Meneguzzi Professor of Computer Science Menu Home Research Publications Presentations Software Projects Committees People Contact Resources Students Writing Quick Links Felipe at Aberdeen Felipe at Github Blue-Sky DBLP Scholar OrcId About I am a researcher on automated planning, goal and plan recognition, multiagent systems, BDI agents, and machine learning. I currently hold a Chair of Computing Science at the University of Aberdeen, and I am part of the Agents at Aberdeen research group. I also hold a Bridges Professorship at Pontifícia Universidade Católica do Rio Grande do Sul, where I lead the Group on Artificial Intelligence. I am a Senior Member of the ACM and of AAAI. I am the guest editor of the topic on Advances in Goal, Plan and Activity Recognition in the Frontiers in Artificial Intelligence journal. I was Executive Councillor of the AAAI (until 2025), and a board member of the Special Committee on Artificial Intelligence for the Brazilian Computer Society (until 2024). I am a member of the UKRI Talent Panel College, and of the EPSRC Peer Review College. In Brazil, I held CNPq's highly productive researcher fellowship. According to CSRankings, I am one of the most productive AI researchers from South America, as well as the top Core AI researcher in Brazil according to AI Ranking. In the course of my career I received the following professional recognitions: our paper Landmark-based approaches for goal recognition as planning won AI Journal prominent paper award for 2024 (at IJCAI 2024); our paper Empowering BDI Agents with Generalised Decision-Making won Best Blue Blue-Sky Paper at AAMAS 2024; received the best SPC member award from AAMAS 2021; the planner developed in my lab HyperTensioN won the International Planning Competition (IPC) in 2020; our article Identification of autism spectrum disorder using deep learning and the ABIDE dataset is among the most cited and downloaded at Neuroimage: Clinical; received the Distinguished Visiting Fellow award from the Scottish Informatics and Computer Science Alliance (SICSA), culminating in a master class on goal recognition; our paper on An Application to Support Visually-Impaired People through Deep Convolutional Neural Networks won the best student paper at IJCNN 2017; our paper on Norm Conflict Identification Using Deep Learning was recognised as visionary workshop paper at AAMAS 2017; received a Google Research Award for Latin America in 2016 as well as in 2019; the team I advised won the 2016 Multi-Agent Programming Contest; was part of the team that took second place on the 2016 Predictive Analytics in Mental Health Competition (PAC); finished as one of the four runners up to the Microsoft Research Faculty Fellowship in 2013; and my student Ramon Pereira was recognised as having the second best MSc dissertation and later the best PhD thesis in Artificial Intelligence in Brazil. Before my current position, I worked as a Project Scientist in Multiagent Systems at the Robotics Institute of Carnegie Mellon University after completing a Postdoctoral Fellowship at the same university with Professor Katia Sycara. I obtained my PhD degree at King's College London, with a thesis on Extending agent languages for multiagent domains under the supervision of Professor Michael Luck and co-supervised by Professor Andrew Jones. I started my studies at the University of Southampton in 2005, and moved to King's College London in September of 2006. Prior to my full-time academic career, I worked in the industry as a contractor for Hewlett-Packard Brazil, and worked on a variety of projects with some very interesting people. Previously I was a research assistant at FACIN/PUCRS, and an MSc student in Computer Science at PPGCC/PUCRS, where I also obtained my undergraduate degree. Information about my academic and professional career can be checked out in my complete CV, or in a more academic CV. I chaired the following events over the years: Area Chair for the 40th AAAI Conference on Artificial Intelligence (AAAI); I co-chaired the Demo Track for AAAI 2025; I am Area Chair for Coordination, Organizations, Institutions, Norms, amd Ethics for the 24th International Conference on Autonomous Agents and Multiagent Systems (AAMAS); I am co-Chair for the Doctoral Consortium of the 35th International Conference on Automated Planning and Scheduling (ICAPS); I am Area Chair for the 28th European Conference on Artificial Intelligence (ECAI); I was Area Chair for Coordination, Organizations, Institutions, and Norms for AAMAS 2022; I co-chaired the Demo Tracks for AAMAS 2021; I co-chaired the 2017 Workshop on Coordination, Organizations, Institutions and Norms held together with AAMAS 2017 in São Paulo, Brazil; I co-chaired the Porto Alegre local chapter edition of Brainhack since 2014; I was chair of the AAAI Symposium on Proactive Assistant Agents; I was area chair for Planning and Scheduling for the 2014 IBERAMIA; I co-chaired the 5th International Workshop on Collaborative Agents (CARE 2014). I currently serve in the program committee of the following conferences (and have served in the past): Area Chair (Senior Program Committee) for the 35th International Conference on Automated Planning and Scheduling (ICAPS); Senior Program Committee for the 34th International Joint Conference on Artificial Intelligence (IJCAI); I also regularly serve as a reviewer for the following journals: ACM Transactions on Intelligent Systems and Technology; Scalable Computing: Practice and Experience; Artificial Intelligence and Law; Künstliche Intelligenz (KI) (German Journal of Artificial Intelligence); Knowledge Engineering Review (KER) from Cambridge Press; Theoretical Computer Science (TCS) from Elsevier; Journal of Autonomous Agents and Multi-Agent Systems (JAAMAS) from Springer; Web Intelligence and Agent Systems (WIAS) from IOS Press; and Group Decision and Negotiation (GRUP) from Springer. Research Interests (and prospective students) I always welcome new students interested in doing research, please contact me for possible MSc and PhD positions. My research interests include Automated Planning, Machine Learning, Autonomous Agents, Multi-Agent Systems, and Artificial Intelligence in general. More recently, I have worked on various applications of AI to neuroscience in partnership with the Brain Institute of Rio Grande do Sul. Picture credit to PUCRS/Bruno Todeschini. This file last modified Sunday, 22-Jun-2025 18:21:05 CEST",
  "content_length": 6487,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:36"
}