{
  "name": "Fengyuan Xu",
  "homepage": "https://cs.nju.edu.cn/fxu",
  "status": "success",
  "content": "Fengyuan Xu @ NJU About Me I am a Professor with the School of Computer Science at Nanjing University. Prior to joining NJU, I worked at NEC Labs Princeton as a full-time Researcher. I was also a Visiting Researcher at Microsoft Research Asia. I earned my Ph.D. in Computer Science from the College of William and Mary, and received the Distinguished Dissertation Award in Natural and Computational Sciences. My research experitse lies at the intersection of Security, Autonomy and Mobility. I seek to explore computationally scientific discoveries with real-world impact and create disruptive innovations reshaping how people live. My long-term goal is to foster a symbiotic relationship between human and AI in a mutually beneficial way. I am currently working on Agentic AI for Security and Privacy, with a focus on AI-empowered security & privacy autonomy, collaborative agents for security professionals, and trustworthy AI computing with affordable cost. To prospective students 招收安全领域可持续AI智能体设计、带隐私保护的移动端AI用户助理、AI推理的可信执行环境、端到端自动驾驶模型可解释性、Web3.0及智能合约的安全自动化、去中心化AI的数据要素市场等研究方向的本硕博学生。欢迎志同道合的同学发信至我的邮箱 fengyuan DOT xu AT nju DOT edu DOT cn。除了基本信息和经验背景，请在邮件中表明你感兴趣的方向及原因，并从下列featured papers中挑选一篇总结其中内容和阐述你的见解(长短不限)。谢谢。 News One paper accepted to FSE 2025. Two papers accepted to S&P 2025 and TIFS. Served as PC for Usenix Security 2025. Four papers accepted to TDCS, TIFS, TMC and TKDD. Two papers accepted to ICRA'24, MM'24. Featured Papers DisCo: Towards Decompiling EVM Bytecode to Source Code using Large Language Models. Xing Su, Hanzhong Liang, Hao Wu, Ben Niu, Fengyuan Xu, and Sheng Zhong. ACM International Conference on The Foundations of Software Enggineering. (FSE 2025) Make a Feint to the East While Attacking in the West: Blinding LLM-Based Code Auditors with Flashboom Attacks Xiao Li, Yue Li, Hao Wu, Yue Zhang, Kaidi Xu, Xiuzhen Cheng, Sheng Zhong, and Fengyuan Xu. 46th IEEE Symposium on Security and Privacy. (S&P 2025) Dataset Preparation for Arbitrary Object Detection: An Automatic Approach based on Web Information in English Shucheng Li, Boyu Chang, Bo Yang, Hao Wu, Sheng Zhong, and Fengyuan Xu. The 46th International ACM SIGIR Conference on Research and Development in Information Retrieval. (SIGIR 2023) Manipulating Transfer Learning for Property Inference Yulong Tian, Fnu Suya, Anshuman Suri, Fengyuan Xu, and David Evans. The IEEE/CVF Conference on Computer Vision and Pattern Recognition 2023. (CVPR 2023) LEAP: TrustZone Based Developer-Friendly TEE for Intelligent Mobile Apps Lizhi Sun, Shuocheng Wang, Hao Wu, Yuhang Gong, Fengyuan Xu, Yunxin Liu, Hao Han, and Sheng Zhong. IEEE Transactions on Mobile Computing. (TMC) Privacy-Preserving and Robust Federated Deep Metric Learning Yulong Tian, Xiaopeng Ke, Zeyi Tao, Shaohua Ding, Fengyuan Xu, Qun Li, Hao Han, Sheng Zhong, and Xinyi Fu. 2022 IEEE/ACM International Symposium on Quality of Service. (IWQoS 2022) Towards Automated Safety Vetting of Smart Contracts in Decentralized Applications Yue Duan, Xin Zhao, Yu Pan, Shucheng Li, Minghao Li, Fengyuan Xu, and Mu Zhang. 2022 ACM Conference on Computer and Communications Security. (CCS 2022) Best Paper Honorable Mention DAPter: Preventing User Data Abuse in Deep Learning Inference Services Hao Wu, Xuejin Tian, Yuhang Gong, Xing Su, Minghao Li, and Fengyuan Xu. The 30th Web Conference. (WWW 2021) PECAM: Privacy-Enhanced Video Streaming & Analytics via Securely-Recoverable Transformation Hao Wu, Xuejin Tian, Minghao Li, Yunxin Liu, Ganesh Ananthanarayanan, Fengyuan Xu, and Sheng Zhong. The 27th Annual International Conference On Mobile Computing And Networking. (MobiCom 2021a) AsyMo: Scalable and Efficient Deep-Learning Inference on Asymmetric Mobile CPUs Manni Wang*, Shaohua Ding*, Ting Cao, Yunxin Liu, and Fengyuan Xu. The 27th Annual International Conference On Mobile Computing And Networking. (MobiCom 2021b) *co-first authors EMO: Real-Time Emotion Recognition from Single-Eye Images for Resource-Constrained Eyewear Devices Hao Wu, Jinghao Feng, Xuejin Tian, Edward Sun, Yunxin Liu, Bo Dong, Fengyuan Xu, and Sheng Zhong. 18th ACM International Conference on Mobile Systems, Applications, and Services. (MobiSys 2020) Occlumency: Privacy-preserving Remote Deep-learning Inference Using SGX Taegyeong Lee, Zhiqi Lin, Saumay Pushp, Caihua Li, Yunxin Liu, Youngki Lee, Fengyuan Xu, Chenren Xu, Junehwa Song, and Lintao Zhang. 25th ACM International Conference on Mobile Computing and Networking. (MobiCom 2019) V-edge: Fast Self-constructive Power Modeling of Smartphones Based on Battery Voltage Dynamics Fengyuan Xu, Yunxin Liu, Qun Li, and Yongguang Zhang. The 10th USENIX Symposium on Networked Systems Design and Implementation. (NSDI 2013). IMDGuard: Securing Implantable Medical Devices with the External Wearable Guardian Fengyuan Xu, Zhengrui Qin, Chiu C. Tan, Baosheng Wang, and Qun Li. The 30th IEEE International Conference on Computer Communications. (INFOCOM 2011) Selected Awards ACM CCS 2022 Best Paper Honorable Mention (CCS'22最佳论文提名奖). Distinguished TPC of IEEE INFOCOM 2022. 江苏省“双创计划”创新人才. 江苏省“六大人才高峰”入选者. 微软“铸星计划”学者. 中国中文信息学会优秀博士论文奖指导老师. 江苏省计算机学会优秀博士论文奖指导老师. ACM中国嵌入式系统专委会优博指导老师. Award for Excellence in Undergraduate Mentoring(最佳本科生研究指导), William & Mary. Teaching Cybersecurity and Privacy (English) Introduction to Distributed Systems Research 学生培养 中国中文信息学会优秀博士论文奖 江苏省计算机学会优秀博士论文奖 ACM中国嵌入式系统专委会优博奖 南大计算机系优秀博士论文 江苏省优秀学生干部 AIAED'19 Best Student Paper (本科生) KDD'19 DLG-Workshop Best Student Paper (本科生) 南大优秀毕业论文 (本科生) 南大校长奖学金 (研究生) 南大优秀毕业生 (研究生) 南大人工智能奖学金 (研究生) 南大优秀研究生 南大博士英才奖学金 南京大学优秀研究生标兵 “赢在南京”青年大学生创业大赛第一名 “创栖霞”创新创业大赛筑梦新星组三等奖 南大助理教授 中南讲师 南航讲师 字节跳动 腾讯优图 微软亚研院 蚂蚁金服 微软工程院 旷视科技 地平线AI 米哈游科技 腾讯微信 荣耀手机 华为南研所 华为智能驾驶 飞维美地信息技术 深圳能源财务 Gaorgia Tech Rice Univ. Indiana Univ. Bloomington UC Irvine Purdue Univ. Univ. of Virginia Ohio State Univ. Professional Services 中国中文信息学会大数据安全与隐私计算专委会常委 ACM中国SIGBED专委会常委 S&P'26 Usenix Security '25,'26 CCS '24 INFOCOM '16-'22 ACM MobiSys '23 ACM/IEEE SEC'22 Publicity Chair ICCCN'18 (Track Chair) AsiaCCS'21 SecureComm'17,'19,'20 BigData'18 全国体系结构学术年会'18 ACM Transactions on Sensor Networks ACM Transactions on Embedded Computing Systems IEEE Transactions on Mobile Computing IEEE Transactions on Information Forensics and Security IEEE Transactions on Wireless Communications IEEE Transactions on Vehicular Technology IEEE Transactions on Computational Social Systems Computer Networks IEICE Transactions on Information and Systems Mobile Networks and Applications Journal of Computer Science and Technology Security and Communication Networks Publication Stealthy Backdoors as Compression Artifacts. Yulong Tian, Fnu Suya, Fengyuan Xu, and David Evans. IEEE Transactions on Information Forensics and Security. (TIFS) Towards Practical and Efficient Long Video Summary. Xiaopeng Ke, Boyu Chang, Hao Wu, Fengyuan Xu, and Sheng Zhong. 2022 IEEE International Conference on Acoustics, Speech and Signal Processing. (ICASSP 2022) 自动驾驶系统中视觉感知模块的安全测试. 吴昊, 王浩, 苏醒, 李明昊, 许封元, 仲盛. 计算机研究与发展, 2022. vTrust: Remotely Executing Mobile Apps Transparently With Local Untrusted OS. Yutao Tang, Zhengrui Qin, Yue Li, Zhiqiang Lin, Shanhe Yi, Fengyuan Xu, and Qun Li. IEEE Transactions on Computers. (TC) RF-Badge: Vital Sign-based Authentication via RFID Tag Array on Badges. Jingyi Ning, Lei Xie, Chuyu Wang, Yanlin Bu, Fengyuan Xu, Da-Wei Zhou, Sanglu Lu, and Baoliu Ye. IEEE Transaction on Mobile Computing. (TMC) DIComP: Lightweight Data-Driven Inference of Binary Compuler Provenance with High Accuracy. Ligeng Chen, Zhongling He, Hao Wu, Fengyuan Xu, Yi Qian, and Bing Mao. 2022 International Conference on Software Analysis, Evolution, and Reengineering. (SANER 2022) Enabling Efficient Cyber Threat Hunting with Cyber Threat Intelligence. Peng Gao, Fei Shao, Xiaoyuan Liu, Xusheng Xiao, Zheng Qin, Fengyuan Xu, Prateek Mittal, Sanjeev R. Kulkarni, and Dawn Song. 37th IEEE International Conference on Data Engineering. (ICDE 2021) Efficient Architecture Paradigm for Deep Learning Inference as a Service. Jin Yu, Xiaopeng Ke, Fengyuan Xu, and Hao Huang. 39th IEEE International Performance Computing and Communications Conference. (IPCCC 2020) 深度学习模型压缩与加速综述. 高晗, 田育龙, 许封元, 仲盛. 软件学报, 2020. DBox：宏内核下各种设备驱动程序的高性能安全盒. 余劲, 黄皓, 诸渝, 许封元. 计算机学报, 2020. Detecting GAN-based Privacy Attack in Distributed Learning. Yayuan Xiong, Fengyuan Xu, and Sheng Zhong. 2020 IEEE International Conference on Communications. (ICC 2020) Escaping Backdoor Attack Detection of Deep Learning. Yayuan Xiong, Fengyuan Xu, Sheng Zhong, and Qin Li. 35th International Conference on ICT Systems Security and Privacy Protection. (IFIP SEC 2020) Trojan Attack on Deep Generative Models in Autonomous Driving. Shaohua Ding, Yulong Tian, Fengyuan Xu, Qun Li and Sheng Zhong. 15th EAI International Conference on Security and Privacy in Communication Networks. (SecureComm\t2019) secGAN: Secure Recoverable GAN-based Video Transformation. Hao Wu, Jinghao Feng, Xuejin Tian, Fengyuan Xu, Sheng Zhong, Yunxin Liu, and Xiaofeng Wang. MobiCom Workshop on Hot Topics in Video Analytics and Intelligent Edges. (HotEdgeVideo 2019) DeepIntent: Deep Icon-Behavior Learning for Detecting Intention-Behavior Discrepancy in Mobile Apps. Shengqu Xi, Shao Yang, Xusheng Xiao, Yuan Yao, Yayuan Xiong, Fengyuan Xu, Haoyu Wang, Peng Gao, Zhuotao Liu, Feng Xu, Jian Lu. 26th ACM Conference on Computer and Communications Security. (CCS 2019) An Empirical Study of Graph Neural Networks Based Semantic Parsing. Shucheng Li, Lingfei Wu, Fengyuan Xu, Fangli Xu and Sheng Zhong. 25th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (Poster). (KDD 2019, DGL Workshop) Best Student Paper Broken Relationship of Mobile User Intentions and Permission Control of Shared System Resources. Hao Wu, Zheng Qin, Xuejin Tian, Edward Sun, Fengyuan Xu, and Sheng Zhong. 2019 IEEE Conference on Dependable and Secure Computing. (DSC 2019, Invited Paper) Automated Finite State Machine Extraction. Yongheng Chen, Linhai Song, Xinyu Xing, Fengyuan Xu, Wenfei Wu. ",
  "content_length": 15476,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:49"
}