{
  "name": "Fengwei Zhang",
  "homepage": "http://cse.sustech.edu.cn/faculty/~zhangfw",
  "status": "success",
  "content": "Prof. Fengwei Zhang's Home Page Fengwei Zhang Associate Professor Director, COMPASS Lab Department of Computer Science and Engineering Southern University of Science and Technology Contact: Room 515, South Tower, College of Engineering 1088 Xueyuan Ave, Nanshan District Shenzhen, Guangdong Province, China 518055 Phone: (+86) (755) 88015160 Email: zhangfw [at] sustech dot edu dot cn Lab: Room 441A, South Tower, College of Eng. I am a tenured Associate Professor at Department of Computer Science and Engineering at Southern University of Science and Technology (SUSTech). My primary research interests are in the areas of systems security, with a focus on trusted execution environments (e.g., Arm TrustZone/CCA), GPU confidential computing, debugging transparency, system introspection, and hardware-assisted security. Before joining SUSTech, I spent four wonderful years (2015-2019) as an Assistant Professor (Tenure-track) at Department of Computer Science at Wayne State University (WSU). I earned my Ph.D. in Computer Science from George Mason University in April 2015. My research group: [COMPASS@SUSTech]. I am looking for graduate students, postdocs, undergraduate students to work with me on exciting projects in systems security. If you are interested, please send me your CV. Multiple fully funded positions are available [Hire Link, æèå¯ç¤º]. Teaching Fall 2025: CS 315, Computer Security Spring 2025: CS 109, Introduction to Computer Programming Previous Semesters: [full list] Five Selected Recent Publications [full list] Authors with \"_\" is student/scholar in my lab or courses; Ë indicates equal contribution; * indicates the corresponding author. ccAI: A Compatible and Confidential System for AI Computing  [slides] Chenxu WangË, Danqing TangË, Changxu ChiË Junjie Huang, Yankai Xu, Fengwei Zhang*, Jiannong Cao, Jie Song, Shoumeng Yan*, Tao Wei, and Zhengyu He. To Appear In Proceedings of the 58th IEEE/ACM International Symposium on Microarchitecture (MICRO'25), Seoul, Korea, October 2025. MOLE: Breaking GPU TEE with GPU-Embedded MCU  [slides] Hongyi LuË, Yunjie DengË, Sukarno Mertoguno, Shuai Wang*, and Fengwei Zhang* To Appear In Proceedings of the ACM Conference on Computer and Communications Security (CCS'25), Taibei, Taiwan, China, October 2025. TETD: Trusted Execution in Trust Domains  [slides] Zhanbo Wang, Jiaxin Zhan, Xuhua Ding, Fengwei Zhang*, and Ning Hu To Appear In Proceedings of the USENIX Security Symposium (USENIX Security'25), Seattle, WA, USA, August 2025. SCRUTINIZER: Towards Secure Forensics on Compromised TrustZone  [slides] Yiming Zhang, Fengwei Zhang*, Xiapu Luo*, Rui Hou, Xuhua Ding, Zhenkai Liang, Shoumeng Yan*, Tao Wei, and Zhengyu He To Appear In Proceedings of the Network and Distributed System Security Symposium (NDSS'25), San Diego, CA, February 2025. CAGE: Complementing Arm CCA with GPU Extensions  [slides] Chenxu Wang, Fengwei Zhang*, Yunjie Deng, Kevin Leach, Jiannong Cao, Zhenyu Ning, Shoumeng Yan, and Zhengyu He In Proceedings of the Network and Distributed System Security Symposium (NDSS'24), San Diego, CA, February 2024. [Project Website] Recent Professional Services and Memberships Editorial Board [TIFS]: Associate Editor, IEEE Transactions on Information Forensics and Security, 2024-. Program Organization [DAC]: TPC Track Chair, IEEE/ACM Design Automation Conference, Embedded and Cross-Layer Security Track, 2025, 2026. [DSN]: Publicity Co-Chair, IEEE/IFIP International Conference on Dependable Systems and Networks, 2026. [CCS]: Proceedings Co-Chair, ACM Conference on Computer and Communications Security, 2022, 2024. [ML4CS]: General Chair, International Conference on Machine Learning for Cyber Security, 2020. [EuroSec]: Publicity Chair, European Workshop on Systems Security, 2018, 2019. [IWCSS]: Program Co-Chair, International Workshop on Cyberspace Security, 2019. [CCSW]: Publicity Chair, ACM Cloud Computing Security Workshop, 2017. Program Committee [S&P]: IEEE Symposium on Security and Privacy (âOaklandâ), 2021, 2022, 2023, 2024, 2025, 2026. [USENIX-Security]: USENIX Security Symposium, 2021, 2022, 2023, 2024, 2025. [CCS]: ACM Conference on Computer and Communications Security, 2017, 2018, 2019, 2020, 2022, 2023, 2024, 2025, 2026. [NDSS]: ISOC Network and Distributed System Security Symposium, 2023, 2024, 2025, 2026. [DAC]: IEEE/ACM Design Automation Conference, 2022, 2023, 2024, 2025. [ISSTA]: ACM SIGSOFT International Symposium on Software Testing and Analysis, 2024. [EuroS&P]: IEEE European Symposium on Security and Privacy, 2024. [ACSAC]: Annual Computer Security Applications Conference, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024, 2025. [DSN]: IEEE/IFIP International Conference on Dependable Systems and Networks, 2020, 2021, 2023, 2024, 2025. [ESORICS]: European Symposium on Research in Computer Security, 2020, 2021, 2023. [AsiaCCS]: ACM ASIA Conference on Computer and Communications Security, 2021, 2022. [SEED]: IEEE International Symposium on Secure and Private Execution Environment Design, 2024. [WiSec]: ACM Conference on Security and Privacy in Wireless and Mobile Networks, 2019, 2020, 2022. [VehicleSec]: Symposium on Vehicle Security and Privacy, 2023. [EthiCS]: International Workshop on Ethics in Computer Security, 2023. [ARES]: International Conference on Availability, Reliability and Security, 2020. [HPBD&IS]: International Conference on High Performance Big Data and Intelligent Systems, 2020. [EuroSec]: European Workshop on Systems Security, 2018, 2019, 2020, 2021. [AutoSec]: International Workshop on Automotive and Autonomous Vehicle Security, 2021, 2022. [MASS]: IEEE International Conference on Mobile Ad-hoc and Sensor Systems, 2018, 2019. [SecureComm]: EAI International Conference on Security and Privacy in Communication Networks, 2018, 2023. [ICICS]: International Conference on Information and Communications Security, 2018, 2021. Artifact Evaluation Committee [USENIX-Security]: USENIX Security Symposium, 2020. [ACSAC]: Annual Computer Security Applications Conference, 2019, 2020, 2022. [WOOT]: USENIX Workshop on Offensive Technologies, 2019. Professional Membership ACM, Association for Computing Machinery, Senior Member. CCF, China Computer Federation, Distinguished Member. CIE, Chinese Institute of Electronics, Senior Member. IEEE, Institute of Electrical and Electronics Engineers, Senior Member. USENIX, The Advanced Computing Systems Association, Member. Thesis Using Hardware Isolated Execution Environments for Securing Systems  [bib]",
  "content_length": 6533,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:49"
}