{
  "name": "Fengbo Ren",
  "homepage": "https://search.asu.edu/profile/2436287",
  "status": "success",
  "content": "Fengbo Ren | ASU Search Fengbo Ren Adjunct Faculty [email protected] Phone: 480-727-5793 ‌ 699 S. Mill Ave # 553 P.O. Box 878809 Tempe, AZ 85281 ‌ ‌ Long Bio Fengbo Ren received a bachelor's degree in electrical engineering from Zhejiang University in 2008, and his master's and doctoral degrees in electrical engineering from the University of California, Los Angeles, in 2010 and 2014, respectively. He is an Associate Professor in the School of Computing and Augmented Intelligence at Arizona State University. He is directing the Parallel Systems and Computing Laboratory (PSCLab), and he is affiliated with the NSF Industry/University Cooperative Research Center for Embedded Systems. His current research interests are focused on algorithm, hardware, and system innovations for data analytics and information processing, with emphasis on bringing energy efficiency and data intelligence into a wide spectrum of today’s computing infrastructures, from data center server systems to wearable and Internet-of-things devices. He is a senior member of both IEEE and ACM. He is a member of the Digital Signal Processing Technical Committee and VLSI Systems & Applications Technical Committee of the IEEE Circuits and Systems Society. Ren received the Broadcom Fellowship in 2012, the prestigious National Science Foundation (NSF) Faculty Early Career Development (CAREER) Award in 2017, the Google Faculty Research Award in 2018. He also received the Top 5 percent Best Teacher Awards from the Fulton Schools of Engineering at ASU in 2017, 2018, and 2019. Education Ph.D. Electrical Engineering, University of California, Los Angeles 2015 M.S. Electrical Engineering, University of California, Los Angeles 2010 B.Eng. Electrical Engineering, Zhejiang University, China 2008 Research Website URL http://ren-fengbo.lab.asu.edu/ Google Scholar URL https://scholar.google.com/citations?user=f-wp99AAAAAJ&hl=en Experts.asu.edu URL https://asu.pure.elsevier.com/en/persons/fengbo-ren Research Interests Hardware acceleration, embedded, reconfigurable, and parallel computing solutions for data analytics and information processing, energy-efficient computing, data-driven compressive sensing, hardware-friendly machine learning. Teaching Website URL https://ren-fengbo.lab.asu.edu/content/teaching Courses 2024 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CEN 799 Dissertation CEN 795 Continuing Registration 2024 Summer Course Number Course Title CSE 795 Continuing Registration CSE 584 Internship CEN 584 Internship CEN 795 Continuing Registration 2024 Spring Course Number Course Title CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 790 Reading and Conference CSE 584 Internship CEN 790 Reading and Conference CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 590 Reading and Conference CEN 795 Continuing Registration 2023 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 580 Practicum CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 580 Practicum CEN 584 Internship CEN 580 Practicum CEN 790 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration 2023 Summer Course Number Course Title CSE 795 Continuing Registration CSE 584 Internship CEN 584 Internship CEN 595 Continuing Registration CEN 795 Continuing Registration 2023 Spring Course Number Course Title CSE 493 Honors Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 790 Reading and Conference CEN 790 Reading and Conference CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 590 Reading and Conference CEN 795 Continuing Registration 2022 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation CSE 580 Practicum CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 580 Practicum CEN 584 Internship CEN 580 Practicum CEN 790 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration 2022 Summer Course Number Course Title CSE 795 Continuing Registration CSE 584 Internship CEN 584 Internship CEN 595 Continuing Registration CEN 795 Continuing Registration 2022 Spring Course Number Course Title CSE 493 Honors Thesis CSE 792 Research CSE 795 Continuing Registration CSE 799 Dissertation EEE 599 Thesis CSE 790 Reading and Conference CEN 790 Reading and Conference CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 590 Reading and Conference CEN 795 Continuing Registration CSE 493 Honors Thesis CEN 795 Continuing Registration 2021 Fall Course Number Course Title EEE 599 Thesis CSE 492 Honors Directed Study CSE 792 Research CSE 799 Dissertation CSE 580 Practicum CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 492 Honors Directed Study CSE 580 Practicum CEN 584 Internship CEN 580 Practicum CEN 595 Continuing Registration CEN 790 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration CSE 792 Research 2021 Summer Course Number Course Title CSE 584 Internship CEN 584 Internship CEN 595 Continuing Registration CEN 795 Continuing Registration 2021 Spring Course Number Course Title EEE 592 Research CSE 320 Design/Syn Digital Hardware EEE 690 Reading and Conference CSE 493 Honors Thesis CSE 792 Research CSE 799 Dissertation EEE 599 Thesis CSE 790 Reading and Conference CEN 790 Reading and Conference CEN 599 Thesis CEN 580 Practicum CSE 580 Practicum CSE 790 Reading and Conference CSE 580 Practicum CEN 792 Research CEN 799 Dissertation CEN 590 Reading and Conference CEN 795 Continuing Registration CSE 320 Design/Syn Digital Hardware CSE 320 Design/Syn Digital Hardware CSE 493 Honors Thesis CEN 571 Hardware Accele and FPGA Compu CEN 795 Continuing Registration 2020 Fall Course Number Course Title EEE 599 Thesis CSE 492 Honors Directed Study CSE 792 Research CSE 580 Practicum CSE 790 Reading and Conference CEN 792 Research CEN 599 Thesis CSE 492 Honors Directed Study CSE 580 Practicum CEN 584 Internship CEN 580 Practicum CEN 595 Continuing Registration CEN 790 Reading and Conference CEN 799 Dissertation CEN 795 Continuing Registration CEN 584 Internship CSE 792 Research CEN 571 Hardware Accele and FPGA Compu CEN 799 Dissertation Honors / Awards Top 5 percent Best Teacher Award, 2019 Google Faculty Research Award, 2018 Top 5 percent Best Teacher Award, 2018 NSF Faculty Early Career Development (CAREER) Award, 2017 Top 5 percent Best Teacher Award, 2017 Broadcom-UCLA Fellow, 2012. Professional Associations Senior Member, IEEE Senior Member, ACM",
  "content_length": 6828,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:48"
}