{
  "name": "Feng Wang 0001",
  "homepage": "https://john.cs.olemiss.edu/~fwang/Home.htm",
  "status": "success",
  "content": "Welcome to Feng Wang's Webpage Feng WANG (çå³°) Associate Professor, PhD, IEEE Senior Member Department of Computer and Information Science The University of Mississippi University, MS, USAÂ Â Â  38677 Office: 220 Weir Hall Tel: +1 662-915-5359Â Â Â  Fax: +1 662-915-5623 Email: fwang@cs.olemiss.edu Â **News** Â Â Â  I am looking for highly motivated students who would like to work in computer networking area. Interested applicants please contact me with your CV and transcript. Home Teaching Publications Awards Services CV Brief BiographyÂ  (IEEE Style)Â  (Full CV) Â Â Â  I am an Associate Professor in the Department of Computer and Information Science at the University of Mississippi, University, MS, USA. I received my Bachelor of Engineering and Master of Engineering (both in Computer Science) from Tsinghua University, Beijing, China, in 2002 and 2005, respectively. I received my PhD (in Computer Science) from Simon Fraser University, Burnaby (Metro-Vancouver), British Columbia, Canada, in 2012. I am a Senior Member of IEEE. I am a recipient of IEEE ICME Quality Reviewer Award (2011), ACM BuildSys Best Paper Award (2018), and IEEE INFOCOM Distinguished TPC Member Award (2020). I served as Program Vice Chair in International Conference on Internet of Vehicles (IOV) 2014, as TPC co-chair in IEEE ICCC 2014 (Symposium on Wireless Networking and Multimedia), and as TPC co-chair in IEEE CloudCom 2017 (IoT and Mobile on Cloud track). I also serve as Technical Committee Member in Elsevier Computer Communications, and TPC member in various international conferences including IEEE INFOCOM, IEEE/ACM IWQoS, ACM Multimedia, IEEE ICC, IEEE GLOBECOM. Research Interests Â Â Â  My research interests are mainly in computer networking area, in particular, wireless sensor/mesh networks, peer-to-peer networks, socialized content sharing, cyber-physical systems, internet of things, cloud/edge computing, crowdsourcing, big data, and applications of deep learning in computer networking. Back to Top Â",
  "content_length": 2014,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:47"
}