{
  "name": "Feng Tian 0001",
  "homepage": "http://lcs.ios.ac.cn/~fengt",
  "status": "success",
  "content": "Feng Tian Homepage TIAN Feng P.O. Box 8718, Beijing, China, 100190 Phone: (+86-10) 62661572 Fax: (+86-10) 62562533 Email: tf(at)iel.iscas.ac.cn Home Research Professional Activities Publications Brief Biography I’m a professor in Institute of Software, Chinese Academy of Sciences where I manage the pen-based & multimodal user interface research group in Intelligence Engineering Lab. I also hold a faculty position in State Key Laboratory of Computer Science. I earned my Ph.D. in Institute of Software, Chinese Academy of Sciences in 2003, working with Professor Guozhong Dai. In 2009, I was working with Professor John Canny as a visiting scholar in Berkeley Institute of Design, UC. Berkeley. My research interests include theories, interaction techniques and tools in Natural User Interface, Pen-based UI, Multi-modal UI, and other new UI styles. I have published over 60 papers in HCI field, including ACM CHI (ACM SIGCHI Annual Conference), ACM CSCW, ACM IUI, ACM Transactions on Intelligent Systems and Technology, Journal of Visual Languages and Computing and other top conferences and journals, coauthored a book (“Pen-based User Interface”) with Professor Guozhong Dai. I also got a best paper award from Chinagraph 2004, and a best paper nominee from MobileHCI 2009. Comparing with paper publication, I’m more interested in leveraging HCI technologies to resolve real problems, and bring social impact. Our research work on pen-based application tools, have been successfully applied in the sports and education fields in China. SketchPlan has been successfully applied in China Diving Team, China Badminton Team, and China Women Water Polo Team. Currently, coaches in China Diving Team use this system to design daily training plan, perform analysis and management tasks. Based on this system, I received a \"Research and Technology Service Award\" in 2004 from General Administration of Sport of China. PenOffice, a pen-based system helping teacher prepare presentation and deliver lectures has been applied in over 100 primary schools in China. Cooperating with UC. Berkeley and CMU, our work on culturally inspired mobile phone games has been proved to be valuable in helping children learn Chinese characters. See the reports from NSF, CMU and GLOBAL TIMES for more information. Along with other professional services, I serve as the chair of ACM SIGCHI China chapter, which is the Chinese branch of ACM SIGCHI, and the only HCI academic organization in Mainland currently. In every year, we work on organizing activities to attract more researchers and students join in HCI fields, connect local and international HCI communities, and promote HCI research in China. Our annual activities include China HCI academic annual conference, China Symposium on Human Computer Interaction, China Young Distinguished HCI Researcher Workshop, etc. See China Symposium on Human Computer Interaction 2011, China Symposium on Human Computer Interaction 2010, CHCI 2012 for more information. What's new Dec 15, 2011 Our paper \"Recognition of Flexible Multi-Touch Gestures with Key Stroke Extraction\" was just accepted to ACM IUI 2012. Oct 23, 2011 Our paper \"SketchComm: A tool to support rich and flexible asynchronous communication of early design ideas.\" was just accepted to ACM CSCW 2012. To graduate and undergraduate students: if you are interested in HCI research, and interested in joining my research group (as PhD. student, Master student, or intern). Do not hesitate, contact me and show your talent. ( c ) 2011. All Rights Reserved. Feng Tian",
  "content_length": 3557,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:45"
}