{
  "name": "Feng Yan 0001",
  "homepage": "http://www2.cs.uh.edu/~fyan",
  "status": "success",
  "content": "Feng Yan's Homepage Feng Yan Computer Science & Electrical and Computer Engineering, University of Houston Homepage Research Teaching Service Biography Resources Contact Welcome to Feng Yan's Homepage Dr. Feng Yan is a (tenured) Associate Professor at the Computer Science Department and Electrical and Computer Engineering Department of University of Houston and the director of the Intelligent Data and Systems Lab (IDS Lab). Before that, Dr. Yan was a (tenured) Associate Professor at University of Nevada, Reno. Dr. Yan is the recipient of the Regents' Rising Researcher Award, the NSF CAREER Award, the NSF CRII Award, the Outstanding Service Award of IEEE ACSOS, and the CSE Best Researcher Award. Dr. Yan and his students are the recipients of the Best Student Paper Award of IEEE CLOUD 2018, the Best Paper Award of CLOUD 2019, and the Best Student Paper Award of ITNG 2021. He earned M.S and Ph.D. degrees in Computer Science of William & Mary, where he worked with Evgenia Smirni and Alma Riska from EMC. He also worked at Microsoft Research with Yuxiong He, Olatunji Ruwase, and Trishul Chilimbi and HP Labs with Lucy Cherkasova. Dr. Yan's research bridges Big Data, Machine Learning, and System areas. He also conducts interdisciplinary research and has been using Big Data and Machine Learning to innovate domain science and engineering. Some of his recently focused research topics include: Large Language Models (LLM), Large-scale Distributed Deep Learning, Machine Learning as a Service (MLaaS), AutoML/Neural Architecture Search (NAS), Serverless Computing, Federated Learning, Big Data/AI-driven Wildfire/Material/Pavement. Dr. Yan and his team are actively publishing at the most prestigious venues in Machine Learning (e.g., NIPS, ICLR, KDD, AAAI, WWW, etc.) and Computer Systems (e.g., SOSP, SC, HPDC, VLDB, USENIX ATC, EuroSys, FAST, HPCA, etc.). Dr. Yan and his team are actively collaborating with industry and national labs to solve important yet challenging problems to generate real-world impact. UH is a Carnegie R1 (highest research activity) institution and among the top doctoral research universities in the US. According to CSRankings, UH is ranked top 100 overall in Computer Science. According to Shanghai Ranking, UH is ranked at 63-85 overall in US and 201-300 World-wide. PhD Openings: I am always looking for self-motivated students to join my team. If you are interested, please send me your CV and materials that you believe will help you get the position (e.g., Research Statement, Personal Statement, Publication, Transcripts, Awards, etc.). •\tFor Fall enrollment, contact me by May. For Spring enrollment, contact me by Oct. •\tDue to the large volume of application emails, I may not be able to respond every email. I usually review them in a batch and will contact you if I decide to move forward with you to the next stage. •\tIf you want a prioritized consideration and my email response, you can pick one (or a few) paper(s) from my recent publications and write a paper review (summary, your thoughts of the paper, especially weakness, what can be improved, potential follow up directions, etc.). Please follow ACM SIGMETRICS X, LinkedIn, and YouTube Channel (for any social media questions regarding ACM SIGMETRICS, contact me at fyan5 at uh.edu). If you are interested in sponsoring ACM SIGMETRICS, please contact me at fyan5 at uh.edu. Selected Awards and Grants •\tRegents' Rising Researcher Award •\tNSF CAREER Award •\tNSF CRII Award •\tNSF BIGDATA Award •\tNSF National AI Research Institutes (planning) Award •\tNSF EPSCoR Award •\tNSF REU Award •\tFAA BAKFAA Award •\tAWS Cloud Credits for Research Award •\tCSE Best Researcher Award •\tOutstanding Service Award of IEEE ACSOS •\tBest Student Paper Award, IEEE CLOUD Conference •\tBest Paper Award, CLOUD Conference •\tBest Student Paper Award, ITNG Conference Publications top-cs: top-tier Computer Science publication venue according to CSRankings top-cr: top-tier Computer Science publication venue according to Conference Ranks top-w: workshop in top-tier publication venue 26 (top-cs, top-cr) papers have been published since 2016 TORS 2025 (top journal) Tunhou Zhang, Dehua Cheng, Yuchen He, Zhengxing Chen, Xiaoliang Dai, Liang Xiong, Yudong Liu, Feng Cheng, Yufan Cao, Feng Yan, Hai Li, Yiran Chen, Wei Wen, Towards Automated Model Design on Recommender Systems, in Journal of ACM Transactions on Recommender Systems (TORS 2025). TOS 2025 (top journal) Xinyang Shao, Yiduo Wang, Cheng Li, Hengyu Liang, Chenhan Wang, Feng Yan, Yinlong Xu,, Towards Agile and Judicious Metadata Load Balancing for Ceph File System via Matrix-based Modeling, in Journal of ACM Transactions on Storage (TOS 2025). IoT 2024 (top journal, impact factor: 8.2) Seyed Mahmoud Sajjadi Mohammadabadi, Syed Zawad, Feng Yan, and Lei Yang, Speed Up Federated Learning in Heterogeneous Environments: A Dynamic Tiering Approach, in IEEE Internet of Things Journal (IoT 2024). PEVA 2024 (CORE-B, h-index: 71) Ahsan Ali*, Xiaolong Ma*, Syed Zawad, Paarijaat Aditya, Istemi Ekin Akkus, Ruichuan Chen, Lei Yang, Feng Yan, Enabling scalable and adaptive machine learning training via serverless computing on public cloud, in Performance Evaluation Journal, special issue on Performance Analysis and Evaluation of Systems for Artificial Intelligence (PEVA 2024) (*: Equal Contribution and Co-First Authors). PEVA 2024 (CORE-B, h-index: 71) Syed Zawad*, Xiaolong Ma*, Jun Yi*, Cheng Li, Minjia Zhang, Lei Yang, Feng Yan, Yuxiong He, FedCust: Offloading Hyperparameter Customization for Federated Learning, in Performance Evaluation Journal, special issue on Performance Analysis and Evaluation of Systems for Artificial Intelligence (PEVA 2024) (*: Equal Contribution and Co-First Authors). ICLR 2024 (top-cs, top-cr) Guanhua Wang*, Heyang Qin*, Sam Ade Jacobs, Xiaoxia Wu, Connor Holmes, Zhewei Yao, Samyam Rajbhandari, Olatunji Ruwase, Feng Yan, Lei Yang, Yuxiong He, ZeRO++: Extremely Efficient Collective Communication for Large Model Training, in Proceedings of the Twelfth International Conference on Learning Representations (ICLR 2024), Vienna Austria, May, 2024 (*Equal Contribution and Co-First Authors, Paper acceptance rate: 31%). ICDCS 2024 (top-cr) Seyed Mahmoud Sajjadi Mohammadabadi, Feng Yan, Lei Yang, and Junshan Zhang, Communication-Efficient Training Workload Balancing for Decentralized Multi-Agent Learning, in Proceedings of the 2024 IEEE 44th International Conference on Distributed Computing Systems (ICDCS 2024), Jersey City, New Jersey, USA, July, 2024 (Paper acceptance rate: 21.9%). BigData 2024 (top venue in big data) Tunhou Zhang, Wei Wen, Igor Fedorov, Xi Liu, Buyun Zhang, Fangqiu Han, Wen-Yen Chen, Yiping Han, Feng Yan, Hai Li, and Yiran Chen, DistDNAS: Search Efficient Feature Interactions within 2 Hours, in Proceedings of the 2024 IEEE International Conference on Big Data (IEEE BigData 2024), Washington DC, USA, Dec, 2024 (Paper acceptance rate: 19.7%). ICPE 2024 (CORE-B) Xiaolong Ma, Feng Yan, Lei Yang, Ian Foster, Michael Papka, Zhengchun Liu and Rajkumar Kettimuthu, MalleTrain: Deep Neural Networks Training on Unfillable Supercomputer Nodes, in Proceedings of the 15th ACM/SPEC International Conference on Performance Engineering (ICPE 2024), London, UK, May, 2024 (Industry Track, Paper acceptance rate: TBD). EuroSys 2024 (top-cs, top-cr) Kai Ma, Cheng Li, Enzuo Zhu, Ruichuan Chen, Feng Yan, Kang Chen, Noctua: Towards Practical and Automated Fine-grained Consistency Analysis, in Proceedings of the 19th European Conference on Computer Systems (EuroSys 2024), Athens, Greece, April, 2024 (Paper acceptance rate: TBD). TPDS 2023 (top journal, impact factor: 5.3) Hao Wu, Shiyi Wang, Youhui Bai, Cheng Li, Quan Zhou, Jun Yi, Feng Yan, Ruichuan Chen, Yinlong Xu, A Generic, High-Performance, Compression-Aware Framework for Data Parallel DNN Training, in IEEE Transactions on Parallel and Distributed Systems (TPDS 2023). JNCA 2023 (top journal, impact factor: 8.7) Shreshth Tuli, Fatemeh Mirhakimi, Samodha Pallewatta, Syed Zawad, Giuliano Casale, Bahman Javadi, Feng Yan, Rajkumar Buyya, Nicholas R. Jennings, AI augmented Edge and Fog computing: Trends and challenges, in Journal of Network and Computer Applications (JNCA 2023). MLSYS 2023 (top-w) Guanhua Wang*, Heyang Qin*, Sam Ade Jacobs, Xiaoxia Wu, Connor Holmes, Zhewei Yao, Samyam Rajbhandari, Olatunji Ruwase, Feng Yan, Lei Yang, Yuxiong He, ZeRO++: Extremely Efficient Collective Communication for Large Model Training, in Workshop on ML for Systems at NeurIPS 2023 (MLSYS 2024), Vienna Austria, May, 2024 (*Equal Contribution and Co-First Authors, Paper acceptance rate: TBD). CLUSTER 2023 (top-cr) Xinying Wang, Lipeng Wan, Scott Klasky, Dongfang Zhao, and Feng Yan SciLance: Mitigate Load Imbalance for Parallel Scientific Applications in Cloud Environments, in Proceedings of the 2023 IEEE International Conference on Cluster Computing (CLUSTER 2023), Santa Fe, New Mexico, Oct, 2023 (Paper acceptance rate: 24.6%). CCGRID 2023 (top-cr) Syed Zawad, Ali Anwar, Yi Zhou, Nathalie Baracaldo, and Feng Yan, HDFL: A Heterogeneity and Client Dropout-Aware Federated Learning Framework, in Proceedings of the 23rd IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing (CCGRID 2023), Bangalore, India, May, 2023 (Paper acceptance rate: 20%). VLDB 2023 (top-cs, top-cr) Jingyuan Zhang, Ao Wang, Xiaolong Ma, Benjamin Carver, Nicholas John Newman, Ali Anwar, Lukas Rupprecht, Dimitrios Skourtis, Vasily Tarasov, Feng Yan, and Yue Cheng, SION: Elastic Serverless Cloud Storage, in Proceedings of the 49th International Conference on Very Large Data Bases (VLDB 2023), Vancouver, Canada, Aug, 2023 (Paper acceptance rate: TBD). WWW 2023 (top-cs, top-cr) Tunhou Zhang, Dehua Cheng, Yuchen He, Zhengxing Chen, Xiaoliang Dai, Liang Xiong, Feng Yan, Hai Li, Yiran Chen, Wei Wen, NASRec: Weight Sharing Neural Architecture Search for Recommender Systems, in Proceedings of the 2023 A",
  "content_length": 45471,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:48"
}