{
  "name": "Feng Liu 0005",
  "homepage": "http://researchers.uq.edu.au/researcher/951",
  "status": "success",
  "content": "Professor Feng Liu | UQ Experts Skip to menu Skip to content Skip to footer Professor Feng Liu Email: feng@eecs.uq.edu.au Phone: +61 7 336 53982 Positions Professor School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Availability Professor Feng Liu is: Available for supervision Media expert Fields of research Biomedical engineering Qualifications Bachelor of Engineering, Shandong University (山东大学) Masters (Coursework) of Science, Shandong University (山东大学) Doctor of Philosophy, Zhejiang University Research interests Research interests My research lies in medical imaging, with the focus on magnetic resonance imaging (MRI) hardware design and electromagnetic analysis + cardiac electrical function imaging. My current research program includes: (1) Magnetic Resonance Engineering (Electromagnetic Analysis and Design); (2) Magnetic Resonance Imaging (MRI Image reconstruction, including parallel imaging, compressed sensing, etc.); (3) Bioelectromagnetism (AI-based ECG; TMS designs); (4) Computational Electromagnetics (in particular, Finite-difference Time-domain (FDTD)); (5) Engineering Optimization; (6) High-performance Parallel Computing (in particular, GPU computing). (7) Machine learning/deep learning based medical imaging. I am currently recruiting graduate students. Check out Available Projects for details. Open to both Domestic and International students currently onshore. Read more Read less Works Search Professor Feng Liu’s works on UQ eSpace All (551) Journal Article (371) Other Outputs (3) Conference Publication (177) 2025 Journal Article A novel passive shimming optimization method of MRI magnet based on a PSA-SQP hybrid algorithm Zhao, Jie, Zhu, Minhua, Xia, Ling, Fan, Yifeng and Liu, Feng (2025). A novel passive shimming optimization method of MRI magnet based on a PSA-SQP hybrid algorithm. Scientific Reports, 15 (1) 28419, 1-10. doi: 10.1038/s41598-025-13751-4 A novel passive shimming optimization method of MRI magnet based on a PSA-SQP hybrid algorithm 2025 Journal Article Passive shimming performance in 3 T MRI systems: Influence of shim parameters under varying magnet field distributions Liu, Jinhao, Wang, Miutian, Wang, Wenchen, Wang, Yaohui, Yang, Wenhui, Wang, Weimin and Liu, Feng (2025). Passive shimming performance in 3 T MRI systems: Influence of shim parameters under varying magnet field distributions. Journal of Magnetic Resonance, 381 107969, 1-14. doi: 10.1016/j.jmr.2025.107969 Passive shimming performance in 3 T MRI systems: Influence of shim parameters under varying magnet field distributions 2025 Journal Article DDMamba: A Dual-Domain Mamba for Multi-Modal Magnetic Resonance Imaging Reconstruction With Fourier Fusion Lin, Zhijin, Yang, Jie, Yu, Teng, Chi, Jieru and Liu, Feng (2025). DDMamba: A Dual-Domain Mamba for Multi-Modal Magnetic Resonance Imaging Reconstruction With Fourier Fusion. Magnetic Resonance in Medicine mrm.70148. doi: 10.1002/mrm.70148 DDMamba: A Dual-Domain Mamba for Multi-Modal Magnetic Resonance Imaging Reconstruction With Fourier Fusion 2025 Journal Article Dual-norm optimization for passive shimming in MRI with constraints on field uniformity and harmonic suppression Wang, Wenchen, Wang, Yaohui, Wei, Riyu, Weber, Ewald and Liu, Feng (2025). Dual-norm optimization for passive shimming in MRI with constraints on field uniformity and harmonic suppression. Medical Physics, 52 (11) e70081, e70081. doi: 10.1002/mp.70081 Dual-norm optimization for passive shimming in MRI with constraints on field uniformity and harmonic suppression 2025 Journal Article Gradient coil design for a 0.23 T NICU MRI system using an improved two-step Target-Field Method with enhanced linearity and compact design Liu, Jinhao, Wang, Miutian, Wang, Wenchen, Wang, Yaohui, Wang, Weimin and Liu, Feng (2025). Gradient coil design for a 0.23 T NICU MRI system using an improved two-step Target-Field Method with enhanced linearity and compact design. Journal of Magnetic Resonance, 379 107936, 1-16. doi: 10.1016/j.jmr.2025.107936 Gradient coil design for a 0.23 T NICU MRI system using an improved two-step Target-Field Method with enhanced linearity and compact design 2025 Journal Article Theory and validation of a novel image reconstruction method applied to a rotating radio frequency coil West, Lachlan, Phair, Andrew, Li, Mingyan, Brideson, Michael, Bassom, Andrew P. and Liu, Feng (2025). Theory and validation of a novel image reconstruction method applied to a rotating radio frequency coil. Applied Mathematical Modelling, 151 116522, 116522. doi: 10.1016/j.apm.2025.116522 Theory and validation of a novel image reconstruction method applied to a rotating radio frequency coil 2025 Journal Article Automatic Magnetic Field Shimming by Spectrum Convergence Method: Evaluation at a 7-T Animal MRI System Chen, Haoran, Wang, Yaohui, Wang, Wenchen, Wang, Hui, Yang, Wenhui, Wei, Shufeng, Xu, Ce, Chen, Shunzhong, Sun, Jinshui, Li, Liang and Liu, Feng (2025). Automatic Magnetic Field Shimming by Spectrum Convergence Method: Evaluation at a 7-T Animal MRI System. NMR in Biomedicine, 38 (10) e70133, 10. doi: 10.1002/nbm.70133 Automatic Magnetic Field Shimming by Spectrum Convergence Method: Evaluation at a 7-T Animal MRI System 2025 Journal Article A hybrid gradient coil design method generating ultra-high gradient magnetic field for micro-MRI utilization He, Hongyan, Wang, Yaohui, Wang, Zheng, Wei, Shufeng, Wang, Huixian, Liu, Feng, Yang, Wenhui and Wang, Qiuliang (2025). A hybrid gradient coil design method generating ultra-high gradient magnetic field for micro-MRI utilization. Review of Scientific Instruments, 96 (10) 104702, 1-8. doi: 10.1063/5.0275023 A hybrid gradient coil design method generating ultra-high gradient magnetic field for micro-MRI utilization 2025 Journal Article Accelerating multi-directional diffusion MRI through patch-based joint reconstruction Xu, Zhongbiao, Zhang, Rongli, Huang, Wei, Deng, Guanhua, Liang, Xiaoyun, Guo, Li, Cheng, Junying, Wang, Yaohui, Liu, Feng, Chen, Zhaolin and Chen, Zhifeng (2025). Accelerating multi-directional diffusion MRI through patch-based joint reconstruction. NeuroImage, 318 121413, 121413-318. doi: 10.1016/j.neuroimage.2025.121413 Accelerating multi-directional diffusion MRI through patch-based joint reconstruction 2025 Journal Article A Cough Detection Method Based on the Conformer-BiLSTM Model xu, wenlong, Zhang, Hangrui, Pan, Chen, Zhu, Jiangli, Sun, Jianzhong and Liu, Feng (2025). A Cough Detection Method Based on the Conformer-BiLSTM Model. Biomedical Physics & Engineering Express, 11 (5) 055028, 055028. doi: 10.1088/2057-1976/adff8a A Cough Detection Method Based on the Conformer-BiLSTM Model 2025 Journal Article Design, fabrication and test of a lightweight 3.0&nbsp;T cryogen-free MRI system with GM refrigerator for imaging small animals and materials Liu, Jinhao, Wang, Miutian, Sun, Youheng, Lin, Kaisheng, Wang, Wenchen, Wang, Yaohui, Wang, Weimin, Wang, Qiuliang and Liu, Feng (2025). Design, fabrication and test of a lightweight 3.0&nbsp;T cryogen-free MRI system with GM refrigerator for imaging small animals and materials. IEEE Transactions on Biomedical Engineering, 72 (8), 2462-2473. doi: 10.1109/tbme.2025.3544283 Design, fabrication and test of a lightweight 3.0&nbsp;T cryogen-free MRI system with GM refrigerator for imaging small animals and materials 2025 Journal Article A magnetically compatible, arbitrary positioning system for accurate spatial mapping of magnetic fields for shimming studies in MRI Yin, Yiqing, Wang, Wenchen, Zhao, Shihe, Wang, Hui, Cheng, Junsheng, Chen, Shunzhong, Yang, Wenhui, Liu, Feng and Wang, Yaohui (2025). A magnetically compatible, arbitrary positioning system for accurate spatial mapping of magnetic fields for shimming studies in MRI. Magnetic Resonance Letters, 5 (3) 200191, 1-6. doi: 10.1016/j.mrl.2025.200191 A magnetically compatible, arbitrary positioning system for accurate spatial mapping of magnetic fields for shimming studies in MRI 2025 Journal Article Recurrence formula-based automatic gradient eddy current compensation method for a 0.255 T MRI system Liu, Jinhao, Wang, Miutian, Wang, Wenchen, Wang, Yaohui, Yang, Wenhui, Wang, Weimin and Liu, Feng (2025). Recurrence formula-based automatic gradient eddy current compensation method for a 0.255 T MRI system. Journal of Magnetic Resonance, 380 107951, 107951. doi: 10.1016/j.jmr.2025.107951 Recurrence formula-based automatic gradient eddy current compensation method for a 0.255 T MRI system 2025 Journal Article An L0‐norm–based method for passive shimming design in MRI: a simulation‐based study Wang, Wenchen, Wang, Yaohui, Wei, Riyu, Weber, Ewald and Liu, Feng (2025). An L0‐norm–based method for passive shimming design in MRI: a simulation‐based study. NMR in Biomedicine, 38 (8) e70085, 1-8. doi: 10.1002/nbm.70085 An L0‐norm–based method for passive shimming design in MRI: a simulation‐based study 2025 Journal Article Electrolyte design enabling practical lithium/sulfur batteries via interfacial manipulation and inhibited polysulfide dissolution Lin, Yilong, Zhang, Zexian, Wu, Junru, Wang, Jiayi, Jia, Yuqing, Jin, Xiaojin, Liu, Feng, Huang, Sheng, Chen, Yanwu and Meng, Yuezhong (2025). Electrolyte design enabling practical lithium/sulfur batteries via interfacial manipulation and inhibited polysulfide dissolution. Journal of Materials Chemistry A, 13 (24), 18793-18799. doi: 10.1039/d4ta08915d Electrolyte design enabling practical lithium/sulfur batteries via interfacial manipulation and inhibited polysulfide dissolution 2025 Journal Article The proteome of the late Middle Pleistocene Harbin individual Fu, Qiaomei, Bai, Fan, Rao, Huiyun, Chen, Shaokun, Ji, Yannan, Liu, Aoran, Bennett, E. Andrew, Liu, Feng and Ji, Qiang (2025). The proteome of the late Middle Pleistocene Harbin individual. Science, 389 (6761), 704-707. doi: 10.1126/science.adu9677 The proteome of the late Middle Pleistocene",
  "content_length": 20772,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:50"
}