{
  "name": "Feng Liu 0003",
  "homepage": "https://fengliu90.github.io",
  "status": "success",
  "content": "Feng Liu (he/him) -- Senior Lecturer (US Associate Professor) at The University of Melbourne Feng Liu (he/him) @ The University of Melbourne Home Research Focus Research Group Teaching Publications Professional Services Miscellaneous Join Us Home Feng Liu, Ph.D. Senior Lecturer (US Associate Professor) in Machine Learning, ARC Discovery Early Career Researcher Awardee (Machine Learning), ACS Australasian AI Emerging Research Awardee, School of Computing and Information Systems, The University of Melbourne Visiting Scientist @ Imperfect Information Learning Team, RIKEN Center for Advanced Intelligence Project (RIKEN-AIP) Visting Fellow @ DeSI Lab, Australian Artificial Intelligence Institute, UTS Address: Room 3317, Level 3, Melbourne Connect (Building 290), 700 Swanston Street, University of Melbourne VIC 3010 Australia. E-mail (academic): fengliu.ml [at] gmail.com or feng.liu1 [at] unimelb.edu.au E-mail (industry): fengliu.genai [at] gmail.com [Google Scholar] [Github] [Group Website] [CV] Opportunities Long-time Recruitment (PhD): I am always looking for self-motivated PhD (two per semester). Please see this page for recruiting information, and check this page for the school information. Update (Aug. 27, 2025): No PhD position is available before Jan 2028. Long-time Recruitment (RA): Meanwhile, I am happy to host remote research trainees (paid). You can collaborate with many excellent researchers in the frontier machine learning research areas in our group. Check this page for more information. Update (Aug. 15, 2024): We are actively recruiting RAs. Please send your CV to my email (Gmail). Project-based Recruitment: No active recruitment. Biography I am a machine learner with research interests in statistical trustworthy machine learning. I am currently an ARC DECRA Fellow and a Senior Lecturer (US Associate Professor) in Machine Learning at the School of Computing and Information Systems, The University of Melbourne, Australia. We are also running the Trustworthy Machine Learning and Reasoning (TMLR) Lab where I am one of co-directors (see this page for details). In addition, I am a Visiting Scientist at RIKEN-AIP, Japan, and a Visting Fellow at DeSI Lab, Australian Artificial Intelligence Institute, University of Technology Sydney. I was the recipient of the Australian Laureate postdoctoral fellowship. I received my Ph.D. degree in computer science at the University of Technology Sydney in 2020, advised by Dist. Prof. Jie Lu and Prof. Guangquan Zhang. I was a research intern at the RIKEN-AIP, working on the robust domain adaptation project with Prof. Masashi Sugiyama, Dr. Gang Niu and Dr. Bo Han. I visited Gatsby Computational Neuroscience Unit at UCL and worked on the hypothesis testing project with Prof. Arthur Gretton, Dr. Danica J. Sutherland and Dr. Wenkai Xu. I have received the ARC Discovery Early Career Researcher Award, the FEIT Excellence Award in Early Career Research at The University of Melbourne, the Outstanding Paper Award of NeurIPS (2022), the Outstanding Reviewer Award of NeurIPS (2021), the Outstanding Reviewer Award of ICLR (2021), the UTS Best Thesis Award (Dean's list), the UTS-FEIT HDR Research Excellence Award (2019) and the Best Student Paper Award of FUZZ-IEEE (2019). My publications are mainly distributed in high-quality journals or conferences, such as Nature Plants, Nature Communications, JMLR, IEEE-TPAMI, IEEE-TNNLS, IEEE-TFS, NeurIPS, ICML, ICLR, KDD, IJCAI, and AAAI. I have served as area chairs (AC) for ICML, NeurIPS, ICLR, AISTATS, senior program committee (SPC) members for AAAI, IJCAI. I also serve as an Associate Editor for ACM TOPML, Associate Editor for IJMLC, Action Editor for Neural Networks, Action Editor for Transactions on Machine Learning Research. Research Interests My general research interest lies in statistically trustworthy machine learning which aims to make current AI systems reliable with theoretical/statistical guarantees. Specifically, current research directions include data-adaptive statistical hypothesis testing (as a basis for theoretical/statistical guarantees), misinformation detection/defense, privacy and copyright protection in AI systems, and efficient post-training paradigm on pre-trained vision models, vision-language models, and large-language models. Detailed topics are as follows. Data-adaptive Statistical Hypothesis Testing: Two-sample Testing: Testing if two datasets are drawn from the same distribution. (Conditional) Independence Testing: Testing if two datasets are independent (on conditions). Distributional Closeness Testing: Testing if two datasets are statistically close to each other, given a pre-defined discrepancy. Misinformation Detection/Defense: AI-generated data detection: Detecting AI-generated content. Defending against Adversarial Attacks: Detecting adversarial attacks (i.e., adversarial attack detection); Training a robust model against future adversarial attacks (i.e., adversarial training); Purifying adversarial inputs. Being Aware of Out-of-distribution Data: Detecting out-of-distribution data; Training a robust model in the open world (e.g., open-set learning, out-of-distribution generalization). Privacy and Copyright Protection in AI Systems: Copyright Protection on Training Data and/or Generative Models: Detecting in-directly illegal use of data or models. Ideally, the detection methods can have a controllable false alarm rate. Data Privacy Protection: Training a discriminative model to ensure that the training data will not be obtained by inverting the model (i.e., defending against model-inversion attacks). Efficient Post-training: Parameter-efficient Post-training/Finetuning: Post-train or finetune pre-trained models with limited parameters, e.g., model reprogramming, low-rank adaptation, and prompt tuning. Efficient Black-box Post-training/Finetuning: Post-train or finetune black-box models via inference-only optimization. I am also keen to use the reliable AI tools to address science problems, specifically on AI for Meteorology and AI for Medical Diagnosis. Research Highlights Nov/11/2025: Grateful to receive the 2025 Early Career Researcher Award from Australian Pattern Recognition Society (APRS). Nov/03/2025: Grateful to receive the Top Area Chair Award of NeurIPS 2025. Oct/28/2025: Grateful to secure one ARC Discovery Project as a leading investigator. [Announcement] Oct/25/2025: Congrates Chengyi who received the Google PhD Fellowship in the machine learning track! Sep/19/2025: Eight papers are accepted by NeurIPS 2025, including one Spotlight on AI-generated video detection. Congrates to the team! Sep/01/2025: I have successfully confirmed my continuing faculty position (equivalent to passing the tenure track in the US academic system) and been promoted to Senior Lecturer, a tenured faculty position in Australia, similar to US Associate Professor (tenured faculty position in US). Huge thanks to my family, friends, colleagues, co-authors, postdocs, and students for their long-lasting support!! Aug/16/2025: Will serve as an Area Chair for ICLR 2026. Aug/15/2025: Will serve as an Area Chair for AISTATS 2026. July/16/2025: Congrates Zesheng on securing a National Intelligence Postdoctoral Grant! July/13/2025: Will join the Senior Program Committee for AAAI 2026. May/15/2025: One paper is accepted by ACL 2025 (Findings). Congrates to the team! May/12/2025: One paper is accepted by UAI 2025. Congrates to the team! May/02/2025: Nine papers are accepted by ICML 2025. Congrates to the team! Apr/29/2025: Our monograph, Trustworthy Machine Learning: From Data to Models (ISBN: 978-1-63828-548-9), is online (see pdf file here), simultaneously published in Foundations and Trends® in Privacy and Security. Congrates to the team! Apr/05/2025: One paper is selected as CVPR 2025 highlight presentation (acceptance rate < 3.0%). Congrates to the team! Mar/30/2025: One paper on model-inversion attack is accepted by TPAMI. Congrates to the team! Mar/04/2025: Grateful to receive the best paper award from AAAI Colorai Workshop for our privacy-preserving low-rank Adaptation (LoRA) work published in AAAI 2025. Also grateful to secure one project from Australia's Economic Accelerator (AEA) Ignite Program, working on the AI-driven wearables for falls prevention. Feb/17/2025: Will serve as an Area Chair for NeurIPS 2025. Jan/23/2025: Three papers are accepted by ICLR 2025, including one paper on machine-generated text detection with deep kernel hypothesis testing, and two papers on model reprogramming (one of parameter-efficient fine-tuning methodogies). Congrates to the team! Dec/19/2024: Grateful to receive the FEIT CIS Excellence Award in Research from the School of Computing and Information Systems at the University of Melbourne. Nov/28/2024: Grateful to receive the Australasian AI Emerging Research Award from Australian Computer Society. Nov/22/2024: Will serve as an Area Chair for ICML 2025. Nov/14/2024: Will serve as an Action Editor for Transactions on Machine Learning Research. Nov/06/2024: Grateful to receive one ARC Linkage Project. [Announcement] Oct/24/2024: Grateful to receive the Outstanding Area Chair Award of ACM MM 2024. Welcome to Melbourne! Oct/21/2024: Our tutorial proposal regarding model reprogramming (efficient fine-tuning) has been accepted by ACML 2024. Welcome to join ACML 2024! Oct/03/2024: Will serve as an Area Chair for AISTATS 2025. Sep/26/2024: Five papers are accepted by NeurIPS 2024, and one of them is selected as an oral paper (acceptance rate: 0.39%). Congrates to the team! Sep/17/2024: Continue to be listed as one of the top 2% of the world’s most cited scientists in 2023, according to the Stanford University Report. Aug/08/2024: Will serve as an Area Chair for ICLR 2025. Aug/06/2024: Will serve as a senior program committee member for AAAI 2025. Jun/13/2024: One paper is selected as ICML 2024 oral presentation (acceptance rate < 1.6%) and another one is selected as ICML 2024 spotlight (acceptance ",
  "content_length": 15017,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:44"
}