{
  "name": "Feng Qian 0001",
  "homepage": "https://feng-qian.github.io",
  "status": "success",
  "content": "Feng Qian's Homepage EEB 240, Ming Hsieh Department of ECE 3740 McClintock Ave, Los Angeles, CA 90089 Email: fengqian (at) usc.edu Feng Qian {Home} News Publications CV Teaching Students Services Patents Misc NSF Projects I am looking for students at all levels. Students with strong backgrounds in multimedia, AI/ML systems, mobile computing, 5G/satellite networks, and AR/VR/MR are particularly encouraged. Please fill in this online form instead of directly emailing me. I am an associate professor in the Ming Hsieh Department of Electrical and Computer Engineering, Viterbi School of Engineering at University of Southern California (with a joint appointment in the Thomas Lord Department of Computer Science). I direct the IMMERSE Lab (Intelligent Mobile, Multimedia, and nEtwoRking SystEm Lab) at USC ECE. My research interests cover the broad areas of networked multimedia systems (video on demand, live streaming VR/AR/MR), intelligent mobile systems (including 5G/6G), cross-layer system design & analysis, application & transport layer protocols, and real-world system measurement. I obtained my Ph.D. from University of Michigan, and my Bachelor's degree from the ACM Honors Class at Shanghai Jiao Tong University. I am honored to receive several awards including the AT&T Key Contributor Award (KCA) (2014), NSF CRII Award (2016), Google Faculty Award (2016), ACM CoNEXT Best Paper Award (2016,2018), AT&T VURI Award (2017), NSF CAREER Award (2018), Trustees Teaching Award (2018), DASH-IF Excellence Award (2019), Cisco Research Award (2021), ACM SIGCOMM Best Student Paper Award (2021), Google Research Scholar Award (2022), ACM MobiCom Best Community Contribution (2022, 2023), AI 2000 Top-100 Scholar in Networking (2022,2023,2024), the Okawa Research Grant (2023), Adobe Research Gift (2024), ACM MMSys Best Paper Award (2024), and ACM Multimedia Best Student Paper Award (2024). My publication profile can be found at csrankings.org and Google Scholar with total citations of 10,400+ (H-Index:52). I am also a co-inventor of 37 U.S. patents. I prototyped the ARO (mobile Application Resource Optimizer) tool based on our Mobisys 2011 paper. It was productized by AT&T. ARO is open-sourced and widely used in industry. [ARO has been extended into the AT&T Video Optimizer, which adds analysis and best practices for mobile videos.] Last update: January 2025 Home Top fengqian.org",
  "content_length": 2397,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:46"
}