{
  "name": "Feng Chen 0005",
  "homepage": "https://homes.luddy.indiana.edu/fchen25",
  "status": "success",
  "content": "Welcome to Feng Chen's Academic Page Feng Chen Associate Professor Department of Computer Science Luddy School of Informatics, Computing, and Engineering Indiana University Bloomington Office: Luddy Hall, Room 2030 Email: fchen25 (a t) iu.edu Phone: (812) 856-5313 About Me I am an Associate Professor in the Department of Computer Science at Indiana University Bloomington. I received my Ph.D. and M.S. degrees from the Department of Computer Science and Engineering at The Ohio State University, and my M.E. and B.E. degrees from the Department of Computer Science and Engineering at Zhejiang University. Before joining IU, I was with Louisiana State University and previously worked as a research scientist at Intel Labs in the OS research group. I am a recipient of the National Science Foundation (NSF) CAREER Award. My main research interests are in systems areas, with a focus on memory and storage systems, databases, and data-intensive applications. I am also interested in computational storage, memory-based data stores, and more recently, emerging systems for LLMs, such as vector databases. To prospective students: I am recruiting Ph.D. students with full support. If you are interested in opportunities of working on many exciting topics, please send me your recent CV and transcripts. If you are a M.S. student looking for an independent study or thesis topic, you are also welcome to email or simply stop by my office for a chat. Recent News 2024/12: Our paper on HTAP databases is accepted in USENIX FAST 2025. 2024/10: I will serve in the program committee of DAC 2025. 2023/12: An NFS grant is awarded to support our research on memory-centric systems. 2023/09: Two papers are accepted in Proceedings of the VLDB Endowment. 2023/09: I will serve in the program committee of EuroSys 2024. 2023/07: Kefei Wang successfully graduated and will join Gannon University as assistant professor. Congratulations, Kefei! 2022/07: An NFS grant is awarded to support our research on computational storage. 2023/09: Two papers are accepted in Proceedings of the VLDB Endowment. 2021/12: Our paper on solving the double-logging problem is accepted in USENIX FAST 2022. 2021/12: Jian Liu successfully graduated and will join Zhejiang University of Technology as assistant professor. Congratulations, Jian! 2021/09: Our paper on caching for time-series databases is accepted in PVLDB 2021. 2021/02: Our paper on log-assisted LSM-tree is accepted in ICDE 2021. 2020/09: Our paper on optimizing in-memory KV stores is accepted in PVLDB 2020. 2020/08: I will serve in the program committee of USENIX FAST 2021. 2020/05: Yichen Jia successfully graduated with his Ph.D. degree and will join Arm Ltd. Congratulations, Yichen! 2020/03: Two papers on Bitcoin transactions and system auto-tuning are accepted in ICDCS 2020. 2019/12: Binbing Hou successfully graduated with his Ph.D. degree and will join LinkedIn Co. Congratulations, Binbing! 2020/01: I will serve in the program committee of USENIX Annual Technical Conference (ATC) 2020. 2019/11: I received Mr. and Mrs. C. W. Armstrong, Jr. Professorship of Engineering. 2019/06: An NSF grant is awarded to support our research on next-gen storage systems. 2019/03: Two papers, Reo and Prism-SSD, are accepted in ICDCS 2019. 2018/08: Our Cascade Mapping paper is accepted in SoCC 2018. 2018/04: I received the Alumni Association Rising Faculty Research Award. 2017/12: Our paper on open-channel SSDs is accepted in USENIX FAST 2017. 2017/09: Our paper on solid-state devices is published in Proceedings of the IEEE. ... Research Interests (Wordle) Operating systems Storage systems Databases systems Cloud and distributed systems My main research interests are in systems areas, with a focus on memory and storage systems, databases, and data-intensive applications and systems. My research covers a broad scope from optimizing cache and memory management in OS kernel, creating high-speed flash and disk based storage, enhancing user experience on cloud storage, to improving power efficiency for mobile and small-form-factor devices. Despite the diversity of these studies, there is a core common theme—They are all about data, the new \"gold\" in this digital era. My more recent interests are in key-value systems, computational storage, memory-based data stores, and emerging systems for LLMs, such as vector databases. Publications (Full list, Google Scholar Page) Five Most Cited Publications Feng Chen, David Koufaty, and Xiaodong Zhang, \"Understanding Intrinsic Characteristics and System Implications of Flash Memory based Solid State Drives\", Proceedings of 2009 ACM SIGMETRICS Conference on Measurement and Modeling of Computer Systems (SIGMETRICS/Performance'09), Seattle, WA, June 15-19, 2009. (Cited by 743). Feng Chen, Tian Luo, and Xiaodong Zhang, \"CAFTL: A Content-Aware Flash Translation Layer Enhancing the Lifespan of Flash Memory based Solid State Drives\", Proceedings of the 9th USENIX Conference on File and Storage Technologies (FAST'11), San Jose, CA, February 15-17, 2011. (Cited by 440). Feng Chen, Rubao Lee, and Xiaodong Zhang, \"Essential Roles of Exploiting Internal Parallelism of Flash Memory based Solid State Drives in High-Speed Data Processing\", Proceedings of the 17th International Symposium on High Performance Computer Architecture (HPCA'11), San Antonio, Texas, February 12-16, 2011. [Journal Version] (Cited by 420). Feng Chen, David Koufaty, and Xiaodong Zhang, \"Hystor: Making the Best Use of Solid State Drives in High Performance Storage Systems\", Proceedings of the 25th ACM International Conference on Supercomputing (ICS'11), Tucson, Arizona, May 31-June 4, 2011. (Cited by 365). Best Paper Award of the 25th ACM International Conference on Supercomputing. Research Impact: Hystor has made impact on commercial hybrid storage products, including Apple's Fusion Drive (See more details). Song Jiang, Feng Chen, and Xiaodong Zhang, \"CLOCK-Pro: An Effective Improvement of the CLOCK Replacement\", Proceedings of 2005 USENIX Annual Technical Conference (USENIX ATC'05), Anaheim, CA, April 10-15, 2005, pp.323-336. (Cited by 384). Research Impact: CLOCK-Pro has been adopted in OS kernel and other data management systems (See more details). Recent and Selected Publications Kecheng Huang, Zhaoyan Shen, Zili Shao, Feng Chen, and Tong Zhang, \"HaSiS: A Hardware-assisted Single-index Store for Hybrid Transactional and Analytical Processing\", Proceedings of USENIX Conference on File and Storage Technologies (FAST'25), Santa Clara, CA, February 25-27, 2025. Kecheng Huang, Zhaoyan Shen, Zili Shao, Tong Zhang, and Feng Chen, \"Breathing New Life into An Old Tree: Resolving Logging Dilemma of B+-tree on Modern Computational Storage Drives\", Proceedings of the VLDB Endowment, Vol. 17, No. 2, October, 2023. Presented at the 50th International Conference on Very Large Data Bases (VLDB'24), Guangzhou, China, August 26-30, 2024. Kefei Wang, and Feng Chen, \"Catalyst: Optimizing Cache Management for Large In-memory Key-value Systems\", Proceedings of the VLDB Endowment, Vol. 16, No. 13, pp. 4339-4352, September 2023. Presented at the 50th International Conference on Very Large Data Bases (VLDB'24), Guangzhou, China, August 26-30, 2024. Kecheng Huang, Zhaoyan Shen, Zhiping Jia, Zili Shao, and Feng Chen, \"Removing Double-Logging with Passive Data Persistence in LSM-tree based Relational Databases\", Proceedings of the 20th USENIX Conference on File and Storage Technologies (FAST'22), Santa Clara, CA, February 22-24, 2022. Jian Liu, Kefei Wang, and Feng Chen, \"TSCache: An Efficient Flash-based Caching Scheme for Time-series Data Workloads\", Proceedings of the VLDB Endowment, Vol. 14, No. 13, pp. 3253-3266, September 2021. Presented at the 48th International Conference on Very Large Data Bases (VLDB'22), Sydney, Australia, September 5-9, 2022. Jian Liu, Kefei Wang, and Feng Chen, \"Understanding Energy Efficiency of Databases on Single Board Computers for Edge Computing\", Proceedings of the 29th International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems (MASCOTS'21), Houston, TX, November 2-4, 2021. Kecheng Huang, Zhiping Jia, Zhaoyan Shen, Zili Shao, and Feng Chen, \"Less is More: De-amplifying I/Os for Key-value Stores with a Log-assisted LSM-Tree\", Proceedings of the 37th IEEE International Conference on Data Engineering (ICDE'21), Chania, Greece, April 19-22, 2021. Binbing Hou, and Feng Chen, \"A Study on Nine Years of Bitcoin Transactions: Understanding Real-world Behaviors of Bitcoin Miners and Users\", Proceedings of the 40th IEEE International Conference on Distributed Computing Systems (ICDCS'20), Singapore, November 29-December 1, 2020. Yichen Jia, and Feng Chen, \"Kill Two Birds with One Stone: Auto-tuning RocksDB for High Bandwidth and Low Latency\", Proceedings of the 40th IEEE International Conference on Distributed Computing Systems (ICDCS'20), Singapore, November 29-December 1, 2020. Yichen Jia, and Feng Chen, \"From Flash to 3D XPoint: Performance Bottlenecks and Potentials in RocksDB with Storage Evolution\", Proceedings of the 2020 IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS'20), Boston, MA, August 23-26, 2020. Kefei Wang, Jian Liu, and Feng Chen, \"Put an Elephant into a Fridge: Optimizing Cache Efficiency for In-memory Key-value Stores\", Proceedings of the VLDB Endowment, Vol. 13, No. 9, pp. 1540-1554, May 2020. Presented at the 46th International Conference on Very Large Data Bases (VLDB'20), Tokyo, Japan, August 31-September 4, 2020. Jian Liu, Kefei Wang, and Feng Chen, \"Reo: Enhancing Reliability and Efficiency of Object-based Flash Caching\", Proceedings of the 39th IEEE International Conference on Distributed Computing Systems (ICDCS'19), Dallas, TX, July 7-10, 2019. Zhaoyan Shen, Feng Chen, Gala Yadgar, and Zili Shao, \"One Size Never Fits All: A Flexible Storage Interface for SSDs\", Proceedings of the 39th IEEE International Conference on Distributed Compu",
  "content_length": 18695,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:43"
}