{
  "name": "Feng Li 0014",
  "homepage": "https://funglee.github.io",
  "status": "success",
  "content": "Feng's Homepage Home Publications Teaching Projects Services Awards Contact Welcome to Feng's Homepage I received my PhD degree in Computer Science from Nanyang Technological University, Singapore, in 2015, under the supervision of Prof Jun Luo and Prof Ying He. I obtained my BS and MS degrees from Shandong Normal University, China, in 2007 and Shandong University, China, in 2010, respectively. From 2014 to 2015, I was a research fellow in School of Computing, National University of Singapore, Singapore, working with Prof Seth Gilbert and Prof Mun Choon Chan. I then joined Shandong University, China, where I am currently a professor. I received IEEE IPCCC 2020 Best Paper Award and IEEE/ACM IWQoS 2025 Best Paper Runner-Up. I also received 2020 ACM China SIGAPP Rising Star Award due to the contribution in sensor networks, Internet of Things and their applications. My current research interests include distributed algorithms/systems, machine learning, wireless networking, mobile computing, edge computing and Internet of Things. I am looking for highly motivated Postdocs, Master/PhD students with strong background in CS, EE and Math. Undergraduate students who are interested in my research are also welcome to join us as research assistant.Feel free to join us if your are interested. Google Scholar DBLP Preprints ROSS:RObust decentralized Stochastic learning based on Shapley valuesLina Wang, Yunsheng Yuan, Feng Li, and Lingjie Duan. arXiv:2411.00365 2026 Consensus in the Known Participation Model with Byzantine Failures and Sleepy ReplicasChenxu Wang, Sisi Duan, Minghui Xu, Feng Li, and Xiuzhen Cheng. In Proceedings of the 33rd Annual Network and Distributed System Security Symposium (NDSS' 26), 2026. 2025 FedeCouple: Fine-Grained Balancing of Global-Generalization and Local-Adaptability in Federated LearningMing Yang, Dongrun Li, Xin Wang, Feng Li, Lisheng Fan, Chunxiao Wang, Xiaoming Wu, and Peng Cheng IEEE Transactions on Mobile Computing, 2025. DR-Reasoning: Detecting Diabetic Retinopathy via Reasoning VLMShaowei Li, Pengyu Chen, Yunsheng Yuan, Heng Zhang, Yong Zhang, Chunhua Hu, Xiaolei Wang, Xiaowen Liu, Huan Yang, and Feng Li. In Proceedings of the 19th IEEE International Conference on Bioinformatics and Biomedicine (BIBM' 25), Wuhan, China, December 15-18, 2025. Stick, Swipe, Secure: Acoustic Cross-Device User Authentication via a Low-Cost Passive Fingerprint StickerXue Gong, Kaiwen Guo, Hao Chen, Feng Li, and Chao Liu. In Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT' 25), 2025. CPLoRa: Parallel LoRa Backscatter Communications Compatible with Commodity LoRa ReceiversZelong Li, Shiming Gong, Lanhua Li, Bin Lyu, Feng Li, and Dusit Niyato. In Proceedings of IEEE Vehicular Technology Conference (VTC)-Fall, Chengdu, China, October 19-22, 2025. Wi-GR: Wi-Fi-based Gait Recognition Using Multi-part Velocity ProfileHao Chen, Penghao Wang, Jingyang Hu, Feng Li, Hongbo Jiang, Minglu Li, and Chao Liu. IEEE Transactions on Mobile Computing, vol. 24, no. 11, pp. 11957-11971, 2025. PDSL: Privacy-Preserved Decentralized Stochastic Learning with Heterogeneous Data DistributionLina Wang, Yunsheng Yuan, Chunxiao Wang, and Feng Li. In Proceedings of the 45th IEEE International Conference on Distributed Computing Systems (ICDCS'25), Glasgow, Schotland, UK, July 20-23, 2025. TSAJS: Efficient Multi-Server Joint Task Scheduling Scheme for Mobile Edge ComputingChaoqun Li, Rongsheng Fan, Hesong Wang, Mingda Han, Si Wu, Feng Li and Pengfei Hu. In Proceedings of the 45th IEEE International Conference on Distributed Computing Systems (ICDCS'25), Glasgow, Schotland, UK, July 20-23, 2025. MOTA: Mixture Of Traffic Agents for robust network traffic classificationShaowei Li, Zhiwen Gan, Mengbai Xiao, Pengfei Hu, Xiuzhen Cheng, Chunxiao Wang, and Feng Li. In Proceedings of the 33rd IEEE/ACM International Symposium on Quality of Service (IWQoS'25), Gold Coast, Australia, July 2-4, 2025. [Best Paper Runner-Up] ConfAgent: Towards Intelligent Network Configuration via LLM AgentShaowei Li, Zhiwen Gan, Jinyao Liu, Chengxi Gao, Fuliang Li, Si Wu, Pengfei Hu, and Feng Li. In Proceedings of the 33rd IEEE/ACM International Symposium on Quality of Service (IWQoS'25), Gold Coast, Australia, July 2-4, 2025. Digital Twin Enabled Simultaneous Learning and Modeling for UAV-assisted Secure Wireless Sensing in Unknown EnvironmentJieting Yuan, Lanhua Li, Shimin Gong, Bo Gu, and Feng Li. In Proceedings of IEEE International Conference on Communications (ICC' 25), Montreal, Canada, July 8-12, 2025. Model Poisoning Attack against Neural Network Interpreters in IoT DevicesXianglong Zhang, Feng Li, Huanle Zhang, Haoxin Zhang, Zhijian Huang, Lisheng Fan, Xiuzhen Cheng, Pengfei Hu. IEEE Transactions on Mobile Computing, vol. 24, no. 3, pp. 1715-1730, 2025. Ui-Ear: On-face Gesture Recognition Through On-ear Vibration SensingGuangrong Zhao, Yiran Shen, Feng Li, Lei Liu, Lizhen Cui, and Hongkai Wen. IEEE Transactions on Mobile Computing, vol, 24, no. 3, pp. 1482-1495, 2025. Membership Inference Attacks against Incremental Learning in IoT DevicesXianglong Zhang, Huanle Zhang, Guoming Zhang, Yanni Yang, Feng Li, Lisheng Fan, Zhijian Huang, Xiuzhen Cheng, Pengfei Hu. IEEE Transactions on Mobile Computing, vol. 24, no. 5, pp. 4006-4021, 2025. Wireless Resource Optimization for UAV Swarm Cooperative Sensing via Multi-agent Multi-task Deep Reinforcement LearningMengjie Li, Anming Dong, Guijuan Wang, Xiang Tian, Jiguo Yu, and Feng Li. In Proceedings of the 19th International Conference on Wireless Artificial Intelligent Computing Systems and Applications (WASA' 25), Tokyo, Japan, June 24-26, 2025 2024 BudsAuth: Toward Gesture-Wise Continuous User Authentication Through Earbuds Vibration SensingYong Wang, Tianyu Yang, Chunxiao Wang, Feng Li, Pengfei Hu and Yiran Shen. IEEE Internet of Things Journal, vol. 11, no. 12, pp. 22007-22020, 2024. Mring: Contactless MR/AR Extended Input Method based on Magnetic SignalChao Liu, Yipeng Liu, Feng Hong, Zhongwen Guo, Jiguo Yu, and Feng Li. ACM Transactions on Sensor Networks, 2024. (To appear) [PDF] PDSR: A Privacy-Preserving Diversified Service Recommendation Method on Distributed DataLina Wang, Huan Yang, Yiran Shen, Chao Liu, Lianyong Qi, Xiuzhen Cheng, and Feng Li. IEEE Transactions on Service Computing, vol. 17, no. 5, pp. 2733-2746,2024. [arXiv] FedSiam-DA: Dual-aggregated Federated Learning via Siamese Network for Non-IID DataXin Wang, Yanhan Wang, Ming Yang, Feng Li, Xiaoming Wu, Lisheng Fan, and Shibo He. IEEE Transactions on Mobile Computing, vol. 24, no. 2, pp. 985-998, 2024. Cloud–Edge Learning for Adaptive Video Streaming in B5G Internet of Things SystemsHaoyu Zhan, Lisheng Fan, Chao Li, Xianfu Lei, and Feng Li. IEEE Internet of Things Journal, vol. 11, no. 24, pp. 40140-40148, 2024. Incentivizing Massive Unknown Workers for Budget-Limited Crowdsensing: From Off-Line and On-Line PerspectivesFeng Li, Yuqi Chai, Huan Yang, Pengfei Hu, and Lingjie Duan. IEEE/ACM Transactions on Networking, vol. 32, no. 3, pp. 2406-2421, 2024. [arXiv] Ef-kpress: joint event-frame compression and video generation with event cameras for low-bandwidth VR streamingGuangyong Hao, Yiran Shen, and Feng Li. CCF Transactions on Pervasive Computing and Interaction, vol. 6, pp. 314–328, 2024. Fairness in Streaming Submodular Maximization Subject to a Knapsack ConstraintShuang Cui, Kai Han, Shaojie Tang, Feng Li, and Jun Luo. In Proceedings of the 30th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD'24), Barcelona, Spain, August 25-29, 2024. 2023 Efficient Capacity Constrained Assignment for Dynamic Network CoverageEerdemotai Ao, Shiqing Xin, Feng Li, Changhe Tu, Wenping Wang. IEEE Transactions on Mobile Computing, vol. 23, no. 5, pp. 5111-5129, 2023. VibHead: An Authentication Scheme for Smart Headsets through VibrationFeng Li, Jiayi Zhao, Huan Yang, Dongxiao Yu, Yuanfeng Zhou, and Yiran Shen. ACM Transactions on Sensor Networks, vol. 20, no. 4, pp. 91:1-91:21, 2023. [arXiv] Collaborative Learning in General Graphs with Limited Memorization: Complexity, Learnability, and Reliability Feng Li, Xuyang Yuan, Lina Wang, Huan Yang, Dongxiao Yu, Weifeng Lv, and Xiuzhen Cheng. IEEE/ACM Transactions on Networking, vol. 31, no. 6, pp. 3222-3237, 2023. [arXiv] A Distributed Privacy-Preserving Learning Dynamics in General Social NetworksYouming Tao, Shuzhen Chen, Feng Li, Dongxiao Yu, Jiguo Yu, Hao Sheng. IEEE Transactions on Knowledge and Data Engineering, vol. 35, no. 9, pp. 9547-9561, 2023. [arXiv] Priority-Aware Resource Scheduling for UAV-Mounted Mobile Edge Computing NetworksWenqi Zhou, Lisheng Fan, Fasheng Zhou, Feng Li, Xianfu Lei, Wei Xu, Arumugam Nallanathan. IEEE Transactions on Vehicular Technology, vol. 72, no. 7, pp. 9682-9687, 2023. Time Fairness-Based Application Offloading in Mobile Edge Computing with Individual QoS GuaranteeMengwei Xie, Lizhen Cui, Jianxiong Liu, Wei Guo, and Feng Li. In Proceedings of the 21st IEEE International Symposium on Parallel and Distributed Processing with Applications (ISPA'23), Wuhan, China, December 21-24, 2023. Ginver: Generative Model Inversion Attacks Against Collaborative InferenceYupeng Yin, Xianglong Zhang, Huanle Zhang, Feng Li, Yue Yu, Xiuzhen Cheng, Pengfei Hu. In Proceedings of the 32nd ACM Web Conference (WWW'23), Austin, TX, USA, April 30 - May 4, 2023. 2022 Harnessing Context for Budget-Limited Crowdsensing with Massive Uncertain WorkersFeng Li, Jichao Zhao, Dongxiao Yu, Xiuzhen Cheng, Weifeng Lv. IEEE/ACM Transactions on Networking, vol. 30, no. 5, pp. 2231-2245, 2022. [arXiv] PPAR: A Privacy-Preserving Adaptive Ranking Algorithm for Multi-Armed-Bandit CrowdsourcingShuzhen Chen, Dongxiao Yu, Feng Li, Zongrui Zou, Weifa Liang, and Xiuzhen Cheng. In Proceedings of the 30th IEEE/ACM International Symposium on Quality of Service (IWQoS'22), Oslo, Norway, June 10-12, 2022 2021 Fast Core Maintenance in Dynamic GraphsDongxiao Yu, Na Wang, Qi Luo, Feng",
  "content_length": 27244,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:44"
}