{
  "name": "Feng Xia 0001",
  "homepage": "https://www.xia.ai",
  "status": "success",
  "content": "Feng XiaSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcomeI'm Feng Xia from RMIT University, Melbourne, Australia.Short Bio: Dr. Feng Xia is a Professor of Data Science & AI at RMIT University, Melbourne, Australia. He is/was Associate/Guest Editor of over 20 journals (e.g., TIST, TKDD, TOMM, TAI, TNNLS, TCDS, TCSS, TITS, TETC, and TII). He has served as the General Chair, PC Chair, Track Chair, Area Chair, Workshop Chair, or Publicity Chair of over 30 conferences, and (Senior) PC Member of over 100 conferences (e.g., IJCAI, AAAI, NeurIPS, ICLR, KDD, WWW/TheWebConf, and NetSci). Dr. Xia has authored/co-authored over 300 scientific papers in journals and conferences (such as IEEE TAI, TNNLS, TETCI, TKDE, TBD, TCSS, TCDS, TNSE, TMC, TVT, TII, TCE, ACM TKDD, TOIS, TIST; IJCAI, AAAI, NeurIPS, ICLR, KDD, WWW, IROS, MM, SIGIR, ACL, EMNLP, and INFOCOM). He was recognized as a Clarivate Highly Cited Researcher (2019) and a ScholarGPS Highly Ranked Scholar (2024). Dr. Xia received a number of prestigious awards, including e.g. Springer Nature Editor of Distinction Awards 2025, IEEE Transactions on Neural Networks and Learning Systems Outstanding Associate Editor of 2023-2024, IEEE Vehicular Technology Society 2020 Best Land Transportation Paper Award, ACM/IEEE JCDL 2020 The Vannevar Bush Best Paper Honorable Mention, and WWW 2017 Best Demo Award. He has been invited as Keynote Speaker at several international conferences, and delivered a number of Invited Talks at international conferences and many universities worldwide. He is Chair of IEEE Task Force on Learning for Graphs. His research interests include artificial intelligence, graph learning, brain, robotics, and cyber-physical systems. He is a Senior Member of IEEE and ACM.I am looking for self-motivated PhD and Honours students who are interested in AI, brain science/health, and/or robotics. Scholarships are available from time to time. Feel free to contact me if you are interested. Visiting students, (remote) interns/research assistants, and visiting staff/researchers are welcome - limited places only.What is NEW![11/2025] I'm elevated to IEEE Fellow, effective 1 January 2026, with the following citation:  for contributions to graph learning and networked cyber-physical systems.[11/2025] Our comprehensive survey on Graph Learning (180+ pages) is published in Foundations and Trends in Signal Processing. DOI: 10.1561/2000000137.  arXiv:2507.05636 (full text in PDF). [download the .bib file][08/2025] CALL FOR PAPERS: The Web Conference 2026 (WWW2026) Research Track: Semantics and Knowledge, https://www2026.thewebconf.org/calls/research-tracks.html, Abstract submission: September 30, 2025; Full paper submission: October 7, 2025 [07/2025] CALL FOR PAPERS: IEEE Transactions on Cognitive and Developmental Systems Special Issue on Neuromorphic Computing in the Age of Foundation Models. Submission Deadline: Dec 31, 2025 [HTML][03/2025] CALL FOR PAPERS: IEEE Transaction on Computational Social Systems Special Issue on Emotion AI and Sentiment Analysis in Social Systems. Submission Deadline: July 31, 2025 [HTML][12/2024] CALL FOR PAPERS: ACM Transactions on Intelligent Systems and Technology Special Issue on Transformers. Submission Deadline: February 1, 2025 (extended and hard deadline). Early submissions are encouraged/preferred! [PDF (one page)] [TXT] [PNG/Image] [ACM TIST][11/2024] I delivered a Keynote Talk at KSS2024 on anomaly detection with graph learning! Grateful to organisers and attendees for fostering insightful discussions and collaboration. [09/2024] Call for Submissions - AJCAI24 PhD Forum: Submission Deadline: 20 October 2024. [Web]  [TXT] [PNG/Image] [PDF][08/2024] PhD Scholarship Alert! We’re offering one fully funded PhD Scholarship in Brain Computing, open to Australian citizens, NZ citizens, and Australian permanent residents. Email me your CV by 15 September, if interested.[08/2024] Full PhD scholarships available at RMIT (Melbourne). I'm happy to take 1-2 new students working on AI, brain science/health, or robotics. Email me your CV by 31 August, if interested. [07/2024] The National Industry PhD Program Round 4 is now open for applications. If you are interested in doing either Industry Linked PhD or Industry Researcher PhD at RMIT (in AI, with scholarship/stipend), please contact me ASAP, by the end of July. [06/2024] One full PhD scholarship as part of an ARC-funded project is available. Check this page for details. [06/2024] I'm happy to host visiting China Scholarship Council (CSC) PhD students and staff at RMIT (Melbourne City Campus). All bench fees will be waived. [04/2024] I’m happy to host MSCA (Marie Skłodowska-Curie Actions) Global Postdoctoral Fellows at RMIT. Check the call for MSCA Postdoctoral Fellowships 2024, which is now open and will close on 11 September 2024. See also this flyer (PDF).  [07/2023] Research scholarships available. I'm happy to take/supervise some new PhD students working on graph learning, AI (for science), or digital health. Check eligibility and key dates. Email me your CV if interested. See Research Stipend Scholarships; Vice-Chancellor’s PhD Scholarship (VCPS). [03/2023] CALL FOR PAPERS: IEEE Transactions on Neural Networks and Learning Systems Special Issue on Graph Learning. Submission Deadline: 1 July 2023 (extended and hard deadline). Early submissions are encouraged/preferred! [PDF] [HTML][01/2023] CALL FOR PAPERS: Sci-K 2023: 3rd International Workshop on Scientific Knowledge: Representation, Discovery, and Assessment, a workshop of The ACM Web Conference 2023, Texas, USA, April 30 - May 4, 2023. https://sci-k.github.io/2023/, Submissions due: February 6th, 2023. [06/2022] CALL FOR PAPERS:  KG 2022: International Workshop on Knowledge Graphs, a workshop of IEEE ICDM 2022, Nov 28, 2022. http://www.kgworkshop.org/. Submissions due: September 17, 2022. [04/2022] GraphLearning 2022: The International Workshop on Graph Learning will take place on Monday, April 25, 2022, Online (CEST, UTC+2), as part of The ACM Web Conference 2022. Check it out: https://graphlearning.net/.[04/2022] CALL FOR PAPERS: IEEE Intelligent Systems Special Issue on Deep Anomaly Analytics, Submissions due: 1 August 2022, https://www.computer.org/digital-library/magazines/ex/cfp-deep-anomaly-analytics.  [04/2022] CALL FOR PAPERS: KDD2022 Workshop on Data-driven Science of Science, Submission due: May 26, 2022, http://124.70.200.79:8199/DDSoS-KDD-2022/. [01/2022] CALL FOR PAPERS: The ACM Workshop on Graph Learning: A workshop of The ACM Web Conference 2022, April 25, 2022, Online; http://www.graphlearning.net/. Submissions due: February 15, 2022. [PDF] [TXT] [PNG][12/2021] Call For Participation: IEEE/WIC/ACM WI-IAT'21 Special Track on Social Computing, chaired by me, will take place soon on Tuesday, December 14, 2021, from 9:00 to 18:00 (Australian Eastern Daylight Time, GMT+11), on Zoom. Everyone is welcome to attend! Check out the flyer (PNG) and website (https://sites.google.com/view/wi-iat2021sc/) for details. [12/2021] Call For Participation: IEEE ICDM 2021 Workshop on Intelligence-Augmented Anomaly Analytics (IAAA 2021) will take place on Zoom, Tuesday, December 7, 2021. Everyone is welcome to attend! Check out the flyer (PDF, PNG) and website for details.[07/2021] CALL FOR PAPERS: ACM SAC 2022 Track on Knowledge Graphs, The 37th ACM/SIGAPP Symposium on Applied Computing, Brno, Czech Republic, April 25 - April 29, 2022; https://sites.google.com/view/sac2022kg/. Submissions due: October 24, 2021 [extended]. [06/2021] CALL FOR PAPERS: IAAA 2021: IEEE ICDM 2021 Workshop on Intelligence-Augmented Anomaly Analytics, December 7, 2021, Auckland, New Zealand; https://sites.google.com/view/iaaa2021/. Submissions due: September 3, 2021. [06/2021] CALL FOR PAPERS: IEEE Transactions on Industrial Informatics Special Section on Distributed Intelligence Over Internet of Things; http://www.ieee-ies.org/images/files/tii/ss/2021/Distributed_Intelligence_Over_Internet_of_Things_2021-5-18.pdf. [PDF] Submissions due: September 30, 2021. Contact Info Affiliation: School of Computing Technologies, RMIT University, Melbourne, VIC 3000, AustraliaPostal address: GPO Box 2476Street address: 124 La Trobe StreetEmail: f.xia@ieee.org; feng.xia@rmit.edu.au  Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 8364,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:47"
}