{
  "name": "Fereydoun Hormozdiari",
  "homepage": "http://www.hormozdiarilab.org",
  "status": "success",
  "content": "Hormozdiari Lab Menu Pervious lab picture Our lab is at the intersection of computer science and genomics. We specialize in developing novel computational algorithms and machine learning approaches for analyzing biological data. The primary objective of the lab is to develop novel combinatorial algorithms and machine learning methods to study genomes and discover biomolecular causes of complex disorders. We are located on the fourth floor of the UC Davis Genome Center.   NEWS:**NEW** Open graduate student positions at our lab (consider applying to computer science or integrated genetics-genomics graduate programs at UC-Davis).Julie Chow successfully defended her doctoral degree! Congratulations Julie! Fereydoun was awarded BSF research grantFereydoun awarded tenure and was promoted to Associate Professor at UC-Davis.Parsoa Khorsand successfully defended his doctoral degree! Congratulations Parsoa! Fereydoun was awarded the NSF CAREER award (DBI - 2042518) Ashleigh Thomas successfully defended her masters degree! Congratulation Ashleigh!Thong Minh Le successfully defended his doctoral degree! Congratulations Thong!Jason Driver successfully defended his masters degree! Congratulations Jason!Songyu Liu Successfully defended his masters degree! Congratulation Songyu!Fereydoun was named 2017 Sloan Research Fellow (Awardees and media coverage).Selected Publications:The methods Nebula for ultra-efficient genotyping of SVs is published in Nucleic Acids Research (2021) The method MAGI-S for the discovery of genetic modules with the ability to dissect neurodevelopmental phenotypes was published in Genome Medicine (2019). The method Kevlar for mapping-free de novo variant prediction was published in iScience (2019).The extension of our tool TARDIS for complex structural variation prediction was published in Bioinformatics (2019). The method for predicting the impact of structural variation on 3D genome structure was published in Genome Biology (2019).The method for early prediction of Neurodevelopmental Disorders was published in Genetics (2018). The method for TAD-fusion scoring and ranking was accepted to RECOMB, 2018 (accepted papers list).The method Odin for early prediction of neurodevelopmental disorders was accepted to RECOMB, 2017 (accepted papers list). prev / next Back to Home 0 Previous Lab Picture",
  "content_length": 2339,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:35"
}