{
  "name": "Ferenc Huszar",
  "homepage": "https://www.inference.vc/about",
  "status": "success",
  "content": "Ferenc Huszár Ferenc Huszár I'm a Professor of Machine Learning at Cambridge University and founder of Reasonable a deep tech startup focussed on superhuman programming LLMs. Our lab at Cambridge studies foundational aspects of learning, inference, inductive biases and reasoning in deep learning: PhD students Annabelle Carrell: calibration in deep neural networks Nitarshan Rajkumar: AI safety and governance; AI Safety Institute. Siyuan Guo: co-sup with Bernhard Schölkopf, causality, probability, exchangeability Kamilė Stankevičiūtė: self-supervised learning, pharmacology, tabular deep learning Szilvia Ujváry: LLM theory, in-context learning, implicit Bayesian inference Anna Mészáros: LLM theory, rule extrapolation, formal languages Patrik Reizinger: co-sup with Wieland Brendel, causal representation learning, identifiability Iulia Duta co-sup with Pietro Lió, graph, hypergraph and geometric deep learning Royson Lee: co-sup with Nic Lane, federated learning, imbalanced data, meta-learning Research Assistants Euan Ong: differentiable algorithms, mechanistic interpretability, understanding deep learning Viktor Mirjanic: co-sup with Challenger Mishra, ML for string theory, conjecture generation Binjie (Anya) Chen: co-sup with Challenger Mishra, ML for string theory, surrogate models Alumni and friends Undergraduate: Viktór Tóth, Viktória Csizmadia, Euan Ong, Bence Hervay, Anna Kerekes, Anna Mészáros, Szilvia Ujváry, Zsigmond Telek Masters: Ross Viljoen, Ren Cheong, Mina Remeli, Andrei Alexandru, Charlie Tan, Rudolf Laine For prospective students I expect to be on leave from my Professorship for an extended period to focus on my company, Reasonable. I won't be considering applications for PhD and won't be able to supervise Part II or Part III/MPhil projects. About me I'm Ferenc Huszár, Associate Professor of Machine Learning at the University of Cambridge. I joined the Department of Computer Science and Technology, a nice and cozy department, in 2020. I'm interested in principled deep learning techniques: optimization, generalization, representation, transfer, meta-learning, and so on. I focus more on understanding than on developing new techniques. I did my PhD in Bayesian machine learning with Carl Rasmussen, Máté Lengyel and Zoubin Ghahramani over at the Engineering Department in Cambridge. I worked on topics of approximate inference [1, 2], active learning [3, 4], and applications of these to sciences [5, 6]. Following my PhD I worked in various jobs in the London tech/startup sector. My highlight as a researcher is joining Magic Pony Technology, a startup where we developed deep learning-based image superresolution [7, 8] and compression [9] techniques. After Twitter's acquisition Magic Pony, I have worked on a range of ML topics, like recommender systems [10, 11] and fair machine learning. inFERENCe I started this blog some time ago but now it kind of has its own life. inFERENCe got started when, in 2015, I returned to machine learning research after a 3-year stint as a data scientist. I basically slept through the deep learning revolution. In those three years, many things happened, so I had to play catch up. Initially, these blog posts helped me understand the body of literature I have missed: generative adversarial networks, variational autoencoders, representation learning, etc. Nowadays, I continue reading and writing about current papers, trying to reinterpret them and find connections to things I know, usually ending up with some kind of KL divergence. If you're new here and want to get a taste, you may want to start with these crowd favourites: introduction to causal inference and do-calculus and follow-up posts. dilated convolutions and Kronecker products Gaussian Distributions as Soap Bubbles Everything that works works because it's Bayesian GANs are broken in more than one way Contact You can send me an email to fh277@cam.ac.uk, follow me on twitter @fhuszar, or look at my Google scholar profile.",
  "content_length": 3981,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:54"
}