{
  "name": "Fernando Pedone",
  "homepage": "http://search.usi.ch/persone/c0c73c01f826ab0fdbef316b448f7d7c/Pedone-Fernando",
  "status": "success",
  "content": "Pedone, Fernando | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Fernando Pedone http://usi.to/ez3 Biography Fernando Pedone received his Ph.D. degree in computer science from Ecole Polytechnique Fédérale de Lausanne (EPFL), Switzerland, in 1999. Before becoming Assistant and Associate Professor at the University of Lugano, he worked as a researcher at the Hewlett-Packard Laboratories in PaloAlto, California, and as a senior researcher at EPFL. His professional interestsinclude the theory and practice of distributed systems and distributed datamanagement systems. His theoretical work has addressed algorithmic aspects of reliable distributed systems, such as defining new abstractions for buildingreliable systems, creating algorithms implementing these abstractions and proving them correct. His systems work has considered using group communication abstractions to build replicated data management systems. To a largeextent, he has been interested in the inter play between theory and practice. Fernando Pedone has authored more than 70 scientific papers. He is co-editor of the book Replication: theory and practice. Competence areas Dependable Distributed Systems Distributed Algorithms Distributed Data Management Systems Distributed Systems Faut-tolerant systems Contact fernando.pedone@usi.ch tel +41 58 666 4695 East Campus, Sector D, Office D2.15 (Level P2) Via la Santa 1, 6962 Lugano-Viganello Roles Faculty of Informatics Full Professor Computer Systems Institute (SYS) Links Website or personal page Attachments CV (en) Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 2292,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:10"
}