{
  "name": "Fernando Santos Osório",
  "homepage": "http://conteudo.icmc.usp.br/pessoas/fosorio/fosorio-usp.html",
  "status": "success",
  "content": "Osorio's Home Page USP - Universidade de São Paulo, São Carlos / SP ICMC - Instituto de Ciências Matemáticas e de Computação SSC - Departamento de Sistemas de Computação Página Web Ofical na USP Homepage in English Prof. Dr. Fernando OSÓRIO Afiliação Profissional: Professor do ICMC-USP (Universidade de São Paulo) Departamento de Sistemas de Computação - SSC Grupo/Linha de Pesquisa: Grupo de Robótica Móvel (GRM) Membro do Laboratório de Robótica Móvel - LRM. Membro do Centro de Robótica da USP São Carlos - CROB/USP-SC. Membro do Centro de Inteligência Artificial da USP+IBM+FAPESP - C4AI. Membro da IEEE-CS, IEEE-RAS, ACM e SBC. CV Lattes (Curriculum) - Publicações: [2012] [2011] [2010] [2009] [All/Old] User: usp Pwd: guest [ACM DL] [DBLP] [Google Scholar] [Microsoft Academic] [Publicações do LRM] CBN Inteligência Artificial [Podcast CBN] [Podcast CBN Spotify\"] [Podcast CBN (Texto)] Clique aqui: Porque esta página é assim... ;^) Simples, feia, (pré-)histórica! Museu vivo... de 1994 Clique aqui: FOsorio em 3D :^) Clique aqui: Projeto CaRINA - CaRINA News (inclui video) Ensino Disciplinas 2025/2: SSC0603: Estruturas de Dados I SSC0715: Sensores Inteligentes Disciplinas 2025/1: SSC0600: Teoria: Introdução a Ciência da Computação (ICC1) SSC0601: Pratica: Introdução a Ciência da Computação (Lab. ICC1) SSC0714: Robôs Móveis Autônomos SSC5888: Robôs Móveis Autônomos (PG-CCMC) Disciplinas 2024/2: SSC0603: Estruturas de Dados I SSC0715: Sensores Inteligentes SSC0670+SSC0591+outras: Disciplinas de Projeto e Estágio (Final de curso) Disciplina no E-Disciplinas USP: Projeto e Estágio - EC e BSI Disciplinas 2024/1: SSC0600: Introdução a Ciência da Computação (ICC1) SSC0714: Robôs Móveis Autônomos SSC0712: Programação de Robôs Móveis SSC5888: Robôs Móveis Autônomos (PG-CCMC) Disciplinas 2023/2: SSC0801: Introdução a Ciência da Computação (ICC1) SSC0603: Estruturas de Dados I Disciplinas 2023/1: SSC0600: Introdução a Ciência da Computação (ICC1) SSC0714: Robôs Móveis Autônomos SSC0712: Programação de Robôs Móveis SSC5888: Robôs Móveis Autônomos (PG-CCMC) Disciplinas 2022/2: SSC0510: Arquitetura de Computadores SSC0715: Sensores Inteligentes SSC0800: Introdução a Ciência da Computação (ICC1) Disciplinas 2022/1: SSC0714: Robôs Móveis Autônomos SSC0712: Programação de Robôs Móveis SSC5888: Robôs Móveis Autônomos (PG-CCMC - Inicio das aulas: 28/03/22) MAI5001: Introdução a Ciência da Computação (PG-MECAI - Inicio das aulas: 01/04/22) Disciplinas 2021/2: SSC0902: Organização e Arquitetura de Computadores SSC0603: Estruturas de Dados I Disciplinas 2021/1: SSC0714: Robôs Móveis Autônomos SSC0712: Programação de Robôs Móveis SSC0671: Informação Profissional em Engenharia de Computação II (Inicio das aulas: 07/06/21 (2o. trimestre)) SSC5888: Robôs Móveis Autônomos (PG-CCMC - Inicio das aulas: 12/04/21) Disciplinas 2020/2: SSC0902: Organização e Arquitetura de Computadores SSC0603: Estruturas de Dados I Disciplinas 2020/1: SSC0714: Robôs Móveis Autônomos SSC0712: Programação de Robôs Móveis SSC0671: Informação Profissional em Engenharia de Computação II (Inicio das aulas: 27/04/20 (2o. trimestre)) SSC5888: Robôs Móveis Autônomos (PG-CCMC - Inicio das aulas: 09/03/20) MAI5001: Introdução a Ciência da Computação (PG-MECAI - Inicio das aulas: 09/03/20) Disciplinas 2019/2: SSC0715: Sensores Inteligentes SSC0902: Organização e Arquitetura de Computadores SSC0603: Estruturas de Dados I Disciplinas 2019/1: SSC0714: Robôs Móveis Autônomos SSC0712: Programação de Robôs Móveis SSC0576/577/578: Seminários em Computação I SSC0671: Informação Profissional em Engenharia de Computação II SSC5888: Robôs Móveis Autônomos (PG-CCMC) Disciplinas 2018/2: SSC0715: Sensores Inteligentes SSC0576: Seminários em Computação I SSC0603: Estruturas de Dados I Disciplinas 2018/1: SSC0601: Laboratório de ICC I (Intro. à Computação) SSC0714: Robôs Móveis Autônomos SSC0576/577/578: Seminários em Computação I SSC5888: Robôs Móveis Autônomos (PG-CCMC) Disciplinas 2017/2: SSC0715: Sensores Inteligentes SSC0576: Seminários em Computação I SSC0572: Computadores, Sociedade e Etica Profissional Disciplinas 2017/1: SSC0714: Robôs Móveis Autônomos SSC0671: Informação Profissional em Engenharia de Computação II SSC0576: Seminários em Computação I SSC5888: Robôs Móveis Autônomos (PG-CCMC) Programação I (Curso de Extensão) Disciplinas 2016/2: SSC0715: Sensores Inteligentes Disciplinas 2016/1: SSC0714: Robôs Móveis Autônomos SSC0671: Informção Profissional em Engenharia de Computação II (Formulario Avaliação AQUI - p/alunos da disciplina) SSC5888: Robôs Móveis Autônomos (PG-CCMC) Disciplinas 2015/2: SSC0511: Organização de Computadores SSC0715: Sensores Inteligentes Disciplinas 2015/1: SSC0501: Introdução à Ciência da Computação SSC0714: Robôs Móveis Autônomos SSC0712: Programação de Robôs Móveis SSC5888: Robôs Móveis Autônomos (PG-CCMC) Disciplinas Ministradas Anteriores a 2015 Palestras e Cursos de Extensão: Arduino Day 2016 @ ICMC - Arduino/Genuino Day JAI 2015 - CSBC Recife 2015 \"Simulação de Robôs Móveis e Articulados: Aplicações e Prática\" SEMCOMP 2009 - Tutorial SemComp12 \"Simulação Virtual de Carros em Jogos e Aplicações de I.A.\" SBGAMES 2009 - Tutorial SBGames \"Simulação Virtual de Carros em Jogos e Aplicações de I.A.\" JAI 2009 - CSBC \"Robótica Móvel Inteligente: Da Simulação às Aplicações no Mundo Real\" SemComp 2008: Desenvolvimento Rápido de Jogos em 3D (Dark GDK) [Material sendo organizado...] Programção de robôs móveis Tutoriais em Computação/Informática 2011 - Robôs Móveis Inteligentes (Infos sobre o LRM-2011) Tutoriais em Computação/Informática 2009 - Robôs Móveis Autônomos e Inteligentes: UGVs e UAVs Atuação Professor do ICMC-USP (Universidade de São Paulo), membro do LRM - Laboratório de Robótica Móvel. Anteriormente trabalhou junto ao Grupo de Inteligência Artificial e ao Grupo de Pesquisa em Veículos Autônomos - GPVA do PPG de Computação Aplicada da UNISINOS. Informações complementares (Ensino, Pesquisa, Extensão, Publicações): AQUI Titulação Ph.D. em Computação (Docteur en Informatique) pelo INPG/IMAG Grenoble, França (Institut National Polytechnique de Grenoble) [1998]. Mestre em Ciência da Computação pelo PPGCC da UFRGS [1991]. Bacharel em Ciência da Computação pela UFRGS [1988]. Publicações Lista de Publicações On-Line => IMPORTANTE: use Login \"usp\" e Password \"guest\"Lista de arquivos do diretório aqui Atualizado até o final de 2006. Novas publicações de 2007 estão sendo incluídas. Lista de publicações indexadas - bibtex (as presented by \"Publish or Perish\" - Harzing.com) Publicações mais recentes: [2012] [2011] [2010] [2009] [All/Old] User: usp Pwd: guest [ACM DL] [DBLP] [Google Scholar] [Microsoft Academic] [Publicações do LRM] Orientações de Trabalhos de Mestrado Concluídos Teses e Dissertações orientadas na USP: AQUI Conferências: Conferências de Robótica - SBR-LARS 2016 - Latin-American and Brazilian Robotic Symposium + OBR, MNR, CBR, WRE 2016 Conferências de Robótica - SBR-LARS 2015 - Latin-American and Brazilian Robotic Symposium + OBR, MNR, CBR, WRE 2015 SBR-LARS 2014 Latin-American and Brazilian Robotic Symposium ACM SAC Robot 2013 ACM SAC Robot 2012 ACM SAC Robot 2011 ACM SAC Robot 2010 ACM SAC Robot 2009 SBGames 2012 SBGames 2011 SBGames 2010 SBGAMES 2009 SBGAMES 2008 Informações Adicionais HOMEPAGE: F. Osorio - Home Page (in English) Atividades de ensino (ultimos 2 anos - ver Homepage Antiga): Inteligência Artificial, Aprendizado de Máquinas (Machine Learning), Redes Neurais Artificiais, Sistemas Robóticos Inteligentes, Programação em \"C\" e Pascal, Compiladores, Desenvolvimento de Jogos de Computadores, Inteligência Artificial para Jogos. CV (CNPq CV Lattes): My Curriculum Vitae SOCIEDADES: Afiliado a IEEE, ACM e SBC Informações para contato Email: fosorioicmc. usp. br (preferencial) fosoriogmail. com fosorioieee. org osorioacm. org Tel: (+55 16) 3373 8174 [USP Ramal:73.8174] Fax: (+55 16) 3373 9650 - Secretaria: 3373.9655 (Glauci/Carmen) Endereço: Prof. Dr. Fernando Santos Osório USP - ICMC (Instituto de Ciências Matemáticas e de Computação) SSC - Depto. de Sistemas de Computação Av. Trabalhador São-Carlense, 400 - Centro Caixa Postal 668 São Carlos - SP - BRAZIL CEP: 13560-970 fosorio <at> icmc <dot> usp <dot> br Last update: from 1994 to 2023 :^)",
  "content_length": 8267,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:09"
}