{
  "name": "Fernando José Castor de Lima Filho",
  "homepage": "http://fernandocastor.github.io",
  "status": "success",
  "content": "Fernando Castor Micro-bioHi! I am an associate professor of green software development at the Formal Methods and Tools Group of the Faculty of Electrical Engineering, Mathematics, and Computer Science, University of Twente, The Netherlands, working under prof. Marieke Huisman. Until July 2024, I also held a position as an associate professor at the Informatics Center, Federal University of Pernambuco, Brazil. Before joining UTwente, I was an assistant professor in prof. Sjaak Brinkkemper's group at the Department of Information and Computing Sciences, Utrecht University, The Netherlands. Between 2019 and 2020 I was a visiting professor at prof. Hidehiko Masuhara's group at the Institute of Science Tokyo (東京科学大学基金), formerly Tokyo Institute of Technology (東京工業大学). Previously, I held positions as assistant professor at the Department of Computing and Systems (DSC) of the University of Pernambuco (UPE), and postdoctoral researcher at the Department of Computer Science (DCC-IME) of the University of Sao Paulo (USP), under prof. Fabio Kon. I got my PhD in computer science from the Institute of Computing (IC), State Universty of Campinas (UNICAMP), under prof. Cecilia Rubira, and my bachelor's degree from CIn-UFPE, working under prof. Paulo Borba. During my PhD, I’ve also spent some months at Microsoft Research, working under Dr. Manuel Fahndrich, at Newcastle University, working under prof. Alexander Romanovsky, at the University of Kent at Canterbury, working under prof. Rogério de Lemos, and at Lancaster University, working under prof. Alessandro Garcia. I'm very fortunate for having had the opportunity of working with a host of amazing people. For more info, you can check my Google Scholar profile. A more official short bio is available here. Contact Information (I am a really slow email reader and may take an unbounded amount of time to answer. Please bear that in mind when sending me email.)+31 (30) 253 7088 (in the office on Tuesdays and Thursdays) University of Twente, Faculty EEMCS Formal Methods and Tools Building Zilverling, room 3098 P.O. Box 217, 7500 AE Enschede, The Netherlands",
  "content_length": 2123,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:00"
}