{
  "name": "Fernando M. V. Ramos",
  "homepage": "https://ciencias.ulisboa.pt/perfil/fvramos",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo (Em Ciências até Fevereiro de 2020) Indicadores ResearcherID Orcid Google Scholar Currículo Resumido (última atualização) Fernando Ramos is Assistant Professor at the University of Lisbon, Portugal. He is an integrated researcher of the LASIGE research unit. Previously he was Supervisor at the University of Cambridge, UK; Teaching Assistant at the Higher Institute of Engineering of Lisbon, Portugal, and at the University of Aveiro, Portugal. Over the past 16 years he has taught 20+ courses: on physics, electrical engineering, and (mainly) computer science. Periods outside academia include working as a Researcher at Portugal Telecom and at Telefonica Research Barcelona. Fernando holds a Ph.D. from the University of Cambridge, a Master of Science from Queen Mary University of London, U.K. (distinction and best student award), and a Licenciatura (5 years undergraduate course) from the University of Aveiro. His current research interests include software-defined networking, network programmability and network virtualization. Interesses Científicos Redes definidas por software, redes programáveis, virtualização de redes Scientific Interests Software-defined networking, network programmability and network virtualization. Publicações selecionadas D. Kreutz, F. M. V. Ramos, P. Verissimo, C. E. Rothenberg, S. Azodolmolky, S. Uhlig, “Software-Defined Networking: A Comprehensive Survey”, Proceedings of the IEEE, Jan. 2015 Pedro ARS Costa, Fernando MV Ramos, Miguel Correia, Chrysaor: Fine-Grained, Fault-Tolerant Cloud-of-Clouds MapReduce, CCGRID'17 M. Lacost et al., \"User-Centric Security and Dependability in the Clouds-of-Clouds\", IEEE Cloud Computing 3 (5), 64-75, Sep. 2016 D Kreutz, J Yu, P Verissimo, F Ramos, C Magalhaes, \"The KISS principle in Software-Defined Networking: a framework for secure communications\", IEEE Security & Privacy, 2018 D. Kreutz, F. M. V. Ramos, P. Veríssimo, “Towards Secure and Dependable SDN”, HotSDN, August 2013 Ver todas as Publicações",
  "content_length": 2148,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:04"
}