{
  "name": "Fernando Luís Dotti",
  "homepage": "http://www.inf.pucrs.br/~fldotti",
  "status": "success",
  "content": "Fernando Luï¿½s Dotti Full Professor. PhD in Computer Science at Berlin Technical University, 1993-97. MSc and BSc in Computer Science at II-UFRGS, 1988 and 1991. PUCRS - Pontifï¿½cia Universidade Catï¿½lica do Rio Grande do Sul School of Technology Graduate Program in Computer Science Av. Ipiranga 6681 90619-900 Porto Alegre - RS - Brazil E-mail: firstname.lastname(at)pucrs.br Phone: +55 51 3320 3558 (dept) +55 51 3353 8614 (direct) www.inf.pucrs.br/~fldotti    (this web page) Fernando Full ProfessoPhD Research Gate Dependable Distributed Computing  (Research Group - CNPq) Curriculum Vitae (Lattes CV - CNPq) Short CV DBLP Google Scholar ORCID Research Gate Undergraduate Courses [at PPGCC - the Graduate Program in CS at School of Technology - PUCRS] ï¿½ Operating Systems ï¿½ Distributed Systems ï¿½ Computational Models for Concurrency [ PUCRS students please find information in our Moodle area] Graduate Courses: [at Computer Science and Computer Engineering courses at School Technology - PUCRS] ï¿½ Distributed Algorithms ï¿½ Distributed Systems [ PUCRS students please find information in our Moodle area] Research Interests: I am generally interested in dependable distributed systems.  In this sense, together with colleagues: 1. Currently (last five years), we are investigating scalable and dependable distributed systems. While this is a wide topic, we are focused on scaling the performance of the State Machine Replication approach. Most of the publications below are related to this research track 2. I have also investigated and proposed techniques and approaches to construct correct distributed systems. Here an (1 pg.) abridged description of our approaches and results. Prospective Students: If you plan a MSc or PhD in Distributed Systems and would like to know more about how to do it at PUCRS, do not hesitate in contacting me. I am an advisor at the Graduate Program in Computer Science - PUCRS. If you are an undergraduate (bachelor) student, see below some possible areas for a course completion project  (TC). Prospective Collaborations: If you (academia or industry) would like to collaborate in topics such as: distributed systems,  high-throughput dependable distributed systems, consensus, strong consistency software architectures, and other related - or if you think there could be common interests - please contact me. If you are from the industry, our science and technology park TecnoPUC, several times awarded best in Brazil and Latin-America, can help us in several ways. Possible areas for your course completion projects, MSc or PhD projects: Examples of possible areas for under graduate (bachelor = uG) course completion projects, MSc. For PhD possibilities this list gives examples of  topics we work on, but please contact-me directly. In almost all items it is possible to define scope and complexity for all academic levels. Anyway, near each item there is a suggestion of academic level (uG, MSc) associated. ï¿½       Scheduling in State Machine Replication: ï¿½ Work-stealing techniques applied to parallel SMR scheduling       (uG, MSc) - see related Reconfiguring Parallel State Machine Replication ï¿½ Concurrent data structures for dependency tracking                   (uG, MSc)  - see related Efficient and Deterministic Scheduling for Parallel State Machine Replication ï¿½ Techniques for fast detection of causality (dependency) (uG, MSc)  - see related High performance recovery for parallel state machine replication ï¿½       Recovery in State Machine Replication: ï¿½ Causality based log reduction                                                   (uG, MSc)  - see related High performance recovery for parallel state machine replication ï¿½       New Protocols: ï¿½ Optimizing the spanning tree of Byzcast                                    (MSc) -  see related Byzantine Fault-Tolerant Atomic Multicast ï¿½ Exploring concurrency in consensus protocols                            (MSc) - see Egalitarian Paxos in the internet for an idea of related work ï¿½       Platforms: ï¿½ A Go library of distributed algorithms for dependable distributed computing    (uG) ï¿½ Distributed algorithms/protocols debugging support using causality                (uG) ï¿½       And Others:  these are some examples of possible joint work.  Of course, other related aspects are of interest!    Use the contact above! Selected recent publications: A Library for Services Transparent Replication Paola Pereira, Cristina Meinhardt, Fernando Dotti and Odorico Mendizabal. 14th DADS Track of the 34th ACM Symposium on Applied Computing, April 2019 Early Scheduling in Parallel State Machine Replication E. Alchieri, F. Dotti and F. Pedone 9th ACM Symposium on Cloud Computing 2018 (SoCC), October 2018 Boosting State Machine Replication with Concurrent Execution E. Alchieri, F. Dotti, P. J. Marandi, O. M. Mendizabal and F. Pedone 8th Latin American Symposium on Dependable Computing (LADC), September 2018 Byzantine Fault-Tolerant Atomic Multicast P. Coelho,T. Ceolin Jr., A. Bessani, F. Dotti and F. Pedone 48th IEEE/IFIP International Conference on Dependable Systems and Networks (DSN), June 2018 Reconfiguring Parallel State Machine Replication E. Alchieri, F. Dotti, O. M. Mendizabal and F. Pedone 36th Symposium on Reliable Distributed Systems (SRDS), September 2017 High performance recovery for parallel state machine replication O. Mendizabal, F. L. Dotti and F. Pedone 37th IEEE International Conference on Distributed Computing (ICDCS), June 2017 Efficient and Deterministic Scheduling for Parallel State Machine Replication O. M. Mendizabal, R. T. S. Moura, F. L. Dotti and F. Pedone 31st IEEE International Parallel & Distributed Processing Symposium (IPDPS), May 2017 Analysis of Checkpointing Overhead in Parallel State Machine Replication O. M. Mendizabal, F. L. Dotti and F. Pedone 31st ACM/SIGAPP Symposium on Applied Computing (ACM SAC/DADS), April 2016 Recovery in Parallel State-Machine Replication O. Mendizabal, P. J. Marandi, F. L. Dotti and F. Pedone 18th International Conference on Principles of Distributed Systems (OPODIS 2014) Model checking the deferred update replication protocol O. Mendizabal and F. L. Dotti SBRC ï¿½ Simpï¿½sio Brasileiro de Redes de Computadores, pp. 995ï¿½1008, (SBRC 2013). A formal model for the deferred update replication technique A. Corradini, L. Ribeiro, F. L. Dotti, and O. M. Mendizabal Trustworthy Global Computing - 8th International Symposium (TGC 2013 - Co-located with CONCUR 2013) Revised Selected Papers, pp. 235ï¿½253, 2013. A CTL Model Checker for Stochastic Automata Networks. OLEKSINSKI, L. G. ; CORREA, C. M. ; DOTTI, FERNANDO LUIS ; SALES, Afonso . In: Quantitative Evaluation of Systems (QEST), 2013, Buenos Aires. 10th International Conference, QEST 2013. Heidelberg: Springer - NCS, 2013. v. 8054. p. 286-289. Correct transformation: From object-based graph grammars to promela. L. Ribeiro, O. M. dos Santos, F. L. Dotti, and L. Foss Science of Computer Programming, vol. 77, no. 3, pp. 214ï¿½246, 2012. Publications since 2000, by areas:  Scalable Dependable Distributed Systems; Correct by Construction Distributed Systems; Computer Networks; Other.",
  "content_length": 7183,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:02"
}