{
  "name": "Fernanda L. Kastensmidt",
  "homepage": "http://www.inf.ufrgs.br/~fglima",
  "status": "success",
  "content": "Fernanda Lima Kastensmidt - Institute of Informatics About / Short Bio Fernanda Lima Kastensmidt holds a degree in Electrical Engineering from the Federal University of Rio Grande do Sul (1997), a Master's in Computer Science from the Federal University of Rio Grande do Sul (1999) and a PhD in Computer Science from the Federal University of Rio Grande do Sul (2003) . Fernanda is a Full Professor at the Federal University of Rio Grande do Sul and she was Coordinator of the Graduate Program in Microelectronics (PGMICRO) for 4 years and was head of the Department of Applied Informatics for 2 years. He has experience in the area of Microelectronics and Computer Engineering, with an emphasis on Hardware, he has worked mainly on the following topics: radiation fault protection techniques, fault-tolerant system design, programmable architecture, FPGA, qualification of systems and integrated circuits under faults and fault modeling. She is the author of the book Fault Tolerance Techniques for SRAM-based FPGAs published in 2006 by Springer and co-author of more than 3 scientific books. Participate in the payload project of the NanoSat-BR1 satellite that was launched in June 2014 and in the NanoSat-BR2 where part of the payload is responsible for analyzing the effects of SAA on Integrated Circuits manufactured in nanometric technology launched in 2021. E-mail fglima at inf.ufrgs.br Undergraduate course 01058 Circuitos Digitais Undergraduate course 01107 Introdução a Arquitetura de Computadores Undergraduate course 01175 Sistemas Digitais Graduate course MIC58 Teste e Confiabilidade de Sistemas de Hardware Projeto de Sistemas Tolerantes à FalhasProjeto de sistemas digitais multi processados e em APSoC tolerantes a falhas transientes (SEU e SET) usando técnicas de mitigação em software e em hardware. Qualificação de Sistemas sob radiaçãoMetodologia e teste de sistemas complexos sob radiação (neutron, ions pesados, e protons) e metodologia de injeção de falhas para caracterizar sistema sob falhas APSoC compostos por ChipletsProjeto de chiplets para IoT e IA",
  "content_length": 2080,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:59"
}