{
  "name": "Fernando Alva-Manchego",
  "homepage": "https://feralvam.github.io",
  "status": "success",
  "content": "Fernando Alva-ManchegoFernando Alva-ManchegoLecturerCardiff NLPSchool of Computer Science and InformaticsCardiff UniversityAbout MeI am a Lecturer (~Assistant Professor) at the School of Computer Science and Informatics at Cardiff University. My research focuses on technologies that apply Artificial Intelligence for education and information accessibility. In particular, my work employs Natural Language Processing approaches to facilitate reading and understanding. I am especially interested in studying the real capabilities of systems for several Natural Language Generation tasks, such as Text Simplification, Summarisation and Machine Translation. In order to do that, my collaborators and I create language resources, design evaluation methodologies or metrics, and implement models using machine learning techniques.Previously, I was a Research Associate at SheffieldNLP (2020-2021), working with Prof. Lucia Specia for the APE-QUEST and Bergamot projects on Quality Estimation for Machine Translation. Before that, I worked as Adjunct Professor at the Pontifical Catholic University of Peru (2013-2016), where I was a member of the Artificial Intelligence Group IA-PUCP. During my Masters, I was also a member of the Interinstitutional Center for Computational Linguistics at the University of São Paulo.InterestsText-to-Text Generation (e.g. Text Simplification, Summarisation, Machine Translation, etc.)Evaluation of Natural Language GenerationWriting AssistanceNatural Language Processing for EducationEducationPhD in Computer ScienceUniversity of SheffieldMSc in Computer ScienceUniversity of Sao PauloBSc in Informatics EngineeringPontifical Catholic University of PeruFeatured PublicationsText SimplificationFindings of the TSAR 2025 Shared Task on Readability-Controlled Text SimplificationTSAR 2025Nov 8, 2025Readability AssessmentUniversalCEFR: Enabling Open Multilingual Research on Language Proficiency AssessmentEMNLP 2025Nov 4, 2025Text SimplificationAdapting Sentence-level Automatic Metrics for Document-level Simplification EvaluationNAACL 2025Apr 29, 2025Text SimplificationAnalysing Zero-Shot Readability-Controlled Sentence SimplificationCOLING 2025Jan 19, 2025Text SimplificationThe BEA 2024 Shared Task on the Multilingual Lexical Simplification PipelineBEA 2024Jun 20, 2024Text SimplificationBLESS: Benchmarking Large Language Models on Sentence SimplificationEMNLP 2023Dec 6, 2023See allRecent & Upcoming TalksAutomatic Evaluation of Sentence SimplificationMar 16, 2022I present the first meta-evaluation of automatic metrics for Automatic Sentence Simplification focused on simplicity.Read moreMar 16, 2022Automatic Evaluation of Simplified TextsFeb 22, 2022I provide an overview of how automatically-simplified texts are currently evaluated, highlighting issues with resources and metrics for automatic evaluation, and proposing solutions based on recent work.Read moreFeb 22, 2022Challenges in Evaluation of Automatic Text SimplificationSep 24, 2021I discuss how evaluating automatic simplifications is difficult, since we do not have metrics that measure simplicity with high confidence, nor human judgements majorly agree in what simple is.Read moreSep 24, 2021Multi-Operation Automatic Text SimplificationJul 5, 2021I present work that attempts to incorporate the multi-operation nature of Text Simplication into automatic models and evaluation resources.Read moreJul 5, 2021The (Un)Suitability of Automatic Metrics for Sentence SimplificationMar 11, 2021I present the results of the first meta-evaluation of automatic metrics for Sentence Simplification, focused on simplicity judgements.Read moreMar 11, 2021See all",
  "content_length": 3658,
  "method": "requests",
  "crawl_time": "2025-12-01 13:09:58"
}