{
  "name": "Fernando M. Gonçalves",
  "homepage": "http://cemapre.iseg.ulisboa.pt/~fgoncalves",
  "status": "success",
  "content": "Fernando Goncalves Fernando F. Gonçalves Associate Professor Universidade Europeia, FCST Postal address: Quinta do Bom Nome, Estrada da Correia 53, 1500-210 Lisboa, Portugal Email: Phone: +351 210 309 900 Education Postdoctoral Studies, CEMAPRE - Centre for Applied Mathematics and Economics, ISEG, Universidade de Lisboa, Portugal (2009-2012; visiting M.R. Grossinho), and Mathematical Sciences Institute, Australian National University, Australia (2008-2009; visiting R. Maller and D. Heath). Ph.D. in Mathematics and Statistics, University of Edinburgh, School of Mathematics, UK (2007; Thesis advisor: I. Gyöngy). Postgraduate Diploma in Business Studies, ISCTE - University Institute of Lisbon, Portugal (1992). Licentiate Degree in Economics, ISEG, Universidade de Lisboa , Portugal (1989). Bacharelato in Economics, ISEG, Universidade de Lisboa, Portugal (1981). Research centre affiliation REM - Research in Economics and Mathematics, CEMAPRE - Centre for Applied Mathematics and Economics, ISEG, University of Lisbon. Research interests Financial mathematics. Applied econometrics. (Secondary). Publications Open banking in retail banking companies: Evolution or revolution? Case study NB Network+. In G. Pellat, T. Rkibi: Quand la crise est porteuse d'innovations. Comment les territoires, les citoyens et les entreprises s'approprient l'Europe, Paris, L'Harmattan (2024), 38-53. (With R. Murta). Open banking: Strategic vision for the Portuguese market. Proceedings of TAKE 2022, Portugal (2022). (With R. Murta and P. Mello). Segmentação das rotas turísticas em Portugal Continental - Uma análise de clusters. Revista Turismo & Desenvolvimento, 39 (2022), 139-154. (With C.V. Mota). doi: 10.34624/rtd.v39i0.30432 Open banking in retail banking companies: Evolution or revolution? Case Study NB Network+. Proceedings of the ERECO-PGV Conference 27, Portugal (2021). (With R. Murta). Desenvolvimento sustentável nos territórios do interior de Portugal Continental: Contributo das rotas turísticas. Proceedings da INVTUR 2021 Conference, Portugal (2021). (With C.V. Mota). Avaliação das rotas turísticas em Portugal Continental: Uma análise de clusters. Proceedings of the ITC'19 - XI International Tourism Congress (2020). (With C.V. Mota). A note on the spatial approximation of PDEs with unbounded coefficients - The special one-dimensional case. Int. J. Appl. Math., 33(1) (2020), 137-156. (With M.R. Grossinho and E. Morais). doi: 10.12732/ijam.v33i1.11 How to clutch skills from higher education curricula: Analysis of Portuguese learning outcomes. INTED2019 Proceedings (2019), 8955-8964. (With A. Fidalgo, F. Ramos, and D. Dias). doi: 10.21125/inted.2019.2227 Restyling the higher education landscape: Regional (a)symmetries across Portugal. INTED2019 Proceedings (2019), 8965-8974. (With D. Dias, F. Ramos, and A. Fidalgo). doi: 10.21125/inted.2019.2227 Evaluation of the cultural and heritage tourism routes - Case study: mainland Portugal. Proceedings of the ICOT2018 - International Conference on Tourism - Emerging Tourism Destinations: Working towards Balanced Tourism Development, Greece (2018). (With C.V. Mota). Evaluation of tourism routes - Case study: mainland Portugal. Proceedings of the EATSA - Euro-Asia Tourism Studies Conference 2018 - Challenges of Tourism Development in Asia & Europe, France (2018). (With C.V. Mota). Why tourists spend extravagantly in Portugal: A binary logistic regression by quartiles. Tourism Planning & Development, 15(4) (2018), 458-472. (With A. Correia and M. Kozac). Evaluation of tourism route governance - case study: mainland Portugal. Proceedings of the EATSA - Euro-Asia Tourism Studies Conference 2016 - A Pathway for the New Generation of Tourism Research, Portugal (2016). (With C.V. Mota). Spatial approximation of nondivergent type parabolic PDEs with unbounded coefficients related to finance. Abstr. Appl. Anal. - Special Issue: Functional Differential and Difference Equations with Applications 2013, 2014: Article ID 801059 (2014). (With M.R. Grossinho ). doi:10.1155/2014/801059 Discretisation of abstract linear evolution equations of parabolic type. Adv. Difference Equ., 2012:14 (2012). (With M.R. Grossinho and E. Morais). doi:10.1186/1687-1847-2012-14 On the space discretization of PDEs with unbounded coefficients arising in Financial Mathematics - the case of one spatial dimension. C. R. Acad. Bulgare Sci., 63(1) (2010), 35-46. (With M.R. Grossinho and E. Morais). Space discretization of Cauchy problems for multidimensional PDEs with unbounded coefficients arising in Financial Mathematics. C. R. Acad. Bulgare Sci., 62(7) (2009), 791-798. (With M.R. Grossinho). A note on the numerical approximation of parabolic equations in Hölder spaces. Int. J. Appl. Math., 22(2) (2009), 227-243. (With M.R. Grossinho). Numerical approximation of multidimensional parabolic partial differential equations arising in Financial Mathematics. Math. Balkanica, 23(1-2) (2009), 111-132. (With M.R. Grossinho). Numerical approximation of partial differential equations arising in financial option pricing. Ph.D. Thesis. University of Edinburgh, UK (2007). Input-Output Matrix to the Region of the Algarve 1994 (in Portuguese). CIDER / CCDR Algarve  (2001). (With M.B. Alves, J.A. Silva, E. Rebelo, R. Nunes, P. Batista, P. Carrasco, and P. Garcês). Seminar presentations New Options on Option Pricing: An Update on Deep Learning Trends (with M. Prata and J. Guerra), Talk by M. Prata, Navigating the Future of Management - 2nd International Scientific Conference, Universidade Europeia, Lisbon, Portugal (Jul. 18-19, 2024). Open Banking: Strategic Vision for the Portuguese Market (with R. Murta and P. Mello), Talk by R. Murta, TAKE 2022 - Theory and Applications in the Knowledge Economy, Universidade Portucalense, Porto, Portugal (Jul. 6-8, 2022). Open Banking in Retail Banking Companies: Evolution or Revolution? Case Study NB Network+ (with R. Murta), Talk by R. Murta, Learning From the Covid-19 Pandemic, What Future Lies Ahead for Countries, Citizens and Businesses in Europe, ERECO-PGV Conference 27, Porto, Portugal (Oct. 21-23, 2021). Desenvolvimento sustentável nos territórios do interior de Portugal Continental: Contributo das rotas turísticas (with C.V. Mota), Talk by C.V. Mota, INVTUR 2021 Conference, Universidade de Aveiro, Portugal (May 6-7, 2021). Avaliação das Rotas Turísticas em Portugal Continental: Uma Análise de Clusters (with C.V. Mota), Talk by C.V. Mota, ITC'19 - XI International Tourism Congress, Funchal, Portugal (Nov. 5-7, 2019). Avaliação das Rotas Turísticas, Culturais e de Património - Estudo de Caso: Portugal Continental (with C.V. Mota), Talk by C.V. Mota, Congresso Ciência, Cultura e Turismo Sustentável, Academia das Ciências, Portugal (Nov. 26-27, 2018). Evaluation of the Cultural and Heritage Tourism Routes - ase Study: Mainland Portugal (with C.V. Mota), Talk by C.V. Mota, Emerging Tourism Destinations: Working towards Balanced Tourism Development, ICOT2018 - International Conference on Tourism, Kavala, Grece (Jun. 27-30, 2018). Evaluation of Tourism Routes - Case Study: Mainland Portugal (with C.V. Mota), Talk by C.V. Mota, EATSA - Euro-Asia Tourism Studies Conference, Dijon & Château-Chinon, Francel (Jun. 18-22, 2018). Evaluation of Tourism Routes in Mainland Portugal (with C.V. Mota), Talk by C.V. Mota, Are you lost in your PhD, PhD Workshop Programme, Invtur 2017 Conference, Universidade de Aveiro, Portugal (May 16, 2017). Evaluation of Tourism Route Governance - Case Study: Mainland Portugal (with C.V. Mota), Talk by C.V. Mota, EATSA - Euro-Asia Tourism Studies Conference, Universidade de Lisboa, Portugal (Jun. 27, 2016). Tourists' Spending Behavior in Portugal: A Logistic Regression by Quartiles (with A. Correia and M. Kozak), Talk by A. Correia, 51st TRC - Tourism Research Center Meeting, Helsinki, Finland (Mar. 2016). Approximation of a Black-Scholes Type Equation in Unbounded Domains (with M.R. Grossinho), Talk by M.R. Grossinho, Session Novel Methods in Computational Finance II, Mathematical Modelling in Engineering & Human Behaviour 2013, Instituto Universitario de Matemàtica Multidisciplinar, Universitat Politècnica de València, València, Spain (Sep. 5, 2013). Approximation of Nondivergent Type Parabolic PDEs in Finance (with M.R. Grossinho), Plenary Talk by M.R. Grossinho, International Conference Advanced Finance and Stochastics, Steklov Mathematical Institute, Moscow, Russia (Jun. 25, 2013). Approximation of Parabolic PDEs with Unbounded Coeffi cients Arising in Finance (with M.R. Grossinho), Invited Seminar, Lisbon Financial Mathematics 2013, 2nd ed., Spring Meeting - Analytical and Numerical Methods in Finance, CEMAPRE - Centre for Applied Mathematics and Economics, ISEG, Universidade de Lisboa, Portugal (May 24, 2013). On the Localization of PDE Problems Arising in Finance (with M.R. Grossinho and D. Heath), Seminar, CEMAPRE - Centre for Applied Mathematics and Economics, ISEG, Universidade de Lisboa, Portugal (Mar. 12, 2010). Quantitative Methods in Sociology University Education, Sociology Seminar Series, Faculty of Economics, University of Algarve, Faro, Portugal (May 2006). Student supervision Manuel Jaime Prata, Doctorate Programme in Management, Universidade Europeia, Lisbon, Portugal (2023-present). Rui Murta, Cross-buying: Uma estratégia da Banca tradicional para os desafios do Open Banking em Portugal, Doctorate Programme in Management, Universidade Europeia, Lisbon, Portugal (2024). Diogo Ribeiro Santos, To borrow or not to borrow: A Neoclassical model to explain how scarcity causes debt, Doctorate Programme in Management, Universidade Europeia, Lisbon, Portugal (2023). José Peres de Almeida, O recrutamento militar - Atração e atratividade das Forças Armadas Portuguesas, Doctorate Programme in Management, Universidade Europeia, Lisbon, Portugal (2022). Cátia Godinho, A aprendizagem em simulacros e a aquisição de competências na gestão de catástrofes, Doctorate Programme in Management",
  "content_length": 10872,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:07"
}