{
  "name": "Fernando Esteban Barril Otero",
  "homepage": "https://www.cs.kent.ac.uk/people/staff/febo",
  "status": "success",
  "content": "Fernando Otero - School of Computing - University of Kent Jump to content design1 Fernando Otero Reader Email f.e.b.otero@kent.ac.uk Telephone +44 (0)1227 827943 More information ORCID iD: 0000-0003-2172-297X Location Room 119 Kennedy Building University of Kent Canterbury Kent CT2 7FS On this page About Research interests Teaching Professional About Fernando has extensive research experience in machine learning and data mining, including the evaluation and interpretation of classification models. His research interests involve the design of new machine learning algorithms that create interpretable models and data pre-processing methods for feature selection and construction. His  recent work has focused on machine learning techniques that incorporate domain knowledge to extract knowledge that is both accurate and useful for the user. He also has expertise in optimising the creation of machine learning models using computational intelligence techniques.Fernando received his PhD in 2010 from the University of Kent, working on ant colony optimisation (ACO) algorithms for data mining, in particular the creation of ACO algorithms for the bioinformatics problem of predicting protein functions. He was a Post-Doctoral Research Associate working on the EPSRC-funded project \"Refactoring and Neutrality in Genetic Programming\" (EP/H020217/1) at the University of Kent (2010-2012) and obtained his BSc in Computer Science from Pontificia Universidade Catolica do Parana (Brazil) in 2002. Research interests Fernando belongs to the following research groups:Artificial Intelligence and Data Science GroupFernando's main research interests include:Data Mining and Knowledge Discovery, in particular classification and regression – focusing on the creation of interpretable models – and more recently clusteringBio-inspired algorithms, mainly ant colony optimization and genetic programmingApplication of data mining algorithms in bioinformatics (e.g., protein function prediction) and financial forecastingLarge-scale data mining (\"Big Data\")Fernando is always happy to discuss research ideas with potential research students and postdocs. In terms of funding, the School of Computing runs an annual PhD scholarship competition. The University has also put together a useful list of funding opportunities for postdoctoral research. Teaching Current ModulesI teach on (or am otherwise involved with) the following modules:CO551 - Data Structures and AlgorithmsCO553 - Agile Development and Software SecurityCO554 - Computing Theory and Concurrent ProgrammingCO600 - ProjectCO649 - Data MiningCO650 - IT Consultancy ProjectCO655 - Software ProjectCO656 - Computational Intelligence in Business, Economics and FinanceCO880 - Project and DissertationPast ModulesCO334 - People and ComputingCO546 - Information Systems AnalysisCO816 - eHealth Professional Fellow of the Higher Education Academy Last updated 20 March 2025",
  "content_length": 2924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:02"
}