{
  "name": "Ferrante Neri",
  "homepage": "https://www.surrey.ac.uk/people/ferrante-neri",
  "status": "success",
  "content": "Prof Ferrante Neri | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Google Scholar ORCID LinkedIn Professor Ferrante Neri Professor of Machine Learning and Artificial Intelligence, Associate Dean (international) FEPS Docent, PhD, MEng +44 (0)1483 682646 f.neri@surrey.ac.uk website16 BB 02Appointments can be arranged via emailAcademic and research departments Nature Inspired Computing and Engineering Research Group, Surrey Institute for People-Centred Artificial Intelligence (PAI), Computer Science Research Centre, School of Computer Science and Electronic Engineering, Faculty of Engineering and Physical Sciences. AboutBiographyI am an all-round academic equally passionate about teaching and research. My teaching expertise is about Mathematical subjects for Computer Science while my research expertise lies at the intersection of Optimisation, Explainable AI, and Machine Learning. I am also happy to serve the community I work for, by undertaking managerial duties.Before joining the faculty at Surrey I was at the University of Nottingham and previously I was at De Montfort University and at the University of Jyväskylä (Finland). I am a scholar in Optimisation and Computational Modelling. I work at the boundary between mathematical theory and practical engineering solutions. I’m the author of Linear Algebra for Computational Sciences and Engineering. I am also a very active editor for multiple journals including Information Sciences, Memetic Computing, and Integrated Computer-Aided Engineering. Expand biography My qualifications 25 August 2010 Docent in Mathematical Information Technology (Computational Intelligence) University of Jyväskylä, Finland 30 November 2007 PhD in Mathematical Information Technology (Scientific Computing and Optimisation) University of Jyväskylä, Finland 24 April 2007 PhD in Electrotechnical Engineering Polytechnic University of Bari, Italy 07 November 2002 Laurea Degree in Electrical Engineering Polytechnic University of Bari, ItalyPrevious roles 01 April 2019 - 31 March 2022 Associate Professor (School of Computer Science) University of Nottingham 24 May 2013 - 31 March 2019 Professor of Computational intelligence Optimisation De Montfort University 15 March 2012 - 23 May 2013 Reader in Computational Intelligence De Montfort University 01 September 2009 - 31 August 2014 Academy Research Fellow (hosted at the Department of Mathematical Information Technology, University of Jyväskylä, Finland) Academy of Finland 15 November 2007 - 31 August 2012 Senior Assistant in Simulation and Optimisation (on study leave from 01/09/2009 until the end of the contract) Department of Mathematical Information Technology, University of Jyväskylä, Finland Expand previous roles Affiliations and memberships IEEE Senior Member Senior Fellow Higher Education Academy News 24 OCT 2023Surrey, Warwick and Creative Arts universities secure £1.5m to support regional game-changing innovation activities 01 AUG 2023Expert comment: BBC trialling the ‘experimental’ Mastodon server 07 JUN 2023Expert comment - Response to MOVEit cyber gang ultimatum ResearchResearch interestsMy research expertise is in optimisation and machine learning. I am currently interested in algorithmic design for black-box optimisation problems informed by fitness landscape analysis. This topic lies at the intersection of optimisation, both exact and heuristic, and machine learning. I am also interested in applications of data science.Historically, my main topic has been (and still is) the design and understanding of meta-heuristic algorithms. The main two subareas I contributed to are Memetic Computing and Differential Evolution.  Since 2010 I am Chair/Vice-Chair of the IEEE Task Force on Memetic Computing. Expand research interests Indicators of esteemIn the list of the top 2% scientists according to Stanford World Ranking of ScientistsSupervisionPostgraduate research supervisionCurrent PhD students and starting month Aisha E S E Saeid Aug 2022Pengjin Wu Sep 2023If you are looking for a PhD in a topic related to Artificial Intelligence, send me an email to have an informal chat about it. Please include in your emailyour CVa short description of the topic (maximum 2 pages) you would like to investigatea statement about how you are planning to fund your PhD studies, e.g., you are self-funded, have a scholarship, or are seeking for financial supportBe aware that PhD scholarships are available only at some points of the year through competitive processes (usually deadlines in January to start in October). Expand Postgraduate research supervisionGraduated PhD studentsHoang Lam Le, University of Nottingham. Thesis: “Novel Strategies to Accelerate Search Algorithms in Data Reduction\", 2022Shouyong Jiang, De Montfort University, \"Dynamic Multi-Objective Optimisation\", 2017 Michael Cochez, University of Jyväskylä, “Taming Big Knowledge Evolution”, 2016Fabio Caraffini, De Montfort University, “Novel Memetic Structures for Continuous Optimisation”, 2014Ilpo Poikolainen, University of Jyväskylä, “Simple Memetic Computing Structures for Global Optimization”, 2014Annemari Soranto, University of Jyväskylä, “Interest-based topology management in unstructured peer-to-peer networks”, 2012Ernesto Mininno, University of Jyväskylä, “Advanced Optimization Algorithms for Applications in Control Engineering”, 2011Giovanni Iacca, University of Jyväskylä, “Memory-saving Optimization Algorithms for Systems with Limited Hardware”, 2011Matthieu Weber,  University of Jyväskylä, “Parallel Global Optimization, Structuring Populations in Differential Evolution”, 2010Ville Tirronen with University of Jyväskylä, “Global Optimization using Memetic Differential Evolution with Applications to Low-Level Machine Vision”, 2008 Expand TeachingHappiness is to be understood – Georgi Polonsky – (We’ll Live Till Monday) Current TeachingComputational Intelligence (Lectures, Week 1-11, Semester 1)Foundations of Computing II (Linear Algebra Section, Week 1-6 Semester 2) Past Teaching Undergraduate Modules 2020-2022 Mathematics for Computer Scientists 2, University of Nottingham, UK2019-2022 Languages and Computation, University of Nottingham, UK2018-2019 Abstract Algebra I and II, De Montfort University, UK2015-2018 Linear Algebra and Discrete Mathematics, De Montfort University, UK2014-2018 Foundations and Algebra, De Montfort University, UK2012-2013 Introduction to Artificial Intelligence and Mobile Robotics, De Montfort University, UK2012-2013 Connected Devices, De Montfort University, UKPostgraduate Modules 2013-2015 Computational Intelligence Optimisation, De Montfort University, UK2007-2012 Research Projects, University of Jyväskylä,  Finland2007 Evolutionary Computational Intelligence, University of  Jyväskylä, FinlandInternational Research/Postgraduate Modules2020 Automatic Design of Optimisation Algorithms in the Continuous Domain, NATCOR Course Heuristics & Approximation Algorithms, Nottingham, UK2008 Medicine+Computer Science=Computational Medicine; Computational Intelligence for Multi-drug Therapies, Winter School on Mathematical and Computational Biology, University of Newcastle, Australia2007 Recent Advances in Evolutionary Computing, 17th Jyväskylä Summer School, University of  Jyväskylä, Finland Expand my teaching Sustainable development goalsMy research interests are related to the following: PublicationsYu Xue, Xiaolei Zhang, Ferrante Neri, Bing Xue, Mengjie Zhang (2025)Graph Neural Network-Based Surrogate Model for Evolutionary Neural Architecture Search, In: IEEE transactions on systems, man, and cybernetics. Systemspp. 1-14 IEEEDOI: 10.1109/TSMC.2025.3621488Evolutionary neural architecture search (ENAS) is an approach to automating network architecture design. A primary challenge of ENAS is the demand for expensive computational resources, and many ENAS methods use surrogate models to reduce costs. However, existing architecture representation methods are not rich enough in capturing the information of architectures, making them inadequate for building effective surrogate models. Furthermore, existing research studies often rely on a single model or strategy to predict architecture performance, which is not always accurate or reliable. To alleviate these issues, this article proposes a dual-stage surrogate model based on graph neural networks (GNNs) for ENAS, namely dual-stage surrogate model for evolutionary neural architecture search (DSGENAS). First, to effectively represent the neural architectures for the surrogate model, we employ a GNN-based architecture embedding method to extract architecture features. Second, based on the architecture representation, a dual-stage surrogate mo",
  "content_length": 317824,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:12"
}