{
  "name": "Fethi A. Rabhi",
  "homepage": "https://research.unsw.edu.au/people/professor-fethi-rabhi",
  "status": "success",
  "content": "Professor Fethi Rabhi | UNSW Research Skip to main content Researcher My Expertise Building Software Systems and Software Engineering. AI Systems Design. Business, Finance and Economics Applications (E-Business, Financial Trading, Electronic Markets and Banking). Analytics in Business and Social Sciences. Software Design Methods, APIs and the Service Economy. Semantic Technologies. Keywords lean software development agile software engineering FinTech financial markets semantic data linked data artificial intelligence Fields of Research (FoR) Software engineering, Software architecture, Service oriented computing, Business analytics, Business information systems, Information systems development methodologies and practice, Banking, finance and investment, Cloud computing, Machine learning, Data engineering and data science, Information modelling, management and ontologies, Automated software engineering, Requirements engineering, Health informatics and information systems, Computer Software, Software Engineering, Web Technologies (excl. Web Search), Banking, Finance and Investment, Business Information Systems (incl. Data Processin SEO tags Information Processing Services (incl. Data Entry and Capture) Electronic Information Storage and Retrieval Services Biography Professor, School of Computer Science and Engineering. My main role is in conducting research projects as well as teaching subjects in Computer Science, Software Engineering and  Information Systems. Besides my academic role, I am actively engaged in facilitating University-industry collaborations particularly in the context of financial applications. My existing projects are in the areas of financial markets, wealth management and regulatory...view more Professor, School of Computer Science and Engineering. My main role is in conducting research projects as well as teaching subjects in Computer Science, Software Engineering and  Information Systems. Besides my academic role, I am actively engaged in facilitating University-industry collaborations particularly in the context of financial applications. My existing projects are in the areas of financial markets, wealth management and regulatory reporting. My Grants I have obtained in total almost $4M in grants as a first investigator since joining UNSW in 2000 in four important blocks of funding: Fintech AI (2015-present): investigating novel AI applications with a number of partners in the financial industry as well as Data61. Industry partners include Westpac, AWS, Ignition Advice, BrewAI, Capsifi and Cognitivo. Smart Services CRC (2010-2014): applying service technologies in the areas of media, finance and health in partnership with Suncorp, SAP and Sirca. Ad-hoc DAta Grid Environments (2007-2010): prompted by a large DEST Innovation Science Linkage (ISL) grant to investigate the use of service technologies for analyzing ad-hoc data grids (news and financial information). Capital Markets Cooperative Research Centre (2001-2007): I was the Interoperability Sub-Program Manager with SIRCA, SMARTS and Computershare as industry partners. My Qualifications PhD in Computer Science, University of Sheffield, UK (1990). My Research Activities My research interests are in Software Engineering, Design Methods, Service-Oriented Computing, High Performance Computing, Web Technologies and Applications in Business, Finance and Economics (E-Business, Financial Trading, Electronic Markets and Banking). I am currently focusing on investigating innovative software engineering approaches for the development of AI applications in the business domain. In November 2022, I co-founded the Fintech AI Innovation Consortium (FAIC), a new initiative that builds on UNSW's strength in digital innovation technologies and AI applications and is driven by both the Engineering and Business faculties. My Research SupervisionSupervision keywords software design big data analytics machine learning artificial intelligence Areas of supervision Software Engineering for AI Systems. Multidisciplinary research projects with industry. Currently supervising Several PhD students in in Software Engineering and large-scale analysis of business information systems data (jointly with UNSW Business. Details of projects in www.faic.unsw.edu.au My Engagement I have engaged in different activities with various organisations in the following areas: Software Enginering for Analytics and AI Systems: the provision of efficient software services for Big Data Analysis has enormous socio-economic benefits for many companies in different sectors Analytics for Business and Social Sciences: addressing the fact that big data analysis in Business and Social Sciences is mainly driven by non-IT specialists analysing vast amounts of ad-hoc data from different sources such as Web logs, network traffic messages, health sensors and financial reports means that work in areas as diverse as IoT, Health, Economics and Social science is important FinTech: initiating projects in areas that would be considered too high risk for any start-e.g. developing innovative products that are not necessarily for-profit, creating open data repositories, financial planning tools, personalized banking hubs, dealing with educational issues, developing products for financial literacy and encouraging financial inclusion in a way that would benefit the entire society and encouraging openness, transparency and compliance with rules and regulation. My Teaching I am recognized as one of the few people with a broad knowledge of software engineering, encompassing not only the technical aspects but also the management aspects (30 years of teaching experience equally distributed between Engineering and Business faculties). I have also experience in developing software both as part of research and consulting activities. I am a champion of multidisciplinary activity-based learning through workshops and software based activities performed both in-person and on-line Many software products developed as a result of research projects have been used to support teaching activities at different levels (workshops, specialised courses for PhD students and Honours projects). I have been a pioneer in developing new teaching material at the junction between the area of IT and Finance. View less Location Engineering School of Computer Science and Engineering Room 406, K17 Building UNSW Kensington Campus Map reference (Google map) Contact +61 2 9065 9463 +61 2 9385 5995 Follow My LinkedIn Publications by Professor Fethi Rabhi Books 6 Book Chapters 21 Journal articles 65 Conference Papers 115 Conference Proceedings (Editor of) 3 Conference Presentations 1 Conference Abstracts 1 Working Papers 1 Preprints 12 View all » ORCID as entered in ROS https://orcid.org/0000-0001-8934-6259 Related Links Fintech AI Innovation Consortium <p>Describes multidisciplary projects at UNSW at the junction between Finance and IT</p> UNSW Sydney NSW 2052 Australia Telephone +61 2 93851000 Authorised by Deputy Vice-Chancellor (Research) UNSW CRICOS Provider Code: 00098G ABN: 57 195 873 179 Join the conversation Facebook Twitter UNSW Youtube LinkedIn Pinterest Instagram Member Group of Eight Member Universitas 21 Member Global Alliance of Technological Universities Member Association of Pacific Rim Universities MemberPLuS Alliance Home 2025 Strategic Initiatives SHARP UNSW Futures Interdisciplinary Research World Class Research Infrastructure Grand Challenges Thought Leadership & Public Engagement Knowledge Exchange ARTU - Aggregate Ranking of Top Universities Contact Us Deputy Vice-Chancellor (Research & Enterprise) Pro Vice-Chancellor (Research) Graduate Research Scholarships Applying for a Scholarship External Scholarships How to apply Higher Degree Research Programs Submitting an Application Finding a Supervisor Fees and Costs FAQs Thesis Thesis Preparation Examination Graduation Help and Advice Arc UNSW – Postgraduate Council Arc UNSW – Student Life Financial Support New to UNSW Research Events & Workshops Study with Us Research Training Extend Your Career Networks New to UNSW Research Research Career Opportunities Research Impact UNSW Areas of Research Strength Biomedical Sciences Contemporary Humanities and Creative Arts Defence and Security Fundamental and Enabling Sciences ICT, Robotics and Devices Law, Business and Economics Next Generation Materials and Technologies Social Policy, Government and Health Policy Water, Climate, Environment and Sustainability Fellows of Learned Academies Research News & Stories Research Integrity Research Ethics & Compliance Support Research Integrity for Staff Supervisors and Research Integrity Research Ethics and Compliance Support Animal Research Ethics Human Research Ethics Radiation Safety Research Export Controls Research Strategy Office About the RSO Partner with us Contact Us Partner With Us Services for Researchers Research Grants and Contracts (RGC) About Us Current Funding Opportunities Resources and Quicklinks Systems Research Infrastructure Analytical Centre (MWAC) Contacts & About Us Data Management, Storage and Tools Network Labs Shared Research Equipment UNSW Research Infrastructure Scheme Partner With Us Pricing Tool Researcher Hub (UNSW login) Current Funding Opportunities Research News UNSW Centres and Institutes Find a Researcher FAQ: Researcher Profiles - Tags & Codes",
  "content_length": 9371,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:08"
}