{
  "name": "Fidel Cacheda Seijo",
  "homepage": "https://pdi.udc.es/es/File/Pdi/H399E",
  "status": "success",
  "content": "Ficha de Fidel Cacheda Seijo Departamento Ciencias de la Computación y Tecnologías de la Información Área Ingeniería telemática Investigación Grupo de investigación Telemática Líneas de investigación Recuperación de Información Recomendación Ciberseguridad Palabras clave Recuperación de Información, Recomendación, Ciberseguridad Evaluación de méritos docentes 5 quinquenio(s) Evaluación de méritos de investigación 5 sexenio(s) Contacto Directorio de la UDC Orcid id0000-0002-6438-1661 ResearcherIDL-8913-2014 Scopus6507096348 Docencia impartida En este apartado se muestra la docencia impartida en grados, másteres y resto de estudios oficiales en los últimos 6 años. 2025/2026 2024/2025 2023/2024 2022/2023 2020/2021 2019/2020 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Redes Grado en Ingeniería Informática Obligatorio 0 150 Trabajo Fin de Grado Grado en Ciencia e Ingeniería de Datos Obligatorio 0 2 Trabajo Fin de Grado. Mención en Computación Grado en Ingeniería Informática Obligatorio 0 4 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 4 Trabajo Fin de Grado. Mención en Sistemas de Información Grado en Ingeniería Informática Obligatorio 0 0,5 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Redes Grado en Ingeniería Informática Obligatorio 0 120 Trabajo Fin de Grado. Mención en Sistemas de Información Grado en Ingeniería Informática Obligatorio 0 0,5 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 5,5 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Redes Grado en Ingeniería Informática Obligatorio 0 120 Trabajo Fin de Grado. Mención en Computación Grado en Ingeniería Informática Obligatorio 0 2 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 3,5 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Internet: Redes y Datos Grado en Ciencia e Ingeniería de Datos Formación básica 0 30 Redes Grado en Ingeniería Informática Obligatorio 0 90 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 8 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Internet: Redes y Datos Grado en Ciencia e Ingeniería de Datos Formación básica 0 30 Redes Grado en Ingeniería Informática Obligatorio 0 56 Trabajo Fin de Máster Máster Universitario en Ingeniería Informática Obligatorio 0 5 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Internet: Redes y Datos Grado en Ciencia e Ingeniería de Datos Formación básica 0 30 Recuperación de la Información y Web Semántica Máster Universitario en Ingeniería Informática Obligatorio 0 1 Redes Grado en Ingeniería Informática Obligatorio 0 30 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 4 Tutorías 2025/2026 Tutorías definidas por el/la docente para el curso académico 2025/2026. Facultad de Informática Cuatrimestre Día Lugar Primer cuatrimestre lunes 10:00 a 13:00 Teams Primer cuatrimestre miércoles 10:00 a 13:00 Teams Segundo cuatrimestre lunes 09:30 a 10:30 Teams Segundo cuatrimestre martes 09:30 a 10:30 Teams Segundo cuatrimestre miércoles 09:30 a 13:30 Teams Segunda oportunidad lunes 10:00 a 13:00 Teams Segunda oportunidad jueves 10:00 a 13:00 Teams Trabajos de fin de grado y máster Dirigidos o codirigidos por el/la docente desde el año 2013. 2023/2024 2022/2023 2020/2021 2018/2019 2016/2017 2015/2016 2013/2014 Detección de conductas negativas en chats de videojuegos competitivos Metabuscador de documentos científicos Técnicas de inteligencia artificial aplicadas a la detección de ciber acoso en las redes sociales Diseño e implementación de una arquitectura de engines y microservizos para la plataforma de internet de las Cosas del Grupo Euskaltel Evolución de la arquitectura backend de la plataforma de Intenet de las Cosas del Grupo Eukastel Aplicación para la gestión del tiempo en proyectos de una empresa tecnológica Plataforma distribuida para el almacenamiento y protección de ficheros Diseño e implementación de un sistema para la recomendación de revistas científicas Puede consultar los méritos de investigación seleccionando un tipo de mérito y el año. Proyectos, contratos y convenios de I+D+I Patentes, registros y modelos de utilidad Artículos en revistas de investigación Libros completos Capítulos de libros Tésis doctorales dirigidas Comunicaciones en congresos 2024 2020 2017 2016 2015 ... 2014 2013 2010 2008 2007 2006 2005 2001 Entidad financiadora INCIBE - Instituto Nacional de Ciberseguridade Investigadores principales Francisco Javier Nóvoa de Manuel / Daniel Garabato Míguez Tipo Proyecto Programas Nacionales Fechas Desde 01/01/2024 a 31/12/2025 Entidad financiadora AEI, Agencia Estatal de Investigación Investigadores principales Cacheda Seijo, Fidel (IP1) / Carneiro Díaz, Víctor Manuel (IP2) Tipo Proyecto Programas Nacionales Fechas Desde 01/09/2024 a 31/08/2027 Entidad financiadora Consellería de Educación, Ciencia, Universidades e Formación Profesional Investigadores principales Fidel Cacheda Seijo Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2024 a 20/11/2026 Entidad financiadora Ministerio de Ciencia e Innovación Investigadores principales V. Carneiro, F. Cacheda Tipo Proyecto Programas Nacionales Fechas Desde 01/06/2020 a 31/05/2023 Entidad financiadora Ministerio de Ciencia e Innovación Investigadores principales V. Carneiro, F. Cacheda Tipo Proyecto Programas Nacionales Fechas Desde 01/06/2020 a 31/05/2023 Entidad financiadora INDITEX, S.A. Tipo Contrato Fechas Desde 01/03/2017 a 30/04/2017 Entidad financiadora Ministerio de Economía y Competitividad (MINECO) Investigadores principales Victor Carneiro Diaz y Fidel Cacheda Seijo Tipo Proyecto Programas Nacionales Fechas Desde 01/01/2016 a 30/09/2019 Entidad financiadora Axencia Galega de Innovación Investigadores principales Daniel Pena Tipo Proyecto Programas Autonomicos Fechas Desde 01/09/2015 a 31/12/2018 Entidad financiadora Consellería de Cultura, Educación e Ordenación Universitaria Investigadores principales Manuel Vilares Ferro Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2014 a 31/12/2015 Entidad financiadora Consellería de Cultura, Educación e Ordenación Universitaria Investigadores principales Víctor Carneiro Díaz Tipo Proyecto Otros Programas Fechas Desde 01/01/2014 a 31/12/2016 Entidad financiadora Centro para el Desarrollo Tecnológico e Industrial (CDTI) Investigadores principales Fidel Cacheda Seijo Tipo Proyecto Programas Nacionales Fechas Desde 05/04/2013 a 31/12/2014 Entidad financiadora Ministerio de Economía y Competitividad Investigadores principales Victor Manuel Carneiro Diaz Tipo Proyecto Programas Nacionales Fechas Desde 01/01/2010 a 31/12/2013 Entidad financiadora ENTIDADE PÚBLICA EMPRESARIAL RED.ES E A UDC Tipo Contrato Fechas Desde 08/07/2008 a 08/07/2009 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Victor Manuel Carneiro Díaz Tipo Contrato Fechas Desde 05/10/2007 a 05/10/2008 Entidad financiadora DENODO TECHNOLOGIES S.L. Investigadores principales Victor Manuel Carneiro Díaz Tipo Contrato Fechas Desde 27/10/2006 a 27/10/2007 Entidad financiadora Ministerio de Ciencia y Tecnología Investigadores principales Ángel Viña Castiñeriras Tipo Proyecto Programas Nacionales Fechas Desde 31/12/2005 a 31/12/2008 Entidad financiadora Ministerio de Ciencia y Tecnología Investigadores principales Victor Manuel Carneiro Díaz Tipo Proyecto Programas Nacionales Fechas Desde 28/12/2001 a 28/12/2004 2013 2012 Tipo Patente Entidad Universidade da Coruña (UDC) Autores Víctor Manuel Prieto Álvarez, Manuel Álvarez Diaz, Fidel Cacheda Seijo, Víctor Carneiro Fecha de solicitud 23/11/2013 Tipo Patente Entidad Universidade da Coruña (UDC) Autores Fidel Cacheda Seijo, Víctor Carneiro, Vreixo Formoso López, Diego Fernández Iglesias, Ana María Freire Veiga Fecha de solicitud 30/05/2012 Fecha de concesión 16/02/2017 2024 2023 2022 2021 2020 ... 2019 2018 2017 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 1999 Autores M. F. López-Vizcaíno, Francisco J. Nóvoa, Diego Fernández Iglesias, Fidel Cacheda Revista Applied Sciences DOI https://doi.org/10.3390/app14020574 Autores Clara Corbelle, Víctor Carneiro, Fidel Cacheda Revista Applied Sciences DOI https://doi.org/10.3390/app14135388 Autores Fidel Cacheda, M. F. López-Vizcaíno, Diego Fernández Iglesias, Víctor Carneiro Revista International Journal of Information and Education Technology DOI https://doi.org/10.18178/ijiet.2024.14.10.2163 Autores M. F. López-Vizcaíno, Francisco J. Nóvoa, T. Artieres, Fidel Cacheda Seijo Revista Sensors Vol. 23 DOI https://doi.org/10.3390/s23104788 Autores M. F. López-Vizcaíno, Francisco J. Nóvoa, Diego Fernández Iglesias, Fidel Cacheda Revista IEEE Access Vol. 10 (págs. 127695 a 127707) DOI https://doi.org/10.1109/access.2022.3224467 Autores M. F. López-Vizcaíno, Francisco J. Nóvoa, Víctor Carneiro, Fidel Cacheda Seijo Revista FUTURE GENERATION COMPUTER SYSTEMS Vol. 118 (págs. 219 a 229) DOI https://doi.org/10.1016/j.future.2021.01.006 Autores Laura Vigoya, Diego Fernández Iglesias, Víctor Carneiro, Fidel Cacheda Revista Sensors Vol. 20 Núm. 3745 (págs. 1 a 23) Autores Diego Fernández Iglesias, Vreixo Formoso López, Fidel Cacheda, Víctor Carneiro Revista INTERNATIONAL JOURNAL OF UNCERTAINTY FUZZINESS AND KNOWLEDGE-BASED SYSTEMS Vol. 28 Núm. 6 (págs. 981 a 1002) Autores Fidel Cacheda, Diego Fernández Iglesias, Francisco J. Nóvoa, Víctor Carneiro Revista Journal of Medical Intern",
  "content_length": 32721,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:13"
}