{
  "name": "Filbert Minj",
  "homepage": "https://www.serc.iisc.ac.in/faculty",
  "status": "success",
  "content": "FACULTY – SUPERCOMPUTER EDUCATION AND RESEARCH CENTRE Skip to content HOME SERC About SERC CONTACT US SYSTEMS SUPERCOMPUTER For Traditional HPC Simulations: Param Pravega For Deep learning and AI based: NVIDIA DGX-1 Cluster For Deep Learning and AI based: NVIDIA DGX-H100 CLUSTER MID and LOW RANGE CLUSTERS Roddam Narasimha Cluster Delta Cluster Visualization Servers SERC FILE SERVERS SERC Storage Overview SOFTWARE SERVICES SUPERCOMPUTING EDUCATION AND OUTREACH CONSULTING FOR IISc USERS Usage Charges License Watch Documents GANGLIA Cluster Monitor FOR NON-IISc USERS MISCELLANIOUS Usage of SERC Rooms Visitor Guidelines and Schedule for Your SERC Tour User Forms SERC Open Day PEOPLE FACULTY TECHNICAL STAFF SYSTEM ENGINEERS OFFICE STAFF SERC WELLNESS CORNER NEWS & PUBLICATIONS OPPORTUNITIES Sathish S. Vadhiyar Professor and Chair Work Phone: +91-080-2293 2981 +91-080-23600086 Email: vss@iisc.ac.in website Balakrishnan N INSA Senior Scientist Email: balki@iisc.ac.in website N. Balakrishnan Associate Faculty Work Phone: +91-080-22933029 Email: nbalak@iisc.ac.in website Govindarajan R Associate Faculty Email: govind@iisc.ac.in website Lakshmi J Chief Research Scientist Email: jlakshmi@iisc.ac.in website Filbert Minj Principal Research Scientist Work Phone: +91-080-2360 0653/54/59, 418(Extn.) Email: filbert@iisc.ac.in Yoginder Kumar Negi Senior Scientific Officer Phone: +91-080-2360 0653/54/59, 409(Extn.) Email: yoginder@iisc.ac.in website For queries related to use of SERC services, Users in IISc Network (Preferable) Use  HelpDesk : This will help in tracking the queries of Supercomputer, accessing FAQs and many other features. (Less preferable): Email helpdesk.serc@auto.iisc.ac.in with a suitable subject line. Users external to IISc Network Procedure to login For Support / Query’s email to:   helpdesk.serc@auto.iisc.ac.in with a suitable subject line. Quick LinksNSM Param Pravega NSM R&D Projects Users Forms SERC HPC Usage Portal SERC HELPDESK Usage Charges Usage of SERC Rooms Recent Event New Wellness Corner Committee Members",
  "content_length": 2055,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:12"
}