{
  "name": "Filippo Stanco",
  "homepage": "https://www.dmi.unict.it/fstanco/personal-site/index.php",
  "status": "success",
  "content": "Filippo Stanco - DMI UniCT Filippo Stanco - Ph.D. Professore ordinario di INF/01 Presidente del Corso di Laurea in Informatica (I livello) Delegato del Rettore per le innovazioni tecnologiche per l'informazione e la comunicazione. Contatti E-mail filippo.stanco@unict.it Telefono +39 095 738 3051 Fax +39 095 33 00 94 Indirizzo Dipartimento di Matematica e Informatica Viale A. Doria, 6 - 95125 Catania Stanza 369 Personal site http://web.dmi.unict.it/docenti/filippo.stanco Archeomatica https://archeomatica.unict.it/ IPLab https://iplab.dmi.unict.it/ Ricerca Google Scholar Research Gate ORCID Scopus Skills Didattica Ricerca Beni Culturali Immagini Digitali Giochi Digitali Danger Informazioni personali Experience Professore Ordinario Università degli Studi di Catania Settore scientifico-disciplinare INF/01 – Informatica, Dipartimento di Matematica ed Informatica. 2023 - Oggi Experience Presidente CdL Informatica Università degli Studi di Catania Presidente del Corso di Laurea triennale in Informatica per il quadriennio 2021/25. 2021 - Oggi Experience Delegato del Rettore Università degli Studi di Catania Delegato del Rettore per \"Innovazioni tecnologiche per l’informazione e la comunicazione\". 2019 - Oggi Experience Professore Associato Università degli Studi di Catania Settore scientifico-disciplinare INF/01 – Informatica, Dipartimento di Matematica ed Informatica. 2014 - 2023 Experience Ricercatore Università degli Studi di Catania Settore scientifico-disciplinare INF/01 – Informatica, Dipartimento di Matematica ed Informatica. 2006 - 2014 Experience Assegnista di Ricerca Università degli Studi di Catania Settore scientifico-disciplinare INF/01 - Informatica, sul tema “Elaborazione delle Immagini e grafica computerizzata”. 2005 - 2006 Experience Assegnista di Ricerca Università di Trieste Settore scientifico-disciplinare ING-INF/01 - Elettronica, sul tema “Sviluppo di un sistema di restauro per stampe fotografiche d’epoca (SIRAD)”. 2003 - 2005 Education Dottorato di Ricerca in Informatica, XV ciclo Università degli Studi di Catania Tesi: \"Image Enhancement Techniques: Zooming and Super Resolution\". Tutor: Prof. Giovanni Gallo. 2003 Education Laurea in Scienze dell’Informazione, votazione di 110/110 e Lode Università degli Studi di Catania Tesi: \"Apprendimento automatico di pattern grafici\". Relatore: Prof. Giovanni Gallo. Correlatore: Dott. Sebastiano Battiato 1999 Short bio Didattica Pubblicazioni Progetti Libri Short bio Filippo Stanco, nato nel 1975, è oggi Professore Ordinario di Informatica presso il Dipartimento di Matematica e Informatica dell’Università di Catania. Dal 2017 ad oggi (secondo mandato) è Presidente del corso di laurea triennale in Informatica. È delegato del Rettore per le “Innovazioni tecnologiche per l’informazione e la comunicazione” (dal 2019). I suoi interessi di ricerca includono l'analisi e il trattamento di dati multimediali con riferimento a specifici settori applicativi e di natura interdisciplinare (Image Processing, Applicazioni Mediche, Serious Game). Dal 2007 è responsabile del gruppo di ricerca Archeomatica, centro di competenza volto allo sviluppo di soluzioni innovative e applicazioni in ambito Cultural Heritage realizzate anche nell’ambito di progetti di ricerca nazionale o internazionali, in collaborazione con enti, istituzioni pubbliche e private. Didattica Multimedia e Laboratorio: modulo multimedia (6 CFU), A.A. 2016-2017, 2017-18, 2018-19, 2019-20, 2020-21, 2021-22 corso di Laurea Magistrale in Informatica, Università di Catania;; Multimedia e Laboratorio: modulo laboratorio (3 CFU), A.A. 2022-23 corso di Laurea Magistrale in Informatica, Università di Catania;; Sviluppo di Giochi Digitali – Digital Game development (6 CFU), A.A. 2015-2016, 2016-2017, 2017-18, 2018-19, 2019-20, 2020-21, 2021-22, 2022-23 corso di Laurea in Informatica, Università di Catania;; Interazione e Multimedia (9 CFU), A.A. 2009-2010, 2010-2011, 2011-2012, 2012-2013, 2013-2014, 2014-2015, 2015-2016, 2016-2017, 2017-18 corso di Laurea in Informatica, Università di Catania;; Interazione e Multimedia e Laboratorio: modulo di Interazione e Multimedia e modulo di laboratorio (6+3 CFU), canale M-Z, A.A. 2018-19 corso di Laurea in Informatica, Università di Catania;; Interazione e Multimedia e Laboratorio: modulo di Interazione e Multimedia (6 CFU), canale A-L, A.A. 2018-19, 2019-20, 2020-21, 2021-22, 2022-23 corso di Laurea in Informatica, Università di Catania;; Multimedia (9 CFU), A.A. 2013-2014, 2014-2105 corso di Laurea Magistrale in Informatica, Università di Catania; C.I. di Fisica, informatica e statistica medica: Modulo di Informatica (3 CFU), A.A. 2011-2012, 2012-2013 Corso di laurea magistrale in Medicina e Chirurgia, polo B, Facoltà di Medicina e Chirurgia, Università di Catania; C.I. di Fisica, statistica e informatica: Modulo di Informatica (2 CFU), A.A. 2011-2012, 2012- 2013 Corso di laurea magistrale in Infermeristica, polo A, Facoltà di Medicina e Chirurgia, Università di Catania; Interazione e Multimedia (6 CFU), A.A. 2007-2008, 2008-2009 corso di Laurea in Informatica, Università di Catania; Interazione e Multimedialità (6 CFU), A.A. 2005-2006, 2006-2007, corso di Laurea in Informatica Applicata, centro IPPARI, Università di Catania, sede di Comiso; Introduzione ai Sistemi Informativi Territoriali - GIS (3 CFU), A.A. 2006-2007, corso di Laurea in Informatica, Università di Catania; Informatica (8 CFU), A.A. 2009-2010, corso di Laurea in Tecnologie Applicate alla Conservazione ed al Restauro dei Beni Culturali, Università di Catania, sede Catania; Laboratorio di Informatica I (3 CFU), A.A. 2006-2007, 2007-2008, 2008-2009, 2010-2011, corso di Laurea in Tecnologie Applicate alla Conservazione ed al Restauro dei Beni Culturali, Università di Catania, sede Siracusa; Laboratorio di Informatica II (4 CFU), A.A. 2006-2007, 2007-2008, 2008-2009, corso di Laurea in Tecnologie Avanzate Applicate alla Conservazione ed al Restauro dei Beni Culturali, Università di Catania, sede Siracusa; Video e Foto Editing (9 CFU), A.A. 2008-2009, 2009-2010, 2016-2017 Accademia di Belle Arti di Catania; Video e Foto Editing (6 CFU), A.A. 2005-2006, 2006-2007, 2007-2008, 2011-2012, 2012-2013, 2013-2014, 2014-2015, 2015-2016 Accademia di Belle Arti di Catania; Pubblicazioni La lista delle pubblicazioni viene acquisita in maniera automatica attraverso il servizio Elsevier Scopus API. Nel caso siano presenti degli errori è possibile segnalarli a filippo.stanco@unict.it 97 Articoli 1211 Citazioni (in 944 documenti) 145 Coautori 17 H-Index Conference Paper Feature Relevance in Classification of 3D Stone from Ancient Wall Structures, Gallo G., Atani Y.G., Leotta R., Stanco F., Buscemi F., Figuera M., Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 2024, vol. 14366, pp. 375-386. Cited by: 0 Mostra abstract The increasing availability of quantitative data in archaeological studies has prompted the research of Machine Learning methods to support archaeologists in their analysis. This paper considers in particular the problem of automatic classification of 3D surface patches of “rubble stones” and “wedges” obtained from Prehistorical and Protohistorical walls in Crete. These data come from the W.A.L.(L) Project aimed to query 3D photogrammetric models of ancient architectonical structures in order to extract archaeologically significant features. The principal aim of this paper is to address the issue of a clear semantically correspondence between data analysis concepts and archaeology. Classification of stone patches has been performed with several Machine Learning methods, and then feature relevance has been computed for all the classifiers. The results show a good correspondence between the most relevant features of the classification and the qualitative features that human experts adopt typically to classify the wall facing stones. Conference Paper 3D Modeling and Augmented Reality in Education: An Effective Application for the Museo dei Saperi e delle Mirabilia of the University of Catania, Barone G., Garozzo R., Russo G., Santagati C., Sinitò D., Spironello M.Y., Stanco F., Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 2024, vol. 14366, pp. 449-461. Cited by: 0 Mostra abstract Augmented reality is the process of using technology to superimpose video, images, text or sound onto what a person can already see with their own eyes in the reality around them. It is enough to have a smartphone or tablet to change the reality in front of you. In fact, by means of an app, the user can display on his or her device content related to what is in front of him or her, accessing an ‘altered’ version of reality. Augmented Reality content can add value to any museum or art gallery and offer interactive solutions to entertain people and create rewarding engagement opportunities. This technology, applied to the field of Cultural Heritage and museum enjoyment, brings a significant enhancement to experiential feedback, attracting an ever-widening audience. In 2021, the National Gallery in London sought to take the collections of the National Gallery, the National Portrait Gallery and the Royal Academy of Arts beyond the museum walls with an Augmented Reality experience that the public could access via smartphones. Users used an app to activate artworks marked with QR codes and the initiative was very successful. The Museo dei Saperi e delle Mirabilia Siciliane at the University of Catania has set itself the goal of using this technology to display ‘digital versions’ of selected artefacts, bringing them to life in contexts outside the museum space. There are already many institutions using Augmented Reality and many more are being added all the time. Review Industry 4.0: Machinery integration with supply chain and logistics in compliance with Italian regulations, Sin",
  "content_length": 132536,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:26"
}