{
  "name": "Filippo Radicchi",
  "homepage": "http://homes.sice.indiana.edu/filiradi",
  "status": "success",
  "content": "Filippo Radicchi Filippo Radicchi Professor Center for Complex Networks and Systems Research Luddy School of Informatics, Computing, and Engineering Indiana University Bloomington Luddy Center for Artificial Intelligence, Room 3030 1015 East 11th St., Bloomington, IN 47408 Phone: (812) 855-9322 Email: f.radicchi@gmail.com Twitter: @filrad Curriculum Vitae: cv.pdf Updates Our paper Modeling resource consumption in the US air transportation system via minimum-cost percolation has been published in Nature Communications Our paper Deep-learning-aided dismantling of interdependent networks has been published in Nature Machine Intelligence Our paper Efficient inference of rankings from multi-body comparisons has been published in Physical Review E Our paper Topology shapes dynamics of higher-order networks has been published in Nature Physics Our paper Parallel algorithms for median consensus clustering in complex networks has been published in Scientific Reports Our paper Network community detection via neural embeddings has beeen published in Nature Communications I became an Associate Editor at Physical Review E Short bio I am a Professor in the Luddy School of Informatics, Computing, and Engineering at Indiana University, where I serve as the director of the Center for Complex Networks and Systems Research. Also, I am an Associate Editor for Physical Review E. I was a \"Ramón y Cajal\" senior researcher at university Rovira i Virgili, a postdoctoral researcher in the Amaral Lab at Northwestern University, and a research specialist at ISI Foundation. I have a PhD in Physics from Jacobs University, and a MS in Physics from University of Rome Tor Vergata. My main area of research is network science. See my publications or my Google Scholar profile for more info. Selected publications Modeling resource consumption in the US air transportation system via minimum-cost percolation, M. Kim, C.T. Diggans, F. Radicchi, Nat. Commun. 16, 8105 (2025) [pdf] Shortest-path percolation on random networks, M. Kim and F. Radicchi, Phys. Rev. Lett. 133, 047402 (2024) [pdf] Principled approach to the selection of the embedding dimension of networks, W. Gu, A. Tandon, Y.Y. Ahn and F. Radicchi, Nat. Commun. 12, 3772 (2021) [pdf] Characterizing the analogy between hyperbolic embedding and community structure of complex networks, A. Faqeeh, S. Osat and F. Radicchi, Phys. Rev. Lett. 121, 098301 (2018) [pdf] Optimal percolation on multiplex networks, S. Osat, A. Faqeeh and F. Radicchi, Nat. Commun. 8, 1540 (2017) [pdf] Percolation in real interdependent networks, F. Radicchi, Nat. Phys. 11, 597-602 (2015) [pdf] Abrupt transition in the structural formation of interconnected networks, F. Radicchi and A. Arenas, Nat. Phys. 9, 717-720 (2013) [pdf] Who is the best player ever? A complex network analysis of the history of professional tennis, F. Radicchi, PloS ONE 6, e17249 (2011) [pdf] Universality of citation distributions: towards an objective measure of scientific impact, F. Radicchi, S. Fortunato and C. Castellano, Proc. Natl. Acad. Sci. USA 105, 17268-17272 (2008) [pdf] Benchmark graphs for testing community detection algorithms, A. Lancichinetti, S. Fortunato and F. Radicchi, Phys. Rev. E 78, 046110 (2008) [pdf] Defining and identifying communities in networks, F. Radicchi, C. Castellano, F. Cecconi, V. Loreto and D. Parisi, Proc. Natl. Acad. Sci. USA 101, 2658-2663 (2004) [pdf]",
  "content_length": 3413,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:16"
}