{
  "name": "Filip Murlak",
  "homepage": "http://www.mimuw.edu.pl/~fmurlak",
  "status": "success",
  "content": "Filip MURLAK Filip MURLAK I work at the Faculty of Mathematics, Informatics and Mechanics, University of Warsaw. I am a member of the automata group at the Institute of Informatics. I did my PhD in automata theory under the supervision of Damian Niwiñski. Later I was post-doc in the Database Group at the University of Edinburgh. My current research is in database theory and knowledge representation. You can have a look at my CV here. Contact data Uniwersytet Warszawski, Instytut Informatyki ul. Banacha 2, 02-097 Warszawa, Polska Office: 4580 tel +48 22 55 44 458 fax +48 22 55 44 400 fmurlak at mimuw dot edu dot pl Publications Stackless Processing of Streamed Trees, with \tCorentin Barloy and Charles Paperman, PODS 2021 PG-Keys: Keys for Property Graphs, with Renzo Angles, Angela Bonifati, Stefania Dumbrava, George Fletcher, Keith W. Hare, Jan Hidders, Victor E. Lee, Bei Li, Leonid Libkin, Wim Martens, Josh Perryman, Ognjen Savkoviæ, Michael Schmidt, Juan Sequeda, S³awek Staworko, and Dominik Tomaszuk, SIGMOD 2021 On Finite Entailment of Non-Local Queries in Description Logics, with \tTomasz Gogacz, Victor Gutierrez-Basulto, Albert Gutowski, and Yazmin Ibanez-Garcia, KR 2020: 424-433 Ontology Focusing: Knowledge-Enriched Databases on Demand, with \tTomasz Gogacz, Victor Gutierrez-Basulto, Yazmin Ibanez-Garcia, Magdalena Ortiz, and Mantas Simkus, ECAI 2020: 745-752 On Finite and Unrestricted Query Entailment beyond SQ with Number Restrictions on Transitive Roles, with \tTomasz Gogacz, Victor Gutierrez-Basulto, Yazmin Ibanez-Garcia, and Jean Christoph Jung, IJCAI 2019: 1719-1725 On the semantics of Cypher's implicit group-by, with Jan Posiada³a and Pawe³ Susicki, DBPL 2019: 59-69 Finite Query Answering in Expressive Description Logics with Transitive Roles, with Tomasz Gogacz and Yazmin Ibanez-Garcia, KR 2018: 369-378 Reasoning about integrity constraints for tree-structured data, with Wojciech Czerwiñski, Claire David, and Pawe³ Parys, Theory Comput. Syst. 62(4): 941-976 (2018). Full version of the ICDT 2016 paper. Three easy pieces on schema mappings for tree-structured data, with Claire David, AMW 2017 Schema validation via streaming circuits, with Charles Paperman and Micha³ Pilipczuk, PODS 2016 Vertically acyclic conjunctive queries over trees, with Grzegorz Zieliñski, AMW 2016 Reasoning about integrity constraints for tree-structured data, with Wojciech Czerwiñski, Claire David, and Pawe³ Parys, ICDT 2016 Monadic datalog and regular tree pattern queries, with Filip Mazowiecki and Adam Witkowski, ACM Trans. Database Syst. 41(3): 20:1-20:43 (2016). Full version of the MFCS 2014 paper. Index problems for game automata, with Alessandro Facchini and Micha³ Skrzypczak, ACM Trans. Comput. Log. 17(4): 24:1-24:38 (2016). Combined full version of the WoLLIC 2015 paper and the LICS 2013 paper. Research Directions for Principles of Data Management (Abridged), with Serge Abiteboul, Marcelo Arenas, Pablo Barceló, Meghyn Bienvenu, Diego Calvanese, Claire David, Richard Hull, Eyke Hüllermeier, Benny Kimelfeld, Leonid Libkin, Wim Martens, Tova Milo, Frank Neven, Magdalena Ortiz, Thomas Schwentick, Julia Stoyanovich, Jianwen Su, Dan Suciu, Victor Vianu, Ke Yi, SIGMOD Record 45(4): 5-17 (2016) On the weak index problem for game automata, with Alessandro Facchini and Micha³ Skrzypczak, WoLLIC 2015 Consistency of injective tree patterns, with Claire David and Nadime Francis, FSTTCS 2014 XML schema mappings: data exchange and metadata management, with Shunichi Amano, Claire David and Leonid Libkin, J. ACM 61(2):12 (2014) Monadic datalog and regular tree pattern queries, with Filip Mazowiecki and Adam Witkowski, MFCS 2014 Foundations of Data Exchange, with Marcelo Arenas, Pablo Barceló, and Leonid Libkin, Cambridge University Press 2014 Transformation Synthesis from XML Schema Mappings, with Claire David, Piotr Hofman, and Micha³ Pilipczuk, ICDT 2014 Solutions in XML data exchange, with Miko³aj Bojañczyk and Leszek A. Ko³odziejczyk, J. Comput. Syst. Sci. 79(6):785-815 (2013). Full version of the ICDT 2011 paper. Rabin-Mostowski index problem: a step beyond deterministic automata, with Alessandro Facchini and Micha³ Skrzypczak, LICS 2013 Between tree patterns and conjunctive queries: is there tractability beyond acyclicity?, with Micha³ Ogiñski and Marcin Przyby³ko, MFCS 2012 Definable operations on weakly recognizable sets of trees, with Jacques Duparc, Alessandro Facchini, FSTTCS 2011 Solutions in XML data exchange, with Miko³aj Bojañczyk and Leszek A. Ko³odziejczyk, ICDT 2011 Relational and XML Data Exchange, with Marcelo Arenas, Pablo Barceló, and Leonid Libkin, Morgan & Claypool Publishers 2010 Certain answers for XML queries, with Claire David and Leonid Libkin, PODS 2010 On the Tradeoff between Mapping and Querying Power in XML Data Exchange, with Shunichi Amano, Claire David and Leonid Libkin, ICDT 2010 The Wadge Hierarchy of Max-Regular Languages, with Jeremie Cabessa, Jacques Duparc, Alessandro Facchini, FSTTCS 2009 Linear Game Automata: Decidable Hierarchy Problems for Stripped-Down Alternating Tree Automata, with Jacques Duparc and Alessandro Facchini, CSL 2009 XML Schema Mappings, with Shunichi Amano and Leonid Libkin, PODS 2009 The Wadge Hierarchy of Deterministic Tree Languages, Logical Methods in Computer Science 4(4): 1-44 (2008) Effective topological hierarchies of recognizable tree languages, PhD thesis, University of Warsaw, 2008 Weak index vs. Borel rank, STACS 2008 On the topological complexity of tree languages, with Andre Arnold, Jacques Duparc, and Damian Niwiñski, in: Logic and Automata: History and Perspectives, Amsterdam University Press 2007 On the topological complexity of weakly recognizable tree languages, with Jacques Duparc, FCT 2007 The Wadge Hierarchy of Deterministic Tree Languages (extended abstract), ICALP 2006 On deciding topological classes of deterministic tree languages, CSL 2005 Talks Queries with External Predicates (ICDT 2025) Teaching (PL) Konsultacje: poniedzia³ki 16:00 - 17:0 i ¶rody 16:00 - 17:00, pokój 4580 Bazy danych Z³o¿ono¶æ obliczeniowa 2014/2015 Horyzonty 2015 XML, czyli drzewa z danymi 2012/2013 Magisterka z XMLa 2011/2012 Logika dla informatyków - Æwiczenia z gwiazdk± 2012/2013 Teoria baz danych 2011/2012 Automaty na nieskoñczonych obiektach 2010/2011 JAO 2009/2010 Z³o¿ono¶æ Ko³mogorowa i z³o¿ono¶æ komunikacyjna 2006/2007 Programowanie w logice 2006/2007 Algorytmiczne aspekty teorii gier 2005/2006 Filip Murlak 21-10-2019",
  "content_length": 6477,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:12"
}