{
  "name": "Fillia Makedon",
  "homepage": "http://heracleia.uta.edu/~makedon",
  "status": "success",
  "content": "Fillia Makedon Fillia Makedon Jenkins-Garrett Professor Department of Computer Science and Engineering University of Texas at Arlighton Office Location: ERB 624/ ERB 302 Lab Location: ERB 313 Office hours: Tuesdays and Thursdays 3:30PM - 5:00PM and by appointment Home Publications Teaching Heracleia Lab iPerform Center PETRA 2019 Dr. Fillia Makedon is the Jenkins-Garrett Professor at the University of Texas at Arlington (UTA). She received her Ph.D. in Computer Science from Northwestern University in 1982. Between 1991-2006, she was Professor of computer science at Dartmouth College where she founded and directed the Dartmouth Experimental Visualization Laboratory (DEVLAB). Between 2006 and 2014 she served as the department chair of the CSE Department at UTA. Prior to that , in 2005-2006, she was Program Director at the National Science Foundation. Prior to Dartmouth, Prof. Makedon was Assistant and Associate Professor at the Univ. of Texas at Dallas (UTD), where she founded and directed the Computer LEArning Research Center (CLEAR). She supervised over 27 Ph.D. theses and numerous Masters Degree theses. Makedon has received many NSF research awards in the areas of trust management, brain computing, data mining, parallel computing, visualization, knowledge management, cyberphysical systems, major research instrumentation, and cyberhuman systems, to name a few. She has been senior investigator and co-PI of NIH, DOJ and Foundation grants. She received the Dartmouth Senior Research Professor Award, three Fulbright awards, and is author of over 350 peer-reviewed research publications. She is faculty affiliate of the Dartmouth ISTS security institute and currently directs the HERACLEIA Human Centered Laboratory, that develops pervasive technologies for human monitoring. She is member of several journal editorial boards and chair of the international PETRA conference (petrae.org). She currently supervises 12 Ph.D. students, several undergraduates and MS students. Current Principal Fields of Study Human Computer Interaction (HCI) Human Robot Interaction (HRI) Pervasive Computing Machine Learning Computational Multimedia Cognitive Computing Earlier Areas of Research Interest Design Automation Graph Theory Applications VLSI Algorithms Circuit Testing Parallel Computation and Packet Routing Algorithm Visualization and Computational Multimedia Cybersecurity systems for medical applications Current Course CSE 5369/6369 This course will introduce you to HCI research by combining theory with practice. You will be exposed to seminal work in HCI systems, prototyping techniques & enabling technologies and cover topics such as, ubiquitous computing, social computing, design tools and methods, input technologies, crowdsourcing, visualization, animation, game design and how to program & evaluate user centric interfaces. Postdoc Maria Kyrarini PhD Students Maher Abujelala Michail Theofanidis Sanika Gupta Varun Kanal Akilesh Rajavenkatanarayanan Ashwin Ramesh Babu Mohammad Zaki Zadeh Joe Cloud REU Students James Brady Luke Owens Graduated Students Michalis Papakostas Ph.D. (2019) Diane Calderon B.S (2019) Meaghan Harraghy B.S (2019) Konstantinos Tsiakas Ph.D. (2018) Chris Collander B.S (2018) Shawn Gieser Ph.D. (2017) Alexandros Lioulemes Ph.D. (2017) Dylan Ebert B.S (2017) Alexandros Papangelis Ph.D. (2013) Georgios Galatas Ph.D. (2013) Christopher McMurrough Ph.D. (2013) Shahina Ferdous Ph.D. (2012) Vangelis Metsis Ph.D. (2011) Eric Becker Ph.D. (2010) Contact Email: makedon@uta.edu Campus office: ERB 302 Mailing address: Department of Computer Science and Engineering University of Texas at Arlington",
  "content_length": 3647,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:17"
}