{
  "name": "Finlay Maguire",
  "homepage": "https://www.dal.ca/faculty/computerscience/faculty-staff/finlay-maguire.html",
  "status": "success",
  "content": "Dr. Finlay Maguire - Faculty of Computer Science - Dalhousie University Support Dal Current Students Faculty & Staff Family & Friends Campuses Agricultural Campus (Truro) Halifax Campuses Directory Campus Maps myDal Dal Online Brightspace OpenDal myDal Directory Maps OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal Dalhousie University Study Admissions Campus Life Libraries Research and Innovation Alumni About Dal Faculty of Computer Science For Current Students For Faculty & Staff Home About Current Students Undergraduate Graduate Research News & Events Dr. Finlay Maguire Assistant Professor Connect with me My website My research clusters: Algorithms and Bioinformatics and Big Data Analytics, AI & Machine Learning I have fellowship opportunities available Faculty of Computer Science , Faculty of Medicine Email: finlay.maguire@dal.ca Mailing Address: Location: Room 4239, Mona Campbell BuildingDalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada Research Topics: Genomic Epidemiology Health Data Science Bioinformatics Infectious Diseases Machine Learning Computational Social Science Medical Microbiology Jointly Appointed: Department of Community Health & Epidemiology Bio: My research aim is to develop and collaboratively apply data-driven methods to try and mitigate health and social crises. This is focused on two main areas: genomic epidemiology of infectious diseases and interdisciplinary health data science collaborations with experts in medicine and the social sciences.  My genomic epidemiology work involves creating novel microbial bioinformatics and machine learning approaches to better understand the diagnosis, evolution, and dynamics of infectious diseases.  This largely involves work with national and international public health consortia on problems related to antimicrobial resistance and, recently, the viral dynamics of the COVID-19 pandemic.  The broader health data science area of my work is more varied and tries to identify and solve the data-related problems of socially/health-focused academics, non-governmental organisations, and public health groups. This includes working with local shelters to identify gaps in provision, physicians to improve healthcare access among refugees, and sociologists exploring online radicalisation. I also actively support and contribute towards the MicroResearch initiative, a multinational community-based program focused on building research capacity in the Global South and under-served Canadian communities. Education: Donald Hill Family Fellowship Dalhousie University (2021) PhD: University College London / Natural History Museum (2016) MA: University of Oxford (2011) Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada inquiries@cs.dal.ca Contact the Faculty of Computer Science Campus Directory Campus Map Privacy Statement Terms of Use Media Centre Contact the Faculty of Computer Science Campus Directory Campus Map Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada 902-494-2093 inquiries@cs.dal.ca",
  "content_length": 3269,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:17"
}