{
  "name": "Firas AlBalas",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=faalbalas",
  "status": "success",
  "content": "Firas Ali Al Balas × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content firas ali al balas • Department of Computer Science - Faculty Member 23159 --- Department of Computer Science faalbalas@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from جامعة جلامورجان, 2009 Msc. of Computer Science from University of Jordan, 2000 Bsc. of Computer Science from Mutah University, 1991 Book jafar ababneh, Analyzing and Evaluating Current Computer Networks Simulation Models \", IGI Global Information Science Reference, 2012 Publications Firas A. Al Balas, Wail Mardini,Yaser Khamayseh, Dua’a Ah.K.Bani-Salameh, \"Improved Appliance Coordination Scheme with Waiting Time in Smart Grids,\" International Journal of Advanced Computer Science and Applications, vol. 7, no. 4, pp. 16-30, 2016 Wail Mardini*, Firas Albalas, Qusai Obeidat and Muneer Masadeh Bani Yassein, \"Improved home energy management techniques for smart grids ,\" Int. J. Information and Communication Technology, vol. , no. , pp. 0-0, 2016 Jafar Ababneh, Firas E.Albalas, Nidhal El-Omari, Abdel Rahman A.Alkarabsheh, Abd Alsalam Obiadat, and Mahmood Baklizi,, \"Performance Evaluation for Scalable Recursive Multicast Protocol using ns2 simulator,\" International Journal of Computer Science & Information Security, vol. 10, no. 5, pp. 17-20, 2012 Belal Mohammad Zaqaibeh, Firas Ali Albalas, Awajan W A, \"Designing a New Assertion Constraints Model for Mobile Databases,\" International Journal of Interactive Mobile Technology , vol. 6, no. 2, pp. 39-46, 2012 Albara W. Awajan, Omar S. Al-Dabbas, Firas A. Albalas and Radwan S. Abujassar, \"Dynamic Path-Switching: A Multiple Constrained QoS Routing Algorithm for Manets,\" World Applied Sciences Journal, vol. 25, no. 1, pp. 1-8, 2013 F. W. Albalas ,  B. A. Abu-Alhaija , A. Awajan , A. Awajan  and Khalid Al-Begain, \"Quality of Service for Multimedia and Real-Time Services.,\" International Journal of Information Technology and Web Engineering (IJITWE) , vol. 5, no. 4, pp. 1-22, 2010 Albara Awajan, Firas A. Albalas, Radwan S. Abujassar , \"Enhance Recovery Schema in Proactive Protocol Over MANET by Computing a Backup Path,\" Australian journal of basic and applied sciences, vol. 7, no. 6, pp. 596-607, 2013 Omar Almomani, Firas Al Balas, Jafar A. Alzubi, Mahmoud Al-shugran and Omar A. Alzubi, \"Dynamic and Reactive Multi-Objective Routing Decision in Position-based Routing Protocols ,\" International Journal of Computer Science and Network Security, , vol. 16, no. 6, pp. 62-74, 2016 Belal Mohammad Zaqaibeh, Mohammad m Al-Betar,Firas Ali Al-Balas, \"Is Computer Science an Academic Discipline?,\" International Symposium on Education, Psychology and Social Sciences, Sep 2013, pp. 0-0 \"MFI3D: masked face identification with 3D face reconstruction and deep learning\", Neural Computing and Applications Ahmad Gazi Suleiman Alzubi, Firas Ali Elyan Al Balas, Tawfik Al-Hadhrami, Amjad Muneir Hussein Albashayreh, Lojin Hazim Mahmoud Bani Younis 06/12/2024 \"Exploring low-level statistical features of n-grams in phishing URLs: a comparative analysis with high-level features\", Cluster Computing Yahya Mohammad Suleiman Tashtoush, Moayad Feras Ali Alajlouni, Firas Ali Elyan Al Balas, Omar Darwish 03/07/2024 \"Learning Discriminant Spatial Features With Deep Graph-Based Convolutions for Occluded Face Detection\", IEEE Access Firas Ali Elyan Al Balas, Ahmad Gazi Suleiman Alzubi, Alanoud Ali Ahmed Alguzo 26/03/2022 \"Masked Face Recognition Using Deep Learning: A Review\", Electronics Ahmad Gazi Suleiman Alzubi, Firas Ali Elyan Al Balas, Lojin Hazim Mahmoud Bani Younis, Amjad Muneir Hussein Albashayreh 28/10/2021 \"A comparative study on spiking neural network encoding schema: implemented with cloud computing\", Cluster Computing Firas Ali Elyan Al Balas 19/12/2018 \"Security-aware CoAP Application Layer Protocol for the Internet of Things using Elliptic-Curve Cryptography\", The International Arab Journal of Information Technology (IAJIT) Firas Ali Elyan Al Balas, Majd Radwan Mohammad Soud 18/04/2018 \"Leveraging Fog Computing and Software Defined Systems for Selective Forwarding Attacks Detection in Mobile Wireless Sensor Networks\", Transactions on Emerging Telecommunications Technologies Qussai Mahmoud Mohammad Yaseen, Firas Ali Elyan Al Balas, Yaser Ibrahim Issa Jararweh, Mahmoud Abdel-Karim Mahmoud Alshbool 09/05/2017 Deputy Head of the Center, Vice Director Office, Sep 2021 - Sep 2022 Acting Head of Department, Department of Computer Science, Sep 2020 - Sep 2021 Faculty Member, Department of Computer Science, Sep 2014 - Present Faculty member\t, Yarmouk University, Jordan, Sep 2013- Sep 2014 Chairman Computer Networks Department , Jadara University, Jordan, Sep 2010- Sep 2013 Faculty member\t, Applied Science University, Jordan, Sep 2009- Sep 2010 ADVANCED COMPUTER NETWORKS ADVANCED TOPICS IN PROGRAMMING BUSINESS DATA COMMUNICATION AND COMPUTER NETWORKS COMPUTER NETWORKS COMPUTER SKILLS (REMEDIAL COURSE) DATA STRUCTURES LAB EXPERT SYSTEMS FUNDAMENTALS OF PROGRAMMING LANGUAGES INTRODUCTION TO OBJECT- ORIENTED PROGRAMMING INTRODUCTION TO PROGRAMMING MOBILE APPLICATIONS DESIGN AND DEVELOPMENT OBJECT-ORIENTED PROGRAMMING LAB PRACTICAL TRAINING PROGRAMMING FOR ENGINEERS PROGRAMMING IN C++ SELECTED PROGRAMMING LANGUAGES (FOR NON COMPUTER SCIENCE INFORMATION STUDENTS) SEMINAR IN ADVANCED COMPUTER SCIENCE SYSTEM ANALYSIS AND DESIGN SYSTEMS ANALYSIS AND DESIGN VISUAL PROGRAMMING LANGUAGES WIRELESS NETWORKS Academics Academic Calendar Course Schedule Graduate Studies Resources IT Helpdesk Services Library Maharat Open Online Courses News Center Information Classification Policy Information Request Form Information & Feedback Alumni EU Projects Job Opportunities Complaints & Suggestions Newsletter Enter your email address to get the latest University news, special events and student activities delivered right to your inbox. Subscribe to JUST Newsletter ©2022, Information Technology and Communication Center. Jordan University of Science and Technology. All Rights Reserved. Contact JUST Jordan University of Science and Technology P.O.Box 3030, Irbid 22110, Jordan Tel: +962 2 7201000 Fax: +962 2 7095123 Email: public@just.edu.jo Close QS Ranking 2026 Close",
  "content_length": 6308,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:25"
}