{
  "name": "Flavio Toffalini",
  "homepage": "https://flaviotoffalini.info",
  "status": "success",
  "content": "Flavio Toffalini Reach me here: About Me Dr. Flavio Toffalini is a cybersecurity researcher and newly appointed assistant professor at Ruhr-Universität Bochum (RUB) starting September 2024. His research expertise lies in system security, with a focus on automatic software testing, threat mitigation, and trusted computing technologies. OPEN PHD POSITIONS Calling all software testing enthusiasts! 🚀 We're on the lookout for PhD students to join our research team at Ruhr-Universität Bochum (RUB). If you're into fuzzing and ready to push the limits of automatic software testing, let's talk! 💻 Interested? Contact me at flavio.toffalini@rub.de. LOOKING FOR A BACHELOR'S OR A MASTER'S THESIS PROJECT? My research interests stretch beyond automated testing and reach other system security areas. Explore potential topics. If you already have an idea, feel free to reach out! I am happy to listen to personal proposals. Dr. Toffalini earned his Ph.D. from the Singapore University of Technology and Design (SUTD) under the supervision of Professor Jianying Zhou. His doctoral thesis explored the intersection of trusted execution environments—particularly SGX and TrustZone—and software engineering, identifying new attack surfaces and proposing innovative defense mechanisms. Following his Ph.D., Dr. Toffalini joined the HexHive group as a Postdoctoral Researcher under the guidance of Professor Mathias Payer. During his stay at EPFL, he expanded his expertise in automatic software testing and threat mitigation. At RUB, Dr. Toffalini continues his pioneering research in system security. He is actively recruiting Ph.D. students to join his team and contribute to cutting-edge projects in automatic software testing, threat mitigation, and trusted computing. Current opportunities include research on browser and interpreter testing. For any inquiries, feel free to contact him at flavio.toffalini@rub.de.",
  "content_length": 1908,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:26"
}