{
  "name": "Flavio Vinicius Diniz de Figueiredo",
  "homepage": "http://homepages.dcc.ufmg.br/~flaviovdf",
  "status": "success",
  "content": "Flavio Figueiredo Publications Experience Teaching Flavio Vinicius Diniz de Figueiredo I am currently a Professor at Computer Science Department at the Federal University of Minas Gerais (UFMG). I’m mostly interested in data driven research focused on social, cultural, and human aspects in computing. In particular, my research bridges hypothesis-driven data science with the development of novel machine learning models for such datasets, this includes music, language/text, graphs and networks, among others. My research is mostly performed at LabUAI, in particular with the MOSAIC (Music Oriented Systems and AI for Creativity) group that lives within LabUAI. Overall, the topics of my research are: machine learning and data science for social-cultural data; music information retrieval. Regarding other academic duties, I’m quite proud to have been one of the founders of the Data Science Undergraduate Degree (BSc) at UFMG. I believe that data science and machine learning literacy are crucial skills in today’s world. I hold a PhD in Computer Science from the Federal University of Minas Gerais (UFMG), as well as a BSc also in Computer Science from the Federal University of Campina Grande (UFCG). During my studies, I was a Google Latin American Award Recipient (two years) and IBM Research Award Recipient (one year). Publications (sorted by year) Conference, journal, and workshop papers (English) 2025 The Polyphonic Audio to Roman Corpus Thiago Poppe, Luisa Lopes, Flavio Figueiredo 12th International Conference on Digital Libraries for Musicology (DLfM’25) Dimensions on the Perception of Users Towards AI Generated Music Frederico Pedrosa, Ivan Rodrigues, Alexei Machado, Lucas N. Ferreira, Flavio Figueiredo 19th Simpósio Brasileiro de Computação Musical (SBCM’25) On the Practicality of LLM-Based Compiler Fuzzing Gabriel Ricardo, Natanael Júnior, Flavio Figueiredo, Fernando Pereira 29th Brazilian Symposium on Programming Languages (SBLP 2025) An Interpretable Measure for Quantifying Predictive Dependence between Continuous Random Variables Renato Assunção, Flávio Figueiredo, Francisco N. Tinoco Júnior, Léo M. de Sá-Freire, Fábio Silva SIAM International Conference on Data Mining (SDM’25) Towards Symmetric Low-rank Adapters Tales Panoutsos, Flavio Figueiredo, Rodrygo L. T. Santos COLORAI - Connecting Low-rank Representations in AI - AAAI 2025 Workshop A Systematic Review of Deep Learning for Structural Geological Interpretation Gustavo Lúcius Fernandes, Flavio Figueiredo, Raphael Siston Hatushika, Maria Luiza Leão, Breno Augusto Mariano, Bruno Augusto Alemão Monteiro, Fernando Tonucci de Cerqueira Oliveira, Tales Panoutsos, João Pedro Pires, Thiago Martin Poppe, Frederico Zavam Data Mining and Knowledge Discovery Journal 2025 2024 Surprising Patterns in Musical Influence Networks Flavio Figueiredo, Tales Panoutsos, Nazareno Andrade Latin American Workshop on Music Information Retrieval LAMIR 2024 Assessing the Impact of Sampling, Remixes, and Covers On Original Song Popularity Guilherme Soares, Flavio Figueiredo Latin American Workshop on Music Information Retrieval LAMIR 2024 I’ve Heard This Before: Initial Results on Tiktok’s Impact On the Re-Popularization of Songs. Breno Matos, Rennan Cordeiro, Francisco Galuppo, Flavio Figueiredo Latin American Workshop on Music Information Retrieval LAMIR 2024 Do we need more complex representations for structure? A comparison of note duration representation for Music Transformers Gabriel Gomes, Deborah Guimarães, Alexei Machado, Flavio Figueiredo 15th International Workshop on Machine Learning and Music 2024 A Comprehensive View of the Biases of Toxicity and Sentiment Analysis Methods Towards Utterances with African American English Expressions Guilherme Andrade, Luiz Nery, Fabricio Benevenuto, Flavio Figueiredo, Savvas Zannettou 30th Brazilian Symposium on Multimedia and Web Systems 2023 Crowdsourcing Pleasantness and Safety Perceptions: An Analysis through Multiple Rankings and Socio-Demographic Groups David Candeia, Flavio Figueiredo, Nazareno Andrade Journal of Urban Technology 2022 Metrics of social curiosity: The WhatsApp case Alexandre Magno Sousa, Jussara M Almeida, Flavio Figueiredo Online Social Networks and Media Understanding effects of moderation and migration on online video sharing platforms Gabriel Luis Santos Freire, Tales Panoutsos, Lucas Perez, Fabricio Benevenuto, Flavio Figueiredo 33rd ACM Conference on Hypertext and Social Media Initial Results for Pairwise Causal Discovery Using Quantitative Information Flow Felipe Giori, Flavio Figueiredo NeurIPS 2022 Workshop on Causal Machine Learning for Real-World Impact (CML4Impact 2022). A New Similarity Space Tailored for Supervised Deep Metric Learning Pedro Barros, Fabiane Queiroz, Flávio Figueiredo, Jefersson A Dos Santos, Heitor Ramos ACM Transactions on Intelligent Systems and Technology 2021 Effects of population mobility on the COVID-19 spread in Brazil Eduarda TC Chagas, Pedro H Barros, Isadora Cardoso-Pereira, Igor V Ponte, Pablo Ximenes, Flávio Figueiredo, Fabricio Murai, Ana Paula Couto da Silva, Jussara M Almeida, Antonio AF Loureiro, Heitor S Ramos PLOS One Towards website domain name classification using graph-based semi-supervised learning Azadeh Faroughi, Andrea Morichetta, Luca Vassio, Flavio Figueiredo, Marco Mellia, Reza Javidan Computer Networks 2020 Measuring disruption in song similarity networks Felipe Falcão, Nazareno Andrade, Flavio Figueiredo, Diego Silva and Fabio Morais International Symposium for Music Information Retrieval ISMIR 2020 Understanding Targeted Video-Ads in Children’s Content Flavio Figueiredo, Felipe Giori, Guilherme Soares, Mariana M. Arantes, Fabricio Benevenuto and Jussara M Almeira ACM Hypertext Conference - HT 2020 Networked Point Process Models Under the Lens of Scrutiny Guilherme Borges, Flavio Figueiredo, Pedro O. S. Vaz de Melo, Renato M. Assunção European Conference on Machine Learning and Principles and Practice of Knowledge Discovery - ECML/PKDD 2020 Federated and secure cloud services for building medical image classifiers on an intercontinental infrastructure Ignacio Blanquer, Francisco Brasileiro, Andrey Brito, Amanda Calatrava, Andre Carvalho, Christof Fetzer, Flavio Figueiredo, Ronny Petterson Guimaraes, Leandro Marinho, Wagner Meira Jr, Altigran Silva, Angel Alberich-Bayarri, Eduardo Camacho-Ramos, Ana Jimenez-Pastor, Antonio Luiz L Ribeiro, Bruno Ramos Nascimento, Fabio Silva Future Generation Computer Systems 2019 Quantifying Disruptive Influence in the AllMusic Guide Flavio Figueiredo and Nazareno Andrade International Symposium for Music Information Retrieval ISMIR 2019 We fixed some minor typos found in the published version PDF  Code + Data Analyzing and Modeling User Curiosity in Online Content Consumption: A LastFM Case Study Alexandre M. Souza, Flavio Figueiredo and Jussara M. Almeida Advances in Social Network Analysis and Mining - ASONAM 2019 PDF Towards Understanding Political Interactions on Instagram. Martino Trevisan, Luca Vassio, Idilio Drago, Marco Mellia, Fabricio Murai, Flavio Figueiredo, Ana Paula Couto da Silva, Jussara M. Almeida ACM Hypertext Conference - HT 2019 PDF  Website The Effect of Audiences on the User Experience with Conversational Interfaces in Physical Spaces Heloisa Candello, Claudio Pinhanez, Mauro Pichiliani, Paulo Cavalin, Flavio Figueiredo, Marisa Vasconcelos, Haylla Do Carmo ACM Conference on Human Factors in Computing - CHI 2019 PDF 2018 Fast Estimation of Causal Interactions using Wold Processes Flavio Figueiredo, Guilherme Borges, Pedro O. S. Vaz de Melo, Renato M. Assunção Neural Information Processing Systems (NIPS) - 2018 PDF   Code   Preprint Towards Understanding the Consumption of Video-Ads on YouTube Mariana Arantes, Flavio Figueiredo, Jussara M. Almeida The Journal of Web Science, 2018 Invited Submission PDF   Data An Investigation of User Actions and Experiences when Exposed to YouTube Video Ads Mariana Arantes, Flavio Figueiredo, Raquel O. Prates, Jussara M. Almeida Brazilian Symposium on Multimedia and the Web - 2018 PDF 2017 Mining and modeling web trajectories from passive traces Luca Vassio, Marco Mellia, Flavio Figueiredo, Ana Paula Couto da Silva, Jussara M Almeida IEEE International Conference on Big Data (2017) PDF Multiple Images of the City: Unveiling Group-Specific Urban Perceptions through a Crowdsourcing Game David Candeia, Flavio Figueiredo, Nazareno Andrade, Daniele Quercia ACM Conference on Hypertext - HT 2017 PDF Typefaces and the Perception of Humanness in Natural Language Chatbots Heloisa Candello, Claudio Pinhanez, Flavio Figueiredo ACM Conference on Human Factors in Computing - CHI 2017 PDF 2016 TribeFlow: Mining & Predicting User Trajectories Flavio Figueiredo, Bruno Ribeiro, Jussara M. Almeida, Christos Faloutsos ACM World Wide Web Conference - WWW 2016 PDF   Preprint   Code/Data   Presentation A Summary of the TribeFlow Model for Music Discovery Applications Flavio Figueiredo, Bruno Ribeiro, Jussara M. Almeida, Christos Faloutsos Machine Learning for Music Discovery Workshop @ ICML 2016 PDF   Presentation Mining Online Music Listening Trajectories Flavio Figueiredo, Bruno Ribeiro, Jussara M. Almeida, Nazareno Andrade, Christos Faloutsos International Society for Music Information Retrieval - ISMIR 2016. There is a mistake in Figure 3 on the conference proceedings. The axis are normalized and the text considers un-normalized values Please use this version. PDF   Poster   Code/Data Exploring the Latent Structure of Collaborations in Music Recordings: A Case Study in Jazz Nazareno Andrade, Flavio Figueiredo International Society for Music Information Retrieval - ISMIR 2016. PDF   Poster   Code/Data Understanding Video-Ad Consumption on YouTube: A Measurement Study on User Behavior, Popularity, and Content Properties. Mariana Arantes, Flavio Figueiredo, Jussara M. Almeida ACM Web Science Conference - WebSci 2016 Best Student Paper Award PDF   Presentation TrendLearner: Early Prediction",
  "content_length": 19082,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:30"
}