{
  "name": "Flavio Esposito",
  "homepage": "https://cs.slu.edu/~esposito",
  "status": "success",
  "content": "Flavio Esposito, Ph.D. Flavio Esposito, Ph.D. home publications software teaching Saint Louis University Associate Professor Computer Science Research Institute Fellow CS Graduate Coordinator Office: ISE 234D 3450 Lindell Blvd, St. Louis, MO 63103 St. Louis, MO 63103-2007 Email: first DOT last AT slu DOT edu Highlights This year I will be the Travel Grant Co-chair of ACM SIGCOMM 2025. I was the general co-chair of IEEE NetSoft 2024, the 10th IEEE International Conference on Network Softwarization. A wonderful group of colleagues and I had fun hosting the conference in St.Louis last summer. Current Openings I have openings for PhD students, visiting researchers, and a postdoc to work on several cyber-physical systems: if you have expertise and interest in networks, learning, and edge computing, as well as applications of these fields to medicine and agriculture, please apply. Check the HIRING webpage for details. Entrepreneurship Together with my former PhD student Alessandro Sangiorgi, I co-founded Spaghetti Code Labs. Our first product is a Cybersecurity educational mobile app WeeNet that has 5.7M+ downloads. Office: ISE 234D Research interests Most of my research centers on cyber-physical systems and networked systems: network virtualization, network management, Software-Defined Networks (SDN), network architectures and wireless networks. I also enjoy working on interdisciplinary problems, for example, this one or this one. Awards In 2021, I received the Outstanding Graduate Mentoring Faculty Award from the School of Engineering, and I was a finalist for the Undergraduate Mentoring Award in the College of Arts and Sciences. I am grateful for all students that nominated and voted for me. I am currently a Principal Investigator on the research awards listed below from the National Science Foundation (NSF). In the past, I have also received an NSF subaward from the University of Missouri, on an EPSCoR project, and a SLU intramural President's Research Fund Award. I have also received a COMCAST Innovation Fund Award in Jan 2020, and one 150K award from the International Center for Responsible Gaming (ICRG). NSF US Ignite: Collaborative Research: Focus Area 2: Resilient Virtual Path Management for Scalable Data-intensive Computing at Network-Edges SLU News Article about the award ICE-T: RI: A Knowledge-Defined Platform for Real-Time Management of Transmissions and Computations at Network Edge CNS Core: Small: Collaborative Research: HEECMA: A Hybrid Elastic Edge-Cloud Application Management Architecture CC* Integration-Small: A Software-Defined Edge Infrastructure Testbed for Full-stack Data-Driven Wireless Network Applications Collaborative Research: CPS: TTP Option: Medium: Sharing Farm Intelligence via Edge Computing CC* Compute-Campus: Modernizing Campus Cyberinfrastructure for AI-Enhanced Research and Education (ModernCARE) CICI: IPAAI: REPAIRT: Securing xApps in Open RANs with Reliable and Principled AI Red-Teaming Short Bio Since Aug 2021: Associate Professor, Computer Science Department, Saint Louis University From Aug 2016 to July 2021: Assistant Professor, Computer Science Department Saint Louis University Oct 2013 - July 2016: Senior Software Engineer at Exegy Inc. Ph.D. in Computer Science at Boston University. May 2009 - Aug 2009 Bell Labs, Holmdel, NJ (Research Internship) May 2008 - Aug 2008: Raytheon BBN Technologies Cambridge, MA (Research Internship) May 2007 - Aug 2007: Eurecom Institute, Sophia Antipolis, France (Research Internship) Oct 2006 - Dec 2006: Centre for Wireless Communication (CWC), Oulu, Finland (Res. Scientist) Jan 2006 - Oct 2006: Alcatel-Lucent, Florence, Italy – now Thales (Permanent Contract) Dec 2005: M.S. in Telecommunication Engineering at University of Florence, Italy Mentoring I was a proud mentor for the McNair Program at SLU. Current Students and Collaborators In alphabetical order: Ph.D. students (I am hiring new PhD students) Gidugu, Mansi; Ph.D. student in CS at SLU Pappone, Lorenzo; Ph.D. candidate in CS at SLU Pinto, Andrea; Ph.D. candidate in CS at SLU Sreenivasa Murthy, Shruthi, Ph.D. student and Assistant Director of Research Computing at SLU M.S. Students Garimella, Siri Chandana; M.S. student in CS Sangiorgi, Alessandro; M.S. student in CS and co-founder of Spaghetti Code Labs, LLC Past Students and Collaborators Ali, Wazma, MS student in AI at SLU Alfauri, Haneen M.S. student at SLU (now Ph.D. student at Washington University of St.Louis) Ahmad, Sadiya M.S. student at SLU Alzadjali, Aziza visiting Ph.D, student from University of Nebraska, Lincoln, USA. Amoroso, Roberto, visiting MS student (now Ph.D. student at UNIMORE, Italy). Bhavanasi, Sai Shreyas, MS student in AI at SLU Berno, Michele, visiting Ph.D. student from University of Padova, Italy Castellano, Gabriele, visiting Ph.D. student from Politechnic of Turin (now postdoc at Bell Lab) Chemodanov, Dmitrii (Ph.D. student at UM, now at Google, CA) Contoli, Chiara, Visiting Ph.D., now Assistant Professor at University of Urbino, Italy University of Bologna, Italy Coral, Roberto M.S, now Software Engineer at Esri, USA Davoli, Gianluca, visiting Ph.D student from University of Bologna, Italy Flocco, Matteo, M.S. student at SLU (now at Reply, Italy) Gaballo, Alessandro, Visiting Master Student from Eurecom, France, now Data Scientist at Ericsson, Sweden. Gottsacker, Matthew, Undergrad at SLU (BS 2018). Now Ph.D. student at UCF Hogan, Mary, (Research Assistant) SLU (BS 2017). Now Ph.D. student in CS at Princeton University Khalid, Aman, M.S. student at SLU (now Ph.D student at Northwestern University, USA) Gazze’, Sebastiano Visiting MS Student from Polytechnic University of Turin, Italy Irakoze, Andy Florian, BS/MS in Computer Science at SLU Muhammad, Waqar, M.S. student at SLU (Software Engineer) Mushtaq, Maria, M.S. student at SLU (now Ph.D. student at University of Regina, Canada) Okafor, Okwudilichukwu (Marshall), MS student in CS at SLU Okorie, Princewill, M.S. in AI at SLU (Software Engineer) Palumbo, Fabio visiting Ph.D. student from University of Napoli Federico II, Italy Park, Hunter, undergraduate at SLU (Software Eng.) Pasquesi, John, M.S. student at SLU (now Software Engineer at Boeing, St.Louis, MO) Robinson, Wilfredo visiting M.S. student from Eurecom, France (now PhD student in Mechanical Eng. at SLU) Felipe Sampaio Dantas da Silva, Ph.D. student at Universidade Federal do Rio Grande do Norte, UFRN, Brasil. Sacco, Alessio, visiting PhD student and visiting postdoc, now Assistant Professor at Politecnico of Torino, Italy Samanta, Amit, Ph.D student at University of Utah, USA Scalingi, Alessio, visiting M.S. student from University of Naples, Federico II (now Ph.D. student at IMDEA Networks, Spain)) Turina, Valeria, visiting M.S. student from Politecnico di Torino, Italy (now at Reply, Italy) Ventrella, Agnese (now at Ericsson Research, Sweden) Xu, Tao, Visiting Master Student from Polytechnic University of Turin, Italy Now Ph.D. student at UKY Wang, Jiayi (Research Assistant) SLU (BS 2017). MS student in CS at Northwestern University Zhang, Zongshun, Ph.D. student at Boston University Past Undergraduate Student Collaborators Kyle Coleman, SLU (BS 2017) Samiksha Mailarpwar, SLU (BS 2018) Emily Maxwell, undergraduate at SLU Thomas Merod, SLU (BS 2018) Meghan Pendyala, SLU (BS 2017) Selected Service Activities TPC co-chair of IEEE NFV-SDN 2022 Student travel grant co-chair of ACM CoNEXT 2022 Poster session co-chair of ACM CoNEXT 2021 TPC co-chair of IEEE NetSoft 2019 Student travel grant co-chair of ACM CoNEXT 2019 Panel co-chair at IEEE NFV-SDN Associate editor of Wiley Internet Technology Letters (since May 2017) Reviewer award at International Conference on Network Softwarization NetSoft 2022 Distinguished TPC member of IEEE INFOCOM 2019, 2020, 2021 Panelist at IEEE NFV-SDN 2019 TPC member of all Workshops on Serverless Computing (WoSC) Invited talk at the 2nd IEEE Intern. Workshop on Orchestration for Software Defined Infrastructures (04SDI 2016) colocated with IEEE Conference on Network Function Virtualization and Software Defined Networks (NFV-SDN 2016) Co-organizer of Internet Measurement Conference (IMC 2012), Boston, MA. Page generated 2025-10-10, by jemdoc.",
  "content_length": 8236,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:24"
}