{
  "name": "Flora Salim",
  "homepage": "https://www.unsw.edu.au/staff/flora-salim",
  "status": "success",
  "content": "Professor Flora Salim Type in a search term Search Follow Follow LinkedIn Facebook Instagram TikTok YouTube Back to Professor Flora Salim Professor Engineering Computer Science and Engineering Follow me Follow me Flora Salim a full Professor in the School of Computer Science and Engineering at the University of New South Wales (UNSW) Sydney, where she also serves as the Deputy Director (Engagement) of the UNSW AI Institute. Her work focuses on multimodal machine learning and foundation models for time-series and spatio-temporal data, behavioural modelling with multimodal sensors and wearables, robust and trustworthy machine learning, and on applications of AI and LLMs for smart and sustainable cities, and for mobility, transport, energy, and grid systems. She has received multiple nationally and internationally competitive fellowships, such as Humboldt Fellowship, Bayer Fellowship, Victoria Fellowship, ARC Australian Postdoctoral Industry (APDI) Fellowship, and many accolades and awards such as the Women in AI Award Australia and New Zealand (2022) and IBM Smarter Planet Industry Innovation Award. She is a member of the Australian Academy of Sciences’ National Committee for Information and Computing Sciences and an elect member of the Australian Research Council (ARC) College of Experts. She is a Vice Chair of the IEEE Task Force on AI for Time-Series and Spatio-Temporal Data. She serves in the editorial board of ACM TIST, ACM TSAS, PACM IMWUT, IEEE Pervasive Computing, and Nature Scientific Data, and has served as a senior reviewer or area chair for NeurIPS, ICLR, WWW, and many other top-tier conferences in AI and ubiquitous computing. Prof Salim is a Chief Investigator on the Australian Research Council (ARC) Centre of Excellence for Automated Decision Making and Society (ADM+S), co-leading the Mobilities Focus Area. She is also a Key Chief Investigator in the ARC Training Centre for Whole Life Design for Carbon Neutral Infrastructure, leading the Program on Machine Learning for Carbon Performance. She has worked with many industry and government partners, and managed large-scale research and innovation projects, leading to several patents and deployed systems locally and globally. She is an Associate of ELLIS Alicante and holds an Honorary Professor appointment at RMIT University. She was a Visiting Professor at University of Kassel (Germany) in 2019-2020, and University of Cambridge (England) in 2019. Group website: https://cruiseresearchgroup.github.io; LinkedIn E-mail flora.salim@unsw.edu.au Location K17 Publications Publications Media Media Grants Grants Awards Awards Research Activities Research Activities Engagement Engagement Teaching and Supervision Teaching and Supervision Books Books | 2023 Prabowo A; Chen K; Xue H; Sethuvenkatraman S; Salim FD, 2023, Correction to: Machine Learning and Knowledge Discovery in Databases: Applied Data Science and Demo Track (LNAI 14175 (10.1007/978-3-031-43430-3_1)), http://dx.doi.org/10.1007/978-3-031-43430-3_34 Book Chapters Book Chapters | 2023 Prabowo A; Chen K; Xue H; Sethuvenkatraman S; Salim FD, 2023, 'Continually Learning Out-of-Distribution Spatiotemporal Data for Robust Energy Forecasting', in , pp. 3 - 19, http://dx.doi.org/10.1007/978-3-031-43430-3_1 Book Chapters | 2023 Prabowo A; Chen K; Xue H; Sethuvenkatraman S; Salim FD, 2023, 'Correction to: Continually Learning Out-of-Distribution Spatiotemporal Data for Robust Energy Forecasting', in Lecture Notes in Computer Science, Springer Nature Switzerland, pp. C1 - C2, http://dx.doi.org/10.1007/978-3-031-43430-3_34 Book Chapters | 2019 Rahaman MS; Hamilton M; Salim FD, 2019, 'Using Big Spatial Data for Planning User Mobility', in Encyclopedia of Big Data Technologies, pp. 1747 - 1752, http://dx.doi.org/10.1007/978-3-319-77525-8_224 Book Chapters | 2012 Salim F; Loke S; Krishnaswamy S; Rakotonirainy R; Srinivasan B, 2012, 'Ubiquitous Intersection Awareness (U&I Aware)', in Handbook on Mobile and Ubiquitous Computing, CRC Press, pp. 137 - 164, http://dx.doi.org/10.1201/b13081-9 Edited Books Journal Articles Journal articles | 2025 Abushaqra FM; Xue H; Ren Y; Salim FD, 2025, 'ODEStream: A Buffer-Free Online Learning Framework with ODE-based Adaptor for Streaming Time Series Forecasting', Transactions on Machine Learning Research, 2025-March Journal articles | 2025 De Rijke M; Van Den Hurk B; Salim F; Khourdajie AA; Bai N; Calzone R; Curran D; Demil G; Frew L; Gießing N; Gupta MK; Heuss M; Hobeichi S; Huard D; Kang J; Lucic A; Mallick T; Nath S; Okem A; Pernici B; Rajapakse T; Saleem H; Scells H; Schneider N; Spina D; Tian Y; Totin E; Trotman A; Valavandan R; Workneh D; Xie Y, 2025, 'Report on the 1st Workshop on Information Retrieval for Climate Impact (MANILA24) at SIGIR 2024', Annals of the Entomological Society of America, 59, http://dx.doi.org/10.1145/3769733.3769737 Journal articles | 2025 Fang L; Xiang W; Jin J; Liao K; Liu C; Han Y; Salim FD; Chen YPP, 2025, 'Agri-LLM: Prompt-based Large Language Model for Emission Data Analytics in Smart Agriculture', IEEE Internet of Things Journal, http://dx.doi.org/10.1109/JIOT.2025.3617099 Journal articles | 2025 Fang L; Xiang W; Pan S; Salim FD; Chen YPP, 2025, 'Spatiotemporal Pretrained Large Language Model for Forecasting With Missing Values', IEEE Internet of Things Journal, 12, pp. 13838 - 13850, http://dx.doi.org/10.1109/JIOT.2024.3524030 Journal articles | 2025 Gao N; Liu Y; Tang X; Liu Y; Yu C; Huang Y; Wang Y; Salim FD; Xu X; Wei J; Shi Y, 2025, 'The Homework Wars: Exploring Emotions, Behaviours, and Conflicts in Parent-Child Homework Interactions', Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies, 9, http://dx.doi.org/10.1145/3749517 Journal articles | 2025 Hamdi A; Alkouz B; Shahzaad B; Bouguettaya A; Ghari Neiat A; Salim F; Kim DY, 2025, 'Drone-as-a-Service: Research Challenges and Directions', Proceedings of the IEEE, 113, pp. 416 - 442, http://dx.doi.org/10.1109/JPROC.2025.3599126 Journal articles | 2025 Huang R; Xue H; Pagnucco M; Salim FD; Song Y, 2025, 'Vision-Based Multi-Future Trajectory Prediction: A Survey', IEEE Transactions on Neural Networks and Learning Systems, 36, pp. 13691 - 13708, http://dx.doi.org/10.1109/TNNLS.2025.3550350 Journal articles | 2025 Ji K; Hettiachchi D; Scholer F; Salim FD; Spina D, 2025, 'SenseSeek Dataset: Multimodal Sensing to Study Information Seeking Behaviors', Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies, 9, http://dx.doi.org/10.1145/3749501 Journal articles | 2025 Jin M; Shi G; Li YF; Xiong B; Zhou T; Salim FD; Zhao L; Wu L; Wen Q; Pan S, 2025, 'Towards Expressive Spectral-Temporal Graph Neural Networks for Time Series Forecasting', IEEE Transactions on Pattern Analysis and Machine Intelligence, 47, pp. 4926 - 4939, http://dx.doi.org/10.1109/TPAMI.2025.3545671 Journal articles | 2025 Kegalle HN; Hettiachchi D; Chan J; Salim FD; Sanderson M, 2025, '”Nuisance is Better Than Nothing?”: Exploring How Pedestrians and Cyclists Perceive Automated E-Scooter Alerts in Shared Spaces', Proceedings of the ACM on Human Computer Interaction, 9, http://dx.doi.org/10.1145/3743732 Journal articles | 2025 Kegalle HN; Hettiachchi D; Chan J; Sanderson M; Salim FD, 2025, 'Watch Out! E-scooter Coming Through!: Multimodal Sensing of Mixed Traffic Use and Conflicts Through Riders' Ego-centric Views', Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies, 9, http://dx.doi.org/10.1145/3712284 Journal articles | 2025 Lin X; Prabowo A; Razzak I; Xue H; Amos M; Behrens S; Salim FD, 2025, 'A Gap in Time: The Challenge of Processing Heterogeneous IoT Data in Digitalized Buildings', IEEE Pervasive Computing, 24, pp. 19 - 31, http://dx.doi.org/10.1109/MPRV.2025.3542061 Journal articles | 2025 Nguyen D; Yin D; Joshi A; Salim F, 2025, 'Spectraformer: A Unified Random Feature Framework for Transformer', ACM Transactions on Intelligent Systems and Technology, http://dx.doi.org/10.1145/3768161 Journal articles | 2025 Shao W; Zhu R; Yang C; Thapa C; Ejaz Ahmed M; Camtepe S; Zhang R; Yong Kim D; Menouar H; Salim FD, 2025, 'ST-DPGAN: A Privacy-Preserving Framework for Spatiotemporal Data Generation', IEEE Internet of Things Journal, 12, pp. 29333 - 29342, http://dx.doi.org/10.1109/JIOT.2025.3568863 Journal articles | 2025 Small EA; Shao W; Zhang Z; Liu P; Chan J; Sokol K; Salim FD, 2025, 'How robust is your fair model? Exploring the robustness of prominent fairness strategies', Data Mining and Knowledge Discovery, 39, http://dx.doi.org/10.1007/s10618-025-01112-8 Journal articles | 2025 Spina D; Gwizdka J; Ji K; Moshfeghi Y; Mostafa J; Ruotsalo T; Zhang M; Ahmad A; Lawati SFDA; Boonprakong N; Fernando N; He J; Hoeber O; Jayawardena G; Lee BG; Liu H; Pike M; Pirmoradi A; Nakisa B; Rastgoo MN; Salim FD; Scott F; Sun S; Tang H; Towey D; Wilson ML, 2025, 'Report on the 3rd Workshop on NeuroPhysiological Approaches for Interactive Information Retrieval (NeuroPhysIIR 2025) at SIGIR CHIIR 2025', SIGIR Forum ACM Special Interest Group on Information Retrieval, 59, http://dx.doi.org/10.1145/3769733.3769740 Journal articles | 2025 Xue H; Jin M; Pan S; Salim F; Pang G, 2025, 'Transforming Urban Dynamics: Harnessing Large Language Models for Smarter Mobility', IEEE Intelligent Systems, 40, pp. 5 - 7, http://dx.doi.org/10.1109/MIS.2025.3544937 Journal articles | 2024 Cao Y; Zhu Y; Ting KM; Salim FD; Li HX; Yang L; Li G, 2024, 'Detecting Change Intervals with Isolation Distributional Kernel', Journal of Artificial Intelligence Research, 79, pp. 273 - 306, http://dx.doi.org/10.1613/jair.1.15762 Journal articles | 2024 Dingler T; Salim F, 2024, 'MobileHCI 2024 General Chairs' Welcome', Mobilehci 2024 Adjunct Proceedings Publication of the 26th International Conference on Mobile Human Computer Interaction, pp. iii - iv Journal articles | 2024 Jiang R; Salim F; Mokbel M, 2024, 'Introduction to the Special Issue on Machine Learning and Location Data: Part II', ACM Transactio",
  "content_length": 127903,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:29"
}