{
  "name": "Florian Alt",
  "homepage": "http://www.medien.ifi.lmu.de/team/florian.alt",
  "status": "success",
  "content": "Florian Alt - Medieninformatik Institut für Informatik | Sitemap | LMU-Portal English StartseiteStudieninteressierteStudierendeLehrveranstaltungenForschungPersonenKontaktBesucherJobsFAQIntern Prof. Dr. Florian Alt Mail florian.alt ät ifi.lmu.de (LMU) Telefon 089/2180-75101 Adresse Prof. Dr. Florian Alt Ludwig-Maximilians-Universitï¿½t Mï¿½nchen Media Informatics Group Frauenlobstr. 7a 80337 Mï¿½nchen Raum 436 (4. Stock) Persï¿½nliche Webseite http://www.florian-alt.de Former Group Website https://go.unibw.de/usec About me Florian Alt is a Full Professor of Media Informatics in the Department of Computer Science at LMU Munich, Germany. His research centers on designing secure and privacy-preserving systems that align seamlessly with everyday user interactions. In particular, Florian investigates how knowledge on users' behavior and physiology can be leveraged to enhance and create novel security mechanisms (physio-behavioral security). Furthermore, he is interested in emerging threats in ubiquitous computing environments and how they can be mitigated. His work spans several application domains, including social engineering, authentication, and Mixed Reality. Florian strongly engages in the scientific community in various roles. He is general co-chair of ACM MobileHCI 2025 and Steering Committee Chair of the MUM Conference Series. Furthermore, he served as Paper Chair for ACM ISS 2023 and 2024, as Subcommittee Chair for CHI 2020 and 2021, and was TPC CHair of Mensch und Computer 2020 and 2023. He currently serves on the editorial board of ACM ToCHI and is a department editor for security and privacy for the IEEE Pervasive Computing Magazine. For his contributions, Florian received a 2022 Test of Time Award from ACM Multimedia and has garnered over 15 Best Paper and Honorable Mention Awards at top-tier conferences. His work has been supported by the German Research Foundation (DFG), the Center for Digitization and Technology of the Bundeswehr, the ZD.B/Bavarian State Ministry for Education and Science, BMW, the Humboldt Foundation, the DAAD, and the Telekom Innovation Labs. Florian won a Google Faculty Award in 2023. Prior to rejoining LMU, Florian served as a Full Professor of Usable Security and Privacy at the CODE Research Center for Cyber Defense (University of the Bundeswehr Munich) and held an Assistant Professorship in Human-Computer Interaction at LMU Munich and the University of Applied Sciences Munich. He has also been a visiting researcher at TU Vienna as well as a guest lecturer at JKU Linz and the University of Duisburg-Essen. Beyond academia, Florian gained industry experience as a web developer at Pinnacle Systems and as an IT specialist at Schreiner Group in the United States. He holds a PhD in Computer Science from the University of Stuttgart and a diploma in Media Informatics from LMU Munich. CV Current Appointments since 10.2024 Full Professor (W-3) at LMU Munich Prior Appointments 05.2018 - 10.2024 Full Professor (W-3) at the Bundeswehr University Munich 11.2012 - 07.2023 Visiting Researcher at TU Vienna 10.2013 - 05.2018 Assistant Professor (W-1, evaluated) at LMU Munich 01.2011 - 09.2013 Research Associate at the University of Stuttgart 12.2010 - 05.2011 Visiting Researcher at the Deutsche Telekom Labs (Berlin) 04.2008 - 12.2011 Research Assistant at the University of Duisburg-Essen 10.2007 - 03.2008 IT Specialist, Schreiner MediPharm Inc., New York Education 01.2012 - 12.2012 University of Stuttgart, Ph.D. in Computer Science (Dr. rer. nat.) 09.2001 - 09.2007 Diploma in Media Informatics (LMU Munich) Projects (Selection) Ongoing Projects Voice of Wisdom (01/2021 - 12/2026 ) dtec.bw MuQuaNet (01/2021 - 12/2026 ) dtec.bw PriMR (07/2024 - 06/2027) DFG Finished Projects ubihave (01/2019 - 12/2022) DFG Scalable Biometrics (01/2019 - 04/2025 ) DFG Biometrics++ (02/2017 - 07/2019) ZD.B Research Group Scientific Activities (Selection) Organizing Committees Conference General Co-Chair of ACM MobileHCI 2025 Technical Program Chair Mensch & Computer 2023 Technical Program Chair Mensch & Computer 2020 Conference General Co-Chair, Mobile and Ubiquitous Multimedia 2018 Organizer of the 2023 Post-CHI Summer School on Human-Centered Security Organizer of 2018 UIST School on Brain-Computer Interfaces Since 2009, I have engaged in various sharing roles for scientific meetings, among them Demo Chair for MobileHCI 2021 and MUM 2012, Workshop Chair for ETRA 2020 & 2021 and MobileHCI 2015; and Publication Chair for Ubicomp' 20, TEI 2014, AH 2013, PerDis 2012) Program Chairing 2023 - 2024 Program Chair ACM ISS 2019 - 2020 ACM CHI Subcommittee Chair 2019 Program Co-Chair Mensch & Computer 2016 Program Co-Chair Mobile and Ubiquitous Multimedia 2015 Program Co-Chair ACM Pervasive Displays Editorial Boards ACM Transactions on Computer-Human Interaction (ToCHI) (since 2024) IEEE Pervasive Computing (Department Editor Security and Privacy, since 2022) ACM PACM IMWUT (2018-2024) I have served on more than 50 PCs of leading venues in my field — most importantly ACM CHI (since 2018), USENIX SOUPS (since 2021), NSPW (since 2023). Furthermore, I have served as expert reviewer for over 100 venues (among them SIGGRAPH, UIST, PETS, USEC, EuroUSEC, CSCW, DIS, EICS, NordiCHI, INTERACT, AVI, VRST, TEI, AutoUI, ISS). Publikationen 2025 Doruntina Murtezaj, Jovana Dinic, Viktorija Paneva, Florian Alt Roby on a Mission: Promoting Awareness and Adoption of Password Managers Through Public Security User Interfaces In MUM '25: Proceedings of the 24th International Conference on Mobile and Ubiquitous Multimedia. December 25, 2025. Association for Computing Machinery, New York, NY, USA. (bib) Viktorija Paneva, Verena Winterhalter, Franziska Augustinowski, Florian Alt User Understanding of Privacy Permissions in Mobile Augmented Reality: Perceptions and Misconceptions In PACM HCI: Proceedings of the ACM on Human-Computer Interaction. 2025. Association for Computing Machinery, New York, NY, USA. (bib) Sarah Delgado Rodriguez, Sarah Elisabeth Winterberg, Franziska Bumiller, Felix Dietz, Florian Alt, Mariam Hassib XSec Companions: Exploring the Design of Cybersecurity Companions In EuroUSEC '25: Proceedings of the 2025 European Symposium on Usable Security. September 17, 2025. Association for Computing Machinery, New York, NY, USA. (bib) Download Marjan Käsemodel, Verena Winterhalter, Felix Heisel, Florian Alt, Bastian Pfleging BlueTOTP: Designing A Phishing-Resistant and User-Friendly Approach to Two-Factor Authentication In INTERACT '25: Proceedings of the 20th IFIP TC 13 International Conference on Human-Computer Interaction. September 03, 2025. Springer Nature, Cham, Switzerland. (bib) Download Oliver Hein, Sude Gokcel, Florian Alt From Ears to Eyes: The Impact of Augmented Text Integration on Audio Guidance In INTERACT '25: Proceedings of the 20th IFIP TC 13 International Conference on Human-Computer Interaction. September 03, 2025. Springer Nature, Cham, Switzerland. (bib) Download Yasmin Abdrabou, HASH(0x56319ddc3068), Mike Fischer, Alia Saad, HASH(0x56319ddc2ed0), Pascal Knierim, Florian Alt Investigating Natural Shoulder Surfing Behaviorin the Wild: A Research Space and Case Study In INTERACT '25: Proceedings of the 20th IFIP TC 13 International Conference on Human-Computer Interaction. September 03, 2025. Springer Nature, Cham, Switzerland. (bib) Download Lou Süsslin, Ville Mäkelä, Florian Alt, Linda Hirsch Designing Safer Touch Displays: Digitally Distributing Physical Touch on a Public Display In MuC '25: Proceedings of Mensch Und Computer 2025. August 30, 2025. Association for Computing Machinery, New York, NY, USA. (bib) Download Andreas Triantafyllopoulos, Anika A. Spiesberger, Iosif Tsangko, Xin Jing, Verena Distler, Felix Dietz, Florian Alt, HASH(0x56319ddc3008) Vishing: Detecting social engineering in spoken communication â A first survey & urgent roadmap to address an emerging societal challenge Computer Speech & Language. August 06, 2025. (bib) Download Filipo Sharevski, Verena Distler, Florian Alt Helps me Take the Post With a Grain of Salt:\" Soft Moderation Effects on Accuracy Perceptions and Sharing Intentions of Inauthentic Political Content on X 34th USENIX Security Symposium (USENIX Security 25). August 05, 2025. USENIX Association, Seattle, WA. (bib) Download Sarah Delgado Rodriguez, Lukas Mecke, Ismael Prieto Romero, Melina Bregenzer, Florian Alt Let the Door Handle It: Exploring Biometric User Recognition Embedded in Doors In MuC '25: Proceedings of Mensch Und Computer 2025. August 04, 2025. Association for Computing Machinery, New York, NY, USA. (bib) Download Oliver Hein, Sandra Wackerl, HASH(0x56319ddc2f30), Florian Alt, Francesco Chiossi At the Speed of the Heart: Evaluating Physiologically-Adaptive Visualizations for Supporting Engagement in Biking Exergaming in Virtual Reality In SportsHCI '25: Proceedings of Annual Conference on Human-Computer Interaction and Sports. July 04, 2025. Association for Computing Machinery, New York, NY, USA. (bib) Download Verena Winterhalter, Anouk Moreno, Sarah Prange, Harel Berger, Florian Alt PermWatch: A Tool for In-Situ Research on Users' Awareness and Control of Android Permissions In SOUPS '25: Adjunct Proceedings of the Twenty-First Symposium on Usable Privacy and Security. June 05, 2025. USENIX Association, undefined. (bib) Download Lukas Mecke, Assem Mahmoud, Simon Marat, Florian Alt Exploring the Effect of Music on User Typing and Identificationthrough Keystroke Dynamics In CHI â25: Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. April 24, 2025. Association for Computing Machinery, New York, NY, USA. (bib) Download Sarah Delgado Rodriguez, Maximiliane Windl, Florian Alt, Karola Marky The TaPSI Research Framework - A Systematization of Knowledge on Tangible Privacy and Security Interfaces In CHI '25: Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. 2025. Association for Computing Machinery, New York, NY, ",
  "content_length": 122140,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:34"
}