{
  "name": "Florin Rusu",
  "homepage": "https://faculty.ucmerced.edu/frusu",
  "status": "success",
  "content": "Florin Rusu Florin Rusu Professor and Chair Computer Science and Engineering School of Engineering University of California Merced email: frusu [at] ucmerced [dot] edu phone: (209) 228-4286 office: SE2-210 mailing address: SE2-310, 5200 N Lake Road, Merced, CA 95343, USA News 2024/10: Asoke Datta successfully defends his Ph.D. dissertation on the impact of cardinality estimation on query optimization. Asoke joins Google for his first job. Congratulations! 2024/06: We present 3 papers at SIGMOD 2024 in Santiago, Chile: suboptimal query plan classification [artifacts], approximate sketches [artifacts], and query optimization without cardinality estimation [artifacts]. 2024/04: Florin serves on the program committee of SIGMOD 2025 and VLDB 2025. 2024/03: We publish a technical report on spanning tree-based query plan enumeration. 2023/12: Yesdaulet Izenov successfully defends his Ph.D. dissertation on query optimization using sketches in relational database systems. Yesta joins the faculty at Nazarbayev University in Kazakhstan for his first job. Congratulations! 2023/08: Abylay Amanbayev joins our research group as a Ph.D. student. Welcome! Bio: Florin is originally from the city of Cluj-Napoca in the historical region of Transylvania, Romania. He received a B.Eng. degree in 2004 from the Technical University of Cluj-Napoca, Faculty of Automation and Computer Science under the supervision of Sergiu Nedevschi. In 2005, he joined the graduate program in Computer Science at the University of Florida where he received a M.Sc. degree in 2008 and a Ph.D. degree in 2009. At UF, Florin worked on large scale data management problems under the supervision of Alin Dobra. He also participated in the design and implementation of multiple database systems under the coordination of Chris Jermaine. Florin joined UC Merced in 2010 where he started the research program in data management and the educational curriculum in databases. Florin is the recipient of a DOE Early Career Award in 2014 and a Hellman Faculty Fellowship in 2013. At UC Merced, Florin has served in several administrative positions, including as chair of the School of Engineering's Executive Committee and chair of the Department of Computer Science and Engineering. Vita (October 2024) Research interests: Florin's research interests lie in the area of databases and large scale data management in general, with a particular focus on designing and building infrastructure for Big Data analytics. Specific topics include query processing and optimization, approximate and randomized algorithms, and scalable machine learning. Scientific data processing as another facet of Big Data receives considerable attention in Florin's research through topics such as multi-dimensional array data management and in-situ data processing. Florin is interested both in theoretical aspects as well as system design issues. His research has been funded by UC Merced, US Department of Energy (DOE), National Science Foundation (NSF), California Department of Education, Hellman Foundation, LogicBlox, and TigerGraph. Publications [DBLP] [Google Scholar] Projects Database Query Optimization Scalable Gradient Descent Optimization Array Databases In-Situ Data Processing GLADE Online Aggregation (OLA) Sketches Teaching CSE 100: Algorithm Design and Analysis CSE 111: Database Systems CSE 165/ENGR 140: Introduction to Object-Oriented Programming CSE 177/EECS 277: Database Systems Implementation EECS 284: Big Data Science EECS 284: Big Data Systems & Analytics EECS 284: Large Scale Data Management Students Current Ph.D. Brian Tsan, August 2019 -- Present (intern: LLNL 2024, 2022) Abylay Amanbayev, August 2023 -- Present M.Sc. Brian Matamet Salas, August 2021 -- Present (intern: Upstart 2022) B.S. Shri Nidhi, August 2024 -- Present (work: vector databases) Raul Pena Verduzco, August 2024 -- Present (work: vector databases) Jason Yuen, August 2024 -- Present (work: vector databases) Justin Ly, January 2024 -- Present (work: course recommendation web app) Alumni Ph.D. Asoke Datta, August 2018 -- October 2024 (dissertation: Impact of Cardinality Estimation on Query Optimization; intern: TigerGraph 2022; first employment: Google) Yesdaulet Izenov, August 2018 -- December 2023 (dissertation: Query Optimization using Sketches in Relational Database Systems; intern: Meta Facebook 2022; Oracle 2022; first employment: faculty at Nazarbayev University, Kazakhstan) Yujing Ma, August 2016 -- August 2021 (dissertation: Gradient Descent Optimization on Heterogeneous Architectures; intern: LBNL 2021, 2020, 2017) Weijie Zhao, August 2014 -- June 2018 (dissertation: Advanced Database Techniques for Scientific Data Processing; intern: LBNL 2017, 2016, 2015; first employment: postdoc researcher @ Baidu Research USA) Chengjie Qin, August 2011 -- December 2016 (dissertation: GLADE-ML: A Database For Big Data Analytics; intern: GraphSQL 2015; first employment: GraphSQL) Yu Cheng, August 2011 -- August 2016 (dissertation: In-situ Data Processing Over Raw Files; intern: Google 2015; first employment: Turn) M.Sc. Zhiyi Huang, August 2015 -- December 2019 (project: Benchmarking Graph Database Systems) Twinkle Mistry, August 2017 -- May 2019 (project: EconMatch: A Versatile Website for Matching Candidates and Employers; first employment: VTech) Amar Saini, August 2017 -- May 2019 (thesis: PrivateJobMatch: A Privacy-Oriented Deferred Multi-Match Recommender System for Stable Employment; first employment: Lawrence Livermore National Lab (LLNL)) Ye Zhu, August 2016 -- May 2019 (thesis: High-Throughput Push-Based Storage Manager; intern: Google 2018; first employment: Google) Jaspal Atwal, June 2016 -- December 2018 (project: Amazon GreenGrass-Based Image System; first employment: Revenue Solutions, Inc.) Jun Hyung Shin, April 2017 -- June 2018 (thesis: Novel Selectivity Estimation Strategy for Modern DBMS; first employment: TigerGraph) Xin Zhang, August 2015 -- December 2017 (thesis: Code Generation Techniques for Raw Data Processing; intern: LBNL 2016, Striim 2017; first employment: Autonomic.ai) Abdur Rafay, August 2015 -- August 2016 (thesis: Multi-Query Optimization in GLADE; first employment: FICO) Zixuan Zhuang, August 2013 -- August 2015 (thesis: An Experimental Study of Distributed Quantile Estimation; intern: GraphSQL; first employment: GraphSQL) B.S. Stephen Garcia, January 2023 -- May 2023 (work: query optimization in SQLite) Alexander Crosdale, June 2016 -- May 2017 (UROC Undergraduate Research Scholar; work: implementation of TPC-H in MongoDB) Jonathan Rodriguez, October 2015 -- May 2017 (work: parallel data partitioning in GLADE) Gobind Ball, August 2015 -- December 2015 (SoE Outstanding Undergraduate Student Award; work: code generation for JSON parsing; first employment: Zappos) Nhan Dao, January 2014 -- May 2014 (work: data loading in SciDB; first employment: eGain Corporation) Zachary Michaels, February 2013 -- May 2013 (work: run GLADE on NERSC supercomputers; first employment: Applied Medical) Roseller Velicaria, May 2012 -- August 2012 (work: in-memory hash join algorithms; first employment: JD Power and Associates) Jorge Ramirez Perez, May 2011 -- May 2012 (work: efficient data loading in GLADE; first employment: Boeing) Funding National Science Foundation (NSF III Core Small): COMPASS: Online Sketch-based Query Optimization for In-Memory Databases (2020--2025) DOE Early Career Award: Scalable and Energy-Efficient Methods for Interactive Exploration of Scientific Data (2014--2021) Research gift from TigerGraph (2018--2019) California Department of Education Mathematics and Science Partnership (CaMSP): Team-E Science (2015--2018) Hellman Faculty Fellowship: Parallel On-Line Aggregation Techniques for Big Data Analytics (2013--2014) Research gift from LogicBlox (2013) UC Merced | EECS | Home Last updated: Friday, October 4, 2024",
  "content_length": 7873,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:41"
}