{
  "name": "Florin Manea",
  "homepage": "http://flmanea.blogspot.com",
  "status": "success",
  "content": "Florin Manea's Website News: Visit the webpage of my group! Together with Annabelle McIver, I co-chair the Track B of STACS 2026. Please submit there your best papers! Together with Paweł Gawrychowski, Cristian Riveros, and Tatiana Starikovskaya, I organize a Dagstuhl Seminar: Stringology Meets Database Theory. STACS 2027 will take place in Göttingen. New DFG-grant: String Constraint Solving: Combinatorial, Algorithmic, and Language-Theoretic Approaches. DFG funding in the Heisenberg-programme extended until 2027. Project: Combinatorial String Solving. Upcoming invited talk (online, December 9th, 2025) in the One World Combinatorics on Words Seminar. Links to preprints of my most recent papers are available on DBLP. Recent Program Committee memberships: Track B of STACS 2026 (co-chair), DLT 2025 (co-chair), CiE 2025. CiE 2026 will take place in Trier, Germany. Research: Interests: String Algorithms and Combinatorics, String Solving, Efficient Algorithms and Data Structures, Automata Theory and Formal Languages, Computability and Complexity Theory, Logic in Computer Science. A relatively updated list of my publications is available on DBLP. Here you can find a relatively up to date list of my co-authors. Invited speaker at the 12th International Workshop on Non-Classical Models of Automata and Applications NCMA 2022; the Workshop on Theory and Practice of String Solving TPSS 2021, affiliated to CAV 2021; the workshop Romanian Algorithms Days 2021; the 5th Logic Mentoring Workshop, LMW 2020 (see video and slides); WORDS 2019 (link to the paper on which my talk was based: Matching Patterns with Variables). Conferences organized in Göttingen: Theorietag 2024: Automaten und Formale Sprachen, Logik in der Informatik und Deduktionssysteme (fall of 2024), DLT 2024 (summer of 2024), NCMA 2024 (summer of 2024), CSL 2022 (online, winter of 2022). Teaching and Supervision: Algorithms on Strings - BSc/MSc lecture, University of Göttingen, Winter Semester. Algorithmen und Datenstrukturen - BSc lecture, University of Göttingen, Winter Semester. Seminar Algorithmen und Datenstrukturen - Seminar, University of Göttingen, Winter Semester. Advanced Topics on Algorithms - BSc/MSc lecture, University of Göttingen, Summer Semester. Theoretische Informatik - BSc lecture, University of Göttingen, Summer Semester. Seminar Theoretische Informatik - Seminar, University of Göttingen, Summer Semester. My group offers supervision for BSc and MSc theses on theoretical computer science topics, but also on applied topics connected to our research areas. Supervised PhDs: Maria Kosche (Summa cum Laude, 2023), Stefan Siemer (Summa cum Laude, 2024), Tore Koß (Summa cum Laude, 2024). See also my mathematics genealogy. I was awarded the Lehrpreis 2020 (Teaching Award) by the CS-students from Göttingen! Curriculum Vitae: University of Göttingen, 2022 - present: W3-Professor (funded by the Heisenberg programme of the DFG) for Theoretical Computer Science. University of Göttingen, 2019 - 2022: W2-Professor for Fundamentals of Computer Science. Kiel University, 2011 - 2019: Researcher (Principal Investigator), DFG funded. University of Magdeburg, 2009 - 2011: Alexander von Humboldt fellow. University of Bucharest, 2004 - 2009: Faculty member; PhD (Summa cum Laude) in December 2007. This page contained previously a series of blog posts, accessible via the Older Posts link below. Posted by Florin Manea Older Posts Home Subscribe to: Comments (Atom) Home Labels Curriculum Vitae (1) About Me Florin Manea I am Professor for Theoretical Computer Science at the Institute of Computer Science, University of Göttingen. This site contains updated information on my research and teaching work. View my complete profile Address: Georg-August Universität Göttingen,Institut für Informatik, Arbeitsgruppe Theoretische Informatik, Goldschmidtstraße 7, 37077 Göttingen, Germany. e-mail: florin.manea(at)informatik(dot)uni-goettingen(dot)de Links Group - Theoretical Computer Science List of papers from the DBLP Bibliography Server Google Scholar page Computer Science in Göttingen Campus-Institut Data Science (CIDAS) - Göttingen Computability in Europe European Association for Computer Science Logic European Association for Theoretical Computer Science Association for Computing Machinery ACM Special Interest Group on Algorithms and Computation Theory",
  "content_length": 4364,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:40"
}