{
  "name": "Florentina Bunea",
  "homepage": "https://bunea.stat.cornell.edu",
  "status": "success",
  "content": "Florentina Bunea | Florentina Bunea Florentina Bunea Professor Statistics And Data Science I am a professor in the Department of Statistics and Data Science, and a member of the Graduate Fields of Statistics, Applied Mathematics, and Computer Science.  As a member of the Diversity and Inclusion Council of the Bowers Computing and Information Science College,  I am committed to promoting the diversity of the work force in data-science disciplines. My research is broadly centered on statistical machine learning theory and high-dimensional statistical inference.  I am interested in developing new methodology accompanied by sharp theory  for solving  a variety of problems in data science.   Recent research projects include  estimation and theory for soft-max mixtures for a foundational understanding of LLM/AI algorithms, optimal transport for  high dimensional mixture distributions,  inference for the Wasserstein distance between sparse mixing measures in topic models, high-dimensional latent-space clustering, cluster-based inference, network modeling, inference in high dimensional models with hidden latent structure and topic models. I continue to be interested in  the general areas of model selection, sparsity and dimension reduction in high dimensions,  and  in applications to genetics, systems immunology, neuroscience, sociology, economics, among other disciplines. My research is funded in part by the National Science Foundation (NSF-DMS). I am a Fellow of the Institute of Mathematical Statistics (IMS) and an IMS  Medallion Award recipient. I have served or am currently serving as an  Associate Editor for  a number of  journals (the Annals of Statistics, Bernoulli, JASA, JRSS-B, EJS, the Annals of Applied Statistics),  and am a co-editor for the Chapman and Hall  Statistics and Applied Probability Monograph Series. My office is 1184 Comstock Hall. Contact Information fb238@cornell.edu (607) 255-8449",
  "content_length": 1932,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:32"
}