{
  "name": "Florian Schäfer",
  "homepage": "https://f-t-s.github.io",
  "status": "success",
  "content": "Florian Schäfer Warren Weaver Hall 409 251 Mercer Street New York, NY 10012 I’m Florian Schäfer, assistant professor at the Courant Institute of Mathematical Sciences at New York University. I received my PhD in applied and computational mathematics at Caltech, working with Houman Owhadi. Before that, I received my Bachelor’s and Master’s degrees in Mathematics at the University of Bonn. You can find a cv here. My research interests lie at the interface of numerical computation, statistical inference, and competitive games. With my students and collaborators, I have developed state-of-the-art solvers for elliptic PDEs by relating Gaussian elimination to conditional independence, efficient algorithms for multi-agent optimization, and information geometric regularization, the first inviscid regularization of compressible fluid dynamics. My work has found applications in materials science, turbulence modeling, computer graphics, and computational geometry. Most recently, it has enabled the first compressible fluid simulation to exceed one quadrillion degrees of freedom. This work is a 2025 Gordon Bell Prize finalist. My current research focus is on developing information geometric mechanics that uses the statistical physical underpinnings of continuum mechanics to design structure preserving numerical methods at the macroscale. I am currently hiring PhD students in this topic. Please have a look here to get an idea. If you have a strong background in computational mathematics, reach out! news Nov 17, 2025 I am attending Supercomputing 2025 in St. Louis! Come see the talk by Spencer Bryngelson and myself presenting our team’s Gordon Bell Finalist Work. It is scheduled on Tuesday 10:52-11:15 in rooms 261-262-265-266. Oct 25, 2025 This Wednesday, I am giving the Numerical Analysis Seminar at Texas A & M! Please reach out if you are there and want to chat! Oct 25, 2025 This Monday, I am giving the Computational an Applied Mathematics Colloquium at Penn State. Thanks to Leonid Beryland for inviting me! Oct 08, 2025 I am attending the Simons Institute Workshop on Linear Systems and Eigenvalue Problems this week! You can find a recording of my talk here. Sep 30, 2025 I gave a talk at the MFEM Seminar (remotely) at LLNL. The recorded talk should soon appear on their website. selected publications Information geometric regularization of the barotropic Euler equation Ruijia Cao and Florian Schäfer 2023 arXiv Blog Sparse recovery of elliptic solvers from matrix-vector products Florian Schäfer and Houman Owhadi SIAM Journal on Scientific Computing, 2024 arXiv Sparse Cholesky factorization by Kullback-Leibler minimization Florian Schäfer, Matthias Katzfuss, and Houman Owhadi SIAM Journal on Scientific Computing, 2021 arXiv Compression, inversion, and approximate PCA of dense kernel matrices at near-linear computational complexity Florian Schäfer, T. J. Sullivan, and Houman Owhadi Multiscale Model. Simul., 2021 DOI arXiv Blog Competitive gradient descent Florian Schäfer and Anima Anandkumar Advances in Neural Information Processing Systems, 2019 arXiv Blog I am best reachable via e-mail.",
  "content_length": 3127,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:37"
}