{
  "name": "Flora Malamateniou",
  "homepage": "https://www.ds.unipi.gr/en/faculty/flora-en",
  "status": "success",
  "content": "Flora Malamateniou - Department of Digital Systems Skip to content Flora Malamateniou Email flora@unipi.gr Title Professor Office Hours - Office - Courses Brief CV Flora Malamateniou is Professor at the Department of Digital Systems of the University of Piraeus, Greece. She has previously worked as a consultant and senior researcher in research centers and has published many papers in international scientific journals, conference proceedings and books on various subjects regarding digital healthcare services. She has been a referee in international scientific journals, conferences and books and has been involved in many Greek and EU-funded R&TD projects. She is a member of national and international scientific associations. Her current research interests include web-based digital healthcare services, pervasive healthcare systems, (personal) electronic health records, health information security and workflow systems. Publications Publications Publications 2014 – 2018 I) JOURNALS Koufi V, Malamateniou F and Vassilacopoulos G: “Towards Clinical and Operational Efficiency through Healthcare Process Analytics”, International Journal of Big Data and Analytics in Healthcare (IJBDAH), (in print, October 2016). Koufi V, Malamateniou F and Vassilacopoulos G: “An agent-oriented, workflow-based mobile framework for implementing interoperable Healthcare Information Systems”, International Journal of Privacy and Health Information Management (IJPHIM), Vol 5, Νο 2, 2016. Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: “Document management mechanism for holistic emergency healthcare”, International Journal of Healthcare Information Systems and Informatics, 9 (2), 1-15, 2014. Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: ‘E-EPR: A workflow-based electronic emergency patient record’, Personal and Ubiquitous Computing, 18 (1), pp.91-100, 2014. Koufi V, Malamateniou F, and Vassilacopoulos G: ‘An Android-Enabled PHR-based System for the Provision of Homecare Services’, International Journal of Measurement Technologies and Instrumentation Engineering (IJMTIE), 3 (2), 1-18, 2013. M. Poylymenopoulou, F. Malamateniou, G. Vassilacopoulos, “Specifying process requirements for holistic care”, Informatics for Health and Social Care, 1-11, 2013. Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: ‘Emergency Healthcare Process Automation Using Mobile Computing and Cloud Services’, Journal of Medical Systems, 36(5):3233-41, 2012. Koufi V, Malamateniou F and Vassilacopoulos G: “An Approach to Participative Personal Health Record System Development”, International Journal of Healthcare Delivery Reform Initiatives, Vol. 2, No. 4, pp.1-16, 2010. Koufi V, Malamateniou F and Vassilacopoulos G. “A System for the Provision of Medical Diagnostic and Treatment Advice in a Home Care Environment”, Personal and Ubiquitous Computing Journal, Vol. 14, No. 6, pp. 551-561, 2010. Papakonstantinou D, Malamateniou F and Vassilacopoulos G: ‘A SOA approach to the implementation of an electronic medical record’, International Journal of Applied Systemic Studies, Vol.3, No. 3, pp. 343-352, 2010. II) CONFERENCES Koufi V, Malamateniou F, Vassilakopoulos G: “An EHR Platform for Realizing Precision Medicine in Emergency Care”, The Third International Conference on Informatics and Assistive Technologies for Health-Care, Medical Support and Wellbeing (HEALTHINFO 2018), October 14, 2018 to October 18, 2018 – Nice, France. Kalamatianou MA,        Malamateniou F, “An Extended UTAUT2 Model for e-Government Project Evaluation”, The Eleventh International Conference on Digital Society and eGovernments, ICDS 2017, March 19 – 23, 2017 – Nice, France. Malamateniou F, Themistocleous M, Prentza A, Papakonstantinou D and Vassilacopoulos G: “A Context-Aware, Capability-based, Role-centric Access Control Model for IoMT”. 6th EAI International Conference on Wireless Mobile Communication and Healthcare (MobiHealth 2016), November 14th-16th, 2016, Milan, Italy. Malamateniou F, Themistocleous M, Prentza A and Vassilacopoulos G: “A Capability-based, Role-centric Access Control Mechanism for IoMT-enhanced, Cloud-based PHRs”. In Proceedings of the European, Mediterranean & Middle Eastern Conference on Information Systems 2016 (EMCIS2016), June 23th – 24th 2016, Krakow, Poland. Karabetsou V and Malamateniou F, Vassilacopoulos G: “Workflow Analytics for Improving Healthcare Learning Processes”. In Proceedings of the European, Mediterranean & Middle Eastern Conference on Information Systems 2016 (EMCIS2016), June 23th – 24th 2016, Krakow, Poland. Karabetsou V and Malamateniou F: “Process-Oriented e-Learning System for Training Healthcare Professionals on Big Data Usage”. In Proceedings of the 9th International Joint Conference on Biomedical Engineering Systems and Technologies (BIOSTEC 2016) – Volume 5: HEALTHINF 2016, pages 523-528. Mikaela Poulymenopoulou, Flora Malamateniou, Andriana Prentza and George Vassilacopoulos, Challenges of Evolving PINCLOUD PHR into a PHR-based Health Analytics System, European Mediterrenean and Middle Eastern Conference on Information Systems 2015 (EMCIS2015), Athens, Greece, June 01-02, 2015. Koufi V, Malamateniou F, Vassilakopoulos G, A Big Data-driven Model for the Optimization of Healthcare Processes, International Conference on Medical Informatics in Europe (MIE 2015), Madrid, Spain, May 27-29, 2015. Papakonstantinou D, M. Poulymenopoulou, , F. Malamateniou, G. Vassilacopoulos Design of a health analytics online program to improve healthcare provider orders, International Conference on Medical Informatics in Europe (MIE 2015), Madrid, Spain, May 27-29, 2015. M. Poulymenopoulou, Papakonstantinou D, F. Malamateniou, G. Vassilacopoulos, A health analytics semantic ETL service for obesity surveillance, International Conference on Medical Informatics in Europe (MIE 2015), Madrid, Spain, May 27-29, 2015. M. Poulymenopoulou, F. Malamateniou, G. Vassilacopoulos, “A LOD-based service for extracting Linked Open Emergency Care Data”, In Proccedings of the International Work- Conference on Bioinforamtics and Biomedical Engineering (IWBBIOI’15), Granada, Spain, April 15-17, 2015. Koumaditis K, Themistocleous M, Vassilacopoulos G, Prentza A, Malamateniou F, Kyriazis D, Pittas G, “Introducing a Patient-Centered e-Health Record Over the Cloud”, The 3rd  International Conference on Data Analytics (DATA ANALYTICS 2014), Rome, Italy, August 24 – 28, 2014. Poulymenopoulou M, Papakonstantinou M, Malamateniou F, Koumaditis K and Vassilacopoulos G, “PINCLOUD II: An Enhanced Cloud-based PHR Service with Healthcare Analytics”, In Proceedings of the European Mediterrenean and Middle Eastern Conference on Information Systems 2014, EMCIS2014, Doha, Quatar, October 27 -28, 2014. Koufi V, Malamateniou F, Katelaris L and Vassilakopoulos G, “PINCLOUD e-prescribing: A cloud-based e-prescribing system”, In Proceedings of the European Mediterrenean and Middle Eastern Conference on Information Systems 2014, EMCIS2014, Doha, Quatar, October 27 -28, 2014. Koufi V, Malamateniou F and Vassilacopoulos G. “Privacy-Preserving Mobile Access to Personal Health Records through Google’s Android”, In Proceedings of the 4th International Conference on Wireless Mobile Communication and Healthcare, (MobiHealth 2014), Athens, Greece, 5-7 November, 2014. M. Poulymenopoulou, F. Malamateniou, G. Vassilacopoulos, A virtual PHR authorization system, In Proccedings of the International Conference on Biomedical and Health Informatics (IEEE BHI’14), pp.73-76, Valencia, Spain,1-4 June, 2014. Koufi V, Malamateniou F, Tsohou A and Vassilacopoulos G: “A Framework for privacy-preserving access to next generation EHRs”, In Proceedings of the 25th International Conference of the European Federation for Medical Informatics, (MIE’2014), Istanbul, August 31st – September 3rd, 2014. Papakonstantinou D, Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: “Designing a competency-based MOOC to facilitate EMR usage”, In Proceedings of the 25th International Conference of the European Federation for Medical Informatics, (MIE’2014), Istanbul, August 31st – September 3rd, 2014. Poulymenopoulou M, Papakonstantinou D, Malamateniou F and Vassilacopoulos G: “Adaptive Healthcare Processes for Personalized Emergency Clinical Pathways”, In Proceedings of the 25th International Conference of the European Federation for Medical Informatics, (MIE’2014), Istanbul, August 31st – September 3rd, 2014. Koufi V, Malamateniou F, Prentza A and Vassilacopoulos G: ‘A Framework for privacy-preserving classification of next generation PHR data’, In Proceedings of the International Conference on Informatics, Management and Technology in Healthcare (ICIMTH 2014), Athens, Greece, July 10 -13, 2014. Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: “Machine Learning for Knowledge Extraction from PHR Big Data”, In Proceedings of the International Conference on Informatics, Management and Technology in Healthcare (ICIMTH 2014), Athens, 10-13 July 2014. Koumaditis K, Themistocleous M, Vassilacopoulos G, Prentza A, Kyriazis D, Malamateniou F, Maglaveras N, Chouvarda I, Mourouzis A. Patient-Centered e-Health Record over the Cloud, In Proceedings of the International Conference on Informatics, Management and Technology in Healthcare (ICIMTH 2014), Athens, 10-13 July 2014. Koufi V, Malamateniou F and Vassilacopoulos G: ‘Ontology-driven Interoperable Virtual PHRs’, Med-e-Tel 2014, Luxembourg, April 9-11, 2014. Malamateniou F, Koufi V and Vassilacopoulos G: ‘Smarter EMSs within Smarter Healthcare Territories’, Proceedings, International Conference on Applied Business and Economics (ICABE 2013), New York, USA, October 2-4, 2013. Koufi V, Malamateniou F and Vassilacopoulos G: ‘Preserving patient privacy within a smarter city environment’, Proceedings, International Conference on Applied Business and Economics (ICABE 2013), New York, USA, October 2-4, 2013. Koufi V, Malamateniou F, Prentza A and Vassilacopoulos G: ‘Android-based Access",
  "content_length": 22525,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:31"
}