{
  "name": "Florian Kerschbaum",
  "homepage": "https://cs.uwaterloo.ca/~fkerschb",
  "status": "success",
  "content": "Florian Kerschbaum Florian Kerschbaum Contact University of Waterloo David R. Cheriton School of Computer Science 200 University Ave W Waterloo, ON N2L 3G1 Canada Office: DC 3524 Email: florian.kerschbaum@uwaterloo.ca Note that I use strict spam filtering (due to a huge amount of spam) and if you think your email did not reach me, please use alternative means to contact me. About me I am a professor in the David R. Cheriton School of Computer Science at the University of Waterloo (joined in 2017), a member of the CrySP group, and NSERC/RBC chair in data security (since 2019). Before I worked as chief research expert at SAP in Karlsruhe (2005 – 2016) and as a software architect at Arxan Technologies in San Francisco (2002 – 2004). I hold a Ph.D. in computer science from the Karlsruhe Institute of Technology (2010) and a master's degree from Purdue University (2000). I served as the inaugural director of the Waterloo Cybersecurity and Privacy Institute (2018 – 2021). I am an ACM Distinguished Scientist (2019), a winner of the Outstanding Young Computer Science Researcher Award from CS-Can/Info-Can (2019) and a winner of the Faculty of Math Golden Jubilee Research Excellence Award (2022). I am interested in security and privacy in the entire data science lifecycle. I extend real-world systems with cryptographic security mechanisms to achieve (some) provable security guarantees. My work is used in several business applications. Software Projects AON-PRISMA: All-Or-Nothing Private Similarity Matching Awards Faculty of Math Golden Jubilee Research Excellence Award (2022) NSERC/RBC Chair in Data Security (2019) CS-Can/Info-Can Outstanding Young Computer Scientists (2019) ACM Distinguished Scientist (2019) NSERC Discovery Accelerator Supplement (2017) Students Note to applicants: I am looking for highly qualified graduate students excited to work on security and privacy in data science. Please apply directly to the CS program and list me as an intended supervisor. Do not send me email to review your application. I cannot guarantee admission. The only way to find out is to apply. All admitted applicants will be fully funded. If you still have questions, please see this information. If you want to nevertheless contact only me directly, please use \"UWaterloo Graduate Application 2025\" in the subject line. An answer is not guaranteed. University of Waterloo Abdelkarim Kati (postdoc) Hao Wu (postdoc) Rasoul Akhavan Mahdavi (PhD) Thomas Humphries (PhD) Abdulrahman Diaa (PhD) Lucas Fenaux (PhD) John Premkumar (research associate) Faezeh Ebrahimianghazani (research associate) Onur Arpaci (research associate) Zahra Manochehri (Masters) Haoyan Ni (Masters) Amir David (Masters) Steven Lee (Masters) Benjamin Schneider (Masters) Mohannad Shehata (Masters) Alumni Ruidi Wei (MMath at Waterloo, 2025) Onur Arpaci (MMath at Waterloo, 2024) Nils Lukas (PhD at Waterloo, 2024) Lucas Fenaux (MMath at Waterloo, 2024) Benjamin Weggenmann (co-advisor: Ralf Küsters) PhD at University of Stuttgart (2023) Abdulrahman Diaa (MMath at Waterloo, 2023) Bailey Kacsmar (PhD at Waterloo, 2023) Simon Oya (postdoc at Waterloo, 2023) Faezeh Ebrahimianghazani (MMath at Waterloo, 2023) Sina Faraji (MMath at Waterloo, 2022) Dr. Daniel Bernau (co-advisor: Ralf Küsters) PhD at University of Stuttgart (2022) Marian Dietz (MMath at Waterloo, 2022) Emily Lepert (MMath at Waterloo, 2022) John Premkumar (MMath at Waterloo, 2022) Xinda Li (MMath at Waterloo, 2022) Thomas Humphries (MMath at Waterloo, 2021) Dr. Jonas Böhler (co-advisor: Jörn Müller-Quade) PhD at Karlsruhe Institute of Technology (2021) Awarded ERCIM STM Dissertation Award Rasoul Akhavan Mahdavi (MMath at Waterloo, 2021) Masoumeh Shafieinejad (PhD at Waterloo, 2021) Dr. Andreas Fischer (co-advisor: Eric Bodden) PhD at University of Paderborn (2021) Dr. Benny Fuhry (co-advisor: Frederik Armknecht) PhD at University of Mannheim (2021) Simeon Krastnikov (MMath at Waterloo, 2020; co-advisor: Douglas Stebila) Dr. Anselme Tueno (co-advisor: Stefan Katzenbeisser) PhD at University of Passau (2020) Zhiwei Shang (MMath at Waterloo, 2019) Dr. Maryam Sepehri (postdoc at Waterloo, 2019) Yaser Baseri, PhD (postdoc at Waterloo, 2019) Basit Khurram (MMath at Waterloo, 2019) Alexander Norton (MMath at Waterloo, 2019) Dr. Florian Hahn (co-advisor: Jörn Müller-Quade) PhD at Karlsruhe Institute of Technology (2018) Dr. Marek Jawurek (co-advisor: Felix Freiling) PhD at Universität Erlangen-Nürnberg (2013) Awarded ACM SIGSAC Dissertation Award Dr. Axel Schröpfer (co-advisor: Günter Müller) PhD at Universität Freiburg (2012) Teaching and Professional Training University of Waterloo Winter 2026: CS459 Privacy, Cryptography, Network and Data Security Winter 2025: CS858 Security & Privacy in Machine Learning Winter 2022: CS858 Security & Privacy in Data Science Fall 2020: CS458/658 Computer Security & Privacy Fall 2019: CS858 Advanced Topics in Security and Privacy for AI and Machine Learning Fall 2018: CS458/658 Computer Security & Privacy Winter 2018: CS338 Computer Applications in Business: Databases Fall 2017: CS848 Topics in Encryption in Databases, Artificial Intelligence and Distributed Systems Winter 2017: CS458/CS658 Computer Security & Privacy Publications See DBLP for a fairly complete list. See Google Scholar for citations. See ACM DL, IEEE Xplore and SpringerLink for electronic copies. See Google Patents for patents. See IACR ePrint and arXiv for technical reports. Here are some missing pre-prints: Onur Arpaci, Florian Kerschbaum, Raouf Boutaba. Over-Threshold Multiparty Private Set Intersection for Collaborative Network Intrusion Detection 23rd USENIX Symposium on Networked Systems Design and Implementation (NSDI), 2026. Abdulrahman Diaa, Thomas Humphries, Florian Kerschbaum. FastLloyd: Federated, Accurate, Secure, and Tunable k-Means Clustering with Differential Privacy 34th USENIX Security Symposium (USENIX Security), 2025. Selected Service Steering Committee ACM SACMAT PETS (until 2025) General (co-)chair ACM SACMAT 2019 PC (co-)chair PETS 2021, 2022 IFIP DBSEC 2018 ACM SACMAT 2015, 2016 ACM CCSW 2015 Program committee 2027: SIGMOD 2026: S&P, SIGMOD 2025: S&P 2024: WWW (senior member), S&P, SIGMOD, SaTML 2023: WWW (senior member), AAAI, ICML, S&P, SIGMOD, USENIX Security, SaTML 2022: WWW (senior member), AAAI, CCS, ICML, NeurIPS, USENIX Security 2021: ICDE (vice chair), WWW (senior member), USENIX Security 2020: ICDE, FC, PETS 2019: ICDE, WWW, ACSAC, CT-RSA, DBSEC, FC, PETS, WPES 2018: ICDE, ACSAC, ICDCS, ASIACCS, CT-RSA, PETS, WPES 2017: ICDE, VLDB, DBSEC, ESORICS, ICDCS, ASIACCS, CCSW, WPES Recent Keynotes, Invited Talks and Panels at Academic Conferences Design Automation Conference (DAC), 2020. Panel: From AI-Phoria to AI-Phobia: Is Security & Privacy the Achilles Verse of AI? International Workshop on Policy-based Autonomic Data Governance (PADG), 2018. Keynote: On Policies, Authentication and Privacy in Large Networks of Cyber-Physical Objects ACM Cloud Computing Security Workshop (CCSW), 2017. Keynote: Building Secure Applications Using Intel's SGX International Symposium on Foundations & Practice of Security (FPS), 2017. Keynote: Building Secure Applications Using Intel's SGX IEEE Workshop on Security and Privacy in the Cloud (SPC), 2016. Keynote: On Leaking Encryption IFIP WG 11.3 Working Conference on Data and Applications Security and Privacy (DBSEC), 2016. Keynote: On Leaking Encryption International Conference on Financial Cryptography and Data Security (FC), 2016. Panel: The Promises and Pitfalls of Distributed Consensus Systems: From Contract Signing to Cryptocurrencies International Conference on Information Systems Security (ICISS), 2013. Keynote: An Encrypted In-Memory Column-Store International Conference on Trusted Systems (InTrust) and European Trusted Infrastructure and Systems School (ETISS), 2013. Invited Talk: Encrypted Cloud Databases ACM Symposium on Access Control Models and Technology (SACMAT), 2013. Keynote: Searching over Encrypted Data in Cloud Systems Funding University of Waterloo Research Tools and Instruments Grant (NSERC 2021) Industrial Research Chair (NSERC/RBC 2019-2024) Collaborative Research and Development Grant (NSERC 2019-2021) Royal Bank of Canada (RBC) Discovery Supplement (NSERC/DND 2018-2020) Discovery Accelerator Supplement (NSERC 2017-2020) Discovery Grant (NSERC 2017-2022)",
  "content_length": 8383,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:35"
}