{
  "name": "Floris Geerts",
  "homepage": "https://www.uantwerpen.be/en/staff/floris-geerts",
  "status": "success",
  "content": "About Floris Geerts | Floris Geerts | University of Antwerp Campus Middelheim Show email address Tel. +3232653907 Middelheimlaan 1 2020 Antwerpen, BEL DepartmentDepartment of Computer ScienceStatute & functionsZelfstandig academisch pers.professorInternal mandatesbestuursorgaan bestuursmandaatBureau Onderwijscommissie Informatica (ondervoorzitter)Departementsraad Informatica (effectief stemgerechtigd lid)Faculteitsraad Faculteit Wetenschappen (plaatsvervangend stemgerechtigd lid)Faculteitsvergadering Faculteit Wetenschappen (effectief stemgerechtigd lid)Onderwijscommissie Informatica (ondervoorzitter)expertenorgaan expertenmandaatLeescommissie I (effectief stemgerechtigd lid) The University of Antwerp website uses cookies and similar technologies to ensure the basic functionality of the site and for statistical and optimisation purposes. It also uses cookies to display content such as YouTube videos and for marketing purposes. This last category consists of tracking cookies: these make it possible for your online behaviour to be tracked. You consent to this by clicking on Accept. Also read our Privacy statement Strictly necessary cookies They are necessary for the proper functioning of the website and can not be switched off. They are generally defined only as a result of actions you carry out and that enable you to make use of the services we offer (definition of your privacy preferences, connection, filling in forms, etc.). You can configure your browser so that these cookies are blocked or you are warned about these cookies, but then some parts of the site will no longer work. Statistical cookies They allow us to measure surfing patterns and determine which sections of our website were visited, and to measure habits and improve our services. They show us which pages are the most and the least popular and how visitors move around the site. If you do not allow these cookies, we do not know when you visited our site and we can not check their habits. Personalization cookies They enable improved functionality and customization of the site. They can be activated by us or by third parties whose services we have added to our pages. If you do not allow these cookies, some or all of the services may not work properly. Targeted cookies They can be set up by our advertising partners on our site to build a profile of your interests and show you relevant ads on other sites. They do not store personal information directly, but are based on the unique identification of your browser and device. If you do not allow these cookies, you will see less targeted ads.",
  "content_length": 2593,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:43"
}