{
  "name": "Florian Mueller 0001",
  "homepage": "https://research.monash.edu/en/persons/floyd-mueller",
  "status": "success",
  "content": "Floyd Mueller - Monash University View Scopus Profile Floyd Mueller Professor Professor, Department of Human Centred Computing https://orcid.org/0000-0001-6472-3476 EmailFlorian.Floyd.Muellermonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 20002025 Research activity per year Personal profile Research interestsHuman-Computer Interaction, Interaction Design, Game and Play DesignBiographyFlorian 'Floyd' Mueller (also: Florian Müller, Florian Mueller) is a human-computer interaction (HCI), interaction design, computer science as well as play and games researcher and educator. He is currently the director of the award-winning Exertion Games Lab and full Professor of Future Interfaces at Monash University in Melbourne, Australia. The Exertion Games Lab investigates the design of exertion interfaces and games, inventing the future of bodily play, while also researching the intersection of technology, the human body and play more broadly. Floyd’s research is situated within an interaction design agenda that supports people’s values such as an active life. Prior to Monash, Floyd worked at RMIT and the University of Melbourne and was a principal scientist at the Australian Commonwealth Scientific and Industrial Research Organization (CSIRO), where he led the Connecting People research group. Floyd also directed the Centre for Game Design Research at RMIT University, the largest game design centre in Australia to investigate “Game Design” through an HCI lens. Floyd has been a Fulbright Visiting Scholar at Stanford University, having worked on the topic of bodily interfaces across four continents, including at organizations such as the MIT Media Lab, Media Lab Europe, Fuji-Xerox Palo Alto Laboratories (FXPal) and Xerox Parc. Floyd has also been a Microsoft Research Asia Fellow and has worked at the Microsoft Beijing lab with the research teams developing Xbox Kinect. Floyd’s contributions have been recognized by others, for example, he is an inaugural honouree of the Australian Design Centre’s Australian Design Honours. Floyd has also received some of Australia’s largest grants for an individual (Australian Research Council Discovery Project & Linkage) and has been listed in the top 100 most productive HCI researchers. Floyd’s games were commissioned by Wired's Nextfest and featured on the BBC, ABC, Discovery Science Channel and New Scientist, winning a “Media Star Award”. Floyd has written over 250 publications, mostly from the premier publication outlets in the field of human-computer interaction such as CHI, CHI PLAY, DIS, TEI, Ubicomp (IMWUT), UIST as well as ToCHI and IJHCS. He received 9 “Best Paper Honorable Mentions Top 5%” (5x CHI, 2x DIS, 2x CHI PLAY) and 2 “Best Paper Top 1%” at CHI PLAY and CHI. http://exertiongameslab.orgCommunity serviceFloyd is associate editor for IMWUT and IJHCS and co-established the first CHI Sub-Committee on “Games and Play” as well as the CHI PLAY conference series. He was selected to be general co-chair for CHI PLAY’18 and then CHI’20, the highest-ranked publication outlet in HCI.  Supervision interestsSee Exertion Games Lab and Supervisor Connect and email if interested. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationInteraction Design, Doctor of Philosophy, University of MelbourneAward Date: 30 Jun 2011Media Arts and Sciences, Master of Science, Massachusetts Institute of TechnologyAward Date: 18 Sept 2002Mediainformatics, Diplom-Informatiker (Medieninformatik), Hochschule Furtwangen (Furtwangen University)Award Date: 22 Mar 2000Multimedia, Bachelor of Science, Griffith UniversityAward Date: 15 Apr 1999 Research area keywordsHuman-Computer InteractionInteraction DesignGamesPlayMixed-RealityAugmented RealityVirtual RealityWearable ComputingQuadcoptersDronesBodily InteractionsBody-Centric ComputingDesignPhenomenologyUser StudiesQualitative ResearchDesign EthnographyAutoethnographyResearch Through DesignDesign Research Projects Projects per year 2021 2021 2023 2026 2 Active Projects per year Advancing Australia’s hospitality industry through interactive foodMueller, F. (Primary Chief Investigator (PCI)) & Bascetta, M. (Partner Investigator (PI))1/01/23 → 31/12/26Project: Research Designing digital aquatic play to foster Australians' engagement with waterMueller, F. (Primary Chief Investigator (PCI)) & Pell, S. J. (Chief Investigator (CI))18/06/21 → 31/12/26Project: Research Research output Research output per year 2000 2013 2014 2015 2016 2018 2020 2021 2022 2023 2024 2025 2025 245 Conference Paper 44 Article 9 Chapter (Book) 7 Foreword / Postscript 3 More 2 Other Report 1 Editorial Research output per year Research output per year BreathCrunch and BellyBreath: Exploring EMS-based Breath Guidance and Enforcement for Meditation and Runningvan Rheden, V., Liu, S., Luo, H., Elvitigala, D. S. & Mueller, F. '., 2025, Extended Abstracts of the 2025 CHI Conference on Human Factors in Computing Systems. Yatani, K. & Ding, X. (eds.). New York NY USA: Association for Computing Machinery (ACM), 5 p. 702Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other 1 Citation (Scopus) Flytrap Hand: Towards Understanding Dark Patterns of Physical Augmentation via Electrical Muscle StimulationLiu, S., Ens, B., Semertzidis, N. A., Lee, G. A., Mueller, F. '. & Elvitigala, D. S., 2025, Extended Abstracts of the 2025 CHI Conference on Human Factors in Computing Systems. Yatani, K. & Ding, X. (eds.). New York NY USA: Association for Computing Machinery (ACM), 2 p. 913Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other 1 Citation (Scopus) GastroConcerto: Towards Designing Auditory Dining System to Enrich Chefs’ Culinary PracticesWang, H., Deng, J., Kong, D., Fang, Z., Luo, H., Pasumarthy, N., Patibanda, R., Abewickrema, S., Fang, X. Z., Elvitigala, D. S. & Mueller, F., 2025, Extended Abstracts of the 2025 CHI Conference on Human Factors in Computing Systems. Yatani, K. & Ding, X. (eds.). New York NY USA: Association for Computing Machinery (ACM), 8 p. 298Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review GestureSock: Exploring toe gestures as alternative input methodvan Rheden, V., Abewickrema, S., Mueller, F. & Elvitigala, D. S., 2025, Extended Abstracts of the 2025 CHI Conference on Human Factors in Computing Systems. Yatani, K. & Ding, X. (eds.). New York NY USA: Association for Computing Machinery (ACM), 2 p. 914Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other GestureSock: Exploring toe gestures as alternative input methodvan Rheden, V., Abewickrema, S., Mueller, F. '. & Elvitigala, D. S., 2025, Extended Abstracts of the 2025 CHI Conference on Human Factors in Computing Systems. Yatani, K. & Ding, X. (eds.). New York NY USA: Association for Computing Machinery (ACM), 5 p. 731Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other View all 308 research outputs Activities Activities per year 2022 2022 2022 1 Contribution to conference Activities per year Splash! Identifying the Grand Challenges for WaterHCIPell, S. J. (Invited speaker), Clashing Oreilly, C. A. (Organiser), Montoya Vega, M. F. (Organiser), Smith, I. (Organiser), Marshall, J. (Organiser), Oppermann, L. (Organiser), Dietz, P. H. (Organiser), Blythe, M. (Organiser), Bateman, S. (Organiser), Pell, S. J. (Organiser), Swaminathan, S. (Organiser) & Mueller, F. (Organiser)13 Apr 2022Activity: Participating in or organising an event types › Contribution to conference",
  "content_length": 7929,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:36"
}