{
  "name": "Florian Shkurti",
  "homepage": "http://www.cs.toronto.edu/~florian",
  "status": "success",
  "content": "Florian Shkurti Robot Vision & Learning (RVL) lab Students | Publications | Teaching CV | Google Scholar | Github | Twitter x@cs.toronto.edu, x=florian (Mailing Address, UTM Campus) 3359 Mississauga Road Deerfield Hall, Office 3066 Mathematical & Computational Sciences University of Toronto Mississauga Mississauga, ON, L5L 1C6 (Mailing Address, St George Campus) 10 King's College Road Sandford Fleming Building, Office SF 3328 Department of Computer Science University of Toronto Toronto, ON, M5S 3G4 Department of Computer Science UofT Robotics Institute Vector Institute Acceleration Consortium Florian Shkurti Assistant Professor, Computer Science Department of Computer Science, UTM, University of Toronto Faculty Member, UofT Robotics Institute Faculty Member, Vector Institute Faculty Member, Acceleration Consortium Visiting Research Scientist, Ai2 I direct the Robot Vision and Learning (RVL) lab at the University of Toronto. I am part of the Robotics Group at the Department of Computer Science. In 2025-2026 I will be doing a sabbatical year at Ai2 in Seattle, in Dieter Fox's robotics group. My research centers around robotics and spans machine learning, perception, planning and control. My group and I develop methods and systems that enable robots to perceive, reason, and act effectively and safely, particularly in dynamic environments and alongside humans. I want to enable people to effectively specify the desired task and behavior of their robots, without requiring them to write code. I also strive to provide safety guarantees during the robot learning process and beyond, during deployment. Application areas of my research include manipulation for chemistry and biology lab automation, field robotics for environmental monitoring. I am interested in the following topics: Reasoning and learning for robotics Imitation learning Reinforcement learning Inverse reinforcement learning Planning and control under uncertainty Learning-based task and motion planning Continual learning Active perception and information gathering Shared autonomy Safety guarantees during robot learning and deployment Safe exploration in reinforcement learning Physically-realizable adversarial simulation scenarios Rare event generation Risk estimation and uncertainty quantification Policy evaluation 3D perception and generative models for simulation Open-world semantic mapping Learning manipulation skills from videos Dynamics models for RGB and pointclouds Data-driven sensor simulation Differentiable physics and rendering simulators Application Area #1: robotics for chemistry and biology lab automation Robot manipulation Long-horizon planning Manipulation of liquids, powders, and granular media Multi-robot coordination and planning Optimal experiment design Application Area #2: field robotics and environmental monitoring Visual attention and informed visual search Video and sensor data summarization Marine robotics Publications See our publications on our lab's website or on google scholar Students An up-to-date list of my students and lab alumni can be found on my lab's website. Joining my group Please follow the instructions on my lab's website. [2025-2026] I am looking for postdocs, PhD, MSc students with computer science or engineering backgrounds, who have experience in robot learning or computer vision. Feel free to email me with your CV, unofficial transcript, and research interests. Prospective graduate students should apply through CS. Teaching CSC2626: Imitation Learning for Robotics, Fall 2024 CSC413: Neural Networks and Deep Learning, Fall 2024 CSC477 / CSC2630: Introduction to Mobile Robotics, Winter 2024 CSC413: Neural Networks and Deep Learning, Fall 2023 CSC2626: Imitation Learning for Robotics, Fall 2022 CSC477 / CSC2630: Introduction to Mobile Robotics, Fall 2022 CSC477: Introduction to Mobile Robotics, Fall 2021 CSC413: Neural Networks and Deep Learning, Winter 2021 CSC2626: Imitation Learning for Robotics, Winter 2021 CSC477: Introduction to Mobile Robotics, Fall 2020 CSC2621: Imitation Learning for Robotics, Winter 2019 CSC477: Introduction to Mobile Robotics, Fall 2019",
  "content_length": 4134,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:38"
}