{
  "name": "Florian Tschorsch",
  "homepage": "https://tu-dresden.de/ing/informatik/sya/ps/chair/tschorsch",
  "status": "success",
  "content": "Prof. Dr. Florian Tschorsch — Professur für Privacy and Security — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen © Noak Lehrstuhlinhaber Name Prof. Dr. Florian Tschorsch Lehrstuhl für Privacy and Security E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3071 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. Sprechzeiten: Auf Anfrage Bitte beachten Sie, dass weitere und aktuelle Informationen ausschließlich auf der englischen Version dieser Seite verfügbar sind. seit 2023 Professor für Privacy and Security (ehem. Datenschutz und Datensicherheit), Technische Universität Dresden 2021 bis 2023 Gastprofessor an der Humboldt-Universität zu Berlin, Leitung des Lehrstuhls für Technische Informatik 2017 bis 2023 Professor am Einstein Center Digital Future (ECDF) und Vorstandsmitglied (2017/18) 2017 bis 2023 Juniorprofessor für das Fachgebiet Distributed Security Infrastructures, Technische Universität Berlin 2016 Promotion (Dr. rer. nat.) in Informatik, Humboldt-Universität zu Berlin 2011 bis 2017 Wissenschaftlicher Mitarbeiter an der HHU Düsseldorf, Universität Würzburg, Universität Bonn und HU Berlin 2006 bis 2010 Studium der Informatik (Bachelor und Master; Nebenfach: Medien- und Kulturwissenschaften), Heinrich-Heine-Universität Düsseldorf Publikationen Eine chronologische Übersicht meiner wissenschaftlichen Publikationen in der Informatik finden sich unter https://dblp.org/pid/82/9385 Zu dieser Seite Florian Tschorsch Letzte Änderung: 06.11.2025 Diese Seite … … auf Facebook teilen … auf Twitter/X teilen … drucken … als E-Mail versenden",
  "content_length": 1780,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:40"
}