{
  "name": "Florent Krzakala",
  "homepage": "https://people.epfl.ch/florent.krzakala",
  "status": "success",
  "content": "EPFL - Florent Krzakala Données administratives Florent Krzakala florent.krzakala@epfl.ch +41 21 693 31 87 http://florentkrzakala.com vCard Professeur ordinaire, Laboratoire information, apprentissage & physique (STI/SB) EPFL STI IEM IDEPHICS1ELD 239 (Bâtiment ELD)Station 111015 Lausanne +41 21 693 31 87 Office: ELD 239 EPFL › STI › IEM › IDEPHICS1 Professeur ordinaire, Laboratoire information, apprentissage & physique (SB/STI) EPFL STI IEM IDEPHICS1ELD 239 (Bâtiment ELD)Station 111015 Lausanne +41 21 693 31 15 +41 21 693 31 87 Office: ELD 239 EPFL › SB › IPHYS › IDEPHICS2 Site web: https://www.epfl.ch/labs/idephics/ Professeur ordinaire, SPH - Enseignement EPFL STI IEM IDEPHICS1ELD 239 (Bâtiment ELD)Station 111015 Lausanne +41 21 693 31 87 Office: ELD 239 EPFL › SB › SB-SPH › SPH-ENS Site web: https://sph.epfl.ch/ Professeur ordinaire, SEL - Enseignement EPFL STI IEM IDEPHICS1ELD 239 (Bâtiment ELD)Station 111015 Lausanne +41 21 693 31 87 Office: ELD 239 EPFL › STI › STI-SEL › SEL-ENS Professeur ordinaire, EDPY - Enseignement EPFL STI IEM IDEPHICS1ELD 239 (Bâtiment ELD)Station 111015 Lausanne +41 21 693 31 87 Office: ELD 239 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDPY-ENS Enseignement et PhD Enseignement et PhD Current Phd Jivan Waber, Luca Pesce, Yizhou Xu, Emanuele Francazi, Yatin Dandi, Matteo Vilucchio, Luca Arnaboldi, Hugo Jules Tabanelli Past Phd As Director Davide Ghio Courses Fundamentals of inference and learning EE-411 Un cours d'introduction à l'inference statistique et au machine learning (Apprentissage automatique), insistant à la fois sur la compréhension théorique mathématique, ainsi que sur des exercices pratiques. Le cours alternera entre les fondements théoriques et les applications pratiques en python. Physique statistique PHYS-338 Ce cours introduit les principes fondamentaux de la physique statistique, l'une des théories les plus fondamentales de la physique moderne. Statistical physics for optimization & learning PHYS-642 Back to top",
  "content_length": 1992,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:47"
}