{
  "name": "Florian Michahelles",
  "homepage": "https://informatics.tuwien.ac.at/people/florian-michahelles",
  "status": "success",
  "content": "Florian Michahelles — TU Wien Informatics People Overview Professors Scientific Staff Administrative Staff Student Staff External Lecturers By Responsibilities By Committee By Name Related Guest Professors Honoraries Alumni (LinkedIn) #5qw Florian Michahelles Univ.Prof. Dipl.-Inf. Dr.sc.techn. Research Focus Information Systems Engineering: 20% Visual Computing and Human-Centered Technology: 80% Research Areas Digital Companion, Entrepreneurship, Internet of Things, Human-centered AI, Ubiquous computing, Digitization, Industry 4.0 About My name is Florian Michahelles. I have joined TU Wien as a full professor for ubiquitous computing. I investigate how we can apply technology to support humans in their tasks and activities while keeping the human user in control. How can we wrap computing capabilities into proactive services, how can we leverage AI to free users from routine and mundane tasks, and let them focus on what we humans are best at: creativity, problem solving, critical thinking, and social collaboration. Roles Full Professor Artifact-based Computing and User Research, E193-04 Curriculum Commission for Informatics Principal Member Curriculum Coordinator Bachelor / Specialization / Human-Centered Computing Contact florian.michahelles@tuwien.ac.at +43-1-58801-193416 Favoritenstrasse 11, Room HE0209 vCard from TISS Artefact-based Design and User Research orcid.org/0000-0003-1486-0688 informatics.tuwien.ac.at/people/florian-michahelles tiss.tuwien.ac.at/person/333566 Courses 2025W Artifact-based Design / 193.161 / VU Bachelor Thesis for Informatics and Business Informatics / 187.A99 / PR Design and Fabrication / 193.132 / VU Human-Centered AI / 193.162 / VU Orientation Informatics and Business Informatics / 180.766 / VU Project in Computer Science 1 / 193.117 / PR Project in Computer Science 2 / 193.118 / PR Scientific Research and Writing / 193.052 / SE Seminar for PhD Students / 187.A72 / SE 2026S Seminar for PhD Students / 187.A72 / SE Projects AIM: Multimodal Intent Communication of Autonomous Systems 2025 – 2027 / Austrian Science Fund (FWF) STARTS 2025 – 2026 / EU-Kommission DG-XII ERIKA - Die digitale Begleiterin für klimabewusstes Handeln im Alltag 2024 – 2026 / Arbeiterkammer Niederösterreich Eternity Bike -Evaluierung des Nutzerpotentials eines teilautomatisierten Fahrrades 2022 – 2023 / Austrian Research Promotion Agency (FFG) AI Facility Manager 2021 / Siemens AG Österreich Publications 2025 Impact of Time Discrepancies on Machine Learning Performance for Multi-Wearable Human Activity Recognition / Wolling, F., Kostolani, D., Trollmann, P., & Michahelles, F. (2025). Impact of Time Discrepancies on Machine Learning Performance for Multi-Wearable Human Activity Recognition. In ISWC ’25: Proceedings of the 2025 ACM International Symposium on Wearable Computers (pp. 98–105). https://doi.org/10.1145/3715071.3750419 From Street to Simulator: Assessing Cyclist Movement Consistency Between Virtual and Real-World Environments / Pöhler, J., Vitt, A., Wolling, F., Michahelles, F., & Van Laerhoven, K. (2025). From Street to Simulator: Assessing Cyclist Movement Consistency Between Virtual and Real-World Environments. In ISWC ’25: Proceedings of the 2025 ACM International Symposium on Wearable Computers (pp. 203–206). https://doi.org/10.1145/3715071.3750432 Embroidered Driven Shields for Robust Textile Touch Interfaces / Aigner, R., Wolling, F., & Michahelles, F. (2025). Embroidered Driven Shields for Robust Textile Touch Interfaces. IEEE Journal on Flexible Electronics. https://doi.org/10.1109/JFLEX.2025.3571382 Smart Trash Can: Image Classification and Segmentation for Waste Quality Management in the Home / Wolling, F., Gabor Pal, Larcher, L., & Michahelles, F. (2025). Smart Trash Can: Image Classification and Segmentation for Waste Quality Management in the Home. In IoT ’24: Proceedings of the 14th International Conference on the Internet of Things (pp. 65–71). Association for Computing Machinery. https://doi.org/10.1145/3703790.3703798 The Power Play: AI Agents, Digital Twins, and the Energy Hustle / Pirttikangas, S., & Michahelles, F. (2025). The Power Play: AI Agents, Digital Twins, and the Energy Hustle. IEEE Pervasive Computing, 24(1), 8–9. https://doi.org/10.1109/MPRV.2025.3555053 2024 JumpMetric: Assessment of Fiducial Positions for Vertical Jump Height Estimation from Depth Cameras and Wearable Sensors / Kügler, C., Trollmann, P., Wolling, F., & Michahelles, F. (2024). JumpMetric: Assessment of Fiducial Positions for Vertical Jump Height Estimation from Depth Cameras and Wearable Sensors. In A. Matviienko, J. Niess, & T. Kosch (Eds.), MUM ’24: Proceedings of the 23rd International Conference on Mobile and Ubiquitous Multimedia (pp. 419–431). Association for Computing Machinery. https://doi.org/10.1145/3701571.3701607 Urban-Engage: Pioneering Urban Planning with Citizen-Driven 15-Minute City Solutions / Michahelles, F., Riener, A., Grundel, I., Boztepe, S., Trygg, K., Israel, H., Pfleging, B., Veenstra, M., & Wintersberger, P. (2024). Urban-Engage: Pioneering Urban Planning with Citizen-Driven 15-Minute City Solutions. In Workshopband MuC 2024. Mensch und Computer 2024, Karlsruhe, Germany. Gesellschaft für Informatik e.V. https://doi.org/10.18420/muc2024-mci-ws16-393 Download: PDF (972 KB) Beyond Screen Time: Exploring Smartwatch Interventions for Digital Well-Being / Shahu, A., Pechstein, F., & Michahelles, F. (2024). Beyond Screen Time: Exploring Smartwatch Interventions for Digital Well-Being. In Proceedings of Mensch und Computer 2024 (pp. 83–98). Association for Computing Machinery. https://doi.org/10.1145/3670653.3670674 Download: PDF (4.66 MB) Push Me: Evaluating Usability and User Experience in Nudge-based Human-Robot Interaction through Embedded Force and Torque Sensors / Kassem, K., Saad, A., Pascher, M., Schett, M., & Michahelles, F. (2024). Push Me: Evaluating Usability and User Experience in Nudge-based Human-Robot Interaction through Embedded Force and Torque Sensors. In MuC ’24: Proceedings of Mensch und Computer 2024 (pp. 399–407). https://doi.org/10.1145/3670653.3677487 TipTopTyping: A Thumb-to-Finger Text Input Method and Character Layout Optimized for Mobile Spatial Computing / Beier, R., Wolling, F., Hornecker, E., & Michahelles, F. (2024). TipTopTyping: A Thumb-to-Finger Text Input Method and Character Layout Optimized for Mobile Spatial Computing. In Proceedings of Mensch und Computer 2024 (pp. 196–206). Association for Computing Machinery. https://doi.org/10.1145/3670653.3670669 How can we become more human by AI/IoT... / Michahelles, F. (2024, March 12). How can we become more human by AI/IoT... [Keynote Presentation]. DFG SPP 2911 winter school, Mürren, Switzerland. http://hdl.handle.net/20.500.12708/196724 Development and Evaluation of Advanced Cyclist Assistance Systems on a Bicycle Simulator / Wang, Y., Dorfbauer, S., van der Spaa, L., Mirnig, A. G., Michahelles, F., & Wintersberger, P. (2024). Development and Evaluation of Advanced Cyclist Assistance Systems on a Bicycle Simulator. In AutomotiveUI ’24: Proceedings of the 16th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (pp. 283–293). https://doi.org/10.1145/3640792.3675721 Carbon Rebellion: Empowerment using Data-Driven Narratives / Shahu, A., Wölfer, M., & Michahelles, F. (2024). Carbon Rebellion: Empowerment using Data-Driven Narratives. ACM Journal on Computing and Sustainable Societies. https://doi.org/10.1145/3677324 2023 Smart Trash Can: Easy Collection of Photos of Organic Waste in the Home / Taurer, F., Wolling, F., Moore, J., & Michahelles, F. (2023). Smart Trash Can: Easy Collection of Photos of Organic Waste in the Home. In MUM ’23: Proceedings of the 22nd International Conference on Mobile and Ubiquitous Multimedia (pp. 571–573). Association for Computing Machinery. https://doi.org/10.1145/3626705.3631881 User-Centered Investigation of Features for Attention Management Systems in an Online Vignette Study / Talypova, D., Lingler, A., & Wintersberger, P. (2023). User-Centered Investigation of Features for Attention Management Systems in an Online Vignette Study. In F. Michahelles, P. Knierim, & J. Häkkilä (Eds.), Proceedings of MUM 2023, the 22nd International Conference on Mobile and Ubiquitous Multimedia (pp. 108–121). Association for Computing Machinery (ACM). https://doi.org/10.1145/3626705.3627766 Download: PDF (1.62 MB) Enhancing Professional Training with Single-User Virtual Reality: Unveiling Challenges, Opportunities, and Design Guidelines / Shahu, A., Kinzer, K., & Michahelles, F. (2023). Enhancing Professional Training with Single-User Virtual Reality: Unveiling Challenges, Opportunities, and Design Guidelines. In F. Michahelles, P. Knierim, & J. Häkkilä (Eds.), MMUM ’23: Proceedings of the 22nd International Conference on Mobile and Ubiquitous Multimedia (pp. 244–256). Association for Computing Machinery. https://doi.org/10.1145/3626705.3627791 Download: PDF (1.84 MB) MUM '23: Proceedings of the 22nd International Conference on Mobile and Ubiquitous Multimedia / Michahelles, F., Knierim, P., & Häkkilä, J. (Eds.). (2023). MUM ’23: Proceedings of the 22nd International Conference on Mobile and Ubiquitous Multimedia. Association for Computing Machinery. https://doi.org/10.1145/3626705 The Power of Two: Exploring the Synergies between Human Intelligence and Machine Learning / Michahelles, F. (2023, November 27). The Power of Two:  Exploring the Synergies between Human Intelligence and Machine Learning [Conference Presentation]. HCAI@OVGU First Human-Centred Artificial Intelligence Symposium 2023, Magdeburg, Germany. https://doi.org/10.34726/5283 Download: PDF (14.7 MB) The Eternity bike / Michahelles, F. (2023, October 4). The Eternity bike [Presentation]. Blickpunkt Forschung: Klimafitte Stadt @ TU Wien 2023, Wien, Austria. Nachhaltige Nachhaltigkeit / Michahelles, F. (2023, September 20). Nachhaltige Nachhaltigkeit [Presentation]. ABC Blockchain ",
  "content_length": 25347,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:36"
}