{
  "name": "Florian Erhard",
  "homepage": "https://erhard-lab.de",
  "status": "success",
  "content": "erhard-lab Skip to primary contentSkip to secondary content Our paper on rescuing reads as well as correcting reverse transcrition mediated bias in quantification of nucleotide conversion RNA-seq data is now published. Congrats Kevin for this really nice piece of work and thanks to all collaboration partners! Link Our preprint on rescuing previously unmappable reads as well as correcting reverse transcrition mediated bias in quantification of nucleotide conversion RNA-seq data is on bioRxiv. Thanks Kevin for a major effort! https://www.biorxiv.org/content/10.1101/2023.04.21.537786v1 Our lab moved from the Institute for Virology and Immunobiology at the University of Würzburg at the new Faculty for Informatics and Data Science at the University of Regensburg. We are absolutely excited and look forward to all future challenges. Collaboration with Cochain-lab: Integrated single-cell analysis-based classification of vascular mononuclear phagocytes in mouse and human atherosclerosis https://academic.oup.com/cardiovascres/advance-article/doi/10.1093/cvr/cvac161/6747513?preview=true&itm_medium=sidebar&itm_source=trendmd-widget&itm_campaign=Cardiovascular_Research&itm_content=Cardiovascular_Research_0&login=true Collaboration with Schlosser lab: Extending the Mass Spectrometry-Detectable Landscape of MHC Peptides by Use of Restricted Access Material https://pubs.acs.org/doi/full/10.1021/acs.analchem.2c02198 Collaboration with Fischer lab: An unusual mode of baseline translation adjusts cellular protein synthesis capacity to metabolic needs https://www.sciencedirect.com/science/article/pii/S2211124722013171 Collaboration with Dölken lab: Two murine cytomegalovirus microRNAs target the major viral immediate early 3 gene https://www.microbiologyresearch.org/content/journal/jgv/10.1099/jgv.0.001804 Collaboration with Dölken lab: pUL36 Deubiquitinase Activity Augments Both the Initiation and the Progression of Lytic Herpes Simplex Virus Infection in IFN-Primed Cells https://journals.asm.org/doi/full/10.1128/jvi.00963-22 The combination of single-cell RNA sequencing (scRNA-seq) with metabolic RNA labelling approaches now enables time-resolved monitoring of transcriptional responses for thousands of genes in thousands of individual cells in parallel. https://www.nature.com/articles/s43586-022-00157-z A preprint on our grandR package is now on bioRxiv. It offers easy access to all different kind of downstream analysis for nucleotide conversion RNA-seq data (such as SLAM-seq or TUC-seq), and introduced new computational methodology for quality control and temporal recalibration as well as a Bayesian hierarchical model to analyze synthesis and degradation rates from single snapshot experiments as well as changes thereof. Thanks Teresa and Lygeri for a major effort! https://www.biorxiv.org/content/10.1101/2022.09.12.507665v1 Fantastic collaboration with the Wolf lab. Acute depletion of SPT6 analyzed with 4sU-seq, ChIP-seq, 4sUDRB-seq and SLAM-seq, including mathematical modeling and new computational concepts (LFC regression, DRB wave-front estimation / POL 2 termination zone decline via negative binomial regression, modeling transcriptional kinetics w/o steady-state using SLAM-seq) https://authors.elsevier.com/sd/article/S1097-2765(21)00496-2 SLAM-seq and iCLIP identified the antiviral protein ZAP to bind and destabilize human cytomegalovirus UL4/5 transcripts. Very cool application of SLAM-seq to distinguish transcriptional regulation from RNA destabilization, and very nice collaboration with the Brinkmann lab and the Munschauer lab. https://journals.asm.org/doi/10.1128/mBio.02683-20 Our paper on iTiSS is now online: https://academic.oup.com/bioinformatics/advance-article-abstract/doi/10.1093/bioinformatics/btab170/6171178 Congrats, Chris! Our paper on de novo peptide sequencing and improved identification of MHC-I (a.k.a.) HLA-I immunopeptidomes is finally published at Cancer Immunology Research. Very nice collaboration with the Schlosser-lab! Recent Posts grandRescue/grandCorrect paper published on NAR grandRescue/grandCorrect preprint online Würzburg → Regensburg 5 new papers out Review article on time-resolved single cell RNA-seq out Recent CommentsArchives February 2024 April 2023 March 2023 December 2022 October 2022 September 2022 July 2021 May 2021 March 2021 June 2020 April 2020 July 2019 Categories Uncategorized Meta Log in Entries feed Comments feed WordPress.org",
  "content_length": 4439,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:35"
}