{
  "name": "Fnu Suya",
  "homepage": "https://eecs.utk.edu/people/fnu-suya",
  "status": "success",
  "content": "Fnu Suya | Min H. Kao Department of Electrical Engineering and Computer Science Skip to content Skip to main navigation Report an accessibility issue Fnu Suya Assistant Professor Contact Biography Research Contact Information Office Address: 344 Min H. Kao BuildingPhone: 865-974-0004E-mail: fsuya@utk.eduPersonal WebsiteEducation PhD in Computer Science, University of Virginia, 2023 MS in Computer Science, University of Virginia, 2022 BEng in Electrical Engineering, China Agricultural University, China, 2014 Biography Suya is an Assistant Professor of Electrical Engineering and Computer Science at the University of Tennessee, Knoxville (UT). Prior to joining UT, he was a Postdoctoral Fellow in the Maryland Cybersecurity Center (MC2) at the University of Maryland, College Park, from 2023 to 2024. He earned his PhD in computer science from the University of Virginia in 2023. His research interests lie at the intersection of computer security and machine learning. Specifically, he focuses on two main areas: (1) the application of state-of-the-art machine learning techniques to security-critical applications such as malware detection; (2) the vulnerabilities of machine learning models in the presence of adversaries, generally known as trustworthy machine learning. Suya's work is published in top-tier machine learning conferences such as ICML, NeurIPS, and CVPR, as well as leading security conferences like IEEE S&P, Usenix Security, and SaTML. He received the Best Paper Award at the VISxAI 2022 workshop and the CS Graduate Research Award in 2018. Additionally, he is recognized as an outstanding reviewer for top-tier conferences like ICLR and NeurIPS.Awards and Recognitions 2022 Best Paper Award at the VISxAI workshop 2018 CS Graduate Research Award Research Cybersecurity Machine learning, deep learning Machine learning based security analysis Trustworthy machine learning Safe and Trustworthy Generative AI Google Scholar The flagship campus of the University of Tennessee System and partner in the Tennessee Transfer Pathway.",
  "content_length": 2052,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:48"
}