{
  "name": "Fons J. Verbeek",
  "homepage": "https://liacs.leidenuniv.nl/~verbeekfj",
  "status": "success",
  "content": "Fons Verbeek LIACS HomePage Fons J. Verbeek Imagery & group section Imaging & BioInformatics Leiden Insitute of Advanced Computer Science Page Contents Affiliations Notes Research Areas Courses Student Projects Section Imaging & BioInformatics Contact, Imaging & BioInformatics Dr. Ir. Fons Verbeek LIACS, Leiden University Niels Bohrweg 1 2333 CA Leiden The Netherlands Office 105, Snellius Building Phone +31 - (0)71 - 527 5773 Fax +31 - (0)71 527 6985 Email URL section Imaging & BioInformatics Notes Tested for Netscape 7.x, Mozilla 1.7.*, Explorer 6.x, and Opera 7.x. Earlier versions of these browsers may cause improper response and/or errors. Pages last edited, February 5th 2008. Research Areas The research of this group is on the interface of Imaging and BioInformatics. The research focus of this group is on bio imaging and relation the analysis of image information to other bio-molecular information resources. At present the bio imaging has its emphasis on microscopy modalities, in particular light microscopy. The analysis requires that a large number of images be processed. To overcome the limitations of standard storage formats, innovative approaches for image databases in experimental settings are probed. Current research subjects comprise: 3D Reconstruction & Modeling, Ontologies and their application in the image domain, Gene expression databases, Image analysis and pattern analysis in the Bio-Imaging domain (microsocopy). Courses & Lectures In the 1st semester (september - december) : Human Computer Interaction URL Human Computer Interaction Course Pages Information Systems in the Life Sciences URL Information Systems in the Life Sciences Pages In the 2nd semester (february - april) : Image Analysis in Microscopy, AKA Microscopy, Modelling & Visuzalization URL Image Analysis in Microscopy Student Projects The topics listed here comprise masters projects (project study and thesis project) as well as bachelors projects. The topics include: image analysis ontology mapping 3D reconstruction 3D image projecton bio-image databases (microscopy) interopreability bio-databases microarray analysis (image, integration) 2005 Fons J. Verbeek (c)",
  "content_length": 2178,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:46"
}