{
  "name": "Foster J. Provost",
  "homepage": "https://fosterprovost.com",
  "status": "success",
  "content": "Foster Provost - Foster Provost Skip to content Foster Provost NYU STERN School of Business Ira Rennert Professor of Entrepreneurship Professor of Data Science Professor of Information Systems Paduano Fellow in Business Ethics (Emeritus) Research Interests Machine LearningArtificial IntelligenceData Science & Business AnalyticsCrowdsourcing & Human-AI LoopsAdvertising and Advertising Technology(Social) Network Data What's the Latest? ChatDS interview coming up! ChatDS Best Student Paper runner-up at WISE 2020 (student: Carlos Fernández-Loría) Prof. Provost wins the 2020 ACM SIGKDD Test of Time Award for the paper “Get Another Label” with Sheng & Ipeirotis in SIGKDD 2008 European Research Paper of the Year 2017: Mining Massive Fine-Grained Behavior Data to Improve Predictive Analytics BIO Professor Provost designs, builds, and studies AI, machine learning, and data science methods for business impact.   He has co-founded several successful startups, worked with companies large and small to design and align their AI/data science strategies, and has designed the detailed machine learning systems and processes for many high-impact products. Professor Provost’s research has won numerous awards, has received substantial scholarly attention, and has been used broadly in industry. Foster also has been teaching both the scientific and business perspectives on data science/AI/ML for over 25 years.  His book Data Science for Business may be the best-selling data science book of all time. Foster currently is working full-time for the real-estate tech giant Compass, focusing on AI Strategy and machine learning science. Download CV The Book Music Business Awards 2020 ACM SIGKDD Test of Time Award 2020 Best Student Paper Award Runner-up, WISE 2020 2020 European Research Paper of the Year 2017 (awarded by AIS & CIONET – for a paper in MISQ) 2017 Best Paper Award, Information Systems Research (2016) 2016 SEE ALL Awards Publications Explaining Data-Driven Decisions made by AI Systems: The Counterfactual Approach 2022 Venue: MIS Quarterly Causal Decision Making and Causal Effect Estimation Are Not the Same… and Why It Matters 2022 Venue: INFORMS Journal on Data Science A Comparison of Methods for Treatment Assignment with an Application to Playlist Generation 2022 Venue: Information Systems Research Causal Classification: Treatment Effect Estimation vs. Outcome Estimation 2022 Venue: Journal of Machine Learning Research SEE MORE",
  "content_length": 2453,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:46"
}