{
  "name": "Foteini Baldimtsi",
  "homepage": "http://www.baldimtsi.com",
  "status": "success",
  "content": "FoteiniBaldimtsiSearch this siteEmbedded FilesSkip to main contentSkip to navigationFoteini BaldimtsiShort BioI am an associate professor in the Computer Science Department at George Mason University. My research interests are in cryptography, security and data privacy with a special focus in signature schemes, accumulators, ZK proofs, private authentication techniques and blockchain technologies. My research is supported by NSF (including an NSF CAREER award), NSA, DHS, CCI and faculty research awards from Google, Facebook and IBM.I received my Ph.D. from Brown University in May 2014 where I was supervised by Anna Lysyanskaya. During my time at Brown I was fortunate to spent a semester at Microsoft Research in Redmond, WA working in the Cryptography group and a summer at IBM Research in Zurich working as a member of the Cryptography and Security group. Between 2014 - 2016 I was a postdoctoral researcher in the BU Security group at Boston University and also had a research affiliation with the Crypto.Sec group at University of Athens. A copy of my CV can be found here.Industry experience: I serve as an advisor to the cryptography team of Mysten Labs. In 2022 I was a Summer Faculty Fellow in the Cryptography Group of a16z.Contact address:CS Department, George Mason University4400 University Drive MSN 4A5Fairfax, VA 22030 USAEmail: foteini@baldimtsi.comTeachingAdvanced Cryptography (CS 499/CS 695): Spring 2022Cryptography (CS 487/CS 587): Fall 2025 (most recent) Formal Methods and Models (CS 330): Fall 2022 (most recent)Network Security (ISA 656): Spring 2019 (most recent)Blockchain Technologies (CS 795 or CS 499): Spring 2024 (most recent)Network Security and Applied Crypto (CS558 Boston University): Fall 2015Serviceco-chair: FC 2023, ACM AFT 2021Program Committees (selection): Eurocrypt 2025, ACM-CCS 2024, FC 2024, PKC 2024, ACM-CCS 2023, AFT 2023, ACM-CCS 2022, FC 2022, Eurocrypt 2021, FC 2021, ACM-CCS 2020, NDSS 2019, PETS 2019, IEEE S&P 2019, FC 2019, ACM-CCS 2018, CRYPTO 2018, BITCOIN 2018, EuroSec 2018, SCNS 2018, ACM-CCS 2017, Bitcoin Scaling Workshop 2017, PST 2017,  BITCOIN 2017, FC 2017, IEEE EuroS&P Blockchain Workshop 2017, SCN 2016, BITCOIN 2016 Other: I additionally serve as the Communications officer of the IACR.PublicationsSelected Publications. For an up to date list look at my DBLP or Google Scholar. \"Non-interactive Blind Signatures: Post-quantum and Stronger Security\", F. Baldimtsi, J. Cheng, R. Goyal, A. Yadav, ASIACRYPT, 2024.\"zkLogin: Privacy-Preserving Blockchain Authentication with Existing Credentials\", F. Baldimtsi, K. Chalkias, Y. Ji, J. Lindstrøm, B. Riva, A. Roy, M. Sedaghat, J. Wang, ACM-CCS, 2024.\"Blind Multisignatures for Anonymous Tokens with Decentralized Issuance\", I. Karantaidou, O. Renawi, F. Baldimtsi, N. Kamarinakis, J. Katz, J. Loss, ACM-CCS, 2024.\"SoK: Zero-Knowledge Range Proofs\", M. Christ, F. Baldimtsi, K. Chalkias, D. Maram, A. Roy, J. Wang, AFT, 2024.\"Atomic Swap Protocol for Boneh–Lynn–Shacham (BLS) based Blockchains\", H. Gokay, F. Baldimtsi, G. Ateniese, ESORICS, 2024.\"Universal Vector Commitments\", O. Acharya, F. Baldimtsi, D. Gordon, D. McVicker, A. Yadav, SCN, 2024.\"Advancing Scalability in Decentralized Storage: A Novel Approach to Proof-of-Replication via Polynomial Evaluation\", G. Ateniese, F. Baldimtsi, M. Campanelli, D. Francati, I. Karantaidou, CRYPTO, 2024.\"Oblivious Accumulators\", F. Baldimtsi, I. Karantaidou, S. Raghuraman, PKC, 2024.\"Truncator: Time-space Tradeoff of Cryptographic Primitives\", F. Baldimtsi, K. Chalkias, P. Chatzigiannis, M. Kelkar, FC, 2024.\"Subset-optimized BLS Multi-signature with Key Aggregation\", F. Baldimtsi, K. Chalkias, F. Garillot, J. Lindstrom, B. Riva, A. Roy, M. Sedaghat, A. Sonnino, P. Waiwitlikhit, J. Wang, FC, 2024.\"Batching, Aggregation, and Zero-Knowledge Proofs in Bilinear Accumulators\", S. Shrinivasan, I. Karantaidou,F. Baldimtsi, C. Papamanthou, ACM-CCS, 2022.\"(∈, δ)-Indistinguishable Mixing for Cryptocurrencies\", Mingyu Liang, Ioanna Karantaidou, Foteini Baldimtsi, S. Dov Gordon, Mayank Varia, PoPETS, 2022.\"gOTzilla: Efficient Disjunctive Zero-Knowledge Proofs from MPC in the Head, with Application to Proofs of Assets in Cryptocurrencies\", Foteini Baldimtsi, Panagiotis Chatzigiannis, S. Dov Gordon, Phi Hung Le, Daniel McVicker, PoPETS, 2022.\"SoK: Blockchain Light Clients\", Panagiotis Chatzigiannis, Foteini Baldimtsi, Konstantinos Chalkias, FC 2022.\"Watermarkable Public key Encryption With Efficient Extraction Under Standard Assumptions\", F. Baldimtsi, A. Kiayias, K. Samari, SCN, 2022.\"Efficient Constructions of Pairing Based Accumulators\", Ioanna Karantaidou, Foteini Baldimtsi, IEEE-CSF 2021.\"MiniLedger: Private and Accountable Distributed Payments\", P. Chatzigiannis, F. Baldimtsi, ESORICS, 2021.\"SoK: Auditability and Accountability in Distributed Payment Systems\", Panagiotis Chatzigiannis, Foteini Baldimtsi, Konstantinos Chalkias, ACNS 2021\"Black-Box IoT: Tracking Data & Operations of IoT Devices'', P. Chatzigiannis, F. Baldimtsi, K. Kollias and A. Stavrou, IoTDI, 2021.\"Anonymous Sidechains'', F. Baldimtsi, I. Miers, X. Zhang, CBT (Esorics Workshop), 2021.\"Crowd Verifiable Zero-Knowledge and End-to-End Verifiable Multiparty Computation\", Foteini Baldimtsi, Aggelos Kiayias, Thomas Zacharias, Bingsheng Zhang, ASIACRYPT  2020.\"Anonymous Selection in Proof-of-Stake Settings'', F. Baldimtsi, V. Madathil, A. Scafuro, L. Zhou, IEEE-CSF, 2020.\"Universally Secure Cryptographic Accumulators'', F. Baldimtsi, S.Yakoubov, R. Canetti, CT-RSA, 2020.\"Efficient Non-interactive Certification of RSA Moduli and Beyond\", Sharon Goldberg, Leonid Reyzin, Omar Sagga, Foteini Baldimtsi, ASIACRYPT 2019.\"TumbleBit: An Untrusted Bitcoin-Compatible Anonymous Payment Hub\", Ethan Heilman, Leen Alshenibr, Foteini Baldimtsi, Alessandra Scafuro, Sharon Goldberg, NDSS, 2017. Project site (maintained by Ethan Heilman). Media coverage: Nasdaq, btc Manager, Bitcoin Magazine(1), Bitcoin Magazine(2), more at project site. \"Efficient Accumulators with Applications to Anonymity-Preserving Revocation\", Foteini Baldimtsi, Jan Camenisch, Maria Dubovitskaya, Anna Lysyanskaya, Leo Reyzin, Kai Samelin, Sophia Yakoubov, EuroS&P, 2017.\"Secure Computation in Online Social Networks\", Foteini Baldimtsi, Dimitris Papadopoulos, Stavros Papadopoulos, Alessandra Scafuro and Nikos Triandopoulos, ESORICS, 2017.\"Watermarking Public-Key Cryptographic Functionalities and Implementations\", Foteini Baldimtsi, Katerina Samari, Aggelos Kiayias, ISC, 2017.\"Indistinguishable Proofs of Work or Knowledge\", Foteini Baldimtsi and Aggelos Kiayias and Thomas Zacharias and Bingsheng Zhang, ASIACRYPT, 2016.\"Blindly Signed Contracts: Anonymous On-Blockchain and Off-Blockchain Bitcoin Transactions\", Ethan Heilman; Foteini Baldimtsi; Sharon Goldberg, BITCOIN, 2016.\"Recovering Lost Device-Bound Credentials\", Foteini Baldimtsi, Jan Camenisch, Lucjan Hanzlik, Stephan Krenn, Anja Lehmann, Gregory Neven, ACNS, 2015.Anonymous Transferable E-Cash, Foteini Baldimtsi, Melissa Chase, Georg Fuchsbauer, Markulf Kohlweiss, PKC, 2015.Sorting and Searching Behind the Curtain, Foteini Baldimtsi and Olga Ohrimenko, Financial Cryptography (FC), 2015.Cryptographic Theory Meets Practice: Efficient and Privacy-Preserving Payments for Public Transport, Andy Rupp, Foteini Baldimtsi, Gesine Hinterwälder and Christof Paar, ACM-TISSEC, 2015.On The Security of One-Witness Blind Signature Schemes, Foteini Baldimtsi and Anna Lysyanskaya, ASIACRYPT, 2013.Anonymous Credentials Light, Foteini Baldimtsi, Anna Lysyanskaya, ACM Conference on Computer and Communications Security (ACM-CCS), 2013.Efficient E-cash in Practice: NFC-based Payments for Intelligent Transportation Systems, Gesine Hinterwälder, Christian T. Zenger, Foteini Baldimtsi, Anna Lysyanskaya, Christof Paar and Wayne P. Burleson, Privacy Enhancing Technologies Symposium (PETS), 2013.P4R: Privacy-Preserving Pre-Payments with Refunds for Transportation Systems, Andy Rupp, Gesine Hinterwälder, Foteini Baldimtsi and Christof Paar, Financial Cryptography (FC), 2013.Pay as you go, Foteini Baldimtsi, Gesine Hinterwalder, Andy Rupp, Anna Lysyanskaya, Christof Paar and Wayne P. Burleson, Workshop on hot topics in privacy enhancing technologies, HotPETSs 2012, Vigo, Spain, 2012. (A blog post describing how can we get private, secure and efficient payments for public transportation.)Two types of Key-Compromise Impersonation Attacks against One-Pass Key-Establishment Protocols, K. Chalkias, F. Baldimtsi, D. Hristu-Varsakelis, G. Stephanides, In 'E-Business and Telecommunication', Volume 23, pp. 227-238, Springer, 2009.An Implementation Infrastructure for Server-Passive Timed-Release Cryptography, K. Chalkias, F. Baldimtsi, D. Hristu-Varsakelis, G. Stephanides, Information Assurance and Security Conference, 2008 (IAS '08), pp.89-94, 8-10 Sept. 2008, IEEE Proceedings.Mathematical Problems And Algorithms For Timed-Release Encryption, K. Chalkias, F. Baldimtsi, D. Hristu-Varsakelis and G. Stephanides, Bulletin of the Transilvania University of Brasov, Vol 15(50) Series B - 2008, 1-4, 2008.On the Key-Compromise Impersonation vulnerability of One-pass key establishment protocols, K. Chalkias, F. Mpaldimtsi, D. Hristu-Varsakelis and G. Stephanides, In International Conference on Security and Cryptography (SECRYPT 2007), Barcelona, Spain, July 28-31, 2007.Technical ReportsAttacks on the AKACP Protocol, K. Chalkias, F. Baldimtsi, D. Hristu-Varsakelis, S.T. Halkidis and G. Stephanides, IACR Cryptology Eprint Archive, 2010/500, 2010.Report abuseReport abuse",
  "content_length": 9567,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:47"
}