{
  "name": "Fotis Spyridonis",
  "homepage": "https://www.brunel.ac.uk/people/fotios-spyridonis",
  "status": "success",
  "content": "Dr Fotios Spyridonis | Introduction | Brunel University London Skip to Content Home People Dr Fotios Spyridonis LinkedIn Twitter Dr Fotios SpyridonisSenior Lecturer in Computer Science Wilfred Brown 201 Email: fotios.spyridonis@brunel.ac.uk Tel: +44 (0)1895 267253 Interactive Multimedia Systems Research Group Human Computer Interaction Research Group Computer Science College of Engineering, Design and Physical Sciences Summary Fotis is a Senior Lecturer in Computer Science focusing on Interactive Multimedia and Human-Computer Interaction (HCI). Qualifications PhD in Computing, Department of Computer Science, Brunel University London Postgraduate Certificate in Higher Education (PGCert), University of Greenwich MSc in Distributed Information Systems, Department of Computer Science, Brunel University London BSc in Computer Information Systems, University of Indianapolis Responsibility Programme Lead for MSc Human-AI Interaction Co-Lead of the Interactive Multimedia Systems research group Newest selected publications Campos da Silveira, A., Raisamo, R., Spyridonis, F., Covaci, A., Ghinea, G. and Saibel Santos, CA. (2025) 'Perception of Audio–Visual Synchronization in Olfactory-Enhanced 360-Degree Video'. Applied Sciences, 15 (19). pp. 1 - 20.Open Access Link Journal article Droutsas, N., Spyridonis, F., Daylamani-Zad, D. and Ghinea, G. (2025) 'Flower in the Mirror, Moon on the Water: Bridging Perspectives on Alternative Text and Recommendations for Practice'. International Journal of Human-Computer Interaction, 0 (ahead of print). pp. 1 - 21. ISSN: 1044-7318 Open Access Link Journal article Droutsas, N., Spyridonis, F., Daylamani-Zad, D. and Ghinea, G. (2024) 'Web accessibility barriers and their cross-disability impact in eSystems: A scoping review'. Computer Standards and Interfaces, 92. pp. 1 - 22. ISSN: 0920-5489 Open Access Link Journal article Campos da Silveira, A., Spyridonis, F., Rosaimo, R., Covaci, A., Ghinea, G. and Saibel Santos, CA. (2024) 'On Perceived AV Synchronization in 360° Multimedia'. IEEE MultiMedia, 31 (3). pp. 7 - 17. ISSN: 1070-986X Open Access Link Journal article Spyridonis, F., Daylamani-Zad, D. and Nightingale, J. (2024) 'PublicVR: a virtual reality exposure therapy intervention for adults with speech anxiety'. Virtual Reality, 28 (2). pp. 1 - 19. ISSN: 1359-4338 Open Access Link Journal article More publications(28)",
  "content_length": 2385,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:48"
}