{
  "name": "Fotini Paraskeva",
  "homepage": "https://www.ds.unipi.gr/en/faculty/fparaske-en",
  "status": "success",
  "content": "Foteini Paraskeva - Department of Digital Systems Skip to content Foteini Paraskeva Phone +30 210-4142755 Email fparaske@unipi.gr Title Professor Office Hours Office 304 (150, Androutsou Str, Piraeus, 18532) wp_statistics_words_count 1894 Courses Instructional Methods — 7th semester Educational Psychology — 3rd semester IT-Centric Professional Development — 8th semester Collaborative Learning Environments — 6th semester Brief CV Foteini Paraskeva is a professor in learning psychology with the aid of technology in the Department of Digital Systems, at University of Piraeus. Her research interest is broadly of study learning with media and I.C.T. in educational settings, with particular emphasis on cognitive, emotional and social aspects. The intent of her research is to develop teaching methodologies in educational and training context with practical implications (computer based learning, digital tools and games, authentic assessment). Her current work also involves specific applied research design of the use of I.C.T. in rich training and work environments such as professional development in I.T. context based on quantitative and qualitative methodologies. Publications Publications Publications 2010 – 2019 I) JOURNALS Mysirlaki S. & Paraskeva, F. (2019). Virtual Team Effectiveness: Insights from the Virtual World Teams of Massively Multiplayer Online Games (MMOGs), Journal of Leadership Studies, V 13(1), pp. 36-55. Alexiou, A. & Paraskeva, F. (2019). Influencing Self-Regulated Learning through a Social Networking ePortfolio in Higher Education, International Journal of Learning Technology, Vol. 14, No.2, pp. 162-192. Retalis, S.; Paraskeva, F.; Alexiou, A. Litou, Z.; Sbrini T. & Limperaki Y. (2018). Leveraging the 1:1 iPad approach for enhanced learning in the classroom, Educational Media International, 55:3, pp. 213-230. DOI: 10.1080/09523987.2018.1512463 Gkemisi, S.; Paraskeva, F. ; Alexiou, A. & Bouta H. (2016). Strengthening Collaboration and Communication Skills in an οnline TPD program for 21st–century Educators, International Journal of Learning Technology, Vol. 11, No.4, pp. 340-363. Paraskeva, F.; Alexiou, A.; Koroneou, L.; Mysirlaki, S.; Geomelou, A.; Souki, A-M.; Chatziiliou, A. (2015). ‘The Development of creative thinking through Six Thinking Hats and Web 2.0 Technologies’, In International Journal of Technologies in Learning(iJTL), Vol 22, No 2, pp.15-28. Souki A.M.; Paraskeva, F.; Alexiou, A.; Papanikolaou, K. (2015). Developing personalised e-courses: tailoring students’ learning preferences to a model of self-regulated learning, International Journal of Learning & Technology, Vol. 10, No. 3, pp. 188-202. Bouta, H., Paraskeva, P. (2013). Cognitive Apprenticeship Theory for the Teaching of Mathematics in an online 3D Virtual Environment,  Journal of Mathematical Education in Science and Technology, Taylor & Francis, Vol. 44, Issue 2, pp. 159-178. Bouta, H., Retalis, S., Paraskeva, F. (2012). Utilising a collaborative macro-script to enhance student engagement: A mixed method study in a 3D virtual environment, Computers & Education, Elsevier, 58(1), p. 501-517. Paraskeva, F. & Mysirlaki, S. Vasileiou, V. (2012). Developing Self-Regulation Skills in Virtual Worlds: An Educational Scenario Applied in Second Life, In International Journal of Online Pedagogy and Course Design (IJOPCD), for the special issue on: New Media and New Opportunity: Joyful and Social Learning Vol. 2, Issue, 2, p. 25-43. Bouta, H., Paraskeva, F. (2012). Cognitive Apprenticeship Theory for the Teaching of Mathematics in an online 3D Virtual Environment, International Journal of Mathematical Education in Science and Technology, Taylor & Francis. DOI:10.1080/0020739X.2012.703334. Mysirlaki S. & Paraskeva, F. (2012). Leadership in MMOGs: A Field of Research on Virtual Teams, International Journal of Game-Based Learning (IJGBL), IGI Global (accepted). Paraskeva, F. & Mysirlaki, S. & Papagianni, A. (2010). Multiplayer online games as educational tools: Facing new challenges in learning, Computer and Education, Vol. 54, Issue 2, pp. 498-505. Mysirlaki, S. & Paraskeva, F. (2010). Online Games for the Next Generation of Workers, International Journal of Advance Corporate Learning, Vol. 3, N. 4, pp. 21-25. Vasileiou, V. & Paraskeva, F. (2010). Teaching Role-Playing Instruction in Second Life: An Exploratory Study, Journal of Information, Information Technology, and Organizations, Vol. 5, pp. 25-50. II) CONFERENCES Paraskeva, F.; Alexiou, A.; Bouta, H.; Mysirlaki, S. Souki, A. & Sotiropoulos, D. (2019). Motivating engineer students in e-learning courses with Problem Based Learning and Self-Regulated Learning on the apT2CLE4‘Research Methods’ Environment, In Learning Technology for Education Challenges: 8th International Workshop, LTEC 2019, Zamora, Spain, July 15–18, 2019, Proceedings, by Lorna Uden, Dario Liberona, Galo Sanchez, Sara Rodríguez-González, pp. 189-201. Karampa, V.; Paraskeva, F. and Karra, S. (2019). Gamification Design Framework Based on SDT for AdultMotivation, In Learning Technology for Education Challenges: 8th International Workshop, LTEC 2019, Zamora, Spain, July 15–18, 2019, Proceedings, by Lorna Uden, Dario Liberona, Galo Sanchez, Sara Rodríguez-González,pp. 67-78. Koltsiakis E., Paraskeva F., Bouta, H. (2018). Designing a conceptual framework to enhance Teacher Professional Development in a 3D VLE. In: Uden L., Liberona D., Liu Y. (eds) Learning Technology for Education Challenges. LTEC 2018, Poland, Communications in Computer and Information Science, vol 870, pp. 213-225, Springer, Cham Karampa, V., & Paraskeva, F. (2018). A Motivational Design of a Flipped Classroom on Collaborative Programming and STEAM. In International Workshop on Learning Technology for Education in Cloud vol 870, pp. 226-238, Springer, Cham. Karampa, V. & Paraskeva, F. (2018). The Case-Study of “Young Programmers Travel with Odysseus”. In Proceedings of EdMedia: World Conference on Educational Media and Technology (pp. 1868-1872). Amsterdam, Netherlands: Association for the Advancement of Computing in Education (AACE). Retrieved July 3, 2018 from The Case-Study of “Young Programmers Travel with Odysseus” Alexiou, A. & Paraskeva, F. (2018). Triggering Students’ Ability to Influence Their Motivation and Affect Through a Self-Regulated Career-Oriented ePortfolio, American Educational Research Association (AERA 2018 Annual Meeting), New York, pp. 13 –17. Melissourgos A.; Paraskeva F.(2017). In a Q-Quest to learn: A collaborative game that supports evaluation, In 11thEuropean Conference on Games Based Learning (ECGBL), edited by Maja Pivec and Dr Josef Grundler, ISBN e-book: 978-1-911218-57-9, www.academic-publishing.org, pp. 907-915. Mysirlaki S. & Paraskeva, F. (2017). Moving from the Virtual to The Real World: Is Leadership in MMOGS a Transferable Skill?, In 11thEuropean Conference on Games Based Learning (ECGBL), edited by Maja Pivec and Dr Josef Grundler, pp. 851-859, ISBN e-book: 978-1-911218-57-9, Chatziiliou, A.; Paraskeva,F.(2017). Building Global citizenship competence through a serious game in a virtual learning environment to make higher education students better employable candidates in the global workplace, In EDULEARN17 Proceedings, ISBN: 978-84-697-3777-4, pp. 6585-6595. Giannakou I.; Paraskeva, F.; Alexiou, A.; Bouta H. (2016). A case of Emotional Intelligence for Teachers’ Professional Development: Emotions & Connections are Ubiquitous in Second Life, In: Uden L., Liberona D., Feldmann B. (eds) Learning Technology for Education in Cloud – The Changing Face of Education. LTEC 2016. Communications in Computer and Information Science, vol 62, pp 39-50,Springer, Cham. Nikolakopoulos, A. & Paraskeva, F. (2015). Exploring Students’ Reading Self-Efficacy Beliefs within Digital Environments: A Case Study with Amazon Kindles. In Proceedings of E-Learn: World Conference on E-Learning in Corporate, Government, Healthcare, and Higher Education 2015 (pp. 859-865). Chesapeake, VA: Association for the Advancement of Computing in Education (AACE). Mysirlaki, S. and Paraskeva, F. (2015).  Training Emotionally Intelligent Leaders: The Case of Massively Multiplayer Online GamesProceedings of ECGBL, 8-9 Oct. 2015, Norway,pp. 687-694. Sideris, D., Paraskeva, F., Alexiou, A., Chatziiliou, A. (2014). Create a ‘Wonderful’ Virtual World: the Case of Arigatou in Second Life, University of Piraeus, 8th European Conference on Games Based Learning – ECGBL 2014, Berlin, Germany, 9-10 October 2014, pp. 775-783. Nikolakopoulos, A. & Paraskeva, F. (2014). Introducing new digital challenges for reading comprehension: A case study with dedicated e-Readers, In The 14th IEEE International Conference on Advanced Learning Technologies – ICALT 2014, Athens 2014ICALT 2014, Athens 2014, pp. 421-422 DOI /10.1109/ICALT.2014.126. Alexiou A., Paraskeva, F. (2014). Implementing a Self-Regulated Oriented ePortfolio: The design of an Affective Goal-Setting Plugin, In The 14th IEEE International Conference on Advanced Learning Technologies – ICALT 2014, Athens 2014 pp. 474 – 476. Paraskeva, F.; Chatziiliou, A. & Alexiou, A. (2013). Arguing to Learn and Learning to Argue in Second Life, In 3rdInternational Conference on the Innovative Computing Technology (INTECH 2013), Aug. 29-31 London, UK pp. 205-207 ISBN:978-1-4799-0047-3. Paraskeva, F.; Chatziiliou, A. & Alexiou, A. (2013). Collaborative Creativity & Six Thinking Hats Virtually Enhance 21st Century Skills, Poster, In American Psychological Association, Annual Convention, July 31- Aug. 2, Hawaii. Alexiou, A. & Paraskeva, F. (2013). Exploiting Motivation and Self-efficacy through the Implementation of a Self-Regulated Oriented e-Portfolio, in International Conference of e-Learning in the Workplace, ICEPW, June 12-14, 2013, NY. Paraskeva, F. & Alexiou, A. (2012). Exploiting a Gaming Learning Environment in an Educational Psychology course 120th Annual Convention of the American Psychological Association (APA), Orlando, US. ",
  "content_length": 15810,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:48"
}