{
  "name": "Fow-Sen Choa",
  "homepage": "http://www.csee.umbc.edu/people/faculty/fow-sen-choa",
  "status": "success",
  "content": "Fow-Sen Choa – Department of Computer Science and Electrical Engineering – UMBC Skip to main content Department of Computer Science and Electrical Engineering Menu Apply Search Search Context This Site All of UMBC Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn Position Professor of Computer Science and Electrical Engineering Office 274 Technology Research Center (TRC) Contact Information University of Maryland, Baltimore County 1000 Hilltop Circle Baltimore, MD 21250 phone: (410) 455-3272 email: choa@umbc.edu website: www.csee.umbc.edu/~choa/ Education Ph.D., Electrical Engineering, SUNY at Buffalo, 1988 M.S., Electrical Engineering, SUNY at Buffalo, 1985 B.S., Electrical Engineering, National Taiwan University, 1980 Research Areas Dr. Choa’s current research focuses on Deep and focused Transcranial magnetic stimulation (TMS) tools, EEG brain network monitoring, analysis, and biomarker extraction, Brain neural network architecture and modelling, Nano-technologies, photonic devices and circuits, quantum cascade lasers, photoacoustic sensing. To learn more about Dr. Choa’s research pursuits, read his research profile. Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 2204,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:49"
}