{
  "name": "Frank Ferraro",
  "homepage": "https://www.csee.umbc.edu/~ferraro",
  "status": "success",
  "content": "Frank Ferraro Francis Ferraro Associate Professor, University of Maryland Baltimore County ferraro [at] umbc [dot] edu · Google Scholar Where to Find Me: ITE 358 Department of Computer Science and Electrical Engineering University of Maryland, Baltimore County Publication List · Current Teaching: Fall 2023: CMSC 473/673, Natural Language Processing Hi there! I'm Frank Ferraro, an associate professor in computer science at the University of Maryland, Baltimore County (UMBC). I publish under Francis Ferraro. My main focus is on developing NLP and machine learning models for improved semantic understanding/representation. I generally refer to this as computational event semantics, focusing on developing systems and models that probe at that deeper understanding. The goal of computational event semantics is to develop models that capture common intuitions and expectations about what happens (or doesn’t) in complex situations and who (what types of participants) may be involved. This grounds my research agenda into two high-level thrusts: How can one define what an “event” is, and how does that influence inferences that are made at the word, sentence, or document level? How can we use large-scale event knowledge to extract, represent, or verify information or beliefs? Publications , \".\" , In , (editors), , , (), pages , . . Past Teaching Spring 2023 Teaching: CMSC 678, Introduction to Machine Learning Fall 2022 Teaching: CMSC 473/673, Natural Language Processing Spring 2022 Teaching: CMSC 678, Introduction to Machine Learning Fall 2021 Teaching: CMSC 473/673, Natural Language Processing Spring 2021 Teaching: CMSC 471, Introduction to Artificial Intelligence Fall 2020 Teaching: CMSC 473/673, Natural Language Processing Spring 2020 Teaching: CMSC 691, Special Topic: Graphical and Statistical Models of Learning Fall 2019 Teaching: CMSC 473/673, Natural Language Processing Fall 2019 Teaching: CMSC 871, Advanced Topics in Artificial Intelligence (Grounded Language Acquisition and Language Learning) Spring 2019 Teaching: CMSC 678, Introduction to Machine Learning Fall 2018 Teaching: CMSC 473/673, Natural Language Processing Fall 2018 Teaching: CMSC 871, Advanced Topics in Artificial Intelligence (Grounded Language Acquisition and Language Learning) Spring 2018 Teaching: CMSC 678, Introduction to Machine Learning Fall 2017 Teaching: CMSC 473/673, Natural Language Processing",
  "content_length": 2404,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:26"
}