{
  "name": "Frank Allgöwer",
  "homepage": "https://www.ist.uni-stuttgart.de/de/institut/team/Allgoewer-00002",
  "status": "success",
  "content": "Herr Prof. Dr.-Ing. Dr. h. c. Frank Allgöwer | Institut für Systemtheorie und Regelungstechnik | Universität Stuttgart zum Inhalt springen zum Footer springen zurück Navigation schließen Für die volle Funktionalität dieser Site ist JavaScript notwendig. Hier finden Sie eine Anleitung zum Aktivieren von JavaScript in Ihrem Browser. Frank Allgöwer Herr Prof. Dr.-Ing. Dr. h. c. InstitutsleiterInstitut für Systemtheorie und Regelungstechnik Kontakt +49 711 685 67733 E-Mail Pfaffenwaldring 9 70569 Stuttgart Germany Raum: 2.246 Sprechstunde In der Vorlesungszeit: Montag 13:00-14:00 Uhr, Raum 2.245 In der vorlesungsfreien Zeit: nach Vereinbarung Sekretariat:Frau Yaryna SvyrydaTel.: +49 711 685-67736  E-Mail: yaryna.svyryda@ist.uni-stuttgart.de Publikationen ZeitschriftenartikelR. Strässer, M. Schaller, K. Worthmann, J. Berberich, and F. Allgöwer, “SafEDMD: A Koopman-based data-driven controller design framework for nonlinear dynamical systems,” Automatica, Preprint: arxiv:2402.03145, 2026.BibTeXBibTeX@article{ist:strasser:26b, author = {Strässer, Robin and Schaller, Manuel and Worthmann, Karl and Berberich, Julian and Allgöwer, Frank}, journal = {Automatica, Preprint: arxiv:2402.03145}, title = {SafEDMD: A Koopman-based data-driven controller design framework for nonlinear dynamical systems}, year = 2026 }R. Strässer, K. Worthmann, I. Mezić, J. Berberich, M. Schaller, and F. Allgöwer, “An overview of Koopman-based control: From error bounds to closed-loop guarantees,” Annual Reviews in Control, vol. 61, p. 101035, 2026, doi: 10.1016/j.arcontrol.2025.101035.BibTeXBibTeX@article{ist:strasser:26a, author = {Str{\\\"a}sser, Robin and Worthmann, Karl and Mezi{\\'c}, Igor and Berberich, Julian and Schaller, Manuel and Allgöwer, Frank}, doi = {10.1016/j.arcontrol.2025.101035}, journal = {Annual Reviews in Control}, pages = 101035, publisher = {Elsevier}, title = {An overview of Koopman-based control: From error bounds to closed-loop guarantees}, volume = 61, year = 2026 }L. Schwenkel, J. Köhler, M. A. Müller, C. W. Scherer, and F. Allgöwer, “Multi-objective robust controller synthesis with integral quadratic constraints in discrete-time,” arXiv:2503.22429, 2025.BibTeXBibTeX@article{ist:schwenkel2025a, author = {Schwenkel, L. and Köhler, J. and Müller, M. A. and Scherer, C. W. and Allgöwer, F.}, journal = {arXiv:2503.22429}, title = {Multi-objective robust controller synthesis with integral quadratic constraints in discrete-time}, year = 2025 }N. Ehmann, M. Köhler, and F. Allgöwer, “Transient Performance of MPC for Tracking Without Terminal Constraints,” IEEE Control Systems Letters, vol. 9, pp. 2049–2054, 2025, doi: 10.1109/LCSYS.2025.3585945.BibTeXBibTeX@article{ist:ehmann25a, author = {Ehmann, Nadine and K{\\\"o}hler, Matthias and Allg{\\\"o}wer, Frank}, doi = {10.1109/LCSYS.2025.3585945}, journal = {IEEE Control Systems Letters}, pages = {2049-2054}, title = {Transient Performance of {MPC} for Tracking Without Terminal Constraints}, volume = 9, year = 2025 }R. Strässer, M. Schaller, K. Worthmann, J. Berberich, and F. Allgöwer, “Koopman-based feedback design with stability guarantees,” IEEE Transactions on Automatic Control, vol. 70, Art. no. 1, 2025, doi: 10.1109/TAC.2024.3425770.BibTeXBibTeX@article{ist:strasser:25b, archiveprefix = {arXiv}, author = {Strässer, Robin and Schaller, Manuel and Worthmann, Karl and Berberich, Julian and Allgöwer, Frank}, doi = {10.1109/TAC.2024.3425770}, eprint = {2312.01441}, journal = {IEEE Transactions on Automatic Control}, number = 1, pages = {355-370}, primaryclass = {eess.SY}, title = {Koopman-based feedback design with stability guarantees}, volume = 70, year = 2025 }R. Strässer, M. Schaller, J. Berberich, K. Worthmann, and F. Allgöwer, “Kernel-based error bounds of bilinear Koopman surrogate models for nonlinear data-driven control,” IEEE Control Systems Letters, vol. 9, pp. 1892–1897, 2025, doi: 10.1109/LCSYS.2025.3582630.BibTeXBibTeX@article{ist:strasser:25g, author = {Str{\\\"a}sser, Robin and Schaller, Manuel and Berberich, Julian and Worthmann, Karl and Allgöwer, Frank}, doi = {10.1109/LCSYS.2025.3582630}, journal = {IEEE Control Systems Letters}, pages = {1892-1897}, title = {Kernel-based error bounds of bilinear Koopman surrogate models for nonlinear data-driven control}, volume = 9, year = 2025 }J. Liu, H. Zhang, Y. Xie, and F. Allgöwer, “Data-Driven Predictive Control for Continuous-Time Nonlinear Systems: A Nonzero-Sum Game Approach,” IEEE Journal of Automatica Sinica, 2025.BibTeXBibTeX@article{liu2025game, author = {Liu, Juan and Zhang, Hao and Xie, Yifan and Allgöwer, Frank}, journal = {IEEE Journal of Automatica Sinica}, title = {Data-Driven Predictive Control for Continuous-Time Nonlinear Systems: A Nonzero-Sum Game Approach}, year = 2025 }F. Brändle and F. Allgöwer, “A System Parameterization for Direct Data-Driven Estimator Synthesis,” IEEE Control Systems Letters, vol. 9, pp. 1225–1230, 2025, doi: https://doi.org/10.1109/LCSYS.2025.3580035.BibTeXLinkBibTeX@article{brändle2025parameterizationdirectdatadrivenestimator, archiveprefix = {arXiv}, author = {Brändle, Felix and Allgöwer, Frank}, booktitle = {IEEE Control Systems Letters }, doi = {https://doi.org/10.1109/LCSYS.2025.3580035}, eprint = {2410.10681}, pages = {1225 - 1230}, primaryclass = {eess.SY}, title = {A System Parameterization for Direct Data-Driven Estimator Synthesis}, url = {https://doi.org/10.1109/LCSYS.2025.3580035}, volume = 9, year = 2025 }Linkhttps://doi.org/10.1109/LCSYS.2025.3580035M. Hertneck, D. Meister, and F. Allgöwer, “Current trends and future directions in event-based control,” European Journal of Control (accepted), 2025, doi: 10.1016/j.ejcon.2025.101387.BibTeXBibTeX@article{ist:meister2025c, author = {Hertneck, Michael and Meister, David and Allg{\\\"o}wer, Frank}, doi = {10.1016/j.ejcon.2025.101387}, journal = {European Journal of Control (accepted)}, preprinturl = {https://arxiv.org/abs/2505.22378}, title = {Current trends and future directions in event-based control}, year = 2025 }R. Strässer, J. Berberich, and F. Allgöwer, “Koopman-based control using sum-of-squares optimization: Improved stability guarantees and data efficiency,” European Journal of Control, p. 101367, 2025, doi: 10.1016/j.ejcon.2025.101367.BibTeXBibTeX@article{ist:strasser25d, author = {Str{\\\"a}sser, Robin and Berberich, Julian and Allgöwer, Frank}, doi = {10.1016/j.ejcon.2025.101367}, issn = {0947-3580}, journal = {European Journal of Control}, pages = 101367, title = {Koopman-based control using sum-of-squares optimization: Improved stability guarantees and data efficiency}, year = 2025 }M. Köhler, M. A. Müller, and F. Allgöwer, “Distributed Model Predictive Control for Dynamic Cooperation of Multi-Agent Systems,” preprint on arxiv, 2025, doi: 10.48550/arXiv.2504.00225.BibTeXBibTeX@article{ist:koehler25a, author = {K{\\\"o}hler, Matthias and M{\\\"u}ller, Matthias A. and Allg{\\\"o}wer, Frank}, doi = {10.48550/arXiv.2504.00225}, journal = {preprint on arxiv}, title = {Distributed Model Predictive Control for Dynamic Cooperation of Multi-Agent Systems}, year = 2025 }D. Meister, D. J. Antunes, and F. Allgöwer, “How improving performance may imply losing consistency in event-triggered consensus,” Automatica (accepted), 2025, [Online]. Available: https://arxiv.org/abs/2405.03245BibTeXLinkBibTeX@article{ist:meister2025d, author = {Meister, David and Antunes, Duarte J. and Allg{\\\"o}wer, Frank}, journal = {Automatica (accepted)}, preprinturl = {https://arxiv.org/abs/2405.03245}, title = {How improving performance may imply losing consistency in event-triggered consensus}, url = {https://arxiv.org/abs/2405.03245}, year = 2025 }Linkhttps://arxiv.org/abs/2405.03245R. Strässer, J. Berberich, M. Schaller, K. Worthmann, and F. Allgöwer, “Koopman-based control of nonlinear systems with closed-loop guarantees,” at - Automatisierungstechnik, vol. 73, Art. no. 6, 2025, doi: 10.1515/auto-2024-0162.BibTeXBibTeX@article{ist:strasser25e, author = {Str{\\\"a}sser, Robin and Berberich, Julian and Schaller, Manuel and Worthmann, Karl and Allgöwer, Frank}, doi = {10.1515/auto-2024-0162}, journal = {at - Automatisierungstechnik}, number = 6, pages = {413--428}, title = {Koopman-based control of nonlinear systems with closed-loop guarantees}, volume = 73, year = 2025 }R. Strässer, S. Schlor, and F. Allgöwer, “Decrypting Nonlinearity: Koopman Interpretation and Analysis of Cryptosystems,” Automatica, vol. 173, p. 112022, 2025, doi: 10.1016/j.automatica.2024.112022.BibTeXBibTeX@article{ist:strasser:25a, author = {Str{\\\"a}sser, Robin and Schlor, Sebastian and Allgöwer, Frank}, doi = {10.1016/j.automatica.2024.112022}, issn = {0005-1098}, journal = {Automatica}, pages = 112022, title = {Decrypting Nonlinearity: Koopman Interpretation and Analysis of Cryptosystems}, volume = 173, year = 2025 }J. Mair, L. Schwenkel, M. A. Müller, and F. Allgöwer, “The Cesàro Value Iteration,” arXiv:2504.04889, 2025, doi: 10.48550/arXiv.2504.04889.BibTeXBibTeX@article{ist:mair25a, author = {Mair, J. and Schwenkel, L. and M{\\\"u}ller, M. A. and Allg{\\\"o}wer, F.}, doi = {10.48550/arXiv.2504.04889}, journal = {arXiv:2504.04889}, title = {The {C}es{\\`a}ro {V}alue {I}teration}, year = 2025 }D. Meister, S. Lang, and F. Allgöwer, “Comparison Perspectives for Time-, Event-, and Self-Triggered Control,” IEEE Control Systems Letters, vol. 9, pp. 1754–1759, 2025, doi: 10.1109/LCSYS.2025.3582607.BibTeXBibTeX@article{ist:meister25a, author = {Meister, David and Lang, Simon and Allg{\\\"o}wer, Frank}, doi = {10.1109/LCSYS.2025.3582607}, journal = {{IEEE} Control Systems Letters}, pages = {1754-1759}, title = {Comparison Perspectives for Time-, Event-, and Self-Triggered Control}, volume = 9, year = 2025 }L. Schwenkel, J. Köhler, M. A. Müller, and F. Allgöwer, “Output-feedback model predictive control under dynamic uncertainties using integral quadratic constraints,” arXiv:2504.00196, 2025.BibTeXBibTeX@article{ist:schwenkel2025b, author = {Schwenkel, L. and Köhler, J. and Müller, M. A. and Allgöw",
  "content_length": 172237,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:22"
}