{
  "name": "Frank Mueller 0001",
  "homepage": "http://moss.csc.ncsu.edu/~mueller",
  "status": "success",
  "content": "Frank Mueller Frank Mueller Address Systems Lab Frank Mueller, Ph.D. -- Professor North Carolina State University, Department of Computer Science Travel directions for visitors Don't like this picture? Try this caricature. Member of: The NSF Quantum Leap Challenge Institute for Robust Quantum Simulation Research: Research Projects, Software Distributions and Students Publications Seminar & Student Resources Donations Thesis Topics (by appointment only) Classes/Teaching Tools: Parallel Systems (CSC 548), Fall 2025 Arc Cluster Embedded/Real-Time Systems for Autonomous Driving with Machine Learning (CSC 549/ECE 591/CSC 791), Spring 2025 Quantum Computing (CSC/ECE 569), Fall 2024 Quantum Computing Tutorial Prior Quantum Computing Classes Current/Past Quantum Computing Classes at NCSU Real-Time Systems (CSC 714), Spring 2019 Tilera Board Donations by ARM Donations by Google Donations by Microsoft Seminar on Quantum Computing (CSC 801), Spring 2018 Undergraduate Operating Systems (CSC 246), Fall 2016 Graduate Operating Systems (CSC 501), Fall 2015 Compiler Construction (CSC 512), Spring 2013 Code Optimization for Scalar and Parallel Programs (CSC 766), Fall 2010 Introduction to Parallel Programming with Single and Multiple GPUs, Short Course (May 2011) Cluster Computing (CSC 591C), Spring 2003 Meetings I am involved in and external service: past meetings (archive) Journal of Embedded Computing (JEC) (editorial board) IEEE International Symposium on High-Performance Computer Architecture (HPCA), Feb 2026 (PC) ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming (PPoPP), Feb 2026 (ERC) ACM International Conference on Supercomputing (ICS), Jul 2026 (PC) International Conference for High Performance Computing, Networking, Storage, and Analysis (SC), Nov 2026 (PC, BOF review) Vita: Professional Activities Hobbies: Windsurfing Kayaking Bookmarks Department of Computer Science",
  "content_length": 1916,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:33"
}