{
  "name": "François Bry",
  "homepage": "https://www.pms.ifi.lmu.de/mitarbeiter/derzeitige/francois-bry",
  "status": "success",
  "content": "François Bry - Lehr- und Forschungseinheit für Programmier- und Modellierungssprachen, Institut für Informatik - LMU München Suche Hinweise zur Datenübertragung bei der Google™ Suche Links und Funktionen www.lmu.de LMU-Portal Institut für Informatik Sitemap Sprachumschaltung Englisch Dies sind die archivierten Webseiten der Lehr- und Forschungseinheit für Programmier- und Modellierungssprachen (PMS). Die Seiten der Lehr- und Forschungseinheit für Programmiersprachen und KI (PLAI) finden Sie auf https://www.plai.ifi.lmu.de. Navigationspfad Startseite Mitarbeiter Derzeitige Mitarbeiter François Bry Hauptnavigation Aktuelles Forschung Publikationen Lehre Mitarbeiter Derzeitige Mitarbeiter Imen Azaiz François Bry Armin Egetenmeier Martin Josko Elke Kroiß Kilian Rückschloß Sven Strickroth Felix Weitkämper Assoziierte Mitarbeiter Ehemalige Mitarbeiter Studentische Hilfskräfte Sonstiges Kontakt drucken Inhaltsbereich Prof. Dr. (i.R) François Bry Ordinarius Kontakt Ludwig-Maximilians-Universität MünchenInstitut für InformatikLehr- und Forschungseinheit für Programmier- und ModellierungssprachenOettingenstraße 67D-80538 München E-Mail: b r y [at] lmu * de Weitere Informationen Research | Participations and co-operations | Courses taught | Curriculum vitæ Consultation Hours: By arrangement (please, ask for an appointment e.g. via email) Subjects for bachelor and master theses: See with members of our group, with myself, and at Research projects. Letters of reference, visits to foreign universites, etc.:   Please do not ask at the last minute. Back to Top Research Research interests Current research focus: Symbolic Artificial Intelligence: Rule and Query Languages Automated Reasoning Logic Programming Web and Semantic Web Reasoning Explainable AI Social Media and Human Computation Technology Enhanced Learning Former Doctoral Students Slim Abdennadher (1998) Sunna Torge (1998) Holger Meuss (with Klaus U. Schulz, 2000) Michael Marte (2003) Sebastian Schaffert (2004) Dan Olteanu (2005) Paula-Lavinia Pătrânjan (2005) Stephanie Spranger (2005) Felix Weigel (with Klaus U. Schulz, 2006) Sacha Berger (2008) Tim Furche (2008) Michael Eckert (2008) Alex Kohn (2009) Benedikt Linse (2010) Klara Weiand (2011) Jakub Kotowski (2011) Fabian Kneißl (2014) Christoph Wieser (2014) Steffen Hausmann (2014) Stephan Leutenmayr (2015) Alexander Pohl (2015) Niels Heller (2020) Sebastian Mader (2020) Kilian Rückschloß (2024) Publications Up till 1993, since 1994, at DBLP and at Google Scholar Citation. Back to Top Participations and co-operations Member of the board of the International Conference on Web Reasoning and Rule Systems (RR) Summer Schools Reasoning Web 2005, 2006 and 2007 GI representative (\"Vertrauendozent\") at the University of Munich Member in the following computer science associations: AFPC, ACM, ALP, ECSA, EPTS, GI, GLP, SIG SEMIS. Back to Top Courses taught Introductory courses Functional programming Introduction to algorithms and data structures Introduction to theoretical computer science Introduction to logic for computer science Introduction to discrete mathematics Advanced courses Web information systems Human computation Programming in Prolog Programming in Scala Logic for computer science Declarative languages Compilers and abstract machines Knowledge representation and management Automated theorem proving Back to Top Curriculum vitæ Profiles on LinkedIn and Xing Born 1956, married, three daugthers, French and German citizen. 1994-2022:Research and teaching on data and knowledge modeling, query languages, search engines, rule-based and logic programming, Web systems and social media, Technology Enhanced Learniung with the Institute for Informatics, University of Munich, as a full professor and head of the Unit \"Programming and Modelling Languages\".1985-1993:Work on deductive databases, logic programming, and automated deduction at ECRC (European Computer-Industry Research Centre), Munich, first as a researcher latter as a project leader.1983-1984:Work on statistic databases at the research center IRT (now INRETS ), Paris, as a researcher.1982-1983: Military service with the French Air Forces at SIRPA Air as a PR officer.1981-1982:Work on a text processing system at Transac-Alcatel (now Alcatel), Paris, as a software engineer.1979-1981: PhD student in Mathematics (Graph Theory) at University Paris 6 (supervisors: Claude Berge and Michel Las Vergnas) and lecturer at ESIEA, a school of engineering, Paris.1974-1978:First, student in applied mathematics and economics, University Paris 9, then, student in mathematics, University Paris 6.1974 and before:French Baccalauréat while at École Alsacienne in Paris 6. Formerly, at Lycée Romain Rolland in Ivry-sur-Seine, École Jean Poulmarch in Paris 10, École in Vandœuvre lès Nancy, École Saint-Exupéry in Rabat, Marocco. Back to Top drucken nach oben Fußzeile Impressum und Disclaimer Datenschutzerklärung Kontakt Webauftritt Barrierefreiheit",
  "content_length": 4957,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:46"
}