{
  "name": "Francisco C. Santos",
  "homepage": "http://web.ist.utl.pt/franciscocsantos",
  "status": "success",
  "content": "Francisco C. Santos | Instituto Superior Técnico (IST), Universidade de Lisboa, Portugal Skip navigation. >> about teaching team publications press short bio Francisco Correia dos Santos Francisco C. Santos is a Portuguese academic and researcher. He is Full Professor at Instituto Superior Técnico (IST), University of Lisbon, where he currently serves as Vice-Rector. Previously, he was Vice-President of the Portuguese Foundation for Science and Technology (FCT), where he led major national initiatives in research careers, research and innovation funding, advanced training, and digital infrastructures. Francisco earned his PhD in Computer Science from the Université Libre de Bruxelles (ULB, Belgium), as a Marie Curie PhD Fellow at the Institut de Recherches Interdisciplinaires et Intelligence Artificielle (IRIDIA). Following his PhD, he became a Senior FNRS Researcher in the Machine Learning Group at ULB (Belgium). In Lisbon, he co-headed the Group of Artificial Intelligence for People and Society (GAIPS) at INESC-ID, the interdisciplinary group ATP, the Doctoral Program in Computer Science, and was one of the proponents and coordinators of the MSc in Data Science and Engineering, among other academic and institutional roles. His research lies at the intersection of artificial intelligence, evolutionary biology, behavioral economics, and statistical physics. His current work focuses on the evolution of cooperation and social norms, environmental governance, network science, and the impact of technology on human behavior. His publications also address topics such as urban systems, history, robotics, machine learning, cancer ecology, and particle physics. As a researcher, Francisco was honored with the Young Scientist Award for Socio-Econophysics of the German Physical Society, the CGD / University of Lisbon prize in Computer Science, and a Blue Sky award from the Association for the Advancement of Artificial Intelligence, among other prizes. As an educator, he received the 2022 IST Outstanding Teaching Award from the IST Pedagogic Council, as well as IST Excellence in teaching awards for every year he has taught at IST, based on outstanding students' feedback evaluations. His work has appeared in leading journals such as Nature, Proc. Natl. Acad. Sci USA, Physical Review Letters, Proc. Royal Society B, Nature Climate Change, Nature Sustainability, and Nature Communications, among other venues, as well as in major computer science conferences including AAAI, AAMAS, and IJCAI. For more information, please refer to the links above (publications, teaching, etc.) or visit his Google Scholar profile. contact information email : franciscocsantos[ at ]reitoria.ulisboa.pt or franciscocsantos[ at ]tecnico.ulisboa.pt address: Alameda da Universidade 1649-004 Lisboa Portugal T. +351 210 113 400 | +351 210 113 406",
  "content_length": 2850,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:09"
}