{
  "name": "Francesco Pappalardo 0001",
  "homepage": "https://www.dsf.unict.it/docenti/francesco.pappalardo",
  "status": "success",
  "content": "Francesco PAPPALARDO | Dipartimento di Scienze del Farmaco e della Salute Vai al contenuto principaleVai al menu di navigazione Vai ai contenuti correlati Francesco PAPPALARDO Professore ordinario di Informatica [INFO-01/A] Contatti Ufficio: Dipartimento di Scienze del Farmaco e della Salute, c/o Palazzo Dell'Etna, piano I, stanza 27, Via San Nullo, 5/I, 95123 CataniaEmail: francesco.pappalardo@unict.it - francesco_pappalardo@icloud.comTelefono: 095 7384223 - 095 7384254Sito web: www.combine-group.org Orario di ricevimento Lunedì dalle 12:00 alle 14:00 | Venerdì dalle 16:00 alle 17:00 CURRICULUMPUBBLICAZIONIINSEGNAMENTIATTIVITÀ DI RICERCAAVVISI FORMAZIONE Francesco Pappalardo è nato a Catania l’11 Marzo 1975. Laureato in Scienze dell’Informazione con voti 110/110 e lode nel 2000 all’Università di Catania, dopo la laurea ha conseguito nel 2004 il titolo di Dottore di Ricerca in Informatica. Dal 2004 al 2011 è stato assegnista di ricerca presso il Dipartimento di Matematica e Informatica dell’Università degli Studi di Catania. Nel 2006 è stato visiting researcher presso il Molecular Immunogenetics Labs, IMGT in Montpellier (Francia), mentre nel 2008 è stato visiting researcher presso Dana-Farber Cancer Institute a Boston (USA). Attualmente Francesco Pappalardo è professore ordinario di Informatica presso il Dipartimento di Scienze del Farmaco e della Salute, Università degli Studi di Catania, dove ricopre anche l’incarico di Vice Direttore di Dipartimento. E’ inoltre, dal 2016,  professore visitatore presso la Boston University and Health Informatics Research Lab, Computer Science Department. INCARICHI ISTITUZIONALI Direttore del Gruppo di Ricerca COMBINE (www.combine-group.org). Componente effettivo del Gruppo di Lavoro: \"Percorsi di adozione della Medicina In Silico\", 2019-2022, Ministero della Salute, Consiglio Superiore di Sanità – Sezione I. Vice Direttore del Dipartimento di Scienze del Farmaco, Università degli Studi di Catania Membro del Collegio dei Docenti del Dottorato Internazionale in Basic and Applied Biomedical Science. Vice Direttore del Centro di ricerca per lo studio e la prevenzione, diagnosi e cura dei tumori (CRS PreDiCT). Docente di Informatica per la Scuola di Specializzazione in Farmacia Ospedaliera, Università degli Studi di Catania. Docente di Informatica per la Scuola di Specializzazione in Farmacologia Medica, Università degli Studi di Catania. Docente di Informatica per la Scuola di Specializzazione in Microbiologia e Virologia, Università degli Studi di Catania. Docente per la Scuola di Specializzazione in Oncologia Medica, Università degli Studi di Catania. Docente di riferimento per il CdLM in Chimica e Tecnologie Farmaceutiche. Il Prof. Francesco Pappalardo è inoltre: Valutatore Europeo per il Programma Quadro HORIZON 2020. Valutatore per The Luxembourg National Research Fund (FNR), PRIDE funding. Valutatore per The William Harvey International Translational Research Academy. Valutatore per The Institute for Advanced Study of the University of Strasbourg (USIAS) Revisore per la Valutazione di progetti per conto del Ministero dell’Istruzione, dell’Università e della Ricerca. ATTIVITA’ DIDATTICA Francesco Pappalardo è titolare dell’insegnamento di Informatica presso il CdLM in Chimica e Tecnologia Farmaceutiche, presso il CdL in Scienze Farmaceutiche Applicate e presso il CdL in Biotecnologie dell’Università di Catania. E’ stato relatore di tesi sperimentali di laurea, Tutor di tesi di dottorato di ricerca. E’ stato membro di commissione per il conseguimento del titolo di dottore di ricerca in diverse università italiane ed estere. ATTIVITA’ DI RICERCA L’attività di ricerca di Francesco Pappalardo è incentrata sull’applicazione di modelli computazionali nel campo della biomedicina. E’ uno dei pionieri dei trial clinici in silico, dove attualmente si occupa anche degli aspetti regolatori presso le autorità europee. Ha pubblicato oltre 160 articoli su riviste e conferenze internazionali. Serve la comunità scientifica come presidente e membro delle commissioni di programma per prestigiose conferenze internazionali ed è membro di comitati editoriali per le maggiori riviste in campo bioinformatico. PROGETTI DI RICERCA (SELEZIONE) Responsabilie Scientifico per l’Università degli Studi di Catania per “Ecosystem for rapid adoption of modelling and simulation METhods to address regulatory needs in the development of orphan and paediatric medicines (ERAMET)” project, European Commission Project (HORIZON-HLTH-2023-IND-06), Type of action: RIA - Research and Innovation action, CONTRACT No 101137141). Responsabilie Scientifico per l’Università degli Studi di Catania per “Novel immunotherapies for tuberculosis and other mycobacterial diseases (ITHEMYC)” project, European Commission Project (HORIZON-HLTH-2022-DISEASE-06-two-stage), Type of action: RIA - Research and Innovation action, CONTRACT No 101080462). Coordinatore Scientifico del progetto In Silico World: Lowering barriers to ubiquitous adoption of In Silico Trials (ISW), European Commission Project (RIA: Horizon 2020 - H2020-SC1-DTH-2020-1, CONTRACT No 101016503). Principal Investigator per l’Università degli Studi di Catania del progetto “3TR”, European Commission Project (H2020-JTI-IMI2- 2018-14-two-stage, Type of action: IMI2-RIA - Innovative Medicine Initiative 2 - Research and Innovation action). Coordinatore Scientifico del Progetto STriTuVaD, European Commission Project (RIA: Horizon 2020 - H2020-SC1-2017-CNECT-2, CONTRACT No 777123). Membro del Board di IMMUNOGRID, European Commission Project (STREP: FP6-2004-IST-4, CONTRACT No 028069). Responsabile Scientifico per il progetto MUSS (Mobilità Urbana ed Infraurbana Sostenibile e Sicura) - Bando 2008 relativo ai Programmi di Ricerca e Sviluppo - Azione strategica di Innovazione Industriale Mobilità, finanziato dal Ministero dello Sviluppo Economico e dalla’Unione Europea. (Settembre 2012 - Marzo 2013). Membro di PI2S2, Progetto per l’Implementazione e lo Sviluppo di una e-Infrastruttura in Sicilia basata sul paradigma della Grid, progetto PON. Consulente al progetto VAIMA: Valutazione delle Attivit`a Immunostimolanti di Molecole Bioattive Estratti da Agrumi, ASSESSORATO REGIONALE DELLE ATTIVITA` PRODUTTIVE , P.O. FESR 2007/2013 - Asse IV - Misura 4.1.1.1- Avviso pubblico D.D.G. n. 1703 del 18/06/2010. Partecipante al Progetto DETECH: Bando 2008 - INDUSTRIA 2015 - Nuove Tecnologie per il Made In Italy. Finanziato dal Ministero dello Sviluppo Economico. Partecipante al Progetto PON03PE 00216 - Telemedicina, Ambiente e Salute (TAS) e Ion Gantry for Handrontherapy (IGH). E’ inoltre titolare di diversi progetti finanziati da aziende farmaceutiche e industrie del settore ICT. Pubblicazioni: https://www.scopus.com/authid/detail.uri?authorId=15020960900 Per ulteriori informazioni: www.combine-group.org VISUALIZZA LE PUBBLICAZIONI N.B. l'elevato numero di pubblicazioni può incidere sul tempo di caricamento della pagina VISUALIZZA GLI INSEGNAMENTI DALL'A.A. 2022/2023 AD OGGI Anno accademico 2021/2022 DIPARTIMENTO DI SCIENZE BIOMEDICHE E BIOTECNOLOGICHECorso di laurea in Biotecnologie - 1° annoPRINCIPI DI BIOINFORMATICA A - L DIPARTIMENTO DI SCIENZE BIOMEDICHE E BIOTECNOLOGICHECorso di laurea in Biotecnologie - 1° annoPRINCIPI DI INFORMATICA MATEMATICA E FISICA APPLICATI ALLE BIOTECNOLOGIE M - Z DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea magistrale in Chimica e tecnologia farmaceutiche - 1° annoINFORMATICA A - L DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea magistrale in Chimica e tecnologia farmaceutiche - 1° annoINFORMATICA M - Z DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea in Scienze farmaceutiche applicate - 1° annoMATEMATICA E STATISTICA - INFORMATICA A - L DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea in Scienze farmaceutiche applicate - 1° annoMATEMATICA E STATISTICA - INFORMATICA M - Z Anno accademico 2020/2021 DIPARTIMENTO DI SCIENZE BIOMEDICHE E BIOTECNOLOGICHECorso di laurea in Biotecnologie - 1° annoPRINCIPI DI INFORMATICA MATEMATICA E FISICA APPLICATI ALLE BIOTECNOLOGIE M - Z DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea magistrale in Chimica e tecnologia farmaceutiche - 1° annoINFORMATICA A - L DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea magistrale in Chimica e tecnologia farmaceutiche - 1° annoINFORMATICA M - Z DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea in Scienze farmaceutiche applicate - 1° annoMATEMATICA E STATISTICA - INFORMATICA A - L DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea in Scienze farmaceutiche applicate - 1° annoMATEMATICA E STATISTICA - INFORMATICA M - Z Anno accademico 2019/2020 DIPARTIMENTO DI SCIENZE BIOMEDICHE E BIOTECNOLOGICHECorso di laurea in Biotecnologie - 1° annoPRINCIPI DI INFORMATICA MATEMATICA E FISICA APPLICATI ALLE BIOTECNOLOGIE DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea magistrale in Chimica e tecnologia farmaceutiche - 1° annoINFORMATICA A - L DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea magistrale in Chimica e tecnologia farmaceutiche - 1° annoINFORMATICA M - Z DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea in Scienze farmaceutiche applicate - 1° annoMATEMATICA E STATISTICA - INFORMATICA A - L DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea in Scienze farmaceutiche applicate - 1° annoMATEMATICA E STATISTICA - INFORMATICA M - Z Anno accademico 2018/2019 DIPARTIMENTO DI SCIENZE BIOMEDICHE E BIOTECNOLOGICHECorso di laurea in Biotecnologie - 1° annoLABORATORIO DI INFORMATICA DIPARTIMENTO DI SCIENZE BIOMEDICHE E BIOTECNOLOGICHECorso di laurea in Biotecnologie - 1° annoPRINCIPI DI INFORMATICA MATEMATICA E FISICA APPLICATI ALLE BIOTECNOLOGIE DIPARTIMENTO DI SCIENZE DEL FARMACO E DELLA SALUTECorso di laurea magistrale in Chimica e tecnologia farmaceutiche - 1° annoINFORMATICA A - L DIPARTIMENTO DI SCIENZE D",
  "content_length": 14156,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:01"
}