{
  "name": "François Rivest",
  "homepage": "https://www.rmc-cmr.ca/en/mathematics-and-computer-science/dr-francois-rivest",
  "status": "success",
  "content": "Dr. François Rivest Skip to main content Skip to \"About this site\" Dr. François Rivest Dr. François Rivest Office: Girouard building, room 344 Telephone: (613) 541-6000 ext 6232 Fax: (613) 541-6584 E-mail: Francois.Rivest@rmc-cmr.ca Department of Mathematics and Computer Science College Address Royal Military College of CanadaPO Box 17000, Station ForcesKingston, Ontario, CANADAK7K 7B4 Research Interests Artificial Intelligence, Machine Learning, Reinforcement Learning, Animal Learning, Interval Timing, Dopamine, Computational Neuroscience. Dr. Rivest is interested in the mathematical foundation of artificial and natural learning. He is particularly interested in how different systems in the brain collaborate to generate its amazing learning ability. For example, the cortex, the basal ganglia and the dopaminergic system, the limbic system and the hippocampus, and the cerebellum, all have sensibly different roles in learning. Beyond its potential application in neuropsychology, unleashing the brain's learning strategy might also help develop more general and powerful machine learning algorithms. Animal and machine learning can both be studied under the reinforcement learning framework made of stimuli, actions and rewards. In particular, the brain receives a continuous stream of inputs in which the timing of the various events seems to strongly influence the animal learning and behaviours. How time intervals are learnt and influence learning remains unclear. Beyond timing, the brain's ability to naturally construct abstract representations remains unreplicated by today's best machine learning algorithms. Starting from the animal behavioural and neurophysiological data, Dr. Rivest develops models that reproduce the animal's neural learning ability. In some cases, interesting solutions are also evaluated as potential machine learning algorithms. In particular, Dr. Rivest is currently applying discoveries in animals interval timing ability to the problem of time series prediction (or events prediction) and its potential use in reinforcement learning and robotics. Short Biography Dr. Rivest has a Joint Honours degree in Mathematics and Computer Science from McGill University with a Minor in Cognitive Science. He then completed his M.Sc. in machine learning at McGill University with mention on the Dean's Honours List. Dr. Rivest also worked at the Computer Research Institute of Montreal and the École de Technologies Supérieures leading to patented technologies. He then turned to neuroscience and did a Ph.D. in computational neuroscience at Université de Montréal. He joined the Department of Mathematics and Computer Science at RMC in 2010 and he his also cross-appointed at Queen's University where he is a member of the Center for Neuroscience Studies. Selected Publications Simen, P., Rivest, F., Ludvig, E.A., Balci, F., & Killeen, P. (2013) Timescale Invariance in the Pacemaker-accumulator Family of Timing Models.Timing & Time Perception 1:159-188. Luzardo, A., Elliot A. L., & Rivest, F. (2013) An adaptive drift-diffusion model of interval timing dynamics. Behavioural Processes 95:90-99. Le Dévéhat, Y, Perron, D, Fraysse, O., Dumouchel, P., Landry, R.Jr., & Rivest, F. (2011) Method of Improving Successful Recognition of Genuine Acoustic Authentication Devices. U.S. Patent 7992067, United States, New York. Rivest, F., Kalaska, J.F., & Bengio, Y. (2009) Alternative Time Pepresentation in Dopamine Models. Journal of Computational Neuroscience 28:107-130. Thivierge, J.-P., Rivest, F., & Monchi, O. (2007) Spiking Neurons, Dopamine, and Plasticity: Timing Is Everything, But Concentration Also Matters. Synapse 61:375-390. Rivest, F., Bengio, Y, & Kalaska, J.F. (2005) Brain Inspired Reinforcement Learning. In Lawrence K. Saul, Yair Weiss, and Léon Bottou, editors, Advances in Neural Information Processing Systems 17, pp. 1129-1136. MIT Press, Cambridge, MA. Rivest, F., & Precup, D. (2003) Combining TD-learning with Cascade-correlation Networks. Proceedings of the Twentieth International Conference on Machine Learning, pp. 632-639. AAAI Press. Shultz, T.R., & Rivest, F. (2001) Knowledge-based Cascade-correlation: Using Knowledge to Speed Learning. Connection Science 13:1-30. A complete list of his publications can be found on Google Scholar and Research Gate. Date modified: 2024-06-03",
  "content_length": 4348,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:50"
}