{
  "name": "Francesca Toni",
  "homepage": "http://www.doc.ic.ac.uk/~ft",
  "status": "success",
  "content": "Department of Computing, Imperial College London, Francesca Toni - Home Page Francesca Toni Department of Computing, Imperial College London, South Kensington Campus, Huxley Building, Room 430, London SW7 2AZ, UK. Phone: +44-(0)20-75948228 Fax: +44-(0)20-75948932 Email: ft@imperial.ac.uk Home Research Interests Teaching and Admin Publications Other Information I am Professor in Computational Logic in the Department of Computing at Imperial College London, where I am a member of the Artificial Intelligence research theme and the leader of the CLArg (Computational Logic and Argumentation) research group. I am also a member of the GLAM research group and of the AI@Imperial Network of Excellence at Imperial College London, and the founder and co-director of the Centre for eXplainable AI (XAI). I hold an ERC Advanced grant on Argumentation-based Deep Interactive EXplanations (ADIX) and an ERC Proof of Concept on Causal Argumentative Learning Assistant (CArLA) My current research focus is on explainable AI, machine arguing and computational argumentation, including argumentation in AI broadly conceived and argument mining from text. For a high-level (but not so recent) summary of my research in machine arguing see my (2016) inaugural talk (also available live). For a more recent overview see, for example, ny I-X Breaking Topics in AI talk. I am in the editorial board of Argument and Computation , corner editor on Argumentation for the Journal of Logic and Computation, and Area Editor (Knowledge Representation and Nonmonotonic Reasoning) for Theory and Practice of Logic Programming. I am also in the Board of Directors for KR Inc., IJCAI Trustee, and general chair for IJCAI-ECAI 2026. Access some of the tools and resources I co-developed from here. Last modified: 19 November 2025",
  "content_length": 1802,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:52"
}