{
  "name": "Francesco Leotta",
  "homepage": "http://www.diag.uniroma1.it/users/francesco%20leotta",
  "status": "success",
  "content": "Francesco Leotta | Dipartimento di Ingegneria informatica, automatica e gestionale Salta al contenuto principale Home » Users » Francesco Leotta Francesco Leotta Ricercatorepagina personalestanza: B218telefono: +39 0677274012email uniroma1: francesco.leotta@uniroma1.it Biografia Francesco Leotta is a tenure track assistant professor (scientific disciplinary sector ING-INF/05) at Sapienza Università di Roma, Italy, Dipartimento di Ingegneria Informatica, Automatica e Gestionale Antonio Ruberti (DIAG – Dept. of Computer, Control and Management Engineering). He got a PhD in Engineering in Computer Science (Dottorato di Ricerca in Ingegneria Informatica) from Sapienza Università di Roma in September 2014. He previously studied Engineering in Computer Science (Ingegneria Informatica) at Sapienza Università di Roma, where he obtained a Bachelor Degree in 2006 and a Master Degree in 2010 both with honours. Since 2010, he is qualified to practice as Computer Science Engineer (abilitato all'esercizio della professione di Ingegnere). Between the master degree in January 2010 and June 2011, he served as a research fellow and scientific developer at Fondazione Santa Lucia (FSL). Between 2014 and August 2019 he has been a research fellow at Sapienza Università di Roma – DIAG. Interessi di ricerca The research of Francesco Leotta concerns algorithmic, methodological, experimental and practical aspects in different areas of Computer Science, including ubiquitous computing, human-computer interaction and digital humanities. Such topics are challenged in the application domains of smart spaces, smart manufacturing and cultural heritage. Since 2010, Francesco Leotta has defined a research project that involves the employment of techniques from machine learning and data mining, specifically from business process management and mining, in order to address the problem of smart space monitoring and automation. Here, the term smart space is intended in the widest sense possible, covering smart homes, factories, museums, smart cities and offices. In particular, the goal of the research project is learning and visualizing human habits and procedures from unlabeled data sources such as sensor logs or even written texts and data tables. These habits can be used for anomaly detection, recommender systems and automation. Notably, the term habit mining has been introduced by Francesco Leotta to describe this area of research. One of the peculiarities of this research is the attention to usability for both technicians and end users. As witnessed by the success of the NEST thermostat, the main obstacle to the diffusion of smart spaces is easiness of installation and use. A functioning smart space is based on models. These models must be analyzed and validated by experts of the domain. Thus, one aspect of usability in smart spaces is making the models produced by the system readable to human experts for analysis and inspection. Here, the intuition behind the research of Francesco Leotta is employing established formalisms from the area of Business Process Management (BPM). A second aspect of usability applied to smart spaces is making the deployment of smart space systems easy, reducing the burden of technicians in terms of training. This aspect has been addressed through the massive employment of unsupervised learning techniques. From the point of view of usability for the end users, Francesco Leotta worked on advanced interfaces for smart spaces based on the employment of mobile applications and chat-bots applied to the context of smart homes, cultural heritage and public administration offices. These advanced interfaces also addressed the problem of accessibility. Part of the research of Francesco Leotta, during the period spent at Fondazione Santa Lucia, has been indeed devoted to enlarging the range of end users that can benefit of a smart space, including people with severe disabilities. Recently, Francesco Leotta has increasingly focused his attention on the research domain of Industry 4.0. In particular, he is working on the definition of architectures which allow the automatic composition, short- and long-term adaptation of digital twins in industrial contexts thanks to the application of techniques taken from artificial intelligence to the Internet of Things. In addition, this research activity is currently developed in the context of privately funded (Rotalaser Fustella 4.0) and publicly funded (FIRST, ElectroSpindle 4.0) projects. As collateral results of his research and project activity, Francesco Leotta also published several results in the area of information systems, including works on web services, software architectures and information retrieval. Riconoscimenti e premi Together with Massimo Mecella and Donatella Firmani, Francesco Leotta has been the recipient of the best paper award at IEEE International Conference on Web Services (ICWS 2019) for his contribution on “On Computing Throttling Rate Limits in Web APIs through Statistical Inference”. Membro di Human-Computer Interaction Data Management and Semantic Technologies Processes, Services and Software Engineering Ultime pubblicazioni Assessing smart manufacturing by combining IT systems and enabling technologies in a fuzzy cognitive maturity model in INTERNATIONAL JOURNAL OF COMPUTER INTEGRATED MANUFACTURING 2025 DIE-VIS: An Automated Visual Inspection System for Cardboard Box Manufacturing in Computer Vision - ECCV 2024 Workshops 2025 Digital Twins of Business Processes: A Research Manifesto in INTERNET OF THINGS 2025 Image Processing and Semantic Technologies in Digital Humanities. The NOTAE Experience in From Digital to Distant Diplomatics. Digital Diplomatics 2022 2025 SAMBA: A reference framework for Human-in-the-Loop in adaptive Smart Manufacturing in Procedia Computer Science 2025 Composing Smart Data Services in Shop Floors Through Large Language Models in Service-Oriented Computing 2024 Digital Thread for Smart Products: A Survey on Technologies, Challenges, and Opportunities in Service-Oriented Supply Chains in IEEE ACCESS 2024 Last 50 publications © Università degli Studi di Roma \"La Sapienza\" - Piazzale Aldo Moro 5, 00185 Roma",
  "content_length": 6196,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:57"
}