{
  "name": "Frank Stephan 0001",
  "homepage": "https://www.comp.nus.edu.sg/~fstephan",
  "status": "success",
  "content": "Frank Stephan's Home Page Frank Stephan's Home Page Frank Stephan is a professor at the Departments of Mathematics and Computer Science of the National University of Singapore. Frank Stephan's addresses are: (1) Department of Mathematics, National University of Singapore Block S17, 10 Lower Kent Ridge Road, Singapore 119076 Primary office is S17#07-04, Telephone +65-6516-2759 (2) School of Computing, National University of Singpore Block COM2, 13 Computing Drive, Singapore 117417 Secondary office is COM2#03-11, Telephone +65-6516-4246 The email address is fstephan@comp.nus.edu.sg Maps and explanations Please enlarge the maps at the below links twice by clicking onto the \"+\" in the map. The Department of Mathematics is located at 10 Lower Kent Ridge Road and the building is known as \"S17\" and has formerly been known as \"SoC1\". The office S17#07-04 is room 04 on level 07. The telephone in the office has the number 65162759. It can be reached from Kent Ridge MRT by walk or bus 95. The building COM2 is the second building of the School of Computing. The office COM2#03-11 is room 11 on level 03. The telephone in the office has the number 65164246. It can be reached from Kent Ridge MRT by bus 95 (Bus Stop Central Library) or from Haw Par Villa MRT by bus 10, 30, 51, 188 (Bus Stop Opp Heng Mui Keng Terrace) and walk afterwards; direct walk from MRT stations is about 30 minutes. Frank Stephan's schedule for Semester I AY 2025/2026 is as follows; some more meetings are planned, but not yet put onto the internet: Monday 12:00-14:00 CS1321S Tutorial COM3#01-23 Monday 16:00-18:00 CS1321S Tutorial COM3#01-23 Tuesday 10.30-11.30 CS6101 COM2#03-11 Tuesday 13:00-14:00 Meeting COM2#03-11 Tuesday 14:00-15:00 Meeting COM2#03-11 Tuesday 16:00-17:00 Meeting COM2#03-11 Tuesday 17:00-18:00 Meeting COM2#03-11 Wednesday 10:30-11:30 Meeting S17#07-04 Wednesday 15:00-16:00 Meeting S17#07-04 Wednesday 17:00-18:00 Logic Seminar S17#05-11 Thursday 12:00-14:00 CS1321 Lecture LT11 Thursday 16:00-17:00 Meeting with PhD students Zoom Friday 13:00-14:00 CS1321 Lecture Univtownaud1 Friday 16:00-17:00 Meeting S17#07-04 Teaching Logic and Foundations of Mathematics. AY 2011/2012 Sem 1, AY 2013/2014 Sem 1, AY 2024/2025 Sem 1. Computational Complexity AY 2023/2024 Sem 2, AY 2024/2025 Sem 2. Organising the Logic Seminar jointly with Yang Yue, Goh Jun Le and Wong Tin Lok, see also the homepage of the department on seminars and colloquia. almost every semester. Advanced Automata Theory. Lecture Notes: ps-file, pdf-file. AY 2012/2013 Sem 1, AY 2014/2015 Sem 1, AY 2016/2017 Sem 1, AY 2018/2019 Sem 1, AY 2020/2021 Sem 1, AY 2022/2023 Sem 1. Mathematical Logic. AY 2014/2015 Sem 2, AY 2015/2016 Sem 2, AY 2017/2018 Sem 2, AY 2018/2019 Sem 2, AY 2019/2020 Sem 2, AY 2020/2021 Sem 2, AY 2022/2023 Sem 2. Theory of Computation. Lecture Notes: ps-file, pdf-file. AY 2015/2016 Sem 1, AY 2017/2018 Sem 1, AY 2019/2020 Sem 1, AY 2021/2022 Sem 1. FMS1207M Freshmen-Seminar on Mathematics and Computer Science AY 2006/2007 Sem 1, AY 2007/2008 Sem 1, AY 2008/2009 Sem 1, AY 2009/2010 Sem 1, AY 2011/2012 Sem 1, AY 2012/2013 Sem 2, AY 2013/2014 Sem 1, AY 2014/2015 Sem 2, AY 2015/2016 Sem 2. Problem Solving for Computing. AY 2004/2005 Sem 2, AY 2005/2006 Sem 2, AY 2006/2007 Sem 2, AY 2007/2008 Sem 2, AY 2008/2009 Sem 2, AY 2009/2010 Sem 2, AY 2010/2011 Sem 2, AY 2011/2012 Sem 2, AY 2013/2014 Sem 2. Set Theory. Lecture notes: ps-file; pdf-file. AY 2004/2005 Sem 1, AY 2005/2006 Sem 1, AY 2006/2007 Sem 1, AY 2009/2010 Sem 1. Recursion Theory, Lecture notes: ps-file; pdf-file. AY 2007/2008 Sem 1, AY 2008/2009 Sem 1. Computability Theory. Undergraduate version of Recursion Theory. AY 2004/2005 Sem 2. Sabbaticals. AY 2010/2011 Sem 1, AY 2017/2018 Sem 1. Teaching in Germany from 1996 to 2003. Introduction to Learning Theory. Research Interests Recursion Theory and Kolmogorov Complexity. Learning Theory, in particular Inductive Inference. Computational Complexity. Automata and Formal Languages, in particular Automatic Structures. Scientific Publications List of Publications; due to copyright reasons, there are only preliminary versions (technical reports, files prior to submission to a journal or conference, long form manuscript of some conference publication) of the publications on that page Erdoes-Number and List of Coauthors Overview on some selected papers Membership of the following scientific Organizations Deutscher Hochschulverband Deutsche Mathematiker-Vereinigung European Association for Theoretical Computer Science Freundeskreis der Fakultaet fuer Informatik in Karlsruhe Research Links Institute of Mathematical Sciences and conferences organised by it FPT News: The Paramteterised Complexity Newsletter Reports on Oberwolfach Meetings: 1996, 2001 (with photo) Wikipedia Page on Recursion Theory The Association for Symbolic Logic and its meetings Frank's Characters If you do not remember the URL, search for >> Frank Stephan Singapore << in Google to find this webpage.",
  "content_length": 4991,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:32"
}