{
  "name": "François Guibault",
  "homepage": "https://www.polymtl.ca/expertises/en/guibault-francois",
  "status": "success",
  "content": "Guibault, François | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Guibault, François Poly Directory Courses Français Directory of Experts Guibault, François Directory of Experts Back to search results Edit my profileHelp Publications Link(s) François Guibault B.Ing., M.Sc.A., Ph.D. (Poly) Publications Link(s) Director of Graduate Studies Office of Educational Support and Student Experience Full Professor Department of Computer Engineering and Software Engineering Phone: (514) 340-4711 Ext. 4876 Room: A-205.4.7 francois.guibault@polymtl.ca Areas of expertise Modelling, simulation and finite element methods Modelling, simulation Software engineering Graphics Information systems design Numerical analysis Primary sphere of excellence in research Modeling and Artificial Intelligence Secondary sphere(s) of excellence in research Industry of the Future and Digital Society Human Health Research interests and affiliations Research interests Geometric modeling. Mesh generation and adaptation. Shape generation and optimization. Deep learning. Affiliation(s) Laboratoire de recherche en maillage et géométrie numérique (MAGNU), Director NSERC Industrial Chair in Geothermal Energy for Geothermal Standing Column Wells in Industrial Buildings, Member Institut de l'énergie Trottier (IET), Member Institute for Data Valorization (IVADO), Member Fluid Dynamics Laboratory (LADYF), Member Expertise type(s) (NSERC subjects) 2107 Modelling, simulation and finite element methods 2203 Modelling, simulation 2706 Software engineering 2707 Graphics 2710 Information systems design 2955 Numerical analysis Publications Recent publications Journal article Valtchanov, H., Piché, N., Braïlovski, V., Byers, J. L., Desrosiers, C., & Guibault, F. (2025). Accurate Reconstruction of Gas Turbine Blade Geometry Using 3D/2D Rigid-Registration and CT View Optimization. e-Journal of Nondestructive Testing, 30(2). Journal article Alsheghri, A., Zhang, Y., Keren, J., Cheriet, F., & Guibault, F. (2025). Automatic margin line extraction using 3D deep learning on digital surface models of prepared teeth for crown generation. Computers in Biology and Medicine, 196(C), 110960. Conference paper Chafi, I., Zhang, Y., Ladini, Y., Cheriet, F., Keren, J., & Guibault, F. (2025, April). Exploring the Use of Generative Adversarial Networks for Automated Dental Preparation Design [Paper]. 22nd International Symposium on Biomedical Imaging (ISBI 2025), Houston, TX, USA. Conference paper Chafi, I., Hosseinimanesh, G., Alsheghri, A., Ladini, Y., Zhang, Y., Abbasi Moghadam, N., Elfassy, L., Carrière, V.-M., Haidar, S., Keren, J., Cheriet, F., & Guibault, F. (2025, February). Intellident: an AI-based online automated framework for dental crown generation [Paper]. SPIE Medical Imaging, San Diego, CA, USA (8 pages). See all publications (162) Teaching Software analysis and design. Software architecture. Supervision at Polytechnique COMPLETED Ph.D. Thesis (20) Amiri, S. (2020). Transitional Flow Prediction in High Reynolds Flows Over Hydrofoils [Ph.D. thesis, Polytechnique Montréal]. Ghafoori Ahangar, R. (2018). Fatigue Behavior of Welded Joints with Partial Penetration [Ph.D. thesis, École Polytechnique de Montréal]. Moheb Pour, M. R. (2018). Automatic Mesh-Based Segmentation of Multiple Organs in MR Images [Ph.D. thesis, École Polytechnique de Montréal]. Mortazavinia, Z. (2018). Two-Way Fluid-Structure Coupling Methodology for Modeling 3D Flexible Hydrofoils in Viscous Flow [Ph.D. thesis, École Polytechnique de Montréal]. Demers, É. (2017). Le contrôle des inflexions et des extremums de courbure portés par les courbes et les surfaces B-Splines [Ph.D. thesis, École Polytechnique de Montréal]. Piché, N. (2017). Un nouveau descripteur iconique topologique pour l'appariement d'images de structures anatomiques [Ph.D. thesis, École Polytechnique de Montréal]. Courchesne, O. (2016). Modélisation géométrique 3D des structures anatomiques du tronc humain à partir d'images acquises par résonnance magnétique [Ph.D. thesis, École Polytechnique de Montréal]. Falsafioon, M. (2016). Moving Grids in Complex Configurations [Ph.D. thesis, École Polytechnique de Montréal]. Hosseinimanesh, H. (2016). 3D Numerical Modeling of Transient Conditions in Francis Turbines [Ph.D. thesis, École Polytechnique de Montréal]. Noriega, H. N. (2016). Une étude de cas de vérification pour un code à source ouvert de simulation numérique [Ph.D. thesis, École Polytechnique de Montréal]. Bahrami, S. (2015). Multi-Fidelity Design Optimization of Francis Turbine Runner Blades [Ph.D. thesis, École Polytechnique de Montréal]. Bilal, N. (2014). Métaheuristiques hybrides pour les problèmes de recouvrement et recouvrement partiel d'ensembles appliqués au problème de positionnement des trous de forage dans les mines [Ph.D. thesis, École Polytechnique de Montréal]. Wang, M. (2013). Unifying Geometry and Mesh Adaptive Refinement Using Loop Subdivision [Ph.D. thesis, École Polytechnique de Montréal]. Arabi Narehei, S. (2012). Unstructured Meshes for Large Rigid Body Motions Using Mapping Operators [Ph.D. thesis, École Polytechnique de Montréal]. Mokwinski, Y. (2012). Adaptation de maillage pour les problèmes à surfaces libres en mécanique des fluides [Ph.D. thesis, École Polytechnique de Montréal]. Labbé, P. (2010). Méthodologie de vérification d'un processus adaptatif utilisant la mesure de non-conformité [Ph.D. thesis, École Polytechnique de Montréal]. Sirois, Y. (2010). Adaptation de maillages hybrides et application aux simulations d'équipements de combustion. [Ph.D. thesis, École Polytechnique de Montréal]. Galvan, S. R. (2007). Optimization of the inlet velocity profile of the turbine 99 draft tube [Ph.D. thesis, École Polytechnique de Montréal]. Wang, Y. L. (2007). Automatic hybrid grid generation [Ph.D. thesis, École Polytechnique de Montréal]. Bentamy, A. (2003). Modélisation géométrique par NURBS pour le design aérodynamique des ailes d'avion [Ph.D. thesis, École Polytechnique de Montréal]. Master's Thesis (41) Haidar, S. (2025). Modélisation Statistique de Formes Dentaires Humaines par Harmoniques Sphériques [Master's thesis, Polytechnique Montréal]. Arunachalam, S. (2024). Prediction of the Postoperative Shape of the Trunk After Spinal Surgery Using Deep Learning [Master's thesis, Polytechnique Montréal]. Hernandez, D. (2023). Simulation d'un réservoir de sédimentation appliqué à un système géothermique ouvert [Master's thesis, Polytechnique Montréal]. Lessard, O. (2022). Génération de maillage surfacique de dents par apprentissage profond [Master's thesis, Polytechnique Montréal]. Vasfi Marandi, M. (2021). Numerical Study of Cavitating Flow Over a Hydrofoil [Master's thesis, Polytechnique Montréal]. Seifollahi Moghadam, Z. (2020). Evaluation of Mesh Characteristics for Scale-Resolving Simulation of Incompressible Flows [Master's thesis, Polytechnique Montréal]. Doulcet, B. (2019). Simulations des interactions fluide-structure par une formulation bilatérale fortement couplée sous OpenFOAM [Master's thesis, Polytechnique Montréal]. Plastre, L. (2019). Prédiction de l'érosion de cavitation par une méthode multi-échelle [Master's thesis, Polytechnique Montréal]. Bussière, W. (2017). Parallélisation sur processeur graphique des techniques d'adaptation de maillage basées sur la maximisation de la conformité à une métrique riemannienne [Master's thesis, École Polytechnique de Montréal]. Cappato, R. (2016). Simulation numérique des instabilités rotor stator dans une turbine hydraulique avec Foam-Extend [Master's thesis, École Polytechnique de Montréal]. Li, X. (2016). Méthodologie d'optimisation des profils de vitesse à l'entrée des aspirateurs de turbines hydrauliques [Master's thesis, École Polytechnique de Montréal]. Piaget, D. (2016). Comparaison de la qualité des simulations d'écoulements visqueux turbulents sur différents maillages d'hexaèdres [Master's thesis, École Polytechnique de Montréal]. Zagre, G. É. P. (2016). Algorithme tabou pour le problème de positionnement des trous de forage en tenant compte d'un indice d'incertitude des blocs [Master's thesis, École Polytechnique de Montréal]. Tran, T. D. (2015). Études des modèles de cavitation pour la simulation des écoulements cavitants stationnaires et instationnaires [Master's thesis, École Polytechnique de Montréal]. Liaghat, T. (2014). Two-Way Fluid-Structure Coupling in Vibration and Damping Analysis of an Oscillating Hydrofoil [Master's thesis, École Polytechnique de Montréal]. Petit, F. (2013). Détection, visualisation et communication de défauts dans les modèles géométriques et les maillages [Master's thesis, École Polytechnique de Montréal]. Zouari, G. (2012). Processus de vérification et de validation des analyses mécaniques des roues de turbines hydrauliques avec CODE-ASTER [Master's thesis, École Polytechnique de Montréal]. Bouderlique, R. (2010). Modélisation numérique et algébrique des joints labyrinthe des turbines Francis [Master's thesis, École Polytechnique de Montréal]. Dionne, O. (2009). Développement d'un modèle numérique simplifié du tronc pour simuler l'effet d'une chirurgie de la scoliose sur l'apparence externe d'un patient [Master's thesis, École Polytechnique de Montréal]. Mankovsky, X. (2009). Champ distance d'un solide paramétrique [Master's thesis, École Polytechnique de Montréal]. Joubarne, É. (2008). Adaptation de mail",
  "content_length": 15506,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:49"
}