{
  "name": "Frank Emmert-Streib",
  "homepage": "https://researchportal.tuni.fi/en/persons/frank-emmert-streib",
  "status": "success",
  "content": "Frank Emmert-Streib - Tampere University Research Portal View Scopus Profile Frank Emmert-Streib Professor, Computing SciencesData Science Research Centre https://orcid.org/0000-0003-0745-5641 20002025 Research activity per year Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): KeywordsQA75 Electronic computers. Computer scienceComputational biology Fingerprint Dive into the research topics where Frank Emmert-Streib is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Gene Regulatory Network Keyphrases 100% Gene Expression Data Keyphrases 90% Gene Network Keyphrases 71% Graph Measures Keyphrases 65% Network Inference Computer Science 54% Numerical Results Keyphrases 53% Inference Algorithms Keyphrases 43% Data Science Keyphrases 42% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2000 2013 2014 2016 2019 2020 2025 207 Article 21 Conference contribution 12 Chapter 10 Anthology 24 More 8 Review Article 6 Book 4 Editorial 3 Comment/debate 2 Special issue 1 Letter Research output per year Research output per year Aspects on the optimal decoupling point setting problemJodlbauer, H., Dehmer, M. & Emmert-Streib, F., Jul 2025, In: Applied Mathematics and Computation. 496, 129343.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Point Method 100% Service Level 100% Bill of Material 100% Decoupling Point 100% Analytical Formula 100% 21 Downloads (Pure) Deep mining the textual gold in relation extraction: Deep mining the textual gold in relation extraction: T. Sharma, F. Emmert-StreibSharma, T. & Emmert-Streib, F., Jan 2025, In: Artificial Intelligence Review. 58, 1, 34.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Recurrent Neural Network 100% Learning Approach 100% Natural Language Processing 100% Deep Learning Model 100% Bidirectional Encoder Representations From Transformers 100% 2 Citations (Scopus) 39 Downloads (Pure) Digital twin models for predicting venetoclax and azacitidine-induced neutropenia in patients with acute myeloid leukemiaZhang, Y., Martinez, J., Tercan, B., Kuusanmäki, H., Emmert-Streib, F., Chandraseelan, J. G., Farea, A., Yli-Harja, O., Heckman, C. A., Gibbs, D. L., Thorsson, V., Shmulevich, I., Kontro, M., Qin, G. & Aguilar, B., 2025, In: Npj digital medicine. 8, 11 p., 596.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Neutropenia 100% Acute Myeloid Leukemia 100% Azacitidine 100% Venetoclax 100% Therapeutic Toxicity 66% 2 Downloads (Pure) Understanding question-answering systems: Evolution, applications, trends, and challengesFarea, A. & Emmert-Streib, F., 15 Sept 2025, In: Engineering Applications of Artificial Intelligence. 156, Part A, 110997.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Generating Questions 100% Visual Question Answering 100% Natural Language Understanding 49% Human Language Understanding 49% Prominent Question 49% 1 Citation (Scopus) 34 Downloads (Pure) Using Physics-Informed Neural Networks for Modeling Biological and Epidemiological Dynamical SystemsFarea, A., Yli-Harja, O. & Emmert-Streib, F., May 2025, In: Mathematics. 13, 10, 1664.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Neural Network 100% Architecture Tuning 22% Dynamical Systems in Biology 11% Consistent Solution 11% Robust Optimization 11% 1 Citation (Scopus) 32 Downloads (Pure) View all 274 research outputs Activities Activities per year 2015 2015 2018 15 Reviewer of Scientific Journal 7 Membership of an editorial board 4 Evaluation of funding applications 4 Invited lecture 1 More 1 Visit abroad Activities per year Frontiers in Artificial Intelligence (Journal)Emmert-Streib, F. (Reviewer)2018 → …Activity: Publication peer-review and editorial work › Membership of an editorial board Network-based approaches for Biomedical Data ScienceEmmert-Streib, F. (Invited lecturer)5 Nov 2015Activity: Talk or presentation › Invited lecture Network-based approaches for Biomedical Data ScienceEmmert-Streib, F. (Invited lecturer)4 Nov 2015Activity: Talk or presentation › Invited lecture Network-based approaches for Biomedical Data ScienceEmmert-Streib, F. (Invited lecturer)3 Nov 2015Activity: Talk or presentation › Invited lecture Nankai UniversityEmmert-Streib, F. (Position of trust)Nov 2015Activity: Visiting an external institution › Visit abroad View all 31 activities",
  "content_length": 5151,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:26"
}