{
  "name": "Frank Neumann 0001",
  "homepage": "https://cs.adelaide.edu.au/~frank",
  "status": "success",
  "content": "Computer Science: Frank Neumann Address Frank Neumann Optimisation and Logistics School of Computer Science Ingkarni Wardli, Office 4.55 The University of Adelaide Adelaide, SA 5005, Australia Phone: +61 8 8313 4477 email: frank.neumann@adelaide.edu.au Researcher Profile Group leader of Optimisation and Logistics To prospective PhD students: I am happy to supervise PhD projects in the area of AI-based Optimisation, in particular Evolutionary Computation. If you think, that you have outstanding potential as evidenced by an excellent master or honours degree in Computer Science or Mathematics, please contact me via email with your CV and transcripts. Warning regarding \"novel\" metaphor-based algorithms: If you are interested in or have been working on \"novel\" metaphor-based algorithms such as bat algorithms, firefly algorithms, grey wolf optimization, harmony search, water drop algorithms, whale optimisation, etc, please read article 1 and article 2 by Chamacho-Villalon, Stützle, and Dorigo and the blog of Denis Weyland for a critical evaluation. I regard such \"novel\" metaphor-based algorithms as misleading and detrimental to scientific progress, and won't supervise projects in these areas. New Book: B. Doerr, F. Neumann (Eds.) (2019): Theory of Evolutionary Computation -- Recent Developments in Discrete Optimization. Natural Computing Series, Springer, ISBN 978-3-030-29414-4. Original publication at Springer, Flyer Free editor-created version F. Neumann, C. Witt (2010): Bioinspired Computation in Combinatorial Optimization -- Algorithms and Their Computational Complexity. Natural Computing Series, Springer, ISBN 978-3-642-16543-6. Original publication at Springer (including online access) Book homepage (including free author-created final version) Opportunities to join our group PhD scholarship \"Robust Solutions for Complex Energy Infrastructure\" Research Interests artificial intelligence bio-inspired computing cybersecurity optimization renewable energy supply chain management Current and Recent Activities Tutorial \"Evolutionary computation for stochastic problems\" at GECCO 2023, GECCO 2024 and GECCO 2025 (slides) Competition \"Evolutionary Submodular Optimisation\" at GECCO 2022 and GECCO 2023, and GECCO 2025 Associate Investigator, ARC Industrial Transformation Training Centre in Optimisation Technologies, Integrated Methodologies, and Applications (OPTIMA), 2021-2027 Member of working group \"Optimisation under uncertainty\", EU COST Action CA22137 - Randomised Optimisation Algorithms Research Network (ROAR-NET). Organizer of the 2022 Workshop on AI-based Optimisation, 17-18 November 2022, The University of Melbourne, Australia (with Uwe Aickelin and Kate Smith-Miles) Tutorial \"Evolutionary Submodular Optimisation\" at GECCO 2021 and GECCO 2022 (Video of short version at AI-based Optimisation Seminar) (slides) Tutorial \"Evolutionary Diversity Optimisation for Combinatorial Optimisation\" at GECCO 2022, CEC 2023, WCCI 2024. (Video of presentation at OPTIMA ARC on the topic) Tutorials \"Evolutionary Computation for Digital Art\" and \"Evolutionary Diversity Optimisation\" at IEEE CEC 2021. Chair of the \"Theory Track\" at GECCO 2020 (with Johannes Lengler) and GECCO 2021 (with Andrew Sutton) Area Editor of ACM Transactions on Evolutionary Learning and Optimization Associate Editor of Evolutionary Computation (MIT Press) Associate Editor of IEEE Transactions on Evolutionary Computation (2017-2019) Organizer of the 2019 Workshop on AI-based Optimisation, 1-2 October 2019, The University of Melbourne, Australia (with Uwe Aickelin) General Chair of GECCO 2016 Advisory Board Member of Optimatics, Complexica, Daitum and Springer Natural Computing Book Series Collaboration networks: GECCO , PPSN Other Activities Founder of the \"(Formal) Theory\" track at GECCO. (with Benjamin Doerr and Ingo Wegener in 2007) Founder of the \"Theory of Randomized Search Heuristics\" workshop series (with Benjamin Doerr in 2007) Founder of the Artificial Intelligence based Optimisation (AI-OPT) workshop series (with Uwe Aickelin in 2019) Current and Recent Projects NHMRC Ideas Grant \"Not everyone has the same 24 hours in a day: Addressing time inequality through AI-based personalised time-use interventions\", National Health and Medical Research Council, 2025-2028. ARC Future Fellowship \"Bio-inspired computing for problems with chance constraints\", Australian Research Council, 2021-2025. NHMRC Ideas Grant \"Optimising time use for health and wellbeing\", National Health and Medical Research Council, 2020-2023. ARC Discovery Project \"Evolutionary diversity optimisation\", Australian Research Council, 2019-2021. Humboldt Fellowship for Experienced Researchers, Alexander von Humboldt Foundation, 2019-2021. ARC Industrial Transformation Training Centre for Integrated Operations for Complex Resources, Australian Research Council, 2019-2026. Research Consortium – Unlocking Complex Resources through Lean Processing, Research Consortia Program, State Government of South Australia, 2017-2024. Publications List of Publications DBLP, Google Scholar, ORCID, Scopus Resume 01/2016 - : Professor, School of Computer Science, The University of Adelaide, Australia. 07/2019 - 06/2023: Honorary Professorial Fellow, School of Computing and Information Systems, The University of Melbourne, Australia. 07/2018 - 09/2018: (Interim) Head of School, School of Computer Science, The University of Adelaide, Australia. 01/2015 - 12/2016: Associate Dean (Research), Faculty of Engineering, Computer and Mathematical Sciences, University of Adelaide, Australia. 01/2013 - 12/2015: Associate Professor, School of Computer Science, The University of Adelaide, Australia. 01/2011 - 12/2012: Senior Lecturer, School of Computer Science, The University of Adelaide, Australia. 11/2008 - 12/2010: Coordinator of the group \"Bio-Inspired Computation”, Department 1: Algorithms and Complexity, Max Planck Institute for Informatics, Saarbrücken, Germany. 04/2010 - 07/2010: Visiting Researcher, Computer Science and Artificial Intelligence Laboratory, Massachusetts Institute of Technology, Cambridge, USA. 11/2006 - 10/2008: Postdoctoral Researcher, Department 1: Algorithms and Complexity, Max Planck Institute for Informatics, Saarbrücken, Germany. 02/2008 - 05/2008: Visiting Researcher, School of Computer Science, The University of Adelaide, Australia. 2006: PhD in Computer Science (Dr.-Ing.) from Christian-Albrechts-University of Kiel, Germany. 09/2002 - 09/2006: Research Assistant, Department of Computer Science, Christian-Albrechts-University of Kiel, Germany. 2002: Diplom in Computer Science (Dipl.-Ing.) from Christian-Albrechts-University of Kiel, Germany.",
  "content_length": 6688,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:30"
}