{
  "name": "Francisco Martins",
  "homepage": "https://ciencias.ulisboa.pt/perfil/fcmartins",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo (Em Ciências até Setembro de 2017) Indicadores ResearcherID Orcid Google Scholar Palavras Chave Linguagens de ProgramaçãoRedes de SensoresConcorrênciaSistemas de Tipos Keywords Programming LanguagesSensor NetworksConcurrencyType Systems Currículo Resumido (última atualização) Francisco Martins is an Assistant Professor at the Department of Informatics, Faculty of Sciences, University of Lisbon. Until September 2006 he was Assistant Professor at the Department of Mathematics, University of Azores where he began teaching (as teaching assistant) in October 1997. Previously he was an I. T. manager at Banco Comercial dos Açores since 1990. Francisco received his Ph.D. in Computer Science at University of Lisbon (Faculty of Sciences) in 2006, his M.Sc. (by research) in Computer Science at University of Azores in 2000, and his B.Sc. in Mathematics and Informatics at the University of Azores in 1995. Publicações selecionadas Luís M. B. Lopes, Francisco Martins: A safe-by-design programming language for wireless sensor networks. Journal of Systems Architecture - Embedded Systems Design 63: 16-32 (2016) Hugo A. López, Eduardo R. B. Marques, Francisco Martins, Nicholas Ng, César Santos, Vasco Thudichum Vasconcelos, Nobuko Yoshida: Protocol-based verification of message-passing parallel programs. OOPSLA 2015: 280-298 Tiago Cogumbreiro, Raymond Hu, Francisco Martins, Nobuko Yoshida: Dynamic deadlock verification for general barrier synchronisation. PPOPP 2015: 150-160 Luís Cruz-Filipe, Ivan Lanese, Francisco Martins, António Ravara, Vasco Thudichum Vasconcelos: The stream-based service-centred calculus: a foundation for service-oriented programming. Formal Asp. Comput. 26(5): 865-918 (2014) Dulce Domingos, Francisco Martins, Carlos Cândido, Ricardo Martinho: Internet of Things Aware WS-BPEL Business Processes Context Variables and Expected Exceptions. J. UCS 20(8): 1109-1129 (2014) Ver todas as Publicações",
  "content_length": 2086,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:15"
}