{
  "name": "Frank D. Wood",
  "homepage": "https://www.cs.ubc.ca/~fwood",
  "status": "success",
  "content": "Dr. Frank Wood - The University of British Columbia Dr. Frank Wood | Research Homepage for Frank Wood Search Computer ScienceDr. Frank Wood Home People Teaching Papers Bio CV About Me I am an associate professor of computer science at the University of British Columbia and a Canada CIFAR AI Chair at AMII. I direct the Pacific Laboratory for Artificial Intelligence (PLAI) research group. I also am a founder of Inverted AI, a PLAI group spin-out focused on advanced simulation technology for the autonomous vehicle industry. I also lead the plaicraft.ai emodied AI research project. fwood@cs.ubc.ca Follow @frankdonaldwood I encourage visitors to check out both the PLAI research BLOG and the Inverted AI research BLOG for more information about research being conducted under my supervision. Research Interests My primary research areas include deep generative modeling, amortized inference, probabilistic programming, reinforcement learning, and applied probabilistic machine learning. My research interests range from the development of new probabilistic models and inference algorithms to real-world applications. My research contributions include probabilistic programming systems, new models and inference algorithms, and novel applications of such models to problems in autonomous driving, computational neuroscience, vision, natural language processing, robotics, and reinforcement learning. Selected Publications Google Scholar Harvey, W., Naderiparizi, S., Masrani, V., Weilbach, C., & Wood, F. (2022). Flexible Diffusion Modeling of Long Videos. Thirty-Sixth Conference on Neural Information Processing Systems (NeurIPS). BIB PDF @inproceedings{harvey2022flexible, title = {Flexible Diffusion Modeling of Long Videos}, author = {Harvey, William and Naderiparizi, Saeid and Masrani, Vaden and Weilbach, Christian and Wood, Frank}, booktitle = {Thirty-sixth Conference on Neural Information Processing Systems (NeurIPS)}, archiveprefix = {arXiv}, eprint = {2205.11495}, year = {2022} } Lioutas, V., Lavington, J. W., Sefas, J., Niedoba, M., Liu, Y., Zwartsenberg, B., Dabiri, S., Wood, F., & Ścibior, A. (2022). Critic Sequential Monte Carlo. ArXiv Preprint ArXiv:2205.15460. BIB PDF @inproceedings{lioutas2022critic, title = {Critic Sequential Monte Carlo}, author = {Lioutas, Vasileios and Lavington, Jonathan Wilder and Sefas, Justice and Niedoba, Matthew and Liu, Yunpeng and Zwartsenberg, Berend and Dabiri, Setareh and Wood, Frank and {\\'S}cibior, Adam}, journal = {arXiv preprint arXiv:2205.15460}, year = {2022} } van de Meent, J.-W., Paige, B., Yang, H., & Wood, F. (2018). An introduction to probabilistic programming. ArXiv Preprint ArXiv:1809.10756. BIB PDF @article{van2018introduction, title = {An introduction to probabilistic programming}, author = {van de Meent, Jan-Willem and Paige, Brooks and Yang, Hongseok and Wood, Frank}, journal = {arXiv preprint arXiv:1809.10756}, year = {2018} } Siddarth, N., Paige, B., Desmaison, A., van de Meent, J. W., Goodman, N., Kohli, P., Wood, F., & Torr, P. H. S. (2017). Learning Disentangled Representations with Semi-Supervised Deep Generative Models. NIPS. BIB PDF @inproceedings{iffsidnips2017, title = {Learning Disentangled Representations with Semi-Supervised Deep Generative Models}, author = {Siddarth, N. and Paige, B. and Desmaison, A. and van~de~Meent, J.W. and Goodman, N. and Kohli, P. and Wood, F. and Torr, P.H.S}, booktitle = {NIPS}, year = {2017} } Le, T. A., Baydin, A. G., & Wood, F. (2017). Inference Compilation and Universal Probabilistic Programming. AISTATS. BIB PDF @inproceedings{le2016inference, author = {Le, Tuan Anh and Baydin, Atılım Güneş and Wood, Frank}, booktitle = {AISTATS}, title = {Inference {C}ompilation and {U}niversal {P}robabilistic {P}rogramming}, year = {2017}, file = {../assets/pdf/le2016inference.pdf}, link = {https://arxiv.org/abs/1610.09900} } Prospective students I am always looking for excellent, academically-motivated, AI-inspired PhD students. Please visit the departmental web page for prospective students to apply. An excellent strategy for getting an offer to work with me is to propose research in your proposal that extends and explicitly cites recent work of my own. Better still, working with me beforehand is a major leg up. Direct email to me about becoming a student at UBC is unlikely to get a reply. Postdocs I am constantly looking for postdocs with strong programming languages, statistics, and applied machine learning skills. Please contact me directly including a brief (one paragraph or so) proposed research plan related to my recent research and funding (see my CV for current funding details). Contact without research plans is unlikely to get a reply. Entrepreneurs The intersection of Canada, British Columbia, Vancouver, and UBC is an amazingly interesting place to start a technology company. Contact me directly if you are interested in maintaining an academic affiliation while starting, while sitting beside a world-class machine learning team, a machine learning startup in Vancouver. Please familiarize yourself with MITACS Accelerate and explain where you will source initial investment in the first email. Contact without concrete and attainable funding plans is unlikely to get a reply. Highlights I was one of the initial developers of the Anglican probabilistic programming language and am a co-author of one of the first book length treatments of probabilistic programming, a pre-print of which is on arXiv. Home People Teaching Papers Bio CV",
  "content_length": 5512,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:22"
}