{
  "name": "Francisco M. Couto",
  "homepage": "https://ciencias.ulisboa.pt/perfil/fjcouto",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo Contactos Departamento de Informática Sala/Gabinete 6.3.44 Ext. Principal 526344 Telefone Direto 217500253 Email fjcouto@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Associado com Agregação Indicadores ResearcherID Orcid Google Scholar Currículo Resumido Francisco M. Couto is currently an associate professor with habilitation. He graduated (2000) and has a master (2001) in Informatics and Computer Engineering from the IST. He concluded his doctorate (2006) in Informatics, specialization Bioinformatics, from the Universidade de Lisboa. He was on the faculty at IST from 1998 to 2001 and since 2001 at FCUL. He was an invited researcher at EBI, AFMB-CNRS, BioAlma during his doctoral studies. He received the Young Engineer Innovation Prize 2004 from the Portuguese Engineers Guild, and an honorable mention in 2017 and the prize in 2018 of the ULisboa/Caixa Geral de Depósitos (CGD) Scientific Prizes.His main research contributions cover several key aspects of bioinformatics and knowledge management, namely in proposing and developing: various text mining solutions that explore the semantics encoded in ontologies; semantic similarity measures and tools using biomedical ontologies; and ontology and linked data matching systems.In 2019, he published a book intitled Data and Text Processing for Health and Life Sciences that provides a step-by-step introduction on how shell scripting can help solve many of the data and text processing tasks that Health and Life specialists face everyday with minimal software dependencies. The book is particularly relevant to Health and Life specialists or students that want to easily learn how to process data and text, and which in return may facilitate and inspire them to acquire deeper bioinformatics skills in the future. Interesses Científicos Ontologias; Semelhança Semântica; Prospecção de Texto; Prospecção de Dados; Gestão de Conhecimento e Informação; Bioinformática Scientific Interests Ontologies, Semantic Similarity, Text Mining, Data Mining, Information and Knowledge Management; Bioinformatics Publicações selecionadas F. Couto, Data and Text Processing for Health and Life Sciences. No. 1137 in Advances in Experimental Medicine and Biology, Springer, 2019 A. Lamurias and F. Couto, “Text mining for bioinformatics using biomedical literature,” in Encyclopedia of Bioinformatics and Computational Biology (S. Ranganathan, K. Nakai, C. Schönbach, and M. Gribskov, eds.), vol. 1, pp. 602--611, Oxford: Elsevier, 2019 F. Couto and A. Lamurias, “Semantic similarity definition,” in Encyclopedia of Bioinformatics and Computational Biology (S. Ranganathan, K. Nakai, C. Schönbach, and M. Gribskov, eds.), vol. 1, pp. 870--876, Oxford: Elsevier, 2019 A. Lamurias, D. Sousa, L. Clarke, and F. Couto, “BO-LSTM: classifying relations via long short-term memory networks along biomedical ontologies,” BMC Bioinformatics, vol. 20, no. 10, pp. 1--12, 2019 F. Couto and A. Lamurias, “MER: a shell script and annotation server for minimal named entity recognition and linking,” Journal of Cheminformatics, vol. 10, no. 58, pp. 1--10, 2018 Ver todas as Publicações",
  "content_length": 3317,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:14"
}