{
  "name": "Frank Steinicke",
  "homepage": "https://www.inf.uni-hamburg.de/en/inst/ab/hci/people/steinicke.html",
  "status": "success",
  "content": "Prof. Dr. Frank Steinicke : Human-Computer Interaction : University of Hamburg Zur MetanavigationZur HauptnavigationZur SucheZum InhaltZur SubnavigationZum SeitenfußPhoto: HCI, ilikeinterfaces.comHuman-Computer InteractionProf. Dr. Frank Steinicke Prof. Dr. Frank Steinicke Professor, Head of ChairE-Mail: frank.steinicke\"AT\"uni-hamburg.dePhone: Secr. +49 40 2395-20544 Virtual office hours: Wednesdays, 2-3pm (Zoom-Link) Vogt-Kölln-Str. 30, Room F-113D-22527 Hamburg, Germany Bio Frank Steinicke is a professor of Human-Computer Interaction at the Department of Informatics at the Universität Hamburg. From 2018 and 2020, he headed the Department of Informatics at the Faculty of Mathematics, Informatics, and Natural Sciences. Prior to his current position, he was a professor of Computer Science in Media at the Department of Computer Science at the University of Würzburg and chair of the Immersive Media Group from 2011 to 2014. Between 2012 and 2014, he was the director of the interdisciplinary Institute for Human Computer Media at the University of Würzburg. He studied Mathematics with a Minor in Computer Science at the University of Münster, from which he received his Ph.D. and Venia Legendi in Computer Science. His research interests are focused on understanding the human perceptual, cognitive, and motor abilities and limitations to improve interactions and experiences in computer-mediated realities.For his scientific contributions, he received the IEEE VGTC Virtual Reality Technical Achievement Award in 2023, and was inducted into the prestigious IEEE VR Academy. Frank Steinicke regularly serves as a panelist and speaker at major events in virtual reality and human-computer interaction. He published more than 300 peer-reviewed scientific publications. He served as program chair for several XR and HCI-related conferences, including IEEE VR 2017/2018, which is the most renowned scientific conference in the area of XR. Furthermore, he is chair of the steering committee of the ACM SUI Symposium and co-chair of the steering committee of GI SIG VR/AR. Furthermore, he is a member of the editorial boards of IEEE Transactions on Visualization and Computer Graphics (TVCG) as well as the Frontiers Section on Virtual Reality and Human Behaviour. Finally, he is a (senior) member of IEEE, ACM, and GI. Short Bio Frank Steinicke is a professor of Human-Computer Interaction at the Department of Informatics at the Universität Hamburg. Before his current position, he was a professor of Computer Science in Media at the Department of Computer Science at the University of Würzburg and chair of the Immersive Media Group from 2011 to 2014. He studied Mathematics with a Minor in Computer Science at the University of Münster, from which he received his Ph.D. and Venia Legendi in Computer Science. His research interests are focused on merging natural with artificial intelligence and realities to improve interactions and experiences in computer-mediated environments.For his pioneering work, he received the IEEE VGTC Virtual Reality Technical Achievement Award in 2023 and was inducted into the prestigious IEEE VR Academy. Selected Prizes & Awards Honorable Mention for Best Paper at ACM CHI, 2023 IEEE VGTC VR Technical Achievement Award, 2023 Induction in IEEE VGTC VR Academy, 2023 Best Paper Award at GI VR/AR Workshop, 2022 Honorable Mention for Best Paper Award at ACM VRST, 2021 Best Paper Award at GI Mensch und Computer (MuC), 2020 Best Paper Award at International Conference on Artificial Reality and Telexistence & Eurographics Symposium on Virtual Environments (ICAT-EGVE) 2019 Best Presentation Award at ACM Symposium on Applied Perception (SAP), 2019 Best Paper Award at International Conference on Artificial Reality and Telexistence & Eurographics Symposium on Virtual Environments (ICAT-EGVE) 2018 Best Paper Award at Workshop der GI-Fachgruppe Virtuelle und Erweiterte Realität (GI VR/AR), 2017 Best Paper Award at ACM Symposium on Spatial User Interaction (SUI), 2017 Industrial Robot Innovation Award at 20th International Conference on Climbing and Walking Robots and Support Technologies for Mobile Machines (CLAWAR 2017) Best Poster Award at 25th Int. Conf. on Artificial Reality and Telexistence (ICAT) & 20th Eurographics Symp. on Virtual Environments (EGVE), 2015 Best Poster Award (Audience Choice) at ICAT-EGVE (2015) Best Demo Award at GI VR/AR HMD App Contest, 2015 Honorable Mention for Best Paper Award at GI VR/AR, 2015 Honorable Mention for Best Paper Award at IEEE Virtual Reality (VR), 2015 Best Short Paper Award at ACM Symposium on Spatial User Interaction (SUI), 2014 Best Paper Award at Workshop der GI-Fachgruppe Virtuelle und Erweiterte Realität (GI VR/AR), 2013 Best Paper Award at IEEE International Symposium on Virtual Reality Innovations (ISVRI), 2010 Best Paper Award at ACM Virtual Reality Software and Technology (VRST), 2009 Honorable Mention for Best Paper Award at International Conference on CYBERWORLDS, 2009 Best Paper Award at IEEE Symposium on 3D User Interfaces (3DUI), 2008 Best Paper Award at ACM International Conference on Advances in Computer-Human Interactions (ACHI), 2008 Honorable Mention for Best Paper Award at ACM Virtual Reality Software and Technology (VRST), 2008 Best Paper Award at Virtual Reality International Conference (VRIC), 2008 Honorable Mention for Best Poster Award at IEEE Virtual Reality (VR), 2007 Best Paper Award at International Conference on Computer Graphics Theory and Applications (GRAPP), 2007 Selected Keynotes & Invited Talks Bridging between Artificial Intelligence and Extended Reality, 50th Anniversary IRISA, Rennes, France, 2025 Is Winter Coming? BMBF-Abschlusssymposium VAR 2 Projekte, Berlin, 2024 Intelligent XR – Fusing Extended Reality and Artificial Intelligence, IEEE ICIR 2022, 2022 B(l)ending Realities, IEEE VR 2021 Bending Reality - Human Imperfection as Key to Future Blended Realities, ICAT-EGVE 2020 Artificial Intelligence and Reality - What’s better: Natural, Artificial, Real or Virtual? LegalHRSummit 2020 Künstliche Intelligenz und Realitäten, BMBF Zukunftskongress Mensch-Technik-Interaktion, Bonn, 2019 Artificial Intelligence & Reality - What's better: Natural, Artificial, Real or Virtual?, 12hours.us, Hamburg, 2019 Closing Keynote: 4 x S for the Next Paradigm of User Interfaces, SVR, Foz Do Iguacu, Brazil, 2018 Opening Keynote: The Four S's of SUI for the Ultimate Display, EuroVR, Laval, France 2017 Opening Keynote: Zukunft der virtuellen Realität, Medienkompetenztag, Kiel, 2017 Opening Keynote: The Four S's of SUI for the Ultimate Display,  ACM Symposium on Spatial User Interaction (SUI), Brighton, UK, 2017 Closing Keynote: Immersives Design in Computer-vermittelten Realitäten - Science oder Fiction?, KISDconference, Köln, 2017 Invited Talk: The Healing and Addictive Power of Virtual Reality., BraveNewWorld, Leiden, Netherlands, 2016 Keynote: Visions and Future of VR/AR, binge.watch Festival, Hamburg, 2016 Keynote: Immersive Natives, DIGILITY 2016, Cologne, 2016 Keynote: Super-Natural User Interfaces for the Ultimate Display, Augmented World Expo (AWE) Europe 2016, Berlin, 2016 Keynote: Immersive Natives and the Future of VR/AR, Science Notes 2016, Berlin, 2016 Invited Talk: Being really virtual, Augmented World Expo (AWE), Santa Clara, USA, 2016 Opening keynote: Spieleentwicklung für VR - Chancen, Herausforderungen und Stolpersteine, Hamburger Games Conference, Hamburg, 2016 Opening keynote: Being Really Virtual - Virtual Reality in the Year 2030, Virtual Revolution, Veldhoven, Netherland 2016 Capstone keynote: (Super-)Natural User Interfaces, 2nd International Virtual Reality Symposium, Eindhoven, Netherland, 2015 Keynote: Be-greifbare Interaktion> - Potential der digitalen Fabrikation, Opening Ceronomy Digital Media Labs, Würzburg, Germany, 2013 Keynote: Fooling your Senses – Perceptually-Inspired Interfaces for the Ultimate Display, SIGRAD 2013, Norrköping, Sweden, 2013 Selected Media Images & Videos SRF Einstein report about virtual reality Article about Emotions and computer in Swiss magazine 20 Minuten ZDF Donnerstalk Interview about 24 hours in VR ZDF.info documentary emotions and computers NDR news about Pokemon GO Interview with Rolling Stone Magazine about VR Interview with Die Welt about VR Interview in Bright New Future Postcast> Hamburg news about Games Conference 2016 Radio interview with Danmarks Radio P1 Podcast interview with Voices of VR Video interview with ARD Mittagsmagazin shz.de interview about VR and tele-operation watson.ch interview about games & VR 3sat docutainment about long-term VR WIRED article about long-term use of VR technology GIZMODO article about neuroscience of VR Tagesthemen report about AR gaming MIN-Check interview about studying HCI Bayerischer Rundfunk report about VR for exploration of historic 3D city models Interview about Virtual Reality in WDR Interview with Radio Bremen 2 to World Sight Day The ARD reported on the start of the summer semester with many online offers in the Department of Informatics (starting at 19:30 min). If you want to use one of the following images, for example, for media appearance, please contact me. Click images for high-resolution versions. Current Teaching see here",
  "content_length": 9252,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:33"
}