{
  "name": "Frank Kargl",
  "homepage": "https://www.uni-ulm.de/in/vs/inst/team/frank-kargl",
  "status": "success",
  "content": "Institutsleiter Professor Dr. rer.nat. Frank Kargl - Universität Ulm Prof. Dr. rer.nat. Frank Kargl Prof. Dr. rer.nat. Frank Kargl Institutsdirektor Institut für Verteilte Systeme Institut für Verteilte Systeme Universität Ulm Albert-Einstein-Allee 11 89081 Ulm Baden-Württemberg Deutschland E-Mail: frank.kargl(at)uni-ulm.de www: Frank Kargl Raum: O27 350 Telefon: +4973150-24141 Fax: +4973150-24142 Sprechstunde Aufgrund der Corona Pandemie gibt es aktuell keine regelmäßige Sprechstunde bei mir im Büro. Sie erreichen mich am Besten per Email. Bei inhaltlichen Fragen zu Vorlesungen ist es oft am Einfachsten, diese im jeweiligen Moodle-Kurs im Diskussionsforum zu stellen, wo ich oder die Übungsleiter zeitnah antworten werden. Prof. Dr. rer. nat. Frank Kargl Prof. Kargl promovierte 2003 und habilitierte sich 2009 an der Universität Ulm. Davor war er unter anderem Mitgründer der Firma Arago und in der Netzgruppe des Rechenzentrums / KIZ der Uni Ulm für Netzwerkbetrieb und -sicherheit verantwortlich. Zwischen Ende 2009 und Anfang 2012 war er als Associate Professor in der Gruppe für Distributed and Embedded Security (DIES) der Universität Twente in den Niederlanden tätig, danach bis Januar 2016 als Adjunct Professor. Seit Februar 2012 leitet Prof. Kargl das Institut für Verteilte Systeme an der Uni Ulm. Von Oktober 2013 bis September 2016 fungierte er als Prodekan der Fakultät für Ingenieurwissenschaften, Informatik und Psychologie, deren Dekan er anschließend bis September 2018 war. Prof. Kargl ist Mitglied der ACM, der IEEE, der Gesellschaft für Informatik, GI und der Fachgruppen Sicherheit und KuVS. Forschung Meine Forschungsinteressen liegen im Bereich mobiler und selbst-organisierender Netzwerke, vor allem der Mobilen Ad-hoc Netzwerke und der Fahrzeug-Fahrzeug-Kommunikation. Ein weiterer Schwerpunkt meiner Arbeit sind Security und Privacy in IT-Systemen. Viele meiner Forschungsprojekte bewegen sich im Überlappungsbereich beider Themen, so z.B. Projekte zu Sicherheit und Privacy von Vehicular Ad-hoc Networks. Andere Arbeiten beschäftigen sich mit der Sicherheit von vernetzten eingebetteten Systemen, z.B. im Kontext der Industrial Control Systems oder bei Building Automation. Weitere Projekte beschäftigen sich mit Secure Cloud Computing, Crypto-Currencies, verteiltem Graphen-basiertem Computing und vielen anderen Themen. Lehre Die aktuellen Veranstaltungen von Prof. Kargl entnehmen Sie bitte unserer aktuellen Lehre-Seite. Gremien und Funktionen Prof. Kargl ist aktuell Vorsitzender des GUC Beirats und Mitglied im KIZ Ausschuss der Universität Ulm. Publikationen Suchbegriff (alle Felder) Erweiterte Suche Autor Erscheinungsjahr Dokumententyp Alle DokumententypenArtikelBücherBroschürenKonferenzenBuchbeiträgeSammlungsbeiträgeBeiträge zu VerhandlungenHandbücherManuskripteMaster-ThesisDiversesPhD-ThesisPosterVerhandlungenReportsTechreportsThesisNicht veröffentlichtURLPatente2020220. Wolf, Michael; Willecke, Alexander; Müller, Johannes-Christian; Garlichs, Keno; Griebel, Thomas; Wolf, Lars; Buchholz, Michael; Dietmayer, Klaus; van der Heijden, Rens W.; Kargl, Frank Securing CACC: Strategies for Mitigating Data Injection Attacks 2020 IEEE Vehicular Networking Conference (VNC), New York, NY, USA Herausgeber: IEEE Dezember 2020 DOI:10.1109/vnc51378.2020.9318396219. Kamel, Joseph; Wolf, Michael; van der Heijden, Rens W.; Kaiser, Arnaud; Urien, Pascal; Kargl, Frank VeReMi Extension: A Dataset for Comparable Evaluation of Misbehavior Detection in VANETs ICC 2020 - 2020 IEEE International Conference on Communications (ICC), ICC 2020 Dublin, Ireland Herausgeber: IEEE Juni 2020 DOI:10.1109/icc40277.2020.9149132218. Lukaseder, Thomas; Halter, Maya; Kargl, Frank Context-based Access Control and Trust Scores in Zero Trust Campus NetworksGI Sicherheit Göttingen März 2020 DOI:10.18420/sicherheit2020_042019217. Al-Momani, Ala'a; Kargl, Frank; K. Schmidt, Robert; Kung, Antonio; Bösch, Christoph A Privacy-Aware V-Model for Software Development Proceedings of the International Workshop on Privacy Engineering (IWPE) 2019, San Francisco May 2019 Mai 2019 216. Al-Momani, Ala'a; Kargl, Frank; K. Schmidt, Robert; Kung, Antonio; Bösch, Christoph Poster: Towards A Reliable Privacy-Enhanced V-Model For Software Development40th IEEE Symposium on Security and Privacy 2019 San Francisco May 2019 Herausgeber: IEEE Symposium on Security and Privacy 2019 Mai 2019 215. Kleber, Stephan; Maile, Lisa; Kargl, Frank Survey of Protocol Reverse Engineering Algorithms: Decomposition of Tools for Static Traffic Analysis <prt>IEEE</prt> Communications Surveys and Tutorials, 21 (1) Februar 2019 DOI:10.1109/COMST.2018.28675442018214. Kleber, Stephan; Unterstein, Florian; Hiller, Matthias; Slomka, Frank; Matousek, Matthias; Kargl, Frank; Bösch, Christoph Secure Code Execution: A Generic PUF-driven System Architecture 21st Information Security Conference Oktober 2018 213. Förster, David; Löhr, Hans; Grätz, Anne; Petit, Jonathan; Kargl, Frank An Evaluation of Pseudonym Changes for Vehicular Networks in Large-Scale, Realistic Traffic Scenarios IEEE Transactions on Intelligent Transportation Systems, 19 (10) :3400--3405 Oktober 2018 Herausgeber: IEEE ISSN: 1524-9050 DOI:10.1109/TITS.2017.2775519212. Lukaseder, Thomas; Stölzle, Kevin; Kleber, Stephan; Erb, Benjamin; Kargl, Frank An SDN-based Approach For Defending Against Reflective DDoS Attacks Proceedings of the 43rd IEEE Conference on Local Computer Networks, IEEE LCN 2018 Chicago 2018-10-01 Oktober 2018 Datei:https://arxiv.org/pdf/1808.01177211. Lukaseder, Thomas; Ghosh, Shreya; Kargl, Frank Mitigation of Flooding and Slow DDoS Attacks in a Software-Defined Network Proceedings of the 43rd IEEE Conference on Local Computer Networks (Demo Track), IEEE LCN 2018 (Demo Track) Chicago 2018-10-01 Oktober 2018 Datei:https://arxiv.org/pdf/1808.05357210. Dietzel, Stefan; Leinmüller, Tim; Kargl, Frank Survey on Misbehavior Detection in Cooperative Intelligent Transportation Systems IEEE Communications Surveys & Tutorials Oktober 2018 Herausgeber: IEEE DOI:10.1109/COMST.2018.2873088209. Kleber, Stephan; Kopp, Henning; Kargl, Frank NEMESYS: Network Message Syntax Reverse Engineering by Analysis of the Intrinsic Structure of Individual Messages 12th <prt>USENIX</prt> Workshop on Offensive Technologies, <prt>WOOT</prt> 18, Baltimore, MD, USA, August 13-14, 2018 Herausgeber: <prt>USENIX</prt> Association August 2018 208. Lukaseder, Thomas; Maile, Lisa; Erb, Benjamin; Kargl, Frank SDN-Assisted Network-Based Mitigation of Slow DDoS Attacks SecureComm'18 August 2018 Datei:https://arxiv.org/pdf/1804.06750207. van der Heijden, Rens W.; Lukaseder, Thomas; Kargl, Frank VeReMi: A Dataset for Comparable Evaluation of Misbehavior Detection in VANETs SecureComm'18 August 2018 206. van der Heijden, Rens W.; Kopp, Henning; Kargl, Frank Multi-Source Fusion Operations in Subjective Logic Proceedings of the 21st International Conference on Information Fusion, 21st International Conference on Information Fusion Cambridge 10.07.2018 Herausgeber: IEEE Juli 2018 Datei:https://arxiv.org/abs/1805.01388205. Matousek, Matthias; Bösch, Christoph; Kargl, Frank Poster: Privacy-Preserving Decision Trees Privacy in Machine Learning and Artificial Intelligence Workshop at ICML 2018, Juli 2018 204. Lukaseder, Thomas; Fiedler, Jessika; Kargl, Frank Performance Evaluation in High-Speed Networks by the Example of Intrusion Detection Systems 11. DFN-Forum Kommunikationstechnologien Juni 2018 Datei:https://arxiv.org/pdf/1805.11407203. Erb, Benjamin; Meißner, Dominik; Steer, Benjamin A.; Margan, Domagoj; Kargl, Frank; Cuadrado, Felix; Pietzuch, Peter GraphTides: A Framework for Evaluating Stream-based Graph Processing Platforms Proceedings of the 1st Joint International Workshop on Graph Data Management Experiences & Systems (GRADES) and Network Data Analytics (NDA), GRADES-NDA '18 Houston, TX, USA Juni 2018 DOI:10.1145/3210259.3210262202. Erb, Benjamin; Meißner, Dominik; Ogger, Ferdinand; Kargl, Frank Poster: Log Pruning in Distributed Event-sourced Systems Proceedings of the 12th ACM International Conference on Distributed Event-Based Systems , DEBS '18 Hamilton, New Zealand Juni 2018 DOI:10.1145/3210284.3219767201. Meißner, Dominik; Erb, Benjamin; Kargl, Frank Poster: Performance Engineering in Distributed Event-sourced Systems Proceedings of the 12th ACM International Conference on Distributed Event-Based Systems , DEBS '18 Hamilton, New Zealand Juni 2018 DOI:10.1145/3210284.3219770200. Meißner, Dominik; Erb, Benjamin; Kargl, Frank; Tichy, Matthias retro-λ: An Event-sourced Platform for Serverless Applications with Retroactive Computing Support Proceedings of the 12th ACM International Conference on Distributed Event-Based Systems , DEBS '18 Hamilton, New Zealand Juni 2018 DOI:10.1145/3210284.3210285199. Matousek, Matthias; Yassin, Mahmoud; Al-Momani, Ala'a; van der Heijden, Rens W.; Kargl, Frank Robust Detection of Anomalous Driving Behavior IEEE 87th Vehicular Technology Conference (VTC), Juni 2018 DOI:https://doi.org/10.1109/VTCSpring.2018.8417777198. Mödinger, David; Kopp, Henning; Kargl, Frank; Hauck, Franz J. Towards Enhanced Network Privacy for Blockchains Short research statement for the DSN Workshop on Byzantine Consensus and Resilient Blockchains (BCRB), DSN Workshop on Byzantine Consensus and Resilient Blockchains Luxemburg 25 June 2018 Juni 2018 Datei:https://www.uni-ulm.de/fileadmin/website_uni_ulm/iui.inst.200/files/publikationen/Moedinger18.pdf197. Kopp, Henning; Kargl, Frank; Bösch, Christoph Publicly Verifiable Static Proofs of Storage: A Novel Scheme & Efficiency Comparisons ICICS 2018aus LNCS, ICICS Herausgeber: Springer 2018 196. Kopp, Henning; Kargl, Frank; Bösch, Christoph; Peter, Andreas uMine: A Blockchain based on Human Miners ICICS 2018aus LNCS, ICICS Herausgeber: Springer 2018 Datei:https://eprint.iacr.org/2018/722.pdf123456789 nächste",
  "content_length": 9895,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:29"
}