{
  "name": "Franziska Roesner",
  "homepage": "http://www.franziroesner.com",
  "status": "success",
  "content": "Franziska Roesner - University of Washington Franziska Roesner Brett Helsel Professor Paul G. Allen School of Computer Science & Engineering University of Washington Bill & Melinda Gates Center, Box 352355 Seattle, WA 98195 franzi@cs.washington.edu Security and Privacy Research Lab About Students Teaching Research Personal I am on 80% leave from UW during the 2025-26 academic year, prioritizing advising my current students during my 20%. Please expect me to be less responsive during this time. Yes, I am recruiting PhD students to start in Fall 2026. More info at this link. I am a professor in the Paul G. Allen School of Computer Science & Engineering. My research focuses on computer security and privacy. My interests are broad within that domain, identifying and addressing security and privacy challenges faced by end users of existing and emerging technologies. I like to study people, build systems, and everything in between. I co-direct the Security and Privacy Research Lab. I am also an adjunct professor in the Information School, the Electrical & Computer Engineering Department and the Human Centered Design and Engineering Department at the University of Washington. I am also affiliated with the UW Tech Policy Lab and the UW Center for an Informed Public. I am on the USENIX Security steering committee (after co-chairing the conference in 2020) and the USENIX Enigma steering committee (after co-chairing that conference in 2018 and 2019). I am also on the board of Discourse Labs. I am the recipient of an NSF CAREER Award (2017), an Emerging Leader Alumni Award from the UT Austin College of Natural Sciences (2017), an MIT Technology Review Innovators Under 35 Award (2017), a Google Security and Privacy Research Award (2017), an Undergraduate Research Mentor Award (2020), a Consumer Reports Digital Lab Fellowship (2021), and a Google Research Scholar Award (2022). Some directions I'm particularly interested in at the moment (but not an exhaustive list!) include: Security and privacy for emerging technologies, such as augmented reality (AR) and agentic systems Understanding & designing for the security needs of end users, especially marginalized & vulnerable groups Studying privacy, security, and safety in the wild, such as studying the online ad ecosystem Last updated November 2025.",
  "content_length": 2322,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:43"
}