{
  "name": "Frank H. P. Fitzek",
  "homepage": "https://cn.ifn.et.tu-dresden.de/chair/staff/fitzek",
  "status": "success",
  "content": "Prof. Dr.-Ing. Dr. h.c. Frank H. P. Fitzek – ComNets Skip to content Prof. Dr.-Ing. Dr. h.c. Frank H. P. FitzekHead of the Chair+49 351 463-33945frank.fitzek@tu-dresden.de Teaching: ComNets1, ComNets2, CoopCom, MRT1, MRT2, NetCod, OS ComNets, SwEnG, SwEnVCurriculum VitaeProf. Dr.-Ing. Dr. h.c. Frank H. P. Fitzek, IEEE Fellow, holds the Deutsche Telekom Chair for Communication Networks at the Dresden University of Technology (TUD) and leads a research team of more than 100 scientists. His research focuses on cutting-edge topics such as 5G/6G communication systems, quantum and molecular communication, novel computing approaches, human-machine interaction, and information theory.Prof. Fitzek coordinates two large interdisciplinary research projects: the Cluster of Excellence “Centre for Tactile Internet with Human-in-the-Loop” (CeTI) and the BMBF-funded initiative “6G-life”, a cooperation between TU Dresden and TU Munich. In addition, he co-leads the joint Saxon-Bavarian research initiative “gAIn”, which explores innovative computer architectures for artificial intelligence.His team works closely with leading academic institutions such as the Massachusetts Institute of Technology (MIT), Aalborg University (AAU), Technische Universität München (TUM), Budapest University of Technology and Economics (BUTE), NorthEastern University, and EURECOM. Industry partnerships include Deutsche Telekom AG and Ericsson.Prof. Fitzek’s pioneering work in MIMO MDC earned him the YRP Award in 2005 and the Danish Young Elite Researcher Award. For his innovative contributions to cooperative networks, he received the NOKIA Champion Award from 2007 to 2011 and the Nokia Achievement Award in 2008. In 2011, he received the prestigious SAPERE AUDE research grant, followed by the Vodafone Innovation Prize in 2012. In 2015, he was awarded the degree of Doctor Honoris Causa by BUTE.Prof. Fitzek has co-founded several successful startups in the fields of communications, computing, robotics, AI, human-machine interaction, and quantum technologies. Academic AppointmentsTU Dresden, Germany 10/2014 – present Professor, Area Chair – Communication Networks 5G Lab Germany Coordinator 5Glab.deAalborg University, Denmark 12/2003 – 09/2014 Professor, Electronic Systems Head of Mobile Devices and Future Vision GroupUniversity of Ferrara, Italy 2002–2003 Adjunct Professor, Wireless Networking, Group of Professor Michele ZorziVisiting AppointmentsMIT – Massachusetts Institute of Technology, USA 2009,2010 Visiting Professor Wireless and Cooperative Networks, Group of Professor Muriel MedardVTT Research Center Oulu, Finland 2007 Visiting Professor, Cognitve and Cooperative Wireless Networks Group of Dr. Marcos KatzASU – Arizona State University, USA 2000,2002 Visiting student, Multimedia Networking Group of Martin ReissleinEducationTechnical University of Berlin, Germany 1997–2002 supervisor Professor Adam Wolisz Degree: Dr.-Ing. in Electrical EngineeringRWTH Aachen, Germany 1992–1997 supervisor Professor Bernhard Walke Degree: Dipl.-Ing. in Electrical Engineering BooksFrank Fitzek, Shu-Chen Li, Stefanie Speidel, Thorsten Strufe, Meryem Simsek, Martin Reisslein. Tactile Internet with Human-in-the-Loop. 2021. Elsevier.R. Bassoli, H. Boche, C. Deppe, R. Ferrara, F.H.P. Fitzek, G. Janssen, S. Saeedinaeeni. Quantum Communication Networks. 2021. Springer.Frank Fitzek, Fabrizio Granelli, Patrick Seeling. Computing in Communication Networks. 2020. Elsevier.F.H.P. Fitzek and Marcos Katz. Mobile Clouds: Exploiting Distributed Resources in Wireless, Mobile and Social Networks. 2014. Wiley.F.H.P. Fitzek, Tommi Mikkonen, Tony Torp. Qt for Symbian. 2010. WileyF.H.P. Fitzek and H. Charaf. Mobile Peer to Peer: A Tutorial Guide. 2009. Wiley.M. Katz and F.H.P. Fitzek. WiMAX Evolution: Emerging Technologies and Applications. 2008. Wiley.F.H.P. Fitzek and M. Katz. Cognitive Wireless Networks: Concepts, Methodologies and Visions Inspiring the Age of Enlightenment of Wireless Communications. 2007. Springer.F.H.P. Fitzek and F. Reichert. Mobile Phone Programming and its Application to Wireless Networking. 2007. Springer.P. Seeling and F.H.P. Fitzek and M. Reisslein. Video Traces For Network Performance Evaluation- A Comprehensive Overview and Guide on Video Traces and Their Utilization in Networking Research. 2006. Springer.F.H.P. Fitzek and M. Katz. Cooperation in Wireless Networks: Principles and Applications — Real Egoistic Behavior is to Cooperate!. 2006. Springer.R. Bassoli, H. Boche, C. Deppe, R. Ferrara, F.H.P. Fitzek, G. Janssen, and S. Saeedinaeeni. Quantenkommunikationsnetze. Springer. 2023.Publications969 entries « ‹ 1 of 49 › »2026 Scheinert, Tobias; Nazari, Hosein K.; Liu, How-Hang; Senk, Stefan; Nguyen, Giang T.; Muehleisen, Maciej; Fitzek, Frank H. P.Reliable Edge Control over 5G-TSN: Demonstrating End-to-End Prioritization with Inverted Pendulums Proceedings ArticleIn: IEEE Consumer Communications and Networking Conference, 2026, (accepted for publication).BibTeX@inproceedings{Scheinert2025:reliable, title = {Reliable Edge Control over 5G-TSN: Demonstrating End-to-End Prioritization with Inverted Pendulums}, author = {Tobias Scheinert and Hosein K. Nazari and How-Hang Liu and Stefan Senk and Giang T. Nguyen and Maciej Muehleisen and Frank H. P. Fitzek}, year = {2026}, date = {2026-01-09}, urldate = {2026-01-09}, booktitle = {IEEE Consumer Communications and Networking Conference}, note = {accepted for publication}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close2025 Kurt, Mehmet Akif; Nazari, Hosein K.; Pahlevani, Peyman; Nguyen, Giang T.; Gabriel, Jennifer; Fitzek, Frank H. P.Collective Verification Strategies for Complexity Reduction in Homomorphic MAC Proceedings ArticleIn: 2025 IEEE Globecom Workshops (GC Wkshps): Workshop on Enabling Security, Trust, and Privacy in 6G Wireless Systems (GC Wkshps 2025-Security6G), pp. 5.91, Taipei, Taiwan, 2025.BibTeX@inproceedings{Kurt2512:Collective, title = {Collective Verification Strategies for Complexity Reduction in Homomorphic MAC}, author = {Mehmet Akif Kurt and Hosein K. Nazari and Peyman Pahlevani and Giang T. Nguyen and Jennifer Gabriel and Frank H. P. Fitzek}, year = {2025}, date = {2025-12-08}, urldate = {2025-12-08}, booktitle = {2025 IEEE Globecom Workshops (GC Wkshps): Workshop on Enabling Security, Trust, and Privacy in 6G Wireless Systems (GC Wkshps 2025-Security6G)}, pages = {5.91}, address = {Taipei, Taiwan}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close Notcker, Joachim; Scotece, Domenico; Bassoli, Riccardo; Foschini, Luca; Fitzek, Frank H. P.Modeling and Analysis of Quantum Traffic Matrices in Quantum Networks Proceedings ArticleIn: IEEE Global Communications Conference (Globecom), pp. 5.98, Taipei, Taiwan, 2025.BibTeX@inproceedings{Notcker2512:Modeling, title = {Modeling and Analysis of Quantum Traffic Matrices in Quantum Networks}, author = {Joachim Notcker and Domenico Scotece and Riccardo Bassoli and Luca Foschini and Frank H. P. Fitzek}, year = {2025}, date = {2025-12-01}, urldate = {2025-12-01}, booktitle = {IEEE Global Communications Conference (Globecom)}, pages = {5.98}, address = {Taipei, Taiwan}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close Notcker,; Scotece, Domenico; Bassoli, Riccardo; Foschini, Luca; Fitzek, Frank H. P.A Quantum Traffic Engineering Framework for Optimizing Quantum Link Delay Proceedings ArticleIn: IEEE Global Communications Conference (IEEE Globecom), pp. 5.95, Taipei, Taiwan, 2025.BibTeX@inproceedings{Notckter2512:Quantum, title = {A Quantum Traffic Engineering Framework for Optimizing Quantum Link Delay}, author = {Notcker and Domenico Scotece and Riccardo Bassoli and Luca Foschini and Frank H. P. Fitzek}, year = {2025}, date = {2025-12-01}, urldate = {2025-12-01}, booktitle = {IEEE Global Communications Conference (IEEE Globecom)}, pages = {5.95}, address = {Taipei, Taiwan}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close Zheng, Ruifeng; Zhou, Pengjie; Hofmann, Pit; Cabrera, Juan A.; Fitzek, Frank H. P.DNA-Based Molecular Communication: A Markov Approach to Channel Modeling and Detection Proceedings ArticleIn: IEEE Global Communications Conference (Globecom), 2025.BibTeX@inproceedings{Zheng2025:DNABased, title = {DNA-Based Molecular Communication: A Markov Approach to Channel Modeling and Detection}, author = {Ruifeng Zheng and Pengjie Zhou and Pit Hofmann and Juan A. Cabrera and Frank H. P. Fitzek}, year = {2025}, date = {2025-12-01}, urldate = {2025-12-01}, booktitle = {IEEE Global Communications Conference (Globecom)}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close Liu, How-Hang; Nazari, Hosein K.; Scheinert, Tobias; Senk, Stefan; Nguyen, Giang T.; Fitzek, Frank H. P.DHL: Dynamic History Length for Packet Order Recovery in Time-Sensitive Networks Proceedings ArticleIn: IEEE Globecom Workshops (GC Wkshps): Workshop on Emerging Topics in 6G Communications (GC Wkshps 2025-ET6GC), Taipei, Taiwan, 2025.BibTeX@inproceedings{Howhang2025:FRER_DHL, title = {DHL: Dynamic History Length for Packet Order Recovery in Time-Sensitive Networks}, author = {How-Hang Liu and Hosein K. Nazari and Tobias Scheinert and Stefan Senk and Giang T. Nguyen and Frank H. P. Fitzek}, year = {2025}, date = {2025-12-01}, urldate = {2025-12-01}, booktitle = {IEEE Globecom Workshops (GC Wkshps): Workshop on Emerging Topics in 6G Communications (GC Wkshps 2025-ET6GC)}, address = {Taipei, Taiwan}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Close Njoku, Buniechukwu; Ghadimi, Milad; Nande, Swaraj Shekhar; Rajabov, Akhmadjon; Yin, Ming; Kim, Ju Hoon; Scholtz, Ernest; Habibie, Muhammad Idham; Arar, Bassem; Hopfmann, Caspar; Bassoli, Riccardo; Fitzek, Frank H. P.Quantum entanglement resource utilization in quantum-classical networking Journal ArticleIn: Optical Switching and Networking, pp. 100829: 1–11, 2025.Links | BibTeX@article{njoku2025:qu",
  "content_length": 22929,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:26"
}