{
  "name": "Francisco Javier Nóvoa",
  "homepage": "https://pdi.udc.es/en/File/Pdi/HB9HJ",
  "status": "success",
  "content": "Francisco Javier Nóvoa Manuel File. Department Computer Science and Information Technologies Knowledgment area Telecommunications Software Engineering Research Research group Telemática Research lines Network Security, Intrusion Detection, Data Flow Analysis, IoT Medical Informatics, Biomedical Imaging Artificial Intelligence, Neural networks, Teaching merits evaluation 2 five years period(s) Research merits evaluation 2 six years period(s) Contacto UDC directory Orcid id0000-0003-3629-8120 ResearcherIDI-3169-2015 Scopus16837150200 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Administration of Infrastructures and Information Systems Degree in Computer Engineering Optional 0 18 Cybersecurity Business and Entrepreneurship Master in Cibersecurity Compulsory 0 10 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 1 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 16 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 1.5 Master`s Dissertation Master in Cibersecurity Compulsory 0 20 Network Administration Degree in Computer Engineering Optional 0 84 Secure Networks Master in Cibersecurity Compulsory 0 42 Work Placement Master in Cibersecurity Compulsory 0 25 Subject and involved studies Type Distance hours Total hours Administration of Infrastructures and Information Systems Degree in Computer Engineering Optional 0 18 Cybersecurity Business and Entrepreneurship Master in Cibersecurity Compulsory 0 10 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 12 Master`s Dissertation Master in Cibersecurity Compulsory 0 0 Network Administration Degree in Computer Engineering Optional 0 54.5 Secure Networks Master in Cibersecurity Compulsory 0 42 Work Placement Master in Cibersecurity Compulsory 0 30 Subject and involved studies Type Distance hours Total hours Administration of Infrastructures and Information Systems Degree in Computer Engineering Optional 0 21 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 52 Master's Dissertation Master in Cibersecurity Compulsory 0 40.5 Network Administration Degree in Computer Engineering Optional 0 41.5 Secure Networks Master in Cibersecurity Compulsory 0 42 Work Placement Master in Cibersecurity Compulsory 0 25 Subject and involved studies Type Distance hours Total hours Administration of Infrastructures and Information Systems Degree in Computer Engineering Optional 0 21 Application Techniques in Biotechnology Master's in Advanced Biotechnology Compulsory 0 5 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 24 Master's Dissertation Master's in Computer Engineering Compulsory 0 10 Master's Dissertation Master in Cibersecurity Compulsory 0 5 Network Administration Degree in Computer Engineering Optional 0 84 Secure Networks Master in Cibersecurity Compulsory 0 42 Work Placement Master in Cibersecurity Compulsory 0 27.5 Subject and involved studies Type Distance hours Total hours Administration of Infrastructures and Information Systems Degree in Computer Engineering Optional 0 12 Application Techniques in Biotechnology Master's in Advanced Biotechnology Compulsory 0 5 Communications Security Master in Cibersecurity Compulsory 0 4 Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 20 Internet: Networks and Data Degree in Data Science and Engineering Core 0 30 Network Administration Degree in Computer Engineering Optional 0 84 Networks Degree in Computer Engineering Compulsory 0 30 Secure Networks Master in Cibersecurity Compulsory 0 42 Work Placement Master in Cibersecurity Compulsory 0 15 Subject and involved studies Type Distance hours Total hours Administration of Infrastructures and Information Systems Degree in Computer Engineering Optional 0 12 Application Techniques in Biotechnology Master's in Advanced Biotechnology Compulsory 0 5 Communications Security Master in Cibersecurity Compulsory 0 4 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 24 Network Administration Degree in Computer Engineering Optional 0 84 Networks Degree in Computer Engineering Compulsory 0 60 Secure Networks Master in Cibersecurity Compulsory 0 42 Work Placement Master in Cibersecurity Compulsory 0 2.5 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Monday 10:00 a 12:00 Área Científica D3.03 - Teams 1st quarter Tuesday 10:00 a 12:00 Área Científica D3.03 - Teams 1st quarter Wednesday 10:00 a 12:00 Área Científica D3.03 - Teams 2nd quarter Monday 11:30 a 13:00 FIC. Lab. de Inv. 1.1 2nd quarter Tuesday 10:00 a 11:30 FIC. Lab. de Inv. 1.1 2nd quarter Wednesday 11:30 a 13:00 FIC. Lab. de Inv. 1.1 2nd quarter Thursday 11:30 a 13:00 FIC. Lab. de Inv. 1.1 EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 2019/2020 2018/2019 2017/2018 2016/2017 2015/2016 2014/2015 2013/2014 Automation of the deployment and management of communications networks: A case study Design and implementation of an enterprise network for monitoring and remote access to an industrial environment Implementation of a centralized authentication service on a corporate network Analysis, design and implementation of secure network infrastructure for an organization with multiple branch offices Planning and implementation of monitoring tools for a company's cloud infrastructure Design and implementation of the systems and communications infrastructure in an OT environment Design and migrate a new Active Directory for a company and integration with Azure AD Implementation of a quantum network simulation module for NS-3 Monitoring and filtering of http/https traffic through proxy technologies SIEM integrations to improve the detection and response capabilities in an organization Access recovery in self-managed blockchain wallets Analysis, design and implementation of a system of global monitoring of the systems of information of an entity Automation of network security policy management Automation tool for pentesting processes Development of a web application for the management of network devices through an out- of-band connection Hardening of the communications network of a research center Incorporation of new-generation security technologies into a corporate network Low Cost Automated Security Audit System Network automation: A case study Network flows analysis based anomaly detection system using machine learning techniques Scalable network data processing for anomaly detection systems SDWAN implementation risk assesment Security analysis of activity monitors: a study case Use of machine learning techniques for network traffic classification Use of machine learning techniques for network traffic classification Cybersecurity audit for a real company Development of a web application for the out-of-band management of data networks lab Development of a web application for the planification of out-of-band accesses to hardware resources in a computer network laboratory High availability and fault-tolerant storage virtualization in a metropolitan environment Passive traffic analysis on local area networks Study and implementation of open-source SIEM tools for prevention and detection of threats and problems Tool for wireless networks audit for small business enterprises Use of machine learning techniques for network traffic classification Use of machine learning techniques for network traffic classification Development of a web tool for network communication visualization Multicast traffic distribution in software defined networks: an application case Network anomaly detection using machine learning techniques Network anomaly detection using Machine Learning techniques Network anomaly detection using Machine Learning techniques Software solution for supporting data exchange on an online ordering platform Use of machine learning techniques for network traffic classification Anomaly detection on IoT networks based on Self Organizing Maps Design and implementation of a programmable network infrastructure Development of tool for network topology exploration based on OSPF data Passive analysis system to audit corporate networks using free software on a Raspberry Pi Data Center environmental monitoring system. Study of its security. Mobile application for high quality video processing, online publishing and real-time streaming Automated Deployment Services Virtualization at the Universidade da Coruña Design and implementation of a high capacity, convergent and fault tolerant network on campus environment Study and implementation of internal and external cache management systems to improve the performance of a corporate web platform Application development to control and monitor desktops Auditing system for corporative networks using open source software on a Raspberry Pi Classification and anomalous detection of computer network traffic applying artificial intelligence technologies Development of a primary care telehealth secure system based on WebRTC Development of a SIP-based softphone and integration with Asterisk PBX Development of an Application for Load Balancing IP Traffic Devolopment of a secure virtual video conference center Migration from a traditional telephony netw",
  "content_length": 46703,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:16"
}