{
  "name": "Frans A. Oliehoek",
  "homepage": "https://www.fransoliehoek.net/wp",
  "status": "success",
  "content": "Frans A. Oliehoek – interactive learning and decision making Skip to content Frans A. Oliehoek interactive learning and decision making Welcome to my home page. I am Full Professor Interactive Learning and Decision Making at the Department of Intelligent Systems at TU Delft, where I co-lead the Sequential Decision Making group. Additionally, you might be interested in the following: I am director and one of the  co-founders of the ELLIS Delft Unit, as well as an ELLIS Fellow. I am a senior member of AAAI. I am a board member of IFAAMAS. I am associate editor for JAIR and AIJ. Find me on LinkedIn or Mastodon (I pretty much stopped using twitter). My main research interests lie in what I call interactive learning and decision making: the intersection of AI, machine learning and game theory that focuses on an intelligent agent that interacts with a complex world. My long term vision is the construction of a collaborative AI scientist. In the short term, I try to generate fundamental knowledge about algorithms and models for learning complex tasks. Specifically, I believe that agents need models to support intelligent decision making. Learning such models is difficult, and given that our world constantly changes, we cannot assume that  agents will ever learn perfect models. Instead, we need to endow them with the capability to learn these models online, i.e., while interacting with their environments: they need to be able to use imperfect models, reason about the uncertainty in their predictions, and actively learn to improve these models (balancing task rewards and knowledge gathering). In addition, I think about how such abstract models might be applied to a variety of real-world tasks such as collaboration in multi-robot or human-AI systems, optimization of traffic control systems, intelligent e-commerce agents, etc. For more information about my research, look here. For research opportunities, look here. For more information about possible student projects (current TU Delft students), look here. News November 4th, 2025: ELLIS Coordinators meeting Delft/Nijmegen/Amsterdam Beginning of October, we co-organized the ELLIS coordinator’s meeting in Delft. Here is a summary: https://ellis.eu/news/strengthening-collaboration-across-europe-the-2nd-ellis-coordinators-retreat July 16th, 2025: Appointed Full Professor ‘Interactive Learning & Decision Making’ Happy to announce that the executive board of TU Delft has appointed me to Full Professor! Some more details here. June 30th, 2025: TMLR accepted: Bayesian RL with Abstraction Congrats to Rolf and all the other coathors on getting a paper accepted at TMLR! The paper shows how the technique for doing Bayesian RL in factored POMDPs (yes, we retain beliefs over the causal working of the world!) developed in earlier work can be combined with abstraction methods. More info here. August 28th, 2024: Outstanding Paper Award on Scientific Understanding @ RLC 2024 Very proud of my (graduated) student Miguel. His persistence made the difference for this final part of his PhD thesis! I'm extremely proud to share that our paper, Bad Habits, received the Outstanding Paper Award on Scientific Understanding in RL at @RL_Conference!Huge thanks to my incredible coauthors, Matthijs and @faoliehoek. pic.twitter.com/mJfmKm7uJt— Miguel Suau (@SuauMiguel) August 13, 2024 June 5th, 2024: Looking for PhD student With Julia Olkhovskaia as the main supervisor, I am looking for a (fully paid) PhD student. See details on my vacancy page. February 20th, 2023: Wanted: assist./assoc. professor in causal reinforcement learning At TU Delft, we are recruiting an assist/assoc. professor in causal reinforcement learning. More info here. December 2nd, 2022: Comments for Volkskrant For the Volkskrant, I commented on the Stratego article in science. Read it here. September 24th, 2022: Berkeley MARL Seminar talk online The talk that I gave for the Berkeley MARL seminar can now be seen on youtube. It gives an introduction to ideas of influence-based abstraction, focusing also on the inspirations from multiagent planning, as well as implications for future MARL. September 15th, 2022: DIALS accepted to NeurIPS’22 Our paper Distributed Influence-Augmented Local Simulators for Parallel MARL in Large Networked Systems was accepted to NeurIPS! It shows how influence-based abstraction can be used to parallelize and thus speed up multiagent reinforcement learning, while stabilizing the learning at the same time. June 30th, 2022: 2 ILDM papers to appear at ICML Our group will be presenting 2 papers at ICML’22: Influence-Augmented Local Simulators: A Scalable Solution for Fast Deep RL in Large Networked Systems. On the Impossibility of Learning to Cooperate with Adaptive Partner Strategies in Repeated Games Come find us at ICML, or reach out over email! Pages home bio research INFLUENCE research highlights team software publications teaching Student Projects events, seminars, etc. vacancies contact Recent Posts ELLIS Coordinators meeting Delft/Nijmegen/Amsterdam Appointed Full Professor ‘Interactive Learning & Decision Making’ TMLR accepted: Bayesian RL with Abstraction Outstanding Paper Award on Scientific Understanding @ RLC 2024 Looking for PhD student Categories events media news online-appendix research research-blog Uncategorized Archives November 2025 July 2025 June 2025 August 2024 June 2024 February 2023 December 2022 September 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 September 2021 July 2021 June 2021 May 2021 February 2021 November 2020 October 2020 July 2020 April 2020 March 2020 August 2019 July 2019 April 2019 March 2019 February 2019 December 2018 November 2018 July 2018 May 2018 April 2018 March 2018 Meta Log in Entries feed Comments feed WordPress.org PHP Code Snippets Powered By : XYZScripts.com",
  "content_length": 5859,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:43"
}