{
  "name": "Franca Garzotto",
  "homepage": "http://home.deib.polimi.it/garzotto",
  "status": "success",
  "content": "Garzotto / Website Professional Details Name Franca Garzotto Role Associate Professor University Politecnico di Milano Research Line Data, web and society Website i3lab.polimi.it Attachments Curriculum-Vitae.pdf List-of-Publications.pdf About Me Name Franca Garzotto Role Associate Professor Website i3lab.polimi.it University Politecnico di Milano E-mail franca.garzotto@polimi.it Research Line Data, web and society Phone +39 02 2399 3505 Location via Ponzio 34/5 20133 - MI FAX +39 02 2399 3411 Building 20, floor 1, room 049 Associate Professor Franca Garzotto is an Associate Professor of Computer Engineering at the Department of Electronics and Information, Politecnico di Milano. She has a Degree in Mathematics from the University of Padova (Italy) and a Ph.D. in Computer Engineering from the Politecnico di Milano. Since she joined the Politecnico di Milano, her theoretical research has focused on topics related to (hyper)document modeling, hypermedia design methods, usability engineering, multichannel web application models, adaptive hypermedia, human-computer interaction, while her applied research has mainly addressed the domain of e-learning and e-culture. She is (co-)author of over 80 publications in international conference proceedings, journals, and books. In the academic year 2005-06, Franca Garzotto’s teaching activity includes: - 3 undergraduate courses (Multimedia Tools and Techniques – Faculty of Industrial Design; Hypermedia Applications – Faculty of Computer Engineering; Human Computer Interaction - Faculty of Computer Engineering) - 2 graduate courses (Interaction Design - Faculty of Industrial Design, Laboratory of Human Computer Interaction- Faculty of Computer Engineering) Franca Garzotto has been tutorial chair or member of the technical program committee of several editions of international conferences: ACM Hypertext and Hypermedia, ACM Multimedia, IFIP INTERACT, ICHIM, WebNet, ED-Media, Museums and the Web. She served as Co-Chair of a number of international workshops and conferences, including: The First International Workshop on \"Evaluation and Quality Criteria for Multimedia Applications\"(S. Francisco - CA, November 1995); The First International Workshop on \"Hypermedia Design\" (Montpellier – France, June 1996); ICHIM01, the largest conference worldwide on Information technology and Cultural Heritage (Milano, September 2001). She was European chair of ACM SIG-WEB (ACM Special Interest Group on Hypermedia & Web) from 1997 to 1999. Since 1988, Franca Garzotto has been involved in many EC funded research projects: INDOC, SUPERDOC, MINER, HYTEA, HYPERTOUR, SITMOON, UWA, OPENDRAMA, VNET5, HELP, MINERVA, EPOCH. She has been project manager for the Politecnico di Milano in three EU funded projects in the field of e-learning: TELL - Towards Effective network supported coLLaborative learning activities, ADAPT – Adaptivity and adaptability in ODL based on ICT, ELEN – A network of e-learning Centers. She is currently Member of the Board of Directors of the EC funded Network of Excellence EPOCH European Research Network on Excellence in Processing Open Cultural Heritage (IST-2002- 507382). From 1991 to 1995, she worked as a consultant of major national and international companies (including SIEMENS Munich). In 2002, she acted as project manager for the Italian Ministry of Cultural Heritage in the project “Feasibility Study for the Portal of Italian Cultural Heritage”. INTERNATIONAL RESEARCH PROJECTS PROJECT COORDINATOR OF: EIT 2013 PLC “Playful Learning on the Cloud” – Activity #49 – Action Line Smart Spaces – EC Program EIT ICT Lab 2013 M4ALL ((Motion-based adaptable playful learning experiences for children with motor and mental disabilities ) Project # 531219- LLP-1-2012-1-IT-KA3-KA3MP – EC Long Life Learning KA3-ICT Program – 2012 -2014 EIT 2015 P3S: “Playful Supervised Smart Spaces” Activity 15257 – Action Line Smart Spaces – EC Program EIT ICT Lab 2015 Task Coordination responsible of Politecnico di Milano Unit of: MEDINA (MEDiterranean by Internet Access) – Project #314 – EC EUMEDIS Program – 2000-2003 (Scientific Coordinator) OPENDRAMA (The Digital Heritage of Opera in the Open Network Environment )- Project # IST-2000-28197 – EC FP5 Program – 2001-2003 EPOCH (European Research Network on Excellence in Processing Open Cultural Heritage) – Project # 507382 –EC Program FP6-IST 2004-2007 E-LEN (A Network of E-LearNing Centers) Project # 101421-CP-1-2002-1-CYEC SOCRATES/MINERVA Program (OCL and ICT in Education) – 2002-2004 ADAPT (Adaptivity and adaptability in ODL based on ICT) – Project #101144-CP-1-2002-1-NL- EC SOCRATES – MINERVA Program (OCL and ICT in Education) – 2002-2004 TELL (Towards Effective network supported 6pprox.6tiona learning activities) – Project #EAC/61/03/GR009 – EC e- learning Programme – 2004-2005 MAPS (Marketing Activities for the Promotion of Syrian Cultural Heritage) Project # 119756 – EC Program EUROPE AID – 2005-2006 EDUCOMICS (Using Web Comics in Education) Project #142424-2008 – EC Lifelong Learning Programme (Sub- programme: Multilateral Projects) 2008-2010 PREATY (Proposing modern E-Assessment approaches and Tools to Young and experienced in-service teachers ) – Project # 526965- LLP-1-2012-1-GR-COMENIUS-CMP) EC Lifelong Learning Programme ( Sub-programme: Multilateral Projects ) – 2012-2014 EIT 2014 “StreetSmart” – EC Program EIT ICT Lab 2014: Task Leader of “ Content & Personalization; Task Leader of “Service Pilots”; Task Leader of “Service and Application Transfer” EIT 2014 “3cixty” – EC Program EIT ICT Lab 2014: Task Leader of “3cixty App Challenge” EIT 2014 “3cixty” – EC Program EIT ICT Lab 2014: Task Leader of “3cixty Evaluation” EIT 2015 “StreetSmartRetail” – EC Program EIT ICT Lab 2015: Task “ Fashion&Design” EIT 2017 - “CAB – Connected Products Analytics for Brands” - EC Program EIT Digital 2017– Tasks “UX investigation”, “CAB Software Platform Architecture”, “Customer needs elicitations” EIT 2017 “TWB – Therapeutic Services based on Wearable Virtual Reality and Bio-sensors” - - EC Program EIT Digital 2017 Tasks “TWB platform: first integration of Data Services and WIVR Apps”, “Wearable Immersive Virtual Reality (WIVR)” EIT 2018 “CAB – Connected Products Analytics for Brands” - EC Program EIT Digital 2018-Tasks “Connect and Capture”, “Learn And Recommend” EIT 2018 – PLET – Product Life Cycle Management for e-Toys. EC Program EIT Digital 2018- Tasks “T4 - Gateway and Data acquisition from e-toys”, “T6 - T6 - Empirical Evaluation” EIT 2018 – 2019 “TWB – Therapeutic Services based on Wearable Virtual Reality and Bio-sensors” - EC Program EIT Digital 2018 – Tasks “TWB as a Service”, “Go-to-Market”, “On-the-field experimentation” EIT 2019 – VOXANA - Voice Analytics for Brands - EC Program EIT Digital 2019- Tasks “Service Design and Integration” and “Field Studies” EIT 2019-20: LETSSAY - Conversational Technology for Speech and Language Therapy. Task “Service Development and Integration” and “Empirical Study” Team Member of: INDOC (Intelligent DOCument Generation) – Project # 1542 – EC ESPRIT 1 Program – 1987-89 SUPERDOC (SUPER DOCument ) – Project # 2170 – EC ESPRIT 2 Program 1991-93: HYTEA (Hypertext Authoring) – Project # 5252- EC ESPRIT 3 Program 1992-94 HIFI (Hypertext Interface For Information: multimedia and relational databases ) – Project # 1060 – EC ESPRIT 2 Program 1992-94 MINERS (Editorial Platform for Cultural Heritage and Ancient Manuscripts) Project #1168 – EC ESPRIT 3 Program -1993-96 SIMOS (Supporting Interactive Multimedia On-line Services) – Project # 20979 – EC FP4-ESPRIT 4 Program – 1997-99 SIT-MOON (System of integrated tools for the creation of multimedia contents delivered off-line and on-line) – Project #25652 – EC FP4-ESPRIT 4 Program – 1997-99 HYPERTOUR (A HYPermedia platform for the exploitation and promotion of TOURrism in Europe of 2000) - # Project 17214 – EC FP5-IST – 2000-2002 UVA (Ubiquitous Web Applications) – Project #25131IST-2000-25131 – EC FP5-IST Program – 2001- 2003 RESEARCH As witnessed by the publication track, my research trajectory is quite variegated, in terms of research fields and application domains. My work started in the field of \"Hypertext & Hypermedia\", has expanded to \"Web Engineering\", and then has progressively moved towards \"HCI\" (Human-Computer Interaction). Research achievements have been applied to diverse sectors: cultural heritage, tourism, education, learning, entertainment, commerce, health. In the last years, interactive technology for children ( especially children with special needs) has been one of my main interests. In spite of this apparent diversification of activities, three key concepts underlie my whole research, as a common thread that binds my efforts across time, disciplines, and domains: the focus on \"conceptual modeling\" and, more generally, an attitude towards abstraction (probably derived from my early studies in mathematics a multidisciplinary approach, attempting to bridge different disciplines and areas the collaboration with “external” stakeholders (e.g., companies, learning and cultural institutions, therapeutic centers) the curiosity towards \"real world\" problems and needs, regarded as contexts for inspiration and stimuli for new research the attempt to create technology that would have some societal impact and would bring concrete benefits to society at large Bibliometric data (source: Google Scholar - last inspected July 25, 2019) https://scholar.google.it/citations?user=P6uIlrAAAAAJ&hl=it H-index = 35; i10-index = 93; Number of citations= 5296 Most cited paper: 1056 citations Hypertext, Hypermedia, and Web Engineering In early nineties P. Paolini, D. Schwabe and myself defined HDM, the first conceptual model for Hypertext and Hypermedia and the first attempt to promote a systematic, engineering approach to this class of system.HDM provides some key modeling abstractions for hypertext/hypermedia systems, and is the ancestor of most models and design approaches for (multic",
  "content_length": 27875,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:52"
}