{
  "name": "Frank van Harmelen",
  "homepage": "http://www.cs.vu.nl/~frankh",
  "status": "success",
  "content": "Frank van Harmelen's Home Page Frank van Harmelen Knowledge Representation and Reasoning Group and If you are any good at all you know you could be better Brief CV Frank van Harmelen (1960) is a professor in Knowledge Representation & Reasoning in the Computer Science department (Faculty of Science) at the Vrije Universiteit Amsterdam. After studying mathematics and computer science in Amsterdam, he moved to the Department of AI in Edinburgh, where he was awarded a PhD in 1989 for his research on meta-level reasoning. While in Edinburgh, he co-developed a logic-based toolkit for expert systems, and worked with Prof. Alan Bundy on proof planning for inductive theorem proving. After his PhD research, he moved back to Amsterdam where he worked from 1990 to 1995 in the SWI Department under Prof. Wielinga, on the use of reflection in expert systems, and on the formal underpinnings of the CommonKADS methodology for Knowledge-Based Systems. In 1995 he joined the AI research group at the Vrije Universiteit Amsterdam, where he now leads the Knowledge Representation and Reasoning Group. Since 2000, he has played a leading role in the development of the Semantic Web, which aims to make data on the web semantically interpretable by machines through formal representations. He was co-PI on the first European Semantic Web project (OnToKnowledge, 1999), which laid the foundations for the Web Ontology Language OWL. OWL has become a worldwide standard, it is in wide commercial use, and has become the basis for an entire research community. He co-authored the Semantic Web Primer, the first academic textbook of the field and now in its third edition, which is in worldwide use (translations in 5 languages, 10.000 copies sold of the English edition alone). He was one of the architects of Sesame, an RDF storage and retrieval engine, which is in wide academic and industrial use with over 200,000 downloads. This work received the 10-year impact award at the 11th International Semantic Web Conference in 2012, which is the most prestigous award in the field. He is principal investigator of the Hybrid Intelligence Centre, a 20m€, 10 year collaboration between researchers at 6 Dutch universities into AI systems that collaborate with people instead of replacing them. He is a fellow of the European AI Society ECCAI (membership limited to 3% of all European AI researchers), in 2014, he was admitted as member of the Academia Europaea (limited to the top 5% of researchers in each field), and in 2015 he was admitted as Member of the Royal Netherlands Society of Sciences and Humanities (500 members across all sciences). He is a guest professor at the Wuhan University of Science and Technology (WUST) in Wuhan, China. Some thoughts and Links I'm proud to teach in our new AI curriculum which is now joint with our colleagues with the UvA. This allows us to teach one the few Master courses in Europe that covers the whole breadth of AI, from Machine Learning to Knowledge Representation, and from image analysis to language understanding. Daily Dilberts Science Cartoons Popularising Personal Positions I lead the Knowledge Representation and Reasoning group in the CS Department of the VU University Amsterdam I am director of the The Network Institute Publications See my publication page or my profile on Google Scholar Social Media See my Twitter-stream and blog. My Interests See below for an impression of my interests through various cloud images (click on images for more details). See also the page that Wikipedia wrote about me. My Academic Network A tag-cloud of all words in the titles of all my papers My co-authors by insitution (from the SWJ Portal) A map of my co-authors on all my Springer publications. Powered by AuthorMapper My Twitter Network A tag-cloud of my Tweets A tag-cloud of the profiles of my Twitter followers View FrankVanHarmele's profile on TweepsMap A map of my Twitter 2600+ followers My LinkedIn Network My LinkedIn network. Green = international semantic web community, Pink = Dutch semantic web community, Orange = VU University colleagues, blue = some VU University students My Facebook Network Green = VU, Purple = LarKC, Red = EU Semantic Web,Blue = US Semanic Web My Facebook Network (with names) My Facebook Network (iconized) This geo-image shows that the world is not really a small place, yet..",
  "content_length": 4353,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:38"
}