{
  "name": "Francis R. Bach",
  "homepage": "http://www.di.ens.fr/~fbach",
  "status": "success",
  "content": "Francis Bach - INRIA - ENS - PSL Francis Bach INRIA - SIERRA project-team Departement d'Informatique de l'Ecole Normale Superieure PSL Research University Centre de Recherche INRIA de Paris 48 rue Barrault CS61534 75647 Paris Cedex Blog - Tutorials - Courses - Students - Alumni - Publications - Software Book: Learning Theory from First Principles, published in December 2024 at MIT Press Final pdf version Code (python, Matlab) Blog post I am a researcher at INRIA, leading since 2011 the SIERRA project-team, which is part of the Computer Science Department at Ecole Normale Supérieure, and a joint team between CNRS, ENS and INRIA. I completed my Ph.D. in Computer Science at U.C. Berkeley, working with Professor Michael Jordan, and spent two years in the Mathematical Morphology group at Ecole des Mines de Paris, I then joined the WILLOW project-team at INRIA/Ecole Normale Supérieure/CNRS from 2007 to 2010. From 2009 to 2014, I was running the ERC project SIERRA, and I am now running the ERC project SEQUOIA. I have been elected in 2020 at the French Academy of Sciences. I am interested in statistical machine learning, and especially in optimization, sparse methods, kernel-based learning, neural networks, graphical models, and signal processing. [CV (English)] [CV (French)] [short bio][short bio (francais)] Tutorials / mini-courses / keynotes (recent - older ones below) July 2025: Conference on Learning Theory [slides] April 2025: Graduate School in Systems, Optimization, Control and Networks (SOCN) [board-1] [board-2] [board-3] [board-4] [board-5] [board-6] [exercises] September 2024: CIME School on High-Dimensional Approximation [notes] September 2023: Summer school on distributed learning [slides] July 2021: PRAIRIE/MIAI AI summer school [slides] September 2020: Hausdorff School, MCMC: Recent developments and new connections - Large-scale machine learning and convex optimization [slides] June 2020: Machine Learning Summer School, Tubingen - Large-scale machine learning and convex optimization [slides] Courses (recent - older ones below) Fall 2025: Learning theory from first principles - Mastere M2 IASD Fall 2024: Learning theory from first principles - Mastere M2 IASD Fall 2023: Learning theory from first principles - Mastere M2 Mash Fall 2022: Learning theory from first principles - Mastere M2 Mash Spring 2022: Optimisation et Apprentissage Statistique - Master M2 \"Mathematiques de l'aleatoire\" - Universite Paris-Sud (Orsay) Fall 2021: Learning theory from first principles - Mastere M2 Mash Spring 2021: Statistical machine learning - Ecole Normale Superieure (Paris) Spring 2021: Machine Learning - Masters ICFP, Ecole Normale Superieure Spring 2021: Optimisation et Apprentissage Statistique - Master M2 \"Mathematiques de l'aleatoire\" - Universite Paris-Sud (Orsay) PhD Students and Postdocs Eliot Beyler Eugène Berta, co-advised with Michael Jordan Nabil Boukir, co-advised with Michael Jordan Sacha Braun, co-advised with Michael Jordan Léo Dana, co-advised with Loucas Pillaud-Vivien Juliette Decugis, co-advised with Gabriel Synnaeve and Taco Cohen Etienne Gauthier, co-advised with Michael Jordan Armand Gissler Frederik Kunstner Simon Martin, co-advised with Giulio Biroli Fabian Schaipp, co-advised with Umut Simsekli and Adrien Taylor Alumni Martin Arjovsky, Research scientist, Deepmind Dmitry Babichev, Researcher, Huawei P Balamurugan, Assistant Professor, Indian Institute of Technology, Bombay Anaël Beaugnon, Data scientist, Roche Amit Bermanis, Senior Algorithms Researcher, ThetaRay Eloïse Berthier, Researcher at ENSTA, Paris Raphaël Berthier, tenure-track research faculty, Inria Sorbonne Université Alberto Bietti, Research scientist, Flat Iron Institute, New York Vivien Cabannes, Research Scientist, Meta, Paris Lénaïc Chizat, Assistant Professor, EPFL, Ecole Polytechnique Fédérale de Lausanne Timothee Cour, Engineer at Google Hadi Daneshmand, Post-doctoral fellow, MIT Alexandre Défossez, Research scientist, Kyutai, Paris Aymeric Dieuleveut, Professor, Ecole Polytechnique, Palaiseau Christophe Dupuy, Amazon, Cambridge, USA Bertille Brossolet (Follain), Agregio Solution Pascal Germain, Assistant professor, Université Laval, Canada Robert Gower, Research Scientist, Flatiron Institute, New York Edouard Grave, Research scientist, Kyutai, Paris Zaid Harchaoui, Associate Professor, University of Washington Hadrien Hendrikx, Researcher, Inria Grenoble Toby Hocking, Assistant Professor, Northern Arizona University David Holzmüller, Researcher, Inria, Saclay Nicolas Flammarion, Assistant Professor, Ecole Polytechnique Federale de Lausanne Fajwel Fogel, Research scientist, Sancare Rodolphe Jenatton, CTO, Bioptimus Armand Joulin, Research scientist, Google Deepmind, Paris Hans Kersting, Research Scientist, Yahoo Research Ziad Kobeissi, Researcher, Inria, Saclay Sesh Kumar, Research fellow, Imperial College Business School Simon Lacoste-Julien, Professor, Université de Montréal Remi Lajugie, Professeur d'Informatique, Lycée Janson de Sailly, Paris Marc Lambert Augustin Lefèvre, Data scientist, YKems Ivan Lerner, Praticien Hospitalo-Universitaire, Université Paris-Cité Nicolas Le Roux, Researcher, Microsoft Research, Montréal Ronny Luss, Researcher, IBM Research Julien Mairal, Researcher at Inria, Grenoble Ulysse Marteau-Ferey, Research scientist, Owkin Bamdev Mishra, Research scientist, Amazon Bangalore Céline Moucer, Ministère du Budget Boris Muzellec, Research scientist, Owkin Anil Nelakanti, Research scientist, Amazon Bangalore Alex Nowak-Vila, Research scientist, Owkin Guillaume Obozinski, Deputy Chief Data Scientist, Swiss Data Science Center Dmitrii Ostrovskii, Postdoctoral researcher, University of South California Loucas Pillaud-Vivien, Postdoctoral researcher, Ecole Polytechnique Federale de Lausanne Anastasia Podosinnikova, Postdoctoral fellow, MIT Fabian Pedregosa, Researcher, Google Brain, Montréal Rafael Rezende, Postdoctoral researcher, Naver Labs, Grenoble Anant Raj, Assistant Professor, Indian Institute of Science, Bangalore, India Théo Ryffel, Arkhn Thomas Schatz, Assistant professor, Aix-Marseille Université, Marseille Corbinian Schlosser Mark Schmidt, Associate professor, University of British Columbia Damien Scieur, Research scientist, Samsung, Montreal Nino Shervashidze, Data scientist, Sancare Tatiana Shpakova, Researcher, Huawei Matthieu Solnon, Professeur de Mathématiques, CPGE, Lycée Lavoisier Lawrence Stewart, Research scientist, Google Deepmind, Paris Adrien Taylor, Research scientist, Inria Paris Blake Woodworth, Assistant Professor, George Washington University Mikhail Zaslavskiy, Byopt Publications 2025 Eugène Berta, David Holzmüller, Michael I. Jordan, Francis Bach. Structured Matrix Scaling for Multi-Class Calibration. Technical report, arXiv:2511.03685, 2025. [pdf] Antônio H. Ribeiro, David Vävinggren, Dave Zachariah, Thomas B. Schön, Francis Bach. Kernel Learning with Adversarial Features: Numerical Efficiency and Adaptive Regularization. Technical report, arXiv:2510.20883, 2025. [pdf] Etienne Gauthier, Francis Bach, Michael I. Jordan. Adaptive Coverage Policies in Conformal Prediction. Technical report, arXiv: 2510.04318, 2025. [pdf] Nathan Doumèche, Francis Bach, Gérard Biau, Claire Boyer. Fast kernel methods: Sobolev, physics-informed, and additive models. Technical report, arXiv:2509.02649, 2025. [pdf] Eliot Beyler, Francis Bach. Convergence of Deterministic and Stochastic Diffusion-Model Samplers: A Simple Analysis in Wasserstein Distance. Technical report, arXiv:2508.03210, 2025. [pdf] Sacha Braun, Eugène Berta, Michael I. Jordan, Francis Bach. Multivariate Conformal Prediction via Conformalized Gaussian Scoring. Technical report, arXiv:2507.20941, 2025. [pdf] Francis Bach. On the Effectiveness of the z-Transform Method in Quadratic Optimization. Technical report, arXiv:2507.03404, 2025. [pdf] Zijian Guo, Zhenyu Wang, Yifan Hu, Francis Bach. Statistical Inference for Conditional Group Distributionally Robust Optimization with Cross-Entropy Loss. Technical report, arXiv:2507.09905, 2025. [pdf] Frederik Kunstner, Francis Bach. Scaling Laws for Gradient Descent and Sign Descent for Linear Bigram Models under Zipfs Law. Technical report, arXiv:2505.19227, 2025. [pdf] Etienne Gauthier, Francis Bach, Michael I. Jordan. Backward Conformal Prediction. Technical report, arXiv:2505.13732, 2025. [pdf] Zhenyu Wang, Molei Liu, Jing Lei, Francis Bach, Zijian Guo. StablePCA: Learning Shared Representations across Multiple Sources via Minimax Optimization. Technical report, arXiv:2505.00940, 2025. [pdf] Marc Lambert, Francis Bach, Silvère Bonnabel. Entropy Regularized Variational Dynamic Programming for Stochastic Optimal Control. Technical report, HAL:05016406, 2025. [pdf] Sacha Braun, Liviu Aolaritei, Michael I. Jordan, Francis Bach. Minimum Volume Conformal Sets for Multivariate Regression. Technical report, arXiv:2503.19068, 2025. [pdf] Etienne Gauthier, Francis Bach, Michael I. Jordan. E-Values Expand the Scope of Conformal Prediction. Technical report, arXiv:2503.13050, 2025. [pdf] Eliot Beyler, Francis Bach. Optimal Denoising in Score-Based Generative Models: The Role of Data Regularity. Technical report, arXiv:2503.12966, 2025. [pdf] Léo Dana, Francis Bach, Loucas Pillaud-Vivien. Convergence of Shallow ReLU Networks on Weakly Interacting Data. Technical report, arXiv:2502.16977, 2025. [pdf] Nathan Doumèche, Francis Bach, Éloi Bedek, Gérard Biau, Claire Boyer, Yannig Goude. Forecasting time series with constraints. Technical report, arXiv:2502.10485, 2025. [pdf] Lawrence Stewart, Francis Bach, Quentin Berthet. Building Bridges between Regression, Clustering, and Classification. Technical report, arXiv:2502.02996, 2025. [pdf] Eugène Berta, David Holzmüller, Michael I. Jordan, Francis Bach. Rethinking Early Stopping: Refine, Then Calibrate. Technical report, arXiv:2501.19195, 2025. [pdf] [slides] Alexandre François, Antonio Orvieto, Francis Bach. An Uncertainty Principle for Linear Recurrent Neu",
  "content_length": 75162,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:08"
}