{
  "name": "Frank Deinzer",
  "homepage": "https://fiw.thws.de/fakultaet/personen/dozentinnen-und-dozenten/person/prof-dr-frank-deinzer",
  "status": "success",
  "content": "Dozentinnen und Dozenten :: Technische Hochschule Würzburg-Schweinfurt Zum Inhalt wechseln Zum Hauptmenü wechseln Zum Navigationspfad wechseln Zur Suche wechseln Zur Sprachauswahl wechseln Zur Servicenavigation wechseln Dozentinnen und Dozenten Prof. Dr. Frank Deinzer Fakultät Informatik und Wirtschaftsinformatik Telefon +49 931 3511-8303 E-Mail frank.deinzer[at]thws.de Besucheranschrift Sanderheinrichsleitenweg 20 97074 Würzburg Raum I.3.26 Sprechstunden Nach Vereinbarung Aufgabenbereich(e) Künstliche Intelligenz (CAIRO)SensordatenfusionsverfahrenMustererkennung und maschinelles LernenComputergrafikTheoretische Informatik Lehrgebiete Lehrveranstaltungen Bachelor InformatikGrundlagen Algorithmen und DatenstrukturenGrundlagen der Theoretischen InformatikComputergrafikDigitale Medien- und MultimediatechnikenBachelor Informationssicherheit Grundlagen Algorithmen und DatenstrukturenMaster Artificial IntelligenceReasoning and Decision Making Under UncertaintyProjekte KI Projekte Aktuell laufende Forschungs- und Entwiclungsprojekte Indoor-LokalisierungsimpleLocsimpleLoc@YouTubeTeam: Toni Fetzer, Frank Ebner, Marukus Bullmann, Markus Ebner, Steffen KastnerAugmented Reality für MuseenAugmented ArtTeam: Toni Fetzer, Sebastian Kaim, Steffen KastnerMaschinell lernendes optisches Prüfsystem (MOPS)Leitung: Prof. Dr. Bohn, Prof. Dr. Frank DeinzerTeam: Markus Bullmann, Andreas Linke, Nico Prappacher Publikationen Publikationen, Preise und Patente Bücher[1] Philip Johannes Gouverneur. Machine Learning Methods for Pain Investigation Using Physiological Signals. Hrsg. von Frank Deinzer und Marcin Grzegorzek. Bd. 6. Human Data Understanding - Sensors, Models, Knowledge. Berlin: Logos Verlag, 2024. ISBN: 978-3-8325-5827-7.[2] Sylwia Henselmeyer. Short-Term Load Forecasting using Machine Learning Methods. Hrsg. von Frank Deinzer und Marcin Grzegorzek. Bd. 7. Human Data Understanding - Sensors, Models, Knowledge. Berlin: Logos Verlag, 2024. ISBN: 978-3-8325-5851-2.[3] Raoul Hoffmann. Analysing Data from Capacitive Floor Sensors for Human Gait Assessment Using Artificial Neural Networks. Hrsg. von Frank Deinzer und Marcin Grzegorzek. Bd. 5. Human Data Understanding - Sensors, Models, Knowledge. Berlin: Logos Verlag, 2023. ISBN: 978-3-8325-5748-5.[4] Xinyu Huang. Sensor-Based Sleep Stage Classification Using Deep Learning. Hrsg. von Frank Deinzer und Marcin Grzegorzek. Bd. 4. Human Data Understanding - Sensors, Models, Knowledge. Berlin: Logos Verlag, 2023. ISBN: 978-3-8325-5617-4.[5] Muhammad Adeel Nisar. Sensor-Based Human Activity Recognition for Assistive Health Technologies. Hrsg. von Frank Deinzer und Marcin Grzegorzek. Bd. 3. Human Data Understanding - Sensors, Models, Knowledge. Berlin: Logos Verlag, 2022. ISBN: 978-3-8325-5571-9.[6] Frédéric Li. Deep Learning for Time-series Classification Enhanced by Transfer Learning Based on Sensor Modality Discrimination. Hrsg. von Frank Deinzer und Marcin Grzegorzek. Bd. 2. Human Data Understanding - Sensors, Models, Knowledge. Berlin: Logos Verlag, 2021. ISBN: 978-3-8325-5396-8.[7] Frank Ebner. Smartphone-Based 3D Indoor Localization and Navigation. Hrsg. von Frank Deinzer und Marcin Grzegorzek. Bd. 1. Human Data Understanding - Sensors, Models, Knowledge. Berlin: Logos Verlag, 2020. ISBN: 978-3-8325-5232-9. DOI: 10.30819/5232.[8] Frank Deinzer. Optimale Ansichtenauswahl in der aktiven Objekterkennung. Logos Verlag Berlin, 2005.Buchkapitel[9] Lukas Köping und Frank Deinzer. „Realidades Virtuales/Aumentadas para el Desarrollo Social: Experiencias Entre Europa y Latinoamerica“. In: Universidad de Belgrano, 2014. Kap. Real-Time Indoor Localization for Augmented and Virtual Reality Applications. ISBN: 978-950-757-046-9.[10] Francisco Serón, Carlos Vaz de Carvalho, Melanie Saul, Frank Deinzer, Roberto Guerrero, Juan Carlos Parra, Cristiano Costa und Sandro Rigo. „Realidades Virtuales/Aumentadas para el Desarrollo Social: Experiencias Entre Europa y Latinoamerica“. In: Universidad de Belgrano, 2014. Kap. Virtual Reality, Augmented Reality and Ubiquitous Computing: Concepts, Technology and Practice. ISBN: 978-950-757-046-9.Zeitschriftenbeiträge[11] Toni Fetzer, Frank Ebner, Frank Deinzer und Marcin Grzegorzek. „Using Barometer for Floor Assignation within Statistical Indoor Localization“. In: Sensors 23.1 (2023). ISSN: 1424-8220. DOI: 10.3390/s23010080. URL: www.mdpi.com/1424-8220/23/1/80.[12] Toni Fetzer, Julian Maier, Markus Ebner, Markus Bullmann und Frank Deinzer. „Digitales Spaghetti-Diagramm zur Laufweganalyse“. In: wt Werkstattstechnik online 112.10/2022 (Okt. 2022), S. 727–731. DOI: 0.37544/1436498020221097.[13] Sebastian Gielinger, Gunther Bohn, Frank Deinzer und Andreas Linke. „Investigation of an Inline Inspection Method for the Examination of Cylinder-like Specular Surfaces Using Deflectometry“. In: Applied Sciences 12.13 (2022). ISSN: 2076-3417. DOI: 10.3390/app12136449. URL: www.mdpi.com/2076-3417/12/13/6449.[14] Frank Deinzer und Toni Fetzer. „Die Mischung macht’s: Mit KI und Augmented Reality die Welt immersiv erkunden“. In: Transfer – Das Steinbeis-Magazin 2021.3 (2021), S. 39–41.[15] Markus Bullmann, Toni Fetzer, Frank Ebner, Markus Ebner, Frank Deinzer und Marcin Grzegorzek. „Comparison of 2.4 GHz WiFi FTM- and RSSI-Based Indoor Positioning Methods in Realistic Scenarios“. In: Sensors 20.16 (2020). ISSN: 1424-8220. DOI: 10.3390/s20164515. URL: www.mdpi.com/1424-8220/20/16/4515.[16] Markus Ebner, Toni Fetzer, Markus Bullmann, Frank Deinzer und Marcin Grzegorzek. „Recognition of Typical Locomotion Activities Based on the Sensor Data of a Smartphone in Pocket or Hand“. In: Sensors 20.22 (2020). ISSN: 1424-8220. DOI: 10.3390/s20226559. URL: www.mdpi.com/1424-8220/20/22/6559.[17] Nico Prappacher, Markus Bullmann, Gunther Bohn, Frank Deinzer und Andreas Linke. „Defect Detection on Rolling Element Surface Scans Using Neural Image Segmentation“. In: Applied Sciences 10.9 (2020). ISSN: 2076-3417. DOI: 10.3390/app10093290. URL: www.mdpi.com/1424-8220/18/12/4095.[18] Toni Fetzer, Frank Ebner, Markus Bullmann, Frank Deinzer und Marcin Grzegorzek. „Smartphone-Based Indoor Localization within a 13th Century Historic Building“. In: Sensors 18.12 (2018). ISSN: 1424-8220. DOI: 10.3390/s18124095. URL: www.mdpi.com/1424-8220/18/12/4095.[19] Frank Ebner, Toni Fetzer, Frank Deinzer und Marcin Grzegorzek. „On Wi-Fi Model Optimizations for Smartphone-Based Indoor Localization“. In: ISPRS International Journal of Geo-Information 6.8 (2017). 233. ISSN: 2220-9964. DOI: 10.3390/ijgi6080233. URL: www.mdpi.com/2220-9964/6/8/233.[20] Joaquín Torres-Sospedra, Antonio R. Jiménez, Stefan Knauth, Adriano Moreira, Yair Beer, Toni Fetzer, Viet-Cuong Ta, Raul Montoliu, Fernando Seco, Germán M. Mendoza-Silva, Oscar Belmonte, Athanasios Koukofikis, Maria João Nicolau, António Costa, Filipe Meneses, Frank Ebner, Frank Deinzer, Dominique Vaufreydaz, Trung-Kien Dao und Eric Castelli. „The Smartphone-Based Offline Indoor Location Competition at IPIN 2016: Analysis and Future Work“. In: Sensors 17.3 (2017). 557. ISSN: 1424-8220. DOI: 10.3390/s17030557. URL: www.mdpi.com/1424-8220/17/3/557.[21] Lukas Köping, Frank Ebner, Marcin Grzegorzek und Frank Deinzer. „Indoor Localization Using Step and Turn Detection Together with Floor Map Information“. In: FHWS Science Journal 1 (2014), S. 40–49.[22] Lukas Köping, Thomas Mühsam, Christian Ofenberg, Bernhard Czech, Michael Bernard, Jens Schmer und Frank Deinzer. „Indoor Navigation Using Particle Filter and Sensor Fusion“. In: Annual of Navigation 19.2 (Dez. 2012), S. 31–40.[23] Frank Deinzer, Christian Derichs, Joachim Denzler und Heinrich Niemann. „A Framework for Actively Selecting Viewpoints in Object Recognition“. In: International Journal of Pattern Recognition and Artificial Intelligence 23.4 (2009), S. 765–799.[24] Alexander Kubias, Frank Deinzer, Tobias Feldmann, Dietrich Paulus, Bernd Schreiber und Thomas Brunner. „2D/3D Image Registration on the GPU“. In: Pattern Recognition and Image Analysis 18.3 (2008), S. 381–389.[25] Philipp Bernhardt, Markus Lendl und Frank Deinzer. „New Technologies to Reduce Pediatric Radiation Doses“. In: Pediatric Radiology 36, Supplement 1 (2006), S. 212–215.[26] C. Karmonik, C. M. Strother, X. Chen, Frank Deinzer, R. Klucznick und M. E. Mawad. „Stent-Assisted Coiling of Intracranial Aneurysms Aided by Virtual Parent Artery Reconstruction“. In: AJNR American Journal of Neuroradiology 26.6 (Okt. 2005), S. 2368–2370.[27] Christoph Gräßl, Frank Deinzer, F. Mattern und Heinrich Niemann. „Improving Statistical Object Recognition Approaches by a Parameterization of Normal Distributions“. In: Pattern Recognition and Image Analysis (Advances in Mathematical Theory and Applications) 14.2 (2004), S. 222–230. ISSN: 1054-6618.Konferenzbeiträge[28] Toni Fetzer, Markus Bullmann, Steffen Kastner und Frank Deinzer und Marcin Grzegorzek. „Advancing Smartphone-based Indoor Positioning through Particle Distribution Optimization“. In: 27th International Conference on Information Fusion, FUSION 2024, Venice, Italy, July 7-11, 2024. 2024, to appear.[29] Steffen Kastner, Markus Bullmann, Markus Ebner, Toni Fetzer, Frank Deinzer und Marcin Grzegorzek. „Refinement of Sparsely Tagged Ground Truth Paths Using PDR and Particle Filter Smoothing“. In: 2024 14th International Conference on Indoor Positioning and Indoor Navigation (IPIN). 2024, S. 1–6. DOI: 10.1109/IPIN62893.2024.10786186.[30] Toni Fetzer, Markus Bullmann, Markus Ebner, Steffen Kastner, Frank Deinzer und Marcin Grzegorzek. „Interacting Multiple Model Particle Filter for Indoor Positioning Applications“. In: Proceedings of the 2023 International Technical Meeting of The Institute of Navigation. Long Beach, California, USA, 2023.[31] Steffen Kastner, Markus Ebner, Markus Bullmann, Toni Fetzer, Frank Deinzer und Marcin Grzegorzek. „SIMUL: Synchronized IMU Dataset of Walking People at Six Body Locations“. In: International Conference on Indoor Positioning and Indoor Navigation (IPIN 2023). Nürnberg, Deutsch",
  "content_length": 32346,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:25"
}