{
  "name": "Franz Baader",
  "homepage": "https://lat.inf.tu-dresden.de/~baader",
  "status": "success",
  "content": "Franz Baader — Seniorprofessor Dr.-Ing. Franz Baader — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen © Franz Baader Seniorprofessor Name Herr Prof. Dr.-Ing. Franz Baader E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3021 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. fax Fax +49 351 463-37959 Informationen zur Lehre Forschungsthemen Wissensrepräsentation (insbesondere Beschreibungslogik und Modallogik) Automatisches Beweisen (inbesondere Termersetzung und Unifikationstheorie) Veröffentlichungen der Arbeitsgruppe Publikationen, technische Berichte, betreute Habilitationen und betreute Dissertationen Ein neues Lehrbuch zum Thema Beschreibungslogik: Franz Baader, Ian Horrocks, Carsten Lutz, and Ulrike Sattler: An Introduction to Description Logic Ein vielzitiertes Lehrbuch zum Thema Termersetzungssysteme: Franz Baader, Tobias Nipkow: Term Rewriting and All That Jetzt auch als Taschenbuch! Ein  vielzitiertes Handbuch zum Thema Beschreibungslogiken: Franz Baader, Diego Calvanese, Deborah McGuinness, Daniele Nardi, Peter Patel-Schneider (Ed.): The Description Logic Handbook Die meisten meiner eigenen Publikationen findet man unten sowie auf DBLP und Google Scholar. Mein H-Index (Hirsch Number) beruhend auf  Google Scholar ist 70 (Stand: Oktober 2025). Folien einiger eingeladener Vorträge und Tutorials Mitglied im Steering Committee von Konferenzen und Workshops CADE - Conference on Automated Deduction (2002-2009, President 2004-2009; 2010-2013, President 2011-2013) DL - Description Logics (2000-2002; 2008-2011) FroCoS - Frontiers of Combining Systems (seit 1996, Chair) IJCAR - International Joint Conference on Automated Reasoning (2004-2009; Chair 2006-2009; 2011-2013, Chair; since 2015, chair) KRDB - Knowledge Representation meets Databases (seit 1994) LICS - IEEE Symposium on Logic in Computer Science (Organizing Committee, 2005-2009, 2011-2013) RTA - Rewriting Techniques and Applications (2001-2004; 2007-2010; Chair 2009-2010) STACS - Symposium on Theoretical Aspects of Computer Science (2004-2006) UNIF - International Workshop on Unification (2008-2010, Chair) Mitglied im Editorial Board von Zeitschiften AICom - The European Journal on Artificial Intelligence (seit 2000) Journal of Artificial Intelligence Research (2000-2003) Journal of Applied Logic (2002–2018) Journal of Applied Logics — IfCoLog Journal (since 2018) JANCL - Journal of Applied Non-Classical Logics (seit 2003) LMCS - Logical Methods in Computer Science (seit 2004) Artificial Intelligence (2006-2014) Journal of Automated Reasoning (seit 2007) Logic Journal of the IGPL (seit 2010) Mitglied im Advisory Board von Buchreihen Cognitive Technologies (seit 2002) Weitere Mitgliedschaften Sprecher der GI Fachgruppe Logik in der Informatik (2000-2006) Fachexperte des GI Fachbereichs Künstliche Intelligenz (seit 2001) International relations officer des GI Fachbereichs Künstliche Intelligenz beim ECCAI (seit 2002) ECCAI Fellow (seit 2004) Mitglied im Senats- und Bewilligungsausschuß für Graduiertenkollegs der DFG (1999-2004) Mitglied im Fachkollegium Informatik der DFG (2004-2012; 2008-2012 als Sprecher) Gründungsmitglied der IFIP Working Group 1.6 - Term Rewriting Mitglied der Academia Europaea (seit 2011) Weiterführende Links International Center of Computational Logic Wikipedia DBLP Google Scholar ResearchGate Deutsche Forschungsgemeinschaft (DFG) Mathematics Genealogy Project Academia Europaea Deutsche Nationalbibliothek Publikationen am DFKI Guide2Research Academic Veröffentlichungen 2025 Christian Alrabbaa, Franz Baader, Raimund Dachselt, Alisa Kovtunova, and Julián Méndez: The Concrete Evonne: Visualization Meets Concrete Domain Reasoning. In Proceedings of Frontiers of Combining Systems - 15th International Symposium, FroCoS 2025, Reykjavik, Iceland, September 29 - October 1, 2025. Abstract BibTeX Entry PDF File DOI Evonne is a web application primarily designed to explain Description Logic (DL) entailments using an interactive visualization approach for proofs. This paper introduces an extension of Evonne to DLs with concrete domains, which are needed for formalizing concepts whose definitions involve quantitative information. Specifically, we focus on two extensions of the DL EL⊥: one with constraints formulated as linear equations and the other with difference constraints. First, we have extended Evonne to enable the generation and presentation of proofs involving these concrete domains. Then, leveraging the unique properties of each domain, we have designed and incorporated alternative visual explanations for the numerical parts of the proofs. Finally, we have assessed the effectiveness of these visual explanations through qualitative user studies and a performance benchmark. While opinions on one of these explanations varied, the other was widely recognized for its clarity and ease of understanding. @inproceedings{ ALBADAKOME-FROCOS25, author = {Christian {Alrabbaa} and Franz {Baader} and Raimund {Dachselt} and Alisa {Kovtunova} and Juli\\'{a}n {M\\'{e}ndez}}, booktitle = {Proceedings of Frontiers of Combining Systems - 15th International Symposium, FroCoS 2025, Reykjavik, Iceland, September 29 - October 1}, doi = {https://doi.org/10.1007/978-3-032-04167-8_1}, title = {The Concrete Evonne: Visualization Meets Concrete Domain Reasoning}, year = {2025}, } Franz Baader, Stefan Borgwardt, Filippo De Bortoli, and Patrick Koopmann: Concrete Domains Meet Expressive Cardinality Restrictions in Description Logics. In Clark Barrett and Uwe Waldmann, editors, Automated Deduction – CADE 30, volume 15943 of Lecture Notes in Artificial Intelligence, pages 676–695, 2025. Abstract BibTeX Entry PDF File DOI Extended Version Standard Description Logics (DLs) can encode quantitative aspects of an application domain through either number restrictions, which constrain the number of individuals that are in a certain relationship with an individual, or concrete domains, which can be used to assign concrete values to individuals using so-called features. These two mechanisms have been extended towards very expressive DLs, for which reasoning nevertheless remains decidable. Number restrictions have been generalized to more powerful comparisons of sets of role successors in ALCSCC, while the comparison of feature values of different individuals in ALC(D) has been studied in the context of ω-admissible concrete domains D. In this paper, we combine both formalisms and investigate the complexity of reasoning in the thus obtained DL ALCOSCC(D), which additionally includes the ability to refer to specific individuals by name. We show that, in spite of its high expressivity, the consistency problem for this DL is ExpTime-complete, assuming that the constraint satisfaction problem of D is also decidable in exponential time. It is thus not higher than the complexity of the basic DL ALC. At the same time, we show that many natural extensions to this DL, including a tighter integration of the concrete domain and number restrictions, lead to undecidability. @inproceedings{ BaBoBoKo-CADE-25, address = {Stuttgart, Germany}, author = {Franz {Baader} and Stefan {Borgwardt} and Filippo {De Bortoli} and Patrick {Koopmann}}, booktitle = {Automated Deduction -- CADE 30}, doi = {https://doi.org/10.1007/978-3-031-99984-0_35}, editor = {Clark {Barrett} and Uwe {Waldmann}}, pages = {676--695}, series = {Lecture Notes in Artificial Intelligence}, title = {Concrete Domains Meet Expressive Cardinality Restrictions in Description Logics}, volume = {15943}, year = {2025}, } Franz Baader and Anton Claußnitzer: Maximum Entropy Reasoning via Model Counting in (Description) Logics that Count. In The International FLAIRS Conference, Proceedings, 38(1), 2025. Abstract BibTeX Entry PDF File PDF File (Extended Technical Report) DOI In previous work it was shown that the logic ALCME, which extends the description logic (DL) ALC with probabilistic conditionals, has domain-lifted inference. Here, we extend this result from the base logic ALC to two logics that can count, the two-variable fragment C2 of first-order logic (FOL) with counting quantifiers, and the DL ALCSCC, which is not a fragment of FOL. As an auxiliary result, we prove that model counting in ALCSCC can be realized in a domain-liftable way. @inproceedings{ BaCl-FLAIR-25-01, author = {Franz {Baader} and Anton {Clau{\\ss}nitzer}}, booktitle = {The International FLAIRS Conference, Proceedings, 38(1)}, doi = {https://doi.org/10.32473/flairs.38.1.138854}, title = {Maximum Entropy Reasoning via Model Counting in (Description) Logics that Count}, year = {2025}, } Franz Baader and Filippo De Bortoli: The Expressive Power of Description Logics with Numerical Constraints over Restricted Classes of Models. In René Thiemann and Christoph Weidenbach, editors, Frontiers of Combining Systems: 15th International Symposium, FroCoS 2025, Reykjavik, Iceland, September 29 – October 1, 2025, Proceedings, volume 15979 of Lecture Notes in Artificial Intelligence, pages 22–39. Reykjavik, Iceland, Springer, Cham, 2025. Abstract BibTeX Entry DOI For Description Logics (DLs), different approaches for extending the expressive power using numerical constraints have been introduced. Here, we consider the logic ALCSCC, which can state powerful numerical constraints on the number of role successors satisfying certain properties, and logics of the form ALC(D), in which individuals can be assigned numerical or other concrete values, which can be compared using predefined predicates of D. Instead of investigating the complexity of reasoning in these logics, we are interested in characterizing their expressive power. We improve on our previous work in this direction in several respects. For ALCSCC, we develop a method that can deal with the finitely branching interpretations ",
  "content_length": 670279,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:42"
}