{
  "name": "Francesco Mondada",
  "homepage": "https://people.epfl.ch/francesco.mondada",
  "status": "success",
  "content": "EPFL - Francesco Mondada Données administratives Francesco Mondada francesco.mondada@epfl.ch +41 21 693 73 57 vCard Professeur titulaire, Groupe SCI STI FMO1 EPFL STI IEM SCI-STI-FMO1ME B3 426 (Bâtiment ME)Station 91015 Lausanne +41 21 693 73 57 Office: ME B3 426 EPFL › STI › IEM › SCI-STI-FMO1 Site web: https://mobots.epfl.ch Professeur titulaire, Groupe SCI IC FMO2 EPFL STI IEM SCI-STI-FMO1ME B3 426 (Bâtiment ME)Station 91015 Lausanne +41 21 693 73 57 Office: ME B3 426 EPFL › IC › IINFCOM › SCI-IC-FMO2 Directeur académique, Centre des sciences de l'apprentissage EPFL AVP-E LEARNRLC D1 740 (Rolex Learning Center)Station 201015 Lausanne +41 21 693 73 57 Office: ME B3 426 EPFL › VPA › VPA-AVP-E › AVP-E › AVP-E-LEARN Site web: https://learn.epfl.ch Professeur titulaire, SMT - Enseignement EPFL STI IEM SCI-STI-FMO1ME B3 426 (Bâtiment ME)Station 91015 Lausanne +41 21 693 73 57 Office: ME B3 426 EPFL › STI › STI-SMT › SMT-ENS Professeur titulaire, EDRS - Enseignement EPFL STI IEM SCI-STI-FMO1ME B3 426 (Bâtiment ME)Station 91015 Lausanne +41 21 693 73 57 Office: ME B3 426 EPFL › VPA › VPA-AVP-DLE › AVP-DLE-EDOC › EDRS-ENS Membre, Interface EPFL-Gymnases EPFL STI IEM SCI-STI-FMO1ME B3 426 (Bâtiment ME)Station 91015 Lausanne +41 21 693 73 57 Office: ME B3 426 EPFL › VPA › VPA-AVP-E › AVP-E › AVP-E-EPFL-GYMN Professeur titulaire, SSC - Enseignement EPFL STI IEM SCI-STI-FMO1ME B3 426 (Bâtiment ME)Station 91015 Lausanne +41 21 693 73 57 Office: ME B3 426 EPFL › IC › IC-SSC › SSC-ENS Site web: https://ssc.epfl.ch Professeur titulaire, SIN - Enseignement EPFL STI IEM SCI-STI-FMO1ME B3 426 (Bâtiment ME)Station 91015 Lausanne +41 21 693 73 57 Office: ME B3 426 EPFL › IC › IC-SIN › SIN-ENS Site web: https://sin.epfl.ch Expertise Développement de robots mobiles miniatureRobotique bio-inspiréeIntéractions art-robotiqueRobotique et éducation Prix et distinctions Publications Enseignement et PhD Prix et distinctions 2022 Journal ArticlesFostering computational thinking through educational robotics: a model for creative computational problem solvingM. Chevalier; C. Giang; A. Piatti; F. MondadaInternational Journal of STEM Education. 2020-08-03. DOI : 10.1186/s40594-020-00238-z.Detailed recordFull text – View at publisherStrategies to modulate zebrafish collective dynamics with a closed-loop biomimetic robotic systemY. Chemtob; L. Cazenille; F. Bonnet; A. Gribovskiy; F. Mondada et al.Bioinspiration & Biomimetics. 2020-07-01. DOI : 10.1088/1748-3190/ab8706.Detailed recordView at publisherHeuristics for the Development and Evaluation of Educational Robotics SystemsC. Giang; A. Piatti; F. MondadaIEEE Transactions on Education. 2019-04-30. DOI : 10.1109/TE.2019.2912351.Detailed recordFull text – View at publisherRobots mediating interactions between animals for interspecies collective behaviorsF. Bonnet; R. Mills; M. Szopek; S. Schoenwetter-Fuchs; J. Halloy et al.Science Robotics. 2019-03-27. DOI : 10.1126/scirobotics.aau7897.Detailed recordFull text – View at publisherAutonomous Exploration for Radioactive Hotspots Localization Taking Account of Sensor LimitationsH. Ardiny; S. J. Witwicki; F. MondadaSensors. 2019-01-12. DOI : 10.3390/s19020292.Detailed recordFull text – View at publisherRobot swarms as an educational tool: The Thymio’s wayA. Vitanza; P. Rossetti; F. Mondada; V. TrianniInternational Journal of Advanced Robotic Systems. 2019-01-31. DOI : 10.1177/1729881418825186.Detailed recordFull text – View at publisherDesigning a socially integrated mobile robot for ethological researchA. Gribovskiy; J. Halloy; J. Deneubourg; F. MondadaRobotics and Autonomous Systems. 2018-02-21. DOI : 10.1016/j.robot.2018.02.003.Detailed recordFull text – View at publisherClosed-loop interactions between a shoal of zebrafish and a group of robotic fish in a circular corridorF. Bonnet; A. Gribovskiy; J. Halloy; F. MondadaSwarm Intelligence. 2018. DOI : 10.1007/s11721-017-0153-6.Detailed recordFull text – View at publisherHow mimetic should a robotic fish be to socially integrate into zebrafish groups ?L. Cazenille; B. E. Collignon; Y. Chemtob; F. Bonnet; A. Gribovskiy et al.Bioinspiration & Biomimetics. 2018. DOI : 10.1088/1748-3190/aa8f6a.Detailed recordView at publisherMergeable nervous systems for robots (vol 8, 439, 2017)N. Mathews; A. L. Christensen; R. O'Grady; F. Mondada; M. DorigoNature Communications. 2017. DOI : 10.1038/s41467-017-01622-0.Detailed recordFull text – View at publisherDesign of a modular robotic system that mimics small fish locomotion and body movements for ethological studiesF. Bonnet; L. Cazenille; A. Séguret; A. Gribovskiy; B. E. Collignon et al.International Journal of Advanced Robotic Systems. 2017. DOI : 10.1177/1729881417706628.Detailed recordView at publisherCan Robotics Help Move Researchers Toward Open Science?F. MondadaIEEE Robotics and Automation Magazine. 2017. DOI : 10.1109/MRA.2016.2646118.Detailed recordView at publisherBringing robotics into formal education using the Thymio open source hardware robotF. Mondada; M. Bonani; F. Riedo; M. Briod; L. Pereyre et al.IEEE Robotics and Automation Magazine. 2017. DOI : 10.1109/MRA.2016.2636372.Detailed recordFull text – View at publisherElectroencephalography as implicit communication channel for proximal interaction between humans and robot swarmsL. Mondada; M. E. Karim; F. MondadaSwarm Intelligence. 2016. DOI : 10.1007/s11721-016-0127-0.Detailed recordFull text – View at publisherR2T2 : Robotics to Integrate Educational Efforts in South Africa and EuropeF. Mondada; E. Bonnet; S. Davrajh; W. Johal; R. StopforthInternational Journal of Advanced Robotic Systems. 2016. DOI : 10.1177/1729881416658165.Detailed recordFull text – View at publisherPedagogical Uses of Thymio II: How Do Teachers Perceive Educational Robots in Formal Education?M. Chevalier; F. Riedo; F. MondadaIEEE Robotics & Automation Magazine. 2016. DOI : 10.1109/MRA.2016.2535080.Detailed recordFull text – View at publisherAre Autonomous Mobile Robots Able to Take Over Construction? A ReviewH. Ardiny; S. J. Witwicki; F. MondadaInternational Journal of Robotics. 2015. Detailed recordFull textBio-inspired construction with mobile robots and compliant pocketsT. Soleymani; V. Trianni; M. Bonani; F. Mondada; M. DorigoRobotics And Autonomous Systems. 2015. DOI : 10.1016/j.robot.2015.07.018.Detailed recordView at publisherDecentralized Self-Selection of Swarm Trajectories: From Dynamical Systems to Robotic ImplementationG. A. Sartoretti; M.-O. Hongler; M. Elias de Oliveira; F. MondadaSwarm Intelligence. 2014. DOI : 10.1007/s11721-014-0101-7.Detailed recordFull text – View at publisherFuzzy Control System for Autonomous Navigation and Parking of Thymio II Mobile RobotsF. Boufera; F. Debbat; F. Mondada; M. F. KhelfiInternational Journal of Computer and Electrical Engineering (IJCEE). 2014. DOI : 10.7763/IJCEE.2014.V6.846.Detailed recordView at publisherTakashi Gomi, vision and ethicsF. MondadaAdaptive Behavior. 2014. DOI : 10.1177/1059712314543277.Detailed recordFull text – View at publisherCooperative navigation in robotic swarmsF. Ducatelle; D. Caro; A. Gianni; A. Förster; M. Bonani et al.Swarm Intelligence. 2013. DOI : 10.1007/s11721-013-0089-4.Detailed recordFull text – View at publisherUpgrade Your Robot Competition, Make a Festival!F. Riedo; M. Freire; J. Fink; G. Ruiz; F. Fassa et al.IEEE Robotics and Automation Magazine. 2013. DOI : 10.1109/MRA.2013.2272203.Detailed recordView at publisherSwarmanoid: a novel concept for the study of heterogeneous robotic swarmsM. Dorigo; D. Floreano; L. Gambardella; F. Mondada; S. Nolfi et al.IEEE Robotics & Automation Magazine. 2013. DOI : 10.1109/MRA.2013.2252996.Detailed recordView at publisherAutonomous construction using scarce resources in unknown environments - Ingredients for an intelligent robotic interaction with the physical worldS. Magnenat; R. Philippsen; F. MondadaAutonomous Robots. 2012. DOI : 10.1007/s10514-012-9296-x.Detailed recordFull text – View at publisherHighly Compact Robots for Inspection of Power PlantsG. Caprari; A. Breitenmoser; W. Fischer; C. Hürzeler; F. Tâche et al.Journal of Field Robotics. 2012. DOI : 10.1002/rob.21411.Detailed recordView at publisherTRIPILLAR: Miniature magnetic caterpillar climbing robot with plane transition abilityP. Schoeneich; F. Rochat; O. T.-D. Nguyen; R. Moser; F. MondadaRobotica. 2011. DOI : 10.1017/S0263574711000257.Detailed recordFull text – View at publisherA Social Approach for Target Localization: Simulation and Implementation in the marXbot RobotH. F. Satizábal; A. Upegui; A. Perez-Uribe; P. Rétornaz; F. MondadaMemetic Computing. 2011. DOI : 10.1007/s12293-011-0061-z.Detailed recordFull text – View at publisherCy-mag3D: a simple and miniature climbing robot with advance mobility in ferromagnetic environmentF. Rochat; P. Schoeneich; B. Lüthi; H. Bleuler; R. Moser et al.Industrial Robot: An International Journal. 2011. DOI : 10.1108/01439911111122716.Detailed recordView at publisherConference PapersLearning Symmetry with Tangible RobotsW. Johal; S. Andersen; M. Chevalier; A. Ozgur; F. Mondada et al.2020-01-01. 10th International Conference on Robotics in Education (RiE), Vienna, AUSTRIA, Apr 10-12, 2019. p. 270-283. DOI : 10.1007/978-3-030-26945-6_24.Detailed recordView at publisherLocalization of inexpensive robots with low-bandwidth sensorsS. Wang; F. Colas; M. Liu; F. Mondada; S. Magnenat2019. 13th International Symposium on Distributed Autonomous Robotic Systems (DARS), London, ENGLAND, November 7-9, 2016. p. 545-558. DOI : 10.1007/978-3-319-73008-0_38.Detailed recordFull text – View at publisherDeclarative Physicomimetics for Tangible Swarm Application DevelopmentA. Özgür; W. Johal; A. Güneysu Özgür; F. Mondada; P. Dillenbourg2018-10-29. 11th International Conference on Swarm Intelligence, ANTS 2018, Rome, Italy, October 29-31, 2018. DOI : 10.1007/978-3-030-00533-7.Detailed recordFull text – View at publisherFollow the dummy: measuring the influence of a biomimetic robotic fish-lure on the collective decisi",
  "content_length": 85780,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:56"
}