{
  "name": "Frank Guerin",
  "homepage": "https://www.surrey.ac.uk/people/frank-guerin",
  "status": "success",
  "content": "Dr Frank Guerin | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Google Scholar ORCID LinkedIn Twitter Dr Frank Guerin Senior Lecturer BSc MSc PhD +44 (0)1483 689195 f.guerin@surrey.ac.uk17 BB 02Meetings by arrangement over email.Academic and research departments Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyFrank Guerin joined the Computer Science Department at Surrey in 2020. Before this he was Lecturer/Senior Lecturer at the University of Aberdeen and before that a PhD student in Imperial College.His research interest is in Artificial Intelligence, where he has published in robotics, vision, language processing, and machine learning. He has established a track record of taking ideas from psychology research and importing them to Artificial Intelligence areas such as developmental robotics, and more recently mainstream robotics; for example learning spatial relationships autonomously, inspired by infant early means-ends behaviour, and applying the psychologist Barsalou's ideas to allow a robot system to use context effectively.Guerin devoted significant time to learning about psychology, and engaging with Psychologists. He initiated and was the main organiser for a 2013 Dagstuhl seminar bringing together leading international psychologists and roboticists.His IEEE TAMD journal paper bringing developmental psychology ideas to the robotics community is his most cited paper.He has been invited to speak at international meetings to provide a perspective that bridges the gap between psychology and robotics, e.g., OpenEASE Fall School 2019, Xperience Summer School 2013; workshops: ICRA 2013, ICDL-EpiRob 2014, RSS 2015, IROS 2015, FEEL project Paris 2014. Expand biography ResearchResearch interestsI am an AI researcher interested in the kinds of tasks that are easy for humans but hard for AI: in robotics, computer vision, and language. I have interest in psychology, and how humans do things, and I like to borrow ideas from human processes to implement them in AI systems that tackle real-world tasks.I am interested in new approaches to knowledge representation and reasoning for AI systems which get over the rigidity and brittleness of classical approaches. Human knowledge of a concept such as \"container\" is very flexible to be applied to a wide range of objects (pots, cups, bags, boxes, rooms, buildings, ...) and applied in more abstract domains (political parties, controls on disease spread, damage from a scandal). The actions associated with container (insert, remove, escape, seal, breach, etc.) can also be adapted appropriately. These are not special or unusual or effortful applications of a concept for humans. Every human concept is effortlessly applied to a wide range of situations, and examples are everywhere in everyday cognition. It suggests that the human representation and reasoning machinery has a design which facilitates this.I am looking for (non-classical) knowledge representation and reasoning which could allow AI systems to transfer knowledge of basic concepts in a human-like way. Vision example: give a system some knowledge of the types of tool (e.g. spatulas) that can lift pancakes or eggs from a pan, and enable it to transfer the concept to other objects which afford the same action. Manipulation example: give a system some knowledge of containers and container actions and enable it to apply this across a variety of scenarios. Language processing example: in understanding, given knowledge of concepts such as container and associated actions, to be able to recognise it in varied instantiations, e.g. where not literally used.Paper about Projection idea in Artificial Intelligence https://arxiv.org/abs/2103.13512Paper about task-driven representation in robotics Robot Manipulation in Open Environments Expand research interests Highlighted Research Our ICRA 2019 Paper Video of paper Latent Space Factorisation and Manipulation via Matrix Subspace Projection paper website TeachingBSc:COM3013 COMPUTATIONAL INTELLIGENCE(not currently teaching) COM3025 DEEP LEARNING AND ADVANCED AICOM3001 FINAL YEAR PROJECT MSc Data Science:COMM002 MSC DISSERTATION COMM062 COMPUTATIONAL INTELLIGENCECOMM056 ALIGNING BUSINESS VALUE WITH RESEARCH AND DEVELOPMENT Expand my teaching PublicationsMona Ahmadian, Frank Guerin, Andrew Gilbert (2024)MOFO: MOtion FOcused Self-Supervision for Video Understanding, In: 37th Conference on Neural Information Processing Systems (NeurIPS 2023)Self-supervised learning (SSL) techniques have recently produced outstanding results in learning visual representations from unlabeled videos. However, despite the importance of motion in supervised learning techniques for action recognition, SSL methods often do not explicitly consider motion information in videos. To address this issue, we propose MOFO (MOtion FOcused), a novel SSL method for focusing representation learning on the motion area of a video for action recognition. MOFO automatically detects motion areas in videos and uses these to guide the self-supervision task. We use a masked autoencoder that randomly masks out a high proportion of the input sequence and forces a specified percentage of the inside of the motion area to be masked and the remainder from outside. We further incorporate motion information into the finetuning step to emphasise motion in the downstream task. We demonstrate that our motion-focused innovations can significantly boost the performance of the currently leading SSL method (VideoMAE) for action recognition. Our proposed approach significantly improves the performance of the current SSL method for action recognition, indicating the importance of explicitly encoding motion in SSL.Yucheng Li, Bo Dong, Chenghua Lin, Frank Guerin (2023)Compressing Context to Enhance Inference Efficiency of Large Language Models, In: arXiv.org Cornell University Library, arXiv.orgLarge language models (LLMs) achieved remarkable performance across various tasks. However, they face challenges in managing long documents and extended conversations, due to significantly increased computational requirements, both in memory and inference time, and potential context truncation when the input exceeds the LLM's fixed context length. This paper proposes a method called Selective Context that enhances the inference efficiency of LLMs by identifying and pruning redundancy in the input context to make the input more compact. We test our approach using common data sources requiring long context processing: arXiv papers, news articles, and long conversations, on tasks of summarisation, question answering, and response generation. Experimental results show that Selective Context significantly reduces memory cost and decreases generation latency while maintaining comparable performance compared to that achieved when full context is used. Specifically, we achieve a 50\\% reduction in context cost, resulting in a 36\\% reduction in inference memory usage and a 32\\% reduction in inference time, while observing only a minor drop of .023 in BERTscore and .038 in faithfulness on four downstream applications, indicating that our method strikes a good balance between efficiency and performance.Witold Slowinski, Frank Guerin (2011)Learning Regions for Building a World Model from Clusters in Probability Distributions, In: 2011 IEEE INTERNATIONAL CONFERENCE ON DEVELOPMENT AND LEARNING (ICDL)26037339pp. 1-6 IEEEDOI: 10.1109/DEVLRN.2011.6037339A developing agent learns a model of the world by observing regularities occurring in its sensory inputs. In a continuous domain where the model is represented by a set of rules, a significant part of the task of learning such a model is to find appropriate intervals within the continuous state variables, such that these intervals can be used to define rules whose predictions are reliable. We propose a technique to find such intervals (or regions) by means of finding clusters on approximate probability distributions of sensory variables. We compare this cluster-based method with an alternative landmark-based algorithm. We evaluate both techniques on a data log recorded in a simulation based on OpenArena, a three-dimensional first-person-perspective computer game, and demonstrate the results of how the techniques can learn rules which describe walking behaviour. While both techniques work reasonably well, the clustering approach seems to give more \"natural\" regions which correspond more closely to what a human would expect; we speculate that such regions should be more useful if they are to form a basis for further learning of higher order rules.Severin Fichtl, John Alexander, Frank Gue",
  "content_length": 70022,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:24"
}