{
  "name": "Franz Johannes Hauck",
  "homepage": "https://www.uni-ulm.de/in/vs/inst/team/franz-hauck",
  "status": "success",
  "content": "Stellvertr. Institutsdirektor Prof. Dr.-Ing. Franz J. Hauck - Universität Ulm Prof. Dr.-Ing. Franz Hauck Prof. Dr.-Ing. Franz Hauck Stellv. Institutsdirektor Institut für Verteilte Systeme Institut für Verteilte Systeme Universität Ulm Albert-Einstein-Allee 11 89081 Ulm Baden-Württemberg Deutschland E-Mail: franz.hauck(at)uni-ulm.de www: Franz J. Hauck Raum: O27 348 Telefon: +4973150-24143 Fax: +4973150-24142 Sprechstunde nach Vereinbarung in meinem Büro O27-348 oder online Prof. Dr.-Ing. Franz J. Hauck Prof. Hauck studierte Informatik an der Universität Erlangen-Nürnberg. Nach zwei Jahren in der Industrie promovierte und habilitierte er sich an der Universität Erlangen-Nürnberg unterbrochen von einem einjährigen Auslandsaufenthalt an der Vrije Universiteit Amsterdam. Seit 2002 lehrt und forscht er an der Universität Ulm als Professor für Verteilte Systeme am gleichnamigen Institut. Seine Forschungsinteressen sind Middleware-Systeme für spezielle Aufgaben. Der Fokus liegt auf fehlertoleranten Serversystemen, vor allem auf State-Machine Replication (SMR). In der Lehre vertritt Prof. Hauck die Themengebiete Betriebssysteme und Verteilte Systeme. Seine aktuellen Veranstaltungen finden Sie auf der Lehreseite des Instituts. Alle seine Lehrveranstaltungen finden sich auf einer Detailseite. Prof. Hauck ist Mitglied der ACM, der Gesellschaft für Informatik, GI und deren Fachgruppen Betriebssysteme , KuVS und FERS sowie von EuroSys. Er ist außerdem gewähltes Mitglied des Fakultätsrats seiner Fakultät, bestelltes Mitglied der Informatik für die Gemeinsame Kommission Lehramt und damit gleichzeitig Mitglied in der Studienkommission, dem Prüfungsausschuss und dem Zulassungsausschuss für das Lehramt. Im Prüfungsausschuss Lehramt ist er gewählter Vorsitzender. Seine letzten Publikationen: Heß, A., Hauck, F.J. and Meißner, E. 2024. Consensus-agnostic state-machine replication. 25th ACM/IFIP Int. Middleware Conf. (Hong Kong, China, Dec. 2024). State-machine replication (SMR) is a popular fault-tolerance technique for building highly-available services. Usually, consensus protocols are used to enforce a deterministic service-request ordering among replicas, in order to prevent their state from diverging. Over the last decades, a multitude of consensus protocols have been developed which come with different characteristics but also with different communication and programming models. Our Consensus-Agnostic Replication Toolkit (CART) is a wrapper for consensus protocols that relieves clients from most consensus configuration and support. Besides, it implements a generic client and application interface to support different consensus protocols and configurations, e.g. in cloud deployments. CART has built-in authentication of services based on BLS threshold signatures. It can further prove malicious behaviour of replicas, thus speeding up recovery in case of Byzantine faults. We evaluate the performance overhead of our approach in a real-world WAN deployment for two different consensus protocol implementations using the YCSB benchmark. Our results show that CART is able to reach up to 90% of the throughput achieved by the native consensus protocol with an additional latency overhead of only 10%.Hauck, F.J. and Heß, A. 2024. Linearizability and state-machine replication: Is it a match? ArXiv.org. Mehdi, M., Hauck, F.J., Pryss, R. and Schlee, W. 2024. Mobile health solutions for Tinnitus. Textbook on Tinnitus (Mar. 2024), 723–738. Modern mobile devices are mainstream and ubiquitous devices. The widespread adoption of mobile devices has resulted in surge of mobile applications (apps) hosted on marketplaces (app stores) of several mobile platforms. Besides other benefits, these apps are also applied in healthcare-related and medical use, for instance, in case of tinnitus, where tinnitus disorder is associated with the perception of ringing sound without external sound source. In particular, for tinnitus, these apps allow provision of tinnitus-related relief, self-help, and general management. The collective aim of this chapter is to foster and report on Mobile Health (mHealth) solutions, in particular mobile apps within the tinnitus context. First, this chapter provides an up-to-date overview of existing mHealth apps available for major mobile platforms. Second, this chapter provides deep insights into quality and effectiveness of said mobile apps for tinnitus treatment and management. Finally, this chapter provides discussions in relation to the tinnitus-related mHealth apps.Hauck, F.J. and Heß, A. 2024. Linearizability and state-machine replication. Workshop on Resilient Oper. - Byz. Fault Tol. and State-Machine Repl. – ROBUST (Mar. 2024). Heß, A. and Hauck, F.J. 2024. A framework for consensus-agnostic state-machine replication based on threshold signatures. Workshop on Resilient Oper. - Byz. Fault Tol. and State-Machine Repl. – ROBUST (Mar. 2024). Weitere Informationen finden sich auf anderen Seiten: vollständige Publikationsliste, Doktoranden. Weitere Details zu Projekten und gehaltenen Lehrveranstaltungen finden sich auf einer Detailseite.",
  "content_length": 5115,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:41"
}