{
  "name": "Frank Ortmeier",
  "homepage": "https://cse.cs.ovgu.de/cse",
  "status": "success",
  "content": "CSSE: Homepage We would like to welcome you! Our success is a product of collegial staff, experienced researchers and promising students. Even though we each have our own area of expertise, we work closely together. Software Engineering In our understanding, Software Engineering is the art of designing useful software products in an efficient way. More precisely, we see “build the right software” and “build the software right” as overarching themes... more... Deep Learning for Retail Open set recognition at scale is an issue for computer-vision systems, especially in the retail industry in which scalable AI-related technology solutions at the physical store level have not been deployed to the best of our knowledge. more... Machine LearningSafety In order to enable the deployment of artificial neural networks as components of safety critical systems, like autonomous vehicles, or for the control of industrial manufacturing processes, their reliability has to be increased and, if possible, proven. more... VECS One of the chair's greatest achievements is the creation of an eclipse-based modelling environment for formal models. It enables the convenient creation, analysis and model checking of state-based systems. more... Welcome to the website of the Chair of Software & Systems Engineering Computer science is becoming increasingly important for technical applications. For example, software now accounts for up to 45 % of the development costs of modern cars. Many serious catastrophes in the aerospace industry have their causes in software errors (such as the recent Airbus crashes in Amsterdam and Puerto Plata or the explosion of the Ariane 5 rocket). New innovations and functions (e.g. in digital cameras and image processing) are often merely software improvements instead of hardware upgrades. The research focus of the Chair of Software & Systems Engineering is to harness advances in computer science for engineering applications. Our research is strongly interdisciplinary. In most research projects, we try to find partners from industry in order to evaluate the practicability and usefulness of new methods at an early stage. At the same time, our industrial partners can also benefit by gaining a competitive advantage. We have also made the experience that even in basic research, a frequent exchange of experience with users from practice is very beneficial for both sides. For students, we always offer a wide range of jobs, bachelor's or master's theses. For our industrial partners, we act as an interface for new technologies, offer innovation management and can also arrange internships. If you share our view of computer science as an enabler technology for many engineering topics, or if you are looking for a scientific partner or a topic for a thesis, we cordially invite you to a personal interview. News 07.11.2025 Successful Doctoral Defense by Sebastian Nielebock 20.10.2025 Best Paper Award at SEAA2025 29.09.2025 CSSE Research Colloquium 08.09.2025 Chair Retreat: Science, Ideas, and Team Spirit Paper for Sassur 2025 accepted more... Chair Holder ‣ Chair Holder Prof. Dr. Frank Ortmeier Building 29, Room 404 +49 391 67-52804 Profile Secretariat ‣ Secretariat Kornelia Rulf Building 29, Room 405 +49 391 67-58915 Last Modification: 10.09.2025 - Contact Person: Webmaster",
  "content_length": 3320,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:38"
}