{
  "name": "Francesco Locatello",
  "homepage": "https://ist.ac.at/en/research/locatello-group",
  "status": "success",
  "content": "ISTA | Locatello Group HomeResearchLocatello Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Locatello Group Causal Learning and Artificial Intelligence Modern machine learning is still limited to a superficial description of reality that only holds when the experimental conditions are fixed. It largely ignores interventions in the world, domain shifts, and temporal structure. Locatello’s group focuses on learning causal representations and causal models from data to address these issues. Through rigorous theory and scalable algorithms, they enable AI agents to understand cause-and-effect relationships, the effect of interventions, and distribution changes underlying the data they encounter. Advances in causal learning have promising applications in machine learning and artificial intelligence, including robustness, explainability, and fairness in recognition, reasoning, and planning tasks. Most importantly, their impact extends to discovering new scientific knowledge from massive amounts of data and serving as the interface between people and complex systems for decision-making. Causal learning emerges by discovering structural knowledge about the data-generating process and meaningful abstractions that allow for well-defined causal relations. Research questions span theoretical identifiability and methodological innovations in causal learning, discovering objects and abstract entities, their factors of variations, and their causal relations. The group applies these methods to solve open problems in machine learning and enable new applications in the sciences. Group Leader Francesco Locatello Assistant Professor +43 2243 9000 2283 Francesco.Locatello@ist.ac.at Administrative Support Christine Francois Assistant to Professors +43 2243 9000 1098 christine.francois-rennhofer@ist.ac.at Team Riccardo Cadei PhD Student Riccardo.Cadei@ist.ac.at Berker Demirel PhD Student Berker.Demirel@ist.ac.at Clementine Domine Postdoc Clementine.Domine@ist.ac.at Marco Fumero Postdoc Marco.Fumero@ist.ac.at Shimeng Huang Postdoc Shimeng.Huang@ist.ac.at Francesco Montagna Postdoc Francesco.Montagna@ist.ac.at Walter Nelson PhD Student Walter.Nelson@ist.ac.at Adeel Pervez Postdoc Adeel.Pervez@ist.ac.at Dario Rancati PhD Student Dario.Rancati@ist.ac.at Dingling Yao PhD Student Dingling.Yao@ist.ac.at Multiple PhD student and postdoc positions are available! Prospective PhD students: please apply through https://phd.pages.ista.ac.atProspective postdoctoral fellows: please contact Francesco.Locatello@ista.ac.at Current Projects Causal discovery | Causal representation learning | Dynamical systems | Visual reasoning | Deep learning methods | AI for science Publications Pariza V, Salehi M, Burghouts G, Locatello F, Asano YM. 2025. Near, far: Patch-ordering enhances vision foundation models’ scene understanding. 13th International Conference on Learning Representations. ICLR: International Conference on Learning Representations, 72303–72330. View Chen J, Yao D, Pervez AA, Alistarh D-A, Locatello F. 2025. Scalable mechanistic neural networks. 13th International Conference on Learning Representations. ICLR: International Conference on Learning Representations, 63716–63737. View Fumero M, Pegoraro M, Maiorca V, Locatello F, Rodolà E. 2024. Latent functional maps: A spectral framework for representation alignment. 38th Conference on Neural Information Processing Systems. NeurIPS: Neural Information Processing Systems, Advances in Neural Information Processing Systems, vol. 37. View Yao D, Rancati D, Cadei R, Fumero M, Locatello F. 2024. Unifying causal representation learning with the invariance principle. 38th Conference on Neural Information Processing Systems. NeurIPS: Neural Information Processing Systems, Advances in Neural Information Processing Systems, vol. 37. View Kori A, Locatello F, Santhirasekaram A, Toni F, Glocker B, De Sousa Ribeiro F. 2024. Identifiable object-centric representation learning via probabilistic slot attention. 38th Conference on Neural Information Processing Systems. NeurIPS: Neural Information Processing Systems, Advances in Neural Information Processing Systems, vol. 37. View View All Publications ReX-Link: Francesco Locatello Career Since 2023 Assistant Professor, Institute of Science and Technology Austria (ISTA)2020 – 2023 Senior Applied Scientist, Amazon Web Services2020 PhD, ETH Zurich (Max Planck – ETH Center for Learning Systems), Switzerland Selected Distinctions 2023 Hector Stiftung-Preis for outstanding scientific achievements in the field of Machine Learning2022 ETH Silver Medal for outstanding doctoral dissertation2019 Best Paper Award at the International Conference on Machine Learning (ICML)2019 Google Ph.D. Fellowship in Machine Learning Additional Information Download CV Co-advised students:Francesco Montagna’s websiteDingling Yao’s websiteSiddhartha Gairola’s websiteMarco Fumero’s websiteZhenyu Zhu’s website Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 7356,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:00"
}