{
  "name": "Franck Leprévost",
  "homepage": "http://wwwen.uni.lu/snt/people/franck_leprevost",
  "status": "success",
  "content": "Franck LEPREVOST - FSTM - University of Luxembourg I Uni.lu Full professor in Informatics Contact franck.leprevost@uni.lu (+352) 46 66 44 6200 Details Profile Profile CV Functions Full professor in Informatics In detail Faculty of Science, Technology and Medicine Department of Computer Science Algorithmic Number Theory | Cryptology Maison du Nombre6, avenue de la FonteL-4364 ESCH MNO, E03 0335050 franck.leprevost@uni.lu (+352) 46 66 44 6200 Publications on ORBilu Franck Leprévost is Professor in informatics at the University of Luxembourg. He leads the group Mathematics of Security within the Department of Computer Science. He is the author of over 50 papers, co-editor of 2 books, co-author of chapters of 3 books, and gives in average 8 international talks per year since 1992. He has been involved in international IEEE standardization activities (like the IEEE-P1363 worldwide standard on Public-Key Cryptography) as well as in many international research activities for a number of years. He served as an expert for the European Parliament, in particular for the report: “Encryption and cryptosystems in electronic surveillance: A survey of the technology assessment issues” (Global project No: EP/IV/B/STOA/98/1401/01: Development of surveillance technology and risk of abuse of economic information), which become famous as part of the so-called ECHELON report for the European Parliament. He is also the author for the European Parliament of the reports “Security techniques for digital media”, and “Protection and implementation of intellectual property rights in security technologies for digital media” (both with B. Warusfel). He was scientific advisor of some European venture capitalists. He was 2003 guest scientist interviewed by the French “Office Parlementaire d’Evaluation des Choix Scientifiques et Technologique” of the Assemblée Nationale and of the Sénat, for the parliamentary study on biometrics. In 2003, he was a member of the working group on research in Europe of the French “think-tank” Institut Montaigne (founder: Claude Bébéar), and since 2005, he is member of the administration board of LuxTrust S.A. Since December 2005, he is Vice-President of the University of Luxembourg, in charge of international relations and special projects (2005-2010), and of international relations and organization (since December 2010). Since January 2010, he is member of the scientific Board of the Fonds National de la Recherche. He was Professor at the University of Grenoble (France 2000-2003) and researcher at the CNRS Paris (1993-2000). He received his PhD and Habilitation in Mathematics in Paris in 1992 and 1997. He was guest at the Max-Planck-Institut für Mathematik (Bonn) and at the Technische Universität Berlin, and a research fellow of the Alexander von Humboldt foundation Stay connected and subscribe to our newsletter All fields are mandatory Choose among our mailing list(s) Mailing list 0 items selected University of Luxembourg – News and events FSTM – News and events Enter your email address Example: contact@uni.lu Please provide a valid email address. Example: jean.dupont@gmail.com I agree to the use of my email address in the context of subscribing to the University of Luxembourg’s newsletters. I am aware that I can unsubscribe or update my profile by clicking the unsubscribe or update profile link in the email communication. More information about data processing. Subscribe now To the top",
  "content_length": 3448,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:04"
}