{
  "name": "François Baccelli",
  "homepage": "http://www.di.ens.fr/~baccelli",
  "status": "success",
  "content": "François Baccelli François Baccelli Institutions: INRIA (Unité de Recherche de Rocquencourt) and ENS (Département d'Informatique) Research Group: TREC E-mail: Francois DOT Baccelli AT ens DOT fr Telephone: +33 1 44 32 20 52 Fax: +33 1 44 32 20 15 RESEARCH My research directions are all at the interface between applied mathematics and communications: Stochastic geometry, information theory and wireless networks. Performance evaluation of communication networks; Stochastic network calculus. BIBLIOGRAPHY Here is a complete bibliography in pdf format. Some additional bibliographical data and direct links to the research papers can be found in e.g.: A partial list of research reports sorted by dates. The site of Google Scholar. The site of Zentralblatt Math Bibliography. The DPLB's Computer Science Bibliography. The site of arXiv. The Microsoft Academic Search site. BOOKS Here is the list of books I co-authored: Stochastic Geometry and Wireless Networks (2009), by F. Baccelli and B. Blaszczyszyn: pdf of Volume I (Theory) pdf of Volume II (Applications) also published in the series Foundations and Trends in Networking by NOW Publishers: Volume I and Volume II. Elements of Queueing Theory (2003), by F. Baccelli and P. Brémaud, Springer Verlag. The first edition was published in 1994. Synchronization and Linearity, (1992), by F. Baccelli, G. Cohen, G. J. Olsder and J. P. Quadrat. This book was published by Wiley. The pdf file is available here. TEACHING In 2010-2011, I taught: An L3 course called Structures et Algorithmes Aléatoires, that I teach jointly with Pierre Brémaud at the Prédoctorat of ENS; this course is part of the mathematics and computer science syllabus of ENS. An M1-M2 research course on Stochastic Geometry and Wireless Networks at ENS Lyon. An M2 course on network dynamics and algorithms that we organize with Jean Mairesse at the Master Parisien de Recherche en Informatique (MPRI). POSITIONS AND MEMBERSHIPS Organizer, with V. Anantharam, D. Denisov, S. Foss, P. Glynn and T. Konstantopoulos of the SCS Programme of the Newton Institute for Mathematical Sciences (January to June 2010). Visiting Professor at the Miller Institute for Basic Research in Science for the first semester of 2009-2010 at UC Berkeley. Member of the French Academy of Sciences since 2005. Eurandom Chair at the Eurandom Institute in 2004-2005. Before joining ENS in 98, I was a member of the Mistral group in Sophia Antipolis. J'ai aussi une page en Français, que je suis en train de mettre à jour. Last revised: July, 2011.",
  "content_length": 2542,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:44"
}