{
  "name": "Francesca Parise",
  "homepage": "https://www.engineering.cornell.edu/people/francesca-parise",
  "status": "success",
  "content": "Francesca Parise | Cornell Engineering Menu Quick Links Schools and Departments Undergraduate Majors and Minors Faculty and Staff Directory Schools and Departments Select a site School of Applied and Engineering Physics Meinig School of Biomedical Engineering R.F. Smith School of Chemical and Biomolecular Engineering School of Civil and Environmental Engineering Department of Earth and Atmospheric Sciences School of Electrical and Computer Engineering Engineering Management Program Department of Materials Science and Engineering Sibley School of Mechanical and Aerospace Engineering School of Operations Research and Information Engineering Systems Engineering Program Selecting a site will automatically redirect you to the site's homepage. Graduate Field Affiliations Applied Mathematics Computer Science Electrical and Computer Engineering Systems Engineering Biography Francesca Parise joined the School of Electrical and Computer Engineering at Cornell University as an assistant professor in July 2020. Before then, she was a postdoctoral researcher at the Laboratory for Information and Decision Systems at MIT. She defended her PhD at the Automatic Control Laboratory, ETH Zurich, Switzerland in 2016 and she received the B.Sc. and M.Sc. degrees in Information and Automation Engineering in 2010 and 2012, from the University of Padova, Italy, where she simultaneously attended the Galilean School of Excellence. Francesca was recognized as an EECS rising star in 2017 and is the recipient of the Guglielmo Marin Award from the “Istituto Veneto di Scienze, Lettere ed Arti”, the SNSF Early Postdoc Fellowship, the SNSF Advanced Postdoc Fellowship and the ETH Medal for her doctoral work. Research Interests Francesca’s research focuses on problems that arise in the analysis and control of multi-agent systems composed by a large number of users that make autonomous and selfish decisions while interacting with each other, with application to transportation, social and economic networks. To this end, she applies tools from control, network and game theory. Francesca has worked on a broad set of topics, including distributed control, aggregative and network games, opinion and epidemic dynamics, systems biology and reachability analysis. Complex Systems, Network Science and Computation Systems and Networking Algorithms Statistics and Machine Learning Systems and Synthetic Biology Information Theory and Communications Information, Networks, and Decision Systems Select Publications F. Parise, A. Ozdaglar. “Graphon Games.” EC 2019 F. Parise, A. Ozdaglar. “A variational inequality framework for network games: Existence, uniqueness, convergence and sensitivity analysis.” Games and Economic Behaviour, 2019. M. Avella-Medina , F. Parise , M.T. Schaub , and S. Segarra . “Centrality measures for graphons”. IEEE Transactions on Network Science and Engineering, 2018. D. Paccagnan, B. Gentile, F. Parise, M. Kamgarpour and J. Lygeros. “Nash and Wardrop equilibria in aggregative games with coupling constraints”. IEEE Transaction on Automatic Control, 2018. J. Ruess, F. Parise, A. Milias-Argeitis, M. Khammash, J. Lygeros. “Iterative experiment design guides the characterization of a light-inducible gene expression circuit”. PNAS, 2015 Francesca Parise's Google Scholar Select Awards and Honors SNSF Advanced Postdoc Mobility Fellowship, P300P2-177805 2017 ETH Medal, Awarded to honor outstanding PhD dissertations at ETH Zurich 2017 Participant of Rising Stars in EECS 2017 SNSF Early Postdoc Mobility Fellowship, P2EZP2-168812 2016 Guglielmo Marin Award, Istituto Veneto di Scienze Lettere ed Arti 2015 Education B.S., Information Engineering, University of Padova 2010 M.S., Control Engineering, University of Padova 2012 Completion Certificate, Galilean School of Higher Education 2013 Ph.D., ETH, Zurich 2016 In the News Sprout Awards spring collaborative engineering research From exploring the mechanics of early-stage bone metastasis to analyzing price formation policies in wholesale electricity markets, Cornell Engineering’s Sprout Awards are funding unique research projects with the potential to grow partnerships across Cornell.",
  "content_length": 4165,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:51"
}