{
  "name": "Frank Leymann",
  "homepage": "https://www.iaas.uni-stuttgart.de/en/institute/team/Leymann",
  "status": "success",
  "content": "Prof. Dr. Dr. h. c. Frank Leymann | Institute of Architecture of Application Systems | University of Stuttgart jump to content jump to footer back close navigation For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Frank Leymann Prof. Dr. Dr. h. c. Managing DirectorInstitute of Architecture of Application Systems Contact +49 711 685 88470 +49 711 685 88472 Email Universitätsstraße 38 70569 Stuttgart Germany Room: 1.359 Office Hours Please contact my secretary to schedule a meeting. Publications Books Fehling, Christoph; Leymann, Frank; Retter, Ralph; Schupeck, Walter; Arbitter, Peter: Cloud Computing Patterns: Fundamentals to Design, Build, and Manage Cloud Applications., Springer, 2014. BibTeX @book{Fehling2014_Book, Title = {{Cloud Computing Patterns: Fundamentals to Design, Build, and Manage Cloud Applications}}, Author = {Christoph Fehling and Frank Leymann and Ralph Retter and Walter Schupeck and Peter Arbitter}, Year = 2014, Month = jan, Publisher = {Springer}, Pages = {367} } Weerawarana, Sanjiva; Curbera, Francisco; Leymann, Frank; Storey, Tony; Ferguson, Donald F.: Web Services Platform Architecture: SOAP, WSDL, WS-Policy, WS-Addressing, WS-BPEL, WS-Reliable Messaging and More., Prentice Hall PTR, 2005. BibTeX @book{Weerawarana2005_WSStack, Title = {{Web Services Platform Architecture: SOAP, WSDL, WS-Policy, WS-Addressing, WS-BPEL, WS-Reliable Messaging and More}}, Author = {Weerawarana, Sanjiva and Curbera, Francisco and Leymann, Frank and Storey, Tony and Ferguson, Donald F.}, Year = 2005, Month = apr, Publisher = {Prentice Hall PTR}, numpages = {456} } Leymann, Frank; Roller, Dieter: Production Workflow: Concepts and Techniques., Prentice Hall PTR, 2000. BibTeX @book{Leymann2000_ProductionWorkflow, Title = {{Production Workflow: Concepts and Techniques}}, Author = {Leymann, Frank and Roller, Dieter}, Year = 2000, Publisher = {Prentice Hall PTR}, numpages = {479} } Habermann, Hans-Joachim; Leymann, Frank: Repository. Eine Einführung., Oldenbourg Verlag, 1993. BibTeX @book{BOOK-1993-02, Title = {{Repository. Eine Einf{\\\"u}hrung}}, Author = {Hans-Joachim Habermann and Frank Leymann}, Year = 1993, Month = jan, Publisher = {Oldenbourg Verlag}, Pages = {294} } Book Chapters Barzen, Johanna; Leymann, Frank: Quantencomputing als Integrationsproblem: Quantenanwendungen sind in der Praxis immer hybride. In: Chancen und Risiken von Quantentechnologien, Springer Gabler, 2023. BibTeX @inbook{Barzen2023_QuantencomputingAlsIntegrationsproblem, Title = {{Quantencomputing als Integrationsproblem: Quantenanwendungen sind in der Praxis immer hybride}}, Author = {Barzen, Johanna and Leymann, Frank}, Year = 2023, Month = jan, Booktitle = {Chancen und Risiken von Quantentechnologien}, Publisher = {Springer Gabler}, Editor = {Wilms, Alissa and Neukart, Florian}, Pages = {115--123}, Doi = {10.1007/978-3-658-37534-8_12}, url = {https://link.springer.com/chapter/10.1007/978-3-658-37534-8_12} } Weder, Benjamin; Barzen, Johanna; Leymann, Frank; Vietz, Daniel: Quantum Software Development Lifecycle. In: Quantum Software Engineering, Springer International Publishing, 2022. BibTeX @inbook{Weder2022_QuantumSoftwareDevLifecycle, Title = {{Quantum Software Development Lifecycle}}, Author = {Weder, Benjamin and Barzen, Johanna and Leymann, Frank and Vietz, Daniel}, Year = 2022, Month = oct, Booktitle = {Quantum Software Engineering}, Publisher = {Springer International Publishing}, Editor = {Serrano, Manuel A. and P{\\'e}rez-Castillo, Ricardo and Piattini, Mario}, Pages = {61--83}, Doi = {10.1007/978-3-031-05324-5_4}, url = {https://link.springer.com/chapter/10.1007/978-3-031-05324-5_4}, projects = {PlanQK,SimTech,SEQUOIA} } Leymann, Frank; Barzen, Johanna: Pattern Atlas. In: Next-Gen Digital Services. A Retrospective and Roadmap for Service Computing of the Future, Springer International Publishing, 2021. pdf, ‌ BibTeX @inbook{Leymann2021_PatternAtlas, Title = {{Pattern Atlas}}, Author = {Frank Leymann and Johanna Barzen}, Year = 2021, Month = apr, Journal = {Next-Gen Digital Services. A Retrospective and Roadmap for Service Computing of the Future}, Publisher = {Springer International Publishing}, Pages = {67--76}, url = {https://link.springer.com/chapter/10.1007%2F978-3-030-73203-5_5} } Barzen, Johanna; Falkenthal, Michael; Leymann, Frank: Wenn Kostüme sprechen könnten: MUSE - Ein musterbasierter Ansatz an die vestimentäre Kommunikation im Film. In: Digital Humanities. Perspektiven der Praxis, Frank und Timme, 2018. pdf, ‌ BibTeX @inbook{Barzen2018_MUSE, Title = {{Wenn Kost{\\\"u}me sprechen k{\\\"o}nnten: MUSE - Ein musterbasierter Ansatz an die vestiment{\\\"a}re Kommunikation im Film}}, Author = {Johanna Barzen and Michael Falkenthal and Frank Leymann}, Year = 2018, Month = may, Booktitle = {Digital Humanities. Perspektiven der Praxis}, Publisher = {Frank und Timme}, Address = {Berlin}, Pages = {223--241} } Guth, Jasmin; Breitenbücher, Uwe; Falkenthal, Michael; Fremantle, Paul; Kopp, Oliver; Leymann, Frank; Reinfurt, Lukas: A Detailed Analysis of IoT Platform Architectures: Concepts, Similarities, and Differences. In: Internet of Everything: Algorithms, Methodologies, Technologies and Perspectives, Springer, 2018. pdf, ‌ BibTeX @inbook{Guth2018_AnalysisIoTPlatformArchitecturesBook, Title = {{A Detailed Analysis of IoT Platform Architectures: Concepts, Similarities, and Differences}}, Author = {Jasmin Guth and Uwe Breitenb{\\\"u}cher and Michael Falkenthal and Paul Fremantle and Oliver Kopp and Frank Leymann and Lukas Reinfurt}, Year = 2018, Month = jan, Booktitle = {Internet of Everything: Algorithms, Methodologies, Technologies and Perspectives}, Publisher = {Springer}, Pages = {81--101}, Series = {Internet of Things} } Wettinger, Johannes; Breitenbücher, Uwe; Leymann, Frank: Streamlining APIfication by Generating APIs for Diverse Executables Using Any2API. In: Cloud Computing and Services Science, Springer International Publishing, 2016. BibTeX @inbook{Wettinger2016_APIfication, Title = {{Streamlining APIfication by Generating APIs for Diverse Executables Using Any2API}}, Author = {Johannes Wettinger and Uwe Breitenb{\\\"u}cher and Frank Leymann}, Year = 2016, Month = feb, Booktitle = {Cloud Computing and Services Science}, Publisher = {Springer International Publishing}, Pages = {216--238}, Series = {Communications in Computer and Information Science}, Volume = {581}, Doi = {10.1007/978-3-319-29582-4_12} } Sáez, Santiago Gómez; Andrikopoulos, Vasilios; Hahn, Michael; Karastoyanova, Dimka; Leymann, Frank; Skouradaki, Marigianna; Vukojevic-Haupt, Karolina: Performance and Cost Trade-Off in IaaS Environments: A Scientific Workflow Simulation Environment Case Study. In: Cloud Computing and Services Science, Springer, 2016. pdf, ‌ BibTeX @inbook{INBOOK-2016-02, Title = {{Performance and Cost Trade-Off in IaaS Environments: A Scientific Workflow Simulation Environment Case Study}}, Author = {Santiago G{\\'o}mez S{\\'a}ez and Vasilios Andrikopoulos and Michael Hahn and Dimka Karastoyanova and Frank Leymann and Marigianna Skouradaki and Karolina Vukojevic-Haupt}, Year = 2016, Month = feb, Booktitle = {Cloud Computing and Services Science}, Publisher = {Springer}, Pages = {153--170}, Series = {Communications in Computer and Information Science}, Volume = {581} } Breitenbücher, Uwe; Binz, Tobias; Kopp, Oliver; Képes, Kálmán; Leymann, Frank; Wettinger, Johannes: Hybrid TOSCA Provisioning Plans: Integrating Declarative and Imperative Cloud Application Provisioning Technologies. In: Cloud Computing and Services Science, Springer International Publishing, 2016. BibTeX @inbook{Breitenbuecher2016_HybridToscaProvisioning, Title = {{Hybrid TOSCA Provisioning Plans: Integrating Declarative and Imperative Cloud Application Provisioning Technologies}}, Author = {Uwe Breitenb{\\\"u}cher and Tobias Binz and Oliver Kopp and K{\\'a}lm{\\'a}n K{\\'e}pes and Frank Leymann and Johannes Wettinger}, Year = 2016, Month = feb, Booktitle = {Cloud Computing and Services Science}, Publisher = {Springer International Publishing}, Pages = {239--262}, Series = {Communications in Computer and Information Science}, Volume = {581}, Doi = {10.1007/978-3-319-29582-4_13}, projects = {OpenTOSCA} } Breitenbücher, Uwe; Binz, Tobias; Kopp, Oliver; Leymann, Frank; Wieland, Matthias: Context-Aware Provisioning and Management of Cloud Applications. In: Cloud Computing and Services Science, Springer, 2015. BibTeX @inbook{Breitenbuecher2015_ContextBook, Title = {{Context-Aware Provisioning and Management of Cloud Applications}}, Author = {Uwe Breitenb{\\\"u}cher and Tobias Binz and Oliver Kopp and Frank Leymann and Matthias Wieland}, Year = 2015, Booktitle = {Cloud Computing and Services Science}, Publisher = {Springer}, Pages = {151--168}, Series = {Communications in Computer and Information Science}, projects = {OpenTOSCA} } Binz, Tobias; Breitenbücher, Uwe; Kopp, Oliver; Leymann, Frank: TOSCA: Portable Automated Deployment and Management of Cloud Applications., Springer, 2014. pdf, ‌ BibTeX @inbook{Binz2014_TOSCABookchapter, Title = {{TOSCA: Portable Automated Deployment and Management of Cloud Applications}}, Author = {Tobias Binz and Uwe Breitenb{\\\"u}cher and Oliver Kopp and Frank Leymann}, Year = 2014, Month = jan, Publisher = {Springer}, Pages = {527--549}, Series = {Advanced Web Services}, projects = {CloudCycle,OpenTOSCA} } Andrikopoulos, Vasilios; Strauch, Steve; Fehling, Christoph; Leymann, Frank: CAP-Oriented Design for Cloud-Native Applications. In: Cloud Computing and Services Science, Springer International Publishing, 2013. pdf, ‌ BibTeX @inbook{INBOOK-2013-03, Title = {{CAP-Oriented Design for Cloud-Native Applications}}, Author = {Vasilios Andrikopoulos and Steve Strauch and Christoph Fehling and Frank Leymann}, Year = 2013, Month = dec, Booktitle = {Cloud Computing and Services Science}, Publisher = {Springer International Publishing}, Pages = {215--229}, Series = {Communications i",
  "content_length": 497152,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:30"
}