{
  "name": "Francisco Cedrón",
  "homepage": "https://pdi.udc.es/en/File/Pdi/XY7AF",
  "status": "success",
  "content": "Francisco Abel Cedrón Santaeufemia File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Laboratorio de Ingeniería del Software Research lines Artificial Intelligence, Evolutionary computing, Computational Connectionist Modeling: Neuroscience Keywords Machine Learning, Artificial Neuron-Glia Networks, Connectionist Systems, Evolutionary computation Contacto UDC directory Orcid id0000-0002-6962-4749 ResearcherIDC-5921-2015 Scopus56609290400 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Final Year Dissertation Degree in Data Science and Engineering Compulsory 0 6 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 8.5 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 16 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 12 Master's Dissertation Master's in Computer Engineering Compulsory 0 3.5 Programming I Degree in Computer Engineering Programa de Simultaneidad del Grado en Ingeniería Informática y Grado en Ciencia e Ingeniería de Datos Core 0 90 Programming I Degree in Artificial Intelligence Core 0 25 Software Process Degree in Computer Engineering Compulsory 0 100 Subject and involved studies Type Distance hours Total hours Final Year Dissertation Degree in Data Science and Engineering Compulsory 0 1.5 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 3 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 5.5 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 22 Master's Dissertation Master's in Computer Engineering Compulsory 0 4.5 Programming I Degree in Computer Engineering Core 0 93 Programming I Degree in Artificial Intelligence Core 0 10 Software Process Degree in Computer Engineering Compulsory 0 90 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 6 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 3 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 22 Master's Dissertation Master's in Computer Engineering Compulsory 0 3.5 Programming I Degree in Computer Engineering Core 0 103 Programming I Degree in Artificial Intelligence Core 0 10 Software Development Projects Degree in Computer Engineering Optional 0 12 Software Process Degree in Computer Engineering Compulsory 0 70 Work Placement Master's in Computer Engineering Compulsory 0 4 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Information Systems Degree in Computer Engineering Compulsory 0 8 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 4 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 8 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 50 Programming I Degree in Computer Engineering Core 0 82 Software Development Projects Degree in Computer Engineering Optional 0 23 Software Process Degree in Computer Engineering Compulsory 0 104 Work Placement Master's in Computer Engineering Compulsory 0 6 Subject and involved studies Type Distance hours Total hours Fundamentals of Programming I Degree in Data Science and Engineering Core 0 50 Master's Dissertation Master's in Computer Engineering Compulsory 0 2.5 Programming I Degree in Computer Engineering Core 0 82 Software Development Projects Degree in Computer Engineering Optional 0 23 Software Process Degree in Computer Engineering Compulsory 0 134 Subject and involved studies Type Distance hours Total hours Fundamentals of Programming I Degree in Data Science and Engineering Core 0 45 Programming I Degree in Computer Engineering Core 0 195 Software Development Projects Degree in Computer Engineering Optional 0 14 Software Process Degree in Computer Engineering Compulsory 0 62 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Tuesday 10:30 a 11:30 Teams (concertar cita previamente) 1st quarter Thursday 09:00 a 11:30 Teams (concertar cita previamente) 1st quarter Friday 10:30 a 12:30 Teams (concertar cita previamente) 2nd quarter Tuesday 09:30 a 10:30 Teams (concertar cita previamente) 2nd quarter Wednesday 09:30 a 11:30 Teams (concertar cita previamente) 2nd quarter Friday 09:30 a 11:30 Teams (concertar cita previamente) EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 2019/2020 2017/2018 2016/2017 Web application module for validation management Comparison of collaborative recommendation systems using sports and outdoor reviews obtained from Amazon Design and development of a social network to facilitate communication and hiring of football players Entertainment event management web application Web application for project managenment through the use of the Kanban boards method Web application to share notes between students. Web platform for SCRUM project management based on microfrontends. Comparison of machine learning techniques with a collaborative filtering system using amazon CD and vynil reviews Web application to shorten URLs and view usage statistics Automated incident generation web application based on complex Health Checks Expert system for generating and validating dynamic forms in order to evaluate and certify the sustainability of a building Implementation of a business intelligence system for the analysis of pharmacological prescriptions Application for decision-making on mild cognitive impairments Complete implementation of a corporate web site using stacks Implementation of the reduction of the checkout process from five to two steps in the e-commerce platform HCL Commerce V9, for multinational company of the construction sector, following the B2B2C model BI Integrations: External data sources integration on FlyThings Web/mobile application for personalized prescription of probiotics according to pathology or current treatment of the patient Web application for Artificial NeuroGlial Networks simulations in multiple processors Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Papers in research journals Book chapters PhD theses directed Conference papers 2019 2016 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Manuel F. González Penedo Type Proyecto Programas Autonomicos Dates From 01/01/2016 to 30/11/2019 2024 2023 2021 2020 2019 ... 2017 2016 2015 Authors Francisco Cedron, Sara Alvarez-Gonzalez, Ana Ribas-Rodriguez, Santiago Rodríguez Yáñez, Ana Belen Porto Pazos Journal Applied Sciences Vol. 14 Num. 17 DOI https://doi.org/10.3390/app14178020 Authors Sara Alvarez-Gonzalez, Francisco Cedron, Alejandro Pazos, Ana Belén Porto Pazos Journal ARTIFICIAL INTELLIGENCE REVIEW DOI https://doi.org/10.1007/s10462-023-10586-1 Authors Adrian Carballal Mato, Francisco Cedron, Iria Santos, Antonino Santos Del Riego, Juan Jesús Romero Cardalda Journal NEURAL COMPUTING & APPLICATIONS (pages 1 to 13) DOI https://doi.org/10.1007/s00521-020-05550-x Authors Sara Alvarez-Gonzalez, Jose Rodriguez-Fernandez, Ana Belén Porto Pazos, Alejandro Pazos Sierra, Francisco Cedron Journal Applied Sciences Vol. 11 Num. 4 Authors Paula Carracedo-Reboredo, Jose Liñares-Blanco, Nereida Rodriguez-Fernandez, Francisco Cedron, Francisco J. Nóvoa, Adrian Carballal Mato, Victor Maojo, Alejandro Pazos, Carlos Fernández Lozano Journal Computational and Structural Biotechnology Journal Vol. 19 (pages 4538 to 4558) Authors Erick Gonzalez-Martin, Alberto Alvarellos, Virginia Mato-Abad, Juan Manuel Pías Peleteiro, Isable Jiménez Martín, Francisco Cedron Journal Proceedings DOI https://doi.org/10.3390/engproc2021007055 Authors Carlos Fernández Lozano, Francisco Cedron Journal Proceedings Authors Sara Alvarez-Gonzalez, Jose Rodriguez-Fernandez, Ana Belén Porto Pazos, Alejandro Pazos Sierra, Francisco Cedron Journal Proceedings Authors Francisco Cedron, Sara Alvarez-Gonzalez, Pazos, A., Porto-Pazos A. B. Journal Proceedings Vol. 21 Num. 1 (pages 134 to 136) Authors L.A. Pastur-Romay, Porto-Pazos A. B., F. Cedrón, Pazos, A. Journal CURRENT TOPICS IN MEDICINAL CHEMISTRY Vol. 17 Num. 14 (pages 1646 to 1668) Authors Carlos Fernández Lozano, Francisco Abel Cedrón Santaeufemia, Daniel Rivero Cebrián, Dorado, L., José Manuel Andrade Garda, Alejandro Pazos Sierra, Marcos Gestal Pose Journal ENGINEERING COMPUTATIONS Vol. 33 Num. 4 (pages 995 to 1005) DOI https://doi.org/10.1108/ec-03-2015-0062 Authors Lucas-Antón Pastur Romay, Francisco Abel Cedrón Santaeufemia, Alejandro Pazos Sierra, Ana Belén Porto Pazos Journal International Journal of Molecular Sciences Vol. 17 Num. 8 (pages 1313 to 1320) DOI https://doi.org/10.3390/ijms17081313 Authors Mesejo P., Ibáñez O., Enrique Fernandez-Blanco, Cedrón F., Alejandro Pazos Sierra, Porto-Pazos A. B. Journal International Journal of Neural Systems Vol. 25 Num. 4 2013 Authors José Manuel Andrade Garda. Marcos Gestal. Francisco Abel Cedrón Santaeufemi",
  "content_length": 12197,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:10"
}