{
  "name": "Francesco Regazzoni 0001",
  "homepage": "https://cci-research.nl/author/francesco-regazzoni",
  "status": "success",
  "content": "Francesco Regazzoni | Complex Cyber-Infrastructures (CCI)SearchFrancesco RegazzoniAssociate ProfessorUniversity of AmsterdamDr. Francesco Regazzoni is an Associate Professor in Security by Design at the Informatics Institute of the University of Amsterdam (Amsterdam, The Netherlands). He authored or co-authored more than 160 publications in international journals, conferences, or books. His research interests comprise a variety of topics in security, especially on efficient implementation of privacy preserving technologies, physical and side channel attacks and countermeasures, hardware trojans, post-quantum cryptography, lightweight cryptography, and design automation for security.He is the coordinator of the SECURED Horizon Europe project and has been Principal Investigator for his institution of 4 Horizon 2020 projects.He is (or has been) the general chair of CARDIS 2023, COSADE 2021, CARDIS 2017, and of the TRUDEVICE Training School 2016; the chair of the program committee of SAMOS 2024, SPACE 2023, CCSW 2023, CCSW 2022, FDTC 2017, the chair of the Topic DT6 at DATE 2021, DATE 2022, and DATE 2023, the chair of the \"Track Security and Safety\" at VLSIDesign 2022, and of the Track “Hardware/Cyber Security & Privacy track” at IEEE COINS 2022, IEEE COINS 2023 and IEEE COINS 2024, and the co-founder of the Mal-IoT workshop series (co-located with ACM Computing Frontiers since 2016). He serves (or has served) as program committee member of renowned international conferences including CHES, DAC, DATE, CODES+ISSS, ISLPED, ICCAD, HOST, GLSVLSI, COSADE, CARDIS, INDOCRYPT, and he is member of the editorial board of IACR Transactions on Cryptographic Hardware and Embedded Systems (TCHES) and of IACR Transactions on Symmetric Cryptology (ToSC). He is a member of the ACM, the IEEE, the IACR, and of European Network of Excellence on High Performance and Embedded Architecture and Compilation (HiPEAC).Dr. Francesco Regazzoni did his master at Politecnico di Milano (Milano, Italy) and his PhD at ALaRI Institute of Università della Svizzera italiana (Lugano, Switzerland). He has been postdoctoral researcher at the Crypto Group of the Université catholique de Louvain (Louvain-la-Neuve, Belgium), at ALaRI Institute of Università della Svizzera italiana (Lugano, Switzerland), and at Faculteit Elektrotechniek, Wiskunde & Informatica of Delft University of Technology (TU Delft) (Delft, The Netherlands). He has been visiting researcher at NEC Labs America (Princeton, NJ, USA), in 2003, 2004, 2005, and 2006; at COmmunication Security (COSY) of Horst Gortz Institute for IT Security at Ruhr University of Bochum (Bochum, Germany) in 2006, at Laboratoire d'architecture de processeurs at EPFL (Lausanne, Switzerland) in 2007 and 2008, and at Nanyang Technological University, Singapore (Singapore) in 2014.PublicationsInterestsDesgin Automation for SecurityEfficient Implementation of Cryptographic PrimitivesPhysical and Side Channel Attacks (and countermeasures)Hardware TrojansEducationPhD in Computer ScienceUniversità della Svizzera italiana, Lugano, SwitzerlandMaster of Advanced Studies in Embedded Systems DesignALaRI Institute, Università della Svizzera italiana, Lugano, SwitzerlandLaurea in Ingegneria informatica (MSc in Computer Engineering)Politecnico di Milano, Milano ItalyLatestPosters presented at CPS Summer School 2024Cryptographic EngineeringThis week at CCI: CARDIS 2023Paper Accepted at DATE 2024Introduction to SecurityBest Short Paper Award at CompSys 2023Paper Presented at IJCNN 2023Paper Published at ACM Computing SurveysCall for Papers: CARDIS 2023Two PhD positions on efficient privacy-preserving techniques for data analysis and machine learningPost-Quantum Cryptography: Challenges and Opportunities for Robust and Secure HW DesignAn Instruction Set Extension to Support Software-Based MaskingGuest Editors’ Introduction: Special Issue on Top Picks in Hardware and Embedded SecuritySecurity, Reliability and Test Aspects of the RISC-V EcosystemSpecial Section on Attacking and Protecting Artificial IntelligenceA Deeper Look at the Energy Consumption of Lightweight Block Ciphers Cite × Copy Download",
  "content_length": 4154,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:02"
}