{
  "name": "Franklin Bristow",
  "homepage": "http://www.cs.umanitoba.ca/~fbristow",
  "status": "success",
  "content": "Franklin Bristow Welcome to my home page! I am an instructor in the Department of Computer Science at the University of Manitoba. Contact The best way to reach me is by e-mail at franklin.bristow@umanitoba.ca. You can find me in E2-418 🫖 E2 EITC. My telephone number is 204-474-8830. You can browse my code on GitHub. Courses I’ve taught many courses in the department. You can find some resources that I’ve shared for certain courses linked below. COMP 3430 COMP 1002 and COMP 1006 COMP 1002 and COMP 1006 COMP 1002 and COMP 1006 are collectively known as Introduction to Tools and Techniques in Computer Science. These courses are inspired by other introductory lab courses, including: Great Practical Ideas in CS at Carnegie Mellon University The Missing Semester of Your CS Education at MIT COMP 3430 We use the excellent (and free!) “Operating Systems: Three Easy Pieces” textbook when I teach this course. I’ve prepared reading notes and summary videos for some of the chapters for this book to complement the chapters themselves: Chapter 4 Processes [Notes] Chapter 5 Process API [Notes] Chapter 6 Direct Execution [Notes] [Video] Chapter 7 CPU Scheduling [Notes] Chapter 8 Multi-level Feedback [Notes] [Video] Chapter 9 Lottery Scheduling [Notes] Chapter 13 Address Spaces [Notes] Chapter 15 Address Translation [Notes] [Video] Chapter 16 Segmentation [Notes] [Video] Chapter 17 Free-Space Management [Notes] Chapter 18 Introduction to Paging [Notes] [Video] Chapter 20 Advanced Page Tables [Notes] Chapter 26 Concurrency and Threads [Notes] [Video] Chapter 27 Thread API [Notes] Chapter 28 Locks [Notes] [Video] Chapter 30 Condition Variables [Notes] Chapter 32 Concurrency Bugs [Notes] Chapter 36 I/O Devices [Notes] [Video] Chapter 37 Hard Disk Drives [Notes] Chapter 38 Redundant Disk Arrays (RAID) [Notes] Chapter 39 Files and Directories [Notes] Chapter 40 File System Implementation [Notes] [Video] Chapter 42 FSCK and Journaling [Notes] [Video] We also use one chapter from “Advanced Programming in the UNIX Environment” (APUE) to talk about inter-process communication (IPC). APUE is very good, but unfortunately not free. Chapter 15 Interprocess Communication [Notes] [Video]",
  "content_length": 2193,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:38"
}