{
  "name": "Franca Hoffmann",
  "homepage": "https://francahoffmann.wordpress.com",
  "status": "success",
  "content": "Franca Hoffmann's Old Homepage I am an Assistant Professor in Computing and Mathematical Sciences at Caltech and  International Scientific Advisor at Quantum Leap Africa, at the African Institute for Mathematical Sciences (AIMS). I was previously a Bonn Junior Fellow with the Hausdorff Center for Mathematics at Rheinische Friedrich-Wilhelms-Universität Bonn, Germany, and the AIMS-Carnegie Research Chair in Data Science at Quantum Leap Africa.  Currently, I serve as Program Director of the new Doctoral Training Program in Data Science (DTP-DS) at Quantum Leap Africa (QLA) in Kigali, Rwanda. From 2017 to 2020, I was a Von Karman Postdoctoral Instructor in Applied and Computational Mathematics at the Department of Computing and Mathematical Sciences, California Institute of Technology (Caltech) in Pasadena, USA. In July 2017, I completed my PhD at the Cambridge Centre for Analysis (CCA) Doctoral Training Centre, University of Cambridge and Imperial College London, under the supervision of Prof. José A. Carrillo and Prof. Clément Mouhot. A copy of my thesis can be downloaded here. I’m honoured to have received the 2016 Imperial College Outstanding Student Achievement Award. Have a look here for a short video about some of my PhD research to a non-mathematical audience, presented at the finals of the 3-Minute-Thesis Competition 2016, Imperial College London. For a one hour seminar about my PhD research, click here. My research interests lie at the interface of model-driven and data-driven approaches. Mathematical Tools for PDE Analysis: This part of my research focuses on partial differential equations and their applications. My current interests are among others non-linear drift-diffusion equations, kinetic theory, many particle systems, gradient flows, entropy methods, optimal transport, functional inequalities, parabolic and hyperbolic scaling techniques, hypocoercivity and diffusive models in mathematical biology. Mathematical Tools for Data Analysis: I am interested in developing rigorous mathematical tools for data analysis in the context of  inverse problems, Bayesian inference and machine learning, unsupervised and semi-supervised learning, focusing on data clustering and classification, graph Laplacians and their continuum counterparts, spectral analysis, uncertainty quantification and consistency analysis. I believe that it is not just about what mathematical analysis can do for applications, but also what applications can do for mathematics. Applications that benefit from a PDE approach often generate new questions giving rise to novel mathematical theories, and thus providing insights not just for the application at hand, but also enabling to push boundaries in seemingly unrelated fields. I am interested in how PDE techniques can be employed to answer modeling questions across different scales, disciplines and applications. For more details about my research, have a look here. Upcoming Events & Deadlines Our Oberwolfach Snapshot on Emergence in Biology and Social Sciences is now out! Thanks to Sarah Merino-Aceituno for co-authoring, and the team from Oberwolfach for the patient support. The website for our new Young African Mathematicians (YAM) Bonn Visitor Program is now online. If you are interested in supervising a PhD student as part of the Doctoral Training Program in Data Science at Quantum Leap Africa (QLA), the deadline for topic submissions has been extended to 12 January 2022. Training school “Foundational Methods in Data Science” (March 6 – April 2, 2022), Quantum Leap Africa, African Institute for Mathematical Sciences, Kigali, Rwanda. Applications are open, deadline: 28 January 2022. For the poster, click here. Hausdorff School “Foundational Methods in Machine Learning” (June 6-10, 2022), Hausdorff Center for Mathematics, University of Bonn, Germany. Applications are open, deadline: 06 February 2022. Additional financial support is available especially for participants from developing countries. HCM workshop “Synergies between Data Science and PDE Analysis” (June 13-17, 2022), Hausdorff Center for Mathematics, University of Bonn, Germany. Applications are open, deadline: 15 February 2022. Additional financial support is available especially for participants from developing countries. Science Slam, Uni Bonn, 22 August 2022. CIMPA School “Partial Differential Equations and Calculus of Variations” (August 29 – September 9, 2022), Institut de Mathématiques et de Sciences Physiques (IMSP), Dangbo, Benin. Applications are open, deadline: 17 April 2022. For more info, also see here. Updates 2022/01/06: Our article Consensus-based sampling has been published by Studies in Applied Mathematics. 2022/01/04: I decided to participate in the Science Slam at University of Bonn on 22 August 2022. Looking forward to it! 2021/12/16: SQuaRE proposal to the American Institute of Mathematics (AIMS) has been funden! Looking forward to working with Anna Korba, Wuchen Li and Daniel Sanz-Alonso. Our article Spectral analysis of weighted Laplacians arising in data clustering has been published in Applied and Computational Harmonic Analysis (ACHA). Great experience being interviewed by forsch, the newspaper of University of Bonn. Have a look HERE for the full article (in German). Join us for the Virtual Conference “Facing Global Challenges Together – How can digitalization contribute to a more resilient global health”, taking place on 20 and 21 April 2021. This virtual conference will bring together researchers from Africa and the federal state of Baden-Württemberg, Germany, to discuss digitalization and its current and potential contribution to building more resilient global health systems. Get in touch with me for more details, or CLICK HERE to register. I’ve been elected to join the Steering Committee of the Transdisciplinary Research Area Mathematics, Modelling and Simulation of Complex Systems at University of Bonn. Our article Geometric structure of graph Laplacian embeddings with N. Garcia Trillos and B. Hosseini has been accepted in the Journal of Machine Learning Research (JMLR). Our article Uniqueness of stationary states for singular Keller–Segel type models with V. Calvez and J. A. Carrillo just appeared in Nonlinear Analysis. Join us for the Next Einstein Forum (NEF) Global Gathering 2020 on Dec 8-10, 2020, where I will be moderating a session on “The role of data governance in better managing diseases and outbreaks.” Join us for the “We are AI” event on Dec 3-4, 2020, organized by AIMS, Quantum Leap Africa and IMAGINARY. It’s a great opportunity to learn about AI and its African perspective for education, research, and communication. I accepted the AIMS-Carnegie Research Chair in Data Science at AIMS Rwanda, starting Oct 2020. I joined the board of The One World Seminar Series on the Mathematics of Machine Learning. Looking forward to more exciting talks from around the globe. Our Fundraising Campaign to support virtual math education programs in Africa is now LIVE! We are coordinating efforts across Africa and internationally to create a virtual maths camp experience (http://virtualmathscamp.com), a collection of events and resources accessible across different countries, platforms and delivery mechanisms with the potential to have long lasting impact. We want to turn the challenges presented by the current pandemic into an opportunity, and continue to provide a math camp experience for students, teachers, and facilitators from across the globe – in a new, dynamic, partially virtual and fully international environment. Our paper “Consistency of semi-supervised learning algorithms on graphs: Probit and one-hot methods” has been accepted for publication in the Journal of Machine Learning Research. Updated version of our pre-print “Spectral Analysis Of Weighted Laplacians Arising In Data Clustering” is now up on arXiv. Our CIMPA school “Partial Differential Equations (PDEs) and Calculus of Variations” is now online here! It will take place at the Institut de Mathématiques et de Sciences Physiques (IMSP) in Dangbo, Benin, 30 August – 10 September, 2021. For more information on the school and how to register, check out the website. Our school “Mathematical Methods in Analysis and Probability” (AMS-African Mathematical School), originally scheduled to take place at the African Institute of Mathematical Sciences (AIMS) Ghana 17-28 August 2020, had to be postponed to 2021 due to the SARS-CoV-2 outbreak. New date TBC. I accepted a position as Bonn Junior Fellow at Rheinische Friedrich-Wilhelms-Universität Bonn(Germany) starting in September 2020. I accepted a junior faculty position in the Department of Computing and Mathematical Sciences (CMS) at California Institute of Technology (US), starting in Fall 2022. Together with Marie-Therese Wolfram, I’m co-organizing a minisymposium on “Mean-field models for large interacting agent systems” at the SIAM PD 2019 conference. I’m organizing the workshop “Cross-Pollination in Mathematics Education” at the African Institute of Mathematical Sciences in Biriwa, Ghana, 29 April – 3 May 2019. I’m organizing this year’s Southern California Applied Mathematics Symposium at Caltech, US, 27th April 2019. As part of the special topics course on Optimal Transport that I’m teaching in Winter term 2019, I’m organizing a special seminar series on Optimal Transport. Together with Bamdad Hosseini, I’m co-organizing a minisymposium on “Inverse Problems in Machine Learning” (Part 1 & Part 2) at the SIAM CSE 2019 conference. As part of International Education Week, I’m giving a talk “A mathematical journey through Africa”, sharing experiences and insights from my participation in math and science outreach initiatives in Africa over the past few years. I have been invited as a guest speaker at Caltech’s Women Mentoring Women Program. Caltech Campus, picture taken on my day of arrival at this beautiful place. 7 thoughts on “About” EvelynALSan Bernardino LikeLike Reply ↓ Hello Franca, I am",
  "content_length": 12383,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:49"
}