{
  "name": "Frans Wiering",
  "homepage": "https://www.uu.nl/medewerkers/FWiering",
  "status": "success",
  "content": "Dr. F. (Frans) Wiering - Universiteit Utrecht search English Bewerken search EN Dr. F. (Frans) Wiering Universitair hoofddocent Bètawetenschappen Informatica Interaction Music Information Computing Music Information Computing f.wiering@uu.nl Minnaertgebouw Leuvenlaan 4 Kamer 4.15 3584 CE Utrecht Dr. F. (Frans) Wiering Universitair hoofddocent Music Information Computing f.wiering@uu.nl Profiel Publicaties Activiteiten Onderwijs Contact Profiel Publicaties Activiteiten Onderwijs Contact Onderzoeksthema's Game Research Utrecht Platform for Applied Data Science Frans Wiering received a Ph.D. in Musicology from the University of Amsterdam (Netherlands) for his thesis The Language of the Modes. Studies in the History of Polyphonic Modality (1995). He is Associate Professor at the Interaction Technology division of the Department of Information and Computing Sciences of Utrecht University (Netherlands). He has taught both in the Information Science and Computer Science programmes. His research is at the intersection of computer science and music, connecting computer science methodology to state-of-the-art domain knowledge of music. The three main areas of his research are music information retrieval (projects WITCHCRAFT, C-Minor, COGITCH, MUSIVA), computational musicology (Tunes and Tales, Transforming Musicology) and music technology for games and virtual worlds (COMMIT work package Sensing Emotion in Music). He is the founder of the Thesaurus musicarum italicarum, a corpus of online music treatises by Gioseffo Zarlino and his contemporaries. He was a Visiting Scholar at Stanford University and a Visiting Fellow at Goldsmiths College, University of London. He co-organised the Dagstuhl Seminar Knowledge representation for intelligent music processing (2009), and was General Chair of Eleventh International Society for Music Information Retrieval Conference (ISMIR 2010) and Program Chair of ISMIR 2015. He co-chairs the International Musicological Society’s Study Group on Digital Musicology. For more information see: presentations, reports and various projects Google Scholar profile Footer menu (NL) Direct naar Een studie kiezen Studenteninformatie Onderzoeksgebieden Vacatures Doneren Diensten Studentenportal Alumni-portal Intranet voor medewerkers Cursusplanner My Timetable Over de UU Contact Plattegrond Adresboek Disclaimer",
  "content_length": 2358,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:39"
}