{
  "name": "Frank Z. Wang",
  "homepage": "https://www.cs.kent.ac.uk/people/staff/fzw",
  "status": "success",
  "content": "Frank Wang - School of Computing - University of Kent Jump to content design1 Professor Frank Zhigang Wang Professor in Future Computing Email f.z.wang@kent.ac.uk Telephone +44 (0)1634 20 2988 More information ORCID iD: 0000-0003-4378-2172 Location Room G18 Kennedy Building University of Kent Canterbury Kent CT2 7FS Research website Professor Frank Zhigang Wang On this page About Research interests Teaching Supervision Professional About Five years after earning his PhD in the UK, Frank achieved a promotion to a full professorship at the Cambridge Cranfield High Performance Computing Facility. Six years later, he took the role of Head of the School of Computing at the University of Kent.To date, Frank has successfully secured research grants totaling £5 million from the EC/UK/industries. He has also chaired or co-chaired more than 10 international conferences, such as the ACM Conference on Information and Education Innovations (Manchester), International Conference on Computing Informatics and Networks (Delhi), International Collegiate Competition for Brain-Inspired Computing (Beijing), International Conference on Frontiers and Advances in Analytics and Data Science (Xi’an), International Conference on Next Generation Mobile Apps, Services, and Technologies (Oxford), International Conference on Cloud and Service Computing (Shanghai), IEEE International Conference on Computational Science and Engineering (São Paulo), IEEE Conference on Networking, Architecture, and Storage (Guilin), and IEEE Conference on Scalable Information Systems (Hong Kong).Frank has served as a panel member for the UK government EPSRC \"ICT,\" \"e-Science,\" and \"Hardware for Efficient Computing\" programs. He is a Fellow of the British Computer Society (BCS) and held the position of Region 8 Area 2 Coordinator for the IEEE Computer Society, overseeing more than 10 Western European countries, including the UK, Ireland, France, Germany, Netherlands, Iceland, Denmark, Austria, Luxembourg, Switzerland, Belgium, Spain, and Portugal. He served as the Chairman of the UK and Ireland Chapter, IEEE Computer Society. Research interests Frank belongs to the following research groups:Artificial Intelligence and Data Science GroupCurrent Research InterestsQuantum ComputingArtificial IntelligenceBrain-like Computer New Electronics & Memristor Cloud Computing & Big Data Deep LearningNeuromorphic Computing Post-Quantum CryptographyData ScienceGreen Computing Teaching MSc System ArchitectureMSc Security for NetworkingMSc Project BSc Security for NetworkingBSc e-Commerce BSc ProjectBSc Year-in-Computing Project Supervision PhD Scholarships & ApplicationsThe School of Computing offers PhD Scholarships. If you are interested in applying for a PhD Scholarship with me, please email Frank. Frank can supervise PhD studies in the following fields:Quantum Computing & Post-Quantum Cryptography [My typical papers: Near-Landauer-Bound Quantum Computing (IEEE Transactions on Quantum Engineering), Spin-Encoded Quantum Computer (Springer Nature), Landauer Bound in Quantum Computing (IEEE Access), my seminar: A New Quantum Computer & Post-Quantum Cryptography]Artificial Intelligence (Deep Learning, Neuromorphic Computing & Brain-like Computer) [My typical papers: Adaptive Neuromorphic Architecture (Neural Networks), Memristor Neural Networks (IEEE Transactions), Beyond Memristors (Micromachines), my Keynote at Cambridge: Brain and Brain-Inspired Artificial IntelligenceCloud Computing & Security [My typical papers: Entropy-Based Cloud (IEEE Transactions), ICMetrics for Cloud Computing (Journal of Cloud Computing), Grid-Oriented Storage (IEEE Transactions on Computer)]New Electronics & Memristor [My typical papers: Topological electronics (Springer Nature), Fractional Memristor (Applied Physics Letters), Triangular Table of Circuit Elements (IEEE Transactions)]Data Science (My Keynote at Cambridge: Computing for Big Science)Green Computing (My typical papers: Memory Deduplication) Professional Recent Academic ActivitiesFinalist Award, ACM/IEEE Super Computing, Storage Challenge, Nevada, USA, 2007.Sat on EPSRC e-Science, Hardware for Efficient Computing, ICT PanelsRegular reviewers of EPSRC proposals on quantum computing, AI and neuromorphic computingInvited talks:“Quantum Computing Using Single Spins” at Hik Vision, Hangzhou, China, 21st August 2023“Near-Landauer-Bound Quantum Computing” at Beijing Academy of Quantum Information Sciences, Beijing, China, 18th May 2023IBM Hursley Lab, invited by Dr. Paul Fairbairn, IBM UK Laboratories, 7 December, 2007Oxford University, Computer Lab, invited by Dr. Andrew Simpson, 11 October, 2007Hong Kong University of Science and Technology, Hong Kong, 27 July, 2007National Tsinghua University, Taiwan, 29 July, 2007EADS, Wales, 12 July 2007, hosted by Dr. Paddy Francis, CTOCarnegie Mellon University, hosted by Prof Garth Gibson, Director, Parallel Data Lab, 17 May 2007, Pittsburgh, USACERN, 11 May 2007, Geneva, SwitzerlandXerox, 15 May 2007, Webster, NY, USA, hosted by Dr. Sophie Vandebroek, President of Xerox Technology Innovation CentreBBC, 29 March 2007, hosted by Dr Richard Wright, BBC Future Media & Technology, SurreyRolls Royce, 23 March 2007, hosted by Prof Ric Parker, Director of RR Research & Technology, DerbyPrinceton University, Department of Computer Science, Hosted by Prof. Kai Li, 15 January 2007Cambridge University, Computer Laboratory, 25 January 2007, hosted by Prof Jon CrowcroftSupervision of 15 PhD students (14 completed, including 4 sponsored by foreign governments)Supervision of 7 visiting scholars sponsored by foreign governmentsSupervision of 7 research fellows sponsored by EPSRC/EC/etcThe Best Teacher Award nominated by the Kent Student Union in 2016 & 2022 Last updated 7 March 2025",
  "content_length": 5781,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:37"
}