{
  "name": "Francesca Spezzano",
  "homepage": "https://sites.google.com/view/francescaspezzano",
  "status": "success",
  "content": "Francesca Spezzano's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationFrancesca SpezzanoAssociate ProfessorComputer Science DepartmentCollege of EngineeringBoise State UniversityEmail: francescaspezzano@boisestate.edu[DBLP]     [Google Scholar]    [Twitter]Short bioFrancesca is an Associate Professor at Boise State University in the Computer Science department. She received her Ph.D. in Computer Engineering from the University of Calabria, Italy, in 2012. Before joining Boise State, Dr. Spezzano was a Postdoctoral Research Associate at the University of Maryland Institute for Advanced Computer Studies. While a Ph.D. student, she visited the Database Group at the University of California Santa Cruz. Her research interests deal with social network analysis and mining with applications to misbehavior and misinformation detection and mitigation, information diffusion, and national security. She has been serving as General Chair of WSDM 2026, General Chair of CIKM 2024, General Chair of MISDOOM 2022, PC Co-Chair of ASONAM 2019, FOSINT-SI 2020, and MISDOOM 2021, Workshop co-Chair of WSDM 2024 and ASONAM 2023,  Proceedings Chair of WSDM 2020, and Panel Chair of SDM 2018. Dr. Spezzano is a recipient of the NSF CAREER award (2020) to study misinformation diffusion and mitigation. Her research has been supported by the National Science Foundation, the US Army Research Office, the National Security Agency, and the Idaho State Board of Education. ResearchFrancesca's research interests are in social network analysis and mining with applications to Misbehavior and misinformation detection and mitigationInformation diffusionNational securityLink predictionSigned social networksand querying graph databases.PublicationsTutorials and Invited TalksKumar S., Spezzano F., Subrahmanian V., “Identifying Malicious Actorson Social Media.” Tutorial at  IEEE-ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM 2016), San Francisco, USA, August 18-21, 2016.Spezzano F., “Bad Actors in Social Media.” Keynote Speech at First International Workshop on Computational Methods for CyberSafety (co-located with CIKM 2016), Indianapolis, USA, October 28, 2016.Spezzano F., “Multilingual Page Protection in Wikipedia.” Invited keynote at MIS2: Misinformation and Misbehavior Mining on the Web, workshop co-located with WSDM 2018, Los Angeles, USA, February 9, 2018.Spezzano F., “Protecting Wikipedia from Misinformation: Detecting Malicious Editors and Pages to Protect.” Wikimedia Research Showcase, October 16, 2019.Spezzano F., “Misinformation in Online Social Networks,” Internet Censorship  and  its  Impact  on  Spread  of  Misinformation  Panel  at  the  29th International Conference on Computer Communications and Network (IC-CCN), August 3, 2020.[Students]    [Teaching]   NewsFrancesca receives NSF CAREER award. Read more.Francesca is Program Committee co-Chair for ASONAM 2019.Francesca is Proceedings Chair for WSDM 2020.Francesca is a Co-Chair of the Third Women in Web Data Science (WinDS) Workshop, co-located with TheWebConference 2019, San Francisco, May 13th, 2019.Francesca won the Best Paper Award at the International Symposium on Foundations of Open Source Intelligence and Security Informatics (FOSINT-SI 2018) in conjunction with ASONAM 2018. Joint work with Edoardo Serra and Mikel Joaristi on “Inferring Bad Entities through the Panama Papers Network.” Read more.Francesca is a Co-Organizer of the Panel on “Broadening Participation in Data Science” at SIAM International Conference on Data Mining (SDM) 2018, San Diego, CA, Friday May 4th, 2018.Francesca is a Co-Chair of the Second Women in Data Science (WinDS) Workshop, co-located with TheWebConference 2018, Lyon, France, Tuesday April 24th, 2018.Francesca collaborated with the American Association of Retired Persons (AARP) on Nov. 15, 2017 to host a STEM outreach event. An interactive presentation was delivered to help older adults understand, navigate, and prevent malicious acts on the Internet, especially Social Media. Read more.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4154,
  "method": "requests",
  "crawl_time": "2025-12-01 13:10:51"
}