{
  "name": "Frank Rudzicz",
  "homepage": "https://web.cs.dal.ca/~rudzicz",
  "status": "success",
  "content": "Frank Rudzicz Frank Rudzicz Professor Github Email I am interested in all combinations of machine learning, natural language processing, and healthcare.Some themes of my research include: BooksChaptersJournalsRefereed conferences and workshopsOtherBooksClear speech: Technologies that enable the expression and reception of language.Frank Rudzicz.Morgan & Claypool, 2016.[URL] [BIB] ChaptersMachine learning for medicine.Frank Rudzicz.In: Artificial Intelligence in Surgery: A Primer for Surgical Practice, Dan A Hashimoto, editor., McGraw Hill, New York, NY, ISBN: 978-1260452730, 2021.[URL] [BIB] Ethics of artificial intelligence in surgery.Frank Rudzicz and Raeid Saqur.In: Artificial Intelligence in Surgery: A Primer for Surgical Practice, Dan A Hashimoto, editor., McGraw Hill, New York, NY, ISBN: 978-1260452730, 2021.[URL] [BIB] Explainable AI for the Operating Theater.Frank Rudzicz and Shalmali Joshi.In: Digital Surgery, Sam Attalah, editor., Springer, ISBN: 978-3-030-49100-0, 2020.[URL] [BIB] JournalsMLHOps: machine learning health operations.Faiza Khan Khattak, Vallijah Subasri, Amrit Krishnan, Chloe Pou-Prom, Sedef Akinli-Kocak, Elham Dolatabadi, Deval Pandya, Laleh Seyyed-Kalantari, and Frank Rudzicz.IEEE Access, , 2025.[URL] [BIB] What are patient perspectives on privacy and trust in digital genomic tools? a qualitative study.Vedika Jha, Saumeh Saeedi, Marc Clausen, Daniel Assamad, Sonya Grewal, Daena Hirjikaka, Whiwon Lee, Stephanie Luca, Angela Shaw, Robin Hayeems, Yvonne Bombard, and the Genetics Navigator Study Team.Journal of Genetic Counseling, 34(3):e70025, 2025.[URL] [BIB] Stratification of surgical outcomes in trigeminal neuralgia using multimodal data.Timur H. Latypov, Rose Yakubov, Daniel Jörgens, Pascale Tsai, Patcharaporn Srisaikaew, Peter Shih-Ping Hung, Matthew R. Walker, Marina Tawfik, David Mikulis, Frank Rudzicz, and Mojgan Hodaie.Brain Communications, , 2025.[BIB] Symptom network connectivity indices as predictors of relapse in major depressive disorder.Barbara Pavlova, John-José Nuñez, Lena C Quilty, Jane A Foster, Kate L Harkness, Keith Ho, Raymond Lam, Qingqin S Li, Roumen Milev, Susan Rotzinger, Claudio N Soares, Valerie H Taylor, Gustavo Turecki, Sidney H Kennedy, Benicio N Frey, Frank Rudzicz, and Rudolf Uher.Psychiatry Research, , 2025.[BIB] It’s not the arrow, it’s the archer: the role of the surgeon leader in a safety driven-era.Hillary Lia, Melanie Hammond Mobilio, Frank Rudzicz, and Carol-anne Moulton.Surgical Endoscopy, 38(2):992-998, 2024.[URL] [BIB] Context is not key: detecting Alzheimer’s disease with both classical and transformer-based neural language models.Behrad TaghiBeyglou and Frank Rudzicz.Natural Language Processing Journal, 6:e100046, 2024.[URL] [BIB] Machine learning in the prediction of massive transfusion in trauma: a retrospective analysis as a proof‐of‐concept.Anton Nikouline, Jinyue Feng, Frank Rudzicz, Avery Nathens, and Brodie Nolan.European Journal of Trauma and Emergency Surgery, 50:1073–1081, 2024.[URL] [BIB] Feature extraction for exoplanet detection.Joao Pimentel, Joana Amorim, and Frank Rudzicz.International Journal of Data Science and Analytics, , 2024.[URL] [BIB] Length of stay prediction models for oral cancer surgery: machine learning, statistical and ACS-NSQIP.Amirpouyan Namavarian, Alexander Gabinet-Equihua, Yangqing Deng, Shuja Khalid, Hedyeh Ziai, Konrado Deutsch, Jingyue Huang, Ralph W. Gilbert, David P. Goldstein, Christopher M.K.L. Yao, Jonathan C. Irish, Danny J. Enepekides, Kevin M. Higgins, Frank Rudzicz, Antoine Eskander, Wei Xu, and John R. de Almeida.The Laryngoscope, 134(8):3664-3672, 2024.[URL] [BIB] Depression-anxiety coupling strength as a predictor of relapse in major depressive disorder: a CAN-BIND wellness monitoring study report.Abraham Nunes, Barbara Pavlova, Jasmyn Cunningham, John-Jose Nuñez, Lena C. Quilty, Jane Foster, Keith Ho, Raymond W. Lam, Valerie H. Taylor, Roumen Milev, Susan Rotzinger, Claudio N. Soares, Kate L. Harkness, Gustavo Turecki, Sidney Kennedy, Benicio N. Frey, Frank Rudzicz, and Rudolf Uher.Journal of Affective Disorders, 361:189-197, 2024.[URL] [BIB] The Genetics Navigator: Protocol for a mixed methods randomized controlled trial evaluating a digital platform to deliver genomic services.Guylaine D'Amours, Marc Clausen, Stephanie Luca, Emma Reble, Rita Kodida, Daniel Assamad, François Bernier, Lauren Chad, Gregory Costain, Irfan Dhalla, Hanna Faghfoury, Jan Friedman, Stacey Hewson, Trevor Jamieson, Josh Silver, Cheryl Shuman, Matthew Osmond, June C Carroll, Rebekah Jobling, Anne-Marie Laberge, Melyssa Aronson, Eriskay Liston, Jordan Lerner-Ellis, Christian Marshall, Michael Brudno, Quynh Pham, Frank Rudzicz, Ronald Cohn, Muhammad Mamdani, Maureen Smith, Serena Shastri-Estrada, Emily Seto, Kevin Thorpe, Wendy J. Ungar, Robin Hayeems, and Yvonne Bombard.BMJ Open, 14:e090084, 2024.[URL] [BIB] The utility and implications of ambient scribe in primary care.Puneet Seth, Romina Carretas, and Frank Rudzicz.JMIR AI, 3:e57673, 2024.[URL] [BIB] From the screen to the streets: technology-facilitated violence against public health professionals.Cheryl Regehr, Kaitlyn Regehr, Vivek Goel, Kelly Lyons, and Frank Rudzicz.Journal of Loss and Trauma, :1–26, 2024.[URL] [BIB] Signatures of chronic pain in multiple sclerosis: a machine learning approach to investigate trigeminal neuralgia.Timur H. Latypov, Abigail Wolfensohn, Rose Yakubov, Jerry Li, Patcharaporn Srisaikaew, Daniel Jörgens, Ashley Jones, Errol Colak, David Mikulis, Frank Rudzicz, Jiwon Oh, and Mojgan Hodaie.Pain, , 2024.[URL] [BIB] Deep learning model for automated practitioner assessment during high-fidelity simulation.Asad Siddiqui, Zhoujie Zhao, Chuer Pan, Frank Rudzicz, and Tobias Everett.Academic Medicine, 98(11):1274-1277, 2023.[URL] [BIB] Exploring the use of natural language processing for objective assessment of disorganized speech in schizophrenia.Lydia Jeong, Melissa Lee, Ben Eyre, Aparna Balagopalan, Frank Rudzicz, and Cedric Gabilondo.Psychiatric Research and Clinical Practice, 5(3):84-92, 2023.[URL] [BIB] Contextualizing the tone of the operating room in practice: drawing on the literature to connect the dots.Hillary Lia, Melanie Hammond Mobilio, Frank Rudzicz, and Carol-anne Moulton.Frontiers in Psychology, 14(1167098), 2023.[URL] [BIB] Brain imaging signatures of neuropathic facial pain derived by artificial intelligence.Timur H. Latypov, Matthew C. So, Peter Shih-Ping Hung, Pascale Tsai, Matthew R Walker, Sarasa Tohyama, Marina Tawfik, Frank Rudzicz, and Mojgan Hodaie.Nature Scientific Reports, 13(10699), 2023.[URL] [BIB] Data science as a core competency in undergraduate medical education in the age of ai in healthcare.Puneet Seth, Nancy Hueppchen, Steven D Miller, Frank Rudzicz, Jerry Ding, Kapil Parakh, and Janet D Record.JMIR Medical Education, , 2023.[URL] [BIB] Workplace violence in the covid era: a qualitative analysis of harassment and threats against public health professionals in canada.Cheryl Regehr, Kaitlyn Regehr, Vivek Goel, Christa Sato, Kelly Lyons, and Frank Rudzicz.BMJ Public Health, 1:e000444, 2023.[URL] [BIB] Improving estimates of pertussis burden in Ontario, Canada 2010-2017 by combining validation and capture-recapture methodologies.Shilo H McBurney, Jeffrey C Kwong, Kevin A Brown, Frank Rudzicz, Andrew Wilton, and Natasha S Crowcroft.PLOS ONE, 18(12):e0273205, 2023.[URL] [BIB] Differential expression of a brain aging biomarker across discrete chronic pain disorders.Peter Shih-Ping Hung, Jia Y Zhang, Alborz Noorani, Matthew R Walker, Megan Huang, Jason Zhang, Normand Laperriere, Frank Rudzicz, and Mojgan Hodaie.PAIN, , 2022.[URL] [BIB] A Delphi consensus statement for digital surgery.Kyle Lam, Michael D. Abràmoff, José M. Balibrea, Steven M. Bishop, Richard R. Brady, Rachael A. Callcut, Manish Chand, Justin W. Collins, Markus K. Diener, Matthias Eisenmann, Kelly Fermont, Manoel Galvao Neto, Gregory D. Hager, Robert J. Hinchliffe, Alan Horgan, Pierre Jannin, Alexander Langerman, Kartik Logishetty, Amit Mahadik, Lena Maier-Hein, Esteban Martín Antona, Pietro Mascagni, Ryan K. Mathew, Beat P. Müller-Stich, Thomas Neumuth, Felix Nickel, Adrian Park, Gianluca Pellino, Frank Rudzicz, Sam Shah, Mark Slack, Myles J. Smith, Naeem Soomro, Stefanie Speidel, Danail Stoyanov, Henry S. Tilney, Martin Wagner, Ara Darzi, James M. Kinross, and Sanjay Purkayastha.Nature Digital Medicine, 5(100), 2022.[URL] [BIB] Predicting the target specialty of referral notes to estimate per-specialty wait times with machine learning.Mohamed Abdalla, Hong Lu, Bogdan Pinzaru, Frank Rudzicz, and Liisa Jaakkimainen.PLoS ONE, , 2022.[URL] [BIB] Conformal mirror descent with logarithmic divergences.Amanjit Singh Kainth, Ting-Kam Leonard Wong, and Frank Rudzicz.Information Geometry, , 2022.[URL] [BIB] Modified subspace constrained mean shift algorithm.Youness Aliyari Ghassabeh and Frank Rudzicz.Journal of Classification, 38:27--43, 2021.[URL] [BIB] Deep learning for voice gender identification: proof-of-concept for gender-affirming voice care.Yael Bensoussan, Jeremy Pinto, Matthew Crowson, Patrick R. Walden, Frank Rudzicz, and Michael Johns III.Laryngoscope, 131(5):E1611-E1615, 2021.[URL] [BIB] Using machine learning to predict children's reading comprehension from linguistic features extracted from speech and writing.Jeanne Sinclair, Eunice E Jang, and Frank Rudzicz.Journal of Educational Psychology, 113(6):1088--1106, 2021.[URL] [BIB] Machine learning–based prediction of growth in confirmed COVID-19 infection cases in 114 countries using metrics of nonpharmaceutical interventions and cultural dimensions: model development and validation.Arnold YS Yeung, Francois Roewer-Despres, Laura Rosella, and Frank Rudzicz.JMIR, 23(4):e26628, 2021.[URL] [CODE] [BIB] Comparing pre-trained and feature-based models for prediction of Alzheimer's disease based on speech.Aparna Balagopalan, Benjamin Eyre, Jessica Robin, Frank Rudzicz, and Jekaterina Novikova.Frontiers in ",
  "content_length": 136713,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:32"
}