{
  "name": "Frank-Michael Schleif",
  "homepage": "https://fiw.thws.de/fakultaet/personen/dozentinnen-und-dozenten/person/prof-dr-frank-michael-schleif",
  "status": "success",
  "content": "Dozentinnen und Dozenten :: Technische Hochschule Würzburg-Schweinfurt Zum Inhalt wechseln Zum Hauptmenü wechseln Zum Navigationspfad wechseln Zur Suche wechseln Zur Sprachauswahl wechseln Zur Servicenavigation wechseln Dozentinnen und Dozenten Prof. Dr. Frank-Michael Schleif Fakultät Informatik und Wirtschaftsinformatik Telefon +49 931 3511-8127 E-Mail frank-michael.schleif[at]thws.de Besucheranschrift Sanderheinrichsleitenweg 20 97074 Würzburg Raum I.3.35 Sprechstunden Dienstag (im Semester) 13:30–14:30 Uhr (nur per Voranmeldung) Aufgabenbereich(e) Forschung und Lehre im Kontext Computational–Intelligence, Maschinelles Lernen und Künstliche Intelligenz, Datenmanagement, Interims Leiter CAIRO, Aufbau KI Studiengang (Master of Artificial Intelligence) Projekte Weiterbildungsangebote für die Industrie VHB Kurs Intelligente DatenanalyseVHB Kurs Künstliche IntelligenzKI Hub Nordbayern Aktuelle Industrieprojekte Optimierung von Prozessen und Werkzeugmaschinen durch Bereitstellung, Analyse und Soll-Ist-Vergleich von Produktionsdaten (OBerA)Projektziele:(1) transparente Produktionsabläufe durch Digitalisierung der Prozesschritte in Echtzeit(2) kontinuierliche Verbesserung einer frühzeitigen Reaktionsfähigkeit auf Abweichungen im Planprozess bzw. produktionsrelevante Abläufe durch zielgerichtete MaßnahmenPartner:- Siemens AG- Pabst Komponentenfertigung GmbH- Kritzner Metalltechnik GmbH- Heisab GmbH- Peter Brehm GmbH- Franken GmbH & CoKG- Heitec AGDetails auf Nachfrage bei Prof. Jürgen Hartmann Publikationen Publikationen Publikationslisten:Publikationen bei DBLPGoogle Scholar Vita CV Siehe pdf Dokument(e) cv_fms.pdf Weitere Informationen Mitgliedschaften Vorstandsmitglied Deutsche Gesellschaft für Neuronale Netze (GNNS e.V)Subcommittee Chair - Reisestipendien - IEEE CISMitglied bei der Gesellschaft für Informatik (GI)Gründungsmitglied Institut für Computational Intelligence und intelligente Datenanalyse e. V. (CIDD) Weiterführende Links Infopage",
  "content_length": 1972,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:38"
}