{
  "name": "Francisco Ferreira 0001",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/francisco-ferreira-ruiz",
  "status": "success",
  "content": "Francisco Ferreira Ruiz - Royal Holloway Research Portal Francisco Ferreira Ruiz Dr Lecturer in Computer Science, Department of Computer ScienceCentre for Programming Languages and Systems Phone+44 1784 414686EmailFrancisco.FerreiraRuizrhul.acuk TW20 0EX Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 3 Paper 1 Book/Film/Article review Research output per year Research output per year The Concurrent Calculi Formalisation BenchmarkCarbone, M., Castro-Perez, D., Ferreira, F., Gheri, L., Krogsdal Jacobsen, F., Momigliano, A., Padovani, L., Scalas, A., Tirore, D., Vassor, M., Yoshida, N. & Zackon , D., 11 Jun 2024, p. 149-158.Research output: Contribution to conference › Paper › peer-review Open AccessFile 4 Downloads (Pure) Oven: Safe and Live Communication Protocols in Scala, using Synthetic Behavioural Type AnalysisFerreira, F. & Jongmans, S.-S., 13 Jul 2023, p. 1511-1514.Research output: Contribution to conference › Paper › peer-review Open AccessFile 16 Downloads (Pure) Synthetic Behavioural Typing: Sound, Regular Multiparty Sessions via Implicit Local TypesJongmans, S.-S. & Ferreira, F., 11 Jul 2023, p. 42:1-42:30.Research output: Contribution to conference › Paper › peer-review Open Access CONCUR test-of-time award for the period 1994–97 interview with Uwe Nestmann and Benjamin C. Pierce.Barwell, A. D., Ferreira, F. & Yoshida, N., Feb 2022, In: Journal of Logical and Algebraic Methods in Programming. 125, 8 p., 100744.Research output: Contribution to journal › Book/Film/Article review",
  "content_length": 1844,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:09"
}