{
  "name": "Fred Henrik Hamker",
  "homepage": "https://www.tu-chemnitz.de/informatik/KI/fhamker.php",
  "status": "success",
  "content": "Inhaber | Professur | Professur Künstliche Intelligenz | Fak. für Informatik | TU Chemnitz Inhaber | Professur | Professur Künstliche Intelligenz | Fak. für Informatik | TU Chemnitz Inhaber der Professur Prof. Dr. Fred Hamker Prof. Dr. Fred Hamker Tel.: +49 371 531-37875 email: fred.hamker@informatik.tu-chemnitz.de Fred Hamker diplomierte 1994 in Elekrotechnik an der Universität-GH Paderborn und promovierte 1999 an der Fakultät für Informatik der TU Ilmenau. Er arbeitete an der JW Goethe-Universität Frankfurt am Main und dem California Institute of Technology (Pasadena, USA). Im Jahre 2003 gründete er eine Forschungsgruppe an der Universität Münster im Fachbereich Psychologie. Seit 2009 hat er die Professur für Künstliche Intelligenz an der TU Chemnitz inne. Seit 2010 ist er assoziiert mit dem Bernstein Zentrum für Computational Neuroscience Berlin. Seine Forschungsgruppe verfolgt einen experimentellen und modellgetriebenen Ansatz zur Erforschung der Funktionsweise des Gehirns, mit dem Ziel neuartige, intelligente, kognitive Systeme zu entwickeln. Es werden Modelle entwickelt, die psychologische und neurowissenschaftliche Daten interpretieren helfen, womit ein direkter Beitrag zum Verständnis des Gehirns geleistet wird. Ebenso wird am Transfer neurowissenschaftlicher Erkenntnisse in technische Anwendungen gearbeitet. Mit der Akkumulation des Wissens in der Hirnforschung entstehen zeitgleich bessere intelligente Systeme, die nach biologischem Vorbild arbeiten. Fred Hamker auf Researchgate TUCaktuell Welche Schaltkreise im Gehirn bestimmen unser Alltagsverhalten? Vom dualen System zum Netzwerk: Forschungsteam aus Chemnitz, Santiago de Chile und Magdeburg hat eine neue Sicht auf die Handlungssteuerung im Gehirn und ihren Nutzen für die Entwicklung neuroinspirierter KI … Gehirn-Schluckauf besser verstehen Projektstart für deutsch-israelisch-amerikanisches Kooperationsprojekt zur Erforschung von Tourette- Ursachen … Mit SmartStart 2 auf dem Weg zur Promotion Oliver Maith, der in Chemnitz Sensorik und kognitive Psychologie studierte, war in einem wettbewerblichen Verfahren zur Promotionsförderung erfolgreich und forscht nun im Bereich der Computational Neuroscience … Spannende Vorweihnachtszeit mit Chemie, Mathe, Physik und Informatik Mit allen Sinnen genießen: TU Chemnitz lädt am 3., 17., 18. und 19. Dezember 2025 zu insgesamt fünf Weihnachtsvorlesungen ein … Mehr Artikel anzeigen Alle Artikel anzeigen Veranstaltungen & Tipps Naturwissenschaften 01.12.2025 01 Dez Von Unordnung zur Topologie: Innovationen im Verständnis komplexer Spinsysteme Dieser Workshop wird im Rahmen des SPARC-GIANT-Projekts Effekte starker … TU Chemnitz 03.12.2025 03 Dez TUCweihnachtsmarkt Stimmen Sie sich mit uns bei einem weihnachtlichen Programm für Groß und Klein auf die Advents- und … TU Chemnitz 10.12.2025 10 Dez Kinderweihnachtsfeier Am 10.12.2025 erwartet alle Kids der Technischen Universität Chemnitz und des Studentenwerks … Naturwissenschaften 10.12.2025 10 Dez TUC erklärt Nobelpreise Im Rahmen dieser Veranstaltung werden die diesjährigen Nobelpreise in Physik und Chemie für die … Mathematik 17.12.2025 17 Dez Weihnachtsvorlesung Mathematik \"Weihnachtliche Strömungen : wenn Mathematik ins … Wie lassen sich beispielsweise winterliche Luftströmungen in der … Naturwissenschaften 18.12.2025 18 Dez Weihnachtsvorlesung der Physik: \"Alles fließt - ????? ??? -\" Weihnachtsvorlesung, in der physikalische Sachverhalte mit Hilfe vieler … Veranstaltungskalender Veranstaltungskalender Mehr Artikel anzeigen Alle Artikel anzeigen Soziale Medien ð Die TU Chemnitz ehrte am 27. November herausragende Leistungen ihrer Mitglieder: 28 Preise in den Kategorien Studium, Lehre, Forschung, Transfer und Engagement, die jeweils mit… ð¡ Beim 12. Tag des wissenschaftlichen Nachwuchses an der #TUChemnitz kamen zahlreiche Nachwuchsforschende, Promovierende, Promovierte und Interessierte zusammen, um spannende… âï¸ Erfolgreich auf ganzer Linie: Das Team der Fakultät für Mathematik der #TUChemnitz hat beim Firmenschachturnier 2025 erneut den ð¥ 1. Platz belegt! Beim von der axilaris GmbH… ð¯ï¸ Die TU Chemnitz setzt am 9. November 2025 einen „Lichtpunkt“ gegen das Vergessen und beteiligt sich an der stadtweiten Gedenkaktion an die Opfer der Reichspogromnacht. Im… Verbinde dich mit uns: Vorschaltseite",
  "content_length": 4337,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:52"
}