{
  "name": "Frederic F. Leymarie",
  "homepage": "https://www.gold.ac.uk/computing/staff/f-folleymarie",
  "status": "success",
  "content": "Prof Frederic Fol Leymarie | Goldsmiths, University of London Main menu Staff & students In this section Frederic works on creativity and AI systems, including robots which can perform artistic skills similar to humans. Staff details Position Professor Department Computing Email ffl (@gold.ac.uk) Website http://www.folleymarie.com Frederic works on creativity and AI systems, including robots which can perform with artistic skills similar to expert humans. He also conducts work with specialists in the biosciences, helping to develop interactive computer environments (occasionally in the form of serious games) to facilitate the study of complex biomolecular problems (folding, docking). Frederic has a long term interest in shape understanding where he combines knowledge from perception, vision science, AI, the visual arts. Frederic joined Goldsmiths in 2004, when he launched an MSc in Arts Computing. Outside academia, Frederic leads the consulting activity London Geometry in partnership with Prof. William Latham. Academic qualifications Ph.D. (Brown University, 2003). Teaching Frederic is programme leader with William Latham of the MSc Computer Games & Entertainment. In the past few years, his focus has been on teaching maths and graphics to our MSc Computer Games & Entertainment students. The programme lasts two terms (Autumn+Winter/Spring). The evaluation is essentially based on individual and team projects. Typical topics covered include linear algebra, complex numbers and quaternions, interpolation in curves and surfaces, meshes and light rendering. Each year brings some new topics. In the past two years Frederic has developed lectures on the use of machine learning in computer games. I also teach (together with Andy Thomason) the 'Physics and Animation in Games' module (1 term). He also mentors Year 2 BSc Computer Science team projects and occasionally final year individual projects. Publications and research outputs Edited BookThe Machine as Art/ The Machine as Artist Leymarie, Frederic Fol ORCID logo ; Bessette, Juliette; and Smith, G.W., eds. 2020. The Machine as Art/ The Machine as Artist. Basel, Switzerland: MDPI. ISBN 9783039360642 Book SectionKinematics Reconstruction of Static Calligraphic Traces from Curvilinear Shape Features Berio, Daniel ; Leymarie, Frederic Fol ORCID logo ; and Plamondon, Rejean. 2020. Kinematics Reconstruction of Static Calligraphic Traces from Curvilinear Shape Features. In: Rejean Plamondon; Angelo Marcelli and Miguel Ángel Ferrer, eds. The Lognormality Principle and its Applications in e-Security, e-Learning and e-Health. 88 World Scientific, pp. 237-268. ISBN 9789811226823 Interactive Generation of Calligraphic Trajectories from Gaussian Mixtures Berio, Daniel ; Leymarie, Frederic Fol ORCID logo ; and Calinon, Sylvain. 2019. Interactive Generation of Calligraphic Trajectories from Gaussian Mixtures. In: Nizar Bouguila and Wentao Fan, eds. Mixture Models and Applications. Cham, Switzerland: Springer Nature Switzerland AG, pp. 23-38. ISBN 9783030238759 Swarm-Based Identification of Animation Key Points from 2D-medialness Maps Aparajeya, Prashant ; Leymarie, Frederic Fol ; and al-Rifaie, Mohammad Majid . 2019. Swarm-Based Identification of Animation Key Points from 2D-medialness Maps. In: Anikó Ekárt; Antonios Liapis and María Luz Castro Pena, eds. Computational Intelligence in Music, Sound, Art and Design. 11453 Cham, Switzerland: Springer, pp. 69-83. ISBN 9783030166663 Show more information Computational Ecosystems in Evolutionary Art, and Their Potential for the Future of Virtual Worlds Antunes, Rui Filipe ; Leymarie, Frederic Fol ; and Latham, William . 2016. Computational Ecosystems in Evolutionary Art, and Their Potential for the Future of Virtual Worlds. In: UNSPECIFIED, ed. Handbook on 3D3C Platforms. Springer, pp. 441-473. ISBN 978-3-319-22040-6 Point-based medialness for movement computing Leymarie, Frederic Fol ; Aparajeya, Prashant ; and MacGillivray, Carol . 2014. Point-based medialness for movement computing. In: UNSPECIFIED, ed. MOCO '14 Proceedings of the 2014 International Workshop on Movement and Computing. Paris: Association for Computing Machinery, pp. 31-36. ISBN 978-1-4503-2814-2 Real-Time Behavioral Animation of Humanoid Non-Player Characters with a Computational Ecosystem Leymarie, Frederic Fol ; and Antunes, Rui Filipe. 2013. Real-Time Behavioral Animation of Humanoid Non-Player Characters with a Computational Ecosystem. In: Ruth Aylett; Brigitte Krenn; Catherine Pelachaud and Hiroshi Shimodaira, eds. Intelligent Virtual Agents : 13th International Conference, IVA 2013, Edinburgh, UK, August 29-31, 2013. Proceedings. 8108 Berlin: Springer, pp. 382-395. ISBN 9783642404146 Sketches by Paul the Robot Tresset, Patrick; and Leymarie, Frederic Fol . 2012. Sketches by Paul the Robot. In: D Cunningham and D H House, eds. Computational Aesthetics in Graphics, Visualization, and Imaging. Annecy, France: ACM/Eurographics, pp. 17-24. ISBN 978-1-4503-1584-5 Developing a system of screen-less animation for experiments in perception of movement Leymarie, Frederic Fol ; MacGillivray, C.; and Mathez, B.. 2012. Developing a system of screen-less animation for experiments in perception of movement. In: Douglas Cunningham and Donald House, eds. Proceedings of the Eighth Annual Symposium on Computational Aesthetics in Graphics, Visualization, and Imaging. Aire-la-Ville, Switzerland: Eurographics Association, pp. 71-80. ISBN 9781450315845 FoldSynth: A Physics-based Interactive Visualisation Platform for Proteins and other Molecular Strands Leymarie, Frederic Fol ; Todd, Stephen; Todd, P; Latham, William ; Jefferys, Benjamin; and Kelley, Lawrence. 2011. FoldSynth: A Physics-based Interactive Visualisation Platform for Proteins and other Molecular Strands. In: UNSPECIFIED, ed. Proceedings of BioVis 2011. Providence, RI, USA: Generative Narrative in Computational Ecosystems Leymarie, Frederic Fol ; and Antunes, Rui Filipe. 2011. Generative Narrative in Computational Ecosystems. In: UNSPECIFIED, ed. Proceedings of ISEA 2011. Istanbul: Skediomata: Guinea Pig and Performer Leymarie, Frederic Fol ; Tresset, Patrick; and Khaorapapong, Nanda. 2011. Skediomata: Guinea Pig and Performer. In: UNSPECIFIED, ed. Proceedings of ISEA 2011. Istanbul: On the Visual Perception of Shape --- Analysis and Genesis through Information Models Leymarie, Frederic Fol . 2011. On the Visual Perception of Shape --- Analysis and Genesis through Information Models. In: UNSPECIFIED, ed. Proceedings of the SHAPES 1.0 workshop. Karlshrue, Germany: Virtual Worlds as Art Practice: EvoArt Methodologies Antunes, Rui Filipe; and Leymarie, Frederic Fol . 2010. Virtual Worlds as Art Practice: EvoArt Methodologies. In: Alan Seal, ed. Electronic Visualization and the Arts. London: BCS, pp. 271-277. Epigenetics as aesthetic instrument in a generative virtual ecosystem Antunes, Rui Filipe; and Leymarie, Frederic Fol . 2010. Epigenetics as aesthetic instrument in a generative virtual ecosystem. In: Leonel Valbom, ed. Proceedings of the 5th International Conference on Digital Art. Portugal: Guimares, pp. 172-176. xTNZ - a three-dimensional ecosystem Antunes, Rui Filipe; and Leymarie, Frederic Fol . 2008. xTNZ - a three-dimensional ecosystem. In: Alvaro Barbosa, ed. Proceedings of the 4th International Conference on Digital Art (ARTECH). Poro, Portugal: , pp. 201-204 From the Infinitely Large to the Infinitely Small Leymarie, Frederic Fol ; and Kimia, Benjamin B.. 2008. From the Infinitely Large to the Infinitely Small. In: UNSPECIFIED, ed. Medial Representations. 37 Netherlands: Springer Netherlands, pp. 327-351. ISBN 978-1-4020-8657-1 Apollonius diagrams and the Representation of Sounds and Music McLean, Alex; Leymarie, Frederic Fol ; and Wiggins, Geraint . 2007. Apollonius diagrams and the Representation of Sounds and Music. In: UNSPECIFIED, ed. 4th International Symposium on Voronoi Diagrams in Science and Engineering (ISVD). Wales: IEEE, pp. 276-281. Thoughts on Shape Leymarie, Frederic Fol . 2006. Thoughts on Shape. In: L Albertazzi, ed. Visual Thought: The Depictive Space of the Mind. 67 Amsterdam: John Benjamins, pp. 303-350. Aesthetic Computing and Shape Leymarie, Frederic Fol . 2006. Aesthetic Computing and Shape. In: Paul Fishwick, ed. Aesthetic Computing. MIT Press, pp. 259-288. ISBN 978-0262562379 Generative Portrait Sketching Tresset, Patrick; and Leymarie, Frederic Fol . 2005. Generative Portrait Sketching. In: H Thwaites, ed. Proceedings of the 11th International Conference on Virtual Systems and Multimedia (VSMM). Ghent, Belgium: , pp. 739-748 Computational Schemes for Biomimetic Sculpture Hatcher, B.; Aspelund, K.; Leymarie, Frederic Fol ; Willis, A.; Speicher, J.; and Cooper, D. B.. 2005. Computational Schemes for Biomimetic Sculpture. In: UNSPECIFIED, ed. 5th Int. Conf. on Creativity & Cognition. London: ACM SIGCHI Conference, pp. 22-31. Computation of the Shock Scaffold for Unorganized Point Clouds in 3D Leymarie, Frederic Fol ; and Kimia, Benjamin B.. 2003. Computation of the Shock Scaffold for Unorganized Point Clouds in 3D. In: UNSPECIFIED, ed. IEEE Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR'03). 1 Madison, Wisconsin, USA: , pp. 821-827 Assembling Virtual Pots from 3D Measurements of their Fragments Cooper, D. B.; and Leymarie, Frederic Fol . 2001. Assembling Virtual Pots from 3D Measurements of their Fragments. In: UNSPECIFIED, ed. Proc. of VAST 2001: Virtual Reality, Archeology, and Cultural Heritage. North Athens, Greece: ACM Siggraph publ., pp. 241-253. The SHAPE Lab. - New Technology and Software for Archaeologists Leymarie, Frederic Fol . 2001. The SHAPE Lab. - New Technology and Software for Archaeologists. In: Zoran Stancic and Tatjana Veljanovski, eds. Computing Archaeology for Understanding the Past: CAA 2000 - Computer Applications and Quantitative Methods in Archaeology - Archaeology Proceedings ... Archaeological Reports (BAR) International). Oxford:",
  "content_length": 33724,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:58"
}