{
  "name": "Frederic T. Chong",
  "homepage": "http://people.cs.uchicago.edu/~ftchong",
  "status": "success",
  "content": "\\ Fred Chong Fred Chong Home Papers Personal CV Quantum computing sits poised at the verge of a revolution. Quantum machines may soon be capable of performing calculations in chemistry, physics, and other fields that are extremely difficult or even impossible for today’s computers. The multi-institutional Enabling Practical-scale Quantum Computing (EPiQC) Expedition will help bring the great potential of this new paradigm into reality by reducing the current gap between existing theoretical algorithms and practical quantum computing architectures. Over five years, the EPiQC Expedition will collectively develop new algorithms, software, and machine designs tailored to key properties of quantum device technologies with 100 to 1000 quantum bits. This work will facilitate profound new scientific discoveries and also broadly impact the state of high-performance computing. Recent Talks Physics-Aware, Full-Stack Quantum Software Optimizations IBM Research Distinguished Seminar, virtual (global), 2024 Distinguished Seminar, Pittsburgh Quantum Institute, Pittsburgh, PA, 2023 Invited Talk (video), SC, Denver, CO, 2023 Closing the Gap between Quantum Algorithms and Machines with Hardware-Software Co-Design Keynote, 33rd GLSVLSI symposium, Knoxville, TN, 2023 Distinguished Lecture, Tulane University, New Orleans, LA, 2023 Keynote, IEEE Conference Quantum Computing and Engineering (QCE), Broomfield, CO, 2022 Resource-Efficient Quantum Computing by Breaking Abstractions Keynote, 31st International Conference on Parallel Architectures and Compilation Techniques (PACT), Chicago, IL, 2022 Bio Fred Chong is the Seymour Goodman Professor in the Department of Computer Science at the University of Chicago and the Chief Scientist for Quantum Software at Infleqtion. He is also Lead Principal Investigator for the EPiQC Project (Enabling Practical-scale Quantum Computing), an NSF Expedition in Computing. Chong is a member of the National Quantum Advisory Committee (NQIAC) which provides advice to the President on the National Quantum Initiative Program. In 2020, he co-founded Super.tech, a quantum software company, which was acquired by Infleqtion (formerly ColdQuanta) in 2022. Chong received his Ph.D. from MIT in 1996 and was a faculty member and Chancellor's fellow at UC Davis from 1997-2005. He was also a Professor of Computer Science, Director of Computer Engineering, and Director of the Greenscale Center for Energy-Efficient Computing at UCSB from 2005-2015. He is a fellow of the ACM and the IEEE, a recipient of the NSF CAREER award, the Intel Outstanding Researcher Award, and 16 best paper awards. He is also a recipient of the Quantrell Award, the oldest undergraduate teaching award in the United States, as well as the University of Chicago's Graduate Teaching and Mentoring Award. His research interests include emerging technologies for computing, quantum computing, multicore and embedded architectures, computer security, and sustainable computing. Seymour Goodman Professor Dept. of Computer Science The University of Chicago Lead Principal Investigator EPiQC, an NSF Expedition in Computing Chief Scientist for Quantum Software Infleqtion Contact Info Dept of Computer Science John Crerar Library, Room 323 University of Chicago 5730 S. Ellis Ave. Chicago, IL 60637 Phone: 507.246.6490 fax: (773) 702-8487 efax: (801) 327-1868 (efax preferred, but not secure) chong@cs.uchicago.edu Our book.",
  "content_length": 3430,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:57"
}