{
  "name": "Fredrik Dahlqvist",
  "homepage": "https://www.seresearch.qmul.ac.uk/cfcs/people/fdahlqvist",
  "status": "success",
  "content": "Dr Fredrik Dahlqvist: Centre for Fundamentals of AI and Computational Theory Skip to main content FIND AN EXPERT Faculty of Science and Engineering - Research Centre for Fundamentals of AI and Computational Theory School of Electronic Engineering and Computer Science Centre for Fundamentals of AI and Computational Theory  |  People  |  Dr Fredrik Dahlqvist  | People menu Centre for Fundamentals of AI and Computational Theory  |  People  |  Dr Fredrik Dahlqvist  | Dr Fredrik DahlqvistLecturer in Computer ScienceSchool of Electronic Engineering and Computer ScienceQueen Mary University of Londonf.dahlqvist@qmul.ac.ukwww.qmul.ac.uk/eecs/people/profiles/dahlqvistfredrik.htmlCentre for Fundamentals of AI and Computational Theory Research Publications Grants Research Group News ResearchTheoretical computer science, probabilistic programming, probability theory, category theory, logic PublicationsPublications of specific relevance to the Centre for Fundamentals of AI and Computational Theory2024Automated Roundoff Error Analysis of Probabilistic Floating-Point ComputationsConstantinides G Dahlqvist F Rakamarić Z Salvia R Acm Transactions on Probabilistic Machine Learning, Association For Computing Machinery (Acm) DOI 10.1145/3705898 QMRO28-11-2024What Makes a Good Prune? Maximal Unstructured Pruning for Maximal Cosine SimilarityMason-Williams G Dahlqvist F The Twelfth International Conference on Learning Representations. QMRO13-05-20242023The syntactic side of autonomous categories enriched over generalised metric spacesDahlqvist F Neves R Logical Methods in Computer Science, Centre Pour La Communication Scientifique Directe (Ccsd) vol. Volume 19, Issue 4 DOI 10.46298/lmcs-19(4:31)2023 QMRO18-12-2023A Complete V-Equational System for Graded lambda-CalculusDahlqvist F Neves R Electronic Notes in Theoretical Informatics and Computer Science, Centre Pour La Communication Scientifique Directe (Ccsd) vol. Volume 3 - Proceedings of MFPS XXXIX DOI 10.46298/entics.12299 QMRO23-11-2023Deterministic stream-sampling for probabilistic programming: semantics and verificationDahlqvist F Silva A Smith W 2023 38th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS). vol. 00, 1-13. DOI 10.1109/lics56636.2023.10175773 QMRO29-06-2023 GrantsGrants of specific relevance to the Centre for Fundamentals of AI and Computational TheoryProbabilistic Precision TuningFredrik Dahlqvist£49,636 Research Institute in Verified Trustworthy Software Systems01-10-2025 - 31-03-2026Learning from Each Other: Neural Networks and Finite AutomataFredrik Dahlqvist£15,000 Academy of Medical Sciences14-03-2025 - 13-03-2026 Research Group PhD StudentsGregor MeehanRepresentation Learning For Musical Audio Using Graph Neural Network-Based Recommender Engines.Niki OmidvariTheory News No news items found.",
  "content_length": 2807,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:00"
}