{
  "name": "Frederick Chang",
  "homepage": "https://www.smu.edu/News/2013/fred-chang-announcement-04sept2013/fred-chang-biography",
  "status": "success",
  "content": "Frederick R. Chang Skip to main content Frederick R. Chang Frederick R. Chang is the Director of the Darwin Deason Institute for Cyber Security, the Bobby B. Lyle Endowed Centennial Distinguished Chair in Cyber Security, and Professor in the Department of Computer Science and Engineering in the Lyle School of Engineering at Southern Methodist University (SMU). He is also a Senior Fellow in the John Goodwin Tower Center for Political Studies in SMU’s Dedman College and a Distinguished Scholar in the Robert S. Strauss Center for International Security and Law at the University of Texas at Austin. Chang has been Professor and AT&T Distinguished Chair in Infrastructure Assurance and Security at the University of Texas at San Antonio and he was at the University of Texas at Austin as an Associate Dean in the College of Natural Sciences and Director of the Center for Information Assurance and Security. Additionally, Chang’s career spans service in the private sector and in government, including as the former Director of Research at the National Security Agency. Chang has been awarded the National Security Agency Director’s Distinguished Service Medal and was the 2014 Information Security Magazine ‘Security 7’ award winner for Education. He has served as a member of the Commission on Cyber Security for the 44th Presidency and as a member of the Computer Science and Telecommunications Board of the National Academies. He has also served as a member of the National Academies committee on Responding to Section 5(d) of Presidential Policy Directive 28: The Feasibility of Software to Provide Alternatives to Bulk Signals Intelligence Collection, and as a steering committee member of the National Academies of Sciences, Engineering, and Medicine Workshop on Privacy for the Intelligence Community: Emerging Technologies, Academic and Industry Research, and Best Practices. He is currently a member of the Intelligence Science and Technology Experts Group of the National Academies of Sciences, Engineering, and Medicine. He is the lead inventor on two U.S. patents (U.S. patent numbers 7272645 and 7633951) and he appeared in the televised National Geographic documentary, Inside the NSA: America's Cyber Secrets. He has twice served as a cyber security expert witness at hearings convened by the U.S. House of Representatives Committee on Science, Space and Technology. Chang received his B.A. degree from the University of California, San Diego and his M.A. and Ph.D. degrees from the University of Oregon. He has also completed the Program for Senior Executives at the Sloan School of Management at the Massachusetts Institute of Technology. Updated: November 2015 Search the SMU website Menu Close Search Search Submit Popular Searches Current Students Majors and Minors Undergraduate Admission | SMU Graduate Admission Faculty & Staff Graduate Programs Alumni Did you know? SMU's singular approach to integrating rigorous learning with hands-on experience will prepare you to achieve your educational goals and expand your world in ways you never imagined. Ours is a community of people forging their own paths. We'd like to help you shape yours. Plan your visit",
  "content_length": 3181,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:59"
}