{
  "name": "Frederick Eberhardt",
  "homepage": "http://www.its.caltech.edu/~fehardt",
  "status": "success",
  "content": "Frederick Eberhardt Frederick Eberhardt mailing address: Frederick Eberhardt MC 101-40 Caltech 1200 E California Blvd. Pasadena, CA 91125 USA email: fde@caltech.edu phone: (+1) 626 395 4163 office: Dabney 301C (map) dresscode: business causal publications | code | video I am Professor of Philosophy in the Division of the Humanities and Social Sciences with a courtesy appointment in the Department of Computing and Mathematical Sciences at Caltech. I also co-direct Caltech's Linde Center for Science, Society, and Policy (LCSSP). research My research interests lie at the intersection of philosophy of science, machine learning and statistics. My work has focused primarily on methods for causal discovery from statistical data, causal representation learning, and the philosophical issues at the foundations of causality and probability. In many cases this work has involved close collaboration with domain experts in e.g. neuroscience, economics, and astrophysics. I have done some work on computational models in cognitive science and some historical work on the philosophy of Hans Reichenbach. More recently, through the co-directorship of the LCSSP, I have been developing science-for-policy programs in biotechnology, AI ethics and climate & sustainability. teaching At Caltech I teach standard introductory courses in philosophy, ethics & AI, and advanced courses in philosophy of science, causality, probability and theories of consciousness (together with Ralph Adolphs in neuroscience). I am currently also the option representative for philosophy. education Ph.D. in Logic, Computation and Methodology, Department of Philosophy, Carnegie Mellon University, 2007. M.S. in Knowledge Discovery and Data Mining, Center for Automated Learning and Discovery (now Machine Learning Department), School of Computer Science, Carnegie Mellon University, 2005. B.Sc. in Philosophy & Mathematics, London School of Economics, 2002. Banner: Samarkand, Uzbekistan",
  "content_length": 1961,
  "method": "requests",
  "crawl_time": "2025-12-01 13:11:57"
}