{
  "name": "Fritz Henglein",
  "homepage": "http://www.diku.dk/~henglein",
  "status": "success",
  "content": "Fritz Henglein Fritz Henglein Department of Computer Science (DIKU) University of Copenhagen Universitetsparken 5 DK-2100 Copenhagen Denmark Office: Building 1, room 01-009 Email: henglein@diku.dk Telephone: +45-30589576 (cell) Skype: henglein Research Teaching Professional Personal Fritz Henglein WARNING: This page is totally out of date. I have only recently regained control of it, after I had lost track (and, in due course, control) of it in the aftermath of various IT recorganizations at UCPH. I am planning on creating a new homepage, which I will link to from here. My contact information is correct. (FH, 2017-09-26) Professor Head of Algorithms and Programming Languages (TOPPS) researcher group Director of HIPERFIT research center Research Interests Algorithmic, semantic and logical aspects of programming languages Type systems, type inference and type-based program analysis Algorithmic functional programming Application of programming language technology Publications Papers Books and proceedings (edited) Select software Is my research popular? Check for yourself. Use Google Scholar (covers just about all of recent computer science) or CiteSeer (covers quite a bit). Please do not rely on Thomson Reuters ISI since it covers only a tiny fraction of computer science publications, omitting almost all of the most high-profile computer science conferences. (Note that computer science conferences are peer-reviewed). Projects Kleene Meets Church: Regular Expressions and Types (KMC), 2012-2015 Functional High-Performance Computing for Financial Information Technology (HIPERFIT), 2011-2016 Previous projects Applications and Principles of Programming Languages (APPL) 3d generation Enterprise Resource Planning Systems (3gERP) Trustworthy Pervasive Healthcare Services (TrustCare) Teaching Upcoming courses None (on sabbatical in 2012/13). Previous courses Topics in Programming Languages: Theory and practice of regular expressions (graduate course), 4th quarter of 2009/10 Logic in computer science (elective undergraduate course, may also be taken by graduate students) Introduction to (functional) programming (undergraduate course, in Danish) No internships DIKU provides individually advised projects only to students enrolled as full-degree, exchange or guest students at the University of Copenhagen. Please see the International Office for more information. Internship requests sent to me personally will go unanswered. Professional Conferences and workshops DBPL 2011 STOP 2011 TLDI 2011 ICFP 2010 Haskell 2010 Outreach My LinkedIn profile Personal Short biography Curriculum vitae Fritz Henglein (henglein@diku.dk )",
  "content_length": 2648,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:30"
}