{
  "name": "Frédéric Cuppens",
  "homepage": "https://www.polymtl.ca/expertises/cuppens-frederic",
  "status": "success",
  "content": "Cuppens, Frédéric | Répertoire des expertises Aller au contenu principal Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission Visitez-nous! Faire un don © Polytechnique Montréal 2025. Poly Bottin Cours Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission © Polytechnique Montréal 2025. Répertoire des expertises Cuppens, Frédéric Poly Bottin Cours English Répertoire des expertises Cuppens, Frédéric Répertoire des expertises Retour aux résultats de recherche Modifier ma ficheAide Publications Frédéric Cuppens Publications Professeur titulaire Département de génie informatique et génie logiciel Tél. : (514) 340-4711 poste 2093 Téléc. : (514) 340-5139 Local : M-3103 frederic.cuppens@polymtl.ca Domaines d'expertise Cybersécurité Intérêts de recherche et affiliations Affiliation(s) LAMA-WeST (Web, Sémantique et Texte), Membre collaborateur Publications Publications récentes Communication de conférence Baghalizadeh Moghadam, N., Cuppens, F., & Boulahia Cuppens, N. (juin 2025). An NLP-Based Framework Leveraging Email and Multimodal User Data [Communication écrite]. 22nd International Conference on Security and Cryptography (SECRYPT 2025), Bilbao, Spain. Article de revue Saint-Hilaire, K., Neal, C., Cuppens, F., Boulahia Cuppens, N., Bassi, F., & Hadji, M. (2025). A real-time automated attack-defense graph generation approach. Journal of Information Security and Applications, 94, 104266 (28 pages). Chapitre de livre Cuppens, F., & Boulahia Cuppens, N. (2025). Cover Story. Dans Jajodia, S., Samarati, P., & Yung, M. (édit.), Encyclopedia of Cryptography, Security and Privacy (p. 450-452). Communication de conférence Ben Salem, R., Cuppens, F., Boulahia Cuppens, N., & Khechine, H. (août 2025). Designing a Framework to Tackle the Multifaceted Intricacies of Insider Threats [Communication écrite]. 20th International conference on Availability, Reliability and Security (ARES 2025), Ghent, Belgium. Publié dans Lecture notes in computer science, 15995. Voir toutes les publications (333) Biographie Frédéric Cuppens est professeur titulaire à Polytechnique Montréal. De 2003 à 2020, il a été professeur à IMT Atlantique, Campus de Rennes, et responsable de l’équipe IRIS (Sécurité et Résilience des Systèmes) du Lab-STICC. Il a été porteur de la chaire Cyber CNI sur la Cybersécurité des Infrastructures Critiques. De 2012 à 2016, il a été responsable du réseau thématique de l’IMT sur la sécurité des systèmes numériques et de 2014 à 2018, il a animé le Club formation du Pôle d’excellence cyber. Il mène des travaux de recherche dans le domaine de la sécurité des systèmes d’information (expression, déploiement et validation formelle de politiques de sécurité, détection et réaction aux intrusions, résilience des systèmes aux cyber attaques). Il a notamment conçu le module de supervision de la sécurité CRIM (Corrélation et Reconnaissance d’Intentions Malveillantes) reposant sur une approche innovante de la corrélation d’alertes et a développé le modèle d’expression de politiques de sécurité OrBAC (Organization Based Access Control). Recensé parmi les « 100 de la cybersécurité » par la revue l’Usine Nouvelle en 2019 et figurant dans les « Têtes de Bretagne », il a publié plus de 250 articles dans des conférences et des revues internationales. Il a été président du comité de programme de nombreuses conférences en cybersécurité telles que ESORICS, IFIP SEC, DBSEC, CRISIS, FPS ou PST. Il a reçu la médaille Ampère de la SEE en 2015 et un Outstanding Research Award de l’IFIP TC11 en 2016. Depuis lors, il anime le club technique de la SEE « cybersécurité et réseaux intelligents. Il préside également les comités de pilotage des conférences internationales CRISIS (International Conference on Risks and Security of Internet and Systems) et FPS (Foundations and Practice of Security). En 2019, il a été promu au grade de membre émérite de la SEE. Encadrement à Polytechnique TERMINÉ Thèse de doctorat (2) Saint-Hilaire, K. (2025). Automatic Generation of Attack and Remediation Graphs [Thèse de doctorat, Polytechnique Montréal]. Merzouk, M. A. (2024). A Landscape of Adversarial Threats to Machine Learning-Based Intrusion Detection [Thèse de doctorat, Polytechnique Montréal]. Mémoire de maîtrise (13) Rulh, B. (2025). Mise en place et expérimentation d'une infrastructure de test de la cybersécurité des technologies opérationnelles navales [Mémoire de maîtrise, Polytechnique Montréal]. Gourceyraud, M. (2024). Système de détection d'intrusion non supervisé fédéré [Mémoire de maîtrise, Polytechnique Montréal]. Morantin, B. R. M. (2024). Sécurité véhiculaire: Une approche par système de détection d'intrusion hybride [Mémoire de maîtrise, Polytechnique Montréal]. Abou Ahmed, K. (2023). Ontologie de playbook pour la réponse à incident [Mémoire de maîtrise, Polytechnique Montréal]. Adala, M. (2023). Outil d'aide à la décision pour la gestion de la conformité des TI [Mémoire de maîtrise, Polytechnique Montréal]. Chelle, V. (2023). Méthode d'analyse de la sécurité d'un téléphone intelligent et d'une application android tactique [Mémoire de maîtrise, Polytechnique Montréal]. Crochelet, P. (2023). Attribution de cyber-attaquants à partir de logs Honeypots [Mémoire de maîtrise, Polytechnique Montréal]. Delas, J. (2023). Étude de la vulnérabilité des systèmes de détection d'intrusion par apprentissage par renforcement face aux comportements adverses [Mémoire de maîtrise, Polytechnique Montréal]. Ksontini, R. (2023). XM-Guards: A Blockchain-Based Collaborative Intrusion Detection Argumentation Framework For Decision-Making [Mémoire de maîtrise, Polytechnique Montréal]. Stéphenne, C. (2023). Implémentation d'une architecture de routeur sécurisée à l'aide du Trusted Computing [Mémoire de maîtrise, Polytechnique Montréal]. Aurora, V. (2022). Classification non supervisée de cyberattaques par inspection de paquets [Mémoire de maîtrise, Polytechnique Montréal]. Charpentier, A. (2022). Optimisation de la sélection de techniques déceptives pour la sécurité et la cyber-résilience [Mémoire de maîtrise, Polytechnique Montréal]. Astanehparast, E. (2021). Ontologies for Insider Surveillance Indicators Rendering [Mémoire de maîtrise, Polytechnique Montréal]. Nouvelle(s) concernant Frédéric Cuppens NOUVELLES | 29 janvier 2025 Cybersécurité : l’IMC2 accueille une quatrième université dans ses rangs | Lire NOUVELLES | 13 mars 2024 Financement de la recherche: une année faste pour les équipes de Polytechnique qui obtiennent près de 47 millions de dollars en subventions | Lire NOUVELLES | 27 novembre 2023 L'expertise de Polytechnique Montréal au cœur de deux projets soutenus par le Consortium national pour la cybersécurité | Lire NOUVELLES | 19 octobre 2023 Cybersécurité : création de la chaire GEDAI pour cibler les menaces internes | Lire NOUVELLES | 22 avril 2022 Pénurie de cybertalents: Polytechnique Montréal crée une option cybersécurité dans son programme de maîtrise professionnelle en génie informatique et un DESS en cybersécurité | Lire NOUVELLES | 15 février 2022 Polytechnique à l'honneur dans le magazine «PLAN» de l'OIQ | Lire NOUVELLES | 8 juillet 2021 Évaluation nationale des infrastructures au Canada : Polytechnique Montréal contribue à une réflexion pour des infrastructures durables et résilientes | Lire NOUVELLES | 22 juin 2021 Subventions à la découverte: Polytechnique Montréal obtient près de 3,9 millions $ pour des programmes de recherche | Lire NOUVELLES | 22 juin 2021 Sciences humaines : des chercheuses et des chercheurs de Polytechnique Montréal impliqués dans des projets et partenariats de recherche | Lire NOUVELLES | 28 mai 2020 COVID-19 : les expertes et les experts en cybersécurité de Polytechnique sonnent l’alarme sur les applications de traçage | Lire Voir plus Revue de presse concernant Frédéric Cuppens 2 novembre 2025, La Presse, Reçus de caisse Quand un bisphénol toxique en remplace un autre Frédéric Cuppens, professeur titulaire au Département de génie informatique et génie logiciel spécialisé en cybersécurité, explique qu’il est possible de mettre sur pied un système de reçus électroniques anonymisés, en alternative aux reçus de caisse imprimés qui sont émis par les commerces. 8 octobre 2025, Les Affaires, Loi 25: les entreprises tardent à se conformer Frédéric Cuppens, professeur titulaire titulaire au Département de génie informatique et génie logiciel et directeur de l'Institut multidisciplinaire en cybersécurité et cyberrésilience (IMC2) et Nora Bouhahia Cuppens, professeure titulaire et directrice adjointe pour la recherche de l'IMC2, font état des ressources qui sont à la disposition des entreprises pour se conformer à la Loi 25 sur la protection des renseignements personnels. 7 octobre 2025, La Presse, Vers des assauts massifs contre la vérité Frédéric Cuppens, professeur titulaire au Département de génie informatique et génie logiciel et directeur de Institut multidisciplinaire en cybersécurité et cyberrésilience, explique les formes que prendront les cyberattaques dans Internet et les réseaux sociaux dans le futur. 4 novembre 2024, La Presse, Démystifier la science | Les menaces de l’internet russe Frédéric Cuppens, directeur de l’Institut multidisciplinaire en cybersécurité et cyberrésilience (IMC2), est questionné sur les cyberattaques russes et des moyens mis en oeuvre pour limiter l'impact de celles-ci. 25 septembre 2024, Revue Plan - OIQ, L'Intelligence Artificielle | Entre cybermenace et cybersecurite Frédéric Cuppens, professeur au Département de génie informatique et génie logiciel, m",
  "content_length": 19896,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:10"
}