{
  "name": "Frédéric Kaplan",
  "homepage": "https://www.epfl.ch/labs/dhlab",
  "status": "success",
  "content": "Digital Humanities Laboratory ‐ EPFL Skip to content Digital Humanities Laboratory A mosaic of visuals originating from various research projects at the DHLAB. The Digital Humanities Laboratory was founded by Professor Frédéric Kaplan in 2012. The lab develops new computational approaches to manage large digital cultural objects (such as large corpora of texts, images, and complex documents), and to execute high-resolution digitization of artifacts, buildings, and cities. It also aims to develop new understandings of digital cultures, such as visual languages, video culture, and linguistic mediations. Most Recent Publications 2026 ICDAR 2025 Competition on Historical Map Text Detection, Recognition, and LinkingY. Lin; S. Tual; Z. Li; L. Jang; Y. Y. Chiang et al. 2026. 19th International Conference on Document Analysis and Recognition (ICDAR 2025), Wuhan, China, 2025-09-16 – 2025-09-21. p. 568 – 585. DOI : 10.1007/978-3-032-04630-7_33. Detailed record View at publisher 2025 Georeferencing historical maps using local feature matching and Delaunay consistencyB. Vaienti; I. di Lenardo; F. Kaplan  Cartography and Geographic Information Science. 2025.  p. 1 – 23. DOI : 10.1080/15230406.2025.2566789. Detailed record View at publisher Lausanne 1831I. Di Lenardo; R. G. Petitpierre Cinisello Balsamo Milano : Silvana Editoriale Spa, 2025. Detailed record LLM-Powered Agents for Navigating Venice’s Historical CadastreT. Karch; J. Saydaliev; I. di Lenardo; F. Kaplan 2025 Detailed record View at publisher Recognizing and Sequencing Multi-word Texts in Maps Using an Attentive PointerM. Zou; T. Dai; R. Petitpierre; B. Vaienti; F. Kaplan et al. 2025 Detailed record View at publisher Cultural Heritage-Based Game Design A Case Study of The HillJ. Tang 2025. Detailed record Segmentation and Clustering of Local Planimetric Distortion Patterns in Historical Maps of JerusalemB. Vaienti; I. di Lenardo; F. Kaplan  ISPRS International Journal of Geo-Information. 2025. Vol. 14, num. 3. DOI : 10.3390/ijgi14030132. Detailed record View at publisher Paris and Jerusalem Maps Text DatasetT. Dai; K. T. Johnson; R. G. Petitpierre; B. Vaienti; I. di Lenardo 2025. Detailed record View at publisher Reconstructing Saint Mark’s Square in Venice: A 4D Model with Point Cloud Integration for Analyzing Historiographical HypothesesI. di Lenardo; B. Vaienti; P. Guhennec; Y. Ubelmann; I. Bianchi et al.  Heritage. 2025. Vol. 8, num. 2. DOI : 10.3390/heritage8020075. Detailed record View at publisher Exploring Large Vision-Language Models for Historical Newspaper SegmentationD. C. Papadopoulos 2025. Detailed record Data Visualization Dashboard For Large-Scale Data Processing Monitoring And Quality ControlE. G. J. E. Garandel 2025. Detailed record The Skin of Venice: A Computational Approach to the City’s Urban StructureP. Guhennec / F. Kaplan; I. Di Lenardo (Dir.)  Lausanne, EPFL, 2025. Detailed record View at publisher Document processing in data-scarce, domain-specific environments: The case of multilingual classical commentariesS. Najem-Meyer / F. Kaplan; M. Romanello (Dir.)  Lausanne, EPFL, 2025. Detailed record View at publisher HAECcity: Open-Vocabulary Scene Understanding of City-Scale Point Clouds with Superpoint Graph ClusteringA. Rusnak; F. Kaplan 2025. 2025 IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops, Nashville, TN, USA, 2025-06-11 – 2025-06-12. p. 5256 – 5265. DOI : 10.1109/CVPRW67362.2025.00521. Detailed record View at publisher LLM agents for interactive exploration of historical cadastre data: framework and application to VeniceT. Karch; J. Saydaliev; I. Di Lenardo; F. Kaplan  Computational Humanities Research. 2025. Vol. 1. DOI : 10.1017/chr.2025.10014. Detailed record View at publisher Investigating OCR-Sensitive Neurons to Improve Entity Recognition in Historical DocumentsE. Boros; M. Ehrmann 2025. 26th International Conference on Asia-Pacific Digital Libraries, Bandar Sunway, Malaysia, 2024-12-04 – 2024-12-06. p. 54 – 66. DOI : 10.1007/978-981-96-0865-2_5. Detailed record View at publisher Studying Maps at Scale: A Digital Investigation of Cartography and the Evolution of FigurationR. G. Petitpierre / F. Kaplan; I. Di Lenardo (Dir.)  Lausanne, EPFL, 2025. Detailed record View at publisher 2024 A CORPUS-BASED APPROACH TO IDENTIFYING TOP-LEVEL TERMS FOR DEVELOPING A SKOS VOCABULARY FOR UKRAINIAN EPIGRAPHYH. Tamrazyan  Слобожанський науковий вісник. Серія: Філологія. 2024. num. 7, p. 58 – 65. DOI : https://doi.org/10.32782/philspu/2024.7.9. Detailed record View at publisher Exploring cartographic genealogies through deformation analysis: case studies on ancient maps and synthetic dataB. Vaienti; I. Di Lenardo; F. Kaplan  Cartography and Geographic Information Science. 2024.  p. 1 – 21. DOI : 10.1080/15230406.2024.2424891. Detailed record View at publisher Macroeconomic Conditioned Synthetic Financial MarketsA. M. Rusnak; S. Daul 2024. 5th ACM International Conference on Artificial Intelligence in Finance, Brookyln, New York, USA, 2024-11-14 – 2024-11-27. p. 150 – 158. DOI : 10.1145/3677052.3698606. Detailed record View at publisher Back to top",
  "content_length": 5135,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:11"
}