{
  "name": "Frédéric Gibou",
  "homepage": "https://engineering.ucsb.edu/~fgibou",
  "status": "success",
  "content": "Frederic Gibou Prof. Frederic Gibou Home Research Teaching Publications CASL Group Contact Info Department of Mechanical Engineering Engineering II Bldg., Office 2335 Santa Barbara, CA 93106-5070 TEL: (805) 893-7152 FAX: (805) 893-8651 EMAIL: fgibou@engineering.ucsb.edu Google map to the Engineering II: Brief Bio Professor Gibou is a faculty member in the Department of Mechanical Engineering, in the Department of Computer Science and in the Department of Mathematics at the University of California, Santa Barbara. He is also a core faculty member in the Computational Science and Engineering program. He received his PhD from the Applied Mathematics Department at UCLA, and did his post-doctoral research in the Departments of Mathematics and Computer Science at Stanford University. He was awarded an Alfred P. Sloan Fellowship in Mathematics, the Regent’s Junior Faculty Fellowship, an NSF Mathematical Sciences Postdoctoral Fellowship and the Robert Sorgenfrey Distinguished Teaching award. Professor Gibou is on the Editorial Board of the Journal of Computational Physics and on the Editorial Board of the Journal of Scientific Computing . The research of Professor Gibou is at the interface between Applied Mathematics, Computer Science and Engineering Sciences. It is focused on the design of a novel paradigm for high resolution computational methods for large scale computations and their use for a variety of applications including Computational Materials Science, Computational Fluid Dynamics and Computational Image Analysis. The main commonality in these applications is that they are described by complex/free boundaries and similar classes of nonlinear partial differential equations. In addition, the multiscale nature of most interesting phenomena in the physical and life sciences motivate the development and use of versatile computational strategies on spatially adaptive grids and on massively parallel environments. Professor Gibou leads a multidisciplinary research group, named Computational Applied Science Laboratory (CASL). Strong collaborations exist between CASL and other research groups at UCSB and worldwide, especially with experimentalists. It is therefore standard that researchers in CASL benefit from a truly interdisciplinary training in modern science and engineering. Present and past support from the following agencies is gratefully acknowledged! © 2014 Frederic Gibou | Original design by andreasviklund.com",
  "content_length": 2454,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:09"
}