{
  "name": "Fumio Machida",
  "homepage": "https://www.cs.tsukuba.ac.jp/~machida/en",
  "status": "success",
  "content": "﻿ Laboratory for System Dependability [Japanese | English] Laboratory for System Dependability Laboratory Topics Research Publications Members Opportunities Contact Envision safer and secure society through dependable ICT systems. Overview Our society is increasingly relying on software systems, for example in business, economics, communication, utilities, and education. Since those software systems are indispensable for our lives, continuous engineering efforts to improve system dependability are imperatively important. Our research laboratory tackles this issue by leveraging stochastic models and analysis techniques. We model various uncertainties causing system misbehaviors such as component failures, estimate the system dependability quantitatively, and evaluate the effectiveness of the measures to improve the dependability with lower cost. Research interests Software reliability evaluation and design Stochastic models for dependability analysis (availability, reliability, performability) System dependability trade-off analysis and optimization Software rejuvenation and life-extension Dependability assurance for machine learning systems Dependable fog and edge computing LLM-based automated software engineering Details of research topics Recent topics 2025/11/21 New Our joint research paper entitled \"Machine Learning for Software Aging Detection: A Systematic Mapping Study\" has been accepted for publication in The Journal of Systems & Software. 2025/11/7 New Prof. Fumio Machida delivered an invited talk at IEICE Technical Committee on Information and Communication Management. \"N-version configuration method for reliable machine learning systems\" 2025/10/28 Yaqi Zhou joined our group as a visiting research student from Imperial College London. 2025/10/21 Prof. Fumio Machida delivered a keynote at the 2nd International Workshop on Advanced Intelligent Software Applications (AISQ 2025). \"High-Availability Machine Learning Systems: N-version Architecture and Rejuvenation\" [slides] 2025/10/20 Gabriel Grabher, a former exchange student's paper \"Modeling Anomaly Detection in Cloud Services: Analysis of the Properties that Impact Latency and Resource Consumption\" has been accepted for presentation at the IEEE/ACM International Conference on Utility and Cloud Computing (UCC 2025). [paper] 2025/10/6 Our paper \"Experimental Investigation of Memory-Related Software Aging in LLM Systems\" has been accepted for presentation in the Journal of Systems & Software. The paper is the outcome of the joint work with Prof. Ermeson Andrade and Cesar Santos.[link][paper] 2025/7/19 Zhengji Wang's paper \"Exploiting the Availability-Continuity Trade-off in Imperfect Retraining of Machine Learning Systems\" has been accepted for presentation at the 36th International Symposium on Software Reliability Engineering (ISSRE 2025). 2025/6/26 Our research paper entitled \"SPADE: Simulator-assisted Performability Design for UAV-based monitoring systems\" has been accepted for publication in Future Generation Computer Systems.[paper] 2025/6/26 Qiang Wen, Qingyang Zhang, and Tasfia Nuzhat presented their papers at DSN2025 and EnvSys2025 workshop. 2025/6/23 We have posted our recent survey report to arXiv \"Dependability of UAV-Based Networks and Computing Systems: A Survey.\" [link] 2025/5/22 Mohammad Dwipa Furqan presented a paper at ICFEC2025. [paper] 2025/5/7 Tasfia Nutzhat's paper \"Weather Impact Analysis for UAV-based Deforestation Monitoring Systems\" has been accepted for presentation at the DSN Workshop on Environment-System Symbiosis (EnvSys 2025). 2025/4/5 Mohammad Shahin Uddin has joined our group as a master student. Shunsuke Nagao starts the master program. Old topics Opportunities We are actively accepting students pursuing master or doctoral degrees of computer science, international research students (Kenkyu-sei), and visitors for collaborative research on system dependability. Those who want to apply international research students, please also check the necessary procedure for application here. Contact Fumio Machida　 Department of Computer Science, University of Tsukuba Address: 1-1-1, Tennodai, Tsukuba, Ibaraki 305-8573 E-mail: machida at cs.tsukuba.ac.jp Last update: 2025.11.22",
  "content_length": 4237,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:14"
}