{
  "name": "Fumio Okura",
  "homepage": "http://www-infobiz.ist.osaka-u.ac.jp/user/okura",
  "status": "success",
  "content": "Fumio Okura (å¤§å å²ç) Fumio Okura / å¤§å å²ç This website is obsolete. Please visit the new one. Fumio Okura (å¤§å å²ç / ãããã ãµã¿ã) å¤§éªå¤§å­¦ æ å ±ç§å­¦ç ç©¶ç§ åææ Associate Professor, The University of Osaka (formerly known as Osaka University) A member of Computer Vision League Osaka (CVL-Osaka) Faculty I am an associate professor in Computer Vision Laboratory, Graduate School of Information Science and Technology, The University of Osaka, working with (Guest) Professor Yasuyuki Matsushita and Assistant Professor Hiroaki Santo. I recently found the Computer Vision League Osaka (CVL-Osaka) alliance gathering CV reseachers around Osaka. Until March 2020, I was an assistant professor at the Department of Intelligent Media (Yagi Lab.). I received my Ph.D. (Doctor of Engineering) in March 2014 from Nara Institute of Science and Technology (NAIST), Japan, under the supervision of Professor Naokazu Yokoya in Vision and Media Computing Lab.\tAfter receiving my Ph.D., I visited the REVES group at INRIA Sophia-Antipolis, France and worked with Dr. George Drettakis, Dr. Adrien Bousseau, and Dr. Kenneth Vanhoey in collaboration with Professor Alyosha Efros (UC Berkeley). From 2017 to 2021, I was also a researcher in JST PRESTO (ãããã), \"Innovational technical basis for cultivation in cooperation with information science\" (ãæ å ±ç§å­¦ã¨ã®ååã«ããé©æ°çãªè¾²ç£ç©æ ½å¹ææ³ãå®ç¾ããããã®æè¡åºç¤ã®åµåºã) research area. I'm working on a boundary domain between computer graphics and vision. I'm especially interested in modeling, rendering, and applications of computer vision. Recently, I have become particularly interested in image-based analysis of botanical plants, which poses significant challenges to the field of computer vision. Contact [EN] Computer Vision Laboratory, Department of Multimedia Engineering, Graduate School of Information Science and Technology, The University of Osaka 1-5 Yamadaoka, Suita, Osaka 565-0871, Japan. [JP] ã565-0871 å¤§éªåºå¹ç°å¸å±±ç°ä¸1-5 å¤§éªå¤§å­¦ æ å ±ç§å­¦ç ç©¶ç§ ãã«ãã¡ãã£ã¢å·¥å­¦å°æ» ã³ã³ãã¥ã¼ã¿ãã¸ã§ã³è¬åº§ okura [at] ist.osaka-u.ac.jp okura.fumio @foukmu top © Fumio Okura. All rights reserved",
  "content_length": 2279,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:14"
}