{
  "name": "Furkan Kiraç",
  "homepage": "http://www.fkirac.net",
  "status": "success",
  "content": "Web page of M. Furkan Kıraç 0. External Site Links 1. Education 2. Academic Interests 3. Experience 4. Awards and Achievements 5. Skills 6. Academic Service 7. Book Chapters 8. Publications 9. Projects 0. External Site Links If you prefer to download a proper CV file in PDF format please use this link. You can access my LinkedIn Profile using this link. You can access my Google Scholar Profile using this link. You can email me using kiracmus at boun.edu.tr, or furkan.kirac at ozyegin.edu.tr. 1. Education Sep.2002 - Sep.2013 Boğaziçi University, İstanbul, TurkeyPhD. in Computer Engineering, GPA 3.94Adviser: Prof. Lale AkarunThesis Title: Real-time Hand Pose Estimation and Tracking using Depth Sensors Sep.2000 - Jun.2002 Boğaziçi University, İstanbul, TurkeyM.S. in Systems and Control Engineering, GPA 4.00Adviser: Prof. Ümit BilgeThesis Title: Genetic Algorithm Approach to Parallel Machine Total Tardiness Problem [PDF] Sep.1996 - Jun.2000 Boğaziçi University, İstanbul, TurkeyB.S. in Mechanical Engineering, GPA 3.31 Sep.1989 - Jan.1996 Kadıköy Anatolian High School, İstanbul, Turkey 2. Academic Interests Research Interests: Machine Learning (Deep Learning) Computer Vision Teaching Interests: Machine Learning (Deep Learning) Computer Vision Programming Languages and Software Engineering Embedded Programming Courses Assisted in Bogazici University: CMPE537, Computer Vision, Fall 2009, assistant of Prof. Dr. Lale Akarun CMPE150, Introduction to Computing, Spring 2012, assistant of Prof. Dr. Lale Akarun Courses Taught in Ozyegin University: CS101 - Introduction to Computing (Spring 2012, Spring 2013, Fall 2014, Fall 2015) [Course Page] CS102 - Object Oriented Programming (Fall 2012, Fall 2013, Spring 2014) [Course Page] CS321 - Programming Languages (Fall 2018) CS394 - Android Application Programming (Spring 2014, Spring 2015) CS409/509 - Advanced C++ Programming (Spring 2017, Spring 2018) CS423/523 - Computer Vision (Fall 2014, Fall 2015, Fall 2016, Fall 2017) CS466/566 - Introduction to Deep Learning (Spring 2016) CS509-Vestel - Advanced C++ Programming (Spring 2018) CS523-Vestel - Computer Vision (Fall 2017) CS577-Vestel - Android Application Programming (Spring 2014, Spring 2016) 3. Experience Sep. 2013 – ... Assist. Prof., Computer Science Department, Özyeğin University (Room 219) Sep. 2012 – Jun. 2013 Part-time Instructor, Computer Science Department, Özyeğin University (Room 219) Apr. 2009 – Aug. 2013 Research Assistant, Computer Engineering Department, Boğaziçi University Sep. 2009 – Sep. 2012 Teaching Assistant, Computer Engineering Department, Boğaziçi University Jul. 2009 – Apr. 2010 Fortibase Corporation, İstanbul / TurkeyFounder Partner & Chief Technical Officer, Computer Vision based R&D firm Jul. 2000 – Apr. 2009 Proksima Corporation, İstanbul / TurkeyFounder Partner & Chief Technical Officer, Computer Vision based R&D firm Jul. - Sep.1998 Toyota Automobile Factory, Adapazari, Turkey Member of a team preparing 3D modeling of car components. Studied the fatigue fracture failures of transmission components. 4. Awards and Achievements 20123rd place in best demo award, SIU 2012, Muğla, Turkey. 2012Best application paper award, SIU 2012, Muğla, Turkey. 2008Programmed the first Computer Vision based Gas Filling Automation System.Used for automatic filling of gas tanks for a major Turkish energy company. 2006Ported the tire design software INFMT/G from Fortran’77 VAX to today’s PCs.The code is actively being used for tire development in BRISA. 20052nd place in best paper award, SIU 2005, Kayseri, Turkey. 2004Programmed the first Computer Vision based Filling Quality Control Automation System.Software is currently being used in BP Gas at Yarimca, Turkey. 2003Programmed the first Turkish License Plate Recognition Software Platasis.Software is currently being used widely in Turkey. 2001Programmed fluid mechanics airflow simulator AIRSIM for a major Turkish brand Arçelik.Simulator has been used in the research phase of “Orbital” series refrigerators. 1995Represented Turkey in 1995 London International Youth Science Forum.Sponsored by British Council. 19952nd degree in National High School Students Computer Research Project Competition.Project was an Operating System built on DOS which used a Windows 95 like GUI. Windows 95 was not released yet. 1995Silver medal in III. National Computer Science Olympiads, Marmara Territory. 1995Bronze medal in III. National Computer Science Olympiads, Turkey. 1994Gold medal in II. National Computer Science Olympiads, Marmara Territory. 1994Bronze position in II. National Computer Science Olympiads, Turkey. 5. Skills Spoken Languages: Advanced English, intermediate German, native Turkish speaker. Programming: More than 30 years of C and C++ experience. Advanced knowledge of modern C++ (C++11, 14, 17)Also proficient in Java, Python, CUDA, Assembly (680x0, 80x86), Perl, Fortran, JavaScript, ... Operating Systems: Various flavors of Linux, MacOS, Windows, Android, iOS, and AmigaOS. Computer Graphics: Blender 2.80, 3D Studio Max modelling, Ogre Game Development Framework. Distributed Computing: OpenMP, Intel TBB, OpenMPI, Sun Grid Engine. Database Administration:Informix, Oracle, PostgreSQL, FirebirdSQL, MySQL, MariaDB, Firebase, ... 6. Academic Service Reviewer, Elsevier Image and Vision Computing Journal Reviewer, Elsevier Pattern Recognition Letters Journal Reviewer, Elsevier Image Communications Journal Reviewer, SIU 2012 Conference Reviewer, Journal of Biomedical and Health Informatics Reviewer, Association for the Advancement of Artificial Intelligence Reviewer, Digital Signal Processing Reviewer, IEEE Journal of Biomedical and Health Informatics Reviewer, IEEE Transactions on Industrial Informatics Reviewer, IEEE Transactions on Multimedia Reviewer, IET Computer Vision Reviewer, Image and Vision Computing Reviewer, Signal Image and Video Processing 7. Book Chapters Keskin, Cem, Furkan Kirac, Yunus Emre Kara, Lale Akarun, \"Real-time Hand Pose Estimation Using Depth Sensors\", Consumer Depth Cameras for Computer Vision: Research Topics and Applications, 2012. 8. Publications International Journal Publications: Gocer, Ozgur, K Göçer, Baris Ozcan, M Bakoviç, Furkan Kirac, \"Pedestrian tracking in outdoor spaces of a suburban university campus for the investigation of occupancy patterns\", Sustainable Cities and Society (SCS), 2018. Gocer, Ozgur, K Göçer, AM Başol, Furkan Kirac, A Özbil, M Bakovic, FP Siddiqui, Baris Ozcan, \"Introduction of a spatio-temporal mapping based POE method for outdoor spaces: Suburban university campus as a case study\", Building and Environment 145, 125-139, 2018. Kirac, Furkan, Baris Aktemur, Hasan Sözer, \"VISOR: A fast image processing pipeline with scaling and translation invariance for test oracle automation of visual output systems\", Journal of Systems and Software 136, 266-277, 2018. Buse Yilmaz, Baris Aktemur, M. J. Garzaran, S. Kamin, Furkan Kirac, \"Autotuning Runtime Specialization for Sparse Matrix-Vector Multiplication\", ACM Transactions on Architecture and Code Optimization (TACO), March 2015. Kirac, Furkan, Yunus Emre Kara, Lale Akarun, “Hierarchically Constrained 3D Hand Pose Estimation using Regression Forests from Single Frame Depth Data”, Pattern Recognition Letters - Special Issue on Depth Image Analysis, 2013. Bilge Umit, Mujde Kurtulan, Furkan Kirac, “A Tabu Search Algorithm for the Single Machine Total Weighted Tardiness Problem”, European Journal of Operational Research, 176 (3), 1423-1435, 2007. Bilge Umit, Furkan Kirac, Mujde Kurtulan, Pelin Pekgün, “A Tabu Search Algorithm for Parallel Machine Total Tardiness Problem”, Computers and Operations Research, v.31 n.3, p.397-414, 2004. International Conference / Workshop Publications: Kinli, Furkan, Baris Ozcan, and Furkan Kirac. \"Fashion Image Retrieval with Capsule Networks.\" In Proceedings of the IEEE International Conference on Computer Vision Workshops, pp. 0-0. 2019. Keskin, Cem, Furkan Kıraç, Yunus Emre Kara, and Lale Akarun. \"Hand pose estimation and hand shape classification using multi-layered randomized decision forests.\" In European Conference on Computer Vision, pp. 852-863. Springer, Berlin, Heidelberg, 2012. Keskin, Cem, Furkan Kirac, Yunus Emre Kara, and Laie Akarun. \"Randomized decision forests for static and dynamic hand shape classification.\" In 2012 IEEE Computer Society Conference on Computer Vision and Pattern Recognition Workshops, pp. 31-36. IEEE, 2012. A. A. Kındıroğlu, R. Yorgancı, Furkan Kirac, M. Aydın, M. Hruz, H. Köse, Lale Akarun, \"Multimodal Sign Language Game Interface\", In Proceedings of eNTERFACE, The Summer Workshop on Multimodal Interfaces, 2011. Keskin, Cem, Furkan Kıraç, Yunus Emre Kara, and Lale Akarun. \"Real time hand pose estimation using depth sensors.\" In Consumer depth cameras for computer vision, pp. 119-137. Springer, London, 2013. Keskin, Cem, Ismail Arı, Tolga Eren, Furkan Kıraç, Lukas Rybok, Hazım Ekenel, Rainer Stiefelhagen, and Lale Akarun. \"Vision Based Hand Puppet.\" In 6th International Summer Workshop on Multimodal Interfaces, p. 40. 2010. Kirac, Furkan, Ü. Bilge, M. Kurtulan, \"Genetic Algorithm Approach to Parallel Machine Total Tardiness Problem\", In Proceedings of EUROINFORMS, İstanbul, 2003. [PPT] National Conference Publications: Kirac, Furkan, Yunus Emre Kara, Cem Keskin, Lale Akarun, \"Depth Image Based 3D Hand Pose Estimation Framework\", In Proceedings of SİU 2012. Keskin, Cem, Furkan Kıraç, Yunus Emre Kara, Lale Akarun, \"3D Hand Pose Estimation and Classification Using Depth Sensors\", In Proceedings of SİU 2012. Kirac, Furkan, Lale Akarun, \"Real-time Pose Tracking Based on a 3D Skeletal Model Using Multiple Cameras\", In Proceedings of SİU 2011. Kirac, Furkan, Lale Akarun, \"Human Hand Tracking in Image Sequence using Particle Filters\", In Proceedings of SİU 2005. 9. Projects Project Lead (Yürütücü), TUBITAK 1007 - KGYS için akıllı destek yazılımları geliştirme projesi, 2016-2019 Consultant, Yapay Sinir Ağları Eğitimi (Neural Net",
  "content_length": 10515,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:16"
}