{
  "name": "Félix J. García 0001",
  "homepage": "http://webs.um.es/fgarcia/miwiki/doku.php",
  "status": "success",
  "content": "inicio [FELIX JESUS GARCIA CLEMENTE] Menú principal Menú principal Inicio Docencia Investigación Proyectos Noticias Contacto Main menu Home Teaching Research Projects Contact Presentación Félix J. García Clemente es Doctor en Informática y Catedrático de Universidad en el área de Arquitectura y Tecnología de Computadores de la Facultad de Informática de la Universidad de Murcia. Es de miembro fundador de las Empresas de Base Tecnológica (EBT) Bleecker Technologies y Scorpion Cybertechnologies. Asimismo, es director de la Cátedra Primafrio. Además, forma parte del Grupo de Investigación de Computación Móvil y Visión Artificial y del CyberDataLab de la Universidad de Murcia. Su labor docente en el Departamento de Ingeniería y Tecnología de Computadores se centra en tecnologías en la nube, administración de servicios y ciberseguridad. En este ámbito, colabora en iniciativas de innovación docente junto a otros profesores en el grupo de innovación Enseñanza de Tecnologías Informáticas basada en Proyectos, Entornos de Computación Interactiva y Virtualización de la Universidad de Murcia. Su actividad investigadora abarca áreas como la ciberseguridad, la inteligencia artificial, la industria 4.0 y la tecnología educativa. Como resultado de su trabajo, es autor de más de 150 publicaciones (incluyendo artículos en revistas y conferencias) y participa activamente en diversos proyectos de I+D nacionales e internacionales. Además, coordina múltiples proyectos de transferencia tecnológica relacionados con la automatización industrial, la ciberseguridad, la inteligencia artificial y las tecnologías educativas. Félix J. García ha sido profesor visitante en prestigiosas instituciones internacionales, como el Grupo de Investigación Coordination & Interaction Systems (REACT) de la EPFL, el National Institute of Education (NIE) de la Nanyang Technological University (NTU) y el Ginzton Laboratory de la Universidad de Stanford. Además, cuenta con una amplia experiencia en gestión académica. Ha desempeñado roles como Coordinador del Doctorado en Informática, Presidente de la Comisión de Rama de Ingeniería y Arquitectura, Coordinador de Grado, Coordinador de Máster y Vicedecano de Estudios en la Facultad de Informática. También ha sido Director de la Oficina de Transferencia de Resultados de Investigación (OTRI). inicio.txt Última modificación: 2025/09/25 16:47por fgarcia@um.es",
  "content_length": 2396,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:18"
}