{
  "name": "Félix Gómez Mármol",
  "homepage": "http://webs.um.es/felixgm",
  "status": "success",
  "content": "Félix Gómez Mármol - Biography Félix Gómez Mármol University of Murcia Home Publications Research Projects Evaluator Editor & TPC Teaching Contact Short Bio Always eager to learn, improve, become a better person and meet new goals, I am a researcher in the field of cybersecurity aiming at finding innovative solutions to protect ICT systems and their users against cyberthreats and cyberattacks. After receiving my M.Sc. and PhD in Computer Science (in 2007 and 2010, respectively), both from the University of Murcia, I joined NEC Laboratories Europe in Heidelberg as a Research Scientist. In 2012 I was promoted to Senior Researcher in the same institution. From March 2017 to February 2022 I worked as a «Ramón y Cajal» Researcher at the University of Murcia. Currently, I am an Assistant Professor and my research focus is specifically on cybersecurity related topics. Positions Present2025 Co-Founder & CEO at SCORPION CybertechSCORPION Cybertech Present2022 Assistant Professor (Profesor Titular de Universidad)University of Murcia Present2022 Vicedean of Students, Faculty of Computer ScienceUniversity of Murcia 20222022 Assistant Professor (Profesor Contratado Doctor)University of Murcia 20222017 “Ramón y Cajal” ResearcherUniversity of Murcia 20172012 Senior ResearcherNEC Laboratories Europe 20122010 Research ScientistNEC Laboratories Europe 20072006 Software DeveloperCYUM, University of Murcia Education PhD 2010 PhD in Computer Science University of Murcia MSc 2007 Master in Advanced Information and Telematic Technologies University of Murcia MSc 2006 Computer Science Engineering University of Murcia “The worst part is not in making a mistake but in trying to justify it, instead of using it as a heaven-sent warning of our mindlessness or our ignorance.” Awards December 2021 Knowledge Transfer Award Knowledge Transfer Award granted by the University of Murcia July 2017 Leonardo Grant Awarded with a Leonardo Grant by the BBVA Foundation from September 2017 to March 2019 March 2017 Ramón y Cajal Research Grant Awarded with a «Ramón y Cajal» Research Grant by the Ministry of Economy, Industry and Competitiveness (RYC-2015-18210) from March 2017 to February 2022 January 2011 Best PhD Thesis Award Best PhD Thesis Award granted by the University of Murcia Trust and Reputation Management in Distributed and Heterogeneous SystemsPhD ThesisFélix Gómez MármolPhD Thesis, European Doctorate in Computer Science, University of Murcia, advisor Gregorio Martínez Pérez Publication year: 2010 September 2009 Internship Scholarship Awarded with a scholarship by the Seneca Foundation (regional agency for R&D) to conduct an internship at NEC Laboratories Europe (Germany) from 14/09/2009 to 13/03/2010 September 2008 Internship Scholarship Awarded with a scholarship by the Seneca Foundation (regional agency for R&D) to conduct an internship at NEC Laboratories Europe (Germany) from 01/09/2008 to 28/02/2009 November 2007 PhD Scholarship Awarded with a PhD scholarship by the Seneca Foundation (regional agency for R&D) from November 2007 to November 2010 September 2006 Graduated with Honors Graduated with Honors by the University of Murcia and awarded with the «Honourable Mention to the Academic Excellence» October 2005 Seneca Scholarship Awarded with a Seneca scholarship to study at the University of Granada in the academic year 2005-2006 (SICUE programme) Gallery Sometimes, when I have a bit of spare time, I like to kill it with my Canon EOS 600D…",
  "content_length": 3477,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:19"
}