{
  "name": "G. Katsaros",
  "homepage": "https://ist.ac.at/research/research-groups/katsaros-group",
  "status": "success",
  "content": "ISTA | Katsaros Group HomeResearchKatsaros Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Katsaros Group Nanoelectronics It is impossible to picture modern life without thinking of the vast amount of microelectronic applications that surround us. However, such development has only become possible with the invention of the transistor in the 1950’s. This – back at that time – few centimeters large device, led to a technological revolution. Today the size of the transistors has been shrunk to 7nm where quantum physics comes into play. Researchers are now developing new concepts and techniques using quantum mechanics to allow information processing to operate on completely different principles and to create a quantum computer. In this line, Loss and DiVincenzo suggested in 1998 the use of electron spins confined in lithographically defined quantum dots as elementary qubits to realize a quantum computer. In the past few years, holes in Germanium have emerged as a very promising platform for the realization of these spin qubits, due to their small effective mass and large spin orbit coupling and absence of the valley problem faced by non-confined electron spins. In addition, in the quantum information community there has been recently a huge wave of excitement about the prospect of using protected qubits for quantum computation. Such protection can be realized on the hardware-level by using topological qubits or cleverly designed electrical circuits. In the nanoelectronics group, we study spin qubits in two-dimensional Germanium heterostructures and in parallel, we aim to understand whether protected qubits can be realized in hybrid semiconductor-superconductor systems. While our research is focused on the realization of different types of qubits, the group is very much interested in studying new fundamental physics emerging in semiconductor nanodevices. Group Leader Georgios Katsaros Professor +43 2243 9000 2023 Georgios.Katsaros@ist.ac.at Administrative Support Sandra Widdmann Assistant to Professors +43 2243 9000 1178 Sandra.Widdmann@ist.ac.at Team Maksim Borovkov PhD Student maksim.borovkov@ist.ac.at Anton Bubis Postdoc anton.bubis@ist.ac.at Giorgio Fabris PhD Student Giorgio.Fabris@ist.ac.at Paul Falthansl-Scheinecker PhD Student Paul.Falthansl-Scheinecker@ist.ac.at Kristen Léonard PhD Student KristenWilliams.GALVIN@ist.ac.at Ming Ni Postdoc Ming.Ni@ist.ac.at Simon Robson Postdoc Simon.Robson@ist.ac.at Kevin Roux Postdoc kevin.roux@ist.ac.at Yona Schell PhD Student Yona.Schell@ist.ac.at Devashish Shah PhD Student Devashish.Shah@ist.ac.at Dina Sokolova PhD Student Dina.Sokolova@ist.ac.at Current Projects Hybrid semiconductor-superconductor quantum devices | Hole spin orbit qubits in Ge quantum wells | High impedance circuit quantum electrodynamics with hole spins See the group website for up to date projects. Publications Kapoor L, Ruzickova N, Zivadinovic P, Leitner V, Sisak MA, Mweka CN, Dobbelaere JA, Katsaros G, Schanda P. 2025. Quantifying the carbon footprint of conference travel: The case of NMR meetings. Magnetic Resonance. 6(2), 243–256. View Botifoll M, Pinto-Huguet I, Rotunno E, Galvani T, Coll C, Kavkani PH, Spadaro MC, Niquet YM, Eriksen MB, Martí-Sánchez S, Katsaros G, Scappucci G, Krogstrup P, Isella G, Cabot A, Merino G, Ordejón P, Roche S, Grillo V, Arbiol J. 2025. Artificial intelligence-assisted workflow for transmission electron microscopy: From data analysis automation to materials knowledge unveiling. Advanced Materials., e06785. View Saez Mollejo J. 2025. Singlet-triplet qubits in planar Germanium. Institute of Science and Technology Austria. View Saez Mollejo J, Jirovec D, Schell YA, Kukucka J, Calcaterra S, Chrastina D, Isella G, Rimbach-Russ M, Bosco S, Katsaros G. 2025. Exchange anisotropies in microwave-driven singlet-triplet qubits. Nature Communications. 16, 3862. View Valentini M, Souto RS, Borovkov M, Krogstrup P, Meir Y, Leijnse M, Danon J, Katsaros G. 2025. Subgap transport in superconductor-semiconductor hybrid islands: Weak and strong coupling regimes. Physical Review Research. 7(2), 023022. View View All Publications ReX-Link: Georgios Katsaros Career Since 2024 Vice President for Scientific Resources, Institute of Science and Technology Austria (ISTA)Since 2022 Professor, Institute of Science and Technology Austria (ISTA)2016 – 2022 Assistant Professor, Institute of Science and Technology Austria (ISTA)2012 – 2016 Group Leader, Johannes Kepler University, Linz, Austria2011 – 2012 Group Leader, Leibniz Institute for Solid State and Materials Research, Dresden, Germany2006 – 2010 Postdoc, CEA, Grenoble, France2006 PhD, Max Planck Institute for Solid State Research, Stuttgart, Germany2001 – 2002 Research Assistant, National Center for Scientific Research “Demokritos”, Athens, Greece Selected Distinctions 2015 Elected member of the Young Academy of the Austrian Academy of Sciences (ÖAW)2013 ERC Starting Grant2013 FWF START Award2012 FWF Lise Meitner Fellowship2011 Marie Curie Carrier Integration Grant Additional Information Download CVOpen Katsaros group sitePhysics & Beyond at ISTA Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 7552,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:22"
}