{
  "name": "G. Stefano Sukhatme",
  "homepage": "http://www-robotics.usc.edu/~gaurav",
  "status": "success",
  "content": "Principal Investigator – Robotic Embedded Systems Lab Principal Investigator Gaurav S. Sukhatme Professor of Computer Science, and of Electrical and Computer Engineering Donald M. Aldstadt Chair in Advanced Computing Director, USC School of Advanced Computing Executive Vice Dean, USC Viterbi School of Engineering ude.csu@varuag Academic CV EA: Raymond Duran ude.csu@rnarud Gaurav S. Sukhatme is Professor of Computer Science and Electrical and Computer Engineering at the University of Southern California (USC) and an Amazon Scholar. He is the Director of the USC School of Advanced Computing and the Executive Vice Dean of the USC Viterbi School of Engineering. He holds the Donald M. Aldstadt Chair in Advanced Computing at USC. He was the Chairman of the USC Computer Science department from 2012-17. He received his undergraduate education in computer science and engineering at IIT Bombay and his M.S. and Ph.D. degrees in computer science from USC. Sukhatme is the co-director of the USC Robotics Research Laboratory and the USC Robotic Embedded Systems Laboratory director. His research interests are in networked robots, learning robots, and field robotics. He has published extensively in these and related areas. Sukhatme has served as PI on numerous NSF, DARPA, and NASA grants. He was a Co-PI on the Center for Embedded Networked Sensing (CENS), an NSF Science and Technology Center. He is a Fellow of the AAAS, AAAI, and the IEEE, a recipient of the NSF CAREER award, the Okawa Foundation research award, and an Amazon research award. He is one of the founders of the Robotics: Science and Systems conference. He was the program chair of the 2008 IEEE International Conference on Robotics and Automation and the 2011 IEEE/RSJ International Conference on Robots and Systems. He is currently the Editor-in-Chief of Autonomous Robots (Springer Nature) and has served in the past as Associate Editor of the IEEE Transactions on Robotics and Automation, the IEEE Transactions on Mobile Computing, and on the editorial board of IEEE Pervasive Computing. Robotic Embedded Systems Laboratory University of Southern California Ronald Tutor Hall, RTH426 3710 McClintock Avenue Los Angeles, CA 90089-9121 1 (213) 740-7288 Scroll to top Scroll to top Scroll to top",
  "content_length": 2268,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:25"
}