{
  "name": "G. Sivakumar",
  "homepage": "https://www.cse.iitb.ac.in/~siva",
  "status": "success",
  "content": "Siva's Home Page Who am I? Click here to find out! ...... the eternal, undecidable question! G. Sivakumar சிவகுமார் शिवकुमार Click here to find out who I am! B.Tech., Elec. Engg., I.I.T. Madras, 1982 M.S., Computer Science, , RPI, 1984 Ph.D., Computer Science, U. of Illinois at Urbana-Champaign, 1988 Hello there, I'm a Professor at the Computer Science and Engineering Department at Indian Institute of Technoly, Bombay My main research interests (a more detailed research statement available here ) are in the various applications of Logic in Computer Science. My current focus of work is on formal verification of safety critical real-time systems for which a Centre has been set up recently at IIT Bombay. Some details about my education and career and recent publications, for the interested. Here's information about the Ph. D. students I have guided so far. By looking at abstracts of recent M. Tech projects completed under my guidance you can get a better idea about my range of interests. Click here for some topics for DDP (Spring 2006) and meet/mail me to find out more. See details of my ongoing Funded Research Projects, professional activities, and short term courses I have conducted. Here are the slides (PDF) of a keynote address I gave on Feb 25, 2009 on Web 2.0 and Library 2.0 at the CALIBER 2009 conference at Pondicherry. I also dabble with Computer Networks and am addicted to Internet . Here are the slides (PDF) of a talk I gave on Feb 8, 2005 on Design and Impl. of a Campus N/w and Computing Infrastructure through the DEP program at IIT Bombay. It is a case study of IIT Bombay's experience with recommendations to other universites and colleges. I'm a big fan of Gnu/Linux and Free Software and along with IBM and CDAC have helped to set up at Mumbai OSSRC (Open Source Software Resource Centre) Here are the slides (PDF) of a talk I gave on Feb 15, 2003 on IIT Bombay's Network: Role of GNU/Linux at the Symbiosis Institute, Pune. I love to play chess and to listen to carnatic music. PDF Slides of an introductory leture on Cryptographic Protocols and Security and Postscript slides of a lecture on Internet Security and Cryptographic Protocols that I gave under the IEEE Distinguished Lecturer Program, at several universities in Australia and NewZealand in May-June 2002. If your browser supports Unicode, you'll see my name in Tamil ( சிவகுமார் ) and Sanksrit/Hindi ( शिवकुमार ) For the unicode challenged, images are provided G Sivakumar (siva [@] iitb. ac. in) Mumbai time is now Mon 01st Dec,2025 10:42 am",
  "content_length": 2544,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:22"
}