{
  "name": "Ga Wu",
  "homepage": "https://web.cs.dal.ca/~gaw",
  "status": "success",
  "content": "Applied Machine Learning Research Lab Ga Wu Assistant Professor Faculty of Computer Science Dalhousie University Follow Nova Scotia, Canada GitHub Google Scholar Welcome to the Applied Machine Learning Research Lab Mission: The Applied Machine Learning Research Lab (DAMLR) envisions a synergistic collaboration with industrial partners and research institutes to advance the frontiers of theoretical machine learning and AI research. Focused on pivotal areas such as data representation learning, AI safety, generative AI, and explainable AI, the lab aims to foster innovation through a multidisciplinary approach. By uniting the practical insights of industry with the pioneering theories of academia, the lab seeks to develop robust frameworks and methodologies that push the boundaries of what AI can achieve. Our lab’s mission is to ensure that advancements in AI are not only cutting-edge but also safe, interpretable, and beneficial across various applications. Would love to collaborate with us? please visit Partners tag. Research Areas: Machine Learning and Large-scale Data Analysis, Artificial Intelligence (AI), Information Retrieval, Social Media, Recommender Systems, AI Support to Mental Health, Auto-pilot System, and other Large-scale ML Applications. Hiring: Our lab has one PhD student openings currently. The positions are full-funded. If you are students with 1) CS background, 2) GPA>3.8, 3) a Master degree, and 4) interested NLP research, please email Dr. Wu with your CV and research proposal. Please go to the Prospective Student tab for the further hiring requirements. Special call - Fall 2025 Hiring one PhD student for working with our industry partners in the field of 1) computer vision (object detection) on low-power device and 2) leading big data infrastructure design for large corporation. If you are interested in the special call, please contact Dr.Wu ASAP. The requirement of PhD student hiring is same as regular PhD student track. News: Post-doc, Mahtab Sarvmaili, is appointed as Assistant Professor at University of New Brunswick, 2025/11/08 Master student, Naihe Feng, has one paper accepted by SIGIR-2025. Success in NSERC RTI competition, NSERC, 2025/04/17 Research project received Mitacs Elevate grant, Mitacs & Harrison Healthcare, 2025/03/14 PhD candidate (now post-doc), Mahtab Sarvmaili, has one paper accepted by ICLR-2025. Research project received Mitacs Elevate grant, Mitacs & Obruta Space Solution, 2025/02/14 Research project received Transforming Climate Action Research Program (TCA) support, 2025/01/28 Recent Posts",
  "content_length": 2579,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:23"
}