{
  "name": "Gabor Fichtinger",
  "homepage": "http://www.cs.queensu.ca/~gabor",
  "status": "success",
  "content": "Gabor Fichtinger, Dr. Univ. Professor and Canada Research Chair (Tier 1) in Computer-Integrated Surgery School of Computing, w/ cross appointments in Surgery, Pathology and Molecular Medicine, Mechanical and Materials Engineering, Electrical and Computer Engineering Queen's University, Kingston, Ontario, Canada Fellow of RSC (Royal Society of Canada) Fellow of IEEE (Institute of Electrical and Electronics Engineers) Fellow of AIMBE (American Institute for Medical and Biological Engineering) Fellow of MICCAI (Medical Image Computing and Computer Assisted Interventions) Adjunct Professor of Medical Physics and Biomedical Engineering, Medical University of Vienna, Austria Adjunct Professor of Computer Science and Radiology and Radiological Science Johns Hopkins University, Baltimore, MD, USA Adjunct Research Professor of Medical Biophysics Western University, London, ON, Canada Affiliated Faculty, The Techna Institute University Health Network and University of Toronto, Canada Honorary University Professor, Obuda University, Budapest, Hungary My research and teaching interest is Computer-Assisted Surgery and Interventions. This is a fascinating and complex field that covers medical imaging, image computing, scientific visualization, surgical planning and navigation, robotics, biosensors and, perhaps most importantly, integration of all these into workable clinical systems and translating them to clinical use. I further specialize in minimally invasive percutaneous (through the skin) interventions performed under image guidance, with primary application in the detection and treatment of cancer. For details, please visit my Laboratory for Percutaneous Surgery, or as we call it affectionately: the Perk Lab, online. Those who have a high tolerance for boredom can read my entire biography (in PDF format) here, in its ostentatiously long incarnation. Copies of my publications are available online through the Perk Lab. Open positions for students, postdocs and research engineers are available online through the Perk Lab. CONTACT INFORMATION Gabor Fichtinger, Dr. Univ. Professor and Cancer Care Ontario Research Chair Queen's University, School of Computing, 25 Union St, 557 Goodwin Hall Kingston, ON, Canada, K7L 3N6 Office +1 (613) 533-3258 Admin +1 (613) 533-6050 Email: fichting@queensu.ca Website: http://perk.cs.queensu.ca",
  "content_length": 2355,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:28"
}