{
  "name": "Gabriele von Voigt",
  "homepage": "https://www.chi.uni-hannover.de/vonvoigt.html",
  "status": "success",
  "content": "Computational Health Informatics – Institut für Data Science – Leibniz Universität Hannover Fakultät Fakultät für Elektrotechnik und Informatik English Start Kontakt English Institut für Data Science Computational Health Informatics Team Forschung Studium und Lehre Kontakt und Anfahrt Computational Health Informatics Das Fachgebiet Computational Health Informatics (CHI) ist Teil des Instituts für Data Science in der Fakultät für Elektrotechnik und Informatik. Geleitet wird das Fachgebiet von Prof. Dr.-Ing. Gabriele von Voigt. Mehr lesen ... × Computational Health Informatics Das Fachgebiet Computational Health Informatics (CHI) ist Teil des Instituts für Data Science in der Fakultät für Elektrotechnik und Informatik. Geleitet wird das Fachgebiet von Prof. Dr.-Ing. Gabriele von Voigt. Forschungsthemen Die Forschungsthemen liegen in den Bereichen: Computational Health Informatics Mobile medizinische Anwendungen Sicherheit in der Verarbeitung von medizinischen Daten Deep Learning für medizinische Anwendungen Team Kontaktdaten aller Personen des Fachgebiets Forschung Forschungthemen, Projekte, Publikationen Studium und Lehre InformatiCup 2024 Die Veranstaltung  \"Programmier-Challenge\" des Fachgebiets CHI  ermöglicht es Studierenden der Leibniz Universität Hannover, sich die Teilnahme am Studierendenwettbewerb InformatiCup der Gesellschaft für Informatik im Form von Leistungspunkten anrechnen zu lassen. Der InformatiCup findet seit 2006 jährlich statt und wird von renommierten Unternehmen unterstützt. Im diesjährigen InformatiCup gelang es einem Team der Informatik der Leibniz Universität Hannover, den ersten Platz zu erreichen. Wir gratulieren dem Gewinnerteam von Herzen. Einen Artikel über das Finale des InformatiCups gibt es hier. Weitere Informationen zum InformatiCup sind hier zu finden. GHCon 2023 Die GHCon 2023 ist beendet. Unter heise online wurde ein Artikel über die Konferenz veröffentlicht und kann unter folgendem Link gelesen werden: https://www.heise.de/news/GNU-Health-Konferenz-Von-persoenlichen-Gesundheitsakten-bis-zum-DICOM-Server-9321929.html Adresse und Anfahrt Kontakt weitere Links TIB L3S Stud.IP Vorlesungsverzeichnis Standortfinder Semestertermine Letzte Änderung: 08.05.24 Druckversion So erreichen Sie uns Kontakt Kontakt © 2025: Leibniz Universität Hannover Impressum Datenschutz Barrierefreiheit Sitemap Computational Health Informatics Allgemeine Übersicht Computational Health InformaticsTeamForschungStudium und LehreKontakt und AnfahrtFakultät für Elektrotechnik und InformatikKontakt",
  "content_length": 2546,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:41"
}