{
  "name": "Gabriel J. Brostow",
  "homepage": "http://www0.cs.ucl.ac.uk/staff/g.brostow",
  "status": "success",
  "content": "Gabriel Brostow Homepage at UCL University College London I'm Gabriel Brostow, and I am a professor in Computer Science here at UCL. You can also find me on Google Scholar, BlueSky, and LinkedIn. My group explores blue-sky research problems in AI, especially Computer Vision and Human Computer Interaction (HCI). My students and colleagues have diverse interests, mostly aligned around \"Human in the Loop AI.\" This largely fits in the field now known as Human-Centered AI (check out Ben Shneiderman's book!). I love this field because it allows us to apply our expertise to a variety of tough tasks. That includes assistive technology for everyday life, and super-tools for professionals making graphics e.g. film makers/architects, roboticists, or scientists studying people, animals, cells, or entire environments. I also have a special interest in authoring systems (for architecture, animation, presentations) that make the most of user effort. I split my time between UCL and Niantic, the company behind Pokémon GO. At Niantic, I'm the Chief Research Scientist and Senior Director of the famous R&D Team. Before UCL, I did postdocs with Marc Pollefeys in ETH Zurich's CVG Group, and a Marshall Sherfield Fellowship in Roberto Cipolla's Computer Vision & Robotics Group at Cambridge University. I did my PhD with Irfan Essa at Georgia Tech, and my BS in Electrical Engineering at UT Austin. News: (Dec 2024) My students Skanda Koppula and Omiros Pantazis just presented their NeurIPS papers in Vancouver: Tapvid-3d: A Benchmark for Tracking Any Point in 3D INQUIRE: A Natural World Text-to-Image Retrieval Benchmark (Oct 2024) We had two papers at ECCV 2024 in Milan. Go Gizem and the team helmed by Mohamed! GroundUp: Rapid Sketch-Based 3D City Massing DoubleTake: Geometry Guided Depth Estimation (June 2024) We presented AirPlanes at CVPR 2024 in Seattle. (May 2024) Jess presented Don't Look Now at CHI 2024 in Honolulu. Congratulations on getting Best Paper Honorable Mention! Vacancies: Here are the vacancies in my direct “orbit”, along with advice and personal opinions (not UCL’s obviously). And please note the action items for each! Just getting started? Please don't get one-itis, so apply to multiple institutions, and see my encouragment to persist. Show Vacancies Graduate Students: Ross Murphy (PhD) Skanda Koppula (PhD) Gizem Unlu (PhD) Omiros Pantazis (PhD) Jamie Watson (PhD) Alumni: Dr. Mohamed Sayed (PhD) Dr. Stephan Garbin (PhD) Show More Research: (or see Google Scholar). S. Koppula, I. Rocco, Y. Yang, J. Heyward, J. Carreira, A. Zisserman, G. Brostow, C. Doersch, \"Tapvid-3d: A Benchmark for Tracking Any Point in 3D,\" NeurIPS 2024 - Project Page E. Vendrow, O. Pantazis, A. Shepard, G. Brostow, K.E. Jones, O. Mac Aodha, S. Beery, G. Van Horn, \"INQUIRE: A Natural World Text-to-Image Retrieval Benchmark,\" NeurIPS 2024 - Project Page J. Watson, F. Aleotti, M. Sayed, Z. Qureshi, O. Mac Aodha, G. Brostow, M. Firman, S. Vicente, \"AirPlanes: Accurate Plane Estimation via 3D-Consistent Embeddings,\" CVPR 2024 - Project Page J. Van Brummelen, L.P. Urwin, O.J. Johnston, M. Sayed, G. Brostow, \"Don't Look Now: Audio/Haptic Guidance for 3D Scanning of Landmarks,\" CHI 2024 - Project Page M. Sayed, F. Aleotti, J. Watson, Z. Qureshi, G. Garcia-Hernando, G. Brostow, S. Vicente, M. Firman, \"DoubleTake: Geometry Guided Depth Estimation,\" ECCV 2024 - Project Page G.E. Ünlü, M. Sayed, Y. Gryaditskaya, G. Brostow, \"GroundUp: Rapid Sketch-Based 3D City Massing,\" ECCV 2024 - Project Page Show More Teaching: Lecturing: Computer Vision (known as Machine Vision COMP0137): each October-December, so Term 1. Enrolled students can find all lectures and materials on Moodle. Projects for MSc's: Internal-only link to view the slides is here. (Note which academic year! You must be browsing from within the UCL domain). Show More Contact Details: brostow .at. cs.ucl.ac.uk Prof. Gabriel Brostow UCL Department of Computer Science Gower Street London WC1E 6BT United Kingdom Office #209, 169 Euston Rd, London Follow me on: BlueSky, Twitter, LinkedIn.",
  "content_length": 4076,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:30"
}