{
  "name": "Gabriel Taubin",
  "homepage": "http://mesh.brown.edu/taubin",
  "status": "success",
  "content": "Gabriel Taubin @ Brown / BIO Gabriel Taubin Professor of Engineering and Computer Science School of Engineering Group Publications Patents Professional Teaching Contact GOOGLE SCHOLAR PROFILE 3D PHOTOGRAPHY COURSES REVEAL DIGITAL ARCHAEOLOGY OVERVIEW VIDEO REVEAL ANALYZE SOFTWARE DOWNLOAD SMOOTH SIGNED DISTANCE SURFACE RECONSTRUCTION PROJECT SITE PROJECTOR CAMERA CALIBRATION PROJECT SITE NON-CONVEX HULL SURFACES PROJECT SITE EMBEDDED PHASE SHIFTING PROJECT SITE UNSYNCHRONIZED STRUCTURED LIGHT PROJECT SITE OLDER PROJECTS Prof. Taubin is a Professor of Engineering and Computer Science at Brown University. He earned a Licenciado en Ciencias Matemáticas degree from Universidad de Buenos Aires, Argentina, and a Ph.D. degree in Electrical Engineering from Brown University. In 1990 he joined IBM Research, where he held various positions, including Research Staff Member and Research Manager. He joined the Brown University School of Engineering as a Faculty member in 2003. Prof. Taubin was named IEEE Fellow for his contributions to the development of three-dimensional geometry compression technology and multimedia standards. While on sabbatical from IBM during the 2000-2001 academic year, Prof. Taubin was appointed Visiting Professor of Electrical Engineering at the California Institute of Technology. While on sabbatical from Brown during the Spring semester of 2010, Prof. Taubin was appointed Visiting Associate Professor of Media Arts and Sciences at MIT. During this time he was associated with the Camera Culture Group, MIT Media Lab. Prof. Taubin served as Editor-in-Chief of the IEEE Computer Graphics and Applications Magazine from 2010 to 2013, as a member of the Editorial Board of the Geometric Models journal, and as associate editor of the IEEE Transactions of Visualization and Computer Graphics. Prof. Taubin's main research interests fall within the following disciplines: Applied Computational Geometry, Computer Graphics, Geometric Modeling, 3D Photography, and Computer Vision. His research has always been related to the development of efficient, simple, and mathematically sound algorithms to capture and operate on 3D objects represented as polygonal meshes. During his tenure at IBM he emphasised technologies to enable the use of 3D models for Web-based applications. At Brown his research spanned smart cameras, embedded systems, visual sensor networks, and digital archaeology. His current research projects emphasize low cost precise 3D scanning systems, 3D scanning for 3D printing, industrial applications of 3D scanning systems, and more generally digital fabrication.",
  "content_length": 2612,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:33"
}