{
  "name": "Gabriel Terejanu",
  "homepage": "http://www.UncertaintyQuantification.org",
  "status": "success",
  "content": "Uncertainty Quantification (UQ)Search this siteEmbedded FilesSkip to main contentSkip to navigation Welcome to UQ Lab! Causal AI and Uncertainty Quantification (UQ)Powering decision intelligence under uncertainty at scale.Prostate Cancer Disparities in Charlotte Metro AreaOur analysis shows that prostate cancer patients from lower socioeconomic status (SES) backgrounds are more likely to be diagnosed with high-risk prostate cancer. Age was the strongest predictor, while SES had a greater impact than race.https://doi.org/10.1245/s10434-024-15675-1 Atrium HealthInvariant NASCAR Tire ModelingIn this project, we utilize the invariance principle to scale tire models that optimize race car performance by aligning with both controlled experimental data and track data obtained using Wheel Force Transducers (WFT). The goal is to develop models that agree with data across multiple environments.Toyota Racing DevelopmentModeling the \"Why\" in Business OperationsBusinesses collect vast amounts of data, which they leverage with advanced modeling techniques to develop actions to enhance their operations. The goal is to create an AI engine that provides managers with actionable recommendations to produce a desired effect on key performance indicators. Lowe's Innovation FundAflatoxin Prediction in Standing CropsThe goal of this project is to develop a general predictive modeling framework for calculating mycotoxin incidence in US crop fields. Prediction and control of the most potent carcinogenic mycotoxin, aflatoxin, is a fundamental challenge for US grain industry, poultry producers, and makers of dairy products.  NIFA/USDA 2017-67017-31654 Causal Modeling of Affective PolarizationThe objective of this project is the development of an interactive causal modeling framework to understand affective polarization. The focus is on bridging the gap between data-driven methods for discovering causal relations and expert domain knowledge to mitigate the impact of data limitations.ARO W911NF-22-1-0035Deep Learning for Surface Chemistry In this project, we are using computational catalysis and deep learning to improve the analysis and understanding of surface chemistry. We will use large datasets of DFT energies and advanced neural networks to identify invariant material and molecular descriptors that can help us predict the behavior of chemical systems.NSF 2218841Robust Machine Learning via Gradient ConsistencyMachine learning models often fail when faced with unexpected data. We introduce CGLearn, a method that improves robustness by selecting features whose gradients remain consistent across datasets or data subsets. These consistent gradients highlight stable, causal relationships, enabling better predictions on unseen data.https://arxiv.org/abs/2411.06040 Concept-Driven NOTEARS (CD-NOTEARS)CD-NOTEARS extends the widely-used NOTEARS method by incorporating concept-level prior knowledge to impose causal structure on concepts rather than raw high-dimensional data. Our approach, evaluated on synthetic, benchmark, and real-world datasets, outperforms the original NOTEARS, offering a powerful tool for causal discovery in scenarios where concept-level causality is critical.https://doi.org/10.1109/ICMLA58977.2023.00118 Invariant Molecular RepresentationsThe study introduces a machine learning method with Siamese neural networks to efficiently predict adsorption energies, using data from multiple density functional theory (DFT) functionals, significantly enhancing accuracy and robustness in catalyst screening, especially for propane dehydrogenation on platinum catalysts.https://doi.org/10.1021/acs.jcim.3c00594 Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3720,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:34"
}