{
  "name": "Gabriele Bavota",
  "homepage": "http://search.usi.ch/people/e63382729ce424274797f0c45f4bc7e8/Bavota-Gabriele",
  "status": "success",
  "content": "Bavota, Gabriele | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Gabriele Bavota http://usi.to/ww6 Biography Gabriele Bavota received (cum laude) the Laurea in Computer Science from the University of Salerno (Italy).  He received the PhD in Computer Science from the University of Salerno in 2013. From January 2013 to October 2014 he has been a research fellow at the Department of Engineering of the University of Sannio. From November 2014 to August 2016 he was Assistant Professor at Free University of Bolzano-Bozen. He joined the Faculty of Informatics of USI as an Assistant Professor in September 2016, and is currently Full Professor. His research interests include software maintenance and evolution, mining software repositories, and empirical software engineering. He is author of over 180 papers appeared in international journals and conferences. He is the recipient of the 2018 ACM Sigsoft Early Career Researcher Award for outstanding contributions in the area of software engineering as an early career investigator. He is the Principal Investigator of the DEVINTA ERC Starting Grant, focused on investigating applications of Deep Learning to Software Engineering. He received four ACM Sigsoft Distinguished Paper awards at the three top software engineering conference: ASE 2013 and 2017, ESEC-FSE 2015, and ICSE 2015. He also received six additional best/distinguished paper awards at other venues. He served as a Program Co-Chair for ICPC 2016, SCAM 2016, SANER 2017, and ICSME 2023. He also serves and has served as organizing and program committee member of international conferences in the field of software engineering, such as ICSE, ESEC/FSE, ASE, ICSME, MSR, ICPC, SANER, SCAM, and others. More info at: https://www.inf.usi.ch/faculty/bavota/ Competence areas Intelligent Systems Mining Software Repositories Software Engineering Software Evolution Ultra large software systems Contact gabriele.bavota@usi.ch tel +41 58 666 4928 East Campus, Sector D, Office D3.08 (Level P3) Via la Santa 1, 6962 Lugano-Viganello Roles Faculty of Informatics Vice-dean Faculty of Informatics Full Professor Software Institute Links Website or personal page Social media X Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 2934,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:42"
}