{
  "name": "Gabriel Wittum",
  "homepage": "https://cemse.kaust.edu.sa/people/person/gabriel-wittum",
  "status": "success",
  "content": "Gabriel Wittum | Computer, Electrical and Mathematical Sciences and Engineering Skip to main content Gabriel Wittum Professor (former), Applied Mathematics and Computational Science Principal Investigator (former), Modelling and Simulation gabriel.wittum@kaust.edu.sa numerical methods computational fluid dynamics neuroscience environmental research Dr. Gabriel Wittum, professor of applied mathematics and computational science at KAUST, is an expert in modelling and simulating problems in empirical science. BiographyDr. Wittum obtained his Ph.D. (Dr. rer. nat.) in 1987 from Kiel University, Germany. He then pursued further academic qualifications at the University of Heidelberg, Germany, where he received his Habilitation in 1991 and began his first professorship in numerical analysis.His academic career continued to advance as he served as Director of the Institute for Computer Applications at the University of Stuttgart, Germany, from 1994 to 1998. Following this, he became the Director of the Simulation in Technology Center at the University of Heidelberg, Germany, a position he held from 1998 to 2008. In 2008, he transitioned to the University of Frankfurt, where he led the Gauss Center of Scientific Computing (G-CSC).After 25 years of serving as a professor at several leading universities in Germany, he joined KAUST, where he is currently a professor in the Applied Mathematics and Computational Science program.Wittum’s work developing robust and scalable multi-grid methods and software systems for large-scale computing has led to numerous collaborative projects with industry partners, including ABB, Boston Consulting, Commerzbank, Daimler-Benz, the GICON Group, GRS, Porsche and more. His contributions to science have been recognized with several prestigious awards, including the Heinz-Maier-Leibnitz Prize, the Controlled Release Society's Award and the doIT Software Award. Professor Wittum has also authored over 200 scientific publications. Research InterestsProfessor Wittum’s research focuses on a general approach to modelling and simulation of problems from empirical sciences, in particular using high-performance computing (HPC).Particular areas of focus include the development of advanced numerical methods for modelling and simulation, such as fast solvers like parallel adaptive multi-grid methods, allowing for application to complex, realistic models; the development of corresponding simulation frameworks and tools; and the efficient use of top-level supercomputers.Wittum applies his methods and tools toward problem-solving in computational fluid dynamics, environmental research, energy research, finance, neuroscience, pharmaceutical technology and beyond. Education Habilitation Numerical Analysis, Heidelberg University, Germany, 1991 Doctor rerum naturalium (Dr. rer. nat.) Applied Mathematics, Karlsruhe Institute of Technology, Germany, 1987 Diploma Mathematics and Physics, Karlsruhe Institute of Technology, Germany, 1983 Quote“Modelling and computing the world is what we aim at. To that end, we need fast, precise and efficient numerics and software.” Questions and Answers Why KAUST? After 25 years of serving as a professor at several universities in Germany, Dr. Wittum was interested in a new challenge. KAUST‘s vision as a hub for interdisciplinary research with a strong computational component convinced him to come to KAUST. As a computational scientist, his home in KAUST is CEMSE. Why modeling and simulations? Modeling and simulaiton are the root of mathematics. They have been introduced to understand things quantitatively. The whole of mathematics developed from that root. Dr. Wittum developed an approach allowing to simulate problems from the empirical sciences on top-scale computers. Foci are the development of advanced numerical methods for modeling and simulation in particular multigrid methods allowing the application to complex realistic models, the corresponding simulation frameworks and software tools. These methods and tools are applied to problems from Computational Fluid Dynamics, Environmental Research, Energy Technology, Finance, Neuroscience, Pharmaceutical Technology and many more. Related Sites Applied Mathematics and Computational Science (AMCS) Computer Science (CS) Center of Excellence for Generative AI (GenAI) Applied Mathematics School (AMS) Conference on Mathematical Science and Applications (CMSA) Flow Simulation at the Exascale (Exaflow) Modelling and Simulation (MaS) Apply for postgraduate study Start your application",
  "content_length": 4539,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:33"
}