{
  "name": "Gabriele Pergola",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/u1898418",
  "status": "success",
  "content": "Gabriele Pergola Skip to main content Skip to navigation Gabriele Pergola is an Assistant Professor at the Department of Computer Science.Research InterestsHis current research investigates the use of statistical models within machine learning for natural language processing and text understanding. He is particularly interested in topics related to sentiment analysis, question answering, topic and event extraction, and clinical text mining. More broadly, he is curious about the relationship between language and information.He was previously appointed as Research Fellow working with Prof. Yulan HeLink opens in a new window as part of the Event-Centric Framework for Natural Language Understanding, a Turing AI Acceleration Fellowship held by Prof. Yulan HeLink opens in a new window, and funded by the UKRI.He collaborates closely with law enforcement agencies and the Forensics Capability Network (FCN) to develop advanced NLP frameworks that enhance investigative capabilities. His projects include designing novel AI systems to detect messages related to violence against women and girls (VAWG) and analyzing drug-related communications and networks, designing and delivering cutting-edge NLP technology to professionals working on the front lines of public safety. In addition to his work with forensic analysis, he advises both law enforcement and the UK government as part of the Academic Advisory Group on Generative AI Detection R&D. He also collaborates with the Ministry of Housing, Communities & Local Government (MHCLG) on projects that leverage NLP for policy automation, as well as on separate projects analysing digital immigration systems to provide insights into migrant experiences and support informed policy-making.Reading groups Organiser of the NLP Discussion MeetingsLink opens in a new window of the NLP Group at the University of Warwick, gathering students and researchers interested in Natural Language Processing. Email me if interested in joining the meetings. Teaching CS918 Natural Language Processing - Module Leader (Term II, 2022/2023, 2023/2024, 2024/2025) CS918 Natural Language Processing - Module Organizer (Term I, 2021/2022) CS918 Natural Language Processing - Lab Demonstrations and Seminars (Term I in 2018/2019, 2019/2020, 2020/2021). CS909 Data Mining - Lab Demonstrations and Seminars (Term II in 2018/2019 and 2019/2020). CS331 Neural Computing - Seminars (2019/2020) EducationHe received his PhD degree in natural language understanding from the University of WarwickLink opens in a new window (UK) on \"Probabilistic Neural Topic Models for Text UnderstandingLink opens in a new window\". He holds a BSc and an MEng (cum laude) degree in Computer Engineering from the University of Palermo (Italy). Prior to joining Warwick, he received a Postgraduate Fellowship from the University of Rome \"La Sapienza\" (Italy) for designing and implementing machine learning systems to support access to cultural heritage as part of the research project \"Design and development of innovative technologies for the enjoyment of cultural heritage\".Awards and Recognitions 2022 - Turing Post-Doctoral Enrichment Scheme - Awarded by the Alan Turing Institute (ATI), London, UK. 2022 - PhD Thesis Prize - Faculty of Science, Engineering, and Medicine (SEM) Thesis Prize in Computer Science. Awarded by the University of Warwick, Coventry, UK. 2019 - Best Presentation - Prize in the Machine Learning and AI track, WPCCS 2019, University of Warwick. Research Projects 2025/26 - STAR funding by the NPCC - Collaborating with Cheshire Constabulary, Cheshire PCC, and the Forensic Capability Network.PI for the project: \"STARIST: Stalking Threat AI Recognition (and) Identification Support Tool\". In the news: BBC | BBC Manchester (Instagram) | Cheshire PCC BBC - \"Police force harnesses AI to help catch stalkers\" BBC Manchester - Video Segment Cheshire PCC – \"Cheshire leads the way with technology to help identify stalking behaviours sooner\" 2024/25 – Forensics Capability Network (FCN) – Collaborating with the University of Leeds.PI for the project: ‘AI-Driven Analysis of Digital Communications Enhancing the Analysis of Drug and VAWG Evidence’. 2024/25 – ESRC - Digital Good Research Fund - Collaborating with the Department of Sociology (Warwick), University of Leicester, University of Leeds.Co-PI for the project: ‘Digitising Identity: Navigating the Digital Immigration System and Migrant Experiences’. 2024 - Policy Support Fund - In collaboration with the Department for Levelling Up, Housing and Communities (DLUHC); Human Machine Intelligence Group, Cranfield University; Blavatnik School of Government, University of Oxford.Co-PI for the project: \"A Case Study of the Application of Natural Language Processing for Information Extraction and Analysis in Policy Review\" 2023/24 - STAR funding - Collaborating with NPCC and the Forensic Capability Network.PI for the project: \"Development of an NLP model to detect threatening and abusive language used in communication with victims\". In the News: AI that detects hate messages against women could also be turned on drug dealers | The IndependentLink opens in a new window | Daily MailLink opens in a new window | The StandardLink opens in a new window | MSNLink opens in a new window | FCN (2024)Link opens in a new window | FCN (2023)Link opens in a new window 2022/23 - RDF Science Development AwardPI for the project: \"An Event-Centric Dialogue System for Second Language Learners\". 2022 - National AI Strategy FundPI for the project: \"METU: An Inclusive AI-Powered Framework Making Text Easier to Understand\". Recent Invited Talks 2024 - “NLP Strategies for Drug Monitoring”, AI Technologies for Health and Wellbeing, Digital Spotlight, Warwick's Interdisciplinary Research Spotlights. 2024 - “NLP for Policy Analysis”, CAMaCS Town Hall day. 2023 - \"Large Language Models and The Key Ingredients Powering the Rise of Chatbots\" - Keele University 2023 - \"The not-so-silent AI revolution: Chatbots and their Impact on Engaging Education\" - Department of Psychology - University of Warwick Publications2025 Sahrish Khan, Arshad Jhumka, and Gabriele Pergola. Explaining Matters: Leveraging Definitions and Semantic Expansion for Sexism Detection. The 2025 Annual Meeting of the Association for Computational Linguistics (ACL), Oral Presentation, 2025. Zhaoyue Sun, Jiazheng Li, Gabriele Pergola, and Yulan He. ExDDI: Explaining Drug‑Drug Interaction Predictions with Natural Language. The AAAI Conference on Artificial Intelligence, 2025. Brittany Clay, Hannah I. Bergman, Saad Salim, Gabriele Pergola, Jonathan Shalhoub, and A. H. Davies. Natural Language Processing Techniques Applied to the Electronic Health Record in Clinical Research and Practice – An Introduction to Methodologies. In Computers in Biology and Medicine, vol. 188, 109808, 2025. Xingwei Tan, Chen Lyu, Hafiz M. Umer, Sahrish Khan, Meenatchi Parvatham, Lois Arthurs, Simon Cullen, Shelley Wilson, Arshad Jhumka, and Gabriele Pergola. SafeSpeech: A Comprehensive and Interactive Tool for Analysing Sexist and Abusive Language in Conversations. The North American Chapter of the Association for Computational Linguistics: Human Language Technologies – System Demonstrations (NAACL), 2025, Meenatchi Parvatham, Xiaoyang Tan, Gabriele Pergola, and Chiara Gambi. Conversational Interest between Teachers and Second Language Learners Evaluated by Humans and LLMs. OSF Preprint, 2025. 2024 Chen Lyu and Gabriele Pergola. SciGisPy: a Novel Metric for Biomedical Text Simplification via Gist Inference Score. In Proceedings of the Third Workshop on Text Simplification, Accessibility and Readability (TSAR) at EMNLP, 2024. Chen Lyu and Gabriele Pergola. Society of Medical Simplifiers. In Proceedings of the Third Workshop on Text Simplification, Accessibility and Readability (TSAR) at EMNLP, 2024. E. Alzaid, G. Pergola, H. Evans, D. Snead, and F. Minhas. Large Multimodal Model-Based Standardisation of Pathology Reports with Confidence and Its Prognostic Significance. The Journal of Pathology: Clinical Research, Volume 10, Issue 6, 2024. X. Tan, Y. Zhou, G. Pergola and Y. He. Cascading Large Language Models for Salient Event Graph GenerationLink opens in a new window. arXiv:2406.18449, 2024. A. Bobrov, D. Saltenis, Z. Sun, G. Pergola and Y. He. DrugWatch: A Comprehensive Multi-Source Data Visualisation Platform for Drug Safety Information. The 62nd Annual Meeting of the Association for Computational Linguistics (ACL), 2024. X. Tan, Y. Zhou, G. Pergola and Y. He. Set-Aligning Framework for Auto-Regressive Event Temporal Graph GenerationLink opens in a new window. 2024 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL), 2024 D. Valdes, R. Procter, G. Pergola. A novel NLP task and generative AI application to understand collective leadership from board text data. In Proceedings of the Workshop of LatinX in AI (LXAI) Research at ICML, 2024. S. Khan, G. Pergola, A. Jhumka. Multilingual Sexism Identification via Fusion of Large Language ModelsLink opens in a new window. In Working Notes of CLEF 2024 - Conference and Labs of the Evaluation Forum (CLEF), 2024.Note: Our two models ranked 1st and 2nd for Task 1 in the English segment (Team: EquityExplorer). Z. Sun, J. Li, G. Pergola, B.C. Wallace, and Y. He. Leveraging ChatGPT in Pharmacovigilance Event Extraction: An Empirical StudyLink opens in a new window. The 18th Conference of the European Chapter of the Association for Computational Linguistics (EACL), 2024 M. Albarrak, G. Pergola, A. Jhumka. U-BERTopic: An Urgency-Aware BERT-Topic Modeling Approach for Detecting CyberSecurity Issues via Social Media. The First International Conference on Natural Language Processing and Artificial Intelligence for Cyber Security (NLPAICS), 2024. 2023 L. Zhu, R. Zhao, G. Pergola and Y. He. Disentangling Aspect and Stance via a Siamese Autoencoder for Aspect Clustering of Vaccination Opinions. Findings of ACL, 2023. X.",
  "content_length": 19742,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:38"
}