{
  "name": "Gabriela Nicolescu",
  "homepage": "https://www.polymtl.ca/expertises/nicolescu-gabriela",
  "status": "success",
  "content": "Nicolescu, Gabriela | Répertoire des expertises Aller au contenu principal Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission Visitez-nous! Faire un don © Polytechnique Montréal 2025. Poly Bottin Cours Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission © Polytechnique Montréal 2025. Répertoire des expertises Nicolescu, Gabriela Poly Bottin Cours English Répertoire des expertises Nicolescu, Gabriela Répertoire des expertises Retour aux résultats de recherche Modifier ma ficheAide Publications Lien(s) Gabriela Nicolescu Publications Lien(s) Directrice de département Département de génie informatique et génie logiciel Professeure titulaire Département de génie informatique et génie logiciel Tél. : (514) 340-4711 poste 5434 Téléc. : (514) 340-5139 Local : M-4125.1 gabriela.nicolescu@polymtl.ca Domaines d'expertise Conception de systèmes d'information Systèmes et réseaux multimédias Systèmes intégrés à très grande échelle (VLSI) Cybersécurité Pôle d'excellence principal Nouvelles frontières en technologies de l'information et communications Pôle(s) d'excellence secondaire(s) Industrie du futur et société numérique Modélisation et intelligence artificielle Intérêts de recherche et affiliations Intérêts de recherche À travers mes travaux de recherche je m'intéresse aux domaines suivants: Sécurité avionique, sécurité des systèmes cyberphysiques Modèles de programmation avencés pour les systèmes parallèles multi-core ou many-core avionique Modélisation, simulation et exploration de l'espace de solutions pour la conception des systèmes avancés intégrant des technologies modernes tel que les systèmes sur puce 3D, les réseaux sur puce, les systèmes hétérogènes opto-electr-mécaniques. Affiliation(s) Chaire de recherche en cybersécurité des systèmes d’aéronefs, Titulaire LAMA-WeST (Web, Sémantique et Texte), Membre collaboratrice Type(s) d'expertises (sujets CRSNG) 2710 Conception de systèmes d'information 2721 Systèmes et réseaux multimédias 2722 Systèmes intégrés à très grande échelle (VLSI) Publications Publications récentes Communication de conférence Destras, O., Gohring de Magalhaes, F., Le Beux, S., & Nicolescu, G. (avril 2025). All-Optical Reconfigurable Activation Function Based on Saturable Absorption [Communication écrite]. 26th International Symposium on Quality Electronic Design (ISQED 2025), San Francisco, CA, USA. Article de revue Ngamboe Mvogo, M. S., Niu, X., Joly, B., Biegler, S. P., Berthier, P., Benito, R., Rice, G., Fernandez, J. M., & Nicolescu, G. (2025). CABBA: Compatible Authenticated Bandwidth-efficient Broadcast protocol for ADS-B. International Journal of Critical Infrastructure Protection, 48, 100728 (17 pages). Article de revue Moslah, M. M., Zouari, R., Shahnejat Bushehri, A., Gohring de Magalhaes, F., & Nicolescu, G. (2025). Investigation of the Adversarial Robustness of End-to-End Deep Sensor Fusion Models. IEEE Embedded Systems Letters, 17(5), 325-328. Communication de conférence Hamel, J., Gohring de Magalhaes, F., & Nicolescu, G. (juin 2025). On the Exploration of Post-Quantum Algorithms on COTS-Based Avionic Architectures [Communication écrite]. 23rd IEEE Interregional NEWCAS Conference (NEWCAS 2025), Paris, France. Voir toutes les publications (153) Biographie Gabriela Nicolescu a obtenu son B.Sc.A. (spécialisation en électronique) en 1998 et sa maitrise à l'Université Polytechnique de Bucharest en 1999. Elle soutient sa thèse de doctorat en novembre 2002 et devient Docteur en Microélectronique de l'Insitut National Polytechnique de Grenoble. Elle reçoit ensuite le prix de la meilleure thèse en micro-électronique de l'année 2003. Ensuite elle obtient une bourse CRSNG-OTAN pour un postdoc à L'université de Montréal en collaboration avec la compagnie STMicroelectronique. En août 2003, elle devient professeur à l'École Polytechnique de Montréal. En juin 2011, elle a été nommé professeur titulaire. Les intérêts de recherches de Gabriela Nicolescu portent sur le méthodes de conception, la programmation et la sécurité des systèmes avancés intégrant des technologies moderne comme l'intégration 3D, les réseaux optiques ou les MEMS (Micro-Electro-Mechanical Systems). Dr.Nicolescu est membre de l'Ordre des Ingénieurs du Québec (OIQ),  de Institute of Electrical and Electronics Engineers (IEEE) et u Regroupement Strategique en Microsystèmes du Québec (ReSMiQ). Enseignement Analyse et conception des Systèmes temps-réel Logique des Systèmes Numériques Encadrement à Polytechnique EN COURS Stage post-doctoral (1) Magalhaes, Felipe. Systeme temp-rèel multi-core pour les systèmes avioniques. Doctorat (6) Carayol, Julien. Test de pénétration basé sur l'intelligence artificielle. Khaled, Kacem. Sécurité des algorithmes AI dans les voitures autonomes rithmes. Torres, Alexy. Réduction des interferences dans les systèmes multi-processeurs pour avionique. Lefoul, Jean-Baptiste. Nouvel algorithme intelligent pour la génération automatique des application de test pour la conception efficace des systèmes multi-processeurs sur puce. Moslah, Marwen. Sécurité des système autonomes intelligents. Bucur, Cristi. Nouvelles approches de sécurité dans les systèmes de calcul périphérique. Maîtrise recherche (2) Ben Salem, Aymen. Nouvelle approche pour la réduction des interferences dans les systèmes avioniques à base de multi-processeurs. Picot, Rodolphe Laurent Louis. Sécurité dans un écosystème intelligent renforcé par des drones et robots. TERMINÉ Thèse de doctorat (13) Amaral Misson, H. (2024). Towards Reliable and Efficient Safety-Critical Systems: A DO-178C Framework for UAV Development [Thèse de doctorat, Polytechnique Montréal]. Khaled, K. (2024). Robustness of Deep Learning Models against Extraction Attacks [Thèse de doctorat, Polytechnique Montréal]. Shahnejat Bushehri, A. (2024). Towards Sustainable IoT in Energy-Constrained Edge Networks: Context-aware Anomaly Detection Frameworks Using an Efficient Data Collection Approach [Thèse de doctorat, Polytechnique Montréal]. Torres Aurora Dugo, A. (2023). Mitigation of Hardware Interferences in Safety-Critical Multicore Systems [Thèse de doctorat, Polytechnique Montréal]. Ayari, R. (2018). Optimization and Mining Methods for Effective Real-Time Embedded Systems [Thèse de doctorat, École Polytechnique de Montréal]. Hafnaoui, I. (2018). Handling Information and its Propagation to Engineer Complex Embedded Systems [Thèse de doctorat, École Polytechnique de Montréal]. Gohring de Magalhaes, F. (2017). High-Level Modelling of Optical Integrated Networks-Based Systems with the Provision of a Low Latency Controller [Thèse de doctorat, École Polytechnique de Montréal]. Elmahi, O. (2016). Verification of the Performance Properties of Embedded Streaming Applications via Constraint-Based Scheduling [Thèse de doctorat, École Polytechnique de Montréal]. Ben Cheikh, T. L. (2015). Parallelization Strategies for Modern Computing Platforms: Application to Illustrative Image Processing and Computer Vision Applications [Thèse de doctorat, École Polytechnique de Montréal]. Fourmigue, A. (2014). Méthodes de calcul numérique pour la simulation thermique des circuits intégrés [Thèse de doctorat, École Polytechnique de Montréal]. Tapp, M. (2013). Automating System-Level Data-Interchange Software Through a System Interface Description Language [Thèse de doctorat, École Polytechnique de Montréal]. Gheorghe, L. (2009). Continuous/Discrete Co-Simulation Interfaces from Formalization to Implementation [Thèse de doctorat, École Polytechnique de Montréal]. Girodias, B. (2009). Optimisation des mémoires dans le flot de conception des systèmes multiprocesseurs sur puces pour des applications de type multimédia [Thèse de doctorat, École Polytechnique de Montréal]. Mémoire de maîtrise (24) de Malefette, C. (2025). Améliorer la confiance envers les outils d'IA pour sécuriser les communications avioniques avec l'IA eXplicable [Mémoire de maîtrise, Polytechnique Montréal]. Yaich, H. (2024). Architecture sécuritaire des réseaux de drones : conception intégrée et algorithme d'agrégation pour une transmission de données sécuritaire [Mémoire de maîtrise, Polytechnique Montréal]. Dansereau, C. (2023). Deep Reinforcement Learning for Environment-Aware Mapless Navigation [Mémoire de maîtrise, Polytechnique Montréal]. Hamel, J. (2023). Performance Evaluation of Post-Quantum Cryptography in Avionic Communication [Mémoire de maîtrise, Polytechnique Montréal]. Marrocco, J.-S. (2023). TRIPT-IDS: Triplet Loss Pre-Trained Transformer for Avionic Intrusion Detection System [Mémoire de maîtrise, Polytechnique Montréal]. Pourcel, L. (2023). Détection d'activités humaines par l'utilisation du CSI [Mémoire de maîtrise, Polytechnique Montréal]. Silva-Pinto, N.-G. (2023). Engin d'explication d'anomalies sur le bus ARINC 429 basé sur les ontologies [Mémoire de maîtrise, Polytechnique Montréal]. Soriano, N. (2023). Assessment of GPS Spoofing Defences for UAVs [Mémoire de maîtrise, Polytechnique Montréal]. Sreemathy Raj, A. (2023). On Personalization of Federated Learning [Mémoire de maîtrise, Polytechnique Montréal]. Stéphenne, C. (2023). Implémentation d'une architecture de routeur sécurisée à l'aide du Trusted Computing [Mémoire de maîtrise, Polytechnique Montréal]. Nazemi Gelian, M. (2022). A Design Approach for Efficient Inter-Camera Vehicle Tracking [Mémoire de maîtrise, Polytechnique Montréal]. Messoussi, O. (2021). Real-Time Vehicle Detection and Tracking From Surveillance Cameras in Urban Scenes [Mémoire de maîtrise, Polytechnique Montréal]. Destras, O. (202",
  "content_length": 17315,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:37"
}