{
  "name": "Gabriel Zachmann",
  "homepage": "http://www.informatik.uni-bremen.de/~zach",
  "status": "success",
  "content": "Gabriel Zachmann Gabriel Zachmann Business Address University of Bremen Department for Computer Science, Computer Graphics Group, Bibliothekstr. 5, room MZH 3480 28359 Bremen Germany Fon: +49 421 218 63 99 1 Fax: +49 421 218 64559 E-mail: zach   cs.uni-bremen.de Office hours (Sprechstunde): Mo 1800 - 1930 A note to students: If you need me to sign something (e.g., a form for the examination office), please hand it to Tanja Rethemeyer. You can later pick it up from her office. If you would like to make an appointment for an oral exam (short or long), please send an email to Tanja Rethemeyer. If you need to talk to me about possible acknowledgement of credits, please come to my office hours and bring all relevant documents, syllabi, slide copies, forms, etc. If you would like to enquire about possible thesis topics, please look at our research pages and the Thesis page, then come to me during my office hours, or talk to my PhD students, or talk to me right after lecture. You are welcome to suggest thesis topics of your own. If you need to send me an email, please try to be concise. If you have a question about my courses, it is probably easiest, if you give me a call during my office hours, or catch me right before or after any lecture. Bio / Profile Short Bio, Lebenslauf in 200 Wörtern, Bio in 200 words, 3-Page CV. My Google Scholar profile (including h-index) My Erdös Number = 4 (see MR Collaboration Distance). Professional Services Member of organization committees of several conferences: EuroXR 2022 (program co-chair), EuroVR 2019 (posters co-chair), VRIPHYS 2017 and 2018 (general co-chair and program co-cochair), ACM Web3D 2018 (general), IEEE WorldHaptics 2017 (workshops/tutorials), IEEE VR 2018 and 2019 (posters), ICAT-EGVE 2016 (demos), Member of the Conference Committee of IEEE VR in various roles (e.g., videos chair, demos chair, tutorials chair, publications chair) since 2008, and a member of the program committee 2009--2017. Member of the Executive Board of the EuroXR Association (formerly, EuroVR) since its foundation in 2011. Also, member of EuroXR's Task Force for the Conference, and lead of the Task Force for hte XR Open Forum. Associate Editor of The Visual Computer Journal (Springer) Member of the ICAT International Steering Committee since 2014. Member of the Steering Committee for EGVE (Eurographics Workshop on Virtual Environments) since 2019. Member of the Steering Committee of VRIPHYS 2014-2019. Member of the task force \"Data Visualization and Data Analysis\" of the Data Mining Technical Committee (DMTC) of the IEEE Computational Intelligence Society (CIS) General Chair and Co-chair of the program committee of VRIPHYS 2015, together with Fabrice Jaillet. Editor of a Special Issue in Computers & Graphics 2015 and 2016 General Chair, co-chair of the program committee, local organizer, etc., of the 11th Workshop on Virtual Reality Interaction and Physical Simulation (VRIPHYS) 2014 in Bremen. General Chair, Chair of the program committee, local organizer, publications chair, etc., of the EuroVR conference 2014 in Bremen. General Co-Chair and local organizer of the co-located conferences 24th International Conference on Artificial Reality and Telexistence (ICAT 2014) and the 19th Eurographics Symposium on Virtual Environments (EGVE 2014) in Bremen. General Chair, Chair of the program committee, local organizer, publications chair, etc., of the GIVRAR-Workshop 2014 in Bremen. Member of the Review Panel in the Human Brain Project for the Competitive Call for additional project partners ; Jan 2014. External examiner for the M.Sc./P.Grad.Dip. program in Computer Science Interactive Entertainment Technology at the Trinity College Dublin, Ireland; 2013 - 2018. General Co-Chair of the VRIPHYS 2013. Member of the executive board (\"Leitungsgremium\") of the special interest group (SIG) on VR/AR of the German Computer Science Society ( GI-Fachgruppe VR/AR), 2013 - Vice-leader of the HapticSIG, a special interest group within the EuroVR. 2013 - 2015 Co-Chair (with David Feng) of the Scientific Visualization Contest 2013 of the IEEE VisWeek 2013. Co-Chair (with Jean Favre, Swiss National Supercomputing Center) of the Scientific Visualization Contest 2012 of the IEEE VisWeek 2012. Member of the review panel \"Information and Communication Technologies\" for the Cyprus Research Promotion Foundation (RPF) in Nicosia, Cyprus, in 2011 Co-Chair (with Jan Klein, MeVis) of the Scientific Visualization Contest 2011 of the IEEE VisWeek 2011. Area Chair / Associate Editor for Tack II: Virtual Reality and Medical Applications, at ICPR 2012. Organizer of the IEEE VR 2007 workshop \"Trends and Issues in Tracking for Virtual Environments\" at Charlotte, NC, US. Co-organizer and Co-Chair of the Program Committee of the Third Workshop of the GI VR/AR in 2006 Reviewer for numerous conferences (usually for many years) such as: Eurographics, ACM Siggraph, ACM CHI, IEEE VR, ICRA, IEEE Visualization, IEEE InfoVis, Eurographics Workshop on Virtual Environments (EGVE), Virtual Reality Software and Technology (VRST), ACM Web3D Symposium, World Haptics, EuroVR, Computer Graphics International (CGI), International Conference on Artificial Reality and Telexistence (ICAT), Vision, Modeling, and Visualization (VMV), Workshop on Virtual Reality, Interaction, and Physical Simulation (VRIPHYS), International Symposium on Visual Computing (ISVC), Symposium on 3D Data Processing, Visualization and Transmission (3dPVT), IEEE Symposium on Visual Analytics Science and Technology, International Symposium series on Tools and Methods of Competitive Engineering (TMCE), Cyberworlds, IFIP International Conference on Entertainment Computing (ICEC), Symposium on Virtual and Augmented Reality (SVR), International CAD/Graphics, WSCG, etc., And reviewer for many journals such as: J. of Computational Geometry & Applications, ACM Transactions on Visualization, ACM Transactions on Graphics, ACM Transactions on Haptics, IEEE Trans. on Visualization and Computer Graphics, Elsevier CG&A, Computer-Aided Design, ACM Computing Surveys, IEEE Transactions on Robotics, etc. Expert reviewer for the monitoring of EU STREP project 034691 Net-WMS within FP6 in 2007-2010. Member of the Kuratorium der Innovationsallianz Virtuelle Techniken (advisory board for the innovation alliance for virtual technologies) in 2009-2014. Member of the review panel \"Information and Communication Technologies\" for the Cyprus Research Promotion Foundation (RPF) in 2008-2009. I have also served many times as a reviewer for DFG, the German Science Foundation, and other funding agencies, such as the Israel Science Foundation (ISF), the Austrian Science Foundation (FFG), and the Estonian Research Council (ETAg), Investitions- und Strukturbank Rheinland-Pfalz (ISB), Bayerische Forschungsstiftung, Thüringer Ministerium für Wirtschaft, wissenschaft und digitale Gesellschaft (TMWWG). I was, of course, external examiner or referee of several PhD theses and candidates, both in Germany and Europe, e.g., for Technical University of Catalonia (UPC), Trinity College Dublin, Leibniz-University Hannover, University Koblenz, Bonn, Germany, etc. Dean of Studies (\"Studiendekan\") for the Faculty of Mathematics, Computer science, and mechanical engineering, Clausthal University, from 2008 until 2012. Services for academic affairs inside the university Head of the examination office for the study program Digital Media at University Bremen, since 2013. Member of the committee for the development of the study program Digital Media at University Bremen, since 2013. Dean of Studies (\"Studiendekan\") for the Faculty of Mathematics, Computer science, and mechanical engineering, Clausthal University, from 2008 until 2012. Projects For a list of current projects, please check the Research web page of my lab. The following list are some older projects. One of my passions is collision detection. Correction of tracking errors. VR System design and implementation (I have participated in the design and implementation of 3 VR systems) Virtual prototyping: AIT (EU project for building a demonstrator showing the usefulness of VR in automotive industries) Virtual Assembly Simulation (over many years, we developed an VAS application for BMW) Integration of VR and CAD (Robcad/Man) Volkswagen (VR system for automotive applications, including a virtual windtunnel) Shows: Detroit Auto Show (featuring immersive visualization of time-varying flow-fields) Miscellaneous shows (various exhibits, where we showed our VR system and our VR applications) Oldies During the years 2000 and 2001, I have helped start IGD's spin-off company VRCom (selling our VR system Virtual Design II) by giving all kinds of technical support and consulting. Image Manipulation using OpenGL Natural Interaction with Virtual Cities Publications My Google Scholar citations. The list below is fairly out-dated. Please check my group's Publications page for an up-to-date list. Note 1: all Postscript files are gzip'ed. Most of them are level 3. Most PDF files are level 1.4 (or higher). In case of problems, please don't hesitate to contact me. Note 2: The copyright for most of the above papers has been transferred to a publisher. The ACM and IEEE grant permission to make digital or hard copies of part or all of the works they publish for personal or classroom use. See any copyright notices on the individual papers for details. Adaptive Bitonic Sorting , in Encyclopedia of Parallel Computing, Springer, Padua, David (ed.), 2011, pages 146-157. Segmentation-Free, Area-Based Articulated Object Tracking , International Symposium on Visual Computing (ISVC), Las Vegas, NV, USA, 2011. 3-DOF vs. 6-DOF - Playful Evaluation of Complex Haptic Interactions , IEEE International Conference on Consumer Electronics (ICCE), Las Vegas, NV, USA, 2011. Inner Sphere Trees and Their Application to Collision Detection , Virtual Realities, Springer, 2011, pages 181-202; Sabine Coquillart and Guido Brunn",
  "content_length": 26534,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:38"
}