{
  "name": "Gagan Raj Gupta 0001",
  "homepage": "https://www.iitbhilai.ac.in/index.php?pid=gagan",
  "status": "success",
  "content": "Dr. Gagan Raj Gupta IIT Bhilai administration@iitbhilai.ac.in हिन्दी English A- A A+ Home Academic DepartmentsDepartment of Computer Science and EngineeringCSE Faculty Dr. Gagan Raj Gupta Dr. Gagan Raj Gupta Associate Professor, CSE Associate HoD, Mechatronics Office: Agastya Building (ED1)- Room 412 Department of Computer Science and Engineering Indian Institute of Technology (IIT), Bhilai EMAIL: gagan[AT]iitbhilai.ac.in Research Interest Activity-Based Learning: Designing activities to teach physics, mathematics, communication skills, computing, chemistry, biology to school students. (Video Channel). ML Systems: Large Language Models for Networks, Distributed Graph Neural Networks, Federated/Split Learning with low resource IoT devices (Telecom LLM). Multi-modal Learning and Medical Probes for Opthalmology, Dermatology, Dentistry Automated Root Cause Analysis using Time Series and/or Videos: For manufacturing Industries, Using EdgeML, Automated Surveillance, Operating Large Scale Software Systems Low Complexity Algorithms with Performance Guarantees I run the S3 research lab. You can find more details of our projects on lab page. We are looking for highly motivated PhD students to work in areas of Multi-modal learning, ML Systems, Automation/Cobotics, Medical Imaging and Devices . If you are interested, please email me and apply to IIT Bhilai PhD. program. Project staff and 6-month internships are also open. No short-term internships are currently available. I am a founding director of NetrAI, with a mission to bring quality health care to every neighborhood by developing novel medical diagnostic devices. We also conduct workshops to train volunteers to become effective teachers. For our recent AI workshop conducted for schools please visit: AI Workshop Academic Background PhD, ECE, Purdue University (2009) MS, CS, University of Wisconsin, Madison (2006) BTech, CSE, IIT Delhi (2005) Professional Experience Lead Architect, AT&T Labs, San Ramon, USA (2016-2020) Principal Member of Technical Staff, AT&T Labs, San Ramon, USA (2013-2016) Senior Member of Technical Staff, AT&T Labs, San Ramon, USA (2010-2013) Postdoctoral Research Associate, Parallel Programming Laboratory, UIUC (2009-2010) Summer Intern, IBM Laboratory, New Delhi(2004) Books DATA ANALYTICS AND VISUALIZATION, Gagan Raj Gupta and Naresh Nagwani, PHI (Order from PHI ) (Google Books Page ) (Order from Amazon ) Helping School Teachers to Teach and Students to Learn ( Free Instructional Booklets on Natural, Chemical-Free Organic Farming, Yoga and Middle School Science and Mathematics ) Training and Workshops Helping Teachers to Teach and Students to Learn Data Science( Free Workshop Materials) Teaching CSL100: Introduction to Computer Programming (Monsoon 2025) (Webpage) DSL506: Deep Learning for Computer Vision (Monsoon 2024) (Webpage) DSP505: Programming for Data Science and AI (Monsoon 2024) (Webpage) CS 559: Computer Systems Design (2022-W, 2024-W) (Webpage) (Canvas Link) CS 550: Machine Learning (2022-M, 2023-M) (Webpage) DS 603: Advanced Machine Learning (2023-W) (Canvas Link) DS 507: Edge ML (2023-S) (Canvas Link) DS 250: Data Analytics and Visualization (2020-M Archive), 2022-W, 2023-W 2025-W: The course will be taught using the activity based learning approach. Visit webpage for details DS 503: Advanced Data Analytics (2021-M) (Webpage) (Canvas Link) DS 200: Architecture for Management of Large Datasets (2021-M) (Webpage) EE 777: Mobile Communication Systems (2020-M with Dr. Arzad and Anand) (Archive) ML Systems Design Medical Imaging Academic Service TPC member for Wi-opt 2021 The Web Conference 2026 Reviewer for following Journals: IEEE/ACM ToN , IEEE IoT , IEEE TNSE Reviewer for MICCAI 2024 conference, ACM CODS-COMAD 2024, ICASSP 2025 conference Reviewer for MICCAI 2025 conference, ACM KDD 2024, 2025, AAAI 2025, AISTATS 2026 conference Selected as an outstanding reviewer for ACM KDD 2025 Judge at SIH 2023 Selected Publications View citations of my papers at: Google Scholar Medical Imaging Papers Aayushman, Hemant, Vidhi, Manisha and Gagan Raj Gupta , “Fair and Accurate Skin Disease Image Classification using Alignment with Clinical Text Representations”, MICCAI 2024. Early Accept Paper (amongst the top 11% of 2869 papers submitted). Prakanshul Saxena, Gagan Raj Gupta, Madhur Bhattad, “MULTIMODAL AND MULTITASK APPROACHES FOR CATARACT GRADING”, CODS-COMAD 2024 (Paper) ML Systems Papers Multivariate Time Series Data Mining for Failure Prediction & Root Cause Analysis, Naman Agarwal, Gagan Raj Gupta, Vishwesh Jatala, Aniket Saha, IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2025 Suryanarayana Yarrabothula, Vaibhav Kurrey, Mayank Nagar, Gagan Raj Gupta, “Industrial Safety Violation Detection using Action Recognition\", CODS-COMAD 2024, IIT Jodhpur. Anshul Kumar, Gagan Raj Gupta, Sunny Kumar, Ankita Sahu, Apu Chakraborty, “What does your Packet Capture say?\", CODS-COMAD 2024, IIT Jodhpur. Gagan Raj Gupta, Dhruv Deshmukh, Vishwesh Jatala, “Tutorial: Distributed Graph Neural Networks\", CODS-COMAD 2024, IIT Jodhpur. Shaziya Islam, Gagan Raj Gupta, “MultiChannel and Multiple Device Financial Frauds Detection\", CODS-COMAD 2024, IIT Jodhpur. Manisha Chawla, Gagan Raj Gupta, Shreyas Gaddam and Manas Wadhwa, “Beyond Federated Learning for IoT: Efficient Split Learning with Caching & Model Customization”, IEEE IOT Journal (Code) (Paper) Dhruv Deshmukh, Gagan Raj Gupta, Manisha Chawla, Vishwesh Jatala and Anirban Haldar, “Entropy aware training for Fast and Accurate Distributed GNN”, ICDM 2023 (Code) (Paper) Gagan Raj Gupta, Soumajit Pramanik, Milind Thummala, Anirban Haldar, “Improved Representations using Augmented Graphs”, CODS-COMAD 2024 (Paper) Manas Wadhwa, Gagan Raj Gupta, Ashutosh Sahu, Rahul Saini and Vidhi Mittal, “PFSL: Personalized & Fair Split Learning with Data & Label Privacy for thin clients”, CCGRID 2023 conference. (Paper) (Code) Manohar Lal Das, Vishwesh Jatala, and Gagan Raj Gupta, “Joint Partitioning and Sampling Algorithm for Scaling Graph Neural Networks”, 29th IEEE International Conference on High Performance Computing, Data, and Analytics (HiPC), 2022. (Paper) Time Series Analysis Papers Suraj Kumar, Gagan Raj Gupta, Roodra Pratap Singh Parihar \"Fast Anomaly Detection For Multivariate Industrial Time Series Data\" 14th International Conference on Computing Communication and Networking Technologies (ICCCNT) Raj, Aniket, Pramit Bhattacharyya, and Gagan Raj Gupta. \"Clusters of COVID-19 Indicators in India: Characterization, Correspondence and Change Analysis.\" SN Computer Science 3, no. 3 (2022): 210. (Paper) Low Complexity Algorithms with Performance Guarantees Prarabdh Shukla, Gagan Raj Gupta and Kunal Dutta, “DiffRed: Dimensionality Reduction guided by stable rank”, AISTATS 2024. (Code) (Paper) PATENTS GRANTED \"A HAND HELD OPERATIONAL FUNDUS IMAGING DEVICE\" Patent No.: 488290. Issued: Dec 22, 2023 \"AN ARTIFICIAL INTELLIGENCE TECHNOLOGY BASED CATARACT GRADING SYSTEM\", Patent No.: 500416. Issued: Jan 17, 2024 Journal Papers Y. Sang, Gagan Raj Gupta, and B. Ji, “Node-based Service-Balanced Scheduling for Provably Guaranteed Throughput and Evacuation Time Performance,” IEEE Transactions on Mobile Computing (TMC), vol. 17, no. 8, pp. 1938-1951, 2018. B. Ji, Gagan Raj Gupta, M. Sharma, X. Lin, and N. B. Shroff, “Achieving Optimal Throughput and NearOptimal Asymptotic Delay Performance in Multi-Channel Wireless Networks with Low Complexity: A Practical Greedy Scheduling Policy,” IEEE/ACM Transactions on Networking (ToN), vol. 23, no. 3, pp. 880-893, 2015 B. Ji, Gagan Raj Gupta, X. Lin, and N. B. Shroff, “Low-Complexity Scheduling Policies for Achieving Throughput and Asymptotic Delay Optimality in Multi-Channel Wireless Networks,” IEEE/ACM Transactions on Networking (ToN), vol. 22, no. 6, pp. 1911-1924, 2014. Gagan Raj Gupta and Ness B. Shroff, \"Delay Analysis and Optimality of Scheduling policies for multi-hop Wireless Networks\", IEEE/ACMTransactions on Networking, 2010. Gagan Raj Gupta and Ness B. Shroff, \"Delay Analysis for Wireless Networks with Single Hop Traffic and General Interference Constraints\", IEEE/ACM Transactions on Networking, vol. 18, no. 2, pp. 393-405, April 2010. Gagan Raj Gupta and Ness B. Shroff, \"Practical Scheduling Schemes with Throughput Guarantees for Multi-hop Wireless Networks\", in Elsevier Computer Networks Journal, Volume 8 , Issue 2, March 2010, pp. 148-164, 2010. Gagan Raj Gupta and Parmesh Ramanathan, \"Opportunistic Sensing and Collaboration for Level Set Estimation\", Ad Hoc and Sensor Wireless Networks Journal, Issue 6, 215-237, 2008. K.V. Pagalthivarthi, A. Mittal, P. Goyal and Gagan Raj Gupta, \"Applications of improved SVM framework in modeling in mechanics\", CAMES, 14: 509-523, 2007. Steven Baker, Udatta Palekar, Gagan Gupta, Laxmikant Kale, Akhil Langer, Mark Surina, Ramprasad Venkataraman, “Parallel Computing for DoD Airlift Allocation”, MITRE Techinal Report, 2010 Conference Papers G. Sallam, Gagan Raj Gupta, B. Li, and B. Ji, “Shortest Path and Maximum Flow Problems Under Service Function Chaining Constraints,” Proceedings of IEEE INFOCOM 2018, Honolulu, HI, April 2018. B. Ji, G. R. Gupta, and Y. Sang, “Node-based Service-Balanced Scheduling for Provably Guaranteed Throughput and Evacuation Time Performance,” to appear in IEEE INFOCOM 2016, San Francisco, CA, April 2016. Xiaolin Cheng, Gagan Raj Gupta, Prasant Mohapatra,“Joint Carrier Aggregation and Packet Scheduling in LTE-Advanced Networks”, SECON 2013. Bo Ji, Gagan Raj Gupta, Xiaojun Lin, Ness B Shroff, “Performance of Low Complexity Scheduling Policies in Multi-Channel Wireless Networks: Optimal Throughput and Near-Optimal Delay”, INFOCOM 2013. Gagan Raj Gupta, Gengbin Zheng, Eric Bohm, Isaac Dooley, and Laxmikant V. Kale, “Simulating Large Scale Parallel Applications using Statistical Models for Sequential Execution Blocks”, ICPADS 2010. Abhinav Bhatele, Gagan Raj Gupta, I-Hsin Chung and Laxmikant V. Kal",
  "content_length": 14971,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:40"
}