{
  "name": "Gail Teresa Reynard",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/gail.hopkins",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Gail HopkinsProfessor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsResearchPublications Contact workRoom C33 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/agail.hopkins@nottingham.ac.ukhttps://www.nottingham.ac.uk/computerscience/people/gail.hopkins Teaching SummaryI currently teach modules in Systems and Networks and Software Engineering Management. In the past I have taught a range of modules including Collaboration and Communication Technologies, Virtual Reality and Multimedia, Human Factors, User Interface Design, Unix and Software Tools, Computer Use and Applications, The Internet and the World Wide Web, XML and Advanced Computer Communication.Research SummaryMy research interests include inclusive learning environments and teaching and assessment styles, mobile and collaborative technologies for e-learning, social networks and user experience/usability.… read moreRecent Publications COBB, S., BEARDON, L., EASTGATE, R., GLOVER, T., KERR, S., NEALE, H., PARSONS, S., BENFORD, S., HOPKINS, E., MITCHELL, P., REYNARD, G. and WILSON, J., 2002. Applied virtual environments to support learning of social interaction skills in users with Asperger's Syndrome Digital Creativity. 13(1), 11-22BENFORD, S.D., FRASER, M.C., REYNARD, G.T., KOLEVA, B. and DROZD, A., 2002. Staging and evaluating public performances as an approach to CVE research In: CVE '02: Proceedings of the 4th international conference on Collaborative virtual environments (Bonn, Germany, September 30 - October 02, 2002). 80-87BENFORD, S., REYNARD, G., GREENHALGH, C., SNOWDON, D. and BULLOCK, A., 2000. A poetry performance in a collaborative virtual environment IEEE Computer Graphics and Applications. 20(3), 66-75BENFORD, S.D., TAYLOR, I.M., BRAILSFORD, D.F., KOLEVA-HOPKIN, B., CRAVEN, M.P., FRASER, M., REYNARD, G.T. and GREENHALGH, C.M., 1999. Three dimensional visualization of the World Wide Web ACM Computing Surveys. 31(4es), Article 25 View all publications Current ResearchMy research interests include inclusive learning environments and teaching and assessment styles, mobile and collaborative technologies for e-learning, social networks and user experience/usability. I am also interested in understanding cognitive profiles and how these influence educational experience. COBB, S., BEARDON, L., EASTGATE, R., GLOVER, T., KERR, S., NEALE, H., PARSONS, S., BENFORD, S., HOPKINS, E., MITCHELL, P., REYNARD, G. and WILSON, J., 2002. Applied virtual environments to support learning of social interaction skills in users with Asperger's Syndrome Digital Creativity. 13(1), 11-22BENFORD, S.D., FRASER, M.C., REYNARD, G.T., KOLEVA, B. and DROZD, A., 2002. Staging and evaluating public performances as an approach to CVE research In: CVE '02: Proceedings of the 4th international conference on Collaborative virtual environments (Bonn, Germany, September 30 - October 02, 2002). 80-87BENFORD, S., REYNARD, G., GREENHALGH, C., SNOWDON, D. and BULLOCK, A., 2000. A poetry performance in a collaborative virtual environment IEEE Computer Graphics and Applications. 20(3), 66-75BENFORD, S.D., TAYLOR, I.M., BRAILSFORD, D.F., KOLEVA-HOPKIN, B., CRAVEN, M.P., FRASER, M., REYNARD, G.T. and GREENHALGH, C.M., 1999. Three dimensional visualization of the World Wide Web ACM Computing Surveys. 31(4es), Article 25BENFORD, S., GREENHALGH, C., REYNARD, G., BROWN, C. and KOLEVA, B., 1998. Understanding and constructing shared spaces with mixed-reality boundaries ACM Transactions on Computer-Human Interaction. 5(3), 185-223BENFORD, S., SNOWDON, D., BROWN, C. and REYNARD, G., 1997. Visualising and populating the Web: Collaborative virtual environments for browsing, searching and inhabiting Webspace Computer Networks and ISDN Systems. 29(15), 1751-1762 Browser does not support script. Browser does not support script. School of Computer Science University of NottinghamJubilee CampusWollaton Road Nottingham, NG8 1BB For all enquires please visit: www.nottingham.ac.uk/enquire Legal information Copyright Terms and conditions Privacy Posting rules Accessibility Freedom of information Charity gateway Cookie policy Cookie Settings Get social Connect with the University of Nottingham through social media and our blogs. Campus maps | More contact information | Jobs",
  "content_length": 4708,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:41"
}