{
  "name": "Gajendra P. S. Raghava",
  "homepage": "http://webs.iiitd.edu.in/raghava",
  "status": "success",
  "content": "Home Page of Prof. Gajendra P. S. Raghava G.P.S. Raghava is a Professor & Head at Department of Computational Biology, Indraprastha Institute of Information Technology (IIIT-Delhi), India. Before joining IIIT-Delhi in 2017, he was working as a Chief Scientist at Bioinformatics Centre, CSIR-Institute of Microbial Technology (IMTECH), Chandigarh, India. He did his M.Tech. from Indian Institute of Technology (IIT-Delhi), New Delhi in 1986. He did his Ph.D. in Bioinformatics in 1996 from IMTECH, Chandigarh. He worked as a Postdoctoral fellow at Oxford university, Oxford from 1996 to 1998. Moreover, He also worked as a Bioinformatics specialist at UAMS, USA (2002-2003 & 2006) where he established bioinformatics infastructure. Prof. Raghava also worked as a visiting professor at POSTECH, South Korea in year 2004. Prof. Raghava is a champion of open source software and open access, all the resources develoed at his group are free for the scientific community. His group developed and maintained more than 300 software and web servers,which is the highest number in the world by a single group. These services are heavily used by scientific community, nearly 200,000 hits per day. His group has published more than 300 research papers in the reputed journals with avargae impact factor around 4.0. Most of his papers are highly cited, with a total number of citations exceeding 30,500, an h-index of 91, and an i10-index of 268, according to  google scholar. In addition, his group contributed/maintained number of web based platforms that include i) CRDD, ii) OSCADD, iii) OSDDlinux, iv) GPSR Packages, v) GPSRdocker. For further information click on Latest Biodata (Updated Feb 2024) and on scientific journey. Sun Pharma Research Award 2018 by Sun Pharma Science Foundation Scientist Award 2019 by Organisation of Pharmaceutical Producers of India Listed in The Worlds' Most Influential Scientific Minds 2014 Shanti Swarup Bhatnagar Award in Biological Science, 2008 National Bioscience Award for Carrier Development, for year 2005-2006 NASI-Reliance Industries Platinum Jubilee Award, 2009; Thomson Reuters Research Excellence - India Research Front Awards, 2009 Prestigious  J. C. Bose National Fellowship by DST, 2010. Lakshmipat Singhania-IIM Lucknow National Leadership Awards 2011 (Young Leader) Fellow of National Academy of Sciences (F.N.A.Sc) Fellow of Indian Academy of Science (F.A.Sc.) Banglore. Fellow of Indian National Science Academy (F.N.A) Delhi List of web-servers developed by the group Click to the visit the publications of the group Click to visit the patents/copyrights page Click to see the book chapters. Courses taught by Prof. Raghava. Click to see the slides. Click to visit the current lab members Click to meet the lab alumni of the group. Click to see the project staff of the group. Thank you for visiting the site. Twitter Facebook",
  "content_length": 2874,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:43"
}