{
  "name": "Ganesh Ramakrishnan",
  "homepage": "https://www.cse.iitb.ac.in/~ganesh",
  "status": "success",
  "content": "Prof. Ganesh Ramakrishnan Bank of Baroda Chair Professor in Digital Entrepreneurship (starting 28th May, 2024 for a period of 3 years), Department of Computer Science and Engineering, IIT Bombay Professor-in-Charge, Koita Centre for Digital Health, Co-PI for the National Disease Modelling Consortium (NDMC) (Formerly Research Staff Member, IBM India Research Lab) Phone (office): 022-25767728 Room: SI-A418, KReSIT Publications    Software Teaching     Publications, Books and Tutorials : Click here to view Awards and Recognitions IRCC impactful research award 2023 for âThe Udaan Project ecosystem for Data-Efficient and Scalable End to end Document Machine Translation' Included in the in the AIM 100: Top 100 Most Influential Global Leaders in the AI domain in 2024 Rationalized elaboration for this inclusion can be found at this link Received the National Award for eGovernance (Gold Award) in 2022 under the Category \"Outstanding research on Citizen Centric Services by Academic/Research Institution\" from the Department of Administrative Reforms & Public Grievances, Ministry of Personnel, Public Grievances & Pensions, Government of India. forVideo Analytics for Security and Compliance Applications Institute Chair Professorship 2021-2024 Dr. P.K. Patwardhan Technology Development Award 2020 for Video Analytics for Security and Compliance Applications, received from chief guest Dr. Krishnaswamy VijayRaghavan (PSA) on Teacher's day: Acceptance Talk (Director FB Post) IRCC impactful research award 2017 for âDevelopment of an adaptive framework for end-to-end corrections in Indic OCR J.R. Isaac Chair 2014-2016 IBM Faculty Award 2011 Awards from Qualcomm, Adobe, Microsoft, Amazon Research Award on Fairness for AI, July 2022 (Main PI: Preethi Jyothi) Computerworld Horizon Awards 2006 Honoree Department Award for Excellence in Teaching 2023 Translational Research, Software, Solutions and Products [Latest] BharatGen, Launched as the world's first government-funded Multimodal Large Language Model project focused on creating efficient and inclusive AI in Indian languages by Union Minister Dr. Jitendra Singh . This was followed by my talk announcing and demonstrating the first set of foundational models and applications at the India Mobile Congress on October 17th 2024 and was further presented to the honorable Minister at a talk organized by the DST Secretary Prof. Abhay Karandikar to secretaries and scientists of other scientific ministries. For BharatGen's presence on social media check out X (formerly twitter) and Linkedin and tons of other media coverage Udaan: A Indian Language End-to-End Translation Ecosystem for Breaking the Language Barrier in Education, Launch on Hindi Divas by chief guest Dr. Krishnaswamy VijayRaghavan, Principal Scientific Adviser, Goverment of India, Live broadcast on IIT Bombay Youtube channel Technology Licensed to Bharat Bhasha Tech. See encouraging tweets from Honorable Minister of Education and Minister of Skill Development & Entrepreneurship (GoI) and Honorable Union Minister of State for Entrepreneurship, Skill Development, Electronics & Technology (GoI) DECILE: Data efficient Machine Learning State of the art AI and Deep Learning are very data hungry. This comes at significant cost including larger resource costs (multiple expensive GPUs and cloud costs), training times (often times multiple days), and human labeling costs and time. Decile attempts to solve this by answering the following question. Can we train state of the art deep models with only a sample (say 5 to 10\\%) of massive datasets, while having neglibible impact in accuracy? Can we do this while reducing training time/cost by an order of magnitude, and/or significantly reducing the amount of labeled data required?. This repository consists of four components: (i) CORDS: COResets and Data Subset selection, (ii) DISTIL: Deep dIverSified inTeractIve Learning (iii) SubmodLib: Summarizing massive datasets using submodular optimization and (iv) SPEAR: Semi-suPErvised dAta progRamming. Overview Presentation on DECILE and underlying research, as part of the Faculty Unplugged Seminar Series (FUSS). Software for Video Survelliance Analytics (Real time as well as offline) Technology Licensed to SrivisifAI Software for OCR and Scene text Recognition for Indian languages and Indian context Real time contact tracing through Corontine application : Geofenced Tracking, Tracing and Alerting Lokacart for helping MSME's, Farmer groups: short slide deck, example media coverage and writeup in Insight as One of the projects initiated by IIT Bombay for COVID-19 mitigation (see pages 17 and 65-69) in collaboration with industrial partners. Technology Licensed to Strategic ERP Lokavidya: Knowledge sharing platform for training and educational institutions: Writeup in IITB's Insight as One of the projects initiated by IIT Bombay for COVID-19 mitigation (see pages 18 and 73-77) in collaboration with industrial partners VENTER: Software for Intelligent Complaint Resolution: This project was partially supported by Microsoft India Research Labs. The goal of this project has been to create a community platform for analyzing complaints of varied types (broken taps, cutting trees, noise, etc) and various levels (a workplace building, a university campus, or a city). System Text for Information Extraction IBM OmniFind Personal E-mail Search Analytic Hierarchical Process (AHP) Teaching CS337: Artificial Intelligence and Machine Learning (and its associated lab CS335) with videos, notes, tutorials Online course (with videos, notes, tutorials) on Foundations of Machine Learning CS419: Machine Learning Minor CS725: Foundations of Machine Learning CS769: Optimization in Machine Learning CS709: Convex Optimization CS717: Statistical Relational Learning CS 215 Data Analysis and Interpretation CS 213x Algorithms component of the 3-part online course CS 213 Foundations & Implementation of Data Structures and Algorithms co-taught with Prof. Diwan and Prof. Phatak SI501: Topics in Theoretical Computer Science Guest Lectures in CS705 Course by Prof. Soumen Chakrabarti Guest Lectures in CS621 Course by Prof. Pushpak Bhattacharyya Research Interests Feature induction and learning feature maps, Relational Learning Entity and relation extraction including distant supervision settings, data integration Information Extraction and Summarization Subset selection problems in machine learning Learning with multiple labels, multiple instances and multivariate loss functions Other Professional Activities Senior Program Committee (PC) Member for AAAI 2018, AAAI 2019, IJCAI 2019. Program Committee (PC) Member for KDD 2018, 2017, 2016, 2015, 2014, AAAI 2018, 2017, 2016, 2015, 2014, COLING 2016, 2014, ISWC 2014, ACL 2013, ILP 2013, ACL 2016, 2015, 2014, 2013, 2012, ILP 2012, WoLE (ISWC 2012), ACL-HLT 2011, IJCNLP 2011, ACL-IJCNLP 2009, IICAI 2009, ICML 2014, ICML 2008, ICWIS09, Workshop on Data Engineering for Blogs, Social Media, and Web 2.0 (ICDE 2008), IIWeb'07 (AAAI 2007 Workshop). Disease and economic modelling expert member of Standing Technical Sub Committee (STSC) as well as an expert member of Standing Working Group â Immunization and Vaccine Research and Capacity Building (SWG-IVRCB) as part of NTAGI (National Technical Advisory Group on Immunization), Ministry of Health and Family Welfare, Govt of India. Workshop co-chair for PAKDD 2021, Organization Committee Member for KDD 2014 workshop on Big Data Discovery and Curation Organization Committee Member for COLING 2012 and COLING workshops on Information Extraction & Entity Analytics on Social Media Data and Question Answering for Complex Domains Tutorial Co-chair for the Pattern Recognition and Machine Intelligence Conference, 2009. PhD Students Past: Rishabh Dabral (Former Qualcomm Fellow, currently Post-Doctoral Researcher at Max-Planck Institute for Informatics, Awarded Â Vashee award for Research Excellence Award for PhD work)Dr. Vishal Kaushal (Former Ekal Fellow and presently Research Scientist at Amazon One Research, Bengaluru) ), Ramakrishna Bairi (recepient of Excellence in Ph.D. Research Award 2018 and currently at Microsoft India Research Labs), Ashish Kulkarni (Machine Learning Scientist at Amazon, Bengaluru , Dr. Vishwajeet Kumar (Research Scientist at IBM India Research Labs), Dr. Rohit Saluja (faculty at IIT Mandi), Dr. Naveen Nair (currently at Amazon, Seattle), Dr. Ajay Nagesh (presently Post-Doctoral Research Associate at the Center for Data Science, University of Massachusetts Amherst), Devaraj Adiga (Jointly advised with Prof. Ramasubramanian), Dr. Chetana Gawankar, Dr. Arjun Atreya, Dr. Uma Sawant Current: Durga Sivasubramanian (Former PMRF Fellow), Ayush Maheshwari (Ekal Fellow), Karthika (TCS Rearch Fellow), Isha Pandey, Vishak Prasad, Prateek Chand Internship Oppurtunities: To know more about projects under me with internship oppurtunities, click here",
  "content_length": 8932,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:44"
}