{
  "name": "Ganesh Bagler",
  "homepage": "http://faculty.iiitd.ac.in/~bagler",
  "status": "success",
  "content": "Ganesh Bagler, IIIT-Delhi Ganesh Bagler Our research focus is on study of complex systems, primarily of biological origin. We are exploring systems architecture of complex diseases, drug-target networks and brain networks. Broad areas that we study include computational & systems biology, bioinformatics, mathematical modeling, network biology, in silico drug discovery and biomedical data analysis. Apart from modeling and analysis of complex systems, we aim to probe for their control mechanisms and design principles. I am associated with the Center for Computational Biology at IIIT-Delhi. ★ Internship/Thesis Opportunities ★ Discovery of a new food pairing phenomenon ★ Internship/Thesis Opportunities ★| My TEDxDAIICT pitch | SerpentinaDB | Phytochemica | Flavidoscope: Creating novel recipe blends | A model for C. elegans brain network | Controllbaility analysis of cancer signalling network | Dr. Ganesh Bagler's Page Google Scholar Profile Leveraging food for better health through data-driven approaches Have you ever wondered why do we combine ingredients in our recipes the way we do? Or for that matter, could we find scientific ways for altering diet to improve health? Our data-driven investigations aimed at probing patterns in traditional Indian recipes, in response to the first question, have led us to the discovery of a novel food pairing phenomenon in Indian cuisine. Our studies have revealed ‘culinary fingerprints’ of regional cuisines and role of spice as the molecular fulcrum of Indian recipes. Such data-driven explorations of food are opening new avenues for development of divergent applications in the domains of nutrition and health. One such direction is towards application of machine learning for ‘personalized nutrition’ that can potentially answer the second question, thereby allowing us to leverage food as medicine. Spices form the basis of food pairing in Indian cuisine. India is known to have culinary history of health-centric dietary practices aimed at disease prevention and promotion of health. We investigated the molecular basis of food composition in the Indian cuisine with rigorous mathematical and computational analysis. We find that the cuisine is characterized with an exceptional food pairing pattern and spices occupy an unique position in rendering this unique food pairing pattern. We are focussing on various ways we could use the knowledge of such culinary patterns. Featured as an Emerging Technology & Best of 2015 in MIT Technology Review. Engineering a thermostable enzyme. Residue Interaction Graph model of native superoxide dismutase (PDB ID: 2Q2L). The \"Critical Interaction Residue Clique\" , identified by the graph theoretical analysis, emerge critical for holding the tertiary structure together. A single mutation, predicted with computational analysis, in this protein from a Himalayan plant, led to engineering of a thermostable enzyme. Arun Kumar et al., Scientific Reports (Nature Publishing Group), 2, 387, 1-8 (2012). Cancer Genes Network (CGN): A protein interactome of cancer genes embodying molecular mechanisms of cancers. Each node represents a cancer protein and an edge between two nodes represents a protein-protein interaction. The illustration shows the Cancer Genes Network, hub cancer proteins central to the interactome, and targets specific to mechanisms of bone metastasis. Shikha Vashisht and Ganesh Bagler*, PLoS ONE, 7(11): e49401 (2012). Prospecting for novel plant-derived molecules. A structued database of phytochemicals reported from Rauvolfia serpentina, a medicinal plant endemic to the Himalayan mountain range, was compiled. Inhibition of Aldose Reductase (AR) is known to provide a possible strategy to prevent complications of chronic diabetes. The illustration shows three plant-derived molecules obtained as potential AR inhibitors by prospection of Rauvolfia serpentina. Shivalika Pathania, Vinay Randhawa, and Ganesh Bagler*, PLoS ONE, 8(4): e61327 (2013). Integrative network biology. In an integrative network biological study, we modeled molecular interactome of asthma, its potential targets, and further identified potential therapeutic molecules. Using structure- and ligand-based pharmacophore modeling two leads were identified. Vinay Randhawa and Ganesh Bagler*, OMICS: A Journal of Integrative Biology, 16 (10), 512-526 (2012) Assortative mixing of residue contacts in the Residue Interaction Graph Models of Protein Structures. We found that coarse-grained, graph theoretical models of protein structures are characterized by assortative mixing. This exceptional and generic property of proteins could have bearing on their function and folding kinetics. Ganesh Bagler and Somdatta Sinha, Bioinformatics, 23 (14), 1760-1767 (2007). Analysis of Airport Network of India: A Representative Network Model of India's Aviation Infrastructure. The Airport Network of India (ANI) was modeled as weighted, directed network based on empirical data. While the ANI was found to be similar to its world-wide network counterpart, the degree correlations were observed to be distinctly different. These studies are aimed at providing insight into the evolution of the network, and to look for policy guidelines so as to improve robustness against random failures, targeted attacks, and spread of epidemics. Ganesh Bagler*, Physica A, 346, 2972-2980 (2008). | arXiv:cond-mat/0409773 | Blog Variable Ventilation Strategy: Have lungs evolved by adapting to noisy ventilation? Lungs have a nonlinear and convex response to tidal volume for breathing pressure, and are known to benefit from noisy ventilation. We performed numerical studies to identify best possible ventilation strategy. These studies are aimed at identifying physiologically acceptable breathing sequences for driving mechanical ventilators. Reena Yadav, Mayur Ghatge, Kirankumar Hiremath and Ganesh Bagler*, National Systems Conference, Lecture Notes in Electrical Engineering, Springer (2013). Flavidoscope is an android app based on the discovery of characteristic food pairing in the Indian cuisine, which sets the cuisine apart in the way flavors are blended in traditional Indian recipes. It is aimed at chefs and amateur cooks and facilitates generation of novel recipes by blending characteristic Indian flavors. The app brings the science of molecular gastronomy into the kitchen. In the present form, it allows to explore four categories of Indian recipes: Roti/Naan, Pakoda/Bhajia, Dosa, Idli and Khichadi. We are working on improved strategies to capture the molecular essence of Indian food using artificial intelligence. Credits- Android App Development: Rishabh Bharadwaj; Data analytics and app algorithm: Lavanya Gupa; Discovery: Anupam Jain and Rakhi; Project Lead: Ganesh Bagler Aspects of research being conducted by Ganesh Bagler at the Center for Computational Biology, Indraprastha Institute of Information Technology Delhi (IIIT-Delhi), along with his students. Our work focuses on mathematical and computational modeling of biological phenomena. We aim to understand subtle principles underlying biological complex systems and to engineer systems that are designed to be adaptive and antifragile. Publications | Resources:Data | Internship/Thesis Opportunites Cadence Advanced Technology Talk: Can a biologist fix a radio? — Challenges and opportunities in computational biology. Summary: Advances biology have led to a new era in computational biology for creating meaningful models of biological systems, their analysis and seeking for ways of their control. In this context, by invoking the metaphor of biological system as a radio I pointed out few pertinent challenges and opportunities in computational biology. Disclaimer: The invitation for Advanced Technical Talk does not imply endorsement from Cadence Design Systems to me, my work or my institute. Talks delivered to communicate our research directions : (a) Network Biology: Graph theoretical models of biological systems: Disease interactomes, Brain Networks, Residue Interaction Graphs, (b) Data driven explorations of food: Discovery of contrasting food pairing in Indian cuisine and applications for health (c) Structural Bioinformatics: Discovery of assortative mixing in residue interaction graphs and its role in protein folding kinetics.",
  "content_length": 8309,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:45"
}