{
  "name": "Gang Tan",
  "homepage": "http://www.cse.psu.edu/~gxt29",
  "status": "success",
  "content": "G. Gary Tan Professor, CSE, School of EECS Co-director of Institute for Networking and Security Research (INSR) Co-hire of Institute for Computational and Data Sciences (ICDS) Penn State University, University Park [CV][Pdf CV] Announcement: my research group is hiring postdoctoral researchers and PhD students; please feel free to contact me. Professional Highlights I am a CoDirector of Penn State’s Institute for Networking and Security Research (INSR) from 2023. I am an ACM Distinguished Member. I am the lead PI of a $8.5M multi-discriplinary DARPA project on mixed-reality security from 2024. I served on DARPA’s Information Science and Technology group (ISAT) from 2020 to 2024. My group’s research received multiple best paper awards from PLDI 2024, LangSec 2023, VEE 2020, and CODASPY 2018. I received Outstanding Research Award from Penn State Engineering Alumni Society (PSEAS) in 2023. I received the Ruth and Joel Spira Excellence in Teaching Award from Penn State CSE in 2018. I received NSF’s CAREER award. As a doctoral student, I recevied Princeton’s Francis Upton Graduate Fellowship from 1999 to 2003. Brief Bio Dr. Tan is a Professor in the Computer Science and Engineering Department of the Pennsylvania State University and co-directs its Institute for Networking and Security Research (INSR). He obtained his B.E. in Computer Science from Tsinghua University, and his Ph.D. in Computer Science from Princeton University. His research interests are software security, formal methods, and programming languages. He leads the Security of Software (SOS) Group, which is broadly interested in applying compiler, programming language, and formal method techniques to improving software security. He is an ACM Distinguished Member and served on the DARPA ISAT study group from 2020 to 2024. He has also received multiple awards, including a James F. Will Career Development Professorship, an NSF CAREER Award, two Google Research Awards, a Distinguished Reviewer Award at 2018 IEEE Symposium on Security and Privacy, an outstanding Research Award and a Ruth and Joel Spira Excellence in Teaching Award at Penn State, and some best paper awards at academic conferences, including PLDI, VEE, LangSec, and CODASPY.",
  "content_length": 2229,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:49"
}