{
  "name": "Ganga Bishnu Mund",
  "homepage": "https://cse.kiit.ac.in/profiles/g-b-mund",
  "status": "success",
  "content": "G B Mund - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com G B Mund G B Mund G B Mund ProfessorG B Mund earned his Ph. D. degree in Computer Science and Engineering from IIT Kharagpur. He has over 27 years of teaching / research experience. He joined Kalinga Institute of Industrial Technology (KIIT) in the year 1997. Profile LinksEmail :[email protected] Social LinksProfileRecent PublicationsProfileResearch Interests Program Analysis Algorithms and Graph Theory Recent PublicationsJournals/Conferences :The compiler design handbook: optimizations and machine code generation YN Srikant, P Shankar CRC Press\t168\t2002 An efficient dynamic program slicing technique GB Mund, R Mall, S Sarkar Information and Software Technology 44 (2), 123-132\t57\t2002 Performance analysis of cloud with queue-dependent virtual machines V Goswami, SS Patra, GB Mund Recent Advances in Information Technology (RAIT), 2012 1st International …\t43\t2012 An efficient interprocedural dynamic slicing method GB Mund, R Mall Journal of Systems and Software 79 (6), 791-806\t40\t2006 Computation of intraprocedural dynamic program slices GB Mund, R Mall, S Sarkar Information and Software Technology 45 (8), 499-512\t35\t2003 Analysis of discrete-time batch service renewal input queue with multiple working vacations V Goswami, GB Mund Computers & Industrial Engineering 61 (3), 629-636\t34\t2011 Analysis of a discrete-time GI/Geo/1/N queue with multiple working vacations V Goswami, GB Mund Journal of Systems Science and Systems Engineering 19 (3), 367-384\t12\t2010 A survey on scheduling heuristics in grid computing environment MK Mishra, YS Patel, Y Rout, GB Mund International Journal of Modern Education and Computer Science 6 (10), 57\t11\t2014 Program slicing GB Mund, D Goswami, R Mall The Compiler Design Handbook, 271-296\t10\t2002 A Time-Minimization Dynamic Job Grouping-based Scheduling in Grid Computing MK Mishra, P Mohanty, GB Mund International Journal of Computer Applications 40 (16), 16-25\t9\t2012 Multiserver bulk service discrete-time queue with finite buffer and renewal input V Goswami, GB Mund Computers & Mathematics with Applications 57 (8), 1377-1388\t8\t2009 Performance analysis of cloud computing centers for bulk services V Goswami, SS Patra, GB Mund International Journal of Cloud Applications and Computing (IJCAC) 2 (4), 53-65\t7\t2012 Worst-case execution time and energy analysis T Mitra, A Roychoudhury The Compiler Design Handbook, 5-52\t7\t2007 A modified grouping-based job scheduling in computational grid MK Mishra, P Mohanty, GB Mund Engineering (NUiCONE), 2011 Nirma University International Conference on, 1-6\t6\t2011 A review and classification of grid computing systems MK Mishra, YS Patel, M Ghosh, G Mund International Journal of Computational Intelligence Research 13 (3), 369-402\t5\t2017 FRAMEWORK FOR AUDITING IN CLOUD COMPUTING ENVIRONMENT. S MOHANTY, PK PATTNAIK, GB MUND Journal of Theoretical & Applied Information Technology 65 (1)\t4\t2014 A Comparative Approach to Reduce the Waiting Time Using Queuing Theory in Cloud Computing Environment S Mohanty, PK Pattnaik, GB Mund International Journal of Information and Computation Technology. ISSN, 0974-2239\t4\t2014 Slicing of programs dynamically under distributed environment S Pani, SM Satapathy, GB Mund Proceedings of International Conference on Advances in Computing, 601-609\t4\t2013 Analysis of discrete-time queues with batch renewal input and multiple vacations V Goswami, GB Mund Journal of Systems Science and Complexity 25 (3), 486-503\t3\t2012 The Compiler Design Handbook: Optimizations and Machine Code Generation, chapter Data Flow Analysis U Khedker CRC Press sachi2019-01-03T16:30:17+05:30 Page load link Go to Top",
  "content_length": 3787,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:48"
}