{
  "name": "Gangshan Wu",
  "homepage": "http://mcg.nju.edu.cn/member/gswu/en/index.html",
  "status": "success",
  "content": "MCG@NJU Multimedia Computing Group, Nanjing University Nanjing University · Computer Science & Technology [中文] Home Member Research Publication Resource Activity Alumni Gangshan Wu Professor Address: Room 1015, CS Building, Xianlin, Nanjing University Telephone: +86-25-89680998 Fax: +86-25-89680998 Email: gswu[at]nju.edu.cn Brief Gangshan Wu is a professor of Department of Computer Science and Technology of Nanjing University, and he is the head of Multimedia Lab of Nanjing University. He has visited Department of Computer Science of National Chiao Tung University. He has been the principal investigators and main investigators of dozens of key projects about computer vision, multimedia retrieval, intelligent web information processing, digital museum and large-scale seismic data processing and so on. He has published over 80 research papers on international and domestic journals and conferences. He has won the second prize of Science and Technological Achievement Awards of Jiangsu Province (1999), the grand prize of Education Achievement Award (2007), and the second prize of National High Education Achievement Award (2009). Currently, his research interests mainly include multimedia content analysis and retrieval. Selected Publication Yang Yang, Linjun Yang, Gangshan Wu, and Shipeng Li. A bag-of-objects retrieval model for web image search. ACM international conference on Multimedia (MM'12), 2012, 49-58. Danny Z. Chen, Xuehou Tan, Haitao Wang, and Gangshan Wu. Optimal point movement for covering circular regions. Algorithmica, 2015, 72(2):379-399. Yang Yang, Linjun Yang, Gangshan Wu, and Shipeng Li. Image relevance prediction using query-context bag-of-object retrieval model. IEEE Transactions on Multimedia, 2014, 16(6):1700-1712. Xuehou Tan and Gangshan Wu. Approximation algorithms for cutting a convex polyhedron out of a sphere. Theoretical Computer Science, 2013, 508:66-73. Xiangyang Xu, Ling Ge, Tongwei Ren and Gangshan Wu. Adaptive integration of depth and color for objectness estimation. IEEE International Conference on Multimedia and Expo (ICME'15), Torino, Italy, 2015. (poster) Xiangyang Xu, Wenjing Geng, Ran Ju, Yang Yang, Tongwei Ren, and Gangshan Wu. OBSIR: Object-based stereo image retrieval. IEEE International Conference on Multimedia and Expo (ICME'14), Chengdu, China, 2014. (poster) Chunrong Xia, Yang Yang, Ran Ju, and Gangshan Wu. Effective local stereo matching by extended triangular interpolation. IEEE International Conference on Multimedia and Expo (ICME'13), San Jose, USA, 2013, 1-6. (poster) Sheng-hua Zhong, Yan Liu, Fu-lai Chung, and Gangshan Wu. Semiconducting bilinear deep learning for incomplete image recognition. ACM International Conference on Multimedia Retrieval (ICMR'12), 2012, 32. Tongwei Ren, Yan Liu, and Gangshan Wu. Image retargeting based on global energy optimization. IEEE International Conference on Multimedia and Expo (ICME'09), New York, USA, 2009. Tongwei Ren, Yanwen Guo, Gangshan Wu and Fuyan Zhang. Constrained sampling for image retargeting. IEEE International Conference on Multimedia and Expo (ICME'08), Hannover, Germany, 2008. Yang Yang, Linjun Yang, and Gangshan Wu. Smart thumbnail: Automatic image cropping by mining canonical query objects. Pacific-Rim Conference on Multimedia (PCM'13), Nanjing, China, 2013, 418-429. (best student paper) Copyright@2015 南京大学计算机科学与技术系媒体计算研究组",
  "content_length": 3424,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:45"
}