{
  "name": "Gao Cong",
  "homepage": "https://www3.ntu.edu.sg/home/gaocong",
  "status": "success",
  "content": "Gao's Homepage Gao Cong (丛 高) Block N4, 2c-103 College of Computing and Data Science Nanyang Technological University Email    gaocong at ntu.edu.sg Short Biography 2018 -- present: Professor, College of Computing and Data Science (CCDS), Nanyang Technological University, Singapore. Affiliated to the Data Management Research Group (DANTE) 2015 -- 2018: Associate Professor, Nanyang Technological University, Singapore. 2010 -- 2015: Assistant Professor, Nanyang Technological University, Singapore. 2008 -- 2010: Assistant Professor, Department of Computer Science, and Center for Data-intensive Systems (Daisy), Aalborg University, Denmark 2007 -- 2008: Researcher, Microsoft Research Asia 2004 -- 2006: Postdoc Research Fellow, the Database group within the School of Informatics of University of Edinburgh. 2000 -- 2004: Ph.D. student and Pre-doc,  Department of Computer Science, National University of Singapore, Singapore. 1999 -- 2000: ShenZhen Huawei Company, China 1992 -- 1999: Master and Bachelor, Tianjin University, China. My long CV can be found here. Research Interests My current research interests: Spatial Data Management (Spatial +X Data Systems)  (more) ML/AI for Databases  (more) Spatial-temporal Data Mining and Smart City (more) Recommendation Systems (more) My past research interests: Classifying gene expression data: Classifying tool RCBT using top-k covering rule groups in SIGMOD05 paper is available here (Linux version), or  here  (together with several other tools for mining microarray data from my Ph.D. advisor Anthony’s group).  The datasets used in our SIGMOD05 paper are available here Mining interesting association rules and frequent patterns XML, Data cleaning Publications (By year) My Google Scholar Profile, my ACM author profile, and my papers @ [DBLP] Released data and code Demonstration of some of our research Recent Talks SIGMOD 24 Tutorial: Machine Learning for Databases: Foundations, Paradigms, and Open Problems Invited Keynote Talk at 5th International Conference on Spatial Data and Intelligence (SpatialDI) 2024: Geospatial entity representation: a step towards city foundation models (Slides) Invited Keynote Talk at 2023 Australasian Database Conference (ADC 2023): Empowering Database Systems with Machine Learning (Slides) Main Admin Duty Division Head, Division of Data Science, CCDS, NTU, 2024. Co-director for the Singtel Cognitive and Artificial Intelligence Lab for Enterprises (SCALE@NTU), 2019--2024 Assistant Chair (Alumni and outreach), School of Computer Science and Computer Engineering, 2018--2024 Our Research Team (members) Teaching Data Analytics and Mining, 2021-now, NTU Data Processing Ethtics (Mini-Master course), 2021-now, NTU Introduction to Databases, 2019--now, NTU Information Analytics and Retrieval, 2019--now, NTU Database System Principles, 2013--2018, NTU Database Systems 2010--2012, NTU Information Retrieval 2011 (with Jung-jae Kim), NTU Natural Language Processing 2010-- 2011 (with Jung-jae Kim), NTU Algorithms 2010 -- 2011 , NTU Data warehouse and Data Mining 2008 Fall (with Thomas and Manfred) , AAU Introduction to Internet Technologies 2008--2009 (with Ken, Man Lung Yiu) , AAU Database Technology 2008--2009 (with my colleagues), AAU Professional Services Associate editor, ACM transactions on Database Systems PC co-chair for ICDE'22 Workshop co-chair for CIKM'21 Associate General Chair for KDD'21 Tutorial Track co-chair, PAKDD 2020 PC co-chair for ADC'18 PC co-chair for PhD forum and posters Track of ASONAM PC co-chair for the 13th International Conference on Advanced Data Mining and Applications (ADMA'17) PC vice-chair for ICDE'18 PC co-chair for E&A track of PVLDB'14 Publication chair for The 25th Pacific Asia Conference on Language Information and Computing (PACLIC), 2011 Program Committee: Senior PC:  SIGSPTIAL(22), KDD(19-22), CIKM (17,18,22), AAAI(21), IEEE Big Data’17 2023: SIGMOD, VLDB, etc 2022: SIGMOD, WWW, etc 2021: VLDB, ICDE, WWW, etc 2020: VLDB, SIGMOD, KDD, ICDE, DASFAA, etc. 2019: VLDB, KDD, ICDE, ICDM, CIKM, DASFAA, etc. 2018: VLDB, SIGMOD, WWW, KDD, DASFAA, etc. 2017: VLDB, CIKM, WWW, WSDM, AAAI, ICDM, IEEE Big Data, SSTD, SIGSpatial, DASFAA, etc. 2016: KDD, ICDM, VLDB, CIKM, WWW, AAAI, IEEE Big Data, etc. 2015:  SIGKDD, WWW, ICDE,  ACL, DASFAA, WAIM, CIKM 2014:  SIGKDD, WWW, CIKM, SDM, ICDE, DASFAA, ACL, EMNLP, ICWSM, WAIM 2013:  PVLDB, SIGKDD, ICDM, SDM, CIKM, ICDE, PAKDD, WWW, DASFAA, 2012:  PVLDB, ICDE, NAACL-HLT, DASFAA, PAKDD, SIGKDD, ICDM, CIKM, SIGIR Poster, ASONAM 2011:  ICDE; DASFAA; ASONAM; ADC; DEXA; SIGIR poster; EMNLP; AINA; CIKM 2010: KDD; ACL; ICDM ; WWW; DASFAA; DEXA; DNIS; ICDKE; HPCC; ASONAM 2009: VLDB; ICDE; ICDM; PAKDD; DEXA; APWeb; ASONAM 2008: SIGMOD; VLDB; KDD; ICDM; DEXA; XANTEC; WWW Poster; Apweb; DASFAA; AReS; WAIM; Seminar coordinator for Edinburgh Database group's weekly seminar, Feb. - Sept. 2006",
  "content_length": 4881,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:46"
}