{
  "name": "Gareth Tyson",
  "homepage": "http://www.eecs.qmul.ac.uk/~tysong",
  "status": "success",
  "content": "Gareth Tyson's Homepage Prof. Gareth Tyson About Me Selected Publications Academic Service Teaching & Supervision Publication List Contact Details About Me I moved to Hong Kong University of Science and Technology in 2022 (see my profile here). My research is in the broad area of Internet Data Science: details of my publications can be found here or on Google Scholar. Over the last 5 years, I have been awarded over £5 million in research funding and have received coverage from news outlets such as Washington Post, CNBC, BBC, New Scientist, MIT Tech Review, The Times, Slashdot, Daily Mail, Wired, Science Daily, Ars Technica, The Independent, Business Insider, The Register, as well as being interviewed on both TV and Radio. I have also served as an organising and program committee member for a number of prominent conferences such as ACM SIGCOMM, ACM SIGMETRICS, ACM IMC, ACM WWW, ACM CoNEXT, and AAAI ICWSM. I have hosted ACM IMC and ACM DEV in London, and have recieved the Best Reviewer Award at ACM IMC (2025), the Outstanding Reviewer Award four times at ICWSM (2016, 2018, 2019, 2021), and the Distinguished Reviewer Award at ACM CoNEXT (2022). I established the Next Generation Networking (NGN) Webinar Series, and organise the UK's annual 'Coseners' workshop. Alongside collaborators, my research has been awarded the SIGSOFT Distinguished Paper Award 2023; the IETF/IRTF Applied Networking Research Prize 2023; the WOAH Shared Task on Hateful Memes Prize 2021; the Best Student Paper Award at the Web Conference 2020; the Best Paper Award at eCrime'19; the Honourable Mention Award at the Web Conference 2018 (best paper in track); and the Best Presentation Award at INFOCOM'18. I received QMUL's Faculty Research Excellence Award in 2021 and the Brendan Murphy Memorial Young Researcher Prize in 2013. Recent Selected Publications (2024-2025) Yiluo Wei and Gareth Tyson. An Empirical Analysis of the Nostr Social Network: Decentralization, Availability, and Replication Overhead. In 21th ACM International Conference on emerging Networking EXperiments and Technologies (CoNEXT), Hong Kong (2025). Yiluo Wei and Gareth Tyson. Virtual Stars, Real Fans: Understanding the VTuber Ecosystem. In ACM Web Conference (WWW), Sydney, Australia (2025). [Acceptance Rate: 19%] Stephen McQuistin, Pete Snyder, Colin Perkins, Hamed Haddadi and Gareth Tyson. A First Look at the Privacy Harms of the Public Suffix List. In ACM Internet Measurement Conference (IMC), Montreal, Canada (2023). [Acceptance Rate: 25%] [PDF] Haris Bin Zia, Jiahui He, Ignacio Castro and Gareth Tyson. Fediverse Migrations: A Study of User Account Portability on the Mastodon Social Network. In ACM Internet Measurement Conference (IMC), Madrid, Spain (2024). [Acceptance Rate: 21%] [PDF] Yiluo Wei and Gareth Tyson. Understanding the Impact of AI-Generated Content on Social Media: The Pixiv Case. In ACM Multimedia Conference (MM), Melbourne, Australia (2024). [Acceptance Rate: 26%] [PDF] Leonhard Balduf, Saidu Sokoto, Onur Ascigil, Gareth Tyson, Bjorn Scheuermann, Maciej Korczynski, Ignacio Castro and Michal Krol. Looking AT the Blue Skies of Bluesky. In ACM Internet Measurement Conference (IMC), Madrid, Spain (2024). [Acceptance Rate: 21%] [PDF] Yiluo Wei, Yiming Zhu, Pan Hui and Gareth Tyson. Exploring the Use of Abusive Generative AI Models on Civitai. In ACM Multimedia Conference (MM), Melbourne, Australia (2024). [Acceptance Rate: 26%] [PDF] Qing Li, Peng Zhang, Gareth Tyson, Yong Jiang, Mingwei Xu, Yulong Lan, and Zhicheng Li. An Elastic Transmission Control Using End-to-End Available Bandwidth Perception. In USENIX Annual Technical Conference (ATC), Santa Clara, CA (2024). [Acceptance Rate: 16%] [PDF] Yiming Zhu, Zhizhuo Yin, Gareth Tyson, Ehsan-ul Haq, Paul Lee and Pan Hui. APT-Pipe: An Automatic Prompt-Tuning Tool for Social Computing Data Annotation. In ACM Web Conference (WWW), Singapore (2024). [Acceptance Rate: 20%] [PDF] Yiluo Wei, Dennis Trautwein, Yiannis Psaras, Ignacio Castro, Will Scott, Aravindh Raman and Gareth Tyson. The Eternal Tussle: Exploring the Role of Centralization in IPFS. In 21st USENIX Symposium on Networked Systems Design and Implementation (NSDI), Santa Clara, CA (2024). [Acceptance Rate: 19%] [PDF] Service Organising Committee Member: TPC Chair, ACM Conference on emerging Networking EXperiments and Technologies (CoNEXT'24) TPC Track Chair, ACM Web Conference - Systems and Infrastructure for Web, Mobile and WoT track (WWW'24) Travel Grant Chair, ACM International Conference on Mobile Systems, Applications, and Services (MobiSys'23) Chair, CoNEXT Student Workshop (CoNEXT'23) TPC Chair, Asian Internet Engineering Conference (AINTEC'23) Online Experience Chair, ACM SIGCOMM Conference (SIGCOMM'22) Travel Grant Chair, ACM Internet Measurement Conference (IMC'22) TPC Chair, Asian Internet Engineering Conference (AINTEC'22) Online Experience Chair, ACM Internet Measurement Conference (IMC'21) TPC Chair, IFIP Networking Conference (Networking'21) Chair, CoNEXT Student Workshop (CoNEXT'21) TPC Chair, International Network Traffic Measurement and Analysis Conference (TMA'20) Chair, ACM Information-Centric Economic, Societal and Governance Workshop (ICE-SoGo'20) Sponsorship Chair for ACM International Conference on emerging Networking EXperiments and Technologies (CoNEXT'19) Organiser of Shadow TPC for ACM Internet Measurement Conference (IMC'19) Chair of Data Science for Bridging the Digital Divide Workshop (Turing Workshop) Organiser of Shadow TPC for ACM Internet Measurement Conference (IMC'18) Travel Grant Chair for IEEE International Conference on Network Protocols (ICNP'18) Local Chair for ACM Internet Measurement Conference (IMC'17) General Chair for AFRICOMM Workshop on Internet Measurements Research in Africa (IMRA'17) Publicity Chair for IEEE INFOCOM Global Internet Symposium (GI'17) Local chair for ACM Symposium on Computing for Development (DEV'15) Poster Chair for ACM Conference on Information-Centric Networking (ICN'15) Publicity Chair for IEEE INFOCOM CrossCloud Workshop (CrossCloud'14) TPC Member: ACM SIGMETRICS Conference (SIGMETRICS'26) New Ideas in Networked Systems (NINeS'26) ACM Internet Measurement Conference (IMC'26) ACM Conference on emerging Networking EXperiments and Technologies (CoNEXT'26) ACM SIGCOMM Conference (SIGCOMM'25) ACM SIGMETRICS Conference (SIGMETRICS'25) ACM Conference on Computer and Communications Security (CCS'25) ACM Internet Measurement Conference (IMC'25) AAAI Conference on Web and Social Media (ICWSM'25) ACM SIGMETRICS Conference (SIGMETRICS'24) ACM Internet Measurement Conference (IMC'24) ACM Conference on emerging Networking EXperiments and Technologies (CoNEXT'24) AAAI Conference on Web and Social Media (ICWSM'24) IEEE/ACM International Symposium on Quality of Service (IWQoS'24) AAAI ICWSM International Workshop on Decentralizing the Web (DeWeb'24) ACM CoNEXT Workshop on the Decentralization of the Internet (DI'24) ACM Internet Measurement Conference (IMC'23) ACM SIGMETRICS Conference (SIGMETRICS'23) AAAI Conference on Web and Social Media (ICWSM'23) Passive and Active Measurement Conference (PAM'23) ACM MobiCom Workshop on Data Privacy and Federated Learning Technologies for Mobile Edge Network (FedEdge'23) ACM Web Conference (WWW'22) ACM International Conference on emerging Networking EXperiments and Technologies (CoNEXT'22) AAAI Conference on Web and Social Media (ICWSM'22) ACM SIGMETRICS Conference (SIGMETRICS'22) Passive and Active Measurement Conference (PAM'22) IEEE ICDCS Workshop on Decentralized Internet, Networks, Protocols, and Systems (DINPS'22) NAACL Workshop on Online Abuse and Harms (WOAH'22) ACM Internet Measurement Conference (IMC'21) ACM International Conference on emerging Networking EXperiments and Technologies (CoNEXT'21) AAAI Conference on Web and Social Media (ICWSM'21) Passive and Active Measurement Conference (PAM'21) International Network Traffic Measurement and Analysis Conference (TMA'21) IFIP Networking Conference (Networking'21) AAAI Conference on Web and Social Media (ICWSM'20) IFIP Networking Conference (Networking'20) ACM Web Sccience Conference (WebSci'20) ACM SIGCAS Computing and Sustainable Societies Conference (COMPASS'20) International Network Traffic Measurement and Analysis Conference (TMA'20) ACM Conference on Information-Centric Networking (ICN'20) ACM International Conference on emerging Networking EXperiments and Technologies (CoNEXT'19) IEEE International Conference on Distributed Computing Systems (ICDCS'19) AAAI Conference on Web and Social Media (ICWSM'19) IEEE INFOCOM Workshop on the Communications and Networking Aspects of Online Social Networks (CAOS'19) International Network Traffic Measurement and Analysis Conference (TMA'19) ACM EuroSys Workshop on Cross-Cloud Systems (CrossCloud'19) IEEE International Conference on Distributed Computing Systems (ICDCS'18) IFIP Networking Conference (Networking'18) IEEE International Conference on Computer Communication Networks (ICCCN'18) AAAI Conference on Web and Social Media (ICWSM'18) International Network Traffic Measurement and Analysis Conference (TMA'18) 2nd ACM SIGCOMM Workshop on Mobile Edge Communications (MECOMM'18) IEEE/ACM International Workshop on Social Human Behaviour Analysis through Online Social Networks and Media (SAO'18) ACM SIGCOMM Conference, Poster and Demo Track (SIGCOMM'17) ACM Conference on Information-Centric Networking (ICN'17) IEEE/ACM International Symposium on Quality of Service (IWQoS'17) AAAI Conference on Web and Social Media (ICWSM'17) 42nd IEEE Conference on Local Computer Networks (LCN'17) IFIP Networking Conference (Networking'17) ACM SIGCOMM Workshop on Mobile Edge Communications (MECOMM'17) IEEE International Conference on COMmunication Systems & NETworkS (COMSNETS'17) 13th SIGCOMM Asian Internet Engineering Conference (AINTEC'17) International Network Traffic Measurement and Analysis Conference (TMA'17) IFIP Networking Workshop on Information-Centric Fog Computing (ICFC'17) I",
  "content_length": 68666,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:51"
}