{
  "name": "Gargi Alavani",
  "homepage": "https://www.bits-pilani.ac.in/goa/gargi-sanket-prabhu",
  "status": "success",
  "content": "Gargi Sanket Prabhu - BITS Pilani Campus Header Institute Header Home Academics Integrated first degree B.E.(Mechanical) B.E.(Electrical and Electronics) B.E.(Computer Science) M.Sc.(Biological Sciences) B.E.(Chemical) M.Sc.(Physics) B.E.(Electronics and Instrumentation) M.Sc.(Chemistry) M.Sc.(Mathematics) M.Sc.(Economics) B.E.(Electronics and Communication) Higher Degree M.E.(Sanitation Science, Technology and Management) M.E.(Embedded Systems) M.E. Chemical Engineering (with specialization in Petroleum Engineering) M.E.(Microelectronics) M.E.(Biotechnology) M.E.(Chemical) M.E.(Mechanical) M.E.(Design Engineering) M.E.(Computer Science) M.E.(Environmental Engineering) Doctor Programmes Electrical & Electronics Engineering Economics & Finance Physics Biological Sciences Humanities & Social Sciences Chemical Engineering Mathematics Computer Science & Information Systems Chemistry Mechanical Engineering Admission Overview Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Sophisticated Instruments Repository Department Biological Sciences Chemical Engineering Chemistry Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Mechanical Engineering Physics Faculty Biological Sciences Chemical Engineering Chemistry Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Mechanical Engineering Physics Students Student Activities Events & Festivals BITScan Picture Gallery Video Gallery Annual Magazine Student Services Admissions Convocation Academic Undergraduate Studies Division (AUGSD) Student Welfare Division Anti Ragging Academic Calendar 2025-26 Prevention of sexual Harassment Wellness & Emergency Helplines For Prospective Students Campus Facilities View Campus Academic Bulletin 2025-26 PMP - A Students’ Initiative Students Club NIRMAAN - Social Responsibility Electronics and Robotics Club (ERC) Centers Teaching Learning Centre Center for Technical Education AI Centre Alumni Quick Links Wellness & Emergency Helplines BITS Goa Virtual Tour Login Links Divisions, Units and Cell Forthcoming Seminars & Workshops Campus Events Calendar About Us Administrative Contacts JRF/SRF/RA Positions Library BITS Media Outreach Hotels around BITS Campus Pilani Dubai K K Birla Goa Hyderabad BITSoM, Mumbai BITS Law School, Mumbai Links For BITS Library Admissions Faculty Practice School Placements Student Arena Career News Alumni Internationalization Events MOUs Current Students Invest in Leaders Outreach Picture Gallery Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions BITSAT IMPORTANT CONTACTS Pilani Dubai Goa Hyderabad RESEARCH & INNOVATION Overview Sponsored Research Projects Consultancy Based Projects Patents Publications R&D Centers DEPARTMENTS Pilani Dubai Goa Hyderabad Academics Integrated First Degree B.E.(Chemical) B.E.(Civil) B.E.(Computer Science) B.E.(Electrical and Electronics) B.E. (Electronics and Computer ) B.E.(Electronics and Communication) B.E.(Electronics and Instrumentation) B.E.(Manufacturing Engineering) B.E.(Mechanical) B.Pharm.(Pharmacy) M.Sc.(Biological Sciences) M.Sc. Semiconductor and Nanoscience B.E. Environmental and Sustainability Engg. M.Sc.(Chemistry) M.Sc.(Economics) M.Sc.(General Studies) M. Sc. (Mathematics) M.Sc.(Physics) B. E. (Mathematics and Computing) Higher Degree MBA (Master of Business Administration) M.E.(Electrical with specialization in Power Electronics and Drives) M.E. Civil – Water Resource Engineering MBA (Master of Business Administration) MBA (Master of Business Administration in Business Analytics) M.E.(Communication) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E. (Mechanical with specialization in Thermal Engineering) M.E. Electronics & Control M.E. M.Pharm M.E.(Biotechnology) M.E.(Chemical) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Transportation Engineering) M.E.(Computer Science) M.E.(Design Engineering) M.E.(Embedded Systems) M.E.(Manufacturing Systems Engineering) M.E.(Mechanical) M.E. Environmental engineering M.E.(Microelectronics) M.E.(Sanitation Science, Technology and Management) M.E.(Software Systems) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmacology) M.Pharm.(Pharmacy) M.Sc. General Studies – Communication and Media Studies Stream Master in Public Health MBA(Master of Business Administration In Business Analytics) Doctoral Programmes Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities & Social Sciences Management Mathematics Mechanical Engineering Pharmacy Physics General Sciences WILP Dubai Campus Integrated First Degree Higher Degree Doctoral Programmes Explore BITS About Legacy Achievements Social Responsibility Sustainability Divisions Pilani Dubai K K Birla Goa Hyderabad Mumbai Pilani K K Birla Goa Hyderabad Dubai follow us Feedback Give us your feedback If you notice any issues or missing content, please let us know. Your feedback helps us improve. Thank you. Upload Screenshot Gargi Sanket Prabhu K K Birla Goa Computer Science & Information Systems Assistant Professor D-159, CS & IS Department BITS Pilani K. K. Birla Goa Campus NH 17B, Bypass, Road, Zuarinagar, Sancoale, Goa 403726 gargia@goa.bits-pilani.ac.in 0832-2580822 https://www.linkedin.com/in/gargi-alavani-b4115b45/?originalSubdomain=in About the Faculty Gargi Alavani Prabhu completed her B.E. and M.Tech from Goa University. She works as a Visiting Assistant Professor in the Department of CS &amp; IS, BITS Pilani, K K Birla Goa Campus, India. She completed her Ph.D. under Prof. Santonu Sarkar and Prof. Neena Goveas on “Prediction of Performance and Power Consumption of GPGPU Applications “ from BITS Pilani. Her research interests are Visual Computing, High-Performance Computing, and Machine Learning.  She has publications in reputable journals/conferences. Loading... Keep Exploring Faculty Events News Academics Admission Campus University Home K K Birla Goa Pilani Hyderabad Dubai BITSoM, Mumbai BITSLAW, Mumbai Faculty Explore Home Integrated first degree Higher Degree Doctor Programmes Academics Integrated first degree Higher Degree Doctor Programmes Admission Overview Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Sophisticated Instruments Repository Department Biological Sciences Chemical Engineering Chemistry Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Mechanical Engineering Physics Faculty Biological Sciences Chemical Engineering Chemistry Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Mechanical Engineering Physics Students Student Activities Student Services For Prospective Students Students Club Centers Teaching Learning Centre Center for Technical Education AI Centre Alumni Quick Links Wellness & Emergency Helplines BITS Goa Virtual Tour Login Links Divisions, Units and Cell Forthcoming Seminars & Workshops Campus Events Calendar About Us Administrative Contacts JRF/SRF/RA Positions Library BITS Media Outreach Hotels around BITS Cookie Consent This website uses cookies or similar technologies, to enhance your browsing experience. Accept",
  "content_length": 7962,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:49"
}