{
  "name": "Garreth W. Tigwell",
  "homepage": "https://www.rit.edu/directory/gwtics-garreth-tigwell",
  "status": "success",
  "content": "Garreth Tigwell | RIT RIT Logo with Text Garreth Tigwell Assistant Professor School of Information Golisano College of Computing and Information Sciences garreth.w.tigwell@rit.edu 585-475-6451 Office Hours Please email me to find out up-to-date information on my office hours. I tend to change them each semester to account for changes in my schedule. Office Location GOL-2657 Garreth Tigwell Assistant Professor School of Information Golisano College of Computing and Information Sciences garreth.w.tigwell@rit.edu 585-475-6451 Personal Links Personal Website Google Scholar X (formerly Twitter) Select Scholarship Journal PaperGriggio, Carla F., Benjamin M. Gorman, and Garreth W. Tigwell. \"Party Face Congratulations! Exploring Design Ideas to Help Sighted Users with Emoji Accessibility when Messaging with Screen Reader Users.\" Proceedings of the ACM on Human-Computer Interaction (PACM HCI) 8. CSCW1 (2024): 1-31. Web.Andrew, Sarah, Chelsea Bishop, and Garreth W. Tigwell. \"Light and Dark Mode: A Comparison Between Android and iOS App UI Modes and Interviews with App Designers and Developers.\" Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) 8. 1 (2024): 1-23. Web.Hassan, Saad, et al. \"Exploring the Benefits and Applications of Video-Span Selection and Search for Real-Time Support in Sign Language Video Comprehension among ASL Learners.\" ACM Trans. Access. Comput. 17. 3 (2024): 1-35. Web.Bhole, Palavi V., et al. \"Haptic2FA: Haptics-Based Accessible Two-Factor Authentication for Blind and Low Vision People.\" Proc. ACM Hum.-Comput. Interact 8. (2024): 1-20. Web.Sin, Jaisie, et al. \"Uncovering inclusivity gaps in design pedagogy through the digital design marginalization framework.\" Frontiers in Computer Science. (2022): 14. Web.Kamarushi, Manisha Varma, et al. \"OneButtonPIN: A Single Button Authentication Method for Blind or Low Vision Users to Improve Accessibility and Prevent Eavesdropping.\" Proc. ACM Hum.-Comput. Interact.. (2022): 22. Web.Menzies, Rachel, Garreth W. Tigwell, and Michael Crabb. \"Author Reflections on Creating Accessible Academic Papers.\" ACM Trans. Access. Comput.. (2022): 36. Web.Andrew, Sarah and Garreth W. Tigwell. \"Accessible Design is Mediated by Job Support Structures and Knowledge Gained Through Design Career Pathways.\" Proc. ACM Hum.-Comput. Interact. (2022): 24. Web.Peer Reviewed/Juried Poster Presentation or Conference PaperLuna, Sanzida Mojib, et al. \"Exploring Visual Scanning in Augmented Reality: Perspectives From Deaf and Hard of Hearing Users.\" Proceedings of the ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’24). Ed. David R. Flatla, et al. NY, NY: ACM.Dai, Jiamin, et al. \"accessFinTech: Designing Accessible Financial Technology.\" Proceedings of the 26th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’24). Ed. David R. Flatla, et al. NY, NY: ACM.Nourian, Laleh, et al. \"Challenges and Considerations for Accessibility Research Across Cultures and Regions.\" Proceedings of the 26th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’24). Ed. David R. Flatla, et al. NY, NY: ACM.Naikar, Vinaya Hanumant, Shwetha Subramanian, and Garreth W. Tigwell. \"Accessibility Feature Implementation Within Free VR Experiences.\" Proceedings of the Extended Abstracts of the CHI Conference on Human Factors in Computing Systems (CHI EA ’24). Ed. Florian Floyd Mueller, et al. NY, NY: ACM.Xu, Jiangnan, et al. \"Spatial Computing: Defining the Vision for the Future.\" Proceedings of the Extended Abstracts of the CHI (CHI EA ’24). Ed. Florian Floyd Mueller, et al. NY, NY: ACM.Luebs, Wenhao, Garreth W. Tigwell, and Kristen Shinohara. \"Understanding Expert Crafting Practices of Blind and Low Vision Creatives.\" Proceedings of the Extended Abstracts of the CHI Conference on Human Factors in Computing Systems (CHI EA ’24). Ed. Florian Floyd Mueller, et al. NY, NY: ACM.Andrew, Sarah, et al. \"Authentication Challenges in Customer Service Settings Experienced by Deaf and Hard of Hearing People.\" Proceedings of the Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems (CHI EA ’23), April 23– 28, 2023, Hamburg, Germany. Ed. Albrecht Schmidt, et al. NY, NY: ACM.Lyke, Nash, Benjamin M. Gorman, and Garreth W. Tigwell. \"Exploring the Accessibility of Crypto Technologies.\" Proceedings of the Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems (CHI EA ’23), April 23– 28, 2023, Hamburg, Germany. Ed. Albrecht Schmidt, et al. NY, NY: ACM.Luna, Sanzida Mojib, et al. \"Communication and Collaboration Among DHH People in a Co-located Collaborative Multiplayer AR Environment.\" Proceedings of the 25th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’23), October 22–25, 2023, New York, NY, USA. Ed. Erin Brady and Maria Wolters. NY, NY: ACM.McDonnell, Emma J., et al. \"Tackling the Lack of a Practical Guide in Disability-Centered Research.\" Proceedings of the 25th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’23), October 22–25, 2023, New York, NY, USA. Ed. Erin Brady and Maria Wolters. NY, NY: ACM.Kokate, Urvashi, Kristen Shinohara, and Garreth W. Tigwell. \"Exploring Accessibility Features and Plug-ins for Digital Prototyping Tools.\" Proceedings of the Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility. Ed. Jon Froehlich, Kristen Shinohara, and Stephanie Ludi. NY, USA: ACM.Pillai, Athira, Kristen Shinohara, and Garreth W. Tigwell. \"Website Builders Still Contribute To Inaccessible Web Design.\" Proceedings of the Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility. Ed. Jon Froehlich, Kristen Shinohara, and Stephanie Ludi. NY, USA: ACM.Nourian, Laleh, Kristen Shinohara, and Garreth W. Tigwell. \"Digital Accessibility in Iran: An Investigation Focusing on Iran’s National Policies on Accessibility and Disability Support.\" Proceedings of the Proceedings of the 24th International ACM SIGACCESS Conference on Computers and Accessibility. Ed. Jon Froehlich, Kristen Shinohara, and Stephanie Ludi. NY, USA: ACM.Dingman, Becca, Garreth W. Tigwell, and Kristen Shinohara. \"Interview and Think-Aloud Accessibility for Deaf and Hard of Hearing Participants in Design Research.\" Proceedings of the 23rd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS \\\\\\'21), October 18–22, 2021, Virtual Event. Ed. Jonathan Lazar, Jinjuan Heidi Feng, and Faustina Hwang. Virtual, Virtual: ACM.Dingman, Becca, Garreth W. Tigwell, and Kristen Shinohara. \"Designing a Podcast Platform for Deaf and Hard of Hearing Users.\" Proceedings of the 23rd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS \\'21), October 18–22, 2021, Virtual Event. Ed. Jonathan Lazar, Jinjuan Heidi Feng, and Faustina Hwang. Virtual, Virtual: ACM.Le, Trinh, et al. \"Exploring a Multifaceted Framework to Support the Design of Mobile Apps for Self-Regulating Anxiety.\" Proceedings of the CHI Conference on Human Factors in Computing Systems Extended Abstracts (CHI ’21 Extended Abstracts), May8–13, 2021, Yokohama, Japan. Ed. Yoshifumi Kitamura and Aaron Quigley. Virtual, Virtual: ACM.Menzies, Rachel, Benjamin M. Gorman, and Garreth W. Tigwell. \"Reflections on Using Chat-Based Platforms for Online Interviews with Screen-Reader Users.\" Proceedings of the 22nd International ACM SIGACCESS Conference on Computers and Accessibility. Ed. Tiago Guerreiro, Hugo Nicolau, and Karyn Moffatt. New York, NY: ACM.Andrew, Sarah, et al. \"A Review of Literature on Accessibility and Authentication Techniques.\" Proceedings of the ASSETS '20: The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. Ed. Tiago Guerreiro, Hugo Nicolau, and Karyn Moffatt. New York, NY: ACM.Menzies, Rachel, et al. \"Weaving Accessibility Through an Undergraduate Degree.\" Proceedings of the 21st International ACM SIGACCESS Conference on Computers and Accessibility. Ed. Jeffrey P. Bigham. New York, New York: ACM.Published Conference ProceedingsMakati, Tlamelo, Garreth W. Tigwell, and Garreth W. Tigwell. \"The Promise and Pitfalls of Web Accessibility Overlays for Blind and Low Vision Users.\" Proceedings of the 26th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’24). Ed. David R. Flatla, et al. NY, NY: ACM, 2024. Web.Hassan, Saad, et al. \"Designing and Evaluating an Advanced Dance Video Comprehension Tool with In-situ Move Identification Capabilities.\" Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI ’24). Ed. Florian Floyd Mueller, et al. NY, NY: ACM, 2024. Web.Luna, Sanzida Mojib, et al. \"Communication, Collaboration, and Coordination in a Co-located Shared Augmented Reality Game: Perspectives From Deaf and Hard of Hearing People.\" Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI ’24). Ed. Florian Floyd Mueller, et al. NY, NY: ACM, 2024. Web.Nourian, Laleh, Kristen Shinohara, and Garreth W. Tigwell. \"Understanding Discussions Around Culture Within Courses Covering Topics on Accessibility and Disability at U.S. Universities.\" Proceedings of the Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), April 23–28, 2023, Hamburg, Germany. Ed. Albrecht Schmidt, et al. NY, NY: ACM, 2023. Web.Geddes, Connor, et al. \"Improving Colour Patterns to Assist People with Colour Vision Deficiency.\" Proceedings of the Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. Ed. Simone Barbosa, et al. NY, USA: ACM, 2022. Web.Shandilya, Esha, Mingming Fan, and Garreth W. Tigwell. \"“I Need to Be Professional until My New Team Uses Emoji, GIFs, or Memes First’’: New Collaborators’ Perspectives on Using Non-Textual Communication in Virtual Workspaces.\" Proceedings of the Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. E",
  "content_length": 16357,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:52"
}