{
  "name": "Garvesh Raskutti",
  "homepage": "http://pages.cs.wisc.edu/~raskutti",
  "status": "success",
  "content": "Garvesh Raskutti's Page Home Publications Bio Since Fall 2013, I have been an Assistant Professor at University of Wisconsin-Madison in the Department of Statistics. I am also an affiliate for the Departments of Computer Science, Electrical and Computer Engineering and the Wisconsin Institute of Discovery Optimization Group. My research interests include statistical machine learning, optimization, graphical and network modeling and information theory with applications to systems biology and neuroscience. Prior to starting at UW, I completed a Masters of Engineering at University of Melbourne in 2008 under the joint supervison of Rodney S. Tucker and Kerry Hinton, and a PhD at UC Berkeley in 2012 under the joint supervision of Martin Wainwright and Bin Yu. I was also a post-doctoral fellow at SAMSI. My CV is attached here. Research My research broadly focusses on challenges that arise in large-scale statistical inference problems.These challenges are espeically motivated by problems in systems biology and neuroscience. Existing methods for solving problems typically suffer from both statistical and computational limitations. I focus on developing methods that address these statistical and computational challenges which leads to: (1) novel algorithms and theoretical insights; (2) potentially novel insights in both systems biology and neuroscience. A list of my publications may be found here. Current Students Yuan Li (PhD) Hyebin Song (PhD) Lili Zheng (PhD) Chengning Zhang (PhD) David Neiman (Senior Undergrad) Colin Kou (Senior Undergrad) Sam Berglin (Sophmore Undergrad) Yuan Ma (Sophmore Undergrad) Former Students Gunwoong Park (Assistant Professor, University of Korea) Han Chen (co-advisor) Grants/Funding NGA HM0476-17-1-2003 (Co-PI) (2017-20) ARO W911NF-17-1-0357 (Co-PI) (2017-20) NSF-DMS 1407028 (Sole PI) (2014-17) NSF-IFDS (Co-Investigator) (2017-20) UW2020 WARF Discovery Initiative (Co-Investigator) (2016-18) UW-Madison Fall Research Competition ('14, '15, '16, '17) Teaching Stat 309 Introduction to Probability (Fall '13, '14, '15, '17 Spring '14, '16) Stat 609 Introduction to Mathematical Statistics (Fall '17) Stat 992 Graphical Models (Spring '15) Stat 679 Introduction to Graphical Models (Fall '15) Teaching award: Honored Instructor (Spring '14, Fall '17) Madison Teaching and Learning Excellence Fellow (Fall '15) © Untitled. All rights reserved. Design by TEMPLATED.",
  "content_length": 2414,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:52"
}