{
  "name": "Gary D. Bader",
  "homepage": "http://baderlab.org",
  "status": "success",
  "content": "Home - Bader Lab @ The University of Toronto Toggle sidebar Toggle navigation Comments Immutable Page Search: Menu Navigation RecentChanges FindPage Local Site Map Help HelpContents HelpOnMoinWikiSyntax Display Attachments Info Raw Text Print View Edit Load Save Login Navigation Home Members Publications Software Community Jobs Funding RecentChanges Biological Systems Lab, Prof. Gary Bader We are a computational biology lab focusing on systems biology at the cell and tissue levels. We have made many contributions to network and pathway analysis and interpretation of genomics data to support biological discovery and precision medicine applications. More recently we are developing computational methods and an ecosystem theory of tissue function, based on single-cell genomics data, that considers cell-cell interactions, cell growth, and cell internal mechanisms, such as pathways, reactions, and causal relationships, to help understand development, cancer as well as regenerative wound healing processes. We support this work by developing open-source biological pathway and network databases and visualization and analysis software, like Cytoscape, Pathway Commons and GeneMANIA, which we collaboratively develop with others. Non-expert explanation Watch the Inner Life of the Cell movie from Harvard Affiliations: The Donnelly Centre Department of Molecular Genetics Department of Computer Science The Lunenfeld-Tanenbaum Research Institute at Sinai Health System Princess Margaret Cancer Centre at University Health Network Collaborative Graduate Program in Genome Biology and Bioinformatics all associated with the University of Toronto The MacMillan Multiscale Human Program, Canadian Institute for Advanced Research Where we are: 160 College Street, Room 602 The Donnelly Centre University of Toronto Toronto, Ontario Canada, M5S 3E1 Map Picture Contact: Gary Bader Phone: 416-978-6888 gary.bader *a-t* utoronto.ca Support Open Access Publishing Home (last edited 2023-02-28 15:16:56 by GaryBader) MoinMoin PoweredPython PoweredGPL licensedValid HTML 4.01 remote server monitor MoinMoin Appliance - Powered by TurnKey Linux",
  "content_length": 2139,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:54"
}