{
  "name": "Gary Tyson",
  "homepage": "http://www.cs.fsu.edu/~tyson",
  "status": "success",
  "content": "Gary Tyson, Computer Science/FSU Home CV Courses Students Research Publications Personal Links Dr. Gary Tyson Dr. Gary Tyson Professor LOV 163 {tyson @ CS} Welcome I am a Professor in the Computer Science Department at FSU. I have served as the Chair of the Advisory Council of Faculty Senates (ACFS) for the public universities in Florda, and as a member of the State University System Board of Governors. I was the President of the FSU Faculty Senate and member of the FSU Board of Trustees and FSU Foundation Board of Trustees from 2013 - 2015. I received my PhD in Computer Science from the University of California - Davis, after earning an MS and BS in Computer Science from CSU-Sacramento. I joined the faculty at UC-Riverside in 1995 before leaving to join the faculty at the University of Michigan in the EECS department in 1997. In 2003 when I left to join the faculty at FSU. Through most of that history I was a computer architect, working on cache design and some other processor optimizations. My current research is now split into three areas: Computer Architecture, AI/Large Language Models, and Edge/mobile systems. It is quite a broad range of topics, but my students try to keep me informed about their latest findings. My research is funded by the National Science Foundation, Intel Corporation, IBM, and (of course) taxpayers throughout the country. I was also the founding director of the FSU center for Genomics and Personalized Medicine. Basically that means that I pushed the proposal through the forest of paperwork at FSU to get the center created and pasted the duties of director over to someone more suitable to build the center. The goal of the center is to bring faculty from different departments together to work on research with a focus on genomics. This is one of a number of big data initiatives on campus. I now spend much of my time doing committee work for the university, but I still teach courses in data science, computer architecture, advanced programming and ethics/public speaking. Office LOV 163 Email {gtyson@fsu.edu} Phone {phone} ©Gary Tyson Modified 10 July 2017 Licenses",
  "content_length": 2122,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:56"
}