{
  "name": "Gary M. Carter",
  "homepage": "http://www.csee.umbc.edu/people/faculty/gary-m-carter",
  "status": "success",
  "content": "Gary M. Carter – Department of Computer Science and Electrical Engineering – UMBC Skip to main content Department of Computer Science and Electrical Engineering Menu Apply Search Search Context This Site All of UMBC Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn Position Professor of Computer Science and Electrical Engineering Office 325G Information Technology and Engineering (ITE) Building Contact Information University of Maryland, Baltimore County 1000 Hilltop Circle Baltimore, MD 21250 phone: (410) 455-3509 email: carter@umbc.edu website: http://userpages.umbc.edu/~carter Education Ph.D., Physics, MIT, 1975 M.S., Physics, MIT, 1969 B.S., University of Washington, 1967 Research Areas Professor Carter has spent the last 25 years working on High Data rate Optical Communications. His recent work in this area included the co-leading a team that developed a record breaking nonlinear optical semiconductor wave guide for applications in format and wavelength conversion in optical communication systems. He has also been active in the area of coherent optical communications. He is transitioning this research from long haul to data center applications. He is also collaboratively pursuing mobile time transfer using optical techniques. Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 2318,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:55"
}