{
  "name": "Gary K. Fedder",
  "homepage": "https://users.ece.cmu.edu/~fedder",
  "status": "success",
  "content": "Gary K. Fedder Gary K. Fedder Hamerschlag University Professor of Electrical and Computer Engineering 249 Roberts Engineering Hall (REH 249) Carnegie Mellon University 5000 Forbes Ave. Pittsburgh, PA 15213-3890 Faculty Director, Manufacturing Futures Institute (MFI) Mill 19, Building A 4501 Lytle Street Pittsburgh, PA 15207-1892 phone: (412)-268-8443 fedder@cmu.edu Administrative Assistant Jacqueline Chraska 334 Roberts Engineering Hall :) (412)-268-3096 chraska@ece.cmu.edu Affiliations and Profiles Manufacturing Futures Institute (MFI) Department of Electrical and Computer Engineering The Robotics Institute (Adjunct Faculty) Department of Mechanical Engineering (Courtesy Faculty) Department of Biomedical Engineering (Courtesy Faculty) LinkedIn, Google Scholar Other research profiles: CMU Scholars (Symplectic Elements), ORCID, Web of Science, Scopus, Mendeley, ResearchGate, Pivot Bio Dr. Fedder arrived at the university in 1994 with a joint faculty appointment in the Department of Electrical and Computer Engineering and The Robotics Institute. He currently is Hamershlag University Professor in ECE, with courtesy faculty appointments in The Robotics Instiutute, Mechanical Engineering and Biomedical Engineering. He is faculty director of Carnegie Mellon's Manufacturing Futures Institute (MFI), whose mission is to cataylze technological advances in agile, intelligent, efficient and resilient manufacturing. He previously served in administrative roles as Vice Provost for Research (2015-2017,2018), Director of the Institute for Complex Engineered Systems (2006-2013, now known as the Engineering Research Accelerator), as Associate Dean for Research in the College of Engineering (2013-2015) and as Interim Chief Executive Officer for the Advanced Robotics for Manufacturing (ARM) Institute (2/2017-1/2018; 1/2020-7/2020). Dr. Fedder earned his B.S. and M.S. degrees in EECS(6.1) from MIT in 1982 and 1984, respectively. From 1984 to 1989, he worked at the Hewlett-Packard Company on circuit design and printed-circuit modeling. In 1994, he obtained the Ph.D. degree in EECS from the University of California at Berkeley, where his research resulted in the first demonstration of multimode control of an underdamped surface-micromachined inertial device. His research interests include advanced manufacturing, digital twins for manufacturing, design and modeling of microsensors and microactuators, aerosol jet printing, stretchable electronics, fabrication of integrated MEMS with electronic circuits using conventional CMOS processing, and implantable microsystems. In 2007, he was elevated to IEEE Fellow for contributions to integrated micro-electro-mechanical-system processes and design methodologies. His awards include the 1993 AIME Electronic Materials Society Ross Tucker Award, the 1996 Carnegie Institute of Technology George Tallman Ladd Research Award, and a 1996 NSF CAREER Award. Currently, he serves on the executive editorial board for the IoP Journal of Micromechanics and Microengineering, on the editorial board of IET Micro & Nano Letters, and as co-editor of the Wiley-VCH Advanced Micro- and Nanosystems book series. He served on the editorial board of the IEEE Journal of Microelectromechanical Systems from 2001 to 2013 and on the editorial board of SPIE Journal of Micro/Nanolithography, MEMS, and MOEMS from 2010 to 2013. He served as the 2015 Transducers Conference regional program chair for the Americas, as general chair of the 2010 IEEE Sensors Conference, and as general co-chair of the 2005 IEEE MEMS Conference. Professor Fedder has contributed to over 300 research publications and holds 23 patents in the MEMS area. From 2011 to 2012, Dr. Fedder served as a technical co-lead in the U.S. Advanced Manufacturing Partnership where he worked with industry, academia and government to generate recommendations that motivated the launch of the National Network for Manufacturing Innovation (NNMI) now known as Manufacturing USA. He co-led the proposal that landed the $70M pilot institute for the NNMI, America Makes, and served on its Executive Committee from 2012 to 2016. In 2016`, Dr.Fedder co-led with Professor Howie Choset a successful proposal to the Department of Defense to launch the ARM Institute, which became an institute in the national network of Manufacturing USA Institutes on January 9, 2017. As founding president of the ARM Institute and Interim CEO through its first year, Dr. Fedder built the organization and grew its consortium membership to more than 100 industry, academic and non-profit organizations. He currently sits on the ARM Institute's Board of Directors. Research - MEMS Laboratory My research interests are in the multidisciplinary areas of advanced manufacturing and microelectromechanical systems (MEMS). Current research activities include digital twins for manufacturing, generative manufacturing, aerosol jet printing, and electronics embedded in stretchable substrates. As faculty director of CMU's Manufacturing Futures Institute, I manage a research program spanning additive manufacturing, intelligent robotics, digital twin technologies, biomanufacturing, micro/nanomanufacturing and the future of work for manufacturing. In MEMS, micron- to millimeter-size systems with sophisticated abilities to interact with their environment are manufactured through the use of VLSI-based photolithographic batch fabrication methods. Benefits of this approach include much lower manufacturing cost, greater miniaturization, greater integration, and in many cases higher performance than can be achieved with conventional methods used to build systems requiring sensors and actuators. Two legacy foundational themes in my group are the monolithic integration of MEMS in conventional foundry CMOS processes and a system-level design methodology and corresponding simulation tools. The diverse set of research projects in my group links to a long-term trend toward low-cost intelligent systems that benefit from embedded MEMS, often merged with other emerging technologies, for example, nanomaterials, 3D printing and soft robotics. Past MEMS projects include system modeling and design methodologies, accelerometers and gyroscopes for motion sensing, an electrothermal microcooler system, ultra-compliant neural probes, piezoelectric energy scavenging for implantable pressure sensors, nonlinear parametric microresonators, and self-healing RF microresonator oscillators and filters. Revised: June 19, 2025 by fedder@cmu.edu",
  "content_length": 6511,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:54"
}