{
  "name": "Gary Hsieh",
  "homepage": "http://faculty.washington.edu/garyhs",
  "status": "success",
  "content": "Gary Hsieh curriculum vitae Human Centered Design & Engineering University of Washington garyhs@uw.edu 414 Sieg Hall, Campus Box 352315 University of Washington Seattle, WA 98195 P: +1 (206) 543 9747 F: +1 (206) 543 9747 Introduction I am a professor in the Department of Human Centered Design & Engineering (HCDE) and an adjunct professor in the Paul G. Allen School of Computer Science & Engineering at University of Washington. I am also affiliated with the Center for an Informed Public. My research group, Prosocial Computing Group, focuses on understanding, designing, and developing technologies that encourage people to communicate and interact in ways that are self- and welfare-improving. We extend and build on theories from a number of fields, including psychology, communication and economics. Our application areas include behavior change, online support and Q&A, and civic and local participation. I was previously faculty at Michigan State University with a joint appointment in Communication and Media and Information. I received my PhD in Human-Computer Interaction from the School of Computer Science at Carnegie Mellon University. My research has been supported by National Science Foundation, National Institute of Health, Center for Disease Control and Prevention, Fulbright, Nokia, Intel, Microsoft, Google, UW ALACRITY Center, and Institute of Translational Health Sciences. I have served as an academic consultant for Twitter, Philips Healthcare, and Rulai. Interested in Research? I work with graduate and undergraduate students who are intersted in human-computer interaction, social computing, behavior change, translational science, and related topics. Send me an email to schedule a 30 minutes meeting. Please include: Why Me? There are a lot of great faculty in HCDE at UW. Why do you want to work with me specifically? Is there some interest you have related to my recent publications? Your Background and Skills. Are you good at design? Can you code? Are you a good writer? Have you conducted experiments? Can you interview? Send me some samples or a link to your portfolio. I work with students with a variety of backgrounds. This info will help me decide if there are any projects that you might be able to contribute to. News Launched Paper2Card Tool to translate academic papers into design cards. Try it and give us feedback! Current Students & Collaborators PhD Students Ruoxi (Anna) Shang Ruican Zhong Donghoon Shin Hyeonjeong Byeon Alumni PhD Students & Post-Docs Spencer Williams (2023), Assistant Teaching Professor @ UW Information School Raina Langevin (2023), NLM Postdoctoral Fellow at UW BIME Ravi Karkar (2022), Assistant Professor @ UMass Amhearst Rafal Kocielnik (2021), CI Fellow @ Caltech Lucas Colusso (2020), Senior Designer @ Microsoft Elena Agapie (2020), Assistant Professor @ UC Irvine Mia Minhyang Suh (2020), Senior UX Researcher @ Google Masters Students Yennee Chew Design Manager @ Big x Reality Kerem Özcan Product Analyst @ Uber Lillian Xiao UX Designer @ VW Lily Lei Co-Founder @ August Sage David Wang Engineer @ Google Karan Gupta Designer @ Google India Siddhartha Gudipati Senior Interaction Designer @ Google Nicolas Friederici Senior Researcher @ HIIG Publication PosterMate: Audience-driven Collaborative Persona Agents for Poster Design Donghoon Shin, Daniel Lee, Gary Hsieh, Gromit Yeuk-Yin Chan. UIST 2025: Proceedings of the 2025 ACM User Interface Software and Technology PlanFitting: Personalized Exercise Planning with Large Language Model-driven Conversational Agent (2025) Donghoon Shin, Gary Hsieh, Young-Ho Kim. CUI 2025: Proceedings of the 2025 ACM Conversational User Interfaces What About My Design Context?: Exploring the Use of Generative AI to Support Customization of Translational Research Artifacts (2025) Donghoon Shin, Tze-Yu Chen, Gary Hsieh, Lucy Lu Wang. DIS 2025: Proceedings of the 2025 ACM Designing Interactive Systems Conference Optimizing the user-experience (UX) and-- interface (UI) of a mHealth application to aid recovery from burn injury (BurnCORE) through a user-centered design approach (2025) Barclay T Stewart, Kyler Menge, T Varugis Kurien, Caitlin Orton, Rebecca Estrada, Gretchen Carrougher, Callie Thompson, Gary Hsieh, Tam N Pham. Burns Open Rethinking Teaching Evaluation Reports: Designing AI-transformed Student Feedback for Instructor Engagement (2025) Ruoxi Shang, Keri Mallari, Wei Bin Au Yeong, Ken Yasuhara, Anthony Tang, Gary Hsieh. CSCW 2025: Proceedings of the ACM on human-computer interaction SCOPE: Examining Technology-Enhanced Collaborative Care Management of Depression in the Cancer Setting (2025) Anant Mittal, Tae Jones, Ravi Karkar, Jina Suh, Spencer Williams, Yihao Zheng, Lydia M Andris, Nicole Bates, Amy M Bauer, Ty W Lostuter, Jesse R Fann, James Fogarty, Gary Hsieh. CSCW 2025: Proceedings of the ACM on human-computer interaction Patient and clinician acceptability of automated extraction of social drivers of health from clinical notes in primary care (2025) Serena Jinchen Xie, Carolin Spice, Patrick Wedgeworth, Raina Langevin, Kevin Lybarger, Angad Preet Singh, Brian R Wood, Jared W Klein, Gary Hsieh, Herbert C Duber, Andrea L Hartzler. Journal of the American Medical Informatics Association Comparing Large Language Model AI and Human-Generated Coaching Messages for Behavioral Weight Loss (2025) Zhuoran Huang, Michael P Berry, Christina Chwyl, Gary Hsieh, Jing Wei, Evan M Forman. Journal of technology in behavioral science AI-Assisted Causal Pathway Diagram for Human-Centered Design (2024) Ruican Zhong, Donghoon Shin, Rosemary Meza, Predrag Klasnja , Lucas Colusso, Gary Hsieh. CHI 2024: ACM Conference on Human Factors in Computing Systems From Paper to Card: Transforming Design Implications with Generative AI (2024) Donghoon Shin, Lucy L. Wang, Gary Hsieh. CHI 2024: ACM Conference on Human Factors in Computing Systems To Reply or to Quote: Comparing Conversational Framing Strategies on Twitter (2024) Himanshu Zade, Spencer Williams, Theresa T. Tran, Christina Smith, Sukrit Venkatagiri, Gary Hsieh, Kate Starbird. Journal on Computing and Sustainable Societies Implementation Fidelity of Chatbot Screening for Social Needs: Acceptability, Feasibility, Appropriateness (2023) Raina Langevin, Andrew BL Berry, Jinyang Zhang, Callan E Fockele, Layla Anderson, Dennis Hsieh, Andrea Hartzler, Herbert C Duber, Gary Hsieh. Applied Clinical Informatics IntroBot: Exploring the Use of Chatbot-assisted Familiarization in Online Collaborative Groups (2023) Donghoon Shin, Soomin Kim, Rouxi Shang, Joonhwan Lee, Gary Hsieh. CHI 2023: ACM Conference on Human Factors in Computing Systems What is in the Cards: Exploring Uses, Patterns, and Trends in Design Cards (2023) Gary Hsieh, Brett A. Halperin, Evan Schmitz, Yen Nee Chew, Yuan-Chi Tseng. CHI 2023: ACM Conference on Human Factors in Computing Systems Probing a Community-Based Conversational Storytelling Agent to Document Digital Stories of Housing Insecurity (2023 *Best Paper Award) Brett A. Halperin, Gary Hsieh, Erin McElroy, James Pierce, Daniela K. Rosner. CHI 2023: ACM Conference on Human Factors in Computing Systems Association between Risk Communication Format and Perceived Risk of Adverse Events after COVID-19 Vaccination among US Adults (2023) Joshua E. Rosen, Sylvia Seo Eun Chang, Spencer Williams, Joy S. Lee, DaHee Han, Nidhi Agrawal, Joseph H. Joo, Gary Hsieh, Katharina Reinecke, Joshua M. Liao. Healthcare Tweet Trajectory and AMPS-based Contextual Cues can Help Users Identify Misinformation (2023) Himanshu Zade, Megan Woodruff, Erika Johnson, Mariah Stanley, Zhennan Zhou, Minh Tu Huynh, Alissa E. Acheson, Gary Hsieh, Kate Starbird. CSCW 2023: ACM Conference on Computer Supported Cooperative Work Meta-summaries Effective for Improving Awareness and Understanding of COVID-19 Vaccine Safety Research (2022) Spencer Williams, Joy Lee, Brett Halperin, Joshua M. Liao, Gary Hsieh, Katharina Reinecke. Scientific Reports An HCI Research Agenda for Online Science Communication (2022) Spencer Williams, Ridley Jones, Katharina Reinecke, Gary Hsieh. CSCW 2022: ACM Conference on Computer Supported Cooperative Work A Longitudinal Goal Setting Model for Addressing Complex Personal Problems in Mental Health (2022) Elena Agapie, Patricia A. Arean, Gary Hsieh, Sean Munson. CSCW 2022: ACM Conference on Computer Supported Cooperative Work Making Crafting Visible While Rendering Labor Invisible on the Etsy Platform. (2022) Lubna Razaq, Beth Kolko, Gary Hsieh. DIS 2022: ACM Conference on Designing Interactive Systems Can I Talk to You about Your Social Needs? Understanding Preference for Conversational User Interface in Health (2021 *Best Paper Honorable Mention) Rafal Kocielnik, Raina Langevin, James S George, Shota Akenaga, Amelia Wang, Darwin P Jones, Alexander Argyle, Callan Fockele, Layla Anderson, Dennis T Hsieh, Kabir Yadav, Herbert C Duber, Gary Hsieh, Andrea L Hartzler. CUI 2021: ACM Conference on Conversational User Interfaces The Effects of User Comments on Science News Engagement (2021) Spencer Williams, Gary Hsieh. CSCW 2021: ACM Conference on Computer Supported Cooperative Work Heuristic Evaluation of Conversational Agents (2021 *Best Paper Award) Raina Langevin, Ross Lordon, Thi Avrahami, Benjamin Cowan, Tad Hirsch, Gary Hsieh. CHI 2021: ACM Conference on Human Factors in Computing Systems Understanding Analytics Needs of Video Game Streamers (2021) Keri Mallari, Spencer Williams, Gary Hsieh. CHI 2021: ACM Conference on Human Factors in Computing Systems Human Values and Digital Citizen Science Interactions (2021) Victoria Palacina, Maria Angela Ferrario, Gary Hsieh, Antti Knutas, Annika Wolff, Jari Porras. IJHCS: International Journal of Human-Computer Studies Parallel Journeys of Patients with Cancer and Depression: Challenges and Opportunities for Technology-Enabled Collaborative Care (2020) Jina Suh, Spencer Williams, Jesse R Fann, James Anthony Fogarty, Amy M Bauer, Gary Hsieh. CSCW 2020: ACM Conference on Computer",
  "content_length": 22259,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:55"
}