{
  "name": "Gautam Kamath 0001",
  "homepage": "http://www.gautamkamath.com",
  "status": "success",
  "content": "Gautam Kamath's Homepage Gautam Kamath Office: DC 1311 Cell Phone: 657-c0mpsci (657-206-7724) Email: g@csail.mit.edu Links to: CV (as of May 2025); Google Scholar; DBLP; arXiv; GitHub; Twitter; Youtube; Blog. My group is The Salon. I host office hours as part of the Learning Theory Alliance. Book a slot here. Feel free to send me comments anonymously here. Note that, by design, I won't be able to respond -- if you need me to, it's better handled via email, or leaving some way for me to reply. About Me I am an Assistant Professor at the University of Waterloo's Cheriton School of Computer Science, a Faculty Member at the Vector Institute, and a Canada CIFAR AI Chair. I run The Salon. I'm interested in reliable and trustworthy statistics and machine learning, including considerations such as data privacy and robustness. I will be moving to the Computer Science department at the Courant Institute of Mathematical Sciences at NYU in September 2026, and am searching for members to join my group there. More details are available here, and a form to indicate interest is available here. I was a Microsoft Research Fellow at the Simons Institute for the Theory of Computing for the Fall 2018 semester program on Foundations of Data Science and the Spring 2019 semester program on Data Privacy: Foundations and Applications. Before that, I completed my Ph.D. at MIT, affiliated with the Theory of Computing group in CSAIL. I was very fortunate to be advised by Costis Daskalakis. Before MIT, I spent four wonderful years at Cornell University, graduating in May 2012 with a degree in Computer Science and Electrical and Computer Engineering. At Cornell, I was incredibly lucky to have the opportunity to work with Bobby Kleinberg. News (11/22/25) I am now a member of the executive committee of the Symposium on Foundations of Responsible Computing. (11/7/25) Demystifying Foreground-Background Memorization in Diffusion Models accepted to AAAI 2026. (10/9/25) I will be attending a joint NYU and Oxford workshop on mathematical foundations of AI, in January in London. (10/8/25) I am giving a talk at ETHZ's AI center on October 17, and speaking at Daegu Global Robot Business Forum on October 22. (9/18/25) Two papers (1, 2) accepted to NeurIPS 2025. (9/9/25) New paper on arXiv: Not All Samples Are Equal: Quantifying Instance-level Difficulty in Targeted Data Poisoning. (8/28/25) I am teaching CS 480: Introduction to Machine Learning in Fall 2025. Stay tuned for the website. (8/28/25) I will be a jury member on Youssef Allouah's PhD thesis committee. (8/18/25) New paper on arXiv: Demystifying Foreground-Background Memorization in Diffusion Models. (8/16/25) The Broader Landscape of Robustness in Algorithmic Statistics to appear in IEEE BITS magazine. (8/6/25) I will be a senior program committee member for ALT 2026. (7/31/25) I will be giving a talk at The 7th Privacy-Preserving Machine Learning Workshop 2025 at CRYPTO 2025. (7/30/25) I will be on the external review committee for Reed College's Computer Science department. (7/29/25) I will be a reader of Junhao Lin's Master's thesis. (7/22/25) I am now a member of the ICML board, for a three year term. (7/8/25) I organized the 3rd Vector Institute ML Privacy and Security workshop. I gave a talk on machine unlearning. (6/30/25) I will be on the program committee of SaTML 2026. (6/12/25) I will be a co-chair of social media and publicity for AAAI 2026. (5/14/25) Mentee Valentio Iverson wins the Germain-Erdős Undergraduate Award in Mathematical Research. (5/3/25) Optimal Differentially Private Sampling of Unbounded Gaussians accepted to COLT 2025. (5/1/25) On the Learnability of Distribution Classes with Adaptive Adversaries accepted to ICML 2025. (4/29/25) I am a recipient of the Ontario Early Researcher Award. (4/9/25) I am joining the editorial board of the Journal of Privacy and Confidentiality. (3/3/25) New paper on arXiv: Optimal Differentially Private Sampling of Unbounded Gaussians. (2/28/25) I will be on the program committee for SODA 2026. (2/5/25) Quoted in a Toronto Star article about data privacy. (1/22/25) One paper accepted to ICLR 2025. (1/21/25) I will be speaking at Symposium on Mathematical Foundations of Trustworthy Machine Learning in Ascona, Switzerland in October 2025. (1/21/25) I will be participating in an ACL Mentorship Panel. (1/14/25) I was quoted in a news article about NeurIPS high school projects. (1/2/25) Undergraduate advisee Chris Trevisan wins the 2025 CRA Outstanding Undergraduate Researcher Award. (1/1/25) Unbiased Statistical Estimation and Valid Confidence Intervals Under Differential Privacy published in Statistica Sinica. Older News Research Most authorships are in alphabetical order, as is common in areas of computer science. Papers with contribution-order authorship are indicated, and equal contributions are marked with * or ^. Generally, these will put the students as first-author, with equal contribution amongst the senior authors. ⓡ is used for randomized author order. Selected Papers (Show all) Not All Samples Are Equal: Quantifying Instance-level Difficulty in Targeted Data Poisoning. William Xu*, Yiwei Lu*, Yihan Wang, Matthew Y.R. Yang, Zuoqiu Liu, Gautam Kamath^, Yaoliang Yu^. (Contribution order) Manuscript. Demystifying Foreground-Background Memorization in Diffusion Models. Jimmy Z. Di*, Yiwei Lu*, Yaoliang Yu^, Gautam Kamath^, Adam Dziedzic^, Franziska Boenisch^. (Contribution order) Proceedings of the Fortieth AAAI Conference on Artificial Intelligence (AAAI 2026). Query-Efficient Locally Private Hypothesis Selection via the Scheffe Graph. Gautam Kamath, Alireza F. Pour, Matthew Regehr, David P. Woodruff. Advances in Neural Information Processing Systems 38 (NeurIPS 2025). BridgePure: Limited Protection Leakage Can Break Black-Box Data Protection. Yihan Wang*, Yiwei Lu*, Xiao-Shan Gao^, Gautam Kamath^, Yaoliang Yu^. (Contribution order) Advances in Neural Information Processing Systems 38 (NeurIPS 2025). The Broader Landscape of Robustness in Algorithmic Statistics. Gautam Kamath. IEEE BITS the Information Theory Magazine, to appear, 2025+. Optimal Differentially Private Sampling of Unbounded Gaussians. Valentio Iverson, Gautam Kamath, Argyris Mouzakis. Proceedings of the 38th Annual Conference on Learning Theory (COLT 2025). On the Learnability of Distribution Classes with Adaptive Adversaries. Tosca Lechner, Alex Bie*, Gautam Kamath*. (Contribution order) Proceedings of the 42nd International Conference on Machine Learning (ICML 2025). Machine Unlearning Fails to Remove Data Poisoning Attacks. Martin Pawelczyk*, Jimmy Z. Di*, Yiwei Lu, Gautam Kamath^, Ayush Sekhari^, Seth Neel^. (Contribution order) Proceedings of the 13th International Conference on Learning Representations (ICLR 2025). Presented at the ICML 2024 2nd Workshop on Generative AI and Law. Oral Presentation. A Bias-Accuracy-Privacy Trilemma for Statistical Estimation. Gautam Kamath, Argyris Mouzakis, Matthew Regehr, Vikrant Singhal, Thomas Steinke, Jonathan Ullman. Journal of the American Statistical Association, to appear, 2025+. Presented at TPDP 2023. Membership Inference Attacks Cannot Prove that a Model Was Trained On Your Data. Jie Zhang, Debeshee Das, Gautam Kamath, Florian Tramèr. (Contribution order) Proceedings of the 2025 IEEE Conference on Secure and Trustworthy Machine Learning (SaTML 2025). Avoiding Pitfalls for Privacy Accounting of Subsampled Mechanisms under Composition. Christian Janos Lebeda*, Matthew Regehr*, Gautam Kamath^, Thomas Steinke^. (Contribution order) Proceedings of the 2025 IEEE Conference on Secure and Trustworthy Machine Learning (SaTML 2025). Choosing Public Datasets for Private Machine Learning via Gradient Subspace Distance. Xin Gu, Gautam Kamath*, Zhiwei Steven Wu*. (Contribution order) Proceedings of the 2025 IEEE Conference on Secure and Trustworthy Machine Learning (SaTML 2025). Presented at the NeurIPS 2022 Workshop on Distribution Shifts. Presented at TPDP 2023. Private Mean Estimation with Person-Level Differential Privacy. Sushant Agarwal, Gautam Kamath, Mahbod Majid, Argyris Mouzakis, Rose Silver, Jonathan Ullman. Proceedings of the 36th Annual ACM-SIAM Symposium on Discrete Algorithms (SODA 2025). Unbiased Statistical Estimation and Valid Confidence Intervals Under Differential Privacy. Christian Covington, Xi He*, James Honaker*, Gautam Kamath*. (Contribution order) Statistica Sinica, 35(Online Special Issue I), 2025. Presented at the ICML 2021 Workshop on Theory and Practice of Differential Privacy (TPDP 2021). Report of the 1st Workshop on Generative AI and Law. A. Feder Cooper, Katherine Lee, James Grimmelmann, Daphne Ippolito, Christopher Callison-Burch, Christopher A. Choquette-Choo, Niloofar Mireshghallah, Miles Brundage, David Mimno, Madiha Zahrah Choksi, Jack M. Balkin, Nicholas Carlini, Christopher De Sa, Jonathan Frankle, Deep Ganguli, Bryant Gipson, Andres Guadamuz, Swee Leng Harris, Abigail Z. Jacobs, Elizabeth Joh, Gautam Kamath, Mark Lemley, Cass Matthews, Christine McLeavey, Corynne McSherry, Milad Nasr, Paul Ohm, Adam Roberts, Tom Rubin, Pamela Samuelson, Ludwig Schubert, Kristen Vaccaro, Luis Villa, Felix Wu, Elana Zeide. Manuscript. Differentially Private Post-Processing for Fair Regression. Ruicheng Xian, Qiaobo Li, Gautam Kamath, Han Zhao (Contribution order) Proceedings of the 41st International Conference on Machine Learning (ICML 2024). Disguised Copyright Infringement of Latent Diffusion Models. Yiwei Lu*, Matthew Y.R. Yang*, Zuoqiu Liu*, Gautam Kamath^, Yaoliang Yu^. (Contribution order) Proceedings of the 41st International Conference on Machine Learning (ICML 2024). Presented at the ICML 2024 2nd Workshop on Generative AI and Law. Position: Considerations for Differentially Private Learning with Large-Scale Public Pretraining. Florian Tramèr*, Gautam Kamath*, Nicholas Carlini*. (Reverse alphabetical order) Proceedings of the 41st International Conference on Machine Learning (ICML 2024). Oral Present",
  "content_length": 39671,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:57"
}