{
  "name": "Gavin J. Doherty",
  "homepage": "https://www.scss.tcd.ie/Gavin.Doherty",
  "status": "success",
  "content": "Dr. Gavin Doherty – Academic homepage Skip to content News / Paper We were delighted to see Jacinta Jardine’s 2024 ACM Transactions on Computer-Human Interaction paper “Between Rhetoric and Reality: Real-world Barriers to Uptake and Early Engagement in Digital Mental Health Interventions” listed as a notable paper by the journal, and happy also to see Rob Bowman’s recently accepted IJHCS paper “Mental Health Management as a Social Endeavour: Challenges and Opportunities for Conversational Agent Design” featured in Microsoft Research Focus. … Read more News Congratulations are due to Andreas Balaskas who successfully passed his PhD viva in the School of Computer Science and Statistics, here at Trinity College Dublin. His thesis is entitled “The design space of mobile mental health interventions for anxiety management”, and his work examines what these applications do, what they can do, and how they can be improved. Thanks to co-supervisors Prof. Anna Cox (UCL) and Dr. Stephen Schueller (UC Irvine) for their support throughout. Thanks to external examiner Prof. Raymond Bond (Ulster), internal examiner Dr.… Read more News I was delighted to pick up the Commercialisation Impact award from Knowledge Transfer Ireland at the ceremony on 1st December, on behalf of SilverCloud Health and Trinity College Dublin. The award is a lovely recognition of the many years of research and development work that has gone into the development of the SilverCloud digital health platform. Many thanks to Trinity Research and Innovation for the nomination and their support over the years, and to all those who have made the platform and company such a success.… Read more News Congratulations are due to Camille Nadal and Seán Cronin who successfully passed their PhD viva voce examinations last month, subject to the usual minor revisions. Camille Nadal with her thesis Seán Cronin with external examiner Dr. Julie Doyle Camille’s thesis is entitled “User Acceptance of Health and Mental Health Care Technologies”. Thanks to the external examiner – Prof. Stephanie Wilson, City, University of London, internal examiner Dr. David Lewis, and chair Prof. Declan O’Sullivan, and to external co-supervisor Prof. Corina Sas, University of Lancaster.… Read more News / Paper Congratulations to Camille Nadal and the team for winning a best paper award (top 1% of submissions) at the ACM CHI 2022 conference. CHI is the leading international venue for Human-Computer Interaction research, and this is a fantastic achievement. User acceptance is key for the successful uptake and use of health technologies, but is impacted by numerous factors not always easily accessible nor operationalised by designers in practice. This work seeks to facilitate the application of acceptance theory in design practice through the Technology Acceptance (TAC) toolkit: a novel theory-based design tool and method.… Read more Vacancies Postdoctoral position in Human-AI Collaboration for Sustainable Security The School of Computer Science and Statistics at Trinity College Dublin (http://www.tcd.ie) is looking for applications for a 2-year Post-doctoral research position in the area of Human-Computer Interaction for sustainable adaptive security, with a particular focus on designs which support Human-AI collaboration. Topic As computers come to be used in every aspect of our lives, computer security has become a pressing issue, impacting on us both in terms of threats to our privacy and livelihoods, and in terms of the burden imposed by efforts to protect ourselves.… Read more Vacancies We are currently looking for a candidate with background in Human-Computer Interaction to undertake a funded PhD in the area of HCI for Digital Health as part of the D-real Centre for Research Training. The PhD will focus on apps to support psychotropic medication management and tapering. Applications will open shortly through the d-real website: http://d-real.ie/apply Title: Designing apps to support psychotropic medication management and tapering Supervisory Team: Gavin Doherty, TCD (Computer Science) / Jane Walsh, NUIG (Psychology) / Cathal Cadogan, TCD (Pharmacy) Psychotropic medications, such as antidepressants, are widely used in the treatment of mental health disorders, and can be a valuable approach.… Read more Event / News I was glad to celebrate the achievements of inventors and innovators across TCD last night at the Trinity Innovation Awards, where I was presented with an award for my work leading to the formation of SilverCloud Health, and role as co-founder. It has been a joy to see the incredible team at SilverCloud achieve global impact in the area of digital health over the last decade. … Read more News / Paper We are delighted to see three papers from the Health Technology Design Group at Trinity College Dublin accepted to the ACM CHI Conference on Human Factors in Computing Systems – the premier venue for research in Human-Computer Interaction. The papers look at how we design for user acceptance (Nadal et al.), at user acceptance of digital COVID-19 certificates (Nurgalieva et al.), and at mechanisms for interacting with touchless medical imaging systems (Cronin et al.). Congratulations to everyone involved, and a particular thanks to our international collaborators on each of the papers.… Read more Paper Machine learning methods have the potential to enable the development of more personalized approaches to treatment of mental health conditions. Digital treatment delivery may be particularly amenable to the application of these techniques. I am delighted to be a co-author of a paper from a cross-disciplinary international team, published in World Psychiatry. The paper examines the potential of machine learning to provide outcome predictions for mental health treatment, as well as considering ethical challenges surrounding the use of these techniques.… Read more News We have released the Call for Papers for a special issue of IEEE Pervasive on mobile & pervasive computing in mental health. This special issue seeks to discuss novel approaches, opportunities, and challenges for developing effective, ethical, and trustworthy pervasive computing technology for mental health. 1st July deadline, abstracts 17 June. Ethical aspects should be considered in all submissions. Guest editors are Akane Sano (Rice University), Mirco Musolesi (University College London), Gavin Doherty (Trinity College Dublin), and Thomas Vaessen (KU Leuven).… Read more Paper The original vision of Ecological Momentary Interventions (EMI) – brief interventions delivered in the moment during daily life – were put forward over a decade ago. In the interim, the arrival of the smartphone has made these interventions far more feasible to deploy. At this point, it is timely to examine whether the original vision of these systems has been realised, and furthermore has the concept of EMI shifted to incorporate further possibilities opened up by these technologies? With Stephen Schueller, University of California, Irvine, and Prof.… Read more Contact Details Dr. Gavin Doherty School of Computer Science and Statistics Trinity College Dublin Dublin 2. Ireland. +353 1 8963858 Gavin.Doherty @ tcd.ie Recent Posts Notable papers! Congratulations to Dr. Balaskas! KTI Award Successful PhD viva examinations Best paper award – CHI 2022! Links School of Computer Science and Statistics SIGCHI Ireland Search Search for:",
  "content_length": 7427,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:01"
}