{
  "name": "Gavin Brown 0003",
  "homepage": "https://pages.cs.wisc.edu/~grbrown5",
  "status": "success",
  "content": "Gavin Brown I am an assistant professor at the University of Wisconsin–Madison in the Department of Computer Sciences. Prior to that, I was a postdoc at the University of Washington with Sewoong Oh. I completed my PhD at Boston University, where I was advised by Adam Smith. I work on machine learning and data privacy. The outputs of data analysis depend on the details of individual data points, sometimes heavily. When is this necessary, and when can we avoid it? I am interested in understanding when and why machine learning models memorize large amounts of training examples. I also study this topic through the lens of differential privacy, a formal framework for reasoning about privacy in data analysis. In this area, I design algorithms for fundamental statistical problems. News 8/25: I started at the University of Wisconsin–Madison. 8/25: This fall, I will be teaching CS 540: Introduction to Articial Intelligence. 7/23: My work on private mean estimation with Sam Hopkins and Adam Smith shared the COLT 2023 Best Student Paper award. 5/23: I received Boston University's Department of Computer Science Research Excellence Award for 2022/23. 5/20: I received the Teaching Fellow Excellence Award from BU's Computer Science Department. Recent Papers Tukey Depth Mechanisms for Practical Private Mean Estimation Gavin Brown and Lydia Zakynthinou In preparation Insufficient Statistics Perturbation: Stable Estimators for Private Least Squares Gavin Brown, Jonathan Hayase, Samuel Hopkins, Weihao Kong, Xiyang Liu, Sewoong Oh, Juan C. Perdomo, and Adam Smith COLT 2024 Private Gradient Descent for Linear Regression: Tighter Error Bounds and Instance-Specific Uncertainty Estimation Gavin Brown, Krishnamurthy Dvijotham, Georgina Evans, Daogao Liu, Adam Smith, and Abhradeep Thakurta ICML 2024 Proceedings Version Metalearning with Very Few Samples Per Task Maryam Aliakbarpour, Konstantina Bairaktari, Gavin Brown, Adam Smith, Nathan Srebro, and Jonathan Ullman COLT 2024 Proceedings Version Fast, Sample-Efficient, Affine-Invariant Private Mean and Covariance Estimation for Subgaussian Distributions Gavin Brown, Samuel B. Hopkins, and Adam Smith COLT 2023, Best Student Paper Strong Memory Lower Bounds for Learning Natural Models Gavin Brown, Mark Bun, and Adam Smith COLT 2022 Proceedings Version Performative Prediction in a Stateful World Gavin Brown, Iden Kalemaj, and Shlomi Hod AISTATS 2022 Proceedings Version Covariance-Aware Private Mean Estimation Without Private Covariance Estimation Gavin Brown, Marco Gaboardi, Adam Smith, Jonathan Ullman, and Lydia Zakynthinou NeurIPS 2021, Spotlight Presentation Proceedings Version When Is Memorization of Irrelevant Training Data Necessary for High-Accuracy Learning? Gavin Brown, Mark Bun, Vitaly Feldman, Adam Smith, and Kunal Talwar STOC 2021 Proceedings Version",
  "content_length": 2833,
  "method": "requests",
  "crawl_time": "2025-12-01 13:12:58"
}