{
  "name": "Gavin Brown 0001",
  "homepage": "https://www.research.manchester.ac.uk/portal/Gavin.Brown.html",
  "status": "success",
  "content": "Gavin Brown - Research Explorer The University of Manchester Gavin Brown Prof Professor of Computer Science, Machine Learning and Robotics https://orcid.org/0000-0003-2261-9018 Personal profile My groupResearch Group(s)Data Science InstituteMachine Learning and OptimisationResearch interestsMachine Learning. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationUnknown, PhD Computer Science: Diversity in Neural Network Ensembles, University of Birmingham1 Sept 1998 → 1 Sept 2003Award Date: 1 Jul 2004 Research Beacons, Institutes and PlatformsInstitute for Data Science and AIDigital FuturesChristabel Pankhurst Institute Fingerprint Dive into the research topics where Gavin Brown is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Feature Selection Computer Science 100% Mutual Information Mathematics 66% Machine Learning Computer Science 54% Variance Mathematics 50% Ensemble Learning Computer Science 46% Variance Decomposition Mathematics 45% Negative Correlation Computer Science 42% Garbage Collection Computer Science 37% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 26 Article 19 Conference contribution 1 Paper 1 Book/Film/Article review 1 More 1 Doctoral Thesis Research output per year Research output per year Bias/Variance is not the same as Approximation/EstimationBrown, G. & Ali, R., 5 Mar 2024, In: Transactions on Machine Learning Research .Research output: Contribution to journal › Article › peer-review Open AccessFile Variance 100% Variance Decomposition 100% Machine Learning 100% Classical Statistic 50% Classical Information 50% 437 Downloads (Pure) FINESSD: Near-Storage Feature Selection with Mutual Information for Resource-Limited FPGAsKyparissas, N., Brown, G. & Luján, M., May 2024, p. 173-184.Research output: Contribution to conference › Paper › peer-review Open AccessFile Feature Selection 100% Mutual Information 100% Machine Learning 40% Energy Efficient 20% Multiprocessing 20% 191 Downloads (Pure) Low-cost and efficient prediction hardware for tabular data using Tiny Classifier CircuitsIordanou, K., Atkinson, T., Ozer, E., Kufel, J., Aligada, G., Biggs, J., Brown, G. & Luján, M., 25 Apr 2024, In: Nature Electronics.Research output: Contribution to journal › Article › peer-review Open Access Machine Learning 100% Logic Gate 50% Machine Learning Technique 25% Processing Core 25% Graphics Processing Unit 25% A Unified Theory of Diversity in Ensemble LearningWood, D., Mu, T., Webb, A., Reeve, H. W. J., Luján, M. & Brown, G., 19 Dec 2023, In: Journal of Machine Learning Research. 24, 359, p. 1-49Research output: Contribution to journal › Article › peer-review Open AccessFile Unified Theory 100% Ensemble Learning 100% Variance Decomposition 100% Variance 100% Wide Range 66% 3 Downloads (Pure) Outlier detection of vital sign trajectories from COVID-19 patientsSummerton, S., Tivey, A., Shotton, R., Brown, G., Redfern, O. C., Oakley, R., Radford, J. & Wong, D. C., 11 Dec 2023, 2023 45th Annual International Conference of the IEEE Engineering in Medicine and Biology Conference, EMBC 2023 - Proceedings. IEEE, Vol. 2023. p. 1-4 4 p. (Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Real-World Data 100% Pairwise Distance 100% Outlier Detection 100% Vital Sign 100% COVID-19 100% View all 48 research outputs Projects 1 Not started 2 Active 5 Finished Projects per year Centre for Digital Trust and SocietyBarrett, E. (PI), Allmendinger, R. (Researcher), Elliot, M. (Researcher), Lord, N. (Researcher), Cordeiro, L. (Researcher), Gibson, R. (Researcher), Papamarkou, T. (Researcher), Dresner, D. (Researcher), Aldridge, J. (Researcher), Duncan, P. (Researcher), Banach, R. (Researcher), Brown, G. (Researcher), Dennis, L. (Researcher), Fisher, M. (Researcher), Korovin, K. (Researcher), Kotselidis, C.-E. (Researcher), Luján, M. (Researcher), Mustafa, M. (Researcher), Olivier, P. (Researcher), Reger, G. (Researcher), Zhang, N. (Researcher), Hodgkinson, G. (Researcher), Gulati, S. (Researcher), Ainsworth, J. (Researcher), Chen, Y.-W. (Researcher), Green, B. (Researcher), Healey, M. (Researcher), Uyarra, E. (Researcher), Zachariadis, M. (Researcher), Little, C. (Researcher), Mackey, E. (Researcher), Nenadic, G. (Researcher), Keane, J. (Researcher), Shlomo, N. (Researcher), Graff, N. (Researcher), Jarwar, M. A. (Researcher), Shariati Samani, S. (Researcher), Smith, D. (Researcher), Kambites, M. (Researcher), Thorpe, M. (Researcher), Rowley, P. (Researcher), Flynn, S. (Researcher), Turner, P. (Researcher), Wainwright, V. (Researcher), Czerwinsky, A. (PGR student), Nini, A. (Researcher), Broad, R. (Researcher), Shute, J. (Researcher), Deakin, J. (Researcher), Taboada, P. (PGR student), Knight, P. (Researcher), Hutchings, S. (Researcher), Whyte, J. (Researcher), Tolz-Zilitinkevic, V. (Researcher), Pilkington, H. (Researcher), Guharoy, S. (Researcher), Nicolo, A. (Researcher), Reggiani, C. (Researcher), Garcia Oliva, J. (Researcher), Van Someren, A. (Researcher), Bon, E. (Researcher), Cantijoch Cunill, M. (Researcher), Koch, D. (Researcher) & Chen, Y.-W. (Researcher)11/05/21 → …Project: Other Social Statistics 100% Computer Science 100% Interdisciplinary Research 100% Social Research 100% Business School 100% EnnCore: End-to-End Conceptual Guarding of Neural ArchitecturesCordeiro, L. (PI), Brown, G. (CoI), Freitas, A. (CoI), Luján, M. (CoI) & Mustafa, M. (CoI)1/02/21 → 31/12/25Project: Research Model Checking 100% Privacy Preserving 77% Large Language Model 75% Neural Network 61% C Program 45% RAI: Centre for Robotics and Artificial IntelligenceCangelosi, A. (PI), Lennox, B. (PI), Weightman, A. (CoI), Dennis, L. (CoI), Dixon, C. (CoI), Fisher, M. (CoI), Herrmann, G. (CoI), Dickson, A. (CoI), Lanzon, A. (CoI), Stancu, A. (CoI), Miller, A. (CoI), Freitas, A. (CoI), Nini, A. (CoI), Voronkov, A. (CoI), Brass, A. (CoI), Vijayaraghavan, A. (CoI), Parslew, B. (CoI), crowther, W. (CoI), Grieve, B. (CoI), Adorno, B. (CoI), Jay, C. (CoI), Wang, C. C. L. (CoI), Todd, C. (CoI), Soutis, C. (CoI), Arsene, C. (CoI), Dresner, D. (CoI), Barrett, E. (CoI), Gowen, E. (CoI), Arvin, F. (CoI), Podd, F. (CoI), Brown, G. (CoI), Reger, G. (CoI), Cooper, G. (CoI), Mairs, H. (CoI), Yin, H. (CoI), Kinloch, I. (CoI), Eleftheriou, I. (CoI), Li, J. (CoI), Carrasco Gomez, J. (CoI), Ainsworth, J. (CoI), Sinha, J. (CoI), Ozanyan, K. (CoI), Smith, K. (CoI), Twomey, K. (CoI), Margetts, L. (CoI), Ren, L. (CoI), Zhang, L. (CoI), Cordeiro, L. (CoI), Rattray, M. (PI), Bissett, M. (CoI), Elliot, M. (CoI), Alvarez, M. (CoI), Luján, M. (CoI), Nabawy BSc, MSc, PhD, MRAeS, SMAIAA, FHEA, M. (CoI), Peek, N. (CoI), Marjanovic, O. (CoI), Dorn, O. (CoI), Dudek, P. (CoI), Green, P. (CoI), Connolly, P. (CoI), Da Silva Bartolo, P. J. (CoI), Gardner, P. (CoI), Martin, P. (CoI), Potluri, P. (CoI), Curtis, R. (CoI), Schmidt, R. (CoI), Banach, R. (CoI), Batista-Navarro, R. T. (CoI), Kaski, S. (CoI), Midson, S. (CoI), Watson, S. (CoI), Holm, S. (CoI), Furber, S. (CoI), Schlegel, V. (CoI), Mirihanage, W. (CoI), Mansell, W. (CoI), Pan, W. (CoI), Sampson, B. (CoI), Sellers, W. (CoI), Yang, W. (CoI), Cai, P. (CoI), Sun, Y. (CoI), Alharthi, A. (Researcher), Macario Rojas, A. (Researcher), Serhan, B. (Researcher), Yu, C. (Researcher), Abara, D. (Researcher), Lopez Pulgarin, E. (Researcher), Faruq, F. (Researcher), Tavella, F. (Researcher), Semeraro, F. (Researcher), Liu, G. (Researcher), Fang, G. (Researcher), Niu, H. (Researcher), Taylor, H. (PI), Zhu, H. (PGR student), Collenette, J. (Researcher), Amano, K. (Researcher), Lo, K. C. J. (PGR student), Raggioli, L. (Researcher), Romeo, M. (Researcher), Ruocco, M. (PGR student), Ghaffari Saadat, M. (Researcher), Walmsley, M. (Researcher), Mubarik, A. (Researcher), Vinanzi, S. (Researcher), Su, Y.-H. (PGR student), McAleese, H. (PGR student), Stringer, P. (PGR student), Stoican, R. (PGR student), Ye, R. (PGR student), Kurawa, S. S. (PGR student), Zhang, T. (PGR student), Krywonos, W. (PGR student), Xu, Y. (PGR student), Tian, Y. (PGR student), Henderson, A. (Technical team), Morley, D. (Support team), Tallentire, J. (Support team), Smith, J. (Support team), Hawthornthwaite, S. (Support team), Carlson, J. (Support team) & Baniqued, P. D. (Researcher)Project: Research Robot 100% Human Robot Interaction 22% Digital Twin 20% Cognitive Architecture 17% Autonomous System 17% Data Visualisations for Smarter mid-trial decisionsBrown, G. (PI) & Jay, C. (CoI)1/01/18 → 30/06/19Project: Research Data Visualization 100% Research Project 66% Robust Biomarker Ranking with multiple diverse endpointsBrown, G. (PI) & Jay, C. (CoI)1/01/18 → 31/12/18Project: Research Research Project 100% Biological Marker 100% Endpoint 50% View all 8 projects Activities 1 Editorial work Activities per year Machine Learning (Journal)Brown, G. (Assistant editor)2017 → 2020Activity: Publication peer-review and editorial work › Editorial work › Research Press/Media THE TIMES: The robots are coming . . . to the rescueBrown, G.2/12/171 Media contributionPress/Media: Expert comment",
  "content_length": 9808,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:00"
}