{
  "name": "Gayane Vardoyan",
  "homepage": "https://people.cs.umass.edu/~gvardoyan",
  "status": "success",
  "content": "Gayane Vardoyan's Homepage Email: gvardoyan-at-cs-umass-edu About Me I am an Assistant Professor at the College of Information and Computer Sciences, University of Massachusetts, Amherst. From 2022 to 2024, I was an Assistant Professor at QuTech's Quantum Internet Division, and EEMCS, TU Delft, receiving a permanent contract in 2023. The same year, I became faculty part-time at UMass Amherst, switching to full-time in 2024. Previously, I was a postdoc researcher at TU Delft, where I worked with Prof. Stephanie Wehner. I received my PhD from the University of Massachusetts, Amherst, where I worked in systems and networking. My advisor was Prof. Don Towsley. My research interests focus on the modelling and performance analysis of distributed quantum systems. I received my Master of Science in 2017 from UMass Amherst. I interned at Inria in Sophia Antipolis, France in Summer 2017. I received my Bachelor of Science in Electrical Engineering and Computer Sciences from the University of California at Berkeley. Between my undergraduate and graduate education, I worked at the Argonne National Lab and the Computation Institute at the University of Chicago. Recruiting I am currently looking for driven PhD students wishing to conduct research in the area of quantum communication. Interested candidates may apply either through my personal portal here or through the graduate school here. As the idea of a Quantum Internet draws nearer to reality, protocols must be developed to enable users to reap as many of the potential benefits of this new technology as possible. A fundamental challenge in quantum networking is long-distance entanglement distribution — to actualize such a task with near-term quantum devices of limited functionality, special care is needed to ensure that quantum-equipped users have entanglement of sufficiently high quality at their disposal. One focus of my group is thus to develop efficient entanglement distribution algorithms, often inspired both by analytical models of quantum network architectures, as well as techniques found in classical networking literature. In general, the group is interested in addressing the many challenges pertaining to distributed quantum systems, as well as seeking new quantum-enabled possibilities and applications. Piecemaker: a resource-efficient entanglement distribution protocol Luise Prielinger, Kenneth Goodenough, Guus Avis, Stefan Krastanov, Don Towsley, Gayane Vardoyan arXiv preprint arXiv:2508.14737 link Surrogate-guided optimization in quantum networks Luise Prielinger, Álvaro G Iñesta, Gayane Vardoyan npj Quantum Information, 2025 link Leveraging internet principles to build a quantum network Leonardo Bacciottini, Matheus Guedes De Andrade, Shahrooz Pouryousef, Emily Van Milligen, Aparimit Chandra, Nitish Panigrahy, Nageswara SV Rao, Gayane Vardoyan, Don Towsley IEEE Network, 2025 link Testbed and Experiments for Quantum-Conventional Networking Nageswara Rao, Muneer Alshowkan, Joseph Chapman, Hsuan-Hao Lu, Nicholas Peters, Joseph Lukens, Guoliang Xue, Saikat Guha, Emily Van Milligen, Don Towsley, Gayane Vardoyan, Leonardo Bacciottini, Linran Fan International Conference on Quantum Communications, Networking, and Computing (QCNC), 2025 link Service-the-Longest-Queue Among d Choices Policy for Quantum Entanglement Switching Guo Xian Yau, Thirupathaiah Vasantam, Gayane Vardoyan International Conference on Quantum Communications, Networking, and Computing (QCNC), 2025 link Entanglement routing over networks with time multiplexed repeaters Emily Van Milligen, Eliana Jacobson, Ashlesha Patil, Gayane Vardoyan, Don Towsley, Saikat Guha IEEE International Conference on Quantum Computing and Engineering, 2025 Reconfigurable Intelligent Surface (RIS)-Assisted Entanglement Distribution in FSO Quantum Networks Mahdi Chehimi, Mohamed Elhattab, Walid Saad, Gayane Vardoyan, Nitish K Panigrahy, Chadi Assi, Don Towsley IEEE Transactions on Wireless Communications, 2025 link An on-demand resource allocation algorithm for a quantum network hub and its performance analysis Scarlett Gauthier, Thirupathaiah Vasantam, Gayane Vardoyan IEEE International Conference on Quantum Computing and Engineering, 2024 link On the Analysis of Quantum Repeater Chains with Sequential Swaps Matheus Guedes de Andrade, Emily A Van Milligen, Leonardo Bacciottini, Aparimit Chandra, Shahrooz Pouryousef, Nitish K Panigrahy, Gayane Vardoyan, Don Towsley arXiv preprint arXiv: 2405.18252 On the Bipartite Entanglement Capacity of Quantum Networks Gayane Vardoyan, Emily van Milligen, Saikat Guha, Stephanie Wehner, Don Towsley IEEE Transactions on Quantum Engineering, 2024 link Tools for the analysis of quantum protocols requiring state generation within a time window Bethany Davies, Thomas Beauchamp, Gayane Vardoyan, Stephanie Wehner IEEE Transactions on Quantum Engineering, 2024 link Mapping quantum circuits to modular architectures with QUBO Medina Bandic, Luise Prielinger, Jonas Nüßlein, Anabel Ovide, Santiago Rodrigo, Sergi Abadal, Hans van Someren, Gayane Vardoyan, Eduard Alarcon, Carmen G Almudever, Sebastian Feld IEEE International Conference on Quantum Computing and Engineering, 2023 link Quantum Network Utility Maximization Gayane Vardoyan, Stephanie Wehner IEEE International Conference on Quantum Computing and Engineering, 2023 link Optimistic Entanglement Purification in Quantum Networks Mohammad Mobayenjarihani, Gayane Vardoyan, Don Towsley IEEE International Conference on Quantum Computing and Engineering, 2023 A Control Architecture for Entanglement Generation Switches in Quantum Networks Scarlett Gauthier, Gayane Vardoyan, Stephanie Wehner SIGCOMM Workshop on Quantum Networks and Distributed Quantum Computing (QuNet 2023) Optimal entanglement distribution policies in homogeneous repeater chains with cutoffs Álvaro. G. Iñesta, Gayane Vardoyan, Lara Scavuzzo, Stephanie Wehner npj Quantum Information, 2023 link On the Quantum Performance Evaluation of Two Distributed Quantum Architectures Gayane Vardoyan, Matt Skrzypczyk, Stephanie Wehner Performance 2021 (regular paper); journal version in Performance Evaluation (PEVA) pdf Best Paper Award On the Stochastic Analysis of a Quantum Entanglement Distribution Switch Gayane Vardoyan, Saikat Guha, Philippe Nain, Don Towsley IEEE Transactions on Quantum Engineering, 2021 pdf Analysis of a Tripartite Entanglement Distribution Switch Philippe Nain, Gayane Vardoyan, Saikat Guha, Don Towsley Queueing Systems: Theory and Applications (QUESTA), 2021 pdf On the Exact Analysis of an Idealized Quantum Switch Gayane Vardoyan, Philippe Nain, Saikat Guha, Don Towsley Performance 2020 (regular paper); journal version in PEVA pdf On the Analysis of a Multipartite Entanglement Distribution Switch Philippe Nain, Gayane Vardoyan, Saikat Guha, Don Towsley SIGMETRICS 2020/Proceedings of the ACM on Measurement and Analysis of Computing Systems (POMACS) pdf On the Capacity Region of Bipartite and Tripartite Entanglement Switching Gayane Vardoyan, Saikat Guha, Philippe Nain, Don Towsley Performance 2020 (short paper), journal version to appear in ACM ToMPECS Extended abstract accepted as an oral presentation in QCrypt 2019 pdf On the Stochastic Analysis of a Quantum Entanglement Switch (Workshop version) Gayane Vardoyan, Saikat Guha, Philippe Nain, Don Towsley Workshop on MAthematical performance Modeling and Analysis (MAMA 2019) pdf The Role of Network Topology for Distributed Machine Learning Giovanni Neglia, Gianmarco Calbi, Gayane Vardoyan, Don Towsley IEEE International Conference on Computer Communications (INFOCOM 2019) pdf Towards Stability Analysis of Data Transport Mechanisms: a Fluid Model and Its Applications Gayane Vardoyan, C.V. Hollot, Don Towsley IEEE International Conference on Computer Communications (INFOCOM 2018) IEEE/ACM Transactions on Networking, 2021 (journal version with another application to HTCP) pdf of INFOCOM paper extended version of INFOCOM paper with proofs slides pptx slides pdf Best-In-Session Presentation Award pdf of journal version, with HTCP Experiments and Analyses of Data Transfers over Wide-Area Dedicated Connections N. S. V. Rao, Q. Liu, S. Sen, J. Hanley, I. Foster, R. Kettimuthu, C. Q. Wu, D. Yun, G. Vardoyan, D. Towsley 26th International Conference on Computer Communication and Networks (ICCCN 2017) link TCP Throughput Profiles Using Measurements Over Dedicated Connections Nageswara Rao, Qiang Liu, Satyabrata Sen, Don Towsley, Gayane Vardoyan, Raj Kettimuthu, Ian Foster Proceedings of the 26th International Symposium on High-Performance Parallel and Distributed Computing (HPDC 2017) pdf Models of TCP in High-BDP Environments and Their Experimental Validation Gayane Vardoyan, Nageswara Rao, Don Towsley 24th IEEE International Conference on Network Protocols (ICNP 2016) pdf High-Performance Data Flows Using Analytical Models and Measurements Nageswara Rao, Rajkumar Kettimuthu, Ian Foster, Don Towsley, Gayane Vardoyan, Brad Settlemyer and Qiang Liu Workshop on Modeling & Simulation of Systems and Applications (ModSim 2016) Sustained Wide-Area TCP Memory Transfers over Dedicated Connections Nageswara Rao, Don Towsley, Gayane Vardoyan, Bradley Settlemyer, Ian Foster, Rajkumar Kettimuthu High Performance Computing and Communications (HPCC), 2015 pdf An Elegant Sufficiency: Load-Aware Differentiated Scheduling of Data Transfers Rajkumar Kettimuthu, Gayane Vardoyan, Gagan Agrawal, P. Sadayappan, and Ian Foster SC '15 Proceedings of the International Conference for High Performance Computing, Networking, Storage and Analysis pdf Modeling and Optimizing Large-Scale Wide-Area Data Transfers Rajkumar Kettimuthu, Gayane Vardoyan, Gagan Agrawal, and P. Sadayappan 14th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing, 2014 pdf Characterizing Throughput Bottlenecks for Secure GridFTP Transfers Gayane Vardoyan, Rajkumar Kettimuthu, Michael Link, Steven Tuecke International Conference on Computing, Networking and Communications, 201",
  "content_length": 12788,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:01"
}