{
  "name": "Geber L. Ramalho",
  "homepage": "https://www.cin.ufpe.br/~glr",
  "status": "success",
  "content": "Geber Ramalho's Home Page Geber Ramalho Bem-vindo à minha página Web! Bienvenu à ma page Web! Welcome to my Web page! [education, position, interests, publications, research, lectures, supervision] Education · B.Sc. in Electronic Engineering (1988): Federal University of Paraiba, Brazil · M.Sc. in Computer Science - Artificial Intelligence (1992): University of Brasilia, Brazil · Docteur en Informatique - Artificial Intelligence (1997): LAFORIA, University of Paris VI, France. Position · Since 1997: Permanent: Lecturer/researcher at the Informatics Center (CIn) of the Federal University of Pernambuco, Recife, Brazil · 2005:  Associate researcher at the Laboratoire d'Informatique de Paris 6, OASIS theme, CNRS, Université Paris 6, Paris, France Current Research interests · Autonomous Agents and Multiagent Systems o Multiagent Learning and Coordination · Computer Music o Music Accompaniment Systems o Computer-aided musicology o Audio retrieval, indexing and distribution · Computer Games o Dynamic game balancing o Real-time strategy games o Synthetic Actors o Software engineering and mobile games Publications · Papers (better to see to my Lattes Curriculum) · Ph.D. Thesis (Construction d'un agent rationnel jouant du jazz) o text in pdf o musical examples Lectures (in portuguese) · Horário atual (current schedule) · AI o Agentes Inteligentes (pós-graduação - CIn) o Agentes Autônomos (graduação - CIn) · Music Technology o Computação Musical e Processamento de Som (Graduação e Pós - CIn) · Computer games o Computer Games Design and Implementation (Graduação e Pós - CIn) Supervision · Former post-graduate students Geber L. Ramalho Centro de Informática - Universidade Federal de Pernambuco Av. Jornalista Aníbal Fernandes, s/n Cidade Universitária 50740-540, Recife, PE, Brasil Tel: (55)(81) 2126-8430 (ext. 4325)     Fax: (55)(81) 2126-8438 http://www.cin.ufpe.br/~glr E-mail: glr \"at\" cin . ufpe . br",
  "content_length": 1922,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:02"
}