{
  "name": "Gedare Bloom",
  "homepage": "https://gedare.github.io",
  "status": "success",
  "content": "Gedare Bloom Home Research Teaching CV Pubs Students Software Personal Gedare Bloom Associate Professor Director, Embedded Systems Security Lab Department of Computer Science University of Colorado at Colorado Springs gbloom at uccs edu Education Ph.D., Computer Science, The George Washington University, 2013 M.S., Computer Science, The George Washington University, 2012 B.S., Computer Science and Mathematics, Michigan Technological University, 2005 Research I investigate security problems in real-time embedded systems and apply solutions across the hardware-software interface. My research has been supported by federal grants from the National Science Foundation, Department of Homeland Security, National Security Agency, and Office of Naval Research, and by industry gifts from Northrop Grumman, Texas Instruments, Leidos, and Xilinx. See more on my research page and CV (PDF) Selected Publications See more on my publications page and Google Scholar. S. Hounsinou, M. Stidd, U. Ezeobi, H. Olufowobi, M. Nasri, and G. Bloom. Vulnerability of Controller Area Network to Schedule-Based Attacks, 42nd IEEE Real-Time Systems Symposium, RTSS’21 (29% acceptance) G. Bloom. WeepingCAN: A Stealthy CAN Bus-off Attack, Workshop on Automotive and Autonomous Vehicle Security, AutoSec ‘21 (Best Paper). H. Olufowobi, C. Young, J. Zambreno, and G. Bloom. SAIDuCANT: Specification-based Automotive Intrusion Detection using Controller Area Network (CAN) Timing, IEEE Transactions on Vehicular Technology, IEEE TVT (JIF: 5.339) M. Nasri, T. Chantem, G. Bloom, and R. Gerdes. On the Limitations and Vulnerabilities of Schedule Randomization against Schedule-Based Attacks, 25th IEEE Real-Time and Embedded Technology and Applications Symposium, RTAS’19 (25% acceptance) G. Bloom, G. Parmer, B. Narahari, and R. Simha. Shared Hardware Data Structures for Hard Real-Time Systems, 12th International Conference on Embedded Software, EMSOFT ‘12 (24% acceptance), Teaching I develop and teach practical, hands-on courses in systems areas including architecture, operating systems, real-time embedded systems, and security. See more on my teaching page",
  "content_length": 2141,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:01"
}