{
  "name": "Geert De Maere",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/geert.de_maere",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Geert De MaereAssistant professor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom C84 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/aGeert.De_maere@nottingham.ac.ukhttp://www.cs.nott.ac.uk/~pszgd/ Recent Publications CHRISTOPHER BAYLISS, GEERT DE MAERE, JASON A.D. ATKIN and MARC PAELINCK, 2019. Scheduling Airline Reserve Crew using a Probabilistic Crew Absence and Recovery Model. Journal of the Operational Research Society. (In Press.)IMO EYOH, ROBERT JOHN, GEERT DE MAERE and ERDAL KAYACAN, 2018. Hybrid Learning for Interval Type-2 Intuitionistic Fuzzy Logic Systems as applied to Identification and Prediction Problems Transactions on Fuzzy Systems. 26(5), 2672-2685 (In Press.)IMO EYOH, ROBERT JOHN and GEERT DE MAERE, 2018. Interval Type-2 Intuitionistic Fuzzy Logic Systems - A Comparative Evaluation In: 17th International Conference on Information Processing and Management of Uncertainty in Knowledge-Based Systems. Cádiz, Spain, June 11th – 15th. (In Press.)ARGYLE, E.M., HOUGHTON, R.J., ATKIN, J.A.D., DE MAERE, G., MOORE, T. and MORVAN, H., 2018. Human performance and strategies while solving an aircraft routing and sequencing problem: An experimental approach Cognition, Technology & Work. 20(3), 425-441 View all publications CHRISTOPHER BAYLISS, GEERT DE MAERE, JASON A.D. ATKIN and MARC PAELINCK, 2019. Scheduling Airline Reserve Crew using a Probabilistic Crew Absence and Recovery Model. Journal of the Operational Research Society. (In Press.)IMO EYOH, ROBERT JOHN, GEERT DE MAERE and ERDAL KAYACAN, 2018. Hybrid Learning for Interval Type-2 Intuitionistic Fuzzy Logic Systems as applied to Identification and Prediction Problems Transactions on Fuzzy Systems. 26(5), 2672-2685 (In Press.)IMO EYOH, ROBERT JOHN and GEERT DE MAERE, 2018. Interval Type-2 Intuitionistic Fuzzy Logic Systems - A Comparative Evaluation In: 17th International Conference on Information Processing and Management of Uncertainty in Knowledge-Based Systems. Cádiz, Spain, June 11th – 15th. (In Press.)ARGYLE, E.M., HOUGHTON, R.J., ATKIN, J.A.D., DE MAERE, G., MOORE, T. and MORVAN, H., 2018. Human performance and strategies while solving an aircraft routing and sequencing problem: An experimental approach Cognition, Technology & Work. 20(3), 425-441GEERT DE MAERE, JASON ATKIN and ELIZABETH M. ARGYLE., 2018. Dynamic Programming With Strengthened Dominance for the Multi-Runway Sequencing and Allocation Problem In: Practice and Theory of Automated Timetabling 2018. (In Press.)JASON ATKIN, CHRISTOFAS STERGIANOS, ELIZABETH M. ARGYLE. and GEERT DE MAERE, 2018. Pruning for the QPPTW airport ground movement algorithm In: Practice and Theory of Automated Timetabling 2018. (In Press.)IMO EYOH, ROBERT JOHN and GEERT DE MAERE, 2017. Time Series Forecasting with Interval Type-2 Intuitionistic Fuzzy Logic Systems Transactions on Fuzzy Systems. GEERT DE MAERE, JASON A.D. ATKIN and EDMUND K. BURKE, 2016. Pruning rules for optimal runway sequencing Transportation Science. 52(4), CHRISTOPHER D. BAYLISS, GEERT DE MAERE, JASON ATKIN and MARC PAELINCK, 2016. A simulation scenario based mixed integer programming approach to airline reserve crew scheduling under uncertainty Annals of Operations Research. 1-29I. EYOH, G. DE MAERE and R. JOHN, 2016. Interval Type-2 Intuitionistic Fuzzy Logic System for Non-linear System Prediction In: 2016 IEEE International Conference on Systems, Man, and Cybernetics (SMC 2016). SIMONE PATERNOSTRO, TERRY MOORE, CHRIS HILL, JASON ATKIN, GEERT DE MAERE and HERVE MORVAN, 2016. Integration of an ARAIM algorithm in the development of an instrument approach procedure and for pre-flight operational briefing. In: International Navigation Conference of the Royal Institute of Navigation (INC 16). DE MAERE, GEERT and ATKIN, JASON AD, 2015. Pruning rules for optimal runway sequencing with airline preferences Lecture Notes in Management Science. 7, 77CHRISTOPHER BAYLISS, GEERT DE MAERE, JASON A.D. ATKIN and MARC PAELINCK, 2014. A Simulation Scenario Based Mixed Integer Programming Approach to Airline Reserve Crew Scheduling Under Uncertainty In: 10th International Conference on the Practice and Theory of Automated Timetabling (PATAT 2014). ATKIN, JASON A.D., DE MAERE, GEERT and BURKE, EDMUND K., 2014. The Effects of the Planning Horizon on Heathrow TSAT Allocation In: Proceedings of the 10th International Conference of the Practice and Theory of Automated Timetabling (PATAT) 2014. 446 - 449,ATKIN, J.A.D., DE MAERE, G., BURKE, E.K. and GREENWOOD, J.S., 2013. Addressing the pushback time allocation problem at Heathrow Airport Transportation Science. 47(4), 584-602CHRIS BAYLISS, GEERT DE MAERE, JASON A.D. ATKIN and MARC PAELINCK, 2013. Scheduling Airline Reserve crew to Minimise Crew Related Delay Using Simulated Airline Recovery and a Probabilistic Optimisation Model In: Proceedings of the IEEE International Conference on Systems, Man and Cybernetics. 1944-1950J.A.D. ATKIN, G. DE MAERE, E.K. BURKE and J.S. GREENWOOD, 2013. Addressing the pushback time allocation problem at Heathrow airport. Transportation Science. 47, 584-602CHRISTOPHER BAYLISS, GEERT DE MAERE, JASON ATKIN and MARC PAELINCK, 2012. Probabilistic Airline Reserve Crew Scheduling Model In: 12th Workshop on Algorithmic Approaches for Transportation Modelling, Optimization, and Systems. 132-143BURKE, E.K., DE CAUSMAECKER, P., DE MAERE, G., MULDER, J., PAELINCK, M. and VANDEN BERGHE, G., 2010. A multi-objective approach for robust airline scheduling Computers and Operations Research. 37(5), 822-832BURKE, E.K., DE CAUSMAECKER, P., DE MAERE, G., MULDER, J. and PAELINCK, M., 2009. Multi-objective approaches to investigate airline schedule robustness: the 3-objective case In: Proceedings of the 11th International Conference on Advanced Systems for Public Transport (CASPT 09) : 20-22 July 2009, Hong Kong. E.K. BURKE, P. DE CAUSMAECKER, G. DE MAERE*, J. MULDER and M. PAELINCK, 2008. Multi-Objective Approaches to Investigate Airline Schedule Robustness: the 3-objective case In: In proceedings of the conference on Computer-Aided Scheduling of Public Transport 2008, Hong Kong, China. E.K. BURKE, P. DE CAUSMAECKER, G. DE MAERE*, J. MULDER\tAND M. PAELINCK and G. VANDEN BERGHE, 2007. Memetic algorithms for multi-objective optimisation of robustness\tobjectives in airline schedules In: Proceedings of the Models and Algorithms for Planning and Scheduling Problems conference 2007, Istanbul, Turkey. E.K. BURKE, P. DE CAUSMAECKER, G. DE MAERE*, J. MULDER\tAND M. PAELINCK and G. VANDEN BERGHE, 2006. A new time window model for integrated optimisation of airline schedules\tfor robustness In: Proceedings of the conference on Computer-Aided Scheduling of Public Transport 2006, Leeds, UK. E.K. BURKE, P. DE CAUSMAECKER, G. DE MAERE*, J. MULDER\tAND M. PAELINCK and G. VANDEN BERGHE, 2006. Feature based prediction for airline schedule robustness In: Proceedings of the conference on Computer-Aided Scheduling of Public Transport 2006, Leeds, UK. E.K. BURKE, P. DE CAUSMAECKER, G. DE MAERE* and J. MULDER\tAND M. PAELINCK, 2005. Forecasting Flight Schedule Robustness In: Proceedings of the second Multidiciplinary International Conference\tOn Scheduling: Theory and Applications, New York, USA. IMO EYOH, ROBERT JOHN and GEERT DE MAERE, Interval Type-2 Intuitionistic Fuzzy Logic for Regression Problems Transactions on Fuzzy Systems. (In Press.) Browser does not support script. Browser does not support script. School of Computer Science University of NottinghamJubilee CampusWollaton Road Nottingham, NG8 1BB For all enquires please visit: www.nottingham.ac.uk/enquire Legal information Copyright Terms and conditions Privacy Posting rules Accessibility Freedom of information Charity gateway Cookie policy Cookie Settings Get social Connect with the University of Nottingham through social media and our blogs. Campus maps | More contact information | Jobs",
  "content_length": 8363,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:02"
}