{
  "name": "Geir E. Dullerud",
  "homepage": "https://mechanical.illinois.edu/directory/faculty/dullerud",
  "status": "success",
  "content": "Geir Dullerud | Mechanical Science & Engineering | Illinois Geir Dullerud Geir Dullerud he/him/his W. Grafton and Lillian B. Wilkins Professor dullerud@illinois.edu For More Information Center for Autonomy Education Ph.D., Information Engineering, Cambridge University, England, 1994 M.A.Sc.\tElec Eng\tUniversity of Toronto, Canada\t1990 B.A.Sc.\tEng Science\tUniversity of Toronto, Canada\t1988 Academic Positions W. Grafton and Lillian B. Wilkins Professor of Mechanical Engineering, 2016-present. Affiliate, Department of Computer Science, UIUC, Jan 14, 2016-present Visiting Professor, Department of Electrical Engineering, Royal Institute of Technology(KTH), Stockholm, Sweden, April-July, 2013 Research Professor, Coordinated Science Laboratory, UIUC, August 16, 2006-date Professor, Department of Mechanical Science and Engineering, UIUC, August 16, 2006-date Visiting Associate Professor, Department of Aeronautics and Astronautics, Stanford University, July 20, 2005- July 19, 2006 Associate Professor, Department of Mechanical and Industrial Engineering, UIUC, Aug. 16, 2003-2006 Research Associate Professor, Coordinated Science Laboratory, UIUC, Aug. 16, 2003-2006 Willett Faculty Scholar , College of Engineering, UIUC, 2002-date Affiliate, Department of Electrical and Computer Engineering, UIUC, Oct. 2000-date Research Assistant Professor, Coordinated Science Laboratory, UIUC, Aug. 2000-2003 Assistant Professor, Department of Mechanical and Industrial Engineering, UIUC, July 16, 1998-Aug. 15, 2003 Assistant Professor, Department of Applied Mathematics, University of Waterloo, Waterloo, Canada, Jan. 1996-July 1998 Research Fellow and Lecturer, Department of Control and Dynamical Systems, California Institute of Technology, Pasadena, CA, Feb. 1994-Nov. 1995 Research Associate, Information Engineering Department, Cambridge University, Cambridge, England, July 1993-Jan. 1994 Documents cVitae_Dullerud Other Professional Employment Research Associate, Control Engineering Department, Cambridge University, Cambridge, England, Oct. 1990-May 1993 Teaching Assistant, Department of Electrical Engineering, University of Toronto, Toronto, Canada, Jan. 1989-May 1990 Research Associate, SPAR Aerospace, Toronto, Canada, May-Aug. 1987 Programmer, Nortel Research, Toronto, Canada, May-Aug. 1985, 1986 Research StatementProgram is focused on cyber-physical and complex systems with applications to mechanical, electrical, and computer systems. Professor Dullerud is particularly interested in networked, distributed and mobile cyber-physical settings. His areas of current research interest include convex optimization and machine learning in control, cyber-physical system security, cooperative robotics, stochastic simulation, and hybrid dynamical systems. Research Interests Dynamic modeling Optimization and control Selected Articles in Journals J. Zhu, C. H. Du and G. E Dullerud, Model-based offline reinforcement learning with uncertainty estimation and policy constraint, IEEE Trans. on Artificial Intelligence (Published Online, DOI: 10.1109/TAI.2024.3372939), 2024 Negin Musavi, Dawei, Sun, Sayan Mitra, Geir E. Dullerud, and Sanjay Shakkottai, \"HyHooVer:Verification and Parameter Synthesis in Stochastic Systems with Hybrid State-space using Optimistic Optimization\", IEEE Open Journal of Control Systems, 2:263-276, 2023 A. Havens, D. Keivan, P. Seiler, G. Dullerud and B. Hu, \"Revisiting PGD Attacks for Stability Analysis of High-Dimensional Nonlinear Systems and Perception-Based Control\", volume 7, IEEE Control Systems Letters (L-CSS), 2023. Y. Wang, H. Sibai, M. Yen, S. Mitra, G.E. Dullerud,\"Differentially Private Algorithms for Statistical Verification of Cyber-Physical Systems\", volume 1, IEEE Open Journal of Control Systems (OJ-CSYS), 2022. J. Jansch-Porto, B. Yu, G.E. Dullerud, \"Global Convergence of Policy Gradient Methods for Markovian Jump Linear Quadratic Optimal Control, accepted to IEEE Transactions on Automatic Control, 2022. Wang, Y., N. Roohi, M. West, M. Viswanathan, and G. Dullerud, \"Verifying Stochastic Hybrid Systems with Temporal Logic Specifications via Model Reduction\", ACM Transactions on Embedded Computing Systems, 20(6):1-27, 2021 J. Jansch-Porto and G.E. Dullerud, \"Decentralized Control of Switched-Systems with Receding Horizon Modal Information and Path-Dependent Performance Specifications: Theory and an Application\", accepted to IEEE Transactions on Control Systems Technology, 2021. N. Strijbosch, G.E. Dullerud, A. Teel, M. Heemels, \"L2-gain Analysis of Periodic, Event-Triggered Control and Self-Triggered Control using Lifting\", accepted to IEEE Transactions on Automatic Control, 2020. Zhu, J., T. Luo, L. Yang, W. Xie, and G.E. Dullerud, \"An Average Queue-length-difference Based Congestion Detection Algorithm in TCP/AQM Network\", to appear in International Journal of Adaptive Control and Signal Processing, 2018. Naghnaeian, M., P.G. Voulgaris, and G.E. Dullerud, \"Lp Analysis and Synthesis of Linear Switched Systems: A Unified Framework,\" to appear in SIAM Journal of Control and Optimization, 2018. Wang, Y., Z. Huang, S. Mitra, and G.E. Dullerud, \"Differential Privacy and Entropy-minimizing Mechanisms in Feedback Systems,\" IEEE Transactions on Control of Network Systems, 4:118-130, 2017. Wang, Y., N. Roohi, M. Viswanathan, and G. Dullerud, \"Stability of Linear Autonomous Systems Defined by Regular Switching Sequences,\" IEEE Transactions on Automatic Control, 62:2568-2575, 2016. Maginnis, P. A., M. West, and G. Dullerud, \"Variance-reduced Tau-leaping using Anticorrelated Sample Paths,\" Journal of Computational Physics, 322:400-414, 2016. Philippe, M., R. Essick, G.E. Dullerud, and R.M. Jungers, \"Stability of discrete-time switching systems with constrained switching sequences,\" accepted to Automatica, 72:242-250, 2016. Heemels, W.P.M.H., G. Dullerud, and A.R. Teel, \"L2-gain Analysis for a Class of Hybrid Systems with Applications to Reset and Event-triggered Control: A Lifting Approach,\" IEEE Transactions on Automatic Control, 61:2766 - 2781, 2016. Xie, W., B. Zhang, J. Zhu, and G.E. Dullerud, \"Decision-Control Mechanism for Markovian Jump Linear Systems with Gaussian Noise,\" Optimal Control, Applications and Methods, 37: 381-393, 2016. Prabhakar, P., M. Viswanathan, and G.E. Dullerud, \"Stability preserving Simulations and Bisimulations for hybrid systems,\" IEEE Transactions on Automatic Control, 60: 3210 - 3225, 2015. Zhang, B., J. Zhu, and G.E. Dullerud, \"Time Series Analysis for Congestion Detection in TCP/AQM Networks,\" IEEE Communications Letters, 19:331-334, 2015. Mishra, A., C. Langbort, and G.E. Dullerud, \"Decentralized Control of Linear Switched Nested Systems with L-2 induced Norm Performance,\" IEEE Transactions on Control of Network Systems, 2:420-432, 2015. Prabhakar P., Vladimerou, V., M. Viswanathan, and G. E. Dullerud, \"A Decidable Class of Planar Linear Hybrid Systems,\" Theoretical Computer Science, 574:1-17, 2015. Mishra, A., C. Langbort, and G.E. Dullerud, \"Optimal Control of a Stochastically Switched System with Decentralized Policies and Local Parameter Knowledge,\" IEEE Transactions on Automatic Control, 60:2086-2101, 2015. Farhood, M., D. Zhe, and G.E. Dullerud, \"Distributed Control of Linear Time-varying Systems Interconnected over Arbitrary Graphs,\" International Journal of Robust and Nonlinear Control, 25(2):163–319, 2015. Articles in Conference Proceedings Negin Musavi, Ziyao Guo, Yingying Li, and Geir E. Dullerud, \"Real Analytic Dynamical System Identification with Non-asymptotic Guarantees\", Proceedings of NeurIPS, 2024. Sahel Vahedi Noori , Bin Hu, Geir E. Dullerud, and Peter Seiler\"Stability and Performance Analysis of Discrete-Time ReLU Recurrent Neural Networks\", Proceedings of IEEE Conference on Decision and Control (CDC), 2024. Kuan-Yu Tseng, Mengchao Zhang , Kris Hauser, and Geir E. Dullerud, \"Adaptive Trajectory Database Learning for Nonlinear Control with Hybrid Gradient Optimization\", Proceedings of IEEE International Conference on Intelligent Robots and Systems (IROS), 2024. Hussein Darir, Nikita Boris, and Geir E. Dullerud, \"DiProber: Estimating Relays Capacities in Underloaded Anonymous Communication Networks\", to appear in Proceedings of American Control Conference (ACC), 2024. Xingang Guo, Darioush Esfahani, Peter Seiler, Geir Dullerud, and Bin Hu, \"Complexity of Derivative-Free Policy Optimization for Structured H-infinity Control\", Proceedings of NeurIPS, 2023. Negin Musavi and Geir E. Dullerud, \"Convergence of Gradient-based MAML in LQR\", to appear at IEEE Conference on Decision and Control, 2023. Hussein Darir, Geir E. Dullerud, and Nikita Borisov, \"ProbFlow : Using Probabilistic Programming in Anonymous Communication Network\", Proceedings of Network and Distributed Security System Symposium (NDSS), 2023. K.-Y. Tseng, J.S. Shamma, G.E. Dullerud, \"Low-fidelity Gradient Updates for High-fidelity Reprogrammable Iterative Learning Control\", Proceedings of American Control Conference (ACC), 2022. K.-Y. Tseng, J.S. Shamma, G.E. Dullerud, \"GRILC: Gradient-based Reprogrammable Iterative Learning Control for Autonomous Systems\", accepted to NeurIPS 2021 Workshop on Deployable Decision Making in Embodied Systems(EXTENDED ABSTRACT ONLY), 2021. Essick, R. and G.E. Dullerud, \"Application of a Message-Passing Decomposition of Sparsely-Coupled Linear Programming Problems to the Uniform Stabilization of Positive Switched Linear Systems\", Proceedings of the American Control Conference (ACC), 2018. Porto, J.J. and G.E. Dullerud, \"Decentralized Control of Switched-Systems with Path-Dependent l2-induced Bounds\", Proceedings of the American Control Conference (ACC), 2018. Strijbosch, N., G.E. Dullerud, A.R. Teel, and W.P.M.H. Heemels, \"L2-gain Analysis of Periodic Event-triggered and Self-triggered Control Systems with Delays using Lifting Techniques,\" Proceedings of IEEE Conference on Decision and Control (CDC), 2017. Buccafusca, L., C.L. Beck, and G.E. Dullerud, \"Modeling and Maximizing Power in",
  "content_length": 15357,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:07"
}