{
  "name": "Gena Hahn",
  "homepage": "http://www.iro.umontreal.ca/~hahn",
  "status": "success",
  "content": "Gena Hahn Gena Hahn Professeur titulaire (Full professor) Ph.D. (mathématiques), McMaster, 1981 Doctorat d'état (informatique), Université de Paris-Sud, 1986 Si vous cherchez un directeur, sachez que je ne connais rien en IA et la plupart de sujets y reliés. Par conséquent je ne réponds pas au courriel me sollicitant pour diriger un MSc ou un Doctorat en dehors des mathématiques discrètes. If you are looking for a supervisor, bear in mind that I know nothing of AI and most related subjects. Consequently I do not respond to emails asking for masters or doctoral supervision outside discrete mathematics Intérêts de recherche: Théorie des graphes, combinatoire Mon intérêt principal est la théorie des graphes et les domaines annexes tels combinatoire, algorithmique et complexité, communication dans des réseaux d'interconnexion, etc. J'aime des résultats théoriques et structurels qui mènent à une meilleure compréhension et je considère des problèmes assez variés. Les graphes infinis sont très intéressants et je travaille également sur des jeux de policiers et voleurs sur des graphes (les deux sujets se rencontrent parfois). Publications représentatives: G. Fortin-Leblanc, G. Hahn, F. Ramamonjisoa,  On cop-win dynamic graphs, accepté à Discrete Applied Mathematics, 2024 G. Hahn, M. Pouzet, R. E. Woodrow, « Siblings of countable cographs »,  Journal of Multi Valued Logic and Soft Computing} 4 (2024),  299-331 (arxiv:2004.12457) G, Hahn, « A propos de rien », chapitre dans 16 déambulations sensibles  Sur le plaisir de faire des mathématiques, éditions Art Dit, octobre 2023 P. Charbit, G. Hahn, M. Kamiński, M. Lafond, N. Lichiardopol, R. Naserasr, B. Seamone, R. Sherkati, « Edge clique covers in graphs with independence number 2 », J. of Graph theory 92 (2021), 324  339 A. Bonato, P. Gordynowicz, G. Hahn, « Cops and Robbers ordinals of cop-win tree » Discrete Mathematics 340 (2016), 951  956 B. Bagheri, G. Hahn, « A note on the circuit double cover of infinite graphs », Journal of Combinatorics, 8 (2017), 289 -- 304 A. Bonato, G. Hahn, C. Tardif, « Large classes of infinite k-cop-win graphs », Journal of Graph Theory 65 (2010), 334 - 342 G. Hahn, G. MacGillivray, « A characterisation of k-cop-win graphs and digraphs »,  Discrete Mathematics 306 (2006), 2492 - 2497 G. Hahn, F. Laviolette, N. Sauer, R.E. Woodrow, «On cop-win graphs», Discrete Mathematics 258 (2002), pp. 27 - 41 G. Hahn, J. iráň, D. Sotteau, «On the injective chromatic number of graphs », Discrete Mathematics 256 (2002), pp. 179 - 192 G. Hahn, C. Tardif, «Graph homomorphisms: structure and symmetry», in Graph symmetry, ASI ser C, Kluwer, 1997, pp. 107 -- 166 G. Hahn, P. Hell, S. Poljak, «On the ultimate independence ratio», European Journal of Combinatorics 16 (1995), pp. 253 - 261 G. Hahn, E. Milner, R.E. Woodrow, «Infinite Friendship Graphs with Infinite Parameters», Journal of Combinatorial Theory (B) 52 (1991) pp. 30 - 41 M. Farber, G. Hahn, P. Hell, D. Miller, «Concerning the achromatic number of graphs», Journal of Combinatorial Theory (B) 40 (1986) pp. 21 - 39 Research interests: Graph theory, combinatorics My main interest is graph theory and related areas, such as combinatorics, algorithms and complexity, communication in interconnection networks. I like theoretical and structural results that lead to better understanding. I do and will think about many different problems. Infinite graphs are particularly interesting as are cops-and-robbers games on graphs (the twain do meet). Cours Cours IFT2105 H25 plan du cours, voir aussi Studium IFT3545 H25 plan du cours, voir aussi Studium Disponibilité 17 novembre 2024",
  "content_length": 3643,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:05"
}