{
  "name": "Gene Spafford",
  "homepage": "https://spaf.cerias.purdue.edu",
  "status": "success",
  "content": "Gene Spafford's Personal Pages: Spaf's Home Page Spaf's Home Page Links Overview Recent News Short biography Prospective Students Publications CERIAS Eugene H. Spafford (\" spaf \") Offices: Distinguished Professor Dept. of Computer Sciences Lawson Building Room 1183 305 North University Ave. W. Lafayette, IN 47907-2107 Executive Director Emeritus Purdue University CERIAS Convergence Building Room 3815 (in Suite 3800) 101 Foundry Drive W. Lafayette , IN 47906-3446 Email: spaf@cerias.purdue.edu (professional) -OR- gene@spaf.us (personal) PGP Key: https://spaf.cerias.purdue.edu/pers/pgp.html Telephone work +1 765 494 7825 +1 765 494 7841 (CERIAS receptionist) +1 765 494 6010 (CS receptionist) Fax Phone: fax +1 765 496 3181 (CERIAS office) +1 765 494 0739 (CS department office) Current time at Purdue University: Timezone is EST (GMT -0500) Office Hours for Summer 2025 : none Office Hours for Fall 2025 : Usually, T 1:30-3 pm in LWSN 1183 Other times by appointment, either online or in person Teaching Fall 2025 CS 626: Advanced Information Assurance CS 69800, M.S. Thesis Research CS 69900, Ph.D. Thesis Research Send email to Spaf as the Editor-in-Chief of the journal: COSE.Editor@gmail.com Published since 1982, COSE is the original journal in computing security & privacy issues and is the official journal of IFIP TC-11 (Computer Security). We welcome original, high-quality article submissions via the journal's on-line system Note: Items in my social media in no way represent opinions or positions of Purdue University or any other organization. Items are purely my own opinion. Home In the News & On the WWW Short Bio Full C.V. Selected Firsts Notable Activities My CERIAS Blog Posts Spaf & the US Gov Courses & Teaching Information for Grad Students Students Past and Present Research and Papers Selected Quotes Miscellaneous Items • • • In Brief... Dr. Eugene Spafford is a Distinguished Professor with an appointment in Computer Science at Purdue University, where he has served on the faculty since 1987. He is also a professor of Philosophy (courtesy), a professor of Communication (courtesy), a professor of Electrical and Computer Engineering (courtesy), a professor of Nuclear Engineering (courtesy), and a Professor of Political Science (courtesy). He serves on several advisory and editorial boards. Spafford's current research interests are primarily in information security, computer crime investigation, and information ethics. He is generally recognized as one of the senior leaders in the field of computing. Spaf (as he is known to his friends, colleagues, and students) is the founder and Executive Director Emeritus of the Purdue CERIAS (Center for Education and Research in Information Assurance and Security). He was the founder and director of the (superseded) COAST Laboratory. Spaf is Editor-on-Chief of the Elsevier journal Computers & Security, the oldest journal in the field of information security, and the official outlet of IFIP TC-11. He is currently serving as a member of the board of directors of the Computing Research Association (CRA), Sightline Security (a non-profit, charitable organization), and the RISE Information Security Foundation, Inc. A more complete account of Spaf's activities and background may be found on the \"Short biography\" page. You can find out about some of his recent activities by visiting his news page. A complete C.V. is also available. What's New with Spaf? What's New? × Some new items about Spaf in the news can be found here, on the News page. That page also indicates some upcoming appearances and events. I had my second-ever cover story in Communications of the ACM. Purdue CS posted a nice write-up about it. At the Purdue Board of Trustees meeting in June, Spaf was named as a Distinguished Professor -- the highest academic rank at the university. Spaf was granted a courtesy appointment as a professor of Nuclear Engineering, at Purdue, starting July 1. It was announced at RSAC 2024 that Cybersecurity Myths and Misconceptions has been added to the Cybersecurity Canon Hall of Fame. The announcement noted this about the Hall of Fame \"This is an authoritative and exclusive list of must-read books for all cybersecurity practitioners - be they from industry, government or academia — where the content is timeless, genuinely represents an aspect of the community that is true and precise, reflects the highest quality and, if not read, will leave a hole in the cybersecurity professional's education that will make the practitioner incomplete.\" Have you gotten your copy of the book? Cybersecurity Myths and Misconceptions: Avoiding Hazards and Pitfalls That Derail Us by Spaf, Leigh Metcalf, and Josiah Dykstra. See the informational handout for details including Information about what the book is about Comments by expert reviewers in the field Information about the authors Ordering information See this handout (PDF) The book is now available in a Japanese translation! You can get it on the Japan Google site. And, related to that, the book is now as an audiobook! Close",
  "content_length": 5072,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:05"
}