{
  "name": "Gene Louis Kim",
  "homepage": "https://cse.usf.edu/~genekim",
  "status": "success",
  "content": "Gene Louis Kim Gene Louis Kim Assistant Professor I am an Assistant Professor at the University of South Florida's Department of Computer Science and Engineering and Director of the Language GRASP Lab. I received by doctorate at the University of Rochester, advised by Len Schubert. My research interests are in the intersection of natural language processing, computer reasoning, and computational linguistics. I create algorithms that model formal representations of natural language meaning and structured information to enable computers to interact with language in a generalizable manner. My long term research goal is to enable computers to robustly understand and use natural language in arbitrary settings. Email: genekim AT usf DOT edu Office: Engineering Building II 376 CV Graduate Students Mahammad Kamruzzaman Maneesh Reddy Chamakura Abdullah Al Monsur Sai Durga Shashidhar Pothukuchi Undergraduate Research Assistants Jeremy Rutter Justin Delgado Suryakanth Prasad Gottipati Omar Abdulrahman Adam Brohl (@ Knox College) Kenneth Verzyl Fiorella Andrea Ratti Tamayo Jason Rudinsky Shrabon Das Taylor Tiedge Online Resources ULF Website This is the general project website for the ULF project. It holds a collection of blog posts that describe ULF in more detail than possible in publications or focused documents. It also links to resources used by the project, such as annotation guidelines, the annotator, and code. ULF and Inference Annotators Annotators for my research project on annotating and demonstrating the inference capabilities of underspecified episodic logic. If you're interested in getting involved please let me know! I'm always looking for more collaborators on this project. Related resources: ULF Annotation Guidelines (Steel Bank Common) Lisp Highlights This documents highlights aspects of Steel Bank Common Lisp that are important for getting started as a beginner. It covers important functions to know, some weird aspects of Lisp, minimal debugging tips, and some exercises to get comfortable with Lisp programming. Publications Semantically Informed Data Augmentation for Unscoped Episodic Logical Forms Mandar Juvekar, Gene Louis Kim, and Lenhart Schubert In Proceedings of the 15th International Conference on Computational Semantics (IWCS), 2023 A Transition-based Parser for Unscoped Episodic Logical Forms Gene Louis Kim, Viet Duong, Xin Lu, and Lenhart Schubert In Proceedings of the 14th International Conference on Computational Semantics (IWCS), 2021 A (Mostly) Symbolic System for Monotonic Inference with Unscoped Episodic Logical Forms Gene Louis Kim, Mandar Juvekar, Junis Ekmekciu, Viet Duong, and Lenhart Schubert In Proceedings of the 2nd Workshop on Natural Logic Meets Machine Learning (NALOMA), 2021 Montague Grammar Induction Gene Louis Kim and Aaron Steven White In Proceedings of Semantics and Linguistic Theory 30 (SALT 30), 2021 [DOI] Monotonic Inference for Underspecified Episodic Logic Gene Louis Kim, Mandar Juvekar, and Lenhart Schubert In Proceedings of the 1st Workshop on Natural Logic Meets Machine Learning (NALOMA), 2020 [Slides] [Bibtex] Generating Discourse Inferences from Unscoped Episodic Logical Formulas Gene Louis Kim, Benjamin Kane, Viet Duong, Muskaan Mendiratta, Graeme McGuire, Sophie Sackstein, Georgiy Platonov, and Lenhart Schubert In Proceedings of the 1st Workshop on Designing Meaning Representations (DMR), 2019 [Slides] [Bibtex] Towards Natural Language Understanding with Rich Logical Schemas Lane Lawley, Gene Louis Kim, and Lenhart Schubert In Proceedings of the 13th International Conference on Computational Semantics (IWCS), 2019 [Slides] [Bibtex] A Type-coherent, Expressive Representation as an Initial Step to Language Understanding Gene Louis Kim and Lenhart Schubert In Proceedings of the 13th International Conference on Computational Semantics (IWCS), 2019 [Slides] [Bibtex] Towards Parsing Unscoped Episodic Logical Forms with a Cache Transition Parser (Poster Abstract) Gene Louis Kim In Proceedings of the 32nd International Conference of the Florida Artificial Intelligence Research Society (FLAIRS), 2019 [Poster] [Bibtex] Intension, Attitude, and Tense Annotation in a High-Fidelity Semantic Representation Gene Kim and Lenhart Schubert In Proceedings of the Workshop on Computational Semantics Beyond Events and Roles (SemBEaR), 2017 [Slides] [Bibtex] High-Fidelity Lexical Axiom Construction from Verb Glosses Gene Kim and Lenhart Schubert In Proceedings of the Fifth Joint Conference on Lexical and Computational Semantics (*SEM), 2016 [Supplementary Document] [Slides] [Bibtex] A Type System for Format Strings Konstantin Weitz, Gene Kim, Siwakorn Srisakaokul, and Michael D. Ernst In Proceedings of the 2014 International Symposium on Software Testing and Analysis (ISSTA), 2014 [Bibtex] A Format String Checker for Java Konstantin Weitz, Siwakorn Srisakaokul, Gene Kim, and Michael D. Ernst In Proceedings of the 2014 International Symposium on Software Testing and Analysis (ISSTA), 2014 [Bibtex] Technical Reports/Unrefereed Articles Thesis Proposal Gene Louis Kim Committee: Lenhart Schubert (supervisor), James Allen, Dan Gildea, Scott Grimm, Aaron Steven White [Slides] University of Washington System for 2015 KBP Cold Start Slot Filling Stephen Soderland, Natalie Hawkins, Gene Kim, and Daniel S. Weld In Proceedings of the Text Analysis Conference (TAC), 2015 A Language Model for Extracting Implicit Relations Stephen Soderland, Gene Kim, and Natalie Hawkins Technical Report, 2015",
  "content_length": 5509,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:07"
}