{
  "name": "Gene Tsudik",
  "homepage": "http://www.ics.uci.edu/~gts",
  "status": "success",
  "content": "Gene Tsudik's Info Page Gene Tsudik Sleepy Passivist Extinguished Professor Department of Conputa Sighence University of Caliphoneya, Irvine (Pseudo)Random Stuff: Keynote talk at ACM CCS 2024: SLIDES Siesta Forever (a Halloween parody of \"All Night Long\" by Lionel Ritchie): Siesta Forever Il Repubblicano (a parody of \"L'Italiano\" by Toto Cutugno): Il Repubblicano Abstracts of some talks/seminars in the UCI School of Information and Computer Science: Talk Abstracts Separated at Birth? Meathead or Howard? A shamelessly moralistic sermon for PhD students: Ballad of Little White Rabbit Crypto Poetry for the masses: Zero Knowledge Made Easy, and Diffie-Hellman for Morons A large library of my sad failed attempts to win the New Yorker Magazine weekly cartoon caption contest: Cartoon Caption Failures Flowchart for prospective PhD students: Are you a prospective PhD student looking for an advisor? If so, here is an easy and painless way to see if you and I can work together (a test in 3 parts). Just click here (round 1), then here (round 2), and finally here (round 3)! Did you pass the test? If so, great, congrats! If you want to do research in Machine Learning, Differential Privacy, or Blockchains/Cryptocurrencies, please go back to the flowchart and try again. Sketchy and Predatory Venues & Publishers to avoid: Any conference or journal soliciting submissions via \"Call for Paper\" IARIA HINDAWI MDPI EAI WSEAS Research Interests: Privacy Computer & Network Security Applied Cryptography My Pointers: Security and Privacy Research Outfit (SPROUT) Google Scholar Publications DBLP Publications Current and Former Students Assorted Facts Favorite Expressions Invented Words Brief Bio: Gene Tsudik is a Distinguished Professor of Computer Science at the University of California, Irvine (UCI). He obtained his PhD in Computer Science from USC in 1991. Before coming to UCI in 2000, he was at IBM Zurich Research Laboratory (1991-1996) and USC/ISI (1996-2000). His research interests include many topics in security, privacy and applied cryptography. Notably, these do not include Machine Learning, Differential Privacy as well as Blockchains and Cryptocurrencies. Gene Tsudik was a Fulbright Scholar (Italy) and a 3-time Fulbright Specialist (Singapore, Taiwan, and Myanmar). He is a fellow of ACM, IEEE, AAAS, and IFIP, as well as a foreign member of Academia Europaea. From 2009 to 2015 he served as Editor-in-Chief of ACM Transactions on Privacy and Security (TOPS, formerly known as TISSEC). He was the recipient of the 2017 ACM SIGSAC Outstanding Contribution Award, the 2020 IFIP Jean-Claude Laprie Award. the 2023 ACM SIGSAC Outstanding Innovation Award, the 2024 NDSS Test-of-Time Award, and a 2024 Guggenheim Fellowship. He also authored the first rhyming crypto-poem published as a refereed paper. Sadly, he has no social media presence. Diversity uber alles! Modern diversity dimensions are notoriusly inadequate in capturing all important aspects of variety in the homo sapiens species. For example, consider the following: Vertical dimension: both dwarves/midgets and giants (use your own measures to define them) represent a non-negligible fraction of human population. Yet, their representation in academia is dismal. Gravitational dimension: nearly 40% of US population is obese. Where are they in academia? Why do academic search ads fail to entice this hefty fraction of humanity? < Intellectual dimension: between 20 and 40% of US population has under-100 IQ. While some academic departments and disciplines are over-filled with them, representation in others remains dismal. How would students with similar IQs learn when their instructors do not present adequate role models? There are two equivalence classes of idiots: Those who yearn for the past that never was. AND Those who dream of the future that never will be. Quotidian Wisdom (speaking of idiots): For every pithy inspirational quote, saying or proverb, there is army of idiiots willing to believe it. An urgent message to all humorless barbarians inhabiting this long-suffering planet: As a free human being, I reserve the right to disrespect, mock, parody, laugh at, and disbelieve any and all of your deities, saints, prophets, idols, holy fools, deans, chancellors, political leaders, gurus, kings, presidents and presidential candidates.",
  "content_length": 4336,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:38"
}