{
  "name": "Gene Cooperman",
  "homepage": "http://www.ccs.neu.edu/home/gene",
  "status": "success",
  "content": "Gene Cooperman's Home Page Gene Cooperman I do research in high performance computing and transparent checkpointing, including load balancing, support for newer architectures (e.g., GPUs), etc. First, some random pointers about me. I also do research in applying model checking for debugging parallel or concurrent software. RESEARCH REFEREED PUBLICATIONS (Note, also, the more than 150 refereed publications from the DMTCP site, most of which describe research of other teams in which they use our DMTCP project.) SOFTWARE MANA for MPI (Checkpointing MPI, using DMTCP platform) (with open-source software at GitHub: collaboration of NERSC, MemVerge and DMTCP team) So Why Can't I Checkpoint That? (video) (or alt): Historical perspective as a keynote talk at SuperCheck'21, Feb. 5, 2021, with slides from the keynote talk Video of talk (and slides) given at Microsoft Research Laboratory (Redmond) on Nov. 15, 2019 (see below for slides of earlier, more introductory material) DMTCP (Distributed Multithreaded Checkpointing) (led by a series of students) Extending DMTCP Checkpointing for a Hybrid Software World (or alt from MUG'17; a description of using DMTCP plugins to adapt to the external world) DMTCP: System-Level Checkpoint-Restart in User Space (a basic introduction to the internal architecture of DMTCP, from MUG'14) \"McMini and DeepDebug: Efficient Deterministic Replay of Multithreaded Bugs\" McMini (with docs/tutorial; for explicit-state model checking of multi-threaded programs; as simple as executing: mcmini ./a.out) OLDER SOFTWARE: Geant4MT (Geant4-MultiThreaded) (led by my former PhD student, Xin Dong; a multi-threaded parallelization of Geant4, the most detailed Monte Carlo simulation of particle-matter interaction: now appearing as part of Geant4 version 10.0 (see New Developments: \"General\"); also see our Euro-Par 2010 paper.) Roomy system for \"Big Data\" (led by my former PhD student, Dan Kunkle) TOP-C HOME PAGE (Task Oriented Parallel C/C++) ParGeant4 HOME PAGE ParGAP HOME PAGE ParGCL HOME PAGE Marshalgen TEACHING: In Spring, 2026, I will be teaching Accelerated/Advanced Computer Systems (CS 4973). TEACHING: In Fall, 2025, I will be teaching Computer Systems (CS 5600) (for M.S. students). TEACHING: In Spring, 2025, I taught Computer Systems (CS 3650). TEACHING: In Fall, 2024, I will be teaching Computer Systems Seminar (CS 7670). TEACHING: In Spring 2020, I taught a Ph.D.-level course, Special Topics in Systems (CS 7680). My office is in 336 WVH. My High Performance Computing Lab is in 370 WVH. The extension there used to be x7127. (phones being removed??) Next, some random pointers of interest to me. Khoury College of Computer Sciences (including Campus map (or alt) (We are West Village H (WV-H); Scroll to top of web page, and type \"West Village H\" and <return> in search bar, and then zoom out to see neighboring streets/buildings.) snow days posted here, research, (and summer), Employee Hub: me.northeastern.edu (but me.neu.edu not allowed) (REPLACES MYNEU.NEU.EDU; (Got to \"Resources\" for Banner) (for benefits, go to workday, and then left menu (e.g., benefits) to discover your benefits; and then go back to \"Employee Hub\" and search for that plan; or alt) (and then go to Resources)), Employee Hub (me.neu.edu), was myNEU (my.neu.edu), (to find out your class roster, login to myneu, so it knows who you are; then go to \"faculty services\" so it knows you're a faculty member; then select \"Site map\", followed by current semester, followed by \"Summary Class List\", and it should now know your course and key code; Select course to see Roster (aka \"Summary Class List\"), and save as \"text\") myHelp (Northeastern University IT help) Khoury undergraduate degree programs (requirements and sample course schedules [no room numbers, no instructor names]), Browse courses for chosen semester (Select dept only; lists class size, seats avail.; To find out instructor and room #, click on course title and then click on \"Instructor/Meeting Times\"), N.U. undergraduate and graduate course descriptions in catalog (2024-25) (and Registrar home page), N.U. undergraduate and graduate course descriptions for C.S., Khoury graduate course descriptions, ECE Graduate Program Guide (and overview at top of page), Khoury undergraduate course descriptions (and overview at top of page), OBSOLETE: Canvas (instructure.com) allows you to select: Courses->CHOOSE COURSE->FACT Reporting and Photo Roster, Click on Navigate Non-CPS (Progress Reports and Photo Roster; then click on a course; then go to bottom and click on a student for his/her photo) Khoury courses (for current semester, OBSOLETE), N.U. undergraduate and graduate course schedules (click on \"Select a Term\", and then enter course number without department: e.g., \"3650\" and not \"CS 3650\", It will then allow you to click on the course to get the description and the prereq's) Course Sequence Schedule (restricted: requires N.U. account), M.S. ALIGN program (\"for students with strong analytical and quantitative backgrounds. While students typically come from fields such as mathematics and engineering, the program also supports students from a broad range of undergraduate majors\"; Search on \"Admissions Requirements\" for requirements.) N.U. honors program, N.U. final exam schedules (students should look at me.northeaster.edu, fac. should look at Banner, choose \"Class Schedule\" from menu, and navigate to your course) (and earlier, when I last looked, at Banner; Final exam policies, https://wl11gp.neu.edu/udcprod8/NEUCLSS.p_disp_dyn_sched Select semester, then select \"Subject: Computer Science\", and search in page for course), Khoury graduate school (with M.S. and PhD course reuirements (click on \"program requirements\" for course requirements\")), Khoury PhD Programs info (internal only) and and Forms for current Khoury graduate students, M.S. course reuirements (click on \"program requirements\" for course requirements\")), Readings (CS 8982) and Project (CS 8674) Courses, M.S. thesis (and please read this and also this for how to register for courses), Northeastern University Applications for Admission (undergrad through PhD) FACT on myNEU provides photos of students FACT: Go to MyNEU -> Services -> Canvas -> Search on your course (it will say \"not available\"; that means that it is not available for FACT) -> select your course -> Open up menu for \"Course tools\" -> Select \"FACT Reporting and Photo Roster\" Khoury IT documentation (including Khoury printing, self-managed Linux) U. of Missouri OWA safe-link-decoder (or alt or alt2 or alt3 Khoury admin portal (internal use only) Khoury Teaching (internal use only) Khoury admin (includes TODO items: change semester after login) Khoury admin (and Faculty and Teaching) (internal use only) Khoury account request form Khoury Administrative Staff my.ccs.neu.edu (evemtually for self-service group mgmt, course dir creation, vm provisioning, hand-ins, etc.) configuring mutt to use IMAP (with example configs); or do: mutt -f imap://zimbra/inbox (new mail, needs zimbra.ccs.neu.edu if not from ccs machine), or mutt -f \"{imap.ccs.neu.edu/ssl/user=$USER}INBOX\" (for older mail) (or maybe env MAIL=... mutt) Zimbra web mail (server: zimbra.ccs.neu.edu) Khoury seminar rooms to reserve: 164 WVH, 166 WVH, and 366 WVH (calendar) Write to operations@lists.ccs.neu.edu with room number and time/dates in order to reserve it. (At one time via ccis-faculty-staff-login, but now via operations.) Internal mailing lists (Khoury only) Khoury administration modules summary (change URL: semester=Summer+2024, or change in upper right) Northeastern University home page (URLs change often) Academic Calendar (WAS: pdf, yuck!; at bottom of page, click None, and then click UG, GR, or whatever; has things like \"last day to drop class\") Northeastern University phone book (or direct) How to use Internet Calling with Microsoft Teams? (KB0014333) Microsoft Teams Web login Faculty Handbook and University Policies (with Conflict of Commitment and Interest Verizon Voice Mail Upgrade NU Voice Mail Menu Search inside N.U. Academic programs Public Safety annual report Research Policies NU Policies and Guidelines: Research Enterprise Services (NU-RES) (e.g., F\\&A overhead rates) Policy on Sexual Harassment NEUtoo.com Professional Standards and Business Conduct Policy (Where?) (2002 copy) Equal Opportunity Policy Graduate Council Bylaws Reservation Form for Egan Center Blackboard (bulletin board, etc., for teaching) Khoury internal calendar (Type \"gc\" (goto calendar); Alternatively, click on this calendar.ccs.neu.edu page; Then search on that page for the word \"calendar\"; Then click on that calendar tab.) Khoury Wiki Confluence 2.9 Documentation (Dashboard) for Wiki (Note, \"Browse Space\" tab really means \"Administer Space\".) PhD Committee International Tutoring Center (one-on-one help with English of written assignments) Research admin Systems Research Group (SRG) (at Khoury College, Northeastern U.) SIGPAPER FA 2024 Massachusetts Green High-Performance Computing Center Getting an account on Explorer Cluster (but PI will need to request a storage partition on Explorer; then \"ssh @login.explorer.northeastern.edu\") How do I apply for renewal of a sponsored account? (Starting in 2024, a professor is no longer allowed to sponsor an account for an external collaborator. The professor must get permission from the Chair or Dean to have an external collaborator on Discovery.) N.U. HPC Documentation (or OBSOLETE (older): Northeastern University Research Computing) (and RC help and srun --pty /bin/bash for interactive usage) Open OnDemand (OOD) (Graphic applications and terminals running on Discovery, running in a Browser tab; current problems with cmd-line editing in terminal???) (old, 2024) Hardware Overview (e.g., CPU nodes) Available partitions (For example, sinfo -p --Format=time,nodes,cpus,socketcorethread,memory,nodeai,features #displays more detailed information using the Format option, including features like t",
  "content_length": 16554,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:04"
}