{
  "name": "Geng Yuan",
  "homepage": "https://geng-yuan.com",
  "status": "success",
  "content": "Geng Yuan – UGA Skip to content Geng Yuan Geng Yuan is an assistant professor in School of Computing (CS Department) at the University of Georgia. He received his Ph.D. Degree in Computer Engineering from Northeastern University (NEU) in 2023, under the supervision of Prof. Yanzhi Wang. His research interests are in general AI systems, including energy-efficient deep learning and artificial intelligence systems, efficient training, model compression, hardware-software co-design for DNN architectures, and emerging deep learning systems. Google Scholar Website  I am always looking for highly-motivated Ph.D. / Masters / Interns to join my group. If you are interested, please send your CV and transcripts via email. Email: geng.yuan@uga.edu Awards 09/2025 ACM/IEEE International Conference on Computer-Aided Design (ICCAD 2015): ➢ Best Paper Nomination 01/2023 The 11th International Conference on Learning Representations (ICLR 2023): ➢ Spotlight Paper Award 12/2021 The 35th Conference on Neural Information Processing Systems (NeurIPS 2021): ➢ Spotlight Paper Award 05/2021 Hardware Aware Efficient Training workshop in ICLR (HAET 2021): ➢ Best Paper Award 03/2021 The 24th Design, Automation and Test in Europe Conference (DATE, 2021): ➢ Best Paper Nomination 08/2020 International Symposium on Low Power Electronics and Design (ISLPED 2020) – Design Contest: ➢ Design Contest 1st Place Winner 06/2019 Design Automation Conference – System Design Contest (DAC-SDC 2019): ➢ Special Service Recognition Award 03/2018 The 19th International Symposium on Quality Electronic Design (ISQED 2018): ➢ Best Paper Nomination Professional Experience University of Georgia    (08/2023 – present)Assistant Professor Snap Inc    (05/2022 – 08/2022)Research Internship  Mellanox Technologies, Inc. | NVIDIA    (05/2022 – 08/2022)Chip Design Engineer Internship Education Ph.D. Candidate in Computer Engineering Research Advisor: Yanzhi Wang 08/2017 – 05/2023 Department of Electrical and Computer Engineering Northeastern University, Boston, MA, USA M.S. in Electrical & Computer Engineering 08/2014 – 05/2016 Department of Electrical Engineering and Computer Science Syracuse University, Syracuse, NY, USA B.S. in Electrical Engineering 08/2010 – 06/2014 College of Electrical Information and Control Engineering Beijing University of Technology, Beijing, China Students Activities Qitao Tan – 2026 UGA James L. Carmon Award 2nd Place Winner (University-wide scholarship)",
  "content_length": 2466,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:09"
}