{
  "name": "Geng Hong",
  "homepage": "https://ghong.site",
  "status": "success",
  "content": "Geng Hong - HomeGeng HongAssistant Professor, Fudan Development Institute, Fudan UniversitySystem Software and Security Group, School of Computer Science, Fudan Universityghong[at]fudan.edu.cn I’m an Assistant Professor at Fudan Development Institute, Fudan University, also a faculty of System Software and Security Group in School of Computer Science. I received my Ph.D. in Computer Science at Fudan University in June 2022, advised by Prof. Min Yang. My research interests include Cybercrime, Privacy on Mobile App, as well as Novel Cybersecurity Threats. I also serve as member of Program Committee of several top-tier conference, such ACM CCS 24, CCS 25, ACM WWW 25, etc.I’m looking forward to self-driven students with a keen interest in cybercrime, mobile security, or mobile privacy. If you’re interested, just email me your resume.InterestsCybercrimePrivacy on Mobile AppNovel Cybersecurity ThreatAcademiaFudan University2017.9 - 2022.6Ph.D. Computer ScienceTaiwan University (NTU)2015.2 - 2015.6Exchange StudentXiamen University2013.9 - 2017.6B.E. Computer ScienceNews Our paper has been accepted by NDSS 26 (summer cycle). Congratulations to Mengying and hope to see you in San Diego. Jul 2025. Honored to join the Program Committee (PC) of AAAI 2025. Warmly invite you to submit papers to our venue and hope to meet you in Philadelphia. Aug 2025. Our paper has been accepted by ESORICS 25. Congratulations to Bingyang. June 2025. Our paper has been accepted by USENIX Security 25. Congratulations to Jinsong and Mengying. May 2025. Our paper has been accepted by IMC 25. Congratulations to Yijing. Mar 2025. Attended the NDSS 2025 in San Diego, California. Feb 2025. Our paper has been accepted by USENIX Security 25. Congratulations to Mingxuan. Jan 2025. Our paper has been accepted by WWW 25 (oral). Congratulations to Maiwuwu XD! Not only is he a new-rising researcher, but he is also a talented singer-songwriter and photographer (see His NetEase Cloud Music homepage). Jan 2025. Honored to join the Technical Program Committee (TPC) of ACM CCS 2025. Warmly invite you to submit papers to our venue and hope to meet you in Taipei. Jan 2025. Serve as ACM WWW'25 Security Reviewer. Nov 2024. Our paper has been accepted by ICSE 25 (second cycle). Congratulations to Mengying once again! She published two papers (NDSS and ICSE) within a single month XD! Oct 2024. Our two papers have been accepted by NDSS 25 (fall cycle). Congratulations to Mengying and Ruixuan. Oct 2024. Our paper has been accepted by NDSS 25 (summer cycle). Congratulations to Zhibo. Sept 2024. It is a pleasure to cowork with colleagues from the Shanghai Municipal Education Commission. Jun 2024. Honored to join the Technical Program Committee (TPC) of ACM CCS 2024. Warmly invite you to submit papers to our venue and hope to meet you in Salt Lake City. Jan 2024. Happy to find that our paper, Uncovering the Rise of Visual Scams in Cryptocurrency Wallets, has been accepted by WWW'24. Special congratulations to Guoyi for publishing his first top-tier paper during his first year as a master’s student. Jan 2024. Attended the 30th ACM CCS in Copenhagen, Denmark. Delivered a presentation on the security risks associated with mini-apps. Additionally, participated in a panel discussion hosted by Professors Zhiqiang Lin and Luyi Xing. Nov 2023. I, co-supervised with Prof. Min Yang, lead an undergraduate team, with their project ‘Zhu Yuan - Cybercrimial Asset Radar,’ won the grand prize at the 18th ‘Challenge Cup’ National College Students’ Extracurricular Academic Science and Technology Works Contest(“挑战杯”全国大学生课外学术科技作品竞赛). This marks the best record in the history of our department. Oct 2023. NSFC has awarded me a grant for the proposal titled “Iteration-Based Detection Method for Underground Mobile Applications”. Grateful to NSFC! Aug 2023. I have been awarded the Fudan Policy Advisory Research Support Program. Jul 2023.Recent PublicationsSee my google scholar for the latest listOne Email, Many Faces: A Deep Dive into Identity Confusion in Email Aliases, 2025,the Network and Distributed System Security (NDSS) Symposium 2026 (NDSS'26, CCF-A)Mengying Wu, Geng Hong, Jiatao Chen, Mingxuan Liu, Baojun Liu, Min YangpdfEmail Cloaking: Deceiving Users and Spam Email Detectors with Invisible HTML Settings, 2025,The 30th European Symposium on Research in Computer Security Conference 2025 (ESORICS 25, CCF-B)Bingyang Guo, Mingxuan Liu, Yihui Ma, Ruixun Li, Fan Shi, Min Zhang, Baojun Liu, Chengxi Xu, Haixin Duan, Geng Hong, Min Yang and Qingfeng Pancoming_soonBeyond Exploit Scanning: A Functional Change-Driven Approach to Remote Software Version Identification, 2025,The 34th USENIX Security Symposium (USENIX Security'25, CCF-A)Jinsong Chen, Mengying Wu, Geng Hong, Baichao An, Mingxuan Liu, Lei Zhang, Baojun Liu, Haixin Duan, Min Yangcode pdfUnveiling the (Ab)usage of Serverless Cloud Function in the Wild, 2025,The ACM Internet Measurement Conference 2025 (IMC'25, the Top-Tier Conference in Network Measurement)Yijing Liu, Mingxuan Liu, Yiming Zhang, Baojun Liu, Jia Zhang, Geng Hong, Haixin Duan, Min Yangcoming_soonNOKEScam: Understanding and Rectifying Non-Sense Keywords Spear Scam in Search Engines, 2025,The 34th USENIX Security Symposium (USENIX Security'25, CCF-A)Mingxuan Liu, Yunyi Zhang, Lijie Wu, Baojun Liu, Geng Hong, Yiming Zhang, Hui Jiang, Jia Zhang, Haixin Duan, Min Zhang, Wei Guan, Fan Shi, Min Yangcoming_soonYou Can't Eat Your Cake and Have It Too: The Performance Degradation of LLMs with Jailbreak Defense, 2025,The Web Conference 2025 (ACM WWW 25, CCF-A)Wuyuao Mai*, Geng Hong*, Pei Chen, Xudong Pan, Baojun Liu, Yuan Zhang, Haixin Duan, Min YangpdfExposing the Hidden Layer: Software Repositories in the Service of SEO Manipulation, 2024,In Proceedings of the 47nd International Conference on Software Engineering (IEEE/ACM ICSE'25, CCF-A)Mengying Wu*, Geng Hong*, Wuyuao Mai, Xinyi Wu, Lei Zhang, Yingyuan Pu, Huajun Chai, Lingyun Ying, Haixin Duan, and Min YangpdfRevealing the black box of device search engine: scanning assets, strategies, and ethical consideration, 2024,the Network and Distributed System Security (NDSS) Symposium 2025 (NDSS'25, CCF-A)Mengying Wu*, Geng Hong*, Jinsong Chen, Qi Liu, Shujun Tang, Youhao Li, Baojun Liu, Haixin Duan, Min YangpdfHADES Attack: Understanding and Evaluating Manipulation Risks of Email Blocklists, 2024,the Network and Distributed System Security (NDSS) Symposium 2025 (NDSS'25, CCF-A)Ruixuan Li, Chaoyi Lu, Baojun Liu, Yunyi Zhang, Geng Hong, Haixin Duan, Yanzhong Lin, Qingfeng Pan, Min Yang, Jun ShaopdfMisdirection of Trust: Demystifying the Abuse of Dedicated URL Shortening Service, 2024,the Network and Distributed System Security (NDSS) Symposium 2025 (NDSS'25, CCF-A)Zhibo Zhang, Lei Zhang, Zhangyue Zhang, Geng Hong, Yuan Zhang, Min YangpdfInterface Illusions: Uncovering the Rise of Visual Scams in Cryptocurrency Wallets, 2024,The Web Conference 2024 (ACM WWW 24, CCF-A)Guoyi Ye, Geng Hong, Yuan Zhang, Min YangpdfAn Underground Industry Application Collection Method Based on Flow Analysis（一种基于突变流量的在野黑产应用采集方法）, 2024,Journal of Software（软件学报）陈沛*，洪赓*，邬梦莹，陈晋松，段海新，杨珉link pdfUnder the Dark: A Systematical Study of Stealthy Mining Pools (Ab)use in the Wild, 2023,30th ACM SIGSAC Conference on Computer and Communications Security (ACM CCS'23, CCF-A)Zhenrui Zhang*, Geng Hong*, Xiang Li, Zhuoqun Fu, Jia Zhang, Mingxuan Liu, Chuhan Wang, Jianjun Chen, Baojun Liu, Haixin Duan, Chao Zhang, Min YangpdfUnderstanding and Detecting Abused Image Hosting Modules as Malicious Services, 2023,30th ACM SIGSAC Conference on Computer and Communications Security (ACM CCS'23, CCF-A)Geng Hong, Mengying Wu, Pei Chen, Xiaojing Liao, Guoyi Ye, Min Yangcode pdfAnalyzing Ground-Truth Data of Mobile Gambling Scams, 2022,43rd IEEE Symposium on Security and Privacy (IEEE S&P Oakland'22, CCF-A)Geng Hong , Zhemin Yang, Sen Yang, Xiaojing Liao, Xiaolin Du, Min Yang and Haixin DuanpdfDetection and Analysis Technology of Cybercrime（网络犯罪的检测分析技术）, 2021,Journal of Computer Research and Development （计算机研究与发展）洪赓，杨森，叶瀚，杨哲慜，杨珉link pdfHow Android Developers Handle Evolution-induced API Compatibility Issues: A Large-scale Study, 2020,In Proceedings of the 42nd International Conference on Software Engineering (ACM ICSE'20, CCF-A)Hao Xia, Yuan Zhang, Yingtian Zhou, Xiaoting Chen, Yang Wang, Xiangyu Zhang, Shuaishuai Cui, Geng Hong, Xiaohan Zhang, Min Yang and Zhemin YangpdfHow You Get Shot in the Back: A Systematical Study about Cryptojacking in the Real World, 2018,25th ACM SIGSAC Conference on Computer and Communications Security (ACM CCS'18, CCF-A)Geng Hong , Zhemin Yang, Sen Yang, Lei Zhang, Yuhong Nan, Zhibo Zhang, Min Yang, Yuan Zhang, Zhiyun Qian and Haixin Duancode pdf videoInvetter: Locating Insecure Input Validations in Android Services, 2018,25th ACM SIGSAC Conference on Computer and Communications Security (ACM CCS'18, CCF-A)Lei Zhang, Zhemin Yang, Yuyu He, Zhenyu Zhang, Zhiyun Qian, Geng Hong, Yuan Zhang and Min Yangcode pdfProjectsSee my github for the complete list",
  "content_length": 9068,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:06"
}