{
  "name": "Geoff F. Kaufman",
  "homepage": "https://www.hcii.cmu.edu/people/geoff-kaufman",
  "status": "success",
  "content": "Geoff Kaufman | Human-Computer Interaction Institute Skip to main content Search Expand Menu Close Menu Geoff Kaufman Robert E. Kraut Associate Professor of Human-Computer Interaction & Ph.D. Program Director Human-Computer Interaction Institute Email gfk@cs.cmu.edu Campus Address Rand Building, Suite 101 Links Google Scholar Research Areas Games and Play Cognitive Science and Behavioral Science Responsible Computing, Ethics and Policy Learning Sciences and Educational Technologies Social Computing Research through Design AR / VR / XR Advisees Erica Cruz Pranav Khadpe Adinawa Adjagbodjou Kimi Wenzel Lisa Egede Kaycee F. Stiemke Administrative Staff Cameil Ruffing Broadly speaking, my work focuses on:studying the psychological/social impact of fictional narratives, games, and computer-mediated interactionsuncovering and empirically verifying user-specific, design-specific, and situational variables that increase that impactextrapolating techniques and best practices for the creation of stories, games, and new technologies as “interventions” for social changeIn the realm of fiction, my work has primarily investigated the psychological process of simulating the subjective reality of a character – and adopting that character’s persona, goals, emotions, beliefs, and actions.  This is a phenomenon that I have come to refer to as experience-taking.  My cross-disciplinary work (utilizing approaches from social psychology, communication, and media studies)  has uncovered several key antecedents of experience-taking (such as the level of psychological distance between individuals and characters) and revealed the impact of experience-taking on real-life behaviors (such as volunteering and voting). My work has also shown how deep connections with characters in fictional worlds can be an effective means of increasing empathy and reducing prejudice.In collaboration with my colleagues at Dartmouth College's Tiltfactor Lab, I am also deeply involved in the development and research of games for social impact.  This work has guided the formulation of a model of \"embedded design\": strategies of interweaving or obscuring the persuasive content or intentions of a game to increase its impact without sacrificing player immersion or enjoyment.  Ongoing work is testing the application of these strategies to games aiming to reduce social biases, model effective bystander intervention techniques, and encourage pro-environmental habits and behaviors. In the News CMU at CHI 2025 Our halls are abuzz with talk of “CHI” (pronounced “kai”), the nickname for the upcoming conference on computer human interaction (CHI). ... View Details Siri, It Hurts When You Constantly Misunderstand Me. You too, Alexa Users of voice assistants such as Siri, Alexa or Google Assistant know the frustration of being misunderstood by a machine. But for people... View Details CMU at CHI 2024 Researchers from the Human-Computer Interaction Institute (HCII) and several other Carnegie Mellon University schools and disciplines cont... View Details SCS Faculty Honored at Carnegie Mellon's Celebration of Education School of Computer Science faculty members took home top accolades when Carnegie Mellon University honored faculty, staff and students at ... View Details Related Projects Project Games and Climate How can games help address the challenge of climate change? Through research and design, we are exploring ways that games can motivate collective action, How can games help address the challenge of climate change? Through research and design, we are exploring ways that games can motivate collective action, increase players' sense of nature stewardship, ... View Details Project Bloomwood Stories Bloomwood Stories: Block Party is a visual novel that aims to increase players' health self-efficacy and connect them to health resources at their local l Bloomwood Stories: Block Party is a visual novel that aims to increase players' health self-efficacy and connect them to health resources at their local library. The player takes the role of a communi ... View Details Back to Top",
  "content_length": 4089,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:09"
}