{
  "name": "Geoff Webb",
  "homepage": "https://research.monash.edu/en/persons/geoff-webb",
  "status": "success",
  "content": "Geoff Webb - Monash University Geoff Webb public CV View Scopus Profile Geoff Webb Professor Professor (Research), Department of Data Science & AI https://orcid.org/0000-0001-9963-5169 EmailGeoff.Webbmonashedu 1988 …2025 Research activity per year Personal profile BiographyGeoff Webb is an Australian Laureate Fellow. A leading data scientist and AI researcher, he is the only Australian to have been Program Committee Chair of the two leading Data Mining conferences, ACM SIGKDD and IEEE ICDM. He was elevated to IEEE Fellow in 2015 and his numerous awards include the inaugural Eureka Prize for Excellence in Data Science (2017). He was editor in chief of Data Mining and Knowledge Discovery from 2005 to 2014. He is a Technical Advisor to BigML Inc, who have incorporated his best of class association discovery software, Magnum Opus, as a core component of their cloud-based Machine Learning service. He developed many of the key mechanisms of support-confidence association discovery in the 1980s. His OPUS search algorithm remains the state-of-the-art in rule search. He pioneered multiple research areas as diverse as black-box user modelling, interactive data analytics and statistically-sound pattern discovery. He has developed many useful machine learning algorithms that are widely deployed. Research interestsProfessor Webb conducts research in both fundamnetal and translational artificial intelligence, machine learning and data science. His fundamental research encompasses: Scalable learning of time series classifiers.  more Learning From Non-Stationary Distributions.  moreAssociation Discovery. moreScalable learning of Graphical Models.  moreEarth Observation Analytics. moreCombining Generative and Discriminative Learning.  moreBayesian Machine Learning.  moreEnsemble Machine Learning.  moreInteractive Machine Learning.  moreDecision tree grafting.  moreRule learning.  moreDiscretization.  moreFeature construction, constructive induction and attribute discovery.  moreStudent and User Modeling.  more His fundamental research encompasses: Computational Biology.  moreHealth.  moreEngineering.  moreSupervision interestsOpportunities exists for outstanding Computer Science research candidates to undertake a PhD in the areas of Machine Learning and Data Mining under my supervision. For an indication of potential areas of research see my Research Programs. For application procedures see here. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, La Trobe UniversityAward Date: 1 Nov 1987Computer Science, Bachelor of Arts (Honours), La Trobe UniversityAward Date: 1 May 1982 Research area keywordsBioinformaticsComputational BiologyData AnalyticsData ScienceData miningKnowledge AcquisitionMachine Learning Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2001 2005 2007 2008 2012 2014 2015 2017 2018 2019 2021 2022 2024 2025 2030 1 Not started 6 Active 38 Finished Projects per year Temporal analytics: Temporal analytics for a complex, dynamic and ever-changing worldWebb, G. (Primary Chief Investigator (PCI))Monash University – Internal University Contribution6/10/25 → 5/10/30Project: Research Efficient and Effective Modelling of Protein Structure with DynamicsWebb, G. (Primary Chief Investigator (PCI)), May, L. (Chief Investigator (CI)) & Whisstock, J. (Chief Investigator (CI))1/07/25 → 30/06/26Project: Research TMLGenAI: Trustworthy Generative AI: Towards Safe and Aligned Foundation ModelsPhung, D. (Primary Chief Investigator (PCI)), Vu, T. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Le, T. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Webb, G. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)), Ke, Q. (Chief Investigator (CI)), Cai, J. (Chief Investigator (CI)) & Bui, T. (Chief Investigator (CI))11/06/24 → 10/07/26Project: Research Efficient and effective methods: Efficient and effective methods for classifying massive time series dataWebb, G. (Primary Chief Investigator (PCI)), Schmidt, D. (Chief Investigator (CI)) & Keogh, E. (Partner Investigator (PI))11/03/24 → 10/03/27Project: Research Positive allosteric modulation of anti-convulsant G protein-coupled receptor signalling to treat drug-resistant epilepsyMay, L. (Primary Chief Investigator (PCI)), Webb, G. (Chief Investigator (CI)), Carlsson, J. (Chief Investigator (CI)), Baltos, J.-A. (Chief Investigator (CI)), TN Nguyen, A. (Chief Investigator (CI)), Christopoulos, A. (Associate Investigator (AI)), Miao, Y. (Associate Investigator (AI)), O'Brien, T. (Associate Investigator (AI)), Rollo, B. (Associate Investigator (AI)), Casillas-Espinosa, P. (Associate Investigator (AI)), Gregory, K. (Associate Investigator (AI)), Scammells, P. (Associate Investigator (AI)) & Nguyen, T. (Associate Investigator (AI))1/01/22 → 31/12/26Project: Research View all 45 projects Research output Research output per year 1988 2017 2018 2020 2021 2023 2024 2025 161 Article 97 Conference Paper 24 Chapter (Book) 6 Edited Book 25 More 5 Review Article 4 Foreword / Postscript 3 Other 2 Commissioned Report 2 Abstract 2 Comment / Debate 2 Editorial 1 Book 1 Other Report 1 Encyclopaedia / Dictionary Entry 1 Letter 1 Other contribution Research output per year Research output per year A Radiograph Dataset for the Classification, Localization, and Segmentation of Primary Bone TumorsYao, S., Huang, Y., Wang, X., Zhang, Y., Paixao, I. C., Wang, Z., Chai, C. L., Wang, H., Lu, D., Webb, G. I., Li, S., Guo, Y., Chen, Q. & Song, J., 16 Jan 2025, In: Scientific Data. 12, 1, 10 p., 88.Research output: Contribution to journal › Article › Research › peer-review Open Access 5 Citations (Scopus) CARLA: Self-supervised contrastive representation learning for time series anomaly detectionDarban, Z. Z., Webb, G. I., Pan, S., Aggarwal, C. C. & Salehi, M., Jan 2025, In: Pattern Recognition. 157, 13 p., 110874.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 49 Citations (Scopus) DACAD: Domain Adaptation Contrastive Learning for Anomaly Detection in Multivariate Time SeriesDarban, Z. Z., Yang, Y., Webb, G. I., Aggarwal, C. C., Wen, Q., Pan, S. & Salehi, M., Aug 2025, In: IEEE Transactions on Knowledge and Data Engineering. 37, 8, p. 4485-4496 12 p.Research output: Contribution to journal › Article › Research › peer-review 3 Citations (Scopus) Dual-View Learning from CrowdsZhang, H., Jiang, L., Zhang, W. & Webb, G. I., 20 Feb 2025, In: ACM Transactions on Knowledge Discovery from Data. 19, 3, 21 p., 61.Research output: Contribution to journal › Article › Research › peer-review 2 Citations (Scopus) Highly Scalable Time Series Classification for Very Large DatasetsDempster, A., Tan, C. W., Miller, L., Foumani, N. M., Schmidt, D. F. & Webb, G. I., 2025, Advanced Analytics and Learning on Temporal Data - 9th ECML PKDD Workshop, AALTD 2024 Vilnius, Lithuania, September 9–13, 2024 Revised Selected Papers. Lemaire, V., Ifrim, G., Bagnall, A., Guyet, T., Malinowski, S., Schäfer, P. & Tavenard, R. (eds.). Cham Switzerland: Springer, p. 80-95 16 p. (Lecture Notes in Computer Science; vol. 15433).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review View all 313 research outputs Prizes Australasian Artificial Intelligence Distinguished Research Contributions AwardWebb, G. (Recipient), 2016Prize: Prize (including medals and awards) Australian Laureate FellowWebb, G. (Recipient), Jul 2025Prize: Competitive Fellowships Discovery Outstanding Researcher AwardWebb, G. (Recipient), 2014Prize: Competitive Fellowships Eureka Prize for Excellence in Data ScienceWebb, G. (Recipient), 2017Prize: Prize (including medals and awards) ICDM-2022 Best Paper Runner-up Award winnerManapragada, C. (Recipient), Salehi, M. (Recipient) & Webb, G. (Recipient), 2022Prize: Prize (including medals and awards) View all 17 prizes Activities Activities per year 2010 2016 2018 7 Professional association or peak discipline body 1 Contribution to conference 1 Committees and working groups Activities per year Member - Earth Observation AustraliaWebb, G. (Member)2018 → …Activity: External Academic Engagement › Professional association or peak discipline body Member - Faculty Research Committee - Faculty of Information Technology, Monash UniversityWebb, G. (Member)2016Activity: External Academic Engagement › Committees and working groups Fellow - Institute of Electrical and Electronics Engineers (IEEE)Webb, G. (Fellow)2016Activity: External Academic Engagement › Professional association or peak discipline body Member - American Association for Artificial IntelligenceWebb, G. (Member)2016Activity: External Academic Engagement › Professional association or peak discipline body Member - IEEE Computer SocietyWebb, G. (Member)2016Activity: External Academic Engagement › Professional association or peak discipline body View all 9 activities Press/Media New tool to speed up translation of genome sequencesSong, J., Daly, R. J., Webb, G. I. B. & Smith, A. I.8/03/181 Media contributionPress/Media: Research",
  "content_length": 9674,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:14"
}