{
  "name": "Geoffrey Mainland",
  "homepage": "https://www.cs.drexel.edu/~mainland",
  "status": "success",
  "content": "Geoffrey Mainland Geoffrey Mainland Associate Professor Department of Computer Science College of Computing and Informatics Drexel University Google Scholar ACM author page DBLP ORCiD Room 1175 Drexel College of Computing and Informatics 3675 Market Street Philadelphia, PA 19104 Email: mainland@drexel.edu (PGP key) Phone: +1 215 895 1518 My research focuses on high-level programming language and runtime support for non-general purpose computation. Special-purpose devices, like sensor networks, GPUs, and FPGAs, can solve certain classes of problems more efficiently than general purpose devices. The drawback is that most existing programming models are designed for general purpose computing and often either under-perform or fail to perform when applied to specialized devices; optimal utilization of specialized devices requires specialized programming models. Current Courses CS 360: Programming Language Concepts (Winter 2025). Research Software-defined radio. We have developed Ziria, a high-level language for programming software-defined radio (SDR) PHY layer protocols, as well as DragonRadio, a custom software-defined radio that placed eighth in DARPA's Spectrum Spectrum Collaboration Challenge (SC2). HSpiral. HSpiral is a Haskell implementation of SPIRAL. Current Students Dresden Feitzinger (PhD) Former PhD Students Mahshid Shahmohammadian (now at Intel) About Me I am currently an Associate Professor in the Department of Computer Science at Drexel University. From September 2011 to August 2013, I was a post doc researcher with the Programming Principles and Tools group at Microsoft Research Cambridge (UK!). I received my Ph.D. in May 2011. I was jointly advised by Greg Morrisett and Matt Welsh. In a former life, I resided in the SF Bay Area and worked for several tech companies, all of which are now defunct. Most of my work was related to handheld devices. Past Research Projects Most of my work can be found on github. High-performance numerics for Haskell. Our results are documented in the paper Exploiting Vector Instructions with Generalized Stream Fusion. Programming GPUs from Haskell. MetaHaskell: Type Safe Heterogeneous Metaprogramming in Haskell. Flask: Staged Functional Programming for Sensor Networks. Quasiquoting for GHC. LiveNet: Reconstruct Sensor Network Dynamics with Passive Monitoring. CitySense: An Open, Urban-Scale Sensor Network Testbed. Miscellanea Type-Safe Runtime Code Generation with (Typed) Template Haskell Writing GPU Programs with Nikola Adding SIMD Support to Data Parallel Haskell SIMD Support for the vector library",
  "content_length": 2584,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:17"
}