{
  "name": "Geoff V. Merrett",
  "homepage": "https://www.ecs.soton.ac.uk/people/gm1r07",
  "status": "success",
  "content": "Professor Geoff Merrett | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Professor Geoff Merrett PhD, BEng, PGCert, FHEA, SMIEEE, MIET Professor Research interests Energy management of mobile/embedded systems Self-powered computing Internet of Things More research Accepting applications from PhD students. Connect with Geoff Email: gvm@ecs.soton.ac.uk Tel: +44 23 8059 2775 Google Scholar ORCID LinkedIn Twitter On this page About Research Publications Teaching External roles and responsibilities About Research Publications Teaching External roles and responsibilities About See my personal hompage for more information. Geoff Merrett is Professor of Electronic and Software Systems at the University of Southampton. He is Head of the Centre for Internet of Things (IoT) and Pervasive Systems, a strategic research centre in the School of Electronics and Computer Science (ECS), and Co-Director of the Arm-ECS Research Centre, an award-winning industrial partnership between ECS and Arm. He received the BEng (1st, Hons) and PhD degrees in Electronic Engineering from Southampton in 2004 and 2009 respectively. He was appointed as a Lecturer shortly after, promoted to Associate Professor in 2014, and Professor in 2019. He is a Senior Member of the IEEE, a Member of IET, and a Fellow of the HEA. Professor Merrett has served on the EPSRC Strategic Advisory Team (SAT) for the ICT theme since 2019, advising EPSRC on new research areas and strategy. He is a member of the eFutures Steering Group (an EPSRC-funded network representing the UK’s electronic systems academic community), having previously served on its ECR Steering Group, and co-manages the UK’s Energy Harvesting Network (co-organising its annual event from 2011-2016). He is a member of EPSRC College and the UKRI FLF Panel College, and also reviews proposals for Italy’s Ministry of Education, Universities and Research (serving on REPRISE, the Register of Expert Peer-Reviewers for Italian Scientific Evaluation) and the Netherlands Organisation for Scientific Research: Domain Applied and Engineering Sciences. He is an active reviewer for a number of prestigious international journals, and serves on a number of TPCs for international conferences (e.g. Track Chair at DATE2023). He was a founder of the International Workshop on Energy Neutral Sensing Systems (ENSsys, co-located with the ACM SenSys conference), serving as General Chair from 2013-15, and on its steering/organisation committees since 2016. He is a member of the Editorial Board for MDPI Sensors, and previously served as an Associate Editor for IET Computers and Digital Techniques and IET Circuits, Devices and Systems. He has been guest editor for special issues on IoT and Big Data, Energy-Neutral IoT Devices, Wearable Smart Devices, and Electronics Education. He co-edited the IET book on Many Core Computing: Hardware and Software, containing 22 chapters contributed by leading international researchers. He currently leads a team of 10 PhD students, having previously graduated 25 PhD students and line-managed 25 research staff and 29 interns. The quality of his PhD students has been externally recognised, for example winning the University's 3 Minute Thesis competition in 2015, receiving Silver at SET for Britain 2015, receiving the Gold Medal at Malaysia's Innovation Technology Expo 2016-17, and winning the Best of Faculty award at the University's Festival of Doctoral Research 2019. He has been external examiner for 16 PhD theses, including students at Imperial College London, ETH Zurich, TU Delft, TU Dresden, Bologna, Newcastle, and York. *information correct as of March 2023 Research Research groups Member of: Cyber Physical Systems Centre for Internet of Things and Pervasive Systems Research interests Energy management of mobile/embedded systems Self-powered computing Internet of Things Current research Professor Merrett's research interests are in energy management of mobile/embedded systems and self-powered devices. He has published over 200 papers in these areas, with 4400 citations, an h-index of 34 and a g-index of 59*1. His papers have received Best Paper awards (IJCAI 2013, ICCES 2017, PECCS 2018) and were Best Paper finalists (DATE 2011/15/16, CODES-ISSS 2017, IEEE TCAD). He has given invited talks at leading workshops, conferences and research groups (e.g. DAC, DATE, Arm Research Summit, ETH Zurich). He is currently Deputy Director of a £1.4M EPSRC Platform Grant on Smart Cities (EP/P010164/1), and Southampton PI on the £1.2M EPSRC International Centre for Spatial Computational Learning (EP/S030069/1). He was previously a Theme Leader on the £5.6M EPSRC-funded PRiME Programme Grant (EP/K034448/1), Southampton PI on the £1.3M EPSRC ‘Graceful’ many-core computing project (EP/L000563/1), and a Co-I on both the EPSRC Holistic Energy Harvesting project (EP/G067740/1) and the EPSRC Energy Harvesting Network (EP/H013458/1). *information correct as of March 2023 Research projects Completed projects International Centre for Spatial Computational Learning Researchers: Professor Geoff Merrett Professor Sir Bashir Al-Hashimi , Professor Jonathon Hare Sponsor: EPSRC Wearable and Autonomous Computing for Future Smart Cities - Platform Grant Researchers: Professor Stephen Beeby Professor Sir Bashir Al-Hashimi , Professor Gopal Ramchurn , Professor Geoff Merrett , Professor Sebastian Stein , Doctor Alex Weddell Sponsor: EPSRC Energy Harvesting Network Researchers: Professor Stephen Beeby Professor Geoff Merrett Sponsor: EPSRC Next Generation Energy-Harvesting Electronics - holistic approach Researchers: Professor Sir Bashir Al-Hashimi Professor Neil White , Professor Stephen Beeby , Doctor Tomasz Kazmierski , Professor Geoff Merrett , Professor Koushik Maharatna Sponsor: EPSRC PRiME: Power-efficient, Reliable, Many-Core Embedded systems Researchers: Professor Sir Bashir Al-Hashimi Professor Michael Butler , Professor Geoff Merrett Sponsor: EPSRC Continuous on-line adaptation in many-core systems: From graceful degradation to graceful amelioration Researchers: Professor Sir Bashir Al-Hashimi Professor Geoff Merrett Sponsor: EPSRC SPHERE - A Sensor Platform for Healthcare in a Residential Environment Researchers: Professor Sir Bashir Al-Hashimi , Professor Stephen Beeby , Professor Geoff Merrett Sponsor: EPSRC Publications Enhancing state retention with energy-efficient memory tracing in intermittent systems Osama Bin Tariq, Theodoros D. Verykios, Geoff Merrett & Domenico Balsamo, 2025, IEEE Transactions on Sustainable Computing DOI: 10.1109/TSUSC.2025.3621509 Type: article FedTMOS: efficient one-shot federated learning with Tsetlin machine Shannon Shi Qi How, Jagmohan Chauhan, Geoff Merrett & Jonathon Hare, 2025 Type: conference FedTMOS: efficient One-Shot Federated Learning with Tsetlin Machine Shannon How Shi Qi, Jagmohan Chauhan, Geoff V. Merrett & Jonathon Hare, 2025 Type: conference Enabling efficient pure-NMOS circuits through Adiabatic Complementary Pass-transistor Logic Keyu Chen, Geoff Merrett & Mark Zwolinski, 2025 Type: conference Realisation of early-exit dynamic neural networks on reconfigurable hardware Anastasios Dimitriou, Lei Xun, Jonathon Hare & Geoff V. Merrett, 2024, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems DOI: 10.1109/TCAD.2024.3519055 Type: arti",
  "content_length": 35282,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:16"
}