{
  "name": "Geoffrey Holmes 0001",
  "homepage": "https://www.cms.waikato.ac.nz/people/geoff",
  "status": "success",
  "content": "Au Reikura | School of Computing & Mathematical Sciences :: University of Waikato Skip to main content Au Reikura | School of Computing & Mathematical Sciences Computing & Mathematical Sciences Home About us Research Outreach Our people Student Experience Nau mai ki te Au Reikura At Waikato, students studying computer science, design and data analytics are inspired by some of the sharpest minds, who are innovating and leading cutting-edge research on some of the most pressing challenges and exciting opportunities of our times. Undergraduate Postgraduate Computing & Mathematical Sciences Apply now Departments Computer Science and Software Engineering Our software engineering team are experts in crafting and maintaining top-quality software projects across diverse technologies. Based in the Computer Science Department at the University of Waikato, we merge innovative research with practical expertise. Design The study of Design comprises a well-balanced combination of analytical, technological and creative abilities. University of Waikato Bachelor of Design (BDes) graduates are trained to use a variety of skills to operate in a wide range of social contexts. Mathematics University of Waikato Mathematics and Data Analytics graduates are valued by employers for their strong analytical and high numeracy skills. With expertise in data collection and analysis, our graduates drive informed decision-making in organisations. Research Our research Find out more about the research groups in the School of Computing & Mathematical Sciences, including Cyber Security Researchers of Waikato (CROW) and the Design Research Group. Artificial Intelligence Institute Te Ipu o te Mahara, The Artificial Intelligence Institute at the University of Waikato takes an interdisciplinary and collaborative approach to the development of cutting-edge artificial intelligence (AI) research. Research groups in the School of Computing & Mathematical Sciences Find out more Meet some of our students 50 Year Anniversary In 2023 we proudly celebrated the founding of the Department of Computer Science in 1973 at the University of Waikato. 50 years of Computing News News A voice for the future: the first AI-generated Waikato-Maniapoto voice The model produces speech so realistic that it's difficult to distinguish from the original speaker News 18 Sep 2025 ShadowTech25 at Hiko Hub ignites tech futures for students The Hiko Hub at the University of Waikato hosted 25 bright young minds for ShadowTech25, offering a glimpse into the exciting possibilities of a future in technology. News 22 Aug 2025 Discovery lights the way for in-utero research innovation A new Waikato study lays the foundation for a brand-new field of science. News 28 Feb 2025 Robots were the spookiest this Halloween How robots are edging into spooky territory was profiled at the University's first-ever Nerdfest this Halloween. School of Computing & Mathematical Sciences 01 Nov 2024 News Upcoming events All events Official Uni Event Open Day – Tauranga Wednesday 01 Jul 2026 101-121 Durham Street, Tauranga Official Uni Event Hamilton Campus Community Open Day Saturday 18 Jul 2026 The Pā, Hamilton Campus All events Contact the School of Computing and Mathematical Sciences Physical Address School of Computing & Mathematical Sciences Ground Floor, FG-Block Gate 8, The University of Waikato, Hillcrest Road, Hamilton New Zealand +64 7 838 4322 stem@waikato.ac.nz Postal Address The University of Waikato Private Bag 3105, Hamilton 3240, New Zealand.",
  "content_length": 3525,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:15"
}