{
  "name": "Georgios Tzimpragos",
  "homepage": "https://www.georgetzimpragos.com",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationGeorge TzimpragosAssistant Professor, Electrical Engineering & Computer ScienceAssistant Professor (courtesy), Applied PhysicsUniversity of Wisconsin, MadisonUniversity of Michigan, Ann ArborContact: tzimpragos [at] wisc [dot] edu; gtzimpra [at] umich [dot] eduAbout.Starting in Winter 2025, I will be joining the Electrical and Computer Engineering Department at the University of Wisconsin-Madison. If you're interested in collaborating, please contact me at tzimpragos [at] wisc [dot] edu. Prospective Ph.D. candidates are encouraged to apply here.I am an Assistant Professor in the Electrical Engineering and Computer Science Department at the University of Michigan. My interests sit within the field of computer architecture, which I see as a bridge between disparate domains. For my latest updates, please take a look at my publications page and scholar profile.My current research activities are primarily guided by the following three questions:How can we improve logic density to overcome technology limitations and scaling slowdowns (e.g., in superconductor electronics, flexible electronics, and quantum computing)?How can biological systems inspire computing abstractions that leverage existing math and hardware for scalable, continuous learning (e.g., in electronic imaging, sensor processing, and robotics)?How can we bridge the semantic gap between computation and verification operators to enhance hardware security features and formally guarantee correctness? To this end, I follow a bottom-up approach and aim for cross-stack solutions that connect circuits, computational logic, microarchitecture, and programming languages. I am also excited to be at the forefront of innovation in hybrid quantum-classical computing through my participation in the Midwest Quantum Collaboratory and the IEEE IRDS committee on cryogenic electronics and quantum information processing.Before joining the University of Michigan, I received my Ph.D. in Computer Science from UC Santa Barbara. My dissertation was on the development, formalization, and deployment of a neuro-inspired temporal paradigm for in-sensor processing and superconducting computing. Before that, I obtained my Master's degree in Electrical and Computer Engineering from UC Davis. My alma mater is the National Technical University of Athens in Greece. Recruiting.I am actively looking for intellectually curious students. Please apply and reach out to me if interested!Some Awards.ACM SIGARCH & IEEE CS TCCA Outstanding Dissertation Award: Georgios Tzimpragos. Computing with temporal operators. 2023.ASC Best Student Paper Runner-Up: Jennifer Volk, Georgios Tzimpragos, Alex Wynn, Evan Golden, Timothy Sherwood. Low-cost superconducting fan-out with cell Ic ranking.  Applied Superconductivity Conference. 2022.UCSB Outstanding Dissertation Award: Georgios Tzimpragos. Computing with temporal operators. UC Santa Barbara, Dept. of Computer Science. 2022.IEEE Micro Top Picks Honorable Mention: Georgios Tzimpragos,  Jennifer Volk, Alex Wynn, James E. Smith, Timothy Sherwood. Superconducting computing with alternating logic elements.  IEEE Micro: Micro's Top Picks from Computer Architecture Conferences. 2022. CACM Research Highlights: Georgios Tzimpragos, Advait Madhavan, Dilip Vasudevan, Dmitri Strukov, Timothy Sherwood. In-sensor classification with boosted race trees. Communications of the ACM. 2021.IEEE Micro Top Picks: Georgios Tzimpragos, Jennifer Volk, Dilip Vasudevan, Nestan Tsiskaridze, George Michelogiannakis, Advait Madhavan, John Shalf, Timothy Sherwood. Temporal computing with superconductor electronics. IEEE Micro: Micro's Top Picks from Computer Architecture Conferences. 2021.ASPLOS Best Paper Award: Georgios Tzimpragos, Advait Madhavan, Dilip Vasudevan, Dmitri Strukov, Timothy Sherwood. Boosted race trees for low-energy classification. ACM International Conference on Architectural Support for Programming Languages and Operating Systems. 2019.Teaching.UW ECE 554, Digital Engineering Laboratory. [S25]UM EECS 270, Introduction to Logic Design. [F22, W23, W24]UM EECS 498/598, Quantum Computing Systems & Architectures. [F23, F24]Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4258,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:52"
}