{
  "name": "George Candea",
  "homepage": "http://dslab.epfl.ch/people/candea",
  "status": "success",
  "content": "George Candea - Dependable Systems Lab George Candea Professor of Computer Science EPFL - IC - DSLAB Room INN-330, Station 14 1015 Lausanne, Switzerland george.candea@epfl.ch Bio George Candea heads the Dependable Systems Lab, where he conducts research on the principles and practice of achieving predictable performance and energy efficiency in computer systems. His main focus is on real-world systems – both large- and small-scale – that face fundamental challenges lying beyond the reach of classic techniques. In the recent past, George also served as CEO and later Chief Scientist of Cyberhaven, a cybersecurity company he co-founded in 2016 with four of his PhD students. Earlier, he was CTO and then Chief Scientist of Aster Data Systems (now Teradata Vantage), a big-data company he co-founded in 2005 with two Stanford colleagues. Before that, he held positions at Oracle, Microsoft Research, and IBM Research. George is a recipient of the Mark Weiser Award (2025), the inaugural Eurosys Jochen Liedtke Young Researcher Award (2014), the MIT TR35 Young Innovators award (2005), and several Best Paper awards. He received an ERC Grant in 2011. He holds a Ph.D. in Computer Science (2005) from Stanford University and a B.S. (1997) and M.Eng. (1998) in Electrical Engineering and Computer Science from MIT. Publications See DSLAB’s publications page Teaching See DSLAB’s teaching page Service Program committee (co)chair: EuroSys 2019, HotOS 2015, DSN-DCCS 2013 Program committee member: SOSP (multiple years), OSDI (multiple years), ASPLOS (2010), EuroSys (multiple years), USENIX (multiple years), CIDR (2013), SOCC (2012), DSN (multiple years), HotOS (multiple years). Vice-chair of ACM SIGOPS (2011-2015) Eurosys Jochen Liedtke Young Researcher Award: committee chair (2019), committee member (2018) EPFL Innovation Council (2017-2021) EPFL Innogrant committee (2018-2022) School of Computer & Communication Sciences Faculty Recruiting & Growth (Chair) Faculty Search Chair/Co-chair (2018-2023) Member (2017-2018, 2014, 2013) Ph.D. Program Committee EDIC member (2017-2020) IC Research Day co-chair (2018) Miscellaneous The following are outdated, but perhaps still useful: How to write a research statement when applying to graduate school [html] How to write a reference letter supporting a candidate [html] FAQ about our PhD program [html] Switzerland has a high intellectual density: #1 worldwide in WEF’s Global Competitiveness Index for several years in a row #1 worldwide in the Global Innovation Index for several years in a row #1 worldwide in INSEAD’s Global Talent Competitiveness Index (i.e., ability to attract and incubate talent) #1 worldwide in Nobel prizes per capita #1 worldwide in patents per capita Some notes on what makes Switzerland special [html] What gets people excited about Switzerland Lausanne area: 127,821 residents (as of 2010-2011) of which 40% foreign nationals (more info)",
  "content_length": 2921,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:24"
}