{
  "name": "George Karakostas",
  "homepage": "http://www.cas.mcmaster.ca/~gk",
  "status": "success",
  "content": "George Karakostas's Homepage George Karakostas' Homepage Contact info: Office:  Dept. of Computing & Software, Rm. ITB/218 McMaster University 1280 Main St. West Hamilton, Ontario L8S 4K1 Canada Tel (work) : 905-525-9140 Ext. 26132 Fax (work) : 905-524-0340 e-mail : karakos@mcmaster.ca Academic Degrees Ph.D in Computer Science, Princeton University, 2000 MA in Computer Science, Princeton University, 1997 Diploma in Computer Engineering & Informatics, University of Patras, 1995 Reasearch Reasearch supported by Member of a MITACS project on Game-theoretical study of large data and communication networks. Publications Approximation schemes for Minimum Latency Problems  S. Arora, G. Karakostas, Proceedings ACM STOC 1999 A 2+epsilon approximation algorithm for the k-MST problem S. Arora, G. Karakostas, Proceedings ACM-SIAM SODA 2000 On the complexity of the intersection of FSA's  G. Karakostas, R.J. Lipton, A. Viglas, Proceedings IEEE Complexity 2000 Effective caching of web objects using Zipf's laws  D. Serpanos, G. Karakostas, W.H.Wolf, Proceedings IEEE ICME 2000 Practical LFU implementation for web caching  G. Karakostas, D. Serpanos, Technical Report CS Princeton Univ. TR-622 Results on Approximation Algorithms Ph.D. Thesis  (Advisor: Sanjeev Arora), Princeton University, November 2000 Faster approximation schemes for fractional multicommodity flow problems G. Karakostas, Proceedings ACM/SIAM SODA 2002. A more complete (journal) version can be found here. Practical issues and algorithms for analyzing terrorist networks T. Carpenter, G. Karakostas, D. Shallcross, Invited paper at WMC 2002 Exploitation of different types of locality for web caches  G. Karakostas, D. N. Serpanos, Proceedings IEEE ISCC 2002 A proof for effective and efficient web caching  D. N. Serpanos, G. Karakostas, IEE Electronics Letters, 38(10), pp. 490-492, 2002 Equilibria for networks with malicious users  G. Karakostas, A. Viglas, Proceedings ISAAC 2003 Selfish routing in the presence of side constraints  G. Karakostas, S. Kolliopoulos, Tech. report CAS-03-13-GK, Dept. of CAS, McMaster Un., 2003 General pseudo-random generators from weaker models of computation G. Karakostas, Tech. report CAS-03-16-GK, Dept. of CAS, McMaster Un., 2003 and Proceedings ISAAC 2009 The efficiency of optimal taxes, G. Karakostas, S. Kolliopoulos, Proceedings CAAN 2004 Edge pricing of multicommodity networks for heterogeneous users, G. Karakostas, S. Kolliopoulos, Proceedings IEEE FOCS 2004 A better approximation ratio for the Vertex Cover problem, G. Karakostas, Proceedings ICALP 2005 (Preliminary version appeared as ECCC Report TR04-084 and AdvOL Report #2004/13, September/October 2004) Maximizing throughput in queueing networks with limited flexibility, D. Down, G. Karakostas, Proceedings LATIN 2006 (earlier version presented in MAPSP'05). Edge pricing of multicommodity networks for selfish users with elastic demands, G. Karakostas, S. Kolliopoulos, Proceedings COCOON 2006. Selfish routing with oblivious users, G. Karakostas, T. Kim, A. Viglas, H. Xia, Proceedings SIROCCO 2007. Stackelberg strategies for selfish routing in general multicommodity networks, G. Karakostas, S. Kolliopoulos, Algorithmica 2007. Emergency connectivity in ad-hoc networks with selfish nodes, G. Karakostas, E. Markou, Proceedings LATIN 2008. An FPTAS for the minimum total weighted tardiness problem with a fixed number of distinct due dates, G. Karakostas, S. Kolliopoulos, J. Wang, Proceedings COCOON 2009 (also in MAPSP'09). On the existence of optimal taxes for network congestion games with heterogeneous users, D. Fotakis, G. Karakostas, S. Kolliopoulos, Proceedings SAGT 2010 (also in EURO XXIV). Analysis of a Forwarding Game without Payments, G. Karakostas, A. Viglas, Proceedings PDCAT 2012. On derandomization and average-case complexity of monotone functions, G. Karakostas, J. Kinne, D. van Malkebeek, TCS vol. 434, 2012. Dynamics of a localized reputation-based network protocol, G. Karakostas, R. Kharaud, A. Viglas, Proceedings PDCAT 2013. Social Exchange Networks with Distant Bargaining, K. Georgiou, G. Karakostas, J. Konemann, Z. Stamirowska, Proceedings COCOON 2013. Using Reputation Instead of Tolls in Repeated Selfish Routing with Incomplete Information, K. Hu, J. Huang, G. Karakostas, Proceedings SAGT 2013. Scheduling in green vehicular infrastructure with multiple roadside units, A. Khezrian, A. Hammad, T. Todd, G. Karakostas, Proceedings ICC 2013. On/off sleep scheduling in energy efficient vehicular roadside infrastructure, S. Mostofi, A. Hammad, T. Todd, G. Karakostas, Proceedings ICC 2013. Downlink Traffic Scheduling in Green Vehicular Roadside Infrastructure, A. Hammad, T. Todd, G. Karakostas, D. Zhao, IEEE T. Vehicular Technology 62(3), 2013. Energy provisioning and operating costs in hybrid solar-powered infrastructure, M. S. Zefreh, T. Todd, G. Karakostas, IEEE T. Sustainable Energy 5(3), 2014. Equilibrium Flows and Path Dilation for a Network Forwarding Game, G. Karakostas, A. Viglas, J. of Internet Technology 15(1), 2014. Social Exchange Networks with Distant Bargaining, K. Georgiou, G. Karakostas, J. Konemann, Z. Stamirowska, TCS, vol. 554, 2014. Energy Efficient Offloading for Competing Users on a Shared Communication Channel, E. Meskar, T. Todd, D. Zhao, G. Karakostas, Proceedings ICC 2015. Know When to Persist: Deriving Value from a Stream Buffer, K. Georgiou, G. Karakostas, E. Kranakis, D. Krizanc, Proceedings AAIM 2016. Search-and-Fetch with One Robot on a Disk, K. Georgiou, G. Karakostas, E. Kranakis, Proceedings ALGOSENSORS 2016. Variable Bit Rate Transmission Schedule Generation in Green Vehicular Roadside Units A. Hammad, T. Todd, G. Karakostas, IEEE T. Vehicular Technology 65(3), 2016. Vehicle-to-Vehicle Forwarding in Green Roadside Infrastructure, M. Azimifar, T. D. Todd, A. Khezrian, G. Karakostas, IEEE T. Vehicular Technology 65(2), 2016. Energy Aware Offloading for Competing Users on a Shared Communication Channel, E. Meskar, T. D. Todd, D. Zhao, G. Karakostas, IEEE T. Mob. Comput. 16(1), 2017. Combining Capital and Operating Expenditure Costs in Vehicular Roadside Unit Placement, N. Nikookaran, G. Karakostas, T. D. Todd, IEEE T. Vehicular Technology 66(8), 2017. Capacity Augmentation in Energy Efficient Vehicular Roadside Infrastructure, N. Nikookaran, T. D. Todd, G. Karakostas, Proceedings IEEE UEMCON 2017. The Effect of Vehicle Route Uncertainty in Green Roadside Communication, N. Nikookaran, T. D. Todd, S. Zhang, G. Karakostas, Proceedings IEEE WCNC 2018. Secure and Trusted Partial Grey-Box Verification, Y. Cai, G. Karakostas, A. Wassyng, International Journal of Information Security, 2019. Optimal Mobile Computation Offloading With Hard Deadline Constraints, A. Hekmati, P. Teymoori, T. D. Todd, D. Zhao, G. Karakostas, IEEE T. Mob. Comput., 2019. Optimal Multi-Decision Mobile Computation Offloading With Hard Task Deadlines, A. Hekmati, P. Teymoori, T. D. Todd, D. Zhao, G. Karakostas, Proceedings IEEE ISCC 2019. Search-and-Fetch with 2 Robots on a Disk: Wireless and Face-to-Face Communication Models K. Georgiou, G. Karakostas, E. Kranakis. Discrete Mathematics & Theoretical Computer Science, Vol. 21(3), 2019. Optimal Multi-Part Mobile Computation Offloading With Hard Deadline Constraints, A. Hekmati, P. Teymoori, T. D. Todd, D. Zhao, G. Karakostas. Comput. Commun. 160: 614-622, 2020. Efficient Mobile Computation Offloading with Hard Task Deadlines and Concurrent Local Execution, P. Teymoori, T. D. Todd, D. Zhao, G. Karakostas, Proceedings GLOBECOM 2020. Preemptive Mobile Computation Offloading with Hard Deadlines and Concurrent Local Execution, P. Teymoori, A. Hekmati, T. D. Todd, D. Zhao, G. Karakostas, IEEE Trans. Green Commun. Netw. 5(2): 950-963, 2021. Treasure Evacuation with One Robot on a Disk, K. Georgiou, G. Karakostas, E. Kranakis. Theor. Comput. Sci. 852: 18-28, 2021. Single-item lot-sizing with quantity discount and bounded inventory, D. G. Down, G. Karakostas, S. G. Kolliopoulos, S. Rostami, Oper. Res. Lett. 49(6): 877-882, 2021. Joint Wireless and Service Allocation for Mobile Computation Offloading with Job Completion Time and Cost Constraints, H. Chen, T. D. Todd, D. Zhao, G. Karakostas, WCNC 2022. Resource time-sharing for IoT applications with deadlines, G. Karakostas, S. G. Kolliopoulos. ALGOSENSORS 2022. Digital Twins from a Networking Perspective, M. Vaezi, K. Noroozi, T. D. Todd, D. Zhao, G. Karakostas, H. Wu, X. Shen. IEEE Internet of Things Journal, 2022. Digital Twin Placement for Minimum Application Request Delay with Data Age Targets, M. Vaezi, K. Noroozi, T. D. Todd, D. Zhao, G. Karakostas. IEEE Internet of Things Journal, 2023. Approximation Algorithms for Maximum Weighted Throughput on Unrelated Machines, G. Karakostas, S.G. Kolliopoulos. APPROX/RANDOM 2023, pp. 5:1-5:17, 2023. Thermal-aware Workload Distribution for Data Centers with Demand Variations, S. Rostami, D. G. Down, G. Karakostas. IGSC 2023 pp. 63-66, 2023. Digital Twin Model Selection for Feature Accuracy in Wireless Edge Networks, H. Chen, T. D. Todd, D. Zhao, G. Karakostas. PIMRC 2023, pp. 1-6, 2023. Wireless and Service Allocation for Mobile Computation Offloading With Task Deadlines, H. Chen, T. D. Todd, D. Zhao, G. Karakostas. IEEE Trans. Mob. Comput. 23(5), pp. 5054-5068, 2024. Digital Twin Model Selection for Feature Accuracy, H. Chen, T. D. Todd, D. Zhao, G. Karakostas. IEEE Internet Things J. 11(7), pp. 11415-11426, 2024. Task Class Partitioning for Mobile Computation Offloading, H. Chen, T. D. Todd, D. Zhao, G. Karakostas. IEEE Internet Things J. 11(2), pp. 2534-2549, 2024. Time-sharing scheduling with tolerance capacities, G. Karakostas, S.G. Kolliopoulos.J. Comput. Syst. Sci. 148, 2025. Courses CS 3MG3  Fall 2002, 2003, 2004, 2005, 2006 CS 2CA3  Winter 2008, Fall 2008, 2010 CS 2GA3  Fall 2011,  2012 CS 3SH3   Winter 2012 SE 2C03   Winter 2013, 2014, 2015, 2016, 2018, 2019, 2020, 2021, 2022 CS 2C03  Fall 2024 CS 1XA3  Winter 2014, 2015, 2016 CS 3A",
  "content_length": 10397,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:32"
}