{
  "name": "Georgi Nedeltchev Gaydadjiev",
  "homepage": "https://www.rug.nl/staff/g.gaydadjiev/?lang=en",
  "status": "success",
  "content": "prof. dr. ir. G.N. (Georgi) Gaydadjiev | How to find us | University of Groningen Javascript must be enabled for the correct page display Skip to ContentSkip to Navigation About us Practical matters How to find us prof. dr. ir. G.N. (Georgi) Gaydadjiev prof. dr. ir. G.N. (Georgi) Gaydadjiev Professor in Innovative Computer Architecture Faculty of Science and Engineering Telephone: +31 50 36 35106 E-mail: g.gaydadjiev rug.nl Homepage ORCID Research Portal Field/Discipline Computer Science, Hardware & Architecture Engineering, Electrical & Electronic Computer Science, Information Systems Expertise I am a Computer Engineer with more than 35 years of experience in the Industry and Academia. I helped the development of a wide-range of computing systems from tiny implantable devices up to supercomputers. All the above systems were designed to solve real problems. Other positions Chair Professor in Computer Architecture at Computer Engineering, QCE Department, EEMCS, TU Delft Honorary Visiting Professor at the Department of Computing, Imperial College London Senior Advisor of: Maxeler Technologies (US, UK and the Netherlands) and BitWise (UK/Scotland) Steering Committee member of: the IEEE International Conference on Computer Design (ICCD), and the International Conference on Embedded Computer Systems: Architectures, Modeling and Simulation (SAMOS) Last modified:04 June 2025 07.45 a.m. Contact information Faculty of Science and Engineering Innovative Computer Architecture — Bernoulli Institute Nijenborgh 9 9747 AG Groningen The Netherlands Georgi Gaydadjiev Nijenborgh 9 9747 AG Groningen Room: 0492 Telephone: +31 50 36 35106 Follow the UGfacebook linkedin rss instagram youtube Functional Provides basic functions and uses anonymized cookies. Standard Provides optimal operation and uses video cookies, among others. Complete Provides personalized content and uses marketing cookies. Set your cookie preferences. Read our privacy and cookie disclaimer for more information.",
  "content_length": 1994,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:46"
}