{
  "name": "Georgios Portokalidis",
  "homepage": "https://www.portokalidis.net",
  "status": "success",
  "content": "Georgios Portokalidis - Computer Science - Stevens Institute of Technology Home I am an Associate Research Professor at IMDEA Software Institute. I am also a Visiting Research Professor in the Department of Computer Science at Stevens Institute of Technology. I obtained my PhD in Computer Science from Vrije Universiteit Amsterdam on February 2010 and then moved to work as a postdoctoral researcher at Columbia University. I also hold an MSc and BSc in Computer Science from Leiden University and University of Crete, respectively. My research interests are mainly around the area of software systems and security. Specifically, I'm interested in securing systems software (e.g., C/C++ programs) against exploitation, binary analysis and reverse engineering, transitioning to the Rust programming language, software containerization, and operating systems security. In the past, I have also worked on honeypots, taint analysis, control-flow integrity, offensive security, and user authentication. For more information check out my CV and my Google Scholar Profile. If you are a strong programmer, security-minded, and love operating systems, I'm looking for students and researchers to join my research group, MadriSec. The IMDEA Software Institute is one of the top institutes for computer security research in Europe! More info under openings. Contact georgios domain name IMDEA Software Institute Campus Montegancedo s/n 28223 Pozuelo de Alarcon, Madrid SPAIN Announcements April '25 IMDEA Software has been designated as a María de Maeztu Unit of Excellence in Research and awarded a funding package of €3M. February '25 Our paper \"rustc++: Facilitating Advanced Analysis of Rust Code\" is to appear in EUROSEC 2025. September '24 Our paper \"SIDECAR: Leveraging Debugging Extensions in Commodity Processors to Secure Software\" is to appear in ACSAC 2024! September '24 Our paper \"Evaluating the Effect of Improved Indirect Call Resolution on System Call Debloating\" is to appear in FEAST 2024 (co-located with CCS). September '23 I am thrilled to announce that I have taken on the role of Associate Research Professor at IMDEA Software Institute. September '23 Our paper \"SysPart: Automated Temporal System Call Filtering for Binaries\" is to appear in CCS 2023. May '23 Our paper \"Eliminating Vulnerabilities by Disabling Unwanted Functionality in Binary Programs\" is to appear in ASIACCS 2023. Research Highlights Selected Publications SysPart: Automated Temporal System Call Filtering for Binaries Vidya Lakshmi Rajagopalan, Konstantinos Kleftogiorgos, Enes Göktaş, Jun Xu, and Georgios Portokalidis To appear in Proceedings of the ACM Conference on Computer and Communications Security (CCS), Copenhagen, Denmark, November 2023 (19.9%) Eliminating Vulnerabilities by Disabling Unwanted Functionality in Binary Programs Mohamad Mansouri, Jun Xu, and Georgios Portokalidis Proceedings of the ACM ASIA Conference on Computer and Communications Security (ASIACCS), Melbourne, Australia, July 2023 Building Embedded Systems Like It’s 1996 Ruotong Yu, Francesca Del Nin, Yuchen Zhang, Shan Huang, Pallavi Kaliyar, Sarah Zatko, Mauro Conti, Georgios Portokalidis, and Jun Xu Proceedings of the Network and Distributed System Security Symposium (NDSS), San Diego, CA, USA, April 2022 (16.2%) Towards Understanding the Performance of Rust (Short paper) Yuchen Zhang, Yunhang Zhang, Georgios Portokalidis, and Jun Xu Proceedings of the International Conference on Automated Software Engineering (ASE) – Industry Showcase, Oakland Center, MI, USA, October 2022 Towards Optimal Use of Exception Handling Information for Function Detection Chengbin Pang, Ruotong Yu, Dongpeng Xu, Eric Koskinen, Georgios Portokalidis, and Jun Xu Proceedings of the IEEE/IFIP International Conference on Dependable Systems and Networks (DSN), Virtual, June 2021 (16.3%) Techu: Open and Privacy-preserving Crowdsourced GPS for the Masses Ioannis Agadakos, Jason Polakis, and Georgios Portokalidis Proceedings of the ACM International Conference on Mobile Systems, Applications, and Services (MobiSys), Niagara Falls, NY, USA, June 2017 (18%) Speculative Memory Checkpointing Dirk Vogt, Armando Miraglia, Georgios Portokalidis, Herbert Bos, Andy Tanenbaum, and Cristiano Giuffrida Proceedings of the ACM/IFIP/USENIX Middleware Conference, Vancouver, Canada, December 2015 Adaptive Defenses for Commodity Software through Virtual Application Partitioning Dimitris Geneiatakis, Georgios Portokalidis, Vasileios P. Kemerlis, and Angelos D. Keromytis Proceedings of the ACM Conference on Computer and Communications Security (CCS), Raleigh, NC, USA, October 2012 (18.9%) Selected Grands and Awards IMDEA Software, María de Maeztu Unit of Excellence in Research, MICIU/AEI Spain, €3M PI, \"Effective Software Monitoring Leveraging Hardware Debugging Extensions\", DARPA YFA, $492,490, August 2021 - July 2023 PI (lead), \"ABIDES: Adaptive BInary Debloating and Security\", ONR, $3,243,244, September 2017 - August 2022 PI, \"Adapting Static and Dynamic Program Analysis to Effectively Harden Debloated Software\" ONR, $467,543, March 2016 - December 2020 PhD Students Current Risto Kivilahti (November 2024 - present) Vidya Lakshmi Rajagopalan (January 2019 - present) Graduated Konstantinos Kleftogiorgos (September 2018 - July 2025) Ruotong Yu (September 2020 - March 2024) Yuchen Zhang (September 2019 - May 2023) Yifan Wang (September 2019 - December 2022) Ioannis Agadakos (January 2015 - December 2018) Postdocs/Researchers Past Enes Goktas (May 2019 - August 2021) Dimitrios Damopoulos (2013 - 2015) Interns Current Mathieu Michel (April 2025 - present) Rupesh Punna (February 2025 - present) Past Fatih Durmaz (April 2024 - March 2025)",
  "content_length": 5719,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:52"
}