{
  "name": "George Vassilacopoulos",
  "homepage": "https://www.ds.unipi.gr/en/faculty/gvass-en",
  "status": "success",
  "content": "George Vassilacopoulos - Department of Digital Systems Skip to content George Vassilacopoulos Phone Email gvass@unipi.gr Title Professor Office Hours Office - Courses Brief CV George Vassilacopoulos received his PhD from the University of London. He is currently Professor in the Department of Digital Systems; Director of the “Health Informatics laboratory”; Director of the Post-graduate Programme “Digital Systems and Services” and Director of the International Certificate Programme in “Health Informatics” at the University of Piraeus, Greece, where he served as Chairman of the Department of Digital Systems for over ten years, and served the university administration as Vice Rector of Academic Affairs. He is currently Deputy President of the University of Piraeus Council. He has worked in both the private and public sectors in various administrative and advisory capacities. He has served as Health Informatics advisor to the Greek Ministry of Health, as a member of the board of several large Greek hospitals, as advisor of informatics to the National Emergency Medical Service of Greece and as member of various informatics committees in the public and private sectors. He has participated in several national and EU-funded research and development projects, mainly in the area of health informatics. He has authored many publications in peer-reviewed international journals, has written four books and several book chapters and has taken part either as a contributor or committee member in numerous conferences and workshops. He has also served as editor or associate editor for several published conference proceedings and books. His research interests include electronic patient records, healthcare workflow systems, service-oriented healthcare systems and healthcare systems security. He is a Fellow of the British Computer Society. Publications Publications Publications 2010 – 2015 I) JOURNALS Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: ‘Specifying process requirements for holistic care’. Informatics for Health and Social Care, 1-11, 2013. Botsivaly M, Malamateniou F, Vassilacopoulos G and Macris A: “Development of se-mantically annotated web services using a CDA-based discharge summaries’ ontology”, Computers in Human Behaviour, (accepted for publication). Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: ‘E-EPR: A workflow-based electronic emergency patient record to support holistic care management’, Personal and Ubiquitous Computing Journal, pp.1-10, November 25, 2012. Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: ‘Emergency Healthcare Process Automation Using Mobile Computing and Cloud Services’, Journal of Medical Systems, 36(5):3233-41, 2012. Koufi V, Malamateniou F and Vassilacopoulos G: “A System for the Provision of Medical Diagnostic and Treatment Advice in a Home Care Environment”, Personal and Ubiquitous Computing Journal, Vol. 14, No. 6, pp. 551-561, September, 2010. Koufi V, Malamateniou F and Vassilacopoulos G: “An Approach to Participative Personal Health Record System Development”, International Journal of Healthcare Delivery Reform Initiatives, Vol. 2, No. 4, pp.1-16, 2010. Koufi V, Malamateniou F and Vassilacopoulos G: “A System for the Provision of Medical Diagnostic and Treatment Advice in a Home Care Environment”, Personal and Ubiquitous Computing Journal, 14(6), 551-561, 2010. Papakonstantinou D, Malamateniou F and Vassilacopoulos G: “An electronic Medical Record using Service Oriented Architecture”, International Journal of Applied Systemic Studies, 3(3), 343-352, 2010. Koufi V, Malamateniou F and Vassilacopoulos G: “An Approach to Participative Personal Health Record System Development”, International Journal of Healthcare Delivery Reform Initiatives (IJHDRI), 2(4), 1-16, 2010. II) CONFERENCES Koufi V, Malamateniou F, and Vassilacopoulos G: “A Big Data-driven Model for the Optimization of Healthcare Processes”. In Proceedings of the 26th International Conference of the European Federation for Medical Informatics, (MIE’ 2015) – “Digital Healthcare Empowering Europeans”, Madrid (Spain), May 27th – 29th, 2015. Poulymenopoulou M, Papakonstantinou D, Malamateniou F and Vassilacopoulos G: “A health analytics semantic ETL service for obesity surveillance”. In Proceedings of the 26th International Conference of the European Federation for Medical Informatics, (MIE’ 2015) –”Digital Healthcare Empowering Europeans”, Madrid (Spain), May 27th – 29th, 2015. Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: “A LOD-based service for extracting Linked Open Emergency Care Data”. In Proceedings of the 3rd International Work Conference on Bioinformatics and Biomedical Engineering, (IWBBIO’ 2015), Granada (Spain), April 15th – 17th, 2015. Koufi V, Malamateniou F and Vassilacopoulos G: “Privacy preserving mobile access to personal health records through Google’s Android”. In Proceedings of the 4th International Conference on Wireless Mobile Communication and Healthcare –”Transforming healthcare through innovations in mobile and wireless technologies”, MobiHealth 2014, Athens, Greece, November 3 – 5, 2014. Poulymenopoulou M, Papakonstantinou D, Malamateniou F and Vassilacopoulos G: “PINCLOUD II: An enhanced cloud-based PHR service with healthcare analytics”. In Proceedings of the European, Mediterranean & Middle Eastern Conference on Information Systems 2014, EMCIS2014, Doha, Qatar, October 27 – 28, 2014. Koufi V, Malamateniou F, Tsochou A and Vassilacopoulos G: “A framework for privacy-preserving access to next-generation EHRs”. In Proceedings of the 25th International Conference of the European Federation for Medical Informatics, (MIE’2014), Istanbul, August 31st – September 3rd, 2014. Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: “Machine Learning for knowledge Extraction from PHR Big Data”, ICIMTH 2014, Athens, July 5-7 2014. Koufi V, Malamateniou F and Vassilacopoulos G: “Knowledge discovery from electronic emergency patient records using machine learning techniques”. In Proceedings of the ICIMTH 2014, Athens, July 5-7, 2014. Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: “A virtual PHR authorization system”, International Conference on Biomedical and Health Informatics (IEEE BHI’14), Valencia, Spain, June 1-4, 2014. Poulymenopoulou M, Papakonstantinou D, Malamateniou F, Prentza A and Vassilacopoulos G: “A conceptual security framework for personal health records (PHRs)”. In Proceedings of the ICIMTH 2013, Athens, July 5-7, 2013. Maglogiannis I, Delibasis K, Goudas T, Prentza A, Malamateniou F and Vassilacopoulos G: “Video Segmentation of Moving Humans for Assistive Environments”. In Proceedings of the ICIMTH 2013, Athens, July 5-7, 2013. Koufi V, Malamateniou F, Vassilacopoulos G and Prentza A: “An Android-Enabled Mo-bile Framework for ubiquitous access to cloud emergency medical services”. In Pro-ceedings of the IEEE 2nd Symposium on Network Cloud Computing and Applications (IEEE NCCA 2012), London, UK, December 3-5, 2012. Doukas C, Maglogiannis I, Koufi V, Malamateniou F and Vassilacopoulos G:  “Enabling Data Protection through PKI encryption in IoT m-Health Devices”. In Proceedings of the IEEE 12th International Conference on BioInformatics and BioEngineering (BIBE 2012), Larnaka, Cyprus, November 11-13, 2012. Koufi V, Malamateniou F and Vassilacopoulos G: “An Android-Enabled Mobile Frame-work for Ensuring Quality of Life through Patient-Centric Care”, In Proceedings of the 24rd International Conference of the European Federation for Medical Informatics, MIE 2012, Pisa, Italy, 26-29 August, Studies in Health Technology and Informatics, pp. 1040-1044, 2012. Papakonstantinou D, Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: “Towards a mLearning training solution to the adoption of a CPOE system”, In Proceedings of the 24rd International Conference of the European Federation for Medical Informatics, MIE 2012, Pisa, Italy, 26-29 August, Studies in Health Technology and Informatics, pp. 973-977, 2012. Poulymenopoulou M, Papakonstantinou D, Malamateniou F and Vassilacopoulos G: “Using a patient-centered approach for health and social care integration”, In Proceedings of the 24rd International Conference of the European Federation for Medical Informatics, MIE 2012, Pisa, Italy, 26-29 August, Studies in Health Technology and Informatics, pp. 467-471, 2012. Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: “Specifying workflow   requirements for holistic care”. In Proceedings of the International eHealth, Telemedi-cine and Health ICT Forum, Med-e-tel 2012, Luxemburg, April 18-20, 2012. Papakonstantinou D, Malamateniou F and Vassilacopoulos G: “Towards an embedded semantic wiki for user training in an ePrescribing service”. In Proceedings of the 1st International Conference on Medical Education Informatics, MEI 2012, Thessaloniki, Greece, 6-7 April, 2012. Poulymenopoulou M, Papakonstantinou D, Malamateniou F and Vassilacopoulos G: “Enhancing patient information sharing through social networks”. In Proceedings of the International Conference on Health Informatics, HEALTHINF 2012, Vilamoura, Algarve, Portugal), February 1-4, 2012. Papakonstantinou D, Malamateniou F and Vassilacopoulos G: “Embedding on-line training in an e-prescribing service”, In Proceedings of the International Conference on Knowledge Management and Information Sharing, KMIS 2011, Paris, France, October 26-29, 2011. Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: “An Access Control Framework for Pervasive Mobile Healthcare Systems Utilizing Cloud Services”, In Pro-ceedings of the International ICST Conference on Wireless Mobile Communication and Healthcare, MobiHealth 2011, Kos, Greece, October 5-7, 2011. Papakonstantinou D, Poulymenopoulou M, Malamateniou F and Vassilacopoulos G: “A cloud-based semantic wiki for user training in healthcare process management”, In Proceedings of the 23rd International Conference of the European Federation for Medical Informatics, MIE 20",
  "content_length": 18144,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:46"
}