{
  "name": "George N. Rouskas",
  "homepage": "http://rouskas.csc.ncsu.edu",
  "status": "success",
  "content": "Dr. George N. Rouskas Skip to main content About “Γνωθι Σαυτον (Know thyself)”Ancient Greek aphorism Biography Full CV I am Alumni Distinguished Graduate Professor with the Department of Computer Science at North Carolina State University, and the Interim Department Head in 2025-26. I served as Director of Graduate Programs for the department from January 2014 to June 2024. I received an undergraduate degree in Computer Engineering from the National Technical University of Athens, and MS and PhD degrees in Computer Science from the Georgia Institute of Technology. During the 2000-2001 academic year, I spent a sabbatical term at Vitesse Semiconductor, Morrisville, NC. I have been an invited Professor at King Abdulaziz University, Saudi Arabia, Paris VI University, France, and University of Evry, France, on several occasions. My research interests are in the broad field of computer networking — specifically, optical networks, Internet architectures and protocols, network design and optimization, performance modeling, and scheduling. My research has received funding from federal and defense agencies as well as industry. As of 2020, 25 PhD students and 12 Masters thesis students have graduated under my supervision. I am author of the monograph “Internet Tiered Services: Theory, Economics and Quality of Service” (Springer, 2009), co-editor of the book “Next-Generation Internet: Architectures and Protocols” (Cambridge University Press, 2011), and co-editor of the book “Traffic Grooming for Optical Networks: Foundations, Techniques and Frontiers” (Springer, 2008). I have served the research community in multiple roles. I was the founding Editor-in-Chief of IEEE Networking Letters from 2018-2021 and served as Steering Committee Member of the OFC conference from 2017-2023. I co-founded and served as co-Editor-in Chief of the Elsevier journal Optical Switching and Networking from 2004-2017. In 2016-17 I served as Chair of the IEEE Communications Society Distinguished Lecturer Selection Committee, as Chair of the Optical Networking Technical Committee (ONTC), and as Vice-Chair of the IEEE Communications Society Technical and Educational Activities Council. As an IEEE Distinguished Lecturer in 2010-2011, I completed four tours in the US, Caribbean, and Sri Lanka. I was the TPC or General chair for: IEEE LATINCOM 2024, ICCCN 2022, DRCN 2022, IEEE MeditCom 2021, ICCCN 2021,IEEE MASS 2018, IEEE ICC ONS 2017, IEEE ICNP 2014, ICCCN 2013 and 2011, IEEE GLOBECOM ONS 2010, BROADNETS 2007, IEEE LANMAN 2005 and 2004, and IFIP NETWORKING 2004. My awards include an IEEE ONTC Outstanding Service Award (2019), an IEEE GLOBECOM Outstanding Service Award (2010), an IBM Faculty Partnership Award (2007), an ALCOA Foundation Engineering Research Achievement Award (2004, NC State College of Engineering), an Alumni Outstanding Research Award (2003, NC State), an NSF CAREER Award (1997), an Outstanding New Teacher Award (1995, NC State Department of Computer Science). I was inducted in the NC State University Academy of Outstanding Teachers in 2004. I was elected Fellow of the IEEE in 2012 for “contributions in algorithms, protocols, and architectures of optical networks.” In 2024, I received the IEEE ONTC Outstanding Technical Achievement Award for “pioneering research in the design, implementation, operation, and control of fiber optic network.” I was presented with the 2023-24 Department of Computer Science Person of Exceptional Performance (PEP) Award for “contributing significantly to the department’s success as role model for what it means to ‘think and do the extraordinary’.” Education 1994 PhD, Computer Science, Georgia Institute of Technology, Atlanta, GA 1991 MS, Computer Science, Georgia Institute of Technology, Atlanta, GA 1989 BS, Computer Engineering, National Technical University of Athens (Εθνικό Μετσόβειο Πολυτεχνείο), Athens, Greece Awards 2023 IEEE ONTC Outstanding Technical Achievement Award 2023-24 CSC Person of Exceptional Performance (PEP) Award 2020-21 Carla Savage Award, Department of Computer Science, NC State 2019 IEEE ONTC Outstanding Service Award 2018 Alumni Distinguished Graduate Professor 2015 Joyce Hatch Service Award, NC State Chapter of ACM/AITP 2014 Most Receptive Graduate Professor Outside the Classroom Award, NC State Chapter of ACM/AITP 2012 IEEE Fellow 2012 Carol Miller Graduate Lecturer Award, NC State Chapter of ACM/AITP 2010/11 IEEE Distinguished Lecturer 2010 Outstanding Service Award, IEEE Globecom 2007 IBM Faculty Award 2007 Best Paper Award, EVGM Workshop 2006 Best Paper Award, CSNDSP Symposium 2004 ALCOA Foundation Engineering Research Achievement Award, College of Engineering, NC State 2004 Academy of Outstanding Teachers, NC State 2003 Alumni Outstanding Research Award, NC State 1998 Best Paper Award, SPIE Conference on All-Optical Networking 1997 CAREER Award, National Science Foundation 1995 Outstanding New Teacher Award, Department of Computer Science, NC State 1994 Graduate Research Award, College of Computing, Georgia Institute of Technology Find NC State websites, locations and people TOP LINKS MyPack Portal Access vital records, resources and information for students, families, faculty and staff. University Libraries Our campus libraries are your destinations for studying, research and expanding your mind. Academic Calendar Look up important dates and university holidays for the upcoming academic year and beyond. Majors and Careers Explore our 100-plus degree programs and see where an NC State education can take you.",
  "content_length": 5543,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:40"
}