{
  "name": "Georgios Smaragdakis",
  "homepage": "https://gsmaragd.github.io",
  "status": "success",
  "content": "Georgios Smaragdakis -- Bio Toggle navigation Georgios Smaragdakis Bio Research Overview Active Projects ResolutioNet (ERC Starting Grant) BIFOLD (BBDC2) Completed Projects CDN-H (Marie Skłodowska-Curie Fellowship) Enabling ISP and CDN Collaboration Web Content Cartography Delay Tolerant Bulk Transfers on the Internet Selfish Neighbor Selection Distributed Facility Location Distributed Selfish Caching SEP: A Stable Election Protocol for clustered heterogeneous WSNs Publications Contact Georgios Smaragdakis is a Full Professor of Computer Science, Chair and Section Head of Cybersecurity at Delft University of Technology (TU Delft) since 2021. He is also an Associated Researcher at Max Planck Institute for Informatics and a Principal Investigator and Fellow at the Berlin Institute for the Foundations of Learning and Data (BIFOLD). In 2025, he was a visiting Professor of Computer Science at Stanford University. He was a Professor and Chair for Internet Measurement and Analysis at the Technical University of Berlin (TU Berlin) from 2017-2021. From 2014-2017, he was a Marie Skłodowska-Curie fellow at the Massachusetts Institute of Technology (MIT) Computer Science and Artificial Intelligence Laboratory (CSAIL) and a research affiliate with the MIT Internet Policy Research Initiative (IPRI) from 2015-2018. From 2014-2021, he was a Research Collaborator at Akamai Technologies and before that, from 2008-2014, he served as Senior Researcher at Deutsche Telekom Laboratories (T-Labs). In 2008, he was a research intern at Telefonica Research. He earned the Ph.D. degree in Computer Science from Boston University in 2009 and the Diploma in Electronic and Computer Engineering from the Technical University of Crete. His research brings a data- and measurement-driven approach to studying and improving Internet security, architecture, and performance and enhancing Web privacy and security. Selected Honors and Awards • 2025: USENIX Internet Defense Prize • 2025: Distinguished Paper Award at USENIX Security Symposium • 2024: Distinguished Reviewer, ACM SIGMETRICS • 2022: ACM Distinguished Member • 2022: IETF/IRTF Applied Networking Research Prize • 2021: Best Paper Award at ACM SIGCOMM • 2021: Communications of the ACM Research Highlights • 2021: IEEE Senior Member • 2020: ACM Senior Member • 2020: IETF/IRTF Applied Networking Research Prize • 2019: Best of ACM SIGCOMM Computer Communication Review (CCR) • 2019: IETF/IRTF Applied Networking Research Prize • 2019: Best Paper Award at ACM CoNEXT • 2018: Best Paper Award at ACM Internet Measurement Conference (IMC) • 2017: Best Paper Award at IEEE INFOCOM • 2016: Best Paper Award at ACM Internet Measurement Conference (IMC) • 2015: Best Paper Award at ACM CoNEXT • 2015: European Research Council (ERC) Starting Grant Award (ResolutioNet) • 2013: Marie Skłodowska-Curie International Outgoing Fellowship • 2011: Best Paper Award at ACM Internet Measurement Conference (IMC) Curriculum Vitae",
  "content_length": 2966,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:50"
}