{
  "name": "Georg Groh",
  "homepage": "https://www.professoren.tum.de/en/groh-georg",
  "status": "success",
  "content": "Groh_Georg Prof. Dr. Georg Groh Field Applied Informatics School TUM School of Computation, Information and Technology Contact Details Business card at TUMonline Academic Career and Research Areas Georg Groh's (*1970) field of research is focused on modeling, instantiating and using social context for applications. Here, social context refers to all aspects of short-, medium-, or long-term human social interaction that are or may be related to, mediated by, or significant for IT systems. Respective scientific fields include models and applications of e.g. social signal processing, social network analysis, or social media / web-mining. Methods are currently mainly centered around machine learning-based natural language processing.Georg Groh acquired his Diploma in theoretical Physics from the University of Kaiserslautern and studied at universities Hamburg, Kaiserslautern and TUM, also acquiring his Diploma in Informatics. 2005 he graduated as a PhD in Informatics at the chair of Prof. Johann Schlichter, TUM where he worked on ad-hoc-groups in mobile communities. 2012 he acquired his Habilitation in the same group, working on contextual social networking. 2020 he was appointed adjunct professor at the Faculty for Informatics, TUM. Awards 2nd Place Supervisory Award of CeDoSIA graduate center for excellent supervision of PhD students (2019)\"Ehrenurkunde\" for excellence in teaching, TUM (2016)Best Paper Award, Third IEEE European Network Intelligence Conference (2016)Best Paper Award, 38th Annual GI conference, Workshop Digitale Soziale Netze (2008) Key PublicationsMoeed, A, Hagerer G, Dugar S, Gupta S, Ghosh M, Danner, H, Mitevski O, Nawroth A, Groh G: \"An Evaluation of Progressive Neural Networks for Transfer Learning in Natural Language Processing\". Proceedings of the 12th Language Resources and Evaluation Conference. 2020: pp. 1376-1381.AbstractWich M, Bauer J, Groh G: \"Impact of Politically Biased Data on Hate Speech Classification\". Proceedings Proceedings of the Fourth Workshop on Online Abuse and Harms. 2020: pp 54-64.AbstractFuchs C, Voight C, Baldizian O, Groh G: \"Explicit and Latent Topic Representations of Information Spaces in Social Information Retrieval\".  Proceedings Third European Network Intelligence Conference (ENIC). 2016: pp 106-112.AbstractGroh G, Straub F, Eicher J, Grob D: \"Geographic aspects of tie strength and value of information in social networking\". Proceedings of the 6th ACM SIGSPATIAL International Workshop on Location-Based Social Networks. 2013: pp.1–10.AbstractGroh, G, Fuchs C, Lehmann A: \"Combining Evidence for Social Situation Detection\", Proceedings IEEE Third International Conference on Social Computing. 2011: pp. 742-747.Abstract If you wish your profile to be changed or updated please contact Franz Langer. Attention: JavaScript deactivated Please activate JavaScript to be able to use all website functions such as site search!",
  "content_length": 2915,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:19"
}