{
  "name": "George J. Pappas",
  "homepage": "http://www.georgejpappas.org",
  "status": "success",
  "content": "Home - George J. Pappas George Pappas is the UPS Foundation Professor at the Department of Electrical and Systems Engineering at the University of Pennsylvania. He also holds a secondary appointment in the Departments of Computer and Information Sciences, as well as Mechanical Engineering and Applied Mechanics.  He currently serves as the Associate Dean for Research and Innovation in the School of Engineering and Applied Science and as the Director of the Raj and Neera Singh program in Artificial Intelligence. Pappas’s research focuses on control systems, robotics, autonomous systems, formal methods, and machine learning for safe and secure cyber-physical systems. He has received numerous awards, including the NSF PECASE, the Antonio Ruberti Young Researcher Prize, the George S. Axelby Award, the O. Hugo Schuck Best Paper Award, and the George H. Heilmeier Faculty Excellence Award. Pappas has mentored more than fifty students and postdocs, now faculty in leading universities worldwide. He is a Fellow of IEEE, IFAC, and was elected to the National Academy of Engineering in 2024. Research Projects THEORINET: Transferable, Hierarchical, Expressive, Optimal, Robust, and Interpretable NETworksEnCORE: The institute for Emerging CORE Methods in Data ScienceIoT4Ag: The Internet of Things for Precision AgricultureBridging offline design and online adaptation in safe learning-enabled systemsDistributed and Collaborative Intelligent Systems and TechnologyMachine Learning and Control News and Press AwardsJul 11, 2024 - Charis Stamouli receives Best Student Paper award at ACC 2024 Feb 06, 2024 - George J. Pappas is elected to the U.S. National Academy of Engineering May 15, 2023 - Outstanding Multi-Robot Systems Paper, IEEE ICRA, May 2023 In the PressMar 15, 2024 - George Pappas comments on the new EU AI Act (In Greek) Feb 15, 2024 - George Pappas on the new AI undergraduate program at Penn Feb 12, 2024 - George Pappas’ NAE Election covered by Daily Pennsylvanian Lab NewsJul 11, 2024 - Charis Stamouli receives Best Student Paper award at ACC 2024 Dec 15, 2021 - Alena Rodionova receives Best Student Paper Award at IEEE CDC Nov 15, 2019 - Andreea Alexandru is a Rising Star in EECS LectureMar 15, 2024 - Plenary Speaker, American Control Conference, July 2025 Nov 15, 2022 - Keynote, NSF Cyber-physical systems PI meeting, November 2022. Jul 15, 2022 - Plenary Speaker, 39th Chinese Control Conference, Shenyang, China, July 2020. Recent Publications Sharp Rates in Dependent Learning Theory: Avoiding Sample Size Deflation for the Square Loss. Ingvar Ziemann, Stephen Tu, George J. Pappas, Nikolai Matni. In Proceedings of the International Conference on Machine Learning, Vienna, Austria. (2024) [PDF] [DOI] [PubMed] Conformal Prediction with Learned Features. Shayan Kiyani, George J. Pappas, Hamed Hassani. In Proceedings of the International Conference on Machine Learning, Vienna, Austria (2024) [PDF] [DOI] Guarantees for Nonlinear Representation Learning: Non-identical Covariates, Dependent Data, Fewer Samples. Thomas Zhang, Bruce D Lee, Ingvar Ziemann, George J. Pappas, Nikolai Matni. In Proceedings of the International Conference on Machine Learning, Vienna, Austria. (2024) [PDF] [PubMed] Finite-Time Analysis of Asynchronous Multi-Agent TD Learning. Nicolò Dal Fabbro, Arman Adibi, Aritra Mitra, George J. Pappas. In Proceedings of the 2024 American Control Conference, Toronto. (2024) Structural Risk Minimization for Learning Nonlinear Dynamics. Charalampia Stamouli, Evangelos Chatzipantazis, George J. Pappas. In Proceedings of the 2024 American Control Conference, Toronto. (Best Student Paper Award) (2024) Contact George Pappas, PhD UPS Foundation Professor Department of Electrical and Systems Engineering Amy Gutmann Hall, Room 538C University of Pennsylvania 3333 Chestnut Street Philadelphia, PA 19104 (215) 898-9780 ude.nnepu.saes@gsappap Scroll to top Scroll to top Scroll to top",
  "content_length": 3931,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:32"
}