{
  "name": "George K. Atia",
  "homepage": "http://eecs.ucf.edu/~atia",
  "status": "success",
  "content": "George Atia - Home CS DIVISION ECE DIVISION HOME RESEARCH TEACHING PUBLICATIONS STUDENTS TALKS AWARDS GEORGE ATIA George Atia George.Atia@ucf.edu (407)-823-3467 Department Fax: (407)-823-5835 HEC 429 BIOGRAPHY I am currently an associate professor at the Department of Electrical and Computer Engineering at the University of Central Florida where I direct the Data Science and Machine Learning Lab (DSML). From Sept. 2009 to 2012, I was a postdoc at the Coordinated Science Laboratory (CSL) at the University of Illinois at Urbana-Champaign (UIUC). Prior to that I received my Ph.D. at the Department of Electrical and Computer Engineering at Boston University where I was also a member of the Information Systems and Sciences Lab (ISS) and the Center for Information and Systems Engineering (CISE). I also received my M.Sc. and B.Sc. in Electrical Engineering from Alexandria University in 2003 and 2000, respectively. NEWS 7/2023 My PhD student Ismail Alkhouri joins Michigan State University (MSU) as a postdoc and the University of Michigan as a visiting scholar. 6/2023 New paper: Imperceptible Attacks on Fault Detection and Diagnosis Systems in Smart Buildings, Accepted to the IEEE Transactions on Industrial Informatics. 4/2023 New paper: A Non-Targeted Attack Approach for the Coarse Mis-Classification Problem, Accepted to IJCNN 2023. 3/2023 New paper: Robust and Parallelizable Tensor Completion based on Tensor Factorization and Maximum Correntropy Criterion, Accepted to ICASSP 2023. 2/2023 Our paper \"Robust Average-Reward Markov Decision Processes\" received the distinguished paper award at AAAI 2023. 10/2022 Organizing a special session on Robust Learning and Inference with V. Veeravalli (UIUC) and S. Zou (UBuffalo) at ICASSP 2023 in Rhodes, Greece. 10/2022 New paper: Sketch-based community detection in evolving networks, Accepted to Physical Review E. 10/2022 New paper: Fooling the Big Picture in Classification Tasks, Accepted to Circuits, Systems, and Signal Processing 8/2022 New paper: A Differentiable Approach to the Maximum Independent Set Problem using Dataless Neural Networks, Accepted to Neural Networks. 8/2022 New paper: Coarse to Fine Two-Stage Approach to Robust Tensor Completion of Visual Data, accepted to IEEE Trans. on Cybernetics. 7/2022 New paper: Patch Tracking-based Streaming Tensor Ring Completion for Visual Data Recovery, accepted to TCSVT. 6/2022 New papers: International Workshop on Machine Learning for Signal Processing (MLSP) BOSS: Bidirectional One-Shot Synthesis of Adversarial Examples The Minimum Value State Problem in Actor-Critic Networks An Approach to the Maximum Independent Set Problem Using Graph-based Neural Network Structures 5/2022 Invited talk at ITA 2022 on verifiable planning in multichain MDPs. 4/2022 My PhD student Pouria Saidi joins ASU as a postdoc. 2/2022 New papers: International Conference on Automated Planning and Scheduling (ICAPS) Active Grammatical Inference for Non-Markovian Planning Inferring Probabilistic Reward Machines from Non-Markovian Reward Signals for Reinforcement Learning Multi-Agent Tree Search with Dynamic Reward Shaping 2/2022 New paper: Synthesis of Adversarial Samples in Two-Stage Classifiers, accepted to ICASSP 2022. 12/2021 New paper: Controller Synthesis for Omega-Regular and Steady-State Specifications, accepted to AAMAS 2022. 12/2021 New paper: Multi-mode Tensor Space Clustering based on Low-tensor-rank Representation, accepted to AAAI 2022. 11/2021 My PhD student Pouria Saidi defends his thesis on Periodicity Estimation Using Representations in Nested Periodic Dictionaries with Applications in Neural Engineering 11/2021 New paper: Sketches by MoSSaRT: Representative Selection from Manifolds with Gross Sparse Corruptions, accepted to Pattern Recognition. 10/2021 New paper: Steady-State Planning in Expected Reward Multichain MDPs, accepted to the Journal of Artificial Intelligence Research (JAIR). 9/2021 I joined the editorial board of the IEEE Transactions on Signal Processing as an Associate Editor 7/2021 New paper: Learning Probabilistic Reward Machines from Non-Markovian Stochastic Reward Processes. 7/2021 New NSF funding: Florida Information Technology Graduation Attainment Pathways. 6/2021 New paper: Robust M-estimation-based Tensor Ring Completion: a Half-quadratic Minimization Approach. 6/2021 New NSF funding: Emerging Directions in Robust Learning and Inference. 5/2021 New paper: Non-local Patch-based Low-rank Tensor Ring Completion for Visual Data. 4/2021 New paper: Targeted Attacks in Hierarchical Settings via Convex Programming, Accepted to IJCNN 2021. 1/2021 New paper: Adversarial Attacks on Coarse-to-Fine Classifiers, accepted to ICASSP 2021. 12/2020 New paper: Dynamic Automaton-Guided Reward Shaping for Monte Carlo Tree Search, accepted to the AAAI 2021. 10/2020 New paper: Sketch-based Community Detection via Representative Node Sampling, accepted to ICPR 2020. 10/2020 My PhD student Andre Beckus joins the Air Force Research Lab (AFRL) as a Research Scientist. 10/2020 New paper: Robust Low-tubal-rank Tensor Completion based on Tensor Factorization and Maximum Correntopy Criterion. 9/2020 New paper: Sketch-based community detection in evolving networks. 9/2020 New paper: A Multi-Criteria Approach for Fast and Robust Representative Selection from Manifolds, accepted to IEEE Transactions on Knowledge and Data Engineering (TKDE). 6/2020 My PhD student Andre Beckus defends his thesis on passive scene reconstruction in NLOS scenarios. 6/2020 New paper: Scalable Direction-Search-Based Approach to Subspace Clustering, accepted to ICPR 2020. 5/2020 Visiting faculty at the Air Force Research Lab (AFRL), Rome, NY. 4/2020 New funding from the DOE on security of smart buildings. 4/2020 New paper: Steady-State Policy Synthesis in Multichain Markov Decision Processes, accepted to IJCAI 2020, Acceptance Rate: 12.6%. 9/2019 Visiting faculty at the Air Force Research Lab (AFRL), Advanced Planning and Autonomous C2 Systems, Rome, NY. 9/2019 Invited talk at Allerton on sequential and scalable approaches to community detection in dynamic graphs. 7/2019 New papers: International Workshop on Machine Learning for Signal Processing (MLSP) Scalable Community Detection in the Heterogeneous Stochastic Block Model Low-dimensional Decomposition of Manifolds in Presence of Outliers 5/2019 My PhD student Davood Mardani defends his thesis and joins Analog Devices, Inc. in Boston. 3/2019 My PhD student Ahmed Hemida defends his thesis and joins the Army Research Lab as a postdoctoral research associate. 3/2019 New paper: Detection of brain stimuli using Ramanujan periodicity transforms, To appear in the Journal of Neural Engineering. 3/2019 New paper: A Game-Theoretic Framework for the Virtual Machines Migration Timing Problem, To appear in the IEEE Transactions on Cloud Computing. 1/2019 New paper: Multi-modal Non-line-of-sight Passive Imaging, accepted to the IEEE Transactions on Image Processing. 1/2019 New paper: Robust Manifold Learning via Conformity Pursuit, To appear in the IEEE Signal Processing Letters. 10/2018 New paper: Low Rank Matrix Recovery with Simultaneous Presence of Outliers and Sparse Corruption, To appear in the IEEE Journal of Selected Topics in Signal Processing. 10/2018 New paper: Signal Reconstruction from Interferometric Measurements under Sensing Constraints, To appear in Signal Processing. 10/2018 New paper: Interferometry-based Modal Analysis with Finite Aperture Effects, To Appear in the Journal of the Optical Society of America (JOSA A). 8/2018 Elevated to the grade of IEEE Senior member 7/2018 New papers: Asilomar Conference on Signals, Systems and Computers Randomized Robust Matrix Completion for the Community Detection Problem Kernel Coherence Pursuit: A Manifold Learning-based Outlier Detection Technique Data Dropout in Arbitrary Basis for Deep Network Regularization Periodicity Transforms for Multichannel and Multiclass Detection of Visual Evoked Potentials 6/2018 New paper: Adaptive Topologies Against Jamming Attacks in Wireless Networks: A Game-Theoretic Approach, To appear in the Journal of Network and Computer Applications. 5/2018 New paper: It’s Time to Migrate! A Game-Theoretic Framework for Protecting a Multi-tenant Cloud against Collocation Attacks, To appear in IEEE CLOUD. 4/2018 Received my Tenure at the University of Central Florida. 4/2018 Received the UCF Reach for the Stars Award. 4/2018 New paper: On the inverse problem of source reconstruction from coherence measurements, To appear in the Journal of the Optical Society of America (JOSA A). 4/2018 Received the UCF Teaching Incentive Program (TIP) Award. 3/2018 New paper: A Game-Theoretic Framework for the Virtual Machines Migration Timing Problem. 3/2018 New paper: Hidden Quantum Processes, Quantum Ion Channels, and 1/f^θ-Type Noise, To appear in MIT Neural Computation. 2/2018 New paper: Compressive Optical Interferometry under Structural Constraints, Published in Optics Express. 2/2018 Received the Research Incentive Award (RIA). 1/2018 My PhD student Mostafa Rahmani defends his thesis; joins Baidu Research, Seattle. 12/2017 Received the Aftab Mufti Medal for Best Paper in the Journal of Civil Structural Health Monitoring, with Prof. Necati Catbas and Dr. Masoud Malekzadeh. 12/2017 New paper: Subspace Clustering via Optimal Direction Search, published in the Signal Processing Letters. 12/2017 New paper: Coherence Pursuit: Fast, Simple and Robust Principal Component Analysis, Published in the IEEE Transactions on Signal Processing. 12/2017 New paper: Spatial Coherence of Fields from Generalized Sources in the Fresnel Regime, Published in Journal of the Optical Society of America (JOSA A). 12/2017 New paper: Innovation Pursuit: A New Approach to Subspace Clustering, Published in the IEEE Transactions on Signal Processing. 10/2017 Received the Inaugural UCF Luminary Award. 9/2017 New paper: Spatial Random Sampling: A Structure-Preserving Data Sketching Tool, Published ",
  "content_length": 11035,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:30"
}