{
  "name": "Georgina Cosma",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/georgina-cosma",
  "status": "success",
  "content": "Georgina Cosma | Computer Science | Loughborough University Professor Georgina Cosma PhD Computer Science (Intelligent Information Retrieval) Pronouns: She/her Professor of AI and Data Science Natural Language Processing, Neural Information Retrieval, Data Science, Artificial Intelligence, Ethical AI, Continual Lifelong Learning Publications ORCiD Google Scholar +44 (0)1509 564 158 Send email Office: N.3.03 (Haslegrave Building) LinkedIn X Personal website Profile Research External activities Responsibilities Georgina Cosma received a PhD degree in computer science from the University of Warwick, in 2008. Her PhD thesis topic was on intelligent information retrieval (natural language processing) which involved developing novel approaches to detecting similarities in natural language text and source-code files. Dr Cosma is currently a Senior Lecturer at the Department of Computer Science, Loughborough University. She teaches Natural Language Processing (NLP) on the MSc in Artificial Intelligence programme; Data Analytics & Visualisation on the MSc in Data Science programme; and is Programme Director of the MSc in Data Science programme. Her research interests strongly reside in the areas of AI and data science, Intelligent & Neural Information Retrieval, Machine Learning, Ethical AI, Continual Lifelong Learning, and Temporal Information Modelling. She has ample experience in the development of machine learning solutions requiring the analysis and modelling of large complex and/or multi-modal data, including image, biomedical, sensor, and natural language data. Her research is focused on the development of AI solutions for healthcare (predictive modelling, personalised predictions, explainable AI), engineering (defect detection), and digital libraries (search engines, information retrieval). At the centre of all projects is the development of responsible and ethical AI solutions with lifelong learning capabilities. She is supervising a team of talented research associates working on funded projects primarily in the area of AI-based solutions for healthcare and other applications. Information about Dr Cosma's research project grants can be found here. She welcomes collaborations from other academics, organisations and industries. Dr Cosma is supervising a team of PhD students working on neural information retrieval and other AI projects. If you are interested in undertaking a PhD please click here for ideas on topics. These aim to be a starting point for discussion, and your ideas are welcome. For applications for Ph.D. studentships follow the link here. Research areas Dr Cosma's research interests are broadly in the area of Information Retrieval, Data Science and AI, and include the following topics: Visual semantic embedding for Information Retrieval tasks Predictive modelling (including biomedical predictive modelling) and the development of machine learning models that provide reasoning behind predictions Feature selection using combinatorial optimisation methods, for finding combinations of features for building deep learning-based predictive models Unsupervised deep learning for information retrieval tasks Improving the learning capabilities of deep neural networks on learning ‘limited data’ Continual/lifelong learning tasks and improving the ability of deep neural networks to learn new information without forgetting Information Retrieval for natural language, source code and image data Responsible and ethical AI AI Ethics. Bias detection, management and mitigation methods and strategies. If you are interested in a PhD in the above areas then get in touch. Also check my personal page on PhD topics. EPSRC Prioritisation Panel member Reviewer of the Engineering and Physical Sciences Research Council Reviewer College Reviewer of the Economic and Social Research Council (EPSRC) Reviewer of the Biotechnology and Biological Sciences Research Council (BBSRC) Reviewer of the Medical Research Council (MRC) Reviewer of Cancer Research UK Associate Editor of Elsevier Pattern Recognition. Reviewer of various IEEE, Elsevier and other journals. MSc Data Science Programme Director Senate member of the Academic Staff in the School of Science Module Leader for the Natural Language Programming module taught in MSc Artificial Intelligence Module Leader for the Data Analytics & Visualisation module taught in MSc Data Science Ph.D. supervisor for a group of students working on AI projects. See my current Ph.D. students here MSc, MSci, BSc project supervisor Personal tutor",
  "content_length": 4538,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:47"
}