{
  "name": "Georgia Chalvatzaki",
  "homepage": "https://pearl-lab.com/people/georgia-chalvatzaki",
  "status": "success",
  "content": "Georgia Chalvatzaki – Interactive Robot Perception & Learning Georgia Chalvatzaki Short Bio Georgia Chalvatzaki is a Full Professor for Interactive Robot Perception & Learning at TU Darmstadt and Hessian.AI. She received her Ph.D. in 2019 from the Intelligent Robotics and Automation Lab at the Electrical and Computer Engineering School of the National Technical University of Athens, Greece. She is the recipient of the DFG AI Emmy Noether grant (iROSA, 2021–2027), the ERC Starting Grant in 2024 for her project SIREN, and the Alfried Krupp Prize 2025, one of Germany’s most prestigious scientific awards. She has received several Best Paper Awards, and delivered the Early Career Keynote at CoRL 2024. Her research focuses on embodied AI, structured robot learning, mobile manipulation, and safe human-in-the-loop learning. Full Bio Georgia is a Full Professor for Interactive Robot Perception & Learning at the Computer Science Department of the Technical University of Darmstadt and Hessian.AI. She is the recipient of the renowned Emmy Noether (EN) grant of the German Research Foundation (DFG) for her project iROSA (2021-2027) and has been awarded an ERC Starting Grant in 2024 for her research project SIREN. In 2025, she received the Alfried Krupp Prize, one of Germany’s most prestigious scientific awards for young professors in the natural and engineering sciences. In her research group, PEARL (previously iROSA), Dr. Chalvatzaki and her team propose new methods at the intersection of machine learning and classical robotics, taking the research for embodied AI robotic assistants one step further. The research in PEARL proposes novel methods for combined planning and learning to enable mobile manipulator robots to solve complex tasks in house-like environments, with the human-in-the-loop of the interaction process. She received her Ph.D. in December 2019 at the Intelligent Robotics and Automation Lab at the Electrical and Computer Engineering School of the National Technical University of Athens, Greece, with her thesis “Human-Centered Modeling for Assistive Robotics: Stochastic Estimation and Robot Learning in Decision-Making. From October 2019 till February 2021, she was a Postdoctoral researcher at the Intelligent Autonomous Systems group at TU Darmstadt. She started her independent Emmy Noether DFG-funded research group in March 2021. In February 2022, Georgia was promoted to Assistant Professor (W1), and after just one year she became a Full Professor (W3) at TU Darmstadt. Apart from the great honor of the ERC StG and the EN DFG, Georgia received several awards (IROS 2022 Best Paper Award in Mobile Manipulation, Best Paper Award at the RSS 2024 Workshop on Priors4Robots, Best Paper Award at the ICRA 2023 Workshop on Geometric Representations, Outstanding Associate Editor RA-L 2023, Top Reviewer NeurIPS 2023, Junior Researcher for 2021– top 10, Daimler and Benz Foundation Scholarship 2022, 2021 AI Newcomer German Informatics Society, Robotics Science and Systems Pioneer 2020, 4 Best Paper and Student Paper Award Finalist), and has delivered 40 Keynotes in distinguished international workshops and conferences, and over 60 publications. To follow her publications, see her google scholar profile. Georgia is very active on her academic social media. Follow her on Twitter and LinkedIn Other Activities Georgia is a co-chair of the IEEE RAS Technical Committee on Mobile Manipulation. Through this role, she organizes events related to Mobile Manipulation research and works on bringing awareness to the problems of perception, action, and learning in mobile manipulation. See more details at https://mobile-manipulation.net/ Georgia is the chair of the IEEE RAS Women in Engineering committee. Her mission as co-chair is to engage younger and underrepresented groups in robotics research, and organizes events to bring awareness to the topics of inclusion and equal opportunities. See more details at https://www.ieee-ras.org/women-in-engineering My CV Publications Contact me Tweets by GeorgiaChal Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like this:Like Loading… Loading Comments... Write a Comment... Email (Required) Name (Required) Website %d",
  "content_length": 4269,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:46"
}