{
  "name": "Georg Carle",
  "homepage": "https://www.net.in.tum.de/members/carle",
  "status": "success",
  "content": "TUM Info VIII: Prof. Dr.-Ing. Georg Carle Prof. Dr.-Ing. Georg Carle Chair Holder Postal address Institut für Informatik der Technischen Universität München Lehrstuhl I8 Boltzmannstr. 3 85748 Garching bei München - Germany Contact Tel: +49 89 289 18030 Fax: +49 89 289 - 18033 e-Mail: carlenet.in.tum.de (GPG: 82E2 694D E2D7 C8FA 4A31 DFE7 3033 A04B 8382 E684) Building/Room: MI Building, 03.05.054 Consultation hours After arrangement (Default time: Mo 18 - 18:30) Education and occupational development Since April 2008: Full Professor (W3), Technical University of Munich, Chair of Network Architectures and Services Dec. 2002- Mar. 2008: Full Professor (C4), University of Tübingen, Chair of Computer Networks and Internet 1997: Postdoctoral scientist at the Institut Eurecom, Sophia Antipolis, France (Marie-Curie-Fellowship of the EU) 1997-2002: Fraunhofer-Institute for Open Communication Systems FhG FOKUS, Berlin (formerly GMD FOKUS); Head of the Competence Center \"Global Networking\" 1992-1996: PhD in Computer Science at the University of Karlsruhe, Institute for Telematics; scholarship of the Graduate School \"Controllability of complex systems\" 1990: Research project at Ecole Nationale Supérieure des Télécommunications (ENST), Paris 1988/1989: Master of Science in Digital Systems, Brunel University, London, U.K.; Master theses at General Electric Corporation, Hirst Research Centre, London 1985-1992: Studies of electrical engineering at the University of Stuttgart, Germany Selected activities Information Officer and Director of IT Services of the Department of Informatics of TU München (since 2013) Member of the management board of the Association of German Computer Science Departments (since 2006) Member of the Universitary Professors Advisory Board of the German Computer Science Association (since 2007) Vice-Chair of IFIP Working Group 6.2 Network and Internetwork Architecture (since 2013) Past Activities Managing Director, Department of Computer Science, TU München (April 2010 - March 2013) Chair of IFIP Working Group 6.2 Network and Internetwork Architecture (2007-2012) Vice-Chair, IEEE Technical Committee on High-Speed Networking (2006-2008) Member of the board of the German Computer Science Association (2005-2010) Vice-Dean, Faculty of Information and Cognitive Science, University of Tübingen (2006-2007) Teaching Please see the teaching page for my activities in this domain. Publications Full list of publications Selected Publications 1 Tsvetko Tsvetkov, Janne Ali-Tolppa, Hennig Sanneck, and Georg Carle: A Minimum Spanning Tree-Based Approach for Reducing Verification Collisions in Self-Organizing Networks, In IEEE/IFIP Network Operations and Management Symposium (NOMS 2016), Istanbul, Turkey, April 2016 (Best paper award). 2 Johann Schlamp, Ralph Holz, Quentin Jacquemart, Georg Carle, and Ernst Biersack: HEAP: Reliable Assessment of BGP Hijacking Attacks, IEEE Journal on Selected Areas in Communications, Special Issue on Measuring and Troubleshooting the Internet: Algorithms, Tools and Applications, 2016. 3 Paul Emmerich, Sebastian Gallenmüller, Daniel Raumer, Florian Wohlfart, and Georg Carle: MoonGen: A Scriptable High-Speed Packet Generator, In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC 2015), Tokyo, Japan, October 2015. 4 Johann Schlamp, Ralph Holz, Oliver Gasser, Andreas Korsten, Quentin Jacquemart, Georg Carle, and Ernst W. Biersack: Investigating the Nature of Routing Anomalies: Closing in on Subprefix Hijacking Attacks. In Proc. 7th Int. Workshop on Traffic Monitoring and Analysis (TMA 2015), Barcelona, Spain, April 2015 (Best paper award). 5 Johann Schlamp, Georg Carle, and Ernst Biersack: A Forensic Case Study on AS Hijacking: The Attacker’s Perspective, ACM SIGCOMM Computer Communications Review, CCR, April 2013. 6 Ralph Holz, Lothar Braun, Nils Kammenhuber, and Georg Carle: The SSL Landscape - A Thorough Analysis of the X.509 PKI Using Active and Passive Measurements. In Proceedings of the 11th ACM SIGCOMM Internet Measurement Conference (IMC 2011), Berlin, Germany, November 2011. 7 Lothar Braun, Alexander Didebulidze, Nils Kammenhuber, and Georg Carle: Comparing and Improving Current Packet Capturing Solutions based on Commodity Hardware. In Proceedings of the ACM SIGCOMM Internet Measurement Conference (IMC 2010), Melbourne, Australia, November 2010. 8 Lothar Braun, Gerhard Münz, and Georg Carle: Packet Sampling for Worm and Botnet Detection in TCP Connections. In Proceedings of the IEEE/IFIP Network Operations and Management Symposium (NOMS) 2010, Osaka, Japan, April 2010. 9 Andreas Müller, Andreas Klenk, and Georg Carle: Behavior and Classification of NAT Devices and Implications for NAT Traversal, IEEE Network, Vol. 22, No. 5, September-October 2008. 10 Gerhard Münz and Georg Carle: Real-Time Analysis of Flow Data for Network Attack Detection, Proceedings of IFIP/IEEE Symposium on Integrated Management 2007, IM 2007, Munich, Germany, May 2007. Table of contents Conferences and Workshops Publications Projects Supervised student projects",
  "content_length": 5090,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:18"
}