{
  "name": "George Konidaris 0001",
  "homepage": "http://cs.brown.edu/people/gdk",
  "status": "success",
  "content": "George Konidaris @ Brown George Konidaris Director: Intelligent Robot Lab Associate Professor Department of Computer Science Brown University, Providence RI gdk@cs.brown.edu Home | IRL | Research | Teaching | Publications | Software | CV Welcome to my home page. I'm an Associate Professor of Computer Science and director of the Intelligent Robot Lab at Brown, which forms part of bigAI (Brown Integrative, General AI). My group and I conduct research driven by the overarching scientific goal of understanding the fundamental computational processes that generate intelligence, and using them to design a generally-intelligent robot. If you're considering applying to the PhD program at Brown to study in my lab, please see this page. I am also the co-founder of two technology startups. Realtime Robotics commercializes our research on robot motion planning to make robotic automation simpler, better, and faster. Lelapa AI is a commercial AI research lab focused on technology by and for Africans, based in my hometown of Johannesburg, South Africa. I live in Providence, Rhode Island - that universal haven of the odd, the free, and the dissenting. Research My research aims to build intelligent, autonomous, general-purpose robots that are generally capable in a wide variety of tasks and environments. I focus on understanding how to design agents that learn abstraction hierarchies that enable fast, goal-oriented planning. I develop and apply techniques from machine learning, reinforcement learning, optimal control and planning to construct well-grounded hierarchies that result in fast planning for common cases, and are robust to uncertainty at every level of control. I believe that it will take advances in all of these areas, and additionally advances in how to integrate these areas, to solve the AI problem. This recent lecture covers the high-level vision underlying most of my work: You can also find an approachable (and short!) view of my approach to building generally intelligent agents in the following review paper: G.D. Konidaris. On The Necessity of Abstraction. Current Opinion in Behavioral Sciences 29 (Special Issue on Artificial Intelligence), pages 1-7, October 2019. My invited talk at CoRL 2019 in Osaka summarizes my lab's technical work at that point: Finally, this journal article is a good indicator of my interests - it combines ideas from hierarchical reinforcement learning, probabilistic machine learning, task-level planning, and robotics to create a robot that autonomously learns an abstract symbolic model of an environment and then uses it to plan: G.D. Konidaris, L.P. Kaelbling, and T. Lozano-Perez. From Skills to Symbols: Learning Symbolic Representations for Abstract High-Level Planning. Journal of Artificial Intelligence Research 61, pages 215-289, January 2018. Of course, the video is a lot more accessible: Other than that, here are a few sample project pages: Constructing High-Level Symbolic Representations for Planning. Autonomous Robot Skill Acquisition. Planning for the Decentralized Control of Multi-Robot Teams. Robot Motion Planning on a Chip. The Fourier Basis. Teaching I have previously taught the following classes at Brown: CSCI 2951X: Reintegrating AI (Spring 2025) CSCI 2951X: Reintegrating AI (Spring 2024) CSCI 2951X: Reintegrating AI (Spring 2023) CSCI 1410: Artificial Intelligence (Fall 2022) CSCI 2951X: Reintegrating AI (Fall 2021) CSCI 1410: Artificial Intelligence (Fall 2021) CSCI 2951X: Reintegrating AI (Spring 2021) CSCI 2951X: Reintegrating AI (Spring 2020) CSCI 1410: Artificial Intelligence (Fall 2019) CSCI 2951X: Reintegrating AI (Spring 2018) CSCI 1410: Artificial Intelligence (Fall 2018) CSCI 1410: Artificial Intelligence (Fall 2017) CSCI 1410: Artificial Intelligence (Spring 2017) I taught the following classes when I was at Duke: CPS 590.2: Hierarchical Robot Learning and Planning (Fall 2014) CPS 270: Introduction to Artificial Intelligence (Spring 2015) CPS 590: Decision Making for Robots and Autonomous Systems (Fall 2015) CPS 270: Introduction to Artificial Intelligence (Spring 2016)",
  "content_length": 4093,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:35"
}