{
  "name": "George Papen",
  "homepage": "https://profiles.ucsd.edu/george.papen",
  "status": "success",
  "content": "George Papen | UCSD Profiles Powered by Altman Clinical and Translational Research Institute Our site may be slower due to heavy traffic from automated \"bots\" and AI crawlers. We're working to fix this. UCSD Profiles search, discover, network Return to Top George Papen Title(s)Emeritus Professor, Electrical and Computer EngineeringSchoolVc-academic AffairsAddress9500 Gilman Drive #La Jolla CA 92093vCardDownload vCard Bibliographic  selected publications Publications listed below are automatically derived from MEDLINE/PubMed and other sources, which might result in incorrect or missing publications. Researchers can login to make corrections and additions, or contact us for help. to make corrections and additions. Newest | Oldest | Most Cited | Most Discussed | Timeline | Field Summary | Plain Text Altmetrics Details PMC Citations indicate the number of times the publication was cited by articles in PubMed Central, and the Altmetric score represents citations in news articles and social media. (Note that publications are often cited in additional ways that are not shown here.) Fields are based on how the National Library of Medicine (NLM) classifies the publication's journal and might not represent the specific topic of the publication. Translation tags are based on the publication type and the MeSH terms NLM assigns to the publication. Some publications (especially newer ones and publications not in PubMed) might not yet be assigned Field or Translation tags.) Click a Field or Translation tag to filter the publications. Deep-sea low-light radiometer system. Opt Express. 2014 Dec 01; 22(24):30074-91. Haag JM, Roberts PL, Papen GC, Jaffe JS, Li L, Stramski D. PMID: 25606937. View in: PubMed   Mentions:    Fields: Bio BiophysicsOph Ophthalmology   Translation:Animals Wideband silicon-photonic thermo-optic switch in a wavelength-division multiplexed ring network. Opt Express. 2014 Apr 07; 22(7):8205-18. Aguinaldo R, Forencich A, DeRose C, Lentine A, Trotter DC, Fainman Y, Porter G, Papen G, Mookherjea S. PMID: 24718196. View in: PubMed   Mentions: 2     Fields: Bio BiophysicsOph Ophthalmology Improved sensitivity of intensity-modulated spectroscopy using correlative signal processing. Opt Lett. 2011 Feb 01; 36(3):346-8. Ataie V, Papen G. PMID: 21283185. View in: PubMed   Mentions:    Fields: Oph Ophthalmology Performance-based adaptive power optimization for digital optical interconnects. Appl Opt. 2005 Oct 10; 44(29):6240-52. Wang X, Kiamilev F, Papen GC, Ekman J, Gui P, McFadden MJ, Deroba JC, Haney MW, Kuznia C. PMID: 16237941. View in: PubMed   Mentions:    Fields: Oph Ophthalmology Signal Statistics and Maximum Likelihood Sequence Estimation in Intensity Modulated Fiber Optic Links Containing a Single Optical Pre-amplifier. Opt Express. 2005 Jun 13; 13(12):4568-79. Alic N, Papen G, Saperstein R, Milstein L, Fainman Y. PMID: 19495371. View in: PubMed   Mentions:    Fields: Bio BiophysicsOph Ophthalmology Fe Boltzmann temperature lidar: design, error analysis, and initial results at the north and south poles. Appl Opt. 2002 Jul 20; 41(21):4400-10. Chu X, Pan W, Papen GC, Gardner CS, Gelbwachs JA. PMID: 12148772. View in: PubMed   Mentions: 4     Fields: Oph Ophthalmology Fiber-based lidar for atmospheric water-vapor measurements. Appl Opt. 2001 Jul 20; 40(21):3417-27. Little LM, Papen GC. PMID: 18360367. View in: PubMed   Mentions:    Fields: Oph Ophthalmology Comparison of an fe boltzmann temperature lidar with a na narrow-band lidar. Appl Opt. 1998 Dec 20; 37(36):8477-81. Papen GC, Treyer D. PMID: 18301676. View in: PubMed   Mentions:    Fields: Oph Ophthalmology Validation of the Lidar In-Space Technology Experiment: stratospheric temperature and aerosol measurements. Appl Opt. 1997 Jul 20; 36(21):5148-57. Gu YY, Gardner CS, Castleberg PA, Papen GC, Kelley MC. PMID: 18259328. View in: PubMed   Mentions:    Fields: Oph Ophthalmology Analysis of a potassium lidar system for upper-atmospheric wind-temperature measurements. Appl Opt. 1995 Oct 20; 34(30):6950-8. Papen GC, Gardner CS, Pfenninger WM. PMID: 21060557. View in: PubMed   Mentions:    Fields: Oph Ophthalmology Sensitivity analysis of Na narrowband wind-temperature lidar systems. Appl Opt. 1995 Jan 20; 34(3):480-98. Papen GC, Pfenninger WM, Simonich DM. PMID: 20963143. View in: PubMed   Mentions:    Fields: Oph Ophthalmology Phase-conjugate holographic system for high-resolution particle-image velocimetry. Appl Opt. 1994 Oct 20; 33(30):7159-70. Barnhart DH, Adrian RJ, Papen GC. PMID: 20941270. View in: PubMed   Mentions: 4     Fields: Oph Ophthalmology Multiple-wavelength operation of a laser-diode array coupled to an external cavity. Opt Lett. 1993 Sep 01; 18(17):1441-3. Papen GC, Murphy GM, Brady DJ, Howe AT, Dallesasse JM, Dejule RY, Holmgren DJ. PMID: 19823408. View in: PubMed   Mentions:    Fields: Oph Ophthalmology Lateral and focal shifts of phase-conjugated beams in photorefractive materials. Opt Lett. 1989 Jul 15; 14(14):745-7. Papen GC, Saleh BE. PMID: 19752955. View in: PubMed   Mentions:    Fields: Oph Ophthalmology Impulse-response function of photorefractive phase conjugation. Opt Lett. 1989 Mar 01; 14(5):287-9. Papen GC, Saleh BE, Tataronis JA. PMID: 19749897. View in: PubMed   Mentions:    Fields: Oph Ophthalmology This graph shows the total number of publications by year. To see the data as text, click here. This graph shows the total number of publications by year. To return to the graph, click here. YearPublications1995219971199812001120021200522011120142 This graph shows the number and percent of publications by field. Fields are based on how the National Library of Medicine (NLM) classifies the publications' journals and might not represent the specific topics of the publications. Note that an individual publication can be assigned to more than one field. As a result, the publication counts in this graph might add up to more than the number of publications the person has written. To see the data as text, click here. This graph shows the number and percent of publications by field. Fields are based on how the National Library of Medicine (NLM) classifies the publications' journals and might not represent the specific topics of the publications. Note that an individual publication can be assigned to more than one field. As a result, the publication counts in this graph might add up to more than the number of publications the person has written. To see the data as text, click here. Start with: newest oldest Include: line numbers double spacing all authors publication IDs George's Networks Concepts (11) Derived automatically from this person's publications. Oceans and Seas Radiometry Light Luminescent Measurements Optics and Photonics Explore _ Co-Authors (5) People in Profiles who have published with this person. Stramski, DariuszUCSD Mookherjea, ShayanUCSD Fainman, YeshaiahuUCSD Alic, NikolaUCSD Jaffe, JulesUCSD Explore _ Similar People (60) People who share similar concepts with this person. Cheung, WilliUCSD Martiny, AdamUCI Levin, LisaUCSD Boone, JohnUC Davis Palczewski, KrzysztofUCI Explore _ Same Department Acampora, Anthony Fullerton, Eric Mercier, Patrick Rudee, M Yi, Sha Search Department _ UCSD Profiles is managed by the UC San Diego Altman Clinical and Translational Research Institute (ACTRI). This site is running Profiles RNS version UCSF-v3.1.0-16-gff1bd585 on PROFILES-PWEB04. We use cookies to operate our website. We also use cookies to analyze our site’s performance and improve your experience on our site. For more information about how we use cookies, please see our Website Terms of Use. Home Contact us Copyright © The Regents of the University of California",
  "content_length": 7692,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:38"
}