{
  "name": "George Wolberg",
  "homepage": "http://www-cs.ccny.cuny.edu/~wolberg",
  "status": "success",
  "content": "George Wolberg George Wolberg Professor of Computer Science City College of New York / CUNY Education | Ad Personam | Research Interests | Publications | Teaching | Google Tech Talks | Useful Links | Contact info Education Ph.D. (CS), Columbia University, 1990 M.E (EE), Cooper Union, 1985 B.E. (EE), Cooper Union, 1985 H.S. Diploma, Stuyvesant High School, 1981 Ad Personam Author of Digital Image Warping, the first comprehensive book on warping/morphing, 1990. Recipient of an NSF Presidential Young Investigator (PYI) Award, 1991 Recipient of the CCNY Outstanding Teaching Award, 1997 Recipient of a NASA Faculty Award for Research (FAR) Grant, 1998 Citations in Who's Who Among America's Teachers (1998), Who's Who in Science and Engineering (2000-2001), Who's Who in American Education (2006), and Who's Who in America (2007) Recipient of the Mayor's Award for Excellence in Science and Technology, 2000 Awarded by Mayor Rudolph Giuliani and The Honorable Bill Green (Chairman, New York Academy of Sciences) at Gracie Mansion, March 8, 2000. Author of shape-based morphing and warping tool in Apple's Shake program. Recipient of the CUNY Certificate of Recognition in 2000, 2003, 2005, 2007, 2010, and 2014. Quoted in Xerox Article, 2004 Quoted in CUNY Matters, Spring 2007, page 9. Research Interests Image Processing: image reconstruction, restoration, enhancement, filtering Computer Graphics: warping, morphing, terrain rendering, visual effects Computer Vision: image registration, scattered data interpolation See abstracts for a glimpse of my work. Full references are given below. My work on 3D reconstruction from laser range scans and photographs have been presented at three recent Google Tech Talks. Teaching Fall 2025 CSc 470 Image Processing Course Fall 2025 CSc 472 Computer Graphics Course Google Tech Talks G. Wolberg, \"PhotoSketch: A Google SketchUp Plugin for Photo-Centric 3D Modeling,\" June 24, 2009 (56 min) G. Wolberg, \"PhotoSketch: A Photo-Centric 3D Modeling Tool,\" June 26, 2007 (56 min) G. Wolberg, \"Multiview Geometry for Texture Mapping 2D Images onto 3D Range Data,\" June 29, 2006 (46 min) Publications Monograph Book Chapters Journals Conferences Conference Course Notes Patents Useful Links Hamming's view on great research Google Tech Talks Bibliographies Compendiums Granting Agencies Libraries Miscellaneous Organizations Research Groups U.S. Patents Contact Information Office: NAC 8/202G Office Hours: Tuesday 1:00 - 2:00 pm Address: Department of Computer Science City College of New York 138th St. at Convent Ave., Rm. R8/206 New York, NY 10031 Tel: (212) 650-6160 Fax: (212) 650-6248 Email: Back to top | Computer Science | School of Engineering | CCNY",
  "content_length": 2698,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:48"
}