{
  "name": "George F. Georgakopoulos",
  "homepage": "https://www.csd.uoc.gr",
  "status": "success",
  "content": "Τμήμα Επιστήμης Υπολογιστών - Πανεπιστήμιο Κρήτης Επικοινωνία Ανακοινώσεις | Νέα Τρίπτυχο του Τμήματος GR EN webmailelearneduportal Το Τμήμα Το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης πρώτο στην Ελλάδα σύμφωνα με την κατάταξη Times Higher Education 2025 AI Hackathon στο CSD Το AI Hackathon, που συνδιοργανώνουν το CSD και η εταιρία Epignosis, θα προσφέρει μια εμπειρία καινοτομίας, συνεργασίας και δημιουργίας λύσεων με AΙ, με έπαθλα αξίας 3000€, 2000€ και 1000€ στις 3 πρώτες ομάδες Προπτυχιακό πρόγραμμα Μάθετε περισσότερα για το ύφος και τις προοπτικές που προσφέρει το πρόγραμμα βασικών σπουδών. Προπτυχιακό πρόγραμμα Μάθετε περισσότερα για το ύφος και τις προοπτικές που προσφέρει το πρόγραμμα βασικών σπουδών. Προπτυχιακό πρόγραμμα Μάθετε περισσότερα για το ύφος και τις προοπτικές που προσφέρει το πρόγραμμα βασικών σπουδών. Προπτυχιακό πρόγραμμα Μάθετε περισσότερα για το ύφος και τις προοπτικές που προσφέρει το πρόγραμμα βασικών σπουδών. Μεταπτυχιακό πρόγραμμα Θεματικές περιοχές με τις οποίες ασχολείται το μεταπτυχιακό πρόγραμμα του τμήματος και τρόποι δήλωσης ενδιαφέροντος. Μεταπτυχιακό πρόγραμμα Θεματικές περιοχές με τις οποίες ασχολείται το μεταπτυχιακό πρόγραμμα του τμήματος και τρόποι δήλωσης ενδιαφέροντος. Καλώς ήλθατε στο Τμήμα Επιστήμης Υπολογιστών Το Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης προσφέρει ένα προπτυχιακό και μεταπτυχιακό πρόγραμμα υψηλής ποιότητας και διεξάγει έρευνα με απτά και σημαντικά αποτελέσματα σε περιοχές σημασίας για την βιομηχανία και την κοινωνία. Οι διδακτικές και ερευνητικές δραστηριότητες του Τμήματος καλύπτουν ένα ευρύ φάσμα βασικών και εφαρμοσμένων περιοχών στην Επιστήμη Υπολογιστών. Οι σπουδές στο Τμήμα Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης προσφέρουν ένα πλήθος δυνατοτήτων, ευκαιριών και πλεονεκτημάτων.  Το προπτυχιακό πρόγραμμα του Τμήματος στοχεύει στο να παρέχει βαθιά κατανόηση των θεμελιωδών στοιχείων της Επιστήμης Υπολογιστών και σημαντικών περιοχών εφαρμογών. Iσορροπεί σε βάθος και εύρος τόσο στις βασικές αρχές όσο και στις περιοχές εφαρμογών, προσδίδει μεγάλη σημασία σε εργαστηριακή και πειραματική εκπαίδευση και εμπειρία, και προωθεί την καλλιέργεια προσωπικών δεξιοτήτων. Το προπτυχιακό πρόγραμμα του Τμήματος συμβαδίζει με διεθνή πρότυπα, λαμβάνει υπ’ όψη του σύγχρονες απόψεις και τάσεις σχετικά με την εκπαίδευση και την έρευνα. Πιστεύουμε οτι προσφέρει την υψηλή ποιότητα που είναι απαραίτητη για την προετοιμασία των μελλοντικών επιστημόνων και σχεδιαστών. Δείτε το Τρίπτυχο του Τμήματος Νέα Οκτώ καθηγητές του Τμήματος Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης περιλαμβάνονται στην παγκόσμια κατάταξη «World’s Top 2% Scientists Network (career data)» #Διακρίσεις 20/10/2025 Πρώτο Συμπόσιο Greeks in AI 2025 με την υποστήριξη του Τμήματος Επιστήμης Υπολογιστών του Πανεπιστημίου Κρήτης #Εκδηλώσεις 11/11/2025 Δύο Best Paper Awards στο 25th IEEE International Conference on BioInformatics and BioEngineering #Διακρίσεις 11/11/2025 Δείτε όλα τα νέα Ανακοινώσεις Ενημέρωση - Ανώτατη διάρκεια Φοίτησης - Εξαίρεση- Παράταση Σπουδών - Διαδικασία διαγραφής Χωρίς Ετικέτα 16/09/2025 Πρόγραμμα εξεταστικής περιόδου Ιανουαρίου 2026 και Πρόγραμμα Εμβόλιμης Εξεταστικής ΧΕΙΜ_2025-26 #Πρόγραμμα 28/11/2025 Διενέργεια αξιολογήσεων προσφερόμενων μαθημάτων από τους φοιτητές - Χειμερινό 2025-26 #Πρόγραμμα #Σπουδές 27/11/2025 Δείτε όλες τις ανακοινώσεις Copyright © 2025, Τμήμα Επιστήμης Υπολογιστών - Συντελεστές - Σχόλια για Ιστότοπο",
  "content_length": 3444,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:28"
}