{
  "name": "George A. Vouros",
  "homepage": "https://www.ds.unipi.gr/en/faculty/georgev-en",
  "status": "success",
  "content": "George Vouros - Department of Digital Systems Skip to content George Vouros Phone +30 210-4142552 Email georgev@unipi.gr Title Professor Office Hours Wednesday 9:00-11:00 Artificial Intelligence Lab http://ai-group.ds.unipi.gr/ai-group/ I.P.S.P. \"Artificial Intelligence\" http://msc-ai.iit.demokritos.gr/ Office 603 (Gr. Lambraki 126) wp_statistics_words_count 1421 Courses Discrete Mathematics — 2nd semester Advanced Artificial Intelligence Topics — 6th semester Ιntelligent Agents and Multiagent Systems — 7th semester Artificial Intelligence — 5th semester Short CV George Vouros is a Professor in the Department of Digital Systems in the University of Piraeus, Greece. His published work and scientific interests are in the areas of Expert Systems (has developed 4 successful systems in critical and complex domains – planning the loading of chemical carriers, ore detection/prediction, diagnosis for activated sludge plant, buffer allocation in production lines- during 1990-1997), Knowledge Engineering, Management, Knowledge Representation and Reasoning with ontologies (engineering, alignment of, learning and population with data from disparate sources, extracting modules from, decentralized reasoning with, semantic data integration), Agents and Multi-Agent Systems (focusing on agent organizations and adaptation, information sharing), Reinforcement and Imitation Learning in single and multiagent complex settings, reinforcement learning explainability and human-centric AI (safe RL with respect to human preferences and constraints, calibration of LLMs for human-agent collaboration, beneficial AI). He has served and serves as program chair, chair and member of organizing or program committees of national and international conferences consistently (AAMAS, ECAI, IJCAI, AAAI, WI, SETN) and as member of steering committees and boards of conferences (EUMASS/EURAMAS, SETN) and workshops (COIN). He has given tutorials and keynote speeches in conferences, and he has organized several workshops in main AI conferences. He served as guest editor in special issues in several AI journals . He is/was senior researcher in more than 25 EU-funded and National research projects. Teaches AI topics since 1998, introducing advanced courses regarding knowledge representation and reasoning, knowledge engineering, agents and multiagent systems and reinforcement learning, at pre and at post graduate levels. He has supervised 13 PhD students on learning and aligning ontologies, reasoning with ontologies, in agents and multiagent systems, reinforcement learning and imitation learning, and also contributed to the supervision of PhDs in machine learning topics. He currently supervises 5 PhD students in the areas of machine learning (online/offline reinforcement learning, imitation learning, time series classification, anomaly detection), knowledge representation and reasoning with ontologies, and ontology alignment. George Vouros has served 4 times from 2008 to 2024 as chair of the Hellenic A.I. Society (EETN, member of EurAI) board. During these times he contributed with the establishment of HAISS (Hellenic AI Summer School), steering (2006-2018) and co-chairing (2004, 2006, 2008, 2010 and 2024) of SETN bi-annual Hellenic AI Conferences with International Participation (proceedings published by Springer Lecture Notes and ACM), enlargement of SETN set of members (mostly with PhD students via grants for conferences/school participation). During the last years (2023-2024) he led the statement of the Hellenic AI Society positions towards a Hellenic Strategy for AI. Serves (2025-) as member of the Hellenic Scientific Section Board on AI (under the auspices of the Hellenic Ministry of Development) He is the founder and director of the inter-institutional MSc on AI between University of Piraeus and NCSR “Demokritos” (2019-today), has founded and heads the AI Lab at the Department of Digital Systems, University of Piraeus (2016-today). Further details concerning his work can be found in https://ai-group.ds.unipi.gr/ai-group/ Publications Publications I) Most Recent Publications in Journals Christos Spatharis, Konstantinos Blekas, George Santipantakis, George Vouros, Modular and Multimodal Generative Adversarial Imitation Learning for Modeling Flight Trajectories, Journal of Air Transportation (JAT), AIAA, 2025, https://doi.org/10.2514/1.D0396 Kravaris, Theocharis, and George A. Vouros. “Transferable aircraft trajectory prediction with generative deep imitation learning.” International Journal of Data Science and Analytics (2025): 1-23 George Vouros, Ioannis Ioannidis, Georgios Santipantakis, Theodore Tranos, Konstantinos Blekas, Marc Melgosa, Xavier Prats, Machine Learning Methods Estimating Flights Hidden Parameters for the Prediction of Flights KPIs, Aerospace Vol 937, 11(11), 2024 Christos Spatharis, Konstantinos Blekas, George Vouros, Modelling Flight Trajectories with Multi-Modal Generative Adversarial Imitation Learning, Appl. Intell., Vol 54, Iss. 11-12, pp 7118-7134, 2024 George Papadopoulos, Alevizos Bastas, George A. Vouros, Ian Crook, Natalia V. Andrienko, Gennady L. Andrienko, Jose Manuel Cordero Garcia, Deep reinforcement learning in service of air traffic controllers to resolve tactical conflicts, Expert Syst. Appl., Vol. 236, pp 121-234, 2024 George A. Vouros, Explainable Deep Reinforcement Learning: State of the Art and Challenges, ACM Computing Surveys, ACM Computing Surveys, 55 (5), pp. 1-39, 2023. Alevizos Bastas, George Vouros, Data-Driven Modelling of Air Traffic Controllers’ Policy to Resolve Conflicts, Aerospace 2023, 10(6), 557, 2023. Spatharis C., Bastas A., Kravaris T., Vouros GA., Blekas K., Garcia Cordero JM.. Hierarchical multiagent reinforcement learning schemes for air traffic management, Neural Computing and Applications, 35 , pp. 147-159, 2023. T. Kravaris, et al., Explaining Deep Reinforcement Learning Decisions in Complex Multiagent settings, Applied Intelligence (APIN), Applied Intelligence, 53 , pp. 4063-4098, 2023,  DOI: 10.1007/s10489-022-03605-1. Gennady L. Andrienko Natalia V. Andrienko, Jose Manuel Cordero Garcia Dirk Hecker George Vouros A. Supporting Visual Exploration of Iterative Job Scheduling. IEEE Comput Graph Appl . , 42 (3), pp. 74-86, 2022. Georgios M. Santipantakis Konstantinos I. Kotis, Apostolos Glenis George Vouros Christos Doulkeridis Akrivi Vlachou A RDF-Gen: generating RDF triples from big data sources, Knowledge and Information Systems, 64 , pp. 2985–3015, 2022 Alevizos Bastas, George Vouros A Data-driven prediction of Air Traffic Controllers reactions to resolving conflicts, Information Sciences, 613, pp. 763-785, 2022. II) Most Recent Publications in Conference Proceedings Georgios Papadopoulos, Andreas Kontogiannis, Foteini Papadopoulou, Chaido Poulianou, Ioannis Koumentis, George Vouros, An Extended Benchmarking of Multi-Agent reinforcement Learning Algorithms in Complex Fully Cooperative Tasks, AAMAS 2025 Natalia Koliou, George Vouros, Ranking Joint Policies in Dynamic Games using Evolutionary Dynamics, AAMAS 2025 Piyabhum Chaysri, Theodore Tranos, George Papadopoulos, Konstantinos Blekas, George Vouros, Efficient Autonomous Marine Vessel Navigation with Safe Deep Reinforcement Learning, IEEE Symposium on Maritime Informatics & Robotics, 2025 Georgios Bouchouras, Pavlos Bitilis, Konstantinos Kotis, George Vouros: LLMs for the Engineering of a Parkinson Disease Monitoring and Alerting Ontology. ESWC Workshops 2024. Andreas Sideras, Konstantinos Bougadiotis, Elias Zavitsanos, Georgios Paliouras, George Vouros, Bankruptcy Prediction: Data Augmentation, LLMs and the Need for Auditor’s Opinion. ICAIF 2024: 453-460. Dimitrios Doumanas, Andreas Soularidis, Konstantinos Kotis, George Vouros, Integrating LLMs in the Engineering of a SET Ontology, AIAI 2024: 230-374. George A. Vouros George Papadopoulos, Alevizos Bastas Jose Manuel Cordero Garcia Ruben Rodrigez Rodrigez, 2022. Automating the Resolution of Flight Conflicts: Deep Reinforcement Learning in Service of Air Traffic Controllers, PAIS 2022, IOS PRess, 2022. Apostolos Glenis, George Vouros, 2022. A SCALE-BOSS: A framework for scalable time-series classification using symbolic representations, SETN 2022. George A. Vouros, Theodore Tranos, Konstantinos Blekas, Georgios Santipantakis, Marc Melgosa, Xavier Prats, 2022. Data-driven estimation of flights’ hidden parameters , SIDs 2022. * Natividad Valle, M Florencia Lema, José Manuel Cordero, Enrique Iglesias , Rubén Rodríguez,  George A. Vouros, Theocharis Kravaris, George Papadopoulos, Alevizos Bastas, Georgios Santipantakis, 2022.   Explainability & Transparency in higher levels of automation in the ATM domain, SIDs 2022. Andreas Kontogiannis, George A. Vouros, 2023. Inherently Interpretable Deep Reinforcement Learning through Online Mimicking. EXTRAAMAS 23 @ AAMAS 2023. Antonio Gracia-Berna, Jose Manuel Cordero, Natividad Valle, Ruben Rodriguez, Gennady Andrienko, Natalia Andrienko, George Vouros, Ian Crook,Sandrine Molton, 2023. Framework for transparent, explainable and trustworthy automation in ATM, DASC 2023. Georgios Santipantakis, Christos Doulkeridis, George Vouros, 2023. An Ontology for Representing and Querying Semantic Trajectories in the Maritime Domain. ADBIS 2023. III) Recent books – Edited volumes George A. Vouros, Gennady L. Andrienko, Christos Doulkeridis, Nikolaos Pelekis, Alexander Artikis, Anne-Laure Jousselme, Cyril Ray, José Manuel Cordero Garcia, David Scarlatti: Big Data Analytics for Time-Critical Mobility Forecasting, From Raw Data to Trajectory-Oriented Mobility Analytics in the Aviation and Maritime Domains. Springer 2020, ISBN 978-3-030-45163-9 Doulkeridis C, Vouros GA, Qu Q, Wang S.  2018.  Mobility Analytics for Spatio-Temporal and Social Data – First International Workshop, MATES 2017, Munich, Germany, September 1, 2017, Revised Selected Papers. . 10731 Επιμέλεια της ελληνικής έκδοσης του τίτλου “SemanticWeb for The Working Ontologist” (D.Allemang, J.Hendler), διαθ",
  "content_length": 12877,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:23"
}