{
  "name": "George P. Efthymoglou",
  "homepage": "https://www.ds.unipi.gr/en/faculty/gefthymo-en",
  "status": "success",
  "content": "George Efthymoglou (Department Chair) - Department of Digital Systems Skip to content George Efthymoglou (Department Chair) Phone +30 210-4142756 Email gefthymo@unipi.gr Title Professor Office Hours Wednesday 11.30 - 13.00 Thursday 12.00 - 13.00 Office 505 (150, Androutsou Str, Piraeus, 18532) Courses Advanced Topics in Wireless Communications — 8th semester Signals and Systems — 3rd semester Digital Communications — 5th semester Digital Signal Processing — 6th semester Brief CV George P. Efthymoglou received the B.S. degree in physics from University of Athens, in 1991 and the M.S. and Ph.D. degrees in electrical engineering from Florida Atlantic University, USA, in 1993 and 1997, respectively. From 1993 to 1997 he worked as a telecommunications consultant and gave lectures on the theory and simulation of digital communication systems to employees of companies such as Motorola, Lucent, Harris Corporation, AT&T, and IBM.  In 1998, he joined the R&D group of Signal Processing Worksystem (SPW) at Cadence Design Systems, where he worked in projects related to modeling, simulation, and performance evaluation of 3G wireless systems. In 2002, he joined the Department of Digital Systems at the University of Piraeus where he is currently a Professor. His research interests are in the area of digital communications with emphasis on the performance of cellular and satellite communication systems. Publications Publications Publications 2010 – 2023 I) JOURNALS V. Aalo, K. P. Peppas and G. P. Efthymoglou, “Performance Analysis of Beacon-Assisted Wireless Powered Communications With Spatially Random Sensors,” in IEEE Access, vol. 11, pp. 12755-12764, 2023, doi: 10.1109/ACCESS.2023.3241755. V. A. Aalo, P. S. Bithas and G. P. Efthymoglou, “Ergodic Capacity of Generalized Fading Channels With Mobility,” in IEEE Open Journal of Vehicular Technology, vol. 3, pp. 15-25, 2022, doi: 10.1109/OJVT.2021.3131321. V. A. Aalo, P. S. Bithas and G. P. Efthymoglou, “On the Impact of User Mobility on the Performance of Wireless Receivers,” in IEEE Access, vol.8, pp. 197300-197311, 2020, doi: 10.1109/ACCESS.2020.3034450. K. P. Peppas, G. P. Efthymoglou and A. G. Kanatas, “Approximations to the Distribution of the Sum of Generalized Normal RVs Using the Moments Matching Method and its Applications in Performance Analysis of Equal Gain Diversity Receivers,” in IEEE Transactions on Vehicular Technology, vol. 67, no. 8, pp. 7230-7241, Aug. 2018, doi: 10.1109/TVT.2018.2830316. P. S. Bithas, G. P. Efthymoglou and A. G. Kanatas, “V2V Cooperative Relaying Communications Under Interference and Outdated CSI,” in IEEE Transactions on Vehicular Technology, vol. 67, no. 4, pp. 3466-3480, April 2018, doi: 10.1109/TVT.2017.2786583. G. P. Efthymoglou, P. S. Bithas, and A. G. Kanatas, “Exact SNR and SIR Analysis in Poisson Wireless Networks,” IET Electronics Letters, vol. 53, iss. 5, pp. 356-358, Mar. 2017. K. P. Peppas, P. S. Bithas, G. P. Efthymoglou, and A. G. Kanatas, “Space Shift Keying Transmission for Intervehicular Communications,” IEEE Trans. on Intelligent Transportation Systems, DOI: 10.1109/TITS.2016.2556082. V. A. Aalo, C. Mukasa, and G. P. Efthymoglou, “Effect of Mobility on the Outage and BER Performances of Digital Transmissions over Nakagami­m Fading Channels,” IEEE Trans. on Vehicular Technology, vol. 65, no. 3, pp. 2715­2721, Apr. 2016. K. P. Peppas, G. P. Efthymoglou, V. A. Aalo, “Performance of CA­-CFAR Detectors in Nonhomogeneous Alpha­Stable Clutter,” IEEE Trans. Aerospace and Electron. Sys. (TAES), vol. 51, no. 3, July 2015. P. S. Bithas, G. P. Efthymoglou, and A. G. Kanatas, “SEP of Rectangular QAM in Composite Fading Channels,” Int. J. Electron. Commun. (AEU), 69 (2015) pp. 246­252. K. P. Peppas, G. P. Efthymoglou, V. A. Aalo, M. Alwakeel, and S. Alwakeel, “Performance Analysis of Energy Detection of Unknown Signals in Gamma Shadowed Ricean Fading Environments with Diversity,” IET on Communications, Sept. 2014, doi: 10.1049/iet­com.2014.0170. V. A. Aalo, K. P. Peppas, G. P. Efthymoglou, M. Alwakeel, and S. Alwakeel, “Serial Amplify­and­Forward Relay Transmission Systems in Nakagami­m Fading Channels with a Poisson Interference Field,” IEEE Trans. on Vehicular Technology, vol. 63, no. 5, pp. 2183­2196, June 2014. V. A. Aalo, G. P. Efthymoglou, T. Soithong, M. Alwakeel, and S. Alwakeel, “Performance Analysis of Multi­hop Amplify­and­Forward Relaying Systems in Rayleigh Fading Channels with a Poisson Interference Field,” IEEE Trans. on Wireless Communications, vol.13, no. 1, pp. 24­35, Jan. 2014. K. P. Peppas, G. P. Efthymoglou, V. A. Aalo, M. Alwakeel, and S. Alwakeel, “Evaluation of Average Bit Error Rate for Wireless Networks with Alpha­Stable Interference,” IET Electronic Letters, doi: 10.1049/el.2013.3231, Nov. 2013. T. Soithong, V. A. Aalo, G. P. Efthymoglou, and C. Chayawan, “Outage Analysis of Multihop Relay Systems in Interference-Limited Nakagami-m Fading Channels,” IEEE Trans. on Vehicular Technology, vol. 61, no. 3, pp. 1451-1457, March 2012. B. Smida, G. Efthymoglou, S. Ghasamasdaveh, and V. Tarokh, “On Effects of Antenna Pointing Accuracy for On-the-Move Satellite Networks,” IEEE Trans. on Vehicular Technology, vol. 60, no. 4, pp. 1677-1686, May 2011. N. Bissias, G. P. Efthymoglou, and V. A. Aalo, “Performance of Dual-Hop Relay Systems with Single Relay Selection in Composite Fading Channels,” International Journal of Electronics and Communications (AEU), 2011, doi:10.1016/j.aeue.2011.04.013. V. A. Aalo and G. P. Efthymoglou, “Effect of Correlated Non-Gaussian Quadratures on the Performance of Binary Modulations,” Journal of Electrical and Computer Engineering, 2011, doi:10.1155/2011/176486. G. P. Efthymoglou, “On the Performance Analysis of Digital Modulations in Generalized-K Fading Channels,” Wireless Personal Communications, 2011, doi:10.1007/s11277-011-0277-8. A. G. Kanatas, A. Kalis, and G. P. Efthymoglou, “A Single Hop Architecture Exploiting Cooperative Beamforming for Wireless Sensor Networks,” Physical Communication, 2011, doi:10.1016/j.phycom.2011.02.003. N. Bissias, G. P. Efthymoglou, and V. A. Aalo, “Performance of Multihop Relay Systems over Composite Fading Channels,” submitted to Journal of Wireless Communications and Mobile Computing, Mar. 2010. P. Bithas, G. P. Efthymoglou, and N. Sagias, “Spectral Efficiency of Adaptive Transmission and Selection Diversity on Generalized Fading Channels,” IET on Communications, vol. 4, iss. 17, pp. 2058-2064, Nov. 2010. A. Kalis, A. G. Kanatas, and G. P. Efthymoglou, “A Co-operative Beamforming Solution for Eliminating Multi-Hop in Wireless Sensor Networks,” Journal on Selected Areas on Communications, vol. 28, no. 7, pp. 1055-1062, Sept. 2010. G. P. Efthymoglou, N. Y. Ermolova, and V. A. Aalo, “Channel Capacity and Average Error Rates in Generalized-K Fading Channels,” IET on Communications, vol. 4, iss. 11, pp. 1364-1372, July 2010. G. P. Efthymoglou, N. Bissias, and V. A. Aalo, “On the Error Analysis of Dual-Hop Amplify-and-Forward Relaying in Generalized-K Fading Channels,” Journal of Electrical and Computer Engineering, June 14, 2010, doi: 10.1155/2010/584594. II) CONFERENCES A. Aalo, P. S. Bithas, and G. P. Efthymoglou, “Beacon-Assisted Wireless Powered Communications in Nakagami-m Fading with Multiple Interferers,” in Proc. VTC-Fall 2023 Hong Kong, to appear. C. Mukasa, V. A. Aalo and G. Efthymoglou, “Performance analysis of a mobile receiver in a field of poisson interferers,” 2017 IEEE 38th Sarnoff Symposium, Newark, NJ, USA, 2017, pp. 1-6, doi: 10.1109/SARNOF.2017.8080398. K. P. Peppas, P. S. Bithas, G. P. Efthymoglou, and A. G. Kanatas, “Spatial Modulation for V2V and V2I Communications in a Multiple Scattering Environment,” in Proc. IEEE GLOBECOM 2016, Washington, DC, 2016, pp. 1-6. C. Mukasa, V. A. Aalo, and G. P. Efthymoglou, “On the Performance of a Dual­hop Network with a Mobile Relay in a Nakagami Fading Environment,” in Proc. CAMAD 2016, Toronto, Canada. C. Mukasa, V. A. Aalo, and G. P. Efthymoglou, “Exact Distributions for Aggregate Interference in Wireless Networks with a Poisson Field of Interferers,” in Proc. WiMob 2016, New York, USA. P. S. Bithas, G. P. Efthymoglou, and A. G. Kanatas, “A Cooperative Relay Selection Scheme in V2V Communications under Interference and Outdated CSI,” in Proc. PIMRC 2016, Valencia, Spain, pp. 1124­1129. K. P. Peppas, G. P. Efthymoglou, and V Aalo, “Exact and Asymptotic Analysis of Dual­Hop AF Systems in Nakagami­m Fading with Rayleigh Interferers,” in Proc. EuCNC 2016, Athens, Greece, pp.1­5. G. P. Efthymoglou, C. Mukasa, and V. A. Aalo, “User Association to Small Cells in the Presence of Nakagami­m Fading and Co­Channel Interference,” in Proc. ICT 2016, Thessaloniki, Greece. P. Bithas, G. P. Efthymoglou, and A. G. Kanatas, “Intervehicular Communication Systems under Co­Channel Interference and Outdated Channel Estimates,” in Proc. VTC­spring 2016, Malaysia. K. P. Peppas, G. P. Efthymoglou, and V Aalo, “Performance Study of Multihop Transmission Schemes in a Binomial Interference Field,” in Proc. IEEE VTC­fall 2015, Boston, USA. P. S. Bithas, A. S. Lioumpas, T. Mouroutis, Y. Stylianou, and G. P. Efthymoglou, “Hybrid threshold­based selection diversity receivers for e_cient resources utilization,” in Proc. IEEE CAMAD 2014, Athens, Greece. P. Bithas, G. P. Efthymoglou, and D. Kalivas, “Outage Probability of Cognitive Relay Networks over Generalized Fading Channels with Interference Constraints,” in Proc. 2014 International Conference on Selected Topics in Mobile and Wireless Networking (MoWNet’2014), Sept. 8­10, Rome, Italy. V. A. Aalo, K. P. Peppas, G. P. Efthymoglou, M. Alwakeel, and S. Alwakeel “Performance of CA­CFAR receivers in Alpha­Stable Clutter,” in Proc. 2013 IEEE International Symposium on Signal Processing and Information Technology (ISSPIT), pp. 130­134, Athens, Greece. K. P. Peppas, G. P. Efthymoglou, V. A. Aalo, M. Alwakeel, and S. Alwakeel “On the Performance Analysis of Energy Detection of Unknown Sig",
  "content_length": 12608,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:39"
}