{
  "name": "George Kollios",
  "homepage": "http://www.cs.bu.edu/~gkollios",
  "status": "success",
  "content": "George Kollios' Home Page George Kollios Professor Department of Computer Science CDS 945 Boston University 665 Commonwealth Avenue Boston, MA, 02215 gkollios@cs.bu.edu Tel: 617-358-1835 Fax: 617-353-6457 [Contact] [Bio] [Research] [Publications] [CV] Research Caution: Scammers have been misusing my name to promote fake “research assistant” positions. These are entirely fraudulent. I do not make employment offers through unsolicited emails. MiDAS Group @ BU Selected Recent Publications L. Qiu, G. Kellaris, N. Mamoulis, K. Nissim, G. Kollios. Doquet: Differentially Oblivious Range and Join Queries with Private Data Structures. PVLDB , Vol 16, No 13, 2023. D. Bogatov, G. Kellaris, G. Kollios, K. Nissim, A. O'Neill. εpsolute: Efficiently Querying Databases While Providing Differential Privacy.CCS, Seoul, South Korea, 2021. D. Bogatov, G. Kollios, L. Reyzin. A Comparative Evaluation of Order-Revealing Encryption Schemes and Secure Range-Query Protocols. PVLDB , Vol 12, No 8, 2019. X. Meng, H. Zhu, G. Kollios. Top-k Query Processing on Encrypted Databases with Strong Security Guarantees. 34th IEEE ICDE 2018. H. Zhu, X. Meng, G. Kollios. NED: An Inter-Graph Node Metric Based On Edit Distance. PVLDB 2017. G. Kellaris, G. Kollios, K. Nissim, A. O'Neill. Generic Attacks on Secure Outsourced Databases. 23nd ACM CCS,Vienna,Austria, October 2016. X. Meng, S. Kamara, K. Nissim, G. Kollios. GRECS: Graph Encryption for Approximate Shortest Distance Queries. 22nd ACM CCS,Denver, Colorado, USA, October 2015. C. Mavroforakis, N. Chenette, A. O'Neill, G. Kollios, and R. Canetti. Modular Order Preserving Encryption, Revisited. 36th ACM SIGMOD, Melbourne, VIC, Australia, June 2015. T. Nykiel, M. Potamias, C. Mishra, G. Kollios, and N. Koudas. Sharing Across Multiple MapReduce Jobs. ACM TODS, Vol. 36, No. 2, May 2014. H. Zhu, X. Meng, G. Kollios. Privacy Preserving Similarity Evaluation of Time Series Data. 17th EDBT, Athens, Greece, March 2014. G. Kollios, M. Potamias, and E. Terzi. Clustering Large Probabilistic Graphs. IEEE TKDE, Vol. 25, No. 2, February 2013. Selected Professional Service Associate Editor: ACM Transactions on Database Systems (TODS), Jan 2008-Jan 2015. IEEE Transactions on Knowledge and Data Engineering, Sept 2006-Dec 2009. General Chair: SSTD 2007. Co-organizer: MobiDE 2012 NetDB 2008 NSF IDM 2004 Workshop. Program Committee Memberships Awards ICDE Influential Paper Award, IEEE ICDE, 2014. Best Paper Award, IEEE ICDE, 2004. National Science Foundation, CAREER Award, 2002. Pearl Brownstein Doctoral Research Award, Polytechnic University, New York, 2001. Current Students and Post-Docs Lina Qiu Graduated Students and ex-Post-Docs Nathan Cordner (PhD 2023)(now at Utah Valley University) Dmytro Bogatov(PhD 2022) (now at Amazon) Georgios Kellaris(Post-Doc 2015-2016)(now at Lerna AI) Xianrui Meng(PhD 2016)(now at Amazon ) Haohan Zhu (PhD 2016)(now at Facebook) Michalis Potamias (PhD 2011)(now at Google) Panagiotis Papapetrou (PhD 2009) (now at Stockholm University) Feifei Li (PhD 2007) (now at University of Utah) Vassilis Athitsos (Post-Doc 2007 ) (now at UT Arlington) Marios Hadjieleftheriou (Post-Doc 2006) (now at Lion Cave Capital, LLC) Baichuan Zhou (MA 2017) Xuan Zhang (MA 2011) (now at XJTU-HKUST) Ching Chang (MA 2006) (now at buuteeq. Inc) Yangui Tao (MA 2004) (now at Google) Bogdan Buricea (MA 2002) (now at IBM Romania) Teaching Past Courses: CS591 K1: S16 - Tools & Techniques for Data Mining and Applications CS460/660: S05, S06, S08, S09, S10, S11, S12, S13, S15, F15, F16 - Introduction to Database Systems CS660: F18, F19, F20 - Graduate Introduction to Database Systems CS 112: F08, F09, F10, F12 - Introduction to Computer Science II (a.k.a. Data Structures and Basic Algorithms) CS565: F07 - Data Mining CS562: F01, F02, F03, F04, F05, F11, F14, S17, S18 - Advanced Database Applications CS560: S01, S02, S03, S04 - Introduction to Database Systems CS113: S02 - Introduction to Computer Science II with Intensive C++ CS591: F00 - Seminar in Databases Links ACM SIGMOD VLDB SIGKDD DBPL Bibliography Mitikas Etoloakarnanias (Map) HR-Net Nobel Prizes Ancient Athens!",
  "content_length": 4134,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:34"
}