{
  "name": "Georg Gottlob",
  "homepage": "https://www.cs.ox.ac.uk/people/georg.gottlob",
  "status": "success",
  "content": "Georg Gottlob | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleEmeritus FacultyGeorg GottlobGeorg Gottlob Professor Georg Gottlob FRSEmeritus ProfessorFellow, St John's CollegeE: georg.gottlob@cs.ox.ac.ukThemes:Data, Knowledge and ActionAlgorithms and Complexity TheoryCompleted Projects:Schema Mappings and Automated Services for Data Integration and ExchangeWolfson Awardmore…InterestsAlgorithms and complexity of problems in the following areas: Graph and hypergraph based  computations and problem decomposition methods, database theory and query languages, semi-structured data processing, constraint satisfaction problems, games and auctions, knowledge representation and reasoning, artificial intelligence, logic programming, finite model theory, computational logic. I am also interested in both theoretical and practical aspects of web data extraction.BiographyI am a Professor of Informatics at Oxford University and a Fellow of St John's College I moved to Oxford from TU Vienna, Austria, in 2006, where I used to work since 1988 as a Professor of Computer Science. I currently still hold an Adjunct Professor position in Vienna, and you may look at my Vienna home page for additional information. From 2006 to 2011 I held the Chair of Computing Science at Oxford University. I then moved to the Chair of Informatics at Oxford, which I have been holding since January 2012. I am a Professorial Fellow of St John's College. I have been helping to build up the Information Systems Group at the Department of Computer Science, University of Oxford. I am now also helping to set up a strong Algorithms group. My current research deals with algorithms and complexity issues related to graphs and hypergraphs, database query languages, and with problem decomposition methods that can be used for recognizing large classes of tractable instances of hard problems. The latter methods have applications in query optimization, in constraint satisfaction, and in game theory and electronic commerce (e.g. winner determination in combinatorial auctions). I am a founding member of the recently established Oxford-Man Institute of Quantitative Finance. See alsoSee my personal Web pages for more information.Selected PublicationsView AllManage publications Democratizing Financial Knowledge Graph Construction by Mining Massive Brokerage Research Reports Zehua Cheng‚ Lianlong Wu‚ Thomas Lukasiewicz‚ Emanuel Sallinger and Georg Gottlob In Maya Ramanath and Themis Palpanas, editors, Proceedings of the Workshops of the EDBT/ICDT 2022 Joint Conference‚ Edinburgh‚ UK‚ March 29‚ 2022. Vol. 3135 of CEUR Workshop Proceedings. CEUR−WS.org. 2022. Details about Democratizing Financial Knowledge Graph Construction by Mining Massive Brokerage Research Reports | BibTeX data for Democratizing Financial Knowledge Graph Construction by Mining Massive Brokerage Research Reports | Download (pdf) of Democratizing Financial Knowledge Graph Construction by Mining Massive Brokerage Research Reports Stable Model Semantics for Guarded Existential Rules and Description Logics: Decidability and Complexity Georg Gottlob‚ André Hernich‚ Clemens Kupke and Thomas Lukasiewicz In Journal of the ACM. Vol. 68. No. 5. Pages 35:1–87. October, 2021. Details about Stable Model Semantics for Guarded Existential Rules and Description Logics: Decidability and Complexity | BibTeX data for Stable Model Semantics for Guarded Existential Rules and Description Logics: Decidability and Complexity | Link to Stable Model Semantics for Guarded Existential Rules and Description Logics: Decidability and Complexity Stable Model Semantics for Guarded Existential Rules and Description Logics Georg Gottlob‚ André Hernich‚ Clemens Kupke and Thomas Lukasiewicz In Chitta Baral and Giuseppe De Giacomo, editors, Proceedings of the 14th International Conference on the Principles of Knowledge Representation and Reasoning‚ KR 2014‚ Vienna‚ Austria‚ July 20−24‚ 2014. Pages 258−267. AAAI Press. July, 2014. Details about Stable Model Semantics for Guarded Existential Rules and Description Logics | BibTeX data for Stable Model Semantics for Guarded Existential Rules and Description Logics | Link to Stable Model Semantics for Guarded Existential Rules and Description Logics ActivitiesAlgorithms At LargeConstraint Satisfaction ProblemsDatabasesCompleted ProjectsSchema Mappings and Automated Services for Data Integration and ExchangeWolfson AwardConstraint Satisfaction for Configuration: Logical Fundamentals, Algorithms, and ComplexityFOXDIADEMExODAPrOQAWDBOntoVADAExtraLyticsRealPDBsRAISON DATAPast StudentsCarlo AttubatoBruno MarnetteMichael MorakStefano OrtonaAndrew SellersStefano  SferrazzaEvgenij ThorstensenCheng WangJulia WiedmannLianlong WuNikola YolovAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 5024,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:18"
}