{
  "name": "Georg Struth",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/georg-struth",
  "status": "success",
  "content": "Professor Georg Struth | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Georg Struth PhD School of Computer Science Professor of Theoretical Computer Science Head of the Foundations of Computation research group g.struth@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Georg Struth School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Google Scholar Personal website Profile Georg studied theoretical physics and philosophy at the University of Heidelberg and obtained a PhD in computer science from the Max Planck Institute for Informatics in Saarbrücken. After a series of positions at German universities he joined the University of Sheffield in 2005. Research interests Georg works mainly on logical and algebraic methods in computer science, formalised mathematics with interactive theorem provers and program verification and correctness.His interests range from foundational work on the axiomatisation and semantics of sequential and concurrent computing systems to applications in the design and implementation of program verification software. Publications Books Moller F & Struth G (2013) Modelling Computing Systems. Springer London. PINCUS G, THIMANN KV & ASTWOOD EB (1964) Preface. Elsevier. Journal articles Furusawa H, Guttmann W & Struth G (2026) On the inner structure of multirelations. Journal of Logical and Algebraic Methods in Programming, 148. Struth G & Ziemiański K (2025) Presheaf automata. Annals of Pure and Applied Logic, 103660-103660. Calk C, Malbos P, Pous D & Struth G (2025) Higher catoids, higher quantales and their correspondences. Applied Categorical Structures, 33(4). View this article in WRRO Furusawa H, Guttmann W & Struth G (2025) Modal algebra of multirelations. Journal of Logic and Computation, 35(3). Huerta y Munive JJ, Foster S, Gleirscher M, Struth G, Pardillo Laursen C & Hickman T (2024) IsaVODEs: interactive verification of cyber-physical systems at scale. Journal of Automated Reasoning, 68(4). View this article in WRRO Malbos P, Massacrier T & Struth G (2024) Single-set cubical categories and their formalisation with a proof assistant. Journal of Automated Reasoning, 68(4). View this article in WRRO Furusawa H, Guttmann W & Struth G (2024) Determinism of multirelations. Journal of Logical and Algebraic Methods in Programming, 139, 100976-100976. Cranch J & Struth G (2024) Interacting Monoidal Structures with Applications in Computing.. CoRR, abs/2411.03821. Fahrenberg U, Johansen C, Struth G & Ziemiański K (2023) Catoids and modal convolution algebras. Algebra universalis, 84(2). Fahrenberg U, Johansen C, Struth G & Ziemiański K (2022) Posets with interfaces as a model for concurrency. Information and Computation, 285, 104914-104914. Huerta y Munive JJ & Struth G (2022) Predicate transformer semantics for hybrid systems: verification components for Isabelle/HOL. Journal of Automated Reasoning, 66(1), 93-139. Cranch J, Doherty S & Struth G (2021) Convolution and concurrency. Mathematical Structures in Computer Science, 31(8), 918-949. Fahrenberg U, Johansen C, Struth G & Ziemiański K (2021) Languages of higher-dimensional automata. Mathematical Structures in Computer Science, 31(5), 575-613. Dongol B, Hayes IJ & Struth G (2021) Convolution algebras: Relational convolution, generalised modalities and incidence algebras. Logical Methods in Computer Science, 17(1), 13:1-13:34. Cranch J, Doherty S & Struth G (2020) Convolution and Concurrency. Höfner P, Pous D & Struth G (2019) Relational and algebraic methods in computer science. Journal of Logical and Algebraic Methods in Programming, 106, 198-199. McIver A, Rabehaja T & Struth G (2018) Schedulers and finishers: On generating and filtering the behaviours of an event structure. Theoretical Computer Science, 744, 97-112. Struth G (2018) Hoare semigroups. Mathematical Structures in Computer Science, 28(6). View this article in WRRO Furusawa H, Kawahara Y, Struth G & Tsumagari N (2017) Kleisli, Parikh and Peleg compositions and liftings for multirelations. Journal of Logical and Algebraic Methods in Programming, 90, 84-101. McIver A, Rabehaja T & Struth G (2016) Probabilistic rely-guarantee calculus. Theoretical Computer Science, 655, 120-134. Furusawa H & Struth G (2016) Taming Multirelations. ACM Transactions on Computational Logic, 17(4), 1-34. Hoare T, van Staden S, Möller B, Struth G & Zhu H (2016) Developments in concurrent Kleene algebra. Journal of Logical and Algebraic Methods in Programming, 85(4), 617-636. Armstrong A, Gomes VBF & Struth G (2016) Building program construction and verification tools from algebraic principles. Formal Aspects of Computing, 28(2), 265-293. Dongol B, Hayes IJ & Struth G (2016) Convolution as a Unifying Concept: Applications in Separation Logic, Interval Calculi, and Concurrency. ACM Transactions on Computational Logic, 17(3). Struth G (2016) On the expressive power of Kleene algebra with domain. Information Processing Letters, 116(4), 284-288. Furusawa H & Struth G (2015) Concurrent Dynamic Algebra. ACM Transactions on Computational Logic, 16(4), 1-38. Cranch J, Laurence MR & Struth G (2015) Completeness results for omega-regular algebras. Journal of Logical and Algebraic Methods in Programming, 84(3), 402-425. Foster S & Struth G (2015) On the Fine-Structure of Regular Algebra. Journal of Automated Reasoning, 54(2), 165-197. Armstrong A, Struth G & Weber T (2014) Programming and automating mathematics in the Tarski–Kleene hierarchy. Journal of Logical and Algebraic Methods in Programming, 83(2), 87-102. Armstrong A, Gomes VBF & Struth G (2014) Kleene Algebra with Tests and Demonic Refinement Algebras.. Arch. Formal Proofs, 2014. Armstrong A, Gomes VBF & Struth G (2014) Algebraic Principles for Rely-Guarantee Style Concurrency Verification Tools, 78-93. Armstrong A, Struth G & Weber T (2013) Kleene Algebra.. Arch. Formal Proofs, 2013. Laurence MR & Struth G (2012) On Completeness of Omega-Regular Algebras. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 7560 LNCS, 179-194. Laurence M & Struth G (2012) Left omega algebras and regular equations. Journal of Logic and Algebraic Programming. Laurence M & Struth G (2012) Left omega algebras and regular equations. Journal of Logic and Algebraic Programming, 81(6), 705-717. Foster S & Struth G (2012) Automated analysis of regular algebra. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 7364 LNAI, 271-285. Guttmann W, Struth G & Weber T (2011) Automating algebraic methods in Isabelle. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6991 LNCS, 617-632. Hoare CAR, Hussain A, Möller B, O'Hearn PW, Petersen RL & Struth G (2011) On locality and the exchange law for concurrent processes. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6901 LNCS, 250-264. Hoare T, Möller B, Struth G & Wehrman I (2011) Concurrent Kleene Algebra and its Foundations. Journal of Logic and Algebraic Programming, 80(6), 266-296. Hoare T, Möller B, Struth G & Wehrman I (2011) Concurrent Kleene Algebra and its Foundations. Journal of Logic and Algebraic Programming. Laurence MR & Struth G (2011) Omega algebras and regular equations. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6663 LNCS, 248-263. Foster S, Struth G & Weber T (2011) Automated engineering of relational and algebraic methods in Isabelle/HOL (invited tutorial). Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6663 LNCS, 52-67. McIver A, Rabehaja TM & Struth G (2011) On probabilistic Kleene algebras, automata and simulations. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6663 LNCS, 264-279. Foster S & Struth G (2011) Integrating an automated theorem prover into Agda. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6617 LNCS, 116-130. Desharnais J & Struth G (2011) Internal axioms for domain semirings. Science of Computer Programming, 76(3), 181-203. Armstrong A, Foster S & Struth G (2011) Dependently Typed Programming based on Automated Theorem Proving. CoRR, abs/1112.3833. Jules D, Moeller B & Georg S (2010) Algebraic Notions of Termination. Logical Methods in Computer Science, Volume 7, Issue 1 (February 11, 2011) lmcs:777. Berghammer R, Moller B & Struth G (2010) Relations and Kleene algebras in computer science. J LOGIC ALGEBR PROGR, 79(8), 705-706. Hofner P & Struth G (2010) Algebraic notions of nontermination: Omega and divergence in idempotent semirings. J LOGIC ALGEBR PROGR, 79(8), 794-811. Hofner P, Struth G & Sutcliffe G (2009) Automated verification of refinement laws. ANN MATH ARTIF INTEL, 55(1-2), 35-62. Schmidt RA & Struth G (2008) Relations and Kleene algebras in computer science. J LOGIC ALGEBR PROGR, 76(1), 1-2. Desharnais J, Moller B & Struth G (2006) Kleene algebra with domain. ACM T COMPUT LOG, 7(4), 798-833. Struth G (2006) Abstract abstract reduction. J LOGIC ALGEBR PROGR, 66(2), 239-270. Desharnais J, Möller B & Struth G (2003) Kleene algebra with domain. CoRR, cs.LO/0310054. Fahrenberg U, Johansen C, Struth G & Ziemiański K () Kleene Theorem for Higher-Dimensional Automata. Logical Methods in Computer Science, Volume 20, Issue 4. Calk C, Goubault E, Malbos P & Struth G () Algebraic coherent confluence and higher globular Kleene algebras. Logical Methods in Computer Science, Volum",
  "content_length": 20687,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:21"
}