{
  "name": "Georgia Gkioxari",
  "homepage": "https://gkioxari.github.io",
  "status": "success",
  "content": "Georgia Gkioxari Research The goal of my work is to design advanced visual perception models that extend the boundaries of current visual capabilities. My research explores new spatial tasks and visual representations that transform images into 2D and 3D outputs. Click on Selected Projects to read about each direction. 2D Perception Selected Projects Mask R-CNN He, Gkioxari, Dollàr & GirshickICCV 2017, Marr Prize Detecting & Recognizing Human-Object InteractionsGkioxari, Girshick, Dollàr & HeCVPR 2018 3D Perception Selected Projects Find Any Part in 3DMa, Yue & GkioxariICCV 2025new! Aligning Text, Images, and 3D Structure Token-by-TokenSahoo, Tibrewal & Gkioxarinew! Omni3D: A Large Benchmark and Model for 3D Object Detection in the Wild Brazil et al, CVPR 2023 Multiview Compressive Coding for 3D ReconstructionWu et al, CVPR 2023 Spatial Reasoning Selected Projects VADAR: Visual Agentic AI for Spatial Reasoning with a Dynamic APIMarsili, Agrawal, Yue & GkioxariCVPR 2025new! News Glab received the Meta LLM Evaluation Research Grant. I was awarded the Okawa Research Grant. I was honored with a Google Faculty Scholar Award 2024. I received an Amazon Research Award. Check out our discussion about AI and its portrayal in Hollywood movies: Sci-Fi to Sci-Fact: Artificial Intelligence on the Big Screen. Glab Members Ziqi Ma Damiano Marsili Aadarsh Sahoo Ilona Demler(primary advisor: Pietro Perona) Sabera Talukder(primary advisor: Yisong Yue) Raphi Kang(primary advisor: Pietro Perona) Alumni Rohun Agrawal (B.S. @ Caltech, 2025 → PhD @ Columbia) Teaching at Caltech EE/CS 148 — Spring 2023: Large Language & Vision Models EE/CS 148 — Spring 2024: Large Language & Vision Models CS 101 — Winter 2024: Learning & 3D Join Us Caltech students (undergrads & grads): If you wish to work with me, please read this information. Prospective post‑docs: Interested in computer vision, 3D, representation learning, or perception? Email me your CV and a short research statement. Prospective PhD students: Apply directly to the CMS department and mention my name in your statement of purpose. No separate email needed.",
  "content_length": 2120,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:48"
}