{
  "name": "George Bebis",
  "homepage": "https://www.cse.unr.edu/~bebis",
  "status": "success",
  "content": "George Bebis' Home Page Dr. George Bebis Foundation Professor Director of Computer Vision Laboratory Department of Computer Science & Engineering University of Nevada (UNR) Reno, NV 89557 Office: (775) 784-6463 FAX: (775) 784-1877 bebis@unr.edu Background Dr. Bebis received the BS degree in Mathematics from the University of Crete in 1987, the MS degree in Computer Science from the University of Crete in 1991, and the PhD degree in Electrical and Computer Engineering from the University of Central Florida in 1996. He is currently a Professor in the Department of Computer Science and Engineering at the University of Nevada, Reno (UNR), and director of UNR's Computer Vision Laboratory (CVL). Prior to joining UNR, he was a Visiting Assistant Professor in the Department of Mathematics and Computer Science at the University of Missouri-St. Louis (UMSL). Research Interests Computer Vision Image Processing Pattern Recognition Machine Learning and Deep Learning Genetic Algorithms Publications Google Scholar Profile Prospective PhD Students I am always looking for self-motivated students to join my research group. Applicants are expected to have graduated from a prestiguous university, possess strong skills both in programming and mathematics, demonstrated research experience in computer vision and machine/deep learning, and strong eagerness to learn. Previous work on projects without significant research contributions is useful but NOT a strong qualification. Research publications (as first author) in quality conferences and journals IS a plus and the MAIN reason you need to contact me directly. Sorry, generic emails will be ignored. Current Involvements 20th International Symposium on Visual Computing (ISVC'25) (Steering Committee Chair), November 17-19, 2025, Las Vegas, Nevada, USA. IEEE International Conference on Image Processing (ICIP'24) (Program Committee Member), October 27-30, 2024, Abu Dhabi, UAE. 19th International Symposium on Visual Computing (ISVC'24) (Steering Committee Chair), October 21-23, 2024, Lake Tahoe, Nevada, USA. International Workshop on Combinatorial Image Analysis (IWCIA24) (Program Committee Member), Fort Lauderdale, January 8-10, 2024. Advanced Concepts for Intelligent Vision Systems (ACIVS) (Program Committee Member), August 21-23, 2023, Kumamoto, Japan. 32nd International Conference on Artificial Neural Networks (ICANN 2023) (Program Committee Member), September 26-29, 2023, Heraklion, Crete, Greece. Teaching Fall 2025 CS474/674 - Image Processing and Interpretation CS791 - Mass Detection in Mammograms Other courses I have taught CS302 - Data Structures CS485/685 - Computer Vision CS 201 - Computer Science I CS791Y - Topics in Computer Vision Introduction to Databases CS480/680 - Computer Graphics CS 477/677 - Analysis of Algorithms CS791S - Neural Networks CS491Q/790Q - SEM: Machine Learning (Biometrics) CS491Y/791Y Mathematical Methods for Computer Vision CS365 - Mathematics of Computer Science CS 479/679 Pattern Recognition CS773C - Machine Intelligence (Object Recogntion) CS773C - Machine Intelligence (Cryptography and Biometrics) CS491Y/691Y - Topics in Computer Vision Department of Computer Science, University of Nevada, Reno, NV 89557 Page created and maintained by: Dr. George Bebis (bebis@cse.unr.edu)",
  "content_length": 3292,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:22"
}