{
  "name": "George D. Stamoulis",
  "homepage": "http://nes.aueb.gr/users/gs.html",
  "status": "success",
  "content": "ï»¿ Network Economics and Services Group - Athens University of Economics and Business Home People Archive Papers By Date By Topic Presentations Others Research Contact us Network Economics and Services Group Athens University of Economics and Business People George D. Stamoulis Contact Info Athens University of Economics and Business, Department of Computer Science, 12 Kodrigtonos St, (3rd floor) Athens, Greece Tel.: +30 210-8203549 E-mail: gstamoul@aueb.gr Full CV: [last updated September 2010] Studies Ph.D., Dept. of Electrical Engineering and Computer Science, Massachusetts Institute of Technology (1991) M.Sc., Dept. of Electrical Engineering and Computer Science, Massachusetts Institute of Technology (1988) Diploma of Electrical Engineer, National Technical University of Athens (1987) Research Interests Economics of telecommunications networks: charging schemes and economic/incentives mechanisms for management of Internet traffic. Broadband access: technologies and applications, regulatory issues, demand analysis, design and cost analysis of access and transport networks. Auction mechanisms for allocation of spectrum, networking capacity and digital resources: design of mechanism, analysis of bidding strategies, design of intelligent agents to support user's bidding. Reputation-based incentives' mechanisms for electronic environments (peer-to-peer systems, e-marketplaces etc.) Telecoms regulation: Relevant markets' analysis, cost-based pricing, Universal Service. Selected Journal Publications \"A Mechanism that provides Incentives for Truthful Feedback in Peer-to-Peer Systems\", T.Papaioannou and G.D.Stamoulis, Special Issue of Electronic Commerce Research Journal [.pdf] \"Reputation-based Estimation of Individual Performance in Collaborative and Competitive Grids\", T.Papaioannou and G.D.Stamoulis, Future Generation Computer Systems vol. 26, no.8, pp. 1327-1335, 2010. [.pdf] \"Economic aspects of building software for service-oriented architectures\", D. Antos, C. Courcoubetis, G. D. Stamoulis, Concurrency and Computation: Practice and Experience, Wiley, vol. 22, no. 10, pp. 2012-2025, 2010 [.pdf] \"An Auction Mechanism for Allocating the Bandwidth of Networks to their Users\", M.P.Dramitinos, G.D.Stamoulis and Courcoubetis -Computer Networks, vol 51, pp. 4979-4996, 2007. [.pdf] Selected Conference Publications \"A Markov model for the evaluation of cache insertion on peer-to-peer performance\", I. Papafili and G. D. Stamoulis - NGI2010, 6th EuroNF Conference on Next Generation Internet, Paris, France, June 2010. [.pdf] Improvement of BitTorrent Performance and Inter-Domain Traffic by Inserting ISP-owned Peers\", I. Papafili, S. Soursos, G. D. Stamoulis - ICQT'09, 6th International Workshop on Internet Charging and QoS Technologies, Aachen, Germany, May 2009. [.pdf] \"Market Mechanisms for Trading Grid Resources\", C. Courcoubetis, M. Dramitinos, T. Rayna, S. Soursos and G. D. Stamoulis - GECON 2008, The 5th International Workshop on Grid Economics and Business Models, Las Palmas, Spain, August 2008. [.pdf] \"Reputation-based Estimation of Individual Performance in Grids\" T.G.Papaioannou and G. D. Stamoulis - IEEE CCGRID 2008, 8th International Symposium on Cluster Computing and the Grid, Lyon, France, May 2008. [.pdf] \"Achieving Honest Ratings with Reputation-based Fines in Electronic Markets\" T.G.Papaioannou and G.D.Stamoulis - IEEE INFOCOM 2008, Phoenix, AZ, USA, April 2008. [.pdf] Copyright © 2012 - All Rights Reserved.",
  "content_length": 3479,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:25"
}