{
  "name": "Geraint Price",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/geraint-price",
  "status": "success",
  "content": "Geraint Price - Royal Holloway Research Portal Geraint Price Dr Senior Lecturer - Teaching Focused, Department of Information Security Phone+44 1784 414160EmailGeraint.Pricerhul.acuk TW20 0EX Research output 9 Chapter 3 Article 2 Working paper 1 Book Research output per year Research output per year User-friendly and certificate-free grid security infrastructureCrampton, J., Lim, H. W., Paterson, K. G. & Price, G., 2011, In: International Journal of Information Security. 10, 3, p. 137-153 17 p.Research output: Contribution to journal › Article › peer-review The Benefits and Drawbacks of Using Electronic IdentitiesPrice, G., 2008, In: Information Security Technical Report. 13, 2Research output: Contribution to journal › Article › peer-review A Certificate-Free Grid Security Infrastructure Supporting Password-Based User AuthenticationCrampton, J., Lim, H. W., Paterson, K. G. & Price, G., 2007, 6th Annual PKI R&D Workshop 2007, Gaithersburg, MD, USA. 17-19 April.Research output: Chapter in Book/Report/Conference proceeding › Chapter Public Key Infrastructures: A Research AgendaPrice, G., 2006, In: Journal of Computer Security. 14, 5Research output: Contribution to journal › Article › peer-review Certificate management using distributed trusted third partiesDent, A. W. & Price, G., 2005, Trusted Computing. Mitchell, C. J. (ed.). IEE Press, p. 251-270 20 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter View all 15 research outputs Projects 2 Finished Projects per year Cyber Security Cartographies: CySeCaColes-Kemp, L. (PI), Cavallaro, L. (CoI), Hancke, G. (CoI), Price, G. (CoI) & Tomlinson, A. (CoI)Eng & Phys Sci Res Council EPSRC12/11/12 → 31/12/16Project: Research Novel Security Architectures &amp; policy management techsPaterson, K. (PI), Crampton, J. (CoI) & Price, G. (CoI)Eng & Phys Sci Res Council EPSRC1/02/06 → 31/01/08Project: Research",
  "content_length": 1895,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:54"
}