{
  "name": "Geraldo Zimbrão",
  "homepage": "http://www.cos.ufrj.br/~zimbrao",
  "status": "success",
  "content": "Zimbrao's Homepage Geraldo Zimbrão Personal homepage. Here you will find information about me  and my work. Last updated on Monday, May 19, 2008. Contents: Professional Data Contact Information Current Projects Publications My C++ Blog: www.zimbrao.com Consulta ao Currículo Lattes (Portuguese) Professional Data: Associate Professor: Computer Science Department/DCC - Federal University of Rio de Janeiro/UFRJ. DSc. Degree: COPPE/UFRJ. Main area: Spatial Databases. Title: \"Avaliação de Junções em Bancos de Dados Espaciais\" (\"Performing Joins in Spatial Databases\"). Advisor: Jano Moreira de Souza. MSc. Degree: Applied Mathematics at the IM/UFRJ. Main Area: Symbolic Computation. Advisor: Severino Collier Coutinho. Graduate course: Information Systems, at the DCC/UFRJ. Back to top Contact Information: Sometimes, you can find me at ICQ# 159963290. Also, you can mail me: zimbrao@cos.ufrj.br Back to top Current Projects: GOA: is an object server. You can find detailed information about GOA here. Dimob: is a project that guides research efforts of Database Group at COPPE. Sorry, this project has not a home page yet. Back to top Publications: Some papers are in English, others are in Portuguese, and some I don't have a PostScrip or PDF Version. To save bandwith, they're gziped. If you preffer, try the flat link - it is a ps-only version (no gzip), or the zip link - it is a zip file. Recent Papers in English \"Polyline Spatial Join Evaluation Using Raster Approximation\", Geraldo Zimbrão, Leonardo Guerreiro Azevedo, Rodrigo Salvador Monteiro, Jano Moreira de Souza. Geoinformatica Journal  Kluwer Academic Publishers, The Netherlands. Accepted to be published in 2003. An Algorithm to Discover Calendar-based Temporal Association Rules with Item's Lifespan Restriction, Geraldo Zimbrão, Jano Moreira de Souza, Victor Teixeira de Almeida, Wanderson Araujo da Silva. Proceedings of The Second Workshop on Temporal Data Mining  The Eighth ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, July 23, 2002 - Edmonton, Alberta, Canada. (download full paper). A Raster Approximation for Processing of Polyline Joins, Geraldo Zimbrão, Jano M. de Souza, Rodrigo S. Monteiro, Leonardo G. Azevedo. Apresentado e Publicado nos anais do XV Simposio Brasileiro de Banco de Dados, João Pessoa, Brasil, outubro de 2000. (download full paper) Efficient Processing of Spatiotemporal Queries in Temporal Geographical Information Systems, Geraldo Zimbrão, Jano. M. Souza, V. T. Almeida, R. C. Wo. Apresentado e Publicado na 6th International Conference on Information Systems, Analysis and Synthesis ISAS 2000. Orlando, Florida, USA  july 2000. (download full paper) \"A Raster Approximation For Processing of Spatial Joins\". Geraldo Zimbrão, Jano Moreira de Souza. Proceedings of 24th International Conference on Very Large Databases - VLDB, New York City, NY, USA, Aug. 24-27, 1998.(download full paper - flat - zip) . Back to top Technical Reports (English and Portuguese) Environmental Knowledge Management and Spatial Business Rules in the SPeCS Collaborative Framework, Geraldo Zimbrão, Carlete Marques, Julia Célia Mercedes Strauch, Rodrigo Salvador Monteiro, Leonardo Guerreiro Azevedo, Jano Moreira de Souza, Sergio Palma J. Medeiros, Gustavo da Rocha B. Pinto. Publicado como Relatório Técnico do Programa de Engenharia de Sistemas, COPPE - UFRJ, No ES-554/01, Junho/2001. Polyline Join Evaluation Using Raster Approximation, Geraldo Zimbrão, Jano M. de Souza, Rodrigo S. Monteiro, Leonardo G. Azevedo. Publicado como Relatório Técnico do Programa de Engenharia de Sistemas, COPPE - UFRJ, No ES-549/01, Maio de 2001. Filtro Raster para Junções de Polilinhas Usando Posições de Entrada e Saída, Geraldo Zimbrão, Jano M. de Souza, Rodrigo S. Monteiro, Leonardo G. Azevedo. Publicado como Relatório Técnico do Programa de Engenharia de Sistemas, COPPE - UFRJ, No ES-544/01, Março de 2001. The Temporal R-Tree, Geraldo Zimbrão, Jano. M. Souza, V. T. Almeida. Publicado como Relatório Técnico do Programa de Engenharia de Sistemas, COPPE - UFRJ, No ES-492/99, Março de 1999 \"Using Raster Approximations For Processing of Spatial Joins\". Geraldo Zimbrão, Jano. M. Souza, Technical. Report, COPPE - UFRJ, No ES-442/97, March, 97. Dowload English version (flat, zip) . \"Uma experiência na avaliação de Sistemas Gerenciadores de Bancos de Dados Orientados para Objetos com o Benchmark 007\". Geraldo Zimbrão, Marta Queirós Mattoso, Relatório Técnico do Programa de Engenharia de Sistemas, COPPE - UFRJ, No ES 333/95, Março de 1995. Download Portuguese Version (flat, zip) . Back to top Recent Papers in Portuguese FalaOCL: Uma Ferramenta para Parafrasear OCL, Geraldo Zimbrão, Jano M. De Souza, Rodrigo Miranda, Francisco G. Pereira Neto. Proceedings of  Tools Session, XVI Brazilian Symposium on Software Engineering, Gramado, RS, Brasil, October, 2002. Processamento Eficiente de Junções Espaçotemporais, Geraldo Zimbrão, Jano M. De Souza, Victor T. de Almeida. Apresentado e Publicado nos anais do XVI Simposio Brasileiro de Banco de Dados, Rio de Janeiro, Brasil, outubro de 2001. (download full paper) ATENAS: Um Sistema Gerenciador de Regras de Negócio, Geraldo Zimbrão, Jano M. De Souza, Victor T. de Almeida, Alberto Sulaiman, Francisco G. Pereira Neto. Apresentado e Publicado na Seção Técnica de Ferramentas do XV Simpósio Brasileiro de Engenharia de Software, Rio de Janeiro, Brasil, outubro de 2001. (download full paper) Regras de Negócios e Workflow: revisão e experiência, Geraldo Zimbrão, Jano M. De Souza, Victor T. de Almeida, Alberto Sulaiman, Francisco G. Pereira Neto. Apresentado e Publicado nos anais do IV International Symposium on Knowledge Management / Document Management, ISKM/DM'2001, Curitiba, Brasil, Agosto/2001.(download full paper) Gestão do Conhecimento Ambiental e Regras de Negócio Espaciais, Geraldo Zimbrão, Carlete Marques, Júlia C. M. Strauch, Rodrigo S. Monteiro, Leonardo G. Azevedo, Jano M. de Souza, Gustavo da Rocha B. Pinto, Sérgio Palma J. Medeiros. Apresentado e Publicado nos anais do IV International Symposium on Knowledge Management / Document Management, ISKM/DM'2001, Curitiba, Brasil, Agosto/2001. Back to top \"Ancient\" Papers \"GOA++: Tecnologia, Implementação e Extensões aos Serviços de Gerência de Objetos\", Geraldo Zimbrão, Renato C. Mauro, Marta L. Q. Mattoso e outros. Proceedings of XII Simpósio Brasileiro de Banco de Dados - Fortaleza, CE, Brasil, Oct., 13-15, 1997. \"Realização Eficiente de Junções Espaciais Utilizando Hash-Join\". Geraldo Zimbrão, Jano Moreira de Souza. Proceedings of XII Simpósio Brasileiro de Banco de Dados - Fortaleza, CE, Brasil, Oct., 13-15, 1997. Portuguese Version (flat, zip) . \"Futuras direções em SIGs: o que os usuários devem esperar dos novos sistemas\". Geraldo Zimbrão, Jano Moreira de Souza. I Semana Estadual de Geoprocessamento - SEGEO, de 7 a 11 de Outubro de 1996, Rio de Janeiro - RJ. Portuguese Version (flat, zip) . \"Critérios de Qualidade para Groupware\". Geraldo Zimbrão, Jano Moreira de Souza e outros. Proceedings of XX Conferência Latino-Americana de Informática, ITESM, México, Setembro de 1994. \"Explorando o Processamento de Consultas no Servidor de Objetos GOA\". Geraldo Zimbrão, Marta L. Queirós Mattoso. Proceedings of IX Simpósio Brasileiro de Banco de Dados, de 05 a 07 de Setembro de 1994, São Carlos - SP. \"Algoritmos eficientes para divisão de números inteiros extremamente longos\". Apresentado no XVII Colóquio Brasileiro de Matemática, de 17 a 22 de Julho de 1991, IMPA, Rio de Janeiro - RJ. \"Sistema FerMat de Computação Algébrica\". Apresentado no I Workshop Em Computação Algébrica, de 10 a 12 de Julho de 1991, LNCC, Rio de Janeiro - RJ. Back to top You are visitor number .",
  "content_length": 7746,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:04"
}