{
  "name": "Gerard Pons-Moll",
  "homepage": "https://virtualhumans.mpi-inf.mpg.de",
  "status": "success",
  "content": "Real Virtual Humans | Real Virtual Humans | University of Tübingen Real Virtual Humans Our research is at the intersection of computer vision, computer graphics and machine learning--we develop computational algorithms to efficiently digitize people and train machines to perceive people from visual data. Current computer vision algorithms can detect people in images or estimate 2D keypoints to a remarkable accuracy. However, people are far more complex–-we effortlessly sense other people's emotional state based on facial expressions and body movements, or we make guesses about people's preferences based on what clothing they wear. Our goal is to build virtual humans that look, move and eventually think like real ones. Prof. Dr. Gerard Pons-MollHeadGoogle ScholarResearchGateSemantic ScholarLinkedInYouTubeX (Twitter)For all enquiries please contact: Gülsen ErgünAdministrative Assistant+ 49 7071 29 70506guelsen.erguen@uni-tuebingen.deNewsGarvita Tiwari defended her PhD thesis October 2025 Congratulations to Garvita Tiwari! She defended her PhD thesis: “Neural Representation and Prior for Controllable 3D Digital Humans”. Great job! Verica Lazova defended her PhD thesis October 2025 Verica Lazova successfully defended her PhD thesis titled \"Editable Representations for 3D Reconstruction and Novel View Synthesis\". Congratulations Verica! SMPL receives Everingham Prize at ICCV'25 October 2025 10 years after its publication, SMPL has been awarded the PAMI Mark Everingham Price at ICCV'25. The prize is given annually to researchers who have made contributions of significant benefit to the computer vision community. Congratulations to Gerard Pons-Moll and his co-authors Michael J. Black, Matthew Loper, Naureen Mahmood, and Javier Romero! 2 papers accepted at ACM SIGGraph Asia'25 October 2025 1) InfiniHuman can create infinite 3D humans with precise control. 2) PhySIC reconstructs physically plausible 3D human-scene interactions from a single image. Congratulations students and collaborators! 2 papers accepted at ICCV'25 June 2025 Topics are: 1) Benchmarking multi-view generation models, 2) Trilateral Diffusion of 3D Humans, Objects and Interactions. Congratulations students and collaborators! Gen-3Diffusion accepted at IEEE TPAMI. June 2025Gen-3Diffusion: Realistic Image-to-3D Generation via 2D & 3D Diffusion Synergy is accepted at TPAMI 2025. Congratulations Yuxuan and collaborators! Workshop on 3D Vision and Graphics March 2025 We are organizing the first ELLIS workshop on 3D Vision and Graphics, March 20,21 in Tübingen, Maria-von-Linden-Straße 6. Feat2GS accepted at CVPR'25. March 2025Feat2GS:Probing Visual Foundation Models with Gaussian Splatting is accepted at CVPR'25 Congratulations students and collaborators! 4 papers accepted at 3DV'25. November 2024 Topics are: 1) Physics Guided Human-object Interaction, 2) Environment-aware Motion Generation from Egocentric View, 3) Tracking Human Object Interaction without Object Templates, and 4) Unifying 3D Human Motion Synthesis and Understanding Congratulations students and collaborators! 2 papers accepted at NeurIPS'24. September 2024 Topics are: 1) Realistic Avatar Creation via Explicit 3D Consistent Diffusion Models, 2) Neural Localizer Fields for Continuous 3D Human Pose and Shape Estimation. Congratulations students and collaborators! Neural ICP for 3D Human Registration at ECCV2024. July 2024Riccardo Marin will present NICP: Neural ICP for 3D Human Registration at Scale at ECCV, Milan, 2024 . 4 papers accepted at CVPR'24. February 2024 Topics are: 1) Template Free Reconstruction of Human-object Interaction with Procedural Interaction Generation, 2) Neural Riemannian Distance Fields for Learning Articulated Pose Priors, 3) Text-to-Texture Synthesis via Deep Convolutional Texture Map Optimization and Physically-Based Rendering and 4) Local Geometry-aware Hand-object Interaction Synthesis. Congratulations students and collaborators! 4 papers accepted at 3DV'24. October 2023 Topics are: 1) Generating Continual Human Motion in Diverse 3D Scenes, 2) Tracking human–object interaction and scene changes from human motion, 3) Controllable Personalized GAN-based Human Head Avatar and 4) A 3D Clothing Segmentation Dataset and Model. Congratulations students and collaborators! Neural Surface Fields for Human Modeling from Monocular Depth at ICCV2023. Aug 2023Yuxuan Xue will present Neural Surface Fields for Human Modeling from Monocular Depth at ICCV, Paris, 2023 . Best Paper Honourable Mention at SCA2023!! Aug 2023 Congratulations to Marc Haberman, Lingjie Liu, Weipeng Xu, Gerard Pons-Moll, Michael Zollhoefer and Christian Theobal for receiving the Best Paper Honorable Mention at SCA'23 for the paper HDHumans: A Hybrid Approach for High-fidelity Digital Humans. 2 papers accepted at CVPR 2023 March 2023 Topics are: 1) Object pop-up: Can we infer 3D objects and their poses from human interactions alone? 2)Visibility Aware Human-Object Interaction Tracking from Single RGB Camera. Bharat Lal Bhatnagar defended his PhD thesis March 2023 Bharat Lal Bhatnagar defended his PhD thesis. His dissertation titled, \"Modelling 3D humans: Pose, Shape, Clothing and Interactions\" received the highest honours (summa cum laude). István Sárándi joins as Postdoctoral Researcher March 2023István Sárándi joins our group from March 2023 as a Postdoctoral researcher. Marie-Curie Postdoctoral Fellowship! March 2023 Congratulations for Riccardo Marin for winning the Marie-Curie Postdoctoral Fellowship. Best Paper Honourable Mention at ECCV2022!! Oct 2022 Congratulations to Garvita Tiwari, Dimitrije Antic, Jan Eric Lenssen, Nikolaos Sarafianos, Tony Tung and Gerard Pons-Moll for receiving the Best Paper Honorable Mention at ECCV'22 for the paper Pose-NDF: Modeling Human Pose Manifolds with Neural Distance Fields. 3 paper awards were given out of 6773 submissions. EG-Italy Best Thesis Award! Oct 2022 Congratulations for Riccardo Marin for winning the EG-Italy Best Thesis Award! His PhD thesis \"Merging, extending and learning representations for 3D shape matching\" exploits, extends, and proposes representations to establish correspondences in the non-rigid domain. ECCV 2022 Outstanding Reviewers Oct 2022 Bharat Lal Bhatnagar and Keyang Zhou are Outstanding Reviewers at ECCV22. Best Paper Honourable Mention at 3DV2022! Sep 2022 Our paper \"Any-Shot GIN: Generalizing Implicit Networks for Reconstructing Novel Classes\" has been selected as the Best Paper Honourable Mention at 3DV2022. Congratulations to all the authors! 7 Papers(2 Orals) accepted at ECCV2022! July 2022 Topics are: 1) Single image reconstruction of humans and objects, 2) Contact-driven human motion synthesis, 3) Learning a pose manifold, 4) Re-targeting human motion to non-human characters, 5) Human-hand interaction, 6) Learning based model fitting and 7) Weakly supervised 3D instance segmentation(Oral). Congratulations students and collaborators! Code, data and papers will be available here. Riccardo Marin will join as Postdoctoral Researcher May 2022Riccardo Marin will join our group from July 2022 as a Postdoctoral researcher and is supported by Humboldt Fellowship. CVPR 2022 Outstanding Reviewers May 2022 Bharat Lal Bhatnagar, Garvita Tiwari, Julian Chibane, Ilya Petrov and Riccardo Marin are Outstanding Reviewers at CVPR22. Facebook / Meta Research Fellowship Award Feb 2022 Congratulations to Julian Chibane to be selected for the prestigious Facebook / Meta research fellowship award for his work on capture and synthesis of 3D scenes and humans! (37 selected out of 2300 applications). Julian is greatful for his advisor Gerard Pons-Moll and collaborators! Julian's fellowship profile: here. Winners of CVPR SHARP'21 Challenges June 2021 Congratulations to Julian Chibane and Gerard Pons-Moll for winning both 3D completion tracks of the CVPR'21 SHARP challenge on 3D shape recovery from partial textured 3D scans. We won with IF-Nets (Chibane et al. CVPR'20) to complete geometry and texture (Chibane et al. ECCV-Workshop'20) plus an effective trick to retain even more detail of the input. In our experience, the model is easy to use, and works really well for a wide variety of 3D completion and reconstruction tasks. Code available here. HPS has been shortlisted for best paper award at CVPR 2021! June 2021 Only 32 papers out of 7000+ submissions have been selected as award candidates. Congratulations! Data and code are now available here!Big News! The group is moving to Tuebingen March 2021 Gerard Pons-Moll accepted a W3 professorship at the University of Tübingen at the department of Computer Science. The group will focus on learning, vision and graphics, with focus on capturing and synthesizing human and object shape apperance, as well as learning digital humans which can move and interact with the 3D world. More infos here. 4 Papers (1 oral) accepted at #CVPR2021! March 2021Pdfs, data and code will be available soon! here! Topics are: 1) HPS: Capturing and self-localizing humans in large 3D scenes with IMUs and a head mounted camera (Oral).2) Stereo Radiance Fields: generalizing NeRF to multiple scenes using classical stereo principles.3) SMPLicit: An implicit based representation of people in layered clothing.4) D-Nerf: generalizing NeRF to dynamic scenes. Congratulations students and collaborators! 2 Papers accepted at NeurIPS (1 Oral, 1 Poster) August 2020 Papers are: -1) LoopReg: Self-supervised Learning of Implicit Surface Correspondences, Pose and Shape for 3D Human Mesh Registration-2) Neural Unsigned Distance Fields for Implicit Function Learning Congrats to the team, and thanks to the reviewers for helping us in improving our papers! Code, data and papers will be available here. Winners of all ECCV SHARP'20 Challenges August 2020 Congratulations to Julian Chibane and Gerard Pons-Moll for winning all tracks of the ECCV'20 SHARP challenge on 3D shape recovery from partial textured 3D scans. We extended IF-Nets (Chibane e",
  "content_length": 16839,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:02"
}