{
  "name": "Gerald Schaefer",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/gerald-schaefer",
  "status": "success",
  "content": "Gerald Schaefer | Computer Science | Loughborough University Dr Gerald Schaefer Senior Lecturer Undergraduate Admissions Research groups and centres Publications +44 (0) 1509 635 707 Send email Office: N.2.04 (Haslegrave Building) Biography Research External activities Responsibilities Gerald Schaefer gained his PhD in Computer Vision from the University of East Anglia. He worked at the Colour & Imaging Institute, University of Derby (1997-1999), in the School of Information Systems, University of East Anglia (2000-2001), in the School of Computing and Informatics at Nottingham Trent University (2001-2006), and in the School of Engineering and Applied Science at Aston University (2006-2009) before joining the Department of Computer Science at Loughborough University where he leads the Vision, Imaging and Autonomous Systems Research Group. His research interests are mainly in the areas of colour image analysis, image retrieval, physics-based vision, medical imaging, and computational intelligence. He has published extensively in these areas with a total publication count exceeding 300. He has been invited as keynote or tutorial speaker to numerous conferences, is the organiser of various international workshops and special sessions at conferences, and the editor of several books, conference proceedings and special journal issues. He is a member of the editorial board of more than 10 international journals, reviews for over 80 journals and served on the programme committee of more than 200 conferences. Research areas Image processing and analysis, in particular image retrieval, and image compression for image database systems (Colour) computer vision, especially physics-based vision Medical imaging Computational intelligence, in particular in the context of computer vision and image processing Colour science Invited keynote and tutorial speaker at numerous conferences Editor of various conference proceedings, special journal issues and books Organiser of various international workshops and conference special sessions Associate editor/editorial board member of more than 10 journals Reviewer for more than 80 journals Programme committee member of more than 200 conferences Leader of the Vision, AI, Autonomous and Human Centred Systems Research Theme Supports Admissions Tutor UK/EU",
  "content_length": 2316,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:56"
}