{
  "name": "Gerardo Canfora",
  "homepage": "http://www.gerardocanfora.net",
  "status": "success",
  "content": "Gerardo CanforaSearch this siteEmbedded FilesSkip to main contentSkip to navigationDietro ogni problemac'è un'opportunitàSono nato a Nocera Inferiore (SA) il 03 Agosto 1963 e sono Professore Ordinario di Ingegneria Informatica presso l’Università degli Studi del Sannio, Benevento. Appassionato educatore e curioso ricercatore, ho sempre ritenuto fondamentale valorizzare l’intreccio tra ricerca ed insegnamento come strumento per la creazione e la trasmissione dei saperi.Sono sposato con Rosa Ferrara, donna forte, paziente e capace di strappare un sorriso anche nelle situazioni più difficili. Io e Rosa abbiamo due magnifici figli, Benedetta, estroversa e determinata, e Mario, silenzioso e pieno di domande.Nella stagione calda amo girare in moto fra le nostre belle colline, con i loro vigneti, i borghi antichi e gli affascinanti panorami; Benedetta, Mario e Rosa sono i miei passeggeri preferiti. Lettera aperta ai candidati alle elezioni regionali 2025Il 23 e 24 novembre in Campania si vota per il rinnovo del Consiglio Regionale e del Presidente della Regione. Partiti e coalizioni hanno messo in moto le loro macchine elettorali e i candidati si stanno presentando ai territori per raccontarsi e raccogliere consensi.I sondaggi si susseguono implacabili, con le immancabili dichiarazioni di netto vantaggio di una parte o di forte recupero dell’altra. Il convitato di pietra di questa competizione elettorale, però, rimane l’astensionismo, che rischia di diventarne il vero protagonista.Per evitare che un numero sempre più alto di elettori decida di non recarsi alle urne è importante far sì che la campagna elettorale si concentri su problemi concreti e delinei soluzioni praticabili e sostenibili. Per questo ho deciso di proporre a tutti i candidati tre temi. Si tratta di problemi che ho maturato nel corso della mia esperienza ultratrentennale di docente universitario presso l’Ateneo del Sannio, e che rivestono, a mio avviso, una grande importanza, ai fini dello sviluppo dell’Università e del territorio.Il primo è il tema dei trasporti. Le evidenti carenze del sistema di trasporto nelle aree interne penalizzano fortemente gli studenti, costringendoli spesso a rinunciare agli studi o a spostarsi verso atenei di altre regioni. Ai candidati vorrei chiedere quali impegni concreti intendono assumere per migliorare i collegamenti da e verso Benevento, così da evitare che i disagi dei trasporti continuino a pesare sulle scelte universitarie degli studenti sanniti, e sui bilanci delle famiglie.Il secondo tema è quello della sostenibilità economico-finanziaria. Il sistema di finanziamento ordinario (FFO) penalizza gli atenei di piccole dimensioni situati in territori svantaggiati, soprattutto a causa del meccanismo del costo standard, che prevede dimensionamenti di riferimento per i Corsi di Laurea in termini di studenti frequentanti. Ai candidati vorrei chiedere di esprimersi sulla possibilità di dare vita a un FFO regionale con l’obiettivo esplicito di riequilibrare gli effetti distorsivi del costo standard e sostenere università, come la nostra, che operano in territori con minore capacità di attrazione.Infine, vorrei porre il tema dell’attrazione di imprese, tema strettamente collegato a quello dell’occupazione giovanile. La nostra Università forma competenze di alto livello, ma troppo spesso queste energie non restano sul territorio. Se vogliamo davvero motivare i giovani qualificati a restare nel Sannio, non basta chiedere alle imprese di venire a produrre: dobbiamo attrarre aziende che progettano, che decidono, che investono in conoscenza. Solo così si può creare un indotto stabile, fatto di competenze, ricerca e innovazione. Ai candidati vorrei chiedere quali politiche pensano di mettere in campo per favorire l’insediamento e la crescita di imprese che vedano nel nostro territorio il cuore decisionale e progettuale.In un momento in cui la sfiducia rischia di prevalere, l’unico modo per ridare senso alla politica è tornare ad ascoltare i territori e parlare di scelte concrete. Il Sannio e le aree interne non hanno bisogno di assistenza o di privilegi, ma di visione.Il Mattino, 9.11.2025Quando i dati diventano bellezza: come la tecnologia riscrive l'arteLa traccia di un breve intervento tenuto in occasione dell'apertura della Stagione 2025/26 dell'Accademia di Santa Sofia. Un piccolo viaggio in un territorio inesplorato e affascinante, il territorio in cui arte e tecnologia si incontrano per dare vita a nuove forme di creatività.1. L’essenza dell’arte: raccontare il proprio tempoIniziamo questo viaggio con una domanda: che cos’è, in fondo, l’arte?Le risposte date a questa semplice domanda sono praticamente infinite, ma per il piccolo viaggio che stiamo intraprendendo prendo a prestito le parole di Paul Klee, quando diceva che “l’arte non riproduce ciò che è visibile, ma rende visibile ciò che non sempre lo è”.Ogni epoca ha avuto la sua arte, e ogni arte ha raccontato il proprio tempo: le sue paure, i suoi sogni, la sua idea di futuro.Nel Medioevo l’arte serviva a rappresentare il divino; nel Rinascimento, a celebrare l’uomo e la prospettiva del mondo; nel Novecento, a raccontare il caos, la velocità, la frammentazione della modernità, la moltiplicazione dei punti di vista.E oggi, nel tempo dei dati, la bellezza si riscrive anche attraverso la tecnologia.2. Arte e scienza: un’alleanza anticaIn realtà, arte e scienza non sono mai state così lontane come spesso crediamo.I pittori del Rinascimento erano anche ottici, chimici, ingegneri: Leonardo studiava il moto dei fluidi e l’anatomia, e questo aveva influenza diretta sulla sua pittura; Piero della Francesca usava la matematica per costruire la prospettiva. Persino i pigmenti, i pennelli, le vernici — tutto era frutto di ricerca tecnica e sperimentazione. E se passiamo alla musica, l’evoluzione degli strumenti ha costantemente cambiato l’arte del comporre: dal clavicembalo al pianoforte, dal violino barocco a quello romantico, dal liuto rinascimentale alle chitarre elettriche, ogni innovazione tecnologica ha aperto nuovi orizzonti creativi, nuove possibilità espressive, nuovi timbri, nuovi virtuosismi.L’arte è sempre stata legata a doppio filo agli strumenti utilizzati per produrla; in fondo, la storia dell’arte è sempre stata anche una storia di strumenti.3. L’arte concettuale e il divorzio dall’artigianatoA un certo punto, però, qualcosa cambia. Nel Novecento si rompe il legame tra arte e abilità manuale, tra arte e artigianato. Non è più solo la mano a creare, ma l’idea.Quando Marcel Duchamp, nel 1917, firma un orinatoio come “R. Mutt” e lo intitola “Fontana”, l’arte diventa concettuale: non conta più l’abilità, ma lo sguardo.Come scriveva Arthur Danto, un oggetto diventa arte quando è collocato nel contesto che lo rende interpretabile come tale.Da quel momento, l’artista non è più solo chi sa fare, ma chi sa vedere. E da lì nasce una nuova libertà: tutto può diventare arte, se riesce a farci pensare o sentire in modo diverso.4. L’arte data-driven: l’evoluzione naturale del concettualeOggi viviamo in un mondo dove ogni gesto, ogni movimento, ogni decisione lascia una traccia digitale.Queste tracce — i dati — sono diventate nuova materia prima della creatività. L’arte data-driven è, in fondo, un’estensione dell’arte concettuale: invece di partire da un oggetto, parte da un flusso di informazioni.È un modo per chiedersi: “guardiamo cosa raccontano i numeri, non con la mente del matematico, ma con gli occhi dell’artista”.Le nostre vite digitali — i passi contati dallo smartphone, le foto condivise, le temperature della città, i dati del traffico o dell’inquinamento — diventano pigmenti immateriali, che l’artista rielabora per restituirci un ritratto nuovo del mondo, del tempo che viviamo.5. Esempi: quando i dati diventano poesia visivaDue esempi fra tanti.L’artista Refik Anadol trasforma milioni di immagini in flussi visivi generati dall’intelligenza artificiale: è come se la macchina sognasse, e noi potessimo osservare i suoi sogni.E poi ci sono installazioni come quelle di Rafael Lozano-Hemmer, che usano i battiti cardiaci, o temperature corporee, dei visitatori per creare giochi di luce e suono, rendendo letteralmente “visibile” la vita di chi guarda.Esempi in cui la tecnologia non è fredda, ma vibrante: dà voce a ciò che normalmente resta invisibile. I numeri diventano emozione.6. Le prospettive: la bellezza che nasce dall’incontroCosa ci insegna tutto questo? Che la bellezza può nascere anche dai dati, se c’è uno sguardo capace di trasformarli in emozione.L’arte data-driven ci mostra un futuro in cui l’umano e il tecnologico non si escludono, né si contrappongono, ma si amplificano a vicenda.È un invito a non temere le macchine, ma a usarle come nuovi strumenti per raccontare chi siamo. Perché, come sempre, l’arte serve a questo: a dare forma all’invisibile, con i mezzi del proprio tempo.E oggi, il nostro tempo parla in linguaggio digitale. Sta a noi decidere se quel linguaggio può ancora commuovere.Questo dialogo tra cultura, arte e tecnologia è lo spirito stesso di SHerIL – Samnium Heritage Innovation Lab, il nuovo centro multidisciplinare e interdipartimentale creato all’Università del Sannio.Un luogo dove scienza e umanesimo si incontrano per generare futuro.31.10.2025Gentile, la memoria e il rischio della riconciliazione facileIl mio intervento in occasione della presentazione del libro di lessandro Campi “Una esecuzione memorabile - Giovanni Gentile, il fascismo e la memoria della guerra civile”.Il libro ci riporta a una vicenda dolorosa, l’uccisione di Giovanni Gentile il 15 aprile 1944, cercando di comprendere il contesto in cui l’esecuzione è maturata e ciò che essa ha significato, e continua a significare, per la memoria collettiva del Paese. Una morte che già nel titolo del libro è definita memorabile, e che nel testo viene descritta come inevitabile, necessaria, annunciata, attesa, esemplare e paradigmatica.Il libro di Campi, con il suo stile sobrio e analitico,",
  "content_length": 31378,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:03"
}