{
  "name": "Gerald J. Sussman",
  "homepage": "https://www.csail.mit.edu/user/1512",
  "status": "success",
  "content": "Gerald Sussman | MIT CSAIL Skip to main content PI Core/Dual Gerald Sussman Professor Email gjs@csail.mit.edu Phone 253-5874 Room 32/ 32-G508/ G514 Gerald Jay Sussman is the Panasonic (formerly Matsushita) Professor of Electrical Engineering at the Massachusetts Institute of Technology.  He received the S.B. and the Ph.D. degrees in mathematics from the  Massachusetts Institute of Technology in 1968 and 1973, respectively.  He has been involved in artificial intelligence research at  M.I.T. since 1964.  His research has centered on understanding the  problem-solving strategies used by scientists and engineers, with the  goals of automating parts of the process and formalizing it to provide more effective methods of science and engineering education.  Sussman has also worked in computer languages, in computer architecture and in VLSI design. Sussman is a coauthor (with Hal Abelson and Julie Sussman) of the introductory computer science textbook used at M.I.T. for 23 years.  The textbook, ``Structure and Interpretation of Computer Programs,'' has been translated into French, German, Chinese, Polish, Japanese, and Korean.  As a result of this and other contributions to computer-science education, Sussman received the ACM's Karl Karlstrom Outstanding Educator Award in 1990, and the Amar G. Bose award for teaching in 1992. Sussman's contributions to Artificial Intelligence include problem solving by debugging almost-right plans, propagation of constraints applied to electrical circuit analysis and synthesis, dependency-based explanation and dependency-based backtracking, and various language structures for expressing problem-solving strategies.  Sussman and his former student Guy L. Steele Jr. invented the Scheme programming language in 1975. Sussman saw that Artificial Intelligence ideas can be applied to computer-aided design.  Sussman developed, with his graduate students, sophisticated computer-aided design tools for VLSI.  Steele made the first Scheme chips in 1978.  These ideas and the AI-based CAD technology to support them were further developed in the Scheme chips of 1979 and 1981.  The technique and experience developed was then used to design other special-purpose computers.  Sussman was the principal designer of the Digital Orrery, a machine designed to do high-precision integrations for orbital-mechanics experiments.  The Orrery was designed and built by a few people in a few months, using AI-based simulation and compilation tools. Using the Digital Orrery, Sussman worked with Jack Wisdom to discover numerical evidence for chaotic motions in the outer planets.  The Digital Orrery is now retired at the Smithsonian Institution in Washington DC.  Sussman was also the lead designer of the Supercomputer Toolkit, another multiprocessor computer optimized for evolving systems of ordinary differential equations.  The Supercomputer Toolkit was used by Sussman and Wisdom to confirm and extend the discoveries made with the Digital Orrery to include the entire planetary system. Sussman has pioneered the use of computational descriptions to communicate methodological ideas in teaching subjects in Electrical Circuits and in Signals and Systems. Over the past decades Sussman and Wisdom have developed a subject that uses computational techniques to communicate a deeper understanding of advanced Classical Mechanics. Computational algorithms are used to express the methods used in the analysis of dynamical phenomena. Expressing the methods in a computer language forces them to be unambiguous and computationally effective. Students are expected to read our programs and to extend them and to write new ones. The task of formulating a method as a computer-executable program and debugging that program is a powerful exercise in the learning process. Also, once formalized procedurally, a mathematical idea becomes a tool that can be used directly to compute results. Sussman and Wisdom have produced a textbook, ``Structure and Interpretation of Classical Mechanics,'' and a monograph, ``Functional Differential Geometry,'' to capture these ideas.  The textbook is now in a second edition. Sussman has been involved in the engineering of both amateur and professional telescopes.  He redesigned and rebuilt the mirror-support system for the 2.4m Hiltner telescope on Kitt Peak, and he helped build and (with Julie Sussman) wrote the prototype software for the guider-probe controllers for the 6.5m Magellan telescopes on Las Campanas in Chile. Sussman was involved with his former student Tom Knight in the founding of the field of Synthetic Biology, and he was a teacher in the first class of the IGEM (International Genetically Engineered Machine) competition. Sussman is a life fellow of the Institute of Electrical and Electronics Engineers (IEEE).  He is a member of the National Academy of Engineering (NAE), a fellow of the American Association for Artificial Intelligence (AAAI), a fellow of the Association for Computing Machinery (ACM), a fellow of the American Academy of Arts and Sciences, and a fellow of the American Association for the Advancement of Science (AAAS).  He has been a bonded locksmith.  He is a life member of the American Watchmakers-Clockmakers Institute (AWCI), a member of the Massachusetts Watchmakers-ClockmakersAssociation, a member of the Amateur Telescope Makers of Boston (ATMOB), and a member of the American Radio Relay League (ARRL). Related Links Personally maintained Website Last updated Feb 05 '24 Research Areas AI & ML Computer Architecture Programming Languages & Software Engineering Impact Areas Education Internet of Things Transportation Wireless Related Links Personally maintained Website Projects Project The Car Can Explain! Decentralized Information Group (DIG) Cognitive AI Community of Research Computing & Society Community of Research Developing techniques to allow self-driving cars and other AI-driven systems to explain behaviors and failures. Gerald Sussman Lalana Kagal Leads Gerald Sussman Lalana Kagal Research Areas AI & ML Human-Computer Interaction Systems & Networking Impact Areas Cybersecurity Health Care Transportation Gerald Sussman Lalana Kagal Centers Research Center Internet Policy Research Initiative Our mission is to work with policy makers and cybersecurity technologists to increase the trustworthiness and effectiveness of interconnected digital systems. +1 Leads Daniel Weitzner Hal Abelson David Clark Lalana Kagal Karen Sollins Gerald Sussman Research Areas AI & ML Human-Computer Interaction Security & Cryptography Impact Areas Big Data Cybersecurity Internet of Things Transportation Lead Daniel Weitzner Hal Abelson David Clark Lalana Kagal Karen Sollins Gerald Sussman +1 Groups Community of Research Computing & Society Community of Research This community is interested in understanding and affecting the interaction between computing systems and society through engineering, computer science and public policy research, education, and public engagement. +6 Daniel Weitzner Leads Daniel Weitzner Research Areas Algorithms & Theory AI & ML Human-Computer Interaction Security & Cryptography Systems & Networking Impact Areas Big Data Cybersecurity Health Care Internet of Things Transportation Wireless Lead Daniel Weitzner +6 Daniel Weitzner Community of Research Cognitive AI Community of Research This CoR aims to develop AI technology that synthesizes symbolic reasoning, probabilistic reasoning for dealing with uncertainty in the world, and statistical methods for extracting and exploiting regularities in the world, into an integrated picture of intelligence that is informed by computational insights and by cognitive science. +5 Gerald Sussman Leads Gerald Sussman Research Areas Human-Computer Interaction Robotics Security & Cryptography Systems & Networking Impact Areas Cybersecurity Education Lead Gerald Sussman +5 Gerald Sussman Research Group Sussman Lab We focus on understanding the problem-solving strategies used by scientists and engineers, with the goals of automating parts of the process and formalizing educational methods. Gerald Sussman Leads Gerald Sussman Research Areas AI & ML Programming Languages & Software Engineering Systems & Networking Impact Areas Education Manufacturing Lead Gerald Sussman Gerald Sussman",
  "content_length": 8298,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:57"
}