{
  "name": "Gerald Weber",
  "homepage": "https://www.cs.auckland.ac.nz/~gerald",
  "status": "success",
  "content": "Gerald Weber's Home Page Gerald Weber Senior Lecturer Department of Computer Science The University of Auckland Office: Building 303, Room 527 38 Princes Street phone: + 64 9 373-7599 x 88114 fax: + 64 9 373-7453 email: gerald@cs.auckland.ac.nz Office Hours: I have an open office, just drop by. Postal Address: Dr Gerald Weber Department of Computer Science The University of Auckland Private Bag 92019 Auckland 1020 New Zealand Research Interests in Computer Science Software engineering models and tools Human-Computer Interaction, Computer-Supported Cooperative Work Databases, Enterprise Systems, Semantic Web Sustainable Computing Computational Geometry, Theory of Computation websurfing with gaze With actigaze™ you can click links in your web browser just using your eyes. www.actigaze.com Listen to the actigaze presentation on BBC Click, BBC World Services (about 13 minutes into the podcast). Recent Best Paper Awards Sindhwani, S., Lutteroth, C., & Weber, G. (2019). ReType: Quick Text Editing with Keyboard and Gaze. Paper presented at CHI Conference on Human Factors in Computing Systems (CHI), Glasgow, SCOTLAND. 4 May - 9 May 2019. CHI 2019: PROCEEDINGS OF THE 2019 CHI CONFERENCE ON HUMAN FACTORS IN COMPUTING SYSTEMS. (pp. 13). 10.1145/3290605.3300433 Other University of Auckland co-authors: Shyamli Sindhwani Wen, E., & Weber, G. (2018). SwiftLaTeX-Exploring Web-based True WYSIWYG Editing for Digital Publishing. Paper presented at 18th ACM Symposium on Document Engineering (DocEng), Halifax, CANADA. 28 August - 31 August 2018. PROCEEDINGS OF THE ACM SYMPOSIUM ON DOCUMENT ENGINEERING (DOCENG 2018). (pp. 10). 10.1145/3209280.3209522 Form-Oriented Analysis A New Methodology to Model Form-Based Applications Dirk Draheim, Gerald Weber Springer Verlag, 2004 ISBN: 3-540-20593-4 www.formcharts.org About this book: Form-based applications range from simple Web shops to complex enterprise resource planning systems. Draheim and Weber adapt well-established basic modeling techniques in a novel way to achieve a modeling framework optimized for this broad application domain. They introduce new modeling artifacts, such as page diagrams and form storyboards, and separate dialogue patterns to allow for reuse. In their implementation they have developed new constructs such as typed server pages, and tools for forward and reverse engineering of presentation layers. The methodology is explained using an online bookshop as a running example, in which the user can experience the modeling concepts in action. The combination of theoretical achievements and hands-on practical advice and tools makes this book a reference work for both researchers in the areas of software architectures and submit-response style user interfaces, and professionals designing and developing such applications. More information and additional material is available online. Postdoctoral Fellow Johannes Müller PhD Students Alhanof Almutari Asma Shakil Behzad Farokhi Elliott Wen Ganesh Selvaraj Jacob Bellamy-McIntyre Shyamli Sindhwani Graduates Dr Christof Lutteroth Dr M. Asif Naem Dr Clemens Zeidler Dr Noreen Jamil Dr A. Moiz Penkar Ganesh Selvaraj Mao Cai Jacob Bellamy-McIntyre Danver Braganza Guanyu Sun Sheng Tian Zhihui Deng Lian Hoy Lee Ted Yeung Lung-Chen Lee Yashasvi A. Chakravarthi Zheng Yuan Luo Han Zhang Dong Zhang If you are interested in starting a project or thesis under my supervision, please feel free to ask me. Projects Please visit the projects on: actigaze  - a fast and accurate gaze-only interaction method Auckland Interface Model www.formcharts.org Resources Lutteroth, C., & Weber, G. Academic Writing Guide. Activities Information Director of the Proceedings of the VLDB Endowment. General Chair EDOC 2009, Auckland, New Zealand. Program comittee co-Chair EDOC 2008. Program comittee co-Chair AUIC 2009. Proceedings Chair VLDB 2008, Auckland, New Zealand. Program comittee co-Chair AUIC 2008. Program comittee co-Chair TEAA 2006. Program comittee co-Chair VLDB-TEAA 2005. Program comittee member of DEXA 2013-2014, EDOC2011, EDOC 2010, AUIC 2010, AUIC 2009, ASWEC 2008, ADC 2009, EDOC 2007, ADC2006, HSI 2005, CHINZ 2005, ADC2005, APWeb05. Partners in Industry ClubGroups XSol AARN Innovation Peace Software New Zealand Ltd ECONZ Ltd Navman NZ Ltd Publications Sindhwani, S., Lutteroth, C., & Weber, G. (2019). ReType: Quick Text Editing with Keyboard and Gaze. Paper presented at CHI Conference on Human Factors in Computing Systems (CHI), Glasgow, SCOTLAND. 4 May - 9 May 2019. CHI 2019: PROCEEDINGS OF THE 2019 CHI CONFERENCE ON HUMAN FACTORS IN COMPUTING SYSTEMS. (pp. 13). 10.1145/3290605.3300433 Other University of Auckland co-authors: Shyamli Sindhwani Shakil, A., Lutteroth, C., & Weber, G. (2019). CodeGazer: Making Code Navigation Easy and Natural with Gaze Input. Paper presented at CHI Conference on Human Factors in Computing Systems (CHI), Glasgow, SCOTLAND. 4 May - 9 May 2019. CHI 2019: PROCEEDINGS OF THE 2019 CHI CONFERENCE ON HUMAN FACTORS IN COMPUTING SYSTEMS. (pp. 12). 10.1145/3290605.3300306 Andersen, B. J. H., Davis, A. T. A., Weber, G., & Wunsche, B. C. (2019). Immersion or Diversion: Does Virtual Reality Make Data Visualisation More Effective?. Paper presented at 18th Annual International Conference on Electronics, Information, and Communication (ICEIC), Inst Elect & Informat Engineers, Auckland, NEW ZEALAND. 22 January - 25 January 2019. 2019 INTERNATIONAL CONFERENCE ON ELECTRONICS, INFORMATION, AND COMMUNICATION (ICEIC). (pp. 7). Other University of Auckland co-authors: Burkhard Wuensche Wen, E., & Weber, G. (2018). Going Grey: Exploring the Potential of Electrophoretic Displays. Paper presented at ACM International Joint Conference on Pervasive and Ubiquitous Computing / ACM International Symposium on Wearable Computers (UbiComp/ISWC), Google, Singapore, SINGAPORE. 8 October - 12 October 2018. PROCEEDINGS OF THE 2018 ACM INTERNATIONAL JOINT CONFERENCE ON PERVASIVE AND UBIQUITOUS COMPUTING AND PROCEEDINGS OF THE 2018 ACM INTERNATIONAL SYMPOSIUM ON WEARABLE COMPUTERS (UBICOMP/ISWC'18 ADJUNCT). (pp. 4). 10.1145/3267305.3277812 Wen, E., & Weber, G. (2018). SwiftLaTeX-Exploring Web-based True WYSIWYG Editing for Digital Publishing. Paper presented at 18th ACM Symposium on Document Engineering (DocEng), Halifax, CANADA. 28 August - 31 August 2018. PROCEEDINGS OF THE ACM SYMPOSIUM ON DOCUMENT ENGINEERING (DOCENG 2018). (pp. 10). 10.1145/3209280.3209522 Naeem, M. A., Linggawa, I. W. S., Mughal, A. A., Lutteroth, C., & Weber, G. (2018). A Smart Email Client Prototype for Effective Reuse of Past Replies. IEEE ACCESS, 6, 69453-69471. 10.1109/ACCESS.2018.2878523 Naeem, M. A., Weber, G., & Lutteroth, C. (2018). A memory-optimal many-to-many semi-stream join. Distributed and Parallel Databases10.1007/s10619-018-7247-z Zeidler, C., Weber, G., Gavryushkin, A., & Lutteroth, C. (2017). Tiling algebra for constraint-based layout editing. Journal of Logical and Algebraic Methods in Programming, 89, 67-94. 10.1016/j.jlamp.2017.01.004URL: http://hdl.handle.net/2292/40623 M. Asif Naeem, Gerald Weber, Christof Lutteroth,Optimising Queue-based Semi-Stream Joins by Introducing a Queue of Frequent Pages, ADC 2016, Sydney. Lutteroth, C., Penkar, A. M., & Weber, G. (2015). Gaze vs. Mouse: A Fast and Accurate Gaze-Only Click Alternative. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 385-394. Yeoh KN, Lutteroth C and Weber G (2015). Eyes and Keys: An Evaluation of Click Alternatives Combining Gaze and Keyboard. In Proceedings of the 15th IFIP TC 13 International Conference on Human-Computer Interaction (INTERACT), 17 pages. Naeem, M. A., Weber, G., Dobbie, G., & Lutteroth, C. (2014). Optimizing Queue-based Semi-Stream Joins with Indexed Master Data. Proceedings of the 16th International Conference on Data Warehousing and Knowledge Discovery (DaWaK). Zeidler, C., Lutteroth, C., & Weber, G. (2013). An evaluation of advanced user interface customization. Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration, OzCHI 2013. Weber, G. A. N., Lutteroth, C. & Penkar, A. M., (2013). Gaze-controlled interface method and system. WO2015030607A9. Naeem, M. A., Dobbie, G., & Weber, G. (2013). Efficient processing of streaming updates with archived master data in near-real-time data warehousing. Knowledge and Information Systems, 1-23. Zeidler, C., Lutteroth, C., Stuerzlinger, W., & Weber, G. (2013). Evaluating direct manipulation operations for constraint-based layout. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Penkar, A. M., Lutteroth, C., & Weber, G. (2013). Eyes only: Navigating hypertext with gaze. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Zeidler, C., Lutteroth, C., & Weber, G. (2013). An evaluation of stacking and tiling features within the traditional desktop metaphor. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Naeem, M. A., Weber, G., Dobbie, G., & Lutteroth, C. (2013). SSCJ: A semi-stream cache join using a front-stage cache module. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). M. Asif Naeem, Gillian Dobbie, Gerald Weber. Optimised X-HYBRIDJOIN for Near-Real-Time Data Warehousing, ADC 2012, Melbourne. Carlo Bueno, Sarah Crossland, Christof Lutteroth, Gerald Weber. Rewriting History: More Power to Creative People. OZCHI 2011, Canberra. Christof Lutteroth, Sheng Tian, Gerald Weber. Tuple Space for Mashups. OZCHI 2011, Canberra. Jacob Bellamy-McIntyre, Christof Lutteroth, Gerald Weber. OpenID and the Enterprise: A Model-based Analysis of Single Sign-On Authentication. In: Procee",
  "content_length": 21947,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:58"
}