{
  "name": "Gerald B. Baumgartner",
  "homepage": "https://www.lsu.edu/eng/cse/people/faculty/baumgartner.php",
  "status": "success",
  "content": "Gerald Baumgartner | Computer Science & Engineering Skip to main content Gerald Baumgartner Associate Professor Contact gb@lsu.eduOffice 3272DPatrick F. Taylor Hall Educational Background Ph.D. in Computer Science, Purdue University, 1996 M.S. in Computer Science, Purdue University, 1992 Dipl.-Ing. in Computer Science, Linz University, 1988 Visit Website CSC 1351: Introduction to Computer Science II for Majors CSC 4101: Programming Languages CSC 4351: Compiler Construction CSC 7101: Programming Language Structures CSC 7351: Advanced Compiler Design Theory Cloud Computing and Desktop Grids Software Testing Tools Social Media Data Mining Embedded Systems Programming Tools Compiler Optimization Design and Implementation of Domain-Specific Languages Object-Oriented Languages Mithila, S. P., Franz, P., & Baumgartner, G. (2023, February). Scheduling Many-Task Applications on Multi-clouds and Hybrid Clouds. In Workshop on Asynchronous Many-Task Systems and Applications (PP. 65-78). Cham: Springer Nature Switzerland. Peterson, B., Fazlalizadeh, Y., Baumgartner, G., & Wang, Q. (2018). A vector-scheduling approach for running man-task applications in the cloud. In Cloud Computing--Cloud 2018: 11th International Conference, Held as Part of the Services Conference Federation, SCF 2018, Seattle, WA, USA, June 25-30, 2018, Proceedings 11 (pp. 3-19). Springer International Publishing. Peterson, B., Baumgartner, G., & Wang, Q. (2017). A decentralized scheduling framework for many-task scientific computing in a hybrid cloud. STCC, 5(1), 1-13. Lu, Q., Gao, X., Krishnamoorthy, S., Baumgartner, G., Ramanujam, J., & Sadayappan, P. (2012). Empirical performance model-driven data layout optimization and library call selection for tensor contraction expressions. Journal of Parallel and Distributed Computing, 72(3), 338-352. Lam, C. C., Rauber, T., Baumgartner, G., Cociorva, D., & Sadayappan, P. (2011). Memory-optimal evaluation of expression trees involving large objects. Computer Languages, Systems & Structures, 37(2), 63-75 Hartono, A., Lu, Q., Henretty, T., Krishnamoorthy, S., Zhang, H., Baumgartner, G., ... & Sadayappan, P. (2009). Performance optimization of tensor contraction expressions for many-body methods in quantum chemistry. The Journal of Physical Chemistry A, 113(45), 12715-12723. Chakravarti, A. J., Baumgartner, G., & Lauria, M. (2006). Self-organizing scheduling on the organic grid. The International Journal of High Performance Computing Applications, 20(1), 115-130. Auer, A. A., Baumgartner, G., Bernholdt, D. E., Bibireata, A., Choppella, V., Cociorva, D., ... & Sibiryakov, A. (2006). Automatic code generation for many-body electronic structure methods: the tensor contraction engine. Molecular Physics, 104(2), 211-228. Baumgartner, G., Auer, A., Bernholdt, D. E., Bibireata, A., Choppella, V., Cociorva, D., ... & Sibiryakov, A. (2005). Synthesis of high-performance parallel programs for a class of ab initio quantum chemistry models. Proceedings of the IEEE, 93(2), 276-292. Chakravarti, A. J., Baumgartner, G., & Lauria, M. (2005). The organic grid: Self-organizing computation on a peer-to-peer network. IEEE Transactions on Systems, Man, and Cybernetics-Part A: Systems and Humans, 35(3), 373-384. January 2024 - Sep 2025, LSU Share $300,000. DOE Advance Program.  \"Transferring exascale computational chemistry to cloud computingenvironment and emerging hardware technologies (TEC4)\", Karol Kowalski, Ajay Panyala, Chao Yang, Eric J. Bylaska, Jaes Ang, Nathan Baker, Tunna Baruah, Gerald Baumgartner, Nicolas Bauman, Tony Brewer, Sutanay Choudhury, Koblar Jackson, Hongbin Liu, Andres Marquez, Mark Pederson, P. (Saday) Sadayappan, and Sotiris Xantheas. Top This website uses cookies to ensure site visitors get the best experience on our website. By continuing to use this site, you accept our use of cookies and Privacy Statement. To learn more, please visit LSU Privacy Statement. I agree. Search Search Search POPULAR SEARCHES: MajorsAcademic CalendarIs the Dining Hall Food Good? FootballThings to Do on CampusHow Much is Tuition? × Video Modal ©",
  "content_length": 4100,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:54"
}