{
  "name": "Gerald Penn",
  "homepage": "http://www.cs.toronto.edu/~gpenn",
  "status": "success",
  "content": "Gerald Penn Home Contact Information Research Interests Publications Students & Co-authors Projects ALE Courses Introduction to Computational Linguistics [Fall 25] Discrete Mathematical Models of Sentence Structure [Fall 25] Natural Language Computing [Fall 24] Spoken Language Processing [Spring 24] Intro to Theory of Computation [Fall 10] Natural Language Semantics [Fall 10] Principles of Programming Languages [Fall 08] Conferences MOL 2019 CL/NLP at Toronto Send email Gerald Penn Gerald Penn Professor of Computer Science, Contact Information University of Toronto Publications and Fellow of St. Michael's College gpenn@cs.toronto.edu Digital Signature Mail code: BA 4283 Phone: +1 416 978-7390 University of Toronto Fax: +1 416 978-1455 40 St. George St. Office Hours: MW 11-12 Toronto M5S 2E4 Office: BA 1190K Ontario, Canada Research Interests Natural Language Processing, Mathematical Linguistics, Acoustic Modelling, Spoken Language Processing, Logic Programming, Finite State Methods, Linguistic Information Visualization, and Parsing in Freer-Word-Order Languages (see also Publications, Students & Co-authors) Projects ALE The Attribute Logic Engine Courses CSC 2517 Discrete Mathematical Models of Sentence Structure, T 3-5 CSC 485/2501 Introduction to Computational Linguistics, MWF 10-11,12-1 Organizations Mathematics of Language Society Past President Editorial Boards Linguistics & Philosophy Editorial Board Home Pages Computational Linguistics at Toronto Drafts, Talks, and Publications on Work in Progress Efficient Evaluation of Activation Functions over Encrypted Data Patricia Thaine, Sergey Gorbunov, and Gerald Penn. 2nd Deep Learning and Security Workshop, 40th IEEE Symposium on Security and Privacy (S&P 2019), San Francisco. Improving Speech Recognition with Drop-in Replacements for f-bank Features Sean Robertson, Gerald Penn and Yingxue Wang. 7th International Conference on Statistical Language and Speech Processing (SLSP 2019), Ljubljana. Rationally Reappraising ATIS-based Dialogue Systems Frank Niu and Gerald Penn. Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics (ACL 2019), Florence, pp. 5503-5507. [ Home | Contact | Research | Publications | Students | ALE ] gpenn@cs.toronto.edu http://www.cs.toronto.edu/~gpenn The style of these pages was shamelessly ripped off from Frank Pfenning.",
  "content_length": 2370,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:56"
}