{
  "name": "Gerald Q. Maguire Jr.",
  "homepage": "https://www.kth.se/profile/maguire",
  "status": "success",
  "content": "KTH | Gerald Quentin Maguire Jr Skip to main content Gerald Quentin Maguire JrProfessor emeritusKungliga Tekniska Högskolanhttps://www.kth.se/profile/maguireDetailsWorks for Division of Software and Computer SystemsUnit address Lindstedtsvägen 30E-mail maguire@kth.seRoom4478About meFormer area: Computer Communication (Datorkommunikation) Formally the chair was described in the following Swedish:Ämnet omfattar integrerade dator- och kommunikationssystem för personlig databehandling och personalkomunikation, speciellt trådlös kommunikation och effektiva implementerings strategier. (Ref. nr 473/93). (This translates to \"The area concerns integrated computer- and communication systems for personal data processing and personal communications, especially wireless communications and effective implementation strategies.\") Very brief description: A tool maker - in the sense of Frederick P. Brooks, Jr. As of 2023-04-01, I am professoremeritus with a connection to KTH. As of 2021-01-01 I became a member of Avdelningen för programvaruteknik och datorsystem (SCS)/Division of Software and Computer Systems (SCS) within Institution för Datavetenskap/Department of Computer Science (CS) in Skolan för elektroteknik och datavetenskap/School of Electrical Engineering and Computer Science (EECS). Through and including 2019-12-31, I was a member of the Institution för Kommunikation/Department of Communications (COM), after this I was part of Institution för Datavetenskap/Department of Computer Science (CS). From 1 January 2018, KTH has merged three schools (CSC, EES, and ICT), to form the School of Electrical Engineering and Computer Science (EECS) or in Swedish: Skolan för elektroteknik och datavetenskap. From 1 January 2005, KTH is reorganized into 9 schools. Organizationally, I was in the Skolan för informations- och kommunikationsteknologi/School of Information and Communication Technology (ICT), in the Department of Communication Systems (CoS). From 1 Jan. 2001 to Dec. 31, 2005, I was part of the Institutionen för Mikroelektronik och Informationsteknik (IMIT) in the departmental organization I was part of the Laboratory for Communication Networks (Avdelningen för kommunikationsätt) (LCN). At KTH prior to this, I was part of the Department of Teleinformatics (Teleinformatik). Course rooms with material for teachers I have ported to Canvas a number of courses that NVIDIA has made available via their Deep Learning Institute under CC BY-NC licenses. Note that these courses areonly available to teachers and their teaching assistants on request to . The reason for this limitation is that they include all the solutions for the quiz questions and labs. Additionally, the Accelerated Computing Teaching Kit includes the PDF of chapters from the two books it is based on. These PDFs shouldnot be made available to students, but Nvidia has offered students reduced prices on the books. Currently, the following courses are available: Accelerated Computing Teaching Kit Lab/solution repository (hereafter, GPU Teaching Kit). The kit and associated labs are produced jointly by NVIDIA and the University of Illinois (UIUC). Available at https://canvas.kth.se/courses/42236 This is a very complete course with videos, quizzes, and labs. The videos have been captioned. There are wikipages created for each of the Powerpoint slides and these contain the corresponding text from the captions. Deep Learning Institute (DLI)Deep Learning Teaching Kit - designed by Professor Yann LeCun (when he was at New York University (NYU)) and NVIDIA. There are no videos but there are lots of slides. There are wikipages created for each of the Powerpoint slides and the equations have generally been converted to LaTeX equations in Canvas. [There are lots of equations!] Available at: https://canvas.kth.se/courses/42237. NVIDIA Deep Learning Institute (DLI)Accelerated Data Science Teaching Kit - NVIDIA co-developed this Teaching Kit with Professor Polo Chau from Georgia Institute of Technology (Georgia Tech) and Professor Xishuang Dong from Prairie View A&M University. There are notyet videos. This course has some material that may be relevant to courses that want to include Gender Equality, Diversity and Equal Conditions (Jämställdhet, mångfald och lika villkor (JML)) issues. Available at: https://canvas.kth.se/courses/42238 NVIDIA Deep Learning Institute (DLI)Edge AI and Robotics Teaching Kit - NVIDIA co-developed this Teaching Kit with AI Course Director Ajit Jaokar from University of Oxford and Adjunct Professor Patricia Delafuente from the University of Maryland Baltimore County (UMBC). There are notyet videos. This course includes material about using the Nvidia Jetson boards and JetBotKit. Available at: https://canvas.kth.se/courses/42239 Additionally, there are early releases of the following NVIDIA Omniverse related courses (i.e., there are many parts of these courses missing): Creating Digital Humans Omniverse Teaching Kit - available at https://canvas.kth.se/courses/45744 Media and Entertainment Omniverse Teaching Kit - available at https://canvas.kth.se/courses/45746 Industrial Metaverse Omniverse Teaching Kit - available at https://canvas.kth.se/courses/45745 AECO Omniverse Teaching Kit (AECO stands for Architecture, Engineering, Construction and Operations) - available at https://canvas.kth.se/courses/45743 The above courses describe NVIDIA's Omniverse Platform, Universal Scene Description (USD), lighting, rendering, modeling of materials, … . Service activities As of Faculty Council (\"Fakultetsrådet\") meeting of 2018-03-21, I was a member of the KTH reference group on language issues from 2018-04-01 until later or at most 2022-03-31 (later extended to be affiliated with the committed until I became Professor Emeritus in April 2023). As per the following: \"§ 18 Ledamöter i språkkommittén (referensgruppen för språkfrågor) Dnr V-2018-0308, ks-kod 1.1 Handlingar i ärendet har sänts ut. Under åren 2013-2017 har skolan för teknikvetenskaplig kommunikation och lärande (ECE) haft ansvar för språkfrågor vid KTH. Till uppdraget kring språkpolicyn och övriga språkfrågor finns en referensgrupp bestående av ordförande, fyra lärarrepresentanter, en studeranderepresentant för studerande på grundnivå och avancerad nivå och studentrepresentant för studerande på forskarnivå. Fakultetsrådet har haft uppdraget att utse lärarrepresentanter i referensgruppen vars mandatperiod går ut 2018-03-31. Fakultetsrådet ser språkkommittéens arbete som en viktig del av det lärosätesövergripande kvalitetsarbetet och har tagit fram förslag på lärarrepresentanter för en ny mandatperiod. Katja Grillner redogör för ärendet. Fakultetsrådet beslutar att utse Karin Borell (ITM), Michael Hanke (SCI), Gerald Q Maguire Jr (EECS) samt Tor Sandqvist (ABE) som lärarrepresentanter i språkkommittén från och med 2018-04-01 och tills vidare, dock längst till och med 2022-03-31. Fakultetsrådet noterar till protokollet att inte alla skolor är representerade i kommittén. A per the protocol of the Faculty Council (\"Fakultetsrådet\") meeting of 2015-03-17, I was a faculty representative member of the KTH reference group on language issues: \"Ledamöter i KTH:s referensgrupp för språkfrågor Dnr V-2015-0246 Handlingar i ärendet har sänts ut. Från och med 2013 har skolan för teknikvetenskaplig kommunikation och lärande (ECE) ansvar för språkfrågor vid KTH. Till ECE-skolans uppdrag kring språkpolicyn och övriga språkfrågor finns en referensgrupp bestående av ordförande, fyra lärarrepresentanter, en studeranderepresentant för studerande på grund- och avancerad nivå och en studeranderepresentant för studerande på forskarnivå. Fakultetsrådet utser lärarrepresentanterna. Lärarrepresentanternas mandatperiod i KTH:s referensgrupp för språkfrågor för perioden går ut 2015-03-31. Förslag på nya ledamöter i referensgruppen har inkommit. Per Berglund redogör för ärendet. Fakultetsrådet beslutar att utse Michael Hanke (SCI), Gerald Q Maguire (ICT), Ida Pinho (ECE) och Peta Sjölander (STH) som ledamöter i KTH:s referensgrupp för språkfrågor för perioden från och med 2015-04-01 och tills vidare, dock längst till och med 2018-03-31.\" Former member of KTH's \"Fakultetskollegiet (fakultetskollegium)\" for the period 29 October 2010 until 31 January 2013 (note that the fakultetskollegium was replaced by a \"fakultetsråd\" in April 2011 - I am not a member of this board). Former member of KTH's \"Fakultetskollegiet (fakultetskollegium)\" for the period February 2005 to January 2009 (extend to May 2009). Centers and other organizations Formerly involved with KTH's Center for Wireless Systems (Wireless@KTH) Partial list of my publications by \"Gerald Maguire\" via DiVA . Another (and more accurate) way of doing this is Journal papers, conference papers, patents, chapters in books, reports, books and other. Or even fancier at researcherid.com, and ORCID: https://orcid.org/0000-0002-6066-746X, Scopus Author ID 8414298400, Google Scholar, ... A (partial) list of theses from DiVA for which I was the examiner. In addition to the link to exjobb reports above, another useful portal is DIVA - for theses, dissertations, and reports from a number of Nordic universities. I encourage students to upload the full text of their thesis to DiVA to increase the visibility of their work and to enable it to have a greater impact on society. One can generate a variety of feeds to get information from DiVA (in Swedish). Once can also access DiVA via DiVA management UI If you actually want to contact me or find information related to me, see my web page: http://people.kth.se/~maguire/ CoursesResearch Methodology and Scientific Writing (II2202), teacherLinksPersonal web page at KTHpage at Academia EuropaeaGitHub repositoriesChip's Sandbox in Canvas at KTHIK2554: Practical Voice Over IP (VoIP): SIP and related protocols (Röst över IP (VoIP) i praktiken: SIP och relaterade protokoll)",
  "content_length": 9904,
  "method": "requests",
  "crawl_time": "2025-12-01 13:13:58"
}