{
  "name": "Gerd Brewka",
  "homepage": "http://www.informatik.uni-leipzig.de/~brewka",
  "status": "success",
  "content": "Gerhard Brewka Gerhard Brewka Intelligent Systems Department Computer Science Institute Leipzig UniversityAugustusplatz 10, Room P82304109 Leipzig Germany brewka <the symbol you know> informatik dot uni-leipzig dot de phone: please get in touch via emailfax: ++49 341 9 73 22 99 Information for visitors: our group is located on 8th floor of the Paulinum, the part of the university building remembering (and looking like) a church. To find us enter the building from Augustusplatz and use one of the elevators to the right of the entrance hall to the 8th floor. Information for potential PhD students: please note that I am too close to retirement to accept new PhD students! Very short CV I was born in 1955 in Regensburg, Germany. I am married and have 3 daughters and 5 grandchildren. I received the diploma in Computer Science from University of Bonn in 1984 and the Ph.D. in Computer Science from University of Hamburg in 1989. I was a member of the Artificial Intelligence Group of Gesellschaft für Mathematik und Datenverarbeitung, Sankt Augustin, from 1984 to 1994 and visiting researcher at the International Computer Science Institute, Berkeley, CA, from 1991 to 1992. In January 1995 I became full professor for Knowledge Based Systems at the Technical University of Vienna. Since September 1996 I am chair for Intelligent Systems at the University of Leipzig where I was heading the doctoral programme in knowledge representation from 1998 to 2008. Since 2002 I am an ECCAI Fellow  selected by the European Coordinating Committee of Artificial Intelligence. If you are interested in a slightly longer CV please click here. My research interests nonmonotonic reasoning answer set programming preference and inconsistency handling reasoning about action computational models of argumentation qualitative decision making multi-context reasoning Some of my activities I had the honour of becoming program chair respectively co-chair of various conferences, e.g. ECAI-06, the 17th European Conference on Artificial Intelligence (Riva del Garda, Italy, August 28th to Sep. 1st 2006). LPNMR 2007 (Logic Programming and Nonmonotonic Reasoning) (Tempe, Arizona, May 2007), KR-2008, the International Conference on Principles of Knowledge Representation and Reasoning (Sydney, September 2008). I was invited to speak at various conferences and workshops, e.g. CAEPIA 2005, the Swedish AI-workshop (SAIS-06), ICLP 2007, COMMA (Computational Models of Argument) 2010, NMR 2010, JELIA 2010, RR 2012, LPNMR/CLIMA 2013, JURIX 2013, 2017 (German Conference on Artificial Intelligence) and FOIKS 2018. I was a member of the ECCAI-board (executive board of the European Coordinating Committee for Artificial Intelligence representing 29 national European AI societies) from August 2006 to 2012. From July 2008 onwards I was president of ECCAI for 4 years. ECCAI changed its name to EurAI in 2016. I was general chair of KR-2012, the International Conference on Principles of Knowledge Representation and Reasoning, Rome, June 2012. Since that date I was president of KR, inc. For 2 years. I was a member of the advisory board of IJCAI-09 and IJCAI-13. Since 2013 I am an IJCAI trustee and was general chair of IJCAI 2016 in New York, one of nicest events I ever had the privilege to be directly involved with. Click here if you are interested in a selection of my recent publications Click here if you are looking for teaching material (most of it in German) Last update: 29.06.2018",
  "content_length": 3477,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:04"
}