{
  "name": "Gerd Bruder",
  "homepage": "https://sreal.ucf.edu/sreal/people/bruder",
  "status": "success",
  "content": "Dr. Gerd Bruder | SREAL Contact Phone: 407.823.2281 Email: bruder@ucf.edu Google Scholar: Profile About Gerd Bruder is an Associate Professor at the Department of Computer Science at the University of Central Florida, where he plays a leading role in advancing the frontiers of Virtual and Augmented Reality. With a strong academic foundation from the University of Münster (Ph.D., M.Sc.) and a Habilitation from the University of Hamburg, postdoctoral research at the University of Würzburg in Germany, and visiting research experiences at INRIA Rennes in France, among other places, Dr. Bruder brings a rigorous European research pedigree to his work in the U.S. Dr. Bruder’s research spans a wide spectrum of Extended Reality (XR), including Virtual Reality (VR), Augmented Reality (AR), and Mixed Reality (MR), with a particular focus on human factors, human-computer interaction, modeling and simulation, and digital twins. His work is not only technically innovative but also deeply interdisciplinary, impacting domains such as healthcare, military training, architecture, and visualization. Appointments Research Associate Professor, Institute for Simulation and Training, University of Central Florida Education University of Hamburg, Germany, Habilitation, Computer Science, 2017 University of Münster, Germany, Ph.D. Computer Science, 2011 University of Münster, Germany,  M.Sc., Computer Science with minor in Mathematics, 2009 Research Interests Extended reality (XR) systems and technologies Augmented reality, mixed reality, virtual reality, metaverse Human factors and human-computer interaction Perception and cognition Display optics and vision sciences 3D user interfaces Modeling, simulation, and training (Human) Digital twins Application domains (selected) Healthcare, military operations & training, space, smart environments, architecture Honors and Awards “Best Paper Award” at the ACM Symposium on Virtual Reality Software and Technology (VRST) 2023, Christchurch, New Zealand “2021 Innovation Award” at TechConnect World Innovation Conference and Expo 2021, Washington (DC), USA “Best Demo Award” at the ACM Symposium on Spatial User Interaction (SUI) 2021, Virtual Conference “Best Demo Audience Choice Award” at the International Conference on Artificial Reality and Telexistence (ICAT) & Eurographics Symposium on Virtual Environments (EGVE) 2020, Virtual Conference “Best Paper Award” at the ACM Symposium on Spatial User Interaction (SUI) 2019, New Orleans (LA), USA “Best Paper Award” at the ACM Symposium on Virtual Reality Software and Technology (VRST) 2018, Tokyo, Japan “Best Paper Award” at the International Conference on Artificial Reality and Telexistence (ICAT) & Eurographics Symposium on Virtual Environments (EGVE) 2018, Limassol, Cyprus “Honorable Mention for Best Paper Award” at the International Conference on Artificial Reality and Telexistence (ICAT) & Eurographics Symposium on Virtual Environments (EGVE) 2018, Limassol, Cyprus “Best Paper Award” at the ACM Symposium on Spatial User Interaction (SUI) 2018, Berlin, Germany “Best Student Paper Award” at the ACM Symposium on Virtual Reality Software and Technology (VRST) 2017, Gothenburg, Sweden “Best Paper Award” at the ACM Symposium on Spatial User Interaction (SUI) 2016, Tokyo, Japan “Honorable Mention for Best Poster Award” at the ACM Symposium on Spatial User Interaction (SUI) 2016, Tokyo, Japan “Best Poster Award” at the International Conference on Artificial Reality and Telexistence (ICAT) & Eurographics Symposium on Virtual Environments (EGVE) 2015, Kyoto, Japan “Best Poster Audience Choice Award” at the ICAT-EGVE 2015, Kyoto, Japan “Best Demo Award” at the GI VR/AR HMD App Contest, 2015, Bonn, Germany “Honorable Mention for Best Paper Award” at the IEEE Virtual Reality (VR) 2015, Arles, France “Best Short Paper Award” at the ACM Symposium on Spatial User Interaction (SUI) 2014, Honolulu (HA), USA “Best Paper Award” at the GI VR/AR 2013, Würzburg, Germany “Best Paper Award” at the ACM Symposium on Virtual Reality Software and Technology (VRST) 2009, Kyoto, Japan “Best Paper Award” at the IEEE Symposium on 3D User Interfaces (3DUI) 2009, Lafayette (LA), USA “Honorable Mention for Best Paper Award” at the ACM Symposium on Virtual Reality Software and Technology (VRST) 2008, Bordeaux, France “Best Paper Award” at the Virtual Reality International Conference (VRIC) 2008, Laval, France “Honorable Mention for Best Poster Award” at the IEEE Virtual Reality (VR) 2008, Reno (NV), USA Publications Patents",
  "content_length": 4533,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:05"
}