{
  "name": "Gerhard A. Holzapfel",
  "homepage": "https://www.biomech.tugraz.at/people/gerhard_holzapfel",
  "status": "success",
  "content": "Gerhard A. Holzapfel - Institute of Biomechanics, Graz University of Technology Gerhard A. Holzapfel CV [pdf]Short version [pdf]Kurze Version [pdf] Graz University of TechnologyInstitute of Biomechanics8010 Graz, Austria Norwegian University of Science and Technology (NTNU)Faculty of Engineering Science and Technology7491 Trondheim, Norway Visiting Professorship:University of GlasgowSchool of Mathematics and StatisticsGlasgow G12 8QW, UK Contact informationPhone: 0316-873-35500Phone (overseas): ++43-316-873-35500E-mail: holzapfel@TUGraz.at Google scholar Mailing address:Graz University of TechnologyInstitute of BiomechanicsStremayrgasse 16/28010 Graz, Austria Biography Education 1996: Habilitation in \"Mechanics\", Vienna University of Technology, Austria 1993 – 1995: Visiting Scholar at the Division of Applied Mechanics, Department of Mechanical Engineering, Stanford University, USA, with late Professor Juan C. Simo 1990: Ph.D. Mechanical Engineering, Graz University of Technology, Austria (with distinction) 6/86 – 1/87: National Service at Red Cross 1985: M.Sc. Civil Engineering, Graz University of Technology, Austria (with distinction) 1980: Graduation certificate from High School (with distinction) Professional Appointments Since 4/16: Adjunct Full Professor in Biomechanics, Norwegian University of Science and Technology, Faculty of Engineering Science and Technology, Trondheim, Norway Since 2/07: Full Professor of Biomechanics – Head of the Institute, Graz University of Technology, Austria 2/07 – 10/13: Adjunct Full Professor of Biomechanics, Royal Institute of Technology (KTH), School of Engineering Sciences, Department of Solid Mechanics, Stockholm, Sweden 12/04 – 1/07: Full Professor of Biomechanics, Royal Institute of Technology (KTH), School of Engineering Sciences, Department of Solid Mechanics, Stockholm, Sweden 1/98 – 11/04: Associate Professor at the Institute of Structural Analysis, Graz University of Technology, Austria 5/87 – 12/97: Assistant at the Institute of Strength of Materials, Graz University of Technology, Austria (1991 on leave, P.R. China; 1993-1995 on leave, USA) 1991: Visiting Scholar at University of Shenyang, P.R. China 6/88 – 9/88: Visiting Scholar at Ruhr-University Bochum, Germany 1/86 – 5/86: Research Assistant at Darmstadt University of Technology, Germany Awards and Honors 7/25: The Huiskes Medal for Biomechanics from the European Society of Biomechanics 5/25: Honorary Degree in Mechanical Engineering from the University of Parma, Italy 2/25: International Member of the United States National Academy of Engineering (NAE) 1/25: EUROMECH Solid Mechanics Prize 2025 9/24: Fellow of the European Academy of Sciences: Engineering Division 6/24: Honoris Causa Doctorate from the Institut Mines-Télécom, École des Mines de Saint-Étienne, France 6/22: Eugenio Beltrami Senior Scientist Prize 2021: Warner T. Koiter Medal from the American Society of Mechanical Engineers 2021: William Prager Medal from the Society of Engineering Science 3/19: Ordinary Member of the European Academy of Sciences and ArtsClass VI: Technical and Environmental Sciences 3/18: 2018 Best CMBBE Paper Award 1/18: Leverhulme Trust Visiting Professorship for the United Kingdom, University of Portsmouth 9/15: Fellow of EUROMECH – European Mechanics Society 10/14: Highly cited researcher 2014 in EngineeringSelected by Thomson Reuters and listed as \"The World´s Most Influential Scientific Minds: 2014\" 8/14: Elected member of the Academia EuropaeaSection: Physics and Engineering Sciences 11/13: Congress Award Graz 2013Category: not repeated conferences in Graz 5/12: Corresponding Member of the Austrian Academy of SciencesSection: Mathematics and the Natural Sciences 3/12: Founding Fellow of EAMBES – European Alliance for Medical and Biological Engineering & ScienceAn EAMBES fellowship is indented “for individuals who have distinguished themselves by identifiable contributions or accomplishments in Medical and Biological Engineering and Science”. 11/11: Erwin Schrödinger Prize 2011Annual award presented by the Austrian Academy of Sciences for lifetime achievements by Austrians in the fields of mathematics and natural sciences. The prize was established in 1956, and was first awarded to Erwin Schrödinger. 11/08: Research Award 2008 of the Federal State of Styria, Austria, for Simulation and Modeling – Basic Research and University Research 12/07: Member of the young curia of the Austrian Academy of SciencesThe young curia (\"Junge Kurie\") is a panel of outstanding young scientists who should actively participate within the academy. It is an autonomous instrument that exists besides the Section for Mathematics and the Natural Sciences, and the Section for the Humanities and the Social Sciences. 3/03: Awarded with the \"Josef-Krainer Würdigungspreis 2003 for exceptional achievements in the field of Biomechanics\".The prize-winners are selected among scholars from all disciplines by an interdisciplinary Jury after peer review. 2001: Co-Founder of the Journal \"Biomechanics and Modeling in Mechanobiology\", Springer-Verlag, Berlin, Heidelberg. 7/97: START-Award 1997, granted by the Chancellor of the Republic of Austria and the Ministry for Education, Science and Culture.START-Awards are awarded to young scientists (below 35 years of age at that time) and are selected by an International Jury. It supports research for 6-7 years. 1993 – 1994: Erwin Schrödinger Scholarship for foreign countries 1983: Winner of the Amann-Foundation Offers – Professorships Full Professorships Since 4/16: International Chair of Biomechanics (Adjunct Professorship), Norwegian University of Science and Technology (NTNU), Faculty of Engineering Science and Technology, Trondheim 5/13: Chair of Biomedical Engineering, College of Science & Engineering, School of Engineering, University of Glasgow, UK (not accepted) Since 2/07: Chair of Biomechanics, Graz University of Technology, Austria 12/04 – 1/07: Chair of Biomechanics, Royal Institute of Technology (KTH), School of Engineering Sciences, Department of Solid Mechanics, Stockholm, Sweden 7/03: Chair of Applied Mechanics (Continuum Mechanics), C4, University of Kassel, Germany (not accepted) Visiting Professorships Since 4/09: University of Glasgow, School of Mathematics and Statistics, UK 5/07: University of Zaragoza, Department of Mechanical Engineering, Spain 4/03 – 5/03: Universidad Politécnica de Cataluña, Escuela Técnica Superior de Ingenieros de Caminos, Barcelona, Spain 11/02: University of Trento, Dipartimento di Ingegneria Meccanica e Strutturale, Italy (not accepted) 5/01: Polish Academy of Sciences, Institute of Fundamental Technological Research, Warsaw (not accepted) [Publications] Biographical Sketch Gerhard A. Holzapfel is Professor of Biomechanics and Head of the Institute of Biomechanics at Graz University of Technology (TUG), Austria, since 2007. He is also Adjunct Professor at the Norwegian University of Science and Technology (NTNU), Trondheim, Norway, and Visiting Professor at the University of Glasgow, Scotland. Until 2013 he was Professor of Biomechanics at the Royal Institute of Technology (KTH) in Stockholm, Sweden, for 9 years (7 years as an Adjunct Professor). After his PhD in Mechanical Engineering in Graz he received an Erwin-Schrödinger Scholarship for foreign countries to be a Visiting Scholar at Stanford University (1993-95). He achieved his Habilitation at TU Vienna in 1996 and received a START-Award in 1997, which is the most prestigious research award in Austria for young scientists. In the following years (1998-2004) he was the Head of a research group on \"Computational Biomechanics\" at TUG. Among several awards and honors in the past years he is listed in \"The World's Most Influential Scientific Minds: 2014\" (Thomas Reuters), he received the Erwin Schrödinger Prize 2011 from the Austrian Academy of Sciences for his lifetime achievements, was awarded the 2021 William Prager Medal and the 2021 Warner T. Koiter Medal. He received an Honoris Causa Doctorate from the École des Mines de Saint-Étienne, France, in 2024 and an Honorary Degree in Mechanical Engineering from the University of Parma, Italy, in 2025. In 2025, he received the Huiskes Medal for Biomechanics from the European Society of Biomechanics and the EUROMECH Solid Mechanics Prize. He was elected a Fellow of the European Academy of Sciences: Engineering Division in 2024 and an International Member of the United States National Academy of Engineering (NAE) in 2025. In 2024, he received a Synergy Grant from the European Research Council (ERC). Professor Holzapfel’s research includes experimental and computational biomechanics and mechanobiology with an emphasis on soft biological tissues, the cardiovascular system including blood vessels in health and disease, therapeutic interventions such as balloon angioplasty and stent implantation, polarized light and second-harmonic imaging microscopy, magnetic resonance imaging and medical image processing; nonlinear continuum mechanics, constitutive (multi-scale) modeling of solids at finite strains such as cross-linked actin networks, growth and remodeling, nonlinear finite element methods, fracture and material failure. His research has been supported by TUG, Austrian Science Fund, Austrian Academy of Sciences, State of Styria, Österreichische Nationalbank (Jubiläumsfonds), Austrian Exchange Service, KTH, Swedish Research Council, National Institutes of Health (NIH), The Royal Society, Carnegie Trust, European Commission and the private industry. Professor Holzapfel has authored a graduate textbook entitled \"Nonlinear Solid Mechanics. A Continuum Approach for Engineering\" (John Wiley & Sons), and co-edited seven books. He contributed chapters to 30+ other books, and published 300+ peer-reviewed journal articles with an h-index of over 100. He is the co-founder and co-editor of the International Journal \"Biomechanics and Modeling in Mechanobiology\" (Springer-Verlag, Berlin,",
  "content_length": 10208,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:06"
}