{
  "name": "Gerhard Wellein",
  "homepage": "https://hpc.fau.de/person/gerhard-wellein",
  "status": "success",
  "content": "Prof. Dr. Gerhard Wellein - NHR@FAU Simulate organization breadcrumb open Simulate organization breadcrumb close Prof. Dr. Gerhard Wellein Prof. Dr. Gerhard Wellein Prof. Dr. Gerhard WelleinProfessorship for High Performance Computing, Head of NHR@FAUDepartment of Computer ScienceProfessorship for High Performance ComputingRoom: Room 01.130-113.02Martensstr. 391058 ErlangenPhone number: +49913185-28136Fax number: +499131302941Email: gerhard.wellein@fau.deWebsite: https://hpc.fau.de Gerhard Wellein is a Professor for High Performance Computing at the Department for Computer Science of the Friedrich-Alexander-Universität Erlangen-Nürnberg (FAU) and holds a PhD in theoretical physics from the University of Bayreuth. From 2015 to 2017, he was also a guest lecturer at the Faculty of Informatics at the Università della Svizzera italiana (USI) Lugano. Since 2024, he has been a Visiting Professor for HPC at the Delft Institute of Applied Mathematics at the Delft University of Technology. He is the director of the Erlangen National Center for High Performance Computing (NHR@FAU) and a member of the board of directors of the German NHR-Alliance which coordinates the national HPC Tier-2 infrastructure at German universities. Gerhard Wellein has more than twenty years of experience in teaching HPC techniques to students and scientists. He has contributed to numerous tutorials on node-level performance engineering in the past decade and received the “2011 Informatics Europe Curriculum Best Practices Award” (together with Jan Treibig and Georg Hager) for outstanding teaching contributions. His research interests focus on performance modeling and performance engineering, architecture-specific code optimization, novel parallelization approaches, hardware-efficient building blocks for sparse linear algebra, and stencil solvers. He has been conducting and leading numerous national and international HPC research projects and has authored or co-authored more than 100 peer-reviewed publications. Research fields Performance Engineering Performance Tools Hardware-efficient building blocks for sparse linear algebra and stencil solvers Performance Models Lectures in the current semester Hauptseminar Effiziente numerische Simulation auf multicore-Prozessoren List of current projects extracted from CRIS FOSTERING THE EUROPEAN ENERGY TRANSITION WITH EXASCALE (Third Party Funds Group – Sub project) Overall project: FOSTERING THE EUROPEAN ENERGY TRANSITION WITH EXASCALETerm: 2024-01-01 - 2026-12-31Funding source: EU / Cluster 4: Digital, Industry and Space Abstract The Energy-oriented Centre of Excellence for exascale HPC applications (EoCoE-III) applies cutting-edge computational methods in its mission to foster the transition to decarbonized energy in Europe. EoCoE-III is anchored both in the High Performance Computing (HPC) community and in the energy field. It will demonstrate the benefit of HPC for the net-zero energy transition for research institutes and also for key industry in the energy sector. The present project will draw the experience of two successful previous projects EoCoE-I and EoCoE-II, where a set of diverse computer applications from four energy domains achieved significant efficiency gains thanks to its multidisciplinary expertise in applied mathematics and supercomputing. During this 3rd round, EoCoE-III will channel its efforts into 5 exascale lighthouse applications covering the key domains of Energy Materials, Water, Wind and Fusion. A world-class consortium of 18 complementary partners from 6 countries will form a unique network of expertise in energy science, scientific computing and HPC, including 3 leading European supercomputing centres. This multidisciplinary effort will harness innovations in computer science and mathematical algorithms within a tightly integrated co-design approach to overcome performance bottlenecks, to deploy the lighthouse applications on the coming European exascale infrastructure and to anticipate future HPC hardware developments. New modelling capabilities will be created at unprecedented scale, demonstrating the potential benefits to the energy industry, such as accelerated design of photovoltaic devices, high-resolution wind farm modelling over complex terrains and quantitative understanding of plasma core-edge interactions in ITER-scale tokamaks. These lighthouse applications will provide a high-visibility platform for high-performance computational energy science, cross-fertilized through close working connections to the EERA consortium. →More information Quelloffene Lösungsansätze für Monitoring und Systemeinstellungen für energieoptimierte Rechenzentren (Third Party Funds Single) Term: 2022-09-01 - 2025-08-31Funding source: Bundesministerium für Forschung, Technologie und Raumfahrt (BMFTR)URL: https://eehpc.clustercockpit.org/ Abstract The aim of this project is to reduce power consumption while maximizing throughput in the operation of HPC systems. This is achieved by optimally adjusting system parameters that have an influence on energy consumption to the respective running jobs. To map the throughput of useful work, the Energy Productivity of the IT Equipment metric specified by KPI4DCE is used. The savings potential is demonstrated at all participating data centers for two selected applications each. This project combines a comprehensive job-specific measurement and control infrastructure with machine learning (ML) techniques and software-hardware co-design with the ability to control energy parameters via runtime environments. Policies are used to specify the framework conditions, and the actual optimization of system parameters is automatic and adaptive. To achieve the goals, the GEOPM open-source framework must be extended to include a machine learning component. To make the most of the potential for energy savings, automatic phase detection will be developed, as well as extensions to the MPI and OpenMP runtime environments that allow information about application state to be communicated to the GEOPM framework. To capture required time-resolved metrics on energy consumption as well as performance behavior of the application, interfaces and extensions in LIKWID will be developed. For visualization and control of the GEOPM functionality, the framework is extended to the job-specific Performance Monitoring ClusterCockpit and coupled with GEOPM. The novelty of the solution approach is the development and provision of a product-ready software environment for a fully user-transparent energy optimization of HPC applications. The project builds on existing open source software components and integrates, extends and adapts them for the new requirements. →More information Der skalierbare Strömungsraum (Third Party Funds Group – Sub project) Overall project: Der skalierbare StrömungsraumTerm: 2022-09-01 - 2025-08-31Funding source: BMBF / Verbundprojekt Abstract Kommende Exascale-Rechnerarchitekturen werden sich durch eine sehr hohe Zahl an heterogenen Hardware-Komponenten auszeichnen, die auch Spezialprozessoren bzw. Beschleuniger beinhalten werden. Die entsprechende Realisierung von CFD-Anwendersoftware als zentrale Kernkomponente von heutigen Strömungssimulationen im industriellen Umfeld erfordert auf methodischer Seite hochskalierbare Verfahren, vor allem zum Lösen der hochdimensionalen und instationären (nicht)linearen Gleichungssysteme, die zusätzlich in der Lage sein müssen, die hohe Peak Performance von Beschleuniger-Hardware algorithmisch auszunutzen. Zudem müssen diese Verfahrensansätze in der Anwendersoftware so realisiert werden, dass sie für reale Anwendungen, insbesondere bei der Simulation, Kontrolle und Optimierung von industrierelevanten Prozessen, von “Nicht-HPCExperten” verwendet werden und dabei ressourceneffizient die hohe Leistungsfähigkeit von zukünftigen Exascale-Rechnern ausnutzen können. Die vor allem an der TU Dortmund entwickelte Open Source Software FEATFLOW ist ein leistungsstarkes CFD-Werkzeug und zentraler Teil der StrömungsRaum-Plattform, die von IANUS Simulation seit Jahren erfolgreich im industriellen Umfeld eingesetzt wird. Im Rahmen des Gesamtprojektes soll FEATFLOW methodisch und durch hardwarenahe parallele Implementierungen erweitert werden, so dass hochskalierbare CFD-Simulationen mit FEATFLOW auf zukünftigen Exascale-Architekturen möglich werden.Im Teilprojekt der FAU werden Methoden und Prozesse des Performance Engineerings eingesetzt und weiterentwickelt, um zielgerichtet Hardwareeffizienz und Skalierung von FEATFLOW für die kommenden Klassen von HPC-Systemen und abzusehenden Exascale-Architekturen zu verbessern und damit die Simulationszeit stark zu verringern. Dabei werden insbesondere die im Rahmen des Projektes geplanten methodischen Erweiterungen bei der Implementierung effizienter Bibliotheken unterstützt. Darüber hinaus werden Performance Modelle für ausgewählte Kernroutinen erstellt, diese Routinen optimiert und deren effiziente Implementierung in Form von Proxy-Applikationen veröffentlicht. →More information DatenREduktion für Exascale- Anwendungen in der Fusionsforschung (Third Party Funds Group – Sub project) Overall project: DatenREduktion für Exascale- Anwendungen in der FusionsforschungTerm: 2022-09-01 - 2025-08-31Funding source: BMBF / Verbundprojekt →More information Weiterentwicklung des Hochleistungsrechnens (Third Party Funds Single) Term: 2022-01-01 - 2022-12-31Funding source: andere Förderorganisation →More information List of recent publications extracted from CRIS / see also on Google Scholar 2025 Afzal A., Hager G., Wellein G.:GROMACS Unplugged: How Power Capping and Frequency Shapes Performance on GPUs31st International European Conference on Parallel and Distributed Computing (Euro-Par 2025) (Dresden, Germany, 2025-08-25 - 2025-08-29)In: Euro-Par 2025: Parallel Processing Workshops Volume in the Springer Lecture Notes in Computer Science (LNCS) series. 2025DOI: 10.48550/arXiv.2412.08792 Lacey D., Alappa",
  "content_length": 90369,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:17"
}