{
  "name": "Gerhard Schwabe",
  "homepage": "http://www.ifi.uzh.ch/imrg/people/schwabe.html",
  "status": "success",
  "content": "Prof. Dr. Gerhard Schwabe | Department of Informatics | UZH Skip navigation Prof. Dr. Gerhard Schwabe Group Leader Department of Informatics University of Zurich Binzmuehlestrasse 14 CH-8050 Zurich Room: BIN 2.C.06 Email: schwabe AT ifi.uzh.ch Phone: +41 44 635 68 09 Interview, OecNews, SS03 (PDF, 369 KB) Research topics Collaborative Technologies Bank IT and IM E-Government Publications ZORA Publication List Publications Katsiuba, D., Boos, A. K., Hany, R., Dolata, M., & Schwabe, G. (2025). Accountability in Autonomous Drone-Based Firefighting: Insights From a Field Trial 10. https://aisel.aisnet.org/icis2025/ethical_is/ethical_is/10/ Katsiuba, D., Brander, S., Dolata, M., & Schwabe, G. (2025). From Ad Hoc Pilots to Repeatable Patterns: Structuring Drone Collaboration in Emergency Services with DroneLets 19. https://aisel.aisnet.org/icis2025/is_transformwork/is_transformwork/19/ Katsiuba, D., Dolata, M., Crowston, K., & Schwabe, G. (2025). Adopt, Adapt, Transform: AI Integration in Customer Feedback Management 15. https://aisel.aisnet.org/icis2025/learn_curricula/learn_curricula/15/ Bucher, A., Egger, S., Vashkite, I., Wu, W., & Schwabe, G. (2025). “It’s Not Only Attention We Need”: Systematic Review of Large Language Models in Mental Health Care JMIR Mental Health, 12, e78410. https://doi.org/10.2196/78410 Friedli, J., Dolata, M., & Schwabe, G. (2025). How Heidi helps: designing for inspiration in digital travel assistants Information technology & tourism, Epub ahead of print. doi:10.1007/s40558-025-00328-0 Specker, Richard Jörg; Bucher, Andreas; Katsiuba, Dzmitry; Dolata, Mateusz; Schwabe, Gerhard (2025). An Extra Brain In The Room: Enhancing Large Group Brainstorming With An Autonomous AI-Agent In: The European Conference on Information Systems 2025, Ammann, Jordan, 15 Juni 2025 - 18 Juni 2025, AIS Electronic Library. Sprenkamp, Kilian; Eckhardt, Sven; Zavolokina, Liudmila; Schwabe, Gerhard (2025). From Information-Seeking to Information-Asking: Designing RefuGPT, a Chatbot for Ukrainian Refugees in Switzerland. Dolata, Mateusz; Lange, Norbert; Schwabe, Gerhard (2025). More Attention, Transformation, Acceleration, and Exploration: Freelance Developers' Take on Hypes In: CHI 2025: CHI Conference on Human Factors in Computing Systems, Yokohama, 26 April 2025 - 1 May 2025. ACM Digital library, 1-21. Staehelin, Dario; Schmid, Damaris; Gerber, Felix; Dolata, Mateusz; Schwabe, Gerhard (2025). Empowering Community Health Workers With Scripted Medicine: Design Science Research Study JMIR Human Factors:e57545. Davison, Robert M; Schwabe, Gerhard (2025). Editorial: The Future (As a Focus) of IS Research Information Systems Journal:Epub ahead of print. Richter, Alexander; Schwabe, Gerhard (2025). “There is No ‘AI’ in ‘TEAM’! Or is there?” – Towards meaningful human-AI collaboration Australian journal of information systems, 29:5753. Dolata, Mateusz; Briggs, Robert O; Schwabe, Gerhard (2025). How Persuadee’s Psychological States and Traits Shape Digital Persuasion: Lessons Learnt from Mobile Burglary Prevention Encounters In: Hawaii International Conference on System Sciences 2025 (HICSS-58), Waikoloa, HI, USA, 7 January 2025 - 11 January 2025, 1236-1335. Schwabe, G., Katsiuba, D., Specker, R. J., & Dolata, M. (2025). AI-ThinkLets for Brainstorming 357–371. https://hdl.handle.net/10125/108879 Wu, Wenyuan; Dolata, Mateusz; de Spindler, Alexandre; Schwabe, Gerhard (2025). Persuasive Prompting: The Case of Digital Health In: The European Conference on Information Systems (ECIS) 2025, Amman, Jordan, 16 Juni 2025 - 18 Juni 2025. AIS Electronic Library, ECIS2025-1051. Sprenkamp, Kilian; Dolata, Mateusz; Schwabe, Gerhard; Zavolokina, Liudmila (2025). Data-driven intelligence in crisis: The case of Ukrainian refugee management Government Information Quarterly:101978. Katsiuba, Dzmitry; Dolata, Mateusz; Schwabe, Gerhard (2025). Joining forces for online feedback management: policy recommendations for human–AI collaboration Data & Policy, 7:e35. Garazha, Aleksandra; Merz, Cedric; Schwabe, Gerhard; Zavolokina, Liudmila (2024). Resilience in Times of Crisis: Empowering Refugees with Self-Sovereign Identity In: International Conference on Information Systems (ICIS), Bangkok, Thailand, 15 Dezember 2024 - 18 Dezember 2024. Association for Information Systems, online. Staehelin, Dario; Dolata, Mateusz; Stöckli, Livia; Schwabe, Gerhard (2024). How Patient-Generated Data Enhance Patient-Provider Communication in Chronic Care: Field Study in Design Science Research JMIR Medical Informatics, 12:e57406. Zavolokina, Liudmila; Bauer-Hänsel, Ingrid; Hacker, Janine; Schwabe, Gerhard (2024). Organizing for value creation in blockchain information systems Information and Organization, 34(3):100522. AbouWarda, Horeya; Dolata, Mateusz; Schwabe, Gerhard (2024). How Does an Online Mental Health Community on Twitter Empower Diverse Population Levels and Groups? A Qualitative Analysis of #BipolarClub Journal of Medical Internet Research, 26:e55965. Pagination",
  "content_length": 5012,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:16"
}