{
  "name": "Gerhard Sommer",
  "homepage": "https://www.biomech.tugraz.at/index.php/people/gerhard_sommer",
  "status": "success",
  "content": "Gerhard Sommer - Institute of Biomechanics, Graz University of Technology Gerhard Sommer CV [pdf] Graz University of TechnologyInstitute of BiomechanicsStremayrgasse 16/28010 Graz, Austria Phone: 0316-873-35505Phone (overseas): ++43-316-873-35505E-mail: sommer@TUGraz.atGoogle ScholarORCID Biography Education 11/21: Habilitation in “Experimental Biomechanics”, Graz University of Technology, Austria 10/08: Ph.D. Biomechanics, Graz University of Technology, Austria (with distinction) 2003: M.Sc. Technical Physics, Graz University of Technology, Austria 1995: Graduation certificate from Technical High School Professional Appointments Since 2/23: Associate Professor, Institute of Biomechanics, Graz University of Technology, Austria 11/18 – 1/23: Assistant Professor, Institute of Biomechanics, Graz University of Technology, Austria 7/13 – 10/18: Senior Postdoctoral Researcher, Institute of Biomechanics, Graz University of Technology, Austria 11/08 – 6/13: Postdoctoral Researcher, Institute of Biomechanics, Graz University of Technology, Austria 5/07 – 10/08: Research Assistant and Doctoral Student, Institute of Biomechanics, Graz University of Technology, Austria 10/06 – 6/07: Assistant of the lecture and the laboratory tutorial of the course ‘Orthopedic Biomechanics’, Royal Institute of Technology (KTH), Department of Solid Mechanics, Stockholm, Sweden 10/05 – 6/06: Assistant of the lecture and laboratory tutorial of the course ‘Introduction to Biomechanics’, Royal Institute of Technology (KTH), Department of Solid Mechanics, Stockholm, Sweden 3/05 – 6/05: Assistant of the course ‘Material Mechanics’, Royal Institute of Technology (KTH), Department of Solid Mechanics, Stockholm, Sweden 12/04 – 4/07: Doctoral Student, Department of Solid Mechanics, Royal Institute of Technology (KTH), Stockholm, Sweden 4/03 – 11/04: Doctoral Student, Group of Computational Biomechanics, Institute for Structural Analysis, Graz University of Technology, Austria Visiting Professorships 7/22 – 9/22: École Nationale Supérieure des Mines de Saint-Étienne, France 5/22 – 6/22: Technical University of Braunschweig, Germany 3/22 – 4/22: University of Zagreb, Croatia Institutional Responsibilities Since 2020: Vice Dean of Studies for Biomedical Engineering and Doctoral School \"Biomedical Engineering\", Graz University of Technology, Austria Since 2014: Deputy Head, Institute of Biomechanics, Graz University of Technology, Austria Since 2007: Manager of the Biomechanics Laboratory, Institute of Biomechanics, Graz University of Technology, Austria Research Grants 4/21 – 3/25: Co-I of the Austrian Science Fund (FWF) Stand-Alone Project: “Cardiovascular function and biomechanics in HHcy”, grant No. P 33672 1/21 – 1/24: Co-PI of the 2nd phase of the TUG Lead Project “Mechanics, Modeling, and Simulation of Aortic Dissection”, granted by Graz University of Technology 5/21 – 4/23: Co-I of the Austrian Science Fund (FWF) Stand-Alone Project: “Porous and viscous behavior of human brain tissue”, grant No. I 4828 8/19 – 1/25: PI of the Austrian Science Fund (FWF) Stand-Alone Project: \"Biomechanical investigation of arterial damage\", grant no. P 32713 3/17 – 9/20: PI of the Austrian Science Fund (FWF) Stand-Alone Project: \"Multiscale biomechanical investigation of human aortas\", grant no. P 30260–B31 7/11 – 6/14: PI of the Austrian Science Fund (FWF) Stand-Alone Project: \"Biaxial tensile and triaxial shear measurements and modeling of human myocardium\", grant no. P 23830-N13 Awards and Honors 2022: Best Collaborative BioTechMed-Graz Paper Award 2022 for an article published in Acta Biomaterialia 2019: Award from Graz University of Technology, Medical University of Graz and University of Graz for inventing a \"Cardiac Simulation Device\", presented during the event \"Von der Wissenschaft zur Innovation\" 2014: Inventum Award 2013 'Silver Medal' by the Austrian Patent Office for the invention of a unique human bone screwtogether with Dr. K. Pastl (orthopedic surgeon, Linz) and Dr. H. Plank (Graz University of Technology) 2010: Second place at the ‘Stefan-Schuy-Preis’ award 2010 of the Austrian Society of Biomedical Engineering for an excellent publication in the field of biomedical engineering with the publication: Biaxial mechanical properties of intact and layer-dissected human carotid arteries at physiological and supraphysiological loadings by G. Sommer, P. Regitnig, L. Koeltringer, and G.A. Holzapfel in American J. Physiology - Heart Circulation Physiology, 298: 898-912, 2010. Publications N. Famaey, H. Fehervary, Y. Lafon, A. Akyildiz, S. Dreesen, K. Bruyère-Garnier, J.-M. Allain, M. Alloisio, A. Aparici-Gil, C. Catalano, F. Chassagnek, S. Chokhandre, K. Crevits, H. Crielaard, E. Cunnane, C. Cunnane, K. De Leener, A. Desai, R. Driessen, A. Erdemir, M. Eskandari, S. Evans, C. Gasser, M. Gebhardt, B. Glasmacher, G.A. Holzapfel, M. Isasi, L. Jennings, S. Kurz, S. Leal-Marin, P. Lecomte, A. Morch, J. Mulvihill, F. Nemavhola, T. Pandelani, S. Pasta, E. Peña, B. Pierrat, H.-L. Ploeg, S. Polzer, M. Rausch, D. Schwarz, H. Screen, S. Sherifova, G. Sommer, S. Wang, D. Walsh, D. Yadav, T. Marchal and L. Geris [pdf] Community challenge towards consensus on characterization of biological tissue: C4Bio’s first findings.Journal of Biomechanics, in press. M. Yusefi, E. Agrafiotis, C.S. Holzer-Stock, F. Bogoni, P. Regitnig, M. Andreas, H. Mächler, G. Sommer and G.A. Holzapfel [pdf] Comparative biomechanical and structural evaluation of region-specific stented and non-stented ex vivo perfused human thoracic aortas.Acta Biomaterialia, 208:411-427, 2025. F. Bogoni, M.S. Brunner, G. Almer, G. Hörl, Y.G. Tehlivets, G. Sommer, O. Tehlivets and G.A. Holzapfel [pdf] Homocysteine leads to aortic stiffening in a rabbit model of atherosclerosis.Acta Biomaterialia, 201:412-428, 2025. M.S. Massaro, G. Sommer, A. Pukaluk, H. Wolinski, R. Palek, L. Cervenkova, J. Sevcik, K. Rampitsch, L. Bolek, V. Liska, G.A. Holzapfel and V. Moulisova [pdf] Native and decellularized porcine vena cava: Biomechanical and microstructural comparison. Acta Biomaterialia, 201:429-445, 2025. F. Lanzl, S. Peldschus, G.A. Holzapfel, F. Duddeck and G. Sommer [pdf] A microstructural material model for adipose tissue under blunt impact considering different types of loading.Journal of the Mechanical Behavior of Biomedical Materials, 169:107042, 2025. M. Yusefi, E. Agrafiotis, P. Regitnig, G. Laufer, G. Sommer, G.A. Holzapfel and H. Mächler [pdf] TEVAR versus open aortic arch replacement in ex vivo perfused human thoracic aortas. Acta Biomaterialia, 192:140-150, 2025. A. Greiner, N. Reiter, J. Hinrichsen, M.P. Kainz, G. Sommer, G.A. Holzapfel, P. Steinmann, E. Comellas and S. Budday [pdf] Model-driven exploration of poro-viscoelasticity in human brain tissue: Be careful with the parameters! Interface Focus, 14:20240026, 2024. O. Tehlivets, G. Almer, M.S. Brunner, M. Lechleitner, G. Sommer, D. Kolb, G. Leitinger, C. Diwoky, H. Wolinski, H. Habisch, P. Opriessnig, F. Bogoni, D. Pernitsch, M. Kavertseva, B. Bourgeois, J. Kukilo, Y.G. Tehlivets, A.N. Schwarz, T. Züllig, V. Bubalo, S. Schauer, A. Groselj-Strele, G. Hoefler, G.N. Rechberger, M. Herrmann, K. Eller, A.R. Rosenkranz, T. Madl, S. Frank, G.A. Holzapfel, D. Kratky, H. Mangge and G. Hörl [pdf] Homocysteine contributes to atherogenic transformation of the aorta in rabbits in the absence of hypercholesterolemia.Biomedicine & Pharmacotherapy, 178:117244, 2024. T. Škugor, L. Virag, G. Sommer and I. Karšaj [pdf] Improved mechanical characterization of soft tissues including mounting stretches.Mathematical and Computational Applications, 29:55, 2024. A. Pukaluk, G. Sommer and G.A. Holzapfel [pdf] Multimodal experimental studies of the passive mechanical behavior of human aortas: current approaches and future directions.Acta Biomaterialia, 178:1-12, 2024. A. Pukaluk, H. Wolinski, C. Viertler, P. Regitnig, G.A. Holzapfel and G. Sommer [pdf] Changes in the microstructure of the human aortic adventitia under biaxial loading investigated by multi-photon microscopy.Acta Biomaterialia, 161:154–169, 2023. M. Amor, V. Bianco, M. Buerger, M. Lechleitner, N. Vujić, A. Dobrijević, A. Akhmetshina, A. Pirchheim, B. Schwarz, A.R. Pessentheiner, F. Baumgartner, K. Rampitsch, S. Schauer, I. Klobučar, V. Degoricija, G. Pregartner, D. Kummer, M. Svecla, G. Sommer, D. Kolb, G.A. Holzapfel, G. Hoefler, S. Frank, G.D. Norata and D. Kratky [pdf] Genetic deletion of MMP12 ameliorates cardiometabolic disease by improving insulin sensitivity, systemic inflammation, and atherosclerotic features in mice.Cardiovascular Diabetology, 22:327, 2023. F. Cosentino, S. Sherifova, G. Sommer, G. Raffa, M. Pilato, S. Pasta and G.A. Holzapfel [pdf] Regional biomechanical characterization of human ascending aortic aneurysms: microstructure and biaxial mechanical response.Acta Biomaterialia, 169:107-117, 2023. W. Zhang, J. Jilberto, G. Sommer, M. Sacks, G.A. Holzapfel and D. Nordsletten [pdf] Simulating hyperelasticity and fractional viscoelasticity in the human heart.Computer Methods in Applied Mechanics and Engineering, 411:116048, 2023. E. Biro, G. Sommer, G. Leitinger, H. Abraham, D.J. Kardos, Z. Oberritter, A.K. Saxena [pdf] Ultrastructural changes in esophageal tissue undergoing stretch tests with possible impact on tissue engineering and long gap esophageal repairs performed under tension.Scientific Reports, 13:1750, 2023. G. Almer, P. Opriessnig, H. Wolinski, G. Sommer, C. Diwoky, M. Lechleitner, D. Kolb, V. Bubalo, M.S. Brunner, A.N. Schwarz, G. Leitinger, G. Schoiswohl, G. Marsche, T. Niedrist, S. Schauer, W. Oswald, A. Groselj-Strele, M. Paar, G. Cvirn, G. Hoefler, G.N. Rechberger, M. Herrmann, S. Frank, G.A. Holzapfel, D. Kratky, H. Mangge, G. Hörl and O. Tehlivets [pdf] Deficiency of B vitamins leads to cholesterol-independent atherogenic transformation of the aorta.Biochemistry & Pharmacotherapy, 154:113640, 2022. A. Pukaluk, H. Wolinski, Ch. Viertler, P. Regitnig, G.A. Holzapfel and G. Sommer [",
  "content_length": 22917,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:12"
}