{
  "name": "Gerhard Weiss 0001",
  "homepage": "http://www.weiss-gerhard.info",
  "status": "success",
  "content": "GERHARD WEISS - homepage Gerhard Weiss Professor of Artificial Intelligence and Computer Science Department of Advanced Computing Sciences Maastricht\tUniversity, The Netherlands Home Publications Professional Activities Teaching & PhDs Contact I am a Full Professor of Artificial Intelligence and Computer Science at the Department of Advanced Computing Sciences (DACS) at Maastricht University since 2009. I had been the Chair of DACS from 2010 to 2020, and I am a co-director of the Swarmlab robotics laboratory. From 2014 to 2017 I was a Honorary Professor at the Department of Computer Science at the University of Liverpool (UK). Before joining Maastricht University I was the Scientific Director of SCCH GmbH (Austria), where my main responsibilities were e.g. the supervision and control of R&D projects for companies, the national and international positioning, strategic alignment, research and innovation management, coordination of funding acquisition, and industrial and scientific networking. Before that I was Assistant Professor at the Computer Science Department at Technical University Munich (Germany), where I headed the AI/Cognition research group at the Chair for Theoretical Computer Science and Foundations of Artificial Intelligence. I received my PhD in Computer Science from Technical University Munich and the Habilitation Degree from Johannes Kepler University Linz (Austria). I have been engaged as a scientific consultant for various European companies, including e.g. Siemens and EADS, and as an advisory board member of companies of different size. A particular focus of this engagement has been on the bi-directional know how transfer among industry and academia. My main research interests are in automated knowledge processing and the foundations and practical applications of artificial intelligence and multiagent systems. I am particularly interested in adaptive, learning systems and in the design and analysis of smart software/hardware systems and devices that are able act and interact cooperatively and competitively in a flexible and autonomous way. My primary research focus is on machine learning (including multiagent and distributed learning), with applications in various domains such as automated negotiation, scheduling, manufacturing, brain-computer interfaces, and cognitive robotics. Miscellaneous: My academic ancestry and my Erdös number. Thank you for your interest in my work.",
  "content_length": 2434,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:14"
}