{
  "name": "Gerhard Weber 0002",
  "homepage": "https://tu-dresden.de/ing/informatik/institut-fuer-angewandte-informatik/mci",
  "status": "success",
  "content": "Startseite Professur für Mensch-Computer-Interaktion — Professur für Mensch-Computer-Interaktion — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen © Nils Eisfeld Professur für Mensch-Computer-Interaktion mehr erfahren Professur für Mensch-Computer-Interaktion News Weitere News 27.10.2025 Veröffentlichung des Buches \"Advancements in Pin-Array Tactile Displays\"­ Das Buch \"Advancements in Pin-Array Tactile Displays\" von Prof. Dr. -Ing. Limin Zeng und Prof. Dr. rer. nat. Gerhard Weber wurde veröffentlicht. Weiterlesen Veröffentlichung des Buches \"Advancements in Pin-Array Tactile Displays\"­ 22.09.2025 Lehre im Wintersemester 2025/2026 Die Einschreibung zu den Lehrveranstaltungen für das kommende Semester ist ab dem 01.10.2025 geöffnet. Die Einschreibung erfolgt via OPAL. Weiterlesen Lehre im Wintersemester 2025/2026 20.03.2025 ­Lehre im Sommersemester 2025 Die Einschreibung zu den Lehrveranstaltungen für das kommende Semester ist ab dem 24.03.2025 geöffnet. Die Einschreibung erfolgt via OPAL Weiterlesen ­Lehre im Sommersemester 2025 Weitere News Wichtige Themen im Überblick © Lucas Vogel Prof. Gerhard Weber Professor Weber leitet die MCI seit 2007. Erfahren Sie hier Wissenswertes zu seinem Wirken und den Arbeitsfeldern der MCI an der TU Dresden. Weiterlesen Prof. Gerhard Weber Lehrveran­staltungen Informieren Sie sich über das Lehrangebot der Professur für Mensch-Computer Interaktion. Das angebotene Spektrum reicht von Einführungsveranstaltungen für Studierende des ersten Fachsemesters über Master-Vorlesungen bis hin zu Seminararbeiten und Komplexpraktika. Weiterlesen Lehrveranstaltungen © fancycrave.com Forschung Hier finden Sie Informationen zu Forschungsprojekten, an denen sich der MCI-Lehrstuhl aktiv beteiligt. Weiterlesen Forschung © fancycrave.com Was ist Mensch-Computer-Interaktion? \"Human-Computer Interaction (HCI) is a discipline concerned with the design, evaluation and implementation of interactive computing systems for human use and with the study of major phenomena surrounding them.” [ACM, SIGCHI] Die MCI analysiert den Kontext von Computern den Faktor Mensch den Entwicklungsprozess von Benutzeroberflächen die Architektur von Programmierschnittstellen Name Team Assistenz: Rita Liebscher E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau (APB), 1. OG, Raum 1055 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. Adresse postal Postadresse: Technische Universität Dresden Fakultät Informatik Institut für angewandte Informatik Professur Mensch-Computer Interaktion 01062 Dresden work Tel. fax Fax +49 351 463-38491 Öffnungszeiten: Dienstag: 08:30 - 13:00 Mittwoch: 08:30 - 13:00 Donnerstag: 08:30 - 13:00 Lehrangebot der MCI Lehrangebot der Fakultät Informatik Prüfungsorganisation © TU Dresden",
  "content_length": 2924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:15"
}