{
  "name": "Gerhard Weikum [INF]",
  "homepage": "http://www.mpi-inf.mpg.de/~weikum",
  "status": "success",
  "content": "Homepage: Gerhard Weikum (Max-Planck-Institut für Informatik) Homepage: Gerhard Weikum Home People Personal Homepage Contact Biography Awards Research Talks Publications Activities Contact Gerhard Weikum Max-Planck-Institut für Informatik Department 5: Databases and Information Systems office: Campus E1 4, Room 401 Saarland Informatics Campus 66123 Saarbrücken Germany email: Get my email address via email phone: +49 681 9325-5000 fax: +49 681 9325-5099 Note: I am officially retired, and my professional activities are limited. In particular, I cannot take any new students or postdocs. Short Biography Gerhard Weikum is a Scientific Director at the Max Planck Institute for Informatics in Saarbruecken, Germany, and an Adjunct Professor at Saarland University. Earlier he held positions at Saarland University in Saarbruecken, Germany, at ETH Zurich, Switzerland, at MCC in Austin, Texas, and he was a visiting senior researcher at Microsoft Research in Redmond, Washington. He received his diploma and doctoral degrees from the University of Darmstadt, Germany. Gerhard Weikum's research spans transactional and distributed systems, self-tuning database systems, data and text integration, and the automatic construction of knowledge bases. He co-authored a comprehensive textbook on transactional systems, received the VLDB 10-Year Award for his work on automatic database tuning, and is one of the creators of the YAGO knowledge base which was recognized by the WWW Test-of-Time Award in 2018. Weikum is an ACM Fellow and a member of several academies. He received a Google Focused Research Award in 2010, the ACM SIGMOD Contributions Award in 2011, an ERC Synergy Grant in 2013, the ACM SIGMOD Edgar F. Codd Innovations Award in 2016, the Konrad Zuse Medal in 2021, and an honorary doctorate from the University of Athens in 2024. Selected Awards Honorary Doctorate (Dr. h.c.) from the National and Kapodistrian University of Athens Konrad Zuse Medal 2021 (by the German Computer Society) ECIR Test of Time Award, presented at the ECIR Conference 2020 ((jointly with Klaus Berberich, Omar Alonso and Srikanta Bedathur) Member of the National Academy of Sciences Leopoldina Seoul Test of Time Award, presented at the Web Conference (WWW) 2018 ((jointly with Fabian Suchanek and Gjergji Kasneci) AIJ (Artificial Intelligence Journal) Influential Paper Award, presented at IJCAI 2017 (jointly with Johannes Hoffart, Fabian Suchanek and Klaus Berberich) ACM SIGMOD Edgar F. Codd Innovations Award Robert Piloty Prize ERC Synergy Grant (jointly with Michael Backes, Peter Druschel and Rupak Majumdar) Member of the Academy of Sciences and Literature Mainz Member of the Academia Europaea ACM SIGMOD Contributions Award Google Focused Research Award Fellow of the German Computer Society (GI) Member of the German Academy of Science and Engineering (acatech) ACM Fellow 2005 CIDR 2005 Timeless Idea Award VLDB 10-Year Award 2002 Best Paper Awards at WWW 2018, CIKM 2010, CIKM 2006, SIGMOD 1998 (with co-authors) Best Demo Award at WWW 2011 (with co-authors) Research Interests Distributed information systems Database performance optimization (automatic tuning) and self-organization (autonomic computing) Data and text integration Web mining and text analysis Knowledge base construction and curation Publications See the homepage of my research group, my complete list of publications, my DBLP entry, or my Google Scholar entry. Copyright 2018 by Max Planck Institute for Informatics Imprint / Impressum | Data Protection / Datenschutzhinweis",
  "content_length": 3547,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:15"
}