{
  "name": "Gerhard Wunder",
  "homepage": "https://www.mi.fu-berlin.de/en/inf/groups/ag-comm/team-members/wunder.html",
  "status": "success",
  "content": "Prof. Dr.-Ing. habil. Gerhard Wunder • Cybersecurity and AI • Department of Mathematics and Computer Science Springe direkt zu Inhalt Department of Mathematics and Computer Science/Computer Science/Cybersecurity and AI Path NavigationHomepageComputer ScienceWork GroupsCybersecurity and AITeam MembersProf. Dr.-Ing. habil. Gerhard WunderProf. Dr.-Ing. habil. Gerhard Wunder The Cybersecurity and AI (C-AI) Group at Freie Universität Berlin (FUB), Department of Mathematics and Computer Science, is directed by Prof. Gerhard Wunder and supported by Bundesdruckerei GmbH. It focuses on AI with Cybersecurity as well as Cybersecurity through AI. It hosts particularly the new Center for Trustworthy AI at FUB. Other important initiatives are the 6G Research and Innovation Cluster supported by BMBF and the *new* BMBF initiative on Generative AI and Cybersecurity. Topics are: Chances und Risks of Generative AI Resilient networks (DFG SPP 2378) Privacy-Preserving Synthetic Data Explainability and Fairness in AI Quantum Crypto Analysis AI Engine for Anomaly Detection Cybersecurity Architectures in IoT AI-assisted Device Biometrics Low Resource Federated Learning with Blockchains Contact me at: g.wunder@fu-berlin.deContactPersonal ProfileTeachingDepartment of Mathematics and Computer ScienceInstitute for Computer ScienceCybersecurity and AIHead of the GroupAddressTakustr. 9Room 10914195 BerlinOffice+49 30 838 75212Telephone+49 30 838 61931, Webex: https://fu-berlin.webex.com/webappng/sites/fu-berlin/dashboard/pmr/gerhard.wunderEmailg.wunder [at] fu-berlin.deHomepageGoogle scholarCybersecurity and AIShort bio: I'm a Cybersecurity & AI Professor at FU Berlin, one of the few Excellence Universities in Germany, and Heisenberg Fellow of the 'Deutsche Forschungsgemeinschaft' (DFG). I'm supporting the 'Arbeiterkind' initiative.I studied electrical engineering and received my graduate degree in Electrical Engineering (Dipl.-Ing.) from TU Berlin with Distinction in 1999. I received the PhD degree (Dr.-Ing.) with Summa Cum Laude in 2003 from TU Berlin under Prof. Boche (TU München, Leibnitzpreis recipient). Right after, I became a research group leader at the Fraunhofer Heinrich-Hertz-Institut in Berlin, co-initiating the first-ever German-Sino-Institute for Mobile Communications. In 2007, I also received soon my Habilitation Degree and became a Privatdozent (Associate Professor) at the TU Berlin. In this period, I hold Visiting Professor positions at the Georgia Institute of Technology (Prof. Jayant) in Atlanta (USA, GA), and the Stanford University (Prof. Paulraj) in Palo Alto/USA (CA). In 2009 I was parallel a Consultant at Bell Labs (USA, NJ), both at the famous Murray Hill (Prof. Stolyar) and Crawford Hill (Prof. Valenzuela) Bell Labs premises.In 2014, I have become a Heisenberg Fellow, granted for the first time to a communication engineer ever, and established the Heisenberg Communications and Information Theory (Heisenberg CIT Group) at the FU Berlin. Since 2021 I'm a Professor for Cybersecurity & AI at FU (Stiftungsprofessur Bundesdruckerei GmbH). I'm a recipient of research fellowships from the German national research foundation (DFG), currently in the DFG priority programs SPP 1798 CoSIP (Compressed Sensing in Information Processing), and the SPP 1914 CPN (Cyber-Physical Networking). I have been a coordinator and principal investigator in the FP7 project 5GNOW on 5G new waveforms (awarded outstanding excellence by EC), and PROPHYLAXE on IoT Physical Layer Security funded by German BMBF (awarded). I have co-chaired numerous international renowned workshops, conference tracks, special issues, particularly in the context of ML/AI and 5G/6G. I have co-chaired the IEEE GLOBECOM 2017 Signal Processing for Communications Symposium and will co-chair the Machine Learning for Communications track at the IEEE International Conference on Communications 2022. Recently, I have been nominated together with Dr. Müller (BOSCH Stuttgart) and Prof. Paar (Ruhr University Bochum) for the Deutscher Zukunftspreis 2017 on behalf of the PROPHYLAXE project. Awards and Honour: 2021    IEEE Best Tutorial Paper Award for paper “5G: A Tutorial Overview of Standards, Trials, Challenges, Deployment, and Practice,\" appeared in IEEE Journal on Selected Areas in Communications 2015     Heisenberg Fellowship of German Science Foundations (DFG)The most prestigious German fellowship (established 1977), awarded for the first time ever to an communication engineer. 2014     IEEE Communications Society Award for distinguished service as Tutorials and Workshop Chair 2011     National award for outstanding scientific publication in the field of communication engineering by the German communication engineering society (ITG Award 2011):J. Bühler and G. Wunder, Traffic-Aware Optimization of Heterogeneous Access Management, IEEE Transactions on Communications, June 2010, vol. 58, no. 6 2003     Ph.D. in Electrical Engineering with Summa Cum Laude 1999     Electrical Engineering Diploma with highest honors from TU Berlin Please check FU website for updated course listPlease enable JavaScript in Your browser. NewsPlease enable JavaScript.overview",
  "content_length": 5179,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:14"
}