{
  "name": "Gerhard Widmer",
  "homepage": "https://www.jku.at/en/institute-of-computational-perception/about-us/people/gerhard-widmer",
  "status": "success",
  "content": "Gerhard Widmer | Institute of Computational Perception Skip to content (access key: 1) Skip to Search (access key: 2) Univ.-Prof. Dr. Gerhard Widmer (Foto: Maria Ziegelböck) Head of Institute Science Park 3 - S3 0445, and 1010 Vienna, Ehem. Postsparkasse, Georg-Coch-Platz 2 / 2. Stock +43 732 2468 4701 +43 732 2468 4705 gerhard.widmer(at)jku.at Falling Walls Science Breakthrough of the Year (Art & Science), Falling Walls Science Summit 2021, Berlin Play video We would like to point out that when playing the video, data may be transmitted to external parties. Learn more by reading our data privacy policy Data protection information Data protection information We would like to point out that when playing the video, data may be transmitted to external parties. Learn more by reading our data privacy policy Play video Current Positions Professor and Head of the Institute of Computational Perception (Linz & Vienna) at the Johannes Kepler University Linz (JKU), Austria. Deputy Director of the LIT | AI Lab at the Linz Institute of Technology (LIT), opens in new window Teaching University Courses Here is an up-to-date list of all classes taught at our institute And here are the courses (including teacher names) we offer in the current semester Research Research Interests Artificial Intelligence Machine Learning and Pattern Recognition Intelligent Music and Audio Processing Computational Models of Expressive Music Performance Music Information Retrieval (MIR) Projects List of Research Projects at our Institute Publications My Google Scholar Profile, opens an external URL in a new window .. sorted by recency, opens an external URL in a new window Invited Talks and Keynotes 2001: 12th European Conference on Machine Learning (ECML'2001), opens an external URL in a new window, Freiburg, Germany 2001: 8th Brazilian Symposium on Computer Music (SBCM'2001), opens an external URL in a new window, Fortaleza, Brazil 2001: 9th Spanish Conference on Artificial Intelligence (CAEPIA'2001), opens an external URL in a new window, Gijón, Spain 2002: ESCOM Conference on Musical Creativity 2002, opens an external URL in a new window, Symposium on Artificial Intelligence and Creativity, Liège, Belgium 2002: 13th International Conference on Algorithmic Learning Theory (ALT'02), opens an external URL in a new window and 2002: 5th International Conference on Discovery Science (DS'02), opens an external URL in a new window, Lübeck, Germany 2002: 15th European Conference on Artificial Intelligence (ECAI'02), opens an external URL in a new window, Lyon, France 2003: 3rd decennial Stockholm Music Acoustics Conference (SMAC'03), opens an external URL in a new window, Stockholm, Sweden 2003: AT21 Gala, opens an external URL in a new window, Graz, Austria 2004: AT21 Gala, opens an external URL in a new window, Schloss Schönbrunn, Vienna 2004: First Central European International Multimedia and Virtual Reality Conference, opens an external URL in a new window, Veszprém, Hungary 2005: 22nd International Conference on Machine Learning (ICML 2005), opens an external URL in a new window and \t2005: 15th International Conference on Inductive Logic Programming (ILP 2005) , opens an external URL in a new window, Bonn, Germany 2006: 18th European Meeting on Cybernetics and Systems Research (EMCSR 2006), opens an external URL in a new window, Vienna, Austria 2007: Science Impact - Rethinking the Impact of Basic Research on Science and the Economy, opens an external URL in a new window \t(organized by FWF, opens an external URL in a new window and European Science Foundation, opens an external URL in a new window), Vienna, Austria: \tClosing event: \"The Beauty of Basic Research: Computers Explore Musical Expressivity\", opens an external URL in a new window 2008: 1st International Conference of Students of Systematic Musicology (SysMus08), opens an external URL in a new window, Graz, Austria 2009: 18th International Symposium on Methodologies for Intelligent Systems (ISMIS 2009), opens an external URL in a new window, Prague, Czech Republic 2010: Vienna Talk 2010 on Music Acoustics, opens an external URL in a new window, University of Music and Performing Arts Vienna 2012: 13th International Conference on Computers Helping People with Special Needs (ICCHP 2012), opens an external URL in a new window, Linz, Austria 2012: 12th International Conference on Music Perception and Cognition (ICMPC) & 8th Triennial Conference of the European Society for the Cognitive Sciences of Music (ESCOM), opens an external URL in a new window, Thessaloniki, Greece 2014: 53rd AES Conference on Semantic Audio, opens an external URL in a new window; Audio Engineering Society (AES); Barbican Centre, London, UK. 2015: 11th European Computer Science Summit (ECCS 2015), opens an external URL in a new window, Informatics Europe; Public ARTEMATICA 2015 Lecture, opens an external URL in a new window on Computer and Music, opens an external URL in a new window research. Künstlerhaus (House of Austrian Artists), Vienna. 2016: ACM Europe womENcourage 2016, opens an external URL in a new window; Linz, Austria. 2016: 31st Annual Congress, EPTA (European Piano Teachers Association) Austria, opens an external URL in a new window; Ars Electronica Center, Austria. 2017: Karajan Music Tech Conference, opens an external URL in a new window: 50th Easter Festival (Osterfestspiele), opens an external URL in a new window, Salzburg. 2017: Slovenian Conference on Artificial Intelligence, opens an external URL in a new window, Ljubljana, Slovenia. 2019: 12th Europe-Korea Conference on Science and Technology (EKC 2019), opens an external URL in a new window, Vienna, Austria. 2019: Augmenting Performance Conference, opens an external URL in a new window, International Center for Research and Education in Innovative Creative Technologies (CINETic), Bucharest, Romania. 2021: 13th International Conference on Agents and Artificial Intelligence (ICAART 2021), opens an external URL in a new window, Vienna, Austria. 2021: Austrian Academy of Sciences (ÖAW), opens an external URL in a new window, Joint Session 2022, Vienna, Austria. 2021: Falling Walls Summit 2021, opens an external URL in a new window, Berlin, Germany. (Science Breakthrough of the Year, opens an external URL in a new window) 2022: 31st International Joint Conference on Artificial Intelligence and 25th European Conference on Artificial Intelligence (IJCAI-ECAI 2022), opens an external URL in a new window, Vienna, Austria 2023: Annual Conference of the German Musicological Society (GfM), opens an external URL in a new window, Saarbrücken, Germany 2024: Wiener Vorlesungen (Vienna Lectures), opens an external URL in a new window, Vienna City Hall (Video/Livestream, opens an external URL in a new window) Scientific Functions Scientific Functions and Services Member of the Executive Board, opens an external URL in a new window of the International Research Center for Cultural Studies (IFK), opens an external URL in a new window, Vienna (since 2015) Member of the Editorial/Advisory Board of \t AAAI Press, opens an external URL in a new window Machine Learning, opens an external URL in a new window Journal of Artificial Intelligence Research (JAIR), opens an external URL in a new window (2003-2007) Intelligent Data Analysis, opens an external URL in a new window (1996-2006) AI Communications (AICom), opens an external URL in a new window (2000-2004) Journal of New Music Research, opens an external URL in a new window 2015: Member of an international expert panel evaluating the Department of Information and Communication Technologies, opens an external URL in a new window of the Universitat Pompeu Fabra (UPF), opens an external URL in a new window, Barcelona Guest Editor (jointly with Miroslav Kubat, opens an external URL in a new window) of a Special Issue on \"Context Sensitivity and Concept Drift\", opens an external URL in a new window, Machine Learning, opens an external URL in a new window 32(2), August 1998 Guest Editor of a Special Issue on \"Machine Learning in Music\", opens an external URL in a new window, Machine Learning, opens an external URL in a new window 65 (2/3), Dec. 2006 2006 Co-chair of a Special Track on AI, the Arts, and Creativity, opens an external URL in a new window at the 31st International Joint Conference on Artificial Intelligence and the 25th European Conference on Artificial Intelligence (IJCAI-ECAI 2022), opens an external URL in a new window Organisation of Conferences and Workshops Local chair (jointly with Igor Mozetic, opens an external URL in a new window) of the \t 6th European Conference on Machine Learning (ECML-93), Vienna Programme Chair (jointly with Maarten van Someren, opens an external URL in a new window) of the \t 9th European Conference on Machine Learning (ECML-97), opens an external URL in a new window, Prague (Co-)Organizer and (co-)chair of the following workshops: \t ECAI-92 Workshop on Artificial Intelligence and Music, 10th European Conference on Artificial Intelligence (ECAI-92), Vienna IJCAI-95 Workshop on Artificial Intelligence and Music, opens an external URL in a new window, International Joint Conference on Artificial Intelligence (IJCAI-95), Montreal, Canada ICML-96 Workshop on Learning in Context-Sensitive Domains, opens an external URL in a new window, 13th International Conference on Machine Learning (ICML-96), Bari, Italy (jointly with Miroslav Kubat, opens an external URL in a new window) AAAI-2000 Workshop on Artificial Intelligence and Music, opens an external URL in a new window, 17th National Conference on Artificial Intelligence (AAAI'2000), opens an external URL in a new window, Austin, Texas (jointly with William Birmingham, opens an external URL in a new window and Roger B. Dannenberg, opens an external URL in a new window) IJCAI'03 Workshop on Methods for Automatic Music Performance and their Applications in a Public Rendering Contest, opens an external URL in a new window, 18th Joint Inter",
  "content_length": 26830,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:14"
}