{
  "name": "Gernot R. Müller-Putz",
  "homepage": "https://www.tugraz.at/institute/ine/people/gernot-mueller-putz",
  "status": "success",
  "content": "INE - gernot-mueller-putz image/svg+xml Institute of Neural Engineering SCIENCEPASSIONTECHNOLOGYTUGraz LogoLogo of the TUGraz INE/gernot-mueller-putz Menü Institute HomeNewsContactTeamFoundersAlumniimage/svg+xmlStudying CoursesSummer termWinter termGuidelinesBachelor/Master Thesesimage/svg+xmlResearch Team Müller-PutzINTRECOMNeuroGraspClinical application of BCI-based motor Neuroprosthetics in spinal cord injuryFeel Your ReachCommunication in DoCAutonomous control through measurement of the neural correlate of perturbationTeam WriessneggerPassive BCI systemsEffects of visuo-spatial complexity on motor imageryVR based neurofeedback environmentsTeam LenkPublicationsResearch FieldsPast ProjectsrE(EG)map!EEG@Wachkomabci4rehabCoupling measures in BCIsNoninvasive Multimodal Recording of Biosignals for Feedback ApplicationsEHK-NIRSSoftwareVideosimage/svg+xmlGraz BCI Conferences 10th Graz BCI Conference 20269th Graz BCI Conference 2024CommitteesProceedings and Contributions8th Graz BCI Conference 2019CYBATHLON BCI Series 2019Proceedings and ContributionsCommitteesPhotos of the Conference7th Graz BCI Conference 2017Proceedings and ContributionsCommitteesPhotos of the ConferenceBCI Science Slam VideoAfter Conference Questionaire6th Graz BCI Conference 20145th Graz BCI Conference 20114th Graz BCI Conference 20083rd Graz BCI Conference 2006image/svg+xmlGraz BCI Racing Team Gernot R. Müller-Putz, Univ.-Prof. Dipl.-Ing. Dr. techn. Head of the Institute of Neural Engineering Graz Brain-Computer Interface Lab Graz Brain-Spine Lab Graz University of Technology Stremayrgasse 16/IV Dean of the Faculty of Computer Science & Biomedical Engineering Inffeldgasse 10/2 8010 Graz, Austria email: gernot.muellernoSpam@tugraz.at tel: +43 316 873 30700 Follow me on LinkedIn and on YouTube Oktober 2025 Ocotber 23: 50 years of the Austrian Society for Biomedical Engineering: Anniversary Meeting in Vienna I am a speaker there October 7: 20 years of the Styrian Brain Research Initiative (Initiative Gehirnforschung Steiermark): Symposium I am a speaker there June 2025 In June (2.-6.) the BCI Community meets in Banff at the 11th BCI Meeting. May 2025 - Co-organizing the NeuroIS Retreat in Vienna - and Panel member of a round table: Building the Next Generation of NeuroIS Scholars: Lessons Learned, Challenges Overcome, and Future Directions for the Field - Talk at g.tec Spring School for Brain-Computer Interfaces and Neurotechnology, May 6. April 2025 23.4.: I am a speaker in the Neural Interfacing Training Program at Carnegie Mellon University. 9.4.: I am speaking at the Inclusion Day at TU Graz. January 2025 Had a keynote at STIM-ASSIST Forum in Utrecht. If you are interested in working with EEG, neuroprosthetics, robotics, persons with spinal cord injury, persons with disorders of consciousness, and want to develp new BCI systems for communication and control: make an appointment and let us talk! You would like to develop software/apps for mobile telephones in the BCI sector? Doing a thesis in the filed of Information Systems? make an appointment and let us talk! Interested in studying error potentials, motor related cortical potentials or work on decoding of movement?: make an appointment and let us talk! Join the BCI Racing Team Mirage91 and do your thesis / project with a group of enthusiastic students. Work on your thesis in an international research environment! Interested in going abroad to do the master thesis? make an appointment and let us talk! Prof. Dr. Gernot Müller-Putz is head of the Institute of Neural Engineering and its associated Laboratory of Brain-Computer Interfaces. He received his MSc in electrical and biomedical engineering in 2000, his PhD in electrical engineering in 2004 and his habilitation and “venia docendi” in medical informatics from Graz University of Technoloy in 2008. Since 2014 he is full professor for semantic data analysis. He has gained extensive experience in the field of biosignal analysis, brain-computer interface research, EEG-based neuroprosthesis control, communication with BCI in patients with disorders of consciousness, hybrid BCI systems, the human somatosensory system, and BCIs in assistive technology over the past 18 years. He has also managed several national projects (State of Styria) and international projects (Wings for Life, EU Projects) and recently coordinated the EU Horizon 2020 project MoreGrasp. Furthermore, he organized and hosted seven international Brain-Computer Interface Conferences over the last 20 years in Graz, the last one (9th Conference) in Sept. 2024. He is Associate Editor of IEEE Transactions in Biomedical Engineering and IEEE Reviews in Biomedical Engineering. In 2014/15 he was Guest editor in chief of a special issue of the Proceedings if the IEEE “The Plurality of Human Brain-Computer Interfacing”. Since August 2019 he is Speciality Editor in Chief of Frontiers in Human Neuroscience: Brain-Computer Interfaces. He has authored more than 213 peer reviewed publications and more than 210 contributions to conferences which were cited more than 29000 times (h-index 80). In 2015, he was awarded with an ERC Consolidator Grant “Feel your Reach” from the European Research Council. In May 2017 he received the Ludwig-Guttman Award from the German Medical Spinal Cord Injury Association (DMGP). In May 2018 he was elected into the Board of Directors of the International Brain-Computer Interface Society and served as Tresurer until June 2025. In May 2019 he received a research award from the State of Styria \"Digitalisierung in der Wissenschaft\". He is founding member and scientific Co-Director of the NeuroIS Society. Since 2024 he is board member of the Austrian Society for Biomedical Engineering. With October 2023 he was elected to be the Dean of the Faculty of Computer Science & Biomedical Engineering. (September 2025) Find all courses here and at TUG-Online. Graduate students, in a PhD program: Shayan Jalilpour, MSc Michael Wimmer, MSc Markus Crell, MSc Johanna Egger, Dipl.-Ing. Patrick Suwandjieff, Dipl.-Ing. Markus Oberndorfer, Dipl.-Ing. Kathrin Sterk, Dipl.-Ing. Lea Hehenberger, Dipl.-Ing. Mathias Schmoigl, MSc PhD finalized: Nitikorn Srisrisawang, PhD (06/2025) Hannah Wimmer, PhD (03/2025): Lecturer at FH Joanneum Joana Pereira, PhD (12/2021): PostDoc at University of Freiburg Catarina Lopes-Dias, PhD (03/2021): PostDoc at Medical University of Graz Andreas Schwarz, PhD (10/2020): currently at FFG Vienna Reinmar Kobler, PhD (10/2020): PostDoc at RIKEN, Japan Andreas Pinegger, PhD (12/2019): currently working by Magna, Austria. Patrick Ofner, PhD (11/2019): currently PostDoc at University of Freiburg, Germany. Steyrl David, PhD (11/2018): currently PostDoc at University of Vienna, Austria, Prof. F. Scharnowski. Christian Breitwieser, PhD (09/2017), currently at Ranorex GmbH, Graz Austria. Martin Seeber, PhD (03/2017), currently PostDoc at UCLA. Christoph Pokorny, PhD (02/2017), currently PostDoc at EPFL, Blue Brain Project. Petar Horki, PhD (04/2016), currently PostDoc at University of Freiburg, Inst. f. Medical Biometry and Statistics Josef Faller, PhD (10/2015), currently PostDoc. Alex Kreilinger, PhD (08/2015), currently at Brain Products GmbH, Germany. Martin Billinger, PhD (01/2015), currently MED-EL, Innsbruck My Publications image/svg+xml My Publications can be found here: PURE TU Graz Online ResearchGate Frontiers YouTube Channel Editorial Activities image/svg+xml Editor in Chief: Frontiers in Human Neuroscience: Brain-Computer Interfaces Associate Editor: IEEE Reviews in Biomedical Engineering IEEE Transactions in Biomedical Engineering My Projects image/svg+xml NeuroGrasp INTRECOM (EIC Pathfinder) Feel Your Reach (ERC Consolidator) MoreGrasp (EU Horizon 2020, RIA, Coordinator) EEG@Wachkoma (Land Steiermark) BNCI Horizoin 2020 (EU FP7, CSA, Coordinator) BackHome (EU FP7, Strep, Partner) BrainAble (EU FP7, Strep, Partner) Better (EU FP7, Strep, Partner) Decoder (EU FP7, Strep, Partner) Tobi (EU FP7, IP, Partner) Engagement in Societies image/svg+xml Founding Member and Member (Board Member 2019, Treasurer 2019-2025) of the BCI Society Founding Member and Co-Scientific Director of Society for NeuroInformation Systems (NeuroIS) Board Member (Treasurer) of the Styrian Brain Research Initiative (Inge ST) Board Member of the Austrian Society for Biomedical Engineering (ÖGBMT), Chair Stefan Schuy Award Book published image/svg+xml Together with Prof.Dr. Rüdiger Rupp from Heidelberg University Hospital, Spinal Cord Injury Center, I have edited the following book: We have 5 sections: Basics, Neuroprosthetics in Spinal Cord Injury, Clinical Brain–Computer Interfaces, Clinical Use Cases and Practice, Outlook. Find more details follwing this link. Past News image/svg+xml Find past news here. Legal Notice, Privacy Policy, Barrierefreiheitserklärung Accept all cookies Save preferences Cookie-Categories: Functional Analysis Marketing We use cookies in order to be able to provide you with the best possible service in the future. In the privacy policy you will find further information as well as the possibility of withdrawal.",
  "content_length": 9125,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:17"
}