{
  "name": "Gernot A. Fink",
  "homepage": "http://patrec.cs.tu-dortmund.de/cms/en/home/People/Staff/fink.html",
  "status": "success",
  "content": "Pattern Recognition - TU Dortmund - Pattern Recognition - TU Dortmund To navigation To quick access To footer with other services To content Fakultät für Informatik Welcome to the homepage of the \"Pattern recognition\" group at TU Dortmund University! Our research focuses on the development and application of advanced pattern recognition algorithms and systems for a variety of domains, including document analysis, human activity recognition, remote sensing, natural language processing, and uncertainty quantification of neural networks. Our goal is to push the boundaries of what is currently possible in these fields, and to create innovative solutions that can have a real impact on society. We are a highly interdisciplinary group, comprising researchers from a range of backgrounds, including computer science, electrical engineering, and mathematics. This diversity of expertise allows us to approach problems from a variety of angles, and to find creative solutions that might not be immediately obvious to researchers working in a single discipline. If you are interested in our work, we encourage you to browse through our research papers, learn more about our current projects, and get in touch with us to discuss potential collaborations. We are always looking for new ways to collaborate and make a positive impact in the world, and we welcome inquiries from researchers and practitioners alike. Thank you for visiting our homepage, and we hope to hear from you soon! 11/10/2025 WDR feature on the future of archives with interview contribution by Prof. Fink The WDR radio feature “DOK5 – Das Feature” explores the future of archives in the digital age featuring an interview contribution by Prof. Fink. 06/17/2025 Two Papers Accepted at ICDAR 2025 We’re thrilled to announce that two of our research papers have been accepted at the prestigious ICDAR 2025 conference in Wuhan, China. 04/01/2025 Project group \"AI meets Archives\" begins the project phase. The project group \"AI meets Archives\" begins the project phase. 11/08/2024 Prof. Dr. Alicia Fornes gives talk Alicia Fornes gives talk about \"Recognition of Historical Handwritten Documents in Low Resource Scenarios\" 11/07/2024 Fabian Wolf successfully defended his PhD thesis Fabian Wolf has successfully defended his PhD thesis titled \"Self-training for Handwritten Word Recognition and Retrieval\". 01/26/2024 Project group \"XAI\" wins the Alumni Informatik prize worth 1000 euros The students of the \"XAI\" project group won the Alumni Informatik prize worth 1000 euros. 05/22/2023 Project group \"HistWeb\" submits final report Students from the project group \"HistWeb\" successfully completed their work on an interactive website for analyzing and managing historical newspapers 07/29/2020 Pattern Recognition Group Wins Nakano Award This year the Nakano Award honouring the best paper was awarded to Fabian Wolf and Gernot A. Fink. 06/30/2020 Unleashing Big Data of the Past – Europe builds a Time Machine The European Commission has chosen Time Machine as one of the six proposals retained for preparing large scale research initiatives. 08/08/2018 Pattern Recognition Group Wins Best Student Paper Award at ICFHR 2018 This year, the IAPR Best Student Paper Award goes to Eugen Rusakov, Leonard Rothacker, Hyunho Mo, and Gernot A. Fink. 08/01/2018 German Research Foundation (DFG) Funds Collaborative Project for the Analysis of Cuneiform Tablets In the context of the project \"Computer-assisted Cuneiform Analysis\" (CuKa), the German Research Foundation (DFG) funds a collaboration between the… To top of page",
  "content_length": 3583,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:19"
}