{
  "name": "Ghassan AlRegib",
  "homepage": "https://ghassanalregib.info",
  "status": "success",
  "content": "OLIVES Back 2017 IEEE SPS Video and Image Processing (VIP) Cup 2023 IEEE SPS Video and Image Processing (VIP) Cup Back Olives - Omni Lab for Intelligent Visual Engineering and ScienceOLIVES ResearchWelcome to OLIVES, the Omni Lab for Intelligent Visual Engineering and Sciences! At OLIVES, we conduct transformational research in Machine Learning with the motto of ameliorating the data-centric nature of learning systems to be human-centric. Our research is applied to image and video processing and understanding, seismic imaging, perception in visual data processing, healthcare intelligence, and video analytics. The primary applications of the research span autonomous vehicle perception, ophthalmology, seismic interpretation, and trustworthy neural networks. Trust in AIDespite the remarkable performance of AI models in various fields, the viability of these models in consumer-facing applications remains a concern. Knowing when a model’s prediction can be trusted is critical for deployment. At OLIVES, we tackle trust in AI through a three-pronged approach. •First, we directly garner trust by enhancing the interpretability of decision making.•Next, we employ indirect applications of robustness and generalizability to enhance the applicability of neural nets in multifarious scenarios.•Finally, we target difficult real-world settings, including seismic and biomedical interpretations, that face application-specific challenges. Humans in the LoopA central factor in trustworthy autonomous systems is the presence of humans in different stages of an AI system’s deployment cycle - from data curation, to model training, evaluation, and deployment. In real world applications, an AI system requires different experts in each of these stages. For instance, in medical applications, doctors evaluate the decisions made by AI systems but are not well versed with its training. ML engineers can select the best possible models but may not be able to curate unbiased data for these models. Existing human-in-the-loop systems do not account for this variety in the required expertise. At OLIVES, we leverage limited experts and move towards experts-in-the-loop framework. BIO Ghassan AlRegib, Ph.D. Prof. AlRegib is currently a professor in the School of Electrical and Computer Engineering at the Georgia Institute of Technology. His group is the Omni Lab for Intelligent Visual Engineering and Science (OLIVES) at Georgia Tech. In 2012, he was named the Director of Georgia Tech’s Center for Energy and Geo Processing (CeGP). He is a faculty member of the Center for Signal and Information Processing (CSIP). He also served as the Director of Georgia Tech’s Initiatives and Programs in MENA between 2015 and 2018. He has authored and co-authored more than 230 articles in international journals and conference proceedings. He has been issued several U.S. patents and invention disclosures. He is a Senior Member of the IEEE.Prof. AlRegib received the ECE Outstanding Graduate Teaching Award in 2001 and both the CSIP Research and the CSIP Service Awards in 2003. In 2008, he received the ECE Outstanding Junior Faculty Member Award. In 2017, he received the 2017 Denning Faculty Award for Global Engagement.Prof. AlRegib participated in a number of activities. He is a Technical Program co-Chair for ICIP 2020 in Abu Dhabi. He is a voted member of the IEEE SPS Technical Committees on Multimedia Signal Processing (MMSP) and Image, Video, and Multidimensional Signal Processing (IVMSP), 2015-2017 and 2018-2020. He is a member of the Editorial Boards of both the IEEE Transactions on Image Processing (TIP), 209-present, and the Elsevier Journal Signal Processing: Image Communications, 2014-present. He was a member of the editorial board of the Wireless Networks Journal (WiNET), 2009-2016 and the IEEE Transaction on Circuits and Systems for Video Technology (CSVT), 2014-2016. He was an Area Chair for ICME 2016/17 and the Tutorial Chair for ICIP 2016. He served as the chair of the Special Sessions Program at ICIP’06, the area editor for Columns and Forums in the IEEE Signal Processing Magazine (SPM), 2009–12, the associate editor for IEEE SPM, 2007-09, the Tutorials co-chair in ICIP’09, a guest editor for IEEE J-STSP, 2012, a track chair in ICME’11, the co-chair of the IEEE MMTC Interest Group on 3D Rendering, Processing, and Communications, 2010-12, the chair of the Speech and Video Processing Track at Asilomar 2012, and the Technical Program co-Chair of IEEE GlobalSIP, 2014. He lead a team that is organizing the IEEE VIP Cup, 2017.His research group is working on projects related to machine learning, image and video processing, image and video understanding, seismic imaging, perception in visual data processing, healthcare intelligence, and video analytics. The primary applications of the research span from Autonomous Vehicles to Portable AI-based Ophthalmology and Eye Exam and from Microscopic Imaging to Seismic Interpretation. The group was the first to introduce modern machine learning to seismic interpretation. Prof. AlRegib has provided services and consultation to several firms, companies, and international educational and R&D organizations. He has been a witness experts in a number of patents infringement cases.Google scholar profile News Sep 16, 2021 ICIP 2021 Sep 16, 2021 Our group #OLIVES @GeorgiaTech is presenting 4 papers @ieeeICIP Check them out; more posts on the details of the 4 papers to follow! Read More → Sep 16, 2021 Oct 28, 2020 ICIP 2020 Oct 28, 2020 #OLIVES @GeorgiaTech presented 8 paper presentations at this year's #ICIP2020 @ieeeICIP @IEEEsps. Read More → Oct 28, 2020 Oct 16, 2020 SEG 2020 Oct 16, 2020 #OLIVES @GeorgiaTech presented 2 invited talks and 2 technical paper presentations @SEG_org. Read More → Oct 16, 2020 Oct 2, 2019 Best Paper Award @ICIP2019 Oct 2, 2019 Our paper titled \"Distorted Representation Space Characterization Through Backpropagated Gradients,\" was selected for the Best Paper Award at the 2019 IEEE International Conference on Image Processing (ICIP) in Taipei. Read More → Oct 2, 2019 Sep 26, 2019 ICIP 2019 Sep 26, 2019 The group attended #ICIP2019 in Taipei and gave 4 talks. Read More → Sep 26, 2019 Sep 26, 2019 SEG 2019 Sep 26, 2019 The group attended #seg2019 in San Antonio and gave 5 talks Read More → Sep 26, 2019 Jul 30, 2019 Farewell lunch to Dr. Alattar Jul 30, 2019 The group had a farewell lunch to Dr. Ashraf Alattar who is moving to Auburn University as a professor. Read More → Jul 30, 2019 Jun 26, 2019 Farewell Lunch to Dr. Zhiling Jun 26, 2019 The group had lunch together as a farewell to Dr. Zhiling Long who will join the faculty at Kenessaw State University... Best wishes Zhiling! Read More → Jun 26, 2019 Jun 17, 2019 Motaz Passes Ph.D. Proposal Exam Jun 17, 2019 Congrats to Master @MotazAlfarraj on passing PhD proposal exam & becoming a PhD candidate; on the utilization of ML when fuse 2 measurements that differ in resolution and sparsity; applications: subsurface and medical imaging. Well done! Read More → Jun 17, 2019 May 20, 2019 A new paper and dataset on facies classification May 20, 2019 Check our most recent paper \"A Machine Learning Benchmark for Facies Classification,\" which is a milestone in seismic interpretation as it is the first that publishes an open source benchmark for facies classification, overcoming serious obstacles Read More → May 20, 2019 Twitter Feed",
  "content_length": 7416,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:23"
}