{
  "name": "Ghassan Karame",
  "homepage": "http://www.ghassankarame.com",
  "status": "success",
  "content": "Prof. Dr. Ghassan Karame - Homepage Prof. Dr. Ghassan Karame (PGP Key) Home Publications Teaching Service Talks Patents About me Since November 2021, I am a full Professor of Computer Science at the Ruhr-University Bochum (RUB) - leading the Chair for Information Security. I am a Principal Investigator (PI) in the Cluster of Excellence CASA (Cyber Security in the Age of Large-Scale Adversaries) and,  since October 2023, the Director (and a PI) at the Horst Goertz Institute for IT Security (HGI). I am also involved as a (part-time) Chief Scientific Advisor at NEC Laboratories Europe. Before joining RUB, I was working as an NEC Fellow and was leading the Security research group at NEC Labs in Germany.  An outdated summary of my research at NEC Labs is highlighted in this interview. Prior to joining NEC Labs, I was working as a postdoctoral researcher in the Institute of Information Security of ETH Zurich, Switzerland. Since 2011, I hold a PhD degree in Computer Science from ETH Zurich. I am interested in all aspects of security and privacy with a focus on decentralized security, and distributed machine learning security. My full list of publications is available here (by date) and here (by topic). Besides my research, I contributed to more than 100 currently granted patents in the US and the EU. My full list of granted patents can be found here. Here, you can find my Book on Bitcoin and Blockchain Security published in 2016. Selected media reports and interviews covering some of my past research can be found here: [Link1] [Link2] [Link3] [Link4] [Link5]. You can also follow/contact me on the following networks: Open Positions I am always looking for motivated PhD students and postdoctoral researchers in the area of system & information security, particularly (but not limited to) those interested/specialiating in decentralized security and privacy, distributed machine learning security, federated learning security, distributed platforms security. If you are interested in working with me, please send me an email with your current CV and a description of why you think you are a good fit. Selected Recent Activities For a full list of my activities, please click here. Program/Track/Associate (Co-)Chair/Editor Senior Program Committee at AAAI26 Associate Chair at NDSS 2026 Area Chair at WWW 2025 Track Chair at ACM CCS 2023 (blockchain and distributed systems track) Associate Editor of IEEE T-IFS (2020 - Present) Associate Editor of IEEE TDSC (2020 - 2024) PC Chair of ACM CCSW 2017 Guest Editor of IEEE Security & Privacy, Special Issue on Blockchain security and privacy Program Committees PC Member of IEEE S&P 2024, 2026 PC Member of SBC 2025 PC Member of ICDE 2026 PC Member of AFT 2023, 2024, 2025 PC Member of ACM CCS 2024, 2025, 2026 PC Member of USENIX Security 2025, 2026 PC Member of WWW 2023, 2024, 2025, 2026 PC Member of NDSS 2024, 2025, 2026 PC Member of ACM SIGMOD 2024, 2025 PC Member of FC 2018, 2019, 2020, 2021, 2024, 2025 PC Member of ACNS 2020, 2021, 2024 PC Member of ACM ASIACCS 2017, 2022, 2023 PC Member of PETS 2020, 2021, 2022, 2023 PC Member of IEEE DSN 2021, 2022 PC Member of  ESORICS 2019, 2020, 2021, 2022 Awards & Recognition Outstanding Editorial Board Member Award, IEEE Signal Processing Society, 2024 Ranked by Stanford-Elsevier as top 2% authors, by career, in 2020, 2021, 2022, 2023, 2024. Recognized by AMiner as one of the top 100 most influential scholars in the area of security and privacy over the past 13 years (2013-2022, 2012-2021, 2011-2020). Value Realization Award (NEC Corporation), 2020 2019 best paper award at IEEE Transactions on Computers Research Contributions Award (NEC Corporation), 2018 and 2014 Excellent Innovation Award (NEC Corporation), 2017 and 2014 ACM CCS'16 paper measured as one of the normalized top 100 security papers! Selected Recent Talks For a full list of my talk, please click here. Larger Decentralized Platforms Don't Necessarily Offer Better Security, ESCAR, Frankfurt, Germany, November 2025 (Keynote talk) On the Security of Distributed Machine Learning, University of Waterloo, Canada, October 2025 (Invited Talk) Larger-scale Nakamoto-style Blockchains Don't Necessarily Offer Better Security, NTU Blockchain Symposium, Singapore, September 2024 (Invited talk) How to transfer Disruptive Technologies, ECSO Start-up Awards, Bochum, Germany, March 2024 (Keynote) Towards Trustworthy Platforms, EURECOM, Nice, France, November 2023 (Invited talk) Securing Blockchains with TEEs, EURECOM, Nice, France, November 2022 (Invited talk) Towards Secure and Scalable Blockchain Technologies, International Workshop on Blockchain and Cloud Computing, co-located with AsiaCCS 2021 (Virtual), June 2021 (Keynote talk) Towards Secure and Scalable Blockchains, TU Delft Blockchain Symposium, March 2021, (Keynote talk) Blockchain Security – Experience with PoW Blockchains, Dagstuhl Seminar 19451 \"Biggest Failures in Security\", Dagstuhl, Germany, November 2019 Blockchain Networks, IMDEA Networks Annual Workshop, May 2019, Madrid, Spain (Invited talk) Towards Secure and Scalable Blockchain Technologies, TU Darmstadt, Darmstadt, Germany, April 2019 (Invited talk) Selected Publications For a full list of my publications, please click here. Pascal Zimmer, Ghassan Karame Tuning for Two Adversaries: Enhancing the Robustness Against Transfer and Query-based Attacks using Hyperparameter Tuning In Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), 2026 [Preprint | Bibtex] (to appear) Simon Lachnit, Ghassan Karame On Hyperparameters and Backdoor-Resistance in Horizontal Federated Learning In Proceedings of the ACM Conference on Computer and Communication Security (ACM CCS) [Preprint | Bibtex] 2025 (to appear) Pascal Zimmer, Simon Lachnit, Alexander Jan Zielinski, Ghassan Karame Targeted Physical Evasion Attacks in the Near-Infrared Domain In Proceedings of the Network and Distributed Systems Security Symposium (NDSS) [Preprint | Bibtex] 2026 (to appear) Sebastien Andreina, Pascal Zimmer, Ghassan Karame On the Robustness of Distributed Machine Learning Against Transfer Attacks In Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), 2025 [Preprint | Bibtex] Annika Wilde, Tim Niklas Gruel, Claudio Soriente, Ghassan Karame The Forking Way: When TEEs Meet Consensus In Proceedings of the Network and Distributed Systems Security Symposium (NDSS) [Preprint | Bibtex] 2025 Sebastien Andreina, Tobias Clooters, Lucas Davi, Jens-Rene Giesen, Marco Gutfleish, Ghassan Karame, Alena Naiakshina, Houda Naji Defying the Odds: Solana's Unexpected Resilience in Spite of the Security Challenges Faced by Developpers. In Proceedings of the ACM Conference on Computer and Communications Security  (ACM CCS), 2024 [Preprint | Bibtex] Jannik Albrecht, Sebastien Andreina, Frederik Armknecht, Ghassan Karame, Giorgia Marson, Julian Willingmann Larger-scale Nakamoto-style Blockchains Don't Necessarily Offer Better Security In Proceedings of the IEEE Symposium on Security and Privacy  (IEEE SP), 2024 [Preprint | Bibtex] Pascal Zimmer, Sebastien Andreina, Giorgia Marson, Ghassan Karame Closing the Gap: Achieving Better Accuracy-Robustness Tradeoffs Against Query-Based Attacks In Proceedings of of the AAAI Conference on Artificial Intelligence (AAAI), 2024 [Preprint | Bibtex] Sven Smolka, Jens-Rene Giesen, Pascal Winkler, Oussama Draissi, Lucas Davi, Ghassan Karame, Klaus Pohl Fuzz on the Beach: Fuzzing Solana Smart Contracts In Proceedings of of the ACM Conference on Computer and Communications Security (ACM CCS), 2023 [Preprint | Bibtex] Karl Wüst, Loris Diana, Kari Kostiainen, Ghassan Karame, Sinisa Matetic, Srdjan Capkun Bitcontracts: Adding Expressive Smart Contracts to Legacy Cryptocurrencies In Proceedings of the Network and Distributed Systems Security Symposium (NDSS), 2021 [Preprint | Bibtex]. Michael Rodler, Wenting Li, Ghassan Karame, Lucas Davi EVMPatch: Timely and Automated Patching of Ethereum Smart Contracts In Proceedings of the USENIX Security Symposium (USENIX Security), 2021 [Preprint | Bibtex]. Jian Liu, Wenting Li, Ghassan Karame, N. AsokanScalable Byzantine Consensus via Hardware-assisted Secret SharingIn IEEE Transaction on Computers (IEEE TC), 2019 [Preprint | Bibtex]. Won 2019 best paper award at IEEE Transactions on Computers! Michael Rodler, Wenting Li, Ghassan Karame, Lucas Davi Sereum: Protecting Existing Smart Contracts Against Re-Entrancy Attacks In Proceedings of the Network and Distributed Systems Security Symposium (NDSS) [Preprint | Bibtex] 2019. Related media reports: [NEC]. Sinisa Matetic, Karl Wuest, Moritz Schneider, Kari Kosiainen, Ghassan Karame, Srdjan Capkun BITE: Bitcoin Lightweight Client Privacy using Trusted ExecutionIn Proceedings of the USENIX Security Symposium (USENIX Security),  2019,[Preprint | Bibtex]. Arthur Gervais, Ghassan Karame, K. Wuest, V. Glykantzis, Hubert, Ritzdorf, Srdjan Capkun On the Security and Performance of Proof of Work BlockchainIn Proceedings of the ACM Conference on Computer and Communications Security (ACM CCS), [Preprint | Bibtex], 2016. Measured as one of the normalized top 100 security papers! Frederik Armknecht, Ludovic Barman, Jens-Matthias Bohli, Ghassan KarameMirror: Enabling Proofs of Data Replication and Retrievability in the CloudIn Proceedings of the USENIX Security Symposium (USENIX Security), [Preprint | Bibtex], 2016 Ghassan Karame and Elli Androulaki Bitcoin and Blockchain Security Artech House, ISSBN 9781630810139, 240 pages, 2016 [Bibtex] Frederik Armknecht, Jens-Matthias Bohli, Ghassan Karame, Franck YoussefTransparent Data Deduplication in the CloudIn Proceedings of the ACM Conference on Computer and Communications Security (ACM CCS), 2015 [Preprint | Bibtex]. Arthur Gervais, Hubert Ritzdorf, Ghassan Karame, Srdjan Capkun Tampering with the Delivery of Blocks and Transactions in Bitcoin In Proceedings of the ACM Conference on Computer and Communications Security (ACM CCS), 2015 [Preprint | Bibtex]. Frederik ",
  "content_length": 11235,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:25"
}