{
  "name": "Ghazanfar Asadi",
  "homepage": "http://sharif.edu/~asadi",
  "status": "success",
  "content": "Hossein Asadi Ø¨Ù ÙØ§Ù Ø®Ø¯Ø§ Hossein Asadi my-last-name@sharif.edu Department of Computer Science and Engineering Data Storage, Networks, & Processing Lab (DSN). Publications Patents Students Hossein Asadi is a Full Professor in Department of Computer Science and Engineering at Sharif University of Technology (SUT). He joined SUT in March 2009. He is the founder and the director of \"Data Storage, Networks, and Processing\" (DSN) lab with the main research in the field of \"Data Storage Systems\", \"High-Performance Computing\", \"Memory Systems\", \"Virtualization\", and \"Operating Systems\". The DSN lab is known as one of the premier and leading research groups in the World in the field of data storage systems. Since 2009, he has developed three new graduate courses (Advanced Storage Systems, Advanced Operating System Design, and Reconfigurable Computing) in Department of Computer Science and Engineering of Sharif University of Technology (SUT). In 2011, he was awarded a Distinguished Lecturer Award by SUT. He got elevated to associate and full professor ranks at SUT in Oct. 2014 and Jan. 2020, respectively. In 2015, he co-founded the first company in the Middle East, designing and fabricating midrange, All-Flash, and high-end data storage systems. In the past few years, he received several prestigious awards from Sharif University of Technology, \"Distinguished Researcher Award\" in 2016, \"Distinguished Research Institute Award\" in 2016, \"Distinguished Technology Award\" in 2017, \"Distinguished Research Lab Award\" in 2019, and \"Distinguished Research Award in Patents\" in 2022. From 2016 to 2020, he has been consistently ranked in \"Top-10\" among 450+ faculties by Research and Technology Deputy, Sharif University of Technology. More recently, he received \"Distinguished National Technology Award\" in 2022 by Ministry of Science and Technology. Prior joining to SUT, he was with EMC Corporation, headquartered in Hopkinton, Massachusetts. He worked at EMC as a research scientist and senior hardware engineer from 2006 to 2009. In 2008, he was granted \"Extraordinary ability in Science\" (O1) visa by U.S. Citizenship and Immigration Services, sponsored by EMC Corporation. He was also a recipient of the Technical Award for the Best Robot Design from the International RoboCup Rescue Competition, organized by AAAI and RoboCup in 2001, a recipient of Best Paper Award at the 15th CSI International Symposium on Computer Architecture and Digital Systems (CADS) in 2010, and a recipient of Best Paper Award at IEEE/ACM Design, Automation, and Test in Europe (DATE) in 2019. His field of expertise is data storage systems and networks, solid-state drives, high-performance computing, and reconfigurable, and dependable computing. He has authored or co-authored more than a hundred publications in reputed journals and conference proceedings. He has served as the publication chair of several conferences. He has also served as a Guest Editor of IEEE Transactions on Computers, an Associate Editor of Microelectronics Reliability, and as a Program Co-Chair of the 18th International Symposium on Computer Architecture & Digital Systems (CADS2015). He recently visted the Department of Computer Science at the Johannes Gutenberg University (JGU) Mainz as a Visiting Professor from July 2021 to September 2022. He also visited the School of Computer and Communication Sciences of Ecole Polytechnique Federele de Lausanne (EPFL) as an invited professor for the summer 2015. Dr. Asadi also holds several international patents. He is a member of ACM and a senior member of IEEE. My page @Google Scholar My Research Lab @Sharif Univ My page @DBLP My page @LinkedIn My Full List of Publications @DSN Very Interesting Program to Watch: Collection of Near-Death Experience Interviews Experience and University/Industrial Positions Full Professor, Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran [2020-now]. Visiting Professor, Department of Computer Science, the Johannes Gutenberg University (JGU), Mainz, Germany [July 2021-September 2022]. Director, High-Performance Computing Center (HPC), Sharif University of Technology, Tehran, Iran [2015-now]. Director, Sharif Information Technology Center, Sharif University of Technology, Tehran, Iran [2017-2019]. Undergraduate Curriculum Committee Member, Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran [2016-2017]. Visiting Professor, School of Computer and Communication Sciences, Ecole Polytechnique Federele de Lausanne (EPFL), Lausanne, Switzerland [Summer 2015]. Tenured Associate professor, Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran [2014-2020]. Tenured Assistant professor, Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran [2013-2014]. Assistant professor, Department of Computer Science and Engineering, Sharif University of Technology, Tehran, Iran [2009-2012]. Senior Hardware Engineer & Research Scientist, EMC Corporation, Hopkinton, MA [2006-2009]. Graduate Research Assistant, Department of Electrical & Computer Engineering, Northeastern University, Boston, MA [2004-2006]. Researcher, Dependable Systems Laboratory (DSL), Sharif University of Technology, Tehran, Iran [2001-2003]. Education Ph.D. in Computer Engineering, Northeastern University, Boston [2004-2007]. M.Sc. in Computer Engineering, Sharif University of Technology, Tehran, Iran [2000-2002]. B.Sc. in Computer Engineering, Sharif University of Technology, Tehran, Iran, [1996-2000]. Editorials and Professional Positions Program Committee Member, 24th USENIX Conference on File and Storage Technologies (FAST), Feb. 2026. Program Committee Member, 17th ACM Workshop on Hot Topics in Storage and File Systems (HotStorage), Boston, MA, July 2025. Program Committee Member, 16th ACM Workshop on Hot Topics in Storage and File Systems (HotStorage), Santa Clara, CA, July 2024. Associate Editor, Microelectronics Reliability, Jan. 2018-Dec.2019. The CSI Journal on Computing Science and Information Technology (CSIT), Associate Editor, 2018-2020. Program Committee Member, 26th Euromicro International Conference on Parallel, Distributed, and Networked based Processing, Special on On-Chip Parallel and Networked-based Systems, Cambridge, UK, 2018. Program Committee Member, 29th ACM Symposium on Parallelism in Algorithms and Architectures, July 2017. Program Chair, 22th National CSI Computer Conference, Tehran, March 2017. Program Committee Member, 25th Euromicro International Conference on Parallel, Distributed, and Networked based Processing, Special on On-Chip Parallel and Networked-based Systems, Petersburg, Russia, 2017. Guest Editor (together with Hamid Sarbazi-Azad, SUT, and Paolo Ienne, EPFL) of the Elsevier Microprocessors and Microsystems special issue on Architecture of Future Many Core Processors, 2017. Guest Editor of CSI Journal on Computer Science and Engineering (JCSE), Selected papers of International Symposium of Computer Architecture & Digital Systems, 2016. The Journal of Computer and Knowledge Engineering, Editorial Board, 2015-2017. Program Committee Member, 24th Euromicro International Conference on Parallel, Distributed, and Networked based Processing, Special on On-Chip Parallel and Networked-based Systems, 2016. Program Co-Chair, the 18th International Symposium on Computer Architecture & Digital Systems (CADS2015), October 7-8, 2015, Tehran, Iran. Program Committee Member, The CSI International Symposium on Real-Time and Embedded Systems and Technologies (RTEST), October 7-8, 2015, Tehran, Iran. Guest Editor (together with Hamid Sarbazi-Azad, SUT, and Paolo Ienne, EPFL) of the IEEE Transactions on Computers special issue on Emerging Memory Technologies in Very Large Scale Computing and Storage Systems, 2015. Program Committee Member, 23rd Euromicro International Conference on Parallel, Distributed, and Networked based Processing, Special on On-Chip Parallel and Networked-based Systems, 2015. Publication Chair, CSI International Symposium on Artificial Intelligence and Signal Processing (AISP), Sharif University of Technology, Tehran, Iran, December 25-27, 2013 (Proceedings published in Springer Cham Heidelberg, Communications in Computer and Information Science Series, Vol. 427, Oct. 2014). Publication Chair, CSI International Symposium on Computer Networks and Distributed Systems (CNDS), Sharif University of Technology, Tehran, Iran, December 25-27, 2013 (Proceedings published in Springer Cham Heidelberg, Communications in Computer and Information Science Series, Vol. 428, Oct. 2014). Publication Chair, CSI International Symposium on Computer Science and Software Engineering (CSSE), Sharif University of Technology, Tehran, Iran, December 25-27, 2013. Organizing committee, 18th National CSI Computer Conference, March 2013. Managing Editor, Scientia Iranica, Transactions on Computer Science & Engineering, 2011-2013. Organizing committee, 17th National CSI Computer Conference, March 2012. Program Committee Member, 19th Euromicro International Conference on Parallel, Distributed, and Networked based Processing, Special on On-Chip Parallel and Networked-based Systems, 2010. Organizing committee, 16th National CSI Computer Conference, March 2011. Research Interests Data Storage Systems and Solid-State Drives: Architecture, Performance, Availability, Reliability, and Power Management Emerging Memory and Storage Technologies including Non-Volatile Memories and NVMe Storage Area Network (SAN), Networked Attached Storage (NAS), Hyper-Converged Infrastructure (HCI): Architecture, Performance, Availability, and Reliability Operating System Support for I/O and Memory Management High-Performance Computing: I/O, Data-Intensive HPC, and Data-Intensive GPU Applications Virtualization and Cloud Computing: Architecture, Performance, and Availability Reconfigurable Computing: Architecture, CAD, and Eme",
  "content_length": 13330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:27"
}