{
  "name": "Gheorghita Ghinea",
  "homepage": "https://www.brunel.ac.uk/people/george-ghinea",
  "status": "success",
  "content": "Professor George Ghinea | Introduction | Brunel University London Skip to Content Home People Professor George Ghinea Professor George GhineaProfessor - Mulsemedia Computing Wilfred Brown Building 215 Email: george.ghinea@brunel.ac.uk Tel: +44 (0)1895 266033 Computer Science College of Engineering, Design and Physical Sciences Summary I am a Professor in the Department of Computer Science at Brunel University London. I obtained my BSc. Degree with Computer Science and Mathematics majors from the University of the Witwatersrand, South Africa. I later went on to obtain BSc. (Hons.) and MSc. Degrees, both in Computer Science, from the same university. I was awarded my PhD – Quality of Perception: An Essential Facet of Multimedia Communications -  from the University of Reading, UK, in 2000. In it, I proposed the Quality of Perception metric, a precursor of the Quality of Experience (QoE) concept now widely known. However, whilst QoE is still a concept, QoP is a concrete metric. Thus, recognising the infotainment duality of multimedia, QoP not only characterises the subjective enjoyment associated with experiencing multimedia presentations, but also how such presentations aid a person\\'s ability to assimilate informational content. My research activities lie at the confluence of Computer Science, Media and Psychology. In particular, my work focuses on the area of perceptual multimedia quality and how one builds end-to-end communication systems incorporating user perceptual requirements. I have applied my expertise in areas such as eye-tracking, telemedicine, multi-modal interaction, and ubiquitous and mobile computing. I am particularly interested in building human-centred e-systems, particularly integrating human perceptual requirements. My work has been funded by both national and international funding bodies – all of it being collaborative work with other teams and stakeholders I have been privileged to be involved with. I have also been honoured to supervise 33 PhD students to completion and to have published over 350 high-quality research articles with them and other research collaborators. Currently, my research pursuits are centered on extending the notion of multimedia with that of mulsemedia – a term which I have put forward to denote multiple sensorial media, ie. media applications that go beyond engaging the by now traditional auditory and visual senses, engaging three of our other human in a realistic manner akin to our experiences of everyday life. Qualifications Postgraduate Certificate (Teaching and Learning in Higher Education) 2001-2002, Brunel University, United Kingdom) PhD. (Computer Science) 1996 - 1999 , University of Reading, United Kingdom Dissertation Title - “Quality of Perception - an Essential Facet of Multimedia Communications” M.Sc. (Computer Science) with Distinction 1995 - 1996,  University of the Witwatersrand, S. Africa BSc. (Hons) (Computer Science) with Distinction 1994, University of the Witwatersrand, S. Africa BSc. (Computer Science, Mathematics) with Distinction 1991 - 1993, University of the Witwatersrand, S. Africa Responsibility Director of Research, Computer Science Department Newest selected publications Campos da Silveira, A., Raisamo, R., Spyridonis, F., Covaci, A., Ghinea, G. and Saibel Santos, CA. (2025) 'Perception of Audio–Visual Synchronization in Olfactory-Enhanced 360-Degree Video'. Applied Sciences, 15 (19). pp. 1 - 20.Open Access Link Journal article Surya Samantha, B., Dutta, N., Mahadeva, R., Patole, SP. and Ghinea, G. (2025) 'Graph Based Cooperative Forwarding in Information Centric Vehicular Networks'. IEEE Access, 13. pp. 110913 - 110925.Open Access Link Journal article Droutsas, N., Spyridonis, F., Daylamani-Zad, D. and Ghinea, G. (2025) 'Flower in the Mirror, Moon on the Water: Bridging Perspectives on Alternative Text and Recommendations for Practice'. International Journal of Human-Computer Interaction, 0 (ahead of print). pp. 1 - 21. ISSN: 1044-7318 Open Access Link Journal article Mattos, D., Vieira, R., Muchaluat-Saade, DC. and Ghinea, G. (2025) 'Assessing Mulsemedia Authoring Application Based on Events With STEVE 2.0'. IEEE Access, 13. pp. 100970 - 100986.Open Access Link Journal article Andres, F., Fotouhi, F., Ghinea, G. and Tanimoto, S. (2025) 'DECOR 2025: How Data Engineering Meets Intelligent Food and Cooking Innovation'.41st International Conference on Data Engineering Workshops (ICDEW). Hong Kong. 19 - 23 May. IEEE. pp. 271 - 273. ISSN: 1943-2895 Conference paper More publications(439)",
  "content_length": 4541,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:25"
}