{
  "name": "Giacomo Verticale",
  "homepage": "http://home.deib.polimi.it/verticale",
  "status": "success",
  "content": "Giacomo Verticale Skip to content Giacomo Verticale Home Available Theses Bio Projects Publications Teaching Contacts Languages Quantum Communications Class Posted on 02/02/2019 by 10169800@polimi.it Starting this year, we offer a Quantum Communications class. The official teacher is prof. Mario Martinelli, and the class also features seminars by other teachers, including myself. Get the calendar and an abstract of the course. Posted in Uncategorized | Leave a comment Cryptowars 2018 Posted on 02/10/2018 by 10169800@polimi.it Aprono oggi le iscrizioni per la Cryptowars italiana 2018. La competizione è aperta a team studenteschi composti da un massimo di 5 studenti. Termine iscrizioni 10 ottobre, l’evento si svolgerà dal 15 al 21 ottobre. Informazioni qui: http://club.di.unimi.it/activities.html Posted in Uncategorized | Leave a comment Thesis proposals updated Posted on 21/03/2018 by 10169800@polimi.it Please visit the thesis proposal page. Posted in Uncategorized | Leave a comment Slides from CommTechTalk ONOS Overview Posted on 03/11/2016 by 10169800@polimi.it [:it]Courtesy of Carmelo Cascone, Andrea Campanella, Andrea Biancini, we provide the slides from the ContechTalk on ONOS SDN controller. ONOS Overview (slides)[:en]Courtesy of Carmelo Cascone, Andrea Campanella, Andrea Biancini, we provide the slides from the ComtechTalk on ONOS SDN controller. ONOS Overview (slides)[:] Posted in Uncategorized | Leave a comment Ogni scuola è illuminata Posted on 12/01/2015 by 10169800@polimi.it Posted in Uncategorized | Leave a comment Search for: Recent Posts Quantum Communications Class Cryptowars 2018 Thesis proposals updated Slides from CommTechTalk ONOS Overview Ogni scuola è illuminata Recent CommentsArchives February 2019 October 2018 March 2018 November 2016 January 2015 Categories Uncategorized Meta Log in Entries feed Comments feed WordPress.org Giacomo Verticale Proudly powered by WordPress.",
  "content_length": 1926,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:32"
}