{
  "name": "Gianluca Palermo",
  "homepage": "http://home.deib.polimi.it/gpalermo",
  "status": "success",
  "content": "Prof. Gianluca Palermo | Personal Home Page Skip to content Prof. Gianluca Palermo Personal Home Page Home Where TutoringCSE Home Page Full ProfessorDEIB – Politecnico di Milano Mail: gianluca.palermo [AT] polimi [DOT] it Location: Building 20 - Floor 1 Room 124 Virtual OFFICE: MS-TEAMS link Phone Number: +39 02.2399.3552 Fax: +39 02.2399.3411 Short BioHe received the M.S degree in Electronic Engineering, in 2002, and the Ph.D degree in Computer Engineering, in 2006, from Politecnico di Milano. He is currently a Full Professor at the Department of Electronics, Information, and Bioengineering at the same University. Previously, he was a consultant engineer in the Low Power Design Group of AST – STMicroelectronics (Agrate, Italy) working on network-on-chip and research assistant at the Advanced Learning and Research Institute (ALaRI) of the Universita’ della Svizzera Italiana (Lugano, Switzerland). His research interests include design methodologies and architectures for Embedded and High-Performance Computing systems, focusing on multi/many-cores architectures, application autotuning, and high throughput virtual screening. Since 2003, he published over 150 peer-reviewed papers including top-level conferences and journals ( > 4300 total citations and h-index of 34 according to Google Scholar). He is ACM, HiPEAC and EuroLab4HPC member, IEEE senior member and PoliMi representative within EIT Digital. Full CV here (PDF) PublicationsA list of my publications can be found here (PDF) or on DBLP and GoogleScholar Recent Posts New journal paper co-authored by a Nobel Prize! July 20, 2023 New Paper published at LCTES’20 June 13, 2020 New paper on IEEE Transactions on Software Engineering May 27, 2020 New paper on The Journal of Supercomputing April 21, 2020 Molecular unfolding using Quantum Annealing for COVID-19 related research April 21, 2020 Exscalate4CoV project: Supercomputers to fight the Coronavirus April 3, 2020 Archives Archives Select Month July 2023 June 2020 May 2020 April 2020 September 2019 July 2019 Prof. Gianluca Palermo Proudly powered by WordPress.",
  "content_length": 2091,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:39"
}