{
  "name": "Gianluca Zanella",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=GZANELLA",
  "status": "success",
  "content": "Gianluca Zanella - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Gianluca Zanella Assistant Professor Gianluca Zanella Assistant Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber SciencesAdministrationDepartment of The Graduate School GZANELLA@augusta.edu GH 130 General Credentials Instruction Scholarship Service Education Ph.D., Information Technology University of Texas at San Ant, 2020 MS, Computer/Information Technolog University of Texas at San Ant, 2015 BS, Physics, General Universita Degli Studi Di Parm, 1989 Awards & Honors University of Texas Innovation Award University of Texas at San Antonio, 2022 Courses Taught Most Recent Academic Year CSCI 8940 Dissertation Research AIST 4720 Enterprise System Architecture AIST 4820 Information Technology Project CSCI 4990 Undergrad Research Teaching Interests My teaching interest include both technical and management topics. Courses such as database design, python scripting, data science, and cloud systems are related to my industry/research experience as database and software developer. Topics such as enterprise systems and capstone projects are more related to my experience as a data and software architect. Scholarship Selected Recent Publications Reading the Digital Pulse: Context-Aware AI for Sensing Engagement Drivers in Health Forums, 2025 Conference Proceeding Sleepless Generation(s): How the Attention Economy Steals Our Sleep, 2025 Conference Proceeding Reimagining the Sharing Economy through Blockchain: The Case of Helium's Decentralized Wireless Network, 2025 Conference Proceeding The effect of institutional asymmetry on informal entrepreneurship, 2024 Journal Article, Academic Journal The Role of Arts Incubators in Addressing Digital Divide Inequities, 2024 Book, Chapter in Scholarly Book-New Research Interests My research interests can be divided into two main domains. The first domain refers to human behavior in a digital environment, which includes topics such as interaction between information systems humans, and the role of human decision-making processes in online privacy and cybersecurity. The second domain focuses on Applied AI, including topics such as new possibilities of creating new AI models for scientific activities, and refining Generative AI models for improved training and education outcomes. College Service BS in Biomedical Systems Engineering Design 2023 - Present Role: Committee Member Virtual Internship and Varied Innovative Demonstrations/Student Mentor 2023 - Present Role: Committee Member Faculty Affairs Committee 2024 - 2024 Role: Committee Member Faculty Search Committees 2024 - 2024 Role: Committee Member Research Computing Infrastructure Committee 2024 - 2024 Role: Committee Member",
  "content_length": 2881,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:35"
}