{
  "name": "Gianluca Stringhini",
  "homepage": "https://seclab.bu.edu/people/gianluca",
  "status": "success",
  "content": "Gianluca Stringhini's homepage Gianluca Stringhini Associate Professor ECE Department Boston University gian (at) bu.edu ABOUT ME I am an Associate Professor in the Department of Electrical and Computer Engineering at Boston University, where I co-direct the Security Lab (SeclaBU). I am a Distinguished Faculty Fellow in the College of Engineering, and I hold affiliations with the Faculty of Computing & Data Sciences and the Computer Science Department at BU. MY RESEARCH In my research I apply a data-driven approach to better understand malicious activity on the Internet. Through the collection and analysis of large-scale datasets, I develop novel and robust mitigation techniques to make the Internet a safer place. My research involves a mix of systems security, machine learning, quantitative analysis, and qualitative analysis. I am the recipient of an NSF CAREER Award, the Early Career Excellence in Research Award from the BU College of Engineering, seven best/distinguished paper awards (IC2E 2024, SECURECOMM 2024, DIMVA 2019, CYBERSAFETY 2019, IMC 2018, eCrime 2017, ACSAC 2010), and eight honorable mentions/impact recognitions (CHI 2024, CSCW 2023, CCS 2022, CHI 2022, CSCW 2021, CSCW 2021, ICWSM 2020, ICWSM 2017). My research is supported by the NSF, Google, and OpenAI. You can read more about my research in this article by The Brink RECENT SELECTED PUBLICATIONS LOKI: Proactively Discovering Online Scam Websites by Mining Toxic Search Queries Pujan Paudel and Gianluca Stringhini. NDSS, 2026. Revealing The Secret Power: How Algorithms Can Influence Content Visibility on Twitter/X Alessandro Galeazzi, Pujan Paudel, Mauro Conti, Emiliano De Cristofaro, and Gianluca Stringhini. NDSS, 2026. Mirror Mirror on the Wall, which APK Mirror Site is the Largest of them All? Neal Keating, Wellington Esposito Barbosa, Leo Phan, Viraj Prakash, Gianluca Stringhini, and Adam Aviv. IMC, 2025. Timeliness Matters: Leveraging Reinforcement Learning on Social Media Data to Prioritize High-Risk Conversations for Promoting Youth Online Safety Ashwaq Alsoubai, Jinkyung Katie Park, Gianluca Stringhini, Meiyi Ma, Munmun De Choudhury, Pamela Wisniewski. ICWSM, 2025. Enabling Contextual Soft Moderation on Social Media through Contrastive Textual Deviation Pujan Paudel, Mohammad Hammas Saeed, Rebecca Auger, Chris Wells, and Gianluca Stringhini. USENIX Security, 2024. PIXELMOD: Improving Soft Moderation of Visual Misleading Information on Twitter Pujan Paudel, Chen Ling, Jeremy Blackburn, and Gianluca Stringhini. USENIX Security, 2024. Pandawan: Quantifying Progress in Linux-based Firmware Rehosting Ioannis Angelakopoulos, Gianluca Stringhini, and Manuel Egele. USENIX Security, 2024. LLMs Cannot Reliably Identify and Reason About Security Vulnerabilities (Yet?): A Comprehensive Evaluation, Framework, and Benchmarks Saad Ullah, Mingji Han, Saurabh Pujar, Hammond Pearce, Ayse Coskun, and Gianluca Stringhini. Oakland, 2024. TUBERAIDER: Attributing Coordinated Hate Attacks on YouTube Videos to their Source Communities Mohammad Hammas Saeed, Kostantinos Papadamou, Jeremy Blackburn, Emiliano De Cristofaro, and Gianluca Stringhini. ICWSM, 2024. Browser Polygraph: Efficient Deployment of Coarse-Grained Browser Fingerprints for Web-Scale Detection of Fraud Browsers Faezeh Kalantari, Mernoosh Zaeifi, Yeganeh Safaei, Marzieh Bitbab, Adam Oest, Gianluca Stringhini, Yan Shoshitaishvili, Adam Doupe. IMC, 2024. Lambretta: Learning to Rank for Twitter Soft Moderation Pujan Paudel, Jeremy Blackburn, Emiliano De Cristofaro, Savvas Zannettou, and Gianluca Stringhini. OAKLAND, 2023. Understanding the Use of Images to Spread COVID-19 Misinformation on Twitter Yuping Wang, Chen Ling, and Gianluca Stringhini. CSCW, 2023. Getting Meta: A Multimodal Approach for Detecting Unsafe Conversations within Instagram Direct Messages of Youth Shiza Ali, Afsaneh Razi, Seunghyun Kim, Ashwaq Alsoubai, Chen Ling, Munmun De Chowdhury, Pamela Wisniewski, and Gianluca Stringhini. CSCW, 2023. Sliding into My DMs: Detecting Uncomfortable or Unsafe Sexual Risk Experiences within Instagram Direct Messages Grounded in the Perspective of Youth Afsaneh Razi, Ashwaq Alsoubai, Seunghyun Kim, Shiza Ali, Gianluca Stringhini, Munmun De Chowdhury, and Pamela Wisniewski. CSCW, 2023. FirmSolo: Enabling dynamic analysis of binary Linux-based IoT kernel modules Ioannis Angelakopoulos, Gianluca Stringhini, and Manuel Egele. USENIX Security, 2023. Non-Polar Opposites: Analyzing the Relationship Between Echo Chambers and Hostile Intergroup Interactions on Reddit Alexandros Efstratiou, Jeremy Blackburn, Tristan Caulfield, Gianluca Stringhini, Savvas Zannettou, Emiliano De Cristofaro. ICWSM, 2023. CERBERUS: Exploring Federated Prediction of Security Events Mohammad Naseri, Yufei Han, Enrico Mariconti, Yun Shen, Gianluca Stringhini, and Emiliano De Cristofaro. ACM CCS, 2022. Why So Toxic? Measuring and Triggering Toxic Behavior in Open-Domain Chatbots Wai Man Si, Michael Backes, Jeremy Blackburn, Emiliano De Cristofaro, Gianluca Stringhini, Savvas Zannettou, and Yang Zhang. ACM CCS, 2022. Finding MNEMON: Reviving Memories of Node Embeddings Yun Shen, Yufei Han, Zhikun Zhang, Min Chen, Ting Yu, Michael Backes, Yang Zhang, and Gianluca Stringhini. ACM CCS, 2022. TrollMagnifier: Detecting State-Sponsored Troll Accounts on Reddit Mohammad Hammas Saeed, Shiza Ali, Jeremy Blackburn, Emiliano De Cristofaro, Savvas Zannettou, and Gianluca Stringhini. OAKLAND, 2022. A Large-scale Temporal Measurement of Android Malicious Apps: Persistence, Migration, and Lessons Learned Yun Shen, Pierre-Antoine Vervier, and Gianluca Stringhini. USENIX Security, 2022. Understanding the Digital Lives of Youth: Analyzing Media Shared within Safe versus Unsafe Private Conversations on Instagram Shiza Ali, Afsaneh Razi, Seunghyun Kim, Ashwaq Alsoubai, Joshua Gracie, Munmun De Choudhury, Pamela Wisniewski, Gianluca Stringhini. CHI, 2022.",
  "content_length": 5924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:36"
}