{
  "name": "Giannis F. Marias",
  "homepage": "http://www.scirp.org/journal/DetailedInforOfEditorialBoard.aspx?personID=953",
  "status": "success",
  "content": "Giannis F. Marias - Editorial Board - Scientific Research Publishing Home JIS EditorialBoard Biography Biography Dr. Giannis F. Marias Athens University of Economics and Business, Greece Email: marias@aueb.gr Qualifications 2004  Ph.D., University of Athens, Greece 1995  B.Sc., University of Patras, Greece Publications (Selected) Marias, G. F., Spentzouris, P., Kontantinou, V., Dimitroulis, C., & Tsigkanos, T. (2022, May). Increasing Safety and Privacy Against COVID-19 using IoTs and Enhanced Positioning Methods. In 2022 IEEE Zooming Innovation in Consumer Technologies Conference (ZINC) (pp. 59-62). IEEE. Marias, G. F., Mitrou, L., Theoharidou, M., Soupionis, J., Ehlert, S., & Gritzalis, D. (2018). SIP Vulnerabilities for SPIT, SPIT Identification Criteria, Anti-SPIT Mechanisms Evaluation Framework and Legal Issues. SIP Handbook: Services, Technologies, and Security of Session Initiation Protocol. Kazatzopoulos, L., Delakourides, K., & Marias, G. F. (2018). Anonymity in SIP. In SIP Handbook (pp. 499-516). CRC Press. Fotiou, N., Kotsonis, T., Marias, G. F., & Polyzos, G. C. (2016, September). Access control for the internet of things. In 2016 international workshop on secure internet of things (SIoT) (pp. 29-38). IEEE. Fotiou, N., Trossen, D., Marias, G. F., Kostopoulos, A., & Polyzos, G. C. (2014). Enhancing information lookup privacy through homomorphic encryption. Security and Communication Networks, 7(12), 2804-2814. Polyzos, G. C., Siris, V. A., Xylomenos, G., Marias, G. F., & Toumpis, S. (2014, August). I-CAN: Information-centric future mobile and wireless access networks. In 10th International Conference on Heterogeneous Networking for Quality, Reliability, Security and Robustness (pp. 139-141). IEEE. Stais, C., Xylomenos, G., & Marias, G. F. (2014, May). Sink controlled reliable transport for disaster recovery. In Proceedings of the 7th International Conference on PErvasive Technologies Related to Assistive Environments (pp. 1-4). Zhang, P., Fotiou, N., Helvik, B. E., Marias, G. F., & Polyzos, G. C. (2014). Analysis of the effect of infoRanking on content pollution in Peer‐to‐Peer systems. Security and Communication Networks, 7(4), 700-713. Giannikos, M., Kokoli, K., Fotiou, N., Marias, G. F., & Polyzos, G. C. (2013, January). Towards secure and context-aware information lookup for the Internet of Things. In 2013 International Conference on Computing, Networking and Communications (ICNC) (pp. 632-636). IEEE. Fotiou, N., Marias, G. F., & Polyzos, G. C. (2012, August). Access control enforcement delegation for information-centric networking architectures. In Proceedings of the second edition of the ICN workshop on Information-centric networking (pp. 85-90). Profile Details WoS ResearcherID: AGZ-8352-2022 https://www.aueb.gr/en/faculty_page/marias-giannis https://scholar.google.com.hk/citations?user=EO_hUg4AAAAJ&hl=zh-CN&oi=sra https://www.researchgate.net/profile/Giannis-Marias Free SCIRP Newsletters Add your e-mail address to receive free newsletters from SCIRP. Select Journal AA AAD AAR AASoci AAST ABB ABC ABCR ACES ACS ACT AD ADR AE AER AHS AID AiM AIRR AIT AJAC AJC AJCC AJCM AJIBM AJMB AJOR AJPS ALAMT ALC ALS AM AMI AMPC ANP APD APE APM ARS ARSci AS ASM BLR CC CE CellBio ChnStd CM CMB CN CRCM CS CSTA CUS CWEEE Detection EMAE ENG EPE ETSN FMAR FNS GEP GIS GM Graphene GSC Health IB ICA IIM IJAA IJAMSC IJCCE IJCM IJCNS IJG IJIDS IJIS IJMNTA IJMPCERO IJNM IJOC IJOHNS InfraMatics JACEN JAMP JASMI JBBS JBCPR JBiSE JBM JBNB JBPC JCC JCDSA JCPT JCT JDAIP JDM JEAS JECTC JEMAA JEP JFCMV JFRM JGIS JHEPGC JHRSS JIBTVA JILSA JIS JMF JMGBND JMMCE JMP JPEE JQIS JSBS JSEA JSEMAT JSIP JSS JSSM JST JTR JTST JTTs JWARP LCE MC ME MI MME MNSMS MPS MR MRC MRI MSA MSCE NJGC NM NR NS OALib OALibJ ODEM OJA OJAB OJAcct OJAnes OJAP OJApo OJAppS OJAPr OJAS OJBD OJBIPHY OJBM OJC OJCB OJCD OJCE OJCM OJD OJDer OJDM OJE OJEE OJEM OJEMD OJEpi OJER OJF OJFD OJG OJGas OJGen OJI OJIC OJIM OJINM OJL OJM OJMC OJMetal OJMH OJMI OJMIP OJML OJMM OJMN OJMP OJMS OJMSi OJN OJNeph OJO OJOG OJOGas OJOp OJOph OJOPM OJOTS OJPathology OJPC OJPChem OJPed OJPM OJPP OJPS OJPsych OJRA OJRad OJRD OJRM OJS OJSS OJSST OJST OJSTA OJTR OJTS OJU OJVM OPJ POS PP PST PSYCH SAR SCD SGRE SM SN SNL Soft SS TEL TI UOAJ VP WET WJA WJCD WJCMP WJCS WJET WJM WJNS WJNSE WJNST WJV WSN YM Home Journals A-Z Subject Books Sitemap Contact Us About SCIRP Publication Fees For Authors Peer-Review Issues Special Issues News Service Manuscript Tracking System Subscription Translation & Proofreading FAQ Volume & Issue Policies Open Access Publication Ethics Preservation Retraction Privacy Policy Copyright © 2006-2025 Scientific Research Publishing Inc. All Rights Reserved. Top",
  "content_length": 4693,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:38"
}