{
  "name": "Gias Uddin 0001",
  "homepage": "https://giasuddin.ca",
  "status": "success",
  "content": "Gias Uddin | Associate Professor, York University Associate Professor, York University Lassonde School of Engineering, Electrical Engineering and Computer Science, Adjunct Professor at University of Calgary. Email: guddin AT yorku DOT ca Past/Present Employment Associate Professor, York University (2023 – Present) Assistant Professor, University of Calgary (2020 – 2023). Senior Data Scientist, Bank of Canada (2018 – 2020) Data Scientist, Apption Inc, Canada (2016 – 2018) Researcher & Machine Learning Software Developer, IBM Canada (2011 – 2015) Education PhD 2018, McGill University MSc 2008, Queen’s University BSc 2004, Bangladesh University of Engineering and Technology My research lies at the intersection of software engineering (SE) and artificial intelligence (AI). I am focused on the assessment of AI trustworthiness using SE (SE4AI) and on improving the productivity of software and knowledge professionals using AI enabled software assistants (e.g., AI4SE). I am the founding director of the Data Intensive Software Analytics (DISA) Lab. Prospective Students I am always looking for motivated and hard- working students. The student should have strong background in software engineering, machine learning, and human-computer interaction. NOTE: at this moment, I am only accepting PhD students. Any email/request for master’s admission won’t be reviewed. For a PhD admission at a Canadian research university like York or UCalgary, you would need to have master’s completed or you would need to be in the process of completion of your master’s degree. News May 1, 2025: Proud to receive a distinguished paper award at the FSE 2025 for our paper on hallucination detection in LLMs using Metamorphic Relations! April 30, 2025: Proud to receive a York University Research Award! Jan 24, 2025: Re-awarded as an IBM Champion in 2025. Thanks to my amazing colleagues at IBM for the nomination! Jan 16, 2025: Thanks York University for featuring our recent IBM CAS Award! Link to Online Article Oct 21, 2024: We got the CAS Project of the Year Award at the IBM TechXChange 2024 for our pioneering and industrially imapctful work on developing intelligent tools using software analytics to modernize issue management systems for IBM runtime. Thanks to my amazing students and collaborators at IBM! Oct 16, 2024: Thanks to NSERC Alliance International Catalyst Grant on \"Hallucination Detection in LLMs using Metamorphic Testing\" Oct 5, 2024: Gave an invited talk at the University of Toronto on \"Trustworthy LLM with and for Software Engineering\". Workshop Details. Oct 1, 2024: Check out my podcast with Stack Overflow on hallucinations in AI-generated code and software reviews. Sept 15, 2024: Gave an invited talk at the Windriver on \"Trustworthy LLM with and for Software Engineering\" Jan 11, 2024: Thanks IBM and my colleagues at IBM for recognizing me as an \"IBM Champion for 2024\"! Dec 15, 2023: Full technical research paper accepted at the 46th International Conference on Software Engineering (ICSE 2024) \"ChatGPT Incorrectness Detection in Software Reviews\" with my students Tanzil and Junaed: Nov 22, 2023: Thanks to IBM, Natural Sciences and Engineering Research Council of Canada (NSERC), and Mitacs for the awarded Alliance grant on the modernization of issue management systems in runtime systems using Foundational Models like Language Models (LMs) and Large LMs (LLMs). Oct 10, 2023: Thanks to NSERC Alliance for the awarded grant (co-PI) on \"Robust Machine Learning for Quantum Sensing\" with Shabir Barzanjeh (PI) Aug 4, 2023: Together with Mohammad Keyhani (Haskayne Business School, University of Calgary) and three other Co-PIs, we will explore \"The Generative AI Disruption\" under a small Transdisciplinary Grant from University of Calgary. July 17, 2023: Accepted at ASE 2023 as a full technical research paper \"Contrastive Learning for API Aspect Analysis\" with Shahriar et al. July 1, 2023: Thanks to NSERC, MITACS, and IBM for the successful grant application on using language models for software log data analysis Nov 1, 2022: Happy to be a program committee (PC) member of the Mining Software Repositories (MSR) 2023 conference Oct 1, 2022: Happy to be a program committee (PC) member of the Software Vulnerability Management (SVM) Workshop - Colocated with ICSE 2023 Aug 26, 2022: Happy to be part of ICSE 2023 SEET Team as a program committee member! July 6, 2022: Happy to be part of MaLTeSQuE2022 (International Workshop on Machine Learning Techniques for Software Quality Evolution) as a program committee member! July 1, 2022: Honored to be part of team Kelly and Paolo as a program committee member of ESEC/FSE 2023! August 5, 2021: Invited to the program committee of MSR 2022 (Mining Software Repositories Conference). Paper due January 20, 2022 August 4, 2021: Invited to the program committee of SANER 2022 (IEEE International Conference on Software Analysis, Evolution and Reengineering). Paper due Oct 21, 2021 July 20, 2021: Journal paper accepted at @emsejournal \"An Empirical Study of IoT Topics in IoT Developer Discussions on Stack Overflow\" with Yann, Fatima, @SWATLab, Omar. July 11, 2021: Invited to serve as a co-chair of Diversity, Inclusion & Outreach at MSR 2022 (Mining Software Repositories Conference). June 30, 2021: Full technical research paper accepted at @ESEM_conf \"A Survey-Based Qualitative Study to Characterize Expectations of Software Developers from Five Stakeholders\" with Khalid, Partha, @rifatshahriyar and Anindya! June 22, 2021: It's official now. Awarded @NSERC_CRSNG discovery grant for the next five years to support my research on improving software library documentation using crowd sourced developer knowledge. Thank you @NSERC_CRSNG. May 21, 2021: Paper accepted at #IEEEICAS \"Quality Assurance Challenges for Machine Learning Software Applications During Software Development Life Cycle Phases\" with my student Alamin. We produce a taxonomy of QA challenges for MLSAs by surveying related work. April 20, 2021: Accepted journal paper at ELSEVIER IST “How Do Developers Discuss and Support New Programming Languages in Technical Q&A Site? An Empirical Study of Go, Swift, and Rust in Stack Overflow” with Partha, Rifat and Anindya. April 12, 2021: Approved Grant (Co-PI)! NSERC EIDM Grant on One Health Initiative for Pandemic Modeling using Mathematics and Data Science. (2.5M). Total five grants in Canada are funded in 2021. March 15, 2021: Journal paper \"A Benchmark Study of Machine Learning Models for Online Fake News Detection\" accepted at Elsevier Machine Learning with Applications (MLWA) with my incoming student Junaed. Feb 25, 2021: I will serve on the program committee of ICSE 2022 Software Engineering Education and Training (SEET) Track! Feb 25, 2021: Paper accepted at 3rd International Workshop on Software Engineering Research & Practices for the Internet of Things (SERP4IoT 2021): Security and Machine Learning Adoption in IoT: A Preliminary Study of IoT Developer Discussions Feb 22, 2021: Two full technical research papers accepted at MSR 2021: (1) An Empirical Study of Developer Discussions on Low Code Software Development Challenges with my student Alamin and (2) Rollback Edit Inconsistencies in Developer Forum with @saikatcsebd and @chanchalkroy more news ... My Tweets Gias Uddin Sign up Log in Copy shortlink Report this content Manage subscriptions Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 7454,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:38"
}