{
  "name": "Gihan R. Mudalige",
  "homepage": "https://warwick.ac.uk/fac/sci/dcs/people/Gihan_Mudalige",
  "status": "success",
  "content": "Gihan Mudalige Skip to main content Skip to navigation Professor of High-Performance ComputingMember of ACMI am a Professor in the Department of Computer Science at the University of Warwick, where I lead the High Performance and Scientific Computing (HPSC) Group. My research focuses on advancing high-performance numerical simulation software, with particular emphasis on targeting massively parallel architectures, reconfigurable computing systems, and compiler/code-generation technologies. The research underpins the development of OP2 and OPS, two of the earliest domain-specific languages (DSLs) to demonstrate the utility of high-level abstraction techniques for developing production-grade HPC applications.My research has been supported through collaborations with leading academic and industrial partners, including Rolls-Royce plc, the UK Turbulence Consortium (UKTC), the Numerical Algorithms Group (NAG), the Alan Turing Institute, the Science and Technology Facilities Council (STFC), and IBM TJ Watson Research Center. In 2018, I was awarded a Royal Society Industry Fellowship with Rolls-Royce plc., on developing future-ready massively-parallel CFD simulations for Exascale HPC systems. I was a Co-I of the £7M, Strategic Partnership in Computational Science for Advanced Simulation and Modelling of Engineering Systems (ASiMoV) project funded by EPSRC and Rolls-Royce and the £2.6M ExCALIBUR project on “Turbulence at the Exascale - Application to Wind Energy, Green Aviation, Air Quality and Net-zero Combustion”. I am also a Co-I of the recently awarded £17M, Virtual Exascale Calculations Transform Aviation (VECTA) project funded by UKRI and Rolls-Royce. My work in ASiMoV was the recipient of the 2022 Scientific Visualization and Data Analytics Showcase award at the Supercomputing (SC) conference.Before joining Warwick in 2016, I was a Research Associate and Senior Researcher at the University of Oxford’s eResearch Centre. I have also worked as a research intern at the University of Wisconsin-Madison’s (US) Department of Computer Science.News If you are interested in working in the HPC research area as a PhD student, please contact me with your CV (Updated 28/08/2025) Warwick and Dept. of CS PhD Scholarships/Studentships (Annual deadlines) Chancellors International Scholarships [Early December deadlines for following year October entry] Departmental Scholarships [Early January deadlines for October entry] More news on : linkedin.com/in/gihanmudalige Software OP2 - Oxford Parallel Library for Unstructured-mesh Applications OPS - Oxford Parallel Library for Multi-block Structured-mesh Applications OP-DSLs Tridsolve - Tridiagonal Solver Library FPGA Tridiagonal Solver - Batched Multidimensional Tridiagonal Systems Solver Library Warwick HPSC GitHub Team Research team and Graduates PublicationsGoogle Scholar | ORCID | DBLP | Scopus | Warwick-Wrap Repo B. Thileepan, S.A. Fahmy and G.R. Mudalige. (2025). Automatic Code-Generation for AcceleratingStructured-Mesh-Based Explicit Numerical Solvers on FPGAs. To appear in the International Conference on Parallel Architectures and Compilation Techniques (PACT '25) Nov 03–06, 2025, Irvine, California, USA. ACM, New York, NY, USA. doi:10.1109/PACT65351.2025.00031 (PDF) S. Curtis, H. Waugh, T. Deakin, and G.R. Mudalige. Mini-Combust—an Open-Source Unstructured FGM Combustion Mini-App for Co-Designing Aero-Engines at Extreme Scale. In International Conference on High Performance Computing, Data, and Analytics (HIPC 2024). IEEE, 2024. (Accepted for Publication) (PDF) Z. Lantra, S.A. Wright and G.R. Mudalige (2024) OP-PIC – an unstructured-mesh particle-in-cell DSL for developing nuclear fusion simulations. In: 53rd International Conference on Parallel Processing (ICPP 2024), Gotland, Sweden, 12-15 Aug 2024. pp. 1-6. doi:10.1145/3673038.3673130Link opens in a new window (PDF) S.A. Wright, C. Ridgers, G.R. Mudalige, Z. Lantra, J. Williams, A.Sunderland, H.S. Thorne, W. Arter. 2024. Developing performance portable plasma edge simulations : a survey, Computer Physics Communications. 109123. ISSN 0010-4655. doi:10.1016/j.cpc.2024.109123 (PDF) T.S Flynn, R. Manson-Sawko, G.R. Mudalige. Performance-Portable Multiphase Flow Solutions with Discontinuous Galerkin Methods, in 38th IEEE International Parallel and Distributed Processing Symposium (IPDPS 2024), San Francisco, CA USA 2024. [Best Paper Award]. (PDF) B. Siklósi, G.R. Mudalige, I.Z. Reguly. 2024. Enabling Bitwise Reproducibility for the Unstructured Computational Motif, Applied Sciences 14, no. 2: 639. doi:10.3390/app14020639 (PDF) S. Ekanayake, I.Z. Reguly, F. Luporini, G.R. Mudalige. Communication-Avoiding Optimizations for Large-Scale Unstructured-Mesh Applications with OP2, in 52nd International Conference on Parallel Processing (ICPP 2023), Salt Lake City, UT USA 2023. doi:10.1145/3605573.3605604 (PDF) A. Powell, G.R. Mudalige, Predictive Analysis of Code Optimisations on Large-Scale Coupled CFD-Combustion Simulations using the CPX Mini-App, in 2023 IEEE International Parallel and Distributed Processing Symposium (IPDPS 2023), St. Petersburg, Florida, USA, 2023 pp. 00-00. doi:10.1109/IPDPS54959.2023.00064 (PDF) A. Prabhakar, C. Goddard, D. Amirante, I.Z. Reguly, A. Gerstenberger, J.-F. Suhrmann, S.A. Jarvis, L. Lapworth, G.R. Mudalige. Virtual Certification of Gas Turbine Engines - Visualizing the DLR Rig250 Compressor. In the Scientific Visualization and Data Analytics Showcase at the The International Conference for High Performance Computing, Networking, Storage, and Analysis (SC22), Nov 2022 Dallas TX. [Best Visualization Award] (PDF) (Video) G.R. Mudalige, I.Z. Reguly, A. Prabhakar, D. Amirante, L. Lapworth, S.A. Jarvis, Towards Virtual Certification of Gas Turbine Engines With Performance-Portable Simulations. In 2022 IEEE International Conference on Cluster Computing (CLUSTER), 2022, pp. 206-217 doi:10.1109/CLUSTER51413.2022.00034 (PDF) K. Kamalakkannan, G.R. Mudalige, I.Z. Reguly, and S.A. Fahmy. 2022. High Throughput Multidimensional Tridiagonal System Solvers on FPGAs. In 2022: International Conference on Supercomputing (ICS '22) June 28–30, 2022, Virtual. ACM, New York, NY, USA. doi: 10.1145/3524059.3532371 (PDF) (Video) K. Kamalakkannan, G.R. Mudalige, I.Z. Reguly, S.A. Fahmy, FPGA Acceleration of Structured-Mesh-Based Explicit and Implicit Numerical Solvers using SYCL, in the 10th International Workshop on OpenCL and SYCL (IWOCL & SYCLcon 2022) May 10-12, 2022. doi: 10.1145/3529538.3530007 (PDF) G.D. Balogh, T.S. Flynn, S. Laizet, G.R. Mudalige, I.Z. Reguly. Scalable Many-core Algorithms for Tridiagonal Solvers, 2022 Computing in Science & Engineering, vol. , no. 01, pp. 1-1, 5555. doi: 10.1109/MCSE.2021.3130544 (PDF). A. Powell, K. Choudry, A. Prabhakar, I.Z. Reguly, D. Amirante, S.A. Jarvis and G.R. Mudalige., Predictive Analysis of Large-Scale Coupled CFD Simulations with the CPX Mini-App, in 2021 IEEE 28th International Conference on High Performance Computing, Data, and Analytics (HiPC), Bengaluru, India, Dec 2021. IEEE Computer Society. pp. 141-151. doi: 10.1109/HiPC53243.2021.00028 [Best Paper Award] (PDF). Chester, Dean G., Groves, Taylor L., Hammond, Simon D., Law, Timothy R., Wright, Steven A., Smedley-Stevenson, Richard P., Fahmy, Suhaib A., Mudalige, Gihan R. and Jarvis, Stephen A. (2021) StressBench : a configurable full system network and I/O benchmark framework. In: 2021 IEEE High Performance Extreme Computing Conference (HPEC), Waltham, MA, USA, 2021, 20-24 Sep, pp. 1-8, doi: 10.1109/HPEC49654.2021.9774494. [Best Paper Award] (PDF) I.Z. Reguly, A.M.B. Owenson, A. Powell, S.A. Jarvis, and G.R. Mudalige, (2021) Under the Hood of SYCL – An Initial Performance Analysis With an Unstructured-mesh CFD Application, In: 36th International Supercomputing Conference (ISC 2021), Virtual conference, 24 Jun - 2 Jul 2021. Published in: High Performance Computing. ISC High Performance 2021, 12728 pp. 391-410. ISBN 9783030787127. ISSN 0302-9743. doi: 10.1007/978-3-030-78713-4_21 (PDF) K. Kamalakkannan, G.R. Mudalige, I.Z. Reguly, S.A. Fahmy, High-Level FPGA Accelerator Design for Structured-Mesh-Based Explicit Numerical Solvers, in 2021 IEEE International Parallel and Distributed Processing Symposium (IPDPS 2021), Portland Oregon, USA, 2021 pp. 1087-1096. doi: 10.1109/IPDPS49936.2021.00117 (arxiv) (PDF) A. Lamzed-Short, T. R. Law, A. Mallinson, G. R. Mudalige and S. A. Jarvis, Towards Automated Kernel Fusion for the Optimisation of Scientific Applications, 2020 IEEE/ACM 6th Workshop on the LLVM Compiler Infrastructure in HPC (LLVM-HPC) and Workshop on Hierarchical Parallelism for Exascale Computing (HiPar), GA, USA, 2020, pp. 45-55, doi: 10.1109/LLVMHPCHiPar51896.2020.00010. (PDF) I. Z. Reguly and G. R. Mudalige, Modernising an Industrial CFD Application, 2020 Eighth International Symposium on Computing and Networking Workshops (CANDARW), 2020, pp. 191-196, doi: 10.1109/CANDARW51189.2020.00046. I.Z. Reguly and G.R. Mudalige, Productivity, Performance, and Portability for Computational Fluid Dynamics Applications, 2020. Computers & Fluids, 104425, ISSN 0045-7930. doi: 10.1016/j.compfluid.2020.104425. (PDF) A.A. Sulyok, G.D. Balogh, I.Z. Reguly, G.R. Mudalige, 2019. Locality Optimized Unstructured Mesh Algorithms on GPUs. Journal of Parallel and Distributed Computing. Volume 134, pp 50-64. doi:0.1016/j.jpdc.2019.07.011 (PDF) G.R. Mudalige, I.Z. Reguly, S.P. Jammy, C.T. Jacobs, M.B. Giles and N.D. Sandham, (2019) Large-scale performance of a DSL-based multi-block structured-mesh application for direct numerical simulation. Journal of Parallel and Distributed Computing. Volume 131, pp 130-146. doi:10.1016/j.jpdc.2019.04.019 (PDF) I.Z. Reguly, G.R. Mudalige, M.B. Giles and S. Maheswaran (2019) Improving resilience of scientific software through a domain-specific approach. Journal of Parallel and Distributed Computing, Volume 128, pp. 99-114. doi:10.1016/j.jpdc.2019.01.015 (PDF) I.Z. Reguly, B. Moore, T. Schmielau, J. du ",
  "content_length": 22501,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:39"
}