{
  "name": "Gil Zussman",
  "homepage": "https://wimnet.ee.columbia.edu/people/gil-zussman",
  "status": "success",
  "content": "Gil Zussman (גיל זוסמן) | Wireless & Mobile Networking (WiMNet) Lab Gil Zussman Kenneth Brayer Professor of Electrical Engineering Chair, Department of Electrical Engineering Affiliated Faculty, Department of Computer Science Member of the Data Science Institute and Computer Engineering Program Director of the Wireless and Mobile Networking (WiMNet) Lab Columbia University Office: 809 CEPSR Phone: +1 212 854 8670 Email: gil[at]ee.columbia.edu Bio Gil Zussman received the B.Sc. degree in Industrial Engineering and Management and the B.A. degree in Economics (both summa cum laude) from the Technion – Israel Institute of Technology in 1995. He received the M.Sc. degree (summa cum laude) in Operations Research from Tel-Aviv University in 1999 and the Ph.D. degree in Electrical Engineering from the Technion – Israel Institute of Technology in 2004. Between 1995 and 1998, he served as an engineer in the Israel Defense Forces. Between 2004 and 2007 he was a Postdoctoral Associate in LIDS and CNRG at MIT. Since 2007 he has been with Columbia University where he is now a Kenneth Brayer Professor of Electrical Engineering, Chair of the Electrical Engineering Department, Professor (affiliated) of Computer Science, and member of the Data Science Institute. Between 2014 and 2016 he was a Visiting Scientist in the School of Computer Science in Tel Aviv University. His research interests are in the area of networking, and in particular in the areas of wireless, mobile, and resilient networks. He has been an associate editor of IEEE/ACM Transactions on Networking, IEEE Transactions on Control of Network Systems, IEEE Transactions on Wireless Communications, and Ad Hoc Networks, the Technical Program Committee (TPC) co-chair of IEEE INFOCOM’23, ACM MobiHoc’15, and IFIP Performance 2011, and a member of a number of TPCs (including the INFOCOM, MobiCom, SIGMETRICS, and MobiHoc committees). Gil received the Knesset (Israeli Parliament) award for distinguished students, the Marie Curie Outgoing International Fellowship, the Fulbright Fellowship, the DTRA Young Investigator Award, the NSF CAREER Award, and the Marie Curie International Incoming Fellowship. He was the PI of a team that won the 1st place in the 2009 Vodafone Americas Foundation Wireless Innovation Project competition and is the Columbia PI of the NSF PAWR COSMOS testbed. He is a Member of the American Academy of Sciences and Letters (AASL), an IEEE Fellow, and a co-recipient of eight best paper awards, including the ACM SIGMETRICS / IFIP Performance’06 Best Paper Award, the 2011 IEEE Communications Society Award for Advances in Communication, and the ACM CoNEXT’16 Best Paper Award. Current Members Gil Zussman (גיל זוסמן) Bio Honors and Awards Service Activities Research Publications Teaching Abhi Adhikari John Drogo Mahshid Ghasemi Kevin Liu Hermstein Dror Jacoby Alon S. Levin Harris Ransom Kobi Ravid Dr. Jhonatan Tavori Ming Yi Shuyue Yu Chengbo Zang Former Members Yigal Bejerano Andrey Bernstein Berk Birand Tingjun Chen Yi-Han Chiang Nicola Di Cicco Jaime Ferragut Gail Gilboa-Freedman Maria Gorlatova Guy Grebla Varun Gupta Craig Gutterman David Hay Igor Kadota Jip Kim Manav Kohli Jelena Marasevic Robert Margolies Dorian Mazauric Saleh Soltan Shuzo Tarumi Jhonatan Tavori Aya Wallwater © 2025 Wireless & Mobile Networking (WiMNet) Lab back up ↑",
  "content_length": 3347,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:01"
}