{
  "name": "Gil A. Tidhar",
  "homepage": "https://people.eng.unimelb.edu.au/adrianrp/COMP90054/biblio/Author/TIDHAR-G.html",
  "status": "success",
  "content": "Back to publication index Publications of Gil Tidhar Journal Articles and Chapters Gil Tidhar, Clinton Heinze, and Mario C. Selvestrel. Flying Together: Modelling Air Mission Teams. Applied Intelligence, 8:195--218, 1998. Keywords: agentlab. [bibtex-entry] Conference Proceedings G Tidhar and L. Sonenberg. Organized distributed systems. In Etzion O. P. and Scheuermann, editors, Proceedings of the 7th International Conference on Cooperative information systems (CoopIS 2000) - Lecture Notes in Computer Science, Eilat, pages 126--131, 2000. Heidelberg: Springer-Verlag. Keywords: teamwork, agentlab, models of interaction and context aware applications. [bibtex-entry] Gil Tidhar, Clinton Heinze, Simon Goss, Graeme Murray, Dino Appla, and Ian Lloyd. Using Intelligent Agents in Military Simulations or Using Agents Intelligently. In Proceedings of the Eleventh Innovative Applications of Artificial Intelligence Conference, American Association of Artificial ntelligence (AAAI), Deployed Applications paper, pages 829--836, 1999. Keywords: simulation, agents, teamwork, agentlab, agent-oriented software engineering, models of interaction and context aware applications. [bibtex-entry] Gil Tidhar, Anand Rao, and Liz Sonenberg. On Teamwork and Common Knowledge. In Y. Demazeau, editor, Proceedings of the 1998 International Conference on Multi-Agent Systems (ICMAS98), Paris, pages 301--308, 1998. Keywords: agentlab, teamwork, models of interaction and context aware applications. [bibtex-entry] Lawrence Cavedon, Anand Rao, Liz Sonenberg, and Gil Tidhar. Teamwork via Team Plans in Intelligent Autonomous Agent Systems. In Proceedings of the International Conference on WorldWide Computing and its Applications, LNCS, Vol 1274, Japan, pages 106--121, 1997. Keywords: agentlab, teamwork, models of interaction and context aware applications. [bibtex-entry] Lawrence Cavedon, Anand S. Rao, and Gil Tidhar. Social and Individual Commitment. In Proceedings of the PRICAI Workshop on Intelligent Agent Systems 1996, pages 152--163, 1996. Keywords: agentlab. [bibtex-entry] Gil Tidhar, Anand Rao, and Liz Sonenberg. Guided Team Selection. In ICMAS96 proceedings, Japan, pages 369--376, 1996. Keywords: agentlab, teamwork. [bibtex-entry] Lawrence Cavedon and Gil Tidhar. A Logical Framework for Multi-Agent Systems and Joint Attitudes. In Proceedings of DAI 1995, pages 16--30, 1995. Keywords: agentlab. [bibtex-entry] Gil Tidhar, Mario C. Selvestrel, and Clinton Heinze. Modelling Teams and Team Tactics in Whole Air Mission Modelling. In Proceedings of IEA/AIE 1995, pages 373--381, 1995. Keywords: agentlab. [bibtex-entry] David Kinny, Ljungberg, Anand Rao, Liz Sonenberg, Gil Tidhar, and Werner. Planned Team Activity. In MAAMAW 1992: Artificial Social Systems, LNCS 830, pages 227--256, 1994. Keywords: agentlab, teamwork. [bibtex-entry] Thesis Gil Tidhar. Organization-oriented systems: theory and practice. PhD, The University of MElbourne, 1999. Keywords: agentlab, models of interaction and context aware applications. [download paper ] [bibtex-entry] Tehnical Reports Liz Sonenberg and Gil Tidhar. Observations on Team-Oriented Mental State Recognition. Technical Report 1999/13, Department of Computer Science and Software Engineering, The University of Melbourne, Australia, 1999. Keywords: agentlab, models of interaction and context aware applications. [bibtex-entry] Gil Tidhar, Liz Sonenberg, and Anand Rao. A Framework for BDI Teams. Technical Report 1999/12, Department of Computer Science and Software Engineering, The University of Melbourne, Australia, 1999. Keywords: agentlab, models of interaction and context aware applications, belief desires intentions, BDI. [bibtex-entry] T. Gabric, S Ch'ng, Gil Tidhar, and Liz Sonenberg. Implementation of the guided team selection approach. Technical Report 96/21, Department of Computer Science, University of Melbourne, Australia, 1996. Keywords: agentlab. [bibtex-entry] T. Gabric, Howden, Emma Norling, Gil Tidhar, and Liz Sonenberg. Multi-agent Design of a Traffic Flow Control System. Technical Report 94/24, Department of Computer Science, University of Melbourne, Australia, 1994. Keywords: agentlab. [bibtex-entry] Back to publication index Disclaimer: This material is presented to ensure timely dissemination of scholarly and technical work. Copyright and all rights therein are retained by authors or by other copyright holders. All person copying this information are expected to adhere to the terms and constraints invoked by each author's copyright. In most cases, these works may not be reposted without the explicit permission of the copyright holder. Bibliography last modified: Fri Aug 6 11:18:06 2010 translated from BibTEX by bibtex2html",
  "content_length": 4721,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:40"
}