{
  "name": "Gil Ben-Artzi",
  "homepage": "http://www.gil-ba.com",
  "status": "success",
  "content": "Gil Ben-Artzi, Ph.D - Personal Website; ××× ××-××¨×¦×, ××£ ××××ª Previous: Hebrew University (IL), Weizmann Institute of Science (IL), Intel Labs (CA,US) Research Interests Computer Vision, Image Processing, Deep Learning, Medical Imaging My Research Group Research Scientist: Dr. Shahar Mahpod Ph.D: Valery Brodesky M.Sc: Sharon Rod, Maya Hayat, Noam Levin, Elian Iluk, Yuval Baror, Yohan pardes, Dor Yanai, Asaf Rozen. Former students: Dr. Evgeny Neiterman, Hay Hoffman, Itamar Dabush, Israel Yacobovich, Michael Klyuchka, Feras Daragma, Noam Gaash, Amir Ofir, Shai Aharon Publications  [Google Scholar] A non-parametric approach to particle picking in all frames Evgeny Hershkovitch Neiterman, Ayelet Heimowitz and Gil Ben-Artzi Journal of Structural Biology Project page (+code) LayerDropBack: A Universally Applicable Approach for Accelerating Training of Deep Networks Evgeny Hershkovitch Neiterman and Gil Ben-Artzi Project page (+code) ChannelDropBack: Forward-Consistent Stochastic Regularization for Deep Networks Evgeny Hershkovitch Neiterman and Gil Ben-Artzi 2024 IEEE The International Conference on Pattern Recognition (ICPR) Project page (+code) Deep BI-RADS Network for Improved Cancer Detection from Mammograms Gil Ben-Artzi, Feras Daragma and Shahar Mahpod 2024 IEEE The International Conference on Pattern Recognition (ICPR) Project page Hypernetwork-Based Adaptive Image Restoration Shai Aharon and Gil Ben-Artzi 2023 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP) Project page (+code) CTrGAN: Cycle Transformers GAN for Natural Gait Transfer Shahar Mahpod, Noam Gaash and Gil Ben-Artzi IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2023 Project page (+code) Adaptive Enhancement of Extreme Low-Light Images Evgeny Hershkovitch Neiterman, Michael Klyuchka and Gil Ben-Artzi 2023 Advanced Concepts for Intelligent Vision systems (ACIVS) Project page (+dataset+code) SMM-Conv: Scalar Matrix Multiplication with Zero Packing for Accelerated Convolution Amir Ofir and Gil Ben-Artzi Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, 2022 Project page (+code) Separable Four Points Fundamental Matrix Gil Ben-Artzi IEEE Winter Conference on Applications of Computer Vision (WACV), 2021 Project page (+code) The Role of Redundant Bases and Shrinkage Functions in Image Denoising Yacov Hel-Or, Gil Ben-Artzi IEEE Transactions on Image Processing, 2021 Paper Camera Calibration by Global Constraints on the Motion of Silhouettes Gil Ben-Artzi ICCV 2017 Paper Integrative genomic analysis by interoperation of bioinformatics tools in GenomeSpace K.Qu, S.Garamszegi, F.Wu, H.Thorvaldsdottir, T. Liefeld, M.Ocana, D.Borges-Rivera, N.Pochet, J.T. Robinson, B.Demchak, T.Hull, G.Ben-Artzi, D.Blankenberg, G.P. Barber, B.T. Lee, R.M. Kuhn, A.Nekrutenko, E.Segal, T.Ideker, M.Reich, A.Regev, H. Y. Chang, J.P. Mesirov Nature Methods, 2017 Paper Fundamental Matrices from Moving Objects using Lines Motion Barcodes Yoni Kasten, Gil Ben-Artzi, Michael Werman, Shmuel Peleg ECCV 2016 Paper Epipolar Geometry Based on Lines Similarity Gil Ben-Artzi, Tavi Helperin, Michael Werman, Shmuel Peleg ICPR 2016 Paper Camera Calibration from Dynamic Silhouettes Gil Ben-Artzi, Yoni Kasten, Michael Werman, Shmuel Peleg CVPR 2016 Paper Event Retrieval Using Motion Barcodes Gil Ben-Artzi, Michael Werman, Shmuel Peleg ICIP 2015 Paper Wisdom of the crowd in in Egocentric Video Curation Yedid Hoshen*, Gil Ben-Artzi*, Michael Werman, Shmuel Peleg (* Joint First Authors) CVPR workshop 2014 Paper Two DNA-encoded strategies for increasing expression with opposing effects on promoter dynamics and transcriptional noise M. Dadiani, D. van Dijk, B. Segal, Y. Field, Gil Ben-Artzi, T. Raveh-Sadka, M. Levo, I. Kaplow, A., E.Segal Genome Research 2013 (Selected As Journal Cover) Paper The Gray-Code Filter Kernels Gil Ben-Artzi, Hagit Hel-Or, Yaacov Hel-Or IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 2007 Paper Filtering with gray-code kernels Gil Ben-Artzi, Hagit Hel-Or, Yaacov Hel-Or The International Conference on Pattern Recognition (ICPR) 2004 Paper Presentation",
  "content_length": 4186,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:40"
}