{
  "name": "Gil Cohen",
  "homepage": "http://www.gilcohen.org",
  "status": "success",
  "content": "Home2022 | homepage top of pageGil Cohen's homepage​News (and Old News) Sep 15 25. Next semester I’m teaching Quantum Algorithms (in Hebrew)—see the course homepage. ​ Feb 28 25. I gave a seminar, following the book Elementary Number Theory, Group Theory, and Ramanujan Graphs. Visit the seminar homepage for more details. Prior I gave a a mini-course on free probability theory and Ramanujan graphs at the Winter School held at the Weizmann Institute. The three lectures are available online here. The slides are also available (lecture 1, lecture 2, and lecture 3). ​​ Uninvited Talks: I started a playlist on my YouTube channel titled \"Uninvited Talks,\" where I present some of my recent results. I find video lectures to be a valuable tool for learning about new results. Video lectures are often available from conferences (where talks are usually too short) or workshops (which have better lengths but are rare). Therefore, I decided to record talks on selected papers without the constraint of a harsh time limit, and with the bonus of improved audio and video quality. These talks will often be recorded as practice sessions for actual seminars or workshops, but I will allow myself to discuss the topics in more depth. I hope these videos will help you learn about my work. More importantly, I hope others will also start creating similar content!Welcome! I am a professor in the Department of Computer Science at Tel Aviv University. My research focuses on pseudorandomness and derandomization, explicit constructions, and coding theory. I am extremely grateful for the support of the ERC Starting Grant and the ISF Grant which fund my research.​​PapersAll my papers are available online. Next to some are video talks and slides.Teaching‘When one teaches, two learn.’ –Robert Heinlein.My GroupI am fortunate to advise bright, creative, and fun to work with students. Click to read about opportunities to join my group either as a student, a visitor, or as a postdoctoral fellow.ContactPlease feel free to contact me via gil@tauex.tau.ac.il. My office is @ Check Point 244.bottom of page",
  "content_length": 2096,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:41"
}