{
  "name": "Gilberto Pérez",
  "homepage": "https://pdi.udc.es/en/File/Pdi/SA2AF",
  "status": "success",
  "content": "Gilberto Pérez Vega File. Department Computer Science and Information Technologies Knowledgment area Algebra Research Research group Information Retrieval Lab Research lines - Métodos formales (verificación, certificación y formalización), aplicados a sistemas de control de software, algoritmos genéticos, protocolos y semántica denotacional. - Lógica de Equilibrio (una caracterización de Answer Set programming para programación lógica) con la inclusión de operadores modales temporales: Temporal Equilibrium Logic, que permite formalismos más expresivos para el razonamiento no monótono. Keywords Verificación Formal, Métodos Formales, Teoría de Prueba, Lógica Intucionista, Answer Set Programming (ASP). Contacto UDC directory Orcid id0000-0001-6269-6101 Scopus55418023500 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 70 Discrete Mathematics Degree in Computer Engineering Programa de Simultaneidad del Grado en Ingeniería Informática y Grado en Ciencia e Ingeniería de Datos Core 0 90 Discrete Mathematics Degree in Data Science and Engineering Core 0 30 Logic Degree in Artificial Intelligence Core 0 5 Software Verification and Validation Degree in Computer Engineering Optional 0 42 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 65 Discrete Mathematics Degree in Computer Engineering Core 0 84 Discrete Mathematics Degree in Data Science and Engineering Core 0 15 Discrete Mathematics Degree in Artificial Intelligence Core 0 5 Logic Degree in Artificial Intelligence Core 0 5 Software Verification and Validation Degree in Computer Engineering Optional 0 42 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 30 Algebra Degree in Artificial Intelligence Core 0 22 Algorithms Degree in Computer Engineering Compulsory 0 12 Discrete Mathematics Degree in Computer Engineering Core 0 108 Discrete Mathematics Degree in Data Science and Engineering Core 0 20 Discrete Mathematics Degree in Artificial Intelligence Core 0 5 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 3 Logic Degree in Artificial Intelligence Core 0 5 Software Verification and Validation Degree in Computer Engineering Optional 0 32 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 48 Algorithms Degree in Computer Engineering Compulsory 0 8 Discrete Mathematics Degree in Computer Engineering Core 0 90 Discrete Mathematics Degree in Data Science and Engineering Core 0 30 Logic Degree in Artificial Intelligence Core 0 5 Software Verification and Validation Degree in Computer Engineering Optional 0 42 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 46 Algorithms Degree in Computer Engineering Compulsory 0 10 Discrete Mathematics Degree in Computer Engineering Core 0 93 Discrete Mathematics Degree in Data Science and Engineering Core 0 30 Software Verification and Validation Degree in Computer Engineering Optional 0 42 Subject and involved studies Type Distance hours Total hours Algebra Degree in Computer Engineering Core 0 40 Algorithms Degree in Computer Engineering Compulsory 0 12 Discrete Mathematics Degree in Computer Engineering Core 0 89 Discrete Mathematics Degree in Data Science and Engineering Core 0 30 Software Verification and Validation Degree in Computer Engineering Optional 0 35 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 2nd quarter Monday 12:30 a 14:30 Despacho 4.1 2nd quarter Monday 08:30 a 10:30 Despacho 4.1 EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2021/2022 2017/2018 2016/2017 2015/2016 Machine translation system for formal verification languages: TPTP to PVS (FirsT2PVS) Web Platform for the Management of Machine Learning Models: Application to the Prediction of Arterial Hypertension M3DISEEN: prediction and recommendation for 3D printing of medicines Rule-Based Decision Support System for Lever Transplantation A Diagrammatic Reasoning Tool for Logic Programming A type system for functional Answer Set programming. Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Papers in research journals Complete books PhD theses directed Conference papers 2024 2022 2021 2019 2018 ... 2017 2016 2014 2013 2010 2008 2006 2002 2000 1996 1994 Funding entity AEI, Agencia Estatal de Investigación Main researches Cabalar Fernández, José Pedro (IP1)/ Santos Reyes, José (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2028 Funding entity Consellería de Educación Main researches Álvaro Barreiro García Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2024 Funding entity Ministerio de Ciencia e Innovación Main researches Pedro Cabalar Fernández/ José Santos Reyes Type Proyecto Programas Nacionales Dates From 01/09/2021 to 31/08/2024 Funding entity CONSELLERIA DE EDUCACIÓN, UNIVERSIDADE E FORMACIÓN PROFESIONAL Main researches ÁLVARO BARREIRO GARCÍA Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches Pedro Cabalar Fernández Type Proyecto Programas Nacionales Dates From 01/01/2018 to 31/12/2020 Funding entity Xunta de Galicia Main researches Juan José Nieto Roig Type Proyecto Programas Autonomicos Dates From 01/01/2017 to 31/12/2018 Funding entity Xunta de Galicia Main researches Álvaro Barreiro García Type Proyecto Programas Autonomicos Dates From 01/01/2017 to 31/12/2018 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Manuel F. González Penedo Type Proyecto Programas Autonomicos Dates From 01/01/2016 to 30/11/2019 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Manuel Vilares Ferro Type Proyecto Programas Autonomicos Dates From 01/01/2014 to 31/12/2015 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Juan José Nieto Roig Type Proyecto Programas Autonomicos Dates From 01/01/2014 to 31/12/2015 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches José Pedro Cabalar Fernández Type Proyecto Programas Nacionales Dates From 01/01/2014 to 31/12/2016 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alvaro Barreiro García Type Proyecto Programas Autonomicos Dates From 01/01/2013 to 31/12/2015 Funding entity Ministerio de Economía y Competitividad Main researches José Pedro Cabalar Fernández Type Proyecto Otros Programas Dates From 01/01/2010 to 31/12/2013 Funding entity Dirección Xeral de Investigación, Desenvolvemento e Innovación Type Proyecto Otros Programas Dates From 01/01/2008 to 31/10/2011 Type Proyecto Otros Programas Dates From 01/10/2006 to 30/09/2009 Type Proyecto Otros Programas Dates From 01/10/2006 to 30/09/2009 Funding entity Ministerio de Ciencia y Tecnología Main researches Víctor M. Gulías Fernández Type Proyecto Programas Nacionales Dates From 05/11/2002 to 05/11/2005 Funding entity Secretaria Xeral de Investigación e Desenvolvemento Tecnolóxico Main researches José María Cardesín Díaz Type Proyecto Programas Autonomicos Dates From 08/10/2002 to 08/10/2005 Funding entity Secretaria Xeral de Investigación e Desenvolvemento Tecnolóxico Type Proyecto Otros Programas Dates From 25/08/2000 to 25/08/2002 Funding entity Dirección Xeral de Universidades Type Proyecto Otros Programas Dates From 24/10/1996 to 24/10/1998 Funding entity Dirección Xeral de Universidades Main researches José Luis Freire Nistal Type Proyecto Otros Programas Dates From 01/01/1994 to 31/12/1995 Funding entity Consellería de Educación e Ordenación Universitaria Main researches Antonio Ángel Blanco Ferro Type Proyecto Programas Autonomicos Dates From 07/04/1994 to 07/04/1997 2024 2023 2022 2021 2020 ... 2019 2017 2015 2013 2011 2008 2007 Authors Felicidad Aguado, cabalar, Jorge Fandinno, David Pearce, Gilberto Pérez, Concepción Vidal Journal Artificial Intelligence Vol. 326 DOI https://doi.org/10.1016/j.artint.2023.104033 Authors Felicidad Aguado, Pedro Cabalar, Martín Diéguez Lodeiro, Gilberto Pérez, Torsten Schaub, Anna Schuhmann, Concepción Vidal Journal THEORY AND PRACTICE OF LOGIC PROGRAMMING Vol. 23 (pages 2 to 56) DOI https://doi.org/10.1017/s1471068421000557 Authors P. Corou-Senra, J.J. Ong, Brais Muñiz, I. Seoane-Viaño, L. Rodríguez-Pombo, cabalar, C. Álvarez-Lorenzo, Abdul W. Basit, Gilberto Pérez, Alvaro Goyanes Journal INTERNATIONAL JOURNAL OF PHARMACEUTICS Vol. 5 DOI https://doi.org/10.1016/j.ijpx.2023.100181 Authors Felicidad Aguado, Pedro Cabalar, Jorge Fandinno, David Pearce, Gilberto Pérez, Concepción Vidal Journal Artificial Intelligence Vol. 308 (pages 1 to 14) DOI https://doi.org/10.1016/j.artint.2022.103712 Authors Jun Jie Ong, Brais Muñiz, Simon Gaisford, Pedro Cabalar, Abdul W. Basit, Gilberto Pérez, Alvaro Goyanes Journal INTERNATIONAL JOURNAL OF PHARMACEUTICS Vol. 4 DOI https://doi.org/10.1016/j.ijpx.2022.100120 Authors Brais Muñiz, Moe Elbadawi, Jun Jie Ong, Thomas Pollard, Zhe Song, Simon Gaisford, Gilberto Pérez, Abdul W. Basit, Pedro Cabalar, Alvaro Goyanes Journal JOURNAL OF CONTROLLED RELEASE Vol. 337 (pages 530 to 545) DOI https://doi.org/10.1016/j.jconrel.2021.07.046 Authors Moe Elbadawi, Brais Muñiz, Francesca K.H. Gavins, Jun Jie Ong, Simon Gaisford, Gilberto Pérez, Abdul W. Basit, Pedro Cabalar, Alvaro Goyanes Journal INTERNATIONAL JOURNAL OF PHARMACEUTICS Vol. 590 DOI https://doi.org/10.1016/j.ijpharm.2020.119837 Authors Pedro",
  "content_length": 15287,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:45"
}