{
  "name": "Giles Reger",
  "homepage": "https://www.research.manchester.ac.uk/portal/giles.reger.html",
  "status": "success",
  "content": "Giles Reger - Research Explorer The University of Manchester Giles Reger Dr https://orcid.org/0000-0001-6353-952X Personal profile OverviewGiles is a Lecturer in the Formal Methods Group of the School of Computer Science at the University of Manchester. He graduated from the University of Cambridge with a BA in Computer Science in 2009. He then gained an MSc in Advanced Computer Science from the University of Manchester in 2010, for which he was awarded the Highest Achiever of the Year Award. He gained his PhD from the University of Manchester in 2014 with a thesis titled \"Automata based monitoring and mining of execution traces\". He was employed as a Research Associate in First-Order Logic and Theorem Proving, working with Andrei Voronkov on the Vampire system between 2014 and 2016.Further informationI have two main research areas. Theorem Proving Reasoning with quantifiers and first-order theories such as arithmeticModel finding in (multi-sorted) first-order logic and theoriesCollaborative (concurrent) proof searchNovel utilisation of SAT and SMT solvers in first-order theorem proversApplications to program analysis and verification Runtime Verification Temporal specification languages and their propertiesMonitoring algorithms, focussing on indexing and parallelismSpecification mining, focussing on properties using dataViolation explanationEvaluation methods (competition and benchmarking)My groupFormal MethodsOpportunitiesI welcome applications for PhD and MSc students to work on areas related to my research. I encourage potential applicants to review the proposed projects on the school website. You may also like to propose your own projects in areas such as theorem proving, program verification, temporal logic and dynamic analysis. My research always has a practical element, either via tool development or application of techniques to real software. Additionally, there may be future funding available for postdoctoral opportunities. If you are interested please get in touch. Research Beacons, Institutes and PlatformsDigital Futures Fingerprint Dive into the research topics where Giles Reger is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles runtime verification Computer Science 100% Theorem Prover Computer Science 67% Automaton Computer Science 48% Search Space Computer Science 27% Order Theorem Prover Computer Science 27% Execution Trace Computer Science 22% high-order logic Computer Science 16% Experimental Result Computer Science 16% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 35 Conference contribution 7 Chapter 5 Conference article 2 Paper 4 More 2 Article 1 Abstract 1 Editorial Research output per year Research output per year LLM-Generated Invariants for Bounded Model Checking Without Loop UnrollingPirzada, M. A. A., Reger, G., Bhayat, A. & Cordeiro, L., 27 Oct 2024, 39th IEEE/ACM International Conference on Automated Software Engineering (ASE 2024).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open AccessFile Control-Flow Graph 100% Loop Unrolling 100% Large Language Model 100% Model Checking 100% Order Theorem Prover 50% 275 Downloads (Pure) ALASCA: Reasoning in Quantified Linear ArithmeticKorovin, K., Kovács, L., Reger, G., Schoisswohl, J. & Voronkov, A., 22 Apr 2023, Proceedings of the 29th on Tools and Algorithms for the Construction and Analysis of Systems (TACAS'23). Springer Cham, p. 647-665 Chapter 33. (Tools and Algorithms for the Construction and Analysis of Systems; vol. 13993).Research output: Chapter in Book/Conference proceeding › Chapter › peer-review Open Access Theorem Prover 100% Order Theorem Prover 100% Automated Reasoning 100% Function Symbol 100% Axiomatization 100% ESBMC-CHERI: Towards Verification of C Programs for CHERI Platforms with ESBMCBrauße, F., Shmarov, F., Menezes, R., Gadelha, M. R., Korovin, K., Reger, G. & Cordeiro, L., 27 May 2022, (Accepted/In press) ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review C Program 100% model checker 40% Source Codes 20% Hardware Level 20% Runtime Protection 20% Position Paper: Towards a Hybrid Approach to Protect Against Memory Safety VulnerabilitiesAlshmrany, K., Bhayat, A., Brauße, F., Cordeiro, L., Korovin, K., Melham, T., Mustafa, M. A., Olivier, P., Reger, G. & Shmarov, F., 30 Aug 2022, (Accepted/In press) IEEE Secure Development Conference.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Hybrid Approach 100% Static Program Analysis 50% Runtime Protection 50% System Software 25% Symbolic Execution 25% A Combinator-Based Superposition Calculus for Higher-Order LogicBhayat, A. & Reger, G., 4 Jul 2020, Automated Reasoning. Springer Nature, Vol. 12166. (Lecture Notes in Computer Science).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Extensionality 100% View all 53 research outputs Projects 1 Not started 1 Active 2 Finished Projects per year Centre for Digital Trust and SocietyBarrett, E. (PI), Allmendinger, R. (Researcher), Elliot, M. (Researcher), Lord, N. (Researcher), Cordeiro, L. (Researcher), Gibson, R. (Researcher), Papamarkou, T. (Researcher), Dresner, D. (Researcher), Aldridge, J. (Researcher), Duncan, P. (Researcher), Banach, R. (Researcher), Brown, G. (Researcher), Dennis, L. (Researcher), Fisher, M. (Researcher), Korovin, K. (Researcher), Kotselidis, C.-E. (Researcher), Luján, M. (Researcher), Mustafa, M. (Researcher), Olivier, P. (Researcher), Reger, G. (Researcher), Zhang, N. (Researcher), Hodgkinson, G. (Researcher), Gulati, S. (Researcher), Ainsworth, J. (Researcher), Chen, Y.-W. (Researcher), Green, B. (Researcher), Healey, M. (Researcher), Uyarra, E. (Researcher), Zachariadis, M. (Researcher), Little, C. (Researcher), Mackey, E. (Researcher), Nenadic, G. (Researcher), Keane, J. (Researcher), Shlomo, N. (Researcher), Graff, N. (Researcher), Jarwar, M. A. (Researcher), Shariati Samani, S. (Researcher), Smith, D. (Researcher), Kambites, M. (Researcher), Thorpe, M. (Researcher), Rowley, P. (Researcher), Flynn, S. (Researcher), Turner, P. (Researcher), Wainwright, V. (Researcher), Czerwinsky, A. (PGR student), Nini, A. (Researcher), Broad, R. (Researcher), Shute, J. (Researcher), Deakin, J. (Researcher), Taboada, P. (PGR student), Knight, P. (Researcher), Hutchings, S. (Researcher), Whyte, J. (Researcher), Tolz-Zilitinkevic, V. (Researcher), Pilkington, H. (Researcher), Guharoy, S. (Researcher), Nicolo, A. (Researcher), Reggiani, C. (Researcher), Garcia Oliva, J. (Researcher), Van Someren, A. (Researcher), Bon, E. (Researcher), Cantijoch Cunill, M. (Researcher), Koch, D. (Researcher) & Chen, Y.-W. (Researcher)11/05/21 → …Project: Other Social Statistics 100% Computer Science 100% Interdisciplinary Research 100% Social Research 100% Business School 100% RAI: Centre for Robotics and Artificial IntelligenceCangelosi, A. (PI), Lennox, B. (PI), Weightman, A. (CoI), Dennis, L. (CoI), Dixon, C. (CoI), Fisher, M. (CoI), Herrmann, G. (CoI), Dickson, A. (CoI), Lanzon, A. (CoI), Stancu, A. (CoI), Miller, A. (CoI), Freitas, A. (CoI), Nini, A. (CoI), Voronkov, A. (CoI), Brass, A. (CoI), Vijayaraghavan, A. (CoI), Parslew, B. (CoI), crowther, W. (CoI), Grieve, B. (CoI), Adorno, B. (CoI), Jay, C. (CoI), Wang, C. C. L. (CoI), Todd, C. (CoI), Soutis, C. (CoI), Arsene, C. (CoI), Dresner, D. (CoI), Barrett, E. (CoI), Gowen, E. (CoI), Arvin, F. (CoI), Podd, F. (CoI), Brown, G. (CoI), Reger, G. (CoI), Cooper, G. (CoI), Mairs, H. (CoI), Yin, H. (CoI), Kinloch, I. (CoI), Eleftheriou, I. (CoI), Li, J. (CoI), Carrasco Gomez, J. (CoI), Ainsworth, J. (CoI), Sinha, J. (CoI), Ozanyan, K. (CoI), Smith, K. (CoI), Twomey, K. (CoI), Margetts, L. (CoI), Ren, L. (CoI), Zhang, L. (CoI), Cordeiro, L. (CoI), Rattray, M. (PI), Bissett, M. (CoI), Elliot, M. (CoI), Alvarez, M. (CoI), Luján, M. (CoI), Nabawy BSc, MSc, PhD, MRAeS, SMAIAA, FHEA, M. (CoI), Peek, N. (CoI), Marjanovic, O. (CoI), Dorn, O. (CoI), Dudek, P. (CoI), Green, P. (CoI), Connolly, P. (CoI), Da Silva Bartolo, P. J. (CoI), Gardner, P. (CoI), Martin, P. (CoI), Potluri, P. (CoI), Curtis, R. (CoI), Schmidt, R. (CoI), Banach, R. (CoI), Batista-Navarro, R. T. (CoI), Kaski, S. (CoI), Midson, S. (CoI), Watson, S. (CoI), Holm, S. (CoI), Furber, S. (CoI), Schlegel, V. (CoI), Mirihanage, W. (CoI), Mansell, W. (CoI), Pan, W. (CoI), Sampson, B. (CoI), Sellers, W. (CoI), Yang, W. (CoI), Cai, P. (CoI), Sun, Y. (CoI), Alharthi, A. (Researcher), Macario Rojas, A. (Researcher), Serhan, B. (Researcher), Yu, C. (Researcher), Abara, D. (Researcher), Lopez Pulgarin, E. (Researcher), Faruq, F. (Researcher), Tavella, F. (Researcher), Semeraro, F. (Researcher), Liu, G. (Researcher), Fang, G. (Researcher), Niu, H. (Researcher), Taylor, H. (PI), Zhu, H. (PGR student), Collenette, J. (Researcher), Amano, K. (Researcher), Lo, K. C. J. (PGR student), Raggioli, L. (Researcher), Romeo, M. (Researcher), Ruocco, M. (PGR student), Ghaffari Saadat, M. (Researcher), Walmsley, M. (Researcher), Mubarik, A. (Researcher), Vinanzi, S. (Researcher), Su, Y.-H. (PGR student), McAleese, H. (PGR student), Stringer, P. (PGR student), Stoican, R. (PGR student), Ye, R. (PGR student), Kurawa, S. S. (PGR student), Zhang, T. (PGR student), Krywonos, W. (PGR student), Xu, Y. (PGR student), Tian, Y. (PGR student), Henderson, A. (Technical team), Morley, D. (Support team), Tallentire, J. (Support team), Smith, J. (Support team), Hawthornthwaite, S. (Support team), C",
  "content_length": 11460,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:44"
}