{
  "name": "Gilles Pesant",
  "homepage": "https://www.polymtl.ca/expertises/en/pesant-gilles",
  "status": "success",
  "content": "Pesant, Gilles | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Pesant, Gilles Poly Directory Courses Français Directory of Experts Pesant, Gilles Directory of Experts Back to search results Edit my profileHelp Publications Link(s) Gilles Pesant B.Sc., M.Sc. (McGill), Ph.D. (Montreal) Publications Link(s) Full Professor Department of Computer Engineering and Software Engineering Phone: (514) 340-4711 Ext. 4142 Fax: (514) 340-5139 Room: M-3404 gilles.pesant@polymtl.ca Areas of expertise Operations research and management science Algorithms Optimization Mathematical modelling Artificial intelligence Combinatorics Intelligent systems applications Primary sphere of excellence in research Modeling and Artificial Intelligence Research interests and affiliations Research interests Constraint programming Algorithms Combinatorial optimization Decision support systems Neuro-symbolic AI AI Planning Rostering Transportation logistics Computer-aided musical composition Affiliation(s) CIRRELT, Researcher Institute for Data Valorization (IVADO), Member Interuniversity Research Centre on Enterprise Networks, Logistics and Transportation (CIRRELT), Member Interuniversity Research Centre on Enterprise Networks, Logistics and Transportation (CIRRELT), Member Expertise type(s) (NSERC subjects) 1601 Operations research and management science 2713 Algorithms 2715 Optimization 2960 Mathematical modelling Publications Recent publications Conference paper Verhaeghe, H., Cappart, Q., Pesant, G., & Quimper, C.-G. (2025, June). Apprentissage de précédences pour des problèmes de planification avec des réseaux de neurones en graphes [Paper]. Plate-Forme Intelligence Artificielle (PFIA'25), Dijon, France (3 pages). Conference paper Camelin, F., Loudni, S., Pesant, G., & Truchet, C. (2025, June). Sampling Frequent and Diverse Patterns Through Compression [Paper]. 29th Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD 2025), Sydney, NSW, Australia. Published in Lecture notes in computer science. Conference paper Camelin, F., Loudni, S., Pesant, G., & Truchet, C. (2025, March). Sampling Frequent and Diversified Patterns Through Compression [Paper]. 40th ACM/SIGAPP Symposium on Applied Computing (SAC 2025), Catania International Airport Catania Italy. Conference paper Yin, C., Cappart, Q., & Pesant, G. (2025, November). Shaping Reward Signals in Reinforcement Learning Using Constraint Programming [Paper]. 22nd International Conference on integration of Constraint Programming, Artificial Intelligence, and Operations Research (CPAIOR 2025), Melbourne, VIC, Australia. Published in Lecture notes in computer science. See all publications (159) Teaching Algorithm analysis and design. Constraint programming Supervision at Polytechnique COMPLETED Ph.D. Thesis (9) Aalian, Y. (2024). Robust Short-Term Scheduling Approach for Underground Mines Using Constraint Programming [Ph.D. thesis, Polytechnique Montréal]. Olivier, P. (2021). Fairness in Combinatorial Optimization [Ph.D. thesis, Polytechnique Montréal]. Hashemi Doulabi, S. H. (2017). Decomposition-Based Integer Programming, Stochastic Programming, and Robust Optimization Methods for Healthcare Planning, Scheduling, and Routing Problems [Ph.D. thesis, École Polytechnique de Montréal]. Elmahi, O. (2016). Verification of the Performance Properties of Embedded Streaming Applications via Constraint-Based Scheduling [Ph.D. thesis, École Polytechnique de Montréal]. Ibrahim, M. (2015). Using Constraint Satisfaction Techniques and Variational Methods for Probabilistic Reasoning [Ph.D. thesis, École Polytechnique de Montréal]. Rix, J. G. (2014). Transportation Optimization in Tactical and Operational Wood Procurement Planning [Ph.D. thesis, École Polytechnique de Montréal]. Sakti, A. (2014). Automatic Test Data Generation Using Constraint Programming and Search Based Software Engineering Techniques [Ph.D. thesis, École Polytechnique de Montréal]. Zanarini, A. (2010). Exploiting Global Constraints for Search and Propagation [Ph.D. thesis, École Polytechnique de Montréal]. Gaudreault, J. (2009). Algorithmes pour la prise de décision distribuée en contexte hiérarchique [Ph.D. thesis, École Polytechnique de Montréal]. Master's Thesis (34) Demers, L.-C. (2024). Génération de musique avec structure à long terme en combinant la programmation par contraintes et l'apprentissage automatique [Master's thesis, Polytechnique Montréal]. Yin, C. (2024). Reward Shaping in Reinforcement Learning with Constraint Programming [Master's thesis, Polytechnique Montréal]. Andre, J. (2022). Modèles de planification minière court terme par programmation par contraintes dans un environnement incertain [Master's thesis, Polytechnique Montréal]. Burlats, A. (2022). Optimisation de la recherche combinatoire d'un solveur mêlant programmation par contrainte et belief propagation [Master's thesis, Polytechnique Montréal]. Chaillard, D. (2022). Combinaison de la programmation par contraintes et de l'apprentissage par renforcement profond pour résoudre les tâches de planification IA classique [Master's thesis, Polytechnique Montréal]. Lafleur, D. (2022). Combining Reinforcement Learning and Constraint Programming for Sequence-Generation Tasks with Hard Constraints [Master's thesis, Polytechnique Montréal]. Manibod, V. (2022). Ajout de structure aux modèles génératifs de séquences avec la programmation par contraintes [Master's thesis, Polytechnique Montréal]. Cordonnier Martin De Gibergues, G. (2021). Using Information from Solution Densities of Relaxations in Solving Variants of the Traveling Salesman Problem [Master's thesis, Polytechnique Montréal]. Nahon, R. (2021). Développement d'un module d'association de tracklets pour améliorer des traqueurs dans le suivi de piétons dans un milieu urbain [Master's thesis, Polytechnique Montréal]. Omrani, B. (2021). Apprentissage par renforcement d'heuristiques de branchement en programmation par contraintes [Master's thesis, Polytechnique Montréal]. Serret, M. F. (2021). Biased Quantum Walks as Value Heuristics for the Quantum Backtracking Algorithm [Master's thesis, Polytechnique Montréal]. Haouas, M. N. (2020). Résolution exacte du problème de partitionnement de données avec minimisation de variance sous contraintes de cardinalité par programmation par contraintes [Master's thesis, Polytechnique Montréal]. Xing, J. (2020). Implementation and Evaluation of Counting-Based Search for Table Constraints in the OscaR Solver [Master's thesis, Polytechnique Montréal]. Coste, P. (2019). Accelerating TSP Solving by Using Cost-Based Solution Densities of Relaxations [Master's thesis, Polytechnique Montréal]. Mohammadalitajrishi, M. (2019). Solving Systems of Linear Equalities in Modular Arithmetic with Applications to Model Counting in Constraint Programming [Master's thesis, Polytechnique Montréal]. Pineault, A. (2019). Suivi multiobjet en situation urbaine à l'aide de la programmation par contraintes [Master's thesis, Polytechnique Montréal]. Briand, A. (2018). Génération automatique de mélodie par la programmation par contraintes [Master's thesis, École Polytechnique de Montréal]. Gagnon, S. (2018). Improvement and Integration of Counting-Based Search Heuristics in Constraint Programming [Master's thesis, École Polytechnique de Montréal]. Cherkaoui El Azzouzi, R. (2015). Algorithmes de dénombrement d'extensions linéaires d'un ordre partiel et application aux problèmes d'ordonnancement disjonctif [Master's thesis, École Polytechnique de Montréal]. Brockbank, S. (2014). Heuristiques de branchement basées sur le dénombrement pour la résolution de problèmes d'arbres de recouvrement contraints [Master's thesis, École Polytechnique de Montréal]. Le Bras, R. (2009). Méthodes d'apprentissage appliquées aux heuristiques de recherche pour les problèmes de satisfaction de contraintes [Master's thesis, École Polytechnique de Montréal]. Feki, S. (2007). Détection de panne dans les réseaux optiques [Master's thesis, École Polytechnique de Montréal]. Pralong, B. (2007). Implémentation de la contrainte REGULAR en COMET [Master's thesis, École Polytechnique de Montréal]. Oumha, A. (2006). Intégration d'heuristiques d'incitation à la programmation par contraintes [Master's thesis, École Polytechnique de Montréal]. Brisson, M. (2004). Recherche locale basée sur les contraintes pour la planification d'horaires de ligues sportives [Master's thesis, École Polytechnique de Montréal]. Lebbah, H. (2004). Confection d'horaires des médecins en salle d'urgence par une méthode hybride de génération de colonnes et de programmation par contraintes [Master's thesis, École Polytechnique de Montréal]. Bourdais, S. (2003). Génération automatique d'horaires en milieu hospitalier [Master's thesis, École Polytechnique de Montréal]. Meric, L. (2003). Routage optique dans des réseaux utilisant des routeurs latins [Master's thesis, École Polytechnique de Montréal]. Pomerleau, Y. (2003). Conception topologique de réseau cellulaire par une approche hybride de programmation par contraintes et de recherche locale [Master's thesis, École Polytechnique de Montréal]. André, M. (2002). Utilisation de la programmation par contraintes et de la recherche taboue pour le problème d'affectation de cellules aux commutateurs [Master's thesis, École Polytechnique de Montréal]. Ducharme, A. (2002). Utilisation de la programmation par",
  "content_length": 11462,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:49"
}