{
  "name": "Gillian Hayes 0002",
  "homepage": "http://www.gillianhayes.com",
  "status": "success",
  "content": "Gillian Hayes Gillian Hayes I am Vice Provost for Academic Personnel at UC Irvine. In my professor life, I am a Chancellor’s Professor and the Robert A. and Barbara L. Kleist Professor of Informatics in the School of Information and Computer Sciences and in the School of Education and School of Medicine at UC Irvine. My research interests are in human-computer interaction, ubiquitous computing, assistive and educational technologies, and health informatics. I design, develop, deploy, and evaluate technologies to empower people to use collected data to address real human needs in sensitive and ethically responsible ways. I am a Jacobs Foundation Senior Research Fellow alumna.  I am an alumna of the School of Interactive Computing at Georgia Tech and the College of Arts and Sciences at Vanderbilt University.  I also love to make cakes. You can download my latest cv here. If you need to schedule time with me, please reach out to Kellie Kamimoto (kkamimot @ uci). She will screen requests with me and do her best to make it happen or direct you to the right place if it is not me. If you think you want to do research with me, please note that I am generally looking for fewer students at the moment given my admin load. Please read this guide for applying to be a PhD student with me. I will know if you email me without reading it, trust me, I will. Things I am currently excited about: If you want to know more about the work I am doing with an incredible global network of collaborators on child development, learning, and technology, check out CERES. I am an acquiring editor for the Springer Nature Synthesis on Health and Technology book series. Please email me if you think you might want to write a book! For students: If you are already a student at UCI and are interested in working with me, please check out the STAR group web page to get a sense of the kind of work my lab does and our lab manual to see if you would be a good fit in other ways. I am mostly interested in working with people who want to do work relevant to child development and assistive technology. As always, my students and I are not brilliant at keeping these things up to date, so my google scholar page is usually a good place to look as well.  Be sure to sort by year so you see the most recent stuff not the most cited. Undergraduate and Masters students should commit to at least two quarters of research if you want to join our lab, with exceptions made for summer programs. You may choose to do research as part of an honors thesis or independent study or in some cases, depending on my current funding, you can be hired. Remote is fine in many cases (fieldwork is a pretty major exception), including remote opportunities for students from other universities. You should read my lab manual before you reach out to me. If you are interested in applying to study as a graduate student in our department, please look at the information here. While I am still advising students, I have had to change my patterns of advising a little since becoming Vice Provost, and I have a much smaller lab than in the past. You should also read this guide for applying to be a PhD student with me. I will know if you email me without reading it, trust me, I will. For people asking me for service: Given the load of being VP for Academic Personnel, I have to be somewhat limited in my service. I do review papers and write tenure and promotion letters. However, I have had to make priorities within these activities and am not able to do as much as I might usually. I predominantly accept review requests for which I am truly an expert and will do my best to point you to reviewers who are more expert than I am in other cases. I am currently prioritizing writing full professor letters, as there are limited people who can write those letters, and letters for people in the UC system, as our system frequently requires a certain number of letters to come from inside. I am particularly careful with potential conflicts of interest given my role as VPAP on campus. Research: Check out the STAR Group Web page for information on my research group.   Please see my CV for most up to date publications listing. Check out my Google scholar page for details on citations, co-authors, and so on. Open Access: I maintain an archive of my own funded research proposals online, along with the rationale for doing so here. Please check to see if you what you want is there. If not, it may be because a Co-PI has asked me not to share the work or the sponsor does not allow it. I have also added my tenure materials and my LOI for the grad dean job at UCI. Please note, none of these things are models. Everyone is different, and I have had way more proposals rejected than funded. I also keep an archive of old courses here. Given that my latest courses are all in Canvas and behind the UCI firewall, it is much harder to share those. Please do reach out though if you would like slides, assignments, and other materials. I am happy to share How to get in touch with me:  (please use the correct set of things depending on why you are contacting me) Academic Personnel 550 Aldrich Hall Provost’s Office University of California, Irvine hayesg [at] uci.edu for UCI and Academic Personnel issues Professor of ICS 5084 Donald Bren Hall Department of Informatics Bren School of Information and Computer Sciences University of California, Irvine gillianrh [at] ics.uci.edu for ICS, research, and student related inquiries Social Media You can connect with me on LinkedIn or you can follow me at various other social media (though to be fair I post almost never) X @gillianrhayes bluesky: @gillianrh.bsky.social mastodon at gillian@hci.social or photo: Steve Zylius/UCI Copyright Gillian R. Hayes Made with by Graphene Themes.",
  "content_length": 5795,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:50"
}