{
  "name": "Gilles Brassard",
  "homepage": "https://en.wikipedia.org/wiki/Gilles_Brassard",
  "status": "success",
  "content": "Gilles Brassard - Wikipedia Jump to content From Wikipedia, the free encyclopedia Canadian computer scientist Gilles BrassardGilles Brassard (2019)Born (1955-04-20) April 20, 1955 (age 70)Montreal, CanadaKnown for Quantum cryptography Quantum counting algorithm Quantum teleportation Quantum entanglement Quantum pseudo-telepathy Amplitude amplification Commitment scheme BB84 BHT algorithm SpouseLise RaymondAwardsFRS (2013)Wolf Prize in Physics (2018) Breakthrough Prize in Fundamental Physics (2023)Scientific careerInstitutionsUniversité de MontréalThesisRelativized Cryptography (1979)Doctoral advisorJohn Hopcroft[1]Doctoral studentsAnne Broadbent Websitewww.iro.umontreal.ca/~brassard Gilles Brassard is a faculty member of the Université de Montréal, where he has been a Full Professor since 1988 and Canada Research Chair since 2001.[2][3] Education and early life[edit] Brassard received a Ph.D. in Computer Science from Cornell University in 1979, working in the field of cryptography with John Hopcroft as his advisor.[1] Research[edit] Brassard is best known for his fundamental work in quantum cryptography, quantum teleportation, quantum entanglement distillation, quantum pseudo-telepathy, and the classical simulation of quantum entanglement.[4][5][6][7][8][9][10] Some of these concepts have been implemented in the laboratory. In 1984, together with Charles H. Bennett, he invented the BB84 protocol for quantum cryptography.[11][12] He later extended this work to include the Cascade error correction protocol, which performs efficient detection and correction of noise caused by eavesdropping on quantum cryptographic signals. Awards and honours[edit] Brassard was the editor-in-chief of the Journal of Cryptology from 1991 to 1998.[10] In 2000, he won the Prix Marie-Victorin, the highest scientific award of the government of Quebec.[10][13] He was elected as a Fellow of the International Association for Cryptologic Research in 2006,[14] the first Canadian to be so honored.[10] In June 2010, he was awarded the Gerhard Herzberg Canada Gold Medal,[15] Canada's highest scientific honour.[16] Brassard was elected a Fellow of the Royal Society of Canada[10] and the Royal Society of London (2013).[17] His nomination reads: Gilles Brassard is one of the earliest pioneers of quantum information science in the world. His most celebrated breakthroughs are the invention of quantum cryptography and quantum teleportation, both universally recognized as fundamental cornerstones of the entire discipline. His other influential discoveries include privacy amplification, entanglement distillation, amplitude amplification and the first lower bound on the power of quantum computers. Through his visionary thinking and groundbreaking research, Professor Brassard has played a pivotal role in transforming the field of quantum information science from what was initially perceived to be merely a fringe pursuit into an area of vigorous and dynamic international activity.[17] On December 30, 2013, the Governor-General of Canada, the Right Honourable David Johnston, announced that Gilles Brassard has been named as an Officer in the Order Of Canada. In 2018, he received the Wolf Prize in Physics[18] and in 2019 the BBVA Foundation Frontiers of Knowledge Award in Basic Sciences.[19] as well as the Micius Quantum Prize. In September 2022, Brassard was awarded the Breakthrough Prize in Fundamental Physics, the world’s largest science prize.[20] In 2023 he was awarded the Eduard Rhein Foundation Prize in Technology.[21] References[edit] ^ a b Gilles Brassard at the Mathematics Genealogy Project ^ The Governor General of Canada's web page announcing appointment of Brassard to Order of Canada. ^ Gilles Brassard publications indexed by Google Scholar ^ Bennett, C. H.; Brassard, G.; Crépeau, C.; Jozsa, R.; Peres, A.; Wootters, W. K. (1993). \"Teleporting an unknown quantum state via dual classical and Einstein-Podolsky-Rosen channels\". Physical Review Letters. 70 (13): 1895–1899. Bibcode:1993PhRvL..70.1895B. doi:10.1103/PhysRevLett.70.1895. PMID 10053414. ^ Bennett, C. H.; Brassard, G. (2014). \"Quantum cryptography: Public key distribution and coin tossing\". Theoretical Computer Science. 560: 7–11. arXiv:2003.06557. doi:10.1016/j.tcs.2014.05.025. ^ Bennett, C.; Brassard, G.; Popescu, S.; Schumacher, B.; Smolin, J.; Wootters, W. (1996). \"Purification of Noisy Entanglement and Faithful Teleportation via Noisy Channels\". Physical Review Letters. 76 (5): 722–725. arXiv:quant-ph/9511027. Bibcode:1996PhRvL..76..722B. doi:10.1103/PhysRevLett.76.722. PMID 10061534. S2CID 8236531. ^ Bennett, C.; Brassard, G.; Mermin, N. (1992). \"Quantum cryptography without Bell's theorem\". Physical Review Letters. 68 (5): 557–559. Bibcode:1992PhRvL..68..557B. doi:10.1103/PhysRevLett.68.557. PMID 10045931. ^ Bennett, C. H.; Brassard, G.; Crepeau, C.; Maurer, U. M. (1995). \"Generalized privacy amplification\". IEEE Transactions on Information Theory. 41 (6): 1915. doi:10.1109/18.476316. ^ Bennett, C.; Bessette, F. O.; Brassard, G.; Salvail, L.; Smolin, J. (1992). \"Experimental quantum cryptography\". Journal of Cryptology. 5: 3–28. CiteSeerX 10.1.1.49.2509. doi:10.1007/BF00191318. S2CID 206771454. ^ a b c d e Herzberg runner-up: Gilles Brassard, Natural Sciences and Engineering Research Council of Canada, retrieved January 24, 2010. ^ Brumfiel, G. (2007). \"Quantum cryptography: Seeking absolute security\". Nature. 447 (7143): 372–373. Bibcode:2007Natur.447..372B. doi:10.1038/447372a. PMID 17522650. ^ Anderson, Mark Kendall (2003), \"The secret is out\", New Scientist, 2423. ^ Les Prix du Québec – le lauréat Gilles Brassard, retrieved January 24, 2010. ^ Gilles Brassard, IACR Fellow, 2006, International Association for Cryptologic Research, retrieved January 24, 2010. ^ Les chercheurs de l'UdeM remportent trois prix nationaux en sciences Archived June 5, 2010, at the Wayback Machine, retrieved June 20, 2010. ^ NSERC – Herzberg – About the Award ^ a b \"Professor Gilles Brassard FRS\". Royal Society. Retrieved July 29, 2013. ^ Wolf Prize 2018 ^ BBVA Foundation Frontiers of Knowledge Award 2019 ^ Semeniuk, Ivan (September 22, 2022). \"Montreal professor Gilles Brassard wins the world's largest science prize\". The Globe and Mail. Retrieved September 22, 2022. ^ Eduard Rhein Foundation Prize 2023 vteFellows of the Royal Society elected in 2013Fellows Harry Anderson Judy Armitage Keith Ball Mike Bevan Mervyn Bibb Stephen Bloom Gilles Brassard Michael Burrows Jon Crowcroft Ara Darzi Bill Earnshaw Gerry Gilmore Nigel Glover Ray Goldstein Melvyn Goodale Martin Green Gillian Griffiths Joanna Haigh Phil Hawkins Edith Heard Gideon Henderson Guy Lloyd-Jones Stephen P. Long Nicholas Lydon Anne Mills Paul O'Brien William D. Richardson Gareth Roberts Kerry Rowe John Savill Christopher J. Schofield Paul Sharp Stephen Simpson Terry Speed Maria Grazia Spillantini Douglas Stephan Brigitta Stockinger Alan Turnbull Jean-Paul Vincent Andrew Wilkie Terry Wyatt Julia Yeomans Robert Young Honorary Bill Bryson Foreign Margaret Buckingham Chen Zhu John Hutchinson Eric Kandel Elliott Lieb K. C. Nicolaou Randy Schekman Eli Yablonovitch Royal Andrew Mountbatten-Windsor (then the Duke of York) vteLaureates of the Wolf Prize in Physics1970s Chien-Shiung Wu (1978) George Uhlenbeck / Giuseppe Occhialini (1979) 1980s Michael Fisher / Leo Kadanoff / Kenneth G. Wilson (1980) Freeman Dyson / Gerardus 't Hooft / Victor Weisskopf (1981) Leon M. Lederman / Martin Lewis Perl (1982) Erwin Hahn / Peter Hirsch / Theodore Maiman (1983–84) Conyers Herring / Philippe Nozières (1984–85) Mitchell Feigenbaum / Albert J. Libchaber (1986) Herbert Friedman / Bruno Rossi / Riccardo Giacconi (1987) Roger Penrose / Stephen Hawking (1988) 1990s Pierre-Gilles de Gennes / David J. Thouless (1990) Maurice Goldhaber / Valentine Telegdi (1991) Joseph H. Taylor Jr. (1992) Benoît Mandelbrot (1993) Vitaly Ginzburg / Yoichiro Nambu (1994–95) John Wheeler (1996–97) Yakir Aharonov / Michael Berry (1998) Dan Shechtman (1999) 2000s Raymond Davis Jr. / Masatoshi Koshiba (2000) Bertrand Halperin / Anthony Leggett (2002–03) Robert Brout / François Englert / Peter Higgs (2004) Daniel Kleppner (2005) Albert Fert / Peter Grünberg (2006–07) 2010s John F. Clauser / Alain Aspect / Anton Zeilinger (2010) Maximilian Haider / Harald Rose / Knut Urban (2011) Jacob Bekenstein (2012) Peter Zoller / Juan Ignacio Cirac (2013) James D. Bjorken / Robert P. Kirshner (2015) Yoseph Imry (2016) Michel Mayor / Didier Queloz (2017) Charles H. Bennett / Gilles Brassard (2018) 2020s Rafi Bistritzer / Pablo Jarillo-Herrero / Allan H. MacDonald (2020) Giorgio Parisi (2021) Anne L'Huillier / Paul Corkum / Ferenc Krausz (2022) Martin Rees (2024) Jainendra K. Jain / Mordehai Heiblum / James P. Eisenstein (2025) Agriculture Arts Chemistry Mathematics Medicine Physics Authority control databases InternationalISNIVIAFGNDWorldCatNationalUnited StatesFranceBnF dataJapanSpainNetherlandsNorwayLatviaIsraelAcademicsCiNiiMathematics Genealogy ProjectScopuszbMATHGoogle ScholarDBLPMathSciNetPeopleDDBOtherIdRefYale LUX Retrieved from \"https://en.wikipedia.org/w/index.php?title=Gilles_Brassard&oldid=1321568453\" Categories: 1955 birthsLiving peopleCanadian computer scientistsModern cryptographersAcademics from MontrealUniversité de Montréal alumniCornell University College of Engineering alumniCanada Research ChairsFellows of the Royal Society of CanadaCanadian fellows of the Royal SocietyOfficers of the Order of CanadaInternational Association for Cryptologic Research fellowsOfficers of the National Order of QuebecQuantum information scientistsScientists from MontrealWolf Prize in Physics laureatesCanadian cryptographersHidden categories: Webarchive template wayback linksUse mdy dates from May 2024Articles with short descriptionShort description matches WikidataArticles with hCards Search Search Gilles Brassard 14 languages Add topic",
  "content_length": 9926,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:44"
}