{
  "name": "Gill Bejerano",
  "homepage": "http://bejerano.stanford.edu/pi.html",
  "status": "success",
  "content": "Bejerano Lab, Stanford University Ode to Genome Research Research (cs) Projects Projects (cs) Rotations (9/2017) People Gill Bejerano Publications Protocols Press Openings (4/2017) Contact Us Open Office Resources M-CAP S-CAP AMELIE Gill Bejerano, Ph.D. E-mail: Associate Professor of Developmental Biology Associate Professor of Computer Science Associate Professor of Pediatrics (Medical Genetics) Associate Professor, Department of Biomedical Data Science Stanford UniversityFaculty affiliations:  Artificial Intelligence Lab, Bio-X, BioMedical Informatics, Child Health Research Institute, Computational Biology Group, Stanford Cancer Institute Please see here for office location, mailing address, etc. Research interests: Vertebrate cis-regulation (read more)Available:  faculty profile,  full CV (old). Education 2004 Ph.D., Hebrew University of Jerusalem, Israel 1997 B.Sc. (Summa Cum Laude), Hebrew University, Israel Selected Awards 2012Weizmann Institute Student Conference Invited Speaker 2010U. Chicago Student Invited Speaker 2009Faculty Fellow, Microsoft Research 2008 Fellow, David & Lucile Packard Foundation UC Berkeley Center for Computational Biology Retreat keynote Searle Scholar Young Investigator Award, Human Frontier Science ProgramFellow, Alfred P. Sloan FoundationTomorrow's principal investigator, Genome Technology Magazine 2007 Junior faculty grant, Edward Mallinckrodt, Jr. Foundation 1999,2003 Best paper by a young scientist award, the RECOMB conference Selected Recent & Upcoming Talks 2013Sao Paulo School of Advanced Science Genome, Disease and Evolution Symposium, Laussane 2012American Society for Human Genetics, San FranciscoSci Foo Camp invitee, GoogleGenetics Seminar, YaleEvo-Devo Student Conference, Weizmann Institute, IsraelGenome Frontiers Institute seminar, U. Penn.Invited speaker, CSU Monterey BayHuman Genetics Seminar, UC DavisInternational Conference on Transposable Elements, AsilomarModern Human Genetic Variation Symposium, StockholmPRBB-PRC Barcelona Selected Publications M. Hiller, B.T. Schaar, V.B. Indjeian, D.M. Kingsley, L.R. Hagey, and G. Bejerano. A \"Forward Genomics\" Approach Links Genotype to Phenotype using Independent Phenotypic Losses among Related Species. Cell Reports 2012. S.L. Clarke, J.E. Vandermeer, A.M. Wenger, B.T. Schaar, N. Ahituv and G. Bejerano. Human Developmental Enhancers Conserved between Deuterostomes and Protostomes. PLoS Genet. 8(8):e1002852, 2012. C.Y. McLean, P.L. Reno, A.A. Pollen, A.I. Bassan, T.D. Capellini, C. Guenther, V.B. Indjeian, X. Lim, D.B. Menke, B.T. Schaar, A.M. Wenger, G. Bejerano  and D.M. Kingsley. Human-specific loss of regulatory DNA and the evolution of human-specific traits. Nature 471:216–219, 2011.C.Y. McLean, D. Bristor, M. Hiller, S.L. Clarke, B.T. Schaar, C.B. Lowe, A.M. Wenger and G. Bejerano. GREAT improves functional interpretation of cis-regulatory regions. Nature Biotechnology 28(5):495-501, 2010.C. McLean and G. Bejerano. Dispensability of mammalian DNA. Genome Research 18(11):1743-1751, 2008.G. Bejerano, C.B. Lowe, N. Ahituv, B. King, A. Siepel, S.R. Salama, E.M. Rubin, W.J. Kent and D. Haussler. A Distal Enhancer and an Ultraconserved Exon are Derived From a Novel Retroposon. Nature, 441(7089):87-90, 2006.G. Bejerano, M. Pheasant, I. Makunin, S. Stephen, W.J. Kent, J.S. Mattick, and D. Haussler. Ultraconserved Elements in the Human Genome, Science, 304:1321-1325, 2004.G. Bejerano and G. Yona. Variations on probabilistic suffix trees - a new tool for statistical modeling and prediction of protein families, Bioinformatics, 17:23-43, 2001. [last modified 2018/08/13 09:27] Bejerano Lab • Departments of Computer Science, Developmental Biology and Pediatrics • Stanford University",
  "content_length": 3730,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:42"
}