{
  "name": "Gillian K. Hadfield",
  "homepage": "https://engineering.jhu.edu/faculty/gillian-hadfield",
  "status": "success",
  "content": "Gillian Hadfield - Johns Hopkins Whiting School of Engineering Contact ghadfield@jhu.edu Location 363 Malone Hall Connect Google Scholar Lab Website LinkedIn Twitter Website Research Areas AI alignment Multi-agent systems Cooperative AI Human normative systems AI governance Legal and regulatory design Institutional and organizational economics Gillian Hadfield is the Bloomberg Distinguished Professor of AI Alignment and Governance at the Whiting School of Engineering and the School of Government Policy. Her research focuses on innovative design for legal, regulatory, and technical systems for AI, computational models of human normative systems, and building AI systems that understand and respond to human values and norms. Hadfield believes normativity—the practice of classifying behaviors as acceptable or unacceptable and then coordinating third-party enforcement schemes to channel behaviors away from those classified as unacceptable—is at the root of everything that distinguishes us from our primate ancestors. Human normative systems—such as social norms, informal dispute resolution, and formal systems of law—are the fundamental infrastructure of human groups. Hadfield is currently working on the challenge of AI governance and alignment problems and computational models to analyze the phenomenon and characteristics of normativity and legal order. For AI to be beneficial to society, it will have to integrate into our normative systems; at a minimum, it must not break these complex, dynamic processes—the systems that underpin our willingness to engage in the phenomenal levels of interdependence and cooperation that characterize modern human societies. This involves determining how to build AI systems that advance human normative efforts, enabling us to find and live by better rules; achieve fairer, more just, and more peaceful societies; and support human flourishing. Her approach is grounded in a career focused on understanding human norms and institutions that promote human well-being. In addition to her roles at Johns Hopkins University, Hadfield is a faculty member of the Vector Institute for Artificial Intelligence in Toronto and a professor of law (status-only) at the University of Toronto. She is also a faculty affiliate at both the University of California, Berkeley Center for Human-Compatible AI and the University of Toronto Schwartz Reisman Institute for Technology and Society, where she previously served as its inaugural director and held the Schwartz Reisman Chair in Technology and Society. Among Hadfield’s awards and honors are the 2024 Carolyn Tuohy Impact on Public Policy Award and President’s Impact Award from the University of Toronto; the 2019 Mundell Medal for Excellence in Legal Writing for her book, Rules for a Flat World: Why Humans Invented Law and How to Reinvent It for a Complex Global Economy; and a 2018 Phi Kappa Phi Faculty Recognition Award. She was additionally named to Maclean’s 2024 The Power List: AI, named a Schmidt Sciences AI2050 senior fellow in 2023, awarded a Rockefeller Foundation Bellagio Centre Residency in 2022, and was a fellow of the Center for Advanced Study in the Behavioral Sciences at Stanford from 2006 to 2007 and again from 2010 to 2011. Hadfield has published in leading journals, including Science, Science Advances, Nature, Proceedings of the National Academy of Sciences of the United States of America, and the Annual Review of Political Science, as well as in the Proceedings of the AAAI/ACM Conference on AI Ethics and Society. Prior to joining Johns Hopkins, Hadfield was a professor of law and strategic management at the University of Toronto. She earned her bachelor’s from Queen’s University and her JD and PhD from Stanford University. Related News View All News Gillian K. Hadfield named Bloomberg Distinguished Professor of AI Alignment and Governance Categories AI/Data Science School News The renowned expert in technology, law, and institutional economics, leads research to reimagine how systems can evolve to meet the demands of a changing world and emerging technologies Site Menu Search Submit Close ﻿",
  "content_length": 4131,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:49"
}