{
  "name": "Gilles Villard",
  "homepage": "http://perso.ens-lyon.fr/gilles.villard",
  "status": "success",
  "content": "Gilles Villard, computer algebra, linear algebra, lattice basis reduction, complexity Gilles VILLARD Directeur de recherche CNRS/Sciences Informatiques Pascaline project-team Laboratoire LIP [CNRS ENSL INRIA UCBL U. Lyon ] 46, Allée d'Italie F69364   Lyon   Cedex 07 RTCA volume in the Springer collection TMSC: call for papers. PUBLICATIONS Detailed list / co-authors. Selected: V. Neiger, C. Pernet, G. Villard. Computing Krylov iterates in the time of matrix multiplication, ISSAC'24, Raleigh, NC, USA, 2024, pdf/doi. G. Villard. Bivariate polynomial reduction and elimination ideal over finite fields, Journal of Symbolic Computation, 127, 2025, pdf/doi. V. Neiger, B. Salvy, É. Schost, G. Villard. Faster modular composition, Journal of the ACM, 71(2)-11, 2024, pdf/doi. C. Pernet, H. Signargout, G. Villard. High-order lifting for polynomial Sylvester matrices, Journal of Complexity, 2023, pdf/doi. C. Pernet, H. Signargout, G. Villard. Exact computations with quasiseparable matrices. ISSAC'23, Tromsø, Norway, 2023, pdf/doi. G. Villard. On computing the resultant of generic bivariate polynomials. ISSAC'18, New York, USA, 2018, pdf/doi, and maple worksheets. C.-P. Jeannerod, V. Neiger, É. Schost, G. Villard. Computing minimal interpolation bases, J. of Symbolic Computation, 83:272-314, 2017, pdf/doi. X.-W. Chang, D. Stehlé, G. Villard. Perturbation analysis of the QR factor R in the context of LLL lattice basis reduction, Mathematics of Computation, 81(279):1487-1511, 2012, pdf/doi. A. Novocin, D. Stehlé, G. Villard. An LLL-reduction algorithm with quasi-linear time complexity, STOC, San Jose, California, 2011, pdf/doi. E. Kaltofen, G. Villard. On the complexity of computing determinants. Computational Complexity, 13:91-130, 2005, pdf/doi. mapml library: exact matrix polynomials and polynomial matrices using pml from Maple. LinBox joint CNRS/NSF project LinBox Team GitHub (linalg.org). The Givaro page, a C++ library for computer algebra. Computer Algebra Seminars - GT Calcul Formel GdR IFM JNCF 2026, Journée Nationales de Calcul Formel, CIRM, Luminy, 2-6 mars 2026. STACS 2026, 43rd International Symposium on Theoretical Aspects of Computer Science Grenoble, 9-13 March 2026. 20 ans du GdR IFM, Sorbonne Université, Paris, 17-19 mars 2026. FoCM 2026, Foundations of Computational Mathematics, University of Vienna, Austria, 8-18 July 2026. ISSAC 2026, International Symposium on Symbolic and Algebraic Computation, Oldenburg, Germany, 13-16 July 2026. ICMS 2026, International Congress on Mathematical Software, Waterloo, 20-23 July 2026. ALBATROSS 2026, Algebraic Methods for Polynomial System Solving, Sorbonne Université, Paris, 1-4 September 2026. International Linear Algebra Society GdR CNRS Informatique Fondamentale et ses Mathématiques - GT Arithmétique Teaching: Modern algorithms for symbolic summation and integration, M2 ENS de Lyon. PAST Conference archives Extended precision floating-point benchmarks. Hplll software library home page,  GitHub repository.",
  "content_length": 3000,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:47"
}