{
  "name": "Giorgio Grisetti",
  "homepage": "https://sites.google.com/dis.uniroma1.it/grisetti",
  "status": "success",
  "content": "Giorgio Grisetti's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationGiorgio GrisettiI cover the role of coordinator of the National PhD in AI Program @sapienza. For me this represents exclusively an expensive call of duty with nothing in return. HENCEFor the PhD Students in AI: PhD related matters have to be discussed exclusively through phd.ai@diag.uniroma1.it. Requests sent to other email addresses will be redirected to /dev/null.PLEASE DON'T USE  giorgio.grisetti {at} uniroma1.it THAT EMAIL IS FOR ADMINISTRATION ONLY. PER FAVORE NON USATE giorgio.grisetti {at} uniroma1.it. QUESTO INDIRIZZO E' PER L'AMMINISTRAZIONE.Giorgio Grisetti is full professor at Sapienza University of Rome. He is responsible for the  RVP Group, and member of the RoCoCo lab at La Sapienza since November 2010., and has been  member of the Autonomous Intelligent Systems Lab. at Freiburg University headed by Wolfram Burgard where he worked as a Post Doc since 2006. His research interests lie in the areas of mobile robotics. His previous and current works aimes to provide effective solutions to mobile robot navigation in all its aspects: SLAM, localization and path planning. He was a PhD student at University of Rome \"La Sapienza\" in the Intelligent Systems Lab. His advisor was Daniele Nardi and he received his PhD degree in April 2006. His PhD thesis focused on SLAM using Rao-Blackwellized particle filters. In 2001, he received his M.Sc. degree in computer engineering, at the University of RomeContactsProf. Giorgio Grisetti   Dept. of Systems and Computer Science  Sapienza University of Rome Via Ariosto 25 I-00185 Rome ItalyPhone: +39 - 06 (keep the \"0\") - 77274121 Fax: +39 - 06 (keep the \"0\") - 77274106 email: grisetti {at} diag.uniroma1.itReport abuseReport abuse",
  "content_length": 1793,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:53"
}