{
  "name": "Giorgio C. Buttazzo",
  "homepage": "http://retis.sssup.it/~giorgio",
  "status": "success",
  "content": "Giorgio Buttazzo's Home Page Giorgio C. Buttazzo Full Professor Scuola Superiore Sant'Anna RETIS Lab, TeCIP Institute Via Moruzzi, 1 56124 Pisa, Italy Phone: (+39) 050 882.012 E-mail: Research interests Real-time scheduling and resource management, heterogeneous computing platforms, advanced robotics applications, and trustworthy deep neural networks. For a comprehensive list topics please visit the RETIS Lab web site. Biographical Sketch Giorgio Buttazzo is Full Professor of Computer Engineering at the Scuola Superiore Sant'Anna of Pisa. He graduated in Electronic Engineering at the University of Pisa in 1985, received a Master in Computer Science at the University of Pennsylvania in 1987, and a Ph.D. in Computer Engineering at the Scuola Superiore Sant'Anna of Pisa in 1991. From 1987 to 1988, he worked on active perception and real-time control at the G.R.A.S.P. Laboratory of the University of Pennsylvania, Philadelphia. From 1991 to 1998, he held a position of Assistant Professor at the Scuola Superiore Sant'Anna of Pisa, where he founded and directed the RETIS Laboratory, one of the world leading research groups on real-time systems. From 1998 to 2005, he held a position of Associate Professor at the University of Pavia, where he directed the Robotics Laboratory of the Computer Science department. In 2003, he was co-founder of Evidence s.r.l., a spin-off company of the Scuola Superiore Sant'Anna providing software solutions for real-time embedded systems. He has been Chair of the IEEE Technical Committee on Real-Time Systems (2010-2012), and Program Chair and General Chair of the major international conferences on real-time computing. He is IEEE Fellow since 2012 \"for contributions to dynamic scheduling algorithms in real-time systems\". In 2013, he received the Outstanding Technical Contributions and Leadership Award from the IEEE Technical Committee on Real-Time Systems. He has been Editor-in-Chief of the Journal of Real-Time Systems (Springer), the major journal on real-time computing and Associate Editor of IEEE Transactions on Industrial Informatics and ACM Transactions on Cyber-Physical Systems. He has authored 10 books on real-time systems and over 300 papers in the field of real-time systems, robotics, and neural networks, receiving 15 Best Paper Awards. Publications Complete list (by date) Complete list (by topic) Journal papers Books and chapters Editorials Awards Related Links RETIS Lab Scuola Superiore Sant'Anna The ERIKA kernel The SHARK kernel EMSIG: Special Interest Group on Embedded Systems IEEE TC on Real-Time Systems For students Courses Meeting students Master students Available theses PhD students TeCIP PhD page Real-Time Conferences ECRTS - Euromicro Conference on Real-Time Systems RTSS - IEEE Real-Time Systems Symposium RTAS - IEEE Real-Time Embedded Technology and Applications Symposium EMSOFT - ACM Int. Conference on Embedded Software RTCSA - IEEE Int. Conference on Real-Time and Embedded Computing Systems and Applications ETFA - IEEE Int. Conference on Emerging Technologies and Factory Automation SIES - IEEE Int. Symposium on Industrial Embedded Systems RTNS - Int. Conference on Real-Time and Network Systems SAC - ACM Symposium on Applied Computing Research Projects Adversarial Attacks and Defenses for AI models, Industrial project funded by Leonardo S.p.A.. AIRCARE - AI-Augmented Robotics For CAncer Point of CaRE Obstacle detection and distance estimation by deep learning in railway environments, Industrial project funded by Progress Rail Signaling S.p.A. Deep learning for generating train speed profiles with minimal energy consumption, Industrial project funded by Hitachi Rail S.p.A. Hand gesture recognition by deep learning for avionic applications, Industrial project funded by Leonardo S.p.A. RETICULATE - Real-time and secure acceleration framework for artificial intelligence, funded by MUR - PRIN OPERAND - A reconfigurable platform & framework for AI inference on the edge, funded by MUR - PRIN NANCY - An Artificial Intelligent Aided Unified Network for Secure Beyond 5G Long Term Evolution, funded by EU - HORIZON.2.4 SOS AI - Science and Engineering of Security of Artificial Intelligence, funded by PNRR, PE7 - SERICS SANDSTORM - Development of hardware and software architettures that are more secure and resilient to cyber attacks, funded by PNRR, PE7 - SERICS SCAR - Security of Autonomus Driving Vehicles, funded by PNRR, PE7 - SERICS VIRMA - An Intelligent Aerial Vehicle for Monitoring Agriculture Environments, funded by MUR-PNR Schedulability analysis and resource management for hard real-time railway applications. Industrial project funded by the Italian Railway Network (RFI) Real-time scheduling and security for heterogeneous computing systems. Industrial project funded by Huawei An innovative multi-sensor system for relative and absolute train positioning. Industrial project funded by Hitachi Rail A hard real-time kernel for secure railway systems. Industrial project funded by the Italian Railway Network (RFI) AMPERE - A model-driven development framework for highly parallel and energy-efficient computation supporting multi-criteria optimization SPHERE - Software Architecture for Predictable Heterogeneous Real-time Systems RETINA - Real-Time Support for Heterogeneous Networks in Automotive Applications ACTORS - Adaptivity and Control of Resources in Embedded Systems PREDATOR - Design for predictability and efficiency (Home) IRMOS - Interactive Realtime Multimedia Applications on Service Oriented Infrastructures ArtistDesign - Embedded Systems Design (Home) ARTIST2 - Embedded Systems Design (Home) ARTIST - Advanced Real-Time Systems FRESCOR - Framework for Real-time Embedded Systems based on COntRacts REMOS - Real-Time Monitoring Systems for Heart Failure RESFIP - Real-Time Monitoring Systems for Fire Prevention FIRST - Flexible Integrated Real-Time Systems Technology OCERA - Open Components for Embedded Real-time Applications FABRIC - Federated Applications Based on Real-time interacting Components Teaching Real-Time Systems Neural Networks and Deep Learning How to do Research Component-Based Software Design Informatica e Sistemi in Tempo Reale Industrial Informatics Computer Architectures Fundamentals of Computer Science Programming in LISP Robotics and Artificial Perception Introduction to Neural Networks Jazz Guitar Improvisation (Italian only) Jazz Practice and Group Performance (Italian only) Diversions Other things I have done or I like to do. Click here if you want to know them. accesses since 07/09/2015",
  "content_length": 6570,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:53"
}