{
  "name": "Giovanni Maria Farinella",
  "homepage": "https://www.dmi.unict.it/farinella",
  "status": "success",
  "content": "Prof. Giovanni Maria Farinella GIOVANNI MARIA FARINELLA Department of Mathematics and Computer Science - University of Catania Curriculum Vitae et Studiorum Request an Updated CV E-Mail giovanni.farinella@unict.it Mobile Request Mobile Number Office +39 095 738 3205 Fax +39 095 330094 (mark fax ATTN. G.M. Farinella) BOOKS Computer Vision - ECCV 2022 Pattern Recognition. ICPR International Workshops and Challenges (link) Book on CV for Assistive Healthcare (link) Book on Registration and Recognition (link) Book on Advanced Topics in Computer Vision (link) Book on Machine Learning for Computer Vision(link) Book on Computer Vision (link) Book on Machine Learning, Optimization, and Big Data (link) Book on New Trends in Image Analysis and Processing (link) INDUSTRIAL PARTNERS FOR Ph.D. GRANTS & PROJECTS Last Update: 07 May 2017 Giovanni Maria Farinella obtained the degree in Computer Science (egregia cum laude) from the University of Catania, Italy, in 2004. He is Founder Member of the IPLAB Research Group at University of Catania since 2005. He also became an Associate Member of the Computer Vision and Robotics Research Group at University of Cambridge in 2006, and Associate Member of the Italian National Research Council since 2018. He was awarded a Doctor of Philosophy (Computer Vision) from the University of Catania in 2008. He is Full Professor at the Department of Mathematics and Computer Science, University of Catania, Italy. His research interests lie in the fields of Computer Vision, Pattern Recognition and Machine Learning, with focus on First Person (Egocentric) Vision. He is Associate Editor of the international journals IEEE Transactions on Pattern Analysis and Machine Intelligence, Pattern Recognition - Elsevier , International Journal of Computer Vision. He has been serving as Area Chair for CVPR 2020/21/22/23, ICCV 2017/19/21/23, ECCV 2020, BMVC 2020, WACV 2019/22, ICPR 2018, and as Program Chair of ECCV 2022, ICIAP 2021 and VISAPP 2019/20/21/22/23. Giovanni Maria Farinella founded (in 2006) and currently directs the International Computer Vision Summer School. He also founded (in 2014) and currently directs the Medical Imaging Summer School. He is member of the European Laboratory for Learning and Intelligent Systems (ELLIS), Senior Member of the IEEE Computer Society, Scientific Advisor of the NVIDIA AI Technology Centre (NVAITC), and board member of the CINI Laboratory of Artificial Intelligence and Intelligent Systems (lead of the area AI for Industry - since 2021). He was awarded the PAMI Mark Everingham Prize 2017 and the Intel's 2022 Outstanding Researcher Award. In addition to academic work, Giovanni's industrial experience includes scientific advisorship to different national and international companies and startups, as well as the leadership as Founder and Chief Scientific Officer of Next Vision - Spinoff of the University of Catania. Scopus Profile, Google Scholar Profile Giovanni Maria Farinella has got the National Scientific Qualification to Associate Professor (ASN - Seconda Fascia) in the areas of Information Engineering (SSD 09/H1) and Computer Science (SSD 01/B1) on 03/12/2013 and 29/01/2014 respectively. He has got the National Scientific Qualification to Full Professor (ASN - Prima Fascia), in the areas of Computer Science (SSD 01/B1) and Information Engineering (SSD 09/H1) on 28/03/2018 and 26/07/2018 respectively. Image Processing Laboratory First Person (Egocentric) Vision @ IPLAB International Events involving Giovanni Maria Farinella in the role of Scientific Director/General Chair/Area Chair/Web Chair/Publicity Chair/Local Organizer European Conference on Computer Vision (ECCV) 2022 Conference on Computer Vision and Pattern Recognition (CVPR) 2022 International Conference on Pattern Recognition (ICPR) 2022 Winter Conference on Applications of Computer Vision (WACV) 2022 International Conference on Computer Vision Theory and Applications (VISAPP) 2022 2021 International Computer Vision Summer School (ICVSS) 2021 British Machine Vision Conference (BMVC) 2021 International Workshop on Assistive Computer Vision and Robotics (ACVR) 2021 ICCV International Workshop on Egocentric, Perception, Interaction and Computing (EPIC) 2021 International Conference on Computer Vision (ICCV) 2021 CVPR International Workshop on Egocentric, Perception, Interaction and Computing (EPIC) 2021 Conference on Computer Vision and Pattern Recognition (CVPR) 2021 International Conference on Image Analysis and Processing 2021 International Conference on Computer Vision Theory and Applications (VISAPP) 2021 AIIS Italian Stories for Maker Faire 2020 2020 International Computer Vision Summer School (ICVSS) 2020 Perception, Learning and Action British Machine Vision Conference (BMVC) 2020 ECCV International Workshop on Egocentric, Perception, Interaction and Computing (EPIC) 2020 International Workshop on Assistive Computer Vision and Robotics (ACVR) 2020 Active Vision and perception in Human-Robot Collaboration (AVHRC) 2020 CVPR International Workshop on Egocentric, Perception, Interaction and Computing (EPIC) 2020 EGO4D Kick Off Workshop 2020 DEEPRETAIL - International Workshop on Deep Understanding Shopper Behaviours and Interactions in Intelligent Retail Environments (2020) International Workshop on Multimedia Assisted Dietary Management (MADiMa) 2020 Conference on Computer Vision and Pattern Recognition (CVPR) 2020 European Conference on Computer Vision (ECCV) 2020 International Conference on Pattern Recognition (ICPR) 2020 International Conference on Computer Vision Theory and Applications (VISAPP) 2020 Maker Faire - Rome, European Edition 2019 2019 International Computer Vision Summer School (ICVSS) 2019 Computer Vision - Where are we? International Conference on Computer Vision (ICCV) 2019 ICCV International Workshop on Egocentric, Perception, Interaction and Computing (EPIC) 2019 International Workshop on Assistive Computer Vision and Robotics (ACVR) 2019 CVPR International Workshop on Egocentric, Perception, Interaction and Computing (EPIC) 2019 IEEE Winter Conference on Applications of Computer Vision (WACV) 2019 ACM International Conference on Multimedia Retrieval (ICMR) 2019 DEEPRETAIL - International Workshop on Deep Understanding Shopper Behaviours and Interactions in Intelligent Retail Environments (2019) International Conference on Image Analysis and Processing (ICIAP) 2019 Ital-IA 2019 Convegno Nazionale CINI sull'Intelligenza Artificiale International Conference on Computer Vision Theory and Applications (VISAPP) 2019 International Workshop on Multimedia Assisted Dietary Management (MADiMa) 2019 2018 International Computer Vision Summer School (ICVSS) 2018 Computer Vision and Deep Learning Medical Imaging Summer School (MISS) 2018 Medical Imaging meets Deep Learning European Conference on Computer Vision (ECCV) 2018 International Conference on Pattern Recognition (ICPR) 2018 International Workshop on Assistive Computer Vision and Robotics (ACVR) 2018 International Workshop on Egocentric, Perception, Interaction and Computing (EPIC) 2018 International Workshop on Multimedia Assisted Dietary Management (MADiMa) 2018 Variational Inequalities, Nash Equilibrium Problems and Applications (VINEPA) 2018 2017 International Computer Vision Summer School (ICVSS) 2017 From Representation to Action International Workshop on Assistive Computer Vision and Robotics (ACVR) 2017 International Workshop on Multimedia Assisted Dietary Management (MADiMa) 2017 International Conference on Computer Vision (ICCV) 2017 British Machine Vision Conference (BMVC) 2017 International Conference on Image Analysis and Processing (ICIAP) 2017 IEEE International Conference on Advanced Video and Signal-based Surveillance (AVSS) 2017 2016 International Computer Vision Summer School (ICVSS) 2016 Computer Vision: What Happens Next? Medical Imaging Summer School (MISS) 2016 Medical Imaging meets Machine Learning International Workshop on Assistive Computer Vision and Robotics (ACVR) 2016 International Workshop on Multimedia Assisted Dietary Management (MADiMa) 2016 Variational Inequalities, Nash Equilibrium Problems and Applications (VINEPA) 2016 International Workshop on Assistive Computer Vision and Robotics (ACVR) 2015 2015 International Computer Vision Summer School (ICVSS) 2015 Learning to See International Workshop on Multimedia Assisted Dietary Management (MADiMa) 2015 International Workshop on Machine Learning, Optimization and big Data (MOD) 2015 Advanced Concepts for Intelligent Vision Systems (ACIVS) 2015 2014 International Computer Vision Summer School (ICVSS) 2014 From Fundamentals to Applications Medical Imaging Summer School (MISS) 2014 Medical Imaging meets Computer Vision International Workshop on Assistive Computer Vision and Robotics (ACVR) 2014 2013 International Computer Vision Summer School (ICVSS) 2013 Computer Vision and Machine Learning ACM Multimedia (ACMMM) 2013 2012 International Computer Vision Summer School (ICVSS) 2012 3R's of Computer Vision: Recognition, Registration, Reconstruction International Workshop on Computer Vision (IWCV) 2012 European Conference on Computer Vision (ECCV) 2012 2011 International Computer Vision Summer School (ICVSS) 2011 Registration, Recognition and Reconstruction in Images and Video 2010 International Computer Vision Summer School (ICVSS) 2010 Registration and Video Analysis 2009 International Computer Vision Summer School (ICVSS) 2009 Machine Learning for Computer Vision 2008 International Computer Vision Summer School (ICVSS) 2008 Recontruction and Recognition 2007 International Computer Vision Summer School (ICVSS) 2007 Detection, Recognition and Segmentation in Context EUROGRAPHICS ITALIAN CHAPTER (EGIT) 2006 COURSES SEMINARS & PRESENTATIONS PUBLICATIONS RESEARCH VISITS PROJECTS PROFESSIONAL ACTIVITIES PICTURES LINKS & EVENTS NEWS Are you looking for my help? Send me an email to fix a meeting. Do not hesitate! Research Scholarship Opportunities Ph.D. Opportunities ",
  "content_length": 13981,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:59"
}