{
  "name": "Giovanni Russello",
  "homepage": "https://www.cs.auckland.ac.nz/~russello",
  "status": "success",
  "content": "Giovanni Russello's Home Page The University of Auckland | The Department of Computer Science Giovanni Russello Position: Senior Lecturer (AtB) // Former CEO & Founder at Active Mobile Security Office: B810 - room 847 Phone: +64 9 373 7599 ext. 86137 Department: Dept of Computer Science University of Auckland, Private Bag 92019, Auckland 1142, New Zealand Email: g dot russello at auckland dot ac dot nz Current Research Topics Security extensions of the Android OS for protection against privilege escalation attacks and separation of application execution modes (see project MOSES). Security for cloud services with particular emphasis on privacy and confidentiality for data storage and secure Pub/sub system. Network security with emphasis on policy-based frameworks, privacy enforcement frameworks, scalable trust-management systems for dynamic authentication. Autonomic middleware for distributed systems, capable of self-managing performance, availability, and security concerns. 2015 Teaching Semester 1: Security for Smart-devices (COMPSCI 702) Semester 2: System Security (COMPSCI 725) Previous teaching: Modern Data Communication (COMPSCI 314), Data Communications and Networks (COMPSCI 742) Professional Services Editorial Board Member: Simulation Modelling Practice and Theory, Elsevier. Reviewer for: ACM Transactions on Information and System Security; IEEE Transactions on Information Forensics and Security; IEEE Transactions on Knowledge and Data Engineering; IEEE Compute Magazine; International Journal of Information Security, Springer; Journal of Computer & Security, Elsevier; Journal of Research and Practice in Information Technology; Journal of Biomedical Informatics, Elsevier. TCP Member (most recent): 10th SecureComm 2014; 9th ARES 2014; 19th ACM SACMAT 2014; 8th IEEE SERE 2014; 14th IFIP DAIS 2014; 8th CRISIS 2013; 5th IEEE CloudCom 2013. Chairing: General Co-Chair PRISMS 2014; TCP Co-Chair PRISMS 2013; TCP Co-Chair ACM SAC-DADS 2013; Publicity Co-Chair SecureComm 2012. Steering Committee: 8th ACM ASIACCS 2013. I am also Steering Committee Member of Stratus, NZ Representative for the Jericho Forum, and Member of the ATNAC NZ Society. Updated: 20-04-2012 Created by Giovanni",
  "content_length": 2214,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:59"
}