{
  "name": "Giovanni Iacca",
  "homepage": "https://sites.google.com/site/giovanniiacca",
  "status": "success",
  "content": "Giovanni Iacca Personal websiteSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeWelcomeI am an Associate Professor at the Department of Information Engineering and Computer Science (DISI) of the University of Trento, Italy, where I lead the Distributed Intelligence and Optimization Lab (DIOL).  I have a dual interest in fundamental and applied research. My main research areas are machine learning and optimization, explainable AI, and distributed systems. Moreover, I have over 15 years of industrial experience in mechatronics and optimization applied to engineering, logistics, and scheduling. I am the Coordinator of the Master's Degree in Computer Science and the Deputy Director of the Information Engineering and Computer Science Doctoral School.I teach (or have taught) courses on:Computer Architectures (Bachelor's level)Introduction to Machine Learning (Bachelor's level)Bio-Inspired Artificial Intelligence (Master's level)Optimization Techniques (Master's level)AI in Medicine (Medical School)My research profiles are available on Google Scholar, Scopus,  ORCID, DBLP, SemanticScholar, ResearchGate, and WoS. My university profile is available on the University of Trento website.PPSN 2026I am honored to be the General Chair of the International Conference on Parallel Problem Solving From Nature (PPSN), a biannual open forum fostering the study of natural models, iterative optimization heuristics, machine learning, and other artificial intelligence approaches (a Core A conference).  All information regarding the conference organization, call for papers/tutorials/workshops, submission, registration, venue, etc., will be provided and constantly updated on the conference website and on our social media channels on LinkedIn and X.In case of any additional inquiries, please do not hesitate to contact me and the organizing team at ppsn2026@unitn.it.Call for PapersCFP for Parallel Problem Solving from Nature (PPSN). Deadline 28 March 2026.CFP for the Special Issue on Interpretable Reinforcement Learning on Applied Soft Computing (Q1). Deadline 31 December 2025.CFP for the Special Session on Opinions and Trends in Evolutionary Computation at EvoStar 2026. Deadline 1 November 2025.News2025November: New paper published. Advancing guitar emotion recognition through audio data augmentation to enhance smart musical instruments.November: New paper published.  Zeroth-Order Adaptive Neuron Alignment Based Pruning without Re-Training. Preprint available here.October: I've been appointed Associate Editor for Applied Intelligence.October: New paper published. An intelligent Digital Twin based on machine learning for interpretable decision-making in manufacturing.October: New preprint posted. A novel approach to quantify out-of-distribution uncertainty in Neural and Universal Differential Equations.August: New paper published. 2SSP: A Two-Stage Framework for Structured Pruning of LLMs. Preprint available here.June: I've been appointed Associate Editor for Evolutionary Intelligence.June: New paper published. Model-Free-Communication Federated Neuroevolution.May: I'm happy to announce the first Workshop on Awareness and Consciousness in Artificial Intelligence (ACAI), which will be part of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp). More info available here.April: The research that we are conducting within the framework of the EIC PATHFINDER project SUSTAIN has been acknowledged as a Key Innovation by the EU Innovation Radar. Within this project, we are developing ultra-fast inference algorithms and advanced, self-adaptive Federated Learning algorithms.April: New papers published at EvoStar 2024:Addressing Radiotherapy Scheduling with a Bin Packing Problem Formulation - A Comparative Study of Exact Solvers and Genetic AlgorithmsA Genetic Algorithm-Based Parameter Selection for Communication-Efficient Federated LearningMulti-Objective Evolutionary Optimization of Virtualized Fast Feedforward NetworksEvolutionary Reinforcement Learning for Interpretable Decision Making for the Supply ChainA Coach-Based Quality-Diversity Approach for Multi-Agent Interpretable Reinforcement LearningSocial Interpretable Reinforcement LearningMarch: Andrea Ferigo successfully defended his PhD in Information Engineering and Computer Science! The PhD thesis is available here.March: Two papers accepted at ICLR 2025 Workshop on Sparsity in LLMs:2SSP: A Two-Stage Framework for Structured Pruning of LLMsZeroth-Order Adaptive Neuron Alignment Based Pruning without Re-TrainingMarch: I've been appointed Editorial Board Member for Memetic Computing.February: New paper published (in collaboration with MyAv). A customer behavior-driven clustering method in the planogram design domainFebruary: New paper published at AAAI 2025. SMoSE: Sparse Mixture of Shallow Experts for Interpretable Reinforcement Learning in Continuous Control Tasks. Preprint available here.2024November: New paper published. Totipotent neural controllers for modular soft robots: Achieving specialization in body–brain co-evolution through Hebbian learningNovember: New paper published at SenSys 2024. Fast-Inf: Ultra-Fast Embedded Intelligence on the Batteryless EdgeNovember: New paper published at NeurIPS 2024. Frustratingly Easy Test-Time Adaptation of Vision-Language ModelsNovember: New paper published at NeurIPS 2024. Diffusion-based Curriculum Reinforcement LearningSeptember: New paper published.  Evolutionary Computation and Explainable AI: A Roadmap to Understandable Intelligent Systems. Preprint available here.July: New papers published at GECCO 2024 workshops:The Effect of Training Schedules on Morphological Robustness and GeneralizationBalancing human livability and bumblebee population in urban green areas via Agent-Based Model and Evolutionary AlgorithmsAccelerating GP Genome Evaluation Through Real Compilation with a Multiple Program Single Data ApproachAn investigation on the use of Large Language Models for hyperparameter tuning in Evolutionary AlgorithmsComparing Large Language Models and Grammatical Evolution for Code GenerationJuly: New paper published. A co-evolutionary algorithm with adaptive penalty function for constrained optimizationJuly: We won the Interpretable Control Competition - Continuous Track at GECCO 2024!May: New paper published at PPSN 2024. Influence Maximization in Hypergraphs Using Multi-Objective Evolutionary Algorithms. Preprint available here.April: New paper published. Understanding Sparse Neural Networks from their Topology via Multipartite Graph Representation. Preprint available here. April: Four papers published at GECCO 2024:Neuron-centric Hebbian Learning (oral)NEvoFed: A Decentralized Approach to Federated NeuroEvolution of Heterogeneous Neural Networks (oral)Multi-Objective Evolutionary Hindsight Experience Replay for Robot Manipulation Tasks (oral)Many-Objective Evolutionary Influence Maximization: Balancing Spread, Budget, Fairness, and Time (poster)April: Hyunho Mo got the Best PhD Award 2023 in Industrial Innovation!March: New paper published. Curriculum learning for robot manipulation tasks with sparse reward through environment shiftsMarch: New papers published at EvoStar 2024:Low-Memory Matrix Adaptation Evolution Strategies Exploiting Gradient Information and Lévy FlightHindsight Experience Replay with Evolutionary Decision Trees for Curriculum Goal GenerationMarch: ACM TELO Special Issue on Special Issue on Explainable AI in Evolutionary Computation published. Editorial available here.February: New papers published at the European Robotics Forum (ERF) 2024Awareness in robotics: An early perspective from the viewpoint of the EIC Pathfinder Challenge \"Awareness Inside''. Preprint available here.A Reinforcement Learning method to minimize the damage on a falling Ballbot2023December: I've been appointed Associate Editor for IEEE Transactions on Evolutionary Computation.November: New paper published.  Quality-Diversity Optimization of Decision Trees for Interpretable Reinforcement LearningNovember: New paper published. Metaheuristics in the balance: a survey on memory-saving approaches for platforms with seriously limited resourcesAugust: New paper published. A population-based approach for multi-agent interpretable reinforcement learning. Preprint available here.June: Our work on Evolutionary Computation and XAI, and Leonardo Lucio Custode's PhD work are on the SIGEVO newsletterJune: Hyunho Mo successfully defended his PhD in Industrial Innovation! The PhD thesis is available here.May: It's been a pleasure to give a public outreach talk on Generative AI at the Cremona Art Week! Kudos to our great students!May: New paper published at GECCO 2023 Workshop on Industrial Applications of Metaheuristics. Evolutionary F1 Race StrategyApril: Leonardo Lucio Custode successfully defended his PhD (cum laude) in Information Engineering and Computer Science! The PhD thesis is available here.April: New paper published. Evolutionary Neural Architecture Search on Transformers for RUL Prediction.March: New paper published at GECCO 2023. Self-Building Neural Networks. Preprint available here. Medium story (written by an external researcher) available here.March: I've been appointed Editorial Board Member for Applied Soft Computing.March: New paper published. Evolutionary Optimization of Convolutional Extreme Learning Machine for Remaining Useful Life Prediction.March: It's a great honor to host as visiting guest lecturer Prof. Marjan Mernik from the University of Maribor, Slovenia. Inspiring talk on Exploration and Exploitation in Evolutionary Algorithms: Recent Developments.February: I've been elevated to the grade of IEEE Senior Member.January: New paper published.  Evolutionary learning of interpretable decision trees. Preprint available here. Code available here, featured in PwC newsletter.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 9937,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:56"
}