{
  "name": "Giovanni Gallo",
  "homepage": "https://web.dmi.unict.it/docenti/gallo.giovanni",
  "status": "success",
  "content": "Giovanni GALLO | Dipartimento di Matematica e Informatica Vai al contenuto principaleVai al menu di navigazione Vai ai contenuti correlati Giovanni GALLO Professore ordinario di Informatica [INFO-01/A] Contatti Ufficio: DMI, edificio 5, studio 301Email: giovanni.gallo@unict.it - giogallo@gmail.comTelefono: 095 7383041 Orario di ricevimento In ogni momento conveniente, per appuntamento, con lo studente che lo richieda per posta elettronica | Giovedì dalle 10:00 alle 15:00 In presenza presso lo studio del docente al DMI, in alternativa per via telematica Sede del ricevimento: DMI, edificio 2, studio 301 ENGLISH VERSIONSTUDIUMAREA RISERVATA BIOGRAFIACURRICULUMPUBBLICAZIONIINSEGNAMENTIATTIVITÀ DI RICERCAAVVISI Giovanni Gallo, classe1962, è professore di Informatica presso l'Università di Catania dal 1992. E' professore ordinario nel settore scientifico INF01 dal 2001. Dal 2024 è Presidente del Corso di Laurea Magistrale Interdipartimentale in Data Science Insegna Computer Grafica e Computer Grafica avanzata nel corso di Laurea di Informatica, di Informatica Magistrale. Insegna Basics of Computing nel corso di LAurea Magistrale in Data Science Fuori dall'Ateneo collabora presso l'Accademia di Belle Arti di Catania e presso l' lITS Steve Jobs di Caltagirone. Svolge attività di ricerca nel settore della Computer Grafica, Elaborazione di Immagini e Analisi Dati. Partecipa alle attività di ricerca del gruppo IPLab presso il DMI. E' socio ACM, EUROGRAPHICS, IEEE ed è Socio  effettivo della Accademia Gioenia di Catania. Scarica il file VISUALIZZA LE PUBBLICAZIONI N.B. l'elevato numero di pubblicazioni può incidere sul tempo di caricamento della pagina VISUALIZZA GLI INSEGNAMENTI DALL'A.A. 2022/2023 AD OGGI Anno accademico 2021/2022 DIPARTIMENTO DI ECONOMIA E IMPRESACorso di laurea magistrale in Data Science for Management - 1° annoBASICS OF COMPUTING DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoFONDAMENTI DI ANALISI DATI E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 3° annoCOMPUTER GRAFICA Anno accademico 2020/2021 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoFONDAMENTI DI ANALISI DATI E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 3° annoCOMPUTER GRAFICA Anno accademico 2019/2020 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoFONDAMENTI DI ANALISI DATI E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 3° annoCOMPUTER GRAFICA Anno accademico 2018/2019 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoFONDAMENTI DI ANALISI DATI E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 3° annoCOMPUTER GRAFICA Anno accademico 2017/2018 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoFONDAMENTI DI ANALISI DATI E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 1° annoPROGRAMMAZIONE I M - Z DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 3° annoCOMPUTER GRAFICA Anno accademico 2016/2017 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoFONDAMENTI DI ANALISI DATI E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 3° annoCOMPUTER GRAFICA Anno accademico 2015/2016 DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 1° annoFONDAMENTI DI ANALISI DATI E LABORATORIO DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea magistrale in Informatica - 2° annoPATTERN RECOGNITION DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Informatica - 3° annoCOMPUTER GRAFICA DIPARTIMENTO DI MATEMATICA E INFORMATICACorso di laurea in Matematica - 2° annoINFORMATICA II VISUALIZZA GLI INSEGNAMENTI PRECEDENTI Attività di Ricerca Svolge ricerca interdisciplinare a partire dalle competenze di Matematica Applicata, Analisi dei dati, Computer Grafica e, Computer Vision e Image Processing. I principali risultati di buona qualità scientitfica e con impatto internazionale ottenuti si raccolgo intorno ai seguenti grandi temi: a) ricerca pura in Grafica e Visione b) applicazioni interdisciplinari in i) immagini mediche ii) tecnologia per i beni culturali iii) analisi dati medici e sociali. ARCHIVIO Condividi Facebook Twitter Whatsapp Telegram Email Storia del DMI Regolamenti Organi e Commissioni Personale del DMI Docenti Personale Tecnico/Amministrativo Assegnisti di ricerca Dottorandi Coordinamento dipartimentale Amministrazione, Uffici e Servizi Guide Procedure e moduli Assicurazione della Qualità DMI sui social Aule Link utili Cerca nel sito Termini da ricercare",
  "content_length": 4841,
  "method": "requests",
  "crawl_time": "2025-12-01 13:14:57"
}