{
  "name": "Giri Narasimhan",
  "homepage": "http://www.cs.fiu.edu/~giri",
  "status": "success",
  "content": "Prof. Giri Narasimhan Giri Narasimhan Distinguished University Professor, FIU; Ryder Endowed Professor & 2023 Top Scholar Google Cloud Research Innovator, 2024; (Blog) Director, UKG Academy for CS Education Coach, FIU Programming Team Coordinator, MS in Data Science and AI Knight Foundation School of Computing & Information Sciences Florida International University 11200 SW 8th Street, CASE 254B, Miami, FL 33199-0001. Ph: (305) 348-3748; Lab: (305) 348-6250 Fax: (305) 348-3549; Email: girics.fiu.edu ; girifiu.edu Research All Publications; Software Research Group (BioRG); BioRG Publications Algorithms for Machine Learning and Data Analytics (AMaDAys) Google Scholar Scopus Author Teaching CAP 5768: Intro to Data Science F18, F19, F20, F21 COP 4534: Algorithmic Techniques F21 CAP 2752: Foundations of Data Science COT 6405: Analysis of Algorithms F19 COT 5407: Intro to Algorithms S19, S17, F08 IDC 6940: Capstone in Data Science Su20, S20, F19, F18 CAP 5510/CGS 5166: Bioinformatics F18, S15, S13, S11, S08, S07, S06, S05, F03 COP 3530 Data Structures F16, S04 COT 6936: Topics in Algorithms S14, S12 BSC 4934: Q'BIC Capstone Su11, Su10 COP 4516: Competitive Programming & Problem Solving Miscellaneous Links: E-mail (SCS); E-mail (FIU) Hurricanes (I, II, and NR); Dictionary Corona Virus Meters (I and II) Emergency 348-HELP(4357) FIU Programming Team; Join Team Discord Server: Linktree; Old Lectures Video Recordings on Problem Solving: I, II Join vJudge for online judge environment. In Memoriam Melita Jaric, Ph.D. student, passed away on March 11, 2013. A bright, promising life was snuffed out in a careless hit-and-run accident. For more details, click here Memorial Service Video: click here Melita Jaric Memorial Travel Award: To donate click here Travel Fellowships: Our efforts I am convinced that everything that is worth while in the world has been accomplished by the free, inquiring, critical spirit... But the men of ritual and the men of barbarism are capable of shutting up the men of science and of silencing them forever.\" — Sinclair Lewis, from It Can't Happen Here A teacher who is attempting to teach without inspiring the pupil with a desire to learn is hammering on a cold iron... Horace Mann A teacher is a facilitator of learning, a curator of content, and most of all, a motivator of learning... D. B. Phatak Teacher vs Guru Edited Volume Bionformatics Research and Applications Zhipeng Cai, Ion Mandoiu, Giri Narasimhan, Pavel Skums, and Xuan Guo LNCS/LNBI Vol. 12304, Springer Verlag, 2020. [ISBN: 978-3-030-57820-6] and [ISBN: 978-3-030-57821-3](eBook) DOI: 10.1007/978-3-030-57821-3 Edited Volume Computational Advances in Bio and Medical Sciences Ion Mandoiu, T. M. Murali, Giri Narasimhan, Sanguthevar Rajasekaran, Pavel Skums, and Alexander Zelikovsky LNCS/LNBI Vol. 12029, Springer Verlag, 2019. [ISBN: 978-3-030-46164-5] and [ISBN: 978-3-030-46165-2] (eBook) DOI: 10.1007/978-3-030-46165-2 Edited Volume Bionformatics Research and Applications Ion Mandoiu, Giri Narasimhan and Yanqing Zhang Vol. 5542, Springer Verlag, 2009. [ISBN: 978-3-642-01550-2] Research Monograph Geometric Spanner Networks Giri Narasimhan and Michiel Smid 560 Pages, January 2007 Cambridge University Press. [ISBN: 0521815134] Also available in eBook format. Slides by M. Farshi from course based on book: Spring 2014. Edited volume Advances In Bioinformatics And Its Applications Eds: M. He, Giri Narasimhan, S. Petoukhov Series in Mathematical Biology and Medicine Vol. 8, 632 Pages, May 2005 World Scientific Press. [ISBN: 981-256-148-X] Editor: International Journal of Bioinformatics Research and Applications. Program Committees: BIBM 2018-21, BioKDD 2020, ISBRA 2020 (Co-Chair), ICCABS 2019 (Co-Chair), StringBio 2019 (Co-Chair), ICMLA 2019, BICoB-2011, New Orleans, LA; BIOINFORMATICS 2011, Rome, Italy; BIOT 2010, Lafayette, LA; ISBRA 2010, Storrs, CT; ISBRA 2009, Ft. Lauderdale, FL; BICoB2009, New Orleans, LA; AAIM 2008, Shanghai, China; ICMLA 2008, San Diego, CA; CBB 2008, Orlando; ISBRA 2008, Atlanta; ICMLA 2007, Cincinnati, OH; BIBM 2007, Silicon Valley, CA; ISBRA 2007, Atlanta; BLSC07, Niagara Falls, Canada; WEA 2007, Rome, Italy; ICISTM 2007, New Delhi, India; ICMLA 2006, Orlando; CASB 2006, Dallas; IWBRA 2006, Reading, U.K.; ISAAC 2006, Kolkata, India; Dagstuhl Workshop 2006, Dagstuhl, Germany; IWBRA 2005, Atlanta; HiPCoMB 2005, Fukuoka, Japan; ICBA'04, Ft. Lauderdale; WADS'03, Ottawa; ALENEX'02, San Francisco; SPIRE'00, Spain; SPIRE'99, Mexico. Research Groups: Bioinformatics Research Group (BioRG) and Algorithms for Machine Learning and Data Analytics, (AMaDAys) Curriculum Vitae [April 2022] (pdf) Interesting Pointers: Personal Links Dept. E-mail; Univ. E-mail; Personal E-mail Links; UoM E-mail; UoM Homepage Kalai Mathee (E-Mail: matheekfiu.edu) ( Venetian Venture! ) Child Relief and You (CRY) America; Ekal Vidyalaya; Sahara; FIU Badminton Club Media articles: TAPESTRY (2013); PantherNow (2022); University Information SCS Computer Problems; SIS Advisor Web Site; Faculty Assessment Information FIU Library; FIU Library Orders; FIU course catalog; FIU Calendar 2006-07; FIU Calendar 2005-06; Final Exam Schedule 2004-05 DSRT Forms; Academic Misconduct; Writing Consultation Service for Graduate Students Scholarships for Grad/Undergrad students Career Development Career Guide for Aspiring Women Developers: Pathways to Programming Publishing Computational Material Books with Jupyter: Open source project for building beautiful, publication-quality books and documents from computational material. Data Science, AI, and ML Yahoo Datasets for Interesting Challenges; CODAP Project; Data Science for K-12 Python Tutorials -- Real Python Captum: Algorithms for Interpretability and XAI Interpretable Machine Learning, by Christoph Molnar. Tutorials on Transformers: Annotated Transformer (Alexander Rush, 2018); Annotated Transformer (Updated by Huang et al., 2022); Illustrated Transformer (by Jay Alammar); The Data8 text book project on Data Science, by Adhikari and DeNero. Computational and Inferential Thinking textbook, by Adhikari, DeNero, and Wagner Text: Data Science -- A First Introduction, by Timbers, Campbell, Lee. Geographical Data Science with Python, by Rey, Arribas-Bel, Wolf. An Introduction to Earth and Environmental Data Science, by Ryan Abernathy et al. (Python-based) Introduction to Programming in Python (4 chapters), by Sedgewick, Wayne, and Dondero. Shiny with Python: create interactive visualizations and web apps in Python. Also see examples; Intro to CS - Python Learn Python(Self-paced) Python Data Science Handbook, Jake VandePlas Applied Statistics with R text by David Dalpiaz Datasets from CalTech Vision Lab (Useful for ML/AI Projects) Webseer to compare Google search results AI For Science, 2019. ML beyond curve fitting: An Intro to Causal Inference and do-calculus One Hundred Year Study on Artificial Intelligence (AI100), Stanford University. Our World in Data MiamiVerse R-bloggers Bayesian Networks & BayesiaLab (EBook) Data Science Heroes Team Data Science Process from Microsoft ; Article Tools: Interactive Data Exploratory Analysis and Reporting (IDEAR) and Automated Modeling and Reporting (AMR) Zenodo: data and research repository Carpentries: Foundational Coding and Data Science Skills Dockers: Build your docker; with instructions OpenRefine: for data cleaning and transformation Programmableweb: Leading source of APIs, Mashups, and web services Biocatalogue: curated catalogue of Web Servicesfor the Life Sciences Data Science Job Preps Projects & Portfolios: 9 Data Science Project Ideas to Jump-Start Your Portfolio; 3 Data Scince Projects that got me 12 interviews ...; Tech Interviews: My favorite coding question ... (Confessions of an interviewer?) Bioinformatics and Computational Biology What is Bioinformatics? Microbiome Online Text: Orchestrating Microbiome Analysis by Lahti, Borman, Ernst, et al., 2023. Funding Agencies: NSF: NSF FastLane; SEIII; SABI; BIO Directorate; NIH: NIH Grants (Extramural Programs); BDMA; Standard Deadlines; Resources: NCBI Entrez; PDB; BLAST; TIGR's Tools; tigr fams; Software List (SDSC); PIR (iProClass); SWISS-PROT; InterPro; CLUSTALW; PROSITE; Pfam; PRINTS; ProDom; SMART; Gene Expression Databases: Array Express, Geo from NCBI (and its SQL Implementation), GeneX, GeneXML. MGED: Gene Expression Data Standardization Initiative. Pedro's BioMolecular Research Tools: A Collection of WWW Links to Information and Services Useful to Molecular Biologists Alpha and Beta Diversity in Microbiomes: Statistical Analysis of Metagenomics Data, by Luz Calle, Genomics Inform, 2019 On-line Manuals: SPDBV Manual International Society for Computational Biology (ISCB) Mol Biol Hypertext (MIT); Mol Biol Techniques Manual (U CapeTown) Online course notes (with animations) for Microbiology course from Gary Kaiser's web page, CCBC. Graphics Gallery: from the National Health Museum (great short lessons in Mol. Biol). Great Experiments Series: Read about some of the greatest experiments that led to great discoveries! Algorithms and Computational Geometry CLRS Solutions Use KaTeX to typeset mathematical formulae online MkDocs: fast, simple static site generator for building project documentation. Also Material for MkDocs to create themes. Lecture slides for \"Algorithm Design\" by Kleinberg and Tardos; slides created by Kevin Wayne, Princeton; Demos Understanding Quaternions -- Grant Sanderson / Ben Eater Computer Science Review Journal Computational Geometry Pages Seiferas' theory/foundations bibliography Computational Geometry Bibliography Computer Science Bibliography Computer Science Journals/Publishers Theoretical Computer Science Journals/Conferences Top Conferences in Algorthms and Theory Handbook of Biological Statistics, 3rd Ed., John McDonald; An R Companion, S. Mangiafico Electronic Statistics Textbook Microsoft Office Online Video Tutorials EIS Field Guide: Exploratory Data Analysis; Hypothesis Testing; Modeling;\tTermin",
  "content_length": 21106,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:03"
}