{
  "name": "Gitta Domik",
  "homepage": "https://cs.uni-paderborn.de/cgvb/personal/gitta-domik-kienegger",
  "status": "success",
  "content": "Gitta Domik-Kienegger - Computergrafik, Visualisierung und Bildverarbeitung | Universität Paderborn Prof. Dr. Gitta Domik-Kienegger Computergrafik, Visualisierung und Bildverarbeitung E-Mail schreiben Mehr zur Person Prof. Domik leitete das Fachgebiet “Computergrafik, Visualisierung und Bildverarbeitung“ am Institut für Informatik der Universität Paderborn bis 30. 9. 2021. Außerhalb des Fachgebiets war sie zuletztim Eurographics 2021 Organizing Committee (Education Papers Co-Chair)Co-Chair Graphics & Visual Computing Journal, Special Section on CG Education in Times of CovidMitglied des ACM SIGGRAPH Distinguished Educator Award CommitteeMitglied des ACM SIGGRAPH Education CommitteeMitglied bei IEEE (Senior Member), ACM (Senior Member), GI (Gesellschaft für Informatik), Eurographics.Preise2020 \"Weierstraß-Preis für ausgezeichnete Lehre\" der Fakultät Elektrotechnik, Informatik und Mathematik der Unversität Paderborn2016/2017 IEEE and ACM Senior Membership2002 \"Weierstraß-Preis für ausgezeichnete Lehre\" der Fakultät Elektrotechnik, Informatik und Mathematik der Unversität Paderborn1995 Undergraduate Computational Engineering and Science Award (by Dept. of Energy, USA) together with Elizabeth Jessup, Lloyd Fosdick and Carolyn Schauble1986 IEEE Geoscience and Remote Sensing 1986 \"Best Paper Award\"Service in der Wissenschaft und der Universität (in den 5 Jahren vor dem Ruhestand):2015-2019 Studiendekanin der Fakultät für Elektrotechnik, Informatik und Mathematik der Universität Paderborn2011-2016 Mitglied des Editorial Board, IEEE Computer Graphics and ApplicationsForschungsinteressen lagen zuletzt besonders auf dem Gebiet der medizinischen Grafik und der Curriculum Entwicklung für Data Visualization und Data Science. Weitere Informationen gibt es in den Einträgen für: Publikationen, Forschung, Lehre. Eine Kurzform des Curriculum Vitae ist hier im Anschluss zu finden. Seit 1993 bin ich Professorin der Fachgebiete Visualisierung, Computergrafik, und Bildverarbeitung am Institut für Informatik an der Unversität Paderborn. Bis zu meiner Berufung an die Universität Paderborn im April 1993 gehörte ich dem Department of Computer Science an der University of Colorado at Boulder (USA) als Research Assistant Professor an. Zum beruflichen Werdegang gehören ausserdem Positionen am Center for Astrophysics and Space Astronomy an der University of Colorado (1987-1990), bei der Firma Vexcel Corporation in Boulder (1985-1987) und dem Institut für Bildverarbeitung und Computergraphik der Forschungsgesellschaft Joanneum (1982-1985) in Graz, Österreich. 1981 graduierte ich an der TU Graz (Technische Mathematik, Dipl.-Inf.) und 1985 promovierte ich, ebenfalls an der TU Graz (Dr. techn.). Radar Image Simulation and its Application in Image Analysis G. Domik, F. Leberl, M. Kobrick, in: International Archives of Photogrammetry and Remote Sensing, Rio de Janeiro, Brazil, 1984, pp. 99–108. Rectification of Radar Images Using Stereo- Derived Height Models and Simulations G. Domik, F. Leberl, J. Raggam, in: XVth Congress of the International Society for Photogrammetry and Remote Sensing, Rio de Janeiro, 1984, pp. 109–116. Evaluation of radar stereo viewability by means of a simulation technique G. Domik, in: ESA IGARSS 84: Remote Sensing: From Res. towards Operational Use, 1984. Method to Relate Digital SAR Images and Map Information in Mountainous Areas G. Domik, E. Kienegger, in: Proceedings of the World Conference on Remote Sensing, 1984. The SAR-580 experiment on snow and glaciers at the Austrian test site H. Rott, G. Domik, in: Proc. SAR-580 Investigators Workshop, 1984, pp. 217–232. Differential Rectification of SLR-Images Using Map-Derived and Radar-Generated Digital Elevation Models. G. Domik, F. Leberl, J. Raggam, Differential Rectification of SLR-Images Using Map-Derived and Radar-Generated Digital Elevation Models., Graz Research Center, 1984. Analyse von Radarbildern mittels digitaler Hoehenmodelle G. Domik, M. Kobrick, F. Leberl, Bildmessung Und Luftbildwesen 52 (1984) 249–263. Radar image simulation as a tool to analyze topographic effects on geometry and radiometry of radar imagery G. Domik, in: Machine Processing of Remotely Sensed Data- Quantifying Global Process: Models, Sensor Systems, and Analytical Methods, 1985, pp. 248–253. Radargrammetric aspects of SAR data evaluation J. Raggam, G. Triebnig, M. Buchroithner, G. Domik, F. Leberl, Thematic Applications of SAR Data (1985) 57. Mapping with aircraft and satellite radar images F. Leberl, M. Kobrick, G. Domik, The Photogrammetric Record 11 (1985) 647–665. DOI Towards a SAR system for snow and land ice applications H. Rott, G. Domik, C. Mätzler, H. Miller, ESA Proceedings of a Workshop on Thematic Applications of SAR DATA p 29-39(SEE N 86-28488 19-42) (1985) 29–39. Multiple incidence angle SIR-B experiment over Argentina: generation of secondary image products G. Domik, F. Leberl, J. Cimino, IEEE Transactions on Geoscience and Remote Sensing GE-24 (1986) 492–497. DOI Digital terrain mapping with STAR-1 SAR data J. Mercer, R. Lowry, F. Leberl, G. Domik, in: International Geoscience and Remote Sensing Symposium, IGARSS, 1986, pp. 645–650. Developing tools for digital radar image data evaluation G. Domik, F. Leberl, J. Raggam, in: Remote Sensing for Resources Development and Environmental Management; Proceedings of the Seventh International Symposium, 1986, pp. 117–119. Radar Stereomapping Techniques and Application to SIR-B Images of Mt. Shasta F. Leberl, G. Domik, J. Raggam, M. Kobrick, IEEE Transactions on Geoscience and Remote Sensing GE-24 (1986) 473–481. DOI Multiple Incidence Angle SIR-B Expenment Over Argentina: Stereo-Radargrammetrc Analysis F. Leberl, G. Domik, J. Raggam, J. Cimino, M. Kobrick, IEEE Transactions on Geoscience and Remote Sensing GE-24 (1986) 482–491. Using secondary image products to aid in understanding and interpretation of radar imagery G. Domik, F. Leberl, in: IGARSS’86: Remote Sensing: Today’s Solutions for Tomorrow’s Information Needs, European Space Agency, ESA SP, 1986, pp. 467–468. Radargrammetric Experiments with Space Shuttle SIR-B Imagery F. Leberl, G. Domik, J. Raggam, J. Cimino, M. Kobrick, International Archives of Photogrammetry and Remote Sensing= Archives Internationales de Photogramm{\\’e}trie et de T{\\’e}l{\\’e}d{\\’e}tection= Internationales Archiv Der Photogrammetrie Und Fernerkundung (1986) 333–344. Image based SAR product simulation for analysis G. Domik, F. Leberl, in: ASPRS-ACSM, 1987. Digital Rectification Method for Radar Images Applied on Huge Arrays G. Domik, in: Proceedings of the First Int’l. Workshop on Image Rectification Tech. for Spaceborne Synthetic Aperture Radar, 1987, pp. 67–68. Methods and application of surface shape reconstruction from multiple SAR images G. Domik, in: IGARSS’87-International Geoscience and Remote Sensing Symposium, 1987, pp. 1551–1555. Methods and accuracy of operational digital image mapping with aircraft SAR F. Leberl, G. Domik, B.J. Mercer, in: 1987 ASPRS ACSM Annual Convention, 1987, pp. 148–158. Enhancement Techniques in Digital Image Processing G. Domik, in: Proceedings of the Computer Science Symposium, Graz, Austria, 1988, pp. 211–217. A multi-spectral analysis system using large databases. E.W. Brugel, G. Domik, S.A. Voels, in: European Southern Observatory Conference and Workshop Proceedings, 1988, pp. 3–8. Dependence of image grey values on topography in SIR-B images G. Domik, F. Leberl, J. Cimino, International Journal of Remote Sensing 9 (1988) 1013–1022. SIR-B stereo-radargrammetry of Australia F. Leberl, W. Mayr, G. Domik, M. Kobrick, International Journal of Remote Sensing 9 (1988) 997–1011. IRAS On-Line Catalogs at CASA G. Domik, E.W. Brugel, R.E. Stencel, in: Proceedings of the 176th Meeting of the American Astronomical Society, 1990. Applications of IRAS Preprocessing at the Workstation G. Domik, E. Brugel, R. Stencel, S. Vasudevan, J. Pang, in: Bulletin of the American Astronomical Society, 1990, p. 828. Workstation-based preprocessing of IRAS sky-flux images G. Domik, E.W. Brugel, R.E. Stencel, J. Pang, S. Vasudevan, Publications of the Astronomical Society of the Pacific 102 (1990) 1167. A case study: Multi-sensor data analysis of hh objects via star: A scientific toolkit for astrophysical research K. Mickus, E. Brugel, G. Domik, T. Ayres, in: Bulletin of the American Astronomical Society, 1990, p. 1259. Star-a scientific toolkit for astrophysical research K. Mickus, G. Domik, E. Brugel, T. Ayres, in: Bulletin of the American Astronomical Society, 1990, p. 828. The role of visualization in understanding data G. Domik, in: H. Maurer (Ed.), New Results and New Trends in Computer Science, Springer Berlin Heidelberg, Berlin, Heidelberg, 1991, pp. 91–107. Visualization in the Analysis Cycle of Observational Data, in Analyzing and Modeling Data and Knowledge G. Domik, K. Mickus, in: M. Schader (Ed.), Proceedings of the 15th Annual Conference of the “Gesellschaft Für Klassifikation e.V.” University of Salzburg, 1991, pp. 267–276. Design and development of data visualization systems in a workstation environment G. Domik, K.D. Mickus-Miceli, Journal of Microcomputer Applications 15 (1992) 81–88. DOI Designing User-Centered Interfaces for Astrophysical Software G. Domik, in: Proceedings on User Interfaces for Astrophysical Software, 1992. Software design and development in a scientific environment: lessons learned during the development of STAR, an astrophysical analysis and visualization package G.O. Domik, K.D. Mickus-Miceli, in: D.M. Worrall, C. Biemesderfer (Eds.), Astronomical Data Analysis Software and Systems I, 1992, p. 95. Visualization of Multi-dimensional Arrays in Astronomy G. Domik, in: European Southern Observatory Conference and Workshop Proceedings, 1992, p. 249. An Enriched Framework for Multidisciplinary Data Analysis K. Mickus-Miceli, G. Domik, in: Symposium on Intelligent Scientific Computation, American Association for Artificial Intelligence (AAAI), Fall 1992 Sy",
  "content_length": 21791,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:03"
}