{
  "name": "Giulia Guidi",
  "homepage": "https://giuliaguidi.github.io",
  "status": "success",
  "content": "Brief Bio - Giulia Guidi Professor Giulia GuidiAssistant Professor of Computer Science Follow Ithaca, NYCornell UniversityEmailGoogle ScholarORCIDGitHubI’m an Assistant Professor in the Department of Computer Science at Cornell University. I received my PhD in Computer Science from UC Berkeley. I work in the field of high-performance computing (HPC) for large-scale computational sciences and lead the Cornell HPC group. I’m interested in developing algorithms and software infrastructures on parallel machines to speed up data processing without sacrificing programming productivity, and to make high-performance computing more accessible. I’m a big fan of sparse linear algebra and believe in sparse linear algebra as a computational abstraction for tackling large-scale computational challenges.I received the 2024 SIAG/Supercomputing Early Career Prize, the 2023 ISSNAF Young Investigator Mario Gerla Award, and the 2020 SIGHPC Computational & Data Science Fellowship.I’m an Affiliate Faculty in the Applied Math and Computational Sciences Division (Performance and Algorithms Group) at Lawrence Berkeley National Laboratory and a Graduate Field Faculty in the School of Electrical and Computer Engineering, Department of Computational Biology and the Center for Applied Math at Cornell.I’m also a faculty member of the Computer Systems Laboratory (CSL) at Cornell University.I’ll be recruiting PhD students for Fall 2026 to join my group at Cornell CS. Our research spans parallel computation, sparse linear algebra, programming systems, large-scale computational biology challenges, and algorithms for emerging hardware architectures. Projects focus on parallel scientific computation, including—but not limited to—real-world large-scale challenges in computational biology and emerging hardware technologies. Prior biology knowledge is not required, but a background in parallel computing and C/C++ programming is highly encouraged.The group fosters a collegial, collaborative culture in the beautiful natural surroundings of Ithaca, NY. You’ll likely enjoy Ithaca much more than you expect!Due to limited time, I’m mostly unable to respond to individual email inquiries. If you’re interested, please apply to the Cornell CS PhD program and mention my name in your application materials, along with why you’re interested in working with me. The applications are submitted through the department.Publications, Talks, TeachingFor a complete list of publications, talks, and teaching information, please see my CV (I’m fairly good at keeping it up to date) or my Google Scholar account. The PDFs of most of my articles can be found on arXiv.If you’re interested in course or research talk slides, please feel free to email me. I’ll add them here eventually.Recent Updates4/24/2025 I’m very pleased to announce that our NSF proposal “ACED: Fast and Scalable Whole Genome Analysis on Emerging Hardware Technologies” was awarded. This project, conducted in collaboration with Professor April Wei’s Lab, will address major computational challenges in population genetics through parallel computation, sparse linear algebra, and new hardware technologies.",
  "content_length": 3156,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:04"
}