{
  "name": "Giulio Jacucci",
  "homepage": "https://researchportal.helsinki.fi/en/persons/giulio-jacucci",
  "status": "success",
  "content": "Giulio Jacucci - University of Helsinki View Scopus Profile Giulio Jacucci Helsinki Institute for Information TechnologyProfessor, Department of Computer ScienceSupervisor for doctoral programme, Doctoral Programme in Computer Science﻿﻿﻿ Phone+358407535357, +358294151153Emailgiulio.jacuccihelsinkifi FinlandPL 68 (Pietari Kalmin katu 5)00014Finland 20062025 Research activity per year Personal profile Fields of Science113 Computer and information sciencesHuman-computer interaction Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2006 2013 2014 2015 2016 2017 2018 2021 2025 106 Conference contribution 77 Article 5 Chapter 4 Patent 10 More 2 Anthology or special issue 2 Other conference material 2 Review Article 1 Book 1 Foreword / postscript 1 Abstract 1 Poster Research output per year Research output per year A neuroadaptive interface shows intentional control alters the experience of timeSpapé, M., Ahmed, I., Harjunen, V., Jacucci, G. & Ravaja, N., 19 Mar 2025, In: Scientific Reports. 15, 1, 15 p., 9495.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Democratic Moderation: Exploring the Use and Perception of Votekicking in Social Virtual RealityChen, Q., Wu, Q. & Jacucci, G., 2025, Proceedings Of The 2025 Chi Conference On Human Factors In Computing Sytems, Chi 2025. ACM , 18 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile Immersive Tailoring of Embodied Agents Using Large Language ModelsBellucci, A., Jacucci, G., Trung, K. D., Das, P. K., Smirnov, S. V., Ahmed, I. & Lugrin, J. L., 2025, 2025 IEEE Conference Virtual Reality and 3D User Interfaces (VR), Saint Malo, France. New York: Institute of Electrical and Electronics Engineers, p. 392-400 9 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Investigating the Use and Perception of Blocking Feature in Social Virtual Reality Spaces: A Study on Discussion ForumsChen, Q., Mousavi, S. M., Riccardi, G. & Jacucci, G., 2 May 2025, In: Proceedings of the ACM on human-computer interaction. 9, 2, p. 1-19 19 p., 120.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Mirror Dwellers in Social VR: Investigating Reasons and Perception of Mirror WatchingChen, Q., Bellucci, A. & Jacucci, G., 2 May 2025, In: Proceedings of the ACM on human-computer interaction. 9, 2Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile View all 202 research outputs Projects Projects per year 2013 2013 2020 2023 2027 2 Finished 2 Active Projects per year DataLit: Data Literacy for Responsible Decision-MakingHonkela, A. (Project manager), Jacucci, G. (Project manager), Bai, Y. (Participant), He, C. (Participant), Heikkilä, M. (Participant), Pradhan, G. (Participant), Wohlrath, D. (Participant), Zaki, A. H. N. (Participant) & Zhao, L. (Participant)Academy of Finland01/10/2023 → 30/09/2026Project: Research Council of Finland: Strategic Research Council funding (SRC) MyModel: Interactive Models for Resourceful RecommendationsJacucci, G. (Project manager), Ahmed, I. (Participant), Chen, Q. (Participant), Das, P. K. (Participant), Kobra, K. (Participant), Ma, J. (Participant), Smirnov, S. (Participant) & ZHou, X. (Participant)Academy of Finland01/09/2023 → 31/08/2027Project: Research Council of Finland: Academy Project Data Literacy for Responsible Decision-MakingYlikoski, P. (Project manager), Honkela, A. (Principal Investigator), Jacucci, G. (Principal Investigator), Salokannel, M. (Principal Investigator), Bellomo, M.-L. (Participant), Ignatius, J. E. (Participant), Lakso, M. M. (Participant), Salokannel, M. (Participant), Savolainen, A. E. (Participant), Snell, K. (Participant), Tarkkala, H. (Participant), Tupasela, A. (Participant), Vesikukka, T. P. J. (Participant), He, C. (Participant), Snell, K. (Participant), Tajeddine, R. (Participant), Tarkkala, H. (Participant), Tupasela, A. (Participant), Valaste, M. (Participant) & Wallenberg (Rusanen), A.-M. (Participant)SUOMEN AKATEMIA Vähäkylä Leena01/10/2020 → 30/09/2023Project: Research Council of Finland: Strategic Research Council funding (SRC) Tietotyön vallankumous / Revolution of Knowledge WorkFloréen, P. (Project manager), Ravaja, N. (Participant), Tarkoma, S. (Participant), Myllymäki, P. (Participant), Jacucci, G. (Participant), Turpeinen, M. (Participant), Kaski, S. (Participant) & Müller, K. (Participant)Unknown funder01/09/2013 → 28/02/2015Project: Research project Activities Activities per year 2017 2017 2017 1 Organisation and participation in conferences, workshops, courses, seminars Activities per year CHI 2017Salovaara, A. (Attendee), Jacucci, G. (Attendee) & Oulasvirta, A. (Attendee)6 May 2017 → 11 May 2017Activity: Participating in or organising an event types › Organisation and participation in conferences, workshops, courses, seminars Press/Media Probabilistic user modelling methods for improving human-in-the-loop machine learning for predictionKaski, S., Ruotsalo, T. & Jacucci, G.12/05/20211 item of Media coveragePress/Media: Press / Media Deep learning will transform the mobile and sensor application landscapeJacucci, G.21/02/20181 item of Media coveragePress/Media: Press / Media WIPO PUBLISHES PATENT OF UNIVERSITY OF HELSINKI AND AALTO UNIVERSITY FOUNDATION FOR \"INFORMATION RETRIEVAL CONTROL\" (FINNISH INVENTORS)Jacucci, G. & Ruotsalo, T.24/09/20171 item of Media coveragePress/Media: Press / Media EEG reveals information essential to usersJacucci, G., Ruotsalo, T. & Kaski, S.08/12/2016 → 09/12/20162 items of Media coveragePress/Media: Press / Media WIPO PUBLISHES PATENT OF UNIVERSITY OF HELSINKI AND AALTO UNIVERSITY FOUNDATION FOR \"EXPLORATORY SEARCH\" (FINNISH INVENTORS)Jacucci, G. & Ruotsalo, T.10/10/20161 item of Media coveragePress/Media: Press / Media",
  "content_length": 6279,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:06"
}