{
  "name": "Giulia Boato",
  "homepage": "https://webapps.unitn.it/du/en/Persona/PER0000755/Curriculum",
  "status": "success",
  "content": "Giulia Boato | CV | University of Trento Giulia Boato Full professor Department of Information Engineering and Computer Science Via Sommarive, 5 - 38123 Povo tel. 0461 283193 giulia.boato[at]unitn [dot] it Expertise: Cyber security Data security Digital forensics Image processing Information & Communication Technology (ICT) Information extraction Information retrieval Multimedia Multimedia analysis Multimedia information retrieval Multimodal retrieval Security Signal processing Statistics Education 2005 Ph.D. in Information and Communication Technology at the University of Trento with a thesis \"Innovative methodologies for secure multimedia communications using Birkhoff polynomial interpolation\". 2002 M.Sc. (Laurea) degree in Mathematics at the Faculty of Science of the University of Trento with a thesis “AES: the Advanced Encryption Standard” with final marks 110/110 cum laude. 1998 Scientific lyceum degree with final marks 60/60 in Trento. Spent the 4^ year in the lyceum of Charlottemburg in Berlin and got the bilingualism license (Italian-German). Academic career and teaching activities Giulia Boato was born in Rovereto (Trento) in 1979. In 2002 she received the M.Sc. degree in Mathematics at the Faculty of Science of the University of Trento. In 2005 she obtained the Ph.D. in Information and Communication Technologies, working in the Multimedia Signal Processing and Understanding Lab on innovative methodologies for secure multimedia communications using Birkhoff polynomial interpolation. In 2006 she was visiting researcher at the University of Vigo (Spain). From end of 2006 to 2018 she was Assistant Professor at the Department of Information Engineering and Computer Science (DISI) of the University of Trento (Italy). Currently, she is Associate Professor at DISI, University of Trento, and professor of the courses \"Probability\" and \"Multimedia data security'\" within the B.Sc. and M.Sc. Degree in Telecommunications Engineering, respectively. Since 2006 she has been collaborating with the Signal Processing Department of the Tampere University of Technology (Finland), in particular with Prof. Karen Egiazarian. Since 2009 she has been working with Prof. Hany Farid of the Dartmouth College (USA) on digital image and video forensics techniques, co-advising a Ph.D. thesis. In 2018 she was visiting professor at the University of Innsbruck collaborating with Prof. Rainer Boehme and his group. Research interests Her research interests are focused on image and signal processing, with particular attention to - multimedia data protection - data hiding - image forensics (tampering detection via geometric approaches, computer versus natural data discrimination) - image antiforensics but also intelligent multidimensional data management and analysis - diversity in multimedia retrieval - event based multimedia management Research work Her research interests are focused on image and signal processing, with particular attention to multimedia data protection, data hiding and image forensics, but also intelligent multidimensional data management and analysis. On these topics she is active in the European Projects coordinated by DISI: in LIVINGKNOWLEDGE for the development of image forensics methods supporting opinion mining on the web, in GLOCAL for the design of multimedia annotation and retrieval systems based on the concept of event. In 2006 she was visiting researcher at the Signal Theory and Communications Department of the University of Vigo (Spain). Since 2006 she has been collaborating with the Signal Processing Department of the Tampere University of Technology (Finland), in particular with Prof. Karen Egiazarian. Since 2009 she has been working with Prof. Hany Farid of the Dartmouth College (USA) on digital image and video forensics techniques, co-advising a Ph.D. thesis. Memberships in societies and scientific committees ACM, IEEE, GTTI Elected member of: TC MMSP, TC IFS, SAT BioForSec Awards and honours Best paper AWARD a IEEE WIFS 2012 Top 10% paper AWARD a MMSP 2012 Other work She was in the Project staff of some past projects (DIPLODOC, AIDER, GRID.IT, PERSEO) and on-going projects (EU projects: SAFESPOT, FP7 FET-IP LIVINGKNOWLEDGE, FP7 IP GLOCAL, FP7 CA ETERNALS). She was co-chair of the International Workshop Living Web: making diversity a true asset (Washington DC, October 2009) within the International Semantic Web Conference 2009. She is in the Technical Program Committee of the International Conference on Image Processing (ICIP) and of the International Conference on Communications (ICC); and Local Arrangements Chair of the International Symposium on Modeling and Optimization in Mobile, Ad Hoc, and Wireless Networks 2005 and of the International Conference on Multimedia Retrieval 2011. She is reviewer for many international journals, e.g., IEEE Transaction on Information Forensics and Security, IEEE Transaction on Signal Processing, IEEE Transaction on Multimedia, IEEE Transaction on Circuits and Systems for Video Technology.",
  "content_length": 5022,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:05"
}