{
  "name": "Giulio Malavolta",
  "homepage": "https://sites.google.com/view/giuliomalavolta",
  "status": "success",
  "content": "Giulio MalavoltaSearch this siteEmbedded FilesSkip to main contentSkip to navigationBIOI am an Assistant Professor in the Department of Computing Sciences at Bocconi University. I am also affiliated with the Bocconi Institute for Data Science and Analytics and with the CIFRA Lab. My research focuses on mathematical aspects of cryptography, computer security, and quantum computing.Prior to joining Bocconi, I was a tenure-track faculty at the Max Planck Institute for Security and Privacy, and before that a postdoc at UC Berkeley and at Carnegie Mellon University. In fall 2019 I spent a semester as a research fellow at the Simons Institute for the Theory of Computing. I completed my PhD in 2019 at Friedrich-Alexander University, where my thesis was recognized with the Staedtler-Stiftung dissertation prize.I was fortunate to be awarded an ERC starting grant and the Heinz-Maier Leibnitz prize.Email: giuliø.malavølta@høtmail.it (substituting ø with o).Office: Room 2-C2-02, via G. Röntgen 1, Milano.TEACHINGI am currently teaching the following courses:Computer Science II (30540)Theoretical Computer Science (30516)Lecture notes of previous courses and seminars are also available: Sum of Squares.RESEARCH GROUPMy research group is generously supported by grants from the CASA cluster of excellence for cyber security, the European Research Council, and Lockheed Martin. Below is a list of the current members.Postdocs: Damiano Abram, Pedro Branco, and Valerio Cini.PhD Students: Phillip Gajland, Alexander Kulpe, and Tianwei Zhang.Alumni:Noemi Gläser - Practical Cryptography for Blockchains: Secure Protocols with Minimal Trust.Ahmadreza Rahimi - Registration-Based Encryption.ACADEMIC SERVICEI served (or will serve) as a program committee member for the following conferences:(2025) EUROCRYPT, QCrypt(2024) ITC, ITCS, TCC(2023) ICALP, QCrypt, TCC, TQC(2022) ASIACRYPT, EUROCRYPT, PKC, QCW, S&P (Oakland)(2021) CCS, CVC, PKC(2020) CRYPTO, CVC, SBCI also served as a reviewer for the Journal of Cryptology, for the European Research Council, and for the Israeli Science Foundation.I co-organized the following workshops:Kyoto Quantum CryptographyTheory and Practice of Laconic Cryptography at EUROCRYPT 2024.The Multiple Facets of Quantum Proofs at STOC 2022.I also co-organized the IACR Summer School on Post-Quantum Cryptography.PUBLICATIONSFor an updated list of publications, please refer to dblp.FAMILYMy wife does machine learning!Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2496,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:05"
}