{
  "name": "Giuseppe Prencipe",
  "homepage": "http://sbrinz.di.unipi.it",
  "status": "success",
  "content": "Giuseppe's Prencipe Home Page Home Research Publications My Band!! My Personal Page News Summer School of the AI National PhD, June 2023, La Maddalena. In collaboration with AInCP! International Symposium on Algorithmic Theory of Networks and their Dynamics 2022 (SAND), June 2023, it will be in Pisa! FUN With Algortihms (FUN 2022), Double FUN edition (2022+2022)! International Symposium on Algorithmic Theory of Networks and their Dynamics 2021 (SAND), Virtual Latest Papers Asynchronous Gathering in a Dangerous Ring. Algorithms, April 2023. DOI: 10.3390/a16050222 A Systematic Review of Wi-Fi and Machine Learning Integration with Topic Modeling Techniques. Sensors, June 2022. DOI: 10.3390/s22134925 Separating Bounded and Unbounded Asynchrony for Autonomous Robots:Point Convergence with Limited Visibility. PeerJ PODC 2021. Compacting Oblivious Agents on Dynamic Rings. PeerJ Computer Science, March 2021. Linear Time Distributed Swap Edge Algorithms. Information Processing Letters, June 2020. DOI: 10.1016/j.ipl.2020.105979 Associate Professor (and researcher :) ) Presidente CdS Dipartimento di Informatica UniversitÃ di Pisa Largo Bruno Pontecorvo, 3 56127 - Pisa Room 327 ITALIA Adjunct Professor at University of Ottawa School of Electrical Engineering and Computer Science Ottawa, Canada E-mail: giuseppe.prencipe AT unipi.it tel.: (+39) 050-2213148 fax.: (+39) 050-2212726 Curriculum Vitae (IT, EN) My Google Scholar Page Research Activities Main projects AInCP (clinical validation OF Artificial INtelligence for providing a personalized motor clinical profile assessment and rehabilitation of upper limb in children with unilateral Cerebral Palsy) -- HORIZON-HLTH-2021-DISEASE-04 â GA101057309 I-POTERI (Innovazione nel POtenziamento e TElemonitoraggio della RIabilitazione post operatoria) CEO of Tennis Commander, a spin-off of the University of Pisa The Acube Lab, partner of the SoBigData++ EU research infrastructure for Social Mining and Big Data Analytics, started in January 2020 Past projects can be found here University's duties Current Presidente del Consiglio aggregato dei corsi di studio in Informatica Past Membro della Commissione scientifica dâarea 01 Delegato per lâOrientamento (Dipartimento di Informatica) Committees Member of the Editorial Board of Electronics (section Computer Science & Engineering), since 2019 Member of the Steering Committee of FUN With Algorithms Conference since 2016 Member of the Steering Committee of the SAND conference, since 2021 Co-founder of the Research Meeting and School on Distributed Computing by Mobile Robots Member of the Program Committee of several international conferences (here) Teaching (Calendario lezioni) (Calendario esami) a.a. 2020/2021 Programmazione e Algoritmica (Corso A) Iscriversi al corso su Google Classroom clicando qui oppure utilizzanco il codice ulzwqr5 Laboratorio I (Corso A) Iscriversi al corso su Google Classroom clicando qui oppure utilizzanco il codice h7x2vdh Programming for Data Science (Data Science and Business Informatics) Iscriversi al corso su Google Classroom clicando qui oppure utilizzanco il codice y3qj2ft Past SOL (Laboratorio di Sistemi Operativi) Fondamenti di Programmazione (Matematica) TFA 2015 (TFA 2015) PAS 2014 -- LAB ALGO (PAS 2014) SOL (Laboratorio di Sistemi Operativi) TFA 2013 -- LAB ALGO (TFA 2013) Telematica (Informatica Umanistica) Algoritmica e Laboratorio (Informatica Applicata) Algoritmi e Strutture Dati (SSIS -- Informatica, Regione Toscana, 2009) (Lucidi) Sistemi Operativi Laboratorio di Reti -- II Modulo JAVA: dalle basi alle reti Algoritmi e Strutture Dati (SSIS -- Informatica, Regione Toscana, 2007) (Lucidi) Overview on Robots (Talk given on June 13, 2007, for the MiniWorkshop on Computations by Mobile Entities - Agents, Robots, Sensors -- School of Graduate Studies Galilei, Dipartimento Di Informatica, Pisa) Corso OpenOffice avanzato (Svolto per la provincia di Lucca, Nov. 2007)",
  "content_length": 3948,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:11"
}