{
  "name": "Giuseppe Santucci",
  "homepage": "http://www.diag.uniroma1.it/users/giuseppe%20santucci",
  "status": "success",
  "content": "Giuseppe Santucci | Dipartimento di Ingegneria informatica, automatica e gestionale Salta al contenuto principale Home » Users » Giuseppe Santucci Giuseppe Santucci Professore Ordinariostanza: B207telefono: +39 0677274006email uniroma1: giuseppe.santucci@uniroma1.it Biografia Giuseppe Santucci è professore associato presso il Dipartimento di Ingegneria Informatica Automatica e Gestionale Antonio Ruberti (già Dipartimento di Informatica e Sistemistica) della \"Sapienza\" Università di Roma, dove tiene i corsi di Fondamenti di Informatica, Software Engineering e Visual Analytics. Home page della didattica/Teaching Da diversi anni partecipa alle attività dei comitati di programma ed effettua revisioni per le più importanti conferenze e riviste internazionali dei settori di interesse, quali Journal of Visual Languages and Computing, Journal of Software Engineering and Knowledge Engineering, ACM International Conference on Management of Data (SIGMOD), International Conference on Very Large Databases (VLDB), International Conference on Information Visualization, IEEE Visualization Conference e IEEE Visual Analytics Science and Technology. Dal 2008 fa parte dell' editorial review board dell' International Journal of Mobile Human Computer Interaction (IJMHCI). Giuseppe Santucci ha curato l'organizzazione di vari eventi scientifici. In particolare è membro dello Steering Committe del Workshop internazionale on Advanced Visual Interfaces (AVI) e, tra gli altri eventi, nel 2006 e nel 2008 è co-chair dell' International Workshop BEyond time and errors: novel evaLuation methods for Information Visualization BELIV 06, Venezia, Italy, 23 May 2006, workshop satellite di AVI 2006 e BELIV 08, Firenze, Italy, 5 April 2008, workshop satellite di ACM CHI 2008, workshop focalizzati sullo studio di tecniche di valutazione per la visualizzazione dell' informazione. Nel 2010 è co-chair del convegno CHItaly 2009, Rome, June 17-19. Nel 2010 è program chair del 2010 International Workshop on Visual Languages and Computing, Oak Brook, Illinois, USAOctober 14 to October 16, 2010.Nel 2010 è general and program chair del ACM International Working Conference, AVI 2010 Advanced Visual Interfaces, Rome 25-29 May, 2010. Nel 2011 è co-chair del EuroVA 2011, 31 maggio, Bergen e general chair del 2011 International Workshop on Visual Languages and Computing, Firenze, 18-20 agosto. Nel 2012 e 2013 è paper chair della IEEE Conference on Visual Analytics Science and Technology (IEEE VAST). Link alla biografiaInteressi di ricerca Ha svolto attività di ricerca principalmente nei settori Interfacce per Basi di Dati, Interazione Persona-Calcolatore e Visual Analytics, pubblicando oltre 130 articoli su riviste e congressi internazionali. Nei primi due settori l'attività di ricerca si è concentrata su aspetti teorici dei linguaggi di interrogazione visuali per modelli semantici, esplorandone, in particolare, il potere espressivo e le proprietà topologiche. Nel terzo e più recente settore di interesse la ricerca si è concentrata su aspetti relativi a Visual Analytics, a data mining visuale, alla valutazione di tecniche di visualizzazione dell'informazione ed allo studio formale delle caratteristiche di degrado di una visualizzazione. Membro di Human-Computer Interaction Cybersecurity Awards 2018 IEEE VizSec 2018 Best Paper Ultime pubblicazioni Bridging the Gap: Cyber Defence Skills for the Future in 2024 IEEE Global Engineering Education Conference (EDUCON). Proceedings 2024 Towards a Visual Perception-Based Analysis of Clustering Quality Metrics in 2024 IEEE Visualization in Data Science (VDS) 2024 A Visual Analytics Conceptual Framework for Explorable and Steerable Partial Dependence Analysis in IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS 2023 State of the Art of Visual Analytics for eXplainable Deep Learning in COMPUTER GRAPHICS FORUM 2023 CryptoComparator: A Visual Analytics Environment for Cryptocurrencies Analysis in COMPUTERS & GRAPHICS 2022 Steering-by-example for Progressive Visual Analytics in ACM TRANSACTIONS ON INTELLIGENT SYSTEMS AND TECHNOLOGY 2022 BUCEPHALUS: a BUsiness CEntric cybersecurity Platform for proActive anaLysis Using visual analyticS in 2021 IEEE Symposium on Visualization for Cyber Security (VizSec) 2021 Last 50 publications © Università degli Studi di Roma \"La Sapienza\" - Piazzale Aldo Moro 5, 00185 Roma",
  "content_length": 4376,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:11"
}