{
  "name": "Giuseppe Ateniese",
  "homepage": "https://ateniese.github.io",
  "status": "success",
  "content": "Giuseppe Ateniese Giuseppe Ateniese Position Eminent Scholar/Professor Department of Computer Science Department of Cyber Security Engineering George Mason University Office: Research Hall 339 Phone: +1 (703) 993-6758 Email: ateniese@gmu.edu Short Bio Giuseppe Ateniese is a Professor, Eminent Scholar in Cybersecurity and CCI Faculty Fellow in the Department of Computer Science and the Department of Cyber Security Engineering at George Mason University. He was Farber Endowed Chair in Computer Science and Department Chair at Stevens Institute of Technology. In addition, he was with Sapienza-University of Rome (Italy), Assistant/Associate Professor at Johns Hopkins University (USA), and one of the JHU Information Security Institute founders. He was a researcher at IBM Zurich Research lab (Switzerland) and scientist at the Information Sciences Institute of the University of Southern California (USA). He also briefly worked as visiting professor at Microsoft in Redmond (USA). He received the NSF CAREER Award for his research in privacy and security, and the Google Faculty Research Award, the IBM Faculty Award, and the IEEE CISTC Technical Recognition Award for his research on cloud security. He has contributed to areas such as proxy re-cryptography, anonymous communication, two-party computation, secure storage, and provable data possession. He is currently working on privacy-preserving machine learning and decentralized secure computing based on the blockchain technology. GMU Computer Science Stats! Mason welcomes new Eminent Scholar in Cybersecurity AMiner's A-10 \"Most Influential Security and Privacy Scholars\" Stevens Department Chair Farber Endowed Chair, Investiture ceremony Education PhD in Computer Science, University of Genoa (Italy), 2000 Laurea (M.Sc.) in Computer Science, University of Salerno (Italy), 1995 Master of Engineering (Honoris Causa), Stevens Institute of Technology (USA), 2020 Mentors: Gene Tsudik (PhD advisor) and Alfredo De Santis (M.Sc. advisor) Teaching CS499: Blockchains and Cryptofinance CYSE/ECE 476: Cryptography Fundamentals CS695: Blockchains and Cryptofinance (Graduate) CS487/587: Introduction to Cryptography CS583: Analysis of Algorithms Research Cloud Security, Cybersecurity, and Applied Cryptography Papers: Google Scholar DBLP News Blockchain Blockchain Just Got Much More Powerful (Stevens) Accenture Launches A Way To Edit Blockchains (Forbes) A blockchain you can edit? (Banking Exchange) Accenture to unveil blockchain editing technique (Financial Times) Accenture breaks blockchain taboo with editing system (Reuters) Inside the latest blockchain battle (Video) Available in: German, French (Le Monde), Italian Downside of Bitcoin: A Ledger That Can't Be Corrected (NYT) Is an Editable Blockchain the Future of Finance? (MIT Tech Review) Accenture announces creation of an editable blockchain (TechRepublic) Accenture Debuts Prototype of 'Editable' Blockchain (Accenture) New blockchain services expected to entice CIOs AI and Security AI Could Make Cyberattacks More Dangerous, Harder to Detect (Wall Street Journal) Machine Learning vs. Machine Learning (ACM) Why You Should Worry About This New AI-Powered Cyberattack (Stevens) Artificial intelligence just made guessing your password a whole lot easier (ScienceMag) Powerful Password Crackers May Be Closer Than You Think (Stevens) AI slurps, learns millions of passwords to work out which ones you may use next (The Register) A Pair of AIs Have Become Very Good at Guessing Your Passwords (MIT Technology Review) Deep-Learning PassGAN Tool Improves Password Guessing (Threatpost) PassGAN: Cracking Passwords With Generative Adversarial Networks (SecurityIntelligence - IBM) PassGAN: Password Cracking Using Machine Learning (DarkReading) Researchers Show How A.I. Is the End of Passwords as We Know Them (Inverse) Artificial Intelligence, Slayer Of Passwords (Sensormag) How machine learning-powered password guessing impacts security (TechTarget) Coverage on LastPass and Dashlane (blogs) Selected as the \"Coolest Hack of 2017\" by DarkReading Cloud Security Top 10 Ways to Secure Big Data (MeriTalk) The Cloud and Mobile Revolution: What's Next? (Fox Business) GPG/PGP Key Download Public Key",
  "content_length": 4224,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:06"
}