{
  "name": "Giuseppe Caire",
  "homepage": "https://www.commit.tu-berlin.de/menue/mitarbeiter/fachgebietsleiter",
  "status": "success",
  "content": "Theoretische Grundlagen der Kommunikationstechnik - TU Berlin Das Fachgebiet Theoretische Grundlagen der Kommunikationstechnik (CommIT) hat eine langjährige Geschichte an der TU Berlin. Im April 2014 erhielt Prof. Giuseppe Caire die Alexander von Humboldt Professur und leitet seitdem das Fachgebiet. CommIT konzentriert sich auf die Grundlagenforschung sowie auf die angewandte Forschung der Kommunikationstheorie, Informationstheorie, Signalverarbeitung und Netzwerke. Ein besonderer Schwerpunkt liegt hierbei auf dem Bereich der drahtlosen Kommunikationssysteme. Studenten der Bachelor- und Masterstudiengänge (B.Sc./M.Sc.), die sich auf diese Gebiete spezialisieren wollen, können für weitere Informationen gerne unsere Mitarbeiter kontaktieren. Mögliche Projekte für Ihre Masterarbeit (M.Sc.) finden sie hier. Falls Sie an einer Tätigkeit in unserem Fachgebiet interessiert sind, finden sie hier mögliche Stellenangebote.Für mehr Informationen über die Wissenschaftsfelder des Fachgebietes Theoretische Grundlagen der Kommunikationstechnik (CommIT), klicken Sie bitte in das Menü links auf den Bereich Forschung und auf die Webseiten der IEEE Information Theory Society, IEEE Communications Society, und IEEE Signal Processing Society. 21.07.2025 Vortrag von Dr. Yue Bi mit dem Titel: \"Partially Connected Networks: Limits, Algorithms, and Applications in Wireless Distributed Computing\"Am 24. Juli 2025, einen Vortrag mit dem Titel \"Partially Connected Networks: Limits, Algorithms, and Applications in Wireless Distributed Computing\" wird gehalten von Dr. Yue Bi. Mehr Info mehr erfahren 16.06.2025 2025 IEEE Communications Society & Information Theory Society Joint Paper AwardProfessor Caire und seine Mitautoren haben den 2025 IEEE Communications Society & Information Theory Society Joint Paper Award für ihre Veröffentlichung „On the Fundamental Tradeoff of Integrated Sensing and Communications Under Gaussian Channels“, erschienen in den IEEE Transactions on Information Theory, Band 69, Nr. 9, Seiten 5723–5751,… mehr erfahren 02.05.2025 Gemeinsamer Workshop von TUB und Huawei zur Kommunikationstechnologie - 2025CommIT wird am May 10, 2025 einen von Huawei gesponserten Workshop über Kommunikationstechnologie mit dem Titel \"6G Wireless Technologies Workshop: Advancing MIMO and AI Integration\" veranstalten.Weitere Informationen finden Sie auf der Workshop-Webseite. mehr erfahren 03.04.2025 Master Thesis Proposal \"Synchronization for Modulation on Conjugate-Reciprocal Zeros (MOCZ) in Short-Packet Wireless Communication\"Für weitere Informationen besuchen Sie unsere Seite Master- und Bachelorarbeit. mehr erfahren 22.11.2024 „Massive Beams“, ein junges Start-up, will die Schlüsseltechnologie für den Mobilfunkstandard 6G entwickelnFür weitere Informationen klicken Sie bitte auf die folgenden Links.TUB AktuellesTegesspiegel mehr erfahren 25.04.2024 Gemeinsamer Workshop von TUB und Huawei zur KommunikationstechnologieCommIT wird am May 6, 2024 einen von Huawei gesponserten Workshop über Kommunikationstechnologie mit dem Titel \"Integrated Sensing and Communications: Information theory, signal processing, and applications\" veranstalten.Weitere Informationen finden Sie auf der Workshop-Webseite. mehr erfahren 17.11.2023 2023 Comsoc CTTC-Auszeichnung für technische ErrungenschaftenIm Namen des Preiskomitees wurde Professor Giuseppe Caire als Gewinner des Preises 2023 IEEE Communications Society Communication Theory Technical Committee (CTTC) Technical Achievement Award ausgewählt. mehr erfahren 10.07.2023 Vortrag von Professor Meir Feder von der Universität Tel-AvivWir freuen uns, am kommenden Mittwoch, den 12. Juli 2023, einen Vortrag von Prof. Meir Feder von der Universität Tel-Aviv in unserem Seminarraum HFT 617 präsentieren zu können.Zeit: Mi., 12. Juli 2023, 11:00 Uhr Ort: HFT-Gebäude, Raum HFT-TA 617, Einsteinufer 25, 10587 BerlinTitel: Multiple und Hierarchische Universalität mehr erfahren © Felix NoakForschung© CommITMitglieder© Philipp ArnoldtLehre© Philipp ArnoldtSeminare und Vorträge Ich bin damit einverstanden, dass mir Inhalte von OpenStreetMap angezeigt werden. Ihr Einrichtungsname Ihrmailname(at)tu-berlin.de +49 30 314-00000 +49 30 314-00000 Sekretariat Stellenzeichen Gebäude Hauptgebäude Raum H 0815 Adresse Technische Universität Berlin, Straße des 17. Juni 135 10623 Berlin Mo 9:00-12:00 Di 8:00-11:00 Link",
  "content_length": 4369,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:11"
}