{
  "name": "Giuseppe Polese",
  "homepage": "http://docenti.unisa.it/004281/en/curriculum",
  "status": "success",
  "content": "Giuseppe POLESE | Curriculumskip to main content SHARE Professors POLESE Giuseppe Curriculum Giuseppe POLESE | CurriculumGiuseppe POLESE CurriculumGiuseppe Polese is Full Professor in the Department of Informatica (Computer Science) at the University of Salerno, Italy. He received the Laurea degree cum laude in Computer Science from the University of Salerno (Italy), in 1989, the Master Degree in Computer Science from the University of Pittsburgh (USA), in 1994, and the Ph.D. in Applied Mathematics and Computer Science from the Consortium of Universities Naples (Federico II), Salerno and Catania, in 1998. From 1988 to 1991 He has worked for the italian airspace company Alenia, where he has first developed his laurea thesis in software engineering, and successively, he has worked on Artificial Intelligence projects concerning the enterprise strategic planning problem, and on the introduction of C.A.S.E. tools in the software development processes of the company. In 1991 he has been awarded from the University of Salerno with a two year fellowship for studying abroad, in the context of which he has been visiting scholar in the \"Center for Parallel and Distributed Systems\" of the Computer Science Department at University of Pittsburgh, where he has also been graduate student for the period 1991-1995, during which he has been Teaching Assistant and Graduate Research Assistant working on NSF grants and on projects funded by companies like United Switch & Signals and Semantic Compaction Systems. In 1998 he has been Adjunct Professor in the Faculty of Economics at University of Sannio, after which he has been awarded with a 1 year fellowship from the Italian National Research Council (CNR), and successively, with a 1 year Postdoc fellowship from the University of Salerno, Department of Matematica e Informatica (Mathematics and Informatics). From 1999 to 2005 he has been Research Assistant in the Faculty of Science at the University of Salerno. From the year 2005 to 2021 he has been Associate Professor, starting in the Dipartimento di Matematica e Informatica (Mathematics and Informatics Department), then in the Dipartimento di Studi e Ricerche Aziendali (Enterprise Studies and Researches Department), and currently in the Dipartimento di Informatica (Computer Science Department), awarded for two consecutive times from the Italian Ministery of Education and Research (MIUR) as Department of Excelence, where he is Full Professor from 2021. He is Director of the \"Data Science & Technologies\" Lab, and is Coordinator of the Track \"Data Science & Machine Learning\" of the Laurea Magistrale in Informatica (Master Degree in Computer Science). Research interests of prof. Polese are in Data Science, Machine Learning, Web Engineering, and Visual Languages, in which he has published over 90 articles in international journals, books, and conference proceedings. prof. Polese has directed several research projects in cooperation with industry (such as Ericson, Olivetti, Siemens, and Telecom Italia), and research centers, also acting as instructor for courses on advanced programming techniques, databases, and operating systems. He is also member of CeRICT, the Regional Competence Center on Information and Communication Technologies, a research consortium of local Universities and Research Centers, aiming to integrate local ICT competences, in order to foster the technologic transfer from research to industry. He also acts as Techical Officer on behalf of the Italian Ministery of Education and Research (MIUR), for reviewing industrial research projects funded on MIUR's grants. prof. Polese is member of IEEE and ACM. Moreover, he is member of the Editorial Board of several international journals, as Information Systems (Elsevier), Data and Information Quality (ACM), Data Science and Engineering (Springer), International Journal of Software and Knowledge Engineering (World Scientific), for which he also is Area Editor for Decision Support Systems. Moreover, he has been Program Committee member for several international conferences. He has been visiting professor in the Computer Science Division at the University of Berkeley, the Computer Science Department at the University of Pittsburgh, and at the Institute of Computational Science at the Università della Svizzera Italiana (University of the Italian Switzerland). He has been invited for a talk at the Odissey Research Associates in Ithaca (USA), an invited talk in a joint plenary session between the 2017 \"Software Engineering and Knowledge Engineering\" and the \"Distributed Multimedia Systems\" conferences, and a lecture in the Hasso Plattner Institute at the University of Potsdam, Germany. He has achieved two national qualifications as full professor, one in Computer Science, and one in Computer Engineering. Professors Home Curriculum Teaching Research Projects Publications Laboratories Resources University of Salerno - Via Giovanni Paolo II, 132 - 84084 Fisciano (SA)P.IVA 00851300657 - C.F. 80018670655-‹›××-PrecedenteSuccessivaVai al Contenuto della PaginaVai al Menu Principale di NavigazioneVai al Menu Secondario di NavigazioneTorna alla Pagina PrecedenteStampa la Pagina",
  "content_length": 5191,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:11"
}