{
  "name": "Glen Chou",
  "homepage": "https://glenchou.github.io",
  "status": "success",
  "content": "Glen Chou Assistant Professor Georgia Institute of Technology Office: CODA E0962B Email: chou [at] gatech [dot] edu CV  | Scholar  | ResearchGate News: I am actively recruiting PhD students to join our lab in Fall 2025. The application deadlines range from December 2, 2024 to December 16, 2024 - please check out the recruitment flyer for more details. Interested GT UG and MS students are also encouraged to reach out. Please see the lab website for more details. Oct. 22, 2024. I am joining Georgia Tech as an assistant professor in Nov. 2024. More I am an assistant professor at Georgia Tech in the College of Computing, within the School of Cybersecurity & Privacy (SCP), and in the College of Engineering, within the School of Aerospace Engineering (AE). I also hold a secondary appointment in the School of Electrical and Computer Engineering (ECE), and I am on the faculty of the Institute for Robotics and Intelligent Machines (IRIM) and Machine Learning Center. I direct the Trustworthy Robotics Lab, where we design algorithms that can enable general-purpose robots and autonomous systems to operate capably, safely, and securely with humans, while remaining resilient to real-world failures and uncertainty. To achieve this, we leverage control and machine learning, while connecting to optimization, perception, formal methods, planning, human-robot interaction, and statistics. I believe strongly in validating that the theoretical guarantees of my algorithms translate to the real world when deployed on hardware. I'm interested in a broad range of applications, including robotic manipulation, vision-based navigation, aerospace autonomy, and the control of large-scale cyber-physical systems. Check out this page for an overview of my work. About me: I was born and raised in Northern California. After earning dual B.S. degrees in EECS and ME from UC Berkeley in 2017, I left the eternal summer behind to receive an M.S. and Ph.D. in ECE from the University of Michigan in 2019 and 2022, respectively. Prior to joining Georgia Tech in 2024, I spent two years as a postdoc at MIT CSAIL. I am a recipient of the National Defense Science and Engineering Graduate (NDSEG) fellowship and the NSF Graduate Research Fellowship, and was named a Robotics: Science and Systems (R:SS) Pioneer in 2022. Formally-Verified Model-Based Control Synthesis Trustworthy Learning-Based Planning and Control Safe and Robust Human-Robot Interaction",
  "content_length": 2444,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:11"
}