{
  "name": "Gokila Dorai",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=GDORAI",
  "status": "success",
  "content": "Gokila Dorai - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback Gokila Dorai Assistant Professor Gokila Dorai Assistant Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber SciencesAdministrationDepartment of The Graduate School BioAssistant Professor in the School of Computer and Cyber Sciences at Augusta University. Dr. Dorai received a Ph.D. degree in Computer Science from Florida State University. Her research topics are digital forensics for mobile and IoT devices using targeted data extraction, machine learning techniques and AI. GDORAI@augusta.edu (706) 729-2379 RV 2801 Personal Website General Credentials Instruction Scholarship Service Education Ph.D., Computer Science Florida State University, 2019 MS, Computer Science Florida State University, 2016 BE, Computer Science. Anna University, 2007 Awards & Honors Featured Alumni, Florida State University - Alumni Spotlight. Florida State University, 2025 Distinguished Service Award Augusta University, School of Computer & Cyber Sciences, 2024 AURI Emerging Scientist Award for the year 2022 Augusta University, 2022 Golden Pen Award 2021 Augusta University, 2021 Recognized by the Center for Advancement of Teaching Florida State University, 2019 Courses Taught Most Recent Academic Year CYBR 4400 Digital Forensics CSCI 8940 Dissertation Research CSCI 4540 Digital Forensics and ML CSCI 6540 Digital Forensics and ML Scholarship Selected Recent Publications FIRE: Fog-Based Intrusion Detection Framework for Real-Time Security in IoT Environments, 2025 Conference Proceeding Mapping the Research Landscape - An Exploratory Analysis of AI Applications in Digital Forensics, 2025 Conference Proceeding Secure Cross-Chain Provenance for Digital Forensics Collaboration, 2024 Conference Proceeding From seaweed to security: harnessing alginate to challenge iot fingerprint authentication, 2024 Conference Proceeding ForensiBlock: A Provenance-Driven Blockchain Framework for Data Forensics and Auditability, 2023 Conference Proceeding Research Interests Dr. Dorai’s areas of research are digital/mobile/IoT forensics. She has been working on developing a targeted data extraction model aimed at faster and efficient evidence retrieval using machine learning and computer vision. She is also interested in developing software prototypes to aid criminal investigations in support of law enforcement and other practitioners.Research Awards and Grants:1. Received the NSA’s Cybersecurity Research Innovation Grant for the project titled \"Cyber Attack Detection Using Metadata Analysis and Edge-Based Real-Time Machine Learning on Sensor Data\".Additional details: Dr. Gokila Dorai is the PI and Dr. Gagan Agrawal is the Co-PI on the $494,999.51 award from the National Security Agency. The award is made within the NSA’s Cybersecurity Research Innovation program for institutions that are designated as National Centers of Academic Excellence (NCAE).2. Received the NSF's Research Grant Award for the project titled \"A Socio-Technical Framework for Handling Digital Evidence with Security and Privacy Assurance\".Additional details: Dr. Gokila Dorai is the PI and Drs. Hoda Maleki and Gagan Agrawal are Co-PIs on the new $569,500.00 award. The award is made possible through the National Science Foundation’s Designing Accountable Software Systems (DASS) program. The project includes a social sciences component on which the PIs are collaborating with Dr. Thomas Kadri, the University of Georgia School of Law faculty. Dr. Kadri will be funded $180,000.00 award by NSF separately. Department Service Director for Access, Success & Belonging 2023 - Present Role: Other Lightning Talk Series Organizing Committee member 2021 - 2024 Role: Committee Member Distinguished Speaker Series Host 2021 - 2023 Role: Committee Member Upsilon Pi Epsilon AU Chapter Co-advisor at Dept. of Computer & Cyber Sciences 2021 - 2023 Role: Faculty Mentor CSRankings.org Augusta University (AU) faculty listing 2021 - 2023 Role: Committee Member University Service Faculty Advisory Committee, Center for Undergraduate Research and Scholarship (CURS), Augusta University. 2024 - 2025 Role: Committee Member Leadership Council, Serving on the Community Engagement Leadership Council (CELC), Augusta University 2023 - 2025 Role: Committee Member Lead Faculty Founder & Advisor, Computer & Cyber Graduate Student Organization (CCGSO), School of Computer & Cyber Sciences, Augusta University. 2023 - 2025 Role: Faculty Advisor CERTS 2022 - Student Poster Presentations 2022 - 2022 Role: Faculty Advisor CURS Annual Student Research - Poster Presentation 2021 - 2021 Role: Faculty Mentor Professional Service DFRWS Conference - Demo & Poster Chair 2024 - 2026 Role: Program Organizer Forensic Science International: Digital Investigations 2021 - 2023 Role: Reviewer, Journal Article ADFSL Conference on Digital Forensics, Security and Law 2022 - 2022 Role: Committee Member Microservices 2022 Conference, Paris 2022 - 2022 Role: Task Force Chair",
  "content_length": 5138,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:17"
}