{
  "name": "Golnoush Abaei",
  "homepage": "https://www.rmit.edu.au/contact/staff-contacts/academic-staff/a/abaei-dr-golnoush",
  "status": "success",
  "content": "Golnoush Abaei - RMIT University Golnoush Abaei SKIP TO CONTENT Search field Search Search RMIT Australia RMIT Europe RMIT Global RMIT Vietnam RMIT UP RMIT Online Students Alumni Staff Library RMIT Online Courses Courses by study area Undergraduate courses Postgraduate courses Vocational studies Pre-university studies Online courses and degrees Entry pathways Single courses Short courses and microcredentials Courses for international students Contact Study@RMIT Study with us How to apply Fees Scholarships School leaver information Student services Student experience Key dates Frequently asked questions Parents Career advisers Contact Study@RMIT Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Contact Study@RMIT About News Events Maps Careers Contact us Our strategy Governance & management Schools & colleges Respect for Australian Indigenous cultures Our locations and facilities Our heritage Regenerative Futures Research Our research Partnerships Impact Contact Centres and collaborations Research degrees Find researchers Partner Recruit students and graduates Workforce development Collaborate with RMIT Research partnerships Facilities, equipment and services Contact Industry Engagement Giving to RMIT International Study in Australia Apply to RMIT as an international student Courses for international students Contact Study@RMIT Fees and scholarships for international students International student services Key dates and intake information for international students Frequently asked questions Golnoush Abaei Dr. Golnoush Abaei Lecturer, Industry Practice See full profile Details College: School of Computing Technologies Department: School of Computing Technologies Campus: City Campus Australia golnoush.abaei@rmit.edu.au ORCID: 0000-0002-8916-759X Open to Masters Research or PhD student supervision Industry Projects Collaborative projects About I am an experienced data specialist with expertise in designing models and developing solutions. In the IT industry, I worked as a software engineer and computer science specialist for many years and acquired a lot of knowledge. I have integrated my expertise in Industry with my academic profession to be able to find solutions for real-world applications. My research comprised of experiences in Software Engineering, Machine Learning, Artificial Intelligence, and Data Analytics. My expertise expands to Software Quality, Correction of INS/GPS Navigation systems, Health-Related Recognition applications, and Blockchain…. I have also worked as a curriculum designer to employ the best practice utilizing various methodologies such as Problem-Based Learning (PBL), Active Learning, and Collaborative Active Learning (CAL). I strongly believe in learning and sharing my knowledge with my colleagues. Through years of experience, I have developed excellent communication, problem-solving, and organizational skills, along with good published papers. Expand for full bio Collapse bio Research fields 4612 Software engineering 461208 Software testing, verification and validation 4602 Artificial intelligence 4611 Machine learning 460306 Image processing Academic positions Program Manager - Bachelor of Software Engineering RMIT University School of Computing Technologies Melbourne, Australia 2 Oct 2023 – Present Professional Practice Lead RMIT University School of Computing Technologies Melbourne, Australia 28 Nov 2022 – Present Supervisor projects Resilient Privacy Infrastructure for Enterprise Security 13 Oct 2025 Automated Software Testing Using LLMs 23 Jul 2025 Machine Learning for Testing: Detecting Visual Defects in Software User Interface 6 Dec 2024 ENHANCING SOFTWARE ENGINEERING AND INFORMATION TECHNOLOGY EDUCATION WITH AI-POWERED DIGITAL LECTURER TWIN: A NOVEL APPROACH USING LARGE LANGUAGE MODELS 28 Nov 2024 Behavior Driven Development(BDD) Test Automation with Large Language Models(LLM) 14 Aug 2024 Teaching interests - Assist Software Engineering students in finding internships or graduate jobs for their 3rd-year internship course. - Coordinate and supervise capstone projects for SE undergrads and IT postgraduates sourced from international and local industries. - Software Testing Course Coordinator Research interests My research comprised of experiences in Software Engineering, Machine Learning, Artificial Intelligence, and Data Analytics. My expertise expands to Software Quality, Correction of INS/GPS Navigation systems, Health-Related Recognition applications, and Blockchain…. Acknowledgement of Country RMIT University acknowledges the people of the Woi wurrung and Boon wurrung language groups of the eastern Kulin Nation on whose unceded lands we conduct the business of the University. RMIT University respectfully acknowledges their Ancestors and Elders, past and present. RMIT also acknowledges the Traditional Custodians and their Ancestors of the lands and waters across Australia where we conduct our business - Artwork 'Sentient' by Hollie Johnson, Gunaikurnai and Monero Ngarigo. More information News Events Library Maps Careers Contacts Study with Us Levels of study Online courses and degrees Single courses Applying to RMIT International students Parents Careers advisers Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Research Our research Centres and collaborations Partnerships Research degrees Find researchers Research contacts Partner Workforce development Staff development and training Research partnerships Facilities and equipment services Giving About Our strategy Governance and management Values Sustainability Schools and colleges Our locations and facilities Copyright © 2025 RMIT University | Terms | Privacy | Accessibility | Website feedback | Complaints | ABN 49 781 030 034 | CRICOS provider number: 00122A | TEQSA provider number: PRV12145 | RTO Code: 3046 | Open Universities Australia | RMIT Training Pty Ltd, trading as RMIT University Pathways (RMIT UP), CRICOS Provider Code: 01912G",
  "content_length": 6049,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:18"
}