{
  "name": "Golnaz Habibi",
  "homepage": "https://www.ou.edu/coe/cs/people/faculty/golnaz-habibi",
  "status": "success",
  "content": "Golnaz Habibi OU Homepage Search OU The University of Oklahoma Skip Navigation Golnaz Habibi Golnaz Habibi Assistant Professor Email: golnaz@ou.edu Office: Devon Energy Hall Room 210-F Website: https://airou.cs.ou.edu/ Education Ph.D., Computer Science Rice University M.S., Electrical and Control Engineering Tarbiat Modares University, Tehran B.S., Electrical and Control Engineering Tarbiat Modares University, Tehran Research Focus Robotics, autonomous driving, computer vision, multi-agent systems,  machine learning,  reinforcement learning, autonomous control and navigation systems Experience and Awards Assistant Professor, University of Oklahoma Research Scientist, Massachusetts Institute of Technology Biography Golnaz Habibi is an assistant professor in the School of Computer Science at the University of Oklahoma. Previously, she was a research scientist with the Department of Aeronautics and Astronautics at MIT and she was a member of the Laboratory for Information and Decision Systems (LIDS). Golnaz holds MS and BS degrees in electrical and control engineering and she received her PhD in computer science from Rice University. Golnaz is broadly interested in robotics, control systems, machine learning, and multi-agent systems. Her current research focuses on visual navigation, autonomous driving and computer vision, reliable communication, and safe and reliable autonomous agents. Her paper has been nominated for best student paper award in DARS 2012 and she received the K2I Fellowship award from Chevron Company in 2013. Golnaz has served on the program committee of AAAI and the reviewer of several journals and conferences such as RSS, ICRA, IROS, RA-L, and Journal of Aerospace. School of Computer Science Devon Energy Hall 110 W. Boyd St. Norman, OK 73019 Phone: (405) 325-4042 Accessibility Sustainability HIPAA OU Job Search Policies Legal Notices Copyright Resources and Offices OU Report It! Updated 12/19/2024 by School of Computer Science: cs@ou.edu",
  "content_length": 1988,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:18"
}