{
  "name": "Gonzalo Valdes",
  "homepage": "https://www.ing.uc.cl/academicos-e-investigadores/gonzalo-valdes-ulloa",
  "status": "success",
  "content": "GONZALO VALDÉS ULLOA | Ingeniería UC Inicio Nuestra Escuela Sobre Ingeniería UC Internacionalización Retribuye Proyecto Ingeniería 2030 Código de Honor Consejo Asesor Autoridades y equipos Programas de Estudio Admisión Pregrado Postgrado Educación Profesional Acreditaciones Académicos e Investigación Académicos Ingeniería UC Publicaciones Investigación en pregrado Proyectos de investigación Concursos postdoctorales Libro de Investigación Divulgación Científica y Tecnológica Innovación y Emprendimiento Ecosistema de emprendimiento Formación académica Programas extracurriculares Emprendimiento Social Apoyo al emprendimiento Alumnos emprendedores Vida Universitaria Deporte Cultura Centro de Alumnos de Ingeniería Proyectos de Alumnos Mujeres Ingeniería UC Cuerpo de Tutores Pastoral Vinculación con el Medio Transferencia Alumni Ingeniería UC Preingeniería Atracción y desarrollo de talento Plataforma de Colocaciones Responsabilidad Social Oficina de Vinculación con la Industria Contacto Departamentos y áreas académicas SIDING English Home » Académicos e Investigadores » GONZALO VALDÉS ULLOA Académicos Ingeniería UC GONZALO VALDÉS Profesor Asistente Especialidad: Transformación digital, Innovación, Gestión TI, Estudios Organizacionales Departamento de Ciencia de la Computación, Departamento de Ingeniería Industrial y de Sistemas gvaldesu@uc.cl +562 2354 4439 Líneas de Investigación Publicaciones Biografía Educación Premios y Distinciones Líneas de Investigación Transformación digital, Innovación, Organizaciones, Género y Tecnología Publicaciones Pertuze J., Valdes G., Reyes T. (2025) Looking back to move forward: social benchmarks and historical performance in CEO turnover Review of Managerial Science Pertuze J., Valdes G., Reyes T. (2025) Looking back to move forward: social benchmarks and historical performance in CEO turnover (May, 10.1007/s11846-025-00897-8, 2025) Review of Managerial Science Valdés G., Thomason B., Bentancor A., Jeria I., Troncoso C. (2022) Technology, Gender and Organizations: A Systematic Mapping Study IEEE Access Valdés, G., Astorga, J., Fuentes-Solís, R.Alonso Dos Santos, M. (2021). \"Barriers to innovation and willingness to innovate in the food sector: the case of Chile\", British Food Journal. Vol. 123 No. 10, pp. 3344-3357. (2021) Barriers to Innovation and Willingness to Innovate in the Food Sector: The Case of Chile British Food Journal 123 10 3344-3357 Biografía Gonzalo Valdés is an Assistant Professor at Pontificia Universidad Católica de Chile in the School of Engineering, where he holds appointments in the Department of Computer Science and the Department of Industrial and Systems Engineering. Gonzalo holds a PhD in Management Science and Engineering from Stanford University. During his doctoral training he was affiliated to Stanford’s Center for Work, Technology and Organization. Gonzalo’s research interests are at the intersection of organizations and technology, where he studies subjects such as digital transformation, innovation, and gender. Educación Ph.D. in Management Science and Engineering, Stanford UniversityMaster of Arts in Sociology, Stanford UniversityMagíster en Ciencias de la Computación, Universidad Técnica Federico Santa MaríaIngeniero Civil en Informática, Universidad Técnica Federico Santa María Premios y Distinciones – Fondecyt Research Grant, ID: 11221329, «Motivations for Innovation in Chilean Organizations» – Becas Chile and Fulbright Scholarships, granted to pursue doctoral studies in the US. CONÉCTATE CON INGENIERÍA UC Contáctate con nosotros Información sobre las distintas áreas de Ingeniería UC. Contáctanos Postula a Ingeniería UC Conoce la información relevante para postular a la carrera. Postula Concursos de Postdoctorado Descubre las ofertas de postdoctorado Postula Mapa Campus San Joaquín Retribuye a Ingeniería UC Trabaja con nosotros Error: Formulario de contacto no encontrado. Email Todo Noticias Contenido Institucional",
  "content_length": 3952,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:21"
}