{
  "name": "Gopal Gupta 0001",
  "homepage": "http://www.utdallas.edu/~gupta",
  "status": "success",
  "content": "Gopal Gupta's Home Page Gopal Gupta Professor, Department of Computer Science, University of Texas at Dallas Co-director, Center for Applied AI and Machine Learning, Contact Information: Email: gupta AT utdallas DOT edu (best way to contact me) Tel: (972) 883 4107 Fax: (972) 883 2399 Office: ECSS 3.803 (CS Bldg)    (DIRECTIONS) [Future/Recent Events] [Research Interests] [Education] [Projects] [Service][Current/Past Students] [Courses] [Miscellaneous] New: Modeling Deontic Modal Logic with s(CASP): Representing norms as constraints resolves long-standing paradoxes of deontic logic Recent: Computational Thinking with Logic Programming: ICLP24 PEG 2.0 Workshop Paper Recent: Recent work that appeared in ICLP'24 Early Validation of High-level System Requirements with Event Calculus and ASP A Reliable Common-Sense Reasoning Socialbot Built Using LLMs and Goal-Directed ASP Automating Semantic Analysis of System Assurance Cases using Goal-directed ASP A Neurosymbolic Framework for Bias Correction in Convolutional Neural Networks Recent: ICLP'24 The 40th Int'l Conf. on Logic Programming was held in Dallas in Oct'24 Recent: LPNMR'24 The 17th Int'l Conf. on Logic Programming and Non-Monotonic Reasoning was held in Dallas in Oct'24 News: The s(CASP) system is now available from within SWI-Prolog. Try it out through the SWI-Prolog Online Interface. Also available through Ciao playground. News: ICLP'23 Invited Talk Slides click here News: LLMs + s(CASP) == domain-specific reliable chatbots that can \"understand\" humans and interactively talk: paper  code News: Tutorial paper on automating commonsense reasoning: click here News: Paper on NeSyFOLD System, for symbolically explaining output of CNNs click here News: Paper on FOLD-SE, a scalable explainable AI system: click here (FOLD-SE needs no dataset prep, is order of magnitude faster than XGBoost et al, is explainable/interpretable, and produces small no. of rules even for very large datasets). FOLD-SE is now available as a web service News: Prolog celebrates its 50th birthday in 2022: More details here. The Prolog Heritage Association and ALP have instituted the Alain Colmeraruer Prize. Checkout my logic programming course to high-school students to celebrate; Here are two position papers that my group wrote for the 50 year celebration: Prolog: The Next 50 Years and Logic-based Explainable and Incremental Machine Learning News: Team of PhD students Kinjal Basu, Sarat Varanasi, Fang Li, and Huaduo Wang selected for Amazon Alexa Socialbot Grand Challenge 4. read the news release News: Recent News Releases: (i) AI for Electricity Markets; (ii) Using Drones for Warehouse Inventory; (iii) City of Richardson -- Innovation Quarters News: Preprint of paper at AAAI 2021: Knowledge-driven Natural Language Understanding of English Text and its Applications. News: Current funded projects: (i) CLARISSA (DARPA through Honeywell); (ii) Explainable AI (NSF); (iii) Automated HF Diagnosis (NSF); and, (iv) Goal-directed ASP (NSF) (v) Applications of Explainable AI (Atos Corp) News: Recent papers on explainable AI, inductive learning of default theories, abductive inference, and ASP-based natural language question answering News: The paper on Coinductive Logic Programming in ICLP 2006 by Simon, Mallya, Bansal and Gupta earns ICLP 2016 10 years Test-of-Time award Software: FOLD-R++: An Explainable AI system for learning default rules directly from data for binary classification. Paper describing the system. Software: FOLD-RM: An Explainable AI system for learning default rules directly from data for multi-category classification. Paper describing the system. Software: SHAP-FOLD: An Explainable AI system for discovering the logic from models learned using statistical methods (includes source-code/documentation; re-implemented in Python) Software: The s(CASP) System: The s(ASP) system re-engineered to include constraints. Paper describing the system. Software: The s(ASP) System: A predicate answer set programming system (includes source code and documentation.); Paper describing the system. Software: GALLIWASP: A goal-directed system for answer set programming (includes source code and documentation.) Software: Metainterpreter supporting tabling (DRA) and coinduction with applications to LTL model checking Paper on uniform proof-theoretic treatment of various semantics of negation (the basis of s(ASP)/s(CASP)): click here Tutorial intro to ASP and summary of s(ASP): click here A paper describing the s(ASP) system, plus a position paper appeared in ARCADE 2017, a CADE 2017 workshop. A Degree Audit System: First Real Application of s(ASP) (includes source code and documentation.) UTD CS, Math and MechE majors, try an audit now: click here High School Cell Biology: Represented as an answer set program (runs on the s(ASP) system.) A medical application of s(ASP): A Physician Advisory System for CHF (appears in Proc. ICLP 2016); automates the guidelines published here using the s(ASP) system. HackAR: A hackathon around automated reasoning with s(ASP) was organized by the UT Dallas AI Society in Nov 2016. See the 18 projects that were undertaken. HackReason: An autoamted reasonign with s(CASP) hackathon was organized by the UT Dallas AI Society on Jan 17-18, 2025 (on occassion of World Logic Day). HackReason 2025 details are here and the projects here. HackReason 2022 details are here and the projects here. HackReason 2021 details are here and the projects here. XAI Hackathon: FOLD-R++ and FOLD-RM are great XAI tools. A hackathon was organized around them. See the efforts here. Videos of Talks Talk on Artificial General Intelligence, given to Society on Stat. Computing: click here (slides are here) Talk given at Microsoft Research, Bangalore, on Automating Commonsense Reasoning: click here General talk on AI: Artifical Intelligence: The Road Forward: click here Tutorial on common sense reasoning with ASP: click here Talk given at Microsoft Research, Redmond, WA, on Logic, Co-induction and Infinite Computation: click here Laboratory: Applied Logic Programming-Languages and Systems (ALPS) Lab  (you can see the old lab page here) Company: Founded (2008) Interoperate, Inc. (funded by the Texas Emerging Technology Fund)   (see recent UTD press release) Other Activities: the E-plan system, the QOLT Lab, and the CHAMPS Project (see CHAMPS press release) Past Work: (See a summary of my group's research contributions here) G. Gupta, et al. Logic, Coinduction, and Infinite Computation. Slides from CALCO'11 invited talk. N. Saeedloei, G. Gupta. Coinductive Constraint Logic Programming. K. Marple, A. Bansal, R. Min, G. Gupta. Goal-directed Execution of Answer Set Programs. K. Marple, G. Gupta. GALLIWASP: A Goal-directed Answer Set Solver. A. Karshmer, G. Gupta, E. Pontelli. Mathematics and Accessibility: A Survey. G. Gupta. Reissuing the 5th Generation Challenge: Next Generation of LP Systems. Talk given at DAMP'06. FUTURE EVENTS: 25th Symposium on Practical Aspects of Declarative Languages (PADL). RECENT EVENTS: Workshop on Goal-directed Execution of Answer Set Programs (GDE'22; 1 day workshop), Haifa, Israel, August 1, 2022. 38th International Conference on Logic Programming (ICLP'22; part of FLoC 2022), Haifa, Israel, Aug 1-5, 2020. 24th Symposium on Practical Aspects of Declarative Languages (PADL). Enhanced Coinduction Workshop 2019 ALP Autumn School in Logic Programming, Las Cruces, NM, Sep 2019. (I gave a tutorial on co-inductive and abductive logic programming) Research Interests: Artificial Intelligence: Knowledge Representation, Common Sense Reasoning, Explainable Machine Learning. Programming Languages: Implementation, Semantics, Applications, Constraint and Logic Programming, Static Analysis. Software Engineering: Software Verification, Real-time Systems, Domain Specific Languages, Interoperability. Parallel and Distributed Processing: High Performance AI and Constraint Logic Programming Systems, Automatic Parallelization, Parallel Architectures, Applications. Human Computer Interaction: Tools for Visually Impaired; Intelligent Interfaces. Education Ph.D (Computer Science): UNC at Chapel Hill (1991) M.S. (Computer Science): UNC at Chapel Hill (1987) B.Tech. (Computer Science): Indian Institute of Technology, Kanpur, India (May 1985) From 1989 to 1991, I worked as a Research Associate in the research group of David H.D. Warren (of the Warren Abstract Machine fame, now retired) in the CS Department, University of Bristol, UK. From 01/92 to 08/00, I worked as a faculty member in the Computer Science Department at New Mexico State University. Current Projects Automated Common Sense Reasoning Explainable AI Logic-based Software Assurance Goal-directed Answer Set Programming Coinductive Logic Programming Support for my group has been provided by DARPA, NSF, NATO, EPA, DHS, Sandia National Labs, AITEC (Japan), Fullbright Foundation, etc. Software Systems developed by my research group SHAP-FOLD Explainable AI System for Relational Learning. With Shakerin. s(CASP): Predicate Constraint Answer Set Programming System. With Arias (UPM), Carro (UPM), Marple, Salazar s(ASP): Predicate Answer Set Programming System. With Marple, Salazar Galliwasp: Goal-directed Answer Set Solver. With Marple, Min, Bansal. CoLP Metainterpreter: Meta-interpreter for co-LP. With Kluzniak, Simon, Mallya, Bansal. NEXUS parser: A parser for NEXUS (NEXUS is a bioinformatics mark-up language). ExSched System: An Excel Plug-in for Knowledgesheet (see below). A spreadsheet interface for solving constraint satisfaction problems. With Tiwari, Chitnis, Yennamani. 2006. Used in the past by CS and EE departments to automatically schedule courses. VoxBoox System: A system for automatically generating interactive talking books. With Aanchal Jain Click here to see demo. DAWN System: A system that allows interactive audio/voice based aural surfing of the WWW over the phone. With Raman, Nichols, Reddy, Annamalai. Semantic Web System: Semantically map",
  "content_length": 20698,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:22"
}