{
  "name": "Goran Nenadic",
  "homepage": "http://www.manchester.ac.uk/research/gnenadic/personaldetails",
  "status": "success",
  "content": "Goran Nenadic - Research Explorer The University of Manchester Goran Nenadic Prof Professor of Computer Science, Natural Language Processing and Text Mining https://orcid.org/0000-0003-0795-5363 Personal profile BiographyGoran Nenadic is a Professor in the Department of Computer Science, University of Manchester and a Turing Fellow at the Alan Turing Institute. His research interests are focused on natural language processing, text mining and semi-automated curation of knowledge from unstructured textual data. Goran has been working in this area since 1993. Current research projects focus on large-scale extraction and curation of biomedical information and clinical/epidemiological findings, by comibing rule-based and data-driven approaches. He is also interested in processing healthcare social media. Goran leads the UK healthcare text analytics network (Healtex) and was the founding Editor-in-Chief of Journal of Biomedical Semantics.Qualifications 2003. PhD in Computer Science (School of Sciences, University of Salford) 1997. MSc in Computer Science (Faculty of Mathematics, University of Belgrade) 1993. BSc in Mathematics and Computer Science (Faculty of Mathematics, University of Belgrade) Research interestsDr Goran Nenadic has been working in the area of natural language processing and text mining since 1993. His research interests include automatic terminology extraction, classification and management, compound word recognition and digital corpora encoding. He also investigates terminology-driven mining of scientific literature (in particular for life sciences) by extracting terms and establishing associations and links among them. He is interested in text analytics and sentiment analysis from online resources, in particular in the healthcare domain.  He leads the UK healthcare text analytics network (http://www.healtex.org). His current research focus is on large-scale extraction and linking of clinical/epidemiological findings from electronic health records (EHRs), healthcare social media and biomedical literature. His team has worked on mining narratives from EHRs (e.g. for clinical outcomes in cancer patients, or medication prescription extraction), making sense of patient-generated data from social media (e.g. benefits and harms of medical treatments) and providing context to clinical decision support systems (e.g. for treatment planning in brain injuries). He has led a number of joint projects with healthcare service providers (e.g. semi-automated large-scale anonymisation of clinical narratives; identification of mental health symptoms in social media; process mapping of occupational therapy reports), as well as with industrial partners (e.g. dynamic clinical documentation management, information extraction from clinical trial reports). Since 2008, his team has been actively involved in international challenges in clinical text mining. My groupClinical Knowledge ManagementData Science InstituteText MiningBioHealth InformaticsHealth eResearch Centre (HeRC)OpportunitiesI currently supervise a number of postgraduate research students, working on different aspects of text mining For more details, please visit http://gnteam.cs.manchester.ac.uk/ Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): External positionsTuring Fellow, Alan Turing Institute1 Sept 2017 → … Areas of expertiseQA75 Electronic computers. Computer sciencenatural language processingResearch Beacons, Institutes and PlatformsInstitute for Data Science and AIDigital FuturesChristabel Pankhurst InstituteKeywordsBiomedical Text MiningClinical Text miningNatural Language ProcessingText AnalyticsText Mining Fingerprint Dive into the research topics where Goran Nenadic is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Text Mining Computer Science 100% Natural Language Processing Computer Science 51% Biomedical Literature Computer Science 35% Machine Learning Computer Science 32% Large Language Model Computer Science 28% Named Entity Recognition Computer Science 25% Annotation Computer Science 24% Pre-Trained Language Models Computer Science 21% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 99 Article 49 Conference contribution 14 Paper 11 Poster 14 More 5 Preprint 4 Chapter 2 Letter 1 Commissioned report 1 Commentary/debate 1 Software Research output per year Research output per year Arg-LLaDA: Argument Summarization via Large Language Diffusion Models and Sufficiency-Aware RefinementLi, H., Sun, Y., Schlegel, V., Yang, K., Batista-Navarro, R. T. & Nenadic, G., 1 Aug 2025, arXiv, p. 1-12, 12 p.Research output: Preprint/Working paper › Preprint Structured Representation 100% Evaluation Metric 100% Beyond Standard Metrics: Assessing NLP for Anonymisation of Clinical Trial NarrativesGraff, N., Nenadic, G., Elliot, M. & Hughes, A. M., 20 Oct 2025, UNECE Expert Meeting on Statistical Data Confidentiality: Expert Meeting on Statistical Data Confidentiality .Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Open Access Natural Language Processing 100% Anonymization 100% Language Processing 100% Evaluation Metric 20% Processing Capability 10% BRIDGE: Bootstrapping Text to Control Time-Series Generation via Multi-Agent Iterative Optimization and Diffusion ModelingLi, H., Huang, Y.-H., Xu, C., Schlegel, V., Jiang, R., Batista-Navarro, R. T., Nenadic, G. & Bian, J., 31 Jul 2025, arXiv.org, p. 34742-34773, 32 p.Research output: Preprint/Working paper › Preprint Open AccessFile multi agent 100% World Application 50% Textual Description 50% Instance Level 50% Counterfactual Analysis 50% 1 Downloads (Pure) Data, dialogue, and design: patient and public involvement and engagement for natural language processing with real-world cancer dataOyewusi, W., Vasquez Osorio, E. M., Nenadic, G., MacGregor, I. & Price, G., 15 May 2025, In: Frontiers in Digital Health. 7, 1560757.Research output: Contribution to journal › Article › peer-review Open Access Natural Language Processing 100% Focus Group 100% Caregiver 100% Artificial Intelligence 100% Consent 100% DiscHPO: Generative Models and Sentence Transformers for the Recognition and Normalisation of Continuous and Discontinuous Phenotype MentionsAlhassan, A., Schlegel, V., Aloud, M., Batista-Navarro, R. T. & Nenadic, G., 15 Aug 2025, (Accepted/In press) In: JMIR medical informatics.Research output: Contribution to journal › Article › peer-review Named Entity Recognition 100% Generative Model 100% Dysmorphology 100% Ontology 50% Utility Software 50% View all 187 research outputs Projects 1 Active 5 Finished Projects per year Centre for Digital Trust and SocietyBarrett, E. (PI), Allmendinger, R. (Researcher), Elliot, M. (Researcher), Lord, N. (Researcher), Cordeiro, L. (Researcher), Gibson, R. (Researcher), Papamarkou, T. (Researcher), Dresner, D. (Researcher), Aldridge, J. (Researcher), Duncan, P. (Researcher), Banach, R. (Researcher), Brown, G. (Researcher), Dennis, L. (Researcher), Fisher, M. (Researcher), Korovin, K. (Researcher), Kotselidis, C.-E. (Researcher), Luján, M. (Researcher), Mustafa, M. (Researcher), Olivier, P. (Researcher), Reger, G. (Researcher), Zhang, N. (Researcher), Hodgkinson, G. (Researcher), Gulati, S. (Researcher), Ainsworth, J. (Researcher), Chen, Y.-W. (Researcher), Green, B. (Researcher), Healey, M. (Researcher), Uyarra, E. (Researcher), Zachariadis, M. (Researcher), Little, C. (Researcher), Mackey, E. (Researcher), Nenadic, G. (Researcher), Keane, J. (Researcher), Shlomo, N. (Researcher), Graff, N. (Researcher), Jarwar, M. A. (Researcher), Shariati Samani, S. (Researcher), Smith, D. (Researcher), Kambites, M. (Researcher), Thorpe, M. (Researcher), Rowley, P. (Researcher), Flynn, S. (Researcher), Turner, P. (Researcher), Wainwright, V. (Researcher), Czerwinsky, A. (PGR student), Nini, A. (Researcher), Broad, R. (Researcher), Shute, J. (Researcher), Deakin, J. (Researcher), Taboada, P. (PGR student), Knight, P. (Researcher), Hutchings, S. (Researcher), Whyte, J. (Researcher), Tolz-Zilitinkevic, V. (Researcher), Pilkington, H. (Researcher), Guharoy, S. (Researcher), Nicolo, A. (Researcher), Reggiani, C. (Researcher), Garcia Oliva, J. (Researcher), Van Someren, A. (Researcher), Bon, E. (Researcher), Cantijoch Cunill, M. (Researcher), Koch, D. (Researcher) & Chen, Y.-W. (Researcher)11/05/21 → …Project: Other Social Statistics 100% Computer Science 100% Interdisciplinary Research 100% Social Research 100% Business School 100% SC-SVI: Developing a Social Care Strengths and Vulnerability Index (SC-SVI) for older people: a feasibility proof of concept study in local authoritiesClarkson, P. (PI), Robinson, C. (CoI), Nenadic, G. (CoI), Martin, G. (CoI), Davies, S. (CoI), Lerigo, F. (Researcher) & Wall, L. (CoI)1/03/22 → 30/04/24Project: Research File Greater Manchester 100% Proof 100% Personal Experience 100% Lived Experience 50% Large Data Set 50% Integrating hospital outpatient letters into the healthcare data spaceNenadic, G. (PI), Dixon, W. (CoI) & Jani, M. (CoI)1/10/21 → 30/09/25Project: Research Natural Language Processing 100% Gold Standard 82% Language Modeling 82% Text Mining 72% Outpatient 66% Assembling the Data Jigsaw: Powering Robust Research on the Causes, Determinants and Outcomes of MSK Disease.Dixon, W. (PI), Brown, B. (CoI), Clarkson, P. (CoI), Dowding, D. (CoI), Holm, S. (CoI), Humphreys, J. H. (CoI), Jani",
  "content_length": 12645,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:23"
}