{
  "name": "Gordon L. Kindlmann",
  "homepage": "http://people.cs.uchicago.edu/~glk",
  "status": "success",
  "content": "Gordon Kindlmann Gordon Kindlmann Associate Professor, Computer Science University of Chicago glk@uchicago.edu CV Google Scholar Pubmed DBLP Office: JCL 249 Mailing address: Gordon Kindlmann UChicago Computer Science John Crerar Library 2nd Floor 5730 South Ellis Ave Chicago, IL 60637 About Projects Publications Talks Teaching Software Research Summary My research straddles (1) computation of imaging-based science and (2) fundamentals of data visualization. (1) Science pairs measurement tools that produce experimental data with computational tools to process the data. Advances in scanned imaging modalities (CT, MRI, microscopy, etc) are constantly increasing in speed, resolution, and sensitivity. Research in collaboration with physical and biomedical researchers -- who acquire image data to answer scientific questions -- can advance how this data may be visually and quantitatively analyzed. (2) It is an exciting time to try to develop the theoretical underpinnings of data visualization. As the discipline matures, we can develop increasingly detailed theoretical accounts of how effective data visualizations are designed, implemented, and perceived. Stretching visualization to new and fast-changing applications (particularly machine learning), however, challenges the coherence of vis theory. I look for students who, like me, are excited by the prospects of improving how science is computed, or advancing the theory and practice of data visualization. See my information about applying. Education and Employment 2017- Associate Professor in Computer Science, University of Chicago. 2009-2017 Assistant Professor in Computer Science and the Computation Institute, University of Chicago. 2004-2008 Post-Doctoral Fellow and Instructor in Radiology, Laboratory of Mathematics in Imaging, Dept of Radiology, Brigham & Women's Hospital, Harvard Medical School. Carl-Fredrik Westin, Advisor. 1998-2004 Computer Science Ph.D. University of Utah, Visualization and Analysis of Diffusion Tensor Fields. Christopher R. Johnson, Advisor. 1995-1998 Computer Graphics MS (1995-1998), Cornell University, Semi-Automatic Generation of Transfer Functions for Direct Volume Rendering. Donald P. Greenberg, Advisor. 1991-1995 Mathematics BA, Cornell University.",
  "content_length": 2262,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:27"
}