{
  "name": "Gordon Wetzstein",
  "homepage": "https://stanford.edu/~gordonwz",
  "status": "success",
  "content": "Gordon Wetzstein - Stanford University Gordon Wetzstein Associate Professor, Electrical Engineering DepartmentAssociate Professor (by courtesy), Computer Science Department Director, Stanford Computational Imaging LabFaculty Director, Stanford Center for Image Systems Engineering (SCIEN)Stanford University 350 Jane Stanford Way Packard Bldg, Room 236 Stanford, CA 94305-9510 phone: 650.497.7953 email: gordon.wetzstein (at) stanford (dot) edu Short Biography: Gordon Wetzstein is an Associate Professor of Electrical Engineering and, by courtesy, of Computer Science at Stanford University. He is the director of the Stanford Computational Imaging Lab and a faculty director of the Stanford Center for Image Systems Engineering. At the intersection of computer graphics and vision, artificial intelligence, computational optics, and applied vision science, Prof. Wetzstein's research has a wide range of applications in next-generation imaging, wearable computing, and neural rendering systems. Prof. Wetzstein is a Fellow of Optica and the IEEE, and the recipient of several awards, including an IEEE VGTC Virtual Reality Technical Achievement Award, an NSF CAREER Award, an Alfred P. Sloan Fellowship, an ACM SIGGRAPH Significant New Researcher Award, a Presidential Early Career Award for Scientists and Engineers (PECASE), an SPIE Early Career Achievement Award, an Electronic Imaging Scientist of the Year Award, an Alain Fournier Ph.D. Dissertation Award as well as many Best Paper and Demo Awards. You can download my curriculum vitae as a pdf document here. For more information about research, courses, admissions, my team, latest news, press, and more, please visit our group website www.computationalimaging.org Education and Experience since 09/21 Associate Professor, Stanford University, Electrical Engineering and, by courtesy, Computer Science, Stanford CA, USA. since 10/24 Co-founder, Stealth Startup 01/20 - 06/24 Co-founder & Chief Scientist, Zinn Labs (acquired by Sesame AI) 11/17 - 05/22 Co-founder, Raxium, Inc. (acquired by Google) 09/14 - 09/21 Assistant Professor, Stanford University, Electrical Engineering and, by courtesy, Computer Science, Stanford CA, USA. 10/11 - 08/14 Postdoctoral Associate, Massachusetts Institute of Technology, Media Lab, Cambridge MA, USA.Funded by an NSERC Postdoctoral Fellowship (PDF) and the DARPA SCENICC program. 09/06 - 09/11 Doctor of Philosophy, University of British Columbia, Vancouver, Canada.Alain Fournier Ph.D. Dissertation Award. 10/00 - 06/06 Diplom, Bauhaus-University Weimar, Germany (summa cum laude) Best Paper and Demo Awards 2024 Best Paper Award, GazeFusion: Saliency-guided Image Generation, ACM Symposium on Applied Perception (SAP) 2024 2023 Best Paper Honorable Mention, Towards Attention-aware Foveated Rendering, ACM SIGGRAPH 2023 2023 Frontiers of Science Award, Neural holography with camera-in-the-loop training, International Congress of Basic Science 2023 2022 Best Journal Paper, Video See-Through Mixed Reality with Focus Cues, IEEE VR 2022 2022 Best Journal Paper, ScanGAN360: A Generative Model of Realistic Scanpaths for 360° Images, IEEE VR 2022 2022 Best Demo Award, Modulo Camera on a Focal Plane Sensor Processor, IEEE International Conference on Computational Photography (ICCP) 2022 2019 Outstanding New Directions Award (Honorable Mention), Scene Representation Networks: Continuous 3D-Structure-Aware Neural Scene Representations, NeurIPS 2019 2018 Best Student Paper (Emil Wolf Student Paper Prize), Optical Convolutional Neural Networks with Optimized Phase Masks for Image Classification, OSA Frontiers in Optics Conference 2018 2018 Best Demo Award (DCEXPO Special Price), Autofocals: gaze-contingent eyeglasses for presbyopes, SIGGRAPH Emerging Technologies 2018 2016 Best Paper (Honorable Mention), Convolutional Sparse Coding for High Dynamic Range Imaging, Eurographics 2016 2016 Best Demo Award, Computational Light Field and Monovision Near-eye Displays, IEEE International Conference on Computational Photography (ICCP) 2016 2016 Conference Best Paper for Industry Award, Depth Augmented Stereo Panorama for Cinematic Virtual Reality with Focus Cues, IEEE International Conference on Image Processing (ICIP) 2016 2014 Best Paper Award at the IEEE International Conference on Computational Photography (ICCP) for the paper \"A Switchable Light Field Camera Architecture with Angle Sensitive Pixels and Dictionary-based Sparse Coding\" 2013 Best Poster Award at the Computation for Design and Optimization (CDO) Symposium for the Poster \"Compressive Cameras and Displays\" 2011 Best Paper Award at the IEEE International Conference on Computational Photography (ICCP) for the paper \"Hand-Held Schlieren Photography with Light Field Probes\" Awards and Fellowships 2025 Fellow of the IEEE 2024 IEEE VGTC Virtual Reality Technical Achievement Award 2024 IEEE VGTC Virtual Reality Academy 2024 Society of Information Displays (SID) - Otto Schade Prize 2023 Fellow of Optica (formerly OSA) 2023 IEEE Signal Processing Society Distinguished Lecturer 2023 IS&T Raymond C. Bowman Award 2020 SPIE Early Career Achievement Award 2019 Presidential Early Career Award for Scientists and Engineers (PECASE) 2018 ACM SIGGRAPH Significant New Researcher Award 2018 Sloan Fellowship 2018 Qualcomm Faculty Award 2017 Scientist of the Year Award, IS&T Electronic Imaging 2016 NSF CAREER Award 2016 Okawa Research Grant 2015 Google Faculty Research Award 2014 Terman Faculty Fellowship 2012 - 2014 Postdoctoral Fellowship, National Sciences and Engineering Research Council of Canada (NSERC) 2012 Alain Fournier Ph.D. Dissertation Annual Award (Best Canadian Computer Graphics PhD Thesis in 2011), Awarded at Graphics Interface Conference 2012 2009 - 2011 Theodore E Arnold Fellowship, University of British Columbia 2008 - 2009 Walter C Koerner Fellowship, University of British Columbia 2005 Laval Virtual Award for \"Smart Projector\", Category Projection Systems, Laval Virtual International Conference on Virtual Reality, 2005 Students supervised Postdocs Gun-Yeal Lee, Stanford University (EE), Postdoc: 2022- Suyeon Choi, Stanford University (EE), Postdoc 2024- Tong Wu, Stanford University (CS/EE), Postdoc: 2025- Seung-Woo Nam, Stanford University (EE), Postdoc: 2025- Ilker Oguz, Stanford University (EE), Postdoc: 2025- Lior Yariv, Stanford University (EE), Postdoc: 2025- PhD Eric Ryan Chan, Stanford University (CS), 2021-, NVIDIA Graduate Fellowship Boyang Deng, Stanford University (CS), 2022-, Meta Research PhD Fellowship, *co-advised with Leo Guibas Brian Chao, Stanford University (EE), 2022-, Stanford SGF Ryan Po, Stanford University (EE), 2022-, Stanford SGF Jay Shenoy, Stanford University (CS), 2022-, NSF GFRP Zhengfei Kuang, Stanford University (CS), 2022- Yang Zhen, Stanford University (CS), 2022-, *co-advised with Leo Guibas Shengqu Cai, Stanford University (CS), 2023- Hansheng Chen, Stanford University (CS), 2023-, *co-advised with Leo Guibas Jackie Yang, Stanford University (EE), 2024-, Stanford SGF Liyuan Zhu, Stanford University (EE), 2024-, *co-advised with Iro Armeni George Nakayama, Stanford University (CS), 2025- Howard Xiao, Stanford University (EE), 2025- MSc Sonia Kim, Stanford University (EE), 2024- Selim Emir Can, Stanford University (EE), 2025- Visitors Yiming Wang, ETH, Visiting Student 2025 Han-Sol Lee, Samsung Electronics, Visiting Scholar 2025- Yuri An, Samsung Display, Visiting Scholar 2025- Ruofan Liu, Institute of Science Tokyo, Visiting Student 2025-2026 Alumni Postdocs Sara Fridovich-Keil, Stanford University (EE), Postdoc: 2023-2025, now Assistant Professor at Georgia Tech (ECE) Guandao Yang, Stanford University (CS/EE), Postdoc: 2023-2025, *joint with Leo Guibas, now Assistant Professor (ECE) at UT Austin Yinghao Xu, Stanford University (CS/EE), Postdoc: 2024-2025, now incoming Assistant Professor (CS) at HKUST Yifan Wang, Stanford University (EE), Postdoc: 2022-2024, now Research Scientist at Adobe Research Rameen Abdal, Stanford University (EE), Postdoc: 2023-2024, now Research Scientist at Snap Research Jeong Joon \"JJ\" Park, Stanford University (CS/EE), Postdoc: 2021-2023, now Assistant Professor (CSE) at The University of Michigan Yifan \"Evan\" Peng, Stanford University (EE), Postdoc: 2018-2022, now Assistant Professor (EE) at The University of Hong Kong Julien Martel, Stanford University, Postdoc 2019-2022, now at Perceptive Sensing Petr Kellnhofer, Stanford University, Visiting Scholar 2019-2021, now Assistant Professor (CS) at TU Delft Joshua Rapp, Stanford University, Postdoc 2020-2021, now Research Scientist at MERL Chris Metzler, Stanford University, Postdoc 2018-2020, now Assistant Professor (CS) at University of Maryland Matthew O'Toole, Stanford University, Postdoc 2016-2018, now Assistant Professor (CS) at CMU Felix Heide, Stanford University, Visiting Student 2014-2016, Postdoc 2016-2018, now Assistant Professor (CS) at Princeton Donald Dansereau, Stanford University, Postdoc 2016-2018, now Assistant Professor (ME) at University of Sydney Michael Broxton, Stanford University, Postdoc 2017-2018, now Research Scientist at Google Alumni PhD Students Manu Gopakumar, Stanford University (EE), 2020-2025, Stanford SGF, now at Apple Qingqing Zhao, Stanford University (EE), 2020-2025, now at Tesla Axel Levy, Stanford University (EE), 2020-2025, *co-advised with Mike Dunne at SLAC, now at Generate:Biomedicines Haley So, Stanford University (EE), 2021-2025, NSF GRFP, now at Meta Reality Labs Suyeon Choi, Stanford University (EE), 2020-2024, Meta Research PhD Fellowship Connor Lin, Stanford University (CS), 2020-2024, Stanford SGF, *co-advised with Leo Guibas, now CTO at Apparate AI Cindy Nguyen, Stanford University (EE), 2019-2024, NSF GRFP, now at Netflix Brooke Krajancich, Stanford University (EE), 2018-2023, Knight-Hennessy Scholar, now at Apple Alex W. Bergman, Stanford University (EE), 2018-2023, Stanford SGF, now CTO at Hedra David Lindell, Stanford University (EE), PhD: 2016-2020 (S",
  "content_length": 87181,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:27"
}