{
  "name": "Gottfried Koch",
  "homepage": "http://www.informatik.uni-leipzig.de/vi/webdir/lehrstuhl_vi/wir/arbeitsgruppe.shtml",
  "status": "success",
  "content": "Arbeitsgruppe Versicherungsinformatik - Wir über uns! Honorarprofessur Versicherungsinformatik Startseite |  Wir über uns! |  Studium |  Kontakt |  Impressum Arbeitsgruppe Mitarbeiter Partner Weitere Infos Universität Leipzig Fakultät für Mathematik und Informatik Institut für Informatik Versicherungsforen Leipzig Arbeitsgruppe Versicherungsinformatik Vorsitzender der Arbeitsgruppe - Prof. Dr. Gottfried Koch Peer Reviewed Articles: Koch, Gottfried; Ostner, Julia; Peisker, Marco; Schülke, Oliver: Eine Analyse ultimaten Verhaltens als Erklärungsanstaz des moral hazards, in: Zeitschrift für die gesamte Versicherungswissenschaft, 3/2009, S. 315 - 348. Koch, Gottfried: Versicherungsinformatik - eine versicherungswissenschaftliche Fachdisziplin, Zeitschrift für die gesamte Versicherungswissenschaft, Supplement Jahrestagung 2006, S. 359-372. Koch, Gottfried: Wertorientierte Steuerung von Versicherungsunternehmen im Lichte des normativen Managements, ZVersWiss(95) 2006, H. 1, S. 125 - 148 Koch, Gottfried: Macht, Management und Verhaltensbiologie - Grundzüge eines verhaltensorientierten Managements, Zeitschrift für die gesamte Versicherungswissenschaft, 2007, Heft 3, S. 305-338 Koch, Gottfried; Falkenberg, Felix: Betriebswirtschaftliche Rahmenbedingungen für eine nachhaltige Entwicklung von \"New Economy-Unternehmen\" in der Versicherungswirtschaft, In: Zeitschrift für die gesamte Versicherungswissenschaft, Heft 1/2005, 1.Januar 2005, S.19-56. Koch, Gottfried: Neue Softwarewerkzeuge zur Steigerung der Effizienz von BtC-Prozessen der Versicherungswirtschaft In: Zeitschrift für die gesamte Versicherungswissenschaft, Heft 1/2003, 2003, S.161-200. Publicationen (PDF) Vorträge (PDF) Lebenslauf Lehre als Versicherungskaufmann bei der Frankfurter-Allianz Versicherungs AG Studien an der Deutschen Versicherungsakademie in Köln, der Johann Wolfgang Goethe Universität in Frankfurt und der Hochschule St. Gallen(Promotion) Tätigkeiten innerhalb der Helvetia Versicherungsgruppe in St. Gallen und Frankfurt, Selbständiger Unternehmensberater Seit 1998 Professor für Versicherungsinformatik an der Universität Leipzig 2000 Mitgründer des Instituts für Versicherungswissenschaften an der Universität Leipzig Seit 2004 Mitglied des Versicherungsbeirats bei der Bundesanstalt für Finanzdienstleistungsaufsicht Startseite |  Wir über uns! |  Studium |  Kontakt |  Impressum © 2001 -2006, Honorarprofessur für Versicherungsinformatik Leipzig, Universität Leipzig",
  "content_length": 2465,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:27"
}