{
  "name": "Gourab Ghoshal",
  "homepage": "http://gghoshal.pas.rochester.edu",
  "status": "success",
  "content": "Research - Ghoshal Lab Front page sidebar Research Most things in the world are made up of systems of interacting parts, such that their global behavior is greater than the sum of their constituents. Such systems are often referred to as Complex Systems, with defining features that include the formation of complex networks and non-linear interactions between components. Examples include the human brain, financial markets, social media, urban systems, infrastructure such as the internet, and socio-economic constructs more broadly. We are a team of highly interdisciplinary researchers who study these systems using tools from Statistical Physics, Non-Linear Dynamics, Network Theory, Information Theory, and Machine Learning, grounded in a data-driven approach. Our work is both theoretical and applied, with recent research exploring: How do urban systems scale, evolve, and structure patterns of human mobility, inequality, and social coordination? What universal principles govern the robustness, adaptation, and evolution of infrastructure, communication, and knowledge networks? How do interventions—whether public health policies or algorithmic nudges—propagate through complex, interconnected systems? What mechanisms underlie decision-making, navigation, and strategic behavior in individuals and collectives? How does meaning emerge from information in living, cognitive, and artificial systems? What distinguishes adaptive, agent-like behavior from passive dynamics across scales—from neurons to cities? Our work spans theoretical and applied domains, including plant genomic networks, robust information search, empirical laws in cities, low-dimensional models of socio-economic dynamics, and game-theoretical analyses of political systems. More recently, we have contributed to the development of information-theoretic frameworks for agency and emergence, and to practical tools for understanding mobility-targeted interventions, AI alignment, and distributed collective behavior. Across these areas, we are particularly interested in uncovering universal mechanisms that underlie coordination, adaptation, and the emergence of meaning. Our collaborations bridge physics, computer science, neuroscience, and philosophy, with an emphasis on integrative, cross-disciplinary inquiry. Our research has been published in leading journals such as Nature, Science, and Physical Review Letters, and featured in media outlets including The New York Times, The Economist, and MIT Technology Review. To learn more, click on the Publications section Sidebar Toggle sidebar Newsfeed📢 New Paper Published in Communications Physics... -- June 13, 2025Visit to the Institute of Mathematical Sciences... -- June 11, 2025Colloquium at Ashoka University -- June 8, 2025Bibandhan Poudyal awarded prestigious Messersmi... -- April 15, 2025Gourab Ghoshal visiting Rutgers for Stat. Mech.... -- January 12, 2025Gourab Ghoshal giving keynote in CCS '24 -- July 9, 2024Workshop on Information in Active Matter -- July 9, 2024PRX Life paper covered in Big Think -- October 22, 2023Paper on semantic information published in PRX ... -- October 17, 2023Gourab Ghoshal attending CCS'23 -- October 15, 2023Damian Sowinski wins Steadman award -- September 22, 2023Group visiting NetSci and IC2S2 -- July 4, 2023Gourab Ghoshal promoted to Full Professor -- July 4, 2023Sowinski and Kelty presenting at NERCCS 2023 -- March 20, 2023Gourab Ghoshal visiting UCLA -- March 20, 2023Damian Sowinski joins as postdoc! -- January 3, 2023Visit by Alec Kirkley (Univ. Hong Kong) -- November 1, 2022Gourab Ghoshal presenting at CCS2022 -- October 15, 2022Postdoctoral position available -- September 18, 2022ARO grant on the future of work awarded -- July 7, 2022Templeton Foundation grant awarded -- June 7, 2022Sayat Mimar defends thesis! -- May 11, 2022Review paper on epidemic models out in Annalen ... -- March 11, 2022Gourab Ghoshal presenting at the Max Planck Ins... -- March 8, 2022Alec Kirkley gets faculty position! -- September 1, 2021Paper on urban epidemic vulnerability out in Co... -- August 23, 2021Surendra Hazarie defends his PhD thesis! -- June 17, 2021Gourab Ghoshal presenting at INdAM workshop -- April 22, 2021Gourab Ghoshal awarded Data Science Fellowship -- July 1, 2020Sayat Mimar secures summer internship at Amazon -- June 10, 2020Brian Dickinson joins Grove City College as Ass... -- June 1, 2020Mathematical model will monitor spread of COVID... -- May 20, 2020NSF-RAPID grant awarded on COVID-19 research -- April 21, 2020Gourab Ghoshal invited speaker at NetSci 2020 -- January 17, 2020Gourab Ghoshal awarded tenure -- January 1, 2020Paper on Urban hierarchies covered in EL Pais -- October 24, 2019Paper on Urban hierarchies out in Nature Commun... -- October 24, 2019Visit by David Panos (U. Zaragoza, Spain) -- October 9, 2019Connor Luckett admitted to Brown -- July 23, 2019Gourab Ghoshal presenting at the Lipari Summer ... -- July 13, 2019Gourab Ghoshal visiting University of Aveiro -- July 3, 2019Alec Kirkley wins NDSEG Fellowship -- April 12, 2019Gourab Ghoshal presenting at CDSE days -- April 8, 2019Gourab Ghoshal presenting at Clarkson Universit... -- March 27, 2019Our research featured in UR newsletter -- March 23, 2019Kristin Bush Marshall joins the Centers for Dis... -- March 23, 2019Gourab Ghoshal presenting at Northeastern and M... -- March 4, 2019Gourab Ghoshal attending the APS March meeting -- March 4, 2019Hugo Barbosa joins the University of Exeter as ... -- February 1, 2019Shiva Lakshmanan joins JP Morgan -- December 6, 2018Hugo Barbosa gets a faculty offer at the Univer... -- October 16, 2018ARO grant awarded -- September 1, 2018Paper on urban congestion out in Nature Communi... -- June 27, 2018Paper on urban morphology featured in Nature Co... -- June 11, 2018Sayat Mimar wins Okubo Prize -- April 25, 2018Group attending NERCCS -- April 10, 2018Review paper on human mobility out in Physics R... -- March 9, 2018Visit by Alberto Perez Munuzuri (USC, Spain) -- February 13, 2018Gourab Ghoshal visiting KAIST, Daejon, Korea -- January 6, 2018Paper on Urban morphology out in Nature Communi... -- December 20, 2017Visit by Vinko Zlatić (Rudjer Boskovic Institut... -- October 10, 2017Paper presented in ACM UbiComp 2017 -- September 21, 2017Gourab Ghoshal awarded for Excellence in teachi... -- September 21, 2017Call for Papers - EPJ Data Science - Individual... -- May 5, 2017Video of Gourab Ghoshal's talk at SUNY - Bingha... -- April 25, 2017Alec Kirkley admitted to the Physics graduate p... -- April 15, 2017Invited talk by Liang Tian (Harvard Medical Sch... -- March 31, 2017Gourab Ghoshal giving a talk at SUNY Binghamton -- March 8, 2017Gourab Ghoshal due to give plenary talk in Comp... -- March 8, 2017Two group members admitted to the Santa Fe Inst... -- March 7, 2017Urban systems - Hyejin Youn (MIT) and Minjin Le... -- February 20, 2017ARO-STIR grant awarded -- February 8, 2017",
  "content_length": 6936,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:31"
}