{
  "name": "Gouri Ginde",
  "homepage": "https://shaktilab.org",
  "status": "success",
  "content": "About - SHAKTI Lab Home News Projects Gouri Ginde (Deshpande) is an Assistant Professor in the Department of Electrical and Software Engineering at the University of Calgary. She earned her Ph.D. in Computer Science from the same institution in 2022. Her research focus is Data analytics, Applied Data Science in Software Engineering, and Health Care. Before transitioning to academia, Gouri spent a decade in the Information Technology (IT) industry working at Hewlett Packard (Bangalore, India), where she held various roles, including Software Engineer and Senior Software Engineer. Gouri is also the Scientific Director of the Software Hub for AnalytiKs, Technology and Innovation Hub (SHAKTI) laboratory at the University of Calgary. The vision of her research lab is to solve software-centric problems that are usable in the real world. Gouri actively seeks collaborations with the industry to bridge gaps between industry and academia and foster innovation. Gouri has actively contributed to the academic and professional community through various roles. She has been on the organizing committees for the NLP4RE'23 and CROWDRE'24 workshops and has been a Gracehopper mentor since 2021. Her involvement in program committees includes prestigious conferences such as FSE/ESEC'23, IEEE COMPSAC since 2018, ESEM'23, ICSE'23, ICPC'24, RE@Next'24, and ESEM'24. Additionally, she was a speaker at the IEEE WIE'23 and provided a tutorial on NLP at RE'22. She received the Best Paper Award at the ESEM'20 conference and delivered a keynote at the WiDS'24 Calgary chapter. She is currently co-editing a book: NLP for RE with Dr. Alessio Ferrari, to be published by Springer Verilog in 2024. Gouri seeks self-motivated and proactive Undergraduate, Masters & PhD students to contribute to her lab's research agenda. Applicants from various backgrounds, cultures, genders, and ethnicities with industry/work experience are encouraged to apply. She also invites highly motivated high schoolers and undergraduate students to work alongside her diverse SHAKTI Lab team, where everyone's unique perspective is valued (Please fill out the form as a first step). For more information about her research, please visit her google scholar . Profile Our Team Akash Sorathiya Thesis MSc '25 Alumni Jacob Idoko MSc (Thesis) student Jagrit Acharya Thesis MSc '25 Alumni Sam Hoang Hong MSc (Thesis) student Rahul Ravi Research Assistant '24 Alumni Shreyas Patil MSc (Thesis) student Summer Interns Kirat Bath Research Intern (2025) HYRS Student Sana Sajjad Research Intern (2025) NSERC USRA Award Recipient 🏆 Simar Kandola Research Intern (2024) NSERC USRA Award Recipient 🏆 Krishna Shah Research Intern (2024) Abhay Sharma Research Intern (2024) Noopur Mitacs Research Intern (2023) Rishabh Research Intern (2023) Ammar Research Intern (2023) Zeeshan Research Intern (2023) Copyright © SHAKTI Lab All Rights Reserved Search Python JavaScript Design Web Design Frameworks Tools",
  "content_length": 2957,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:28"
}