{
  "name": "Gowtham Atluri",
  "homepage": "http://homepages.uc.edu/~atlurigm",
  "status": "success",
  "content": "Gowtham Atluri Email: gowtham [dot] atluri [at] uc [dot] edu Address: P.O. Box 210030, Cincinnati, OH 45221 Tel: 513.556.3196 Fax: 513.556.7326 Research interests: Data Mining, Neuroimaging, Biomedical Informatics, Climate Science, and Mobile Health. The focus of my research is to develop novel data science insights and methodologies that will accelerate the pace of scientific discovery. Specifically, my main thrust is in developing techniques for discovering untapped information in space-time data that is becoming ubiquitous in several domains, including neuroscience, high-energy physics, and social sciences. Development of novel frameworks for knowledge discovery is crucial to tackle the challenges introduced by the characteristics of the data and the new data science problems that arise in these domains. Some key directions in my research that are motivated from the above disciplines include studying networks in space-time data, comparing space-time instances, discovering patterns, and integrating data from different sources. With my work in these directions, I hope to advance data science and have a far reaching impact in the form of scientific discoveries in several application domains. Feature selection framework for functional connectome fingerprinting, Li, Kendrick, Krista Wisner, and Gowtham Atluri, Human Brain Mapping 2021 A spatiotemporal analysis of opioid poisoning mortality in Ohio from 2010 to 2016, Park, Chihyun, Jean R. Clemenceau, Anna Seballos, Sara Crawford, Rocio Lopez, Tyler Coy, Gowtham Atluri, and Tae Hyun Hwang, Scientific reports 2021 Spatio-temporal data mining: A survey of problems and methods, Atluri, Gowtham, Anuj Karpatne, and Vipin Kumar, ACM Computing Surveys 2018 Theory-guided Data Science: A New Paradigm for Scientific Discovery, Anuj Karpatne, Gowtham Atluri, James Faghmous, Michael Steinbach, Arindam Banerjee, Auroop Ganguly, Shashi Shekhar, Nagiza Samatova, and Vipin Kumar, arXiv preprint arXiv:1612.08544, 2016 Studying Brain Networks Using Functional Imaging Data, Gowtham Atluri, Angud MacDonald III, Kelvin Lim, and Vipin Kumar, IEEE Computer, 2016. Connectivity cluster analysis for discovering discriminative subnetworks in schizophrenia, Gowtham Atluri, Michael Steinbach, Kelvin Lim, Vipin Kumar, and Angus MacDonald III, Human Brain Mapping, 2014. Advanced Topics in Mining Spatio-Temporal Data Description: Spatial Temporal data is becoming increasingly ubiquitous in diverse scientific domains such as earth science, neuroscience, and transportation. Data science methods that can answer novel scientific questions while handling the challenges due to spatial-temporal properties, volume, resolution, and quality of the data are crucial to advances in these domains. However, traditional data science approaches are unsuited to address problems in spatial temporal data due to their inability (i) in accounting for spatial and temporal characteristics, (ii) in making use of data available at different spatial and temporal resolutions, and (iii) in dealing with heterogeneity in space and time. This course provides an overview of data mining problems that are studied in the context of spatial temporal data, as well as techniques that have been designed to tackle these problems by addressing challenges posed by spatial and temporal characteristics of the data. The objective of this course is to prepare students to successfully analyze the challenging spatial temporal datasets that are increasingly becoming available in several scientific and commercial domains.",
  "content_length": 3552,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:32"
}