{
  "name": "Graeme Smith",
  "homepage": "http://staff.itee.uq.edu.au/smith",
  "status": "success",
  "content": "Graeme Smith The University of Queensland HomeSmith Graeme Smith Associate Professor School of Electrical Engineering and Computer Science The University of Queensland 4072 Australia email: g.smith1@uq.edu.au Professional Activities Editor Science of Computer Programming, 2015-2023 Invited keynote speaker 24th International Conference on Software Engineering and Formal Methods (ICFEM 2023) Presentation title: \"Compositional reasoning at the software/hardware interface\". Abstract on page xiii of Y. Li and S. Tahar, editors, 24th International Conference on Software Engineering and Formal Methods (ICFEM 2023). Springer-Verlag, 2023. Programme co-chair Cyber Defence Next Generation Technology and Science Conference (CDNG 2022) Formal Methods Teaching Workshop and Tutorial (FMTea 2019) International Refinement Workshop (Refine 2007) International Conference on Integrated Formal Methods (IFM 2005, IFM 2004) International Conference on Integrated Formal Methods (Doctoral Symposium) (IFM 2005 (Doctoral Symposium)) Guest editor Formal Aspects of Computing (volume 22,number 1), 2010. Electronic Notes in Theoretical Computer Science (volume 191), 2007. Formal Aspects of Computing (volume 17, number 4), 2005. L'Objet (volume 6, number 1), 1999. Programme committee member International Symposium on Formal Methods (FM 2026) International Symposium on Formal Methods (Tutorials) (FM 2026 (Tutorials)) Formal Methods Teaching Workshop and Tutorial (FMTea 2024, FMTea 2023, FMTea 2021) European Symposium on Programming (ESOP 2023) International Conference on Software Engineering and Formal Methods (SEFM 2022, SEFM 2021, SEFM 2019, SEFM 2018, SEFM 2017, SEFM 2016, SEFM 2003) International Conference on Integrated Formal Methods (PhD Symposium) (PhD-iFM2022) Working Conference on Verified Software: Theories, Tools and Experiments (VSTTE 2020) International Refinement Workshop (Refine 2019, Refine 2018, Refine 2015, Refine 2013, Refine 2011) International Conference on Formal Engineering Methods (ICFEM 2018, ICFEM2013, ICFEM 2012, ICFEM 2010, ICFEM 2004, ICFEM 2003) International Workshop on Formal Methods for Safety-Critical Systems (FTSCS 2018) International Symposium on Theoretical Aspects of Software Engineering (TASE 2018, TASE 2015, TASE 2013) International Conference on Integrated Formal Methods (iFM 2017, iFM 2014, iFM 2013, iFM2012, iFM2010, iFM 2009, IFM 2007, IFM2002, IFM2000, IFM99) International Symposium on Formal Methods (Doctoral Symposium) (FM 2015 (Doctoral Symposium), FM 2014 (Doctoral Symposium)) IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO 2012, SASO 2011) Workshop on Trustworthy Self-Organizing Systems (TSOS 2012, TSOS 2011, TSOS 2010) Asia-Pacific Software Engineering Conference (APSEC 2012) International Z User Meeting (ZUM 2006) International Conference of Z and B Users (ZB 2005, ZB 2003, ZB 2002) Other FME Formal Methods Teaching Committee, 2018 - present CSIRO's Data61 and DST Cyber Security Summer School organising committee, 2019-2022. ERCIM InterLink Working Group on Software-Intensive Systems and New Computing Paradigms, 2007-2008 Z Standardisation Review Committee, 1999-2002 Object-Z webpage Current Projects Safe and secure COncurrent programming for adVancEd aRchiTectures (COVERT) (2023-2026) Funded by Engineering and Physical Sciences Research Council, UK (EPSRC) Boogie Analysis of Secure Information flow Logics (BASIL) (2022-2026) Funded by Defence Science and Technology Group (DSTG) Automated Rely/Guarantee Generation (RG-Gen) (2023-2026) Funded by Defence Science and Technology Group (DSTG) Recent Projects BAP ARMv8 Lifter Extension (2022) Funded by Defence Science and Technology Group (DSTG) Automated Invariant Discovery Assistant (AIDA) (2021-2022) Funded by Defence Science and Technology Group (DSTG) Trustworthiness of Symbolic Executors (2021) Funded by Defence Science and Technology Group (DSTG) Verifiably correct transactional memory (2018-2021) Funded by Engineering and Physical Sciences Research Council, UK (EPSRC) Verifying expressive information flow security for weak memory concurrent programs (2019-2021) Funded by Defence Science and Technology Group (DSTG) Disassembly of ARM binaries for security vulnerability analysis (2019-2020) Funded by Defence Science and Technology Group (DSTG) Relaxed correctness criteria for modern multi-core architectures (2016-2019) Funded by Australian Research Council (ARC) A mechanized framework for weak memory model security (2019) Funded by Defence Science and Technology Group (DSTG) Publications Book G. Smith. The Object-Z Specification Language. Advances in Formal Methods Series. Kluwer Academic Publishers, 2000. Edited Proceedings B. Dongol, L. Petre and G. Smith. Formal Methods Teaching Workshop and Tutorial (FMTea 2019), volume 11758 of Lecture Notes in Computer Science. Springer-Verlag, 2019. E. Boiten, J. Derrick and G. Smith, editors, International Refinement Workshop (Refine 2007), volume 201 of Electronic Notes Theoretical Computer Science. Elsevier, 2008. J. Romijn, G. Smith and J. van de Pol, editors, Integrated Formal Methods: 5th International Conference, IFM 2005, volume 3771 of Lecture Notes in Computer Science. Springer-Verlag, 2005. E.A. Boiten, J. Derrick and G. Smith, editors, Integrated Formal Methods: 4th International Conference, IFM 2004, volume 2999 of Lecture Notes in Computer Science. Springer-Verlag, 2004. Book Chapters J. Derrick, G. Smith, L. Groves and B. Dongol. A proof method for linearizability on TSO architectures. In M. Hinchey, J.P. Bowen and E.-R. Olderog, editors, Provably Correct Systems. NASA Monographs in System and Software Engineering. Springer-Verlag. 2017. J.W. Sanders and G. Smith. Formal ensemble engineering. In M. Wirsing, J.-P. Banâtre, M. Hölzl and A. Rauschmayer, editors, Challenges for Software-Intensive Systems and New Computing Paradigms, volume 5380 of Lecture Notes in Computer Science, pp. 132-138. Springer-Verlag. 2008. G. Smith. Extending formal methods for software-intensive systems. In M. Wirsing, J.-P. Banâtre, M. Hölzl and A. Rauschmayer, editors, Challenges for Software-Intensive Systems and New Computing Paradigms, volume 5380 of Lecture Notes in Computer Science., pp.146-161. Springer-Verlag, 2008. G. Smith. State-based approaches: From Z to Object-Z. In H. Bowman and J. Derrick, editors, Formal Methods for Distributed Processing: A Survey of Object-Oriented Approaches, chapter 6, pages 105-125. Cambridge University Press, 2001. Journal Publications B. Dongol, C. Dubois, S. Hallerstede, E. Hehner, C. Morgan, P. Müller, L. Ribeiro, A. Silva, G. Smith, E. de Vink. On Formal Methods Thinking in Computer Science Education. In Formal Aspects of Computing. ACM, 2024. N. Coughlin, K. Winter and G. Smith. Compositional reasoning for non-multicopy atomic architectures. In Formal Aspects of Computing. ACM, 2022. PDF N. Coughlin and G. Smith. Compositional noninterference on hardware weak memory models. In Science of Computer Programming. Elsevier, 2022. Selected for the FM 2023 Journal First Track. PDF G. Smith, N. Coughlin and T. Murray. Information-flow control on ARM and POWER multicore processors. In Formal Methods in System Design. Springer, 2021. PDF G. Smith, K. Winter and R.J. Colvin. Linearizability on hardware weak memory models. Formal Aspects of Computing, 32:1-32. Springer, 2020. PDF K. Winter, G. Smith and J. Derrick. Modelling concurrent objects running on the TSO and ARMv8 memory models. Science of Computer Programming, 184. Elsevier, 2019. PDF G. Smith and K. Winter. Relating trace refinement and linearizability. Formal Aspects of Computing, 29(6):935-950. Springer, 2017. PDF Q. Li and G. Smith. Refining autonomous agents with declarative beliefs and desires. Formal Aspects of Computing, 29(2):227-249. Springer, 2017. PDF Q. Li and G. Smith. Formal development of multi-agent systems using MAZE. Science of Computer Programming, 131:126-150. Elsevier, 2016. PDF G. Smith, J.W. Sanders and K. Winter. Designing adaptive systems using teleo-reactive agents. Transactions on Computational Collective Intelligence XVI, volume 8780 of Lecture Notes in Computer Science. Springer-Verlag, 2014. PDF J. Derrick and G. Smith. Temporal logic property preservation under Z refinement. Formal Aspects of Computing, 24(3):393-416. Springer-Verlag, 2012. J.W. Sanders and G. Smith. Emergence and refinement. Formal Aspects of Computing, 24(1):45-65. Springer-Verlag, 2012. Z. Fu and G. Smith. Property transformation under specification change. Frontiers of Computer Science in China, 5(1):1-13. Springer-Verlag, 2010. G. Smith and K. Winter. Model checking action system refinements. Formal Aspects of Computing, 21(1):155-186. Springer-Verlag, 2009. G. Smith and J. Derrick. Verifying data refinements using a model checker. Formal Aspects of Computing, 18(3):264-287. Springer-Verlag, 2006. J. Derrick and G. Smith. Structural refinement of systems specified in Object-Z and CSP. Formal Aspects of Computing, 15(1):1-27. Springer-Verlag, 2003. G. Smith and I.J. Hayes. An introduction to Real-Time Object-Z. Formal Aspects of Computing, 13(2):128-141. Springer-Verlag, 2002. G. Smith and J. Derrick. Specification, refinement and verification of concurrent systems - an integration of Object-Z and CSP. Formal Methods in System Design, 18(3):249-284. Kluwer Academic Publishers, 2001. G. Smith and C. Fidge. Incremental development of real-time requirements: The light control case study. Journal of Universal Computer Science, 6(7):704-730. Springer-Verlag, 2000. R. Duke, C. Bailes and G. Smith. A blocking model for reactive objects. Formal Aspects of Computing, 8(3):347-368. Springer-Verlag, 1996. R. Duke, C. Bailes and G. Smith. A fully abstract model of reactive objects. Formal Aspects of Computing, 8(D):184-243. Springer-Verlag, 1996. G. Smith. A fully abstract semantics of classes for Object-Z. Formal Aspects of Computing, 7(3):289-313. Springer-Verlag, 1995. G. Smith. A fully abst",
  "content_length": 33871,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:35"
}