{
  "name": "Graham Farr",
  "homepage": "http://www.csse.monash.edu.au/~gfarr",
  "status": "success",
  "content": "Graham Farr Graham Farr Professor, FIT Clayton campus, Faculty of IT, Monash University, Clayton, Victoria 3800, Australia. Phone: +61 3 9905 5201; Fax: +61 3 9905 5159; Email: Graham.Farr@monash.edu Previous positions: Head, Clayton School of IT (2012-2015); Director, Higher Degrees by Research, Clayton School of IT (2010-2012); Head, Caulfield School of IT (2005-2008). The current Head of the Faculty of IT, Clayton campus (formerly the Clayton School of IT) is Assoc Prof Alan Dorin. The current Dirctor of HDR for FIT Clayton campus is Prof Bala Srinivasan. The current Head of FIT Caulfield campus (formerly the Caulfield School of IT) is Assoc Prof Judy Sheard. Research algorithms and complexity; graphs and matroids; information theory; cryptography Selected publications Discrete Mathematics Research Group Seminar (19 Aug 2009): A survey of Tutte-Whitney polynomials Public talk (11 mins) on William Tutte at The Laborastory, 1 July 2013. Eigencircle web page and applet PhD graduates Hooman Reisi Dehkordi, The Hanani-Tutte Theorem and Non-separating Planar Graphs, PhD, 2020 (Associate Supervisor: Prof. David Wood; External Associate Supervisor: Prof. Peter Eades). Srinibas Swain, Graph parameters: theory, generation and dissemination, PhD, 2019 (Associate Supervisors: Dr Kerri Morgan and Prof. Paul Bonnington). Now at Dept of Computer Science and Engineering, Indian Institute of Information Technology (IIIT) Guwahati. Kai Siong Yow, Tutte-Whitney Polynomials for Directed Graphs and Maps, PhD, 2019 (Associate Supervisor: Dr Kerri Morgan). Now at Dept of Mathematics, Universiti Putra Malaysia. Michael Brand, Computing with Arbitrary and Random Numbers, PhD, 2014 (Associate Supervisor: Prof. Ian Wanless). Mollie Holman Doctoral Medal, Faculty of IT, 2013. Faculty of I.T. Doctoral Medal, 2013. Gordon Preston Prize (best student talk), Victorian Algebra Conference, 2011. Now Founder of Otzma Analytics and Adjunct Associate Professor, Faculty of IT, Monash University. Kerri Morgan, Algebraic aspects of the chromatic polynomial, PhD, 2010. CMSA Student Prize (Best Student Talk), 4th International Combinatorics Conference, Auckland, 2008. Now at School of IT, Deakin University. Arun Prasath Mani, Correlation inequalities for Tutte polynomials, PhD, 2010. Mollie Holman Doctoral Medal, Faculty of IT, 2011. (portrait as part of the Illuminations art project by Andrew Baird) Rebecca Robinson, Characterizations and algorithms for topological containment of wheel graphs, PhD, 2009. Mollie Holman Doctoral Medal, Faculty of IT, 2010. Now at Faculty of IT, Monash University. David Wood, Three-Dimensional Orthogonal Graph Drawing, PhD, 2000. Mollie Holman Doctoral Medal, Faculty of IT, 2001. Best Student Paper, Graph Drawing 1999 [preface to Proc]. Now Professor, School of Mathematics, Monash University. Awards Vice-Chancellor's Award for Excellence in Postgraduate Supervision, 2011 Special Commendation, Vice-Chancellor's teaching awards, 2000 Teaching FIT2014 Theory of Computation (2nd Semester, 2019) Some past teaching FIT4010 Advanced Topics in Algorithms and Discrete Structures (1st Semester 2017 and 2nd Semester 2018) FIT4008/FIT5108 Graph Algorithms (Reading Unit) FIT4008 Computational Complexity (Reading Unit) (1st Semester, 2015) FIT6021: five two-week modules on Matroid Theory as an option for Advanced Research Methods subject for research students (2nd Semester, 2014) CSE452-CSE453/CSC425 Cryptography FIT4008 Cryptography (Reading Unit) (2nd Semester, 2011) FIT1008 Computer Science (2nd Semester, 2011) FIT3014 Analysis and Design of Algorithms (2nd Semester, 2010) FIT2004 Algorithms and Data Structures (half) (2nd Semester, 2010) FIT1002 Computer Programming CSE1301 Computer Programming CSE3301 Project (2nd Semester, 2004) Other stuff Computing in Melbourne: A Historical Tour Alan Turing Centenary Celebration, Fri 14 Sept 2012 Seminar by Prof Jiri Tuma (Charles U, Prague): Permutation groups and the solution of German Enigma Cipher (PDF, 1.4MB) (given at School of CSSE, Monash, on 18 August 2003) (seminar abstract) Course by Prof. Dr. Franz Brandenburg (U of Passau): Graph Drawing: Past - Present - Future (.ppt, 547k) presented in CSSE on 3, 10, 17 Oct 2002. Last updated 15 August 2019",
  "content_length": 4255,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:34"
}