{
  "name": "Graham J. Williams",
  "homepage": "https://comp.anu.edu.au/people/graham-williams",
  "status": "success",
  "content": "Graham Williams | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Research Graham’s research in data science and machine learning has recently focussed on how we can recover our privacy in a digital and data rich world. To that end, he has built a team that is researching how data can be securely stored and placed under an individual’s control. Our personal online data stores (PODs) are hosted on open source SOLID (socially linked data) servers that store open and encrypted data. Data Privacy and Data Sovereignty (https://sii.anu.edu.au); Open source software for data science (https://rattle.togaware.com); Democratising AI, Machine Learning, and Data Science (https://mlhub.ai); Privacy and Data Analysis over massively distributed data (https://togaware.com/ecosysl.html); Reasoning over Knowledge Graphs, entity resolution and link discovery; Biography Graham innovatives with Data Science solutions utilising AI and Machine Learning to target important business use cases. He has a focus on developing technology for good and sharing through open source software practices, particularly with a focus on privacy. Graham has served in a number of senior roles across indistry, government, research and academia. He was Director of Data Science with Microsoft, building and mentoring research groups across different industries. As an executive with the Australian Taxation Office and the Whole of Government Data Analytics Centre of Excellence he guided government departments in setting up their Data Science capabilities. At CSIRO he initiated the first Data Mining research group in Australia. He is the author of books and open source software widely used in teaching. Graham has a PhD in Computer Science (Machine Learning) from the ANU and BSc Hons (Maths) (First Class) University of Adelaide. Activities & Awards Publications Visit Togaware for a list of publications. bars search times",
  "content_length": 2038,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:32"
}