{
  "name": "Graham W. Taylor",
  "homepage": "https://www.gwtaylor.ca",
  "status": "success",
  "content": "Graham Taylor, University of Guelph Graham Taylor Professor and Canada Research Chair in Machine Learning School of Engineering, University of Guelph Faculty Member and Canada CIFAR AI Chair Vector Institute for Artificial Intelligence Academic Director, NextAI Richards Building, Room 3515 Guelph, Ontario, N1G 2W1 To contact me by email or phone, please visit the University of Guelph Directory. I lead the Machine Learning Research Group at the University of Guelph. My research spans a number of topics in deep learning. I am interested in open problems such as how to effectively learn with less labeled data, and how to build human-centred AI systems. I am interested in methodologies such as generative modelling, graph representation learning and sequential decision making. I also pursue applied projects that leverage computer vision to mitigate biodiversity loss. News Nathan Grewal joined our group as a PhD student in the Fall of 2025. On 2025-08-07 I gave a keynote talk at the BIO2 Symposium. Harnessing artificial intelligence to fill global shortfalls in biodiversity knowledge published in Nature Reviews on 2025-02-20. Our CLIBD paper is accepted to ICLR 2025. Congratulations Scott Lowe and co-authors! Tiancheng Gao joined our group as a Master's student in the Winter of 2025. Kristina Kupferschmidt defended her PhD thesis on 2024-12-19. The BIOSCAN-5M Dataset paper is accepted to NeurIPS 2024 Datasets & Benchmarks Track. Congratulations Scott Lowe, Iuliia Eyriay, and co-authors! Mohamed Mostafa joined our group as a Master's student in the Fall of 2024. Welcome MBINF students Xiao Lei (Cynthia) Du, Lubaina Ahmed Kothari, and Nate Lesperance! Welcome summer undergraduate research assistants Mya Simpson, Zohrah Bee Varsally, and Andrew Comtois! Welcome Vector research intern Ryan Junejo! Kevin Kasa received the Canada Graduate Scholarships — Michael Smith Foreign Study Supplement. NSF + NSERC award: I will be recruiting a PhD student and Postdoc who want to work on ML for Biodiversity. John Quinto joined our group as a Master's student in the Fall of 2023. Angus Galloway defended his PhD thesis on 2023-08-08. Sara El-Shawa defended her MASc thesis on 2023-05-15. Rylee Thompson defended his MASc thesis on 2023-05-04. Congratulations to our NSERC & OGS award winners: Anton, Kevin and Kristina! Iuliia Eyriay joined the group as a postdoctoral fellow and research manager. One paper accepted at CVPR 2023. Congratulations Brendan Duke! Mahmoud (Jimmy) Gamal defended his MASc thesis on 2023-02-15. Brief Biography I received my PhD in Computer Science from the University of Toronto in 2009, where I was advised by Geoffrey Hinton and Sam Roweis. I spent two years as a postdoc at the Courant Institute of Mathematical Sciences, New York University working with Chris Bregler, Rob Fergus, and Yann LeCun. In 2012, I joined the School of Engineering at the University of Guelph as an Assistant Professor. In 2017, I was promoted to Associate Professor and became a member of the Vector Institute for Artificial Intelligence. In 2018, I was honoured as one of Canada's Top 40 under 40. In 2019, I was named a Canada CIFAR AI Chair. I spent 2018-2019 as a Visiting Faculty member at Google Brain, Montreal. In 2021 I was promoted to Professor and I became the Interim Research Director at the Vector Institute. In 2022 I became Vector's Research Director. At the end of 2023, I concluded my tenure as the Research Director at the Vector Institute to focus more on my research. Research Highlights A complete list of my publications is available on Google Scholar. ZeMing Gong, Austin Wang, Xiaoliang Huo, Joakim Bruslund Haurum, Scott Lowe, Graham Taylor, and Angel Chang. CLIBD: Bridging vision and genomics for biodiversity monitoring at scale. In International Conference on Learning Representations (ICLR), 2025. To appear. Early version appeared at Computer Vision and Pattern Recognition (CVPR) Workshop on Fine-Grained Visual Categorization. [ bib | arXiv | GitHub | http ] Laura Pollock, Justin Kitzies, Sara Beery, Kaitlyn Gaynor, Marta Jarzyna, Oisin Mac Aodha, Bernd Meyer, David Rolnick, Graham Taylor, Devis Tuia, and Tanya Berger-Wolf. Harnessing artificial intelligence to fill global shortfalls in biodiversity. Nature Reviews, 2025. [ bib | DOI ] Tiancheng Gao and Graham Taylor. BarcodeMamba: State space models for biodiversity analysis. In Neural Information Processing Systems (NeurIPS) Workshop on Foundation Models for Science, 2024. [ bib | arXiv | GitHub ] Zahra Gharaee, Scott Lowe, ZeMing Gong, Pablo Millan Arias, Nicholas Pellegrino, Austin Wang, Joakim Bruslund Haurum, Iuliia Zarubiieva, Lila Kari, Dirk Steinke, Graham Taylor, Paul Fieguth, and Angel Chang. BIOSCAN-5M: A multimodal dataset for insect biodiversity. In Neural Information Processing Systems (NeurIPS) Datasets and Benchmarks Track, 2024. [ bib | arXiv | GitHub ] Joakim Bruslund Haurum, Sergio Escalera, Graham Taylor, and Thomas Moeslund. Agglomerative token clustering. In European Conference on Computer Vision (ECCV), 2024. [ bib | arXiv | GitHub | http ] Pablo Millan Arias, Niousha Sadjadi, Monireh Safari, ZeMing Gong, Austin Wang, Scott Lowe, Joakim Bruslund Haurum, Iuliia Zarubiieva, Dirk Steinke, Lila Kari, Angel Chang, and Graham Taylor. BarcodeBERT: Transformers for biodiversity analysis. In Neural Information Processing Systems (NeurIPS) Workshop on Self-Supervised Learning: Theory and Practice, 2023. [ bib | arXiv | GitHub ] Zahra Gharaee, ZeMing Gong, Nicholas Pellegrino, Iuliia Zarubiieva, Joakim Bruslund Haurum, Scott Lowe, Jaclyn McKeown, Chris Ho, Joschka McLeod, Yi-Yun Wei, Jireh Agda, Sujeevan Ratnasingham, Dirk Steinke, Angel Chang, Graham Taylor, and Paul Fieguth. A step towards worldwide biodiversity assessment: The BIOSCAN-1M insect dataset. In Advances in Neural Information Processing Systems (NeurIPS) Datasets and Benchmarks Track, 2023. [ bib | arXiv | GitHub ] Michal Lisicki, Mihai Nica, and Graham Taylor. Bandit-driven batch selection for robust learning under label noise. In Neural Information Processing Systems (NeurIPS) Workshop on Optimization for Machine Learning, 2023. Also presented at the NeurIPS Workshop on Advancing Neural Network Training (WANT). [ bib | arXiv ] Joakim Bruslund Haurum, Sergio Escalera, Graham Taylor, and Thomas Moeslund. Which tokens to use? investigating token reduction in vision transformers. In International Conference on Computer Vision (ICCV) Workshop on New Ideas in Vision Transformers, 2023. [ bib | arXiv | GitHub | http ] Kevin Kasa and Graham Taylor. Empirically validating conformal prediction on modern vision architectures under distribution shift and long-tailed data. In International Conference on Machine Learning (ICML) Workshop on Structured Probabilistic Inference & Generative Modeling, 2023. [ bib | arXiv ] Mateusz Jurewicz, Graham Taylor, and Leon Derczynski. The Catalog Problem: Clustering and Ordering Variable-Sized Sets. In International Conference on Machine Learning (ICML), 2023. [ bib | DOI | .pdf ] Cong Wei, Brendan Duke, Ruowei Jiang, Parham Aarabi, Graham Taylor, and Florian Shkurti. Sparsifiner: Learning Sparse Instance-Dependent Attention for Efficient Vision Transformers. In Conference on Computer Vision and Pattern Recognition (CVPR), 2023. [ bib | arXiv | GitHub | http ] Angus Galloway, Anna Golubeva, Mahmoud Salem, Mihai Nica, Yani Ioannou, and Graham Taylor. Bounding generalization error with input compression: An empirical study with infinite-width networks. Transactions on Machine Learning Research (TMLR), 2022. [ bib | arXiv ] Rylee Thompson, Boris Knyazev, Elahe Ghalebi, Jungtaek Kim, and Graham Taylor. On evaluation metrics for graph generative models. In International Conference on Learning Representations (ICLR), 2022. [ bib | arXiv | GitHub ] Group Members Researchers and Postdocs Iuliia Eyriay Kevin Kasa Scott Lowe PhD Students Nathan Grewal Michal Lisicki Master's Students Tiancheng Gao Mohamed Mostafa Vivian Phung John Quinto Former Group Members Researchers and Postdocs Maya Aaram (co-founded Deep Biologics) Mohammed Adnan (now PhD at U Calgary/Vector Inst) Weiguang (Gavin) Ding (now at Borealis AI) Dylan Drover (now at Amazon Lab 126) Elahe Ghalebi (now at Metaverse Mind Lab) Ethan Jackson (now at ChainML) Nate Lesperance Fan Li He Ma (now at Scotiabank) Dhanesh Ramachandram (now at Vector Institute) Jon Schneider (now at York University) (co-advised with Joel Levine) Stefan Schneider (co-advised with John Fryxell and Stefan Kremer) Eric Taylor (now at TD Layer 6) Kenyon Tsai PhD Students Carolyn Augusta (now at U of Saskatchewan) (co-advised with Rob Deardon) Terrance DeVries (now at Luma AI) Ahmed Elshamli (now at Planitar Inc.) (co-advised with Shawki Areibi) Angus Galloway (now an Independent Researcher) (co-advised with Medhat Moussa) Boris Knyazev (now at Samsung SAIT AI lab) Devinder Kumar (now at TD Layer 6) (co-advised with Alex Wong) Kristina Kupferschmidt (now at UPEI) Natalia Neverova (now at FAIR [Meta]) (co-advised with Christian Wolf) Eu Wern Teh (now at LG AI Research) Master's Students Ammar Abu-Leil (now at Sonova Group) (co-advised with Medhat Moussa) Adam Balint (now at NOUL Co., Ltd.) Colin Brennan (now at Cognitive Systems Corp.) (co-advised with Petros Spachos) Ethan Buchman (now at the Interchain Foundation) Nolan Dey (now at Cerebras Systems) (co-advised with Bryan Tripp and Alex Wong) Brendan Duke (now at Modular) Shamak Dutta (now PhD at U Waterloo) (co-advised with Bryan Tripp) Alaa El-Nouby (now at Apple) (co-advised with Rozita Dara) Sara El-Shawa (now at Inari Agriculture) Mahmoud Gamal (now at Cerebras) Akshita Gupta (now at TU Darmstadt) Anton Naim Ibrahim (now at Xanadu) Daniel (Jiwoong) Im (now PhD at NYU) Kevin Kasa Jesse Knight (now PhD at U Toronto) (co-advised with April Khademi) Griffin Lacey (now at NVIDIA) (co-advised with Shawki Areibi) Jan Rudy (now at Kindred AI) Nikhil Sapru (now at TD Layer 6) Shashank Shekhar (now at FAIR [",
  "content_length": 10209,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:34"
}