{
  "name": "Gramoz Goranci",
  "homepage": "https://sites.google.com/view/ggoranci",
  "status": "success",
  "content": "Gramoz GoranciSearch this siteEmbedded FilesSkip to main contentSkip to navigationgramoz.goranci@univie.ac.atOffice: 6.32University  of ViennaGramoz Goranci Währinger Str. 291090 ViennaAustriaGramoz GoranciAbout me:I'm an assistant professor (tenure-track) of algorithms at the University of Vienna. I'm a member of the Research Group Theory and Applications of Algorithms and a board member at the Research Network Data Science. Prior to that, I was an advanced fellow in the Institute for Theoretical Studies, ETH Zürich, held a lectureship at the University of Glasgow, and did a PostDoc at CS Theory Group, University of Toronto, working with Sushant Sachdeva. I completed a PhD in Computer Science at the University of Vienna, where I was fortunate to have Monika Henzinger as my adviser (CV).  Research Interests:I am broadly interested in algorithm design, and its connections to optimization, graph theory, and machine learning. Much of my research has centered around the design of fast dynamic algorithms for classic and novel large-scale optimization problems with both theoretical guarantees and practical efficiency.  My work brings together tools from many areas such as combinatorial data structures, algorithmic graph theory, numerical linear algebra, and metric embeddings. Advising: I’m very fortunate to learn from the following amazing team members:Peter Kiss (PostDoc, 2025 --) supported by an independent FWF ESPRIT grant Eva Szilagyi (PhD, 2023--)Ali Momeni Mohammadabadi (PhD, 2023--)Sricharan A.R. (PhD, 2023--, co-advised with Monika Henzinger)News: Two papers accepted to SODA 2026: \"Dynamic Hierarchical j-Tree Decomposition and Its Applications\" and \"Tree Embedding in High Dimensions: Dynamic and Massively Parallel\". Congrats to Eva and Ali on their first SODA papers!Our paper \"Nested Dissection Meets IPMs: Planar Min-Cost Flow in Nearly-Linear Time\" has been accepted to the Journal of ACM.I'm on the program committee of ITCS 2026, ICALP 2026, and SWAT 2026.Together with my colleague Kathrin Hanauer, we have been awarded the \"Univie Teaching Award 2025\" for the course on \"Algorithms and Data Structures 2\".Our paper \"Fully Dynamic Algorithms for Chamfer Distance\" has been accepted to NeurIPS 2025.One paper accepted to ICML 2025: \"Fully Dynamic Euclidean Bi-Chromatic Matching in Sublinear Update Time\" (spotlight, selected for ORAL presentation, top ~1%); see also here for a news announcement. Two papers accepted to ICALP 2025: \"Incremental Approximate Maximum Flow via Residual Graph Sparsification\" and \"Fully Dynamic Algorithms for Transitive Reduction\".I'm on the program committee of SOSA & ICALP 2025.One paper accepted to FOCS 2024: \"Near-Optimal (1 + ε)-Approximate Fully-Dynamic All-Pairs Shortest Paths in Planar Graphs\".One paper accepted to ICML 2024: \"Dynamic Facility Location in High Dimensional Euclidean Spaces\" (accepted as 'Spotlight').One paper accepted to ITCS 2024: \"Electrical Flows for Polylogarithmic Competitive Oblivious Routing\".Two papers accepted to SODA 2024: \"Fast Algorithms for Structured Linear Programs\" and \"Dynamic Algorithms for k-center on Graphs\"I'm a long-term participant at UC Berkeley's Simons Institute program in Data Structures and Optimization for Fast AlgorithmsI'm on the program committee of \"Scandinavian Symposium on Algorithm Theory (SWAT) 2024\".One paper accepted to ESA 2023:  \"Bootstrapping Dynamic Distance Oracles\".One paper accepted to ICALP 2023: \"Efficient Data Structures for Incremental Exact and Approximate Maximum Flow\", extending the paper \"Incremental Approximate Maximum Flow in m^{1/2+o(1)} update time\".One paper accepted to SODA 2023: \"Fully Dynamic Exact Edge Connectivity in Sublinear Time\".I am on the program committee of ACM-SIAM Symposium on Discrete Algorithms (SODA) 2023.Two papers accepted to SODA 2022: \"Nested Dissection meets IPMs: Planar Min-Cost Flow in Nearly Linear Time\" and \"Universally-Optimal Distributed Distributed Shortest Paths and Transshipment via Graph-Based L1-Oblivious Routing\".One paper accepted to FOCS 2021: \"Minor Sparsifiers and the Distributed Laplacian Paradigm\".I am on the program committee of European Symposium on Algorithms (ESA) 2022 Track B.I am on the program committee of SIAM Symposium on Algorithm Engineering and Experiments (ALENEX) 2022.One paper accepted to KDD 2021: \"Local Algorithms for Estimating Effective Resistance\".I will give a talk at the DIMAP Seminar, University of Warwick on May 24, 2021.I will give a talk at the ETH Zurich Algorithms & Complexity Seminar on May 13, 2021.In April 2021, I gave a (virtual) talk at Google Research (Mountain View).I will be on the program committee of European Symposium on Algorithms (ESA) 2021 Track A.New paper on ArXiv: \"Minor Sparsifiers and the Distributed Laplacian Paradigm\".Two papers accepted to SODA 2021: \"The Expander Hierarchy and its Applications to Dynamic Graph Algorithms\" and \"Dynamic Maintenance of Low-Stretch Probabilistic Tree Embeddings with Applications\".One paper accepted to ALENEX 2021: \"Fully Dynamic k-Center Clustering in Doubling Metrics\".Paper \"Fast Dynamic Cuts, Distances and Effective Resistances via Vertex Sparsifiers\" was accepted to FOCS 2020. The paper \"Faster Graph Embeddings via Coarsening\" was accepted to ICML  2020. I gave a keynote talk at the AlgPie by IGAFIT workshop in October 2019. Two papers I co-authored were accepted to STOC 2019.PublicationsNear-Optimal (1+ε)-Approximate Fully-Dynamic All-Pairs Shortest Paths in Planar Graphs [pdf] (with Arnold Filtser,  Neel Patel, Maximilian Probst Gutenberg)In Proceedings of the 65th Annual Symposium on Foundations of Computer Science (FOCS), 2024Dynamic Facility Location in High Dimensional Euclidean Spaces [pdf] (with  Sayan Bhattacharya,  Shaofeng H.-C. Jiang, Yi Qian, Yubo Zhang)In Proceedings of the 41st International Conference on Machine Learning  (ICML), 2024Electrical Flows for Polylogarithmic Competitive Oblivious Routing [pdf] (with Monika Henzinger, Harald Räcke, Sushant Sachdeva, A. R. Sricharan)In Proceedings of the 15th Innovations in Theoretical Computer Science Conference (ITCS), 2024Dynamic algorithms for k-center on graphs [pdf] (with Emilio Cruciani, Sebastian Forster, Yasamin Nazari, Antonis Skarlatos)In Proceedings of the 34th ACM-SIAM Symposium on Discrete Algorithms (SODA), 2024Fast Algorithms for Separable Linear Programs [pdf]  (with  Sally Dong,  Lawrence Li,  Sushant Sachdeva,  Guanghao Ye)In Proceedings of the 34th ACM-SIAM Symposium on Discrete Algorithms (SODA), 2024Fully Dynamic Algorithms for Euclidean Steiner Tree [pdf] (with T.-H. Hubert Chan,  Shaofeng H.-C. Jiang , Bo Wang, Quan Xue)In Proceedings of the 18th International Conference and Workshops on Algorithms and Computation (WALCOM), 2024Bootstrapping Dynamic Distance Oracles [pdf] (with Sebastian Forster, Yasamin Nazari, Antonis Skarlatos)In Proceedings of the 31st European Symposium on Algorithms (ESA), 2023Efficient Data Structures for Incremental Exact and Approximate Maximum Flow [pdf] (with Monika Henzinger)In Proceedings of the 50th International Colloquium on Automata, Languages, and Programming  (ICALP), 2023Fully Dynamic Exact Edge Connectivity in Sublinear Time [pdf] (with Monika Henzinger, Danupon Nanongkai, Thatchaphol Saranurak, Mikkel Thorup, Christian Wulff-Nilsen)In Proceedings of the 33rd ACM-SIAM Symposium on Discrete Algorithms (SODA), 2023Nested Dissection meets IPMs: Planar Min-Cost Flow in Nearly Linear Time [pdf] (with Sally Dong, Yu Gao, Yin Tat Lee, Richard Peng, Sushant Sachdeva, Guanghao Ye) In Proceedings of the 32nd ACM-SIAM Symposium on Discrete Algorithms (SODA), 2022Universally-Optimal Distributed Shortest Paths and Transshipment via Graph-Based L1-Oblivious Routing [pdf] (with Bernhard Haeupler, Xiaorui Sun, Mingquan Ye, Goran Zuzic)In Proceedings of the 32nd ACM-SIAM Symposium on Discrete Algorithms (SODA), 2022Minor Sparsifiers and the Distributed Laplacian Paradigm [pdf] (with Sebastian Forster, Yang P. Liu, Richard Peng, Xiaorui Sun, Mingquan Ye)In Proceedings of the 62nd Annual Symposium on Foundations of Computer Science (FOCS), 2021Local Algorithms for Estimating Effective Resistance [pdf] (with Daniel Lopatta, Pan Peng, Yuichi Yoshida)In Proceedings of the 27th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining (KDD), 2021The Expander Hierarchy and its Applications to Dynamic Graph Algorithms [pdf] (with Harald Räcke , Thatchaphol Saranurak, Zihan Tan)In Proceedings of the 31st ACM-SIAM Symposium on Discrete Algorithms (SODA), 2021Dynamic Maintenance of Low-Stretch Probabilistic Tree Embeddings with Applications [pdf] (with Sebastian Forster, Monika Henzinger)In Proceedings of the 31st ACM-SIAM Symposium on Discrete Algorithms (SODA), 2021Fully Dynamic k-Center Clustering in Doubling Metrics [pdf] (with Monika Henzinger, Dariusz Leniowski, Christian Schulz,  Alexander Svozil)In Proceedings of the 14th SIAM Symposium on Algorithm Engineering and Experimentation (ALENEX), 2021Fast Dynamic Cuts, Distances and Effective Resistances via Vertex Sparsifiers [pdf] (with Li Chen, Monika Henzinger, Richard Peng, Thatchaphol Saranurak)In Proceedings of the 61st IEEE Symposium on Foundations of Computer Science (FOCS), 2020Faster Graph Embeddings via Coarsening [pdf] (with Matthew Fahrbach, Richard Peng, Sushant Sachdeva and Chi Wang) In Proceedings of the 37th International Conference on Machine Learning  (ICML), 2020Fully Dynamic Vertex Spectral Sparsifiers and Applications [pdf] (with David Durfee, Yu Gao, Richard Peng) In Proceedings of the 51st ACM Symposium on the Theory of Computing (STOC), 2019Dynamic Low-Stretch Trees via Dynamic Low-Diameter Decompositions [pdf] (with Sebastian Forster) In Proceedings of the 51st ACM Symposium on the Theory of Computing (STOC), 2019A Tree Structure For Dynamic Facility Location [pdf] (with Monika Henzinger, Dariusz Leniowski )In Proceedings of the 26th European Symposium on Algorithms (ESA), 2018Dynamic Effective Res",
  "content_length": 11934,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:34"
}