{
  "name": "Grant Ho",
  "homepage": "https://cs.uchicago.edu/people/grant-ho",
  "status": "success",
  "content": "Grant Ho – Department of Computer Science Skip to content Contact Info Email grantho@uchicago.edu Website https://people.cs.uchicago.edu/~grantho/ Office JCL 255 Grant’s research studies computer security, with a particular interest in problems at the intersection of data and security. His recent work focuses on improving the security of enterprises, which includes developing new algorithms and systems to thwart attacks (e.g., phishing, ransomware, and data breaches), and conducting large-scale analyses to better understand emerging threats as well as the costs and burdens of deploying security measures. Prior to joining the University of Chicago, Grant was a CSE Postdoctoral Fellow at UC San Diego and a Visiting Researcher at Corelight. Grant received his PhD in computer science from UC Berkeley and his bachelor’s degree in computer science from Stanford University. His research has been recognized with three distinguished paper awards across the top security conferences, an NSF Graduate Research Fellowship, a Facebook PhD Fellowship, and the 2017 Internet Defense Prize. Focus Areas: Security and Privacy, Machine Learning for Security, Data Science, Systems and Networking, Large-scale Measurement Research AI & Machine Learning Foundations and applications of computer algorithms making data-centric models, predictions, and decisions Security & Privacy Understanding and defending against emerging threats in our increasingly computational world Systems, Architecture & Networking Design and analysis of computing systems: cloud, edge, Internet, quantum, and beyond Awards & Honors 2023 Best paper award, IEEE Eurp S&P 2019 Distinguished paper award, USENIX Security Symposium 2017 Distinguished paper award, USENIX Security Symposium Internet Defense Prize 2016 NSF Graduate Research Fellowship Facebook PhD Fellowship 2015 Distinguished practical paper award IEEE S&P arrow-down-largearrow-left-largearrow-right-large-greyarrow-right-large-yellowarrow-right-largearrow-right-smallbutton-arrowclosedocumentfacebookfacet-arrow-down-whitefacet-arrow-downPage 1CheckedCheckedicon-apple-t5backgroundLayer 1icon-google-t5icon-office365-t5icon-outlook-t5backgroundLayer 1icon-outlookcom-t5backgroundLayer 1icon-yahoo-t5backgroundLayer 1internal-yellowinternalintranetlinkedinlinkoutpauseplaypresentationsearch-bluesearchshareslider-arrow-nextslider-arrow-prevtwittervideoyoutube",
  "content_length": 2394,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:36"
}