{
  "name": "Greet Vanden Berghe",
  "homepage": "https://www.kuleuven.be/wieiswie/en/person/00053376",
  "status": "success",
  "content": "KU Leuven who's who - Greet Vanden Berghe Surname: First name: Advanced search More information Which data - who can change them? Organisational chart Greet Vanden Berghe mailShow e-mail Numerical Analysis and Applied Mathematics (NUMA), Ghent and Aalst Campuses Gebroeders De Smetstraat 1 9000 Gent KU Leuven map phoneShow phone numbers Unit Numerical Analysis and Applied Mathematics (NUMA), Ghent and Aalst Campuses Belongs to (according to the corporate view): Department of Computer Science Functions full professor Faculty of Engineering Technology contact person of Numerical Analysis and Applied Mathematics (NUMA), Ghent and Aalst Campuses head of the Subdivision Combinatorial Optimisation and Decision Support, Ghent and Aalst Campuses member of Leuven.AI - KU Leuven Institute for Artificial Intelligence member of LIM - KU Leuven Institute for Mobility add council, programme committee and network memberships member (as senior academic staff) of the Council of the Faculty of Engineering Technology member of the Faculty of Engineering Technology Evaluation Committee member (as senior academic staff) of the Computer Science Department Council Curriculum Vitae About me Research Teaching http://orcid.org/0000-0002-0275-5568 Research topics Projects Publications Operational research: combinatorial optimisation: modelling and algorithm development, focus on industrial combinatorial optimisation problems Approaches: mathematical programming, heuristics, meta-heuristics, matheuristics, , decomposition approaches, especially focusing on the development of solvers addressing industrial problems Domains: logistics, maritime logistics, production, health care Applications: automated personnel scheduling, nurse rostering, home care scheduling, timetabling, vehicle routing, production scheduling, project scheduling, cutting and packing, warehouse operations, pickup and delivery, lock and terminal scheduli Recent projects Location optimization of charging infrastructure for electric trucks (21/08/2025 - 21/08/2029) - Promotor MoVeRS: towards a Modular Vehicle Routing Solver framework (01/03/2025 - 28/02/2027) - Promotor Sabbatical Greet Vanden Berghe: Vehicle routing with time-dependent travel times (09/09/2024 - 08/02/2025) - Promotor Intelligent algorithms for scheduling optimization (01/09/2024 - 31/08/2026) - Promotor Intelligente algoritmen voor planningsoptimalisatie (23/08/2024 - 23/08/2028) - Promotor Fairness in Allocation Problems (23/10/2023 - 23/10/2027) - Promotor Human-centred decision support based on new theory for personnel rostering (01/10/2023 - 30/09/2027) - Promotor Trustworthy and insightful algorithms for industrial decision making (29/09/2023 - 29/09/2027) - Promotor Algorithms for human-centered operational planning (19/09/2023 - 19/09/2027) - Promotor Optimizing the location of electric vehicle charging stations on the low-voltage network (03/11/2022 - 14/11/2026) - Promotor Full projects list in the research portal Recent publications launch Ceschia, S., Rosati, R.M., Schaerf, A., Smet, P., Vanden Berghe, G., Zanazzo, E. (2025). The Integrated Healthcare Timetabling competition 2024. Operations research, data analytics and logistics, 45, Art.No. 200481. doi: 10.1016/j.ordal.2025.200481 via repository launch Gardeyn, J., Wauters, T. (sup.), Vanden Berghe, G. (cosup.) (2025). Simple, Flexible, and Open-Source 2D Cutting & Packing Algorithms. via repository launch Doneda, M., Smet, P., Carello, G., Lanzarone, E., Vanden Berghe, G. with Doneda, M. (corresp. author) (2025). Robust personnel rostering: How accurate should absenteeism predictions be? Journal Of Scheduling. doi: 10.1007/s10951-025-00858-9 launch Gardeyn, J., Vanden Berghe, G., Wauters, T. (2025). Decoupling Geometry from Optimization in 2D Irregular Cutting and Packing Problems: an Open-Source Collision Detection Engine. Informs Journal On Computing. doi: 10.1287/ijoc.2024.1025 launch Coulier, B., Çalik, H., Becker, T., Vanden Berghe, G. (2025). A rollout strategy for electric vehicle charging stations in urban European environments: ensuring long-term sustainability. European Journal Of Operational Research, 1-35. doi: 10.1016/j.ejor.2025.08.024 launch Ozcan, E., De Causmaecker, P., Vanden Berghe, G., Goossens, D. with Ozcan, E. (corresp. author) (2025). Preface: the practice and theory of automated timetabling (2022). JOURNAL OF SCHEDULING, 28 (2), 157-158. doi: 10.1007/s10951-024-00830-z via repository launch De Walsche, N., Vanden Berghe, G., Smet, P. (2025). An efficient algorithm for the truck driver scheduling problem. Presented at the Joint ORBEL-NGB Conference, Maastricht. launch De Walsche, N., Vanden Berghe, G., Smet, P. (2024). An efficient algorithm for the truck driver scheduling problem. Presented at the PATAT Conference 2024, Copenhagen. launch Smet, P., Doneda, M., Carello, G., Lanzarone, E., Vanden Berghe, G. (2024). Predicting employee absenteeism to generate robust rosters. (293-296). Presented at the PATAT Conference 2024, Copenhagen, Denmark, 28 Aug 2024-30 Aug 2024. launch Ceschia, S., Rosati, R.M., Schaerf, A., Smet, P., Vanden Berghe, G., Zanazzo, E. (2024). The Integrated Healthcare Timetabling Competition 2024 — Problem description and rules —. In: Proceedings of the 14th International Conference on the Practice and Theory of Automated Timetabling, (52-65). Presented at the PATAT Conference 2024, Copenhagen, Denmark, 28 Aug 2024-30 Aug 2024. ISBN: 978-0-9929984-6-2. via repository All publications Search publication JPI311 Geavanceerde optimalisatietechnieken JPI0XF Informatica JPI30Y Optimalisatietechnieken JPI30V Algoritmen voor beslissingsondersteuning JPI30X Artificiële intelligentie JPI312 Software-simulatie JPI15G Systeem- en netwerkbeheer YI1549 Symbolische artificiële intelligentie About me http://orcid.org/0000-0002-0275-5568 Research Research topics Operational research: combinatorial optimisation: modelling and algorithm development, focus on industrial combinatorial optimisation problems Approaches: mathematical programming, heuristics, meta-heuristics, matheuristics, , decomposition approaches, especially focusing on the development of solvers addressing industrial problems Domains: logistics, maritime logistics, production, health care Applications: automated personnel scheduling, nurse rostering, home care scheduling, timetabling, vehicle routing, production scheduling, project scheduling, cutting and packing, warehouse operations, pickup and delivery, lock and terminal scheduli Projects Recent projects Location optimization of charging infrastructure for electric trucks (21/08/2025 - 21/08/2029) - Promotor MoVeRS: towards a Modular Vehicle Routing Solver framework (01/03/2025 - 28/02/2027) - Promotor Sabbatical Greet Vanden Berghe: Vehicle routing with time-dependent travel times (09/09/2024 - 08/02/2025) - Promotor Intelligent algorithms for scheduling optimization (01/09/2024 - 31/08/2026) - Promotor Intelligente algoritmen voor planningsoptimalisatie (23/08/2024 - 23/08/2028) - Promotor Fairness in Allocation Problems (23/10/2023 - 23/10/2027) - Promotor Human-centred decision support based on new theory for personnel rostering (01/10/2023 - 30/09/2027) - Promotor Trustworthy and insightful algorithms for industrial decision making (29/09/2023 - 29/09/2027) - Promotor Algorithms for human-centered operational planning (19/09/2023 - 19/09/2027) - Promotor Optimizing the location of electric vehicle charging stations on the low-voltage network (03/11/2022 - 14/11/2026) - Promotor Full projects listin the research portal Publications Recent publications launch Ceschia, S., Rosati, R.M., Schaerf, A., Smet, P., Vanden Berghe, G., Zanazzo, E. (2025). The Integrated Healthcare Timetabling competition 2024. Operations research, data analytics and logistics, 45, Art.No. 200481. doi: 10.1016/j.ordal.2025.200481 via repository launch Gardeyn, J., Wauters, T. (sup.), Vanden Berghe, G. (cosup.) (2025). Simple, Flexible, and Open-Source 2D Cutting & Packing Algorithms. via repository launch Doneda, M., Smet, P., Carello, G., Lanzarone, E., Vanden Berghe, G. with Doneda, M. (corresp. author) (2025). Robust personnel rostering: How accurate should absenteeism predictions be? Journal Of Scheduling. doi: 10.1007/s10951-025-00858-9 launch Gardeyn, J., Vanden Berghe, G., Wauters, T. (2025). Decoupling Geometry from Optimization in 2D Irregular Cutting and Packing Problems: an Open-Source Collision Detection Engine. Informs Journal On Computing. doi: 10.1287/ijoc.2024.1025 launch Coulier, B., Çalik, H., Becker, T., Vanden Berghe, G. (2025). A rollout strategy for electric vehicle charging stations in urban European environments: ensuring long-term sustainability. European Journal Of Operational Research, 1-35. doi: 10.1016/j.ejor.2025.08.024 launch Ozcan, E., De Causmaecker, P., Vanden Berghe, G., Goossens, D. with Ozcan, E. (corresp. author) (2025). Preface: the practice and theory of automated timetabling (2022). JOURNAL OF SCHEDULING, 28 (2), 157-158. doi: 10.1007/s10951-024-00830-z via repository launch De Walsche, N., Vanden Berghe, G., Smet, P. (2025). An efficient algorithm for the truck driver scheduling problem. Presented at the Joint ORBEL-NGB Conference, Maastricht. launch De Walsche, N., Vanden Berghe, G., Smet, P. (2024). An efficient algorithm for the truck driver scheduling problem. Presented at the PATAT Conference 2024, Copenhagen. launch Smet, P., Doneda, M., Carello, G., Lanzarone, E., Vanden Berghe, G. (2024). Predicting employee absenteeism to generate robust rosters. (293-296). Presented at the PATAT Conference 2024, Copenhagen, Denmark, 28 Aug 2024-30 Aug 2024. launch Ceschia, S., Rosati, R.M., Schaerf, A., Smet, P., Vanden Berghe, G., Zanazzo, E. (2024). The Integrated Healthcare Timetabling Competition 2024 — Problem description and rules —. In: Proceedings of the 14th International Conference on the Practice and Theory of Automated Timetabling, (52-65). Presented at the PATAT Conference 2",
  "content_length": 10485,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:36"
}