{
  "name": "Greg Hager",
  "homepage": "http://www.cs.jhu.edu/~hager",
  "status": "success",
  "content": "Gregory Hager Skip to content Gregory D. Hager Mandell Bellmore Professor of Computer Science at Johns Hopkins University Gregory D. Hager is the Mandell Bellmore Professor of Computer Science at Johns Hopkins University, and holds joint appointments in the Department of Electrical and Computer Engineering and the Department of Mechanical Engineering. Hager is known for his research on collaborative and vision-based robotics, time-series analysis of image data, and medical applications of image analysis and robotics. He has published more than 300 articles and books on these topics. Hager is the founding director of the Johns Hopkins Malone Center for Engineering in Healthcare, an interdisciplinary research center aimed at developing innovative healthcare technology and systems. Hager’s many contributions to the field of vision-based robotics has earned him status as an IEEE Fellow. Additionally, he has been named a Fellow of the MICCAI Society, the Association of Computing Machinery (ACM), the American Institute for Medical and Biological Engineering (AIMBE), and the American Association for the Advancement of Science (AAAS). In 2014, he was awarded a Hans Fischer Fellowship at the Technical University of Munich’s Institute of Advanced Study, where he also holds an appointment in computer science. Hager also is a co-founder of two startups: Clear Guide Medical, whose groundbreaking platform enables doctors and technicians to perform more accurate ultrasound-guided procedures, and Ready Robotics, dedicated to making industrial robots easier to use. Hager received his BA in mathematics and computer science (summa cum laude) at Luther College (1983), and his MS (1986) and PhD (1988) from the University of Pennsylvania. He was a Fulbright Fellow at the University of Karlsruhe, and was on the faculty of Yale University prior to joining Johns Hopkins in 1999. He has served as the deputy director of the NSF Engineering Research Center for Surgical Systems and Technology, and as chair of the Department of Computer Science from 2010-2015. Curriculum Vitae RESEARCH Hager’s lab, the Computational Interaction and Robotics Lab (CIRL), studies problems that involve dynamic, spatial interaction at the intersection of imaging, robotics, and human-computer interaction. As a leader in the development of algorithms for real-time computer vision and their uses for robotics, Hager’s work offers novel applications for automated surgical training, medical imaging and diagnostics, and computer-enhanced interventional medicine. CIRL is associated with the NSF Engineering Research Center for Computer-Integrated Surgical Systems and Technology (ERC-CISST) and the Laboratory for Computational Sensing and Robotics (LCSR). To learn more about Dr. Hager's research and current projects, visit the CIRL website. PUBLICATIONS Google Scholar TEACHING 600.461 - Computer Vision 600.336 - Algorithms for Sensor-Based Robotics 600.226 - Data Structures EN.601.482 - Machine Learning: Deep Learning SERVICE Hager has been a member of numerous prominent review committees and panels on Artificial Intelligence (AI), including Stanford University’s inaugural “100 Year Study on Artificial Intelligence”; a roundtable on AI and foreign policy held by the National Academies of Science, Engineering, and Medicine; and a panel at the 2018 AAAS annual meeting on “Artificial Intelligence: Augmenting Not Replacing People.” He co-chaired the 2015 review of the Networking and Information Technology Research and Development Program for the President’s Council of Advisors on Science and Technology (PCAST). He is a member of the National Science Foundation’s Computer and Information Science and Engineering (CISE) advisory committee, a member of the governing board of the International Federation of Robotics Research, and is chair emeritus of the Computing Community Consortium, as well as a board member of the Computing Research Association. He has served on the editorial boards of IEEE TRO, IEEE PAMI, and IJCV. Roundtable on AI and Foreign Policy: National Academies, Oct. 2016. NSF Computer and Information Science and Engineering Advisory Committee (CISE AC), 2016-present AI-100 Inaugural Study Panel Member, 2015 National Academies Panel on Mechanical Science and Engineering at the Army Research Laboratory, 2015 Co-Chair, Biannual NITRD Review Subcommittee, 2015 Steering Committee, AAAS Information, Computing, and Communication (T) Section, 2014-2016 Chair, Computing Community Consortium (CCC) Council, 2014-2016 Vice Chair, Computing Community Consortium (CCC) Council, 2013-2014 International Advisory Committee, Conference on Computer Vision in Remote Sensing, 2012-present International Federation of Robotics Research (IFRR) Board, 2012-present Computing Community Consortium (CCC) Council Member, 2011-present Chair, Computer and Robot Vision Technical Committee of the IEEE Robotics and Automation Society, 1996-2000 LATEST NEWS BIOMEDigital is a two-day free virtual event for the biomed industry, and took place November 4-5, 2020. Expert-led sessions focused on topics like digital health, surgical robotics, and 3D printing. Hager participated in the event’s medical robotics panel, “How Research Efforts are Changing the way Medtech uses Robotics.” Other panelists included Russell Taylor from […] Read More The Symposium on Artificial Intelligence for Learning Health Systems (SAIL) is a new annual international conference exploring the integration of artificial intelligence (AI) techniques into clinical medicine. SAIL provides a forum for clinicians, clinical informaticians and AI researchers to discuss approaches and challenges to using these approaches in the healthcare domain. Originally planned as a 3-day […] Read More Robots often take on tasks too risky for humans to perform, such as cleaning up radioactive waste or replacing responders in dangerous search and rescue missions. The global pandemic is no exception. Robots are being used to perform tasks that would normally put health care workers at risk of infection; in hospitals, robotic systems […] Read More Posts navigation1 2 See all news >> CONTACT OFFICE HOURS I have no scheduled office hours but you can stop by any time. If you want a guaranteed time, contact me. APPOINTMENTS Tracy Marshall tmarshall@jhu.edu (410) 516-5821 LOCATION Malone Hall 341 Johns Hopkins University 3400 N. Charles St Baltimore, MD 21211 SEND ME AN EMAIL Your Name Your Email Subject Message Contact Me Scroll to top",
  "content_length": 6507,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:40"
}