{
  "name": "Greg Hamerly",
  "homepage": "https://cs.baylor.edu/~hamerly",
  "status": "success",
  "content": "Greg Hamerly Greg Hamerly Professor Hankamer 330.43 Computer Science Department Baylor University One Bear Place #97141 Waco, TX 76798-7141, USA Phone: +1-254-710-6846 Fax: +1-254-710-3889 Email: greg_hamerly at baylor dot edu I am a professor of computer science at Baylor University in Waco, Texas. From 2022 until 2025 I served as the interim chair of the department. On this webpage you can find more information about my research, teaching, schedule, publications, funding, and other things. Here is my Google Scholar page and my ORCID. Research Download our free app for automatically detecting white-eye in photos! White-eye in young children can be a symptom of retinoblastoma as well as other diseases. My research is in machine learning, a sub-field of artificial intelligence. Some of the projects I'm involved in are: Detecting, enumerating, and estimating vitality of invasive species in aquatic environments. In particular, detecting Dreissenid (Zebra, Quagga mussels) using microscopic video and machine learning. Automatically detecting and classifying leukocoria of the pupil in the eye from natural images. This is for early detection of negative conditions such as Retinoblastoma. Unsupervised learning methods (clustering, primarily), and improving algorithms like k-means to be faster, give better-quality results, or to act more intelligently (such as by finding the number of clusters). Applying machine learning to the task of optimizing computer program simulation, in the SimPoint project. Mixtures of naive Bayes models in unsupervised learning, for the detection of failures in hard drives. Here is my NSF-funded research in developing a novel curriculum in computational thinking. Here is my curriculum vitae, here are my publications, and here is my Ph.D. thesis. Teaching CourseNameLinks CSI/STA 2300 Intro to Data Science S21 CSI 3334 Data structures and algorithms F25, S24, F23, S23, S22, F21, S21, F20, S20, F19, S19, F18, F17, F16, F15, F14, F13, F11, S11, F10, S10, F09, S09, F08, S08, F07, S07, F06, S06, F05, F04 CSI 4144 Competitive learning I/II/III F22, S22, F21, S21, F20, S20, F19, S19, F18, F17, S17, F16, S16, F15, S15, F14, S14, F13, S13, F12, S12, S11, F10, S10, F08, S08, F07, S07, F06, S06, F05 CSI 4330 Foundations of Computing F25, F24 F12 CSI 5310 (formerly 4336) Introduction to Computation Theory F25, F24, F22, F21, F20, F19, F18, F17, F16, F15, F14, F13, F12, F11, F10, F09, F08, F07, F06, F05 CSI 5010 Graduate Seminar (jointly held with 4010) F14, F13, F12, F11 CSI 5325 Introduction to Machine Learning S25, S23, S22, S20, S19, S18, S17, S16, S15, S14, S13, S12, S11, S10, S09, S08, S07, S06, S05 Schedule and Office Hours My office hours for Fall 2025 are: Monday, Wednesday, and Friday from 09:00-10:00. You do not need to make an appointment to attend my office hours. If you cannot attend my office hours, you may make an appointment for another time. To make an appointment for a meeting outside of my office hours, please first consult my Outlook Calendar (linked below) and find a reasonable time (within business hours) that I am available. Then send me an Outlook Calendar invitation for meeting, preferably at least a day in advance of when you want to meet. Please schedule only the amount of time you think you'll need (e.g. 10-15 minutes for a student meeting). Student meetings and office hours are in my office, but could be online if you prefer (you may chat with me via Microsoft Teams). Due to my busy and changing schedule, some office hours may be delayed or cancelled without notice. Here is my Outlook Calendar that you can view in a separate page. It defaults to a monthly view; you can see more details by selecting a weekly / daily view. Publications Alibek Zhakubayev, Greg Hamerly. Beta k-Means: Accelerating k-Means Using Probabilistic Cluster Filtering. In 2024 IEEE 11th International Conference on Data Science and Advanced Analytics (DSAA), 2024. Alibek Zhakubayev, Greg Hamerly. Using Annealing to Accelerate Triangle Inequality k-means. In 2024 IEEE 11th International Conference on Data Science and Advanced Analytics (DSAA), 2024. Shaif Chowdhury, Sadia Nasrin Tisha, Mushfika Rahman, Greg Hamerly. Efficient Selective Pre-Training for Imbalanced Fine-Tuning Data in Transfer Learning. In 2024 IEEE International Conference on Big Data (BigData), 2024. Shaif Chowdhury, Aaron Carney, Greg Hamerly, Greg Speegle. ACFed: Communication-Efficient & Class-Balancing Federated Learning with Adaptive Consensus Dropout & Model Quantization. In 2024 IEEE International Conference on Big Data (BigData), 2024. Sadia Nasrin Tisha, Greg Hamerly. Contrastive Learning for Detecting Invasive Aquatic Species: An Analysis of SimCLR and Self-Supervised Methods with Unlabeled Video Data. In 2024 39th International Conference on Image and Vision Computing New Zealand (IVCNZ), 2024. Shaif Chowdhury, Greg Hamerly, Monica McGarrity. Active Learning Strategy Using Contrastive Learning and K-Means for Aquatic Invasive Species Recognition. In The Maritime Computer Vision Workshop of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2024. Micah Bowman, Ryan McManamay, Alejandro Rodriguez Perez, Greg Hamerly, William Arnold, Eric Steimle, Kurt Kramer, Bryan Norris, David Prangnell, Mike Matthews. Analysis of an optical imaging system prototype for autonomously monitoring zooplankton in an aquaculture facility. Aquacultural Engineering, Volume 104, 2024. Korn Sooksatra, Greg Hamerly, Pablo Rivas. Is ReLU Adversarially Robust?. Poster at the 2023 LatinX in AI Workshop at ICML; arXiv Preprint 2405.03777 2023. Shaif Chowdhury, Sadia Nasrin Tisha, Monica E. McGarrity, Greg Hamerly. Video-Based Recognition of Aquatic Invasive Species Larvae Using Attention-LSTM Transformer. In proceedings of the International Symposium on Visual Computing, 2023. Shaif Chowdhury, Greg Hamerly. Recognition of Aquatic Invasive Species Larvae using Autoencoder-based Feature Averaging. In proceedings of the International Symposium on Visual Computing, 2022. Alibek Zhakubayev, Greg Hamerly. Clustering Faster and Better with Projected Data. In proceedings of the 6th International Conference on Information System and Data Mining, 2022. [pdf] Micheal C. Munson, Devon L. Plewman, Katelyn M. Baumer, Ryan Henning, Collin T. Zahler, Alexander T. Kietzman, Alexandra A. Beard, Shizuo Mukai, Lisa Diller, Greg Hamerly, Bryan F. Shaw. Autonomous early detection of eye disease in childhood photographs In Science Advances, 2019. [web, pdf] Petr Ryšavý, Greg Hamerly. Geometric methods to accelerate k-means algorithms At SDM 2016, 2016. [pdf, supplementary graphs] Pablo Rivas-Perea, Erich Baker, Greg Hamerly, Bryan F Shaw. Detection of leukocoria using a soft fusion of expert classifiers under non-clinical settings. In BMC Opthamology, 2014. Greg Hamerly, Jonathan Drake. Accelerating Lloyd's algorithm for k-means clustering. Chapter in Partitional Clustering Algorithms (Springer), 2014. [pdf] Ryan Henning, Pablo Rivas-Perea, Bryan Shaw, Greg Hamerly. A Convolutional Neural Network Approach for Classifying Leukocoria. In proceedings of the 2014 Southwest Symposium on Image Analysis and Interpretation (SSIAI), April, 2014. [pdf] Pablo Rivas-Perea, Ryan Henning, Bryan Shaw, Greg Hamerly. Finding the Smallest Circle Containing the Iris in the Denoised Wavelet Domain. In proceedings of the 2014 Southwest Symposium on Image Analysis and Interpretation (SSIAI), April, 2014. [pdf] Katherine Talcott, Elizabeth Shaw, Rebecca Holden, Brandon Taylor, Erich Baker, Greg Hamerly, Alex Kentsis, Shizuo Mukai, Carlos Rodriguez-Galindo, Bryan Shaw Colorimetric Image Analysis in Detection of Leukocoria from Retinoblastoma in Snapshots Taken by Standard Digital Photography. Meeting Abstract. In Investigative Ophthalmology & Visual Science June 2013. Volume 54, Issue 15, Page 1584. Jonathan Drake, Greg Hamerly. Accelerated k-means with adaptive distance bounds. In OPT2012: the 5th NIPS Workshop on Optimization for Machine Learning, December, 2012. [pdf] William A. Booth, Greg Hamerly, David Sturgill, Ivy Hamerly, Todd Buras. Computational Thinking: Building a Model Curriculum In ACET Journal of Computer Education and Research, 2012. [pdf] Greg Hamerly, Erez Perelman, Timothy Sherwood, Brad Calder, Representative Sampling Using SimPoint. Chapter 10 in the book Processor and System-on-Chip Simulation, edited by Rainer Leupers and Olivier Temam; published by Springer, 2010. Greg Hamerly, Greg Speegle, Efficient Model Selection for Large-Scale Nearest-Neighbor Data Mining In proceedings of the 2010 British National Conference on Databases (BNCOD 2010), June 2010. [pdf] Greg Hamerly, Making k-means even faster In proceedings of the 2010 SIAM international conference on data mining (SDM 2010), April 2010. [pdf] Bing Yin, Greg Hamerly, Hierarchical Stability-Based Model Selection For Clustering Algorithms In proceedings of the International Conference on Machine Learning and Applications, December 2009. Joshua Johnston, Greg Hamerly, Improving SimPoint accuracy for small simulation budgets with EDCM clustering In proceedings of the Second workshop on Statistical and Machine learning approaches to ARchitectures and compilaTion (SMART '08), January 2008. [pdf] Erez Perelman, Jeremy Lau, Harish Patil, Aamer Jaleel, Greg Hamerly, Brad Calder, Cross Binary Simulation Points In Proceedings of the International Symposium on Performance Analysis of Systems and Software (ISPASS-2007) March 2007. [pdf] Yu Feng, Greg Hamerly, PG-means: learning the number of clusters in data. In proceedings of the twentieth annual conference on neural information processing systems (NIPS), December 2006. [ps, pdf] Greg Hamerly, Erez Perelman, Jeremy Lau, Timothy Sherwood, Brad Calder, Using Machine Learning to Guide Architecture Simulation. Journal of Machine Learning Research, Volume 7, Pages 343-378, 2006. [abstract, pdf] Greg Hamerly, Erez Perelman, Brad Calder, Comparing Multinomial and K-means clu",
  "content_length": 17191,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:43"
}