{
  "name": "Gregor Alexander Schiele",
  "homepage": "https://www.uni-due.de/es/en/en_gregor_schiele.php",
  "status": "success",
  "content": "Prof. Dr. Gregor Schiele Prof. Dr. Gregor Schiele Dr. Gregor Schiele is professor for embedded systems and leads since november 2014 the Intelligent Embedded Systems group at the University Duisburg-Essen at the campus Duisburg. Before that he was working from 2012 to 2014 at the Insight Centre for Data Analytics and the Digital Enterprise Research Institute (DERI) as well as at the National University of Ireland, Galway. From 2006 to 2012 he was working at the department of Prof. Dr. Christian Becker at the University Mannheim. He wrote his doctorate 2007 at the University Stuttgart at the department of Prof. Dr. Kurt Rothermel. The core of his current research interest consist of adaptive embedded systems as well as the Internet of Things. He has great interest in how embedded systems can be operated with as little maintenance as possible, in a cheap and reliable way over a long operation time of several years to decades by using three-dimensional environmental models and methods of artificial intelligence. Prof. Dr. rer. nat. Gregor Schiele Informatik / AI Address Bismarckstraße Duisburg Room BC 105 Phone +49 203 379 3620 Fax +49 203 379 5220 E-Mail gregor.schiele@uni-due.de Website https://www.uni-due.de/es/gregor_schiele_de Office hours nach Vereinbarung Functions Universitätsprofessor/in, Intelligente Eingebettete Systeme Stellv. Mitglied, Studienbeirat Mitglied, Prüfungsausschuss Angewandte Informatik - Schwerpunkt Ingenieur- und Medieninformatik (Bachelor/Master) Vorsitzender, Prüfungsausschuss Cyber Physical Systems (Master) Current lectures WiSe 2025 CPS-Labor Praktikum Embedded Systems Übung zu \"Embedded Systems\" Software Craftsmanship Übung zu \"Software Craftsmanship\" Jahreskolloquium der Lehrstühle VS und IES Internet of Things: Protocols and System Software - Informatik Entwurf von digitalen Hardware-Beschleunigern - Informatik Programmieren in C - Informatik Fortgeschrittene Programmiertechniken - Informatik Embedded Systems - Informatik Past lectures (max. 10) SoSe 2025 Internet of Things: Protocols and System Software CPS-Labor Praktikum Übung zu \"Programmieren in C\" Übung zu \"Internet of Things: Protocols and System Software\" Programmieren in C Internet of Things: Protocols and System Software - Informatik Embedded Systems - Informatik Seminar \"Eingebettetes Maschinelles Lernen\" Programmieren in C - Informatik WiSe 2024 Praxisprojekt \"KI-basierte Neurosignalverarbeitung\" The following publications are listed in the online university bibliography of the University of Duisburg-Essen. Further information may also be found on the person's personal web pages. Journal articles Ling, Tianheng; Qian, Chao; Klann, Theodor Mario; Hoever, Julian; Einhaus, Lukas; Schiele, Gregor Configurable Multi-Layer Perceptron-Based Soft Sensors on Embedded Field Programmable Gate Arrays : Targeting Diverse Deployment Goals in Fluid Flow Estimation In: Sensors, Vol. 25, 2025, Nr. 1, 83 DOI (Open Access) Qian, Chao; Ling, Tianheng; Cichiwskyj, Christopher; Schiele, Gregor Configuration-aware approaches for enhancing energy efficiency in FPGA-based deep learning accelerators In: Journal of Systems Architecture, Vol. 163, 2025, 103410 DOI (Open Access) Li, Jianning; Zhou, Zongwei; Yang, Jiancheng; Pepe, Antonio; Gsaxner, Christina; Luijten, Gijs; Qu, Chongyu; Zhang, Tiezheng; Chen, Xiaoxi; Li, Wenxuan; Wodzinski, Marek; Friedrich, Paul; Xie, Kangxian; Jin, Yuan; Ambigapathy, Narmada; Nasca, Enrico; Solak, Naida; Melito, Gian Marco; Vu, Viet Duc; Memon, Afaque R.; Schlachta, Christopher; De Ribaupierre, Sandrine; Patel, Rajnikant; Eagleson, Roy; Chen, Xiaojun; Mächler, Heinrich; Kirschke, Jan Stefan; De La Rosa, Ezequiel; Christ, Patrick Ferdinand; Li, Hongwei Bran; Ellis, David G.; Aizenberg, Michele R.; Gatidis, Sergios; Küstner, Thomas; Shusharina, Nadya; Heller, Nicholas; Andrearczyk, Vincent; Depeursinge, Adrien; Hatt, Mathieu; Sekuboyina, Anjany; Löffler, Maximilian T.; Liebl, Hans; Dorent, Reuben; Vercauteren, Tom; Shapey, Jonathan; Kujawa, Aaron; Cornelissen, Stefan; Langenhuizen, Patrick; Ben-Hamadou, Achraf; Rekik, Ahmed; Pujades, Sergi; Boyer, Edmond; Bolelli, Federico; Grana, Costantino; Lumetti, Luca; Salehi, Hamidreza; Ma, Jun; Zhang, Yao; Gharleghi, Ramtin; Beier, Susann; Sowmya, Arcot; Garza-Villarreal, Eduardo A.; Balducci, Thania; Angeles-Valdez, Diego; Souza, Roberto; Rittner, Leticia; Frayne, Richard; Ji, Yuanfeng; Ferrari, Vincenzo; Chatterjee, Soumick; Dubost, Florian; Schreiber, Stefanie; Mattern, Hendrik; Speck, Oliver; Haehn, Daniel; John, Christoph; Nürnberger, Andreas; Pedrosa, João; Ferreira, Carlos; Aresta, Guilherme; Cunha, António; Campilho, Aurélio; Suter, Yannick; Garcia, Jose; Lalande, Alain; Vandenbossche, Vicky; Van Oevelen, Aline; Duquesne, Kate; Mekhzoum, Hamza; Vandemeulebroucke, Jef; Audenaert, Emmanuel; Krebs, Claudia; Van Leeuwen, Timo; Vereecke, Evie; Heidemeyer, Hauke; Röhrig, Rainer; Hölzle, Frank; Badeli, Vahid; Krieger, Kathrin; Gunzer, Matthias; Chen, Jianxu; Van Meegdenburg, Timo; Dada, Amin; Balzer, Miriam; Fragemann, Jana; Jonske, Frederic; Rempe, Moritz; Malorodov, Stanislav; Bahnsen, Fin H.; Seibold, Constantin; Jaus, Alexander; Marinov, Zdravko; Jaeger, Paul F.; Stiefelhagen, Rainer; Santos, Ana Sofia; Lindo, Mariana; Ferreira, André; Alves, Victor; Kamp, Michael; Abourayya, Amr; Nensa, Felix; Hörst, Fabian; Brehmer, Alexander; Heine, Lukas; Hanusrichter, Yannik; Weßling, Martin; Dudda, Marcel; Podleska, Lars E.; Fink, Matthias A.; Keyl, Julius; Tserpes, Konstantinos; Kim, Moon-Sung; Elhabian, Shireen; Lamecker, Hans; Zukić, Dženan; Paniagua, Beatriz; Wachinger, Christian; Urschler, Martin; Duong, Luc; Wasserthal, Jakob; Hoyer, Peter F.; Basu, Oliver; Maal, Thomas; Witjes, Max J. H.; Schiele, Gregor; Chang, Ti-Chiun; Ahmadi, Seyed-Ahmad; Luo, Ping; Menze, Bjoern; Reyes, Mauricio; Deserno, Thomas M.; Davatzikos, Christos; Puladi, Behrus; Fua, Pascal; Yuille, Alan L.; Kleesiek, Jens; Egger, Jan MedShapeNet : a large-scale dataset of 3D medical shapes for computer vision In: Biomedical engineering = Biomedizinische Technik, Vol. 70, 2025, Nr. 1, pp. 71 – 90 DOI, Online Full Text (Open Access) Erbslöh, Andreas; Zimmermann, Julius; Ingebrandt, Sven; Mokwa, W.; Seidl, Karsten; van Rienen, Ursula; Schiele, Gregor; Kokozinski, Rainer Prediction of impedance characteristic during electrical stimulation with microelectrode arrays In: Journal of Neural Engineering, Vol. 22, 2025, Nr. 2, 026056 DOI (Open Access) Buron, Leo; Erbslöh, Andreas; Schiele, Gregor Reducing Memory and Computational Cost for Deep Neural Network Training with Quantized Parameter Updates In: J.UCS: Journal of Universal Computer Science, Vol. 31, 2025, Nr. 9, pp. 963 – 979 DOI, Online Full Text (Open Access) Qian, Chao; Ling, Tianheng; Schiele, Gregor Exploring energy efficiency of LSTM accelerators : A parameterized architecture design for embedded FPGAs In: Journal of Systems Architecture, Vol. 152, 2024, 103181 DOI (Open Access) Erbslöh, Andreas; Buron, Leo; Ur-Rehman, Zia; Musall, Simon; Hrycak, Camilla; Löhler, Philipp; Klaes, Christian; Seidl, Karsten; Schiele, Gregor Technical survey of end-to-end signal processing in BCIs using invasive MEAs In: Journal of Neural Engineering, Vol. 21, 2024, Nr. 5, 051003 DOI (Open Access) Buron, Leo; Erbslöh, Andreas; Seidl, Karsten; Schiele, Gregor; Seidl, Karsten; Ur-Rehman, Zia; Klaes, Christian Deep.Neural.Signal.Pre-Processor-Towards Development of AI-enhanced End-To-End BCIs In: Current Directions in Biomedical Engineering, Vol. 9, 2023, Nr. 1, pp. 471 – 474 DOI (Open Access) Erbati, Mohammad Mohammadi; Tajiki, Mohammad Mahdi; Schiele, Gregor Service Function Chaining to Support Ultra-Low Latency Communication in NFV In: Electronics, Vol. 12, 2023, Nr. 18, 3843 DOI (Open Access) Babaei, Armin; Schiele, Gregor; Zohner, Michael Reconfigurable Security Architecture (RESA) Based on PUF for FPGA-Based IoT Devices In: Sensors, Vol. 22, 2022, Nr. 15, 5577 DOI, Online Full Text (Open Access) Harutyunyan, Ashot; Schiele, Gregor Challenges for Smart Environments – Human-Centered Computing, Data Science, and Ambient Intelligence II : Smart Human-Centered Computing (volume 2) In: J.UCS: Journal of Universal Computer Science, Vol. 27, 2021, Nr. 12, pp. 1272 – 1274 DOI (Open Access) Cichiwskyj, Christopher; Schmeißer, Stephan; Qian, Chao; Einhaus, Lukas; Ringhofer, Christopher; Schiele, Gregor Elastic AI : System support for adaptive machine learning in pervasive computing systems In: CCF Transactions on Pervasive Computing and Interaction, Vol. 3, 2021, Nr. 3, pp. 300 – 328 DOI (Open Access) Harutyunyan, Ashot; Schiele, Gregor J.UCS special issue on Challenges for Smart Environments – Human-Centered Computing, Data Science, and Ambient Intelligence. Smart Human-Centered Computing (volume 2) In: J.UCS: Journal of Universal Computer Science, Vol. 27, 2021, Nr. 12, pp. 1272 – 1274 DOI (Open Access) Burger, Alwyn; Schiele, Gregor; King, David W. Reconfigurable Embedded Devices Using Reinforcement Learning to Develop Action Policies In: ACM Transactions on Autonomous and Adaptive Systems (TAAS), Vol. 15, 2021, Nr. 4, 14 DOI (Open Access) Cichiwskyj, Christopher; Schiele, Gregor Temporal Accelerators : Unleashing the Potential of Embedded FPGAs In: J.UCS: Journal of Universal Computer Science, Vol. 27, 2021, Nr. 11, pp. 1174 – 1192 DOI (Open Access) Burger, Alwyn Johannes; Cichiwskyj, Christopher; Schmeißer, Stephan; Schiele, Gregor The Elastic Internet of Things - A Platform for Self-Integrating and Self-Adaptive IoT-Systems with Support for Embedded Adaptive Hardware In: Future Generation Computer Systems, Vol. 113, 2020, pp. 607 – 619 DOI Schmeißer, Stephan; Schiele, Gregor coSense: The Collaborative Sensing Middleware for the Internet-of-Things In: ACM/IMS Transactions on Data Science, Vol. 1, 2020, Nr. 4, pp. 28 DOI (Open Access) Babaei, Armin; Schiele, Gregor Physical unclonable functions in the internet of things : State of the art and open challenges In: Sensors, Vol. 19",
  "content_length": 57631,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:44"
}