{
  "name": "Greg Durrett",
  "homepage": "https://gregdurrett.github.io",
  "status": "success",
  "content": "Greg Durrett Greg Durrett Associate Professor, New York UniversityComputer Science Department (Courant Institute) and Center for Data Science (CDS)From 2017-2025, I was a professor in the Computer Science Department at the University of Texas at Austin.gdurrett@nyu.edu CV / TAUR lab Research Group and Publications My students, collaborators, publications, and other information about my research group can be found on the TAUR lab website. Google Scholar / Semantic Scholar My research is primarily in the field of Natural Language Processing (NLP) and machine learning. My group focuses on improving techniques for using large language models (LLMs) to reason about knowledge in text. LLMs still fall short in challenging real-world applications such as medical information processing, scientific discovery, and legal reasoning. We develop methods for training these models to have new capabilities, augmenting them to be more reliable, and assessing their outputs to identify strengths and weaknesses of the state of the art. Some examples of recent projects include: Specializing LLMs with insights from interpretability (Yin et al., NeurIPS 2024) Learning models to assess fine-grained factuality of generation systems (Tang et al., EMNLP 2024) Augmenting LLMs with new capabilities like SMT solvers to improve their reasoning (Ye et al., NeurIPS 2023) Assessing strengths and weaknesses of chain-of-thought (Sprague et al., ICLR 2025) and post-training (Singhal et al., COLM 2024) Training an \"Astro Copilot\" model to assist astronomy researchers with coding tasks, as part of the NSF-Simons AI Institute for Cosmic Origins (ongoing work) Teaching NLP Module for high schools (click here): videos and hands-on assignments introducing n-gram language models and pre-trained Transformers. Courses at NYU: Spring 2026: Building LLM Reasoners (CSCI-GA.3033-131 / DS-GA.3001-009) Courses at UT Austin: Ongoing: CS388: Natural Language Process (Online MSCS/MSDS version): video lectures, readings, and assignments for the online masters offering of these NLP courses. Fall 2024: CS371N: Natural Language Processing (undergraduate) Spring 2024: CS388: Natural Language Processing (graduate) Older: CS371N Fall '23; CS388 Spring '23; CS378 Fall '22; CS378 Fall '21; CS388 Fall '21; CS378 Fall '20; CS378 Spring '20; CS388 Fall '19; CS378 Spring '19; CS388 Fall '18; CS395T (Structured Models for NLP) Fall '17. I have archived these courses' pages as their content is outdated and superseded by the 2024 offerings. If you want something from them specifically, feel free to get in touch. Read more: You can read about some of the course materials we use in our TeachingNLP workshop paper: Contemporary NLP Modeling in Six Comprehensive Programming Assignments Greg Durrett, Jifan Chen, Shrey Desai, Tanya Goyal, Lucas Kabela, Yasumasa Onoe, Jiacheng Xu. Proceedings of the Fifth Workshop on Teaching NLP. Miscellaneous You can find videos of courses, talks, and more on my YouTube channel. Some of these [are] [silly] [videos]. When I'm not working, I'm often struggling with various physical pursuits (running, cycling, climbing, and hiking). My half marathon PR is 1:55:26 (set 2/19/2023).",
  "content_length": 3190,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:36"
}