{
  "name": "Gregory Tsagkatakis",
  "homepage": "https://users.ics.forth.gr/~greg",
  "status": "success",
  "content": "Tsagkatakis Grigorios Grigorios Tsagkatakis Institute of Computer Science Foundation for Research and Technology - Hellas (FORTH) Home Publications Research Projects Contact My name is Grigorios Tsagkatakis and IÂ  currently serving as an Assistant Professor at the Computer Science Department (CSD) of the University of Crete. I am also an associate researcher at the Signal Processing Lab (SPL) of the Institute of Computer Science (ICS), Foundation for Research and Technology Hellas (FORTH). I hold a BSc (2005) and an MSc (2007) from the School of Electrical and Electronics Engineering, Technical University of Crete, Greece. I was awarded my PhD from the Center of Imaging Science, Rochester Institute of Technology, NY, USA (2011). Between 2019-2022, I was a Marie SkÅodowska-Curie fellow working with Prof. Mahta Moghaddam, head of the Microwave Systems, Sensors, and Imaging Lab (MiXIL) at the University of Southern California (USC) on the CALCHAS project. Research Interests Signal and Image Processing, Machine Learning, Deep Learning, Compressed Sensing, Remote Sensing, Astrophysics. Â News Together with Dr. Jean-Luc Starck, we are organizing the (ADA-X), the 10th Astronomical Data Analysis Summer School which will take place on September 18-22, 2023 at Hersonissos, Crete, Greece. Our proposal with Prof. Moghaddam (USC) on \"Fusion of Passive and Active Microwave Remote Sensing Data: An Integrative Framework for Resolution Enhancement Using Physics-Based Modeling, In-Situ Observations, and Deep Neural Networks\" has been accepted for funding by the NASA Research Opportunities in Space and Earth Science (ROSES-2018): Remote Sensing Theory for Earth Science. Together with M. Jaber (NantOmics, USA) and M. Yousefhussien (General Electric Global Research, USA), we are organizing the Food and Agricultural Imaging Systems conference on February, 2021. More information in the website We are organizing the Computational Intelligence in Remote Sensing and Astrophysics (CIRSA) workshop on July 17-19, 2019 at FORTH. More information in the website I wll be teaching a class on Deep Learning in astronomy in the 2019 Summer School for Astrostatistics, Department of Physics, University of Crete. More information in the website. Presentation with links for code/data [presentation] Joint work with I. Kalomoiris, G. Pitsis, A. Ioannou, C. Kozanitis, A. Dollas, P. Tsakalides and M. Katevenis, on \"An Experimental Analysis of the Opportunities to Use FieldProgrammable Gate Array Multiprocessors for On-board SatelliteDeep Learning Classification of Spectroscopic Observations fromFuture ESA Space Missions\" will be presented at the European Workshop on On-Board Data Processing (OBDP2019), organized by ESA, on February 26, 2019. [presentation] [report] Joint work with Professor Mahta Moghaddam on \"Convolutional Neural Networks for downscaling SMAP radiometer brightness temperature observations with high-resolution radar\" was presented as poster at the AGU Fall Meeting in Washington DC, on December 14, 2018. [poster] Co-organizer of the 2018 Workshop on Computational Intelligence in Astrophysics, FORTH, July 10, 2018. My presentation on Deep Learning in astrophysics [talk]. \"Introduction to Deep Neural Networks\", guest lecture at CS â 439 Wireless Networks and Mobile Computing, Computer Science Department, UoC, (Slides), May 2018. Our work on \"1-bit Tensor Completion\" by A. Aidini, G. Tsagkatakis and P. Tsakalides won the best paper award at the Image Processing: Algorithms and Systems conference of the International Symposium on Electronic Imaging, Junuary 2018, Burlingame, California. \"Introduction to Deep Learning\", guest lectures at CS â 590.21 Analysis and Modeling of Brain Networks, Computer Science Department, UoC, (Slides available), November 2017. Tutorial on Deep Learning given at the International Workshop on Dictionary Learning on Manifolds in Nice, September 2017. (Slides available) 1st Prize in RDA Europe - BlueBRIDGE Datathon on Fisheries and Aquaculture with the \"mermaid and the dudes\" (Akrivos Vassilios, Tsagkatakis Grigorios, Giannopoulos Michalis, Roumelioti Anastasia, and Nystos Theoxaris), June 2017. Article on the Computational Spectral imaging technology published in ERCIN news 108 special issue on Computational Imaging, January 2017. Co-organizing with Dr Mustafa JaberÂ  the special session on Computer Vision Applications in Sports onÂ  Jan. 30, 2017, part of the Electronic Imaging Symposium 2017. Â Â",
  "content_length": 4482,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:58"
}