{
  "name": "Greg Turk",
  "homepage": "http://www.cc.gatech.edu/~turk",
  "status": "success",
  "content": "Greg Turk's Home Page Greg Turk's Home Page Some Graphics Links Find out where the Stanford Bunny came from. What Math is important for Computer Graphics? New version of essay (2019) and old version (1997). Learn about Erdös numbers for computer graphics researchers. I belong to the Computer Graphics Group at Georgia Tech. My Publications, with on-line versions of most documents. See the citations here. See our NSF-funded work on Robotic Assistance with Dressing. Interests: Computer graphics, robotics, machine learning, simulation for biology. My PhD Students, Present and Past Chris Alvarez-Russell (co-advised with Blair MacIntyre, NVidia) Mark Carlson (PhD granted 2004, NVidia) Jiajian Chen (PhD granted in 2013, co-advised with Blair MacIntyre, Google) Alex Clegg (PhD granted in 2019, co-advised with Karen Liu, Meta) Quynh Dinh (PhD granted in 2002, Makerbot) Sarang Joshi (co-advised with Jarek Rossignac, current student) Peter Lindstrom (PhD granted 2000, LLNL) FS Nooruddin (Zynga) Robert Plante (current student) Karthik Raveeendran (PhD granted in 2014, Google) Jie Tan (PhD granted in 2015, co-advised with Karen Liu, Google) Sarah Tariq (NVidia) Chen Tang (co-advised with Karen Liu, Tower Research) Jack Tumblin (PhD granted 1999, faculty at Northwestern) Brooks van Horn III (PhD granted in 2007) Huamin Wang (PhD granted in 2009, Style3D) Chris Wojtan (PhD granted in 2010, faculty at Institute of Science and Technology, Austria) Wenhao Yu (PhD granted 2020, co-advised with Karen Liu, Google) Eugene Zhang (PhD granted 2004, faculty at Oregon State University) Yunbo Zhang (PhD granted 2024, AI Institute) Other Student Collaborators Pravin Bhat (PhD from U. Washington, currently at Weta) Stephanie Brubaker (former PhD student) Yiwei Cheng (PhD student in Civil and Environmental Engineering) Florian Hecht (PhD student at U.C. Berkeley) Stephen Ingram (PhD student at UBC) Nipun Kwatra (PhD from Stanford, Chekkoo Technologies) Vivek Kwatra (PhD granted, Google) Shiqiu Liu (MS student, NVidia) Delphine Nain (PhD granted, McKinsey) Jie Sun (PhD granted) Gary Yngve (PhD student at U. Washington) Yangming Zhang (BS/MS granted, Samsung Research America) Howard Zhou (PhD granted, currently at Google) Various Graphics Items Here is the source code for the PLY file format. Visit the Large Geometric Models Archive at Georgia Tech. Where can you find good Polygonal Models? I recommend reading 125 big questions in science (from Science magazine). Research Projects Learning to manipulate amorphous_materials. Simulation to real transfer of robot policies for biped locomotion. Transfer of robot policies using strategy optimization. Learning symmetric and low-energy locomotion using deep reinforcement learning. Learning a universal policy for robot control. Predicting future land cover using machine learning. Animating human dressing. Blending between liquid animations. Learning bicycle stunts. How did the four-flipper plesiosaurs swim? Simulation of fluids using hybrid SPH. Using meshes to control liquids. Animation of soft body locomotion. Animation of swimming creatures. Simulation of anisotropic patterns of biomass in wetlands. Stable proportional-derivative animation controllers. Sticky Feet: creature evolution in a simulated environment. Simulation of surface tension using a mesh-based approach. Animating fluids with thin features. Surface reconstruction for particle-based fluids. Simulated swimming for articulated bodies. Survey of the state of the art in example-based texture synthesis. Material space texturing. Fast simulation of viscoelastic materials with thin features. Animation of viscoplastic flow by dynamic re-meshing. Shallow wave equations on surfaces. Erosion and corrosion of solid objects. User-guided terrain synthesis using real digital elevation maps. User control of particle system simulations, including cloth and flocking. Tensor field design for non-photorealistic rendering. Vector field design on surfaces. Simulation of water droplets on surfaces. Parameterization of mesh surfaces. Eugene provides many unfolded models for download and use. Texture transfer between surfaces. The Rigid Fluid method for simulating interaction between fluids and solid objects. Geometric texture synthesis by example. Graphcut texture and video synthesis. Surface reconstruction using radial basis functions. Animation of melting and flowing. Visibility-Guided Simplification Texture synthesis directly on polygonal surfaces. Surface reconstruction using anisotropic basis functions. Implicit surfaces that interpolate. Interior/Exterior classification of polygonal models. Simplification using an image-driven approach. Shape transformation using a new kind of implicit surface. Display of high-contrast images. Memoryless mesh simplification. Vector field visualization using image-guided streamline placement. Zippering together range images to create polygon meshes. Simplifying polygonal surfaces by Re-Tiling. Texture synthesis using reaction-diffusion. My Life Outside School Pictures of Nicky and Cassie in 2005. Pictures of Nicky and Cassie in 2004. Some old pictures of our daughter, Cassie. Look here for pictures of Mary's and my two cats when they were young. And here are more recent pictures of our cats. Friends Here are links to some of my friends: My Ph.D. advisor Henry Fuchs has links to several of his computer graphics research projects on his Web page. I worked with Marc Levoy while I was a postdoc at Stanford. Visit his Web page to find out about his graphics projects ranging from The Flintstones to Michaelangelo. Andrew Glassner's page contains lots of computer graphics goodies, including information about his new book and links to graphics journal and conference pages. Contact Info Office: Klaus Room 3228, Georgia Tech Campus Office Phone: (404) 894-7508 E-mail: Work Address College of Computing Georgia Institute of Technology 85 5th Street NW Atlanta, GA 30332-0760",
  "content_length": 5965,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:42"
}