{
  "name": "Greg Welch",
  "homepage": "https://sreal.ucf.edu/people/welch",
  "status": "success",
  "content": "Dr. Gregory F. Welch | SREAL Contact welch@ucf.eduhttps://nursing.ucf.edu/people/gregory-welch/+1 407.796.2823 Appointments Pegasus ProfessorAdventHealth Endowed Chair in SimulationCollege of Nursing, Department of Computer Science, and Institute for Simulation & TrainingUniversity of Central Florida Education University of North Carolina at Chapel Hill, Chapel Hill, NC, Ph.D., Computer Science, 1997University of North Carolina at Chapel Hill, Chapel Hill, NC, M.S., Computer Science, 1995Purdue University, West Lafayette, IN, B.S. with Highest Distinction, Electrical Engineering Technology, 1986 About Gregory Welch is a Pegasus Professor and the AdventHealth Endowed Chair in Simulation at the University of Central Florida (UCF), with appointments in the College of Nursing, the Department of Computer Science, and the Institute for Simulation & Training. He is also a Co-Director of the Synthetic Reality Laboratory. He received a B.S. degree in Electrical Engineering Technology from Purdue University in 1986, with Highest Distinction, and a Ph.D. in Computer Science from the University of North Carolina at Chapel Hill in 1996. Prior to UCF he was a Research Professor at UNC, he worked on the Voyager Spacecraft Project at NASA’s Jet Propulsion Laboratory, and on airborne electronic countermeasures at Northrop-Grumman’s Defense Systems Division. His research interests include human-computer interaction, human motion tracking, and virtual and augmented reality, with applications such as healthcare and defense. He is a Fellow of the National Academy of Inventors (NAI) and a Fellow of the Institute of Electrical and Electronics Engineers (IEEE). His awards include induction into the IEEE Virtual Reality Academy in 2022, the IEEE Virtual Reality Technical Achievement Award in 2018 (VR 2018), and the Long Lasting Impact Paper Award at the 15th IEEE International Symposium on Mixed and Augmented Reality (ISMAR 2016). He is also an ACM SIGGRAPH Pioneer and serves as an IEEE Technical Expert for Virtual, Augmented and Mixed Reality and the Vice Chair for Conferences on the Executive Committee of the IEEE Visualization and Graphics Technical Community (VGTC). He maintains an internationally-recognized web site dedicated to the Kalman filter, and his 1995 introductory article on the subject has been cited over 12,000 times. In 2008 Prof. Kalman personally invited Prof. Welch to attend the National Academy of Engineering ceremony where he was awarded the Charles Stark Draper Prize for “for the development and dissemination of the optimal digital technique (known as the Kalman Filter).” PublicationsPatentsStudentsCurriculum VitaeKalman FilterPersonal",
  "content_length": 2681,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:42"
}