{
  "name": "Greg Byrd",
  "homepage": "https://ece.ncsu.edu/people/gbyrd",
  "status": "success",
  "content": "Greg Byrd - Electrical and Computer Engineering Greg Byrd Professor He/Him/His 919-513-2508 gbyrd@ncsu.edu 2004A Engineering Building II Campus Box 7911 ORCiD LinkedIn Curriculum Vitae Download Photo BiographyDr. Byrd's primary research is in the areas of quantum computing, computer architecture, and high-performance parallel systems. He is interested in mechanisms which reduce communication overhead in parallel and distributed systems. He is the executive director of the IBM Quantum Innovation Center at NC State, and vice chair of the IEEE-CS Quantum Technical Community (QTC). He is a founding co-organizer of the IEEE International Conference on Quantum Computing and Engineering and has served as general chair, technical program chair, and finance chair. Before joining NC State, Dr. Byrd was a principal scientist at Celotek Corporation, where he developed software and protocols for the CellCase family of encryptors for ATM networks. He also worked at MCNC, in both the NC Supercomputing Center and the High Performance Computation and Communications group. Education Ph.D. 1998 Electrical EngineeringStanford University Master's 1985 Electrical EngineeringStanford University Bachelor's 1984 Computer EngineeringClemson University Research Focus Quantum Information Science and Engineering Computer Architecture and Systems Recent Publications Achieving Forward Progress Guarantee in Small Hardware Transactions (2024)Analyzing Quantum Circuit Depth Reduction with Ancilla Qubits in MCX Gates (2024)Solving the B-SAT Problem Using Quantum Computing: Smaller Is Sometimes Better (2024)Solving the B-SAT Problem Using Quantum Computing: Smaller Is Sometimes Better (2024)Solving the B-SAT Problem Using Quantum Computing: Smaller is Sometimes Better (2024)The road to quantum internet: Progress in quantum network testbeds and major demonstrations (2024)Crosstalk-Based Parameterized Quantum Circuit Approximation (2023)Exploring Architecture of Qiskit Runtime for Educational Enablement (2023)PreFlush: Lightweight Hardware Prediction Mechanism for Cache Line Flush and Writeback (2023)Quantum Computing: Progress and Innovation (2023) View more publications Google Scholar Expert In quantum computing , parallel computing Involvement IEEE Computer Society Senior Member Books Principles of Superconducting Quantum Computers 2022 Highlighted Awards William F. Lane Outstanding Teaching Award (2011) College of Engineering Outstanding Teaching Award (2012) NC State Outstanding Teacher Award (2012) Awards & Honors 2022 - IEEE Computer Society Distinguished Contributor 2016 - IEEE Computer Society Golden Core Award 2012 - COE Outstanding Teacher Award 2012 - ECE William F. Lane Teaching Award Recent News The Institute will be led by UMD Computer Science Professor Andrew Childs (second from right), along with NC State ECE researchers. John T. Consoli / University of Maryland NC State Collaborates on New $25M NSF Quantum Leap Challenge Institute for Robust Quantum Simulation Posted on September 2, 2021 | Filed Under: Quantum and Research The Quantum Leap Challenge Institute for Robust Quantum Simulation includes faculty from NC State ECE, and will significantly add to the vibrant quantum research ecosystem established along the East Coast. Read more Byrd Elected as First Vice President of IEEE Computer Society Posted on November 28, 2017 | Filed Under: Faculty and News Dr. Gregory T. Byrd, professor and Associate Department Head of the Electrical and Computer Engineering Department at NC State University was elected by the IEEE Computer Society as the 2018 First Vice President. Read more How students are tackling unstructured data indexing with POWER8 Posted on January 13, 2015 | Filed Under: News and Smart North Carolina State University is one of the participants in the Innov8 with POWER8 Challenge. Utilizing technology from IBM and OpenPOWER Foundation members including NVIDIA, Mellanox and Altera, I’m overseeing a team that is working on a … Read more Edit my Profile",
  "content_length": 4010,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:39"
}