{
  "name": "Gregory Z. Gutin",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/gregory-gutin_6b1b6d2e-2ebd-4bc0-8d8b-f258381c1f44.html",
  "status": "success",
  "content": "Gregory Gutin - Royal Holloway Research Portal Gregory Gutin Professor Professor, Department of Computer ScienceCentre for Algorithms and ApplicationsCentre for Intelligent Systems Phone+44 1784 414229EmailG.Gutinrhul.acukWebsitehttp://www.cs.rhul.ac.uk/home/gutin TW20 0EX Personal profile Research interestsGregory received his MSc in Mathematics in 1979 from Gomel State University, Belarus. He worked in high school and research institutes of Belarus from 1979-1990. He studied for PhD under Professor Noga Alon at the School of Mathematics, Tel Aviv University, Israel and received his PhD (with distinction) in 1993. Between 1993 and 1996 he held visiting positions in the Department of Mathematics and Computer Science, Odense University, Denmark and then became a lecturer at the Department of Mathematics, Brunel University, UK. In 1996 he was awarded Kirkman Medal of International Institute of Combinatorics and Applications. Since 1st September 2000, Gregory has been Professor of Computer Science, Department of Computer Science, Royal Holloway, University of London. He held Royal Society Wolfson Research Merit award in 2014-2018 and was elected to Academia Europaea in 2017 and to AAIA (Asia-Pacific Artificial Intelligence Association) in 2021. He received best paper awards at information security access control symposium ACM SACMAT in 2015, 2016, 2021 and 2022. In 2019 he was presented with Amity Global Academic Excellence Award and in 2022 with AAIA Outstanding Contribution Award. Gutin's main research interests include graphs and combinatorics, parameterized, polynomial, exact and approximation algorithms,  access control in information security, combinatorial optimization and theoretical economics. G. Gutin published two editions of a monograph (translated into Chinese) and edited two books. He has more than 250 papers published or accepted for publication in refereed journals and conference proceedings, and 16 chapters and sections in edited books. His publications were cited over 11900 times. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): External positionsDistinguished Scientist, Shenzhen Institute of Advanced Technology1 Jun 2024 → 31 May 2027Distinguished Professor, Nankai University1 Apr 2024 → 31 Mar 2027 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 185 Article 28 Conference contribution 12 Chapter 6 Paper 2 More 2 Book Research output per year Research output per year Acceleration of Timing-Aware Gate-Level Logic Simulation Through One-Pass GPU ParallelismFang, W., Fu, Y., Gao, J., Guo, L., Gutin, G. & Zhang, X., 13 May 2025, (E-pub ahead of print) In: IEEE Transactions on Computers. p. 1-12 12 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 18 Downloads (Pure) An improved SDP rounding approximation algorithm for Max Hypergraph BisectionLi, G., Gutin, G., Han, D., Sun, J. & Zhang, X., 10 Nov 2025, (Accepted/In press) In: Science China Mathematics.Research output: Contribution to journal › Article › peer-review A Survey on Graph Problems Parameterized Above and Below Guaranteed ValuesGutin, G. & Mnich, M., Nov 2025, In: Computer Science Review. 58, 100795.Research output: Contribution to journal › Article › peer-review Open Access Number of Subgraphs and Their Converses in Tournaments and New Digraph PolynomialsAi, J., Gutin, G., Lei, H., Yeo, A. & Zhou, Y., 28 Apr 2025, (E-pub ahead of print) In: Journal of Graph Theory.Research output: Contribution to journal › Article › peer-review Open Access On k-anti-tracebility of oriented graphsChen, B., Gerke, S., Gutin, G., Lei, H., Parker-Cox, H. & Zhou, Y., Mar 2025, In: Discrete Mathematics. 348, 3, 9 p., 114331.Research output: Contribution to journal › Article › peer-review Open Access View all 233 research outputs Projects 6 Finished Projects per year Analyzing Security-aware Workflows (funded by Leverhulme Trust)Gutin, G. (PI), Crampton, J. (CoI) & Cohen, D. (CoI)1/01/19 → 31/12/21Project: Research Parameterised Combinatorial Optimisation ProblemsGutin, G. (PI)Royal Society1/01/14 → 31/12/18Project: Research Parameterized Algorithmics for the Analysis and Verification of Constrained Workflow SystemsGutin, G. (PI), Cohen, D. (CoI) & Crampton, J. (CoI)Eng & Phys Sci Res Council EPSRC1/02/13 → 1/05/16Project: Research Preprocessing for Optimisation Problems Parameterized Above/Below Tight BoundsGutin, G. (PI) & Yeo, A. (CoI)Royal Society1/12/10 → 30/11/12Project: Research International conference on discrete mathematics 2008Gutin, G. (PI)Royal Society6/05/08 → 12/05/08Project: Research View all 6 projects Prizes AAIA Outstanding Contribution Award 2022Gutin, G. (Recipient), 2022Prize: Prize (including medals and awards) Amity Global Academic Excellence AwardGutin, G. (Recipient), 2019Prize: Prize (including medals and awards) Best paper award at 20th ACM Symposium on Access Control Models and Technologies (SACMAT 2015)Gutin, G. (Recipient), Crampton, J. (Recipient) & Karapetyan, D. (Recipient), 2015Prize: Prize (including medals and awards) Best paper award at 21st ACM Symposium on Access Control Models and Technologies (SACMAT 2016)Gutin, G. (Recipient), Crampton, J. (Recipient) & Watrigant, R. (Recipient), 2016Prize: Prize (including medals and awards) Best paper award at SACMAT 2022Crampton, J. (Recipient), Eiben, E. (Recipient), Gutin, G. (Recipient), Karapetyan, D. (Recipient) & Majumdar, D. (Recipient), 10 Jun 2022Prize: Prize (including medals and awards) View all 12 prizes",
  "content_length": 6024,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:00"
}