{
  "name": "Gregory Ralph Crane",
  "homepage": "http://www.dh.uni-leipzig.de/wo/gregory-crane",
  "status": "success",
  "content": "Universität Leipzig: Forschungsgruppe Computational Humanities Computational Humanities Die Computational Humanities erweitern die Geisteswissenschaften durch den Einsatz digitaler Tools und computerbasierter Verfahren. Unsere Forschungsgruppe beschäftigt sich schwerpunktmäßig mit der Modellierung und Analyse geisteswissenschaftlicher Daten. mehr erfahren Forschung In den Computational Humanities verwenden wir aktuelle Techniken und Methoden des Text Mining und des Natural Language Processing sowie auch der Audio-, Video- und Bildanalyse, um große Kollektionen geistes- und sozialwissenschaftlicher Daten zu untersuchen. Aktuelle Forschung Erfahren Sie hier mehr über unsere laufenden Forschungsprojekte und die aktuellen Schwerpunkte unserer Forschung. mehr erfahren Publikationen Die Publikationen der Computational Humanities-Gruppe im Forschungsportal der Universität Leipzig. mehr erfahren Ressourcen Unsere Tools und Korpora stellen wir hier zur Verfügung. mehr erfahren Abgeschlossene Forschungsprojekte Hier finden Sie Informationen zu den abgeschlossenen Forschungprojekten unserer Gruppe. mehr erfahren Lehre In der Lehre beschäftigen wir uns mit der Vermittlung von praktischen und theoretischen Grundlagen der Digital Humanities. Zudem bieten wir zahlreiche Veranstaltungen zu aktuellen Forschungstrends der Computational Humanities, der Cultural Analytics und der Humanities Data Science an. Lehrveranstaltungen Hier finden Sie Informationen zu den von unserer Gruppe ausgerichteten Lehrveranstaltungen seit dem Wintersemester 2020 bis heute. mehr erfahren Abschlussarbeiten Informationen zur Betreuung von Abschlussarbeiten sowie möglichen Themenfelden mehr erfahren B. Sc. Digital Humanities Alle Informationen zum Bachelorstudiengang Digital Humanities an der Universität Leipzig mehr erfahren M. Sc. Digital Humanities Alle Informationen zum Master-Studiengang Digital Humanities an der Universität Leipzig mehr erfahren Team Professur Prof. Dr. Manuel Burghardt Universitätsprofessor Computational Humanities workAugustusplatz 1004109 Leipzig E-Mail Schreiben Zum Profil Zum Profil Sylvia Frömmert Sekretärin Computational Humanities workAugustusplatz 1004109 Leipzig Telefon: work +49 341 97 - 32354 Telefax: fax +49 341 97 - 32358 E-Mail Schreiben Postdocs Dr. Thomas Efer Wiss. Mitarbeiter Computational Humanities workAugustusplatz 1004109 Leipzig E-Mail Schreiben Zum Profil Zum Profil Dr. Andreas Niekler Wiss. Mitarbeiter Computational Humanities workAugustusplatz 1004109 Leipzig E-Mail Schreiben Zum Profil Zum Profil PD Dr. Monica Berti Wiss. Mitarbeiterin Alte Geschichte workBeethovenstraße 1504107 Leipzig E-Mail Schreiben Zum Profil Zum Profil Wissenschaftliche Mitarbeitende und Promovierende Vera Piontkowitz Wiss. Mitarbeiterin Computational Humanities workAugustusplatz 1004109 Leipzig E-Mail Schreiben Fatma Aladağ PhD-Studentin Computational Humanities workAugustusplatz 1004109 Leipzig Silvia Gutiérrez PhD-Studentin Computational Humanities workAugustusplatz 1004109 Leipzig Axelle Lecroq PhD-Studentin Computational Humanities workAugustusplatz 1004109 Leipzig Hilfskräfte Jannis Klähn Wissenschaftliche Hilfskraft Computational Humanities workAugustusplatz 1004109 Leipzig Mirjam Köberlein Studentische Hilfskraft Computational Humanities workAugustusplatz 1004109 Leipzig Nicolas Ruth Wissenschaftliche Hilfskraft Computational Humanities workAugustusplatz 1004109 Leipzig Martin Schlenk Wissenschaftliche Hilfskraft Computational Humanities workAugustusplatz 1004109 Leipzig E-Mail Schreiben Klaus Schmidt Wissenschaftliche Hilfskraft Computational Humanities workAugustusplatz 1004109 Leipzig",
  "content_length": 3643,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:57"
}