{
  "name": "Gregory Shakhnarovich",
  "homepage": "http://ttic.uchicago.edu/~gregory",
  "status": "success",
  "content": "Greg Shakhnarovich @ TTI-Chicago Greg Shakhnarovich Professor Toyota Technological Institute at Chicago 6045 S. Kenwood Ave. Chicago, IL 60637 e-mail gregory at ttic dot edu tel +1 (773) 834-2572 fax +1 (773) 834-9881 Brief bio: I am a Professor at Toyota Technological Institute ad Chicago (TTIC), a philanthropically endowed academic computer science institute located on the University of Chicago campus. I also hold a part-time faculty appointment at the University of Chicago Department of Computer Science. I lead the Perception And Learning Systems (PALS) group. Prior to coming to TTIC, I was a post-doctoral researcher at the Department of Computer Science of Brown University, working with Michael Black. I received my PhD degree at MIT where I worked at CSAIL with Trevor Darrell. I obtained my MSc degree at the Computer Science Department of the Technion, Israel Institute of Technology in Haifa, Israel, and my undergraduate degree in Math and CS from Hebrew University in Jerusalem, Israel. My CV: PDF Research interests: Image and video understanding Perception of 3D world from images and videos Vision and language, in particular purposeful/informative image descriptions and grounding language in the visual world (e.g., \"open vocabulary detection\" Synthesis and perception of non-photorealistic imagery; image synthesis and stylization, and lifting 2D imagery to 3D Automatic processing and recognition of sign languages Understanding the role of embodiment in visual perception Publications While I work on a better presentation of my current and recent projects, you can find the up to date list of my publications here (sorted by year). Current student collaborators Xiaodan Du (TTIC, PhD) Jiahao Li (TTIC, PhD) Haochen Wang (TTIC, PhD) Marcelo Sandoval-Castañeda (TTIC, PhD) Shester Gueuwou, TTIC visiting student Former students (→ employment following graduation) Igor Vasiljevic (TTIC, PhD) → Research Scientist, Toyota Research Institute Steven Basart (U. of Chicago, PhD) → Research Engineer, SpaceX Nick Kolkin (TTIC, PhD) → Research Engineer, Adobe Research Ruotian Luo (TTIC, PhD)→ Software Engineer, Waymo Reza Mostajabi (TTIC PhD) → Research Engineer at Zendar, Inc. Payman Yadollahpour (TTIC PhD) → Postdoc at UPItt/MIT CSAIL Shubhendu Trivedi (TTIC PhD) → Institute Fellow, ICERM/Brown University, and Research Affiliate, MIT CSAIL Gustav Larsson (PhD, U. of Chicago) → Research Engineer at Apple, Inc. Theses PhD thesis, MIT, 2006: Learning Task-Specific Similarity. Advisor: Trevor Darrell. MsC thesis, Technion, 2001: Statistical Data Cloning for Machine Learning. Advisors: Ran El-Yaniv and Yoram Baram. Teaching I regularly teach two courses at TTIC/University of Chicago: TTIC 31020, Introduction to Machine Learning (next offering by me: Autumn 2022) TTIC 31040, Introduction to Computer Vision (next offering: Winter 2022)",
  "content_length": 2866,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:59"
}