{
  "name": "Gregor Schöner",
  "homepage": "https://www.ini.rub.de/the_institute/people/gregor-schoner",
  "status": "success",
  "content": "Prof. Dr. Gregor Schöner | People | Institut für Neuroinformatik RUB INI People Prof. Dr. Gregor Schöner gregor.schoener@ini.rub.de (+49) 234-32-27965 Prof. Dr. Gregor Schöner Theory of Cognitive Systems Autonomous Robotics, Theory of Embodied Cognition Ruhr-Universität Bochum Institut für Neuroinformatik Universitätsstraße 150 Building NB, Room NB 3/31 D-44801 Bochum, Germany gregor.schoener@ini.rub.de (+49) 234-32-27965 Curriculum Vitae About Me Publications Teaching Supervised Theses I would like to understand how embodied and situated nervous systems develop cognition. To do that, my colleagues and I have developed the theoretical framework of Dynamical Field Theory. In a set of close theory-experiment collaborations we validate the concept of the theory and systematically build an account of action, perception, and embodied cognition. Exemplary studies include multi-degree of freedom movements, learning of motor skills, perception of motion, working memory for action, space and visual features, sensory-motor decision making and the development of early cognition and motor behavior. In a second line of research we develop of autonomous robots inspired by these same theoretical principles. The main emphasis is on service robotics, in which autonomous robots interact with human users. I work toward that vision as a researcher, as group leader, and collaborator. I also teach as a professor, and am the director of the Institute, and have all kinds of other obligations like editorships, writing letters for students, and reviewing grants. As a result of such multi-tasking, I struggle to keep up with email. So please don't hesitate to remind me if I am slow to respond and do send me an email a second or third time if the response is long in coming. Thank you for your understanding. Selected Publications view all publications 2019 The Dynamics of Neural Populations Capture the Laws of the MindSchöner, G.Topics in Cognitive Science, 1–15 Bibtex APA Downloads reprint @article{Schöner2019, author\t\t=\t{Schöner, Gregor}, title\t\t=\t{The Dynamics of Neural Populations Capture the Laws of the Mind}, journal\t\t=\t{Topics in Cognitive Science}, pages\t\t=\t{1–15}, year\t\t=\t{2019}, doi\t\t=\t{10.1111/tops.12453}, } Schöner, G. (2019). The Dynamics of Neural Populations Capture the Laws of the Mind. Topics in Cognitive Science, 1–15. http://doi.org/10.1111/tops.12453 2024 Neural Dynamic Principles for an Intentional Embodied AgentTekülve, J., & Schöner, G.Cognitive Science, 48(9) Bibtex APA Downloads reprint @article{TekülveSchöner2024, author\t\t=\t{Tekülve, Jan and Schöner, Gregor}, title\t\t=\t{Neural Dynamic Principles for an Intentional Embodied Agent}, journal\t\t=\t{Cognitive Science}, volume\t\t=\t{48}, number\t\t=\t{9}, month\t\t=\t{September}, year\t\t=\t{2024}, doi\t\t=\t{10.1111/cogs.13491}, } Tekülve, J., & Schöner, G.. (2024). Neural Dynamic Principles for an Intentional Embodied Agent. Cognitive Science, 48(9). http://doi.org/10.1111/cogs.13491 Inverting a model of neuromuscular control to estimate descending activation patterns that generate fast-reaching movementsHummert, C., Zhang, L., & Schöner, G.Journal of Neurophysiology, 131(6), 1271–1285 Bibtex APA Downloads reprint @article{HummertZhangSchöner2024, author\t\t=\t{Hummert, Cora and Zhang, Lei and Schöner, Gregor}, title\t\t=\t{Inverting a model of neuromuscular control to estimate descending activation patterns that generate fast-reaching movements}, journal\t\t=\t{Journal of Neurophysiology}, volume\t\t=\t{131}, number\t\t=\t{6}, pages\t\t=\t{1271–1285}, month\t\t=\t{June}, year\t\t=\t{2024}, doi\t\t=\t{10.1152/jn.00179.2023}, } Hummert, C., Zhang, L., & Schöner, G.. (2024). Inverting a model of neuromuscular control to estimate descending activation patterns that generate fast-reaching movements. Journal of Neurophysiology, 131(6), 1271–1285. http://doi.org/10.1152/jn.00179.2023 ROBOVERINE: A human-inspired neural robotic process model of active visual search and scene grammar in naturalistic environmentsGrieben, R., Sehring, S., Tekülve, J., Spencer, J. P., & Schöner, G.In 2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) IEEE Bibtex APA Downloads Preprint @inproceedings{GriebenSehringTekülveEtAl2024, author\t\t=\t{Grieben, Raul and Sehring, Stephan and Tekülve, Jan and Spencer, John P. and Schöner, Gregor}, title\t\t=\t{ROBOVERINE: A human-inspired neural robotic process model of active visual search and scene grammar in naturalistic environments}, booktitle\t=\t{2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)}, organization\t=\t{IEEE}, year\t\t=\t{2024}, } Grieben, R., Sehring, S., Tekülve, J., Spencer, J. P., & Schöner, G.. (2024). ROBOVERINE: A human-inspired neural robotic process model of active visual search and scene grammar in naturalistic environments. In 2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE. Visual selective attention: Priority is all you needGrieben, R., Spencer, J. P., & Schöner, G.In L. K. Samuelson, Frank, S. L., Toneva, M., Mackey, A., & Hazeltine, E. (Eds.), Proceedings of the 46th Annual Conference of the Cognitive Science Society Bibtex APA @inproceedings{GriebenSpencerSchöner2024, author\t\t=\t{Grieben, Raul and Spencer, John P. and Schöner, Gregor}, title\t\t=\t{Visual selective attention: Priority is all you need}, booktitle\t=\t{Proceedings of the 46th Annual Conference of the Cognitive Science Society}, editor\t\t=\t{Samuelson, L. K. and Frank, S. L. and Toneva, M. and Mackey, A. and Hazeltine, E.}, year\t\t=\t{2024}, } Grieben, R., Spencer, J. P., & Schöner, G.. (2024). Visual selective attention: Priority is all you need. In L. K. Samuelson, Frank, S. L., Toneva, M., Mackey, A., & Hazeltine, E. (Eds.), Proceedings of the 46th Annual Conference of the Cognitive Science Society. A Neural Process Model of Structure Mapping Accounts for Children’s Development of Analogical Mapping by Change in Inhibitory ControlKang, M., Sabinasz, D., & Schöner, G.In L. K. Samuelson, Frank, S. L., Toneva, M., Mackey, A., & Hazeltine, E. (Eds.), Proceedings of the 46th Annual Conference of the Cognitive Science Society Bibtex APA Downloads pdf @inproceedings{KangSabinaszSchöner2024, author\t\t=\t{Kang, Minseok and Sabinasz, Daniel and Schöner, Gregor}, title\t\t=\t{A Neural Process Model of Structure Mapping Accounts for Children’s Development of Analogical Mapping by Change in Inhibitory Control}, booktitle\t=\t{Proceedings of the 46th Annual Conference of the Cognitive Science Society}, editor\t\t=\t{Samuelson, L. K. and Frank, S. L. and Toneva, M. and Mackey, A. and Hazeltine, E.}, year\t\t=\t{2024}, } Kang, M., Sabinasz, D., & Schöner, G.. (2024). A Neural Process Model of Structure Mapping Accounts for Children’s Development of Analogical Mapping by Change in Inhibitory Control. In L. K. Samuelson, Frank, S. L., Toneva, M., Mackey, A., & Hazeltine, E. (Eds.), Proceedings of the 46th Annual Conference of the Cognitive Science Society. Interaction of polarity and truth value - A neural dynamic architecture of negation processingKati, L., Sabinasz, D., Schöner, G., & Kaup, B.In L. K. Samuelson, Frank, S. L., Toneva, M., Mackey, A., & Hazeltine, E. (Eds.), Proceedings of the 46th Annual Conference of the Cognitive Science Society Bibtex APA Downloads Paper @inproceedings{KatiSabinaszSchönerEtAl2024, author\t\t=\t{Kati, Lea and Sabinasz, Daniel and Schöner, Gregor and Kaup, Barbara}, title\t\t=\t{Interaction of polarity and truth value - A neural dynamic architecture of negation processing}, booktitle\t=\t{Proceedings of the 46th Annual Conference of the Cognitive Science Society}, editor\t\t=\t{Samuelson, L. K. and Frank, S. L. and Toneva, M. and Mackey, A. and Hazeltine, E.}, year\t\t=\t{2024}, } Kati, L., Sabinasz, D., Schöner, G., & Kaup, B. (2024). Interaction of polarity and truth value - A neural dynamic architecture of negation processing. In L. K. Samuelson, Frank, S. L., Toneva, M., Mackey, A., & Hazeltine, E. (Eds.), Proceedings of the 46th Annual Conference of the Cognitive Science Society. Toward a neural theory of goal-directed reaching movementsSchöner, G., Bildheim, L., & Zhang, L.In Levin, M F, Petrarca, M,, Piscitelli, D,, & Summa, S, (Eds.), Progress in Motor Control: From Neuroscience to Patient Outcomes (pp. 71–102) Academic Press Bibtex APA Downloads pre-print @incollection{SchönerBildheimZhang2024, author\t\t=\t{Schöner, Gregor and Bildheim, Lukas and Zhang, Lei}, title\t\t=\t{Toward a neural theory of goal-directed reaching movements}, booktitle\t=\t{Progress in Motor Control: From Neuroscience to Patient Outcomes}, editor\t\t=\t{Levin, M F and Petrarca, M and Piscitelli, D and Summa, S}, pages\t\t=\t{71–102}, publisher\t=\t{Academic Press}, year\t\t=\t{2024}, doi\t\t=\t{10.1016/B978-0-443-23987-8.00008-0}, } Schöner, G., Bildheim, L., & Zhang, L.. (2024). Toward a neural theory of goal-directed reaching movements. In Levin, M F, Petrarca, M,, Piscitelli, D,, & Summa, S, (Eds.), Progress in Motor Control: From Neuroscience to Patient Outcomes (pp. 71–102). Academic Press. http://doi.org/10.1016/B978-0-443-23987-8.00008-0 A Neural Dynamic Model Autonomously Drives a Robot to Perform Structured Sequences of Action IntentionsSehring, S., Koebe, R., Aerdker, S., & Schöner, G.In L. K. Samuelson, Frank, S. L., Toneva, M., Mackey, A., & Hazeltine, E. (Eds.), Proceedings of the 46th Annual Conference of the CognitiveScience Society Bibtex APA Downloads A Neural Dynamic Model Autonomously Drives a Robot to Perform Structured Sequences of Action Intentions @inproceedings{SehringKoebeAerdkerEtAl2024, author\t\t=\t{Sehring, Stephan and Koebe, Richard and Aerdker, Sophie and Schöner, Gregor}, title\t\t=\t{A Neural Dynamic Model Autonomously Drives a Robot to Perform Structured Sequences of Action Intentions}, booktitle\t=\t{Proceedings of the 46th Annual Conference of the CognitiveScience Society}, editor\t\t=\t{Samuelson, L. K. and Frank, S. L. and Toneva, M. and Mackey, A. and Hazeltine, E.}, year\t\t=\t{2024}, } Sehring, S., Koebe, R., Aerdker, S., & Schöner, G.. (2024). A",
  "content_length": 115878,
  "method": "requests",
  "crawl_time": "2025-12-01 13:15:45"
}