{
  "name": "Grigorios Chrysos 0002",
  "homepage": "https://grigoris.ece.wisc.edu",
  "status": "success",
  "content": "Dr. Grigorios Chrysos - Assistant Professor Grigorios Chrysos Assistant Professor University of Wisconsin-Madison chrysos [@] wisc.edu Madison, WI +1 (608) 2637768 About My name is Grigoris and I am an Assistant Professor in University of Wisconsin-Madison. My research focuses on trustworthy machine learning. I am particularly passionate about developing innovative algorithms and techniques that can understand and interpret data in complex real-world scenarios. I am recruiting motivated PhD students from the ECE or CS program. If you have already been admitted to UW-Madison ECE/CS PhD program and are interested in my research, I encourage you to reach out. If you are in Madison and are interested to learn more on trustworthy machine learning, I am teaching ECE/Stat/Math 888 next semester - we will have a significant component dedicated to trustworthy machine learning, so feel free to check it out. Research Interests Machine Learning Deep learning architectures, theoretical foundations of machine learning with applications to real-world problems. Trustworthy Machine Learning Robustness to malicious attacks, reasoning under uncertainty, privacy, algorithms that can adapt to changing environments. Parsimonious Learning Novel architectures, training methodologies, and efficient learning paradigms. Research Highlights Multilinear Mixture of Experts: Scalable Expert Specialization through Factorization Can we scale the number of experts to thousands? Paper Code Project NeurIPS 2024 Revisiting character-level adversarial attacks for Language Models How effective are simple character-level attacks in modern language models? Paper Code ICML 2024 Going beyond compositional generalization, DDPMs can produce zero-shot interpolation Can diffusion models synthesize content they have never seen during training? Paper Code ICML 2024 News Show More ▼ Service Service Awards Outstanding reviewer award in NeurIPS'23, NeurIPS'22, ICML'22, ICLR'22, ICML'21. Area Chair Area Chair in NeurIPS ('24, '25), ICLR ('25, '26), ICML ('25). Action Editor in TMLR. Tutorials and Workshops Tutorial on \"Foundations of Tensor Computations for AI\" in NeurIPS'25. Dagstuhl international seminar on \"Tensor Factorizations Meet Probabilistic Circuits\". Workshop titled \"Findings of ICCV\" in ICCV'25. Workshop titled \"Another Brick in the AI Wall: Building Practical Solutions from Theoretical Foundations\" in CVPR'25. Workshop titled \"Quantify Uncertainty and Hallucination in Foundation Models: The Next Frontier in Reliable AI\" in ICLR'25. Workshop titled \"CoLoRAI - Connecting Low-Rank Representations in AI\" in AAAI'25. Workshop titled \"Fine-Tuning in Modern Machine Learning\" in NeurIPS'24. Tutorial on \"Architecture Design: From Neural Networks to Foundation Models\" in IEEE International Conference on Data Science and Advanced Analytics (DSAA)'24. Tutorial on \"Scaling and Reliability Foundations in Machine Learning\" in IEEE International Symposium on Information Theory (ISIT)'24. Tutorial on \"Deep Learning Theory for Vision Researchers\" in CVPR'23. Tutorial on \"Polynomial nets in deep learning architectures\" in AAAI'23. Tutorial on \"High-degree polynomial networks for image generation and recognition\" in CVPR'22. Funding I would like to acknowledge the funding of the following organizations who have generously supported various events or projects in the past. I am very thankful for their support: 2025 Zulip Sponsored hosting from Zulip, which is an open-source team collaboration tool. 2024 Google and OpenAI Grants on trustworthy Large Language Models (LLMs). 2024 ELISE Fellows Mobility Program Travel grant for short-term visit of an ELLIS lab.",
  "content_length": 3665,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:01"
}