{
  "name": "Grigorios Loukides",
  "homepage": "https://www.kcl.ac.uk/people/grigorios-loukides",
  "status": "success",
  "content": "Grigorios Loukides | King's College London Skip to main contentDr Grigorios Loukides Deputy Head of the Algorithms and Data Analysis Research Group Senior Lecturer in Computer ScienceResearch interestsComputer scienceContact details+44 020 7848 0553grigorios.loukides@kcl.ac.ukBiographyGrigorios Loukides is a Senior Lecturer in the Department of Informatics at King's College London. Before joining King's, Grigorios was a Royal Academy of Engineering Research Fellow (2011-2016) and Assistant Professor in the School of Computer Science & Informatics, Cardiff University. Before that, he was a Postdoctoral Research Fellow at the Department of Biomedical Informatics, Vanderbilt University. Gregorios holds a PhD from Cardiff University and a Diploma from University of Crete, Greece, both in Computer Science. Grigorios is also a member of the Association of Computing Machinery and a Higher Education Academy Fellow. Research Interests Data Privacy Data Mining Biomedical Informatics Data Science/Analytics More Information Personal Website PublicationsResearchResearchFinance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Health HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Security HubThe Security Hub consolidates the research related to securitySustainability HubThe Sustainability Hub consolidates the research related to sustainabilityMachine LearningThe Machine Learning consolidates a broad range of research activities that are related to machine learning.King's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Algorithms and Data AnalysisThe group develops algorithmic solutions and concrete implementations for various applications.NewsNews07 April 2025New tool analyses huge amounts of data at record speedsNew tool analyses huge amounts of data at record speeds The algorithm can spot trends in hundreds of millions of data points in less than 20 minutes.Technology & ScienceBusiness & FinanceHealth22 September 2023New software detects money laundering faster than ever beforeThe tool can isolate suspicious and potential criminal behaviour three times more effectively than conventional methods. Technology & Science20 July 2018Informatics researchers awarded $75,000 PLuS Alliance Accelerator Award to study avian fluA team involving Dr Kathleen Steinhofel, Reader in the Department of Informatics, has been awarded a $75,000 PLuS Alliance Accelerator Award to study how...HealthTechnology & SciencePublicationsResearchNewsResearchFinance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Health HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Security HubThe Security Hub consolidates the research related to securitySustainability HubThe Sustainability Hub consolidates the research related to sustainabilityMachine LearningThe Machine Learning consolidates a broad range of research activities that are related to machine learning.King's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Algorithms and Data AnalysisThe group develops algorithmic solutions and concrete implementations for various applications.News07 April 2025New tool analyses huge amounts of data at record speedsNew tool analyses huge amounts of data at record speeds The algorithm can spot trends in hundreds of millions of data points in less than 20 minutes.Technology & ScienceBusiness & FinanceHealth22 September 2023New software detects money laundering faster than ever beforeThe tool can isolate suspicious and potential criminal behaviour three times more effectively than conventional methods. Technology & Science20 July 2018Informatics researchers awarded $75,000 PLuS Alliance Accelerator Award to study avian fluA team involving Dr Kathleen Steinhofel, Reader in the Department of Informatics, has been awarded a $75,000 PLuS Alliance Accelerator Award to study how...HealthTechnology & Science(N)5.13Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inConsumer and Organisational Digital Analytics (CODA)Department of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 4759,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:03"
}