{
  "name": "Gruia-Catalin Roman",
  "homepage": "http://www.cs.unm.edu/directory/faculty-profiles/gruia-catalin-roman.html",
  "status": "success",
  "content": "Gruia-Catalin Roman :: Department of Computer Science | The University of New Mexico The University of New Mexico UNM A-Z StudentInfo FastInfo myUNM Directory Support News Find People Contact Us Location Search About Us About Us Faculty Directory Affiliate Directory Staff Directory Committee Service Computer Facilities Colloquium News Life in New Mexico Accreditation Programs & Degrees Bachelor's B.S./M.S. Shared-Credit Degree Program Master's Ph.D. CS4ALL Minor in Computer Science Courses Prospective Undergraduate Students Prospective Graduate Students Undergraduate Accreditation (ABET) Research CS Research Faculty Research Interests Theoretical Foundations Advanced Distributed System Platforms Complexity of Social Computing Biological Systems and Processes Students Admissions Financial Aid Advisement & Help Advisement FAQ Organizations Departmental Scholarships Peer Tutoring Program DirectoryFaculty DirectoryStaff DirectoryAffiliated Faculty UNM>Home>Directory>Faculty>Gruia Catalin Roman Gruia-Catalin RomanContact gcroman@unm.eduPhone: 505-277-3112Fax: 505-277-6927Physical Address Room 2140Farris Engineering CenterBuilding # 119 on the UNM map Mailing Address01 1130 1 University of New Mexico Albuquerque, NM 87131-1070 Professor Department of Computer SciencePersonal WebsiteCurriculum VitaeEducationPh.D., Computer and Information Sciences, University of Pennsylvania, 1976M.S., Computer and Information Sciences, University of Pennsylvania,1974B.S., Computer Science and Engineering, University of Pennsylvania,1973BiographyIn the span of three decades, Roman has enjoyed a rewarding and exciting research career.  He published over 180 technical papers; graduated nineteen doctoral students, with the majority pursuing their own academic careers; secured strong levels of research funding, both alone and in collaboration with colleagues in the department and outside; held leadership positions in key international conferences; and served as associate and guest editor for several leading software engineering journals. His research spans a broad range of computer science subfields including mobile computing, formal design methods, visualization, distributed systems, interactive high speed computer vision, formal languages, biomedical simulation, computer graphics, and distributed database.  He has been partial to research endeavors associated with the emergence of novel intellectual developments and significant engineering challenges.Teaching InterestsSoftware engineeringMobile computingFormal methodsResearch InterestsPersonalized interactions with the Internet of Things, space cyber security, software for satellite swarms, software engineering, middleware, mobile computing, distributed and concurrent algorithms. Contact Info: (505) 277-3112 (phone) (505) 277-6927 (fax) Technical help: cssupport@cs.unm.edu All other questions: csinfo@cs.unm.edu The CS office hours 8 AM to 5 PM closed from 12 to 1PM for lunch. Location: Physical Location: Farris Engineering Center1901 RedondoMSC01 1130Suite 2200Albuquerque, NM 87131 Mailing Address: University of New Mexico Department of Computer Science MSC01 1130 1 University of New Mexico Albuquerque, NM 87131-0001 SOE Links School of Engineering Programs & Degrees Help & Advisement Research Useful Links Map & Directions Parking Life in Albuquerque & New Mexico Give to UNM Computer Science © The University of New Mexico, Albuquerque, NM 87131, (505) 277-0111 New Mexico's Flagship University Accessibility Legal Contact UNM",
  "content_length": 3512,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:03"
}