{
  "name": "Grzegorz Rozenberg",
  "homepage": "https://www.universiteitleiden.nl/en/staffmembers/grzegorz-rozenberg#tab-2",
  "status": "success",
  "content": "Grzegorz Rozenberg - Leiden University Skip to main content Grzegorz Rozenberg Professor emeritus of Theoretical computer science Name Prof.dr. G. Rozenberg Telephone +31 71 527 7067 E-mail g.rozenberg@liacs.leidenuniv.nl Grzegorz Rozenberg received his Master and Engineer degree in computer science in 1965 from the Technical University of Warsaw, Poland. In 1968 he obtained his Ph.D. in mathematics from the Polish Academy of Sciences, Warsaw. Since then he has held full-time positions at the Polish Academy of Sciences, Warsaw, Poland (assistant professor), Utrecht University, The Netherlands (assistant professor), State University of New York at Buffalo, U.S.A. (associate professor), and University of Antwerp, Belgium (professor). More information about Grzegorz Rozenberg News 14 December 2017 Grzegorz Rozenberg appointed Knight in the Order of the Netherlands Lion 19 January 2017 Life work award for computer scientist Grzegorz Rozenberg 10 November 2015 Sixth Honorary Doctorate for Grzegorz Rozenberg 25 July 2015 Fifth Honory Doctorate for Grzegorz Rozenberg 10 December 2014 Pascal Professor 2015 30 October 2014 Fourth Honory Doctorate for Grzegorz Rozenberg See also Personal webpage Former PhD candidates Robert Brijder Grzegorz Rozenberg received his Master and Engineer degree in computer science in 1965 from the Technical University of Warsaw, Poland. In 1968 he obtained his Ph.D. in mathematics from the Polish Academy of Sciences, Warsaw. Since then he has held full-time positions at the Polish Academy of Sciences, Warsaw, Poland (assistant professor), Utrecht University, The Netherlands (assistant professor), State University of New York at Buffalo, U.S.A. (associate professor), and University of Antwerp, Belgium (professor). Since 1979 he has been a professor at the Department of Computer Science of Leiden University and an adjoint professor at the Department of Computer Science of University of Colorado at Boulder, U.S.A. He was the head of the Theoretical Computer Science group at Leiden Institute of Advanced Computer Science (LIACS) and the scientific director of the Leiden Center for Natural Computing (LCNC). Professor emeritus of Theoretical computer science Faculty of Science Leiden Inst of Advanced Computer Science Work address Gorlaeus Building Einsteinweg 55 2333 CC Leiden Contact +31 71 527 7067 g.rozenberg@liacs.leidenuniv.nl Publications No relevant ancillary activities Share on Facebook Share by Bluesky Share on LinkedIn Share by WhatsApp Share by Mastodon Organisation Science Leiden Institute of Advanced Computer Science (LIACS) Theory This website uses cookies. More information. Accept cookies Reject cookies",
  "content_length": 2677,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:03"
}