{
  "name": "Grzegorz Stachowiak",
  "homepage": "https://www.ii.uni.wroc.pl/~gst",
  "status": "success",
  "content": "Grzegorz Stachowiak Ph.D. Welcome to my home page (ver. 10/15). It contains: About me Research interests Complete list of papers Schedule and teaching My addresses and telephones Bookmarks About me Born in 1964. Graduated (M.Sc.) in Theoretical Mathematics in 1988 from University of Wroclaw , Ph.D. in Mathematics in 1995 from UWr. Research interests Discrete mathematics. Design and analysis of algorithms. Cryptography. Complete list of papers The Number of Linear Extensions of Bipartite Graphs, Order 5 (1988), 257 - 259. A Relation between the Comparability Graph and the Number of Linear Extensions, Order 6 (1989), 241 - 244. Hamilton Paths in Graphs of Linear Extensions for Unions of Posets, SIAM Journal on Discrete Mathematics 5 (1992), 199-206. On a Long Cycle in the Graph of All Linear Extensions of a Poset Consisting of Two Disjoint Chains, Discrete Mathematics 131 (1994), 375-378. (with M. Kik and M. Kutylowski) Periodic Constant Depth Sorting Networks, STACS 1994, LNCS 775, 201-212. Finding Parity Difference by Involutions, Discrete Mathematics 163 (1997), 139-151. Fibonacci Correction Networks, SWAT 2000, LNCS 1851, 535-548. (with T. Jurdzinski) Probabilistic Algorithms for the Wakeup Problem in Single-Hop Radio Networks, ISAAC 2002, LNCS 2518, 535-549. Fast Periodic Correction Networks, FCT 2003, LNCS 2751, 144-156. Lower Bounds on Correction Networks, ISAAC 2003, LNCS 2906, 221-229. (with T. Jurdzinski) Probabilistic Algorithms for the Wakeup Problem in Single-Hop Radio Networks, Theory Comput. Syst. 38 (2005), 347-367. Fast Periodic Correction Networks, TCS, 354 (2006), 354-366. (with Marcin Bienkowski, Marek Chrobak, Christoph Durr, Mathilde Hurand, Artur Jez, Lukasz Jez) Collecting Weighted Items from a Dynamic Queue, SODA 2009, 1126-1135. Asynchronous Deterministic Rendezvous on the Line, SOFSEM 2009, 497-508. Teaching Kombinatoryka Kryptografia Matematyka dyskretna (M) My addresses and telephones E-mail to: Grzegorz.Stachowiak@ii.uni.wroc.pl Office: Institute of Computer Science University of Wroclaw ul. Joliot-Curie 15 50-383 Wroclaw, Poland phone: (+48+71)-375-7826 fax: (+48+71)-375-7801 room: 312",
  "content_length": 2151,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:06"
}