{
  "name": "Grzegorz Chrupala",
  "homepage": "http://grzegorz.chrupala.me",
  "status": "success",
  "content": "Grzegorz Chrupała Grzegorz Chrupała /ˈɡʐɛɡɔʂ xru'pawa/ Your browser does not support the HTML5 Audio element. I am an Associate Professor affiliated with the Center for Cognitive Science and Artificial Intelligence at Tilburg University. I received my PhD from the School of Computing at Dublin City University. After that I worked as a postdoctoral researcher at the Spoken Language Systems group at Saarland University. I am interested in computation in biological and artificial systems, and connections between them. See full bio. In my free time I like reading, taking photos, and hiking. Research in my lab focuses on computational approaches to multimodal communication. We take inspiration from the ease which young children show for picking up languages they are exposed to with little effort and no explicit instruction. The information they rely on is messy and unstructured, yet it is rich and multimodal, including speech and gestures, visual and auditory stimuli, and interaction with other people. In contrast, the typical way computers learn language is by reading billions of words of written text. We work on enabling machines to access rich data in multiple modalities and find systematic connections between them as a way to learn language in a more natural and data-efficient manner. We explore the limits of human-like learning, aiming to teach computers to deal not only with the world's largest languages, but also with those with little written material, or no writing system at all. We also develop, apply, and evaluate techniques for understanding computations in deep learning architectures. News Paper accepted to TACL: QE4PE: Word-level Quality Estimation for Human Post-Editing. We taught a tutorial on Interpretability Techniques for Speech Models at Interspeech 2025. Paper published at Interspeech 2025: On the reliability of feature attribution methods for speech classification. Hosein presented Posthoc Disentanglement of Textual and Acoustic Features in Self-Supervised Speech Encoders at an ICML workshop on actionable interpretability. I have joined the board of the Dutch Open Speech Technology Foundation. I am publicity co-chair for Interspeech 2025. I am an action editor for TACL. People Gaofei Shen. PhD candidate, Interpretability techniques for spoken language models. Gabriele Sarti. PhD candidate, User-centric interpretability for neural machine translation. Hosein Mohebbi. PhD candidate, Analyzing and interpreting deep neural models of language. Lisa Lepp. PhD candidate, Machine Translation for sign and spoken languages. Céline Angonin. PhD candidate, bioacoustics. Alumni Chris Emmery. PhD thesis: User-Centered Security in Natural Language Processing. Bertrand Higy. Postdoc, Understanding visually grounded spoken language via multi-tasking. Patrick\tBos and Christiaan Meijer. E-science engineers, Understanding visually grounded spoken language via multi-tasking. Ákos Kádár. PhD thesis: Learning Visually Grounded and Multilingual Representations. Publications For the complete list of publications check: Google Scholar | Semantic Scholar | DBLP | ACL Anthology | ORCID Selected papers Shen, G., Alishahi, A., Bisazza, A., Chrupała, G. (2023) Wave to Syntax: Probing spoken language models for syntax. In Proc. Interspeech 2023 (pp. 1259–1263). Paper | Code Nikolaus, M., Alishahi, A. & Chrupała, G. (2022). Learning English with Peppa Pig. Transactions of the Association for Computational Linguistics, 10, 922–936. Paper | Code Chrupała, G. (2022). Visually grounded models of spoken language: A survey of datasets, architectures and evaluation techniques. Journal of Artificial Intelligence Research, 73, 673–707. Paper Chrupała, G., & Alishahi, A. (2019). Correlating Neural and Symbolic Representations of Language. In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics (pp. 2952–2962). Paper | Code Chrupała, G., Gelderloos, L., & Alishahi, A. (2017). Representations of language in a model of visually grounded speech signal. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers) (pp. 613–622). Paper | Code Selected Talks Promises and pitfalls of unified NLP, NLG in the Lowlands, 2025 Putting natural back into Natural Language Processing, Second Dutch Speech Tech Day, 2024 Opening the black box of foundation models. Indeep Outreach/Amsterdam AI Meetup, 2023. TAISIG Talks - The opportunities and limitations of Deep Learning, Tilburg University, 2022. Learning language from Peppa Pig. ILLC seminar, University of Amsterdam, 2022. Visually Grounded Models of Spoken Language and their Analysis and Evaluation. Lectures on Computational Linguistics, AILC, 2021. Supervision Selected MSc theses Jean Constantin. 2022. Identification of causal discourse relations in French text using machine-translated training resources. Tilburg University. Kristel van Rooij. 2021. Gender classification of first names using Long Short-Term Memory recurrent neural networks and support vector machine in various countries. Tilburg University. Aayushi Pandey. 2020. Emotion recognition in a model of visually grounded speech. Tilburg University. Dmitrijs Surenans. 2020. Machine Learning Explainability In Finance: An Application to Default Risk Analysis. Tilburg University. Bio Grzegorz Chrupała is an Associate Professor at the Center for Cognitive Science and Artificial Intelligence at Tilburg University. Previously he did postdoctoral research at the Spoken Language Systems group at Saarland University. He received his doctoral degree from the School of Computing at Dublin City University. He is interested in computation in biological and artificial systems, and connections between them. His research focuses especially on computational models of learning (spoken) language in naturalistic multimodal settings, as well as analysis and interpretation of representations emerging in deep learning architectures. He is an Action Editor for TACL, and regularly serves as Senior Area Chair for major NLP and AI conferences such as ACL and EMNLP. He was one of the creators of the popular BlackboxNLP Workshop on Analyzing and Interpreting Neural Networks for NLP. His research has been funded by the Dutch Research Council (NWO). Contact Grzegorz Chrupała Department of Cognitive Science and Artificial Intelligence Tilburg University PO Box 90153 5000 LE Tilburg The Netherlands Bluesky: @grzegorz.chrupala.me Twitter: @gchrupala Web: grzegorz.chrupala.me Email: grzegorz@chrupala.me",
  "content_length": 6546,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:03"
}