{
  "name": "Grzegorz Kondrak",
  "homepage": "http://webdocs.cs.ualberta.ca/~kondrak",
  "status": "success",
  "content": "Greg Kondrak Greg Kondrak Professor Department of Computing Science University of Alberta Edmonton, AB, T6G 2E8, Canada Email: g[last-name]@ualberta.ca Teaching CMPUT 331: Computational Cryptography CMPUT 650: Computational Semantics Research My area of research is Natural Language Processing (NLP), or, more broadly, Computational Linguistics. I am particularly interested in: NLP at the sub-word level: letter-phoneme conversion, transliteration, orthography, morphology, word similarity, drug names Cognates: identification, projection, applications, machine translation, bitext alignment, diachronic linguistics Lexical Semantics: synonymy, polysemy, homonymy, translational equivalence, word sense disambiguation Computational Cryptography: decoding unknown scripts, cipher language identification Some media stories about my research. We have a weekly NLP group seminar. Visitors are welcome. Students Bradley Hauer Ning Shi Senyu Li Michael Ogezi NSERC Undergraduate Summer Research Projects Prospective students: Please read this before you contact me Selected Publications Computational Linguistics Constraint Satisfaction Google Scholar Resources Algorithms for Language Reconstruction (on-line demo prototype) ALINE phonetic aligner (compressed tar archive) A list of genetic cognates between French and English Cluster Labeling Study The Totonac-Tepehua Comparative Dictionary Project A demo of several word similarity functions Supplementary CELEX Orthographic Stress and Morphological Annotations Supplementary CMU Dictionary Syllable Annotations Speaker Annotations for \"Pride and Prejudice\" Software for Decoding Anagrammed Texts List of English Homonyms LabelProp and LabelSync from this paper Gold Corrections and New Mappings from this paper on concept mapping (LREC 2022) MCL-WiC annotated sample from this paper (NAACL 2022)",
  "content_length": 1846,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:02"
}