{
  "name": "Guanghui Liu 0001",
  "homepage": "http://faculty.uestc.edu.cn/liuguanghui/en/index.htm",
  "status": "success",
  "content": "Liu Guanghui Home çµå­ç§æå¤§å­¦ä¸»é¡µå¹³å°ç®¡çç³»ç» ä¸­æ Home Scientific Research Research Projects Published Books Patents Paper Publications Research Field Teaching Research Teaching Achievement Teaching Information Teaching Resources Awards and Honours Enrollment Information Student Information My Album Blog + Doctor of EngineeringWith Certificate of Graduation for Doctorate StudyUniversity of Electronic Science and Technology Recommended Ph.D.Supervisor Personal Information Gender:Male Business Address:Room 529, Zone B, Scientific Research Building, Qingshuihe Campus E-Mail:15e0922d20c99ea0246fd1051eb3d5e6c87c97f03b518ea737f9e85df32ce4f80d532e036c7738ad36d1b3072d4a08b495e6090bb21a987cbcf178fe8f63c2d92b6236bf6203b14ce32c8776d33ba4ca38ff6f60f8e566adec652cf1d7684a157d28fc53eb2e0968ced403645c09e2b402a80c5a6a8c84b335e7842e4c225201 VIEW MORE Personal Profile Guanghui Liu received M.Sc. and Ph.D. degrees in Electronic Engineering from the University of Electronic Science and Technology of China (UESTC), Chengdu, Sichuan, China in 2002 and 2005, respectively.In 2005, he joined Samsung Electronics, South Korea, as a Senior Engineer. Since 2009, he has been with the School of Electronics Engineering, UESTC, as an Associate Professor. Currently, he is a full Professor with UESTC. His research interests include digital signal processing and telecommunications, with an emphasis on digital video transmission, signal processing for wireless communications, and OFDM techniques. In these areas, he has published over 60 papers in refereed journals or conferences, and holds more than 40 patents (granted and pending). He served as the Publication Chairs of the ISPACS-2010 and the IEEE VCIP-2016. Educational Experience Work Experience Research Focus Social Affiliations No content No content No content IEEE Senior MemberServe as reviewer for IEEE Transactions on Broadcasting, IEEE Transactions on Communications, IEEE Transactions onWireless Communications, IEEE Transactions onVehicular Technology, IEEE Communications Letters, China Communications, etc.Publication Chairs of the IEEE ISPACS2010, IEEE VCIP2016, etc. Address: Shahe Campus:No.4, Section 2, North Jianshe Road, 610054  |  Qingshuihe Campus:No.2006, Xiyuan Ave, West Hi-Tech Zone, 611731  |   Chengdu, Sichuan, P.R.China Â© 2010 University of Electronic Science and Technology of China. All Rights Reserved Click: | The Last Update Time:.. | University of Electronic Science and Technology of China",
  "content_length": 2489,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:04"
}