{
  "name": "Guangjing Wang 0001",
  "homepage": "https://guangjing.wang",
  "status": "success",
  "content": "Guangjing Wang Biography News and Updates PhD Program Opportunities Biography Dr. Guangjing Wang is a tenure-track assistant professor in the Bellini College of Artificial Intelligence, Cybersecurity and Computing at the University of South Florida. He received his Ph.D. in computer science from Michigan State University in 2024, his master’s degree in computer science from the University of Science and Technology of China in 2020, and his bachelor’s degree in computer science from Southwest University in 2017. Dr. Wang’s research primarily focuses on data-centric AI, with an emphasis on developing robust, efficient, and privacy-preserving AI methodologies. He applies these methodologies to diverse application domains such as cybersecurity, mental health, and information forensics. His research has been published in top-tier computer science conferences, such as SIGMOD, ICDE, MobiCom, MobiSys, UbiComp, and INFOCOM. His current research interests mainly focus on the following topics: Agentic AI: Developing agentic AI-based systems for intelligent and trustworthy decision-making. Security of AI Systems: Addressing emerging challenges in safeguarding data, models, and systems. Mobile Sensing and Data Management: Advancing multimodal data collection, analysis, and management. News and Updates [10/22/2025] Our survey, led by the fourth-year PhD student Yuwen, “A Comprehensive Survey of Website Fingerprinting Attacks and Defenses in Tor: Advances and Open Challenges”, has been publicly released on ArXiv. Look forward to your feedback and thoughts! [09/03/2025] Guangjing is invited to serve on the program committee at the International Conference on Learning Representations (ICLR 2026). [08/22/2025] Guangjing is invited to serve on the program committee at the International Conference on Artificial Intelligence and Statistics (AISTATS 2026). [08/12/2025] Our preliminary work, led by the first-year PhD student Kai, “Agentic Shell Honeypot Using Structured Logging”, has been accepted to ACM CCS 2025 Poster Session. Stay tuned! [07/22/2025] Guangjing is invited to serve on the program committee at the IEEE International Conference on Parallel and Distributed Systems (IEEE ICPADS 2025). [07/10/2025] Guangjing is invited to serve on the program committee at the IEEE International Conference on Dependable and Secure Computing (IEEE DSC 2025). [06/03/2025] Guangjing is invited to serve on the program committee at the IEEE International Conference on Computer Communications (IEEE INFOCOM 2026). [04/22/2025] Guangjing is invited to serve on the program committee at the European Conference on Artificial Intelligence (ECAI 2025). [04/22/2025] Our paper “ClearMask: Noise-Free and Naturalness-Preserving Protection Against Voice Deepfake Attacks” has been accepted by the ACM ASIA Conference on Computer and Communications Security (ACM AsiaCCS 2025). [04/18/2025] Guangjing is invited to serve on the program committee at the IEEE International Conference on Trust, Privacy and Security in Intelligent Systems, and Applications (IEEE TPS 2025). [04/15/2025] Guangjing is invited to serve as a meta reviewer at the IEEE International Conference on Advanced Visual and Signal-Based Systems (IEEE AVSS 2025). [02/17/2025] Guangjing is invited to serve on the program committee at the Annual Conference on Neural Information Processing Systems (NeurIPS 2025). [01/13/2025] Guangjing is invited to serve on the program committee at the International Joint Conferences on Artificial Intelligence (IJCAI 2025). [12/18/2024] Guangjing is invited to serve on the program committee at the International Joint Conference on Neural Networks (IJCNN 2025). [12/16/2024] Guangjing is invited to serve on the program committee at the USENIX Symposium on Vehicle Security and Privacy (VehicleSec 2025). [12/11/2024] Guangjing is invited to serve on the program committee at the International Conference on Machine Learning (ICML 2025). [09/02/2024] Our paper “Optical Lens Attacks on Deep Learning Based Monocular Depth Estimation” has been accepted by the 20th International Conference on Security and Privacy in Communication Networks (EAI SecureComm 2024). [08/27/2024] Our paper “Joint Client-and-Sample Selection for Federated Learning via Bi-level Optimization” has been accepted by IEEE Transactions on Mobile Computing (IEEE TMC). [08/23/2024] Guangjing is invited to serve on the program committee at the International Conference on Learning Representations (ICLR 2025). [08/22/2024] Guangjing is invited to serve on the program committee at the Artifact Evaluation of the International Conference on Management of Data (SIGMOD 2024). [08/20/2024] Guangjing is invited to serve on the program committee at the IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2025). [08/20/2024] Guangjing is invited to serve on the technical program committee at the IEEE Consumer Communications and Networking Conference (CNCC 2025). PhD Program Opportunities Dr. Wang is looking for self-motivated students with a strong interest in one of the areas [AI, security, privacy, mobile and IoT systems]. Qualified candidates will be supported with full assistantships during the CS PhD program at the University of South Florida. Undergraduates are also warmly welcome to work with Guangjing to gain research experience. If this opportunity aligns with your research interests, please email Guangjing your resume and any supplementary materials that showcase your academic background and research experience. Dr. Guangjing Wang (He/him)",
  "content_length": 5572,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:06"
}