{
  "name": "Guanying Chen",
  "homepage": "https://guanyingc.github.io",
  "status": "success",
  "content": "Guanying Chen Guanying Chen About  / Publications  / People Guanying Chen   陈冠英 Hi, I am Guanying. I am currently an Associate Professor at the School of Cyber Science and Technology, Sun Yat-sen University (SYSU). [中文主页] I received my Ph.D. degree from the Department of Computer Science at The University of Hong Kong (HKU) in 2021. Before that, I received my B.Eng from Sun Yat-sen University. My current research focuses on multi-modal spatial intelligence, aiming to build autonomous agents that can perceive, reason, and act in complex 3D environments. Previously, I worked on 3D vision, neural rendering, and generative models. Email  / Gmail  / CV  / Github  / Google Scholar  / ORCID  / DBLP  / Zhihu ★ I am looking for Postdoc, PhD/Postgraduate students (2026 Fall), and RAs to work with me at SYSU, Shenzhen Campus. ☞ Details. News Sharing my experience in preparing papers/posters/thesis with LaTex in latex_paper_writing_tips . 2025-11: I will serve on the Neural Networks editorial board. 2025-11: One paper (CloseUpShot) is accepted by TVCG 2025! 2025-09: I will serve as an Area Chair for CVPR 2026. 2025-06: Three papers (RobustSplat, LHM, and MaterialMVP) are accepted by ICCV 2025, with one selected as a Highlight! 2025-02: I will serve as an Area Chair for NeurIPS 2025. 2025-02: One paper (AniGS) is accepted by CVPR 2025! 2024-06: Three papers (SphereHead, OMG, and DreamDissector) are accepted by ECCV 2024, with one selected as Oral! 2024-02: Two papers (AerialLifting and RichDreamer) are accepted by CVPR 2024, with one selected as a Highlight! 2023-07: One paper about Forward Flow NeRF is accepted by ICCV 2023 as the Oral Presentation! 2023-02: Two papers (REC-MV and MVImgNet) are accepted by CVPR 2023! 2022-12: I have shared a Zhihu article about \"NeRF代码解读-相机参数与坐标系变换\" in Chinese. 2022-03: I have shared some experiences in preparing figures for a paper with Python in python_plot_utils . Previous Experiences Oct 2021 - Mar 2024 Research Assistant Professor at The Chinese University of Hong Kong, Shenzhen. Feb 2021 - Sep 2021 Research Developer at Baidu Vision Department. Dec 2019 - Nov 2020 Research intern at Alibaba DAMO Academy working with Prof. Lei Zhang. Jun 2019 - Nov 2019 Research intern at Osaka University working with Prof. Yasuyuki Matsushita and Prof. Boxin Shi. Jun 2016 - Aug 2016 Research intern at SenseTime. Jul 2015 - Aug 2015 Research intern at The University of Hong Kong working with Prof. Kenneth K.Y. Wong. Research Highlight CVPR24: Neural Aerial Urban Semantic and Building Instance Lifting CVPR24: A Generalizable Normal-Depth Diffusion Model for Text-to-3D CVPR23: Reconstructing 3D Dynamic Cloth from Monocular Videos NeurIPS22: Neural Reflectance Field from a Single Viewpoint ECCV22: Neural Inverse Rendering for Multi-view Photometric Stereo ICCV21: Deep HDR Video Reconstruction and Real-world Dataset TPAMI22: Deep Photometric Stereo for Non-Lambertian Surfaces IJCV19: Learning Transparent Object Matting from a Single Image Selected Publications [Google Scholar] (# corresponding author, * equal contribution) Professional Services Area Chair: CVPR 2026, NeurIPS 2024/2025 Editorial Board: Neural Network (2026-) Conference Reviewer: CVPR, ICCV, ECCV, NeurIPS, ICML, ICLR, SIGGRAPH Journal Reviewer: TPAMI, IJCV, TVCG, TMM, RA-L, PR, C&G, GMOD, IMAVIS, RCIM 中国图象图形学学会三维视觉（CSIG-3DV）专委会，委员 视觉与学习青年学者研讨会（Valse）执行领域主席委员会，委员 计算机辅助设计与图形学（CAD&CG）专委会，委员 智能图形计算专委会，委员 计算机图形学与混合现实在线平台（GAMES）执行委员会，委员 Honors and Awards Major Talent Programs of Guangdong Province, Young Talents (2024) Top Reviewers in NeurIPS (2023) CCF Excellent Graphics Open Source Dataset (MVImgNet), CCF CAD&CD (2023) Global Top 100 Chinese Rising Stars in Artificial Intelligence, Baidu Scholar (2021) Experience Sharing / 经验分享 Paper/Poster LaTex Templates: latex_paper_writing_tips Latex template for CVPR/ICCV submission: Paper+Sup.+Rebuttal in Overleaf Python Scripts for Publication Plots: python_plot_utils CV Rebuttal Templates: cv_rebuttal_template My PhD Thesis LaTex Files: Guanying's HKU-PhD-Thesis-LaTex VIM and TMUX Configurations: Guanying's VIM_TMUX Configs 中山大学本科毕业论文: 2016年的非官方LaTex模版，现官方模版的早期版本 知乎文章：科研/开发常用工具 知乎文章：如何快速入门一个研究方向 知乎文章：Github代码使用指南 知乎文章：关于做实验和分析问题的一些浅见 知乎文章：NeRF代码解读-相机参数与坐标系变换 知乎文章：PyTorch3D渲染COLMAP重建的物体 知乎文章：Diffusion Model for 2D/3D Generation 相关论文分类 Website adapted from Jon Barron",
  "content_length": 4354,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:09"
}