{
  "name": "Guangming Shi",
  "homepage": "https://web.xidian.edu.cn/gmshi",
  "status": "success",
  "content": "石光明 | 个人信息 | 西安电子科技大学个人主页 学术信息网 西电导航 关于 使用说明 搜索 系统首页 登录 控制面板 收藏 石光明的留言板 石光明的主页:个人信息科学研究荣誉奖励科研团队论文成果课程教学招生信息English 基本信息石光明　教授  硕导/博导工作单位：人工智能学院/西电广州研究联系方式通信地址：西安电子科技大学134号信箱电子邮箱：gmshi@xidian.edu.cn办公电话：81891807学术讨论地点：主楼II-126会议室招生学科招生学科：计算机科学与技术、电路与系统 (博士与硕士，080902)研究方向：1. 类脑信息技术/语义信息技术2. 生物信息处理与脑启发智能技术3.计算成像理论与方法4.压缩感知理论及应用5.人机混合理论和方法6.系统芯片设计招生学科：导航、制导与控制（博士与硕士 081105） 研究方向：  1.光谱、微波、超声高分辨率探测计算成像  2.图像处理与视频跟踪  招生学科：智能信息处理(博士与硕士 081023)  研究方向：  1.人工智能与机器学习2.智能信号与信息表达与处理  3.大数据处理表达与处理  4.脑认知与脑机通讯 石光明，教授，博导，长江学者特聘教授       国家级人才，享受政府特殊津贴专家 西安电子科技大学 领军二级岗教授、博士生导师 国家部委生物与信息交叉领域专家 国家部委计算机领域专家 国家部委人工智能领域专家 中国教育部实验教学指导委员会委员 教育部科技委委员 IEEE Fellow, Chair of Chapter C&S in Xian IET Fellow， 中国电子学会会士、智能交互专委会副主任委员，互联网专委会委员、教育委员会委员 中国人工智能 脑科学与人工智能专委会副主任委员 中国自动化学会混合智能专委会委员 中国指挥与自动化学会富媒体分会委员 陕西省电子学会副理事长兼秘书长 教育部高等学校电子信息类专业教学指导委员会——人工智能专业建设咨询委员会  副主任委员 《飞行器测控学报》、《航天返回与遥感》编委 个人简介： 石光明，教授，男，分别于1985年、1988年和2002年在西安电子科技大学获学士、硕士、博士学位。国家级人才，IEEE Fellow，IET Fellow，中国电子学会会士，IEEE CAS 西安分会主席，中国人工智能学会脑科学与人工智能专委会、中国自动化学混合智能专委会委员，陕西自动化学会/信号处理学会常务理事，陕西省电子学会副理事长兼秘书长。 国家部委生物与信息交叉领域，AI领域、计算机应用领域等专家，教育部科技委委员，教育部实验教学指导委员会委员。 曾先后任我校电子工程学院教学副院长，国家工科电工电子基地主任/国家级电工电子实验示范中心主任，科学研究院常务副院长兼基础科研处处长，党委常委、副校长。 现任我校人工智能学院名誉院长，“超限智能感知前沿科学中心”主任，“类脑工程中心”主任。 以第一完成人荣获中国电子学会科学技术发明一等奖（2021），陕西省自然科学一等奖（2020），国家级自然科学二等奖1项（2017），在图像表达和重够方面，获得省部级科学技术一等奖1项（2013）、中国电子学会二等奖1项（2010）、国防科技进步奖三等奖1项（2009）。 以第一完成人荣获国家级教学成果二等奖1项（2014）、陕西省教学成果特等奖（2019），陕西省教学成果奖特等奖1项（2011）、中国电子学会实践教学成果奖一等奖1项（2009）。荣获陕西省省级教学名师荣誉称号（2011）、宝钢教育基金优秀教师荣誉称号（2011）、“微软学生俱乐部优秀指导教师”荣誉称号（2012）、“微软青年学者优秀指导教师”荣誉称号（2011）。 提出了语义刻画和度量策略，提出语义通信，即智能通信概念。 主要研究方向涉及信号和信息的“获取、”“表达”、“编码”、“重构”、“评价”与“认知”等过程。基本理论：压缩感知，语义度量、语义通信、语义交互，机器学习，光场成像，信息认知。涉及领域：遥感探测与成像（可见光、光谱、超声、微波），立体深度成像，智能通信，智联网，脑机混合，智能交互。 版权声明 未经西安电子科技大学以及个人主页教师本人许可，不得复制、转载和传播本页内容，禁止用于任何商业用途。如需转载请征得主页所有者同意，并附上主页链接！ 更新 石光明的留言板 技术支持：电院网络中心陕ICP备05016463号-3© 2025 西安电子科技大学",
  "content_length": 1845,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:05"
}