{
  "name": "Guanghui Wang 0001",
  "homepage": "https://www.cs.torontomu.ca/~wangcs",
  "status": "success",
  "content": "Guanghui Wang Home People Research Publications Courses Download Resources Openings Computer Vision and Intelligent Systems Laboratory Department of Computer Science Toronto Metropolitan University Toronto Ontario Canada Guanghui (Richard) Wang Associate Professor Department of Computer Science Toronto Metropolitan University Toronto Canada Email: wangcs@torontomu­.ca Tel: (416) 979-5000 Education Ph.D. University of Waterloo, 2014 Memberships Senior Member IEEE, The Institute of Electrical and Electronics Engineers Elected Full Member Sigma Xi, The Scientific Research Honor Society Member iBEST, Institute for Biomedical Engineering, Science and Technology Work Experience Associate Professor, Toronto Metropolitan University, 2020 - present Associate/Assistant Professor, University of Kansas, 2014 - 2020 Research Interests Computational Vision: Structure from motion, stereo vision, visual measurement Image Analysis: Image classification, object detection, image matching, image translation Autonomous Systems: Robot navigation, multisensor data fusion, simultaneous localization & mapping Artificial Intelligence: Deep learning, machine learning, visual attention, semantic segmentation, scene classification Courses CP 8315. Special Doctoral Topics ‐ AI & Robotics (Toronto Metropolitan University) CP 8207. Special Topics: Core Computer Science (Toronto Metropolitan University) CP 8307. Introduction to Computer Vision (Toronto Metropolitan University) CPS 843. Introduction to Computer Vision (Toronto Metropolitan University) CPS 109. Computer Science I (Toronto Metropolitan University) CPS 621. Introduction to Multimedia Systems (Toronto Metropolitan University) EECS 740. Digital Image Processing (University of Kansas) EECS 741. Computer Vision (University of Kansas) EECS 444. Control Systems (University of Kansas) Books Wang, G. & Wu, J. Guide to Three Dimensional Structure and Motion Factorization, Springer-Verlag, ISBN: 978-0-85729-045-8, 2011. Buy it from Springer and Amazon. Wang, G. (ed.). (2016). Recent Advances in Robotic Systems. InTech. ISBN: 978-953-51-2570-9, 2016. Buy it from Amazon. Selected Publications Nori, M., Kim, M., & Wang, G. (2025). Autoencoder-Based Hybrid Replay for Class-Incremental Learning. The 42nd International Conference on Machine Learning (ICML), (acceptance rate: 26.9%). 2025 pdf. code. Ahmad, N., Khan, J., Shin, G., Lee., Y., & Wang, G. (2025). Keypoints as Dynamic Centroids for Unified Human Pose and Segmentation. The 34th International Joint Conference on Artificial Intelligence (IJCAI), (acceptance rate: 19.3%). 2025 pdf. code. Jung D., Kim, D. Wang, G., Kim, T. (2025). Exposure-slot: Exposure-centric representations learning with Slot-in-Slot Attention for Region-aware Exposure Correction. IEEE/CVF Computer Vision and Pattern Recognition Conference (CVPR), (acceptance rate: 22.1%). 2025 pdf. code. Nori, M., Kim, I. & Wang, G. (2025). Federated Class-Incremental Learning: A Hybrid Approach Using Latent Exemplars and Data-Free Techniques to Address Local and Global Forgetting. The Thirteenth International Conference on Learning Representations (ICLR), (acceptance rate: 32%). 2025 pdf. code. Xiao, X., Hu, Q., & Wang, G. (2024). FgC2F-UDiff: Frequency-guided and Coarse-to-fine Unified Diffusion Model for Multi-modality Missing MRI Synthesis. IEEE Transactions on Computational Imaging, vol.10, pdf. code. Chao, W., Duan, F., Guo, Y., & Wang, G. (2024). MaskBlur: Spatial and Angular Data Augmentation for Light Field Image Super-Resolution. IEEE Transactions on Multimedia, vol.26, pdf. code. Xu, W., Long, C., Nie, Y., & Wang, G. (2024). Disentangled Representation Learning for Controllable Person Image Generation. IEEE Transactions on Multimedia, vol.25, pdf. code. Chao, W., Duan, F., Wang, X., Wang, Y., & Wang, G. (2024). OccCasNet: Occlusion-aware Cascade Cost Volume for Light Field Depth Estimation. IEEE Transactions on Computational Imaging, vol.26, pdf. code. Xiao, X., Hu, Q., & Wang, G. (2023). Edge-aware Multi-task Network for Integrating Quantification Segmentation and Uncertainty Prediction of Liver Tumor on Multi-modality Non-contrast MRI. International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI) 2023 (early acceptance 14%) pdf. Chao, W., Wang, X., Wang, Y., Wang, G., Duan F. (2023). Learning Sub-Pixel Disparity Distribution for Light Field Depth Estimation. IEEE Transactions on Computational Imaging, vol.10, pdf. code. Li, K., Zhang, Z., Zhong, C., & Wang, G. (2022). Robust Structured Declarative Classifiers for 3D Point Clouds: Defending Adversarial Attacks with Implicit Gradients. IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2022. pdf. source code. Ma, W., Tu, X., Luo, B., & Wang, G. (2022). Semantic clustering based deduction learning for image recognition and classification. Pattern Recognition, vol.124, pdf. code. (impact factor: 7.74) Xu, W., Long, C., Wang, R., & Wang, G. (2021). DRB-GAN: A Dynamic ResBlock Generative Adversarial Network for Artistic Style Transfer. IEEE/CVF International Conference on Computer Vision (ICCV), oral (acceptance rate: 3%). pdf. code. Xu, W., & Wang, G. (2021). A Domain Gap Aware Generative Adversarial Network for Multi-domain Image Translation. IEEE Trans. on Image Processing, 2021. (impact factor: 10.856) Xia, S., Xu, S., Wang, R., Li, J., & Wang, G. (2021). Building instance mapping from ALS point clouds aided by polygonal maps. IEEE Trans. on Geoscience and Remote Sensing, https://doi.org/10.1109/TGRS.2021.3087159. 2021. (impact factor: 5.855) Ma, W., Tu, X., Luo, B., & Wang, G. (2021). Semantic clustering based deduction learning for image recognition and classification. Pattern Recognition, vol.124, pdf. code. (impact factor: 7.74) Cen, F., Zhao, X., Li, W., & Wang, G. (2021). Deep feature augmentation for occluded image classification. Pattern Recognition, https://doi.org/10.1016/j.patcog.2020.107737. 2021. (impact factor: 7.74) Sajid, U., Sajid, H., Wang, H., & Wang, G. (2020). ZoomCount: A zooming mechanism for crowd counting in static images . IEEE Transactions on Circuits and Systems for Video Technology. DOI: 10.1109/TCSVT.2020.2978717. 2020. Ma, W., Wu, Y, Cen, F., & Wang, G. (2020). MDFN: Multi-scale deep feature learning network for object detection.Pattern Recognition. vol.100. 2020. Cen F., & Wang, G. (2019). Boosting occluded image classification via subspace decomposition based estimation of deep features. IEEE Transactions on Cybernetics, DOI:  10.1109/TCYB.2019.2931067. 2019. Sui, Y., Zhang Z., Wang, G., Tang, Y., & Zhang, L., (2019). Exploiting the anisotropy of correlation filter learning for visual tracking. International Journal of Computer Vision (IJCV), doi.org/10.1007/s11263-019-01156-6, 2019. Sui, Y., Wang, G., & Zhang, L., (2019). Joint correlation filtering for visual tracking. IEEE Transactions on Circuits and Systems for Video Technology, DOI: 10.1109/TCSVT.2018.2888573. 2019. Sui, Y., Wang, G., & Zhang, L., (2019). Sparse subspace clustering via low-rank structure propagation. Pattern Recognition. vol. 95, pp. 261-271, 2019. Xu, W., Keshmiri, S., & Wang, G. (2019). Adversarially approximated autoencoder for image generation and manipulation. IEEE Transactions on Multimedia. DOI:  10.1109/TMM.2019.2898777. 2019 Xu, W., Keshmiri, S., & Wang, G., (2019). Toward learning a unified many-to-many mapping for diverse image translation. Pattern Recognition. vol. 93, pp. 570-580, 2019. Sui, Y., Tang, Y., Zhang, L.,Wang, G., (2018). Visual tracking via subspace learning: A discriminative approach. International Journal of Computer Vision (IJCV), vol. 126 (5), pp.515-536, 2018. Huo, J., Wu, J., Cao, J., & Wang, G. (2018). Supervoxel based method for multi-atlas segmentation of brain MR images. NeuroImage, vol.175, pp.201-214 2018. He, L., Wang, G., & Hu, Z. (2018). Learning depth from single images with deep neural network embedding focal length,.IEEE Transactions on Image Processing, vol.27(9), pp. 4676 - 4689, 2018 Sui, Y., Wang, G., Zhang, L., &Yang, M.X. (2018). Exploiting spatial-temporal locality of tracking via structured dictionary learning. IEEE Transactions on Image Processing, vol.27(3), pp.1282-1296, 2018. Bharati, S., Wu, Y., Sui, Y., Padgett, C., & Wang, G. (2018). Real-time obstacle detection and tracking for sense-and-avoid mechanism in UAVs. IEEE Transactions on Intelligent Vehicles, DOI: 10.1109/TIV.2018.2804166, 2018. Zhang,, Z., Wu, Y., & Wang, G. (2018). BPGrad: Towards global optimality in deep learning via branch and pruning. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2018. Sui, Y., Wang, G., Zhang, L.(2017). Correlation filter learning toward peak strength for visual tracking. IEEE Transactions on Cybernetics, vol. 48 (4) pp.1290-1303. 2018. Wu, F., Zhang, M., Wang, G., & Hu, Z. (2016). Triangulation and metric of lines based on geometric error. Computer Vision and Image Understanding, vol.145, pp.111-127, 2016. Sui, Y., Wang, G., Tang, Y., Zhang, L. (2016). Tracking completion, European Conference on Computer Vision (ECCV), 2016. Sui, Y., Zhang, Z., Wang, G., Tang, Y., Zhang, L. (2016). Real-time visual tracking: promoting the robustness of correlation filter learning, European Conference on Computer Vision (ECCV), 2016. Wang, G., Zelek, J., & Wu, J. (2012). Structure and motion recovery based on spatial-and-temporal-weighted factorization. IEEE Trans. on Circuits and Systems for Video Technology (T-CSVT), 22(11), 1590-1603, 2012. Zhang, W., Wu, J., & Wang, G. (2012). Tracking and pairing vehicle headlight in night scenes. IEEE Trans. on Intelligent Transportation Systems, 13(1), 140-153, 2012. Wang, G., & Wu, J. (2010). Quasi-perspective projection model: Theory and application to structure and motion factorization from uncalibrated image sequences. International Journal of Computer Vision (IJCV), 87(3), 213-234, 2010. Wang, G., & Wu, J. (2010). The quasi-perspective model: Geometric properties and 3D rec",
  "content_length": 11105,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:08"
}