{
  "name": "Guanbin Li",
  "homepage": "http://guanbinli.com",
  "status": "success",
  "content": "Guanbin Li (李冠彬) Biography I am currently a full Professor in School of Computer Science and Engineering, Sun Yat-sen University. I received my PhD degree in computer science from the University of Hong Kong, advised by Prof. Yizhou Yu. I also hold a MS degree and a BE degree in computer science and technology from Sun Yat-sen University in 2009 and 2012 respectively. I have more than 150 publications in international conferences and journals, including TPAMI, TNNLS, TIP, CVPR, ICCV, ICML, AAAI and IJCAI, etc. My current research interests include computer vision, machine learning and medical image analysis. I am co-supervising the HCP-I2 Lab: Human-Cyber-Physical Intelligence Integration, SYSU. I am recruiting self-motivated Ph.D / Master students in computer vision and machine learning. If you are interested in, please directly send me your resume. Email: liguanbin(at)mail.sysu.edu.cn [Google Scholar][中文版] News 2025-06: 12 papers are accepted by ICCV2025 2025-06: One paper is accepted by T-MI 2025-06: One paper is accepted by T-KDE 2025-05: Two papers are accepted by MICCAI2025 2025-05: One paper is accepted by ICML 2025 and is selected as spotlight 2025-04: One paper is accepted by ICME2025 and is selected as oral 2025-03: One paper is accepted by T-MM 2025-02: Seven papers are accepted by CVPR2025 2025-01: One paper is accepted by T-IP 2025-01: One paper is accepted by ISBI2025 2024-12: Two papers are accepted by AAAI2025 2024-10: One paper is accepted by T-PAMI 2024-10: One paper is accepted by JBHI 2024-09: Two papers are accepted by NeurIPS 2024, with one Spotlight paper 2024-07: Two papers are accepted by ACM MM 2024 2024-07: Three papers are accepted by ECCV2024 2024-06: One paper is accepted by MICCAI2024 2024-04: One paper is accepted by T-MI 2024-03: One paper is accepted by Siggraph2024 for Journal track 2024-02: Seven papers are accepted by CVPR2024, with one oral paper 2024-02: Five papers are accepted by ISBI 2024 2023-12: Five papers are accepted by AAAI2024 2023-11: One paper is accepted by Medical Image Analysis(MIA) 2023-11: One paper is accepted by T-IP 2023-10: One paper is accepted by WACV 2023 2023-10: One paper is accepted by T-NNLS 2023-10: One paper is accepted by PR 2023-10: One paper is accepted by T-IP 2023-10: One paper is accepted by BioInformatics 2023-09: One paper is accepted by Siggraph Asia 2023-08: I am honered to be sponsored by NSFC for excellent youth scholars (国家优青) 2023-07: One paper is accepted by ACM MM 2023 and is selected as Oral representation. 2023-07: Eight papers are accepted by ICCV2023 2023-06: One paper is accepted by T-PAMI 2023-06: One paper is accepted by T-NNLS 2023-06: One paper is accepted by JBHI 2023-06: Six papers are accepted by MICCAI2023, with two Early Accept papers 2023-06: Two papers are accepted by IJCAI2023 2023-03: Eight papers are accepted by CVPR2023, with two Highlight papers 2023-03: One paper is accepted by T-IP 2023-01: One paper is accepted by ISBI 2023 2023-01: One paper is accepted by T-PAMI 2022-11: Two papers are accepted by AAAI 2023 2022-11: One paper is accepted by Computers in Biology and Medicine 2022-11: Two papers are accepted by Journal of Software 2022-09: One paper is accepted by NeurIPS 2022 2022-07: Two papers are accepted by ECCV 2022 2022-06: Two papers are accepted by ACM MM 2022 2022-06: One paper is accepted by T-MI 2022-05: One paper is accepted by T-PAMI 2022-05: One paper is accepted by IEEE Transactions on Industrial Informatics 2022-05: Six papers are provisionally accepted by MICCAI2022 2022-04: Two papers are accepted by IJCAI 2022 2022-03: Two papers are accepted by CVPR 2022, including one oral paper 2022-03: Three papers are accepted by ICME 2022 2022-01: Four papers are accepted by ISBI 2022, including two oral papers Research Interest Computer Vision Image Understanding, including saliency detection, multi-label image classification, visual captioning, visual question answering. Image Processing, including image super-resolution, color sketch generation, image inpainting. Other Applications, including visual tracking, person re-identification and crowd counting. Machine Learning Deep Learning, including deep CNN, LSTM, Attention Modeling, Generative Adversarial Network, Reinforcement Learning Classic Machine Learning Branches, including SVM, Random forest, Boosting, etc. Weakly supervised learning Academic Services I serve as an area chair of CVPR 2024. I serve as an associate editor of \"The Visual Computer\". I serve as an area chair of VISAPP2019. I serve as a program committee member of CVPR2017~2022, NeurlPS2020~2021, ECCV2020 && 2022, ICCV2019 && 2021, IJCAI2018~2022, AAAI2018~2022. Reviewer for: IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI) International Journal of Computer Vision (IJCV) IEEE Transactions on Image Processing (T-IP) IEEE Transactions on Neural Networks and Learning Systems (T-NNLS) IEEE Transactions on Multimedia (T-MM) IEEE Transactions on Cybernetics (T-Cyb) ACM SIGGRAPH2017/SIGGRAPH Asia 2018 Selected Honors & Awards 2023 National Science Fund for Excellent Young Scholars by NSFC (国家优青) 2021 ICMR Best Poster Paper Award 2020 Wu Wenjun Outstanding Youth Award for Artificial Intelligence (吴文俊人工智能优青) 2019 Guangdong Natural Science Funds for Distinguished Young Scholar (广东省杰青) 2019 ICCV Best Paper Nomination 2019 ACM China Rising Star Nomination Award 2019 The First Prize of Science and Technology awarded by CSIG 2018 Excellent Award of CCF-Tencent Research Fund 2012 Hong Kong PhD Fellowship",
  "content_length": 5606,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:03"
}