{
  "name": "Guangmo Tong",
  "homepage": "https://udel.edu/~amotong",
  "status": "success",
  "content": "Home Home Home Home Computational Data Science Lab Department of Computer and Information Sciences University of Delaware We are the Computational Data Science lab at the University of Delaware. We are working on developing algorithmic and machine learning solutions towards effective and efficient decision makings in various systems, such as computational social networks, real-time embedded systems, and autonomous systems. We are particularly interested in theoretically-grounded methods with performance guarantees concerning approximation ratio, time and space complexity, learnability and generalization bounds, and other quantitative metrics that are context-dependent. Recent News ☸ [Pin][Hiring] 2025-2026: We are looking for excellent candidates for Ph.D. positions in the Department of Computer and Information Sciences at the University of Delaware. Please see [HERE]. ♦ Research areas: algorithms and combinatorial optimization, statistical learning, and AI for complex reasoning. ♦ Note: We are particularly looking for students with math/stats degrees. ☸ [May 2025] Samuel will join us in the summer for NASA Space Grant Summer Internship. Welcome! ☸ [April 2025] Yifan received 2025 Lauri Pfeffer Shinn Memorial Award. Congrats! ☸ [Jan 2025] Hypergraph Neural Networks? Paper Generalization Performance of Hypergraph Neural Networks accepted by The Web Conference (WWW) 2025 as oral presentation. Congrats to Yifan! ☸ [Jan 2025] Wenzhen joined our lab as a Ph.D. Student. Welcome! ☸ [Jan 2025] Learning over data structure of sets? Paper Advances in Set Function Learning: A Survey of Techniques and Applications accepted by ACM Computing Surveys (CSUR) 2025. Congrats to Jiahao! ☸ [Dec 2024] We received the Best Paper Award of the 13th International Conference on Computational Data and Social Networks (CSoNet). Congrats to the students! ☸ [Oct 2024] Trung and Brendon joined our lab as research assistances. Welcome! ☸ [Sep 2024] We will work on an exciting NSF project to explore data-driven methods for social influence management [Link]. Thanks to NSF for support! ☸ [July 2024] Mina has successfully defended her PhD dissertation and will join Lincoln University as an Assistant Professor. Congratulations Mina! ☸ Solving one optimization problem by leveraging the solutions to another optimization problem is possible. Paper Query-decision Regression between Shortest Path and Minimum Steiner Tree accepted by PAKDD 2024 ☸ [Feb 2024] Jiahao joined our lab as a Ph.D. Student. Welcome! ☸Dr. Tong received the 2024 Outstanding Faculty Research Award, Department of Computer and Information Sciences, University of Delaware. Communities are different. Our Sponsors",
  "content_length": 2687,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:07"
}