{
  "name": "Guan-Hua Tu",
  "homepage": "http://www.cse.msu.edu/~ghtu",
  "status": "success",
  "content": "Guan-Hua Tu Home Publications Research Professional activities Teaching People@SNMS Guan-Hua (Scott) Tu Associate Professor Department of Computer Science and Engineering, Michigan State University 428 S SHAW LN, ROOM 3115 East Lansing, MI 48824-1266 Email: ghtu AT msu.edu Office: 1124 Engineering Building Welcome I am an associate professor in the Department of Computer Science and Engineering at Michigan State University, and leading the Security, Networking, and Mobile Systems Research (SNMS) laboratory (@ 2153EB) in the department. I received a Ph.D. degree in Computer Science from University of California, Los Angeles, where I was a member of the WiNG group led by Professor Songwu Lu, in 2015. Before that, I worked at MediaTek as a wireless communication software engineer, project manager, and researcher (invented eight US patents). I received an MS degree in Computer Science from National Taiwan University in 2003 and a Bachelor's degree in Computer Science from National Central University in 2001. My research interests are in the broad areas of security, IoT, mobile systems, and wireless networking, with a recent focus on innovating 5G/4G mobile network architecture/protocol/technologies, cellular/Wi-Fi IoT, secure cloud computing/services, blockchain technologies. Recent News [Aug. 2025] My Ph.D. student Yiwen Hu will join the Department of Computer Science and Electrical Engineering at University of Maryland, Baltimore County (UMBC) as a Tenure-Track Assistant Professor this Fall. Congratulations. [Aug. 2025] Invited to serve on ACM MOBICOM'26 TPC. Please consider submitting. [June 2025] Invited to serve on IEEE INFOCOM'26 TPC. Please consider submitting. [June 2025] My Ph.D. student Jingwen Shi will join the Palo Alto Networks, as a Senior Staff Security Researcher. Congratulations. [Aug. 2024] Our emergency service (9-1-1) paper is accepted by ACM MobiCom'24. [July 2024] Our MOBICOM '22 paper, titled 'Uncovering Insecure Designs of Cellular Emergency Services (911),' was selected for the SIGMOBILE Research Highlights. [July 2024] Invited to serve on ACM MOBICOM'25 TPC. Please consider submitting. [May 2024] Invited to serve on IEEE INFOCOM'25 TPC. Please consider submitting. [Mar. 2024] Our 911 security paper is accepted by IEEE/ACM Transactions on Networking. [Dec. 2023] Received a $1.73M NTIA grant (as a Co-PI) to support our 5G O-RAN security project. [Nov. 2023] Our 5G/4G IMS security paper is conditionally accepted by ACM MobiCom'24. [Sep. 2023] I am invited to serve on the panel AI for xG Security at IEEE CNS'23. Please consider attending CNS'23. [Aug. 2023] Receive an NSF NeTS grant (CNS-2321416, PI) to support our research on Exploring the Non-Standardized Polices, Operations, and Requirements for 5G Cellular Networks and Beyond: Advancing the Modeling, Tools, and Evaluation. [Aug. 2023] Our cellular IoT security paper is accepted by IEEE/ACM Transactions on Networking. [Aug. 2023] Our paper focusing on side-channel attacks against mobile users is accepted by IEEE CNS'23. [Apr. 2023] My Ph.D. student Tian Xie will join the Department of Computer Sciecne at Utah State University as a Tenure-Track Assistant Professor this Fall. Congratulations. [Apr. 2023] Receive $1.2M NSF SaTC grant (the lead PI of CNS-2246050 and CNS-2246051) to support our research on Safeguarding Next-Generation Emergency Services (NG-9-1-1) over Cellular Networks. [Mar. 2023] I am invited to serve on the IEEE ICNP'23 TPC. [Mar. 2023] I am invited to serve as a Publication Chair at IEEE CNS'23. [Feb. 2023] I am invited to serve on the IEEE CNS'23 TPC. [Dec. 2022] Our 911 security paper was selected for ACM GetMobile Research Highlights. [Oct. 2022] Our 911 security paper received the Best Community Paper Award Runner-Up at ACM MobiCom'22; the Best Community Paper Award is considered to contribute the most to the broader research community by making public real data, software, platform, or other artifacts. [Aug. 2022] Our IMS security paper is accepted by IEEE/ACM Transactions on Networking. [Aug. 2022] Our cellular emergency service (9-1-1) security paper is accepted by ACM MobiCom'22. [Apr. 2022] I am invited to serve on the IEEE INFOCOM'23 TPC. [Apr. 2022] I am invited to serve on the IEEE CNS'22 TPC. [Ja.n 2022] Our MPKIX (Mobile-assisted PKIX) paper is accepted by IEEE Transactions on Mobile Computing. [Oct. 2021] Our wireless human walking tracking paper is accepted by IEEE Internet of Thing Journal. [Aug. 2021] Our cellular IoT security apper is accepted by ACM MobiCom'21. [Jul. 2021] My Ph.D. student Xinyu Lei joins the Department of Computer Science at Michigan Technological University (Michgian Tech) as a Tenure-Track Assistant Professor. Congratulations. [Jun. 2021] I am invited to serve on MobiCom'22 TPC. [Dec. 2020] Two Bitcoin security papers are accepted by ACM CodaSpy'21. [Oct. 2020] I am invited to serve on the IEEE VNC'21 TPC and IFIP Networking'21 TPC. [Aug. 2020] I am invited to serve on the IEEE BigData'21 TPC. [Jul. 2020] I am invited to serve on MobiCom'21 TPC. [May 2020] Our Wi-Fi Calling (VoWiFi) security paper is accepted by IEEE Transactions on Mobile Computing. [Apr. 2020] Our Wi-Fi IoT security paper is accepted by ACM MobiSys'20. [Mar. 2020] Our cellular IoT security paper is accepted by IEEE Transactions on Mobile Computing. [Mar. 2020] Our cloud security paper is accepted by IEEE CNS'20. 2015 ©Guan-Hua Tu. All rights reserved. Top",
  "content_length": 5451,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:04"
}