{
  "name": "Guangming Tan",
  "homepage": "https://people.ucas.ac.cn/~tgm",
  "status": "success",
  "content": "谭光明-中国科学院大学-UCAS [中文] [English] 招生信息 教育背景 代表性论文 工作经历 基本信息 谭光明 男 博导 计算技术研究所现任中科院计算技术研究所研究员、高性能计算机研究中心主任。国家杰出青年基金获得者，参与了曙光系列高性能计算机包括曙光4000/5000/6000/7000系统研制。发表学术论文100余篇，包括CCF A类会议（SC、PPoPP、PLDI）和Nature子刊等，曾任IEEE TPDS编委和多个国际会议的程序委员。曾获得国家科技进步奖二等奖、北京市科技进步奖一等奖、卢嘉锡青年人才奖和全国向上向善好青年称号。电子邮件：tgm@ict.ac.cn 通信地址：科学院南路6号 邮政编码：100190 研究领域 并行算法、编程和体系结构 招生信息 招生方向 高性能计算并行编程体系结构 教育背景 2006-08--2007-08   University of Delaware   访问学者2002-09--2008-03   中国科学院计算技术研究所   工学博士1998-09--2002-07   湘潭大学   理学学士 代表性论文 [1].     Ning Kang, Guojun Yuan, Zihan Yan, Beining Zhang, Boyang Li, Zeyu Li, Shuo Wang, Guanglei Chen, Jiayi Rao, Zhan Wang, Weile Jia, Ninghui Sun, Guangming Tan, MD-pipe: A Strong Scaling Enhanced Pipeline Architecture for Ab Initio Accuracy Molecular Dynamics. ISCA 2025: 1956-1968.[2].     Zhiheng Lin, Ke Meng, Changjie Xu, Weichen Cao, Guangming Tan, Jupiter: Pushing Speed and Scalability Limitations for Subgraph Matching on Multi-GPUs. EuroSys 2025: 558-572.[3].     Zhanyuan Di, Leping Wang, En Shao, Zhaojia Ma, Ziyi Ren, Feng Hua, Lixian Ma, Jie Zhao, Guangming Tan, Ninghui Sun, Optimizing Deep Learning Inference Efficiency through Block Dependency Analysis. ASPLOS (2) 2025: 719-733.[4].     Weijian Liu, Mingzhen Li, Guangming Tan, Weile Jia, Mario: Near Zero-cost Activation Checkpointing in Pipeline Parallelism. PPoPP 2025: 197-211.[5].     Yaoyu Wang, Xiao Guo, Junmin Xiao, De Chen, Guangming Tan, GeneralSparse: Bridging the Gap in SpMM for Pruned Large Language Model Inference on GPUs. USENIX ATC 2025: 417-432.[6].     Weichen Cao , Ke Meng , Zhiheng Lin , Guangming Tan, GLumin: Fast Connectivity Check Based on LUTs For Efficient Graph Pattern Mining. PPoPP 2025: 455-468[7].     Ruihao Gao, Zhichun Li, Guangming Tan, Xueqi Li, BeeZip: Towards An Organized and Scalable Architecture for Data Compression. ASPLOS (3) 2024: 133-148[8].     Zhiheng Lin, Ke Meng, Chaoyang Shui, Kewei Zhang, Junmin Xiao, Guangming Tan, Exploiting Fine-Grained Redundancy in Set-Centric Graph Pattern Mining. PPoPP 2024: 175-187[9].     Siyu Hu, Tong Zhao, Qiuchen Sha, Enji Li, Xiangyu Meng, Liping Liu, Lin-Wang Wang, Guangming Tan, Weile Jia, Training one DeePMD Model in Minutes: a Step towards Online Learning. PPoPP 2024: 257-269[10].  Jianxiong Li, Boyang Li, Zhuoqiang Guo, Mingzhen Li, Enji Li, Lijun Liu, Guojun Yuan, Zhan Wang, Guangming Tan, Weile Jia, Scaling Molecular Dynamics with ab initio Accuracy to 149 Nanoseconds per Day. SC 2024: 30[11].  Dechuang Yang, Yuxuan Zhao, Yiduo Niu, Weile Jia, En Shao, Weifeng Liu, Guangming Tan, Zhou Jin, Mille-feuille: A Tile-Grained Mixed Precision Single-Kernel Conjugate Gradient Solver on GPUs. SC 2024: 58[12].  Mingyi Li, Junmin Xiao, Kewei Zhang, Zhiheng Lin, Chaoyang Shui, Ke Meng, Zehua Wang, Yunfei Pang, Guangming Tan, A Coordinated Strategy for GNN Combining Computational Graph and Operator Optimizations. ICS 2024: 460-472[13].  Yewen Li, Xueqi Li, Ruihao Gao, Wanqi Liu, Guangming Tan. \"NvWa: Enhancing Sequence Alignment Accelerator Throughput via Hardware Scheduling.\" HPCA 2023[14].  Siyu Hu, Wentao Zhang, Qiuchen Sha, Feng Pan, Lin-Wang Wang, Weile Jia, Guangming Tan, Tong Zhao. \" RLEKF: An Optimizer for Deep Potential with Ab Initio Accuracy. \" AAAI 2023[15].  Jianxiong Li, Tong Zhao, Zhuoqiang Guo, Shunchen Shi, Lijun Liu, Guangming Tan, Weile Jia, Guojun Yuan, Zhan Wang, Enhance the Strong Scaling of LAMMPS on Fugaku. SC 2023: 97:1-97:13[16].  Junmin Xiao, Chaoyang Shui, Di Cai, Kangyu Wang, Yunfei Pang, Mingyi Li, Hui Ma, Guangming Tan, Adaptive Workload-Balanced Scheduling Strategy for Global Ocean Data Assimilation on Massive GPUs. SC 2023: 78:1-78:15[17].  Shaofeng Yang, Xiandong Liu, Yunting Wang, Xin He, Guangming Tan, Fast All-Pairs Shortest Paths Algorithm in Large Sparse Graph. ICS 2023: 277-288[18].  Zhen Du, Jiajia Li, Yinshan Wang, Xueqi Li, Guangming Tan, Ninghui Sun, AlphaSparse: Generating High Performance SpMV Codes Directly from Sparse Matrices, SC 22[19].  Wei Hu, Hong An, Zhuoqiang Guo, Qingcai Jiang, Xinming Qin, Junshi Chen, Weile Jia, Chao Yang, Zhaolong Luo, Jielan Li, Wentiao Wu, Guangming Tan, Dongning Jia, Qinglin Lu, Fangfang Liu, Min Tian, Fang Li, Yeqi Huang, Liyi Wang, Sha Liu, Jinlong Yang, 2.5 Million-Atom Ab Initio Electronic-Structure Simulation of Complex Metallic Heterostructures with DGDFT, SC 2022 (GB Finalist)[20].  Junmin Xiao, Yunfei Pang, Qing Xue, Chaoyang Shui, Ke Meng, Hui Ma, Mingyi Li, Xiaoyang Zhang, Guangming Tan, W-Cycle SVD: A Multilevel Algorithm for Batched SVD on GPUs, SC 2022[21].  Ruihao Gao, Xueqi Li, Yewen Li, Xun Wang, Guangming Tan: MetaZip: a high-throughput and efficient accelerator for DEFLATE. DAC 2022: 319-324[22].  Zhongzhe Hu, Junmin Xiao, Zheye Deng, Mingyi Li, Kewei Zhang, Xiaoyang Zhang, Ke Meng, Ninghui Sun, Guangming Tan, MegTaiChi: dynamic tensor-based memory management optimization for DNN training. ICS 2022: 25:1-25:13[23].  Zhuoqiang Guo, Denghui Lu, Yujin Yan, Siyu Hu, Rongrong Liu, Guangming Tan, Ninghui Sun, Wanrun Jiang, Lijun Liu, Yixiao Chen, Linfeng Zhang, Mohan Chen, Han Wang, Weile Jia, Extending the limit of molecular dynamics with ab initio accuracy to 10 billion atoms. PPoPP 2022: 205-218 工作经历 工作简历 2014-10~现在, 中国科学院计算技术研究所, 研究员2011-11~2014-10,计算体系结构国家重点实验室, 副研究员2008-03~2014-10,中国科学院计算技术研究所, 副研究员 声明：导师网页信息由导师个人维护，仅代表导师本人。教师系统仅提供信息存储空间服务。2013 © 中国科学院大学，网络信息中心.",
  "content_length": 5367,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:05"
}