{
  "name": "Guanyang Wang",
  "homepage": "https://guanyangwang.github.io",
  "status": "success",
  "content": "Guanyang Wang - Assistant Professor of Statistics Home Research Teaching News Archive CV Guanyang Wang   王冠扬 Guanyang Wang Assistant Professor Department of Statistics Rutgers University, New Brunswick Contact Office 453, Hill Center 110 Frelinghuysen Road Piscataway, NJ 08854 Email: guanyang.wang [at] rutgers [dot] edu About me Welcome! I am an assistant professor in the Department of Statistics at Rutgers University, New Brunswick. I received my Ph.D. in Mathematics (Ph.D. minor in Statistics) from Stanford University in August 2020, advised by Prof. Persi Diaconis. Prior to that, I received my B.S. with Honors in Mathematics from University of Science and Technology of China (USTC) in Jun 2015. With several friends and colleagues, we organize a weekly online seminar on Monte Carlo methods. Check out our recorded videos here! My Erdős number is 2 ( [1] , [2] , and [3]. ) My research is partially supported by NSF DMS-2210849, NSF FET-2403007, and an Adobe Data Science Research Award. Thank you! Research Interests My research primarily focuses on Monte Carlo methods, generative AI, quantum computing, and probability. Feel free to reach out if you would like to discuss our shared interests. I particularly encourage students with a strong programming background to get in touch. If you'd like to read some of my recent articles, you may want to look at: Diffusion Models and Generative AI Antithetic Noise in Diffusion Models Jing Jia, Sifan Liu, Bowen Song, Wei Yuan, Liyue Shen, Guanyang Wang [arXiv] CCS: Controllable and Constrained Sampling with Diffusion Models via Initial Noise Perturbation Bowen Song, Zecheng Zhang, Zhaoxu Luo, Jason Hu, Wei Yuan, Jing Jia, Zhengxu Tang, Guanyang Wang, Liyue Shen [arXiv] NeurIPS 2025 Quantum Computing Quantum speedup of non-linear Monte Carlo problems Jose Blanchet, Yassine Hamoudi, Mario Szegedy, Guanyang Wang [arXiv] NeurIPS 2025, spotlight Monte Carlo Methods On importance sampling and independent Metropolis-Hastings with an unbounded weight function George Deligiannidis, Pierre E. Jacob, El Mahdi Khribch, Guanyang Wang [arXiv] Spectral gap bounds for reversible hybrid Gibbs chains Qian Qin, Nianqiao Ju, Guanyang Wang [arXiv] the Annals of Statistics, 2025, 53(4): 1613-1638. Probability Theory Repeated averages on graphs Ramis Movassagh, Mario Szegedy, Guanyang Wang the Annals of Applied Probability 2024, Vol 34 (4), 3781-3819. [arXiv] People Current Students Wei Yuan (Statistics, fifth year Ph.D. student) Budhaditya Halder (Statistics, fifth year Ph.D. student) Jing Jia (Computer Science, third year Ph.D. student, co-advised with Peng Zhang) Alumni Yasa Syed (Statistics Ph.D., graduated in 2025, First Job: Quantitative Researcher at Venerable) Recent News Paper A phase transition in sampling from Restricted Boltzmann Machines with Youngwoo Kwon, Qian Qin, and Yuchen Wei is accepted at the Annals of Applied Probability (AoAP) (Oct, 2025). Paper Quantum speedup of non-linear Monte Carlo problems with Jose Blanchet, Yassine Hamoudi and Mario Szegedy is accepted at NeurIPS 2025 as a spotlight (Sep, 2025). Paper CCS: Controllable and Constrained Sampling with Diffusion Models via Initial Noise Perturbation with Bowen Song, Liyue Shen and others is accepted at NeurIPS 2025 (Sep, 2025). New paper Antithetic Noise in Diffusion Models with Jing Jia, Sifan Liu, Bowen Song, Wei Yuan, and Liyue Shen is on arxiv (Jun, 2025). Paper \"Connecting Quantum Computing with Classical Stochastic Simulation\" with Jose Blanchet, Mark S. Squillante and Mario Szegedy is accepted for a 90-minute tutorial presentation at the 2025 Winter Simulation Conference (WSC) and for publication in the WSC 2025 Proceedings (Jun, 2025). Paper Spectral gap bounds for reversible hybrid Gibbs chains with Qian Qin and Nianqiao Ju accepted in the Annals of Statistics (AoS) (Mar, 2025). Paper Differentially Private Range Queries with Correlated Input Perturbation with Prathamesh Dharangutte, Jie Gao , and Ruobin Gong accepted at Artificial Intelligence and Statistics (AISTATS) 2025 (Jan, 2025). New paper On importance sampling and independent Metropolis-Hastings with an unbounded weight function with George Deligiannidis , Pierre E. Jacob, and El Mahdi Khribch is on arxiv. (Nov, 2024) New paper A phase transition in sampling from Restricted Boltzmann Machines with Youngwoo Kwon, Qian Qin, and Yuchen Wei is on arxiv. (Oct, 2024) With Valentin De Bortoli, Yang Chen , Nianqiao Ju , Sifan Liu , Sam Power , Qian Qin , we have launched a weekly online seminar on Monte Carlo methods!(Sep, 2024) Our collaborative proposal (PI: Mario Szegedy , Co-PI: Jose Blanchet and myself) Quantum Monte Carlo Speed Ups for Multilevel Computations and Other Statistical Algorithms [1] [2] has been awarded a $1.19 million grant by the NSF! Excited :) (Jul 2024). Recent Works Antithetic Noise in Diffusion Models Jing Jia **, Sifan Liu ⟐, Bowen Song, Wei Yuan, Liyue Shen ⟐, Guanyang Wang⟐ [arxiv] CCS: Controllable and Constrained Sampling with Diffusion Models via Initial Noise Perturbation Bowen Song, Zecheng Zhang, Zhaoxu Luo, Jason Hu, Wei Yuan, Jing Jia, Zhengxu Tang , Guanyang Wang⟐, Liyue Shen ⟐ [arXiv] NeurIPS 2025 Quantum speedup of non-linear Monte Carlo problems Jose Blanchet, Yassine Hamoudi, Mario Szegedy, Guanyang Wang* [arXiv] NeurIPS 2025, spotlight Connecting Quantum Computing with Classical Stochastic Simulation Jose Blanchet, Mark S. Squillante, Mario Szegedy, Guanyang Wang* 2025 Winter Simulation Conference (WSC) , accepted On importance sampling and independent Metropolis-Hastings with an unbounded weight function George Deligiannidis, Pierre E. Jacob, El Mahdi Khribch , Guanyang Wang* [arXiv] A phase transition in sampling from Restricted Boltzmann Machines Youngwoo Kwon, Qian Qin, Guanyang Wang*, Yuchen Wei [arXiv] the Annals of Applied Probability (AoAP) , accepted Markov chain Monte Carlo without evaluating the target: an auxiliary variable approach Wei Yuan **, Guanyang Wang [arXiv] [Code] Submitted When are Unbiased Monte Carlo Estimators More Preferable than Biased Ones? Guanyang Wang, Jose Blanchet, Peter Glynn [arXiv] Submitted Quadratic Speed-up in Infinite Variance Quantum Monte Carlo Jose Blanchet, Mario Szegedy, Guanyang Wang* [arXiv] Submitted Differentially Private Range Queries with Correlated Input Perturbation Prathamesh Dharangutte, Jie Gao, Ruobin Gong, Guanyang Wang* [arXiv] AISTATS 2025 Spectral gap bounds for reversible hybrid Gibbs chains Qian Qin, Nianqiao Ju, Guanyang Wang [arXiv] the Annals of Statistics , 2025, 53(4): 1613-1638. Spectral telescope: Convergence rate bounds for random-scan Gibbs samplers based on a hierarchical structure Qian Qin, Guanyang Wang* the Annals of Applied Probability (AoAP) 2024, Vol 34(1B), 1319-1349. [Blog by Sam] [Slides by Qian] Prediction and Design of Protease Enzyme Specificity Using a Structure-Aware Graph Convolutional Network Changpeng Lu, Joseph H. Lubin, Vidur S. Sarma, Samuel Z. Stentz, Guanyang Wang, Sijian Wang, Sagar D. Khare Proceedings of the National Academy of Sciences (PNAS) 2023, 120 (39) e2303590120. [bioRxiv] Repeated averages on graphs Ramis Movassagh, Mario Szegedy, Guanyang Wang* the Annals of Applied Probability (AoAP) 2024, Vol 34 (4), 3781-3819. [arXiv] * = alphabetical order, † = equal contribution, ⟐ = corresponding author, ** = student first author Miscellaneous Chinese Painting Generation Using Generative Adversarial Networks Guanyang Wang, Ying Chen, Yuan Chen CS231n Course Project, 2017. [Chinese Painting Dataset] Pattern detection in bipartite networks: a review of terminology, applications and methods Zachary Neal, Annabel Cadieux, Diego Garlaschelli, Nicholas J. Gotelli, Fabio Saracco, Tiziano Squartini, Shade T. Shutters, Werner Ulrich, Guanyang Wang, Giovanni Strona Accepted, PLOS Complex Systems . [arXiv] Website enhanced with assistance from Claude",
  "content_length": 7876,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:08"
}