{
  "name": "Guanchu Wang",
  "homepage": "https://guanchuwang.github.io/home",
  "status": "success",
  "content": "Guanchu Wang Home Publications Research Demo Teaching and Mentoring Guanchu (Gary) Wang Assistant Professor Department of Computer Science University of North Carolina at Charlotte Address: 9201 University City Blvd, Charlotte, NC 28223 Email: [CV] [Linkedin] [Google Scholar] [DBLP] [ResearchGate] [Paper with code] About me I am an assistant professor in the Department of Computer Science at University of North Carolina at Charlotte. I earned my Ph.D. in Computer Science from Rice University in 2025, under the guidance of Dr. Xia Hu and Dr. Vladimir Braverman. My research focuses on Trustworthy AI, with a particular emphasis on the explainability, reliability, and safety of foundation models. In addition, I collaborate closely with health informaticians at UTHealth and Baylor College of Medicine, leveraging AI to address critical challenges in healthcare. I'm actively looking for self-motivated PhD students and research interns. If you are interested, please email your CV to . News and Highlights 10/2025: Our paper Catastrophic Forgetting in Kolmogorov-Arnold Networks. is accepted by AAAI 2025! Congrats to all co-authors! See [Paper]. 09/2025: Our paper Breaking the Frozen Subspace: Importance Sampling for Low-Rank Optimization in LLM Pretraining. is accepted by NeurIPS 2025! Congrats to all co-authors! See [Paper]. 08/2025: Our paper Self-Ensemble: Mitigating Confidence Distortion for Large Language Models. is accepted by EMNLP 2025 Findings! Congrats to all co-authors! See [Paper]. 08/2025: Our paper A Decoupled Multi-Agent Framework for Complex Text Style Transfer. is accepted by EMNLP 2025 Findings! Congrats to all co-authors! See [Paper]. 05/2025: Our paper Quantized Can Still Be Calibrated: Understanding and Improving Uncertainty Calibration for Quantized Large Language Models. is accepted by ACL 2025! Credits to all co-authors! See [Paper]. 05/2025: Our paper MAIN-RAG: Multi-Agent Filtering Retrieval-Augmented Generation. is accepted by ACL 2025! Credits to all co-authors! See [Paper]. 10/2024: Our paper Taylor Unswift: Secured Weight Release for Large Language Models via Taylor Expansion. has attracted 175.9K views and 1.7K like on Twitter; 1K like on Xiaohongshu; and 5.6K impressions and 70 reactions on LinkedIn🔥! See [Twitter] [Xiaohongshu] [LinkedIn] 09/2024: Our work Taylor Unswift: Secured Weight Release for Large Language Models via Taylor Expansion. is accepted by EMNLP 2024! Credits to all co-authors! See [Paper]. 09/2024: Our benchmark paper KV Cache Compression, But What Must We Give in Return? A Comprehensive Benchmark of Long Context Capable Approaches. is accepted by EMNLP 2024 Findings! Credits to all co-authors! See [Paper]. 08/2024: Our open-source dataset, corpora, and benchmark paper on LLMs for rare disease diagnosis have been released! See [Dataset] [Corpora] [Code] [Paper]. 07/2024: Our work Efficient GNN Explanation via Learning Removal-based Attribution is published on TKDD! See [Paper] and [Code]. 07/2024: Our benchmark paper on KV Cache Compression has been released! See [Paper] and [Code]. 06/2024: Our benchmark paper on training foundational time-series models has been released! See [Paper], [Code], [Twitter], [Medium], and [Zhihu]. 05/2024: Our work TVE: Learning Meta-attribution for Transferable Vision Explainer is accepted by ICML 2024! See [Paper]. 03/2024: My pleasure of receiving the Doctoral Forum Travel Award in SDM 2024 (Society for Industrial and Applied Mathematics)! 02/2024: It is my honor to have received the admission of Future Leader Summit 2024! 11/2023: Our Natural Language UI for the NORD Rare-disease Database is online! [APP]. 10/2023: Our work DiscoverPath: A Knowledge Refinement and Retrieval System for Interdisciplinarity on Biomedical Research achieves the Best Paper Honorable Mention in CIKM 2023! Thanks to all of the co-authors! See [Paper]. 09/2023: Our work Winner-Take-All Column Row Sampling for Memory Efficient Adaptation of Language Model is accepted by NeurIPS 2023! See [Paper]. 09/2023: Our work Chasing Fairness under Distribution Shift: a Model Weight Perturbation Approach is accepted by NeurIPS 2023! See [Paper]. 08/2023: Our work DiscoverPath: A Knowledge Refinement and Retrieval System for Interdisciplinarity on Biomedical Research is accepted by CIKM 2023 demo track! See [Paper] [Code] [Demo] [FrontEnd]. 06/2023: Our work Mitigating Algorithmic Bias with Limited Annotations is accepted by ECML-PKDD 2023! See [Paper]. 04/2023: Our work DIVISION: Memory Efficient Training via Dual Activation Precision is accepted by ICML 2023! See [Paper]. 03/2023:Invited poster in the Energy High Performance Computing Conference sponsored by the Ken Kennedy Institute. 03/2023:Invited talk in the seminor of CS department at Rice University. See [Talk]. 02/2023: Our efficient XAI survey paper has been reported by TechBeat and Tencent Developer! See [TechBeat] and [Tencent]. 02/2023: Our opensource project DiscoverPath has been released! See [DiscoverPath] for online demo; and [Github] for source code. 01/2023: Our work CoRTX: Contrastive Learning for Real-time Explanations. is accepted by ICLR 2023! See [Paper] 12/2022: It's my honor to have received the KKI 2022/23 Graduate Fellowship from the Ken Kennedy Institute of Rice University. See [the Full List]. 10/2022: Our real-time object detection demo work achieves the Best Paper Award in CIKM 2022! Thanks to all of the co-authors! See [Paper]. 09/2022: Our Accelerating Shapley Explanation via Contributive Cooperator Selection is selected as the Spotlight of ICML 2022! See [Paper]. 08/2022: Tutorial of medical anomaly detection using TODS has been released! See [Github]. 08/2022: Our real-time object detection system based on MAX78000 is accepted by CIKM 2022 Demo Track! See [Github]. 06/2022: Our work Accelerating Shapley Explanation via Contributive Cooperator Selection is accepted by ICML 2022! See [Paper]. 12/2021: Our real-time object detection based on MAX78000 for edge devices has been released! See [Github]. 10/2021: Two papers Fairness via Representation Neutralization and Revisiting Time Series Outlier Detection: Definitions and Benchmarks are accepted by NeurIPS 2021! 09/2020: Our opensource package TODS is accepted by AAAI 2021 Demo Track! See [Paper]. 06/2020: Opensource package TODS for end-to-end time-series outlier detection has been online! See [Github]. 04/2020: Our work Independent Skill Transfer for Deep Reinforcement Learning is accepted by IJCAI 2020 (Accepted rate 12.6%)! See [Paper].",
  "content_length": 6530,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:03"
}