{
  "name": "Guanhua Yan",
  "homepage": "https://www.binghamton.edu/cs/people/ghyan.html",
  "status": "success",
  "content": "School of Computing | Binghamton University Skip to main content School of Computing School of Computing Professor named IEEE fellow Distinguished Professor Lijun Yin is a pioneer in the field of three- and four-dimensional modeling of the human face. He has released a series of facial-scan databases used by Hollywood filmmakers, video-game creators and more. READ MORE Artificial intelligence (AI) is transforming the world and reshaping career opportunities, and the School of Computing is at the forefront of this revolution. With state-approved AI tracks in undergraduate and graduate programs, we equip students with comprehensive AI knowledge and skills to meet evolving workforce demands. Our faculty, including over 10 AI specialists, deliver a cutting-edge curriculum covering areas like machine learning, deep learning, natural language processing and AI security, with most courses integrating AI topics. Committed to advancing AI research and education, the School of Computing prepares students to lead in this dynamic field. Join us! Undergraduate Undergraduate computer science majors at Binghamton become effective, versatile coders and software developers using the C, C++, Python and Java programming languages; develop an important foundational understanding of algorithms, computer architecture, and operating systems; and advance to study other cutting-edge topics including machine learning, cybersecurity, cloud computing, data science and mobile computing. The Bachelor of Science program in Computer Science is accredited by the Computing Accreditation Commission of ABET, http://www.abet.org, under the commission’s General Criteria and Program Criteria for Computer Science and Similarly Named Computing Programs. Computer Science (BS) Computer Science (Minor) Graduate Our programs are designed for students interested in pursuing research studies or careers in computer science and software engineering. Our curriculum provides students with a solid theoretical and practical foundation. Computer Science (MS) Computer Science (PhD) INFORMATION SYSTEMS (MS) BS+MSCS and BS+MBA (4+1 Programs) GRADUATE CYBERSECURITY CERTIFICATE News More News JOB OPPORTUNITIES Currently seeking to fill three tenure-track assistant professor positions. Find out more QUESTIONS? Call the department at 607-777-4802. Blind since birth, writing code at Amazon since 2013 After receiving his computer science degree at Binghamton University, Michael Forzano '13 interviewed to become a software engineer at Amazon. He walked in the door, revealed to the interviewers that he was blind, and earned himself a job by impressing them with the code he wrote on his laptop. Learn more about Forzano Videos Support Computer Science Return to Top Last Updated: 4/10/25",
  "content_length": 2770,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:08"
}