{
  "name": "Gudula Rünger",
  "homepage": "https://www.tu-chemnitz.de/informatik/PI/professur/inhaber/index.php",
  "status": "success",
  "content": "Inhaberin | Professur | Professur Praktische Informatik | Fakultät für Informatik | TU Chemnitz Inhaberin | Professur | Professur Praktische Informatik | Fakultät für Informatik | TU Chemnitz Professur Praktische Informatik Prof. Dr. Gudula Rünger Anschrift Technische Universität ChemnitzFakultät für InformatikStr. der Nationen 6209111 Chemnitz Kontakt Büro: 308 / A10.308 E-Mail: ruenger@… Telefon: 0371 531-31794 Fax: 0371 531-831794 Sprechstunde Sprechstunde nach Vereinbarung Lehrbücher: Buchautorin Prof. Rünger ist Buchautorin des bekannten Lehrbuches zur Parallelverarbeitung Parallele und verteilte Programmierung, das in deutscher und englischer Sprache in mehreren Auflagen erschienen ist. Die aktuellste Auflage mit dem Titel Parallel Programming for Multicore and Cluster Systems (3rd Edition) ist 2023 erschienen. Parallel Programming for Multicore and Cluster Systems (2nd Edition), 2013 Parallele Programmierung, 2012 Parallel Programming for Multicore and Cluster Systems, 2010 Multicore: Parallele Programmierung, 2008 Parallele und verteilte Programmierung, 2000 Parallel Programming for Multicore and Cluster Systems (3rd Edition), 2023 Forschungsschwerpunkt: Parallele und verteilte Systeme Prof. Rünger ist Sprecher des Forschungsschwerpunktes Parallele und verteilte Systeme an der Fakultät für Informatik der Technischen Universität Chemnitz. Der Schwerpunkt vereint verschiedene Teilgebiete der Informatik und erforscht neue Wege der Programm- und Softwareentwicklung für parallele und verteilte Systeme. Aktuelle Veröffentlichungen Rauber, T.; Rünger, G.: Software-defined Support for the Execution of Task-graph-based Applications on Cloud Environments. In: 2024 11th International Conference on Software Defined Systems (SDS): S. 140-147. IEEE. Gran Canaria, Spanien, 2025. DOI: 10.1109/SDS64317.2024.10883920 Onlineressource verfügbar Rauber, T.; Rünger, G.: Trade-Off Between Energy Consumption and Solution Accuracy for a Multithreaded Spectral Method Implementation. In: Parallel Processing and Applied Mathematics. PPAM 2024. Lecture Notes in Computer Science, vol 15579: S. 17-33. Springer Nature Switzerland. Ostrava, Tschechien, 2025. DOI: 10.1007/978-3-031-85697-6_2 Onlineressource verfügbar Jakobs, T.; Klöckner, O.; Rünger, G.: Parallelization with load balancing of the weather scheme WSM7 for heterogeneous CPU-GPU platforms. In: The Journal of Supercomputing. Springer, 2024. DOI: 10.1007/s11227-024-06009-9 Onlineressource verfügbar Rauber, T.; Rünger, G.: Pareto-Optimal Execution of Parallel Applications with Respect to Time and Energy. In: Proceedings of the 13th International Conference on Smart Cities and Green ICT Systems (SMARTGREENS 2024).: S. 65-72. SciTePress  –  ISBN 978-989-758-702-3. Angers, Frankreich, 2024. DOI: 10.5220/0012627100003714 Onlineressource verfügbar Rauber, T.; Rünger, G.: Parallel Programming for Multicore and Cluster Systems, Third Edition. Springer Verlag  –  ISBN 978-3-031-28923-1 (Print), 978-3-031-28924-8 (Online), 2023. DOI: 10.1007/978-3-031-28924-8 Onlineressource verfügbar Vollständige Publikationsliste Aktivitäten Program Committee, Workshop on Education for High-Performance Computing (EduHPC-17), November 13, 2017 Steering Committee, 18th IEEE International Workshop on Parallel and Distributed Scientific and Engineering Computing (PDSEC 2017), June 2, 2017 Program Committee: Posters and Research Demos, 17th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGrid 2017), May 14–17, 2017 Program Committee: Applications of Parallel and Distributed Computing (Track Chair), 16th International Conference on Algorithms and Architectures for Parallel Processing (ICA3PP 2016), December 14–16, 2016 Program Committee, 15th International Conference on Ubiquitous Computing and Communications (IUCC-2016), December 14–16, 2016 Program Committee, Workshop on Education for High-Performance Computing (EduHPC-16), November 14, 2016 Program Committee, 8th International Conference on Internet Computing for Science and Engineering (ICICSE|16), August 13–14, 2016 Steering Committee, 17th IEEE International Workshop on Parallel and Distributed Scientific and Engineering Computing (PDSEC 2016), May 27, 2016 Program Committee, 24th High Performance Computing Symposium (HPC 2016), April 3–6, 2016 Program Committee, 24th International Conference on Parallel Architectures and Compilation Techniques (PACT 2015), October 18–21, 2015 Program Committee, 11th International Conference on Parallel Processing and Applied Mathematics (PPAM 2015), September 6–9, 2015 Program Committee, International Conference on Parallel Computing (ParCo 2015), September 1–4, 2015 Steering Committee, 16th IEEE International Workshop on Parallel and Distributed Scientific and Engineering Computing (PDSEC-15), May 29, 2015 Program Committee, 24th International Heterogeneity in Computing Workshop (HCW 2015), May 25, 2015 Program Committee, 23rd High Performance Computing Symposium (HPC 2015), April 12–15, 2015 Workshop Organizer, Int. Workshop on Techniques And Applications For Sustainable Ultrascale Computing Systems (TASUS 2014), August 25-26, 2014 Program Committee: Design Methodology and Tools, 11th IEEE International Conference on Embedded Software and Systems (ICESS 2014), August 20–22, 2014 Program Committee, 13th IEEE International Symposium on Parallel and Distributed Computing (ISPDC 2014), June 24–27, 2014 Steering Committee, 15th IEEE International Workshop on Parallel and Distributed Scientific and Engineering Computing (PDSEC-14), May 23, 2014 Program Committee, 28th IEEE International Parallel & Distributed Processing Symposium (IPDPS 2014), May 19–23, 2014 Program Committee, 22nd High Performance Computing Symposium (HPC 2014), April 13-16, 2014 Technical Program Comittee, International Conference on Advanced Cloud and Big Data (CBD 2013), December 13–15, 2013 Program Committee: Algorithms, International Conference on Parallel Processing (ICPP 2013), October 1–4, 2013 Program Committee, 20th EuroMPI Conference, September 16–18, 2013 Program Committee, International Conference on Parallel Computing (ParCo 2013), September 10–13, 2013 Program Committee, 10th International Conference on Parallel Processing and Applied Mathematics (PPAM 2013), September 8–11, 2013 Steering Chair, 14th IEEE International Workshop on Parallel and Distributed Scientific and Engineering Computing (PDSEC-13), May 24, 2013 Program Committee, 22nd International Heterogeneity in Computing Workshop (HCW 2013), May 20, 2013 Program Committee, 27th IEEE International Parallel & Distributed Processing Symposium (IPDPS 2013), May 20–24, 2013 Program Committee, 7th International Conference on Internet Computing for Engineering and Science (ICICSE-13), April 21–23, 2013 Program Committee, 21th High Performance Computing Symposium (HPC 2013), April 7–10, 2013 Program Committee: Algorithms, 19th IEEE International Conference on High Performance Computing (HiPC), December 18–21, 2012 Program Chair, 15th IEEE International Conference on Computational Science and Engineering (CSE-2012), December 5–7, 2012 Technical Program Committee, Facing the Multicore-Challenge III, September 19–21, 2012 Program Committee: Embedded Applications and Interdisciplinary Topics, 9th IEEE International Conference on Embedded Software and Systems (ICESS-2012), June 25–27, 2012 Program Committee, 11th IEEE International Conference on Ubiquitous Computing and Communications (IUCC-2012), June 25–27, 2012 Program Committee: Cloud and Cluster Computing, 7th FTRA International Conference on Future Information Technology (FutureTech 2012), June 26–28, 2012 Program Co-Chair, 13th IEEE International Workshop on Parallel and Distributed Scientific and Engineering Computing (PDSEC-12), May 21–25, 2012 Program Committee, 21st International Heterogeneity in Computing Workshop (HCW 2012), May 21, 2012 Program Committee, 6th International Conference on Internet Computing for Engineering and Science (ICICSE-12), April 21–23, 2012 Program Committee, 20th High Performance Computing Symposium (HPC 2012), March 26–29, 2012 Program Committee, 3rd International Conference on Advanced Computing (ICoAC 2011), December 14–16, 2011 Program Committee: Embedded Applications and Interdisciplinary Topics, 8th IEEE International Conference on Embedded Software and Systems (ICESS-2011), November 16–18, 2011 Technical Program Committee, Facing the Multicore-Challenge II, September 28–30, 2011 Program Committee: Cluster and Grid Computing, International Conference on Parallel Processing (ICPP 2011), September 13–16, 2011 Topic Committee: Parallel and Distributed Programming, 17th International Euro-Par Conference (Euro-Par 2011), August 29 – September 2, 2011 Program Committee, International Conference on Parallel Computing (ParCo 2011), August 30 – September 2, 2011 General Co-Chair, 12th IEEE International Workshop on Parallel and Distributed Scientific and Engineering Computing (PDSEC-11), May 16–20, 2011 Program Committee, 19th High Performance Computing Symposium (HPC 2011), April 3–7, 2011 Program Committee: Scientific and Engineering Computing, 13th IEEE International Conference on Computational Science and Engineering (CSE-2010), December 11–13, 2010 Program Committee, 18th High Performance Computing Symposium (HPC 2010), April 12–15, 2010 Technical Program Committee, Facing the Multicore-Challenge, March 17–19, 2010 Program Committee, 7th IEEE International Conference on Embedded Software and Systems (ICESS 2010), June 29 – July 1, 2010 Program Committee, International Workshop on High Performance Computing Technologies and Applications (HPCTA 2010), May 21–23, 2010 General Co-Chair, 11th IEEE International Workshop on Parallel and Distributed Scientific and Engineering Computing (PDSEC-10), April 19–23, 2010 Program Committee, Grid Workflow Workshop (GWW 2010), February 23, 2010 Program Committee, International Conference on Parallel Computing (ParCo 2009) Program Co-Chair, ",
  "content_length": 11838,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:09"
}