{
  "name": "Guenter Schaefer",
  "homepage": "https://www.tu-ilmenau.de/telematik/mitarbeiter/prof-guenter-schaefer",
  "status": "success",
  "content": "Prof. Dr.-Ing. Günter Schäfer | Technische Universität Ilmenau Direkt zum HauptmenüDirekt zum InhaltDirekt zum Fußbereich Curriculum Vitae Prof. Dr.-Ing. Günter SchäferSprechstunde (nach Bedarf): Montags, 13:00 Uhr - 14:00 UhrVorherige Anmeldung per E-Mail unter nadja.kuehler@tu-ilmenau.de Raum: Zusebau, Raum 3042 Telefon: ++49 3677 694576 Email: guenter.schaefer[at]tu-ilmenau.de ForschungMeine Forschungsinteressen liegen in den Bereichen Netzsicherheit, Mobilkommunikation, Hochleistungskommunikation, aktive Netze und Netzmanagement, und ich bin Mitglied des DFG Graduiertenkolleg Selbstorganisierende Mobilkommunikationssysteme für Katastrophenszenarien. Einen ersten Eindruck über meine bisherigen Arbeiten vermitteln mein Publikationsverzeichnis sowie mein Werdegang. Organisation und akademische SelbstverwaltungDekan der Fakultät für Informatik und Automatisierung (2017-2021)Prodekan der Fakultät für Informatik und Automatisierung (2011-2017)Studiendekan der Fakultät für Informatik und Automatisierung (2009-2011)1. stellvertretender Vorsitzender des Vereins zur Förderung der Fakultät für Informatik und Automatisierung der Technischen Universität Ilmenau (seit 2009)Vorsitzender des Fakultätentag Informatik der Bundesrepublik Deutschland (2015-2017)Mitglied des Aufsichtsrats der secunet Security Networks AG (seit 2014)Mitglied des Ausschusses für Recht und Sicherheit des DFN-Vereins (seit 2005)Vertrauensdozent der Stiftung der Deutschen Wirtschaft (Regionalgruppe Erfurt/Ilmenau) (2006-2016) Mitgliedschaften in ProgrammkommiteesStudent Travel Grant Chair for IEEE's GlobeCom'2009 conferenceTPC Member of IEEE's GlobeCom'2008 - Computer and Communications Network Security Symposium & Next Generation Networks, Protocols, and Services SymposiumTPC Member of the 6th International Conference on Wired/Wireless Internet Communications (WWIC'2008)TPC Member of IEEE's ICC'2008 - Advances in Networks & Internet SymposiumTPC Member of IEEE's International Conference on Sensor Networks, Ubiquitous, and Trustworthy Computing (SUTC2008)TPC Member of IEEE's Vehicular Technology Conference (VTC-Fall) 2007 (Mobile Networks track)TPC Member of the 2nd IEEE/IFIP Workshop on Monitoring, Attack Detection and Mitigation (MonAM 2007)TPC Member of the Conference on Principles, Systems and Applications of IP Telecommunications (IPTComm), July 19.- 20. 2007, Columbia University, New York City, USATPC Member of IEEE's Global Information Infrastrucure Symposium (GIIS 2007), July 2.-6. 2007, Marrakech, MoroccoTechnical Program Co-Chair of the General Symposium of IEEE's ICC'2006 conferenceTechnical Program Vice-Chair of IEEE's CCNC'2006 conferenceTPC Member of IEEE's Globecom'2006 - Symposium on Internet Services and Enabling Technologies & Symposium on World Class Solutions: Networking the GlobeTPC Member of WWIC'2006 - 4th International Conference on Wired/Wireless Internet CommunicationsTPC Member of ICQT'06 - 5th International Workshop on Advanced Internet Charging and QoS TechnologiesTutorial Chair of IEEE's CCNC'2005 conferenceTPC member of IEEE's ICC'2005 - Symposium on Next Generation Networks for Universal ServicesTechnical Program Vice Chair of IEEE's CCNC'2004 conferenceTPC member of IEEE's Globecom'2004 - Symposium on Security and Network ManagementTPC member of IEEE's ISCC conference seriesMember of the Editorial Board of the Computer Networks Journal (2003 - 2007)Occasional reviewer for various conferences and publications, e.g. ACM Transactions on Embedded Computing Systems, IEEE Transactions on Wireless Communications, IEEE Personal Communications, European Transactions on Telecommunications. Veröffentlichungen[LSS25] Lucks, Stefan; Schatz, David; Schaefer, Guenter: On the Security of Opportunistic Re-Keying. SECRYPT, 2025. Preprint.[AMT24] Altheide, Friedrich; Buttgereit, Simon; Rossberg, Michael; Schaefer, Guenter: Increasing Resilience of SD-WAN by Distributing the Control Plane [Extended Version], TNSM 2024[SRS24] Stoyke, Jan; Rossberg, Michael; Schaefer, Guenter: Demo: Strict Architectural Separation Between Operators in Shared RANs. NoF 2024[SASM24] Schatz, David; Altheide, Friedrich; Schaefer, Guenter; Martius, Kai: Quantensichere VPN-Infrastrukturen. 20. Deutscher IT-Sicherheitskongress, 2024.[ABRS23] Altheide, Friedrich; Buttgereit, Simon; Rossberg, Michael; Schaefer, Guenter: Increasing Resilience of SD-WAN by Distributing the Control Plane, NoF 2023[SRS23] Schatz, David; Rossberg, Michael; Schaefer, Guenter: Evaluating Statistical Disclosure Attacks and Countermeasures for Anonymous Voice Calls. ARES, 2023.[SAK+23] Schatz, David; Altheide, Friedrich; Koerfgen, Hedwig; Rossberg, Michael; Schaefer, Guenter: Virtual Private Networks in the Quantum Era: A Security in Depth Approach. SECRYPT, 2023. Preprint.[SRS22] Schatz, David; Rossberg, Michael; Schaefer, Guenter: Hydra: Practical Metadata Security for Contact Discovery, Messaging and Voice Calls. Information Systems Security and Privacy, 2022. Extended Version of  [SRS21a].[BRPS21] Simon Buttgereit, Michael Rossberg, Michael Pfeiffer, Guenter Schaefer: Demo: Leveraging SDN in Critical Infrastructures, ICIN 2021[SRS21b] Schatz, David; Rossberg, Michael; Schaefer, Guenter: Optimizing Packet Scheduling and Path Selection for Anonymous Voice Calls. ARES, 2021[SRS21a] Schatz, David; Rossberg, Michael; Schaefer, Guenter: Hydra: Practical Metadata Security for Contact Discovery, Messaging and Dialing, ICISSP, 2021. Best Student Paper Award.[BRS21] Backhaus, Martin; Rossberg, Michael; Schaefer, Guenter: Towards a Realistic Maximum Flow Model in Hybrid Multi-Channel Wireless Mesh Networks, WD, 2021[PRGS20] Pfeiffer, Michael; Rossberg, Michael; Girlich, Franz; Schaefer, Guenter: Vector Packet Encapsulation: The Case for a Scalable IPsec Encryption Protocol. ARES 2020.[WS20] Philip Wendland, Guenter Schaefer: Feedback-Based Hidden-Terminal Mitigation for Distributed Scheduling in Cellular V2X. In IFIP Networking 2020.[BaSc20] Backhaus, Martin; Schaefer, Guenter: Towards the Complexity of the Widest Path Problem in Hybrid Multi-Channel WMNs, WiMob-SPPDT, 2020.[BTRS20c] Backhaus, Martin; Theil, Markus; Rossberg, Michael; Schaefer, Guenter: Robustness and Scalability Improvements for Distance Vector Routing in Large WMNs, WiMob, 2020.[BTRS20b] Backhaus, Martin; Theil, Markus; Rossberg, Michael; Schaefer, Guenter: Improving Network-Assisted Roaming for Controller-Less Wi-Fi, PIMRC, 2020.[TBRS20] Theil, Markus; Backhaus, Martin; Rossberg, Michael; Schaefer, Guenter: Seamless Multimedia Streaming in Controller-Less Wireless Mesh Networks With Mobile Stations, IFIP Networking, 2020.[BTRS20a] Backhaus, Martin; Theil, Markus; Rossberg, Michael; Schaefer, Guenter: Poster: Seamless Client Integration for Fast Roaming in Wireless Mesh Networks, IFIP Networking, 2020.[SDAWDSTH19] Andreas Schwind, Michael Doebereiner, Carsten Andrich, Philip Wendland, Giovanni Del Galdo, Guenter Schaefer, R. S. Thoma, Matthias A. Hein: Bi-static Delay-Doppler Reference of Cooperative Passive Vehicle-to-X Radar. In 13th European Conference on Antennas and Propagation (EuCAP 2019) conference for the IET Microwaves, Antennas & Propagation, submitted.[TADDHKSSSSW19] Reiner S. Thomä, Carsten Andrich, Giovanni Del Galdo, Michael Döbereiner, Matthias A. Hein, Martin Käske, Günter Schäfer, Steffen Schieler, Christian Schneider, Andreas Schwind and Philip Wendland. Cooperative passive coherent location: a promising 5G service to support road safety. In IEEE Communications Magazine, September 2019.[WST19b] Philip Wendland, Guenter Schaefer and Reiner S. Thomä. LTE-V2X mode 4: increasing robustness and DCC compatibility with reservation splitting. In 2019 IEEE International Conference on Connected Vehicles and Expo (IEEE ICCVE 2019), Graz, Austria.[SAWDDSTH19] A. Schwind, C. Andrich, P. Wendland, M. Döbereiner, G. Del Galdo, G. Schaefer, R. S. Thomä and M. A. Hein. Bi-static delay-Doppler emulation of cooperative passive vehicle-to-X radar. In 2019 13th European Conference on Antennas and Propagation (IEEE EuCAP 2019).[BTRS19] Backhaus, Martin; Theil, Markus; Rossberg, Michael; Schaefer, Guenter: Robust and Scalable Routing in Wireless Mesh Networks Using Interference-Disjoint Backup Paths, IFIP WMNC, 2019. Accepted and in press.[PRBS19] Pfeiffer, Michael; Rossberg, Michael; Buttgereit, Simon; Schaefer, Guenter: Strong Tenant Separation in Cloud Computing Platforms, ARES 2019. [Paper (pdf, 1.9Mb)][TBRS19] Theil, Markus; Backhaus, Martin; Rossberg, Michael; Schaefer, Guenter: Towards a Security Architecture for Hybrid WMNs, ARES 2019.[WST19] Wendland, Philip; Schaefer, Guenter; Thomä, Reiner: An Application-Oriented Evaluation of LTE-V’s Mode 4 for V2V Communication, ACM SAC, 2019. Accepted and in press.[KASS18] Kabirov, Airat D.; Anikin, Igor V.; Schatz, David; Schaefer Guenter: Scalable and Anonymity Preserving Overlays for Voice over IP Communications, IEEE Dynamics, 2018.[GTRS18] Grey, Michael; Theil, Markus, Rossberg, Michael; Schaefer, Guenter: Towards Voronoi-Based Backup Routing for Large-Scale Distributed Applications. 2018 IEEE Global Information Infrastructure and Networking Symposium (GIIS 2018). Thessaloniki, Greece, October 2018. [Paper (pdf, 1.9Mb)][BTRSS18] Backhaus, Martin; Theil, Markus; Rossberg Michael; Schaefer, Guenter; Sukiennik, David:  A Comprehensive Framework to Evaluate Wireless Networks in Simulation and Real Systems. 2018 IEEE/ACM International Symposium on Distributed Simulation and Real Time Applications (DS-RT). Madrid, Spain. October 2018. [Paper (pdf, 1.9Mb)][BTRS18] Backhaus, Martin; Theil, Markus; Rossberg Michael; Schaefer, Guenter: Towards a Flexible User-Space Architecture for High-Performance IEEE 802.11 Processing. 2018 IEEE International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob). Limassol, Cyprus. October 2018. [Paper (pdf, 1.9Mb)][SRS17] Schatz, David; Rossberg, Michael; Schaefer, Guenter: Reducing Call Blocking Rates For Anonymous Voice",
  "content_length": 33340,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:12"
}