{
  "name": "Guevara Noubir",
  "homepage": "http://www.ccs.neu.edu/home/noubir",
  "status": "success",
  "content": "Guevara Noubir Guevara Noubir I am a Professor in the Khoury College of Computer Sciences at Northeastern University, and the Executive Director of Cybersecurity Programs. My research spans a range of problems on the theory and practice of privacy, security, and robustness in networked systems. I am in particular interested in Mobile and Wireless systems security. ▬ Contact information Affiliation: Khoury College of Computer Sciences Email: g.noubir@northeastern.edu Address: ISEC Building, Room 660ENortheastern University805 Columbus AvenueBoston, MA, 02120 ▬ News Our team (Hai, Marinos, Norbert, Tien co-led by Triet and myself) was finalist in the DARPA Spectrum Collaboration Challenge (SC2) 2019, winning team in DARPA SC2 2018 ($750K prize), winning team in DARPA SC2 2017 ($750K prize). Our paper on the privacy leaks of IoT smart-speakers won the runner-up best paper award at ACM WiSec'21. Congrats to Dennis Giese and Erik Uhlmann for winning the MITRE embedded CTF competition for three years in a row (2019, 2020, and 2021). Joined the Steering Committee of ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec) Our paper on permissionless mobile phones tracking using magnetometer received the Best Paper Award at ACM WiSec 2018. Congrats Ken! General Chair ACM WiSec 2017. Our Sprite team received the “Mass Attack” Award at the embedded CTF competition (eCTF 2018) organized by MITRE. Congrats Sashank, Amirali, David, Tien, Ziyad, and Anirudh. Best paper award at IEEE Conference on Communications and Network Security CNS’16. Keynote lecture at ACM WiNTECH 2016. Our team (Triet, Bishal, and myself) won the DARPA Spectrum Challenge $25K cooperative, ranked 3rd on the competitive 2013, and ranked 4th on the 2014. Jin Tao joined Qualcomm Research at San Diego (9/2013). Our paper on countering high-power jammers was selected as the runner-up best paper of ACM WiSec’13. The website for our SoC-based apps-driven wireless sensor network is up. Our team ranked 3rd (out of 90 teams) in the DARPA Spectrum Challenge qualification phase (2013-2014). Bishal joined Raytheon BBN Technologies (9/2011). Our paper analyzing the robustness our rate adaptation won the ACM WiSec’11 best paper award. Our team (Yin, Tao, and myself) made it to the top 20 (from >1800 teams) in Google’s Android Developers Challenge. ▬ Current PhD students Hai Nguyen (BS Hanoi University of Science and Technology, Vietnam) Norbert Ludent (MS University Carlos III de Madrid/IMDEA, Spain) Marinos Vomvas (BS National Technical University of Athens, Greece) Xenia Dragon (BS Northeastern University, USA) ▬ Alumni (graduated with PhD) Harshad Sathaye (BS University of Pune, India, PhD'2023) Tien Vo-Huu (BS University of Turin, Italy, PhD'2022) Ken Block (BS Johns Hopkins University, PhD'2018), Raytheon Amirali Sanatinia (BS University of St Andrews (UK), PhD'2018) Sashank Narain (BE University of Mumbai, PhD'2018) Triet Vo-Huu (MS Budapest University of Technology, PhD'2015), joined Cyberfend Inc. acquired by Akamai Aldo Cassola (MS Northeastern University, PhD'2015), joined the faculty of University of San Francisco in Quito, Ecuador Koorosh Firouzbakht (MS Iran University of Science and Technology, PhD'2013) Tao Jin (BS Beijing University, PhD ‘2013), Research Engineer, Qualcomm Research, San Diego, CA Hooman Javaheri (BS Sharif University, PhD ‘2012), RJMetrics, Philadelphia, PA Bishal Thapa (BS SUNY Potsdam, PhD ‘2011), Research Scientist, Raytheon - BBN Technologies, Cambridge, MA Yin Wang (BS Nanjing University, PhD ‘2010), Entrepreneur, Founder Narvii Inc., MA Xin Liu (MS Tsinghua University, PhD ‘2007), Senior Program Manager, Microsoft Corp., Seattle, WA Guolong Lin (BS Tsinghua University, PhD ‘2006), Engineering Manager, Akamai Technologies, Cambridge, MA ▬ Talks Network Security: Use and Misuse of Cryptography -- Contemporary Tales Reproducibility in Wireless Experimentation: Need, Challenges, and Approaches, Keynote Lecture, ACM WiNTECH, 2016. Honey Onions: Exposing Snooping Tor HSDir Relays, DEF CON 24, 2016. Towards Practical ORAM, Summer School on Real-World Crypto and Privacy, Croatia, 2016. Robustness and Privacy in Wireless and Mobile Systems, KTH, MIT, WPI, 2016. ▬ Short Bio I received my PhD in Computer Science from the Swiss Federal Institute of Technology at Lausanne (EPFL 1996) and my engineering diploma (MS) from École Nationale Supérieure d'Informatique et de Mathématiques Appliquées at Grenoble (ENSIMAG 1991). Prior to joining Northeastern University, I was a senior research scientist at CSEM SA (Switzerland) where I led several research project and contributed to the definition of the third generation Universal Mobile Telecommunication System (UMTS) standardized as 3GPP WCDMA. I held visiting research positions at Eurecom, MIT, and UNL. I am a recipient of the NSF CAREER Award, and Google Faculty Research Award. I serve(d) on the editorial board of ACM Transactions of Privacy and Security, ACM Transactions of Information and Systems Security, IEEE Transactions on Mobile Computing, and the Elsevier Computer Networks Journal. I co-chaired the TPC of ACM WiSec‘2015, IEEE CNS‘2015, IEEE WoWMoM 2015, IEEE SECON’14, NETYS’14, ICCCN’12 and regularly serve on the TPC of wireless networking and security conferences such as IEEE Infocom, ACM WiSec, ACM Mobicom, ACM MobiHoc. I served as a judge in the Synthetic Biology iGEM competition 2012-2013. ▬ Teaching I enjoy developing new courses that expose the students to new computing and communication paradigms that involve both theory and systems. Fall'19 - CS4740 & CS6740 Network Security: allows the students to explore the practical elements of networks security and related design, and deployment decisions in a supervised laboratory, while simultaneously acquiring a strong conceptual knowledge of the underlying theory in the more traditional classroom environment. The combination of these elements provides students with a vivid picture of why and how networked systems and applications must be designed, implemented, deployed, and maintained in a secure fashion. Secure Wireless Ad hoc Robots on Mission (SWARM): exposes the students to the concepts underlying the design of robust and secure heterogeneous wireless networking of mobile robots (i.e., Internetworking, Security, Wireless Communication, Embedded Development, Mobile Phones Platforms).Teams design and build rescue-mission oriented heterogeneous wireless systems operating in adversarial environments... [Check Movie] SWARM Extreme: a special topics course in networking. Check the movie where students wirelessly control a flying quadcopter with their thoughts using a Brain Computer Interface. ▬ Honors & Awards National Science Foundation CAREER Award (2005) DARPA Spectrum Collaboration Challenge (SC2), finalist in 2019, winner in 2018, winner in 2017 Northeastern University Excellence in Research and Creative Activity Award (2018) Google Faculty Research Award (2017) Keynote Lecture at ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec), “Wireless and Mobile Softwarization: Security and Privacy Pandora’s Box?”, 2019 Keynote at the Brazilian Symposium on Information and Computational Systems Security, “Security and Privacy in Mobile and Wireless Systems”, 2019 Keynote Lecture at ACM WiNTECH 2016 Research and Education program selected for the 2009 & 2012 Highlights of NSF CISE/CNS Winner of DARPA Spectrum Challenge Cooperative DSC’2013 out of 90 teams Distinguished Lecture at U. Michigan – Dearborn, “Robustness and Privacy in Wireless Systems”, November 2013 Distinguished Lecture IEEE IAS Costa Rica, “LTE & LTE Security”, July 2013 Best paper award at the ACM Wireless Security Conference WiSec’2018, WiSec 2011, IEEE Conference on Communications and Network Security CNS'2016, runner-up best paper ACM WiSec 2013. ▬ Service Steering Committee of ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec) 2019-2024. General Chair of ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec) 2017. Founding chair of ACM WiSec Reproducibility Label (2017). Initiative presented at ACM WiNTECH keynote lecture 2016, and early experience presented at the ACM Reproducibility meeting in New York City (2017). Chaired 2 NSF Workshops on Bio-Enabled Wireless Networks, and Synthetic Biology for Bio Comp-Comm, 2011-2012 Editorial Board of ACM Transaction on Information and Systems Security (TISSEC), IEEE Transaction on Mobile Computing, and Elsevier Computer Networks Journal TPC Co-Chair (with Ivan Martinovic) of ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec) 2015. TPC Co-Chair (with Pierangela Samaranti) of IEEE Conference on Communications and Network Security (CNS) 2015. TPC Co-Chair (with Luciano Bononi) of IEEE World of Wireless Mobile and Multimedia (WoWMoM) 2015. TPC Co-Chair (with Andreas Terzis) of IEEE Conference on Sensing, Communication, and Networking (SECON) 2014 TPC Co-Chair (with Michel Raynal) of NETYS 2014 (Springer Lecture Notes in Computer Science LNCS 8593) TPC Co-Chair (with Prasant Mohapatra) of IEEE ICCCN, 2012 ▬ Sponsors",
  "content_length": 9189,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:10"
}