{
  "name": "Gugan Thoppe",
  "homepage": "https://www.csa.iisc.ac.in/people/gugan-thoppe",
  "status": "success",
  "content": "CSA – IISc Bangalore Home » Gugan Thoppe Gugan Thoppe Email: gthoppe [at] iisc.ac.in Stochastic Approximation, Random Topology and their applications to Reinforcement Learning and Topological Data Analysis Personal webpage ExploreHome About Us People Research Academics News Contact Us Quick LinksInformation Brochure Student Wellness Center Prospective Students Prospective Faculty Open Positions Visitors Current Faculty Current Students CSR Initiatives Division of EECS Entrepreneurship at CSA Golden Jubilee Events Wipro-CSA Connect ResourcesWebmail Room Scheduler Add New Seminar Adobe Sign Seminars Calendar Copyright © 2025 Department of Computer Science and Automation, IISc Bangalore Travel Blog | Feedback | Credits HomeAbout Us▼Chair’s WelcomeHistory▼Early history of CSAFormation of CSARecent HistoryCSA TimelineOpportunities @ CSA▼Amazon IISc Young Scientist Big Data FellowshipMid-Year PhD AdmissionsDownloadsStudent WellnessPeople▼FacultyVisiting FacultyResearchersStudents▼PhD StudentsMTech (Research) StudentsM.Tech. CSE 2023-25M.Tech. CSE 2024-2026M.Tech. AI 2024-2026M.Tech 2025-2027M.Tech AI 2025-2027Committee Members▼Departmental Curriculum CommitteeFaculty Recruitment CommitteeFaculty In-charge for Institutional InterfacesDepartment Finance CommitteeCSA Alumni Advisory BoardStudent Wellness CommitteeStudent RepresentativesStaff▼Technical StaffAdministrative StaffAlumniJoin Us▼Prospective FacultyProspective Students▼Resources – ERPResources – InternationalOpen PositionsResearch▼Research Streams▼TheoryComputer SystemsIntelligent SystemsResearch LabsSpecial Interest GroupsSoftware and ToolsFacilities▼Computing FacilitiesClass RoomsLibrary▼Search for booksLibrarian LoginReportsAcademics▼Degree ProgramsCourses▼Time TableCurrentUpcomingPastCourse DescriptionsResources▼Current Faculty ResourcesCurrent Students ResourcesProspective Students ResourcesStudent Awards▼Br. C. Selvam Endowment AwardThe Murthy Govindaraju “Women in Computer Science” Research Endowment AwardIISc MedalsNewsContact Us▼Reaching CSA▼Driving DirectionsLocation MapCampus MapCSA MapContact▼Faculty ContactsAdmin ContactsVisitor InformationFeedbackProspective Students",
  "content_length": 2169,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:11"
}