{
  "name": "Guido Wirtz",
  "homepage": "https://www.uni-bamberg.de/?id=5188",
  "status": "success",
  "content": "Wirtz, Guido - Lehrstuhl für Verteilte Systeme ProfessorDr. rer. nat. Guido Wirtz   seit 01.04.2025 im RuhestandE-Mail: guido.wirtz(at)uni-bamberg.de (gilt weiterhin)PGP-Schlüssel: 6CC45844 (Fingerprint: EADA16A797C1A8DBB0EFE7491396DB2E6CC45844)  Lebenslauf:Bildungsweg Abitur, Peter-Wust-Gymnasium Wittlich (1978)Studium und Diplom in der Informatik, Rheinische Friedrich-Wilhlems-Universität Bonn (1979 - 1985)Promotion, Rheinische Friedrich-Wilhlems-Universität Bonn (1990)Habilitation (Venia Legendi), Universität-Gesamthochschule Siegen (1995) Werdegang 11/1985 – 09/1990: Wissenschaftlicher Mitarbeiter in der  AG Programmiersprachen, Universität Bonn08/1990: Promotion zum Dr. rer. nat. an der Mathematisch-Naturwissenschaftlichen Fakultät der Rheinischen Friedrich-Wilhelms-Universität Bonn10/1990 – 12/1995: Oberingenieur am FB Elektrotechnik und Informatik der Universität-GHS Siegen04 – 08/1994: Vertretung einer Professur für Informatik am FB Mathematik der Universität Gießen01/1995: Venia Legendi für \"Informatik\", Universität Siegen10/1994 – 12/1995: Vertretung einer Professur für \"Angewandte Informatik\" am FB Mathematik  der Westfälischen Wilhelms-Universität Münster01/1996 – 07/2002: Professur für \"Angewandte Informatik\" am FB Mathematik und Informatik der Westfälischen Wilhelms-Universität Münster04/2002 – 06/2002: Vertretung des LS für \"Praktische Informatik\" der Fakultät WIAI an der Otto-Friedrich Universität Bamberg07/2002 - 03/2025: Leiter des Lehrstuhls für \"Praktische Informatik\" der Fakultät WIAI an der Otto-Friedrich Universität Bamberg10/2007 – 09/2009: Dekan der Fakultät WIAI01/2007 – 09/2020: Mitglied des Chief Information Office (CIO) der Universität Bamberg02/2010 – 09/2020: Vertreter der Universität Bamberg in der CIO-Runde der Universität Bayern e.V. ( 07/2011 - 09/2016: Sprecher der CIO-Runde)10/2011 – 09/2012: Vizepräsident der Otto-Friedrich-Universität Bamberg, Ressortbereich: Forschung und wissenschaftlicher Nachwuchs10/2012 – 09/2020: Vizepräsident der Otto-Friedrich-Universität Bamberg, Ressortbereich: Technologie und Innovation2013 – 2025: Wiss. Projektkooridinator Technologie-Allianz Oberfranken (TAO)2015 - 2021: Mitglied des Wissenschaftlichen Beirates der Bayerischen Forschungsstiftung (2019 - 2021: Vorsitzender)10/2021 – 09/2023: Dekan der Fakultät WIAI10/2023 – 03/2025: Mitglied des Senats der Universität Bamberg Publikationen ORCID profiledblp Computer Science Bibliography (selection of papers)Lokale Liste",
  "content_length": 2480,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:14"
}