{
  "name": "Guido Gerig",
  "homepage": "http://engineering.nyu.edu/people/guido-gerig",
  "status": "success",
  "content": "Guido Gerig | NYU Tandon School of Engineering Skip to Main Content Search NYU Tandon Fulltext search Looking for News or Events? Guido Gerig Professor Emeritus Computer Science and Engineering Biomedical Engineering Center for Advanced Technology in Telecommunications (CATT) Visualization Imaging and Data Analysis Center (VIDA) Connect Email gerig [at] nyu.edu CV/resume gerigCV_1.pdf Website http://engineering.nyu.edu/~gerig/ Guido Gerig is Institute Professor in the Department of Computer Science and Engineering and he is a professor of Biomedical Engineering. He also holds associated/affiliated appointments at NYU Courant CS, NYU Langone Child and Adolescent Psychiatry, Psychiatry and Radiology. He was Department Chair of Tandon CSE department 2016-2021. Guido Gerig has been awarded the Enduring Impact Award of the MICCAI society (2023), was named IEEE Fellow (class of 2019) and has also been appointed as a Fellow of the American Institute for Medical and Biological Engineering (AIMBE) in 2010. Starting image analysis with applications to satellite imaging, he became increasingly interested in driving problems from medicine, tackled in close multidisciplinary collaboration between medicine, engineering, and statistics. His research supports a number of clinical imaging research studies with novel, innovative image analysis methodologies related to segmentation, registration, atlas building, shape analysis, and image statistics. Driving clinical problems include research in autism, Down's syncdrome, eye diseases (Glaucoma, AMD), multiple sclerosis, Huntington's disease, studies of infants at risk for mental illness, and in general analysis of anatomical changes from normal due to disease, therapy and recovery. Gerig's research resulted in various new image analysis methodologies for nonlinear processing, multi-scale segmentation and shape analysis, some of them first and seminal to the field. Applications resulted in new clinical research discoveries such as vulnerability for schizophrenia, early diagnosis of autism based on differences in brain development trajectories, and correlation of shape atrophy with risk status in Huntington's. New tools and methods such as itkSNAP and SlicerSalt are developed as open source software and disseminated to the public, including teaching materials and organization hands-on training workshops. Guido Gerig was previously USTAR Professor of Computer Science at the University of Utah (2007-2015) establishing the Utah Center for Neuroimage Analysis (UCNIA), Taylor Grandy Professor of Computer Science and Psychiatry at the University of North Carolina at Chapel Hill (1998-2007) launching the UNC Neuro Image Research and Analysis Laboratories (NIRAL), and Assistant Professor at ETH Zurich (1993-1998). Gerig holds several awards from Utah and UNC for Excellence in Teaching. http://library.med.nyu.edu/api/publications?person=gg87 http://www.sci.utah.edu/scipubs/search.html?schTerm=G.+Gerig Research Interests Image Processing & Analysis, Medical Image Processing, 3D Computer Vision, Shape Analysis, Spatiotemporal Modeling, Multidisciplinary Clinical Research, Health Education Swiss Federal Institute of Technology Zurich (ETH-Z) 1981 MSc, Swiss Federal Institute of Technology Zurich (ETH-Z) 1987 PhD, Experience University of Utah USTAR Professor From: July 2007 to June 2015 University of North Carolina UNC Taylor Grandy Professor From: July 1998 to June 2007 Swiss Federal Institute of Technology ETH Assistant Professor From: July 1993 to June 1998 Publications Journal and Conference Articles (peer reviewed) NIH Pubmed/PMC list of publications: http://www.ncbi.nlm.nih.gov/pubmed?term=Gerig%20G NYU Health Science Library: http://library.med.nyu.edu/api/publications?person=gg87 Affiliations NYU Courant Institute, Computer Science NYU Radiology, Center for Biomedical Imaging NYU Child and Adolescence Psychiatry Awards 2019: IEEE Fellow (class of 2019) 2010: Elected Fellow of the American Institute for Medical and Biological Engineering (AIMBE) 2010 Dean's letter University of Utah for Excellence in Teaching 2009: Fellow of the Medical Image Computing and Computer-Assisted Intervention (MICCAI) Society 2009: ISMRM (Int Society for Magnetic Resonance in Medicine): Outstanding Teacher Award 2006, 2004, 1999: Student Teaching Awards, UNC Chapel Hill, Dept. Computer Science Information for Mentees About me: I joined Tandon 2015 after 5 years at ETH Zurich, 8 years at UNC-Chapel Hill and 8 years at U of Utah / was CSE chair 2016 - 2020 / joint appointment CSE/BME Research News View More Microscopy image segmentation via point and shape regularized data synthesis In contemporary deep learning-based methods for segmenting microscopic images, there's a heavy reliance on extensive training data that requires detailed annotations. This process is both expensive and labor-intensive. An alternative approach involves using simpler annotations, such as marking the center points of objects. While not as detailed, these point annotations still provide valuable information for image analysis. In this study, researchers from NYU Tandon and University Hospital Bonn in Germany assume that only point annotations are available for training and present a novel method for segmenting microscopic images using artificially generated training data. Their framework consists of three main stages: 1. Pseudo Dense Mask Generation: This step takes the point annotations and creates synthetic, detailed masks that are constrained by shape information. 2. Realistic Image Generation: An advanced generative model, trained in a unique way, transforms these synthetic masks into highly realistic microscopic images while maintaining consistency in object appearance. 3. Specialized Model Training: The synthetic masks and generated images are combined to create a dataset used to train a specialized model for image segmentation. The research was led by Guido Gerig, Institute Professor of Computer Science and Engineering and Biomedical Engineering, alongside PhD students Shijie Li and Mengwei Ren, as well as Thomas Ach at University Hospital Bonn. The three NYU Tandon researchers are also members of the Visualization and Data Analytics (VIDA) Research Center. The researchers tested their method on a publicly available dataset and found that their approach produced more diverse and realistic images compared to conventional methods, all while maintaining a strong connection between the input annotations and the generated images. Importantly, when compared to models trained using other methods, their models, trained on synthetic data, outperformed them significantly. Moreover, their framework achieved results on par with models trained using labor-intensive, highly detailed annotations. This research highlights the potential of using simplified annotations and synthetic data to streamline the process of segmenting microscopic images, potentially reducing the need for extensive manual annotation efforts. The research, in collaboration with the Ophthalmology department at University Hospital Bonn, is a first step in a collaboration to finally process three dimensional retinal cell images of the human eye from subjects diagnosed for age-related macular degeneration (AMD), a leading cause of vision loss in older adults. The code for this method is publicly available for further exploration and implementation. “Microscopy Image Segmentation via Point and Shape Regularized Data Synthesis.” S Li, M Ren, T Ach, G Gerig. arXiv preprint, arXiv:2308.09835, 2023. Read the full paper October 2, 2023 Research Centers, Labs, and Groups Center for Advanced Technology in Telecommunications (CATT) Creating economic impact through research, technology transfer, and faculty entrepreneurship. Visualization Imaging and Data Analysis Center (VIDA) We work in the areas of Visualization, Imaging and Data Analysis. Email gerig [at] nyu.edu CV/resume gerigCV_1.pdf Website http://engineering.nyu.edu/~gerig/ Latest Stories All News News Guido Gerig honored with the MICCAI Enduring Impact Award News Translational and transformational News Developer of multi-tool for data modeling receives 2021 Excellence in Research Award News The Tandon/Rusk Transformer Challenge kicks off a race for rehabilitation solutions News Collegial in every sense of the word News Better medical imaging, better data visualization, better healthcare Load More",
  "content_length": 8439,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:13"
}