{
  "name": "Guido Tack",
  "homepage": "https://research.monash.edu/en/persons/guido-tack",
  "status": "success",
  "content": "Guido Tack - Monash University Guido Tack public CV View Scopus Profile Guido Tack Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0003-3357-6498 EmailGuido.Tackmonashedu 20052025 Research activity per year Personal profile BiographyGuido Tack is an Associate Professor in the Department of Data Science and Artificial Intelligence, at the Faculty of Information Technology, Monash University. His research focuses on combinatorial optimisation, in particular architecture and implementation techniques for constraint solvers, translation of constraint modelling languages, and industrial applications. Guido leads the development of the MiniZinc constraint modelling language and toolchain. He is one of the main developers of Gecode, a state-of-the-art constraint programming library. Guido's broader research interests include programming languages and computational logic. Guido graduated and received his doctoral degree (Dr.-Ing.) from the Department of Computer Science, Saarland University, Germany. Before joining Monash University as a Lecturer and Monash Larkins Fellow in February 2012, he worked as a post-doctoral researcher at NICTA Victoria Laboratory, Saarland University (Germany), and K.U. Leuven (Belgium). Related Links: The constraint modelling language MiniZincThe Gecode project website Monash teaching commitmentGuido has experience as the Chief Examiner for the following units in the Faculty of IT: FIT5170 Programming for distributed, parellel and mobile systemsFIT9135 Data communicationsFIT5216 Modelling discrete optimisation problems Guido has experience as Lecturer for the following units in the Faculty of IT: FIT1047 Introduction to computer systems, networks and securityFIT4010 Advanced topics in algorithms and discrete structuresFIT5170 Programming for distributed, parallel and mobile systemsFIT5216 Modelling discrete optimisation problemsFIT9135 Data communications Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Dr.-Ing., Universitat des Saarlandes (Saarland University)Award Date: 29 Jan 2009Computer Science, Diplom Informatiker, Universitat des Saarlandes (Saarland University)Award Date: 30 Jun 2003 Research area keywordsoptimisationconstraint programmingproblem modelling and solving Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2012 2012 2014 2017 2018 2019 2021 2023 2025 2028 1 Curtailed 5 Active 6 Finished Projects per year Google: Improvement to the Minizinc Ecosystem Stuckey, P. (Primary Chief Investigator (PCI)), Tack, G. (Chief Investigator (CI)) & Dekker, J. (Chief Investigator (CI))3/06/25 → 31/12/25Project: Research Software Engineering for Social Good PhD ScholarshipAleti, A. (Primary Chief Investigator (PCI)) & Tack, G. (Chief Investigator (CI))A&A Family Gift9/02/25 → 31/03/28Project: Research Optimal design of metering systems for intelligent water networksTack, G. (Primary Chief Investigator (PCI)), Boley, M. (Chief Investigator (CI)), Crook, J. (Partner Investigator (PI)) & Bergmann, D. (Partner Investigator (PI))16/01/23 → 30/06/26Project: Research Quantum Information Technology: Quantum Information Technology: Industry Readiness & ApplicationsSteinfeld, R. (Primary Chief Investigator (PCI)), simmons, M. (Chief Investigator (CI)), Usman, M. (Chief Investigator (CI)), Phung, D. (Chief Investigator (CI)), Tack, G. (Chief Investigator (CI)), Pas, E. (Chief Investigator (CI)), Sakzad, A. (Associate Investigator (AI)), Cui, S. (Associate Investigator (AI)), Aleti, A. (Associate Investigator (AI)), Garcia De La Banda Garcia, M. (Associate Investigator (AI)), Nakashima, P. (Associate Investigator (AI)), Schmidt, D. (Associate Investigator (AI)), Esgin, M. (Associate Investigator (AI)) & Fay, J. (Associate Investigator (AI))1/01/23 → 31/12/27Project: Research ARC Training Centre in Optimisation Technologies, Integrated Methodologies, and Applications (OPTIMA)Smith-Miles, K. (Primary Chief Investigator (PCI)), Stuckey, P. (Chief Investigator (CI)), Taylor, P. G. (Chief Investigator (CI)), Ernst, A. (Chief Investigator (CI)), Aickelin, U. (Chief Investigator (CI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Pearce, A. (Chief Investigator (CI)), Wallace, M. (Chief Investigator (CI)), Bondell, H. (Chief Investigator (CI)), Hyndman, R. (Chief Investigator (CI)), Alpcan, T. (Chief Investigator (CI)), Thomas, D. A. (Chief Investigator (CI)), Anjomshoa, H. (Chief Investigator (CI)), Kirley, M. G. (Chief Investigator (CI)), Tack, G. (Chief Investigator (CI)), Costa, A. (Chief Investigator (CI)), Fackrell, M. (Chief Investigator (CI)), Zhang, L. (Chief Investigator (CI)), Glazebrook, K. (Partner Investigator (PI)), Branke, J. (Partner Investigator (PI)), O'Sullivan, B. (Partner Investigator (PI)), O'Shea, N. (Partner Investigator (PI)), Cheah, A. (Partner Investigator (PI)), Meehan, A. (Partner Investigator (PI)), Wetenhall, P. (Partner Investigator (PI)), Bowly, D. (Partner Investigator (PI)), Bridge, J. (Chief Investigator (CI)), Faka, S. (Partner Investigator (PI)), Mareels, I. (Partner Investigator (PI)), Coleman, R. A. (Partner Investigator (PI)), Crook, J. (Partner Investigator (PI)), Liebman, A. (Chief Investigator (CI)) & Aleti, A. (Chief Investigator (CI))Equans Services Australia Pty Limited, Anonymous Donation Gift23/09/21 → 23/09/26Project: Research View all 12 projects Research output Research output per year 2005 2013 2014 2016 2017 2018 2020 2021 2022 2025 2025 51 Conference Paper 15 Article 3 Chapter (Book) 2 Edited Book 4 More 2 Editorial 1 Abstract 1 Other Research output per year Research output per year Integration of Constraint Programming, Artificial Intelligence, and Operations Research: 22nd International Conference, CPAIOR 2025, Melbourne, VIC, Australia, November 10–13, 2025, Proceedings, Part ITack, G. (Editor), 2025, 1st ed. Cham Switzerland: Springer. 276 p. (Lecture Notes in Computer Science; vol. 15762)Research output: Book/Report › Edited Book › peer-review Integration of Constraint Programming, Artificial Intelligence, and Operations Research: 22nd International Conference, CPAIOR 2025, Melbourne, VIC, Australia, November 10–13, 2025, Proceedings, Part IITack, G. (Editor), 2025, 1st ed. Cham Switzerland: Springer. 272 p. (Lecture Notes in Computer Science; vol. 15763)Research output: Book/Report › Edited Book › peer-review Predict+Optimize Problem in Renewable Energy SchedulingBergmeir, C., de Nijs, F., Genov, E., Sriramulu, A., Abolghasemi, M., Bean, R., Betts, J., Bui, Q., Dinh, N. T., Einecke, N., Esmaeilbeigi, R., Ferraro, S., Galketiya, P., Glasgow, R., Godahewa, R., Kang, Y., Limmer, S., Magdalena, L., Montero-Manso, P. & Peralta, D. & 8 others, Kumar, Y. P. S., Rosales-Pérez, A., Ruddick, J., Stratigakos, A., Stuckey, P., Tack, G., Triguero, I. & Yuan, R., 2025, In: IEEE Access. 13, p. 60064-60087 24 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Resource Constrained Pathfinding with Enhanced Bidirectional A* SearchAhmadi, S., Raith, A., Tack, G. & Jalili, M., 2025, Proceedings of the AAAI Conference on Artificial Intelligence. Walsh, T., Shah, J. & Kolter, Z. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 26878-26885 8 p. (Proceedings of the AAAI Conference on Artificial Intelligence; vol. 39, no. 25).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access Unit Types for MiniZincDekker, J. J., Nguyen, J., Stuckey, P. J. & Tack, G., 2025, 31st International Conference on Principles and Practice of Constraint Programming. de la Banda, M. G. (ed.). Saarbrücken/Wadern, Germany: Schloss Dagstuhl, 20 p. 10. (Leibniz International Proceedings in Informatics, LIPIcs; vol. 340).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile View all 75 research outputs Prizes Finalist for the Australian Research Data Commons Eureka Prize for Excellence in Research SoftwareStuckey, P. (Recipient), Tack, G. (Recipient), Dekker, J. (Recipient) & Nguyen, J. (Recipient), 2024Prize: Other distinction FIT Dean's Award for Excellence in Research ImpactTack, G. (Recipient), 2017Prize: Prize (including medals and awards) Recipient - Doctoral Research Award 2010Tack, G. (Recipient), 2010Prize: Prize (including medals and awards) Activities Activities per year 2013 2013 2015 2016 2021 2021 4 Membership of an advisory panel/policy group/ board 1 Contribution to workshop, seminar, course 1 Editorial responsibility Activities per year Workshop on Constraint Modelling and Reformulation 2022Dekker, J. (Organiser) & Tack, G. (Organiser)3 Nov 2021 → 1 Aug 2022Activity: Participating in or organising an event types › Contribution to workshop, seminar, course ACM - Association for Computing Machinery (External organisation)Tack, G. (Member)1 Jan 2016Activity: Industry, Government and Philanthropy Engagement and Partnerships › Membership of an advisory panel/policy group/ board Association for Constraint Programming (External organisation)Tack, G. (Member)1 Jan 2016Activity: Industry, Government and Philanthropy Engagement and Partnerships › Membership of an advisory panel/policy group/ board Constraints (Journal)Tack, G. (Editor in chief) & Mears, C. D. (Editor in chief)2015Activity: Publication p",
  "content_length": 10317,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:14"
}