{
  "name": "Guillaume Hanrot",
  "homepage": "http://perso.ens-lyon.fr/guillaume.hanrot",
  "status": "success",
  "content": "Guillaume Hanrot's home page Guillaume Hanrot French version I am a professor at ENS Lyon, and a member of the LIP lab. I am a member of the Arenaire research group, which is also an INRIA project-team. I am also vice-president of INRIA's Evaluation Committee, and deputy director of the Computer Science Departement of ENS Lyon. I have been involved in the development of the mpfr library and, in a more minor way, of the PARI system. Both of these are free software. My scientific interests include algorithmic number theory and its applications. Among those, I have been working on problems in computer arithmetic (correct rounding of functions, polynomial and rational approximation and hard algorithmic problems in cryptology, eg lattice algorithmics which is my main center of interest those days. Until September 2005, I was part-time associate professor at École polytechnique, and until 2009 I was an INRIA researcher at INRIA Nancy Grand Est, and team leader of the Cacao project-team. Contact information Guillaume HANROT LIP / ENS-Lyon 46, allée d'Italie F-69364 LYON e-mail : Guillaume.Hanrot@ens-lyon .fr PGP/GnuPG public key Phone : (+33) (0)4 72 72 87 59 Fax : (+33) (0)4 72 72 80 80 Publication list Journals Yuri Bilu, Guillaume Hanrot, Solving Thue equations of high degree, J. Number Theory 60 (1996), 373-392. Yuri Bilu, Guillaume Hanrot, Solving Superelliptic Diophantine Equations by Baker's method, Compositio Math. 112 (1998), 273-312. Yuri Bilu, Guillaume Hanrot, Thue equations with composite fields, Acta Arith. 88 (1999) no 4, 311-326. Guillaume Hanrot, Solving Thue equations without the full unit group, Math. Comp. 69 (2000), 395-405. Guillaume Hanrot, Natarajan Saradha, Tarlok Shorey, Almost perfect powers in consecutive integers, Acta Arith. 99 (2001) no 1-3, 13-25. Yuri Bilu, Guillaume Hanrot, Paul Voutier, Existence of primitive divisors of Lucas and Lehmer numbers. J. Reine Angew. Math. 539 (2001), 75-122. Preliminary version Yann Bugeaud, Guillaume Hanrot, Un nouveau critère pour l'équation de Catalan, Mathematika 47 (2000), 63-73. Preliminary version Yann Bugeaud, Guillaume Hanrot, Maurice Mignotte, Sur l'équation diophantienne (x^n - 1)/(x - 1) = y^q, III. Proc. London Math. Soc. 84 (2002) no 1, 59-78. Preliminary version Guillaume Hanrot, Joël Rivat, Gérald Tenenbaum, Paul Zimmermann, Density results on floating-point invertible numbers, Theoret. Comput. Sci., 291 (2004), 135-141. Guillaume Hanrot, Michel Quercia, Paul Zimmermann, The Middle Product Algorithm, I. Speeding up the division and square root of power series, Appl. Alg. Eng. Comm. Comp. 14 (2004), 415-438. Preliminary version Guillaume Hanrot, Paul Zimmermann, A note on Mulders' short product, J. Symb. Comput. 37 (2004), 391-401. Preliminary version David Defour, Guillaume Hanrot, Vincent Lefèvre, Jean-Michel Muller, Nathalie Revol, and Paul Zimmermann. Proposal for a Standardization of Mathematical Function Implementation in Floating-Point Arithmetic, Numerical Algorithms, 37 (2004), 367-375. Preliminary version Laurent Fousse, Guillaume Hanrot, Vincent Lefèvre, Patrick Pelissier, Paul Zimmermann, Multiple-Precision Floating-Point Computation With Well-Defined Semantics: The MPFR Library. ACM TOMS, 33 (2) (2007). Guillaume Hanrot, Gérald Tenenbaum, Jie Wu, Moyenne de certaines fonctions arithmétiques sur les entiers friables, Proc. London Math. Soc. 96 (1) (2008), 107-135. Guillaume Hanrot, Bruno Martin, Gérald Tenenbaum, Constantes de Turan-Kubilius friables : une étude expérimentale, Exp. Math. 19 (3) (2010), 345-361. International Conferences Guillaume Hanrot, François Morain, Solvability by radicals from an algorithmic point of view, ISSAC 2001, 175-182. Version préliminaire Nicolas Brisebarre, Guillaume Hanrot, Floating-point L^2 approximations to functions, Proceedings of the 18th Symposium in Computer Arithmetic, 177-186. Guillaume Hanrot, Vincent Lefèvre, Damien Stehlé, Paul Zimmermann, Worst Cases of a Periodic Function With Large Arguments, Proceedings of the 18th Symposium in Computer Arithmetic, 133-140. pp. 85-91. Guillaume Hanrot, Damien Stehlé, Improved analysis of Kannan's Shortest Lattice Vector Algorithm, Crypto'2007, Springer-Verlag Lecture Notes in Computer Science 4622, pp. 170-186. Laurent Théry, Guillaume Hanrot, Primality Proving with Elliptic Curves, TPHOL'2007, Springer-Verlag Lecture Notes in Computer Science 4732, pp. 319-333. Jérémie Detrey, Guillaume Hanrot, Xavier Pujol, Damien Stehlé, Accelerating Lattice Reduction with FPGAs, LatinCrypt'2010, Springer-Verlag Lecture Notes in Computer Science 6212, pp. 124-143. Guillaume Hanrot, Damien Stehlé, Xavier Pujol, Algorithms for the Shortest and Closest Lattice Vector Problems, IWCC 2011 (to appear). (Invited paper, survey). Guillaume Hanrot, Damien Stehlé, Xavier Pujol, Terminating BKZ, Crypto'2011 (to appear). Book chapters Guillaume Hanrot, Quelques idées sur l'algorithmique des équations diophantiennes. In N. Berline, A. Plagne, C. Sabbah (Éds.), Théorie algorithmique des nombres et équations diophantiennes, journées X-UPS 2005, Ellipses. Yann Bugeaud, Guillaume Hanrot, Maurice Mignotte. Applications of Linear Forms in Logarithms. Chapter 12. Dans H. Cohen, Number theory: Analytic and Modern Methods, Springer-Verlag Graduate Texts in Mathematics 240, to appear. Guillaume Hanrot, LLL: a tool for effective diophantine approximation. Dans P. Q. Nguyen, B. Vallée (Eds.), The LLL Algorithm: Survey and Applications, Springer-Verlag, Series Information Security and Cryptography (2009), pp. 215-264. Proceedings volume edited. Guillaume Hanrot, Paul Zimmermann (Eds.), Proceedings of the 7th Conference on Real Numbers and Computers (RNC'7). 151 pp. Guillaume Hanrot, François Morain, Emmanuel Thomé (Eds.), Proceedings of the IXth Algorithmic Number Theory Symposium (ANTS'9), Springer-Verlag Lecture Notes in Computer Science 6197. Manuscripts and lecture notes Guillaume Hanrot, Damien Stehlé, A Complete Worst-Case Analysis of Kannan's Shortest Lattice Vector Algorithm, soumis. Guillaume Hanrot, Quelques algorithmes en arithmétique, mémoire d'habilitation à diriger des recherches (2005). Robert Cori, Guillaume Hanrot, Jean-Marc Steyaert, Conception et analyse d'algorithmes. Cours de dernier semestre à l'École polytechnique (2001). Guillaume Hanrot, Résolution effective d'équations diophantiennes : algorithmes et applications, Thèse, Université Bordeaux 1 (1997). Last update on Nov. 22, 2010.",
  "content_length": 6453,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:17"
}