{
  "name": "Guillermo Gallego 0002",
  "homepage": "https://www.eecs.tu-berlin.de/menue/einrichtungen/professuren/professorinnen/gallego/parameter/en",
  "status": "success",
  "content": "Fakultät IV - Elektrotechnik und Informatik - TU Berlin © Fak. IV / Ruta Bis 16.11.: ANMELDEN für die Abschlussfeier 2025! FAK IV-Absolvent*innen: Studium abgeschlossen und Zeugnis erhalten? Melden Sie sich ab sofort für die Abschlussfeier (5.12.) an! Deadline: 16.11.2025 ANMELDUNG, Programm & Infos © Brian A. Jackson/www.shutterstock.com 28.10: Event \"Studium oder Praktikum im Ausland?\" Lust auf ein Studium oder Praktikum im Ausland? Kommen Sie in unsere Online-Infoveranstaltung, stellen Sie Ihre Fragen! Wann: 28.10., 16.15 – 18 Uhr. Details © Philipp Arnoldt Studienstart WiSe 2025/26 Für Neuimmatrikulierte: FOLIEN zu Einführungsveranstaltungen & weitere Events und Get-Together Hier entlang... © Tero Vesalainen FAK IV-Masterstudium? FAQ zu Bewerbung & Zulassung Sie erwägen ein FAK IV-Masterstudium? Dann lesen Sie bitte die von uns umfänglich beantworteten Studieninteressierten-FAQ zu Bewerbung & Zulassung! zu den FAQ Absolvent*innen 2024/25: Melden Sie sich an! Online-Infoveranstaltung der Fakultät IV Infos & Get-Together für Neuimmatrikulierte FAQ: Vor Bewerbung zum FAK IV-Master bitte lesen! Energie sparen im Heuhaufen Ein Team um Giuseppe Caire wird mit dem renommierten „ERC Synergy Grant“ ausgezeichnet und erhält zehn Millionen Euro Fördergeld für die Erforschung einer neuen Methode zur drahtlosen Kommunikation 06.11.2025 Berlin als Hotspot der zweiten Quantenrevolution Interview mit TU-Professor Jean-Pierre Seifert, der seine Universität im Vorstand der Initiative „Berlin Quantum“ vertritt 27.10.2025 J.-P. Seifert erhält ersten „Test-of-Time Award“ der Asiatischen Konferenz für Computer- und Kommunikationssicherheit Gewürdigt wird eine Veröffentlichung aus dem Jahr 2007, die das völlig neue Forschungsfeld der Mikroarchitektur-Angriffe begründete 15.10.2025 Pioneer Award für Klaus-Robert Müller BIFOLD Co-Direktor und Professor an der TU Berlin, Prof. Dr. Klaus‑Robert Müller, wurde von der IEEE Computational Intelligence Society (CIS) mit dem „Neural Network Pioneer Award 2026“ ausgezeichnet 14.10.2025 01 Dez Wissenschaftliche Aussprache: „Grant-Free Random Access for… 03 Dez Sitzung des Fakultätsrats 04 Dez Wissenschaftliche Aussprache: „Automated Labeling Pipeline… 04 Dez Wissenschaftliche Aussprache: „Advancing Cooperative…Alle anzeigen Weitere Nachrichten Aktuelles auf einen Blick Anlaufstelle bei Diskriminierung (Fakultät IV)Wenden Sie sich gern direkt an das Team Awareness und Antidiskriminierung (AwAn) der FAK IV, wenn Sie Hilfe benötigen, Fragen oder Vorschläge haben.Mentoring Fak IVOb gerade immatrikuliert oder höheres Semester: informieren Sie sich über unsere vielfältigen Mentoring-Angebote zur Orientierung im Studium – oder werden Sie selbst Mentor*in!© Philipp ArnoldtStudentische StudienfachberatungWir verfügen über viel Erfahrung rund um das FAK IV-Studium und unterstützen Sie, ob Student*in oder Studieninteressierte*r, bei organisatorischen sowie inhaltlichen Fragen. © Philipp ArnoldtAbschlussarbeitenSie planen oder schreiben zurzeit Ihre Abschlussarbeit? Sie suchen Beratung, hilfreiche Informationen, Abschlussarbeitsthemen oder Kontakte in unsere Fachgebiete? Dann schauen Sie hier vorbei!© Felix NoakPromotionSie streben eine Promotion an oder promovieren bereits? Hier finden Sie u.a. Tipps, Richtlininen, Fristen, Kontakte und eine Übersicht über bisherige Promotionen.© Daha YeoFAK IV-Tutor*innenSie sind Tutor*in an der Fakultät IV oder möchten es werden? Auf den folgenden Seiten finden Sie viele Informationen und Tipps für Tutor*innen und Bewerber*innen.© Philipp ArnoldtInternationale Studierende FAK IVHier finden Sie Angebote, Infos und Ansprechpartner*innen rund um Studium, interkulturelle Verständigung und Alltagsleben.© Felix NoakStudieninteressierteSie interessieren sich für einen unserer Bachelor- oder Masterstudiengänge? Hier finden Sie nähere Informationen.© Philipp ArnoldtSchüler*innen & Schulen► dEIn-Labor - Schüler*innenlabor der Fakultät IV ► Studienfachberatung ► Infoveranstaltungen ► TU-weite AngeboteInstitut für Energie- und Automatisierungstechnik Institut für Hochfrequenz- und Halbleiter-SystemtechnologienInstitut für Telekommunikations-systemeInstitut für Technische Informatik und MikroelektronikInstitut für Softwaretechnik und Theoretische InformatikInstitut für Wirtschaftsinformatik und Quantitative Methoden Ich bin damit einverstanden, dass mir Inhalte von OpenStreetMap angezeigt werden. Fakultät IV - Elektrotechnik und Informatik Sekretariat Sekr. MAR 6-1 Adresse Marchstraße 23 10587 Berlin Ansprechpartner*innen im Fakultäts-Service-Center",
  "content_length": 4565,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:38"
}