{
  "name": "Guillaume-Alexandre Bilodeau",
  "homepage": "https://www.polymtl.ca/expertises/en/bilodeau-guillaume-alexandre",
  "status": "success",
  "content": "Bilodeau, Guillaume-Alexandre | Directory of Experts Skip to main content Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission Visit Us Make a donation © Polytechnique Montréal 2025. Poly Directory Courses Return to main menu Prospective Students Programs of Studies Research Media Company About Us Fondation et Alumni Home Research projects for graduate students Professors/Researchers Research units Expertise types Student Zone Employee Zone Admission © Polytechnique Montréal 2025. Directory of Experts Bilodeau, Guillaume-Alexandre Poly Directory Courses Français Directory of Experts Bilodeau, Guillaume-Alexandre Directory of Experts Back to search results Edit my profileHelp Publications Link(s) Guillaume-Alexandre Bilodeau B.Sc.A., M.Sc.A., Ph.D. (Laval) Publications Link(s) Full Professor Department of Computer Engineering and Software Engineering Phone: (514) 340-4711 Ext. 5064 Fax: (514) 340-5139 Room: M-3420 guillaume-alexandre.bilodeau@polymtl.ca Areas of expertise Computer vision Intelligent systems applications Pattern analysis and machine intelligence Image and video processing Artificial intelligence Primary sphere of excellence in research New Frontiers in Information and Communication Technologies Secondary sphere(s) of excellence in research Modeling and Artificial Intelligence Sustainable Transport and Infrastructures Student research project(s) I am recruiting Research interests and affiliations Research interests The general objective of my research is to design methods and algorithms to interpret the action occurring in a scene. The informations of interest are the interactions between humans and the interactions between humans and the objects in their environment. The use of visible cameras allows identifying some interactions in some circumstances, but in the case of similar colors between the scene and human in it, the analysis becomes quite difficult. I am proposing to use infrared cameras to introduce thermal information in the analysis of the scene. My research projects thus aim to integrate information from visible and infrared cameras to improve the detection of humans and objects, along with their interactions. A second topic of interest of professor Bilodeau is tracking with (pan-tilt-zoom) PTZ cameras. The interest in using such a camera is a larger coverage of a scene with a single camera. Controlling the camera to perform accurate tracking is the challenge that we are undertaking. Finally, professor Bilodeau is also interested in the contribution of infrared cameras to medical experiments. Infrared, more specifically thermography, allows obtaining temperature measurements in real-time of the body of a subject. Our project aims to improve the measurements. Affiliation(s) Images and video processing laboratory (LITIV), Head Institute for Data Valorization (IVADO), Member Expertise type(s) (NSERC subjects) 2603 Computer vision 2604 Intelligent systems applications 2605 Pattern analysis and machine intelligence 2708 Image and video processing Publications Recent publications Journal article Ye, X., & Bilodeau, G.-A. (2025). Continuous conditional video synthesis by neural processes. Computer Vision and Image Understanding, 104387 (11 pages). Conference paper Naimi, S., Said, A., Bouachir, W., & Bilodeau, G.-A. (2025, May). InceptoFormer: A Multi-Signal Neural Framework for Parkinson's Disease Severity Evaluation from Gait [Paper]. 38th Canadian Conference on Artificial Intelligence (Canadian AI 2025), Calgary, AB, Canada (11 pages). Journal article Miah, M., Bilodeau, G.-A., & Saunier, N. (2025). Learning data association for multi-object tracking using only coordinates. Pattern Recognition, 160, 11 pages. Dataset Zarrami, W., & Bilodeau, G.-A. (2025). Raw_radar_fmcw_Dataset [Dataset]. See all publications (166) Biography Guillaume-Alexandre Bilodeau received the B.Sc.A. degree in computer engineering, his M.S. and Ph.D. degree in electrical engineering from Université Laval in Canada, in 1997, 1999 and 2004, respectively. In 2004, he was appointed Assistant Professor at École Polytechnique de Montréal, and Associate Professor in 2011. Since 2014, he is a Full Professor at the same institution. In 2002, he received an Honorable mention for the Twenty-ninth annual Pattern Recognition Society award for his paper entitled \"Part segmentation of objets in real images\" in the journal Pattern Recognition. Since 2006, he is a member of the steering commitee and of the thematic committee of the REPARTI center. In 2008, he received the best vision paper award at the Canadian Conference on Robot Vision (CRV).  In 2011, he was the general chair of IEEE Symposium on Robotic and Sensor Environments. From june to november 2012, Dr. Bilodeau was Visiting Professor at the School of Electrical Engineering and Computer Science at University of Ottawa. In 2014, he was local arrangements chair for AI/GI/CRV. His research interests encompass image and video processing, video surveillance, object recognition, content-based image retrieval, and medical applications of computer vision. Dr. Bilodeau is a member of the Province of Quebec's Association of Professional Engineers (OIQ) and of the Institute of Electrical and Electronics Engineers (IEEE) Teaching INF8770 Technologies multimédias INF6804 Vision par ordinateur Supervision at Polytechnique COMPLETED Ph.D. Thesis (12) Miah, M. N. (2024). Suivi multi-objets : au-delà des vecteurs de réidentification pour l'association de données [Ph.D. thesis, Polytechnique Montréal]. Ye, X. (2024). Video Future Frames Prediction by Deep Generative Models [Ph.D. thesis, Polytechnique Montréal]. Lamghari, S. (2023). Reconnaissance automatisée des activités et des comportements humains à travers l'analyse de vidéos [Ph.D. thesis, Polytechnique Montréal]. Ooi, H. L. (2021). Multiple Object Tracking in Urban Traffic Scenes [Ph.D. thesis, Polytechnique Montréal]. Perreault, H. (2021). Détection et segmentation des usagers de la route dans des images et vidéos [Ph.D. thesis, Polytechnique Montréal]. St-Charles, P.-L. (2018). Segmentation mutuelle d'objets d'intérêt dans des séquences d'images stéréo multispectrales [Ph.D. thesis, École Polytechnique de Montréal]. Chakravorty, T. (2017). Robust Face Tracking in Video Sequences [Ph.D. thesis, École Polytechnique de Montréal]. Riahi, D. (2016). Suivi multi-objets par la détection : application à la vidéo surveillance [Ph.D. thesis, École Polytechnique de Montréal]. Bouachir, W. (2014). Suivi d'objets par caractéristiques locales encodant la structure [Ph.D. thesis, École Polytechnique de Montréal]. Farah, R. (2013). Computer Vision Tools for Rodent Monitoring [Ph.D. thesis, École Polytechnique de Montréal]. Torabi, A. (2012). Video Registration for Multimodal Surveillance Systems [Ph.D. thesis, École Polytechnique de Montréal]. Darvish Zadeh Varcheie, P. (2010). Low and Variable Frame Rate Face Tracking Using an IP PTZ Camera [Ph.D. thesis, École Polytechnique de Montréal]. Master's Thesis (27) Zarrami, W. (2025). Localisation des humains en présence d'artéfacts environnementaux à l'aide du radar FMCW [Master's thesis, Polytechnique Montréal]. Hajlaoui, R. (2023). Multimodal Emotion Recognition and Sentiment Analysis [Master's thesis, Polytechnique Montréal]. Jodogne Del Litto, K. (2023). Segmentation d'instances d'objets par approximation de masques [Master's thesis, Polytechnique Montréal]. Meilleur, J. (2023). Suivi multiobjet à l'aide de l'apprentissage automatique et de points au haut des objets [Master's thesis, Polytechnique Montréal]. Sobolevsky, A. (2023). Development of an Artificial Intelligence Model Able to Generate Designs for Software Interfaces [Master's thesis, Polytechnique Montréal]. Asmar, M. (2022). A Computer Vision-Based Automatic Transcription of Guitar Music from RGBD Videos [Master's thesis, Polytechnique Montréal]. Duplessis-Guindon, P. (2022). Méthodes d'apprentissage profond pour l'estimation de disparités d'une paire d'images multispectrale [Master's thesis, Polytechnique Montréal]. Nazemi Gelian, M. (2022). A Design Approach for Efficient Inter-Camera Vehicle Tracking [Master's thesis, Polytechnique Montréal]. Wang, D. (2022). Transformers with Convolutional Methods for Person Re-Identification [Master's thesis, Polytechnique Montréal]. Kang, Z. (2021). Multiple Object Tracking in Videos [Master's thesis, Polytechnique Montréal]. Messoussi, O. (2021). Real-Time Vehicle Detection and Tracking From Surveillance Cameras in Urban Scenes [Master's thesis, Polytechnique Montréal]. Nahon, R. (2021). Développement d'un module d'association de tracklets pour améliorer des traqueurs dans le suivi de piétons dans un milieu urbain [Master's thesis, Polytechnique Montréal]. Beaupré, D.-A. (2020). Apprentissage profond pour vision stéréoscopique multispectrale [Master's thesis, Polytechnique Montréal]. Khraimeche, Y. (2020). Adaptation de domaine non supervisée pour la ré-identification de personnes dans des vidéos [Master's thesis, Polytechnique Montréal]. Simon, J. (2020). Échantillonnage sémantique et classification des couleurs pour la recherche de personnes dans les vidéos [Master's thesis, Polytechnique Montréal]. Li, Z. (2019). Visual Object Tracking Using Deep Similarity Networks [Master's thesis, Polytechnique Montréal]. Pineault, A. (2019). Suivi multiobjet en situation urbaine à l'aide de la programmation par contraintes [Master's thesis, Polytechnique Montréal]. El Maâchi, I. (2018). Algorithmes de détection des maladies neurodégénératives à partir de la démarche d'un individu [Master's thesis, École Polytechnique de Montréal]. Derue, F.-X. (2016). Suivi de cible basé sur un modèle de superpixels et points clés [Master's thesis, École Polytechnique de Montréal]. Blouin, F. (2014). Conception d'un système de ",
  "content_length": 12113,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:21"
}