{
  "name": "Guiling Wang",
  "homepage": "https://web.njit.edu/~gwang",
  "status": "success",
  "content": "Guiling Wang Home Research Publications Funding Teaching Service People Guiling (Grace) Wang, PhD, CFA, IEEE Fellow [Short Bio] Distinguished Professor Associate Dean for Research and External Relations Founding Director of the AI Center for Research Grace is a Distinguished Professor and Associate Dean for Research and External Relations at NJIT's Ying Wu College of Computing, and the Founding Director of the AI Center for Research. She is also a joint professor in the Martin Tuchman School of Management and the Data Science Department. Grace earned her Ph.D. in Computer Science and Engineering with a minor in Statistics from Penn State in 2006. Her research interests span applied AI in Finance, Transportation, Art, and Law. Beyond academia, she serves as the sole academic representative on the New Jersey Supreme Court Committees on AI and the Courts, on the Advisory Committee on Access and Fairness, and as an AI Subject Matter Expert for the U.S. Department of Homeland Security's SAGE program. News 11/2024: Muntasir has successfully defended his thesis. Congratulations, Dr. Rahman! 11/2024: Wei has successfully defended his thesis. Congratulations, Dr. Yao! 08/2024: Dr. Wang has been invited to serve as a Subject Matter Expert on AI for the SAGE program of the Department of Homeland Security for a 5-year term from 2024 to 2029. 06/2024: Congratulations to Wenlu on successfully defending her thesis! Dr. Wenlu Du will be joining Skidmore University this fall, ranked as the 38th best national liberal arts college in the 2024 U.S. News & World Report rankings. 05/2024: Congratulations to Xinyun, who has received an internship offer from NEC Research. 04/2024: Dr. Grace Wang participated in an AI RoundTable Discussion alongside leading figures from various industries including banking, retail, healthcare, and law on April 8. The event was hosted by NJ Business Magazine. 03/2024: Congratulations to Junyi, Jingyi and Ankan, who have received internship offers from NEC, Samsung, and Regeneron, respectively. 01/2024: Prof. Wang will serve on the NJ Governor's AI Taskforce Innovation Subgroup. 10/2023: Prof. Wang was voted favorably and unanimously to Chair the IEEE IoT Technical Community Awards Committee. 09/2023: Prof. Wang has been appointed by the New Jersey Chief Justice to serve on the New Jersey Supreme Court Committee on AI and the Courts. 06/2023: Our paper, \"A Deep Reinforcement Learning Network for Traffic Light Cycle Control,\" published in 2019, has received the IEEE Vehicular Technology Society 2023 Best Land Transportation Paper Award, recognizing its significant impact four years after publication. 05/2023: We are happy to announce that the Finance Day at KDD 2023 will offer student travel awards. We encourage you to apply for the awards and participate in the Finance Day event. Your presence is most welcome. 05/2023: Prof. Wang, along with Prof. Mihai Cuccuringu from the University of Oxford, will jointly serve as co-chairs of the Technical Program Committee for the 4th ACM Conference on AI in Finance (ICAIF 2023). Please submit your exceptional research papers to ICAIF and join us in this esteemed conference. 05/2023: Alon Lerner, our undergraduate research assistant, will graduate in May and join Bank of America. Congratulations! 05/2023: Jingyi obtained the Excellence in Teaching Award as a Teaching Assistant. Congratulations! 05/2023: Jingyi has successfully defended her proposal on \"Exploring the Stochasticity Characteristics of Stock Market with Deep Learning\". Congratulations! 04/2023: Junyi accepted the internship offer from NEC Research and will spend his summer at Princeton. Congratulations! 04/2023: Together with Drs. Tucker Balch and Daniel Borrajo at JP Morgan, Dr. Grace Wang will organize a special day on Finance in KDD 2023. Welcome to Long Beach, CA this summer! 03/2023: Ankan accepted the internship offer from Samsung and will spend his summer at Mountain View. Congratulations! 02/2023: Muntasir accepted the internship offer from QualComm and will spend his summer at San Diego. Congratulations! 12/2022: Ankan has successfully defended his Ph.D. proposal on \"Deep Learning for Visual Synthesis\". Congratulations, Ankan! 11/2022: Our paper \"SafeLight: A Reinforcement Learning Method toward Collision-free Traffic Signal Control\" was accepted by AAAI 2023. Congratulations to Wenlu, Junyi, and Jingyi. 11/2022: Junyi has participated in Wolters Kluwer DataSolve Competition 2022. His accuracy (Macro F1 Score) was the highest on both public and private leaderboards. Fantastic job, Junyi! 06/2022: Dr. Grace Wang is promoted to the rank of Distinguished Professor. 04/2022: Muntasir accepted the internship offer from QualComm at San Diego. Congratulations. 04/2022: Ankan accepted the internship offer from Samsung at Mountain View among multiple offers. Congratulations. 04/2022: Partha accepted the internship offer from Amazon at Seattle among multiple offers. Congratulations. 01/2022: Dr. Grace Wang is elevated to the rank of IEEE Fellow as the first female IEEE Fellow at NJIT. NJIT news is here. 01/2022: Dr. Xiaoyuang Liang, our graduate, a research scientist at Facebook upon graduation, got promoted to the senior scientist position, obtained green card, and went abroad to Mexico for the first time after the pandemic. Congratulations! I am so happy and proud of you! 10/2021: Dr. Yuan Lu, our graduate, got his first baby daughter. Congratulations!! 06/2021: Our paper \"air Peer-to-Peer Content Delivery via Blockchain\" was accepted by ESORICS 2021. Congratulations to Songlin and Yuan. 05/2021: Yuan got the Best Ph.D. Thesis Award of YWCC. Congratulations! 09/2020: Our project \"Decentralized Vehicle Credential Management System Based on Consortium Blockchain\" (2020-2023) was funded by FHWA's Exploratory Advanced Research (EAR) program as one of the four awardees among 122 proposal submissions nationwide. 08/2020: Yuan has successfully defended his Ph.D. thesis on \"Crowdsourcing Atop Blockchains\" and will join the Institute of Software, Chinese Academy of Sciences. Congratulations, Dr. Lu! 06/2020: Our paper \"Generic Superlight Client for Permissionless Blockchains\" is accepted by ESORICS 2020. Good job, Yuan! 06/2020: Dr. Grace Wang is appointed to be the Associate Dean for Research of the YW College of Computing, starting from July 1 2020. 05/2020: Xiaoyuan got the Best PhD Thesis Award of YWCC. Congratulations! 05/2020: Our paper \"Optimal Multi-Valued Validated Asynchronous Byzantine Agreement Revisited\" is accepted by PODC 2020. Good job, Yuan! 03/2020: Our paper \"Dragoon: Private Decentralized HITs Made Practical\" is accepted by ICDCS 2020. Good job, Yuan! 11/2019: Our paper \"A Deep Learning Model for Transportation Mode Detection Based on Smartphone Sensing Data\" was accepted for publication in the IEEE Transactions on Intelligent Transportation Systems. You are welcome to use the transportation mode data we collected. 05/2019: Our paper \"Learning K-way D-dimensional Discrete Embedding for Hierarchical Data Visualization and Retrieval\" has been accepted for publication in the proceedings of IJCAI 2019. Good job, Xiaoyuan! 04/2019: Xiaoyuan accepted the offer of Facebook and will join the Machine Learning group as a Research Scientist this summer. Congratulations to both Xiaoyuan and FB! 😊 04/2019: Our PhD alumni, Dr. Jie Tian, left Amazon and joined Facebook New York City site. Good luck in the new journey! 01/2019: Our paper on A Deep Reinforcement Learning Network for Traffic Light Cycle Control is published at IEEE Transactions of Vehicular Technologies. Good job, Xiaoyuan! 12/2018: Our paper on passenger demand prediction using deep neural network is accepted by SDM 2019. Good job, Xiaoyuan! 09/2018: Our NSF EAGER proposal on Connected and Autonomous Vehicles Evaluation Platform is funded. 07/2018: Grace presented a paper about blockchain’s application on crowdsourcing at ICDCS 2018 at Vienna, Austria. To prospective PhD students: I am always excited to collaborate with self-motivated students who are passionate about foundational AI, Large Language Models (LLMs), and applied AI across various domains such as Transportation, Law, Arts and Design, Finance, IoT, and more. Please email me your CV, transcripts, GRE score (if you have), and any other relevant documents, such as publications or past projects you would like me to review. To prospective MS students To prospective undergraduate students To YWCC students with a general interest in research ⚠️Beware of fraudulent Gmail emails about internships at our group or the AI Center. Disregard and report as scams. No paid internships offered. To students who are taking my classes: CS/DS677 Deep Learning CS698 Blockchain Technologies and Applications Email: Phone: +1 (973) 596-5211 Office: Guttenberg Information Technology Center(GITC), GITC5718 (inside YWCC Dean's Suite 5700). GITC is Building 28 on this campus map. Surface mail: Department of Computer Science New Jersey Institute of Technology 218 Central Avenue Newark, NJ 07102, U.S.A.",
  "content_length": 9084,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:16"
}