{
  "name": "Guillaume Rabusseau",
  "homepage": "https://www.iro.umontreal.ca/~grabus",
  "status": "success",
  "content": "Guillaume Rabusseau | Home Guillaume Rabusseau Associate Professor Canada CIFAR AI Chair Mila / Department of Computer Science and Operations Research (DIRO) Université de Montréal HomeResearchPublicationsTalksStudentsTeachingCV Contact Pavillon André-Aisenstadt - Office 3151 2920 chemin de la Tour Montréal (QC) Canada firstname.lastname[at]umontreal[dot]ca Office: 3151 @ UdeM / D.15 @ Mila News: I am serving as an area chair for AISTATS and ICML this year. One paper accepted at NeurIPS 2025 D&B track: MiNT: Multi-Network Training for Transfer Learning on Temporal Graphs led by Kiarash Shamsi. I will teach my seminar class on matrix/tensor factorization for ML next Fall: IFT-6166 One paper accepted at ICML 2025 by my new PhD student Pascal Jr. ​Tikeng Notsawo, in collaboration with Guillaume Dumas: Grokking Beyond the Euclidean Norm of Model Parameters. I will teach 3 courses on Quantum Computing through the Lens of Tensor Networks at the Mathematics and Physics of Quantum Computing and Quantum Learning in Porquerolles (FR) in May. I am looking for a postdoc with expertise on tensors and tensor networks for ML. If you are interested, please contact me by email using the subject [Postdoc TN4ML] I am proud to announce two excellent news: I got promoted to Associate professor (tenured) and my CIFAR AI chair has just been renewed!!! Two papers accepted at NeurIPS 2024! Efficient Leverage Score Sampling for Tensor Train Decomposition, led by Behestheh T. Rakhshan and Vivek Bharadwaj. TGB 2.0: A Benchmark for Learning on Temporal Knowledge Graphs and Heterogeneous Graphs, led by Julia Gastinger and Andy Huang. One paper accepted at ICML 2024 (spotlight): A Tensor Decomposition Perspective on Second-order RNNs led by my PhD student Maude Lizaire, in collaboration with two other students from my group, Michael Rizvi and Marawan Gamal! Two papers accepted at AISTATS and one at ICLR in 2024! Towards Foundational Models for Molecular Learning on Large-Scale Multi-Task Datasets, led by Dominique Beaini and my student Andy Huang, ICLR 2024 Simulating weighted automata over sequences and trees with transformers, led by my student Michael Rizvi-Martel, with Maude Lizaire and Clara Lacroce, AISTATS 2024 Length independent PAC-Bayes bounds for Simple RNNs, led by Volodimir Mitarchuk, AISTATS 2024 I am teaching a seminar class next Winter semester on matrix/tensor factorization for ML: IFT-6166 My students Farzaneh Heidari, Beheshteh Rakhshan and Michael Rivzi-Martel are organizing a reading group on Tensor Networks for ML, every Tuesday 11am EST: more info here! Our paper Temporal graph benchmark for machine learning on temporal graphs which introduces the TGB benchmark has been accepted at NeurIPS 2023! Awesome work led by Andy Huang and Farimah Poursafaei. Our paper Fast and Attributed Change Detection on Dynamic Graphs with Density of States with Andy Huang, Jacob Danovitch and Reihaneh Rabbany has been accepted to PAKDD 2023! Our paper High-Order Pooling for Graph Neural Networks with Tensor Decomposition with Chenqing Hua and Jian Tang has been accepted to NeurIPS 2022! Four ongoing work to be presented at LearnAut 2022! Spectral Regularization: an Inductive Bias for Sequence Modeling with Kaiwen Hou Spectral Initialization of Recurrent Neural Networks: Proof of Concept with Maude Lizaire and Simon Verret Sequential Density Estimation via Nonlinear Continuous Weighted Finite Automata with Tianyu Li and Bogdan Mazoure Towards an AAK Theory Approach to Approximate Minimization in the Multi-Letter Case with Clara Lacroce and Prakash Panangaden The extended version of our AISTATS 2019 paper with Tianyu Li and Doina Precup has been accepted for publication in the Special Issue on Grammatical Inference of Machine Learning (with connections with tensor networks in addition to RNNs and automata!) : Connecting Weighted Automata, Tensor Networks and Recurrent Neural Networks through Spectral Learning. Our paper Lower and Upper Bounds on the VC-Dimension of Tensor Network Models with my student Behnoush Khavari has been accepted to NeurIPS 2021! ` Our paper Optimal Spectral-Norm Approximate Minimization of Weighted Finite Automata was accetped at ICALP 2021! Work led by Clara Lacroce in collaboration with Borja Balle, Prakash Panangaden and Doina Precup. I will be serving as an area chair at NeurIPS 2021. Three papers accepted at AISTATS 2021: Tensor Networks for Probabilistic Sequence Modeling with Jacob Miller and John Terilla. Quantum Tensor Networks, Stochastic Processes, and Weighted Automata with Siddarth Srinivasan, Sandesh Adhikary, Jacob Miller and Byron Boots. A Theoretical Analysis of Catastrophic Forgetting through the NTK Overlap Matrix with Thang Doan, Mehdi Bennani, Bogdan Mazoure and Pierre Alquier Our paper Horizontal gene transfer and recombination analysis of SARS-CoV-2 genes helps discover its close relatives and shed light on its origin with V. Makarenkov, B. Mazoure and P. Legendre has been published in BMC Ecology and Evolution. Our student Andy Huang (co-supervised with R. Rabbany) got a paper accepted at KDD'2020! Laplacian Change Point Detection for Dynamic Graphs with Yasmeen Hitti and Reihane Rabbany Two papers accepted at AISTATS 2020: Tensorized Random Projections with Beheshteh Rakhshan. Efficient planning under partial observability with unnormalized Q functions and spectral learning with Tianyu Li, Bogdan Mazoure and Doina Precup Our paper Approximate Minimization of Weighted Tree Automata with Borja Balle (journal extension of our AISTATS 2016 paper) has been accepted to the WATA special issue of Information and Computation! I am extremely honoured to be the recipient of a research chair from the Canada CIFAR AI chairs program! Since September 2018, I am an Assistant Professor at Mila and in the Department of Computer Science and Operations Research (DIRO) at Université de Montréal, and I am a Canada CIFAR AI (CCAI) chair holder since March 2019. Before joining UdeM I was a post-doctoral research fellow in the Reasoning and Learning Lab at McGill University, where I worked with Prakash Panangaden, Joelle Pineau and Doina Precup. I obtained my PhD in 2016 from AMU where I worked in the Qarma team (Machine Learning and Multimedia), under the supervision of François Denis and Hachem Kadri. Before that, I graduated with a MSc in Fundamental Computer Science from AMU and a BSc in Computer Science from the same university in distance learning. Long before that, I studied classical guitar and musicology (I focussed on the work of Conlon Nancarrow and graduated with a Maitrise in Musicology)... I am interested in tensor methods for machine learning and in designing learning algorithms for structured data by leveraging linear and multilinear algebra (e.g. spectral methods).",
  "content_length": 6804,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:19"
}