{
  "name": "Gunes Acar",
  "homepage": "https://gunesacar.net",
  "status": "success",
  "content": "Gunes Acar - Homepage Güneş Acar Assistant Professor Radboud University Home Publications Service Grants and Awards Talks Software Supervision Teaching Press Contact I am a tenured assistant professor at the Digital Security group of Radboud University. I am also affiliated with iHub, Radboud's interdisciplinary research hub on digitalization and society. My research focuses on security and privacy threats​ from websites​​, mobile apps​ and IoT devices​, with a special emphasis on novel ​online tracking​ mechanisms. I also study anonymous communication​ networks such as Tor, and investigate deceptive and manipulative (dark) design patterns​. Current and past positions: 2021- ... @ Radboud University: Assistant Professor (tenured, since 2022), Digital Security Group and iHub 2019-2021 @ FWO / KU Leuven: The Research Foundation – Flanders (FWO) Postdoctoral research fellow at the COSIC research group 2017-2019 @ Princeton University: Postdoctoral research associate at the Center for Information Technology Policy 2012-2017 @ KU Leuven: Predoc and PhD at the COSIC research group under the supervision of Claudia Diaz and Bart Preneel See my dblp, ORCID, or Google Scholar pages for the full list of publications. WhisperTest: A Voice-Control-based Library for iOS UI Automation Z. Moti, T. Janssen-Groesbeek, S. Monteiro, A. Continella, G. Acar. In ACM Conference on Computer and Communications Security, ACM, 2025. The Bitter Pill: Tracking and Remarketing on EU Pharmacy Websites Z. Moti, K. Frings, C. Utz, F. Z. Borgesius, G. Acar. Data Privacy Management (DPM) Workshop (ESORICS Workshops) , 2025. Formguard: Continuous Privacy Testing for Websites Using Automated Interaction Replay T. Vlummens, G. Acar. International Workshop on Privacy Engineering – IWPE'25, in 2025 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW) , 2025. Referrer Policy: Implementation and Circumvention L. M. Zagi, Z. Moti, G. Acar. In Proceedings on Privacy Enhancing Technologies, 2025(3), 21 pages, 2025. Staying at the Roach Motel: Cross-Country Analysis of Manipulative Subscription and Cancellation Flows A. Sheil, G. Acar, H. Schraffenberger, R. Gellert, D. Malone. The ACM CHI Conference on Human Factors in Computing Systems, 2024. Targeted and Troublesome: Tracking and Advertising on Children's Websites Z. Moti, A. Senol, H. Bostani, F. Z. Borgesius, V. Moonsamy, A. Mathur, G. Acar. 2024 IEEE Symposium on Security and Privacy, 2024. Unveiling the Impact of User-Agent Reduction and Client Hints: A Measurement Study (Website • Dataset) A. Senol, G. Acar. In Proceedings of the Workshop on Privacy in the Electronic Society (WPES), 2023. The Time is Ticking: The Effect of Limited Time Discounts on Consumers’ Buying Behavior and Experience J. Tiemessen, H. Schraffenberger, G. Acar. In Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems, 2023. Leaky Forms: A Study of Email and Password Exfiltration Before Form Submission (Website • Dataset) A. Senol, G. Acar, M. Humbert, F. Z. Borgesius. In Proceedings of the 31st USENIX Security Symposium (USENIX), 2022. From “Onion Not Found” to Guard Discovery L. Oldenburg, G. Acar, Claudia Diaz. In Proceedings on Privacy Enhancing Technologies, 2022(1), 22 pages, 2022. The CNAME of the Game: Large-scale Analysis of DNS-based Tracking Evasion Y. Dimova, G. Acar, L. Olejnik, W. Joosen, and T. Van Goethem. In Proceedings on Privacy Enhancing Technologies, 2021(3), 21 pages, 2021. Privacy Policies over Time: Curation and Analysis of a Million-Document Dataset R. Amos, G. Acar, E. Lucherini, M. Kshirsagar, A. Narayanan, and J. Mayer In Proceedings of the The Web (WWW) Conference, 22 pages, 2021. IoT Inspector: Crowdsourcing Labeled Network Traffic from Smart Home Devices at Scale D. Yuxing Huang, N. Apthorpe, F. Li, G. Acar, and N. Feamster. In Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4(2), 14 pages, 2020. No boundaries: data exfiltration by third parties embedded on web pages G. Acar, S. Englehardt, and A. Narayanan. In Proceedings on Privacy Enhancing Technologies 2020(4), 19 pages, 2020. Improving Privacy through Fast Passive Wi-Fi Scanning F. Goovaerts, G. Acar, R. Galvez, F. Piessens, and M. Vanhoef. In Proceedings of the 2019th Nordic Workshop on Secure Computer Systems (NORDSEC 2019) LNCS, 11875, A. Askarov, and W. Rafnsson (eds.), pp. 37-52, 2019. Watching You Watch: The Tracking Ecosystem of Over-the-Top TV Streaming Devices H. Mohajeri Moghaddam, G. Acar, B. Burgess, A. Mathur, N. Feamster, E. W. Felten, P. Mittal, A. Narayanan, and D. Yuxing Huang. In ACM Conference on Computer and Communications Security 2019, J. Katz, and X. Wang (eds.), ACM, pp. 131-147, 2019. Dark Patterns at Scale: Findings from a Crawl of 11K Shopping Websites A. Mathur, G. Acar, M. Chetty, M. Friedman, E. Lucherini, J. Mayer, and A. Narayanan. In Proceedings of the ACM on Human-Computer Interaction 3, ACM, pp. 81:1-81:32, 2019. The Web's Sixth Sense: A Study of Scripts Accessing Smartphone Sensors A. Das, A. Pradeep, G. Acar, and N. Borisov. In ACM Conference on Computer and Communications Security, ACM, pp. 1515-1532, 2018. Web-based attacks to discover and control local IoT devices G. Acar, D. Yuxing Huang, F. Li, A. Narayanan, and N. Feamster. In Proceedings of the 2018 Workshop on IoT Security and Privacy, ACM, pp. 29-35, 2018. How Unique is Your .onion? An Analysis of the Fingerprintability of Tor Onion Services R. Overdorf, M. Juarez, G. Acar, C. Diaz, and R. Greenstadt. In ACM Conference on Computer and Communications Security, ACM, pp. 2021-2036, 2017. Online Tracking Technologies and Web Privacy G. Acar, PhD thesis, KU Leuven, C. Diaz, and B. Preneel (promotors), 242 pages, 2017. Leaky Birds: Exploiting Mobile Application Traffic for Surveillance E. Vanrykel, G. Acar, M. Herrmann, and C. Diaz. In Financial Cryptography and Data Security - 20th International Conference, FC 2016, Lecture Notes in Computer Science 9603, Springer-Verlag, pp. 367-384, 2016. Shopping for privacy: Purchase details leaked to PayPal S. Preibusch, T. Peetz, G. Acar, and B. Berendt. Electronic Commerce Research and Applications(15), pp. 52-64, 2016. The leaking battery: A privacy analysis of the HTML5 Battery Status API L. Olejnik, G. Acar, C. Casteluccia, and C. Diaz. In Data Privacy Management, Autonomous Spontaneous Security, and Security Assurance, Lecture Notes in Computer Science 9481, Springer-Verlag, pp. 254 - 263, 2015. Facebook Tracking Through Social Plug-ins G. Acar, B. Van Alsenoy, F. Piessens, C. Diaz, and B. Preneel, Technical report prepared for the Belgian Privacy Commission, 24 pages, 2015. Purchase details leaked to PayPal S. Preibusch, T. Peetz, G. Acar, and B. Berendt. In Financial Cryptography and Data Security - 19th International Conference, FC 2015, Lecture Notes in Computer Science, Springer-Verlag, pp. 217 - 226, 2015. The Web never forgets: Persistent tracking mechanisms in the wild G. Acar, C. Eubank, S. Englehardt, M. Juarez, A. Narayanan, and C. Diaz. In ACM Conference on Computer and Communications Security, ACM, pp. 674-689, 2014. A Critical Evaluation of Website Fingerprinting Attacks M. Juarez, S. Afroz, G. Acar, C. Diaz, and R. Greenstadt. In ACM Conference on Computer and Communications Security, ACM, pp. 263-274, 2014. Browse at your own risk N. Nikiforakis, G. Acar, and D. Salinger. IEEE Spectrum Magazine 35(8), pp. 30-35, 2014. FPDetective: Dusting the web for fingerprinters G. Acar, M. Juarez, N. Nikiforakis, C. Diaz, S. Gurses, F. Piessens, and B. Preneel. In 20th ACM Conference on Computer and Communications Security, ACM, pp. 1129-1140, 2013. 2025: Program Chair/Co-Editor-in-Chief , PETS 2026, PETS 2027 2025: Co-Organizer, Dagstuhl Seminar \"Online Privacy: Transparency, Advertising, and Dark Patterns\" 2024: Prize Chair, Web Almanac 2024 2023-25: Vice Program Chair / Associate Editor-in-Chief, PETS 2024, PETS 2025 2024: Co-Chair, HotPETs 2024 2023: Expert panel member for the Empirical Study on Dark Commercial Patterns (commissioned by the OECD) 2023: Poster and Demo Chair, PETS 2023 2022: Expert committee member for the Canada Foundation for Innovation’s 2023 Innovation Fund competition. Program Committee Memberships 2025: ConPro, EuroSec 2024: ISC 2023: ACM CCS, PoPETs, MADWeb, ConPro, SecWeb 2022​: USENIX Security, PoPETs, MADWeb, ConPro, SecWeb 2021​: USENIX Security, PoPETs, MADWeb, ConPro, SecWeb, CFail 2020: USENIX Security, Financial Crypto, SecWeb 2019​: PoPETs, ESORICS Poster Session 2018​: PoPETs 2017: PoPETs, DPM, IWPE 2016: IWPE, IFIP SEC External Reviews 2016: PETS 2015: PETS, ESSOS 2014: ACM CCS, PETS, ESORICS, SPACE 2013: PETS, WPES, HotPETs 2012: USENIX FOCI The Dutch Research Council (NWO) Vidi Grant in Applied and Engineering Sciences (2025-2030) A Web Security and Privacy Observatory (WeSPO) 🏆 2022 CNIL-Inria Award for Privacy Protection (2023) Leaky Forms: A Study of Email and Password Exfiltration Before Form Submission (USENIX Security'22) 🏆 Top Reviewer Award, Privacy Enhancing Technologies Symposium (2022) Given to \"reviewers [who] consistently performed constructive, but critical, i.e. helpful, reviews on time and followed up in the discussions. It covers roughly 30% of senior and regular PC\". Runner-up for the Caspar Bowden Award for Outstanding Research in Privacy Enhancing Technologies (2021) Watching You Watch: The Tracking Ecosystem of Over-the-Top TV Streaming Devices (CCS'19) Runner-up for the The Andreas Pfitzmann Best Student Paper Award (2021) The CNAME of the Game: Large-scale Analysis of DNS-based Tracking Evasion (PoPETS'21) Runner-up for the CNIL-Inria Privacy Protection Prize (2020) No Boundaries: Data Exfiltration by Third Parties Embedded on Web Pages (PETS’20) Postdoctoral Research Fellowship, FWO, Research Foundation - Flanders (2019-2022) Ranked 1st in the Expert Panel: Informatics and Knowledge Technology. Awarded in 2017, suspended until 2019 due to my position at Princet",
  "content_length": 21764,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:22"
}