{
  "name": "Gunilla Myreteg",
  "homepage": "https://katalog.uu.se/empinfo/?id=N1-1002",
  "status": "success",
  "content": "Gunilla Myreteg - Uppsala universitet Gunilla Myreteg Universitetslektor vid Företagsekonomiska institutionen; Professorer, lärare, forskare Telefon: 018-471 25 81E-post: gunilla.myreteg@fek.uu.seBesöksadress: EkonomikumKyrkogårdsgatan 10, ingång C751 20 UPPSALAPostadress: Box 513751 20 UPPSALA Ladda ned kontaktuppgifter för Gunilla Myreteg vid Företagsekonomiska institutionen; Professorer, lärare, forskare Akademiska meriter: FD Kort presentation Lektor i redovisning och ekonomistyrning. Forskar om digitalisering av organisationer; hur digitala verktyg utvecklas och införs, digitaliseringens konsekvenser för individer, roller och relationer. Området ger många frågeställningar; begrepp som styrsystem och -verktyg, prestation, mätning, beslut, förändring, acceptans, hållbarhet, gender, strukturer, rutiner, lärande och värdeskapande. Juristexamen från Uppsala universitet, inriktning kredit- och exekutionsrätt samt kommersiell avtalsrätt. Forskning Min forskning kan delas in i två huvudområden: 1. Val, införande och användning av IT-system, såsom affärssystem i tillverkande verksamhet eller beslutsstödsystem i sjuk- och hälsovården. Hur genomför en organisation sitt val av ett nytt IT-system, vilka föreställningar finns om vad IT innebär, vilka behov, möjligheter och begränsningar aktualiseras, och vilket värde skapas samt för vem? Det finns en ömsesidig växelverkan mellan IT och mänskliga aktörer som är komplex och svår att förutsäga – och när IT artefakterna dessutom utvecklas och blir allt mer kapabla så uppkommer många nya situationer där forskningen behöver utveckla kunskap! Starten för detta intresse kom genom mitt deltagande i forskarskolan MIT (https://www.uu.se/forskning/forskarskolan-management-och-it) där jag har varit doktorand och därefter handledare. 2. Området för e-hälsa: att använda digitala verktyg och utbyta information digitalt för att uppnå och bibehålla hälsa (fysiskt, psykiskt och socialt välbefinnande). Vilka möjligheter och svårigheter innebär utvecklingen av e-hälsa, för de anställda i hälsovården, för patienterna och för relationerna mellan läkare och patienter? I detta område har jag huvudsakligen genomfört forskning inom ramen för forskningskonsortiet DOME (https://domeconsortium.org/) som är ett tvärvetenskapligt forskningsnätverk med deltagare från ett flertal lärosäten. Publikationer Senaste publikationer Experiences of Patients With Mental Health Issues Having Web-Based Access to Their Records: National Patient Survey Moll, Jonas; Myreteg, Gunilla; Rexhepi, Hanife Ingår i JMIR Mental Health, 2024 DOI för Experiences of Patients With Mental Health Issues Having Web-Based Access to Their Records: National Patient Survey Ladda ner fulltext (pdf) av Experiences of Patients With Mental Health Issues Having Web-Based Access to Their Records: National Patient Survey What brings women into ehealth?: Women's career trajectories in digital transformations in health care Cajander, Åsa; Corneliussen, Hilde; Myreteg, Gunilla; Dyb, Kari Ingår i Proceedings of the 12th International Conference on e-Health, 2020 Management Controls and the Gendering of the Workplace: The Case of eHealth Projects in Sweden. Myreteg, Gunilla Ingår i American Journal of Management, s. 111-121, 2019 DOI för Management Controls and the Gendering of the Workplace: The Case of eHealth Projects in Sweden. Management Controls and Gendering: The Case of eHealth Projects in Sweden Myreteg, Gunilla Ingår i Proceedings of the 2Nd International Conference on Gender Research (ICGR 2019), s. 417-423, 2019 Why do they need to check me?: Patient participation through eHealth and the doctor–patient relationship Grünloh, Christiane; Myreteg, Gunilla; Cajander, Åsa; Rexhepi, Hanife Ingår i Journal of Medical Internet Research, 2018 DOI för Why do they need to check me?: Patient participation through eHealth and the doctor–patient relationship Alla publikationer Artiklar i tidskrift Experiences of Patients With Mental Health Issues Having Web-Based Access to Their Records: National Patient Survey Moll, Jonas; Myreteg, Gunilla; Rexhepi, Hanife Ingår i JMIR Mental Health, 2024 DOI för Experiences of Patients With Mental Health Issues Having Web-Based Access to Their Records: National Patient Survey Ladda ner fulltext (pdf) av Experiences of Patients With Mental Health Issues Having Web-Based Access to Their Records: National Patient Survey Management Controls and the Gendering of the Workplace: The Case of eHealth Projects in Sweden. Myreteg, Gunilla Ingår i American Journal of Management, s. 111-121, 2019 DOI för Management Controls and the Gendering of the Workplace: The Case of eHealth Projects in Sweden. Why do they need to check me?: Patient participation through eHealth and the doctor–patient relationship Grünloh, Christiane; Myreteg, Gunilla; Cajander, Åsa; Rexhepi, Hanife Ingår i Journal of Medical Internet Research, 2018 DOI för Why do they need to check me?: Patient participation through eHealth and the doctor–patient relationship Patients' experiences of accessing their electronic health records: National patient survey in Sweden Moll, Jonas; Rexhepi, Hanife; Cajander, Åsa; Grünloh, Christiane et al. Ingår i Journal of Medical Internet Research, 2018 DOI för Patients' experiences of accessing their electronic health records: National patient survey in Sweden Ladda ner fulltext (pdf) av Patients' experiences of accessing their electronic health records: National patient survey in Sweden Differences in the experiences of reading medical records online: Elderly, Older and Younger Adults compared Huvila, Isto; Eriksson-Backa, Kristina; Moll, Jonas; Myreteg, Gunilla et al. Ingår i Informaatiotutkimus, s. 51-54, 2018 DOI för Differences in the experiences of reading medical records online: Elderly, Older and Younger Adults compared The record is our work tool!: Physicians' framing of a patient portal in Sweden Grünloh, Christiane; Cajander, Åsa; Myreteg, Gunilla Ingår i Journal of Medical Internet Research, 2016 DOI för The record is our work tool!: Physicians' framing of a patient portal in Sweden Organizational Learning and ERP systems in the post-implementation phase: Where do we stand? A literature review Myreteg, Gunilla Ingår i Electronic Journal of Information Systems Evaluation, s. 119-128, 2015 Cost-benefit evaluation of e-health services: acceptance and value creation are interactive forces. Myreteg, Gunilla Ingår i Health Systems, s. 204-211, 2015 DOI för Cost-benefit evaluation of e-health services: acceptance and value creation are interactive forces. Development of patient access to electronic health records as a step towards ubiquitous public eHealth Scandurra, Isabella; Holgersson, Jesper; Lind, Thomas; Myreteg, Gunilla Ingår i European Journal of ePractice, s. 21-36, 2013 Empowerment or anxiety?: Research on deployment of online medical e-health services in Sweden Huvila, Isto; Myreteg, Gunilla; Cajander, Åsa Ingår i Bulletin of the American Society for Information Science and Technology, s. 30-33, 2013 DOI för Empowerment or anxiety?: Research on deployment of online medical e-health services in Sweden Doktorsavhandlingar, monografi Förändringens vindar: En studie om aktörsgrupper och konsten att välja och införa ett affärssystem Myreteg, Gunilla 2007 Ladda ner fulltext (pdf) av Förändringens vindar: En studie om aktörsgrupper och konsten att välja och införa ett affärssystem Kapitel i böcker, delar av antologi Affärssystem för verksamhetsutveckling Myreteg, Gunilla; Abrahamsson, Gun Ingår i Controllerhandboken, s. 471-504, Liber, 2013 The Challenge of Differing Actor Groups Within an Enterprise Resource Planning Project Myreteg, Gunilla Ingår i Management and Information Technology, s. 27-41, Routledge, 2012 Kundfokus i en decentraliserad verksamhet Myreteg, Gunilla Ingår i Marknadsföring och den nya affärslogiken, s. 83-110, Örebro universitet, 2002 Konferensbidrag What brings women into ehealth?: Women's career trajectories in digital transformations in health care Cajander, Åsa; Corneliussen, Hilde; Myreteg, Gunilla; Dyb, Kari Ingår i Proceedings of the 12th International Conference on e-Health, 2020 Management Controls and Gendering: The Case of eHealth Projects in Sweden Myreteg, Gunilla Ingår i Proceedings of the 2Nd International Conference on Gender Research (ICGR 2019), s. 417-423, 2019 The Construction of Financial Information in an Organizational Setting: The Interactions Between Social Actors and ERP Systems Myreteg, Gunilla Ingår i Proceedings Of 9Th European Conference On Is Management And Evaluation (Ecime 2015), s. 144-150, 2015 ERP systems and organizational learning: Where do we stand?: A literature review Myreteg, Gunilla Ingår i Proceedings of the European Conference on Information Management and Evaluation, s. 155-162, 2014 Development of novel eHealth services for citizen use: Current system engineering vs. best practice in HCI Scandurra, Isabella; Holgersson, Jesper; Lind, Thomas; Myreteg, Gunilla Ingår i Human-Computer Interaction – INTERACT 2013, s. 372-379, 2013 DOI för Development of novel eHealth services for citizen use: Current system engineering vs. best practice in HCI ERP Systems and Financial Accounting: Implications on Occupational Roles. Myreteg, Gunilla 2012 Remembering and Recalling: The ERP System as an Organizational Memory Myreteg, Gunilla Ingår i Proceedings of ECIME 2011, s. 366-372, 2011 On the Embeddedness of ERP Systems: An Institutional Analysis Myreteg, Gunilla Ingår i Proceedings of the 4th European Conference on Information Management and Evaluation, s. 275-281, 2010 Learning to understand what the ERP system is all about: A literature review. Myreteg, Gunilla Ingår i The Proceedings of the 3rd European Conference on Information Management and Evaluation, s. 339-347, 2009 Bilder av ett affärsssystem. Myreteg, Gunilla 2003 The Chaotic Dimension of IT-investments Myreteg, Gunilla; Maaninen-Olsson, Eva 2003 Förändringsarbete och tillväxtsträvanden.: Underleverantöre",
  "content_length": 10119,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:25"
}