{
  "name": "Gunnar Karlsson",
  "homepage": "https://www.kth.se/profile/gk",
  "status": "success",
  "content": "KTH | Gunnar Karlsson Skip to main content Gunnar KarlssonProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/gkDetailsWorks for Division of Network and Systems EngineeringTelephone +46 8 790 42 57Unit address Teknikringen 33E-mail gk@kth.seResearcherResearcher IDORCID IDAbout meI am professor of teletraffic systems since March 1998 and was head of the Department of Network and Systems Engineering at KTH until the end of 2017. I have previously worked for IBM Zurich Research Laboratory, and for the Swedish Institute of Computer Science (now RISE SICS). My Ph.D. is from Columbia University (1989), New York, and my M.Sc. from Chalmers University of Technology in Gothenburg (1983). I have been visiting professor at EPFL, Switzerland, and the Helsinki University of Technology in Finland in 1996 and 1997 (both periods were 6 months); I have spent a year from August 2005 to July 2006 as visiting professor in the the Communication Systems Group at ETH Zurich, Switzerland. I am senior member of the IEEE and a member of ACM, and serve on the editorial board of IEEE Journal on Selected Areas of Communication. My research interests are mobile communication, and quality of service issues for the Internet. I am also interested in teaching and the future of the university and higher education. For work on this, I was awarded the KTH Pedagogic Prize for 2015 with an interview in Swedish in Campi. Here is the report from a workshop on the future of engineering education, KTH Education 2027/2028. Currently I work on continuous education for professionals at Cybercampus Sweden and for KTH in general. I am actively engaged in work regarding total defence in the KTH Center for Total Defence. My publications from Google Scholar and my CV. Societal service and public debates I contribute to the public discussions in Sweden regarding the role and functioning of universities, our education and teaching practices and the impact that new technology might have on work like. My contributions are listed here. We have organized a seminar with Sverker Janson, RISE, on open online courses and the future of the university on May 22, 2013. I have also engaged in the public debate regarding the Swedish television license fee and on the consequences of the progressive automation of work. (The articles are available through the link above.) I led a group that organized a public seminar on the future of work given advances in automation, held on Tuesday April 21, 2015 (in Swedish). I have led a project on Swedish for immigrant, funded by Vinnova with the Swedish titleSvenska överallt: SFI med språkbad. Progress is more important than peace to a university - Clark Kerr: The Uses of the University (5th Ed., 2001) What engineering is about No profession unleashes the spirit of innovation like engineering. From research to real-world applications, engineers constantly discover how to improve our lives by creating bold new solutions that connect science to life in unexpected, forward-thinking ways. Few professions turn so many ideas into so many realities. Few have such a direct and positive effect on people’s everyday lives. We are counting on engineers and their imaginations to help us meet the needs of the 21st century. Source: Changing the conversation – messages for improving public understanding of engineering, National Academy of Engineering, 2008. The proper study of mankind is the science of design. - Herbert Simon, winner of the Riksbank’s Prize in Economic Sciences (1978) CoursesComputer Networks (EP111U), examiner, course responsibleDegree Project in Computer Science and Engineering, specialising in Communication Systems, Second Cycle (DA246X), examinerDegree Project in Computer Science and Engineering, specialising in Cybersecurity, Second cycle (DA237X), examinerDegree Project in Computer Science and Engineering, specialising in Embedded Systems, Second Cycle (DA248X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA258X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA256X), examinerDegree Project in Computer Science and Engineering, specializing in Industrial Management, Second Cycle (DA235X), examinerDegree Project in Computer Science and Engineering, specializing in Machine Learning, Second Cycle (DA233X), examinerDegree Project in Computer Science and Engineering, specializing in Systems, Control and Robotics, Second Cycle (DA236X), examinerDegree Project in Electrical Engineering, Second Cycle (EA250X), examinerDegree Project in Electrical Engineering, Second Cycle (EA238X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA258X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA256X), examinerDegree Project in Electrical Engineering, specializing in Communication Systems, Second Cycle (EA246X), examinerDegree Project in Electrical Engineering, specializing in Information and Network Engineering, Second Cycle (EA260X), examinerDegree Project in Information and Communication Technology, First Cycle (IA150X), examinerEthical Hacking (EP283U), teacherIndividual Project in Networked Systems (EP2800), examinerIntroduction to Computing Systems Engineering (EP1200), teacherSeminar on Advanced Topics in Communication Networks 1 (FEP3316), examinerSeminar on Advanced Topics in Communication Networks 2 (FEP3317), examinerPublicationsPublication listPortfolioArticles for public discussion and guidelines for universitiesLiterature for engineers and computer scientistsKTH Education 2027/2028Ph.D. Thesis: Subband Coding for Packet VideoLinksSkolan för elektro- och systemteknikLinkedIn",
  "content_length": 5781,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:28"
}