{
  "name": "Gunnar Tufte",
  "homepage": "https://www.ntnu.edu/employees/gunnar.tufte",
  "status": "success",
  "content": "Gunnar Tufte - NTNU Gunnar Tufte Download press photo Download press photo Foto: Close Gunnar Tufte Professor; Deputy Head of Department (Research); Head of the PhD Program in Computer Science Department of Computer Science Faculty of Information Technology and Electrical Engineering gunnar.tufte@ntnu.no +4773590356 +4797402478 IT-bygget, 403, Gløshaugen, Sem Sælands vei 9 SpinENGINE Energy efficient computing systems About I am part of the Computer Architecture Lab CAL)  and the Computational Magnetic Metamaterials (COMET) research group  Main interest: --- Unconventional Machines: Architecture, Design and Computation. Research: Keywords: Vast Parallel Architectures, nanosystems, Bio-Inspired Hardware and Methods, Artificial Development, Evolutionary Computation, Evolvable Hardware, Artificial Life, cellular computing, cellular automata, self-replication, reconfigurable hardware. The overal subject of computer architecture research at CAL is parallelism. Rsearch related to parallel machines and massive parallel processing. The target for our research is toward a future of massive parallelism. Topics include: computer architecture, the hardware/software interface, energy effcient computation, future materials and technology.. My  approach is toward unconventional machines. At the architecture level: vast parallel machine architectures exploring the possibility of computation from simple computing elements with only local communication. At the technology level my research intrest is toward computational materials, such as: evolving nanosystems in the NASCENCE (NAnoSCale Engineering for Novel Computation using Evolution) project,or NTNU Morphogenetic Engineering initiative. Resently I have work on nanomagnetic systems as a substrate for novel computing devices in projects funded by NFR : SOCRATES (Self-Organizing Computational substRATES) and the SPrINTER projects, and in the EU  funded FET-Open SpinENGINE project. Teaching: TDT4295 Computer Design, Project Work / Datamaskiner prosjekt TDT4160 Computers and Digital Design Avilable Master Thesis and Project. Information that may be helpful if you want one of my projects Competencies Artificial Life Artificial intelligence Bio-inspired computing Computer architecture Computer design Cyborg Dynamical systems Genetic algorithms Heterogeneous computer systems Nano systems Self-assembly processes Self-organizing systems Unkonventional computing Research The overal subject of computer architecture research at the Computing (COMP) research group is  parallelism. Rsearch related to parallel machines and massive parallel processing. The target for our research is toward a future of massive parallelism. Topics include: computer architecture, the hardware/software interface, energy effcient computation, future materials and technology.. My  approach is toward unconventional machines. At the architecture level: vast parallel machine architectures exploring the possibility of computation from simple computing elements with only local communication. At the technology level my research intrest is toward computational materials, such as: evolving nanosystems in the NASCENCE (NAnoSCale Engineering for Novel Computation using Evolution) project,or NTNU Morphogenetic Engineering initiative. Resently I have worked on nanomagnetic systems as a substrate for novel computing devices in the NFR funded SOCRATES project  and the SPrINTER projects. and in the EU  funded FET-Open SpinENGINE project. Computer Architecture Lab Energy Efficient Computing Systems (EECS) SpinENGINE The SpinENGINE project will lay the foundations for a new, massively parallel, platform based on emergent behaviour in nanomagnet ensembles. The SpinEngine project has received funding from the European Union’s Horizon 2020 FET-Open programme SPrINTER The SPrINTER project aims at creating a radically new technology for low-power spin-based computing. SPrINTER is partially funded by the Norwegian Research Council (NFR). Researcher Project for Technological Convergence under the project agreement 331821. flatspin flatspin: A Large-Scale Artificial Spin Ice Simulator. flatspin is open-source software. under under the GPLv3 license. flatspin is developed and maintained by an interdisciplinary group of researchers at NTNU. Publications 2025 Dwivedi, Saumitra; Karlsen, Anniken Susanne Thoresen; Tufte, Gunnar; Hameed, Ibrahim A.; Torres, Ricardo. (2025) Data-driven Rulesets for Soft Artificial Life: An approach to learn and model emergent dynamics. NTNU Norges teknisk-naturvitenskapelige universitet NTNU Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Bhandari, Dheerendra Singh; Strømberg, Anders; Breivik, Ida; Penty, Arthur George; Jensen, Johannes H.; Foerster, Michael. (2025) Clocking emergent magnetic monopoles in square artificial spin ice. Physical review B (PRB) Academic article Penty, Arthur George; Jensen, Johannes Høydahl; Breivik, Ida; Strømberg, Anders; Folven, Erik; Tufte, Gunnar. (2025) Controllable gliders in a nanomagnetic metamaterial. Nature Communications Academic article Penty, Arthur George; Tufte, Gunnar. (2025) Discovery of Emergent Computation in Metamaterials. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Dwivedi, Saumitra; Torres, Ricardo; Hameed, Ibrahim A.; Tufte, Gunnar; Karlsen, Anniken Susanne Thoresen. (2025) Koopman-based data-driven soft artificial life: obtaining rulesets from observed data. Natural Computing Academic article 2024 Jensen, Johannes Høydahl; Strømberg, Anders; Breivik, Ida; Penty, Arthur George; Nino, Miguel Angel; Khaliq, Muhammad Waqas. (2024) Clocked dynamics in artificial spin ice. Nature Communications Academic article Aven, Thomas; Jensen, Johannes Høydahl; Tufte, Gunnar. (2024) Lattice reservoirs: symmetry breaking and information flow in physical reservoir computing. ALIFE : Proceedings of the Artificial Life Conference Academic article 2023 Penty, Arthur George; Tufte, Gunnar. (2023) Evolving Music from a Self-Organising Nanomagnetic Orchestra. ALIFE : Proceedings of the Artificial Life Conference Academic article Penty, Arthur George; Tufte, Gunnar. (2023) Evolving Artificial Spin Ice for Robust Computation. International Journal of Unconventional Computing Academic article Filho, Sidney Pontes; Nichele, Stefano; Yazidi, Anis; Zhang, Jianhua; Hammer, Hugo Lewi; Sandvig, Ioanna. (2023) Optimization of dynamical systems towards criticality and intelligent behavior. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Penty, Arthur George; Tufte, Gunnar. (2023) Evolving Artificial Spin Ice for Robust Computation. International Journal of Unconventional Computing Academic article Heiney, Kristine; Nichele, Stefano; Sandvig, Ioanna; Tufte, Gunnar. (2023) Deciphering and emulating neuronal communication: Population-level computation from elemental interactions. NTNU NTNU Doctoral dissertation 2022 Knudsen, Martinius; Hendseth, Sverre; Tufte, Gunnar; Sandvig, Axel. (2022) Model-free Control of Partially Observable Underactuated Systems by pairing Reinforcement Learning with Delay Embeddings. MIC Journal: Modeling, Identification and Control Academic article Jensen, Johannes Høydahl; Strømberg, Anders; Lykkebø, Odd Rune Strømmen; Penty, Arthur George; Lealiaert, Jonathan; Själander, Magnus. (2022) Flatspin: A large-scale artificial spin ice simulator. Physical review B (PRB) Academic article Knudsen, August Martinius Espedal; Hendseth, Sverre; Tufte, Gunnar; Sandvig, Axel. (2022) Global asymptotic stabilization of a pendulum using a single Lyapunov proportional bang-bang control strategy. Measurement and Control Academic article 2021 Penty, Arthur George; Tufte, Gunnar. (2021) A Representation of Artificial Spin Ice for Evolutionary Search. Academic chapter/article/Conference paper Knudsen, Martinius; Hendseth, Sverre; Tufte, Gunnar; Sandvig, Axel. (2021) Model-Free All-Source-All-Destination Learning as a Model for Biological Reactive Control. MIC Journal: Modeling, Identification and Control Academic article Knudsen, Martinius; Hendseth, Sverre; Tufte, Gunnar; Sandvig, Axel. (2021) Global asymptotic stabilization of a pendulum using a single Lyapunov proportional bang-bang control strategy. Measurement and Control Academic article 2020 Jensen, Johannes Høydahl; Strømberg, Anders; Lykkebø, Odd Rune Strømmen; Penty, Arthur George; Själander, Magnus; Folven, Erik. (2020) flatspin: A Large-Scale Artificial Spin Ice Simulator. arXiv.org Academic article Pontes-Filho, Sidney; Lind, Pedro; Yazidi, Anis; Zhang, Jianhua; Hammer, Hugo Lewi; Mello, Gustavo. (2020) EvoDynamic: A Framework for the Evolution of Generally Represented Dynamical Systems and Its Application to Criticality. Academic chapter/article/Conference paper Jensen, Johannes Høydahl; Tufte, Gunnar. (2020) Reservoir Computing in Artificial Spin Ice. ALIFE : Proceedings of the Artificial Life Conference Academic article Pontes-Filho, Sidney; Lind, Pedro; Yazidi, Anis; Zhang, Jianhua; Hammer, Hugo Lewi; Mello, Gustavo. (2020) A neuro-inspired general framework for the evolution of stochastic dynamical systems: Cellular automata, random Boolean networks and echo state networks towards criticality. Cognitive Neurodynamics Academic article Jensen, Johannes H.; Folven, Erik; Tufte, Gunnar. (2020) Computation in artificial spin ice. ALIFE : Proceedings of the Artificial Life Conference Academic article Sandvig, Axel; Sandvig, Ioanna; Tufte, Gunnar; Ramstad, Ola Huse. (2020) Neural disorder at the edge of chaos. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation 2019 Pontes-Filho, Sidney; Yazidi, Anis; Zhang, Jianhua; Hammer, Hugo Lewi; Mello, Gustavo; Sandvig, Ioanna. (2019) A general representation of dynamical systems for reservoir computing. Academic chapter/article/Conference paper Knudsen, Martinius; Hen",
  "content_length": 63837,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:26"
}