{
  "name": "Gunnar Stevens",
  "homepage": "https://www.wineme.uni-siegen.de/team/stevens",
  "status": "success",
  "content": "» Univ.-Prof. Dr. Gunnar Stevens Skip to the navigation.Skip to the content. Fakultät III Wirtschaftsinformatik und Neue Medien Aktuelles Pressespiegel Veranstaltungen Sozio-Informatik-Tagung 2024 Education under Severe Pressure Digitaler Wandel und seine Auswirkungen Pre-CHI 2025 (02.04-04.04.2025) A Festschrift Event – Honoring David W. Randall Team Univ.-Prof. Dr. Volker Wulf Univ.-Prof. Dr. Gunnar Stevens Univ.-Prof.in Dr.in Claudia Müller apl. Prof. Dr. Markus Rohde Dr. Rainer Wieching, Vertretungsprofessur Prof. Dr. Dave Randall Dr. Mark Rouncefield Prof. Dr. Kjeld Schmidt Prof. Dr. Karen E. Fisher Prof. Dr. Ina Wagner Prof. Dr. Carla Simone Hon.-Prof. Dr. Peter Brödner Hon.-Prof. Dr. Roman Englert Hon.-Prof. Dr. Martin Hill Dr. Peter Tolmie Dr. Muhamed Kudic Dr. David Unbehaun Dr. Jasmin Lehmann Dr. Konstantin Aal Walter Schäfer Sven Bittenbinder Nils Böcking Clara Rosa Cardoso Dr. Felix Carros Dr. Philip Engelbutzeder Parastou Azari Yannick Bollmann Margarita Esau Parvin Ghadamighalandari Nora Hille Jacob Hochhaus Sven Hoffmann Eva Theresa Jahn Leonie Jahn Mehrbod Manavi Cornelius Neufeldt Julia Renardias Tobias Richter Dr. Sarah Rüller Philipp Rutz Roodabeh Seif Hussain Abid Syed Annelie Szameitat Jennifer Jung Nathanael Klein Ehemalige Mitarbeiter in Memoriam Projekte FOREA PiHub DCitizens – Empowering Citizens with and through Digital Technologies SEEDS ATLAS – Automotive Transformationsplattform Südwestfalen EDIH – European Digital Innovation Hub Südwestfalen KIWI@SIWI E-Vita Mittelstand-Digital Zentrum Ländliche Regionen Mittelstand 4.0-Kompetenzzentrum Siegen SFB 1187: Medien der Kooperation Access CONTACT GINA PADERO iDES kmu Locating Media HAPPIER FAB101 KontiKat Go, WannaGo! SME Gradschool YALLAH! – You all are hackers. Fab Lab Siegen come_IN GaNEsHA Projekt (2017-2020) Cognitive Village (2015-2018) GeWInN (2017-2019) EKPLO (2016-2019) SIDATE (2015–2018) Nett.Werkzeug (2016-2019) Zeit.Raum Siegen (2016-2018) my-AHA (2016-2019) Living Lab Energy (2014-2017) Cyberrüsten 4.0 (2016-2019) INNOLAB (2015-2018) TruNet (2015-2017) KOKOS (2015-2018) SmartLive (2014-2017) EmerGent (2017) AriA (2018) MobiAssist (2015-2018) TOPIC (2013-2016) SPIDER (2013-2015) S-Mobil 100 (2012-2015) Quartier (2012-2015) CUBES (2012-2015) Koordinator (2012-2014) iStoppFalls (2011-2014) INA (2011-2013) InfoStrom (2010-2013) FoSIBLE (2010-2013) RSBE (2010-2013) SocialMedia (2009-2013) INSEMTIVES (2009-2012) AMi (2009-2012) Social Display (2009-2012) Microfinance (2008-2012) Landmarke (2008-2011) ARTOS (2008-2010) SocialImpacts (2008-2009) CONTici (2007-2010) EUDISMES (2007-2010) ePet (2007-2008) Störfallkommunikation (2006-2008) ContexTV (2006-2007) Digitale Medien (2005-2006) EUD (2004-2007) WIN (2003-2006) SFB/FK 615: Medienumbrüche (2002-2008) ATELIER (2001-2004) Wisspro (2001-2003) Olvio (2000-2003) Dojyo-TANE IT-Support für Neue Soziale Bewegungen BSCWeasel Projekt Projekte vor 2002 Labs PRAXLABS come_IN Fab Lab Siegen Social Media Observatories Digital Behavioral Lab Studium und Lehre Alumni Alumni Event 2019 Alumni Veranstaltung 2018 Alumni-Portal Neuanmeldung Publikationen Alle nach Jahr Alle nach Typ A-Paper Proceedings Journal Dissertationen Ausgewählte Bücher Buchreihe Ausgewählte Abschlussarbeiten Tagungsreihen Kontakt Datenschutzerklärung Webmail Unisono Formulare Suche nach: Neueste Beiträge Ausschreibung Abschlussarbeit im Bereich Pflege, Mensch-Technik-Interaktion Erste Absolventinnen und Absolventen des Zertifikats „Barrierefrei lehren“ in Siegen WR – e-VITA-Projekt Sozio-Informatik-Tagung 2024: Transformation ländlich-industrieller Regionen im Fokus Masterarbeit ausgeschrieben: Forschungsprojekt „NA-RO – Navigations-Robotik zur Unterstützung in multi-professionellen Arbeitsprozessen“ Intern Intern Archiv Archiv Monat auswählen April 2025 Dezember 2024 November 2024 Oktober 2024 August 2024 Juli 2024 Mai 2024 Februar 2024 Januar 2024 September 2023 August 2023 April 2023 Februar 2023 November 2022 Oktober 2022 Juni 2022 Mai 2022 März 2022 Februar 2022 Januar 2022 Oktober 2021 April 2021 November 2020 Oktober 2020 Juli 2020 Juni 2020 April 2020 Februar 2020 November 2019 Oktober 2019 September 2019 Juni 2019 März 2019 Februar 2019 November 2018 September 2018 August 2018 Juni 2018 Mai 2018 März 2018 Februar 2018 Oktober 2017 August 2017 Juli 2017 Juni 2017 Mai 2017 April 2017 März 2017 Februar 2017 Januar 2017 Dezember 2016 November 2016 Oktober 2016 September 2016 Februar 2016 November 2015 Juni 2015 Oktober 2014 Mai 2014 Februar 2014 November 2013 September 2013 August 2013 Juli 2013 Juni 2012 April 2012 Dezember 2011 September 2011 Juli 2011 Februar 2011 November 2010 September 2010 Juli 2010 Juni 2010 Februar 2010 November 2009 Oktober 2009 September 2009 Mai 2009 Februar 2009 Oktober 2008 August 2008 Juli 2008 Juni 2008 Mai 2008 Februar 2008 Juni 2007 Mai 2007 November 2006 Oktober 2006 Mai 2006 März 2006 Januar 2006 Dezember 2005 Oktober 2005 Meta Anmelden Feed der Einträge Kommentar-Feed WordPress.org / cscw / home / Univ.-Prof. Dr. Gunnar Stevens Bereichsleiter IT-Sicherheit und Verbraucherinformatik Mail: gunnar.stevens(at)uni-siegen.de Raum: US-F 111 Telefon: +49 (0) 271/ 740 – 3993 Sprechstunde: Nach Vereinbarung. weitere Informationen unter www.itsec.wiwi.uni-siegen.de Publikationen 246 Einträge « ‹ 1 von 5 › » 2026 Baby, Maksuda Bilkis; Atabuzzaman, Md.; Shajalal, Md.; Stevens, GunnarAttention-Based Code Summarization for Multi-label Vulnerability Detection Proceedings Article In: Kim, Yongdae; Miyaji, Atsuko; Tibouchi, Mehdi (Hrsg.): Cryptology and Network Security, S. 425–447, Springer Nature, Singapore, 2026, ISBN: 9789819544349.Abstract | Links | BibTeX | Schlagwörter: Attention, Code Summarization, Multi-label Vulnerability Detection, Security-focused Attention@inproceedings{baby_attention-based_2026, title = {Attention-Based Code Summarization for Multi-label Vulnerability Detection}, author = {Maksuda Bilkis Baby and Md. Atabuzzaman and Md. Shajalal and Gunnar Stevens}, editor = {Yongdae Kim and Atsuko Miyaji and Mehdi Tibouchi}, doi = {10.1007/978-981-95-4434-9_20}, isbn = {9789819544349}, year = {2026}, date = {2026-01-01}, booktitle = {Cryptology and Network Security}, pages = {425\\textendash447}, publisher = {Springer Nature}, address = {Singapore}, abstract = {Vulnerabilities in source code can lead to a wide range of issues, such as privacy and security breaches, system crashes, data leaks, and unpredictable application behavior. These problems typically arise from improper handling of inputs, memory, or access control mechanisms. To address these challenges, we propose a novel Attention-based Code Summarization (ACS) approach for multi-label vulnerability detection in source code. Unlike traditional methods that are limited to binary or multi-class classification, our approach is designed to identify multiple types of vulnerabilities within a single code snippet\\textemdashan essential capability, as real-world software often contains more than one vulnerability. Our method introduces a specialized, security-focused attention mechanism that utilizes vulnerability-specific queries to generate targeted representations for each vulnerability type. By extending pre-trained code models with a hierarchical summarization framework, we enable the creation of specialized representations tailored to different vulnerability categories. This design ensures a balance between general code understanding and precise vulnerability detection. Extensive evaluations on a multi-label vulnerability dataset show that our model outperforms existing baselines, especially for buffer-related vulnerabilities (e.g., CWE-119, CWE-120) and other complex security issues. Through comprehensive ablation studies, we validate the individual contributions of each architectural component, demonstrating the synergistic effects of our vulnerability-specific attention, security-focused summarization, and adaptive gating mechanisms. Furthermore, the attention visualization component of our model provides explainable outputs, helping security teams identify and understand the root causes of detected vulnerabilities. By enabling efficient and simultaneous detection of multiple vulnerability types, our approach significantly reduces the effort and time required to analyze and secure software systems.}, keywords = {Attention, Code Summarization, Multi-label Vulnerability Detection, Security-focused Attention}, pubstate = {published}, tppubtype = {inproceedings} } SchließenVulnerabilities in source code can lead to a wide range of issues, such as privacy and security breaches, system crashes, data leaks, and unpredictable application behavior. These problems typically arise from improper handling of inputs, memory, or access control mechanisms. To address these challenges, we propose a novel Attention-based Code Summarization (ACS) approach for multi-label vulnerability detection in source code. Unlike traditional methods that are limited to binary or multi-class classification, our approach is designed to identify multiple types of vulnerabilities within a single code snippet—an essential capability, as real-world software often contains more than one vulnerability. Our method introduces a specialized, security-focused attention mechanism that utilizes vulnerability-specific queries to generate targeted representations for each vulnerability type. By extending pre-trained code models with a hierarchical summarization framework, we enable the creation of specialized representations tailored to different vulnerability categories. This design ensures a balance between general code understanding and precise vulnerability detection. Extensive evaluations on a multi-label vulnerability dataset show that our model outperforms existing baselines, especially for buffer-related vulnerabilities (e.g., CWE-119, CWE-120) and other complex security issues. Through comprehensive ablation studies, we validate the individual contributions of ea",
  "content_length": 181108,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:29"
}