{
  "name": "Gunnar Gotshalks",
  "homepage": "http://www.cse.yorku.ca/~gunnar",
  "status": "success",
  "content": "Gunnar Gotshalks — home page Dept of Electrical Engineering & Computer Science Gunnar Gotshalks Retired Last updated: 2020 July 7 \"Education: the path from cocky ignorance to miserable uncertainty\" — Mark Twain \"If you think education is expensive, try ignorance.\" — Derek Bek Research interests are in software engineering, primarily in the design and production of software development tools for individuals and small teams of people. An on-going project is the development of FlexOr Technology based on Knuth's literate programming and Gotshalks' idea of programming through the adaptation of program source text (FlexOr frames). On Ethics CIPS — Canadian Information Processing Society — L'association canadiene de l'informatique. You can find its code of ethics and professional conduct here. ACM Computing & public policy. Links to Software Engineering Code of Ethics ACM code of Ethics and Professional Practice Using the Code of Ethics Miscellaneous Education and Employment Great Rules for Writing Psalm for computer science students Examples of pitfalls in numeric computation Explore the Mandelbrot Explore Julia sets z^2+c Explore Julia sets c*sin(z) Explore Julia sets sin(z)+c Quotes Alexander Pope (1688-1744), from An Essay on Criticism, 1709 \"A little learning is a dang'rous thing; Drink deep, or taste not the Pierian spring: There shallow draughts intoxicate the brain, And drinking largely sobers us again. Fir'd at first sight with what the Muse imparts, In fearless youth we tempt the heights of Arts, While from the bounded level of our mind Short views we take, nor see the lengths behind; But more advanc'd, behold with strange surprise New distant scenes of endless science rise! So pleas'd at first the towering Alps we try, Mount o'er the vales, and seem to tread the sky, Th' eternal snows appear already past, And the first clouds and mountains seem the last; But, those attain'd, we tremble to survey The growing labours of the lengthen'd way, Th' increasing prospects tire our wand'ring eyes, Hills peep o'er hills, and Alps on Alps arise!\" \"Nothing is as simple as we hope it will be.\" — J. Horning \"Good judgment comes from experience. Experience comes from bad judgment\" — J. Horning \"The early bird may get the worm but the second mouse gets the cheese.\" — Steven Wright \"What happens if you get scared half to death twice?\" — Steven Wright \"The problem with the gene pool is that there is no lifeguard\" — Steven Wright A Programmer's Lament by Dennie L. van Tassel I really hate this damned machine; I wish that they would sell it. It never does quite what I want But only what I tell it. Old joke \"What is Matter?   Never Mind. What is Mind?   It doesn't Matter.\"",
  "content_length": 2702,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:24"
}