{
  "name": "Gunnar Hartvigsen",
  "homepage": "https://uit.no/ansatte/gunnar.hartvigsen",
  "status": "success",
  "content": "Hartvigsen, Gunnar | UiT Gunnar.hartvigsen – Institutt for informatikk | UiT Gå til hovedinnhold Enheten Ansatte Gunnar Hartvigsen Professor Institutt for informatikk gunnar.hartvigsen@uit.no +4777644049 90657785 Tromsø Her finner du meg Gunnar Hartvigsen Om Forskning og undervisning CV Her finner du meg Stillingsbeskrivelse Gunnar Hartvigsen, ph.d., har siden 1989 vært ansatt ved Universitetet i Tromsø – Norges arktiske universitet (UiT), Fakultet for naturvitenskap og teknologi, Institutt for informatikk (Ifi), først som amanuensis (1989–91), deretter som førsteamanuensis (1991–94) og fra 1994 som professor i informatikk. Hartvigsen er leder for forskningsgruppen for helseinformatikk og -teknologi (HIT) (tidligere: medisinsk informatikk og telemedisin (MI&T)) ved instituttet. Hartvigsen er også professor II/Forsker 1 ved Helgelandssykehuset HF (2023–). Han var i perioden 2000–2015 professor II ved Nasjonalt senter for samhandling og teleme­disin (NST) ved Universitets­sykehuset Nord-Norge HF (UNN). I perioden 2016–2017 var han professor II ved Nasjonalt senter for e-helseforskning ved UNN. I perioden 2018–2022 var han ansatt som professor II ved Institutt for helse- og sykepleievitenskap, Fakultet for helse- og idrettsvitenskap, Universitetet i Agder (UiA), campus Grimstad, og tilknyttet Senter for e-helse, UiA. Hartvigsen har også vært ansatt som professor II ved Høgskolen i Hedmark (1995-1998) og Høgskolen i Bodø (1998–2005). Hartvigsen var i perioden 2005–2009 prodekan for forskning og utdanning ved Det matematisk-naturvitenskapelige fakultet, UiT. Han har tidligere bl.a. vært instituttleder, instituttnestleder og undervisningsleder ved Institutt for informatikk, UiT. Hartvigsen har omfattende administrativ erfaring fra UiT som leder for en rekke råd og utvalg. I 2004–2006 var han leder for Nasjonalt fagråd for informatikk. I årene 2010–2017 var han medlem av Nasjonal forskningsetisk komite for naturvitenskap og teknologi (NENT). Hartvigsen var fra 2007 til 2015 senterleder for Tromsø Telemedicine Laboratory (TTL), ett av Norges 14 første sentre for forskningsdrevet innovasjon (SFI). I perioden 2024-2025 er han medlem i Kunnskapsdepartementets kompetansebehovsutvalg.Hartvigsen har veiledet 96 mastergrads- og 18 doktorgradsstudenter. Han er for tiden veileder for 4 doktorgrads- og 7 mastergradsstudenter. Han har videre veiledet 7 postdoktorer (ved UNN). Hartvigsen er for tiden mentor for to førsteamanuenser ved UiT. Han har tidligere vært mentor for fire førsteamanuenser tilknyttet UiTs opprykksprogram for kvinner, en universitetslektor, en førstelektor og seks førsteamanuenser ved UiA, og en førsteamanuensis ved Høgskolen i Østfold. Siden 1992 har han vært medlem av over 100 bedømmelseskomiteer for vitenskapelige stillinger i inn- og utland (Norge, Sverige, Danmark, Finland, Nederland, Tyskland, Canada og USA). Han har vært referee for flere internasjonale konferanser og tidsskrifter. Hartvigsen har videre vært medlem av flere doktorgradskomiteer i Norge, Sverige, Danmark og Nederland. Han har deltatt i flere internasjonale ekspertpaneler for vurdering av store søknader med budsjetter på opp mot 500 mill. NOK i Sverige (VINNOVA) og Finland (Academy of Finland og TEKES), bl.a. i 2016 som medlem av et internasjonalt generalistpanel for vurdering av nye kompetansesenter i Sverige (tilsvarende den norske SFI-ordningen i NFR). I 2020 var Hartvigsen medlem av internasjonalt evalueringspanel for Horizon 2020 (innovative medicines initiative og for Health Sciences). Hartvigsen har omfattende undervisningserfaring fra BSc, MSc og ph.d. nivå. Han har de siste 20 år bl.a. undervist følgende emner: Telemedicine and e-health systems, Advance telemedicine and e-health systems, Medical informatics, Electronic health records, User interface design, Management Informa­tion Systems, Visual programming, Educational software, Introduction to computer science, Compu­ter graphics, Software engineering, Operating systems, Distributed operating system og Communica­ting research (for ph.d. studenter i naturvitenskap og teknologi). Hartvigsen har også utstrakt erfaring fra studieadministrasjon fra flere læresteder og har utarbeidet og ledet flere studieprogrammer og emner (kurs).Hartvigsen ble i 2021 tildelt NOK 6,3 mill. Fra DIKU (Direktoratet for internasjonalisering og kvalitetsutvikling i høgare utdanning) for å etablere en erfaringsbasert master i digitale helsetjenester sammen med helsetjenesten i region Helgeland.Hartvigsen har mottatt en rekke forskningsbevilgninger (grants) fra Norges forskningsråd (Tromsø Te­lemedicine Laboratory NOK 80 mill. 2007–2014 (+ 160 mill. fra partnere); Context-sensitive systems for mobile communication in hospitals NOK 4,4 mill. 2007–2010; Global Distributed Diary NOK 3,3 mill. 1996–2001; DiPato – Distributed Electronic Patient Record NOK 1,1 mill. 2000–2004), Helse Nord (Smartphones in Type-2 Diabetes Group Education Programs, NOK 2,8 mill. 2014–2017; Moving pre-surgical planning from the hospital to the patient at home through electronic collaboration (eTeam-Surgery) NOK 8,1 mill. 2013–2016; Impact of Experience Sharing on Type 2 Diabetes Self-Management NOK 2,5 mill. 2011–2013; Self-help through a mobile ICT tool NOK 2 mill. 2005–2008), Tromsø forskningsstiftelse (Mobile phone-based health information for people with diabetes, NOK 1,2 mill., 2011–2014), Regionalt Forskningsfond Fondsregion Nord-Norge (CADMOS, NOK 3 mill, 2014–2016). Horizon 2020 (WARIFA 2021-2024, EURO 710.000). Ved UNN har Hartvigsen bidratt til flere EU prosjekter (Renewing Health 2010–2013, FI-STAR 2013–2015 og HEIR 2020-2023). Hans forskningsinteresser inkluderer ulike aspekter av m-helse, e-helse, telemedisin og medisinsk informatikk, spesielt elektronisk helseovervåkning, selvhjelpssystemer for personer med kroniske lidelser, sosiale media og seriøse spill for personer med kroniske lidelser, medisinske sensorsystemer, menneske-maskin interaksjon (“HCI”) for mobile systemer, tele­medisinske sys­temer for private hjem, motivasjons-mekanismer innen e-helse, medisinsk avstandsoppfølging, sensorutstyr for fysisk aktivitet, m-helse applikasjoner for personer med kognitiv funksjonsnedsettelse, digital kommunikasjon med pasienter og kontekst-sensitiv kommunikasjon. Hartvigsen har hatt flere lengre forskningsopphold (“sabbatical leave”) ved utenlandske universiteter: Faculty of Computer Science, University of Twente, the Netherlands (høst 1994 – vår 1995), Faculty of Medicine, Munich University of Technology (høst 2006), Department of Health Science and Technology, Aalborg University, Denmark (2 uker høsten 2006 og 4 uker i juni 2022), ITACA, Technical University of Valencia (juli 2011), Center for Health and Technology, University of California Davis / UC Davis (september–desember 2011 og april–juli 2012), Technical University of Valencia (høst 2017 – vår 2018) og Health Informatics Centre, Karolinska Institutet, Stockholm (høst 2021 – vår 2022).Hartvigsen har en omfattende vitenskapelig produksjon. Han har skrevet tre bøker: “Forskerhåndboken” (utgitt på Høyskoleforlaget), “Informatikk og etikk” (med Dag Johansen og Atle Måseide, utgitt på Fagbokforlaget) og “Lessons learned from 25 years with telemedicine in Northern Norway” (med Steinar Pedersen, boken er skrevet på engelsk og ble også oversatt til russisk i november 2016), og publisert vel 400 vitenska­pelige arbeider om sosiale media, social computer games, smarthusteknologi, elektroniske pasientjournaler, elektronisk helseovervåkning og telemedisinske systemer, distribuerte applikasjoner, adaptive brukergrensesnitt, filsystemer, undervisningsrelatert programvare, kunnskapsbaserte systemer, mobile agenter, dokument teori/modeller og etikk. Hartvigsen er registeret med over 1000 bidrag i publikasjonsdatabasen Cristin.Hartvigsen har etablert omfattende samarbeid med flere av verdens fremste miljøer innen medisinsk informatikk, noe som har resultert i felles publikasjoner med over 150 forskere ved bl.a. University of Washington, Seattle, USA; Illinois Institute of Technology, Chicago, USA; University of California, Davis, USA; University of Texas Health Science Center, Houston, USA; Columbia University, New York, USA; Johns Hopkins University, Baltimore, USA; Technische Universität München, Tyskland; Technical University of Valencia, Spania; University of Geneva, Sveits; Aalborg Universitet, Danmark; og, Karolinska Institutet, Sverige. Hartvigsen har vært medlem av Academia Borealis, Nord-Norges Vitenskapsakademi, siden akademiet ble grunnlagt i 2001. Han ble i 2016 innvalgt som medlem i NTVA, Norges Tekniske Vitenskapsakademi. Hartvigsen ble i 2024 utnevnt til fellow i The Asia-Pacific Artificial Intelligence Association (AAIA)for sitt arbeid med telemedisin og medisinsk informatikk.I 2014 ble han tildelt Forskerforbundets Hjernekraftpris for sitt bidrag innen selvhjelpssystemer for behandling av personer med diabetes. Hartvigsen er omtalt i “Biographical Lexicon of Medical Informatics” (2015) og listet i “Who's Who in Ethics” (Global Ethics Observatory, unesco.org).Han har vært invitert som foredragsholder om telemedisin og e-helse i flere land, inkludert Norge, Sverige, Danmark, Grønland, Tyskland, Frankrike, England, Spania, Italia, Polen, Russland, Tsjekkia, USA og Australia.Hans h-indeks = 37 ifølge Google Scholar, i10-indeks = 89 og hans publikasjoner er gjenstand for over 6400 siteringer, herav over 3100 siden 2020. Arbeider i Cristin Vitenskapelige artikler og bokkapitler Andre Tina Rishaug, Anne-Marie Aas, André Henriksen, Gunnar Hartvigsen, Kåre Inge Birkeland, Eirik Årsand : What are end-users’ needs and preferences for a comprehensive e-health program for type 2 diabetes? – A qualitative user preference study PLOS ONE 2025 DOI / ARKIV André Henriksen, Antonio Martinez Millana, Alejandro Gomez-Noe, Gunnar Hartvigsen, Audny Gabriele Wagner Anke, Magnus Stellander m.fl.: Piloting an Augmented Reality Exergame for Persons with Intellectual Disabilities Studies in ",
  "content_length": 20468,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:26"
}