{
  "name": "Gunter Saake",
  "homepage": "http://www.dbse.ovgu.de",
  "status": "success",
  "content": "Arbeitsgruppe Datenbanken und Software Engineering - Arbeitsgruppe Datenbanken und Software Engineering Arbeitsgruppe Datenbanken und Software Engineering Forschungsschwerpunkte Die Forschung der Arbeitsgruppe richtet sich an den zwei Themengebieten Datenbanken und Software Engineering sowie der Ausnutzung der Synergien beider Gebiete aus. Zu den Schwerpunkten in der Forschung gehören unter anderem: Datenmanagement auf neuer Hardware Datenmanagement in der Cloud Analyse von Metaproteomdaten Maßgeschneiderte Datenhaltung Automatisierte Analysen variabler Softwaresysteme Adaptive Informationssysteme Vor dem Hintergrund der Möglichkeiten moderner Hardware erforschen wir Lösungen im Kontext von hybrid-transaktionalen und analytischen Anfrageverarbeitungen (HTAP). Zu diesen Lösungen gehören zahlreiche Prototypen und hardware-sensitive Daten- und Indexstrukturen, wie der von uns entwickelte Elf-Index. Darüber hinaus erweitern wir Datenbank-Architekturkonzepte für neue Anwendungsgebiete im Rahmen des DFG-Schwerpunktprogramms, um systemseitig eine native Plug'n'Play Unterstützung für heterogene Prozessoren zu ermöglichen (Project Adamant). Im Bereich Software Engineering erforscht die Arbeitsgruppe Techniken zur automatisierten Analyse von Software-Produktlinien. Zur Unterstützung der Forschung entwickeln wir FeatureIDE, ein Eclipse-Plugin zur Entwicklungsunterstützung von Software-Produktlinien. Unsere Forschung fokussiert sich dabei auf automatisierte Analysen der Variabilität in solchen Software-Produktlinien. Lehrangebot Das Lehrangebot der Arbeitsgruppe Datenbanken und Software Engineering ist vielseitig in den Bachelor- und Master-Studiengängen vertreten. Dabei werden die Grundlagen von Datenbanken schon in den frühen Semestern des Bachelors in den Lehrveranstaltungen Datenbanken I und Datenbanken II - Implementierungstechniken eingeführt. Weiterführende Konzepte der Datenhaltung werden dann im Masterstudium u.a. in den Vorlesungen Advanced Database Models, Distributed Data Management, Data-Warehouse Technologies sowie Transaction Processing behandelt. Neueste wissenschaftliche Erkenntnisse im Bereich Datenbanken werden in der Master-Veranstaltung Advanced Topics in Databases vorgestellt. Diverse Teamprojekte ermöglichen das direkte Mitwirken der Studenten an aktuellen Projekten. Teamprojekte werden über das ganze Studium hinweg angeboten. Bei den Teamprojekten bietet sich die Möglichkeit, an aktuellen Themen im Bereich von AI-unterstützten Datenbanken oder der Indexstruktur Elf mitzuarbeiten oder auch wichtige Neuerungen für die Entwicklungsumgebung FeatureIDE beizutragen. Zur Einführung der verwendeten Programmierparadigmen von Software-Produktlinien bietet die Arbeitsgruppe die Veranstaltung Implementierungstechniken für Software-Produktlinien für interessierte Bachelor- und Masterstudenten an. Studiengänge Ingenieurinformatik Digital Engineering Letzte Änderung: 08.09.2023 - Ansprechpartner:",
  "content_length": 2946,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:27"
}