{
  "name": "Gunwoong Park",
  "homepage": "https://sites.google.com/view/gwpark/people",
  "status": "success",
  "content": "Data Science & Machine Learning Lab - PeopleSearch this siteEmbedded FilesSkip to main contentSkip to navigationProfessorGunwoong Park / 박건웅 AffiliationsAssociate Professor, Department of Statistics at  Seoul National University, 2024.03 - PresentDirector, Institute for Data Innovation in Science, Data Discovery Center, 2024.03 - PresentAdjunct Professor, Interdisciplinary Program in Artificial Intelligence at Seoul National University, 2022.04- PresentAssstant Professor, Department of Statistics at  Seoul National University, 2022.03 - 2024.02Assistant Professor, University of Seoul, 2018.03 - 2022.02Post-doc Fellow, University of Michigan - Ann Arbor, 2016.09 - 2018.02 (Advisors: Liza Levina and Ji Zhu)EducationPh.D in Statistics, University of Wisconsin - Madison, 2011.09 - 2016.08 (Advisor: Garvesh Raskutti)B.S in Statistics, Seoul National University, 2003.03 - 2011.02Research Interests Machine Learning and Artificial Intelligence: Research on applying statistical methods to machine learning, deep learning, and artificial intelligence, including interpretation and reliability analysis of AI models.Big Data Analysis and Predictive Modeling: Research on statistical analysis and predictive modeling using large-scale data from various fields, including preprocessing, model selection, and evaluation of big data.Experimental Design and Statistical Experimental Analysis: Research on statistical experimental design and analysis, including effective experimental planning, analysis, and interpretation of experimental data.Applied Statistics: Research on applying statistics to various fields such as healthcare, finance, and public policy, focusing on statistical approaches and analysis.Contractgw.park23 (at) gmail (dot) com / gwpark23 (at) snu (dot) ac (dot) kr / gwpark23 (at) ucsb (dot) eduPost.Doc남승찬 (Post.Doc., 2025-Present)박수진 (Post.Doc., 2025-Present) Ph.D. Donguk Shin/신동욱 (Ph.D., 2024 - Present)Dong Uk is interested in topics related to Directed acyclic graphical (DAG) models, especially in structure learning algorithms. He received his M.S. degree from Seoul National University in 2024 and his B.A. degree in Applied Statistics from Chung-Ang University in 2021. Research Topic: Forward Learning of Linear SEMsOptimal Estimation of Linear SEMsNon-Gaussian Anchored Model LearningMeasurement Error Variance EstimationConstraint Cholesky DecompositionContract: dushin 9980 at gmail dot com Sunmin Oh/오선민 (Ph.D., 2024 - Present)Sunmin is interested in machine learning and deep neural network, including both theoretical elements and algorithms. She completed B.S. in Statistics and Financial Mathematics at Seoul National University in 2022. She received her M.S. degree from Seoul National University in 2024 Research Topic: Bayesian Approach for Bayesian Network Estimation Optimal Estimation of Linear SEMs Optimal Learning of LINGAMsSparse Cholesky DecompositionContract: sunmin 01111 at gmail dot com Byeongguk Kang/강병국 (M.S.-Ph.D., 2023 - Present)Byeong Guk is interested in probabilistic graphical models and statistical machine learning, including both theories and algorithms. He received B.A. degree in Law from Korean National Police University in 2021.Research Topic: Incomplete Data AnalysisHigh-dimensional DAG Learning from Contaminated DataContract: kk 9983612 at gmail dot comM.S. (-Ph.D combined)Junhyoung Chung/정준형 (M.S., 2024 - Present):Junhyoung is interested in machine learning and probabilistic graphical models,  including theories and applications. He receives B.A. in Economics and B.S. in Statistics from Seoul National University in 2024.Research Topic : Learning to Rank ApproachesMountain Accident PredictionEstimation of DAG with Measurement ErrorsNon-Gaussian Anchored Model LearningContract : junhyoung 0534 at gmail dot com,  justin 9991 at snu dot ac dot krJaehoon Choi/최재훈 (M.S., 2024 - Present):Jaehoon is interested in machine learning and probabilistic graphical models, including theories and applications in time series data. He receives B.S. in Statistics from Seoul National University in 2024.Research Topic: Prediction of Mountain Rescue Team Arrival Order High-dimensional Poissonian-Gaussian Linear SEM LearningContract : james784669 at gmail dot com,  james7846 at snu dot ac dot krEuijong Song/송의종(M.S.-Ph.D, 2024 - Present)Euijong is interested in utilizing DAG models for causal inference, with a particular focus on research involving omics data. He holds a B.A. degree in Biology from Konkuk University, which he obtained in 2024. Research Topic : Prediction of Mountain Rescue Team Arrival OrderHigh-dimensional Robust Linear SEM LearningContract(Contact) : brejsong at snu dot ac dot krSeunghwan Noh/노승환(M.S., 2024 - Present)Seunghwan is interested in probabilistic graphical models, including both theories and applications. He received B.A. in Economics and B.S. in Statistics from Seoul National University in 2024.Research Topic : Measurement Error Variance EstimationContact : swannoh905 at gmail dot com, swannoh at snu dot ac dot kr 5. 이대훈(M.S., 2025 - Present)B.S.박혜원 (2025 - Present)Research TopicHigh-dimensional Robust Linear SEM LearningContact : at gmail dot com, at snu dot ac dot krIntern: positions will be available starting Spring and Summer 2026. Alumni박혜원 (B.S. Intern, 2025 Summer)  [서울대학교 통계학과 석사진학]정상훈, Sanghun Jeong (Post Doc., 2025 - 2025) jsund110 at gmail dot com  [국립창원대학교 교수]박웅준, Woongjoon Park (M.S., 2023 - 2025) statwj 95  at snu dot ac안영민, Youngmin Ahn  (M.S. 2023 - 2025) minin 4915 at gmail dot com [서울대학교 통계학과 박사진학]박유하, Yuha Park (Post-doc, 2024-2025) 이동현 (B.S. Intern, 2024 Summer) sasasnu 2019 snu ac kr [서울대학교 통계학과 석사진학]한승수 (B.S. Intern, 2024 Summer & Fall) gkstmtm snu ac kr이성진 (B.S. Intern, 2024 Summer) jin 5740782 snu ac kr이지윤 (B.S. Intern, 2024 Summer) clamb 36 snu ac kr신준호, Joonho Shin (Post-doc, 2023-2024) junoshinn at gmail dot com [성신여자대학교 교수]황세용, Seyong Hwang (MS, 2023-2024): seyong 981121 at gmail dot com [통계학과 박사진학]정준형, JunHyoung Chung  (B.S. Intern, 2023 Summer/Winter): junhyoung 0534 at gmail dot com  [서울대학교 통계학과 석사진학]김수현, Sue Hyun Kim (B.S. Intern, 2023 Summer): suehyun kim at snu dot ac dot kr  [서울대학교 통계학과 석사진학]김재홍, Jaehong Kim (B.S. Intern, 2023 Summer): jhk 0502 at snu dot ac dot kr [해외 박사진학]최재훈(B.S. Intern, 2022 Winter): james 7846 at snu dot ac dot kr  [서울대학교 통계학과 석사진학]정영철(M.S. Intern, 2022 - 2023)최세민, Semin Choi (Post-doc, 2020-2022): semin 90 at gmail dot com [방송통신대학교 교수]Junho Cheon (M.S., 2020-2023, University of Seoul): cjhnono1 at gmail dot comBoyeon Hwang (M.S., 2020-2023, University of Seoul): moon080000 at gmail dot comSion Park (M.S., 2018-2022, University of Seoul): rockgoat95 at gmail dot com [넥슨]Yesool Kim (M.S.,  2019-2022, University of Seoul): yesool0520 at gmail dot com Jaemin Lee (M.S.,  2020-2022, University of Seoul): leejm92 at naver dot com  [삼성전자]Younghwan Kim (M.S.,  2018-2020, University of Seoul): imericsun at gmail dot com [JMP Korea]Bohyeon Park (M.S., 2018-2020, University of Seoul): bohyppo at naver dot comHyewon Park (M.S.,  2018-2019, University of Seoul):  sdtrd011 at gmail dot com [KB 국민은행]Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 7147,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:26"
}