{
  "name": "Guocheng Liao",
  "homepage": "https://liaogch.github.io",
  "status": "success",
  "content": "Guocheng Liao's Homepage Guocheng Liao Home Research Interests Publications Guocheng Liao (廖国成) Assistant Professor School of Software Engineering Sun Yat-sen University liaogch6@mail.sysu.edu.cn Assistant Professor (2021/07~Present) School of Software Engineering Sun Yat-sen University, Zhuhai Ph.D. (2016/08~2021/04) Supervisor: Prof. Jianwei Huang Department of Information Engineering The Chinese University of Hong Kong, Hong Kong Visiting Student Researcher (2019/09~2020/02) Advisor: Prof. Adam Wierman Department of Computing and Mathematical Sciences California Institute of Technology, Pasadena, USA B.E. (2012/08~2016/06) School of Electronic and Information Technology Sun Yat-sen University, Guangzhou Research Interests Data privacy: differential privacy, privacy-preserving data acquisition and analysis Crowd computing: federated learning, edge computing, Internet of Things Network economics: network optimization, game theory, mechanism design In general, I am interested in developing novel mathematical models in optimization, learning, and game theory to study networked systems such as edge computing systems, crowd-intelligent systems, and Internet of Things. Publications Conference papers Zejian Chen, Guocheng Liao*, Qian Ma, and Xu Chen, \"Adaptive Privacy Budget Allocation in Federated Learning: A Multi-Agent Reinforcement Learning Approach,\" IEEE International Conference on Communications (ICC), 2024. Peng Sun, Xu Chen, Guocheng Liao, and Jianwei Huang, \"A Profit-Maximizing Model Marketplace with Differentially Private Federated Learning,\" IEEE International Conference on Computer Communications (INFOCOM), 2022. Guocheng Liao^, Yu Su^, Juba Ziani, Adam Wierman, and Jianwei Huang (^ equal contributions), \"The Privacy Paradox and Optimal Bias-Variance Trade-offs in Data Acquisition,\" ACM Conference on Economics and Computation (EC), 2021. Guocheng Liao, Xu Chen, and Jianwei Huang, \"Privacy Policy in Online Social Network with Targeted Advertising Business,\" IEEE International Conference on Computer Communications (INFOCOM), 2020. Guocheng Liao, Xu Chen, and Jianwei Huang, \"Social-Aware Privacy-Preserving Correlated Data Collection,\" ACM International Symposium on Mobile Ad Hoc Networking and Computing (MobiHoc), 2018. Guocheng Liao, Xu Chen, and Jianwei Huang, \"Optimal Privacy-Preserving Data Collection: A Prospect Theory Perspective,\" IEEE Global Communications Conference (GLOBECOM), 2017 (IEEE Communication Society Young Professional Best Paper Award). Journal papers Peng Sun, Guocheng Liao, Jianwei Huang, Xiang Li, Yuwei Wang, and Xu Chen \"Socially Optimal Mechanism Design for Relay-assisted Asynchronous Federated Learning,\" IEEE Journal on Selected Areas in Communications (JSAC), 2025. Yanling Qin, Xiangping Zheng, Qian Ma, Guocheng Liao, Xu Chen \"Participation-Dependent Privacy Preservation in Cross-Silo Federated Learning,\" IEEE Transactions on Services Computing (TSC), vol. 18, no. 1, pp. 342 - 356, Jan.-Feb. 2025. Guocheng Liao^, Bing Luo^, Yutong Feng, Meng Zhang, and Xu Chen (^ equal contributions), \"Optimal Mechanism Design for Heterogeneous Client Sampling in Federated Learning,\" IEEE Transactions on Mobile Computing (TMC), vol. 23, no. 11, pp. 10598 - 10609, November 2024. Rui Li, Tao Ouyang, Liekang Zeng, Guocheng Liao, Zhi Zhou, Xu Chen, \"Online Optimization of DNN Inference Network Utility in Collaborative Edge Computing,\" IEEE/ACM Transactions on Networking (ToN), vol. 32, no. 5, pp. 4414 - 4426, October 2024. Wuxing Mao, Qian Ma, Guocheng Liao, and Xu Chen, \"Game Analysis and Incentive Mechanism Design for Differentially Private Cross-silo Federated Learning,\" IEEE Transactions on Mobile Computing (TMC), vol. 23, no. 10, pp. 9337 - 9351, October 2024. Peng Sun, Guocheng Liao, Xu Chen, and Jianwei Huang, \"A Socially Optimal Data Marketplace with Differentially Private Federated Learning,\" IEEE/ACM Transactions on Networking (ToN), vol. 32, no. 3, pp. 2221 - 2236, June 2024. Kean Ren, Guocheng Liao*, Qian Ma, and Xu Chen, \"Differentially Private Auction Design for Federated Learning with non-IID Data,\" IEEE Transactions on Services Computing (TSC),vol. 17, no. 5, pp. 2236 - 2247, Sept.-Oct. 2024. Guocheng Liao^, Yu Su^, Juba Ziani, Adam Wierman, and Jianwei Huang (^ equal contributions), \"The Privacy Paradox and Optimal Bias-Variance Trade-offs in Data Acquisition,\" Mathematics of Operations Research (MOOR), vol. 49, no. 4, pp. 2749-2767, 2024. Jingyi Li, Guocheng Liao, Lin Chen, and Xu Chen, \"Roulette: A Semantic Privacy-Preserving Device-Edge Collaborative Inference Framework for Deep Learning Classification Tasks,\" IEEE Transactions on Mobile Computing (TMC), vol. 23, no. 5, pp. 5494 - 5510, May 2024. Guocheng Liao, Xu Chen, and Jianwei Huang, \"Privacy Protection under Incomplete Social and Data Correlation Information,\" IEEE/ACM Transactions on Networking (ToN), vol. 31, no. 6, pp.2515 - 2528, December 2023. Pu Wang, Tao Ouyang, Guocheng Liao, Jie Gong, Shuai Yu, and Xu Chen, \"Edge intelligence in motion: Mobility-aware dynamic DNN inference service migration with downtime in mobile edge computing,\" Journal of Systems Architecture, vol.130, September 2022. Guocheng Liao, Xu Chen, and Jianwei Huang, \"Privacy-Aware Online Social Networking with Targeted Advertisement,\" IEEE/ACM Transactions on Networking (ToN), vol.30, no.3, pp.1312 - 1327, June 2022. Guocheng Liao, Xu Chen, and Jianwei Huang, \"Social-Aware Privacy-Preserving Mechanism for Correlated Data,\" IEEE/ACM Transactions on Networking (ToN), vol.28, no.4, pp.1671-1683, August 2020. Guocheng Liao, Xu Chen, and Jianwei Huang, \"Prospect Theoretic Analysis of Privacy-Preserving Mechanism,\" IEEE/ACM Transactions on Networking (ToN), vol.28, no.1, pp.71-83, February 2020. Page generated 2021",
  "content_length": 5776,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:28"
}