{
  "name": "Guofei Gu",
  "homepage": "http://faculty.cs.tamu.edu/guofei",
  "status": "success",
  "content": "Welcome to Guofei Gu's Homepage Guofei Gu Eppright Professor in Engineering Presidential Impact Fellow Department of Computer Science & Engineering Texas A&M University Office: Peterson 239 Phone: (979) 845-2475 Email: guofei [AT] cse.tamu.edu I am a professor and holder of the Eppright Professorship in Engineering in the Department of Computer Science & Engineering at Texas A&M University. Before joining Texas A&M, I received my Ph.D. degree in Computer Science from the College of Computing, Georgia Tech, in 2008. I am an IEEE Fellow and an ACM Distinguished Member. I'm currently directing the SUCCESS (Secure Communication and Computer Systems) Lab at TAMU. A short bio is available here. Find out what's here. Research Overview (SUCCESS Lab Page) I'm interested in all aspects of network and system security. At SUCCESS Lab, we are pioneering the future of cybersecurity by making security programmable, intelligent, and ubiquitous. Our current specific research interests include: ( more details at lab research page) Programmable Security Software-defined next-generation networks and systems (e.g., SDN, NFV, Cloud, Edge, 5G, ...) Intelligent Security AI for Cybersecurity Security for AI Ubiquitous Security Emerging technologies (e.g., Mobile, IoT, Web, and Web3) Research data/tool release I am maintaining a list of computer security conference ranking and statistic Some useful resources, links Major Awards/Honors IEEE Fellow, for contributions to malware detection and security of next-generation networks, class of 2020 ACM Distinguished Member, for outstanding scientific contributions to computing, 2019 Google Faculty Research Award, 2014 AFOSR Young Investigator Award, 2013 NSF CAREER Award, 2010 Test-of-Time and Best Paper Award Test of Time Award, DSN 2025 (our DSN'15 FloodGuard paper) Test of Time Award, ACSAC 2023 (our ACSAC'07 Botnet Structures paper) Best Paper Award, ASIACCS'22, 2022 Best Paper Award, ICDCS'15, 2015 Best Student Paper Award, IEEE S&P'10, 2010 Finalist (top 10) for CSAW 2016 Best Applied Security Paper award (our PBS paper), 2016 Finalist (top 10) for CSAW 2015 Best Applied Security Paper award (our AutoProbe paper), 2015 Finalist (top 10) for CSAW 2013 Best Applied Security Paper award (our FRESCO paper), 2013 University Awards TEES Faculty Fellow Award, TAMU, 2023 Engineering Genesis Award, TAMU, 2023 Eppright Professorship in Engineering, TAMU, 2020 William O. and Montine P. Head Memorial Award for contributions to engineering, TAMU, 2020 Lynn '84 and Bill Crane '83 Faculty Fellow, 2019 Texas A&M Presidential Impact Fellow, 2019 TEES Faculty Fellow Award, 2019 TEES Research Impact Award, 2018 Texas A&M Dean of Engineering Excellence Award, 2018 Charles H. Barclay Jr. '45 Faculty Fellow Award, 2017 Selected Publications (Full list here, or DBLP, or Google Scholar: 20,000+ citations as of March 2025) Jianwei Huang, Sridatta Chintapalli, Mengxiao Wang, Guofei Gu. \"Beyond Visual Confusion: Understanding How Inconsistencies in ENS Normalization Facilitate Homoglyph Attacks. \" In Proc. of the 2025 ACM Web Conference (WWW'25), 2025. Huancheng Zhou and Guofei Gu. \"Cerberus: Enabling Efficient and Effective In-Network Monitoring on Programmable Switches.\" In Proc. of the 45th IEEE Symposium on Security and Privacy (S&P'24), May 2024. [pdf] [bib] (Release info) Xuanbo Huang, Kaiping Xue, Lutong Chen, Mingrui Ai, Huancheng Zhou, Bo Luo, Guofei Gu, Qibin Sun. \"You Can Obfuscate, but You Cannot Hide: CrossPoint Attacks against Network Topology Obfuscation. \" In Proc. of the 33rd USENIX Security Symposium (Security'24), Philadelphia, USA, August 2024. [pdf] [bib] Huancheng Zhou, Sungmin Hong, Yangyang Liu, Xiapu Luo, Weichao Li, Guofei Gu. \"Mew: Enabling Large-Scale and Dynamic Link-Flooding Defenses on Programmable Switches.\" In Proc. of the 44th IEEE Symposium on Security and Privacy (S&P\"23), May 2023. [pdf] [bib] (Release info) Phakpoom Chinprutthiwong, Jianwei Huang, Guofei Gu. \"SWAPP: A New Programmable Playground for Web Application Security.\" In Proc. of the 31th USENIX Security Symposium (Security\"22), Boston, USA, August 2022. [pdf] [bib] (Release info) Hongda Li, Qiqing Huang, Fei Ding, Hongxin Hu, Long Cheng, Guofei Gu, Ziming Zhao. \"Understanding and Detecting Remote Infection on Linux-based IoT Devices.\" In Proceedings of 2022 ACM ASIA Conference on Computer and Communications Security (ASIACCS\"22), Japan, June 2022. (Acceptance rate 18.4% =54/294) (Best Paper Award!) [pdf] [bib] Lei Xue, Yangyang Liu, Tianqi LI, Kaifa Zhao, Jianfeng Li, Le Yu, Xiapu Luo, Yajin Zhou, Guofei Gu. \"SAID: State-aware Defense Against Injection Attacks on In-vehicle Network. \" In Proc. of the 31th USENIX Security Symposium (Security\"22), Boston, USA, August 2022. [pdf] [bib] Le Yu, Y. Liu, P. Jing, X. Luo, L. Xue, K. Zhao, Y. Zhou, T. Wang, G. Gu, S. Nie, and S. Wu. \"Towards Automatically Reverse Engineering Vehicle Diagnostic Protocols.\" In Proc. of the 31th USENIX Security Symposium (Security\"22), Boston, USA, August 2022. [pdf] [bib] Feng Xiao, Jianwei Huang, Yichang Xiong, Guangliang, Hong Hu, Guofei Gu, Wenke Lee. \"Abusing Hidden Properties to Attack the Node.js Ecosystem. \" In Proc. of the 30th USENIX Security Symposium (Security\"21), Vancouver, Canada, August 11-13, 2021. [pdf] [bib] (Release info) Lei Xue, Hao Zhou, Xiapu Luo, Yajin Zhou, Yang Shi, Guofei Gu, Fengwei Zhang, Man Ho Au. \"Happer: Unpacking Android Apps via a Hardware-Assisted Approach. \" In Proc. of the 42nd IEEE Symposium on Security and Privacy (S&P\"21), May 2021. [pdf] [bib] Feng Xiao, Jinquan Zhang, Jianwei Huang, Guofei Gu, Dinghao Wu, Peng Liu. \"Unexpected Data Dependency Creation and Chaining: A New Attack to SDN.\" In Proc. of the 41st IEEE Symposium on Security and Privacy (S&P\"20), San Francisco, CA, May 2020. [pdf] [bib] (Release info) Ting Chen, Rong Cao, Ting Li, Xiapu Luo, Guofei Gu, Yufei Zhang, Zhou Liao, Hang Zhu, Gang Chen, Zheyuan He, Yuxing Tang, Xiaodong Lin, Xiaosong Zhang. \"SODA: A Generic Online Detection Framework for Smart Contracts.\" In Proc. of the Network and Distributed System Security Symposium (NDSS'20), San Diego, California, Feb. 2020. [pdf] [bib] (Release info) Menghao Zhang, Guanyu Li, Shicheng Wang, Chang Liu, Ang Chen, Hongxin Hu, Guofei Gu, Qi Li, Mingwei Xu, and Jianping Wu. \"Poseidon: Mitigating Volumetric DDoS Attacks with Programmable Switches.\" In Proc. of the Network and Distributed System Security Symposium (NDSS'20), San Diego, California, Feb. 2020. [pdf] [bib] Jiahao Cao, Renjie Xie, Kun Sun, Qi Li, Guofei Gu, Mingwei Xu. \"When Match Fields Do Not Need to Match: Buffered Packets Hijacking in SDN.\" In Proc. of the Network and Distributed System Security Symposium (NDSS'20), San Diego, California, Feb. 2020. [pdf] [bib] Guangliang Yang, Jeff Huang, Guofei Gu. \"Iframes/Popups Are Dangerous in Mobile WebView: Studying and Mitigating Differential Context Vulnerabilities.\" In Proc. of the 28th USENIX Security Symposium (Security'19), Santa Clara, CA, August 2019. [pdf] [bib] Jiahao Cao, Qi Li, Renjie Xie, Kun Sun, Guofei Gu, Mingwei Xu, and Yuan Yang. \"The CrossPath Attack: Disrupting the SDN Control Channel via Shared Links\". In Proc. of the 28th USENIX Security Symposium (Security'19), Santa Clara, CA, August 2019. [pdf] [bib] Yangyong Zhang, Lei Xu, Abner Mendoza, Guangliang Yang, Phakpoom Chinprutthiwong, Guofei Gu. \"Life after Speech Recognition: Fuzzing Semantic Misinterpretation for Voice Assistant Applications.\" In Proc. of the Network and Distributed System Security Symposium (NDSS'19), San Diego, California, Feb. 2019. (Acceptance rate: 17%=89/521 ) [pdf] [bib] (Project website with code release) Haopei Wang, Guangliang Yang, Phakpoom Chinprutthiwong, Lei Xu, Yangyong Zhang, Guofei Gu. \"Towards Fine-grained Network Security Forensics and Diagnosis in the SDN Era.\" In Proc. of the 25th ACM Conference on Computer and Communications Security (CCS'18), Toronto, Canada, October 2018. (Acceptance rate: 16.6%=134/809) [pdf] [bib] (Release info) Hongda Li, Hongxin Hu, Guofei Gu, Gail-Joon Ahn, Fuqiang Zhang. \"vNIDS: Towards Elastic Security with Safe and Efficient Virtualization of Network Intrusion Detection Systems.\" In Proc. of the 25th ACM Conference on Computer and Communications Security (CCS'18), Toronto, Canada, October 2018. (Acceptance rate: 16.6%=134/809) [pdf] [bib] Abner Mendoza, Guofei Gu. \"Mobile Application Web API Reconnaissance: Web-to-Mobile Inconsistencies & Vulnerabilities. \" In Proc. of the 39th IEEE Symposium on Security and Privacy (S&P'18), San Francisco, CA, May 2018. (Acceptance rate: 11.5%=63/549)  [pdf] [bib] Guangliang Yang, Jeff Huang, Guofei Gu, Abner Mendoza. \"Study and Mitigation of Origin Stripping Vulnerabilities in Hybrid-postMessage Enabled Mobile Applications.\" In Proc. of the 39th IEEE Symposium on Security and Privacy (S&P'18), San Francisco, CA, May 2018. (Acceptance rate: 11.5%=63/549) [pdf] [bib] (Project website with code release) Abner Mendoza, Phakpoom Chinprutthiwong and Guofei Gu. \"Uncovering HTTP Header Inconsistencies and the Impact on Desktop/Mobile Websites.\" In Proc. of the Web Conference (WWW'18), Lyon, France, April 2018. (Acceptance rate 14.8%=171/1155) [pdf] [bib] Guangliang Yang, Jeff Huang, Guofei Gu. \"Automated Generation of Event-Oriented Exploits in Android Hybrid Apps.\" In Proc. of the Network and Distributed System Security Symposium (NDSS'18), San Diego, California, Feb. 2018. (Acceptance rate: 21.5% = 71/331) [pdf] [bib] Lei Xu, Jeff Huang, Sungmin Hong, Jialong Zhang, Guofei Gu. \"Attacking the Brain: Races in the SDN Control Plane.\" In Proc. of the 26th USENIX Security Symposium (Security'17), Vancouver, BC, Canada, August 2017. (Acceptance rate 16%=85/522) [pdf] [bib] Lei Xue, Yajin Zhou, Ting Chen, Xiapu Luo, Guofei Gu. \"Malton: Towards On-Device Non-Invasive Mobile Malware Analysis for ART.\" In Proc. of the 26th USENIX Security Symposium (Security'17), Vancouver, BC, Canada, August 2017. (Acceptance rate 16%=85/522) [pdf] [b",
  "content_length": 18256,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:31"
}