{
  "name": "Guofeng Zhang 0001",
  "homepage": "http://www.cad.zju.edu.cn/home/gfzhang",
  "status": "success",
  "content": "Guofeng Zhang Guofeng Zhang Full Professor , State Key lab of CAD&CG, College of Computer Science, Zhejiang University Tel: +86-571-88208701    Fax: +86-571-88206680 Email: zhangguofeng@zju.edu.cn Office: East Building 1A-509, State Key Lab of CAD&CG, ZijinGang Campus, Zhejiang University Home Page: http://www.cad.zju.edu.cn/home/gfzhang Dr. Zhang now is a full professor at Zhejiang University. He received the B.S. and Ph.D. degree in computer science and technology from Zhejiang University in 2003 and 2009, respectively. He is a core member of Computer Vision Group at State Key Lab of CAD&CG, Zhejiang University. Research Interests: SfM/SLAM & 3D Reconstruction Video Enhancement & Editing Augmented Reality News: July 2018: We have released the source code of ENFT-SfM, SegmentBA, EIBA and ICE-BA. Please visit https://github.com/zju3dv/ for more details. Sep. 2016: RKSLAM released : RKSLAM 1.0 has been released. Please visit http://www.zjucvg.net/rkslam/rkslam.html for more details. RKSLAM: Robust Keyframe-based Monocular SLAM for AR RKSLAM is a real-time monocular simultaneous localization and mapping system which can robustly work in challenging cases, such as fast motion and strong rotation. It can run real-time on a mobile device and outperform state-of-the-art systems (e.g. ORB-SLAM, PTAM, LSD-SLAM) in challenging cases of fast motion and strong rotation. LS-ACTS: Large-Scale Automatic Camera Tracking System LS-ACTS is a robust and efficient structure-from-motion system which can recover camera motion and 3D scene structure from large videos/sequences datasets. Compared to our previous SfM system ACTS, it is much faster (near real-time in a normal desktop PC) and can handle multiple extremely long sequences (over 100K frames). RDSLAM: Robust Dynamic Simultaneous Localization and Mapping RDSLAM is a real-time simultaneous localization and mapping system which allows parts of the scene to be dynamic or the whole scene to gradually change. Compared to PTAM, RDSLAM not only can robustly work in dynamic environments, but also can handle a larger scale scene (the number of the reconstructed 3D points can be tens of thousands). It is the basis for many applications, such as real-time 3D reconstruction and augmented reality. ACTS: Automatic Camera Tracking System ACTS is an automatic camera tracking system which can recover camera motion and 3D scene structure from videos and film sequences, providing the ease of automatic tracking. It can track all kinds of the camera motion efficiently and stably, which can be rotational or free-moving. Especially, the long sequences with varying focal length can be handled in a robust way. Besides camera motion, it also can recover accurate and dense depth maps now. We will actively update the program and add more and more advanced or extra functions along with our published papers in the future. Publications: â  indicates joint first authors. * indicates corresponding author. Technical Reports: Haomin Liu, Chen Li, Guojun Chen, Guofeng Zhang*, Michael Kaess and Hujun Bao. Robust Keyframe-based Dense SLAM with an RGB-D Camera. arXiv preprint arXiv:1711.05166, 2017. [arXiv report][source code] Guofeng Zhang, Haomin Liu, Zilong Dong, Jiaya Jia, Tien-Tsin Wong and Hujun Bao. ENFT: Efficient Non-Consecutive Feature Tracking for Robust Structure-from-Motion. Technical Report (arXiv:1510.08012), October, 2015. [arXiv report][video][software] Hanqing Jiang, Guofeng Zhang, and Hujun Bao. Spatio-Temporal Segmentation with Depth-Inferred Videos of Static Scenes. Technical Report, Zhejiang University, September, 2010. [pdf][video 1, 2, 3] Selected Journal Publications: Hongjia Zhai, Xiyu Zhang, Boming Zhao, Hai Li, Yijia He, Zhaopeng Cui, Hujun Bao, Guofeng Zhang*. SplatLoc: 3D Gaussian Splatting-based Visual Localization for Augmented Reality. IEEE Transactions on Visualization and Computer Graphics (TVCG). 31(5): 3591-3601 (2025) [pdf] [Project Page] [Code] Weijian Xie, Guanyi Chu, Quanhao Qian, Yihao Yu, Hai Li, Danpeng Chen, Shangjin Zhai, Nan Wang, Hujun Bao, Guofeng Zhang*. Depth Completion With Multiple Balanced Bases and Confidence for Dense Monocular SLAM. IEEE Trans. Vis. Comput. Graph (TVCG). 31(9): 5158-5169 (2025) [pdf] [code] Shuo Chen, Mao Peng, Yijin Li, Bing-Feng Ju, Hujun Bao, Yuan-Liu Chen*, Guofeng Zhang*. Multi-View Neural 3D Reconstruction of Micro-and Nanostructures with Atomic Force Microscopy. Communications Engineering (COMMSENG), volume 3, Article number: 131, 2024. [pdf] [code] Xiaojun Xiangâ , Hanqing Jiangâ , Yihao Yuâ , Donghui Shen, Jianan Zhen, Hujun Bao, Xiaowei Zhou, Guofeng Zhang*. Efficient High-Quality Vectorized Modeling of Large-Scale Scenes. International Journal of Computer Vision (IJCV), 132(10): 4564-4588, 2024. [pdf] Yan Xu, Kwan-Yee Lin, Guofeng Zhang, Xiaogang Wang, Hongsheng Li*. RNNPose: 6-DoF Object Pose Estimation via Recurrent Correspondence Field Estimation and Pose Optimization. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 46(7): 4669-4683, 2024. [pdf] [code] Xiaowei Zhou, Haoyu Guo, Sida Peng, Yuxi Xiao, Haotong Lin, Qianqian Wang, Guofeng Zhang, Hujun Bao*. Neural 3D Scene Reconstruction With Indoor Planar Priors. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 46(9): 6355-6366, 2024. [pdf] [project page] Hongjia Zhai, Gan Huang, Qirui Hu, Guanglin Li, Hujun Bao, and Guofeng Zhang*. NIS-SLAM: Neural Implicit Semantic RGB-D SLAM for 3D Consistent Scene Understanding. IEEE Transactions on Visualization and Computer Graphics (TVCG), 30(11): 7129-7139, 2024. [pdf] [project page] Xiaokun Pan, Gan Huang, Ziyang Zhang, Jinyu Li, Hujun Bao, and Guofeng Zhang*. Robust Collaborative Visual-Inertial SLAM for Mobile Augmented Reality. IEEE Transactions on Visualization and Computer Graphics (TVCG), 30(11): 7354-7363, 2024. [pdf] [video] [code] Guofeng Zhangâ  Jin Yuanâ , Haoming Liu, Zhen Peng, Chunlei Li, Zibin Wang, Hunjun Bao*. 100-Phones: A Large VI-SLAM Dataset for Augmented Reality Towards Mass Deployment on Mobile Phones. IEEE Transactions on Visualization and Computer Graphics (TVCG), 30(5): 2098-2108, 2024. [pdf] [supplementary video] [project] Jinyu Liâ , Xiaokun Panâ , Gan Huang, Ziyang Zhang, Nan Wang, Hujun Bao, and Guofeng Zhang*. RD-VIO: Robust Visual-Inertial Odometry for Mobile Augmented Reality in Dynamic Environments. IEEE Transactions on Visualization and Computer Graphics (TVCG), 30(10): 6941-6955, 2024. [pdf] [project page] Haomin Liu, Hua Xue, Linsheng Zhao, Danpeng Chen, Zhen Peng, and Guofeng Zhang*. MagLoc-AR: Magnetic-based Localization for Visual-free Augmented Reality in Large-scale Indoor Environments. IEEE Transactions on Visualization and Computer Graphics (TVCG), 29(11): 4383-4393, 2023. [pdf] [video] [project] Haomin Liu, Linsheng Zhao, Zhen Peng, Weijian Xie, Mingxuan Jiang, Hongbin Zha, Hujun Bao, and Guofeng Zhang*. A Low-cost and Scalable Framework to Build Large-Scale Localization Benchmark for Augmented Reality IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 34(4): 2274-2288, 2024. [pdf] [video] [project] Zhichao Ye, Chong Bao, Xin Zhou, Haomin Liu, Hujun Bao, and Guofeng Zhang*. EC-SfM: Efficient Covisibility-based Structure-from-Motion for Both Sequential and Unordered Images. IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2023. [pdf] [code] Bangbang Yang, Zhaoyang Huang, Yijin Li, Han Zhou, Hongsheng Li, Guofeng Zhang*, Hujun Bao. Hybrid3D: learning 3D hybrid features with point clouds and multi-view images for point cloud registration. Science China Information Sciences, Volume 66, article number 172101, 2023. [pdf] [code] Chenchen Liâ , Liyang Zhouâ , Hanqing Jiangâ , Zhuang Zhang, Xiaojun Xiang, Han Sun, Qing Luan, Hujun Bao, and Guofeng Zhang*. Hybrid-MVS: Robust Multi-View Reconstruction with Hybrid Optimization of Visual and Depth Cues. IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2023. [pdf] Haoran Chen, Lantian Wei, Haoming Liu, Boxing Shi, Guofeng Zhang, and Hongbin Zha*. MOUNT: Learning 6DoF Motion Prediction Based on Uncertainty Estimation for Delayed AR Rendering. IEEE Transactions on Visualization and Computer Graphics (TVCG), 2022. [pdf] [video] Hai Liâ , Hongjia Zhaiâ , Xingrui Yang, Zhirong Wu, Yihao Zheng, Haofan Wang, Jianchao Wu*, Hujun Bao, and Guofeng Zhang*. ImTooth: Neural Implicit Tooth for Dental Augmented Reality. IEEE Transactions on Visualization and Computer Graphics (TVCG), 2023. [pdf] [Presentation Video] [Demo Video] Hai Liâ , Xingrui Yangâ , Hongjia Zhai, Yuqian Liu, Hujun Bao, and Guofeng Zhang*. Vox-Surf: Voxel-based Implicit Surface Representation. IEEE Transactions on Visualization and Computer Graphics (TVCG), 2022. [pdf] [source code] Your browser does not support the video tag. Zhaoyang Huangâ , Xiaokun Panâ , Weihong Pan, Weikang Bian, Yan Xu, Ka Chun Cheung, Guofeng Zhang*, Hongsheng Li*. NeuralMarker: A Framework for Learning General Marker Correspondence. ACM Transactions on Graphics (SIGGRAPH Asia), 2022. [pdf] [source code] [project] [video] Kangkan Wang, Sida Peng, Xiaowei Zhou, Jian Yang, and Guofeng Zhang*. NerfCap: Human Performance Capture with Dynamic Neural Radiance Fields. IEEE Transactions on Visualization and Computer Graphics (TVCG), 2022. [pdf] [video] Zhichao Ye, Guanglin Li, Haomin Liu, Zhaopeng Cui, Hujun Bao, and Guofeng Zhang*. CoLi-BA: Compact Linearization based Solver for Bundle Adjustment. IEEE Transactions on Visualization and Computer Graphics (TVCG), 2022. [pdf] [video] [source code] Your browser does not support the video tag. Bangbang Yang, Yinda Zhang, Yijin Li, Zhaopeng Cui*, Sean Fanello, Hujun Bao, Guofeng Zhang*. Neural Rendering in a Room: Amodal 3D Understanding and Free-Viewpoint Rendering for the Closed Scene Composed of Pre-Captured Objects. ACM Transactions on Graphics (SIGGRAPH), 2022. [pdf] [pdf-high-res] [source code] [project] [video] Hujun Bao, Weijian Xie, Quanhao Qian, Dan",
  "content_length": 33626,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:29"
}