{
  "name": "Guoliang Li 0001",
  "homepage": "http://dbgroup.cs.tsinghua.edu.cn/ligl",
  "status": "success",
  "content": "Guoliang Li @ Tsinghua ä¸­æç (Chinese Version) Biography Guoliang Li     æå½è¯ Professor, ACM/IEEE Fellow Database Research Group Dept. of Computer Science and Technology Tsinghua University, Beijing, China The research interests of Guoliang Li include database systems, machine learning for databases, human-in-the-loop data management, large-scale data cleaning and integration. He got VLDB 2017 Early Research Contribution Award, TCDE 2014 Early Career Award, ICDE 2025 Best Paper Runner-up, SIGMOD 2024 Research Highlight Award, SIGMOD 2023 Best Papers, VLDB 2023 Best Industry Paper Runner-up, DASFAA 2023 Best Paper Award, VLDB 2020 Best Papers, CIKM 2017 Best Paper Award, KDD 2018 Best Papers, ICDE 2018 Best Papers, DASFAA 2019 Best Student Paper Award, DASFAA 2014 Best Paper Runnerup, APWeb 2014 Best Paper Award, EDBT 2013 Similarity Join and Search Champion. He regularly served as PC Member of SIGMOD, VLDB, ICDE, KDD, WWW. He is serving as associate editor for IEEE TKDE, VLDB Journal, IEEE Data Engineering Bulletin, BigData research, and FCS. Contact Me Room 802, Building 1, Ziqiang Technology Building, Department of Computer Science and Technology, Tsinghua University, Beijing 100084, China. 86-10-62789150 (Phone) 86-10-62771138 (Fax) Â li guoliang @ tsinghua.edu.cn Career Path Dec 2018 - Now. Professor, Dept. of Computer Science and Technology, Tsinghua University. Dec 2012 - Nov 2018. Associate Professor, Dept. of Computer Science and Technology, Tsinghua University. Jul 2009 - Nov 2012. Assistant Professor, Dept. of Computer Science and Technology, Tsinghua University. My up-to-date CV Visiting Scholor Sep 2017 - Sep 2018. Visiting Professor, MIT (Profs. Michael Stonebraker, Samuel Madden). Feb - Jun, 2008. Intern Research Assistant, University of California, Irvine (Prof. Chen Li). Apr - Nov, 2006. Intern Research Assistant, NUS (Prof. Beng Chin Ooi). Education Info Sep 2004 - Jul 2009. Ph.D, Dept. of Computer Science and Technology, Tsinghua University, Beijing, China. Sep 2000 - Jul 2004. Undergraduate, Dept. of Computer Science and Technology, Harbin Institute of Technology, Harbin, China",
  "content_length": 2142,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:30"
}