{
  "name": "Guoliang Xing",
  "homepage": "https://staff.ie.cuhk.edu.hk/~glxing",
  "status": "success",
  "content": "Guoliang Xing Prof. Guoliang Xing received his B.S. and M.S. degrees from Xi’an Jiao Tong University, China, in 1998 and 2001, respectively, and his D.Sc. degree from Washington University in St. Louis in 2006. He is currently a Professor in the Department of Information Engineering at The Chinese University of Hong Kong (CUHK). Previously, he served as a faculty member at the City University of Hong Kong and Michigan State University, USA. Prof. Xing’s research lies at the intersection of systems and Embedded AI, with transformative applications in healthcare, autonomous driving, and sustainability. His research group is at the forefront of advancements in Internet of Things (IoT), Cyber-Physical Systems (CPS), embedded sensor systems, and wireless networks. Highlights of his work include leading the development and field deployment of large-scale systems for roadside infrastructure-assisted autonomous driving, early clinical diagnosis and treatment of Alzheimer’s disease, and real-time volcano monitoring. Several technologies developed in his lab have been successfully adopted by industry and have received significant recognition from leading global companies. Prof. Xing has received several prestigious awards, including the US NSF CAREER Award (2010), the Withrow Rising Scholar Award from Michigan State University (2014), Research Excellence Award, and the Outstanding Fellow from CUHK (2024). His work has received 6 Best Paper Awards, 5 Best Demo/Poster/Artifact Awards, and 7 Best Paper Finalist distinctions at top-tier international conferences such as MobiCom, MobiSys, SenSys, ICNP, and IPSN. He is a Fellow of both the ACM and IEEE. For more information about his research, visit the AIoT Lab homepage. Motivated students and researchers are encouraged to explore current openings and and join the team. News Sep 9,2025 [Paper] Named Hong Kong RGC Senior Research Fellow 2025 (10 awardees across all disciplines), read the news release here. Sep 7,2025 [Paper] Three papers of our lab have been accepted by MobiCom 2025! Jul 25,2025 [Paper] Our paper “SCX: Stateless KV-Cache Encoding for Cloud-Scale Confidential Transformer Serving” was accepted by SIGCOMM 2025! May 12,2025 [Honor] Congratulations to Di for receiving the Best Paper Honorable Mention Award at SenSys 2025! Apr 13,2025 [Honor] Our research projects, An Intelligent LiDAR with Adaptive Focus and Sonar-based Underwater Human Activity Monitoring System, received two gold medals at the 50th International Exhibition of Inventions Geneva. Jan 23,2025 [Honor] Elected as an ACM Fellow, read the news release here. Dec 26,2024 [Honor] Congratulations to Zhihe for being selected for Forbes China’s ‘30 under 30’ list! Nov 27,2024 [Honor] At MobiCom’24, Jiahe & Yuze’s work “αLiDAR: An Adaptive High-Resolution Panoramic LiDAR System” received Best Artifact Award and Best Demo Award Runner-up. The work “Soar: Design and Deployment of A Smart Roadside Infrastructure System for Autonomous Driving” co-led by Shuyao, Neiwen, Zhehao, and Xuan received Best Artifact Award Runner-up! Congratulations! Nov 18,2024 [Service] Serving as the Interim Joint Steering Committee Co-Chair of SenSys, IPSN, and IoTDI, and General Co-Chair of SenSys’25. Nov 15,2024 [Honor] Congratulations to Zhiyuan for receiving the Outstanding PhD Thesis Award! Nov 15,2024 [Honor] Received the Research Excellence Award, Outstanding Fellow from Faculty of Engineering. Nov 7,2024 [Honor] Our demo “Myotrainer: Muscle-Aware Motion Analysis and Feedback” received the Best Demo Runner-up Award at SenSys 2024! Congrats to Yuting, Xinyan, Mu, and Di! Jul 14,2024 [Funding] Received a new STG grant of HKD $39.17M as PI, titled “Foundation Models-Empowered Ambient Intelligence Systems for Early Diagnosis, Personalised Intervention, and Complex Cross-Disease Interplay Analysis of Aging-Related Degenerative Diseases”. Read the press release here. Jun 5,2024 [Honor] Our demo “MuRa: A Scalable Mobile Ultra-wideband Testbed for Multi-node Ranging” received the Best Demo Award at MobiSys 2024! Congrats to Shaoyang! May 15,2024 [Honor] Our demo “AD-CLIP: Privacy-Preserving, Low-Cost Synthetic Human Action Dataset for Alzheimer’s Patients via CLIP-based Models” received the Best Demo Award at IPSN 2024! Congrats to Heming! May 15,2024 [Honor] Our paper “ArtFL: Exploiting Data Resolution in Federated Learning for Dynamic Runtime Inference via Multi-Scale Training” received the Best Paper Award at IPSN 2024! Congrats to Siyang and our alum Xian! Apr 29,2024 [Event] Congratulations to Xiaomin who will be joing CSE@HKUST as a tenure-track Assistant Professor in Fall 2024! Apr 20,2024 [Honor] Our research projects, VI-Map, Mozart, and VibVoice have won gold, silver, and bronze prizes at the 49th International Exhibition of Inventions Geneva, respectively. Oct 27,2023 [Paper] Our paper “Unleash the Potential of Image Branch for Cross-modal 3D Object Detection” was accepted by NeurIPS 2023! Oct 23,2023 [Paper] Our paper “Wave-for-Safe: Multisensor-based Mutual Authentication for Unmanned Delivery Vehicle Services” was accepted by MobiHoc 2023! Oct 2,2023 [Honor] Our paper “VI-Map: Infrastructure-Assisted Real-Time HD Mapping for Autonomous Driving” received Best Community Contribution Award at MobiCom 2023! Sep 20,2023 [Paper] Our paper “Miriam: Exploiting Elastic Kernels for Real-time Multi-DNN Inference on Edge GPU” was accepted by SenSys 2023! Sep 20,2023 [Paper] Our paper “EdgeFM: Leveraging Foundation Model for Open-set Learning on the Edge” was accepted by SenSys 2023! Sep 9,2023 [Paper] Our paper “Timely Fusion of Surround Radar/Lidar for Object Detection in Autonomous Driving Systems” was accepted by DATE 2023! Jul 31,2023 [Event] Co-Chairing CPS-IoT Week 2024 in Hong Kong! Please consider to submit papers. Jul 30,2023 [Event] Gave a keynote at ACM TURC (SigBed Symposium), and attended two panels. Jul 25,2023 [Paper] Our paper “Enabling Ubiquitous WiFi Sensing with Beamforming Reports” was accepted by SIGCOMM 2023! Congrats to Chenhao and Xuan! Jul 20,2023 [Service] Serving on PC of MobiCom and SenSys 2024. Jul 19,2023 [Service] The Croucher ASI-AIoT Workshop just concluded. We had six distinguished lectures, four panels, and a dozen of invited talks! Jun 22,2023 [Honor] Our paper “Mozart: A Mobile ToF System for Sensing in the Dark through Phase Manipulation” received the Best Paper Award at MobiSys 2023! Congrats to Zhiyuan and Xiaomin! Feb 27,2023 [Paper] Our paper “Mozart: A Mobile ToF System for Sensing in the Dark through Phase Manipulation” was accepted by MobiSys 2023! Feb 27,2023 [Paper] Our paper “Harmony: Heterogeneous Multi-Modal Federated Learning through Disentangled Model Training” was accepted by MobiSys 2023! Nov 9,2022 [Honor] Our poster “Aaron: Compile-time Kernel Adaptation for Multi-DNN Inference Acceleration on Edge GPU” received the Best Poster Award at by SenSys 2022! Congrats to Zhihe and Neiwen! Nov 7,2022 [Honor] Our paper “BlastNet: Exploiting Duo-Blocks for Cross-Processor Real-Time DNN Inference” was selected as a Best Paper Finalist at SenSys 2022! Congrats to Neiwen! Oct 18,2022 [Honor] Our paper “VIPS: Real-Time Perception Fusion for Infrastructure-Assisted Autonomous Driving” received Best Paper Award Runner-Up at MobiCom 2022! Congrats to Shuyao! Sep 14,2022 [Paper] Our paper “AutoMatch: Leveraging Traffic Camera to Improve Perception and Localization of Autonomous Vehicles” was accepted by SenSys 2022! Sep 14,2022 [Paper] Our paper “BlastNet: Exploiting Duo-Blocks for Cross-Processor Real-Time DNN Inference” was accepted by SenSys 2022! Major Awards ACM Fellow, 2024 IEEE Fellow, 2020 Hong Kong RGC Senior Research Fellow, 2025 (10 awardees across all disciplines) Research Excellence Award, Outstanding Fellow, CUHK, 2024 Withrow Rising Scholar Award, 2014 Michigan Stage University, USA NSF CAREER Award, USA, 2010 Best Artifact Award, MobiCom, 2024 αLiDAR: An Adaptive High-Resolution Panoramic LiDAR System Best Paper Award, IPSN 2024 ArtFL: Exploiting Data Resolution in Federated Learning for Dynamic Runtime Inference via Multi-Scale Training Best Community Contribution Award, MobiCom 2023 VI-Map: Infrastructure-Assisted Real-Time HD Mapping for Autonomous Driving Best Paper Award, MobiSys 2023 Mozart: A Mobile ToF System for Sensing in the Dark through Phase Manipulation Best Paper Award Runner-Up, MobiCom 2022 VIPS: Real-Time Perception Fusion for Infrastructure-Assisted Autonomous Driving Best Student Paper Award, IoTDI 2021 milliEye: A Lightweight mmWave Radar and Camera Fusion System for Robust Object Detection Best Paper Award, IPSN 2013 Nemo: A High-fidelity Noninvasive Power Meter System for Wireless Sensor Networks Best Paper Award, ICNP 2010 Beyond Co-existence: Exploiting WiFi White Space for ZigBee Performance Assurance Other Awards Gold Medal, 50th International Exhibition of Inventions Geneva, 2025 An Intelligent LiDAR with Adaptive Focus Gold Medal, 50th International Exhibition of Inventions Geneva, 2025 Sonar-based Underwater Human Activity Monitoring System Best Paper Honorable Mention Award, SenSys, 2025 Argus: Multi-View Egocentric Human Mesh Reconstruction Based on Stripped-Down Wearable mmWave Add-on Best Demo Award Runner-up, MobiCom, 2024 αLiDAR: An Adaptive High-Resolution Panoramic LiDAR System Best Artifact Award Runner-up, MobiCom, 2024 Soar: Design and Deployment of A Smart Roadside Infrastructure System for Autonomous Driving Best Demo Runner-up Award, SenSys, 2024 Myotrainer: Muscle-Aware Motion Analysis and Feedback System for In-Home Resistance Training Best Demo Award, MobiSys, 2024 MuRa: A Scalable Mobile Ultra-wideband Testbed for Multi-node Ranging Best Demo Award, IPSN, 2024 AD-CLIP: Privacy-Preserving, Low-Cost Synthetic Human Action Dataset for Alzheimer's Patients via CLIP-based Models Best Poster Award, SenSys 2022 Aaron: Compile-time Kernel Adaptation for Multi-DNN Inference Acceleration on Edge GPU Best Paper Finalist, SenSys 2022 BlastNet: ",
  "content_length": 11892,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:31"
}