{
  "name": "Guoning Chen",
  "homepage": "http://www2.cs.uh.edu/~chengu",
  "status": "success",
  "content": "﻿ Guoning Chen's Homepage Previous Next Welcome I am a Professor at the Department of Computer Science at the University of Houston. I am leading the Data Visualization and Modeling (DaViM) Lab at the University of Houston. EDUCATION Ph.D. degree in Computer Science from Oregon State University in 2009. Advisor: Prof. Eugene Zhang M.E. degree in Control Theory and Engineering/Computer Application from Guangxi University, China in 2002. Advisor: professor Taoshen Li B.E. degree in Information and Communication Engineering in 1999 from Xi'an Jiaotong University. EXPERIENCE 2025-present: Professor, Department of Computer Science, University of Houston 2023-present: Associate Chair, Department of Computer Science, University of Houston 2018-present: Associate Professor, Department of Computer Science, University of Houston 2012-2018: Assistant Professor, Department of Computer Science, University of Houston 2009-2012: Postdoctoral researcher, Scientific Computing and Imaging (SCI) Institute, University of Utah 2002-2004: Assistant Lecturer, Department of Computer Science, Guangxi University, China RESEARCH AREAS Data visualization, especially scientific data visualization Topology-based methods Geometric modeling and geometry processing Physically-based simulations SELECTED AWARDS John C. Butler Excellence in Teaching Award, College of Natural Science and Mathematics, UH, 2024 Best Paper Honorable Mention Award, \"“Extract and Characterize Hairpin Vortices in Turbulent Flows,\" IEEE Visualization 2023 Honorable Mention Short Paper Award, \"Graph-assisted Visualization of Microvascular Networks,\" IEEE Visualization 2019 Honorable Mention Poster Award, \"Correlation Study of Attributes for Unsteady Flow,\" IEEE Visualization 2017 Best Paper Award, \"Critical Point Cancellation in 3D Vector Fields: Robustness and Discussion,\" IEEE Pacific Visualization Symposium 2016 Junior Faculty Award for Excellence in Research, College of Natural Science and Mathematics, UH, 2016 NSF CAREER AWARD, 2016 Best Paper Award, \"2D Vector Field Simplification Based on Robustness,\" IEEE Pacific Visualization Symposium 2014 Honorable Mention Award, \"Visual Analysis of Uncertainties in Ocean Forecasts for Planning and Operation of Off-Shore Structures,\" IEEE Pacific Visualization Symposium 2013 Best Paper Award, \"Edge Maps: Representing Flow with Bounded Error,\" IEEE Pacific Visualization Symposium 2011 You can find my latest CV here. CONTACT ME Prof. Guoning Chen Office: PGH 566 Phone: 713-743-5788 Email: gchen22 at central dot uh dot edu Address: University of Houston College of Natural Sciences and Math Department of Computer Science Philip Guthrie Hoffman Hall 3551 Cullen Blvd., Room 501 Houston, TX 77204-3010",
  "content_length": 2730,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:33"
}