{
  "name": "Guoping Rong",
  "homepage": "https://softeng.nju.edu.cn/faculty/GuopingRong/index.html",
  "status": "success",
  "content": "Guoping Rong English 荣国平，博士，南京大学软件学院特任研究员，博士生导师，南京大学-星环科技“星云”数据技术联合研究中心主任，主要研究领域为智能软件工程、DevOps 、AIOps等，主持和参与多项国家级、省部级项目；在TSE、TOSEM、TDSC、IST、SPE、JSS、软件学报等一流期刊以及ICSE、ASE、FSE、ISSTA、ISSRE、ICSME 等一流国际会议上发表各类论文70余篇；主导研发了第一个支持思维链的代码检视大语言模型CarLLM，迄今维持业界领先水平；作为首席架构师主导《开发运维一体化成熟度模型（DOMM）》国家标准制订。 联系方式  邮件：ronggp@nju.edu.cn     电话： +86-25-83621362 转 938 研究方向简介 z  智能软件工程：主要研究使用大语言模型赋能软件工程各个环节，提升智能化水平，具体研究主题包括数据准备、模型微调和对齐、思维链构造和验证等。 z  DevOps：主要研究端到端智能化和自动化技术、国标过程规范建设和改进以及研发效能度量和改进等。 z  AIOps：主要研究复杂分布式系统中的异常检测、根因定位、日志实践和数据治理等。 近几年精选论文 2025： 1.        Yongda Yu, Guoping Rong*, Haifeng Shen, He Zhang, Dong Shao, Min Wang, Zhao Wei, Yong Xu, Juhong Wang: Fine-Tuning Large Language Models to Improve Accuracy and Comprehensibility of Automated Code Review. ACM Transactions on Software Engineering Methodology. 34(1): 14:1-14:26 (2025) (TOSEM, CCF-A) 2.        Guoping Rong, Yongda Yu, Song Liu, Xin Tan, Tianyi Zhang, Haifeng Shen, Jidong Hu, Code Comment Inconsistency Detection and Rectification, in Proceedings of the 47th International Conference on Software Engineering (ICSE'25), 2025. (to appear) (ICSE, CCF-A) 2024： 3.        Guoping Rong, Yongda Yu, Yifan Zhang, He Zhang, Haifeng Shen, Dong Shao, Hongyu Kuang, Min Wang, Zhao Wei, Yong Xu, Juhong Wang: Distilling Quality Enhancing Comments From Code Reviews to Underpin Reviewer Recommendation. IEEE Transactions on Software Engineering. 50(7): 1658-1674 (2024). (TSE, CCF-A) 4.        Hui Gao, Hongyu Kuang, Wesley K. G. Assunção, Christoph Mayr-Dorn, Guoping Rong, He Zhang, Xiaoxing Ma, Alexander Egyed: TRIAD: Automated Traceability Recovery based on Biterm-enhanced Deduction of Transitive Links among Artifacts. ICSE 2024: 216:1-216:13. (ICSE, CCF-A) 5.        Jun Lyu, Shanshan Li, He Zhang, Yang Zhang, Guoping Rong, Manuel Rigger: Detecting Build Dependency Errors in Incremental Builds. ISSTA 2024: 1-12. (ISSTA, CCF-A) 6.        Kexin Sun, Yiding Ren, Hongyu Kuang, Hui Gao, Xiaoxing Ma, Guoping Rong, Dong Shao, He Zhang: AVIATE: Exploiting Translation Variants of Artifacts to Improve IR-based Traceability Recovery in Bilingual Software Projects. ASE 2024: 519-530. (ASE, CCF-A) 2023： 7.        Guoping Rong, Hao Wang, Shenghui Gu, Yangchen Xu, Jialin Sun, Dong Shao, He Zhang: Locating Anomaly Clues for Atypical Anomalous Services: An Industrial Exploration. IEEE Transactions on Dependable and Secure Computing 20(4): 2746-2761 (2023). (TDSC, CCF-A) 8.        Shenghui Gu, Guoping Rong*, Tian Ren, He Zhang, Haifeng Shen, Yongda Yu, Xian Li, Jian Ouyang, Chunan Chen: TrinityRCL: Multi-Granular and Code-Level Root Cause Localization Using Multiple Types of Telemetry Data in Microservice Systems. IEEE Transactions on Software Engineering. 49(5): 3071-3088 (2023). (TSE, CCF-A) 9.        Shenghui Gu, Guoping Rong*, He Zhang, Haifeng Shen: Logging Practices in Software Engineering: A Systematic Mapping Study. IEEE Transactions on Software Engineering. 49(2): 902-923 (2023). (TSE, CCF-A) 10.     Guoping Rong, Shenghui Gu, Haifeng Shen, He Zhang, Hongyu Kuang: How Do Developers' Profiles and Experiences Influence their Logging Practices? An Empirical Study of Industrial Practitioners. ICSE 2023: 855-867. (ICSE, CCF-A) 2022： 11.     Guoping Rong, Yifan Zhang, Lanxin Yang, Fuli Zhang, Hongyu Kuang and He Zhang, Modeling Review History for Reviewer Recommendation: A Hypergraph Approach. in Proceedings of the 44th International Conference on Software Engineering (ICSE'22), ACM, 2022. (ICSE, CCF-A) 研究方向关键词示意图 近三年论文关键词，也即研究重点如下图所示，供参考。",
  "content_length": 3512,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:32"
}