{
  "name": "Guoquan P. Huang 0001",
  "homepage": "https://udel.edu/~ghuang",
  "status": "success",
  "content": "Guoquan (Paul) Huang Guoquan Huang @ UD about cv Research publications research group youtube github Teaching meeg311 meeg401 meeg467 meeg621 meeg624 meeg677 meeg877 2.004 (mit) Events PI2 Workshop TRO-SI: Visual SLAM IEEE MOST 2025 VINS Workshop 2021 VINS Workshop 2019 Guoquan (Paul) Huang Professor (ME/CIS), University of Delaware University of Delaware 130 Academy Street, SPL 304 Newark, DE 19716, USA phone: (302) 831-8796 fax: (302) 831-3619 email: ghuang@udel.edu Bio I am currently a Professor of Mechanical Engineering (ME) and Computer and Information Sciences (CIS) at the University of Delaware (UD), where I am leading the Robot Perception and Navigation Group (RPNG), which is a key part of UD Center for Autonomous and Robotic Systems (CARS). I am also the Principal Scientist at Meituan USA. I was a Postdoctoral Associate (2012-2014) working in the Marine Robotics Group of John Leonard at the MIT Computer Science and Artificial Intelligence Laboratory (CSAIL). Prior to MIT, I was working with Stergios Roumeliotis in the Multiple Autonomous Robotic Systems (MARS) Lab at the Digital Technology Center (DTC) and the Dept. of Computer Science and Engineering, University of Minnesota (UMN), where I obtained my M.Sc. and Ph.D. in computer science in 2009 and 2012, respectively. Before that, I had been a research assistant for two years in the Dept. of Electrical Engineering, Hong Kong Polytechnic University, where I worked with Ahmad Rad, after receiving my B.S. degree in automation (electrical engineering) from the University of Science and Technology Beijing, China. Learn more from my CV… Research My research interests focus on state estimation and spatial perception for robotics and XR, including probabilistic sensing, localization, mapping, perception and planning of autonomous ground, aerial and underwater vehicles, as well as mobile devices: Simultaneous localization and mapping (SLAM) Visual-inertial navigation system (VINS) Aided inertial navigation Sensor calibration and fusion Multimodal perception 3D scene understanding Spatial intelligence Physical AI Learn more from my research lab at UD: Robot Perception and Navigation Group (RPNG). What's New (Oct 2025) Out latest ultrafast sqrt-VINS is published on TRO and open sourced: Demo 1, Demo 2. (Oct 2025) I was selected to be an ACM Senior Member. (Jul 2025) Chuchu Chen has sucessfully defended her thesis and joins the George Washington University (GWU) as a tenure-track Assistant Professor. Congrats Prof. Chen! (May 2025) I was promoted to Full Professor. (Mar 2025) In collaboration with Bosch, our recent work of Online Language Splatting is now live! (Mar 2025) I was selected to receive the 2024 Mid-Career Faculty Excellence in Scholarship Award. (May 2024) Square Root Filter-based VINS won the ICRA 2024 Best Paper Award Finalist (Robot Vision). (May 2024) Nate Merrill successfully defended his thesis and joins Quidient. (Dec 2023) Woosik Lee finishes his PhD and joins Apple. (Jul 2023) Our paper won the RSS 2023 Best Student Paper Finalist. Congrats Nate, Patrick, Sai, and Chuchu! (Jun 2023) Patrick Geneva finishes his PhD and joins Apple. Congrats Dr. Geneva! (Jun 2023) Our new TRO paper on visual-inertial self-calibration is alive now. (Apr 2023) Our paper won the 2022 Best Paper Award for GNC Journal. Congrats Kleio! (Oct 2022) Zheng Huai finishes his PhD and joins Google ARCore. Congrats Dr. Huai! (May 2022) Our new TRO paper (OA-LICalib) accepted - Congrats Jiajun and Xingxing! (May 2022) We won the ICRA 2022 Outstanding Navigation Paper Award. Congrats Lipu! (Oct 2021) Yulin Yang has sucessfully defended his thesis and joins Apple. Congrats Dr. Yang! (May 2021) CodeVIO paper is the ICRA 2021 Best Paper Finalist in Robot Vision. Congrats Xingxing and Nate! More… Page generated 2025-11-25 22:44:43 EST, by jemdoc+MathJax.",
  "content_length": 3855,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:35"
}