{
  "name": "Guoqing Harry Xu",
  "homepage": "http://www.cs.ucla.edu/~harryxu",
  "status": "success",
  "content": "Harry Xu's Homepage Harry Xu Professor Office: Engineering VI, Room 496A Computer Science Department Samueli School of Engineering University of California, Los Angeles harryxu at cs dot ucla dot edu About Me I am a Professor in the Computer Science Department of University of California, Los Angeles. My research broadly covers computer systems, spanning programming languages, compilers, runtime/operating systems, distributed systems, and computer architecture. My current focus includes two main areas: (1) building infrastructures for future cloud computing, particularly user-defined clouds, and (2) creating scalable and cost-effective infrastructures for AI applications. I co-founded BreezeML, a startup company that builds a software solution for GenAI risk management. In 2017, I worked at Microsoft Research as a Visiting Researcher where I initiated and led the development of a project that built an optimizing compiler (Niijima, SOSP'19) for Microsoft's Scope/Cosmos, a multilingual data analytics pipeline. I worked at IBM T. J. Waston Research Center as a Co-op/intern from 2008 to 2011 where I led the creation of of runtime bloat detection and performance optimization tools for IBM's enterprise Java customers (PLDI'09, PLDI'10-a, PLDI'10-b). Recently, our group developed VQPy, a system that has been integrated into Cisco's DeepVision platform to support complex video processing. I was among the first academic researchers to address the problem of ``software bloat'', a field that eventually led to ONR's $200M TPCP program, funding over 100 projects across more than 60 universities in the U.S. Additionally, I pioneered the optimization of large-scale data analytics through programming language techniques. Our Yak GC (OSDI'16) was reimplemented by Huawei to support their telecommunication applications. In recognition of these contributions, I received the 2018 Dahl-Nygaard Junior Prize, awarded annually to a junior researcher with promising contributions to the field of object orientation. I am also an ACM Distinguished Scientist. Professional o Publications Current Projects (Some Recent Papers) o The Open Virtual GPU Project (Prism, ConServe) o Systems for Reliable Cloud Computing in the Presence of Silent CPU Errors (SOSP'25) o Systems for Affordable, Efficient, and Scalable AI/ML (SIGCOMM'20, OSDI'21, NSDI'23-b, NSDI'23-c, NSDI'24-b, MLSys'24) o Systems for Resource-Disaggregated Datacenters (OSDI'20, PLDI'22-a, OSDI'22-best-paper, NSDI'23-a, NSDI'23-d, NSDI'24-a, OSDI'24-a, OSDI'24 -b) o System Design for Emerging (Datacenter) Hardware (PLDI'19, PLDI'20, ASPLOS'21, PLDI'21-a, ASPLOS'22-a, ASPLOS'22-b, PLDI'22-b, OSDI'22-b) o IoT Usablity and Security (SEC'18, FSE'20-a) o Graph Systems for Static Code Analysis and Other Workloads (ASPLOS'17-a, ASPLOS'17-b, OSDI'18, EuroSys'19, PLDI'21-b, TOCS'21, EuroSys'23) o Big Data Systems and their Runtime Support (SOSP'15, ASPLOS'15, OSDI'16, ASPLOS'18, SOSP'19-a, SOSP'19-b) o Software Bloat Detection and Optimization (ECOOP'15, PLDI'18, FSE'20-b) Research Group o  Junyi Shu (PostDoc Researcher starting 2025, Outstanding PhD Dissertation Award at PKU) o  Shan Yu (Ph.D. student starting Fall 2022, Intel DRA Award, Cisco ``You Amaze 2'' Technical Excellence Award, AWS AI Fellowship) o  Zhenting Zhu (Ph.D. student starting Fall 2023, Yao Award, Andrew Yao Class at Tsinghua, Gold Medalist IOI 2018) o  Shu Anzai (Ph.D. student starting Fall 2023, Funai Overseas Scholarship, University of Tokyo) o  Yicheng Liu (Ph.D. student starting Fall 2024, Co-advised with Sam Kumar, Top Graduate of Shanghai Jiaotong U.) o  Yue Jin (Ph.D. student starting Fall 2025, Most Innovative Spirit Award from the Ant Group) Alumni o  Shi Liu (Ph.D. 2025, UCLA => Databricks) o  Jiyuan Wang (Ph.D. 2025, UCLA => AWS) o  Haoran Ma (Ph.D. 2024, UCLA => ByteDance AI Infra) o  Yifan Qiao (Ph.D. 2024, UCLA => Postdoc Researcher, Sky Computing Lab, UC Berkeley) o Christian Navasca (Ph.D. 2023, UCLA => BreezeML) o  Pengzhan Zhao (M.S. 2023, UCLA => BreezeML => AMD) o Chenxi Wang (PostDoc 2018-2022, UCLA => Associate Professor, Institute of Computing Technology, Chinese Academy of Sciences) o Jonathan Eyolfson (PostDoc 2018-2022, UCLA => Assistant Professor in teaching stream, University of Toronto) o John Thorpe (Ph.D. 2022, UCLA => BreezeML Inc.) o Arthi Padmanabhan (Ph.D. 2022, UCLA => Assistant Professor, Harvey Mudd College) o  Usama Hameed (M.S. 2022, UCLA => Apple) o Yuanqi Li (dropped out of Ph.D. due to startup) o Khanh Nguyen (Ph.D. 2019, UCLA => Assistant Professor @ TAMU, Google Ph.D. Fellowship, Facebook Ph.D. Fellowship Finalist) o Kai Wang (Ph.D. 2019, UCLA => Facebook System&Infrastructure) o Zhiqiang Zuo (PostDoc 2015--2018; UCI => Assistant Professor @ Nanjing University) o Lu Fang (Ph.D. 2017, UCI => Facebook AI, Co-creator of PyTorch and ONNX) o Keval Vora (Ph.D. 2017, Co-advised with Rajiv Gupta, UCR => Assistant Professor @ Simon Fraser University) o Shen Teng (M.S. 2021, UCLA => AWS) o Gaohong Liu (M.S. 2021, UCLA => RED (Xiaohongshu E-commerce) => ByteDance Seed) o Cheng Cai (M.S. 2020, UCLA => Facebook) o Bojun Wang (M.S. 2019, UCI => Arista Networks) o Guanzhou Hu (CSST 2019, UCLA => Ph.D. student at UWisc) o Tim Nguyen (B.S. 2017, UCI => Facebook) o Aftab Hussain (M.S. Fall 2017) o Matthew Hartz (B.S. 2015) o Jianfei Hu (M.S. 2015, UCI => Google) o Chengxi Li (2017 summer intern from Beckman High => Berkeley CS) o Emily Hu (2016 summer intern from Northwood High => Berkeley CS) o Lawrence Xu (2016 summer intern from University High => Purdue CS) o Louis Zhang (2014 summer intern from Troy High => Berkeley CS) o Ankur Gupta (2014 summer intern from University High => Regent's Scholar at UCSD CS) o Wendy Wei (2013 summer intern from University High => MIT CS) o Allen Min (2012 summer intern from Whitney High => UCI CS) o   Jonathon Tsai (2012 summer intern from Whitney High => UCI CS) Teaching o CS 239: Large-Scale Machine Learning Systems (Spring 2020) o CS 111: Operating Systems (Spring 2019, Winter 2020, Winter 2021) o CS 214: Big Data Systems (Fall 2018, Fall 2019, Fall 2020) Recent Services o  ASPLOS'26, PC Co-Chair Released Software Systems (Our Github Repos) The Open GPU Sharing Project Atlas: A hybrid data plane for remote memory applications DRust: An ownership-based DSM system VQPy: An object-oriented approach to video analytics queries Midas: Soft Memory as an OS service Hermit: A low-overhead and high-throughput swap system for remote memory via feedback-directed asynchrony Canvas: An isolatd and adaptive swap system for remote memory MemLiner: A remote-memory-friend runtime system Mako: A low-pause, high-throughput evacuating collector for memory-disaggregated datacenters Dorylus: Affordable and scalable GNN training with scale-out CPU servers and thousands of serverless threads JPortal: Java Virtual Machine support for Intel PT Chianina: An evolving graph system for fully context- and flow-sensitive static analysis Semeru: A memory-disaggregated managed runtime Reducto: an on-camera frame filtering system for efficient video analytics Grapple: A graph system for finite state property checking for very large systems RStream: A single-machine, disk-based graph mining system Graspan: A disk-based parallel graph system for dynamic transitive closure computation Facade: A compiler and runtime system for efficient Big Data systems Statistical debugging based on abstraction refinement PerfBlower: A performance problem amplification framework and an instrumentation specification language GraphQ: Analytical query processing based on abstraction refinement over very large graphs Resurrector: A new object lifetime profiler Demand-driven context-sensitive alias analysis for Java LeakChaser: A Java memory leak detector AJANA: A framework for source-code-level analysis of AspectJ software Why I Believe I am a Protestant Christian. I regularly attend and help with several campus fellowships at both UCLA and UC Irvine. How can one be a CS professor and a Christian? (collected by George Varghese) Contact Information harryxu at cs dot ucla dot edu http://www.cs.ucla.edu/~harryxu Office: Engineering VI, Room 496A Computer Science Department BOX 951596, UCLA Los Angeles, CA 90095-1596 Work: 310-794-7145 Last updated: June 8, 2018 Maintained by harryxu at cs dot cs dot ucla dot edu (replace dot with .)",
  "content_length": 8381,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:43"
}