{
  "name": "Guoqiang Li 0001",
  "homepage": "http://basics.sjtu.edu.cn/~liguoqiang",
  "status": "success",
  "content": "Guoqiang Li Guoqiang Li Associate Professor, Ph.D.(JAIST,2008) School of Computer Science, Shanghai Jiao Tong University, 800 Dongchuan Rd., Minhang Dist., Shanghai, 200240 China [Research Interests] [Experience] [Teaching] [Education] [Students] [Projects] [Publications] [Activities] [DBLP] [Contact Me] RESEARCH INTERESTS formal verification programming language theory zero-knowledge proofs and their applications knowledge reasoning and verification intelligent system verification and security A detailed list of current running projects is available at here. WORK EXPERIENCE Associate Professor School of Computer Science, Shanghai Jiao Tong University 2025.01 - Associate Professor School of Software, Shanghai Jiao Tong University 2014.01 - 2024.12 Guest Associate Professor Research and Development Center for Smart Mobility, Kyushu University 2016.12-2020.03 Academic Visitor Department of Computer Science, University of Oxford 2015.07-2016.07 Lecturer School of Software, Shanghai Jiao Tong University 2009.04-2013.12 Liaison Staff Bureau of International Cooperation, NSFC 2009.12-2010.12 Posdoc. Researcher NCES, Graduate School of Information Science, Nagoya University 2008.04-2009.03 TEACHING Present Lectures [Lecture calendar this semester] SE3308, Algorithm Design, for undergraduates, autumn semester AI1401, Algorithm Design and Analysis, for undergraduates from School of Mathematics, autumn semester EI6303, Algorithm Design and Analysis, for graduates, spring semester Past Lectures SE2324, Mathematical Foundation for Computer Sciences, for undergraduates, 2021-2023 SE3352, Algorithm Design (2 credits), for undergraduates, 2021-2023 SE121, Design and Implementation of Algorithms, for undergraduates, 2020 SE222, Principle of Algorithms, for undergraduates, 2016-2019 SE226, Computability Theory, for undergraduates, 2012-2014 GE6001, Scientific Writing, Integrity and Ethics, for graduates, 2019-2024 X037515, Fundamentals of Programming Languages, for graduates, 2017 EDUCATIONAL BACKGROUND PhD., Formal Verification Ogawa Lab, Japan Advanced Institute of Science and Technology 2005.4-2008.3 MSc., Computer Software and Theory BASICS, Department of CST, Shanghai Jiao Tong University 2002.9-2005.3 BSc., Computer Software Department of CST, Taiyuan University of Technology 1997.9-2001.7 STUDENTS A list of my students is available here Those who are looking for doctorial or master supervision are suggested to click here. REPRESENTATIVE PROJECTS Methodology and Implementation of Formal Verification on Circuit Programs for Zero-Knowledge Proofs, PI, NSFC General Program, 2026-2029 Theoretical Analysis of SAT Algorithms and Novel SAT Solvers, main contributor, NSFC Key Program, 2026-2030 Research on Universal Zero-Knowledge Virtual Machines and Efficient Blockchain Accumulators, main contributor, Special Project on Key Technologies in Blockchain, Shanghai Science and Technology Innovation Action Plan, 2024-2025 Scalable and Certifiable Verification of Deep-Learning Enabled Systems, main contributor, NSFC-ISF Joint Program, 2021-2024 Verification Models and Efficient Algorithms of Asynchronously Communicating Programs Based on Basic Parallel Processes, PI, NSFC General Program, 2019-2022 Reliability of Safety Critical Software Systems, Sub-project PI, NSFC Key Program, 2018-2022 Theory and Methodology of Asynchronously Communicating Program Analysis, PI, NSFC General Program, 2017 Verification on Reachability Problem of Time-Sensitive Pushdown Systems, PI, NSFC General Program, 2015-2018 Methodology of Program Analysis Based on Automata Model Checking with Time Issues, PI, NSFC Youth, 2012-2014 SELECTED PUBLICATIONS A list sorted by categories is available here Conferences and Workshops: Weijie Wu, Ling-I Wu, Guoqiang Li*. CrossPyEval: Enhancing LLM-based Evaluation of Low-Resource Code via Code Translation. In Proceedings of the 17th Asian Conference on Machine Learning (ACML'25), accepted Haoyu Wei, Jingyu Ke, Ruibang Liu, and Guoqiang Li*. ZK-ProVer: Proving Programming Verification in Non-Interactive Zero-Knowledge Proofs. In Proceedings of the 26th International Conference on Formal Engineering Methods (ICFEM'25), LNCS 16229, 209-227, 2025 Ling-I Wu, Weijie Wu, Minyu Chen, Jianxin Xue, Guoqiang Li*. Co-Eval: Augmenting LLM-based Evaluation with Machine Metrics. In Proceedings of the The 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP'25), Association for Computational Linguistics, 25765-25787, 2025 Minyu Chen, Guoqiang Li*, Ling-I Wu, Ruibang Liu. DCE-LLM: Dead Code Elimination with Large Language Models. In Proceedings of the 2025 Annual Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics (NAACL'25), Association for Computational Linguistics, 9942-9955, 2025 Jingyu Ke, Hongfei Fu, Hongming Liu, Zhouyue Sun, Liqian Chen and Guoqiang Li. Affine Disjunctive Invariant Generation with Farkas' Lemma. In Proceedings of the 26th International Conference on Verification, Model Checking, and Abstract Interpretation (VMCAI'25), LNCS 15529, 187-213, 2025 Minyu Chen, Guoqiang Li*, Ling-I Wu, Ruibang Liu, Yuxin Su, Xi Chang, Jianxin Xue. Can Language Models Pretend Solvers? Logic Code Simulation with LLMs. In Proceedings of the 10th International Symposium on Dependable Software Engineering: Theories, Tools and Applications (SETTA'24), LNCS 15469, 102-121, 2024 Yuchen Li, Hongfei Fu, Haowen Long, Guoqiang Li. Constraint Based Invariant Generation with Modular Operations. In Proceedings of the 10th International Symposium on Dependable Software Engineering: Theories, Tools and Applications (SETTA'24), LNCS 15469, 64-84, 2024 Hongming Liu, Guoqiang Li*. Empirically Scalable Invariant Generation Leveraging Divide-and-Conquer with Pruning. In Proceedings of the 18th International Symposium on Theoretical Aspects of Software Engineering (TASE'24), LNCS 14777, 324-342, 2024 Jingyang Li, Guoqiang Li*. HOBAT: Batch Verification for Homogeneous Structural Neural Networks. In Proceedings of the 38th IEEE/ACM International Conference on Automated Software Engineering (ASE'23), 1276-1287, 2023 Chenhao Shi, Hao Chen, Ruibang Liu, Guoqiang Li*. Data-Flow-Based Normalization Generation Algorithm of R1CS for Zero-Knowledge Proof. In Proceedings of the 28th IEEE Pacific Rim International Symposium on Dependable Computing (PRDC'23), IEEE Society, 191-197, 2023 Minyu Chen, Guoqiang Li*, Chen Ma, Jingyang Li, Hongfei Fu. Repo4QA: Answering Coding Questions via Dense Retrieval on GitHub Repositories. In Proceedings of the 29th International Conference on Computational Linguistics, (COLING'22), International Committee on Computational Linguistics, 1580-1592, 2022 Hongming Liu, Hongfei Fu, Zhiyong Yu, Jiaxin Song, Guoqiang Li. Scalable Linear Invariant Generation with Farkas Lemma. In Proceedings of the 37th ACM SIGPLAN International Conference on Object-Oriented Programming Systems, Languages, and Applications (OOPSLA'22), Proceedings of the ACM on Programming Languages Vol.6 (OOPSLA2): 204-232, 2022 Qunhao Sha, Qizhe Yang, Guoqiang Li*. A Parallel Implementation of Liveness on Knowledge Graphs under Label Constraints. In Proceedings of the 15th IEEE International Symposium on Theoretical Aspects of Software Engineering (TASE'21), IEEE Society, 103-110, 2021 Jieshan Chen, Mulong Xie, Zhenchang Xing, Chunyang Chen, Xiwei Xu, Liming Zhu, Guoqiang Li. Object Detection for Graphical User Interface: Old Fashioned or Deep Learning or a Combination?. In Proceedings of the ACM Joint Meeting on the 18th European Software Engineering Conference and the 28 Symposium on the Foundations of Software Engineering (ESEC/FSE'20), 1202-1214, 2020 Jieshan Chen, Chunyang Chen*, Zhenchang Xing, Xiwei Xu, Liming Zhu, Guoqiang Li*, Jinshui Wang*. Unblind Your Apps: Predicting Natural-Language Labels for Mobile GUI Components by Deep Learning. In Proceedings of the 42nd International Conference on Software Engineering (ICSE'20), 322-334, 2020 (Distinguished paper award!) Dehai Zhao, Zhenchang Xing, Chunyang Chen, Xiwei Xu, Liming Zhu, Guoqiang Li*, Jinshui Wang*. Seenomaly: Vision-Based Linting of GUI Animation Effects Against Design-Don't Guidelines. In Proceedings of the 42nd International Conference on Software Engineering (ICSE'20), 1286-1297, 2020 Xiaoxue Ren, Zhenchang Xing, Xin Xia, Guoqiang Li, Jianling Sun. Discovering, Explaining and Summarizing Controversial Discussions in Community Q&A Sites. In Proceedings of the 34th IEEE/ACM International Conference on Automated Software Engineering (ASE'19), 151-162, 2019 Dehai Zhao, Zhenchang Xing, Chunyang Chen*, Xin Xia*, Guoqiang Li*. ActionNet: Vision-based Workflow Action Recognition From Programming Screencasts. In Proceedings of the 41st ACM/IEEE International Conference on Software Engineering (ICSE'19), 350-361, 2019 Haitao Zhang, Ayang Tuo, Guoqiang Li. Model Checking is Possible to Verify Large-scale Vehicle Distributed Application Systems. In Proceedings of the 26th Design, Automation & Test in Europe Conference & Exhibition (DATE'19), 594-597, 2019 Muhammad Jahanzeb Khan, Adeel Zafar, Valeriia Tumanian, Yue Ding, Guoqiang Li*. Object Detection Boosting using Object Attributes in Detect and Describe Framework. In Proceedings of the 31st International Conference on Tools with Artificial Intelligence (ICTAI'19), 886-893, 2019 Chunyang Chen, Xi Chen, Jiamou Sun, Zhenchang Xing, Guoqiang Li*. Data-Driven Proactive Policy Assurance of Post Quality in Community Q&A Sites. In Proceedings of the 21st ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW'18), ACM, Vol. 2, 33, 2018 Haitao Zhang, Guoqiang Li, Xiaohong Li, Zhuo Cheng, Jinyun Xue, Shaoying Liu. An Efficient Approach for Verifying Automobile Distributed Application Systems on Timing Property. In Proceedings of the 40th International Conference on Software Engineering (ICSE'18), IEEE/ACM Society, 230-231, 2018 Yuwei Wang, Guoqiang Li, Shoji Yuen. Nested Timed Aut",
  "content_length": 20332,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:32"
}