{
  "name": "Guosheng Lin",
  "homepage": "https://guosheng.github.io",
  "status": "success",
  "content": "Welcome | Guosheng’s homepage Guosheng Lin Associate Professor Block N4, 02c-93, School of Computer Science and Engineering, Nanyang Technological University, Singapore. E-mail: gslin{At}ntu.edu.sg or guosheng.lin{At}gmail.com Research interests: computer vision, scene understanding, 3D deep learning, Generative AI, etc. Join our group I occasionally have openings for interns, research assistants, PhD students and postdoctoral researchers. Please email me with your CV for enquiries. We regret that only shortlisted candidates will be contacted. Thanks for your understanding. Experience & Education 2023 - present: Associate Professor with Tenure, Nanyang Technological University, Singapore. 2017 - 2023: Assistant Professor, Nanyang Technological University, Singapore. 2014 - 2017: Research Fellow, Australian Centre for Robotic Vision (ACRV), The University of Adelaide. Closely working with Prof. Chunhua Shen, Prof. Ian Reid, and Prof. Anton v.d. Hengel 2010 - 2014: PhD, The University of Adelaide, Australia; Supervisors: Prof. Chunhua Shen (principal), Prof. David Suter and Prof. Tat-Jun Chin. 2003 - 2007; 2007 - 2010: B.Eng and M.Eng, respectively, from South China University of Technology, Guangzhou, China. Awards Google PhD fellowship, Australia, 2014, Link or Link. Dean’s Commendation for Doctoral Thesis Excellence, The University of Adelaide, 2014 Publications Google Scholar: Link Conference publications: Link Journal publications: Link Services Associate Editor for IEEE Transactions on Multimedia (TMM), 2024 - present; Associate Editor for IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2023 - present; Standard Editor for Artificial Intelligence Journal; CVPR 2024/2025 Area Chair; AAAI 2023/2024 Senior Program Committee (SPC) Member; ACM Multimedia 2024 Area Chair, Open Source Software Chair; PRCV 2024 Senior Area Chair; IJCAI 2023 Senior Program Committee (SPC) Member; ACCV 2022 Area Chair, ACCV 2018 Local Arrangement Chair; Reviewers for CVPR, ICCV, ECCV, NeurIPS, TPAMI, IJCV, TIP, TMM, TCSVT etc. Research grants (selected) Singapore MOE Tier-2 research grant (PI) AI.Singapore research grant (PI) A*STAR MTC research grants (PI) Delta-NTU Corp Lab research grants (PI) S-lab Research Grants (PI) Alibaba-NTU research grant (PI) Webank-NTU research grant (PI) Hyundai research grant (PI) OPPO research grant (PI) Tencent-NTU research grant (PI) Teaching Introduction to Statistical Machine Learning (COMP SCI 4401/7401), 2015/2016, University of Adelaide (Guest lecturer) Data Structures, Course code: CE/CZ1007, 2019, Nanyang Technological University Special Topic - image segmentation, Course code: DM6190/CE6190, 2017-present, Nanyang Technological University Data Analytics and Mining, Course code: CZ/CE4032, SC4020, 2021-present, Nanyang Technological University Data Mining, Course code: SD6125, 2023-present, Nanyang Technological University Research Group Research group: Link",
  "content_length": 2951,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:35"
}