{
  "name": "Guoxin Su",
  "homepage": "https://documents.uow.edu.au/~guoxin",
  "status": "success",
  "content": "Dr. Guoxin Su's Homepage Homepage of Dr. Guoxin Su Home Research Grants Publications Services Teaching About Me I am a senior lecturer in the School of Computing and Information Technology at University of Wollongong (UOW). Before joining UOW, I was a senior research fellow at National University of Singapore (NUS). I received a PhD degree in computer science from the University of Technology Sydney (UTS) in 2013. I work on software engineering (SE) and artificial intelligence (AI). In SE, my research focuses on probabilistic verification, self-adaptive software systems, and event-streaming software systems. In AI, I am interested in autonomous agents, reneforcement learning, and data mining. At UOW I supervise and co-supervise a number of PhD and research masters students. If you think that you can work with me at a topic in the above areas, please feel free to contact me. News Call for submission: MDPI AI Special Issue Deep Reinforcement Learning for Multi-Agent Systems (Deadline 31 January 2024) Publicity co-chair of 2023 7th International Conference on Artificial Intelligence, Automation and Control Technologies (AIACT 2023), Kunming, China from February 24-26, 2023 Selected Publications Multi-Objective Task Assignment and Multiagent Planning with Hybrid GPU-CPU Acceleration, NASA Formal Methods (NFM), 2023 Quantitative verification for monitoring event-streaming systems, IEEE Transactions in Software Engineering (TSE), 2022 Multiagent Task Allocation and Planning with Multi-Objective Requirements, AAMAS 2021 Wavelet packet analysis for speaker-independent emotion recognition, Neurocomputing, 2021 Verifying the long-run behavior of probabilistic system models in the presence of uncertainty, ESEC/FSE'18 Probabilistic model checking of perturbed MDPs with applications to cloud computing, ESEC/FSE'17 ProEva: runtime proactive performance evaluation based on continuous-time Markov chains, ICSE 2017 Towards complex activity recognition using a Bayesian network-based probabilistic generative framework, Pattern Recognition (2017) Framework of mining semantic-based probabilistic event relations for complex activity recognition, Information Science (2017) Asymptotic perturbation bounds for probabilistic model checking with empirically determined probability parameters, IEEE Transactions on Software Engineering (TSE), 2016 Centre for Artificial Intelligence (CAI), School of Computing and Information Technology, Faculty of Engineering and Information Sciences, University of Wollongong Wollongong, NSW 2522, Australia Office: 3.227 Phone: +61 2 4221 8092 Email: guoxin\"at\"uow.edu.au",
  "content_length": 2619,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:37"
}