{
  "name": "Guoxing Chen",
  "homepage": "https://donnod.github.io",
  "status": "success",
  "content": "Guoxing Chen's Homepage Guoxing Chen Tenure-Track Associate Professor School of Computer Science Shanghai Jiao Tong University Office: SEIEE Building 3-525 Email: guoxingchen AT sjtu DOT edu DOT cn [Google Scholar] [Github] [Bitbucket] Openings We welcome students (both undergrad and graduate) with interests in topics related to computer security and privacy, including system security/hardware security/side channels/data privacy/trusted execution environments/privacy-preserving technologies etc. Please drop me an email for more information. Visit our lab website at https://nsec.sjtu.edu.cn/. Short Bios I am currently a tenure-track associate professor at the School of Computer Science, Shanghai Jiao Tong University (SJTU). Before joining SJTU in March 2021, I was a research scientist at Facebook, Inc. I received my Ph.D. degree from the Ohio State University in 2019. My advisors are Prof. Ten H. Lai and Prof. Yinqian Zhang. I obtained my master's and bachelor's degrees from SJTU in 2013 and 2010 respectively. Selected Publication 2025 [CCS'25] PipID: Light-Pupillary Response Based User Authentication for Virtual Reality Muchen Pan, Yan Meng, Yuxia Zhan, Guoxing Chen, Haojin Zhu ACM Conference on Computer and Communications Security, Taipei, Taiwan, China, Oct. 13-17, 2025. [Security'25] EKC: A Portable and Extensible Kernel Compartment for De-Privileging Commodity OS Jiaqin Yan, Qiujiang Chen, Shuai Zhou, Yuke Peng, Guoxing Chen, Yinqian Zhang USENIX Security Symposium, Seattle, WA, USA, Aug. 13-15, 2025. [Security'25] Depth Gives a False Sense of Privacy: LLM Internal States Inversion Tian Dong, Yan Meng, Shaofeng Li, Guoxing Chen, Zhen Liu, Haojin Zhu USENIX Security Symposium, Seattle, WA, USA, Aug. 13-15, 2025. [EuroS&P'25] LATTE: Layered Attestation for Portable Enclaved Applications [pdf] [code] Haoxuan Xu*, Jia Xiang*, Zhen Huang, Guoxing Chen, Yan Meng, Haojin Zhu IEEE European Symposium on Security and Privacy, Venice, Italy, Jun. 30-Jul. 4, 2025. (*co-first authors) [INFOCOM'25] The Feasibility of Location Anonymity: An Empirical Study towards a Real-world Location Privacy Protection System in Takeout Services [pdf] Lu Zhou, Ruoxu Yang, Lichuan Ma, Guoxing Chen, Haojin Zhu, Li Yang, Qingqi Pei, Qiang Li IEEE International Conference on Computer Communications, London, United Kingdom, May. 19-22, 2025. [NDSS'25] A Formal Approach to Multi-Layered Privileges for Enclaves [pdf] [code] Ganxiang Yang, Chenyang Liu, Zhen Huang, Guoxing Chen, Hongfei Fu, Yuanyuan Zhang, Haojin Zhu Network and Distributed System Security Symposium, San Diego, CA, USA, Feb. 24-28, 2025. [NDSS'25] The Philosopher's Stone: Trojaning Plugins of Large Language Models [pdf] [code] Tian Dong, Minhui Xue, Guoxing Chen, Rayne Holland, Yan Meng, Shaofeng Li, Zhen Liu, Haojin Zhu Network and Distributed System Security Symposium, San Diego, CA, USA, Feb. 24-28, 2025. 2024 [CCS'24] VPVet: Vetting Privacy Policies of Virtual Reality Apps [pdf] Yuxia Zhan, Yan Meng, Lu Zhou, Yichang Xiong, Xiaokuan Zhang, Lichuan Ma, Guoxing Chen, Qingqi Pei, Haojin Zhu ACM Conference on Computer and Communications Security, Salt Lake City, UT, USA, Oct. 14-18, 2024. [CCS'24] Unveiling Collusion-Based Ad Attribution Laundering Fraud: Detection, Analysis, and Security Implications [pdf] Tong Zhu, Chaofan Shou, Zhen Huang, Guoxing Chen, Xiaokuan Zhang, Yan Meng, Shuang Hao, Haojin Zhu ACM Conference on Computer and Communications Security, Salt Lake City, UT, USA, Oct. 14-18, 2024. [ASIACCS'24] SoK: Understanding Design Choices and Pitfalls of Trusted Execution Environments [pdf] Mengyuan Li, Yuheng Yang, Guoxing Chen, Mengjia Yan, Yinqian Zhang ACM ASIA Conference on Computer and Communications Security, Singapore, Jul. 1-5, 2024. [SEED'24] SoK: Opportunities for Accelerating Multi-Party Computation via Trusted Hardware [pdf] Tong Liu, Zhen Huang, Jiaao Li, Jianyu Niu, Guoxing Chen, Yinqian Zhang International Symposium on Secure and Private Execution Environment Design, Orlando, FL, USA, May. 16-17, 2024. 2023 [Globecom'23] Privacy Computing with Right to Be Forgotten in Trusted Execution Environment [pdf] Hui Liu, Hongzhi Luo, Shaofeng Li, Tian Dong, Guoxing Chen, Yan Meng, Haojin Zhu IEEE Global Communications Conference, Kuala Lumpur, Malaysia, Dec. 4-8, 2023. [Security'23] Reusable Enclaves for Confidential Serverless Computing [pdf] [code] Shixuan Zhao, Pinshen Xu, Guoxing Chen, Mengya Zhang, Yinqian Zhang, Zhiqiang Lin USENIX Security Symposium, Anaheim, CA, USA, Aug. 9-11, 2023. [Security'23] POLICYCOMP: Counterpart Comparison of Privacy Policies Uncovers Overbroad Personal Data Collection Practices [pdf] Lu Zhou, Chengyongxiao Wei, Tong Zhu, Guoxing Chen, Xiaokuan Zhang, Suguo Du, Hui Cao, Haojin Zhu USENIX Security Symposium, Anaheim, CA, USA, Aug. 9-11, 2023. [NDSS'23] RAI2: Responsible Identity Audit Governing the Artificial Intelligence [pdf] Tian Dong, Shaofeng Li, Guoxing Chen, Minhui Xue, Haojin Zhu, Zhen Liu Network and Distributed System Security Symposium, San Diego, CA, USA, Feb. 27-Mar. 3, 2023. 2022 [TDSC] Securing TEEs With Verifiable Execution Contracts [link] [code] Guoxing Chen, Yinqian Zhang IEEE Transactions on Dependable and Secure Computing, Publication Jul. 29, 2022, Volume 20, Issue 4. [Security'22] MAGE: Mutual Attestation for a Group of Enclaves without Trusted Third Parties [pdf] [code] Guoxing Chen, Yinqian Zhang USENIX Security Symposium, Boston, MA, USA, Aug. 10-12, 2022. [CVPR'22] Fingerprinting Deep Neural Networks Globally via Universal Adversarial Perturbations [pdf] Zirui Peng, Shaofeng Li, Guoxing Chen, Cheng Zhang, Haojin Zhu, Minhui Xue Conference on Computer Vision and Pattern Recognition, New Orleans, LA, USA, Jun. 18-24, 2022. [NDSS'22] Multi-Certificate Attacks Against Proof-of-Elapsed-Time and Their Countermeasures [pdf] Huibo Wang, Guoxing Chen, Yinqian Zhang, Zhiqiang Lin Network and Distributed System Security Symposium, San Diego, CA, Apr. 24-28, 2022. 2021 [Security'21] Towards Formal Verification of State Continuity for Enclave Programs [pdf] Mohit Kumar Jangid, Guoxing Chen, Yinqian Zhang, Zhiqiang Lin USENIX Security Symposium, Virtual, Aug. 11-13, 2021. [DIMVA'21] SPECULARIZER: Detecting Speculative Execution Attacks via Performance Tracing [pdf] Wubing Wang, Guoxing Chen, Yueqiang Cheng, Yinqian Zhang, Zhiqiang Lin Conference on Detection of Intrusions and Malware & Vulnerability Assessment, Virtual, Jul. 7-11, 2021. 2020 and before [IEEE Secur & Priv] SgxPectre: Stealing Intel Secrets from SGX Enclaves via Speculative Execution [link] Guoxing Chen, Sanchuan Chen, Yuan Xiao, Yinqian Zhang, Zhiqiang Lin, Ten H. Lai IEEE Security & Privacy, Publication Jan. 23, 2020, Volume 18, Issue 3. [DSC'19] Defeating Speculative-Execution Attacks on SGX with HyperRace [pdf] Guoxing Chen, Mengyuan Li, Fengwei Zhang, Yinqian Zhang IEEE Conference on Dependable and Secure Computing, Hangzhou, China, Nov. 18-20, 2019. [CCS'19] OPERA: Open Remote Attestation for Intel’s Secure Enclaves [pdf] [code] Guoxing Chen, Yinqian Zhang, Ten-Hwang Lai ACM Conference on Computer and Communications Security, London, UK, Nov. 11-15, 2019. [EuroS&P'19] SgxPectre: Stealing Intel Secrets from SGX Enclaves via Speculative Execution [pdf] [code] Guoxing Chen, Sanchuan Chen, Yuan Xiao, Yinqian Zhang, Zhiqiang Lin, Ten H. Lai IEEE European Symposium on Security and Privacy, Stockholm, Sweden, Jun. 17-19, 2019. [S&P'18] Racing in Hyperspace: Closing Hyper-Threading Side Channels on SGX with Contrived Data Races [pdf] Guoxing Chen*, Wenhao Wang*, Tianyu Chen, Sanchuan Chen, Yinqian Zhang, XiaoFeng Wang, Ten-Hwang Lai, Dongdai Lin IEEE Symposium on Security and Privacy, San Francisco, CA, USA, May. 21-23, 2018. (*co-first authors) [INFOCOM'18] Differentially Private Access Patterns for Searchable Symmetric Encryption [pdf] [code] Guoxing Chen, Ten-Hwang Lai, Michael Reiter, Yinqian Zhang IEEE International Conference on Computer Communications, Honolulu, HI, USA, Apr. 14-19, 2018. [CCS'17] Leaky Cauldron on the Dark Land: Understanding Memory Side-Channel Hazards in SGX [pdf] Wenhao Wang, Guoxing Chen, Xiaorui Pan, Yinqian Zhang, XiaoFeng Wang, Vincent Bindschaedler, Haixu Tang, Carl A. Gunter ACM Conference on Computer and Communications Security, Dallas, TX, USA, Oct. 30-Nov. 3, 2017. [ICDCS'17] EV-Matching: Bridging Large Visual Data and Electronic Data for Efficient Surveillance [pdf] Gang Li, Fan Yang, Guoxing Chen, Qiang Zhai, Xinfeng Li, Jin Teng, Junda Zhu, Dong Xuan, Biao Chen and Wei Zhao IEEE International Conference on Distributed Computing Systems, Atlanta, GA, USA, Jun. 5-8, 2017. [INFOCOM'16] Flash-Loc: Flashing Mobile Phones for Accurate Indoor Localization [pdf] Fan Yang, Qiang Zhai, Guoxing Chen, Adam C. Champion, Junda Zhu, Dong Xuan IEEE International Conference on Computer Communications, San Francisco, CA, USA, Apr. 10-15, 2016. [ICDCS'15] Crowd-ML: A Privacy-Preserving Learning Framework for a Crowd of Smart Devices [pdf] Jihun Hamm, Adam C. Champion, Guoxing Chen, Mikhail Belkin, Dong Xuan IEEE International Conference on Distributed Computing Systems, Columbus, OH, USA, Jun. 29-Jul. 2, 2015. [SAM'14] Detecting the Vulnerability of Multi-Party Authorization Protocols to Name Matching Attacks [pdf] Wenjie Lin, Guoxing Chen, Ten H. Lai, David Lee International Conference on Security and Management, Las Vegas, NV, USA, Jul. 21-24, 2014. [WCL] On Degrees of Freedom of Cognitive Networks with User Cooperation [link] Guoxing Chen, Zhengzheng Xiang, Changqing Xu, Meixia Tao IEEE Wireless Communications Letters, Publication Set. 20, 2012, Volume 1, Issue 6. Professional Services Program Committee Member ACM Conference on Computer and Communications Security (CCS) 2022, 2023, 2024, 2025 USENIX Security Symposium 2023, 2024, 2025, 2026 Network and Distributed System Security Symposium (NDSS) 2026 ACM Asia Conference on Computer and Communications Security (ASIACCS) 2021, 2022, 2025 EAI International Conference on Security a",
  "content_length": 10958,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:36"
}