{
  "name": "Guozhu Meng",
  "homepage": "https://impillar.github.io",
  "status": "success",
  "content": "About Me - DR. MENG GUOZHU’s HOMEPAGE DR. MENG GUOZHUAssociate Professor @ Institute of Information Engineering, Chinese Academy of Sciences/ University of Chinese Academy of Sciences Follow China Email Github Google Scholar ORCIDDr. Guozhu Meng obtained his Ph.D degree from the School of Computer Science and Engineering, Nanyang Technological University, Singapore at 2017. His supervisors are the Full Prof. Liu Yang and Full Prof. Zhang Jie.He joined Institute of Information Engineering of Chinese Academy of Sciences as Associate Professor in 2018. His research focuses on system security and artificial intelligence security as follows:Android security. We employ multiple techniques such as static analysis and machine learning to detect Android malware (ISSTA 2016, IJCNN 2016). With evolutionary algorithms, we conduct a work to evaluate existing anti-malware tools (AsiaCCS 2016, TIFS 2017). Another work has been done, with regard to Android ecosystem, to analyze the spread model of Android malware across multiple markets (TIFS 2019), security analysis of third-party libraries (C&S 2019), and security patches of apps across versions.Big data analysis. We have collected millions of Android apps and malware, and conducted a work to try to learn knowledge from the big data such as bug detection and crash analysis (FSE 2017, ICSE 2018), automated GUI code generation (ICSE 2018), malware characteristics (ASE 2019), evolution and trend.Vulnerability detection. We attempt to detect weaknesses existing in Android apps, especially in security-critical apps such as financial apps (FSE 2019, ICSE 2020). In addition, we perform a large-scale analysis of vulnerabilities in five C projects and identify around four thousand security bugs among them (ICSE 2020), of which the data is released at https://github.com/twelveand0/CarrotsBlender.AI Security and Privacy. We have conducted a comprehensive survey on security and privacy of deep learning systems which has been accepted by IEEE Transactions on Software Engineering (https://arxiv.org/abs/1911.12562). We are also interested in protecting deep learning system from model stealing (USENIX Sec 2021), backdoor and model inversion.",
  "content_length": 2200,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:37"
}