{
  "name": "Gurminder Singh",
  "homepage": "http://faculty.nps.edu/gsingh",
  "status": "success",
  "content": "Gurminder's Profile Gurminder Singh, Ph.D. Professor, Computer Science Director, Center for the Study of Mobile Device and Communications Glassgow East - 108 Naval Postgraduate School Monterey, California 93943 gsingh@nps.edu Gurminder Singh is a Professor of Computer Science and Director of the Center for the Study of Mobile Devices and Communications at the Naval Postgraduate School (NPS), CA. His primary area of focus is wireless and handheld device technology. He is currently involved in research in Mobile Devices and Wireless Sensor Networks. Prior to NPS, he was the President and CEO of NewsTakes, Inc., a company specializing in repurposing of multimedia content for delivery to wireless networks and devices. He has been involved in this area for the last 10 years. Prior to NewsTakes, Dr. Singh was Director at the Kent Ridge Digital Lab (now I2R) where his responsibilities included strategic directions for research, management of research staff, and commercialization of intellectual property. He led an R&D lab focused on a variety of research themes including video and audio processing, PDAs for students, and online learning communities for children. His lab contributed significantly to the formation of the MPEG-7 standard. As a senior researcher in the lab, he was deeply involved with research in networked media, user interface software, and networked virtual worlds. Dr. Singh has helped mentor and spin-off several start-ups in wireless, internet and multimedia in recent years. He has been on the management and advisory boards of start-up companies, and has advised companies and VCs on business plans, intellectual property issues, and management teams. Dr. Singh has been involved with ACM and IEEE for many years in organizing conferences, editing special issues of journals, and publishing in their journals. He has published extensively and edited special issues of the Communications of ACM, ACM Transactions on CHI, IEEE Multimedia and ACM Multimedia Systems etc. Prof. Singh founded the ACM Virtual Reality Software and Technology Conference in 1994 and co-chaired VRST 2005. He received his Ph.D. in Computing Science from the University of Alberta, Canada. C o u r s e s Fall 2012 cs4533 - Wireless Mobile Computing cs4535 - Mobile Devices Winter 2013 (Planned) cs4537 - Wireless Mobile Computing The material contained herein is made available for the purpose of peer review and discussion and does not necessarily reflect the views of the Department of the Navy or the Department of Defense. Navy or the Department of Defense",
  "content_length": 2569,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:41"
}