{
  "name": "Gurpur M. Prabhu",
  "homepage": "http://www.cs.iastate.edu/~prabhu",
  "status": "success",
  "content": "Gurpur Prabhu Skip to main content Gurpur Prabhu Position Associate Professor Gurpur Prabhu has been on the faculty of the department of Computer Science at Iowa State University since 1983. He obtained his bachelors degree in electrical engineering from the Indian Institute of Technology in Madras, his masters degree in computer science from the Indian Institute of Technology in Kanpur, and his doctoral degree in computer science from Washington State. He has a broad range of interests in computer science and information technology and has published numerous research papers and a textbook on computer architecture and machine-level programming. He has taught courses on object-oriented programming, parallel and distributed computing, and operating systems. He has been researching the area of innovative information technologies during the last two decades. His interdisciplinary efforts in IT have resulted in several publications in international conferences such as the Hawaii International Conference on System Sciences and the International Conference on Systems Integration. With the advent of Internet-enabling technologies and E-commerce applications, his research effort in enterprise integration architecture has moved in the direction of developing semantic-based mechanisms to provide true collaborative management of information. While the Internet has connected islands of locally networked computer systems, Dr. Prabhu's focus is on logically bridging isolated islands of data. By making data easy to access and easy to process, Dr. Prabhu's research will advance the state of the art in the development of information fusion applications for scientific discovery using Grid computing, and decision-making domains such as biological sciences, E-commerce, E-governance, and information analysis for combating crime and terrorism. Dr. Prabhu has supervised the research work of several doctoral and masters students. Contact Email prabhu@iastate.edu Phone 515-294-2212 229 Atanasoff 2434 Osborn Dr. Ames, IA 50011-1090 Download CV Education B.Tech (with distinction), 1975, Electronics Engineering, I.I.T. Madras, India M.Tech. 1978, Computer Science, I.I.T. Kanpur, India Ph.D. 1983, Computer Science, Washington State University Recent PublicationsIf you are looking for a Computer Architecture Tutorial which I created more than 20 years ago, this tutorial is NO LONGER AVAILABLE.  The university re-designed all its web pages about 10 years ago and this tutorial was deleted.  My apologies to viewers for not resurrecting it.“Phase Difference During Propagation of a Wave at a Given Instance on its Path,” Chandru Iyer and G M Prabhu, TechRxiv, January 20, 2024 https://www.techrxiv.org/doi/full/10.36227/techrxiv.170630131.13401408/v1\"Teleological Computations,\" Prabhakar Balakrishnan, G M Prabhu, M. S. Krishnamoorthy, TechRxiv. June 14, 2024.DOI: 10.36227/techrxiv.171837990.02330070/v1      DOI: 10.36227/techrxiv.171837990.02330070/v2“Measurement of Physical Quantities under Differently Calibrated Rulers and Clocks,” Chandru Iyer and G M Prabhu, TechRxiv, August 27, 2024, submitted to Physics Essays, https://www.techrxiv.org/users/679343/articles/1218660-measurement-of-physical-quantities-under-differently-calibrated-rulers-and-clocks\"Time Dilation and the Equivalence of Inertial Frames,\" Chandru Iyer and G. M. Prabhu, Preprint in Research Square and on TechRxiv and in Physics Essays “Refining Fortran Failed Images,” Weeks, Nathan, Luecke, Glenn R. and Prabhu, Gurpur IEEE/ACM 5th International Workshop on Extreme Scale Programming Models and Middleware (ESPM2020) held in conjunction with Supercomputing 2020.“Deep Learning: Extrapolation Tool for Ab Initio Nuclear Theory,” Gianina Negoita, James, Vary, Glenn Luecke, Gurpur Prabhu et al., Accepted in Physical Review C, 2019. “The performance and scalability of the SHMEM and corresponding MPI-3 routines on a Cray XC30,” (with Gianina Alina Negoita, Glenn Luecke, Marina Kraeva, and James Vary), 2017 IEEE 16th International Symposium on Parallel and Distributed Computing, pp. 62-69.“HPC-Bench: A Tool to Optimize HPC Benchmarking Workflow,” Negoita, Gianina Alina; Luecke, Glenn R.; Gadia, Shashi K.; Prabhu, Gurpur M, MINK 2017 Women in Computing Conference.“Lessons Learned in Teaching Computer Architecture,” (with Simanta Mitra), International Journal of Engineering Research and Science and Technology, 5 (4), pp. 92-98, November 2016.“Two leadership traits: Humility and Ethics,” EPH International Journal of Science and Engineering, 2 (11), pp. 1-10, December 2016.“A constructive formulation of the one-way speed of light,” (with Chandru Iyer), American Journal of Physics, 78 (2), pp. 195-203, 2010.“Evolving Graph Representation and Visualization,” (with A. Chapanond, M. S. Krishnamoorthy, and J. R. Punin), Journal of Computer Science, Informatics, and Electrical Engineering, 2 (1), pp. 1-50, 2010.“Synchronizing equivalent clocks across inertial frames,” (with Chandru Iyer), International Journal of Engineering Research and Science & Technology, 2 (2), pp. 8 – 17, May 2013.“On the infeasibility of superluminal velocities as an extension of special relativity,” (with Chandru Iyer), American International Journal of Contemporary Research, 3 (5), pp. 37-42, May 2013.“Moving Signals and their Measured Frequencies,” (with Chandru Iyer), International Journal of Engineering Research and Science and Technology, 2 (3), pp. 24-36, August 2013.\"Implementation of Semantic Bridge: Providing Programmable Access to Distributed Heterogeneous Data\" (with Prabhakar Balakrishnan), Journal of Computer Science, Informatics & Electrical Engineering, 2 (1), pp. 1-14, 2008.\"Design of Semantic Bridge: A generalized web service providing programmable access to distributed heterogeneous data\" (with Prabhakar Balakrishnan), Journal of Engineering, Computing and  Architecture, 1 (2), pp. 1-12, 2007. \"Lorentz transformations with arbitrary line of motion\" (with Chandru Iyer), Eur. J. Phys. 28 (2), pp. 183-190, 2007.\"Optimization rules in DLV for the bridge crossing problem\" (with Sayan Ranu and P. Balakrishnan), Journal of Engineering, Computing and Architecture, 1 (1), pp. 1-15, 2007.\"A variation of the clock paradox and a distinguishing feature of an inertial frame\" (with Chandru Iyer), Journal of Physical and Natural Sciences, 1 (1), pp. 1-8, 2007.\"Reply to comment on Lorentz transformations with arbitrary line of motion\" (with Chandru Iyer), Eur. J. Phys. 28 (3), pp. L15-L16, 2007.\"Composition of two Lorentz boosts through spatial and space-time rotations\" (with Chandru Iyer), Journal of Physical and Natural Sciences, 1 (2), pp. 1-8, 2007.\"Differing observations on the landing of the rod into the slot\" (with Chandru Iyer), Am. J. Phys. 74 (11), pp. 998-1001, 2006.\"Reversal in the time order of interactive events: collision of inclined rods\" (with Chandru Iyer), Eur. J. Phys. 27 (4), pp. 819-824, 2006.\"Programmable access to distributed data: Design of Semantic Bridge\"(with Prabhakar Balakrishnan),2nd IASTED International Conference on Communications, Internet, and Information Technology, Scottsdale,Arizona,pp.589-594,2003.\"Parallel Implementation of Gauss-Seidel Iteration,\" (with Lili Ju), Accepted in the Thirteenth IASTED International Conference on Parallel and Distributed Computing and Systems, August 2001. Neither Lili Ju nor Prabhu could attend the conference and the paper was not published in the conference proceedings.\"Design of parallel algorithm performance modeling and theoretical analysis of cluster computing,\" (with Hao Wang and Eugene Takle), submitted to the SIAM Journal on Scientific Computing.\"Modeling the evapotranspiration and energy partition of inhomogeneous agroecosystems,\" (with Hao Wang and Eugene Takle), submitted to the Journal of Applied Meteorology.\"On the relationship between drag and pressure coefficients for a porous shelterbelt,\" (with Hao Wang and Eugene Takle), accepted with modifications in Boundary-Layer Meteorology.\"Performance evaluation of climate simulation on a cluster of networked workstations,\" (with Hao Wang, Eugene Takle, and J. M. Shen), Proceedings of the International Conference on Parallel and Distributed Processing Techniques and Applications, 2000, pp. 2007-2013, CSREA Press.\"Evaluation of file access patterns using realistic I/O workloads for a cluster environment,\" (with Rajat Todi, Yuri Alexeev and John Gustafson), Proceedings of ParCo99 International Conference on Parallel Computing, Netherlands, 1999.\"Implementation and performance evaluation for a computation-intensive climate simulation application,\" (with Hao Wang, Eugene Takle, and Rajat Todi), Proceedings of ParCo99 International Conference on Parallel Computing, Netherlands, 1999.\"Programming is Writing: Why Programs must be Carefully Evaluated,\" Journal of Mathematics and Computer Education, Vol. 32, No. 3, Fall 1998, pp. 284-295 (with Gary Leavens, Albert Baker, Vasant Honavar, and Steve LaValle).\"Parallelizing a very high resolution climate model using clusters of workstations with PVM and performance and load balance analyses,\" (with Hao Wang and Eugene Takle), Proceedings of the International Conference on Parallel and Distributed Processing Techniques and Applications, 1998, pp. 1762-1765, CSREA Press.\"Distribution-Independent Hierarchical Algorithms for the N-body problem,\" Journal of Supercomputing, 12, 1998, pp. 303-323 (with Srinivas Aluru, John Gustafson, and Fatih Sevilgen).\"A Framework for Business Transformation,\" Journal of Microcomputer Applications, Vol. 17, No.1, 1998, pp. 1-7 (with Sree Nilakanta and Ashok Subramanian).\"Enterprise Integration: Art or Science?,\" Summer Conference of the Society for Software Engineering, June 1995.\"Truly distribution-independent algorithms for the N-body problem,\" Supercomputing '94, pp. 420-428 (with Srinivas Aluru and John Gustafson). Expanded version, upon invitation, has been accepted for publication in the Journal of Supercomputing.Computer Archite",
  "content_length": 10396,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:45"
}