{
  "name": "Gushu Li",
  "homepage": "https://sites.google.com/view/gushuli",
  "status": "success",
  "content": "Gushu Li's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationGushu LiGushu LiAssistant Professor (Jan 2023 - now)Computer and Information Science Department (Primary)Electrical and System Engineering Department (Secondary)School of Engineering and Applied ScienceUniversity of PennsylvaniaContact: gushuli at seas dot upenn dot eduOffice: Towne 278\"More is Different.\" -- Philip W. AndersonWelcome to my homepage! I am Gushu Li, an Assistant Professor in the Department of Computer and Information Science at the University of Pennsylvania. I lead the Penn Quantum System Lab.Quantum computing is an interdisciplinary field that involves mathematics, physics, computer science, electrical engineering, and so on. In our lab, we attack critical quantum computing problems of both scientific interest and practical usage. Our research endeavors range from software to hardware. Our research objective is to understand and develop powerful quantum computer systems by combining theoretical foundations and practical implementation. Join us on this transformative journey as we navigate the frontiers of quantum computing and explore the exciting possibilities it offers!Opening: I am looking for self-motivated Ph.D. students in the direction of quantum computing. Please send me an email with your CV if interested. I am in the process of assembling a team of students with a wide range of backgrounds and expertise.For 2025 Fall, I am particularly interested in recruiting a student with strong FPGA/digital design skills. Outstanding students with quantum-related background, especially students from underrepresented groups, are also encouraged to apply.Research Interest:Quantum Compiler; Quantum Programming Language;  Quantum Algorithm Optimization; Quantum Computer Architecture; Quantum Electronic Design Automation.Highlights and Impacts:I am happy to share that I just received the prestigious CAREER Award from NSF. Thank you for your support, NSF!Our research has been widely recognized by the community, including a Distinguished Paper Award at OOPSLA'20 and an NSF Quantum Information Science and Engineering Network (QISE-NET) Triplet Fellowship Grant. Our research output has been adopted by several industry and academia quantum software frameworks, and widely used in the community.Our qubit mapping algorithm SABRE [ASPLOS'19] has been selected as the default mapping algorithm in IBM's Qiskit, and has also been widely adopted by other quantum software frameworks, including Oak Ridge National Lab's XACC/QCOR compiler.Our Paulihedral compilation framework [ASPLOS'22] has been integrated into Qiskit.Our projection-based assertion technique [OOPSLA'20] has also been adopted by Quantinuum's TKET. Awards and Honors:2024, Academic Grant Program Award, NVIDIA2024, Rising Star Faculty Award, Intel2024, Faculty Early CAREER Award, NSF2022, Doctoral Student Travel Grant, UCSB2022, ECE Dissertation Fellowship, UCSB2021, Student Travel Grant, NanoCom2021, Quantum Information Science and Engineering Network (QISE-NET) Triplet Fellow Award, NSF2020, ACM SIGPLAN Distinguished Paper Award, OOPSLA2020, Young Student Fellow Award, DAC2020, Student Travel Grant, ASPLOS2019, Student Travel Grant, ASPLOS2017, Regents Fellowship, Department of Electrical and Computer Engineering, UCSB 2017, International Doctoral Recruitment Fellowship, UCSB2016, Student Travel Grant, VTS2016, University Unstricted Fellowship, UChicago2015, A. Richard Newton Young Student Fellow Scholarship, DAC 2015 ....... Media:\"How to Test a Quantum Program\" at ACM SIGPLAN blog PL Perspectives Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 3657,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:40"
}