{
  "name": "Gustavo Carneiro 0001",
  "homepage": "https://www.surrey.ac.uk/people/gustavo-carneiro",
  "status": "success",
  "content": "Prof Gustavo Carneiro | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Google Scholar ORCID ResearchGate LinkedIn Professor Gustavo Carneiro Professor of AI and Machine Learning +441483689801 g.carneiro@surrey.ac.ukAcademic and research departments Centre for Vision, Speech and Signal Processing (CVSSP), School of Computer Science and Electronic Engineering. AboutBiographyGustavo Carneiro is a Professor of AI and Machine Learning at the University of Surrey, UK. Before that, from 2019 to 2022, he was a Professor at the School of Computer Science at the University of Adelaide, an ARC Future Fellow, and the Director of Medical Machine Learning at the Australian Institute of Machine Learning. He joined the University of Adelaide as a senior lecturer in 2011, has become an associate professor in 2015 and a professor in 2019. In 2014 and 2019, he joined the Technical University of Munich as a visiting professor and a Humboldt fellow. From 2008 to 2011 Dr. Carneiro was a Marie Curie IIF fellow and a visiting assistant professor at the Instituto Superior Tecnico (Lisbon, Portugal) within the Carnegie Mellon University-Portugal program (CMU-Portugal). From 2006 to 2008, Dr. Carneiro was a research scientist at Siemens Corporate Research in Princeton, USA. In 2005, he was a post-doctoral fellow at the University of British Columbia and at the University of California San Diego. Dr. Carneiro received his Ph.D. in computer science from the University of Toronto in 2004. Expand biography Areas of specialism Machine Learning; Computer Vision; Medical Image Analysis My qualifications 2004 PhD University of Toronto, Canada 1999 MSc Instituto Militar de Engenharia, Brazil 1996 BSc Universidade Federal do Rio de Janeiro, BrazilPrevious roles 01 January 2019 - 30 November 2022 Full Professor University of Adelaide, Australia 01 March 2019 - 30 June 2019 Humboldt Fellow Technical University of Munich, Germany 01 March 2020 - 30 November 2022 Australian Research Council Future Fellow University of Adelaide, Australia 01 August 2014 - 31 January 2015 Humboldt Fellow Technical University of Munich, Germany 01 January 2018 - 30 November 2022 Director of Medical Machine Learning at the Australian Institute for Machine Learning University of Adelaide, Australia 01 January 2015 - 31 December 2018 Associate Professor University of Adelaide, Australia 17 July 2011 - 31 December 2014 Senior Lecturer University of Adelaide, Australia 01 January 2010 - 15 July 2011 Marie Curie International Incoming Fellow Instituto Superior Tecnico, Portugal 15 September 2008 - 31 December 2009 CMU-Portugal Visiting Professor Instituto Superior Tecnico, Portugal 01 January 2006 - 05 September 2008 Senior Research Scientist Siemens Corporate Research 01 January 2005 - 31 December 2005 NSERC Post-doctoral Fellow University of British Columbia, Canada 15 September 2004 - 15 December 2004 Post-doctoral Fellow University of California, San Diego Expand previous roles News 14 OCT 2025AI predicts future X-rays to help osteoarthritis patients and their doctors see what’s coming 10 AUG 2023AI could shorten the diagnostic journey of millions suffering from endometriosis In the media 14 October 2025 2025 AI predicts future X-rays to help osteoarthritis patients and their doctors see what’s coming Project supervisor Press release 01 March 2025 2025 ICLR2025 Oral presentation: Probabilistic Learning to Defer: Handling Missing Expert Annotations and Controlling Workload Distribution LinkedIN 27 April 2024 2024 Thrilled to share that my first fully authored textbook, \"Machine Learning with Noisy Labels,\" has been published! Book author Elsevier 10 August 2023 13 million pounds for 22 AI for health research projects PI for project \"People-centred Mammogram Analysis\" UKRI 09 November 2020 University of Adelaide using machine learning for endometriosis diagnosis Interviewee The Advertiser, Australia 16 July 2020 A new paradigm in medical image analysis Author Hospital and Healthcare Australia 12 October 2017 Aussie Robotics researchers say their work is ‘revolutionising’ the health sector Interviewee IT Wire 07 September 2018 Adelaide Uni scientists develop program to spot breast cancer Interviewee IT Wire 06 September 2018 AI-based breast cancer detection method inspired by a classic video game &nbsp; Interviewee Radiology Business 06 September 2018 Tetris-like program could speed breast cancer detection Interviewee Mirage News 07 June 2017 When are you going to die? Artificial Intelligence could tell you Supervisor of L. Oakden- Rayner, the interviewee The Technews Expand in the media ResearchResearch interestsI have a wide-range of research interests.  I am interested in applied research in medical image analysis and computer vision to theoretical research in machine learning. Expand research interests Research projects People-centred Mammogram Analysis (PecMan) Current generic AI models for mammogram analysis provide biased results for patients and inflexible analysis for radiologists, reducing patients’ and radiologists’ trust in such models. In this project, we introduce an innovative design strategy for the development of new mammogram analysis AI models to increase their usability and trust by cooperating and personalising to radiologists and producing fair and accurate classification for all patient cohorts. In addition to measuring model accuracy for all patients, this proposal will introduce new assessment measures to evaluate the integration of the model into clinical practice in terms of radiologist’s performance improvement and workflow disruptiveness, and also to test the generalisation of the model to all patient sub-groups. ARC Training Centre on Biomedical Analysis Delivering a workforce trained in the development of transformative technologies that will rapidly expand the Australian pharmaceutical, diagnostic and defence sector. Imagendo: Diagnosing endometriosis with imaging and artificial intelligence Development of new machine learning tools to help with the diagnosis of endometriosis from MRI and ultrasound Adapting Deep Learning for Real-world Medical Image Datasets Development of new machine learning tools to allow the training of models using poorly curated training sets Deep Reinforcement Learning for the Active Extraction and Visualisation of Optimal Biomarkers in Medical Images Development of new medical image analysis methods for survival analysis and visual biomarker discovery Automated Analysis of Multi-modal Medical Data using Deep Belief Networks Development of new medical image analysis methods that can diagnose breast cancer from mammograms and MRI Detection and segmentation of the left ventricle of the heart from ultrasound One of the first methods in the field to use deep learning for the detection and segmentation of the left ventricle of the heart from ultrasound Automatic Quantification of Tumour Hypoxia from Multi-modal Microscopy Images using Weakly-Supervised Learning Methods Development of new deep learning methods for the quantification of tumour hypoxia from multi-modal microscopy images using weakly-supervised learning methods Australian Centre for Robotic Vision Robotic Vision Australia is a national community of researchers and professionals, passionate about the potential for robotics, computer vision and AI to solve many of the world’s grand challenges. Robotic Vision Australia has been established to lead an agenda around Australia’s uptake of these innovative technologies and what we need to do to realise our potential as world leaders in this field. Printart Project This is a project that gathers researchers from the Instituto Superior Técnico, the Faculdade de Letras da  Universidade de Lisboa, and the Museu Nacional do Azulejo with the purpose of designing a software to aid the study and the identification of Portuguese tile art.Mainly due to the ease of reproduction and transportation, prints were used as the favoured means to make pictures and information available throughout the world. In this way, these art works quickly reached the hands of craftsman which used them as sources of inspiration, replicating them in different media, among which the tiles are particularly noteworthy. Trademark of Portuguese culture, the tiles have been produced continuously for five centuries, benefiting from the original prints in composition and theme, but using them freely; changing proportions, adding and removing figures, simplifying or enriching backgrounds, inverting figures, among other things. The project aims to develop a tool that enables the cross-reference of information, matching prints and tiles, so as to identify the original sou",
  "content_length": 585812,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:48"
}