{
  "name": "Guttorm Sindre",
  "homepage": "https://www.ntnu.edu/employees/guttorm.sindre",
  "status": "success",
  "content": "Guttorm Sindre - NTNU Guttorm Sindre Download press photo Download press photo Foto: Close Guttorm Sindre Professor Department of Computer Science guttorm.sindre@ntnu.no +4773594479 +4794430245 IT-bygget, 112, Gløshaugen, Sem Sælands vei 9 About Research areas: Software engineering, information systems, requirements engineering, conceptual modelling, safety and security requirements Publications 2025 Sindre, Guttorm; Kolås, Line; Munkvold, Robin Isfold. (2025) Kva seier generativ KI om kvalitet i IT-utdanning?. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Sindre, Guttorm; Kolås, Line; Munkvold, Robin Isfold; Nowostawski, Mariusz; Ringen, Håkon Einar Stokke; Vassbakk, Joakim Pettersen. (2025) Generative AI tools to propose summative assessment tasks. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Sindre, Guttorm; Kolås, Line. (2025) Mastery Learning as Gamification: Level-Up Through High-Transparency Assessments. Proceedings of the European Conference on Games Based Learning (ECGBL) Academic article Sindre, Guttorm; Hansen, Gabrielle. (2025) Meistringslæring: Inspirasjonsverkstad. Other presentation Sindre, Guttorm; Hansen, Gabrielle. (2025) Meistringslæring: Korleis kan du som faglærar utforme og gjennomføre eit emne med studentstyrt framdrift?. Læring om læring Academic article Sindre, Guttorm; Hansen, Gabrielle; Korpås, Guri Sivertsen; Vassbakk, Joakim Pettersen. (2025) Meistringslæring i MNT-fag: Kompetanse på ulike plan. Nordic Journal of STEM Education Academic article Sindre, Guttorm; Hansen, Gabrielle. (2025) A High-Transparency Approach to Mastery Learning in CS1: Mitigating Procrastination Despite Liberal Self-Pacing. Academic chapter/article/Conference paper Sindre, Guttorm. (2025) Mastery Learning in CS1 with High Transparency Tests: Challenges for Fairness Among Task Variants. IEEE Global Engineering Education Conference, EDUCON Academic article 2024 Sindre, Guttorm. (2024) Rettferd i variantoppgåver med tilfeldig trekking: Erfaringar frå kvalitetssikringsarbeid. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Hansen, Gabrielle; Sindre, Guttorm; Korpås, Guri Sivertsen; Vassbakk, Joakim Pettersen. (2024) La kvar student velje sitt eige tempo: Meistringslæring i intro programmering. Læring om læring Article in business/trade/industry journal Sindre, Guttorm; Hansen, Gabrielle. (2024) Mastery Learning in Introductory Programming: Running a Project Alongside a Test Ladder. Proceedings of the International CDIO Conference Academic article Torvatn, Tim Kristian Andreas; Dahl, Martha Torgeirdatter; Stock, Ingrid; Hjelle, Arild Sørum; Kjærland, Frode; Langbakk, Erik Ingve. (2024) Eksamen og vurdering 24 - Sluttrapport fra arbeidsgruppe ved NTNU. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Report 2023 Sindre, Guttorm; Hansen, Gabrielle; Korpås, Guri Sivertsen; Kirknes, Axel; Skøien, Johanne; Magnussen, Juni. (2023) Mastery learning in introductory programming: plan for a new course. Læring om læring Academic article Hansen, Gabrielle; Sindre, Guttorm. (2023) Assessment and feedback across various outcomes in project-courses: A department-wide study. Proceedings of the International CDIO Conference Academic article Sindre, Guttorm. (2023) AI Technology: Threats and Opportunities for Assessment Integrity in Introductory Programming. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article 2022 Lorås, Madeleine; Sindre, Guttorm; Trætteberg, Hallvard; Aalberg, Trond. (2022) Study Behavior in Computing Education—A Systematic Literature Review. ACM Transactions on Computing Education Academic article Tøndel, Inger Anne; Cruzes, Daniela Soares; JAATUN, Martin Gilje; Sindre, Guttorm. (2022) Influencing the security prioritisation of an agile software development project. Computers & Security Academic article Sindre, Guttorm; Haugset, Børge. (2022) Techniques for detecting and deterring cheating in home exams in programming. Academic chapter/article/Conference paper Sindre, Guttorm. (2022) Programmeringsoppgaver og auto-scoring: Inspera vs. andre løsninger. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article 2021 Meland, Per Håkon; Sindre, Guttorm; Bernsmed, Karin; Jaccheri, Letizia. (2021) Storyless cyber security: Modelling threats with economic incentives. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Meland, Per Håkon; Nesheim, Dag Atle; Bernsmed, Karin; Sindre, Guttorm. (2021) Assessing cyber threats for storyless systems. Journal of Information Security and Applications Academic article Sindre, Guttorm; Eitungjerde, Sara; Bendiksen, Anders; Braaten, Bjørn Otto; Hansen, Gabrielle; Hartnik, Lukas. (2021) Fremtidens teknologistudier (FTS), grupperapport: D - Pedagogiske virkemidler. NTNU NTNU Report Sindre, Guttorm. (2021) Flervalg til 20-minutts problemløsningsoppgaver. Nordic Journal of STEM Education Article in business/trade/industry journal Sindre, Guttorm. (2021) Kan fusk på hjemmeeksamen forhindres?. Nordic Journal of STEM Education Article in business/trade/industry journal Chirumamilla, Aparna; Sindre, Guttorm. (2021) E-exams in Norwegian higher education: Vendors and managers views on requirements in a digital ecosystem perspective. Computers & Education Academic article 2020 Chirumamilla, Aparna; Sindre, Guttorm; Duc, Anh Nguyen. (2020) Cheating in e-exams and paper exams: the perceptions of engineering students and teachers in Norway. Assessment & Evaluation in Higher Education Academic article Langford, Malcolm; Larsen, Johanne Maria Rohde; Vandvik, Vigdis; Vabø, Ørjan Sørstrønen; Sindre, Guttorm; Gjesteland, Thomas. (2020) Aune-utvalget vil gi bråstopp i utviklingen av gode vurderingsformer. Feature article Giannakos, Michail; Sindre, Guttorm; Andrew, Luxton-Reilly; Divitini, Monica. (2020) ITiCSE '20: Proceedings of the 2020 ACM Conference on Innovation and Technology in Computer Science Education. Association for Computing Machinery (ACM) Association for Computing Machinery (ACM) Academic anthology/Conference proceedings Sindre, Guttorm. (2020) Analyse av studenters eksamenskode: typiske feil og muligheter for autoretting. NIKT: Norsk IKT-konferanse for forskning og utdanning Academic article Fernandez, Alfredo Perez; Sindre, Guttorm. (2020) Software Assisted Privacy Impact Assessment in Interactive Ubiquitous Computing Systems. Academic chapter/article/Conference paper Meland, Per Håkon; Sindre, Guttorm. (2020) Cyber Attacks for Sale. Academic chapter/article/Conference paper Haga, Kristian; Meland, Per Håkon; Sindre, Guttorm. (2020) Breaking the Cyber Kill Chain by Modelling Resource Costs. Academic chapter/article/Conference paper Meland, Per Håkon; Bayoumy, Yara; Sindre, Guttorm. (2020) The Ransomware-as-a-Service economy within the darknet. Computers & Security Academic article Stålhane, Tor; Deraas, Bendik Balstad; Sindre, Guttorm. (2020) What competence do software companies want from university graduates?. Nordic Journal of STEM Education Academic article Giannakos, Michail; Sindre, Guttorm; Luxton-Reilly, Andrew; Divitini, Monica. (2020) ITiCSE 2020 Chairs' Welcome. Annual Conference on Innovation and Technology in Computer Science Education, ITiCSE Editorial Sindre, Guttorm. (2020) Code Writing vs Code Completion Puzzles: Analyzing Questions in an E-exam. Academic chapter/article/Conference paper 2019 Chirumamilla, Aparna; Sindre, Guttorm. (2019) E-Assessment in Programming Courses: Towards a Digital Ecosystem Supporting Diverse Needs?. Academic chapter/article/Conference paper Meland, Per Håkon; Bernsmed, Karin; Frøystad, Christian; Li, Jingyue; Sindre, Guttorm. (2019) An experimental evaluation of bow-tie analysis for security. Information and Computer Security Academic article Sindre, Guttorm. (2019) Analyse av oppgaver og oppgavesjangre i en digital eksamen i innledende programmering. NOKOBIT: Norsk konferanse for organisasjoners bruk av informasjonsteknologi Academic article Meland, Per Håkon; Johansen, Bent Heier; Sindre, Guttorm. (2019) An experimental analysis of cryptojacking attacks. Academic chapter/article/Conference paper Fernandez, Alfredo Perez; Sindre, Guttorm. (2019) Mitigating the Impact on Users’ Privacy Caused by over Specifications in the Design of IoT Applications. Sensors Academic article Meland, Per Håkon; Bernsmed, Karin; Frøystad, Christian; Li, Jingyue; Sindre, Guttorm. (2019) An experimental evaluation of bow-tie analysis for cybersecurity requirements. Lecture Notes in Computer Science (LNCS) Academic article Chirumamilla, Aparna; Sindre, Guttorm. (2019) Mitigation of Cheating in Online Exams: Strengths and Limitations of Biometric Authentication. Academic chapter/article/Conference paper 2018 Sindre, Guttorm. (2018) Lean and Agile Higher Education: Death to Grades, Courses, and Degree Programs?. Academic chapter/article/Conference paper Bayoumy, Yara; Meland, Per Håkon; Sindre, Guttorm. (2018) A Netnographic Study on the Dark Net Ecosystem for Ransomware. Academic chapter/article/Conference paper Sindre, Guttorm. (2018) Introductory IT Courses with Large Classes: Perfect Setting for a PSI Revival?. NOKOBIT: Norsk konferanse for organisasjoners bruk av informasjonsteknologi Academic article Fernandez, Alfredo Perez; Sindre, Guttorm. (2018) The privacy aware transmission highway framework. International Journal of Information Privacy, Security and Integrity Academic article Lorås, Madeleine; Sindre, Guttorm; Aalberg, Trond. (2018) First year computer science education in Norway. NOKOBIT: Norsk konferanse for organisasjoners bruk av informasjonsteknologi Academic article Sindre, Guttorm; Giannakos, Michail; Krogstie, Birgit Rognebakke; Munkvold, Robin Isfold; Aalberg, Trond. (2018) Project-based learning in IT education : definitions and qualities. Uniped - Tidsskrift for universitets- og høgskolepedagogikk Academic article Vegendla, Apar",
  "content_length": 80494,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:54"
}