{
  "name": "Guus Schreiber",
  "homepage": "http://www.cs.vu.nl/~guus",
  "status": "success",
  "content": "Home page Guus Schreiber Guus Schreiber @ VU Web & Media Network Institute CommonKADS Linked Cultural Data RDF 1.1 SKOS OWL 1.0 Home Publications Short CV Personal About me On 1 December 2016 I was appointed as Dean of the Faculty of Science at VU University Amsterdam. Before that I was for two years Head of the Computer Science department. I'm still a professor at the Web & Media group of the Department of Computer Science, VU University Amsterdam, and part of the Network Institute. My interests lie in knowledge engineering, web science, and e-humanities. I like to do interdisciplinary projects. Since 2002 I've spent a considerable amount of my time chairing W3C groups in the Data area. The last group I chaired was the RDF Working Group, for which I wrote the RDF 1.1 Primer. After my entry in 2014 into the management ranks leadership of the Web & Media research group was taking over by Professor Lora Aroyo. Selected activities 8 March 2017: B-Debate \"Artificial Intelligence: Dreams, Risks, and Reality\", Barcelona How the Semantic Web is transforming information access from Guus Schreiber 4 October 2015: Event with our Accurator prototype in the Rijksmuseum: descriving birds in art images \"Birds on a balustrade\" by Hondecoeter 1680-1690. (source) 25 September 2015: presentation at workshp \"Semantics and the Humanities\", St. Johns College, Oxford Semantics and the Humanities: some lessons from my journey 2000-2012 from Guus Schreiber 10 November 2014: presentation at Histoinformatics 2014, Barcelona Linking historical ship records to a newspaper archive from Guus Schreiber 25 July 2014: keynote Web Science Summer School, University of Southampton Knowledge engineering and the Web from Guus Schreiber March 2012L: Final review, IP Notube, BBC, London NoTube: integrating TV and Web with the help of semantics from Guus Schreiber video: 2011: demonstrator video: 2010: user scenarios video: 2010: demonstrator 28 October 2011: Keynote IC3K conference, Paris Principles for knowledge engineering on the Web from Guus Schreiber June 2011: (in Dutch) Interview in //Collectie (magazine for libraries) 4 March 2011: talk at the symposium \"Beyond the Semantic Web\", held on in honor of Bob Wielinga The artof of knowledge engineering, or: knowledge engineering of art from Guus Schreiber 4 December 2010: (in Dutch) Interview in De Volkskrant (national newspaper) 23 February 2010: (in Dutch) BNR News Radio, program Denktank (Think Tank) Your browser does not support the audio element. 29 January 2010: Keynote SOFTSEM 2010, Spindleruv Mlyn, Czech Republic Web Science: the digital heritage case from Guus Schreiber 31 January 2008: Invited talk at meeting of the European national libraries, Frankfurt am Main, Germany. Principles and pragmatics of a Semantic Culture Web from Guus Schreiber December 2007: (in Dutch) Article in \"Gewoon Bijzonder\" (VY alumni magazine) 13 November 2007: Panel ISWC 2007, Busan, Korea Prodigy or Sociopath: The Adolescent Semantic Web Dieter Fensel, James A. Hendler, Carole Goble, Abraham Bernstein, Frank van Harmelen, Guus Schreiber 10 February 2007: (in Dutch) Article in Vrij Nederland (national periodical) 7 December 2006: Keynote International Conference on Semantic and Digital Media Technology (SAMT 2006), Athens, Greece Ontologies for multimedia: the Semantic Culture Web from Guus Schreiber July 2006: Keynote at the Semantic Web Summer School, Cercedilla, Spain. Semantics for visual resources: use cases from e-culture from Guus Schreiber Contact Appointments: Simone Zindel, tel: +31 20 5987654 E-mail: guus dot schreiber at vu dot nl Address: room F-124 (entrance through F-140), De Boelelaan 1085, 1081 HV Amsterdam This page uses the Perfect 'Right Menu' 2 Column Liquid Layout by Matthew James Taylor. View more website layouts and web design articles.",
  "content_length": 3828,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:46"
}