{
  "name": "Guy Bégin",
  "homepage": "https://professeurs.uqam.ca/professeur/begin.guy",
  "status": "success",
  "content": "Guy Bégin | Répertoire des professeures et professeurs - UQAM Guy Bégin Professeur associé Guy Bégin Professeur associé Courriel : begin.guy@uqam.ca Téléphone : (514) 987-3000 poste 4081 Langues : Français, Anglais Domaines d'expertise Codage, décodage Électronique Génie informatique Systèmes embarqués Télécommunications Enseignement Projet supervisé (2024, 2021) Projet de thèse (2024, 2023, 2022, 2021) Projet intégrateur thématique (2021) Stage d'intégration (2021) Systèmes de télécommunications embarquées (2020) Directions de thèses et mémoires Thèses de doctorat El Saadany, Riham. (2024). An auto-scaling architecture for blockchain in the context of the Internet of Things. (Thèse de doctorat). Université du Québec à Montréal. Gingras, Éric. (2010). Vers une auto-protection des machines par un effort communautaire. (Thèse de doctorat). Université du Québec à Montréal. Mémoires Encarnacion, Lorry James. (2021). Un modèle de conception pour la protection de la confidentialité et de l'anonymat des utilisateurs d'un service livré par une plateforme mobile. (Mémoire de maîtrise). Université du Québec à Montréal. Touati, Djallel Eddine. (2015). Validation d'une technique de transmission basée sur le codage réseau. (Mémoire de maîtrise). Université du Québec à Montréal. Yassin, Mohamed. (2014). Protection automatique des applications Web contre l'attaque par injection SQL. (Mémoire de maîtrise). Université du Québec à Montréal. Schmitt, Mathieu. (2014). Architecture de sécurité pour les données dans un contexte d'informatique en nuage. (Mémoire de maîtrise). Université du Québec à Montréal. El Saadany, Riham. (2013). Lock-and-key security : evaluation of Telnet as an authentication method usually associated with dynamic access control lists application. (Mémoire de maîtrise). Université du Québec à Montréal. Marois, Patrick. (2009). Évaluation de l'application des activités de sécurité proposées par les méthodes de gestion des risques de sécurité pour les systèmes d'information dans un contexte de cycle de développement du logiciel. (Mémoire de maîtrise). Université du Québec à Montréal. Gaha, Maher. (2007). Sécurité dans les réseaux Wi-Fi : étude détaillée des attaques et proposition d'une architecture Wi-Fi sécurisée. (Mémoire de maîtrise). Université du Québec à Montréal. Louafi, Habib. (2006). Détection et exploitation des copies partielles afin de faciliter l'analyse forensique d'un système de fichiers. (Mémoire de maîtrise). Université du Québec à Montréal. Massé, Rhéal. (2005). Pratiques de gestion de la sécurité des actifs informatiques et informationnels: proposition d'une stratégie. (Mémoire de maîtrise). Université du Québec à Montréal. Soumah, Naby Djoubar. (2004). Les défis de l'établissement de liaisons sécuritaires dans un réseau adhoc sans fil. (Mémoire de maîtrise). Université du Québec à Montréal. Gingras, Éric. (2004). Syntaxe d'une politique de sécurité destinée à un contrôle d'accès non-discrétionnaire et distribué. (Mémoire de maîtrise). Université du Québec à Montréal. El Idrissi, Mehdi. (2002). Rapport sur l'utilisation de PEP (Performance Enhancing Proxies) en vue d'améliorer les performances de TCP sur lien satellite. (Mémoire de maîtrise). Université du Québec à Montréal. Houde, Robert. (2001). FILTRES ANTI-ALIAS ET CONVERSION DE TAUX D'ECHANTILLONAGE DANS LES RADIOS LOGICIELLES. (Mémoire de maîtrise). Université du Québec à Montréal. GODIN, STEPHANE. (2000). RENFORCEMENT CRYPTOGRAPHIQUE DES SEQUENCES PSEUDO-ALEATOIRES UTILISEES EN ETALEMENT SPECTRAL DIRECT. (Mémoire de maîtrise). Université du Québec à Montréal. Aliouat, Rachid. (1999). CORRECTION D'EFFACEMENTS DE DONNEES DANS LES RESEAUX PAR CODAGE CONVOLUTIONNEL AUTO- ORTHOGONAL. (Mémoire de maîtrise). Université du Québec à Montréal. Rapports d'activités et projets d'intervention Dresch, Antoine. (2021). Aléa moral et risques de victimisation en ligne. (Rapport d'activités et projet d'intervention). Université du Québec à Montréal. Léger, Marc André. (2003). Un processus d'analyse des vulnérabilités technologiques comme mesure de protection contre les cyber-attaques. (Rapport d'activités et projet d'intervention). Université du Québec à Montréal. ...",
  "content_length": 4203,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:50"
}