{
  "name": "Guy Van den Broeck",
  "homepage": "http://web.cs.ucla.edu/~guyvdb",
  "status": "success",
  "content": "Guy Van den Broeck - News Guy Van den Broeck UCLA - Computer Science Department Engineering VI Room 368A 404 Westwood Plaza Los Angeles, CA 90095-1596 Your browser does not support the audio element. Pronounce my name guyvdb@cs.ucla.edu guy@sigmoid.social @guyvdb I am a Professor of Computer Science and Samueli Fellow at UCLA, where I direct the Statistical and Relational Artificial Intelligence (StarAI) lab. My research interests are in Machine Learning (Tractable Deep Generative Models, Statistical Relational Learning, Probabilistic Programming), Knowledge Representation and Reasoning (Probabilistic Inference, Probabilistic Databases), and Artificial Intelligence in general. Recent Publications 2026 [235]William Zhao, Guy Van den Broeck and Benjie Wang. How to Marginalize in Causal Structure Learning?, In 5th Workshop on Graphs and more Complex Structures For Learning and Reasoning (GCLR), 2026. [234]Anjunyi Fan, Xuejie Liu, Anji Liu, Qiuping Wu, Jiaqi Yang, Yuchao Qin, Guy Van den Broeck, Yitao Liang and Bonan Yan. ESTroM: Element-Flow Architecture For Processing Sparse Tractable Probabilistic Models, In Proceedings of the 32nd International Symposium on High-Performance Computer Architecture (HPCA), 2026. 2025 [233]Daniel Israel, Guy Van den Broeck and Aditya Grover. Accelerating Diffusion LLMs via Adaptive Parallel Decoding, In Advances in Neural Information Processing Systems 38 (NeurIPS), 2025. Oral spotlight presentation, acceptance rate 688/21575 = 3.1% [232]Xuejie Liu, Anji Liu, Yitao Liang and Guy Van den Broeck. Plug-and-Play Context Feature Reuse for Efficient Masked Generation, In Advances in Neural Information Processing Systems 38 (NeurIPS), 2025. [231]Vinh Tong, Trung-Dung Hoang, Anji Liu, Guy Van den Broeck and Mathias Niepert. Rao-Blackwell Gradient Estimators for Equivariant Denoising Diffusion, In Advances in Neural Information Processing Systems 38 (NeurIPS), 2025. [230]Zilei Shao, Anji Liu and Guy Van den Broeck. Zero-Variance Gradients for Variational Autoencoders, In NeurIPS 2025 Workshop on Structured Probabilistic Inference & Generative Modeling, 2025. [229]Zheng Luo, Wim Van den Broeck, Guy Van den Broeck and Yisu Remy Wang. Algorithms for Optimizing Acyclic Queries, In Arxiv, 2025. [228]Ryan Tjoa, Poorva Garg, Harrison Goldstein, Todd Millstein, Benjamin C. Pierce and Guy Van den Broeck. Tuning Random Generators: Property-Based Testing as Probabilistic Programming, In Proc. ACM Program. Lang. (OOPSLA), ACM, 2025. [227]Laura Manduchi, Kushagra Pandey, Robert Bamler, Ryan Cotterell, Sina Däubener, Sophie Fellenz, Asja Fischer, Thomas Gärtner, Matthias Kirchler, Marius Kloft, Yingzhen Li, Christoph Lippert, Gerard de Melo, Eric Nalisnick, Björn Ommer, Rajesh Ranganath, Maja Rudolph, Karen Ullrich, Guy Van den Broeck, Julia E Vogt, Yixin Wang, Florian Wenzel, Frank Wood, Stephan Mandt and Vincent Fortuin. On the Challenges and Opportunities in Generative AI, In Transactions on Machine Learning Research, 2025. [226]Poorva Garg, Benjie Wang, Oliver Broadrick, Guy Van den Broeck and Todd Millstein. Bitblasting for Constrained Decorrelation in Tractable Image Modeling, In Proceedings of the UAI Workshop on Tractable Probabilistic Modeling (TPM), 2025. More Publications Recent Talks Invited Talk — Oct 2025 Symbolic Reasoning in the Age of Large Language Models Amazon Invited Talk — Sep 2025 Symbolic Reasoning in the Age of Large Language Models NVIDIA Invited Talk — Sep 2025 Symbolic Reasoning in the Age of Large Language Models UPenn ASSERT Center Seminar Keynote — Sep 2025 Symbolic Reasoning in the Age of Large Language Models 19th Conference on Neurosymbolic Learning and Reasoning (NeSy 2025) Keynote — Sep 2025 Symbolic Reasoning in the Age of Large Language Models Leuven.AI Conference Invited Talk — Jul 2025 Symbolic Reasoning about Large Language Models Apple Workshop on Reasoning and Planning Invited Talk — Jun 2025 Symbolic Reasoning about Large Language Models 9th Annual Center for Human-Compatible AI Workshop Invited Talk — May 2025 Symbolic Control and Alignment by Reasoning about Large Language Models IVADO Neuro-Symbolic AI Workshop Invited Talk — Apr 2025 Symbolic Reasoning about Large Language Models Simons Institute Workshop on Theoretical Aspects of Trustworthy AI Invited Talk — Apr 2025 Symbolic Reasoning about Large Language Models ICLR Workshop on Reasoning and Planning for Large Language Models More Talks",
  "content_length": 4426,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:48"
}