{
  "name": "Guy J. Brown",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/guy-brown",
  "status": "success",
  "content": "Professor Guy Brown | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Guy Brown BSc(Hons), PhD, MEd School of Computer Science Professor of Computer Science Member of the Speech and Hearing (SpandH) research group Open staff member portrait in a modal window g.j.brown@sheffield.ac.uk +44 114 222 1821 +44 114 222 1825 Regent Court (DCS) Full contact details Professor Guy Brown School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0001-8565-5476 Google Scholar Personal website Profile Professor Brown obtained a BSc (Hons) Applied Science from Sheffield City Polytechnic in 1984 and a PhD in Computer Science from the University of Sheffield in 1992. He was appointed to a lectureship in the Department of Computer Science, University of Sheffield in 1992.He also obtained the MEd in Teaching and Learning from the University of Sheffield in 1997. He has held visiting appointments at LIMSI-CNRS (France), Ohio State University (USA), Helsinki University of Technology (Finland) and ATR (Japan).He was appointed to a Chair of Computer Science in 2013. Professor Brown was Head of the Department of Computer Science from 2015 to 2023. Research interests Professor Brown's main research interest is Computational Auditory Scene Analysis (CASA), which aims to build machine systems that mimic the ability of human listeners to segregate complex mixtures of sound.He also has interests in noise-robust and reverberation-robust automatic speech recognition, models of auditory function in normal and impaired hearing, binaural modelling and the phonetics of overlapping speech. A recent interest is the application of CASA technology in mobile robot platforms.He is the co-editor (with DeLiang Wang) of Computational auditory scene analysis: Principles, Algorithms, and Applications (IEEE Press/Wiley-Interscience). Publications Show: Featured publications All publications Featured publications Journal articles Romero HE, Ma N, Brown G & Hill EA (2022) Acoustic screening for obstructive sleep apnea in home environments based on deep neural networks. IEEE Journal of Biomedical and Health Informatics, 26(7), 2941-2950. Ma N, Gonzalez J & Brown GJ (2018) Robust binaural localization of a target sound source by combining spectral source models and deep neural networks. IEEE/ACM Transactions on Audio, Speech and Language Processing, 26(11), 2122-2131. View this article in WRRO Ma N, May T & Brown GJ (2017) Exploiting Deep Neural Networks and Head Movements for Robust Binaural Localisation of Multiple Sources in Reverberant Environments. IEEE Transactions on Audio, Speech, and Language Processing, 25(12), 2444-2453. View this article in WRRO Keronen S, Kallasjoki H, Remes U, Brown GJ, Gemmeke J & Palomaki K (2012) Mask estimation and imputation methods for missing data speech recognition in a multisource reverberant environment. Computer Speech and Language. Palomäki KJ & Brown GJ (2011) A computational model of binaural speech recognition: Role of across-frequency vs. within-frequency processing and internal noise. Speech Communication, 53(6), 924-940. Brown GJ, Ferry RT & Meddis R (2010) A computer model of auditory efferent suppression: implications for the recognition of speech in noise.. J Acoust Soc Am, 127(2), 943-954. Kurtic E, Brown GJ & Wells B () Resources for turn competition in overlapping talk. Speech Communication, 55(5), 721-743. Book chapters Blauert J & Brown GJ (2020) Reflexive and Reflective Auditory Feedback, Modern Acoustics and Signal Processing (pp. 3-31). Springer International Publishing Conference proceedings Romero H, Ma N, Brown G & Johnson S (2024) SLUMBR: SLeep statUs estiMation from aBdominal Respiratory effort. 2024 46th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). Orlando, Florida, 15 July 2024 - 15 July 2024. View this article in WRRO Hughes C, Brown G, Ma N & Dibben N (2024) Acoustic effects of facial feminisation surgery on speech and singing: A case study. Proceedings of Interspeech 2024 (pp 3065-3069). Kos island, Greece, 1 September 2024 - 1 September 2024. View this article in WRRO Romero HE, Ma N, Brown GJ & Johnson S (2023) Obstructive sleep apnea screening with breathing sounds and respiratory effort: a multimodal deep learning approach. Interspeech 2023 Proceedings (pp 5451-5455). Dublin, Ireland, 20 August 2023 - 20 August 2023. View this article in WRRO Hu Q, Ma N & Brown GJ (2023) Robust binaural sound localisation with temporal attention. ICASSP 2023 - 2023 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP) Proceedings. Rhodes Island, Greece, 4 June 2023 - 4 June 2023. View this article in WRRO Romero HE, Ma N & Brown GJ (2020) Snorer diarisation based on deep neural network embeddings. ICASSP 2020 - 2020 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). Barcelona, Spain, 4 May 2020 - 8 May 2020. White T, Fraser G & Brown G (2019) Improving random GUI testing with image-based widget detection. ISSTA 2019 Proceedings of the 28th ACM SIGSOFT International Symposium on Software Testing and Analysis (pp 307-317). Beijing, China, 15 July 2019 - 15 July 2019. View this article in WRRO Kurtic E, Brown GJ & Wells B (2010) Resources for turn competition in overlap in multi-party conversations: speech rate, pausing and duration.. INTERSPEECH (pp 2550-2553) Brown GJ & Beeston AV () Perceptual compensation for effects of reverberation in speech identification: A computer model based on auditory efferent processing.. Interspeech 2010. Japan, 26 September 2010 - 30 September 2010. All publications Books (2011) Frontmatter. IEEE. Wang D & Brown GJ (2006) Computational Auditory Scene Analysis. IEEE. Journal articles Ma N, Mirheidari B, Brown GJ, Sanjase N, Maimbolwa M, Chifwamba S, Muzazu S, Muyoyeta M & Kagujje M (2025) Deep Learning for Tuberculosis Screening in a High-burden Setting using Cough Analysis and Speech Foundation Models.. CoRR, abs/2509.09746. Romero HE, Ma N, Brown G & Hill EA (2022) Acoustic screening for obstructive sleep apnea in home environments based on deep neural networks. IEEE Journal of Biomedical and Health Informatics, 26(7), 2941-2950. Wells W, Beeston A, Bradley E, Brown G, Crook H & Kurtic E (2019) Talking in Time: the development of a self-administered Conversation Analysis based training programme for cochlear implant users. Cochlear Implants International, 20(5), 255-265. View this article in WRRO Vecchiotti P, Ma N, Squartini S & Brown GJ (2019) End-to-end Binaural Sound Localisation from the Raw Waveform.. CoRR, abs/1904.01916. Ma N, Gonzalez J & Brown GJ (2018) Robust binaural localization of a target sound source by combining spectral source models and deep neural networks. IEEE/ACM Transactions on Audio, Speech and Language Processing, 26(11), 2122-2131. View this article in WRRO Alghamdi N, Maddock S, Marxer R, Barker J & Brown GJ (2018) A corpus of audio-visual Lombard speech with frontal and profile views. Journal of the Acoustical Society of America, 143(6), 523-529. View this article in WRRO Alghamdi N, Maddock S, Barker J & Brown GJ (2017) The impact of automatic exaggeration of the visual articulatory features of a talker on the intelligibility of spectrally distorted speech. Speech Communication, 95, 127-136. View this article in WRRO Ma N, May T & Brown GJ (2017) Exploiting Deep Neural Networks and Head Movements for Robust Binaural Localisation of Multiple Sources in Reverberant Environments. IEEE Transactions on Audio, Speech, and Language Processing, 25(12), 2444-2453. View this article in WRRO Mill RW & Brown GJ (2016) Utilising temporal signal features in adverse noise conditions: Detection, estimation, and the reassigned spectrogram.. The Journal of the Acoustical Society of America, 139(2), 904-917. Remes U, López AR, Juvela L, Palomäki K, Brown GJ, Alku P & Kurimo M (2015) Comparing human and automatic speech recognition in a perceptual restoration experiment. Computer Speech and Language, 35, 14-31. View this article in WRRO Keronen S, Kallasjoki H, Palomaki KJ, Brown GJ & Gemmeke JF (2015) Feature enhancement of reverberant speech by distribution matching and non-negative matrix factorization. EURASIP Journal on Advances in Signal Processing, 76. View this article in WRRO Beeston AV, Brown GJ & Watkins AJ (2014) Perceptual compensation for the effects of reverberation on consonant identification: Evidence from studies with monaural stimuli. Journal of the Acoustical Society of America, 136(6), 3072-3084. View this article in WRRO Juergens T, Brand T, Clark NR, Meddis R & Brown GJ (2013) The robustness of speech representations obtained from simulated auditory nerve fibers under different noise conditions. JOURNAL OF THE ACOUSTICAL SOCIETY OF AMERICA, 134(3), EL282-EL288. Meddis R, Lecluyse W, Clark NR, Jürgens T, Tan CM, Panda MR & Brown GJ (2013) A computer model of the auditory periphery and its application to the study of hearing. Advances in Experimental Medicine and Biology, 787, 11-20. Clark NR, Brown GJ, Jurgens T & Meddis R (2012) A frequency-selective feedback model of auditory efferent suppression and its implications for the recognition of speech in noise. Journal of the Acoustical Society of America, 132(3), 1535-1541. Keronen S, Kallasjoki H, Remes U, Brown GJ, Gemmeke J & Palomaki K (2012) Mask estimation and imputation methods for missing data speech recognition in a multisource reverberant environment. Computer Speech and Language. Gorisch J, Wells B & Brown GJ (2012) Pitch Contour Matching and Interactional Alignment across Turns: An Acoustic Investigation. Language and Speech, 55, 57-76-57-76. Brown GJ, Jürgens T, Meddis R, Robertson M & Clark NR (2011) The representation of speech in a nonlinear auditory model: Time-domain analysis of simulated auditory-nerve firing p",
  "content_length": 44066,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:53"
}