{
  "name": "Guy Lapalme",
  "homepage": "http://rali.iro.umontreal.ca/lapalme",
  "status": "success",
  "content": "Guy Lapalme | Professeur au DIRO – Université de Montréal Since September 2018, I am now retired as Emeritus from the University of Montreal, therefore I do not accept to supervise any new student. Depuis septembre 2018, je suis à la retraite de l’Université de Montréal avec le statut de professeur émérite au DIRO.  Je n’accepte donc plus de diriger de nouveaux étudiants. J’ encadre des projets IFT3150 dans le cadre de MONA. J’ai travaillé sur le traitement de la langue naturelle dans le cadre du laboratoire de Recherche Appliquée en Linguistique Informatique (RALI) plus particulièrement dans les domaines suivants: génération de texte réalisation bilingue de textes à partir de données réalisateur JavaScript pour l’anglais et le français réalisateur Python pour l’anglais et le français verbalisateur d’AMR présentation personnalisée d’information environnementale e-recrutement outils d’aide à la traduction (TransSearch, TransCheck) résumé automatique J’ai écrit récemment des documents pédagogiques: Tutoriels avec exemples pratiques sur des aspects originaux du langage de programmation Swift: Principes de SwiftUI Expressions régulières en Swift Le développement d’une application de dictionnaire de mots croisés disponible sur Apple Store [PDF]. Tutoriel sur l’utilisation de jq pour manipuler des fichiers JSON en français et en anglais. Création de grilles de mots croisés Je me suis intéressé également à XML et à ses technologies associées. J’ai rédigé un tutoriel sur XML en anglais qui résume ce que j’y ai appris au cours des dernières années. Le texte et les fichiers associés sont disponibles en ligne. J’ai également développé une des versions XML de WordNet . J’ai aussi produit des versions XML et JSON du Dictionnaire des verbes français (LVF) et du Dictionnaire Électronique des Mots (DEM) de  Jean Dubois et Françoise Dubois-Charlier. Au cours des années, j’ai dirigé plusieurs étudiants qui sont maintenant diplômés. Quelques jalons dans ma carrière: Le 6 novembre 2010, l’Université de Neuchâtel m’a décerné un doctorat honoris causa pour mes travaux dans le domaine du traitement automatique de la langue [Texte de présentation]. Le 26 avril 2011, CAIAC (Association pour l’Intelligence Artificielle au Canada) m’a honoré d’un Prix d’excellence pour l’ensemble de mes réalisations (Lifetime Achievement Award) [Texte de présentation] et je suis devenu, par le fait même, un des membres agréés CAIAC (fellows). En octobre 2013, j’ai été élevé au grade de IEEE Senior Member. De 2007 à 2016, j’ai été le secrétaire de l’Association des Diplomés du DIRO (ADDIROUM) En 2019, j’ai été nommé Professeur Émérite de l’Université de Montréal En 2023, Computer Science Canada / Informatique Canada m’a honoré pour l’ensemble de mes réalisations. [Contact] Professeur au DIRO – Université de Montréal",
  "content_length": 2822,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:53"
}