{
  "name": "Guy Bois",
  "homepage": "https://www.polymtl.ca/expertises/bois-guy",
  "status": "success",
  "content": "Bois, Guy | Répertoire des expertises Aller au contenu principal Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission Visitez-nous! Faire un don © Polytechnique Montréal 2025. Poly Bottin Cours Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission © Polytechnique Montréal 2025. Répertoire des expertises Bois, Guy Poly Bottin Cours English Répertoire des expertises Bois, Guy Répertoire des expertises Retour aux résultats de recherche Modifier ma ficheAide Publications Guy Bois Bacc., Ph.D. (Montréal) Publications Professeur titulaire Département de génie informatique et génie logiciel Tél. : (514) 340-4711 poste 5944 Téléc. : (514) 340-5139 Local : M-5105 guy.bois@polymtl.ca Domaines d'expertise Architecture d'ordinateur et conception Systèmes intégrés à très grande échelle (VLSI) Intérêts de recherche et affiliations Intérêts de recherche Conception logiciel/matériel et vérification de systèmes embarqués Développement d'outils pour la conception de systèmes embarqués (modélisation, simulation, exploration architecturale, partitionnement logiciel/matériel et synthèse logicielle/matérielle) Conception de systèmes à base de FPGA pour traitement d'images, video, apprentissage profond, etc. Type(s) d'expertises (sujets CRSNG) 2719 Architecture d'ordinateur et conception 2722 Systèmes intégrés à très grande échelle (VLSI) 2519 Microélectronique 2701 Matériel informatique Publications Publications récentes Communication de conférence Portas, F., Bois, G., & Savaria, Y. (juin 2024). CoChrono: A Unified Hardware/Software Performance Analysis Tool for SoC-FPGA Codesign [Communication écrite]. 22nd IEEE Interregional NEWCAS Conference (NEWCAS 2024), Sherbrooke, QC, Canada. Communication de conférence Posso, J., Bois, G., & Savaria, Y. (juin 2024). Real-Time Spacecraft Pose Estimation Using Mixed-Precision Quantized Neural Network on COTS Reconfigurable MPSoC [Communication écrite]. 22nd IEEE Interregional NEWCAS Conference (NEWCAS 2024), Sherbrooke, QC, Canada. Communication de conférence Posso, J., Bois, G., & Savaria, Y. (mai 2022). Mobile-URSONet: an Embeddable Neural Network for Onboard Spacecraft Pose Estimation [Communication écrite]. IEEE International Symposium on Circuits and Systems (ISCAS 2022), Austin, TX, USA. Article de revue Girard, S. R., Legault, V., Bois, G., & Boland, J.-F. (2019). Avionics graphics hardware performance prediction with machine learning. Scientific Programming, 2019, 1-15. Voir toutes les publications (98) Enseignement Conception et vérification de systèmes embarqués. Systèmes embarqués. Encadrement à Polytechnique TERMINÉ Thèse de doctorat (4) Posso, J. (2025). Estimation de pose de véhicules spatiaux non coopératifs à partir de réseaux de neurones – De l'image monoculaire à l'implémentation embarquée temps réel et à l'analyse temporelle [Thèse de doctorat, Polytechnique Montréal]. Vakili, S. (2014). Accuracy-Guaranteed Fixed-Point Optimization in Hardware Synthesis and Processor Customization [Thèse de doctorat, École Polytechnique de Montréal]. Moss, L. (2010). Profilage, caractérisation et partitionnement fonctionnel dans une plate-forme de conception de systèmes embarqués [Thèse de doctorat, École Polytechnique de Montréal]. Nekili, M. (1998). Synthèse de réseaux de distribution d'horloges en présence de variations du procédé de fabrication [Thèse de doctorat, École Polytechnique de Montréal]. Mémoire de maîtrise (51) Portas, F. (2023). Outils de codesign pour la vérification de partitionnement par hyperviseur sur système embarqué matériel-logiciel de criticités mixtes [Mémoire de maîtrise, Polytechnique Montréal]. Fortier, F. (2018). Estimation par analyse statique de la bande-passante d'accélérateurs en synthèse de haut niveau sur FPGA [Mémoire de maîtrise, École Polytechnique de Montréal]. Gauthier, E. (2017). Exploration d'une méthodologie de développement matériel et logiciel au niveau système appliqué à un système d'encodage de flux vidéo évolutif [Mémoire de maîtrise, École Polytechnique de Montréal]. Desaulty, A. (2016). Intégration dans un flot de conception système d'un outil de traduction assistée de code C pour la création de coprocesseurs matériels [Mémoire de maîtrise, École Polytechnique de Montréal]. Gaudron, M. (2016). Expérimentation d'une suite d'outils pour automatiser le passage d'une conception basée sur un modèle vers la réalisation d'une implémentation, en passant par l'exploration architecturale [Mémoire de maîtrise, École Polytechnique de Montréal]. Lacroix, A. B. (2016). Implémentations logicielle et matérielle de l'algorithme Aho-Corasick pour la détection d'intrusions [Mémoire de maîtrise, École Polytechnique de Montréal]. Rivard-Girard, S. (2015). Prédiction de performance de matériel graphique dans un contexte avionique par apprentissage automatique [Mémoire de maîtrise, École Polytechnique de Montréal]. Bao, L. (2014). Méthode de conception dirigée par les modèles pour les systèmes avioniques modulaires intégrés basée sur une approche de cosimulation [Mémoire de maîtrise, École Polytechnique de Montréal]. Legault, V. (2014). Méthodologie expérimentale pour évaluer les caractéristiques des plateformes graphiques avioniques [Mémoire de maîtrise, École Polytechnique de Montréal]. Medeiros Monteiro, F. (2013). Caractérisation automatisée de la consommation de puissance des processeurs pour l'estimation au niveau système [Mémoire de maîtrise, École Polytechnique de Montréal]. Rogers-Vallée, M. (2012). Une méthode d'estimation de la consommation de puissance pour un système sur puce [Mémoire de maîtrise, École Polytechnique de Montréal]. Savard, J. (2012). Intégration d'un simulateur de partitionnement spatial et temporel à un flot de conception basé sur les modèles [Mémoire de maîtrise, École Polytechnique de Montréal]. Allard Bernier, J. (2011). Méthode de reconfiguration dynamique pour un réseau-sur-puce tolérant aux fautes [Mémoire de maîtrise, École Polytechnique de Montréal]. Guérard, H. (2011). Intégration d'un modèle de réseau sur puce dans un flôt de conception de niveau système [Mémoire de maîtrise, École Polytechnique de Montréal]. Bah, F. L. (2009). Conception au niveau système de l'application de protocole sans fil WIMAX [Mémoire de maîtrise, École Polytechnique de Montréal]. Fontaine, S. (2008). Conception et réalisation d'un outil d'exploration architecturale de la hiérarchie de mémoire d'un système sur puce afin d'optimiser la performance de la plateforme logicielle [Mémoire de maîtrise, École Polytechnique de Montréal]. Goyette, S. (2008). Élaboration d'un modèle d'abstraction des communications point-à-point pour une plateforme (SOC) multiprocesseur hétérogène [Mémoire de maîtrise, École Polytechnique de Montréal]. Laug, N. (2008). Gestion générique et raffinement de systèmes électroniques à haut niveau [Mémoire de maîtrise, École Polytechnique de Montréal]. Migliorini, C. (2008). Exploration architecturale de communications-sur-puce au niveau système [Mémoire de maîtrise, École Polytechnique de Montréal]. Beucher, N. (2007). Conception et mise en oeuvre de processeurs configurables pour la conversion de taux de trames vidéos avec compensation de mouvement [Mémoire de maîtrise, École Polytechnique de Montréal]. Faiz, A. (2007). Méthodes de raffinement des communications pour passer d'une plate-forme systemc à un système reprogrammable [Mémoire de maîtrise, École Polytechnique de Montréal]. Hubin, M. (2006). Modélisation et conception d'une architecture à flots d'exécution multiples selon une approche de réutilisation [Mémoire de maîtrise, École Polytechnique de Montréal]. Mahoney, P. (2006). Conception d'une architecture alternative à la technologie \"mémoire adressable par contenu\" [Mémoire de maîtrise, École Polytechnique de Montréal]. Morin, B. (2006). Parallélisme sur plateforme reconfigurable de calcul à mémoire répartie [Mémoire de maîtrise, École Polytechnique de Montréal]. Provost, S. (2006). Accélération d'une plateforme d'encodage MPEG-4 à l'aide de processeurs configurables [Mémoire de maîtrise, École Polytechnique de Montréal]. Samson, P. (2006). Abstraction de la synchronisation dans une stratégie de co-design logiciel/matériel sur une plateforme (SOC) multiprocesseur [Mémoire de maîtrise, École Polytechnique de Montréal]. St-Pierre, F. (2006). Implémentation matérielle d'un réseau sur puce et analyse du fonctionnement dans un environnement multiprocesseurs [Mémoire de maîtrise, École Polytechnique de Montréal]. Thibeault, J.-F. (2006). Exploration de techniques de modélisation et de vérification logicielle en avionique [Mémoire de maîtrise, École Polytechnique de Montréal]. Catudal, S. (2005). Méthodologie orientée performance applicable à la validation d'algorithmes de traitement vidéo et de leur implémentation matérielle [Mémoire de maîtrise, École Polytechnique de Montréal]. Deslauriers, F. (2005). Modélisation d'un réseau intégré sur puce basé sur une architecture en anneau [Mémoire de maîtrise, École Polytechnique de Montréal]. Pierron, L. (2005). Méthodologie de codesign pour les systèmes sur puce programmable [Mémoire de maîtrise, École Polytechnique de Montréal]. Benny, O. (2004). Implémentation d'un modèle de communication transactionnel dans une plate-forme en SystemC [Mémoire de maîtrise, École Polytechnique de Montréal]. Dubois, M. (2004). Modélisation et conception d'une plate-forme de traitement et transmission de signaux vidéo numériques [Mémoire de maîtrise, École Polytechnique de Montréal]. Lavigueur, B. (2004). Multitraitement et processeurs configura",
  "content_length": 14073,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:50"
}