{
  "name": "Guylaine Poisson",
  "homepage": "http://www.hawaii.edu/hpc/rotm/poisson.html",
  "status": "success",
  "content": "Researcher of the Month, Guylaine Poisson, PhD - High Performance Computing managed by Information Technology Services, University of Hawaii System HOME SERVICES STATUS ABOUT UH Home Search UH Got a question? Ask us: HPC Home PET Program ARSC Account MHPCC Account UH/MHPCC Engagement Grants MHPCC Summer Internships DoD Mod Office HPC Links Archives Contact Us Researcher of the MonthGuylaine Poisson, PhD Dr. Poisson teaches Bioinformatics in the Information and Computer Science (ICS) Department on the Manoa campus at both the graduate and undergraduate level, bringing University of Hawai'i into the forefront of Bioinformatics educational progress. The ICS department is one of the few departments that have designed a BA and BS program in bioinformatics. Dr. Poisson came to Manoa from Montreal, Canada, in 2005, where she earned her Ph.D. at the University of Quebec, Montreal in Cognitive Computer Science. In addition to her teaching duties, she is working and collaborating on three major projects: 1) A metagenomics tool development and experimental design project, where she is developing methods needed for the analysis and execution of these large-scale genomics projects; 2) Designing a fast, accurate, and inexpensive way to detect pathogens using a biosensor; and 3) Large scale annotation of proteomes. She is also mentoring a JEOM (Joint Educational Opportunities for Minorities) student for the HPCMO (High Performance Computing Modernization Office) for MHPCC (Maui High Performance Computing Center) this summer. For more information about her work, or to contact her, go to her website at http://navet.ics.hawaii.edu/~poisson/english.html Use of this site implies consent with our Usage Policy The University of Hawai‘i is an Equal Opportunity Employer copyright ©2007 University of Hawai‘i Contact ITS This page last modified on Monday, 09-Jul-2007 11:39:31 HST",
  "content_length": 1886,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:51"
}