{
  "name": "Guyue Liu",
  "homepage": "https://grace-liu.github.io/pub.html",
  "status": "success",
  "content": "Grace Liu: Publications Conference Publications 2026 [NSDI’26] MirrorNet: High-fidelity and Scalable Network Emulation for Software-defined WAN. Congcong Miao, Yuejie Wang, Jianming Wang, Xuefeng Ji, Guozhi Shan, Pan Fang, Yanke Zhang, Jialin Li, Xianneng Zou, Guyue Liu. USENIX NSDI 2026. [PDF] [NSDI’26] CascadeNet: Generating Network Traffic with High-Fidelity Temporal Patterns. Runwei Lu, Yanran Deng, Ruixuan Li, Jinting Liu, Yuejie Wang, Xinyu Li, Deming Xu, Han Tian, Kai Chen, Guyue Liu. USENIX NSDI 2026. [PDF] [EuroSys’26] Practical and Scalable RDMA Connection Sharing for HPC Workload. Yuejie Wang, Tuo Fang, Biyu Peng, Yang Cheng, Xin Sun, Chengchao Xu, Yuchen Tang, Yuxin Ren, Ning Jia, Xinwei Hu, Yunfei Du, Guyue Liu. ACM EuroSys 2026. [PDF] 2025 [SIGCOMM’25] InfiniteHBD: Building Datacenter-Scale High-Bandwidth Domain for LLM with Optical Circuit Switching Transceivers. Chenchen Shou, Guyue Liu, Hao Nie, Yichen Shen, Yu Zhou, Yimin Jiang, Wenqing Lv, Yelong Xu, Yuanwei Lu, Zhang Chen, Yanbo Yu, Yibo Zhu, Huaiyu Meng, Daxin Jiang. ACM SIGCOMM 2025. [PDF] [SIGCOMM’25] DNSLogzip: A Novel Approach to Fast and High-Ratio Compression for DNS Logs. Yunwei Dai, Guyue Liu, Tao Huang, Shuo Wang, Yong Wang, Xingli Wu, Lei Song, Heshun Li, Chuang Wang, Fanglong Hu, Hong Sun, Yanan Li. ACM SIGCOMM 2025. [PDF] [SIGCOMM’25] MixNet: A Runtime Reconfigurable Optical-Electrical Fabric for Distributed Mixture-of-Experts Training. Xudong Liao, Yijun Sun, Han Tian, Xinchen Wan, Yijun Jin, Zilong Wang, Zhenghang Ren, Xinyang Huang, Wenxue Li, Kin Fai Tse, Zhizhen Zhong, Guyue Liu, Ying Zhang, Xiaofeng Ye, Yiming Zhang, Kai Chen. ACM SIGCOMM 2025. [PDF] [SIGCOMM’25] Towards LLM-Based Failure Localization in Production-Scale Networks. Chenxu Wang, Xumiao Zhang, Runwei Lu, Xianshang Lin, Xuan Zeng, Xinlei Zhang, Zhe An, Gongwei Wu, Jiaqi Gao, Chen Tian, Guihai Chen, Guyue Liu, Yuhong Liao,Tao Lin,Dennis Cai, Ennan Zhai. ACM SIGCOMM 2025. [PDF] [SIGCOMM’25 (short)] Achieving High-Speed and Robust Encrypted Traffic Anomaly Detection with Programmable Switches. Han Zhang, Guyue Liu, Xingang Shi, Yahui Li, Jilong Wang, Yongqing Zhu, Ke Ruan, Jie Liang, Xia Yin. ACM SIGCOMM 2025. [PDF] [OSDI’25] Enabling Efficient GPU Communication over Multiple NICs with FuseLink. Zhenghang Ren, Yuxuan Li, Zilong Wang, Xinyang Huang, Wenxue Li, Kaiqiang Xu, Xudong Liao, Yijun Sun, Bowen Liu, Han Tian, Junxue Zhang, Mingfei Wang, Zhizhen Zhong, Guyue Liu, Ying Zhang, Kai Chen. USENIX OSDI 2025. [PDF] [NSDI’25] Ladder: A Convergence-based Structured DAG Blockchain for High Throughput and Low Latency. Dengcheng Hu, Jianrong Wang, Xiulong Liu, Hao Xu, Xujing Wu, Muhammad Shahzad, Guyue Liu, Keqiu Li. USENIX NSDI 2025. [PDF] [ATC’25] Accelerating Model Training on Ascend Chips: An Industrial System for Profiling, Analysis and Optimization. Yuhang Zhou, Zibo Wang, Zhibin Wang, Ruyi Zhang, Chen Tian, Xiaoliang Wang, Wanchun Dou, Guihai Chen, Binqiang Wang, Yonghong Tian, Yan Zhang, Hui Wang, Fuchun Wei, Boquan Sun, Jingyi Zhang, Bin She, Teng Su, Yifan Yao, Chunsheng Li, Ziyang Zhang, Yaoyuan Wang, Bin Zhou, Guyue Liu. USENIX ATC 2025. [PDF] [ATC’25] Towards Optimal Rack-scale μs-level CPU Scheduling through In-Network Workload Shaping. Xudong Liao, Han Tian, Xinchen Wan, Chaoliang Zeng, Hao Wang, Junxue Zhang, Mengyu Ma, Guyue Liu, Kai Chen. USENIX ATC 2025. [PDF] [ASPLOS’25] Squeezing Operator Performance Potential for the Ascend Architecture. Yuhang Zhou, Zhibin Wang, Guyue Liu, Shipeng Li, Xi Lin, Zibo Wang, Yongzhong Wang, Fuchun Wei, Jingyi Zhang, Zhiheng Hu, Yanlin Liu, Chunsheng Li, Ziyang Zhang, Yaoyuan Wang, Bin Zhou, Wanchun Dou, Guihai Chen, Chen Tian. ACM ASPLOS 2025. [PDF] [EuroSys’25] eNetSTL: Towards an In-kernel Library for High-Performance eBPF-based Network Functions. Bin Yang, Dian Shen, Junxue Zhang, Hanlin Yang, Lunqi Zhao, Beilun Wang, Guyue Liu, Kai Chen ACM EuroSys 2025. [PDF] [EuroSys’25] Fork: A Dual Congestion Control Loop for Small and Large Flows in Datacenters. Yuan Liu, Wenxin Li, Yulong Li, Lide Suo, Xuan Gao, Xin Xie, Sheng Chen, Ziqi Fan, Wenyu Qu, Guyue Liu ACM EuroSys 2025. [PDF] [NDSS’25] Heimdall: Towards Risk-Aware Network Management Outsourcing. Yuejie Wang, Qiutong Men, Yongting Chen, Jiajin Liu, Gengyu Chen, Ying Zhang, Guyue Liu, Vyas Sekar. NDSS 2025. [PDF] 2024 [SIGCOMM’24] ConfMask: Enabling Privacy-Preserving Configuration Sharing via Anonymization. Yuejie Wang, Qiutong Men, Yao Xiao, Yongting Chen, Guyue Liu ACM SIGCOMM 2024. [PDF] [SIGCOMM’24] PPT: A Pragmatic Transport for Datacenters. Lide Suo, Yiren Pang, Wenxin Li, Renjie Pei, Keqiu Li, Xiulong Liu, Xin He, Yitao Hu, Guyue Liu ACM SIGCOMM 2024. [PDF] [NSDI’24] Flow Scheduling with Imprecise Knowledge. Wenxin Li, Xin He, Yuan Liu, Keqiu Li, Kai Chen, Zhao Ge, Zewei Guan, Heng Qi, Song Zhang, Guyue Liu USENIX NSDI 2024. [PDF] 2023 [SIGCOMM’23] ClickINC: In-network Computing as a Service in Heterogeneous Programmable Data-center Networks. Wenquan Xu, Zijian Zhang, Yong Feng, Haoyu Song, Zhikang Chen, Wenfei Wu, Guyue Liu, Yinchao Zhang, Shuxin Liu, Zerui Tian, Bin Liu ACM SIGCOMM 2023. [PDF] [NSDI’23] LemonNFV: Consolidating Heterogeneous Network Functions at Line Speed. Hao Li, Yihan Dang, Guangda Sun, Guyue Liu, Danfeng Shan, Peng Zhang. USENIX NSDI 2023. [PDF] 2022 [SIGCOMM’22] Network entitlement: contract-based network sharing with agility and SLO guarantees. Satyajeet Singh Ahuja, Vinayak Dangui, Kirtesh Patil, Manikandan Somasundaram, Varun Gupta, Mario Sanchez, Guanqing Yan, Max Noormohammadpour, Alaleh Razmjoo, Grace Smith, Hao Zhong, Abhinav Triguna, Soshant Bali, Yuxiang Xiang, Yilun Chen, Prabhakaran Ganesan, Mikel Jimenez Fernandez, Petr Lapukhov, Guyue Liu, Ying Zhang. ACM SIGCOMM 2022. [PDF] Work during my PhD & postdoc [NSDI’21] Don’t Yank My Chain: Auditable NF Service Chaining. Guyue Liu, Hugo Sadok, Anne Kohlbrenner, Bryan Parno, Vyas Sekar, Justine Sherry. USENIX NSDI 2021. [PDF] [RTCSA’21] Formalizing an Architectural Model of a Trustworthy Edge IoT Security Gateway. Matt McCormack, Amit Vasudevan, Guyue Liu, and Vyas Sekar. IEEE RTCSA (invited), Sept 2021. [PDF] [ATC’20] Fine-Grained Isolation for Scalable, Dynamic, Multi-tenant Edge Clouds. Yuxin Ren, Guyue Liu, Vlad Nitu, Wenyuan Shao, Riley Kennedy, Gabriel Parmer, Timothy Wood, Alain Tchana. USENIX ATC 2020. [PDF] [SIGCOMM’18] Microboxes: High Performance NFV with Customizable, Asynchronous TCP Stacks and Dynamic Subscriptions. Guyue Liu, Yuxin Ren, Mykola Yurchenko, K.K. Ramakrishnan, Timothy Wood. ACM SIGCOMM 2018. [PDF] [CoNext’18] REINFORCE: Achieving Efficient Failure Resiliency for Network Function Virtualization based Services. Sameer G Kulkarni, Guyue Liu, K.K. Ramakrishnan, Mayutan Arumaithurai, Timothy Wood, Xiaoming Fu. ACM CoNEXT 2018. [PDF] [RTAS’18] Scalable Memory Reclamation for Multi-Core, Real-Time Systems. Yuxin Ren, Guyue Liu, Gabriel Parmer, Björn Brandenburg. IEEE RTAS 2018. Best Student Paper Award and Outstanding Paper. [PDF] [Middleware’16] Netalytics: Cloud-Scale Application Performance Monitoring with SDN and NFV. Guyue Liu, Michael Trotter, Yuxin Ren, Timothy Wood. ACM/IFIP/USENIX Middleware 2016. [PDF] [Middleware’16] SDNFV: Flexible and Dynamic Software Defined Control of an Application- and Flow-Aware Data Plane. Wei Zhang, Guyue Liu, Ali Mohammadkhan, Jinho Hwang, K.K. Ramakrishnan, Timothy Wood. ACM/IFIP/USENIX Middleware 2016. [PDF] [NFV-SDN’15] Protocols to Support Autonomy and Control for NFV in Software Defined Networks. Ali Mohammadkhan, Guyue Liu, Wei Zhang, K.K. Ramakrishnan, Timothy Wood. IEEE NFV-SDN 2015. [PDF] Workshop Publications [APNet’24] Understanding communication characteristics of distributed training. Wenxue Li, Xiangzhou Liu, Yuxuan Li, Yilun Jin, Han Tian, Zhizhen Zhong, Guyue Liu, Ying Zhang, Kai Chen. ACM APNet 2024. [PDF] [HotNets’21] Watching the watchmen: Least privilege for managed network services. Guyue Liu, Ao Li, Christopher Canel, and Vyas Sekar. ACM HotNets 2021. [PDF] [SIGCOMM SPIN’20] Fighting Fire with Light: Tackling Extreme Terabit DDoS Using Programmable Optics. Matthew Hall, Guyue Liu, Vyas Sekar and Ramakrishnan Durairajan. ACM SIGCOMM SPIN Workshop, August 2020. [PDF] [HotEdge’20] Towards an Architecture for Trusted Edge IoT Security Gateways. Matt McCormack, Amit Vasudevan, Guyue Liu, Sebastián Echeverrí, Kyle O’Meara, Grace Lewis, and Vyas Sekar. USENIX Workshop on Hot Topics in Edge Computing (HotEdge), June 2020. [PDF] [S&P SafeThings’20] Security Analysis of Networked 3D Printers. Matthew McCormack, Sanjay Chandrasekaran , Guyue Liu, Tianlong Yu, Sandra DeVincent Wolf and Vyas Sekar. IEEE Security and Privacy Workshop on the Internet of Safe Things, May 2020. [PDF] [LANMAN’19] Living on the Edge: Serverless Computing and the Cost of Failure Resiliency. Sameer Kulkarni, Guyue Liu, K. K. Ramakrishnan, and Timothy Wood. IEEE International Workshop on Local and Metropolitan Area Networks (LANMAN19), July 2019. [PDF] [LANMAN’19] Advancing Network Function Virtualization with Programmable NICs. Zhen Ni, Guyue Liu, Dennis Afanasev, Timothy Wood, and Jinho Hwang. IEEE International Workshop on Local and Metropolitan Area Networks (LANMAN19), July 2019. [PDF] [SIGCOMM KBNets’17] Design Challenges for High Performance, Scalable NFV Interconnects. Guyue Liu, K.K. Ramakrishnan, Mike Schlansker, Jean Tourrilhes, Timothy Wood. ACM SIGCOMM Workshop on Kernel-Bypass Networks, August 2017. [PDF] [HotMiddlebox’16] OpenNetVM: A Platform for High Performance Network Service Chains. Wei Zhang, Guyue Liu, Wenhui Zhang, Neel Shah, Phillip Lopreiato, Gregoire Todeschi, K.K. Ramakrishnan, Timothy Wood. Workshop on Hot Topics in Middleboxes and Network Function Virtualization (HotMiddlebox co-located with SIGCOMM’16), August 2016. [PDF] [Diversity’15] NetDefense: Scalable, Flexible and Efficient DDoS Prevention with SDN and NFV. Guyue Liu, Timothy Wood. Workshop on Supporting Diversity in Systems Researches (Diversity co-l",
  "content_length": 11813,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:49"
}