{
  "name": "György Dán",
  "homepage": "https://www.kth.se/profile/gyuri",
  "status": "success",
  "content": "KTH | György Dán Skip to main content György DánProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/gyuriDetailsWorks for Division of Network and Systems EngineeringTelephone +46 8 790 42 53Unit address Teknikringen 33E-mail gyuri@kth.seResearcherResearcher IDORCID IDGoogle Scholar IDAbout meGyörgy Dán is professor in teletraffic systems at KTH Royal Institute of Technology, Stockholm, Sweden. He received the M.Sc. degree in computer engineering from the Budapest University of Technology and Economics, Hungary in 1999, the M.Sc. degree in business administration from the Corvinus University of Budapest, Hungary in 2003, and the Ph.D. in Telecommunications from KTH in 2006. He worked as a consultant in the field of access networks, streaming media and videoconferencing 1999-2001. He was a visiting researcher at the Swedish Institute of Computer Science in 2008, a Fulbright research scholar at the Information Trust Institute at University of Illinois Urbana-Champaign in 2012-2013, and an invited professor at EPFL in 2014-2015. His research interests include the design and analysis of content management and computing systems, game theoretical models of networked systems, and cyber-physical system security in power systems. He is an author or co-author of over 150 scientific publications. He received the award of the Ericsson Research Foundation in 2010, 2012 and 2014, and in 2012 he was awarded a Fulbright research grant from the Fulbright commission. His and his group's research received the best paper award at IFIP/TC6 Networking 2008, at IEEE P2P 2010, at SNCNW 2013, and the best paper award of the IEEE Comsoc/ISOC Internet Technical Committee for 2016-2017. His students received the best student paper award at ITC 23 in 2011 and the best student conference paper award of the IEEE VT/COM/IT Sweden chapter in 2018. He has served on the TPC of IEEE and ACM conferences, like IEEE Infocom, IEEE ICDCS, ACM e-Energy, and is a regular reviewer for IEEE journals and magazines. He was symposium TPC co-chair of IEEE SmartGridComm 2014 and 2018, Workshop chair of ICME2015, TPC co-chair of ITC 2019, general co-chair of GameSec 2019, TPC co-chair of IEEE SmartGridComm 2020, and has been an area editor of Elsevier Computer Communications and of IEEE Trans. on Mobile Computing. Please visit his personal home page for the most up-to-date information on teaching and research activities. CoursesComputational Game Theory (FEP3301), teacher, course responsible, examinerDegree Project in Computer Science and Engineering, Second Cycle (DA239X), examinerDegree Project in Computer Science and Engineering, Second Cycle (DA250X), examinerDegree Project in Computer Science and Engineering, Second Cycle (DA231X), examinerDegree Project in Computer Science and Engineering, specialising in Communication Systems, Second Cycle (DA246X), examinerDegree Project in Computer Science and Engineering, specialising in Cybersecurity, Second cycle (DA237X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA258X), examinerDegree Project in Computer Science and Engineering, specialising in ICT Innovation, Second Cycle (DA256X), examinerDegree Project in Computer Science and Engineering, specializing in Industrial Management, Second Cycle (DA235X), examinerDegree Project in Computer Science and Engineering, specializing in Machine Learning, Second Cycle (DA233X), examinerDegree Project in Computer Science and Engineering, specializing in Software Engineering for Distributed Systems, Second Cycle (DA240X), examinerDegree Project in Computer Science and Engineering, specializing in Systems, Control and Robotics, Second Cycle (DA236X), examinerDegree Project in Electrical Engineering, Second Cycle (EA250X), examinerDegree Project in Electrical Engineering, Second Cycle (EA238X), examinerDegree Project in Electrical Engineering, specialising in Embedded Systems, Second Cycle (EA248X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA258X), examinerDegree Project in Electrical Engineering, specialising in ICT Innovation, Second Cycle (EA256X), examinerDegree Project in Electrical Engineering, specializing in Communication Systems, Second Cycle (EA246X), examinerDegree Project in Electrical Engineering, specializing in Information and Network Engineering, Second Cycle (EA260X), examinerDegree Project in Electrical Engineering, specializing in Systems, Control and Robotics, Second Cycle (EA236X), examinerDegree Project in Information and Communication Technology, First Cycle (IA150X), examinerIndividual Project in Networked Systems (EP2800), examinerInternetworking (EP2120), teacher, course responsible, examinerIntroduction to Computing Systems Engineering (EP1200), teacherProtocols and Principles of the Internet (IK2218), teacherSeminar on Advanced Topics in Communication Networks 1 (FEP3316), examinerSeminar on Advanced Topics in Communication Networks 2 (FEP3317), examinerThe Cybersecurity Engineer's Role in Society (DD2303), teacherPublicationsPublication listPortfolioPublication listLinksPersonal home page",
  "content_length": 5173,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:53"
}