{
  "name": "Gökhan Kul",
  "homepage": "https://www.umassd.edu/directory/gkul",
  "status": "success",
  "content": "Gokhan Kul, PhD | UMass Dartmouth Skip to main content Toggle share controls Share on Facebook Share this on X Share on LinkedIn Print this page Email this page Copy URL Link copied to clipboard! University of Massachusetts Dartmouth faculty Gokhan Kul, PhD he/him Associate ProfessorComputer & Information Science Contact 508-910-6484 gkul@umassd.edu Dion 307B Education2018University at Buffalo, SUNYPhD in Computer Science2012Middle East Technical UniversityMS in Computer Engineering2010TOBB University of Economics and TechnologyBS in Computer Engineering Teaching Cyber Defense and OperationsDigital ForensicsDatabase Design TeachingProgramsProgramsComputer Science BS, BS/MSComputer Science Cybersecurity Computer Science Graduate CertificateComputer Science MSEngineering and Applied Science PhDMobile Applications Development Software Engineering Teaching Courses CIS 273: Comp Organiztn & Design Laws of computer organization and design for RISC architectures. Interfaces between hardware and software are studied. Influence of instruction set on performance is presented. Design of a processor with pipelining is analyzed. Computer arithmetic is studied. Memory hierarchy and their influence on performance is documented. Elements of interfacing and I/O organization are included. The course has a design, implementation, and analytical components. (Formerly offered as CIS 270) CIS 442: Digital Forensics Preservation, identification, extraction and documentation of evidence in any computing environment. This course follows a practical approach to the practice of digital forensics while presenting technical and legal matters related to forensic investigations. It introduces various technologies used in everyday computing environments along with detailed information on how the evidence contained on these devices should be analyzed. CIS 444: Cyber Defense and Operations Cyber defense, operations, cyber warfare, insider threat mitigation. This course introduces the basis to create security programs in organizations by exploring cyber defense mechanisms. The course covers offensive techniques to collect intelligence while remaining hidden in computer systems and infrastructure. It also covers defensive techniques to mitigate malware, evict adversaries from operational systems, and cryptanalysis-based intelligence techniques over encrypted communication. CIS 542: Digital Forensics Preservation, identification, extraction and documentation of evidence in any computing environment. This course follows a practical approach to the practice of digital forensics while presenting technical and legal matters related to forensic investigations. It introduces various technologies used in everyday computing environments along with detailed information on how the evidence contained on these devices should be analyzed. CIS 544: Cyber Defense and Operations Cyber defense, operations, cyber warfare, insider threat mitigation. This course introduces the basis to create security programs in organizations by exploring cyber defense mechanisms. The course covers offensive techniques to collect intelligence while remaining hidden in computer systems and infrastructure. It also covers defensive techniques to mitigate malware, evict adversaries from operational systems, and cryptanalysis-based intelligence techniques over encrypted communication. CIS 552: Database Design The relational, hierarchical, and network approaches to database systems, including relational algebra and calculus, data dependencies, normal forms, data semantics, query optimization, and concurrency control on distributed database systems. CIS 600: Master's Project Prerequisites: Completion of three core courses.   Development of a detailed, significant project in computer science under the close supervision of a faculty member, perhaps as one member of a student team. This project may be a software implementation, a design effort, or a theoretical or practical written analysis. Project report with optional oral presentation must be evaluated by three faculty members including the project supervisor. CIS 690: Master's Thesis Prerequisite: Completion of three core courses. Research leading to submission of a formal thesis. This course provides a thesis experience, which offers a student the opportunity to work on a comprehensive research topic in the area of computer science in a scientific manner. Topic to be agreed in consultation with a supervisor. A written thesis must be completed in accordance with the rules of the Graduate School and the College of Engineering. Graded A-F. CIS 690: Master's Thesis Prerequisite: Completion of three core courses. Research leading to submission of a formal thesis. This course provides a thesis experience, which offers a student the opportunity to work on a comprehensive research topic in the area of computer science in a scientific manner. Topic to be agreed in consultation with a supervisor. A written thesis must be completed in accordance with the rules of the Graduate School and the College of Engineering. Graded A-F. CIS 690: Master's Thesis Prerequisite: Completion of three core courses. Research leading to submission of a formal thesis. This course provides a thesis experience, which offers a student the opportunity to work on a comprehensive research topic in the area of computer science in a scientific manner. Topic to be agreed in consultation with a supervisor. A written thesis must be completed in accordance with the rules of the Graduate School and the College of Engineering. Graded A-F. ResearchResearch awards $ 499,999 awarded by Commonwealth of Massachusetts for Mass Skills - Intelligent Industrial Robotics and Cyber Security Test Bed$ 286,754 awarded by Office of Naval Research for UMassD MUST IV: Automated Vulnerability and Backdoor Detection as a Part of Software Development Pipeline$ 1,218,640 awarded by National Science Foundation for CyberCorps Scholarship for Service: Accelerating Cybersecurity Education, Scholarship and Service$ 149,903 awarded by U.S. Department of the Army for Resilience Engineering of Machine Learning-enabled Open World Recognition for Network Intrusion Detection Systems ResearchResearch interestsCybersecurity for AISoftware SecurityData Security Additional linksProfessor Kul's Page Latest from Gokhan Mentioned inJul 10, 2025 Raquel Ana Bush '25, '26: Mind and machine Jan 31, 2023 The CyberCorps Scholarship for Service: Accelerating Cybersecurity Education, Scholarship and Service Contact 508-910-6484 gkul@umassd.edu Dion 307B Search staff directory Profile edit +t4 Back to top of screen CLOSE MAIN MENU Check My Status myUMassD Support UMassD Directory Search",
  "content_length": 6695,
  "method": "requests",
  "crawl_time": "2025-12-01 13:16:55"
}