{
  "name": "Günther Greiner",
  "homepage": "https://www.lgdv.tf.fau.de/person/guenther-greiner",
  "status": "success",
  "content": "Günther Greiner - Chair of Visual Computing Simulate organization breadcrumb open Simulate organization breadcrumb close Günther Greiner Günther Greiner Prof. i. R. Dr. Günther GreinerDepartment of Computer ScienceChair of Computer Science 9 (Computer Graphics)Cauerstraße 1191058 ErlangenPhone number: +49 9131 85-29919Email: guenther.greiner@fau.deWebsite: http://www9.informatik.uni-erlangen.de/people/card/guenther/greiner/ Publications 2020 Penk D., Sturm R., Seifert L., Stamminger M., Greiner G.:Reflective surface reconstruction from inverse deflectometric measurements15th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications, VISIGRAPP 2020 (Valletta, February 27, 2020 - February 29, 2020)In: Giovanni Maria Farinella, Petia Radeva, Jose Braz (ed.): VISIGRAPP 2020 - Proceedings of the 15th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications 2020DOI: 10.5220/0008968600760084BibTeX: Download 2017 Colaianni M., Siegl C., Süßmuth J., Bauer F., Greiner G.:Anisotropic deformation for local shape controlIn: Computational Visual Media (2017), p. tba.ISSN: 2096-0433DOI: 10.1007/s41095-017-0092-6BibTeX: Download Innmann M., Erhardt P., Schütz D., Greiner G.:Automatic Transfer of Landmarks on Human Skulls using GPU-based Non-rigid Registration15th EUROGRAPHICS Workshop on Graphics and Cultural Heritage (Graz, September 27, 2017 - September 29, 2017)In: The Eurographics Association (ed.): GCH 2017 - Eurographics Workshop on Graphics and Cultural Heritage 2017DOI: 10.2312/gch.20171304URL: https://diglib.eg.org:443/handle/10.2312/gch20171304BibTeX: Download 2016 Bertelshofer F., Brehm O., Fitzner P., Lammert J., Janka RM., Paulsen F., Greiner G.:Skully - An Educational Web Application for the Human SkullIn: Bildverarbeitung für die Medizin 2016, Springer, 2016, p. 248--253DOI: 10.1007/978-3-662-49465-3_44BibTeX: Download Colaianni M., Siegl C., Süßmuth J., Bauer F., Greiner G.:Anisotropic Surface Based DeformationSIGGRAPH ASIA 2016 (Macau, December 5, 2016 - December 8, 2016)In: Proceeding SA '16 SIGGRAPH ASIA 2016 Technical Briefs Article No. 1, New York, NY, USA: 2016DOI: 10.1145/3005358.3005361URL: http://dl.acm.org/citation.cfm?id=3005358.3005361BibTeX: Download Hoffmann R., Kranz F., Siegl C., Janka RM., Grosso R., Greiner G.:Automated Heart Localization in Cardiac Cine MR DataIn: Bildverarbeitung für die Medizin 2016, Springer, 2016, p. 116--121DOI: 10.1007/978-3-662-49465-3_22BibTeX: Download Sun L., Bertelshofer F., Greiner G., Böckmann R.:Characteristics of Sucrose Transport through the Sucrose-Specific Porin ScrY Studied by Molecular Dynamics Simulations.In: Frontiers in Bioengineering and Biotechnology 4 (2016), p. 9ISSN: 2296-4185DOI: 10.3389/fbioe.2016.00009BibTeX: Download 2015 Bertelshofer F., Sun L., Greiner G., Böckmann R.:GroPBS: Fast Solver for Implicit Electrostatics of Biomolecules.In: Frontiers in Bioengineering and Biotechnology 3 (2015), p. 186ISSN: 2296-4185DOI: 10.3389/fbioe.2015.00186URL: http://journal.frontiersin.org/article/10.3389/fbioe.2015.00186/abstractBibTeX: Download 2014 Bauer F., Dreyer B., Greiner G., Holdenried M., Riffelmacher B.:Blick in die Historikerwerkstatt: Informatik und Altertumswissenschaften - Vom Nutzen und Einsatz etablierter Methoden digitaler Visualisierungen auf Ausgrabungen in der Türkei (Metropolis, Ionien)In: Studentische Onlinezeitschrift für Geschichte und Geschichtsdidaktik, Mainz: Skriptum, 2014, p. 7-23 (Skriptum, Vol.1)URL: http://www.skriptum-geschichte.de/2014/heft-1/blick-in-die-historikerwerkstatt-informatik-und-altertumswissenschaften-vom-nutzen-und-einsatz-etablierter-methoden-digitaler-visualisierungen-auf-ausgrabungen-in-der-tuerkei-metropolis-ionien.htmlBibTeX: Download Greiner G., Zollhöfer M., Stamminger M., Colaianni M., Thies J.:Interactive Model-based Reconstruction of the Human Head using an RGB-D SensorIn: Computer Animation and Virtual Worlds 25 (2014), p. 213-222ISSN: 1546-4261DOI: 10.1002/cav.1584BibTeX: Download 2013 Zollhöfer M., Süßmuth J., Bauer F., Greiner G., Boß M.:Towards an Objective Geometrical Description of Antique BustsColour and Space in Cultural Heritage (Mainz, March 27, 2013 - March 27, 2013)URL: http://www.cosch.info/documents/14078/51859/WG+5_Zollh%C3%B6fer_GeoDesc.pdf/da67483d-fb90-48f4-82a4-8e79647d9066BibTeX: Download 2012 Grimm R., Bauer S., Sukkau J., Hornegger J., Greiner G.:Markerless estimation of patient orientation, posture and pose using range and pressure imaging: For automatic patient setup and scanner initialization in tomographic imagingIn: International Journal of Computer Assisted Radiology and Surgery 7 (2012), p. 921-929ISSN: 1861-6410DOI: 10.1007/s11548-012-0694-5BibTeX: Download 2011 Grimm R., Sukkau J., Hornegger J., Greiner G.:Automatic Patient Pose Estimation Using Pressure Sensing MattressesBildverarbeitung für die Medizin 2011 (Lübeck, March 20, 2011 - March 22, 2011)In: Handels Heinz, Ehrhardt Jan (ed.): Informatik aktuell, Berlin Heidelberg: 2011DOI: 10.1007/978-3-642-19335-4_84URL: http://www5.informatik.uni-erlangen.de/Forschung/Publikationen/2011/Grimm11-APP.pdfBibTeX: Download 2010 Süßmuth J., Protogerakis WD., Piazza A., Enders F., Naraghi R., Greiner G., Hastreiter P.:Color Encoded Distance Visualization for Analysis of Cranial Nerve-Vessel ContactsIn: International Journal of Computer Assisted Radiology and Surgery 5 (2010), p. 647-654ISSN: 1861-6410DOI: 10.1007/s11548-010-0410-2BibTeX: Download Teßmann M., Mohr S., Gayetskyy S., Hassler U., Hanke R., Greiner G.:Automatic Determination of Fiber-Length Distribution in Composite Material using 3D CT DataIn: EURASIP Journal on Advances in Signal Processing 2010 (2010), p. Article ID 545030ISSN: 1687-6172DOI: 10.1155/2010/545030URL: http://www.hindawi.com/journals/asp/2010/545030.htmlBibTeX: Download 2009 Süßmuth J., Piazza A., Enders F., Naraghi R., Greiner G., Hastreiter P.:Analysis and Visualization of Nerve-Vessel Contacts for Neurovascular DecompressionIn: Hans-Peter Meinzer Thomas Martin Deserno Heinz Handels Thomas Tolxdorff (ed.): Bildverarbeitung für die Medizin 2009 - Algorithmen Systeme, Anwendungen, Berlin/Heidelberg: Springer, 2009, p. 21-25 (Informatik aktuell)ISBN: 978-3540938590DOI: 10.1007/978-3-540-93860-6_5BibTeX: Download 2005 Greiner G., Hornegger J., Niemann H., Stamminger M. (ed.):Vision, Modeling, and Visualization 2005, Proc. of the International Workshop, Erlangen, GermanyBerlin: 2005ISBN: 3-89838-068-XBibTeX: Download 2004 Hülsemann F., Meinlschmidt S., Bergen B., Greiner G., Rüde U.:gridlib -- A parallel, object-oriented framework for hierarchical-hybrid grid structures in technical simulation and scientific visualizationSecond Joint HLRB and KONWIHR Result and Reviewing Workshop (München)In: High Performance Computing in Science and Engineering, Heidelberg: 2004URL: http://www.springeronline.com/sgw/cda/frontpage/0,11855,5-0-22-32100914-0,00.html?referer=www.springer.de/cgi/svcat/search_book.pl?isbn=3-540-44326-6BibTeX: Download 2003 Meinlschmidt S., Hülsemann F., Kipfer P., Rüde U., Greiner G.:A parallel, object-oriented framework for grid based simulation and scientific visualizationIn: Information and Communications Technologies: Chances and Challenges, Stuttgart: 2003BibTeX: Download 2002 Hülsemann F., Kipfer P., Rüde U., Greiner G.:gridlib: Flexible and efficient grid management for Simulation and VisualizationICCS 2002 (Amsterdam, April 21, 2002 - April 24, 2002)In: Computational Science - ICCS 2002, Berlin: 2002BibTeX: Download Kipfer P., Hülsemann F., Meinlschmidt S., Bergen B., Greiner G., Rüde U.:gridlib: A parallel, object-oriented framework for hierarchical-hybrid grid structure in technical simulation and scientific visualizationsHigh Performance Computing in Science and Engineering 2000 - 2002 (München)In: Transactions of the First Joint HLRB and KONWIHR Result and Reviewing Workshop, München: 2002BibTeX: Download",
  "content_length": 7979,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:06"
}