{
  "name": "Günther Specht",
  "homepage": "https://dbis-informatik.uibk.ac.at/specht",
  "status": "success",
  "content": "Specht | Databases and Information Systems Skip to main content Prof. Dr. Günther Specht guenther.specht [at] uibk.ac.at Scientific Leader Tel: +43 512 507 53220 Fax +43 512 507 53059 Office ICT building, 2nd floor, room 3S10 Publications 2024 Bib Link Amir Reza Mohammadi, Amir-Hossein Karimi, Mahdi Bohlouli, Eva Zangerle and Günther Specht: HPT4Rec: AutoML-based Hyperparameter Self-Tuning Framework for Session-based Recommender Systems. In Proceedings of the 34nd GI-Workshop Grundlagen von Datenbanksysteme (GvDB'23) . 2024 Bibtex × @InProceedings{murauer2022dtgrams, author = {Amir Reza Mohammadi and Amir{-}Hossein Karimi and Mahdi Bohlouli and Eva Zangerle and G{\\\"{u}}nther Specht}, booktitle = {Proceedings of the 34nd GI-Workshop Grundlagen von Datenbanksysteme (GvDB'23) }, title = {HPT4Rec: AutoML-based Hyperparameter Self-Tuning Framework for Session-based Recommender Systems}, year = {2024}, } Close Bib Link Michael M. Müller, Günther Specht, Lukas Kleinheinz and Janette F. Walde: Bias Correction and Machine Learning in AR(1) Estimation: Bridging Traditional and Modern Techniques. In Proceedings of the 35nd GI-Workshop Grundlagen von Datenbanksysteme (GvDB'24) . 2024 Bibtex × @InProceedings{murauer2022dtgrams, author = {Michael M. M{\\\"{u}}ller and G{\\\"{u}}nther Specht and Lukas Kleinheinz and Janette F. Walde}, booktitle = {Proceedings of the 35nd GI-Workshop Grundlagen von Datenbanksysteme (GvDB'24) }, title = {Bias Correction and Machine Learning in {AR(1)} Estimation: Bridging Traditional and Modern Techniques}, year = {2024}, } Close 2023 Bib Link Download Michael Vötter, Maximilian Mayerl, Eva Zangerle and Günther Specht: Song Popularity Prediction using Ordinal Classification. In Proceedings of the 20th Sound and Music Computing Conference. June 15-17, 2023. Stockholm, Sweden. Royal College of Music and KTH Royal Institute of Technology, 2023 Bibtex × @inproceedings{voetter@songpopordinal, author = {V\\\"{o}tter, Michael and Mayerl, Maximilian and Zangerle, Eva and Specht, G\\\"{u}nther}, title = {Song Popularity Prediction using Ordinal Classification}, year = 2023, booktitle = {Proceedings of the 20th Sound and Music Computing Conference. June 15-17, 2023. Stockholm, Sweden}, publisher = {Royal College of Music and KTH Royal Institute of Technology}, editor = {Roberto Bresin and Kjetil Falkenberg}, organization = {Royal College of Music and KTH Royal Institute of Technology} } Close Bib Link Download Maximilian Mayerl, Michael Vötter, Günther Specht and Eva Zangerle: Pairwise Learning to Rank for Hit Song Prediction. In BTW 2023. Gesellschaft für Informatik e.V., 2023 Bibtex × @inproceedings{mci/Mayerl2023, author = {Mayerl, Maximilian AND Vötter, Michael AND Specht, Günther AND Zangerle, Eva}, title = {Pairwise Learning to Rank for Hit Song Prediction}, booktitle = {BTW 2023}, year = {2023}, editor = {König-Ries, Birgitta AND Scherzinger, Stefanie AND Lehner, Wolfgang AND Vossen, Gottfried} , doi = { 10.18420/BTW2023-26 }, publisher = {Gesellschaft für Informatik e.V.}, address = {} } Close Bib Link Download Manfred Moosleitner, Günther Specht and Eva Zangerle: Detection of Generated Text Reviews by Leveraging Methods from Authorship Attribution: Predictive Performance vs. Resourcefulness. In BTW 2023. Gesellschaft für Informatik e.V., 2023 Bibtex × @inproceedings{mci/Moosleitner2023, author = {Moosleitner, Manfred and Specht, Günther and Zangerle, Eva}, title = {Detection of Generated Text Reviews by Leveraging Methods from Authorship Attribution: Predictive Performance vs. Resourcefulness}, booktitle = {BTW 2023}, year = {2023}, editor = {König-Ries, Birgitta AND Scherzinger, Stefanie AND Lehner, Wolfgang AND Vossen, Gottfried} , doi = { 10.18420/BTW2023-11 }, publisher = {Gesellschaft für Informatik e.V.}, address = {} } Close 2022 Bib Link Download Maximilian Mayerl, Stefan Brandl, Günther Specht, Markus Schedl and Eva Zangerle: Verse versus Chorus: Structure-aware Feature Extraction for Lyrics-based Genre Recognition. In Proceedings of the 23rd International Society for Music Information Retrieval Conference 2022, pages 884-890. ISMIR, 2022 Bibtex × @inproceedings{mayerl:ismir:2022, title = {Verse versus Chorus: Structure-aware Feature Extraction for Lyrics-based Genre Recognition}, author = {Mayerl, Maximilian and Brandl, Stefan and Specht, G{\\\"u}nther and Schedl, Markus and Zangerle, Eva}, year = 2022, booktitle = {Proceedings of the 23rd International Society for Music Information Retrieval Conference 2022}, publisher = {ISMIR}, series = {ISMIR '22}, pages = {884--890}, doi = {10.5281/zenodo.7316806} } Close Bib Link Download Robert Binna, Eva Zangerle, Martin Pichl, Günther Specht and Viktor Leis: Height Optimized Tries. In ACM Trans. Database Syst., vol. 47, no. 1. Association for Computing Machinery, 2022 Bibtex × @article{10.1145/3506692, author = {Binna, Robert and Zangerle, Eva and Pichl, Martin and Specht, G\\\"{u}nther and Leis, Viktor}, title = {Height Optimized Tries}, year = {2022}, issue_date = {March 2022}, publisher = {Association for Computing Machinery}, address = {New York, NY, USA}, volume = {47}, number = {1}, issn = {0362-5915}, url = {https://doi.org/10.1145/3506692}, doi = {10.1145/3506692}, abstract = {We present the Height Optimized Trie (HOT), a fast and space-efficient in-memory index structure. The core algorithmic idea of HOT is to dynamically vary the number of bits considered at each node, which enables a consistently high fanout and thereby good cache efficiency. For a fixed maximum node fanout, the overall tree height is minimal and its structure is deterministically defined. Multiple carefully engineered node implementations using SIMD instructions or lightweight compression schemes provide compactness and fast search and optimize HOT structures for different usage scenarios. Our experiments, which use a wide variety of workloads and data sets, show that HOT outperforms other state-of-the-art index structures for string keys both in terms of search performance and memory footprint, while being competitive for integer keys.}, journal = {ACM Trans. Database Syst.}, month = {apr}, articleno = {3}, numpages = {46}, keywords = {main memory, SIMD, Height optimized trie, index structure} } Close Bib Link Download Manfred Moosleitner, Günther Specht and Eva Zangerle: Co-rating Attacks on Recommendation Algorithms. In Proceedings of the 32nd GI-Workshop Grundlagen von Datenbanksysteme (GvDB'21) . 2022 Bibtex × @InProceedings{moosleitner2022corattingattacks, author = {Moosleitner, Manfred and Specht, G\\\"{u}nther and Zangerle, Eva}, booktitle = {Proceedings of the 32nd GI-Workshop Grundlagen von Datenbanksysteme (GvDB'21) }, title = {{Co-rating Attacks on Recommendation Algorithms}}, year = {2022}, } Close Bib Link Download Benjamin Murauer and Günther Specht: DT-grams: Structured Dependency Grammar Stylometry for Cross-Language Authorship Attribution. In Proceedings of the 32nd GI-Workshop Grundlagen von Datenbanksysteme (GvDB'21) . 2022 Bibtex × @InProceedings{murauer2022dtgrams, author = {Murauer, Benjamin and Specht, G\\\"{u}nther}, booktitle = {Proceedings of the 32nd GI-Workshop Grundlagen von Datenbanksysteme (GvDB'21) }, title = {{DT-grams: Structured Dependency Grammar Stylometry for Cross-Language Authorship Attribution}}, year = {2022}, } Close 2021 Bib Link Download Maximilian Mayerl, Michael Vötter, Andreas Peintner, Günther Specht and Eva Zangerle: Recognizing Song Mood and Theme: Clustering-based Ensembles. In Working Notes Proceedings of the MediaEval 2021 Workshop. ceur-ws.org, 2021 Bibtex × @inproceedings{mayerlRecognizingSongMood2021, title = {Recognizing Song Mood and Theme: Clustering-based Ensembles}, booktitle = {Working Notes Proceedings of the MediaEval 2021 Workshop}, publisher = {ceur-ws.org}, author = {Mayerl, Maximilian and Vötter, Michael and Peintner, Andreas and Specht, Günther and Zangerle, Eva}, month = {12}, year = {2021}, } Close Bib Link Download Michael Vötter, Maximilian Mayerl, Günther Specht and Eva Zangerle: Novel Datasets for Evaluating Song Popularity Prediction Tasks. In IEEE International Symposium on Multimedia, ISM 2021, Virtual Event, November 29 - December 1, 2021, pages 166-173. IEEE, 2021 Bibtex × @inproceedings{voetter:ism:2021, author = { Michael V\\\"{o}tter and Maximilian Mayerl and G\\\"{u}nther Specht and Eva Zangerle}, title = {Novel Datasets for Evaluating Song Popularity Prediction Tasks}, booktitle = {{IEEE} International Symposium on Multimedia, {ISM} 2021, Virtual Event, November 29 -- December 1, 2021}, pages = {166--173}, publisher = {{IEEE}}, year = {2021}, doi = {10.1109/ISM52913.2021.00034}, } Close Bib Link Download Benjamin Murauer and Günther Specht: Developing a Benchmark for Reducing Data Bias in Authorship Attribution. In Proceedings of the Second Workshop on Evaluation and Comparison of NLP Systems (Eval4NLP'21). 2021 Bibtex × @InProceedings{murauer2021authbench, author = {Murauer, Benjamin and Specht, G\\\"{u}nther}, booktitle = {Proceedings of the Second Workshop on Evaluation and Comparison of NLP Systems (Eval4NLP'21)}, title = {{Developing a Benchmark for Reducing Data Bias in Authorship Attribution}}, publisher = {Association for Computational Linguistics}, year = {2021}, pages = {179--188} } Close Bib Link Download Benjamin Murauer and Günther Specht: Small-Scale Cross-Language Authorship Attribution on Social Media Comments. In Proceedings of the 4th Workshop on Technologies for MT of Low Resource Languages (LoResMT2021), pages 11-19. 2021 Bibtex × @inproceedings{murauer-specht-2021-small, title = \"Small-Scale Cross-Language Authorship Attribution on Social Media Comments\", author = \"Murauer, Benjamin and Specht, G\\\"{u}nther\", booktitle = \"Proceedings of the 4th Workshop on Technologies for MT of Low Resource Languages (LoResMT2021)\", month = aug, year = \"2021\", url = \"https://aclanthology.org/2021.mtsummit-LoResMT.2\", pages = \"11--19\", year = {2021}, pages = {11--19}, } Close Bib Link Günther Spe",
  "content_length": 16046,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:05"
}