{
  "name": "Günther R. Raidl",
  "homepage": "https://www.ac.tuwien.ac.at/people/raidl",
  "status": "success",
  "content": "Günther Raidl – Algorithms and Complexity Group Günther Raidl » Ao.Univ.Prof. Dipl.-Ing. Dr.techn. contact | research | organizational activities | publications Contact Information Address: Günther Raidl Technische Universität Wien Institute of Logic and Computation Favoritenstraße 9–11, E192-01 1040 Wien Austria Room: HC0407 Phone: +43(1)58801–192116 Fax: +43(1)58801–9192116 Email: raidl@ac.tuwien.ac.at Web: http://www.ac.tuwien.ac.at/people/raidl/ Office Hours: by appointment ORCID: https://orcid.org/0000-0002-3293-177X Research Interests Solving algorithmic problems arising in various application domains, e.g. network design and other problems on graphs, transportation optimization, cutting and packing, computational biology, scheduling and timetabling Combinatorial optimization by means of exact techniques including mathematical programming, branch and bound, dynamic programming, constraint programming as well as heuristics and metaheuristics Machine learning, reinforcement learning A particular focus lies in hybrid optimization techniques combining concepts of (meta-)heuristics, exact optimization techniques, and machine learning. Efficient algorithms and data structures in general. Also see the group's research page. International Organizational Activities Board Memberships etc.: Faculty member of the Vienna Graduate School on Computational Optimization (VGSCO), since 2017. Editorial board member of the Algorithms journal , MDPI, since 2020. Editorial board member of the journal Engineering Applications of Artificial Intelligence, Elsevier, since 2022. Associate editor for ACM Transactions on Evolutionary Learning and Optimization​, since 2019. Associate editor of the INFORMS Journal on Computing, since 2013. Editorial board member of the Metaheuristics journal, Springer, since 2018. Associate editor of the Evolutionary Computation Journal, MIT Press, 2005-2014, editorial board member since 2015. Associate editor of the International Journal of Metaheuristics, Inderscience, since 2007. Editorial board member of the journal Journal of Artificial Evolution and Applications, Hindawi Publishing, 2007-2010. Editorial board member of the journal Memetic Computing, Springer, since 2007. Editorial board member of the International Journal of Applied Metaheuristic Computing, IGI Global, since 2010 Co-founder and member of the steering committee of the Conference Series on Evolutionary Computation in Combinatorial Optimization, EvoCOP. Steering committee member of EvoAPPS, the Int. Conference Series on Applications of Evolutionary Computation, since 2018. We have participated in the European Marie Curie Research Training Network on Algorithmic and Discrete Optimization (ADONET) and I was TU Wien's local coordinator. Executive Board member of ÖGOR, the Austrian Society of Operations Research, 2013-2016. Management Board member of EU COST Action CA15140 Improving Applicability of Nature-Inspired Optimisation by Joining Theory and Practice (ImAppNIO) since January 2016 Some (more or less) recent major activities: Co-Chair of the Workshop on Theory and Applications of Metaheuristic Algorithms at the 19th International Conference on Computer Aided Systems Theory, Gran Canaria, Spain, February 2024. Local chair of SoCS 2022: The International Symposium on Combinatorial Search, Vienna, Austria, July 2022. Program Chair of the 10th Metaheuristic International Conference (MIC) 2013, Singapore, August 2013. Local Co-Organizer of EvoStar 2013, The Leading European Event on Bioinspired Computation, Vienna, Austria, April 2013. General and Local Chair of the Hybrid Metaheuristics Workshop, Vienna, Austria, October 1-2, 2010. Co-Chair of the Evolutionary & Metaheuristic Combinatorial Optimization Track of the 2011 Genetic and Evolutionary Computation Conference (GECCO), Dublin, Ireland, July 2011. Editor-in-Chief and Program Chair of GECCO 2009, the 11th Annual Genetic and Evolutionary Computation Conference 2009, ACM, Montreal, Canada, July 2009. IEEE Computational Intelligence Society Emergent Technology Technical Committee Member (IEEE CIS ETTC), 2012. EvoStar \"Old Croc\" Award for Outstanding Contributions to Evolutionary Computation in Europe, April 2012 Finally, find here a detailed list of most of my past and present international organisational activities. Publications Supervised theses Alternative PDF list of publications 327 results [327]Parallel Beam Search for Combinatorial OptimizationNikolaus Frohner, Jan Gmys, Nourdine Melab, Günther Raidl, El-ghazali TalbiWorkshop Proceedings of the International Conference on Parallel Processing (ICPP 2022), pages 1–8, ACM Press. [bibtex] [doi] 2026 [326]Complexity of Positive Influence Domination on Partial GridsEnrico Iurlano, Günther R. RaidlFundamentals of Computation Theory—25th International Symposium (Artur Je\\.z, Jan Otop, eds.), volume 16106 of LNCS, pages 267–280, 2026, Springer.Note: in press. [bibtex] [pdf] [doi] 2025 [325]Tackling the Alpha-Domination Problem HeuristicallyEnrico Iurlano, Johannes Varga, Günther R. RaidlComputer Aided Systems Theory – EUROCAST 2024 (Alexis Quesada-Arencibia, Michael Affenzeller, Roberto Moreno-Díaz, eds.), volume 15172 of LNCS, pages 148–156, 2025, Springer. [bibtex] [pdf] [doi] [324]Learning to Select Promising Initial Solutions for Large Neighborhood Search-Based Multi-Agent Path FindingMarc Huber, Günther R. Raidl, Christian BlumComputer Aided Systems Theory – EUROCAST 2024 (Alexis Quesada-Arencibia, Michael Affenzeller, Roberto Moreno-Díaz, eds.), volume 15172 of LNCS, pages 236-250, 2025, Springer. [bibtex] [pdf] [doi] [323]Improvements in Large Neighborhood Search for the Electric Autonomous Dial-A-Ride ProblemMaria Bresich, Günther R. Raidl, Steffen LimmerComputer Aided Systems Theory – EUROCAST 2024 (Alexis Quesada-Arencibia, Michael Affenzeller, Roberto Moreno-Díaz, eds.), volume 15172 of Lecture Notes in Computer Science (LNCS), pages 211–220, 2025, Springer. [bibtex] [pdf] [doi] [322]A Learning Twolevel Optimization Approach for the Demand Maximizing Battery Swapping Station Location ProblemLaurenz Tomandl, Thomas Jatschka, Günther Raidl, Tobias RodemannComputer Aided Systems Theory – EUROCAST 2024 (Alexis Quesada-Arencibia, Michael Affenzeller, Roberto Moreno-Díaz, eds.), pages 251–262, 2025, Springer Nature Switzerland. [bibtex] [pdf] [321]Genetic Programming Hyper-Heuristic for the Dynamic Electric Dial-a-Ride ProblemWilliam Huang, Yi Mei, Gunther Raidl, Fangfang Zhang, Laurenz Tomandl, Steffen Limmer, Mengjie Zhang, Tobias Rodemann2025 IEEE Congress on Evolutionary Computation (CEC), pages 1-8, 2025. [bibtex] [pdf] [doi] [320]SAT-Based Search for Minwise Independent FamiliesEnrico Iurlano, Günther R. Raidl2025.Note: preprint [bibtex] [pdf] [319]The Graph Burning Problem under Constrained DiffusionEnrico Iurlano, Günther R. Raidl, Marko Djukanović2025.Note: preprint, accepted [bibtex] [pdf] 2024 [318]Scheduling Jobs Using Queries to Interactively Learn Human Availability TimesJohannes Varga, Günther R. Raidl, Elina Rönnberg, Tobias RodemannComputers & Operations Research, 2024. [bibtex] [doi] [317]Exact methods for the Selective Assessment Routing ProblemJoan Salvà Soler, Vera C. Hemmelmayr, Günther R. RaidlCentral European Journal of Operations Research, 2024. [bibtex] [doi] [316]A Biased Random Key Genetic Algorithm for Solving the Longest Common Square Subsequence ProblemJaume Reixach, Christian Blum, Marko Djukanović, Günther R. RaidlIEEE Transactions on Evolutionary Computation, volume , number , pages , 2024.Note: early access [bibtex] [doi] [315]Signed double Roman domination on cubic graphsEnrico Iurlano, Tatjana Zec, Marko Djukanovic, Günther R. RaidlApplied Mathematics and Computation, volume 471, pages 128612, 2024, Elsevier. [bibtex] [pdf] [doi] [314]Speeding up Logic-Based Benders Decomposition by Strengthening Cuts with Graph Neural NetworksJohannes Varga, Emil Karlsson, Günther R. Raidl, Elina Rönnberg, Fredrik Lindsten, Tobias RodemannMachine Learning, Optimization, and Data Science. LOD 2023. (Giuseppe Nicosia, Varun Ojha, Emanuele La Malfa, Gabriele La Malfa, Panos M. Pardalos, Umeton Renato, eds.), volume 14505 of lNCS, pages 24–38, 2024, Springer. [bibtex] [pdf] [doi] [313]Selecting User Queries in Interactive Job SchedulingJohannes Varga, Günther R. Raidl, Tobias Todemann19th International Conference on Computer Aided Systems Theory, 2024, Springer.Note: to appear [bibtex] [pdf] [312]A Multilevel Optimization Approach for Large Scale Battery Exchange Station Location PlanningJaume Reixach, Christian Blum, Marko Djukanović, Günther R. RaidlEvolutionary Computation in Combinatorial Optimization – 23rd European Conference, EvoCOP 2024 (T. Stützle, M. Wagner, eds.), volume 14632 of LNCS, pages 1–15, 2024, Springer.Note: best paper award winner [bibtex] [pdf] [doi] [311]A Simulated Annealing Based Approach for the Roman Domination ProblemJakob Greilhuber, Sophia Schober, Enrico Iurlano, Günther R. RaidlMetaheuristics and Nature Inspired Computing (Bernabé Dorronsoro, Rachid Ellaia, El-Ghazali Talbi, eds.), volume 2016 of CCIS, pages 28–43, 2024, Springer. [bibtex] [pdf] [doi] [310]Letting a Large Neighborhood Search for an Electric Dial-A-Ride Problem Fly: On-The-Fly Charging Station InsertionMaria Bresich, Günther R. Raidl, Steffen LimmerProceedings of the Genetic and Evolutionary Computation Conference, pages 142–150, 2024, Association for Computing Machinery.Note: best paper award winner of ECOM track [bibtex] [pdf] [doi] [309]Mixed Integer Linear Programming Based Large Neighborhood Search Approaches for the Directed Feedback Vertex Set ProblemMaria Bresich, Johannes Varga, Günther R. Raidl, Steffen LimmerMetaheuristics and Nature Inspired Computing (Bernabé Dorronsoro, Rachid Ellaia, El-Ghazali Talbi, eds.), pages 3–20, 2024, Springer. [bibtex] [pdf] [doi] 2023 [308]Large Neighborhood Search for Electric Vehicle Fleet SchedulingSteffen Limmer, Johannes Varga, Günther R. RaidlEnergies, volume 16, nu",
  "content_length": 103008,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:08"
}