{
  "name": "Günther Schatter",
  "homepage": "https://www.uni-weimar.de/de/medien/professuren/medieninformatik/vernetzte-medien/personen/apl-prof-dr-guenther-schatter",
  "status": "success",
  "content": "Bauhaus-Universität Weimar: apl. Prof. Dr. Günther Schatter Kontakt und Infos Vorlesung: Praktische und Technische Informatik Vorlesung: Elektronik und Mikrocontroller Vorlesung: Praktische und Technische Informatik Vorlesung: Elektronik und Mikrocontroller Vorlesung: Elektrotechnik und SystemtheorieVorlesung: Praktische und technische Informatik Vorlesung: Elektronik und Mikrocontroller Vorlesung: Elektrotechnik und SystemtheorieVorlesung: Praktische und technische Informatik Vorlesung: Elektronik und Mikrocontroller Vorlesung: Elektrotechnik und SystemtheorieVorlesung: Grundlagen der Informatik Vorlesung: Elektronik und Mikrocontroller Vorlesung: Grundlagen der InformatikVorlesung: Elektronik und Mikrocontroller Vorlesung: Elektrotechnik und Systemtheorie Vorlesung: Audiotechnik Projekt:     Text to sound Projekt:     Mental Radio revisited. Upton Sinclair & Alvin Lucier and the media. Vorlesung: Einführung in die InformatikVorlesung: Elektronik und MikrocontrollerVorlesung: Medienrecht (Gast Dr. Vinke) Vorlesung: Elektrotechnik und Systemtheorie Vorlesung: Audiotechnik Vorlesung: Elektronik und MikrocontrollerVorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     Measurement of attentivness with BCI Projekt:     Binaural beats for auditory event-related potentials Vorlesung: Einführung in die Informatik Vorlesung: Elektronik und MesstechnikWerkstatt:  Audio - Simulation und Extraktion Vorlesung: Elektronik und MesstechnikVorlesung: Elektrotechnik und Systemtheorie Vorlesung: AudiotechnikVorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     Mental radio with music from text translationProjekt:     Brain Computer Interfaces and the measurement of attentivness Vorlesung: Information und Codierung Vorlesung: Einführung in die InformatikVorlesung: Elektronik und Messtechnik Projekt:     Auditory Event-Related Potentials for a Mental Radio Projekt:     Attention Measurement with Brain Computer Interfaces Vorlesung: Elektronik und MesstechnikVorlesung: Elektrotechnik und Systemtheorie Vorlesung: AudiotechnikVorlesung: Medienrecht (Gast Dr. Vinke) Projekt:      Hybrid Brain Computer InterfacesProjekt:      Analysis of Audio Event Related Potentials Vorlesung: Information und Codierung Vorlesung: Einführung in die InformatikWerkstatt:  Audio - Simulation und Extraktion Projekt:      Human auditory evoked potentials Projekt:      Neuroergonomics and attention Vorlesung: Elektrotechnik und Systemtheorie Vorlesung: AudiotechnikVorlesung: Medienrecht (Gast Dr. Vinke) Projekt:      Decision making and the brain Projekt:      Auditory evoked potentials Vorlesung: Information und Codierung Vorlesung: Einführung in die InformatikWerkstatt:  Audio - Simulation und Extraktion Projekt:      Sound recovery and mental responses Projekt:      Mind-machine interface and mobility Vorlesung: Elektrotechnik und Systemtheorie Vorlesung: AudiotechnikVorlesung: Medienrecht (Gast Dr. Vinke) Projekt:      Neurological Control Projekt:      Acoustic Brainwaves Vorlesung: Information und Codierung Vorlesung: Einführung in die InformatikWerkstatt:  Audio - Simulation und Extraktion Projekt:      Neuro Orientierung Projekt:      Audio BCI Vorlesung: Elektrotechnik und Systemtheorie Werkstatt: Audio - Simulation und Extraktion Vorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     Emotionserfassung und MedienProjekt:     Sprachnavigation Vorlesung: Information und Codierung Vorlesung: Einführung in die Informatik Projekt:     Radio Metadata Projekt:     Talking with your face turned away Vorlesung: Elektrotechnik und Systemtheorie Vorlesung: Audiotechnik Projekt:     Speak with your heartProjekt:     Medien, Gefühle, Emotionen Vorlesung: Information und Codierung Vorlesung: Einführung in die Informatik Seminar:    Flaschenpost für die Zukunft. Heiner Müller und das Radio der 80er und 90er JahreVorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     Self organizing maps for audio controlProjekt:     Sprachsteuerung für Audiogeräte Vorlesung: Mediale Systeme 2 Vorlesung: Audiobearbeitung Projekt:     Audio DisplayProjekt:     Speak softly Vorlesung: Mediale Systeme 1 Vorlesung: Elektrische und Elektronische SystemeVorlesung: Einführung in die Informatik Vorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     Mediale Sonifikation Projekt:     Natural Language and Emotion Understanding Vorlesung: Mediale Systeme 2 Vorlesung: Audiobearbeitung Vorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     Desiring Machine Projekt:     Hable con ella (Sprich mit ihr) Vorlesung: Einführung in die Informatik Vorlesung: Mediale Systeme 1 Vorlesung: Elektrische und Elektronische Systeme Projekt:     Making Things Talk Projekt:     Die Wunschmaschine Vorlesung: Mediale Systeme 2 Vorlesung: Audiobearbeitung Vorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     iRadio Vorlesung: Einführung in die Informatik Vorlesung: Mediale Systeme 1 Vorlesung: Elektrische und Elektronische Systeme Projekt:     RadioVision 07 Vorlesung: Mediale Systeme 2 Vorlesung: Audiobearbeitung Vorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     Enhanced Radio 2.1 Vorlesung: Einführung in die Informatik Vorlesung: Mediale Systeme 1 Vorlesung: Elektrische und Elektronische Systeme Vorlesung: Vernetzte Systeme Projekt:     Service Radio Digital Projekt:     Audio Space Morphing Seminar:    Graue Atmosphäre. Rolf Dieter Brinkmann und das Radio der 60er und 70er Jahre Vorlesung: Mediale Systeme 2 Vorlesung: Elektronische Systeme Vorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     Radio iPotlatch Vorlesung: Einführung in die Informatik Vorlesung: Mediale Systeme 1 Vorlesung: Elektrische und Elektronische Systeme Vorlesung: Vernetzte Systeme Projekt:     Digital Audio Effects DAFX Projekt:     \tpodcast@university Vorlesung: Audiobearbeitung Vorlesung: Mediale Systeme 2 Vorlesung: Elektronische Systeme</a Vorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     TonArt Seminar:    Ferne Stimmen Arno Schmidt und das Radio der 50er und 60er Jahre Vorlesung: Mediale Systeme 1 Vorlesung: Gerätearchitektur Vorlesung: Vernetzte Systeme Projekt:     Klangraum Vorlesung: Mediale Systeme 2 Vorlesung: Elektronische Systeme</a Vorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     Streaming Projekt:     Anaesthesia? Synaesthesia. Synthesizer! Vorlesung: Mediale Systeme 1 Vorlesung: Vernetzte Systeme Vorlesung: Rechner- und Betriebssysteme Vorlesung: Gerätearchitektur Projekt:     uni.tv.net/++ Projekt:     Visual VSTi Vorlesung: Mediale Systeme 2 Vorlesung: Mobile Affektive Ubiquitäre Systeme Vorlesung: Einführung in die Projektarbeit Vorlesung: Thüringen auf dem Weg in die Informationsgesellschaft Vorlesung: Medienrecht (Gast Dr. Vinke) Projekt:     Mit Sicherheit mobil Projekt:     uni.tv.net Seminar:    Preislied. Radio-Kunstpreise im Wandel Vorlesung: Mediale Systeme 1 Vorlesung: Rechner- und Betriebssysteme Vorlesung: Gerätearchitektur Projekt:     Drahtlos Vorlesung: Mediale Systeme 2 Vorlesung: Netze Projekt:     Lernen mit Marconi Vorlesung: Mediale Systeme 1 Vorlesung: Rechner- und Betriebssysteme Vorlesung: Gerätearchitektur Vorlesung: Mediale Systeme 2 Fachkurs:   Systemprogrammierung Seminar:    radioselbst Projekt:     eCom tech Vorlesung: Mediale Systeme 1 - Grundlagen Vorlesung: Rechner- und Betriebssysteme Vorlesung: Gerätearchitektur Vorlesung: Mediale Systeme 2 - Prinzipien und Anwendungen Vorlesung: Betriebssysteme Fachkurs:   Technik der Systemprogrammierung Fachkurs:   Elektronischer Handel in Netzen Vorlesung: Mediale Systeme 1 - Grundlagen Vorlesung: Rechner- und Betriebssysteme Vorlesung: Gerätearchitektur Seminar:    L'Arte dei Rumori - Die Geräuschkunst Vorlesung: Mediale Kommunikation</a Vorlesung: Computer-System-Architektur Projekt:     Dario 2(hier war einst:) Das neue Radioprojekt Dario 2 Seminar:    Kunststück Hörstück Vorlesung: Einführung in die Medientechnik Vorlesung: Rechner- und Betriebssysteme Projekt:     /radio/ (hier Konzept Nr. 1) Projekt:     /radio/(hier war:) Der Report Dario 1Chronologie der ersten Radio-Aktivitäten an der Bauhaus-Universität Weimar. Vorlesung: Einführung in die Medientechnik Projekt:     Radiovision 2Bildgeschichten im Digitalen Radio erzählen Fachkurs:   Produktion von Multimedia-CD Vorlesung: Rechnernetze - Protokolle und Programmierung Vorlesung: Rechner- und Betriebssysteme Projekt:     RadiovisionDas Neue Digitale Radio - Digital Audio Broadcasting DAB Seminar:    Radiotheorie Projekt:     Klein aber Internet - Public Relations online Vorlesung: Betriebssysteme - Konzepte und Administration Kolloquium: Medientechnik Vorlesung: UNIX 2 Vorlesung: Rechnerarchitektur Vorlesung: Rechnernetze - Technische Grundlagen Vorlesung: Rechner- und Betriebssysteme Vorlesung: Rechnernetze für Bauingenieure Fachkurs:   Rechner- und Betriebssysteme Fachkurs: Netzzeitung - digitale Printmedien Projekt:     Campus:Information:System Vorlesung: Betriebssysteme und Systemprogrammierung Vorlesung: Rechnernetze für Bauingenieure Vorlesung: UNIX 1 Seminar: Aktion - Reaktion - Interaktion Dr. Bernd Schalbeapl. Prof. Dr. Günther SchatterInformation und CodierungEinführung in die InformatikElektrotechnik und SystemtheorieAudiotechnikElektronik und MesstechnikElektronik und MikrocontrollerProjekteSeminarePraxiswerkstattMedienrecht Barrierefreiheit  Leichte Sprache Informationen über die Bauhaus-Universität Weimar. Kontrast-Einstellungen lesen Sie mehr über diese Einstellung Wechsel zwischen Farb- und Schwarz-Weiß-Ansicht Kontrastansicht aktiv Kontrastansicht nicht aktiv Anschalten Kontrastansicht einschalten Ausschalten Kontrastansicht ausschalten Darkmode für lichtsensitive Augen lesen Sie mehr über diese Einstellung Wechsel der Hintergrundfarbe von Weiß zu Schwarz Darkmode aktiv Darkmode nicht aktiv Ausschalten Darkmode deaktivieren Anschalten aktiviere Darkmode Klick- und Fokus-Feedback lesen Sie mehr über diese Einstellung Fokussierte Elemente werden schwarz hinterlegt und so visuell hervorgehoben. Feedback aktiv Feedback nicht aktiv Ausschalten Feedback ausschalten Anschalten Feedb",
  "content_length": 10238,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:05"
}