{
  "name": "H. Andrés Neyem",
  "homepage": "http://www.andresneyem.cl",
  "status": "success",
  "content": "Andres Neyem's Site Welcome to my space!About Me ...My PassionContact Me Welcome to my space!Andres Neyem About Me ... Professor, Department of Computer Science, School of Engineering UCDiploma in Information Systems, School of Exact, Physical and Natural Sciences, Universidad Nacional de San Juan, ArgentinaMaster of Science, Universidad de ChilePhD, Universidad de Chile Research Interests Areas:Software Engineering, Mobile and Cloud Computing, Engineering and Medical Education, Computer Supported Collaborative WorkMy Passion ...Best practices for software developmentFifty years ago, few people could have imagined the world we are living in today. Advances in mobile and embedded computing and the explosive growth of cloud computing are driving a revolutionary change in the way people communicate, interact, and work with each other and how companies do business. Mobile and cloud computing are converging in the new, rapidly growing field of Cloud-based Mobile Systems. The combination of mobile and cloud computing not only fosters a new generation of mobile applications, but also brings with it new research issues and questions. My research pursues topics related to these research areas. From a Software Engineering perspective, my special interest is focused on providing best practice guidelines for software development in this field. Augmented mobile devices via the cloud are able to perform extensive computations and to store big data beyond their intrinsic capabilities. However, developing software applications for mobile work scenarios is considered a challenging task, not only because of limitations in the frontend, but also because the cloud-based backend, needed to take advantage of this augmentation, introduces new challenges and requirements. These include environment, security, and performance requirements. My research is focused on understanding the requirements, design, building, and applicability of new software architectures and cloud services for a mobile environment. The goal is for the results serve as guidelines for designing and building software solutions for this domain-specific application scenario. This will allow developers, students, or researchers of this type of solution to generate better systems involving less effort and fewer risks. These results will not only benefit the academic community, but also, indirectly, the software industry and other areas of our society. I am leading undergraduate and graduate students in developing software solutions for this type of mobile environment. I have not only published several papers for conferences, proceedings, and journals in this research area, but I also have made several software products to these types of systems. Some examples of my most notable projects are LiveANDES (Advanced Network for the Distribution of Endangered Species) and SmartBoard a cloud-based mobile system for improving software engineering education. LiveANDES is a software platform designed to collect, store, and analyze data about Latin America’s wildlife - data that could prove vital to the preservation of the region’s rich but increasingly threatened biodiversity. One of the goals of this cloud-based platform is to hide large-scale data complexities and their subsequent processing and transformation from end users. Shifting large volumes of data to the cloud provides a flexible and scalable platform for developing a variety of scientific data processing tasks. Finally, SmartBoard is a software platform designed for software engineering education offers all the necessary features that allow for project traceability and has been integrated with a proven capstone course framework implementation to ensure the proper fulfillment of most academic and engineering needs. It is an integral cloud-based project tracking platform for both professional and learning environments, built from the ground up to support most of the requirements of agile projects. Together, we can build the next step in computing and technology.You're more powerful than you think. Ready?. What do you want to do next? Name Email Message Synapsis Comment© 2018 Andres Neyem Cookie Use We use cookies to ensure a smooth browsing experience. By continuing we assume you accept the use of cookies. Accept Learn More",
  "content_length": 4293,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:05"
}