{
  "name": "H. Howie Huang",
  "homepage": "https://www2.seas.gwu.edu/~howie",
  "status": "success",
  "content": "Howie Huang; GraphLab@GWU; Graph AI, Cybersecurity, Computer Systems Howie Huang Professor of Computer Engineering Professor of Computer Science (by courtesy) GraphLab The George Washington University Graph AI Cyber Security Computer Systems More Contact Recent News Check out our publications and GitHub repository May 2025 - Two papers Trail and Revelio were presented at ICDE'25 Apr 2025 - The CAGE 4 Challenge work was presented at AAAI-IAAI'25 Nov 2024 - The Prompt has Evil Twins paper was presented at EMNLP'24 Aug 2024 - The NetHawk paper was accepted by CNS'24 Mar 2024 - JITSPMM received a Distinguished Paper Award at CGO'24 Nov 2023 - The JITSpMM work on just-in-time instruction generation for accelerated sparse matrix-matrix multiplication was accepted by CGO'24 Oct 2023 - The EdgeTorrent paper on learning real-time temporal graph representation for intrusion detection was presented at RAID'23 Jun 2022 - The Mnemonic paper on parallel subgraph matching was presented at IPDPS'22 Jun 2022 - Our Illuminati work on GNN explanation for cybersecurity analysis was presented at EuroS&P'22 Mar 2022 - Our Euler paper on detecting network lateral movement was presented at NDSS'22 Service Associate Editor for IEEE Transactions on Parallel and Distributed Systems Associate Editor for IEEE Transactions on Cloud Computing General Co-Chair: HPDC'17 Technical Program Committees: ICDCS'22, AAAI'21, FAST'20, HPDC'20, ICDCS'20, SC'19, ISC'19, USENIX ATC'18, SC'18, ICS'18, IPDPS'17, SC'16, eScience'16, DAC'16, CLOUD'16, BigData'16 NSF Aspiring CSR PIs Workshop 2018 NSF CISE CAREER Workshop 2015 Euler I. King, H. Huang. Euler: Detecting Network Lateral Movement via Scalable Temporal Graph Link Prediction. NDSS'22. Illuminati H. He, Y. Ji, H. Huang. Illuminati: Towards Explaining Graph Neural Networks for Cybersecurity Analysis. EuroSP'22. CyberGraph B. Bowman, C. Laprade, Y. Ji, H. Huang. Detecting Lateral Movement in Enterprise Computer Networks with Unsupervised Graph AI. RAID'20. VGraph B. Bowman, H. Huang. VGraph: A Robust Vulnerable Code Clone Detection System Using Code Property Triplets. EuroSP'20. GraphOne P. Kumar, H. Huang. GraphOne: A Data Store for Real-time Analytics on Evolving Graphs . FAST'19. CECI B. Bhattarai, H. Liu, H. Huang. CECI: Compact Embedding Cluster Index for Scalable Subgraph Matching. SIGMOD'19. iSpan Y. Ji, H. Liu, H. Huang. iSpan: Parallel Identification of Strongly Connected Components with Spanning Trees. SC'18. TriCore Y. Hu, H. Liu, H. Huang. TriCore: Parallel Triangle Counting on GPUs. SC'18 Falcon P. Kumar, H. Huang. Falcon: Scaling IO Performance in Multi-SSD Volumes. USENIX ATC'17. Graphene H. Liu, H. Huang. Graphene: Fine-Grained IO Management for Graph Computing. FAST'17. G-Store P. Kumar, H. Huang. G-Store: High-Performance Graph Store for Trillion-Edge Processing. SC'16. iBFS H. Liu, H. Huang, Y. Liu. iBFS: Concurrent Breadth-First Search on GPUs. SIGMOD'16. Enterprise H. Liu, H. Huang. Enterprise: Breadth-First Graph Traversal on GPUs. SC'15. IOrchestra R. Chiang, H. Huang, T. Wood, C. Liu, O. Spatscheck. IOrchestra: Supporting High-Performance Data-Intensive Applications in the Cloud via Collaborative Virtualization. SC'15. Cloud X. Xu, H. Huang. On Soft Error Reliability of Virtualization Infrastructure. IEEE Transactions on Computers. TC'16. Swiper R. C. Chiang, S. Rajasekaran, N. Zhang, H. H. Huang. Swiper: Exploiting Virtual Machine Vulnerability in Third-Party Clouds with Competition for I/O Resources. IEEE Transactions on Parallel and Distributed Systems. TPDS'15. Matrix R. Chiang, J. Hwang, H. Huang, T. Wood. Matrix: Achieving Predictable Virtual Machine Performance in the Clouds. ICAC'14 Flash X. Xu, H. Huang. Exporing Data-Level Error Tolerance in High-Performance Solid-State Drives. IEEE Transactions on Reliability. TR'15 TRACON R. Chiang, H. Huang. TRACON: Interference-Aware Scheduling for Data-Intensive Applications in Virtualized Environments. SC'11. Glance H. Huang, N. Zhang, W. Wang, G. Das, A. Szalay. Just-In-Time Analytics on Large File Systems. FAST'11.",
  "content_length": 4074,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:10"
}