{
  "name": "H. Lilian Tang",
  "homepage": "https://www.surrey.ac.uk/people/h-lilian-tang",
  "status": "success",
  "content": "Prof H Lilian Tang | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Professor H Lilian Tang Professor in Artificial Intelligence BEng, MEng, PhD (Cantab) +44 (0)1483 686054 h.tang@surrey.ac.uk02 BB 02Academic and research departments Computer Science Research Centre, School of Computer Science and Electronic Engineering. AboutBiographyI am passionate in exploring new knowledge through teaching and working with my students. I have been teaching computer vision, machine learning and AI for many years, enjoying and experiencing the rapid evolution in these fields. As a researcher, I am interested in applying machine learning to image and natural language understanding, with a particular focus on the medical domain. I have been working with a number of NHS hospitals, as well as hospitals in Europe and Asia, on a wide range of projects including: the development of automated tracking of fine movements of surgical instruments in eye and other microsurgeries; digital retinal image analysis to understand various eye and systemic conditions; time-lapse bacterial cell image analysis for understanding mycobacterial persistence. Beyond my passion in healing and care through medicine, I am also fascinated by the wonders of nature and keen to be part of it. This may be slightly reflected through the work that I participated in with the Royal Botanic Gardens, Kew, on Herbarium Image Data Analysis as well as the National Plant Phenomics Centre on heritage plants. Expand biography ResearchResearch interestsResearch interestsComputer vision, Image processing, Machine learning, Natural language processingResearch collaborationsMoorfields Eye Hospital; Royal Surrey County Hospital; Frimley Heath NHS; UCL University NHS hospitals; Bedford Hospital; the Surrey and Sussex NHS Trust; St George’s Hospital; Royal Botanic Gardens, Kew; School of Medicine, Dentistry and Biomedical Science, Queen’s University, Belfast; Department of Clinical Research, Faculty of Infectious and Tropical Diseases, London School of Hygiene & Tropical Medicine; Primary Care Health Sciences, University of Oxford; Zhongshan Ophthalmic Centre, Sun Yat-Sen University, China; NHMRC Clinical Trials Centre, The University of Sydney, Australia; The University of Melbourne, Australia; Department of Medicine and Science of Ageing, Ophthalmology Clinic, University \"G. d'Annunzio\" Chieti-Pescara, Italy.Key Research ProjectsInnovate UK - Newton Fund: Automated Telemedicine Enabled Screening for Eye Diseases Using an Affordable and Simple to Use Smartphone Based Imaging Device. Industry Innovation Fund: Deep Learning for Medicine.Innovate UK - Emerging and Enabling Fund: Automated Luggage Identification.Innovate UK Knowledge Transfer Partnership: Data Science for Sustainable Homes.EPSRC funded Collaborative Hub for Advancing Interdisciplinary Research: Modelling Mycobacterial Persistence.The ICURe Innovation: Automatic Digital Retinal Image Analysis for Diabetic Retinopathy Screening and Eye Disease Monitoring.King Abdulaziz City for Science and Technology & Ministry of Economy and Planning: Statistical Modelling for Diabetic Retinopathy Detection.BBSRC (Biotechnology and Biological Sciences Research Council): Investigation of stochastic variations in growth rate as the mechanism of drug tolerance in Mycobacterium tuberculosis.EPSRC (Engineering and Physical Sciences Research Council): Automatic Reading of Digital Fundus Images for Large scale Eye Epidemiology Studies.EPSRC funding: Minimal access surgical training, enhancement and reporting software (MASTERS).Moorfields Eye Hospital: Digital Fundus Image Analysis for Screening, Population-based Study and Diagnosis.EPSRC (Engineering and Physical Sciences Research Council): Sentiment- Automated surgical skill assessment.EPSRC (Engineering and Physical Sciences Research Council): Daphne: Automated filtering of normal images in DR screening programme.The Leverhulme Trust: Morphometric  Herbarium Image Data Analysis (Morphidas).The Royal Surrey County Hospital: Mammography quality assurance using visual information processing.Royal Academy of Engineering: Vision and graphic research.Federal Innovative Fund: Artful Eyes.University of Cambridge: Pathological image analysis for visual hospital. Expand research interests TeachingCOM2028 Introduction to AICOM3025 Deep Learning and Advanced AI Expand my teaching PublicationsHighlightsAbout 100 refereed papers were published. Highlights below include those from recent years: Q Huang, Y Zhang, T Ko, X Liu, B Wu, W Wang, H Tang, Personalized dialogue generation with persona-adaptive attention, - Proceedings of the AAAI Conference on Artificial Intelligence, 2023Chloe Hinchcliffe, Mahinda Yogarajah, Samia Elkommos, Hongying Tang, Daniel Abasolo, Entropy measures of electroencephalograms towards the diagnosis of psychogenic non-epileptic seizures, Entropy 2022, 24(10), 1348; https://doi.org/10.3390/e24101348Al Turk L; Georgieva D; Al S H; Wang S; Krause P; Al H; Al S A;  Saleh G M; Tang H L, Learning to Discover Explainable Clinical Features With Minimum Supervision, Translational Vision Science & Technology January 2022, Vol.11, 11. Mei X, Huang Q, Liu Q, Chen G, Wu J, Wu Y, Zhao J, Li S, Ko T, Tang H L, Shao X, Plumbley M D, Wang W, An Encoder-Decoder Based Audio Captioning System With Transfer and Reinforcement Learning, DCASE-21.Liu X, Huang Q, Mei X, Ko T, Tang H L, Plumbley M D, Wang W, A Contrastive Loss for Audio Captioning, DCASE-21Quinn N, Brazionis L, Zhu B, Ryan C, Tang* H L, Peto T, A Jenkins, Facilitating diabetic retinopathy screening using automated retinal image analysis in less-advantaged communities or under-resourced settings, Diabetic Medicine Huang, Q., Ko, T., Tang, H.L., Liu, X., Wu, B. (2021) Token-Level Supervised Contrastive Learning for Punctuation Restoration. Proc. Interspeech 2021, 2012-2016, doi: 10.21437/Interspeech.2021-661Al Turk L, Wawrzynski J, Wang S , Krause P, Saleh G M, Alsawadi H, Alshamrani A Z, Peto T, Bastawrous A, Li J, and Tang H L, Automated Feature-Based Grading and Progression Analysis of Diabetic Retinopathy (Running title: Feature based detection of diabetic retinopathy), Eye, Nature Journal.Al Turk L; Wang S; Krause P; Wawrzynski J; Saleh G M.; Alsawadi H; Alshamrani A Z; Peto T; Bastawrous A; J Li; Tang H L, Evidence Based Prediction and Progression Monitoring on Retinal Images from Three Nations, Translational Vision Science & Technology August 2020, Vol.9, 44. doi:https://doi.org/10.1167/tvst.9.2.44Hingley-Wilson S M., Ma N, Hu Y, Casey R, Bramming A,  Curry R J., Tang H L, Wu H, Butler R E.,  Jacobs Jr W R.,  Rocco A, and McFadden J, Loss of phenotypic inheritance associated with ydcI mutation leads to increased frequency of small, slow persisters in Escherichia coli, PNAS, first published February 6, 2020 https://doi.org/10.1073/pnas.1914741117.Almani N and Tang L, Deep Attention-Based Review Level Sentiment Analysis for Arabic Reviews, 6TH INTERNATIONAL CONFERENCE ON DATA SCIENCE AND MACHINE LEARNING APPLICATIONS, 4-5 March, Prince Sultan University, Riyadh, KSAAlmisbahi H. O., Faux D. A., Tang L. H., Abulkhair M. F., Visualizing molecular phonons using eigenvectors with smallest eigenvalues of the atomic trajectories\", Computational Materials Science, 2019, https://doi.org/10.1016/j.commatsci.2019.01.002Hamill, B; Tang, HL; Sivaraman, N; Peto, T, The Comparison Between An Automated Reading and Human Grading of Images From a Handheld Wide Field Imaging Device, European Journal of Ophthalmology, Volume: 29 Issue: 3, MAY 2019.Al Turk L., Wang S, Krause P, Alsawadi H, Alshamrani A. Z. Peto T, Bastawrous A., Huang W., and Tang H. L, Automated Retinal Image Reading and Progression Analysis, European Journal of Ophthalmology, 2018.Balal S, Smith P, Bader T, Tang H, Sullivan P, Thomsen A. S, Carlson T, Saleh G, Computer analysis of individual cataract surgery segments in the operating room, Eye, Nature, volume 33, pages 313–319 (2019).Balntas V, Tang L, Mikolajczyk K, 2018, Binary Online Learned Descriptors, IEEE Transactions on Pattern Analysis and Machine Intelligence.Day A., Smith P, Tang H. L., Aiello F, Hussain B, Maurino V, Marshall J, Saleh G. S., Surgical efficiency in femtosecond laser cataract surgery compared to phacoemulsification cataract surgery: a case control study, BMJ Open.Hu Y, Wang S, Ma N, Hingley-Wilson S, Rocco, A, McFadden J, H. L. Tang, \"Trajectory Energy Minimisation for Cell Growth Tracking and Genealogy Analysis\", Royal Society Open Science.Thomsen A S, Smith P, Morten la Cour Y S,, Tang L, Saleh G M., Konge L, High correlation between performance on a virtual-reality simulator and real-life cataract surgery, Acta Opht",
  "content_length": 16253,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:09"
}