{
  "name": "H. V. Jagadish",
  "homepage": "http://web.eecs.umich.edu/~jag",
  "status": "success",
  "content": "H V Jagadish H V Jagadish Director, Michigan Institute for Data and AI in Society Edgar F Codd Distinguished University Professor and Bernard A Galler Collegiate Professor of Elec. Engg. and Computer Science. University of Michigan 2260 Hayward Ave Ann Arbor, MI    48109-2121 Office: 4601 CSE Building Phone: (734) 763-4079 Fax: (734) 763-8094 jag at umich . edu Research My research has spanned many aspects of Big Data and Data Science. I coordinated the publication of a white paper on big data research challenges. A version of this has appeared in CACM, July 2014. I co-authored a CRA report on Computing Research and Data Science. I Chair the Governing Board of the Academic Data Science Alliance, since 2021. I have made multiple presentations, and served on two panels, at the National Academies, on issues related to Big Data, and have been a member of the Committe on National Statistics since January 2024. I have an h-index of 106, which means I have 106 papers with at least 106 citations each. Over my lifetime, I have published more papers in VLDB than anyone else. I was elected fellow of the ACM in 2003, and of AAAS in 2018. I enjoyed serving on the board of the Computing Research Association (CRA) 2009-2018 and on the board of the Very Large Database Endowment (2004-2010). I was the founding Editor-in-Chief of the Proceedings of the VLDB Endowment (2008-2014). I serve on the CS Advisory Committee for the University of the People. In 2013, I was recognized with a Contributions Award by the ACM SIG on Management of Data. In 2019, I was recognized by my University with a Distinguished Faculty Award. A crucial question that runs through all of my research is how to build database systems and query models so that they are truly usable, and how to design analytics processes so that they can deliver real value, both as insights to non-technical decision-makers and as benefits to society. Usability, for me, is not just a question of having a well-designed user interface: it has to be designed into the system from the beginning. For instance, a precise representation with a very complex schema is not useful because most users will not master the schema enough to ask the precise questions they could have asked. In this context, I am thinking about topics such as data modeling, schema design, schema summarization, form generation, natural language querying, and analytics with missing data and imprecise queries. I gave a keynote speech at SIGMOD on database usability . I have extensive research around usability of Big Data, particularly when the data involved comes from multiple heterogeneous sources, and has undergone many manipulations. Please see the web page on database usability for more details. This work has been supported in part by NSF grant IIS 0741620, IIS 1017296, and IIS 1250880. Data are having a huge impact on society, through automated decision systems, artifical intelligence, and data science, broadly. As data scientists, we have a responsibility to ensure our inventions are used ethically. In this context, I have been studying issues of representation, diversity, fairness, transparency, and validity, supported in part by NSF grants 1741022, 1934565, 2106176, and 2312931. One area of particuar interest is Data Equity Systems. I am part of the database group and was Director of the software systems laboratory from 2007 to 2014 . I have benefitted greatly from my collaborations with researchers in other disciplines in understanding real problems users have with managing data. I have had a number of such collaborations, with researchers in multiple disciplines. Teaching Courses related to database management, data analysis, the web, and data structures and algorithms. I have a popular MOOC on Data Science Ethics, which can be viewed on demand for free on both EdX and Coursera. Bio I obtained my Ph. D. from Stanford and worked many years for AT&T, where I eventually headed the database department. I arrived here in the fall of 1999, after a brief detour through the University of Illinois. I have been concerned about how academic scholarship is demonstrated, and have been involved with several efforts in this direction. I established the ACM SIGMOD Digital Review, which provides online reviews of published articles, now migrated to Pubzone. As a complementary effort, I serve as the editor for the database section of the Computing Research Repository (CoRR) , which encourages publication prior to review. I am the founder of the Proceedings of the Very Large Database Endowment (PVLDB), which is an effort to bring journal-style reviewing to a prestigious conference.",
  "content_length": 4651,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:11"
}