{
  "name": "Ha Kyung Kong",
  "homepage": "https://www.rit.edu/directory/hxkics-hidy-kong",
  "status": "success",
  "content": "Hidy Kong | RIT RIT Logo with Text Hidy Kong Assistant Professor School of Information Golisano College of Computing and Information Sciences hxkics@rit.edu 585-475-2471 Office Location GOL-2651 Hidy Kong Assistant Professor School of Information Golisano College of Computing and Information Sciences hxkics@rit.edu 585-475-2471 Personal Links Personal Website Google Scholar Select Scholarship Published Conference ProceedingsKong, Ha-Kyung, et al. \"Co-designing Robot Dogs with and for Neurodivergent Individuals: Opportunities and Challenges.\" Proceedings of the Proceedings of the 26th International ACM SIGACCESS Conference on Computers and Accessibility. Ed. N/A. Newfoundland, Canada: ACM, Web.Kong, Ha-Kyung, et al. \"Understanding Online Job and Housing Search Practices of Neurodiverse Young Adults to Support Their Independence.\" Proceedings of the Proceedings of the CHI Conference on Human Factors in Computing Systems. Ed. N/A. Hawaii, US: ACM, Web.Journal PaperKong, Ha-Kyung, et al. \"Trends in and Effectiveness of Infographics for Health Communication: A Scoping Review.\" Health Communication. (2024): 1-11. Web.Cullen, Riley, et al. \"Designing an infographic webtool for public health.\" Journal of the American Medical Informatics Association 31. 2 (2024): 342-353. Web.Do, Hyo Jin, et al. \"Inform, Explain, or Control: Techniques to Adjust End-User Performance Expectations for a Conversational Agent Facilitating Group Chat Discussions.\" ACM SIGCHI Conference on Computer-Supported Cooperative Work & Social Computing (CSCW). (2023): 1-26. Web. Currently Teaching HCIN-620Information and Interaction Design3 CreditsDesigning meaningful relationships among people and the products they use is both an art and a science. This course will focus on the unique design practice of: representing and organizing information in such a way as to facilitate perception and understanding (information architecture); and, specifying the appropriate mechanisms for accessing and manipulating task information (interaction design). This course will also explore the various design patterns (design solutions to particular problems) that are appropriate for the HCI professional. Students will need prior knowledge of an interface prototyping tool.HCIN-630Usability Testing3 CreditsThis project-based course will focus on the formal evaluation of products. Topics include usability test goal setting, recruitment of appropriate users, design of test tasks, design of the test environment, test plan development and implementation, analysis and interpretation of the results, and documentation and presentation of results and recommendations. Featured Work Trust and Bias: Guiding Communication through Visualizations Hidy Kong Effective communication is important in all areas of life, but especially so in health domains. The recent pandemic underscored the critical need for clear communication regarding preventive,... View More about Trust and Bias: Guiding Communication through Visualizations See All Search RIT Close  X This website uses cookies to provide better user experience and functionality. You can control and configure cookies in your web browser. Cookie Statement | How to Disable Cookies OK",
  "content_length": 3213,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:14"
}