{
  "name": "Habeeb Olufowobi",
  "homepage": "https://dipupo.github.io",
  "status": "success",
  "content": "Habeeb Olufowobi Habeeb Olufowobi, PhD Assistant Professor Lead, Cyber-physical System Security Lab Department of Computer Science and Engineering Room 560, ERB, 500 UTA Blvd. University of Texas at Arlington habeeb.olufowobi[at]uta[dot]edu +1 (817) 272-3785 Google Scholar ORCID ResearchGate LinkedIn GitHub Curriculum Vitae Education Ph.D., Systems and Computer Science, Howard University, Washington DC, 2019 M.S, Electrical Engineering - Computer Systems, California State Polytechnic University Pomona, 2014 B.S, Computer Science, Fountain University Osogbo, 2011 Research My research focuses on securing cyber-physical systems (CPS) and AI/ML models used in critical infrastructure. My work spans multiple domains, including connected and autonomous vehicles, distributed systems, real-time embedded platforms, and healthcare, where I investigates vulnerabilities and defences at the hardware-software interface. In addition to system security, I explore interpretability, explainability, and bias in AI/ML models, as well as privacy challenges in intelligent transportation, healthcare, and smart grid systems. My research has been supported by the National Science Foundation (including a prestigious NSF CAREER Award), the National Institutes of Health AIM-AHEAD initiative, and the University of Texas System. Please check my research page and publications for more details. Teaching I develop and teach practical, hands-on courses in information security, cloud computing, embedded systems, and computer network organization. Please see my teaching page for more details. Recent news August 2025: Our paper “Beyond Detection: Comparative Explainability Study on Trypanosoma cruzi Using CAMs and DETR Attention” published in IEEE-EMBS BHI 2025. August 2025: Our paper “DAPS-AGF: Depth-Aware Perceptual Similarity with Adaptive Gradient Filtering for Enhanced Outdoor Scene Reconstruction” published in ICCVW 2025. July 2025: Our paper “FedVLM: Scalable Personalized Vision-Language Models through Federated Learning” published in ECAI 2025. July 2025: I have received the NSF CAREER Award to make autonomous vehicles safer and more resilient against cyber threats. Total: 600k July 2025: Our paper “SemPerGe: Unveiling Text-based Adversarial Attacks on Semantic Communication” published in IEEE CNS 2025. April 2025: Our paper “Beyond the Glow: Understanding Luminescent Marker Behavior Against Autonomous Vehicle Perception Systems” published in Usenix VehicleSec '25. January 2025: Our paper “Spec-SCAN: Spectrum Learning in Shared Channel using Neural Networks” published in IEEE CCNC. December 2024: Our paper “MichiCAN: Spoofing and Denial-of-Service Protection using Integrated CAN Controllers” published in IEEE DSN. October 2024: I received the Google-CAHSI Cybersecurity Curriculum Fellowship to adapt and adopt cybersecurity curriculum at HSIs. Total: 25k September 2024: I have received an NIH AIM-AHEAD ABC-EE grant to work on explainable AI/ML models to predict heart disease outcomes in Chagas Disease. Total: 250k September 2024: Our paper “Simulating Load Sharing for Resource Constrained Devices” published in IEEE Access. September 2024: Welcome to our new PhD student, Aqsa Yousaf! August 2024: Presented our work on \"Improving Health Equity in Algorithmic Decision-Making Using Explainable AI\" at AIHES 2024. July 2024: Our paper \"Evaluating Large Language Models for Enhanced Intrusion Detection in Internet of Things Networks\" accepted in IEEE GLOBECOM 2024. June 2024: Our paper “D-NDNoT: Deterministic Named Data Networking for Time-Sensitive IoT Applications” published in IEEE IoT Journal. April 2024: My Ph.D. student, Paul Agbaje, is awarded the Kelcy Warren Graduate Fellowship for Engineering at UTA, Congratulations Paul. March 2024: Congratulations to my PhD students, Afia Anjum and Paul Agbaje for securing internship offers at Los Alamos National Laboratory! March 2024: Our paper “MCFICS: Model-based Coverage-guided Fuzzing for Industrial Control System Protocol Implementations” has been accepted at IEEE IECON24. March 2024: Our paper \"From Weeping to Wailing: A Transitive Stealthy Bus-off Attack\" has been accepted at IEEE ITS. Feburary 2024: Hosted a workshop on “Adversarial attacks and the Robustness of Object Detection Algorithms for Autonomous Vehicles\" at OurCS@DFW. Feburary 2024: My Ph.D. student, Afia Anjum, won the best Ph.D. Lightning Talk award at the Student Computing Research Festival (SCRF), 2024, Congratulations Afia. Feburary 2024: Our paper “Towards named data networking technology: Emerging applications, use cases, and challenges for secure data communication” published in Future Generation Computer Systems. January 2024: Our paper \"AutoWatch: Learning Driver Behavior with Graphs for Auto Theft Detection and Situational Awareness\" has been accepted at VehicleSec '24. January 2024: Our paper \"Deadline-Based Class Assignment for Time-Sensitive Network Frame Preemption\" has been accepted at ICIT24. Selected Publication Nwafor, E., Baskota, U., Parwez, M.S., Blackstone, J. and Olufowobi, H., Evaluating Large Language Models for Enhanced Intrusion Detection in Internet of Things Networks. IEEE Global Communications Conference, GLOBECOM '24. [PDF] Anjum, A., Agbaje, P., Hounsinou, S., Guizani, N. and Olufowobi, H.. D-NDNoT: Deterministic Named Data Networking for Time-Sensitive IoT Applications. IEEE IoTJ (JIF 10.6). [PDF] Agbaje, P., Olufowobi, H., Hounsinou, S. and Bloom, G., 2024. From Weeping to Wailing: A Transitive Stealthy Bus-Off Attack. IEEE TITS (JIF 7.9). [PDF] Agbaje, P., Anjum, A., Talukder, Z., Islam, M., Nwafor, E. and Olufowobi, H.. FedCime: An Efficient Federated Learning Approach For Clients in Mobile Edge Computing. 2023 IEEE International Conference on Edge Computing and Communications, IEEE EDGE '23. [PDF] Agbaje, P., Anjum, A., Mitra, A., Bloom, G. and Olufowobi, H., 2022, April. A framework for consistent and repeatable controller area network IDS evaluation. International Workshop on Automotive and Autonomous Vehicle Security, AutoSec '22 (Best Paper). [PDF] Hounsinou, S., Stidd, M., Ezeobi, U., Olufowobi, H., Nasri, M. and Bloom. Vulnerability of controller area network to schedule-based attacks. 42nd IEEE Real-Time Systems Symposium, RTSS '21. [PDF] Olufowobi, H., Young, C., Zambreno, J. and Bloom, G. SAIDuCANT: Specification-based automotive intrusion detection using controller area network (CAN) timing. IEEE Transactions on Vehicular Technology, IEEE TVT (JIF 6.1). [PDF] Research Sponsors",
  "content_length": 6523,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:10"
}