{
  "name": "Hadi Hosseini",
  "homepage": "https://faculty.ist.psu.edu/hadi",
  "status": "success",
  "content": "Hadi Hosseini's Homepage Hadi Hosseini Penn State University Home Bio Publications Teaching Service People FAIR Lab Contact Me hadi@psu.edu Hadi Hosseini I am an Associate Professor in the College of Information Sciences and Technology at Penn State University and an Associate Director of the Center for Artificial Intelligence Foundations and Engineered Systems (CAFE). I am a member of the Data Science and AI group; I am also affiliated with CS Theory Group and the Institute for Computational and Data Sciences. I was a postdoctoral research fellow at Carnegie Mellon University, hosted by Ariel Procaccia. I completed my Ph.D. in Computer Science at the University of Waterloo, advised by Kate Larson and Robin Cohen. I work on a vibrant set of problems related to AI, multiagent systems, algorithms, and economics that particular focus on societal impacts and fairness. I am especially passionate about projects that combine compelling theoretical insights with practical applications to help humans/AI make informed decisions. My research is supported by an NSF CAREER Award, an NSF Medium RI Award and an NSF CRII Award. Thank you, NSF! Professional Service International Foundation for Autonomous Agents and Multiagent Systems, Board of Directors Journal of Artificial Intelligence Research (JAIR), Associate Editor AAAI-26, Publicity Chair AAMAS-26, Scholarship Chair AAAI-25, Publicity Chair IJCAI-24, Workshop Chair AAMAS-24, Finance Chair AAAI-23, Job Fair Chair IJCAI-23, Workshop Chair If you are interested in joining my group, check out this page. Publicly Available Platforms MatchU.ai: Make Informed Decisions, Backed by Algorithms! Not-for-profit platform that blends education and research by offering an interactive tools to find how to form mutually beneficial relationships, decide how to distribute resources, or resolve conflicts about a set of alternatives through a suite of algorithms rooted in economics, computer science, and artificial intelligence. MatchXplain: Disover Your Preference Data (alpha version) Not-for-profit platform with the grand vision of providing explainable AI solutions that involve decisions under (often ill-structured) preference data. Its goal is delivering a suite of provable recommendations to facilitate decision-making through explainable data, robust matchings, and versatile solutions. In Media The Future of AI. Conversations Live, WPSU-PBS Good, bad, fair: New algorithms could help fairly distribute goods or chores. Penn State News AI Trends in 2022: What's Real and What's Hype? - Forbes Surprisingly popular voting algorithm developed to recover ranked choices. ACM THECHNEWS, Penn State News New AI framework introduced for cutting a 'multi-layered cake'. Penn State News Can AI help us become more fair as a society? WXXI Radio Interview Will Artificial Intelligence enhance or replace human activity? WXXI Radio Interview News May 2025 PBS TV Interview Conversations Live: The Future of AI Watch the interview: WPSU-PBS TV Link. April 2025 New Grant: Generative AI Models as Social or Economic Agents Received a new grant from Penn State's IST Seed Funding. Thank you IST! Co-PI: Ran Shorrer Read more here! April 2025 Two Students win university-wide AI Awards at Penn State Amrit Puhan's master's thesis received the Best AI Thesis Award at Penn State Samarth Khanna's poster won the best poster presentation award. Congrats to our lab! Read more here! Sept. 2024 Two papers accepted to NeurIPS-24 Two papers to be presented at NeurIPS-24! Congratulations to my amazing students! July 2024 Two papers accepted to ECAI-24 Two papers to be presented at ECAI-24! Congratulations to my amazing collaborators and students! July 2024 Promoted to Associate Professor with Tenure I am grateful to all my amazing students, world-class collaborators, and extremely supportive mentors. This journey has been intellectually stimulating and unbelievably fun with you all. May 2024 IJCAI Early Career Spotlight Invited Talk at IJCAI-24 Early Career Spotlight track! April 2024 Two papers accepted to IJCAI-24 Two papers to be presented at IJCAI-24! Congratulations to my amazing collaborators and students! Jan. 2024 ISAIM 2024 I am invited to give a talk in an ISAIM special session on the Alternative Models for Fairness in AI. Dec. 2023 Two papers accepted to AAMAS-24 One full paper and one extended abstract accepted to AAMAS-24! Thankful to the amazing collaborators and students! Dec. 2023 New paper accepted to AAAI-24 1 full paper to be presented at the blue sky/senior track AAAI-24! April 2023 One full paper and one journal track paper accepted to IJCAI-23 Two papers to be presented at IJCAI-23! Congratulations to my amazing postdocs and students! Feb. 2023 Junior Faculty Excellence in Research Award I have been awarded Junior Faculty Excellence in Research Award at Penn State! I consider this a collective effort and am very grateful to all my students, collaborators, and mentors! Read more details here. Jan. 2023 Two full papers accepted to AAMAS-23 Two full papers were accepted to AAMAS-23! Thankful to the amazing collaborators and students! Dec. 2022 New paper accepted to AAAI-23 1 full paper to be presented at AAAI-23! 2022 NSF CAREER: Robust Fairness in Matching Markets I received an NSF CAREER Award from the National Science Foundation! Thank you, NSF! See more details here. April 2022 I was elected to IFAAMAS Board of Directors I was elected to the IFAAMAS Board of Directors for a six-year term. IFAAMAS is a non-profit organization whose purpose is to promote science and technology in the areas of artificial intelligence, autonomous agents and multiagent systems. It is the governing body behind the AAMAS conference series. April 2022 Paper accepted to IJCAI-22 A paper on two-sided manipulation strategies in matching markets was accepted to IJCAI-22. Congratulations to my student Fatima Umar! March 2022 New Grant: Democratic Metaverse: Recovering Truth from Ranking Data Received a new grant from Penn State's IST Seed Funding. Thank you IST! See more details here. December 2021 Two full papers accepted to AAMAS-22 Two full papers were accepted to AAMAS-22. Congratulations to my students Andrew Searns and Angelina Brilliantova! July 2021 New Grant: NSF RI: Medium: Transparent Fair Division of Indivisble Items Received a new award from the National Science Foundation to further study transparency in fair allocation of resources and items and perceived fairness of humans. Thank you, NSF! This is a project in collaboration with Prof. Lirong Xia. See more details here. July 2021 New Grant: Robust and Fair Matching Markets: From Rideshare to Kidney Exchange Received a new grant from Penn State's IST Seed Funding to study fairness in matching markets. Thank you! April 2021 Three papers accepted to IJCAI-21 Three full papers (two of which with undergraduate students) accepted to IJCAI-21 and will be presented at the conference in August. April 2021 Co-chairing a tutorial session on Mechanism Design without Money: Matching, Facility Locations, and Beyond at IJCAI-2021 The tutorial discusses various mechanism design settings (such as matching and facility locations), their desired properties and solution concepts, and algorithmic tools/mechanisms. See more details here. Feb. 2021 Co-chairing the 3rd Games, Agents and Incentives Workshop at AAMAS-2021 Consider submitting your papers to the 3rd Games, Agents and Incentives Workshop (GAIW) @AAMAS 2021. See more details here. Jan. 2021 Invited Speaker at Applied Mechanism Design at IJCAI-21 Invited to speak about my work on fair division along with a set of wonderful researcher on mechanism design. See more details here. Watch the video here. Dec. 2020 3 papers accepted to AAAI-21 2 full papers and 1 short abstract to be presented in AAAI-21! Dec. 2020 Congratulations to Fatima! My research assistant, Fatima Umar, received a prestigious Outstanding Undergraduate Scholar Award at RIT. Aug. 2020 New Position at Penn State University I am thrilled to announce that I will be joining Penn State University as an Assistant Professor of Artificial Intelligence in Fall 2020. I am deeply grateful to my colleagues, collaborators, and mentors at RIT for wonderful three years. Apr. 2020 1 full paper accepted in IJCAI-20 (acceptance rate ~12%) 1 full paper to be presented in IJCAI-PRICAI-20! 2020 Nominated for Outstanding Teaching Award (x2) Rochester Institute of Technology Jan. 2020 WXXI Radio Interview: Can AI help us become more fair as a society? Connections: Can AI help us become more fair as a society? Listen to my interview: WXXI Radio Link. Dec. 2019 Andrew Searns received Honorable Mention, CRA Outstanding Undergraduate Researcher Award! Congratulations to Andrew Searns, my undergraduate student at RIT working on fairness in resource allocation, who has received an Honorable Mention for the CRA Outstanding Undergraduate Researcher Award! Nov. 2019 3 papers accepted in AAAI-20 1 full paper, 1 demo paper, and 1 short abstract to be presented in AAAI-20! Nov. 2019 WXXI Radio Interview: Will artificial intelligence enhance or replace human activity? Connections: Will artificial intelligence enhance or replace human activity? Listen to my interview: WXXI Radio Link. 2019 NSF CRII Award I was awarded Research Initiation Initiative (CRII) to work on fair division problems in dynamic environments. 2019 NSF IUSE Award Title: Using Program Dependence Graphs to Propagate Feedback to Students on Programming Assignments and Promote Responsive Teaching. With Carlos Rivero and Zack Butler 2019 Two AAMAS Papers Two papers accepted at AAMAS: one full paper and one short paper. International Conference on Autonomous Agents and Multiagent Systems (AAMAS) More information: AAMAS Conference 2018 Best Program Committee (PC) Member International Conference on Autonomous Agents and Multiagent Systems (AAMAS) More information: AAMAS Awards 2018 Nominated for Outstanding Teaching Award Rochester Institute of",
  "content_length": 10011,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:15"
}