{
  "name": "Hafedh Mili",
  "homepage": "https://professeurs.uqam.ca/professeur/mili.hafedh",
  "status": "success",
  "content": "Hafedh Mili | Répertoire des professeures et professeurs - UQAM Hafedh Mili Professeur Hafedh Mili Professeur Unité : Département d'informatique Courriel : mili.hafedh@uqam.ca Téléphone : (514) 987-3000 poste 3943 Langues : Français, Anglais, Arabe Domaines d'expertise Affaires électroniques Conception de logiciel Génie logiciel Gestion de l'expérience client Informatique Internet des objets Programmation objet Réingéniérie de logiciel Représentation des connaissances Réutilisation de logiciel Liens d'intérêt LinkedIn Page personnelle Informations générales Cheminement académique Ph.D. (1988), Cumputer Science (Artificial Intelligence), The George Washington University (www.gwu.edu), Washington D.C., USA Diplôme d'Ingénieur (1984), Mathématiques Appliquées, École Centrale de Paris (www.ecp.fr), Paris, France Classes Préparatoires (1981), Lycée Louis le Grand (www.louislegrand.org), Paris, France Unités de recherche Laboratoire de recherche sur les technologies du commerce électronique (LATECE) Enseignement Projet de thèse (2026) Programmation et conception orientées objet (2026) Réalisation et maintenance de logiciels (2025, 2024, 2023) Stage industriel (2024) Rapport technique (2024) Projet d'analyse et de modélisation (2024, 2022, 2021, 2020) Génie logiciel: conception (2023) Projet de thèse (2022) Directions de thèses et mémoires Thèses de doctorat Saleh, Lokman. (2025). Développement d'un cadre d'applications pour l'apprentissage machine. (Thèse de doctorat). Université du Québec à Montréal. Benzarti, Imen. (2020). Un cadre logiciel de développement pour la gestion de l'expérience client. (Thèse de doctorat). Université du Québec à Montréal. Amja, Anne-Marie. (2017). Une approche pour la modélisation, le raisonnement et l'adaptation d'applications dépendantes du contexte. (Thèse de doctorat). Université du Québec à Montréal. Boubaker, Anis. (2016). La modélisation semi-automatisée de la compensation dans les processus d'affaires. (Thèse de doctorat). Université du Québec à Montréal. Leshob, Abderrahmane. (2013). Classification, représentation et spécialisation des processus d'affaires pour le développement de systèmes d'information. (Thèse de doctorat). Université du Québec à Montréal. Mémoires Abuhasirah, Yasmeen. (2024). Analyzing and classifying group dynamics dysfunctions in interpersonal dialogues. (Mémoire de maîtrise). Université du Québec à Montréal. Haddaji, Mohamed Amine. (2021). Validation de dépendances de programme par traces d'exécution. (Mémoire de maîtrise). Université du Québec à Montréal. Abbasigaravand, Mahtab. (2020). Sentiment analysis of cultural product reviews. (Mémoire de maîtrise). Université du Québec à Montréal. Amirsardari, Sara. (2018). Un système de reconnaissance des esquisses de modèles CMMN dessinées à la main. (Mémoire de maîtrise). Université du Québec à Montréal. Amirsardari, Sara. (2017). CMMN models hand-drawn sketches recognition system. (Mémoire de maîtrise). Université du Québec à Montréal. Alkamari, Aniss. (2008). Composition de services web par appariement de signatures. (Mémoire de maîtrise). Université du Québec à Montréal. Ben Tamrout, Radhouane. (2006). JRegistre : un registre UDDI extensible. (Mémoire de maîtrise). Université du Québec à Montréal. Dimassi, Sonia. (2005). Effet de la fragmentation d'objets en facettes fonctionnelles sur la performance des bases des données partagées. (Mémoire de maîtrise). Université du Québec à Montréal. Hamad, Ammar. (2005). Implantation d'un coupe-feu utilisant un moteur de règles dans une base de données relationelle. (Mémoire de maîtrise). Université du Québec à Montréal. El Boussaidi, Ghizlane. (2005). Transformation de modèles par application de patrons de conception. (Mémoire de maîtrise). Université du Québec à Montréal. ELALAOUI, HASSANE. (2000). UNE APPROCHE DE GENERATION AUTOMATIQUE DE PROGRAMMES PAR RAFFINEMENE INTERACTIF. (Mémoire de maîtrise). Université du Québec à Montréal. NOUISSER, NAJET. (1998). REUTILISATION EN DIMENSIONNEMENT DE RESEAUX DE TELECOMMUNICATIONS. (Mémoire de maîtrise). Université du Québec à Montréal. MCHEICK, HAMID. (1996). REUTILISATION DES COMPOSANTES LOGICIELLES ORIENTEES-OBJET. (Mémoire de maîtrise). Université du Québec à Montréal. AH-KI WU MAN YIN, ESTELLE. (1996). REUTILISATION DES COMPOSANTES LOGICIELLES ORIENTEES-OBJET. (Mémoire de maîtrise). Université du Québec à Montréal. Rapports d'activités et projets d'intervention Ben Khalifa, Adnane. (2007). Implémentation d'un framework réutilisable pour la gestion des systèmes d'information d'organismes communautaires. (Rapport d'activités et projet d'intervention). Université du Québec à Montréal. Nacu, Ovidiu. (2005). Création d'un prototype d'une application conforme à MDA. (Rapport d'activités et projet d'intervention). Université du Québec à Montréal. Fontaine, Éric. (2003). Développement de stratégies et d'un cadre d'applications pour l'internationalisation de logiciels. (Rapport d'activités et projet d'intervention). Université du Québec à Montréal. Boucetta, Sobhi. (2001). L'enregistrement du processus de développement Unified Process (UP). (Rapport d'activités et projet d'intervention). Université du Québec à Montréal. Mattalah, Mohammed. (2001). COMPARAISON DE LA PROGRAMMATION PAR ASPECTS, SUJETS ET VUES. (Rapport d'activités et projet d'intervention). Université du Québec à Montréal. Publications Articles scientifiques Boubaker, A., Mili, H., Charif, Y. et Leshob, A. (2013). Towards a framework for modeling business compensation processes. Lecture Notes in Business Information Processing, 147 LNBIP, 139–153. http://dx.doi.org/10.1007/978-3-642-38484-4_11. Kassab, M., El-Boussaidi, G. et Mili, H. (2012). A quantitative evaluation of the impact of architectural patterns on quality requirements. Studies in Computational Intelligence, 377, 173–184. http://dx.doi.org/10.1007/978-3-642-23202-2-12. El Boussaidi, G. et Mili, H. (2012). Understanding design patterns – What is the problem? Software – Practice and Experience, 42(12), 1495–1529. http://dx.doi.org/10.1002/spe.1145. Mili, H., Valtchev, P., Charif, Y., et al. (2011). E-tourism portal: A case study in ontology-driven development. Lecture Notes in Business Information Processing, 78 LNBIP, 76–99. http://dx.doi.org/10.1007/978-3-642-20862-1_6. Mili, H., Tremblay, G., Jaoude, G.B., Lefebvre, E., Elabed, L. et Boussaidi, G.E. (2010). Business process modeling languages: Sorting through the alphabet soup. ACM Computing Surveys, 43(1), Art. No.: 4. http://dx.doi.org/10.1145/1824795.1824799. El Kharraz, A., Valtchev, P. et Mili, H. (2010). Concept analysis as a framework for mining functional features from legacy code. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 5986 LNAI, 267–282. http://dx.doi.org/10.1007/978-3-642-11928-6_19. Adda, M., Mcheick, H. et Mili, H. (2010). Formal model and DSL for separation of concerns based on views. Journal of Object Technology, 9(6), 25–50. http://dx.doi.org/10.5381/jot.2010.9.6.a2. Sadou, S. et Mili, H. (2009). A delegation-based approach for the unanticipated dynamic evolution of distributed objects. Journal of Systems and Software, 82(6), 932–946. http://dx.doi.org/10.1016/j.jss.2008.12.045. Mili, H., Leshob, A., Lefebvre, E., Lévesque, G. et El-Boussaidi, G. (2009). Towards a methodology for representing and classifying business processes. Lecture Notes in Business Information Processing, 26 LNBIP, 196–211. http://dx.doi.org/10.1007/978-3-642-01187-0_16. El-Boussaidi, G. et Mili, H. (2008). Detecting patterns of poor design solutions using constraint propagation. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 5301 LNCS, 189–203. http://dx.doi.org/10.1007/978-3-540-87875-9_14. Mili, H., Sahraoui, H., Lounis, H., Mcheick, H. et Elkharraz, A. (2006). Concerned about separation. Lecture Notes in Computer Science, 3922 LNCS, 247–261. http://dx.doi.org/10.1007/11693017_19. Mili, H. et El-Boussaidi, G. (2005). Representing and applying design patterns: What is the problem? Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 3713 LNCS, 186–200. http://dx.doi.org/10.1007/11557432_14. Mili, H., Ah-Ki, E., Godin, R. et Mcheick, H. (2003). An experiment in software component retrieval. Information and Software Technology, 45(10), 633–649. http://dx.doi.org/10.1016/S0950-5849(03)00002-8. Mili, H., Mcheick, H. et Sadou, S. (2002). CorbaViews – Distributing objects that support several functional aspects. Journal of Object Technology, 1(3), 207–229. Obtenir \"CorbaViews – Distributing objects that support several functional aspects\" aux bibliothèques de l'UQAM Mili, H., Fayad, M., Brugali, D., Hamu, D. et Dori, D. (2002). Enterprise frameworks: Issues and research directions. Software – Practice and Experience, 32(8), 801–831. http://dx.doi.org/10.1002/spe.460. Sahraoui, H.A., Lounis, H., Melo, W. et Mili, H. (1999). Concept formation based approach to object identification in procedural code. Automated Software Engineering, 6, 387–410. http://dx.doi.org/10.1023/A:1008767522970. Mili, A., Yacoub, S., Addy, E. et Mili, H. (1999). Toward an engineering discipline of software reuse. IEEE Software, 16, 22–30. http://dx.doi.org/10.1109/52.795098. Godin, R., Mili, H., Mineau, G.W., Missaoui, R., Arfi, A. et Chau, T.-T. (1998). Design of class hierarchies based on concept, (Galois) lattices. Theory and Practice of Object Systems, 4(2), 117–134. http://dx.doi.org/10.1002/(SICI)1096-9942(1998)4:2<117::AID-TAPO6>3.0.CO;2-Q. Mili, H. (1996). On behavioral descriptions in object-oriented modeling. Journal of Systems and Software, 34(2), 105–121. http://dx.doi.org/10.1016/0164-1212(95)00069-0. Mili, H., Mili, F. et Mili, A. (1995). Reusing software: issues and research directions. IEEE Transactions on Software Engineer",
  "content_length": 18040,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:16"
}