{
  "name": "Hafiz Md. Hasan Babu",
  "homepage": "https://du.ac.bd/body/faculty_details/CSE/1930",
  "status": "success",
  "content": "Faculty Members Details :: University of Dhaka Department of Computer Science and Engineering Faculty Members Details Home Faculty Members Details Dr. Hafiz Md. Hasan Babu (Professor) Department of Computer Science and Engineering Education Experience Research Activities Membership Publication Award Contact Degree Name Group/Major Subject Board/Institute Country Passing Year Ph.D. Computer Science & Electronics Kyushu Institute of Technology Japan 2000 Masters Computer Science & Engineering Brno University of Technology, Czech Republic 1992 Title Organization Location From Date To Date Pro-Vice-Chancellor National University, Gazipur, Bangladesh 13, Jul 2016 12-07-2020 Professor Department of Computer Science and Engineering, University of Dhaka, Dhaka 1000, Bangladesh 26, Jun 2016 Currently Working Founding Chairman Department of Robotics and Mechatronics Engineering University of Dhaka, Dhaka 1000, Bangladesh 08, Sep 2015 26-06-2016 Professor Department of Robotics and Mechatronics Engineering University of Dhaka, Dhaka 1000, Bangladesh 08, Sep 2015 26-06-2016 Professor Department of Computer Science and Engineering, University of Dhaka, Dhaka 1000, Bangladesh 01, Aug 2010 07-09-2015 General Manager Information TechnologyDepartment& Management Information Systems Department, Janata Bank Limited, Head Office, Motijheel, Dhaka 1000, Bangladesh 01, Apr 2003 31-07-2010 Chairman Department of Computer Science and Engineering, University of Dhaka, Dhaka 1000, Bangladesh 01, Feb 2003 01-02-2006 Associate Professor Department of Computer Science and Engineering, University of Dhaka, Dhaka 1000, Bangladesh 01, Feb 2003 31-03-2010 Assistant Professor Department of Computer Science and Engineering, University of Dhaka, Dhaka 1000, Bangladesh 01, Apr 2001 31-01-2003 Research Interest Subject Description Research Interest (Goal, Target Indicator) Research Interests Project/Research Supervision Level of Study Title Supervisor Co-Supervisor(s) Name of Student(s) Area of Research Current Completion Ph.D. VLSI Design PROFESSOR DR. HAFIZ MD. HASAN BABU Nazma Tara 2020 Ph.D. VLSI Design PROFESSOR DR. HAFIZ MD. HASAN BABU Lafifa Jamal 2017 Project/Research Work Subject Project Name Source of Fund From Date To Date Collaboration No project/research work is found Invited Talk SL Invited Talk No invited talk is found SL Collaboration & Membership Name Type Membership Year Expire Year 1 President International Internet Society, Bangladesh Chapter 2018-to date 2 President Bangladesh Computer Society (The Largest ICT Professional Body in Bangladesh with more than 17,000 members) 2018-2020 Book 1 Hafiz Md. Hasan Babu “VLSI Circuits and Embedded Systems”. Florida, USA: CRC Press, 2021 . 2 Hafiz Md. Hasan Babu “Quantum Computing: A Pathway to Quantum Logic Design”. Bristol, UK: IOP Publishers, 2020 . 3 Hafiz Md. Hasan Babu “Reversible and DNA Computing”. UK: Wiley Publishers, 2020 . 4 Hafiz Md. Hasan Babu VLSI Circuits and Embedded Systems. USA: CRC Press, 2022 . Journal Article 1 MubinUlHaque, ZarrinTasnimSworna, Hafiz Md. Hasan Babu and AsishKumer Biswas : “A Fast FPGA-Based BCD Adder”, Journal of Circuit, System and Signal Processing (CSSP) , vol.37 Springer , pp.4384-4408. , 2018 . 2 Nazma Tara, Hafiz Md. Hasan Babu and Lafifa Jamal : “Power Efficient Optimum Design of the Reversible Plessey Logic Block of a Field Programmable Gate Array”, Elsevier Journal of Sustainable Computing: Informatics and Systems , vol.16 , pp.76-92 , 2017 . 3 Hafiz Md. Hasan Babu : “Cost-efficient design of a quantum multiplier–accumulator unit”, Springer Journal of Quantum Information Processing , pp.30 , 2017 . 4 Hafiz Md. Hasan Babu, Md. Solaiman Mia and AshisKumer Biswas : “Efficient Techniques for Fault Detection and Correction of ReversibleCircuits”, Springer Journal of Electronic Testing , pp.1-15 , 2017 . 5 Nazma Tara and Hafiz Md. Hasan Babu : “Synthesis of Reversible PLA Using Products Sharing”, Springer Journal of Computational Electronics. Journal of Computational Electronics , vol.20 , pp.420-428 , 2016 . 6 ZarrinTasnimSworna, Mubin-Ul-Haque, Nazma Tara, Hafiz Md. HasanBabu and Ashis Kumar Biswas : “Low-power and area efficient binary coded decimal adder design using a look up table-based field programmable gate array”, of Institute of Engineering and Technology’s Circuit, Devices and Systems (IET CDS) , vol.10 , pp.163-172 , 2016 . 7 Hafiz Md. HasanBabu and Solaiman Mia : “Design of a Compact Reversible Fault Tolerant Division Circuit”, Elsevier Journal of Microelectronics , vol.51 , pp.15-29 , 2016 . 8 NazmaTaraandHafiz Md. HasanBabu : “Synthesis of reversible PLA using products sharing”, Journal of Computational Electronics , pp.1-9 , 2015 . 9 AnkurSarker, Hafiz Md. HasanBabu and S. M. Mahbubur Rashid : “Design of a DNA-based Reversible Arithmetic and Logic Unit”, IETNanobiotechnology , vol.9 , pp.226-238 , 2015 . 10 Hafiz Md. HasanBabu, NazirSaleheen, Lafifa Jamal, Sheikh Muhammad Sarwar and Tsutomu Sasao : “Approach to design a compact reversible low power binary comparator”, IET Computers & Digital Techniques , vol.8 , no.3 , pp.129-139 , 2014 . 11 Lafifa Jamal, Hafiz Md. HasanBabuand Md. Masbaul Alam : “An EfficientApproach to Design a Reversible Control Unit of a Processor”, Elsevier Journal of Sustainable Computing: Informatics and Systems , vol.3 , pp.286-294 , 2013 . 12 Md. Shamsujjoha, Hafiz Md. Hasan Babu and Lafifa Jamal : “Design of a Compact Reversible Fault Tolerant Field Programmable Gate Array: A Novel Approach in Reversible Logic Synthesis”, Elsevier Journal of Microelectronics , vol.44 , pp.519-537 , 2013 . 13 Lafifa Jamal, Farah Sharmin, Md. Abdul Mottalib, Hafiz Md. HasanBabu : “Design and Minimization of Reversible Circuits for a Data Acquisition and Storage System”, The International Journal of Engineering and Technology , vol.2 , pp.9-15 , 2012 . 14 Lafifa Jamal, Md. Shamsujjoha, Hafiz Md. Hasan Babu : “Design of Optimal Reversible Carry Look-Ahead Adder with Optimal Garbage and Quantum Cost”, The International Journal of Engineering and Technology , vol.2 , pp.44-50 , 2012 . 15 Rubaia Rahman, Lafifa Jamal, Hafiz Md. Hasan Babu : “Design of Reversible Fault Tolerant Programmable Logic Arrays with Vector Orientation”, International Journal of Information and Communication Technology Research , vol.1 , pp.337-343 , 2011 . 16 NaimulHuda, Shahed Anwar, Lafifa Jamal, Hafiz Md. HasanBabu : Design of a Reversible Random Access Memory”, Dhaka University Journal of Applied Science & Engineering , vol.2(1) 31-38 , 2011 . 17 Mohammod Akbar Kabir, Hafiz Md. HasanBabu, LiakotAli, Lafifa Jamal : “Design of a High Performance Low Cost IC Tester - A Conceptual View”, DhakaUniversity Journal of Science , vol.58(1): 63-66 , 2010 . 18 Noor MuhammedNayeem, Lafifa Jamal, Hafiz Md. HasanBabu : “Efficient Reversible Montgomery Multiplier and Its Application to Hardware Cryptography”, Journal of Computer Science (Science Publications, USA) , vol.5 (1): 49-56 , 2009 . 19 Ashis Kumar Biswas, Md. MahmudulHasan, Ahsan Raja Chowdhury and Hafiz Md. Hasan Babu : “Efficient Approaches for Designing Reversible Binary Coded Decimal Adders”, Elsevier Journal of Microelectronics , vol.39 , pp.1693–1703 , 2008 . 20 Hafiz Md. HasanBabu : “Logic Synthesis and Minimization of Multiple-Valued Input TANT Networks”, The Dhaka University Journal of Science , vol.56 , pp.05-10 , 2008 . 21 Hafiz Md. HasanBabu, Md. Saiful Islam, Md. Rafiqul Islam, Lafifa Jamal, Muhammad RezaulKarim, Abdullah Al Mahmud : “Building Toffoli Network for Reversible Logic Synthesis Based on Swapping Bit Strings”, The Dhaka University Journal of Science , vol.55(2): 153-156 , 2007 . 22 Hafiz Md. HasanBabu and Ahsan Raja Chowdhury : “Design of a Compact Reversible Binary Coded Decimal Adder Circuit”, Elsevier Journal of Systems Architecture 52 , pp.272-282 , 2006 . 23 Hafiz Md. Hasan Babu and Moinul Islam Zaber : “An Approach to Minimize the Multiple-Valued Input Binary-Valued Output functions Using Local Covering”, Weases Transaction on Computers , vol.10 , no.2 , pp.2381-2389 , 2006 . 24 Hafiz Md. HasanBabu, Abdur Rahim Mustafa, Md. SumonShahriar, Lafifa Jamal, Md.HamidullahAhmad : “An Improved Approach of Minimization of Multi-Valued Multi-Output Logic Expressions”, The Dhaka University Journal of Science , vol.54(2) , pp.141-144 , 2006 . 25 Hafiz Md. HasanBabu, TanzeemIqbal, ChowdhuryFarhan Ahmed, RaquibulHasan, Moinul Islam Zaber, Lafifa Jamal, Shahed Anwar, Mohammad Hamidullah Ahmad : “An Optimal Design Method of a Multi-Valued PLA”, The Dhaka University Journal of Science , pp.149-152 , 2006 . 26 Hafiz Md. HasanBabu : “An Improved Method for Minimization of Circuit Using TANT Network”, The Dhaka University Journal of Science , vol.54 , pp.49-54 , 2006 . 27 Hafiz Md. HasanBabu : “Reversible Logic Decomposition to Minimize Full-Adder Circuit”, The Dhaka University Journal of Science , vol.54 , pp.137-139 , 2006 . 28 Hafiz Md. HasanBabu, AhmedulKabir and A.S.M. Fazle Rabbi : “On the modified technique for better data compression”, Bangladesh Journal of Scientific and Industrial Research (BJSIR) , 2003 . 29 Hafiz Md. HasanBabuand Md. Rafiqul Islam : “Minimization of multilevel AND-EXOR expressions using Pseudo-Kronecker decision diagrams”, The Dhaka University Journal of Science , 2003 . 30 Md. Rafiqul Islam and Hafiz Md. HasanBabu : “An improved technique to create lattice index of materialized views for query optimization”, The Dhaka University Journal of Science , 2003 . 31 Md. Rafiqul Islam and Hafiz Md. Hasan Babu : “An improved algorithm for query optimization using materialized view”, The Dhaka University Journal of Science , 2003 . 32 Md. Rafiqul Islam and Hafiz Md. Hasan Babu : “A hybrid approach for efficient shortest path algorithm in neural networks”, The Dhaka University Journal of Science , 2003 . 33 Hafiz Md. HasanBabu and T. Sasao : “Upper bound on the size of the shared binary decision diagram for an n-bit adder”, Journal of Bangladesh Academy of Sciences , vol.26 , p",
  "content_length": 13838,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:16"
}