{
  "name": "Haggai Maron",
  "homepage": "https://haggaim.github.io",
  "status": "success",
  "content": "Haggai's Homepage Haggai Maron I am an Assistant Professor and the Robert J. Shillman Fellow at the Faculty of Electrical and Computer Engineering at the Technion and a senior research scientist at NVIDIA Research at NVIDIA's lab in Tel Aviv. My primary research interest is in machine learning, with a focus on deep learning for structured data. Specifically, I study how to apply deep learning techniques to sets, graphs, point clouds, surfaces, weight spaces and other mathematical objects that have an inherent symmetry structure. My goal is twofold: first, to understand and design deep learning architectures from a theoretical perspective, for example, by analyzing their expressive power; and second, to demonstrate their practical effectiveness on real-world problems involving structured data. I completed my Ph.D. in 2019 at the Weizmann Institute of Science under the supervision of Prof. Yaron Lipman. You can get an idea of what I am working on by taking a look at these talks I gave: The expressive power of GNNs - short tutorial at the Simons Institute. Equivaraint architectures for learning in deep weight spaces Subgraph-based networks for expressive, efficient, and domain-independent graph learning Leveraging Permutation Group Symmetries for Equivariant Neural Networks You can also listen to a recent podcast with me on graph neural networks (hebrew). Email: hmaron (at) nvidia.com, Google scholar page, GitHub page Group Current Group Members: Fabrizio Frasca (Postdoc, 2024-today), Yam Eitan (PhD, 2024 - today), Guy Bar-Shalom (PhD, 2023 - today, joint supervision with Ran El-Yaniv), Yoav Gelberg (PhD, 2024-today, joint supervision with Michael Bronstein), Ran Elbaz (Msc, 2023-today), Yaniv Galron (MSc, 2023-today, joint supervision with Eran Treister) Past Group Members: Yuval Aidan (MSc, 2023-2025, joint supervision with Ayellet Tal). Edan Kinderman (MSc, 2023-2025, joint supervision with Daniel Soudry), Ofir Haim (MSc, 2023-2025, joint supervision with Shie Mannor) Close student / postdoc collaborators: Theo (Moe) Putterman (UC Berkeley, 2023-today), Beatrice Bevilacqua (PhD Candidate, Purdue University, 2021-2025), Derek Lim (PhD student, MIT CSAIL, 2021-2025), Moshe Eliasof (Postdoc, University of Cambridge, 2022-today), Aviv Navon (Aiola, 2021-today), Aviv Shamsian (Aiola, 2022-today). News See my recent short tutorial on the expressive power of GNNs at the Graph Learning Meets Theoretical Computer Science workshop we organized at the Simons Institute. Proud to be the recipient of the Alon scholarship for the Integration of Outstanding Faculty. See my recent talk on Equivaraint architectures for learning in deep weight spaces . A new blog post on Equivaraint architectures for learning in deep weight spaces . I will serve as an area chair at NeurIPS 2023. See our recent tutorial on Exploring the practical and theoretical landscape of expressive graph neural networks given at the Learning on Graphs Conference . With With Fabrizio Frasca and Beatrice Bevilacqua. A new blog post on Subggraph GNNs on Towards Data Science. Our ICML 2020 paper On Learning Sets of Symmetric Elements received the Outstanding paper award (best paper award). See this interview for more details. Teaching 2025/Spring (Technion): Introduction to Machine Learning 2025/Spring (Technion): Deep Learning and groups 2024/winter (Technion): Topics in learning on graphs 2024/Spring (Technion): Deep Learning and groups 2023/winter (Technion): Topics in learning on graphs 2019/spring (WIS): Geometric and Algebraic Methods in Deep Learning 2018/winter (WIS): Geometry and Deep Learning Tweets by HaggaiMaron Publications Beyond Next Token Probabilities: Learnable, Fast Detection of Hallucinations and Data Contamination on LLM Output Distributions Guy Bar-Shalom*, Fabrizio Frasca*, Derek Lim, Yoav Gelberg, Yftah Ziser, Ran El-Yaniv, Gal Chechik, Haggai Maron The 40th Annual AAAI Conference on Artificial Intelligence (AAAI 2026) A shorter version was also presented as a spotlight presentation at the ICLR 2025 workshop 'Quantify Uncertainty and Hallucination in Foundation Models' Abstract Paper Code GL Equivariant Metanetworks for Learning on Low Rank Weight Spaces Theo Putterman, Derek Lim, Yoav Gelberg, Michael M. Bronstein, Stefanie Jegelka, Haggai Maron The Fourth Learning on Graphs Conference (LOG 2025) Oral Presentation Abstract Paper Beyond Token Probes: Hallucination Detection via Activation Tensors with ACT-ViT Guy Bar-Shalom, Fabrizio Frasca, Yaniv Galron, Yftah Ziser, Haggai Maron 39th Annual Conference on Neural Information Processing Systems (NeurIPS 2025) Abstract Paper GradMetaNet: An Equivariant Architecture for Learning on Gradients Yoav Gelberg, Yam Eitan, Aviv Navon, Aviv Shamsian, Theo Putterman, Michael M. Bronstein, Haggai Maron 39th Annual Conference on Neural Information Processing Systems (NeurIPS 2025) Abstract Paper Understanding and Improving Laplacian Positional Encodings For Temporal GNNs Yaniv Galron, Fabrizio Frasca, Haggai Maron, Eran Treister, Moshe Eliasof ECML-PKDD 2025 Abstract Paper Balancing Efficiency and Expressiveness: Subgraph GNNs with Walk-Based Centrality Joshua Southern*, Yam Eitan, Guy Bar-Shalom, Michael Bronstein, Haggai Maron, Fabrizio Frasca* International Conference on Machine Learning (ICML) 2025 Abstract Paper Code Topological Blind Spots: Understanding and Extending Topological Deep Learning Through the Lens of Expressivity Yam Eitan, Yoav Gelberg, Guy Bar-Shalom, Fabrizio Frasca, Michael Bronstein, Haggai Maron International Conference on Learning Representations (ICLR) 2025 Oral Presentation Abstract Paper Homomorphism Expressivity of Spectral Invariant Graph Neural Networks Jingchu Gai, Yiheng Du, Bohang Zhang, Haggai Maron, Liwei Wang International Conference on Learning Representations (ICLR) 2025 Oral Presentation Abstract Paper Lightning-Fast Image Inversion and Editing for Text-to-Image Diffusion Models Dvir Samuel, Barak Meiri, Haggai Maron, Yoad Tewel, Nir Darshan, Shai Avidan, Gal Chechik, Rami Ben-Ari International Conference on Learning Representations (ICLR) 2025 Abstract Paper Directed Graph Generation with Heat Kernels Marc T Law, Karsten Kreis, Haggai Maron TMLR 2025 Abstract Paper Foldable supernets: Scalable merging of transformers with different initializations and tasks Edan Kinderman, Itay Hubara, Haggai Maron, Daniel Soudry TMLR 2025 Abstract Paper A Flexible, Equivariant Framework for Subgraph GNNs via Graph Products and Graph Coarsening Guy Bar-Shalom, Yam Eitan, Fabrizio Frasca, Haggai Maron 38th Annual Conference on Neural Information Processing Systems (NeurIPS 2024) (A shorter version also appeared in the Symmetry and Geometry in Neural Representations Workshop @ NeurIPS 2024 winning the best paper award) Abstract Paper Fast Encoder-Based 3D from Casual Videos via Point Track Processing Yoni Kasten, Wuyue Lu, Haggai Maron 38th Annual Conference on Neural Information Processing Systems (NeurIPS 2024) Abstract Paper GRANOLA: Adaptive Normalization for Graph Neural Networks Moshe Eliasof, Beatrice Bevilacqua, Carola-Bibiane Schönlieb, Haggai Maron 38th Annual Conference on Neural Information Processing Systems (NeurIPS 2024) Abstract Paper The Empirical Impact of Neural Parameter Symmetries, or Lack Thereof Derek Lim*, Theo (Moe) Putterman*, Robin Walters, Haggai Maron, Stefanie Jegelka 38th Annual Conference on Neural Information Processing Systems (NeurIPS 2024) (A shorter version also appeared in HiLD 2024: 2nd Workshop on High-dimensional Learning Dynamics @ ICML 2024 winning the best paper award) Abstract Paper (Workshop version) Paper (Full version) Towards Foundation Models on Graphs: An Analysis on Cross-Dataset Transfer of Pretrained GNNs Fabrizio Frasca, Fabian Jogl, Moshe Eliasof, Matan Ostrovsky, Carola-Bibiane Schönlieb, Thomas Gärtner, Haggai Maron Symmetry and Geometry in Neural Representations (NeurReps) @ NeurIPS 2024 Abstract Paper Future Directions in Foundations of Graph Machine Learning Christopher Morris, Nadav Dym, Haggai Maron, İsmail İlkan Ceylan, Fabrizio Frasca, Ron Levie, Derek Lim, Michael Bronstein, Martin Grohe, Stefanie Jegelka International Conference on Machine Learning (ICML) 2024 Abstract Paper On the Expressive Power of Spectral Invariant Graph Neural Networks Bohang Zhang, Lingxiao Zhao, Haggai Maron International Conference on Machine Learning (ICML) 2024 Abstract Paper Equivariant Deep Weight Space Alignment Aviv Navon, Aviv Shamsian, Ethan Fetaya, Gal Chechik, Nadav Dym, Haggai Maron International Conference on Machine Learning (ICML) 2024 Abstract Paper GitHub Subgraphormer: Unifying Subgraph GNNs and Graph Transformers via Graph Products Guy Bar-Shalom, Beatrice Bevilacqua, Haggai Maron International Conference on Machine Learning (ICML) 2024 (A preliminary version appeared in NeurIPS 2023 New Frontiers in Graph Learning Workshop ) Abstract Paper Improved Generalization of Weight Space Networks via Augmentationss Aviv Shamsian, Aviv Navon, David W. Zhang, Yan Zhang, Ethan Fetaya, Gal Chechik, Haggai Maron International Conference on Machine Learning (ICML) 2024 (A preliminary version appeared in Symmetry and Geometry in Neural Representations Workshop, 37th Annual Conference on Neural Information Processing Systems (NeurIPS 2023) as an Oral Presentation). Abstract Paper GitHub Efficient Subgraph GNNs by Learning Effective Selection Policies Beatrice Bevilacqua, Moshe Eliasof, Eli Meirom, Bruno Ribeiro, Haggai Maron International Conference on Learning Representations (ICLR) 2024 Abstract Paper Graph Metanetworks for Processing Diverse Neural Architectures Derek Lim, Haggai Maron, Marc T. Law, Jonathan Lorraine, James Lucas International Conference on Learning Representations (ICLR) 2024 Spotlight Presentation Abstract Paper Expressive Sign Equivariant Networks for Spectral Geometric Learning Derek Lim, Joshua Robinson, Stefanie Jegelka, Haggai Maron 37th Annual Conference on Neural Information Processing Systems (NeurIPS 2023)",
  "content_length": 18789,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:16"
}