{
  "name": "Hai Helen Li",
  "homepage": "https://ece.duke.edu/people/hai-helen-li",
  "status": "success",
  "content": "Hai \"Helen\" Li | Duke Electrical & Computer Engineering Hai Li, Ph.D. Electrical and Computer Engineering Chair of Electrical and Computer Engineering, Marie Foote Reel E’46 Distinguished Professor Hai Li, Ph.D. Profile Photo Research Themes Artificial Intelligence & Machine Learning, Hardware & Software, Trustworthy Computing Education Ph.D. Purdue University, 2004 Positions Marie Foote Reel E'46 Distinguished Professor of Electrical and Computer Engineering Professor in the Department of Electrical and Computer Engineering Chair of the Department of Electrical and Computer Engineering Professor of Computer Science Awards, Honors, and Distinctions Fellow (NAI). National Academy of Inventors. 2024 Fellow, Executive Leadership in Academic Technology, Engineering and Science (ELATES). Drexel University. 2022 Fellow. Institute of Electrical and Electronics Engineers (IEEE). 2018 Distinguished Member. Association for Computing Machinery (ACM). 2018 Best Paper Award for the paper titled u201cClassification Accuracy Improvement for Neuromorphic Computing Systems with One-level Precision Synapsesu201d. Asia and South Pacific Design Automation Conference (ASPDAC). 2017 Fulton C. Noss Faculty Fellow. University of Pittsburgh. 2016 Best Paper Award for the paper titled u201cQuantitative Modeling of Racetrack Memory - A Tradeoff among Area, Performance, and Poweru201d. Asia and South Pacific Design Automation Conference (ASPDAC). 2015 Air Force Summer Faculty Fellowship Program Award (AF-SFFP). AFRL/RITC. 2015 Best Paper Award for the paper titled u201cA Weighted Sensing Scheme for ReRAM-based Cross-point Memory Arrayu201d. IEEE Computer Society Annual Symposium on VLSI (ISVLSI). 2014 Best Paper Award for the paper titled u201cCoordinating Prefetching and STT-RAM based Last-level Cache Management for Multicore Systemsu201d. Proceedings of the 23rd ACM International Conference on Great Lakes Symposium on VLSI (GLSVLSI). 2013 DARPA Young Faculty Award. Defense Advanced Research Projects Agency (DARPA). 2013 Air Force Visiting Faculty Research Program (VFRP) Fellowship. AFRL/RIB. 2013 NSF Career Award. National Science Foundation (NSF). 2012 Air Force Summer Faculty Fellowship Program Award (AF-SFFP). AFRL/RITC. 2011 Best Paper Award for the paper titled u201cCombined Magnetic- and Circuit-level Enhancements for the Nondestructive Self-Reference Scheme of STT-RAMu201d. ACM/IEEE International Symposium on Low Power Electronics and Design (ISLPED). 2010 Best Paper Award for the paper titled u201cDesign Margin Exploration of Spin-Torque Transfer RAM (SPRAM)u201d. the 9th International Symposium on Quality Electronic Design (ISQED). 2008 Courses Taught ECE 899: Special Readings in Electrical Engineering ECE 891: Internship ECE 661: Computer Engineering Machine Learning and Deep Neural Nets ECE 550D: Fundamentals of Computer Systems and Engineering ECE 493: Projects in Electrical and Computer Engineering Publications Li H, Mehra R. Recap of the 62nd ACM/IEEE Design Automation Conference (DAC62): The u201cChips to Systems Conferenceu201d (Accepted). IEEE Design &amp; Test. 2025 Dec;42(6):138u20139. Kim B, Huang Q, Taylor B, Zheng Q, Ku J, Chen Y, et al. MulPi: A Multi-class and Patient-Independent Epileptic Seizure Classifier With Co-Designed Input-stationary Computing-in-SRAM. IEEE transactions on biomedical circuits and systems. 2025 Aug;19(4):756u201366. Cheng F, Zhang T, Zhang J, Ku JHC, Wang Y, Yang X, et al. AutoRAC: Automated Processing-in-Memory Accelerator Design for Recommender Systems. In: Proceedings of the ACM Great Lakes Symposium on VLSI Glsvlsi. 2025. p. 791u20137. Wei C, Duan B, Guo C, Zhang J, Song Q, Li H, et al. Phi: Leveraging Pattern-based Hierarchical Sparsity for High-Efficiency Spiking Neural Networks. In: Proceedings International Symposium on Computer Architecture. 2025. p. 930u201343. Zhang J, Wang H, Ding Q, Gu J, Assouly R, Oliver W, et al. QPlacer: Frequency-Aware Component Placement for Superconducting Quantum Computers. In: Proceedings International Symposium on Computer Architecture. 2025. p. 1554u201367. Guo C, Wei C, Tang J, Duan B, Han S, Li H, et al. Transitive Array: An Efficient GEMM Accelerator with Result Reuse. In: Proceedings International Symposium on Computer Architecture. 2025. p. 990u20131004. Cheng F, Guo C, Wei C, Zhang J, Zhou C, Hanson E, et al. Ecco: Improving Memory Bandwidth and Capacity for LLMs via Entropy-Aware Cache Compression. In: Proceedings International Symposium on Computer Architecture. 2025. p. 793u2013807. Pan J, Chang CC, Xie Z, Chen Y, Li H. EDALearn: A Comprehensive RTL-to-Signoff EDA Benchmark for Democratized and Reproducible ML for EDA Research. In: IEEE ACM International Conference on Computer Aided Design Digest of Technical Papers Iccad. 2025. Chen Y, Guo C, He Y, Ma M, Molom-Ochir T, Ramos N, et al. Circuits to Systems: Co-Designing Efficient AI Hardware. IEEE Design and Test. 2025 Jan 1; Kim B, Li HH, Chen Y. Emerging Computing Mechanisms for Edge AI. IEEE Nanotechnology Magazine. 2025 Jan 1;19(2):25u201337. Guo C, Cheng F, Du Z, Kiessling J, Ku J, Li S, et al. A Survey: Collaborative Hardware and Software Design in the Era of Large Language Models. IEEE Circuits and Systems Magazine. 2025 Jan 1;25(1):35u201357. Molom-Ochir T, Taylor B, Li H, Chen Y. Advancements in Content-Addressable Memory (CAM) Circuits: State-of-the-Art, Applications, and Future Directions in the AI Domain. IEEE Transactions on Circuits and Systems I Regular Papers. 2025 Jan 1;72(8):3971u201382. Li Z, Zheng Q, Ku J, Taylor B, Li H. TFSRAM: A 249.8TOPS/W Timing-to-First-Spike Compute-in-Memory Neuromorphic Processing Engine With Twin-Column SRAM Synapses. IEEE Transactions on Circuits and Systems for Artificial Intelligence. 2024 Sep;1(1):26u201336. Kim B, Li H, Chen Y. Processing-in-Memory Designs Based on Emerging Technology for Efficient Machine Learning Acceleration. In: Proceedings of the ACM Great Lakes Symposium on VLSI Glsvlsi. 2024. p. 614u20139. Krestinskaya O, Fouda ME, Benmeziane H, El Maghraoui K, Sebastian A, Lu WD, et al. Neural architecture search for in-memory computing-based deep learning accelerators. Nature Reviews Electrical Engineering. 2024 May 20;1(6):374u201390. Li S, Wang Y, Hanson E, Chang A, Seok Ki Y, Li H, et al. NDRec: A Near-Data Processing System for Training Large-Scale Recommendation Models. IEEE Transactions on Computers. 2024 May 1;73(5):1248u201361. Wang B, Lin M, Zhou T, Zhou P, Li A, Pang M, et al. Efficient, Direct, and Restricted Black-Box Graph Evasion Attacks to Any-Layer Graph Neural Networks via Influence Function. In: Wsdm 2024 Proceedings of the 17th ACM International Conference on Web Search and Data Mining. 2024. p. 693u2013701. Yang X, Wang Z, Hu XS, Kim CH, Yu S, Pajic M, et al. Neuro-Symbolic Computing: Advancements and Challenges in Hardware-Software Co-Design. IEEE Transactions on Circuits and Systems II Express Briefs. 2024 Mar 1;71(3):1683u20139. Parhi KK, Li H, Kailas K, Krishnaswamy H, Alioto M, Ogorzalek M. Editorial: Special Issue for the 75th Anniversary of the IEEE Circuits and Systems Society [Editorial]. IEEE Circuits and Systems Magazine. 2024 Jan 1;24(2):3. Wu X, Hanson E, Wang N, Zheng Q, Yang X, Yang H, et al. Block-Wise Mixed-Precision Quantization: Enabling High Efficiency for Practical ReRAM-Based DNN Accelerators. IEEE Transactions on Computer Aided Design of Integrated Circuits and Systems. 2024 Jan 1;43(12):4558u201371. Wang Y, Li S, Zheng Q, Song L, Li Z, Chang A, et al. NDSEARCH: Accelerating Graph-Traversal-Based Approximate Nearest Neighbor Search through Near Data Processing. In: Proceedings International Symposium on Computer Architecture. 2024. p. 368u201381. Ramos N, Li H. CNN Implementation of Bayesian Plasticity for Robust Learning. In: 2024 IEEE 6th International Conference on AI Circuits and Systems Aicas 2024 Proceedings. 2024. p. 432u20136. Taylor B, Yang X, Li H. Weight Update Scheme for 1T1R Memristor Array Based Equilibrium Propagation. In: 2024 IEEE 6th International Conference on AI Circuits and Systems Aicas 2024 Proceedings. 2024. p. 388u201392. Zheng Q, Li S, Wang Y, Li Z, Chen Y, Li HL. Hybrid Digital/Analog Memristor-based Computing Architecture for Sparse Deep Learning Acceleration. In: Proceedings IEEE International Symposium on Circuits and Systems. 2024. De V, Li H. Recap of the 61st ACM/IEEE Design Automation Conference (DAC61): The 'Chips to Systems Conference'. IEEE Design and Test. 2024 Jan 1;41(6):95u20136. Tang M, Sun J, Li HH, Chen Y. Embracing Privacy, Robustness, and Efficiency with Trustworthy Federated Learning on Edge Devices. In: Proceedings of IEEE Computer Society Annual Symposium on VLSI Isvlsi. 2024. p. 284u20139. Zhao W, Li HH, Zito D. Outgoing Editorial. IEEE Transactions on Circuits and Systems I Regular Papers. 2023 Dec 1;70(12):4675u20137. Kim B, Li H. Monolithic 3D stacking for neural network acceleration. Nature Electronics. 2023 Dec 1;6(12):937u20138. Li HH. Guest Editorial Special Issue on the International Symposium on Integrated Circuits and Systems'ISICAS 2023. IEEE Transactions on Circuits and Systems I Regular Papers. 2023 Dec 1;70(12):4678u20134678. Hanson E, Li S, Zhou G, Cheng F, Wang Y, Bose R, et al. Si-Kintsugi: Towards Recovering Golden-Like Performance of Defective Many-Core Spatial Architectures for AI. In: Proceedings of the 56th Annual IEEE ACM International Symposium on Microarchitecture Micro 2023. 2023. p. 972u201385. Wang Y, Li S, Zheng Q, Chang A, Li H, Chen Y. EMS-i: An Efficient Memory System Design with Specialized Caching Mechanism for Recommendation Inference. ACM Transactions on Embedded Computing Systems. 2023 Sep 9;22(5 s). Li H, Taylor B. A Hardware and Software Co-design Framework for Energy Efficient Neuromorphic Systems. Office of Scientific and Technical Information (OSTI); 2023 Jul. Yang X, Yang H, Doppa JR, Pande PP, Chakrabartys K, Li H. ESSENCE: Exploiting Structured Stochastic Gradient Pruning for Endurance-Aware Re",
  "content_length": 93292,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:19"
}