{
  "name": "Hai Dong",
  "homepage": "https://www.rmit.edu.au/contact/staff-contacts/academic-staff/d/dong-dr-hai",
  "status": "success",
  "content": "Hai Dong - RMIT University Hai Dong SKIP TO CONTENT Search field Search Search RMIT Australia RMIT Europe RMIT Global RMIT Vietnam RMIT UP RMIT Online Students Alumni Staff Library RMIT Online Courses Courses by study area Undergraduate courses Postgraduate courses Vocational studies Pre-university studies Online courses and degrees Entry pathways Single courses Short courses and microcredentials Courses for international students Contact Study@RMIT Study with us How to apply Fees Scholarships School leaver information Student services Student experience Key dates Frequently asked questions Parents Career advisers Contact Study@RMIT Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Contact Study@RMIT About News Events Maps Careers Contact us Our strategy Governance & management Schools & colleges Respect for Australian Indigenous cultures Our locations and facilities Our heritage Regenerative Futures Research Our research Partnerships Impact Contact Centres and collaborations Research degrees Find researchers Partner Recruit students and graduates Workforce development Collaborate with RMIT Research partnerships Facilities, equipment and services Contact Industry Engagement Giving to RMIT International Study in Australia Apply to RMIT as an international student Courses for international students Contact Study@RMIT Fees and scholarships for international students International student services Key dates and intake information for international students Frequently asked questions Hai Dong Dr. Hai Dong Senior Lecturer See full profile Details College: School of Computing Technologies Department: School of Computing Technologies Campus: City Campus Australia hai.dong@rmit.edu.au ORCID: 0000-0002-7033-5688 Google Scholar LinkedIn Open to Masters Research or PhD student supervision Collaborative projects Media enquiries Membership of an advisory committee Industry Projects About Dr. Hai Dong is the Leader of the Systems and Security Group and Founding Director of the CloudTech-RMIT Green Cryptocurrency Joint Research Laboratory (GreenCryptoLab) at the RMIT School of Computing Technologies. He also chairs the Deep Edge Intelligence Task Force in the IEEE Computational Intelligence Society. He has published a monograph and 150+ (100+ CORE-A*/A or JCR/SJR-Q1) research articles in international journals and conferences, such as AAAI, ACM MM, ASE, ESORICS, ICML, ICSOC, ICWS, TIFS, TMC, TOSEM, TSC, and TSE. He received the Best Research Paper Award in ICSOC 2016 and IEEE ICBC 2025 and the 2023 RMIT Award for Research Engagement and Impact - Industry Engagement in Graduate Research. He has obtained 5 million+ in research funding as a chief investigator from government sources (ARC, CRC, QNRF) and industry. He has served on the organising and program committees of 100+ international conferences, such as AAAI, CIKM, ICDM, ICSOC, ICWS, and WWW. He has been an invited reviewer for 50+ international journals, such as CSUR, TKDE, TOIT, and TSC. His primary research interests include Service-Oriented Computing, Edge Intelligence, Blockchain, AI Security, Cyber Security, and Machine Learning. He is a Senior Member of the IEEE. Expand for full bio Collapse bio Media Research fields 4606 Distributed computing and systems software 4604 Cybersecurity and privacy 4605 Data management and data science 4611 Machine learning 4612 Software engineering 4602 Artificial intelligence UN sustainable development goals 9 Industry, Innovation and Infrastructure 12 Responsible Consumption and Production 17 Partnerships for the Goals 11 Sustainable Cities and Communities 8 Decent Work and Economic Growth 4 Quality Education Academic positions Director RMIT University CloudTech-RMIT Green Cryptocurrency Joint Research Laboratory (GreenCryptoLab) Melbourne, Australia 2022 – Present Faculty Member RMIT University Melbourne, Australia 2017 – Present Program Manager, Bachelor of Computer Science (Honours) RMIT University Melbourne, Australia 2016 – Present Vice-Chancellor's Research Fellow RMIT University Melbourne, Australia 2014 – 2017 Curtin Research Fellow Curtin University Perth, Australia 2012 – 2014 Research Associate Curtin University Perth, Australia 2011 – 2012 Supervisor projects Effective and Efficient Point Cloud Data Management 30 Jun 2025 Advanced Threat Mitigation for the Internet of Things 22 Jul 2024 Research and Design on the Security of Cross chain Protocols: Injecting Safety and Efficiency into Digital Asset Transactions 13 May 2024 Distributed data-driven IoT trust prediction 19 Feb 2024 Designing a Novel PoST Consensus Protocol for Green Cryptocurrency Platforms 31 Aug 2023 Privacy and security in online social networks 27 Jul 2023 Quantum Neural Networks algorithm for malware detection 22 May 2023 Adaptive and Ubiquitous Trust Framework for Internet of Things Interactions 19 Jul 2022 A Regulatory Template Engine for Real-time Constraint Enforcement in Decentralised Finance Platforms 4 Jul 2022 Towards a Scalable Consensus Algorithm to Meet the Green Cryptocurrency Requirements 23 May 2022 Towards AI Enabled Energy Efficient and Secure Blockchain 11 Dec 2021 User-Delay-Tolerance-Aware Edge Node Placement Optimization for Cost Minimization 22 Dec 2020 Identity Cloning Detection in Social Sensor-Clouds 4 Jan 2019 Machine Learning-driven Trust Prediction in Mobile Edge Computing-based Internet of Things Systems 1 Feb 2018 Preserving Privacy in Edge Computing 7 Oct 2016 Social-Sensor Cloud Services for Scene Reconstruction 1 Sep 2015 Teaching interests COSC2177 Computer Science Honours Thesis COSC2179 Minor Thesis/Project COSC2389 Minor Thesis/Project Part A COSC2390 Minor Thesis/Project Part B COSC2413/2426 Web Programming COSC2460 Computer Science Honours Thesis Part 1 COSC2461 Computer Science Honours Thesis Part 2 COSC2462 Preliminary Computer Science Honours Thesis COSC2626/2640 Cloud Computing COSC2757 Cloud Foundations COSC2803 Programming Studio 1 COSC2821 Cloud Developing COSC3154 Computer Science Honours Thesis Part A COSC3155 Computer Science Honours Thesis Part B CPT160 Introduction to Computer Systems Research interests Service-Oriented Computing, Cloud/Edge Computing, Edge Intelligence, Blockchain, Smart Contract, Cyber Security, AI Security, Machine Learning Initiatives and links Personal Homepage GreenCryptoLab DBLP Deep Edge Intelligence TF Acknowledgement of Country RMIT University acknowledges the people of the Woi wurrung and Boon wurrung language groups of the eastern Kulin Nation on whose unceded lands we conduct the business of the University. RMIT University respectfully acknowledges their Ancestors and Elders, past and present. RMIT also acknowledges the Traditional Custodians and their Ancestors of the lands and waters across Australia where we conduct our business - Artwork 'Sentient' by Hollie Johnson, Gunaikurnai and Monero Ngarigo. More information News Events Library Maps Careers Contacts Study with Us Levels of study Online courses and degrees Single courses Applying to RMIT International students Parents Careers advisers Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Research Our research Centres and collaborations Partnerships Research degrees Find researchers Research contacts Partner Workforce development Staff development and training Research partnerships Facilities and equipment services Giving About Our strategy Governance and management Values Sustainability Schools and colleges Our locations and facilities Copyright © 2025 RMIT University | Terms | Privacy | Accessibility | Website feedback | Complaints | ABN 49 781 030 034 | CRICOS provider number: 00122A | TEQSA provider number: PRV12145 | RTO Code: 3046 | Open Universities Australia | RMIT Training Pty Ltd, trading as RMIT University Pathways (RMIT UP), CRICOS Provider Code: 01912G",
  "content_length": 7914,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:19"
}