{
  "name": "Hai Zhao 0001",
  "homepage": "http://bcmi.sjtu.edu.cn/~zhaohai",
  "status": "success",
  "content": "Homepage, Hai Zhao, Chinese Word Segmentation, Natural Language Processing, Computational Linguistics, Machine Learning Hai Zhao Professor Department of Computer Science and Engineering, Shanghai Jiao Tong University Address: 800 Dongchuan Road, Shanghai E-mail: zhaohai at cs.sjtu.edu.cn TACL Action Editor since 2021, EMNLP-2021 Area Chair on Morphology and word segmentation, ACL-2019 Area Chair on Morphology and word segmentation, ACL-2018 Senior Area Chair on Morphology and word segmentation, ACL-2017 Area Chair on Parsing, News and for Phd/Master applicants Shanghai Jiao Tong University, taken on March 16th, 2010 Shared Tasks Publications Software Research Interest Natural Language Processing, Machine Learning, Data Mining, Bioinformatics and Artificial Intelligence Teaching Natural Language Processing Shared Tasks [2019-2020] SQuAD2.0 Leaderboard on Machine Reading Comprehension The leaderboard of Stanford Question Answering Dataset (SQuAD2.0) We were the best single model from 2019.07-09 first ever exceeding human performance and we now are the best models for both single and ensemble settings among all submissions according to the latest update on 2020.01.25. The official results are here, and our system report is here. [2019] RACE Leaderboard on Machine Reading Comprehension The leaderboard of RACE Reading Comprehension Dataset (RACE) We are the best. The official results are here, and our system report is here. [2019-2020] SNLI Leaderboard on Language Inference The leaderboard of The Stanford Natural Language Inference (SNLI) We are the best. The official results are here, and our system report is here. [2010] NEWS-2010(with Song Yan) The shared task at NEWS-2010 on transliteration the first ranks for both Chinese-English and English-Chinese tasks, The official results are here. [2009] CoNLL-2009 (with Chen Wenliang) The shared task at 13th Conference on Computational Natural Language Learning (CoNLL-2009), Syntactic and Semantic Dependencies in Multiple Languages The first in the semantic-only track out of all 20 submitted systems of this shared task for the avearage score of all seven languages. The second in the syntactic-semantic joint track out of 13 submitted systems for the avearage score of all seven languages, the first in the semantic part of the joint track for all, the first in the joint tracks for English, Catalan and Spanish, respectively. The official results of CoNLL-2009 are here, and our system reports are here and here. [2008] CoNLL-2008 The shared task at 12th Conference on Computational Natural Language Learning (CoNLL-2008), the joint parsing of syntactic and semantic dependencies The fourth in the syntactic-semantic joint track out of 20 submitted systems. The official results of CoNLL-2008 are here, and our system report is here. [2007] Bakeoff-4 The Fourth International Chinese Language Processing Bakeoff & the First CIPS Chinese Language Processing Evaluation (Bakeoff-4, Bakeoff-2007, 2008) All five top results in closed challenge of word segmentation task out of 166 submitted runs from 28 participant teams, Three second best results and one third best result in NER tasks out of 33 sumitted runs. The official results are here, and our system report is here. [2006] Bakeoff-3 The Third International Chinese Word Segmentation Bakeoff (Bakeoff-3, Bakeoff-2006) Four first ranks and two third ranks in word segmentation task out of 101 submitted runs from 29 participant teams, The official results are here, and our system report is here. Top Publications [2023] Zhuosheng Zhang#, Hai Zhao, Longxiang Liu#. 2023. Channel-aware Decoupling Network for Multi-turn Dialogue Comprehension. IEEE Transactions on Neural Networks and Learning Systems (TNNLS). [arXiv:2301.03953(PDF)] Junlong Li, Zhuosheng Zhang, Hai Zhao*. 2022. Dialogue-adaptive language model pre-training from quality estimation Neurocomputing Volume 516, Issue C, Pages 27-35 [arXiv preprint: 2009.04984(PDF)] Zhuosheng Zhang#; Kehai Chen; Rui Wang#; Masao Utiyama; Eiichiro Sumita, Zuchao Li, Hai Zhao*. 2023. Universal Multimodal Representation for Language Understanding. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), DOI: 10.1109/TPAMI.2023.3234170 [IEEE] [arXiv(PDF)] [2022] Zuchao Li, Hai Zhao*, Junru Zhou, Kevin Parnow, Shexia He. 2022. Dependency and Span, Cross-Style Semantic Role Labeling on PropBank and NomBank. ACM Transaction on Asian and Low-Resource Language Information Processing (TALLIP), Vol.21(6), Article No.: 130, pp 1¨C16 [ACM(PDF)] [arxiv(PDF)] Jiayi Wang, Rongzhou Bao, Zhuosheng Zhang, Hai Zhao*. 2022. Rethinking Textual Adversarial Defense for Pre-trained Language Models IEEE/ACM Transactions on Audio, Speech and Language Processing, vol. 30, pp. 2526-2540, DOI: 10.1109/TASLP.2022.3192097 [IEEE] [arXiv preprint: 2208.10251(PDF)] Yilin Zhao, Zhuosheng Zhang and Hai Zhao*. 2022. Reference Knowledgeable Network for Machine Reading Comprehension IEEE/ACM Transactions on Audio, Speech and Language Processing, volume 30, pages 1461-1473, DOI: 10.1109/TASLP.2022.3164219 [IEEE] [arXiv preprint: 2012.03709(PDF)] Zhuosheng Zhang, Shuohang Wang, Yichong Xu, Yuwei Fang, Wenhao Yu, Yang Liu, Hai Zhao, Chenguang Zhu and Michael Zeng. 2022. Scaling Multi-task Pre-training with Task Prefix. Findings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022), pages 5671¨C5685 [ACL Anthology (PDF)] [arXiv:2210.06277(PDF)] Hongqiu Wu, Ruixue Ding, Hai Zhao*, Boli Chen, Penguin Xie, Fei Huang, Min Zhang. 2022. Forging multiple training objectives for pre-trained language models via meta-learning. Findings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022), pages 6483¨C6495 [ACL Anthology (PDF)] Kailai Sun, Zuchao Li*, Hai Zhao*. 2022. Reorder and then Parse, Fast and Accurate Discontinuous Constituency Parsing. Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022), pages 10575-10588 [ACL Anthology (PDF)] Zhuosheng Zhang, Hai Zhao, Ming Zhou. 2022. Instance Regularization for Discriminative Language Model Pre-training. Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022), pages 11255¨C11265 [ACL Anthology (PDF)] Bohong Wu, Hai Zhao*. 2022. Sentence Representation Learning with Generative Objective rather than Contrastive Objective. Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022), pages 3356¨C3368 [ACL Anthology (PDF)] Yiyang Li, Hai Zhao*, Zhuosheng Zhang. 2022. Back to the Future: Bidirectional Information Decoupling Network for Multi-turn Dialogue Modeling. Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP 2022), pages 2761¨C2774 [ACL Anthology (PDF)] Jiajia Li; Ping Wang*; Zuchao Li*; Xi Liu; Masao Utiyama; Eiichiro Sumita; Hai Zhao, Haojun Ai. 2022. A Fuzzy Training Framework for Controllable Sequence-to-Sequence Generation. IEEE Access, Volume: 10: 92467 - 92480 [IEEE] Yiyang Li, Hongqiu Wu, Hai Zhao*. 2022. Semantic-Preserving Adversarial Code Comprehension. The 29th International Conference on Computational Linguistics (COLING 2022), pages 3017¨C3028 [ACL Anthology (PDF)] Jialin Chen, Zhuosheng Zhang, Hai Zhao*. 2022. Modeling Hierarchical Reasoning Chains by Linking Discourse Units and Key Phrases for Reading Comprehension. The 29th International Conference on Computational Linguistics (COLING 2022), pages 1467¨C1479 [ACL Anthology (PDF)] Ziming Cheng, Zuchao Li*, Hai Zhao*. 2022. BiBL: AMR Parsing and Generation with Bidirectional Bayesian Learning. The 29th International Conference on Computational Linguistics (COLING 2022), pages 5461-547 [ACL Anthology (PDF)] Yifei Yang#, Zuchao Li#, Hai Zhao*. 2022. Nested Named Entity Recognition as Corpus Aware Holistic Structure Parsing. The 29th International Conference on Computational Linguistics (COLING 2022), pages 2472¨C2482 [ACL Anthology (PDF)] Yifei Yang, Hai Zhao*. 2022. Aspect-based Sentiment Analysis as Machine Reading Comprehension. The 29th International Conference on Computational Linguistics (COLING 2022), pages 2461¨C2471 [ACL Anthology (PDF)] Zuchao Li, Junru Zhou, Hai Zhao*, Zhisong Zhang, Haoran Li, Yuqi Ju. 2022. Neural Character-Level Syntactic Parsing for Chinese. Journal of Artificial Intelligence Research, Vol.73 (2022): 461-509 [ACM JAIR(PDF)] Zuchao Li, Kevin Parnow, Hai Zhao*. 2022. Incorporating rich syntax information in Grammatical Error Correction. Information Processing and Management, Volume 59, Issue 3, pp.1-20. [ACM] Zuchao Li, Masao Utiyama*, Eiichiro Sumita, Hai Zhao*. 2022. Restricted or Not: A General Training Framework for Neural Machine Translation. Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics: Student Research Workshop, pages 245¨C251. [ACL Anthology (PDf)] Zuchao Li, Yiran Wang, Masao Utiyama*, Eiichiro Sumita, Hai Zhao*, Taro Watanabe. 2022. What Works and DoesnˇŻt Work, A Deep Decoder for Neural Machine Translation. Findings of the Association for Computational Linguistics: ACL 2022, pages 459¨C471. [ACL Anthology (PDf)] Bohong Wu, Zhuosheng Zhang, Jinyuan Wang and Hai Zhao*. 2022. Sentence-aware Contrastive Learning for Open-Domain Passage Retrieval. Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022), pages 1062¨C1074. [ACL Anthology (PDf)] Baorong Huang#, Zhuosheng Zhang#, Hai Zhao*. 2022. Tracing Origins: Coreference-aware Machine Reading Comprehension. Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022), pages 1281¨C1291. [ACL Anthology (PDf)] Yilin Zhao, Hai Zhao*, Libin Shen, and Yinggong Zhao. 2022. Lite Unified Modeling for Discriminative Reading Comprehension. Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022), pages 8682¨C8695. [ACL Anthology (PDf)] Jiayi Wang, Rongzho",
  "content_length": 54992,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:18"
}