{
  "name": "Hai Phan 0001",
  "homepage": "https://sites.google.com/site/ihaiphan",
  "status": "success",
  "content": "ihaiphanSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeAssociate Professor, New Jersey Institute of TechnologyDirector of AI4Good Lab, Associate Chair, Ph.D. Program Director and Founding Member of the Data Science DepartmentGITC #2105, NJIT Media Center, Newark, NJ 07104, USA Email: phan@njit.edu, Phone: 973-596-6367                         Open PositionsGoogle Scholar|Research GateDr. Phan is an Associate Professor at NJIT. Dr. Phan's topic of interest mainly focuses on privacy and security, social network analysis, machine learning, and spatio-temporal data mining. In particular, Dr. Phan is interested in understanding the nature of human behavior and human expression on health social networks and social media. At NJIT, Phan has established the required expertise in the field, i.e., privacy and security, ML, and health informatics, with over 65 publications. Many of them were published at leading venues, including ACM CCS, IEEE S&P, ICML, ECML, AAAI, IJCAI, IEEE ICDM, IEEE PerCom, AISTATS, IEEE BigData, ACM SigSpatial GIS, ACM Multimedia, etc., with an AAAI 2023 Distinguished Paper Award and several selected as best papers, i.e., IEEE SDS'22, IEEE ICDM’17, Springer CSoNet’19, Springer CSoNet’18, ACM BCB’15, IEEE/ACM ASONAM’15. Phan’s research has been generously supported by NSF and (long-term) industry partners, including Qualcomm Technology Inc., Adobe System Inc., and Wells Fargo.We are hiring Post-doc and PhD students in Spring/Fall 2024 with a strong math and machine learning background! Please send your CV to phan at njit.edu.Students:Apurv Verma (PhD) 2024 - presentKhiem Ton (PhD) 2024 - presentKhoa Nguyen (PhD) 2023 - presentKhang Tran (PhD) 2020 - presentAndrew Dennis (PhD) 2020 - present (Bloomberg)Hang Nguyen (Honor Undergraduate) 2019 - presentSimran Kaur (Honor Undergraduate) 2021 - presentHuong Ly Ngo (Master in Data Science) 2021 - presentAlumni:Phung Lai (PhD) 2018 - 2023, Tenure-track Assistant Professor, University at Albany, SUNYPelin Ayranci (PhD) 2020 - 2022, Technical Product Manager, PaypalHan Hu (PhD) 2016 - 2020Pradnya Desai (Honor Undergraduate) 2019 - 2022, MicrosoftAnuja Badeti (Honor Undergraduate) 2018 - 2022, BloombergMedia Cover: AIMinor, YWCC News, YWCC News (2), NJIT Weekly, Vox.com, NJSpotlight, NJ101.5, newstrotteur.fr, modrogen.com, actualite-sante.fr, scienmag.com,  Medicalxpress, Healthitanalytics.com, Princeton Magazine, Daily EmeraldNews | Slideshare | Dataset ReleasedNov 2025: Our OppyAI Inc. team, spun off from our lab at NJIT, won the $75k TITA Pitch Competition Award. We are bringing Neural Crypto, a breakthrough in achieving an end-to-end encrypted communication protocol between humans and AI at scale.July 2025: Our paper \"ViGText: Deepfake Image Detection with Vision-Language Model Explanations and Graph Neural Networks\" has been accepted to the Network and Distributed System Security (NDSS) Symposium 2026. April 2025: Invited to serve on 2 NSF Panels.April 2025: Our paper \"FlipStress: Noise Injection Defenses Against CPU-cache-based Web Attacks,\" has been accepted for publication in the 21st EAI International Conference on Security and Privacy in Communication Networks (EAI SecureComm) 2025.March 2025: Our paper, \"Operationalizing a Threat Model for Red-Teaming Large Language Models (LLMs),\" has been accepted for publication in the Transactions on Machine Learning Research (TMLR). This work is a comprehensive and extensive SOK on Red-Teaming LLMs.March 2025: Our paper, \"A Client-level Assessment of Collaborative Backdoor Poisoning in Non-IID Federated Learning,\" has been accepted for publication in the  45th IEEE International Conference on Distributed Computing Systems (IEEE ICDCS) 2025.March 2025: The Grace Hopper Artificial Intelligence Research Institute has funded our proposal, \"Automating Chip Design with AI: The Journey from Zero to Silicon.\" This project will develop cutting-edge solutions to generate Chip Designs with Large Language Models.March 2025: Invited to serve on two NSF panels.Feb 2025: The Grace Hopper Artificial Intelligence Research Institute has funded our proposal, \"FunSec: Certified Functional and Secure Code Generation with Large Language Models.\" This project will develop cutting-edge solutions to generate secure and functional software code with theoretical guarantees.Dec 2024: Invited to serve on an NSF panel.Dec 2024: Our paper, \"FairDP: Achieving Fairness Certification with Differential Privacy,\" has been accepted for publication in the IEEE Secure and Trustworthy Machine Learning Conference (IEEE SaTML) 2025. Dec 2024: Invited to review for NSF.Oct 2024: Our paper, \"An Analysis of the Prevalence and Trends in Drug-Related Lyrics on Twitter (X): A Quantitative Approach,\" has been accepted for publication in the Journal of Medical Internet Research (JMIR). Oct 2024: Invited to serve on an NSF panel.Sept 2024: Invited Panel Speaker on \"ML (for) Supply Chain Security: Promises, Pitfalls and Opportunities\" the ACM Scored'24 at ACM CCS'24, the flagship venue in Cybersecurity and Privacy.August 2024: Our demonstration system, \"SGCode: A Flexible Prompt-Optimizing System for Secure  Generation of Code,\" has been accepted to ACM CCS'24, the flagship venue in Cybersecurity and Privacy. You can access our web-based link to SGCode here: https://sgcode.codes. July 2024: Our paper \"PromSec: Prompt Optimization for Secure Generation of Functional Source Code with Large Language Models (LLMs)\" has been accepted to ACM CCS'24, the flagship venue in Cybersecurity and Privacy.  We show that we can generate secure software code at a significantly low cost, outperforming existing works.June 2024: Invited to serve on NSF Panels.April 2024: Our project \"XCopilot: Private Code Generating with Large Language Models\" in collaboration with Microsoft has been partially funded by an NSF Accelerating Research Translation (ART) grant and NJIT Collaborative Research and Innovation Strategic Partnership (CRISP) investment plan through the NJIT Center for Translational Research (CTR).March 2024: Our Handbook of Trustworthy Federated Learning is out. The first-of-its-kind book focuses on providing insights into trustworthy federated learning. Part of the book series: Springer Optimization and Its Applications (SOIA, volume 213).Feb 2024: Our patent application Secure Prompt, in which we can fix vulnerabilities in software codes generated by LLMs in a cost-effective and optimized manner, has been accepted as a US provisional patent, and we are working on a US patent filing.Nov 2023: Exciting news! We will work with Qualcomm Inc. to bring the next generation of Generative AI to mobile devices in a secure, private, and scalable manner. Nov 2023: Invited talk \"Effects of Generative AI and Opportunities\" at the Newark Regional Business Partnership - Regional Economic Outlook, Nov 8, 2023. Nov 2023: Our team won a QRDI Award of ~$740k no overhead ~ $1m+ with overhead to develop Trustworthy Federated Learning for Deployable Distributed Generative AI (award rate: 18 / 500+, 3.6%).Nov 2023: Invited to serve on an NSF panel.August 2023: Our paper \"Differential Privacy in HyperNetworks for Personalized Federated Learning\" has been accepted to the 32nd ACM International Conference on Information and Knowledge Management (ACM CIKM 2023). July 2023: Our paper \"Multi-Instance Adversarial Attack on GNN-Based Malicious Domain Detection\" has been accepted to the 45th IEEE Symposium on Security and Privacy (IEEE S&P 2024).Jun 2023: Invited to serve on an NSF panel.May 2023: Our paper \"Exploring COVID-19’s Impact on Mental Health: A Longitudinal and Thematic Analysis of Reddit Users’ Discourse\" has been accepted in the Journal of Medical Internet Research (JMIR). IF: 7.08.Feb 2023: Our paper \"XRand: Differentially Private Defense against Explanation-Guided Attacks\" was selected as one of the twelve AAAI 2023 Distinguished Paper Awards. AAAI Conference Paper Awards and Recognition honors papers that exemplify the highest standards in technical contribution and exposition.Jan 2023: Our paper \"Active Membership Inference Attack under Local Differential Privacy in Federated Learning\" has been accepted to the 26th AISTATS 2023. This paper shows that passively applying Local Differential Privacy (LDP) is vulnerable to Active Membership Inference Attacks.Jan 2023: Our paper \"Un-Fair Trojan: Targeted Backdoor Attacks Against Model Fairness\" has won the Best Paper Award at the 9th IEEE International Conference on Software Defined Systems (IEEE SDS-2022). In this paper, we develop Un-Fair Trojan to severely damage model fairness while remaining stealthy in Federated Learning.Dec 2022: Our paper \"Zone-based Federated Learning for Mobile Sensing Data\" has been accepted at the IEEE PerCom 2023, a leading venue in mobile computing. We propose Zone-based Federated Learning (ZoneFL) to simultaneously achieve good model accuracy while adapting to user mobility behavior, scale well as the number of users increases, and protect user data privacy.Dec 2022: Serve as a Senior PC member - IJCAI 2023, PC member of KDD 2023, Reviewer of ICML 2023.Dec 2022: Gave an invited lecture on  \"Privacy in Machine Learning: Policies, Societal Concerns, and Challenging Gaps\" at the University of Alberta.Nov 2022: Our paper \"XRand: Differentially Private Defense against Explanation-Guided Attacks\" has been accepted in the AAAI 2023. In this paper, we introduce a new concept of achieving local differential privacy (LDP) in the explanations, and from that, we establish a defense, called XRand, against explanation-guided attacks.Nov 2022: Our paper \"FLSys: Toward an Open Ecosystem for Federated Learning Mobile Apps\" has been accepted in IEEE Transactions on Mobile Computing. We developed a scalable system to open an ecosystem of FL on mobile apps. This is a joint work among NJIT, Kent State University, Qualcomm, and other industrial partners.Oct 2022: Invited to serve on an NSF Panel.Oct 2022: Two ",
  "content_length": 28123,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:18"
}