{
  "name": "Haibin Cai",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/caihaibin",
  "status": "success",
  "content": "Haibin Cai | Computer Science | Loughborough University Dr Haibin Cai Senior Lecturer Senior Tutor Publications Google Scholar +44 (0) 1509 223 157 Send email Office: N.2.08 (Haslegrave Building) Biography Research Publications Dr. Cai is a Senior Lecturer in the Department of Computer Science, Loughborough University. He previously worked as a Research Associate at the University of Portsmouth (2016-2018), Loughborough University (2018-2019) and Imperial College London (2019). His research interests include Computer Vision, Robotics and the application of Convolution Neural Networks in these areas. Grants PI, Understanding Human Intention for Robots (The Royal Society, RGS\\R1\\231286, 2023 -2024, £48k) PI, Unconstrained Gaze Estimation for Effective Human-robot Interaction (Royal Society International Exchanges, IEC\\NSFC\\211032, 2022-2024, £10k) PI, Sport and Exercise Beacon seedcorn funding (Loughborough University, 2021, £2500) Co-I, KTP: Loughborough University and MoA Technology Limited (2023-2025, £186k) Co-I, something old, something new: unlock understanding of archived plant specimens (2022-2023, £19k) Research areas Robot Vision Eye Tracking & Gaze Estimation Face Expression Recognition Motion Recognition Object Detection & Segmentation Featured publications Cai, H., Jiang, L., Liu, B., Deng, Y. and Meng, Q., 2019. Assembling convolution neural networks for automatic viewing transformation. IEEE Transactions on Industrial Informatics. Liu, B., Cai, H., Ju, Z. and Liu, H., 2019. RGB-D sensing based human action and interaction analysis: A survey. Pattern Recognition, 94, pp.1-12. Liu, B., Cai, H., Ju, Z. and Liu, H., 2019. Multi-stage Adaptive Regression for Online Activity Recognition. Pattern Recognition, p.107053. Cao, H.L., Esteban, P., Bartlett, M., Baxter, P.E., Belpaeme, T., Billing, E., Cai, H., Coeckelbergh, M., Costescu, C. and David, D., 2019. Robot-enhanced therapy: development and validation of a supervised autonomous robotic system for autism spectrum disorders therapy. IEEE Robotics and Automation Magazine. Cai, H., Fang, Y., Ju, Z., Costescu, C., David, D., Billing, E., Ziemke, T., Thill, S., Belpaeme, T., Vanderborght, B. and Vernon, D., 2018. Sensing-enhanced therapy system for assessing children with autism spectrum disorders: a feasibility study. IEEE Sensors Journal, 19(4), pp.1508-1518. Cai, H., Liu, B., Ju, Z., Thill, S., Belpaeme, T., Vanderborght, B. and Liu, H., 2018, September. Accurate Eye Center Localization via Hierarchical Adaptive Convolution. In British Machine Vision Conference (BMVC) (p. 284). Zhou, X., Li, J., Chen, S., Cai, H. and Liu, H., 2018. Multiple perspective object tracking via context-aware correlation filter. IEEE Access, 6, pp.43262-43273. Esteban, P.G., Baxter, P., Belpaeme, T., Billing, E., Cai, H., Cao, H.L., Coeckelbergh, M., Costescu, C., David, D., De Beir, A. and Fang, Y., 2017. How to build a supervised autonomous system for robot-enhanced therapy for children with autism spectrum disorder. Paladyn, Journal of Behavioral Robotics, 8(1), pp.18-38. Liao, Y., Sun, Y., Li, G., Kong, J., Jiang, G., Jiang, D., Cai, H., Ju, Z., Yu, H. and Liu, H., 2017. Simultaneous calibration: a joint optimization approach for multiple kinect and external cameras. Sensors, 17(7), p.1491. Zhou, X., Cai, H., Li, Y. and Liu, H., 2017, May. Two-eye model-based gaze estimation from a Kinect sensor. In IEEE International Conference on Robotics and Automation (ICRA) (pp. 1646-1653). Cai, H., Lee, D., Joonkoo, H., Fang, Y., Li, S. and Liu, H., 2017, October. Embedded vision based automotive interior intrusion detection system. In IEEE International Conference on Systems, Man, and Cybernetics (SMC) (pp. 2909-2914). IEEE. Liu, B., Cai, H., Ji, X. and Liu, H., 2017, September. Human-human interaction recognition based on spatial and motion trend feature. In IEEE International Conference on Image Processing (ICIP) (pp. 4547-4551). Cai, H., Yu, H., Zhou, X. and Liu, H., 2016, August. Robust gaze estimation via normalized iris center-eye corner vector. In International conference on intelligent robotics and applications (ICIRA) (pp. 300-309). Cai, H., Liu, B., Zhang, J., Chen, S. and Liu, H., 2015. Visual focus of attention estimation using eye center localization. IEEE Systems Journal, 11(3), pp.1320-1325. Cai, H., Zhou, X., Yu, H. and Liu, H., 2015, November. Gaze estimation driven solution for interacting children with asd. In International Symposium on Micro-NanoMechatronics and Human Science (MHS) (pp. 1-6). Cai, H., Yu, H., Yao, C., Chen, S. and Liu, H., 2015. Convolution-based means of gradient for fast eye center localization. In International Conference on Machine Learning and Cybernetics (ICMLC) (Vol. 2, pp. 759-764).",
  "content_length": 4743,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:20"
}