{
  "name": "Haibo Wang 0004",
  "homepage": "http://haibo.pro",
  "status": "success",
  "content": "Haibo Wang Home About me Publications Group Services Haibo Wang Assistant Professor Department of Computer Science University of Kentucky Office: 301 Davis Marksbury Building E-mail: wanghaibo at uky dot edu Links: CV, Google Scholar Short Bio Haibo Wang is a tenure-track assistant professor with Department of Computer Science at the University of Kentucky. He received his Ph.D. in computer science from the University of Florida in May 2023, advised by Shigang Chen. Prior to that, he received his B.E. degree in 2016 and Masterâs degree in computer science in 2019, both from the University of Science and Technology of China, advised by Liusheng Huang and Hongli Xu. His main research interests are network traffic measurement, data sketches and streaming algorithms, Internet of Things and network systems. His work received IEEE ICNP 2021 best paper award. Research Interests Network traffic measurement and monitoring Data sketches and streaming algorithms Edge-cloud computing and Internet of Things Network management and optimization News 08/2025 - One paper accepted to TMLR. 05/2025 - Invited to be a TPC member of IEEE INFOCOM 2026. 04/2025 - One paper accepted to IWQoS 2025. 03/2025 - One paper accepted to ICDCS 2025. 03/2025 - Selected as a Distinguished TPC Member of IEEE INFOCOM 2025. 02/2025 - Invited to serve as a TPC member of IEEE MASS 2025. Consider submitting your work! 01/2025 - Invited to serve as a TPC member of IEEE CLOUD 2025. Consider submitting your work! 01/2025 - One paper accepted to TheWebConference 2025. 12/2024 - Two papers accepted to INFOCOM 2025. 09/2024 - One paper accepted to TON. 06/2024 - One paper accepted to VLDB 2024. 05/2024 - Invited to be a TPC member of IEEE INFOCOM 2025. 04/2024 - Selected as Excellent Reviewer of IEEE Transactions on Network Science and Engineering in 2023. 04/2024 - Two papers accepted to IWQoS 2024. 02/2024 - Selected as a Distinguished TPC Member of IEEE INFOCOM 2024. 01/2024 - Invited to serve as a TPC member of IEEE MASS 2024. Consider submitting your work! 01/2024 - Invited to serve as a TPC member of IEEE CLOUD 2024. Consider submitting your work! 12/2023 - One paper accepted to IEEE INFOCOM 2024. 09/2023 - One paper accepted to IEEE TVT. 08/2023 - SSVS accepted to VLDB 2024. 06/2023 - One paper accepted to Elsevier COMNET. 05/2023 - One paper accepted to IEEE TNSE. 05/2023 - Invited to be a TPC member of IEEE INFOCOM 2024. 03/2023 - One paper accepted to ACM SIGMETRICS. 03/2023 - Two papers accepted to IEEE TNSE. 10/2022 - Invited to be a TPC member of IEEE CLOUD 2023. 08/2022 - One paper accepted to IEEE/ACM ToN. 06/2022 - One paper accepted to IEEE/ACM ToN. 03/2022 - Network-wide measurement accepted to IEEE ICDCS. 01/2022 - One paper accepted to IEEE/ACM ToN. 11/2021 - Virtual filter for non-duplicate sampling published in IEEE ICNP received the Best Paper Award. 09/2021 - Self-morphing Bitmap accepted to IEEE ICDE. 07/2021 - Virtual filter for non-duplicate sampling accepted to ICNP. 04/2021 - One invited paper on T-queries accepted to IEEE CLOUD. 03/2021 - One paper on robust task offloading accepted to TMC. 01/2021 - Randomized sketches accepted to VLDB. 05/2020 - PrePass accepted to COMNET. 04/2020 - Sketchtree accepted to IEEE TPDS. 08/2019 - I enrolled in a PhD program at UF. 12/2018 - One paper on integration of coflow and circuit scheduling accepted to TPDS. 05/2018 - One paper on load-balancing in data and control planes accepted to COMNET. 05/2018 - New homepage. Welcome! Page generated 2018-01-22 14:54:51 CST, by jemdoc.",
  "content_length": 3561,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:20"
}