{
  "name": "Haibo Chen 0001",
  "homepage": "http://ipads.se.sjtu.edu.cn/~hbchen",
  "status": "success",
  "content": "Haibo Chen [IPADS] pub:members:haibo_chen Table of Contents Haibo Chen About Me Research Selected Professional Services Teaching Awards and Honors Visiting Experiences Selected Publications Machine Learning Systems Formal Verification for Systems Operating System Scalibility Operating System Security Virtual Machine Security Distributed System Scalibility Interdiscipline Research Haibo Chen Distinguished Professor at School of Software, Shanghai Jiao Tong University Director of Institute of Parallel and Distributed Systems Director of Domain-specific Operating System Center of Ministry of Education, China Vice Director of Shanghai Key Laboratory for Scalable Computing and Systems Member of University Council, Shanghai Jiao Tong University Email: haibochen at sjtu dot edu dot cn. 中文主页 About Me I have been a Full Professor in School of Software, Shanghai Jiao Tong University since December 2011. I lead the Institute of Parallel and Distributed Systems and work with members to improve the performance and dependability of computer systems, including machine learning systems. I received a Bachelor degree and a Ph.D degree (Advisor: Prof. Binyu Zang) in computer science, both from Fudan University. I am an ACM Fellow and an IEEE Fellow. I am currently the chair of ACM SIGOPS. I am currently looking for self-motivated students with good background on systems related area. Drop me an E-mail if you have interests to work with me. Recent textbook on operating systems Modern Operating Systems: Principles and Implementation (现代操作系统：原理与实现) (2020 the most favorite IT books by 51CTO and Best Undergraduate Textbook Award by SJTU). I am the inaugural technical steering committee chair of the OpenHarmony projects. Please consider contributing to OpenHarmony. New: you are welcome to join the inaugural SIGOPS Strategic Workshop co-coloated with SOSP 2025. Research I am seeking solutions to improving the scalability and security of operating systems systems and distributed systems, using approaches like hardware-software co-design, formal methods as well as machine learning. My research takes a practical perspective, and I have a particular interest in conducting systems research that has industry impact. By focusing on practical system design and implementation, my work has led to the development of innovative systems and technologies that are now deployed across billions of devices. Past and Current Research Projects : Machine Learning Systems Formal Verification for Systems Operating Systems Scalability Operating Systems Security Virtual Machine Security Distributed Systems Scalability Interdispline Research Selected Professional Services Conference Organizers EuroSys: 2025 (PC co-chair) SOSP: 2017 (General Chair w/ Lidong Zhou), 2013 (Registration Chair, w/ Li Zhuang) APSys: 2015-2020 (Steering Committee Chair w/ Lorenzo Alvisi), 2014 (PC Chair w/ Lorenzo Alvisi), 2011 (General Chair w/ Zheng Zhang) ChinaSys: 2011-Now (Co-founder and Trustee), 2018-2022 (Chair) CCS: 2018 (Area Chair for Systems Security) ASPLOS: 2020 (Sponsor Co-chair) ICDCS: 2020 (PC Vice Chair) Program Committee Members SOSP: 2025, 2024, 2023, 2021, 2019, 2017, 2015, 2013 OSDI: 2025, 2024 ASPLOS: 2024 (ERC), 2023, 2022, 2019, 2017 EuroSys: 2023, 2022, 2021, 2019, 2017, 2016, 2014, 2013 Usenix ATC: 2019, 2017, 2016, 2015, 2014, 2012 Oakland: 2020, 2018, 2017, 2016 CCS: 2019, 2018, 2017 PPoPP: 2016 ISCA: 2022, 2016 FAST: 2017 Journal Editorship Editor and Co-chair of Special Sections: Communications of the ACM (2019 - Now) Editor of Contributed Articles / Review Articles: Communications of the ACM (2022 - Now) Associate Editor: ACM Transactions on Storage (2016 - Now) Award Committee ACM SIGOPS Dennis Richie Award Committee (2020, 2022), ACM SIGSAC Award Committee (2017), ACM CCS Best Paper Award & Test of Time Award Committee (2018), CCF/IEEE CS Young Computer Scientist Award (2016-2018) Teaching Computer Systems Design and Implementation, 2013, 2014, 2015, 2018. Distributed Systems, Fall, 2012. Operating Systems, Fall, 2009, 2010, 2013, 2014, 2019, 2020, 2021, 2022. Advanced Operating Systems, Fall, 2009, 2010, 2013 Advanced Computer Systems, Fall 2015 - Now Computer Systems Engineering, 2014 Awards and Honors Best Paper Award, ACM SOSP 2025. CACM Research Highlights, 2025. Golden Gear Award (Ranked 2 of 10 awardees) by China Machine Press. (for the textbook Operating Systems: Principles and Implementation)) Best Paper Award, ACM EuroSys 2024. Link ACM Fellow, 2023. Best Paper Award, ACM SOSP 2023. SIGMOD Research Highlight Award, 2023. The Best Undergraduate Textbook Award, Shanghai Jiao Tong University, 2023 (for the textbook Modern Operating Systems: Principles and Implementation). Tan Kah Kee Young Scientist Award for Information Sciences (only 1 recipient biennially across China), China Academy of Science, 2022. IEEE Fellow, 2022. Test of Time Award, IEEE/IFIP DSN 2022. Best Paper Honorable Mention, ACM SIGMOD 2022. Honorable Mention of The Dennis M. Ritchie Thesis Award (Advisor), ACM SIGOPS, 2021. Distinguished Paper Award, ACM ASPLOS 2021. 2020 the most favorite IT books by the publisher union organized by 51CTO (for the textbook Modern Operating Systems: Principles and Implementation) China Youth Science and Technology Award, 2020. Presidential Award of SJTU, 2020. National Science Fund for Distinguished Young Scholars, NSF of China, 2019. ACM Distinguished Member, 2019. Best Paper Award, ACM VEE 2019. First Prize of Technological Invention Award of China’s Ministry of Education, 2018 The Young Computer Scientist Award by China Computer Federation, 2015 Best Paper Award, ACM EuroSys 2015 National Prize for Progress in Science and Technology of China, 2015 Elected into National Youth Top‑notch Talent Support Program of China, 2014 Best Paper Nominee, HPCA 2014 ACM SIGSPATIAL GIS CUP, Champion, 2013; 3rd place, 2014 Best Paper Award, ACM APSys 2013 & 2017 Google Faculty Research Award, 2012 NetApp Faculty Fellowship, 2012 National Distinguished Ph.D Thesis Award, Ministry of Education of China, 2011. China Computing Federation (CCF) Distinguished PhD Dissertation Award, 2009 Best Paper Award, ICPP 2007 Visiting Experiences 2015.8 - 2016.2 Visiting Professor, National University of Singapore, Singapore 2011.3 - 2011.6 Visiting Scientist, PDOS, CSAIL, MIT 2008.8 - 2008.11 Technical Stuff Intern, VMware Inc., Palo Alto, CA. Advisor: Dr. Beng-hong Lim and Mr. Mike Chen 2008.1 - 2008.6 Research Intern, Microsoft Research Asia, Advisor: Prof. Frans Kaashoek Selected Publications (See the IPADS Publication Pages for my full publication list) (See here for a list sorted by year) Machine Learning Systems [SOSP] PhoenixOS: Concurrent OS-level GPU Checkpoint and Restore with Validated Speculation. Xingda Wei, Zhuobin Huang, Tianle Sun, Yingyi Hao, Rong Chen, Mingcong Han, Jinyu Gu, Haibo Chen. Proceedings of the 31th ACM Symposium on Operating Systems Principles (SOSP'25). Seoul, Republic of Korea, October 13 – 16, 2025. [SOSP] Characterizing Mobile SoC for Accelerating Heterogeneous LLM Inference. Le Chen, Dahu Feng, Erhu Feng, Yingrui Wang, Rong Zhao, Yubin Xia, Pinjie Xu, Haibo Chen. Proceedings of the 31th ACM Symposium on Operating Systems Principles (SOSP'25). Seoul, Republic of Korea, October 13 – 16, 2025. [OSDI] Preemptive Scheduling for Diverse XPUs using Multi-level Hardware Model. Weihang Shen, Mingcong Han, Jialong Liu, Rong Chen, and Haibo Chen. The 19th USENIX Symposium on Operating Systems Design and Implementation, Boston, MA, US, July 2025. [OSDI] BlitzScale: Fast and Live Large Model Autoscaling with O(1) Host Caching. Dingyan Zhang, Haotian Wang, Yang Liu, Xingda Wei, Yizhou Shan, Rong Chen, and Haibo Chen. The 19th USENIX Symposium on Operating Systems Design and Implementation, Boston, MA, US, July 2025. [ASPLOS] PipeLLM: Fast and Confidential Large Language Model Services with Speculative Pipelined Encryption. Yifan Tan, Cheng Tan, Zeyu Mi, Haibo Chen. The 30th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, March 2025. [SOSP] PowerInfer: Fast Large Language Model Serving with a Consumer-grade GPU. Yixin Song, Zeyu Mi, Haotong Xie, Haibo Chen. The 30th ACM Symposium on Operating Systems Principles, Texas, USA, November 2024. [SOSP] UGACHE: A Unified GPU Cache for Embedding-based Deep Learning Systems. Xiaoniu Song, Yiwen Zhang, Rong Chen, and Haibo Chen. The 29th ACM Symposium on Operating Systems Principles, Koblenz, Germany, October 2023. [OSDI] Microsecond-scale Preemption for Concurrent GPU-accelerated DNN Inferences. Mingcong Han, Hanze Zhang, Rong Chen, and Haibo Chen. The 16th USENIX Symposium on Operating Systems Design and Implementation, Carlsbad, CA, US, July 2022. [paper] Formal Verification for Systems [SIGMOD] Automated Validating and Fixing of Text-to-SQL Translation with Execution Consistency. Yicun Yang, Zhaoguo Wang, Yu Xia, Zhuoran Wei, Haoran Ding, Ruzica Piskac, Haibo Chen, Jinyang Li. In Proceedings of the 2025 ACM SIGMOD International Conference on Management of Data. [OSDI] Using Dynamically Layered Definite Releases for Verifying the RefFS File System. Mo Zou, Dong Du, Mingkai Dong, Haibo Chen. The 18th USENIX Symposium on Operating Systems Design and Implementation, Santa Clara, CA, US, July 2024.paper [SIGMOD] Proving Query Equivalence Using Linear Integer Arithmetic. Haoran Ding, Zhaoguo Wang, Yicun Yang, Dexin Zhang, Zhenglin Xu, Haibo Chen, Ruzica Piskac, Jinyang Li. In Proceedings of the 2024 ACM SIGMOD International Conference on Management of Data. 2024. [OSDI] BWoS: Formally Verified Block-based Work Stealing for Parallel Processing. Jiawei Wang, Bohdan Trach, Ming Fu, Diogo Behrens, Jonathan Schwender, Yutao Liu, Jitang Lei, Viktor Vafeiadis, Hermann Härtig and Haibo Chen. The 17th USENIX Symposium on Operating Systems Design and Implementation, Boston, MA, US, July 2023. [CAV] Affine Loop Invariant Generation via Matrix Algebra. Yucheng Ji, Hongfei ",
  "content_length": 41502,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:19"
}