{
  "name": "Haifeng Yu",
  "homepage": "https://www.comp.nus.edu.sg/~yuhf",
  "status": "success",
  "content": "Haifeng Yu's home page Haifeng YU Associate Professor (with tenure) Computer Science Department School of Computing National University of Singapore Mailing address: COM2-04-25 15 Computing Drive School of Computing National University of Singapore Republic of Singapore 117418 Current Research Interests Distributed Systems Security (including but not limited to blockchains, byzantine fault-tolerance, and security issues in distriuted learning) and Distributed Algorithms. Information for students interested in joining our research group Some example research projects in our group. Some high-level guideline on how to do good research. If you are considering being my student, please read Advisor's README first and then email me to set up a time to chat. Research Opportunities (email me your CV and transcripts to apply) Opening for research interns for students from outside of NUS and undergraduate student researchers (USR) for NUS students : I am recruiting research interns/USRs for 2025. The interns/USRs are expected to work on issues related to distributed systems security and algorithms in networking. To qualify, the applicant needs to be a top undergraduate student in a top university, with a strong academic track record. I particularly welcome internship applicants with achievements in Mathematics/Physics/Information Olympiad at the national or international level. Please email me to apply. Opening for Ph.D. students seeking advisors: I am actively recruiting Ph.D. students to collaborate on world-class research on distributed algorithms and network algorithms. Besides CS major students, I am also very interested in working with students with a Bachelor's degree in Mathematics. Students with Bachelor's degrees in other related areas (such as Physics) and with strong mathematical background are also very welcome. Journal Editorial Board Membership Journal of Computer and System Sciences International Journal of Security and Networks Program Committee Chair Track Co-Chair for the Distributed Algorithms and Theory track, ICDCS'23 (International Conference on Distributed Computing Systems) PC Co-Chair for Distributed Computing Track, ICDCN'11 (International Conference on Distributed Computing and Networking) Program Committee Member CoNEXT'26 (International Conference on Emerging Networking EXperiments and Technologies) CoNEXT'25 (International Conference on Emerging Networking EXperiments and Technologies) ASIACCS'25 (ASIA Conference on Computer and Communications Security) OSDI'25 (Symposium on Operating Systems Design and Implementation) SIGMETRICS'25 (International Conference on Measurement and Modeling of Computer Systems) EuroSys'25 (European Conference on Computer Systems) BigData'24 (IEEE International Conference on Big Data) SOSP'24 (Symposium on Operating Systems Principles) CoNEXT'24 (International Conference on Emerging Networking EXperiments and Technologies) SIGMETRICS'24 (International Conference on Measurement and Modeling of Computer Systems) ASIACCS'24 (ASIA Conference on Computer and Communications Security) SOSP'23 (Symposium on Operating Systems Principles) SIGMETRICS'23 (International Conference on Measurement and Modeling of Computer Systems) EuroSys'23 (European Conference on Computer Systems) DISC'22 (International Symposium on Distributed Computing) PODC'22 (ACM Symposium on Principles of Distributed Computing) ICDCS'22 (International Conference on Distributed Computing Systems) SIGMETRICS'22 (International Conference on Measurement and Modeling of Computer Systems) ICDCN'22 (International Conference on Distributed Computing and Networking) SIGMETRICS'21 (International Conference on Measurement and Modeling of Computer Systems) ICDCN'21 (International Conference on Distributed Computing and Networking) ICDCS'20 (International Conference on Distributed Computing Systems) APNet'19 (Asia-Pacific Workshop on Networking) ICDCN'19 (International Conference on Distributed Computing and Networking) DISC'18 (International Symposium on Distributed Computing) APNet'18 (Asia-Pacific Workshop on Networking) PODC'18 (ACM Symposium on Principles of Distributed Computing) OPODIS'17 (International Conference on Principles of Distributed Systems) APNet'17 (Asia-Pacific Workshop on Networking) SIGCOMM'17 (ACM SIGCOMM Conference) IPDPS'17 (International Parallel and Distributed Processing Symposium) CoNEXT'16 (International Conference on Emerging Networking EXperiments and Technologies) ICDCS'16 (International Conference on Distributed Computing Systems) SIGMETRICS'16 (International Conference on Measurement and Modeling of Computer Systems) IPDPS'16 (International Parallel and Distributed Processing Symposium) PODC'16 (ACM Symposium on Principles of Distributed Computing) ICDCN'16 (International Conference on Distributed Computing and Networking) OPODIS'15 (International Conference on Principles of Distributed Systems) DISC'15 (International Symposium on Distributed Computing) ICDCS'15 (International Conference on Distributed Computing Systems) IPDPS'15 (International Parallel and Distributed Processing Symposium) WWW'15 (International WWW Conference) CoNEXT'14 (International Conference on emerging Networking EXperiments and Technologies) SIGMETRICS'14 (International Conference on Measurement and Modeling of Computer Systems) WWW'14 (International WWW Conference) PODC'13 (ACM Symposium on Principles of Distributed Computing) ICDCS'13 (International Conference on Distributed Computing Systems) CCS'12 (ACM Conference on Computer and Communications Security) SIGCOMM'12 (ACM SIGCOMM Conference) APSys'11 (ACM SIGOPS Asia-Pacific Workshop on Systems) CCS'11 (ACM Conference on Computer and Communications Security) SIGCOMM'11 (ACM SIGCOMM Conference) SIGMETRICS'11 (International Conference on Measurement and Modeling of Computer Systems) NetEcon'10 (Workshop on the Economics of Networks, Systems, and Computation) DCOSS'10 (IEEE International Conference on Distributed Computing in Sensor Systems) CCS'10 (ACM Conference on Computer and Communications Security) Oakland'10 (IEEE Symposium on Security and Privacy) IPTPS'10 (International Workshop on Peer-to-Peer Systems) IPDPS'10 (IEEE International Parallel and Distributed Processing Symposium) ICDCN'10 (International Conference on Distributed Computing and Networking) PODC'09 (ACM Symposium on Principles of Distributed Computing) ICDCS'09 (International Conference on Distributed Computing Systems) ICDE'09 (International Conference on Data Engineering) DISC'08 (International Symposium on Distributed Computing) SIGMETRICS'08 (International Conference on Measurement and Modeling of Computer Systems) DSN'08 (International Conference on Dependable Systems and Networks) STC'07 (ACM Workshop on Scalable Trusted Computing) IPTPS'07 (International Workshop on Peer-to-Peer Systems) STC'06 (ACM Workshop on Scalable Trusted Computing) PODC'06 (ACM Symposium on Principles of Distributed Computing) DSN'06 (International Conference on Dependable Systems and Networks) PODC'05 (ACM Symposium on Principles of Distributed Computing) Publications Yucheng Sun, Haifeng Yu, and Ruomu Hou, \"Committee Selection with Non-Proportional Weights.\" Proceedings of the ACM Conference on Computer and Communications Security (CCS'25), October 2025. Technical report version available as [Technical Report]. [Conference talk slides]. Ruomu Hou, Haifeng Yu, and Prateek Saxena, \"Throughput of Byzantine Broadcast.\" Journal of Parallel and Distributed Computing, Volume 203, September 2025. Ruomu Hou, Haifeng Yu, and Yucheng Sun, \"Selfied: Sybil Defense in Permissionless Blockchains via In-protocol Bandwidth Consumption.\" Computer Networks, Volume 256, Jan 2025. Yucheng Sun, Ruomu Hou, and Haifeng Yu, \"Using Multi-dimensional Quorums for Optimal Resilience in Multi-resource Blockchains.\" Formal Aspects of Computing, Volume 36, Issue 4, Dec 2024. Yucheng Sun, Ruomu Hou, and Haifeng Yu, \"Robust and Low-degree Overlay for Secure Flooding Against Resource-bounded Adversaries.\" Proceedings of the IEEE Pacific Rim International Symposium on Dependable Computing (PRDC'24), Nov 2024. Winner of Best Paper Award. Technical report version available as [Technical Report]. [Conference talk slides]. Irvan Jahja and Haifeng Yu, \"Sublinear Algorithms in T-Interval Dynamic Networks.\" Algorithmica, Volume 86, Jul 2024. Yucheng Sun, Ruomu Hou, and Haifeng Yu, \"Using Multi-dimensional Quorums for Optimal Resilience in Multi-resource Blockchains.\" Proceedings of the IEEE Pacific Rim International Symposium on Dependable Computing (PRDC'23), Oct 2023. Winner of 2023 IEEE Distinguished Paper Award on Dependable Computing. Technical report version available as [Technical Report]. [Conference talk slides]. Ruomu Hou and Haifeng Yu, \"Optimistic Fast Confirmation While Tolerating Malicious Majority in Blockchains.\" Proceedings of the IEEE Symposium on Security and Privacy (Oakland'23), May 2023. Technical report version available as [Technical Report]. [Conference talk slides]. Ruomu Hou, Irvan Jahja, Yucheng Sun, Jiyan Wu, and Haifeng Yu, \"Achieving Sublinear Complexity under Constant T in T-interval Dynamic Networks.\" Proceedings of the ACM Symposium on Parallelism in Algorithms and Architectures (SPAA'22), July 2022. Full version available as [Technical Report], May 2022. [Conference talk slides]. Ruomu Hou, Haifeng Yu, and Prateek Saxena, \"Using Throughput-Centric Byzantine Broadcast to Tolerate Malicious Majority in Blockchains.\" Proceedings of the IEEE Symposium on Security and Privacy (Oakland'22), May 2022. Full version available as [Technical Report]. [Conference talk slides]. Irvan Jahja, Haifeng Yu, and Ruomu Hou, \"On the power of randomization in distributed algorithms in dynamic networks with adaptive adversaries.\" Journal of Parallel and Distributed Computing, Volume 159, pp. 35-50, Jan 2022. Steffen Bondorf, Binbin Chen, Jonathan Scarlett, Haifeng Yu, and Yuda Zhao, \"Sublinear-Time Non-Adaptive Group Testing with O(k l",
  "content_length": 24464,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:21"
}