{
  "name": "Haifeng Xu",
  "homepage": "https://cs.uchicago.edu/people/haifeng-xu",
  "status": "success",
  "content": "Haifeng Xu – Department of Computer Science Skip to content Contact Info Email haifengxu@uchicago.edu Website https://www.haifeng-xu.com/ Twitter https://twitter.com/haifengxu0 Office JCL 260 Haifeng Xu is an assistant professor in the Department of Computer Science at UChicago, where he directs the Strategic IntelliGence for Machine Agents (SIGMA) lab (hyperlink to https://www.haifeng-xu.com/sigma/index.html). He studies the economics of data and machine learning, including designing learning algorithms for multi-agent decision making and designing markets for data and ML algorithms. Haifeng publishes regularly at leading machine learning and computational economics conferences, and serves as area chair or senior program committee for premier venues such as ICML, EC, AAAI, IJCA, etc. His research has been recognized by multiple awards, including the AI2050 Early Career fellow, IJCAI Early Career Spotlight, Google Faculty Research Award, ACM SIGecom Dissertation Award (honorable mention), IFAAMAS Distinguished Dissertation Award (runner-up), and multiple best paper awards; his works have been generously supported by varied agencies including NSF, ARO, ONR, Schmidt Science, and Google Research. Focus Areas: computational economics, machine learning, multi-agent systems, algorithms More descriptions: The following research themes are the recent focus of our research lab. Please refer to our lab’s website for more details. The economics of data/information, including selling, acquiring, and exploiting information Machine learning in multi-agent setups under information asymmetry, incentive conflicts, and deception Resource allocation in adversarial domains, with applications to security and privacy protection Research AI & Machine Learning Foundations and applications of computer algorithms making data-centric models, predictions, and decisions Theory The mathematical foundations of computation, including algorithm design, complexity and logic Labs & Groups Strategic IntelliGence for Machine Agents (SIGMA) Lab Haifeng Xu Develops cutting-edge machine learning and decision making techniques that can excel in uncertain and complex strategic environments, ranging from national... Awards & Honors 2024 Best paper award, Web Conference AI2050 Early Career Fellow 2023 AI2050 Early Career Fellow IJCAI Early Career Spotlight 2020 Google faculty research award 2019 Best application system demo award, AAMAS ACM SIGecom dissertation award, honorable mention IFAAMAS award, runner-up 2016 Best paper award, AAMAS Best student paper award, AAMAS UChicago CS News New CS and DSI Faculty Haifeng Xu Brings Strategic Intelligence to NeurIPS 2022 Nov 28, 2022 UChicago CS News New 2022-23 Faculty Add Expertise in Linguistics, Visualization, Economics, and Data Science Education Aug 11, 2022 arrow-down-largearrow-left-largearrow-right-large-greyarrow-right-large-yellowarrow-right-largearrow-right-smallbutton-arrowclosedocumentfacebookfacet-arrow-down-whitefacet-arrow-downPage 1CheckedCheckedicon-apple-t5backgroundLayer 1icon-google-t5icon-office365-t5icon-outlook-t5backgroundLayer 1icon-outlookcom-t5backgroundLayer 1icon-yahoo-t5backgroundLayer 1internal-yellowinternalintranetlinkedinlinkoutpauseplaypresentationsearch-bluesearchshareslider-arrow-nextslider-arrow-prevtwittervideoyoutube",
  "content_length": 3319,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:24"
}