{
  "name": "Haijun Zhang 0002",
  "homepage": "https://www.dl2link.com",
  "status": "success",
  "content": "Aaron, Haijun Zhang Aaron, Haijun Zhang Home Vita Education My Talk Publications Dataset Textbooks News Aaron, Haijun Zhang B.Eng., Ph.D. Full Professor Room: L1601 Tel: 0755-26033086 Fax: 0755-26033008 Email: hjzhang@hit.edu.cn Vita 2000å¹´9æï¼2007å¹´3æäºä¸åå¤§å­¦åå«è·å¾å­¦å£«åç¡å£«å­¦ä½ã2010å¹´10æè·é¦æ¸¯åå¸å¤§å­¦çµå­å·¥ç¨ç³»åå£«å­¦ä½ã2007å¹´3æè³2007å¹´8ä»»é¦æ¸¯åå¸å¤§å­¦å©çç ç©¶åã2010å¹´3æè³2010å¹´6æä»»ç¾å½é©¬éå °å¤§å­¦çµå­ä¸è®¡ç®æºå·¥ç¨ç³»è®¿é®å­¦è ã2010å¹´11æè³2011å¹´11æå·¥ä½äºå æ¿å¤§æ¸©èå¤§å­¦çµå¨ä¸è®¡ç®æºå·¥ç¨ç³»ä»»åå£«åç ç©¶åã2012å¹´3æ-2018å¹´12æä»»åå°æ»¨å·¥ä¸å¤§å­¦æ·±å³ç ç©¶çé¢è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢å¯ææãåå£«çå¯¼å¸ã2019å¹´è³ä»ä»»åå°æ»¨å·¥ä¸å¤§å­¦ï¼æ·±å³ï¼è®¡ç®æºç§å­¦ä¸ææ¯å­¦é¢ææãåå£«çå¯¼å¸ï¼å¹¿ä¸çâæºå¨åæä¸æºè½è®¾è®¡âåæ°å¢éè´è´£äººãä¸»è¦ç ç©¶æ¹åä¸ºæ°æ®ææãæºå¨å­¦ä¹ ãå¤åªä½ä¿¡æ¯å¤çãæ¶å°æºè½ãæå¡è®¡ç®ç­ãèª2007å¹´èµ·ï¼åä¸å¹¶å®æäºå¤é¡¹å½å®¶éç¹ç åè®¡åãå½å®¶èªç¶ç§å­¦åºéé¡¹ç®ãé¦æ¸¯æ¿åºRGCç ç©¶é¡¹ç®ãç¾å½èªç¶ç§å­¦åºéèµå©é¡¹ç®åå æ¿å¤§èªç¶ç§å­¦ä¸å·¥ç¨ç ç©¶é¡¹ç®ãå¨IEEE Trans.ç­å½é é¡¶çº§æåãä¼è®®åè¡¨è®ºæ150ä½ç¯ï¼ææç¾å½ãæ¥æ¬ãä¸­å½ç­åæä¸å©20ä½é¡¹ãç®åæ ä»»IEEE Transactions on Consumer Electronicsç­å½é æåç¼å§ã Research Interests Data mining, Machine Learning, Fashion AI, Generative AI, Service Computing Research Groups å¹¿ä¸çâæºå¨åæä¸æºè½è®¾è®¡âåæ°å¢é å·¥ä¸åºç¨ç³»ç» åå¡ç¥¨æ®æºè½è¯å«ç³»ç»ãç¾¤æºåè½¯ä»¶å¼åå¹³å°ãæºè½ç©¿æ­ç³»ç»ãæ äººé¶å®æãæ äººæºå·¡æ£ç³»ç»ç­ Education Ph.D. from the Department of Electronic Engineering, City University of Hong Kong, HK, October 2010. Bachelor of Engineering (B.Eng) degree (Hons) and Master of Engineering (M.Eng) degree from Northeastern University,P. R. China, June 2004 and March 2007, respectively. Work Experience During Apr.-Sep. 2007, I worked with Prof. Andrew Leung as a research associate at City University of Hong Kong, Hong Kong. During Apr.-Jun. 2010, I worked with Prof. Stuart D. Milner and Prof. Christopher C. Davis as an exchange researcher at the Department of Electronic and Computer Engineering, University of Maryland, College Park, USA. Dec. 2010-Dec. 2011, I held a Postdoctoral Fellowship and worked with Prof. Jonathan Q. M. Wu at the Department of Electrical and Computer Engineering, University of Windsor, Ontario, Canada. Mar. 2012-Dec. 2018, I am an Associate Professor at the Department of Computer Science, Shenzhen Graduate School, Harbin Institute of Technology, Shenzhen, P. R. China. Jan. 2019-Present, I am a Full Professor at the Department of Computer Science, Harbin Institute of Technology, Shenzhen, P. R. China. My Talk [1]. CCF-Shenzhen-å­¦æ¯è®ºæå®¡ç¨¿åæ°åç»éªåäº«.pdf Selected Publications [1]. Haijun Zhang, Yanfang Sun, Mingbo Zhao, Tommy W. S. Chow and Q.M. Jonathan Wu. Bridging User Interest to Item Content for Recommender Systems: An Optimization Model. IEEE Transactions on Cybernetics, Mar. 2019, in press, doi: 10.1109/TCYB.2019.2900159. [2]. Haijun Zhang, Shuang wang, Mingbo Zhao, Xiaofei Xu, and Yunming Ye. Locality Reconstruction Models for Book Representation. IEEE Transactions on Knowledge and Data Engineering, Feb. 2018, in press, doi: 10.1109/TKDE.2018.2808953. [3]. Haijun Zhang, Shuang Wang, Xiaofei Xu, et al. Tree2Vector: Learning a Vectorial Representation for Tree-Structured Data. IEEE Transactions on Neural Networks and Learning Systems, Jan. 2018, in press, doi: 10.1109/TNNLS.2018.2797060. [4]. Haijun Zhang, Xiong Cao, John K. L. Ho, and Tommy W. S. Chow. Object-level Video Advertising: An Optimization Framework. IEEE Transactions on Industrial informatics, Apr. 2017, Volume: 13, Issue: 2, pp. 520 - 531. [5]. Haijun Zhang, Jingxuan Li, Yuzhu Ji, and Heng Yue. Subtitle Understanding by Character-level Sequence-to-sequence Learning. IEEE Transactions on Industrial informatics, Apr. 2017, Volume: 13, Issue: 2, pp. 616 â 624. [6]. Haijun Zhang, Yuzhu Ji, Jingxuan Li, and Yunming Ye. A Triple Wing Harmonium Model for Movie Recommendation. IEEE Transactions on Industrial informatics, Feb. 2016, vol. 2, no. 1, pp. 231-239. [7]. Haijun Zhang, Tommy W. S. Chow, and Q. M. Jonathan Wu. Organizing Books and Authors by Multilayer SOM. IEEE Transactions on Neural Networks and Learning Systems, Dec. 2016,vol. 27, no. 12, pp. 2537-2550. [8]. Haijun Zhang, John K. L. Ho, Jonathan Q. M. Wu, and Yunming Ye. Multi-Dimensional Latent Semantic Analysis Using Term Spatial Information. IEEE Transactions on Systems, Man and Cybernetics-Part B, 2013, vol. 43, no. 6, pp. 1625-1640. [9]. Haijun Zhang, Jaime Llorca, Christopher C. Davis and Stuart D. Milner. Nature-Inspired Self-Organization, Control and Optimization in Heterogeneous Wireless Networks. IEEE Transactions on Mobile Computing, 2012, vol.11, no. 7, pp. 1207-1222. [10]. Haijun Zhang, Gang Liu, Tommy W. S. Chow and Wenyin Liu. Textual and Visual Content-based Anti-phishing: A Bayesian Approach. IEEE Transactions on Neural Networks, 2011, vol. 22, no. 10, pp. 1532-1546. [11]. Haijun Zhang and Tommy W. S. Chow. A Coarse-to-Fine Framework to Efficiently Thwart Plagiarism. Pattern Recognition, 2011, vol. 44, no. 2, pp. 471-487. [12]. Haijun Zhang, Tommy W. S. Chow, and M. K. M. Rahman. A New Dual Wing Harmonium Model for Document Retrieval. Pattern Recognition, 2009, vol. 42, no. 11, pp.2950-2960. [13]. Haijun Zhang, Jonathan Q. M. Wu , Tommy W. S. Chow, and Mingbo Zhao. A Two-Dimensional Neighborhood Preserving Projection for Appearance-Based Face Recognition. Pattern Recognition, 2012, vol. 45, no. 5, pp. 1866-1876. [14]. Qingyao Wu, Yunming Ye, Haijun Zhang and Shenyang Ho. ML-TREE: A Tree-Structure Based Approach to Multi-Label Learning. IEEE Transactions on Neural Networks and Learning Systems, 2015, vol. 26, no. 3, pp. 430-443. [15]. Xiaohui Huang, Yunming Ye and Haijun Zhang. Extensions of Kmeans-type Algorithms: A New Clustering Framework by Integrating Intra-cluster Compactness and Inter-cluster Separation. IEEE Transactions on Neural Networks and Learning Systems, 2014, 25(8), 1433-1446. [16]. Penglin Dai, Kai Liu, Liang Feng, Haijun Zhang, Victor Chung Sing Lee, Sang Hyuk Son, and Xiao Wu. Temporal Information Services in Large-Scale Vehicular Networks through Evolutionary Multi-Objective Optimization. IEEE Transactions on Intelligent Transportation Systemsï¼Feb. 2018, Accept and in press. Graduate Students Xiong Cao (2014.12) Tencent, Beijing Bin Luo (2014.12) Baidu, Shenzhen Lu Lu (2015.12) Baidu, Beijing Jingxuan Li (2015.12) Huawei, Shenzhen Zhengqi Li (2015.12) Baidu, Beijing Yusong An (2015.12) Rong360, Beijing Yusheng Wang (2016.12) Tencent, Shenzhen Linhe Xu (2016.12) Sogou, Beijing Shuang Wang (2017.12) Go abroad Li Zhu (2017.12) Meituan, Beijing Mingyue Chen (2017.12) Alibaba, Hangzhou Wang Huang (2017.12) Baidu, Shanghai Farooq Muhammad Omer (2017.12) Pakistan Yanfang Sun (2018.12) Baidu, Shenzhen Han Guo (2018.12) Tencent, Shenzhen Xiaoting Cui (2019.06) SF Express, Shenzhen Yuzhu Ji (2019.12) Nanyang Technological University, Singapore Mingshan Sun (2019.12) SenseTime, Shenzhen Donghai Li (2019.12) SenseTime, Shenzhen Xinghao Wang (2020.06) Huawei, Shenzhen Yingji Wu (2020.12) Tencent, Shenzhen Lang Ren (2020.12) Tencent, Shenzhen Qiong Yu (2020.12) CMB Network Tech., Hangzhou Wojia Yang (2021.06) Meituan, Beijing Linlin Liu (2021.12) Huawei, Shenzhen Qi Yuan (2021.12) Alibaba, Hangzhou Wenjian Xu (2021.12) Tencent, Shenzhen Jiaqi Chen (2021.12) Horizon Robotics, Shanghai Haibin Zhou (2021.12) Tencent, Shenzhen Shichao Xu (2021.12) Alibaba, Hangzhou Dingding Zuo (2022.06) Hefei Mingzheng Wang (2022.06) Kingdee Software, Shenzhen Kai Yang (2022.10) Wuhan Textile University, Wuhan Li Dong (2022.12) Shenzhen Technical University, Shenzhen Xiangyu Zou (2023.01) Harbin Institute of Technology, Shenzhen Jingkan Li (2023.03) Pinduoduo, Shanghai Ziliang Yin (2023.03) ByteDance, Shanghai Guojian Li (2023.06) TPLink, Shenzhen Lujiao Shao (2023.06) Huawei, Shenzhen Qingji Ren (2023.06) Dalian Junjin Zheng (2023.06) Pinduoduo, Shanghai Dongliang Zhou (2023.09) Postdoc, Harbin Institute of Technology, Shenzhen Xinrui Yu (2024.03) Aliyun, Beijing Gongcan Cai (2024.03) CMB, Shenzhen Huiyue Sun (2024.03) Ant Financial, Hangzhou Han Yan (2024.06) Donghua University, Shanghai Runzhe Wang (2024.06) Tencent, Shenzhen Zhe Huang (2024.06) iFLYTEK, Hefei Minglong Dong (2025.03) Tencent, Shenzhen Yazi Li (2025.06) Nanrui Group, Nanjing Zhenghao Xu (2025.06) Nanrui Group, Nanjing Chunxin Zhang (2025.06) East Money Information, Shanghai Qun Li (2025.09) Harbin Institute of Technology, Shenzhen Current Students Jianyang Shi PhD student 2019 Xiangyu Mu PhD student 2021 Jie Hou PhD student 2021 Chenrui Ma PhD student 2023 Chao Ouyang PhD student 2023 Dexiang Li PhD student 2024 Yu Wang PhD student 2024 Songling Li PhD student 2025 Fudi Yang PhD student 2025 Shi Ba PhD student 2025 Xiaobing Lin PhD student 2025 Xinyue Han Msc 2023 Boxiang Jia Msc 2023 Jiaheng Wu Msc 2023 Sizai Huang Msc 2024 Rongdian Ku Msc 2024 Wenhua Xu Msc 2024 Wanshu Yu Msc 2024 Jia Zhu Msc 2024 Zhenning Che Msc 2025 Haodong Ouyang Msc 2025 Dataset books_data Note:If you use the data above, please cite the following paper: H. Zhang, T. W. S. Chow, and Q. M. J. Wu, âOrganizing Books and Authors by Multilayer SOM,â IEEE Trans. Neural Netw. Learn. Syst., vol. 27, no. 12, pp. 2537-2550, Dec. 2016. 20newsgroupDataset books_use_total dmoz12c Html_CityU1 ReutersDataset webkb4 yahoo_science Note:If you use the data above, please cite the following paper: 1. Haijun Zhang, Shuang wang, Mingbo Zhao, Xiaofei Xu, and Yunming Ye. Locality Reconstruction Models for Book Representation. IEEE Transactions on Knowledge and Data Engineering, Feb. 2018, in press",
  "content_length": 12929,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:20"
}