{
  "name": "Haiping Xu",
  "homepage": "http://www.cis.umassd.edu/~hxu",
  "status": "success",
  "content": "Welcome to Dr. Haiping Xu's Home Page Haiping Xu, Ph.D. Professor and Chairperson Dion 302G Computer and Information Science Department University of Massachusetts Dartmouth 285 Old Westport Rd. Dartmouth, MA 02747 Phone : (508) 910-6427 Fax : (508) 999-9144 Email: hxu at umassd.edu Office hours (schedule) (Dion 302G): Tues 10:00-11:30; Thurs 10:00-11:30; Fri 10:30-11:30 Current Students: Fall 2025 Registration Date Director, Concurrent Software Engineering Laboratory New Web! Education Ph.D. Computer Science University of Illinois at Chicago 2003 M.S. Computer Science Wright State University 1998 M.S. Computer Engineering Zhejiang University 1992 B.S. Electrical Engineering Zhejiang University 1989 UMass Dartmouth Home Page College of Engineering Home Page CIS Home Page CIS Faculty and Staff https://orcid.org/0000-0003-1104-1257 Teaching Fall 2025 CIS 560-01 - Theoretical Computer Science (Textbook) Spring 2025 CIS 481-01 - Parallel & Distributed Software Systems (Textbook) Spring 2018 CIS 361-01 - Models of Computaion (Top Jobs) CIS 481-01 - Parallel & Distributed Software Systems Fall 2017 CIS 461-01 - Formal Methods for Software Engineering (Textbook) CIS 461 Demo: Cruise Control, Space Invader Model Checker: LTSA 3.0 CIS 560-01 - Theoretical Computer Science (Textbook) Past Courses CIS 115-01 - Computer Programming with C CIS 181-01 - Object-Oriented Programming II CIS 360-01 - Algorithms and Data Structures CIS 361-01 - Models of Computation CIS 461-01 - Formal Methods for Software Engineering (Top Jobs) CIS 481-01 - Parallel & Distributed Software Systems CIS 560-01 - Theoretical Computer Science (Comprehensive Exam) CIS 563-01 - Multi-Agent Software Systems CIS 582-01 - Advanced Software Engineering (Top 10 Best Jobs) CIS 602-01 - Special Topics in Computer Science: Software Engineering of Distributed Systems (Job Market) (Career Focus) Undergraduate Graduation Check-Off (Download CS-Form, SE-Form) Undergraduate Curriculum Class 2018 (Download CS-Form, SE-Form) Undergraduate Flowchart Class 2018 (Download CS-Form, SE-Form) Click Here for Curriculum Requirements Course Equivalency Guide Click Here for Currently Approved University Studies Curriculum Master's Project/Thesis CIS 600-01 - Master's Project (Download Form1, Form2, Handbook - Update) CIS 690-01 - Master's Thesis (Download Form1, ThesisGuide, SigPage, Forms) Apply for Ph.D. in Engineering and Applied Science (CSIS Option)(Req-Form) Click Here for a List of Graduate Students Supervised Research Interests Software Engineering, Distributed Computing, Formal Methods Text & Data Mining, Semantic Computing, Deep Learning Cybersecurity, Blockchain Technology, Software Reliability Cloud Computing, Cloud Security, Privacy and Reliability Multi-Agent System, Electronic Commerce, Online Auction I am chairing the Ph.D. in Computer Science and Information Systems (CSIS) Committee, Ph.D. in EAS I am also affiliated with the Center for Scientific Computing and Visualization Research (CSCVR) and the Data Science (DSC) Interdisciplinary Program Director, AI and Software Engineering Research (AISER) Laboratory Director, Concurrent Software Engineering Laboratory (Old Web) Click Here for a Detailed Description of My Research Interest Call For Paper: Special Issue on Innovative Protocols, Algorithms, and Applications for Autonomous Sensing and Sensor Networks, Sensors, Submission Deadline: August 25, 2026. Call For Paper: The IEEE International Workshop on Blockchain and Smart Contracts (IEEE BSC 2025)(TXT) ** This workshop adopts a hybrid model allowing either in-person or online remote presentations. Call For Paper: 2025 6th International Artificial Intelligence and Blockchain Conference (AIBC 2025), Submission Deadline: April 20, 2025. Current and Past Projects Ontology-Based Two-Level Semantic Search Engine CS2Notes: Cloud-based Secure Sticky Notes (Version 2.2.1) Secure and Fault-Tolerant Cloud-Based Information Storage Ontology-Based Dynamic Service Discovery & Composition ATM: Agent-Based Trust Management for Trust Re-Evaluation Formal Verification of Dynamic Reliability Block Diagram (DRBD) S-WALL: State-Based XML Firewall for Service-Oriented Systems Building a Travel Reservation System Using BPEL4WS (Slides) RADE: Role-Based Agent Development Environment (An Introduction) A Service-Oriented Peer-to-Peer System for Resource Sharing (Slides) MASEA 1.0: A Multi-Agent System for Electronic Auctions (Slides) OSPS: An Office Supplies Purchasing System Using Web Services ADK 1.0: The Model-Based Agent-Development Kit (A Brief Introduction) CS Web Editor: for automatically updating CS Dept web pages at UIC. Click Here for a List of My Recent Funding and Grant Activities Selected Publications (*: Student Co-author) D. Degbor*, H. Xu, P. Singh*, S. Gibbs*, and D. Yan, \"StradNet: Automated Structural Adaptation for Efficient Deep Neural Network Design,\" To appear in Advances in Science, Technology and Engineering Systems Journal (ASTESJ), 2025. G. Zhou*, H. Xu, H. K. Xu, C. Li, and D. Yan, “A Computational Approach to Improving Fairness in K-means Clustering,” in Proceedings of the 21th International Conference on Data Science (ICDATA’25), Las Vegas, Nevada, USA, July 21-24, 2025. S. Bhat*, H. Xu, and J. Carberry, “Automated Medical Coding Using a Hybrid Decision Tree with Deep Learning Nodes,” In Proceedings of the 11th IEEE International Conference on Big Data Computing Service and Machine Learning Applications (IEEE BigDataService 2025), Tucson, Arizona, USA, July 21-24, 2025, pp. 81-88. DOI: 10.1109/BigDataService65758.2025.00017. J. Carberry* and H. Xu, \"Explainable ICD Code Assignment Using Knowledge-Based Sentence Extraction and Deep Learning,\" International Journal of Semantic Computing (IJSC), 2025, Vol. 19, No. 3, pp. 479-504. DOI: 10.1142/S1793351X25500011. W. Girard*, H. Xu, and D. Yan, “Real-Time Forecasting of Marine Visibility with Self-Adaptive Deep Learning,” In Proceedings of the 4th International Conference on Computing and Machine Intelligence (ICMI 2025), IEEE ICMI 2025, Mt Pleasant, Michigan, USA, April 05-06, 2025, pp. 1-6. DOI: 10.1109/ICMI65310.2025.11141248. J. Carberry*, J. Rahme*, and H. Xu, \"Real-Time Rejuvenation Scheduling for Cloud Systems with Virtualized Software Spares,\" The Journal of Systems & Software (JSS), Vol. 217, November 2024, 112168, pp. 1-15. DOI: 10.1016/j.jss.2024.112168 [JSS ranking] J. Carberry* and H. Xu, \"GPT-Enhanced Hierarchical Deep Learning Model for Automated ICD Coding,\" Advances in Science, Technology and Engineering Systems Journal (ASTESJ), August 2024, Vol. 9, No. 4, pp. 21-34. DOI: 10.25046/aj090404. B. Wetzel* and H. Xu, \"Deploying Trusted and Immutable Predictive Models on a Public Blockchain Network,\"Advances in Science, Technology and Engineering Systems Journal (ASTESJ), June 2024, Vol. 9, No. 3, pp. 72-83. DOI: 10.25046/aj090307. J. Carberry* and H. Xu, “A Hierarchical Fine-Grained Deep Learning Model for Automated Medical Coding,” In Proceedings of the 3rd International Conference on Computing and Machine Intelligence (ICMI 2024), IEEE ICMI 2024, Mt Pleasant, Michigan, USA, April 13-14, 2024, pp. 1-6. DOI: 10.1109/ICMI60790.2024.10585710 W. Girard*, H. Xu and D. Yan, “Real-Time Evolving Deep Learning Models for Predicting Hydropower Generation,”In Proceedings of the 3rd International Conference on Computing and Machine Intelligence (ICMI 2024), IEEE ICMI 2024, Mt Pleasant, Michigan, USA, April 13-14, 2024, pp. 1-6. DOI: 10.1109/ICMI60790.2024.10585701 M. Felipe* and H. Xu, \"HistoChain: Improving Consortium Blockchain Scalability Using Historical Blockchains,\" Advances in Science, Technology and Engineering Systems Journal (ASTESJ), June 2023, Vol. 8, No. 3, pp. 89-99. DOI: 10.25046/aj080311 M. Felipe* and H. Xu, “A Scalable Storage Scheme for On-Chain Big Data Using Historical Blockchains,”In 2022 IEEE 22nd International Conference on Software Quality, Reliability and Security Companion (QRS-C), IEEE BSC 2022, Guangzhou, China, December 5-9, 2022, pp. 54-61. DOI: 10.1109/QRS-C57518.2022.00017 H. Xu, R. Wei*, R. DeGroof*, and J. Carberry*, \"Evaluating Online Products Using Text Mining: A Reliable Evidence-Based Approach,\" International Journal of Semantic Computing (IJSC), December 2022, Vol. 16, No. 4, pp. 585-611. DOI: 10.1142/S1793351X22500064 J. Carberry* and H. Xu, \"Fine-Grained ICD Code Assignment Using Ontology-Based Classification,\" In Proceedings of the 23rd IEEE International Conference on Information Reuse and Integration (IEEE IRI'22), August 9-11, 2022, pp. 228-233. DOI: 10.1109/IRI54793.2022.00058 A. Thamrin*, H. Xu, and R. Ming*, \"Cloud-Based Hierarchical Consortium Blockchain Networks for Timely Publication and Efficient Retrieval of Electronic Health Records,\" Advances in Science, Technology and Engineering Systems Journal (ASTESJ), April 2022, Vol. 7, No. 2, pp. 179-190. DOI: 10.25046/aj070218 A. Thamrin* and H. Xu, \"Hierarchical Cloud-Based Consortium Blockchains for Healthcare Data Storage,\" In 2021 IEEE 21st International Conference on Software Quality, Reliability and Security Companion (QRS-C), IEEE BSC 2021, Hainan Island, China, December 6-10, 2021, pp. 644-651. DOI: 10.1109/QRS-C55045.2021.00098 A. Thamrin* and H. Xu, \"Cloud-Based Blockchains for Secure and Reliable Big Data Storage Service in Healthcare Systems,\" In Proceedings of the 15th IEEE International Conference on Service-Oriented System Engineering (IEEE SOSE 2021), Oxford Brookes University, UK, August 23-26, 2021, pp. 81-89. DOI: 10.1109/SOSE52839.2021.00015 R. Ming*, H. Xu, S. E. Gibbs*, D. Yan, and M. Shao, \"A Deep Neural Network Based Approach to Building Budget-Constrained Models for Big Data Analysis,\" In Proceedings of the 17th International Conference on Data Science (ICDATA'21), Las Vegas, Nevada, USA, July 26-29, 2021, pp. 1-8. J. Rivera* and H. Xu, \"An Educational Tool for Exploring the Pumping Lemma Property for Regular Languages,\" In H. R. Arabnia, L. Deligiannidis et al. (Eds.), Advances in Soft",
  "content_length": 25136,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:25"
}