{
  "name": "Haipeng Cai",
  "homepage": "https://chapering.github.io",
  "status": "success",
  "content": "About Me Haipeng CaiAssociate Professor Follow Buffalo, NY Email ResearchGate Twitter LinkedIn Bitbucket Github Google Scholar ORCIDPersonal BlogSourceForge RepoDBLPSemanticScholarFollow @chaperingAbout MeHome - Haipeng Cai I am a tenured Associate Professor in the Department of Computer Science and Engineering (CSE) at University at Buffalo, The State University of New York (SUNY). Before that, I was an Assistant Professor (2016-2022) and then Associate Professor with tenure (2022-2024) in the School of Electrical Engineering and Computer Science (EECS) at Washington State University, Pullman. I was advised by Dr. Barbara Ryder and Dr. Daphne Yao during my postdoc and by Dr. Douglas Thain and Dr. Raul Santelices for my PhD study. My research generally lies in software engineering and software security, with a current focus on program analysis and machine/deep learning for security applications to multilingual software, distributed systems, and mobile apps. The main goal of my research is to develop practically scalable and cost-effective techniques and tools that improve the productivity of software developers and the quality of large-scale, complex real-world software systems. Office hours: Thursday 3:00pm-4:00pm Meeting ID with Zoom: https://buffalo.zoom.us/my/hcaiub Recent News [2025/11] Congratulations to Haoran for successfully passing his PhD dissertation defense and is on the academic job market![2025/10] Yu is on the academic job market![2025/10] Our work on vulnerability data generation will appear at ICSE'26.[2025/10] Recognized with a Distinguished Reviewer Award for ASE'25.[2025/08] Congrats to Yu for winning a USENIX Security'25 travel grant![2025/06] Our work on JavaScript library version detection will appear at ICSE'26.[2025/06] Recognized with a Distinguished Reviewer Award for ISSTA'25.[2025/05] Recognized with a Distinguished Reviewer Award for FSE'25.[2025/04] Our work on sustainable malware detection received the 2025 (inaugural) TOSEM Outstanding Paper (TOP) Award.[2025/04] Congrats to Haoran for winning a SIGSOFT travel grant for FSE'25![2025/04] Congrats to Jiawei for winning a SIGSOFT travel grant for ISSTA'25![2025/04] Congrats to Yu for winning an S&P'25 travel grant![2025/04] Our work on software release documentation was accepted to ISSTA'25, Congrats to Jiawei and Haoran![2025/03] Our work on security/privacy via functionality variations in mobile apps was accepted to S&P'25, Congrats to all especially Jiawei and Yu![2025/02] Recognized with a Distinguished Reviewer Award for NDSS'25.[2025/01] Our work on interprocedural zero-day vulnerability patching was accepted to USENIX Security'25, Congrats to all especially Yu and Haoran![2025/01] Our work on understanding real-world cross-language bugs was accepted to FSE'25, Congrats to Haoran![2024/08] Our group has moved to the CSE department at University at Buffalo, SUNY (UB).[2024/08] Wen has officially graduated with his PhD and joined CS@Utah State as a tenure-track assistant professor; Congratulations![2024/07] Our work on Open API security and privacy was accepted to CCS'24, Congrats to all especially Song and Long![2024/04] Our work on learning-based multilingual bug detection was accepted to FSE'24, Congrats to all especially Haoran and Yu![2024/04] Our work on fuzzing smart contracts on GPUs was accepted to S&P'24, Congrats to all especially Weimin and Xiapu![2024/04] Recognized as a Distinguished Reviewer for TSE'24.[2024/04] Congrats to Yu for winning the Best RA Award from EECS for the year of 2024![2024/03] Recognized with a Distinguished Reviewer Award for NDSS'24.[2024/02] Our work on Alexa Skills privacy was accepted to WWW'24, Congrats to all especially Song and Long![2023/11] Our work on Android overlay attack was accepted to NDSS'24, Congrats to all especially Hao and Xiapu![2023/10] VGX was accepted to ICSE'24, Congrats to Yu and all! VGX achieves a step forward in large-scale, high-quality vulnerability data generation.[2023/09] Wen is on the job market![2023/08] PyRTFuzz was accepted to CCS'23, Congrats to Wen and Haoran! PyRTFuzz discovered 61 new bugs in both the Python interpreter and the runtime libraries of the Python language.[2023/05] Our work on static analysis of voice applications was accepted to CCS'23, Congrats to all especially Song and Long![2023/04] Congrats to Wen for winning the Best RA Award from EECS for the year of 2023![2023/01] Thank Open Technology Fund (OTF) for supporting our work on security/privacy in Internet access via mobile apps![2022/12] VulGen was accepted to ICSE'23, Congrats to Yu and all! VulGen takes a first step in realistic vulnerability dataset generation.[2022/12] Our study on multilingual software development was accepted to ICSE'23, Congrats to Haoran and Weile![2022/09] PolyFuzz was accepted to USENIX Security'23, Congrats to Wen and others! PolyFuzz revealed another batch of critical cross-language vulnerabilities with 5 unique CVEs assigned.[2022/09] Our study on open science in software vulnerability analysis was accepted to TSE'22, Congrats to Yu and Rainy![2022/07] Our work on Android framework security was accepted to CCS'22, Congrats to all especially Hao and Xiapu![2022/07] Our work on Android app native code analysis received an ACM SIGSOFT Distinguished Paper Award at ISSTA'22, Congrats to all especially Hao and Xiapu![2022/06] Our work on characterizing vulnerability proneness of multilingual code was accepted to FSE'22, Congrats to Wen![2022/06] Our study on generating realistic vulnerability datasets was accepted to FSE'22, Congrats to Yu and all![2022/05] Congratulations to Xiaoqin for successfully passing his PhD dissertation defense and becoming Dr. Fu! The first PhD minted from our lab.[2022/04] Humbled to receive the Junior Faculty Research Award from the Voliland College of Engineering and Architecture and EECS Early Career Award from the School of EECS; grateful to great colleagues, students, and mentors for their support![2022/02] PolyCruise was accepted to USENIX Security'22, Congrats to Wen! PolyCruise enabled the discovery of the first batch of high-severity cross-language security vulnerabilities with 8 unique CVEs assigned.[2022/02] Thank ONR for supporting our work on autonomic defense of information flow security in distributed and adversarial environments![2022/01] Xiaoqin is on the job market![2021/12] Thank NSF for supporting our work on multilingual program analysis![2021/04] FlowDist accepted to USENIX Security'21, Congrats to Xiaoqin![2020/12] Thank ARO for supporting our work on generating realistic datasets for software vulnerability analysis![2020/07] Seads was accepted to TOSEM'20, Congrats to Xiaoqin! This is our first work towards self-adaptive dynamic analysis in the application to dependence analysis of distributed systems.[2020/05] Recognized with a Distinguished Reviewer Award for TOSEM'20.[2019/06] Thank NSF for supporting our work on dynamic program analysis of distributed software systems!",
  "content_length": 7008,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:23"
}