{
  "name": "Haiping Lu",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/haiping-lu",
  "status": "success",
  "content": "Professor Haiping Lu | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Haiping Lu School of Computer Science Professor of Machine Learning Director of the UK Open Multimodal AI Network Head of AI Research Engineering Member of the Machine Learning research group Open staff member portrait in a modal window h.lu@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Haiping Lu School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-0349-2181 Google Scholar Personal website Profile Professor Lu is the Head of AI Research Engineering at the Centre for Machine Intelligence and Turing Academic Lead at the University of Sheffield. He is also the Director of the UK Open Multimodal AI Network (UKOMAIN), funded by the EPSRC and building on the Meta-Learning for Multimodal Data interest group at the Alan Turing Institute. He received his BEng and MEng from Nanyang Technological University, Singapore, in 2001 and 2004 respectively, and his PhD in Electrical and Computer Engineering from the University of Toronto in 2008. His awards include a Turing Network Development Award, an Amazon Research Award, and joint Wellcome Trust Innovator and NIHR AI in Health and Care awards.For more details, including requirements for PhD enquiries, and to explore selected projects, team profiles and research outputs, please visit https://haipinglu.github.io/ Research interests Professor Lu’s research focuses on advancing translational multimodal AI technologies to address challenges in healthcare and scientific discovery. His work in multimodal AI explores foundational models, generative AI, domain adaptation and transfer learning. In healthcare, his research includes brain and cardiac imaging, with a growing focus on cancer diagnosis and treatment. In scientific discovery, he investigates applications in protein engineering and drug and materials discovery. Professor Lu also leads the development of the open-source software library PyKale, part of the PyTorch ecosystem, which facilitates accessible machine learning for interdisciplinary research. Publications Books Lu H, Plataniotis KN & Venetsanopoulos A () Multilinear Subspace Learning. Chapman and Hall/CRC. Journal articles Zhou S, Luo J, Jiang Y, Wang H, Lu H & Gong G (2025) Group-specific discriminant analysis enhances detection of sex differences in brain functional network lateralization. Gigascience, 14. View this article in WRRO Liu X, Rastegari S, Huang Y, Cheong SC, Liu W, Zhao W, Tian Q, Wang H, Guo Y, Zhou S , Tabakhi S et al (2025) Interpretable multimodal learning for tumor protein-metal binding: Progress, challenges, and perspectives. Methods, 242, 97-112. Bai P, Miljković F, Liu X, De Maria L, Croasdale-Wood R, Rackham O & Lu H (2025) Mask-prior-guided denoising diffusion improves inverse protein folding. Nature Machine Intelligence, 7(6), 876-888. View this article in WRRO Kariotis S, Tan PF, Lu H, Rhodes CJ, Wilkins MR, Lawrie A & Wang D (2024) Omada: robust clustering of transcriptomes through multiple testing. GigaScience, 13(2024). View this article in WRRO Allen L, Lu H & Cordiner J (2024) Knowledge-enhanced spatiotemporal analysis for anomaly detection in process manufacturing. Computers in Industry, 161. View this article in WRRO Tripathi P, Suvon M, Schobs L, Zhou S, Alabed S, Swift A & Lu H (2023) Tensor-based multimodal learning for prediction of pulmonary arterial wedge pressure from cardiac MRI. Medical Image Computing and Computer Assisted Intervention – MICCAI 2023: 26th International Conference, Vancouver, October 8-12, 2023, Proceedings, 14226. View this article in WRRO Ge Y, Ma J, Zhang L, Li X & Lu H (2023) Trustworthiness-aware knowledge graph representation for recommendation. Knowledge-Based Systems, 278. View this article in WRRO Alabed S, Garg P, Alandejani F, Dwivedi K, Maiter A, Karunasaagarar K, Rajaram S, Hill C, Thomas S, Gossling R , Sharkey MJ et al (2023) Establishing minimally important differences for cardiac MRI end-points in pulmonary arterial hypertension. European Respiratory Journal, 62(2). View this article in WRRO Liu X, Zhou S, Lei T, Jiang P, Chen Z & Lu H (2023) First-person video domain adaptation with multi-scene cross-site datasets and attention-based methods. IEEE Transactions on Circuits and Systems for Video Technology, 33(12), 7774-7788. View this article in WRRO Tabakhi S, Suvon MNI, Ahadian P & Lu H (2023) Multimodal learning for multi-omics: a survey. World Scientific Annual Review of Artificial Intelligence, 1. View this article in WRRO Bai P, Miljković F, John B & Lu H (2023) Interpretable bilinear attention network with domain adaptation improves drug-target prediction. Nature Machine Intelligence, 5(2), 126-136. View this article in WRRO Xu H, Sang S, Bai P, Li R, Yang L & Lu H (2023) GripNet: Graph information propagation on supergraph for heterogeneous graphs. Pattern Recognition, 133. Kunda M, Zhou S, Gong G & Lu H (2022) Improving multi-site autism classification via site-dependence minimization and second-order functional connectivity. IEEE Transactions on Medical Imaging. Alabed S, Alandejani F, Dwivedi K, Karunasaagarar K, Sharkey M, Garg P, de Koning PJH, Tóth A, Shahin Y, Johns C , Mamalakis M et al (2022) Validation of Artificial Intelligence Cardiac MRI Measurements: Relationship to Heart Catheterization and Mortality Prediction. Radiology, 304(3), E56-E56. Alabed S, Maiter A, Salehi M, Mahmood A, Daniel S, Jenkins S, Goodlad M, Sharkey M, Mamalakis M, Rakocevic V , Dwivedi K et al (2022) Quality of reporting in AI cardiac MRI segmentation studies – a systematic review and recommendations for future studies. Frontiers in Cardiovascular Medicine, 9. View this article in WRRO Alabed S, Alandejani F, Dwivedi K, Karunasaagarar K, Sharkey M, Garg P, de Koning PJH, Tóth A, Shahin Y, Johns C , Mamalakis M et al (2022) Validation of artificial intelligence cardiac MRI measurements: relationship to heart catheterization and mortality prediction. Radiology, 305(1). View this article in WRRO Alabed S, Uthoff J, Zhou S, Garg P, Dwivedi K, Alandejani F, Gosling R, Schobs L, Brook M, Capener D , Johns C et al (2022) Machine learning cardiac-MRI features predict mortality in newly diagnosed pulmonary arterial hypertension. European Heart Journal - Digital Health, 3(2), 265-275. View this article in WRRO Alandejani F, Alabed S, Garg P, Goh ZM, Karunasaagarar K, Sharkey M, Salehi M, Aldabbagh Z, Dwivedi K, Mamalakis M , Metherall P et al (2022) Training and clinical testing of artificial intelligence derived right atrial cardiovascular magnetic resonance measurements. Journal of Cardiovascular Magnetic Resonance, 24(1). View this article in WRRO Zhang L, Song H, Aletras N & Lu H (2022) Node-feature convolution for graph convolutional networks. Pattern Recognition, 128. Song L, Zhou S & Lu H (2022) Direct ICA on data tensor via random matrix modeling. Signal Processing, 196. Dwivedi K, Condliffe R, Sharkey M, Lewis R, Alabed S, Rajaram S, Hill C, Saunders L, Metherall P, Alandejani F , Alkhanfar D et al (2022) Computed tomography lung parenchymal descriptions in routine radiological reporting have diagnostic and prognostic utility in patients with idiopathic pulmonary arterial hypertension and pulmonary hypertension associated with lung disease. ERJ Open Research, 8(1). View this article in WRRO Alabed S, Karunasaagarar K, Alandejani F, Garg P, Uthoff J, Metherall P, Sharkey M, Lu H, Wild JM, Kiely DG , Van Der Geest RJ et al (2021) Fully automated CMR derived stroke volume correlates with right heart catheter measurements in patients with suspected pulmonary hypertension. European Heart Journal - Cardiovascular Imaging, 22(Supplement_2). Alabed S, Karunasaagarar K, Alandejani F, Garg P, Uthoff J, Metherall P, Sharkey M, Lu H, Wild JM, Kiely DG , Van Der Geest RJ et al (2021) High interstudy repeatability of automatic deep learnt biventricular CMR measurements. European Heart Journal - Cardiovascular Imaging, 22(Supplement_2). Xu H, Sang S, Yao H, Herghelegiu AI, Lu H, Yurkovich JT & Yang L (2021) APRILE: Exploring the Molecular Mechanisms of Drug Side Effects with Explainable Graph Neural Networks. Zhou Y, Lu H & Cheung Y-M (2021) Probabilistic rank-one tensor analysis with concurrent regularizations. IEEE Transactions on Cybernetics, 51(7), 3496-3509. View this article in WRRO Dwivedi K, Sharkey M, Condliffe R, Uthoff JM, Alabed S, Metherall P, Lu H, Wild JM, Hoffman EA, Swift AJ & Kiely DG (2021) Pulmonary hypertension in association with lung disease : quantitative CT and artificial intelligence to the rescue? State-of-the-art review. Diagnostics, 11(4). Ge Y, Peng P & Lu H (2021) Mixed-order spectral clustering for complex networks. Pattern Recognition, 117. Swift AJ, Lu H, Uthoff J, Garg P, Cogliano M, Taylor J, Metherall P, Zhou S, Johns CS, Alabed S , Condliffe RA et al (2021) A machine learning cardiac magnetic resonance approach to extract disease features and automate pulmonary arterial hypertension diagnosis. European Heart Journal - Cardiovascular Imaging, 22(2), 236-245. View this article in WRRO Schirmer MD, Venkataraman A, Rekik I, Kim M, Mostofsky SH, Nebel MB, Rosch K, Seymour K, Crocetti D, Irzan H , Hütel M et al (2021) Neuropsychiatric disease classification using functional connectomics - results of the connectomics in neuroImaging transfer learning challenge. Medical Image Analysis, 70. Shi Q, Cheung Y-M, Zhao Q & Lu H (2019) Feature extraction for incomplete data via low-rank tensor decomposition with feature regularization. IEEE Transactions on Neural Networks and Learning Systems, 30(6), 1803-1817. View this article in WRRO Bai P, Ge Y, Liu F & Lu H (2019) Joint interaction with context operation for collaborative filtering. Pattern Recognition, 88, 729-738. View this article in WRRO Zhou S, Li W, Cox CR & Lu H (2019) Do",
  "content_length": 32886,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:26"
}