{
  "name": "Hairong Qi 0001",
  "homepage": "https://eecs.utk.edu/people/hairong-qi",
  "status": "success",
  "content": "Hairong Qi | Min H. Kao Department of Electrical Engineering and Computer Science Skip to content Skip to main navigation Report an accessibility issue Hairong Qi Gonzalez Family Professor Contact Biography Research Contact Information Office Address: Min H. Kao Building, Room 304Phone: 865-974-8527Fax: 865-974-5483E-mail: hqi@utk.eduPersonal WebsiteEducation PhD in Computer Engineering, North Carolina State University, Raleigh, NC, 1999 MS in Computer Science, Northern JiaoTong University, Beijing, China, 1995 BS in Computer Science, Northern JiaoTong University, Beijing, China, 1992 Biography Hairong Qi received her B.S. and M.S. degrees in computer science from Northern JiaoTong University, Beijing, China in 1992 and 1995, respectively, and her Ph.D. degree in computer engineering from North Carolina State University, Raleigh, in 1999. She is currently the Gonzalez Family Professor with the Min H. Kao Department of Electrical Engineering and Computer Science at the University of Tennessee, Knoxville. Her research interests are in advanced imaging and collaborative processing, hyperspectral image analysis, computer vision and machine learning. Dr. Qi's research is supported by National Science Foundation, DARPA, IARPA, Office of Naval Research, NASA, Department of Homeland Security, etc. Dr. Qi is the recipient of the NSF CAREER Award. She also received the Best Paper Awards at the 18th International Conference on Pattern Recognition (ICPR’06), the 3rd ACM/IEEE International Conference on Distributed Smart Cameras (ICDSC’09), and IEEE Workshop on Hyperspectral Image and Signal Processing: Evolution in Remote Sensor (WHISPERS’15). She was awarded the Highest Impact Paper from the IEEE Geoscience and Remote Sensing Society in 2012. Dr. Qi has published over 200 technical papers in archival journals and refereed conference proceedings, including two co-authored books with Dr. Wesley Snyder in Computer Vision. Dr. Qi is an IEEE Fellow. Research Image Processing, Computer Vision and Machine Learning Collaborative Information Processing in Sensor Networks Google Scholar The flagship campus of the University of Tennessee System and partner in the Tennessee Transfer Pathway.",
  "content_length": 2207,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:27"
}