{
  "name": "Haitham Hassanieh",
  "homepage": "http://haitham.ece.illinois.edu",
  "status": "success",
  "content": "Haitham Hassanieh Haitham Hassanieh Assistant Professor, ECE & CS Systems and Networking Research Group University of Illinois at Urbana Champaign 463 Coordinated Science Laboratory 1308 W Main Street, Urbana, IL 61801 Email: haitham@illinois.edu HOME PUBLICATIONS After 6 wonderful years at UIUC, I have moved to EPFL in Switzerland. This webpage is at least 2 year out of date. I will no longer hire students at UIUC. If you wish to work with me, please apply to EPFL. I am an Assistant Professor in the ECE and CS Departments at UIUC. I am interested in wireless networking, IoT and mobile systems, wireless imaging and sensing, and sparse recovery algorithms and applications. I lead the Systems and Networking Research Group at UIUC. Before coming to UIUC, I received my PhD in EECS from MIT. My PhD thesis on the Sparse Fourier Transform won the ACM Doctoral Dissertation Award, 2016, the Sprowls best thesis award at MIT, and TR10 Award for top ten breakthrough technologies in 2012. NEWS Our three papers accepted to NSDI'21: Low Power Spectrum Sensing Using MEMS Acoustic Resonators Wireless Networks on Chip Using Deep Reinforcement Learning Pratical Millimeter Wave Null Steering My students awarded the Qualcomm Innovation Fellowship. Chect out our work on Through Fog High Resolution Radar Imaging for Self-Driving Cars at CVPR'20. Our work: Biomolecular Communication for Microimplants & Teeth User Interface accepted to MobiCom'20. Honored to be awarded the 2019 Alfred Sloan Foundation Fellowship. Thanks to Google for 2018 Google Faculty Research Award. Check out Many-to-Many mmWave Beam Alignment at NSDI'19. Check out Detecting Hidden Eavesdroppers at MobiCom'18. Check out Millimeter Wave Beam Alignment and Acoustic Noise Cancellation over IoT at SIGCOMM'18. Awarded the NSF Career Award for Millimeter Wave Networks project. Check out Inaudible Voice Attacks at NSDI'18 and Wireless Liquid Identifier at MobiSys'18. BackDoor wins the MobiSys'17 Best Paper Award I won the ACM Doctoral Dissertation Award, 2016. My PhD thesis won the Sprowls award for best thesis in computer science at MIT. TEACHING CS/ECE 439: Wireless Networks.[Spring 2021] ECE 598HH: Advanced Wireless Networks & Sensing Systems. [Fall 2020], [Spring 2018], [Fall 2016] CS/ECE 438: Computer Networks. [Fall 2019], [Fall 2017] CS/ECE 374: Algorithms & Models of Computation. [Spring 2020], [Spring 2019] ECE 463: IoT & Software Defined Radio Lab. [Fall 2018] Wireless Communications: From 5G and WiFi 6 to Low Power IoT Communication [Summer 2020] AWARDS & HONORS Alfred Sloan Fellowship (2019) Google Faculty Research Award (2018) NSF Career Award (2018) Faculty Ranked Excellent by Their Students (Spring 2018, Fall 2018, Fall 2020) ACM SIGMOBILE Research Highlights (2017) ACM MobiSys Best Paper Award (2017) ACM Doctoral Dissertation Award (2016) George Sprowls Award for Best PhD Thesis in Computer Science at MIT (2016) SciTech Best Graduate Student Award (2013) TR10: Technology Review's 10 Breakthrough Technologies (2012) ACM SIGCOMM Best Paper Award (2011) PAPERS THESES CODE TALKS PAPERS Efficient Wideband Spectrum Sensing Using MEMS Acoustic Resonators Junfeng Guan, Jitian Zhang, Ruochen Lu, Seo Hyungjoo, Jin Zhou, Songbin Gong, Haitham Hassanieh NSDI'21, USENIX Symposium on Networked Systems Design and Implementation, April 2021 [PAPER] One Protocol to Rule Them All: Deep Reinforcement Learning for Wireless Network-on-Chip Suraj Jog, Zikun Liu, Antonio Franques, Vimuth Fernando, Sergi Abadal, Josep Torrellas, Haitham Hassanieh NSDI'21, USENIX Symposium on Networked Systems Design and Implementation, April 2021 [PAPER] Practical Null Steering in Millimeter Wave Networks Sohrab Madani, Suraj Jog, Jesus O. Lacruz, Joerg Widmer, Haitham Hassanieh NSDI'21, USENIX Symposium on Networked Systems Design and Implementation, April 2021 [PAPER] Accelerating Mobile Applications With Parallel High-bandwidth and Low-latency Channels William Sentosa, Balakrishnan Chandrasekaran, P. Brighten Godfrey, Haitham Hassanieh, Bruce Maggs, and Ankit Singla HotMobile'21, 22nd International Workshop on Mobile Computing Systems and Applications, February 2021 [PAPER] Through Fog High Resolution Imaging Using Millimeter Wave Radar Junfeng Guan, Sohrab Madani, Suraj Jog, Saurabh Gupta, Haitham Hassanieh CVPR'20, IEEE/CVF Conference on Computer Vision and Pattern Recognition, June 2020 [PAPER] [SLIDES] [Website] Understanding and Embracing the Complexities of the Molecular Communication Channel in Liquids Jiaming Wang, Dongyin Hu, Chirag Shetty, Haitham Hassanieh MOBICOM'20, ACM International Conference on Mobile Computing and Networking, September 2020 [PAPER] EarSense: Earphones as a Teeth Activity Sensor Jay Prakash, Zhijian Yang, Yu-Lin Wei, Haitham Hassanieh, Romit Roy Choudhury MOBICOM'20, ACM International Conference on Mobile Computing and Networking, September 2020 [PAPER] Many-to-Many Beam Alignment in Millimeter Wave Networks Suraj Jog, Jiaming Wang, Junfeng Guan, Thomas Moon, Haitham Hassanieh, Romit Roy Choudhury NSDI'19, USENIX Symposium on Networked Systems Design and Implementation, February 2019 [PAPER] [SLIDES] Online Millimeter Wave Phased Array Calibration Based on Channel State Information Thomas Moon, Junfeng Guan, and Haitham Hassanieh VTS'19, IEEE VLSI Testing Symposium, April 2019 Ghostbuster: Detecting the Presence of Hidden Eavesdroppers Anadi Chaman, Jiaming Wang, Jiachen Sun, Haitham Hassanieh, Romit Roy Choudhury MOBICOM'18, ACM International Conference on Mobile Computing and Networking, October 2018 [PAPER] [SLIDES] MUTE: Bringing IoT to Noise Cancellation Sheng Shen, Nirupam Roy, Junfeng Guan, Haitham Hassanieh, Romit Roy Choudhury SIGCOMM'18, ACM Special Interest Group on Data Communication August 2018 [PAPER] [SLIDES] Fast Millimeter Wave Beam Alignment Haitham Hassanieh, Omid Abari, Michael Rodriguez, Mohammed Abdelghany, Dina Katabi, Piotr Indyk SIGCOMM'18, ACM Special Interest Group on Data Communication August 2018 [PAPER] [SLIDES] RF Filters with Periodic Passbands for Sparse Fourier Transform-Based Spectrum Sensing Ruochen Lu, Tomas Manzaneque, Yansong Yang, Jin Zhou, Haitham Hassanieh, Songbin Gong JMEMS'18, Journal of Microelectromechanical Systems, 2018 [PAPER] LiquID: A Wireless Liquid IDentifier Ashutosh Dhekne, Mahanth Gowda, Yixuan Zhao, Haitham Hassanieh, Romit Roy Choudhury MobiSys'18, ACM Conference on Mobile Systems Applications, and Services, June 2018 [PAPER] [SLIDES] An RF Comb Filters for Sparse Fourier Transform-based Spectrum Sensing Ruochen Lu, Tomas Manzaneque, Yansong Yang, Jin Zhou, Haitham Hassanieh, Songbin Gong IUS'18, IEEE International Ultrasonic Symposium, October 2018 Inaudible Voice Commands: The Long-Range Attack and Defense Nirupam Roy, Sheng Shen, Haitham Hassanieh, Romit Roy Choudhury NSDI'18, USENIX Symposium on Networked Systems Design and Implementation, April 2018 [PAPER] [SLIDES] BackDoor: Making Microphones Hear Inaudible Sounds Nirupam Roy, Haitham Hassanieh, Romit Roy Choudhury MobiSys'17, ACM Conference on Mobile Systems Applications, and Services, June 2017 [PAPER] [SLIDES] [DEMO] BEST PAPER AWARD Millimeter Wave Communications: from Point-to-Point Links to Agile Network Connections, Omid Abari (Co-primary), Haitham Hassanieh (Co-primary), Michael Rodriguez, and Dina Katabi HotNets'16, ACM Workshop on Hot Topics in Network, November 2016 [PAPER] [SLIDES] Poster: A Millimeter Wave Software Defined Radio Platform with Phased Arrays, Omid Abari, Haitham Hassanieh, Michael Rodriguez, and Dina Katabi MOBICOM'16, ACM International Conference on Mobile Computing and Networking, October 2016 [PAPER] [POSTER] Securing RFIDs by Randomizing the Modulation and Channel, Haitham Hassanieh, Jue Wang, Dina Katabi, and Tadayoshi Kohno NSDI'15, USENIX Symposium on Networked Systems Design and Implementation, May 2015 [PAPER] [SLIDES] A Wireless Charging Infrastructure for Future Electrical Vehicular Adhoc Networks, Mohamad Watfa, S. Miniaoui, Haitham Al Hassaneih, and Samir Selman Journal of Networks, Volume: 10, No: 9, Page(s): 487-500, 2015 Fast Multi-dimensional NMR Acquisition and Processing Using the Sparse FFT, Haitham Hassanieh, Maxim Mayzel, Lixin Shi, Dina Katabi, and Vladislav Yu Orekhov Journal of Biomolecular NMR, Springer, 2015 [PAPER] Light Field Reconstruction Using Sparsity in the Continuous Fourier Domain Lixin Shi, Haitham Hassanieh, Abe Davis, Dina Katabi and Fredo Durand SIGGRAPH'15, ACM Transactions on Graphics Volume: 34, No: 1, November 2014 [PAPER] [WEBSITE] High-Throughput Implementation of a Million-Point Sparse Fourier Transform Abhinav Agarwal, Haitham Hassanieh, Omid Abari, Ezz Hamed, Dina Katabi, and Arvind FPL'14, International Conference on Field Programmable Logic and Applications, September 2014 [PAPER] D-BigBand: Sensing GHz-Wide Non-Sparse Spectrum on Commodity Radios Lixin Shi, Haitham Hassanieh and Dina Katabi MOBICOM'14 S3, 6th Annual Workshop on Wireless of the Students, by the Students, for the Students, September 2014 GHz-Wide Sensing and Decoding Using the Sparse Fourier Transform Haitham Hassanieh, Lixin Shi, Omid Abari, Ezzeldin Hamed, Dina Katabi INFOCOM'14, IEEE International Conference on Computer Communications, Toronto Canada, April 2014 [PAPER] [SLIDES] Correlation Chemical Shift Imaging with Sparse-FFT and Real-time Motion and Shim Correction, Ovidiu Andronesi, Lixin Shi, Haitham Hassanieh, Wolfgang Bogner, Borjan Gagoski, Aaron Hess, Dylan Tisdall, Andre van der Kouwe, Dina Katabi, and Elfar Adalsteinsson. ENC14, 55th Experimental Nuclear Magnetic Resonance Conference, Boston USA,March 2014 [PAPER] [POSTER] A 0.75 Million-Point Fourier Transform Chip for Frequency-Sparse Signals Omid Abari, Ezz Hamed, Haitham Hassanieh, Abhinav Agarwal, Dina Katabi, Anantha Chandrakasan, and Vladimir Stojanovic. ISSCC14, International Solid-State Circuits Conference, San Francisco USA, February 2014 [PAPER] [SLIDES] Sample-Optimal Average-Case Sparse Fourier Transform in Two Dimensions ",
  "content_length": 15239,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:27"
}