{
  "name": "Haiyan Hu",
  "homepage": "http://www.cs.ucf.edu/~haihu",
  "status": "success",
  "content": "Haiyan (Nancy) Hu Professor, Computer Science University of Central Florida Office: HEC-233 Phone: 407-882-0134 Email: haihu at cs.ucf.edu Mail: UCF, 4000 Central Florida Blvd, Harris Engineering Center, Bldg. 116, Room 233, Orlando, Fl. 32816-2005 Lab Site ____________________________________________________________________________________________ Research Interests · Bioinformatics and Computational Biology ·        Machine Learning and Artificial Intelligence: Models and Applications in Biomedical Data Integration and Analysis · <<<Graduate and Undergraduate Research Assisant Positions are available in areas including data mining, machine learning, pattern recognition, modeling and simulation, bioinformatics and computational biology. For interested students, please read here>>> Teaching · CAP5510 Introduction to Bioinformatics · CAP 6545 Machine Learning in Bioinformatics · CAP 6938 Advanced Topics in Machine Learning · COT3100H Introduction to Discrete Structures (Honors) · CAP6938 Graphs and Networks in Computational Biology · COT3100 Introduction to Discrete Structures · CAP6938 Data Mining in Bioinformatics · COP 3503 Computer Science II (CS2) Publications ·       Ripan CR, Athaya T, Li X, Hu H. Deep learning inference of miRNA expression from bulk and single-cell mRNA expression, Journal of Bioinformatics and Computational Biology 23 (3), 2550009, 2025. ·       Weston M, Ripan RC, Li X, Hu H. New characteristics of miRNA and isomiR interactions with mRNA, Scientific Reports, https://doi.org/10.1038/s41598-025-21561-x. 2025. ·       Athaya T, Li X, Hu H. A deep learning method to integrate extracellular miRNA with mRNA for cancer studies, Bioinformatics, https://doi.org/10.1093/bioinformatics/btae653. 2024. ·       Weston M, Hu H, Li X. PSPI: A deep learning approach for prokaryotic small protein identification, Frontiers in Genetics, 15, 1439423, https://doi.org/10.3389/fgene.2024.1439423. 2024 ·       Zheng H, Wang S, Li X, Hu H. A computational modeling of pri-miRNA expression, PLOS ONE, https://doi.org/10.1371/journal.pone.0290768. 2024. ·       Beals J, Hu H, Li X. A survey of experimental and computational identification of small proteins, Briefings in Bioinformatics, https://doi.org/10.1093/bib/bbae345. 2024. ·       Athaya T, Ripan CR, Li X, Hu H. Multimodal deep learning approaches for single cell multi-omics data integration, Briefings in Bioinformatics, https://doi.org/10.1093/bib/bbad313. 2023. ·       Ventolero M, Wang, S, Hu H, Li X. Are the predicted known bacterial strains in a smple really present? A case study, Plos one, https://doi.org/10.1371/journal.pone.0291964. 2023. ·       Wang S, Ventolero M, Hu H, Li X. A novel approach for bacterial strain analysis in multiple samples, Journal of Bioinformatics and Systems Biology, https://doi.org/10.26502/jbsb.5107065. 2023. ·       Ventolero M, Wang, S, Hu H, Li X. Computational analyses of bacterial strains from shotgun reads, Briefings in Bioinformatics, https://doi.org/10.1093/bib/bbac013. 2022. ·       Zhang Y, Wang S, Hu H, Li X. A systematic study of HIF1A cofactors in hypoxic cancer cells, Scientific Reports, https://doi.org/10.1038/s41598-022-23060-9. 2022. ·       Ghuathakurta S, Adams L, Jeong I, Sivakumar A, Cha M, Fiadeiro MB, Hu H, Kim Y. Precise epigenomic editing with a SunTag-based modular epigenetic toolkit, Epigenetics, https://doi.org/10.1080/15592294.2022.2106646. 2022. ·       Wang S, Ventolero M, Hu H, Li X. A revisit to universal single-copy genes in bacterial genomes, Scientific Reports, https://doi.org/10.1038/s41598-022-18762-z. 2022. ·       Zheng H, Wang S, Li X, Hu H. INSISTC: Incorporating network structure information for single-cell type classification, Genomics, 114(5), https://doi.org/10.1016/j.ygeno. 2022. ·       Wang S, Zheng H, Choi JS, Lee JK, Li X, Hu H. A systematic evaluation of the computational tools for ligand-receptor-based cell-cell interaction inference, Briefings in Functional Genomics, https://doi.org/10.1093/bfgp/elac019. 2022. ·       Wang S, Hu H, Li X. A systematic study of motif pairs that may facilitate enhancer-promoter interactions, Journal of Integrative Bioinformatics, https://doi.org/10.1515/jib-2021-0038. 2022. ·      Talukder A, Zhang W, Li X, Hu H. A deep learning method for miRNA/IsomiR target detection, Scientific Reports, https://doi.org/10.1038/s41598-022-14890-8. 2022.· · Wang S, Talukder A, Cha M, Li X, Hu H. Computational annotation of miRNA transcription start sites, Briefings in Bioinformatics, https://doi.org/10.1093/bib/bbz178. 2021. ·       Talukder A, Hu H, Li X. An intriguing characteristic of enhancer-promoter interactions, BMC Genomics, https://doi.org/10.1186/s12864-021-07440-5. 2021. · Zheng H, Talukder A, Li X, Hu H. A systematic evaluation of the computational tools for lncRNA identification, Briefings in Bioinformatics, https://doi.org/10.1093/bib/bbab285. 2021. · Cha M, Zheng H, Talukder A, Barham C, Li X, Hu H. A two-stream convolutional neural network for microRNA transcription start site feature integration and identification, Scientific Reports, https://doi.org/10.1038/s41598-021-85173-x. 2021. · Zheng H, Li X, Hu H. Deep learning to identify transcription start sites from CAGE data, IEEE International Conference on Bioinformatics and Biomedicine (BIBM). 2020. · Li X, Hu H, Li X. mixtureS: a novel tool for bacterial strain reconstruction from reads, Bioinformatics, https://doi.org/10.1093/bioinformatics/btaa728. 2020. · Talukder A, Barham C, Li X, Hu H. Interpretation of deep learning in genomics and epigenomics, Briefing in Bioinformatics, https://doi.org/10.1093/bib/bbaa177. 2020. · Talukder A, Li X, Hu H. Position-wise binding preference is important for miRNA target prediction, Bioinformatics, https://doi.org/10.1093/bioinformatics/btaa195. 2020. · Wang S, Hu H, Li X.Shared distal regulatory regions may contribute to the coordinated expression of human ribosomal protein genes, Genomics, https://doi.org/10.1016/j.ygeno.2020.03.028. 2020. · Talukder A, Saadat S, Li X, Hu H. EPIP: A novel approach for condition-specific enhancer-promoter interaction prediction. Bioinformatics, https://doi.org/10.1093/bioinformatics/btz664. 2019. · Li X, Saadat S, Hu H, Li X. BHap: a novel approach for bacterial haplotype reconstruction. Bioinformatics, DOI:10.1093/bioinformatics/btz280. 2019. · Li X, Hu H. Improving miRNA target prediction using CLASH data. in A. Lagana (Ed): microRNA Target Identification, Springer Nature, New York: NY, pp. 75-83. DOI: 10.1007/978-1-4939-9207-2_6. 2019. · Barham C, Cha M, Li X, Hu H, Application of deep learning models to microRNA transcription start site identification. IEEE 7th International Conference on Bioinformatics and Computational Biology (ICBCB), 2019. · Li X, Naser SA, Khaled A, Hu H, Li X. When old metagenomic data meet newly sequenced genomes, a case study. PLoS One, DOI:10.1371/journal.pone.0198773. 2018. · Li X, Ge P, Hu H. FlexSLiM: a novel approach for short linear motif discovery in protein sequences. The 6th International Conference on Bioinformatics and Computational Biology, DOI: 10.1145/3194480.3194501. 2018. · Ding J, Li X, Hu H. CCmiR: a computational approach for competitive and cooperative microRNA binding prediction. Bioinformatics, DOI:10.1093/bioinformatics/btx606. 2018. · Wang Y, Goodison S, Li X, Hu H. Prognostic cancer gene signatures share common regulatory motifs. Scientific Reports, DOI:10.1038/s41598-017-05035-3. 2017. · Zheng Y, Li X, Hu H, Discover the semantic structure of Human reference epigenome by differential latent Dirichlet allocation. IEEE International Conference on Bioinformatics and Biomedicine (BIBM 2017). · Wang Y, Hu H, Li X. rRNAFilter: a fast approach for ribosomal RNA read removal without a reference database. Journal of Computational Biology, DOI: 10.1089/cmb.2016.0113. 2016. · Zhao C, Li X, Hu H. PETModule: a motif module based approach for enhancer target gene prediction. Scientific Reports, DOI: 10.1038/srep30043. 2016. · Wang Y, Hu H, Li X. MBMC: An Effective Markov Chain Approach for Binning Metagenomic Reads from Environmental Shotgun Sequencing Projects. OMICS: A Journal of Integrative Biology, DOI:10.1089/omi.2016.0081. 2016. · Li X, Zheng Y, Hu H, Li X. Integrative analyses shed new light on human ribosomal protein gene regulation. Scientific Reports, DOI: 10.1038/srep28619. 2016. · Ding J, Li X, Hu H. TarPmiR: a new approach for microRNA target site prediction. Bioinformatics. DOI: 10.1093/bioinformatics/btw318. 2016. · Zheng Y, Li X, Hu H. PreDrem: a database of predicted DNA regulatory motifs from 349 human cell and tissue samples. DATABASE - The Journal of Biological Databases and Curation, DOI: 10.1093/database/bav007. 2015. · Wang Y, Hu H, Li X. MBBC: an efficient approach for metagenomic binning based on composition, BMC Bioinformatics, 2015. DOI:10.1186/s12859-015-0473-8 · Ding J, Li X, Hu H. MicroRNA modules prefer to bind weak and unconventional target sites. Bioinformatics, 31 (9): 1366 - 1374. DOI: 10.1093/bioinformatics/btu833. 2015. · Ding J, Dhillon V, Li X, Hu H. Systematic Discovery of Cofactor Motifs from ChIP-seq Data by SIOMICS. Methods. DOI: 10.1016/j.ymeth.2014.08.006. 2015. · Zheng Y, Li X, Hu H. Comprehensive discovery of DNA motifs in 349 human cells and tissues reveals new features of motifs. Nucleic Acids Research. DOI: 10.1093/nar/gku1261. 2014. · Zheng Y, Li X, Hu H. Computational discovery of feature patterns in nucleosomal DNA sequences. Genomics, 104 (2). DOI: 10.1016/j.ygeno.2014.07.002. 2014. · Wang Y, Li X, Hu H. H3K4me2 reliably defines transcription factor binding regions.Genomics. DOI: 10.1016/j.ygeno.2014.02.002, 2014. · Ding J, Hu H, Li X. SIOMICS: a novel approach for systematic identification of motifs in ChIP-seq data, Nucleic Acids Research., 42 (5): e35, DOI: 10.1093/nar/gkt1288, 2014. · Ding J, Hu H, Li X. NIM, A novel computational method for predicting nuclear-encoded chloroplast proteins, Journal of Medical and Bioengi",
  "content_length": 14925,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:27"
}