{
  "name": "Hakan Aydin",
  "homepage": "https://cs.gmu.edu/~aydin",
  "status": "success",
  "content": "Hakan Aydin Hakan Aydın Professor Director, PhD Program Dept. of Computer Science George Mason University Research Interests Sustainable Computing Real-Time Embedded Systems Fault Tolerance Internet-of-Things Cyber-Physical Systems Publications Google Scholar Profile Short Bio: Hakan Aydin is a Professor at the Computer Science Department, George Mason University. He is also the Director of the PhD in Computer Science Program. His research interests include Sustainable Computing, Real-Time Embedded Systems, Fault Tolerance, Internet-of-Things, and Cyber-Physical Systems. He served as the Program Committee Chair (2011) and General Chair (2012) of the IEEE Real-Time/Embedded Technology and Applications Symposium (RTAS), in addition to serving on the program committees of numerous conferences and workshops. In addition, he is serving on the Editorial Board of Journal of Real-Time Systems (Springer). He is a recipient of the NSF CAREER Award, as well as GMU Computer Science Department Teaching Award (twice). He received PhD in Computer Science from the University of Pittsburgh in 2001. PhD Students Vinay Devadas (2011) Dissertation: System-Level Energy Management for Real-Time Systems Baoxian Zhao (2012) Dissertation: Joint Reliability and Energy Management for Real-Time Embedded Systems Bo Zhang (2012) Dissertation: Performance Management for Energy Harvesting Wireless Sensor Networks Co-Advisor: Robert Simon Mohammad Atiqul Haque (2016) Dissertation: Reliability Management Techniques for Energy-Aware Multiprocessor Real-Time Systems Maryam Bandari (2016) Dissertation: Energy Management in Performance Sensitive Wireless Sensor Networks Co-Advisor: Robert Simon Arda Gumusalan (2019) Dissertation: Dynamic Modulation Scaling Enabled Real-Time Transmission Scheduling for Wireless Sensor Networks Co-Advisor: Robert Simon Abhishek Roy (2021) Dissertation: Improving Energy Efficiency and Quality-of-Control Metrics in Reliable Multiprocessor Real-Time Systems Address Engineering Building, Room 5308 Department of Computer Science George Mason University MSN 4A5, 4400 University Drive Fairfax, VA 22030 Phone: (703)-993 3786 Fax: (703)-993 1710 E-mail: aydin at cs dot gmu dot edu",
  "content_length": 2204,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:30"
}