{
  "name": "Hal Abelson",
  "homepage": "http://groups.csail.mit.edu/mac/users/hal/hal.html",
  "status": "success",
  "content": "Hal Abelson Massachusetts Institute of Technology Department of Electrical Engineering and Computer Science Hal Abelson Portrait by Joi Ito Hal Abelson is Class of 1922 Professor of Computer Science and Engineering in the Department of Electrical Engineering and Computer Science at MIT. Hal Abelson MIT Computer Science and Artificial Intelligence Laboratory Room 32G-516, The Stata Center 32 Vassar Street Cambridge, MA 02139 Phone: (617) 253-5856 Fax: (617) 258-8682 Email: hal at MIT dot edu MIT students interested in UROPs and RAs with me should read the memos: Student Research Opportunities with MIT App Inventor App Inventor UROP project ideas for 2025 Stodgy biography for public consumption. Wikipedia entry What I'm doing these days Selected publications Student projects from Deep Learning Practicum, fall 2018 Obligatory baby picture Various: I have had a recurring nightmare in which students all over the world are sitting in front of a box, all viewing the same lecture. This vision is more or less what many assumed would be the case as the digital revolution broadly began to influence higher education. Entrepreneurs would hire the best lecturer that they could find in each subject area, record his or her lectures, and sell the lectures to self-learners and educational institutions. -- Charles Vest, \"Open Content and the Emerging Global Meta-University\", EduCause Review, 2006 My July 2013 report to MIT's president on MIT and the prosecution of Aaron Swartz. Paper on information accountability in CACM, June 08. This link is restricted, and is an example of ACM's refusal to practice open-access publishing. Here's an open link to a prepublication draft. My book Blown to Bits, with Harry Lewis and Ken Ledeen. Student final presentations from my mobile applications course in Spring 2008 and Fall 2008. A blushingly positive review of my keynote award talk at the 2012 ACM SIGCSE conference. Everyone interested in university education should read Edwin Land's 1957 speech Generation of Greatness. An on-line version of Structure and Interpretation of Computer Programs, and also a complete series of video lectures, made in 1986, of Gerry Sussman and me teaching the course. Some old phonograph records Microsoft's first explicit anti-GNU/Linux ad, which appeared in the October 23, 2000, issue of the German language magazine c't. Dr. Who at the Stata Center Accessibility Material on this web page is licensed under a Creative Commons Attribution 4.0 License. Last modified: September 7 2022, 7:56 AM",
  "content_length": 2530,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:32"
}