{
  "name": "Haluk O. Bingol",
  "homepage": "https://www.cmpe.boun.edu.tr/~bingol",
  "status": "success",
  "content": "Haluk O. Bingol Home Page | CmpE WEB Skip to main content Search form Search Log in MAIN MENU Main Menu AboutProspective studentsDepartment InformationDepartment HistoryDistance LearningPeopleFaculty MembersPostdoctoral ResearchersTeaching AssistantsResearch AssistantsList of Academic AdvisorsDepartmental ResponsibilitiesSupport StaffAdvisory BoardStudent PeersUndergraduateRules and RegulationsCurriculumCourse ListComplementary CoursesSummer TrainingSenior ProjectsMinor DegreeDouble Major ProgramUndergraduate StudiesGraduatePhD in Computer EngineeringMS in Computer EngineeringMS in Software Engineering - Non ThesisMS in Software Engineering - With ThesisCmpE MS Course ListCmpE PHD Course ListSWE MS Course ListGuidelines and RegulationsCopyright Policies for Published WorkGraduate StudiesResearchResearch ProjectsArtificial Intelligence Laboratory (AILAB)Computer Architecture and Systems Laboratory (CASLAB)Cognition, Learning and Robotics Laboratory (CoLoRs Lab)Media Laboratory (MEDIALAB)Computer Networks Laboratory (NETLAB)Perceptual Intelligence Laboratory (PILAB)Satellite Networks Research Laboratory (SATLAB)Complex Systems Research Laboratory (SOSLAB)Text Analytics and BioInformatics Laboratory (TABILAB)TETAMResearch in CmpEContact Us Haluk O. Bingol Home Page Me Haluk O. Bingol Home Page Education Experience Work in Turkish Achievements My Research Publications Projects My Teaching Students Courses Offered My Collections Git LaTeX Java Learning Programming Office: ETA 48 Email: bingolboun.edu.tr(link sends e-mail) Phone: +90 212 359 7121 Offical Website: https://www.cmpe.boun.edu.tr/people/haluk.bingol Personal Website: https://www.cmpe.boun.edu.tr/~bingol Research Interests: Complex Systems, Complex Networks, Self organizing systems, Human Brain, Crowd Dynamics, Distance Learning Interactive educational tools: https://www.01pi.com/ Google Scholar Profile Web of Science ResearcherID Profile orcid.org/0000-0001-7320-7545 Research Labs: Complex Systems Research Laboratory (SoSLab) Network Research Lab (NetLab) My collection on corona(covid-19) Contact us Department of Computer Engineering, Boğaziçi University, 34342 Bebek, Istanbul, Turkey Phone: +90 212 359 45 23/24 Fax: +90 212 2872461 Connect with us We're on Social Networks. Follow us & get in touch. Twitter Facebook Feed Youtube About BOUN CmpE You are here:Home » Haluk O. Bingol Home Page",
  "content_length": 2387,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:37"
}