{
  "name": "Hamdi Dibeklioglu",
  "homepage": "http://www.cs.bilkent.edu.tr/~dibeklioglu",
  "status": "success",
  "content": "Homepage | Hamdi DIBEKLIOGLU Quick links: content, navigation, search. Navigation Home About Me Teaching Research Publications Projects Contact Welcome to my website I am an Assistant Professor in the Computer Engineering Department of Bilkent University. I was previously a Postdoctoral Researher at Delft University of Technology, a Visiting Researcher at Carnegie Mellon University, University of Pittsburgh, and Massachusetts Institute of Technology, and a Research Assistant at the University of Amsterdam. My research interests include Affective Computing, Intelligent Human-Computer Interaction, Pattern Recognition, and Computer Vision. News 2025 [Nov'25] Our paper \"Shift-ACT: Test-time Adaptation via Shift-aware Class-specific Dynamic Thresholding for Domain Generalization\" has been accepted for Neurocomputing. [Jul'25] Our paper \"DECEPTIcON: Bridging Gaps in In-the-Wild Deception Research\" has been accepted for IEEE Transactions on Affective Computing. [June'25] Our paper \"AdaPAC: Prototypical Anchored Contrastive Test Time Adaptation for Domain Generalization\" has been accepted for Neurocomputing. [May'25] Our paper \"SATA: Style Agnostic Test time Adaptation for Domain Generalization\" has been accepted for Image and Vision Computing. [May'24] My supervised Senior Design Project group Interalyze has received Sibel Özelçi Best Senior Design Project Award at Bilkent CSFair'25. Congratulations! [May'24] My supervised Senior Design Project group Envisio has received the Marketability Award at Bilkent CSFair'25. Congratulations! [May'25] We organize the 9th Bilkent Summer School on Artificial Intelligence for high school students, between 24-27 June. [Mar'25] Our paper \" Affect and Personality Aided Modeling of Transcribed Speech for Depression Severity Estimation\" has been accepted for IEEE Transactions on Affective Computing. [Feb'25] I serve as an Area Chair for ACM International Conference on Multimodal Interaction 2025. 2024 [Jul'24] I give a lecture titled \"Introduction to Computational Analysis of Human Behavior\" at the Machine Learning Summer School in Ankara (3 July 2024), organized by Science Academy (Turkey), TED University, and METU. [Jun'24] I serve as an Area Chair for IEEE International Conference on Automatic Face and Gesture Recognition 2025. [May'24] My supervised Senior Design Project group Capsule has received the User Experience Award at Bilkent CSFair'24. Congratulations! [May'24] We organize the 8th Bilkent Summer School on Artificial Intelligence for high school students, between 16-19 July. [Jan'24] I have received the Research Incentive Award 2023 of the METU Prof. Dr. Mustafa N. Parlar Education and Research Foundation. see more >>> 2023 [Oct'23] I have been appointed as an Associate Editor for IEEE Transactions on Affective Computing. [Oct'23] I serve as a Program Chair for ACM International Conference on Multimodal Interaction 2024. [Sep'23] Our paper \"Automatic Deceit Detection Through Multimodal Analysis of High-Stake Court Trials\" has been accepted for IEEE Transactions on Affective Computing. [Jul'23] Our paper \"User Feedback-based Online Learning for Intent Classification\" has been accepted for ACM International Conference on Multimodal Interaction 2023. [May'23] I give a keynote talk on \"Facial Expression and Behavior Analysis using Machine Learning\" at Agean Face Recognition Workshop organized by Ege University on 5 May 2023. [May'23] We organize the 7th Bilkent Summer School on Artificial Intelligence for high school students, between 4-7 July. [Mar'23] I have received the Science Academy's Young Scientist Award (BAGEP) 2023. [Jan'23] I serve as an Area Chair for IEEE International Conference on Automatic Face and Gesture Recognition 2023. 2022 [Dec'22] I am among the recipients of the Turkish Academy of Sciences, Outstanding Young Scientists Award (TÜBA-GEBİP) 2022. [Jul'22] My project titled \"Personality-invariant Detection of Deceit Level through Multimodal Analysis of Speech Videos\" has been funded by TUBITAK 1001 program. [Jun'22] We give a one-day course on \"Artificial Intelligence\" at TED Ankara College on 6 June 2022. [May'22] I give a keynote talk on Metaverse at the 25th Congress of Social Psychiatry on 25 May 2022. [May'22] My supervised Senior Design Project group InstaCook has won the Mobile Award at Bilkent CSFair'22. Congratulations! [May'22] We give a one-day course on \"Artificial Intelligence\" at Ankara Lycee of Science Profession on 10 May 2022. [Apr'22] Our paper \"Face Inpainting with Pre-trained Image Transformers\" has been accepted (oral presentation) for the IEEE Conference on Signal Processing and Communications Applications (SIU), 2022. [Mar'22] I serve as an Area Chair for ACM International Conference on Multimodal Interaction 2022. [Mar'22] We organize the 6th Bilkent Summer School on Artificial Intelligence for high school students, between 28-30 June. [Jan'22] I serve as a work group member for the Big Data Project of the Council of Higher Education. 2021 [Jul'21] Our paper \"Assessment of Parkinson's Disease Severity from Videos using Deep Architecture\" has been accepted for IEEE Journal of Biomedical and Health Informatics. [Jun'21] Our paper \"Multi-Label Sentiment Analysis on 100 Languages With Dynamic Weighting for Label Imbalance\" has been accepted for IEEE Transactions on Neural Networks and Learning Systems. [May'21] We give a one-day (online) course on \"Artificial Intelligence\" for the relatives of veterans (organized by Bilkent University & Ministry of Family and Social Services) on 25 May 2022. [May'21] My supervised Senior Design Project group Outletter has won the Innovation Award at Bilkent CSFair'21. Congratulations! [Apr'21] I serve as an Area Chair for ACM International Conference on Multimodal Interaction 2021. [Mar'21] Our paper \"Multimodal Assessment of Apparent Personality Using Feature Attention and Error Consistency Constraint\" has been accepted for Image and Vision Computing. [Feb'21] I serve as a Guest Editor for the Special Issue on \"Multimodal Approaches for Automated Assessment Monitoring, and Treatment of Psychopathology\" in Frontiers in Computer Science, 2021-2022. [Feb'21] We organize the 5th Bilkent Summer School on Artificial Intelligence for high school students, between 27-29 July. 2020 [Jun'20] My supervised Senior Design Project groups LikedIt and DRIvision have won the Innovation and Data Science awards, respectively, at Bilkent CSFair'20. Congratulations! [Apr'20] We organize a Special Issue on \"Behavior and Usability Analysis for Multimodal User Interfaces\" in the Journal on Multimodal User Interfaces. Deadline for paper submission is 24 May 2020. [Feb'20] Our paper \"Facial Feedback for Reinforcement Learning: A Case Study and Offine Analysis Using the TAMER Framework\" has been accepted for Autonomous Agents and Multi-Agent Systems. [Feb'20] I give a seminar on \"Modeling Hereditary and Behavioral Patterns of Facial Expressions\" at the COGS & MMI Joint Departmental Seminar of Informatics Institute, METU, on 26 February 2020. [Feb'20] We organize the 4th Bilkent Summer School on Artificial Intelligence for high school students, between 6-10 July. [Jan'20] We give a one-day course on \"Artificial Intelligence\" at TED Ankara College on 10 January 2020. 2019 [Dec'19] We give a one-day course on \"Artificial Intelligence\" at Ankara Lycee of Science Profession on 25 December 2019. [Oct'19] Our paper \"Attended End-to-end Architecture for Age Estimation from Facial Expression Videos\" has been accepted for IEEE Transactions on Image Processing. [Oct'19] I give a tutorial entitled \"Recent Developments in Deep Face Analysis\" at the 9th International Conference on Image Processing Theory, Tools and Applications (IPTA 2019) on 6 November 2019. [Sep'19] Our paper \"Pose and Expression Robust Age Estimation via 3D Face Reconstruction from a Single Image\" has been accepted for the International Workshop on Human Behavior Understanding (in ICCV Workshops), 2019. [Aug'19] Our paper \"Do Alzheimer's Patients Appear Younger than Their Age? A Study with Automatic Facial Age Estimation\" has been accepted (oral presentation) for the International Conference on Image Processing Theory, Tools and Applications, 2019. [Aug'19] I give a seminar on \"Deep Models for Face Analysis\" at the Vision Cohort of INZVA on 4 August 2019, and at the Data Science Summer School of Sabanci University on 7 September 2019. [Jul'19] We organize the eNTERFACE Summer Workshop on Multimodal Interfaces at Bilkent University between 8 July-2 August 2019. [Jul'19] We organize a Summer School on Artificial Intelligence at Bilkent University for high school students, between 22-26 July. [May'19] My supervised Senior Design Project group WARP has won the Sibel Özelçi Best Senior Design Project Award at Bilkent CSFair'19. Congratulations! [Mar'19] I give a seminar on \"Modeling Hereditary and Behavioral Patterns of Facial Expressions\" at the Spring Seminars of Informatics Institute, METU, on 3 April 2019, and at the AI & Machine Learning Meetup, TOBB ETU, on 8 April 2019. [Mar'19] I give a seminar on \"Computer Vision and Its Practial Applications\" at the AI Meetup, organized by AI and Image Processing Community of Konya Technical University, on 20 March 2019. [Jan'19] We organize a Marathon on Mobile Application Development at Bilkent Cyberpark on 23-24 February 2019. 2018 [Dec'18] I give a seminar on \"Temporal Dynamics of Facial Behavior\" at the Biomedical Engineering Department of Ankara University on 5 December 2018. [Nov'18] Our paper \"Augmentation of virtual agents in real crowd videos\" has been for Signal Image and Video Processing. [Sep'18] Our paper \"Modeling and Synthesis of Kinship Patterns of Facial Expressions\" has been accepted for Image and Vision Computing. [Jul'18] We organize a Summer School on Artificial Intelligence at Bilkent University for high school students. [May'18] My supervised Senior Design Project groups YouTalkWeSign, ProTechKID, and PRO",
  "content_length": 12684,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:35"
}