{
  "name": "Hamed Pirsiavash",
  "homepage": "https://web.cs.ucdavis.edu/~hpirsiav",
  "status": "success",
  "content": "Hamed Pirsiavash Hamed Pirsiavash Associate Professor Department of Computer Science University of California, Davis Office: Kemper Hall 3061 Email: hpirsiav AT ucdavis DOT edu Curriculum Vitae Google Scholar Semantic Scholar I am an associate professor at UC Davis studying computer vision and machine learning. Prior to this, I was an associate professor at UMBC and a postdoctoral research associate with Antonio Torralba at Massachusetts Institute of Technology (MIT). I graduated with a PhD in computer science from the University of California Irvine where I was advised by Deva Ramanan and co-advised by Ramesh Jain. I obtained my M.Sc. in electrical engineering at Sharif University of Technology in Tehran, Iran (map). Community service: Associate Editor for IEEE TPAMI, IEEE TNNLS, IET Computer Vision Area chair for NeurIPS 2024, 2023, ICLR 2025, 2024, ECCV 2024, ICCV 2023, CVPR 2023, 2020, 2018, 2017, ICPR 2022, 2020. Senior PC for AAAI 2023, 2018, IJCAI 2020, 2019. Students: Ajinkya Tejankar, PhD Kossar Pourahmadi, PhD KL Navaneet, PhD Om Khangaonkar, Undergraduate Parsa Nooralinejad, PhD Soroush Abbasi Koohpayegani, PhD Alumni: Vipin Pillai, PhD (now at Amazon) Akshayvarun Subramanya, PhD (now at Apple) Aniruddha Saha, PhD (now postdoc at University of Mayland) Ananth Vinjimoor, MSc (now at Amazon Alexa) Erfan Noury, MSc (now at Apple) Essam Sleiman, Undergraduate (now at Harvard University) Koninika Patil, MSc (now at Amazon) Kshipra Kode, MSc (Co-advised by Nilanjan Banerjee) (now at Meta) Maryam Esmaeilkhanian, MSc (now at Capital One) Saeed Damadi, MSc (now PhD student at UMBC Department of Math) Selected Publications MCNC: Manifold-Constrained Reparameterization for Neural Compression Chayne Thrash, Reed Andreas, Ali Abbasi, Parsa Nooralinejad, Soroush Abbasi Koohpayegani, Hamed Pirsiavash, Soheil Kolouri International Conference on Learning Representations (ICLR) 2025. [PDF] [Poster] [Code] CompGS: Smaller and Faster Gaussian Splatting with Vector Quantization KL Navaneet*, Kossar Pourahmadi Meibodi*, Soroush Abbasi Koohpayegani, Hamed Pirsiavash*equal contribution European Conference on Computer Vision (ECCV), 2024. [PDF] [Poster] [Code] [Project Page] NOLA: Compressing LoRA using Linear Combination of Random Basis Soroush Abbasi Koohpayegani*, K L Navaneet*, Parsa Nooralinejad, Soheil Kolouri, Hamed Pirsiavash*equal contribution International Conference on Learning Representations (ICLR) 2024. [PDF] [Code] [Poster] [Project Page] SlowFormer: Adversarial Attack on Compute and Energy Consumption of Efficient Vision Transformers K L Navaneet*, Soroush Abbasi Koohpayegani*, Essam Sleiman*, Hamed Pirsiavash*equal contribution International Conference on Computer Vision and Pattern Recognition (CVPR) 2024. [PDF] [Poster] [Code] BrainWash: A Poisoning Attack to Forget in Continual Learning Ali Abbasi, Parsa Nooralinejad, Hamed Pirsiavash, Soheil Kolouri International Conference on Computer Vision and Pattern Recognition (CVPR) 2024. [PDF] [Code] SimA: Simple Softmax-free Attention for Vision Transformers Soroush Abbasi Koohpayegani, Hamed Pirsiavash IEEE CVF Winter Conference on Applications of Computer Vision (WACV) 2024. [PDF] [Code] GeNIe: Generative Hard Negative Images Through Diffusion Soroush Abbasi Koohpayegani*, Anuj Singh*, K L Navaneet, Hadi Jamali-Rad, Hamed Pirsiavash*equal contribution arXiv 2024. [PDF] [Code] PRANC: Pseudo RAndom Networks for Compacting deep models Parsa Nooralinejad, Ali Abbasi, Soroush Abbasi Koohpayegani*, Kossar Pourahmadi Meibodi*, Rana Muhammad Shahroz Khan*, Soheil Kolouri, Hamed Pirsiavash*equal contribution International Conference on Computer Vision (ICCV) 2023. [PDF] [Supplementary] [Code] A Cookbook of Self-Supervised Learning Randall Balestriero, Mark Ibrahim, Vlad Sobal, Ari Morcos, Shashank Shekhar, Tom Goldstein, Florian Bordes, Adrien Bardes, Gregoire Mialon, Yuandong Tian, Avi Schwarzschild, Andrew Gordon Wilson, Jonas Geiping, Quentin Garrido, Pierre Fernandez, Amir Bar, Hamed Pirsiavash, Yann LeCun, Micah Goldblum arXiv 2023. [PDF] Defending Against Patch-based Backdoor Attacks on Self-Supervised Learning Ajinkya Tejankar, Maziar Sanjabi, Qifan Wang, Sinong Wang, Hamed Firooz, Hamed Pirsiavash, Liang Tan International Conference on Computer Vision and Pattern Recognition (CVPR) 2023. [PDF] [Code] Adaptive Inverse Transform Sampling For Efficient Vision Transformers Mohsen Fayyaz*, Soroush Abbasi Koohpayegani*, Farnoush Rezaei Jafari*, Sunando Sengupta, Hamid Reza Vaezi Joze, Eric Sommerlade, Hamed Pirsiavash, Juergen Gall*equal contribution European Conference on Computer Vision (ECCV), 2022 (Oral presentation). [PDF] [Supplementary] [Poster] [Video] [Code] Constrained Mean Shift Using Distant Yet Related Neighbors for Representation Learning K L Navaneet*, Soroush Abbasi Koohpayegani*, Ajinkya Tejankar*, Kossar Pourahmadi Meibodi, Akshayvarun Subramanya, Hamed Pirsiavash*equal contribution European Conference on Computer Vision (ECCV), 2022. [PDF] [Supplementary] [Poster] [Video] [Slides] [Code] Can we train vision and language zero-shot classification models without syntax? Ajinkya Tejankar, Bichen Wu , Saining Xie , Madian Khabsa , Hamed Pirsiavash , Hamed Firooz In NeurIPS SSL Theory and Practice Workshop, 2022 [PDF] Backdoor Attacks on Vision Transformers Akshayvarun Subramanya, Aniruddha Saha, Soroush Abbasi Koohpayegani, Ajinkya Tejankar, Hamed Pirsiavash arXiv 2022. [PDF] [Code] A Simple Approach to Adversarial Robustness in Few-shot Image Classification Akshayvarun Subramanya, Hamed Pirsiavash ECCV 2022 Workshop on Adversarial Robustness in the Real World [PDF] [Code] A Simple Baseline for Low-Budget Active Learning Kossar Pourahmadi, Parsa Nooralinejad, Hamed Pirsiavash arXiv 2021. [PDF] [Code] Backdoor Attacks on Self-Supervised Learning Aniruddha Saha, Ajinkya Tejankar, Soroush Abbasi Koohpayegani, Hamed Pirsiavash International Conference on Computer Vision and Pattern Recognition (CVPR) 2022 (Oral presentation). [PDF] [Code] Consistent Explanations by Contrastive Learning Vipin Pillai, Soroush Abbasi Koohpayegani, Ashley Ouligian, Dennis Fong, Hamed Pirsiavash International Conference on Computer Vision and Pattern Recognition (CVPR) 2022. [PDF] [Code] SimReg: Regression as a Simple Yet Effective Tool for Self-supervised Knowledge Distillation KL Navaneet, Soroush Abbasi Koohpayegani, Ajinkya Tejankar, Hamed Pirsiavash British Machine Vision Conference (BMVC) 2021. [PDF] [Code] Mean Shift for Self-Supervised Learning Soroush Abbasi Koohpayegani*, Ajinkya Tejankar*, Hamed Pirsiavash*equal contribution International Conference on Computer Vision (ICCV) 2021 (Oral presentation). [PDF] [Project page] [Code] ISD: Self-Supervised Learning by Iterative Similarity Distillation Ajinkya Tejankar*, Soroush Abbasi Koohpayegani*, Vipin Pillai, Paolo Favaro, Hamed Pirsiavash *equal contribution International Conference on Computer Vision (ICCV) 2021. [PDF] [Project page] [Code] Explainable Models with Consistent Interpretations Vipin Pillai, Hamed Pirsiavash 35th AAAI Conference on Artificial Intelligence (AAAI) 2021. [PDF] [Code] CompRess: Self-Supervised Learning by Compressing Representations Soroush Abbasi Koohpayegani*, Ajinkya Tejankar*, Hamed Pirsiavash*equal contribution Neural Information Processing Systems (NeurIPS) 2020. [PDF] [Project page] [Code] COOT: Cooperative Hierarchical Transformer for Video-Text Representation Learning Simon Ging*, Mohammadreza Zolfaghari*, Hamed Pirsiavash, Thomas Brox*equal contribution Neural Information Processing Systems (NeurIPS) 2020. [PDF] [Code] Universal Litmus Patterns: Revealing Backdoor Attacks in CNNs Soheil Kolouri*, Aniruddha Saha*, Hamed Pirsiavash†, Heiko Hoffmann† * and †: equal contribution International Conference on Computer Vision and Pattern Recognition (CVPR) 2020 (oral). [PDF] [Code and dataset of models] Role of Spatial Context in Adversarial Robustness for Object Detection Aniruddha Saha*, Akshayvarun Subramanya*, Koninika Patil, Hamed Pirsiavash*equal contribution CVPR 2020 Workshop on Adversarial Machine Learning in Computer Vision, 2020. [PDF] [Code] Hidden-Trigger Backdoor Attacks Aniruddha Saha, Akshayvarun Subramanya, Hamed Pirsiavash 34th AAAI Conference on Artificial Intelligence (AAAI) 2020 (oral). [PDF] [Code] Fooling Network Interpretation in Image Classification Akshayvarun Subramanya*, Vipin Pillai*, Hamed Pirsiavash *equal contribution International Conference on Computer Vision (ICCV) 2019. [PDF] [Code] Boosting Self-Supervised Learning via Knowledge Transfer Mehdi Noroozi, Ananth Vinjimoor, Paolo Favaro, Hamed Pirsiavash International Conference on Computer Vision and Pattern Recognition (CVPR) 2018. [PDF] Canonical correlation analysis of brain prefrontal activity measured by functional near infra-red spectroscopy (fNIRS) during a moral judgment task Hadis Dashtestani, Rachel Zaragoza, Hamed Pirsiavash, Kristine M. Knutson, Riley Kermanian, Joy Cui, J. Douglas Harrison Jr., Milton Halem, Amir Gandjbakhche Behavioural Brain Research 2018. [PDF] Cross-Modal Scene Networks Yusuf Aytar*, Lluís Castrejón*, Carl Vondrick, Hamed Pirsiavash, Antonio Torralba *equal contribution IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 2018. [PDF] [Project page] Representation Learning by Learning to Count Mehdi Noroozi, Hamed Pirsiavash, Paolo Favaro International Conference on Computer Vision (ICCV) 2017 (oral). [PDF] Weakly Supervised Cascaded Convolutional Networks Ali Diba, Vivek Sharma, Ali Pazandeh, Hamed Pirsiavash, Luc Van Gool International Conference on Computer Vision and Pattern Recognition (CVPR) 2017. [PDF] Automated Detection of Substance Use-Related Social Media Posts Based on Image and Text Analysis Arpita Roy, Anamika Rupa, Hamed Pirsiavash, Shimei Pan IEEE International Conference on Tools for Artificial Intelligence (ICTAI), 2017. (Best Student Paper Award) [PDF] Generating Videos with Scene Dynamics Carl Vondrick, Hamed Pirsiavash, Antonio T",
  "content_length": 14459,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:44"
}