{
  "name": "Hamim Zafar",
  "homepage": "https://sites.google.com/view/cosmiclab-iitk/team",
  "status": "success",
  "content": "CoSmicLab - TeamSearch this siteEmbedded FilesSkip to main contentSkip to navigationTeamProf. Hamim ZafarAssistant ProfessorHamim is an Assistant Professor jointly in the Department of Computer Science and Engineering and the Department of Biosciences and Bioengineering, IIT Kanpur. Hamim carried out postdoctoral research as a Lane Fellow in the lab of Prof. Ziv Bar-Joseph at Carnegie Mellon University. He received his Ph.D. from the Department of Computer Science at Rice University under the guidance of Prof. Luay Nakhleh and Prof. Ken Chen. His research interests lie at the intersection of Computation and Biology. His lab develops Probabilistic Models and Statistical Inference Algorithms for solving computational problems in different fields of Biology including Tumor biology, Developmental biology, Single-cell biology and so on. Hamim is a recipient of the prestigious Har Govind Khorana-Innovative Young Biotechnologist Award (IYBA) from DBT and DBT/Wellcome Trust India Alliance Early Career Fellowship. PhD ScholarsMusale Krushna PavanI am a PhD student at IIT Kanpur in the Department of Computer Science and Engineering, working under the supervision of Dr. Hamim Zafar. I am a PMRF fellow of cycle 9. I completed my BTech from IIIT Kalyani. You can find me, especially around the methods developing for Reconstructing Single Cell  Lineages. My interests lies in Computational Biology. More interesting stuff....PortfolioAjita ShreeI am PhD student in the Department of Computer Science and Engineering at  IIT Kanpur, advised by Dr. Hamim Zafar. My current research aims towards developing unsupervised learning algorithms for the joint analysis of single-cell and spatial transcriptomics datasets. Before starting PhD, I worked as a Data Scientist at  GE Aviation and as a Research Engineer at GE Global Research. I completed M.Tech in Computer Science and Engineering from IIT Delhi, advised by Prof. Naveen Garg.Ayush GoelAyush is a PhD student in the Department of Biosciences & Bioengineering at IIT Kanpur. Ayush did his M.Sc. in Genetics from the University of Delhi. His research interest lies in exploring the molecular intricacies involving the function of CDK12 in prostate cancer. Currently, he is working under the joint supervision of Prof. Bushra Ateeq and Prof. Hamim Zafar.PriyaI am a PhD student in the Computer Science and Engineering Department at IIT Kanpur under the guidance of Hamim Zafar. I am a PMRF fellowship holder (Cycle 11). I did my Masters' in Applied Mathematics from IIT Mandi and Bachelors in Mathematics from Delhi University. Currently, I am working on developing probabilistic and statistical models for elucidating intra-tumor heterogeneity within cancer by jointly performing mutation calling and tumor phylogeny reconstruction from high-throughput single-cell DNA sequencing datasets.Debkanta ChakrabortyDebkanta is a Phd student in the CSE department of IIT Kanpur. He is a recipient of Visvesvaraya Fellowship. He completed his B. Tech from NIT Durgapur and MS from Iowa State University, US under the guidance of Prof. Robert Jernigan. He also worked in the industry such as WIPRO, Infosys (India); Airbus, British Telecom (UK); and NextBio (California, US). Debkanta's research interests include Cell Multi-omics, Spatial Transcriptomics and Phylogenetics. Other than Computational Biosciences, he is also deeply passionate about Number Theory and Topology.Aditya GoutamI'm Aditya, a PhD student in the Biological Sciences and Bioengineering department at Indian Institute of Technology Kanpur. I am working in the field of computational Biology under the guidance of Dr. Hamim Zafar. I did my Bachelor's in Applied Electronics and Instrumentation from Heritage Institute of Technology Kolkata and my schooling from Jamshedpur Public School. My area of research is tumor heterogeneity in Oral cancer. Other interests include  Basketball and Esports.Narein RaoI am currently pursuing a PhD in Computer Science at Rice University, under the supervision of Prof. Luay Nakhleh co-guided by Prof Hamim Zafar. I graduated with a MSR in Computer Science under the supervision of Prof. Hamim Zafar from the Indian Institute of Technology, Kanpur. My research interest currently lies in the domain of computational genomics, specifically Cancer genomics and revolves around creating efficient computational techniques involving aspects of probabilistic machine learning, statistics, and algorithms for analyzing genomic data. Shweta MauryaI am Shweta Maurya, a Ph.D. student in the Biological Sciences and Bioengineering department at IIT Kanpur working under the supervision of Dr. Hamim Zafar, with a strong passion for exploring the vast landscape of omics. I began my academic journey with a B. Tech. Biotechnology from Bundelkhand University, Jhansi, followed by an M. Tech. in Biochemical Engineering from Indian Institute of Technology (BHU), Varanasi. Now, in my Ph.D., I am delving into genomics, transcriptomics, and proteomics to better understand complex biological systems and contribute to advances in personalized medicine and disease research.Masters StudentsShruti AgarwalShruti is doing her M.Tech from the Biological Sciences and Bioengineering department, IIT Kanpur. She is interested in exploring different bioinformatics tools and currently working under Dr. Sai P Pydi and Dr. Hamim Zafar.Juhi BhattacharyaI am an M.Tech. student at IIT Kanpur in the Department of Biomedical Engineering, working under the supervision of Dr. Hamim Zafar. I did my B.Tech. in Biotechnology from Amity University Noida and my schooling from Dr. Virendra Swarup Education Centre, Kidwai Nagar, Kanpur. I am keen on utilizing deep learning methods to apply image processing techniques for analyzing and predicting results from biological data. My interests lie in bioinformatics and machine learning.AlumniAnirudh Nanduri: MTech Student at CSE. Lab Member: 2021-2023. Currently a Software Engineer at NVidia, Bangalore.Tanush Kumar: Undergraduate Student. Lab Member: 2023-2024. Currently a Masters' student at Harvard University, Boston, US.Keerthana M Arun: Undergraduate Student. Lab Member: 2023. Currently a Research Technologist at Northwestern University.Saksham Gupta: Undergraduate Student. Lab Member: 2021-2022. Currently a Research Technician at Fred Hutchinson Cancer Center.Shashank Katiyar: Undergraduate Student. Lab Member: 2023. Currently an MS student at Carnegie Mellon University.Soura Chakraborty: Graduate Student at BSBE. Lab Member: 2020-2022. Currently a PhD Scholar at the University of Cambridge.Kushagra Pandey: MTech Student at CSE. Lab Member: 2020-2022. Currently a PhD Scholar at University of California, Irvine.Vihari Sunkara: MTech Student at CSE. Lab Member: 2019-2021. Currently a Software Engineer at Microsoft.Abhay Raj Singh Yadav: MTech Student at CSE. Lab Member: 2020-2021. Currently a Software Engineer at Citrix R&D.Avesh Kumar Agrawal: MTech Student at CSE. Lab Member: 2020-2021. Currently a Software Engineer at VMware.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 7103,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:44"
}