{
  "name": "Hamid Rezatofighi",
  "homepage": "https://research.monash.edu/en/persons/hamid-rezatofighi",
  "status": "success",
  "content": "Hamid Rezatofighi - Monash University X View Scopus Profile Hamid Rezatofighi Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0002-8659-8773 EmailHamid.Rezatofighimonashedu Accepting PhD Students 20082025 Research activity per year Personal profile BiographyDr. Hamid Rezatofighi is an Associate Professor in the Faculty of Information Technology at Monash University, Australia. His research spans computer vision, machine learning, and robotics, with notable contributions to advancing robot visual perception in dynamic environments. Previously, he was an Endeavour Research Fellow at Stanford's Vision and Learning Lab (SVL) and a Senior Research Fellow at the Australian Institute for Machine Learning (AIML) at the University of Adelaide. Dr. Rezatofighi completed his Ph.D. at the Australian National University in 2015. He has authored 100+ publications, including more than 25 high-quality journal articles and over 60 contributions to premier conferences such as CVPR, ECCV, ICCV, NeurIPS, AAAI, IJCAI, ICRA, and IROS. His work has received over 16,000 citations, with 15 of his papers (four as first author) cited more than 100 times, and three exceeding 1,000 citations. Since 2020, he has served as an area chair for major conferences (CVPR, NeurIPS, ECCV, ICCV, IJCAI, and IROS) and holds positions as a Senior Associate Editor for IEEE Transactions on Image Processing and as an Associate Editor for the Artificial Intelligence Journal. These roles reflect his active engagement in the academic community. Over the past four years, Dr. Rezatofighi has secured more than $17 million in research funding, including significant grants from three DARPA projects (one as Lead PI, two as co-PI) and as lead CI for an ARC Discovery Project. His ongoing work continues to drive innovations in computer vision and robotics. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, PhD, Bayesian Multi-Target Tracking in Time-Lapse Fluorescence Microscopy Sequences, Australian National University (ANU)18 Mar 2011 → 1 Jul 2014Award Date: 17 Jul 2015Electrical Engineering - Biomedical Engineering, Master, Automatic Recognition of White Blood Cells in Hematological Images, University of Tehran30 Sept 2006 → 28 Feb 2009Award Date: 28 Feb 2009 Research area keywordsComputer VisionRobot VisionRobot PerceptionRoboticsDeep LearningMachine Learning Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2020 2020 2021 2023 2025 2027 1 Not started 2 Finished 4 Active Projects per year SEA-AI: SEA-AI: Neuro-Symbolic Enhanced Autonomy for Maritime Scene Understanding and ReasoningRezatofighi, H. (Primary Chief Investigator (PCI)), Haffari, R. (Chief Investigator (CI)) & Rastgoo, N. (Chief Investigator (CI))11/07/25 → 10/07/26Project: Research HARNESS: Hierarchical Abstractions and Reasoning for Neuro-Symbolic SystemsRezatofighi, H. (Primary Chief Investigator (PCI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), Li, Y.-F. (Chief Investigator (CI)), Stuckey, P. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Gutierrez, J. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Ignatiev , A. (Chief Investigator (CI)), Swiecki, Z. (Chief Investigator (CI)), Vered, M. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)) & Say, B. (Chief Investigator (CI))20/06/23 → 20/02/27Project: Research Spatiotemporal Object Detection/Segmentation from Multi-Spectral Time Sequence DataStuckey, P. (Primary Chief Investigator (PCI)), Rezatofighi, H. (Chief Investigator (CI)) & Meehan, A. (Chief Investigator (CI))18/10/21 → 18/10/26Project: Research Active Visual Navigation in an Unexplored EnvironmentRezatofighi, H. (Primary Chief Investigator (PCI)) & Reid, I. (Chief Investigator (CI))31/08/20 → 31/12/25Project: Research \"Machine learning for clinical decision support in in-vitro fertilisation\" 2021 Monash Data Futures Institute Seed Grants - AI and Data Science for Monash Global ChallengesHorta Nunez, F. (Primary Chief Investigator (PCI)), Catt, S. (Chief Investigator (CI)), Vollenhoven, B. (Chief Investigator (CI)), Rezatofighi, H. (Chief Investigator (CI)) & Cai, J. (Chief Investigator (CI))Project: Research View all 7 projects Research output Research output per year 2008 2019 2023 2024 2025 63 Conference Paper 24 Article 1 Editorial 1 Letter 1 More 1 Review Article Research output per year Research output per year Acoustic-to-hyper-spectral: real-time perimeter intrusion detection system monitoring through learnable filters and hyper-spectral image generation from distributed acoustic sensing systemsPierau, R.-E., Katsifolis, J., Meehan, A., Rezatofighi, H. & Stuckey, P. J., 10 Feb 2025, In: Optics Express. 33, 3, p. 4109-4126 18 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) Acoustic-to-Hyper-Spectral: Hyper-Spectral Image Construction from Frequency Spectrums through Simulated AnnealingPierau, R. E., Meehan, A., Rezatofighi, H. & Stuckey, P. J., 2025, Proceedings of the AAAI Conference on Artificial Intelligence. Walsh, T., Shah, J. & Kolter, Z. (eds.). Washington DC USA: Association for the Advancement of Artificial Intelligence (AAAI), p. 29466-29468 3 p. (Proceedings of the AAAI Conference on Artificial Intelligence; vol. 39, no. 28).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Other Open Access Diffusion Model for Robust Multi-sensor Fusion in 3D Object Detection and BEV SegmentationLe, D.-T., Shi, H., Cai, J. & Rezatofighi, H., 2025, Computer Vision – ECCV 2024 - 18th European Conference Milan, Italy, September 29–October 4, 2024 Proceedings, Part LXVIII. Leonardis, A., Ricci, E., Roth, S., Russakovsky, O., Sattler, T. & Varol, G. (eds.). Cham Switzerland: Springer, p. 232-249 18 p. (Lecture Notes in Computer Science; vol. 15126).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 3 Citations (Scopus) GyroCopter: Differential Bearing Measuring Trajectory Planner for Tracking and Localizing Radio Frequency SourcesChen, F., Rezatofighi, S. H. & Ranasinghe, D. C., 2025, In: IEEE Robotics and Automation Letters. 10, 4, p. 3755-3762 8 p.Research output: Contribution to journal › Article › Research › peer-review HYDRA: A Hyper Agent for Dynamic Compositional Visual ReasoningKe, F., Cai, Z., Jahangard, S., Wang, W., Haghighi, P. D. & Rezatofighi, H., 2025, Computer Vision – ECCV 2024, 18th European Conference Milan, Italy, September 29–October 4, 2024 Proceedings, Part XX. Leonardis, A., Ricci, E., Roth, S., Russakovsky, O., Sattler, T. & Varol, G. (eds.). Cham Switzerland: Springer, p. 132-149 18 p. (Lecture Notes in Computer Science; vol. 15078).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 4 Citations (Scopus) View all 90 research outputs",
  "content_length": 7550,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:42"
}