{
  "name": "Hamid Bagheri",
  "homepage": "http://cse.unl.edu/~hbagheri",
  "status": "success",
  "content": "Hamid Bagheri - Homepage Hamid Bagheri is an Associate Professor in the School of Computing at the University of Nebraska-Lincoln. He is a faculty associate of the Institute for Software Research (ISR) at the University of California, Irvine, and a co-director of the ESQuaReD Lab. Prof. Bagheri is a recipient of the EPSCoR FIRST Award, the NSF CISE Career Research Initiation Initiative Award, and several Distinguished Paper Awards. Prior to joining UNL, he was a postdoctoral researcher at University of California, Irvine and Massachusetts Institute of Technology. He obtained his PhD in Computer Science from University of Virginia. His research is at the intersection of software engineering, security, and formal methods. He is currently on the review boards of the IEEE Transactions on Software Engineering and the ACM Transactions on Software Engineering and Methodology. Research Areas: Security of Mobile Devices and IoT Systems: [IEEE TSEâ22, ICSEâ18, ISSTAâ20, INFOCOMâ19, IEEE TSEâ17, IEEE TIFSâ20, DSNâ16, IEEE TSEâ15, EMSEâ21, FAoCâ18, JSSâ19, FMâ15]. Scaling Formal Verification with Machine Learning: [ESEC/FSEâ22, ISSTAâ22, ESEC/FSEâ16, ASEâ18, FASEâ20]. Software Analysis and Testing: [ICSEâ20, ICSEâ16, ISSTAâ16, ICSEâ14, DSNâ22, IEEE TSEâ17]. Dependable Cyber-Physical Systems: [ICCPSâ20, ESEC/FSEâ18, ICSE-NIERâ20, AIAA SciTech'20]. Automated Program Repair and Fault Localization: [ICSEâ21, ICSEâ21, ASEâ22, ISSTAâ22] Email Me Google Scholar DBLP Selected Publications News ● Congratulations to my former PhD student, âªMohannad Alhanahnah, on joining Chalmers University as a tenure-track faculty member in Fall 2024. ● I am honored to receive the 2023-2024 SoC Student Choice Outstanding Teaching Award! ● Congratulations to my PhD student, Clay Stevens, on joining Iowa State University as a tenure-track faculty member commencing in Fall 2023. ● Our ISSTAâ22 paper was selected to receive the ACM SIGSOFT Distinguished Paper Award. ● Our papers were accepted to ESEC/FSE'22, ASE'22, ISSTA'22, DSN'22, and IEEE TSE. ● Keynote Talk at SERP4IoT 2022. ● Two papers were accepted to appear at ICSE'21. ● Our paper was accepted to Springer EMSE in 2021. ● Keynote Talk at ASSE 2021. ● Our ISSTAâ20 paper was selected to receive the ACM SIGSOFT Distinguished Paper Award. ● Our ICCPS'20 Paper was featured in ICCPS Best Papers. ● I am honored to receive the 2020-2021 CSE Outstanding Teaching Award. ● Our papers were accepted to ICSE'20, ISSTA'20, FASE'20, ICSE-NIER'20, and ICCPS'20. ● My PhD student, Jianghao Wang, has won the CSE Outstanding Master's Thesis Award in 2020. ● My PhD student, Clay Stevens, has won the CSE Outstanding Graduate Student Research Award in 2020. ● My undergraduate student, Brooke Lampe, has won the Al and Dorothy Schewe Undergraduate Award in 2020. ● Our paper was accepted to IEEE TIFS in 2020. ● My PhD student, Mohannad Alhanahnah, successfully defended his dissertation. Congrats Dr. Alhanahnah! ● Keynote Talk at SEAD 2019. ● Our paper was accepted to INFOCOM'19. ● Our ICSME'18 paper was nominated for IEEE TCSE Distinguished Paper Award. ● Our papers were accepted to ICSE'18, ASE-NIER'18, ICSME'18, and ESEC/FSE'18. ● I have received the NSF CISE Career Research Initiation Initiative Award in 2018. ● We have received the NU System Science Collaboration Initiative Award in 2017. ● I have received the NSF EPSCoR First Award in 2017. ● Two papers were accepted to IEEE TSE in 2017. ● Our ICSA'17 paper was nominated for the Best Paper Award. ● We have received the NSF SHF Research Grant Award in 2016. ● Our papers were accepted to ICSE'16, ISSTA'16, DSN'16, ECSA'16, and ESEC/FSE'16.",
  "content_length": 3716,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:39"
}