{
  "name": "Hamid Zarrabi-Zadeh",
  "homepage": "http://sharif.edu/~zarrabi",
  "status": "success",
  "content": "Hamid Zarrabi-Zadeh Home Publications Teaching Hamid Zarrabi-Zadeh Hamid Zarrabi-Zadeh Associate Professor, Head Department of Computer Engineering Sharif University of Technology Azadi Avenue Tehran, Iran, 14588 89694 Office: 715 (CE Building) Email: zarrabi Phone: +98 (21) 6616-6600 Fax: +98 (21) 6601-9246 Education Ph.D. in Computer Science, University of Waterloo, 2008. M.Sc. in Software Engineering, Sharif University of Technology, 2000. B.Sc. in Software Engineering, Sharif University of Technology, 1998. Research Interests Massive Data Algorithms Computational Geometry Algorithmic Graph Theory Approximation and Randomized Algorithms Online and Streaming Algorithms Positions Head, Department of Computer Engineering, Sharif UT, 2022–present. Director, Rayan World Finals, 2025. Regional Cite Director, ICPC Asia West Region, Tehran Site, 2025–present. Member of IOI International Technical Committee (ITC), 2016–2018, 2021–2024. Executive Director, ICPC Asia West Region, Tehran Site, 2012–2024. Dean of Education, Sharif University of Technology, 2022–2023. Member of National Committee, Iranian National Olympiad in Informatics, 2012–present. CIO for Education, Sharif University of Technology, 2018–present. Iran Team Leader, International Olympiad in Informatics (IOI), 2014, 2021. Vice Chairman for Education, Computer Eng. Department, Sharif UT, 2018–2020. Member of IOI International Scientific Committee (ISC), 2015. Head of Tanzil Project, an international Quranic project, 2007–present. Member of Scientific Committee, ICPC Regional Contest, Tehran Site, 2012–present. Profession Associate Professor, Sharif University of Technology, 2024–present. Assistant Professor, Sharif University of Technology, 2011–2024. Postdoctoral Fellow, Carleton University, 2009–2011. Research Assistant, University of Waterloo, 2003–2008. Awards & Honors Distinguished Professor, Sharif University of Technology, 2024. Coaching Award (for Excellence in Coaching), ICPC World Finals, 2024. Outstanding Professor Award, National Elites Foundation, 2024. IOI Long Service Award, 2024. Highest Honors, ICPC World Finals, 2024, 2025. Asia West Champion, ICPC World Finals, 2018, 2019, 2024, 2025. Outstanding SPAA Paper Award, 2023. Distinguished Leadership Award, ICPC World Finals, 2022. Bronze Medal (as coach), ICPC World Finals, 2019. Distinguished Professor, Sharif University of Technology, 2018 Young Assistant Professor Award, National Elites Foundation, 2013. NSERC Industrial Fellowship for postdoctoral research, 2009. Cheriton Scholarship in Computer Science, University of Waterloo, 2007–2008. International Graduate Students Award, University of Waterloo, 2003–2004. Champion, US Open RoboCup, Soccer Simulation League, 2004, 2005. 5th place, RoboCup World Cup, Soccer Simulation League, 2004. Student Book Award for translating the book Graph Theory with Applications, 2000. First place, National Olympiad in Informatics Programming Contest, 1993. Recent Program Committees 37th Canadian Conference on Computational Geometry (CCCG 2025) 28th International Computer Conference, Computer Society of Iran (CSICC 2023) 4th-5th Iranian Conference on Computational Geometry (ICCG 2021, ICCG 2022) (co-chair) 3rd International Conference on Topics in Theoretical Computer Science (TTCS 2020) 1st–3rd Iranian Conference on Computational Geometry (ICCG 2018, ICCG 2019, ICCG 2020) 2nd International Conference on Topics in Theoretical Computer Science (TTCS 2017) 22nd National Computer Conference of Computer Society of Iran (CSICC 2017) 28th Canadian Conference on Computational Geometry (CCCG 2016) 2nd International Symposium on Big Data and Cloud Computing Challenges (ISBCC 2015) 23rd Iranian Conference on Electrical Engineering (ICEE 2015) 7th International Conference on Combinatorial Optimization and Applications (COCOA 2013) 24th Canadian Conference on Computational Geometry (CCCG 2012) 4th Workshop on Massive Data Algorithmics (MASSIVE 2012) Pages Home Publications Teaching LinksCE Department CE Open Courses Sharif University rent camera Copyright © 2025 Hamid Zarrabi-Zadeh Top",
  "content_length": 4104,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:45"
}