{
  "name": "Hamid Dehghani",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/dehghani-hamid.aspx",
  "status": "success",
  "content": "Professor Hamid Dehghani, Computer Science, University of Birmingham - University of Birmingham Professor Hamid Dehghani School of Computer ScienceProfessor of Medical Imaging Contact details Telephone+44 (0) 121 414 8728Emailh.dehghani@cs.bham.ac.uk View my research portal AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Hamid Dehghani is the Professor of Medical Imaging, developing advanced computational models, image reconstruction algorithms, and non-invasive techniques for disease diagnosis, notably in breast cancer and brain function, and has authored NIRFAST—an open-source software for diffuse optical tomography research. PhD, Sheffield Hallam University, 1999 MSc in Medical Physics and Biomedical Engineering, University of Sheffield (1995) MIPEM (member of Institute of Physics and Engineering in Medicine Fellow of Optica (formerly OSA) Professor Hamid Dehghani is Professor of Medical Imaging at the School of Computer Science. He is part of the Centre for Human Brain Health as well as the Healthcare Technologies Institute (HTI). He has made world-leading contributions in Biophotonics, as used for diagnostic and therapeutic applications. His research focuses on biomedical imaging and in particular in the development of novel non-invasive techniques for imaging biological tissue for disease detection and characterisation. My work specifically involves Biomedical Optics, Computational modelling of light propagation in tissue, Image reconstruction and Image processing, Physiological Measurements using non-invasive techniques and mechanical properties and modelling of tissue deformation. He has published widely on Diffuse Optical Imaging and has over 25 years of experience in the field. He has contributed significantly to the development and application of Diffuse Optical Imaging devices and computational analysis and is author of the NIRFAST package. Medical Imaging Laboratory Google Scholar Profile Current Topics in Artificial Intelligence and Machine Learning Artificial Intelligence 1 Computational Vision and Imaging Related Departments Seeing through the body: Shedding light on seeing beyond the naked eye Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 2310,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:40"
}