{
  "name": "Hamid Reza Rabiee",
  "homepage": "http://sharif.edu/~rabiee",
  "status": "success",
  "content": "Home Courses Experience Publication Patents Research Interests Honors & Awards Contact me In The Name of God, The Compassionate, The Merciful Hamid R. Rabiee (Hamidreza Rabiee), PhD Distinguished Professor Artificial Intelligence (AI) Group Department of Computer Engineering Sharif University of Technology …………………………………………………………………………….. Phone: (9821) 6600-6399 Fax: (9821) 6604-7662 email: rabiee[at]sharif[dot]edu Hamid R. Rabiee (Hamidreza Rabiee) received his BS and MS degrees (with Great Distinction) in Electrical Engineering from CSULB, Long Beach, CA (1987, 1989), his EEE degree in Electrical and Computer Engineering from USC, Los Angeles, CA (1993), and his Ph.D. in Electrical and Computer Engineering from Purdue University, West Lafayette, IN, in 1996. From 1993 to 1996, he was a Member of Technical Staff at AT&T Bell Laboratories. From 1996 to 1999, he worked as a Senior Software Engineer at Intel Corporation. He was also with PSU, OGI, and OSU universities as an adjunct professor of Electrical and Computer Engineering from 1996 to 2000. Since September 2000, he has been affiliated with the Sharif University of Technology, Tehran, Iran. He was also a visiting professor at Imperial College London for the 2017-2018 academic year. He is the founder of Sharif University’s Advanced Information and Communication Technology Research Institute (AICT), ICT Innovation Center, Advanced Technologies Incubator (SATI), Data Science & Machine Learning Laboratory (DML), Mobile Value-Added Services Laboratory (M-VASL), Bioinformatics and Computational Biology Laboratory (BCB), and Cognitive Neuro-engineering Research Center (CNRC). He has also been the founder of many successful High-Tech start-up companies in the field of ICT as an entrepreneur. He is currently a Distinguished Professor of Computer Engineering at Sharif University of Technology and Director of the Data Science & AI Innovation Center and DML Laboratories. He has been the initiator and director of many national and international-level projects in the context of Iran’s National ICT Development Plan and UNDP International Open-Source Network. He is also a consultant of AI in the Health Expert Group at WHO and a Member of IFIP Working Group 10.3 on Concurrent Systems. He has received numerous national and international awards and honors for his Industrial, scientific, and academic contributions. He holds three patents. He is also a Senior Member of IEEE. His research interests include statistical machine learning, Bayesian statistics, data analytics, and complex networks with applications in social networks, multimedia systems, cloud and IoT privacy, bioinformatics, and brain networks. Links DML Research Lab My Google Scholar Page My Linkedin Profile My Students ResearchGate",
  "content_length": 2778,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:45"
}