{
  "name": "Hamid Karimi",
  "homepage": "https://www.usu.edu/cs/directory/faculty/karimi-hamid",
  "status": "success",
  "content": "Hamid Karimi | School of Computing - College of Engineering | USU Utah State University sites use cookies. By continuing to use this site you accept our privacy and cookie policy. I agree Skip to content Hamid Karimi School of Computing Assistant Professor Contact InformationOffice Location: SER 330Phone: 435-797-1233Email: hamid.karimi@usu.eduAdditional Information: Website Emphasis Social Media Mining, Educational Data Mining, Machine Learning, Graph Mining, AI for Social Good. Biography Dr. Hamid Karimi completed his Ph.D. in School of Computing at Michigan State University (MSU) in 2021, with a primary research focus on artificial intelligence (AI) for social good. During his doctoral studies, he explored several intriguing areas, such as AI in education, computational politics, and misinformation detection. As a member of the interdisciplinary Teachers in Social Media project, he concentrated on creating innovative and efficient data mining and machine learning algorithms to enhance the quality of PK-12 education. Throughout his academic journey, Dr. Karimi has been honored with multiple awards. These include the Best Paper Award at the IEEE-ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM 2018), the Outstanding Graduate Student Service Award (2019), the Dissertation Completion Award (2020), and the International Faculty Recognition Award at Utah State University (2022). In August 2021, Dr. Karimi joined Utah State University as an Assistant Professor (tenure-track) in School of Computing, where he now leads the Data Science and Applications lab. The overarching goal of the Data Science and Applications (DSA) lab is to devise novel, efficient, and practical solutions to enhance the social impact of data science. The lab focuses on multiple research areas, including Social Media Mining, Educational Data Mining, and Cross-Disciplinary Applications of Data Science in Science and Engineering fields. By leveraging advanced data mining techniques and machine learning algorithms, the lab aims to extract valuable insights from large and complex datasets across various domains.",
  "content_length": 2149,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:41"
}