{
  "name": "Hamish Cunningham",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/hamish-cunningham",
  "status": "success",
  "content": "Emeritus Professor Hamish Cunningham | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Emeritus Professor Hamish Cunningham School of Computer Science Visiting Professor (Emeritus) Open staff member portrait in a modal window h.cunningham@sheffield.ac.uk Regent Court (DCS) Full contact details Emeritus Professor Hamish Cunningham School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0001-5901-5483 Google Scholar Personal website Profile Hamish Cunningham is an Emeritus Professor in Computer Science at the University of Sheffield and an executive committee member of the Institute for Sustainable Food. He used to hope that as time passed he would get older and wiser, but it seems that in fact he just gets odder and wider.He has been a software engineer, researcher, open source developer and Principal Investigator on some €12m of funded research, and in 2014 ran a successful crowdfunding campaign to produce the MoPi mobile power board for the Raspberry Pi.He has published some 200 peer-reviewed articles (cited more than 10,000 times), served on a number of editorial boards and reviewed project proposals for the EC, EPSRC, BBSRC, ESRC, NWO and others. His team produced the GATE open source platform for language and knowledge research, which is used by organisations as diverse as the BBC, WHO cancer research and the Financial Times, and which has attracted around €20 million euros of direct research funding at Sheffield alone.Cunningham is currently researching open Internet of Things (IoT) devices for domestic aquaponics, has been a management committee member of the COST network EU Aquaponics Hub and the owner of a small greenhouse full of fish.He teaches the COM3505 3rd-year undergraduate course on the IoT and will one day finish his next book, The Internet of Things: mi Casa su Botnet?He believes that open source technology has a contribution to make to sustainability and resilience, and that political democracy is proving incapable of saving the planet due to our complete lack of economic democracy.Find him at hamish.gate.ac.uk. Research interests aquaponics monitoring and control systems for sustainable intensive food productionphysical computing; micro-manufacturing; maker culture; Raspberry Piprivacy-preserving social medialanguage analysis infrastructure, text mining and textual big data processing Publications Books Cunningham H, Maynard D, Bontcheva K, Tablan V, Aswani N, Roberts I, Gorrell G, Funk A, Roberts A & Damljanovic D (2011) Text Processing with Gate (Version 6). GATE. Cunningham H, Coleman G & Radu V () Mi Casa su Botnet? Learning the Internet of Things with WaterElf, unPhone and the ESP32. Journal articles Edmondson J, Cunningham H, Densley Tingley D, Dobson M, Grafius D, Leake J, McHugh N, Nickles J, Phoenix G, Ryan A , Stovin V et al (2020) The hidden potential of urban horticulture. Nature Food, 1, 155-159. View this article in WRRO Edmondson JL, Blevins S, Cunningham H, Dobson M, Leake J & Grafius D (2019) Grow your own food security? Integrating science and citizen science to estimate the contribution of own growing to UK food production. Plants, People, Plant. View this article in WRRO Tablan V, Bontcheva K, Roberts I & Cunningham H (2015) Mímir: An open-source semantic search framework for interactive information seeking and discovery. Journal of Web Semantics, 30, 52-68. Bontcheva KL, Cunningham H, Aswani N, Roberts I, Roberts A, Tablan V & Gorrell G (2013) GATE Teamware: a web-based, collaborative text annotation framework. Language Resources and Evaluation, 47(4), 1007-1029. View this article in WRRO Cunningham H, Tablan V, Roberts A & Bontcheva K (2013) Getting More out of Biomedical Documents with GATE's Full Lifecycle Open Source Text Analytics.. PLoS Computational Biology. View this article in WRRO Damljanovic D, Agatonovic M, Cunningham H & Bontcheva KL (2013) Improving Habitability of Natural Language Interfaces for Querying Ontologies with Feedback and Clarification Dialogues. Journal of Web Semantics. Aswani N, Beckers T, Birngruber E, Boyer C, Burner A, Bystroň J, Choukri K, Cruchet S, Cunninghami H, Dědek J , Dolamic L et al (2013) Khresmoi - multilingual semantic search of medical text and images.. Stud Health Technol Inform, 192, 1266. Tablan V, Roberts I, Cunningham H & Bontcheva K (2012) GATECloud.net: a Platform for Large-Scale, Open-Source Text Processing on the Cloud. Philosophical Transactions of the Royal Society A. Mathematical, Physical and Engineering Sciences. View this article in WRRO Cunningham H (2012) Agile Research. CoRR, abs/1202.0652. Johansson M, Roberts A, Chen D, Li Y, Delahaye-Sourdeix M, Aswani N, Greenwood MA, Benhamou S, Lagiou P, Holcátová I , Richiardi L et al (2012) Using prior information from the medical literature in GWAS of oral cancer identifies novel susceptibility variant on Chromosome 4 - the AdAPT method. PLoS ONE, 7(5). View this article in WRRO Damljanovic D, Petrak J, Lupu M, Cunningham H, Carlsson M, Engstrom G & Andersson B (2011) Random indexing for finding similar nodes within large RDF Graphs. CEUR Workshop Proceedings, 737, 36-50. Davis B, Dantuluri P, Handschuh S & Cunningham H (2010) Towards Controlled Natural Language for Semantic Annotation. INT J SEMANT WEB INF, 6(4), 64-91. Davis B, Dantuluri P, Dragan L, Handschuh S & Cunningham H (2010) On designing controlled natural languages for semantic annotation. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 5972 LNAI, 187-205. Cunningham H, Hanbury A & Rüger S (2010) Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics): Preface. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 6107 LNCS. Davis B, Varma P, Handschuh S, Dragan L & Cunningham H (2009) Controlled natural language for semantic annotation. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 5554 LNCS, 816-820. Li Y, Bontcheva K & Cunningham H (2009) Adapting SVM for data sparseness and imbalance: A case study in information extraction. Natural Language Engineering, 15(2), 241-271. Li Y & Cunningham H (2008) Geometric and quantum methods for information retrieval.. SIGIR Forum, 42, 22-32. Yankova M, Saggion H & Cunningham H (2008) Adopting ontologies for multisource identity resolution. Proceedings of the 1st International Workshop on Ontology-supported Business Intelligence, OBI 2008. Fensel D, Van Harmelen F, Andersson B, Brennan P, Cunningham H, Valle ED, Fischer F, Huang Z, Kiryakov A, Lee TKI , Schooler L et al (2008) Towards LarKC: A platform for Web-scale reasoning. Proceedings - IEEE International Conference on Semantic Computing 2008, ICSC 2008, 524-529. Ursu C, Tablan V & Cunningham H (2005) Semantic analysis for tomorrow's audio-visual digital archives. IET Seminar Digest, 2005(11099), 373-380. Cunningham H, Bontcheva K & Li Y (2005) Knowledge management and human language: Crossing the chasm. Journal of Knowledge Management, 9(5), 108-131. Baker P, Hardie A, McEnery T, Xiao R, Bontcheva K, Cunningham H, Gaizauskas RJ, Hamza O, Maynard D, Tablan V , Ursu C et al (2004) Corpus Linguistics and South Asian Languages: Corpus Creation and Tool Development.. Lit. Linguistic Comput., 19, 509-524. Cunningham H & Scott D (2004) Software architecture for language engineering. Natural Language Engineering, 10(3-4), 205-209. Bontcheva K, Tablan V, Maynard D & Cunningham H (2004) Evolving GATE to meet new challenges in language engineering. Natural Language Engineering, 10(3-4), 349-373. Cunningham H (2002) GATE, a general architecture for text engineering. COMPUT HUMANITIES, 36(2), 223-254. Maynard D, Tablan V, Cunningham H, Ursu C, Saggion H, Bontcheva K & Wilks Y (2002) Architectural Elements of Language Engineering Robustness. Journal of Natural Language Engineering, 8(2-3), 257-274. Wilks YA, Sampson G, Ostler N, Cunningham H, Young SJ & Hajicova E (2000) The role of taxonomy in language engineering - Discussion. PHILOS T ROY SOC A, 358(1769), 1354-1355. Cunningham H (1999) A definition and short history of Language Engineering.. Nat. Lang. Eng., 5, 1-16. Cunningham H (1997) Information Extraction - A User Guide. CoRR, cmp-lg/9702006. Cunningham H, Wilks Y & Gaizauskas RJ () New Methods, Current Trends and Software Infrastructure for NLP. Proceedings of NEMLAP-2. Cunningham H, Gaizauskas RJ & Wilks Y () A General Architecture for Language Engineering (GATE) - a new approach to Language Engineering R&D. Book chapters Hewitt M & Cunningham H (2024) Towards Privacy-Preserving Voice Control in Smart Home IoT: A Taxonomy, Lecture Notes in Networks and Systems (pp. 614-619). Springer Nature Switzerland Bontcheva K, Tablan V & Cunningham H (2014) Semantic search over documents and ontologies (pp. 31-53). Cunningham H, Freeman M & Black WJ (2013) Software reuse, object-oriented frameworks and NLP, New Methods In Language Processing (pp. 357-366). Bontcheva K & Cunningham H (2011) Semantic Annotations and Retrieval: Manual, Semiautomatic, and Automatic Generation, Handbook of Semantic Web Technologies (pp. 77-116). Springer Berlin Heidelberg Cunningham H, Tablan V, Roberts I, Greenwood MA & Aswani N (2011) Information Extraction and Semantic Annotation for Multi-Paradigm Information Management, Current Challenges in Patent Information Retrieval (pp. 307-327). Springer Berlin Heidelberg Aswani N, Tablan V, Bontcheva K & Cunningham H (2007) Indexing and querying linguistic metadata and document content, Recent Advances in Natural Language Processing IV (pp. 35-44). John Benjamins Publishing Company Cunningham H (2006) Information Extraction, Autom",
  "content_length": 40330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:47"
}