{
  "name": "Hammond Pearce",
  "homepage": "https://www.unsw.edu.au/staff/hammond-pearce",
  "status": "success",
  "content": "Dr Hammond Pearce Type in a search term Search Follow Follow LinkedIn Facebook Instagram TikTok YouTube Back to Dr Hammond Pearce Senior Lecturer Engineering Computer Science and Engineering Follow me Follow me (Personal academic website) Dr. Hammond Pearce (he/him) is a Senior Lecturer (a.k.a. Assistant Professor) at UNSW Sydney's School of Computer Science and Engineering. His main research focus is in hardware and software cybersecurity, including embedded systems, cyber-physical systems, and additive manufacturing. He also examines the implications of machine learning (ML) on design and applications in this space. He is particularly interested in how AI might be leveraged for new design strategies, including automated code writing and bug repair. As part of this work he won the inaugural Efabless AI-Generated Open-Source Silicon Design Challenge, the IEEE S&P Distinguished Paper award, and the ACM TODAES Best Paper Award. He received the B.E. (Hons) degree in Computer Systems Engineering in 2014 and the Ph.D. in Computer Systems Engineering in 2020 both from the University of Auckland, Auckland, New Zealand. In 2019 he took part in the NASA International Internship Programme and worked at NASA Ames in California, and he has also worked in several industry positions, including as a full-stack web developer and as an electronics contractor working on Li-ion battery management systems. He teaches COMP3601 Design Project A, where students are introduced to complex FPGA development via the development of a large group project. E-mail hammond.pearce@unsw.edu.au Location K17-217E Publications Publications Media Media Grants Grants Awards Awards Research Activities Research Activities Engagement Engagement Teaching and Supervision Teaching and Supervision Books Book Chapters Book Chapters | 2025 Pearce H, 2025, 'Counterfeits and kill switches: How hardware security can impact you', in Futureshock Happenings in Computer Science, pp. 154 - 172, http://dx.doi.org/10.1201/9781032702797-8 Edited Books Journal Articles Journal articles | 2025 Ahmad B; Ah-Kiow J; Tan B; Karri R; Pearce H, 2025, 'FLAG: Finding Line Anomalies (in RTL code) with Generative AI', ACM Transactions on Design Automation of Electronic Systems, 30, http://dx.doi.org/10.1145/3736411 Journal articles | 2025 Blocklove J; Pearce H; Karri R, 2025, 'Lowering the Bar: How Large Language Models Can be Used as a Copilot by Hardware Hackers', IEEE Security and Privacy, 23, pp. 27 - 37, http://dx.doi.org/10.1109/MSEC.2025.3600140 Journal articles | 2025 Blocklove J; Thakur S; Tan B; Pearce H; Garg S; Karri R, 2025, 'Automatically Improving LLM-based Verilog Generation using EDA Tool Feedback', ACM Transactions on Design Automation of Electronic Systems, 30, http://dx.doi.org/10.1145/3723876 Journal articles | 2025 Dick RP; Pearce H; Shang L; Yang F, 2025, 'Introduction to Special Issue on Large Language Models for Electronic System Design Automation', ACM Transactions on Design Automation of Electronic Systems, 30, http://dx.doi.org/10.1145/3746636 Journal articles | 2025 Feng R; Pearce H; Liguori P; Sui Y, 2025, 'CGP-Tuning: Structure-Aware Soft Prompt Tuning for Code Vulnerability Detection', IEEE Transactions on Software Engineering, 51, pp. 2533 - 2548, http://dx.doi.org/10.1109/TSE.2025.3591934 Journal articles | 2025 Mittal S; Pearce H; Yampolskiy M; Oromiehie E; Prusty BG, 2025, 'On cyber sabotage risks in automated manufacturing of advanced composites', Additive Manufacturing Letters, 13, http://dx.doi.org/10.1016/j.addlet.2025.100280 Journal articles | 2025 Pearce H; Ahmad B; Tan B; Dolan-Gavitt B; Karri R, 2025, 'Asleep at the Keyboard? Assessing the Security of GitHub Copilot's Code Contributions', COMMUNICATIONS OF THE ACM, 68, pp. 96 - 105, http://dx.doi.org/10.1145/3610721 Journal articles | 2024 Ahmad B; Thakur S; Tan B; Karri R; Pearce H, 2024, 'On Hardware Security Bug Code Fixes by Prompting Large Language Models', IEEE Transactions on Information Forensics and Security, 19, pp. 4043 - 4057, http://dx.doi.org/10.1109/TIFS.2024.3374558 Journal articles | 2024 Baird A; Panda A; Pearce H; Pinisetty S; Roop P, 2024, 'Scalable Security Enforcement for Cyber Physical Systems', IEEE Access, 12, pp. 14385 - 14410, http://dx.doi.org/10.1109/ACCESS.2024.3357714 Journal articles | 2024 Kande R; Pearce H; Tan B; Dolan-Gavitt B; Thakur S; Karri R; Rajendran J, 2024, '(Security) Assertions by Large Language Models', IEEE Transactions on Information Forensics and Security, 19, pp. 4374 - 4389, http://dx.doi.org/10.1109/TIFS.2024.3372809 Journal articles | 2024 Krishnamurthy P; Pearce H; Surabhi VR; Trujillo J; Karri R; Khorrami F, 2024, 'MUDDLE: Multi-Modal Dynamic Detector Loopback Evaluator to Expose Trojans in Zero-Trust PCB Systems', IEEE Micro, http://dx.doi.org/10.1109/MM.2024.3520996 Journal articles | 2024 Surabhi VR; Sadhukhan R; Raz M; Pearce H; Krishnamurthy P; Trujillo J; Karri R; Khorrami F, 2024, 'FEINT: Automated Framework for Efficient INsertion of Templates/Trojans into FPGAs', Information Switzerland, 15, http://dx.doi.org/10.3390/info15070395 Journal articles | 2024 Thakur S; Ahmad B; Pearce H; Tan B; Dolan-Gavitt B; Karri R; Garg S, 2024, 'VeriGen: A Large Language Model for Verilog Code Generation', ACM Transactions on Design Automation of Electronic Systems, 29, http://dx.doi.org/10.1145/3643681 Journal articles | 2024 Udeshi M; Krishnamurthy P; Pearce H; Karri R; Khorrami F, 2024, 'REMaQE: Reverse Engineering Math Equations from Executables', ACM Transactions on Cyber Physical Systems, 8, http://dx.doi.org/10.1145/3699674 Journal articles | 2023 Krishnamurthy P; Surabhi VR; Pearce H; Karri R; Khorrami F, 2023, 'Multi-Modal Side Channel Data Driven Golden-Free Detection of Software and Firmware Trojans', IEEE Transactions on Dependable and Secure Computing, 20, pp. 4664 - 4677, http://dx.doi.org/10.1109/TDSC.2022.3231632 Journal articles | 2023 Pearce H; Karri R; Tan B, 2023, 'High-Level Approaches to Hardware Security: A Tutorial', ACM Transactions on Embedded Computing Systems, 22, http://dx.doi.org/10.1145/3577200 Journal articles | 2023 Pearce H; Roop P, 2023, 'Decoding ChatGPT's 'impact' on the future of healthcare', Cancer Research Statistics and Treatment, 6, pp. 91 - 93, http://dx.doi.org/10.4103/crst.crst_84_23 Journal articles | 2022 Beckwith C; Naicker HS; Mehta S; Udupa VR; Nim NT; Gadre V; Pearce H; Mac G; Gupta N, 2022, 'Needle in a Haystack: Detecting Subtle Malicious Edits to Additive Manufacturing G-Code Files', IEEE Embedded Systems Letters, 14, pp. 111 - 114, http://dx.doi.org/10.1109/LES.2021.3129108 Journal articles | 2022 Mac G; Mandal M; Rastogi A; Gailani G; Pearce H; Gupta N, 2022, 'Application of micro-computed tomography for authentication of 3D printed composite parts', Additive Manufacturing Letters, 3, http://dx.doi.org/10.1016/j.addlet.2022.100104 Journal articles | 2022 Pearce H; Surabhi VR; Krishnamurthy P; Trujillo J; Karri R; Khorrami F, 2022, 'Detecting Hardware Trojans in PCBs Using Side Channel Loopbacks', IEEE Transactions on Very Large Scale Integration VLSI Systems, 30, pp. 926 - 937, http://dx.doi.org/10.1109/TVLSI.2022.3171174 Journal articles | 2022 Pearce H; Yanamandra K; Gupta N; Karri R, 2022, 'FLAW3D: A Trojan-Based Cyber Attack on the Physical Outcomes of Additive Manufacturing', IEEE ASME Transactions on Mechatronics, 27, pp. 5361 - 5370, http://dx.doi.org/10.1109/TMECH.2022.3179713 Journal articles | 2022 Srivastava H; Pearce H; Mac G; Gupta N, 2022, 'Determination of Fiber Content in 3-D Printed Composite Parts Using Image Analysis', IEEE Embedded Systems Letters, 14, pp. 115 - 118, http://dx.doi.org/10.1109/LES.2022.3140417 Journal articles | 2021 Mac G; Pearce H; Karri R; Gupta N, 2021, 'Uncertainty quantification in dimensions dataset of additive manufactured NIST standard test artifact', Data in Brief, 38, http://dx.doi.org/10.1016/j.dib.2021.107286 Journal articles | 2021 Pearce H; Yang X; Katzef M; Strøm TB; Roop PS, 2021, 'Designing Neural Networks for Real-Time Systems', IEEE Embedded Systems Letters, 13, pp. 94 - 97, http://dx.doi.org/10.1109/LES.2020.3009910 Journal articles | 2020 Pearce H; Pinisetty S; Roop PS; Kuo MMY; Ukil A, 2020, 'Smart I/O Modules for Mitigating Cyber-Physical Attacks on Industrial Control Systems', IEEE Transactions on Industrial Informatics, 16, pp. 4659 - 4669, http://dx.doi.org/10.1109/TII.2019.2945520 Working Papers Other Preprints | 2025 Ahmad B; Pearce H; Karri R; Tan B, 2025, LASHED: LLMs And Static Hardware Analysis for Early Detection of RTL Bugs, http://arxiv.org/abs/2504.21770v1 Preprints | 2025 Chang J; Li H; Pearce H; Sun R; Li B; Xue M, 2025, What's Pulling the Strings? Evaluating Integrity and Attribution in AI Training and Inference through Concept Shift, http://arxiv.org/abs/2504.21042v2 Preprints | 2025 Feng R; Pearce H; Liguori P; Sui Y, 2025, CGP-Tuning: Structure-Aware Soft Prompt Tuning for Code Vulnerability Detection, http://dx.doi.org/10.48550/arxiv.2501.04510 Preprints | 2025 Ghimire S; Chowdhury MA; Latibari BS; Mamun M; Carpenter JW; Tan B; Pearce H; Chakrabarty K; Satam P; Salehi S, 2025, Hardware Design and Security Needs Attention: From Survey to Path Forward, http://dx.doi.org/10.48550/arxiv.2504.08854 Conference Papers | 2025 Murphy L; Rizaldi A; Rossouw L; George C; Treloar J; Pearce H; Tanaka M; Heiser G, 2025, 'High-Fidelity Specification of Real-World Devices', in Plos 2025 Proceedings of the 13th Workshop on Programming Languages and Operating Systems, pp. 60 - 67, http://dx.doi.org/10.1145/3764860.3768335 Conference Papers | 2025 Pearce H, 2025, 'Experiences scaffolding a computer engineering project course to improve student outcomes', in Proceedings IEEE International Symposium on Circuits and Systems, http://dx.doi.org/10.1109/ISCAS56072.2025.11043521 Conference Papers | 2025 Qiu S; Wang M; Afsharmazayejani R; Shahmiri MM; Tan B; Pearce H, 2025, 'Towards LLM-based Root Cause Analysis of Hardware Design Fai",
  "content_length": 25421,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:46"
}