{
  "name": "Hamza Shakeel",
  "homepage": "https://pure.qub.ac.uk/en/persons/hamza-shakeel",
  "status": "success",
  "content": "Hamza Shakeel - Queen's University Belfast View Scopus Profile Hamza Shakeel Dr Reader, School of Electronics, Electrical Engineering and Computer ScienceMaterial and Advanced Technologies for HealthcareInstitute of Electronics, Communications & Information TechnologyEnergy Power and Intelligent Control https://orcid.org/0000-0002-0000-4621 Phone+44 (0)28 9097 4083EmailH.Shakeelqub.acuk Room 07.010 - Ashby TowerUnited Kingdom Accepting PhD StudentsPhD projects-Advanced Semiconductor Manufacturing -Glass Manufacturing using 3D printing 20112025 Research activity per year Personal profile Research InterestsMEMS based chemical sensors Microfluidics Functional Nanomaterials Micro-sensors Lab-on-a-chip Metrology Micro-gas chromatography separation columns and detectors MEMS based liquid and gas sampling MEMS oscillators Quartz crystal microbalance (QCM) sensors OtherAvailable Equipment Agilent Gas Chromatography System SRS QCM system SRS lock-in-amplifier SRS current and voltage pre-amplifiers SRS ion gauge Keysight Frequency Counter Function Generator Laser Doppler Vibrometer Fingerprint Dive into the research topics where Hamza Shakeel is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Columns (Structural) Engineering 100% Procedure Chemistry 71% Gas Chemistry 64% Stationary Phase Engineering 62% Silicon Dioxide Material Science 57% Sensor Material Science 55% Separation Gas Engineering 46% Resonator Material Science 41% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2018 2022 2023 2024 3 Finished 6 Active Projects per year R1904ECS: National Edge AI Hub for Real Data: Edge Intelligence for Cyber-disturbances and Data Quality Li, Z. (PI), Shakeel, H. (CoI) & Wang, H. (CoI)02/12/2024 → …Project: Research R1814ECS: Autonomous Multi-Format In-Situ Observatory for Atmospheric Carbon Dioxide and Methane Monitoring in Permafrost, Deserts & Wetlands (MISO)Sharma, V. (PI), Duong, T. Q. (CoI), Fahim, M. (CoI) & Shakeel, H. (CoI)16/02/2023 → …Project: Research Gas Sensor 100% Methane 100% Detection Limit 100% Multichannel 100% Polydimethylsiloxane 100% R1820ECS: Queen's University Belfast Core Equipment Call 2022Johnson, C. (PI), Shakeel, H. (CoI) & Woods, R. (CoI)11/01/2023 → …Project: Research Silicon Dioxide 100% Resonator 78% Sensor 62% Graphene 62% Fused Silica 62% R3471ECS: Wearable Dynamic Microsystem Sampler for Collecting Microbial VolatilesShakeel, H. (PI)17/11/2022 → …Project: Research R6779ECS: Highly efficient and sensitive photonic sensors for monitoring greenhouse gasesShakeel, H. (PI)13/09/2022 → …Project: Research Helium Plasma 100% View all 9 projects Research output Research output per year 2011 2013 2015 2023 2024 2025 19 Article 9 Paper 7 Conference contribution 1 Chapter (peer-reviewed) 2 More 1 Abstract 1 Poster Research output per year Research output per year Enhancing the performance of sintered fused silica cylindrical shell resonators through wet etchingAtwa, Y. & Shakeel, H., Jan 2025, In: IEEE Sensors Letters. 9, 1, 4 p., 2500304.Research output: Contribution to journal › Article › peer-review Open AccessFile Resonator 100% Fused Silica 100% Cylindrical Shell 100% Silicon Dioxide 100% Wet Etching 100% 4 Citations (Scopus) 53 Downloads (Pure) Improvement in detection limit of a non-dispersive infrared multi-channel gas sensor using metal-organic framework-coated preconcentratorJingqin, M., Ann Jose, S., Gaynullin, B., Wastine, B. & Shakeel, H., 13 Aug 2025, 2025 IEEE Sensors Applications Symposium (SAS): Proceedings. IEEE, 6 p. (IEEE Sensors Applications Symposium (SAS)).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Multichannel 100% Detection Limit 100% Gas Sensor 100% Methane 100% Metal-Organic Frameworks 100% 10 Downloads (Pure) Service-oriented evolution of modern AI: a position paperLi, Z., McKie, C., Wang, H., Shakeel, H. & Ranjan, R., 14 May 2025, (Accepted) Proceedings of the 2025 IEEE International Conference on Software Services Engineering . Institute of Electrical and Electronics Engineers Inc., 11 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Colorimetric readout based photoionization detector for gas chromatographsMao, J., Liu, L., Atwa, Y., Hou, J. & Shakeel, H., 07 May 2024, 2023 22nd International Conference on Solid-State Sensors, Actuators and Microsystems (Transducers): Proceedings. Institute of Electrical and Electronics Engineers Inc., p. 1121-1124 4 p. (International Conference on Solid-State Sensors, Actuators and Microsystems (Transducers): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Photoionization 100% Helium Plasma 33% 1 Citation (Scopus) Colorimetric readout based photoionization detector for gas chromatographsMao, J., Liu, L., Atwa, Y., Hou, J. & Shakeel, H., May 2024, In: IEEJ Transactions on Electrical and Electronic Engineering. 19, 5, p. 845-851 7 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Helium Plasma 100% 38 Downloads (Pure) View all 38 research outputs Prizes 3rd Prize Poster Presentation at Graduate Research Symposium, Blacksburg Shakeel, H. (Recipient), 2014Prize: Prize (including medals and awards) Research 100% Columns (Structural) 100% High Density 100% Stationary Phase 100% Early Career Travel Grant Shakeel, H. (Recipient), 07 Jan 2019Prize: National/international honour Activities Activities per year 2015 2018 2019 2025 11 Participation in workshop, seminar, course 8 Membership of peer review panel or committee 7 Publication peer-review 5 Membership of network 22 More 3 Hosting of external, non-academic visitor 3 Hosting an academic visitor 3 Invited talk 3 Oral presentation 2 Participation in conference 2 Other 2 Visiting an external academic institution 1 Editorial activity 1 Membership of external research organisation 1 Membership of national or international committees and working groups 1 Hosting a delegation or group Activities per year Wearable and Low power Sensors for Monitoring human breath and Skin VOCsShakeel, H. (Invited speaker)01 Oct 2025Activity: Talk or presentation types › Invited talk Engineering and Physical Sciences Research Council (External organisation)Shakeel, H. (Member)07 Jul 2025 → 08 Jul 2025Activity: Membership types › Membership of peer review panel or committee Microsystems Network (External organisation)Shakeel, H. (Member)Jun 2025 → …Activity: Membership types › Membership of network Academic Keynote: In-situ Monitoring of mechanical properties of thin films at High TemperatureShakeel, H. (Invited speaker)13 Dec 2024Activity: Talk or presentation types › Invited talk Low power sensors for biomedical and environmental monitoring applicationsShakeel, H. (Invited speaker)12 Nov 2024Activity: Talk or presentation types › Invited talk View all 53 activities Press/Media New slurry gas monitor shows promise after initial testingShakeel, H.02/09/20251 item of Media coveragePress/Media: Public Engagement Activities Researchers link quartz microbalance measurements to international measurement systemShakeel, H.22/02/20201 item of Media coveragePress/Media: Other Universe in the BalanceShakeel, H.12/02/20201 item of Media coveragePress/Media: Other Science Daily : New technology provides superior ability to rapidly detect volatile organic compounds (Published 13/04/2015). https://www.sciencedaily.com/releases/2015/04/150413091643.htmShakeel, H.13/04/20151 item of Media coveragePress/Media: Other",
  "content_length": 7957,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:48"
}