{
  "name": "Han Yu 0005",
  "homepage": "https://ist.sjtu.edu.cn/membersyuh",
  "status": "success",
  "content": "于晗 - 工业软件技术实验室 工业软件技术实验室 上海交通大学软件学院工业软件技术实验室（IST）建立于 2004 年，研究方向集中在企业工业软件技术及应用方面。 通过 SOA，信息集成，语义本体，网络计算机图形学等技术及理论的导入及应用，构造可配置、柔性、灵活的电子商务、电子政务、ERP 软件、MES 软件，满足政府、企业、公众的信息化应用需求。 介绍 新闻 实验组 成员 论文 项目 于晗 个人履历 助理教授，硕士生导师 2016年获得上海交通大学软件工程学士学位 2022年获得上海交通大学计算机科学与技术博士学位后留校任教 联系方式 邮箱：han_yu@sjtu.edu.cn 研究方向 工业软件 知识图谱 流计算 大模型应用 项目经历 上海市科技英才扬帆计划，上海市科委，2023-2026，主持 国家重点实验室开放基金项目，2023-2025，主持 基于变压器知识图谱的电力物联网算法研究，横向，2022-2024，主持 国家自然科学基金面上项目，国家自然基金委，2020-2023，参与 工业互联网创新发展工程，工信部，2018-2020，参与 山东省重点研发计划，山东省科技厅，2023-2026，参与 论文 [TII] Yu H, Da Xu L, Cai H, et al. A Stream Processing Framework Based on Linked Data for Information Collaborating of Regional Energy Networks[J]. IEEE Transactions on Industrial Informatics, 2021, 17(1): 179-188. [TSMC] Yu H, Cai H, et al. An Automated Metadata Generation Method for Data Lake of Industrial WoT Applications[J]. IEEE Transactions on Systems, Man, Cybernetics: Systems, 2022, 52(8): 5235-5248. [JOC] 于晗, 蔡鸿明, 张翼飞等. 基于增量式流处理的自适应群体划分方法[J]. 计算机学报, 2020, 12:2337-2351. [TETC] Yu H, Cai H, Tsai S, et al. Exploiting Entity Information for Robust Prediction Over Event Knowledge Graphs[J]. IEEE Transactions on Emerging Topics in Computing, 2025 (01): 1-12. [FGCS] Yu H, Cai H, Zhou J, et al. Data service generation framework from heterogeneous printed forms using semantic link discovery[J]. Future Generation Computer Systems, 2018, 79: 514-527. [TCC] Shen B, Yu H, Hu P, et al. A Cloud-Edge Collaboration Framework for Generating Process Digital Twin[J]. IEEE Transactions on Cloud Computing, 2024. [FGCS] Zhu M, Yu H, Liu Z, et al. An intelligent collaboration framework of IoT applications based on event logic graph[J]. Future Generation Computer Systems, 2022, 137: 31-41. [FGCS] Luo H, Cai H, Yu H, et al. A short-term energy prediction system based on edge computing for smart city[J]. Future Generation Computer Systems, 2019, 101: 444-457. [JIII] Yin Y, Xu B, Cai H, Yu H, et al. A Novel Temporal and Spatial Panorama Stream Processing Engine on IOT Applications[J]. Journal of Industrial Information Integration, 2020: 100143. [TAES] Shen B, Da Xu L, Cai H, Yu H, et al. Enhancing context-aware reactive planning for unexpected situations of on-orbit spacecraft[J]. IEEE Transactions on Aerospace and Electronic Systems, 2022, 58(6): 4965-4983. 获奖情况 2022年度福建省科技进步二等奖 2024年上海市图学学会优秀博士学位论文 2024年CCF计算机应用创新产品奖一等奖 2022年华为火花奖 2022-05-02 Comments",
  "content_length": 2379,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:46"
}