{
  "name": "Han Yu 0001",
  "homepage": "https://sites.google.com/site/hanyushomepage",
  "status": "success",
  "content": "Han Yu's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationHome Yu, Han (于涵) Position: Associate Professor Office: S3-B2c-94,  College of Computing and Data Science (CCDS) Nanyang Technological University (NTU) 50 Nanyang Avenue,  Singapore 639798 Lab: Trustworthy Federated Ubiquitous Learning (TrustFUL) Research Lab Email: han.yu{at}ntu{dot}edu{dot}sg My Google Scholar Page, My ORCID, NTU WebpageBiographyDr Han Yu is a tenured Associate Professor in the College of Computing and Data Science (CCDS), Nanyang Technological University (NTU), Singapore. Between 2018 and 2024, he was a Nanyang Assistant Professor (NAP) in CCDS, NTU. He has been a Visiting Scholar at the Department of Computer Science and Engineering, Hong Kong University of Science and Technology (HKUST) from 2017 to 2018. Between 2015 and 2018, he held the prestigious Lee Kuan Yew Post-Doctoral Fellowship (LKY PDF) at the Joint NTU-UBC Research Centre of Excellence in Active Living for the Elderly (LILY). Before joining NTU, he worked as an Embedded Software Engineer at Hewlett-Packard (HP) Pte Ltd, Singapore. He obtained his PhD from the School of Computer Science and Engineering, NTU in 2014. His work focuses on trustworthy federated learning. He has published over 350 research papers in leading international (e.g., AAAI, AAMAS, ACM MM, CIKM, CVPR, ECAI, EMNLP,  ICASSP, ICCV, ICDE, ICLR, ICME, ICML, ICWS, IJCAI, INFOCOM, KDD, NAACL, NeurIPS, SIGIR, SIGMOD, WWW), journals (e.g., PIEEE, TPAMI, TII, TIST, TKDE, TNNLS) and book chapters. He co-authored the book Federated Learning - the first monograph on the topic of federated learning. His research work has been recognized with multiple scientific awards. In 2021, he co-founded the Trustworthy Federated Ubiquitous Learning (TrustFUL) Research Lab (https://trustful.federated-learning.org/). He is an Associate Editor of IEEE TNNLS, IJCAI Sponsorship Officer General, and Vice Chair of the IEEE Computational Intelligence Society (CIS) Standards Committee. He is a Distinguished Member of CCF, and a Senior Member of AAAI and IEEE. For his continued contributions to the field of trustworthy AI and real-world impact in the society, he has been identified as one of the World's Top 2% Scientists (Career Long & Single Year), a Top Scholar - Lifetime in federated learning, and selected as one of the JCI Ten Outstanding Young Persons (TOYP) of Singapore. Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2495,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:47"
}