{
  "name": "Hanan Lutfi Lutfiyya",
  "homepage": "http://www.csd.uwo.ca/faculty/hanan",
  "status": "success",
  "content": "homepage Hanan Lutfiyya Professor Department of Computer Science The University of Western Ontario Middlesex College Building, MC 418 London, Ontario CANADA N6A 5B7 Phone: (519) 661-2111 (86888) Fax: (519) 661-3515 Email: hanan at csd dot uwo dot ca My Schedule Introduction I am a Professor in the Department of Computer Science at the University of Western Ontario.    I am currently the Department's Chair. Research Summary My research broadly falls into distributed systems and software engineering.  More specifically I am interested in systems management.  Systems management refers to the operation, administration and maintenance of a computing system. The goal is to ensure that the system behaves as expected with respect to availability, performance and security - commonly known as Quality of Service (QoS). We take system to include applications, services and devices.  The systems are distributed.  The software engineering aspect is with respect to how make software manageable. For more information on my research and a list of selected publications please go to my research lab's webpage. You can also check out my CV. If you are interested in being my graduate student please check this page. Selected Professional ActivitiesJournal of Network and Systems Management, Associate Editor IEEE Transactions on Network and Service Management, Associate Editor IFIP/IEEE International Operations and Management Symposium (NOMS 2014), Program Co-Chair IFIP/IEEE International Conference on Network and Service Management (CNSM 2010), Program Co-Chair NSERC Strategic Grants Committee,  Advanced Communications and Management of Information, Committee Member (2008-2011) Canada's Association of Information Technology Professionals (CIPS), Council Member IFIP/IEEE Workshop on Policies for Distributed Systems and Networks, Steering Committee Member IFIP/IEEE International Symposium on Integrated Network Management 2009, 2011 Program Committee Member ACM Symposium on Computer Human Interaction for Management of Information Technology 2008, Program Committee Member IBM Centre for Advanced Studies Conference 2008, 2010 Program Committee Member Consortium for Software Engineering Research (CSER) Meeting 2008, Local Organizer IFIP/IEEE International Workshop on Distributed Systems: Operations and Management 2008, Program Committee Member International Conference on Autonomic Infrastructure, Management and Security  2008, Program Committee Member Second International Workshop on Systems Development in SOA Environments 2008, Program Committee Member IFIP/IEEE International Conference on Management of Multimedia and Mobile Networks and Services 2008, Program Committee Member IEEE International Conference on Asia-Pacific Network Operations and Management Symposium 2008, Program Committee Member IFIP/IEEE Network Operations and Management Symposium 2008, Program Committee Member IEEE International Workshop on Business-Driven IT Management 2008, Program Committee Member Teaching The courses that I am teaching this year: CS3305: Operating Systems OtherQuotesFunny take on Computer Science Research (author unknown)",
  "content_length": 3137,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:54"
}