{
  "name": "Hanan Salam",
  "homepage": "http://www.hanansalam.com",
  "status": "success",
  "content": "Hanan Salam, Women in AI Hanan Salam Women in AI About Me Research Publications Teaching Public Speaking Press Contact Me Blog Download CV Copyright @hanansalam Hanan Salam I am a curious, passionate, ambitious researcher, professor and entrepreneur. My interests/passion include Artificial Intelligence, robotics, affective and cognitive computing, Human-Computer Interaction, psychology, psychiatry, neuroscience and education. I believe in the power of education and how it can change the world. I have co-founded Women in AI, an international organization whose mission is to increase female representation and participation in the field of AI. I am leading the education and research parts of the organization. Till October 2017 I worked as a research and developpement engineer at A.I.Mergence, a startup in robotics and artificial intelligence. My research activities and interests span the areas of Human-Robot Interaction, automatic understanding of human behaviour, social signal processing and affective computing. Academic Positions Present 2019 Associate Professor Emlyon, Lyon 2019 2011 Lecturer École supérieure d'ingénieurs Léonard-de-Vinci (ESILV), Paris University of Paris 8, Paris University of Pierre and Marie Curie, Paris INSA of Rennes, France University of Rennes 1, France 2016 2014 Postdoc fellow University of Pierre and Marie Curie, ISIR Education & Training Ph.D. 2013 Ph.D. in Human Computer Interaction Supelec Master 22010 Master of Control, Robotics, Signal and Image Processing Ecole Centrale de Nantes Engineering2010 Engineering degree in Computer Science and Telecommunication Lebanese university Research and art are my passion. With research we create the future, with art we create beauty...with both, we become independent from everything but our senses.. In the Press Honors, Awards and Grants 2011 FERA 2011, First Place Facial Expression Recognition and Analysis Challenge 2011, Santa Barbara, USA 2012 AVEC 2012, Second place 2nd International Audio/Visual Emotion, santa Monica, USA",
  "content_length": 2033,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:53"
}