{
  "name": "Hanbaek Lyu",
  "homepage": "https://hanbaeklyu.com",
  "status": "success",
  "content": "Hanbaek Lyu | Probability, combinatorics, and complex systems I am an assistant professor in the Department of Mathematics at University of Wisconsin – Madison, and also a member of the Institute for Foundations of Data Science. I am also affiliated with the department of computer science at UW-Madison. I work in the fields of discrete probability, matrix factorization, and machine learning. My research is broadly driven by questions related to understanding large discrete systems such as interacting particle systems, networks, and structured random matrices. I am currently organizing the probability seminar at UW-Madison. I am the principal investigator of the following grants: NSF Grant DMS-2206296 (2022-2025) on “Online Dictionary Learning for Dependent and Multimodal Data Samples: Convergence, Complexity, and Applications”; NSF Grant DMS-2010035 (2020-2023) on “Combinatorial and Probabilistic Approaches to Oscillator and Clock Synchronization”. Before joining UW-Madison, I was a Hedrick Assistant Professor at UCLA department of mathematics. I earned a Ph.D in mathematics at the Ohio State University in 2018. My thesis is on “Combinatorial and probabilistic aspects of coupled oscillators“. David Sivakoff was my thesis advisor. (Slides for my dissertation talk: thesis_talk) I earned my B.S. in mathematics at Seoul National University in South Korea. CV: CV_lyu Research Statement (1 page): statement_Lyu (Last updated in 2024) My collaborators are Janko Gravner, Lionel Levine, John Pike, Facudo Memoli, Matthew Junge, Eric Foxall, Michael Damron, Pasha Pylyavskyy, Arnab Sen, Tobias Johnson, Atsuo Kuniba, Masato Okado, Deanna Needell, Laura Balzano, Igor Pak, Sam Dittmer, Georg Menz,, Wenpin Tang, Joel Lewis, Sangchul Lee, Marek Biskup, Hanqin Cai, Yacoub Kureh, Chris Strohmeier, Mason Porter, Sumit Mukherjee, Ahmet Alacaoclu, Dohyun Kwon, and Jeongyeol Kwon. Doctoral students currently working with me: Yuchen Li (UW Math) William Powell (UW Math) Danny Duan (UW Math) Shuqi Bi (UW Math) Rahul Choudhary (UW CS) I am looking for self-motivated Ph.D students. Please send me your CV to hlyu@math dot wisc dot edu. Probability, combinatorics, and complex systems Hanbaek Lyu Sign up Log in Copy shortlink Report this content Manage subscriptions Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 2355,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:50"
}