{
  "name": "Handing Wang",
  "homepage": "https://sites.google.com/site/handingwanghomepage",
  "status": "success",
  "content": "Dr. Handing WangSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcome to Handing Wang's homepage!Handing Wang (王晗丁)Ph.D., Professor, School of Artificial Intelligence, Xidian University, ChinaEmail: hdwang@xidian.edu.cn or  wanghanding.patch@gmail.comNewsCall for participation: CEC 2024 Competition on \"Super Large-scale Multiobjective Optimization for Status Assessment of Measuring Equipment\"(Results submission deadline: 1st May 2024)Profile LinksGoogle ScholardblpResearchgateORCIDGitHubWOS Research InterestsComputational IntelligenceData-Driven Optimization and Surrogate-Assisted Evolutionary AlgorithmAdversarial Attack and DefenseTrustworthy AIReal-World ApplicationsEducation2006–2010: Bachelor of Engineering, School of Electronic Engineering, Xidian University, Xi’an. China2010–2015: Doctor of Engineering, Key Laboratory of Intelligent Perception and Image Understanding of Ministry of Education, Xidian University, Xi’an. ChinaWork Experiences2018-now: Professor, School of Artificial Intelligence, Xidian University, China2015–2018: Research Fellow, Department of Computer Science, University of Surrey, UK. Funded by an EPSRC grant (No. EP/M017869/1) on “Data-driven surrogate-assisted evolutionary fluid dynamic optimisation”.Visiting Experiences2012–2013: Visiting Student, CERCIA, University of Birmingham, UK. Funded by an EU FP7 IRSES grant (No.247619) on “Nature Inspired Computation and its Applications (NICaiA)”.2016/8: Visiting Staff, Optimization Group, University of Jyvaskyla, Finland.Funded by FiDiPro Project DeCoMo: \"Decision Support for Complex Multiobjective Optimization Problems''.Research Grants2024/1-2027/12:National Natural Science Foundation of China, Surrogate-assisted evolutionary optimization for adversarial attack and defence (PI).2020/1-2023/12:National Natural Science Foundation of China, Small data-driven evolutionary robust optimization (PI).2015/12-2016/5:Honda Research Institute Europe, Preference modeling and articulation in multi-objective optimization and decision-making (CI).2017/4-2018/3: NHS Endowment Research Grant, Modelling and optimizing complex aeromedical retrieval systems: a pilot study (CI).Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2237,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:53"
}