{
  "name": "Hang Qiu 0001",
  "homepage": "https://hangqiu.github.io",
  "status": "success",
  "content": "Hang Qiu · Hang Qiu I am an Assistant Professor of ECE and CSE at the University of California, Riverside, where I lead the Collaborative Intelligence Systems Lab (CISL) which innovates in cooperative robots and networked autonomous systems. I am also a faculty member of Center for Robotics and Intelligent Systems (CRIS), and a faculty member of Center for Environmental Research and Technology (CE-CERT). My lab’s mission is to infuse collaborative intelligence into today’s autonomous systems, breaking the barriers between robot intelligence, edge/cloud intelligence, and human intelligence, empowering them to communicate and cooperate to achieve capabilities beyond individuals. In this interdisciplinary effort, our research focuses on networked systems problems at the intersection of machine learning systems, robotics, cyber-physical systems, edge computing, and networking. Before joining UCR as faculty, I was a software engineer at Waymo, Google’s (Alphabet’s) self-driving car spin-off, a postdoctoral scholar in the Platform Lab at Stanford University, worked in Microsoft Research, IBM Research, and collaborated with General Motors for over five years. I received my Ph.D. from the Networked Systems Lab at University of Southern California, and my bachelor degree from the IIoT at Shanghai Jiao Tong University. Prospective Students: please check out our lab’s Join Us page. I may not be able to reply every email, but I do read all of them ;-) Hiring for Fall 2026: We are hiring from both ECE and CSE department, in the following areas. Vehicular/Robotic Networks, Edge Computing ML Systems, Systems for ML Recent News: Nov 2025: PGR accepted by ICNC ‘26 Nov 2025: Serving on the TPC of Mobicom’26, Mobisys’26, Associate Editor for ICRA’26, reviewer for ICLR’26, NeurIPS’25, CoRL’25 Oct 2025: New podcast episode with The Reference Desk at UCR Library Aug 2025: New NSF Ideas Lab Award to support our research (NSF TIP Updates, UCR News) Aug 2025: BEVCalib accepted by CoRL ‘25 Jun 2025: CMP accepted for presentation by IROS ‘25 May 2025: Invited article Cloud is Closer Than It Appears accepted by ICCCN’25 Mar 2025: SEE-V2X accepted by Sensys ‘25 Feb 2025: CATS accepted by TVT Feb 2025: Attended National Academy of Engineering Early Career Engineering Convocation (E2C2) Jan 2025: US DOT Intesrection Safety Challenge Award Stage 1B Jan 2025: New OASIS IFA Award to support our research Jan 2025: CMP accepted by RA-L Nov 2024: Serving on the TPC of Mobisys’25, Sensys ‘25, VehicleSec ‘25 Sep 2024: Harbor accepted by Sensys ‘24 Previous Updates Aug 2024: Serving on the TPC of Mobicom’25, Infocom’25, reviewer for AAAI’25 Aug 2024: Serving on the Organizing Committee of Mobisys’25, Sensys ‘25, HotMobile’25 Jul 2024: ELM accepted by ECCV’ 24 Jul 2024: Joined USDOT CARNATIONS Center Apr 2024: Serving on the TPC of NSDI’25, reviewer for ECCV ‘24, CoRL ‘24 Mar 2024: Co-organizing SoCal Robotic Symposium’24 Feb 2024: Co-organizing Mobisys’24 Workshop on Adaptive AIoT Systems Feb 2024: Co-organizing CVPR’24 Autonomous Driving Challenge (Workshop on Foundation Models for Autonomous Systems) Jan 2024: ARPA-I Intesrection Safety Challenge Award Jan 2024: WOMD-Lidar accepted by ICRA’24 Jan 2024: ARPA-I Intesrection Safety Challenge Award Jan 2024: Invited talk at the inaugural Trustworthy Autonomous Cyber-Physical Systems (TACPS) Oct 2023: Invited talk at ICTC’23 SPC Special Session Oct 2023: Serving on the TPC of Mobisys’24, VehicleSec’24, reviewer for CVPR’24 Sep 2023: New OASIS IFA Award to support our research Sep 2023: Affiliated with CE-CERT (News) and CRIS Jul 2023: Served as a guest editor for Vehicle Technology Magazine (VTM), special issue on vehicle metaverse Jul 2023: TPC member of INFOCOM’24, track co-chair for ICA3PP’23, reviewer for ICCV’23 May 2023: Invited talk Scene Understanding beyond the Visible at ICLR’23 SR4AD workshop Jan 2023: MCAL accepted by ICLR’ 23 Dec 2022: Served as a TPC member for Mobisys’23, AAAI’23 and ICPADS’23, reviewer for CVPR’23, ICRA’23, and CoRL’23 Sep 2022: Invited talk at the IEEE MFI’22 1st Cooperative Perception Workshop Aug 2022: ML-EXray received the Outstanding Paper Award from MLSys’22 Jun 2022: Crowdsourced image processing accepted to IEEE Transactions on Mobile Computing (TMC) Mar 2022: Coopernaut accepted by CVPR’ 22 Mar 2022: AutoCast accepted by Mobisys’ 22 Mar 2022: ML-EXray accepted as a talk at Kubernetes on Edge Day Europe 2022 Jan 2022: ML-EXray accepted by MLSys’ 22 Sep 2021: Teaching Stanford EE292D: ML on Embedded Systems with Prof. Katti, Prof. Asgar and Pete Warden for Fall 2021 Aug 2021: Organizing a tutorial on 3D sensing at IEEE SmartComp’21",
  "content_length": 4665,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:52"
}