{
  "name": "Hang Ma 0001",
  "homepage": "https://www.cs.sfu.ca/~hangma",
  "status": "success",
  "content": "Home - Hang Ma's Homepage News 2025-06 Our paper on Space-Time Graphs of Convex Sets for Multi-Robot Motion Planning received the best paper award at the RSS 2025 Workshop on Scalable and Resilient Multi-Robot Systems! Congratulations to Jingtao, Zining, and Lufan! 2025-06 Co-organized the 2025 Northwest Robotics Symposium, its first time in Canada! 2025-06 Our paper on Space-Time Graphs of Convex Sets for Multi-Robot Motion Planning was accepted to IROS 2025! Congratulations to Jingtao, Zining, and Lufan! 2025-05 Our paper on Reevaluation of Large Neighborhood Search for MAPF was accepted to SoCS 2025! Congratulations to Jiaqi and Yudong! 2025-05 Our research on MCPP was featured on SFU Scholarly Impact! 2025-04 Our article on MCPP on Grids with Path Deconfliction was accepted to IEEE Transactions on Robotics! Congratulations to Jingtao and Zining! 2024-07 Our paper on Tracking with Strided Memory Fusion for Consistent Vector HD Mapping was accepted to ECCV 2024! Congratulations to Jiaqi and other colleagues! 2024-06 Our paper on Mean-Field Control with Envelope Q-Learning for Moving Decentralized Agents in Formation was accepted to IROS 2024! Congratulations to Qiushi! 2024-06 Delivered a Master Class at SoCS 2024! 2024-02 Our paper on Multi-Robot Connected Fermat Spiral Coverage was accepted to ICAPS 2024! Congratulations to Jingtao! 2023-12 Our paper on Local Search for Large-Scale Multi-Robot Coverage Path Planning was accepted to AAAI 2024! Congratulations to Jingtao! 2023-08 Our paper on Mixed Integer Programming for Multi-Robot Coverage Path Planning was accepted to IEEE Robotics and Automation Letters! Congratulations to Jingtao! More... 2023-06 Our paper on Soft Actor-Critic with Heuristic-Based Attention for MAPF was accepted to IEEE Robotics and Automation Letters! Congratulations to Qiushi! 2023-04 Our paper on Large-Scale Multi-Robot Rearrangement was accepted to IEEE Robotics and Automation Letters! Congratulations to Baiyu! 2023-02 Paper accepted to ICAPS 2023! 2022-06 Paper accepted to IROS 2022! Congratulations to Qinghong! 2022-06 A Current Robotics Review article on Graph-Based Multi-Robot Path Finding and Planning is available! 2022-01 Paper accepted to ICRA 2022! Congratulations to Xinyi! 2021-08 Honored to receive funding from the Canada Foundation for Innovation's (CFI) John R. Evans Leaders Fund (JELF) to work on motion-coordination and human-robot interaction problems! Thank you, CFI! Read SFU FAS news and SFU CS news. 2021-08 Honored to receive an ICAPS Best Dissertation Award for my dissertation! 2021-08 Our demo on winning the 2020 Flatland Challenge won a ICAPS 2021 People's Choice Best System Demonstration Award! Our demo video is lots of fun! 2021-08 An Artificial Intelligence Journal paper on symmetry reasoning for Multi-Agent Path Finding is available! 2021-03 Honored to receive an IFAAMAS Victor Lesser Distinguished Dissertation Award Runner-Up for my dissertation! 2021-03 Paper accepted to ICRA 2021! 2021-02 Two papers accepted to ICAPS 2021! 2021-02 Honored to be featured in AAAI New Faculty Highlights! Watch my talk here. 2020-12 Advised Team An_Old_Driver won both Round 1 and Round 2 of the NeurIPS-20 Flatland Challenge (see our ICAPS paper for technical details)! 2020-01 Paper accepted to ICAPS 2020! 2020-01 Paper accepted to AAMAS 2020! 2019-12 Joined the School of Computing Science at Simon Fraser University as an Assistant Professor! 2019-11 Paper (joint work with Alibaba Cainiao) accepted to AAAI 2020! 2019-05 Paper accepted to IJCAI 2019! 2019-05 A SoCS-19 introductory paper on Multi-Agent Path Finding available here! 2019-03 Received a Technology Commercialization Award from the USC Stevens Center for Innovation! 2019-02 Paper accepted to ICAPS 2019! 2019-01 Two papers accepted to AAMAS 2019! 2018-11 Four papers accepted to AAAI 2019! 2018-04 Two papers accepted to IJCAI 2018! 2018-01 Papers accepted to AAMAS and ICAPS 2018! 2018-01 Talk at Sun Yat-Sen University! 2017-12 Talk at Cainiao, Alibaba! 2017-11 An IEEE Intelligent Systems paper is available! 2017-01 Paper accepted to AAMAS 2017! 2016-11 Paper accepted to AAAI 2017! 2016-06 Outstanding Paper Award in the ICAPS-16 Robotics Track! 2016-06 Talk at Sun Yat-Sen University! Less... About I am an Assistant Professor in Computing Science at Simon Fraser University and director of the Autonomous Intelligence and Robotics (AIRob) lab. My interests are mainly in artificial intelligence, robotics, and machine learning. Specifically, I am interested in topics on automated planning, multi-agent/robot systems, spatio-temporal and constraint reasoning, and applications of probabilistic methods and other topics related to graphs, combinatorial optimization, and algorithms. Research Opportunities I am always looking for self-motivated students at all levels. See my research highlights here or watch my AAAI-21 New Faculty Highlights talk below to learn more about my research. If you are interested in working with me on AI, robotics, and multi-agent/robot systems, please mention my name in your application to the SFU CS graduate program. Applicants should also refer to the SFU CS graduate program page for more information on the admission requirements and application deadlines. Eligible students with only a bachelor's degree are encouraged to apply directly to the PhD program. The SFU main campus is located on the Burnaby Mountain, 12 miles from downtown Vancouver. Recent Service Conference and Workshop Organization Co-Chair, International Symposium on Combinatorial Search (SoCS) 2021 Systems Demo Co-Chair, International Conference on Automated Planning and Scheduling (ICAPS) 2021 Co-Chair, 3rd International Workshop on Multi-Agent Path Finding at IJCAI 2019 Conference Area Chair and (Senior) Program Committee Member AAAI Conference on Artificial Intelligence (AAAI) 2022, 2021, 2020 International Joint Conference on Artificial Intelligence (IJCAI) 2022, 2021 (SPC), 2020, 2019 International Conference on Autonomous Agents and Multiagent Systems (AAMAS) 2021, 2020, 2019 International Conference on Automated Planning and Scheduling (ICAPS) 2022, 2021 International Conference of the Florida Artificial Intelligence Research Society (FLAIR) 2022, 2021 ACM/SIGGRAPH conference on Motion, Interaction and Games (MIG) 2021 International Symposium on Multi-Robot and Multi-Agent Systems (MRS) 2021 (AC) International Symposium on Combinatorial Search (SoCS) 2022, 2020 Journal Editing Guest Editor, SN Applied Sciences Topical Collection on Distributed Mobile Robotic Systems Teaching CMPT 417/827: Intelligent Systems (Fall 2021, Spring 2021, Spring 2020) Education 2014 to 2019, Ph.D. Computer Science, University of Southern California 2012 to 2014, M.Sc. Computer Science, McGill University 2010 to 2012, B.Sc. (First Class with Distinction) Computing Science, Simon Fraser University 2008 to 2010, B.Eng. Computer Science and Technology, Zhejiang University Miscellaneous My Erdös number is 2 : Paul Erdös 0 ↔ Craig Tovey 1 ↔ Hang Ma 2. Recent Publications GHOST: Solving the Traveling Salesman Problem on Graphs of Convex Sets. Jingtao Tang and Hang Ma. AAAI Conference on Artificial Intelligence (AAAI), Singapore, January 2026. [ pdf] [ abstract] [ bibtex] [ project] [ github] @inproceedings{TangAAAI26, author = {Jingtao Tang and Hang Ma}, title = {GHOST: Solving the Traveling Salesman Problem on Graphs of Convex Sets}, booktitle = {{AAAI} Conference on Artificial Intelligence}, pages = {(in print)}, year = {2026} } Space-Time Graphs of Convex Sets for Multi-Robot Motion Planning. Jingtao Tang, Zining Mao, Lufan Yang and Hang Ma. IEEE/RSJ International Conference on Intelligent Robots and System (IROS), Hangzhou, China, October 2025. [ pdf] [ abstract] [ bibtex] [ project] [ github] Best Paper Award at the RSS 2025 Workshop on Scalable and Resilient Multi-Robot Systems We address the Multi-Robot Motion Planning (MRMP) problem of computing collision-free trajectories for multiple robots in shared continuous environments. While existing frameworks effectively decompose MRMP into singlerobot subproblems, spatiotemporal motion planning with dynamic obstacles remains challenging, particularly in cluttered or narrow-corridor settings. We propose Space-Time Graphs of Convex Sets (ST-GCS), a novel planner that systematically covers the collision-free space-time domain with convex sets instead of relying on random sampling. By extending Graphs of Convex Sets (GCS) into the time dimension, ST-GCS formulates time-optimal trajectories in a unified convex optimization that naturally accommodates velocity bounds and flexible arrival times. We also propose Exact Convex Decomposition (ECD) to \"reserve\" trajectories as spatiotemporal obstacles, maintaining a collision-free space-time graph of convex sets for subsequent planning. Integrated into two prioritized-planning frameworks, ST-GCS consistently achieves higher success rates and better solution quality than state-of-the-art sampling-based planners—often at orders-of-magnitude faster runtimes—underscoring its benefits for MRMP in challenging settings. Project page: https://sites.google.com/view/stgcs. @inproceedings{TangIROS25, author = {Jingtao Tang and Zining Mao and Lufan Yang and Hang Ma}, title = {Space-Time Graphs of Convex Sets for Multi-Robot Motion Planning}, booktitle = {{IEEE/RSJ} International Conference on Intelligent Robots and System}, pages = {(in print)}, year = {2025} } Reevaluation of Large Neighborhood Search for MAPF: Findings and Opportunities. Jiaqi Tan*, Yudong Luo*, Jiaoyang Li and Hang Ma. (* Equal contribution) International Symposium on Combinatorial Search (SoCS), Glasgow, United Kingdom, August 2025. [ pdf] [ abstract] [ bibtex] [ github] (Position Paper) Multi-Agent Path Finding (MAPF) aims to arrange collision-free goal-reaching paths for a group of agents. Anytime MAPF solvers based on large neighborhood search (LNS) have gained prominence recently due to their flexibility an",
  "content_length": 17457,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:54"
}