{
  "name": "Hani Hagras",
  "homepage": "https://www.essex.ac.uk/people/hagra01400/hani-hagras",
  "status": "success",
  "content": "Hani Hagras | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Hani Hagras People Professor Hani Hagras Professor School of Computer Science and Electronic Engineering (CSEE) Email hani@essex.ac.uk Telephone +44 (0) 1206 873601 Location 5B.524, Colchester Campus Academic support hours Thursdays 11am-1pm Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Hani Hagras is a Professor of Artificial Intelligence, Director of Impact, Director of the Computational Intelligence Centre and Head of the Artificial Intelligence Research Group, in the School of Computer Science and Electronic Engineering, University of Essex, UK. He is a Fellow of Institute of Electrical and Electronics Engineers (IEEE), a Fellow of the Institution of Engineering and Technology (IET), Principal Fellow of the UK Higher Education Academy (PFHEA), Fellow of the Asia-Pacific Artificial Intelligence Association (AAIA) and Fellow of the Artificial Intelligence Industry Alliance (AIIA). His main research interests are in Explainable Artificial Intelligence (XAI) and Data Science with applications to Finance, Cyber Physical Systems, Neuroscience, Life Sciences, Uncertainty Management, Intelligent Robotics and Intelligent Control of Industrial Processes. He has authored more than 500 papers in international journals, conferences and books. He is amongst the top 2% of the most-cited scientists in the World (Scopus August 2024) and he is recognised by ScholarGPS as Highly Ranked Scholar- Lifetime. His work received funding from major research councils and industry. He holds eleven industrial patents in the field of Explainable AI. His research has won numerous prestigious international awards where he was awarded by the IEEE Computational Intelligence Society (CIS), the 2010 Outstanding Paper Award in the IEEE Transactions on Fuzzy Systems and the 2004 Outstanding Paper Award in the IEEE Transactions on Fuzzy Systems. He was also awarded the 2015 and 2017 Global Telecommunications Business award for his joint project with British Telecom. In 2016, he was elected as Distinguished Lecturer by the IEEE Computational Intelligence Society. His work has also won best paper awards in several leading international conferences including the 2014 and 2006 IEEE International Conference on Fuzzy Systems, the 2012 UK Workshop on Computational Intelligence and the 2016 International Conference of the BCS SGAI International Conference on Artificial Intelligence. He was awarded by the IEEE Computational Intelligence Society (CIS) the 2011 IEEE CIS Outstanding Chapter Award. In 2017, he was awarded by the University of Essex, the 2017 best Research impact award for his work with British Telecom. He acted as the Principal Investigator for a project which was awarded by the UK Technology Strategy Board, the 2011 UK Best Knowledge Transfer Partnership for London and the East Region. He also acted as the Principal Investigator for a project which was awarded the 2009 Lord Stafford Achievement in Innovation Award for East of England. In 2010, he Led a Research Students team to win the First place in the RoboCup 2010. In 2007, he was Shortlisted by the Times Higher Education supplement (THES) for the UK Young researcher of the year award. He is Associate Editor of many journals including IEEE Transactions on Fuzzy Systems, IEEE Transactions on Artificial Intelligence, Knowledge Based Systems, Cognitive Computations and others. He served as the General and Programme Chair of numerous major international conferences where he served as the General co-Chair of the 2007 IEEE International Conference on Fuzzy Systems, and Programme Chair of the 2021 and 2017 IEEE International Conference on Fuzzy Systems as well as many other conferences Qualifications PhD, Computer Science University of Essex, (2000) Msc in Electrical Engineering University of Alexandria, (1996) Bsc in Electrical Engineering University of Alexandria, (1994) Appointments University of Essex Director of Impact, School of Computer Science and Electronic Engineering, University of Essex (1/7/2021 - present) Director of Research, School of Computer Science and Electronic Engineering, University of Essex (1/7/2017 - 1/7/2021) Head of the Artificial Intelligence Research Group, School of Computer Science and Electronic Engineering, University of Essex (1/6/2019 - present) Director of the Computational Intelligence Centre, School of Computer Science and Electronic Engineering, University of Essex (10/9/2007 - present) Director Impact, School of Computer Science and Electronic Engineering, University of Essex (1/10/2015 - 1/7/2017) Senior Lecturer (Associate Professor), Department of Computer Science, University of Essex (1/8/2003 - 1/6/2006) Lecturer (Assistant Professor), Department of Computer Science, University of Essex (1/1/2001 - 1/8/2003) Other academic Lecturer (Assistant Professor), Department of Computer Science, University of Hull (1/3/2000 - 1/1/2001) Research and professional activities Research interests Computational Intelligence (Fuzzy Logic,Neural Networks and Evolutionary Computation ) Key words: Fuzzy Logic Open to supervise Explainable Artificial Intelligence (XAI) Current research Robotics and Intelligent Control Explainable Artificial Intelligence (XAI) Data Science Teaching and supervision Current teaching responsibilities Intelligent Systems and Robotics (CE801) Neural Networks and Deep Learning (CE889) Current supervision Ashish Bhatia Thesis title: Explainability and Efficiency in Fuzzy Logic: Frameworks for Temporal Classification, Monotonicity, and Hybrid Predictive Modelling Degree subject: Computer Science Degree type: Doctor of Philosophy Mahmoud Alfayan Degree subject: Computer Science Degree type: Doctor of Philosophy Jera Gamal Gamal Lamey Bekheet Makar Degree subject: Artificial Intelligence Degree type: Doctor of Philosophy Adham Ahmed Hosney Mohamed Ahmed Aboulkheir Degree subject: Artificial Intelligence Degree type: Doctor of Philosophy Previous supervision Khizra Maqsood Thesis title: Explainable Artificial Intelligence for the Identification of Novel Mammalian Enhancers and Their Epigenetic Code Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 31/7/2025 Liam Joseph Beasley Thesis title: Explainable Strategic Optimisation of Grand Scale Problems Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 20/2/2024 Kabo Elliot Pule Thesis title: Multi-Objective Resource Optimization of Unmanned Aerial Vehicles and Internet of Things Devices in Time Critical Applications Using Evolutionary Approaches Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 3/1/2024 Shreyas Jagdish Upasane Thesis title: An Incremental Self-Learning Interval Type-2 Fuzzy Logic Based Explainable Approach to Predictive Maintenance Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 6/11/2023 Hugo Leon Garza Thesis title: An Explainable Ai Approach to Process Data in Mixed Reality Environments for Field Service Operations Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 13/7/2023 Lewis Henry Frederick Veryard Thesis title: Type 2 Fuzzy Single and Multi-Objective Optimisation Systems for Telecommunication Capacity Planning Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 16/9/2022 Mehrin Kiani Thesis title: Explainable Artificial Intelligence for Functional Brain Development Analysis: Methods and Applications. Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 6/7/2022 Jareth Charles Wolfe Thesis title: An Explainable Artificial Intelligence Approach for Decoding the Enhancer Histone Modification Code and Identification of Novel Enhancers Degree subject: Biological Sciences Degree type: Doctor of Philosophy Awarded date: 11/4/2022 Ravikiran Chimatapu Thesis title: An Explainable Artificial Intelligence Approach Based on Deep Type-2 Fuzzy Logic System Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 21/7/2021 Emmanuel Ferreyra Olivares Thesis title: A Type-2 Fuzzy Logic Based Goal-Driven Simulation for Optimising Field Service Delivery Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 23/3/2021 Wei Song Thesis title: A Fuzzy Logic-Based System for Soccer Video Scenes Classification Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 14/2/2019 Andrew John Starkey Thesis title: Many-Objective Genetic Type-2 Fuzzy Logic Based Workforce Optimisation Strategies for Large Scale Organisational Design Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 7/3/2018 Akeem Aderibigbe Adebomehin Thesis title: Ultra-Wideband Ieee802.15.4A Cognitive Localization Methods for the 5G Environment. Degree subject: Computing ",
  "content_length": 85344,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:56"
}