{
  "name": "Hank Hoffmann",
  "homepage": "http://people.cs.uchicago.edu/~hankhoffmann",
  "status": "success",
  "content": "Hank Hoffmann, CS@U-Chicago News | Research | Publications     | Awards | Equity, Diversity, and Inclusion Statement Henry (Hank) Hoffmann Professor Liew Family Chair Department of Computer Science Email: hankhoffmann @ cs.uchicago.edu For Appointments Email: hsantos@uchicago.edu Phone: Please Email John Crerar Library 219 5730 S. Ellis Chicago, IL 60637 CV: [pdf] Bio: [html] Research Statement: [pdf] Teaching Statement: [pdf] Research Research Areas : Self-aware & Adaptive Computing, Computer Systems, Computer Architecture, Embedded Systems (UChicago Systems Group) Research Interests: Modern computer systems have to meet goals in multiple---often competing---dimensions; e.g., high performance and low energy consumption. This creates a great burden on programmers who must be experts in both their application domain and in the myriad system issues that affect goals like power, energy, reliability, performance, and more. To alleviate this burden, I study ways to build self-aware computing systems that understand high-level goals and automatically adapt their behavior to meet those goals optimally. This is interdisciplinary work covering traditional areas, like operating systems and computer architecture, as well as new areas, like control theory and machine learning applied to computer system management and optimization. Recently, I have turned my focus to using these techniques to control machine learning and AI. In other words, I am now building learning systems which dynamically adapt their internal structure and resource usage to meet accuracy, energy, performance, and (most recently) security goals at inference time. Current Students: Jerry Ding, Ryien Hosseini, Pouya Gholami, Trenton Wesley, Mingyuan Xiang, Vasco Xu Current Postdoc: Anwesha Das Alumni: Tejas Kannan, PhD 2023 Ahsan Pervaiz, PhD 2023 Yuliana Zamora, PhD 2022 Muhammad Santriaji, PhD 2022 Yi Ding, PhD 2020 Anne Farrell, PhD 2020 Bernard Dickens, PhD 2020 Saeid Barati, PhD 2020 Huazhe Zhang, PhD 2019 [thesis, masters] Gökalp Demirci, PhD 2019 [thesis] Zhixuan Zhou, PhD 2018 [thesis] Connor Imes, PhD, 2018 [thesis] Nikita Mishra, PhD 2017 [thesis] Ziyi Zhang, MS, 2025 Will Kong, MS 2021 Ivana Marincic, MS 2020 Lee Ehudin, BS/MS 2017 Tristan Rasmussen, BS/MS 2015 Research Statements through the Years: [2023] [2017] [2015] News We won the Most Influential Paper Award from SEAMS 2025 for our paper \"Control Theory Meets Software Engineering\" from SEAMS 2015. I seem to write op-eds now. Here is one in the Maroon about why I (and Mike Franklin and Dan Nicolae chose to build CS and Data Science at the University of Chicago: A Bet Worth Placing. Becca Willett and I wrote an op-ed (in Fortune) about how important Federal Funding is to AI development. It is available from Fortune and from our department website . I am the chair of the UChicago CS deparment. That escalated quickly. My former student, Yi Ding, is starting as a faculty member at Purdue ECE in the fall! Congrats, Yi! I have been promoted to Full Professor. Apologies to all former students who had to put up with less than full professing up until now. Thanks to the hard work of Tejas Kannan, he found a vulnerability that landed him and several collabortors in the Samsung Security (for SmartTV, Audio and Display) Hall of Fame ( link ) Loop Perforation wins FSE Test of Time Honorable Mention. It is funny to think about how much reviewers hated that paper so many years ago. Our RTAS paper won an Outstanding Paper Award! Congrats to Tejas Kannan, the first author on this paper. I am the chair (and founder) of our department's EDI committee. Yi Ding has received a CRA Computing Innovation Fellowship to support a postdoc with Michael Carbin at MIT! Yi Ding was selected for Rising Stars 2020! After three trips to the emergency room, two patellar tendon ruptures, two dislocations, 37 stitches, and 33 staples, I finally earned a black belt in Tang Soo Do. I just won a PECASE (Presidential Early Career Award for Scientists and Engineers). Yulie Zamora received a National Physical Science Consortium Fellowship. Congrats, Yulie! Our ICAC 2019 paper won the Karsten Schwann Best Paper Award! Huazhe (Harper) Zhang's Supercomputing 2019 paper has been nominated for both Best Student Paper and Best Paper! Our CALOREE paper from ASPLOS 2018 was selected as an IEEE Micro Top Picks Honorable Mention. Here is the summary we submitted: [pdf]. Academic Career Liew Family Chair of the Department of Computer Science, University of Chicago, 2024- Chair, Department of Computer Science, University of Chicago, 9/2023-12/2023 Professor, University of Chicago, 2023- Associate Professor, University of Chicago, 2018-2023 Assistant Professor, University of Chicago, 2013-2018 Ph.D., MIT, 2013 Dissertation: \"SEEC : a framework for self-aware management of goals and constraints in computing systems\" Advisors: Anant Agarwal and Srinivas Devadas S.M., MIT, 2003     Thesis: \"Stream Algorithms and Architectures\" Advisor:Anant Agarwal B.S. with highest honors and highest distinction, UNC-Chapel Hill, 1999 Professional Career Co-Founder Config Dynamics, 2019- Design Engineer, Tilera Corporation, 2005-2008 Associate Staff, MIT Lincoln Laboratory, 2003-2004 Assistant Staff, MIT Lincoln Laboratory, 1999-2003 Recent Publications As recorded by DBLP As recorded by Google Scholar 2025: Sketch-Augmented Features Improve Learning Long-Range Dependencies in Graph Neural Networks [NeurIPS 2025] Gambler: Adaptive Sampling Under Energy Budgets [EWSN 2025] Flexible Windowing for Correlation-Aware Ranking in Anomalous Environments [ICDM 2025] Position Paper: Voltage is not Energy Consumption [ENSsys@SenSys 2025] Lupe: Integrating the Top-down Approach with DNN Execution on Ultra-Low-Power Devices [SenSys 2025] [preprint] A Deep Probabilistic Framework for Continuous Time Dynamic Graph Generation [AAAI 2025] Quality Measures for Dynamic Graph Generative Models [ICLR 2025, Spotlight Paper] 2024: MobilePoser: Real-Time Full-Body Pose Estimation and 3D Human Translation from IMUs in Mobile Consumer Devices [UIST 2024] CachGen KV Cache Compression and Streaming for Fast Larg Language Model Serving [SIGCOMM 2024] Automatic and Efficient Customization of Neural Networks for ML Applications [OSDI 2024] Acoustic Keystroke Leakage on Smart Televisions [NDSS 2024, Artifact Badge (Available, Functional, Reproduced)] (This work got us into the Samsung Security Hall of Fame) 2023: Prediction Privacy in Distributed Multi-Exit Neural Networks: vulnerabilities and Solutions [CCS 2023] Run-Time Prevention of Software Integration Failures of Machine Learning APIs [OOPSLA 2023] DPS: Adaptive Power Management for Overprovisioned Systems [Supercomputing 2023] CAFQA: A classical simulation bootstrap for variational quantum algorithms [ASPLOS 2023] Navigating the dynamic noise landscape of variational quantum algorithms with QISMET [ASPLOS 2023] 2022: Protecting Adaptive Sampling from Information Leakage on Low-Power Sensors [ASPLOS 2022, Artifact Badge (Available, Functional, Reproduced)] NURD: Negative-Unlabeled Learning for Online Datacenter Straggler Prediction [MLSys 2022] GOAL: Supporting General and Dynamic Adaptation in Computing Systems [Onward! 2022] Automated Testing of Software that Uses Machine Learning APIs [ICSE 2022] AgileCtrl: A Self-adpative Framework for Configuration Tuning [FSE 2022] Penelope: Peer-to-peer Power Management [ICPP 2022] Artificial Reasoning Towards Goal-Oriented Adaptive Arrays of Sensors [CogMI 2022] 2021: Generalizable and Interpretable Learning for Configuration Extrapolation [FSE 2021] Proxima: Accelerating the Integration of Machine Learning in Atomistic Simulations [ICS 2021] Exploiting Long-Distance Interactions and Tolerating Atom Loss in Neutral Atom Quantum Architectures [ISCA 2021] Budget RNNs: Multi-Capacity Neural Networks to Improve In-Sensor Inference under Energy Budgets [RTAS 2021, Artifact Badge, Outstanding Paper] Neighborhood Street Activity and Greenspace Usage Uniquely Contribute to Predicting Crime [npj Urban Sustainability, Nature Research Journal 2021] Are Machine Learning Cloud APIs Used Correctly? [ICSE 2021, Artifact Badge] Do Users Have Contextual Preferencesfor Smartphone Power Management? [UMAP 2021] 2020: LinnOS: Predictability for Unpredictable Flash Storage [OSDI 2020] Orthogonalized SGD and Nested Architectures for Anytime Neural Networks [ICML 2020] Embodied Self-Aware Computing Systems [Proc. of the IEEE 2020] Vision Paper: Grand Challenges in Resilience: Autonomous System Resilience through Design and Runtime Measures [OJCS 2020] ALERT: Accurate Learning for Energy and Timeliness [USENIX ATC 2020] Server-Driven Video Streaming for Deep Learning Inference [SIGCOMM 2020] Statically Inferring Performance Properties of Software Configurations [Eurosys 2020] A Simple Cache Coherence Scheme for Integrated CPU-GPU Systems [DAC 2020] SeeSAw: Optimizing Performance of In-Situ Analytics Applications under Power Constraints [IPDPS 2020] 2019: Partial Compilation of Variational Algorithms for Noisy Intermediate-Scale Quantum Machines [MICRO 2019] PoDD: Power-capping Dependent Distributed Applications [Supercomputing 2019] Generative and Multi-phase Learning for Computer Systems Optimization [ISCA 2019] Optimized Compilation of Aggregated Instructions for Realistic Quantum Computers [ASPLOS 2019] Proteus: Language and Runtime Support for Self-Adaptive Software Development [IEEE Software] CoPPer: Soft Real-time Application Performance Using Hardware Power Capping [ICAC 2019] Best Paper! A Simple Cache Coherence Scheme for Integrated CPU-GPU Systems [tech report] 2018: A divide and conquer algorithm for DAG scheduling under power constraints [Supercomputing 2018] Understanding and Auto-Adjusting Performance-Sensitive Configurations [ASPLOS 2018] [preprint] StrongBox: Confidentiality, Integrity, and Performance using Stream Ciphers for Full Drive Encryption [ASPLOS 2018] [preprint] CALOREE: Learning Control for Pre",
  "content_length": 19104,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:59"
}