{
  "name": "Hannah Bast",
  "homepage": "https://ad.informatik.uni-freiburg.de/staff/bast",
  "status": "success",
  "content": "Hannah Bast — Professur für Algorithmen und Datenstrukturen Website durchsuchen nur im aktuellen Bereich Erweiterte Suche… Startseite Schnellzugriff News Team Gruppiert nach Funktion Hannah Bast Publications Curriculum Vitae Personal Heike Hägle Frank Dal-Ri Patrick Brosi Matthias Hertel Johannes Kalmbach Claudius Korzen Axel Lehmann Natalie Prange Björn Buchhold Elmar Haussmann Publikationen Niklas Schnelle Theresa Klumpp Markus Näther Sebastian Walter Christoph Ullinger Robin Textor-Falconi Publikationen Bachelor- und Masterarbeiten Bachelor- und Masterprojekte Lehre Oberseminar Demos Projekte Kontakt Anfahrt Lageplan Datenschutzerklärung News Team Gruppiert nach Funktion Hannah Bast Publications Curriculum Vitae Personal Heike Hägle Frank Dal-Ri Patrick Brosi Matthias Hertel Johannes Kalmbach Claudius Korzen Axel Lehmann Natalie Prange Björn Buchhold Elmar Haussmann Niklas Schnelle Theresa Klumpp Markus Näther Sebastian Walter Christoph Ullinger Robin Textor-Falconi Publikationen Lehre Demos Projekte Kontakt Datenschutzerklärung English Deutsch Sektionen News Team Publikationen Lehre Demos Projekte Kontakt Datenschutzerklärung Professur für Algorithmen und Datenstrukturen Albert-Ludwigs-Universität Freiburg Sektionen News | Team | Publikationen | Lehre | Demos | Projekte | Kontakt | Datenschutzerklärung Sie sind hier: Startseite › Team › Hannah Bast Info Hannah Bast Leitung Koordinaten Georges-Köhler-Allee 51 79110 Freiburg im Breisgau Gebäude, Raum 051 02 028 bast@informatik.uni-freiburg.de +49 761 203-8163 (Tel) +49 761 203-8162 (Fax) Sprechzeiten Nach Vereinbarung       I am a full professor at the department of computer science of the University of Freiburg, and head of the Chair of Algorithms and Data Structures. On the navigation panel on the left, you find my list of publications and a short CV. For correct results in \"Publish or Perish\", search for \"H Bast\" and exclude \"TH Bast\", \"HJ Bast\", \"PH Bast\", \"HD Bast\". My general research interest is aptly described by the words \"applied algorithmics\", which are explained on the entry page of our chair. Specific topics I am currently interested in and actively researching are route planning algorithms, all aspects of information retrieval (index building, query processing, user interfaces, whole information systems), and natural language processing, with and without deep learning. Try one of our latest demos. All of my lectures are recorded. All recordings, slides, exercise sheets, code, datasets, exams, and the results of the official teaching evaluations are available online. You find an overview on our Teaching Wiki . Here is my PhD thesis, please feel free to check for plagiarism. Start Footer Übersicht Kontakt Impressum A A A Copyright © 2025 Universität Freiburg Benutzerspezifische Werkzeuge Anmelden",
  "content_length": 2810,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:58"
}