{
  "name": "Hannah Dee",
  "homepage": "https://www.aber.ac.uk/en/cs/staff-profiles/listing/profile/hmd1",
  "status": "success",
  "content": "Staff profiles  :\t\tDepartment of Computer Science ,\t\tAberystwyth UniversityDr Hannah Dee BSc, MA, PhD, PGCTHE University of Leeds Senior Lecturer Department of Computer Science Contact Details Email: hmd1@aber.ac.uk ORCID: 0000-0003-2573-9541 Office: E44, Llandinam Building Phone: +44 (0) 1970 621577 Personal Website: http://users.aber.ac.uk/hmd1 Google Scholar: https://scholar.google.co.uk/citations?user=qu8qeygAAAAJ Research Portal Profile Personal Pronouns: any Profile Hannah has a BSc in Cognitive Science (1996), an MA in Philosophy (1998) and a PhD in Computing (2005) all from the University of Leeds. She is a women in computing activist: she founded the BCSWomen Lovelace Colloquium, a national conference for women undergraduate and taught MSc students in computer science, in 2008 and has been chair or deputy chair of the event every year since. She was on the committee of BCSWomen 2007-2023. Hannah appeared in the Computer Weekly women in IT top 50 four years running, and was inducted into their \"Hall of Fame\" in 2018. She was awarded the BCS Meritorious Service award for voluntary service across BCS Mid Wales and BCSWomen, 2016. She was a holder of a Suffrage Science award 2018-2020.  In 2024 she was awarded an MBE in the King's Birthday Honours list for services to technology and women in the information technology sector.She has conducted research into applied computer vision, the detection of shadows and reasoning about shadows, and student attitudes to the study of computer science. Before coming to Aberystwyth, Hannah held postdoctoral positions in Grenoble (France), Leeds, and Kingston upon Thames. Now her research efforts centre on diversity and student teaching matters.Note: Hannah is part-time and usually works Monday-Wednesday-Friday. Teaching Module Coordinator CSM3120 - Modelling, Managing and Securing Data CC10120 - Datblygu i'r We a Diogelwch Gwybodaeth CS10120 - Web Development and Information Security Lecturer PGM1610 - Public Engagement and Impact CS39440 - Major Project CSS0760 - Sandwich Year Coordinator CSM3120 - Modelling, Managing and Securing Data CS10120 - Web Development and Information Security CC10120 - Datblygu i'r We a Diogelwch Gwybodaeth Moderator CS22220 - Software Engineering for the Web CS22120 - Software Engineering CS18120 - Study Skills for Computer Science CS10220 - Introduction to Computer Infrastructure Hannah enjoys teaching and has received several teaching awards since arriving in Aberystwyth:Senior fellowship of the HEA (SFHEA), 2018Student led teaching awards (SLTA), highly commended, technology enhanced learning category, 2016Exemplary Course Awards (ECA), highly commended for Computer Vision, 2015Exemplary Course Awards (ECA), highly commended for Client Side Graphics module, 2014Student led teaching awards (SLTA), highly commended, teaching through technology category, 2013Aberystwyth University Learning and Teaching Fellowship (AULTF), 2012 Research Groups Athena SWAN Publications Dee, H, Herman, C & Arnold, G 2024, Gendered microbehaviours in the UK computer science student community. Conference of Professors and Heads of Computing. <https://cphc.ac.uk/wp-content/uploads/2024/09/Aberystwyth-CPHC_Microbehaviours_project_report.pdf>Arnold, G, Dee, H, Herman, C, Moore, S, Palmer, A & Shah, S 2021, Women in Tech: A practical guide to increasing gender diversity and inclusion. British Computer Society.Seck, A, Dee, H, Smith, W & Tiddeman, B 2020, '3D surface texture analysis of high‐resolution normal fields for facial skin condition assessment', Skin Research and Technology, vol. 26, no. 2, pp. 169-186. 10.1111/srt.12793Smith, W, Seck, A, Dee, H, Tiddeman, B, Tenenbaum, J & Egger, B 2020, A Morphable Face Albedo Model. in 2020 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR). Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition, pp. 5010-5019, IEEE/CVF Conference on Computer Vision and Pattern Recognition, Seattle, United States of America, 14 Jun 2020. 10.1109/CVPR42600.2020.00506Dee, H, Freixenet, J, Cufi, X, Muntaner Perich, E, Poggioni, V, Marian, M & Milani, A 2020 'Encouraging early mastery of computational concepts through play' arXiv. <https://arxiv.org/abs/2005.03930>More publications on the Research Portal",
  "content_length": 4308,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:57"
}