{
  "name": "Hanna Suominen",
  "homepage": "https://cs.anu.edu.au/people/hanna-suominen",
  "status": "success",
  "content": "Hanna Suominen | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Interests Prof Hanna Suominen, MSc, PhD, Docent, MEdL, SFHEA (Australian National University, ANU) is at the forefront of accelerating health impact through Machine Learning (ML) and Natural Language Processing (NLP). Research Hanna has almost 20 years’ experience and world-class excellence of working at the interface between technology, health sciences, and education. She has discovered methods to detect Parkinsonian biomarkers based ML on human voice that are imperceptible to a neurologist; developed search engines and smart sports-sensors used by the Turku University Hospital and Australian Institute of Sports; co-invented the smart PostAc® job search-engine; and co-chaired the 2012-2021 Conference and Labs of the Evaluation Forum eHealth lab. Her work has been published in over 200 papers with about 3,200 citations; received ML/NLP-method, research, teaching, and business awards; and won competitive funding of over $33 million from 2018 alone. She is passionate about co-producing ML and NLP research, translating it into real-life impact as real products with Konan Medical, among others, and concurrently educating a generation of workforce empowered by these technologies. Biography Prof Hanna Suominen is the Associate Director (Neuroinformatics) of the ANU John Eccles Institute of Neuroscience and the Co-chair/Executive Leader (Computing and Engineering) of Our Health in Our Hands (OHIOH), the inaugural ANU Grand Challenge Program. She previously worked for the ANU School of Computing (SOCO) as its first Associate Director (Engagement & Impact), establishing the portfolio. Before this, she was the Leader of the Theory and Applications in Multimodal Pattern Analysis (TAMPA) and NLP teams at Data61 of the Commonwealth Scientific and Industrial Research Organisation (CSIRO) and the National Information and Communications Technology Australia (NICTA), respectively. Her MSc (Applied Math, 2005), PhD (Computer Science (CS), 2009), and Docent (a.k.a. adjunct professor, CS, 2013) were obtained from the University of Turku, Finland, followed by her Senior Fellowship of Higher Education Association (2019) from the ANU and MEdL (Curriculum & Pedagogy, 2020) from Monash University. Activities & Awards Since 2006, Hanna has received about 20 prizes/awards for academic and research excellence and in recognition of my career progression. Most recently, she received the following five awards: The best reviewer award for the Resources and Evaluation track of the 2023 Conference Empirical Methods on NLP (EMNLP): the nomination and selection for this scientific service award were done by Area Chairs for your track and the EMNLP Programme Committee Chairs on the basis of the high quality of my reviews, my engagement with the authors, and the timely submission of my final scores. The 2023 Annual Research Australia Awards in Health and Medical Research: smart-sensing and sense-making systems by the ANU Our Health in Our Hands (OHIOH) grand challenge to facilitate the deep personalisation of health and medicine for sustainable and equitable healthcare were recognised as one of the eight finalists for the Digital Health Technology category. MS Australia 50 Years President’s Medal in 2023: the ANU OHIOH grand challenge as a passionate, hard-working group of people working in Australia to ultimately find a cure for multiple sclerosis (MS). The 60th Annual Meeting of the Association for Computational Linguistics (ACL) in 2022: an outstanding paper award (demo): Automatic gloss dictionary for sign language learners, co-authored with Chenchen Xu, Dongxu Li, Hongdong Li, and Ben Swift. The Annual Scientific Meeting of the Australian and New Zealand Association of Neurologists in 2022: James McLeod Advanced Trainee Award (Poster) for work co-authored with Tina Ahluwalia, Artem Lensky, Brett Jones, Robin Vlieger, and Christian Lueck. Her other significant awards include, for example, being 1 out of 16 selected Australia–China Young Scientists (1 out of 2 in CS) in 2018; scoring Prof Jan EW Beneken Prize for the best abstract and presentation in the 2019 Conference on Applied Modeling in Acute Care (2019); the Top Price in both the 2017 and 2019 OnPrime Programs for Startups, and ANU Teaching Award for the Document Analysis course in 2012; and winning ML/NLP method prizes in the 2011 TREC Medical Records Track (within the top 6 out of 12) by the Text Retrieval Conference and the 2007 Computational Medicine Center’s Medical NLP Challenge (3rd out of 44), among others. These highlights build on Hanna’s other successes, such as her docent sample lecture, titled “C-value method for summarising key content” that got awarded the highest grade by the assessing staff and students and PhD thesis on clinical ML and NLP approved with honours; this grading is granted internationally in the top 10% of the field. bars search times",
  "content_length": 5089,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:58"
}