{
  "name": "Hanne Westh Nicolajsen",
  "homepage": "https://pure.itu.dk/portal/en/persons/hanne-westh-nicolajsen(54728da8-274d-40e6-b119-23318d995721).html",
  "status": "success",
  "content": "Hanne Westh Nicolajsen - IT-University of Copenhagen Hanne Westh Nicolajsen Associate Professor, Digitalization, Democracy, and GovernanceREFLACTHead of Programme, BSc in Global Business Informatics https://orcid.org/0000-0002-0158-5034 Emailhwniitudk 20012024 Research activity per year Personal profile KeywordsDemocratic organizingOrganizational innovationInnovation managementEmployee driven innovationChange managementEmployee involvementUser involvementAmbidexterityIT implementationEmployee owned organizations Fingerprint Dive into the research topics where Hanne Westh Nicolajsen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Service Innovation Social Sciences 100% Case Study Social Sciences 88% Technostress Keyphrases 55% Idea Competition Keyphrases 55% Innovation Process Social Sciences 47% Research Libraries Social Sciences 41% Digital Leadership Keyphrases 37% Customer Participation Keyphrases 37% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2001 2006 2007 2008 2009 2010 2011 2012 2024 2024 25 Article in proceedings 21 Book chapter 10 Paper 8 Journal article 20 More 6 Working paper 4 Conference article 3 Anthology 3 Report 1 Book 1 Conference abstract for conference 1 Editorial 1 Other contribution Research output per year Research output per year A case of action research with a focus on collective learning about organisational challenges and solutions for democratically owned businessesNielsen, L., Nicolajsen, H. W. & Baka, V., 2024, Action Research Booklet. Wang, C. & Juncker-Jensen, L. (eds.). Copenhagen: RSS Press, p. 1-4 4 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open Access Action Research BookletWang, C. (Editor), Juncker-Jensen, L. (Editor), Wang, C., Østerlund, C. S., Nicolajsen, H. W., Christensen, L. R., Juncker-Jensen, L., Nielsen, L., Marttila, S.-M., Finken, S., Jiang, Q., Baka, V., Guo, V. & Dittrich, Y., May 2024, 1 ed. Copenhagen: Really Simple Syndication Press. 114 p.Research output: Book / Anthology / Report › Anthology › Research › peer-review Open AccessFile Action Research 100% Digital Technology 66% Intervention Research 66% Digitization 66% Organizational Context 33% Crafting Meaningful Generative AI-Enabled Knowledge WorkFischer, L. H., Nicolajsen, H. W., Marttila, S.-M. & Sandbukt, S., 3 May 2024, In: Proceedings / European Conference on Information Systems (ECIS). 2024, 9 p., 10.Research output: Journal Article or Conference Article in Journal › Conference article › Research › peer-review Open AccessFile Generative AI 100% Knowledge Work 100% AI-based Methods 100% Generative Artificial Intelligence 100% Artificial Intelligence 100% Designing IT for Governance - The Case of Employee-Owned Businesses. The Case of Employee-Owned BusinessesNielsen, L., Nicolajsen, H. W. & Baka, V., 9 Jul 2024, Design for Equality and Justice: Interact 2023. Springer, p. 13-26 14 p. (Lecture Notes in Computer Science, Vol. 14536).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Employee-owned Business 100% Group Decision-Making 100% Business Software 100% Bricolage 66% Digital Resources 66% Digital Stress på arbejdspladsen: En håndbog for ledere og medarbejdereStana, R. & Nicolajsen, H. W., Oct 2024, København: Djøf Forlag. 180 p.Research output: Book / Anthology / Report › Book › Research › peer-review View all 84 research outputs Projects Projects per year 2016 2016 2017 2021 2022 3 Finished Projects per year I4L: Innovation for LeadershipRichter, A. (PI), Haioty, E. H. M. (CoI), Müller, O. (CoI), Nicolajsen, H. W. (CoI), Nielsen, L. (CoI), Stana, R. A. (PI) & Vase, S. (CoI)Industriens Fond01/05/2017 → 31/03/2019Project: Research Digital Economy 100% Program Objective 100% Transformative Leadership 50% Leadership Competencies 50% Programme Objectives 50% Bæredygtige innovationer gennem samskabelseNicolajsen, H. W. (PI), Christensen, L. R. (CoI) & Finken, S. (CoI)Innovationsnetværk for IT - InfinIT01/09/2016 → 31/08/2017Project: Research Mini 100% COOPs: Iværksætteri med demokratisk islæt: analyse af forholdene i DanmarkNielsen, L. (PI), Nicolajsen, H. W. (CoI), Baka, V. (CoI), Victor, F. F. (CoI), Stana, R. A. (CoI) & Sivertsen, S. (CoI)Danish Business Authority01/11/2021 → 31/12/2022Project: Research Press/Media Digitaliseringen har gjort mange ting lettere. Men ukritisk brug af teknologi og grænseløst arbejde har skabt en helt ny form for stress, siger forskerNicolajsen, H. W.25/03/20251 Media contributionPress/Media: Press / Media En lidt fersk bog om digital stressNicolajsen, H. W.26/02/20251 Media contributionPress/Media: Press / Media Sådan bekæmper ledere bekæmpe digital stressNicolajsen, H. W.27/12/20241 Media contributionPress/Media: Press / Media Digital stress skal ikke fejes ind under gulvtæppetNicolajsen, H. W.17/12/20241 Media contributionPress/Media: Press / Media Har du fået digital stress? Så er du ikke aleneNicolajsen, H. W.11/12/20241 Media contributionPress/Media: Press / Media View all 20 press/media",
  "content_length": 5548,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:00"
}