{
  "name": "Hannes Mühleisen",
  "homepage": "https://www.cwi.nl/people/2600",
  "status": "success",
  "content": "Hannes Mühleisen Skip to main content Hannes Mühleisen Full Name Prof.dr. H.F. Mühleisen Email Hannes.Muehleisen@cwi.nl Phone +31 20 592 4039 Room L320 Department(s) Database Architectures Function(s) Scientific Staff Member Biography2010 – 2012 Researcher, Networked Information Systems, FU Berlin 2012 – 2016 Postdoctoral Researcher, Database Architectures, CWI 2016 – 2018 Tenure-Track Researcher, Database Architectures, CWI 2017 – 2019 Assistant Professor, Computer Systems, VU Amsterdam 2019 – 2022 Assistant Professor, Intelligent Data Engineering Lab, University of Amsterdam 2018 – Senior Researcher, Database Architectures, CWI2023 – Professor of Data Engineering, Radboud Universiteit Publications All publications Kuiper, L., Boncz, P., & Mühleisen, H. (2024). Robust external hash aggregation in the solid state age. In Proceedings of the IEEE International Conference on Data Engineering (ICDE) (pp. 3753–3766). doi:10.1109/ICDE60146.2024.00288 Kuiper, L., & Mühleisen, H. (2023). These rows are made for sorting and that's just what we'll do. In Proceedings of the IEEE International Conference on Data Engineering (ICDE) (pp. 2050–2062). doi:10.1109/ICDE55515.2023.00159 Kohn, A., Moritz, D., Raasveldt, M., Mühleisen, H., & Neumann, T. (2022). DuckDB-Wasm: Fast analytical processing for the Web. In Proceedings of the VLDB Endowment (pp. 3574–3577). doi:10.14778/3554821.3554847 Kuiper, L., Raasveldt, M., & Mühleisen, H. (2022). Efficient external sorting in DuckDB. In Proceedings of BICOD 2021/2022 (pp. 40–45). Raasveldt, M., & Mühleisen, H. (2020). Data Management for Data Science - Towards Embedded Analytics. In Proceedings of the Conference on Innovative Data Systems Research. Holanda, P., Raasveldt, M., Manegold, S., & Mühleisen, H. (2019). Progressive Indexes: Indexing for interactive data analysis. In Proceedings of the VLDB Endowment (pp. 2366–2378). doi:10.14778/3358701.3358705 Holanda, P., & Mühleisen, H. (2019). Relational queries with a tensor processing unit. In Proceedings of the 15th International Workshop on Data Management on New Hardware (pp. 1–3). doi:10.1145/3329785.3329932 Raasveldt, M., & Mühleisen, H. (2019). [Demo] DuckDB: An embeddable analytical database. In Proceedings of the ACM International Conference on Management of Data (SIGMOD) (pp. 1981–1984). doi:10.1145/3299869.3320212 Mühleisen, H., Bertram, A., & Kallen, M.-J. (2018). Database-inspired optimizations for statistical analysis. Journal of Statistical Software, 87(4), 1–20. doi:10.18637/jss.v087.i04 Raasveldt, M., Holanda, P., Gubner, T., & Mühleisen, H. (2018). Fair benchmarking considered difficult: Common pitfalls in database performance testing. In Workshop on Testing Database Systems (pp. 1–6). doi:10.1145/3209950.3209955 Awards Dutch Prize for ICT Research 2025 (2025) Best paper runner up award, International Conference on Scientific and Statistical Database Management (SSDBM 2017) (2017) Professional activities Organizer: Amsterdam R User Group Lecturer: Large Scale Data Engineering (VU) Founder: Co-Founder and CEO at DuckDB Labs Professor: Professor by special appointment Institute for Computing and Information Sciences (ICIS), Radboud University Speaker: Keynote speaker: Conference on Innovative Data Systems Research (CIDR) 2023 Speaker: Invited speaker: Guest Lecture UC San Diego: In-process OLAP with DuckDB Speaker: Invited speaker: Guest Lecture Uni Potsdam: In-Process OLAP Speaker: Invited speaker: SIGMOD 2021 Speaker: Invited speaker: Guest Lecture Uni of Eindhoven: Embedded Analytical Databases Speaker: Invited speaker: SAP Tech Days: Extending test coverage into DBMS Speaker: invited speaker: Zürich R User Group: Analytical Data Management with R Speaker: Invited speaker: Databricks: Verifying TPC-DS Results Speaker: Invited speaker: Budapest Data Forum 2020: Dodging the cost of scalability in data analysis with CPU efficiency Speaker: Invited speaker: Data Engineering Podcast: https://www.dataengineeringpodcast.com/duckdb-in-process-olap-database-episode-270/ Speaker: invited speaker: Software Engineering Daily Podcast: https://softwareengineeringdaily.com/2022/03/18/duckdb-with-hannes-muleisen/ Speaker: Invited speaker: DSDSD: Parallel Grouped Aggregation in DuckDB Speaker: Invited speaker: Sigma Computing invited talk: In-process OLAP with DuckDB Speaker: Invited speaker: Xebia Knowledge Sharing: In-Process Analytical Data Management with DuckD Speaker: Invited speaker: Oracle Tech Talk: In-Process Analytical Data Management with DuckDB Speaker: Invited speaker: SharkTech Talks: Databases & Datasets by DuckDB Speaker: Invited speaker: DSDSD: 1000 Days of DuckDB Pareto Principle Still Holds Grants Amsterdam Data Science Research Assistants Grant (2016) Veni - Innovational Research Grant NWO (2015) NLeSC Pathfinder (2015) COMMIT/ Zwaluwproject (2015) NWO IPPSI-KIEM (2014) Current projects with external funding Responsible Decentralized Data Architecture (RDDA) Ursa-CWI Research Grant (Ursa) Courses All courses Big Data Infrastructures & Technology(1 feb 2024 - 1 apr 2024) Cookies We use cookies. You can read more about this in our cookie statement. Reject Accept",
  "content_length": 5154,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:02"
}