{
  "name": "Hannes Hartenstein",
  "homepage": "http://dsn.tm.kit.edu/staff_hartenstein.php",
  "status": "success",
  "content": "DSN - Mitarbeitende Forschungsgruppe Dezentrale Systeme und Netzdienste - KASTEL StartseiteMitarbeitende StartseiteForschungsprofil und -projekteStudium und LehreMitarbeitendePublikationenSoftware und DatenAuszeichnungenMitarbeitende JMH@SFO Prof. Dr. rer. nat. Hannes Hartenstein Forschungsgruppenleiternach Voranmeldung über Fr. Hopprich124 (50.34)+49 721 608-48104hannes hartenstein ∂does-not-exist.kit edu Karlsruher Institut für Technologie (KIT) Institut für Informationssicherheit und Verlässlichkeit (KASTEL) Dezentrale Systeme und Netzdienste (DSN) Geb. 50.34 Am Fasanengarten 5 76131 Karlsruhe Deutschland S/MIME (KIT-CA) Google Scholar Hannes Hartenstein wurde im Oktober 2003 auf den Lehrstuhl „Dezentrale Systeme und Netzdienste“ (DSN) berufen und leitet seitdem die DSN-Forschungsgruppe am Karlsruher Institut für Technologie (vormals Universität Karlsruhe (TH)). Hannes Hartenstein war von Oktober 2010 bis September 2013 Geschäftsführender Direktor des Steinbuch Centre for Computing (SCC), von Oktober 2015 bis März 2017 Dekan der Fakultät für Informatik und von April 2017 bis April 2020 Bevollmächtigter für die Informationsverarbeitung und -versorgung (IV-B) des KIT. Er ist Principal Investigator in KASTEL. Mitgliedschaften und Aktivitäten Mitglied der HRK-Kommission \"Digitalisierung\" Mitglied des ARuS (Ausschuss für Recht und Sicherheit des DFN), (2007-2023) Mitglied des wissenschaftlichen Direktoriums des Leibniz-Instituts für Informatik Schloss Dagstuhl (2005-2018) Mitglied des Aufsichtsrats des Leibniz-Zentrums für Informatik Schloss Dagstuhl Program Co-Chair International Workshop on Cryptocurrencies and Blockchain Technology 2017 (CBT '17) Technical Program Co-Chair 5th IEEE/IFIP Annual Conference on Wireless On demand Network Systems and Services (WONS 2008) Technical Program Co-Chair 1st IEEE Int. Symposium on Wireless Vehicular Communications (WiVeC 2007) Technical Program Co-Chair 3rd ACM Int. Workshop on Vehicular Ad Hoc Networks (VANET 2006) General Co-Chair 2nd ACM Int. Workshop on Vehicular Ad Hoc Networks (VANET 2005) Lebenslauf seit Oktober 2003: Professor am Karlsruher Institut für Technologie (KIT) bzw. der Universität Karlsruhe (TH). Mitglied der Fakultät für Informatik. 2003-2017: Mitglied des Direktoriums des Steinbuch Centre for Computing 1999-2003: Forschungsmitarbeiter der Netzwerk-Labore von NEC Europe Ltd. in Heidelberg. NECs Projektleiter für das BMBF-geförderte Projekt 'Fleetnet', das die Kommunikation zwischen Fahrzeugen basierend auf Prinzipien von Ad-hoc Netzwerken behandelt. 1995-1999: Wissenschaftlicher Mitarbeiter am Institut für Informatik der Universität Freiburg bei Herrn Prof. Dr. D. Saupe. 1998: Promotion am Institut für Informatik, Universität Freiburg. 1995: Diplom in Mathematik, Universität Freiburg.",
  "content_length": 2793,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:04"
}