{
  "name": "Hannes Federrath",
  "homepage": "https://www.inf.uni-hamburg.de/inst/ab/snp/team/federrath.html",
  "status": "success",
  "content": "Hannes Federrath : Security and Privacy : Universität Hamburg Zur MetanavigationZur HauptnavigationZur SucheZum InhaltZur SubnavigationZum SeitenfußFoto: UHH/DenstorfSecurity and PrivacyProf. Dr. Hannes Federrath Photo in HiRes Phone +49 40 2395 20358 E-Mail hannes.federrath\"AT\"uni-hamburg.de WWW https://svs.informatik.uni-hamburg.de PGP 0x49EF1D84 Office location F 632 Consultation Upon request Short Biography From 1989-1994 Hannes Federrath studied computer science and earned a Ph. D. degree from Dresden University of Technology in 1998. He worked as a researcher in the group on Information and coding theory at Dresden University of Technology from 1994-1999. Between September 1999 and August 2000 he was a guest researcher at the International Computer Science Institute at UC Berkeley. Between September 2000 and August 2001 he was a guest professor, and until March 2003 he served as the head of the working group on IT-Security at Freie University Berlin, Department of Computer Science in Germany. From 2003-2011 he worked at University Regensburg as a full professor (C4) for Information Security Management. Since April 2011 he is leading the working group Security in Distributed Systems at University of Hamburg, Department of Computer Science. Research Projects, Publications and Talks Research Projects List of Talks List of Papers Lecture Slides VSS Verteilte Systeme und Systemsicherheit SbD Security by Design PbD Privacy by Design SMT Sicherheitsmanagement DIG Datenschutz in der Informationsgesellschaft UrhR Urheberrecht EEP Epistemology, Ethics and Privacy (Part 2: Privacy Additional Material Security Books Templates and Mandatory Reading Exercise collection Gesellschaft für InformatikFrom 2018-2021 Prof. Federrath served as president of German Informatics Society (Gesellschaft für Informatik GI e.V.). From 2011-2016 he served as chair of the Special Interest Group Security - protection and reliability of GI.Featured ActivitiesWissenschaftlicher Beirat beim Bundesminister für Digitales und VerkehrBSI-Beirat Digitaler VerbraucherschutzMIN-ZivilklauselGesellschaft für InformatikMINT Zukunft schaffenBundeswettbewerb InformatikZFW-Weiterbildung IT-Security-Management",
  "content_length": 2204,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:00"
}