{
  "name": "Hanna Kurniawati",
  "homepage": "https://cs.anu.edu.au/people/hanna-kurniawati",
  "status": "success",
  "content": "Hanna Kurniawati | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Short biography Hanna Kurniawati is a Professor at the ANU School of Computing and holds the SmartSat CRC Professorial Chair for System Autonomy, Intelligence & Decision-Making. Hanna’s research spans robotics, decision-making under uncertainty, motion planning, computational geometry applications, integrated planning and learning, and reinforcement learning. Her works on scalable methods for planning under uncertainty, esp. under the Partially Observable Markov Decision Process (POMDP) framework, have received multiple recognitions, including a best paper award at ICAPS’15, a finalist for the best paper award at ICRA’15, and the RSS’21Test of Time Award. She is a keynote speaker at IROS’18, ICRA’25, and ICAPS’25. Hanna was President of the Australian Robotics and Automation Association 2019-2020, a Senior Editor of IEEE RA-L, the Award Chair of CoRL’22, a Program Co-Chair of ICRA’22, and is an Editor of IEEE TRO. A bit more about me Background I am a Professor at the School of Computing, Australian National Univeristy (ANU) and the SmartSat CRC Professorial Chair for System Autonomy, Intelligence, and Decision Making. I am the ANU Node Lead and the Planning & Control theme lead for the Australian Robotics Inspection and Asset Management (ARIAM) Hub. At the ANU, I was deputy lead of the ANU grand challenge Humanising Machine Intelligence in 2021-2022. I also founded the Robot Decision Making group. I earned a BSc in Computer Science from the University of Indonesia and a PhD in Computer Science for work in Robot Motion Planning from National University of Singapore in 2008 under the supervision of David Hsu. After PhD, I briefly worked as a Research Fellow with David Hsu and Lee Wee Sun at the National University of Singapore, before moving to work with Nicholas Patrikalakis as a Postdoctoral Associate, and then a Research Scientist at the Singapore-MIT Alliance for Research and Technology, MIT. I was a Lecturer and then tenured Senior Lecturer at the University of Queensland School of ITEE, before moving to ANU in 2019. At the ANU, I started as a tenured Senior Lecturer with ANU and CS Futures Fellowship, was promoted to Associate Professor in 2021, and to Full Professor in 2023. Research My research interests span planning under uncertainty, robotics, robot motion planning, integrated planning and learning, reinforcement learning, and computational geometry applications. Specifically, I focus on algorithms to enable robust decision theory to become practical software tools, with applications in robotics and the assurance of autonomous systems. Such software tools will enable robots to design their own strategies, such as deciding what data to use, how to gather the data, and how to move, for accomplishing various tasks well, despite various modelling errors and types of uncertainty, and despite limited to no information about the system and its operating environment. Over the years, I have worked extensively on highly scalable and adaptive techniques for sequential decision-making in non-deterministic and partially observable world under the Partially Observable Markov Decision Processes (POMDP) framework. More info about my research is here. Selected Awards and Recognitions Together with collaborators and students, my works on scalable sequential decision-making under uncertainty have received multiple recognitions, including: The Robotics: Science and Systems (RSS) 2021 Test of Time Award The Alberto Elfes Award (aka., Best Conference Paper Award) at the Australasian Conference on Robotics and Automation (ACRA) 2020 Gold award for Information and Communications Technogloy (ICT) researcher of the year 2015 from the Australian Computer Society Featured as one of 25 Women in Robotics You Need to Know About 2015 Finalist for the Best Conference Paper Award at IEEE Int. Conf. on Robotics and Automation (ICRA) 2015 Outstanding Student Paper Award at the International Conference on Automated Planning and Scheduling (ICAPS) 2015 I have given keynote talks at multiple major Robotics and AI conferences, including at the IEEE Int. Conf. on Robotics and Automation (ICRA) 2025 and IEEE/RSJ Int. Conf. on Intelligent Robots (IROS) 2018. I will give a keynote talk at the International Conference on Automated Planning and Scheduling (ICAPS) 2025 in November. I have also received an award for my editorial service: An Outstanding Reviewer Award for IEEE Transactions on Robotics in 2014. Teaching At the ANU School of Computing, I have convened and taught the following classes: COMP4620/8620 Advanced Topics in AI: Intelligent Robotics (Semester 2 2023 and 2025) COMP4680/8650 Advanced Topics in Machine learning: Intelligent Robotics (Semester 2 2024) COMP3600/6466 Algorithms (Semester 2 2019 - 2022) Outside of the ANU, I have given lectures at international and Australian-wide summer/winter schools on Robotics, AI, and the Mathematics of Decision-Making, such as at the: International Conference on Automated Planning and Scheduling (ICAPS) Summer School 2024 Australian Mathematical Sciences Institute (AMSI) Winter School 2024 and 2017 Australian Robotics Vision Summer School (RVSS) 2023. Australian School of Robotic Systems (AusRos) 2025. Selected Service to the Research Community I am a Senior Editor of IEEE Transactions on Robotics since 2024. Prior to this, I was a Senior Editor for IEEE RA-L, Program Co-Chair for ICRA’22, Award Chair for CoRL’22, and General Chair for SIMPAR’18. I have served as Area Chair, Associate Editor, SPC/PC member, and Reviewer for many Robotics, AI, and Machine Learning journals and conferences, such as IEEE TRO, IJRR, IEEE TFR, WAFR, RSS, ICRA, IROS, CoRL, AIJ, AAAI, IJCAI, ICAPS, NeurIPS, and ICML. Locally, I was Treasurer (2014-2017) and President (2019-2020) of the Australian Robotics and Automation Association (ARAA). bars search times",
  "content_length": 6083,
  "method": "requests",
  "crawl_time": "2025-12-01 13:17:58"
}