{
  "name": "Hannu Toivonen",
  "homepage": "https://www.helsinki.fi/en/researchgroups/computational-creativity-and-data-mining/hannu-toivonen",
  "status": "success",
  "content": "Hannu Toivonen | Computational Creativity and Data Mining | University of Helsinki Skip to main content Hannu Toivonen Professor of Computer Science, University of Helsinki, Finland (Spring 2025: Francqui International Professor at VUB, KU Leuven, UAntwerp, UGent, & UCLouvain, Belgium) Prof. Hannu Toivonen works in the areas of artificial intelligence and data science, especially in computational creativity and data mining. Esittely suomeksi: Hannu Toivonen on tietojenkäsittelytieteen professori Helsingin yliopistossa. Hän on tutkinut tekoälyä vuodesta 1990, professorina vuodesta 2002. Hän julkaissut yli 200 tieteellistä artikkelia, joihin on viitattu yli 28000 kertaa. Hän on ohjannut yli 20 väitöskirjaa ja hänellä on 10 patenttia. Hannu on toiminut myös laitoksen johtajana, tiedekunnan varadekaanina ja tohtorikoulun johtajana. Tieteellisen tutkimuksen lisäksi Hannu on kehittänyt tekoälyn sovelluksia muille tieteenaloille (esim. historia, genetiikka, ekologia, paleoekologia, bioinformatiikka) sekä luoviin tehtäviin (esim. kuunnelman, runojen ja musiikin tuottamiseen). Hannu Toivonen on tunnettu tekoälyn yleistajuistajana ja selittäjänä. Hän pitää tekoälystä esityksiä ja luentoja myös yrityksille ja julkisille organisaatioille, ja tiedotusvälineet käyttävät häntä asiantuntijanaan. Luennoissaan Hannu pyrkii antamaan tekoälyn käsitteistä, periaatteista ja vaikutuksista helppotajuisen ja jäsennellyn kuvan ilman teknistä jargonia. Hannu on valittu 100 suomalaisen IT-vaikuttajan joukkoon. Hannu Toivosen helppolukuinen tietokirja ( 2023) on julkaistu myös ruotsiksi (, Natur & Kultur 2025) ja saksaksi (, Springer 2025). Hannu Toivonen on pitänyt esityksiä tekoälystä mm. seuraaville organisaatioille tai heidän järjestämissään tilaisuuksissa: Business Technology Forum, CSC – Tieteen tietotekniikan keskus, Elinkeinoelämän keskusliitto, Espoon kaupunki, Espoon seudun koulutuskuntayhtymä Omnia, Geologian tutkimuskeskus GTK, Granlund, Hellon, Helsingin kaupunki, Helsingin seudun liikenne, Heureka, Inarin kunta, Jyväskylän kaupunki, Kansallismuseo, Kansallisooppera ja -baletti, Keskuskauppakamari, Kunnallisalan kehittämissäätiö, Kuopion kaupunki, Länsi- ja Sisä-Suomen aluehallintovirasto, Opetus- ja kulttuuriministeriö, Opetushallitus, Perheyritysten liitto, Pharmaca Health Intelligence, Porvoon kaupunki, Pro-ammattiliitto, Professio Finland, Raision seudun koulutuskuntayhtymä Raseko, SAP,  SESKO, Slush/HS Visio, Suomen Akatemia, Suomen kielipalveluyritykset, Suomen kulttuurirahasto, Suomen kustannusyhdistys, Suomen museoliitto, Suomen taloushallintoliitto, Suomen tekijänoikeudellinen yhdistys, Suomen vesiensuojelun keskusliitto, UKK-instituutti, Uudenmaan sosiaalialan osaamiskeskus Socca, Verohallinto, WSOY. Hannu on Suomen Valkoisen Ruusun I luokan ritari. Hän on Suomalaisen Tiedeakatemian sekä Teknillisten Tieteiden Akatemian jäsen sekä tietojenkäsittelytieteen opiskelijajärjestö TKO-äly ry:n kunniajäsen. Euroopan kulttuuriperintöpalkinto (European Heritage Award) on myönnetty eurooppalaiselle NewsEye-projektille, jonka vastuullisista johtajista Hannu oli yksi. Academic profile & affiliations I am AI researcher and Professor of Computer Science at the of the . At the University of Helsinki, I lead the , and I'm affiliated with  and . I teach in and  programmes, in programme, and I'm involved in establishing our new starting in fall 2026. Biography Professor Hannu Toivonen is a leading expert in data mining and computational creativity. He has introduced and solved several novel research problems in the area of data mining since the field was born in early 1990s; his definitions and algorithms have become standard references and textbook material in the field. He has since developed applications of data mining for gene mapping, context-aware computation, document analysis and summarization, computational creativity, and natural language generation. Hannu Toivonen obtained his PhD in Computer Science in 1996 and has been Full Professor at the University of Helsinki since 2002. In 2025, he visits VUB and four other Belgian universities as International Francqui Professor; year 2006 he spent at the University of Freiburg, Germany. Hannu Toivonen has over 200 international refereed publications. According to Google Scholar, he has been cited over 28,000 times and he has an h-index over 60. He served as Programme Chair of IEEE ICDM 2014, a leading data mining conference, of ICCC 2015, the International Conference on Computational Creativity, and of the AI, Arts & Creativity special track of IJCAI 2022. Prof. Toivonen has served as Editorial Board member of the leading journals and as Senior Programme Committee positions of the leading conferences in his research areas. Hannu Toivonen was Vice-Dean of Academic Affairs of the Faculty of Science for 2018-21 (21 degree programmes, 6000 students), Head of the Department of Computer Science for 2007-9 (170 FTE staff), director of the Helsinki Doctoral Programme in Computer Science for 2007-11 (80 PhD students) and founding director of the Data Science MSc programme for 2016-2018. He has secured external funding for over 7 MEUR, including five EU projects and numerous domestic projects. Prof. Toivonen also has six years of industrial experience from Nokia Research Centre. He holds ten patents. Since 2023, popularization of AI has been in Prof. Toivonen's focus. His book \"\" (What is AI?) is aimed for the broad public, with the aim of helping citizens understand and discuss AI and its implications in their lives. The book has been published also in Swedish, \"\", and in German, . Prof. Toivonen also is a frequent public speaker, explaining AI in simple terms to various audiences. Hannu Toivonen has been decorated as Knight, First Class, of the Order of the White Rose of Finland. He is a member of the Finnish Academy of Science and Letters and of the Finnish Academy of Technical Sciences. He is also a honorary member of the computer science student association TKO-äly ry. The European Heritage Award (aka Europa Nostra Award) was awarded to the European NewsEye project, of which Hannu was one of the principal investigators. Publications My publications are mainly in the areas of artificial intelligence, computational creativity, data mining and data science, and cover both their theory and their applications in numerous fields. According to Google Scholar, my work has been cited over 27000 times. I'm the author of a best-selling Finnish non-fiction book on AI, \"\" (\"What is AI?\"). Press and media My work has been covered by as well as and . The most recent public media appearances are listed below. Scientific activities Miscallaneous scientific activities, e.g., international programme committee membership. Podcasts My visits to misc. podcasts, in Finnish and in English Art My work on computational creativity also aims at producing creative systems and artistic results. See my research group's  for artistic outputs from the group. Read about it in (The First Century of Finnish Media Art; Parvs 2023), in chapter Tekoäly, luovuus ja taide (AI, Creativity, and Art), p. 167-171 My displays AI art produced with commercial tools and information about my personal art exhibits (in Finnish). Contact Visitor address: Exactum building, Room D220 Kumpula Science Campus Pietari Kalmin katu 5, Helsinki ​​​​​ Home People Prof. Hannu Toivonen P.O. Box 3 (Fabianinkatu 33) 00014 University of Helsinki Switchboard: +358 (0) 2941 911 (mobile call charge / local network charge)",
  "content_length": 7518,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:03"
}