{
  "name": "Hanoch Levy",
  "homepage": "http://www.math.tau.ac.il/~hanoch",
  "status": "success",
  "content": "Hanoch Levy Hanoch Levy School of Computer Science +972-3-640-7401 +972-3-640-9357 hanoch (AT) cs.tau.ac.il Recent publications. Courses: Course: Advanced Topics in Computer Networks -- Peer-to-Peer Networks 2013/14 Semester B Course: Advanced Topics in Computer Networks -- Peer-to-Peer Networks 2012/13 Semester A Course: Advanced Topics in Computer Networks -- Peer-to-Peer Networks 2011/12 Semester B Course: Advanced Topics in Computer Networks -- Peer-to-Peer Networks 2010/11 Semester A Sadna: Workshop on Computer Networks: VoD on Peer-to-Peer Internet Systems 2010/11 Semester B Sadna: Workshop on Computer Networks: Peer-to-Peer Internet Systems and their Selfish Use 2009/10 Semester B Data Structures 2010/11 Semester A Data Structures 2010/11 Semester B Past Courses: Seminar on Advanced Internet 2009/10 Semester B Data Structures 2009/10 Semester A Seminar on Advanced Internet 2008/09 Semester B Data Structures 2008/09 Semester B Lecture on Queue Fairness in Queueing Class (May 2005) Computer Networking Seminar 2005/06 Semester B Workshop (Sadna) on Quality of Service on IP Networks 2005/06 Computer Networking Seminar 2004/05 Semester B Workshop (Sadna) on Quality of Service on IP Networks 2004/05 Computer Networking Seminar 2004/05 Semester A Data Structures 2006/07 Semester A Data Structures 2005/06 Semester A Workshop (Sadna) on Quality of Service on IP Networks 2003/04 Workshop (Sadna) on Quality of Service on IP Networks 2002/03 Data Structures 2004/05 Semester A Data Structures 2003/04 Semester B Data Structures 2003/04 Semester A Data Structures 2002/03 Data Structures 2001/02 Data Structures 2000/01 Data Structures 1999/00 Computer Communications Networks Advacend Topics in Communications Networks: Quality of Service (2002). Advacend Topics in Communications Networks: Quality of Service (2001). Advacend Topics in Communications Networks: Quality of Service (LAST YEAR - 2000) Advacend Topics in Communications Networks: QOS (1999) Advacend Topics in Communications Networks (1998) Prior students (partial list): Liat Ashkenazi: Controlling Burstiness in Fair Queueing Scheduling Haim Zlatokrilov (M.Sc): Packet Dispersion and the Quality of Voice over IP Applications in IP networks Aner Armon Haim Zlatokrilov (Ph.D) David Raz (Ph.D) Nir Halachmi Udi Ben-Porat (M.Sc) Elisha Rosensweig Arik Chivkashvili Current students: Udi Ben-Porat (Ph.D) Yuval Rochman (Ph.D) Gil Shapira redesigned by barak soreq",
  "content_length": 2445,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:06"
}