{
  "name": "Hanqi Zhuang",
  "homepage": "http://www.eng.fau.edu/directory/faculty/zhuang",
  "status": "success",
  "content": "Hanqi Zhuang | Florida Atlantic University Skip to main content SUB MENUBrowse FacultyHanqi ZhuangSponsored ResearchPublicationsBook & ChaptersJournals ArticlesConferencesOther PublicationsStudentsPh.D. DissertationsM.S. ThesesTeaching Hanqi Zhuang Associate Dean and Professor Department of Electrical Engineering and Computer Science 777 Glades Road, EE 403A Boca Raton, FL 33431-0991 p: 561.297.3413 zhuang@fau.edu Education Ph.D., Electrical Engineering, Florida Atlantic University, 1989 M.S., Electrical Engineering, Florida Atlantic University, 1986 B.S., Electrical Engineering, Shanghai University, 1982 Research Interests Signal Processing, Machine Learning and Large Language Models Topic Modeling and Sentiment Analysis Marine Animal Sound Detection and Classification Biomedical Applications: Cancer Diagnosis, Seizure Detection, Emotion Detection and Classification Recent Sponsored Research Hari, K., H. Zhuang, S. Batalama, “Systemic Interventions to Expand Sustainable CS Pathways for Students,” NEU/Gates Foundation, $557,219, 5/10/2024-5/9/2027. Hari, K., H. Zhuang, N. Romance, et. Al, “CyberCorps Scholarship for Service: Building the Next Generation Cybersecurity-Ready Workforce,” NSF, # 2336456, $2,624,440, 01/01/2024-12/13/2029. Hari, K., H. Zhuang, and N. Romance, “RAPID: DRL AI: Data Driven Approaches to Integrating AI in K-12 Education Using Social Media Analysis.” NSF. # 2332306, $200,000. 08/2023-07/2024. Cherubin, L., G., L. O’Corry-Crowe, and H. Zhuang, “Dolphin behavioral response to anthropogenic activity in offshore & coastal waters.” HBOI Foundations, $296,044, 07/01/2023-06/30/2024. O’Corry-Crowe, G., L. Cherubin, H. Zhuang and A. Page-Karjian, “Distribution, behavioral ecology, and genomics of Florida Whales-PFW FY24,” HBOI Foundations, $235,160, 07/01/2023-06/30/2024. Pados, D (PI) et. al. H Zhuang is a Senior Personnel. “Making the Master's Degree in Artificial Intelligence Accessible to High-Achieving Low-Income Students.” NSF S-STEM Award # 2030854, 9/1/2020-8/31/2025. Kalva, H, Zhuang, and Nancy Romance, “Personal Cloud for Research and Research-Related Education,” US Army Research Office, $598,000, 8/1/2022-7/31/2023. O’Corry-Crowe, G., L. Cherubin, H. Zhuang and A. Page-Karjian, “Population, Health, and Behavioral Ecology Assessment of Florida Whales,” HBOI Foundations, $187,000, 07/01/2022-06/30/2023. Cherubin, L., M. Ajemian, H. Zhuang and N. Erdol, “Unveiling the ‘grouper guard’ - the first line of subtropical coastal defense to UUVs via integrated acoustic smart-sensing.” DARPA, $6,500,000 (est), Ref #:HR001118S0027-PA-016, Nov. 2018-May 2024. Romance, N. (PI, Director), H. Zhuang (Co-PI, Co-Director), and M. Vitale (Co-PI), Supplemental Grant to “HSI‐ STEM & Articulation Program: An Articulated State College‐University Framework for Increasing Graduation Rates of Hispanic and Low‐income Students in Computer Science,” Department of Education. $101k, 9/1/2020-8/31/2023. This is added to the original grant $4,456,707, 10/01/2016‐09/30/2023 (AWD-001102). Cherubin, L., H. Zhuang and J. VanZwieten, “Loop Current System SSH and subsurface current prediction with a transfer learning approach,” $346,000, Gulf Research Programs, National Academies of Science, Engineering and Medicine, January 1, 2020 to June 30, 2021. previous sponsored research Refereed Journal Articles1 R. Acs & Hanqi Zhuang, “Semi-supervised synthesis of 7T MRI from 3T using 3D FR-U-Net with anatomical segmentation consistency assessment,” PLOS ONE, in press. T. Vo, A. K. Ibrahim, H. Zhuang, and C. Bang, “Extraction and Interpretation of EEG Features for Diagnosis and Severity Prediction of Alzheimer’s Disease and Frontotemporal Dementia Using Deep Learning.\" Biomedical Signal Processing & Control, in press. A. S. Altaher, C. Bang, B. Alsharif, A. Altaher, M. Alanazi, H. Altaher, and H. Zhuang, “Mamba vision models: Automated American sign language recognition,” Franklin Open, vol. 10, p. 100224, 2025. C. Bang, A. S. Altaher, A. Altaher, H. Moamin, T. Alshammari, B. Alkanjr, H. Altaher, M. G. Al-Jassani, and H. Zhuang, “Finger Knuckle Print classification: Leveraging vision Mamba for low complexity and high accuracy,” Franklin Open, p. 100261, 2025. T. Vo, A. K. Ibrahim, and H. Zhuang, “A Multimodal Multi-Stage Deep Learning Model for the Diagnosis of Alzheimer’s Disease Using EEG Measurements,” Neurology International, vol. 17, no. 6, p. 91, 2025. P. DeVito, A. Vallala, S. Mcmahon, Y. Hinda, B. Thaw, H. Zhuang, and H. Kalva, “Unpacking Generative AI in Education: Computational Modeling of Teacher and Student Perspectives in Social Media Discourse,” arXiv preprint arXiv:2506.16412, 2025. 1 All the Journals listed are international journals and papers published are reviewed by anonymous reviewers. read more ©",
  "content_length": 4787,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:06"
}