{
  "name": "Hanqiu Sun",
  "homepage": "http://www.cse.cuhk.edu.hk/~hanqiu",
  "status": "success",
  "content": "Sun Han-qiu Home Page Prof. HANQIU SUN B.S. (HUST); M.S. (British Columbia); Ph.D. (Alberta) Department of Computer Science & Engineering The Chinese University of Hong Kong Shatin, New Territories Hong Kong Email: hanqiu@cse.cuhk.edu.hk Dr. Hanqiu Sun received B.S. in electrical engineering from Huazhong University of Science and Technology, M.S. in electrical engineering from University of British Columbia, and Ph.D. in computer science from University of Alberta, Canada. She is adjunct professor at University of ESTC, visit professor at State Key Lab. of Zhejiang University, and visit professor at Shanghai Jiaotong University. Prof. Sun has published more than hundred technical papers refereed, including MIT Journal of PRESENCE: Teleoperators and Virtual Environments, IEEE Transactions on Visualization and Computer Graphics, Journal of Virtual Reality: Research, Development and Applications, IEEE Transactions on Image Processing, Computers & Graphics, Computer Animation and Virtual Worlds, Computational Geometry: Theory and Applications, IEEE Transactions on Information Technology in BioMedicine, IEEE Transactions on Systems, Man, and Cybernetics, IEEE Journal of Computer Graphics and Applications, Journal of Visual Languages and Computing, The Visual Computer, Journal of Applied Mathematics, Journal of Algorithms, International Journal of Image & Graphics, refereed book chapters and international conferences such as SIGGRAPH Asia. She has served as guest editors of MIT PRESENCE and Journals of CAVW and IJIG, program co-chair of ACM VRST, Chinagraph, organization co-chair of Pacific Graphics, CGI, conference general chair of ACM VRCIA, director of advanced workshop on VR, and numerous international program committees. She has been selected as \"Who's Who in the World\" 2009-, \"IBC Top 100 Educators 2010\", \"Women of the Year 2011\", ... by international professional societies, and has joint 973 national major projects in virtual reality 2003/2007 and augmented reality 2009/2013. Her current research interests include virtual reality, interactive graphics/animation, real-time and hybrid VR environments, computer-assisted surgery, efficient image/video synopsis and navigation, Haptics and dynamics simulations. Suggestions to potential graduate students Teaching: CSC 1500 Computer Principles and Programming CSC 1720 Introduction to Internet CSC 2100 Data Structures CSC 2520 Data Structures and Applications CSC 3550 Introduction to Computer Graphics ENGG 1410 Engineering Mathematics (coordinating tutorials, reviews of all chapters, midterm and final exams for engineering A/B/C/D/E sessions) ENGG 1110 Problem Solving by Programming (mentor for projects) CSC 5460 Virtual & Augmented Reality CMSC 5719 Research Seminars (topic: Realism in Virtual Environments) CSC 7242 Web-based Graphics & VR Systems Publications: (175 technical papers in total, all refereed) 87 Journals 5 Book Chapters 80 Conferences 3 Workshops Selected Publications (2002 - ) R&D Projects Research Grants Graduate Students Final Year Projects M.Sc. Projects Professional Activities Honours & Awards Web-based VR Links",
  "content_length": 3131,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:03"
}