{
  "name": "Hans-Joachim Bungartz",
  "homepage": "http://www5.in.tum.de/wiki/index.php/Univ.-Prof._Dr._Hans-Joachim_Bungartz",
  "status": "success",
  "content": "Univ.-Prof. Dr. Hans-Joachim Bungartz - Sccswiki Univ.-Prof. Dr. Hans-Joachim Bungartz From Sccswiki Jump to navigation Jump to search Address: Institut für Informatik Boltzmannstr. 3 85748 Garching Office: MI 2.5.54 Email: Error creating thumbnail: Unable to save thumbnail to destination Phone: (089) 289 18 604 Fax: (089) 289 18 607 Contents 1 Personal Data 1.1 CV and Education 1.2 Career 1.3 Professional Activities (TUM) 1.4 Professional Activities (others) 1.5 Scholarships and Awards 2 Teaching 3 Treasury 3.1 Music 3.2 Interdisziplinarität im wissenschaftlichen Rechnen 3.3 Müller-Lüdenscheid Publishers Personal Data CV and Education born 1963 in Lahr 1969-1973: Martinstorschule Wangen im Allgäu 1973-1982: Rupert-Neß-Gymnasium Wangen im Allgäu 1982-1989: Technische Universität München: studying mathematics, informatics, and economics Nov. 1988: Dipl.-Math.Thesis: Algebraische Mehrgitterverfahren zur Optimierung unter Nebenbedingungen May 1989: Dipl.-Inform.Thesis: Entwurf von Datenstrukturen und Algorithmen für algebraische Mehrgitterverfahren June 1992: Dr. rer. nat. (Refs.: Chr. Zenger, R.H.W. Hoppe)Thesis: Dünne Gitter und deren Anwendung bei der adaptiven Lösung der dreidimensionalen Poisson-Gleichung July 1998: Dr. rer. nat. habil. (Refs.: Chr. Zenger, E. W. Mayr, H. Yserentant, M. Griebel)Thesis: Finite Elements of Higher Order on Sparse Grids Feb. 1999: Privatdozent July 2000: Professor Career 1989-1991: Siemens doctoral grant 1991-1992: research assistant (wiss. Angestellter), Department of Informatics, TU München 1992-1998: research assistant (wiss. Assistent), Department of Informatics, TU München 1998-2000: senior assistant (Oberassistent), chair V, Department of Informatics, TU München 1992-2001: in charge of administration of FORTWIHR July 2000: associate professor (C3) for Numerical Analysis and Scientific Computing, Department of Mathematics, Universität Augsburg September 2001: full professor (C4) for Simulation of Large Systems, IPVS, Department of Informatics, Electrical Engineering, and Information Technology, Universität Stuttgart December 2004: full professor (C4) for Scientific Computing, Department of Informatics, TU München May 2008: permanent visiting professor, Department of Mechanical Engineering, University of Belgrade January 2009: offer of a full professorship (W3) at the Universität Stuttgart; declined June 2009 May 2014: offer of a position as full professor and centre director at Skolkovo Institute of Technology, Moscow, Russia; declined October 2014 Professional Activities (TUM) Director of the Ferienakademie (since 2005) Director of the ENB programme Bavarian Graduate School of Computational Engineering BGCE (since 2005) Dean of Academic Affairs of the Informatics Department (2010-2013) Department Information Officer of the Informatics Department (2010-2013) Member of the Board of IGSSE (since 2011) Member of the Advisory Council of IAS (since 2011) Spokesperson of all deans of academic affairs (2012-2014) Vice-dean of the Informatics Department (2012-2013) Dean of the Informatics Department (since 2013) Director of the TUM Graduate School and TUM Graduate Dean (since 2013) Professional Activities (others) Member of the Scientific Directorate of IBFI Schloss Dagstuhl (2003-2006) Editorial boards: SIAM Journal of Scientific Computing (SIAM; 2005-2011) Computing and Visualization in Science (Springer; since 2005) Computing in Science and Engineering (IEEE and AIP; since 2006) Numerische Mathematik (Springer; since 2007) Program Committee membership of many conferences Reviewing activities for various journals, conferences, individuals, and institutions (Germany, Austria, Switzerland, Norway, The Netherlands, USA, Australia, Singapore) Head of the IT Commission (KfR) of the German Research Foundation DFG (2006-2013) Member of the Kommission für Informatik of the Bavarian Academy of Sciences and Humanities (since 2006) Mentor in the Max Weber Programm of the Studienstiftung des deutschen Volkes (since 2006) Member of the Directorate of the Leibniz Supercomputing Center (LRZ) of the Bavarian Academy of Sciences and Humanities (since 2008) Member of the Advisory Board of SimTech (since 2008) Member of the Selection Board of the Max Weber Programm and the Studienstiftung des deutschen Volkes Member of the Scientific Advisory Board of the Gauss Centre for Supercomputing (since 2009) Member of the Steering Committee of the High Performance Computing Center Stuttgart (HLRS) (since 2009) Member of the Steering Committee of the Leibniz Supercomputer Centre (LRZ), Munich (since 2009) Member of the Scientific Panel of CSCS (Swiss National Supercomputing Center) (2010-2014) Chairman of the Executive Board of the German National Research and Education Network (DFN) (since 2011) Member of the BAR (Advisory Board for IT Infrastructure) of the Max Planck Society (since 2014) Member of the Steering Committee of the Council for Doctoral Education (CDE) of the European University Association (EUA, since 2016) Scholarships and Awards 1984-1988: Studienstiftung des deutschen Volkes 1989-1991: Siemens doctorate grant 1992: award by the faculty of informatics for the doctorate thesis 1994: award by the Bavarian minister for education, arts, and science \"Bayerischer Habilitations-Förderpreis\" 2013: PRACE Award Teaching formerly at the TU München (until winter term 2000/2001) formerly at the Universität Augsburg (academic year 2000/2001) formerly at the Universität Stuttgart (starting winter term 2001/2002) at the TU München (since summer term 2005) Treasury Music Akademischer Orchesterverband München Dies Academicus 2009 [1] Interdisziplinarität im wissenschaftlichen Rechnen Sorry - alle Sottisen nur in Deutsch! Eine wissenschaftliche Groteske in einem Auftritt (Uraufführung in München am 16.1.1997) Sprach der Limnologe zum Informatiker: \"Also, ich empfehle Ihnen dringend, einen Limnologen einzustellen. Meiner Erfahrung nach können sich Limnologen blitzschnell das erforderliche Wissen aus Mathematik und Informatik aneignen, wohingegen andersherum Mathematiker und Informatiker über Jahre hinweg große Probleme haben, sich in die Biologie und Limnologie einzuarbeiten, weil ihnen einfach das Prozessverständnis fehlt.\" War der Informatiker sprachlos. Müller-Lüdenscheid Publishers Error creating thumbnail: Unable to save thumbnail to destination Jan Mayen - Timbuktu - Furth im Wald Ein Unternehmen der SPARSYTEC-Gruppe mit seiner legendären Reihe Texte, die die Wissenschaft nicht braucht (TDDWNB) Retrieved from \"https://www5.in.tum.de/wiki/index.php?title=Univ.-Prof._Dr._Hans-Joachim_Bungartz&oldid=20512\" Category: Chair Navigation menu Search",
  "content_length": 6672,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:15"
}