{
  "name": "Hans-Christian Jetter",
  "homepage": "https://www.imis.uni-luebeck.de/de/institut/team/hans-christian-jetter",
  "status": "success",
  "content": "Univ.-Prof. Dr. rer. nat. Hans-Christian Jetter M.Sc. | IMIS - Universität zu Lübeck Direkt zum Inhalt Institut Professuren Team IMIS Kontakt Anfahrt Forschung Forschungsschwerpunkte Forschungsthemen Forschungsprojekte Publikationen Lehre Lehrbereiche Bachelorarbeiten Masterarbeiten Sonstige Arbeiten Transfer Transferbereiche Wissenstransfer Transferprojekte Weiterbildung Aktuelles News Stellenangebote Search Univ.-Prof. Dr. rer. nat. Hans-Christian Jetter M.Sc. Professor für Interaktionsdesign und User Experience Institut für Multimediale und Interaktive Systeme Universität zu Lübeck , Gebäude 64 , Raum 0.105 (EG) Ratzeburger Allee 160 D-23562 Lübeck Tel: +49 451 3101 5113 Fax: +49 451 3101 5104 E-Mail: hanschristian.jetter [at] uni-luebeck.de Persönliche Webseite C. Jetter ACM Profile LinkedIn Google Scholar Allgemeines Zur Person Hans-Christian Jetter ist Informatiker und seit August 2020 Professor für Interaktionsdesign und User Experience an der Universität zu Lübeck. Sein Forschungsinteresse gilt der Mensch-Computer- bzw. Mensch-Daten-Interaktion mit dem Ziel neuartige Computersysteme zu erschaffen, die es mittels Ubiquitous Computing (z.B. durch interaktive Tische, Wände und Räume), Mixed Reality (z.B. durch augmentierte & virtuelle Realität) und künstlicher Intelligenz ermöglichen, dass einzelne Personen oder Teams komplexe Daten und Modelle interaktiv explorieren, visualisieren und verstehen können. Schwerpunkt liegt dabei auf einer möglichst einfachen, \"natürlichen\" oder \"intuitiven\" Interaktion mit den Systemen in verschiedensten Anwendungsdomänen, wie z.B. Lagezentren und Kontrollräume für die Luft- und Raumfahrt, Studios für die partizipative Stadtplanung und Technikgestaltung, Visualisierungen für Natur-, Kultur- oder Kunstwissenschaft. Hans-Christian Jetter promovierte nach dem Studium des Information Engineering (B.Sc. und M.Sc.) an der Universität Konstanz im Jahr 2013 in der Arbeitsgruppe Mensch-Computer-Interaktion von Professor Harald Reiterer (summa cum laude). Forschungsschwerpunkte seiner Arbeit in Konstanz waren u.a. desktop-basierte visuelle Suchsysteme für digitale Bibliotheken und interaktive Tische und Räume für die kollaborative Wissensarbeit und Visualisierung. Während seiner Promotion absolvierte er 2009 und 2011 Forschungsaufenthalte bei Microsoft Research Cambridge (Professor Natasa Milic-Frayling) und an der Cambridge University (Professor Jeremy Baumberg) zum Thema Tangible User Interfaces und interaktive Tische für e-Science bzw. Nanophotonik. Diese Arbeiten wurden 2013/2014 als Research Associate und Postdoc im Intel Collaborative Research Institute for Sustainable Connected Cities (ICRI Cities) am University College London bei Professor Yvonne Rogers weitergeführt. Hier waren die Forschungsschwerpunkte primär die kollaborative Visualisierung urbaner Daten mittels Mehr-Geräte-Interaktion und -Visualisierung. Im Jahr 2015 wurde Hans-Christian Jetter auf die Professur User Experience und Interaktionsdesign an der Fachhochschule Oberösterreich am Campus Hagenberg berufen, wo er Forschungsprojekte im Bereich interaktiver und kollaborativer Big-Data-Visualisierung, hybrider Kollaboration und User Experience für industrielle Visualisierungen/HMIs leitete. Zusammen mit Professor Christoph Anthes etablierte und leitete er dort 2019 die neue Forschungsgruppe HIVE (Human Interfaces and Virtual Environments). 2020 folgte die Berufung auf die Professur Interaktionsdesign und User Experience an der Universität zu Lübeck. Im Mai 2024 erfolgte die Höherstufung auf eine entfristete W3-Professur durch die Universität zu Lübeck. Professur Professur für Interaktionsdesign und User Experience Curriculum Vitae since Aug 2020 Professor of Interaction Design and User Experience at the University of Lübeck 2015-2020 Professor of User Experience and Interaction Design at the University of Applied Sciences Upper Austria (Campus Hagenberg) 2013/2014 Research Associate at University College London, UCLIC / Intel ICRI Cities 2007-2013 Doctoral degree (Dr. rer. nat.) in the Department of Computer and Information Science, University of Konstanz (summa cum laude) 2009 & 2011 Research stays at Microsoft Research Cambridge and Cambridge University 1999-2007 Information Engineering (B.Sc. & M.Sc.) at University of Konstanz Projekte Geleitete Projekte TheaDiPOLIS THEAter-Partizipation für eine DIgital erfahrbare Gestaltung der zukünftigen POLIS Wegweiser.UX-für-KI Online-Kompetenzaufbau: UX für gemeinwohlorientierte KI MariData Energie-Interfaces für die Zukunft der energieeffizienten Schifffahrt Publikationen Publikationen Jetter, H. ,  Raule, L. ,  Gerken, J. ,  &  Pirk, S. (2025/09/21)Mixed-initiative Dynamic Autonomy Through Variable Levels of Immersion and Control (MIDA-VIC): A new Paradigm for Collaborative Robotic Teleoperation in Space ExplorationOpen Access Series in Informatics (OASIcs). https://doi.org/10.4230/OASIcs.SpaceCHI.2025.22Zitieren Zoubir, M. , Gruner, M. , Heidinger, J. , Schwarz, B. , Jetter, H. ,  & Franke, T. (2025)Autonomy aweigh: Evaluation metrics and supporting seafarers’ basic psychological needs in energy-efficient route planning DSSApplied Ergonomics, 128. https://doi.org/10.1016/j.apergo.2025.104518Publikation herunterladenZitieren Gabrecht, M. ,  Huang, C. ,  Matthies, D. ,  & Jetter, H. (2025)PAVES: Pneumatic And Vibrotactile Enhanced Shoes for terrain simulation in virtual environments on a treadmill18th ACM International Conference on PErvasive Technologies Related to Assistive Environments. https://doi.org/10.1145/3733155.3733202Publikation herunterladenZitieren Zoubir, M. , Schwarz, B. , Heidinger, J. , Gruner, M. , Jetter, H. ,  & Franke, T. (2025)Anchoring Autonomy: Understanding Seafarers’ Interaction with Energy Efficiency Decision Support Systems for Route Planning and the Role of Basic Psychological NeedsCognition, Technology & Work. https://doi.org/10.1007/s10111-025-00789-7Zitieren Pointecker, F. ,  Friedl-Knirsch, J. , Jetter, H. ,  &  Anthes, C. (2024/05/11)From Real to Virtual: Exploring Replica-Enhanced Environment Transitions along the Reality-Virtuality ContinuumACM CHI Conference on Human Factors in Computing Systems (CHI 2024). https://doi.org/10.1145/3613904.3642844Publikation herunterladenZitieren Schwarz, B. , Zoubir, M. , Heidinger, J. , Jetter, H. ,  & Franke, T. (2024)MariData.HEI – Handlungsintegrierte Entscheidungsunterstützung durch nutzerzentrierte Energie-Interfaceshttps://doi.org/10.34657/22648Publikation herunterladenZitieren Zoubir, M. , Gruner, M. , Heidinger, J. , Schwarz, B. , Jetter, H. ,  & Franke, T. (2024)Bridging the Gap on the Bridge: Seafarers' Tasks and Decision-Making with DSS in Energy-Efficient Route PlanningOSF. https://doi.org/10.31234/osf.io/se3yc Zitieren Schwarz, B. , von Elbwart, S. , Zoubir, M. , Heidinger, J. , Franke, T. ,  & Jetter, H. (2024)Design and Evaluation of a Visual Query Interface for Maritime Route PlanningACM NordiCHI Nordic Conference on Human-Computer Interaction (NordiCHI 2024). https://doi.org/10.1145/3677045.3685420Publikation herunterladenZitieren Calero Valdez, A. , Heine, M. , Franke, T. , Jochems, N. , Jetter, H. ,  & Schrills, T. (2024)The European commitment to human-centered technology: the integral role of HCI in the EU AI Act’s successi-com - Journal of Interactive Media, 23(2), 249-261. https://doi.org/10.1515/icom-2024-0014Publikation herunterladenZitieren Auer, S. ,  Anthes, C. ,  Reiterer, H. , Jetter, H. ,  &  , . (2023/10/31)Aircraft Cockpit Interaction in Virtual Reality with Visual, Auditive, and Vibrotactile FeedbackProceedings of the ACM on Human-Computer Interaction, 7(ISS). https://doi.org/10.1145/3626481Publikation herunterladenZitieren Schacht, D. ,  & Jetter, H. (2023/10/16)Promises and Design-Challenges of Mobile Transitional Interfaces2023 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). https://doi.org/10.1109/ISMAR-Adjunct60411.2023.00013Publikation herunterladenZitieren Schröder, J. ,  & Jetter, H. (2023/10/16)Towards a Model for Space and Time in Transitional Collaboration2023 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). https://doi.org/10.1109/ISMAR-Adjunct60411.2023.00052Publikation herunterladenZitieren Best Paper Schröder, J. , Schacht, D. ,  Peper, N. ,  Hamurculu, A. ,  & Jetter, H. (2023/04/19)Collaborating Across Realities: Analytical Lenses for Understanding Dyadic Collaboration in Transitional InterfacesProceedings of the 2023 CHI Conference on Human Factors in Computing Systems (CHI ’23), April 23–28, 2023. https://doi.org/10.1145/3544548.3580879Publikation herunterladenZitieren Schwajda, D. ,  Friedl, J. ,  Pointecker, F. , Jetter, H. ,  &  Anthes, C. (2023/03/28)Transforming graph data visualisations from 2D displays into augmented reality 3D space: A quantitative studyFront. Virtual Real., 4. https://doi.org/10.3389/frvir.2023.1155628Publikation herunterladenZitieren Jetter, H. (2023/01)Informationsvisualisierung und Visual Analytics In Grundlagen der Informationswissenschaft (7. völlig neu gefasst Ausgabe) (pp. 295-306). De Gruyter Saur. https://doi.org/10.1515/9783110769043-025Publikation herunterladenZitieren Jetter, H. (2023/01)Mensch-Computer-Interaktion, Usability und User Experience In Grundlagen der Informationswissenschaft (7. völlig neu gefasst Ausgabe) (pp. 523-534). De Gruyter Saur. https://doi.org/10.1515/9783110769043-045Publikation herunterladenZitieren Schwarz, B. , Zoubir, M. , Heidinger, J. , Gruner, M. , Jetter, H. ,  & Franke, T. (2023)Investigating Challenges in Decision Support Systems for Energy-Efficient Ship Operation: A Transdisciplinary Design Research Approach In Human-Centered Design and User Experience (pp. 610-625). AHFE Open Access. https://doi.org/10.54941/ahfe1004281Publikation herunterladenZitieren Zoubir, M. , Gruner, M. , Schwarz, B. , Heidinger, J. , Jetter, H. ,  & Franke, T. (2023)Charting the Course: Human Factors Research for Shipping Ener",
  "content_length": 19993,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:13"
}