{
  "name": "Hans Löbel",
  "homepage": "https://www.ing.uc.cl/academicos-e-investigadores/hans-albert-lobel-diaz",
  "status": "success",
  "content": "HANS ALBERT LÖBEL DÍAZ | Ingeniería UC Inicio Nuestra Escuela Sobre Ingeniería UC Internacionalización Retribuye Proyecto Ingeniería 2030 Código de Honor Consejo Asesor Autoridades y equipos Programas de Estudio Admisión Pregrado Postgrado Educación Profesional Acreditaciones Académicos e Investigación Académicos Ingeniería UC Publicaciones Investigación en pregrado Proyectos de investigación Concursos postdoctorales Libro de Investigación Divulgación Científica y Tecnológica Innovación y Emprendimiento Ecosistema de emprendimiento Formación académica Programas extracurriculares Emprendimiento Social Apoyo al emprendimiento Alumnos emprendedores Vida Universitaria Deporte Cultura Centro de Alumnos de Ingeniería Proyectos de Alumnos Mujeres Ingeniería UC Cuerpo de Tutores Pastoral Vinculación con el Medio Transferencia Alumni Ingeniería UC Preingeniería Atracción y desarrollo de talento Plataforma de Colocaciones Responsabilidad Social Oficina de Vinculación con la Industria Contacto Departamentos y áreas académicas SIDING English Home » Académicos e Investigadores » HANS ALBERT LÖBEL DÍAZ Académicos Ingeniería UC HANS LÖBEL Profesor Asistente Especialidad:  Reconocimiento Visual,  Aprendizaje de Máquina (Machine Learning),  Big Data Departamento de Ciencia de la Computación, Departamento de Ingeniería de Transporte y Logística halobel@uc.cl +562 2354 4822 Líneas de Investigación Publicaciones Biografía Educación Premios y Distinciones Noticias Relacionadas Líneas de Investigación  Reconocimiento Visual: reconocimiento de objetos y escenas, segmentación semántica  Aprendizaje de Máquina: deep learning, structured learning  Optimización: problemas de gran escala, regularización  Sistemas Inteligentes de Transporte  Big Data: smart cities, plataformas (Hadoop, Spark) Publicaciones Fuentes-Guinez J., Troni G., Lobel H. (2025) SPLASH-SegFormer Pipeline: A Transformer-Based Approach for High-Resolution and Low-Cost Laser Scanner Seafloor Mapping IEEE Robotics and Automation Letters 10 8 7995-8002 Alvarado, N., Lobel, H. (2024). Hyperbolic Optimizer as a Dynamical System. In Proceedings of the 41st International Conference on Machine Learning (PMLR) 235:1243-1260, 2024. (2024) Hyperbolic Optimizer as a Dynamical System Proceedings of the 41st International Conference on Machine Learning (PMLR) 235 1243-1260 Alvarado, N., Lobel, H. (2024) Hyperbolic Optimizer as a Dynamical System Proceedings of the 41st International Conference on Machine Learning (PMLR) 235 1243-1260 Muñoz, C., Apolo, M.J., Ojeda, M., Lobel, H., Mendoza, M. (2024). News Gathering: Leveraging Transformers to Rank News. In: Goharian, N., et al. Advances in Information Retrieval. ECIR 2024. Lecture Notes in Computer Science, vol 14610. Springer, Cham. https://doi.org/10.1007/978-3-031-56063-7_41 (2024) News Gathering: Leveraging Transformers to Rank News 46th European Conference on Information Retrieval, ECIR 2024 LNCS 14610 486-493 Muñoz, C., Apolo, M.J., Ojeda, M., Lobel, H., Mendoza, M. (2024) News Gathering: Leveraging Transformers to Rank News 46th European Conference on Information Retrieval, ECIR 2024 LNCS 14610 486-493 (2024) Self-Supervised Learning Applied to Variable Star Semi-Supervised Classification Using LSTM and GRU Networks 2024 Latin American Computer Conference (CLEI) Reyes A., Mendoza M., Vera C., Lucchini F., Dimter J., Gutierrez F., Bro N., Lobel H., Reyes A. (2024) SpatialCluster: A Python library for urban clustering SoftwareX 26 (2024) SpatialCluster: A Python library for urban clustering SoftwareX 26 101739 Carvallo A., Parra D., Lobel H., Rada G., Carvallo A. (2023) A comparative dataset: Bridging COVID-19 and other diseases through epistemonikos and CORD-19 evidence Data in Brief 51 Catalán H., Löbel H., Herrera J.C. (2022) An automatic methodology to measure drivers behavior in public transport Journal of Intelligent Transportation Systems: Technology, Planning, and Operations 10 1-15 Vera C., Lucchini F., Bro N., Mendoza M., Löbel H., Gutierrez F., Dimter J., Cuchacovic G., Reyes A., Valdivieso H., Alvarado N., Toro S. (2022) Learning to cluster urban areas: two competitive approaches and an empirical validation EPJ Data Science 11 62 1-22 Ramírez, T., Lobel, H., Hurtubia, R.: \"Accounting for heterogeneity in the qualitative perception of public spaces: a Machine Learning and Discrete Choice Modelling approach\", in International Conference on Transport Survey Methods (ISCTSC), Lisbon, Portugal, 2021. (2021) Accounting for heterogeneity in the qualitative perception of public spaces: a Machine Learning and Discrete Choice Modelling approach International Conference on Transport Survey Methods (ISCTSC) Farid, Y., Kreidieh, A.R., Khalighi, F., Lobel, H, Bayen A.: \"Continual Learning of Microscopic Traffic Models using Neural Networks\", in TRB Annual Meeting, 2021. (2021) Continual Learning of Microscopic Traffic Models using Neural Networks TRB Annual Meeting 2021 Correa P., Cipriano A., Nuñez F., Salas J.C., Lobel H. (2021) Forecasting copper electrorefining cathode rejection by means of recurrent neural networks with attention mechanism IEEE Access Ramirez T., Hurtubia R., Lobel H. Rossetti T. (2021) Measuring heterogeneous perception of urban space with massive data and machine learning: An application to safety Landscape and Urban Planning 208 104002 Hurtado J., Lobel H., Soto A. (2021) Overcoming catastrophic forgetting using sparse coding and meta learning IEEE Access Vera, C., F., Lucchini, Gutierrez, F., Valdivieso, H., Lobel, H., Bro, N.Mendoza, M.: Parametric Sensitivity in Graph Neural Network for Urban Cluster Detection, a Case Study, in Proceedings of the Tenth International Conference on Complex Networks and their Applications, 2021. (2021) Parametric Sensitivity in Graph Neural Network for Urban Cluster Detection, a Case Study Proceedings of the Tenth International Conference on Complex Networks and their Applications Carvallo A., Parra D., Lobel H., Soto. A. (2020) Automatic document screening of medical literature using word and text embeddings in an active learning setting Scientometrics Löbel H., Vidal R., Soto A. (2020) CompactNets: Compact Hierarchical Compositional Networks for Visual Recognition Computer Vision and Image Understanding (2019) Accounting for heterogeneity in the qualitative perception of public spaces: a Machine Learning and Discrete Choice Modelling approach 12th International Conference on Transport Survey Methods Rossetti T., Lobel H., Rocco V. and Hurtubia R. (2019) Explaining subjective perceptions of public spaces as a function of the built environment: A massive data approach Landscape and Urban Planning 181 169-178 (2019) Modelación De Percepciones Cualitativas De Espacios Públicos Con Modelos De Inteligencia Artificial Y Modelos De Elección Discreta 19° Congreso Chileno de Ingeniería de Transporte J. T. MEndéz, H. Lobel, D. Parra and J. C. Herrera, \"Using Twitter to Infer User Satisfaction with Public Transport: the case of Santiago, Chile, \" in IEEE Access.doi: 10.1109/ACCESS.2019.2915107 (2019) Using Twitter to Infer User Satisfaction with Public Transport: the case of Santiago, Chile IEEE Access 7 60255-60263 (2018) Classifying Drivers' Behavior in Public Transport Using Inertial Measurement Units and Decision Trees The 21st IEEE International Conference on Intelligent Transportation Systems (2017) Modelación de la percepción subjetiva del espacio público mediante técnicas de machine learning y modelos de elección discreta Congreso Chileno de Ingeniería de Transporte (2017) Modeling subjective perceptions of public spaces and their effect on user behavior International Conference on Travel Behavior Research Biografía Doctor en Ciencias de la Ingeniería, mención Ciencia de la Computación, de la Pontificia Universidad Católica de Chile. Su tesis titulada «Un Enfoque de Reconocimiento Visual basado en Modelos Jerarquicos Composicionales Profundos, Eficientes y Compactos y Técnicas de Máximo Margen Estructuralmente Regularizadas», centrada en tópicos avanzados de Aprendizaje de Máquina y Reconocimiento Visual, recibió el premio a la mejor tesis doctoral del año 2016 de la Pontificia Universidad Católica de Chile en el área de Tecnología, Ingeniería y Procesos Productivos. Recibió además su grado de Magíster en Ciencias de la Ingeniería, mención Ciencia de la Computación y su título de Ingeniero Civil de Computación, ambos de la Pontificia Universidad Católica de Chile, en 2009 y 2007 respectivamente. Desde el año 2016 es Profesor Asistente de los departamentos de Ingeniería de Transporte y Logística y de Ciencia de la Computación. Sus áreas de interés se centran en el desarrollo y aplicación de nuevos métodos de aprendizaje de máquina a problemas relacionados con Smart Cities y Sistemas Inteligentes de Transporte, donde se aproveche el uso de volúmenes masivos de datos de fuentes heterogéneas. Educación Magister en Ciencias de la Ingeniería, Pontificia Universidad Católica de ChileIngeniero Civil, Pontificia Universidad Católica de ChileDoctor en Ciencias de la Ingeniería, Pontificia Universidad Católica de Chile Premios y Distinciones  Mejor Tesis Doctoral en el área de Tecnología, Ingeniería y Procesos Productivos, por tesis titulada «Un Enfoque de Reconocimiento Visual basado en Modelos Jerarquicos Composicionales Profundos, Eficientes y Compactos y Técnicas de Máximo Margen Estructuralmente Regularizadas», Pontificia Universidad Católica de Chile.  Mejor paper de un estuadiante por trabajo titulado «Joint Dictionary and Classifier Learning for Categorization of Images Using a Max-margin Framework», 6th Pacific-Rim Symposium on Image and Video Technology, 2013. Noticias Relacionadas 138 profesionales reciben su diploma de magíster profesional26 Profesores de Ingeniería UC adjudican proyectos FONDECYTEquipo del DCC obtuvo el primer lugar en competencia internacional de imágenes médicasDepartamento de Ciencia de la computación realizó encuentro con la industriaIngen",
  "content_length": 10502,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:10"
}