{
  "name": "Hans-Jörg Schulz",
  "homepage": "https://cs.au.dk/~hjschulz",
  "status": "success",
  "content": "About I am an associate professor at the Department of Computer Science at Aarhus University in Denmark. I received my doctorate degree in 2010 from the University of Rostock, Germany and have since worked there in various capacities with a number of intermittent research stays at TU Graz, University of Calgary, and Fraunhofer IGD. In 2018, I moved to Aarhus where I work in Information Visualization and Visual Analytics. My research focuses on methods for the visual analysis of structured data — in particular hierarchically and network-structured data. In collaboration with industrial and academic research partners, I apply my methods predominantly in the life sciences. I also collect tree visualizations at treevis.net. Research outputs and teaching materials from me and my team can be found at vis-au.github.io News and Updates August 2025 Named Associate Editor for the journal Computers & Graphics (→Link) I'm proud to join the editorial board of Computers & Graphics &emdash; one of the leading journals in the wider area of computer graphics, data visualization, virtual reality, and visual analytics. Having edited one special issue for the journal and now being in the process of editing the second one, it almost feels like a logical step to continue the good and productive cooperation with the journal. July 2025 Visualization Mentor at UBSend Hackathon, Aarhus (→Link) It was my pleasure to be a mentor for UBSend's hackathon in downtown Aarhus. Over 2 days, various teams were developing entirely new ideas for some of UBSend's internal and customer-facing processes. Visualization played a big role in many of these projects and it was fun to come as an outsider and provide some guidance and grounding for the envisioned visuals. Thanks for inviting me! June 2025 External Opponent for PhD Defense of Lars Nonnemann, University of Rostock (→Link) On 30-JUN-2025, I attended the PhD Defense of Lars Nonnemann as an external opponent. Lars' thesis was titled “A multifaceted Model for the layered Orchestration of independent Visual Analysis Tools” and subsumed his research works done as part of the DFG project UniVA at the Fraunhofer IGD Rostock. Congratulations to Dr.-Ing. Lars Nonnemann to his successful defense! May 2025 Computers & Graphics Special Section on EuroVA 2024 successfully published (→Link) Together with my Co-Guest Editor Prof. Marco Angelini, Sapienza University, Rome, we finally got a selection of the best papers from EuroVA 2024 successfully chaperoned through the submission, review, and editorial process. All eight papers are available as Open Access and provide a formidable overview of the current landscape of Visual Analytics research. Have a read! April 2025 Dagstuhl Seminar 25152 “Multi-Faceted Visual Process Mining and Analytics” (→Link) Well, this was fun! When the Process Mining (PM) and Visual Analytics (VA) research communities come together, good things are happening. We had a very productive week discussing how PM can benefit VA and how VA can benefit PM &emdash; in particular Progressive Visual Analytics. Thanks for inviting me and I look forward to realize all the ideas and plans we hatched! March 2025 3-day PhD Course “Introduction to Data Visualization” held at AU (→Link) This month we had the inaugural run of our new PhD course offered for PhD students from the NAT and TECH faculties at Aarhus University. Engineers, chemists, biologists, food scientists, ecoscientists, clinical scientists, and other PhD students from other disciplines came together to have lively discussions about good and bad data visualization practices and learn some new tricks. February 2025 EuroVA 2025 received 16 high-quality paper submissions this year (→Link) I'm proud that in my year as outgoing EuroVA paper chair, we could repeat last year's high submission numbers for the International Workshop in Visual Analytics (EuroVA) to be held in Luxembourg in June 2025. Together with my co-chair, Prof. Anna Vilanova, TU Eindhoven, I look forward to a packed program of paper talks, keynote presentation, and expert panel. January 2025 Ex aequo recipient of the VRVis Award for Visual Computing 2025 (→Link) I am honored to receive the VRVis Award for Visual Computing 2025 for my research together with the Department of Food Science and Arla. The award is shared with Pepe Eulzer from Friedrich Schiller University Jena, Germany. The award ceremony takes place during the “VRVis Symposium Visual Computing Trends 2025” in Vienna, Austria on 30-JAN-2025. Dec. 2024 Welcoming new team member Meredith Chou (→Link) Meredith Chou is starting as a Research Assistant on the Visual Analysis of Data Errors in the VADE project. Meredith holds an MSc degree from Uppsala University, Sweden and will be relocating to Denmark from Tasmania, Australia. Her research will focus on the use of “Visual Fingerprinting” to identify data errors and implausibilities even in large datasets at a glance. Nov. 2024 Book chapter on “Human Aspects” of Progressive Visual Analytics is out (→Link) It has taken exactly 6 years to compile all the great discussions and ideas from the Dagstuhl Seminar on “Progressive Data Analysis and Visualization” into a book — including the chapter on “Human Aspects” authored by Michaël Aupetit, Danyel Fisher, and myself. Thanks to Jean-Daniel Fekete, Danyel Fisher, and Michael Sedlmair for editing the book and pushing it over the finish line! October 2024 Appointed to the Editorial Board of Springer Nature's “The Visual Computer” (→Link) I have been appointed as an Associate Editor for “The Visual Computer”, published by Springer Nature. This will give me chance to not only contribute as author and reviewer to my field, but als by chaperoning manuscripts from submission to publication in close collaboration with the reviewers and authors. Thanks to the editor in chief for entrusting me with this! Sept. 2024 Visualization.info — our collection of visualization teaching and learning materials goes online (→Link) After more than a year of preparations, we have finally launched our website Visualization.info on which we collect publically available teaching materials (books, slide decks, video lectures, tutorials, exercises, etc.) on the topic of data visualization. Over the coming years, we will gradually add more materials as they become available. Stay tuned! August 2024 Keynote at the Danish Data Science Academy's Pre-Graduate Retreat (→Link) It was my pleasure to give the keynote talk at this year's DDSA Pre-Graduate Retreat at Rødding Højskole. I showed some of our work on Human-Data Interaction and Interactive Data Visualization, emphasizing the importance of the human-in-the-loop when analyzing data. Thanks to all the aspiring young data scientists for the enthusiasm with which my talk was received! July 2024 Three weeks, intensive summer course Information Visualization in Aarhus, DK (→Link) As part of Aarhus University's Summer University, I am teaching an intensive 10 ECTS summer course on Information Visualization with participants from Denmark and all over the world. It is a joy to see so many international students coming to Denmark and spending their summer to learn about visualizing data. The course will run again as a slightly shorter 2-weeks, 5 ECTS course in 2025. June 2024 Appointed as a member of the DDSA Education and Networking Committee (→Link) I am honored to have been appointed to the Education and Networking Committee of the Danish Data Science Academy to help “Grow Danish Data Science” I will be working with the fellow members of the committee to fund and organize Data Science related events and workshops in Denmark in the period 2024-2026. I am very much looking forward to this! May 2024 Honorable Mention Award for “A Web Framework for Explainable and Malleable Visualisation” (→Link) Our EuroVis'24 poster (coauthored with Simon Malthe Hansen and Ira Assent) received top-scores from the reviewers and an honorable mention award on top. The poster presents Simon's Talent Track project in which he devised a browser-based visualization framework that allows users to take a peak at the pre-processing behind a visualization and change it if needed. April 2024 Speaking about Data Visualization at the Danish Data Science Academy Meetup in Aarhus, DK (→Link) On April 12th, I was given the opportunity to discuss the topic of Data Visualization to data science students and practitioners at the DDSA Meetup in The Kitchen in Aarhus. We covered a lot of ground from what data analysis problems to automate and when better have a human analyst to take a look to using visualization for quick plausibility checking. March 2024 Running a 1/2 day Visualization Workshop for the miTarget Group at University Hospital Kiel, Germany (→Link) On March 19th, I will run a 1/2 day visualization workshop for the PhD students and researchers of the DFG Research Unit miTarget “The Microbiome as a Therapeutic Target in Inflammatory Bowel Disseases” in Kiel, Germany. The workshop will focus specifically on design considerations for scientific charts and diagrams as well as on visualization techniques for multivariate data. February 2024 Serving on the PhD Committee of Daniel Limberger at HPI, University of Potsdam, Germany (→Link) I am honored to serve on Daniel Limberger's PhD committee at HPI/University of Potsdam, Germany. Daniel has done his PhD under the guidance of Jürgen Döllner and defends his thesis “Concepts and Techniques for 3D-Embedded Treemaps and their Applications to Software Visualization” on 08-Feb-2024. Find out more about Daniel's work on Google Scholar. January 2024 International Co-Teaching enriches Data Visualization course (→Link) With over 100 oral exams, the latest run of our Data Visualization course comes to a close. This time, the course included an activity where the participants learned and practiced the cultural dimension of data visualization in mixed groups consisting of Ukrainian and Danish students. Many",
  "content_length": 42085,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:17"
}