{
  "name": "Hans-Ulrich Prokosch",
  "homepage": "https://www.imi.med.fau.de/team/prof-dr-hans-ulrich-prokosch",
  "status": "success",
  "content": "Prof. Dr. Hans-Ulrich Prokosch - Lehrstuhl für Medizinische Informatik Organisationsmenü öffnen Organisationsmenü schließen Friedrich-Alexander-Universität Lehrstuhl für Medizinische Informatik Prof. Dr. Hans-Ulrich Prokosch Prof. Dr. Hans-Ulrich Prokosch Prof. Dr. Hans-Ulrich Prokosch, im RuhestandSeit 1. April 2025 im Ruhestand.Institut für Medizininformatik, Biometrie und EpidemiologieLehrstuhl für Medizinische InformatikTelefon: +49 9131 67781Faxnummer: +49 9131 85-26754E-Mail: hans-ulrich.prokosch@fau.de Werdegang 1981 Mathematik Diplom 1988 Doktor der Humanbiologie (Dr. biol. hom.) 1994 Habilitation für das Fach Medizinische Informatik 1995-2003 Lehrstuhl für Medizinische Informatik an der Universität Münster seit 2003 Lehrstuhl für Medizinische Informatik an der Universität Erlangen-Nürnberg Publikationen https://imimed.cms.rrze.uni-erlangen.de/publikationen-prof-dr-hans-ulrich-prokosch/ Forschung Architektur, Konzeption und Management moderner Krankenhaus-Informationssysteme Telematische Vernetzung des Gesundheitswesens Integration wissensverarbeitender Funktionen in Krankenhaus-Informationssysteme. bisherige Projekte: WAIN-Wissensbasis für ein Allgemeines Arzneimittelinformationssystem mit Schwerpunkt Intensivmedizin und Nephrologie (10/93 – 9/96, gefördert vom BMBF im Rahmen des Forschungsprogrammes MEDWIS) Beitrag zur XPS 97: Konzepte zur losen Kopplung wissensbasierter Funktionen mit Medizinischen Informationssystemen, H.-U. Prokosch (Univ. Münster, Med. Informatik) C. Ohmann (Univ. Düsseldorf, Theoretische Chirugie) Evaluation von Informationssystemen im Gesundheitswesen Computerbasierte Lernsysteme Gremienarbeit Vorstand der Deutschen Gesellschaft für Medizinische Informatik, Biometrie und Epidemiologie (GMDS); (1998– 2000, seit 2006) Vorstand der Telematikplattform für Medizinische Forschungsnetze e.V. (seit März 2006) Fakultätsrat der Medizinischen Fakultät der Friedrich-Alexander Universität Erlangen-Nürnberg (seit Okt. 2004) SEKORA: Ausschuss für Rechenanlagen der Universität Erlangen-Nürnberg, als Vertreter der Professoren (Nov. 2003 – März 2007) Wissenschaftlicher Beirat des Regionalen Rechenzentrums der Universität Erlangen-Nürnberg (Nov. 2003 – Okt. 2007) Mitglied des wissenschaftlichen Beirats des Zentrums für Telematik im Gesundheitswesen GmbH NRW (ZTG) Mitgliedschaften Mitglied in Wissenschaftlichen Fachgesellschaften Deutsche Gesellschaft für Medizinische Informatik, Biometrie und Epidemiologie (GMDS) Gesellschaft für Informatik (GI)American Medical Informatics Association (AMIA) International Fellow des American College of Medical Informatics Mitglied in Standardisierungsgremien und internationalen wissenschaftlichen Arbeitsgruppen Amerikanische Standardisierungskommission (ASTM); Subcommittee „Health Knowledge Representation“ Deutscher Vertreter in der Working Group 9 (Health Informatics for Developing Countries) der Internationalen Medical Informatics Association (IMIA); 1994/95 Deutscher Vertreter in der Working Group 10 (Hospital Information Systems) der Internationalen Medical Informatics Association (IMIA); 1997 – heute Deutscher Vertreter in der Working Group 13 (Organizational Impact of Medical Informatics) der Internationalen Medical Informatics Association (IMIA); 1998 – heute Mitglied in Programm-Kommittees (Auszug) 1st European Conference on eHealth, Fribourg (Schweiz) October 2006 GMDS Jahrestagung 1996, 1997, 1998, 1999, 2003, 2007 Tagung der AG Krankenhausinformationssysteme der GMDS 1996, 1997, 1998, 1999 und 2000 Workshop „Auswirkungen der Network Economy auf die elektronische Kommunikation und Information im Gesundheitswesen“ im Rahmen der GI Jahrestagung 2001 (Chairman des Programmkommittees) Europäische Jahrestagung für Medizinische Informatik MIE 2000 Gemeinsame Jahrestagung der EFMI (European Federation of Medical Informatics) und GMDS: MIE2000/GMDS2000 (Chairman des deutschen Programmkommittees) GMDS/GI-Workshop SoftKIS´97 (Erfolgsfaktor Softwaretechnik für die Entwicklung von Krankenhausinformationssystemen) 4. Tagung Wissensbasierte Systeme der GI, XPS´97 Workshop „Integration wissensbasierter Funktionen in Krankenhausinformationssysteme“ Workshop „Multimediale Anwendungen in der Medizin“, Münster 1998 Bildanalyse & Visualisierung, Transfermeeting für alle Fakultäten der WWU Münster, 1997",
  "content_length": 4319,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:20"
}