{
  "name": "Hans-Arno Jacobsen",
  "homepage": "https://www.professoren.tum.de/en/jacobsen-hans-arno",
  "status": "success",
  "content": "Jacobsen_Hans-Arno Prof. Dr. Hans-Arno Jacobsen Professorship Application and Middleware Systems Department Informatics Contact Details Business card at TUMonline Academic Career and Research Areas Professor Jacobsen’s pioneering research lies at the interface between computer science, computer engineering and information systems. He holds numerous patents and has been involved in major industrial developments with partners such as Bell Canada, Computer Associates, IBM, Yahoo! and Sun Microsystems. His principal areas of research include the design and development of middleware systems, event processing, service computing and applications in enterprise data processing. His applied research focuses on ICT solutions for energy efficiency. His research work also explores the integration of modern hardware components, such as FPGAs (Field Programmable Gate Arrays), into middleware system architectures. After studying and completing his doctorate in Germany, France and the USA, Professor Jacobsen carried out post-doctoral research at INRIA near Paris before moving to the University of Toronto in 2001. In Toronto he worked as a professor in the Department of Electrical and Computer Engineering and in the Department of Computer Science. Since 2012, as a recipient of an Alexander von Humboldt Professorship, he has held the Chair of the Department of Application and Middleware Systems at TUM. Courses Awards Alexander von Humboldt Professorship (2012) Key PublicationsSadoghi M, Jacobsen HA: “BE-tree: an index structure to efficiently match boolean expressions over high-dimensional discrete space”. 37th SIGMOD International Conference on Management of data. 2011; 637-648.AbstractCheung A, Jacobsen HA: “Load Balancing Content-Based Publish/Subscribe Systems”. 2010; 28 (4): Article No. 9.AbstractLi G, Muthusamy V, Jacobsen HA: “A distributed service-oriented architecture for business process execution”. ACM Transactions on the Web. 2010; 4 (1): Article No. 2.AbstractLi G, Muthusamy V, Jacobsen HA: “Adaptive content-based routing in general overlay topologies”. ACM Middleware. 2008; 1-21.AbstractZhang C, Jacobsen HA: “Refactoring Middleware with Aspects”. IEEE Transactions on Parallel and Distributed Systems. 2003; 14 (11): 1058-1073.Abstract If you wish your profile to be changed or updated please contact Franz Langer. Attention: JavaScript deactivated Please activate JavaScript to be able to use all website functions such as site search!",
  "content_length": 2469,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:12"
}