{
  "name": "Hans Jörg Müller",
  "homepage": "https://www.ai8.uni-bayreuth.de/de/team/Joerg-Mueller/index.php",
  "status": "success",
  "content": "Prof. Dr. Jörg Müller Druckansicht der Internetadresse: Team > Prof. Dr. Jörg Müller zurück zur Übersicht zurück zur Übersicht Prof. Dr. Jörg Müller Publikationen Kontakt Fakultät für Mathematik, Physik und InformatikLehrstuhl für Serious Games Publikationen Buch / Monografie Pervasive Advertising Hrsg.: Müller, Jörg; Alt, Florian; Michelis, Daniel London : Springer, 2011. - X, 366 S. . - (Human-Computer Interaction Series) doi:10.1007/978-0-85729-352-7 ... Referierte Beiträge in Zeitschriften (begutachtet) Vahrenbrink, Madita; Coleman, C. D.; Kuipers, Sonja; Lurje, I.; Hammerich, L.; Kunkel, D.; Keye, J.; Dittrich, Stephan; Schjeide, Brit-Maren; Hiß, R.; Müller, Jörg; Püschel, Gerhard P.; Henkel, Janin Dynamic changes in macrophage populations and resulting alterations in Prostaglandin E₂ se ... In: Cell Communication and Signaling Bd. 23 (2025) Heft 1doi:10.1186/s12964-025-02222-y ... Klar, Markus; Fischer, Florian; Fleig, Arthur; Bachinski, Miroslav; Müller, Jörg Simulating Interaction Movements via Model Predictive Control In: ACM Transactions on Computer-Human Interaction Bd. 30 (2023) Heft 3doi:10.1145/3577016 ... Paneva, Viktorija; Fleig, Arthur; Martínez Plasencia, Diego; Faulwasser, Timm; Müller, Jörg OptiTrap : Optimal Trap Trajectories for Acoustic Levitation Displays In: ACM Transactions on Graphics Bd. 41 (2022) Heft 5. - S. 1-14doi:10.1145/3517746 ... Fischer, Florian; Fleig, Arthur; Klar, Markus; Müller, Jörg Optimal Feedback Control for Modeling Human-Computer Interaction In: ACM Transactions on Computer-Human Interaction Bd. 29 (2022) Heft 6doi:10.1145/3524122 ... Alt, Florian; Buschek, Daniel; Heuss, David; Müller, Jörg Orbuculum - Predicting When Users Intend to Leave Large Public Displays In: Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies Bd. 5 (2021) Heft 1doi:10.1145/3448075 ... Fischer, Florian; Bachynskyi, Myroslav; Klar, Markus; Fleig, Arthur; Müller, Jörg Reinforcement learning control of a biomechanical model of the upper extremity In: Scientific Reports Bd. 11 (2021) doi:10.1038/s41598-021-93760-1 ... Seinfeld, Sofia; Feuchtner, Tiare; Maselli, Antonella; Müller, Jörg User Representations in Human-Computer Interaction In: Human–Computer Interaction Bd. 36 (2021) Heft 5/6. - S. 400-438doi:10.1080/07370024.2020.1724790 ... Seinfeld, Sofia; Müller, Jörg Impact of Visuomotor Feedback on the Embodiment of Virtual Hands Detached from the Body In: Scientific Reports Bd. 10 (2020) doi:10.1038/s41598-020-79255-5 ... Schneider, Daniel; Otte, Alexander; Gesslein, Travis; Gagel, Philipp; Kuth, Bastian; Shahm Damlakhi, Mohamad; Dietz, Oliver; Ofek, Eyal; Pahud, Michel; Kristensson, Per Ola; Müller, Jörg; Grubert, Jens Reconviguration : Reconfiguring physical keyboards in virtual reality In: IEEE Transactions on Visualization and Computer Graphics Bd. 25 (2019) Heft 11. - S. 3190-3201doi:10.1109/TVCG.2019.2932239 ... 18th IEEE International Symposium on Mixed and Augmented Reality (ISMAR 2019), Beijing, China Müller, Jörg; Oulasvirta, Antti; Murray-Smith, Roderick Control theoretic models of pointing In: ACM Transactions on Computer-Human Interaction Bd. 24 (2017) Heft 4doi:10.1145/3121431 ... Bentley, Frank; Cramer, Henriette; Müller, Jörg Beyond the bar : the places where location-based services are used in the city In: Personal and Ubiquitous Computing Bd. 19 (2015) Heft 1. - S. 217-223doi:10.1007/s00779-014-0772-5 ... Zhang, Yanxia; Chong, Ming Ki; Müller, Jörg; Bulling, Andreas; Gellersen, Hans Eye tracking for public displays in the wild In: Personal and Ubiquitous Computing Bd. 19 (2015) Heft 5-6. - S. 967-981doi:10.1007/s00779-015-0866-8 ... Alt, Florian; Schmidt, Albrecht; Müller, Jörg Advertising on public display networks In: Computer Bd. 45 (2012) Heft 5. - S. 50-56doi:10.1109/MC.2012.150 ... Bailly, Gilles; Müller, Jörg; Lecolinet, Eric Design and evaluation of finger-count interaction : Combining multitouch gestures and menu ... In: International Journal of Human-Computer Studies Bd. 70 (2012) Heft 10. - S. 673-689doi:10.1016/j.ijhcs.2012.05.006 ... Michelis, Daniel; Müller, Jörg The Audience Funnel : Observations of Gesture Based Interaction with Multiple Large Displa ... In: International Journal of Human-Computer Interaction Bd. 27 (2011) Heft 6. - S. 562-579doi:10.1080/10447318.2011.555299 ... Kuikkaniemi, Kai; Jacucci, Giulio; Turpeinen, Marko; Hoggan, Eve E.; Müller, Jörg From space to stage : How interactive screens will change urban life In: Computer Bd. 44 (2011) Heft 6. - S. 40-47doi:10.1109/MC.2011.135 ... Krüger, Antonio; Schmidt, Albrecht; Müller, Jörg Technological and research perspectives of old-age ubiquitous computing In: GeroPsych Bd. 23 (2010) . - S. 99-105doi:10.1024/1662-9647/a000012 ... Müller, Jörg; Cheverst, Keith; Fitton, Dan; Taylor, Nick; Paczkowski, Oliver; Krüger, Antonio Experiences of supporting local and remote mobile phone interaction in situated public dis ... In: International Journal of Mobile Human Computer Interaction Bd. 1 (2009) Heft 2. - S. 1-21doi:10.4018/jmhci.2009040101 ... Müller, Jörg; Mühlenbrock, Martin; Pinkwart, Niels Towards using concept mapping for math learning In: IEEE Learning Technology Newsletter Bd. 6 (2004) Heft 3. - S. 13-15http://joergmueller.info/pdf/LTTF04MuellerConceptM ... Beiträge in Zeitschriften (nicht begutachtet) Murray-Smith, Roderick; Oulasvirta, Antti; Howes, Andrew; Müller, Jörg; Ikkala, Aleksi; Bachinski, Miroslav; Fleig, Arthur; Fischer, Florian; Klar, Markus What simulation can do for HCI research In: Interactions Bd. 29 (2022) Heft 6. - S. 48-53doi:10.1145/3564038 ... Beiträge in Sammelbänden (begutachtet) Malladi, Naga Sai Surya Vamsy; Paneva, Viktorija; Müller, Jörg Feel the Breeze: Promoting Relaxation in Virtual Reality using Mid-Air Haptics 2023 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct) - Sydney, Australia: IEEE, 2023. - S. 322-327 doi:10.1109/ISMAR-Adjunct60411.2023.00070 ... Kiluk, Alicja; Paneva, Viktorija; Seinfeld, Sofia; Müller, Jörg The Impact of Different Virtual Work Environments on Flow, Performance, User Emotions, and ... 2023 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct) - Sydney, Australia: IEEE, 2023. - S. 276-282 doi:10.1109/ISMAR-Adjunct60411.2023.00063 ... Paneva, Viktorija; Fleig, Arthur; Martínez Plasencia, Diego; Faulwasser, Timm; Müller, Jörg Content Rendering for Acoustic Levitation Displays via Optimal Path Following Extended Abstracts presented at the 25th International Symposium on Mathematical Theory of Networks and Systems MTNS 2022 : held 12-16 September 2022 in Bayreuth - Bayreuth, 2022 doi:10.15495/EPub_UBT_00006809 ... Ikkala, Aleksi; Fischer, Florian; Klar, Markus; Bachinski, Miroslav; Fleig, Arthur; Howes, Andrew; Hämäläinen, Perttu; Müller, Jörg; Murray-Smith, Roderick; Ouslavirta, Antti Breathing life into biomechanical user models Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology - New York: Association for Computing Machinery, 2022 doi:10.1145/3526113.3545689 ... Klar, Markus; Fischer, Florian; Fleig, Arthur; Bachinski, Miroslav; Müller, Jörg Simulating Mid-Air Interaction Trajectories via Model Predictive Control In: Baumann, Michael Heinrich ; Grüne, Lars ; Jacob, Birgit ; Worthmann, Karl (Hrsg.): Extended Abstracts presented at the 25th International Symposium on Mathematical Theory of Networks and Systems MTNS 2022 : held 12-16 September 2022 in Bayreuth, Germany - Bayreuth, 2022. - S. 667-670 doi:10.15495/EPub_UBT_00006809 ... Paneva, Viktorija; Seinfeld, Sofia; Kraiczi, Michael; Müller, Jörg HaptiRead : Reading Braille as Mid-Air Haptic Information DIS '20: Proceedings of the 2020 ACM Designing Interactive Systems Conference - New York, NY: Association for Computing Machinery, 2020. - S. 13-20 doi:10.15495/EPub_UBT_00004967 ... Paneva, Viktorija; Bachynskyi, Myroslav; Müller, Jörg Levitation Simulator: Prototyping Ultrasonic Levitation Interfaces in Virtual Reality CHI '20 : Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems - New York, NY: Association for Computing Machinery, 2020. - S. 1-12 doi:10.15495/EPub_UBT_00004835 ... Fender, Andreas; Müller, Jörg SpaceState : Ad-Hoc Definition and Recognition of Hierarchical Room States for Smart Envir ... In: Lee, Bongshin (Hrsg.): ISS '19 - New York, NY: Association for Computing Machinery, 2019. - S. 303-314 doi:10.1145/3343055.3359715 ... Georgiou, Orestis; Limerick, Hannah; Corenthy, Loic; Perry, Mark; Maksymenko, Mykola; Frish, Sam; Müller, Jörg; Bachynskyi, Myroslav; Kim, Jin Ryong Mid-Air Haptic Interfaces for Interactive Digital Signage and Kiosks In: Brewster, Stephen (Hrsg.): CHI '19 : Extended abtracts - New York, NY: Association for Computing Machinery, 2019. - S. 1-9 doi:10.1145/3290607.3299030 ... Limerick, Hannah; Hayden, Richard; Beattie, David; Georgiou, Orestis; Müller, Jörg User engagement for mid-air haptic interactions with digital signage In: Cauchard, Jessica (Hrsg.): Pervasive Displays 2019 : Proceedings - New York, NY: Association for Computing Machinery, 2019. - S. 1-7 doi:10.1145/3321335.3324944 ... Fender, Andreas; Müller, Jörg Velt : A Framework for Multi RGB-D Camera Systems In: Koike, Hideki (Hrsg.): ISS '18 - New York, NY: Association for Computing Machinery, 2018. - S. 73-83 doi:10.1145/3279778.3279794 ... Feuchtner, Tiare; Müller, Jörg Ownershift : Facilitating Overhead Interaction in Virtual Reality with an Ownership-Preser ... UIST '18 Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology - Berlin; New York, 2018. - S. 31-43 doi:10.1145/3242587.3242594 ... Qvist Jensen, Soren; Fender, Andreas; Müller, Jörg Inpher : Inferring Physical Properties of Virtual Objects from Mid-Air Interaction CHI '18 : Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - New York, 2018 doi:10.1145/3173574.3174104 ... Fender, Andreas; Herholz, Philipp; Alexa, Marc;",
  "content_length": 33364,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:08"
}