{
  "name": "Hans-Georg Fill",
  "homepage": "https://www.unifr.ch/inf/digits/en/group/team/fill.html",
  "status": "success",
  "content": "Prof. Dr. Hans-Georg Fill | Digitalization and Information Systems Group | University of Fribourg Prof. Dr. Hans-Georg Fill Hans-Georg Fill is a full professor for business informatics at the University of Fribourg and head of the Digitalization and Information Systems Group. Since 08/2025 he is co-president of the Department of Informatics (DIUF). He coordinates the activities of the University of Fribourg in the Smart Living Lab, a joint project of EPFL, HEIA-FR, and UniFR. Prior to his engagement at the University of Fribourg he held positions at the University of Bamberg, Germany (2017-2018) and the University of Vienna, Austria (2015-2016). In addition, he was a visiting scholar at Stanford University, USA (2008, 2010-2011), the Ecole Nationale Supérieure des Mines at Saint-Etienne, France (2015) and the Karlsruhe Institute of Technology (KIT), Germany (2012). He holds a PhD and a habilitation in business informatics from the University of Vienna. Research interestsThe main research field of Hans-Georg Fill is conceptual modeling for enterprise information systems. In particular he works in the area of meta modeling, i.e. the conceptualisation and technical realization of modeling methods. His current research interests are semantic information systems, blockchains and smart contracts, the application of virtual and augmented reality in enterprise modeling as well as the deviceless interaction with enterprise information systems. ActivitiesHans-Georg Fill is supporting editor in chief of the Enterprise Modelling and Information Systems Architectures - International Journal of Conceptual Modelling (EMISAJ) and was co-department editor of the Department Enterprise Modeling and Enterprise Engineering of the Business and Information Systems Engineering (BISE) journal from 2021-2025 and a member of the editorial boards of the International Journal of Information System Modeling and Design (IJISMD) and Annals of Computer Science and Information Systems (ACSIS). Further, he is a member of several program committees of conferences in the domain of business informatics, enterprise modeling and information systems such as the European Conference on Information Systems (ECIS), the International Conference on Business Informatics (WI), the International Conference on Conceptual Modeling (ER), the International Conference on Advanced Information Systems Engineering (CAiSE),  or the International Conference on Research Challenges in Information Science (RCIS). He is co-president and co-founder of the Special Interest Group Business Informatics (SIG Business Informatics) of the Swiss Informatics Society and member and speaker of the special interest group on modeling enterprise information systems (SIG MoBIS) of the German Informatics Society (GI). He is a member of the institute council of the international institute of management in technology (iimt), as part of the University of Fribourg. From 2020-2022 he was a member of the Technical Committee 07 - Business Informatics/Information Systems of ASIIN e.V. (Accreditation Agency for Study Programmes in Engineering, Informatics, Natural Sciences and Mathematics). Publications Fill, Hans-Georg, Fettke, Peter, Köpke, Julius (2025): 3rd International Workshop on Modeling in the Age of Large Language Models (LLM4Modeling), in: Fonseca et al. (2025): Advances in Conceptual Modeling ER 2025 Workshops, FCM, CMLS, LLM4Modeling, OntoCom, and QUAMES, Poitiers, France, October 20–23, 2025, Proceedings, Springer, 101-104, DOI: 0.1007/978-3-032-08620-4 (pdf). Vasic, Iva, Fill, Hans-Georg, Quattrini, Ramona, Pierdicca, Roberto (2025): Knowledge Graphs vs. Large Language Models: Competitors or Partners in Supporting Virtual Museums, ACM Journal on Computing and Cultural Heritage, DOI: 10.1145/3756016. Pande, Charuta, Fill, Hans-Georg, Hinkelmann, Knut (2025): A Domain-Specific Modeling Method for Designing Conversational Agents for Coaching: A Case from Health Coaching, in: Guizzardi et al.:  Enterprise, Business-Process and Information Systems Modeling 26th International Conference, BPMDS 2025, and 30th International Conference, EMMSAD 2025, Vienna, Austria, June 16–17, 2025, Springer, DOI: 10.1007/978-3-031-95397-2_27 (pdf). Borcard, Daniel, Fill, Hans-Georg (2025): State of the Art and Research Directions for Visual Conceptual Modeling in Robotics, in: Guizzardi et al.:  Enterprise, Business-Process and Information Systems Modeling 26th International Conference, BPMDS 2025, and 30th International Conference, EMMSAD 2025, Vienna, Austria, June 16–17, 2025, Springer, DOI: 10.1007/978-3-031-95397-2_26 (pdf). Fettke, Peter, Fill, Hans-Georg, Köpke, Julius (2025): LLM, LAM, LxM Agent: From Talking to Acting Machines: Insights from the Perspective of Conceptual Modeling, Enterprise Modelling and Information Systems Architectures - International Journal of Conceptual Modeling (EMISAJ), Vol. 20, DOI: http://dx.doi.org/10.18417/emisa.20.3, (pdf). Curty, Simon, Bühlmann, Marcel, Fill, Hans-Georg, Treiblmaier, Horst (2025): The Blockchain Balanced Scorecard: An Innovative Approach to Facilitate Strategic Management in Enterprises, Proceedings of the 58th Hawaii International Conference on System Sciences 2025, 5591-5600, URL: https://hdl.handle.net/10125/109518 (pdf) Muff, Fabian, Fill, Hans-Georg (2025): Creating Augmented Reality Applications Using Large Language Models: Experiments with the CMAG Framework and ARWFMM, Proceedings of the AAAI Symposium Series, Vol. 5, Issue 1, 374-378 (pdf). Fill, Hans-Georg (2025): Generative Künstliche Intelligenz als Werkzeug für die Rechtsinformatik und die Wirtschaftsinformatik (forthcoming), Gedenkschrift Leo Reisinger, TBA. Curty, Simon, Fill, Hans-Georg (2024): SmartCML: A Visual Modeling Language to Enhance the Comprehensibility of Smart Contract Implementations, in: Paja, Elda, Zdravkovic, Jelena, Kavakli, Evangelia, Stirna, Janis (eds.): The Practice of Enterprise Modeling - 17th IFIP Working Conference, PoEM 2024, Stockholm, Sweden, LNBIP, Springer, DOI:10.1007/978-3-031-77908-4 (pdf). Fill, Hans-Georg, Härer, Felix, Vasic, Iva, Borcard, Daniel, Reitemeyer, Benedikt, Muff, Fabian, Curty, Simon, Bühlmann, Marcel (2024): CMAG: A Framework for Conceptual Model Augmented Generative Artificial Intelligence, in: Gallinucci et al. (eds.): Companion Proceedings of the 43rd International Conference on Conceptual Modeling: ER Forum, Special Topics, Posters and Demos, Co-located with ER 2024, Pittsburgh, Pennsylvania, USA, CEUR-WS, Vol-3849, 56-69 (pdf). Challa, Gunakar, Gartini, Aya, Muff, Fabian, Fill, Hans-Georg (2024): An Architecture for Integrating Large Language Models into Metamodeling Platforms: The Example of MM-AR, in: Gallinucci et al. (eds.): Companion Proceedings of the 43rd International Conference on Conceptual Modeling: ER Forum, Special Topics, Posters and Demos, Co-located with ER 2024, Pittsburgh, Pennsylvania, USA, CEUR-WS, Vol-3849, 126-130 (pdf). Buchmann, Robert, Eder, Johann, Fill, Hans-Georg, Frank, Ulrich, Karagiannis, Dimitris, Laurenzi, Emanuele, Mylopoulos, John, Plexousakis, Dimitris, Santos, Maribel Yasmina (2024): Large language models: Expectations for semantics-driven systems engineering, Data & Knowledge Engineering, Vol. 152, 102324, DOI: 10.1016/j.datak.2024.102324. Muff, Fabian, Fill, Hans-Georg (2024): M2AR: A Web-based Modeling Environment for the Augmented Reality Workflow Modeling Language, Proceedings of the ACM/IEEE 27th International Conference on Model Driven Engineering Languages and Systems, ACM, 1-5, DOI: 10.1145/3652620.3687779. Muff, Fabian, Fill, Hans-Georg (2024): Multi-faceted Evaluation of Modeling Languages for Augmented Reality Applications The Case of ARWFML, International Conference on Conceptual Modeling ER'2024, Springer, 75-93, DOI:10.1007/978-3-031-75872-0_5. Vasic, Iva, Fill, Hans-Georg, Quattrini, Ramona, Pierdicca, Roberto (2024): LLM-Aided Museum Guide: Personalized Tours Based on User Preferences, International Conference on Extended Reality (XR Salento 2024), Springer, 249-262, DOI:10.1007/978-3-031-71710-9_18 (pdf). Fill, Hans-Georg (2024): Spatial Conceptual Modeling: Anchoring Knowledge in the Real World, in: H.-G. Fill, H. Kühn (Eds.), Metamodeling: Applications and Trajectories to the Future: Essays in Honor of Dimitris Karagiannis, Springer Nature Switzerland, Cham, pp. 35–50. doi:10.1007/978-3-031-56862-6_3, (Pre-print PDF). Saeki, Motoshi, Wong, Leah, Araújo, João, Ayora, Clara, Bernasconi, Anna, Buffa, Matteo, Castano, Silvana, Fettke, Peter, Fill, Hans-Georg, García S., Alberto, Goulão, Miguel, Griffo, Cristine, Jung, Jin-Taek, Köpke, Julius, Marín, Beatriz, Montanelli, Stefano, Rohrer, Edelweis, Reyes Román, José F. (eds.) (2025): Advances in Conceptual Modeling - ER 2024 Workshops, AISA, CMLS, EmpER, QUAMES, JUSMOD, LLM4Modeling, Pittsburgh, PA, USA, October 28-31, 2024, Proceedings. Lecture Notes in Computer Science 14932, Springer, DOI:10.1007/978-3-031-75599-6 Fill, Hans-Georg, Kühn, Harald (Eds.) (2024): Metamodeling: Applications and Trajectories to the Future: Essays in Honor of Dimitris Karagiannis, Springer Nature Switzerland, Cham, doi:10.1007/978-3-031-56862-6. Muff, Fabian, Fill, Hans-Georg (2024): Limitations of ChatGPT in Conceptual Modeling: Insights from Experiments in Metamodeling, Workshop Modeling in the Age of Large Language Models (LLM4Modeling), GI, DOI: 10.18420/modellierung2024-ws-008, (PDF). Reitemeyer, Benedikt, Fill, Hans-Georg (2024): Leveraging LLMs in Semantic Mapping for Knowledge Graph-based Automated Enterprise Model Generation, Workshop Modeling in the Age of Large Language Models (LLM4Modeling), GI, DOI: 10.18420/modellierung2024-ws-006, (PDF). Fill, Hans-Georg, Muff, Fabian (2024): Bridging the Mental and the Physical World: Conceptual Modeling and Augmented Reality, in: Stefan Strecker, Jürgen Jung (Hrsg.): Informing Possible Future Worlds - Essays in Honour of Ulrich Frank, Logos, pp. 197-212 (PDF). Fill, Hans-Georg, Cabot, Jordi, Maass, Wo",
  "content_length": 49831,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:16"
}