{
  "name": "Hansung Kim 0001",
  "homepage": "https://www.ecs.soton.ac.uk/people/hk1f20#publications",
  "status": "success",
  "content": "Doctor Hansung Kim | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Dr Hansung Kim Associate Professor Research interests 3D Computer Vision Artificial intelligence (AI) for scene understanding Audio-visual data processing More research Accepting applications from PhD students. Connect with Hansung Email: H.Kim@soton.ac.uk Tel: +44 23 8059 2405 ORCID On this page About Research Publications Teaching Biography About Research Publications Teaching Biography About Dr. Hansung Kim is an Associate Professor in the School of Electronics & Computer Science at the University of Southampton. He has published over 100 peer-reviewed papers (Over 60 papers as the first author). These publications include top journals and conferences in computer vision such as IJCV, IEEE Trans. Image Processing, CVPR, ICCV and ECCV. His research over the last 20 years spanned a wide range of 3D computer vision and neighbouring areas including camera systems, spherical imaging, 3D reconstruction, Augmented/Virtual Reality (AR/VR), multi-modal processing, audio-visual data processing, artificial Intelligence (AI) and media production. Research Research groups Member of: Vision, Learning and Control Institute for Life Sciences Centre for Internet of Things and Pervasive Systems Research interests 3D Computer Vision Artificial intelligence (AI) for scene understanding Audio-visual data processing Virtual Reality (VR) Multi-modal data analysis Current research Dr. Hansung Kim’s research aims to unlock the creative potential of Audio-Visual Machine Perception (AI) to deliver a step change in immersive VR experiences for entertainment and training. This requires highly intelligent technologies, including machine learning (deep audio-visual data learning), computer vision (object and action recognition), and audio signal processing (audio/speech analysis). His current research addresses the open-challenge of machine understanding of complex dynamic real-world scenes combining the complementary information available from audio and visual sensor to achieve robust interpretation. These research advances are of central interest to both the audio and vision research communities and bring together advances in machine perception. Joint audio-visual processing is essential to overcome the inherent ambiguities in either sensing modality. Research projects Active projects Development of 3D Audio-Vision Technology based on Environmental Structure Analysis Researchers: Doctor Hansung Kim Completed projects Immersive Audio-Visual 3D Scene Reproduction Using a Single 360 Camera Researchers: Doctor Hansung Kim Sponsor: EPSRC Real-time 3D scene understanding and human pose estimation using a single 360 camera Researchers: Doctor Hansung Kim Real-time 3D Scene Understanding And Human Tracking Researchers: Doctor Hansung Kim Real-time 3D scene understanding and human pose estimation using a single 360 camera Researchers: Doctor Hansung Kim Publications Mogo: residual quantized hierarchical causal transformer for high-quality and real-time 3D human motion generation Dongjie Fu, Tengjiao Sun, Pengcheng Fang, Xiaohao Cai & Hansung Kim, 2025 DOI: 10.48550/arXiv.2506.05952 Type: other LInKs “lifting independent keypoints” - partial pose lifting for occlusion handling with improved accuracy in 2D-3D human pose estimation Peter Hardy & Hansung Kim, 2024 DOI: 10.1109/WACV57701.2024.00339 Type: conference Improving real-time omnidirectional 3D multi-person human pose estimation with people matching and unsupervised 2D-3D lifting Pawel Knap, Peter Hardy, Alberto Tamajo, Hwasup Lim & Hansung Kim, 2024 DOI: 10.1109/ICEIC61013.2024.10457094 Type: conference Omnidirectional depth estimation for semantic segmentation Jiaqi Zhou, Yihong Wu, Peter Timothy David Hardy & Hansung Kim, 2024 DOI: 10.1109/ICEIC61013.2024.10457236 Type: conference SliceFormer: deep dense depth estimation from a single indoor omnidirectional image using a slice-based transformer Yihong Wu, Yuwen Heng, Mahesan Niranjan & Hansung Kim, 2024 DOI: 10.1109/ICEIC61013.2024.10457276 Type: conference Spatial audio reconstruction for VR applications using a combined method based on SIRR and RSAO approaches Atiyeh Alinaghi, Luca Remaggi & Hansung Kim, 2023 DOI: 10.1109/MMSP59012.2023.10337683 Type: conference Optimising 2D pose representations: improving accuracy, stability and generalisability within unsupervised 2D-3D human pose estimation Peter Hardy, Srinandan Dasmahapatra & Hansung Kim, 2023 DOI: 10.1145/3626495.3626505 Type: conference Real-time omnidirectional 3D multi-person human pose estimation with occlusion handling Pawel Knap, Peter Hardy, Alberto Tamajo, Hwasup Lim & Hansung Kim, 2023 Type: conference Dense material segmentation with context-aware network Yuwen Heng, Yihong Wu, Srinandan Dasmahapatra & Hansung Kim, 2023 DOI: 10.1007/978-3-031-45725-8_4 Type: bookChapter Depth estimation for a single omnidirectional image with reversed-gradient warming-up thresholds discriminator Yihong Wu, Yuwen Heng, Mahesan Niranjan & Hansung Kim, 2023 DOI: 10.1109/ICASSP49357.2023.10094996 Type: conference Teaching COMP6223 Computer Vision COMP1201 Algorithmics COMP3200: Part III Individual Project COMP6200 MSc Project ELEC6200: Group Design Project Biography I am an Associate Professor in the School of Electronics & Computer Science at the University of Southampton. I received the MS and Ph.D degrees in electronic and electrical engineering from Yonsei University, Seoul, Korea, in 2001 and 2005, respectively. I was employed as a researcher of Knowledge Science Lab (KSL) at Advanced Telecommunications Research Institute International (ATR), Japan, from 2005 to 2008, and as a senior research fellow (RA-2) at the Centre for Vision, Speech, and Signal Processing (CVSSP) at the University of Surrey, UK, from 2008 to 2020. My researches for last 20 years include 3D computer vision, Stereo image processing, 3D reconstruction, Augmented/Mixed Reality, Multi-modal data processing, Audio-visual data processing and Media production with over 100 published articles in 16 projects. Recently, I was involved in EU FP7 IMPART project for multi-modal big data processing as a work package leader in 2012-2015. I lead the computer vision team in the UK EPSRC project - S3A: Future Spatial Audio (2013-2019). I also served as a Principal Investigator for BEIS Global Partnership programme - Intelligent Virtual Reality: Deep Audio-Visual Representation Learning for Multimedia Perception and Reproduction (2017-2019). Currently I'm serving as the Principal Investigator for EPSRC NIA project for Immersive Audio-Visual 3D Scene Reproduction (2021-2024) and Real-time 3D scene understanding and human pose estimation (2022-2023). Prizes 3rd Prize (2020) Best Paper Award (2013) Best paper nomination (2019) Best Paper Award from IEEE Signal Processing Society (2013) Best Paper nomination at IEEE VR conference (2019) -\tThird Prize at the AHSC Competition for Innovative Ideas to Solve Real World Problems Related to COVID-19 (2020) 3rd Prize (2020) Best Paper Award (2013) Best paper nomination (2019) Best Paper Award from IEEE Signal Processing Society (2013) Best Paper nomination at IEEE VR conference (2019) -\tThird Prize at the AHSC Competition for Innovative Ideas to Solve Real World Problems Related to COVID-19 (2020) Study View all c",
  "content_length": 31096,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:25"
}