{
  "name": "Hans-Joachim Wunderlich",
  "homepage": "http://www.iti.uni-stuttgart.de/en/chairs/computer-architecture/people/hans-joachim-wunderlich.html",
  "status": "success",
  "content": "Prof. Dr. rer. nat. habil. Hans-Joachim Wunderlich | Institute of Computer Architecture and Computer Engineering | University of Stuttgart jump to content jump to footer back close navigation For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Hans-Joachim Wunderlich Prof. Dr. rer. nat. habil. Research Group Computer Architecture,retiredInstitute of Computer Architecture and Computer EngineeringComputer Architecture Contact +49 711 685 88391 +49 711 685 88288 Email Pfaffenwaldring 47 D-70569 Stuttgart Deutschland Room: 2.170 Publications 2024Minimizing PVT-Variability by Exploiting the Zero Temperature Coefficient (ZTC) for Robust Delay Fault Testing. Hanieh Jafarzadeh; Florian Klemme; Jan Dennis Reimer; Hussam Amrouch; Sybille Hellebrand and Hans-Joachim Wunderlich. In To appear in the proceedings of the IEEE InternationalTest Conference (ITC′24), Sandiego, California, USA, 2024.AbstractBibTeXAbstractSmall Delay Faults (SDFs) introduce additional delays smaller than the capture time and require timing-aware test pattern generation. Since timing variations can invalidate the effectiveness of such patterns, different circuit instances may show a different fault coverage for the same test pattern set. This paper presents a method to generate test pattern sets for SDFs which are valid for all circuit timings introduced by process and temperature-induced variations. The method overcomes the limitations of known timing-aware Automatic Test Pattern Generation (ATPG) which has to use fault sampling under process variations due to the computational complexity. A statistical learning scheme maximises the coverage of SDFs in circuits following the variation parameters of a calibrated in- dustrial FinFET transistor model. The method combines efficient ATPG for Transition Faults (TFs) with fast timing-aware fault simulation on GPUs. Simulation experiments show that the size of the pattern set is significantly reduced in comparison to standard N-detection for transition faults, while the fault coverage even increases.BibTeX@inproceedings{Jafarzadeh_ITC2024, abstract = { Small Delay Faults (SDFs) introduce additional delays smaller than the capture time and require timing-aware test pattern generation. Since timing variations can invalidate the effectiveness of such patterns, different circuit instances may show a different fault coverage for the same test pattern set. This paper presents a method to generate test pattern sets for SDFs which are valid for all circuit timings introduced by process and temperature-induced variations. The method overcomes the limitations of known timing-aware Automatic Test Pattern Generation (ATPG) which has to use fault sampling under process variations due to the computational complexity. A statistical learning scheme maximises the coverage of SDFs in circuits following the variation parameters of a calibrated in- dustrial FinFET transistor model. The method combines efficient ATPG for Transition Faults (TFs) with fast timing-aware fault simulation on GPUs. Simulation experiments show that the size of the pattern set is significantly reduced in comparison to standard N-detection for transition faults, while the fault coverage even increases. }, abteilung = {star,ra}, author = {Jafarzadeh, Hanieh and Klemme, Florian and Reimer, Jan Dennis and Amrouch, Hussam and Hellebrand, Sybille and Wunderlich, Hans-Joachim}, booktitle = {To appear in the proceedings of the IEEE InternationalTest Conference (ITC'24)}, day = {3--8}, location = {Sandiego, California, USA}, month = {11}, project = {ACCROSS}, title = {{Minimizing PVT-Variability by Exploiting the Zero Temperature Coefficient (ZTC) for Robust Delay Fault Testing}}, year = 2024 }RAPPER: Robust and APProximate ERror Tolerating Communication. Somayeh Sadeghi-Kohan; Sybille Hellebrand and Hans-Joachim Wunderlich. In To appear in the proceedings of the IEEE International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology System(DFTS´24), Oxfordshire, UK, 2024.AbstractBibTeXAbstractEffective error-resilient communication is crucial, especially in autonomous systems. However, some applications can accept a certain level of approximation within a defined range. This opens up opportunities for optimizing system objectives, like minimizing error rates, extending operational lifetimes or reduc- ing power consumption. In this study, we introduce an innovative approach called RAPPER (Robust and Approximate Error Toler- ating Communication) which combines approximation and error correcting codes for optimizing the transmitted data. The under- lying communication scheme exploits an extension of differential encoding to enhance communication performance. Simulation results show an increased interconnect mission time and perfor- mance, while simultaneously achieving significant reductions in error rates and power consumption.BibTeX@inproceedings{Wu_DFTS_2024, abstract = {Effective error-resilient communication is crucial, especially in autonomous systems. However, some applications can accept a certain level of approximation within a defined range. This opens up opportunities for optimizing system objectives, like minimizing error rates, extending operational lifetimes or reduc- ing power consumption. In this study, we introduce an innovative approach called RAPPER (Robust and Approximate Error Toler- ating Communication) which combines approximation and error correcting codes for optimizing the transmitted data. The under- lying communication scheme exploits an extension of differential encoding to enhance communication performance. Simulation results show an increased interconnect mission time and perfor- mance, while simultaneously achieving significant reductions in error rates and power consumption.}, abteilung = {ra}, author = {Sadeghi-Kohan, Somayeh and Hellebrand, Sybille and Wunderlich, Hans-Joachim}, booktitle = {To appear in the proceedings of the IEEE International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology System(DFTS´24)}, day = {8--10}, location = {Oxfordshire, UK}, month = {10}, project = {ACCROSS}, title = {{RAPPER: Robust and APProximate ERror Tolerating Communication}}, year = 2024 }Time and Space Optimized Storage-based BIST under Multiple Voltages and Variations. Hanieh Jafarzadeh; Florian Klemme; Hussam Amrouch; Sybille Hellebrand and Hans-Joachim Wunderlich. In To appear in the Proceedings of the IEEE European Test Symposium (ETS´24), The Hague, Netherland, 2024.AbstractBibTeXAbstractLogic Built-In Self-Test (LBIST) with stored de- terministic patterns is supported by the major CAD vendors and is gaining increasing attention, especially for safety-critical applications such as automotive. It is used for both manufacturing and periodic in-field testing. An unresolved challenge so far stems from the inevitable process. This paper presents the first approach for storage-based BIST addressing delay faults under process variations and multiple voltages. A unified solution for pattern generation, test set compaction and BIST hardware is presented that is compatible with commercial schemes. The solu- tion significantly outperforms traditional N-detect for transition faults in terms of test set size, test application time and fault efficiency.BibTeX@inproceedings{JafarKHHW2024, abstract = {Logic Built-In Self-Test (LBIST) with stored de- terministic patterns is supported by the major CAD vendors and is gaining increasing attention, especially for safety-critical applications such as automotive. It is used for both manufacturing and periodic in-field testing. An unresolved challenge so far stems from the inevitable process. This paper presents the first approach for storage-based BIST addressing delay faults under process variations and multiple voltages. A unified solution for pattern generation, test set compaction and BIST hardware is presented that is compatible with commercial schemes. The solu- tion significantly outperforms traditional N-detect for transition faults in terms of test set size, test application time and fault efficiency.}, abteilung = {star,ra}, address = {The Hague, Netherland}, author = {Jafarzadeh, Hanieh and Klemme, Florian and Amrouch, Hussam and Hellebrand, Sybille and Wunderlich, Hans-Joachim}, booktitle = {To appear in the Proceedings of the IEEE European Test Symposium (ETS´24)}, day = {20--24}, location = {The Hague, Netherland}, month = {05}, title = {Time and Space Optimized Storage-based BIST under Multiple Voltages and Variations}, year = 2024 }Functional Safety and Reliability of Interconnects throughout the Silicon Life Cycle. Sybille Hellebrand; Somayeh Sadeghi-Kohan and Hans-Joachim Wunderlich. In To appear in the International Symposium of EDA 2024 (ISEDA´24), Xi’an, China, 2024.BibTeXBibTeX@inproceedings{HelleSW2024, abteilung = {ra}, address = {Xi'an, China}, author = {Hellebrand, Sybille and Sadeghi-Kohan, Somayeh and Wunderlich, Hans-Joachim}, booktitle = {To appear in the International Symposium of EDA 2024 (ISEDA´24)}, day = {10--13}, location = {Xi'an, China}, month = {05}, title = {Functional Safety and Reliability of Interconnects throughout the Silicon Life Cycle}, year = 2024 }Robust Tests of Small Delay Faults under PVT-Variations. Hans-Joachim Wunderlich; Hanieh Jafarzadeh and Sybille Hellebrand. In To appear in the International Symposium of EDA 2024 (ISEDA´24), Xi’an, China, 2024.BibTeXBibTeX@inproceedings{WundeJH2024, abteilung = {ra}, address = {Xi'an, China}, author = {Wunderlich, Hans-Joachim and Jafarzadeh, Hanieh and Hellebrand, Sybille}, booktitle = {To appear in the International Symposium of EDA 2024 (ISEDA´24)}, day = {10--13}, location = {Xi'an, China}, month = {05}, title = {Robust Tests of Small Delay Faults under PVT-Variations}, year = 2024 }Vmin Testing under Variations: Defect vs. Fault Coverage. Hanieh Jafarzadeh; Florian Klemme; Hussam Amro",
  "content_length": 1083062,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:22"
}