{
  "name": "Hans H체ttel",
  "homepage": "http://people.cs.aau.dk/~hans/index-eng.html",
  "status": "success",
  "content": "Here's Hans's homepage Hans H체ttel's homepage (Denne side findes ogs책 p책 dansk) My colleagues and I receive surprisingly many requests for internships from Indian students. However, we do not have internships for students in our department. We have never had internships, and in all likelihood we never will. Please do not apply. I am a Lecturer (Associate Professor) in the Department of Computer Science at Aalborg University. My teaching responsibilites This semester, I supervise two groups of first-year students in the degree programme in computer science and software and a group of 5th semester students in the computer science degree programme. Moreover, I am involved in the course Programming Paradigms. My research My research area is that of structural operational semantics and behavioural types, the study of the expressiveness of process calculi and how ideas from programming language theory, process calculi, structural operational semantics and static program analysis can be used to reason about programs. Among my primary research interests are variants of the pi-calculus. I am placed in the research unit for Database Systems, Programming Technology and Web Systems (DPW). I am also a member of the Danish Mathematics Society aka Dansk Matematisk Forening and of ACM. A book My book Transitions and Trees - An Introduction To Structural Operational Semantics has now published. You can buy it directly from Cambridge University Press or - for instance - via Amazon. My other publications Administrative matters I am a member of the Board of Studies in Computer Science and of the Departmental Committee for Cooperation, representing my union, Dansk Magisterforening. Assorted links Computer Science Bibliography Server Kansas State University Index of Springer Lecture Notes in Computer Science The Hypatia Electronic Library The collected writings of Alonzo Church Association for Symbolic Logic Personal information and information about non-academic interests Send mail to Hans",
  "content_length": 2003,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:08"
}