{
  "name": "Hans-Joachim Backe",
  "homepage": "https://pure.itu.dk/portal/en/persons/hansjoachim-backe(44c88dce-966d-46f3-88a8-2014e39197b9).html",
  "status": "success",
  "content": "Hans-Joachim Backe - IT-University of Copenhagen Hans-Joachim Backe Head of section Associate Professor, Play, Culture, and AIGames Research GroupCenter for Digital Play https://orcid.org/0000-0002-0091-2574 Emailhanjitudk 20122024 Research activity per year Personal profile KeywordsCritical theoryCultural heritageDigital aestheticsGame designNarratologyPlay theoriesTransmediaGame studiesPostmodernismMeta Fingerprint Dive into the research topics where Hans-Joachim Backe is active. These topic labels come from the works of this person. Together they form a unique fingerprint. Digital Arts and Humanities 100% Digital Games Keyphrases 92% Esthetics Arts and Humanities 61% Avatar Arts and Humanities 49% Computer Games Keyphrases 34% Comics Keyphrases 28% Literature Arts and Humanities 22% Epistemology Arts and Humanities 21% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2012 2015 2016 2017 2018 2023 2024 16 Book chapter 13 Journal article 4 Article in proceedings 3 Review 15 More 2 Anthology 2 Encyclopedia chapter 2 Conference abstract for conference 2 Paper 2 Conference article 2 Other contribution 1 Editorial 1 Interactive production 1 Net publication - Internet publication Research output per year Research output per year Between the Lines: Using Differential Game Analysis to Develop Environmental ThinkingBacke, H.-J., 2024, Ecogames: Playful Perspectives on the Climate Crisis. op de Beke, L., Raessens, J., Werning, S. & Farca, G. (eds.). Amsterdam: Amsterdam University Press, p. 109-128 20 p.Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open AccessFile Survivalists 100% Environmental Thinking 100% A Future Already Past? The Promises and Pitfalls of Cryptogames, Blockchain, and Speculative PlayBacke, H.-J., 2023, In: Eludamos. 14, 1, p. 81-98Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Blockchain 100% Blockchain Games 100% Gaming 100% Ownership 100% Gamification 50% Cardboard Computers: The Obscure Legacy of Play Books in 2.5D GamesBacke, H.-J., 2023, Play it again: Vom Spielbilderbuch zum Videospiel. Bachmann, C. A. (ed.). Berlin: Staatsbibliothek zu Berlin, p. 89-98 Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research Open AccessFile Indie Games 100% Cardboard 100% Video Games 100% Legacy 100% Computer Game 100% Crapa redneck su torso nazi. Come Wolfenstein II: The New Colossus sovverte la ludonarrazione.Backe, H.-J. & Bittanti, M. (Translator), 2023, Reset. Politica e videogiochi. . Bitanti, M. (ed.). Mimesis Edizioni, p. 167-216 Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Introduction: The Genre Buster. On Terminology, History, Worldbuilding and Gameplay of the Immersive SimBacke, H.-J., Bonner, M. & Zimmermann, F., 2023, In: Paidia - Zeitschrift für Computerspielforschung.Research output: Journal Article or Conference Article in Journal › Editorial › peer-review Open Access Immersive 100% World-building 100% Introduction to the Special Issue 50% View all 51 research outputs Press/Media Nyt 'Battlefield'-spil viser en genkendelig virkelighed, siger spilekspertBacke, H.-J.17/10/20251 Media contributionPress/Media: Press / Media Guide til videnskaben på Folkemødet: Se fremtidens hjerneforskning, fermentering og forskerspirerWirman, H. E., Backe, H.-J., Løvlie, A. S. & Nielsen, R. K. L.12/06/20251 Media contributionPress/Media: Press / Media En kvindelig hovedkarakter kan påvirke hele industrien. Men snakken overser en af spilseriens kvaliteterBacke, H.-J.05/12/20231 Media contributionPress/Media: Press / Media Hacker lækker hemmelig­heder om milliardstor spilsuccesBacke, H.-J.20/09/20221 Media contributionPress/Media: Press / Media Verdens 'nok mest ventede spil' er blevet hacket: 'Sløret bliver løftet for cirkussets største attraktion'Backe, H.-J.19/09/20221 Media contributionPress/Media: Press / Media View all 14 press/media Activities Activities per year 2010 2014 2015 2018 2024 21 Lecture and oral contribution 13 Organisation and participation in conference 9 Organisation and participation in workshop, seminar, course 7 Membership in review committee 4 More 2 Membership in committee, council, board 1 Editor of Research journal 1 Visiting an external academic institution Activities per year Atomic Procedures. The Granularity of Procedural ExpressionBacke, H.-J. (Speaker)21 Oct 2016Activity: Talk or presentation types › Lecture and oral contribution Between. Journal of the Italian Association for the Theory and Comparative History of Literature (Journal)Backe, H.-J. (Reviewer), Fusillo, M. (Editor) & Lino, M. (Editor)1 Jan 2020 → 30 Nov 2020Activity: Publication peer-review and editorial work types › Editor of Research journal › Research Beyond Dominance, Mixture, and Hybridity. On the Challenges of Categorizing Comic/Book/ GamesBacke, H.-J. (Speaker)30 Jul 2019Activity: Talk or presentation types › Lecture and oral contribution Breaking the Mould? Authorship and Metareferentiality in The Stanley Parable and The Beginner’s GuideBacke, H.-J. (Speaker) & Thon, J.-N. (Speaker)12 Oct 2018Activity: Talk or presentation types › Lecture and oral contribution Central and Eastern European Game Studies Conference 2015Backe, H.-J. (Speaker)22 Oct 2015Activity: Participating in or organising an event types › Organisation and participation in conference View all 54 activities",
  "content_length": 5904,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:15"
}