{
  "name": "Hans Gellersen",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/hans-gellersen",
  "status": "success",
  "content": "Hans Gellersen - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Hans Gellersen Professor Research Overview My interest is in HCI, human interface technology, and the design of novel sensing and interaction techniques for anything from smart devices to AR/VR. I am particularly interested in eye movement and recently won an ERC Advanced Grant to investigate new foundations in for gaze and gestural interaction. Over the last ten years, my group has contributed major innovations on gaze in HCI, notably on smooth pursuit interfaces and techniques, gaze-supported manual input, and eye-head interaction. We have recently focussed on interaction in 3D but I maintain long-standing interests in ubiquitous computing, cross-device interaction and interfaces that blend the digital and the virtual. For an overview of my current research and team see http://gemini-erc.org . Publications Projects PhD Students Research Groups Selected Publications Show all 278 publications Gaze on the Go: Effect of Spatial Reference Frame on Visual Target Acquisition During Physical Locomotion in Extended RealityManakhov, P., Sidenmark, L., Pfeuffer, K., Gellersen, H. 11/05/2024Conference contribution/Paper Comparing Gaze, Head and Controller Selection of Dynamically Revealed Targets in Head-mounted DisplaysSidenmark, L., Prummer, F., Newn, J., Gellersen, H. 30/11/2023 In: IEEE Transactions on Visualization and Computer Graphics. 29, 11, p. 4740 - 4750. 11 p.Journal article Vergence Matching: Inferring Attention to Objects in 3D Environments for Gaze-Assisted SelectionSidenmark, L., Clarke, C., Newn, J., Lystbæk, M., Pfeuffer, K., Gellersen, H. 19/04/2023Conference paper Outline Pursuits: Gaze-assisted Selection of Occluded Objects in Virtual RealitySidenmark, L., Clarke, C., Zhang, X., Phu, J., Gellersen, H. 23/04/2020Conference contribution/Paper Eye, Head and Torso Coordination During Gaze Shifts in Virtual RealitySidenmark, L., Gellersen, H. 17/12/2019 In: ACM Transactions on Computer-Human Interaction (TOCHI). 27, 1, 31 p.Journal article Motion Correlation: Selecting Objects by Matching Their Movement: Selecting Objects by Matching Their MovementVelloso, E., Carter, M., Newn, J., Abreu Esteves, A.E., Clarke, C., Gellersen, H.G. 22/07/2017 In: ACM Transactions on Computer-Human Interaction (TOCHI). 24, 3, 35 p.Journal article Gaze + Pinch interaction in virtual realityPfeuffer, K., Mayer, B., Mardanbegi, D., Gellersen, H. 16/10/2017Conference contribution/Paper Orbits: gaze interaction for smart watches using smooth pursuit eye movementsAbreu Esteves, A., Velloso, E., Bulling, A., Gellersen, H. 8/11/2015Conference contribution/Paper Gaze-shifting: direct-indirect input with pen and touch modulated by gazePfeuffer, K., Alexander, J., Chong, M.K., Zhang, Y., Gellersen, H. 11/2015Conference contribution/Paper Pursuits: spontaneous interaction with displays based on smooth pursuit eye movement and moving targetsVidal, M., Bulling, A., Gellersen, H. 2013 In: UbiComp '13 The 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing . New York : ACM p. 439-448. 10 p. ISBN: 9781450317702.Chapter All Publications Show only selected publications ERC: EyeView360: 360° Virtual Reality Viewport Control by Gaze and Eye Movement 01/01/2026 → 30/06/2027 Research Precision Gaze Interaction - Unrestricted Gift 01/10/2025 → 11/09/2029 Research H2020 GEMINI: Gaze and Eye Movement in Interaction 01/10/2021 → 30/09/2026 Research Eye Tracking and Gaze Interaction in Virtual Reality 01/10/2018 → 30/04/2021 Research PACTMAN: Trust and Consent in Future Pervasive Environments (DSI) 01/09/2016 → 28/02/2020 Research MODEM - Monitoring of Dementia using Eye Movements 31/03/2015 → 31/03/2019 Research Lancaster .NET Gadgeteer Collaboration 01/06/2012 → 31/05/2013 Research FP7: ICARENET 01/01/2011 → 31/12/2014 Research FP7: PROFITEX 01/10/2010 → 30/09/2012 Research FP7: PD-NET 01/05/2010 → 31/07/2013 Research EAR: Eye based activity recognition 29/03/2010 → 31/01/2012 Research FP7: MARIE 01/07/2008 → 30/06/2010 Research IAA: Attention Training 01/01/1900 → … Research Baosheng Hou PhD student, Associate Lecturer enable JavaScript to view email address Hock Siang Lee PhD student, Associate Lecturer enable JavaScript to view email address Guanlin Li PhD student, Associate Lecturer enable JavaScript to view email address Franziska Prummer PhD student enable JavaScript to view email address Haopeng Wang PhD student, Associate Lecturer enable JavaScript to view email address SCC (Interactive Systems) Back to listing Contact Details Department: Computing and Communications TelTelephone: enable JavaScript to view email address Back to listing",
  "content_length": 4943,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:05"
}