{
  "name": "Hans Henrik Løvengreen",
  "homepage": "https://www.compute.dtu.dk/english",
  "status": "success",
  "content": "DTU Compute Department of Applied Mathematics and Computer Science DTU Compute DTU Compute is a unique academic environment with 400 staff across 10 research sections in mathematics and computer science. We offer education from bachelor’s to PhD level, support lifelong learning, and conduct internationally recognised research, teaching, and innovation. We collaborate widely – with universities, organisations, and companies in Denmark and abroad – and foster a diverse, inclusive workplace with a healthy work-life balance. About Research at DTU Compute DTU Compute consists of ten pure research sections, each with its own focus, all engaging in cross-disciplinary research. These sections conduct research at the intersection of mathematics and computer science. Additionally, two sections focus on research-based innovation and collaboration with external partners, businesses, and organisations. Research also occurs at several separate research centres affiliated with one or more sections. Read more Section Algorithms, Logic and Graphs The AlgoLoG section comprises leading researchers dedicated to research in the fields of Theoretical Computer Science and Discrete Mathematics — from AI and machine learning to algorithms. Section Cognitive Systems CogSys researches how humans and machines interact, and how advanced data analysis can impact our quality of life — from the internet that reads minds to hearing aids that listen to our voices. Section Cybersecurity Engineering This section focuses on the methods, processes, and tools for the design, development, and analysis of secure computing systems accessible through a network like the Internet — also known as cyberspace. Section Dynamical Systems DynSys performs research within mathematics of dynamical systems – from energy systems to aerodynamics – encompassing modelling, forecasting, optimization, and control in both deterministic and stochastic systems. Section Embedded Systems Engineering This section conducts research across the vast spectrum of computing infrastructure, from mobile phones to cloud computing, all aimed at addressing societal challenges and driving societal progress. Section Mathematics This section carries out fundamental mathematics research. We establish the mathematical knowledge base for emerging new areas in the technical sciences and explore new applications of pure mathematics. Section Scientific Computing SciCom conducts research that bridges applications, mathematical modelling, theory, and the associated numerical algorithms — the science of using computers and mathematics to solve problems in science and engineering. Section Software Systems Engineering Software is an essential component of digitalisation, and its role is increasingly prominent. Our digital society requires software that is reliable, built on scientific and engineering principles, and aligned with societal values and expectations. Section Statistics and Data Analysis This section focuses on statistics, quantitative genomics, bioinformatics, pattern recognition, and software development. We are committed to supporting other departments at DTU and external partners in these areas. Section Visual Computing VisComp conducts research in image analysis and computer graphics, covering areas such as medical image analysis, geometry and appearance modelling, computer vision, and the analysis of 3D microstructures. Research & collaboration Innovation Our Innovation section assists companies and organisations in their development through collaborations with DTU Compute. It is one of two sections dedicated to research-based, cross-disciplinary innovation collaboration. Research & collaboration Tech4Civ Tech4Civ is a unique section integrating research into the delivery of activities via the Living Lab, supporting private and public organizations in the democratization of technology for a sustainable future. Research Centres Some of the research at DTU Compute is conducted at centres affiliated with the department. These centres often involve collaboration with external partners, including other universities, organisations, and businesses both within Denmark and internationally. Our research centres are often based on one of our research sections, but they also engage in cross-disciplinary research. Visit our centres News from DTU Compute Show all news 27 November 2025 DTU researchers aim to make AI less overconfident With two grants from the Independent Research Fund Denmark, Jes Frellsen and Søren Hauberg from DTU Compute hope to take an important step towards making artificial intelligence more transparent and responsible. Their goal is to develop methods that can incorporate and explain uncertainty in AI models – a fundamental capability that is essential in a society where AI-based solutions are advancing rapidly. 21 November 2025 Europe stands at a crossroads: How can we build a sustainable innovation ecosystem? The ability to connect innovation, entrepreneurship, and skills will determine the future of Europe. But how to do it? At the Big Data Value Forum (EBDVF) 2025 in Copenhagen, this theme was explored in a lively debate. 12 November 2025 What are AI Giga Factories, and why do they matter? Professor Sven Karlsson from DTU Compute answers three key questions about AI (Giga) Factories. 10 November 2025 Scientific Bilingualism: The key competence for a Digital Future In an era where AI and computing permeate every discipline, education needs a new approach. Future employees must master both technology and domain expertise. At Digital Tech Summit, DTU Compute’s Head of Department, Jan Madsen, explained the need in a keynote. Show all news EDUCATION DTU Compute's teaching is rooted in the core research areas of the department: mathematics, statistics, computer science, and engineering. We offer a wide range of educational programmes, from Bachelor of Science, Bachelor of Engineering, and Master of Science degrees to PhDs and continuing education for professionals looking to upgrade their skill sets. Read more Digital Chip Design at DTU Most Danish companies involved in chip design are located in the Copenhagen area. For the past 50 years, DTU has educated most of the engineers working in chip design. Now, DTU Compute is further strengthening its digital chip design activities. Dive into the research of digital chip design Calendar Show all events 01 dec Defence by PhD student Daniel Peter Rutschmann 01. dec 13:30 - 16:30 | On Disjoint Total Dominating Sets and Sorting from Partial Information 02 dec Defence by PhD student Paraskevas Pegios 02. dec 13:00 - 16:00 | Towards Explainable and Generative AI for Fetal Ultrasound Image Analysis 17 dec AI Denmark Summit 2025: Value-added and practical AI utilization for SMEs 17. dec 08:00 - 17:00 | Discover how AI can create real value for SMEs, hear success stories, and gain insights from leading experts and policymakers. Free admission, but limited seats. Register now! Free admission – limited seats. Register now! Show all events Innovation partnerships Collaborate with DTU Compute If your company or organisation needs development or wants to access specialised knowledge and skill sets, DTU Compute offers excellent collaboration opportunities. These range from upgrading employees with specialised skills from our digital toolbox to longer courses with far-reaching results. We even offer full-scale research collaborations and partnerships. Subpages Research Education Collaboration About us News",
  "content_length": 7511,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:08"
}