{
  "name": "Hao Zhang 0002",
  "homepage": "http://www.cs.sfu.ca/~haoz",
  "status": "success",
  "content": "Hao (Richard) Zhang at SFU CS Home Bio+Awards+CV News Publications People Talks Services Teaching Personal Hao (Richard) Zhang (张皓) Distinguished SFU Professor, VP of AI and R&D at Augmenta Email: haoz @ sfu . ca | Want to join? | On 3D printing | Code & data | Frequented URLs | I am a Professor in the School of Computing Science at SFU, and also Vice President of AI and R&D at Augmenta. At Augmenta, I lead the company's effort in developing the most advanced AI models and tools for efficient and sustainable building designs. More broadly, we are exploring spatial and functional intelligence to tackle challenges in the physical world and contributing to the R&D ecosystem for physical AI. I obtained my Ph.D. from the Dynamic Graphics Project (DGP) at the University of Toronto, and MMath and BMath degrees from the University of Waterloo. I direct the GrUVi (Graphics U Vision) Lab, one of the top places in the world to conduct computer graphics and computer vision research. My research is in computer graphics and more broadly, visual computing, with special interests in geometric and generative modeling, shape analysis, 3D vision, spatial AI, geometric deep learning, as well as computational design and fabrication. I have published more than 200 papers on these topics, including 70+ articles in SIGGRAPH (+Asia) and ACM Trans. on Graphics (TOG), the top venue in computer graphics, and I have an Erdös number of 3. My research has been sponsored by Adobe, Autodesk, Boeing, Google, MITACS, and NSERC. I am an IEEE Fellow (see SFU news coverage), hold a Distinguished University Professorship, and am a member of the ACM SIGGRAPH Academy. I was an Amazon Scholar from late 2021 to early 2025. I am privileged to have worked with many excellent students and postdocs. As of 2022, twelve of them are working as professors themselves. Awards and honours won by my current and past students include the Alain Fournier Best Graphics Thesis Award (twice), Eurographics PhD Award, Asia Graphics Young Researcher Award, National Science Fund for Outstanding and Excellent Young Scholars in China (1 杰青, 3 优青), Azrieli Postdoc Fellowship, winners/finalists of Google, NVidia and Adobe PhD Fellowships, SFU Govenor's Gold Medal, as well as CVPR 2020 Best Student Paper Award and Best Paper Award at SGP 2008. Major companies where my students are working or have worked/interned at include Adobe, Amazon, Apple, Bytedance, EA, Google, Huawei, Meta (formerly Facebook), Microsoft, NVidia, and Snap. In my spare time, I play badminton regularly, run about 5-10K per week, ski on blue/black runs (see a recent video of Grouse Mountain skiing with kids), and occasionally come up with cool puzzles to \"challenge\" prospective grad students. News: [pinned] Thrilled to join Augmenta as VP of AI and R&D in August 2025. I will lead the company's effort in developing the most advanced AI models and tools for efficient and sustainable building designs. Please see official press release. [pinned] Inducted into the ACM SIGGRAPH Academy, class of 2025, for technical contributions in spectral and learning-based methods for geometric modeling. See SFU's coverage on this. [pinned] Our SIGGRAPH 2013 paper on L1-medial skeleton of point cloud won an SIGGRAPH 2025 Test of Time Awards. [new] September 25: Three papers accepted to SIGGRAPH Asia 2025: a) In-2-4D for 4D interpolation from monocular images, b) ASIA for Adaptive 3D Segmentation from Image Annotations, and c) ART-DECO for text-guided 3D detailization, in colloboration with Adobe Research. Congrats to Sai Raj, Sauradip, and Qimin! [new] September 18: Our paper on arbitrary referring image segmentation (RESAnything) has been accepted to NeruIPS 2025! My first work on prompt engineering. Congrats to Ruiqi! [new] August 15, 2025: SIGGRAPH 2025 has concluded in Vancouver, Canada, today. As the Technical Papers Chair, I am so proud of the outstanding papers program we have put together. We set a record for both the number of submissions (972) and also the accepted papers (306)! See you all in LA for SIGGRAPH 2026. [new] June 3, 2025: I will be giving two invited talks at CVPR, both on June 12. One at the 3D Digital Twin workshop, on Learning Structured CAD Representations for 3D Digital Twins, and the other at the first workshop on Ind3D: Enforcing Inductive Bias in 3D Generation (from Geometric, Physical, Topological, and Functional Perspectives), on Functional and Perceptual Inductive Biases in 3D Representation Learning. [new] May 28, 2025: Thank YOU, Adobe, for your continued and generous support for my research through GIFT funds! [new] May 9, 2025: Two papers accepted to SIGGRAPH 2025, MASH and HoLa, both on 3D representation learning; see details on publication page. [new] April 2, 2025: Our CVPR 2025 paper, ArcPro, a novel learning framework built on architectural programs to recover structured 3D abstractions from highly sparse and low-quality point clouds, has been selected as a Highlight paper! [new] March 29, 2025: The SIGGRAPH 2025 Technical Papers Committee (TPC) meeting has just concluded at the SFU Harbour Center Downtown Campus. Here is composite photo of the TPC. A TPC Workshop was also held after the meeting. December 6, 2024: SIGGRAPH Asia 2024 has concluded in Tokyo, Japan. I was the Technical Papers Assistant Chair, helping Papers Chair Ariel Shamir. October 11, 2024: I delivered a keynote talk on \"Why is 3D Generation Hard?\" at ChinaGraph 2024, held in Yellow Mountain. September 30, 2024: I delivered a keynote talk on \"The Good & The Bad of Large Models for 3D Generation\" at the First ECCV 2024 Workshop on Geometry in Large Model Era. September 27, 2024: I am serving on the Science Advisory Board (SAB) of Max Planck Institute (MPI) for Informatics on a six-year term. July 1, 2024: Three papers accepted to ECCV 2024 (see papers page for more details). Congrats to Ruiqi, Qimin, and Fenggen! June 18, 2024: Introducing our CVPR 2024 paper on Slice3D, a completely new way of solving single-view 3D reconstruction, now with code (also see video). Instead of going from single- to multi-view (and then say a NeRF), we advocate going from single-view to multi-slice images. Our key observation is that slicing offers the best way to reveal occluded structures: in the limit, slicing completely reveals everything while the same cannot be said about multi-view reasoning. All Slice3D results were produced by networks trained on a single Nvidia A40 GPU, with an inference time less than 20 seconds. June 17, 2024: I delivered a keynote talk on \"Learning Differentiable Primitive Representations for CAD and Urban Modeling\" at the First CVPR 2024 Workshop on Urban Scene Modeling: Where Vision Meets Photogrammetry and Graphics. June 1, 2024: Congrats to Zhiqin Chen who is the winner of the 2024 Governor General's Gold Medal at SFU's convocation for achieving the highest academic standing upon graduation from a doctoral degree program, the 2024 Alain Fournier Award for the best Ph.D. dissertation in computer graphics in Canada, and a winner of the 2024 Eurographics PhD Award for Best PhD Thesis. The Alain Fournier Award is the second won by an SFU graduate; the first was Ibraheem Alhashim in 2015. The Eurographics award is a first. April 23, 2024: Congrats to Sai Raj who successfully defended his Masters thesis on \"EASI-Tex: Edge-Aware Mesh Texturing from Single Image\" with a \"Pass As Is\". He will start his PhD in our group in summer 2024. April 5, 2024: Congrats to Fenggen who successfully defended his PhD thesis on \"Learning Structured Representations of 3D CAD Models\" with a \"Pass As Is\". April 1, 2024: Four papers accepted to SIGGRAPH 2024, including two journals. Congrats to Yilin, Zhiqin, Jingyu, and especially Sai Raj on his first SIGGRAPH paper! Details can be found on my publication page. December 26, 2023: Our \"Virtual Try-On\" workshop, another Amazon-led effort after the ICCV 2023 3DVeComm Workshop in Paris, has been accepted to CVPR 2024! November 22, 2023: Elevated to IEEE Fellow, class of 2024. See SFU news coverage. October 2, 2023: First ICCV Workshop on 3D Vision and Modeling Challenges in eCommercei, in Paris. This is an effort that I intiated at Amazon. Our Amazon team will also present the paper, HAL3D: a hierarchical active learning tool for fine-grained 3D part labelingi, which resulted from work done by my PhD Fenggen Yu as an Amazon intern. September 26, 2023: We will be presenting two papers at ICCV 2023 in Paris, two papers at NeurIPS 2023 in New Orleans, and four papers at SIGGRAPH Asia in Sydney, Australia! Congratulations to Maham, Fenggen, Qimin, Aditya, Yizhi, Akshay, Hang, and Zhiqin, along with all my collaborators. August 21, 2023: Please check out our latest survey on Advances in Data-Driven Analysis and Synthesis of 3D Indoor Scenes, in the form of a Eurographics State-of-the-Art Report (STAR). Great job, Akshay! August 1, 2023: I delivered a keynote talk at the Amazon Computer Vision Conference (ACVC) at Palo Alto on August 18. June 18, 2023: Join us today for the second workshop on Structural and Compositional Learning on 3D Data at CVPR 2023 in Vancouver. June 17, 2023: Congratulations to Akshay and Zhiqin for their successful PhD defenses yesterday. Both theses and defenses received the distinction of \"pass as is\"! I am proud of you! April 6, 2023: I delivered a keynote talk on \"An Evolution of Learning Neural Implicit Representations for 3D Shapes\" at Computational Visual Media (CVM) 2023. March 20, 2023: Welcome Yizhi Wang who has started his postdoc in 2023. Yizhi obtained his PhD from PKU in 2022 and before arriving in Vancouver, he made a short visit to Shenzhen University and worked there on a collaborative project on neural 3D reconstruction, ARO-Net, which will be presented at CVPR 2023. ... More ... There is a pleasure in the pathless woods; There is a rapture on the lonely shore; There is society, where none intrudes, By the deep sea, and music in its roar; I love not m",
  "content_length": 10042,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:29"
}