{
  "name": "Hao Chen 0011",
  "homepage": "https://cse.hkust.edu.hk/~jhc",
  "status": "success",
  "content": "Hao Chen Dr. Hao Chen Assistant Professor IEEE Senior Member Room 3524 (via lifts 25-26) Department of Computer Science and Engineering (Home) Department of Chemical and Biological Engineering Division of Life Science Director of Collaboration Center for Medical and Engineering Innovation, HKUST Associate Director in Center of Medical Imaging and Analysis, HKUST The Hong Kong University of Science and Technology Clear Water Bay, Kowloon, Hong Kong Email: jhc[at]ust.hk [Smart Lab,Google Scholar,HKUST Profile]. *NEW* Positions (including PhDs/RAs/Postdocs/Interns) are available on Large AI Model for Healthcare/Science (particually in Computational Pathology and Multi-omics) and XR for Computer-Assisted Intervention. Strong self-motivation is preferred (details). If you are in HKUST and interested in doing research with me, please send me an email. 12/2025 One paper was accepted by TPAMI, Congrats to Linshan! 12/2025 One paper was accepted by Briefing in Bioinformatics, Congrats to Zibin! 11/2025 One paper was accepted by Nature Communications, Congrats to Jiayi and Fuxiang! 11/2025 Two papers were accepted in AAAI, Congrats to Yequan and Dianzi! 11/2025 Highly Cited Researcher by Clarivate. 10/2025 One paper was accepted by Nature Biomedical Engineering, Congrats to Sunan and Yuxiang! 10/2025 One paper was accepted by Nature Communications, Congrats to Linshan! 10/2025 One paper was accepted by Nature Communications, Congrats to Yingxue, Yihui and Fengtao! 09/2025 One paper was accepted in IEEE TMI, Congrats to Yang Shu! 09/2025 Invited to serve as Associate Editor of IEEE Reviews in Biomedical Engineering (RBME). 08/2025 Invited to serve as Area Chair in ICLR 2026. 08/2025 Invited to serve as Area Chair in CVPR 2026. 07/2025 One paper was accepted in IEEE TMI, Congrats to Haoxuan! 07/2025 Eight papers were accepted in MICCAI 2025 and Congrats to all! 06/2025 Honored to receive the HKUST Engineering Young Investigator Research Award 2024-25. 06/2025 Two papers were accepted in IEEE TMI, Congrats to Haoxuan and Haibo! 06/2025 One paper was accepted in 2025 ICCV, Congrats to Ziyi! 05/2025 Two papers were accepted in IEEE TMI, Congrats to Jiaxin! 05/2025 Two papers were accepted in 2025 ICML, Congrats to Zhengrui and Baijiong! 04/2025 Congrats to Runsheng (Champion) and Gu Yi (Second Runner-up) on winning 2025 Kerry Holdings Limited UROP Awards! 04/2025 One paper was accepted in Nature Biomedical Engineering, Congrats to Jiabo and Zhengrui! 04/2025 Two papers were accepted in Medical Image Analysis, Congrats to Luyang and Lin Yi! 04/2025 Two papers were accepted in IEEE TMI, Congrats to Zhixuan and Junlin! 03/2025 Three papers were accepted in CVPR 2025, Congrats to Yingxue, Zhengrui and Yequan! 02/2025 Two papers were accepted in Medical Image Analysis, Congrats to Yifeng and Cai Yu! 01/2025 Two papers were accepted in ICLR 2025, Congrats to Haoxuan and Zhengrui! 01/2025 One paper was accepted in Nature Communications, Congrats to Luyang! 01/2025 Invited to serve as Area Chair for MICCAI 2025. 01/2025 One paper was accepted in IEEE TMI, Congrats to Lin Yi! Biography Dr Chen is an Assistant Professor at Department of Computer Science and Engineering, Department of Chemical and Biological Engineering and Division of Life Science, Hong Kong University of Science and Technology (HKUST). He leads the Smart Lab focusing on AI in healthcare. He also serves as Director of Collaboration Center for Medical and Engineering Innovation and Associate Director in Center of Medical Imaging and Analysis, HKUST. He obtained Hong Kong PhD Fellowship in 2013 and received PhD degree from The Chinese University of Hong Kong (CUHK). He was a postdoctoral research fellow in CUHK and a visiting scholar in Utrecht University Medical Center previously. He also has rich industrial research experience including Siemens and co-founded a startup. He holds a dozen of patents in AI and medical image analysis. He received several premium awards including Best Paper Award in MIAR 2016, CUHK Faculty Outstanding Thesis Award in 2017, MICCAI Young Scientist Publication Impact Award in 2019, Forbes China 30 under 30 and Asian Young Scientist Fellowship. He also led the team winning 15+ grand challenges, such as RSNA Challenge on Pneumonia Screening, etc. Research Interests Large and Trustworthy AI (e.g., Generalizability, Multimodal, Explainability, Privacy) for Biomedcine, Medical Image Analysis, Computational Pathology, Deep Learning, Computer-Assisted Intervention/XR, Bioinformatics, etc. Selected Awards 06/2025 HKUST Engineering Young Investigator Research Award 2024-25 2022-2025 UROP Faculty Research Award 2024-2025 Highly Cited Researcher by Clarivate 2022-2024 Top 2% of the World's Top Scientists\" in both \"Long-term Career Impact\" and \"Annual Impact\" lists 08/2024 Best Paper Award of TAI4H Workshop, IJCAI 2024 07/2024 HKUST CSE Best CSE FYP (Champion) 10/2023 The First Prize of Beijing Science and Technology Award 10/2023 OMIA-X Prestigious Achievement Award 10/2023 IEEE TMI Distinguished Reviewer Award (Platinum Level) 06/2023 Ministry of Education Higher Education Outstanding Scientific Research Output Awards (Second Author) 05/2023 The Asian Young Scientist Fellowship (AYSF) 2023 01/2023 Distinguished Reviewers Award of CMIG in recognition of distinguished service to the journal and its authors 08/2022 IEEE TMI Distinguished Reviewer Award (Gold Level) 02/2022 Computerized Medical Imaging and Graphics (CMIG) Outstanding Reviewer Award 07/2021 World Artificial Intelligence Conference (WAIC) SAIL Award 02/2021 IEEE TMI Distinguished Reviewer Award (Gold Level) 10/2019 MICCAI Young Scientist Impact Award 10/2019 Forbes China 30 under 30 08/2018 CUHK Faculty Outstanding Thesis Award 09/2017 Best Paper Award of Medical Image Analysis-MICCAI 2017 09/2016 MIAR Best Paper Award, Switzerland 03/2013 Hong Kong PhD Fellowship 10/2012 Gold Medal, Beihang University Selected Invited Talks ◎2025-04 Harnessing Large AI Models for Transforming Healthcare, Industry Engagement Day+, HKUST. ◎2024-09 Towards Multimodal Data Integration for Precision Oncology via Foundation Model, 8th Digital Pathology and AI Congress Asia 2024, Singapore. ◎2023-08 Advance Medical Imaging with Vision and Language Models, IJCAI-2023 Session on Medical Large Models, Symposium on Large Language Models (LLM 2023), Macao. ◎2023-08 Explainable Artificial Intelligence for Healthcare: Where Are We Now? International Conference on AI in Medicine. Singapore. ◎2023-05 Artificial Intelligence for COVID-19 Lesion Quantification from Radiology Images. APEC Workshop. Indonesia. ◎2022-11 Towards Trustworthy AI for Medical Imaging and Analysis. Keynote, AICI Forum, Australia. ◎2022-10 Label-Efficient Deep Learning for Medical Image Analysis. International School on Deep Learning, Sweden. ◎2022-08 Towards Trustworthy AI for Medical Imaging and Analysis. SenseTime/CUHK Medicine Joint Seminar. ◎2022-02 Not-so-supervised Deep Learning for Medical Image Analysis. MICS China ◎2021-12 Artificial Intelligence in Medical Imaging and Analysis: Progress, Promises and Pitfalls. HKSTP X HKMA CME Lecture ◎2021-02 Deep Learning for Large-scale Computational Pathology. Hong Kong Pathology Forum ◎2020-01 PathLAKE Masterclass: Data Science for Computational Pathology, UK ◎2019-10 How Deep Learning Can Help in the Radiology Diagnosis? Keynote in 2019 Macao Radiology Association Annual Scientific Meeting, China ◎2019-9 How Deep Learning Can Help in the Clinical Diagnosis? Create, Manage, and Deploy in the Clinical Workflow. Keynote in MICCAI CLIP Workshop, China ◎2019-3 AI in OCT: What is 3D Deep Learning? Asia-Pacific Academy of Ophthalmology Congress. Bangkok, Thailand ◎2016-07 Deep Learning for Histopathology Image Analysis, Medical Vision Workshop in CVPR 2016 (Las Vegas) ◎2016-01 Deep Learning in Medical Imaging (National Institute of Health, Washington) Selected Publications [Full publication list is available in Google Scholar] GSCo: Towards Generalizable AI in Medicine via Generalist-specialist Collaboration. Sunan He*, Yuxiang Nie*, Hongmei Wang, Shu Yang, Yihui Wang, Zhiyuan Cai, Zhixuan Chen, Yingxue Xu, Luyang Luo, Huiling Xiang, Xi Lin, Mingxiang Wu, Yifan Peng, George Shih, Ziyang Xu, Xian Wu, Qiong Wang, Ronald Cheong Kin Chan, Varut Vardhanabhuti, Winnie Chiu Wing Chu, Yefeng Zheng, Pranav Rajpurkar, Kang Zhang, Hao Chen#. Nature Biomedical Engineering 2025 A Generalizable Pathology Foundation Model using A Unified Knowledge Distillation Pretraining Framework. Jiabo Ma*, Zhengrui Guo*, Fengtao Zhou, Yihui Wang, Yingxue Xu, Jinbang Li, Fang Yan, Yu Cai, Zhengjie Zhu, Cheng Jin, Yi Lin, Xinrui Jiang, Chenglong Zhao, Danyi Li, Anjia Han, Zhenhui Li, Ronald Cheong Kin Chan, Jiguang Wang, Peng Fei, Kwang-Ting Cheng, Shaoting Zhang#, Li Liang#, Hao Chen#. Nature Biomedical Engineering 2025 A Large Model for Non-invasive and Personalized Management of Breast Cancer from Multiparametric MRI. Luyang Luo, Mingxiang Wu, Mei Li, Yi Xin, Qiong Wang, Varut Vardhanabhuti, Winnie CW Chu, Zhenhui Li#, Juan Zhou#, Pranav Rajpurkar, Hao Chen#. Nature Communications 2025 A Multimodal Knowledge-enhanced Whole-slide Pathology Foundation Model. Yingxue Xu*, Yihui Wang*, Fengtao Zhou, Jiabo Ma, Shu Yang, Huangjing Lin, Xin Wang, Jiguang Wang, Li Liang, Anjia Han, Ronald Cheong Kin Chan, Hao Chen#. Nature Communications 2025 Learning Co-plane Attention across MRI Sequences for Diagnosing Twelve Types of Knee Abnormalities. Zelin Qiu*, Zhuoyao Xie*, Huangjing Lin, Yanwen Li, Qiang Ye, Menghong Wang, Shisi Li, Yinghua Zhao#, Hao Chen#. Nature Communications 2024 FreeTumor: Large-scale Generative Tumor Synthesis in Computed Tomography Images for Improving Tumor Recognition. Linshan Wu, Jiaxin Zhuang, Yanning Zhou, Sunan He, Jiabo Ma, Luyang Luo, Xi Wang, Xuefeng Ni, Xiaoling Zhong, Mingxiang Wu, Yinghua Zhao, Xiaohui Duan, Varut Vardhanabhuti, Pranav Rajpurkar, Hao Chen#. Nature Communications",
  "content_length": 15140,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:22"
}