{
  "name": "Hao Chen 0002",
  "homepage": "http://www.aimlab.org/haochen",
  "status": "success",
  "content": "Hao Chen Hao Chen Professor Software Building 466 College of Computer Science and Electronic Engineering Hunan University Changsha, China, 410082 email: haochen at hnu dot edu dot cn email: haochen at aimlab dot org My main research interests include parallel and distributed systems and systems security. Some of my current projects involve building high performance heterogeneous computing systems and storage systems based on GPUs and persistent memory. My recent work on vCUDA, a system we built to deploy GPU devices in virtual machines, has been inspiring the research and development of GPU virtualization in many areas. I am a Professor in the College of Computer Science and Electronic Engineering, Hunan University. I joined Hunan University in May 2005, after I received my PhD in Computer Science at Huazhong University of Science and Technology, where I led the development of Anysee, one of the early P2P-based media streaming systems in China. From 2012 to 2013, I was a visiting scholar at the Department of Computer Science in the University of Warwick. I won the award of Program for New Century Excellent Talents in University of China in 2013. Opening Positions I'm looking for self-motivated PhD/Master students, postdocs, and undergraduate interns with solid background in building systems. If you are interested, drop me a message or have a talk in my office. Selected Publications Halo: A Hybrid PMem-DRAM Persistent Hash Index with Fast Recovery [PDF] Daokun Hu, Zhiwen Chen, Wenkui Che, Hao Chen, and Jianhua Sun. In the Proceedings of the 2022 ACM SIGMOD/PODS International Conference on Management of Data (SIGMOD'22), June 12-17, 2022, USA. Fast, Flexible, and Comprehensive Bug Detection for Persistent Memory Programs [PDF] Bang Di, Jiawen Liu, Hao Chen, and Dong Li. In the Proceedings of International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS'21), April 19-23, 2021, Virtual, USA. Persistent Memory Hash Indexes: An Experimental Evaluation [PDF] Daokun Hu, Zhiwen Chen, Jianbing Wu, Jianhua Sun, and Hao Chen In the Proceedings of 47th International Conference on Very Large Data Bases (VLDB'21), August 16-20, 2021, Copenhagen, Denmark. Enabling Energy-Efficient DNN Training on Hybrid Accelerators [PDF] Xin He, Jiawen Liu, Zhen Xie, Hao Chen, Guoyang Chen, Weifeng Zhang, Dong Li. In the Proceedings. of the 35th International Conference on Supercomputing (ICS'21), June 14-18, 2021, Virtual. Efficient Buffer Overflow Detection on GPU [PDF] Bang Di, Jianhua Sun, Hao Chen, and Dong Li. IEEE Transactions on Parallel and Distributed Systems (TPDS), 2021, 32(5):1161-1177. GMOD: A Dynamic GPU Memory Overflow Detector [PDF | code] Bang Di, Jianhua Sun, Dong Li, Hao Chen, and Zhe Quan. In the Proceedings of the 27th International Conference on Parallel Architectures and Compilation Techniques (PACT'18), November 1-4, 2018, Limassol, Cyprus. Optimizing Graph Processing on GPUs [PDF] Wenyong Zhong, Jianhua Sun, Hao Chen, Jun Xiao, Zhiwen Chen, Chang Cheng, and Xuanhua Shi. IEEE Transactions on Parallel and Distributed Systems (TPDS), 2017, 28(4):1149-1162. Redundant Network Traffic Elimination with GPU Accelerated Rabin Fingerprinting [PDF | code] Jianhua Sun, Hao Chen, Ligang He, and Huailiang Tan. IEEE Transactions on Parallel and Distributed Systems (TPDS), 2016, 27(7): 2130-2142. Coral: A Cloud-Backed Frugal File System [PDF] Cheng Chang, Jianhua Sun, and Hao Chen. IEEE Transactions on Parallel and Distributed Systems (TPDS), 2016, 27(4): 978-991. A Fast RPC System for Virtual Machines [PDF] Hao Chen, Lin Shi, Jianhua Sun, Kenli Li, and Ligang He. IEEE Transactions on Parallel and Distributed Systems (TPDS), 2013, 24(7):1267-1276. vCUDA: GPU-accelerated High Performance Computing in Virtual Machines [PDF] Lin Shi, Hao Chen, Jianhua Sun, and Kenli Li. IEEE Transactions on Computers (TC), 2012, 61(6):804-816. Full publication list Selected Teaching Activities Operating Systems: [Fall17][Fall16][Fall15][Fall14] Design and Implementation of Operating Systems: [Summer16][Summer17][Summer18] Internet Computing [Spring16][Spring15][Spring14]",
  "content_length": 4149,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:23"
}