{
  "name": "Hao Zheng 0005",
  "homepage": "http://haozheng.us",
  "status": "success",
  "content": "Home Hao Zheng Assistant Professor University of Central Florida Previous Next About MeHao Zheng is a tenure-track Assistant Professor in the Department of Electrical and Computer Engineering at the University of Central Florida. Hao Zheng received his Ph.D. degree from George Washington University, advised by Prof. Ahmed Louri. His research interests are in the areas of computer architecture and machine learning, with emphasis on AI/ML systems, hardware accelerators, on-/off-chip communications, manycore processors, chiplet-based systems, and AI-assisted chip design. His work has been published in top-tier computer architecture and EDA conferences and journals such as ISCA, MICRO, HPCA, DAC, ICCAD, DATE, TPDS, and TETC. He is the recipient of the National Science Foundation (NSF) CAREER Award. He has served on the organization and technical program committees of top computer system conferences, and has served as a panelist on multiple NSF programs. He is currently serving as an Associate Editor for IEEE Transactions on Computers and IEEE Transactions on Sustainable Computing.I am teaching EEL6938 - Computer Archiecture for AI/ML in Fall 2025. HiringWe have 3 Ph.D. openings for Fall/Spring 2026. We are looking for students who are passionate about research in the fields of computer architecture and machine learning. Our research aims to advance the theory and computer architecture developments for AI/ML, and the research outcomes will be integrated in real-world applications through our collaboration. All PhD positions will be fully funded. If you are interested, please do not hesitate to send your CV and transcripts to Hao.Zheng@ucf.edu. (more details) Lab News11/2025 One paper is accepted in HPCA'2609/2025 One paper is accepted in NeurIPS'2507/2025 One paper is accepted in MICRO'25.03/2025 One paper is accepted in ISCA'25.11/2024 One paper is accepted in HPCA'25.07/2024 One paper is accepted in MICRO'24.06/2024 One paper is accepted in ICCAD'24.03/2024 One paper is accepted in ISCA'24.02/2024 Two papers are accepted in DAC'24. 01/2024 One paper is accepted in IPDPS'24.See all News Selected Publications[HPCA'26] Fangzhou Ye, Lingxiang Yin, and Hao Zheng, “Scaling Graph Neural Network Training via Geometric Optimization”, in Proceedings of IEEE International Symposium on High-Performance Computer Architecture (HPCA), Sydney, Australia, January 2026.[NeurIPS'25] Amir Ghazizadeh Ahsaei, Rickard Ewetz, Hao Zheng “GAMMA: Gated Multi-hop Message Passing for Homophily-Agnostic Node Representation in GNNs”, in Proceedings of Annual Conference on Neural Information Processing Systems (NeurIPS), San Diego, CA, December 2-7, 2025.[MICRO'25] Amir Ghazizadeh Ahsaei, Lingxiang Yin, Shilin Tian, Fangzhou Ye, Fan Yao, Hao Zheng “Rethinking Tiling and Dataflow for SpMM Acceleration: A Graph Transformation Framework”, in Proceedings of IEEE/ACM International Symposium on Microarchitecture (MICRO), Seoul, South Korea, October 2025.[ISCA'25] Jiaqi Yang, Hao Zheng, and Ahmed Louri, “DiTile-DGNN: An Efficient Accelerator for Distributed Dynamic Graph Neural Network Inference”, in Proceedings of ACM/IEEE International Symposium on Computer Architecture (ISCA), Tokyo, Japan, June 2025.[HPCA'25] Jiaqi Yang, Hao Zheng, and Ahmed Louri, “I-DGNN: A Graph Dissimilarity-based Framework for Designing Scalable and Efficient DGNN Accelerators”, in Proceedings of IEEE International Symposium on High-Performance Computer Architecture (HPCA), Las Vegas, NV, March 2025.[MICRO'24] Lingxiang Yin, Sanjay Gandham, Mingjie Lin, Hao Zheng, “SCALE: A Structure-Centric Accelerator for Message Passing Graph Neural Networks”, in Proceedings of IEEE/ACM International Symposium on Microarchitecture (MICRO), Austin, Texas, November 2-6, 2024. [ICCAD'24] Sanjay Gandham, Joe Walston, Sourav Samanta, Lingxiang Yin, Hao Zheng, Mingjie Lin, Stelios Diamantidis, \"CircuitSeer: RTL Post-PnR Delay Prediction via Coupling Functional and Structural Representation\", in Proceedings of ACM/IEEE International Conference on Computer-Aided Design (ICCAD), New Jersey, USA, Oct 27-21, 2024. [ISCA'24] Md Hafizul Chowdhuryy, Hao Zheng and Fan Yao, \"MetaLeak: Uncovering Side Channels in Secure Memory Architectures Exploiting Metadata\", in Proceedings of 51th International Symposium on Computer Architecture (ISCA'24), Buenos Aires, Argentina, June 29–July 3, 2024. [DAC'24] Fangzhou Ye, Lingxiang Yin, Amir Ghazizadeh Ahsaei, Hao Zheng \"EGMA: Enhancing Data Reuse and Workload Balancing in Message Passing GNN Acceleration via Gram Matrix Optimization\", in Proceedings of 61th Design Automation Conference (DAC’24), San Francisco, June 23-27, 2024. [DAC'24] Shilin Tian, Chase Szafranski, Ce Zheng, Fan Yao, Ahmed Louri, Chen Chen, Hao Zheng \"VITA: ViT Acceleration for Efficient 3D Human Mesh Recovery via Hardware-Algorithm Co-Design\", in Proceedings of 61th Design Automation Conference (DAC’24), San Francisco, June 23-27, 2024. [ICCAD'23] Lingxiang Yin, Amir Ghazizadeh, Ahmed Louri, Hao Zheng, \"ARIES: Accelerating Distributed Training in Chiplet-based Systems via Flexible Interconnects\",  in Proceedings of International Conference on Computer-Aided Design (ICCAD), San Francisco, CA, October 29 - November 2, 2023. [ICCAD'23] Sanjay Gandham*, Lingxiang Yin*, Hao Zheng, Mingjie Lin, ''SAGA: Sparsity-Agnostic Graph Convolutional Network Acceleration with Near-optimal Workload Balance\",  in Proceedings of International Conference on Computer-Aided Design (ICCAD), San Francisco, CA, October 29 - November 2, 2023.  (* Co-first Authors)[ICCAD'23] Muhammad Rashedul Haq Rashed, Sven Thijssen, Hao Zheng, Sumit Kumar Jha, Rickard Ewetz, ''Path-based Processing using In-Memory Systolic Arrays for Accelerating Data-Intensive Applications\", in proceedings of International Conference on Computer-Aided Design (ICCAD), San Francisco, CA, October 29 - November 2, 2023.[DAC'23] Jiaqi Yang, Hao Zheng, and Ahmed Louri, “Venus: A Versatile Deep Neural Network Accelerator Architecture Design for Multiple Applications,” in Proceedings of 60th Design Automation Conference (DAC’23), San Francisco, July 9-13, 2023.[ISCA'23] Jiajun Li, Yuxuan Zhang, Hao Zheng, and Ke Wang, “ FDMAX: An Elastic Accelerator Architecture for Solving Partial Differential Equations,”  in Proceedings of 50th International Symposium on Computer Architecture (ISCA'50), Orlando, FL, June 17–21, 2023.[HPCA'21] Hao Zheng, Ke Wang, and Ahmed Louri, \"Adapt-NoC: A Flexible Network-on-Chip Design for Heterogeneous Manycore Architecture\", in Proceedings of the 27th IEEE International Symposium on High-Performance Computer Architecture (HPCA'21), Seoul, South Korea, Feb. 27 - Mar. 3, 2021.[DAC'20] Hao Zheng, Ke Wang and Ahmed Louri, “A Versatile and Flexible Chiplet-based System Design for Heterogeneous Manycore Architectures,” in Proceedings of 57th Design Automation Conference (DAC’20), Virtual Conference, July 19-23, 2020.[DAC'19] Hao Zheng and Ahmed Louri, “An Energy-Efficient Network-on-Chip Design using Reinforcement Learning,” in Proceedings of 56th Design Automation Conference (DAC’19), Las Vegas, NV, June 2-6, 2019. PatentsHao Zheng and Ahmed Louri, \"EZ-Pass: An Energy & Performance-Efficient Power-Gating Router Architecture for Scalable NoCs.\", U.S. Patent, US 11502934 B2, Granted, Nov. 2022 Hao Zheng, Ke Wang, and Ahmed Louri,, \"A Versatile and Flexible Interconnection Network Design for Chiplet-Based Manycore Architecture\", U.S. Patent, US 11489788 B2, Granted, Nov. 2022Jiaqi Yang, Hao Zheng, Ahmed Louri, \"Versatile Accelerator Design for Multiple Deep Neural Network Applications\", U.S. Patent, 63/665,776, Filed, Pending, July 2024.Ke Wang, Hao Zheng, and Ahmed Louri, “Learning-Based High-Performance, Energy-Efficient, and Secure Interconnection Design Framework”,  U.S. Patent, No. 63/019,720, Granted, Jan. 2025. Professional ActivitiesEditorial Board:Associate Editor, IEEE Transactions on Computers, 2025 - present;Associate Editor, IEEE Transactions on Sustainable Computing, 2025 - present;Program Committee: ISCA'26 (LPC); MLSys'26 (ERC); ICS'26; ISPASS'25-26; DAC'24-26; ICCAD'24-25; ICPP'25; GLSVLSI'24; IPDPS'23-24; IISWC'23; SRC@ASP-DAC'23; HiPC'22; NAS'22;Organization Committee: Finance Chair, ISCA'23; Artifact Evaluation Co-Chair, IISWC'23; Registration Chair, ICCD'23; Local Arrangement Co-Chair, IPDPS'23; Web Chair, HPCA'19;Journal Reviewer: IEEE Transactions on Computers; ACM/IEEE Transactions on Networking;  IEEE Transactions on Cloud Computing; IEEE Transactions on Circuits and Systems II;  IEEE Transactions on Sustainable Computing; IEEE Transactions on Very Large Scale Integration (VLSI); IEEE Micro; IEEE Computer Architecture Letter; IEEE Transactions on Parallel and Distributed Systems; ACM Transactions on Architecture and Code Optimization (TACO);  IEEE Journal on Emerging and Selected Topics in Circuits and Systems; IEEE Transactions on Emerging Topics in Computing (TETC); AwardsNSF CAREER Award, 2025ECE Best Dissertation Award, GWU, 2022Best Paper Finalist, Design Automation Conference, 2020First Place in ECE, SEAS R&D Showcase, 2019First Place in Engineering, GWU Research Days, 2019NSF GW I-Corps Site Grant Award, 2019Dean Summer Award Fellowship, 2018Second Place in Engineering, GWU Research Days, 2018Phillip/Temofel Sprawcew Endowment Scholarship, 2017 Contact Hao.Zheng@ucf.edu Thanks for filling out the form! SEND MESSAGE",
  "content_length": 9392,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:28"
}