{
  "name": "Hao Wu 0017",
  "homepage": "https://classicwuhao.github.io",
  "status": "success",
  "content": "Hao Wu Hao Wu Papers Tools Resume Assistant Professor Computer Science Department, Eolas Building, Maynooth University. haowu@cs.nuim.ie Room 135 CV GitHub Research My research aims to create automated software and tools for solving challenging problems in software engineering domain. Currently, I like developing new languages and tools for verifying/testing graph/state-based models. In general, I have strong interests in formal methods, programming languages design, program synthesis, relational database and software testing. Many our work is based on using SAT/SMT solvers , those super well-engineered solvers that make it easier to create fully automated tools for program verification, model reasoning and more . News Nov,2025 Ankit and Dan presented their research at PhD Symposium at iFM 2025. Oct,2025 Members of PoP research group presented their posters during the research week. Sept,2025 Weclome Sun lihao and Shi Hao To to join the group. June,2025 I gave a talk on how to verify C, C++ and C# programs to C++ user group in Dublin. May,2025 One paper about how to verify OCL pre/post condition using Cyclone is accepted at OCL 2025 May,2025 One paper about measuring complexity of OCL expressions is accepted at OCL 2025 March/April,2025 Prof. Dominique visited research group. Jan,2025 New Cyclone online editor is here. I am always looking for highly motivated students (PhD) with strong programming and mathematical skills. If you are interested in my research area, please get in touch with me. Current Research Students Ankit Jha (Ph.D. Student) Zhang Huan (Ph.D. Student) Dan Farcas (Ph.D. Student) Sun Lihao (Ph.D. Student) Ding Yuelou (MS.c. Student) Shi Hao To (MS.c. Student) Past Students YiShun Xiang (Intern-2024) -> Cambridge Craig Sean Finnerty (Intern-2023) -> MSc Engineering Bastien Turco (Intern-2023) -> Software developer (Nancy, France) Viviana Bastidas (PhD-2020, co-supervised with Prof. Markus Helfert) -> Cambridge Jose Surabhil (MSc-2019) -> Optum Ian Dempsey (MSc-2018) -> Workday Luo Hui (BSc-2019) -> Amazon Zach Andrew (BSc-2018) -> Ericsson Affiliation I am a member of Principles of Programming (POP) research group within the department and Enterprise Architecture Cluster lead at Innovation Value Institute (IVI). I am also affiliated with Hamilton Institute. Teaching CS264 (2023-2025) CS424 (2023-2025) CS357 (2017-2025) CS355 (2020-2023, 2025) CS620C (2019-2022) CS310 (2015-2019) CS434 (2021,2022) CS431 (2018,2019) CS335 (2017-2019, Zhejiang University) Service (internal) CS Department International Coordinator Member of Faculty of Science Research Committee Member of CS Department Research Committee Service (external) Reviewer for Formal Aspects of Computing (2025) Reviewer for Software and System Modeling (2024) Reviewer for Science of Computing (2024) Reviewer for Computer Communications (2024) Reviewer for IEEE Transactions on Electronics (2024) FMAS@FM(PC) 2019 - 2025 OCL (PC) 2019 - 2025 MODELSWARD (PC) 2017 - 2020 ESSLLI 2017 (PC) iFM 2018 (Publicity Chair/Local Organiser) OCL 2018 (PC Chair) @2020-2025 Hao Wu. All rights reserved. Last update: November 20, 2025",
  "content_length": 3140,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:26"
}