{
  "name": "Hao Yue 0001",
  "homepage": "https://campusdirectory.ucsc.edu/cd_detail?uid=hyue11",
  "status": "success",
  "content": "Campus Directory - UC Santa Cruz UC Santa Cruz MyUCSC People Calendars Maps A-Z Index Search Campus Directory About Admissions Academics Research Campus Life Visit UCSC Quick Start Guides Current Students Faculty & Staff Alumni Prospective Students Parents & Family Community Home » Find People » Campus Directory Search for people, departments, or email addresses. « Back To Search Results Hao Yue Associate Teaching Professor hyue11@ucsc.edu Division Baskin School of Engineering Department/College/Unit Computer Science and Engineering Title Associate Teaching Professor Affiliation Faculty Faculty Type Regular Faculty Primary Office Location Engineering Building 2569 Mail Stop SOE3 Biography, Education and Training Hao Yue received his Ph.D. in Computer Engineering from the University of Florida in 2015. Before joining UCSC, he was the Associate Chair and Associate Professor of the Computer Science Department at San Francisco State University. His research interests are in computer science and engineering education, with a focus on developing innovative curricula, pedagogical methods, and technologies to reduce learning barriers and eliminate equity gaps. Research Interests Computer Science and Engineering Education AI in Education Large Language Models Awards, Honors and Grants Best Paper Award, IEEE International Conference on Hot Information-Centric Networking, 2019 Best Journal Paper Award IEEE Communications Society, 2018 Best Paper Award, IEEE International Conference on Mobile Ad-hoc and Sensor Networks, 2017 Courses CSE 20: Beginning Programming in PythonCSE 30: Abstractions in Python If you have the proper permissions, you can edit this entry This campus directory is the property of the University of California at Santa Cruz. To protect the privacy of individuals listed herein, in accordance with the State of California Information Practices Act, this directory may not be used, rented, distributed, or sold for commercial purposes. For more details, please see the university guidelines for assuring privacy of personal information in mailing lists and telephone directories. If you have any questions please contact the ITS Support Center. UC Santa Cruz, 1156 High Street, Santa Cruz, Ca 95064 ©2018 Regents of the University of California. All Rights Reserved. (2) Feedback Accreditation Non-Discrimination Policy Employment Privacy Policy & Terms of Use Sexual Violence Prevention & Response Last modified: July 30, 2018",
  "content_length": 2462,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:28"
}