{
  "name": "Hao Li 0011",
  "homepage": "https://aquatoney.github.io",
  "status": "success",
  "content": "Hao Li (李昊) :: About Hao Li (李昊) is an associate professor at the School of Computer Science and Technology, Xi’an Jiaotong University in P.R. China. He received his Ph.D. degree from Department of Computer Science and Technology, Xi’an Jiaotong University in 2016. He is mainly interested in networked systems, including programmable networks, middleboxes and network verification. He is a member of ANTS Lab. We Want You I’m looking for self-motivated Master/Ph.D students to work with me at XJTU. Feel free to drop me an email with your CV. Feel free to contact me too, if you are an undergradute and interested in internship opportunities in our group. Contact Info #234 Pengkang Building, Xingqing #6086 Hongli Building, iHabor hao.li at xjtu.edu.cn Selected Papers (Full List) SIGCOMM 2025 S2: A Distributed Configuration Verifier for Hyper-Scale Networks EuroSys 2025 Occamy: A Preemptive Buffer Management for On-chip Shared-memory Switches ToN 2023 Programming Network Stack for Physical Middleboxes and Virtualized Network Functions NSDI 2023 LemonNFV: Consolidating Heterogeneous Network Functions at Line Speed ToN 2022 Compiling Cross-Language Network Programs into Hybrid Data Plane NSDI 2022 Differential Network Analysis NSDI 2021 Programming Network Stack for Middleboxes with Rubik CoNEXT 2020 A Modular Compiler for Network Programming Languages ToN 2020 Application-Oblivious L7 Parsing Using Recurrent Neural Networks NSDI 2020 APKeep: Realtime Verification for Real Networks INFOCOM 2018 CORA: Conflict Razor for Policies in SDN CoNEXT 2016 Mind the Gap: Monitoring the Control-Data Plane Consistency in Software Defined Networks NetMag 2016 Deep Semantics Inspection over Big Network Data at Wire Speed ANCS 2015 Parsing Application Layer Protocol with Commodity Hardware for SDN JSAC 2014 MP-ROOM: Optimal Matching On Multiple PDUs for Fine-Grained Traffic Identification INFOCOM 2013 ROOM: Rule Organized Optimal Matching for Fine-Grained Traffic Identification",
  "content_length": 1986,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:24"
}