{
  "name": "Hao Su 0001",
  "homepage": "https://cseweb.ucsd.edu/~haosu",
  "status": "success",
  "content": "Welcome to Hao Su's homepage The important thing is not to stop questioning. Curiosity has its own reason for existence. ââAlbert Einstein Home News Research Service Events Teaching Publication Talk Group Opening Hao Su Associate Professor at UC San Diego Chairman & CTO of Hillbot Inc. Bldg EBU3B #4114 Dept. of Computer Science and Engineering UC San Diego, La Jolla, USA academic AT haosu.ai / bio / CV / google scholar / publication Affiliations: The Institute for Learning-enabled Optimization at Scale, Artificial Intelligence Group, Contextual Robotics Institute, Halicioğlu Data Science Institute, Center for Visual Computing Follow @HaoSuLabUCSD on Twitter News [Aug 2, 2025] Three papers accepted by CoRL. Congratulations to all paper authors! [July 24, 2025] Congratulations to my students who have papers accepted by ICCV! Proud of you! [July 13, 2025] I am honored to have been awarded the Frontiers of Science Award. [June 10, 2025] I am honored to have been awarded the TPAMI Young Research Award. [May 2, 2025] Two papers accepted by ICML. Congratulations to all paper authors! [March 18, 2025] Congratulations to my students who have papers accepted by RSS! Proud of you! [Jan 23, 2025] Five papers accepted by ICLR. Congratulations to all paper authors! [Aug 12, 2024] The new websites of ManiSkill and Hillbot are online. Check out them at maniskill.ai and hillbot.ai! [Aug 11, 2024] I am co-founding a startup Hillbot. Hillbot aims to build solutions for general-purpose robots through a pragmatic path. We are hiring! Please check out the website for more details. [July 3, 2024] Two papers accepted by ECCV and one paper accepted by IROS. Congratulations to all paper authors! [May 20, 2024] Great news that X-Embodiment has won the Best Paper Award at ICRA 2024. Congratulations to the authors, especially the lab alumnus, Quan Vuong, who co-led the effort! [Mar 15, 2024] I am going to serve as the Program Chair of CVPR 2025. Honored to have the opportunity to contribute to the community. more + [Feb 26, 2024] Four papers accepted by CVPR. Congratulations to all paper authors! [Jan 22, 2024] Five papers accepted by ICLR (3 spotlights). Congratulations to all paper authors! [Sept 21, 2023] Five papers accepted by NeurIPS, two on 3D foundation models, one on verification of LLM, one on soft-body manipulation, and one on an inverse rendering dataset. [Sept 10, 2023] I am actively searching for high quality Ph.D., Postdoc, Visiting Scholar, and Research Engineer candidates to join my lab. Please check out the opening page for more details. [Aug 30, 2023] I received tenure and promotion to Associate Professor with acceleration and bonus. My deepest gratitude goes to my students, collaborators, and colleagues! [Aug 30, 2023] I received NSF CAREER Award. [Aug 30, 2023] Two papers accepted by RA-L. One on hand-eye calibration and the other on sim2real transferrable object manipulation. [Aug 20, 2023] Invitations to Associate Editor of ICRA and Area Chair of ICLR for 2024 accepted. [Aug 15, 2023] Three papers accepted by ICCV, on vision-language foundation model and 3D generative models. [Apr 25, 2023] Three papers accepted to ICML (one oral). [Mar 27, 2023] One paper accepted to SIGGRAPH. [Feb 27, 2023] Three papers accepted to CVPR. [Jan 20, 2023] I am invited to serve as the PC of SGP 2023. [Jan 22, 2023] Five papers accepted to ICLR. [Jan 20, 2023] I am invited to serve as the AE of IROS 2023. [Nov 8, 2022] My talk on Learning Generic and Generalizable Object Manipulation Policies is available. [Oct 8, 2022] Two papers accepted to CoRL. [July 4, 2022] Two papers accepted to ECCV (1 oral, 1 poster with three strong accept). [July 6, 2022] Recordings for our CVPR tutorial Building and Working in Environments for Embodied AI are released. [July 6, 2022] My talk Deep Learning on Point Clouds at SGP is now available. [June 28, 2022] Our tutorial Radiance Field Models for Photorealistic Rendering is now available (in Chinese). [June 13, 2022] Welcome to our CVPR 2022 tutorial Building and Working in Environments for Embodied AI. [May 15, 2022] We have two papers accepted to ICML (model-based RL, large-scale RL). [Apr 28, 2022] Welcome to our ICLR workshop on Generalizable Policy Learning in the Physical World! Videos will be uploaded to Youtube. [Mar 29, 2022] One paper accepted to ICLR, two papers (1 oral) accepted to CVPR, two papers accepted to SIGGRAPH (journal track). [Feb 24, 2022] Job Opening: Looking for postdoc and senior visiting Ph.D. researcher in learning-based 3D capturing. [Oct 11, 2021] ManiSkill accepted by NeurIPS (dataset track). [Oct 1, 2021] We have two papers accepted by NeurIPS (visual RL, 3D physics data understanding). [July 29, 2021] The National Science Foundation (NSF) announced a $20 million investment over five years for The Institute for Learning-enabled Optimization at Scale (TILOS). SU Lab is part of TILOS. [July 22, 2021] Four papers accepted at ICCV 2021 (two orals). [May 29, 2021] Welcome to our ICCV workshop of SEAI: Simulation Technology for Embodied AI and Structural and Compositional Learning on 3D Data. [Mar 1, 2021] Two paper accepted at CVPR 2021 (oral). [Jan 28, 2021] One paper in collaboration with Prof. Rajesh Gupta's group accepted at AISTATS (oral). [Jan 13, 2021] One paper (transcription factor binding) accepted at Nature Machine Intelligence (Jan 2021 volume). [Jan 12, 2021] Two papers (model-based policy learning (spotlight), 3D learning (poster)) accepted at ICLR 2021. [Dec 9, 2020] I am giving invited talks at UPenn, UToronto, Nvidia, and 3DGV on Compositional Generalizability. [Nov 6, 2020] Check out the latest technical report on a proposal of benchmarking the learning of embodied AI (robotics)! [Sept 25, 2020] Three papers (Algorithm learning, Generalizable reinforcement learning) accepted at NeurIPS 2020. [July 2, 2020] Two papers (3D Reconstruction) accepted at ECCV 2020. [June 30, 2020] One paper (Learning for SLAM) accepted at IROS 2020. [May 31, 2020] One paper (ML theory) accepted at ICML 2020. [Mar 13, 2020] Four papers (3D learning, simulator) accepted at CVPR 2020, two orals and two posters. [Dec 20, 2019] Two papers (3D learning, imitation learning) accepted at ICLR 2020. [Oct 26, 2019] The 2019 version of 3D Deep Learning Tutorial is online now! [Oct 22, 2019] I am serving on the Area Chair for CVPR 2020, ECCV 2020, the Senior Program Committee of AAAI 2020 this year. [Sep 7, 2019] One paper (grasping by 3D learning) accepted at Conference on Robotics Learning (CoRL) 2019 (27.6% acceptance rate). [Sep 3, 2019] One paper (model-based reinforcement learning) accepted at NeurIPS 2019. [Sep 1, 2019] Zhan Ling, Minghua Liu, and Xiaoshuai Zhang are joining SU Lab as new Ph.D. students! [Sep 1, 2019] Tongzhou Mu is promoted to Ph.D. after two years of hard work as a master student! [Aug 6, 2019] I have received the best doctorate thesis award honorable mention from ACM SIGGRAPH. [July 28, 2019] One paper accepted at SIGGRAPH Asia 2019. [July 22, 2019] One paper accepted at ICCV 2019 as oral. [Mar 25, 2019] One paper accepted at SIGGRAPH 2019. [Feb 25, 2019] Five papers from my students have been accepted at CVPR 2019. [Sep 4, 2018] I have one paper accepted at NIPS 2018. [Sep 4, 2018] I have one paper accepted at SIGGRAPH Asia 2018. [July 10, 2018] I am thrilled that ShapeNet has received the dataset award of SGP (Symposium on Geometry Processing) 2018! [Apr 15, 2018] I am proud to have Jiayuan Gu, Zhiao Huang, Zhiwei Jia, Ronald Yu, and Rui Zhu join my group as Ph.D. students starting from this fall! [Feb 19, 2018] I have 4 papers accepted at CVPR 2018. [July 7, 2017] A set of tutorial slides for 3D deep learning is uploaded. See the Talk and Course section of this webpage. [Jun 6, 2017] I will join the Computer Science and Engineering Department of UC San Diego as an assistant professor starting from July 1, 2017. [May 5, 2017] I am serving the program chair of 3DV 2017. [Mar 31, 2017] I am organizing the IEEE Workshop on Learning to See from 3D Data in conjunction with ICCV 2017, Venice, Italy. [Mar 31, 2017] I have one paper accepted at SIGGRAPH 2017. [Feb 27, 2017] I have 5 papers (2 first author orals, 1 spotlight, 2 posters) accepted at CVPR 2017. [Feb 24, 2017] I am giving an invited talk at UC San Diego in April. [Feb 10, 2017] I am giving an invited talk at Cornell University in April. [Jan 17, 2017] I am organzing a tutorial on 3D Deep Learning at CVPR 2017, Hawaii, USA. [Dec 15, 2016] Posted the slides of my recent talks on 3D representation learning and synthesis for learning. They summarize the majority of my efforts in the past 3 years. [Nov 24, 2016] I am giving talks at MIT (Brain and Cognitive Sciences Department and CSAIL), on 3D object reconstruction and abstraction by deep learning. I will give a talk at Adobe and Facebook on understanding geometries from sensor data. I am invited to give a talk at NIPS workshop on 3D Deep Learning and 3DV workshop on Understanding 3D and Visuo-Motor Learning. See you there! I have published 1 paper at NIPS, 3 papers at SIGGRAPH Asia, 1 paper at ECCV (spotlight), 2 papers at CVPR (1 spotlight) in 2016, and 1 paper at 3DV (oral) in 2016. I am serving the Publication Chair for International Conference on 3DVision (3DV-16), Stanford, USA. Welcome to join us and visit Stanford! I am organizing the IEEE Workshop on Augmented Reality for Visual Artificial Intelligence (VARVAI), affiliated with ECCV 2016, Amsterdam, The Netherlands I am serving the program committee for the First Workshop on Virtual Reality meets Physical Reality: Modelling and Simulating Virtual Humans and Environments, affiliated with SIGGRAPH Asia 2016, Macau, China I organized the Large-Scale 3D Shape Retrieval Challenge, a subtrack of SHREC2016 Challenge affiliated with EuroGraphics 2016, Lisbon, Portugal To visit Europe for two weeks in early November of 2015 and give talks on Joint Analysis for 2D Images and 3D shapes at several institutes, incl",
  "content_length": 13493,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:25"
}