{
  "name": "Haopeng Chen",
  "homepage": "http://reins.se.sjtu.edu.cn/~chenhp",
  "status": "success",
  "content": "Chen, Haopeng | REINS REINS REliable, INtelligent and Scalable Systems Group Home People Publications Researches Courses Cooperation REINS News About REINS Home Chen, Haopeng REINS Director Join Year: 2004 chen-hp AT sjtu.edu.cn About Him Associate Professor of School of Software (021) 34204124 Room 1111, Software Building, Shanghai Jiao Tong University 800 Dongchuan RD, SH, P.R.China, 200240 [ researches | group people | courses ] Areas of Study Software Engineering, Distributed Computing Bio He received his Ph.D degree from Department of Computer Science and Engineering, Northwestern Polytechinal University in 2001. He has worked in School of Software, Shanghai Jiao Tong University since 2004 after he finished his two-year postdoctoral research job in Department of Computer Science and Engineering, Shanghai Jiao Tong University. He got the position of Associate Professor in 2008. In 2010, he studied and researched in Georgia Institute of Technology as a visiting scholar. His research group focuses on Distributed Computing and Software Engineering. They have kept researching on Web Services, Web 2.0, Java EE, .NET, and SOA for several years. Recently, they are also interested in cloud computing and researching on the relevant areas, such as cloud federation, resource management, dynamic scaling up and down, and so on. Recent Papers 2021 Wang J, Chen H, Zhou F, et al. A-DECS: Enhanced collaborative edge-edge data storage service for edge computing with adaptive prediction[J]. Computer Networks, 2021: 108087. 2020 Zhou F, Chen H. DECS: Collaborative Edge-Edge Data Storage Service for Edge Computing[C]//International Conference on Collaborative Computing: Networking, Applications and Worksharing. Springer, Cham, 2020: 373-391.(Best Student Paper) Zhou F, Chen H, Jiang Z. A Tamper-Resistant and Decentralized Service for Cloud Storage Based on Layered Blockchain[C]//International Conference on Collaborative Computing: Networking, Applications and Worksharing. Springer, Cham, 2020: 482-493. Khan D, Chen H, Din N. Caching Resource Allocation and Mobility Aware in Information-Centric Networking with Mobile Edge Computing Edge Computing[C]//2020 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom). IEEE, accepted. Li P, Chen H. Task Merging Based on Scenarios of Functionally Unique Resources for Deadline-Constrained Workflow Scheduling[C]//2020 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom). IEEE, accepted. 2019 Yin Z, Chen H, Hu F. An advanced decision model enabling two-way initiative offloading in edge computing[J]. Future Generation Computer Systems, 2019, 90: 39-48. Yu Y, Chen H. An Approach to Failure Prediction in Cluster by Self-updating Cause-and-Effect Graph[C]//International Conference on Cloud Computing. Springer, Cham, 2019: 114-129. Sun L, Chen H, Huang F, et al. A Vectorization Approach for Graph-Structured Data to Pattern Recognition[C]//2019 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom). IEEE, 2019: 857-864. Chen S, Qian J, Chen H, et al. Anomaly Subgraph Mining in Large-Scale Social Networks[C]//2019 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom). IEEE, 2019: 883-890. Ketsoi V, Raza M, Chen H. Hand Motion Based Human Computer Interaction Using 3D Convolutional Neural Network[C]//2019 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom). IEEE, 2019: 1147-1154. Raza M, Ketsoi V, Chen H. An Integrative Approach to Robust Hand Detection Using CPM-YOLOv3 and RGBD Camera in Real Time[C]//2019 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom). IEEE, 2019: 1131-1138. Din N, Chen H, Khan D. Mobility-Aware Resource Allocation in Multi-Access Edge Computing Using Deep Reinforcement Learning[C]//2019 IEEE Intl Conf on Parallel & Distributed Processing with Applications, Big Data & Cloud Computing, Sustainable Computing & Communications, Social Computing & Networking (ISPA/BDCloud/SocialCom/SustainCom). IEEE, 2019: 202-209. All Publications REINS Directory Faculty Students Alumni/Alumnae All-in-one REINS on Confs SCF 2017 SCC 2016 ICA3PP 2015 HPCC 2015 ICPADS 2014 HPCC 2014 ICA3PP 2013 CLOUD 2013 ICPE 2013 Member Photos 2016 Students 2015 Students 2014 Students 2013 Students 2012 Students 2011 Students 2010 Students 2009 Students 2008 Students Photos on Grad Days Site Links WebOps Team Monthly Archive REINS Group, School of Software, Shanghai Jiao Tong University",
  "content_length": 5274,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:29"
}