{
  "name": "Haoxian Chen 0001",
  "homepage": "https://faculty.sist.shanghaitech.edu.cn/hxchen",
  "status": "success",
  "content": "Haoxian Chen Haoxian Chen (éæµ©è´¤) Assistant Professor School of Information Science and Technology ShanghaiTech University Email: hxchen[at]shanghaitech.edu.cn Office: Room 1C-503.A, SIST Building 1 CV Short bio: I got my PhD from Upenn in 2023, advised by Prof. Boon Thau Loo. Before joining UPenn, I worked in Prof. Nathan Beckmann's group at CMU, on cache replacement policies. I got my Bachelors from Tsinghua University in Beijing, China, in 2016. I was born and rasied in Zhuhai, China. Research: I am interested in improving software verification efficiency by designing high-level domain-specific languages, with automatic verification and program synthesis support. My research spans many topics: programming languages, software engineering, domain-specific languages, program verification, program synthesis, and network protocols. New students: Interested in joining our group? Start by exploring our projects. Pick a topic that interests you, read the associated paper, and try out the code if available. If you're excited about the work, feel free to email me to discuss further. Projects Explainable network synthesis: Automatic network configuration synthesis from high-level intents has improved network management efficiency and robustness. However, the complexity and dynamic nature of networks often make it difficult for administrators to understand and trust these generated configurations. Our project addresses this issue by using localized subspecifications to enhance explainability, thereby boosting administratorsâ confidence and trust in adopting automatic network management tools. [FMANO'24, HotNets'24] Rule discovery: Entity-enhancing rules offer a principled way to unify logic-based reasoning with machine learning models for knowledge discovery. We design scalable parallel algorithms for discovering logical rules from large datasets, with a focus on incremental discovery under dynamic data, parameter changes, and hyperparameter tuning. On parameter updates:[SIGMOD'25]. Declarative programming for Ethereum smart contracts: We design and implement a declarative domain-specific language for Ethereum smart contracts, which allows programmers to succinctly express contract logic via declarative rules, and perform automatic formal verification. [ FSE'22, ICSE'24 ] [FSE Talk] [Project Code] Featured in Smart Contract Research Forum. Example-driven network protocol specification synthesis We propose a tool to synthesize network protocol specifications from input-output examples. The goal is to reduce the effort and expertise required to specify formal models for network protocols, thus accelerating the adoption of formal methods in networking practice. [ToN'22] [Project Code] Students You Cunhan (å°¤å­ç¿°), MS 2022 Zheng Jiaye (éåä¸), MS 2022 Li Zhicheng (ææºè¯), MS 2023 Xiang Huilin (é¡¹æ §ç³), MS 2023 Chen Tanglin (éæ±¤æ), MS 2024 Zhang Yongzheng (å¼ æ°¸æ¿), MS 2024 Lin Yaxuan (æäºæ), MS 2025 Cao Ruiling (æ¹çç²), MS 2025 Teaching CS131 Compilers, Fall 2024. CS247 Computer-Aided Verification, Spring 2024,2025. CS120 Computer Networks, Fall 2023. Service Program Committee: EuroSys'26 External Review Committee: ATC'25 Program Committee: FAB'24 Program Committee: SoCC'24 Program Committee: SoCC'23 Publications Incremental Rule Discovery in Response to Parameter Updates, SIGMOD'25, Haoxian Chen, Wenfei Fan, Jiaye Zheng [paper] Localized Explanations for Automatically Synthesized Network Configurations , HotNets'24, Amirmohammad Nazari*, Yongzheng Zhang*, Mukund Raghothaman, Haoxian Chen (* co-first authors) [preprint] Practical Declarative Smart Contracts Optimization , FABâ24 Lan Lu, Tao Luo, Jingyi Li, Hongxun Ding, Brendan Massey, Haoxian Chen, Boon Thau Loo Interpretable Network Synthesis via Localized Specifications , FMANOâ24 Haoxian Chen [paper] Verifying Declarative Smart Contracts, ICSE'24 Haoxian Chen, Lan Lu, Brendan Massey, Yuepeng Wang, Boon Thau Loo [paper] Declarative Smart Contracts, FSE'22 Haoxian Chen, Gerald Whitters, Mohammad Javad Amiri, Yuepeng Wang, Boon Thau Loo [PDF] [Slides] [Code] [Presentation] Synthesizing Formal Network Specifications from Input-Output Examples, IEEE/ACM Transactions on Networking (ToN)'22 Haoxian Chen, Chenyuan Wu, Andrew Zhao, Mukund Raghothaman, Mayur Naik, Boon Thau Loo [PDF] [Code] Interpretable Feedback for AutoML and a Proposal for Domain-customized AutoML for Networking (HotNets'21) Behnaz Arzani, Kevin Hsieh, Haoxian Chen [PDF] Towards Example-Guided Network Synthesis (APNET'18) Haoxian Chen, Anduo Wang, and Boon Thau Loo. [PDF] [Slides] LHD: Improving Cache Hit Rate by Maximizing Hit Density (NSDI'18) Nathan Beckmann, Haoxian Chen, and Asaf Cidon. [PDF] SDPA: Toward a Stateful Data Plane in Software-Defined Networking (TON'17) Chen Sun, Jun Bi, Haoxian Chen, Hongxin Hu, Zhilong Zheng, Shuyong Zhu, and Chenghui Wu. [PDF] Felix: Implementing Traffic Measurement on End Hosts Using Program Analysis (SOSR'16) Haoxian Chen, Nate Foster, Jake Silverman, Michael Whittaker, Brandon Zhang, and Rene Zhang. [PDF]",
  "content_length": 5080,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:29"
}