{
  "name": "Haoyu Wang 0001",
  "homepage": "https://howiepku.github.io",
  "status": "success",
  "content": "Haoyu Wang, Professor, HUST HAOYU WANG Home Publications Haoyu Wang Professor, PhD Supervisor Office: Room A401, MingDe Building School of Cyber Science and Engineering, Huazhong University of Science and Technology (HUST), Wuhan, China Email: haoyuwang@hust.edu.cn Google Scholar I am a Full Professor in the School of Cyber Science and Engineering at Huazhong University of Science and Technology (HUST). Before joining HUST in January 2022, I was an Associate Professor (BUPT \"1551 Young Talent Plan\") in the School of Computer Science at Beijing University of Posts and Telecommunications (BUPT). I received my PhD degree in Computer Science from Peking University in 2016. I was a Visiting PhD Student at Carnegie Mellon University (2014-2015) and a Visiting Professor at The Hong Kong Polytechnic University (2019). I am leading the SECURITY PRIDE Research Group (Security, Privacy, and Dependability in Emerging Software Systems). My research covers a wide range of topics in Software Analysis, Privacy and Security, eCrime, Internet/System Measurement, and AI Security. My recent research projects are mainly focused on: 1) Security, privacy and underground market of the mobile app ecosystem 2) Web3/Blockchain Security 3) AI + Program Analysis, LLM Security I have published over 100 peer-reviewed papers in top-tier venues. My research usually targets top-tier Software Engineering Venues (ICSE/FSE/ASE/ISSTA), Security Venues (CCS/NDSS/Oakland/USENIXSec), Web and Measurement Venues (WWW/IMC/SIGMETRICS). I have been awarded 7 best/distinguished paper awards, including WWW 2020 Best Student Paper Award (the first award from China), ACM OOPSLA 2020 Distinguished Paper Award, and ISSTA 2023 Distinguished Paper Award. My group has released a number of tools and datasets, including BREWasm, LibRadar (LibRadar++), WuKong, CHAMP, and RMVDroid, etc. They have been widely used by the research community and the industry. My research has been covered by over 20 media outlets all around the world, including CoinDesk, Yahoo Finance, Coin Geek, Publish0x, nasdaq.com, Cryptonews CoinGenius, etc. I'm always looking for highly motivated Postdocs, PhD/master students, visiting students, and undergraduate interns (RAs) to work in my team. Hard work always pays off! Recent Services Editorial Service Associate Editor: ACM Transactions on Privacy and Security (TOPS), 2024~ Technical Program Committee (TPC) Member 2025: CCS, S&P, NSDI, ISSTA, FSE, IMC, WWW, AsiaCCS, ICSA, PETS/PoPETs, PAM, FC, MobileSoft 2024: CCS, IMC, FSE, ASE, ASE NIER, ISSTA, WWW (Area Chair), PETS/PoPETs Selected Recent Publications (Full List) Web3/Blockchain Security All Your Tokens are Belong to Us: Demystifying Address Verification Vulnerabilities in Solidity Smart Contracts Tianle Sun(s), Ningyu He(s), Jiang Xiao, Yinliang Yue, Xiapu Luo, and Haoyu Wang* USENIX Security 2024 PDF Miracle or Mirage? A Measurement Study of NFT Rug Pulls Jintao Huang(s), Ningyu He(s), Kai Ma(s), Jiang Xiao, Haoyu Wang* SIGMETRICS 2024 PDF Abusing the Ethereum Smart Contract Verification Services for Fun and Profit Pengxiang Ma(s)#, Ningyu He(s)#, Yuhua Huang, Haoyu Wang*, Xiapu Luo NDSS 2024 PDF Mobile Security, Mobile App Ecosystem Analysis Born with a Silver Spoon: On the (In)Security of Native Granted App Privileges in Custom Android ROMs Chao Wang(s)#, Yanjie Zhao(s)#, Jiapeng Deng(s), and Haoyu Wang* The 46th IEEE Symposium on Security and Privacy (Oakland'25) PDF NativeSummary: Summarizing Native Binary Code for Inter-language Static Analysis of Android Apps Jikai Wang(s), Haoyu Wang* ISSTA 2024 PDF Exploring Covert Third-party Identifiers through External Storage in the Android New Era Zikan Dong(s)#, Tianming Liu(s)#, Jiapeng Deng(s), Haoyu Wang*, Li Li, Minghui Yang, Meng Wang, Guosheng Xu, Guoai Xu USENIX Security 2024 PDF AI Security, AI + Program Analysis Large language models for software engineering: A systematic literature review Xinyi Hou(s)#, Yanjie Zhao(s)#, Yue Liu, Zhou Yang, Kailong Wang, Li Li, Xiapu Luo, David Lo, John Grundy, Haoyu Wang* ACM Transactions on Software Engineering and Methodology (TOSEM) PDF WaDec: Decompiling WebAssembly Using Large Language Model Xinyu She(s)#, Yanjie Zhao(s)#, and Haoyu Wang* ASE 2024 PDF DeepWukong: Statically Detecting Software Vulnerabilities using Deep Graph Neural Network Xiao Cheng(s),Haoyu Wang*, Jiayi Hua(s), Guoai Xu and Yulei Sui. Proceedings of ACM Transactions on Software Engineering and Methodology (TOSEM) PDF",
  "content_length": 4483,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:30"
}