{
  "name": "Haoye Tian",
  "homepage": "https://haoyetiancoder.github.io",
  "status": "success",
  "content": "Haoye TIAN @ Aalto University Haoye TIAN (田 昊野) Assistant Professor Department of Computer Science Aalto University Address: Tietotekniikantalo, Konemiehentie 2, 02150 Espoo, Finland Email: haoye.tian aalto.fi | tianhaoyemail gmail.com I am an assistant professor at Aalto University, Finland. I am fortunate to have gained extensive international research experience across leading institutions throughout my academic career. Previously, I was a postdoc at Nanyang Technological University, working with Prof. Yang Liu, and at the University of Melbourne, working with Prof. Bach Le. I obtained my Ph.D. degree from the University of Luxembourg, where I also served as a postdoc under the supervision of Prof. Tegawendé F. Bissyandé and Prof. Jacques Klein. During my post in Luxembourg, I was a visiting scholar with Prof. Claire Le Goues at Carnegie Mellon University and a visiting Ph.D. student with Prof. Shing-Chi Cheung at Hong Kong University of Science and Technology. Before returning to academia, I worked as a machine learning researcher at high-tech giants Tencent and Didi. Visitors are always welcome. News [Oct, 2025] One paper was accepted by ICSE'26. [Sep, 2025] Invited to serve as a PC member for ISSTA'26. [Sep, 2025] Started a new academic journey at Aalto University. [Jun, 2025] Invited to serve as a PC member for FSE'26. [May, 2025] Three papers were accepted by TOSEM. [Jan, 2025] One paper was accepted by TOSEM. [Dec, 2024] Invited to serve as a PC member for ICSE'26. [Dec, 2024] Invited to serve as a Proceedings Co-Chair at APSEC 2025. [Sep, 2024] One paper was accepted by EMNLP'24. [Jul, 2024] Invited to give a talk at Monash University. [Jul, 2024] One paper was accepted by ISSTA'24. [Jun, 2024] Invited to give a talk at Wechat, Tencent. Research interests Software Engineering, Artificial Intelligence, AI4SE in general Software Maintenance, Debugging, Assessment Security and Privacy I am open to collaborations. Google Scholar / DBLP / ORCID My research aims to leverage advanced AI/LLM techniques to systematically maintain, debug and verify software systems while ensuring security and privacy assurance. Specific Topics: Fault Detection Test case generation: [ASE'23] Cross-project bug finding: [IJSEKE'24] [EMSE'24] Security vulnerability detection: [Preprint] Patch Generation Fine-tuning enhancement: [TOSEM'25a] [TOSEM'25c] Inference optimization: [ISSTA'24] [TSE'25] [ICSE'26] [Preprint] Data privacy: [TOSEM'25b] Code Change Assessment Patch correctness prediction: [ASE'20] [TOSEM'22] [ASE'22] [TOSEM'23] Security patch detection: [TOSEM'25d] Code review: [EMNLP'24] Empirical study: [EMSE'21] Code Representations: [AAAI'23] Selected Publications Pre-print Boyang Yang, Zijian Cai, Fengling Liu, Bach Le, Lingming Zhang, Tegawendé F. Bissyandé, Yang Liu, Haoye Tian*. A Survey of LLM-based Automated Program Repair: Taxonomies, Design Paradigms, and Applications. Pre-print Boyang Yang, Jiadong Ren, Shunfu Jin, Yang Liu, Feng Liu, Bach Le, Haoye Tian*. Enhancing Repository-Level Software Repair via Repository-Aware Knowledge Graphs. ICSE'26 Wenqiang Luo, Jacky Wai Keung, Boyang Yang, Jacques Klein, Tegawende F Bissyande, Haoye Tian*, Bach Le. Unlocking LLM Repair Capabilities Through Cross-Language Translation and Multi-Agent Refinement. The IEEE/ACM International Conference on Software Engineering, 2026 TSE'25 Lyuye Zhang, Kaixuan Li, Kairan Sun, Daoyuan Wu, Ye Liu, Haoye Tian, Yang Liu. ACFIX: Guiding LLMs with Mined Common RBAC Practices for Context-Aware Repair of Access Control Vulnerabilities in Smart Contracts. Transactions on Software Engineering, 2025. TOSEM'25d Xunzhu Tang, Kisub Kim, Saad Ezzini, Yewei Song, Haoye Tian*, Jacques Klein, Tegawendé F Bissyandé. Just-in-Time Detection of Silent Security Patches. ACM Transactions on Software Engineering and Methodology, 2025. TOSEM'25c Boyang Yang#, Haoye Tian#, Jiadong Ren, Hongyu Zhang, Jacques Klein, Tegawendé F Bissyandé, Claire Le Goues, Shunfu Jin. MORepair: Teaching LLMs to Repair Code via Multi-Objective Fine-tuning. ACM Transactions on Software Engineering and Methodology, 2025. TOSEM'25b Wenqiang Luo, Jacky Wai Keung, Boyang Yang, He Ye, Claire Le Goues, Tegawende F Bissyande, Haoye Tian*, Bach Le. When Fine-Tuning LLMs Meets Data Privacy: An Empirical Study of Federated Learning in LLM-Based Program Repair. ACM Transactions on Software Engineering and Methodology, 2025. TOSEM'25a Weiguo Pian, Yinghua Li, Haoye Tian*, Tiezhu Sun, Yewei Song, Xunzhu Tang, Andrew Habib, Jacques Klein, Tegawendé F Bissyandé. You Don’t Have to Say Where to Edit! Joint Learning to Localize and Edit Source Code ACM Transactions on Software Engineering and Methodology, 2025. EMNLP'24 Xunzhu Tang, Kisub Kim, Yewei Song, Cedric Lothritz, Bei Li, Saad Ezzini, Haoye Tian*, Jacques Klein, and Tegawendé F. Bissyandé. CodeAgent: Autonomous Communicative Agents for Code Review. The 2024 Conference on Empirical Methods in Natural Language Processing. ISSTA'24 Boyang Yang#, Haoye Tian#, Weiguo Pian, Haoran Yu, Haitao Wang, Jacques Klein, Tegawendé F Bissyandé, Shunfu Jin. CREF: An LLM-based Conversational Software Repair Framework for Programming Tutors. The 33rd ACM SIGSOFT International Symposium on Software Testing and Analysis, 2024. CSCW'24 Yuwei Chuai, Haoye Tian, Nicolas Pröllochs, and Gabriele Lenzini. Did the Roll-Out of Community Notes Reduce Engagement With Misinformation on X/Twitter? The 27th ACM Conference on Computer-Supported Cooperative Work and Social Computing, 2024. ASE'23 Tsz-On Li, Wenxi Zong, Yibo Wang, Haoye Tian, Ying Wang, Shing-Chi Cheung. Nuances are the Key: Unlocking ChatGPT to Find Failure-Inducing Tests with Differential Prompting The 38th IEEE/ACM International Conference on Automated Software Engineering, 2023. AAAI'23 Weiguo Pian, Hanyu Peng, Xunzhu Tang, Tiezhu Sun, Haoye Tian*, Andrew Habib, Jacques Klein, Tegawendé F Bissyandé. MetaTPTrans: A Meta Learning Approach for Multilingual Code Representation Learning The 37th AAAI Conference on Artificial Intelligence, 2023. [Acceptance rate: 19.6% (1,721/8,777)] TOSEM'23 Haoye Tian, Kui Liu*, Yinghua Li, Abdoul Kader Kaboré, Anil Koyuncu, Andrew Habib, Li Li, Junhao Wen, Jacques Klein, Tegawendé F Bissyandé. The Best of Both Worlds: Combining Learned Embeddings with Engineered Features for Accurate Prediction of Correct Patches ACM Transactions on Software Engineering and Methodology, 2023. ASE'22 Haoye Tian, Xunzhu Tang, Andrew Habib, Shangwen Wang, Kui Liu*, Xin Xia, Jacques Klein, Tegawendé F. Bissyandé. Is this Change the Answer to that Problem? Correlating Descriptions of Bug and Code Changes for Evaluating Patch Correctness The 37th IEEE/ACM International Conference on Automated Software Engineering, 2022. [Acceptance rate: 14.8% (78/527)] TOSEM'22 ICSE'23 JF Haoye Tian, Yinghua Li, Weiguo Pian, Abdoul Kader Kabore, Kui Liu*, Andrew Habib, Jacques Klein, and Tegawendé F. Bissyandé. Predicting Patch Correctness Based on the Similarity of Failing Test Cases ACM Transactions on Software Engineering and Methodology, 2022. ASE'20 Haoye Tian, Kui Liu*, Abdoul Kader Kaboré, Anil Koyuncu, Li Li, Jacques Klein, Tegawendé F. Bissyandé. Evaluating Representation Learning of Code Changes for Predicting Patch Correctness in Program Repair The 35th IEEE/ACM International Conference on Automated Software Engineering, 2020. [Acceptance rate: 22.28% (88/395)] IJCNN'19 Haoye Tian, Haini Cai, Junhao Wen, Shun Li, Yingqiao Li. A Music Recommendation System Based on logistic regression and eXtreme Gradient Boosting 2019 International Joint Conference on Neural Networks, Budapest, Hungary, July, 14-19 2019. IEEE. Work Experience Aalto University, Assistant Professor. Espoo, Finland, Aug 2025 - Present. Nanyang Technological University, Postdoctoral researcher. Singapore, Singapore, Jul 2025 - Aug 2025. University of Melbourne, Postdoctoral fellow. Melbourne, Australia, Apr 2024 - Mar 2025. Carnegie Mellon University, Visiting scholar. Pittsburgh, USA, Jan 2024 - Mar 2024. University of Luxembourg, Postdoctoral researcher. Luxembourg, Luxembourg, Oct 2023 - Mar 2024. DiDi, Machine learning researcher. Beijing, China, Jul - Nov 2019. Tencent, Machine learning researcher intern. Shenzhen, China, Apr - Aug 2018. Hobbies Thinking, Guitar, Singing, Video game, Tennis Visitors Hello friend, I hope you have a wonderful day!",
  "content_length": 8373,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:30"
}