{
  "name": "Harald Räcke",
  "homepage": "http://www.professoren.tum.de/en/raecke-harald",
  "status": "success",
  "content": "Räcke_Harald Prof. Dr. Harald Räcke Professorship Efficient algorithms School TUM School of Computation, Information and Technology Contact Details Visitenkarte in TUMonline Academic Career and Research Areas Prof. Räcke (b. 1973) is interested in the design and theoretical analysis of algorithms. In particular he develops approximation and online algorithms for problems in the area of graph partitioning, scheduling and routing in parallel systems, and in metric embeddings. After studying Computer Science at the University of Paderborn, Prof. Räcke received his doctorate in 2003 under the supervision of Prof. Meyer auf der Heide. After two postdoctoral stints at the Carnegie Mellon University in Pittsburgh, and the Toyota Technological Institute at Chicago he became an Assistant Professor at the University of Warwick in 2007. He became an Associate Professor in the Algorithms and Complexity group at TUM in 2011. Awards Best Paper Award, 40th ACM Symposium on Theory of Computing (2008)Best Paper Award, 43rd IEEE Symposium on Foundations of Computer Science (2002) Key PublicationsRäcke H, Shah C, Täubig H: \"Computing cut-based hierarchical decompositions in almost linear time\". Proceedings of the 25th ACM-SIAM Symposium on Discrete Algorithms (SODA). 2014; 227-238.AbstractAdamaszek A, Czumaj A, Englert M, Räcke H: \"Optimal online buffer scheduling for block devices\". Proceedings of the 44th ACM Symposium on Theory of Computing (STOC). 2012; 589-598.AbstractAdamaszek A, Czumaj A, Englert M, Räcke H: \"Almost tight bounds for reordering buffer management\". Proceedings of the 43rd ACM Symposium on Theory of Computing (STOC). 2011; 607-616.AbstractRäcke H: \"Optimal hierarchical decompositions for congestion minimization in networks\". Proceedings of the 40th ACM Symposium on Theory of Computing (STOC). 2008; 255-264.AbstractRäcke H: \"Minimizing congestion in general networks\". Proceedings of the 43rd IEEE Symposium on Foundations of Computer Science (FOCS). 2002: 43-52.Abstract If you wish your profile to be changed or updated please contact Franz Langer. Attention: JavaScript deactivated Please activate JavaScript to be able to use all website functions such as site search!",
  "content_length": 2205,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:36"
}