{
  "name": "Harald C. Gall",
  "homepage": "http://www.ifi.uzh.ch/seal/people/gall.html",
  "status": "success",
  "content": "Harald C. Gall, Prof. Dr. | Department of Informatics | UZH Skip navigation Harald C. Gall, Prof. Dr. Dean of the Faculty of Business, Economics, and Informatics Address Dean's Office: Raemistrasse 71, Room KOL G-207, 8006 Zurich Professor of Software Engineering Director of the software evolution and architecture lab Address Department: Binzmuehlestrasse 14, Room 2.D.02, 8050 Zurich Email harald.gall@uzh.ch Tel +41 44 634 23 53 (Dean's office) +41 44 635 43 21 (Chair) LinkedIn Google Scholar DBLP Short bio Harald Gall is Dean of the Faculty of Business, Economics, and Informatics at the University of Zurich (UZH). He is professor of Software Engineering in the Department of Informatics at UZH. Prior to that, he was associate professor at the Technical University of Vienna in the Distributed Systems Group (TUV), where he also received his PhD (Dr. techn.) and master's degree (Dipl.-Ing.) in Informatics. He held visiting positions at Microsoft Research in Redmond, USA, and University of Washington in Seattle, USA. His research interests are in software engineering with focus on software evolution, software architecture, software quality analysis, mining software repositories, and cloud-based software engineering. He is probably best known for his work on software evolution analysis and mining software archives. Since 1997 he has worked on devising ways in which mining these repositories can help to better understand software development, to devise predictions about quality attributes, and to exploit this knowledge in software analysis tools such as Evolizer, ChangeDistiller, or SOFAS. He is a shaper of the research area on Mining Software Repositories since 2004 and has contributed to establish it as a major area in software engineering research. His research has been highly acclaimed with a Most Influential Paper Award, a Test of Time Award, and several Best Paper Awards in the top Software Engineering Outlets. He is an Associate Editor of the Journal on Empirical Software Engineering (since 2015), IEEE Software(since 2015), and the Computing Journal(since 2011). He was Associate Editor of IEEE's Transactions on Software Engineering(2010-14). He is a board member of Informatics Europe, the premier academic community for Informatics in Europe.  And he is a member of ACM, IEEE Computer Society, SI-SE, and OCG. He was an executive committee member of ACM SIGSOFT and the ACM SIGSOFT awards chair. He was president of CHOOSE, the Swiss SIG for Object-Oriented Systems and Environments, (2008-2011). Line of Research - Striving for Impact His research addresses how to improve productivity of software development by using insights from various sources of software engineering: features and functions, versions and branches, issues and bugs, tests, documentation, reviews and sentiments, data from development environments including continuous development, integration, and deployment, as well as sources from code archives and software communities. This large body of data provides rich information about how software systems are developed, how they are changed and evolved, how they are tested and its quality is assured, how developers communicate and learn, how software is built and put into production. These many aspects can be used for data mining of product and process information, to use machine learning on these data sources, to predict software bugs within and across software projects, and to analyze developer and user communities on the web. The research strives to reach a high impact in software development tools, environments, and to increase the productivity of software developers. Program Chair He was the program chair of the two flagship conferences in the field of software engineering: ICSE and ESEC/FSE. In 2011, he was program co-chair of ICSE 2011, the International Conference on Software Engineering, held on the tropical island of Oahu in Hawaii. In 2005, he was program chair of ESEC-FSE, the joint conference of the European Software Engineering Conference (ESEC), and the ACM SIGSOFT Symposium on the Foundations of Software Engineering (FSE), held in Lisbon, Portugal. In 2006 and 2007 he co-chaired MSR, the International Working Conference on Mining Software Repositories, the premier event for software evolution analysis. In 2000 and 2005, he was program chair of the International Conference on Program Comprehension (ICPC), a major forum for software maintenance. Quicklinks and available languages Subpages of Harald C. Gall Professional Activities Research Projects Publications Teaching PhD Graduates Personal Info Professional Activities Research Projects Publications Teaching PhD Graduates Personal Info",
  "content_length": 4690,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:35"
}