{
  "name": "Harald Köstler",
  "homepage": "https://www.cs10.tf.fau.de/person/harald-koestler",
  "status": "success",
  "content": "apl. Prof. Dr. Harald Köstler - Chair for Computer Science 10 – System Simulation Simulate organization breadcrumb open Simulate organization breadcrumb close apl. Prof. Dr. Harald Köstler apl. Prof. Dr. Harald Köstler Prof. Dr. Harald Köstler, Akad. Dir.Group Leader HPC Software DesignDepartment of Computer ScienceChair of Computer Science 10 (System Simulation)Room: Room 00.115Cauerstraße 1191058 ErlangenPhone number: +49 9131 85-28359Fax number: +49 9131 85-28928Email: harald.koestler@fau.deWebsite: https://cs10.tf.fau.de/harald-koestler Office hours Tuesday 12:00 – 13:30 – only after prior registration by email –  send email Research interests: Software Engineering for High Performance Computing and Data Analytics Increasing computing power and the increasing amount of data enables us to significantly improve the mathematical models for various applications. We investigate the fusion of classical model-driven and data-driven approaches and their implementation in modern, open source research software. Our focus lies on code generation technology for numerical solvers or machine learning methods on (block)-structured data. Publications 2026Parthasarathy D., Mitchell WB., Köstler H.:Evolving Algebraic Multigrid Methods Using Grammar-Guided Genetic Programming (2026)DOI: 10.48550/arXiv.2412.058522025Bouvry P., Brorsson M., Canal R., Eftekhari A., Höfinger S., Smets D., Köstler H., Kozubek T., Krishnasamy E., Llosa J., Lukas-Rother A., Martorell X., Pleiter D., Proykova A., Sancho MR., Schenk O., Silvano C.:The European Master for HPC CurriculumIn: Journal of Parallel and Distributed Computing 201 (2025), p. 105081ISSN: 0743-7315DOI: 10.1016/j.jpdc.2025.105081Böhm F., Bauer D., Kohl N., Alappat C., Thönnes D., Mohr M., Köstler H., Rüde U.:Code Generation and Performance Engineering for Matrix-Free Finite Element Methods on Hybrid Tetrahedral GridsIn: SIAM Journal on Scientific Computing 47 (2025), p. B131-B159ISSN: 1064-8275DOI: 10.1137/24M1653756Büttner M., Alt C., Kenter T., Köstler H., Plessl C., Aizinger V.:Analyzing performance portability for a SYCL implementation of the 2D shallow water equationsIn: Journal of Supercomputing 81 (2025), Article No.: 772ISSN: 0920-8542DOI: 10.1007/s11227-025-07063-7Faghih-Naini S., Aizinger V., Kuckuk S., Angersbach R., Köstler H.:p-adaptive discontinuous Galerkin method for the shallow water equations on heterogeneous computing architecturesIn: GEM - International Journal on Geomathematics 16 (2025), Article No.: 8ISSN: 1869-2672DOI: 10.1007/s13137-025-00267-2Godé H., Kruse C., Angersbach R., Köstler H., Bauerheim M., Rüde U.:Comparison of Multigrid and Machine Learning-Based Poisson Solvers15th International Conference on Parallel Processing and Applied Mathematics, PPAM 2024 (Ostrava, 8. September 2024 - 11. September 2024)In: Roman Wyrzykowski, Jack Dongarra, Ewa Deelman, Konrad Karczewski (ed.): Lecture Notes in Computer Science 2025DOI: 10.1007/978-3-031-85703-4_12Jacob SJ., Mrosek M., Othmer C., Köstler H.:Benchmarking convolutional neural network and graph neural network based surrogate models on a real-world car external aerodynamics datasetIn: Computers & Fluids 300 (2025), Article No.: 106760ISSN: 0045-7930DOI: 10.1016/j.compfluid.2025.106760Kemmler S., Cuéllar P., Artinov A., Baeßler M., Köstler H.:Fully-resolved LBM-DEM simulations of piping erosion during a suction bucket installation10th International Conference on Discrete Element Methods (Himeji, 1. July 2025 - 5. July 2025)Kemmler S., Cuéllar P., Artinov A., Baeßler M., Köstler H.:Investigating Piping Erosion during Suction Bucket Installations using Fully-Resolved LBM-DEM SimulationsPARTICLES 2025 (Barcelona, 20. October 2025 - 22. October 2025)Kemmler S., Cuéllar P., Artinov A., Luu LH., Farhat A., Philippe P., Rettinger C., Köstler H.:A fully-resolved micromechanical simulation of piping erosion during a suction bucket installationIn: Computers and Geotechnics 186 (2025), Article No.: 107375ISSN: 0266-352XDOI: 10.1016/j.compgeo.2025.107375Kemmler S., Cuéllar P., Rettinger C., Köstler H.:A Fluid-Solid Coupled Micromechanical Simulation for the Analysis of Piping Erosion During the Seabed Installation of a Suction Bucket FoundationIn: IOP Conference Series : Earth and Environmental Science (2025)ISSN: 1755-1307DOI: 10.1088/1755-1315/1480/1/012024Kemmler S., Rettinger C., Rüde U., Cuéllar P., Köstler H.:Efficiency and scalability of fully-resolved fluid-particle simulations on heterogeneous CPU-GPU architecturesIn: International Journal of High Performance Computing Applications (2025)ISSN: 1094-3420DOI: 10.1177/10943420241313385Parthasarathy D., Bevilacqua T., Lanser M., Klawonn A., Köstler H.:Towards Automated Algebraic Multigrid Preconditioner Design Using Genetic Programming for Large-Scale Laser Beam Welding Simulations2025 Platform for Advanced Scientific Computing Conference, PASC 2025 (Brugg-Windisch, 16. June 2025 - 18. June 2025)In: PASC 2025 - Platform for Advanced Scientific Computing Conference, Proceedings 2025DOI: 10.1145/3732775.3733589Suffa P., Kemmler S., Holzer M., Köstler H., Rüde U.:Large-Scale Lattice Boltzmann Simulations on Modern HPC Systems with the waLBerla FrameworkNIC Symposium 2025 (Jülich Supercomputing Centre (JSC) Institute for Advanced Simulation (IAS) Forschungszentrum Jülich GmbH 52425 Jülich, Germany, 6. March 2025 - 7. March 2025)Suffa P., Kemmler S., Köstler H., Rüde U.:Large-scale simulations of fully resolved complex moving geometries with partially saturated cellsIn: Physics of Fluids 37 (2025), Article No.: 055141ISSN: 1070-6631DOI: 10.1063/5.02680212024Alt C., Köstler H.:Continuous Benchmarking for a Massively Parallel Multi Physics FrameworkdeRSE24: Conference for Research Software Engineering in Germany (Würzburg, 5. March 2024 - 7. March 2024)URL: https://events.hifis.net/event/994/contributions/7934/Alt C., Lanser M., Plewinski J., Janki A., Klawonn A., Köstler H., Selzer M., Rüde U.:A continuous benchmarking infrastructure for high-performance computing applicationsIn: International Journal of Parallel, Emergent and Distributed Systems (2024)ISSN: 1744-5760DOI: 10.1080/17445760.2024.2360190Angersbach R., Köstler H., Kuckuk S.:Code Generation for Octree-Based Multigrid Solvers with Fused Higher-Order Interpolation and CommunicationEuro-Par 2024 (Madrid, 26. August 2024 - 30. August 2024)DOI: 10.1007/978-3-031-69583-4_17Büttner M., Alt C., Kenter T., Köstler H., Plessl C., Aizinger V.:Enabling Performance Portability for Shallow Water Equations on CPUs, GPUs, and FPGAs with SYCLPASC '24: Platform for Advanced Scientific Computing Conference (Zürich, 3. June 2024 - 5. June 2024)In: PASC '24: Proceedings of the Platform for Advanced Scientific Computing Conference, New York, NY: 2024DOI: 10.1145/3659914.3659925Chincholi F., Köstler H.:Transforming glaucoma diagnosis: transformers at the forefrontIn: Frontiers in Artificial Intelligence 7 (2024), Article No.: 1324109ISSN: 2624-8212DOI: 10.3389/frai.2024.1324109Kemmler S., Cuéllar P., Köstler H.:A Fluid Solid Coupled Micromechanical Simulation of Piping Erosion During the Installation of a Suction Bucket for the Foundation of an Offshore Wind Turbine9th European Congress on Computational Methods in Applied Sciences and Engineering (ECCOMAS) (Lissabon, 3. June 2024 - 7. June 2024)Kemmler S., Cuéllar P., Köstler H.:Gekoppelte Fluid Partikel Simulationen einer Suction Bucket Gründung zur Analyse von Piping Erosion während der Installation von Offshore WindkraftanlagenGesinus-Treffen 2024 (Universität Stuttgart, 20. June 2024 - 21. June 2024)Kemmler S., Cuéllar P., Köstler H.:Particle-resolved simulations of piping erosion in suction bucket foundations5th International Symposium on Geomechanics from Micro to Macro (Grenoble, 23. September 2024 - 27. September 2024)URL: https://www10.cs.fau.de/publications/posters/2024/Kemmler_IS-Grenoble_2024.pdfPlewinski J., Alt C., Köstler H., Rüde U.:Performance analysis of the free surface lattice Boltzmann implementation in waLBerlaIn: Proceedings in Applied Mathematics and Mechanics (2024)ISSN: 1617-7061DOI: 10.1002/pamm.202400196Schottenhamml H., Anciaux Sedrakian A., Blondel F., Köstler H., Rüde U.:waLBerla-wind: A lattice-Boltzmann-based high-performance flow solver for wind energy applicationsIn: Concurrency and Computation-Practice & Experience 36 (2024)ISSN: 1532-0626DOI: 10.1002/cpe.8117Suffa P., Kemmler S., Köstler H., Rüde U.:Highly Parallel Complex Moving Geometries on CPU and GPU using the Partially Saturated Cells Method33rd Discrete Simulation of Fluid Dynamics (DSFD) Conference (ETH Zürich Rämistrasse 101 8092 Zürich Schweiz, 9. July 2024 - 12. July 2024)2023Alt C., Kenter T., Faghih-Naini S., Faj J., Opdenhövel JO., Plessl C., Aizinger V., Hönig J., Köstler H.:Shallow Water DG Simulations on FPGAs: Design and Comparison of a Novel Code Generation PipelineHigh Performance Computing 38th International Conference, ISC High Performance 2023 (Hamburg, 21. May 2023 - 25. May 2023)In: High Performance Computing. ISC High Performance 2023, Cham: 2023DOI: 10.1007/978-3-031-32041-5_5Angersbach R., Kuckuk S., Köstler H.:Generating Coupling Interfaces for Multiphysics Simulations with ExaStencils and waLBerlaInternational Parallel and Distributed Processing Symposium (IPDPS) (St. Petersburg, Florida USA, 15. May 2023 - 19. May 2023)In: 2023 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW), Los Alamitos, CA, USA: 2023DOI: 10.1109/IPDPSW59300.2023.00112URL: https://ieeexplore.ieee.org/document/10196550Chincholi F., Köstler H.:Detectron2 for Lesion Detection in Diabetic RetinopathyIn: Algorithms 16 (2023), Article No.: 147ISSN: 1999-4893DOI: 10.3390/a16030147Dahmardeh M., Dastjerdi HM., Mazal H., Köstler H., Sandoghdar V.:Breaking new ground in protein detection: Self-supervised machine learning and iSCAT enable label-free detection of single proteins below 10 kDaBiophotonics Congress: Optics in the Life Sciences 2023, OMA, NTM, BODA, OMP, B",
  "content_length": 66126,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:32"
}