{
  "name": "Harald Reiterer",
  "homepage": "http://hci.uni-konstanz.de/index.php?a=staff&b=Reiterer",
  "status": "success",
  "content": "Human-Computer Interaction Current news 18.11.2025 We’re very excited to share that our exhibition “Arriving? Migration, Faith and Identity”, shown from 18 July - 23 October 2025, has received two great awards: DDC Award 2025 - Gold (Architecture / Space): DDC Website Comm Awards 2025 - Bronze (Talent, Space / Exhibition): Comm Awards Across four thematic floors, the exhibition invited visitors to explore why people leave, how journeys unfold, what arrival means, and how identity is shaped along the way. With the support of AI, virtual… Read more 13.11.2025 At last week’s IEEE VIS conference in Vienna, Austria, Harald Reiterer gave a keynote on \"Fluid Interaction for Immersive Analytics\" at the Human Factors in Immersive Analytics Workshop. In the same session, Sebastian Hubenschmid presented our workshop paper \"Revisiting Hybrid Input Devices for Immersive Analytics\". This week, Sebastian presented our work on the SpatialMouse (A Hybrid Pointing Device for Seamless Interaction Across 2D and 3D Spaces) at ACM VRST in Montreal, Canada, where the… 24.10.2025 Sebastian Hubenschmid successfully defended his Ph.D. Thesis on \"Designing Fluid Interaction for Immersive Analytics using Hybrid User Interfaces in Mixed Reality\". Congratulations, Dr. Hubenschmid! Find some more impressions on LinkedIn. More information about his oral examination committee: Prof. Dr. Harald Reiterer Prof. Dr. Dieter Schmalstieg Prof. Dr. Falk Schreiber 22.07.2025 We are happy to announce that our latest exhibition, “Arriving? Migration, Faith and Identity,” has opened on July 17th. Our computer science students have been responsible for designing and implementing incredible interactive media installations. Come and visit our exhibition in the “Turm zur Katz” in downtown Konstanz and experience the cool exhibition! This project is part of our long-term teaching project called “Media Exhibition Design” (see https://mediale-ausstellungsgestaltung.de/ ) Ope… Read more YouTube Selected Publications Events There are no events in the current view. Contact Prof. Dr. Harald Reiterer Room PZ 910 Meetings by prior arrangement. E-Mail schreiben Dr. Tiare Feuchtner | Ass. Prof. Room Z 919 Meetings by prior arrangement. E-Mail schreiben Administration Room PZ 903 Tel.: +49 7531 88 2442 Fax: +49 7531 88 4772 E-Mail schreiben Hide search Search University of Konstanz Search terms Search Results Suggestions",
  "content_length": 2403,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:36"
}