{
  "name": "Harald Kosch",
  "homepage": "http://www.fim.uni-passau.de/en/distributed-information-systems",
  "status": "success",
  "content": "Professor Harald Kosch - University of Passau Information for... Information for... Current students Prospective students Academics Early career researchers Businesses Alumni and friends Staff Media representatives Faculties & facilities Administration Central facilities Faculties Faculty of Law Faculty of Social and Educational Sciences Faculty of Humanities and Cultural Studies School of Business, Economics and Information Systems Faculty of Computer Science and Mathematics Central facilities Graduate Centre PICAIS Sports Centre Language Centre University Library Centre for Information Technology and Media Services Teacher Education Centre Central facilities Research Strategy & Science Communication Executive Support Unit for Health and Safety Executive Support Unit for Competency Development in Study and Teaching Executive Support Unit for Process Management Managing Office of the Bavarian Higher Education Digitalisation Association (BHEDA) Research Services Graduate Centre PICAIS Sports Centre Language Centre University Library Centre for Information Technology and Media Services Teacher Education Centre Heading Information for... Faculties & facilities Login Go directly to... Apply Study options Academic Advice Service Course catalogue International Office Careers and Competencies Examinations Office Graduate Centre Student Services Association University Library en de Information for... Faculties & facilities Go directly to... Apply Study options Academic Advice Service Course catalogue International Office Careers and Competencies Examinations Office Graduate Centre Student Services Association University Library Support Login en de Chair of Distributed Information Systems Chair of Distributed Information Systems Prof. Dr. Harald Kosch's chair represents the field of distributed information and multimedia systems. His chair has made a significant contribution to MPEG and W3C standardization. In addition, the chair is currently conducting research in the areas of metadata standardization, the integration of data privacy in information systems, and intelligent information systems. Another area of interest for the chair is research into green IT. IRIXYS (www.irixys.org) is an international research and innovation Center in Intelligent Digital Systems created in March 2016 by the departments of computer science of the Universität Passau (Germany), the INSA Lyon (France) and Università degli Studi of Milano (Italy). In addition to research workshops, national and international large-scale projects, IRIXYS supports and promotes through the international doctoral college MDPS joint PhDs. The academic programme of IRIXYS also offers German-French double master degree. With a focus on multimedia, data security as well as distributed and pervasive systems, IRIXYS aims among others at stimulating disruptive technological innovation. More about IRIXYS More about IRIXYS Our teaching puts the emphasis on applied computer science; subjects include information systems, multimedia data bases, distributed systems, data mining and data warehouses, and Web-based information systems. If you are interested in writing your thesis at our chair, you can find more information here. Distributed Information Systems Recommender Systems Privacy & Data Disclosure Management User-Centric Data Publishing Control Secure Information Exchange Networks Applied AI and Natural Language Processing (NLP) in the following areas: Electric Power Distribution Grids & Renewable Energy Multi-Party Management Finance Credit Card Fraud Detection Healthcare Positioning and Navigation Algorithms Green IT Find out more about our research. Office Phone: +49 851 509 3061 Fax: +49 851 509 3062 E-mail: stefanie.riederer@uni-passau.de Response times daily, except Wednesday from 9 a.m. - 12 noon Last updated: | Page ID: 13855 Share page Print page Modal Share content via Facebook LinkedIn E-mail I agree that a connection to the Vimeo server will be established when the video is played and that personal data (e.g. your IP address) will be transmitted. I agree that a connection to the YouTube server will be established when the video is played and that personal data (e.g. your IP address) will be transmitted. Show video",
  "content_length": 4246,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:34"
}