{
  "name": "Haris Aziz 0001",
  "homepage": "https://research.unsw.edu.au/people/dr-haris-aziz",
  "status": "success",
  "content": "Professor Haris Aziz | UNSW Research Skip to main content Researcher My Expertise Algorithms Multi-agent systems/AI Computational social choice Algorithmic market design Algorithmic game theory Network analysis Fields of Research (FoR) Autonomous agents and multiagent systems, Data structures and algorithms, Decision theory, Economic theory, Combinatorics and discrete mathematics (excl. physical combinatorics) SEO tags Expanding Knowledge in the Information and Computing Sciences Biography Haris Aziz is a Professor at UNSW Sydney and the leader of the Algorithmic Decision Theory group. His research interests lie at the intersection of artificial intelligence, theoretical computer science and mathematical social sciences ---, especially computational social choice and algorithmic game theory. He was the founding director of the UNSW AI Institute, one of the largest AI institutes with over 300 faculty members. Haris is a recipient...view more Haris Aziz is a Professor at UNSW Sydney and the leader of the Algorithmic Decision Theory group. His research interests lie at the intersection of artificial intelligence, theoretical computer science and mathematical social sciences ---, especially computational social choice and algorithmic game theory. He was the founding director of the UNSW AI Institute, one of the largest AI institutes with over 300 faculty members. Haris is a recipient of the Scientia Fellowship (2018 - 2024 ), CORE Chris Wallace Research Excellence Award (2017) and the Julius Career Award (2016 - 2018). In 2016, he was selected by the Institute of Electrical and Electronics Engineers (IEEE) for the biennial AI 10 to Watch List. He is on the board of directors of IFAAMAS, is the chair of the IFAAMAS awards committee, an editor of TheoretiCS, and an associate editor of major journals including AIJ, JAIR, JAAMAS, and Social Choice & Welfare. His research has been covered by media outlets such as Scientific American, BBC, Sydney Morning Herald, The Guardian, Quanta Magazine, Die Zeit and Inside Science. In 2018, he featured in the list of thinkers at the Festival of Dangerous Ideas. In 2020, 2021 and 2022, The Australian newspaper recognized him as the national field leader in game theory and decision sciences in Australia. Haris completed his PhD from University of Warwick in 2009, MSc from Oxford University and his BSc (Honours) from Lahore University of Management Sciences. He undertook postdoctoral research at the Ludwig Maximilian University of Munich and Technical University of Munich in Germany. He has held visiting scientist/academic roles at Oxford University, Harvard University, and University Paris Dauphine. Personal website https://sites.google.com/site/harisaziz/ General Research Interests Multi-agent systems/Artificial intelligence, Algorithms, Social choice theory, Game theory, Fair Division, Market design, and Network Analysis. Awards and Honours Research Field Leader in Game Theory and Decision Sciences 2022 (According to The Australian) Research Field Leader in Game Theory and Decision Sciences 2021 (According to The Australian) Research Field Leader in Game Theory and Decision Sciences 2020 (According to The Australian) IJCAI 2019 distinguished paper honourable mention award IJCAI 2019 distinguished senior PC member award UNSW Scientia Fellowship (2018 - ) Inaugural LUMS Vice Chancellor’s Alumni Achievement Award (2018) CORE Chris Wallace Research Excellence Award 2017 CSIRO Julius Career Award (2016 - 2018) IEEE AI's 10 to Watch 2015 Early Career Spotlight List: IJCAI 2016 (Twenty-Fifth International Joint Conference on Artificial Intelligence) Best Young Researcher Optimisation Research Group, NICTA (2014) Noon Educational Foundation Scholarship for the University of Oxford (2004 - 2005) PhD Research Supervision Jeremy Vollen, Computer Science (2021 -- ) Alicia Vidler, Computer Science (2021 -- ) Maryam Hashemi, Computer Science (2021 -- ) Amin Zakhirehkar Sahih (2022 -- ) Alex Lam, Computer Science (2019 -- 2023, graduated) Haoning Xi, Civil Engineering (2019 -- 2022, graduated) Edward Lee, Computer Science (2016 -- 2021, graduated) Barton Lee, Economics (2017 -- 2021, graduated) Zhaohong Sun, Computer Science (2016 -- 2020, graduated) Kamran Najeebullah, Computer Science (2015 -- 2018, graduated) Completed Research Supervision Angus Ritossa (2022-2024) Jeremy Lindsay (2022) Aditya Ganguly (UNSW ToR 2020-2021) Ethan Brown (UNSW ToR 2020-2021) Zhaohong Sun, PhD Computer Science (2016 -- 2020) Simon Rey (UNSW research practicum program 2019) Kamran Najeebullah, PhD Computer Science (2015 -- 2018) Isabel Barlow, UNSW Taste of Research Program (2018 -- 2019) Anton Baychkov, CSIRO Summer Research Program (2018 -- 2019) Xin Huang (Data61 research internship, 2018) Jiayin Chen (Data61 research internship, 2016-2017) Michael Weiss (UNSW research exchange program, 2015-2016) Gerhard Rauchecker (NICTA research internship, 2015-2016) Adrian Goldwasser (NICTA research internship, 2015-2016) Jessica Lee (NICTA research internship, 2015-2016) Pang Luo (NICTA research internship, 2015-2016) Jiashu Chen (NICTA research internship, 2014-2015) Paul Stursberg (NICTA research internship, 2013-2014) Medina Andresal (NICTA research internship, 2014) Tobias Kaminski (NICTA research internship, 2013) Franz Diebold (MSc TU Munich, 2012) Christian Kaul (MSc thesis TU Munich, 2012) Florian Brandl (BSc Thesis, TU Munich, 2012) Jutta Frieden (BSc Thesis, TU Munich, 2012) Selected Scientific Services Member of IFAAMAS (International Foundation for Autonomous Agents and Multiagent Systems) Board of Directors (2018-2024) Australian representative in the COST Action Network for Game Theory Associate editor of JAIR (Journal of Artificial Intelligence Research) Tutorial Chair AAMAS 2020 Director Sydney EconCS Network On the Data61 PhD scholarships Committee (2016--2019). Co-organiser of ACCMC (Australasian Conference on Combinatorial Mathematics and Combinatorial Computing) 2019 Steering Committee of AI^3 (AAMAS-IJCAI 2018 workshop on Agents & Incentives in AI) Chair/Organiser Sydney Economics and Computation Workshop 2017 Organiser and Co-Chair EXPLORE (International Workshop on Exploring Beyond the Worst Case in Computational Social Choice) 2015, 2016, 2017 Organiser and Co-chair CoopMAS (International workshop on cooperative games and multiagent systems) 2013 On the BCTCS (British Colloquium for Theoretical Computer Science) in 2007-2008 On the BCC (British Combinatorial Committee) 2007-2008 Been serving as Area chair/senior program committee member or program committee member of major computer science conferences and workshops including AAAI, AAMAS, IJCAI, ACM EC, SAGT, WINE, and ADT during the past decade. Teaching 2019-2020: Course Lecturer, Knowledge Representation and Reasoning (KRR), UNSW. 2018-2019 UNSW Study Abroad Research Practicum program 2018-2019: Course Lecturer, Knowledge Representation and Reasoning (KRR), UNSW. 2018: Course Lecturing for COMP3121/3821/9101/9801 (Algorithms) 2017-2018: Course Guest Lecturer, Computational Game Theory, University of Oxford. 2016-2017: Course Lecturer, Knowledge Representation and Reasoning (KRR), UNSW 2015: Mini-course on fair allocation, Paris Dauphine, France. 2015:  Tutorial on Computational Social Choice at Australasian AI. 2014:  Tutorial on Computational Social Choice at PRICAI, Gold Coast 2014: Guest lecturer for the course Parameterized and Exact Computation, UNSW. 2012: Course organizer, Economics and Computation Seminar, TU Munich. 2011/2012: Course organizer   Multiagent Systems, TU Munich. 2011: Course organizer, Economics and Computation Seminar, TU Munich. 2011: Course guest lecturer, Algorithmic game theory, TU Munich 2010/2011: Course guest lecturer, Perlen der Informatik 3, TU Munich. 2010/2011: Course co-organizer, Multiagent Systems, TU Munich. Sept 2006 - June 2009: Seminar Tutor, Warwick University, Computer Science Department (Courses included Mathematics for Computer Science 1, Mathematics for Computer Science 2, Algorithm Design and Data Structures and Algorithms). Oct 2002 - Jun 2004: Teaching Assistant, Mathematics Department, LUMS (Courses included Linear Algebra, Electromagnetism, Statistics, Calculus,  and  Probability). Oct 2002 - Jun 2004: Instructor, National Outreach Program (NOP) LUMS, Pakistan. We are recruiting! We are recruiting PhD students in the general areas of computational social choice and algorithmic game theory. Students are expected to have a strong background is algorithms and discrete mathematics. Please contact haris.aziz@unsw.edu.au for more info. My Engagement View less Location Engineering Computer Science, Building K17, UNSW Sydney Map reference (Google map) Contact haris.aziz@unsw.edu.au Follow My X My LinkedIn My Google Scholar Publications by Professor Haris Aziz Books 1 Book Chapters 5 Journal articles 86 Conference Papers 114 Reports 2 Working Papers 7 Preprints 81 View all » ORCID as entered in ROS https://orcid.org/0000-0001-9757-4956 UNSW Sydney NSW 2052 Australia Telephone +61 2 93851000 Authorised by Deputy Vice-Chancellor (Research) UNSW CRICOS Provider Code: 00098G ABN: 57 195 873 179 Join the conversation Facebook Twitter UNSW Youtube LinkedIn Pinterest Instagram Member Group of Eight Member Universitas 21 Member Global Alliance of Technological Universities Member Association of Pacific Rim Universities MemberPLuS Alliance Home 2025 Strategic Initiatives SHARP UNSW Futures Interdisciplinary Research World Class Research Infrastructure Grand Challenges Thought Leadership & Public Engagement Knowledge Exchange ARTU - Aggregate Ranking of Top Universities Contact Us Deputy Vice-Chancellor (Research & Enterprise) Pro Vice-Chancellor (Research) Graduate Research Scholarships Applying for a Scholarship External Scholarships How to apply Higher Degree Research Programs Submitting an Application Finding a Supervisor Fees and Costs FAQs Thesis Thesis Preparation Examination Graduation Help and Advice Arc ",
  "content_length": 11453,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:39"
}