{
  "name": "Hari Sundaram",
  "homepage": "http://sundaram.cs.illinois.edu",
  "status": "success",
  "content": "hari sundaram @ uiuc Hari Sundaram University of Illinois About Me Research Publications Teaching Contact Me Hari Sundaram I am a Professor in the Computer Science Department at the University of Illinois at Urbana-Champaign with affiliate appointments in the Charles H. Sandage Department of Advertising, the Institute for Communication Research and the Center for Social & Behavioral Science. My research is motivated by a simple question: How can we design computational systems that empower individuals to make better decisions? The research in his group Crowd Dynamics Lab develops innovative algorithms, builds systems and performs experiments. Their research contributes to Applied Machine Learning (e.g., recommender systems for better choices), Network Science (e.g., how platform rules can induce strategic behavior), Human Computer Interaction (e.g., systems to elicit truthful preferences; understanding fairness and discrimination in online markets) and Mechanism Design (e.g., the design of rules to incentivize pro-social behavior). The research from his group has won awards from the ACM and IEEE societies and the American Academy of Advertising. He is a distinguished member of the ACM, and a senior member of the IEEE. Prospective Students: If you are interested in working in my group, read this first and follow the response link there. Academic Positions Present 2021 Professor University of Illinois, Computer Science 2021 2020 Associate Professor University of Illinois, Computer Science 2020 2014 Associate Professor University of Illinois, Computer Science + Advertising 2014 2009 Associate Professor Arizona State University, Arts, Media and Engineering + Computer Science 2012 2009 Associate Director Arizona State University, Arts, Media and Engineering 2009 2002 Assistant Professor Arizona State University, Arts, Media and Engineering + Computer Science Education & Training Ph.D. 2002 Ph.D. in Electrical Engineering Columbia University M.S.1995 M.S. in Electrical Engineering Stony Brook University B.Tech.1993 B.Tech in Electrical Engineering Indian Institute of Technology, Delhi Awards & Honors 2023 Best Paper Award, ACM CSCW Vinay Koshy, Tanvi Bajpai, Eshwar Chandrasekaran, Hari Sundaram, and Karrie Karahalios (2023). Measuring user-moderator alignment on r/changemyview. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW). 2023 Best Paper Award, ACM CSCW Wenxuan Wendy Shi, Sneha R. Krishna Kumaran, Hari Sundaram, and Brian P. Bailey (2023). The value of activity traces in peer evaluations: An experimental study. Proc. ACM Hum.-Comput. Interact., 7(CSCW1). 2021 Teacher Ranked as Excellent CITL: “ These lists are compiled on semester basis and reflect student ratings of instruction. The ratings are based on Instructor and Course Evaluation (ICES) questionnaire forms maintained by Measurement and Evaluation, Center for Innovation in Teaching & Learning. ” 2020 COVID-19 Wall of Recognition in Engineering, for Teaching During COVID-19. In late 2020, The Grainger College of Engineering asked its faculty and staff to nominate people who had gone âabove and beyondâ in their response to the COVID-19 pandemic. Teachers who pivoted to online delivery of classes. Researchers poured themselves into the emergency response. Staff that found a way to keep things running in even the strangest of circumstances. Students who helped in new, unexpected ways. The response to our request was massive—just like the hours, attention, and skill that our college offered the face of a global catastrophe. Hundreds of peopleâs names were submitted. A plaque recognizing all of them will be installed soon in Engineering Hall. 2020 Best Article Award, Journal of Interactive Advertising Joseph T Yun, Brittany RL Duff, Patrick T Vargas, Hari Sundaram, and Itai Himelboim. Computationally analyzing social media text for topics: A primer for advertising researchers. In: Journal of Interactive Advertising 20.1 (2020), pages 47â59 2020 Teacher Ranked as Excellent CITL: “ These lists are compiled on semester basis and reflect student ratings of instruction. The ratings are based on Instructor and Course Evaluation (ICES) questionnaire forms maintained by Measurement and Evaluation, Center for Innovation in Teaching & Learning. ” 2019 ACM Distinguished Member ACM: \"The ACM Distinguished Member program recognizes up to 10 percent of ACM worldwide membership based on professional experience as well as significant achievements in the computing field. To be nominated, a candidate must have at least 15 years of professional experience in the computing field, 5 years of continuous professional ACM membership, and have achieved a significant level of accomplishment, or made a significant impact in the field of computing, computer science and/or information technology. In addition, it is expected that a Distinguished Member serves as a mentor and role model, guiding technical career development and contributing to the field beyond the norm.\" 2019 IEEE Senior Member IEEE: \"A candidate shall be an engineer, scientist, educator, technical executive or originator in IEEE-designated fields; Candidates shall have been in professional practice for at least ten years; Candidates shall have shown significant performance over a period of at least five of those years\" 2019 Honorable Mention Award, ACM CSCW Himel Dev, Karrie Karahalios, and Hari Sundaram. Quantifying voter biases in online platforms: An instrumental variable approach. In The 22nd ACM Conference on Computer-Supported Cooperative Work and Social Computing, CSCW 2019., Austin, Texas USA, 2019. 2019 Best Paper Award, ASONAM Suhansanu Kumar, Heting Gao, Changyu Wang, Kevin Chang, and Hari Sundaram. Hierarchical multi-armed bandits for discovering hidden populations. In The 2019 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM 2019), Vancouver, BC, Canada., August 2019. 2017 Teacher Ranked as Excellent CITL: “ These lists are compiled on semester basis and reflect student ratings of instruction. The ratings are based on Instructor and Course Evaluation (ICES) questionnaire forms maintained by Measurement and Evaluation, Center for Innovation in Teaching & Learning. ” 2016 Teacher Ranked as Excellent CITL: “ These lists are compiled on semester basis and reflect student ratings of instruction. The ratings are based on Instructor and Course Evaluation (ICES) questionnaire forms maintained by Measurement and Evaluation, Center for Innovation in Teaching & Learning. ” 2008 IBM faculty Award Develop a novel theoretical framework and develop analysis tools to understand the knowledge dynamics within a large scale media rich social network. In this proposal, we propose to work on two closely related problems: detection of emergent communities of people and their evolution in a large scale media rich network; identification of key roles for both people and media objects. 2007 Associate Editor of the Year award Annually, the Editor-in-Chief of the ACM Transactions on Multimedia Computing, Communications and Applications (TOMM) honors one member of the Editorial Board with the TOMM Associate Editor of the Year Award. The purpose of the award is the distinction of excellent work for ACM TOMM and hence also for the whole multimedia community in the previous year. Criteria for the award are (1) the amount of submissions processed in time, (2) the performance during the reviewing process and (3) the accurate interaction with the reviewers in order to broader the awareness for the journal. 2007 IBM faculty Award Develop novel context-aware event models, and event annotation algorithms with the goal of improving the search quality and annotation results in online social network communities. There are three main contributions: development of event models, and the attendant event algebras; development of representations of event and user context that are query dependent; algorithms that determine user-user correlation given a query, and determining effective recommendations by using the event neighborhood. 2007 Best Student Paper Award, JCDL Bageshree Shevade, Hari Sundaram and Lexing Xie, Modeling Personal and Social Network Context for Event Annotation in Images, Proceedings of the Joint Conference on Digital Libraries 2007, Jun. 2007, Vancouver, Canada. 2007 Best Student Paper Finalist, ACM Multimedia Yinpeng Chen, Weiwei Xu, Hari Sundaram, Thanassis Rikakis, and Sheng-Min Liu. Media adaptation framework in biofeedback system for stroke patient rehabilitation. In Proceedings of the 15th international conference on Multimedia, pages 47â57. ACM, 2007. 2006 Best Demo Award, ACM Multimedia Yinpeng Chen, Helen Huang, Weiwei Xu, Richard Wallis, Hari Sundaram, Thanassis Rikakis, Jiping He, Todd Ingalls and Loren Olson, A Real-Time, Multimodal Biofeedback System For Stroke Patient Rehabilitation , Proc. SIG ACM Multimedia 2006, Oct. 2006, Santa Barbara, CA. 2006 IBM UIMA Innovations Award Develop a novel collaborative annotative system that exploits the correlation in user context, to enable members of an online social network to effectively annotate images. 2006 Best Student Paper Finalist, ICASSP Yinpeng Chen and H. Sundaram, Basis Projection for Linear Transform Approximation in Real-Time Applications, Proceedings 2006 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP 2006), 1520-6149, II-637-II-640, May 2006, Toulouse, France. 2002 Best Student Paper Award, ACM Multimedia Hari Sundaram, Lexing Xie and Shih-Fu Chang, A Utility Framework for the Automatic Generation of Audio-Visual Skims, Proc. 10th SIG ACM Conference On Multimedia, (ACM Multimedia 2002) Juan Les-Pins, France, Dec. 2002. 2002 Eliahu I. Jury award Outstanding Ph.D. thesis, Columbia University, 2002. 2000 Best Paper Award, IEEE CSVT Shih-Fu Chang, William Chen Horace Meng, Hari Sundaram and Di Zhong, A Fully Automated Content Base",
  "content_length": 10124,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:38"
}