{
  "name": "Haris E. Psillakis",
  "homepage": "http://users.ntua.gr/hpsilakis",
  "status": "success",
  "content": "Haris E. Psillakis Homepage Haris E. Psillakis Assistant Professor Division of Signals, Controls and Robotics School of Electrical and Computer Engineering National Technical University of Athens (NTUA) Contact Information E-mail:  hpsilakis@central.ntua.gr Address:  National Technical University of Athens School of Electronic & Computer Engineering 73100 GR, Athens, Greece Research Interests Adaptive Control Nonlinear Control Intelligent Control Multi-Agent Systems Stochastic Systems Power Systems Robotics Uncalibrated Visual Servoing Education University of Patras Ph.D., Electrical & Computer Engineering, July 2006 University of Patras Diploma of Electrical & Computer Engineering,  March  2000 Publications Journal Papers D. Kalyva and H.E. Psillakis, \"Distributed control of a mobile robot multi-agent system for Nash equilibrium seeking with sampled neighbor information,\" Automatica, vol. 166, 111712, 2024. H.E. Psillakis and K. A. Oikonomidis, \"Adaptive fuzzy approximate optimal consensus of Lagrangian agents: An EXTRA-based smoothing approach,\" IEEE Transactions on Fuzzy Systems, vol. 31, no. 11, pp. 4064-4074, Nov. 2023. A.-R. Lagos, H. E. Psillakis and A. K. Gkesoulis, \"Almost-Sure Finite-Time Stochastic Min-Max Consensus,\" IEEE Transactions on Circuits and Systems II: Express Briefs, vol. 70, no. 9, pp. 3509-3513, Sept. 2023. A. K. Gkesoulis, H. E. Psillakis and A. -R. Lagos, \"Optimal consensus via OCPI regulation for unknown pure-feedback agents With disturbances and state delays,\"  IEEE Transactions on Automatic Control, vol. 67, no. 8, pp. 4338-4345, Aug. 2022. H.E. Psillakis and K.A. Oikonomidis, \"Nonlinear PI robust adaptive control for uncertain multiple-input multiple-output nonlinear systems: Application to the visual servoing problem,\" Int J Adapt Control Signal Process., vol. 36, pp. 209229, 2022. H. E. Psillakis and Q. Wang, \"Distributed adaptive consensus of nonlinear heterogeneous agents with delayed and sampled neighbor measurements,\" IEEE Transactions on Cybernetics, vol. 52, no. 4, pp. 2340-2350, April 2022. A. K. Gkesoulis, H. E. Psillakis and Q. Wang, \"PdI regulation for consensus: Application to unknown pure-feedback agents with state and communication delays,\"  IEEE Transactions on Control of Network Systems, vol. 8, no. 4, pp. 1964-1974, Dec. 2021. Q. Wang, H. E. Psillakis, C. Sun and F. L. Lewis, \"Adaptive NN distributed control for time-varying networks of nonlinear agents with antagonistic interactions,\" IEEE Transactions on Neural Networks and Learning Systems, vol. 32, no. 6, pp. 2573-2583, June 2021. H. E. Psillakis, \"Adaptive NN cooperative control of unknown nonlinear multiagent systems with communication delays,\" IEEE Transactions on Systems, Man, and Cybernetics: Systems, vol. 51, no. 9, pp. 5311-5321, Sept. 2021. Q. Wang, H.E. Psillakis and C. Sun, \"Cooperative control of multiple high-order agents with nonidentical unknown control directions under fixed and time-varying topologies,\" IEEE Trans. Systems, Man and Cybernetics: Systems, vol. 51, no. 4, pp. 2582-2591, April 2021. A.K. Gkesoulis and H.E. Psillakis, \"Prescribed performance bipartite consensus for nonlinear agents with antagonistic interactions: A PI transformation approach,\" Journal of the Franklin Institute, vol. 358, no. 4, pp. 2382-2404, 2021. Q. Wang, H.E. Psillakis and C. Sun, \"Adaptive cooperative control with guaranteed convergence in time-varying networks of nonlinear dynamical systems,\" IEEE Trans.  Cybernetics, vol. 50, no. 12, pp. 5035-5046, Dec. 2020. H.E. Psillakis, \"PI consensus error transformation for adaptive cooperative control of nonlinear multi-agent systems,\" Journal of the Franklin Institute, vol. 356, no. 18, pp. 11581-11604, 2019. H.E. Psillakis and A.T. Alexandridis, \"Coordinated excitation and Static Var Compensator control with delayed feedback measurements in SGIB power systems, \" Energies, vol. 13, no. 9, 2181, 2020. Q. Wang, H.E. Psillakis and C. Sun, \"Cooperative control of multiple agents with unknown high-frequency gain signs under unbalanced and switching topologies,\" IEEE Trans. Automatic Control, vol. 64, no. 6, pp. 2495-2501, June 2019. [PDF] H.E. Psillakis and A.-R. Lagos, \"Unifying adaptive control with the nonlinear PI methodology: Designs for unknown strict-feedback nonlinear systems with nonsmooth actuator nonlinearities,\" Int. J. Adapt. Control & Signal Process., vol. 32, Issue 2, pp. 362-377, Feb. 2018. [PDF] H.E. Psillakis, \"Consensus in networks of agents with unknown high-frequency gain signs and switching topology,\" IEEE Trans. Automatic Control, vol. 62, no. 8, pp. 3993-3998, Aug. 2017. [PDF] H.E. Psillakis, \"An extension of the Georgiou-Smith example: Boundedness and attractivity in the presence of unmodelled dynamics via nonlinear PI control,\" Systems and Control Letters, vol. 92, pp. 1-4, 2016. [PDF] H.E. Psillakis, \"Integrator backstepping with the nonlinear PI method: An integral equation approach,\" European Journal of Control, vol. 28, pp. 49-55, 2016. [PDF] H.E. Psillakis and A.T. Alexandridis, \"Discussion on:\" A Saturated PI Velocity Controller for Voltage-Fed Induction Motors\", European Journal of Control, vol. 18, no. 1, pp. 69-70, 2012. H.E. Psillakis, M.A. Christodoulou, T. Giotis and Y. Boutalis , \"An observer approach for deterministic learning using patchy neural networks with applications to Fuzzy Cognitive Networks,\" Int. J. Artificial Life Research, vol. 2, no. 1, pp. 1-16, 2011. H.E. Psillakis, \"Further results on the use of Nussbaum gains in adaptive neural network control,\" IEEE Transactions on Automatic Control, vol. 55, no. 12, pp. 2841-2846, Dec. 2010. H.E. Psillakis, \"Projection-based adaptive neurocontrol with switching logic deadzone tuning,\" IEEE Transactions on Neural Networks, vol. 20, no. 9, pp. 1520-1527, Sept. 2009. H.E. Psillakis, \"Sampled-data adaptive NN tracking control of uncertain nonlinear systems,\" IEEE Transactions on Neural Networks, vol. 20, no. 2, pp. 336-355, Feb. 2009. H.E. Psillakis and A.T. Alexandridis, \"NN-based adaptive tracking control of uncertain nonlinear systems disturbed by unknown covariance noise,\" IEEE Transactions Neural Networks, vol. 18, no. 6, pp. 1830-1835, Nov. 2007. H.E. Psillakis and A.T. Alexandridis, \"A simple nonlinear adaptive-fuzzy passivity-based control of power systems,\" Nonlinear Dynamics & Systems Theory: an Int. J. of Res. & Surveys, vol. 7, no. 1, pp. 51-67, 2007. A.T. Alexandridis and H.E. Psillakis, \"The inverse optimal LQR problem and its relation to passivity and eigenvalue assignment,\" Int. J. of Tom. & Stat., vol. 5, w05, pp. 133-139, 2007. H.E. Psillakis and A.T. Alexandridis, \"Adaptive neural motion control of n-link robotic manipulators subject to unknown disturbances and stochastic perturbations,\" IEE Proc.-Control Theory & Applications, vol. 153, no. 2, pp. 127-138, 2006. H.E. Psillakis and A.T. Alexandridis, \"Adaptive tracking control for stochastic uncertain nonlinear systems satisfying short- and long-term cost criteria,\" Int. J. Control, vol. 79, no. 2, pp. 107-118, 2006. H.E. Psillakis and A.T. Alexandridis, \"A new excitation control of multimachine power systems, I: Decentralized nonlinear adaptive control design and stability analysis,\" Int. J. Control, Automation & Systems, vol. 3, no. 2, pp. 278-287, 2005. H.E. Psillakis and A.T. Alexandridis, \"A new excitation control of multimachine power systems, II: Robustness and disturbance attenuation analysis,\" Int. J. Control, Automation & Systems, vol. 3, no. 2, pp. 288-295, 2005. E.A. Androulidakis, A.T. Alexandridis, H.E. Psillakis and D.P. Agoris, \"Effects of power system deregulation on control design and on high-voltage grid structure and performance,\" WSEAS Trans. Circ. & Syst., vol. 9, no. 4, pp. 133-139, 2005. Conference Proceedings T. A. Alexandridis and H. E. Psillakis, \"Enhanced oscillation damping in power systems by extending the VSI control,\" 14th Mediterranean Conference on Power Generation Transmission, Distribution and Energy Conversion (MEDPOWER 2024), Athens, Greece, 2024, pp. 625-630, doi: 10.1049/icp.2024.4730. A. K. Gkesoulis and H. E. Psillakis, \"Distributed UAV Formation Control with Prescribed Performance,\" 2020 International Conference on Unmanned Aircraft Systems (ICUAS), Athens, Greece, 2020, pp. 439-445, doi: 10.1109/ICUAS48674.2020.9213862. H.E. Psillakis, \"Further results on robustness of the nonlinear PI control method: the ignored actuator dynamics case,\" 24th Mediterranean Conference on Control and Automation (MED), Athens, Greece, June 21-24, 2016. P.M. Chavatzopoulos, T. Giotis, M. Christodoulou and H. Psillakis, \"Using RISE Observer to Implement Patchy Neural Network for the Identification of \"Wing Rock\" Phenomenon on Slender Delta 80° Wings\", Proceedings of 13th Int. Conf. on Engineering Applications of Neural Networks, EANN 2012, London, UK, September 20-23, 2012. H. E. Psillakis, \"Improving transient performance of Nussbaum-gain based controllers with barrier Lyapunov functions\", Proceedings of the IASTED International Conference Control and Applications ( 2012) , pp. 93-97, Crete, Greece, June 18 - 20, 2012. T. Giotis, H.E. Psillakis, A. Panagiotidou, N. Chatzidamianou and M.A. Christodoulou, \"EGFR Signaling Pathway Estimation Using a RISE-based Asymptotic Observer,\" 19th Mediterranean Conference on Control and Automation, Corfu, Greece, June 20-23, 2011. H. E. Psillakis, Y. Boutalis, T. Giotis and M.A. Christodoulou, \"Adaptive identification of Fuzzy Cognitive Networks,\" 4th Int. Symp. Comm., Control & Sign. Process., ISCCSP 2010, Limassol, Cyprus, March 2010. H.E. Psillakis, \"An adaptive NN controller with second order SMC-based NN weight update law for asymptotic tracking,\" Int. Conf. Artif. Neural Networks, ICANN 2009, Limassol, Cyprus, Sept. 2009. H.E. Psillakis, \"High-order fuzzy switching neural networks: Application to the tracking control of a class of uncertain SISO nonlinear systems,\" Int. Conf. Artif. Neural Networks, ICANN 2009, Limassol, Cyprus, Sept. 2009. A.T. Ale",
  "content_length": 12621,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:41"
}