{
  "name": "Haridimos Kondylakis",
  "homepage": "https://users.ics.forth.gr/~kondylak",
  "status": "success",
  "content": "Haridimos Kondylakis Personal Page Haridimos Kondylakis Computer Science Department, University of Crete Institute of Computer Science FORTH About Me Research Prototypes Publications Teaching Contact & Meet Me Haridimos Kondylakis Associate Professor, Computer Science Department, University of Crete Affiliated Researcher, Institute of Computer Science, Foundation of Research & Technology-Hellas (FORTH) Short Bio Haridimos Kondylakis is an Associate Professor of Big Data Engineering at Computer Science Department, University of Crete and an Affiliated Researcher at Computational BioMedicine Laboratory (CBML), Institute of Computer Science, Foundation of Research & Technology-Hellas (FORTH). He holds a Ph.D and an M.Sc. in Computer Science from University of Crete. He is also a visiting Professor at Hellenic Open University, teaching lessons related to Big Data Management, Semantics and Artificial Intelligence. In the past he has participated in more that 27 EU research projects with a total budget over 100Mie and he is currently participating in seven H2020 EU projects ( SUNRISE, ALTHEA, EUCAIM, GenoMed4All, ODIN, SafePolyMed, RadioVal, ProCAncer-I ) and two national research projects (DEDALUS as PI, TALE as co---PI). He has more than 220 publications in international conferences, books and journals including ACM SIGMOD, VLDB, JWS, KER, EDBT, ISWC, ESWC etc. He is the organizer of the International Workshop on Semantic Web Technologies for Health Data Management and the leader of Data Storage, Curation and Management Working Group of the EU commission for the AI for health imaging projects. He also acts as a regular reviewer and a PC member for a number of premier journals and conferences, such as WWW, EDBT, SIGMOD, VLDBJ, JWS, JODS, CIKM, EDBT, ISWC etc. Positions Present 2024 Associate Professor Computer Science Department, University of Crete Present 2024 Affiliated Researcher Institute of Computer Science, Foundation of Research & Technology (FORTH) Present 2025 Founder & CTO Ypsilon Care Present 2025 Visiting Professor University of Ioannina Present 2021 Horizon Proposal Evaluator European Commission Present 2019 Visiting Professor Hellenic Open University Present 2016 Project Evaluator General Secretary of Research and Technology 2023 2011 Collaborating Researcher Institute of Computer Science, Foundation of Research & Technology (FORTH) 2023 2014 Visiting Lecturer Computer Science Department, University of Crete 2023 2013 Visiting Lecturer Department Electrical and Computer Engineering, Hellenic Mediterranean University 2023 2020 Product Architect Mind-Alliance 2020 2019 Data Management & AI Consultant Energy S.A 2011 2010 Scientific Specialist Information Systems Division, Hellenic Army 2010 2003 Research Assistant Institute of Computer Science, Foundation of Research & Technology (FORTH) 2008 2008 R & D Engineer & External Advisor PLANET S.A Education & Training Ph.D. 2010 Ph.D. in Information Systems Computer Science Department, University of Crete, Greece M.Sc.2006 Master in Information Systems & Telecommunications Computer Science Department, University of Crete, Greece B.A.2003 Bachelor in Computer Science Computer Science Department, University of Crete, Greece News April 2025 SIGMOD 2025 Distinguished Reviewer Award Honors, Awards and Grants April 2025 SIGMOD 2025 Distinguished Reviewer Award Nominated for being an outstanding program committee member. October 2023 Nominee for OHDSI 2023 Best Community Contribution award For the paper Woo Yeon Park, Kyulee Jeon, Teri Sippel Schmidt, Haridimos Kondylakis, Seng Chan You, Paul Nagy, Development of Medical Imaging Data Standardization for Imaging-Based Observational Research: OMOP Common Data Model Extension, October 2023 ELIDEK Grant with the third best score in category \"Mathematics and Information Sciences\" For the project TALE: Property Graphs at Scale . September 2020 Teaching Grant - Acquisition of academic teaching experience to young scientists PhD holders Teaching the course of Programming Languages & Knowledge-Based Systems, Department Electrical and Computer Engineering, Hellenic Mediterranean University August 2020 ELIDEK Grant with best score in category \"Mathematics and Information Sciences\" iQARuS - Efficient Query Answering over RDF streams using Summaries . September 2018 Teaching Grant - Acquisition of academic teaching experience to young scientists PhD holders Teaching the course of Programming Languages & Artificial Intelligence at Technological Educational Institute of Crete. March 2018 Teaching Grant - Acquisition of academic teaching experience to young scientists PhD holders Teaching the course of AI at Technological Educational Institute of Crete. November 2017 Paper Award - Best of medical informatics The Editorial Board of the 2017 IMIA Yearbook of Medical Informatics has selected the artile: Kondylakis H, Koumakis L, Hänold S, Nwankwo I, Forgó N, Marias K, Tsiknakis M, Graf N Donor’s support tool: Enabling informed secondary use of patient’s biomaterial and personal data Int J Med Inform 2017 Jan;97:282-92 for listing in the Yearbook as one of the best articles from the literature in the ‘Consumer Health Informatics’ subfield of medical informatics published in the past year. October 2017 Teaching Grant - Acquisition of academic teaching experience to young scientists PhD holders Teaching the course of Knowledge Systems at Technological Educational Institute of Crete. July 2017 H2020-SC1-2016-2017 - Grant BOUNCE Project – Personalised medicine June 2017 Finalist for the best paper award IEEE CBMS iManageCancer: Developing a platform for Empowering patients and strengthening self-management in cancer diseases February 2017 Post-Doctoral IKY scholarship Effective information indexing and partitioning for clustered RDF/S systems. February 2017 Teaching Grant - Acquisition of academic teaching experience to young scientists PhD holders Teaching the course of Artificial Intelligence at Technological Educational Institute of Crete. September 2016 Teaching Grant - Acquisition of academic teaching experience to young scientists PhD holders Teaching the course of Advanced Programming at Technological Educational Institute of Crete. September 2016 Finalist for European Linked Data Contest (Greece) RDF Digest has been selected as the finalist from Greece to participate in the European Linked Data Contest June 2015 Top-3 Rated Paper Georgia Troullinou, Haridimos Kondylakis, Evangelia Daskalaki, Dimitris Plexousakis: RDF Digest: Efficient Summarization of RDF/S KBs, Extended Semantic Web Conference (ESWC), 2015, pp 119-134, Portoroz, Slovenia February 2015 H2020 - PHC26 Grant iManageCancer Project 2006 - 2010 PhD Student Fellowship Institute of Computer Science, Foundation of Research & Technology (FORTH), Greece 2003 – 2006 MSc Student Fellowship Institute of Computer Science, Foundation of Research & Technology (FORTH), Greece 2002 – 2003 Undergraduate Student Fellowship Institute of Computer Science, Foundation of Research & Technology (FORTH), Greece Research Interests Big Data Engineering Semantic Web Semantic Summarization Quantum Computing Data Partitioning & Indexing Knowledge Representation & Management Information Extraction Conceptual Modelling Data Management for Biomedical Applications Decision Support Ehealth & Personal Health Systems Information Integration and Retrieval Systems for the web Interoperability of Heterogeneous and Distributed Information Bases Trivium My Erdos Number is 4 Organizational Activities (2025-2024 only here) Participation in Committees: Member of Steering committee of the Master Program Biomedical Engineering 2025 (FORTH-TUC-UOC), Postgraduate Evaluation committee (CSD-UOC) Editorial Board: Information - MDPI, Algorithms - MDPI Organizer: IJCKG 2025, Workshop on Quantum Computing and Data/Knowledge Management (QC&DKM) 2025, QSW Symposium 2025, PervasiveHealth 2024 Advisory Board: Sci — Open Access Journal of Scientific, MDPI PC Member: VLDB 2026, SIGMOD 2026, ISWC 2026, ESWC 2026, EDBT 2025, CIKM 2025, VLDB 2025, SIGMOD 2025, ESWC 2025, ISWC 2025 SIGMOD 2024, EDBT 2024, VLDB 2024, ISWC 2024, WSDM 2024, EMBC 2024, AAAI 2024, ADBIS 2024, ESWC 2024, ISWC 2024 Reviewer (last two years only): ADBIS 2025, JOW 2025, Quantum Machine Intelligence 2025, EDBT 2025, IJDL 2025, JBHI 2025, JMIR 2025, VLDBJ 2024, ICDE 2024, JBHI 2024, npDigitalMedicine 2024 Current Research Projects DEDALUS (PI) Data Management Using Quantum Computing (H.F.R.I.) Desing and develop a query optimizer for relational data exploiting quantum technologies. TALE (co-PI) Property Graphs at Scale (H.F.R.I.) The main objective of this work is to design a technological stack, based on solid theoretical underpinning, around the property graph data model that can enable graph processing and analytics at scale. The aim has largely escaped the attention of the academic community despite its prominence in practical applications. In particular, such a stack shall ensure correctness of graph specifications, graph queries, and graph transformations. The overarching aims of this work is to capitalize expertise and technology that is developed for decades at FORTH for semantic graphs, such as those of graph databases, semantic web technologies, foundations of databases and data models, big data systems, as well as graph algorithms and techniques and to generate a whole new field of interest the scientific community focusing on Property Graphs. AFRIC-AI (HORIZON). ALTHEA (HORIZON). Dorian Gray (HORIZON). MAYA (HORIZON). MULTIPULM (HORIZON). PATH (HORIZON). PROMOTE (GSRT). SUNRISE Sustainable interventions and healthy behaviors for adolescent primary prevention of cancer with digital tools. (HORIZON) Primary prevention of cancer through behaviour changes in adolescence – a critical period in which many risk behaviours are initiated –, is a huge health and societal challenge in Europe. In alignment with this need, SUNRISE will ",
  "content_length": 316930,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:39"
}