{
  "name": "Harm J. Griffioen",
  "homepage": "https://harmgriffioen.github.io",
  "status": "success",
  "content": "Harm GriffioenSearchHarm GriffioenAssistant Professor Cyber SecurityDelft University of TechnologyBiographyI am an assistant professor at the cyber security group at Delft University of Technology. My research interests include internet measurements, network security, and cyber threat intelligence. During my PhD I studied for two years at the Hasso Plattner Institute in Potsdam, Germany, and finished the PhD at Delft University of Technology. If you are interested in Internet-wide measurements and want to collaborate, you can reach me at: h.j.griffioen AT tudelft DOT nl.Interests Network Security Internet Measurements Cyber Threat IntelligenceEducationPhD in Cyber Threat Intelligence, 2022Delft University of TechnologyMSc in Cyber Security, 2018Delft University of TechnologyBSc in Computer Science, 2016Delft University of TechnologyRecent PublicationsQuickly discover relevant content by filtering publications. Harm Griffioen, Giorgos Koursiounis, Georgios Smaragdakis, Christian Doerr (2024). Have you SYN me? characterizing ten years of Internet scanning. In ACM Internet Measurement Conference.Cite Daniel Wagner, Sahil Ashish Ranadive, Harm Griffioen, Michalis Kallitsis, Alberto Dainotti, Georgios Smaragdakis, Anja Feldmann (2023). How to Operate a Meta-Telescope in your Spare Time. In ACM Internet Measurement Conference.Cite Harm Griffioen, Huangcheng Hu, Christian Doerr (2023). SIP Bruteforcing in the Wild - An Assessment of Adversaries, Techniques and Tools. In IFIP Networking Conference.Cite Harm Griffioen, Christian Doerr (2023). Could you clean up the Internet with a Pit of Tar? Investigating tarpit feasibility on Internet worms. In IEEE Symposium on Security and Privacy.Cite Harm Griffioen, Kris Oosthoek, Paul van der Knaap, Christian Doerr (2021). Scan, test, execute: Adversarial tactics in amplification DDoS attacks. In ACM SIGSAC Conference on Computer and Communications Security.Cite DOISee all publications ContactFor questions or collaboration opportunities, please contact me using the email address below. h.j.griffioen@tudelft.nl Van Mourik Broekmanweg 5, Delft, 2628 XE Room 02.220 Cite × Copy Download",
  "content_length": 2151,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:41"
}