{
  "name": "Harrison Goldstein",
  "homepage": "https://cse.buffalo.edu/~hgoldste",
  "status": "success",
  "content": "Harrison Goldstein Harrison Goldstein (he/him) Blog / CV / Contact I am hiring PhD students this cycle! If you are considering a PhD and interested in programming languages, software engineering, or human-computer interaction, please take a look at my recent publications below and consider applying! I am happy to talk with prospective students via email, but please demonstrate concrete interest in working together; if your message looks AI-generated or like a form email, I may not have the bandwidth to read it. About Me I am an Assistant Professor in the Department of Computer Science and Engineering at the University at Buffalo. Previously, I was a postdoc at the University of Maryland, working with Leo Lampropoulos as a Victor Basili Postdoctoral Fellow. I earned my PhD working with Professor Benjamin C. Pierce at the University of Pennsylvania. In my research, I make the software development process safer and more effective by building tools for software validation that address the needs of real users. My main area of study is programming languages, but I borrow motivation and techniques from both software engineering and human-computer interaction as well. Currently my projects center around the theoretical, practical, and human aspects of property-based testing and formal methods. I love to collaborate, so feel free to reach out if you have anything you'd like to discuss. News June 19, 2025 Received SIGPLAN's John C. Reynolds Doctoral Dissertation Award. Congratulations to Rachit Nigam who also received the award this year! May 7, 2025 Accepted a position as Assistant Professor at the University at Buffalo! Mar 11, 2025 Received the Morris and Dorothy Rubinoff Award from the University of Pennsylvania Department of Computer and Information Science. Dissertation Property-Based Testing for the People Harrison Goldstein advised by Benjamin C. Pierce approved by Stephanie Weirich (committee chair), Andrew Head, Mayur Naik, Hila Peleg Defended May 24, 2024 PDF Talk Selected Publications Tuning Random Generators: Property-Based Testing as Probabilistic Programming Ryan Tjoa, Poorva Garg, Harrison Goldstein, Todd Millstein, Benjamin C. Pierce, Guy Van den Broeck OOPSLA 2025 Preprint QED in Context: An Observation Study of Proof Assistant Users Jessica Shi, Cassia Torczon, Harrison Goldstein, Benjamin Pierce, Andrew Head OOPSLA 2025 Preprint FEDT: Supporting Experiment Design and Execution in HCI Fabrication Research Valkyrie Savage, Harrison Goldstein, Nóra Püsök, Jia Yi Ren, Bhaskar Dutt, Chandrakana Nandi, Lora Oehlberg UIST 2025 DOI Designing Proof Deautomation in Rocq Jessica Shi, Cassia Torczon, Harrison Goldstein, Andrew Head, Benjamin Pierce PLATEAU 2025 PDF Tyche: Making Sense of Property-Based Testing Effectiveness Harrison Goldstein, Jeffrey Tao, Zac Hatfield-Dodds, Benjamin C. Pierce, Andrew Head UIST 2024 PDF Mica: Automated Differential Testing for OCaml Modules Ernest Ng, Harrison Goldstein, Benjamin C. Pierce OCaml Workshop 2024 PDF Demonstrating FEDT: Supporting Characterization Experiments in Fabrication Research Valkyrie Savage, Nóra Püsök, Harrison Goldstein, Chandrakana Nandi, Jia Yi Ren and Lora Oehlberg SCF 2024 Demo Stream Types Joseph W Cutler, Christopher Watson, Emeka Nkurumeh, Phillip Hilliard, Harrison Goldstein, Caleb Stanford, Benjamin C. Pierce PLDI 2024 PDF Daedalus: Safer Document Parsing Iavor Diatchki, Mike Dodds, Harrison Goldstein, Bill Harris, David Holland, Benoit Razet, Cole Schlesinger, Simon Winwood PLDI 2024 DOI Property-Based Testing in Practice (Distinguished Paper) Harrison Goldstein, Joseph W. Cutler, Daniel Dickstein, Benjamin C. Pierce, Andrew Head ICSE 2024 PDF Reflecting on Random Generation (Distinguished Paper) Harrison Goldstein, Samantha Frohlich, Meng Wang, Benjamin C. Pierce ICFP 2023 PDF Talk Etna: An Evaluation Platform for Property-Based Testing Jessica Shi, Alperen Keles, Harrison Goldstein, Benjamin C. Pierce, Leonidas Lampropoulos ICFP 2023 Experience Report PDF Parsing Randomness Harrison Goldstein, Benjamin C. Pierce OOPSLA 2022 PDF Some Problems with Properties: A Study on Property-Based Testing in Industry Harrison Goldstein, Joseph W. Cutler, Adam Stein, Andrew Head, Benjamin C. Pierce HATRA 2022 PDF Slides Everybody Clap Your Hands: The Cha-Cha Slide is Turing Complete Harrison Goldstein SIGBOVIK 2022 PDF Do Judge a Test by its Cover: Combining Combinatorial and Property-Based Testing Harrison Goldstein, John Hughes, Leonidas Lampropoulos, Benjamin C. Pierce ESOP 2021 PDF Video Talks & Speaking The Best New Programming Language is a Proof Assistant DC Systems 006 VOD Haskell Interlude 59 Haskell Interlude Podcast My PhD Compass: 6 Ways to Guide a PhD Towards Success PLMW @ ICFP 2024 VOD Property-Based Testing in Practice Disseminate Podcast Podcast Consider Collaboration with Samantha Frohlich PLMW @ POPL 2024 VOD TheForkJoin Episode 2 TheForkJoin Podcast Podcast Some Problems with Properties NJPLS October 2022 Abstract Reflecting on Random Generation NJPLS May 2022 Abstract Other Content Think Globally, Discuss PL Locally Harrison Goldstein, Michael Greenberg, Noam Zilberstein SIGPLAN PL Perspectives - September 16, 2025 Post Conferences after COVID: An Early-Career Perspective Joseph W. Cutler, Harry Goldstein, Andrew K. Hirsch, Jaemin Hong, Chandrakana Nandi SIGPLAN PL Perspectives - March 25, 2021 Post Delimited Continuations and Monads Harrison Goldstein Unpublished PhD Milestone Draft Featured Blog Posts A Fun Little Mocktail Sep 16, 2024 Don't Give a No-Op Talk Apr 22, 2024 The (Regular) Language of Dance Apr 2, 2018 Brown Butter Chocolate Chip Cookies Feb 24, 2019 Coordinates Website harrisongoldste.in You are here! Email me@harrisongoldste.in Ideal way to get in touch. BlueSky @harrisongoldste.in I check notifications every couple of weeks. Mastodon @harrisongoldstein@hci.social Similar to BlueSky YouTube @harrisongoldstein2137 Talk VODs and occasional shorts. Beli @hgoldstein95 Judge my taste in restaurants. Website source on GitHub",
  "content_length": 6021,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:49"
}