{
  "name": "Harsh Beohar",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/harsh-beohar",
  "status": "success",
  "content": "Dr Harsh Beohar | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Harsh Beohar School of Computer Science Lecturer in Verification PGR Tutor Member of the Foundations of Computation research group h.beohar@sheffield.ac.uk Regent Court (DCS) Full contact details Dr Harsh Beohar School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Publications Journal articles Beohar H, König B, Küpper S & Silva A (2020) Conditional transition systems with upgrades. Science of Computer Programming, 186. View this article in WRRO Varshosaz M, Beohar H & Mousavi MR (2018) Basic behavioral models for software product lines: Revisited. Science of Computer Programming, 168, 171-185. Beohar H, König B, Küpper S, Silva A & Wißmann T (2018) A coalgebraic treatment of conditional transition systems with upgrades. Logical Methods in Computer Science, 14(1). View this article in WRRO Beohar H & Mousavi MR (2016) Input–output conformance testing for software product lines. Journal of Logical and Algebraic Methods in Programming, 85(6), 1131-1153. Beohar H, Varshosaz M & Mousavi MR (2016) Basic behavioral models for software product lines: Expressiveness and testing pre-orders. Science of Computer Programming, 123, 42-60. Beohar H & Cuijpers PJL (2014) Avoiding diamonds in desynchronisation. Science of Computer Programming, 91, Part A, 45-69. View this article in WRRO Beohar H & Cuijpers P (2011) Desynchronizability of (Partial) synchronous closed loop systems. Scientific Annals of Computer Science, 21, 5-38. Luckhardt D, Beohar H & Küpper S () On Kleisli liftings and decorated trace semantics. Electronic Notes in Theoretical Informatics and Computer Science, Volume 4 - Proceedings of.... Book chapters Rot J, Junges S & Beohar H (2024) Relating Apartness and Branching Bisimulation Games, Lecture Notes in Computer Science (pp. 203-213). Springer Nature Switzerland Conference proceedings Luckhardt D, Beohar H & Kupke C (2025) Expressivity of Bisimulation Pseudometrics over Analytic State Spaces. Leibniz International Proceedings in Informatics Lipics, Vol. 342 Forster J, Schröder L, Wild P, Beohar H, Gurke S, König B & Messing K (2025) Quantitative Graded Semantics and Spectra of Behavioural Metrics. Leibniz International Proceedings in Informatics Lipics, Vol. 326 Forster J, Schröder L, Wild P, Beohar H, Gurke S & Messing K (2024) Graded Semantics and Graded Logics for Eilenberg-Moore Coalgebras (pp 114-134) Turkenburg R, Beohar H, Kupke C & Rot J (2024) Proving behavioural apartness. Coalgebraic Methods in Computer Science, Vol. 14617 (pp 156-173). Luxembourg City, Luxembourg, 6 April 2024 - 6 April 2024. View this article in WRRO Beohar H, Gurke S, König B, Messing K, Forster J, Schröder L & Wild P (2024) Expressive quantale-valued logics for coalgebras: an adjunction-based approach. 41st International Symposium on Theoretical Aspects of Computer Science (STACS 2024), Vol. 289 (pp 10:1-10:19). Clermont-Ferrand, France, 12 March 2024 - 12 March 2024. View this article in WRRO Turkenburg R, Beohar H, Kupke C & Rot J (2023) Forward and backward steps in a fibration. 10th Conference on Algebra and Coalgebra in Computer Science (CALCO 2023), Vol. 270 (pp 6:1-6:18). Padova, Italy, 19 June 2023 - 19 June 2023. View this article in WRRO Beohar H, Gurke S, König B & Messing K (2023) Hennessy-Milner theorems via Galois connections. Leibniz International Proceedings in Informatics, LIPIcs, Vol. 252 (pp 12:1-12:18). Warsaw, Poland, 13 February 2023 - 13 February 2023. View this article in WRRO Ford C, Milius S, Schröder L, Beohar H & König B (2022) Graded monads and behavioural equivalence games. LICS '22: Proceedings of the 37th Annual ACM/IEEE Symposium on Logic in Computer Science. Haifa, Israel, 2 August 2022 - 2 August 2022. View this article in WRRO Beohar H, König B, Küpper S & Mika-Michalski C (2022) Predicate and relation liftings for coalgebras with side effects : an application in coalgebraic modal logic. Coalgebraic Methods in Computer Science : 16th IFIP WG 1.3 International Workshop, CMCS 2022, Colocated with ETAPS 2022, Munich, Germany, April 2-3, 2022, Proceedings(13225) (pp 1-22). Munich, Germany, 2 April 2022 - 2 April 2022. View this article in WRRO Beohar H & Küpper S (2019) Bisimulation maps in presheaf categories. Electronic Notes in Theoretical Computer Science, Vol. 347 (pp 5-24). London, UK, 4 June 2019 - 4 June 2019. View this article in WRRO Beohar H, Konig B, Kupper S & Silva A (2017) Conditional transition systems with upgrades. 2017 International Symposium on Theoretical Aspects of Software Engineering (TASE) (pp 1-8), 13 September 2017 - 15 September 2017. Beohar H & Küpper S (2017) On path-based coalgebras and weak notions of bisimulation. 7th Conference on Algebra and Coalgebra in Computer Science (CALCO 2017), Vol. 72 (pp 6:1-6:17). Ljubljana, Slovenia, 14 June 2017 - 14 June 2017. View this article in WRRO Beohar H & Cuijpers PJL (2015) Open Maps in Concrete Categories and Branching Bisimulation for Prefix Orders. Electronic Notes in Theoretical Computer Science, Vol. 319 (pp 51-66) Varshosaz M, Beohar H & Mousavi MR (2015) Delta-Oriented FSM-Based Testing (pp 366-381) Beohar H & Mousavi MR (2015) A Pre-congruence Format for XY-simulation (pp 215-229) Beohar H & Mousavi MR (2014) Input-output conformance testing based on featured transition systems. Proceedings of the 29th Annual ACM Symposium on Applied Computing (pp 1272-1278) Beohar H & Cuijpers PJL (2013) Avoiding Diamonds in Desynchronization (pp 36-54) Agut DN, van Beek B, Beohar H, Cuijpers P & Fonteijn J (2011) The Hierarchical Compositional Interchange Format (pp 316-335) Beohar H & Mousavi MR () Spinal Test Suites for Software Product Lines. Electronic Proceedings in Theoretical Computer Science, Vol. 141 (pp 44-55) Beohar H & Cuijpers P () A theory of desynchronisable closed loop system. Electronic Proceedings in Theoretical Computer Science, Vol. 38 (pp 99-114) Beohar H, Nadales Agut DE, van Beek DA & Cuijpers PJL () Hierarchical states in the Compositional Interchange Format. Electronic Proceedings in Theoretical Computer Science, Vol. 32 (pp 42-56) Theses Beohar H (2013) Refinement of communication and states in models of embedded systems. Other Beohar H, König B, Küpper S & Mika-Michalski C (2019) Coalgebraic Games in Kleisli Categories. Beohar H & Mousavi MR () Two Logical Characterizations for Input-Output Conformance. Electronic Proceedings in Theoretical Computer Science, 160, 47-47. Preprints Turkenburg R, Beohar H, van Breugel F, Kupke C & Rot J (2025) Constructing Witnesses for Lower Bounds on Behavioural Distances, arXiv. Luckhardt D, Beohar H & Kupke C (2025) Expressivity of bisimulation pseudometrics over analytic state spaces, arXiv. Luckhardt D, Beohar H & Küpper S (2024) On Kleisli liftings and decorated trace semantics, arXiv. Rot J, Junges S & Beohar H (2024) Relating Apartness and Branching Bisimulation Games, arXiv. Beohar H, Gurke S, König B, Messing K, Forster J, Schröder L & Wild P (2023) Expressive Quantale-valued Logics for Coalgebras: an Adjunction-based Approach, arXiv. Forster J, Schröder L, Wild P, Beohar H, Gurke S & Messing K (2023) Graded Semantics and Graded Logics for Eilenberg-Moore Coalgebras, arXiv. Forster J, Schröder L, Wild P, Beohar H, Gurke S, König B & Messing K (2023) Quantitative Graded Semantics and Spectra of Behavioural Metrics, arXiv. Beohar H, Gurke S, König B & Messing K (2022) Hennessy-Milner Theorems via Galois Connections, arXiv. Ford C, Beohar H, König B, Milius S & Schröder L (2022) Graded Monads and Behavioural Equivalence Games, arXiv. Beohar H, König B, Küpper S & Mika-Michalski C (2021) Predicate and relation liftings for coalgebras with side effects: an application in coalgebraic modal logic, arXiv. Beohar H & Küpper S (2019) Bisimulation maps in presheaf categories, arXiv. Beohar H, König B, Küpper S & Silva A (2017) Conditional Transition Systems with Upgrades, arXiv. Beohar H & Küpper S (2017) On path-based coalgebras and weak notions of bisimulation, arXiv. Beohar H, König B, Küpper S, Silva A & Wißmann T (2016) A coalgebraic treatment of conditional transition systems with upgrades, arXiv. Beohar H & Mousavi MR (2014) Spinal Test Suites for Software Product Lines, arXiv. Beohar H & Cuijpers P (2010) A theory of desynchronisable closed loop system, arXiv. Beohar H, Agut DEN, van Beek DA & Cuijpers PJL (2010) Hierarchical states in the Compositional Interchange Format, arXiv. Beohar H, Cuijpers P & Baeten J (2009) Design of asynchronous supervisors, arXiv. Grants Quantitative verification of software families based on coalgebraic modal logic and games, EPSRC, 04/2023 - 08/2025, £235,841, as PISynthesising characteristic formulae and apartness proofs for coalgebras, Royal Society, 03/2023 - 03/2026, £11,875, as PI Links Foundations of Computation research group",
  "content_length": 8988,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:56"
}