{
  "name": "Harsha V. Madhyastha",
  "homepage": "https://www.harsha.usc.edu",
  "status": "success",
  "content": "Harsha V. Madhyastha's Homepage I am a Professor in the Thomas Lord Department of Computer Science at the University of Southern California, where I co-lead the Networked Systems Lab. Previously, I held faculty positions at the University of Michigan and at UC Riverside. I received a PhD in Computer Science and Engineering from the University of Washington and a B.Tech. in Computer Science and Engineering from the Indian Institute of Technology, Madras. My research has received the IRTF’s Applied Networking Research Prize twice and led to award papers at OSDI, NSDI, IMC, and IEEE CNS. I have also received multiple Google Faculty Research awards, a NetApp Faculty Fellowship, a Facebook Faculty Award, and an NSF CAREER award. At the University of Michigan, I was a recipient of the College of Engineering’s Neil Van Eenam Memorial Undergraduate Teaching Award. Selected Recent Publications Sprinter: Speeding Up High-Fidelity Crawling of the Modern Web.Ayush Goel, Jingyuan Zhu, Ravi Netravali, and Harsha V. Madhyastha.21st USENIX Symposium on Networked Systems Design and Implementation (NSDI’24), Santa Clara, CA, April 2024. Reviving Dead Links on the Web with FABLE. [ pdf ]Jingyuan Zhu, Anish Nyayachavadi, Jiangchen Zhu, Vaspol Ruamviboonsuk, and Harsha V. Madhyastha.ACM Internet Measurement Conference (IMC’23), Montreal, Canada, October 2023. Jawa: Web Archival in the Era of JavaScript. [ pdf ]Ayush Goel, Jingyuan Zhu, Ravi Netravali, and Harsha V. Madhyastha.16th USENIX Symposium on Operating Systems Design and Implementation (OSDI’22), Carlsbad, CA, July 2022. Oort: Efficient Federated Learning via Guided Participant Selection. [ pdf ] (Distinguished Artifact Award Winner)Fan Lai, Jie You, Xiangfeng Zhu, Harsha V. Madhyastha, and Mosharaf Chowdhury.15th USENIX Symposium on Operating Systems Design and Implementation (OSDI’21), July 2021. Near-Optimal Latency Versus Cost Tradeoffs in Geo-Distributed Storage. [ pdf ]Muhammed Uluyol, Anthony Huang, Ayush Goel, Mosharaf Chowdhury, and Harsha V. Madhyastha.17th USENIX Symposium on Networked Systems Design and Implementation (NSDI’20), Santa Clara, CA, February 2020. Close Menu Search Search Site",
  "content_length": 2176,
  "method": "requests",
  "crawl_time": "2025-12-01 13:18:55"
}