{
  "name": "Hassan Peyravi",
  "homepage": "https://www.kent.edu/cs/hassan-peyravi",
  "status": "success",
  "content": "Hassan Peyravi | Computer Science Skip to main content Live Chat Hassan Peyravi Professor Campus: Kent Office Location: Mathematical Sciences Building 262 Contact Information Email: hpeyravi@kent.edu Phone: 330-672-9062 Personal Website: Website Biography Dr. Peyravi is Professor of Computer Science at Kent State University. He received his M.S. and Ph.D. degrees in Computer Science from School of EECS at the University of Oklahoma. He was a Member of Technical Staff with the Chief Architecture Group at AT&T Bell Labs in NJ, participated in design and development of broadband ISDN networks and the Internet backbone. His research focuses on theoretical foundations of communication networks for various network systems including interconnection networks for large scale parallel processing, wireless networks, sensor networks, optical networks, and the Internet. His research has been supported by NASA Space Communication to study and evaluate the performance of media access control protocols for Mars missions, by CAIDA (Cooperative Association for Internet Data Analysis) to study Internet traffic management and routing protocols, by the National Science Foundation, and the  Internet2 Technology Evaluation Center (ITEC) to study traffic management for the next generation of IP networks, and by Cisco Systems in Cybersecurity.Dr. Peyravi serves as the Coordinator of Graduate Studies in Computer Science and Data Science. Education M.S. in Computer Science, School of EECS, University of Oklahoma Ph.D. in Computer Science, School of EECS, University of Oklahoma Computer Science Street Address241 Mathematical Sciences Building, Kent, OH 44242-0001 Mailing Address800 E. Summit St.Kent, OH 44242 Contact Us330-672-9980 office@cs.kent.edu Contact Us 330-672-3000 info@kent.edu Facebook LinkedIn Instagram QUICK LINKS Faculty Office Hours Undergraduate CS Tutoring facebook instagram youtube linkedin TikTok X snapchat ... Information Accessibility Annual Security Reports Campus Concerns Reporting For Our Alumni For the Media Jobs & Employment Privacy Statement HEERF CARES/CRRSAA/ARP Act Reporting and Disclosure Website Feedback",
  "content_length": 2145,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:05"
}