{
  "name": "Hassan Rivaz",
  "homepage": "https://users.encs.concordia.ca/~hrivaz",
  "status": "success",
  "content": "Hassan Rivaz – Full Professor & Research Chair Biography Professor Rivaz is the Research Chair in Medical Imaging with Deep Learning. He received his BSc from Sharif University, Masterâs from UBC, and PhD from Johns Hopkins University, followed by postdoctoral training at McGill University. He was elected to the Royal Society of Canada (RSC) in 2025, named the Rising Star in Bio-Imaging in Quebec in 2022, and won the Petro-Canada Young Innovator Award in 2016. He is the Director of the IMPACT Lab, and has been an Associate Editor of: IEEE Transactions on Medical Imaging (TMI, since 2017) Medical Image Analysis (MedIA, since 2025) IEEE Transactions on Ultrasonics, Ferroelectrics and Frequency Control (TUFFC, since 2018) IEEE OJEMB (2021-2024) He served as an Area Chair of MICCAI from 2017 to 2024, and for IPCAI in 2022. He was a member of the Organizing Committee of IEEE EMBC 2020, ISBI 2021, and IEEE IUS 2023. He co-organized tutorials on advances in ultrasound imaging at IEEE ISBI 2019 and ISBI 2018. He co-organized the CURIOUS 2018, CURIOUS 2019 and CuRIOUS-SEG 2022 Challenges on registration of ultrasound and MRI in neurosurgery, and the CereVis 2018 Workshop, all in conjunction with MICCAI. PhD Student Opportunities I am actively seeking talented PhD students. Please contact me at hassan.rivaz@concordia.ca. Awards & Honors Elected to the Royal Society of Canada, College of New Scholars (2025) Concordia University Research Chair in Medical Imaging with Deep Learning (2023â2028) QBIN Rising Star in Bio-Imaging in Quebec (2022) Concordia University Research Chair in Medical Image Analysis (2018-2023) Petro-Canada Young Innovator Award (2016â2018) NSERC Post-Doctoral Fellowship (2012â2013) Jeanne Timmins Costello Post-Doctoral Award (2011, 2014) DoD Pre-Doctoral Traineeship Award, $96,000 USD (2008â2011) Advanced Simulation Fellowship, Link Foundation, $25,000 USD (2008) STACOM best paper award, $400, (2012) MICCAI travel award, $700, (2009) SPIE Medical Imaging second best paper award (2009) Ranked 2 among >15,000, Iranian national university entrance exam for graduate studies (2003) Ranked 5 among > 200,000, Iranian national university entrance exam for undergraduate studies (1999) Silver medal, 12th National Physics Olympiad (1998) Best Paper Awards (Goudarzi & Rivaz, SPIE 2023): Finalist for the Robert Wagner All Conference Best Paper Award. (Salari, et al. SPIE 2023): Won The Best Student Paper Award in Image Processing. (Ashikuzzaman et al. 2022): Won the localization track of the IEEE IUS 2022 ULTRA-SR challenge. (Tehrani, Rivaz, SPIE 2021): Finalist for the Robert F. Wagner All Conference Best Student Paper Award. (Behboodi, .., Rivaz, SPIE 2021): Finalist for the Robert F. Wagner All Conference Best Student Paper Award (Goudarzi et al. 2020): Ranked first in Challenge on Ultrasound Beamforming with Deep Learning (CUBDL). (Hashemi & Rivaz IEEE TUFFC 2017): Editor's Selection of Articles in TUFFC (Dec 2018). (Shams, et al. 2016): Finalist for the Robert F. Wagner Best Paper Award. 16 finalists among more than 1000. (Zhou & Rivaz, IEEE EMBC): Invited for submission of full journal version. 10 invitations among 2948 submissions to IEEE EMBC. The IEEE JBHI paper (Zhou* & Rivaz 2016) is now published. Student Achievements Hojat Asgariandehkordi: B2X FRQNT Scholarship (2025â2027) Nicholas Kawwas: NSERC CGS Scholarship (2025â2026) Taha Koleilat (co-supervised by Y. Xiao): B2X FRQNT Scholarship (2025â2029) Soorena Salari (co-supervised by Y. Xiao): BF2 FRQS Scholarship (2025â2027) Ali Nasiri (co-supervised by M. Hosseini): B1X FRQNT Scholarship, PBEEE FRQNT Scholarship (2024â2025) Clyde Belasso (co-supervised by H. Benali): NSERC Alexander Graham Bell Canada Graduate Scholarship (2021) Md Ashikuzzaman: B2X FRQNT Scholarship (2021â2024), PBEEE FRQNT Scholarship (ranked first) Nima Masoumi: MASc Convocation Award for best MASc thesis (2019) Hoda Hashemi: MASc Convocation Award for best MASc thesis (2018) Dr. Yiming Xiao: BrainsCAN postdoctoral scholarship (2018â2020) ($110,000) H. Khodadadi: Best poster award, 3rd Annual PERFORM Conference, sponsored by Biospective ($500, 2016) R. Shams: Second place in Graduate Student Research paper competition, MASc category ($300, 2016) R. Shams: First place in Graduate Student Research paper competition, MASc category ($300, 2015) Publications See all publications on Google Scholar. Selected publications are available here, with codes here and on GitHub. Selected Teaching ENGR 371: Probability & Statistics (Winter 2024) ELEC 444: Medical Image Processing (Fall 2025)",
  "content_length": 4611,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:07"
}