{
  "name": "Hasti Seifi",
  "homepage": "http://hastiseifi.com",
  "status": "success",
  "content": "Home - Hasti Seifi Skip to content School of Computing and Augmented Intelligence Arizona State University 699 S Mill Ave, Room 374 Tempe, AZ 85281, United States Email Google Scholar LinkedIn I am an assistant professor of Computer Science at Arizona State University. Previously, I was an assistant professor in the Department of Computer Science at the University of Copenhagen (2020-2022) and an NSERC postdoctoral fellow at the Max Planck Institute for Intelligent Systems with Dr. Katherine J. Kuchenbecker. My Ph.D. was in the Department of Computer Science at the University of British Columbia with Professor Karon E. MacLean. Research Interests: Human-Computer Interaction, Haptics, Human-Robot Interaction, Human-AI Interaction, VR/AR, Accessibility Center Affiliations: Center for Human, Artificial Intelligence, and Robot Teaming (CHART), Center for Cybersecurity and Trusted Foundations (CTF) Prospective Students: I am looking for highly motivated Ph.D. students. If you are interested in joining my lab, please complete this form. News March 2025 – I received ACM SIGCHI Special Recognition Award for our work as part of the Google/academia Android XR interaction team. February 2025 – Four full papers and two late-breaking works were accepted at ACM CHI 2025. Congratulations to Kevin, Arpit, Maryam, Yinan, and Moaaz. January 2025 – Two late-breaking results were accepted at ACM/IEEE HRI 2025. Congratulations to Tejas and Saurabh. December 2024 – Our Google grant on AI+X research pathways was featured on ASU News. June 2024 – We’ve received an unrestricted gift from Google for studying text input in XR. May 2024 – I’ll be serving as the subcommittee co-chair for ACM CHI 2025 (Interacting with Devices: Interaction Techniques and Modalities). Feb 2024 – My NSF CAREER titled Democratizing Haptics: Enabling Novice Designers with Vibrotactile Models and Tools is awarded! Jan 2024 – Three papers and one LBW accepted to CHI 2024. Congratulations to Kevin, Yinan, Chungman, and Arpit! July 2023 – We received funding from The National Institutes of Health/National Eye Institute (NEI) for a 5-year project titled From Human-Powered to Automated Video Description for Blind and Low Vision Users to make online videos accessible for blind and low-vision individuals. June 2023 – I’ll be serving as an AC for CHI’24. June 2023 – Our workshop “Exploring Material Experiences Across Haptic Technologies” has been accepted to IEEE WHC 2023. Check out the workshop program here. April 2023 – One full paper accepted to IEEE World Haptics Conference 2023. Congratulations Martin! Jan 2023 – Two full papers and one interactivity were accepted to ACM CHI 2023. Nice collaborations with the University of Copenhagen, Ultraleap, and Gwangju Institute of Science and Technology. Papers are posted here. Jan 2023 – Our paper on user impression of robotic hands got accepted to ACM Transactions on Human-Robot Interaction. Dec 2022 – Our “Body x Materials” workshop is accepted to CHI 2023. Looking forward to working with UC3M and UCL colleagues on it. Dec 2022 – Our workshop “Open Access Tools and Libraries for VR” is accepted to IEEE VR 2023. Oct 2022 – Our paper on Intra-hug gestures is accepted at the Transactions on Human-Robot Interaction. Oct 2022 – Join our NordiCHI tutorial about Frontiers in Haptic Technology and Interaction Design at Aarhus University in October. Oct 2022 – I will teach a graduate course on Emerging Interface Technologies at ASU. August 2022 – I am joining Arizona State University (ASU) this fall. July 2022 – I will be serving as an AC for CHI 2023. May 2022 – HuggieBot received the best demo award at EuroHaptics 2022. Congrats Alexis and team! Dec 2021 – Two papers were accepted at EuroHaptics 2022. Nov 2021 – Our paper on DIY sensor design for social touch interaction with the NAO robot is accepted at the Frontiers in Robotics and AI. Oct 2021 – I am serving as an AC for UIST 2022. Sept 2021 – I am serving as the program co-chair of EuroHaptics 2022 with Prof. Astrid Kappers. Scroll to Top",
  "content_length": 4048,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:11"
}