{
  "name": "Hatice Gunes",
  "homepage": "https://www.cl.cam.ac.uk/~hg410",
  "status": "success",
  "content": "Professor Hatice Gunes's Home Page at Cambridge Department of Computer Science and Technology Home Research Publications Invited talks Software Teaching Affective Intelligence & Robotics Lab Professional activities The FABO database Community related PROFESSOR HATICE GUNES Friday Discourse on Creating Emotionally Intelligent Technology at the Royal Institution (June 24th, 2022) Full Professor of Affective Intelligence & Robotics Head of Affective Intelligence & Robotics Lab Department of Computer Science and Technology, University of Cambridge William Gates Building, 15 JJ Thomson Avenue, Cambridge, CB3 0FD, UK E-mail: hatice.gunes(@)cl.cam.ac.uk EPSRC Fellow, The Engineering and Physical Sciences Research Council (2019-present) Staff Fellow, Trinity Hall Cambridge (2019-present) Turing Faculty Fellow, Alan Turing Institute (2019-2021) Research Interests: Multimodal, social, and affective intelligence for AI systems; Social Robotics; Embodied Agents; Wellbeing Technologies & Fairness. Short Bio Prof. Gunes is an internationally recognized scholar in affective computing and social robotics. She is a former President of the Association for the Advancement of Affective Computing (AAAC) and was a Faculty Fellow (2019-2021) of the Alan Turing Institute – UK’s national centre for data science and artificial intelligence. She was named in the shortlist for the Sony Women in Technology Award with Nature 2025 which celebrates inspirational women in technology who are poised to redefine the future of their fields. Hatice Gunes obtained her PhD in computer science from the University of Technology Sydney (UTS) in Australia as an awardee of the Australian Government International Postgraduate Research Scholarship (IPRS) - a prestigious scholarship awarded on the basis of academic merit and research capacity. As a postdoctoral researcher at Imperial College London, she played a crucial role in the EU SEMAINE project, that created the world's first publicly available multimodal, fully autonomous, and real-time human-agent interaction system ( the SAL system). Attentive to user affect and nonverbal expressions, the project developed novel nonverbal audiovisual human behaviour analysis and multimodal agent behaviour synthesis capabilities, and won the Best Demo Award at IEEE ACII’09 and the Best Paper Award at IEEE FG’11. Now directing the Affective Intelligence and Robotics Lab (AFAR Lab) at the University of Cambridge’s Department of Computer Science and Technology, Prof Gunes spearheads research on multimodal, social, and affective intelligence for AI systems, particularly embodied agents and robots, by cross-fertilizing research in the fields of Machine Learning, Affective Computing, Social Signal Processing, and Human Nonverbal Behaviour Understanding. She has received funding for many competitive and prestigious projects, including a very competitive CHANSE project (6,3% acceptance rate) on Enhancing well-being for the future to investigate social robotics for child mental health and well-being assessment (2025-2028), a 5-year EPSRC Fellowship (~10% acceptance rate) to investigate robotic EQ for well-being (2019-2025), and the EU Horizon 2020 Grant for the WorkingAge project (2019-2022). She has been leading the AFAR team in establishing new collaborations with experienced wellbeing professionals as well as the Department of Psychiatry, which earned them the RSJ/KROS Distinguished Interdisciplinary Research Award Finalist at IEEE RO-MAN’21, and exploring ambitious new horizons that were consistently recognized with awards and honours. These range from affective intelligence for service robotics which was recognized with the Best Paper Award Finalist at IEEE RO-MAN’20, graph representation learning of multimodal behaviour for automatic depression assessment which was recognized with the  Best Student Paper Award Finalist at IEEE FG’24 to using robots to using robots for mental wellbeing assessment in children — with over 1,000 global media reports and an interview with The Guardian — and taking the robotic wellbeing coaches from the lab to the workplace, attracting over 700 media coverages. The latter were honoured with the Runner-up for the Collaboration Award at the 2023 University of Cambridge Vice-Chancellor's Awards for Research Impact and Engagement, and the Better Future Award at the Department of Computer Science and Technology's Hall of Fame Awards 2023. The AFAR team's ongoing efforts in mitigating bias in affective and wellbeing computing also earned them the Best Paper Award in Responsible Affective Computing at IEEE ACII'23. Prof. Gunes' impact extends beyond academia, contributing to national and international projects with real-world outcomes. Her industry collaboration on the Innovate UK Sensing Feeling project resulted in a commercially available portable sensor with passive, real-time, and in-the-wild deep learning-based affect sensing, leading to a US patent and the establishment of the spin-out company SensingFeeling. She is regularly invited to give talks at top-tier venues, addressing both scientific and broader audiences. Notable engagements include keynote talks at IEEE FG’19 and ICPR’22, as well as appearances at the Hay Festival, the Royal Institution, the Cambridge Science Festival, and the Festival of Ideas. Latest News Dec 2023 - Our collaborative research work Social Robots for Assessing and Promoting Mental Wellbeing (SORO4Wellbeing) was named the Runner-up for the Collaboration Award at the Vice-Chancellor's Awards for Research Impact and Engagement! . Sep 2023 - Our paper “It’s not Fair!” – Fairness for a Small Dataset of Multi-modal Dyadic Mental Well-being Coaching was accepted for oral presentation at ACII'23 Main Program and received the Best Paper Award in Responsible Affective Computing. Sep 2023 - Our paper A Framework for Automatic Personality Recognition in Dyadic Interactions was presented at ACII'23 Workshops. Aug 2023 - Our paper Longitudinal Evolution of Coachees’ Behavioural Responses to Interaction Ruptures in Robotic Positive Psychology Coaching was presented as a full paper at IEEE RO-MAN'23 Conference. Aug 2023 - Our paper Humanoid Robots for Wellbeing Assessment in Children: How Does Anxiety towards the Robot Affect Perceptions of Robot Role, Behaviour and Capabilities? was presented as a full paper at IEEE RO-MAN'23 Conference. Aug 2023 - Our paper Federated Continual Learning for Socially Aware Robotics was presented as a full paper at IEEE RO-MAN'23 Conference. Aug 2023 - Our paper Affective Computing for Human-Robot Interaction Research: Four Critical Lessons for the Hitchhiker was presented as a full paper at IEEE RO-MAN'23 Conference. Jan 2023 - Our paper Towards Causal Replay for Knowledge Rehearsal in Continual Learning has been accepted for oral presenation at AAAI'23 Bridge Program. Jan 2023 - Our paper Learning Person-specific Cognition from Facial Reactions for Automatic Personality Recognition is now available online in IEEE Trans. on Affective Computing. Jan 2023 - Our paper Robotic Mental Well-being Coaches for the Workplace: An In-the-Wild Study on Form has been accepted as a full paper at 2023 ACM/IEEE Int'l Conference on Human-Robot Interaction. Jan 2023 - Our paper Robotic Coaches Delivering Group Mindfulness Practice at a Public Cafe has been accepted for presenation as LBR at ACM/IEEE HRI 2023 Conference. Jan 2023 - We are organising LEAP-HRI 2023 Workshop on Lifelong Learning and Personalization in Long-Term Human-Robot Interaction as a third edition at 2023 ACM/IEEE HRI. Submit your papers by Jan 22 (early)/ Feb 19. Jan 2023 - Our paper Adaptive Robotic Mental Well-being Coaches has been accepted for presenation at ACM/IEEE HRI Pioneers'23Workshop. All News - All our news since September 2012 can be found here. ©2023Hatice Gunes Design downloaded from free website templates.",
  "content_length": 7887,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:08"
}