{
  "name": "Hau Chan",
  "homepage": "https://cse.unl.edu/~hchan",
  "status": "success",
  "content": "Home Hau ChanAssistant ProfessorSchool of ComputingUniversity of Nebraska-LincolnOffice: Avery 363e-mail: hchan3 [at] nebraska.edu (formerly hchan3 [at] unl.edu)Phone: 402-472-5091 Research Areas: Artificial Intelligence (AI), AI for Society and Social Good, Game Theory, Mechanism Design, Machine LearningMy main research lies in multi-agent aspects of AI for Society and Social Good, focusing on developing modeling and algorithmic foundations for tackling societal problems involving agents and predicting agent behavior in societal contexts, leveraging artificial intelligence (AI), game theory, mechanism design, and machine learning to better inform policymaking and (collective) decision-making. In recent years, our teams have been actively addressing societal challenges and fairness issues in various domains, including security (e.g., reducing potential vulnerability), public health (e.g., reducing substance use and homelessness), and urban planning (e.g., improving accessibility to public facilities). Currently, I lead the Computational Decision Science (CDS) Lab. Current Research Paradigms: Game-theoretic Models for Examining Agent BehaviorMechanism Design for Addressing Societal ProblemsResource Allocation and Optimization for Social GoodCollective Decision Making for Social DomainsMachine Learning for Public HealthI am looking for motivated students to work on research projects in the areas of game theory, mechanism design, or AI for social good(s). If you are interested, please contact me (via customized emails discussing my research/papers that you have read) and apply to the UNL CS graduate program. (Short) Bio:2018 - Current: Assistant Professor, University of Nebraska-Lincoln 2017 - 2018: Postdoctoral Fellow, Laboratory for Innovation Science at Harvard (Advisors: David Parkes and Karim Lakhani)2017 May - August: Postdoctoral Fellow, USC Center for Artificial Intelligence in Society (Advisors: Milind Tambe and Eric Rice)2015 - 2017: Postdoctoral Research Associate, Trinity University (Advisor: Albert Jiang)2010 - 2015: Ph.D. Candidate in Computer Science, Stony Brook University (Advisor: Luis Ortiz)        2012 May - August: NSF EAPSI Fellow, Nanyang Technological University (Advisor: Edith Elkind)2006 - 2010: B. S. Candidate in Computer Science and Mathematics, College of Charleston (Advisor: Dinesh Sarvate)        2009 May - August: NSF REU Student, Georgia Institute of Technology (Advisor: Plamen lliev)        2009 August: Summer Program Student in Analysis and Geometry, Princeton University(Selected) Awards:Early Career Spotlight, 31st International Joint Conference on Artificial Intelligence (IJCAI 2022)Distinguished SPC Member, 31st International Joint Conference on Artificial Intelligence (IJCAI 2022)Outstanding PC Member, 15th ACM International WSDM Conference (WSDM 2022)Distinguished PC Member, 27th International Joint Conference on Artificial Intelligence (IJCAI 2018)Best Student Research Paper Award, 15th Autonomous Agents and Multiagent Systems (AAMAS 2016)Best Research Paper Award, 2015 SIAM International Conference on Data Mining (SDM 2015)National Science Foundation Graduate Research Fellowship, 2012 - 2015Funding Acknowledgement (Thanks!): NSF IIS RI (Small) 2024-2027 (Role: PI)NSF IIS RI (via NSF-CSIRO International Collaboration) 2023-2026 (Role: Lead PI)  NIH's NIGMS, COBRE (via Rural Drug Addiction Research Center) 2022-2025 (Role: PI/Early Career Project Leader)Artificial Intelligence Journal (AIJ) and NSF (for supporting AAMAS DC and Student Scholarships) 2021-2022 (Role: Co-PI/PI)UNL Collaboration Initiative Planning Grant 2020-2021 and UNL Collaboration Initiative Seed Grant 2020-2022 (Role: Co-PI)USCYBERCOM (via National Strategic Research Institute) 2018-2019 (Role: Co-PI)(Selected) Conference/Workshop/Program: Co-Chair, Student Activities, AAAI 2026Co-Chair, Job Fair, AAAI 2026Co-Chair, AI And Social Good Track, IJCAI 2025Chair, Student Activities, AAAI 2025Co-Chair, Job Fair, AAAI 2025Co-Chair, The 16th Workshop on Optimization and Learning in Multiagent Systems (OptLearnMAS-25), AAMAS 2025Invited Speaker, Algorithmics of Fair Division and Social Choice, Institute for Mathematical Sciences, National University of Singapore, 2024Invited Speaker, Multi-agent Track, IJTCS-FAW 2024Co-Director, Algorithmic Game Theory, Summer (School) Courses, Croucher Foundation, 2024Co-Chair, The 15th Workshop on Optimization and Learning in Multiagent Systems (OptLearnMAS-24), AAMAS 2024Co-Chair, Demonstration (Demo) Track, IJCAI 2024Co-Chair, The 14th Workshop on Optimization and Learning in Multiagent Systems (OptLearnMAS-23), AAMAS 2023Co-Chair, Doctoral Consortium, IJCAI 2023Co-Chair, Finance, AAMAS 2023Co-Chair, The 13th Workshop on Optimization and Learning in Multiagent Systems (OptLearnMAS-22), AAMAS 2022Co-Chair, Diversity and Inclusion Activities, AAMAS 2022Co-Chair, Doctoral Consortium, AAMAS 2022Co-Chair, Scholarships, AAMAS 2022Panelist, CSGrad4US Mentoring Program, CRA-WP and CRA-E, 2021Invited Speaker, Artificial Intelligence (AI) Bootcamp, Data Science Nigeria, 2021Co-Chair, Doctoral Consortium, AAMAS 2021Co-Chair, Scholarships, AAMAS 2021Invited Speaker, 3rd Workshop on Data Science for Social Good (SoGood 2018), ECML-PKDD 2018 Teaching:Spring 2016: CSCI-1311 Introduction to Programming Logic (at Trinity University)Fall 2016: CSCI-1311 Introduction to Programming Logic (at Trinity University)Fall 2018: CSCE 990 Networks, Crowds, and MarketsSpring 2019: CSCE 496/896 Computational Game Theory and Its ApplicationsFall 2019: CSCE 310H Honors Data Structures and AlgorithmsSpring 2020: CSCE 496/896 Computational Game Theory and Its ApplicationsFall 2020: CSCE 310H Honors Data Structures and AlgorithmsSpring 2021: CSCE 496/896 Computational Game Theory and Its ApplicationsSpring 2022: CSCE 990 AI for Social GoodSpring 2022: CSCE 492/892 Computational Game Theory and Its ApplicationsSpring 2023: CSCE 492/892 Computational Game Theory and Its ApplicationsFall 2023: CSCE 310H Honors Data Structures and AlgorithmsFall 2024: CSCE 310/310H Data Structures and Algorithms (on Canvas)Spring 2025: CSCE 492/892 Computational Game Theory and Its ApplicationsFall 2025: CSCE 310/310H Data Structures and Algorithms (on Canvas)Spring 2026: CSCE 492/892 Computational Game Theory and Its ApplicationsLearning/Tutorial:AAMAS 2019: Tutorial on Solving Games with Complex Strategy Spaces (with A. Jiang and F. Fang)IJCAI 2019: Tutorial on Solving Games with Complex Strategy Spaces (with F. Fang)AAMAS 2020: Tutorial on Computational Game Theory and Its Applications (with A. Sinha and M. Irfan)IJCAI 2020: Tutorial on Computational Game Theory and Its Applications (with A. Sinha and M. Irfan)Summer School on Game Theory and Social Choice 2021: Tutorial on Computational Game Theory and Its Applications (organized by the Department of Computer Science, City University of Hong Kong)IJCAI 2021: Tutorial on Mechanism Design without Money (with H. Aziz, H. Hosseini, and C. Wang)AAMAS 2022: Tutorial on Mechanism Design without Money (with H. Aziz, H. Hosseini, and C. Wang)IJCAI 2022: Tutorial on Mechanism Design without Money (with H. Aziz, H. Hosseini, and C. Wang)AAMAS 2023: Tutorial on Mechanism Design without Money (with H. Aziz, H. Hosseini, and M. Li)Invited Speaker, Summer School on Algorithmic Game Theory, Department of Computer Science, City University of Hong Kong, 2023IJCAI 2024: Tutorial on Mechanism Design without Money: Facility Location Problems (with M. Li) Publications:2025Double Oracle Neural Architecture Search for Game Theoretic Deep Learning ModelsA. Aung, X. Wang, R. Wang, H. Chan, B. An, X. Li, and J. SenthilnathIEEE Transactions on Image Processing[Link]Strategyproof Mechanisms for Facility Location with Prediction Under the Maximum Cost Objective H. Chan, J. Lin, and C. Wang28th European Conference on Artificial Intelligence (ECAI 2025)[Link]Mechanism Design for Facility Location Problems with Capacity Constraints in Bounded Location SpaceX. Sha, H. Chan, V. Chau, F. C. K. Ken, M. Li, and W. L. Lo 28th European Conference on Artificial Intelligence (ECAI 2025)[Link]Pure and Strong Nash Equilibrium Computation in Compactly Representable Aggregate GamesJ. Soundy, M. Irfan, and H. Chan41st Conference on Uncertainty in Artificial Intelligence (UAI 2025)[Link]Distance Preservation GamesH. Aziz, H. Chan, P. Lederer, S. Narang, and T. Walsh34th International Joint Conference on Artificial Intelligence (IJCAI 2025)[Link]Group Fairness in Multi-period Mobile Facility Location ProblemsH. Aziz, H. Chan, X. Sha, T. Walsh, and L. Xia24th International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2025) [Extended Abstract][Link]MuHBoost: Multi-Label Boosting For Practical Longitudinal Human Behavior ModelingN. Thach, P. Habecker, A. R Eisenbraun, A. Mason, K. Tyler, B. Khan, and H. Chan13th International Conference on Learning Representations (ICLR 2025)[Link]Non-stochastic Budgeted Online Pricing with Semi-Bandit FeedbackX. Liu, H. Chan, M. Li, W. Wu, and L. Tran-Thanh 39th AAAI Conference on Artificial Intelligence (AAAI 2025)[Link]Mechanism Design for Connecting Regions Under DisruptionsH. Chan, J. Lin, Z. Qin, and C. Wang39th AAAI Conference on Artificial Intelligence (AAAI 2025)[Link]Facility Location Games with Optional Preferences: A RevisitX. Sha, S. Bao, H. Chan, V. Chau, C. K. K. Fong, and M. Li39th AAAI Conference on Artificial Intelligence (AAAI 2025)[Link]CARE: Compatibility-Aware Incentive Mechanisms for Federated Learning with Budgeted RequestersX. Liu, H. Chan, M. Li, X. Zeng, C. Fu, and W. Wu2025 IEEE International Conference on Computer Communications (INFOCOM 2025)[Link]2024Analyzing and Predicting Short-Term Substance Use Behaviors of Persons Who Use Drugs in the Great Plains of the U.S.N. Thach, P. Habecker, B. A. Johnston, L. Cervantes, A. R Eisenbraun, A. Mason, K. A. Tyler, B. Khan, and H. ChanPLOS One[Link]Group Fairness in Multi-period Mobile Facility Location Pro",
  "content_length": 24222,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:09"
}