{
  "name": "Haym Hirsh",
  "homepage": "https://www.cs.cornell.edu/~hirsh",
  "status": "success",
  "content": "Home Page for Haym Hirsh Haym Hirsh Born on what is now L. Ron Hubbard Way, three miles from the Hollywood Sign, Haym Hirsh spent the first quarter-century of his life in California, receiving his BS degree in 1983 from the Mathematics and Computer Science departments at UCLA and his MS in 1985 and PhD in 1989 from the Computer Science Department at Stanford University. Unhappy with the weather, he moved to Pittsburgh when he found a way to spend his final year at Stanford at Carnegie Mellon University and the University of Pittsburgh. The following year he achieved his life-long dream of living in New Jersey by joining the faculty of the Computer Science Department at Rutgers University. As part of his never-ending spiritual quest, he has also spent time as visiting faculty at Carnegie Mellon University (in their School of Computer Science), MIT (in various combinations of the Artificial Intelligence Laboratory, Laboratory for Computer Science, the Sloan School of Management, and the Center for Collective Intelligence), and NYU (in the Information Systems Department at the Stern School of Business). From 2003 to 2006 (and, again, from 2012 to 2013) he served as Chair of the Rutgers University Computer Science Department, and from 2006 to 2010 he served as Director of the Division of Information and Intelligent Systems at the National Science Foundation. However, still unsatisfied with the weather and seeking to reach new levels of self-actualization, he subsequently moved to Cornell University to serve as Dean of Computing and Information Science. More recently, he returned to his secular life as a Professor in the Department of Computer Science at Cornell, where he is also a member of the graduate fields of Information Science and Cognitive Science. In 2022 he was elected a fellow of the American Association for the Advancement of Science. When he is not teaching courses, conducting research, or designing mechanical puzzles he writes silly biographies with lots of gratuitous pointers to other web pages. (You can also see a more stodgy short bio or a long-winded formal CV.) Quick Links: Prospective Students, Postdocs, and Interns: If you are not a current or incoming student at Cornell please be aware that am not taking on student or intern supervision responsibilities at this time. More general information that might be of value: Graduate admissions are handled by a central committee that makes decisions for the entire department. Individual faculty do not accept students directly into their research groups. You can find out more at the relevant websites: Cornell Computer Science PhD admissions Cornell Computer Science M.Eng. admissions Cornell Information Science PhD admissions Cornell Information Science MPS admissions Teaching: Fall 2024: CS3700 / CS5700: Foundations of AI Reasoning and Decision Making Cornell's Master of Engineering in Computer Science at Ithaca: I am the faculty director of the Cornell Computer Science Master of Engineering at the main (Ithaca) Campus. If you have questions about the program or the status of an application please email meng@cs.cornell.edu. That will get you an email far more quickly and from the person best able to answer your questions. Research: For most of my career my research focused on foundations and applications of machine learning, data mining, information retrieval, and artificial intelligence, especially targeting questions that integrally involve both people and computing. However, in recent years these interests have turned to complementary questions in crowdsourcing, human computation, and social computing. Google Scholar Page for Haym Hirsh Teaching: At the undergraduate and master's level I most commonly teach a senior-level introductory course in Artificial Intelligence, \"Foundations of Artificial Intelligence\", and its associated \"Practicum in Artificial Intelligence\". At the graduate level I typically teach \"Crowdsourcing and Human Computation\", a version of which I first taught in 2013, making it one of the first courses ever taught on this topic (and it may now be the largest, often constrained by classroom capacity, peaking at 120 students in one recent offering). Service: Although I first became a professor because I thought a career doing research and teaching would be very cool, at some point I resigned myself to the fact that I seem to be appreciated in various service roles as well. Some examples: Professional: In 1994 I served as co-chair (with William Cohen) of the International Conference on Machine Learning (ICML), colocating it for the first time with the Conference on Computational Learning Theory (COLT) (a practice that continues on and off to this day). At various times I have also been an elected Councilor of the Association for the Advancement of Artificial Intelligence (AAAI), an action editor of both the Journal of Machine Learning Research and Machine Learning Journal, and Director of the Division of Information and Intelligent Systems at the U.S. National Science Foundation (and helped start such programs as Social Computational Systems and Cyberlearning: Transforming Education). Academic: I spent much of my career at Rutgers University, where at various times I served as Chair of the Department of Computer Science (twice), Chair of the New Brunswick Faculty Council, and member of the Executive Committees of both the Rutgers Center for Cognitive Science and the Center for Discrete Mathematics and Theoretical Computer Science (DIMACS). Later at Cornell I served as Dean of the Faculty of Computing and Information Science, and am now serving as faculty director of the CS Master of Engineering, and member of the advisory committees for Cornell's Cognitive Science program and the Cornell Center for Data Science for Enterprise and Society, as well as serving on the University's Research Advisory Commmittee. Academc Genealogy Academic Ancestors Graduated Students (16 PhD Advisees, 62 Descendants) Other Random Links of Relevance In 2018 I was one of 51 amicus curiae involved in a brief for the U.S. Supreme Court case United States of America v Microsoft Corporation. We basically explain the idea of cloud computing, and specifically that while the \"cloud\" makes it look like your email is sitting wherever you are, the data actually sit on computers in specific physical locations typically not where you are. In my spare time I design mechanical puzzles. Photos of some examples follow. You can also find some of my puzzles that are currently commerically available. (I only design puzzles, I don't produce or sell them. I feel lucky to have the amazing Tompkins County Public Library Makerspace, where I create prototypes of many of my puzzle designs, and pre-pandemic I furthermore could rely on Cornell's mannUfactory Makerspace, which sadly has yet to reopen - both are examples of libraries stepping in to do amazing jobs supporting the maker movement.) I also have an extensive collection of, mechanical puzzles, including many Karakuri puzzle boxes. I hold two obscure geometry records: I found the smallest circle that can contain 19 identical equilateral triangles without overlap, improving on Maurizio Morandi's 2008 record by about 1.3%. I found the smallest pentagon that can contain 9 identical squares without overlap, improving on David Cantrell's 2012 record by about 1.4%. I am suspicious that there is room for further improvement - the middle squares of the left and right vertical-ish three-square towers can jiggle left/right a little bit. The Wit and Wisdom of Haym Hirsh. Amazon's CAPTCHA's commentary on the Mechanical Turk usage agreement 1984: The oldest presence I could find of myself on the Internet. (Since it's not clear from the link, it is from the (Rubik's) Cube Lover's email list.) (The question asked there, in 1984, wasn't actually resolved until 2010 by Tom Rokicki and colleagues: God's number is 20.) Erdös number ≤3: Between 1998 and 2000 I coauthored some papers with my then-student Gary Weiss. Gary subsequently joined the Fordham faculty and between 2007 and 2009 he coauthored some papers with his colleague Frank Hsu. In 1992 when Frank Hsu was in the MIT Math Department he coauthored a paper with Paul Erdös Bacon number ≤3: (This is admittedly a stretch.) I was on a panel at MIT with Peter Norvig in 2011 (and the video is still available). Peter was in \"The Singularity\" with Leon Panetta in 2012. Leon Panetta appeared in \"The President's Gatekeepers\" in 2013, which Kevin Bacon narrated. If you follow the sequence of dates I'm clearly the cause of this chain. A version of this HTML page - hand-edited in GNU Emacs - has been on the Internet since 1994. No animals were harmed in the creation of this web page.",
  "content_length": 8757,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:13"
}