{
  "name": "Hazim Kemal Ekenel",
  "homepage": "http://web.itu.edu.tr/ekenel",
  "status": "success",
  "content": "Prof. Dr. Hazım Kemal EKENEL - Home Prof. Dr. Hazım Kemal EKENEL Home Bio Projects Publications Professional Activites Teaching Students Prospective Students Contact:Istanbul Technical UniversityDepartment of Computer EngineeringOffice: 2218 / Phone: +90 212 285 746034469 Maslak, Istanbul / TurkeyE-mail: ekenel@itu.edu.tr Dr. Hazım Kemal Ekenel is a Professor at ITU Department of Computer Engineering, where he directs the Smart Interaction and Machine Intelligence Technologies (SiMiT) Lab. His aim is to leverage computer vision, machine learning, and deep learning techniques in order to build interactive and intelligent systems that ease people's lives and enhance their social interactions. He also focuses on assistive technologies for people with disabilities and healthcare applications.He has over twenty years of experience in computer vision and machine learning with a focus on face analysis and human perception. He has published more than 100 peer reviewed publications in prestigious international journals, conferences, and workshops in the related fields, which have received over 4000 citations. His h-index is 35.His research has been funded through several funding bodies -the European Commission under the framework programmes, Scientific and Technological Research Council of Turkey (TUBITAK), German Research Foundation (DFG), German Federal Ministry of Education and Research (BMBF), German Academic Exchange Service (DAAD), French National Research Agency (ANR), French Agency for Innovation (OSEO), British Council- as well as by the industry.Dr. Ekenel strongly believes in international cooperation. Besides his extensive research collaborations in Europe, he also has connections in the USA and Asia. He had a short stay in Pittsburgh, where he conducted joint research with his colleagues from Carnegie Mellon University (CMU) and published together. He also co-supervised a MS thesis with his colleagues from CMU and General Motors. In addition, he had research connections with the interACT partners Hong Kong University of Science and Technology (HKUST) and Waseda University in the domain of face processing, which has led to several joint publications.His research achievements have been recognized by several national and international foundations. He has received IEEE Research Award in 2019, Parlar Foundation Research Award and Outstanding Young Scientist (BAGEP) Award from the Science Academy, Turkey in 2018. He is a recipient of the Young Scientist of the Year Award 2016 from Bilim Kahramanları Derneği. In 2008, he has received the EBF European Biometric Research Award for his contributions to the field of face recognition during his doctoral studies and, with his team, the Best Demo Award at the IEEE International Conference on Automatic Face and Gesture Recognition. NEWSNovember 2021 - Our work, \"MOCCA: Multi-Layer One-Class ClassificAtion for Anomaly Detection\", is accepted for publication @ IEEE Transactions on Neural Networks and Learning Systems.November 2021 - Our work, \"Fight detection from still images in the wild\", is accepted @ IEEE Winter Conference on Applications of Computer Vision Workshops, 2022.November 2021 - We are organising the Intl. Workshop on Face and Gesture Analysis for COVID-19  (FG4COVID19) @ FG 2021.September 2021 - Our work, \"On Recognizing Occluded Faces in the Wild\", is presented @ BIOSIG 2021.September 2021 - Our work, \"Shuffled Patch-Wise Supervision for Presentation Attack Detection\", is presented @ BIOSIG 2021.September 2021 - Our work on gait recognition received the best paper award @ UBMK 2021. July 2021 - We organised the MULTI-modal Imaging of FOREnsic Science Evidence  tools for Forensic Science (MULTIFORESEE) Conference 2021.July 2021 - The recording of my seminar 'Human Centered Computer Vision' @ GoodBrother COST Action is availabe online. July 2021 - We ranked first @ MFR 2021: Masked Face Recognition Competition among the participating academic institutionsMarch 2021 - Our work, \"Multimodal Soft Biometrics: Combining Ear and Face Biometrics for Age and Gender Classification\", is published @ Multimedia Tools and Applications, 2021. Create a free web site with Weebly",
  "content_length": 4191,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:17"
}