{
  "name": "He Zhu 0001",
  "homepage": "http://herowanzhu.github.io",
  "status": "success",
  "content": "He Zhu He Zhu Assistant Professor Computer Science Department Rutgers University, New Brunswick Email: hz375@cs.rutgers.edu [Research Statement] [Awards] [Service] [Teaching] [Publications] I am looking for motivated PhD students! Please drop me an email with your CV if you are interested. I am an assistant professor in the Department of Computer Science at Rutgers University-New Brunswick. My research focuses on neurosymbolic programming, which lies at the intersection of automated programming and deep learning and spans over programming languages, formal methods, and machine learning. I investigate program synthesis and formal program reasoning techniques to make machine learning systems more reliable and trustworthy. The long-term research goal is to build intelligent and interpretable AI systems that allow the tight integration of deep learning and symbolic reasoning and that can be certified robust and reliable. I obtained my Ph.D. from Purdue CS, advised by Suresh Jagannathan. Research Summary An overview of my work in the past 5 years. [Research Statement] Publications Imitation Learning with Temporal Logic Constraints [pdf] Zining Fan and He Zhu. Neural Information Processing Systems (NeurIPS), 2025 Learning from Demonstrations via Capability-Aware Goal Sampling [pdf] Yuanlin Duan, Yuning Wang, Wenjie Qiu and He Zhu. Neural Information Processing Systems (NeurIPS), 2025 Abstraction Refinement-guided Program Synthesis for Robot Learning from Demonstrations [pdf] Guofeng Cui, Yuning Wang, Wensen Mao, Yuanlin Duan and He Zhu. The OOPSLA issue of the Proceedings of the ACM on Programming Languages, OOPSLA 2025 Deductive Synthesis of Reinforcement Learning Agents for Infinite-Horizon Tasks [pdf] Yuning Wang and He Zhu. Proceedings of the 37th International Conference on Computer Aided Verification (CAV), 2025 Exploring the Edges of Latent State Clusters for Goal-Conditioned Reinforcement Learning [pdf] Yuanlin Duan, Guofeng Cui and He Zhu. Neural Information Processing Systems (NeurIPS), 2024 Learning World Models for Unconstrained Goal Navigation [pdf] Yuanlin Duan, Wensen Mao and He Zhu. Neural Information Processing Systems (NeurIPS), 2024 Safe Exploration in Reinforcement Learning by Reachability Analysis over Learned Models [pdf] Yuning Wang and He Zhu. Proceedings of the 36th International Conference on Computer Aided Verification (CAV), 2024 Reward-guided Synthesis of Intelligent Agents with Control Structures [pdf] Guofeng Cui, Yuning Wang, Wenjie Qiu and He Zhu. Proceedings of the 45th ACM SIGPLAN conference on Programming Language Design and Implementation (PLDI), 2024 Instructing Goal-Conditioned Reinforcement Learning Agents with Temporal Logic Objectives [pdf] Wenjie Qiu, Wensen Mao and He Zhu. Neural Information Processing Systems (NeurIPS), 2023 Verification-guided Programmatic Controller Synthesis [pdf] Yuning Wang and He Zhu. 29th International Conference on Tools and Algorithms for the Construction and Analysis of Systems (TACAS), 2023 ReLAX: Reinforcement Learning Agent Explainer for Arbitrary Predictive Models [pdf] Ziheng Chen, Fabrizio Silvestri, Jia Wang, He Zhu, Hongshik Ahn and Gabriele Tolomei. Proceedings of the 31st ACM International Conference on Information and Knowledge Management (CIKM), 2022 Learn Basic Skills and Reuse: Modularized Adaptive Neural Architecture Search (MANAS) [pdf] Hanxiong Chen, Yunqi Li, Jia Wang, He Zhu and Yongfeng Zhang. Proceedings of the 31st ACM International Conference on Information and Knowledge Management (CIKM), 2022 Defending Observation Attacks in Deep Reinforcement Learning via Detection and Denoising [pdf] Zikang Xiong, Joe Eappen, He Zhu and Suresh Jagannathan. European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML PKDD), 2022 Graph Collaborative Reasoning [pdf] Hanxiong Chen, Yunqi Li, Shaoyun Shi, Shuchang Liu, He Zhu and Yongfeng Zhang. Proceedings of the 15th ACM International Conference on Web Search and Data Mining (WSDM), 2022. Programmatic Reinforcement Learning without Oracles [pdf] Spotlight Wenjie Qiu and He Zhu. International Conference on Learning Representations (ICLR), 2022 Differentiable Synthesis of Program Architectures [pdf] Guofeng Cui and He Zhu. Neural Information Processing Systems (NeurIPS), 2021 ART: Abstraction Refinement-Guided Training for Provably Correct Neural Networks [pdf] Xuankang Lin, He Zhu, Roopsha Samanta and Suresh Jagannathan. Formal Methods in Computer-Aided Design (FMCAD), 2020 An Inductive Synthesis Framework for Verifiable Reinforcement Learning [pdf][code] ACM SIGPLAN distinguished paper award He Zhu, Zikang Xiong, Stephen Magill and Suresh Jagannathan Proceedings of the 40th ACM SIGPLAN conference on Programming Language Design and Implementation (PLDI), 2019 A Data-Driven CHC Solver [pdf][code] ACM SIGPLAN distinguished paper award He Zhu, Stephen Magill and Suresh Jagannathan Proceedings of the 39th ACM SIGPLAN conference on Programming Language Design and Implementation (PLDI), 2018 Automatically Learning Shape Specifications [pdf][code] He Zhu, Gustavo Petri and Suresh Jagannathan Proceedings of the 37th ACM SIGPLAN conference on Programming Language Design and Implementation (PLDI), 2016 Learning Refinement Types [pdf][code] He Zhu, Aditya V. Nori and Suresh Jagannathan Proceedings of the 20th ACM SIGPLAN International Conference on Functional Programming (ICFP), 2015 Poling: SMT Aided Linearizability Proofs [pdf] He Zhu, Gustavo Petri and Suresh Jagannathan Proceedings of the 27th International Conference on Computer Aided Verification (CAV), 2015 Dependent Array Type Inference from Tests [pdf] He Zhu, Aditya V. Nori and Suresh Jagannathan Proceedings of the 16th International Conference on Verification, Model Checking, and Abstract Interpretation (VMCAI), 2015 Compositional and Lightweight Dependent Type Inference for ML [pdf] He Zhu and Suresh Jagannathan Proceedings of the 14th International Conference on Verification, Model Checking, and Abstract Interpretation (VMCAI), 2013 Students Current Yuning Wang, Bridging Logic and Learning Wensen Mao, From Instruction to Action Zining Fan, From Temporal Logic to Intelligent Behavior Yuanlin Duan, Reasoning Through Exploration Former (last known position) Guofeng Cui, Toward Efficient Program Synthesis for Intelligent Systems, 2025 (Amazon) Wenjie Qiu, From Reasoning to Acting: A Program Synthesis Approach to Reinforcement Learning, 2025 (vivo) Acknowledgement My research is supported by: NSF Grant (2025): Abstraction Refinement-guided Program Synthesis for Verifiable Robot Learning NSF Grant (2021): Synthesis and Verification for Programmatic Reinforcement Learning NSF Grant (2020): Formal Symbolic Reasoning of Deep Reinforcement Learning Systems DARPA Grant (2020): Symbiotic Design for Cyber Physical Systems Teaching CS 314. Principles of Programming Languages [F25] [S25] [F23] [S22] [S21] [S20] CS 515. Programming Languages and Compilers I [F24] [F22] [F21] [F20] [F19] CS 515. Programming Languages and Compilers II [S24] Service Area Chair: ICML 2025, NeurIPS (2025, 2024) AEC Chair: CAV 2020 Program Committee: CAV (2025, 2020), PLDI (2023, 2021), OOPSLA 2022, HCVS (2021, 2019) NSF Panelist 2025, 2024, 2023, 2022, 2020 Reviewer: ICLR (2025, 2024), ICML (2024, 2022), NeurIPS 2023, FMSD (2022), TSE (2021,2020,2019) Awards ACM SIGPLAN PLDI 2019 Distinguished Paper Award. ACM SIGPLAN PLDI 2018 Distinguished Paper Award. Maurice H. Halstead Memorial Award (Purdue University).",
  "content_length": 7535,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:14"
}