{
  "name": "Heather Zheng",
  "homepage": "https://people.cs.uchicago.edu/~htzheng",
  "status": "success",
  "content": "Heather Zheng, University of Chicago Heather Zheng CV Publications Professional Activities SAND Lab Prospective Students Photography by MicheleMariePhotography.com Teaching Winter 2026: CS35800: Adversarial Machine Learning (G) Spring 2026: CS25800 Adversarial Machine Learning (UG) Contact info Lab: Crerar 377 Office: Crerar 371 University of Chicago Chicago, IL 60637-1588 htzheng at cs dot uchicago dot edu [linkedin][Google Scholar] I am the Neubauer Professor of Computer Science at University of Chicago. I received my PhD in Electrical and Computer Engineering from University of Maryland, College Park in 1999. Prior to joining University of Chicago in 2017, I spent 6 years in industry labs (Bell-Labs, NJ and Microsoft Research Asia), and 12 years at University of California at Santa Barbara. At UChicago, I co-direct the SAND Lab (Security, Algorithms, Networking and Data) together with Prof. Ben Y. Zhao. I was selected as one of the MIT Technology Review's TR 35 (2005) for my work on Cognitive Radios; my work was featured by MIT Technology Review as one of the 10 Emerging Technologies (2006). I am a fellow of the World Technology Network, an IEEE Fellow (class'15) and an ACM Fellow (Class'22). I also received the ECE Distinguished Alumni Award from University of Maryland, College Park in 2021. My recent work on protecting human creatives from unethical data exploration received the USENIX Internet Defense Prize (2023), the Chicago Innovation Award (2023), a special mention in TIME Magazineâs Best Inventions (2023), and the Community Impact Award from the Concept Art Association (2024). I am a board member of the University of Chicago Laboratory School. I recently gave a TEDxChicago 2025 talk on protecting human creativity and identity (video available now). Ben and I discussed our work in this Big Brains Podcast episode (2024). I am extremely fortunate to have had the opportunity to work with and continue to work alongside a talented group of students. I am always looking for talented and self-motivated graduate students on applied machine learning, and security and privacy. Prospective students should email me your resume with a subject line of \"UChicago PhD Applicant.\" I am also looking for UChicago undergraduates in these areas (email me your resume with a subject line of \"UChicago UG Research.\") My Research Over my 20+ years in research labs and academia, my research has evolved and adapted to target important high impact research problems that match my interests and research background. I subscribe to the practice of focusing on innovative ideas and maximizing impact over incrementalism. In the past, this has covered significant ground in wireless networking, mobile systems, network measurements and security. Most recently, I am focusing my attention on three broad areas: Copyright protection and fake content detection wrt generative AI systems; some recent works include Glaze, NightShade, ModelImplosion, and GenAIdetector; Security & privacy of deep learning systems (how can we design and train deep neural networks to improve security for computer systems while remaining robust against a wide range of powerful adversarial attacks); some recent works include Blacklight for black-box query attack detection, and forensic tools to protect ML models post-deployment (PoisonForensics, Post-Breach-Recovery, ModelVersioning); Mobile/IoT/VR sensing and its implications on security and privacy (what does the increasing ubiquity of sensors for RF, video, and audio mean for personal privacy and security); check out bracelet-of-silence, EMS-based-authentication, WiFi-reconnaissance, Fawkes, single-camera-keystroke-inferece-attack, VR-keystroke-inference-attack. Press/Media: A collection of recent news and media coverage of our SAND Lab's research is here. Professional Activities TPC co-Chair: MobiCom 2015,DySPAN 2011, SDR 2009 Recent TPCs: CCS, S&P, Usenix Security Copyright © SAND Lab, UChicago · css design: Luka Cvrk.",
  "content_length": 3989,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:17"
}