{
  "name": "Hector Muñoz-Avila",
  "homepage": "http://www.cse.lehigh.edu/~munoz",
  "status": "success",
  "content": "Héctor Muñoz-Avila's Homepage COLLEGE HOME | LEHIGH HOME | SEARCH • Home • Research • Courses • Publications • Talks • Service • Other interests • Downloads Héctor Muñoz-Avila Professor Computer Science & Engineering Lehigh University Building C, Room 233 113 Research Drive Mountaintop Campus Bethlehem, PA  18015  USA Phone: 610 758 3797 Fax: (610) 758-4096 Email: hem4ATlehighDOTedu Office: Building C, Room 233 Hours: by appointment Dr. Muñoz-Avila is a professor of Computer Science and Engineering and of Cognitive Science at Lehigh University. He is director of the Institute for Data, Intelligent Systems, and Computation (I-DISC). Dr. Muñoz-Avila is recipient of a National Science Foundation (NSF) CAREER, of a SIGMOD contributions award and held a Lehigh Class of 1961 Professorship. He has been chair for various international scientific meetings including the Sixth International Conference on Case-Based Reasoning (ICCBR-05) and the twenty-fifth Innovative Applications of AI Conference (IAAI-13). Dr. Muñoz-Avila served at the National Science Foundation in a variety of roles including: as a program director for Robust Intelligence, as a program director and cluster lead for Information Integration and Informatics and as program director and theme lead for the Strengthening AI, theme 3 and for the AI for decision Making, theme 4, of the AI Institutes program. He is/has been funded by the Office of Naval Research (ONR), the National Science Foundation (NSF), the Defense Advanced Research Projects Agency (DARPA), the Naval Research Laboratory (NRL) and the Air Force Research Laboratory (AFRL). He holds a PhD (Dr. rer. nat.) in computer science from the Universität Kaiserslautern (Germany), an MS in computer science, a BS in Mathematics and a BS in computer Science from the Universidad de los Andes (Colombia). © 2003 P.C. Rossin College of Engineering & Applied Science Computer Science & Engineering, Packard Laboratory, Lehigh University, Bethlehem PA 18015",
  "content_length": 1987,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:19"
}