{
  "name": "Heechul Yun",
  "homepage": "http://www.ittc.ku.edu/~heechul",
  "status": "success",
  "content": "Heechul Yun Heechul Yun (윤희철) office1 (ITTC): 134 Nichols Hall, 2335 Irving hill Rd, Lawrence, KS, 66045 office2 (Eaton): 3040 Eaton Hall, 1520 West 15th St, Lawrence, KS, 66045 e-mail: heechul.yun (at) ku.edu tel: 785-864-7735 Home | Publications | Courses | Projects | People | Software About I am a Deane E. Ackers Scholar and Professor in the department of Electrical Engineering and Computer Science at the University of Kansas. I earned my Ph.D. in Computer Science from the University of Illinois at Urbana-Champaign in 2013. Prior to the PhD, I worked for Samsung Electronics and ETRI. I enjoy reading and running. [CV] [Bio] Research My research goal is to build safe and secure real-time computing system infrastructure (OS, architecture, and middleware) for intelligent cyber-physical systems. Please check the overview of my recent research. Also, check the Projects tab for more details of my current/past research projects. According to CSRankings, which uses a publication quality based metric, KU is ranked 14th in the US in the embedded & real-time systems area due to my publications. I am looking for motivated students who are interested in embedded systems research. Experiences in AI, OS, architecture, and robotics are a plus. Currently available positions include (but not limited to): PhD/MS in real-time edge AI (see this ) PhD/MS in microarchitectural attcks and defenses (see this and this ) PhD/MS in time predictable high-performance heterogeneous computing platforms. (see this ) Undergraduate research assistant (URA) in autonomous car, UAV testbeds (see this) Feel free to email me if you are interested in any of the related areas. [Google Scholar] [DBLP] [GitHub] Honors/Awards Outstanding Paper Award, IEEE RTCSA, 2025 Bellows Faculty Scholar Award, School of Engineering, University of Kansas, 2023 Miller Research Award, School of Engineering, University of Kansas, 2022 Best Paper Award, IEEE RTSS, 2020 Miller Scholar Award, School of Engineering, University of Kansas, 2019 Outstanding Paper Award, IEEE RTAS, 2019 Best Paper Award & Outstanding Paper Award, IEEE RTAS, 2016 Editor's Pick of the Year & Feature Article of the Month, IEEE Transactions on Computers, 2016 Nomination for Best Student Paper, IEEE RTCSA, 2016 Nomination for Best Paper, ECRTS, 2010 News Nov. 2025. I have been invited to serve on the program committee of ECRTS'26. Jul. 2025. I have been invited to serve on the program committee of IEEE RTAS'26 Jul. 2025. Our paper, \"MURAL: A Multi-Resolution Anytime Framework for LiDAR Object Detection Deep Neural Networks,\" has been selected as an Outstanding Paper of IEEE RTCSA'25. Mar. 2025. I have been invited to serve on the program committee of IEEE RTSS'25 Dec. 2024. I have been invited to serve on the program committee of DSD'25 Nov. 2024. I have been invited to serve on the program committee of ECRTS'25. Sep. 2024. I have been invited to serve on the program committee of IEEE RTAS'25 Jul. 2024. Our paper, \"Per-Bank Bandwidth Regulation of Shared Last-Level Cache for Real-Time Systems,\" is accepted for publication at IEEE RTSS'24. Jul. 2024. Our project \"Collaborative Research: SHF: III: Medium: Effortless Data Locality Through Near-memory On-the-fly Data Transformation\" is awarded funding from NSF. Thanks for the support! Jul. 2024. Our paper, \"VALO: A Versatile Anytime Framework for LiDAR based Object Detection Deep Neural Network,\" is accepted for publication at ACM/IEEE EMSOFT'24. Jun. 2024. Our paper, \"TinyLidarNet: 2D Lidar-based End-to-End Deep Learning Model for F1TENTH Autonomous Racing,\" is accepted to appear at IEEE/RSJ IROS'24 Mar. 2024. Our paper, \"Analysis and Mitigation of Shared Resource Contention on Heterogeneous Multicore: An Industrial Case Study,\" is accepted for publication at IEEE Transactions on Computers Feb. 2024. I have been invited to serve on the program committee of IEEE RTSS'24. Jan. 2024. I have been invited to serve as a TPC Co-Chair of IEEE RTCSA'24. Please consider submitting papers to RTCSA. May. 2023. Our paper \"BandWatch: A System-Wide Memory Bandwidth Regulation System for Heterogeneous Multicore\" is accepted for publication at IEEE RTCSA'23 May. 2023. My students Mohammed and QiTao received the 3rd place award in the 12th F1Tenth autonomous grand prix competition at the CPSIoTWeek, 2023 May. 2023. I am honored to receive Bellows Faculty Scholar Award from the School of Engineering at KU. Mar. 2023. I have been invited to serve on the program committee of IEEE RTSS'23. Jan. 2023. Our paper \"Cache Bank-Aware Denial-of-Service Attacks on Multicore ARM Processors\" is accepted to appear at IEEE RTAS'23. Nov. 2022. I have been invited to serve on the program committee of ECRTS'23. Jul. 2022. I have been invited to serve as general chair of IEEE RTAS'23. Jun. 2022. Two papers (Anytime-Lidar and DeepPicarMicro) are accepted to appear at IEEE RTCSA'22. May. 2022. I am honored to receive Miller Research Award from the School of Engineering at KU. Apr. 2022. Our paper \"Denial-of-Service Attacks on Shared Resources in Intel’s Integrated CPU-GPU Platforms\" is accepted for publication at IEEE ISORC'22 Sep. 2021. Our paper \"Memory-Aware Denial-of-Service Attacks on Shared Cache in Multicore Real-Time Systems\" is accepted for publication at the journal of IEEE Transactions on Computers. Mar. 2021. I have been invited to serve as TPC Chair of IEEE RTAS'22. Jan. 2021. I have been invited to serve on the program committee of IEEE RTSS'21. Dec. 2020. I have been invited to serve on the program committee of ECRTS'21. Nov. 2020. Our paper \"Virtual Gang based Scheduling of Parallel Real-Time Tasks\" is accepted to appear at DATE'21. Oct. 2020. I have been invited to serve on the program committee of ACM/IEEE DAC'21. Aug. 2020. Our paper \"SpectreRewind: Leaking Secrets to Past Instructions\" is accepted to appear at ASHES'20. Aug. 2020. I have been invited to serve on the program committee of IEEE RTAS'21. Apr. 2020. I have been invited to serve on the program committee of IEEE RTSS'20. Apr. 2020. ACM SIGBED Blog is launched. Please consider submitting articles to the blog. Dec. 2019. I have been invited to serve on the program committee of ACM LCTES'20. Dec. 2019. Our paper \"BRU: Bandwidth Regulation Unit for Real-Time Multicore Processors\" is accepted to appear at IEEE RTAS'20. Oct. 2019. I am elevated to become an IEEE Senior member. Sep. 2019. I have been invited to serve on the program committee of ACM/IEEE DAC'20. Sep. 2019. In an article published by NVIDIA in their official developer blog site, our firesim-nvdla RISC-V SoC testbed was recommended for testing their NVDLA deep neural network accelerator. Jun. 2019. I am named as Miller Scholar by the School of Engineering at KU. May. 2019. I have been invited to serve on the program committee of IEEE RTSS'19. Apr. 2019. I am promoted to associate professor with tenure, starting Fall 2019. Mar. 2019. Our paper \"Denial-of-Service Attacks on Shared Cache in Multicore: Analysis and Prevention\" has been selected as an Outstanding Paper at IEEE RTAS'19. Mar. 2019. We have been awarded AWS Cloud Credits from Amazon. Thanks for the support! Feb. 2019. Our paper \"SpectreGuard: An Efficient Data-centric Defense Mechanism against Spectre Attacks\" is accepted to appear at ACM/IEEE DAC'19 Feb. 2019. Two papers are accepted to appear at IEEE RTAS'19. Denial-of-Service Attacks on Shared Cache in Multicore: Analysis and Prevention RT-Gang: Real-Time Gang Scheduling Framework for Safety-Critical Systems Jan. 2019. I have been invited to serve on the program committee of OSPERT'19. Jul. 2018. I have been invited to serve as PC track chair (Track 3: Hardware Architectures and Analysis Tools) of IEEE RTAS'19. Jul. 2018. Our project Real-Time Computing Infrastructure for Integrated CPU-GPU SoC Platforms is awarded funding from the National Science Foundation (NSF). Thanks for the support! Jun. 2018. Our paper, \"DeepPicar: A Low-cost Deep Neural Network-based Autonomous Car\" is accepted to appear at IEEE RTCSA'18 Apr. 2018. Our project \"Micro-Architectural Side-Channel Attack Resistant OS and Architecture\" is awarded funding from the National Security Agency (NSA) as part of the KU Security of Science Lablet. Thanks for the support! Mar. 2018. Two papers are accepted to appear at ECRTS'18. Deterministic Memory Abstraction and Supporting Multicore System Architecture Protecting Real-Time GPU Kernels on Integrated CPU-GPU SoC Platforms Feb. 2018. NVIDIA donated a Titan Xp GPU and a Jetson TX2 to us. Thanks for the support! Aug. 2017. I have been invited to serve on the program committee of IEEE RTAS'18. Jul. 2017. Our project The Deterministic Memory Approach for Predictable and High-Performance Cyber Physical Systems is awarded funding from the National Science Foundation (NSF). Thanks for the support! Apr. 2017. Prathap won Richard K. & Wilma S. Moore Thesis Award at KU for his master thesis. Congratulation! Mar. 2017. I have been invited to serve on the program committee of IEEE RTSS'17 Jan. 2017. I have been invited to serve on the program committee of IEEE RTCSA'17. Dec. 2016. I have been invited to serve on the program committee of ACM/IEEE EMSOFT'17 Dec. 2016. Our paper \"BWLOCK: A Dynamic Memory Access Control Framework for Soft Real-Time Applications on Multicore Platform,\" is accepted for publication at the journal of IEEE Transactions on Computers. Nov. 2016. Our paper \"Memory Bandwidth Management for Efficient Performance Isolation in Multi-Core Platforms,\" is selected as Editor's pick of the year 2016 of the IEEE Transactions on Computers. Aug. 2016. Our paper, \"A Simplex Architecture for Intelligent and Safe Unmanned Aerial Vehicles,\" is Nominated for Best Student Paper at IEEE RTCSA'16 Aug. 2016. I have been invited to serve on the program committee of IEEE RTAS'17. Jun. 2016. I gave a web seminar for Embedded Computing Community of Practice at Lockheed Martin, a corporation-wide virtual group of software engineers, on our recent",
  "content_length": 12905,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:19"
}