{
  "name": "Heena Rathore",
  "homepage": "https://drheenarathore.wordpress.com",
  "status": "success",
  "content": "Dr Heena Rathore Skip to content Hi folks! I am Assistant Professor in the Department of Computer Science at Texas State University. Academically, I have worked as Assistant Professor of Practice in Department of Computer Science at University of Texas at San Antonio (UTSA) and with Texas A&M University at Texarkana (TAMUT) as a Visiting Assistant Professor. I am currently chair of EMBS lone star section. For latest events please check our website. For couple of years, I worked as a Data Scientist and Program Manager at Hiller Measurements, Austin, USA. Prior to that, I was a post-doctorate researcher on US-Qatar Joint Collaborative Project on “Wireless Medical Device Security”. The project was a joint research between Temple University (USA), University of Idaho (USA) and Qatar University (Qatar). I also worked as a visiting researcher at Wichita State University, Kansas, USA. My research is broadly in the area of smart health, cognitive AI with complimentary areas of security. 2025 News! Editorial Board Member for Humanities & Social Sciences Communications. (2025-2028) Programme Advisory Board for the Certificate in Advanced Web Technologies Programme, Programme Advisory Board for the Certificate in Big Data Technologies programme, Namibia University of Science and Technology Our chapter IEEE EMBS Lone Star Section again won Best Professional Regional Award of entire North America. Heena Rathore, Lone Star EMBS Section AI and Healthcare Workshop,” in IEEE Pulse, vol. 16, no. 1, pp. 20-22, Jan.-Feb. 2025, doi: 10.1109/MPULS.2025.3526508. Panelist, Leadership San Antonio Association, 2025. Panelist, Data Center Community Information Session, 2025. Keynote Speaker, 5th International Conference on Advancements in Nano-Electronics Communication Technologies (ICANCT-2025), 2025. Bishal Thapa, Alden Duarte-Vasquez, Sahar Hooshmand, Heena Rathore, “Evaluation of Ethical Decision Making in Large Language Models Across Classical Moral Frameworks”, The 7th IEEE International Conference on Artificial Intelligence Testing, 2025. Jacob Silva, Henry Griffith, and Heena Rathore, “Assessing the Ethical Alignment of Large Language Models Using Deep Embedding Models”, The 7th IEEE International Conference on Artificial Intelligence Testing, 2025.  Shivangi Tripathi, Teancy Jennifer Rajesh, Henry Griffith, and Heena Rathore, “REVISE: A Structured Framework for Paragraph-Level Misinformation Correction in Large Language Models”, The 7th IEEE International Conference on Artificial Intelligence Testing, 2025. Rakesh Das, Henry Griffith, Heena Rathore, “SecureLLM: Leveraging Large Language Models for Fault Detection in Connected Vehicles”, 5th IEEE Intelligent Cybersecurity Conference, 2025. Rakesh Das, Henry Griffith, Heena Rathore, “LLM-Based Fault Detection in Connected Vehicle Time-Series Data”, 5th ACM Workshop on Secure and Trustworthy Cyber Physical Systems, 2025. Heena Rathore, and Henry Griffith, “Enhancing Cybersecurity Education Through Research-Based Role-Playing”, IEEE Integrated STEM Education Conference (ISEC), 2025. Heena Rathore, Pranay Jasti Chowdary, Henry Griffith, “Assessing Gender and Age Influences on Moral Decision-Making in Autonomous Vehicles Using Large Language Models”, CCNC Workshop, 2025. Chris Shaner, Henry Griffith, Heena Rathore, “Assessing Moral Decision-Making in Large Language Models”, IEEE ICCE, 2025. Gabriela Sanchez San Miguel, Henry Griffith, Jacob Silva, Heena Rathore, “Evaluating the Explainability of Large Language Models for Ethical Decision Making” IEEE ICCE, 2025. [Won Best Paper Session Award] Bishal Thapa, Micaela Rivas, Henry Griffith, Heena Rathore, “StressLLM: Large Language Models for Stress Prediction via Wearable Sensor Data”, IEEE ICCE, 2025. Mandil Pradhan, Brent Hoover, April Valdez, Henry Griffith, Heena Rathore, “Integrating Justice Theory into Moral Decision-Making for Autonomous Vehicles”, IEEE ICCE, 2025. [Won Best Paper Session Award] Mandil Pradhan, Brent Hoover, April Valdez, Henry Griffith, Heena Rathore, “Advancing Moral Decision-Making for Autonomous Vehicles”, IEEE CCNC, 2025. Akshit Singh, Heena Rathore, “Advancing Connected Vehicle Security through Real-time Sensor Anomaly Detection and Recovery”, Science Direct, Vehicular Communication, 2025. Session Chair, S1-3: CT01: Application-Specific CE for Smart Cities (SMC), ICCE 2025. Session Chair, Session 34 (Security, Privacy, and Content Protection), CCNC 2025. Program Committee, ACM Secure and Trustworthy Cyber-Physical Systems, 2025. NSF Reviewer and Panelist, 2025. Want to submit? Topic Editor, Secure Cyber Physical Systems: Machine Learning and Cryptography, 2025. Research interests: Cognitive Artificial Intelligence, Cyber physical systems, Security and Privacy, Distributed Systems, Large Language models, Biologically inspired systems. Background I was a Tata Consultancy Services (TCS) Research Scholar at Indian Institute of Technology (IIT), Jodhpur, India. My Ph.D. dissertation revolved around “Improving Security in Wireless Sensor Network through Bio-Inspired Approaches” in Computer Science and Engineering. My research area is interdisciplinary in nature which combines ideas from machine learning, psychology, biology and sensor networks. I have developed solutions for the detection and removal of fraudulent nodes in sensor networks based on ideas borrowed from the above-mentioned fields. I received my bachelor’s in Computer Science Engineering from College of Technology and Engineering in 2010 with Honors. Academically, I worked as Assistant Professor for computer science department with SS College of Engineering. Professionally, I have also worked as Design Executive with Phosphate India Private Limited, India. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Dr Heena Rathore Sign up Log in Copy shortlink Report this content Manage subscriptions Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 6006,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:20"
}