{
  "name": "Heidi Christensen",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/heidi-christensen",
  "status": "success",
  "content": "Professor Heidi Christensen | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Heidi Christensen PhD School of Computer Science Head of School Professor of Spoken Language Technology Member of the Speech and Hearing (SpandH) research group Open staff member portrait in a modal window heidi.christensen@sheffield.ac.uk +44 114 222 1950 Regent Court (DCS) Full contact details Professor Heidi Christensen School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0003-3028-5062 Google Scholar Personal website Profile Professor Christensen obtained her M.Sc. and a Ph.D. degrees from Aalborg University, Denmark, in 1996 and 2002, respectively. In 1998, she was a visiting researcher at IDIAP, Switzerland. From 2000, she worked as a research associate on numerous national and international projects in the Speech and Hearing group in Sheffield before taking up her lectureship in 2015. She was subsequently appointed a senior lecturer (2019) and chair (2022) in the department. She is the current Head of School and has a long-term interest in EDI (Equality, Diversity and Inclusion), serving as the Faculty Director of EDI (2020-2022).Her main research interests are in the areas of recognition of disordered speech, automatic processing of conversations, and the automatic detection and tracking of paralinguistic information such as emotions and general interactional behaviours. Research interests Her research interests are in the use of speech and language processing in the healthcare domain. She has considerable experience in the areas of recognition of disordered speech, automatic processing of conversations and the automatic detection and tracking of paralinguistic information such as emotions and general interactional behaviours. Her research has been supported by EU, UKRI, NIHR, Google and various charities like Rosetrees Trust and the Psychiatry Research Trust. She has considerable experience in leading highly interdisciplinary research projects including being the technical lead in the development of the CognoSpeak system for using AI to detect early signs of dementia. Publications Journal articles Yue Z, Loweimi E, Cvetkovic Z, Barker J & Christensen H (2026) Raw acoustic-articulatory multimodal dysarthric speech recognition. Computer Speech & Language, 95, 101839-101839. Alzahrani F, Maddock S & Christensen H (2025) Analysis of facial cues for cognitive decline detection using in-the-wild data. Applied Sciences, 15(11). View this article in WRRO Pahar M, Tao F, Mirheidari B, Pevy N, Bright R, Gadgil S, Sproson L, Braun D, Illingworth C, Blackburn D & Christensen H (2025) CognoSpeak: an automatic, remote assessment of early cognitive decline in real-world conversational speech. 2025 IEEE Symposium on Computational Intelligence in Health and Medicine (CIHM), 1-7. View this article in WRRO Tao F, Mirheidari B, Pahar M, Young S, Xiao Y, Elghazaly H, Peters F, Illingworth C, Braun D, O’Malley R , Bell S et al (2025) Early dementia detection using multiple spontaneous speech prompts: The PROCESS challenge. ICASSP 2025 - 2025 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 1-2. View this article in WRRO Pan Y, Mirheidari B, Blackburn D & Christensen H (2025) A two-step attention-based feature combination cross-attention system for speech-based dementia detection. IEEE Transactions on Audio, Speech and Language Processing, 33, 896-907. View this article in WRRO Pacheco-Lorenzo MR, Christensen H, Anido-Rifón LE, Fernández-Iglesias MJ & Valladares-Rodríguez SM (2024) Analysis of Voice Biomarkers for the Detection of Cognitive Impairment. IEEE Access, 12, 122840-122851. Mirheidari B, Bell SM, Harkness K, Blackburn D & Christensen H (2024) Spoken language-based automatic cognitive assessment of stroke survivors. Language and Health, 2(1), 32-38. Mirheidari B, Bittar A, Cummins N, Downs J, Fisher HL & Christensen H (2024) Automatic detection of expressed emotion from five-minute speech samples: challenges and opportunities. PLOS ONE, 19(3). View this article in WRRO Pevy N, Christensen H, Walker T & Reuber M (2024) Predicting the cause of seizures using features extracted from interactions with a virtual agent. Seizure: European Journal of Epilepsy, 114, 84-89. View this article in WRRO Walker G, Pevy N, O'Malley R, Mirheidari B, Reuber M, Christensen H & Blackburn D (2024) Speech patterns in responses to questions asked by an intelligent virtual agent can help to distinguish between people with early stage neurodegenerative disorders and healthy controls. Clinical Linguistics & Phonetics, 38(9), 880-901. View this article in WRRO Blackburn DJ, Bell SM, Harkness K, O'Malley R, Chapman L, Lunn I, Mirheidari B & Christensen H (2023) Feasibility of longitudinal automated cognitive assessment in the stroke pathway. Alzheimer's & Dementia, 19(S14). Blackburn DJ, Sproson L, Egbuta C, Bell SM, O'Malley R, Mirheidari B, Pevy N & Christensen H (2023) Developing an automated Cognitive assessment based on language; CognoSpeak‐ working with an ethnic minority group. Alzheimer's & Dementia, 19(S20). Pevy N, Christensen H, Walker T & Reuber M (2023) 02 Predicting the cause of TLOC using an automated analysis of interactions with a virtual agent. Journal of Neurology, Neurosurgery & Psychiatry, 94(12), e2.9-e2.9. Walker G, Walker T, O'Malley R, Mirheidari B, Christensen H, Reuber M & Blackburn D (2023) Features of answers to questions about recent events by people with mild cognitive impairment and Alzheimer’s disease, and healthy controls. Journal of Interactional Research in Communication Disorders, 14(3), 408-429. View this article in WRRO Alhinti L, Cunningham S & Christensen H (2023) The Dysarthric Expressed Emotional Database (DEED): an audio-visual database in British English. PLOS ONE, 18(8). View this article in WRRO Hernáez-Rioja I, Gonzalez-Lopez JA & Christensen H (2023) Special issue on applications of speech and language technologies in healthcare. Applied Sciences, 13(11). View this article in WRRO Pevy N, Christensen H, Walker T & Reuber M (2023) Differentiating between epileptic and functional/dissociative seizures using semantic content analysis of transcripts of routine clinic consultations. Epilepsy & Behavior, 143. View this article in WRRO Børty L, Brøndum RF, Christensen HS, Vesteghem C, Severinsen M, Johnsen SP, Ehlers LH, Falkmer U, Poulsen LØ & Bøgsted M (2023) Trends and drivers of pharmaceutical expenditures from systemic anti-cancer therapy. The European Journal of Health Economics, 24(6), 853-865. Attas D, Power N, Smithies J, Bee C, Aadahl V, Kellett S, Blackmore C & Christensen H (2022) Automated detection of the competency of delivering guided self-help for anxiety via speech and language processing. Applied Sciences, 12(17). Bell S, Harkness K, Roman M, Gardner J, Richards E, Howe J, Sikaonga M, Mirheidari B, Christensen H & Blackburn D (2022) FEASIBILITY OF AN AUTOMATED ASSESSMENT TO MEASURE COGNITION AND MOOD IN THE ACUTE STROKE SETTING. JOURNAL OF NEUROLOGY NEUROSURGERY AND PSYCHIATRY, 93(9). Sproson L, Mills N, Pryde L, Adebajo A, Coyle D, Preston J, Blackburn D, Christensen H & Lanfranchi V (2022) Keeping patient and public partnership at the heart of medical technology development during Covid-19 : examples of adaptive practice. Journal of Medical Engineering & Technology, 46(6). View this article in WRRO Brewer E, Mirheidari B, O'Malley R, Reuber M, Christensen H & Blackburn DJ (2021) Characterising spoken interactions of healthy ageing adults with CognoSpeak, a web‐based cognitive assessment tool. Alzheimer's & Dementia, 17(S5). Pevy N, Christensen H, Walker T & Reuber M (2021) Feasibility of using an automated analysis of formulation effort in patients’ spoken seizure descriptions in the differential diagnosis of epileptic and nonepileptic seizures. Seizure, 91, 141-145. View this article in WRRO Pevy N, Christensen H, Walker T & Reuber M (2021) #3079 Investigating the feasibility of automating the differential diagnosis of transient loss of consciousness. Journal of Neurology, Neurosurgery & Psychiatry, 92(8), A7.1-A7. Beavis L, O'Malley R, Mirheidari B, Christensen H & Blackburn D (2021) How can automated linguistic analysis help to discern functional cognitive disorder from healthy controls and mild cognitive impairment?. BJPsych open, 7(Suppl 1), S7-S7. Walker G, Morris L-A, Christensen H, Mirheidari B, Reuber M & Blackburn DJ (2021) Characterising spoken responses to an intelligent virtual agent by persons with mild cognitive impairment. Clinical Linguistics & Phonetics, 35(3), 237-252. View this article in WRRO Alhinti L, Christensen H & Cunningham S (2021) Acoustic differences in emotional speech of people with dysarthria. Speech Communication, 126, 44-60. O'Malley RPD, Mirheidari B, Harkness K, Reuber M, Venneri A, Walker T, Christensen H & Blackburn D (2021) Fully automated cognitive screening tool based on assessment of speech and language. Journal of Neurology, Neurosurgery & Psychiatry, 92(1), 12-15. View this article in WRRO O’Malley R, Morris L-A, Longden C, Turner A, Walker T, Venneri A, Mirheidari B, Christensen H, Reuber M & Blackburn D (2020) 26 Can an automated assessment of language help distinguish between Functional Cognitive Disorder and early neurodegeneration?. Journal of Neurology, Neurosurgery & Psychiatry, 91(8), e18.2-e19. Walker T, Christensen H, Mirheidari B, Swainston T, Rutten C, Mayer I, Blackburn D & Reuber M (2020) Developing an intelligent virtual agent to stratify people with cognitive complaints: A comparison of human-patient and intelligent virtual agent-patient interaction. Dementia, 19(4), 1173-1188. View this article in WRRO O’Malley R, Mirheidari B, Harkness K, Walker T, Reuber M, Venneri A, Christensen H & Blackburn D (2020) A fully automated cognitive screening tool b",
  "content_length": 43646,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:23"
}