{
  "name": "Heikki Mannila",
  "homepage": "https://users.ics.aalto.fi/mannila",
  "status": "success",
  "content": "Heikki Mannila HomePage HEIKKI MANNILA Professor, Aalto University, Department of Information and Computer Science (on leave) President, Academy of Finland Email: Heikki.Mannila@aalto.fi; Address at Department Information and Computer Science: Konemiehentie 2, Room A334 (3rd floor). Short biography Research interests My primary research interests are in algorithms, data mining, and data analysis. I look at basic research questions in computer science in areas where there are applications in sight. The application areas I am interested in included computational biology, paleontology, and linguistics. List of publications (not updated regularly) What's new? Jefrey Lijffijt, Panagiotis Papapetrou, Kai Puolamaki, Heikki Mannila: Analyzing Word Frequencies in Large Text Corpora Using Inter-arrival Times and Bootstrapping. ECML/PKDD (2) 2011: 341-357 Panagiotis Papapetrou, Aristides Gionis, Heikki Mannila: A Shapley Value Approach for Influence Attribution. ECML/PKDD (2) 2011: 549-564 187 Aleksi Kallio, Niko Vuokko, Markus Ojala, Niina Haiminen, Heikki Mannila: Randomization techniques for assessing the significance of gene periodicity results. BMC Bioinformatics 12: 330 (2011) Gemma C. Garriga, Esa Junttila, Heikki Mannila: Banded structure in binary matrices. Knowl. Inf. Syst. 28(1): 197-226 (2011) T. Nevalainen, H. Raumolin-Brunberg and H. Mannila: The diffusion of language change in real time: Progressive and conservative individuals and the time depth of change Language Variation and Change 23, 1, 1-43, 2011. J. Saarinen, E. Oikarinen, M. Fortelius and H. Mannila: The living and the fossilized: how well do unevenly distributed points capture the faunal information in a grid. Evolutionary Ecology Research, 12: 363376, 2010. Theodoros Lappas, Evimaria Terzi, Dimitrios Gunopulos, Heikki Mannila: Finding effectors in social networks. KDD 2010: 1059-1068 Panu Luosto, Jyrki Kivinen, Heikki Mannila: Gaussian Clusters and Noise: An Approach Based on the Minimum Description Length Principle. Discovery Science 2010: 251-265 T. Elomaa, H. Mannila, P. Orponen (eds.): Algorithms and Applications, Essays Dedicated to Esko Ukkonen on the Occasion of His 60th Birthday. ISBN 978-3-642-12475-4, Springer 2010. T. Vesala, S. Launiainen, P. Kolari, J. Pumpanen, S. Sevanto, P. Hari, E. Nikinmaa, P. Kaski, H. Mannila, E. Ukkonen, S. Piao and P. Ciais: Autumn temperature and carbon balance of a boreal Scots pine forest in Southern Finland. Biogeosciences 7, 163-176, 2010. M. Ojala, G. Garriga, A. Gionis, H. Mannila: Evaluating Query Result Significance in Databases via Randomizations. SDM'10: Proceedings of the 2010 SIAM International Conference on Data Mining, p. 906-917. J. Wessman, T. Paunio, A. Tuulio-Henriksson, M. Koivisto, T. Partonen, J. Suvisaari, JA. Turunen, J. Wedenoja, W. Hennah, O. Pietilainen, J. Lonnqvist, H. Mannila, L. Peltonen: Mixture model clustering of phenotype features reveals evidence for association of DTNBP1 to a specific subtype of schizophrenia. Biological Psychiatry, Volume 66, Issue 11, Pages 990-996, 2009. M. Miah, G. Das, V. Hristidis, H. Mannila: Determining Attributes to Maximize Visibility of Objects IEEE Transactions on Knowledge and Data Engineering 21, 7 (2009), 959-973. H. Hakkoymaz, G. Chatzimilioudis, D. Gunopulos, H. Mannila: Applying Electromagnetic Field Theory Concepts to Clustering with Constraints. ECML/PKDD (1) 2009: 485-500. T. Feder, H. Mannila, E. Terzi: Approximating the Minimum Chain Completion problem . Information Processing Letters, 109, 17, 2009, 980-985. S. Hanhijärvi, M. Ojala, N. Vuokko, K. Puolamäki, N. Tatti, and H. Mannila: Tell me something I don't know: Randomization strategies for iterative data mining. Proceedings of the 15th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '09), to appear. L.H. Liow, M. Fortelius, K. Lintulaakso, H. Mannila, N.Chr. Stenseth: Lower Extinction Risk in Sleep-or-Hide Mammals. American Naturalist 2009. Vol. 173, pp. 264-272. A. Ukkonen, K. Puolamaki, A. Gionis, H. Mannila: A Randomized Approximation Algorithm for Computing Bucket Orders. Information Processing Letters 109 (2009), 356-359. H. Mannila: Finding Total and Partial Orders from Data for Seriation, Discovery Science 2008 p. 16-25. G. Garriga, A. Ukkonen, H. Mannila: Feature Selection in Taxonomies with Applications to Paleontology, Discovery Science 2008 p. 112--123. [Correction.] N. Haiminen, H. Mannila, E. Terzi: Determining significance of pairwise co-occurrences of events in bursty sequences. BMC Bioinformatics 9(336), 2008. [online, open access] P. Miettinen, T. Mielikainen, A. Gionis, G. Das, H. Mannila: The Discrete Basis Problem. To appear in IEEE Transactions on Knowledge and Data Engineering, 20(10), October 2008. [PrePrint from IEEE] (An expanded versio of P. Miettinen, T. Mielikainen, A. Gionis, G. Das, H. Mannila: The Discrete Basis Problem. 10th European Conference on Principles and Practice of Knowledge Discovery in Databases (PKDD) 2006, p. 335-346. PKDD Best Paper.) N. Haiminen, H. Mannila: Evaluation of BIC and cross validation for model selection on sequence segmentations. International Journal of Data Mining and Bioinformatics (IJDMB) (in press). L.H. Liow, M. Fortelius, E. Bingham, K. Lintulaakso, H. Mannila, L. Flynn, and N.Chr. Stenseth Higher origination and extinction rates in larger mammals. Proc Natl Acad Sci 105(16), pp. 6097-6102, 2008. P.E. Lundmark, U. Liljedahl, D.I. Boomsma, H. Mannila, N.G. Martin, A. Palotie, L. Peltonen, M. Perola, T.D. Spector and A.-C. Syvänen: Evaluation of HapMap data in six populations of European descent. European Journal of Human Genetics 2008, 1-9. P. Rastas, M. Koivisto, H. Mannila, and E. Ukkonen: Phasing genotypes using a hidden Markov model. In: Bioinformatics Algorithms: Techniques and Applications, I. Mandoiu and A. Zelikovsky (eds.), p. 373-391, Wiley 2008. P. Miettinen, A. Gallo, H. Mannila: Finding duplicate descriptors: algorithms for redescription mining. SIAM Data Mining Conference 2008, p. 334-345. M. Ojala, N. Vuokko, A. Kallio, N. Haiminen, H. Mannila: Randomization of real-valued matrices for assessing the significance of data mining results. SIAM Data Mining Conference 2008, p. 494-505.. B. Goethals, W. Le Page, and Heikki Mannila, Mining Association Rules of Simple Conjunctive Queries, SIAM Data Mining Conference 2008, p. 96-107. M. Miah, V. Hristidis, G. Das, H. Mannila: Standing Out in a Crowd: Selecting Attributes for Maximum Visibility. International Conference on Data Engineering (ICDE 2008), p. 356-365. Robert Gwadera and Aristides Gionis and Heikki Mannila: Optimal segmentation using tree models, Knowledge and Information Systems 15, 3 (2008). A. Gionis, H. Mannila, T. Mielikainen, and P. Tsaparas, Assessing Data Mining Results via Swap Randomization, ACM Transactions on Knowledge Discovery from Data (TKDD), Volume 1 , Issue 3 (December 2007) Article No. 14. We consider a simple randomization technique for producing random datasets that have the same row and column margins with the given dataset. Then one can test the significance of a data mining result by computing the results of interest on the randomized instances and comparing them against the results on the actual data. This randomization technique can be used to assess the results of many different types of data mining algorithms, such as frequent sets, clustering, and rankings. To generate random datasets with given mar- gins, we use variations of a Markov chain approach, which is based on a simple swap operation. We give theoretical results on the efficiency of different randomization methods, and apply the swap randomization method to several well- known datasets. Our results indicate that for some datasets the structure discovered by the data mining algorithms is a random artifact, while for other datasets the discovered structure conveys meaningful information. The code is available. H. Mannila: The role of information technology for systems biology. In Systems Biology: A Grand Challenge for Europe, ESF 2007, p. 21-23. A. Ukkonen and H. Mannila: Finding Outlying Items in Sets of Partial Rankings . In: Knowledge Discovery in Databases: PKDD 2007, p. 265-276. S. Hyvonen, A. Gionis, and H. Mannila: Recurrent predictive models for sequence segmentation. Advances in Intelligent Data Analysis VII (IDA 2007), p. 195-206. H. Mannila and E. Terzi: Nestedness and segmented nestedness. In Proceedings of the 13th ACM SIGKDD international conference on Knowledge discovery and data mining (KDD 2007), p. 480-489. H. Heikinheimo, E. Hinkkanen, H. Mannila, T. Mielikäinen, and J. Seppänen, Finding low-entropy ssets and trees from binary data In Proceedings of the 13th ACM SIGKDD international conference on Knowledge discovery and data mining (KDD 2007), p. 350-359. Niina Haiminen, Heikki Mannila, Evimaria Terzi: Comparing segmentations by applying randomization techniques. BMC Bioinformatics 2007, 8:171 (23 May 2007). N. Haiminen, H. Mannila: Discovering isochores by least-squares optimal segmentation. Gene 394 (Issues 1-2), 2007, pp. 53-60 (1 June 2007). [online via ScienceDirect] N. Landwehr, T. Mielikäinen, L. Eronen, H. Toivonen and H. Mannila, Constrained hidden Markov models for population-based haplotyping, BMC Bioinformatics 2007, 8(Suppl 2):S9. A. Dasgupta, G. Das, and H. Mannila: A Random Walk Approach to Sampling Hidden Databases . Proceedings of the 2007 ACM SIGMOD international conference on Management of Data (SIGMOD 2007), p. 629-640. A. Hinneburg, H. Mannila, S. Kaislaniemi, T. Nevalainen and H. Raumolin-Brunberg: How to Handle Small Samples: Bootstrap and Bayesian Methods in the Analysis of Linguistic Change, Literary and Linguistic Computing 22, 2 (June 2007) 137-150; doi: 10.1093/llc/fqm006 H. Heikinheimo, M. Fortelius, J. Eronen and H. Mannila: Biogeography of European land mammals shows environmentally distinct and spatially coherent clusters. Journal of Biogeography 34, 6, 1053-1064 (2007). doi:10",
  "content_length": 28080,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:32"
}