{
  "name": "Heiko Mantel",
  "homepage": "http://www.mais.informatik.tu-darmstadt.de/Heiko_Mantel.html",
  "status": "success",
  "content": "Prof. Dr.-Ing. Heiko Mantel | Modeling and Analysis of Information Systems Skip to main content Modeling and Analysis of Information Systems Prof. Dr.-Ing. Heiko Mantel Prof. Dr.-Ing. Heiko Mantel This page is currently under construction.Office:S2|02 E317Phone:+49 6151 16-25250 (secretary)+49 6151 16-25252 (direct or secretary) Fax:+49 6151 16-25251Mail:LASTNAMEcs.tu-darmstadt.deTU DarmstadtDepartment of Computer ScienceModeling and Analysis of Information SystemsHochschulstraße 10D-64289 DarmstadtGermany Image Heiko Mantel has been professor for Computer Science at TU Darmstadt since 2007. Since January 2018, he has been the spokesman of the LOEWE research focus Software-Factory 4.0. Heiko Mantel is a principle investigator of the DFG-funded collaborative research center CROSSING (Cryptography-Based Security Solutions: Enabling Trust in New and Next Generation Computing Environments) and of CRISP (Center for Research in Security and Privacy Darmstadt). Moreover, he is a principal investigator of research projects funded by the DAAD and by the DFG. Heiko Mantel had been the spokesman of the German national research initiative RS3 (Reliably Secure Software Systems) funded by the DFG (German Research Association) from 2010 to 2017, and he had been a principle investigator of CASED (Center for Advanced Security Research Darmstadt) and of EC-SPRIDE (European Center for Security by Design) since these centers have been founded. In addition, Heiko Mantel has been principal investigator of research projects funded by the DFG, by the EC, and by industry. Heiko Mantel served for the DFG as a reviewer for proposals of individual projects, graduate schools, and collaborative research centers.  He also served as reviewer for the DAAD (German Academic Exchange Service), the NWO (Nederlandse Organisatie voor Wetenschppelijk Onderzoek), the Studienstiftung des deutschen Volkes (German National Academic Foundation), and the Swedish Foundation for Strategic Research.  He is on the editorial board of IJIS (Springer's International Journal on Information Security), was on the program committees of many international and national conferences, and served as reviewer of numerous conference and journal submissions.Heiko Mantel's main research focus is on information security and on concurrency.  Most of his research projects have been motivated by a need for more trustworthy solutions.  His research spectrum ranges from theoretical foundations over methods and tools to applications in the real world.Short CV2009-now  full professor, Computer Science department, TU Darmstadt2007-2009 associate professor, Computer Science department, TU Darmstadt2005-2007 assistant professor for Security Engineering, RWTH Aachen2003-2005 post-doctoral researcher, Information Security group (supervisor: Prof. David A. Basin, Ph.D.), ETH Zurich1996-2003 researcher, German Research Center for Artificial Intelligence Ltd. (DFKI GmbH), SaarbruckenHeiko Mantel received his doctoral degree (Dr.-Ing.) from Saarland University in 2003 (supervisor: Prof. Jörg Siekmann, Ph.D.).  He holds a Masters degree in Computer Science from the University of Colorado at Boulder and a Diploma degree in Computer Science from the Technische Universität Darmstadt. Heiko Mantel spent extended research stays at Chalmers University (2001, 2003, and 2009), at Cornell University (1999 and 2000), and at Harvard University (2014).Mission statement on information security research\"I think that many aspects of information security are still in need of better foundations.  Personally, I am interested in foundations that have a clearly identifiable potential for applications - today or in the future - for instance for implementing tools that provide better security analysis or better security engineering support.  I am also interested in foundations that can be used as thinking tools to ease navigation and to reduce conceptual complexity in problem solving.  It is well known that information security is not always compatible with abstractions commonly used in Computer Science, but we have not yet found abstractions that are right for information security and also for the other areas of Computer Science.  This lack of suitable abstractions is complicating both, security analysis and security engineering.\"Research topicscombining analytical and experimental techniques in security verificationcompositional reasoning about security and abstractions suitable for securityformal methods for security requirement definition, security analysis, and security engineeringimplementation-level security for cryptographyinformation-flow security and information flow controllanguage-based securitymobile securitymodels of concurrency and weak memory modelssecure usage and usage controlsecurity of concurrent and distributed systemsside channel analysis and mitigationstatic and dynamic program analysis techniques and tools for verifying securityFormer research topicsautomated reasoning for sub-structural logics like linear logicconnection method and tableaux calculisecure codingtool support for security certification according to evaluation criteria like ITSEC and Common criteriaSelection of third-party-funded research projectsSeRCA (Secure Refinement of Cryptographic Algorithms)funded by the DFG (German Research Foundation) in the collaborative research center CROSSING as project E3SeRDiWow (Securing Refinements of Distributed Workflows)funded by the BMBF (German Federal Ministry of Education and Research) and HMWK (Hessen State Ministry for Higher Education, Research and the Arts) in the National Research Center for Applied Cybersecurity ATHENE within TRUDATADUCIF (Distributed Usage and Information-Flow Control in the IoT)funded by the BMBF (German Federal Ministry of Education and Research) and HMWK (Hessen State Ministry for Higher Education, Research and the Arts) in the National Research Center for Applied Cybersecurity ATHENE within TRUDATASF 4.0 - Coordination (Coordination of Software-Factory 4.0)funded as a Research Focus within LOEWE (Landes-Offensive zur Entwicklung Wissenschaftlich-ökonomischer Exzellenz) by the HMWK (Hessen State Ministry for Higher Education, Research and the Arts)SF 4.0 - Sound Parallelizationfunded as a Research Focus within LOEWE (Landes-Offensive zur Entwicklung Wissenschaftlich-ökonomischer Exzellenz) by the HMWK (Hessen State Ministry for Higher Education, Research and the Arts)Teachingcourses offered in winter term 2024/25courses offered in summer term 2025Services at TU DarmstadtHeiko Mantel served as a member of the Computer science department's strategy commission (2009-2011), as a delegate of the university's senate for faculty recruitment (Senatsbeauftragter in Berufungsfragen), as member of the council of the Computer Science department (Fachbereichsrat), and as chairman or member of multiple committees for hiring new faculty members in the Computer Science department.  He coordinated the CASED distinguished lecture series (2009-2012), was a co-organizer of the Long-Term Security lecture series (2007), and was on the university chancellor's board for selecting the best Bachelor theses and Master theses in Computer Science, in Mathematics, and in Industrial Engineering and Management for the Datenlotsenpreis (2011-2015).  He is a founding member of TU Darmstadt's research profile area in cyber security CYSEC (since 2015).Selected organization of events and PC membershipsCo-chair, ISoLA 2024 - track Automating Software Re-Engineering: International Symposium On Leveraging Applications of Formal Methods, Verification and Validation, 2024.Committee Member, CSF 2024 - Test-of-Time Awards Committee: IEEE 37th Computer Security Foundations Symposium, 2024.PC member, ICFEM 2023: International Conference on Formal Engineering Methods, 2023.Co-chair, ISoLA 2022 - track Automated Software Re-Engineering: International Symposium On Leveraging Applications of Formal Methods, Verification and Validation, 2022.PC member, CSF 2022: IEEE 35th Computer Security Foundations Symposium, 2022.Member of Scientific Directorate: Schloss Dagstuhl since, 2021.PC member, CSF 2021: IEEE 34th Computer Security Foundations Symposium, 2021.Organizer, Annual & Staff Meeting 2021 of LOEWE-research-cluster Software-Factory 4.0Organizer, Staff Meeting 2021 of LOEWE-research-cluster Software-Factory 4.0Co-chair, ISoLA 2020 - track Automating Software Re-Engineering: International Symposium On Leveraging Applications of Formal Methods, Verification and Validation, 2020.Organizer, Annual & Staff Meeting 2020 of LOEWE-research-cluster Software-Factory 4.0Organizer, Staff Meeting 2020 of LOEWE-research-cluster Software-Factory 4.0PC member, FCS 2020: Workshop on Foundations of Computer Security, 2020.Organizer, Annual & Staff Meeting 2019 of LOEWE-research-cluster Software-Factory 4.0Co-Organizer, Practitioner Event of LOEWE-research-cluster Software-Factory 4.0Organizer, Staff Meeting 2019 of LOEWE-research-cluster Software-Factory 4.0PC member, POST 2019: International Conference on Principles of Security and Trust, 2019.Organizer, Annual & Staff Meeting 2018 of LOEWE-research-cluster Software-Factory 4.0PC member, CSF 2018: IEEE 31st Computer Security Foundations Symposium, 2018.PC member, GI SICHERHEIT 2018: Schutz und Zuverlässigkeit, 2018.Organizer, Staff Meeting 2018 of LOEWE-research-cluster Software-Factory 4.0PC member, POST 2018: International Conference on Principles of Security and Trust, 2018.PC member, PrePost 2017: International Workshop on Pre- and Post-Deployment Verification Techniques, 2017.PC member, ESORICS 2017: European Symposium on Research in Computer Security, 2017.PC member, ESORICS 2016: European Symposium on Research in Computer Security, 2016.PC member, LOPSTR 2016: International Symposium on Logic-Based Program Synthesis and Transformation, 2016.PC member, Sicherheit 2016: Schutz und Zuverlässigkeit, 2016.Organizer, Staff Meeting 2016 of DFG Priority Programme RS3 in Köni",
  "content_length": 15226,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:28"
}