{
  "name": "Heiko Vogler",
  "homepage": "http://www.inf.tu-dresden.de/?node_id=1567",
  "status": "success",
  "content": "Startseite Fakultät Informatik — Fakultät Informatik — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen © Florian Schneider Fakultät Informatik mehr erfahren Fakultät Informatik News Weitere News © Zhenying Liu 12.11.2025 Zu Besuch bei Xenon in Suzhou Weiterlesen Zu Besuch bei Xenon in Suzhou © André Wirsig / TU Dresden 17.10.2025 Europaweit einzigartiges Forschungszentrum für die Mobilität der Zukunft entsteht in der Lausitz Weiterlesen Europaweit einzigartiges Forschungszentrum für die Mobilität der Zukunft entsteht in der Lausitz © privat 01.10.2025 Die Fakultät begrüßt Prof. László Kozma Weiterlesen Die Fakultät begrüßt Prof. László Kozma Weitere News Termine Weitere Termine Dez 8 2025 Vertei­digung der Disser­tation von Herrn Dipl.-Ing. Max Sponner Dez 10 2025 Status­vortrag im Promo­tions­verfah­ren von Peng Liu Dez 11 2025 Status­vortrag im Promo­tions­verfah­ren von Herrn Zhan Qu Dez 11 2025 Vertei­digung der Disser­tation von Frau M.Sc. Nadine Char­lotte Auer Weitere Termine Wichtige Themen im Überblick © Max Leuthäuser Institute und Professuren Die Forschungsarbeit in den sechs Instituten und 28 Professuren mit 300 wissenschaftlichen Mitarbeitern zeichnet eine hohe wissenschaftliche Kompetenz und Leistungsfähigkeit aus. Informatik als Universalwissenschaft durchdringt heute alle Lebensbereiche und schafft die Grundlage für innovative Technologien. Weiterlesen Institute und Professuren © 2014 Andre Wirsing Studienan­gebot Modernste Technik, praxisnahes und forschendes Lehren und Lernen, international tätige Professoren und interessante Forschungsschwerpunkte sowie weltweite universitäre und industrielle Zusammenarbeiten bieten beste Studienbedingungen in den acht Studiengängen der Fakultät. Weiterlesen Studienangebot © Silvia Kapplusch Forschung Von der Grundlagenforschung bis zur Anwendung: Über 200 Forschungsprojekte identifizieren die sechs Forschungsschwerpunkte der Fakultät am Wissenschaftsstandpunkt Dresden, welcher eine einmalige Vernetzung mit den 15 großen Forschungsinstituten im DRESDEN concept bietet. Interdisziplinäre Zusammenarbeit fördert Qualität, Ganzheitlichkeit und Interaktion. Weiterlesen Forschung © 2014 Tino Winkler Willkommen an der Informatikfa­kultät Fünf Jahrzehnte Forschungs- und Lehrerfahrung und ihre internationale Ausrichtung prägen die größte Informatikausbildungsstätte Sachsens. Die Fakultät deckt das gesamte Spektrum der Informatik ab und bietet in acht Studiengängen eine forschungsorientierte und praxisnahe Ausbildung auf hohem Niveau. Ihre Forschung dient der Entwicklung neuer Technologien für die Zukunft: Das Internet der Dienste, Cloud Computing, Datensicherheit, BigData und Interactive Visual Computing stehen beispielhaft für zahlreiche Forschungsfelder, die der Lehre neue Impulse geben. »Silicon Saxony« führt zudem die Software-Forschung in eine neue Dimension. In starker Gemeinschaft die Welt mitgestalten – an der Fakultät Informatik der TU Dresden © Fakultät Informatik, TU Dresden Datenschutzrichtlinie Geh Deinen Weg – als Wissenschaftlerin in der Informatik der TU Dresden © Fakultät Informatik - TU Dresden Datenschutzrichtlinie Name Dekanat E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Adresse work Besucheradresse: Andreas-Pfitzmann-Bau, Raum 1002 Nöthnitzer Str. 46 01187 Dresden None Zeige Karte von diesem Ort. work Tel. fax Fax +49 351 463-38221 Öffnungszeiten: Täglich: 08:00 - 16:00 Unsere Social Media Kanäle Zur Webseite © LinkedIn Zur Webseite Datenschutzrichtlinie",
  "content_length": 3605,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:31"
}