{
  "name": "Heike Trautmann",
  "homepage": "https://www.wi.uni-muenster.de/de/institut/statistik/personen/heike-trautmann",
  "status": "success",
  "content": "Prof. Dr. Heike Trautmann | Institut für Wirtschaftsinformatik VCard QR-Code Prof. Dr. Heike Trautmann Professor Professur für Statistik und Optimierung (Prof. Trautmann) Leonardo Campus 3 48149 Münster trautmann@uni-paderborn.deSprechzeiten: nach VereinbarungShort-URL: erc.is/p/trautmann Über Publikationen Projekte Auszeichnungen Veranstaltungen Abschlussarbeitsbetreuung Forschungsschwerpunkte Mehrkriterielle Optimierung Evolutionäre Optimierung Automatisierte Algorithmenselektion und -konfiguration Data Stream Mining Data Science Künstliche Intelligenz Akademische Ausbildung 07/2004- 01/2013 Habilitation im Fach Statistik: ”Statistical and Experimental Methods in Single- and Multi- Objective (Evolutionary) Optimization”, TU Dortmund, Deutschland 10/2002- 06/2004 Promotion im Fach Statistik: „Qualitätskontrolle in der Industrie anhand von Kontrollkarten für Wünschbarkeitsindizes - Anwendungsfeld Lagerverwaltung“, Graduate School of Production Engineering and Logistics, Universität Dortmund, Deutschland 10/1997- 02/2000 Studium der Statistik, Universität Dortmund, Deutschland 10/1996- 07/1998 Studium der Wirtschaftsmathematik, Universität Dortmund, Deutschland Beruflicher Werdegang 03/2021- 02/2026 Professor of Data Science: Statistics and Optimization, University of Twente, NL 02/2017- 01/2018 Pascal Professorin, LIACS, Universität Leiden, Niederlande seit 10/2016 Prodekanin für Internationales, Wirtschaftswissenschaftliche Fakultät seit 04/2013 Professorin für Wirtschaftsinformatik und Statistik, WWU Münster, Deutschland 10/2007- 03/2013 Postdoktorandin, Lehrstuhl für Computergestützte Statistik, TU Dortmund, Deutschland 10/2006- 09/2007 DFG Forschungsstipendium: „Der Einfluss von Modellunsicherheiten bei Wünschbarkeitsindizes und Pareto-Optimierung“, TU Dortmund, Deutschland 07/2004- 09/2006 Graduiertenkolleg Statistische Modellbildung, Universität Dortmund. Deutschland, Postdoktorandenstipendium 10/2002- 06/2004 Graduate School of Production Engineering and Logistics, Universität Dortmund, Deutschland, Doktorandenstipendium 03/2001- 09/2002 Roland Berger Strategy Consultants, München, Deutschland, Business Analytics Consultant 04/2000- 02/2001 Marketing Systems GmbH, Essen, Germany, Consultant Mitgliedschaften und Aktivitäten in Gremien seit 09/2018 Confederation of Laboratories for Artificial Intelligence Research in Europe (CLAIRE), Key supporter seit 2017 ACM full member, ACM Sigevo seit 09/2017 Wissenschaftliche Beirätin, Westphalia Data Lab (WDL), Münster seit 2013 Foundations of Genetic Algorithms (FOGA), Mitglied im Programmkomittee seit 2012 ACM-SIGEVO, Special Interest Group for Genetic and Evolutionary Computation, Association for Computing Machinery seit 2012 EVOLVE - A bridge between Probability, Set Oriented Numerics and Evolutionary Computation, Mitglied im Programmkomitee seit 2011 Genetic and Evolutionary Computation Conference (GECCO) , Mitglied im Programmkomitee 10/2011- 03/2013 Global Young Faculty, Stiftung Mercator seit 2008 International Conference on Parallel Problem Solving From Nature (PPSN), Mitglied im Programmkomitee seit 2007 IEEE Congress on Evolutionary Computation (CEC), Mitglied im Programmkomitee",
  "content_length": 3192,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:22"
}