{
  "name": "Heiko Paulheim",
  "homepage": "https://www.uni-mannheim.de/dws/people/professors/prof-dr-heiko-paulheim",
  "status": "success",
  "content": "Prof. Dr. Heiko Paulheim | Universität Mannheim Skip to main navigation Skip to page content Skip to footer Credit: Bianca Lermer Chair for Data Science and University Vice PresidentB6, 26, Room B0.22heiko (at) informatik.uni-mannheim.deAssistant: Ms. Ezgi Yilmaz.Note: As of October 1st, 2024, I act as a university vice president, thus, my teaching is very limited. This also includes thesis supervision, for which I have strictly limited capacities. Open Science Grant for Andreea Iana and Martin BöcklingAndreea Iana and Martin Böckling receive a grant from the university's Open Science Office for the SpatialBenchRAG project.Two Papers Accepted at ISWC 2025The DWS group has two papers accepted at the International Semantic Web Conference (ISWC) 2025.Four Papers Accepted at ESWC 2025Four papers of the DWS group got accepted at the 22nd Extended Semantic Web Conference. This year, the acceptance rate was 22.4% for full papers in the research track.Michael Schlechtinger defended his PhD ThesisOn Thursday, September 26th, Michael Schlechtinger has defended his PhD thesis on “Investigating, Predicting, and Mitigating Collusive Behavior in Deep Reinforcement Learning-Based Pricing AIs”, supervised by Prof. Heiko Paulheim. The thesis has been conducted in the KarekoKI project, an ...all news Short CVsince 2024University vice president for digitalization, equal opportunity, and diversitysince 2018Full professor for Data Science, University of Mannheim2017–2018Substitute professor for Data Science, University of Mannheim2014–2017Assistant professor for Web Data Mining, University of Mannheim2013–2014Postdoctoral researcher, University of Mannheim2011–2013Postdoctoral researcher, Technical University Darmstadt2011PhD in Computer Science, Technical University Darmstadt2008–2011Research associate, SAP Research2008M.Sc. in Computer Science, Technical University Darmstadt2006–2008Researcher, University of Applied Science, Darmstadt2005B.Sc. in Computer Science, University of Applied Science, DarmstadtMore on the WebPublications on MADOC (University of Mannheim's Publication Server)Publications at DBLPPublications at Google ScholarSlides at SlideShareRecorded talks at VideoLecturesUpdates on TwitterResearch interestsKnowledge Graphs on the Web and their ApplicationsData Quality and Data Cleaning on Knowledge GraphsUsing Knowledge Graphs in Data MiningSocietal Impact of Artificial IntelligencePast and ongoing projects:CaLiGraph – a knowledge graph build from Wikipedia Categories and List PagesDBkWik – a knowledge graph build from thousands of WikisWebIsALOD –  a hypernym graph extracted from the WebRapidMiner LOD Extension – a tool for consuming semantic web data in RapidMinerRDF2vec – a method for transforming RDF graphs into numeric vectors for consumption in data miningAwards and NominationsBest paper award at Knowledge Graph and Semantic Web Conference, 2022. \tSven Hertling and Heiko Paulheim: DBkWik++ – Multi Source Matcing of Knowledge GraphsBest paper award at Semantics 2022. \tFranz Krause, Tobias Weller, and Heiko Paulheim: On a Generalized Framework for Time-Aware Knowledge Graphs.Outstanding reviewer award at European Semantic Web Conference, 2022.Best poster award at European Semantic Web Conference, 2022. \tJan Portisch and Heiko Paulheim: Walk this Way! Entity Walks and Property Walks for RDF2vec.Runner up for best paper award at 2nd International Workshop on Knowledge Graphs for Online Discourse Analysis, 2022. \tMehwish Alam, Andreea Iana, Alexander Grote, Katharina Ludwig, Philipp Müller, and Heiko Paulheim: Towards Analyzing the Bias of News Recommender Systems Using Sentiment and Stance Detection.Challenge Winner at Semantic Reasoning Challenge 2021 (Task 1: Datasets). \tNicolas Heist, Heiko Paulheim: The CaLiGraph Ontology as a Challenge for OWL Reasoners.Runner up for best poster award at Semantics 2021. \tMalte Brockmeier, Yawen Liu, Sunita Pateer, Sven Hertling, and Heiko Paulheim: On-Demand and Lightweight Knowledge Graph Generation – a Demonstration with DBpedia.Best demonstration award at Extended Semantic Web Conference 2021. \tTabea-Clara Bucher, Xuehui Jiang, Ole Meyer, Stephan Waitz, Sven Hertling, and Heiko Paulheim: scikit-learn Pipelines meet Knowledge Graphs – The Python kgextension package.Outstanding reviewer award for Semantic Web Journal, 20182nd price CCC Blue Sky Ideas Track at International Semantic Web Conference 2018 \tHeiko Paulheim: How Much is a Triple? (PDF)Best demonstration award at Extended Semantic Web Conference 2016. \tAnna Lisa Gentile, Sabrina Kirstein, Heiko Paulheim, and Christian Bizer: Extending RapidMiner with Data Search and Integration Capabilities (PDF).Outstanding Reviewer for Journal of Web Semantics, March 2015Winner of the Open Track at the Semantic Web Challenge 2014, Riva del Garda, Italy, October 2014. Petar Ristoski, Christian Bizer, and Heiko Paulheim: Mining the Web of Linked Data with RapidMiner.Winner of the Big Data Track at the Semantic Web Challenge 2014, Riva del Garda, Italy, October 2014. Oliver Lehmberg, Dominique Ritze, Petar Ristoski, Kai Eckert, Heiko Paulheim, and Christian Bizer: Extending Tables with Data from over a Million Websites.Best performing approach for task 1 and 3, and best performing approach overall at ESWC-14 Challenge: Linked Open Data-enabled Recommender Systems (P. Ristoski, E. Mencía, H. Paulheim: A Hybrid Multi-Strategy Recommender System Using Linked Open Data (PDF))Best Poster, International Semantic Web Conference 2013 (H. Paulheim, S. Hertling: Discoverability of SPARQL Endpoints in Linked Open Data)Winner of SemStats challenge 2013 (P. Ristoski, H. Paulheim: Analyzing Statistics with Background Knowledge from Linked Open Data)Best lecture award by Student Association of the Computer Science Department, TU Darmstadt, Winter term 2012/2013Best Semantic Web in Use Paper, Extended Semantic Web Conference 2012 (H. Paulheim: Generating Possible Explanations for Statistics from Linked Open Data)Best Demonstration, Extended Semantic Web Conference 2012 (H. Paulheim: Nobody Wants to Live in a City Where No Music Has Been Recorded)AI Mashup Challenge (2nd Prize), 2012 (A. Schulz, H. Paulheim: Mashup for Identifying Criticial Infrastructure)Prize for best dissertation (nominee), German Informatics Society, 2011 (Dissertation title: “Ontology based application integration on the user interface level”)Outstanding thesis award (nominee), Department of Computer Science, University of Applied Sciences, Darmstadt, 2005 (Thesis title: “Concepts and applications of modern code generators”)Awards Won by SuperviseesPetar Ristoski: SWSA Distinguished Dissertation Award, 2019Dominik Wienand: Best Master Degree Award by Deutsche Gesellschaft für Informations- und Datenqualität (DGIQ), 2013Atila Erdogan: Otto-Johannsen-Price for best Master's thesis in business informatics, University of Reutlingen, 2010Invited TalksInternational Joint Conference on Rules and Reasoning, Oslo, 19.09.2023Keynote: Knowledge Graph Embeddings meet Symbolic Schemas, or: what do they Actually Learn? Slides (PDF, 38 MB)Plate-Forme Intelligence Artificielle, Strasbourg, 04.07.2023Keynote: New Adventures in RDF2vecStatistical Modeling in Psychology Summer School, Mannheim, 26.06.2023Keynote: AI algorithms and how they interact with SocietyInternational Workshop on Knowledge Graph Generation from Text, Heraklion, 29.05.2023Keynote: Knowledge Graph Generation from Wikipedia in the Age of ChatGPT: Knowledge Extraction or Knowledge Hallucination?Neuro-Symbolic AI Focus Group, BOSCH, Renningen, 15.02.2023Keynote: New Adventures in RDF2vecHonda Research Institute, Offenbach, 01.02.2023Invited Talk: Knowledge Graphs – Data Quality and EmbeddingsData Science in Action Lecture Series, Mannheim, 29.09.2022Invited Lecture: Knowledge Matters! The Role of Knowledge Graphs in Modern AI SystemsScience Night, Mannheim, 10.09.2022Invited Talk: KI macht doch nur das, wofür sie programmiert wurde – oder?!International Semantic Web Summer School, Bertinoro, 05.07.2022Invited Lecture: Machine Learning Embeddings for Large Knowledge Graphs, together with Claudia d'AmaForschungstag der Baden-Württemberg-Stiftung, Stuttgart, 30.06.2022Keynote: KI macht doch nur das, wofür sie programmiert wurde – oder?!Summit Industrie 4.0, Vienna, 30.05.2022Keynote:Knowledge Graphs als Schlüsseltechnologie für moderne KI-SystemeSeminar on Relational (Graph) Learning, Amsterdam, 17.03.2022Invited Talk: What do Knowledge Graph Embeddings Learn?Vrije Universiteit Amsterdam, 14.02.2022Invited Talk: New Adventures in RDF2vecBBC Datalab, online, 14.12.2021Invited Talk: New Adventures in RDF2vecJohannes-Kepler-Universität Linz, 16.11.2021Invited Lecture: Knowledge Matters! The Role of Knowledge Graphs in Modern AI Systems2nd Workshop on Extraction and Evaluation of Knowledge Entities from Scientific Documents (EEKE2021), online, 30.09.2021Keynote: From Wikis to Knowledge Graphs: Approaches and Challenges beyond DBpedia and YAGOSAP SE, Walldorf, 11.08.2021Invited Talk:Using Knowledge Graphs in Data Science – From Symbolic to Latent Representations and a few Steps BackNEC Laboratories Europe, Heidelberg, 09.06.2020Invited Talk: Beyond DBpedia and YAGO – The New Kids on the Knowledge Graph BlockGESIS, Cologne, 04.03.2020Invited Talk: Beyond DBpedia and YAGO – The New Kids on the Knowledge Graph Block27th AIAI Irish Conference on Artificial Intelligence and Cognitive Science (AICS 2019), Galway, Ireland, 05.12.2019Keynote: Beyond DBpedia and YAGO – The New Kids on the Knowledge Graph BlockConference on Big Data and Competition Law:  Setting the Agenda, Beijing, China, 07.09.2019Invited Panel Talk: Big Data, Smart Algorithms, and Market Power – A Computer Scientist’s Perspective2nd International Semantic Web Research Summer School, Bertinoro, Italy, 02.07.2019Invited Lecture: Machine Learning and Embeddings for Large Knowledge Graphs, together with Claudia d'Amato13th DBpedia Community Meeting, Leipzig, Germany, 23.05.2019Keyn",
  "content_length": 116984,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:26"
}