{
  "name": "Heinrich Hußmann",
  "homepage": "http://www.medien.ifi.lmu.de/team/heinrich.hussmann",
  "status": "success",
  "content": "Heinrich Hußmann - Medieninformatik Institut für Informatik | Sitemap | LMU-Portal English StartseiteStudieninteressierteStudierendeLehrveranstaltungenForschungPersonenKontaktBesucherJobsFAQIntern Prof. Dr. Heinrich Hußmann✝ Völlig unerwartet ist am 23.5.22 unser lieber Kollege Heinrich Hußmann an den Folgen eines schweren Herzinfarktes verstorben. Als Gründer der Medieninformatik an der LMU ist er uns allen ein Vorbild und eine Inspiration. Als Kollege, Lehrer, Mentor und Freund war er jederzeit für uns da, und er hinterlässt eine nicht zu füllende Lücke. Unsere Gedanken sind bei seiner Familie, und trotz aller Fassungslosigkeit tun wir das, was ihm vermutlich am wichtigsten gewesen wäre, indem wir den Fortgang aller Lehrveranstaltungen und sonstigen Aktivitäten in der Gruppe sicherstellen. In tiefem Schmerz, die Medieninformatik der LMU Weitere Informationen finde Sie auf der Kondolenz-Seite Mail geschaeftsstelle ät ifi.lmu.de (Geschäftsstelle) sekretariat ät medien.ifi.lmu.de (Sekretariat) studierendenbetreuung ät medien.ifi.lmu.de (Studierendenbetreuung) Telefon 089/2180-75100 (Sekretariat) Lebenslauf Betreute Promotionen Herausgebergremien Publikationen Private Interessen Lebenslauf 1983 Diplom in Informatik an der Technischen Universität München 1983-1989 Wissenschaftlicher Mitarbeiter an der Universität Passau Arbeitsgebiete: Industriell anwendbare formale Spezifikationsmethoden, Prototyping-Werkzeuge 1989 Promotion zum Dr. rer. nat. an der Universität Passau Promotionsthema: Nichtdeterministische Algebraische Spezifikationen 1989-1994 Akademischer Rat an der Technischen Universität München Arbeitsgebiete: Software-Engineering-Methoden, Spezifikationssprachen, CASE 1994 Habilitation an der Fakultät für Informatik der Technischen Universität München Habilitationsthema: Formal Foundations for SSADM 1995 Software-Engineering-Preis der Ernst-Denert-Stiftung für die Habilitationsschrift 1994-1997 Systems Engineer im Bereich Öffentliche Kommunikationsnetze (Vorfeldentwicklung) der Siemens AG, München Arbeitsgebiete: Dienstespezifikation für breitbandige Multimedia-Dienste, Prototypentwicklung für Multimedia-Netzdienste, Intelligente Netze Mitarbeit in den Projekten AMUSE, INSIGNIA und EURORIM des EU-Förderprogramms ACTS Mitarbeit an einem Feldversuch für neue multimediale Medien (z.B. Video-on-Demand) in München Ab 1996 Leiter einer Dienststelle für Systemplanung und Systemarchitektur neuer Netzdienste 1997-2002 Professur für Softwaretechnologie an der TU Dresden am Institut für Software- und Multimediatechnik Arbeitsgebiete: Softwarearchitekturen für Anwendungsunterstützung in Breitbandnetzen (ATM- und IP-basiert), Spezifikation und Durchsetzung von Quality of Service (QoS) auf Anwendungsebene, QoS für Software-Komponenten, Semantik und Werkzeugunterstützung für semantische Constraints in der Unified Modeling Language (UML) Mitarbeit im Projekt ELISA des EU-Förderprogramms ACTS und im Projekt AQUILA des EU-Förderprogramms IST Mitarbeit in der DFG-Forschergruppe COMQUAD Mitarbeit an der Standardisierung der Object Constraint Language (OCL) im Rahmen der Object Management Group (OMG) seit März 2003 Professur für Medieninformatik an der Universität München Dekan der Fakultät für Mathematik, Informatik und Statistik der LMU (10/2009-10/2011) Visiting Researcher an der Lancaster University, UK (2008, 2013) Gastdozent an der South-West University for Nationalities, Chengdu, China (2014) Research Fellow für Human-Centric Engineering am fortiss-Institut (seit 2017) Direktor des Instituts für Informatik der LMU (10/2017-10/2020) Betreute Promotionen Christina Schneegass Embedding Mobile Learning into Everyday Life Settings (15.10.2021) Ceenu George Virtual Reality Interfaces for Seamless Interaction with the Physical Reality (29.09.2020) Sylvia Rothe Konzepte und Guidelines für Applikationen in Cinematic Virtual Reality (05.08.2020) Gesa Wiegand Exploration of Smart Infrastructure for Drivers of Autonomous Vehicles -Design Space, Out-of-View Visualizations and Explanations (22.07.2020) Malin Eiband Supporting Users in Understanding Intelligent Everyday Systems (31.10.2019) Christian Mai The Usage of Fully Immersive Head-Mounted Displays in Social Everyday Contexts (16.08.2019) Tobias Seitz Supporting Users in Password Authentication with Persuasive Design (04.07.2018) Maria Fysaraki Conceptualizing and Supporting Awareness of Collaborative Argumentation (23.02.2018) Henri Palleis The Tool Space: Designing Indirect Touch Input Techniques for Personal Multi-Surface Computing Devices (09.06.2017) Emanuel von Zezschwitz Risks and Potentials of Graphical and Gesture-Based Authentication for Touchscreen Mobile Devices (07.11.2016) Sarah Tausch The Influence of Computer-Mediated Feedback on Collaboration (19.10.2016) Alina Hang Exploiting Autobiographical Memory for Fallback Authentication on Smartphones (03.03.2016) Raphael Wimmer Grasp-Sensitive Surfaces (27.03.2015) Max-Emanuel Maurer Counteracting Phishing Through HCI: Detecting Attacks and Warning Users (11.04.2014) Linshu Duan Model-Based Testing of Automotive HMIs with Consideration for Product Variability (04.06.2012) Sara Streng The Role of Personal and Shared Displays in Scripted Collaborative Learning (24.04.2012) Yuanting Liu Developing an Interaction Concept for Touchscreen Incorporating Tactile Feedback (17.02.2012) Wolfgang Spießl Assessment and Support of Error Recognition in Automated Driving (19.07.2011) Alexander De Luca Designing Usable and Secure Authentication Mechanisms for Public Spaces (30.05.2011) Florence Balagtas-Fernandez Easing the Creation Process of Mobile Applications for Non-Technical Users (07.02.2011) Heiko Drewes Eye Gaze Tracking for Human Computer Interaction (18.03.2010) Simone Röttger Systematische Prozessunterstützung für die Entwicklung laufzeitkritischer Softwaresysteme (16.10.2009, TU Dresden) Andreas Pleuß Model-Driven Development of Interactive Multimedia Applications (27.05.2009) Richard Atterer Usability Tool Support for Model-Based Web Development (09.10.2008) Arnd Vitzthum Entwicklungsunterstützung für interaktive 3D-Anwendungen - Ein modellgetriebener Ansatz (07.07.2008) Steffen Zschaler A Semantic Framework for Non-Functional Specifications of Component-Based Systems (13.04.2007, TU Dresden) Dongyi Song Combining Speech User Interfaces of Different Applications (13.12.2006) Sten Löcher Modellgetriebene Konfiguration von Transaktionsdiensten in der komponentenbasierten Softwareentwicklung (21.03.2005, TU Dresden) Zweitgutachter für Promotionen: Felix Bübl (TU Berlin, 2005), Christoph Pohl (TU Dresden, 2005), Steffen Göbel (TU Dresden, 2006), Enrico Rukzio (LMU, 2007), Paul Holleis (LMU, 2009), Daniel Görlich (TU Kaiserslautern, 2009), Gerritt Meixner (TU Kaiserslautern, 2010), Jürgen Rückert (Univ. Heidelberg, 2010), Sean Eikenberg (Univ. BW München, 2010), Andreas Wolff (Univ. Rostock, 2011), Sebastian Götz (TU Dresden, 2013), Carsten Lucke (Univ. BW München, 2014), Zhang Ran (TU Kaiserslautern, 2015), Felix Raab (Univ. Regensburg, 2015), Nora Broy (Univ. Stuttgart, 2015), Matthias Trojahn (Univ. Magdeburg, 2016), Carlos Mauricio Castano Diaz (LMU, 2017), Sonja Hofauer (TU München, 2017), Andrea Nutsi (Univ. BW München, 2018), April Moeller-Bachhuber (LMU, 2020), Jurek Breuninger (TU München, 2020), Martin Häusl (TU Dresden, 2021), Anam Ahmad Khan (Univ. Melbourne, 2022) Herausgebergremien Computer Science - Research and Development (Springer) Software and Systems Modeling (Springer) Age of Access? Grundfragen der Informationsgesellschaft (De Gruyter) Steering Commitee Chair for the ACM/IEEE International Conference on Model Driven Engineering Languages and Systems (2008-2010) Publikationen 2023 Download Nađa Terzimehić, Sarah Aragon-Hahner, Heinrich Hussmann The Tale of a Complicated Relationship: Insights from Users' Love/Breakup Letters to Their Smartphones before and during the COVID-19 Pandemic. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 7, 1, Article 28 (March 2023), 34 pages. https://doi.org/10.1145/3580792. (bib) 2022 Download Yanhong Li, Zhenhan Gao, Sabrina Egger, Sven Mayer, Heinrich Hussmann Tangible Interfaces Support Young Children's Goal Interdependence Mensch und Computer 2022, September 4--7, 2022, Darmstadt, Germany Download Yanhong Li, Meng Liang, Julian Preissing, Nadine Bachl, Michelle Dutoit, Thomas Weber, Sven Mayer, Heinrich Hussmann A Meta-Analysis of Tangible Learning Studies from the TEI Conference In Sixteenth Interna- tional Conference on Tangible, Embedded, and Embodied Interaction (TEI 22), February 13â16, 2022, Daejeon, Republic of Korea. ACM, New York, NY, https://doi.org/10.1145/3490149.3501313 Download Yong Ma, Yomna Abdelrahman, Barbarella Petz, Heiko Drewes, Florian Alt, Heinrich Hussmann, Andreas Butz Enthusiasts, Pragmatists, and Skeptics: Investigating Users' Attitudes Towards Emotion- and Personality-Aware Voice Assistants across Cultures In Proceedings of Mensch und Computer 2022 (MuC '22). Darmstadt, Germany. September 4 - 7, 2022. ACM, New York, NY, USA. (bib) Download Thomas Weber, Heinrich Hussmann Tooling for Developing Data-Driven Applications: Overview and Outlook MuC'22: Proceedings of Mensch und Computer 2022. September 2022. Pages 66-77. https://doi.org/10.1145/3543758.3543779 (bib) Download Yanhong Li, Nadine Bachl, Michelle Dutoit, Thomas Weber, Sven Mayer, Heinrich Hussmann Designing Tangible Tools to Engage Silent Students in Group Discussion The 8th International Symposium on Educational Technology (ISET 2022) (bib) Download Heiko Drewes, Sophia Sakel, Heinrich Hussmann User Perception of Smooth Pursuit Target Speed 2022 Symposium on Eye Tracking Research and Applications (bib) Download Yanhong Li, Szilvia Balogh, Armand Luttringer, Thomas Weber, Sven Mayer, Heinrich Hussmann Designing a Tangible Interface to \"Force\" Children Collaboration The 21st of the ACM Interaction Design and Children (IDC) Conference (bib) Download Nađa Terzimehić, Luke Haliburt",
  "content_length": 74438,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:30"
}