{
  "name": "Helen Treharne",
  "homepage": "https://www.surrey.ac.uk/people/helen-treharne",
  "status": "success",
  "content": "Prof Helen Treharne | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all LinkedIn Google Scholar ORCID Professor Helen Treharne Head of School of Computer Science and Electronic Engineering; Professor in Computer Science SFHEA, FBCS +44 (0)1483 683161 h.treharne@surrey.ac.uk18 BB 03On campus - at least 3 days a week including Tuesday and Wednesday. School Administration Manager: Jane Phillipsjane.phillips@surrey.ac.ukAcademic and research departments School of Computer Science and Electronic Engineering, Computer Science Research Centre. AboutBiographyI am academic leader of the largest school in the Faculty of Engineering and Physical Sciences at the University of Surrey. I have a wide-ranging experience of academic leadership including professional body accreditation, Athena Swan submissions, Research Excellence Framework (REF) submission, delivering organisational change, focusing school strategic growth, strategic facility development, mentorship of staff and working with colleagues across the organisation to improve processes and organisational culture. Promoting my teams’ contributions and motivating colleagues is especially important to me.I have 25 years of teaching experience in computer science and establishing transnational education across the globe.  My passion for computer science stemmed from my school days and I believe it is our responsibility to inspire the next generation of students to be industry conscious and confident in their abilities.I have led improvements in teaching, student experience and achievement, curriculum transformation, student attainment, enhancing the transferrable skills of students, and I encourage colleagues to develop approaches to technology enhanced learning and processes.My research spans formal verification of secure systems, useable security and AI-assisted technologies. I am particularly interested in ensuring that security technology is accessible to older people. Expand biography University roles and responsibilities Head of School of Computer Science and Electronic Engineering Director of the Academic Centre of Excellence in Cyber Security Education (ACE-CSE) recognised by NCSC Member of Faculty Executive Board Member of University Academic Leaders ForumPrevious roles March 2015 - August 2020 Head of Department 2020 Athena Swan Lead for School achieving Bronze Award. University of Surrey 2014 Responsible for BCS validation 2011 - 2012 I was responsible for UCAS co-ordination and open days, and a member of the Department Policy and Strategy Group. 2008 - 2011 Undergraduate Director of Studies responsible for restructuring the undergraduate Computer Science programmes Expand previous roles Responsibilities outside of the UniversityCurrent rolesDirector (Education) of Surrey Academic Centre of Excellence in Cyber Education (ACE-CSE, Surrey received gold award from NCSC).Associate Editor ACM Computing Surveys.Governor Royal Grammar School Guildford.Previous rolesMSc External Examiner Southampton Solent University, Aberystwyth University (Wales), York University, Royal Holloway University of London.Surrey University membership of the Rail Research UK Association (RRUKA). Expand about tab additional information News 08 APR 2024Athena SWAN success for the School of Computer Science & Electronic Engineering 03 OCT 2023Surrey crowned Cyber University of the Year 05 AUG 2020Surrey celebrates 2020 student graduation success online ResearchResearch interestsMy established research is on the formal analysis of safe and secure systems with emphasis on intelligent transport systems and rail applications. More recently I have moved into the area of useable security that has both a technical and interdisciplinary focus so that my future research contributions in secure systems provide real-world impact. My current research is related to examining the adoption of security technologies for a diverse and ageing society and robust passwordless authentication technologies.Currently a co-I on an EPSRC for Verifiably Correct Swarm Attestation in collaboration with ARM Ltd, Thales td, NTU and SRI International Inc. We have developed a framework for describing security properties for describing swarm attestation properties and categories more than 40 existing protocols and assessed which properties are exhibited by these protocols. The research also includes modelling and analysing protocols using the TAMARIN prover. This research is in collaboration with Jay Le-Papin, Sharar Ahmadi, Brijesh Dongol and Liqun Chen.Currently with colleagues across the UK on £2.79m UKRI EPSRC grant, AP4L, on protecting citizens online with significant external engagement.  The team are looking at secure systems for support bubbles where the privacy of the participants in the bubbles are important and this is backed by the use of Distributed Ledger Technology for auditability. This research is collaboration with Nidhi Desai, Catalin Dragan, Steve Schneider, Ashley Fraser, Nishanth Sastry.I work collaboratively with colleagues to develop scalable solutions so that passwordless solutions which enable the creation of security credentials offer improved protection for the users. The challenges we are focusing are related to recovering credentials when devices are lost or when users transfer between devices. This research is in collaboration with Chris Culnane, Ioana Boureanu and Chris Newton.Recently led an NCSC project for the ACE CSE on Password Security and Phish Awareness for Older People working with 5 national charities.Work on useable security to support older people continues and keen to seek further discussions on this with charitable and external organisations. I am also very interested in security and privacy problems people with disabilities encounter in their daily lives. This research is in collaboration with Stella Kazamia, Chris Culnane, Dan Gardham. Expand research interests TeachingI teach on https://catalogue.surrey.ac.uk/2024-5/module/COM3017 our BSc in Computer Science programmes. I specialise in teaching risk management, threat modelling and also cover topics related to the emphasising that cyber security is the responsibility of everyone in an organisation.  My ethos in teaching is to ensure that students are prepared for industry. It is important that we  cover topics from a conceptual basis but that we also teach our students what are the current regulations and best practice out there in industry. The module on which I teach ensures that our students are prepared for industry. We have a number of guest speakers from industry on the course, from our own alumni that are working in the cyber industry, to industrial colleagues working in governance, risk and compliance to  digital forensics. I enjoy the group exercises it means that we can discuss risk management from a realistic perspective and seek input from different students as it is topic that spans a whole organisation and needs input from so many different stakeholders.As well as teaching on a module, I enjoy supervising students for their projects/dissertations. I currently supervise Data Science students and PhD students that span natural language processing and useable security.Seeing our students grow in confidence is wonderful and seeing them gain the skills that ensure what we teach is valuable out there in the real world is so inspiring as an educator.I have also led the strategic growth of computer science and electronic engineering in the school introducing new programmes and supporting a broad range of digital transformation projects. I have held a number of teaching leadership roles in my career including Director of Learning and Teaching, open day co-ordinator, Personal Tutor and was awarded teacher of the year at the University of Surrey in 2015.Over my many years of teaching I have taught:First year Java an introduced practical examinations. I thoroughly enjoyed seeing our first years develop their confidence in programming.Software Engineering (COM1028) covering the software lifecycle, testing etc. with many guest lectures from industry discussing the lifecycles they adopt. Over my 20 years of teaching I have seen this change to now be concerned with continuous development and integration and agile methodologies.Data Structures and Algorithms (COM1029).Modelling and Simulation using CSP and JCSP (COM2007) which links back to my PhD background in process algebra.All modules we teach at Surrey is supported using a VLE with an emphasis on practical work which provides a strong foundation for the transferable skills of our students. Expand my teaching PublicationsChris Culnane, Ioana Boureanu, Jean Snyman, Stephan Wesemeyer, Helen T",
  "content_length": 100697,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:37"
}