{
  "name": "Helena Galhardas",
  "homepage": "http://web.ist.utl.pt/helena.galhardas",
  "status": "success",
  "content": ". Home Page of Helena Galhardas Helena Galhardas Associate Professor Departament of Computer Science and Engineering Instituto Superior Técnico, University of Lisbon IST Tagus Park Av. Prof. Dr. Cavaco Silva 2744 - 016 Porto Salvo Portugal Phone: +351 21 423 32 46 Fax: +351 21 423 32 90 helena dot galhardas at tecnico dot ulisboa dot pt Areas of Research Data cleaning, Data quality, Information extraction, ETL (Extraction, Transformation, Loading) List of Publications (also available from DBLP) Citations available from Google Scholar profile CV PhD students Maria João Palaré (co-advised with Ana Isabel Lopes and Maria Céu Machado, Faculdade Medicina, Universidade Lisboa; started September 2024) João L. Pereira (co-advised with Dennis Shasha, New York University; graduated February 2023; current employment: Invited Professor University Evora, Portugal) Gonçalo F. Simões (co-advised with Luis Gravano, Columbia University; graduated June 2016; current employment: Software Engineer at Google London, UK) Emanuel Santos (co-advised with J. P. Martins, IST, Univ Lisboa; graduated July 2012; current employment: Invited Assistant Professor Faculty of Sciences, University of Lisbon) Paulo J. Carreira (co-advised by M. J. Silva, IST, Univ. Lisboa; graduated April 2008; current employment: Associate Professor Instituto Superior Técnico, University of Lisbon) Research unit INESC-ID Information and Decision Support Systems (IDSS) Scientific Area Research projects PiCaSSo: Pediatric Palliative Care Support System, funded by FCT (2025-26) LAIfeBlood: Artificial Intelligence for Blood Management, funded by FCT (past) Data2Help: Data Science for Optimization of Emergency Medical Services, funded by FCT (past) Umedicine: A System for Clinical Practice Support and Data Analysis (past) DataStorm: Large-Scale Data Management in Cloud Environments, funded by FCT (past) XML data cleaning, funded by the FLWOR Foundation (past) SInteliGIS: Services for Intelligent Geographical Information Systems, funded by FCT (past) gestBarragens funded by IAPMEI (past) XClean: XML data cleaning, with INRIA, funded by Program PESSOA GRICES (past) Prototypes REEL: RELationship Extraction Learning Framework Etxt2db: an entity recognition framework Medicine.Ask: an extraction and search system for medicine information Ajax: a declarative and extensible data cleaning prototype Teaching Currently on leave from teaching Last update November 2025",
  "content_length": 2442,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:37"
}