{
  "name": "Helen Yannakoudakis",
  "homepage": "https://www.kcl.ac.uk/people/helen-yannakoudakis",
  "status": "success",
  "content": "Helen Yannakoudakis | King's College London Skip to main contentDr Helen Yannakoudakis Senior Lecturer in Natural Language ProcessingResearch interestsComputer scienceContact details0207 848 8760helen.yannakoudakis@kcl.ac.ukBiographyHelen Yannakoudakis is a Senior Lecturer in Natural Language Processing in the Department of Informatics at King's College London. Helen is working on machine learning for natural language processing with a focus on few-shot learning, meta-learning, transfer and multi-task learning, lifelong learning, multilingual NLP, and societal and health applications (e.g. automated language teaching and assessment, abusive language and hate speech detection, misinformation, emotion and mental health detection). Helen is a Turing Fellow and a Fellow of the Higher Education Academy. She has received funding awards from both industry and academia, has served as a keynote speaker and a panelist, and has won international competitions such as the NeurIPS 2020 Hateful Memes Challenge. Among others, she has served as an Area Chair for ACL, NeurIPS, AAAI and ICLR. Helen holds a PhD in Natural Language Processing from the University of Cambridge.Research Interests Natural language processing Machine learning Further information Google Scholar Personal website PublicationsResearchResearchNatural Language ProcessingThe Natural Language Processing (NLP) Group at KCL is comprised of PhD and postdoctoral students, professors and others who are interested in solving computational problems related to the understanding of human languageHuman Centred Computing ResearchThe group is concerned with the design, development and evaluation of human computer systems.Computing Education Research Centre (CERC)The Computing Education Research Centre at King's College London carries out research, develops tools, conducts studies, creates pedagogy, and supervises PhD projects related to computer science education.NewsNews14 April 2025Digital Futures Institute announces eleven new Fellows for 2025-26Eleven interdisciplinary projects awarded Fellowships from the Digital Futures Institute for the 2025-26 cohort.Arts & CultureBusiness & FinanceHealthInternationalLawSocietyTechnology & Science01 March 2024King's AI researchers appointed as Turing Fellows to tackle societal challengesThree King's academics from the Department of Informatics have been named as Turing Fellows for 2024-25Technology & Science11 May 2022Making machines better learnersProfessor Helen Yannakoudakis from the Department of Informatics is working on the next generation of machine learning models for natural language processing...Technology & Science14 May 2021King's success in hateful memes challengeKing’s Lecturer in Computer Science, Dr Helen Yannakoudakis, was part of a team that enjoyed success in Facebook AI’s ‘Hateful Memes Challenge’ competition. Technology & ScienceEventsEvents02MayTuring @ King's02 May 2024 14:00 to 17:00Meet the new Turing Fellows from King’s, explore opportunities offered by The Alan Turing Institute, and connect with researchers across King’s who have taken...Please note: this event has passed.PublicationsResearchNewsEventsResearchNatural Language ProcessingThe Natural Language Processing (NLP) Group at KCL is comprised of PhD and postdoctoral students, professors and others who are interested in solving computational problems related to the understanding of human languageHuman Centred Computing ResearchThe group is concerned with the design, development and evaluation of human computer systems.Computing Education Research Centre (CERC)The Computing Education Research Centre at King's College London carries out research, develops tools, conducts studies, creates pedagogy, and supervises PhD projects related to computer science education.News14 April 2025Digital Futures Institute announces eleven new Fellows for 2025-26Eleven interdisciplinary projects awarded Fellowships from the Digital Futures Institute for the 2025-26 cohort.Arts & CultureBusiness & FinanceHealthInternationalLawSocietyTechnology & Science01 March 2024King's AI researchers appointed as Turing Fellows to tackle societal challengesThree King's academics from the Department of Informatics have been named as Turing Fellows for 2024-25Technology & Science11 May 2022Making machines better learnersProfessor Helen Yannakoudakis from the Department of Informatics is working on the next generation of machine learning models for natural language processing...Technology & Science14 May 2021King's success in hateful memes challengeKing’s Lecturer in Computer Science, Dr Helen Yannakoudakis, was part of a team that enjoyed success in Facebook AI’s ‘Hateful Memes Challenge’ competition. Technology & ScienceEvents02MayTuring @ King's02 May 2024 14:00 to 17:00Meet the new Turing Fellows from King’s, explore opportunities offered by The Alan Turing Institute, and connect with researchers across King’s who have taken...Please note: this event has passed.(S)5.07Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering SciencesComputing Education Research Centre (CERC)",
  "content_length": 5171,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:37"
}