{
  "name": "Helen Zhao 0001",
  "homepage": "https://jieqiongzhao.github.io",
  "status": "success",
  "content": "Jieqiong Zhao Jieqiong Zhao, Ph.D. Follow Augusta, GA, USA Email ResearchGate Github Google Scholar Curriculum VitaeI am currently a Tenure-Track Assistant Professor in the School of Computer and Cyber Sciences at Augusta University. Prior to this, I was a postdoc research associate in the VADER lab at the School of Computing and Augmented Intelligence (SCAI), Arizona State University, working under the guidance of Dr. Ross Maciejewski. I received my Ph.D. in Electrical and Computer Engineering from Purdue University, where I was mentored by Dr. David S. Ebert. I received a master’s degree in Computer Science from Tufts University in May 2013, under the mentorship of Dr. Remco Chang. My broad research interests include visual analytics, data visualization, human-computer interaction, and applied artificial intelligence and machine learning.I am actively looking for dedicated and passionate Ph.D. students with a research interest in data visualization, HCI, and human-AI trust. If you are driven by curiosity and a desire to innovate in these domains, I encourage you to reach out.Recent News[Oct 19, 2024] Fang Zhu’s paper ATVis was accepted at Visual Informatics.[Oct 16, 2024] At IEEE VIS 2024, the panel 20 Years of Visual Analytics celebrated two decades of progress by exploring the field’s evolution, impact, and future directions. I was one of the panel organizers.[Sep 2, 2024] Yixuan Wang’s paper A Simulation-based Approach for Quantifying the Impact of Interactive Label Correction for Machine Learning was accepted at IEEE TVCG.[Mar 20, 2024] Pouria Salehi’s paper Towards Trustworthy AI-Enabled Decision Support Systems:Validation of the Multisource AI Scorecard Table (MAST) was accepted at Journal of Artificial Intelligence Research.[Aug 24, 2023] I joined Augusta University as an assistant professor.[Jul 15, 2023] Rostyslav Hnatyshyn’s paper MolSieve was accepted at IEEE VIS 2023.[Feb 23, 2023] The paper Evaluating the Impact of Uncertainty Visualization on Model Reliance was accepted at IEEE TVCG.[Jul 17, 2020] I joined the VADER lab as a postdoc research associate at ASU in Tempe, AZ.[May 9, 2020] I received my Ph.D. degree in Electrical and Computer Engineering from Purdue University.[Jan 10, 2020] I presented the paper Route Packing at the HICSS-53 conference.[Oct 25, 2019] I presented the paper MetricsVis at the IEEE VIS 2019.[Oct 23, 2019] I presented the short paper FeatureExplorer at the IEEE VIS 2019.[Sep 11, 2019] The [Route Packing] paper was accepted at the HICSS-53 conference.[Aug 1, 2019] A short paper was accepted at IEEE VIS 2019 Short Papers, and it will be published in the IEEE VIS conference proceedings and IEEE Xplore.[Jul 8, 2019 ] Two papers were accepted at IEEE VIS 2019 VAST Papers, and they will be published as a special issue of IEEE Transactions on Visualization and Computer Graphics (TVCG).Recent Presentations MetricsVis: A Visual Analytics System for Evaluating Employee Performance in Public Safety Agencies MetricsVis is a visual analytics system that supports multi-attributes and multi-level data exploration. The system is designed for managers and supervisors who want to assess employee performance to improve the productivity of an organization. The users can compare the individual performance by inspecting multiple task categories, as well as aggregation of group performance and organizational performance. FeatureExplorer: Interactive Feature Selection and Exploration of Regression Models for Hyperspectral Images FeatureExplorer is a visual analytics system that supports the dynamic evaluation of regression models and identification of key features through the interactive selection of features in high-dimensional feature spaces typical of hyperspectral images. We collaborated with remote sensing experts and plant science to predict the plant biomass using hyperspectral features. The interactive system allows domain experts to iteratively refine and diagnose the model by selecting features based on their domain knowledge, interchangeable (correlated) features, feature importance, and the resulting model performance.",
  "content_length": 4123,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:36"
}