{
  "name": "Helen Nissenbaum [Tech]",
  "homepage": "https://nissenbaum.tech.cornell.edu",
  "status": "success",
  "content": "Helen Nissenbaum HELEN NISSENBAUM Professor, Cornell Tech Information Science Director, Digital Life Initiative HOME      /      PUBLICATIONS      /      COURSES      /      CV      /      BIO     /      ARCHIVE      /      CONTACT Links: Don't miss the latest research updates from the DLI community and beyond by exploring the exciting offerings within our newsletter. TrackMeNot: Privacy Through Obfuscation AdNauseam 3.0H. Nissenbaum,D. Howe andM. Zer-Aviv Books: Obfuscation: A User's Guide for Privacy and Protest, F. Brunton and H. Nissenbaum, (MIT Press, 2015). Values at Play in Digital Games, eds. H. Nissenbaum and M. Flanagan, (MIT Press, 2014). Privacy, Big Data and the Public Good, eds. J. Lane, V. Stodden, S. Bender and H. Nissenbaum, (Cambridge University Press, 2014). Modulated Cities: Networked Spaces, Reconstituted Subjects, Situated Technologies book series. Privacy in Context: Technology, Policy, and the Integrity of Social Life, Palo Alto, CA: Stanford University Press, Spanish translation Privacidad Amenazada. Academy and the Internet, Co-edited with M. Price. New York: Peter Lang Publishing Company, 2004. View Cover & Table of Contents. Computers, Ethics, and Social Values, Co-edited with D. Johnson. Englewood Cliffs, NJ: Prentice Hall, 1995. Emotion and Focus, Chicago: The University of Chicago Press, 1985. Available from the Center for the Study of Language and Informations. Annual Symposium on Applications of Contextual Integrity: 7th Annual Symposium on Applications of Contextual Integrity May 19-20 2025 6th Annual Symposium on Applications of Contextual Integrity September 27-28 2024 5th Annual Symposium on Applications of Contextual Integrity September 21-22 2023 Policy Briefs: Public Comment for FTC's Commercial Surveillance ANPR with Ido Sivan-Sevilla and Patrick Parham Stewardship of Privacy or Private Capture of a Public Value - a Note On Google's Sandbox/FLoC Proposal: Comments Submitted to UK-CMA with Lee McGuigan Test of AdNauseam: Test of AdNauseam: It Works Lee McGuigan Jan 6, 2021 MIT Technology Review Selected Articles: Countering Privacy Nihilism with S. Engelmann The Great Regulatory Dodge with K. Strandburg & S. Viljoen AI Safety: A Poisoned Chalice? Algorithmic Displacement of Social Trust with B. Laufer Op Ed: The Seductive Diversion of 'Solving' Bias in Artificial Intelligence with J. Powles Contextual Integrity Up and Down the Data Food Chain Big Data's End Run around Anonymity and Consent, with S. Barocas. Engineering Privacy and Protest: A Case Study of AdNauseam, with D. Howe. Sustaining both Privacy and Open Justice in the Transition to Online Access to Court Records: A Multidisciplinary Inquiry, with A. Conley, A. Datta, and D. Sharma. From Preemption to Circumvention: If Technology Regulates Why Do We Need Regulation (and Vice Versa)? A Contextual Approach to Privacy Online On Notice: The Trouble with Notice and Consent, with S. Barocas. Facial Recognition Technology: A Survey of Policy and Implementation Issues, with L. Introna. Terms of Service: A Play in One Act, presented at The Symposium on Information Intermediaries in the Information Society Will Security Enhance Trust Online, or Supplant It? New Research Norms for a New Medium Email Helen NissenbaumNeed Help? Web-Master",
  "content_length": 3282,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:34"
}