{
  "name": "Helen C. Shen",
  "homepage": "http://repository.ust.hk/ir/AuthorProfile/shen-helen-c-m",
  "status": "success",
  "content": "Shen, Helen Chi Man - Publications - HKUST SPD | The Institutional Repository Shen, Helen Chi Man (沈志汶) Emeritus CWB Asso Prof Emeritus, Department of Computer Science and Engineering Email: helens@ust.hk Scopus: 7404523044 Publications Bibliometrics Research Interests Publication Timeline Last update: 2025-12-01 01:00:00 Publication List Showing 1 - 20 results of 83 Export 0 items: ( Export all ) to: Email CSV ORCID 1 2 3 4 5 Next » [5] Article Linear Neighborhood Propagation and Its Applications Author(s): Wang, Jingdong ; Wang, Fei ; Zhang, Changshui ; Shen, Helen C. ; Quan, Long Source: IEEE transactions on pattern analysis and machine intelligence, v. 31, (9), 2009, SEP, p. 1600-1615 Article, 2009 Personal authentication using hand images Author(s): Kumar, Ajay ; Wong, David C.M. ; Shen, Helen C. ; Jain, Anil K. Source: Pattern recognition letters, v. 27, (13), 2006, OCT 1, p. 1478-1486 Article, 2006 Personal identification and verification: Fusion of palmprint representations Author(s): Poon, C. ; Wong, DCM ; Shen, HC Source: Lecture Notes in Computer Science, v. 3072, 2004, p. 782-788 Article, 2004 Personal verification using palmprint and hand geometry biometric Author(s): Kumar, A. ; Wong, DCM ; Shen, HC ; Jain, AK Source: Lecture Notes in Computer Science, v. 2688, 2003, p. 668-678 Article, 2003 Multiple hypotheses testing method for distributed multisensor systems Author(s): Shen, HC ; Wang, XG Source: Journal of intelligent & robotic systems, v. 30, (2), 2001, FEB, p. 119-141 Article, 2001 Entropy-Based Markov Chains for Multisensor Fusion Author(s): Chung, Albert Chi Shing ; Shen, Helen Chi Man Source: Journal of Intelligent and Robotic Systems: Theory and Applications, v. 29, (2), October 2000, p. 161-189 Article, 2000 Interdependence and information loss in multi-sensor systems Author(s): Basir, O. ; Shen, HC Source: Journal of robotic systems, v. 16, (11), 1999, NOV, p. 597-612 Article, 1999 Computer modeling, analysis, and synthesis of dressed humans Author(s): Jojic, N. ; Gu, J. ; Shen, HC ; Huang, TS Source: IEEE transactions on circuits and systems for video technology, v. 9, (2), 1999, MAR, p. 378-388 Article, 1999 Texture representation and classification: The feature frequency matrix approach Author(s): Shen, H.C. ; Srivastava, D. Source: Advances in Imaging and Electron Physics, v. 95, (C), 1996, p. 387-407 Article, 1996 An extended cellular automaton model for flexible manufacturing systems Author(s): Shen, HC ; Chau, HL ; Wong, KK Source: The International Journal of Advanced Manufacturing Technology, v. 11, (4), 1996, p. 258-266 Article, 1996 Representing the Colour Aspect of Texture Images Author(s): Scharcanski, J. ; Hovis, J.K. ; Shen, Helen C. Source: Pattern Recognition Letters, v. 15, (2), 1994, p. 191-197 Article, 1994 Face Recognition Using Perspective Invariant Features Author(s): Kamel, M.S. ; Shen, Helen C. ; Wong, A.K.C. ; Hong, T.M. ; Campeanu, R.I. Source: Pattern Recognition Letters, v. 15, (9), 1994, p. 877-883 Article, 1994 Hierarchical Maximum Entropy Partitioning in Texture Image Analysis Author(s): Bie, C.Y.C. ; Shen, Helen C. ; Chiu, D.K.Y. Source: Pattern Recognition Letters, v. 14, May 1993, p. 421-429 Article, 1993 Intelligent Sensory Decision-Making for Error Identification in Autonomous Robotic Systems Author(s): Shen, Helen C. ; Yan, W.P. ; Taylor, G.E. Source: International Journal of Advanced Manu-facturing Technology, v. 8, 1993, p. 377-384 Article, 1993 Colour Quantisation for Colour Texture Analysis Author(s): Scharcanski, J. ; Shen, Helen C. ; Alves da Silva, A.P. Source: IEE Proceedings-E: Computer and Digital Techniques, v. 140, (2), March 1993, p. 109-114 Article, 1993 A Texture Distance Measure for Classification Author(s): Shen, Helen C. ; Bie, C.Y.C. ; Chiu, D.K.Y. Source: Pattern Recognition, v. 26, (9), 1993, p. 1429-1437 Article, 1993 A New Approach for Aggregating Multisensory Data Author(s): Basir, O.A. ; Shen, Helen C. Source: Journal of Robotic Systems, v. 10, (8), December 1993, p. 1075-1093 Article, 1993 System for the Recognition of Human Faces Author(s): Kamel, M.S. ; Shen, Helen C. ; Wong, A.K.C. ; Campeanu, R.I. Source: IBM Systems Journal, v. 32, (2), 1993, p. 307-320 Article, 1993 Feature Frequency Matrices as Texture Image Representation Author(s): Shen, Helen C. ; Bie, C.Y.C. Source: Pattern Recognition Letters, v. 13, March 1992, p. 195-205 Article, 1992 Modelling Autonomous Assembly Systems and FMS Using Cellular Automata Author(s): Shen, Helen C. ; Yan, W.P. Source: International Journal of Advanced Manufacturing Technology, v. 7, 1992, p. 333-338 Article, 1992 1 2 3 4 5 Next » [5] Limit to Type Any type Conference paper Article Book chapter Year of Publication From To Sort by Year Descending Year Ascending Title Ascending Title Descending Cited count from WOS Cited count from Scopus Links Create my ORCID iD Contact us × Email selected publications To: From: Close Send × Loading...",
  "content_length": 4958,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:33"
}