{
  "name": "Helen C. Purchase",
  "homepage": "https://research.monash.edu/en/persons/helen-purchase",
  "status": "success",
  "content": "Helen Purchase - Monash University View Scopus Profile Helen Purchase Professor Professor, Department of Human Centred Computing https://orcid.org/0000-0001-6994-4446 EmailHelen.Purchasemonashedu Accepting PhD StudentsPhD projectsNetwork drawings: static, dynamic, applied. Investigating strategies for user-centred depiction of relational data. Infographics/graphic design for public communication - especially for public health. Cognitive and perceptual approaches to understanding visual communication 1995 …2024 Research activity per year Personal profile BiographyProfessor Helen Purchase received her PhD from Cambridge University in October 1992. Her PhD research entailed invsestigating the use of schematic (network-based) representations within an intelligent tutoring system for teaching ontological concepts to primary school children. Prior to her PhD, she completed an MPhil in Computer Speech and Language Processing, also at Cambridge University. Her undergraduate studies were undertaken at Rhodes University, South Africa. Following her PhD, Professor Purchase was appointed as a Lecturer at the Department of Computer Science (now the School of Information Technology and Electrical Engineering) at the University of Queensland, where she was promoted to Senior Lecturer in 1998. She was awarded a UQ Teaching Excellence Award in 1999. At the University of Queensland, Professor Purchase introduced a new undergraduate course in Human-Computer Interaction and an Honours course in Advanced HCI, at a time when few universities recognised the importance of bringing this previously research-focussed topic into the curriculm. She introduced student peer-review activities and flipped classrooms into both her HCI and Artificial Intelligence courses at UQ. She joined the Department of Computing Science at the University of Glasgow in 2001, taking on the role of Director of the MSc(Information Technology) postgraduate degree. While holding the MSc Director position for most of her time at Glasgow, Professor Purchase introduced several diffent MSc degree programmes of varying flavours and scope, and saw the total number of MSc students more than quadruple during her time there. She was awarded a University of Glasgow Teaching Excellence Award in 2011, and Senior Fellowship of the Higher Education Academy in 2015. Moving to Monash University in August 2022, Professor Purchase has joined the Department of Human-Centred Computing in the Faculty of Information Technology. She is Director of the Data Visualisation and Immersive Analytics lab and Director of Education for the HCC Department. Research interests Professor Purchase's research has predominantly focussed on the human understanding of visual stimuli. She pioneered the idea of conducting human experiments to determine the most appropriate way to draw graphs (networks) in 1995, and has continued in taking an empirical approach to the design and comprehension of to a range of visual stimuli - for example, photographs, biological and social networks, web pages, mobile phone icons, sets etc. Her book \"Experimental Human-Computer Interaction\" (CUP, 2012) uses her own experiences as an empirical researcher to introduce key principles in information visualisation experimental design. She has also published several papers on topics relating to the use of Educational Technology across a range of subjects, in particular in the area of student peer-review. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 1995 2002 2010 2011 2012 2014 2018 2024 63 Conference Paper 34 Article 4 Foreword / Postscript 2 Chapter (Book) 4 More 2 Review Article 1 Book 1 Editorial Research output per year Research output per year 3D Remote Monitoring and Diagnosis during a Pandemic: Holoportation and Digital Twin RequirementsRufai, K. A., Smiley, J., Reuter, P., Bain, C., Chan, P., Ens, B. & Purchase, H., 20 Oct 2024, In: Proceedings of the ACM on Human-Computer Interaction. 8, ISS, p. 407-426 20 p.Research output: Contribution to journal › Article › Research › peer-review Open Access 3 Citations (Scopus) Extending Adjacency Matrices to 3D with TrianglesPan, R., Purchase, H. C., Dwyer, T. & Chen, W., 2024, Proceedings - 2024 IEEE 17th Pacific Visualization Conference, PacificVis 2024. Nonaka, J. (ed.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 232-241 10 p. (IEEE Pacific Visualization Symposium).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) Impact of interaction technique in interactive data visualisations: A study on lookup, comparison, and relation-seeking tasksvan Berkel, N., Tag, B., Jacobsen, R. M., Russo, D., Purchase, H. C. & Buschek, D., Dec 2024, In: International Journal of Human Computer Studies. 192, 13 p., 103359.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 3 Citations (Scopus) The Multi-Dimensional Landscape of Graph Drawing MetricsMooney, G. J., Purchase, H. C., Wybrow, M. & Kobourov, S. G., 2024, Proceedings - 2024 IEEE 17th Pacific Visualization Conference, PacificVis 2024. Nonaka, J. (ed.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 122-131 10 p. (IEEE Pacific Visualization Symposium).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 7 Citations (Scopus) The Perception of Stress in Graph DrawingsMooney, G. J., Purchase, H. C., Wybrow, M., Kobourov, S. G. & Miller, J., 2024, 32nd International Symposium on Graph Drawing and Network Visualization, GD 2024. Felsner, S. & Klein, K. (eds.). Saarbrücken/Wadern Germany: Schloss Dagstuhl, 21. (Leibniz International Proceedings in Informatics, LIPIcs; vol. 320).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 1 Citation (Scopus) View all 107 research outputs",
  "content_length": 6575,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:32"
}