{
  "name": "Helger Lipmaa",
  "homepage": "http://kodu.ut.ee/~lipmaa",
  "status": "success",
  "content": "Helger Lipmaa Contact: http://kodu.ut.ee/~lipmaa/ <firstname.lastname>gmail.com I am a professor at the Computer Science Department of the University of Tartu, Estonia, where I am head of the Chair of Security and Theoretical Computer Science. I lead the cryptography group. Top Links Curriculum Vitae Publications Work Professor at the University of Tartu, leading research and teaching in the field of security and theoretical computer science. My group focuses on a wide range of cryptographic research. Research Projects Modern Cryptographic Techniques (PRG2531) Foundations of Secure Digital Solutions and Artificial Intelligence (TEM-TA119) Old Research Projects Program Committees Past Committees Presentations List of talks on YouTube (by me and my ex-group members). Teaching Zero-Knowledge Proofs (last time: 2025 Autumn) Past teaching activities PhD Students Current PhD Students Erki Külaots Urmas Luhaäär Pritam Pal (joint supervision with Janno Siim) Previous PhD Students Sven Laur (Ph.D. 2008, now Associate Professor at University of Tartu) — Google Scholar Bingsheng Zhang (Ph.D. 2012, now Professor at Zhejiang University) — Google Scholar Prastudy Fauzi (Ph.D. 2017, now Research Fellow at Nanyang Technological University) — Google Scholar Rafik Chaabouni (Ph.D. 2017, now Head of IT Security at Rothschild & Co Bank AG) — Google Scholar Janno Siim (Ph.D. 2020, now lecturer at University of Tartu) --- Google Scholar Karim Baghery (Ph.D. 2020, now Postdoc at KU Leuven) — Google Scholar Behzad Abdolmaleki (Ph.D. 2020, now Assistant Professor at the University of Sheffield) — Google Scholar Arne-Tobias Odegaard (Ph.D. 2022, now Postdoc at NSM) — Google Scholar Roberto Parisella (Ph.D. 2023, now Postdoc at Simula UiB) — Google Scholar Old students Hobbies MSX — my high school hobby Go Varia Fast AES Implementations (historical interest) Estonian, Finnish, Norwegian, and Latvian Computer Scientists The first version of my homepage was created on June 30, 1994. Nowadays, I am not updating it so often.",
  "content_length": 2029,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:43"
}