{
  "name": "Helge Fredriksen",
  "homepage": "https://uit.no/ansatte/helge.fredriksen",
  "status": "success",
  "content": "Fredriksen, Helge | UiT Helge.fredriksen – Institutt for informatikk | UiT Gå til hovedinnhold Enheten Ansatte Helge Fredriksen Førsteamanuensis Institutt for informatikk helge.fredriksen@uit.no +4776966957 90972759 Bodø Helge Fredriksen Om Forskning og undervisning CV Stillingsbeskrivelse Vitenskaplig ansatt ved UiT-Bodø, der instituttet tilbyr master i informatikk. Jeg har et spesielt fokus på maskinlæring, generativ kunstig intelligens og dyp læring generelt. Jeg veileder master og phd-studenter innen området, og samarbeider tett med industri, offentlig virksomhet og andre akademiske institusjoner i inn- og utland. Se min akademiske hjemmeside https://helgeingvart.github.io/ for mer detaljer. Vitenskapelige arbeidsområder Datateknologi / Annen informasjonsteknologi / Algoritmer og beregnbarhetsteori / Systemutvikling og -arbeid / Simulering / visualisering / signalbehandling / bildeanalyse Arbeider i Cristin Vitenskapelige artikler og bokkapitler Andre Andreas Berntsen Løvland, Helge Fredriksen, John Markus Bjørndalen : Predicting the destination port of fishing vessels utilizing transformers Maritime Transport Research 2025 DOI / ARKIV Helge Ingvart Fredriksen, Ragnhild Johanne Rensaa : Data note for gender perspectives on a flipped classroom environment Cogent Education 2024 DOI / ARKIV Helge Ingvart Fredriksen, Josef Rebenda, Ragnhild Johanne Rensaa, Petter Pettersen : Inquiry-Based Linear Algebra Teaching and Learning in a Flipped Classroom Framework: A Case Study PRIMUS - Problems, Resources, and issues in mathematics undergraduate studies 2024 DOI / ARKIV Helge Ingvart Fredriksen, Per Joel Burman Burman, Ashenafi Zebene Woldaregay, Karl Øyvind Mikalsen, Ståle Haugset Nymo : Categorization of phenotype trajectories utilizing transformers on clinical time-series 2024 DOI / ARKIV Helge Ingvart Fredriksen, Simon Goodchild, Ninni Marie Hogstad, Shaista Kanwal, Ida Maria Landgärds, Yannis Liakos m.fl.: Early Developments in Doctoral Research in Norwegian Undergraduate Mathematics Education 2022 DOI Ragnhild Johanne Rensaa, Helge Fredriksen : Gender perspectives on a flipped classroom environment Cogent Education 21. september 2022 DOI / ARKIV Bjørn Tore Esjeholm, Helge Fredriksen : Utvikling av digitale læringsressurser for forkurs for ingeniørutdanning på tvers av studiesteder Nordic Journal of STEM Education 2021 DOI / ARKIV Helge Fredriksen : Exploring Realistic Mathematics Education in a Flipped Classroom Context at the Tertiary Level International Journal of Science and Mathematics Education 01. februar 2020 DOI / ARKIV Matt K. Voigt, Helge Fredriksen, Chris Rasmussen : Leveraging the design heuristics of realistic mathematics education and culturally responsive pedagogy to create a richer flipped classroom calculus curriculum ZDM: Mathematics Education 06. januar 2020 DOI Helge Fredriksen, Said Hadjerrouit : Exploring engineering students’ participation in flipped mathematics classroom: A discursive approach NOMAD – Nordisk matematikkdidaktikk 2020 FULLTEKST Helge Fredriksen : Investigating the affordances of a flipped mathematics classroom from an activity theoretical perspective Teaching Mathematics and its Applications 2020 DOI / ARKIV / FULLTEKST Helge Fredriksen, Said Hadjerrouit : An activity theory perspective on contradictions in flipped mathematics classrooms at the university level International Journal of Mathematical Education in Science and Technology 2019 DOI Helge Fredriksen : Analysing tasks for the Flipped Classroom from the perspective of Realistic Mathematical Education International Network for Didactic Research in University Mathematics : INDRUM 2018 Helge Fredriksen, Said Hadjerrouit, John David Monaghan, Ragnhild Johanne Rensaa : Exploring Tensions in a Mathematical Course for Engineers utilizing a Flipped Classroom Approach 2017 ARKIV / FULLTEKST Helge Fredriksen, Said Hadjerrouit : USING THE FLIPPED CLASSROOM MODEL OF INSTRUCTION TO EXPLORE TEACHING AND LEARNING ACTIVITIES IN MATHEMATICAL EDUCATION FOR ENGINEERS: AN ACTIVITY THEORY PERSPECTIVE International Network for Didactic Research in University Mathematics : INDRUM 2016 Helge Fredriksen : A case study of an experiment using streaming of lectures in teaching engineering mathematics Teaching Mathematics and its Applications 2015 DOI Helge Fredriksen : Utprøving av nettforelesninger i matematikkundervisningen for ingeniørstudenter - Et innovasjonstiltak i riktig retning? 2013 SAMMENDRAG / OMTALE Helge Fredriksen : Matematikkundervisning for studenter via nettet: Empiri 2012 Helge Ingvart Fredriksen : Digitalisering innen havbruk - Hvor er forskningsfronten? 2024 Helge Ingvart Fredriksen : Clustering multivariate time series: The case of sparsly sampled series at irregular time-intervals. Detecting adverse events utilizing vital signs registrations from hospitalized patients. 2023 Helge Ingvart Fredriksen : Approaching adverse event detection utilizing transformers on clinical time-series. Utilizing vital signs registrations from hospitalized patients to cluster phenotypical behaviour in latent space. 2023 Helge Ingvart Fredriksen, Asal Asgari, Ståle Haugset Nymo : Clustering clinical multivariate time-series with variable lengths and irregularsampling intervals. 2023 Helge Fredriksen : Exploring mathematics teaching and learning at the university level utilizing the Flipped Classroom framework: A socio-cultural approach 2022 Helge Fredriksen, Arthur Schuchter : Segmentation of costa in 2d MRI scans utilizing the U-Net convolutional network architecture 2022 Helge Fredriksen, Chris Rasmussen, Emma Howard, Birgit Pepin, Johanna Rämö : Students’ in-class and out-of-class mathematical practices 2021 Helge Fredriksen, Josef Rebenda : Combining inquiry-based learning with flipped classroom teaching of linear algebra in a digital environment 2021 Bjørn Tore Esjeholm, Helge Fredriksen : Utvikling av digitale læringsressurser for forkurs for ingeniørutdanning på tvers av studiesteder 2021 Helge Fredriksen, Arthur Schuchter : Segmentation of costa in 2d MRI scans utilizing the U-Net convolutional network architecture 2021 Chris Rasmussen, Helge Fredriksen, Emma Howard, Birgit Pepin, Johanna Rämö : Students’ in-class and out-of-class mathematical practices 2021 Helge Fredriksen : An exploration of teaching and learning activities in mathematics flipped classrooms : A case study in an engineering program Universitetet i Agder 2020 ARKIV Helge Fredriksen : Correction to: Exploring Realistic Mathematics Education in a Flipped Classroom Context at the Tertiary Level (International Journal of Science and Mathematics Education, (2020), 10.1007/s10763-020-10053-1) International Journal of Science and Mathematics Education 2020 DOI Helge Fredriksen : An exploration of teaching and learning activities in flipped mathematics classrooms for engineers 2018 Helge Fredriksen : Analyzing tasks for the Flipped Classroom from the perspective of Realistic Mathematical Education 2018 Helge Fredriksen : Analysing tasks for the Flipped Classroom from the perspective of Realistic Mathematical Education 2018 Werner Farstad, Helge Fredriksen : Samkjøring av undervisning for campus, fjerncampus og nettstudenter, praktiske erfaringer 2018 Helge Fredriksen : Utilizing commognition as a framework for exploring engineering students´ participation in mathematics discourse in a Flipped Classroom environment 2017 Mathew Voigt, Helge Fredriksen : Designing a Richer Flipped Classroom Calculus Experience 2017 Helge Fredriksen, Matt K. Voigt, Tor Martin Lien : Turning the teaching of maths on its head 2016 Helge Fredriksen : Experimentation with web lectures as part of the mathematics education for engineering students 2014 Helge Fredriksen : Mathematics Teaching on the Web for Student Teachers: Action Research in Practice 2013 Helge Fredriksen : Didactical practices of mathematics: a comparative study between primary schools in northern Russian and northern Norwegian 2012 Helge Fredriksen : Matematikkundervisning for GLU1 5-10 studenter via nettet; Empiri 2011 De 50 siste resultatene fra Cristin vises på siden. Se alle arbeider i Cristin her → Forskningsinteresser Deltar i forskningsgruppa: Health Data Lab Maskinlæring Informatikk Undervisning FYS-2021: Maskinlæring INF-3600: Generative Artificial Intelligence ORCID: https://orcid.org/my-orcid?orcid=0000-0002-3974-9583 Forskning og undervisning Medlem i forskningsgruppe Matematikk- og realfagsdidaktikk Medlem i prosjekt Improved resource control of fisheries using deep learning CV Se akademisk hjemmeside på https://helgeingvart.github.io/",
  "content_length": 8593,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:42"
}