{
  "name": "Helge Pfeiffer",
  "homepage": "https://pure.itu.dk/portal/en/persons/helge-pfeiffer(51cfa226-5179-4a05-aa13-4a53f8de6404).html",
  "status": "success",
  "content": "Helge Pfeiffer - IT-University of Copenhagen Helge Pfeiffer Associate Professor, Software EngineeringDanish Institute for IT Program ManagementResearch Centre for Government IT Emailropfitudk 20102024 Research activity per year Personal profile KeywordsSoftware EngineeringSoftware Quality and MetricsTechnical DebtDevOpsDependency ManagementReverse Engineering Fingerprint Dive into the research topics where Helge Pfeiffer is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Software Systems Computer Science 100% Software Evolution Computer Science 47% Language Development Computer Science 47% Multi-language Keyphrases 47% Development Environment Computer Science 45% Software Development Computer Science 42% Software System Keyphrases 37% Refactoring Computer Science 37% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2010 2012 2014 2021 2022 2024 2024 12 Article in proceedings 6 Journal article 1 Conference article 1 PhD thesis Research output per year Research output per year On the Energy Consumption of CPythonPfeiffer, H., 11 Sept 2024, Quality of Information and Communications Technology: 17th International Conference on the Quality of Information and Communications Technology, QUATIC 2024, Pisa, Italy, September 11–13, 2024, Proceedings. Springer, Vol. 2178. p. 194-209 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Tools for monitoring software quality in information systems development and maintenance: five key challenges and a design proposalPfeiffer, H. & Aaen, J., Mar 2024, In: International Journal of Information Systems and Project Management. 12, 1, p. 19-40 22 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Software Quality 100% quality of software 100% information system development 100% System Maintenance 100% Monitoring Software 100% Live Is Life: Teaching Software Engineering on Live SystemsPfeiffer, H., Lungu, M. & Tell, P., 5 Sept 2023, In: I E E E Software. 40, 6, p. 117-125 8 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open AccessFile Software System 100% Project Work 100% Software Evolution 100% Student Projects 100% DevOps 100% Can Git Repository Visualization Support Educators in Assessing Group Projects?Lungu, M., Pfeiffer, H., D'Ambros, M., Lanza, M. & Findhal, J., 2022, Proceedings of the 2022 Working Conference on Software Visualization (VISSOFT). IEEEResearch output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open Access Educators 100% Group Projects 100% Software Systems 100% Software Engineering 100% Visualization Tool 100% DaSEA – A Dataset for Software Ecosystem AnalysisBuchkova, P., Hey Hinnerskov, J., Olsen, K. & Pfeiffer, H., 2022, MSR '22: Proceedings of the 19th International Conference on Mining Software Repositories. IEEE, p. 388-392 Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Open AccessFile View all 20 research outputs Projects Projects per year 2012 2012 2018 2022 2027 1 Active 2 Finished Projects per year FCOIT: Research Centre for Government ITSchmidt, J. (PI), Dupont, C. (CoI), Østergaard Madsen, C. (CoI), Pfeiffer, H. (CoI), Skaarup, S. (Collaborator), Kjærsgaard Hansen, M. E. (Collaborator) & Alami, A. (Collaborator)Digitaliseringsstyrelsen01/01/2018 → 31/12/2021Project: Research Research Centre 100% Government IT 100% Villum Kann Rasmussen ProfessorshipSchmidt, J. (PI), Flyvbjerg, B. (PI), Madsen, C. Ø. (CoI), Pfeiffer, H. (CoI), Lithén, J. C. L. (Admin), Gandrup, N. (Collaborator), Petersson, C. (Collaborator), Aaen, J. (CoI), Ouriques, R. A. B. (CoI) & Ajazi, F. (CoI)Villum Foundation01/01/2022 → 31/12/2027Project: Research Professorship 100% IT Project Management 50% Bent Flyvbjerg 50% Program Management 50% IT Program 50% GTTSE/SLE Students' workshop Best Presentation AwardPfeiffer, H. (PI)Software Improvement Group ApS17/10/2012 → 12/09/2013Project: Research Datasets Replication Kit for paper \"Tools for Monitoring Software Quality in Information Systems Development and Maintenance: Five Key Challenges and a Design Proposal\"Pfeiffer, H. (Creator), ZENODO, 23 Jan 2024DOI: 10.5281/zenodo.10556441, https://zenodo.org/records/10556441Dataset DaSEA - Dataset for Software Ecosystem Analysis 05-22-2022Hey Hinnerskov, J. (Creator), Olsen, K. (Creator) & Pfeiffer, H. (Creator), ZENODO, 22 May 2022DOI: 10.5281/zenodo.6570427, https://zenodo.org/record/6570427Dataset What constitutes software? An Empirical, Descriptive Study of Artifacts - Reproduction DatasetPfeiffer, H. (Creator), ZENODO, 9 Mar 2020DOI: 10.5281/zenodo.3701443, https://zenodo.org/record/3701443Dataset DaSEA - Dataset for Software Ecosystem Analysis 03-18-2022Buchkova, P. (Creator), Hey Hinnerskov, J. (Creator), Olsen, K. (Creator) & Pfeiffer, H. (Creator), ZENODO, 18 Mar 2022DOI: 10.5281/zenodo.6369420, https://zenodo.org/record/6369420Dataset Identifying Critical Projects via PageRank and Truck Factor - Reproduction Code and DataPfeiffer, H. (Creator), ZENODO, 19 Mar 2021DOI: 10.5281/zenodo.4621650, https://zenodo.org/record/4621650Dataset: Software",
  "content_length": 5778,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:43"
}