{
  "name": "Helmer Strik",
  "homepage": "https://www.ru.nl/english/people/strik-w",
  "status": "success",
  "content": "Dr W.A.J. Strik (Helmer) | Radboud University Dr W.A.J. Strik (Helmer) Former employee - Department of Language and Communication Former employee - Centre for Language Studies Contact helmer.strik@ru.nl 024-3616104 To LinkedIn To X Personal profile Personal profile Personal profile Visiting address Erasmusplein 1 6525 HT NIJMEGEN Postal address Postbus 9103 6500 HD NIJMEGEN Working days Monday morning, Tuesday morning, Wednesday morning, Thursday morning, Friday morning Topics: Speech Science, Phonetics, Acoustics, Language and Speech Technology (L&ST), Computer Assisted Language Learning (CALL), e-Learning, e-Health..Helmer Strik received his PhD in Physics, and is now Associate Professor in Speech Science and Technology at the Dept. of Linguistics of the Radboud University Nijmegen. He is initiator, co-founder and Chief Scientific Officer (CSO) of the spin-off company NovoLanguage. His research activities address speech processing, automatic speech recognition (ASR), spoken dialogue systems, computer assisted language learning (CALL), e-Learning, and e-Health. He has published over 200 refereed papers. He has obtained numerous national and international research project grants (see http://hstrik.ruhosting.nl/projects/). Tags: Speech science, Phonetics, Acoustics, Language and Speech Technology (L&ST), Computer Assisted Language Learning (CALL), e-Learning, e-Health. Publications Publication lists Radboud Repository Research Information Services (RIS) See http://hstrik.ruhosting.nl/publications/ + URLs on that webpage Research grants and prizes 2021 - NWO Open Competition Grant project: Advanced speech technology and learning analytics for child personalized reading education 2020 - European Regional Development Fund project: Speech Technology for virtual Care Assistant & Reading Tutor 2018 - NWO ‘DATA2PERSON – Big Data & Health’ project:Behaviour-based Language-Interactive Speaking Systems 2018 - NWO ‘Nationaal Regieorgaan Onderwijsonderzoek’ (NRO) project: An ASR-based reading tutor. 2017 - EU H2020-MSCA-ITN-2017 project TAPAS: Training network on Automatic Processing of PAthological Speech Teaching Courses Bachelor Term Paper Master's Thesis Ancillary activities Chair International Speech Communication Association (ISCA) ‘Special Interest Group’ (SIG) on ‘Speech and Language Technology in Education’ (SLaTE) (01 January 2015) International Speech Communication Association (ISCA) Initiator, co-founder, and Chief Scientific Officer (CSO) of NovoLanguage (01 January 2015) NovoLanguage Founder (01 December 2021) Strik.LandS About Helmer Strik conducts research into the speech of language learners and people with people with communicative disabilities, and into the development and use of apps that employ advanced language and speech technology. He is the initiator of NovoLanguage, which develops apps for language learning.",
  "content_length": 2872,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:43"
}