{
  "name": "Helmut Krcmar",
  "homepage": "http://www.professoren.tum.de/en/krcmar-helmut",
  "status": "success",
  "content": "Krcmar_Helmut Prof. Dr. Helmut Krcmar Professorship Computer science in economics Professor emeritus since October 1, 2020 Department Informatics Contact Details Visitenkarte in TUMonline Academic Career and Research Areas Prof. Dr. Dr. h.c. Helmut Krcmar (*1954) is a German Information Systems and Management scholar. He conducts research in the fields of digital transformation, information and knowledge management, platform-based ecosystems, management of IT-based services, e-government and computer-supported collaboration.Helmut Krcmar studied business administration at the Universität des Saarlandes, where he later received a Ph.D. (1984). From 1987 to 2002 he held the Chair for Information Systems at the Universität Hohenheim. 2002 he was appointed to the Chair for Information Systems at TUM, which he held until 2020. Today, he leads the Krcmar Lab at the TUM School of Computation, Information and Technology. In addition, he has a joint appointment to the TUM School of Management. He is Founding Dean and Delegate Officer of the President for TUM Campus Heilbronn. Curriculum Vitae Awards Honorary doctorate (Dr. oec. h.c.) awarded by the University of St. Gallen (2024)Federal Cross of Merit on Ribbon (2023)TUM Emeritus of Excellence (2021)1st place in the WirtschaftsWoche ranking of the strongest research professors in business administration in German-speaking countries (2019)AIS Best Information Systems Publications Award (2017)Fellow of the Association for Information Systems (2016) Key Publications (all publications)Pflügler C, Becker N, Wiesche M, Krcmar H: \"Strategies for Retaining Key IT Professionals\". MIS Quarterly Executive. 2018; 17(4): 297-314. Link.AbstractWiesche M, Jurisch M, Yetton PW, Krcmar H: \"Grounded Theory Methodology in Information Systems Research\". MIS Quarterly. 2017; 41(3): 685-702.Abstract Schermann M, Dongus K, Yetton P, Krcmar H: \"The Role of Transaction Cost Economics in Information Technology Outsourcing research: A Meta-Analysis of the Choice of Contract Type\". The Journal of Strategic Information Systems. 2016; 25(1): 32-48.AbstractKrcmar H: Informationmanagement. Heidelberg: Springer-Verlag, 2016. AbstractLeimeister JM, Huber M, Bretschneider U, Krcmar H: \"Leveraging Crowdsourcing: Activation-Supporting Components for IT-Based Ideas Competition\". Journal of Management Information Systems. 2009; 26 (1): 197-224.Abstract If you wish your profile to be changed or updated please contact Franz Langer. Attention: JavaScript deactivated Please activate JavaScript to be able to use all website functions such as site search!",
  "content_length": 2598,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:43"
}