{
  "name": "Helmut Prendinger",
  "homepage": "https://www.nii.ac.jp/en/faculty/digital_content/prendinger_helmut",
  "status": "success",
  "content": "PRENDINGER Helmut - Digital Content and Media Sciences Research Division - Faculty - Research - å½ç«æ å ±å­¦ç ç©¶æ / National Institute of Informatics ACCESS CONTACT æ¥æ¬èª About NII Introduction Greeting from the Director-General Mission & Strategies Overview of NII History Administrative Council Organization Charts Intellectual Properties Staff / Budget Outline and Catalogue of National Institute of Informatics PR Video International Exchange International Exchange based on MOU Conclusion of International Exchange Agreements or MOUs NII International advanced lectures series on ICT NII Shonan Meeting Global Liaison Office (GLO) - DAAD Alumni NII Library NII Library Usage Guide(For General Public) NII Library Accessing databases via GakuNin International Seminar House for Advanced Studies Advanced ICT Center Publications NII Today PR Video Recruitment Access National Institute of Informatics (National Center of Sciences) Kashiwa Annex International Seminar House Contact News Event Link Sitemap Research Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division Information Systems Architecture Science Research Division Digital Content and Media Sciences Research Division Information and Society Research Division Directory of Faculty and Staff index Professor Emeritus Major Project Involvement Kakenhi Human Resource Development Top SE Experts in Information Science Quantum Technology Education:A New Approach Collaborative Research Promotion Collaboration with Industry, Government, and Academia Research Results Progress in Informatics NII Technical Reports Service Network SINET6 Research Data Cloud GakuNin RDM JAIRO Cloud CiNii Research CiNii Books IRDB Authentication Infrastructure GakuNin eduroam JP UPKI Notice of Authentication Service Maintenance Cloud GakuNin Cloud GakuNin Cloud Adoption Support Service GakuNin Cloud Gateway Service GakuNin Cloud On-Demand Configuration Service SINETStream Information Security NII Security Operation Collaboration Services (NII-SOCS) Princess Rinrin's information security column Scholarly Communication NACSIS-CAT/ILL E-resources Data Sharing Services KAKEN NII-REO Collaboration Collaboration with University Libraries Japan Alliance of University Library Consortia for E-Resources Future Scholarly Information Systems Committee Japan Consortium for Open Access Repository SPARC Japan Research Data Ecosystem Development Project to Promote the Use of AI HPCI mdx Academic Information Infrastructure Open Forum Human Resource Development GakuNin LMS Education and Training Services NII JMOOC | gacco Experts in Information Science Computer Science Park Graduate Program Research Research Faculty Digital Content and Media Sciences Research Division PRENDINGER Helmut Digital Content and Media Sciences Research Division PRENDINGER Helmut Digital Content and Media Sciences Research Division, Professor Research Fields: Artifical Intelligence, Deep Learning, Intelligent Drone Degrees: Ph.D. Detail: http://researchmap.jp/helmut/ Introduction A sky full of drones -- how to keep them separated I am applying artificial intelligence to air traffic control for UAVs, as well as to other exciting new applications. Unmanned aerial vehicles (UAVs, or drones) have enormous potential in many applications, including delivery, surveillance, communications, disaster relief, wildlife management and more. Look out below! But as the skies become crowded with drones, the possibility of collisions becomes a serious issue, especially in urban areas, where they could pose a danger to people below. I have been applying my research in artificial intelligence (AI) to the problem. The key is \"conflict detection and resolution\" (CDR). Before the drone takes off, the system projects the possibility of collision, and \"de-conflicts\" by delaying the drone or changing its route. When the drones are already in flight, to avoid a collision, the system decides what to do -- reroute, change altitude or what have you. There are so many operations going on at the same time, with multiple individual vehicles of different sizes, speeds, routes and altitudes, it becomes a multi-agent pathfinding problem. When the area is crowded with hundreds or thousands of vehicles already in the air, if you use a first-come-first-served system, it could be a long wait for a drone to be processed and integrated into the airspace. The solution is batch processing -- the system computes a solution for a group of drones, which are then injected into the airspace together. This affords much greater throughput -- the number of vehicles that can go smoothly through the space -- thus reducing congestion. The method is also quickly scalable, which could be crucial after a disaster, for example, when a small area might be flooded with drones, which would have to be processed quickly. Deep learning in Okutama To test the system in a real world setting, I needed a real world area for field testing the system, and I found enthusiastic interest from the government of Okutama, a mountainous and rural part of Tokyo. For many places in rural Japan, UAVs make sense. For instance, after a disaster, roads might be blocked, so drones could be used for carrying food and medicine, as well as for communications and damage assessment. Okutama's enthusiasm enabled me to investigate deep learning applications, which allow for situational awareness by drones. We developed a dynamic map to see what's going on on the ground. We wanted to automatically detect and categorize the actions of people, such as reading, drinking, pushing, carrying, running, walking and so on. The input is an image and the output is a label or semantic segmentation. The drone flies over and determines what is on the ground -- house, paved area, vegetation, water, etc. The map can be used for damage assessment, by comparing images. For example, if there was a house there and now there isn't, you can conclude that the house was destroyed. Assessments can be done extremely quickly and accurately. There is also potential in wildlife control. They have a lot of monkeys in Okutama, and they have to keep them away from people. The drones can recognise them and shoo them away by flashing lights. Given the current progress in drones and AI, you can expect a revolution in the sky, as drones equipped with AI capability come to an airspace near you -- very soon. Interviewed and summarized by Robert Cameron View research contents with researchmap ãã¤ã¼ã Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division FUJII Kaito HIRAHARA Shuichi KAWARABAYASHI Ken-ichi KOBAYASHI Taisuke KUROIWA Ryo MATSUMOTO Keiji SATO Ryoma SHIGAKI Shunsuke SOEDA Akihito SUGIYAMA Mahito TAKEDA Hideaki TATSUTA Makoto UNO Takeaki WATANABE Kazuki WELLNITZ Philip YOSHIDA Yuichi Information Systems Architecture Science Research Division AIDA Kento AOKI Shunsuke FUJIWARA Ikki FUKUDA Kensuke GOSHIMA Masahiro HASUO Ichiro ISHIKAWA Fuyuki JI Yusheng KANEKO Megumi KATO Hiroyuki KITAGAWA Naoya KOIBUCHI Michihiro KURIMOTO Takashi SAKANE Eisaku SATO Hiroyuki SEKIYAMA Taro SHIMIZU Sayako TAKAKURA Hiroki TAKEFUSA Atsuko Digital Content and Media Sciences Research Division AIZAWA Akiko ANDRES Frederic ASANO Yuta HUANG Lang IKEHATA Satoshi KANAZAWA Teruhito KATAYAMA Norio KITAMOTO Asanobu KODAMA Kazuya KOMIYAMA Yusuke KOYAMA Shoichi KURITA Shuhei MO Hiroshi PRENDINGER Helmut SATO Imari SATOH Shin'ichi SUGAWARA Saku SUGIMOTO Akihiro TAKASU Atsuhiro YAMAGISHI Junichi YAMAJI Kazutsuna Information and Society Research Division ARAI Noriko BONO Mayumi ECHIZEN Isao FUNAMORI Miho FURUKAWA Masako GOTODA Hironobu KANDO Noriko KATAOKA Hiroshi KATO Makoto MIZUNO Takayuki NISHIZAWA Masaki OKADA Hitoshi SANO takiko SATOH Ichiro SUN Yuan UEKI Kouichirou Directory of Faculty and Staff index Research staff Other research staff Professor Emeritus Major Project Involvement Kakenhi Human Resource Development Top SE Experts in Information Science Quantum Technology Education Collaborative Research Promotion Collaboration with Industry, Government, and Academia Research Results Progress in Informatics NII Technical Reports SPECIAL Overview of NII 2025 Summary of NII 2024 NII Today No.104(EN) NII Today No.103(",
  "content_length": 10455,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:44"
}