{
  "name": "Helwig Hauser",
  "homepage": "https://vis.uib.no/team/hauser",
  "status": "success",
  "content": "Helwig Hauser – Visualization Research Group Helwig Hauser HomeTeam Helwig Hauser Professor Visualization Head Team Hauser Helwig.Hauser@UiB.no +47 555 84 380 HiB, room 311O2 Helwig Hauser graduated from Vienna University of Technology, Austria, in 1995 with the degree of a ''Dipl.-Ing.'' (~MSc) in computer science. In 1998, after research on flow visualization, he received the degree of a ''Dr.techn.'' (~PhD) from the same university (see below for a link to the thesis). He worked as a teaching assistant, then as an assistant professor at the Institute of Computer Graphics [1] at Vienna University of Technology from 1994 until 2000. Afterwards, Helwig Hauser joined the newly founded VRVis Research Center [2], also in Vienna, Austria, as a key researcher in visualization. In 2003, he became the scientific director of VRVis [2]. In 2004, Helwig Hauser was entitled a ''Privatdozent'' at the Vienna University of Technology after his successful Habilitation (see below for a link to the thesis). Also in 2004, he won the IEEE Visualization 2004 Contest (together with H. Doleisch and Ph. Muigg), based on an interactive visual analysis of hurricane Isabel with SimVis [3]. In 2006, he was awarded with the prestigous Heinz Zemanek Award [4] for this work. Since 2007, Helwig Hauser is professor at the University of Bergen, Norway, where he is leading the research group on visualization [5]. During the first four years, the group grew to a size of 15 researchers, working on projects in medical visualization, the visualization of geological data and models, flow visualization, the visualization of biological data, marine data visualization, and others. Since then, the group is continously contributing to the field (see, for example, the publications of the Bergen VisGroup). In May 2013, at the Eurographics conference in Girona, Spain, Helwig Hauser - together with his colleagues I. Viola et al. - received the Dirk Bartz Prize for Visual Computing in Medicine (Eurographics Medical Prize) for research on high-quality 3D visualization of in-situ ultrasonography [6]. Helwig Hauser's interests are diverse in visualization and related fields, including interactive visual analysis, illustrative visualization, and the combination of scientific and information visualization, as well as many other related topics. Helwig Hauser is also particularly interested in the application of visualization to the fields of medicine, geoscience, climatology, biology, engineering, and others. Related links (theses of Helwig Hauser): Habilitation of Helwig Hauser, entitled ”Generalizing Focus+Context Visualization” (PDF, 152 pages, dated Dec., 2003), together with the related supplement (PDF, 100 pages, dated Dec., 2003) Dissertation (PhD thesis) of Helwig Löffelmann, entitled ”Visualizing Local Properties and Characteristic Structures of Dynamical Systems” (PDF, 130 pages, dated Nov., 1998 – note that H. Hauser was named H. Löffelmann before his marriage in 1999) Related links (cited from the short biography above): [1] Home page of the Institute of Computer Graphics and Algorithms at the Vienna University of Technology in Austria [2] Home page of the VRVis Research Center in Vienna, Austria [3] Home page of the IEEE Visualization 2004 Contest at the IEEE CS and our entry [4] Home page of the Heinz Zemanek Award, given every two years to one outstanding research work in CS or a related field, Hall of Fame [5] Home page of the visualization group at the Dept. of Informatics, Univ. of Bergen, Norway [6] Home page of the Dirk Bartz Prize, given every second year for outstanding CG contributions to medicine, 2014 Hall of Fame Lecturing VisFoundations (INF250) course about the foundations of data-oriented visual computing (end of Bachelor, beginning of Master). Computer Graphics (INF251) course about computer graphics which is designed for the end of the UiB Bachelor study program in computer science and which acts as a preliminary for the UiB Master study program on visualization. Visualization (INF252) course about visualization which is central to the UiB Master study program on visualization. Project in Visualization (INF219)programming project in visualization, embedded within the UiB Master study program on visualization. Selected publs. 2007-2015 (filtered list, all) Interactive Visual Analysis of Large Simulation Ensembles by Kr. Matković, D. Gračanin, M. Jelović, H. Hauser. Proc. Winter Simulation Conference 2015: 517-528, 2015 The State-of-the-Art of Set Visualizationby B. Alsallakh, L. Micallef, W. Aigner, H. Hauser, S. Miksch, P. Rodgers. Computer Graphics Forum, 2015 Expressive Seeding of Multiple Stream Surfaces for Interactive Flow Exploration by A. Brambilla & H. Hauser. Computers & Graphics 47: 123-134, 2015 Interactive Visual Steering of Hierarchical Simulation Ensembles by R. Splechtna, Kr. Matković, D. Gračanin, M. Jelović, H. Hauser. Proc. IEEE VAST:89-96 Interactively Illustrating Polymerization using Three-level Model Fusion by I. Kolesár, J. Parulek, I. Viola, St. Bruckner, A.-Kr. Stavrum, H. Hauser. BMC Bioinformatics 15:345-360, 2014 Attribute Signatures: Dynamic Visual Summaries for Analyzing Multivariate Geographical Databy Ç. Turkay, A. Slingsby, H. Hauser, J. Wood, J. Dykes. IEEE Trans. Vis. & Computer Graphics 20(12):2033-2042, 2014 Characterizing Cancer Subtypes Using Dual Analysis in Caleydo StratomeX by Ç. Turkay, A. Lex, M. Streit, H. Pfister, H. Hauser. IEEE Computer Graphics & Applications 34(2):38-47, 2014 Visual Methods for Analyzing Probabilistic Classification Data by B. Alsallakh, A. Hanbury, H. Hauser, S. Miksch, A. Rauber. IEEE Trans. Vis. & Computer Graphics20(12):1703-1712, 2014 Visual Analytics for Complex Engineering Systems: Hybrid Visual Steering of Simulation Ensembles by Kr. Matković, D. Gracanin, R. Splechtna, M. Jelović, B. Stehno, H. Hauser, W. Purgathofer. IEEE Trans. Vis. & Computer Graphics 20(12):1803-1812, 2014 Interactive Visual Analysis of Heterogeneous Cohort Study Data by P. Angelelli, St. Oeltze, Ç. Turkay, J. Haász, E. Hodneland, A. Lundervold, A. J. Lundervold, B. Preim, H. Hauser. IEEE CG & Appls. 34(5):70-82, 2014 Radial Sets: Interactive Visual Analysis of Large Overlapping Sets by B. Alsallakh, W. Aigner, S. Miksch, and H. Hauser. IEEE Trans. Vis. & Computer Graphics19(12):2496-2505, 2013 Hypothesis Generation by Interactive Visual Exploration of Heterogeneous Medical Databy Ç. Turkay, A. Lundervold, A. J. Lundervold, and H. Hauser.Lecture Notes in Computer Science 7947:1-12, 2013 (often cited) High-Quality 3D Visualization of In-Situ Ultrasonography by I. Viola, Å. Birkeland, V. Šoltészová, L. Helljesen, H. Hauser, Sp. Kotopoulis, K. Nylund, D. M. Ulvang, O. Kr. Øye, Tr. Hausken, O. H. Gilja. Dirk Bartz Prize of Eurographics 2013, pp. 1-4, 2013 Geological Storytelling by E. Lidal, M. Natali, D. Patel, H. Hauser, I. Viola. Computers & Graphics 37(5):445-459, 2013 Visualization and Visual Analysis of Multifaceted Scientific Data: A Survey by J. Kehrer and H. Hauser.IEEE Trans. Vis. & Computer Graphics 19(3):495-513, 2013 (often cited) Representative Factor Generation for the Interactive Visual Analysis of High-Dimensional Data by Ç. Turkay, A. Lundervold, A. J. Lundervold, and H. Hauser. IEEE Trans. Vis. & Computer Graphics 18(12):2621-2630, 2012 Interactive Visual Exploration and Analysis of Multivariate Simulation Data by H. Doleisch and H. Hauser. Computing in Science Engineering 14(2):70-77, 2012 Scientific Storytelling Using Visualization by Kw.-L. Ma, I. Liao, J. Frazier, H. Hauser, and H.-N. Kostis. IEEE Computer Graphics and Applications 32(1):12-19, 2012 Straightening Tubular Flow for Side-by-Side Visualization by P. Angelelli and H. Hauser. IEEE Trans. Vis. & Computer Graphics 17(12):2063-2070, 2011 Brushing Dimensions – A Dual Visual Analysis Model for High-dimensional Data by Ç. Turkay, P. Filzmoser, and H. Hauser. Computer Graphics Forum29(3):813-822, 2011 Energy-scale Aware Feature Extraction for Flow Visualization by A. Pobitzer, M. Tutkun, Ø. Andreassen, R. Fuchs, R. Peikert, and H. Hauser. Computer Graphics Forum30(3):771-780, 2011 Interactive Visual Analysis of Temporal Cluster Structures by Ç. Turkay, J. Parulek, N. Reuter, and H. Hauser. Computer Graphics Forum 30(3):711-720, 2011 Curve Density Estimates by O. D. Lampe and H. Hauser.Computer Graphics Forum 30(3):633-642, 2011 The State of the Art in Topology-based Visualization of Unsteady Flow by A. Pobitzer, R. Peikert, R. Fuchs, B. Schindler, A. Kuhn, H. Theisel, Kr. Matković, and H. Hauser. Computer Graphics Forum30(6):1789-1811, 2011 Interactive Visual Analysis of Contrast-enhanced Ultrasound Data based on Small Neighborhood Statistics by P. Angelelli, K. Nylund, O. H. Gilja, and H. Hauser. Computers & Graphics 35(2):218-226, 2011 Interactive Visual Analysis of Heterogeneous Scientific Data across an Interface by J. Kehrer, Ph. Muigg, H. Doleisch, and H. Hauser. IEEE Trans. Vis. & Computer Graphics 17(7):934-946, 2011 Interactive Visual Analysis of Multiple Simulation Runs using the Simulation Model View: Understanding and Tuning of an Electronic Unit Injector by Kr. Matković, D. Gračanin, M. Jelović, A. Ammer, A. Lež, and H. Hauser. IEEE Trans. Vis. & Computer Graphics16(6):1449-1457, 2010 Brushing Moments in Interactive Visual Analysisby J. Kehrer, P. Filzmoser, and H. Hauser. Computer Graphics Forum 29(3):813-822, 2010 Toward a Lagrangian Vector Field Topologyby R. Fuchs, J. Kemmler, B. Schindler, J. Waser, F. Sadlo, H. Hauser, and R. Peikert. Computer Graphics Forum29(3):1163-1172, 2010 On the Way Towards Topology-Based Visualization of Unsteady Flow – the State of the Art by Ar. Pobitzer, R. Peikert, R. Fuchs, B. Schindler, A. Kuhn, H. Theisel, Kr. Matković, and H. Hauser. Eurographics 2010 State-of-the-Art Proceedings, pp. 137-154, 2010 Curve-Centric Volume Reformation for Comparative Visualization by O. Daae Lampe, C. Correa, Kw.-L. Ma, and H. Hauser. IEEE Trans. Vis. & Computer Graphics 15(6):1235-12",
  "content_length": 286625,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:47"
}