{
  "name": "Hemangee K. Kapoor",
  "homepage": "http://www.iitg.ac.in/hemangee",
  "status": "success",
  "content": "Hemangee Kapoor : Homepage Dr. Hemangee K. Kapoor Professor (HAG) of CSE Member of ACM DEI council Ex-Associate Dean Alumni and External Relations Ex-Associate Dean Students Affairs Contact Address : Department of CSE Indian Institute of Technology Guwahati, Guwahati (Assam), Pin. 781 039, India. Tel: +91 (0)361 258 2363 Fax: +91 (0)361 269 2787 Email: hemangee [at] iitg [dot] ac [dot] in Education Ph.D. (Computer Science) : London South Bank University, UK M. Tech. (Computer Science and Engineering) : IIT Bombay, India B.E. (Computer Engineering) : Govt. College of Engineering, Pune, India Research Aswathy successfully defended her thesis on 24-Feb-2025. The examiners praised her work I received the ACM India Outstanding Contributions in Computing by a Woman (OCCW) Award 2024 Prof. Hemangee Kapoor is being recognized \"for her contributions to emerging nonvolatile memory technologies and her active leadership and involvement in the mentoring of women in the field.\" My CACM viewpoint article co-auhtored with Prof. David Patterson appears in April 2024 issue Click here to read My current research interests include: Multiprocessor Computer Architecture Emerging Memory Technologies Near Data Processing Networks-on-Chip Design Power Aware Computing A link to my summarising talk on Computer Architecture course: Click here Current Professional Activities Vice President, ACM-India for: 2020-2022 Member of the ACM council for Diversity, Equity, and Inclusion ACM-DEI for 2022- till date Editorial Board, IEEE Design & Test Editorial Board, Elsevier Journal of Systems Architecture Member of the Steering Committee of IEEE Transactions on Sustainable Computing, as a representative of IEEE Computer Society for two terms: 2019-20 and 2021-22: IEEE-TSUSC Associate Dean Alumni and External Relations Achivements and Honours The ACM India Outstanding Contributions in Computing by a Woman, ACMI-OCCW award for 2024 Senior Member of the IEEE, Senior Member of the ACM, A Council Member of ACM-India for two terms: 2014-2018 and 2018-2022 Member of the Executive Committee of Smart India Hackathon 2019 under MHRD's Innovation Cell: SIH-2019 Technical Program Co-Chair, IEEE International Symposium on Smart Electronic Systems, (IEEE-iSES-2024) Here is a list of my publications and project students Sponsored projects: Title: \"Improving Privacy, Integrity and Availability for Durable and Secure Emerging Non-Volatile Memories\" Agency: DST-ANRF Core Research Grant Duration: 2024-27 (3 years) Title: \"ALAMNI: Adaptive LookAside Memory based Near-data Inference engine for eliminating multiplications in real-time\" Agency: Intel under PhD Fellowship Program Duration: 2020-21 (1 year) Title: \"Reducing Cache Access Time in Tiled Chip MultiProcessors\" Agency: DIT Duration: 2013-17 (3.5 years) Title: \"Advanced embedded systems laboratory\" Agency: Intel Duration: 2012-14 (2 years) Objective: Curriculum development for the hardware lab using the Intel Atom kits Title: \"Formal Approach to design of latency-insensitive systems\" Agency: Department of Science and Technology, Govt. of India Duration: 2009-12 (3 years) Ph.D. Students Completed Shirshendu Das (Jan 2011 - Jan2016) : (Assistant Professor at IIT Hyderabad) Effective Utilization of LLCs by Managing Associativity, Placement and Mapping Shounak Chakraborty (Jan 2012 - Feb 2018) : (ERCIM Fellow at NTNU, Trondheim, Norway) Energy and Thermal Management of CMPs by Dynamic Cache Reconfiguration Sukarn Agarwal (July 2014 - March 2020) : (Postdoc at University of Edinburgh, UK) LiNoVo: Longevity Enhancement of Non-Volatile Caches by Placement, Write-Restriction & Victim Caching in CMPs Sanjay Moulik (Jan 2014 - March 2020) : Assistant Professor at IIIT Guwahati (joint student with Dr. Arnab Sarkar) New Approaches to Energy and Temperature Aware Scheduling Techniques for Real-time Multi-core Systems Khushboo Rani (July 2017 - Jan 2021) (++Postdoc at NUS Singapore) LongLiveNoC: Wear Levelling, Write Reduction and Selective VC allocation for Long lasting Dark Silicon aware NoC Interconnects Palash Das (July 2015 - April 2022) (Assistant Professor at IIT Jodhpur) Near-Memory acceleration of Convolutional Neural Networks by exploiting Parallelism, Sparsity, and Redundancy Sheel Sindhu Manohar (Jan 2016 - Dec 2022) (Assistant Professor at Shiv Nadar University) Content and Coherence Based Strategies for Optimizing Refreshes in Volatile Last Level Caches Arijit Nath (July 2016 - Sep 2023) (Assistant Professor at Indian Institute of Information Technology Guwahati) Enhancing Endurance of NVMs by Coarse-To-Fine Grained Write Reduction and Intra-line Wear Leveling Aswathy N. S. (July 2018 - Feb 2025) Scheduling Policies for Improving Performance, Utilisation, and Longevity of DRAM and PCM Memories On-going Imlijungla Longchar (July 2019--) Swati Upadhyay (July 2020--) Neeraj Sharma (joint student) (Jan 2021--) Rishabh Mahanta (July 2021 --) Post-Doc Sonal Yadav (PhD MNIT Jaipur) (May 2018--March 2020) : (++) Assistant Professor at NIT Raipur Events I have been involved in organising the following events: Smart India Hardware Hackathon (SIHH), 18 - 22 June 2018, Institute Coordinator from IIT Guwahati Smart India Hackathon, SPOC from IIT Guwahati :: website Regional GCCS Hackathon 9-10 Nov. 2017, IIT Guwahati :: Schedule Nodal Officer at IIT Guwahati for \"Ek Bharat Shreshtha Bharat\" :: Schedule Celebration of Women in Computing East and North-East, 2-3 Nov. 2015: ACMW2015 Deadlines: Extended abstract submission: 24 Sep. 2015. Registration: 10 Oct. 2015 VLSI Design and Test Symposium, May 2016: VDAT 2016 KIC-TEQIP Workshop on Recent Advances in Computer Architecture: June 2016 1-week event with lectures and hands-on lab sessions: RACA16 Application deadline: 29, Feb 2016. Teaching Recent courses: Winter 2024 UG (CS223) : Computer Organisation and Architecture Autumn 2023 UG (CS221) : Digital Design and some older courses ... Misc...",
  "content_length": 5937,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:46"
}