{
  "name": "Hema A. Murthy",
  "homepage": "http://www.cse.iitm.ac.in/~hema",
  "status": "success",
  "content": "Hema's Home Page Hema A Murthy Professor Emeritus (Hon) Research Areas: Speech Processing, Speech Synthesis, Music information retrieval, Music Processing, Computational brain research, any area that involves machine learning and signal processing Education: Ph.D., Computer Science and Engineering, IIT Madras, 1992 M.Eng, Electrical and Computer Engineering, McMaster University,Canada, 1986 B.E., Electronics and Communcation Engineering, Osmania University, 1980 Associated Labs: Speech Music and Vision Lab Research Scholars (current): T Anand (PhD, co-guide: Manikandan N -- CSE Dept) Gowriprasad (PhD, co-guide: R Aravind) -- EE Dept) Saish Jaiswal (PhD, co-guide: Manikandan N -- CSE Dept) Research Scholars (completed) PhD: Anusha Prakash, ``End-to-End Speech Synthesis Systems for Indian Languages,'' (Guides: S Umesh, EE Dept, Hema A Murthy, CSE Dept), 2024. Venkatasubramanian Viraraghavan, \"Automatic descriptive transcription of Carnatic Music,\" (R Aravind, EE Dept, Hema A Murthy, CSE Dept, Arpan Pal, TCS Research) PhD Thesis, 2022. Karthik Pandia D S, \"Unsupervised Acoustic Unit Discovery and its applications to Speech Technology,\" PhD Thesis 2022. Rini A Sharon, ``Neural decoding of speech-equivalents from scalp-recorded electroencephalogram,''(Guides: Umesh S, Hema A Murthy) PhD Thesis, 2022. Mari Ganesh Kumar, ``Subspace Based Methods for Processing Brain Signals,'' PhD Thesis, 2021. Ashish Mishra, ``A new approach for the classification of novel class objects in the Zero-Shot Learning Framework,'' PhD Thesis, 2021. Nauman Dawalatabad, ``Novel Methods for Unsupervised Information Bottleneck based Speaker Diarization'', (Guides: Hema A Murthy, C Chandra Sekhar) PhD Thesis, 2021. Jeena J Prakash, \"Transcription correction and rhythm analysis for applications in text to speech synthesis forIndian languages,\" PhD Thesis, 2020. M S Saranya, \"Feature Switching a new paradigm for speaker recognition and spoof detection,\" (Guides: Hema A Murthy, IIT Madras R Padmanabhan, IIT Mandi), PhD Thesis, 2020. Jilt Sebastian, ''Novel Methods for Time-Event Detection and Source Separation,'' Ph.D Thesis, 2019. Golda Brunet Rajan, ``Transcription correction using signal processing and its application to continuous speech recognition,'' PhD Thesis 2018. Rajeev Rajan, ``Estimation of Pitch in Speech and Music Signals Using Modified Group Delay Functions,'' PhD Thesis, IIT Madras, 2017. Saad Y Sait, ``Organizational level control of abusive traffic,'' (Guides: Hema A Murthy, S Krishna Sivalingam), PhD Thesis, IIT Madras, 2017. Padi Sarala, ``Applause identification and its application to archival of Carnatic Music,'' PhD Thesis, April 2015. M R Srikanth, ``Speaker verification and keyword spotting for forensic applications,'' PhD Thesis, Dec 2013. R Padmanabhan, ``Studies on voice activity detection and feature diversity for Speaker Recognition,'' Ph.D Thesis, IIT Madras, 2012. S Ranbir Singh ``On the significance of crawling, clustering and real-time implicit feedback in web search engines,'' (Guides: Hema A Murthy, T A Gonsalves) Phd Thesis, 2010. Rajesh Hegde, ``The Modified Group Delay feature and its application to Speech Recognition,'' Ph.d Thesis,IIT Madras, 2005. T. Nagarajan, ``Implicit Spoken Language Identification Systems,'' Ph.d Thesis, IIT Madras, 2004. V Kamakshi Prasad, ``Segmentation and Recognition of Continuous Speech,'' Ph.D Thesis, IIT Madras, 2002. Research Scholars (completed) MS: Sudhanshu Srivasatava, ``Hybrid Speech Synthesis Systems for Indian Languages,'' (Guides: C Chandra Sekhar, Hema A Murthy), MS Thesis, 2025. Ishika Gupta, ``Data Augmentation for Expressive Speech Synthesis,'' (Guides: C Chandra Sekhar, Hema A Murthy) MS Thesis 2024. Mano Ranjith Kumar, \"Exploration of isochronous lip-syncing techniques for transcreating lecture videos,\" MS Thesis, 2023. Bhagyashree Mukherjee, \"Towards Cross-lingual voice conversion for conversational speech,\" MS Thesis, 2023. Sidharth Aggarwal, ``Analysis of EEG signals for building Brain Computer Interface Systems,'' MS Thesis, 2021. Anju Leela Thomas, ``Code Switching in Indic Speech Synthesisers,\" submited May 2020. Srihari Maruthachalam, \"Artifacts analysis in EEG and its applications in building brain-computer interfaces,\" submitted Feb 2020. P V Krishnaraj Sekhar, ``Technology assisted archival and learning of varnams in Carnatic music,'' MS Thesis, 2019. Arun Baby, ``A unified approach to speech synthesis in Indian languages,'' MS Thesis, 2019. Sridharan Sankaran, ``Segmentation of Music Items: A Computational Perspective,'' M S Thesis, IIT Madras, 2017. Anusha Prakash, ``Cross-lingual Speech Synthesis and Enhancement of Dysarthric Speech,'' (co-Guide, Prof. Ramasubba Reddy, Applied Mechanics), M S Thesis, 2017. Shreya Khare, ``Multimedia Content Analysis And Its Application For Sound Source Localisation,'' M S Thesis, 2017. Asha T, ``Relevance of front-end processing in Speaker Recognition,'' MS Thesis, IIT Madras, 2016. Shrey Dutta, ``Analysis of Motifs in Carnatic Music: A Computational Perspective,'' M S Thesis, IIT Madras, 2016. Akshay Bhandari, ``Feature extraction for anomaly detection,'' M S Thesis, IIT Madras, 2016. Aswin S Shanmugam, ``A HYBRID APPROACH TO SEGMENTATION OF SPEECH USING SIGNAL PROCESSING CUES AND HIDDEN MARKOV MODELS,'' M S Thesis, IIT Madras, 2016. Raghava Krishnan, ``PROSODIC ANALYSIS OF INDIAN LANGUAGES AND ITS APPLICA- TIONS TO SPEECH SYNTHESIS,'' M S Thesis, IIT Madras, 2016 (Guides: S. Umesh, EE Dept, Hema A Murthy CSE Dept) Ashwin Bellur, ``Automatic identification of tonic in Indian classical music,''(Guides: R Aravind, EE Dept, Hema A Murthy, CSE Dept) MS Thesis, January 2014. Chaitanya Kumar, ``Information theoretic measures to incorporate multiple feature streams in the linguistic search space for automatic speech recognition,'' MS Thesis, 2013 (Hema A Murthy, C Chandra Sekhar). Subhadeep Dey, ``Universal syllable models for language identification,'' MS Thesis, IIT Madras, 2013. Santosh Kumar Chaudhari, ``Green IT: Energy efficient techniques for network management for core networks and data centers,'' MS Thesis, IIT Madras, 2013. Cyriac James, ``Relevance of time series in network traffic modeling: In the context of TCP SYN DOS attacks,'' M S Thesis, IIT Madras, 2012. Rajesh Janakiraman, ``Syllable Segmentation and its Application to Syllable-centric Continuous Speech Recognition,'' M.S Thesis, IIT Madras, 2012 (Guides:Hema A Murthy, C Chandra Sekhar). Nikhil Ranjan ``GARCH Models for TCP Based Denial of Service,'' (Guides: Hema A Murthy, T A Gonsalves) M S Thesis, 2010. P R Ramya, ``Incorporating acoustic feature diversity in linguistic search space for speech recognition,'' (Guides: C S Ramalingam, EE Dept, Hema A Murthy) MS Thesis, 2009. Sadhana Chevireddy, ``A syllable-based segment vocoder,'' (Guides: C Chandra Sekhar, Hema A Murthy), MS Thesis, 2009. Y R Venugopalakrishna, ``Methods for improving the quality of syllable-based speech synthesis for Indian languages,'' (Guides: C S Ramalingam, EE Dept, Hema A Murthy) MS Thesis, IIT Madras, 2009 P G Deivapalan, ``A Segmented Syllable-based, Isolated Word Recognizer for Indian Languages,'' M S Thesis, 2009. Pranav Hamnabhadkar, ``Pattern Recognition and Synthesis of Materials Microstructures,'' (Guides: Dr. K Balasubramanian, Director, NFTDC, Hyderabad, Hema A Murthy) MS Thesis, 2009. Sreenivasulu Nagireddy, ``A Pattern Recognition Approach to Block Cipher Identification,''(Guides: Hema A Murthy, C Chandra Sekhar), MS Thesis, IIT Madras, 2009. M Kasirajan, ``Patram: A unified word processing system for handwritten character recognition in Indian languages,'' (GUides:Srinivasa Chakravarthy, Dept of BT, Hema A Murthy), MS Thesis, IIT Madras, 2008. P Sreehari Krishnan, ``Voice activity detection using group delay functions,'' M S Thesis, IIT, Madras, 2007. A Lakshmi, ``A Syllable-based approach to continuous speech recognition inIndian languages,'' (Guides: C S Ramalingam, EE Dept, Hema A Murthy) M S Thesis, IIT, Madras, 2007. Samuel Thomas, ``Natural sounding Text-to-speech synthesis based on syllable-like units,'' (Guides: Hema A Murthy, C Chandra Sekhar) M S Thesis, IIT, Madras, 2007. Dinil Mon Divakaran, ``Traffic Modeling and Analysis,'' (Guides: TA Gonsalves, Hema A Murthy) M S Thesis, IIT, Madras, 2007. P Manohar, ``The Multimodal Interaction for the Computer: An Application independent Approach,'' M.S Thesis, IIT Madras, 2006. Vinod J, ``Low cost Data Communication network for Rural Telecom Management,'' (Guides: T.A. Gonsalves, Hema A Murthy) M S Thesis, IIT Madras, 2006. G L Sarada, ``Automatic Transcription of Continuous Speech into Syllable-like Units,'' M.S Thesis, IIT Madras, 2006. R Deepak, ``Distributed Intrusion Detection System,''(Guides: T A Gonsalves, Hema A Murthy), M S Thesis, IIT Madras, 2005. Veena Desai, ``Distributed Speech Recognition,'' (Guides: T A Gonsalves, Hema A Murthy), M.S Thesis, IIT Madras, 2005. G.Sirisha, ``A DSP Virtual Machine,'' (Guides: Hema A Murthy, T.A.Gonsalves) M S Thesis, IIT Madras, 2004 N Sridhar Krishna, ``Multilingual Text-to Speech Synthesis,''(Guides: Hema A Murthy, T.A.Gonsalves) M S Thesis IIT Madras, 2004 M Balamurugan, ``An Access Network Planner,''(Guides: Hema A Murthy, T.A.Gonsalves IIT Madras) M S Thesis, IIT Madras, 2004 M. A. Saifulla, ``A Pattern Matching Approach to Classifying Network Traffic,''(Guides: Hema A Murthy, T.A.Gonsalves) M.S Thesis, IIT Madras, 2003. A Ramasamy, ``LP Based Traffic Modelling and a Framework for Control,'' M.S.Thesis, IIT Madras, 2002 (Co-Guide: Prof.T.A.Gonsalves, Dept. of CS&E). B Jyotsana, ``A Spoken Language Identification System for Indian Languages,'' M.S. Thesis, IIT Madras, 2001. S Vela, ``A New Model of Speaker Identification based on Statistical Similarity and an Object Oriented Framework for Online Speaker Identification,'' M.S.Thesis, IIT Madras, 1999. J Srichand, ``Word Boundary Detection in Indian Languages and its Application to Keyword Spotting,''(Guides: G.V.",
  "content_length": 13813,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:45"
}