{
  "name": "Hendrik Blockeel",
  "homepage": "https://people.cs.kuleuven.be/~hendrik.blockeel",
  "status": "success",
  "content": "Home page of Hendrik Blockeel Before contacting me... If you are interested in doing an internship, or obtaining a Masters or PhD degree, at the Machine Learning group at KU Leuven, please read this first. Personal information Hendrik Blockeel (PhD in Computer Science, 1998, KU Leuven) is a full professor (\"gewoon hoogleraar\") at KU Leuven. From 2007 till 2016 he was also affiliated with Leiden University. His research interests include theory and algorithms for machine learning and data mining in general, with a particular focus on relational learning, graph mining, probabilistic logics, inductive knowledge bases, and applications of these techniques in the broader field of computer science, bio-informatics, and medical informatics. Prof. Blockeel's main research results up till now include: TILDE, an efficient and versatile relational decision tree learner (Blockeel and De Raedt, 1998) that has been used in many relational learning applications ACE, a tool for relational learning that includes TILDE and several other relational learning algorithms and is based on an advanced special-purpose logical inference engine (Blockeel et al., 1999) Predictive Clustering: a framework for symbolic machine learning that generalizes decision tree and rule learning and encompasses, besides the classical classification and regression tasks, also multi-label classification, conceptual clustering, semi-supervised learning, subgroup discovery, and ranking (Blockeel et al., forthcoming). The predictive clustering framework has been implemented in TILDE and in Jan Struyf's Clus system. Experiment Databases for Machine Learning (Blockeel and Vanschoren, 2007): such databases store complete descriptions of learners, datasets and experimental conditions of a large number of machine learning experiments, and offer advanced querying capabilities, to the extent that a single query may answer questions that would otherwise require extensive experimenting on the user's side. A proof of concept, ExpDB, is online, containing results of over 600,000 experimental runs. An up-to-date list of publications is available here (generated from the Lirias publication repository). See this detailed CV for a more complete overview (updated July 2014) of current and past activities. Prof. Blockeel is a member of the DTAI research group (Declarative Languages and Artificial Intelligence). Please visit the DTAI website for information on the group's research, job opportunities, etc. Coordinates Hendrik Blockeel KU Leuven, Department of Computer Science Celestijnenlaan 200A - bus 2402, B-3001 Heverlee, Belgium tel. +32 16 32 76 43; fax. +32 16 32 79 96 e-mail: Hendrik.Blockeel-cs.kuleuven.be (change - to @)",
  "content_length": 2711,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:51"
}