{
  "name": "Heng Ji 0001",
  "homepage": "http://blender.cs.illinois.edu/hengji.html",
  "status": "success",
  "content": "BLENDER Lab News I'm hiring a new postdoc to work on AI for Scientific Discovery (especially on drug discovery and material discovery) and Science-Inspired AI (especially on scientific foundation models). Please drop me an email if you are interested or know someone who might be a great fit. My super-star PhD student Chi Han (Science of Large Language Model) is on academic job market looking for faculty positions to start in Fall 2026, Chi won NAACL2024 Outstanding Paper Award, ACL2024 Outstanding Paper Award, selected as IBM PhD Fellow, Amazon AICE PhD Fellow, and Mavis Future Faculty Fellow, and has given a conference tutorial at AAAI2025 as a sole presenter. I also have two awesome post-docs looking for faculty positions to start in Fall 2026: Xiusi Chen and Yuji Zhang. Upcoming keynote speeches: ``No more Processing. Time to Discover.\" at EMNLP2025. I have multiple positions for post-docs, PhD/master RAs and interns available, please drop an email if interested. I will not be able to reply all emails but will check all CVs carefully. Please focus on telling me about yourself instead of your thoughts about my work. For PhD application please indicate me as one of the potential advisors if you are interested in working with me. For our recent research interests please check our publication page, with a focus on knowledge+LLM, Science-inspired AI, agentic AI, never-ending knowledge acquisition, and multimodal knowledge representation and multimodal models. We are extremely excited to announce mCLM, a Modular Chemical Language Model that is friendly to automatable block-based chemistry and mimics bilingual speakers by frequently “code-switching” between functional molecular modules and natural language descriptions of these functions. mCLM significantly improved many predicted properties of 430 FDA-approved drugs and greatly improved the predicted properties of FDA-rejected drugs (“fallen angels”). Check out the Paper and News! Data, code, trained model and system demo will be released soon. We are extremetly grateful for the MMLI to get renewed, thanks NSF! Congratulations to my former student and dearest friend Prof. Manling Li on receiving the Honorable Mention for ACL Dissertation Award! Manling is running a very young and productive lab MML Lab that is always looking for new members to join. Congratulations to my PhD student Alexi Gladstone on receiving the prestigeous NSF Graduate Research Fellowship! 201 N Goodwin Ave, Urbana, IL 61801 Copyright © | BLENDER Lab, CS @ Illinois | All Rights Reserved",
  "content_length": 2558,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:52"
}