{
  "name": "Heng Fan 0001",
  "homepage": "https://hengfan2010.github.io",
  "status": "success",
  "content": "Homepage for Heng Fan Home Selected Publications Group Teaching Professional Activities Heng Fan Assistant Professor Department of Computer Science and Engineering, University of North Texas Department of Data Science (Affiliated Faculty), University of North Texas Office: Room F284, UNT Discovery Park, 3940 N Elm St, Denton, TX 76207 Email: heng.fan@unt.edu [Curriculum Vitae] [Google Scholar] [LinkedIn] [DBLP] [LLaVi Lab] Short Bio Heng Fan is currently an Assistant Professor in the Department of Computer Science and Engineering at the University of North Texas, and also an affiliated faculty in the Department of Data Science. He received his B.S. from Huazhong Agricultural University in 2013 and Ph.D. (advised by Professor Haibin Ling) from Stony Brook University in 2021, respectively. His research interests include computer vision with a particular interest in various video analysis tasks using vision and language, robotics with a focus on robot vision perception, and medical image analysis. He serves or has served as an Associate Editor for Pattern Recognition (PR) and as Area Chairs for ICCV, NeurIPS, BMVC, WACV, and ICME. To prospective students: I am looking for self-motivated PhD/master/undergraduate/TAMS students and (remote) research interns to work on interesting problems in computer and robotic vision. If you are interested, please read HERE. News 2025-10: A paper on planar tracking is accepted to Computer Vision and Image Understanding (CVIU). 2025-10: Recognized as the World's Top 2% Scientists by Standford University/Elsevier. 2025-09: Three papers (pdf/code, pdf/code, pdf/code) are accepted to NeurIPS 2025. 2025-08: A paper on privacy-preserving LLM (pdf/code) is accepted to Findings of EMNLP 2025. 2025-07: I will be serving as an Area Chair for WACV 2026. 2025-06: Three papers (pdf/code, pdf/code-data, pdf/code) are accepted to ICCV 2025. 2025-06: A paper on efficient medical image segmentation (pdf/code) is accepted to MICCAI 2025. 2025-06: Two papers on efficient tracking (pdf/code) and action recognition (pdf/code) are accepted to IROS 2025. 2025-05: I will be serving as an Area Chair for BMVC 2025. 2025-05: A paper on high-fidelity image inpainting (pdf) is accepted to IJCV. 2025-05: A paper on efficient large language model (pdf/code) is accepted to Findings of ACL 2025. Quick Links myUNT EagleConnect UNT CSE UNT Directory UNT Map Google gScholar gMap CVF IEEE CSRankings PR",
  "content_length": 2438,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:51"
}