{
  "name": "Henghui Ding",
  "homepage": "https://henghuiding.github.io",
  "status": "success",
  "content": "Henghui Ding Henghui Ding Professor Office: B315 Computing Center, 220 Handan Rd, Fudan University Email: henghui.ding[AT]gmail.com Henghui Ding is currently a Professor at Fudan University. Prior to that, he was a Presidential Postdoctoral Fellow (Principal Investigator) at Nanyang Technological University (NTU) in Singapore, a Postdoctoral Researcher at ETH Zürich in Switzerland, and a Research Scientist at ByteDance AI Lab in Singapore. He received the Ph.D. degree (winner of the Best Thesis Award) from NTU in 2020, and the B.E. degree from Xi’an Jiaotong University in 2016. His research interests broadly include machine learning and computer vision. Specifically, he focuses on scene understanding (e.g., video/image segmentation, detection), AIGC (e.g., video/image generation/editing), multi-modal learning (e.g., vision-language), low-shot learning, and human–computer interaction. He serves/served as an Area Chair of CVPR’(24-26), NeurIPS’(24-25), ICML’25, ICLR’(25-26), AAAI’26, ACM MM’(24-25), BMVC’(24-25), and a Senior Program Committee (SPC) member of AAAI’(22-25), IJCAI’(23-25). He serves as an Associate Editor for IEEE Transactions on Image Processing (TIP). Openings: We are looking for self-motivated undergraduate interns, graduate (Master/Ph.D.) students to join our group. If you are interested, please email me with your resume and transcript. 招生: 26年博士、硕士名额若干，请邮件联系。 News Nov 2025 3 papers accepted to AAAI 2026, 1 Oral. Congratulations to Hengrui and Xincheng! Sep 2025 2 papers accepted to NeurIPS 2025, 1 Spotlight. Congratulations to Zhenyuan! Aug 2025 Serving as an Area Chair for CVPR 2026. Serving as an Area Chair for ICLR 2026. Aug 2025 MOSEv2 Dataset is released. Evaluation server is online. Aug 2025 MeViSv2 Dataset accepted to IEEE TPAMI. Jul 2025 Serving as an Area Chair for AAAI 2026. Jun 2025 6 papers accepted to ICCV 2025. Congratulations to Xincheng, Kaining, and Ziye! May 2025 7th LSVOS Workshop@ICCV 2025. May 2025 Serving as an Area Chair for BMVC 2025. May 2025 1 paper accepted to ICML 2025 as Oral. Mar 2025 Call for Papers: CVPR 2025 PVUW Workshop. Feb 2025 3 papers accepted to CVPR 2025. Feb 2025 Serving as an Area Chair for ACM MM 2025. Feb 2025 Serving as an Area Chair for NeurIPS 2025. Dec 2024 Serving as an Associate Editor for IEEE TIP. 3 papers accepted to AAAI 2025. Serving as an Area Chair for ICML 2025. Nov 2024 Serving as a Senior Program Committee (SPC) member for IJCAI 2025. Sep 2024 Serving as an Area Chair for CVPR 2025. 3 papers accepted to NeurIPS 2024. Aug 2024 Serving as an Area Chair for ICLR 2025. Jul 2024 2 papers accepted to ECCV 2024. 3 papers accepted to ACM MM 2024. Transformer-based Segmentation Survey accepted to IEEE TPAMI. Jun 2024 Serving as a Senior Program Committee (SPC) member for AAAI 2025. Image Editing Survey. CVPR 2024 MOSE & MeViS Challenge Report. May 2024 Serving as an Area Chair for BMVC 2024. Apr 2024 1 paper on Video Segmentation accepted to IEEE TPAMI. Serving as an Area Chair for NeurIPS 2024. Mar 2024 Call for Papers: CVPR 2024 PVUW Workshop Jan 2024 Open Vocabulary Learning Survey accepted to IEEE TPAMI. 3 papers accepted to CVPR 2024. Dec 2023 1 paper accepted to AAAI 2024. Nov 2023 1 paper accepted to IEEE TIP, 1 paper accepted to IEEE TMM. Serving as a Senior Program Committee (SPC) member for IJCAI 2024. Sep 2023 Several papers accepted, 1 NeurIPS, 1 IEEE TIFS, 1 PR. Aug 2023 MeViS Dataset is released. Evaluation server is online. Serving as an Area Chair for CVPR 2024. Jul 2023 5 papers accepted to ICCV 2023. MOSE Dataset accepted to ICCV 2023. Serving as a Senior Program Committee (SPC) member for AAAI 2024. Jun 2023 1 paper accepted to IEEE TPAMI. May 2023 2 paper accepted to IEEE TIP. Named CVPR 2023 Outstanding Reviewer. Mar 2023 6 papers accepted to CVPR 2023, 1 Highlight. Feb 2023 MOSE Dataset is released. Evaluation server is online.. Jan 2023 3 papers accepted to ICLR 2023, 1 paper accepted to ISBI 2023. Dec 2022 Serving as a Senior Program Committee (SPC) member for IJCAI 2023. Nov 2022 Serving as an Associate Editor for IET Computer Vision. Oct 2022 2 papers accepted to IEEE TPAMI. Sep 2022 2 papers accepted to NeurIPS 2022. Jul 2022 2 papers accepted to ECCV 2022. Mar 2022 4 papers accepted to CVPR 2022. Sep 2021 Serving as a Senior Program Committee (SPC) member for AAAI 2022. 2 papers accepted to NeurIPS 2021. Jul 2021 8 papers accepted to ICCV 2021. Selected Publications arXiv MOSEv2: A More Challenging Dataset for Video Object Segmentation in Complex Scenes Henghui Ding, Kaining Ying, Chang Liu, Shuting He, Xudong Jiang, Yu-Gang Jiang, Philip HS Torr, and Song Bai arXiv preprint arXiv:2508.05630 (arXiv), 2025 PDF Code Website arXiv Multimodal Referring Segmentation: A Survey Henghui Ding, Song Tang, Shuting He, Chang Liu, Zuxuan Wu, and Yu-Gang Jiang arXiv preprint arXiv:2508.00265 (arXiv), 2025 PDF Website TPAMI MeViS: A Multi-Modal Dataset for Referring Motion Expression Video Segmentation Henghui Ding, Chang Liu, Shuting He, Kaining Ying, Xudong Jiang, Chen Change Loy, and Yu-Gang Jiang IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025 PDF Code Website arXiv A Survey of Multimodal-Guided Image Editing with Text-to-Image Diffusion Models Xincheng Shuai, Henghui Ding†, Xingjun Ma†, Rongcheng Tu, Yu-Gang Jiang, and Dacheng Tao arXiv preprint arXiv:2406.14555 (arXiv), 2024 PDF Website NeurIPS SAMA: Towards Multi-Turn Referential Grounded Video Chat with Large Language Models Ye Sun, Hao Zhang, Henghui Ding†, Tiehua Zhang, Xingjun Ma†, and Yu-Gang Jiang In Advances in Neural Information Processing Systems (NeurIPS), 2025 PDF Code NeurIPS Spotlight SceneDesigner: Controllable Multi-Object Image Generation with 9-DoF Pose Manipulation Zhenyuan Qin, Xincheng Shuai, and Henghui Ding† In Advances in Neural Information Processing Systems (NeurIPS Spotlight), 2025 ICCV Free-Form Motion Control: Controlling the 6D Poses of Camera and Objects in Video Generation Xincheng Shuai, Henghui Ding†, Zhenyuan Qin, Hao Luo, Xingjun Ma, and Dacheng Tao In IEEE/CVF International Conference on Computer Vision (ICCV), 2025 PDF Code Website ICCV Towards Omnimodal Expressions and Reasoning in Referring Audio-Visual Segmentation Kaining Ying, Henghui Ding†, Guangquan Jie, and Yu-Gang Jiang In IEEE/CVF International Conference on Computer Vision (ICCV), 2025 PDF Code Website ICCV MOVE: Motion-Guided Few-Shot Video Object Segmentation Kaining Ying*, Hengrui Hu*, and Henghui Ding† In IEEE/CVF International Conference on Computer Vision (ICCV), 2025 PDF Code Website ICCV AnyI2V: Animating Any Conditional Image with Motion Control Ziye Li, Hao Luo, Xincheng Shuai, and Henghui Ding† In IEEE/CVF International Conference on Computer Vision (ICCV), 2025 PDF Code Website ICCV CharaConsist: Fine-Grained Consistent Character Generation Mengyu Wang, Henghui Ding†, Jianing Peng, Yao Zhao, Yunpeng Chen, and Yunchao Wei† In IEEE/CVF International Conference on Computer Vision (ICCV), 2025 PDF Code Website ICML Oral ReferSplat: Referring Segmentation in 3D Gaussian Splatting Shuting He, Guangquan Jie, Changshuo Wang, Yun Zhou, Shuming Hu, Guanbin Li, and Henghui Ding† In International Conference on Machine Learning (ICML Oral), 2025 PDF Code TPAMI Transformer-based Visual Segmentation: A survey Xiangtai Li, Henghui Ding, Haobo Yuan, Wenwei Zhang, Guangliang Cheng, Jiangmiao Pang, Kai Chen, Ziwei Liu, and Chen Change Loy IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024 PDF Code TPAMI Towards Open Vocabulary Learning: A Survey Jianzong Wu, Xiangtai Li, Shilin Xu, Haobo Yuan, Henghui Ding, Yibo Yang, Xia Li, Jiangning Zhang, Yunhai Tong, Xudong Jiang, Bernard Ghanem, and Dacheng Tao IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024 PDF Code TPAMI VLT: Vision-Language Transformer and Query Generation for Referring Segmentation Henghui Ding, Chang Liu, Suchen Wang, and Xudong Jiang IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2023 PDF Code ICCV MOSE: A New Dataset for Video Object Segmentation in Complex Scenes Henghui Ding, Chang Liu, Shuting He, Xudong Jiang, Philip H.S. Torr, and Song Bai In IEEE/CVF International Conference on Computer Vision (ICCV), 2023 PDF Code Website ICCV MeViS: A Large-scale Benchmark for Video Segmentation with Motion Expressions Henghui Ding, Chang Liu, Shuting He, Xudong Jiang, and Chen Change Loy In IEEE/CVF International Conference on Computer Vision (ICCV), 2023 PDF Code Website CVPR Highlight GRES: Generalized Referring Expression Segmentation Chang Liu*, Henghui Ding*†, and Xudong Jiang In IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR Highlight), 2023 PDF Code Website",
  "content_length": 8742,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:54"
}