{
  "name": "Henk van den Heuvel",
  "homepage": "https://www.ru.nl/english/people/heuvel-h-van-den",
  "status": "success",
  "content": "Dr H. van den Heuvel (Henk) | Radboud University Dr H. van den Heuvel (Henk) Head - Humanities Lab Faculty of Arts Datasteward Faculty of Arts - Humanities Lab Faculty of Arts Senior researcher - Centre for Language Studies Senior researcher - Department of Language and Communication Contact henk.vandenheuvel@ru.nl To LinkedIn To X Visiting address Erasmusplein 1 6525 HT NIJMEGEN Postal address Postbus 9103 6500 HD NIJMEGEN Working days Monday, Tuesday, Wednesday, Thursday, Friday Henk van den Heuvel is an expert on production and curation of language and speech databases, transcription of speech (orthographical and phonetic); and automatic speech recognition and language learning.He is coordinator of the Centre for Language and Speech Technology (CLST) and Head of the Humanities Lab at the Faculty of Arts.He is also Research Data Manager (data steward) for the Faculty of Arts. Tags: Language and speech technology, Data science, RDM Publications Publication lists ORCID iD : 0000-0003-2064-0630 Radboud Repository Research Information Services (RIS) Projects 2015 - 2023 CLARIAH: Common Lab Research Infrastructure for the Arts and Humanities More information 2021 - 2023 SignON is a user-centric and community-driven project that aims to facilitate the exchange of information among Deaf, hard of hearing and hearing individuals across Europe, targeting the Irish, British, Dutch, Flemish and Spanish sign as well as the English, Irish, Dutch and Spanish spoken languages. More information 2020 - 2023 The HoMed project (Homo Medicinalis) will implement a SSH research infrastructure with an enormous potential for automatic transcription of sensitive audio-visual (AV) recordings. Its use case will focus on AV-recordings of medical consultations on the use of pharmaceuticals (henceforth ‘MedPharm’). MedPharm in practice shows situations where patients often appear not to be able to understand proper medicine use. To overcome unintentional medicine use we need to better understand the attribution of meaning to medicines. Therefore, recordings and transcriptions of patient consultations are needed. In HoMed a standard automatic speech recogniser (ASR) for Dutch will be adapted to MedPharm discourses, since essential jargon is not part of the vocabulary of the current generic ASR. The ASR will be retrained on existing radio and tv data and on highly sensitive AV-recordings of patient consultations at Nivel. More information 2021 - 2023 ST.CART develops speech technology applications and two Artificial Intelligence products: a care assistant ( the Care Assistant), and a Reading Tutor (the Digi Juf). The Digi Juf motivates children to learn to read in a fun way and adapts adaptively to the level of the student. The Care Assistant is a new module based on an existing Virtual Assistant (Anne) - which, for example, helps elderly people with dementia to remain independent for longer - which can diagnose specific diseases (Parkinson's, Alzheimer's) based on speech characteristics. More information Ancillary activities Board Member and Treasurer of NOTaS (Dutch Organisation for Language and Speech Technology) (01 January 2008) Board Member and Treasurer of Stichting Open Spraaktechnologie (Foundation for Open Speech Technology) (01 January 2019) Editorial Board Member of the Springer journal Language Resources and Evaluation. (01 January 2021) Springer Journals Member Supervisory Board CLARIAH NL (01 October 2024 - 01 October 2026) CLARIAH About Henk van den Heuvel’s expertise is collecting and storing spoken language in databases. This data is used to train computers to recognise and transcribe speech, which is useful for developing resources for language learners and people who have experienced language attrition.",
  "content_length": 3761,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:55"
}