{
  "name": "Henning Meyerhenke",
  "homepage": "https://www.informatik.hu-berlin.de/de/forschung/gebiete/macsy/standardseite",
  "status": "success",
  "content": "Modellierung und Analyse komplexer SystemeMehr KontrastWeniger Kontrast Direkt zum InhaltDirekt zur SucheDirekt zur Navigation Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Modellierung und Analyse komplexer Systeme Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Modellierung und Analyse komplexer Systeme Navigation « Dezember 2025 » month-12 Mo Di Mi Do Fr Sa So 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 1 2 3 4 Termine Promotionsvortrag: Niklas Giesa 01.12.2025 Disputation: Frau Parmida Geranmayeh, M.Sc. 10.12.2025 Disputation: Herr Pascal Sebastian Kunz, M.Sc. 12.12.2025 Promotionsvortrag Fabian Lehmann 18.12.2025 Termine - More… Impressum Humboldt-Universität zu Berlin - Mathematisch-Naturwissenschaftliche Fakultät - Modellierung und Analyse komplexer Systeme Welcome to the Chair Modeling and Analysis of Complex Systems! Our research group, headed by Prof. Dr. Henning Meyerhenke, works on scalable algorithms for large and complex networked systems. We employ the algorithm engineering cycle of modeling, design, analysis, implementation, and experimental evaluation in order to obtain theoretically sound solution methods for real-world problems. Note that the group moves/moved to Karlsruhe Institute of Technology (KIT) on April 1st, 2025 - then renamed to Exascale Algorithm Engineering. Our current focus areas are: Algorithmic analysis of large complex networks, in particular for dynamic scenarios Combinatorial scientific computing, in particular load balancing Applied optimization, in particular for complex algorithmic problems in the natural sciences Willkommen am Lehrstuhl Modellierung und Analyse komplexer Systeme! Der Lehrstuhl unter der Leitung von Prof. Dr. Henning Meyerhenke beschäftigt sich mit skalierbaren Algorithmen für große und komplexe vernetzte Systeme. Dabei wenden wir den algorithmentechnischen Zyklus aus Modellierung, Entwicklung, Analyse, Implementierung und experimenteller Bewertung an, um theoretisch fundierte Lösungen für praktisch motivierte Probleme zu erzielen. Von besonderer Bedeutung sind dabei in unserer Arbeit Graphenalgorithmen. Bitte beachten Sie, dass der Lehrstuhl am 1. April 2025 ans Karlsruher Institut für Technologie (KIT) umzieht / umgezogen ist -- dann umbenannt in Exascale Algorithm Engineering. Unsere aktuellen Schwerpunkte liegen in folgenden Bereichen: Algorithmische Analyse von großen komplexen Netzwerken, insbesondere unter Dynamik Kombinatorisches wissenschaftliches Rechnen, insbesondere Lastbalancierung Angewandte Optimierung, insbesondere für komplexe algorithmische Probleme aus den Naturwissenschaften Lehrstuhl \"MACSy\" im Oktober 2023 (v. l. n. r.): Fabian Brandt-Tumescheit, Ranran Wang, Florian Willich, Svetlana Kulagina, Dr. Klaus Ahrens, Silvia Schoch, Lukas Berner, Prof. Dr. Henning Meyerhenke. DE EN Mehr KontrastMehr Kontrast Weniger KontrastWeniger Kontrast Humboldt-Universität zu Berlin Institut für Informatik Rudower Chaussee 25 12489 Berlin-Adlershof Die Humboldt-Universität bei Facebook Die Humboldt-Universität bei BlueSky Die Humboldt-Universität bei Instagram Die Humboldt-Universität bei YouTube Die Humboldt-Universität bei LinkedIn Die RSS-Feeds der Humboldt-Universität Seite bearbeiten Barrierefreiheit Datenschutz Impressum",
  "content_length": 3330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:56"
}