{
  "name": "Henning Pohl",
  "homepage": "https://henningpohl.net",
  "status": "success",
  "content": "Henning Pohl: Home About me I'm a tenure-track assistant professor at Aalborg University, working primarily in the intersection of mobile computing and mixed reality. Before that, I held an assistant professor position at the University of Copenhagen. Previously, I worked as postdoctoral researcher at the University of Copenhagen in Kasper Hornbæk's Body-based User Interfaces project. Within this project, I focused on how the body can be used as an input and output surface for less engaged and more subtle interactions. I received my PhD from the University of Hannover, where I worked for four years as a research assistant in Michael Rohs' HCI group. My PhD work was on casual interactions, concretized in a range of interactive systems. I have also worked with Roderick Murray-Smith's group at the University of Glasgow during the summer of 2012 and with the Human-Computer Interaction group of the Hasso Plattner Institute for the two years before. I hold a BSc in Digital Media / Media Informatics from the University of Bremen and a MSc in Computer Science from the Darmstadt University of Technology. During my time as a Master's student, I spent one year at the University of Florida, studying Digital Arts and Sciences on a Fulbright scholarship. Research Interests Most interactive systems today are designed under the assumption of focused and engaged users. However, users might want to engage less with their devices for many different reasons: e.g., because they are tired, want to signal their full attention to others, or are lazy. I'm interested in how to design and build systems for such more casual interactions. With interactive devices permeating more and more of our life and surroundings, how not to be overloaded by the respective interactions is a challenge. I see giving users a way to scale back their engagement and be more casual as a way to empower them to stay more in control of their life. This poses questions of how interactions change and adapt according to uncertainty, intend, or engagement. In my work I have approached this in areas such as whole body interaction, around device interaction, haptic and subtle feedback, text input, and natural user interfaces.",
  "content_length": 2206,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:55"
}