{
  "name": "Henny Admoni",
  "homepage": "https://www.ri.cmu.edu/ri-faculty/henny-admoni",
  "status": "success",
  "content": "Warning: You are viewing this site with an outdated/unsupported browser. Please update your browser or consider using a different one in order to view this site without issue. For a list of browsers that this site supports, see our Supported Browsers page. Henny Admoni - The Robotics Institute - CMU Skip to content Henny Admoni Associate Professor Home Department: RI Office: 4529 Newell-Simon Hall Personal Homepage Administrative Assistant: Devin Frank Lab: Human And Robot Partners Lab Statement Research Publications Students/Affiliates I am an Assistant Professor in the Robotics Institute at Carnegie Mellon University, where I lead the Human And Robot Partners (HARP) Lab. I’m interested in robotics, human-robot interaction, and assistive technology. My research focuses on developing intelligent, autonomous robots that help humans on complex tasks like eating a meal or learning a new skill. I apply my background in robotics, computer science, and cognitive psychology to build mathematically rigorous algorithms grounded in human behavior research. These algorithms enable robots to detect, interpret, and respond to human verbal and nonverbal behavior. Applications of my research include robot home assistants, robot tutors, and robotic therapy tools. From http://hennyadmoni.com Research Topics Human-Robot Interaction Domestic Robotics Social Robots Human Activity Forecasting Robots for Education Rehabilitation and Health Care Robotics Humanoids AI Reasoning for Robotics Human-Centered Robotics Robotics Foundations Human Robot Collaboration Henny Admoni's Google Scholar Profile current phd students Patrick Callaghan Maggie Collier Pranay Gupta Zulekha Karachiwalla Cailyn Smith Michelle Zhao current masters students Jack Mirenzi current affiliates Abhijat Biswas past phd students Reuben Aronson Abhijat Biswas Michael Lee Benjamin Newman Ada Taylor past masters students Sarthak Ahuja",
  "content_length": 1910,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:58"
}