{
  "name": "Henrik Bærbak Christensen",
  "homepage": "http://pure.au.dk/portal/en/persons/henrik-baerbak-christensen(4f747aba-32e8-4492-841f-1f9130be6909).html",
  "status": "success",
  "content": "Henrik Bærbak Christensen - Aarhus University Henrik Bærbak Christensen PhD Associate Professor, Department of Computer Science https://orcid.org/0000-0002-1645-1901 Phone+4521658252Emailhbccs.audk Åbogade 34, 5342, 2308200 Aarhus NDenmark 1998 …2025 Research activity per year Personal profile KeywordsExperimental systems developmentSoftware architectureTeaching in programming and software developmentDistributed software systems Fingerprint Dive into the research topics where Henrik Bærbak Christensen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 4 Similar Profiles Software Architecture Computer Science 100% Case Study Computer Science 62% Architectural Pattern Computer Science 40% Software Development Computer Science 40% Software Reliability Keyphrases 36% Design Pattern Computer Science 34% Object-Oriented Languages Computer Science 33% Software Configuration Management Computer Science 31% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2010 2010 2012 2013 2014 2015 5 Finished Projects per year Danish localization of IHE XDS MetadataChristensen, H. B. (Participant)01/12/2014 → 28/02/2015Project: Research Healthcare System 100% IHE XDS 100% Danish localizing of HL7-questionnaire standards: QFDD og QRDChristensen, H. B. (Participant)01/12/2014 → 30/06/2015Project: Research Danish 100% Open Source Development 100% Development Project 50% Danmark som telemedicin foregangslandChristensen, H. B. (Participant), Kyng, M. (Project manager) & Christensen, M. (Participant)01/01/2013 → 31/12/2015Project: Research Architecture 100% Regional 100% Ecosystem Architecture 100% Software Ecosystems 100% Danish 100% EcoSense Software ArchitectureChristensen, H. B. (Participant)01/08/2012 → 01/08/2015Project: Research Software Architecture 100% Architecting 100% Software System 100% Mobile Devices 100% Software Systems 100% Net4Care: Net4Care Ecosystem FrameworkChristensen, H. B. (Participant)01/08/2010 → 01/04/2015Project: Research IHE XDS 100% Telehealth Applications 100% Ecosystem Framework 100% Open Service Gateway Initiative (OSGi) 100% Provided Support 100% Research output Research output per year 1998 2003 2004 2005 2008 2009 2010 2012 2014 2021 2025 45 Article in proceedings 18 Working paper 15 Compendium/lecture notes 13 Computer programme 28 More 9 Journal article 6 Report 4 Book 4 Conference article 1 Book chapter 1 Paper 1 Pictures, Video and sound recordings (digital) 1 Net publication - Internet publication 1 PhD thesis Research output per year Research output per year Experiences with Technical Debt and its Root Causes in a Merged Industrial CompanyJørgensen, M. D., Mølgaard, N. W., Jokumsen, M., Jørgensen, J. B. & Christensen, H. B., 27 Apr 2025, 2 p.Research output: Working paper/Preprint › Working paper › Research › peer-review Open AccessFile Software Development 100% Software Architect 100% Anti-Pattern 100% Industrial Companies 100% Technical Debt 100% 42 Downloads (Pure) Teaching Energy-Efficient Software - An Experience ReportChristensen, H. B., Kirkeby, M. H., Thomsen, B. & Thomsen, L. L., 1 Jun 2025, ArXiv, 7 p.Research output: Working paper/Preprint › Working paper › Research › peer-review Open Access Experience Report 100% EnergyPlus Software 100% Energy Efficient 100% Energy Consumption 100% Lessons Learned 50% Flexible, Reliable Software, 2nd Edition, Part V: Compositional Design: Compositional DesignChristensen, H. B., 1 Aug 2024, 65 p.Research output: Book/anthology/report › Compendium/lecture notes Software Reliability 100% Compositional Design 100% Pattern Catalogue 33% Design Patterns 33% Flexible, Reliable Software, 2nd Edition, Part VI: A Design Pattern CatalogueChristensen, H. B., 20 Aug 2024, 85 p.Research output: Book/anthology/report › Compendium/lecture notes Learning Objectives 100% Software Reliability 100% Pattern Catalogue 100% Design Patterns 100% First Names 100% Teaching Distributed Programming - Revisiting the Broker PatternChristensen, H. B., Jun 2023, Proceedings of the 5th European Conference on Software Engineering Education, ECSEE 2023. New York: Association for Computing Machinery, p. 162-168 7 p.Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Open Source 100% Object-Oriented Languages 100% Architectural Pattern 100% Distributed Programming 100% Distributed Object 100% View all 119 research outputs Activities Activities per year 2006 2007 2008 2011 2013 2025 15 Lecture and oral contribution 9 Consultancy 6 Peer review of manuscripts 5 Member of committee, council or board 6 More 4 Member of evaluation panel 1 Participation in or organisation of workshop, seminar or course 1 External lectures Activities per year Energy-efficient software architecture - In PRACTICEChristensen, H. B. (Examiner)13 Nov 2025 → 14 Nov 2025Activity: Evaluation, external lectures and examination › External lectures › Communication Teknisk gæld – den stille dræberChristensen, H. B. (Lecturer)5 Nov 2025Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution Presentation at ICSA 2025 Working sessionChristensen, H. B. (Lecturer)3 Apr 2025Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution Energieffektivitet i softwarearkitektur og softwareudviklingChristensen, H. B. (Lecturer)26 Nov 2024Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution Energy-Efficient Software Architecture for DevelopersChristensen, H. B. (Lecturer)31 Oct 2024Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution View all 41 activities Prizes Teacher of the Year 2013Christensen, H. B. (Recipient), 1 Jan 2013Prize: Prizes, scholarships, distinctions Computer Science 100% Teacher of the Year 2016Christensen, H. B. (Recipient), 1 Jun 2016Prize: Prizes, scholarships, distinctions Press/Media Ny forskning sparer sundhedsvæsenet for millioner i softwareudviklingChristensen, H. B.11/06/20141 item of Media coveragePress/Media: Press / Media Net4care Platform version 0.1 skal være katalysator for dansk telemedicinChristensen, H. B.22/03/20121 item of Media coveragePress/Media: Press / Media",
  "content_length": 6702,
  "method": "requests",
  "crawl_time": "2025-12-01 13:19:58"
}