{
  "name": "Henry Hexmoor",
  "homepage": "https://www2.cs.siu.edu/~hexmoor",
  "status": "success",
  "content": "Professor Henry Hexmoor Henry Hexmoor, IEEE senior member Teaching Freshman Student Guidebook Undergraduate Student Guidebook Graduate Student Guidebook Graduate Projects Authenticity Salukinet Publications Links Editoral board member: IJCSA IJCI JETAI ARA Bioketch: Henry Hexmoor received the M.S. degree from Georgia Tech, Atlanta, and the Ph.D. degree in computer science from the State University of New York, Buffalo, in 1996. He taught at the University of North Dakota before a stint at the University of Arkansas. Currently, he is an Associate Professor with the School of Computing, Southern Illinois University, Carbondale, IL. He has published widely in artificial intelligence and multiagent systems. His long term and sponsored research include federal and state agencies and prime contractors. He is an IEEE senior member. His current Intertests include Cyber-physical systems, Wireless networks, Complex Networks, Multiagent Systems, cognitive science, Robotics, and Digital forensics, and Blockchain. Online meeting appointment by email. Available noncorporate access via: skype (hexmoor@hotmail.com), zoom (hexmoor@cs.siu.edu), google meets (hexmoor@gmail.com) and MS teams (hexmoor@siu.edu) Contact: Southern Illinois University at Carbondale School of Computing Engrinnering Bldg A, Room 409C Carbondale, IL 62901, USA Office Telephone: (618) 453-6047 email: hexmoor AT cs.siu.edu Home 282 High Forest Dr. Carbondale, IL. 62903 CS Dept Telephone: (618) 453-6041 FAX: (618) 453 6044 Gmail Gmail Calendar Youtube Yahoo Linkedin Alignable Facebook Twitter Google maps Google Search Advanced Google Search Google scholar (documents) Microsoft Academic Search iSeek (Books, Videos, documents) Refseek Citeseer (Penn state's paper indexing) arXiv (Cornell's science DB) DBLP CSB PLOS One VirtusalLRC Guide2Research WikiCFP Scopus Mendeley (Elsevier) SemanticScholar Salukinet DesireToLearn (D2L) MicrosoftOneDrive Microsoft Teams Last update: July 7, 2022",
  "content_length": 1968,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:03"
}