{
  "name": "Henry Hong Xu",
  "homepage": "https://henryhxu.github.io",
  "status": "success",
  "content": "Hong Xu, Henry Hong Xu Home Teaching Services Biography Research Publications Students Joining us Artifacts Hong Xu, Henry Associate Professor Department of Computer Science and Engineering Chinese University of Hong Kong Shatin, Hong Kong SAR, China Office: Room 914, Ho Sin-Hang Engineering Building Phone: +852 3943 8399 Email: hongxu [at] cuhk.edu.hk Web: https://henryhxu.github.io Research Interests I work on systems and networking. I lead the NetX Lab. Welcome to visit us! Our research is/was supported by funding from Research Grants Council (RGC) of Hong Kong, The Chinese University of Hong Kong, City University of Hong Kong Huawei, ByteDance, Microsoft Research Asia, Azure, Amazon Web Services, etc. Current Projects ML systems: ML/AI is important, but infra and deployment support is often the bottleneck to real-world use Compound and complex AI systems, orchestrate the workflows of compound AI systems with more than the LLM, and complex AI systems with more than a linear reasoning path Large-scale ML, faster, cheaper, and easier training and inference for large-scale ML workloads Simulation, accurate and efficient performance simulation of distributed training Related pubs: Mycroft@SOSP’25, AidAI, DSV@ASPLOS’26, StitchLLM@ACL’25, Ayo@ASPLOS’25, Echo, ICPP’24, EMNLP’23, ATC’23, EuroSys’23, CoNEXT’18, SoCC’18 Networking: what would the future network look like? Programmable dataplane, how can we better use the SmartNICs/DPUs? ML-empowered network management, how can ML help reduce the human effort needed in network management tasks? Related pubs: Xumi, Yala@ASPLOS’25, Meili, NAssim@SIGCOMM’22, DQN@SIGCOMM’22, INFOCOM’24, CoNEXT’22, ATC’20, MM’23, INFOCOM’23 Learning: we also study theory and algorithm on the side Learning to Optimize (L2O), how can we leverage DL to help solve optimization programs? Related pubs: Learning for GD@NeulIPS’25, Step-sizes in Quasi-Newton, CVPR’24, INFOCOM’24 Recent Publications (full list) “Dynamic Sparsity in Large-Scale Video DiT Training”, ASPLOS 2026 “Mycroft: Tracing Dependencies in Collective Communication Towards Reliable LLM Training”, SOSP 2025 “Towards End-to-End Optimization of LLM-based Applications with Ayo”, ASPLOS 2025 “Performance Prediction of On-NIC Network Functions with Multi-Resource Contention and Traffic Awareness”, ASPLOS 2025 “Accelerating Distributed MoE Training and Inference with Lina”, USENIX ATC 2023 “Lyra: Elastic Scheduling for Deep Learning Clusters”, ACM EuroSys 2023 “Software-defined Network Assimilation: Bridging the Last Mile Towards Centralized Network Configuration Management with NAssim”, ACM SIGCOMM 2022 (Best Paper Award) Prospective Students and Current Openings [04/2025] I am looking for PhD students starting in fall 2026. The early admissions exercise has begun and deadline of first-round intake is May 22, 2025. See here for more details. News 11/2025. Serving on the external review committee of MLSys’26. 11/2025. FAISys’25 was successfully held in CUHK! More than 160 people attended the workshop with 70+ from industry. Check out the photo album here. 10/2025. Registration is open for FAISys’25! We have a terrific 2-day program ahead, register early to secure your spot! 09/2025. Our work on learning for gradient descent accepted to NeulIPS’25! Congrats to Qingyu and Wei! 08/2025. We are launching FAISys, a unique workshop on AI/ML systems! The first FAISys is to be held at CUHK! Please submit, sponsor, and participate! 07/2025. Mycroft accepted to SOSP’25! Congrats to Yangtao! 06/2025. DSV accepted to ASPLOS’26! Congrats to Xin and Yuetao! 06/2025. Serving on the PC of PACMI, Workshop on Practical Adoption Challenges of ML for Systems, colocated with SOSP’25. Please submit! 05/2025. StitchLLM accepted to ACL’25 main program! 05/2025. Serving on the PC of INFOCOM’26. Please submit! 04/2025. Qingyu and Qiang will start as tenure-track AP in the CS department of Xiamen University in summer 2025. Congrats! 04/2025. Yunmo has another work on atomicity bugs in PM accepted to USENIX ATC’25! Congrats! 04/2025. PIE accepted to ICS’25! Congrats to Yunmo! 03/2025. Serving as the artifact evaluation co-chair of CoNEXT’25. Click here if you'd like to volunteer for the AE process! 01/2025. Ayo accepted to ASPLOS’25! Congrats to Xin and the rest of the team! 12/2024. Serving on the PC of NSDI’26. Please submit! 12/2024. Two papers accepted to ToN. 11/2024. Yala is now open source. Page generated 2025-11-20, by jemdoc. Copyright © 2012–2025 Hong Xu.",
  "content_length": 4494,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:02"
}