{
  "name": "Henry Muccini",
  "homepage": "http://www.henrymuccini.com",
  "status": "success",
  "content": "My Home - Henry MucciniHenry Muccini | Personal website Henry Muccini Full Professor in Computer Science, University of L'Aquila, Italy My Home AboutMe My Research My CV Publications Contact Copyright text here My Home: A snapshot A software architect and engineer, Henry Muccini is Full Professor in Computer Science at the Information Engineering and Computer Science and Mathematics (DISIM) Department, University of L’Aquila, Italy. I got my PhD degree in Computer Science from the University of Rome, La Sapienza and spent my PostDoc  at the University of California Irvine (USA). I am leading the FrAmeLab research team on software architecture, software engineering of ML-enabled systems, Green AI, and data architectures. I am leading the BeT PRIN 2022 project, locally coordinating the EDISS and SE4GD Erasmus Mundus programs, the CINI Smart Cities and Communities distributed laboratory, as well as the double degree international study programmes in software engineering and computer science (GSEEM, I2COST). I have been leading the Uffizi Galleries – UnivAQ project. My Events Twitter Tweets by @muccinihenry PC Member SEAMS 2024 PC memberhttps://conf.researchr.org/home/seams-2024 ICSA 2024 - Software Architecture PC memberhttps://conf.researchr.org/home/icsa-2024 ACM SAC - Software Architecture PC memberhttps://foselab.unibg.it/sa-tta/2024/ GREENS 2024 - Green Software PC memberhttps://greensworkshop.github.io/ SBES - Brazilian Software Engineering PC memberhttps://cbsoft.sbc.org.br/2024/sbes/ ICT4S - ICT for Sustainability PC memberhttps://conf.researchr.org/home/ict4s-2024 ECSA 2024 - Software Architecture PC memberhttps://conf.researchr.org/home/ecsa-2024 EUROMICRO - Data and AI Engineering PC memberhttps://dsd-seaa2023.com/seaa/ SANER 2024 - Software Analysis, Evol... PC memberhttps://conf.researchr.org/home/saner-2024 Events Software Architecture Town Hall @ICSE 2024May 23, 2024 Showroom 4.0 – Tecnologie Digitali Innovative per i Beni Culturali – SpeakerMay 23, 2024 ISAPS 2024 – speakerMay 22, 2024 CAIN 2024 – PC co-ChairJanuary 10, 2024 Software Engineering in Practice @ICSE 2023 – PC co-ChairMay 10, 2023 ICSA 2023 – General co-ChairApril 5, 2023 SERENE 2018 – 10th International Workshop on Software Engineering for Resilient SystemsAugust 27, 2018 I-CiTies 2018 – 4th Italian Conference on ICT for Smart Cities And CommunitiesAugust 27, 2018 Panel on ICT for the Culturale Heritage – L’Aquila, 04-05 May 2017April 30, 2017 CINI Smart Cities University ChallengeApril 30, 2017",
  "content_length": 2516,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:07"
}