{
  "name": "Heqing Huang 0002",
  "homepage": "https://5hadowblad3.github.io",
  "status": "success",
  "content": "Heqing Huang Heqing Huang | Heqing Huang’s Homepage Heqing HuangHack your life Follow YEUNG-Y6429 Email ResearchGate Twitter Github Google ScholarWelcome to Heqing Huang’s homepage!I am an assistant professor at the Department of Computer Science, City University of Hong Kong! Previously, I was a postdoc research fellow in the AST Lab at ETH Zurich, advised by Prof. Zhendong Su. I am also fortunate to obtain my Ph.D. supervised by Prof. Charles Zhang at the Hong Kong University of Science and Technology.My research focuses on software security, especially leveraging program analysis techniques to ensure software security rigorously. My primary goal is to address the deficiencies in existing security analysis for diverse software systems by understanding complex program semantics. Hence, there are two main divisions of my research currently:Enhancing the fundamental program analysis algorithm.Exploring the code representation/security specification in diverse scenarios.I am looking for multiple Ph.D. and MPhil students as well as RAs. If you pursue making the program more secure and reliable, please feel free to send me an email.NEWS!Our paper on detecting false negative vulnerabilities on autonomous driving simulators has been accepted in TDSC!Our paper on studying the challenges of applying LLM for software vulnerability detection has been accepted in CSUR！Our extension paper of GiantSan (ASPLOS’24 Best Paper) is accepted in TOCS for less instrumentation overhead!Our paper on optimizing fuzzing with fine-grained scheduling feedback is accepted in TOSEM!Our paper on parallel fuzzing is accepted in ISSTA 25!Our paper on decoupling sanitizers from fuzzing is accepted in ICSE 25!Our study for Android APP token privacy leakage issues has been accepted in EMSE 25!Our extension paper on Android testing is accepted in ICSE 25!Entering the finale of DARPA AIxCC! All you need is a fuzzing brain!Our work on fuzzing Android applications is accepted at TSE!One ASPLOS 2025 submission is accepted!Received ASPLOS 2024 Best Paper Award for GiantSan! Congratulations, Hao!Two ASPLOS 2024 submissions get accepted!Another directed fuzzing work has been accepted by S&P 2024 (again)!Our multi-target directed fuzzing work has been accepted by S&P 2024!Received Google Research Paper award for our directed fuzzer published in S&P 2022!Received Huawei distinguished collaborator award on deploying Pangolin (S&P 2020)!AwardFinalist of DARPA AIxCC, 2024ACM SIGARCH Best Paper Award (ASPLOS), 2024Google Research Paper Award, 2022Huawei Distinguish Collaborator, 2021StudentsI am fortunate to work with the following students:Zirui Lin (PhD, 2025)Haoyu Zhang (PhD, 2025, co-supervised with SLAI)Weiwei Fu (PhD, 2024, co-supervision)Shuo Yang (PhD, 2024)Xiang Li (RA, 2024)Publication(* corresponding author)TDSC’25ICSFuzz: Collision Detector Bug Discovery in Autonomous Driving Simulators(To appear) Weiwei Fu, Heqing Huang*, Yifan Zhang, Ke Zhang, Jin Huang, Weibin Lee, Jianping Wang. IEEE Transactions on Dependable and Secure Computing. [Artifacts]CSUR‘25LLMs in Software Security: A Survey of Vulnerability Detection Techniques and Insights Ze Sheng, Zhicheng Chen, Shuning Gu, Heqing Huang, Guofei Gu, Jeff Huang. ACM Computing SurveysTOCS’25GIANTSAN: Efficient Operation-Level Memory Sanitization with Segment Folding [Artifacts] Hao Ling, Heqing Huang*, Chengpeng Wang, Yuandao Cai, Charles Zhang. ACM Transactions on Computer SystemsTOSEM’25Efficient Fuzzing Infrastructure for Pointer-to-Object Association Hao Ling, Heqing Huang*, Yuandao Cai, Charles Zhang. ACM Transactions on Software Engineering and MethodologyISSTA’25KRAKEN: Program-Adaptive Parallel Fuzzing Anshunkang Zhou, Heqing Huang*, Charles Zhang. The 34th ACM SIGSOFT International Symposium on Software Testing and Analysis.ICSE’25SAND: Decoupling Sanitization from Fuzzing for Low Overhead Ziqiao Kong#, Shaohua Li#, Heqing Huang, Zhendong Su (#Equal Contribution) IEEE/ACM International Conference on Software EngineeringICSE’25Mole: Efficient Crash Reproduction in Android Applications With Enforcing Necessary UI Events Maryam Masoudian, Heqing Huang, Morteza Amini, Charles Zhang. IEEE/ACM International Conference on Software Engineering, Journal-FirstEMSE’25How Far are App Secrets from Being Stolen? A Case Study on Android Lili Wei*, Heqing Huang*, Shing-Chi Cheung, Kevin Li. Empirical Software EngineeringASPLOS’24Manta: Hybrid-Sensitive Type Inference Toward Type-Assisted Bug Detection for Stripped Binaries Chengfeng Ye, Yuandao Cai, Anshunkang Zhou, Heqing Huang, Hao Ling, Charles Zhang. ACM Conference on Architectural Support for Programming Languages and Operating SystemsTSE’24Mole: Efficient Crash Reproduction in Android Applications with Enforcing Necessary UI Events Maryam Masoudian, Heqing Huang, Morteza Amini, Charles Zhang. IEEE Transactions on Software EngineeringASPLOS’24bGIANTSAN: Efficient Memory Sanitization with Segment Folding [Artifacts] Hao Ling, Heqing Huang*, Chengpeng Wang, Yuandao Cai, Charles Zhang. ACM Conference on Architectural Support for Programming Languages and Operating Systems 🏆 ACM SIGPLAN Best Paper AwardASPLOS’24aPlankton: Reconciling Binary Code and Debug Information Anshunkang Zhou, Chengfeng Ye, Heqing Huang*, Yuandao Cai, Charles Zhang. ACM Conference on Architectural Support for Programming Languages and Operating SystemsS&P’24bEverything is Good for Something: Counterexample-Guided Directed Fuzzing via Likely Invariant Inference Heqing Huang, Anshunkang Zhou, Mathias Payer, Charles Zhang. The 45th IEEE Symposium on Security and Privacy.S&P’24aTitan: Efficient Multi-target Directed Greybox Fuzzing Heqing Huang, Peisen Yao, Hung-Chun Chiu, Yiyuan Guo, Charles Zhang. The 45th IEEE Symposium on Security and Privacy. [Artifacts]TDSC’23Balance Seed Scheduling via Monte Carlo Planning Heqing Huang, Hung-Chun Chiu, Qingkai Shi, Peisen Yao, Charles Zhang. IEEE Transactions on Dependable and Secure Computing. [Artifacts]S&P’22BEACON: Directed Grey-Box Fuzzing with Provable Path Pruning Heqing Huang, Yiyuan Guo, Qingkai Shi, Peisen Yao, Rongxin Wu, Charles Zhang. The 43rd IEEE Symposium on Security and Privacy. [Artifacts] 🏆 Google Research Paper Award OOPSLA’21Program Analysis via Efficient Symbolic Abstraction Peisen Yao, Qingkai Shi, Heqing Huang, Charles Zhang. The 36th ACM SIGPLAN Conference on Object Oriented Programming, Systems, Languages and ApplicationsFSE’21Skeletal Approximation Enumeration for SMT Solver Testing Peisen Yao, Heqing Huang*, Wensheng Tang, Qingkai Shi, Rongxin Wu, Charles Zhang. The 29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software EngineeringISSTA’21Fuzzing SMT Solvers via Two-Dimensional Input Space Exploration Peisen Yao, Heqing Huang, Wensheng Tang, Qingkai Shi, Rongxin Wu, Charles Zhang. The 30th ACM SIGSOFT International Symposium on Software Testing and Analysis.S&P’20Pangolin: Incremental Hybrid Fuzzing via Polyhedral Path Abstraction Heqing Huang, Peisen Yao, Rongxin Wu, Qingkai Shi, Charles Zhang. The 41st IEEE Symposium on Security and Privacy. ISSTA’20Fast Bit-Vector Satisfiability Peisen Yao, Qingkai Shi, Heqing Huang, Charles Zhang. The 29th ACM SIGSOFT International Symposium on Software Testing and Analysis.Academic ServiceChairPublicity co-chair, SPLASH 2025Program local co-chair, SETTA 24Committe and ReviewerProgram committee, CCS 26Program committee, CCS 25Program committee, ISSTA 25Program committee, CCS 24Program committee, SANER 23 (Tool Track)Reviewer, TDSC 25Reviewer, TSE 25Reviewer, TIFS 24Reviewer, TSE 23Reviewer, TIFS 23Reviewer, TDSC 22Reviewer, TIFS 20Sub-/Co-reviewerPLDI’23ASE’21FSE’19ISSTA’19ASE’18Teaching ServiceCS2311 - Computer Programming (2024 Fall)CS3402 - Database System (2024 Spring)Funding and CooperationOur work Pangolin published in S&P 2020 has been successfully deployed in the Huawei tool-chain and detected more than 1000+ crashes/bugs! We have thus received the Huawei Distinguish Collaborator 2021 award! This is also reported by HKUST CSE department!Bugs HuntingOur self-built fuzzing framework (Integration of S&P’20, 22, 24, TDSC’23) has discovered more than 1000 bugs in the widely-used commercial and open-source projects, with over 100 of them assigned with CVE IDs and over $10K bounties. A partial of vulnerabilities detected can be found here. We also list the bugs found specifically for SMT theorem provers here.MiscsTips on writting a research paper (Thomas Reps)How to write a technical paper or a research paper (Michael Ernst)",
  "content_length": 8564,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:05"
}