{
  "name": "Herbert Edelsbrunner",
  "homepage": "https://ist.ac.at/research/research-groups/edelsbrunner-group",
  "status": "success",
  "content": "ISTA | Edelsbrunner Group HomeResearchEdelsbrunner Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Edelsbrunner Group Algorithms, Computational Geometry, and Computational Topology Understanding the world in terms of patterns and relations is the undercurrent in computational geometry and topology, the broad research area of the Edelsbrunner group.While geometry measures shapes, topology focuses its attention on how the shapes are connected. These shapes may be three-dimensional (an artistic sculpture or a cave in a mountain), it may be four-dimensional (a galloping horse or a flexing protein), or it may even have many more than four dimensions (the configuration space of a robot or the expression pattern of a cancer). The Edelsbrunner group approaches the two related subjects of geometry and topology from a computational point of view. The computer aids in this study and it is used to make the insights useful in applications and workable for non-specialists. The group believes in a broad approach that does not sacrifice depth, including the development of new mathematics, the design of new algorithms and software, and the application in industry and other areas of science. Candidate areas for fruitful collaborations include 3D printing, structural molecular biology, neuroscience, and, more generally, data analysis. Herbert Edelsbrunner Professor-Extension of Service +43 2243 9000 3301 Herbert.Edelsbrunner@ist.ac.at Administrative Support Christine Ostermann Assistant to Professors +43 2243 9000 1071 Christine.Ostermann@ist.ac.at Team Yossi Bokor Bleile Postdoc Yossi.BokorBleile@ist.ac.at Chris Fillmore PhD Student christopher.fillmore@ist.ac.at Michal Lipinski Postdoc Michal.Lipinski@ist.ac.at Irene Pisapia PhD Student Irene.Pisapia@ist.ac.at Nicolò Zava Postdoc Nicolo.Zava@ist.ac.at Current Projects Discretization in geometry and dynamics | Topological data analysis Publications Edelsbrunner H, Pach J. 2025. Maximum Betti numbers of Čech complexes. Discrete & Computational Geometry. View Edelsbrunner H, Stephenson ER, Thoresen MH. 2025. The mid-sphere cousin of the medial axis transform. 4th International Joint Conference on Discrete Geometry and Mathematical Morphology. DGMM: Discrete Geometry and Mathematical Morphology, LNCS, vol. 16296, 133–147. View Edelsbrunner H, Garber A, Ghafari M, Heiss T, Saghafian M. 2025. Flips in two-dimensional hypertriangulations. European Journal of Combinatorics. 132, 104248. View Biswas R, Cultrera di Montesano S, Draganov O, Edelsbrunner H, Saghafian M. 2025. On the size of chromatic Delaunay mosaics. Discrete and Computational Geometry. View Chambers EW, Fillmore CD, Stephenson ER, Wintraecken M. 2025. Burning or collapsing the medial axis is unstable. La Matematica. View View All Publications ReX-Link: Herbert Edelsbrunner Career Since 2009 Professor, Institute of Science and Technology Austria (ISTA)2004 – 2012 Professor of Mathematics, Duke University, Durham, USA1999 – 2012 Arts and Sciences Professor for Computer Science, Duke University, Durham, USA1996 – 2013 Founder, Principal, and Director, Raindrop Geomagic1985 – 1999 Assistant, Associate, and Full Professor, University of Illinois, Urbana-Champaign, USA1981 – 1985 Assistant, Graz University of Technology, Austria1982 PhD, Graz University of Technology, Austria Selected Distinctions ISI Highly Cited Researcher2018 Wittgenstein Award2014 Fellow of the European Association for Theoretical Computer Science2014 Member, Austrian Academy of Sciences (ÖAW)2012 Corresponding Member of the Austrian Academy of Sciences2008 Member, German Academy of Sciences Leopoldina2006 Honorary Doctorate, Graz University of Technology2005 Member, American Academy of Arts and Sciences1991 Alan T. Waterman Award, National Science Foundation Additional Information View Edelsbrunner websiteMathematics at ISTA Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6293,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:08"
}