{
  "name": "Herbert Kuchen",
  "homepage": "https://www.wi.uni-muenster.de/de/institut/pi/personen/herbert-kuchen",
  "status": "success",
  "content": "Prof. Dr. Herbert Kuchen | Institut für Wirtschaftsinformatik VCard QR-Code Prof. Dr. Herbert Kuchen Professor Lehrstuhl für Praktische Informatik in der Wirtschaft (Prof. Kuchen) Leonardo Campus 3 48149 Münster kuchen@wi.uni-muenster.de Über Publikationen Projekte Auszeichnungen Veranstaltungen Abschlussarbeitsbetreuung Aktuelle Aktivitäten Forschungsschwerpunkte Modell-getriebene Software-Entwicklung Parallele Programmierung Testen Funktional-logische Programmierung Elektronische Prüfungen Akademische Ausbildung 1995 Habilitation, Erlangung der Venia legendi für Informatik an der RWTH Aachen 1989 Promotion zum Dr. rer. nat. an der RWTH Aachen, Dissertationsthema: \"Parallele Implementierung funktionaler Sprachen\", Betreuer: Prof. Dr. Klaus Indermark 1984 Abschluss des Studiums als Diplom-Informatiker an der RWTH Aachen 1978- 1984 Studium der Informatik an der RWTH Aachen Beruflicher Werdegang seit 2004 Direktor des European Research Center for Information Systems (ERCIS), WWU Münster seit 1997 Professor für Praktische Informatik an der Westfälischen Wilhelms-Universität Münster (zunächst C3, ab 2005 W2) 1997 Vertretung einer C3-Professur an der Westfälischen Wilhelms-Universität Münster 1996- 1997 Vertretung einer C4-Professur an der RWTH Aachen 1995- 1996 Vertretungsprofessur an der Universität Gießen (C4-Vertretung) 1994- 1995 Akademischer Oberrat an der RWTH Aachen 1993 Lehrauftrag an der Universität Ulm 1993 Forschungsaufenthalt an der Chalmers University of Technology, Göteborg, Schweden 1992- 1994 Akademischer Rat an der RWTH Aachen 1991- 1992 Profesor asociado an der Universidad Politécnica de Madrid, Spanien 1990- 1991 Wissenschaftlicher Assistent am Lehrstuhl für Informatik II der RWTH Aachen 1984- 1990 Wissenschaftlicher Mitarbeiter am Lehrstuhl für Informatik II (Leitung: Prof. Dr. Klaus Indermark) der RWTH Aachen Mitgliedschaften und Aktivitäten in Gremien seit 2022 Mitglied im Programmkomitee,, 17th International Conference on Software Technologies (ICSOFT 2022), Lisbon, Portugal. seit 2022 Mitglied im Programmkomittee,, 28th International European Conference on Parallel and Distributed Computing (Euro-Par 2022), Glasgow, UK. seit 2022 Mitglied im Programmkomitee der, ACM SAC 2022, SE track, Brno, Czech Republic. seit 2022 Mitglied im Programmkomitee der, DSAI 2022, Lisbon, Portugal. seit 2022 Mitglied im Programmkomitee der, 15th International Symposium on High-level Parallel Programming and Applications (HLPP 2022), Porto, Portugal. seit 2022 Mitglied im Programmkomitee,, SACLA 2022, Cape Town, South Africa. seit 2021 Mitglied im Programmkomitee der, International Symposium on High-Level Parallel Programming and Applications (HLPP)., International Symposium on High-Level Parallel Programming and Applications (HLPP). seit 2021 Mitglied im Programmkomitee,, International Conference on Managed Programming Languages & Runtimes (MPLR). 2020 Mitglied im Programmkomitee der SOFTENG 2020, Lissabon, Portugal 2019 Mitglied im Programmkomitee der WFLP 2019, Cottbus, Deutschland 2019 Mitglied im Programmkomitee der LOPSTR 2019, Porto, Portugal 2019 Mitglied im Programmkomitee der LA-CCI 2019, Guayaquil, Ecuador 2019 Mitglied im Programmkomitee der HLPP 2019, Linköping, Schweden 2019 Mitglied im Programmkomitee der ParCo 2019, Prag, Tschechien 2019 Mitglied im Programmkomitee der 6th International Symposium on Formal Approaches to Parallel and Distributed Systems (4PAD), 2019, Dublin, Irland 2019 Mitglied im Programmkomitee der VALID 2019, Valencia, Spanien 2019 Mitglied im Programmkomitee der ScalCom 2019, Leicester, UK 2019 Mitglied im Programmkomitee der HLPGPU 2019, HiPEAC, Valenzia, Spanien 2019 Mitglied im Programmkomitee der INFOCOMP 2019, Nizza, Frankreich 2019 Mitglied im Programmkomitee der SBD 2019 (ACM SIGMOD), Amsterdam, Niederlande 2019 Mitglied im Programmkomitee der SOFTENG 2019, Valenzia, Spanien 2018 Mitglied im Programmkomitee der HLPGPU 2018, Manchester, England 2018 Mitglied im Programmkomitee der SAC 2018, Track SE, Pau, Frankreich 2018 Mitglied im Programmkomitee der SAC 2018, Track PAPP, Pau, Frankreich 2018 Mitglied im Programmkomitee der INFOCOMP 2018, Barcelona, Spanien 2018 Mitglied im Programmkomitee der SOFTENG 2018, Athen, Griechenland 2018 Mitglied im Programmkomitee der SBD 2018, Houston, Texas, USA 2018 Mitglied im Programmkomitee der WFLP 2018, Frankfurt a.M., Deutschland 2018 Mitglied im Programmkomitee der ScalCom 2018, Guangzhou, China 2018 Mitglied im Programmkomitee der HLPP 2018, Orléans, Frankreich 2018 Mitglied im Programmkomitee der SACLA 2018, Cape Town, Südafrika 2018 Mitglied der Programmkomitee der VALID 2018, Nizza, Frankreich 2018 Gastautor \"International Journal of Parallel Computation\", Special Issue on High-Level Parallel Programming with Algorithmic Skeletons, 2018 2017 Mitglied im Programmkomitee der LA-CCI 2017, Arequipa, Peru 2017 Mitglied im Programmkomitee der WFLP 2017, Kiel, Deutschland 2017 Mitglied im Programmkomitee der HLPP 2017, Valladolid, Spanien 2017 Mitglied im Programmkomitee der ParCo 2017, Bologna, Italien 2017 Mitglied im Programmkomitee der PASCO 2017, Kaiserslautern, Deutschland 2017 Mitglied im Programmkomitee der INFOCOMP 2017, Venedig, Italien 2017 Mitglied im Programmkomitee der HLPGPU 2017, Stockholm, Schweden 2017 Mitglied im Programmkomitee der SBD 2017, Raleigh, USA 2017 Mitglied im Programmkomitee der SOFTENG 2017, Venedig, Italien 2017 Mitglied im Programmkomitee der SACLA 2017, Magaliesburg, Südafrika 2017 Gastredakteur des International Journal of Parallel Computation, Special Issue on High-Level Parallel Programming with Algorithmic Skeletons, 2017 2017 Gastredakteur der Parallel Processing Letters 27(1), 2017 2017 Mitglied im Programmkomitee der SACLA 2017, Magaliesburg, Südafrika 2016 Mitglied im Programmkomitee der QRS 2016, Wien, Österreich 2016 Mitglied im Programmkomitee der ACM SAC 2016, Track SE, Pisa, Italien 2016 Mitglied im Programmkomitee der SBD 2016, San Francisco, USA 2016 Mitglied im Programmkomitee der SACLA 2016, Pretoria, Südafrika 2016 Mitglied im Programmkomitee der HLPGPU 2016, Prag, Tschechien 2016 Mitglied im Programmkomitee der SOFTENG 2016, Lissabon, Portugal 2016 Organisator und Mitglied im Programmkomitee, HLPP 2016, Münster, Deutschland seit 2013 Herausgeber von Open Journal of Web Technologies, 2013 2013- 2017 Berufung zum DAAD-Auswahlkommissionsmitglied 2010 Mitglied der Jury des Innovationspreises IT 2010 der Initiative Mittelstand seit 2007 Mitglied des wissenschaftlichen Beirats der IMDEA-Software 2003- 2008 Mitglied des Vorstands der Regionalgruppe Münsterland der Gesellschaft für Informatik e.V. 2001- 2010 Mitglied des Steering Commitee des International Symposium on Functional and Logic Programming (FLOPS) 2001- 2006 Mitglied im Vorstand der European Association for Programming Languages and Systems (EAPLS) 1997- 2003 Mitglied des Steering Commitee der ACM Conference on Principles and Practice of Declarative Programming (PPDP) 1995- 2010 Stellvertretender Vorsitzender der Fachgruppe \"Programmiersprachen und Rechenkonzepte\" der Gesellschaft für Informatik e.V. Rufe 2005 Ruf an die Universität der Bundeswehr München (abgelehnt) 1998 Ruf an die Martin Luther Universität Halle-Wittenberg (abgelehnt)",
  "content_length": 7259,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:07"
}