{
  "name": "Hercules Avramopoulos",
  "homepage": "https://www.photonics.ntua.gr/people/prof-hercules-avramopoulos",
  "status": "success",
  "content": "PROF. HERCULES AVRAMOPOULOS – PCRL Skip to content PROF. HERCULES AVRAMOPOULOS Short BioHercules Avramopoulos is a full Professor of the School of Electrical and Computer Engineering at the National Technical University of Athens (NTUA). He also heads the Photonics Communications Research Laboratory-PCRL, that he founded in 1995 and that currently numbers 31 doctoral, post-doctoral researchers and support personnel. Before this he has worked in Area 11 (the research area) of AT&T Bell Laboratories, Holmdel, NJ, as a member of technical staff.  He has performed and led blue-sky and applied research to turn photonics concepts into applied solutions for telecoms, datacoms and sensing. He has initiated and successfully lead more than 23 large, collaborative, cross-European, research projects. He has authored/co-authored around 500 articles in peer reviewed international journals and conference presentations and holds several international patents. He has also served in posts as Panel Member of the European Research Council (ERC), member of conference program committees (currently for the European Conference in Photonic Communications (ECOC)), has been an active member of the Board of Stakeholders of the Photonics 21 Association and others. Most happily he has been the advisor of 35 young engineers and physicists that have completed their research towards their PhDs and a further 11 are currently at various stages of the completion of their research at PCRL. They have attracted several distinctions at a national and international level. Seven of the alumni of PCRL are now faculty academics in Greek universities and have developed independent research lines while others have attained high profile posts in industry and two of them have spawned 2 start-ups. Contact Details Professor, Head of PCRL Photonics Communication Research Laboratory Department of Electrical and Computer Engineering (Old Building), National Technical University of Athens 9 Iroon Polytechniou Street 15773, Zografou Athens, Hellas (Greece) +30 210 772 2076 hav ΑΤ mail.ntua.gr Our team Prof. Hercules AvramopoulosPROFESSOR, HEAD OF PCRL Envelope Dr. Dimitrios ApostolopoulosASSISTANT PROFESSOR Envelope Dr. Costis ChristogiannisPROJECT MANAGER Envelope Dr. Maria MassaoutiSENIOR RESEARCHER Envelope Dr. Charalampos ZervosSENIOR RESEARCHER Envelope Dr. Maria SpyropoulouSENIOR RESEARCHER Envelope Dr. Sani ParaskevopoulouSENIOR RESEARCHER Envelope Dr. Giannis GiannoulisSENIOR RESEARCHER Envelope Dr. Giannis PoulopoulosSENIOR RESEARCHER Envelope Dr. Giannis KanakisSENIOR RESEARCHER Envelope Dr. Christos TsokosSENIOR RESEARCHER Envelope Dr. Aristeidis StathisSenior Researcher Envelope Dr. Thenia ProusalidiSenior Researcher Envelope Panagiotis ToumasisRESEARCH SCIENTIST Envelope Efstathios AndrianopoulosRESEARCH SCIENTIST Envelope Evridiki KyriaziRESEARCH SCIENTIST Envelope Argiris NtanosRESEARCH SCIENTIST Envelope George SyriopoulosRESEARCH SCIENTIST Envelope Giorgos BrestasRESEARCH SCIENTIST Envelope Adamantia Maria GrammatikakiResearch Scientist Envelope Georgios MegasRESEARCH SCIENTIST Envelope Panagiotis KoureliasRESEARCH SCIENTIST Envelope Poly VlasiADMINISTRATIVE STAFF Envelope Vasia LampropoulouADMINISTRATIVE STAFF Envelope Ioanna ChristogianniADMINISTRATIVE STAFF Envelope",
  "content_length": 3291,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:13"
}