{
  "name": "Herke van Hoof",
  "homepage": "https://staff.fnwi.uva.nl/h.c.vanhoof",
  "status": "success",
  "content": "Herke van Hoof Skip to content Bio Herke van Hoof is currently associate professor at the University of Amsterdam in the Netherlands, where he is part of the Amlab. He is interested in modular reinforcement learning. Reinforcement learning is a very general framework, but this tends to result in extremely data-hungry algorithms. Exploiting modular structures, including hierarchical structures, allows sharing information between tasks and exploiting prior knowledge, to learn more with less data. Before joining the University of Amsterdam, Herke van Hoof was a postdoc at McGill University in Montreal, Canada, where he worked with Professors Joelle Pineau, Dave Meger, and Gregory Dudek. He obtained his PhD at TU Darmstadt, Germany, under the supervision of Professor Jan Peters, where he graduated in November 2016. Herke got his bachelor and master degrees in Artificial Intelligence at the University of Groningen in the Netherlands. Recent news SIKS course on “Reinforcement Learning for Adaptive Hybrid Intelligence” (9/8/2025) I am co-organizing a two-day graduate course on “Reinforcement Learning for Adaptive Hybrid Intelligence”. We will discuss RL basics and specific challenges for using RL as an assistant or collaborator. Registration and more information via the SIKS website. Deadline extensions “AI for safety-critical infrastructure workshop” (6/13/2025) The deadline is now extended for submissions to the AI for safety-critical infrastructure workshop at ECML PKDD.📅 15th September 2025📍Porto, Portugal⏰ NEW Submission deadline: 21st June 2025Info and submission 👉 https://lnkd.in/drjkZ5Rt Open PhD position on interactive robot learning at VU (5/23/2025) We are recruiting a PhD candidate within the The Hybrid Intelligence Centre on the topic of interactive robot learning with flexible human input. The student will be based at the Vrije Universiteit with Kim Baraka as main supervisor (I will be co-supervisor).Deadline is June 15, 2025.More information and application through this website. An archive of news items can be found on the News page. Highlighted publications Kuric, D.; Infante, G.; Gómez, V.; Jonsson, A.; van Hoof, H.: Planning with a Learned Policy Basis to Optimally Solve Complex Tasks. In: International Conference on Automated Planning and Scheduling, 2024. (Type: Proceedings Article | Links | BibTeX)@inproceedings{kuric2024planning, title = {Planning with a Learned Policy Basis to Optimally Solve Complex Tasks}, author = {Kuric, D. and Infante, G. and Gómez, V. and Jonsson, A. and van Hoof, H. }, url = {https://openreview.net/forum?id=6N1uCtBhcL}, year = {2024}, date = {2024-06-01}, urldate = {2024-06-01}, booktitle = {International Conference on Automated Planning and Scheduling}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Closehttps://openreview.net/forum?id=6N1uCtBhcLClose Gagrani, Mukul; Rainone, Corrado; Yang, Yang; Teague, Harris; Jeon, Wonseok; Hoof, Herke; Zeng, Weiliang Will; Zappi, Piero; Lott, Christopher; Bondesan, Roberto: Neural Topological Ordering for Computation Graphs. In: Advances in Neural Information Processing Systems, 2022. (Type: Proceedings Article | Links | BibTeX)@inproceedings{gagrani2022neural, title = {Neural Topological Ordering for Computation Graphs}, author = {Mukul Gagrani and Corrado Rainone and Yang Yang and Harris Teague and Wonseok Jeon and Herke Hoof and Weiliang Will Zeng and Piero Zappi and Christopher Lott and Roberto Bondesan}, url = {https://arxiv.org/abs/2207.05899}, year = {2022}, date = {2022-11-29}, booktitle = {Advances in Neural Information Processing Systems}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Closehttps://arxiv.org/abs/2207.05899Close Kool, Wouter; Hoof, Herke Van; Welling, Max: Stochastic Beams and Where To Find Them: The Gumbel-Top-k Trick for Sampling Sequences Without Replacement. In: International Conference on Machine Learning, pp. 3499–3508, 2019. (Type: Proceedings Article | Links | BibTeX)@inproceedings{kool2019stochastic, title = {Stochastic Beams and Where To Find Them: The Gumbel-Top-k Trick for Sampling Sequences Without Replacement}, author = {Wouter Kool and Herke Van Hoof and Max Welling}, url = {http://proceedings.mlr.press/v97/kool19a/kool19a.pdf http://proceedings.mlr.press/v97/kool19a/kool19a-supp.pdf}, year = {2019}, date = {2019-06-10}, urldate = {2019-06-10}, booktitle = {International Conference on Machine Learning}, pages = {3499–3508}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Closehttp://proceedings.mlr.press/v97/kool19a/kool19a.pdfhttp://proceedings.mlr.press/v97/kool19a/kool19a-supp.pdfClose Smith, M.; Hoof, H.; Pineau, J.: An Inference-Based Policy Gradient Method for Learning Options. In: International Conference on Machine Learning, pp. 4703-4712, 2018. (Type: Proceedings Article | Links | BibTeX)@inproceedings{smith2018inference, title = {An Inference-Based Policy Gradient Method for Learning Options}, author = {M. Smith and H. Hoof and J. Pineau}, url = {http://proceedings.mlr.press/v80/smith18a/smith18a.pdf}, year = {2018}, date = {2018-07-10}, booktitle = {International Conference on Machine Learning}, pages = {4703-4712}, keywords = {}, pubstate = {published}, tppubtype = {inproceedings} } Closehttp://proceedings.mlr.press/v80/smith18a/smith18a.pdfClose Hoof, H. Van; Neumann, G.; Peters, J.: Non-parametric Policy Search with Limited Information Loss. In: Journal of Machine Learning Research, vol. 18, no. 73, pp. 1-46, 2017. (Type: Journal Article | Links | BibTeX)@article{hoof2017nonparametric, title = {Non-parametric Policy Search with Limited Information Loss}, author = {H. Van Hoof and G. Neumann and J. Peters}, editor = {K. Murphy}, url = {http://jmlr.org/papers/volume18/16-142/16-142.pdf}, year = {2017}, date = {2017-08-01}, journal = {Journal of Machine Learning Research}, volume = {18}, number = {73}, pages = {1-46}, keywords = {}, pubstate = {published}, tppubtype = {article} } Closehttp://jmlr.org/papers/volume18/16-142/16-142.pdfClose",
  "content_length": 6044,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:12"
}