{
  "name": "Hermann de Meer",
  "homepage": "http://www.fim.uni-passau.de/en/computer-networks",
  "status": "success",
  "content": "Professor Hermann de Meer - University of Passau Information for... Information for... Current students Prospective students Academics Early career researchers Businesses Alumni and friends Staff Media representatives Faculties & facilities Administration Central facilities Faculties Faculty of Law Faculty of Social and Educational Sciences Faculty of Humanities and Cultural Studies School of Business, Economics and Information Systems Faculty of Computer Science and Mathematics Central facilities Graduate Centre PICAIS Sports Centre Language Centre University Library Centre for Information Technology and Media Services Teacher Education Centre Central facilities Research Strategy & Science Communication Executive Support Unit for Health and Safety Executive Support Unit for Competency Development in Study and Teaching Executive Support Unit for Process Management Managing Office of the Bavarian Higher Education Digitalisation Association (BHEDA) Research Services Graduate Centre PICAIS Sports Centre Language Centre University Library Centre for Information Technology and Media Services Teacher Education Centre Heading Information for... Faculties & facilities Login Go directly to... Apply Study options Academic Advice Service Course catalogue International Office Careers and Competencies Examinations Office Graduate Centre Student Services Association University Library en de Information for... Faculties & facilities Go directly to... Apply Study options Academic Advice Service Course catalogue International Office Careers and Competencies Examinations Office Graduate Centre Student Services Association University Library Support Login en de Chair of Computer Networks and Computer Communications Chair of Computer Networks and Computer Communications Team Professor Hermann de Meer and the team of the computer networks and computer communications group will gladly answer any questions you may have. Using the staff and guests link, you will find information regarding contact, consulting hours and responsibilities of our staff members. Research The main areas of our research are: Network analysis and virtualization, self-organizing systems, IT security, safety and energy-efficiency. The group repeatedly proved its excellent research in several national and international projects. Teaching The teaching curriculum covers fundamental aspects in computer networking (e.g. \"Rechnernetze and Verteilte Systeme\") and computer communication and also advanced aspects such as \"Functional Safety\" or \"Energy Informatics\". Professor Hermann de Meer Tuesday, 2:00 - 3:00 pm Please make before an appointment with the secretaries office. Secretaries office Anuschka Loibl and Leonie Schmid Monday - Friday: 9:00 am - 4:00 pm E-mail: sekhdm@uni-passau.de Phone: +49 851 509 3051 Fax: +49 851 509 3052 E-mail: sekhdm@fim.uni-passau.de Last updated: | Page ID: 15734 Share page Print page Modal Share content via Facebook LinkedIn E-mail I agree that a connection to the Vimeo server will be established when the video is played and that personal data (e.g. your IP address) will be transmitted. I agree that a connection to the YouTube server will be established when the video is played and that personal data (e.g. your IP address) will be transmitted. Show video",
  "content_length": 3289,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:15"
}