{
  "name": "Herman Saksono",
  "homepage": "https://www.khoury.northeastern.edu/people/herman-saksono",
  "status": "success",
  "content": "Herman Saksono - Khoury College of Computer Sciences All People Herman Saksono (he/him) Assistant Professor, Jointly Appointed with Bouvé College of Health Sciences Research interests Research interests Human-centered computing Personal health informatics Education Education PhD in Computer Science, Northeastern University MS in Computer Science, Northeastern University BE in Electrical Engineering, Universitas Gadjah Mada — Indonesia Biography Biography Herman Saksono is an assistant professor in the Khoury College of Computer Sciences and the Bouvé College of Health Sciences at Northeastern University, based in Boston. Saksono’s interdisciplinary research contributes to human–computer interaction and digital health equity through his social health informatics research agenda. The goal of this agenda is to investigate how personal health informatics tools can catalyze social interactions that encourage positive health behaviors. By enabling positive social interactions in health technologies, marginalized communities can further amplify their internal strengths and enhance health equity from within. To meet these goals, Saksono has designed, developed, and evaluated health apps including Storywell, Go & Grow, and Spaceship Launch. Previously, Saksono was a postdoctoral research fellow at Harvard University‘s Center of Research in Computation and Society, where he worked with Krzsystof Gajos at Harvard School of Engineering and Applied Sciences. During his doctoral studies at Northeastern, he worked with Andrea G. Parker in the Wellness Technology Lab, which is now at Georgia Tech. Saksono received a Fulbright scholarship for his computer science master’s study in 2012–14. Recent publications Recent publications Published: September 9, 2025 “An Ad Posing as Medical Advice”: User Accounts of Dark UX in FemTech mHealth Apps MHCI003 Citation: Ghada Alsebayel, Giovanni Maria Troiano, Johanna Gunawan, Herman Saksono, Casper Harteveld. (2025). \"An Ad Posing as Medical Advice\": User Accounts of Dark UX in FemTech mHealth Apps MHCI003 Proc. ACM Hum. Comput. Interact., 9, 1-34. https://doi.org/10.1145/3743736 Published: August 30, 2024 Socio-Cognitive Framework for Personal Informatics: A Preliminary Framework for Socially-Enabled Health Technologies Citation: Herman Saksono, Andrea G. Parker. (2024). Socio-Cognitive Framework for Personal Informatics: A Preliminary Framework for Socially-Enabled Health Technologies ACM Trans. Comput. Hum. Interact., 31, 42:1-42:41. https://doi.org/10.1145/3674504 Published: May 1, 2021 StoryMap: Using Social Modeling and Self-Modeling to Support Physical Activity Among Families of Low-SES Backgrounds Citation: Herman Saksono, Carmen Castaneda-Sceppa, Jessica A. Hoffman, Magy Seif El-Nasr, and Andrea Parker. 2021. StoryMap: Using Social Modeling and Self-Modeling to Support Physical Activity Among Families of Low-SES Backgrounds. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI '21). Association for Computing Machinery, New York, NY, USA, Article 203, 1–14. https://doi.org/10.1145/3411764.3445087 Published: October 15, 2020 Go&Grow: An Evaluation of a Pervasive Social Exergame for Caregivers of Loved Ones with Dementia Citation: Xin Yao Lin, Herman Saksono, Elizabeth Stowell, Margie E. Lachman, Carmen Castaneda-Sceppa, Andrea G. Parker. (2020). Go&Grow: An Evaluation of a Pervasive Social Exergame for Caregivers of Loved Ones with Dementia Proc. ACM Hum. Comput. Interact., 4, 151:1-151:28. https://doi.org/10.1145/3415222 Published: April 1, 2020 Storywell: Designing for Family Fitness App Motivation by Using Social Rewards and Reflection Citation: Herman Saksono, Carmen Castaneda-Sceppa, Jessica Hoffman, Vivien Morris, Magy Seif El-Nasr, and Andrea G. Parker. 2020. Storywell: Designing for Family Fitness App Motivation by Using Social Rewards and Reflection. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI '20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376686 Published: August 5, 2019 Social Reflections on Fitness Tracking Data: A Study with Families in Low-SES Neighborhoods Citation: Herman Saksono, Carmen Castaneda-Sceppa, Jessica Hoffman, Magy Seif El-Nasr, Vivien Morris, and Andrea G. Parker. 2019. Social Reflections on Fitness Tracking Data: A Study with Families in Low-SES Neighborhoods. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). ACM, New York, NY, USA, Paper 313, 14 pages. DOI Published: July 24, 2018 Family Health Promotion in Low-SES Neighborhoods: A Two-Month Study of Wearable Activity Tracking Citation: Herman Saksono, Carmen Castaneda-Sceppa, Jessica Hoffman, Magy Seif El-Nasr, Vivien Morris, Andrea G. Parker. 2018. Family Health Promotion in Low-SES Neighborhoods: A Two-Month Study of Wearable Activity Tracking. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). ACM. Published: July 24, 2018 Designing and Evaluating mHealth Interventions for Vulnerable Populations: A Systematic Review Citation: Elizabeth Stowell, Mercedes C. Lyson, Herman Saksono, Reneé C. Wurth, Holly Jimison, Misha Pavel, Andrea G. Parker. 2018. Designing and Evaluating mHealth Interventions for Vulnerable Populations: A Systematic Review. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). ACM. Published: May 6, 2017 Reflective Informatics Through Family Storytelling: Self-discovering Physical Activity Predictors Citation: Herman Saksono and Andrea Grimes Parker. 2017. Reflective Informatics Through Family Storytelling: Self-discovering Physical Activity Predictors. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17, ACM. Published: May 7, 2016 Youth Advocacy in SNAs: Challenges for Addressing Health Disparities Citation: Farnaz Irannejad Bisafar, Herman Saksono, Priscilla Baquerizo, Dana Moore, and Andrea G Parker. 2016. Youth Advocacy in SNAs: Challenges for Addressing Health Disparities. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16: 3620–3624. Published: February 28, 2015 Spaceship Launch: Designing a Collaborative Exergame for Families Citation: Saksono, H., Ranade, A., Kamarthi, G., Castaneda-Sceppa, C., Hoffman, J.A., Wirth, C. and Parker, A.G., \"Spaceship Launch: Designing a Collaborative Exergame for Families,\" Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (2015), 1776-1787. Individual Details Tenured/Tenure-Track Faculty Campus Boston Website https://hermansaksono.com/ Google Scholar See Citations Areas of Interest Human-Centered Computing Personal Health Informatics Contact h.saksono@northeastern.edu Related news CHI 2025: Khoury researchers publish record-high papers for second straight year April 22, 2025 Current Students PhD Candidate Herman Saksono Empowers People with Data June 26, 2020 News at Northeastern Fitness trackers need to go beyond counting steps. Here’s why. May 23, 2019 Explore all news Current PhD students Zhuoran Huang PhD Student Read bio Locations Close this dialog window Boston Jiaqi Li PhD Student Read bio Locations Close this dialog window Boston Naomi Ruchugo PhD Student Read bio Locations Close this dialog window Boston",
  "content_length": 7376,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:11"
}