{
  "name": "Herve Lombaert",
  "homepage": "https://shape.polymtl.ca/lombaert",
  "status": "success",
  "content": "Herve Lombaert Hervé Lombaert About Short Bio Calendar Your Visits Research Themes Team Teaching Awards & Funding Team Members Code of Conduct Publications Articles Review Duties Code Talks Canada Research Chair Prof – Research Scientist Polytechnique Montreal – Mila (Currently in Eastern Time) Hiring: (4) PhD, (2) MSc, (1) Postdoc Several topics in Medical Image Analysis: ➤ Shape Analysis for Anatomical Reconstruction ➤ Geometry / Graph / Image / Learning-based algorithms [ more at: https://shape.polymtl.ca/lombaert/jobs.php ] Short Bio Associate Professor (2024 —) @ Polytechnique Montreal. Associate Professor (2017 —) @ ETS Montreal. Assistant Professor / Starting Research Scientist (2015-2017) @ Inria. Starting Research Position— Junior Faculty Position (selective, 5 hires in whole France, for all 8 centers)— Equivalent to Assistant Prof (US) / Lecturer (UK) Postdoc Fellow (2013-2015) @ Microsoft Research–Inria. Postdoc Titles:–Associates often have salaries charged from a grant secured by their mentors–Fellows are often supported by their own fellowships (a 'mini grant') Postdoc Fellow (2012-2013) @ McGill University. Ph.D. (2012) @ Polytechnique Montreal – Siemens – Inria. External Profiles: Google Scholar (Pronounciation: Lom-bart) Research Topics Spectral Graph Theory Shape Analysis Geometric Learning Medical Image Analysis Riemannian Geometry Cardiac Neuro Diffusion Imaging Publications [ Google Scholar ] Journal Articles Prompt learning with bounding box constraints for medical image segmentation. In IEEE Transactions on Biomedical Engineering (TBME), 2025. Gaillochet, M.; Noori, M.; Dastani, S.; Desrosiers, C. and Lombaert, H. Neighbor-Aware Calibration of Segmentation Networks with Penalty-Based Constraints. In Medical Image Analysis (MedIA), 2025. Murugesan, B.; Adiga, S.; Liu, B.; Lombaert, H.; Ben Ayed, I. and Dolz, J. GeoLS: an Intensity-based, Geodesic Soft Labeling for Image Segmentation. In Melba, 2024. Adiga, S.; Dolz, J. and Lombaert, H. Anatomically-aware Uncertainty for Semi-supervised Image Segmentation. In Medical Image Analysis (MedIA), 2023. Adiga, S.; Dolz, J. and Lombaert, H. [Highlight] Active Learning for Medical Image Segmentation with Stochastic Batches. In Medical Image Analysis (MedIA), 2023. Gaillochet, M.; Desrosiers, C. and Lombaert, H. Learning Joint Surface Reconstruction and Segmentation, from Brain Images to Cortical Surface Parcellation. In Medical Image Analysis (MedIA), 2023. Gopinath, K.; Desrosiers, C. and Lombaert, H. Source-free Domain Adaptation for Image Segmentation. In Medical Image Analysis (MedIA), 2022. Bateson, M.; Kervadec, H.; Dolz, J.; Lombaert, H. and Ben Ayed, I. Attention-based Dynamic Subspace Learners for Medical Image Analysis. In IEEE Journal of Biomedical and Health Informatics (JBHI), 2022. Adiga, S.; Dolz, J. and Lombaert, H. Little W-Net: State-of-the-Art Retinal Vessel Segmentation with Minimalistic Models. In Nature Scientific Reports, 2022. Galdran, A.; Anjos, A.; Dolz, J.; Chakor, H.; Lombaert, H. and Ben Ayed, I. Manifold-aware Synthesis of High-resolution Diffusion from Structural Imaging. In Frontiers in Neuroimaging, 2022. Anctil-Robitaille, B.; Théberge, A.; Jodoin, P-M.; Descoteaux, M.; Desrosiers, C. and Lombaert, H. Real-time simulation of viscoelastic tissue behavior with physics-guided deep learning. In Computerized Medical Imaging and Graphics (CMIG), 2022. Karami, M.; Lombaert, H. and Rivest-Henault, D. Realistic Image Normalization for Multi-Domain Segmentation. In Medical Image Analysis (MedIA), 2021. Delisle, P-L.; Anctil-Robitaille, B.; Desrosiers, C. and Lombaert, H. Constrained Domain Adaptation for Image Segmentation. In IEEE Transactions on Medical Imaging (TMI), 2021. Bateson, M.; Dolz, J.; Kervadec, H.; Lombaert, H. and Ben Ayed, I. [Highlight] Learnable Pooling in Graph Convolutional Networks for Brain Surface Analysis. In IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI), 2020. Gopinath, K.; Desrosiers, C. and Lombaert, H. Non-uniform Label Smoothing for Diabetic Retinopathy Grading from Retinal Fundus Images with Deep Neural Networks. In TVST, 2020. Galdran, A.; Chelbi, J.; Dolz, J.; Lombaert, H.; Ben Ayed, I. and Chakor, H. [Highlight] Graph Convolutions on Spectral Embeddings for Cortical Surface Parcellation. In Medical Image Analysis (MedIA), 2019. Gopinath, K.; Desrosiers, C. and Lombaert, H. HyperDense-Net: A hyper-densely connected CNN for multi-modal image segmentation. In IEEE Transactions on Medical Imaging (TMI), 2018. Dolz, J.; Gopinath, K.; Yuan, J.; Lombaert, H.; Desrosiers, C. and Ben Ayed, I. Spectral Shape Analysis of Human Torsos: Application to the Evaluation of Scoliosis Surgery Outcome. In IEEE Journal of Biomedical and Health Informatics (JBHI), 2017. Ahmad, O.; Lombaert, H.; Parent, S.; Labelle, H.; Dansereau, J. and Cheriet, F. Cortical Folding of the Preterm Brain: A Longitudinal Analysis of Extremely Preterm Born Neonates using Spectral Matching. In Brain and Behavior, 2016. Orasanu, E.; Melbourne, A.; Cardoso, J.; Lombaert, H.; Robertson, N.; Kendall, G.; Marlow, N. and Ourselin, S. Statistical Shape Analysis of Subcortical Structures using Spectral Matching. In Computerized Medical Imaging and Graphics (CMIG), 2016. Shakeri, M.; Lombaert, H.; Datta, A.; Oser, N.; Letourneau-Guillon, L.; Vincent Lapiere, L.; Martin, F.; Malfait, D.; Tucholka, A.; Lippe, S. and Kadoury, S. [Highlight] Spectral Log-Demons - Diffeomorphic Image Registration with Very Large Deformations. In International Journal of Computer Vision (IJCV), 107 (3), 2014. Lombaert, H.; Grady, L.; Pennec, X.; Ayache, N. and Cheriet, F. FOCUSR: Feature Oriented Correspondence using Spectral Regularization - A Method for Precise Surface Matching. In IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI), 35 (9), 2013. Lombaert, H.; Grady, L.; Polimeni, J. R. and Cheriet, F. FQRNT Etudiant EtoileBest Paper Award Human Atlas of the Cardiac Fiber Architecture: Study on a Healthy Population. In IEEE Transactions on Medical Imaging (TMI), 31 (7), 2012. Lombaert, H.; Peyrat, J-M.; Croisille, P.; Rapacchi, S.; Fanton, L.; Cheriet, F.; Clarysse, P.; Magnin, I.; Delingette, H. and Ayache, N. Top-Conference Articles & More Note: Top Conferences, such as MICCAI,IPMI or ICCV,ECCV, have lower acceptance rates than many top journals. Acceptance Rate: <30% Oral Presentation ToothForge: Automatic Dental Shape Generation using Synchronized Spectral Embeddings. In IPMI, 2025. Kubik, T.; Guibault, F.; Spanel, M. and Lombaert, H. Acceptance Rate: <30% TRUST: Test-Time Refinement using Uncertainty-Guided SSM Traverses. In NeurIPS, 2025. Dastani, S.; Bahri, A.; Hakim, G. A. V.; Yazdanpanah, M.; Noori, M.; Osowiechi, D.; Barbeau, S.; Ben Ayed, I.; Lombaert, H. and Desrosiers, C. Acceptance Rate: <30% Oral Presentation Variational Visible Layers: A Practical Framework for Uncertainty Estimation. In MICCAI, 2025. Abboud, Z.; Lombaert, H. and Kadoury, S. Best Paper Award Anatomically-Focused Patches for Lightweight and Explainable Knee OA Grading. In MICCAI ShapeMI, 2025. Chang, T-E. and Lombaert, H. Oral Presentation Reinforcing the generalizability of spinal cord multiple sclerosis lesion segmentation models. In ECTRIMS, 2025. Benveniste, P-L.; more, 45; Lombaert, H. and Cohen-Adad, J. Investigations on the mitigation of 'noisy labels' for the automatic segmentation. In ECTRIMS, 2025. Benveniste, P-L.; more, 45; Lombaert, H. and Cohen-Adad, J. Acceptance Rate: <30% Spectral State Space Model for Rotation-Invariant Visual Representation Learning. In CVPR, 2025. Dastani, S.; Bahri, A.; Yazdanpanah, M.; Noori, M.; Osowiechi, D.; Vargas-Hakim, G. A.; Beizaee, F.; Cheraghalikhani, M.; Mondal, A. K.; Lombaert, H. and Desrosiers, C. Acceptance Rate: <30% Sparse Bayesian Networks: Efficient Uncertainty Quantification in Medical Image Analysis. In MICCAI, 2024. Abboud, Z.; Lombaert, H. and Kadoury, S. Sparse Partial Bayesian Networks: Efficient Uncertainty Quantification in Medical Image Analysis. In WIML@NeurIPS, 2024. Abboud, Z.; Lombaert, H. and Kadoury, S. Automating MedSAM by Learning Prompts with Weak Few-Shot Supervision. In MICCAI MedAGI, 2024. Gaillochet, M.; Desrosiers, C. and Lombaert, H. Acceptance Rate: <30% Trust your neighbours: Penalty-based constraints for model calibration. In MICCAI, 2023. Murugesan, B.; Adiga, S.; Liu, B.; Lombaert, H.; Ben Ayed, I. and Dolz, J. Oral Presentation GeoLS: Geodesic Label Smoothing for Image Segmentation. In MIDL, 2023. Adiga, S.; Dolz, J. and Lombaert, H. TAAL: Test-time Augmentation for Active Learning in Medical Image Segmentation. In MICCAI DALI, 2022. Gaillochet, M.; Desrosiers, C. and Lombaert, H. Acceptance Rate: <30% Leveraging Labeling Representations in Uncertainty-based Semi-supervised Segmentation. In MICCAI, 2022. Adiga, S.; Dolz, J. and Lombaert, H. Acceptance Rate: <30% Test-Time Adaptation with Shape Moments for Image Segmentation. In MICCAI, 2022. Bateson, M.; Lombaert, H. and Ben Ayed, I. Acceptance Rate: <30% Oral Presentation 3D Shape Representation via Spectral Coordinates on Medial Manifolds. In CVPR, 2022. Rezanejad, M.; Kohdadad, M.; Mahyar, H.; Lombaert, H.; Gruninger, M.; Walther, B. and Siddiqi, K. Attention-based Dynamic Subspace Learners. In Medical Imaging with Deep Learning (MIDL), 2022. Adiga, S.; Dolz, J. and Lombaert, H. Source-Free Domain Adaptation for Image Segmentation. In Medical Imaging with Deep Learning (MIDL), 2022. Bateson, M.; Kervadec, H.; Dolz, J.; Lombaert, H. and Ben Ayed, I. Acceptance Rate: <30% Oral Presentation SegRecon: Learning Joint Brain Surface Reconstruction and Segmentation from Images. In MICCAI, 2021. Gopinath, K.; Desrosiers, C. and Lombaert, H. Acceptance Rate: <30% Oral Presentation Source-Relaxed Domain Adaptation for Image Segmentation. In MICCAI, 2020. Bateson, M.; Kervadec, H.; Dolz, J.; Lombaert, H. and Ben Ayed, I. Acceptance Rate: <30% Oral Presentation Cost-Sensitive Regularization for Diabetic Retinopath",
  "content_length": 24340,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:16"
}