{
  "name": "Hidetoshi Shimodaira",
  "homepage": "http://stat.sys.i.kyoto-u.ac.jp",
  "status": "success",
  "content": "Shimodaira Lab – Kyoto University コンテンツへスキップ 統計学と機械学習 研究室からのおしらせ 2023年度からの組織変更について (2022/11/17) 研究室分野名の変更（2021/10/08） 研究室見学 入試説明会と研究室説明会 配属のための研究室見学 研究トピックを見学前にご覧になってください 研究関連 The 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025) においてOutstanding Paper Awardを受賞 生成ＡＩモデルの地図：確率分布と情報幾何による類似性の可視化 言語処理学会第31回年次大会(NLP2025)において委員特別賞を受賞 NLP若手の会 (YANS) 第19回シンポジウム (2024)において奨励賞を受賞 言語処理学会第30回年次大会(NLP2024)においてリクルート賞を受賞 NLP若手の会 (YANS) 第18回シンポジウム (2023)において奨励賞を受賞 第25回情報論的学習理論ワークショップ(IBIS2022)において学生最優秀プレゼンテーション賞を受賞 言語処理学会第28回年次大会(NLP2022)において若手奨励賞を受賞 言語処理学会第27回年次大会(NLP2021)において優秀賞と委員特別賞を受賞 第22回情報論的学習理論ワークショップ (IBIS 2019)において優秀プレゼンテーション賞を受賞 言語処理学会第25回年次大会(NLP2019)において若手奨励賞と最優秀ポスター賞を受賞 「みんなのPython勉強会」でトークしてきました 年度ポスター 研究紹介 (2019/08/30) 最近の論文 (2019/02/28) 研究紹介の講演スライド (2019/08) Google Scholarの使い方（論文の被引用数） 高度AI人材になろう（AI関連分野のトップ会議） 下平・本多研究室 京都大学情報学研究科 システム科学コース 統計知能分野 京都大学情報学研究科 データ科学コース 統計数理分野 京都大学工学部情報学科 数理工学コース 研究室説明会（入試説明会）2025/5/8および2025/5/14 研究室紹介 統計知能分野では統計学と機械学習の研究を行っています．研究室は京都大学吉田キャンパスの時計台のすぐそばにあります． 統計学と機械学習に関して理論から応用まで研究しています．理論や手法の研究では数学とプログラミングを重視します．応用分野は自然言語処理や生物系データなどに関わっています．いくつかの研究トピックを以下にご紹介します． 研究トピック 研究トピックのPDFファイルダウンロード 概要 対数尤度ベクトルに基づく言語モデルの地図 言語や画像の埋め込みに共通する「形」の発見 埋め込みのノルム（長さ）は「意味の強さ」を表す 分散表現の論理演算 単語埋め込みで薬剤と遺伝子間のアナロジータスクを解く 不均衡最適輸送を用いた意味変化検出 バンディット問題 強化学習を用いたバンディットアルゴリズム ベイズ最適化 グラフ埋め込みの理論 グラフ埋め込みの応用 マルチスケール k-近傍法 複雑ネットワークの統計推測 ブートストラップと選択的推測 サイト内の参考ページ 年度ポスター (2017, 2018, 2019, 2021年度, やや専門家向け) 研究紹介 (2019/08/30, 簡単な紹介) 研究内容 (研究に関するトップページです) 学位論文 研究室説明会 サイト外の参考ページ 京都大学情報学研究科　募集要項 システム科学コース　入試情報 データ科学コース　入試情報 京都大学 スタッフ 下平 英寿（教授） 本多 淳也（准教授） 山際 宏明（助教） Luis Iván Hernández Ruíz（特定研究員） 仲上 直美（事務補佐員） 博士後期課程（システム科学コース） Zhu Yihua（シュ ゲイカ） 大山 百々勢 博士後期課程（データ科学コース） 高瀬 侑亮 HE YUNZHEN（カ　ユンチェン） 博士前期課程（システム科学コース） 陳 伯韜（チェン　ボタオ） 劉 安龍（リュウ　アンリュウ） 内藤 匠海 村田 悠 劉 晃伸（リュウ　アキノブ） 趙 怡名（チョウ　イメイ） 岸野 稜 滝本 亘 陸 建旭（リク　ケンキョク） 王 嘉欣（オウ　カキン） 博士前期課程（データ科学コース） LIU MOTING（リュウ　モテイン） 蝶野 元哉 孫 宏謀（スン　ホンモウ） 学部生（数理工学コース） 有薗 宗虎 江坂 慶介 塩見 陸 下平研究室（京都大学） 所在地 〒606-8501 京都市左京区吉田本町 京都大学 工学部総合校舎 京都大学吉田キャンパス本部構内の地図で53番の建物 京都大学吉田キャンパスへのアクセス 郵便物 〒606-8501 京都市左京区吉田本町 京都大学 情報学研究科 統計知能分野 事務室 工学部総合校舎107号室 仲上直美 Tel: 075-753-4755 問い合わせメール:",
  "content_length": 2136,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:21"
}