{
  "name": "Hidetsugu Irie",
  "homepage": "http://www.mtl.t.u-tokyo.ac.jp/~irie/en/profile",
  "status": "success",
  "content": "プロフィール | Hidetsugu Irie, JST/Univ.of Tokyo Lectures Awards Grants, Collaborations Society Activities (日本語) 東京大学大学院情報理工学系研究科電子情報学専攻/東京大学工学部電気系学科 〒113-8656 東京都文京区本郷7-3-1 東京大学　工学部2号館11F112A3 Tel:03-5841-6752 学歴 2004年3月　東京大学　大学院情報理工学系研究科　電子情報学専攻　博士課程修了　博士(情報理工学) 2001年3月　東京大学　大学院工学系研究科　情報工学専攻　修士課程修了 1999年3月　東京大学　工学部電子情報工学科　卒業 職歴 2022年9月～現在　東京大学　大学院情報理工学系研究科　電子情報学専攻　教授 2015年4月～2022年8月　東京大学　大学院情報理工学系研究科　電子情報学専攻　准教授 2010年3月～2015年3月　電気通信大学　大学院情報システム学研究科　ネットワークシステム学専攻　准教授 2008年4月～2010年2月　東京大学　大学院情報理工学系研究科　コンピュータ科学専攻　助教（東京大学理学部情報科学科兼担） 2004年4月～2008年3月　独立行政法人科学技術振興機構CREST　博士研究員 Publications Lectures (日本語) コース科目 東京大学工学部電子情報工学科 コンピュータアーキテクチャ(受講生向けページ)(2024年度-) 東京大学工学部電子情報工学科 VLSIアーキテクチャ -プロセッササイド-(受講生向けページ)(2019年度-) 東京大学工学部電子情報工学科 ディジタル回路(受講生向けページ)(2016年度-) 東京大学大学院情報理工学系研究科 アドバンスト・コンピュータ・アーキテクチャ(受講生向けページ)(2015年度-) 電気通信大学大学院情報システム学研究科 ネットワークコンピューティング学I(2010-2015年度) 電気通信大学 初年次導入科目 基礎プログラミング(C11)(2014年度) 中央大学理工学部情報工学科コンピュータアーキテクチャ基礎(受講生向けページ)(2012-2014年度) 出張講義等 東京大学メタバース工学部ジュニア講座「バーチャル教室でディジタルに触れよう」(2024.08) 東京大学メタバース工学部ジュニア講座「バーチャル教室でコンピュータを学ぼう」(2023.08, 2023.12) 東京大学メタバース工学部ジュニア講座「バーチャル教室でディジタル回路を学ぼう」(2022.12) 東京大学オープンキャンパス模擬講義「コンピュータの中の十億分の一秒: 情報化社会を支えるプロセッサを紐解く」(2021.07) 電気通信大学出張講義「ネットワーク社会を支えるプロセッサ達」 岩手県立盛岡第三高校(2011.10), 千葉県立船橋東高校(2011.11), 栃木県立小山高校(2012.02), 茨城県取手第一高 (2012.07), 千葉県立船橋東高校(2012.11), 夢ナビライブ静岡(2012.12) , 東京都立小石川中等教育学校(2013.12), 國學院高等学校(2013.12), 都立雪谷高等学校(2014.12) 平成22年度ちょうふ市内・近隣大学等公開講座, 電気通信大学第三回, 「ネットワーク社会を支えるプロセッサ達」 平成26年度ちょうふ市内・近隣大学等公開講座, 電気通信大学第一回, 「ネットワーク社会を支えるプロセッサ達」 電気通信大学　大学院情報システム学研究科　スーパ連携大学院コンソーシアム協力研究室(2012.04.01-) Awards (日本語) 受賞等 Junichiro Kadomoto, Hidetsugu Irie, Shuichi Sakai: Best Paper Award, 20th IEEE Asia Pacific Conf. on Circuits and Systems (令和6年11月) Toru Koizumi, Ryota Shioya, Shu Sugita, Taichi Amano, Yuya Degawa, Junichiro Kadomoto, Hidetsugu Irie, Shuichi Sakai: IEEE MICRO Top Pics from 2023 Honorable Mentions (令和6年8月) 鈴木 渉太, 出川 祐也, 吉田 智裕, 門本 淳一郎, 入江 英嗣, 坂井 修一: Best Research Award, cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming 2024(令和6年8月) 出川 祐也, 小泉 透, 中村 朋生, 塩谷 亮太, 門本 淳一郎, 入江 英嗣, 坂井 修一: 2023年度電子情報通信学会論文賞(令和6年6月) 灘 洋太郎, 小泉 透, 塩谷 亮太, 入江 英嗣, 坂井 修一: FIT論文賞, 第22回情報科学技術フォーラム(令和5年9月) 小泉 透, 入江 英嗣, 坂井 修一: Best Research Award, The 7th cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming (令和5年8月) 長﨑 舜, 門本 淳一郎, 入江 英嗣, 坂井 修一: Outstanding Research Award, The 7th cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming (令和5年8月) 吉田 智裕, 中村 朋生, 門本 淳一郎, 入江 英嗣, 坂井 修一: Best Research Award, The 6th cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming (令和4年7月) 杉田 脩, 小泉 透, 塩谷 亮太, 入江 英嗣, 坂井 修一: Best Research Award, The 6th cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming (令和4年7月) オンライン授業等におけるグッドプラクティス総長表彰(令和3年3月) 冨田 和孝, 中村 朋生, 小泉 透, 入江 英嗣, 坂井 修一: FIT船井ベストペーパー賞(令和2年9月) 杉田 脩, 小泉 透, 入江 英嗣, 坂井 修一: Best Research Award, The 4th cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming (令和2年7月) 中村 朋生, 小泉 透, 出川 祐也, 入江 英嗣, 坂井 修一, 塩谷 亮太: 3rd place, The 1st Instruction Prefetching Championship(令和2年6月) 東京大学工学部Best Teaching Award(令和2年3月) 電子情報通信学会 情報・システムソサイエティ功労賞(平成28年6月) DICOMO2012 優秀論文賞(平成24年10月) DICOMO2012 優秀プレゼンテーション賞(平成24年7月) 情報処理学会 2010年度 論文賞(平成23年6月) 情報処理学会 平成22年度 山下記念研究賞(平成23年3月) (’-’* 2011年度ミス電通大(平成23年11月) 指導学生の受賞等 鄭 風音: Outstanding Effort Award, Cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming(令和7年8月) 笠村 卓矢: IEEE Computer Society Japan Chapter xSIG Young Researcher Award, Cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming(令和7年8月) 山内 悠理子: 電気学会 東京支部 電気学術助成活動奨励賞(令和7年3月) 山内 悠理子: 東京大学 工学部長賞(学修)(令和7年3月) 山内 悠理子: 東京大学工学部電子情報工学科 優秀卒業論文賞(令和7年3月) 笠村 卓矢: 情報処理学会システムとLSIの設計技術研究会 DAシンポジウム2024 セッション特別賞(令和7年8月) 出川 祐也: 情報処理学会システム・アーキテクチャ研究会 2023年度若手奨励賞(令和6年3月) 末神 奏宙: 東京大学東京大学総長賞（学業）(令和6年3月) 末神 奏宙: 東京大学工学部長賞（研究）最優秀(令和6年3月) 末神 奏宙: 東京大学工学部電子情報工学科 優秀卒業論文賞(令和6年3月) 吉田 智裕: 東京大学大学院情報理工学系研究科 研究科長賞(令和6年3月) 長崎 舜: 東京大学大学院情報理工学系研究科電子情報学専攻 専攻長賞(令和6年3月) 平岡 拓海: 情報処理学会システム・アーキテクチャ研究会 2022年度年間優秀発表賞(令和5年8月) 中村 朋生: 電子情報通信学会CPSY研究会 2022年度研究会優秀若手発表賞(令和5年3月) 小泉 透: 東京大学大学院情報理工学系研究科電子情報学専攻 専攻長賞(令和5年3月) 小泉 透: 情報処理学会 令和4年度 山下記念研究賞(令和5年3月) 小泉 透: 情報処理学会システム・アーキテクチャ研究会 2021年度若手奨励賞(令和4年7月) 天野 太智: Outstanding Effort Award, The 6th cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming (令和4年7月) 天野 太智: 東京大学工学部電子情報工学科 優秀卒業論文賞(令和4年3月) 杉田 脩: 東京大学大学院情報理工学系研究科電子情報学専攻 専攻長賞(令和4年3月) 光野 聡志: 東京大学大学院情報理工学系研究科電子情報学専攻 専攻長賞(令和4年3月) 中村 朋生: 情報処理学会 令和3年度 山下記念研究賞(令和4年3月) 光野 聡志: d.lab-VDECデザイナーズフォーラム 2021 デザインアワード 嘱望賞(令和3年9月) 野村 真菜(UTokyo GSCプログラム): Outstanding Poster Presentation Award, The18th IEEE Transdisciplinary-Oriented Workshop for Emerging Researchers(令和3年11月) 門本 淳一郎: 東京大学大学院情報理工学系研究科電子情報学専攻 専攻長賞(令和3年3月) 大石 凜: 工学部長賞，東京大学工学部電子情報工学科 優秀卒業論文賞(令和3年3月) 中村 朋生: 電子情報通信学会CPSY研究会 2020年度研究会優秀若手発表賞(令和2年10月) 門本 淳一郎: d.lab-VDECデザイナーズフォーラム 2020 デザインアワード 嘱望賞(令和2年9月) 道上 和馬: 東京大学工学部電子情報工学科 優秀卒業論文賞(令和2年3月) 門本 淳一郎: 情報処理学会 SLDM研究会 DAシンポジウム2019 優秀ポスター発表賞 (令和元年8月) 門本 淳一郎: IEEE CEDA All Japan Joint Chapter Academic Research Award, 情報処理学会SLDM研究会 優秀論文賞, 情報処理学会SLDM研究会優秀発表学生賞 (令和元年8月) 門本 淳一郎: 電子情報通信学会CPSY研究会 2018年度研究会優秀若手発表賞(令和元年7月) 門本 淳一郎: IEEE Computer Society Japan Chapter xSIG Young Researcher Award, The 3rd cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming (令和元年5月) 小泉 透: Best M1 Student Award, The 3rd cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming (令和元年5月) 中村 朋生: Poster Award, The 3rd cross-disciplinary Workshop on Computing Systems, Infrastructures, and Programming (令和元年5月) チームMTLLAB (谷合 廣紀, 門本 淳一郎, 森 大輝): 自動車技術会 自動運転AIチャレンジ シナリオ完走部門優勝, 制御精度部門優勝 チームnyoki-mtl (谷合 廣紀, 森 大輝): SIGNATE 経済産業省AIエッジコンテスト (セグメンテーション部門) 2位 (平成31年1月) 小泉 透: General Graph Deepest Improvement Award, Graph Golf Workshop2018 (平成30年10月) 甲地 弘幸: 電子情報通信学会CPSY研究会 2017年度優秀若手講演賞(平成30年7月) 別所 祐太朗: 東京大学工学部電子情報工学科 優秀卒業論文賞(平成30年3月) 野村 隼人: 電気通信大学目黒会賞(平成28年3月)，電気通信大学情報システム学研究科情報ネットワークシステム学専攻　総代(平成28年3月) 城間 隆行:電子情報学会集積回路研究会 若手研究会優秀ポスター賞 野村 隼人:COOL Chips XVIII Featured Poster Award(平成27年4月) 力 翠湖: 電気通信大学目黒会賞(平成27年3月)，電気通信大学情報システム学研究科情報ネットワークシステム学専攻　総代(平成27年3月) オゲ ヤースィン: 電子情報通信学会CPSY研究会2012年度優秀若手講演賞(平成25年8月) 小木 真人: DICOMO2012 ヤングリサーチャー賞(平成24年7月) 樫原 裕大: 情報処理学会第32回ユビキタスコンピューティングシステム研究会 学生奨励賞(平成23年12月) Grants, Collaborations (日本語) 外部資金プロジェクト 「チップサイズコンピューティングに関わる研究」民間等共同研究（株式会社Premo），大学側研究代表者（令和3年度-令和8年度） 「フォークリフト荷役作業支援システムの研究 」民間等共同研究（株式会社小松製作所），大学側研究代表者（平成30年度-令和7年度） 「センサ処理と音響・触覚通知による視覚障害者屋内ナビゲーションシステムのスマートグラス実装と社会実験」三菱財団社会福祉事業・研究助成，代表者(2023年度-2024年度) 「新アーキテクチャによる省電力高性能な超スケーラブルプロセッサの実現 」科研基盤研究(B), 課題番号23H03360, 研究代表者（令和5年度-令和7年度） 「超小型無線計算機群を用いた形状自在ユーザインタフェースの研究」科研基盤研究(A), 課題番号23H00465, 研究分担者（令和5年度-令和7年度） 「ユーザに寄り添うオンデマンド近似計算基盤の開拓」戦略的創造研究推進事業, さきがけ研究者（令和2年度-令和5年度） 「プログラマビリティと電力効率を両立するSIMDベース・アクセラレータの研究」科研基盤研究(B)，課題番号20H04153，研究分担者（令和2年度-令和5年度） 「CANと画像の連携による大規模データ活用技術の研究」民間等共同研究（トヨタ自動車株式会社），大学側研究代表者（令和元年度-令和5年度） 「VRライブ，ならびにメタバースECに関する研究」民間等共同研究（ヒビノ株式会社），大学側研究代表者（令和4年度） 「データ転送性能ボトルネックを解消する新アーキテクチャ研究」民間等共同研究（富士通研究所），大学側研究分担者（令和4年度-） 「メモリアクセス性能ボトルネックを解消する新アーキテクチャ研究」民間等共同研究（株式会社富士通研究所），大学側研究分担者（令和3年度） 「ウェアラブルカメラによる3Dスペースセンシングと触覚通知による，視覚障害者のための屋内ナビゲーションシステムの開発」三菱財団社会福祉事業・研究助成，代表者(令和2年度-令和4年度) 「高性能コンピュータシステムに関する研究」民間等共同研究（日本電気株式会社），大学側研究代表者（令和元年度-令和4年度） 「Approximate Computing 自動適用技術の研究」民間等共同研究（株式会社富士通研究所），大学側研究代表者（令和元年度-令和2年度） 「省電力・省面積・高効率を実現するユニバーサルなコアプロセッサIPの開発」科研基盤研究(B)，課題番号19H04077，代表者（平成31年度-令和3年度） 「無端子チップの誘導結合通信によって構成される超小型変形可能計算機システムの実現」科研基盤研究(B)，課題番号19H04076，研究分担者（平成31年度-令和3年度） 「ドローンおよびモバイルコンピュータを用いた視覚障害者外出支援システムの研究」三菱財団社会福祉事業・研究助成，代表者(平成30年度-平成31年度) 「Deep Learning向けStraightアーキテクチャの研究」民間等共同研究（株式会社富士通研究所），大学側研究代表者（平成28年度, 平成30年度） 「ディープラーニング処理向けチップの制御アーキテクチャに関する研究」民間等共同研究（株式会社富士通研究所），大学側研究代表者（平成29年度） 「VR・MR環境のための文字入力インタフェースの研究」民間等共同研究（TIS株式会社），大学側研究代表者（平成29年度-平成31年度） 「人体形状・動作状態によって可変する情報表示の研究」民間等共同研究（株式会社博報堂），大学側研究代表者（平成29年度-平成30年度） 「力覚提示を用いた直観的ユーザインタフェースの研究」民間等共同研究（日本電信電話株式会社コミュニケーション科学基礎研究所），大学側研究代表者（平成28年度-平成29年度） 「視覚障害者の支援へのドローンの活用可能性に関する調査研究」三菱財団社会福祉事業・研究助成，代表者(平成28年度-平成29年度) 「新アーキテクチャによる高効率プロセッサコアおよびそのマルチコア構成の研究」科研若手研究(B), 課題番号 25730028, 代表者(平成25年度-28年度) 「ドライバーの姿勢検出技術の研究（距離センサー方式）」民間等共同研究（日野自動車株式会社），大学側研究代表者（平成26年度-平成28年度） 「メガネ型ウェアラブルデバイスを利用した作業支援に関する検討」民間等共同研究（株式会社石原産業），大学側研究代表者（平成27年度-平成28年度） 「レーザポインティングによる革新的なIT機器接続アプリケーションの研究」電気通信大学 研究・教育活性化支援システム 若手研究, 代表者(平成26年度) 「光学ベルトコンベアスケールに関する研究」民間等共同研究（株式会社中山鉄工所），大学側研究代表者（平成25年度-平成26年度） 「光学透過ヘッドマウントディスプレイにおけるジェスチャ入力の研究」民間等共同研究（セイコーエプソン株式会社），大学側研究代表者（平成25年度-平成26年度） 「再参照傾向に着目した統合的キャッシュ制御アルゴリズム」服部報公会 工学研究奨励援助金(平成24年度) 「データ要求速度に着目した省面積オンタイムキャッシュの研究」電気通信大学 研究・教育活性化支援システム 若手研究, 代表者(平成23年度) Society Activities (日本語) ■ 東京大学 -大学院情報理工学系研究科 電子情報学専攻 専攻長 (2022.10-) -工学部電子情報工学科 学科長 (2023.04-) ■ IEEE (会員) Trans. on Computers – Reviewer (2013) Computer Architecture Letters – Reviewer(2024) International Conference on Computer Design – Program Committee (2015) Pacific Rim International Symposium on Dependable Computing – Conference Treasurer (2010), Publication Chair (2012), Program Committee (2012 – 2019) International Conference on Algorithms and Architectures for Parallel Processing – Program Committee (2012, 2013) ■ ACM (会員) IEEE/ACM International Symposium on Microarchitecture – Web Co-Chair (2018) ACM International Conference on Computing Frontiers – Program Committee (2020) International Conference on High Performance Computing in Asia-Pacific Region – Program Committee (2019) ■ 情報処理学会 (2014年度シニア会員, ARC研究会会員, 2016年度代表会員) 会誌編集委員会専門委員会(ハードウェア分野・システム分野) – 編集委員 (2012.04.01-2016.03.31), SWG主査(2015.04.01-2016.03.31) 論文誌編集委員会 – 編集委員 (2008.06.01-2012.05.31), 査読委員 (2008.06.01-2015.05.31), 論文賞選定ワーキンググループ委員 (2010, 2011) ACS論文誌編集委員会 – 編集委員 (2009.06.01-2013.05.31) インタラクティブシステムとソフトウェアに関するワークショップ(WISS) – プログラム委員 (2018-2022) 先進的計算基盤シンポジウム – プログラム委員(2009, 2010, 2011), プログラム副委員長(2012) Annual Meeting on Advanced Computing System and Infrastructure – プログラム委員(2014, 2016) cross-disciplinary Workshop on Computing Systems, Infrastructures, and programminG – プログラム委員(2017, 2018, 2020, 2021), ",
  "content_length": 10928,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:21"
}