{
  "name": "Hila Peleg",
  "homepage": "https://hilap.cswp.cs.technion.ac.il",
  "status": "success",
  "content": "- Hila Peleg - Technion Computer Science Department I am an Assistant Professor at the Technion, Haifa, working in the intersection of Programming Languages, Software Engineering, and Human-Computer Interaction. I research programmer tooling inspired by theory from Programming Languages, specifically interaction models that create more versatile program synthesis solutions for programmers. I am co-PI of the TecSE lab with Prof. Shachar Itzhaky. I completed my PhD with Prof. Eran Yahav in 2019 and worked with Nadia Polikarpova as a postdoc at UCSD. My ERC-funded EXPLOSYN project is hiring PhD students and postdocs! If you have SE and PL experience and would like to work on the future of tools for writing correct programs, drop me a line! Publications ScooPy: Enhancing Program Synthesis with Nested Example Specifications Tomer Katz, Hila Peleg Onward! 2025: [paper] [bib] Debugging into Existence with Program Synthesis Guy Frankel, Shay Segal, Hila Peleg VL/HCC 2025: [paper] [bib] Bottom-up Synthesis of Memory Mutations with Separation Logic Kasra Ferdowsi, Hila Peleg ECOOP 2025: [paper] [presentation] [bib] [artifact] Constrictor: Immutability as a Design Concept Elad Kinsbruner, Shachar Itzhaky, Hila Peleg ECOOP 2024: [paper] [bib] [artifact] Program Synthesis Co-Design Hila Peleg PLATEAU 2023: [paper] [bib] AmiGo: Computational Design of Amigurumi Crochet Patterns Michal Edelstein, Hila Peleg, Shachar Itzhaky, Mirela Ben-Chen SCF2022: [paper] LooPy: Interactive Program Synthesis with Control Structures Kasra Ferdowsifard, Shraddha Barke, Hila Peleg, Sorin Lerner, Nadia Polikarpova OOPSLA 2021: [paper] [talk] [bib] Synthesis of Web Layouts from Examples Dylan Lukes, John Sarracino, Cora Coleman, Hila Peleg, Sorin Lerner, Nadia Polikarpova FSE 2021: [paper] [talk] [bib] Cyclic Program Synthesis Shachar Itzhaky, Hila Peleg, Nadia Polikarpova, Reuben N. S. Rowe, Ilya Sergey PLDI 2021: [paper] [bib] Distinguished Paper Award, PLDI 2021 Digging for Fold: Synthesis-Aided API Discovery for Haskell Michael B. James, Zheng Guo, Ziteng Wang, Shivani Doshi, Hila Peleg, Ranjit Jhala, Nadia Polikarpova OOPSLA 2020: [paper] [talk] [bib] Just-in-Time Learning for Bottom-Up Enumerative Synthesis Shraddha Barke, Hila Peleg, Nadia Polikarpova OOPSLA 2020: [paper] [talk] [bib] Programming with a Read-Eval-Synth Loop Hila Peleg, Roi Gabay, Shachar Itzhaky, Eran Yahav OOPSLA 2020: [paper] [talk] [artifact] [bib] Distinguished Artifact Award, SPLASH 2020 The Wonderful Wizard of LoC: Paying attention to the man behind the curtain of line-of-code metrics Kalev Alpernas, Yotam M. Y. Feldman, Hila Peleg Onward! 2020: [essay] [talk] [bib] Small-Step Live Programming by Example Kasra Ferdowsifard, Allen Ordookhanians, Hila Peleg, Sorin Lerner, Nadia Polikarpova UIST 2020: [paper] [short preview] [long preview] [talk] [bib] Perfect is the Enemy of Good: Best-Effort Program Synthesis Hila Peleg, Nadia Polikarpova ECOOP 2020: [paper] [talk] [bib] Programming by Predicates: A formal model for interactive synthesis Hila Peleg, Shachar Itzhaky, Sharon Shoham, Eran Yahav Acta Informatica: [paper] [bib] Programming Not Only by Example Hila Peleg, Sharon Shoham, Eran Yahav ICSE 2018: [paper] [presentation] [bib] Abstraction-Based Interaction Model for Synthesis Hila Peleg, Shachar Itzhaky, Sharon Shoham VMCAI2018: [paper] [presentation] [bib] Generating Tests by Example Hila Peleg, Dan Rasin, Eran Yahav VMCAI2018: [paper (extended)] [presentation] [bib] Learn&Fuzz: Machine Learning for Input Fuzzing Patrice Godefroid, Hila Peleg, Rishabh Singh ASE 2017: [paper] Arxiv: [technical report] D3: Data-Driven Disjunctive Abstraction Hila Peleg, Sharon Shoham, Eran Yahav VMCAI2016: [paper] [presentation] [bib] Symbolic Automata for Static Specification Mining Hila Peleg, Sharon Shoham, Eran Yahav, Hongseok Yang SAS2013: [paper] [presentation] [video] [bib] Acta Informatica: [paper] [bib] Smashing Expectations for Fun and Profit: Intertextuality and “Rip-Off” in the Novels of John Scalzi Hila Peleg Science Fiction beyond Borders, Ed. Shawn Edrei and Danielle Gurevitch Cambridge Scholars Publishing, 2016 [book] Students PhD: Elad Kinsbruner MSc: Oren Hecht Shay Segal Barak Bieber Undergraduate researchers: Noam Har-Tov Dani Rifkind Etai Zilberman Alumni: Tomer Katz – MSc Courses Winter 2022-2023: User-Centered Programming Tools (Advanced Topics in Software Engineering) Seminar in Programming Languages Spring 2022: Theory of Compilation Talks Generating correct code for your programmers Programming Language Implementation Summer School, May 26-31, 2025 Part 1: [slides] Part 2: [slides] Program Synthesis Co-Design Workshop on Dependable and Secure Software Systems, Oct 8, 2022 [video] Programmer Tools with Program Synthesis UMass Systems Lunch, Oct 9, 2020 [video] Automatic Programming: How Far can Machines Go? YOW! Sydney – Nov 29, 2018 YOW! Brisbane – Dec 3, 2018 YOW! Melbourne – Dec 6, 2018 [slides] [poster] [video] [graphic recording] On the Importance of Common Sense in Program Synthesis ML4PL 2018 [slides] Activities PC Chair ISSTA Tool Demo Track 2022 Program Committee PLDI 2021, 2023 POPL 2024 OOPSLA 2024 (Associate Editor), 2026 PEPM 2023 <Programming> 2022 PX 2022 SCAM 2021 ECOOP 2021 HATRA 2020,2021, 2022 SYNT 2020, 2021 LIVE 2021 VSTTE 2020 ISSTA 2020 Tool Demo ECOOP 2019 Doctoral Symposium External Review Committee ASPLOS 2021 OOPSLA 2020 Organizing Committee FLoC 2022 Student Volunteer Co-Chair PLMW @ PLDI 2021 PL+HCI Swimmer School 2020, 2022 ML4PL 2018 Student Research Competition Committes POPL 2021 SPLASH 2020 Misc Israeli Society for Science Fiction and Fantasy and its major conventions: ICon (Sukkot), Olamot (Passover), and Meorot (Hanukkah) My schpiel on the anti-geek and misogyny that The Big Bang Theory promoted (Sharat Hatarbut podcast, Hebrew) Collected writing for Starbase 972, the Israeli Star Trek fan site: https://starbase972.com/2014/09/01/1085/ https://starbase972.com/2015/08/12/1129/ https://starbase972.com/2020/06/09/1247/ Skip to content",
  "content_length": 6035,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:25"
}