{
  "name": "Himansu Das",
  "homepage": "https://cse.kiit.ac.in/profiles/himansu-das",
  "status": "success",
  "content": "Himansu Das - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Himansu Das Himansu Das Himansu Das Associate ProfessorDr. Himansu Das, works as Associate Professor in the School of Computer Engineering, Kalinga Institute of Industrial Technology (KIIT), Deemed to be University, Bhubaneswar, India. He has received Ph.D. in Engineering degree from Veer Surendra Sai University of Technology (VSSUT), Odisha. He has received M.Tech degree in Computer Science and Engineering from the National Institute of Science and Technology, Odisha. He has also received B.Tech degree from the Institute of Technical Education and Research, Odisha, India. He has published several research papers in various international journals and has presented at conferences. He has also edited several books published by IGI Global, Springer, CRC press, and Elsevier. He has also served on many journals and conferences as editorial or reviewer board member. He is proficient in the field of Computer Science Engineering and served as an organizing chair, a publicity chair and acted as a member of the technical program committees of many national and international conferences. His research interests include the field of Data Mining, Soft Computing, and Machine Learning. He has also more than seventeen years of teaching and research experience in various engineering colleges and universities. Profile LinksEmail :[email protected]Website :sites.google.comGoogle Scholar :https://scholar.google.co.in/citations?hl=en&user=OnjKfNQAAAAJ&view_op=list_works&sortby=pubdate Social LinksProfileRecent PublicationsProfileResearch Interests1. Machine Learning 2. Dimensionality Reduction 3. Feature Selection Classification and ClusteringAdministrative Responsibility1. Faculty in Charge, Laboratories, School of Computer Engineering, KIIT Deemed to be University, India. 2. Course Coordinator, Operating System Laboratory, School of Computer Engineering, KIIT Deemed to be University, India. (2021) 3. Course Coordinator, Operating System, School of Computer Engineering, KIIT Deemed to be University, India. (2020) 4. Course Coordinator, Operating System Lab, School of Computer Engineering, KIIT Deemed to be University, India. (2019) Course Coordinator, Computer Organization and Architecture, School of Computer Engineering, KIIT Deemed to be University, India. (2018) Faculty in Charge, Time Table, School of Computer Engineering, KIIT Deemed to be University, India. Faculty in Charge, Quality Assurance Cell, School of Computer Engineering, KIIT Deemed to be University, India. Faculty in Charge, Project, School of Computer Engineering, KIIT Deemed to be University, India. Faculty in Charge, Library, School of Computer Engineering, KIIT Deemed to be University, India. Course Coordinator, Computer Organization and Architecture Subject, School of Computer Engineering, KIIT Deemed to be University, India. (2016)\"Awards & Honours 1. Summer Research Fellow 2014, Indian Science Academy 2. Conducted several Community service Programs for the rural, un-employed and un-organized youth to give Awareness on “Computer and internet related Applications 3. Guided several students in doing their projects and helped poor students to obtain their settle in teaching position.Recent PublicationsJournals/Conferences :Journals (27) 1. P K Rath, R Samantaray, S Mahato, S Mishra, S K Patro, Himansu Das, \"Feature selection using war strategy optimization algorithm for software fault prediction\", Int. J. of Computational Science and Engineering, Inder Science 2. Kumar, H., & Himansu Das (2025). Cost-Effective Prediction Model for Optimal Selection of Software Faults Using Coati Optimization Algorithm. SN Computer Science, 6(5), 420. 3. Mishra, S., Himansu Das, Mohapatra, S. K., Khan, S. B., Alojail, M., & Saraee, M. (2025). A hybrid fused-KNN based intelligent model to access melanoma disease risk using indoor positioning system. Scientific Reports, 15(1), 7438. 4. Anand, K., Jena, A. K., Himansu Das, Askar, S. S., & Abouhawwash, M. (2025). Software defect prediction using wrapper-based dynamic arithmetic optimization for feature selection. Connection Science, CRC Press, 37(1), 2461080. 5. Anand, K., Jena, A. K., & Himansu Das (2024). Implementation of Chernobyl disaster optimizer based feature selection approach to predict software defects. F1000Research, CRC Press, 13, 844. 6. Himansu Das, S Das, M K Gourisaria, S B Khan, A Almusharraf, A I Alharbi, and T R Mahesh, Enhancing Software Fault Prediction through Feature Selection with Spider Wasp Optimization Algorithm, IEEE Access. 7. Pethe, Y. S., Gourisaria, M. K., Singh, P. K., & Himansu Das. (2024). FSBOA: feature selection using bat optimization algorithm for software fault detection. Discover Internet of Things, 4(1), 6. 8. P K Rath, S Ghosh, M K Gourisaria, S Mahato, and Himansu Das, A Wrapper based Feature Selection Approach using Osprey optimization for Software Fault Detection, Int. J. of Embedded Systems, Inder Science 9. Himansu Das, Muskan, & H Kumar, Feature Selection using Tasmanian Devil Optimization Algorithm for Software Fault Prediction, Int. J. of Computational Science and Engineering, Inder Science 10. J K Rout, C Thaokar, Himansu Das, & M Rout, Fake content detection on benchmark dataset using various deep learning models, Int. J. of Computational Science and Engineering, Inder Science 11. Ghosh, S., Gourisaria, M.K., Sahoo, B, & Himansu Das, A pragmatic ensemble learning approach for rainfall prediction. Discover Internet of Things, Springer 3, 13 (2023). https://doi.org/10.1007/s43926-023-00044-3 12. Prajapati, S., Himansu Das, & Gourisaria, M.K. Feature selection using differential evolution for microarray data classification. Discover Internet of Things, Springer 3, 12 (2023). https://doi.org/10.1007/s43926-023-00042-5 13. Panigrahi, S.K.; Goswami, V.; Apat, H.K.; Mund, G.B.; Himansu Das; Barik, R.K. PQ-Mist: Priority Queueing-Assisted Mist–Cloud–Fog System for Geospatial Web Services. Mathematics 2023, 11, 3562. https://doi.org/10.3390/math11163562 14. Mallick, S. R., Lenka, R. K., Goswami, V., Sharma, S., Dalai, A. K., Himansu Das, & Barik, R. K. (2023). BCGeo: Blockchain-assisted geospatial web service for smart healthcare system. IEEE Access. 15. Himansu Das; Prajapati, S.; Gourisaria, M.K.; Pattanayak, R.M.; Alameen, A.; Kolhar, M. Feature Selection Using Golden Jackal Optimization for Software Fault Prediction. Mathematics 2023, 11, 2438. https://doi.org/10.3390/math11112438 16. Nayak, N.; Das, S.R.; Panigrahi, T.K.; Himansu Das; Nayak, S.R.; Singh, K.K.; Askar, S.S.; Abouhawwash, M. Overshoot Reduction Using Adaptive Neuro-Fuzzy Inference System for an Autonomous Underwater Vehicle. Mathematics 2023, 11, 1868. https://doi.org/10.3390/math11081868 17. Padhi, B. K., Chakravarty, S., Naik, B., Pattanayak, R. M., & Himansu Das (2022). RHSOFS: Feature Selection Using the Rock Hyrax Swarm Optimization Algorithm for Credit Card Fraud Detection System. Sensors, 22(23), 9321. 18. Gourisaria, M. K., Chandra, S., Himansu Das, Patra, S. S., Sahni, M., Leon-Castro, E., ... & Kumar, S. (2022, May). Semantic Analysis and Topic Modelling of Web-Scrapped COVID-19 Tweet Corpora through Data Mining Methodologies. In Healthcare (Vol. 10, No. 5, p. 881). MDPI. 19. Pattanayak, R. M., Sangameswar, M. V., Vodnala, D., & Himansu Das, (2022). Fuzzy time series forecasting approach using lstm model. Computación y Sistemas, 26(1), 485-492. 20. Himansu Das, B Naik and H S Behera, \"Optimal Selection of Features using Artificial Electric Field Algorithm for Classification”, Arabian Journal for Science and Engineering, Springer, 2021 21. Himansu Das, B Naik and H S Behera, \"A Jaya Algorithm based Wrapper Method for Optimal Feature Selection in Supervised Classification\", Journal of King Saud University - Computer and Information Sciences, Elsevier, 2020 22. Himansu Das, B Naik and H S Behera, \"Biomedical Data Analysis using Neuro-Fuzzy Model with Post-feature Reduction\", Journal of King Saud University - Computer and Information Sciences, Elsevier, 2020 23. Himansu Das, B Naik and H S Behera, \"A Hybrid Neuro-Fuzzy and Feature Reduction Model for Classification\",Advances in Fuzzy System, Hindawi, 2020 24. Himansu Das, B Naik, H S Behera, \"Medical Disease Analysis using Neuro-Fuzzy with Feature Extraction Model for Classification\", Informatics in Medicine Unlocked, Elsevier, 2020 25. A K Mishra, S R Das, P K Roy, R K Mallick, Himansu Das, \"Harmonic distortion minimization in power system using differential evolution based active power filters\", Recent Advances in Computer Science and Communications, Bentham Science, 2021 26. S R Das, P K Ray, D P Mishra, and Himansu Das, \"Performance assessment of PV integrated Model Predictive Controller based hybrid filter for Power Quality Improvement\", International Journal of Power Electronics, Inderscience, 2021 27. S R Das, P K Ray, A Mohanty, Himansu Das, \"Performance Evaluation of Multilevel inverter based Hybrid Active Filter Using Soft Computing Techniques\", in Evolutionary Intelligence, Springer, 2019 https://doi.org/10.1007/s12065-019-00217-6 Conferences (62) 1. Jha, R., Kumari, S., Ray, A., Gourisaria, M. K., Panda, A. R., & Das, H. (2024, July). Comparative Analysis of Sentiment Classification using Feature Engineering for Social Media. In 2024 5th International Conference on Image Processing and Capsule Networks (ICIPCN) (pp. 434-440). IEEE. 2. Parihar, V., Gourisaria, M. K., Singh, J. P., Das, H., Panda, A. R., & Mishra, S. R. (2024, June). Deciphering PCOS: Precision Diagnosis through Advanced Machine Learning Techniques. In 2024 15th International Conference on Computing Communication and Networking Technologies (ICCCNT) (pp. 1-6). IEEE. 3. Biraja Isac, N., & Das, H. (2024, May). Optimizing Hyper-Parameters for Sanskrit to English Neural Machine Translation with LSTM and GRU Models. In Internation",
  "content_length": 27361,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:26"
}