{
  "name": "Hiroyuki Kitagawa",
  "homepage": "http://www.kde.cs.tsukuba.ac.jp/~kitagawa/index.html",
  "status": "success",
  "content": "Hiroyuki Kitagawa, Dr. Sc. Japanese Version Here Hiroyuki Kitagawa, Dr. Sc. Profile Hiroyuki Kitagawa received the B.Sc. degree in physics and the M.Sc. and Dr.Sc. degrees in computer science, all from the University of Tokyo, in 1978, 1980, and 1987, respectively. He joined Institute of Information Sciences and Electronics, University of Tsukuba, in 1988. He is currently a Specially Appointed Professor at International Institute for Integrative Sleep Medicine, University of Tsukuba. He is also a Collaborative Fellow at Center for Computational Sciences, University of Tsukuba, a Visiting Professor at Kanazawa University, and an Invited Researcher at Intelligent Platforms Research Institute, National Institute of Advanced Industrial Science and Technology (AIST). His research interests include databases, data engineering, and big data: data mining, stream processing, sleep data analysis, information integration, information retrieval, and data analysis in medical and scientific domains. He is an IEICE Fellow and an IPSJ Fellow. Before joining University of Tsukuba, he was a research staff member in NEC Corporation, Tokyo. He was a visiting scholar of Carnegie Mellon University from 2001 to 2002, and of University of Maryland from 1984 to 1985. He served as Provost of Graduate School of Systems and Information Engineering, University of Tsukuba from April 2015 to March 2018, President of DBSJ (Database Society of Japan) from May 2014 to May 2016, Chairperson of ACM SIGMOD Japan Chapter from June 2003 to June 2007, Chairperson of the IEICE Special Interest Group on Data Engineering from May 1999 to May 2001, and an Associate Member of the Science Council of Japan from October 2011 to September 2023. He is a Senior member of IEEE, an Honorary member of DBSJ, and a member of ACM, Japan Society of Sleep Research, and JSSST (Japan Society for Software Science and Technology). Publications Selected Publication List DBLP ACM DL Google Scholar Scopus ORCiD Web of Science Professional Activities Steering Committee Member of WAIM (2013-2016) Steering Committee Member Eemeritus of DASFAA (2013-Present) Steering Committee Member of DASFAA (2008-2013) Editor of IEEE Transactions on Big Data (2018-Present) Editor of IEEE Transactions on Knowledge and Data Engineering (2010-2014) Editor of World Wide Web Journal (2010-2023) Advisor of KJDB Working Group (2022-Present) Chair of KJDB Working Group (2019-2022) Vice Chair of KJDB Working Group (2016-2019) Secretary of KJDB Working Group (2014-2016) Honorary Conference Co-Chair for IEEE MIPR 2021 Organizing Committee Chair for VLDB 2020 Program Committee Co-Chair for IEEE Bigcomp 2019 Panel Co-Chair for ASONAM 2014 General Co-Chair for WAIM 2013 Best Paper Committee Co-Chair for DASFAA 2013 Best Paper Committee Co-Chair for DASFAA 2012 General Co-Chair for KJDB 2010 General Chair for DASFAA 2010 General Co-Chair for APWeb 2008 General Co-Chair for KJDB 2008 Publicity Chair for ICDE 2005 Chair of ACM SIGMOD Japan Chapter (2003-2007) Auditor-Secretary of the Database Society of Japan (2016-2022) President of the Database Society of Japan (2014-2016) Vice President of the Database Society of Japan (2005-2007, 2012-2014) Trustee of the Database Society of Japan (2003-2016) Chair of IEICE Special Interest Group on Data Engineering (1999-2001) Advisory Committee Member of SRDS2014 Advisory Board Member of IEICE Special Interest Group on Data Engineering (2001-Present) International Program Committee Member for ACM SIGMOD (1996, 2007(PhD WS)) VLDB (1995, 1999, 2006 (Demo), 2010) ICDE (1995) CIKM (1998) AAAI (2016, 2017, 2018) DASFAA (2001, 2003, 2005, 2009, 2011, 2012, 2013, 2014, 2015) CoopIS (2008, 2009, 2010, 2012, 2013, 2014, 2015, 2016) DEXA (2009, 2010, 2011, 2012, 2013, 2014, 2015) ER (1998, 2001, 2011) FODO (1998) MDM (2004, 2008, 2010, 2012, 2013, 2014) PAKDD (2009, 2010, 2011, 2013, 2014) WISE (2001, 2002, 2004, 2005, 2006, 2007, 2009) WAIM (2005, 2006, 2007, 2008, 2009) EC-Web (2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008) APWeb (2004, 2005, 2006, 2007, 2009) ICADL (2006, 2008) ICWS (2004, 2006) ICWE (2005, 2006) IDEAS (2013, 2014, 2015, 2016) ACM SAC (2015, 2016) and others Ad-hoc Reviewer for ACM Transactions on Database Systems IEEE Transactions on Knowledge and Data Engineering The VLDB Journal The VLDB Journal Data Mining and Knowledge Discovery The Visual Computer and others Courses College of Information Science: Database Systems I Information Retrieval Data Structures and Alrgorithms Graduate School of Systems and Information Engineering: Data Engineering I His Research Laboratory KDE Laboratory Address Laboratory for Advanced Research B Building University of Tsukuba Tennohdai, Tsukuba, Ibaraki 305-8573, Japan Phone/Fax (Office): +81-298-53-5522 Phone (Lab.): +81-298-53-5051 Email: kitagawa(AT)cs.tsukuba.ac.jp International Institute for Integrative Sleep Medicine Graduate School of Systems and Information Engineering Center for Computational Sciences",
  "content_length": 4987,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:34"
}