{
  "name": "Hirokazu Kato 0001",
  "homepage": "https://imdl.naist.jp",
  "status": "success",
  "content": "IMD Lab コンテンツへスキップ Human-Computer Interaction 詳細 Computer Graphics 詳細 Human-Robot Interaction 詳細 Computer Vision 詳細 Interactive Media Design Laboratory Our vision is to introduce Augmented Reality into the everyday lives of everyone on this planet. Augmented Reality is a technology that enhances human vision with computer generated graphics. In order to achieve our vision, it is imperative to merge three currently distinct research fields into one: Computer Graphics, Computer Vision, and Human-Computer Interaction. The lab is directed by Professor Hirokazu Kato and includes several assistant professors, postdocs, graduate students and visitors. Your browser does not support HTML5 video. News [Top News] 2024/07/02 Prof. Hirokazu Kato was recognized as one of the first 101 pioneers in the AWE’S XR Hall of Fame.[Official HP] 2023/12/13 Kota Nieda (M1) got best student interactive award at HCGSYMPO [blog][大学公式] 2023/10/18 Prof. Kato got ISMAR 2023 Career Impact Award at ISMAR2023 [blog][NAIST official HP] (In recognition for the significant impact his lifelong research has had to the field Augmented Reality) [Tech News] Dr. AR (Design Refinement of Augmented Reality) v1, an auxiliary tool for creating an assembly support system using AR, has been officially released. Please take advantage of this service. [Daily News] 2024/09/01 Assistant Professor Isidro Butaslac joined IMD lab. 2023/08/22 Conference reports blog is updated [blog] 2023/08/09 Got Student Presentation Encouragement Award at CNR local conference! 2023/07/2o Daniel Eckhoff-kun from the City University of Hong Kong Visit IMD [blog] 2023/05/13 Open Campus 2023 Day [blog] 2023/05/09 Start the 2023 internship for Nara Kita High School students. 2023/05/01  New 5 M1 members join IMD-lab. 2022/08/03 We held SSH Lab Stay for high school students from Nishiyamato Gakuen. 2022/07/10 IMD Lab was recorded as the Unique (or Rare) Research Laboratory by Nanikore Chin Hyakkei TV shows. [blog] 2022/07/01 Tainaka, Kodama, Kawase, Yamauchi, Sawabe, Kanbara won the CNR Students Awards. [blog, Awards] 2022/05/01 Start the 2022 internship for Nara Kita High School students. 2022/03/11 2 groups from IMD lab were nominated IMD MVE. [blog] 2022/03/07  2 groups from IMD lab were nominated for The Best Research Project Award, The Excellent Research Project Award (runner-up) from IMD lab in CICP  [blog]. 2021/07/13 The data collection process for TSUNDERE behavior model is now available on the CCO-Cha youtube channel. 2021/05/01 Start the 2021 internship for Nara Kita High School students. 2021/04/01 Assistant Professor Taishi Sawabe joined IMD lab. 2021/02/20 Keishi Tainaka, Isidro Butaslac and Tetsuya Kodama (Supervisor: Taishi Sawabe, and Masayuki Kanbara) won the best award in CICP. 2020/03/09 Kenta Sugiyama wrote a blog post about his stay in Technical University of Munich in Germany. 2019/11/30 Assistant Professor Alexander Plopski has moved to The human-computer interaction group at University of Otago. We are thankful for all the knowledge, wisdom and support he brought to our lab, and wish him all the best in a new chapter of his life. 2019/11/29 Ryo Akiyama gave an invited talk about “Perceptual Appearance Control by Projection-Induced Illusion” at IDW ’19. 2019/06/12 Assistant Professor Alexander Plopski gave an invited talk about \"Overcoming Optical See-Through Head-Mounted Display Limitations through Eye Tracking\" at Beihang University. 2019/06/7-9 Laboratory's study trip took place in Shiga.[blog post] 2019/05/24 Naoki Inoue won Student Presentation Award in SCI'19. 2019/04/01 Associate Professor Masayuki Kanbara, Assistant Professor Yuichiro Fujimoto, new M2 students, and new M1 students joined our lab. news archive Links Nara Institute of Science and Technology (NAIST) Graduate School of Information Science (IS-Division) Training program of young researchers who can be globally active in interdisciplinary field between media informatics and sports science for overcoming serious issues in super aged society",
  "content_length": 4030,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:28"
}