{
  "name": "Hironori Kasahara",
  "homepage": "http://www.kasahara.cs.waseda.ac.jp/kasahara.html.en",
  "status": "success",
  "content": "WASEDA UNIVERSITY Computer Science and Engineering Kasahara Laboratory IEEE Computer Society | Japanese | English | Private Page Professor Associate Professor Publications Members Class Infomeation Location Distinguished Visitors Links Research [PDF] Kimura Lab. Inquiry Hironori KASAHARA ・ IEEE Computer Society 2018 President Waseda University ・ Senior Executive Vice President (Nov. 2018 - Sept. 2022) ・ Professor, Dept. of Computer Sci. & Eng., Faculty of Science and Engineering ・ Director, Advanced Multicore Processor Research Institute ・ Activities in Societies and Government ・ List of Papers, Awards and Patents ・ News E-mail: kasahara_at_waseda_dot_jp (_at_: @, _dot_: .) Twitter (Japanese), Twitter(English), Instagram, Linkedin Office: 55N-505A,505B,506A,507A Green Computing Systems R&D Center 501-503, 706 Brief personal history: B.S.(1980, Waseda), M.S.(1982, Waseda), Res. Assoc.(1983, Waseda), Dr. Eng. (1985, Waseda), Visiting Scholar (1985, Univ. California at Berkeley), Assist. Prof.(1986, Waseda), Assoc. Prof.(1988, Waseda), Visiting Research Scholar(1989-1990, Center for Supercomputing R & D, Univ. of Illinois at Urbana-Champaign), Kyushu University Graduate School of Science and Engineering Part-time Lecturer(1993), Prof.(1997, Waseda), Director(2004, Advanced Multicore Processor Research Institute, Waseda), IEEE Computer Society Board of Governor (2009-2014), IEEE Computer Society Golden Core Member(2010-), Visiting Prof.(2010.9.1 - 2011.8.31, Egypt Japan University for Science and Technology (E-JUST) ), The University of Tokyo Department of Computer Science Part-time Lecturer(2011), Operation Committee Member, Green Computing System Research Organization, Waseda University(Apr. 2011 - ), IPSJ Fellow (2015), IEEE Fellow (2017), IEEE Computer Society President Elect (2017), Member of the Engineering Academy of Japan(2017), Member of the Science Council of Japan(2017), Professional member of the IEEE Eta Kappa Nu(IEEE-HKN) (2017), The Okawa Foundation for Information and Telecommunications Councilor(2017-), IEEE Computer Society President (2018), Director, Research Collaboration and Promotion Center, Waseda University(2018-2019) Senior Executive Vice President for Research and IT Promotion(2018-2020), The Okawa Foundation for Information and Telecommunications Okawa Award Selection Committee Member(2018-), Waseda Shibuya Senior High School Representative Director(Nov. 2018 - Sept. 2022), Waseda Junior and Senior High School Member of Board of Directors and Councilor(Nov. 2018 - Sept. 2022), Chairperson, Research Organization for Open Innovation Strategy, Waseda University(Nov. 2018 - Sept. 2022) IEEE Computer Society Past President(2019), Director, Research Innovation Center, Waseda University(Nov. 2018 - Sept. 2022) Japan Universities Association for Computer Education Standing Director(2019-2021), COCN(Council on Competitiveness-Nippon) Board Member(2019-), Director, Intellectual Property and Research Collaboration Support Section, Research Innovation Center, Waseda University(2020) Advisor, Japan Science and Technology Agency(JST) for moonshot research and development project(May 2020-Present) Senior Executive Vice President for Research (Nov. 2018 - Sept. 2022), Director of the Engineering Academy of Japan (2020-) General Director, Research Innovation Center, Waseda University (Nov. 2018 - Sept. 2022) Chairman, Japan Science and Technology Agency(JST) Next Generation Researcher Challenging Research Program Committee(Apr. 2023-Present) Govering Board Member, Japan Science and Technology Agency(JST) Research Accomplishments Development Project University-Launched new industry creation program, Governing Board(Mar. 2023-Present) Co-General Chair, ACM/IEEE ISCA2025(International Symposium on Computer Architecture)(Jun. 2023-2025) Award Young Author Prize: IFAC Triennial World Congress(1987) IPSJ Sakai Memorial Special Award (1997) STARC (Semiconductor Technology Academic Research Center) Industry-Academia Cooperative Research Award (2005) 2008 LSI Of The Year The Second Prize (2008) IEEE Computer Society Golden Core Member (2009) Prizes for Science and Technology (Research), The Commendation for Science and Technology by the Minister of Education, Culture, Sports, Science and Technology (2014) IEEE　Computer Society Fellow（2017） IEEE Computer Society Spirit of the Computer Society Award (2019) IPSJ Contribution Award (2020) Research Key Words: ●Automatic Parallelizing and Power Reducing Compiler ●Super Computing ●Embedded Systems ●Multicore and Many Core with Vector Accelerator ●Green Computing ●Scheduling Algorithm ●Multi-platform Parallel API ●Application Parallelization ・Medical　Image　Processing ・Drinkable Capsule Inner Camera ・Automobile Engine Control, ADAS, Self-Driving ・MATLAB/Simulink ・New Materials ・Face Recognition ・Deep Learning OSCAR : Optimally Scheduled Advanced Multiprocessor in 1986 OSCAR multicores: 4 core RP1 (2007) , 8 core RP2 (2008) and 15 core Heterogeneous RPX (2010) developed in NEDO Projects with Hitachi and Renesas Copyright (C) 2009 Waseda University.",
  "content_length": 5080,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:29"
}