{
  "name": "Hiroshi Ishiguro",
  "homepage": "https://eng.irl.sys.es.osaka-u.ac.jp",
  "status": "success",
  "content": "Ishiguro Lab.Search this siteEmbedded FilesSkip to main contentSkip to navigation Intelligent Robotics Laboratory, The University of Osaka> 日本語A Perceptual Information Infrastructure monitors and recognizes real environment through sensor networks. The sensor network tracks people in real-time and recognizes human behaviors which provide rich information for understanding real world events and helps peoples and robots working in the real world. An Intelligent Robot Infrastructure is an interaction-based infrastructure. By interacting with robots, people can establish nonverbal communications with the artificial systems. That is, the purpose of a robot is to exist as a partner and to have valuable interactions with people. Our objective is to develop technologies for the new generation information infrastructures based on Computer Vision, Robotics and Artificial Intelligence. Introduction（PDF）Ishiguro Lab TourWe hold the lab tours mainly for those who wish to enter our lab and graduate school.NEXT： December 10th, 2025,  4:00pm~5:30pmRegistration: Link＊Application Deadline： November 30th, 2025We explain our research and how to enter our lab and graduate school. Though this tour is held in Japanese, you can ask questions in English.  We will conduct the tour in a hybrid way, using both on-site and ZOOM. Please note that there is a possibility that only ZOOM will be held in some cases.Please refrain from personal visits or social visits of schools and companies.For International StudentsPlease check our graduate school website now![Graduate Admissions]Please check this web site.https://www.es.osaka-u.ac.jp/en/admission-aid/graduate-admissions/index.htmlStudents who have studied informatics, control, material and biology can take the entrance examination of your background. You can study in our department in English. No Japanese conversation skill is needed.International students who are planning to study at The University of Osaka, please go to the following site.【 AAD（Admissions AssistanceDesk) 】News2024/MayProf. Ishiguro received  The Ichimura Prize in Science for Excellent Achevement.Please see below for details. https://www.sgkz.or.jp/prize/science/list/56.html2023/JanuaryThe website for Expo2025,Osaka,Kansai,Japan , for which Prof. Ishiguro is the producer, is now open.Click here for details.#OsakaExpo2025: Is the android era upon us? Meet innovator Hiroshi Ishigurohttps://www.youtube.com/watch?v=XsO9yVy8hEE2021/SeptemberProf. Ishiguro received an honorary doctorate by Aarhus University in Denmark.Please see below for details.https://medarbejdere.au.dk/en/strategy/recurring-events/the-annual-celebration/honorary-doctorates/honorary-doctorate-2021-professor-hiroshi-ishiguro-faculty-of-arts/2021/SeptemberProf. Ishiguro received a special award at the 6th (FY2020) Tateishi Prize.Please see below for details.https://www.tateisi-f.org/tateisiprize/winner.html 2021/MayProf. Ishiguro's research was introduced in the following rink of Goethe-Institut .（English）　https://www.goethe.de/prj/k40/en/fil/ish.html（German）  https://www.goethe.de/prj/k40/de/fil/ish.html2020/DecemberProf. Ishiguro's research was introduced in a program on NHK World.*Program name: We, in the Time of Corona*Broadcasting station: NHK WorldYou can  watch the program on NHK World on demand.https://www3.nhk.or.jp/nhkworld/en/ondemand/program/video/inthetimeofcorona/?type=tvEpisode& 2018/AugustIEEE spectrum's Video Friday: Professor Ishiguro’s New Robot Child, and MoreLinkTweets Contactsecretary[at]irl.sys.es.osaka-u.ac.jpLinkIshiguro Lab's wikiLab members' pagegemini top pageAbout Professor Hiroshi Ishiguro (Online articles)Address1-3 Machikaneyama Toyonaka Osaka 560-8531 JapanTEL: +81-6-6850-6360Symbiotic Intelligent Systems Research CenterReport abuseReport abuse",
  "content_length": 3794,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:30"
}