{
  "name": "Hiroaki Mizuhara",
  "homepage": "https://researchmap.jp/mizuhara/?lang=english",
  "status": "success",
  "content": "水原 啓暁 (Hiroaki Mizuhara) - マイポータル - researchmap × {{flash.message}} 基本情報 所属奈良女子大学 研究院 生活環境科学系 教授国立研究開発法人情報通信研究機構 脳情報通信融合研究センター 特別研究員 学位 博士(工学)(2002年3月) 研究者番号 30392137J-GLOBAL ID201101043504993806researchmap会員IDB000001881 外部リンクhttps://www.ics.nara-wu.ac.jp/~mizuhara/ 脳波やfMRIなどの人を対象とした非侵襲の脳機能計測を専門としています。また、脳波の時間分解能でfMRIの空間分解能を実現するために、脳波とfMRIの同時計測技術を開発しています。脳波とfMRIの同時計測技術においては、国際的なトップジャーナル(NeuroImage誌)の論文賞を受賞するなど、世界的に評価されています。これらの脳機能計測技術を用いて、人のコミュニケーションに関する諸機能(例えば、音声理解、自他分離などのコミュニケーションの根幹をなす機能)のメカニズム解明を進めています。 研究キーワード 17 Phase Synchronization fMRI EEG 脳波 脳機能イメージング 計測工学 認知科学 脳・神経 生物・生体工学 認知神経科学 機能的MRI MRI 神経科学 位相同期 神経回路 情報統合 コミュニケーション 研究分野 5 情報通信 / 知能情報学 / 情報通信 / 知覚情報処理 / ライフサイエンス / 認知脳科学 / ライフサイエンス / 基盤脳科学 / 人文・社会 / 認知科学 / 経歴 9 2025年5月 - 現在 国立研究開発法人情報通信研究機構, 脳情報通信融合研究センター, 特別研究員 2024年4月 - 現在 奈良女子大学, 研究院 生活環境科学系, 教授 2022年3月 - 2024年3月 京都大学 大学院情報学研究科, 准教授 2007年4月 - 2022年2月 京都大学 大学院情報学研究科, 講師 2018年9月 - 2019年3月 英国グラスゴー大学, 神経科学心理学研究所, 訪問研究員 2005年9月 - 2011年3月 理化学研究所 脳科学総合研究センター, 客員研究員 2005年9月 - 2007年3月 岡山大学 大学院自然科学研究科, 講師 2002年4月 - 2005年8月 理化学研究所 脳科学総合研究センター, 研究員 - 2002年3月 山口大学 大学院理工学研究科, 博士後期課程 早期修了 博士（工学） 受賞 9 2013年6月 優秀発表賞新規性評価部門, 日本認知心理学会 水原啓暁 2013年6月 優秀研究賞, 日本神経回路学会 2011年9月 科学研究費補助金第一段審査委員表彰, 日本学術振興会 水原啓暁 2010年5月 優秀発表賞技術性評価部門, 日本認知心理学会 水原啓暁 2007年9月 SICE2007 Annual Conference Young Author's Award Hiroaki Mizuhara 2007年6月 NeuroImage Section Editors Choice Award Hiroaki Mizuhara 2007年3月 論文賞, ヒューマンインタフェース学会 2002年3月 研究科長賞, 山口大学大学院理工学研究科 水原啓暁 2000年5月 奨励賞, システム制御情報学会 水原啓暁 論文 36 コミュニケーションを脳情報学で読み解く 水原啓暁 家政学研究 71(2) 84-89 2025年3月  招待有り筆頭著者最終著者責任著者 Neural activity related to productive vocabulary knowledge effects during second language comprehension. Takara Kenza Allal-Sumoto, Duygu Şahin, Hiroaki Mizuhara Neuroscience research 2024年1月18日 The effect of productive vocabulary knowledge on second language comprehension Takara Kenza Allal-Sumoto, Kiyofumi Miyoshi, Hiroaki Mizuhara Frontiers in Psychology 2023年  査読有り最終著者責任著者 Frequency-Dependent Cortical Interactions during Semantic Processing: An Electrocorticogram Cross-spectrum Analysis Using a Semantic Space Model. Naoyuki Sato, Riki Matsumoto, Akihiro Shimotake, Masao Matsuhashi, Mayumi Otani, Takayuki Kikuchi, Takeharu Kunieda, Hiroaki Mizuhara, Susumu Miyamoto, Ryosuke Takahashi … Cerebral cortex (New York, N.Y. : 1991) 31(9) 4329-4339 2021年7月29日  査読有り The Role of Temporal Contingency and Integrity of Visual Inputs in the Sense of Agency: A Psychophysical Study. Hiroaki Mizuhara, Peter Uhlhaas Frontiers in psychology 12 635202-635202 2021年  査読有り筆頭著者責任著者 Successful Encoding during Natural Reading Is Associated with Fixation-Related Potentials and Large-Scale Network Deactivation. Sato N, Mizuhara H eNeuro 5(5) 2018年9月  査読有り Open monitoring meditation reduces the involvement of brain regions related to memory function. Masahiro Fujino, Yoshiyuki Ueda, Hiroaki Mizuhara, Jun Saiki, Michio Nomura Scientific reports 8(1) 9968-9968 2018年7月2日  査読有り A dynamical systems approach for estimating phase interactions between rhythms of different frequencies from experimental data. Takayuki Onojima, Takahiro Goto, Hiroaki Mizuhara, Toshio Aoyagi PLoS computational biology 14(1) e1005928 2018年1月  査読有り Ongoing slow oscillatory phase modulates speech intelligibility in cooperation with motor cortical activity. Takayuki Onojima, Keiichi Kitajo, Hiroaki Mizuhara PloS one 12(8) e0183146 2017年  査読有り最終著者責任著者 Increased BOLD Signals Elicited by High Gamma Auditory Stimulation of the Left Auditory Cortex in Acute State Schizophrenia Hironori Kuga, Toshiaki Onitsuka, Yoji Hirano, Itta Nakamura, Naoya Oribe, Hiroaki Mizuhara, Ryota Kanai, Shigenobu Kanba, Takefumi Ueno EBIOMEDICINE 12 143-149 2016年10月  査読有り Top-down and bottom-up attention cause the ventriloquism effect with distinct electroencephalography modulations Toshihiro Kumagai, Hiroaki Mizuhara NEUROREPORT 27(9) 647-651 2016年6月  査読有り最終著者責任著者 Cortical networks dynamically emerge with the interplay of slow and fast oscillations for memory of a natural scene Hiroaki Mizuhara, Naoyuki Sato, Yoko Yamaguchi NEUROIMAGE 111 76-84 2015年5月  査読有り筆頭著者責任著者 Dynamic Parieto-premotor Network for Mental Image Transformation Revealed by Simultaneous EEG and fMRI Measurement Takafumi Sasaoka, Hiroaki Mizuhara, Toshio Inui JOURNAL OF COGNITIVE NEUROSCIENCE 26(2) 232-246 2014年2月  査読有り Cortical dynamics of human scalp EEG origins in a visually guided motor execution Hiroaki Mizuhara NEUROIMAGE 62(3) 1884-1895 2012年9月  査読有り筆頭著者責任著者 Traveling EEG slow oscillation along the dorsal attention network initiates spontaneous perceptual switching Takashi J. Ozaki, Naoyuki Sato, Keiichi Kitajo, Yoshiaki Someya, Kimitaka Anami, Hiroaki Mizuhara, Seiji Ogawa, Yoko Yamaguchi COGNITIVE NEURODYNAMICS 6(2) 185-198 2012年4月  査読有り 他者の状態によって変調する脳の報酬系: fMRI研究 鹿内 学, 水原 啓暁 日本認知心理学会発表論文集 2012 14-14 2012年 ミラーニューロンシステムにより促進される音声知覚 水原 啓暁, 井上 卓, 笹岡 貴史, 鹿内 学 日本認知心理学会発表論文集 2012 12-12 2012年 単文理解過程における統語処理に関わる脳波ダイナミクス 荒井 翔真, 岩渕 俊樹, 水原 啓暁, 朝倉 暢彦, 乾 敏郎 日本認知心理学会発表論文集 2012 31-31 2012年 Neuronal ensemble for visual working memory via interplay of slow and fast oscillations Hiroaki Mizuhara, Yoko Yamaguchi EUROPEAN JOURNAL OF NEUROSCIENCE 33(10) 1925-1934 2011年5月  査読有り筆頭著者責任著者 Is Mu Rhythm an Index of the Human Mirror Neuron System? A Study of Simultaneous fMRI and EEG Hiroaki Mizuhara, Toshio Inui ADVANCES IN COGNITIVE NEURODYNAMICS (II) 123-127 2011年  査読有り筆頭著者責任著者 もっとみる MISC 77 Predictability of electrocorticogram coherence using distributed semantic representation Naoyuki Sato, Riki Matsumoto, Akihiro Shimotake, Masao Matsuhashi, Mayumi Otani, Takayuki Kikuchi, Takeharu Kunieda, Hiroaki Mizuhara, Ryosuke Takahashi, Akio Ikeda Program ID: 339.18, Annual meeting of Society for Neuroscience 2019 2019年10月 位相振動子モデルを用いた異なる周波数間の結合推定 小野島隆之, 後藤貴宏, 水原啓暁, 青柳富誌生 日本物理学会講演概要集(CD-ROM) 73(1) ROMBUNNO.25aK703‐10-2855 2018年3月23日 Increased BOLD Signals Elicited by High Gamma Auditory Stimulation of the Left Auditory Cortex in Acute State Schizophrenia (vol 12, pg 143, 2016) Hironori Kuga, Toshiaki Onitsuka, Yoji Hirano, Itta Nakamura, Naoya Oribe, Hiroaki Mizuhara, Ryota Kanai, Shigenobu Kanba, Takefumi Ueno EBIOMEDICINE 16 312-312 2017年2月 How do Focused attention meditation and Open monitoring meditation regulate the default mode network activity? Masahiro Fujino, Yoshiyuki Ueda, Hiroaki Mizuhara, Jun Saiki, Michio Nomura INTERNATIONAL JOURNAL OF PSYCHOLOGY 51 883-883 2016年7月  査読有り Subsequent memory-dependent BOLD activation during the natural reading of literature. Naoyuki Sato, Hiroaki Mizuhara 22st Annual Meeting of the Organization for Human Brain Mapping, Geneva, Switzerland 2016年6月 脳波データにおける振動子間ネットワークの推定 小野島隆之, 大田絵一郎, 後藤貴宏, 水原啓暁, 青柳富誌生 日本ヒト脳機能マッピング学会プログラム・抄録集 18th 62 2016年 21pBL-5 脳波データからリズム間相互作用を推定する 小野島 隆之, 水原 啓暁, 青柳 富誌生 日本物理学会講演概要集 70(1) 2931-2931 2015年3月21日 脳波データにおける位相振動子ネットワークの推定, 小野島隆之, 太田絵一郎, 後藤貴宏, 水原啓暁, 青柳富誌生 電子情報通信学会技術研究報告 115(300) 11-15 2015年 音声聴取前後の脳波位相関係により促進される音声コミュニケーション (ニューロコンピューティング) 小野島 隆之, 北城 圭一, 水原 啓暁 電子情報通信学会技術研究報告 = IEICE technical report : 信学技報 113(315) 23-28 2013年11月22日 相手の非協調性に関わる脳活動により変化する報酬系領野間の情報伝達 鹿内 学, 水原 啓暁 電子情報通信学会技術研究報告. NC, ニューロコンピューティング 113(148) 23-28 2013年7月 単文の意味理解における位相ロッキングの機能的役割：EEG研究 岩渕 俊樹, 荒井 翔真, 水原 啓暁, 朝倉 暢彦, 乾 敏郎 日本認知心理学会第11回大会 2013年6月 Neural synchronization of the intra-/inter-brain for hetero systems communication Hiroaki Mizuhara Measuring Consciousness - Theory and Experiments 2013年3月  査読有り 自発脳波位相により変化する音声聴取成績 小野島 隆之, 北城 圭一, 水原 啓暁 日本認知心理学会発表論文集 2013 26-26 2013年 単文の意味的統合過程における脳波ダイナミクス (ニューロコンピューティング) 荒井翔真, 岩渕俊樹, 水原啓暁, 朝倉暢彦, 乾敏郎 電子情報通信学会技術研究報告 : 信学技報 112(345) 89-94 2012年12月 Boosting the intelligibility of vocal communication via inter-individual entrainment of neuronal oscillations Mizuhara H, Inoue S, Sasaoka T, Shikauchi M Dynamic Brain Forum 2012 2012年9月 他者の協調性によっておこる脳の報酬系の変調：ｆＭＲＩ研究 鹿内学, 水原啓暁 電子情報通信学会技術研究報告 111(483(NC2011 121-190)) 287-292 2012年3月7日 身体図式を基礎とした動的イメージ生成の脳内メカニズム（４）―身体運動に基づいた自己と物体の認識― 朝倉暢彦, 水原啓暁, 笹岡貴史, 乾敏郎 電子情報通信学会技術研究報告 111(483(NC2011 121-190)) 275-280 2012年3月7日 身体図式を基礎とした動的イメージ生成の脳内メカニズム 4 : 身体運動に基づいた自己と物体の認識 朝倉 暢彦, 水原 啓暁, 笹岡 貴史, 乾 敏郎 電子情報通信学会技術研究報告. NC, ニューロコンピューティング 111(483) 275-280 2012年3月 他者の協調性によっておこる脳の報酬系の変調 : fMRI研究 鹿内 学, 水原 啓暁 電子情報通信学会技術研究報告. NC, ニューロコンピューティング 111(483) 287-292 2012年3月 グローバルな神経協調による情報統合と機能障害 水原 啓暁 神経心理学 : Japanese journal of neuropsychology 27(2) 90-96 2011年6月25日  招待有り筆頭著者責任著者 もっとみる 書籍等出版物 2 有斐閣現代心理学辞典 (子安増生，丹野義彦，箱田裕司 監修) 水原啓暁 有斐閣 2021年2月 (ISBN: 9784641002661) よくわかる認知科学（乾敏郎・吉川左紀子・川口潤編） 水原啓暁 (担当:分担執筆, 範囲:情報の統合2（生理）) ミネルヴァ書房 2010年 講演・口頭発表等 76 視線交錯による内受容感覚の減衰：ハイパースキャン脳波実験における心拍関連電位 Miyu Nakai, Airi Kato, Yuzuki Harai, Mao Fujita, Hiroaki Mizuhara, Chihiro Yokoyama 第48回日本神経科学大会 2025年7月 視線交錯が脳波同期性に及ぼす影響およびその個体差の要因 Mao Fujita, Yuzuki Harai, Airi Kato, Miyu Nakai, Hiroaki Mizuhara, Chihiro Yokoyama 第48回日本神経科学大会 2025年7月 オキシトシン受容体遺伝子多型と脳波同期性および社交不安特性との関連 Chihiro Yokoyama, Airi Kato, Yuzuki Harai, Mao Fujita, Miyu Nakai, Hiroaki Mizuhara, Miho Murayama 第48回日本神経科学大会 2025年7月 fMRIとEEGの同時計測：ヒト脳ダイナミクスの理解をめざして 水原啓暁 第27回日本ヒト脳マッピング学会 2025年3月7日  招待有り 第二言語における語彙理解産出知識の相互作用が 理解処理に及ぼす影響：心理学的研究 アラル須本 ケンザ宝, 水原 啓暁 Neuro2022 2022年7月2日 Spatiotemporal Reconstruction Accuracies of M/EEG Inverse Solution Models Duygu Sahin, Hiroaki Mizuhara Neuro2022 2022年7月2日 Neural oscillations for the dynamic integration of spoken words Hiroaki Mizuhara, Akiyuki Kamiura, Naoyuki Sato FENS Forum 2020 2020年7月 Neural Oscillations Are a Common Mechanism to Explain Multiscale Communication within/Between the Brains Hiroaki Mizuhara NOLTA2019 2019年12月3日 The impact of predictions and sensory input on the sense of agency: Development of a new psychophysical paradigm Hiroaki Mizuhara, Peter Uhlhaas EuroCogSci2019 2019年9月2日 Language and music do and do not share the merging operations in syntax Tomomi Hida, Hiroaki Mizuhara Cognitive Neuroscience Society 25th Annual Meeting 2018年3月26日 脳情報のダイナミクス解析 水原啓暁 大阪大学 数理・データ科学アドバンストセミナー「生体情報の数理モデリングと統計解析」 2018年2月15日  招待有り Language and music use the subassembly-type as universal, but not the pot-type merging operation Tomomi Hida, Hiroaki",
  "content_length": 14579,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:28"
}