{
  "name": "Hironori Washizaki",
  "homepage": "http://www.washi.cs.waseda.ac.jp/washizaki",
  "status": "success",
  "content": "Prof. Dr. Hironori Washizaki elected IEEE Computer Society 2025 President (2024 President-Elect) | Reliable Software Engineering, Washizaki and Ubayashi Laboratory Prof. Hironori Washizaki has been voted IEEE Computer Society 2024 president-elect and 2025 president. Here are his comments on the election result. Thanks for the support and encouragement during the election. Moreover, it was my great honor to go through the election campaign with such a great, passionate opponent. Let’s unite and work together for the benefit of humanity through fostering technological innovation and excellence in computer and information processing science and technology. I am genuinely excited and have a great honor to work with IEEE Computer Society members, related people, and entities by overseeing IEEE CS programs and operations and leading future directions in the year ahead. Particularly, as stated in my position statement, I envision and will lead moving forward the following aligned with IEEE CS’s strategic goals and themes: Promoting CS membership to get more engagement, especially for students and early-career industrial/academia professionals. Expanding academia-industry-government-society collaborations across other IEEE societies and external entities. Enhancing activities that define and promote bodies of knowledge and related professional activities. Strengthening digital open science and environments. Once again, thanks for the support, and let’s work together! Publications All publications are listed here: publications (Result / 公開成果). Selected Publications include: Yuta Saito, Kazunori Sakamoto, Hironori Washizaki, “Efficient Build Dependency Verification Using eBPF and Incremental Analysis,” 48th IEEE/ACM International Conference on Software Engineering (ICSE 2026), Research Track, pp. 1-11, Rio de Janeiro, April 12-18, 2026. Yuta Saito, Kazunori Sakamoto, Hironori Washizaki, Yoshiaki Fukazawa, “Multiple Function Merging for Code Size Reduction,” ACM Transactions on Architecture and Code Optimization, Vol. 22, No. 1, pp. 1-26, 2025. Yuya Sasaki, Hironori Washizaki, Jialong Li, Nobukazu Yoshioka, Naoyasu Ubayashi, Yoshiaki Fukazawa, “Landscape and Taxonomy of Prompt Engineering Patterns in Software Engineering,” IEEE IT Professional (IT Pro), Vol. 27, pp. 41-49, 2025. Hironori Washizaki, Foutse Khomh, Yann-Gael Gueheneuc, Hironori Takeuchi, Naotake Natori, Takuo Doi, Satoshi Okuda, “Software Engineering Design Patterns for Machine Learning Applications,” IEEE Computer, Vol. 55, No. 3, pp. 30-39, 2022. Hironori Washizaki, Shinpei Ogata, Atsuo Hazeyama, Takao Okubo, Eduardo B. Fernandez, Nobukazu Yoshioka, “Landscape of Architecture and Design Patterns for IoT Systems,” IEEE Internet of Things Journal, Vol. 7, No. 10, pp.10091 – 10101, 2020 Hironori Washizaki, Yann-Gael Gueheneuc, Foutse Khomh, “ProMeTA: A Taxonomy for Program Metamodels in Program Reverse Engineering,” Empirical Software Engineering (EMSE) journal, Vol. 24, No. 3, pp. 2323-2358, 2018. Ryosuke Ishizue, Kazunori Sakamoto, Hironori Washizaki, Yoshiaki Fukazawa, “PVC: Visualizing Memory Space on Web Browsers for C Novices,” 49th ACM Technical Symposium on Computer Science Education (SIGCSE 2018), pp. 245-250, Baltimore, Maryland, USA, February 21st – 24th, 2018. Yusuke Sunaga, Hironori Washizaki, Katsuhiko Kakehi, Yoshiaki Fukazawa, Shoso Yamato, and Masashi Okubo, “Relation between Combinations of Personal Characteristic Types and Educational Effectiveness for a Controlled Project-based Learning Course,” IEEE Transactions on Emerging Topics in Computing, Vol.5, No.1, pp.69-76, 2016. Biography Hironori Washizaki is a Professor and the Associate Dean of the Research Promotion Division at Waseda University in Tokyo and a Visiting Professor at the National Institute of Informatics. He also works in the industry as Outside Director of eXmotion. He is advisor of University of Human Enviroments. IEEE activities: Hironori currently serves as President-Elect 2024 (and President 2025) of the IEEE CS to lead its activities and future directions. He has been on CS BoG since 2021. He has led professional and educational activities, including the evolution of the Guide to the Software Engineering Body of Knowledge (SWEBOK) and organizing educational courses and certifications at the CS Professional and Educational Activities Board (PEAB). He was awarded Golden Core Member, Distinguished Contributor, and Spirit of the Computer Society Award from CS. He serves as Associate Editor of IEEE Transactions on Emerging Topics in Computing (TETC), Steering Committee Member of the IEEE Conference on Software Engineering Education and Training (CSEE&T), and Advisory Committee Member of the IEEE CS flagship conference COMPSAC. He is a Senior Member of IEEE and a Professional Member of IEEE-Eta Kappa Nu. He has been the general chair and program chair of multiple IEEE conferences, including ICST, CSEE&T, and SIoT/SISA of COMPSAC. Additionally, he has been the Chair of the CS Japan Chapter. Research and Contribution: Hironori’s research interests include systems and software engineering. He received his Ph.D. in information and computer science from Waseda University in 2003. He has published more than 200 research papers in refereed international journals and conferences, including IEEE Computer, IEEE IoT-J, TETC, EMSE, SCICO, ICSE, and ASE. He has led many academia-industry joint research and large-funded projects in software design, reuse, traceability, and quality assurance. Recent achievements include IoT design patterns published in IoT-J 2020 and Machine Learning Design Patterns in Computer 2022. He is leading a professional IoT/AI education project called SmartSE. Since 2015, he has been the Convenor of ISO/IEC/JTC1/SC7/WG20 to standardize bodies of knowledge and certifications, and leading adoptions of CS products SWEBOK and Software Engineering Competency Model (SWECOM) into standards. Biographical Information: E-mail: washizaki [at] waseda.jp CV: As of 11th Mar 2024 Twitter: @Hiro_Washi Facebook: hironori.washizaki Publications: All (1999-) Waseda Researcher DB: WASHIZAKI, Hironori  (鷲崎弘宜) researchmap: Hironori Wahizaki (鷲崎弘宜) Wikipedia: 鷲崎弘宜 DBLP: Hironori Washizaki Google Scholar: Hironori Washizaki Pure, Scopus & Elsevier Fingerprint: Hironori Washizaki KAKEN: Grants-in-Aid for Scientific Research Database: Hironori Washizaki research-er.jp: 鷲崎弘宜 Current Board/organizing committee member in 2023-2025 IEEE Computer Society, President-Elect 2024 IEEE Computer Society, 1st Vice President 2023 IEEE Computer Society, Board of Governors (BoG) member 2021-2023 International Journal of Software Engineering and Knowledge Engineering, Editor (SCIE Indexed) ISO/IEC/JTC1 SC7/WG20, Convenor CSEE&T, Steering Committee Member APSEC, Steering Committee Member IEEE-Eta Kappa Nu (IEEE–HKN), Professional Member IEEE Transactions on Emerging Topics in Computing (TETC), Associate Editor COMPSAC, Advisory Committee Member Education Sciences, Editorial Board Member Software, Editorial Board member Applied Computing and Informatics, Editorial Board member Frontiers in Computer Science, Associate Editor International Journal of Software Engineering and Knowledge Engineering Research Council, Member COMPSAC/SIoT 2022-2024, Symposium Co-Chair ICSEA 2021-2023, Steering Committee Member SEKE 2010-2023, Asia Liaison 情報処理学会ソフトウエア工学研究会 IPSJ-SIGSE, 主査 2021-2024 JST CREST 信頼されるAIシステム, 領域アドバイザ 2021-2025 IEEE ICET 2021-2023 Advisory Chair IEEE CSEE&T 2023 General Chair 日本ソフトウェア科学会 論文賞選考委員 DSA 2023 General Chair ACM SPLC 2023 Publication Chair IC4E 2023 Conference Advisory Chair APSEC 2024 Education track Co-Chair IISA 2024 General Co-Chair IEEE Cybermatics Congress 2024 General Co-Chair AsianPLoP 2024 Advisory Chair IEEE ISSRE 2024 Advisory Member IEEE IST 2024 Local Organizing Committee Member ACM AIware, Steering Committee Member Sigma Xi (The Scientific Research Honor Society), Member IEEE ICST 2025 Journal-First track Co-chair AsianPLoP 2025 General Co-Chair IISA, Steering Committee Member APSEC 2025 Tutorial Co-Chair IEEE ISEMV 2025, Steering Committee Member IEEE CAI, Steering Committee Member Gisma University of Applied Sciences (Germany), MRCiS Scientific Advisory Board ACM BlockNetSys 2025 (ACM CoNEXT Workshop on Blockchain-Network Synergy), TPC Chair Asia Pacific Science and Technology Association (APSTA, Singapore), Senior Honorary Advisor 公的役職・国内活動 2015-2017 法務省 民事局戸籍システム検討ワーキンググループ 委員 2017-2019 法務省 法制審議会戸籍部会 幹事 2019 経済産業省 デジタルプラットフォーム構築事業システムガバナンスの在り方検討会　委員 2019 経済産業省 DXを促進するためのシステムガバナンスに関する有識者会議　委員 2020 経済産業省 デジタルトランスフォーメーションの加速に向けた研究会 委員、WG1 座長 2021-2023 厚生労働省 技術審査委員 2021-2022 法務省 法制審議会戸籍部会 幹事 2021-2022 経済産業省 デジタル産業への変革に向けた研究会 委員 2022 日本学術振興会 特別研究員等審査会審査員 科学研究費助成事業 審査委員 2023-2025 GTIE GAPファンド 審査委員 2023-2025 一般財団法人ソフトウェア情報センター 周知慣用技術ヒアリング調査 Recent Board/organizing committee member in the past:  IEEE CS Japan Chapter Chair, Vice-Chair, Secretary, and Treasurer. APSEC 2007 Publicity Chair, CSEE&T 2015 Publicity Chair, IEICE Trans. Info. Sys. Editor (SCIE Indexded), Heliyon Editor (Elsevier), AsianPLoP 2016 Co-Chair, AsianPLoP 2017 Local Co-Chair, ICST 2017 Co-Program Chair, SEKE2010-2022 Asia Liaison, PPAP 2016-2017 Organizer, CSEE&T 2017 PC Co-Chair, DEPEND 2016-2017 Steering Committee Member, FASSI 2016-2019 Steering Committee Member, VALID 2016-2019 Steering Committee Member, APSEC 2018 PC Co-Chair, COMPSAC 2018 Local Chair, WESPr-18 Organizer, COMPSAC/SISA 2019 PC Co-Chair, IEEE Computer Society Professional & Educational Activities Board Ad Hoc Committee Chair, IEEE Computer Society Membership at Large for the Professional and Educational Activities Board (PEAB), IEEE Computer Society SWEBOK Steering Group Member, IEEE CS Japan Chapter vice-chair, SEMAT Japan Chapter Chair, IPSJ SamurAI Coding Director, Journal of Software and Systems Special Issue on Software Engineering Education and Training Guest Editor, AsianPLoP’19 General Chair, ISEC 2019 Workshop Co-Chair, AsianPLoP 2020 ",
  "content_length": 20720,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:30"
}