{
  "name": "Hirotaka Osawa",
  "homepage": "http://hiroosa.com/biography",
  "status": "success",
  "content": "Hirotaka OSAWA's website Dr. Hirotaka Osawa is an associate professor at Keio University and a visiting associate professor at the University of Tsukuba. His research field includes human-agent interaction, the development of anthropomorphic devices, simulation using social games for social agents, and exploring humanity studies through science fiction literature. He focuses specifically on how human-like appearance and attitude enhance the interaction between users and machines, as well as examining the role of social intelligence in improving our society. Dr. Osawa earned his PhD in Engineering, a Master’s degree and a Bachelor’s degree in Computer Science from Keio University. Mail: hailabsec _ atmark_ gmail.com Roles: Leader of Keio Science Fiction Research and Development Center, 2024/1- President of Science Fiction and Fantasy Writers of Japan, 2022/10-2024/9 Associate Professor, Keio University, 2022/4- Visiting Associate Professor, University of Tsukuba, 2022/4- Exective Board Member of Science Fiction and Fantasy Writers of Japan, 2020/9- Member of Science Fiction and Fantasy Writers of Japan, 2019/4- Menter, PhD. Program in Humanics, 2018/10- Researcher, Human-technology area, AI fundamental research department, AI science center, University of Tsukuba, 2017/4- Assistant Professor, University of Tsukuba, 2013/3-2022/3 Research Associate, Keio University, 2011/4-2013/3 Researcher of Japan Science and Technology Agency, PRESTO, 2010/9- Visiting Researcher at National Institute of Informatics, 2010/4-2011/3 Visiting Researcher at Keio University, 2009/4-2011/3 Research Fellow at the Global COE program, Keio University, 2009/4-2011/3 Visiting Researcher at MIT AgeLab, 2009/9-2010/3 Researcher of Japan Society for the Promotion of Science(PD), 2009/4-2010/9 Research Assistant at the Global COE program, Keio University, 2008/4-2009/3 Researcher of Japan Society for the Promotion of Science(DC1), 2007/4-2009/3 Developer of Information Technology Promotion Agency (Exploratory Youth Project), 2006/7-2007/3 Teaching Assistant at the Keio University, 2005/4-2008/3 Academic Services: Program chair of HAI 2021 Program chair of HAI 2020 Alt.HRI chair of HRI 2020 Workshop chair of HRI 2019 Publication chair of HAI 2019 Student Design Competition chair of HRI 2018 Program chair of HAI 2016 Program chair of HAI 2015 Video chair of HRI 2015 Local chair of HAI 2014 Web Chair of HAI 2013 Local chair of HRI 2013 Program Committee of ICIRA 2011 Program Committee of JAWS 2009 to 2012 Organizer of HRI Young Pioneers Workshop 2010 (local chair) and 2011 Organizer of Human Agent Interaction Workshop in AROB 2011 Organizer of Human Agent Interaction Workshop in RO-MAN 2011 Co-chair of Social Human-Robot Interaction Session in IROS 2011 Educational Data: Doctor course student, 2007- 2009 Graduate School of Science and Technology, Keio University Course: Computer Science, School of Science for Open and Environmental Systems Master course student, 2005-2007 Graduate School of Science and Technology, Keio University Course: Computer Science, School of Science for Open and Environmental Systems Bachelor course student, 2001-2005 Faculty of Science and Technology, Keio University Course: Department of Information & Computer Science Research Skills: Programming ability in C and C++(skillful), and Java, JavaScript and Perl (able to read/write) Programming ability using: Linux/Windows/Android Programming hardware: x86/H8/SH Basic PC skills: Microsoft Office,  Internet Application knowledge of Unix and TeX/LaTeX. Application knowledge of R statistical programs (especially for the analysis of human-robot interaction). Application knowledge of drawing graph (gnuplot, Inkscape, Openoffice Draw). Efficient in English, Fluent in Japanese Hobby: Programming, Novels (Sci-Fi and Classic Chinese) Threads: @hirotaka.osawa Mastodon: @hiroosa@mastodon-japan.net SearchSearch 日本語 English 最近の投稿 Update bio Lab page update New Laboratory site update biography Publication is updated https://bsky.app/profile/hiroosa.bsky.social Tweets by hiroosa",
  "content_length": 4075,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:36"
}