{
  "name": "Hiroki Takakura",
  "homepage": "http://www.takakura.com/hiroki/index-e.html",
  "status": "success",
  "content": "Hiroki Takakura's Home Page Hiroki Takakura Japanese version is here. Information Systems Architecture Science Research Division, National Institute of Informatics 2-1-2 Hitotsubashi, Chiyoda, Tokyo, 101-8430, Japan Tel/Fax: +81-3-4212-2536 E-mail address: takakura_at_nii.ac.jp Research Topics Information Security, Network Security, Reliable Network, Next Generation Network Biography Director (4/1/2022-) Center for Strategic Cyber Resilience Research and Development, National Institute of Informatics Director (4/1/2017-30/3/2022) Center for Cybersecurity Research and Development, National Institute of Informatics Professor (4/1/2016-) National Institute of Informatics Professor (1/1/2010-3/31/2016) Nagoya University Information Technology Center Associate Professor (4/1/2002-12/31/2009) Kyoto University Academic Center for Computing and Media Studies Associate Professor (10/1/2000-3/31/2002) Kyoto University Data Processing Center, Research and Development Division Lecturer (4/1/1997-9/30/2000) Kyoto University Faculty of Engineering, Dept. of Information Science Kambayashi Labo. Research Associate (10/1/1995-3/31/1997) Nara Institute of Science and Technology Graduate School of Information Science, Department of Information Systems, Division of Database and Media Systems(Uemura Lab.) Visiting Scholar (5/28/1995/-9/31/1995) University Illinois at Urbana Champaign Department of Computer Science Researcher (4/1/1995/-9/31/1995) Kyoto University Graduate School of Engineering, Dept. of Information Science Integrated Media Environment Experimental Laboratory (Kambayashi Labo.) Ph.D Student (4/1/1992-3/31/1995) Kyoto University Graduate School of Engineering, Dept. of Information Science Integrated Media Environment Experimental Laboratory (Kambayashi Labo.) Master student (4/1/1990/-3/31/1992) Kyushu University Graduate School of Engineering, Dept. of Computer Science and Communication Engineering Iwama Labo. Bachelor Student (4/1/1986-3/31/1990) Kyushu University Faculty of Engineering, Dept. of Computer Science and Communication Engineering Kambayashi Labo. Publication Please ask Google Scholar(both English and Japanese) or ResearchGate(English only), though irrelevant papers appear in the search results...",
  "content_length": 2244,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:33"
}