{
  "name": "Hisham Cholakkal",
  "homepage": "https://mbzuai.ac.ae/study/faculty/hisham-cholakkal",
  "status": "success",
  "content": "Hisham Cholakkal - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Hisham Cholakkal Hisham Cholakkal Assistant Professor of Computer Vision Research Interests Professor Cholakkal’s research aims at developing solutions that are well-aligned with real-world applications and is focused on four areas within computer vision: visual recognition; person-centric scene understanding; learning from limited supervision; and image generation. His recent research interests include object detection; image and video segmentation; object counting; image classification; pedestrian detection; person search; human-pose estimation; human-object interaction detection; activity recognition; crowd counting; few-shot/zero-shot learning; weakly supervised learning; AI for style imitation and AI for creativity. Email Share Prior to joining MBZUAI, Professor Cholakkal worked as a research scientist at the Inception Institute of Artificial Intelligence (IIAI) in Abu Dhabi. Professor Cholakkal has diverse experiences across fundamental research, teaching, and product development at industry. He has several years of experience in leading research teams involved in commercial and fundamental research. Before joining IIAI, he was a senior technical lead in the Computer Vision and Deep Learning Research team at Mercedes-Benz R and D, India. Professor Cholakkal has also worked as a researcher at BEL-Central Research Lab, India and Advanced Digital Sciences Center, Singapore. In addition to authoring top-tier research articles and patents, he developed several computer vision frameworks that are successfully released as commercial products in various industries. Professor Cholakkal has served as a program committee member for several top conferences including CVPR, ICCV, NeurIPS, ICLR and ECCV. Ph.D. in computer science (Computer Vision) from Nanyang Technological University (NTU), Singapore. Master’s degree (M.Tech) in signal processing from the Indian Institute of Technology (IIT), India. Workshop organizer at ACCV 2022 Program committee member for top-tier conferences like CVPR, NeurIPS, ICLR, ICCV, and ECCV Reviewer for top journals like IEEE Transactions on Pattern Analysis and Machine Intelligence, IEEE Transactions on image processing, etc Received ABCD (above and beyond call of duty) Award - 2017 at Mercedes-Benz R&D. Rated as 'excellent performer' at Mercedes-Benz R and D, 2018 NTU Research Scholarship (2012-2016) GATE Scholarship (2007-2009) Publication Hisham Cholakkal Cholakkal has published papers in top scientific journals and conferences such as TPAMI, CVPR, ICCV, ECCV and AAAI. H. Cholakkal, G. Sun, S. Khan, FS. Khan, L. Shao, L.V Gool, “Towards Partial. Supervision for Generic Object Counting in Natural Scenes”, in IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2022. J. Cao, RM. Anwer, H. Cholakkal, FS. Khan, Y Pang, and L. Shao, “SipMask: Spatial Information Preservation for Fast Image and Video Instance Segmentation”, in Proceedings of the European Conference on Computer Vision (ECCV), 2020. J. Cao, Y. Pang, RM. Anwer, H. Cholakkal, J. Xie, M. Shah, FS. Khan, “PSTR: End-to-End One-Step Person Search With Transformers,” in Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2022. J. Xie, H. Cholakkal, RM. Anwer, FS. Khan, Y Pang, L. Shao, and M. Shah, “Count-and Similarity-aware R-CNN for Pedestrian Detection”, in Proceedings of the European Conference on Computer Vision (ECCV), 2020. S Narayan, H Cholakkal, M Hayat, FS Khan, MH Yang, L Shao, “D2-Net: Weakly-Supervised Action Localization via Discriminative Embeddings and Denoised Activations”, in Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV), 2021. AK Bhunia, S Khan, H Cholakkal, RM Anwer, FS Khan, M Shah, “Handwriting Transformers”, in Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV), 2021. Google Scholar Intelligent Visual Analytics Lab ResearchGate Related Thursday, November 27, 2025 Fine-grained species recognition with MAviS: a new dataset, benchmark, and model Led by MBZUAI researchers, MAviS could be valuable for environmental agencies and organizations involved in monitoring avian… natural language processing nlp llm EMNLP multimodal environment nature avian birds detection Read more Thursday, November 20, 2025 MBZUAI researchers earn high-profile honors at EMNLP Two MBZUAI papers were named Senior Area Chair Highlights at EMNLP 2025 – one of the conference’s… natural language processing research nlp conference EMNLP award multimodal environment conservation uncertainty reliable biodiversity Read more Thursday, November 13, 2025 AI Innovation Day at MBZUAI unites UAE leaders to shape the future of AI in healthcare The event welcomed more than 200 healthcare leaders and featured talks and presentations by MBZUAI faculty about… research healthcare innovation conference health AI Innovation Day on campus Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 6619,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:38"
}