{
  "name": "Hitesh Tewari",
  "homepage": "https://www.tcd.ie/research/profiles/?profile=htewari",
  "status": "success",
  "content": "Hitesh Tewari'Trinity Research - Trinity College Dublin Dr. Hitesh Tewari Assistant Professor, Computer Science hitesh.tewari@tcd.ie +353 1896 2896 people.tcd.ie/htewari Biography I lead the Applied Cryptography Research Lab (www.appliedcryptolab.com) at Trinity College Dublin from where I earned my BA (Mod), MSc and PhD degrees in Computer Science. Computer Networks, Security, Applied Cryptography Privacy and Decentralisation inform the key directions of my research, and I have published numerous conference and journal papers in these areas. During my PhD studies, I developed a strong interest in electronic payments and co-authored a book, \"Electronic Payment Systems\", which has become a reference text in this area with the two editions having sold over 7,000 copies to date. In 2013, when I came across the Bitcoin protocol, which utilises Blockchains to eliminate the central point of dependency, such as a bank, in a payment network that I began to grasp the emerging interplay of electronic payment systems and decentralised networks. Since then, my research has focussed on decentralised privacy-preserving systems and the holistic application of Blockchain protocols in several areas beyond cryptocurrencies, such as personal privacy, public health, and the environment. In 2023, I was invited to become part of the Ripple University Blockchain Research Initiative (UBRI) professorial network. In 2025, we released a Privacy Preserving eVoting platform called zkBallot (www.zkballot.com) which resolves one of the core challenges in digital elections: ensuring both voter anonymity and public auditability. Publications and Further Research Outputs Peer-Reviewed Publications Non-Peer-Reviewed Publications Peer-Reviewed Publications H. Vardhan, P. Hiranayachatri, A. Lele and H. Tewari, A Blockchain-Native PKI: Secure X.509 Certificate Management on the XRP Ledger, 1st IEEE International Conference on Distributed Ledger Technologies (IEEE ICDLT), Pune, India, 5-7 November, 2025 Conference Paper, 2025 A. Lele, V. Agarwal and H. Tewari, From Theory to Implementation of Quantum-Safe Ledgers with XRPL as a Case Study, The 7th International Conference on Blockchain Computing and Applications (BCCA), Dubrovnik, Croatia, 14-17 October, 2025, pp145 - 152 Conference Paper, 2025 DOI URL V. Agarwal, H. Vardhan, A. Kumar and H. Tewari, PoW++: An Energy Efficient Proof-of-Work Variant, The 7th International Conference on Blockchain Computing and Applications (BCCA), Dubrovnik, Croatia, 14-17 October, 2025, pp98 - 105 Conference Paper, 2025 URL DOI S. Kumari and H. Tewari, Implementation of Privacy-Preserving Identifiers for the Secure Storage of Electronic Health Records on the Ethereum Blockchain, ACM Distributed Ledger Technologies, 2025 Journal Article, 2025 DOI S. Kumari H. Dutta and H. Tewari, Securing User Identity in Web3 Social Platforms: A Post-Quantum Biometric Approach, 6th Workshop on Secure IoT, Edge and Cloud systems (SIoTEC), The 34th ACM International Conference on Information and Knowledge Management, Conference on Information and Knowledge Management (CIKM 2025), Seoul, South Korea, 10-14 November, 2025 Conference Paper, 2025 Y. Yang, J. Li, G. Xie, X. Zhang, J. Xu, T. Gao and H Tewari, Shifting Decision Boundary Against Adversarial Semantic Attacks in Latent Diffusion Models, Information Fusion, 125, (103463), 2025 Journal Article, 2025 DOI S. Chen, V. Agarwal, A. Lele and H. Tewari, CarbonChainRL - A Blockchain Oracle-Based Reinforcement Learning System for Dynamic Carbon Trading Markets, 1st IEEE International Conference on Distributed Ledger Technologies (IEEE ICDLT), Pune, India, 2025 Conference Paper, 2025 A. Lele and H. Tewari, The Zcash Protocol Explained: A Journey into Privacy-Preserving Cryptography, 1st IEEE International Conference on Distributed Ledger Technologies (IEEE ICDLT), Pune, India, 5-7 November, 2025 Conference Paper, 2025 W. Lin, A. Lele. H. Vardhan and H.Tewari, From Transparent to Confidential Transactions - Zero Knowledge Proofs on the XRP Ledger, Blockchain Kaigi 2025 (BCK25), Mumbai, India, 4-6 December, 2025 Conference Paper, 2025 S. Kumari, V. Tulshyan and H. Tewari, Cyber Security on the Edge: Efficient Enabling of Machine Learning on IoT Devices, Information, 15, (126), 2024, p28 Journal Article, 2024 DOI URL M. Clear and H. Tewari, Anonymous Homomorphic IBE with Application to Anonymous Aggregation, Cryptography, 7, (2), 2023, p1-19 Journal Article, 2023 URL DOI R. Singh, Z. Pervez and H. Tewari, Blockchain-Enabled NextGen Service Architecture for Mobile Internet Offload, Future Internet, 15, (5), 2023, p1-14 Journal Article, 2023 URL DOI P. Bradish, S. Chaudhari, M. Clear and H. Tewari, CoviChain: A Blockchain Based COVID-19 Vaccination Passport, Future of Information and Communication Conference (FICC), San Francisco, USA, 2-3 March, 2023 Conference Paper, 2023 DOI URL R. Singh, S. Sturley and H. Tewari, Blockchain-Enabled Chebyshev Polynomial-Based Group Authentication for Secure Communication in an Internet of Things Network, Future Internet, 15, (3), 2023, p1-15 Journal Article, 2023 URL DOI J. Rowland and H. Tewari, Optimized Communication in Sharded Blockchain Networks, Future of Information and Communication Conference (FICC), San Francisco, USA, 2-3 March, 2023 Conference Paper, 2023 DOI URL S. Kumari, M. Singh, R. Singh and H. Tewari, A post-quantum lattice based lightweight authentication and code-based hybrid encryption scheme for IoT devices, Computer Networks, 127, 2022 Journal Article, 2022 DOI URL M. Chun, S. Weber and H. Tewari, A Lightweight Encryption Scheme for IoT Devices in the Fog, Lecture Notes in Networks and Systems, Future Technologies Conference (FTC), Vancouver, Canada, 20-21 October, edited by K. Arai , 560, Springer, Cham, 2022, pp147 - 161 Conference Paper, 2022 DOI URL R. Singh, A. Chauhan and H. Tewari, Blockchain-Enabled End-to-End Encryption for Instant Messaging Applications, 2022 IEEE 23rd International Symposium on a World of Wireless, Mobile and Multimedia Networks (WoWMoM), Belfast, United Kingdom, 14-17 June, 2022, pp501 - 506 Conference Paper, 2022 DOI URL S. Kumari, M. Singh, R. Singh and H. Tewari, Signature based Merkle Hash Multiplication algorithm to secure the communication in IoT devices, Knowledge-Based Systems, 2022 Journal Article, 2022 URL DOI A. Banerjee and H. Tewari, Multiverse of HawkNess: A Universally-Composable MPC- based Hawk Variant, Cryptography, 6, (3), 2022, p22 Journal Article, 2022 DOI URL S. Kumari, M. Singh, R. Singh and H. Tewari, Post-quantum cryptography techniques for secure communication in resource‐constrained Internet of Things devices: A comprehensive survey, Journal of Software: Practice and Experience, 2022 Journal Article, 2022 URL DOI S. Chaudhari, M. Clear, P. Bradish and H. Tewari, Framework for a DLT Based COVID-19 Passport, Lecture Notes in Networks and Systems, Computing Conference 2021, London, UK, 15-16 July, edited by K. Arai , 285, Springer, Cham, 2021, pp108 - 123 Conference Paper, 2021 DOI URL Banerjee, Aritra and Clear, Michael and Tewari, Hitesh, ZkHawk: Practical Private Smart Contracts from MPC-based Hawk, 2021, pp245 â\" 248 Conference Paper, 2021 DOI A. Banerjee, M. Clear and H. Tewari, zkHawk: Practical Private Smart Contracts from MPC-based Hawk, 3rd Conference on Blockchain Research & Applications for Innovative Networks and Services (BRAINS), Paris, France, 27-30 September, 2021, pp245 - 248 Conference Paper, 2021 URL DOI S. Kumari, M. Singh, R. Singh and H. Tewari, To Secure the Communication in Powerful Internet of Things Using Innovative Post‑Quantum Cryptographic Method, Arabian Journal for Science and Engineering, 2021 Journal Article, 2021 URL DOI A. Banerjee, M. Clear and H. Tewari, Demystifying the Role of zk-SNARKs in Zcash, IEEE Conference on Applications, Information and Network Security, Malaysia, 17-19 November, 2020, pp12 - 19 Conference Paper, 2020 TARA - Full Text URL DOI R. Singh, A. Donegan and H. Tewari, Framework for a Decentralized Web, International Telecommunication Networks and Application Conference (ITNAC), Melbourne, Australia, November 25-27, 2020, pp1 - 7 Conference Paper, 2020 URL DOI M. Togou, T. Bi, K. Dev, K. McDonnell, A. Milenovic, H. Tewari and G. Muntean, A Distributed Blockchain-based Broker for Efficient Resource Provisioning in 5G Networks, International Wireless Communications and Mobile Computing Conference (IWCMC), Cyprus, June 15-19, 2020, pp1485 - 1490 Conference Paper, 2020 URL DOI M. Togou, T. Bi, K. Dev, K. McDonnell, A. Milenovic, H. Tewari and G. Muntean, DBNS: A Distributed Blockchain-Enabled Network Slicing Framework for 5G Networks, IEEE Communications Magazine, 2020, p90 - 96 Journal Article, 2020 DOI URL S. Sharkey and H. Tewari, Alt-PoW: An Alternative Proof-of-Work Mechanism, IEEE International Conference on Decentralized Applications and Infrastructures (DAPPCON), San Francisco, California, USA, April 5 - 8, 2019, pp11 - 18 Conference Paper, 2019 DOI URL H. Tewari, Blockchain Research Beyond Cryptocurrencies, IEEE Communications Standards Magazine, 3, (4), 2019, p21 - 25 Journal Article, 2019 URL DOI H. Vu and H. Tewari, An Efficient Peer-to-Peer Bitcoin Protocol with Probabilistic Flooding, International Conference on Emerging Technologies in Computing 2019 (iCETiC '19) , London Metropolitan University, London, UK, August 19-20, Emerging Technologies in Computing. iCETiC, 2019, pp29 - 45 Conference Paper, 2019 DOI URL S. Gourley and H. Tewari, Blockchain Backed DNSSEC, Lecture Notes in Business Information Processing, 1st Workshop on Blockchain and Smart Contract Technologies - 21st International Conference on Business Information Systems, Fraunhofer FOKUS, Berlin, July 18-20, edited by W. Abramowicz, A. Paschke , 339, Springer, Cham, 2018, pp173 - 184 Conference Paper, 2018 DOI URL TARA - Full Text M. Hanley and H. Tewari, Managing Lifetime Healthcare Data on the Blockchain, The 2018 Special Session on BlockChain and its A",
  "content_length": 32332,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:40"
}