{
  "name": "Hoda Mehrpouyan",
  "homepage": "https://www.boisestate.edu/coen-cs/people/faculty/hoda-mehrpouyan",
  "status": "success",
  "content": "Hoda Mehrpouyan, Ph.D. - Computer Science Skip to main content Hoda Mehrpouyan, Ph.D. Associate Professor CCP 252 Call: (208) 426-5766 hodamehrpouyan@boisestate.edu About Hoda Bio Education Publications Research Areas of Interest Bio Dr. Mehrpouyan’s research focuses on ensuring privacy, security, and robustness of mission-critical cyber-physical systems. In May 2019, she was awarded a National Science Foundation CAREER Award from the Secure and Trustworthy Cyberspace (SaTC) program. The proposal titled “Formal TOols foR SafEty aNd Security of Industrial Control Systems (FORENSICS)” will develop a multi-layer security framework to provide control technicians and engineers with far superior mechanisms to address the increasing risk of cybersecurity attacks on vulnerable systems. In addition, in Aug. 2016, she was awarded an NSF CISE Research Initiation Initiative (CRII) grant based on the proposal that was submitted to the Secure and Trustworthy Cyberspace (SaTC) program; Further, for her work on cybersecurity of the election process in Idaho, she has received funding from the Idaho Secretary of State and for her outreach efforts, she received fundings from the National Security Agency (NSA), GenCyber Teacher program in 2017 and 2019. Her main areas of interest are in requirement analysis and formal verification, compositional modeling and reasoning, safety and failure resilience modeling applied to complex engineering systems such as water treatment plants, smart manufacturing, automobiles, smart grid, and smart cities. To address these objectives, her research explores techniques and tools from different disciplines, i.e., model-based design from the system design community, model checking and formal verification from the software engineering community, and resilience analysis from the complex network theory. She has open Master/PhD positions available in her lab. If interested, please email her with your application package. Education Ph.D. Oregon State University, US, 2014 M.Sc. Linköpings University, Sweden, 2011 B.Tech. British Columbia Institute of Technology, Canada, 2007 Publications Hoda Mehrpouyan, Dimitra Giannakopoulou, Guillaume P. Brat, Irem Y. Tumer, Chris Hoyle, “Complex Engineered Systems Design Verification Based on Assume-Guarantee Reasoning.” Journal of the International Council on Systems Engineering (INCOSE). Sept. 2016 David Ackerman and Hoda Mehrpouyan. 2016. Modeling human behavior to anticipate insider attacks via system dynamics. In Proceedings of the Symposium on Theory of Modeling & Simulation (TMS-DEVS ’16). Society for Computer Simulation International, San Diego, CA, USA, , Article 3 , 6 pages Hoda Mehrpouyan, Brandon Haley, IremY. Tumer, Chris Hoyle, and Andy Dong, “Resiliency Analysis for Complex System Design.” Artificial Intelligence for Engineering Design, Analysis and Manufacturing. Volume 29 – Issue 01 – February 2015, pp 93-108 Copyright © Cambridge University Press 2015 Research Privacy-preserving techniques: To develop a new set of verification tools, algorithms, and interfaces that enable secure, effective and unobtrusive management of users’ private information. Requirements Engineering: To develop a suite of requirement analysis specification to translate users’ informal privacy intents into actionable, verifiable privacy rules. System–level reliability analysis for complex Cyber-Physical Systems (CPS): To develop a modeling paradigm to cope with the full complexity of CPS, so that the system behavior can be predicted accurately. Resilient Complex Engineered systems: Addresses challenges in the design, analysis, and operation of failure resistant systems by including methods from complex networks, reliability engineering, and hazard analysis. Areas of Interest Requirement analysis and formal verification, compositional modeling and reasoning, safety and failure resilience modeling applied to complex engineering systems such as aircraft, spacecraft, automobiles, smart grid, and smart cities. Computer Science computerscience@boisestate.edu (208) 426-5766 City Center Plaza (CCP), RM 364 Back To Top",
  "content_length": 4115,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:41"
}