{
  "name": "Hoda Eldardiry",
  "homepage": "http://people.cs.vt.edu/hdardiry",
  "status": "success",
  "content": "Hoda Eldardiry | Hoda Eldardiry at Virginia Tech Jump to: Navigation Dr. Hoda Eldardiry is Associate Professor at Virginia Tech Computer Science and director of the Machine Learning Laboratory. Eldardiry’s research is in robust machine learning for information extraction, forecasting, and control. Prior to joining Virginia Tech, Hoda led the machine learning research group at Xerox PARC. She obtained her doctoral degree from Purdue University Computer Science, where she also received the Early Career Distinguished Scientist Award.Eldardiry authored 85+ publications in reputable AI/ML venues including JMLR, TKDD, TIST, TBD, TKDE, AAAI, KDD, WWW, CIKM, BigData, ICONIP, PAKDD, IJCNN, EMNLP, and COLING. Hoda has served on advisory/editorial/review boards including NSF, MIT Press, TITS, AAAI, BigData, NeurIPS, DMKD, KAIS, ICML, KDD, WSDM, SDM, and technology startups. Her research is supported by total grant funding of $27,424,460 ($13,808,328 share) from VT, IARPA, DOE, NSF, DARPA, NIH-iTHRIV, CCI, EBAY, SIEMENS, ADOBE, P&G and XEROX.2024 GrantsNSFAdvancing Health Equity using Interactive Condition Assessment and MonitoringVT PI [Total $997,763], [Share $299,986]NSFExploring How AI Engineers Perceive and Develop Translational Ethical CompetencyPI [$349,360]EBAYHeterogeneous Hypergraph Modeling for Zero-Shot Product Aspect IdentificationPI [$100,000]IARPASize-Segregated Particle Odor Chromatographic KernelCo-PI [Total $8,957,534], [Share $870,087]All grants2024 PatentsMethod and System for Similarity-based Multilabel Learning H. Eldardiry and R. Rossi PATENT 11972329 GRANTEDSystem & Method using Augmented Reality for Efficient Collection of Training Data for Machine Learning M. Shreve, S. Kumar, J. Sun, G. Gavai, R. Price, and H. Eldardiry PATENT 11978243 GRANTEDComputer-Implemented System and Method for Generating Recurring Events M. Stefik, D. Bobrow, H. Eldardiry, R. Krivacic, P. Liu, S. Tarkan, and E. Wu PATENT 11934410 GRANTEDAll patents2024 Journal PublicationsA Reinforcement Learning Framework for N-ary Document-Level Relation Extraction C. Yuan, R. Rossi, A. Katz, and H. Eldardiry IEEE Transactions on Big Data Impact Factor 7.2Graph Time-Series Modeling in Deep Learning: A Survey H. Chen and H. Eldardiry ACM Transactions on Knowledge Discovery from Data (TKDD) Impact Factor 5.3Learning-based Optimal Control of Linear Time-Varying Systems over Large Time Intervals V. Reddy, A. Boker, and H. Eldardiry Systems and Control Letters Impact Factor 2.6 Acceptance Rate 25%Learning-based Pareto Optimal Control of Large-Scale Systems with Unknown Slow Dynamics S. Hesarkuchak, A. Boker, V. Reddy, L. Mili, and H. Eldardiry IEEE Control Systems Letters Impact Factor 3.1Toward a Policy Approach to Normative AI Governance: Implications for AI Ethics Education D. Kim, Q. Zhu, and H. Eldardiry IEEE Transactions on Technology and SocietyAll journal pubications2024 Conference PublicationsPrompt-based Zero-Shot Relation Extraction with Semantic Knowledge Augmentation J. Gong and H. Eldardiry ACL International Conference on Computational Linguistics, Language Resources and Evaluation (COLING-LREC) Acceptance Rate 28%Multilabel Zero-Shot Product Attribute-Value Extraction J. Gong and H. Eldardiry ACM International World Wide Web Conference (WWW) Acceptance Rate 20.2%Evolving Super Graph Neural Networks for Large-Scale Time-Series Forecasting H. Chen, R. A. Rossi, K. Mahadik, S. Kim, and H. Eldardiry ACM Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD) Acceptance Rate 15-30%Multimodal Few-Shot Relation Extraction with Hybrid Visual Evidence J. Gong and H. Eldardiry ACL International Conference on Computational Linguistics, Language Resources and Evaluation (COLING-LREC) Acceptance Rate 28%Searching for Sparse Controllers with a Budget: A Bottom-Up Approach V. Reddy, S. Gumussoy, H. Eldardiry, and A. Boker IEEE American Control Conference Acceptance Rate 59.6%Efficient Near-Optimal Control of Large-Size Second-Order Linear Time-Varying Systems V. Rustagi, V. Reddy, A. Boker, C. Sultan, and H. Eldardiry IEEE American Control Conference Acceptance Rate 59.6%Resource-Efficient Federated Training Framework for Heterogeneous and Resource-Constrained Environments H. Desai, A. Hilal, and H. Eldardiry ACSE International Conference on Parallel & Distributed Processing Techniques & ApplicationsComputer Science Student Attitudes Towards AI Ethics and Policy: A Preliminary Investigation J. Weichert and H. Eldardiry IEEE International Symposium on Technology and Society Acceptance Rate 45%Learning-based Pareto Optimal Control of Large-Scale Systems with Unknown Slow Dynamics S. Hesarkuchak, A. Boker, V. Reddy, L. Mili, and H. Eldardiry IEEE International Conference on Dynamics and Control Acceptance Rate 56.7%All conference publications2023 PreprintsGradXKG: A Universal Explain-per-Use Temporal Knowledge Graph Explainer C. Yuan and H. EldardiryData-Driven Near-Optimal Control of Nonlinear Systems over Finite Horizon V. Reddy, H. Eldardiry, and A. BokerAll preprintsRecent RecognitionHonorable Mention Best Paper Award Exploring Approaches to Artificial Intelligence Governance: From Ethics to Policy IEEE Ethics 2023Honorable Mention VT CS Women’s History Month Celebration 2023Most Cited Paper Award COVID-19 Pandemic Impacts on Traffic System Delay, Fuel Consumption and Emissions International Journal of Transportation Science and Technology 2023Honorable Mention Purdue CS Women’s History Month Celebration 2022Early Career Distinguished Scientist Award Purdue University College of Science Distinguished Alumni 2021Recent OutreachInvited TalkMachine Learning: Endless PossibilitiesNIH iTHRIV Voices in Clinical Translational Science 2024Opening KeynoteData Science: Endless PossibilitiesWomen in Data Science (WiDS) Blacksburg Conference 2022PanelistHealthcare Technology Governance+Policy Symposium on Governance of New and Emerging Technologies 2023Pursuing Undergraduate ResearchSociety of Women Engineers 2021Pursuing a Research CareerAssociation for Women in Computing 2021Pursuing Research InternshipsAssociation for Women in Computing 2020Academic ProfilesGoogle ScholarSemantic ScholarORCiDResearchGateVT ExpertsDBLPCS AuthorsScopusInternet ArchiveSci ValACMIEEEACL AnthologyLinkedIn Templates (for web app):",
  "content_length": 6303,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:43"
}