{
  "name": "Hogun Park",
  "homepage": "https://learndatalab.github.io",
  "status": "success",
  "content": "LearnData Lab - Home Toggle navigation LearnData Lab @ SKKU Home Team Opening Publications Welcome to the LearnData Lab Machine Learning and Data Mining Research lab at SKKU We are a dynamic research group at Sungkyunkwan University (SKKU). Our mission is to advance the fields of machine learning, data mining, trustworthy AI, and natural language processing through both theoretical and applied research. Research Areas 1. Machine Learning & Data Mining for Interconnected Data We develop models designed to handle complex, interconnected data sources such as human interactions, knowledge graphs, ontologies, educational logs, multi-modal graphs, and multi-sensor data. 2. Explainable and Trustworthy AI Our research emphasizes building AI systems that are both interpretable and reliable, with a focus on deep learning models. Our work spans post-hoc explainers, mechanistic interpretability, knowledge-enhanced LLMs, knowledge editing, neural watermarking techniques, and both logical and symbolic reasoning. Previous Next We are looking for passionate new PhD students (or MS/PhD integrated program students) and Postdocs to join the team. (more info) ! Open positions are available for PhD students and Postdoctoral researchers in the Artificial Intelligence and AI System Departments. No opening for MS students for now. We are grateful for funding from the National Research Foundation of Korea (NRF), BK21, Information & Communications Technology Planning & Evaluation (IITP), National IT Industry Promotion Agency (NIPA), Korea Creative Content Agency (KOCCA), LG Electronics, Samsung Research, NCSOFT, and NAVER. News Aug. 2025 A paper has been accepted to the CIKM 2025. Congratulations, Minku! July 2025 I gave a talk titled Providing Explanations for Unsupervised Graph Learning Models at the University of British Columbia. May. 2025 A paper has been accepted to the ACL 2025. Congratulations, Hongjun, Minji,and Heesoo! May. 2025 A paper has been accepted to the KDD 2025. Congratulations, Heesoo, Chanyong, and Geonhee! May. 2025 A paper has been accepted to the ICML 2025. Congratulations, Woohyun! Feb. 2025 A paper has been accepted to the PAKDD 2025. Congratulations, Hongjun, Heesoo, Gayeong, and Juann! Jan. 2025 A paper has been accepted to the NAACL 2025. Congratulations, Jiwon! Jan. 2025 A paper has been accepted to the WWW 2025. Congratulations, Heesoo! Dec. 2024 Two papers have been accepted to the AAAI 2025. Congratulations, Sangho, Hyunju, and Geonhee! ... see all News Site made with Jekyll using the theme of the Allan Lab. Contact: 2066, Seobu-ro, Jangan-gu Office 27310A, Engineering Building 2 Suwon, Republic of Korea,16419 (Maps(Google) and Maps(Naver))",
  "content_length": 2695,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:40"
}