{
  "name": "Hojin Jang",
  "homepage": "https://bmcl.korea.ac.kr/author/hojin-jang",
  "status": "success",
  "content": "Hojin Jang | Brain and Machine Cognition LabSearchHojin JangAssistant ProfessorKorea UniversityAt the center of my academic journey has been a deep curiosity to puzzle out the intricate algorithms that underpin human visual perception and cognition. In this pursuit, I leverage a combination of behavioral and psychophysical experiments, neuroimaging techniques, and state-of-the-art computational modeling. Particularly, as we enter an era where AI systems become increasingly integrated into our daily lives, I see a compelling opportunity to investigate the fundamental principles of cognitive neuroscience through the lens of comparing human and machine cognition.I should acknowledge that my academic progress has been greatly influenced by the guidance of Prof. Jong-Hwan Lee, Prof. Frank Tong, Dr. Xavier Boix, and Prof. Pawan Sinha. Their mentorship has not only enriched my understanding of engineering and neuroscience but has also set a solid foundation for my research. Those interested in their contributions to science are encouraged to visit their websites.Our lab encourages an environment where making mistakes is part of the learning process, unique ideas are welcome, and a sense of commitment and curiosity is encouraged. We believe in creating a supportive and collaborative atmosphere that allows every member to grow and contribute in their own way.Education and Employment2024 - Present, Assistant ProfessorBrain and Cognitive Engineering, Korea University2024 - Present, Research AffiliateBrain and Cognitive Sciences, MIT2022 - 2024, Postdoctoral ResearcherBrain and Cognitive Sciences, MIT2021 - 2022, Postdoctoral ResearcherCognitive Psychology, Vanderbilt University2016 - 2021, Ph.D.Cognitive Psychology, Vanderbilt University2014 - 2016, M.Eng.Brain and Cognitive Engineering, Korea University2008 - 2014, B.Sc.Computer Science, Korea UniversityInterestsVision ScienceComputational Cognitive NeuroscienceDeep Learning and Machine CognitionBrain Encoding and DecodingLatestConfigural processing as an optimized strategy for robust object recognition in neural networksImproved modeling of human vision by incorporating robustness to blur in convolutional neural networksRobustness to Transformations Across Categories: Is Robustness Driven by Invariant Neural Representations?Noise-trained deep neural networks effectively predict human vision and its neural responses to challenging imagesConvolutional neural networks trained with a developmental sequence of blurry to clear images reveal core differences between face and object processingNoise-robust neural networks and methods thereofTest–retest reliability of spatial patterns from resting-state functional MRI using the restricted Boltzmann machine and hierarchically organized spatial patterns from the deep belief networkDeveloping predictive imaging biomarkers using whole-brain classifiers: Application to the ABIDE I datasetTask-specific feature extraction and classification of fMRI volumes using a deep neural network initialized with a deep belief network: Evaluation using sensorimotor tasksCite × Copy Download",
  "content_length": 3108,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:42"
}