{
  "name": "Hokeun Kim",
  "homepage": "https://search.asu.edu/profile/4842939",
  "status": "success",
  "content": "Hokeun Kim | ASU Search Hokeun Kim Assistant Professor, School of Computing and Augmented Intelligence [email protected] 660 S. Mill Ave CTRPT 202-03A Tempe, AZ 85281 Mail code: 8809 Campus: Tempe ‌ Long Bio Hokeun Kim is an assistant professor in the School of Computing and Augmented Intelligence in the Ira A. Fulton Schools of Engineering. He studies cyber-physical systems, computing systems interacting with humans and the physical world, especially safety and security aspects. His research interests include software and hardware support for time-sensitive, Internet-connected, and intelligent cyber-physical systems. He won the ACM/IEEE Best Paper Award and received an IEEE Micro Top Picks Honorable Mention for his research contributions to Internet of Things and computer architecture research. Education Ph.D. Electrical Engineering and Computer Sciences, University of California, Berkeley 2017 M.S. Electrical Engineering and Computer Science, Seoul National University 2012 B.S. Computer Science and Engineering, Seoul National University 2010 Research Website URL https://labs.engineering.asu.edu/kim/ Google Scholar URL https://scholar.google.com/citations?user=isH8pZoAAAAJ ORCID Profile ID https://orcid.org/0000-0003-1450-5248 Courses 2026 Spring Course Number Course Title CSE 420 Computer Architecture I CEN 790 Reading and Conference CEN 792 Research CEN 799 Dissertation CSE 593 Applied Project CSE 598 Special Topics 2025 Fall Course Number Course Title CSE 792 Research CSE 799 Dissertation CSE 790 Reading and Conference CEN 792 Research CEN 790 Reading and Conference CEN 799 Dissertation CSE 599 Thesis CSE 522 Real-Time Embedded Systems CSE 593 Applied Project 2025 Spring Course Number Course Title CSE 420 Computer Architecture I CSE 599 Thesis CSE 792 Research CEN 790 Reading and Conference CEN 792 Research CSE 593 Applied Project 2024 Fall Course Number Course Title CSE 493 Honors Thesis CSE 792 Research CEN 792 Research CEN 599 Thesis CEN 790 Reading and Conference CEN 590 Reading and Conference CSE 522 Real-Time Embedded Systems 2024 Summer Course Number Course Title CEN 792 Research 2024 Spring Course Number Course Title CSE 420 Computer Architecture I CSE 792 Research CSE 790 Reading and Conference CEN 790 Reading and Conference CSE 792 Research CEN 792 Research CEN 590 Reading and Conference CSE 520 Computer Architecture II CSE 492 Honors Directed Study 2023 Fall Course Number Course Title CSE 792 Research CEN 580 Practicum CSE 522 Real-Time Embedded Systems CEN 599 Thesis Honors / Awards Best Paper Award, In the 27th Forum on specification and Design Languages (FDL 2024). Stockholm, Sweden, September 2024 Honorable Mention, In the IEEE Micro Top Picks from the 2016 Computer Architecture Conferences, June 2017 Best Paper Award, In the 2nd ACM/IEEE International Conference on Internet-of-Things Design and Implementation (IoTDI) 2017, Pittsburgh, PA, April 2017 Outstanding Graduate Student Instructor Award, The Graduate Division and The Graduate Council Advisory Committee for GSI Affairs, University of California, Berkeley, May 2014 Industry Positions 09/2018 - 08/2021 Senior Software Engineer, Google, Mountain View / Sunnyvale, CA 09/2017 - 09/2018 Software Engineer, LinkedIn, Sunnyvale, CA 05/2015 - 12/2016 Research Associate, HP Labs, Palo Alto, CA Expertise Areas Modeling and Simulation Network Security Computer Architecture and Design Cyberphysical and Embedded Systems",
  "content_length": 3444,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:42"
}