{
  "name": "Holden Lee",
  "homepage": "https://holdenlee.github.io",
  "status": "success",
  "content": "index Holden's Website Basic Info Map Holden Lee Applied Mathematics and Statistics Department Johns Hopkins University hlee283@jhu.edu I am an assistant professor in applied mathematics and statistics at Johns Hopkins University. My research is in machine learning and applied probability. Check out my research and blog. My CV is here. Timeline: 2020-2022: Phillips Griffiths Research Assistant Professor in mathematics at Duke, supervised by Jianfeng Lu and Rong Ge. Fall 2021: I was a fellow at the Simons Institute at UC Berkeley. 2019: I received my Ph.D. from Princeton, where I was advised by Sanjeev Arora. Teaching: Fall 2022 (JHU): EN.553.720 Probability Theory I. Spring 2022 (Duke): Math 340 (Advanced Introduction to Probability). Spring 2021: Math 230 (Probability). Spring 2020: Math 361S (Numerical Analysis) Basic Info Education: Princeton University, Ph.D. in Math, 2019 University of Cambridge, MAST in Pure Math, 2014 Massachusetts Institute of Technology, B. Sc. Math, 2013 I like math and writing, and I care deeply about education. To me, math and writing have a lot in common: they both call on us to be precise, and to ask and answer the “why” questions in the world. Neither of them require much more than pencil and paper, but that’s enough to make beautiful things. I’m fascinated by human and artificial intelligence. To me, the quest for AI is not just a mathematical and technological endeavor, but also a deeply introspective one. Map To find about about my work, check out my Research, Math notes, and My teaching. Check out math notes. Contributions to improve the notes are welcome, no matter how little. Also under math I’ve included some general advice for learning math and putting it in perspective (see Advice for a mathlete). Browse my fiction in Creations. I welcome all comments (and conversations even more). I’m always looking for people to share things with so feel free to drop me a line on anything you’ve written, too. To find out about me as a person or learn my views on a variety of topics then check out my articles in Views. To see what’s new, read my blog at http://holdenlee.github.io/blog. A tree of all articles is available on the sitemap. You can also navigate using the Tags, Parent, and Children links. More information about the website is in About. Built with Hakyll using Bootstrap, Disqus, Footnotes.js, Highlight.js, MathJax, and ShareThis.",
  "content_length": 2408,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:42"
}