{
  "name": "Holger Blume",
  "homepage": "https://www.ims.uni-hannover.de/blume.html?&no_cache=1",
  "status": "success",
  "content": "Prof. Dr.-Ing. Holger Blume – Institut für Mikroelektronische Systeme – Leibniz Universität Hannover Holger Blume – Institut für Mikroelektronische Systeme – Leibniz Universität Hannover Fakultät Fakultät für Elektrotechnik und Informatik English Start Kontakt English Institut für Mikroelektronische Systeme Institut Holger Blume Prof. Dr.-Ing. Holger Blume Prof. Dr.-Ing. Holger Blume Telefon +49 511 762 19640 E-Mail holger.blumeims.uni-hannover.de Adresse Appelstr. 4 30167 Hannover Prof. Dr.-Ing. Holger Blume Telefon +49 511 762 19640 E-Mail holger.blumeims.uni-hannover.de Adresse Appelstr. 4 30167 Hannover Berufliche Laufbahn Holger Blume, Jahrgang 1967, studierte von 1987 bis 1992 Elektrotechnik an der Universität Dortmund. Während seines Studiums war er Stipendiat der Studienstiftung des deutschen Volkes. Von 1993 bis 1996 war er wissenschaftlicher Mitarbeiter in der Arbeitsgruppe Schaltungen für die Informationsverarbeitung an der Universität Dortmund (Prof. Dr. H. Schröder). Von 1996-1998 war er als wissenschaftlicher Mitarbeiter am Informatik Centrum Dortmund (ICD) angestellt. Im Jahre 1997 promovierte er an der Universität Dortmund mit Auszeichnung zum Thema \"Nichtlineare fehlertolerante Interpolation von Zwischenbildern\". Von 1998 bis 2008 war er zuerst als Oberingenieur und später als Akademischer Oberrat am Lehrstuhl für Allgemeine Elektrotechnik und Datenverarbeitungssysteme der RWTH Aachen (Prof. Dr. T. G. Noll) tätig. Im Februar 2008 habilitierte er dort mit einer Arbeit zum Thema \"Exploration des Entwurfsraumes für heterogene Architekturen zur digitalen Videosignalverarbeitung\". Im Juli 2008 folgte er einem Ruf an die Leibniz Universität Hannover wo er seit dem als Professor für \"Architekturen und Systeme\" und als geschäftsführender Leiter des Instituts für Mikroelektronische Systeme (IMS) tätig ist. Publikationsliste Suchen 1 2 3 4 5 6 7 8 9 Last Zeige Ergebnisse 1 - 20 von 382 A Serial Transparent AXI Bridge for Cross-Chip Integration. / Fiedler, Till; Marten, Jakob; Langhorst, Dominik et al. 2025 23rd IEEE Interregional NEWCAS Conference (NEWCAS). 2025. S. 480-484.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Mehr... A Novel Chaining-Based Indirect Addressing Mode in a Vertical Vector Processor. / Gesper, Sven; Köhler, Daniel; Thieu, Gia Bao et al. Embedded Computer Systems: Architectures, Modeling, and Simulation - 24th International Conference, SAMOS 2024, Proceedings. Hrsg. / Luigi Carro; Francesco Regazzoni; Christian Pilato. Springer Science and Business Media Deutschland GmbH, 2025. S. 167-182 (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); Band 15226 LNCS).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Mehr... High Performance RISC-V Processor for Application in Harsh Environments. / Hawich, Malte; Rücker, Malte; Stuckenberg, Tobias et al. 2025. 1-2 Beitrag in RISC-V Summit 2025 Europe, Paris, Frankreich.Publikation: Konferenzbeitrag › Paper › Forschung › Peer-Review Mehr... A Practical Survey on Static Task Scheduling Optimization Approaches for Heterogeneous Architectures. / Hollmann, Jonas; Lüders, Matthias; Arndt, Jakob et al. Euro-Par 2024: Parallel Processing Workshops - Euro-Par 2024 International Workshops, Proceedings. Hrsg. / Silvina Caino-Lores; Demetris Zeinalipour; Thaleia Dimitra Doudali; David E. Singh; Gracia Ester Martín Garzón; Leonel Sousa; Diego Andrade; Tommaso Cucinotta; Donato D'Ambrosio; Patrick Diehl; Manuel F. Dolz; Admela Jukan; Raffaele Montella; Matteo Nardelli; Marta Garcia-Gasulla; Sarah Neuwirth. Band Conference proceedings 2025. S. 425–437 (Lecture Notes in Computer Science; Band 15385 LNCS).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Beitrag in Buch/Sammelwerk › Forschung › Peer-Review Mehr... SmartHeaP- A High-level Programmable and Customized Hearing Aid System on Chip Integrated in a Research Hearing Aid Prototype. / Karrenbauer, Jens; Schonewald, Sven; Klein, Simon et al. in: IEEE Transactions on Biomedical Circuits and Systems, Jahrgang 19, Nr. 3, 06.2025, S. 669-685.Publikation: Beitrag in Fachzeitschrift › Artikel › Forschung › Peer-Review Mehr... Noise Reduction in Hearing-Aid Processors: Traditional Methods vs. Neural Networks. / Klein, Simon; Rossol, Lando; Venema, Finn et al. Proceedings - 2025 IEEE 36th International Conference on Application-Specific Systems, Architectures and Processors, ASAP 2025. Institute of Electrical and Electronics Engineers Inc., 2025. S. 172-173 (Proceedings of the International Conference on Application-Specific Systems, Architectures and Processors).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Mehr... Radar Object Detection on a Vector Processor Using Sparse Convolutional Neural Networks. / Köhler, Daniel; Meinl, Frank; Blume, Holger. Embedded Computer Systems: Architectures, Modeling, and Simulation - 24th International Conference, SAMOS 2024, Proceedings. Hrsg. / Luigi Carro; Francesco Regazzoni; Christian Pilato. Springer Science and Business Media Deutschland GmbH, 2025. S. 138-154 (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); Band 15226 LNCS).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Mehr... Hardware und Software vereint: Innovation durch Co-Design. / Lüders, Matthias; Weddige, Sousa; Blume, Holger Christoph. in: ti! Technologie-Informationen, 03.04.2025.Publikation: Beitrag in Fachzeitschrift › Artikel › Transfer Mehr... ZuSE-KI-Mobil: AI Chip Design Platform for Automotive and Industrial Applications. / Mojumder, Shaown; Friedrich, Simon; Matúš, Emil et al. in: IEEE Transactions on Very Large Scale Integration (VLSI) Systems, Jahrgang 33, Nr. 11, 31.10.2025, S. 2961-2974.Publikation: Beitrag in Fachzeitschrift › Artikel › Forschung › Peer-Review Mehr... Fiber deviation and optimized toolpath strategies in melt electrowriting of tubular scaffolds. / Neuhaus, Benno; Loewner, Sebastian; Heymann, Henrik et al. in: Materials & Design, Jahrgang 254, 114147, 06.2025.Publikation: Beitrag in Fachzeitschrift › Artikel › Forschung › Peer-Review Mehr... RRNS Arith Lib – An Open-Source Redundant Residue Number System Arithmetic VHDL Library. / Oberschulte, Tim; Sievers, Enno; Blume, Holger. 2025. 49 Postersitzung präsentiert bei 2025 ACM/SIGDA International Symposium on Field Programmable Gate Arrays, Monterey, California, USA / Vereinigte Staaten.Publikation: Konferenzbeitrag › Poster › Forschung › Peer-Review Mehr... Optimizing the Semantic Segmentation CNN SalsaNext on a Vertical Vector Processor. / Renke, Oliver; Blume, Holger. AICAS 2025 - 2025 7th IEEE International Conference on Artificial Intelligence Circuits and Systems, Proceedings. Institute of Electrical and Electronics Engineers Inc., 2025. (IEEE International Conference on Artificial Intelligence Circuits and Systems, Proceedings).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Mehr... A Hardware/Operating System Co-Design Approach for Energy Optimization in Harsh Environments. / Rumpeltin, Nico; Thomas, Tim-Marek; Rücker, Malte et al. A Hardware/Operating System Co-Design Approach for Energy Optimization in Harsh Environments. 2025.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Mehr... Modified Parabolic Synthesis for Hardware-Oriented Approximation of Unary Functions. / Schneider, Viktor J.; Schönewald, Sven Johannes; Blume, Holger Christoph. ISCAS 2025 - IEEE International Symposium on Circuits and Systems, Proceedings. 2025. (Proceedings - IEEE International Symposium on Circuits and Systems).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Mehr... Towards real-time LiDAR processing on RISC-V-based ASIPs: fast trigonometric approximations via parabolic synthesis. / Schneider, Viktor J.; Schönewald, Sven; Blume, Holger. Real-time Processing of Image, Depth, and Video Information 2025. Hrsg. / Gian Domenico Licciardo; Matthias F. Carlsohn; Viktor J. Schneider. 2025. 1352603 (Proceedings of SPIE - The International Society for Optical Engineering; Band 13526).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung Mehr... An Intelligent and Efficient Workflow for Path-Oriented 3D Bioprinting of Tubular Scaffolds. / Baroth, Timo; Loewner, Sebastian; Heymann, Henrik et al. in: 3D Printing and Additive Manufacturing, Jahrgang 11, Nr. 1, 15.02.2024, S. 323-332.Publikation: Beitrag in Fachzeitschrift › Artikel › Forschung › Peer-Review Mehr... Blue Light-Induced, Dosed Protein Expression of Active BDNF in Human Cells Using the Optogenetic CRY2/CIB System. / Christoffers, Sina; Wichert, Nina; Wiebe, Elena et al. in: Biotechnology journal, Jahrgang 19, Nr. 12, e202400384, 26.12.2024.Publikation: Beitrag in Fachzeitschrift › Artikel › Forschung › Peer-Review Mehr... Enhancing RISC-V Processor Performance in Harsh Environments through Data Cache Optimization. / Frühauf, Jan-Luca; Hawich, Malte; Blume, Holger Christoph. 2024 Panhellenic Conference on Electronics & Telecommunications (PACET). IEEE, 2024. S. 1-4 (Panhellenic Conference on Electronics & Telecommunications (PACET)).Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konferenzband › Aufsatz in Konferenzband › Forschung › Peer-Review Mehr... High Temperature In-Order RISC-V Processor with Heterogeneous Pipeline and Out-of-Order Write-Back Mechanism. / Hawich, Malte; Blume, Holger Christoph; Szücs, Jan. 2024 Kleinheubach Conference. 2024. S. 1-4.Publikation: Beitrag in Buch/Bericht/Sammelwerk/Konfe",
  "content_length": 49648,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:47"
}