{
  "name": "Homayoun Valafar",
  "homepage": "http://www.cse.sc.edu/~homayoun",
  "status": "success",
  "content": "Welcome to Homayoun Valafar's home page CSE Home Page CSE Research CSE Site Map CSE Faculty Education Biography Research Research Web Site Teaching Publications Resume Projects USC THIS SITE Computer Science & Engineering 301 South Main Street Columbia, SC 29208 Info: (803) 777 - 7979 Fax: (803) 777 - 3767 Homayoun Valafar Associate Professor Department of Computer Science and Engineering University of South Carolina Columbia, SC 29208 3A49 Swearingen Engineering Center homayoun@cec.sc.edu 803-777-2404(voice) 803-777-3767(fax) Office hours: 10-11 M-F Welcome to Homayoun Valafar's home page Education Ph.D.: Electrical and Computer Engineering, Purdue, 1995 M.S.: Electrical and Computer Engineering, Purdue, 1990 B.S.: Electrical and Computer Engineering, Michigan Tech., 1988 Biography I am a Professor in the Department of Computer Science and Engineering at the University of South Carolina. I also serve as the director for the Bioinformatics core of the INBRE Project. My principal research interests are the implementation of mathematical, statistical and engineering techniques in the area of computational biology, bioinformatics, and medical informatics.  A  more specific area of my actively funded research is the problem of protein folding, protein/ligand and protein/protein interaction. Research Computational Biology Bioinformatics and Medical informatics Computational Medicine Artificial Intelligence Optimization Parallel algorithms and architectures Teaching Experience CSCE 240: Introduction to Software Engineering (Fall 2010, Spring 2011) CSCE 769: Computational Structural Biology (Spring 2009, 2010) CSCE 245: Object-Oriented Programming Techniques (Spring 05, 06, 07, 08, 09) BMEN 321: Biomedical Circuits Analysis (Fall 2009) CSCE 206: Scientific Applications Programming (Fall 2008) CSCE 790R: Structural / Protein Bioinformatic (Fall 2005, 2006, 2007) CSCE 590F: Topics in Bioinformatics and Medical informatics (Fall 2004) Selected Publications Shealy P, Simin M, Park SH, Opella SJ, Valafar H, Simultaneous structure and dynamics of a membrane protein using REDCRAFT: Membrane-bound form of Pf1 coat protein, J Magn Reson. 2010 Nov;207(1):8-16. Epub 2010 Jul 30, PMID: 20829084 Park SH, Son WS, Mukhopadhyay R, Valafar H, Opella SJ., Phage-Induced Alignment of Membrane Proteins Enables the Measurement and Structural Analysis of Residual Dipolar Couplings with Dipolar Waves and lambda-Maps, J Am Chem Soc. 2009 Oct 14;131(40):14140-1 Mukhopadhyay R, Miao X, Shealy P, Valafar H, Efficient and accurate estimation of relative order tensors from λ-maps, J Magn Reson. 2009 Jun;198(2):236-47. Epub 2009 Mar 5. PMID: 19345125 Bryson M, Tian F, Prestegard JH, Valafar H, REDCRAFT: A tool for simultaneous characterization of protein backbone structure and motion from RDC data. J Magn Reson. 2008 Apr;191(2):322-34, PMC2728087 Miao X, Mukhopadhyay R, Valafar H, Estimation of relative order tensors, and reconstruction of vectors in space using unassigned RDC data and its application, J Magn Reson. 2008 Oct;194(2):202-11, PMC2669903 Miao X, Waddell PJ, Valafar H, TALI: local alignment of protein structures using backbone torsion angles, J Bioinform Comput Biol. 2008 Feb;6(1):163-81. Prestegard JH, Mayer KL, Valafar H, Benison GC., Determination of protein backbone structures from residual dipolar couplings, Methods Enzymol. 2005;394:175-209, PMC1808351 Valafar H, Mayer KL, Bougault CM, LeBlond PD, Jenney FE Jr, Brereton PS, Adams MW, Prestegard JH, Backbone solution structures of proteins using residual dipolar couplings: application to a novel structural genomics target, J Struct Funct Genomics. 2004;5(4):241-54, PMC1815388 H. Valafar, Prestegard J.H., REDCAT: A Residual Dipolar Coupling Analysis Tool. Journal of Magnetic Resonance 167 (2004) 228-241 Fang T, Valafar H., and Prestegard J., A Dipolar Coupling Based Strategy for Simultaneous Resonance Assignment and Structure Determination of Protein Backbones, Journal of the American Chemical Society; 2001 Al-Hashimi HM, Valafar H, et al., Variation of molecular alignment as a means of resolving orientational ambiguities in protein structures from dipolar couplings. J MAGN RESON 143: (2) 402-406 APR 2000. Complete list of publications Complete Curriculum Vita PDF Projecs REDCAT REDCRAFT TALI/msTALI 2D-RDC nD-RDC PDPA RETURN TO TOP USC LINKS: DIRECTORY MAP EVENTS VIP SITE INFORMATION Swearingen Engineering Center • Columbia, SC 29208 • 803-777-7979 • info@cse.sc.edu © University of South Carolina Board of Trustees",
  "content_length": 4526,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:46"
}