{
  "name": "Hongfeng Yu 0001",
  "homepage": "http://vis.unl.edu/~yu",
  "status": "success",
  "content": "Hongfeng Yu | University of Nebraska-Lincoln JavaScript is required for displaying the page correctly. I am a Professor in School of Computing and Director of Holland Computing Center at the University of Nebraska-Lincoln. I received my B.S. degree and M.S. degree in Computer Science from Zhejiang University, and Ph.D. degree in Computer Science from the University of California-Davis. After my Ph.D. graduation, I spent four years as a postdoctoral researcher at Sandia National Laboratories, California. My research concentrates on scalable data analysis and visualization, high-performance computing, and user interfaces and interaction. Highlights 1 2 • Congratulations, Dr. Jianxin Sun! (04/29/2024). • Our visualization lab participated in Lincoln's 2023 Hour of Code & Tech Fair event at Nebraska Innovation Campus, which had 570 people register for the event and checked in 600 attendees (12/02/2023). \"Kids try out coding, virtual reality, robotics and more at Lincoln tech fair\" \"Kids have hands-on learning at Lincoln's annual tech fair\" • Girls Code Lincoln visited our visualization lab, and girls had hands-on activities on interactive visualization. (11/12/2023) • Yu Shi successfully defended his Master thesis on CT Image Synthsis. (07/25/2023) • We had a booth at the Woman in Science conference. (03/31/2023) • We had an opportunity to join the first in-person Hour of Code event in over two years and resume our visualization demonstrations for our Nebraska kids. (12/03/2022) \"Hour of Code returns to in-person event\" • We met with the Lincoln Public Schools (LPS) Science Connector at Science Connector. (08/10/2022) • Congratulations, Dr. Tiao Gao! (04/22/2022). • Congratulations, Dr. Yu Pan! (08/05/2021). • Several team members get summer internships: Ian - NASA, Jianxin - Argonne National Laboratory, Shawn - ThredUp (04/29/2021). • Suresh Thapa successfully defended his Master project (10/23/2020). • Congratulations, Dr. Feiyu Zhu! (07/23/2020). • We demonstrated visualization to Nebraska girls in grades 3-12 at the third annual Introduce a Girl to Engineering day. The event was supported by multiple sponsors, including Lincoln Children's Museum, UNL College of Engineering, and so on (01/25/2020). • Our lab participated in Hour of Code 2019 with our visualization demonstrations (12/07/2019). • Saeideh Samani successfully defended her Master thesis on uncertainty visualization for nitrogen leaching (12/02/2019). • Our lab participated in Nebraska State FFA Convention Tours for visualization demos and presentations to future farmers of America (04/03/2019). • Jin Wang successfully defended his Master thesis on learning-based data prefetching (11/18/2019). • Ebrahim successfully defended his Master project on GPU-based point cloud processing (07/26/2019). • Yves successfully defended his Master thesis on distributed edge bundling (07/23/2019). • Li successfully defended her Master thesis on eye tracking data visualization (05/24/2019). • Congratulations, Dr. Jieting Wu! (12/14/2018). • Jianxin have been awarded UNL Chancellor's Fellowship! (10/09/2018). • We had an interactive scientific visualization booth at Hour of Code 2018, an annual event co-hosted by University of Nebraska-Lincoln (UNL) and Lincoln Public Schools (LPS) for promoting interdisciplinary computer technology. There were 980 people registered for this event, including 459 adults and 521 students (most K-12 students).(12/08/2018) 1011 Now. \"Hour of Code event draws hundreds\" Lincoln Journal Star. Annual Hour of Code event hosts more than 800 at Innovation Campus The Daily Nebraskan. UNL, LPS to co-host Hour of Code event, promote computing in all disciplines • Chunxiao successfully defended her Master project (07/19/2018). • Hongfeng Attended Dagstuhl Seminar on In Situ Visualization for Computational Science, July, 2018 (07/1-6/2018). • Saeideh gained Computing Research Association of Women in Computing (CRA-W) conference scholarship, San Fransisco, CA, April 2018! • Babak successfully defended his Master project (04/11/2018). • Congratulations, Dr. Lina Yu and Dr. Jianping Zeng! (12/15/2017). • Shi successfully defended his Master thesis (04/18/2017). • Saeideh received Computing Research Association of Women in Computing (CRA-W) conference scholarship, Washington, DC, April 2017! • Mohsen successfully defended his Master project (04/11/2017). • Lina won Graduate Student Conference Travel Grant from UNL College of Engineering (12/13/2016). • Jianping passed the Ph.D. comprehensive exam (12/10/2016). • Lina passed the Ph.D. comprehensive exam (11/30/2016). • American Scientist. \"A Computed Flame: To understand how fuel burns in a diesel engine takes chemistry knowledge and supercomputing muscle.\" • Our Tweether work has been reported by Science Node. • Yanfu successfully defended his Master thesis (07/15/2016). • Feiyu passed the Ph.D. qualifying exam in Spring 2016. • Jieting passed the Ph.D. qualifying exam in Fall 2015. • Jianping's paper \"Parallel Modularity-based Community Detection on Large-scale Graphs\" has been selected as one of four Best Paper Candidates at IEEE Cluster 2015. • Jianping won NSF Travel Award (07/08/2015). • Jianping won Graduate Student Conference Travel Grant from UNL College of Engineering (06/11/2015). • Jieting successfully defended his Master thesis (04/14/2015). • Shruti successfully defended her Master project (04/10/2015). • Jianping passed the Ph.D. qualifying exam in Fall 2013. • Lina passed the Ph.D. qualifying exam in Fall 2013. • Hongfeng was selected to participate in the 2013 UNL Research Development Fellows Program.",
  "content_length": 5627,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:54"
}