{
  "name": "Hongkai Xiong",
  "homepage": "https://min.sjtu.edu.cn/En/FacultyShow/4?Vid=14",
  "status": "success",
  "content": "MIN JC登陆 Home Research Laboratory research direction Signal Processing Computer Vision Machine Learning Multimedia Communication Interdisciplinary Research Projects Fundings DemoCV DemoLF Courses Publications 2025 Journal Articles Conference Papers 2024 Journal Articles Conference Papers 2023 Journal Articles Conference Papers 2022 Journal Articles Conference Papers 2021 Journal Articles Conference Papers 2020 Journal Articles Conference Papers 2019 Journal Articles Conference Papers 2018 Journal Articles Conference Papers 2017 Journal Articles Conference Papers 2016 Journal Articles Conference Papers 2015 Journal Articles Conference Papers 2014 Journal Articles Conference Papers 2013 Journal Articles Conference Papers 2012 Journal Articles Conference Papers 2011 Journal Articles Conference Papers Before 2011 Journal Articles Conference Papers Books Resources People Faculty Visiting Professors Ph.D Students M.S. Students Alumni Activities 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 About 实验室介绍 About M.I.N People Faculty Visiting Professors Ph.D Students M.S. Students Alumni People HongKai Xiong Title：Vice Dean / Zhiyuan College Email：xionghongkai@sjtu.edu.cn Tel：86-21-34208550 Mobile：86-13918714146 Fax：86-21-34205953 Address：Room 309, SEIEE Building No.1 Web page：http://min.sjtu.edu.cn/ Vice Dean, Zhiyuan College Yangtze River Scholar Distinguished Professor NSF Distinguished Young Scholar Distinghuished Professor, Department of Electronic Engineering & Department of    Computer Science and Engineering Office: Room 309, SEIEE Building No.1 Email: xionghongkai@sjtu.edu.cn Biography Hong-Kai XIONG is a Cheung Kong Professor and a Distinguished Professor at Shanghai Jiao Tong University (SJTU). Currently, he is with both Dept. Electronic Engineering and Dept. Computer Science and Engineering. From 2018-2020, he acted as the Vice Dean of Zhiyuan College in SJTU. He received the Ph.D. degree from Shanghai Jiao Tong University (SJTU), Shanghai, China, in 2003. Since then, he has been with the Department of Electronic Engineering, SJTU. He was an Associate Professor from 2005-2011 and an Assistant Professor from 2003-2005. From 2007 to 2008, he was a Research Scholar in the Department of Electrical and Computer Engineering, Carnegie Mellon University (CMU), Pittsburgh, PA, USA. During 2011-2012, he was a Scientist with the Division of Biomedical Informatics at the University of California (UCSD), San Diego, CA, USA. Dr. Xiong’s research interests include signal representation and wavelet analysis, image and video coding, multimedia communication and networking, computer vision, and machine learning. He published over 360 refereed journal and conference papers. He was the co-author of the TOP 1% Paper Award of the 2022 ACM International Conference on Multimedia (ACM Multimedia’22), the Top 5% Award at the 2024 IEEE International Conference on Image Processing (IEEE ICIP’24), the Top 10% Paper Award at the 2016 IEEE Visual Communication and Image Processing (IEEE VCIP’16), the Best Student Paper Award at the 2014 IEEE Visual Communication and Image Processing (IEEE VCIP’14), the Best Paper Award at the 2013 IEEE International Symposium on Broadband Multimedia Systems and Broadcasting (IEEE BMSB’13), and the Top 10% Paper Award at the 2011 IEEE International Workshop on Multimedia Signal Processing (IEEE MMSP’11). In 2022, Dr. Xiong was granted the First Prize of the Shanghai Science and Technology Progress Award. In 2021, Dr. Xiong was awarded the First Prize of Natural Science of the Chinese Institute of Electronics. In 2018, he was the recipient of the Shanghai Youth Science and Technology Distinguished Accomplishment Award. In 2017, he received both the Science and Technology Innovative Leader Talent Award, and Shanghai Academic Research Leader Talent Award. In 2014, he received both National Science Fund for Distinguished Young Scholar Award from Natural Science Foundation of China (NSFC) and Shanghai Youth Science and Technology Talent Award. In 2013, he obtained Shanghai Shu Guang Scholar Award. He was the recipients of Baosteel Excellent Faculty Award in both 2021 and 2017, and the SJTU SMC-A Excellent Young Faculty Awards in both 2010 and 2013. In both 2017 and 2011, he has been granted the First Prizes of the Shanghai Technology Innovation Awards. In 2009, he obtained the New Century Excellent Talent Award from Ministry of Education of China. From 2018-2021, he was the Associate Editor of IEEE Transactions on Circuits and Systems for Video Technology (TCSVT). He was elevated to a Fellow the Chinese Institute of Electronics in 2023. He is a Fellow of the IEEE. Professional Affiliations Distinguished member          Chinese Computer Federation Council member                     Chinese Society of Image and Graphics General Co-Chair                   Chinese Conference on Pattern Recognition and Computer Vision (PRCV 2025) General Co-Chair                   International Conference on Image and Graphics (ICIG 2017) Associate Editor                     IEEE Trans. Circuits and Systems for Video Technology (TCSVT)     2018-2021 Associate Editor                     Chinese Journal of Electronics      2022-2025 Awards and Honors Fellow of the IEEE                 For contributions to multi-scale multimedia representation, coding and communication Fellow of the Chinese Institute of Electronics Cheung Kong Distinguished Professor Award NSFC Distinguished Career Award Natural Science and Technology Innovative Leader Award Shanghai Young Science and Technology Outstanding Award                                  2018 Shanghai Science and Technology Progress Award                                                      2022 CIE（The Chinese Institute of Electronics）Natural Science Award                       2021 Shanghai Technology Innovation Awards                                                                      2017、2011 Shanghai Excellent Professorship Leader Award                                                          2017 Baosteel Excellent Faculty Fellowship Awards                                                              2021、2017 Shanghai Young Science and Technology Talent Award                                             2014 Shanghai Shu Guang Professorship Award                                                                    2013 Copyright: Institute of Media,Information, and Network, 2021 Tel: 021-34205953 Email: xionghongkai@gmail.com Address: SEIEE Building 1-304&309, Dept.of Electronic Engineering, Shanghai Jiao Tong University, 800 Dongchuan Road, Shanghai, 200240, China",
  "content_length": 6643,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:54"
}