{
  "name": "Hongfei Xue",
  "homepage": "https://havocfixer.github.io",
  "status": "success",
  "content": "Hongfei Xue - Homepage Hongfei Xue （薛鸿飞） Assistant Professor, Department of Computer Science University of North Carolina at Charlotte (UNCC) Office: Woodward Hall 205A, Charlotte, NC 28262 Email: hongfei DOT xue AT charlotte DOT edu [Google Scholar] [DBLP] Opening Openings: I am looking for self-motivated Ph.D. students and research interns. If you are interested in working with me, feel free to send me your CV. Graduate admission information can be found here. About me Dr. Hongfei Xue is an Assistant Professor of Department of Computer Science at the University of North Carolina at Charlotte. He obtained the Ph.D. degree at the State University of New York at Buffalo jointly supervised by Prof. Lu Su and Prof. Aidong Zhang. Before that, he received his B.S. degree from the University of Science and Technology of China (USTC). Dr. Xue's research interests lie in the intersection of Internet of Things and Artificial Intelligence, with an emphasis on building intelligent wireless sensing systems. His research focuses on developing algorithms and systems that can intelligently collect, integrate, analyze, and eventually transform the IoT sensory data into useful knowledge that can draw a better understanding of the social and physical world. Publications [ICDCS'25] Physical Backdoor Attacks against mmWave-based Human Activity Recognition Ziqian Bi, Amit Singha, Hongfei Xue, Tao Li, Yimin Chen, and Yanchao Zhang IEEE International Conference on Distributed Computing Systems [CVPR'25] HOIGPT: Learning Long Sequence Hand-Object Interaction with Language Models Mingzhen Huang, Fu-Jen Chu, Bugra Tekin, Kevin J Liang, Haoyu Ma, Weiyao Wang, Xingyu Chen, Pierre Gleize, Hongfei Xue, Siwei Lyu, Kris Kitani, Matt Feiszli, Hao Tang Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition [SenSys'25] RAM-Hand: Robust Acoustic Multi-Hand Pose Reconstruction Using a Microphone Array [Paper] Shiyang Wang, Henglin Pu, Qiming Cao, Wenjun Jiang, Xingchen Wang, Tianci Liu, Zhengxin Jiang, Hongfei Xue, Lu Su Proceedings of the 23rd ACM Conference on Embedded Networked Sensor Systems 🏆 Best Paper Award (1/235) [SenSys'25] Argus: Multi-View Egocentric Human Mesh Reconstruction Based on Stripped-Down Wearable mmWave Add-on [Paper] Di Duan, Shengzhe Lyu, Mu Yuan, Hongfei Xue, Tianxing Li, Weitao Xu, Kaishun Wu, Guoliang Xing Proceedings of the 23rd ACM Conference on Embedded Networked Sensor Systems 🏆 Best Paper Honorable Mention (2/235) [AAAI'25] GenHMR: Generative Human Mesh Recovery [Paper] [Website] Muhammad Usama Saleem, Ekkasit Pinyoanuntapong, Pu Wang, Hongfei Xue, Srijan Das, Chen Chen The Thirty-Ninth AAAI Conference on Artificial Intelligence [WACV'25] BioPose: Biomechanically-accurate 3D Pose Estimation from Monocular Videos [Paper] [Website] Farnoosh Koleini, Muhammad Usama Saleem, Pu Wang, Hongfei Xue, Ahmed Helmy, and Abbey Fenwick IEEE/CVF Winter Conference on Applications of Computer Vision [BigData'24] Towards Robust mmWave-based Human Activity Recognition using Large Simulated Dataset for Model Pretraining [Paper] Vinay Joshi (Undergraduate Student), Shengkai Xu, Qiming Cao, Yi Zhu, Pu Wang, Hongfei Xue 2024 IEEE International Conference on Big Data 🏆 Best Undergraduate Paper Award [SenSys'24] mmCLIP: Boosting mmWave-based Zero-shot HAR via Signal-Text Alignment [Paper] [GitHub] [Dataset] Qiming Cao, Hongfei Xue, Tianci Liu, Xingchen Wang, Haoyu Wang, Xincheng Zhang, Lu Su Proceedings of the 22nd ACM Conference on Embedded Networked Sensor Systems [TOSN'24] Towards Smartphone-based 3D Hand Pose Reconstruction Using Acoustic Signals [Paper] Shiyang Wang, Xingchen Wang, Wenjun Jiang, Chenglin Miao, Qiming Cao, Haoyu Wang, Ke Sun, Hongfei Xue, Lu Su ACM Transactions on Sensor Networks [MobiCom'24] Malicious Attacks against Multi-Sensor Fusion in Autonomous Driving [Paper] Yi Zhu, Chenglin Miao, Hongfei Xue, Yunnan Yu, Lu Su, Chunming Qiao Proceedings of the 30th Annual International Conference on Mobile Computing and Networking [MobiCom'23] Towards Generalized mmWave-based Human Pose Estimation through Signal Augmentation [Paper] Hongfei Xue, Qiming Cao, Chenglin Miao, Yan Ju, Haochen Hu, Aidong Zhang, Lu Su Proceedings of the 29th Annual International Conference on Mobile Computing and Networking [CCS'23] TileMask: A Passive-reflection-based Attack against mmWave Radar Object Detection in Autonomous Driving [Paper] Yi Zhu, Chenglin Miao, Hongfei Xue, Zhengxiong Li, Yunnan Yu, Wenyao Xu, Lu Su, and Chunming Qiao Proceedings of the 30th ACM Conference on Computer and Communications Security [KDD'23] Macular: a Multi-Task Adversarial Framework for Cross-Lingual Natural Language Understanding [Paper] Haoyu Wang, Yaqing Wang, Feijie Wu, Hongfei Xue, Jing Gao Proceedings of the 29th SIGKDD Conference on Knowledge Discovery and Data Mining [SenSys'22] M4esh: mmWave-based 3D Human Mesh Construction for Multiple Subjects [Paper] Hongfei Xue*, Qiming Cao*, Yan Ju, Haochen Hu, Haoyu Wang, Aidong Zhang, Lu Su (*: Equal contributions) Proceedings of the 20th ACM Conference on Embedded Networked Sensor System [ICIP'22] Fusing Global and Local Features for Generalized AI-Synthesized Image Detection [Paper] [Code] Yan Ju, Shan Jia, Lipeng Ke, Hongfei Xue, Koki Nagano, Siwei Lyu The 29th IEEE International Conference on Image Processing [MobiSys'21] mmMesh: Towards 3D Real-Time Dynamic Human Mesh Construction Using Millimeter-wave [Paper] [Real-time Demo] [Presentation Video] [Project Site] Hongfei Xue, Yan Ju, Chenglin Miao, Yijiang Wang, Shiyang Wang, Aidong Zhang, Lu Su Proceedings of the 19th ACM International Conference on Mobile Systems, Applications, and Services [MobiCom'20] Towards 3D Human Pose Construction Using WiFi [Paper] [Demo Video] [Short Presentation Video] [Full Presentation Video] [Full Slides] Wenjun Jiang*, Hongfei Xue*, Chenglin Miao, Shiyang Wang, Sen Lin, Chong Tian, Srinivasan Murali, Haochen Hu, Zhi Sun, Lu Su (*: Equal contributions) Proceedings of the 26th Annual International Conference on Mobile Computing and Networking [UbiComp'20] DeepMV: Multi-View Deep Learning for Device-Free Human Activity Recognition [Paper] [Full Presentation Video] Hongfei Xue*, Wenjun Jiang*, Chenglin Miao, Fenglong Ma, Shiyang Wang, Ye Yuan, Shuochao Yao, Aidong Zhang, Lu Su (*: Equal contributions) Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologiesg [IJCAI'19] Deep Metric Learning: The Generalization Analysis and an Adaptive Algorithm [Paper] Mengdi Huai, Hongfei Xue, Chenglin Miao, Liuyi Yao, Lu Su, Changyou Chen, Aidong Zhang Proceedings of the Twenty-Eighth International Joint Conference on Artificial Intelligence Main track [IJCAI'19] On the Estimation of Treatment Effect with Text Covariates [Paper] Liuyi Yao, Sheng Li, Yaliang Li, Hongfei Xue, Jing Gao, Aidong Zhang Proceedings of the Twenty-Eighth International Joint Conference on Artificial Intelligence Main track [MobiHoc'19] DeepFusion: A Deep Learning Framework for the Fusion of Heterogeneous Sensory Data [Paper] Hongfei Xue, Wenjun Jiang, Chenglin Miao, Ye Yuan, Fenglong Ma, Xin Ma, Yijiang Wang, Shuochao Yao, Wenyao Xu, Aidong Zhang, Lu Su Proceedings of the Twentieth ACM International Symposium on Mobile Ad Hoc Networking and Computing [MobiCom'18] Towards Environment Independent Device Free Human Activity Recognition [Paper] Wenjun Jiang, Chenglin Miao, Fenglong Ma, Shuochao Yao, Yaqing Wang, Ye Yuan, Hongfei Xue, Chen Song, Xin Ma, Dimitrios Koutsonikolas, Wenyao Xu, Lu Su Proceedings of the 24th Annual International Conference on Mobile Computing and Networking [BHI'18] A novel channel-aware attention framework for multi-channel EEG seizure detection via multi-view deep learning [Paper] Ye Yuan, Guangxu Xun, Fenglong Ma, Qiuling Suo, Hongfei Xue, Kebin Jia, Aidong Zhang 2018 IEEE EMBS International Conference on Biomedical & Health Informatics [BCB'16] Risk Factor Analysis Based on Deep Learning Model [Paper] Qiuling Suo, Hongfei Xue, Jing Gao, Aidong Zhang Proceedings of the 7th ACM International Conference on Bioinformatics, Computational Biology, and Health Informatics Teaching Experiences I was lecturer for the following courses at UNCC: ITCS 3156: Introduction to Machine Learning (Spring 2025) ITCS 6156/8156: Machine Learning (Fall 2024) ITCS 6156/8156: Machine Learning (Spring 2024) ITCS 6156/8156: Machine Learning (Fall 2023) I served as a teaching assistant for the following courses at UB: CSE 489/589: Modern Network Concepts (Fall 2021, Spring 2023) CSE 250: Data Structures (Spring 2019) CSE 474/574: Introduction to Machine Learning (Spring 2018, Fall 2018) CSE 601: Data Mining and Bioinformatics (Fall 2017) CSE 113: Introduction to Computer Science (Spring 2016) CSE 435/535: Introduction to Information Retrieval (Fall 2015) Awards Best PhD Thesis Award 2023, Dec. 2023 CSE PhD Best Research Award 2020, Dec. 2020",
  "content_length": 8896,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:53"
}