{
  "name": "Hongyang R. Zhang",
  "homepage": "https://www.khoury.northeastern.edu/people/hongyang-zhang",
  "status": "success",
  "content": "Hongyang Zhang - Khoury College of Computer Sciences All People Hongyang Zhang (he/him/his) Assistant Professor Research interests Research interests Machine learning Design and analysis of algorithms Learning theory Data, data augmentation, and networks Language modeling Education Education Postdoctorate in Statistics and Data Science, University of Pennsylvania PhD in Computer Science, Stanford University BEng in Computer Science, Shanghai Jiao Tong University — China Biography Biography Hongyang (Ryan) Zhang is an assistant professor in the Khoury College of Computer Sciences at Northeastern University, based in Boston. Zhang's research interests lie at the intersection of machine learning, design and analysis of algorithms, learning theory, data, networks, and language modeling. He spent a year as a postdoc in the statistics and data science department at the University of Pennsylvania; served as an area chair and program committee member for ICML, AISTATS, COLT, ALT, and AAAI; and served as an action editor for the Journal of Data-centric Machine Learning Research. Labs and groups Labs and groups Virtuoso Research Lab Algorithms and Theory Recent publications Recent publications Published: July 1, 2025 Efficient Ensemble for Fine-tuning Language Models on Multiple Datasets Citation: Dongyue Li, Ziniu Zhang, Lu Wang , Hongyang R. Zhang. (2025). Efficient Ensemble for Fine-tuning Language Models on Multiple Datasets ACL (1), 25347-25364. https://aclanthology.org/2025.acl-long.1231/ Published: August 24, 2024 Scalable Multitask Learning Using Gradient-based Estimation of Task Affinity Citation: Dongyue Li, Aneesh Sharma, Hongyang R. Zhang. (2024). Scalable Multitask Learning Using Gradient-based Estimation of Task Affinity KDD, 1542-1553. https://doi.org/10.1145/3637528.3671835 Published: June 23, 2024 Learning Tree-Structured Composition of Data Augmentation Citation: Dongyue Li, Kailai Chen, Predrag Radivojac, Hongyang R. Zhang. (2024). Learning Tree-Structured Composition of Data Augmentation Trans. Mach. Learn. Res., 2024. https://openreview.net/forum?id=lmgf03HeqV Published: August 4, 2023 Boosting Multitask Learning on Graphs through Higher-Order Task Affinities Citation: Dongyue Li, Haotian Ju, Aneesh Sharma, Hongyang R. Zhang. (2023). Boosting Multitask Learning on Graphs through Higher-Order Task Affinities KDD, 1213-1222. https://doi.org/10.1145/3580305.3599265 Published: January 1, 2022 Robust Fine-Tuning of Deep Neural Networks with Hessian-based Generalization Guarantees Citation: Haotian Ju, Dongyue Li, Hongyang R. Zhang. (2022). Robust Fine-Tuning of Deep Neural Networks with Hessian-based Generalization Guarantees ICML, 10431-10461. https://proceedings.mlr.press/v162/ju22a.html Published: January 1, 2022 Correct-N-Contrast: a Contrastive Approach for Improving Robustness to Spurious Correlations Citation: Michael Zhang, Nimit Sharad Sohoni, Hongyang R. Zhang, Chelsea Finn, Christopher Ré. (2022). Correct-N-Contrast: a Contrastive Approach for Improving Robustness to Spurious Correlations ICML, 26484-26516. https://proceedings.mlr.press/v162/zhang22z.html Published: January 1, 2021 Improved Regularization and Robustness for Fine-tuning in Neural Networks Citation: Dongyue Li, Hongyang R. Zhang. (2021). Improved Regularization and Robustness for Fine-tuning in Neural Networks NeurIPS, 27249-27262. https://proceedings.neurips.cc/paper/2021/hash/e4a93f0332b2519177ed55741ea4e5e7-Abstract.html Published: October 22, 2020 Sharp Bias-variance Tradeoffs of Hard Parameter Sharing in High-dimensional Linear Regression Citation: Zhang, H.R., Yang, F., Wu, S., Su, W.J. and Ré, C., 2020. Sharp Bias-variance Tradeoffs of Hard Parameter Sharing in High-dimensional Linear Regression. arXiv preprint arXiv:2010.11750. Published: July 23, 2020 Learning Over-Parametrized Two-Layer ReLU Neural Networks beyond NTK Citation: Li, Y., Ma, T. and Zhang, H.R., 2020, July. Learning Over-parametrized Two-layer Neural Networks beyond NTK. In Conference on Learning Theory. Published: July 7, 2020 On the Generalization Effects of Linear Transformations in Data Augmentation Citation: Wu, S., Zhang, H.R., Valiant, G. and Ré, C., 2020. On the Generalization Effects of Linear Transformations in Data Augmentation. ICML. Published: May 2, 2020 Understanding and Improving Information Transfer in Multi-Task Learning Citation: Wu, S., Zhang, H.R. and Ré, C., 2020. Understanding and Improving Information Transfer in Multi-Task Learning. ICLR. Published: May 1, 2019 Pruning based Distance Sketches with Provable Guarantees on Random Graphs Citation: Zhang, H., Yu, H. and Goel, A., 2019, May. Pruning based Distance Sketches with Provable Guarantees on Random Graphs. In The World Wide Web Conference. Published: July 1, 2018 Algorithmic Regularization in Over-parameterized Matrix Sensing and Neural Networks with Quadratic Activations Citation: Li, Y., Ma, T. and Zhang, H.R., 2018, July. Algorithmic Regularization in Over-parameterized Matrix Sensing and Neural Networks with Quadratic Activations. In Conference On Learning Theory. Individual Details Tenured/Tenure-Track Faculty Campus Boston Website http://hongyangzhang.com/ Google Scholar See Citations Areas of Interest Algorithms and Theory Machine Learning Contact ho.zhang@northeastern.edu Current PhD students Minxuan Duan PhD Student Read bio Locations Close this dialog window Boston Dongyue Li PhD Student Read bio Locations Close this dialog window Boston Zhenshuo Zhang PhD Student Read bio Locations Close this dialog window Boston Ziniu Zhang PhD Student Read bio Locations Close this dialog window Boston",
  "content_length": 5635,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:01"
}