{
  "name": "Hong-Ning Dai",
  "homepage": "https://www.henrylab.net",
  "status": "success",
  "content": "Henry Hong-Ning Dai's Homepage – Henry Hong-Ning Dai is a professor and researcher with interests on Internet of Things, Big Data Analytics, Blockchain Henry Hong-Ning Dai Hong Kong Baptist University Biography Resume Research Publications Services Students Teaching Contact Copyright by Henry H.-N. Dai Biography Henry Hong-Ning Dai is an associate professor with the Department of Computer Science, Hong Kong Baptist University, Hong Kong. Before joining Hong Kong Baptist University, he was with the School of Computer Science and Engineering at Macau University of Science and Technology as an assistant professor/associate professor from 2010 to 2021, and the Department of Computing and Decision Sciences, Lingnan University, Hong Kong as an associate professor from 2021 to 2022. He obtained a Ph.D. in Computer Science and Engineering from the Department of Computer Science and Engineering at the Chinese University of Hong Kong and a D.Eng. in Computer Technology Application from the Department of Computer Science and Engineering at Shanghai Jiao Tong University. He worked in the Department of Information Engineering at the Chinese University of Hong Kong and the Hong Kong Applied Science and Technology Research Institute after his Ph.D. study. He is a senior member of ACM, a senior member of IEEE, and a senior member of the European Alliance for Innovation (EAI). His research interests include the Internet of Things, Blockchains, Big Data Analytics. He has co-authored/co-edited four monograph books and published more than 200 peer-reviewed papers in top-tier journals and conferences, including the IEEE Communications Surveys & Tutorials, Proceedings of the IEEE, ACM Computing Surveys, IEEE Journal on Selected Areas in Communications, IEEE Transactions on Computers, IEEE Transactions on Parallel and Distributed Systems, IEEE Transactions on Knowledge and Data Engineering, IEEE Internet of Things Journal, IEEE Transactions on Vehicular Technology, ACM Transactions on Intelligent Systems and Technology, IEEE Transactions on Cloud Computing, IEEE Transactions on Intelligent Transportation Systems, IEEE Transactions on Industrial Informatics, IEEE Transactions on Computational Social Systems, IEEE INFOCOM, etc. He has 7 ESI highly-cited papers by Clarivate Analytics, 1 IEEE Outstanding Paper Award conferred by IEEE CPSCom 2019, and 1 Best Paper Award conferred by EAI CloudComp 2020, the BOC Excellent Research Award of Macau University of Science and Technology in 2015. He was also included in the world’s top 2% scientists for career-long impact by Stanford University, USA (by John Ioannidis of Stanford University source). He is also the holder of 1 U.S. patent and 1 Australia innovation patent. Henry has been actively involved with a number of professional activities. In particular, he has also served as Associate Editors/Editors in IEEE Transactions on Intelligent Transportation Systems, IEEE Transactions on Industrial Informatics, Ad Hoc Networks (Elsevier), Connection Science (Taylor & Francis), and International Journal of Cognitive Computing in Engineering (Elsevier), Technical Committee of Computer Communications (Elsevier), and topic editor of Sensors.Previously, he served as Associate Editors in IEEE Systems Journal and IEEE Access. Meanwhile, he has served as guest editor of IEEE Transactions on Industrial Informatics and IEEE Transactions on Emerging Topics in Computing. He has also served as General Chairs of 2021 International Conference on Blockchain and Trustworthy Systems (BlockSys’ 2021), TPC Chairs of the inaugural IEEE Symposium on Blockchain at IEEE SERVICES 2021, TPC Chairs of Airbone and Maritime Mobile Systems and Services at the 2021 IEEE 94th Vehicular Technology Conference (VTC2021-Fall). TPC chairs of  2020 International Conference on Blockchain and Trustworthy Systems (BlockSys’ 2020) and 2019 International Conference on Blockchain and Trustworthy Systems (BlockSys’ 2019). TPC co-chair of a special session on “Blockchain technology in industry” in conjunction with 2020 IEEE 16th International Conference on Automation Science and Engineering (CASE), TPC co-chair of the special session on “Blockchain for Industrial Internet-of-Things” in conjunction with IEEE International Conference on Industrial Cyber-Physical Systems 2019, TPC co-chair of the special session on “Recent Advances in Security and Privacy in Wireless Networking Systems” in conjunction with the 10th International Conference on Information, Communications and Signal Processing, 2015. He has been a reviewer for more than 40 journals. He is also a Founding Member of the IEEE Special Interest Groups (SIG) on Intelligent Internet Edge (IIE) at IEEE. He also holds visiting positions at the Department of Computer Science and Engineering in the Hong Kong University of Science and Technology, School of Electrical Engineering and Telecommunications in the University of New South Wales, Hong Kong Applied Science and Technology Research Institute, School of Data and Computer Science in Sun Yat-sen University (Guangzhou, China), School of Computer Science and Engineering in University of Electronic Science and Technology of China, School of Mechanical and Automotive Engineering in South China University of Technology. His Dijkstra number is four and Erdős number is three. Honors and Awards 2023 Top-100 New Star in AI 2000 Scholar by AMiner Henry Hong-Ning Dai was included in Top-100 New Star in AI 2000 Scholar (in the field of Internet of Things of Computer Science). (https://www.aminer.org/ai2000). 2022 Inclusion to top 2% scientists for career-long impact Henry Hong-Ning Dai was included in Stanford University's list of the world Top 2% scientists for career-long impact (https://elsevier.digitalcommonsdata.com/datasets/btchxktzyw/4/files/dbefaa9c-0022-46dc-95bc-9e8f0ec820f7). 2022 Best Paper Award of Chinese Journal on Internet of Things Chinese Journal on Internet of Things is administrated by the Ministry of Industry and Information Technology of the People's Republic of China. The aim of running journal of “Chinese Journal on Internet of Things” is “serve scientific development, spread scientific knowledge, promote scientific innovation, cultivate scientific talents”. 2022 European Alliance for Innovation (EAI) Senior Member (Class 2022) As an international professional community and a nonprofit organization, European Alliance for Innovation (EAI) aims to empower the global Information and Communication Technologies (ICT) research and innovation community, and to promote cooperation between European and International ICT communities. 2021 Inclusion to top 2% scientists for career-long impact Henry Hong-Ning Dai was included in Stanford University's list of the world Top 2% scientists for career-long impact (https://elsevier.digitalcommonsdata.com/datasets/btchxktzyw/3). 2020 ACM Senior Member The Senior Members Grade of ACM recognizes ACM members with at least 10 years of professional experience and at least 5 years of Professional Membership in the last 10 years, who have demonstrated performance through technical leadership, and technical or professional contributions. There are only 2,632 ACM Senior Members (until Oct. 2020), only 2.6% of the total number of all ACM members, revealing the high competition for the elevation of ACM Senior Members Grade. 2020 EAI CloudComp Best Paper Award The Best Paper Award conferred by 10th EAI International Conference on Cloud Computing (EAI CloudComp) 2020. 2020 Inclusion to top 2% scientists for citation impact in 2019 Henry Hong-Ning Dai was included in Stanford University's list of the world Top 2% scientists for citation impact during the single calendar year 2019 (https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3000918). 2020 Outstanding Performance Award in Online Teaching Henry Hong-Ning Dai was awarded the Outstanding Performance Award in Online Teaching of Macau University of Science and Technology due to his outstanding performance in online teaching during the COVID-19 pandemic. 2019 IEEE Outstanding Paper Award Our paper entitled ``Portable Convolution Neural Networks for Traffic Sign Recognition in Intelligent Transportation Systems`` was conferred with IEEE Outstanding Paper Award by IEEE International Conference on Cyber Physical and Social Computing 2019. 2016 IEEE Senior Member Senior Member is IEEE’s distinguished membership grade approved and assigned by the IEEE Admission and Advancement Committee only for IEEE members with 10 years in their profession and at least 5 years of significant technical or professional performance. 2016 Biography included in Marquis Who's Who in the World Founded in 1899 by Albert Nelson Marquis, Marquis Who's annually selects a set of outstanding biographees who are featured on special recognition in their disciplinaries or specializations. 2015 BOC Excellent Research Award of Macau University of Science and Technology With the sponsorship from Bank of China (BOC) Macau Branch, Macau University of Science and Technology (the University) sets up the BOC Research Excellence Award (the Research Award) to recognize the excellence in research here and to enhance the quality of research in the University. There will be one award annually in each of the five disciplinary clusters as follows: (1) Humanities and Creative Arts, (2) Social Sciences, Economics, and Management, (3) Mathematics and Natural Sciences, (4) Biological and Medical Sciences, (5) Technology and Applied Sciences. 2010 Biography included in Marquis Who's Who in the World Founded in 1899 by Albert Nelson Marquis, Marquis Who's annually selects a set of outstanding biographees who are featured on special recognition in their disciplinaries or specializations. 2008 IEEE INFOCOM Student Travel Grant IEEE INFOCOM student travel grant (STG) is sponsored by the IEEE Communications Society. STG is awarded to those Ph.D. students who are good academic standing at the given i",
  "content_length": 10011,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:51"
}