{
  "name": "Hongzi Zhu",
  "homepage": "https://lion.sjtu.edu.cn/member/memberDetail?id=12",
  "status": "success",
  "content": "LION Log in Lab of Innovation on Networking home News Projects Publications Members Hongzi Zhu ProfessorDepartment of Computer Science and EngineeringShanghai Jiao Tong UniversityLION Director Email: hongzi@sjtu.edu.cn Biography Hongzi Zhu received his B.S. and M. E. degree from Jilin University in 2001 and 2004, respectively and received his Ph.D. degree from Shanghai Jiao Tong Univeristy (SJTU) in 2009. He was a Post-doctoral Fellow in the Department of Computer Science and Engineering at Hong Kong University of Science and Technology and the Department of Electrical and Computer Engineering at University of Waterloo, Canada in 2009 and 2010, respectively. He is now a professor at the Department of Computer Science and Engineering in SJTU. His research interests include Internet of Things, vehicular networks, mobile sensing and mobile computing. Awards:2023 IEEE INFOCOM Distinguished TPC Member2021 First Prize in CCF Natural Science Award2019 IEEE VTC Distinguished Lecturer2018 Young Changjiang (Yangtze River) Scholar Award (教育部青年长江学者)2018 SMC-SJTU Excellent Young Faculty Award (Class A)2018 IEEE SECON 2018 Best Paper Award Runner-up2017 IEEE INFOCOM Distinguished TPC Member2016 IEEE GLOBECOM 2016 Best Paper Award2015 SJTU \"All English Teaching\" Contest 1st Prize2015 IEEE INFOCOM Distinguished TPC Member2014 ACM Shanghai Rising Star Award2014 SJTU New Teaching Star 2013 SMC-SJTU Excellent Young Faculty Award (Class B) 2012 IEEE Computer Society Golden Core Member2011 Shanghai Excellent Doctoral DissertationAssociation and Service:IEEE TVT Distinguished Lecturer (Class 2019)Associate Editor, IEEE Internet of Things JournalAssociate Editor, IEEE Transactions on Vehicular Technology (IEEE TVT)Associate Editor, Peer-to-peer Networking and ApplicationsTPC member, IEEE INFOCOM, since 2014TPC member, IEEE ICDCS, 2018Local Co-chair/Publicity Co-chair, IEEE IPDPS, 2012/since 2013 Related Projects Precise CSI Measurement with COTS Wi-Fi devices Yiwei Zhuo, Qinghao Liu, Hongzi Zhu LION Lane Localization with Monocular Camera Yibo Han, Tiankai Cui, Shifan Zhang and Hongzi Zhu LION Urban Vehicle Localization and Tracking Wei Zhang, Siyuan Cao, Shan Chang, Li Lu, and Hongzi Zhu LION User Authentication on Mobile Devices Jingmei Hu, Yi Jiang, Shan Chang and Hongzi Zhu LION Energy Efficiency on Mobile Devices Haofu Han, Fei Yu, Guangtao Xue, Li Lu and Hongzi Zhu LION DSRC Measurement and MAC Protocols Feng Lyu, Hongzi Zhu LION Vehicular Mobility and Sociality Analysis Hongzi Zhu LION VENUS: VEhicular Network Universal Simulator Hongzi Zhu, Jiangang Shen, Yunxiang Cai, Yasheng Wang LION Opportunistic Data Forwarding in VANETs Jun Qin, Shan Chang and Hongzi Zhu LION Challenges and Solutions in Participatory Sensing Shan Chang, Li Lu, and Hongzi Zhu LION Mobile Sensing Zifan Liu, Yuxiao Zhang, Hongzi Zhu LION Data Privacy Shan Chang, Li Lu and Hongzi Zhu LION 3D Object Detection with Monocular Camera Yunsong Zhou and Hongzi Zhu LION 3D Point Clouds Processing Quan Líu, Yunsong Zhou, Zhenxi Wang and Hongzi Zhu LION Edge Collaborative Intelligence Yunzhe Li, Jiangang Shen, Aoxing Liang, Chengfan Hong, Haiyao Li and Hongzi Zhu LION mmWave V2V Communication Jiangang Shen and Hongzi Zhu LION Neighbor Distribution Estimation via V2V Communication Yunxiang Cai, Jiangang Shen and Hongzi Zhu LION Secure Voice Interaction with Mobile Devices Xiao Wang, Shan Chang and Hongzi Zhu LION Multi-vehicle Point Cloud Registration and Dataset Zhenxi Wang, Hongzi Zhu, and Quan Liu LION Related Publications ANTS: Efficient Vehicle Locating Based on Ant Search in ShanghaiGrid Hongzi Zhu, Yanmin Zhu, Minglu Li and Lionel M. Ni in Proceedings of ICPP 2007, Xi'an, China. HERO: Online Real-time Vehicle Tracking in Shanghai Hongzi Zhu, Yanmin Zhu, Minglu Li and Lionel M. Ni in Proceedings of IEEE INFOCOM 2008, Phoenix, USA. SEER: Metropolitan-scale Traffic Perception Based on Lossy Sensory Data Hongzi Zhu, Yanmin Zhu, Minglu Li and Lionel M. Ni in Proceedings of IEEE INFOCOM 2009, Rio de Janeiro, Brazil. ANTS: Efficient Vehicle Locating Based on Ant Search in ShanghaiGrid Minglu Li, Hongzi Zhu, Yanmin Zhu and Lionel M. Ni IEEE Transactions on Vehicular Technology (IEEE TVT), 58(8), pp. 4088-4097, Oct. 2009. HERO: Online Real-time Vehicle Tracking Hongzi Zhu, Minglu Li, Yanmin Zhu and Lionel M. Ni IEEE TPDS, 20(5), pp. 740-752, May 2009. Recognizing Exponential Inter-Contact Time in VANETs Hongzi Zhu, Luoyi Fu, Guangtao Xue, Minglu Li, Yanmin Zhu and Lionel M. Ni in Proceedings of IEEE INFOCOM 2010 (Mini-conference), San Diego, USA. Impact of Traffic Influxes: Revealing Exponential Inter-Contact Time in urban VANETs Hongzi Zhu, Minglu Li, Luoyi Fu, Guangtao Xue, Yanmin Zhu and Lionel M. Ni IEEE Transactions on Distributed and Parallel Systems (IEEE TPDS), 22(8), pp. 1258-1266, Aug. 2011. Compressive Sensing Approach to Urban Traffic Sensing Zhi Li, Yanmin Zhu, Hongzi Zhu and Minglu Li in Proceedings of IEEE ICDCS 2011, Minneapolis, Minnesota, USA. Exploiting Temporal Dependency for Opportunistic Forwarding in Urban Vehicular Network Hongzi Zhu, Shan Chang, Minglu Li, Sagar Naik and Sherman Shen in Proceedings of IEEE INFOCOM 2011, Shanghai, China. Footprint: Detecting Sybil Attacks in Urban Vehicular Networks Shan Chang, Yong Qi, Hongzi Zhu, Jizhong Zhao and Xuemin (Sherman) Shen IEEE Transactions on Distributed and Parallel Systems (IEEE TPDS), 23(6), pp 1103 - 1114, June, 2012. Cutting without Pain: Mitigating 3G Radio Tail Effect on Smartphones Fei Yu, Guangta Xue, Hongzi Zhu, Zhenxian Hu, Minglu Li and Gong Zhang in Proceedings of IEEE INFOCOM 2013 (Mini-conference), Turin, Italy. CCR: Capacity-Constrained Replication for Data Delivery in Vehicular Networks Yuchen Wu, Yanmin Zhu, Hongzi Zhu and Bo Li in Proceedings of IEEE INFOCOM 2013, Turin, Italy. ZOOM: Scaling the Mobility for Fast Opportunistic Forwarding in Vehicular Networks Hongzi Zhu, Mianxiong Dong, Shan Chang, Yanmin Zhu, Minglu Li and Sherman Shen in Proceedings of IEEE INFOCOM 2013, Turin, Italy. S3: Characterizing Sociality for User-Friendly Steady Load Balancing in Enterprise WLANs Chaoqun Yue, Guangtao Xue, Hongzi Zhu, Jiadi Yu and Minglu Li in Proceedings of ICDCS 2013, Philadelphia, Pennsylvania, USA. E3: Energy-Efficient Engine for Frame Rate Adaptation on Smartphones Haofu Han, Jiadi Yu, Hongzi Zhu, Yingying Chen, Jie Yang, Guangtao Xue, Yanmin Zhu and Minglu Li in Proceedings of ACM SenSys 2013, Rome, Italy. When 3G Meets VANET: 3G-Assisted Data Delivery in VANETs Qingwen Zhao, Yanmin Zhu, Chao Chen, Hongzi Zhu and Bo Li IEEE Sensors Journal, 13(10), pp. 3575-3584, 2013. Sociality-aware Access Point Selection in Enterprise Wireless LANs Guangtao Xue, Qi He, Hongzi Zhu, Tian He and Yunhuai Liu IEEE Transactions on Distributed and Parallel Systems (IEEE TPDS), 24(10), pp. 2069 - 2078, October 2013. A Compressive Sensing Approach to Urban Traffic Estimation with Probe Vehicles Yanmin Zhu, Zhi Li, Hongzi Zhu, Minglu Li and Qian Zhang IEEE Transactions on Mobile Computing (IEEE TMC), 12(11), pp. 2289-2302, November 2013. Towards Truthful Mechanisms for Mobile Crowdsourcing with Dynamic Smartphones Zhenni Feng, Yanmin Zhu, Qian Zhang, Hongzi Zhu, Jiadi Yu, Jian Cao and Lionel Ni in Proceedings of IEEE ICDCS 2014, Madrid, Spain. Fair Energy-efficient Sensing Task Allocation in Participatory Sensing with Smartphones Qingwen Zhao, Yanmin Zhu, Hongzi Zhu, Jian Cao, Guangtao Xue and Bo Li in Proceedings of IEEE INFOCOM 2014, Toronto, Canada. SenSpeed: Sensing Driving Conditions to Estimate Vehicle Speed in Urban Environments Haofu Han, Jiadi Yu, Hongzi Zhu, Yingying Chen, Jie Yang, Yanmin Zhu, Guangtao Xue and Minglu Li in Proceedings of IEEE INFOCOM 2014, Toronto, Canada. POST: Exploiting Dynamic Sociality for Mobile Advertising in Vehicular Networks Jun Qin, Hongzi Zhu, Yanmin Zhu, Li Lu, Guangtao Xue and Minglu Li in Proceedings of IEEE INFOCOM 2014, Toronto, Canada. MMCD: cooperative downloading for highway VANETs Kaoru Ota, Mianxiong Dong, Shan Chang and Hongzi Zhu IEEE Transactions on Emerging Topics in Computing (IEEE TETC), 3(1), pp. 34-43. Characterizing Sociality for User-Friendly Steady Load Balancing in Enterprise WLANs Guangtao Xue, Yanmin Zhu, Zhenxian Hu, Hongzi Zhu, Chaoqun Yue and Jiadi Yu IEEE Network, 29(6), pp. 26-32, 2015. SmartCut: Mitigating 3G Radio Tail Effect on Smartphones Guangtao Xue, Hongzi Zhu, Zhenxian Hu, Jiadi Yu, Yanmin Zhu and Gong Zhang IEEE Transactions on Mobile Computing (IEEE TMC), 14(1), pp. 169-179, 2015. Sensing Human-Screen Interaction for Energy-Efficient Frame Rate Adaptation on Smartphones Jiadi Yu, Haofu Han, Hongzi Zhu, Yingying Chen, Jie Yang, Yanmin Zhu, Guangtao Xue and Minglu Li IEEE Transactions on Mobile Computing (IEEE TMC), 14(8), pp. 1698-1711, 2015. TIGHT: A Cross-Layer RF Distance Bounding Realization for Passive Wireless Devices Muhammad Jawad Hussain, Li Lu and Hongzi Zhu IEEE Transactions on Wireless Communications (IEEE TWC), vol. 14(6), pp. 3076-3085, 2015. Truthful Online Double Auctions for Dynamic Mobile Crowdsourcing Yueming Wei, Yanmin Zhu, Hongzi Zhu, Qian Zhang and Gangtao Xue in Proceedings of IEEE INFOCOM 2015, Hong Kong, China. SenSpeed: Sensing Driving Conditions to Estimate Vehicle Speed in Urban Environments Jiadi Yu, Hongzi Zhu, Haofu Han, Yingying Chen, Jie Yang, Yanmin Zhu, Zhongyang Chen, Guangtao Xue and Minglu Li IEEE Transactions on Mobile Computing (IEEE TMC), 15(1), pp. 202-216, 2016. PURE: Blind Regression Modeling for Low Quality Data with Participatory Sensing Shan Chang, Hongzi Zhu, Wei Zhang, Li Lu and Yanmin Zhu EEE Transactions on Parallel and Distributed Systems (IEEE TPDS), 27(4), pp. 1199-1211, 2016. Private and Flexible Urban Message Delivery Shan Chang, Hongzi Zhu, Mianxiong Dong, Kaoru Ota, Xiaoqiang Liu and Sherman Shen IEEE Transactions on Vehicular Technology (IEEE TVT),65(7), pp. 4900-4910, 2016. POST: Exploiting Dynamic Sociality for Mobile Advertising in Vehicular Networks Jun Qin, Hon",
  "content_length": 25800,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:02"
}