{
  "name": "Hongfu Liu 0001",
  "homepage": "http://hongfuliu.com",
  "status": "success",
  "content": "Hongfu Liu - Homepage HONGFU LIU Michtom School of Computer Science, Brandeis University                                                        hongfuliu@brandeis.edu I am currently a tenure-track assistant professor in Michtom School of Computer Science at Brandeis University. I received my Ph.D. in Department of Electrical & Computer Engineering, Northeastern University (NEU), supervised by Prof. Yun (Raymond) Fu. Before joining NEU, I got my master and bachelor degrees majored in management at Beihang University with Prof. Junjie Wu. Here is my latest CV. EDUCATION PhD, in College of Engineering, Northeastern University, 2018 Master, in Management Science and Engineering, Beihang University, 2014 Bachelor, in Information Systems, Beihang University, 2011 Minor Bachelor, in Applied Mathematics, Beihang University, 2011 Minor Bachelor, in Law, Beihang University, 2011 INTERN Microsoft Research Asia, 06/2017 - 08/2017 Adobe Research, 05/2016 - 07/2016 INTERESTS Cluster Analysis: consensus clustering, constrained clustering, balanced clustering, multi-view clustering, interpretable clustering, big data clustering, fair clustering Outlier Detection: multi-view outlier detection, spammer detection, zombie user detection, bi-sampling outlier detection, jointly clustering and outlier detection Transfer Learning: heterogenous domain adaptation, unsupervised domain adaptation, structure-preserved domain adaptation Feature Selection: unsupervised feature selection, multi-view feature selection HIRING Ph.D. students, PostDocs, Visiting Scholars, and Research Associates to work on machine learning, data mining, computer vision, business intelligence, and social media analytics are welcome. INVITED TALKS I am inviting researchers from adademia and industry to Brandeis for talks. APPOITMENT For face-to-face online visitors, please make an appointment by email. NEWS 2024/1 One ICLR oral accepted. Congrats to Peizhao~ 2023/11 Congrats to Peizhao's NIJ Fellowship~ 2023/11 Congrats to Peizhao's graduation~ 2023/9 Welcome my new student Ziao Yang. 2023/8 One TPMAI accepted. Congrats to Han~ Professional Activities Publications & Codes Honors & Awards Team & Sponsors Associate Editor IEEE Computational Intelligence Magazine (IEEE CIM) Area Chair Neural Information Processing Systems (NeurIPS) International Conference on Learning Representations (ICLR) International Conference on Machine Learning (ICML) Google Scholar Codes Han Yue, Jundong Li, and Hongfu Liu Second-Order Unsupervised Feature Selection via Knowledge Contrastive Distillation. IEEE Transactions on Pattern Analysis and Machine Intelligence, 2023. Hongfu Liu, Junxiang Chen, Jennifer Dy and Yun Fu Transforming Complex Problems into K-means Solutions. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI-Survey), 2023. Han Yue, Pengyu Hong and Hongfu Liu Graph-Graph Similarity Network. IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 2022. Mingyu Wan, Han Yue; Jaime Notarangelo, Hongfu Liu and Fanglin Che Deep Learning Assisted Investigation of Electric Field-Dipole Effects on Catalytic Ammonia Synthesis.JACS Au, 2022. Wenguang Wang, Wenhong Wang and Hongfu Liu Correlation Guided Ensemble Clustering for Hyperspectral Band Selection.Remote Sensing (RS), 2022. Zihao Wang, Kun Li, Steve Xia and Hongfu Liu Economic Recession Prediction Using Deep Neural Network.The Journal of Financial Data Science (JFDS), 2021. Han Yue, Hongfu Liu and Jian Chen A Gospel for MOBA Game: Ranking-Preserved Hero Change Prediction in Dota 2.IEEE Transactions on Games (TC), 2021. Kai Li, Hongfu Liu, Yulun Zhang, Kunpeng Li and Yun Fu Self-guided Deep Multi-view Subspace Clustering via Consensus Affinity Regularization.IEEE Transactions on Cybernetics (TC), 2021. Hangyu Du, Feng Chen, Hongfu Liu and Pengyu Hong Network-based Virus-Host Interaction Prediction with Application to SARS-CoV-2.Patterns, 2021. Xiaochen Lv, Wenhong Wang and Hongfu Liu Cluster-Wise Weighted NMF for Hyperspectral Images Unmixing with Imbalanced Data.Remote Sensing (RS), 2021. Jun Li, Hongfu Liu, Zhiqiang Tao, Handong Zhao and Yun Fu Learnable Subspace Clustering. IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 2020. Wenhong Wang and Hongfu Liu Deep Nonnegative Dictionary Factorization for Hyperspectral Unmixing. Remote Sensing (RS), 2020. Wenhong Wang, Yuntao Qian and Hongfu Liu Multiple Clustering Guided Nonnegative Matrix Factorization for Hyperspectral Unmixing. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing (JSTARS), 2020. Xue Li, Hongfu Liu, and Bin Zhu Evolutive Preference Analysis with Online Consumer Ratings. Information Sciences (IS), 2020. Hongfu Liu, Jun Li, Yue Wu and Yun Fu Clustering with Outlier Removal. IEEE Transactions on Knowledge and Data Engineering (TKDE), 2019. Zhiqiang Tao, Hongfu Liu, Huazhu Fu and Yun Fu Multi-View Saliency-Guided Clustering for Image Cosegmentation. IEEE Transactions on Image Processing (TIP), 2019. Weiren Yu, Zhengming Ding, Chunming Hu and Hongfu Liu Knowledge ReusedOutlier Detection. IEEE Access, 2019. Zhiqiang Tao, Hongfu Liu, Sheng Li, Zhengming Ding and Yun Fu Marginalized Multi-View Ensemble Clustering. IEEE Transactions on Neural Networks and Learn-ing Systems (TNNLS), 2019. Deqing Wang, Chenwei Lu, Junjie Wu, Hongfu Liu, Wenjie Zhang and Fuzhen Zhuang Softly Associative Transfer Learning for Cross-domain Classification. IEEE Transactions on Cybernetics (TC), 2019. Hongfu Liu, Ming Shao and Yun Fu Feature Selection with Unsupervised Consensus Guidance. IEEE Transactions on Knowledge and Data Engineering (TKDE), 2018. Zhiqiang Tao, Hongfu Liu, Sheng Li, Zhengming Ding and Yun Fu Robust Spectral Ensemble Clustering via Rank Minimization. ACM Transactions on Knowledge Discovery from Data (TKDD), 2018. Yue Wu, Hongfu Liu, Jun Li and Yun Fu Improving Face Representation Learning with Center Invariant Loss. Image and Vision Computing (IVC), 2018. Hongfu Liu, Ming Shao, Zhengming Ding and Yun Fu Structure-Preserved Unsupervised Domain Adaptation. IEEE Transactions on Knowledge and Data Engineering (TKDE), 2018. Joseph Robinson, Ming Shao, Yue Wu, Hongfu Liu, Timothy Gillis and Yun Fu Visual Kinship Recognition of Families in the Wild. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2018. Hongfu Liu and Yun Fu Consensus Guided Multi-View Clustering. ACM Transactions on Knowledge Discovery from Data (TKDD), 2018. Xue Li and Hongfu Liu Greedy Optimization for K-means-based Consensus Clustering. Tsinghua Science and Technology (TST), 2018. Hongfu Liu, Zhiqiang Tao and Yun Fu Partition Level Constrained Clustering. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2017. Hongfu Liu, Ming Shao, Sheng Li and Yun Fu Infinite Ensemble Clustering. Data Mining and Knowledge Discovery (DMKD), 2017. Hongfu Liu, Junjie Wu, Tongliang Liu, Dacheng Tao and Yun Fu Spectral Ensemble Clustering via Weighted K-means: Theoretical and Practical Evidence. IEEE Transactions on Knowledge and Data Engineering (TKDE), 2017. Hongfu Liu, Rui Zhao, Hongsheng Fang, Feixiong Chen, Yun Fu and Yuyang Liu Entrpoy-based Consensus Clustering for Patient Stratfcation. Bioinformatics (BIOINF), 2017. Handong Zhao, Hongfu Liu, Zhengming Ding and Yun Fu Consensus Regularized Multi-View Outlier Detection. IEEE Transactions on Image Processing (TIP), 2017. Junjie Wu, Ziang Wu, Jie Cao, Hongfu Liu, Guoqing Chen and Yanchuan Zhang Fuzzy Consensus Clustering with Applications on Big Data. IEEE Transactions on Fuzzy Systems (TFS), 2017. Junjie Wu, Hongfu Liu, Hui Xiong, Jie Cao and Jian Chen K-means-based Con-sensus Clustering: A Unifeded View. IEEE Transactions on Knowledge and Data Engineering (TKDE), 2015. Junjie Wu, Shiwei Zhu, Hongfu Liu and Guoping Xia Cosine Interesting Pattern Discovery. Information Sciences (IS), 2012. Anshuman Chhabra, Peizhao Li, Prasant Mohapatra, and Hongfu Liu “What Data Benefits My Classifier?” Enhancing Model Performance and Interpretability through Influence-Based Data Selection. International Conference on Learning Representations (ICLR), 2024. Zizhang Chen, Peizhao Li, Hongfu Liu and Pengyu Hong Characterizing the Influence of Graph Elements. International Conference on Learning Representations (ICLR), 2023. Anshuman Chhabra, Peizhao Li, Prasant Mohapatra and Hongfu Liu Robust Fair Clustering: A Novel Fairness Attack and Defense Framework. International Conference on Learning Representations (ICLR), 2023. Haiyi Mao, Hongfu Liu, Jason Xiaotian Dou, and Panayiotis V. Benos. Towards Cross-Modal Causal Structure and Representation Learning. Machine Learning for Health Workshop, 2022. Chunhui Zhang, Hongfu Liu, Jundong Li, Yanfang Ye and Chuxu Zhang Contrastive Graph Few-Shot Learning. NeurIPS GLFrontiers Workshop, 2022. Han Yue, Chunhui Zhang, Chuxu Zhang and Hongfu Liu Label-invariant Augmentation for Semi-Supervised Graph Classification. Neural Information Processing Systems (NeurIPS), 2022. Han Yue, Steve Xia and Hongfu Liu Multi-task Envisioning Transformer-based Autoencoder for Corporate Credit Rating Migration Early Prediction. ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD), 2021. Peizhao Li and Hongfu Liu Achieving Fairness at No Utility Cost via Data Reweighing. International Conference on Machine Learning (ICML), 2022. Peizhao Li, Pu Wang, Karl Berntorp and Hongfu Liu Exploiting Temporal Relations on Radar Perception for Autonomous Driving. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2022. Songyao Jiang, Hongfu Liu, Yue Wu and Yun Fu Spatially Constrained GAN for Face and Fashion Synthesis. IEEE International Conference on Automatic Face and Gesture Recognition (FG), 2021. Wenxiao Xiao, Zhengming Ding and Hongfu Liu Implicit Semantic Response Alignment for Partial Domain Adaptation. Neural Information Processing Systems (NeurIPS), 2021. Xiaoying Xing, Hongfu Liu, Chen Chen and Jundong Li Fairness-A",
  "content_length": 18935,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:54"
}