{
  "name": "Hongtu Zhu",
  "homepage": "https://www.med.unc.edu/bigs2",
  "status": "success",
  "content": "Home - BIG-S2 Skip to main content Biostatistics and Imaging Genomics analysis lab – Statistics & Signal BIG-S2 Search_for: Search Search this site Search UNC School of Medicine Welcome to the BIG-S2 Group We have diverse interests in developing novel statistical methods for challenging issues in real applications and solving their underlying methodological issues in statistics. Our past and present statistical projects include diagnostic measures, stochastic approximation algorithm, functional data analysis，deep learning methods， structural equation models, mixed effect models, spline regression, reinforcement learning, missing data problems, causal inference, variable selections, empirical likelihood, mixture models and regression tree. We have developed methods and software for the analysis of the data from a state-of-the-art magnetic resonance imaging (MRI) technique including MRI, functional MRI, and diffusion tensor image. We have developed and enhanced tools in data mining, deep learning, reinforcement learning, machine learning, Monte Carlo method, causal inference, and statistical modeling, and applied them to scientific problems to understand the function and structure of different organs (e.g., brain or heart). Our collaborators and we work closely to study healthy subjects and diseased patients. functional MRI activity We have been working on integrating the genomic, epigenetic, proteomic, and metabolic information to try to understand the biological mechanisms behind various phenotypes. We work closely with biologists, clinicians, oncologists to study the genetic driver events for disease diagnosis, prognosis, and tumor evolutions. Biomedical Research Imaging Center Useful LinksHighlighted Publications Reinforcement Learning SeminarTony Qin, DiDi AI Labs: Deep Reinforcement Learning in a Ride-sharing Marketplace (Oct. 7, 2020) Knowledge Portal Brain Imaging Genetics Knowledge Portal (BIG-KP): Genetics Discoveries in Human Brain by Big Data Integration. BIG-S2 Github Recent software packages. ARL Seminar Bilibili Channel ARL Seminar Youtube Channel Usefule Sites: UNC BIOS UNC BRIC UK BioBank ADNI ABCD HCP GTEx CommonMind Free website hit counter",
  "content_length": 2195,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:58"
}