{
  "name": "Hongbin Shen",
  "homepage": "http://www.csbio.sjtu.edu.cn",
  "status": "success",
  "content": "ä¸æµ·äº¤éå¤§å­¦-æ²çº¢æ-æ¨¡å¼è¯å«ä¸çç©ä¿¡æ¯å­¦ç ç©¶ç» Online Services ç ç©¶ç»æ¦åµä¸æµ·äº¤éå¤§å­¦æ¨¡å¼è¯å«ä¸çç©ä¿¡æ¯å­¦ç ç©¶ç»çç ç©¶éç¹æ¯æ¨¡å¼è¯å«ä¸äººå·¥æºè½åºç¡çè®ºç®æ³åå ¶å¨çç©å»å­¦å¤§æ°æ®å»ºæ¨¡ä¸­çåºç¨ï¼åå±å¤æé®é¢é©±å¨çæ°çè®ºä¸ç®æ³ï¼æ¢ç´¢ä¿¡æ¯ä¸çå½å­¦ç§äº¤åç ç©¶çæ°æ¹æ³ãç ç©¶ç»æ¹åäººå·¥æºè½ä¸æ¨¡å¼è¯å«åºç¡çè®ºæºå¨å­¦ä¹ ç®æ³ä¸åºç¨çç©ä¿¡æ¯å­¦èç½è´¨ä¸RNAè®¾è®¡ä¸åæå·¥ç¨çç©å»å­¦å¾åå¤çå¤æç½ç»ä¸çç©å»å­¦å¤§æ°æ®ææç ç©¶ç»å¨æRNA-binding proteins (RBPs) play crucial roles in many biological processes, and computationally identifying RNA-RBP interactions provides insights into the biological mechanism of diseases associated with RBPs.To make the RBP-specific deep learning-based RBP binding sites prediction methods easily accessible, we developed an updated easy-to-use webserver, RBPsuite 2.0, with an updated web interface for predicting RBP binding sites from linear and circular RNA sequences.RBPsuite 2.0 has a higher coverage on the number of supported RBPs and species compared to the original RBPsuite, supporting an increased number of RBPs from 154 to 353 and expanding the supported species from one to seven. This study is published in BMC Biology, 2025.Traditional alignment-based methods are designed for precise pairwise comparisons, offering high accuracy. However, they face challenges when searching within large databases. In response to this challenge, we propose a novel deep-learning approach FoldExplorer. It harnesses the powerful capabilities of graph attention neural networks and protein large language models for both protein structures and sequences data processing to generate embeddings for protein structures. FoldExplorer demonstrates excellent performance in both protein geometric similarity search and fold-type classification tasks. Notably, it remains effective even when handling low-confidence predicted structures. Moreover, FoldExplorer is highly efficient when searching large-scale databases. Its ability to generate accurate embedding spaces enables a comprehensive view of the protein structure landscape, offering novel insights into clustering and boundaries within the protein universe.RNA velocity is closely related with cell fate and is an important indicator for the prediction of cell states with elegant physical explanation derived from single-cell RNA-seq data. Motivated by the finding that RNA velocity could be driven by the transcriptional regulation, we propose TFvelo, which expands RNA velocity concept to various single-cell datasets without splicing information, by introducing gene regulatory network information. Experiments on synthetic data, scRNA-Seq and MERFISH data demonstrate that TFvelo can model the gene dynamics, infer cell pseudo-time and trajectory, and also detect the key TF-target regulation simultaneously. This study is published in Li et.al, Nature Communications, 2024.Spatial transcriptomics data can provide high-throughput gene expression profiling and the spatial structure of tissues simultaneously. Taking advantage of spatial transcriptomics and graph neural networks, we introduce cell clustering for spatial transcriptomics data with graph neural networks, an unsupervised cell clustering method based on graph convolutional networks to improve ab initio cell clustering and discovery of cell subtypes based on curated cell category annotation. On the basis of its application to five in vitro and in vivo spatial datasets, we show that CCST outperforms other spatial clustering approaches on spatial transcriptomics datasets and can clearly identify all four cell cycle phases from multiplexed error-robust fluorescence in situ hybridization data of cultured cells. This study is published in Li et.al, Nature Computational Science, 2022.The large language model can capture intrinsic correlations and biological knowledge with massive pre-training sequences through self-supervised learning, It presents big opportunities for exploring and identifying key functional regions, specific structural features, mutation sites, and other crucial areas on protein sequences. NLSExplorer utilizes A2KA to establish connections between protein nuclear localizations and language models, effectively transferring pre-trained representations and nuclear localization information to the task of predicting NLSs through attention mechanisms. We utilize NLSExplorer to detect potential NLSs on Swiss-Prot database and build a map called the NLS Candidate Library, an online interactive map with global and local search function, shedding light on the potential universe of NLSs. This study is available at https://doi.org/10.1101/2024.08.10.606103.GraphBind is a webserver designed for structure-based nucleic acid- and small ligand-binding residues prediction. GraphBind consists of two modules: 1) Constructing graphs based on structure, which integrates the local neighborhood around residues to construct graphs. Figure 1 shows the flowchart of constructing a graph based on structure context in GraphBind. 2) The hierarchical graph neural networks (HGNNs), which progressively updates the edge features, node features and graph features, and further learns high-level features for classifying the binding residues. This study is published in Xia et.al, Nucleic Acids Research, 2021.Transmembrane proteins (TMPs) play important roles in many biological processes. Their structures are crucial for revealing complex functions but are hard to obtain. In this study, we mainly focus on Î±-helical TMP and develop a multiscale deep learning pipeline, MemBrain 3.0, to improve topology prediction. This new protocol includes two submodules. The first module is transmembrane helix (TMH) prediction, which features the capability of accurately predicting TMH with the tail part through the incorporation of tail modeling. The second module is orientation prediction, which consists of a support vector machine classifier and a new Max-Min assignment strategy. The study is published in Journal of Molecular Biology, 2019.We used immunohistochemistry images from the Human Protein Atlas as the source of subcellular location information, and built classification models for the complex protein spatial distribution in normal and cancerous tissues. The models can automatically estimate the fractions of protein in different subcellular locations, and can help to quantify the changes of protein distribution from normal to cancer tissues. In addition, we examined the extent to which different annotated protein pathways and complexes showed similarity in the locations of their member proteins, and then predicted new potential proteins in these networks. This study is published in Bioinformatics, 2019.We have developed the AIR software, which is an Artificial Intelligence-based protein 3D structure Refinement method. AIR is constructed using a multi-objective particle swarm optimization(PSO) protocol. We use multiple energy functions as multi-objectives so as to correct the potential inaccuracy from a single function. Given several initial 3D models for one sequence, AIR takes each initial structure as the particle, with the process of structure refinement, the particles will also move around. The quality of current particles (structures) will be evaluated by three energy functions, and the non-dominated particles will be put into a set called Pareto set. After the iteration converges, the particles from the Pareto set will be screened and part of them will be outputted, which are the final refined structures. The AIR is published in Bioinformatics, 2019.We propose a new network structural similarity metric-based clustering protocol NCEM for clustering the noisy cryo-EM images. We first construct an image complex network for all the cryo-EM single particle images, where each image is represented as a node in the network. Then the similarity between two images is refined from network structural geometry. By extending the similarity measurement from two independent images to their corresponding neighbored sets in the network, this new NCEM has typical advantages over direct measurement of two images for its noise resistance by using the structural information of the network. This study is published in Yin et.al, Journal of Chemical Information and Modeling, 2019.We develop a new annotator for the fruit fly embryonic images, AnnoFly. Driven by an attention-enhanced RNN model, it can weigh images of different qualities, so as to focus on the most informative image patterns. We assess the new model on three standard data sets. The experimental results reveal that the attention-based model provides a transparent approach for identifying the important images for labeling, and it substantially enhances the accuracy compared with the existing annotation methods, including both single-instance and multi-instance learning methods. This study is published in Yang et.al, Bioinformatics, 2019.We propose a deep learning-based method, iDeepS, to simultaneously identify the binding sequence and structure motifs from RNA sequences using convolutional neural networks (CNNs) and a bidirectional long short term memory network (BLSTM). We first perform one-hot encoding for both the sequence and predicted secondary structure, to enable subsequent convolution operations. To reveal the hidden binding knowledge from the observed sequences, the CNNs are applied to learn the abstract features. Considering the close relationship between sequence and predicted structures, we use the BLSTM to capture possible long range dependencies between binding sequence and structure motifs identified by the CNNs. Finally, the learned weighted representations are fed into a classification layer to predict the RBP binding sites. This study is published in Pan et.al, BMC Genomics, 2018. How to measure the resolution of a reconstructed",
  "content_length": 15131,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:51"
}