{
  "name": "Hongfei Fu 0001",
  "homepage": "http://jhc.sjtu.edu.cn/~hongfeifu",
  "status": "success",
  "content": "Hongfei Fu's Homepage Hongfei Fu Associate Professor (Tenure-Track) at the John Hopcroft Center for Computer Science, Shanghai Jiao Tong University. Contact: Email: \"fuhf\"+\"at\"+\"cs.sjtu.edu.cn\" Office: Room 1408-1, Software Expert Building, Shanghai Jiao Tong University Post: Room 1408-1, Software Expert Building, No. 800 Dongchuan Road, Minhang District, Shanghai 200240, China Research Interest My primary interest includes programming language and formal verification in a broad sense. PhD Thesis Verifying Probabilistic Systems: New Algorithms and Complexity Results [link], RWTH Aachen, Germany Teaching Python Programming (Fall 2024 -- 2025, bachelor course) Foundations of Programming Languages (Spring 2018 -- 2021, graduate course) [slides] Discrete Mathematics (Fall 2018 -- 2023, bachelor course, notes under update) [Propositional Logic] [Propositional Logical Equivalence and Satisfiability] [Predicate Logic] [Normal Forms] [Inference Rules] [Basics of Set Theory] [Relations] [Equivalence Relations and Partial Orders] [Closure of Relations] [Functions and Equinumerosity] [First Order Logic] [Basics of Graphs] [Bipartite Graphs and Graph Isomorphism] [Connectivity, Paths and Circuits] [Euler Paths and Circuits] [Hamilton Paths and Circuits] [Trees] [Minimal Spanning Trees] [Inclusion-Exclusion Principle] [Planar Graphs and Graph Coloring] [Huffman Coding] Program Analysis and Verification (Spring 2020, bachelor course, co-taught with Prof. Yuting Chen) Model Checking (Spring 2022 -- 2025 , bachelor course, notes under update) [Background and Mathematical Models] [Parallelism and Communication] [Linear Time Properties A] [Linear Time Properties B] [Linear Time Properties C] [Finite Automata] [Automata on Infinite Words] [Model Checking Regular Linear-Time Properties] [Linear Temporal Logic A] [Linear Temporal Logic B] [Linear Temporal Logic C] [Linear Temporal Logic D] [Computation Tree Logic A] [Computation Tree Logic B] [Equivalence on Transition Systems] [Partition Refinement Algorithms] [Partial Order Reduction A] [Partial Order Reduction B] [Partial Order Reduction C] Publications Probabilistic Programming Piecewise Analysis of Probabilistic Programs via k-Induction ACM-SIGACT Symposium on Principles of Programming Languages. POPL 2026, conditionally accepted (CCF Rank A, Top Conference in Programming Languages) (with Tengshun Yang, Shenghua Feng, Naijun Zhan, Jingyu Ke and Shiyang Wu) Structural Abstraction and Refinement for Probabilistic Programs [Link] Proceedings of the 40th ACM SIGPLAN International Conference on Object-Oriented Programming Systems, Languages, and Applications. OOPSLA 2025 (CCF Rank A, Top Conference in Programming Languages) (with Guanyan Li, Juanen Li, Zhilei Han, Peixin Wang, and Fei He) Static Posterior Inference of Bayesian Probabilistic Programming via Polynomial Solving [arXiv] [Link] Proceedings of the ACM on Programming Languages, vol. 8(PLDI) PLDI 2024 (CCF Rank A, Top Conference in Programming Languages) (with Peixin Wang, Tengshun Yang, Guanyan Li and Prof. C.-H. Luke Ong) Automated Tail Bound Analysis for Probabilistic Recurrence Relations [arXiv] [Link] Proceedings of the 35th International Conference on Computer Aided Verification CAV 2023 (CCF Rank A, Top Conference in Formal Verification) (with Yican Sun, Prof. Krishnendu Chatterjee and Amir Kafshdar Goharshady) Quantitative analysis of assertion violations in probabilistic programs [arXiv] [Link] Proceedings of the 42nd ACM SIGPLAN International Conference on Programming Language Design and Implementation PLDI 2021 (CCF Rank A, Top Conference in Programming Languages) (with Jinyi Wang, Yican Sun, Prof. Krishnendu Chatterjee, Amir Kafshdar Goharshady) Proving Expected Sensitivity of Probabilistic Programs with Randomized Variable-Dependent Termination Time [arXiv] [Link] Proceedings of the 47th Annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages POPL 2020 (CCF Rank A, Top Conference in Programming Languages) (with Peixin Wang, Prof. Krishnendu Chatterjee, Prof. Yuxin Deng and Ming Xu) Modular Verification for Almost-Sure Termination of Probabilistic Programs [Link] [arXiv] [Full Version] ACM SIGPLAN International Conference on Object-Oriented Programming Systems, Languages, and Applications OOPSLA 2019 (CCF Rank A, Top Conference in Programming Languages) (with Mingzhang Huang, Prof. Krishnendu Chatterjee and Amir Kafshdar Goharshady) Cost analysis of nondeterministic probabilistic programs [link] [arXiv] Proceedings of the 40th ACM SIGPLAN Conference on Programming Language Design and Implementation PLDI 2019 (CCF Rank A, Top Conference in Programming Languages) (with Peixin Wang, Amir Kafshdar Goharshady, Prof. Krishnendu Chatterjee, Xudong Qin and Wenjun Shi) Termination of Nondeterministic Probabilistic Programs [link] [arXiv] Verification, Model Checking, and Abstract Interpretation - 20th International Conference VMCAI 2019 (CCF Rank B) (with Prof. Krishnendu Chatterjee) Algorithmic Analysis of Qualitative and Quantitative Termination Problems for Affine Probabilistic Programs [link] ACM Transactions on Programming Languages and Systems TOPLAS 2018 (CCF Rank A, Top Journal in Programming Languages) (with Prof. Krishnendu Chatterjee, Petr Novotny and Rouzbeh Hasheminezhad) Extended journal version of the conference paper: Algorithmic Analysis of Qualitative and Quantitative Termination Problems for Affine Probabilistic Programs [link] [arXiv] Proceedings of the 43rd Annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages POPL 2016 (CCF Rank A, Top Conference in Programming Languages) New Approaches for Almost-Sure Termination of Probabilistic Programs [link] [arXiv] Programming Languages and Systems - 16th Asian Symposium APLAS 2018 (CCF Rank C) (with Mingzhang Huang and Prof. Krishnendu Chatterjee) Computational Approaches for Stochastic Shortest Path on Succinct MDPs [link] [arXiv] Proceedings of the Twenty-Seventh International Joint Conference on Artificial Intelligence IJCAI 2018 (CCF Rank A) (with Prof. Krishnendu Chatterjee, Amir Kafshdar Goharshady and Nastaran Okati) Automated Recurrence Analysis for Almost-Linear Expected-Runtime Bounds [link] [arXiv] Computer Aided Verification - 29th International Conference CAV 2017 (CCF Rank A, Top Conference in Formal Verification ) (with Prof. Krishnendu Chatterjee and Aniket Murhekar) Termination Analysis of Probabilistic Programs Through Positivstellensatz's [link] [arXiv] Computer Aided Verification - 28th International Conference CAV 2016 (CCF Rank A, Top Conference in Formal Verification) (with Prof. Krishnendu Chatterjee and Amir Kafshdar Goharshady Software Verification A Formal Approach to Multi-Layered Privileges for Enclaves [Link] Proceedings of the 32nd Annual Network and Distributed System Security Symposium. NDSS 2025 (CCF Rank A) (with Ganxiang Yang, Chenyang Liu, Zhen Huang, Guoxing Chen, Yuanyuan Zhang and Haojin Zhu) Affine Disjunctive Invariant Generation with Farkas' Lemma [Link] Proceedings of the 26th International Conference on Verification, Model Checking, and Abstract Interpretation. VMCAI 2025 (CCF Rank B) (with Jingyu Ke, Hongming Liu, Zhouyue Sun, Liqian Chen and Guoqiang Li) Constraint Based Invariant Generation with Modular Operations [Link] Proceedings of the 10th International Symposium on Dependable Software Engineering. Theories, Tools, and Applications SETTA 2024 (CCF Rank C) (with Yuchen Li, Haowen Long and Guoqiang Li) Demystifying Template-Based Invariant Generation for Bit-Vector Programs [Link] Proceedings of the 38th IEEE/ACM International Conference on Automated Software Engineering ASE 2023 (CCF Rank A) (with Peisen Yao, Jingyu Ke, Jiahui Sun, Rongxin Wu and Prof. Kui Ren) Scalable Linear Invariant Generation with Farkas' Lemma [HAL] [Link] Proceedings of the 37th ACM SIGPLAN International Conference on Object-Oriented Programming Systems, Languages, and Applications OOPSLA 2022 (CCF Rank A, Top Conference in Programming Languages) (with Hongming Liu, Zhiyong Yu, Jiaxin Song, Dr. Guoqiang Li) Affine Loop Invariant Generation via Matrix Algebra [HAL] [Link] Proceedings of the 34th International Conference on Computer Aided Verification CAV 2022 (CCF Rank A, Top Conference in Formal Verification) (with Yucheng Ji, Bin Fang and Prof. Haibo Chen) Polynomial reachability witnesses via Stellensaetze [HAL] [Link] Proceedings of the 42nd ACM SIGPLAN International Conference on Programming Language Design and Implementation PLDI 2021 (CCF Rank A, Top Conference in Programming Languages) (with Ali Asadi, Prof. Krishnendu Chatterjee, Hongfei Fu, Amir Kafshdar Goharshady, Mohammad Mahdavi) Polynomial invariant generation for non-deterministic recursive programs [arXiv] [Link] Proceedings of the 41st ACM SIGPLAN International Conference on Programming Language Design and Implementation PLDI 2020 (CCF Rank A, Top Conference in Programming Languages) (with Prof. Krishnendu Chatterjee, Amir Kafshdar Goharshady, Ehsan Kafshdar Goharshady) Non-polynomial Worst-Case Analysis of Recursive Programs [link] ACM Transactions on Programming Languages and Systems TOPLAS 2019 (CCF Rank A, Top Journal in Programming Languages) (with Prof. Krishnendu Chatterjee and Amir Kafshdar Goharshady) Extended journal version of the conference paper: Non-polynomial Worst-Case Analysis of Recursive Programs [link] [arXiv] Computer Aided Verification - 29th International Conference CAV 2017 (CCF Rank A, Top Conference in Formal Verification) Formal Models and Complexity Deciding Probabilistic Simulation between Probabilistic Pushdown Automata and Finite-State Systems [link] Information and Computation IANDC 2019 (CCF Rank A) (with Mingzhang Huang and Prof. Joost-Pieter Katoen) Extended journal version of the conference paper: Deciding Probabilistic Simulation between Probabilistic Pushdown Automata and Finite-State Systems [link] IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Sci",
  "content_length": 12032,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:52"
}