{
  "name": "Hongdong Li",
  "homepage": "http://users.cecs.anu.edu.au/~hongdong",
  "status": "success",
  "content": "Professor Hongdong Li - ANU News & Activities Loading news... Professor Hongdong Li Computer Vision, Machine Learning, AI and Robotic Vision Navigation School of Computing, CSS/CECS (Engineering and Computer Science) Australian National University Email: hongdong.li_ALT_anu.edu.au Office: BAB (RSISE), ANU, Canberra, Australia About Me I am a Full Professor in Computer Vision and Machine Learning @ the Australian National University (ANU). My research interests include AI and machine learning, 3D computer vision, visual perception, VR/AR, robotic navigation and visual foundation models. I was one of the Co-founding CIs (Chief Investigator) for the Australia ARC Centre of Excellence for Robotic Vision ($42 million). I was a Visiting Professor in 2017-2018 with the School of Computer Science of CMU, Carnegie Mellon University, USA. During 2008-2009 I was with NICTA as a Senior Scientist contributing to the Australia Bionic Eyes project (ARC special initiative). I was a Research Fellow/Fellow with the RSISE of ANU between 2003 till 2007, and since then I have had the great privilege of working together with and under the supervision of Professor Richard Hartley for over two decades and for years to come. Jointly with coworkers we won a number of prestigious awards in Computer Vision research, including the CVPR Best Paper Award, Marr Prize (Honourable Mention), IEEE ICPR Best Paper Award, IEEE ICIP Best Student Paper Award, DSTO Best Paper Prize, WACV Best Applied Paper Award, ACL Best Outstanding DEMO Award, and multiple DICTA Best Paper Awards. In IEEE ICRA 2024 our robot SLAM algorithm and system (Mavis) has won the 1st place in the HILTI Visual SLAM Challenge for robot navigation. I am serving as a Senior Area Chair (SAC) for IEEE CVPR 2025, ICCV 2025, NeurlPS 2024 and NeurlPS 2025, and a Senior Program Committee member (Associate Editor) for IEEE ICRA 2022-the top robotics conference. I was the General Co-Chair for ACCV 2022, and Program Co-Chair for ACCV 2018. I served as an Associate Editor for IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI)-the no. 1 top journal in Artificial Intelligence. During 2022-2023 in university leave, as Distinguished Scientist (XR-Lab Chief Scientist) I led the effort of Tencent's XR R&D program. Tencent is the world's leading video game and internet company. Since 2024 I have been with Amazon IML (Machine Learning) as Amazon Scholar on part-time basis (52-day rule), developing Gen-AI techniques for eCommerce and Amazon Stores. My past research projects have been funded by ARC, Ford Motors USA, General Motors USA, Baidu Robotics Lab, Microsoft Research (Redmond and Beijing), Meta Reality Lab, OPPO (via InnoPeak USA), Medicago Canada, CSIRO, MotoVis, KanDAO, Toshiba etc. GoogleScholar CSRanking Students and Alumni PhD Application Research Highlights 3D Scene AI generation Avatar glasses try-on Novel View Synthesis Neural inverse rendering Autonomous vehicle localisation AR, VR and XR Human pose and shape Triplane 3D diffusion Selected Publications Loading publications... For Prospect Students Former students and Alumni PhD Scholarship Application Professional Activities Senior Area Chair for CVPR, ICCV, ECCV, NeurlPS. Associate Editor for IEEE Transactions on Pattern Analysis and Machine Intelligence (IEEE T-PAMI)",
  "content_length": 3326,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:54"
}