{
  "name": "Hong Linh Truong 0001",
  "homepage": "https://research.aalto.fi/en/persons/linh-truong",
  "status": "success",
  "content": "Linh Truong - Aalto University's research portal Contact expert Linh Truong Professor (Associate Professor), Department of Computer ScienceProfessor (Associate Professor), Computer Science ProfessorsProfessor (Associate Professor), Computer Science - Computing Systems (ComputingSystems) - Research area https://orcid.org/0000-0003-1465-9722 20192026 Research activity per year Personal profile Artistic and research interestsI am an associate professor (tenured) at Department of Computer Science at School of Science, Aalto University, Finland. I am leading the AaltoSEA Group on Systems and Services Engineering Analytics. I am also a Priv.-Doz. (Adjunct Associate Professor) at the Faculty of Informatics, TU Wien. For information about my professional work see my current profile here. Google scholar shows up-to-date my citations and here is the list of publications. For my research team, see information about my research team. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): KeywordsCloud computinganalyticssoftware systemsservices computingInternet of Thingsdistributed systemsBig Data Fingerprint Dive into the research topics where Linh Truong is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Machine Learning Computer Science 100% Learning System Computer Science 84% Internet-Of-Things Computer Science 66% Blockchain Computer Science 18% Artificial Intelligence Computer Science 16% Case Study Computer Science 15% Edge Computing Computer Science 15% Mobile Network Computer Science 14% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2019 2019 2021 2022 2024 2025 2026 29 Conference article in proceedings 13 Article 2 Chapter 2 Poster 4 More 2 Preprint 1 Review Article 1 Working paper Research output per year Research output per year Advanced Context-Sensitive Access Management for Edge-Driven IoT Data Sharing as a ServiceNguyen, P., Nguyen, H.-H., Phung, P., Truong, L. & Cheung, T., 25 Apr 2025, In: ACM Transactions on Internet Technology. 25, 2, p. 1-31 31 p., 9.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Data Sharing 100% Access Management 100% Internet-Of-Things 100% Dynamic Context 16% Use Case 8% 2 Citations (Scopus) 164 Downloads (Pure) A Multi-Continuum View for Swarm-Edge-Cloud Service-based ApplicationsTruong, L. & Magoutis, K., 2025.Research output: Working paper › Preprint › Scientific File 25 Downloads (Pure) EADRAN: An Edge Marketplace for Federated LearningCao, T.-D., Nguyen, H.-T., Nguyen, T., Truong-Huu, T. & Truong, L., Feb 2026, In: Future Generation Computer Systems. 175, p. 1-16 16 p., 108046.Research output: Contribution to journal › Article › Scientific › peer-review File Machine Learning 100% Artificial Intelligence 100% Federated machine learning 100% Provider Data 40% Learning System 30% 130 Downloads (Pure) On Optimizing Resources for Real-Time End-to-End Machine Learning in Heterogeneous EdgesNguyen, T. & Truong, L., Mar 2025, In: Software: Practice and Experience. 55, 3, p. 541-558 18 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Machine Learning 100% Learning System 100% Resource Utilisation 33% Resource Demand 16% Hardware Platform 16% 1 Citation (Scopus) 101 Downloads (Pure) Optimizing Multiple Consumer-specific Objectives in End-to-End Ensemble Machine Learning ServingNguyen, T., Truong, L., Arcaini, P. & Ishikawa, F., 23 Apr 2025, Proceedings - 2024 IEEE/ACM 17th International Conference on Utility and Cloud Computing, UCC 2024. IEEE, p. 103-108 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference article in proceedings › Scientific › peer-review Open AccessFile Machine Learning 100% Learning System 100% Search Space 16% Algorithm Selection 16% Dynamic Context 16% 108 Downloads (Pure) View all 50 research outputs Projects Projects per year 2024 2024 2025 2028 1 Finished 1 Not started Projects per year SECASSURED: SECURITY ASSURANCE-DRIVEN SMART SECURITY SERVICES for trustworthy certifiable hardware and softwarTruong, L. (Principal investigator)01/12/2025 → 30/11/2028Project: EU_HEFWP -: Inno4scale NEOSC/TruongTruong, L. (Principal investigator)01/02/2024 → 31/01/2025Project: EU: Other research funding Activities Activities per year 2014 2019 2022 2023 2024 2025 2025 21 Membership of a scientific or program committee of a conference or seminar 7 Reviewer of scientific journal 6 Invited academic talk 4 Pre-examination of doctoral thesis or acting as opponent to doctoral students or membership of doctoral thesis committee or board 13 More 3 Hosting an academic visitor 3 Conference presentation 3 Visiting an external academic institution 1 Chair or participant of a conference, workshop, panel, session, tutorial or event 1 Membership of an editorial board 1 Evaluation of funding applications 1 Academic keynote or plenary lecture Activities per year Tien-Thanh LeTruong, L. (Host)24 Feb 2025 → 22 Mar 2025Activity: Hosting a visitor types › Hosting an academic visitor Fudan UniversityTruong, L. (Visiting researcher)30 Jun 2025 → 18 Jul 2025Activity: Visiting an external institution types › Visiting an external academic institution IEEE Conference on Artificial IntelligenceTruong, L. (Member)2025Activity: Participating in or organising an event types › Chair of a conference, workshop, panel, session, tutorial or event IEEE International Conference on Cloud ComputingTruong, L. (Member)2025 → …Activity: Participating in or organising an event types › Membership of a scientific or program committee of a conference or seminar IEEE International Conference on Big DataTruong, L. (Member)2025Activity: Participating in or organising an event types › Membership of a scientific or program committee of a conference or seminar View all 51 activities Your message has successfully been sent. Your message was not sent due to an error. x Contact Linh Truong Subject:* Message:* Your name:* Your email:* Send me a copy of this message *required field See privacy policy in the footer of the page Cancel Send",
  "content_length": 6711,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:51"
}