{
  "name": "Hongyu Zhang 0002",
  "homepage": "https://sites.google.com/site/hongyujohn",
  "status": "success",
  "content": "Hongyu ZhangSearch this siteEmbedded FilesSkip to main contentSkip to navigationHongyu ZhangPrimary Email Address: hongyujohn@gmail.comGoogle Scholar    DBLP    I am a Professor and Dean of School of Big Data and Software Engineering, Chongqing University, China. I am also an Honorary Professor at The University of Newcastle, Australia. Previously, I worked at Microsoft Research, and Tsinghua University. I received my PhD degree in Computer Science from School of Computing, National University of Singapore in 2003.My research is in the area of software engineering, in particular, intelligent software engineering, software analytics, and software fault management. The main theme of my research is to improve software quality and productivity by mining and analyzing software data.  I am a senior member of IEEE, a Distinguished Member of ACM, a Distinguished Member of CCF, and a Fellow of Engineers Australia (FIEAust). I am a recipient of David Lorge Parnas Fellowship.I am always open for collaborations! Research AreaMy research area is software engineering, in particular:intelligent software engineeringsoftware analytics, data-driven software engineeringsoftware fault management,  quality assurancesoftware maintenance and reuseThe main theme of my research is to improve software quality and productivity by utilizing knowledge mined from software data. Over the years, a software organization could accumulate large amounts of data including source code, bug reports, execution logs, changes, metrics, documents, and so on. Data mining and machine learning (including deep learning) techniques can be applied to extract knowledge from the software data and solve software engineering problems. Together with my students and collaborators, I have published more than 250 research papers in major international journals and conferences.According to two independent studies on Bibliometric Assessment of Software Engineering Scholars (2010-2017, 2013-2020), I am among the top 20 most active experienced researchers in software engineering. I was recognized in The Australian’s Top Researchers special edition (September 2020) as the leading researcher in the field of Software Systems. I am among World’s Top 2% Scientists (career-long). According to a recent study, I also have top 3 publications in premium software engineering conferences (worldwide).PublicationsSome of my publications can be found here. The complete list of  publications are available at:  DBLP and Google Scholar.I received the following ACM SIGSOFT Distinguished Paper/Artifact Awards and Best Paper Awards: ACM Distinguished Paper Award: When to Stop: Towards Efficient Code Generation in LLMs with Excess Token Prevention, Proc.  ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2024), Sep 2024.ACM Distinguished Artifact Award: BARO: Robust Root Cause Analysis for Microservices via Multivariate Bayesian Online Change Point Detection. Proc. International Conference on the Foundations of Software Engineering (FSE 2024), July 2024.ACM Distinguished Paper Award: Modularizing while Training: a New Paradigm for Modularizing DNN Models, the 46th IEEE/ACM International Conference on Software Engineering (ICSE 2024), April 2024.  ACM Distinguished Paper Award: SPINE: a scalable log parser with feedback guidance. Proc. the ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2022), November 2022, pp. 1198–1208.ACM Distinguished Paper Award: An Empirical Study on Program Failures of Deep Learning Jobs, Proc. the 42nd International Conference on Software Engineering (ICSE 2020), June-July 2020, Seoul, South Korea, pp. 1159–1170.ACM Distinguished Paper Award: History-Guided Configuration Diversification for Compile Test-Program Generation, Proc. The 34th IEEE/ACM International Conference on Automated Software Engineering (ASE 2019), San Diego, California, USA, November 2019, pp. 305-316.ACM Distinguished Paper Award: SymCrash: Selective Recording for Reproducing Crashes, Proc. The 29th IEEE/ACM International Conference on Automated Software Engineering (ASE 2014), Västeras, Sweden, September 2014, pp. 791-802.ACM Distinguished Paper Award: CrashLocator: Locating Crashing Faults based on Crash Stacks, Proc. International Symposium on Software Testing and Analysis (ISSTA 2014), San Jose, CA, July 2014, pp. 204-214.Best Paper Award: How Long Will it Take to Mitigate this Incident for Online Service Systems?, Proc. 32nd International Symposium on Software Reliability Engineering (ISSRE 2021), Wuhan, China, Oct 2021, pp. 36-46.Research GrantsAustralian Research Council (ARC) Discovery Project, Intelligent Incident Management for Software-Intensive Systems, Grant No. DP220103044, 2022-2024. (Lead CI)Australian Research Council (ARC) Discovery Project, Data-driven Approach to Resilient Online Service Systems, Grant No. DP200102940, 2020-2022. (Lead CI)NSF China, Project “Software Crash Analysis”, Grant No. 61272089          (PI)NSF China, Project “Software Defect Prediction Models and Applications”, Grant No. 61073006, 2011 – 2013. (PI)NSF China, Project \"Software Customization Techniques\", Grant No. 60703060, 2008-2011. (PI)NSF China, Project \"Software Defect and Failure Prediction Techniques\", Grant No. 90718022, 2008-2011. (PI)National High-tech 863 Project No. 2007AA01Z122, 2008-2010. (Co-PI)National High-tech 863 Project No. 2007AA01Z480, 2008-2010. (Co-PI)The 3rd Tsinghua University Zi-Zhu Research Program, \"Software Quality Measurement and Prediction\", Project ID: 2010THZ0, 2011-2013. (PI)The 6th Key Researcher Support Program, Tsinghua University, 2007-2009. (PI)Tool DevelopmentI am involved in the Microsoft project Developer Assistant, which puts millions of code snippets at your fingertips while you are coding in Visual Studio.   News: Microsoft Blog,  Visual Studio Blog 2, Visual C++ Team BlogBugLocator: locating buggy source code files based on bug reports.ReLink: recovering missing links between fixed bugs and committed changes.XVCL: an XML-based variant configuration language. Log Intelligence: Data-driven, AI-enabled log analytics tools.Program CommitteeThe International Conference on Software Engineering ICSE 2021, ICSE 2024, ICSE 2025 (Technical Track)IEEE/ACM International Conference on Automated Software Engineering (ASE 2015, ASE 2018, ASE 2019, ASE 2020, ASE 2021, ASE 2022, ASE 2023, ASE 2025). The ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2024, ISSTA 2025)The Joint Meeting of the European Software Engineering Conference and the ACM SIGSOFT Symposium on the Foundations of Software Engineering ESEC/FSE 2015 (Industrial Track), FSE 2016  ESEC/FSE 2017, FSE 2018 (artifacts), FSE 2022, FSE 2024, FSE 2025 (research track)International Conference on Machine Learning (ICML 2020 - 2025)International Conference on Learning Representations (ICLR 2020 - 2024) AAAI Conference on Artificial Intelligence (AAAI 2020 - 2024) Annual Conference on Neural Information Processing Systems (NeurIPS 2021 - 2024)The 34th/35th/36th International Conference on Software Engineering ICSE 2012, ICSE 2013 (Formal Demonstration Track), ICSE 2014 (Tutorials and Technical Briefings), ICSE 2020 (artifacts)The IEEE International Conference on Software Maintenance and Evolution (ICSM 2013, ICSME 2014, ICSME’16, ICSME'17, ICSME'18, ICSME'19).The International Conference on Software Analysis, Evolution and Reengineering (SANER 2015,  SANER 2016 , SANER 2017, SANER 2018 (industrial), SANER 2020 (industrial) , SANER 2021 (industrial) , SANER 2023-2025)Working Conference on Mining Software Repositories (MSR 2013, MSR 2014, MSR 2015, MSR 2017, MSR 2020, MSR 2021, MSR 2022)International Symposium on Empirical Software Engineering and Measurement (ESEM 2016 - 2024)The 15th/16th/17th/18th European Conference on Software Maintenance and Reengineering (CSMR 2011, CSMR 2012, CSMR 2013, CSMR-18/WCRE-21).The 5th/6th/7th/8th International Conference on Predictive Models in Software Engineering (PROMISE 2010, PROMISE 2011, PROMISE 2012, PROMISE 2013, PROMISE 2014, PROMISE 2015, PROMISE 2016, PROMISE 2025)The 24th/25th/26th International Conference on Software Engineering and Knowledge Engineering (SEKE 2012, SEKE 2013, SEKE 2014) The joint 10th International Workshop on Principles of Software Evolution and the 5th ERCIM Workshop on Software Evolution (IWPSE/EVOL'09), 24-25 August (co-located with ESEC/FSE 2009), Amsterdam.The 3rd/6th/7th/8th IEEE International Symposium on Theoretical Aspects of Software Engineering (TASE 2009, TASE2012, TASE 2013, TASE 2014)The 15th/16th/17th/18th/19th/20th/21st/22nd/23rd/24th Asia-Pacific Software Engineering Conference (APSEC 2022, APSEC 2017, APSEC2016, APSEC 2015, APSEC 2014, APSEC 2013, APSEC 2012, APSEC 2011, APSEC 2010, APSEC 2009, APSEC 2008) The 17th/18th/19th/20th/22nd/23rd/24th Australian Software Engineering Conference (ASWEC 2018, ASWEC 2015, ASWEC 2014, ASWEC 2013, ASWEC 2010, ASWEC 2009, ASWEC 2008, ASWEC 2007, ASWEC 2006)The 2nd/3rd SEMAT Workshop on a General Theory of Software Engineering (GTSE 2013, GTSE 2014)The International Conference on Software Quality, Reliability and Security (formerly International Conference on Quality Software) (QSIC 2013-2014, QRS 2015-2022)The 38th Annual International Computers, Software & Applications Conference (COMPSAC 2014)The 9th International Conference on Global Software Engineering (ICGSE 2014)The 24th International Conference on Program Comprehension (ICPC 2016)The International Workshop on Software Engineering Research and Industrial Practice (SER&IP 2016, SER&IP 2017)The Asian Conference on Pattern Languages of Programs (AsianPLoP 2014, 2015, 2016, 2017)The IEEE Working Conference on Software Visualization (VISSOFT 2017)International Workshop on Blockchain Oriented Software Engineering (IWBOSE 2018 - 2022)The Asia-Pacific Symposium on Internetware (Internetware 2016, 2017, 2018)The Annual Conference ",
  "content_length": 18024,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:01"
}