{
  "name": "Hongyuan Liu 0002",
  "homepage": "https://www.liuhongyuan.com",
  "status": "success",
  "content": "Hongyuan Liu Hongyuan Liu Email: hliu96 at stevens edu Office: Gateway Center N416 I am an assistant professor at Stevens Institute of Technology. I work in the areas of computer architecture and parallel computing. I obtained my Ph.D. degree at William & Mary advised by Adwait Jog. I received my M.Sc. degree at the University of Hong Kong working with Cho-Li Wang, and my B.Eng. degree from Shandong University. I am looking for self-motivated students interested in research in high-performance computing, systems, and compilers. Both PhD positions and research assistantships are available. If you are interested, please email me your CV and briefly explain your motivation and research interests. Research ROME: Maximizing GPU Efficiency for All-Pairs Shortest Path via Taming Fine-Grained Irregularities. Weile Luo, Yuhan Chen, Xiangrui Yu, Qiang Wang, Ruibo Fan, Hongyuan Liu, Xiaowen Chu. PPoPP 2026 Advancing Matrix Operations for High-Performance and Memory-Efficient Automata Processing on GPUs. Zhenlin Wu, Tianao Ge, Jiajia Li, Xinyu Chen, Hongyuan Liu. TACO 2025 Interleaved Bitstream Execution for Multi-Pattern Regex Matching on GPUs. Tianao Ge, Xiaowen Chu, Hongyuan Liu. MICRO 2025 VESTA: A Secure and Efficient FHE-based Three-Party Vectorized Evaluation System for Tree Aggregation Models. Haosong Zhao, Junhao Huang, Zihang Chen, Kunxiong Zhu, Donglong Chen, Zhuoran Ji, Hongyuan Liu. SIGMETRICS 2025 gHyPart: GPU-friendly End-to-End Hypergraph Partitioner. Zhenlin Wu, Haosong Zhao, Hongyuan Liu, Wujie Wen, Jiajia Li. TACO 2025 Towards Scalable and Non-blocking Automata Processing on GPUs with ngAP. Tianao Ge, Tong Zhang, Hongyuan Liu. TOCS 2025 Efficient Point Cloud Analytics on Edge Devices. Kunxiong Zhu, Zhenlin Wu, Hongyuan Liu. ICPADS 2024 ngAP: Non-blocking Large-scale Automata Processing on GPUs. Tianao Ge, Tong Zhang, Hongyuan Liu. ASPLOS 2024 [Best Paper Award] [Artifact] Asynchronous Automata Processing on GPUs. Hongyuan Liu, Sreepathi Pai, Adwait Jog. SIGMETRICS 2023 Accelerating DNN Architecture Search at Scale Using Selective Weight Transfer. Hongyuan Liu, Bogdan Nicolae, Sheng Di, Franck Cappello, Adwait Jog. CLUSTER 2021 Why GPUs are Slow at Executing NFAs and How to Make them Faster. Hongyuan Liu, Sreepathi Pai, Adwait Jog. ASPLOS 2020 [Full Talk] Analyzing and Leveraging Remote-core Bandwidth for Enhanced Performance in GPUs. Mohamed Assem Ibrahim, Hongyuan Liu, Onur Kayiran, Adwait Jog. PACT 2019 Architectural Support for Efficient Large-Scale Automata Processing. Hongyuan Liu, Mohamed Assem Ibrahim, Onur Kayiran, Sreepathi Pai, Adwait Jog. MICRO 2018 [Lightning Talk] [Slides] On-GPU Thread-Data Remapping for Branch Divergence Reduction. Huanxin Lin, Cho-Li Wang, Hongyuan Liu. TACO 2018 Lightweight Dependency Checking for Parallelizing Loops with Non-deterministic Dependency on GPU. Hongyuan Liu, King Tin Lam, Huanxin Lin, Cho-Li Wang, Junchao Ma. ICPADS 2016 * Names with underlines indicate students I advised. Teaching UFUG2601: C++ Programming (Fall 2024, Fall 2023, co-teach with Prof. Yangdi Lyu) MICS6000R: Advanced Compilers (Spring 2023, Fall 2024) MICS6000J: GPU Architectures and Programming (Fall 2023, Fall 2022)",
  "content_length": 3193,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:02"
}