{
  "name": "Hongbo Liu 0002",
  "homepage": "https://faculty.uestc.edu.cn/liuhongbo/en/index.htm",
  "status": "success",
  "content": "liuhongbo Home çµå­ç§æå¤§å­¦ä¸»é¡µå¹³å°ç®¡çç³»ç» University of Electronic Science and Technology of China Home Scientific Research Research Projects Published Books Patents Paper Publications Research Field Teaching Research Teaching Achievement Teaching Information Teaching Resources Awards and Honours Enrollment Information Student Information My Album Blog ä¸­æ Click: åé¸¿å PersonalProfile Personalinformation EducationExperience WorkExperience ResearchFocus SocialAffiliations ResearchGroup Other ContactInformation Personal Profile Hongbo Liu (Ph.D., Doctoral supervisor) is a Professor of School of Computer Science and Engineering (School of Cybersecurity) at University of Electronic Science and Technology of China since 2020. Before that he was an Associate Professor in the Department of Computer Information and Technology at Indiana University-Purdue University Indianapolis (IUPUI), USA. He obtained his Ph.D degree from the Department of Electrical and Computer Engineering at Stevens Institute of Technology under the supervision of Professor Yingying Chen (ACM Fellow, IEEE Fellow, NAI Fellow). He had both his Master and Bachelor Degree from University of Electronic Science and Technology of China in 2008 and 2005, respectively. He has published over 100 journal articles and referred conference papers, including ACM MobiCom, IEEE TMC, IEEE INFOCOM, etc. He is also the recipient of the Best Paper Award from ACM MobiCom 2011, Best Paper Runner-up Award from IEEE CNS 2013, Best Paper Award from IEEE CNS 2018, and Best Paper Runner-up Award from IEEE MASS 2023. His research has been sponsored by National Science Foundation of China, National Key R&D Program, and National Science Foundation of USA, and his research interests include:Wireless SecurityIntelligent Sensing and Uniquitous ComputingArtificial Intelligence of ThingsData Security and Privacy PreservingSelected Publications (Full list refers to Google Scholar): Books and Contributed Chapters:Hongbo Liu, Yingying Chen, Yan Wang, Jian Liu, âChapter 9: Proactive User Authentication Using WiFi Signals in Dynamic Networksâ, in Advanced Information Security, Proactive and Dynamic Network Defense, Vol. 74, 978-3-030-10596-9, Springer.Journal Publications:Jian Liu, Hongbo Liu, Yingying Chen, Yang Wang, Chen Wang, âWireless Sensing for Human Activity: A Surveyâ, IEEE Communications Surveys and Tutorials, July, 2020.Tianming  Zhao, Jian Liu, Yan Wang, Hongbo Liu, Yingying Chen, \"Towards Low-cost Sign Language Gesture Recognition Leveraging Wearables\", IEEE Transactions on Mobile Computing (IEEE TMC), 2020.Li Lu, Jiadi Yu, Yingying Chen, Hongbo Liu, Yanmin Zhu, Linghe Kong, Minglu Li, \"Lip Reading-Based User Authentication Through Acoustic Sensing on Smartphones\", IEEE/ACM Transactions on Networking (ToN), vol. 27, no. 1, pp. 447-460, Feb. 2019.Xiaonan Guo, Cong Shi, Jian Liu, Hongbo Liu, Yingying Chen, Mooi Choo Chuah, âDevice-free Personalized Fitness Assistant Using WiFiâ, PACM on Interactive, Mobile, Wearable, and Ubiquitous Computing (IMWUT), 2019.Chuyu Wang, Jian Liu, Yingying Chen, Lei Xie, Hongbo Liu, Sanglu Lu, âRF-Kinect: A Wearable RFID-based Approach Towards 3D Body Movement Trackingâ, PACM on Interactive, Mobile, Wearable, and Ubiquitous Computing (IMWUT), 2018.Hongbo Liu, Yan Wang, Jian Liu, Jie Yang, Yingying Chen, Vincent H. Poor, âAuthenticating Users through Fine-grained Channel Informationâ, IEEE Transactions on Mobile Computing (IEEE TMC), vol 17, Issue 2, Pages 251-264, 2018.Hongbo Liu, Yingying Chen, Mooi Choo Chuah, Jie Yang, Vincent H. Poor, âEnabling Self-healing Smart Grid Through Jamming Resilient Local Controller Switchingâ, IEEE Transactions on Dependable and Secure Computing (IEEE TDSC), vol 14, issue 4, pp. 377-391, 2017.Yan Wang, Jie Yang, Yingying Chen, Marco Gruteser, Richard P. Martin, Hongbo Liu, âDetermining Driver Phone Use by Exploiting Smartphone Integrated Sensorsâ, IEEE Transactions on Mobile Computing (IEEE TMC), vol. 15, Issue 8, pp 1965-1981, 2016.Hongbo Liu, Jie Yang, Simon Sidhom, Yan Wang, Yingying Chen, Fan Ye, âAccurate WiFi Based Localization for Smartphones Using Peer Assistanceâ, IEEE Transactions on Mobile Computing (IEEE TMC), vol.13, no.10, pp.2199-2214, 2014. Hongbo Liu, Jie Yang, Yan Wang, Yingying Chen, Can Emre Koksal, \"Group Secret Key Generation via Received Signal Strength: Protocols, Achievable Rates, and Implementation\", IEEE Transactions on Mobile Computing (IEEE TMC), no. 1, pp. 1, 2014. Wenlin Zhang, Yi Guo, Hongbo Liu, Yingying Chen, Zheng Wang, and Joseph Mitola III, \"Distributed Consensus-based Weight Design for Cooperative Spectrum Sensing\", IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS), vol.PP, no.99, pp.1-1, 2014.Zhenhua Liu, Hongbo Liu, Wenyuan Xu, and Yingying Chen, \"An Error Minimizing Framework for Localizing Jammers in Wireless Networks\", IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS)-Special Issue, 2014.Xiuyuan Zheng, Hongbo Liu, Jie Yang, Yingying Chen, Richard P. Martin, and Xiaoyan Li, \"A Study of Localization Accuracy using Multiple Frequencies and Powers\", IEEE Transactions on Parallel and Distributed Systems (IEEE TPDS), Volume: 25, Issue: 8, Pages 1955-1965, 2014.Jie Yang, Simon Sidhom, Gayathri Chandrasekaran, Tam Vu, Hongbo Liu, Nicolae Cecan, Yingying Chen, Marco Gruteser, Richard P. Martin, \"Sensing Driver Phone Use with Acoustic Ranging Through Car Speakers\", IEEE Transactions on Mobile Computing (IEEE TMC), Volume 11, No.9, Pages 1426-1440, 2012.Zhenhua Liu, Hongbo Liu, Wenyuan Xu, and Yingying Chen, âExploiting Jamming-Caused Neighbor Changes for Jammer Localizationâ, IEEE Transaction on Parallel and Distributed Systems (IEEE TPDS), Volume 23, Issue 3, Pages 547-555, 2011.Peer-reviewed Conference Publications: Jian Liu, Cong Shi, Yingying Chen, Hongbo Liu, Marco Grutser, \"CardioCam: Leveraging Camera on Mobile Devices to Verify Users While Their Heart is Pumping\", in Proceedings of ACM International Conference on Mobile Systems, Applications, and Services (ACM MobiSys), 2019.Chen Wang, Jian Liu, Yingying Chen, Hongbo Liu, Yan Wang, âTowards Suspicious In-baggage Object Detection Using Commodity WiFiâ, in Proceedings of IEEE Conference on Communications and Network Security (IEEE CNS), 2018. â Best Paper Award.Tianming Zhao, Jian Liu, Hongbo Liu, Yingying Chen, âPPG-based Finger-level Gesture Recognition Leveraging Wearablesâ, in Proceedings of IEEE International Conference on Computer Communications (IEEE INFOCOM), 2018. (Acceptance rate: 309/1606 = 19.2%)Chuyu Wang, Jian Liu, Yingying Chen, Hongbo Liu, Lei Xie, Bingbing He, Sanglu Lu, âMulti-Touch in the Air: Device-Free Finger Tracking and Gesture Recognition via COTS RFIDâ, in Proceedings of IEEE International Conference on Computer Communications (IEEE INFOCOM), 2018. (Acceptance rate: 309/1606 = 19.2%)Li Lu, Jiadi Yu, Yingying Chen, Hongbo Liu, Yanmin Zhu, Yunfei Liu, Minglu Li, âLipPass: Lip Reading-based User Authentication on Smartphones Leveraging Acoustic Signalsâ, in Proceedings of IEEE International Conference on Computer Communications (IEEE INFOCOM), 2018. (Acceptance rate: 309/1606 = 19.2%)Xiaonan Guo, Bo Liu, Cong Shi, Hongbo Liu, Yingying Chen, Mooi Choo Chuah, âWiFi-Enabled Smart Human Dynamics Monitoringâ, in Proceedings of the 15th ACM Conference on Embedded Networked Sensor Systems (ACM SenSys), 2017. (Acceptance rate: 26/151 = 17.2%)Cong Shi, Jian Liu, Hongbo Liu, Yingying Chen, âSmart User Authentication through Actuation of Daily Activities Leveraging WiFi-enabled IoTâ, in Proceedings of the 18th ACM International Symposium on Mobile Ad Hoc Networking and Computing (ACM Mobihoc), 2017. (Acceptance rate: 27/179 = 15.1%)Mostafa Izz, Zhongyuan Li, Hongbo Liu, Yingying Chen, Feng Li, âUber-in-Light: Unobtrusive Visible Light Communication Leveraging Complementary Color Channelâ, in Proceedings of IEEE International Conference on Computer Communications (IEEE INFOCOM), 2016. (Acceptance rate: 300/1,644 = 18.25%) Yan Wang, Jian Liu, Yingying Chen, Marco Gruteser, Jie Yang, Hongbo Liu, \"E-eyes: Device-free Location-oriented Activity Identification Using Fine-grained WiFi Signatures\", in Proceedings of the 20th Annual International Conference on Mobile Computing and Networking (ACM MobiCom), Maui, Hawii, Sept. 2014. (Acceptance rate: 36/220 = 16.4%)Yan Wang, Jie Yang, Yingying Chen, Hongbo Liu, Marco Gruteser, Richard P. Martin, \"Tracking Human Queues Using Single-Point Signal Monitoring\", in Proceedings of the 12th International Conference on Mobile Systems, Applications, and Services (ACM MobiSys), New Hampshire, USA, June 2014. (Acceptance rate: 25/185 = 13.5%)Hongbo Liu, Yingying Chen, Mooi Choo Chuah, Jie Yang, âTowards Self-Healing Smart Grid via Intelligent Local Controller Switching under Jammingâ, in Proceedings of IEEE Conference on Communications and Network Security (IEEE CNS), Washington, D.C., USA, October 2013 â Best Paper Runner-Up Award.Yan Wang, Jie Yang, Hongbo Liu, Yingying Chen, Marco Gruteser, Richard P. Martin, âSensing Vehicle Dynamics for Determining Driver Phone Useâ, in Proceedings of the 11th International Conference on Mobile Systems, Applications, and Services (ACM MobiSys), Taipei, Taiwan, June 2013. (Acceptance rate: 33/210=15.7%)Hongbo Liu, Jie Yang, Yan Wang, Yingying Chen, \"Fast and Practical Secret Key Extraction by Exploiting Channel Response\", in Proceedings of IEEE International Conference on Computer Communications (IEEE INFOCOM), Turin, Italy, April 2013. (Acceptance rate: 17%)Hongbo Liu, Yu Gan, Jie Yang, Simon Sidhom, Yan Wang, Yingying Chen, Fan Ye, \"Push the Limit of WiFi based Localization for Smartphones\", in Proceedings of the 18th Annual International Conference on Mobile Computing and Networking (ACM MobiCom), Istanbul, Turkey, August 2012. (Acceptance rate: 32/212 = 15%).Hongbo Liu, Jie Yang, Yan Wang, Yingying Chen, âCollabor",
  "content_length": 12135,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:52"
}