{
  "name": "Hongyu Lin",
  "homepage": "https://people.ucas.ac.cn/~hongyu",
  "status": "success",
  "content": "林鸿宇-中国科学院大学-UCAS [中文] [English] 个人简介 研究方向 教育背景 相关信息 论文发表 基本信息 林鸿宇  男  硕导  中国科学院软件研究所电子邮件： hongyu@iscas.ac.cn通信地址： 北京市海淀区中关村南四街4号 个人简介 林鸿宇，中国科学院软件研究所中文信息处理实验室特聘岗位副研究员。2020年博士毕业于中国科学院软件研究所。主要研究方向为大语言模型、信息抽取及基于知识的自然语言理解。近年来在ACL/EMNLP/AIJ/IJCAI/AAAI等自然语言处理和人工智能领域国际顶级期刊及学术会议上发表论文50余篇，主持和参与包括国家自然科学基金面上/青年基金、国家自然科学基金重点项目在内和中国科学院战略先导A类项目在内的多项国家级、部委级项目，以及CCF-百度松果基金、腾讯微信犀牛鸟基金等在内的多项企业合作项目。曾获ACL 2024 Area Chair Award、EDBT 2025 Best Paper Runner-Up、中国科学院院长奖特别奖、中国中文信息学会优博、中国中文信息学会钱伟长中文信息处理科学技术奖一等奖。 研究方向 大语言模型、自然语言处理、信息抽取 教育背景 2015-09--2020-07   中国科学院大学   博士2011-09--2015-06   厦门大学   学士 相关信息 实验室主页地址：https://www.icip.org.cn/实验室招生说明：https://www.icip.org.cn/zh/2024/04/28/zhaosheng2024/Google Scholar：https://scholar.google.com/citations?user=mu5lLakAAAAJ 论文发表 2024Jiawei Chen, Hongyu Lin†, Xianpei Han†, Le Sun. Benchmarking Large Language Models in Retrieval-Augmented Generation. The 38th Annual AAAI Conference on Artificial Intelligence (AAAI 2024, CCF-A)Xinyan Guan*, Yanjiang Liu*, Hongyu Lin, Yaojie Lu†, Ben He, Xianpei Han, Le Sun†. Mitigating Large Language Model Hallucinations via Autonomous Knowledge Graph-based Retrofitting. The 38th Annual AAAI Conference on Artificial Intelligence (AAAI 2024, CCF-A)Ruoxi Xu, Yingfei Sun, Mengjie Ren, Shiguang Guo, Ruotong Pan, Hongyu Lin†, Le Sun, Xianpei Han. AI for social science and social science of AI: A survey. Information Processing & Management. (IP&M 2024)Ning Bian, Xianpei Han†, Le Sun, Hongyu Lin, Yaojie Lu, Ben He, Shanshan Jiang, Bin Dong. ChatGPT is a Knowledgeable but Inexperienced Solver: An Investigation of Commonsense Problem in Large Language Models. In Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation. (COLING 2024, CCF-B)Boxi Cao, Qiaoyu Tang, Hongyu Lin†, Xianpei Han†, Jiawei Chen, Tianshu Wang, Le Sun. Retentive or Forgetful? Diving into the Knowledge Memorizing Mechanism of Language Models. In Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation. (COLING 2024, CCF-B)Chunlei Xin, Yaojie Lu†, Hongyu Lin, Shuheng Zhou, Huijia Zhu, Weiqiang Wang, Zhongyi Liu, Xianpei Han, Le Sun. Beyond Full Fine-tuning: Harnessing the Power of LoRA for Multi-Task Instruction Tuning. In Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation. (COLING 2024, CCF-B)Zhuoqun Li, Hongyu Lin, Yaojie Lu, Hao Xiang, Xianpei Han, Le Sun†. Meta-Cognitive Analysis: Evaluating Declarative and Procedural Knowledge in Datasets and Large Language Models. In Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation. (COLING 2024, Short Paper)Xin Zheng, Qiming Zhu, Hongyu Lin, Yaojie Lu, Xianpei Han, Le Sun†. Executing Natural Language-Described Algorithms with Large Language Models: An Investigation.In Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation. (COLING 2024, CCF-B)Jiawei Chen, Hongyu Lin†, Xianpei Han, Yaojie Lu, Shanshan Jiang, Bin Dong, Le Sun. Few-shot Named Entity Recognition via Superposition Concept Discrimination. In Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation. (COLING 2024, CCF-B)Boxi Cao, Mengjie Ren, Hongyu Lin, Xianpei Han†, Feng Zhang, Junfeng Zhan, Le Sun†. StructEval: Deepen and Broaden Large Language Model Assessment via Structured Evaluation. In Findings of the Association for Computational Linguistics: ACL 2024.Mengjie Ren, Boxi Cao, Hongyu Lin†, Cao Liu, Xianpei Han, Ke Zeng, Guanglu Wan, Xunliang Cai, Le Sun. Learning or Self-aligning? Rethinking Instruction Fine-tuning. In Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics. (ACL 2024, CCF A)Shiguang Guo*, Ziliang Deng*, Hongyu Lin, Yaojie Lu, Xianpei Han, Le Sun. Open Grounded Planning: Challenges and Benchmark Construction. In Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics. (ACL 2024, CCF A)Ning Bian, Xianpei Han†, Hongyu Lin, Yaojie Lu, Ben He†, Le Sun. Rule or Story, Which is a Better Commonsense Expression for Talking with Large Language Models?. In Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics. (ACL 2024, CCF A)Xiaoyang Chen, Ben He†, Hongyu Lin, Xianpei Han, Tianshu Wang, Boxi Cao, Le Sun†, Yingfei Sun. Spiral of Silence: How is Large Language Model Killing Information Retrieval?—A Case Study on Open Domain Question Answering. In Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics. (ACL 2024, CCF A)Shu Chen, Xinyan Guan, Yaojie Lu†, Hongyu Lin, Xianpei Han†, Le Sun. Building Instruction Data from Unlabelled Corpus. In Findings of the Association for Computational Linguistics: ACL 2024.Xinyu Lu, Bowen Yu, Yaojie Lu, Hongyu Lin†, Haiyang Yu, Le Sun, Xianpei Han, Yongbin Li†. SoFA: Shielded On-the-fly Alignment via Priority Rule Following. In Findings of the Association for Computational Linguistics: ACL 2024.Yanjiang Liu, Tianyun Zhong, Yaojie Lu†, Hongyu Lin, Ben He, Shuheng Zhou, Huijia Zhu, Weiqiang Wang, Zhongyi Liu, Xianpei Han, Le Sun. XMC-Agent : Dynamic Navigation over Scalable Hierarchical Index for Incremental Extreme Multi-label Classification. In Findings of the Association for Computational Linguistics: ACL 2024.Lvxue Li, Jiaqi Chen, Xinyu Lu, Yaojie Lu†, Hongyu Lin, Shuheng Zhou, Huijia Zhu, Weiqiang Wang, Zhongyi Liu, Xianpei Han, Le Sun. Debiasing In-Context Learning by Instructing LLMs How to Follow Demonstrations. In Findings of the Association for Computational Linguistics: ACL 2024.2023Chunlei Xin, Hongyu Lin†, Shan Wu, Xianpei Han, Bo Chen, Wen Dai, Shuai Chen, Bin Wang, and Le Sun†. Dialogue rewriting via skeleton-guided generation. In Proceedings of the 37th AAAI Conference on Artificial Intelligence. (AAAI 2023, CCF-A)Jie Lou*, Yaojie Lu*, Dai Dai†, Wei Jia, Hongyu Lin, Xianpei Han†, Le Sun, and Hua Wu. Universal information extraction as unified semantic matching. In Proceedings of the 37th AAAI Conference on Artificial Intelligence. (AAAI 2023, CCF-A)Jiawei Chen, Yaojie Lu†, Hongyu Lin, Jie Lou, Wei Jia, Dai Dai, Hua Wu, Boxi Cao, Xianpei Han†, and Le Sun. Learning In-context Learning for Named Entity Recognition. In Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics. (ACL 2023, CCF-A)Shan Wu*, Chunlei Xin*, Hongyu Lin†, Xianpei Han, Cao Liu, Jiansong Chen, Fan Yang, Guanglu Wan, and Le Sun†. Ambiguous Learning from Retrieval: Towards Zero-shot Semantic Parsing. In Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics. (ACL 2023, CCF-A)Peilin Liu, Hongyu Lin†, Meng Liao, Hao Xiang, Xianpei Han†, and Le Sun. WebDP: Understanding Discourse Structures in Semi-Structured Web Documents. In Findings of the Association for Computational Linguistics: ACL 2023.Boxi Cao, Hongyu Lin, Xianpei Han†, and Le Sun. The Life Cycle of Knowledge in Big Language Models: A Survey. Machine Intelligence Research. (MIR 2023)Ning Bian, Hongyu Lin†, Xianpei Han†, Ben He, and Le Sun. Contrastive Distant Supervision for Debiased and Denoised Machine Reading Comprehension. In Findings of the Association for Computational Linguistics: EMNLP 2023.Boxi Cao*, Qiaoyu Tang*, Hongyu Lin†, Xianpei Han†, and Le Sun. Does the Correctness of Factual Knowledge Matter for Factual Knowledge-Enhanced Pre-trained Language Models?. In Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing. (EMNLP 2023, CCF-B)Xin Zheng, Hongyu Lin†, Xianpei Han†, and Le Sun. 2023. Toward Unified Controllable Text Generation via Regular Expression Instruction. In Proceedings of the 13th International Joint Conference on Natural Language Processing and the 3rd Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics. (AACL 2023)2022Tianshu Wang, Hongyu Lin†, Cheng Fu, Xianpei Han†, Le Sun, Feiyu Xiong, Hui Chen, Minlong Lu, Xiuwen Zhu. Bridging the Gap between Reality and Ideality of Entity Matching: A Revisting and Benchmark Re-Construction. In Proceedings of the 31th International Joint Conference on Artificial Intelligence (IJCAI 2022, CCF-A).Fangchao Liu, Hongyu Lin†, Xianpei Han, Boxi Cao, Le Sun. Pre-training to Match for Unified Low-shot Relation Extraction. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022, CCF-A).Boxi Cao, Hongyu Lin, Xianpei Han†, Fangchao Liu, Le Sun†. Can Prompt Probe Pretrained Language Models? Understanding the Invisible Risks from a Causal View. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022, CCF-A).Jiawei Chen*, Qing Liu*, Hongyu Lin†, Xianpei Han†, Le Sun. Few-shot Named Entity Recognition with Self-describing Networks. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022, CCF-A).Ruoxi Xu, Hongyu Lin†, Meng Liao†, Xianpei Han, Jin Xu, Wei Tan, Yingfei Sun, Le Sun. Towards Event-Centric Opinion Mining. In Findings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL 2022).Jialong Tang, Hongyu Lin,Meng Liao†,Yaojie Lu, Xianpei Han, Le Sun†, Wenli Yu, Jin Xu. Procedural Text Understanding via Scene-wise Evolution. In Proceedings of the 36th AAAI Conference on Artificial Intelligence (AAAI 2022, CCF-A).Yaojie Lu, Hongyu Lin, Jialong Tang, Xianpei Han, Le Sun. End-to-End Neural Event Coreference Resolution. Artificial Intelligence. (CCF-A)2021Qing Liu, Hongyu Lin†, Xinyan Xiao, Xianpei Han†, Le Sun, and Hua Wu. Fine-grained Entity Typing via Label Reasoning. In Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing. (EMNLP 2021, CCF-B)Jiawei Chen, Hongyu Lin†, Xianpei Han†, and Le Sun. Honey or Poison? Solving the Trigger Curse in Few-shot Ev",
  "content_length": 15066,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:00"
}