{
  "name": "Hong Zhang 0013",
  "homepage": "https://webdocs.cs.ualberta.ca/~zhang",
  "status": "success",
  "content": "Professor Hong Zhang My Coordinates News I have moved to Southern Univeristy of Science and Technology (SUSTech), in Shenzhen, China, to assume a Chair Professor position in Department of Electronic and Electrical Engineering and start a new robotics research group. New website with contact info to be available soon. Congrats to Xuesong Wu and others, for their paper accepted by IEEE RA Letters of their work on HDR reconstruction from polarization images. Two papers accepted by ICRA 2020. Congratulations to Sean, DAI Zhuang (from GDUT), and their co-authors. Congrats to Ali and Shing-Yan for winning the Best Conference Paper award at ROBIO 2019! Happy to be a PI with Centre for Autonomous Systems, which just received $7.1 millon funding as one of the three proposals funded by Alberta Government. Congrats to Moein for his CVPR 2019 paper, \"Moving Object Detection under Discontinuous Change in Illumination Using Tensor Low-Rank and Invariant Sparse Decomposition\" About I was a Professor in the Department of Computing Science at the University of Alberta. I received my BSc degree from Northeastern University (USA) and my PhD from Purdue University. After a year of post-doctoral training at the University of Pennsylvania, I joined the U of A in 1988 where I currently hold an adjunct appointment. My research interests include robotics, computer vision, and image processing. I have worked in a number of areas in robotics and, for the past 10+ years, my focus has been on visual robot navigation. In 2003-17, with support from the federal and provinncial goverments, I held an NSERC Industrial Research Chair to conduct research in computer vision and image processing that addresses the practical challenges facing Alberta's mining industry. As a member of the NSERC Strategic Network on Robotics (NCRN) I work closely with Canadian academic colleagues and industrial partners on mobile robotics research. Within the international robotics community, my activities include a variety of roles in ICRA and IROS communities, as well as other IEEE RAS sponsored conferences. Activities and Recognitions Recent Activities: Editor-in-Chief, IROS Conference Paper Review Board (iCPRB), 2020-2022 Parliamentarian, IEEE Robotics and Automation Society Administrative Committee (AdCom), 2020-2021 Secretary, IEEE Robotics and Automation Society Executive Committee (ExCom), 2018-2019 Travel Award Chair, 2019 IEEE International Conference on Robotics and Automation (ICRA 2019) General Chair, IEEE ROBIO 2018 General Chair, IEEE/RSJ IROS 2017 Associate Editor, IEEE Transactions on Cybernetics, 2013-17 Member of Editorial Board, Robotics, MDPI Recent Recognitions: Best Conference Paper, IEEE ROBIO 2019 2018 IROS Distinguished Service Award Distinguished Visiting Scholar, Centre for Autonomous Systems, UTS, Australia, 2018 Fellow, Canadian Academy of Engineering (Class 2015) Fellow, IEEE (Class 2014) NSERC Industrial Research Chair on Intelligent Sensing Systems, 2003-17 My CV",
  "content_length": 2991,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:50"
}