{
  "name": "Honghao Wei",
  "homepage": "https://honghaow.me",
  "status": "success",
  "content": "Honghao Wei MENU Home Publication Teaching Group Honghao Wei Assistant Professor School of Electrical Engineering and Computer Science Washington State University, Pullman EME 406 Email: honghao.wei [@] wsu [DOT] edu Google Scholar / GitHub About me I am an assistant professor in the School of Electrical Engineering and Computer Science at Washington State University (WSU). I received my Ph.D. degree from the Department of Electrical Engineering and Computer Science at the University of Michigan, Ann Arbor, 2023, advised by Prof. Lei Ying. My research interests lie in designing scalable, efficient, and practical machine learning algorithms with strong theoretical guarantees. To Prospective Students I am looking for motivated graduate students to join my research group! Prospective students may have an undergraduate or master’s degree in electrical engineering, computer science, mechanical engineering, industrial engineering, mathematics, statistics, or a related area. I am expecially looking for highly motivated students with strong backgrounds in mathematics, reinforcement learning, machine learning, and optimization to work with me. Moreover, interns and visiting students are highly welcome! If you are interested, please send me an email with your CV and, and undergraduate / graduate transcripts. Research My research interests include Online Learning and Decision-making Reinforcement Learning and Constrained Reinforcement Learning Stochastic Modeling, Analysis and Optimization Reinforcement Learning with Applications in Communication, Ride-hailing, and Social Networks News! 09/2025: Our work on RePO introduces a method that enforces safety on every prompt using rectified policy gradients, ensuring consistent safety without sacrificing helpfulness has been accepted by NeurIPS 2025. Congrats to all the collaborators! 05/2025: Our work on RL with anytime adversarial constraint has been accepted by ICML 2025, this is Jiahui's first paper, Congrats to Jiahui!. 04/2025: Serve as a TPC member for MobiHoc 2025. 02/2025: Give a talk at the 2025 Information Theory and Applications Workshop (ITA-2025). 12/2024: Two papers have been accepted to AAAI 2025. Congrats to all the collaborators! 09/2024: Two papers on offline Safe-RL, focusing on robust policy improvement and addressing the partial coverage issue, have been accepted to NeurIPS 2024. Congrats to all the collaborators! 08/2024: Our work on Optimistic Joint Flow Control and Link Scheduling with Unknown Utility Functions has been accepted by MobiHoc 2024. 05/2024: Invited to serve as a TPC member for INFOCOM 2025. 05/2024: Our work on Reinforcement Learning from Human Feedback without Reward Inference: Model-Free Algorithm and Instance-Dependent Analysis has been accepted by Reinforcement Learning Conference (RLC). 12/2023: Our work on safe Reinforcement Learning with instantaneous constraints has been accepted by AAAI 2024 as a oral presentation. We studied the role of aggressive policy exploration in safe RL. Check it out! 10/2023: New manuscript out: Model-Free, Regret-Optimal Best Policy Identification in Online CMDPs. We proposed the first model-free algorithm for best policy identification in tabular CMDPs. Check it out! 09/2023: Our work on using augmented samples to improve sample efficiency in mixed systems has been accepted by NeurIPS 2023 as a spotlight presentation. 09/2023: Our work on using RL with prediction-based lookahead policy for vehicle repositioning in ride-hailing systems has been accepted by IEEE Transactions on Intelligent Transportation Systems. 08/2023: Defended my Ph.D. dissertation. 04/2023: Invited to serve as a TPC member for INFOCOM 2024. Professional Service Conference Reviewer: ICLR / NeurIPS / ICML / AAAI / AISTATS / INFOCOM / ISIT / CDC / L4DC Journal Reviewer: IEEE Trans. Inf. Theory / Netw / Control. Netw. Syst.",
  "content_length": 3867,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:54"
}