{
  "name": "Hongxin Wei",
  "homepage": "https://hongxin001.github.io",
  "status": "success",
  "content": "Hongxin Wei @ SUSTech Hongxin Wei Assistant Professor @ SUSTech, China weihx [at] sustech.edu.cn; hongxin001 [at] e.ntu.edu.sg [GitHub] [Google Scholar] [Download CV] Bio I am an Assistant Professor (Principal investigator, PhD supervisor) in the Department of Statistics and Data Science at SUSTech (China, Shenzhen). I obtained my Ph.D. degree at the School of Computer Science and Engineering, Nanyang Technological University, supervised by Prof. Bo An. During my Ph.D, I was fortunate to work as a visiting scholar in the group of Prof. Sharon Yixuan Li at the University of Wisconsin Madison in 2022. Previously I spent a wonderful year as a research assistant in the Institute for Interdisciplinary Information Sciences at Tsinghua University. Prior to that, I received my B.E. in Software Engineering from Huazhong University of Science and Technology in 2016. My research interest falls in the scope of reliable machine learning (uncertainty estimation), and its applications in data optimization and privacy. Generally, we expect deep learning models to produce precise estimation of their uncertainty in predictions, using the form of probabilities (confidences in ML) or conformal prediction sets. Besides, my research is closely related to data-centric machine learning and foundation model, like data quality and efficiency. We are also interested in the statistic theory of data selection in machine learning, which provides theoretical principles to guide the data optimization in machine learning workflows. We are always actively looking for Postdocs, PhDs, and RA/interns to join our research. News January 2025 I will be serving as a reviewer for JASA. September 2025 We will host NeurIPS 2025 Seminar @ Shenzhen during Nov 22-23, Click here to sign up. September 2025 I will be serving as a Area Chair for ICLR 2026. May 2025 Three papers are accepted by ICML 2025. Congratulations to Shuoyuan and Hao Zeng! February 2025 I will be serving as a Area Chair for NeurIPS 2025. January 2024 Three papers are accepted by ICLR 2025. Congratulations to Wenyu, and Hengxiang! January 2025 I will be serving as a SPC for IJCAI 2025. November 2024 I will be serving as a Area Chair for ICML 2025. May 2024 Two papers are accepted by NeurIPS 2024. Congratulations to Hongfu Gao! July 2024 We release a Chinese Content Moderation Benchmark for LLMs: ChineseSafe-Benchmark. May 2024 I am accepting Mphil and PhD applications (2025 fall). I am always looking for highly-motivated research interns, RAs and PostDocs to join our research (refer to this page). May 2024 Four papers are accepted by ICML 2024. March 2024 I will be serving as a Area Chair for NeurIPS 2024. January 2024 Three papers are accepted by ICLR 2024 (Two are Spotlights). December 2023 We release a Python toolbox for conformal prediction research TorchCP. October 2022 I am honored to be recognized as Top Reviewers in NeurIPS 2022. May 2022 Two papers are accepted by ICML 2022 (Accept rate: 21.9%). October 2021 I am honored to receive NeurIPS 2021 Outstanding Reviewer Award (top 8% of reviewers). Working papers ( * Corresponding author ) Selective Labeling with False Discovery Rate Control Huipeng Huang, Wenbo Liao, Huajun Xi, Hao Zeng, Mengchen Zhao, Hongxin Wei * [Paper] High-Power Training Data Identification with Provable Statistical Guarantees Zhenlong Liu, Hao Zeng, Weiran Huang, Hongxin Wei * [Paper] PAC Reasoning: Controlling the Performance Loss for Efficient Reasoning Hao Zeng, Jianguo Huang, Bingyi Jing, Hongxin Wei *, Bo An [Paper] Multi-Condition Conformal Selection Qingyang Hao, Wenbo Liao, Bingyi Jing, Hongxin Wei * [Paper] Detecting Distillation Data from Reasoning Models Hengxiang Zhang, Hyeong Kyu Choi, Yixuan Li, Hongxin Wei * [Paper] Online conformal selection with accept-to-reject changes Kangdao Liu, Huajun Xi, Chi-Man Vong, Hongxin Wei * [Paper] Semi-Supervised Conformal Prediction With Unlabeled Nonconformity Score Xuanning Zhou, Hao Zeng, Xiaobo Xia, Bingyi Jing, Hongxin Wei * [Paper] Efficient Membership Inference Attacks by Bayesian Neural Network Zhenlong Liu, Wenyu Jiang, Feng Zhou, Hongxin Wei * [Paper] Exploring Imbalanced Annotations for Effective In-Context Learning Hongfu Gao, Feipeng Zhang, Hao Zeng, Deyu Meng, Bingyi Jing, Hongxin Wei * [Paper] Defending Membership Inference Attacks via Privacy-aware Sparsity Tuning Qiang Hu, Hengxiang Zhang, Hongxin Wei * [Paper] Selected Publications ( * Corresponding author; † Equal contribution) TorchCP: A Python Library for Conformal Prediction JMLR Jianguo Huang, Jianqing Song, Xuanning Zhou, Bingyi Jing, Hongxin Wei * [Paper] Your Pre-trained LLM is Secretly an Unsupervised Confidence Calibrator NeurIPS 2025 Beier Luo, Shuoyuan Wang, Yixuan Li, Hongxin Wei * [Paper] Exploring the Noise Robustness of Online Conformal Prediction NeurIPS 2025 Huajun Xi, Kangdao Liu, Hao Zeng, Wenguang Sun, Hongxin Wei * [Paper] Does Confidence Calibration Help Conformal Prediction? TMLR Huajun Xi, Jianguo Huang, Kangdao Liu, Lei Feng, Hongxin Wei * [Paper] Understanding and Mitigating Miscalibration in Prompt Tuning for Vision-Language Models ICML 2025 Shuoyuan Wang, Yixuan Li, Hongxin Wei * [Paper] Parametric Scaling Law of Tuning Bias in Conformal Prediction ICML 2025 Hao Zeng, Kangdao Liu, Bingyi Jing, Hongxin Wei * [Paper] How Contaminated Is Your Benchmark? Quantifying Dataset Leakage in Large Language Models with Kernel Divergence ICML 2025 Hyeong Kyu Choi, Maxim Khanov, Hongxin Wei, Yixuan Li [Paper] Exploring Learning Complexity for Downstream Data Pruning ICLR 2025 Wenyu Jiang, Zhenlong Liu, Zejian Xie, Songxin Zhang, Bingyi Jing, Hongxin Wei * [Paper] Fine-tuning can Help Detect Pretraining Data from Large Language Models ICLR 2025 Hengxiang Zhang, Songxin Zhang, Bingyi Jing, Hongxin Wei * [Paper] On the Noise Robustness of In-Context Learning for Text Generation NeurIPS 2024 Hongfu Gao, Feipeng Zhang, Wenyu Jiang, Jun Shu, Feng Zheng, Hongxin Wei* [Paper] Open-Vocabulary Calibration for Vision-Language Models ICML 2024 Shuoyuan Wang, Jindong Wang, Guoqing Wang, Bob Zhang, Kaiyang Zhou, Hongxin Wei * [Paper] Conformal Prediction for Deep Classifier via Label Ranking ICML 2024 Jianguo Huang, Huajun Xi, Linjun Zhang, Huaxiu Yao, Yue Qiu, Hongxin Wei * [Paper] Mitigating Privacy Risk in Membership Inference by Convex-Concave Loss ICML 2024 Zhenlong Liu, Lei Feng, Huiping Zhuang, Xiaofeng Cao, Hongxin Wei * [Paper] DOS: Diverse Outlier Sampling for Out-of-Distribution Detection ICLR 2024 Wenyu Jiang, Hao Cheng, MingCai Chen, Chongjun Wang, Hongxin Wei * [Paper] Consistent Multi-Class Classification from Multiple Unlabeled Datasets ICLR 2024 (Spotlight) Zixi Wei, Senlin Shu, Yuzhou Cao, Hongxin Wei, Bo An, Lei Feng [Paper] Optimization-Free Test-Time Adaptation for Cross-Person Activity Recognition. IMWUT/Ubicomp 2024 Shuoyuan Wang, Jindong Wang, HuaJun Xi, Bob Zhang, Lei Zhang, Hongxin Wei On the Importance of Feature Separability in Predicting Out-Of-Distribution Error. NeurIPS 2023 Renchunzi Xie, Hongxin Wei *, Lei Feng, Yuzhou Cao, Bo An Mitigating Memorization of Noisy Labels by Clipping the Model Prediction ICML 2023 Hongxin Wei, Huiping Zhuang, Renchunzi Xie, Lei Feng, Gang Niu, Bo An, Yixuan Li Mitigating Neural Network Overconfidence with Logit Normalization ICML 2022 Hongxin Wei, Renchunzi Xie, Hao Cheng, Lei Feng, Bo An, Yixuan Li [Paper] [Code] [Tweet] Open-Sampling: Exploring Out-of-Distribution data for Re-balancing Long-tailed datasets ICML 2022 Hongxin Wei, Lue Tao, Renchunzi Xie, Lei Feng, Bo An [Paper] [Code] Deep Learning from Multiple Noisy Annotators as A Union TNNLS Hongxin Wei, Renchunzi Xie, Lei Feng, Bo An [Paper] GearNet: Stepwise Dual Learning for Weakly Supervised Domain Adaptation AAAI 2022 Renchunzi Xie, Hongxin Wei *, Lei Feng, Bo An [Paper] Open-set Label Noise Can Improve Robustness Against Inherent Label Noise NeurIPS 2021 Hongxin Wei, Lue Tao, Renchunzi Xie, Bo An [Paper] [Code] Commission Fee is not Enough: A Hierarchical Reinforced Framework for Portfolio Management AAAI 2021 Rundong Wang †, Hongxin Wei †, Bo An, Zhouyan Feng, Jun Yao [Paper] Combating noisy labels by agreement: A joint training method with co-regularization CVPR 2020 Hongxin Wei, Lei Feng, Xiangyu Chen, Bo An [Paper] [Code] Research Group Hao Zeng Postdoc (co-supervised with Prof. B. Jing) PhD degree from Xiamen University Shuoyuan Wang Ph.D. student Master degree from University of Macau Hengxiang Zhang Ph.D. student Master degree from UESTC Hanjie Yang Ph.D. student Master degree from DUT Xiaoqi Qiu Ph.D. student Master degree from SZU Zhenlong Liu Ph.D. student Bachelor degree from SUSTech Beier Luo Master student Bachelor degree from SUSTech Cong Ding Master student Now Intern at Tencent Jiaxi Ren Master student Bachelor degree from SUSTech Xuhui Yi Master student Bachelor degree from WUST Haotian Zhang Research Intern Master student at DUT Huajun Xi Research Assistant Bachelor degree from SUSTech Wenbo Liao Research Intern PhD student at CUHK Qingyang Hao Research Assistant Master degree from THU(SZ) Yuhan Li Research Intern Undergraduate student at SDU(Weihai) Zihao Shi Research Intern Master student at FDU Past Members Jianguo Huang Research Intern (2023-2024) Now PhD student at NTU, Singapore Qiqi Tao Research Intern (2024) Now PhD student at SUTD, Singapore Hongfu Gao Research Intern (2024) Now PhD student at NUS Jianqing Song Research Intern (2024) PhD student at Nanjing University Wenyu Jiang Research Intern (2023-2024) Ph.D. student at Nanjing University. Kangdao Liu Research Intern (2024) Ph.D. student at University of Macau Qiang Hu Undergraduate student at SUSTech (2025) Now PhD student at SUNY Buffalo Xuanning Zhou Research Intern (2024-2025) Now Mphil at CUHK(SZ)",
  "content_length": 9758,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:59"
}