{
  "name": "Hong Hu 0004",
  "homepage": "https://huhong789.github.io",
  "status": "success",
  "content": "Hong's Home Page Home Students Teaching Grants Experiences Services Awards Publications Hong Hu Assistant Professor College of Information Sciences and Technology The Pennsylvania State University E312 Westgate Building 288 Burrowes Rd University Park, PA 16802-6823 gmail.com: huhong789 psu.edu: honghu CV --- Google Scholar Short Bio: I am an Assistant Professor in the College of Information Sciences and Technology at the Pennsylvania State University. My research interests include system and software security. I like to work on vulnerability detection, exploitation and defense. To prospective students: I'm looking for motivated students in system security and software security research. If you are interested in working with me, please contact me via honghu@psu.edu Students Current Ruibo Lu (PhD) Fall 2025 Zhechang Zhang (PhD) Fall 2023 Shuangpeng Bai (PhD) Fall 2022 Hengkai Ye (PhD) Summer 2022 Shihao Xia (PhD, co-advised with Linhai Song) Spring 2021 Alumni Song Liu (Master ⇢ PhD @ University of Delaware) Yu Liang (PhD ⇢ PhD @ Penn State ⇢ Research Scientist @ Meta) Teaching IST 543 Foundations of Software Security Summer 2025, Spring 2024 IST/CYBER 454 Computer and Cyber Forensics Fall 2025, Fall 2024, Spring/Fall 2023, Fall 2022, Spring/Fall 2021, Fall 2020 Grants My research is currently supported by the following grants. NSF CNS-2339848 CAREER: Enhancing Practical Defense Mechanisms against Memory Errors and Attacks 2024 - 2029 NSF CNS-2247652 SaTC: CORE: Small: Automatic Identification of Privilege-guard Variables for Data-only Attacks and Defenses 2023 - 2026 Experiences Assistant Professor [Aug 2020 - Present] College of Information Sciences and Technology, Pennsylvania State University Research Scientist [Feb 2019 - Aug 2020] School of Computer Science, Georgia Institute of Technology Postdoctoral Fellow [Feb 2017 - Feb 2019] School of Computer Science, Georgia Institute of Technology Research Fellow [Jul 2016 - Jan 2017] National University of Singapore, Singapore Services Program Committee Member ACM Conference on Computer and Communications Security (CCS) [2025, 2024, 2023, 2022] USENIX Security Symposium (USENIX Security) [2026, 2025] Network and Distributed System Security Symposium (NDSS) [2026, 2025, 2024, 2023, 2022] International Conference on Applied Cryptography and Network Security (ACNS) [2026] ACM ASIA Conference on Computer and Communications Security (ASIACCS) [2022, 2021, 2019] Fuzzing workshop (FUZZING) [2025] Journal Reviewer Journal of Computer Security [2024] IEEE Transactions on Dependable and Secure Computing (TDSC) [2023, 2022, 2021, 2020, 2019] IEEE Transactions on Software Engineering (TSE) [2020, 2019] IEEE Transactions on Computers (TC) [2020, 2018, 2016] IEEE Transactions on Information Forensics and Security (TIFS) [2018] Awards Top Reviewer, CCS 2022, 2025 Notable Reviewer, USENIX Security 2025 NSF CAREER Award 2024 Best Paper Award, CCS 2019 Best Paper Award, ICECCS 2014 Publications Conference Proceedings Too Subtle to Notice: Investigating Executable Stack Issues in Linux Systems Hengkai Ye, and Hong Hu. In Proceedings of the 32nd Annual Network and Distributed System Security Symposium (NDSS 2025). [Acc Rate: 16.1%] Code injection was a favored technique for attackers to exploit buffer overflow vulnerabilities decades ago. Subsequently, the widespread adoption of lightweight solutions like write-xor-execute (W⊕X) effectively mitigated most of these attacks by disallowing writable-and-executable memory. However, we observe multiple concerning cases where software developers accidentally disabled W⊕X and reintroduced executable stacks to popular applications. Although each violation has been properly fixed, a lingering question remains: what underlying factors contribute to these recurrent mistakes among developers, even in contemporary software development practices? In this paper, we conduct two investigations to gain a comprehensive understanding of the challenges associated with properly enforcing W⊕X in Linux systems. First, we delve into program-hardening tools to assess whether experienced security developers consistently catch the necessary steps to avoid executable stacks. Second, we analyze the enforcement of W⊕X on Linux by inspecting the source code of the compilation toolchain, the kernel and the loader. Our investigation reveals that properly enforcing W⊕X on Linux requires close collaboration among multiple components. These tools form a complex chain of trust and dependency to safeguard the program stack. However, developers, including security researchers, may overlook the subtle yet essential .note.GNU-stack section when writing assembly code for various purposes, and inadvertently introduce executable stacks. For example, 11 program-hardening tools implemented as inlined reference monitors (IRM) introduce executable stacks to all hardened applications. Based on these findings, we discuss potential exploitation scenarios by attackers and provide suggestions to mitigate this issue. @inproceedings{ye:badass, title = {{Too Subtle to Notice: Investigating Executable Stack Issues in Linux Systems}}, author = {Hengkai Ye and Hong Hu}, booktitle = {Proceedings of the 32nd Annual Network and Distributed System Security Symposium (NDSS 2025)}, month = feb, year = {2025}, address = {San Diego, CA}, } CountDown: Refcount-guided Fuzzing for Exposing Temporal Memory Errors in Linux Kernel Shuangpeng Bai, Zhechang Zhang, and Hong Hu. In Proceedings of the 31st ACM Conference on Computer and Communications Security (CCS 2024). [Acc Rate: 16.9%] Kernel use-after-free (UAF) bugs are severe threats to system security due to their complex root causes and high exploitability. We find that 36.1% of recent kernel UAF bugs are caused by improper uses of reference counters, dubbed refcount-related UAF bugs. Current kernel fuzzing tools based on code coverage can detect common memory errors, but none of them is aware of the root cause. As a consequence, they only trigger refcount-related UAF bugs passively and coincidentally, and may miss many deep hidden vulnerabilities. To actively trigger refcount-related UAF bugs, in this paper, we propose CountDown, a novel refcount-guided kernel fuzzer. CountDown collects diverse refcount operations from kernel executions and reshapes syscall relations based on commonly accessed refcounts. When generating user-space programs, CountDown prefers to combine syscalls that ever access the same refcounts, aiming to trigger complex refcount behaviors. It also injects refcountdecreasing and refcount-accessing syscalls to intentionally free the refcounted object and trigger invalid accesses through dangling pointers. We test CountDown on mainstream Linux kernels and compare it with popular fuzzers. On average, our tool can detect 66.1% more UAF bugs and 32.9% more KASAN reports than stateof-the-art tools. CountDown has found nine new kernel memory bugs, where two are fixed and one is confirmed. @inproceedings{bai:countdown, title = {{CountDown: Refcount-guided Fuzzing for Exposing Temporal Memory Errors in Linux Kernel}}, author = {Shuangpeng Bai and Zhechang Zhang and Hong Hu}, booktitle = {Proceedings of the 31st ACM Conference on Computer and Communications Security (CCS 2024)}, month = oct, year = {2024}, address = {Salt Lake City, UT}, } DEEPTYPE: Refining Indirect Call Targets with Strong Multi-layer Type Analysis Tianrou Xia, Hong Hu, and Dinghao Wu. In Proceedings of the 33rd USENIX Security Symposium (USENIX Security 2024). [Acc Rate: 17.6% - 19.1%] Indirect calls, while facilitating dynamic execution characteristics in C and C++ programs, impose challenges on precise construction of the control-flow graphs (CFG). This hinders effective program analyses for bug detection (e.g., fuzzing) and program protection (e.g., control-flow integrity). Solutions using data-tracking and type-based analysis are proposed for identifying indirect call targets, but are either time-consuming or imprecise for obtaining the analysis results. Multi-layer type analysis (MLTA), as the state-of-the-art approach, upgrades type-based analysis by leveraging multi-layer type hierarchy, but their solution to dealing with the information flow between multi-layer types introduces false positives. In this paper, we propose strong multi-layer type analysis (SMLTA) and implement the prototype, DEEPTYPE, to further refine indirect call targets. It adopts a robust solution to record and retrieve type information, avoiding information loss and enhancing accuracy. We evaluate DEEPTYPE on Linux kernel, 5 web servers, and 14 user applications. Compared to TypeDive, the prototype of MLTA, DEEPTYPE is able to narrow down the scope of indirect call targets by 43.11% on average across most benchmarks and reduce runtime overhead by 5.45% to 72.95%, which demonstrates the effectiveness, efficiency and applicability of SMLTA. @inproceedings{xia:deeptype, title = {{DEEPTYPE: Refining Indirect Call Targets with Strong Multi-layer Type Analysis}}, author = {Tianrou Xia and Hong Hu and Dinghao Wu}, booktitle = {Proceedings of the 33rd USENIX Security Symposium (USENIX Security 2024)}, month = aug, year = {2024}, address = {Philadelphia, PA}, } MalwareTotal: Multi-Faceted and Sequence-Aware Bypass Tactics Against Static Malware Detection Shuai He, Cai Fu, Hong Hu, Jiahe Chen, Jianqiang Lv, and Shuai Jiang. In Proceedings of the 46th International Conference on Software Engineering (ICSE 2024). [Acc Rate: 22.3%] Recent methods have demonstrated that machine learning (ML) based static malware detection models are vulnerable to adversarial attacks. However, the generated malware often fails to generalize to production-level anti-malware software, as they usually involve multiple detection methods. This calls for universal solutions to the problem of malware variants generation. In this work, we demonstrate how the proposed method, MalwareTotal, has allowed malware variants to continue to ",
  "content_length": 71382,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:47"
}