{
  "name": "Hongsheng Li 0001",
  "homepage": "https://www.ee.cuhk.edu.hk/~hsli",
  "status": "success",
  "content": "Hongsheng Li at CUHK Hongsheng Li   李鴻升 Associate Professor Multimedia Laboratory & Department of Electronic Engineering The Chinese University of Hong Kong Email: hsli@ee.cuhk.edu.hk Office: SHB 428, CUHK, Hong Kong S.A.R., China [Google Scholar] News Hiring PhD students on Embodied AI, Robotic Manipulation, Multimodal Learning, Generative Models for 2026 Fall. [09/2025] 13 papers accepted to NeurIPS 2025 [08/2025] 3 papers accepted to EMNLP 2025 (Main Conference) [07/2025] To serve as a Senior Area Chair of CVPR 2026 [07/2025] Received 2025 CUHK Research Excellence Award [06/2025] 7 papers accepted to ICCV 2025 [05/2025] 4 papers accepted to ACL 2025 [05/2025] 3 papers accepted to ICML 2025 [02/2025] 11 papers accepted to CVPR 2025 [01/2025] 15 papers accepted to ICLR 2025 Education Ph. D., 2008 - 2012, Computer Science, Lehigh University M. Eng. student (dropped out for PhD program at Lehigh), 2006 - 2007, Pattern Recognition and Intelligent System, Shanghai Jiao Tong Universtiy B. Eng., 2002 - 2006, Automation, East China University of Science and Technology Employment Associate Professor, 7/2022-Present, Department of Electronic Enigneering, The Chinese University of Hong Kong Associate Professor (by courtesy), 7/2024-Present, Department of Computer Science and Engineering, The Chinese University of Hong Kong Huashan Scholar Chair Professor, 4/2020-4/2023, School of Computer Science and Technology, Xidian University Assistant Professor, 7/2018-6/2022, Department of Electronic Enigneering, The Chinese University of Hong Kong Research Assistant Professor, 8/2015-6/2018, Department of Electronic Enigneering, The Chinese University of Hong Kong Postdoctoral Fellow, 2/2014-1/2015, Department of Electronic Engineering, The Chinese University of Hong Kong Associate Professor, 1/2013-7/2015, School of Electronic Scicence, University of Electronic Science and Technology of China Awards & Recognitions CUHK Research Excellence Award, 2025 AI 2000 Most Influential Scholar Honorable Mention in Computer Vision, 2022, 2023, 2024 World's Top 2% Scientists by Stanford University, 2022, 2023, 2024, 2025 CUHK Young Researcher Award, 2021 2020 IEEE Circuits and System Society Outstanding Young Author Award, 2020 Winner of ActivityNet Challenge 2020 on Spatio-temporal Action Localization (AVA), 2020 Winner of ImageNet Video Object Detection/Tracking Challenge with provided data, 2016 Winner of ImageNet Video Object Detection Challenge with provided data, 2015 Publications 2025 WebGen-Bench: Evaluating LLMs on Generating Interactive and Functional Websites from Scratch, Z. Lu, Y. Yang, H. Ren, H. Hou, H. Xiao, K. Wang, W. Shi, A. Zhou, M. Zhan, H. Li. Conference on Neural Information Processing Systems (NeurIPS) Dataset & Benchmark Track, 2025 (Oral Presentation). UI-Genie: A Self-Improving Approach for Iteratively Boosting MLLM-based Mobile GUI Agents, H. Xiao, G. Wang, Y. Chai, Z. Lu, W. Lin, H. He, L. Fan, L. Bian, R. Hu, L. Liu, S. Ren, Y. Wen, X. Chen, A. Zhou, H. Li. Conference on Neural Information Processing Systems (NeurIPS), 2025. [Project] T2I-R1: Reinforcing Image Generation with Collaborative Semantic-level and Token-level CoT, D. Jiang, Z. Guo, R. Zhang, Z. Zong, H. Li, L. Zhuo, S. Yan, P.-A. Heng, H. Li. Conference on Neural Information Processing Systems (NeurIPS), 2025. [Project] GoT: Unleashing Reasoning Capability of MLLM for Visual Generation and Editing, R. Fang, C. Duan, K. Wang, L. Huang, H. Li, S. Yan, H. Tian, X. Zeng, R. Zhao, J. Dai, X. Liu, H. Li. Conference on Neural Information Processing Systems (NeurIPS), 2025. [Project] Perceive Anything: Recognize, Explain, Caption, and Segment Anything in Images and Videos, W. Lin, X. Wei, R. An, T. Ren, T. Chen, R. Zhang, Z. Guo, W. Zhang, L. Zhang, H. Li. Conference on Neural Information Processing Systems (NeurIPS), 2025. MINT-CoT: Enabling Interleaved Visual Tokens in Mathematical Chain-of-Thought Reasoning, X. Chen, R. Zhang, D. Jiang, A. Zhou, S. Yan, W. Lin, H. Li. Conference on Neural Information Processing Systems (NeurIPS), 2025. [Project] NopeRoomGS: Pose-Free Indoor 3D Gaussian Splatting via Local-to-Global Optimization, W. Li, Y. Xu, M. Yao, F. Liang, J. Sun, M. Wang, G. Zhang, L. Huang, H. Li. Conference on Neural Information Processing Systems (NeurIPS), 2025. NaViL: Rethinking Scaling Properties of Native Multimodal Large Language Models with Data Constraint, C. Tian, H. Li, G. Luo, X. Zhu, W. Su, H. Deng, J. Zhu, J. Shao, Z. Zhu, Y. Liu, L. Lu, W. Wang, H. Li, J. Dai. Conference on Neural Information Processing Systems (NeurIPS), 2025. Optimizing Distributional Geometry Alignment with Optimal Transport for Generative Dataset Distillation, X. Cui, Y. Qin, W. Zhou, H. Li, H. Li. Conference on Neural Information Processing Systems (NeurIPS), 2025. Delving into RL for Image Generation with CoT: A Study on DPO vs. GRPO, C. Tong, Z. Guo, R. Zhang, W. Shan, X. Wei, Z. Xing, H. Li, P.-A. Heng. Conference on Neural Information Processing Systems (NeurIPS), 2025. [Project] UAV-Flow Colosseo: A Real-World Benchmark for Flying-on-a-Word UAV Imitation Learning, Z. Lu, Y. Yang, H. Ren, H. Hou, H. Xiao, K. Wang, W. Shi, A. Zhou, M. Zhan, H. Li, S. Liu. Conference on Neural Information Processing Systems (NeurIPS) Dataset & Benchmark Track, 2025. BLINK-Twice: You see, but do you observe? A Reasoning Benchmark on Visual Perception, J. Ye, D. Jiang, J. He, B. Zhou, Z. Huang, Z. Yan, H. Li, C. He, W. Li. Conference on Neural Information Processing Systems (NeurIPS) Dataset & Benchmark Track, 2025. EnerVerse: Envisioning Embodied Future Space for Robotics Manipulation, S. Huang, L. Chen, P. Zhou, S. Chen, Z. Jiang, Y. Hu, Y. Liao, P. Gao, H. Li, M. Yao, G. Ren. Conference on Neural Information Processing Systems (NeurIPS), 2025. [Project] LM-Searcher: Cross-domain Neural Architecture Search with LLMs via Unified Numerical Encoding, Y. Hu, J. Liu, K. Wang, J. Zheng, W. Shi, M. Zhang, Q. Dou, R. Liu, A. Zhou, H. Li. Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025. Alignment with Fill-In-the-Middle for Enhancing Code Generation, H. Ren, Z. Lu, W. Shi, H. Hou, Y. Yang, K. Wang, A. Zhou, J. Pan, M. Zhan, H. Li. Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025. [Project] SmartBench: Is Your LLM Truly a Good Chinese Smartphone Assistant? X. Lu, H. Gao, R. Wu, S. Ren, X. Chen, H. Li, F. Li. Conference on Empirical Methods in Natural Language Processing (EMNLP), 2025. [Project] HPSv3: Towards Full-Spectrum Human Preference Score, Y. Ma, K. Sun, X. Wu, H. Li. International Conference on Computer Vision (ICCV), 2025. From Reflection to Perfection: Scaling Inference-Time Optimization for Text-to-Image Diffusion Models via Reflection Tuning, L. Zhuo, L. Zhao, S. Paul, Y. Liao, R. Zhang, Y. Xin, P. Gao, M. Elhoseiny, H. Li. International Conference on Computer Vision (ICCV), 2025. [Project] CameraCtrl II: Dynamic Scene Exploration via Camera-controlled Video Diffusion Models, H. He, C. Yang, S. Lin, Y. Xu, M. Wei, L. Gui, Q. Zhao, G. Wetzstein, L. Jiang, H. Li. [Project] International Conference on Computer Vision (ICCV), 2025. GenieBlue: Integrating both Linguistic and Multimodal Capabilities for Large Language Models on Mobile Devices, X. Lu, Y. Chen, R. Wu, H. Gao, X. Chen, X. Yang, X. Zhao, A. Zhou, F. Li, Y. Wen, X. Chen, S. Ren, H. Li. International Conference on Computer Vision (ICCV), 2025. ConsistentCity: Semantic Flow-guided Occupancy DiT for Temporally Consistent Driving Scene Synthesis, B. Zhu, X. Wang, H. Li. International Conference on Computer Vision (ICCV), 2025. PUMA: Empowering Unified MLLM with Multi-granular Visual Generation, R. Fang, C. Duan, K. Wang, H. Li, L. Huang, H. Tian, X. Zeng, R. Zhao, H. Li, X. Liu. International Conference on Computer Vision (ICCV), 2025. [Project] Lumina-Image 2.0: A Unified and Efficient Image Generative Framework, Q. Qin, L. Zhuo, Y. Xin, R. Du, Z. Li, B. Fu, Y. Lu, J. Yuan, X. Li, D. Liu, X. Zhu, M. Zhang, W. Beddow, E. Millon, V. Perez, W. Wang, C. He, B. Zhang, X. Liu, H. Li, Y. Qiao, C. Xu, P. Gao. International Conference on Computer Vision (ICCV), 2025. [Project] ReflectionCoder: Learning from Reflection Sequence for Enhanced One-off Code Generation, H. Ren, M. Zhan, Z. Wu, A. Zhou, J. Pan, H. Li. Annual Meeting of the Association for Computational Linguistics (ACL) Main Track, 2025. [Project] MathCoder-VL: Bridging Vision and Code for Enhanced Multimodal Mathematical Reasoning, K. Wang, J. Pan, L. Wei, A. Zhou, W. Shi, Z. Lu, H. Xiao, Y. Yang, H. Ren, M. Zhan, H. Li. Annual Meeting of the Association for Computational Linguistics (ACL) Findings Track, 2025. [Project] AMEX: Android Multi-annotation Expo Dataset for Mobile GUI Agents, Y. Chai, S. Huang, Y. Niu, H. Xiao, L. Liu, G. Wang, D. Zhang, S. Ren, H. Li. Annual Meeting of the Association for Computational Linguistics (ACL) Findings Track, 2025. [Project] Probability-Consistent Preference Optimization for Enhanced LLM Reasoning, Y. Yang, H. Ren, Z. Lu, K. Wang, W. Shi, A. Zhou, J. Pan, M. Zhan, H. Li. Annual Meeting of the Association for Computational Linguistics (ACL) Findings Track, 2025. [Project] EasyRef: Omni-Generalized Group Image Reference for Diffusion Models via Multimodal LLM, Z. Zong, D. Jiang, B. Ma, G. Song, H. Shao, H. Shao, D. Shen, Y. Li, H. Li. International Conference on Machine Learning (ICML), 2025. [Project] MME-CoT: Benchmarking Chain-of-Thought in LMMs for Reasoning Quality, Robustness, and Efficiency, D. Jiang, R. Zhang, Z. Guo, Y. Li, Y. Qi, X. Chen, L. Wang, J. Jin, C. Guo, S. Yan, B. Zhang, C. Fu, P. Gao, H. Li. International Conference on Machine Learning (ICML), 2025. [Project] One Leaf Reveals the Season: Occlusion-Based Contrastive Learning with Semantic-Aware Views for Efficient Visual Representation, X. Yang, L. Xu, H. Li, S. Zhang. International Conference on Machine Learning (ICML), 2025. [Project] BlueLM-V-3B: Algorithm and System Co-Design for Multimodal Large Languag",
  "content_length": 66353,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:56"
}