{
  "name": "Hongtao Lu",
  "homepage": "http://english.seiee.sjtu.edu.cn/english/detail/841_674.htm",
  "status": "success",
  "content": "﻿ 上海交通大学-电子信息与电气工程学院-English 中文 Home About Us Dean's Message Overview Leadership History Globalization Visit SEIEE Administration Contact Us Students Future Students Programs Graduate Students Undergraduate Students Exchange Students More Information Academics Departments Discipline Structure Cooperation Research Direction Key Laboratories Research Achievements Faculty Electrical Engineering Automation Computer Science & Engineering Electronic Engineering Instrument Science and Engineering Micro-Nano Electronics School of Software Academy of Information Technology and Electrical Engineering School of Cyber Security Electrical and Electronic Experimental Teaching Center Center for Advanced Electronic Materials and Devices Cooperative Medianet Innovation Center Alumni Events Announcement Publications Notable Alumni Give to SEIEE Networks and Connections Positions Forum Faculty Electrical Enginee... Automation Computer Science &... Electronic Enginee... Instrument Science... Micro-Nano Electro... School of Software Academy of Informa... School of Cyber Se... Electrical and Ele... Center for Advance... Cooperative Median... Computer Science & Engineering Name：Lu Hongtao Title：Professor Office：3-430 Office Phone：34204879 Email：lu-ht@cs.sjtu.edu.cn Website： Research Field Machine Learning, Pattern Recognition, Computer Vision, Information Hiding, Complex Networks Education B.S. degree in Mathematics from Sichuan normal university, Chengdu, in 1987.M.S. degree in Mathematics from Sichuan normal university, Chengdu, in 1990. Ph.D. degree in Electrical Engineering from Southeast university, Nanjing, in 1997 Work experience 1990-1993, lecture, the department of mathematics, Chuxiong normal university, Yunnan province, China. 1997-1999, post doctoral fellow, the department of computer science, Fudan university, Shanghai, China.1999-2001, associate professor, the department of computer science and engineering, Shanghai Jiao Tong university, Shanghai, China.2001 to present, professor, the department of computer science and engineering, Shanghai Jiao Tong university, Shanghai, China. 2001,2002,2004,2005, visiting scholar in City University of Hong Kong, the Hong Kong Polytechnic University, RIKEN (Japan) Research 1.\\tInvestigation of watermarking for tamperproof of web pages based on pattern recognition techniques, NSFC project.\\r2.\\tStability and pattern formation in delayed neural networks. SRFDP (the Special Research Fund for the Doctoral Program of Higher Education) project. \\r3.\\tNCET -05( Program for New Century Excellent Talents in University) project.\\r4.\\tStudies on some typical complex networks in information science. Shanghai Shuguang Program Awards and Honors Best paper award ACCV2009New Century Excellent Talent Program, by Ministry of Education of China, 2005Shanghai Shuguang (Dawn) Scholar, 2003Excellent paper award for young researchers from Shanghai Science Association, 2003 Teaching DSICRETE MATHEMATICS for undergraduate studentsARTIFICIAL INTELLIGENCE for undergraduate studentsDIGITAL IMAGE PROCESSING for graduate students Publications Journal papers: Neural Networks and Chaos1.\\tXiangjun Wu, Hongtao Lu, Shilei Shen, Synchronization of a new fractional-order hyperchaotic system. Physics Letters A, 373(2009)2329-2337.2.\\tHongtao Lu, Guanrong Chen, “Global synchronization in an array of linearly coupled delayed neural networks with an arbitrary coupling matrix,” International Journal of Bifurcation and Chaos, vol.16, no.11, pp.3357-3368, 2006.3.\\tHongtao Lu and Shun-ichi Amari, “Global exponential stability of multitime scale competitive neural networks with nonsmooth functions,” IEEE Transactions on Neural Networks, vol.17, no.5, pp.1152-1164, Sep. 2006.4.\\tHongtao Lu and C.A. Leeuven, “Synchronization of chaotic neural networks via output or state coupling,” Chaos, Solitons and Fractals, 30(2006)166-176.5.\\tHongtao Lu and Guanrong Chen, “Global exponential convergence of multi-time scale neural networks,” IEEE Transactions on Circuits and Systems II, vol.52, no.11, pp.761-765, November, 2005.6.\\tHongtao Lu, “Global exponential stability analysis of Cohen-Grossberg neural networks,” IEEE Transactions on Circuits and Systems II, vol.52, no.9, pp.476-479, August, 2005.7.\\tHongtao Lu，“Comments on ‘A Generalized LMI-Based Approach to the Global Asymptotic Stability of Delayed Cellular Neural Networks’”，IEEE Transactions on Neural Networks, vol.16, no.3, pp.778-779, May, 2005. 8.\\tHongtao Lu, Ruiming Shen and Fulai Chung, “Global exponential convergence of Cohen-Grossberg neural networks with time delays,” IEEE Transactions on Neural Networks, vol.16, no.6, pp.1694-1696, November, 2005.9.\\tHongtao Lu, Ruiming Shen, and Fu-Lai Chung, “Absolute exponential stability of a class of recurrent neural networks with multiple and variable delays,” Theoretical Computer Science, 344(2005)103-119.10.\\tHongtaoLu and XinzhenYu，Local bifurcations in delayed chaos anticontrol systems, Journal of Computational and Applied Mathematics, 181(2005)188-199.11.\\tHongtao Lu and Zhenya He, “Global exponential stability of delayed competitive neural networks with different time scales,” Neural Networks, 18(2005)243-250.12.\\tHongtao Lu, “Absolute exponential stability analysis of delayed neural networks,” Physics Letters A, 336(2005)133-140.13.\\tHongtao Lu, Zhenya He and Fulai Chung， “Some sufficient conditions for exponential stability of delayed neural networks”. Neural Networks, vol.17, pp.537-544, 2004。14.\\tHongtao Lu and K. S. Tang, “Chaotic Phase Shift Keying in Delayed Chaotic Anticontrol Systems”, International Journal of Bifurcation and Chaos，vol.12, no.5, 1017-1028, 2002.15.\\tHongtao Lu, “Chaotic attractors in delayed neural networks”. Physics Letters A, 298（2002）109-116. 16.\\tHongtao Lu “Stability criteria for delayed neural networks”, Physical Review E, vol.64,051901-1-051901-13,2001.17.\\tHongtao Lu, “On stability of nonlinear continuous-time neural networks with delays”. Neural Networks, vol. 13, 1135-1143, 2000.18.\\tHongtao Lu, Yongbao He and Zhenya He, “A chaotic generator: Analysis of the dynamic behaviour of a cellular neuron with delay”. IEEE Transactions on Circuits and Systems, no. 2, pp.178-181,1998.19.\\tHongtao Lu, Zhenya He, “Chaotic Behavior in First-Order Autonomous Continuous-Time Systems with Delay”. IEEE Transactions on Circuits and Systems, vol.43, no. 8, pp.700-702, 1996.20.\\tHongtao Lu, Zhenya He, \\\"Synchronization of chaotic systems based on system partition approaches\\\". Physics Letters A,vol.219, pp.271-276, 1996.Watermarking1.\\tWei Lu, Hongtao Lu and Fu-Lai Chung, “Feature based robust watermarking using image normalization”, Computers and Electrical Engineering,36(2010)2-18.2.\\tWei Lu, Wei Sun and Hongtao Lu, “Robust watermarking based on DWT and nonnegative matrix factorization”, Computers and Electrical Engineering, 35(2009)183-188.3.\\tQijun Zhao, Hongtao Lu, “PCA-based web page watermarking,” Pattern Recognition, 40 (2007) 1334-1341.4.\\tWei Lu, Fu-Lai Chung, Hongtao Lu and Kup-Sze Choi, Detecting Fake Images Using Watermarks and Support Vector Machines. Computer Standard and Interface，30（2008）132-136. 5.\\tWei Lu, Hongtao Lu and Fu-Lai Chung, “Novel robust image watermarking using difference correlation detector,” Computer Standards & Interfaces, vol. 29, no.1, pp.132-137, Jan. 2007.6.\\tWei Lu, Hongtao Lu and Fu-Lai Chung, “Robust digital image watermarking based on subsampling,” Applied Mathematics and Computation, vol. 181, no.2, pp.886-893, Oct., 2006.7.\\tWei Lu, Hongtao Lu and Fu-Lai Chung, “Feature based watermarking using template match,” Applied mathematics and computation 177(1):377-386, Jun. 2006.8.\\tWei Lu, Fu-Lai Chung and Hongtao Lu, “Blind fake image detection scheme using SVD,” IEICE Trans. Communications, vol. E89-B, no. 5, pp.1726-1728, May, 2006. 9.\\tRonghua Yao, Qijun Zhao, and Hongtao Lu, \\\"A Novel Watermark Algorithm for Integrity Protection of XML Documents,\\\" International Journal of Computer Science and Network Security, vol. 6, no. 2B, February 2006, pp. 202-20710.\\tQijun Zhao, Hongtao Lu, “A PCA-based watermarking scheme for tamper-proof of web pages,” Pattern recognition, 38(2005)1321-1323.11.\\tZhao Qijun, Lu Hongtao, Jiang Xiaohua, “Web page watermarking for tamper-proof,” Journal of Shanghai Jiao Tong University, vol.E-10, no.3, pp.280-284, Sep., 2005.12.\\tWei Lu, Hongtao Lu and Fu-Lai Chung, “Attacking subsampling-based watermarking,” IEICE Transactions on Fundamentals of Electronics, Communications and Computer Sciences, Vol.E88-A, no.11, pp.3239-3240, 2005.13.\\tRuiming Shen, Yonggang Fu and Hongtao Lu, “A Novel Image Watermarking Scheme based on Support Vector Regression,” Journal of systems and software, vol. 78, no.1, pp.1-8, Oct., 2005.14.\\tHongtao Lu, Ruiming Shen and Fu-lai Chung, “A fragile watermarking scheme for image authentication,” Electronics Letters，vol.39, no.12, pp.898-900,2003.15.\\tY.Fu, R.Shen and H.Lu, “Watermarking scheme based on support vector machine for colour images,” Electronics Letters, vol.40, no.16, pp.986-987，2004.Pattern Recognition:1.\\tQijun Zhao, David Zhang, L. Zhang and Hongtao Lu ，“Evolutionary Discriminant Feature Extraction with Application to Face Recognition,” EURASIP Journal on Advances in Signal Processing, accepted.2.\\tQijun Zhao, Hongtao Lu and David Zhang, “A fast evolutionary pursuit algorithm based on linearly combining vectors,” Pattern recognition, 39(2006) 310-312.3.\\tBai Hu, Hongtao Lu, “Satellite interference locating method based on support vector regression,” International Journal of Computer Science and Network Security, vol.6, no.11, pp.185-189, 2006.Complex Networks:1． Darong Lai, Hongtao Lu, Mario Lauria, Digeo Di Bernardo and Christine Nardini, Mania: a gene network reverse algorithm for compounds m",
  "content_length": 22257,
  "method": "requests",
  "crawl_time": "2025-12-01 13:20:56"
}