{
  "name": "Horst Karl Hahn",
  "homepage": "https://www.jacobs-university.de/directory/hhahn",
  "status": "success",
  "content": "History | Constructor University Skip to main content Application portal Image History About us History History Evolution of academic excellence Constructor University (previously called Jacobs University and International University Bremen) was founded in 1999 with the support of the University of Bremen, Rice University in Houston, Texas, and the Free Hanseatic City of Bremen. This year the university got preliminary state recognition by the Free Hanseatic City of Bremen.In fall 2001, 130 students from 40 countries arrived on campus and started their studies together with 27 professors – it was the start of the unique, highly international and diverse community that has become the hallmark of what marks Constructor University to this day.Ex-chancellor of Germany Helmut Schmidt presented the idea of the university in his speech at the official opening of the university in 2001: Germany urgently needs universities such as the one being inaugurated in Bremen today: that is, institutions of higher learning that are modern, performance-oriented, independent of the reins of state bureaucracies, interdisciplinary, and, at the same time, international. Helmut Schmidt, Ex-chancellor of Germany The Jacobs Foundation invested €200 million in the institution in November 2006, thus taking over a two-thirds majority of the partnership share. It was the largest donation in Europe ever made to a university. At the beginning of 2007, the university changed its name to Jacobs University Bremen.Together with Universität Bremen, Jacobs University Bremen received a 5.8 million euro grant from Deutsche Forschungsgemeinschaft (DFG) in the framework of the Excellence Initiative of the Federal Government and the Länder in 2007 to establish the Bremen International Graduate School of Social Sciences (BIGSSS).In November 2022, it changed its name to Constructor University  (learn more in the press release). History of the CampusThe campus is located on the site of the former Roland Barracks in Bremen-Grohn. The site was erected in 1936 during the National Socialist period as anti-aircraft barracks called Flak-Kaserne Grohn. After the Second World War it was used as headquarter of the American Military Forces for the Bremen enclave. Plans of the Senate of Bremen and the American Military Government for the Bremen enclave to install an International University already in these times at the site could not be realized. In 1948, it was transformed into a displaced-persons camp by the International Refugee Organization under the management of the American forces known as Camp Grohn. In 1951, the site was given back to the US Army and served as replacement center for US Forces in Germany. Shortly after the formation of the Bundeswehr, Camp Grohn was passed into the responsibility of the German government in 1955 and renamed Roland Kaserne. Roland Kaserne housed a Bundeswehr logistics school during the Cold War. In 1999, the military base was inactivated, making way for the university. Converting a military base into a university was an architectural challenge. The architectural firm commissioned (Böge & Lindner Architekten, Hamburg) received several awards for its work, among them the BDA-Price (Preis des Bundes Deutscher Architekten) in 2003 (for restructuration of Alfried-Krupp-College), an award in the frame of Deutscher Städtebaupreis in 2004 (for the restructuration as a whole) and the BDA-Price for the restructuration of Campus Center Lab 2 and Lab 3 in 2006.In 2009, with the College Nordmetall the first completely new building on campus was erected. This was followed in 2012 with the second new building: the Sports and Convention Center, designed by the architect Max Dudler, and which received a Special Mention in by the BDA Bremen Prize 2014. Accreditation and recognition1999 Preliminary state recognition by the Free Hanseatic City of Bremen2001 Institutional Accreditation by German Science and Humanities Council (“Wissenschaftsrat”, WR)2004 Full state Recognition for five years and first program accreditation of all bachelor programs by the German accreditation agency ACQUIN2006 Announcement of Jacobs Foundation’s investment of € 200 million, the largest donation in Europe ever made to a university (benefactor honored by name change at the beginning of 2007: “International University Bremen” becomes “Jacobs University Bremen”)2008 Institutional reaccreditation by the WR. A renewal of the reaccreditation is required only on request of the City of Bremen, as the university has permanently proven it’s academic constitution.2010 Renewal of the official state recognition by the Free Hanseatic City of Bremen2018 Renewal of the official state recognition by the Free Hanseatic City of Bremen until 20272021 Renewal of the official state recognition by the Free Hanseatic City of Bremen for an unlimited period @ 2025 Constructor University Bremen gGmbHImprintPrivacy PolicyCookies To top",
  "content_length": 4945,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:06"
}