{
  "name": "Horst Schirmeier",
  "homepage": "https://tu-dresden.de/ing/informatik/sya/professur-fuer-betriebssysteme/die-professur/team",
  "status": "success",
  "content": "Team — Professur für Betriebssysteme — TU Dresden Zur Hauptnavigation springen Zur Hauptnavigation springen Zur Suche springen Zum Inhalt springen © Sven Ellger Zentrale Kontaktadresse für Prüfungstermin- und sonstige Anfragen: os@mailbox.tu-dresden.de Lehrstuhlinhaber © Sven Ellger Lehrstuhlinhaber Name Herr Prof. Dr.-Ing. Horst Schirmeier E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3102 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. Sprechzeiten: nach Vereinbarung Sekretariat Sekretärin Name Frau Romy Jarschel E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3110 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. Seniorprofessur © Sven Ellger Seniorprofessor Name Herr Prof. Dr. rer. nat. Hermann Härtig E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3088 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. über Prof. Härtig Postdocs © Sven Ellger Postdoc & wissenschaftlicher Mitarbeiter am BI Name Herr Dr.-Ing. Nils Asmussen E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3092 Nöthnitzer Straße 46 01187 Dresden (nur nach Vereinbarung) Zeige Karte von diesem Ort. weiterführende Infos zum Barkhausen-Institut © Sven Ellger Postdoc Name Herr Dr.-Ing. Adam Lackorzynski E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3090 Nöthnitzer Straße 46 01187 Dresden (nur nach Vereinbarung) Zeige Karte von diesem Ort. work Tel. © Sven Ellger Postdoc und Gruppenleiter am BI Name Herr Dr.-Ing. Michael Roitzsch E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3092 Nöthnitzer Straße 46 01187 Dresden (nur nach Vereinbarung) Zeige Karte von diesem Ort. work Tel. Barkhausen-Institut © Sven Ellger Postdoc & wissenschaftlicher Mitarbeiter am BI Name Herr Dr.-Ing. Carsten Weinhold E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3092 Nöthnitzer Straße 46 01187 Dresden (nur nach Vereinbarung) Zeige Karte von diesem Ort. Barkhausen-Institut Wissenschaftliche Mitarbeiter und Doktoranden © Sven Ellger wissenschaftlicher Mitarbeiter & Doktorand Name Herr André Berthold M.Sc. E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3083 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. wissenschaftlicher Mitarbeiter & Doktorand Name Herr Dipl.-Inf. Jan Bierbaum E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3089 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. © Sven Ellger wissenschaftliche Mitarbeiterin & Doktorandin Name Frau Leonie Seelisch M.Sc. E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3087 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. © Sven Ellger wissenschaftlicher Mitarbeiter & Doktorand Name Herr Dipl.-Inf. Till Smejkal E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3087 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. © Sven Ellger wissenschaftlicher Mitarbeiter & Doktorand Name Herr Robin Thunig M.Sc. E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3083 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. © Sven Ellger wissenschaftlicher Mitarbeiter & Doktorand Name Herr Robert Walther M.Sc. E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3091 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. wissenschaftlicher Mitarbeiter & Doktorand Name Herr Tianhao Wang M.Sc. E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3089 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. Wissenschaftliche Mitarbeiter und Doktoranden am Barkhausen-Institut (BI) Doktorand & wissenschaftlicher Mitarbeiter am BI Name Herr Matthias Hille M.Sc. E-Mail senden Eine verschlüsselte E-Mail über das SecureMail-Portal versenden (nur für TUD-externe Personen). Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3087 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. work Tel. am Barkhausen-Institut Doktorand & wissenschaftlicher Mitarbeiter am BI Name Herr Dipl.-Inf. Till Miemietz E-Mail senden Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3087 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. © Sven Ellger Doktorand & wissenschaftlicher Mitarbeiter am BI Name Herr Viktor Reusch M.Sc. E-Mail senden Kontaktinformationen Organisationsname Professur für Betriebssysteme Professur für Betriebssysteme Adresse work Besuchsadresse: Andreas-Pfitzmann-Bau, Raum 3091 Nöthnitzer Straße 46 01187 Dresden Zeige Karte von diesem Ort. Barkhausen-Institut Dr. Claude-Joachim Hamann E-Mail claude.hamann@tu-dresden.de Telefon +49 351 463 38278 Martin Küttler E-Mail martin.kuettler@tu-dresden.de Raum APB 3089 Telefon +49 351 463 43529 Zu dieser Seite Horst Schirmeier Letzte Änderung: 10.11.2025 Diese Seite … … auf Facebook teilen … auf Twitter/X teilen … drucken … als E-Mail versenden",
  "content_length": 7973,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:06"
}