{
  "name": "Horácio C. Neto",
  "homepage": "https://tecnico.ulisboa.pt/pt/tag/horacio-neto",
  "status": "success",
  "content": "Horácio Neto – Técnico Lisboa Saltar para o conteúdo Tópico » Horácio Neto O professor Horácio Neto sagrou-se vice-campeão do Mundo de xadrez por correspondência.... Categorias Ciência e Tecnologia Campus e Comunidade Cultura e Desporto Multimédia Eventos Candidaturas Todas Multimédia Em destaque Eventos Pesquisar por: Pesquisar em: Todos os websites do Técnico Apenas este website Submeter Limpar Elogios, sugestões ou reclamações Elogios, sugestões ou reclamações A não ser que nos indique o contrário, este formulário é completamente anónimo. Escolha o tipo de mensagem que nos quer enviar. Elogio Sugestão Reclamação Propósito da sua mensagem Propósito da sua mensagem Escreva um texto breve e conciso. Sempre que considere relevante, forneça detalhes como o local e data dos acontecimentos. Escreva a sua mensagem aqui: Adicionar ficheiro Perfil de utilizador Perfil de utilizador Escolha a opção que mais se adequa ao seu perfil. Estudante Bolseiro Professor Investigador Funcionário Externo Campus Campus Que campus costuma frequentar? Alameda Taguspark Tecnológico e Nuclear Dados pessoais Dados pessoais Toda a informação que nos facultar será tratada de forma sigilosa. Não indicar os dados pessoais alerta os serviços visados, mas inviabiliza o tratamento da comunicação e a resolução do problema. Identificar-me Permanecer anónimo Preencha os seus dados pessoais Preencha os seus dados pessoais Os dados recolhidos serão apenas usados para o tratamento deste formulário. Nome* Email* Telefone/Telemóvel Enviar mensagem Enviar mensagem Prova que não és um robô: Formulário submetido com sucesso A sua mensagem foi recebida.Obrigado por nos enviar a sua opinião. Fechar A submissão do formulário falhou Parece-nos que a sua mensagem se perdeu no espaço.Por favor, tente novamente mais tarde. Fechar Voltar atrás",
  "content_length": 1823,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:08"
}