{
  "name": "Hossein Hojjat",
  "homepage": "https://teias.institute/people/faculty/cs/hossein-hojjat",
  "status": "success",
  "content": "Hossein Hojjat [email protected] Assistant Professor Bio He received his Ph.D. from EPFL Download CV Research Interests Formal Methods Software Verification Analysis and Synthesis Automated Reasoning Education Research Teaching Awards & Honors Postdoc, Cornell University Ph.D., EPFL M.S., University Of Tehran B.Sc., University Of Tehran Conference Papers Hossein Hojjat,Philipp RuÂ¨Mmer, Ali Shamakhi: âOn Strings In Software Model Checkingâ, Proceedings Of The 17th Asian Symposium On Programming Languages And Systems (APLAS2019) Hossein Hojjat, Philipp RuÂ¨Mmer: âThe Eldarica Horn Solverâ, Proceedings Of The 18th In- Ternational Conference On Formal Methods In Computer-Aided Design (FMCADâ18) Hossein Hojjat, Philipp RuÂ¨Mmer: âDeciding And Interpolating Algebraic Data Types By Reductionâ, Proceedings Of The 19th International Symposium On Symbolic And Numeric Algorithms For Scientific Computing (SYNASCâ17) Jedidiah McClurg, Hossein Hojjat, Pavol Cerny: âSynchronization Synthesis For Network Programsâ, Proceedings Of The 29th International Conference On Computer Aided Verification (CAVâ17) Shrutarshi Basu, Nate Foster, Hossein Hojjat, Paparao Palacharla, Christian Skalka, Xi Wang: âLife On The Edge: Unraveling Policies Into Configurationsâ, Proceedings Of The ACM/IEEE Symposium On Architectures For Networking And Communications Systems (ANCSâ17) Hossein Hojjat: âThe FMCAD 2016 Graduate Student Forumâ, Proceedings Of The 16th Inter- National Conference On Formal Methods In Computer-Aided Design (FMCADâ16) Hossein Hojjat, Philipp RuÂ¨Mmer, Jedidiah McClurg, Pavol Cerny, Nate Foster: âOptimiz- Ing Horn Solvers For Network Repairâ, Proceedings Of The 16th International Conference On Formal Methods In Computer-Aided Design (FMCADâ16) Jedidiah McClurg, Hossein Hojjat, Nate Foster, Pavol Cerny: âEvent-Driven Network Pro- Grammingâ , Proceedings Of The 37th ACM SIGPLAN Conference On Programming Language Design And Implementation (PLDIâ16) Jedidiah McClurg, Hossein Hojjat, Pavol CËernyÂ´, Nate Foster: âEfficient Synthesis Of Network Updatesâ, Proceedings Of The 36th ACM SIGPLAN Conference On Programming Language Design And Implementation (PLDIâ15) Sudip Roy, Lucja Kot, Gabriel Bender, Bailu Ding, Hossein Hojjat, Christoph Koch, Nate Foster, Johannes Gehrke: âThe Homeostasis Protocol: Avoiding Transaction Coordination Through Program Analysisâ, Proceedings Of The 2015 ACM SIGMOD International Confer- Ence On Management Of Data (SIGMODâ15) Hossein Hojjat, Jedidiah McClurg, Pavol CËernyÂ´, Nate Foster: âNetwork Updates For The Impatient: Eliminating Unnecessary Waitsâ, Proceedings Of The First Workshop On Program- Ming Languages And Verification Technology For Networking (PLVNETâ15) Hossein Hojjat, Philipp RuÂ¨Mmer, Pavle Subotic, Wang Yi: âHorn Clauses For Communicating Timed Systemsâ, Proceedings Of The First Workshop On Horn Clauses For Verification And Synthesis (HCVSâ14) Philipp RuÂ¨Mmer, Hossein Hojjat, Viktor Kuncak: âClassifying And Solving Horn Clauses For Verificationâ, Proceedings Of The 5th International Conference On Verified Software: Theories, Tools, Experiments (VSTTEâ13) Philipp RuÂ¨Mmer, Hossein Hojjat, Viktor Kuncak: âDisjunctive Interpolants For Horn-Clause Verificationâ, Proceedings Of The 25th International Conference On Computer Aided Verifica- Tion (CAVâ13) Hossein Hojjat, Radu Iosif, Filip KoneËcnyÂ´, Viktor Kuncak And Philipp RuÂ¨Mmer: âAcceler- Ating Interpolantsâ, Proceedings Of The 10th International Symposium On Automated Tech- Nology For Verification And Analysis (ATVAâ12) Hossein Hojjat, Filip KoneËcnyÂ´, Florent Garnier, Radu Iosif, Viktor Kuncak And Philipp RuÂ¨Mmer: âVerification Toolkit For Numerical Transition Systems (Tool Paper)â, Proceedings Of The 18th International Symposium On Formal Methods (FMâ12) Bahman Pourvatan, Marjan Sirjani, Hossein Hojjat And Farhad Arbab: âAnalysis Of Reo Circuits Using Symbolic Executionâ, Proceedings Of The 8th International Workshop On The Foundations Of Coordination Languages And Software Architectures (FOCLASAâ09) Hossein Hojjat, Mohammad Reza Mousavi, Marjan Sirjani: âProcess Algebraic Verification Of SystemC Codesâ, Proceedings Of The 8th International Conference On Application Of Con- Currency To System Design (ACSDâ08) Hossein Hojjat, Mohammad Reza Mousavi, Marjan Sirjani: âA Framework For Performance Evaluation And Verification In Stochastic Process Algebrasâ, Proceedings Of The 22nd ACM Symposium On Applied Computing, Software Verification Track (SVâ08) Hossein Hojjat, Marjan Sirjani, Mohammad Reza Mousavi And Jan Friso Groote: âSarir: A Rebeca To MCRL2 Translatorâ, Proceedings Of The 7th IEEE International Conference On Application Of Concurrency To System Design (ACSDâ07) Fahimeh Raja , Hadi Amiri , Samira Tasharofi, Hossein Hojjat And Farhad Oroumchian: âEvaluation Of Part Of Speech Tagging On Persian Textâ, Proceedings Of The Second Workshop On Computational Approaches To Arabic Script-Based Languages (CAASL2â07) Hadi Amiri, Hosein Hojjat, Farhad Oroumchian: âInvestigation On A Feasible Corpus For Persian POS Taggingâ (In Persian), Proceedings Of The 12th International CSI Computer Conference (CSICCâ07) Hossein Hojjat, Hootan Nakhost, Marjan Sirjani: âFormal Verification Of The IEEE 802.1D Spanning Tree Protocol Using Extended Rebecaâ, Proceedings Of The First IPM International Workshop On Foundations Of Software Engineering (FSENâ05) Journal Papers Philipp RuÂ¨Mmer, Hossein Hojjat, Viktor Kuncak: âOn Recursion-Free Horn Clauses And Craig Interpolationâ, Formal Methods In System Design, V.47, N. 1, Pp. 1-25, 2015. Bahman Pourvatan, Marjan Sirjani, Hossein Hojjat And Farhad Arbab: âSymbolic Execution Of Reo Circuits Using Constraint Automataâ, Science Of Computer Programming, Elsevier, V.77, N. 7-8, Pp. 848-869, 2012. Hossein Hojjat, Mohammad Reza Mousavi, Marjan Sirjani: âFormal Analysis Of SystemC Designs In Process Algebraâ, Fundamenta Informaticae, V. 107, N. 1, Pp. 19-42, 2011. Hossein Hojjat, Hootan Nakhost, Marjan Sirjani: âIntegrating Module Checking And Deduc- Tion In A Formal Proof For The Perlman Spanning Tree Protocol (STP)â, J.UCS Journal Of Universal Computer Science, V. 13, N. 13, Pp. 2076-2104, 2007. Technical Reports Jedidiah McClurg, Hossein Hojjat, Nate Foster, Pavol CËernyÂ´: âSpecification And Compilation Of Event-Driven SDN Programsâ, CoRR Abs/1507.07049, 2015. Hossein Hojjat, Philipp RuÂ¨Mmer, Pavle Subotic, Wang Yi: âUniform Analysis For Commu- Nicating Timed Systems (Extended Technical Report)â, EPFL-REPORT-190680, 2013. Hossein Hojjat, Mohammad Reza Mousavi Mousavi, Marjan Sirjani: âApplication Of Pro- Cess Algebraic Verification And Reduction Techniques To SystemC Designsâ, Computer Science Report No. 08-15, Technische Universiteit Eindhoven, 2008. Farhad Oroumchian, Samira Tasharofi, Hadi Amiri, Hossein Hojjat, Fahimeh Raja: âCreating A Feasible Corpus For Persian POS Taggingâ, Technical Report Number TR 3/2006, University Of Wollongong In Dubai, 2006. Undergraduate Programming Languages And Compilers: Fall 2018, Spring 2019, University Of Tehran. Programming Language Concepts (CSCI-344): Fall 2016, Rochester Institute Of Technology. Theory Of Computation: Fall 2019, University Of Tehran. Graduate Compiler Construction (CSCI-742): Spring 2017, Spring 2018, Rochester Institute Of Technology. Programming Language Theory (CSCI-740): Fall 2017, Rochester Institute Of Technology. Introduction To Formal Methods (With Fatemeh Ghassemi): Fall 2018, Fall 2019, University Of Tehran. Software Synthesis: Spring 2019, University Of Tehran. Distinguished Artifact Award at ETAPS 2025 Conference Program Committee Member at CAV 2025 Paper Acceptance in OOPSLA 2024",
  "content_length": 7862,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:12"
}