{
  "name": "Hossein Rahmani 0001",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/hossein-rahmani",
  "status": "success",
  "content": "Hossein Rahmani - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Hossein Rahmani Professor in Computer Vision and Machine Learning Research Overview Hossein Rahmani received the Ph.D. degree from the University of Western Australia, the MSc degree from Shahid Beheshti University, and the BSc degree from Isfahan University of Technology. His research interests include computer vision and machine learning. His works have been published in premier computer vision journals and conferences, including TPAMI, CVPR, ICCV, and ECCV. He received the Best Scientific Paper Award from the International Conference on Pattern Recognition. He is an Associate Editor of IEEE Transactions on Neural Networks and Learning Systems, Pattern recognition, ACM Computing Surveys , and Area Chair of CVPR 2025, CVPR 2024, ICLR 2025, ECCV 2024, IIJCAI 2023 and IJCAI 2024. Google Scholar: https://scholar.google.com/citations?user=zFyT_gwAAAAJ&hl=en Personal Webpage: https://sites.google.com/view/rahmaniatlu Show more… PhD Supervision Interests I am always looking for PhD students with a good background in Programming and/or Maths. Please contact me if you are interested in working together on exciting research topics. Show less Publications Projects Activities PhD Students Research Groups SPRITE+: Assessing the accessibility of AI-based Face anti-spoofing technology for marginalised Australian communities 15/09/2025 → 01/09/2026 Research Accelerated Knowledge Transfer Project with Station 10 Ltd. 14/12/2022 → 31/03/2023 Research Accelerated Knowledge Transfer Project with Station 10 Ltd. 14/12/2022 → 31/03/2023 Research Biometric-based artificial intelligence to identify suspects of serious crime in large datasets 01/09/2021 → 31/08/2022 Research H2020 : Foundations of Trustworthy AI - Integrating Reasoning, Learning and Optimization (TAILOR) 01/09/2020 → 31/08/2024 Research Fast Autonomous Screening on Trains 04/11/2019 → 03/02/2020 Research H-unique: In search of uniqueness - harnessing anatomical hand variation 01/01/2019 → 31/12/2024 Research H-unique: In search of uniqueness - harnessing anatomical hand variation 01/01/2019 → 31/12/2024 Research Advanced Robotics with 3D Computer Vision for Automatic Healthcare Monitoring 01/01/2018 → 01/01/2019 Research H-Unique Demo [ECCV2024] Oral presentation H-Unique Demo [EAB-RPC2024] Oral presentation H-Unique Demo Oral presentation THE 32nd INTERNATIONAL JOINT CONFERENCE ON ARTIFICIAL INTELLIGENCE (Event) Publication peer-review IEEE Transactions on Neural Networks and Learning Systems (Journal) Editorial activity IET Computer Vision (Journal) Editorial activity Multi-Modal Video Reasoning and Analyzing Competition Participation in workshop, seminar, course PeerJ Computer Science (Journal) Editorial activity IEEE Access (Journal) Editorial activity IEEE Transactions on Neural Networks and Learning Systems (Journal) Publication peer-review IEEE Transactions on Circuits and Systems for Video Technology (Journal) Publication peer-review IEEE Transactions on Cybernetics (Journal) Publication peer-review IEEE Transactions on Pattern Analysis and Machine Intelligence (Journal) Publication peer-review Deep Learning for Computer Vision Public Lecture/ Debate/Seminar Pattern Recognition (Journal) Publication peer-review 3D Action Recognition From Novel Viewpoints Oral presentation ECCV 2022 Outstanding Reviewer Other distinction ICCV 2017 Young Researcher Awards Prize (including medals and awards) ICPR 2014 Best Scientific Paper Award National/international honour CVPR 2023 Outstanding Reviewers Other distinction Wayil Alanazi PhD student enable JavaScript to view email address Ratchakrit Arreerard PhD student SCC (Data Science) enable JavaScript to view email address Xiaofei Hui PhD student, Associate Lecturer Digital Health Group enable JavaScript to view email address Zhuoling Li PhD student, Associate Lecturer Digital Health Group enable JavaScript to view email address Haoxuan Qu PhD student Digital Health Group enable JavaScript to view email address Artificial Intelligence DSI - Foundations SCC (Data Science) Security Lancaster Security Lancaster (Behavioural Science) Security Lancaster (Secure Machine Learning and Intelligence) Security Lancaster (Systems Security) Back to listing Contact Details Department: Computing and Communications Office: D17, D - Floor, InfoLab21 enable JavaScript to view email address Back to listing",
  "content_length": 4685,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:08"
}