{
  "name": "Houari A. Sahraoui",
  "homepage": "http://www.iro.umontreal.ca/~sahraouh",
  "status": "success",
  "content": "Houari A. Sahraoui English Houari Sahraoui Professeur titulaire Téléphone : (514) 343-5746 Télécopieur : (514) 343-5834 Courriel : sahraoui [A T] iro.umontreal.ca Domaines de recherche Visualisation du logiciel Transformation de modèles Métriques et qualité du logiciel Rétro et re- ingénierie Publications Biographie HOUARI A. SAHRAOUI est professeur titulaire au département d'informatique et de recherche opérationnelle (laboratoire de génie logiciel GEODES) de l'Université de Montréal. Avant de rejoindre l'université, il a oeuvré comme chercheur principal du groupe génie logiciel et ingénierie de la connaissance au Centre de Recherche Informatique de Montréal. Il a obtenu un diplôme d'ingénieur de l'Institut National d'Informatique (1990), Alger, Algérie, et un Doctorat en Informatique de l'Université Pierre et Marie Curie - lip6(1995), Paris, France, spécialisé en Intelligence Artificielle (méta-modélisation en objet et transformation de modèles avec application à la GLAO). Ses intérêts de recherche portent entre autres sur l’application des techniques de l’intelligence artificielle au génie logiciel, les métriques et la qualité des logiciels à objets, la visualisation du logiciel, ainsi que la ré-ingénierie. Il a publié près de 200 articles dans des revues, conférences et ateliers et a édité 3 livres. Il est régulièrement auteur de séminaires invités. Il a été membre de comités de programme de nombreuses conférences IEEE et ACM, membre du comité de lecture de trois revues et organisateur de plusieurs conférence et ateliers. Il a été le general chair de la conférence IEEE Automated Software Engineering en 2003, le PC co-chair de VISSOFT2011, et le general chair de VISSOFT2014. Étudiants En cours E. Batot (PhD) W. Kessentini (PhD) C. Mokaddem (PhD) M. Gallais-Jimenez (MSc) M. Laraki (MSc) Anciens A. Saied (PhD) A. Shatnawi (PhD) A. Seriai (PHD) A. Ouni (PhD) O. Benomar (PhD) M. Faunes (PhD) H. Saada (PhD) S. Allier (PhD) M. Kessentini (PhD) G. Langelier (PhD) S. Vaucher (PhD) G. El Boussaidi (PhD) M. Haydar (PhD) G. Malek (PhD) T. V. Pham (PhD) T. L. A. Dinh (PhD) H. M. Rouane, (PhD) M. A. Serhani (PhD) L. Wu (PhD) S. Bouktif (PhD) D. Azar (PhD) D. Grosser (Postdoc) M. Haidar (Postdoc) J. Pardillo Vela (Postdoc) Hani Abdeen (Postdoc) A. Ndiaye (MSc) D. Ahumada (MSc) I. Baki (MSc) K. Bali (MSc) Q. Chevet (MSc) J. Mammo (MSc) A. Sfayhi (MSc) H. Aloulou (MSc) F. Duseau (MSc) A. Bouchoucha (MSc) S. Bouvier (MSc) D. Haouari (MSc) J. Jridi (MSc) A. Zoghlami (MSc) H. Grati (MSc) K. Dhambri (MSc) S. Hassaine (MSc) F. Yang (MSc) G. Langelier (MSc) D. M. Barburas (MSc) S. El Aoumari (MSc) M. Rouatbi (MSc) L. Ait Mhedine (MSc) L. Cheikhi (MSc) N. Mehio (MSc) N. Ben Ayed (MSc) H. Zhang (MSc) K. Zellag (MSc) S. Zheng (MSc) M. Gang (MSc) N. Ziani (MSc) H Chawiche (MSc) Z. Hazim (MSc) I. Konkobo (MSc) S. Shen (MSc) M. A. Serhani (MSc) M. Essalih (MSc) Activités professionnelles connexes Conférences, ateliers et revues General chair IEEE Working Conference on Software Visualization (14) PC co-chair VISSOFT (11) International Journal of Software Engineering and its Applications (Editorial board member) ARIMA (Editorial board member) l'Objet (Editorial board member) PC member : GECCO-SBSE (14) ICMT (14), IEEE ICSM (10), ECMFA (09, 10, 11, 12, 13, 14), VISSOFT (09, 13, 14), IEEE/ACM ASE (00, 01, 02, 04, 05, 07, 08, 12, ERP in 11), IEEE METRICS (02, 03), ECOOP (02), APSEC (07, 08), LMO (02, 03, 04, 05, 06,09), CARI (02, 04, 06, 08), ISPS (05, 07, 09), IEEE WESS (02), IWCMQ (02, 03), SAM (04), DÉCOR (04), IDM (06, 07), CAL (06, 07, 08), QUATIC (07), IWPSE (07), ... Steering committee member : ASE, VISSOFT, and LMO Organizer : ECOOP/ECMFA/ECSA 2013 (Poster and demo co-chair), IEEE ASE 2003 (General Chair), LMO 2000 & 2008 (Organization chair), CAL 2008 (Organization chair),IEEE ICSM 2002 (Workshop chair), ECOOP-QAOOSE 1998 to 2008 (Oganizer) Cours (Accès restreint) IFT6252 (Méthodes empiriques en génie logiciel) IFT3030 (Bases de données) IFT2255 (Introduction au génie logiciel) IFT3913 (Qualité du logiciel et métrques) Description du cours (H2012) Site web du cours (accès protégé) IFT6251 (Sujets spéciaux en génie logiciel) IFT3051 (projets informatiques) IFT3052 (projets informatiques) Prix et Bourses Best paper award CASCON, 2010 Best paper award BM-FA, 2010 Ayuda para la movilidad, Ministerio de Educación y Ciencia (Espagne), 2005. ACM SIGSOFT Distinguished Paper Award 2005. Excellence in Science Teaching Award (2003-2004), Université de Montréal. ACM Recognition of Service Award, 2003.",
  "content_length": 4553,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:10"
}