{
  "name": "Houwei Cao",
  "homepage": "https://site.nyit.edu/bio/hcao02",
  "status": "success",
  "content": "Houwei Cao | New York Tech Staff & Faculty Directory Houwei Cao Associate Professor; Computer Science, College of Engineering & Computing Sciences Education Credentials: Ph.D.Expertise: Data Science, Machine Learning, Speech and Natural Language Processing, Affective ComputingJoined New York Tech: 2016 Houwei Cao is an assistant professor in the Department of Computer Science at New York Institute of Technology (NYIT). She was an adjunct professor at the Computer Science and Engineering Department of the Tandon School of Engineering of New York University before joining New York Tech. She obtained her Ph.D. degree in Electronic Engineering from the Chinese University of Hong Kong in 2011, and worked on an RGC grant on automatic speech recognition of Cantonese-English code-mixing speech. She was a postdoctoral fellow at University of Pennsylvania from 2011 to 2014 and worked on an NIH grant on the computational quantification of emotion in faces and voice for neuropsychiatry. While at Tufts University from 2014 to 2015, Cao worked on an NSF grant on social robotics and Parkinson’s disease. She was also an Insight Data Science fellow in 2015. Cao’s main areas of research are signal processing; machine learning; data mining and its applications in human-centric data analytics, with emphasis on developing computational methods for speech recognition; text analytics; affect detection; and healthcare analysis. She won the audiovisual emotion recognition challenge (AVEC) in 2012. Cao is a member of the International Speech Communication Association (ISCA), the Association for the Advancement of Affective Computing (AAAC), and IEEE. She has served as a reviewer for numerous conferences and journals including Interspeech, ISCSLP, O-COCOSDA, IEEE Transactions on Speech and Audio Processing, Speech Communications, and IET Computer Vision. Recent Projects/Research Affective Computing: multimodal emotion and affect analysis, detection & recognition Speech Processing: multilingual speech recognition & synthesis Natural Language Processing: sentiment analysis & topic detection Data Science: data analytics for social networks, healthcare information systems Selected Publications Houwei Cao, Arman Savran, Ragini Verma, and Ani Nenkova, “Acoustic and Lexical Representations for Affect Prediction in Spontaneous Conversations”, Computer Speech and Language, Vol. 29, No. 1, pp. 203-217, January 2015. Houwei Cao, Ragini Verma, and Ani Nenkova, “Speaker-sensitive Emotion Recognition via Ranking: Studies on Acted and Spontaneous Speech”, Computer Speech and Language, Vol. 29, No. 1, pp. 186-202, January 2015 Houwei Cao, David G. Cooper, Michael K. Keutmann, Ruben C. Gur, Ani Nenkova, and Ragini Verma, “CREMA-D: Crowd-sourced Emotional Multimodal Actors Dataset”, IEEE Transactions on Affective Computing, Vol. 5, No. 4, pp. 377-390, November 2014. Arman Savran, Houwei Cao, Ani Nenkova, and Ragini Verma, “Bayesian Fusion for Affect Sensing: Combining Video, Audio and Lexical Modalities”, IEEE Transactions on Cybernetics, Vol. 45, No. 9, pp. 1927-1941, October 2014. Honors and Awards Challenge Winner, 2nd International Audio/Visual Emotion Challenge (AVEC 2012), International Conference on Multimodal Interaction (ICMI 2012), Santa Monica, Calif., October 2012. Courses Taught at New York Tech CSCI 300: Database Management CSCI 401: Database Interface and Programming Contact Information Email: hcao02@nyit.edu Phone: 646.273.6203 Office: New York, NY Website: https://sites.google.com/site/houweicao By continuing to use the website, you consent to analytics tracking per New York Tech's Privacy StatementAccept Cookies",
  "content_length": 3652,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:12"
}