{
  "name": "Hovav Shacham",
  "homepage": "http://cseweb.ucsd.edu/~hovav",
  "status": "success",
  "content": "Hovav Shacham Hovav Shacham Professor Department of Computer Science and Engineering University of California, San Diego Office: EBU 3B 3124 E-mail: hovav@cs.ucsd.edu Address: UCSD Dept. of CSE 9500 Gilman Drive, MC 0404 La Jolla, CA 92093-0404 Phone: (858) 822-7921 Fax: (858) 534-7029 On this page: Professional Activities Recent Publications (and all publications) Teaching Students Brief Biography Elsewhere: Google Scholar profile Personal Site In Fall, 2018, I will join the Computer Science Department at The University of Texas at Austin. I look forward to working with talented graduate students and undergraduate Turing Scholars—please apply! Professional Activities I am co-program chair (with Christopher Kruegel) of IEEE Security and Privacy (“Oakland”) 2019. I am co-program chair (with Alexandra Boldyreva) of Crypto 2018. In February, 2016, I submitted, along with other security researchers, a brief of amici curiae in support of Apple, organized by Stanford’s Center for Internet and Society. In January, 2014, I signed an open letter from US researchers in cryptography and information security: masssurveillance.info. Publications Recent publications include: H. Shacham. “Short Unique Signatures from RSA with a Tight Security Reduction (in the Random Oracle Model).” In S. Meiklejohn and K. Sako, eds., Proceedings of Financial Crypto 2018. Feb. 2018. To appear. D. Kohlbrenner and H. Shacham, “On the Effectiveness of Mitigations Against Floating-Point Timing Channels.” In E. Kirda and T. Ristenpart, eds., Proceedings of USENIX Security 2017. USENIX, Aug. 2017. W. Lian, H. Shacham, and S. Savage, “A Call to ARMs: Understanding the Costs and Benefits of JIT Spraying Mitigations.” In A. Juels, ed., Proceedings of NDSS 2017. Internet Society, Feb. 2017. S. Checkoway, J. Maskiewicz, C. Garman, J. Fried, S. Cohney, M. Green, N. Heninger, R.-P. Weinmann, E. Rescorla, and H. Shacham, “A Systematic Analysis of the Juniper Dual EC Incident.” In C. Kruegel, A. Myers, and S. Halevi, eds., Proceedings of CCS 2016. ACM Press, Oct. 2016. (Details; PDF) Best paper award! W. Lian, H. Shacham, and S. Savage. “An Investigation of the FreeBSD r278907 RNG Bugfix.” Manuscript, Oct. 2016. (Details; PDF) D. Kohlbrenner and H. Shacham. “Trusted Browsers for Uncertain Times.” In T. Holz and S. Savage, eds., Proceedings of USENIX Security 2016, pages 463–80. USENIX, Aug. 2016. (Details) S. Hill, Z. Zhou, L. Saul, and H. Shacham. “On the (In)effectiveness of Mosaicing and Blurring as Tools for Document Redaction.” Proc. Privacy Enhancing Technologies 2016(4):403–17, Oct. 2016. Presented at PETS 2016. (Details; PDF) A. Venkat, S. Shamasunder, D. Tullsen, and H. Shacham. “HIPStR—Heterogeneous-ISA Program State Relocation.” In Y. Zhou, ed., Proceedings of ASPLOS 2016, pages 727–41. ACM Press, Apr. 2016. (Details; PDF) All my publications are available online. Teaching CSE 127, Computer Security: Winter 2018; Spring 2017; Fall 2016; Spring 2016; Spring 2015; Spring 2014; Spring 2013; Fall 2011; Spring 2011; Spring 2010; Fall 2008; Winter 2008. CSE 0175, Demo Programming: Winter 2017. CSE 290, Early Papers in Computer Security: Fall 2016 (with Deian Stefan). CSE 209B, Transport Layer Security: Winter 2016. CSE 105, Automata and Computability Theory: Winter 2016; Winter 2015; Fall 2014; Fall 2013; Fall 2012; Winter 2012; Winter 2011; Fall 2009. CSE 290, Subexponential Algorithms for Factoring and Discrete Logarithm: Spring 2014 (with Sorina Ionica and Shachar Lovett). CSE 227, (Graduate) Computer Security: Winter 2014; Winter 2011; Winter 2009. IRGN 490, Cybersecurity Policy: Spring 2012 (with Peter F. Cowhey). CSE 208, Pairings in Cryptography: Winter 2010; Weizmann Institute, Spring 2006. Current Students Ph.D. students: David Kohlbrenner Former Students Wilson Lian (Ph.D. 2016) → Google Jacob Maskiewicz (M.S. 2016) → Facebook Keaton Mowery (Ph.D. 2015) → Apple Daniel Cashman (M.S. 2013) → Google Stephen Checkoway (Ph.D. 2012) → Johns Hopkins → UI Chicago Aishwarya Venkataraman (M.S. 2012) → Stack iQ Grace Wang (M.S. 2010) → Qualcomm Brief Biography Hovav Shacham’s research interests are in applied cryptography, systems security, privacy-enhancing technologies, and technology policy. Shacham was a student at Stanford and a postdoctoral fellow at the Weizmann Institute. From 2007 to 2018, he was on the faculty at the University of California, San Diego. He received the 2017 ACM CCS Test-of-Time Award for his 2007 paper that introduced return-oriented programming. Shacham took part in California’s 2007 “Top-to-Bottom” voting systems review and served on the advisory committee for California’s 2011–13 post-election risk-limiting audit pilot program. His work has been cited by the Federal Trade Commission, the National Highway Traffic Safety Administration, and the RAND Corporation. Image Credits Photo copyright 2010 by Nick Vossbrink. All rights reserved. Portrait copyright 2011 by Natalie Bessell. All rights reserved. BSD Daemon Copyright 1988 by Marshall Kirk McKusick. All Rights Reserved. Permission to use the daemon may be obtained from: Marshall Kirk McKusick 1614 Oxford St Berkeley, CA 94709–1608 USA or via email at mckusick@mckusick.com. Navigation: Hovav Shacham",
  "content_length": 5233,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:13"
}