{
  "name": "Hsin-Hsi Chen",
  "homepage": "http://nlg.csie.ntu.edu.tw/advisor.php",
  "status": "success",
  "content": "NTU NLPL's Homepage台大自然語言處理實驗室 指導教授 Advisor | 成員 Members | 課程 Courses | 研究方向 Research Directions | 研究成果 Achievements | 資源 Resources | 新生招募 Recruiting 指導教授 / Advisor HSIN-HSI CHEN (陳信希) Hsin-Hsi Chen received the B.S. and the M.S. degrees in computer science and information engineering in 1981 and 1983, respectively, and the Ph.D. degree in electrical engineering in 1988, all from National Taiwan University, Taipei, Taiwan. Since August 2018, Hsin-Hsi Chen has been a distinguished professor in Department of Computer Science and Information Engineering, National Taiwan University. He served as chair of the department from 2002 to 2005. From 2006 to 2009, he was chief director of Computer and Information Networking Center. He served as associate dean of College of Electrical Engineering and Computer Science from 2015 to 2018. Now he is director of Joint Research Center for AI Technology and All Vista Healthcare (from January 2018) and Secretary in Medical Affairs of National Taiwan University Hospital (from August 2019) and Director of Center of Intelligent Healthcare (from August 2020). His research interests are natural language processing, information retrieval and extraction, and web mining. Hsin-Hsi Chen is a member of ACL (1986-) and ACLCLP (1988-). He served as President (2007-2009) and Advisory Board Chair (2009-2011) of Association for Computational Linguistics and Chinese Language Processing (ACLCLP), and Chair (2011-2013) of SIGHAN, a Special Interest Group of the Association for Computational Linguistics. He was also Editorial Board member (2000-2008) of International Journal of Computational Linguistics and Chinese Language Processing, an Associate Editor (2007-2010) of ACM Transactions on Asian Language Information Processing, and an Editor of Journal of Information Science and Engineering (2010-). He was a keynote speaker at IALP 2016 and a local organization committee co-chair of IJCNLP 2017. He was general chair of ACM SIGIR 2023, senior area chair of ACL 2024, senior area chair of LREC-COLING 2024, tutorial co-chair of COLING 2022, system demonstration co-chair of ACL-IJCNLP 2015, conference chair of IJCNLP 2013, program co-chair of ACM SIGIR 2010, program co-chair of ICADL 2012, served as steering committee member of AIRS, senior PC members of ACM SIGIR 2006, 2007, 2008 and 2009, area/track chairs of AAAI 2020, EMNLP 2018, ACL 2012, ACL-IJCNLP 2009 and ACM CIKM 2008, and PC members of many conferences (IJCAI, AAAI, SIGIR, CIKM, WSDM, AIRS, ACL, COLING, EMNLP, NAACL, EACL, IJCNLP, WWW, and so on). He was one of organizers of CLIR, CLQA, MOAT and FinNum tasks in NTCIR. He received Google research awards in 2007 and 2012, awards of Microsoft Research Asia in 2008 and 2009, NTU EECS Academic Award in 2011, NTU Award for Outstanding Service in 2011, MOST Outstanding Research Award in 2017, NTU Outstanding Teaching Awards in 2018, 2019, 2021 and 2023, the AmTRAN Chair Professorship in 2018, NTU Outstanding Mentor Award in 2019, Outstanding ICT Elite Award 2019, APPIER AI Chair Professorship in 2021, NSTC Outstanding Research Award in 2022, 19th National Innovation Award in 2022, 20th National Innovation Award in 2023, Garmin Chair Professorship (2024/8/1-2027/7/31), and NTU Distinguished Teaching Award in 2024. 陳信希教授於1981年和1983年分別取得國立臺灣大學資訊工程學系學士和碩士學位，1988年取得國立臺灣大學電機工程學系博士學位。1988年8月-1995年7月擔任國立臺灣大學資訊工程學系副教授，1995年8月升等為正教授，2018年8月起為特聘教授，2018年瑞軒科技講座教授，2021年APPIER AI講座教授，2024年8月至2027年7月Garmin 講座教授。2002年8月到2005年7月，接任國立臺灣大學資訊工程學系系主任。2006年8月到2009年7月兼任國立臺灣大學計算機及資訊網路中心主任。2015年8月到2018年7月接任國立臺灣大學電機資訊學院副院長。2020年8 月1日到2023年7月31日擔任國立臺灣大學智慧醫療學分學程主任。目前是臺大人工智慧技術暨全幅健康照護聯合研究中心主任(2018年1月起)、臺大醫院醫務秘書(2019年8 月1日起)、及臺大醫院智慧醫療中心主任（2020/8迄今）。 陳信希教授的研究興趣，包括自然語言處理、資訊檢索與擷取、網路探勘等。他曾擔任台灣計算語言學學會理事長(2007-2009)和監事主席(2009-2011)，ACL SIGHAN主席(2011-2013)，中文計算語言學期刊編輯委員(2000-2008)，ACM Transactions on Asian Language Information Processing Associate Editor(2007-2010)、Journal of Information Science and Engineering Editor (2010-)，曾分別擔任世界兩大資訊檢索評比Cross-Language Evaluation Forum (CLEF)和NTCIR的Steering Committee Members，也為資訊檢索領域最好的國際會議ACM SIGIR 2006的Cross-Language Retrieval領域的Coordinator、ACM SIGIR 2007和SIGIR 2008 Senior PC Member、ACM SIGIR 2009 “Language, CLIR, QA”領域Chair、以及自然語言處理頂級國際會議－ACL 2009年 Information Retrieval Area Chair 和ACL 2012 QA Area Chair，IJCNLP 2013 General Chair，ACL-IJCNLP 2015 Demo Co-Chair，IJCNLP 2017 Organization Co-Chair， EMNLP 2018 Area Chair，AAAI 2020 Area Chair、COLING 2022 Tutorial Co-Chair、ACM SIGIR 2023 General Chair、LREC-COLING 2024 Senior Area Chair、以及ACL 2024 Senior Area Chair。也曾擔任多項國際會議議程委員，如IJCAI, AAAI, SIGIR, CIKM, WSDM, AIRS, ACL, COLING, EMNLP, NAACL, EACL, IJCNLP, WWW等，是NTCIR跨語言資訊檢索、跨語言問答系統、意見分析、FinNum等項目評比的舉辦人。陳教授獲得2007年和2012年 Google Research Award、2008年和2009年Award of Microsoft Research Asia、2011年國立臺灣大學電資學院學術貢獻獎、2011年國立臺灣大學傑出校內服務獎、2017年科技部傑出研究獎、2018年、2019, 2021, 及2023年國立臺灣大學教學優良獎、2018年瑞軒科技講座教授、2019年優良導師獎、2019傑出資訊人才獎、2021 年APPIER 人工智慧講座教授、2022國科會傑出研究獎、第十九屆(2022年)國家新創獎-學研新創獎、第二十屆(2023年)國家新創獎-臨床新創獎、Garmin 講座 (2024/8/1-2027/7/31)、及2024年國立臺灣大學教學傑出獎。 Contact Information Department of Computer Science and Information Engineering National Taiwan University No. 1, Sec. 4, Roosevelt Road, Taipei, 10617 Taiwan Tel: +886-2-33664888 ext 311 Fax: +886-2-23628167 E-mail: hhchen@ntu.edu.tw Homepage: http://nlg.csie.ntu.edu.tw/advisor.html Lab: http://nlg.csie.ntu.edu.tw TOP Research Interests Human Langauge Technologies Information Retrieval and Extraction Web Mining Social Computing Artificial Intelligence TOP Courses Natural Language Processing Information Retrieval and Extraction Data Structure Introduction to Database Systems TOP Educational Background National Taiwan University, Taiwan, PhD degree in Electrical Engineering, June 1988 National Taiwan University, Taiwan, MS degree in Computer Science and Information Engineering, June 1983 National Taiwan University, Taiwan, BS degree in Computer Science and Information Engineering, June 1981 TOP Professional Experience Distinguished Professor, Department of Computer Science and Information Engineering, National Taiwan University (August 2018-Present) AmTRAN Technology Chair Professor, National Taiwan University (2018) Full Professor, Department of Computer Science and Information Engineering, National Taiwan University, Taiwan (August 1995-Present) Associate Dean, College of Electrical Engineering and Computer Science, National Taiwan University (August 2015) Chief Director, Computer and Information Networking Center, National Taiwan University, Taiwan (August 2006-2009) Chairman, Department of Computer Science and Information Engineering, National Taiwan University, Taiwan (August 2002-July 2005) Deputy Chairman, Department of Computer Science and Information Engineering, National Taiwan University, Taiwan (August 2000-July 2002) Associate Professor, Department of Computer Science and Information Engineering, National Taiwan University, Taiwan (August 1988-July 1995) Lecturer, Department of Computer Science and Information Engineering, National Taiwan University, Taiwan (August 1984-July1988) Visiting Scientist, Institute of Information Science, Academia Sinica, Taiwan (August 2005-December 2005) Visiting Scientist, Language Technologies Institute, Carnegie Mellon University (February 1997-May 1997) TOP Academic Honors and Awards Teaching Excellence Award, National Taiwan University (2021) Teaching Excellence Award, National Taiwan University (2019) AmTRAN Chair Professorship, National Taiwan University (2018) Teaching Excellence Award, National Taiwan University (2018) MOST Outstanding Research Award (2017) Google Research Award (2012) NTU EECS Academic Award (2011) NTU Award for Outstanding Service (2011) ACM SIGIR 2010 Program Chair (2010) Award of Microsoft Research Asia Internet Services Theme (2009) Award of Microsoft Research Asia Web-Scale NLP Theme (2008) Google Research Award (2007) TOP Academic Society Chair (2011-2013), Vice-Chair (2009-2011), ACL SIGHAN (a Special Interest Group of the Association for Computational Linguistics) Advisory Board Chair (2009-2011), President (2007-2009), Vice President (2005-2007), The Association for Computational Linguistics and Chinese Language Processing Board Member (2006-2009), Asian Federation of Natural Language Processing TOP Editorialship Editor (2010-2012), Journal of Information Science and Engineering Associate Editor, ACM Transactions on Asian Language Information Processing (2007-2010) Editorial Board, Computational Linguistics and Chinese Language Processing: An International Journal of the Association for Computational Linguistics and Chinese Language Processing (2000-2008) TOP Conference Chairmanship Area Chair in Text Mining and Information Retrieval, EMNLP 2018 Local organizing committee co-chair, IJCNLP 2017, Taipei, Taiwan Demo Co-Chair, ACL-IJCNLP 2015, Beijing, China Conference Chair, IJCNLP-2013, Nagoya, Japan, October, 2013. Conference Co-Chair, The 2nd CIPS-SIGHAN Joint Conference on Chinese Language Processing (CLP-2012), Dec 20-21, 2012, Tianjin, China. Program Chair, The 14th International Conference on Asia-Pacific Digital Libraries, Taipei, Taiwan, November 12-15, 2012. Area Chair in IR Applications, The 8th Asian Information Retrieval Societies Conference (AIRS), December 17-19, 2012, Tianjin, China. Area Chair in Question Answering, The 50th Annual Meeting of the Association for Computational Linguistics, Jeju, Korea, July 8-14, 2012. PC Co-Chair, The 33rd ACM International Conference on Research and Development in Information Retrieval (SIGIR 2010), Geneva, July 2010 Area Chair in Language, CLIR, QA, The 32ndACM International Conference on Research and Development in Information Retrieval (SIGIR 2009), Boston, July 19-23, 2009 Area Chair in Information Retrieval, Joint Conference of the 47th Annual Meeting of the Association for Computational Linguistics and the 4th International Joint Conference on Natural Language Processing of the Asian Federation of Natural Language Processing on 2-7 August, 200",
  "content_length": 27987,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:14"
}