{
  "name": "Hsu-Chun Hsiao",
  "homepage": "http://www.csie.ntu.edu.tw/~hchsiao",
  "status": "success",
  "content": "Hsu-Chun Hsiao | NTU About I'm a professor in the Department of Computer Science and Information Engineering and Graduate Institute of Networking and Multimedia at National Taiwan University. I hold a joint appointment in the Center for Information Technology Innovation at Academia Sinica. I completed my Ph.D. (2014) in Electrical and Computer Engineering at Carnegie Mellon University. I received my M.S. (2008) and B.S. (2006) degrees in Electrical Engineering at National Taiwan University. I led the security team in the Information Technology Office at National Taiwan University Hospital (2018-2025). Letters of Recommendation Policy: Please read this before requesting for letters of recommendation. Our Lab Interested in joining Network Security Lab (NSLab)? We are interested in the field of computer and network security, with focuses on DDoS defense, automated vulnerability discovery, and IoT security lately. Some of our members are also affiliated with the Balsn CTF team. We are actively recruiting highly motivated students and researchers! Email me or drop by R307 to chat with awesome nslab members. Honors & Awards 2024 - NTU Outstanding Mentor Award ååºå°å¸« 2023 - Mr. Lu Feng-Zhang Memorial Award ç®¡çç§å­¸å­¸æåé³³ç« å çç´å¿µçç« 2022 - Privacy Enhancing Technologies Symposium (PETS) Best Artifact Award 2022 - IEEE Symposium on Security and Privacy (S&P) Test-of-Time Award 2021 - Ta-You Wu Memorial Award åç§æå³å¤§ç·å çç´å¿µç 2020 - Delta Research Excellence Award å°éååºç ç©¶ç 2020 - Ren Min Outstanding Young Chair Professorship ä»æ°ååºéå¹´å­¸è è¬åº§ 2020 - CyberW Early Career Award Honorable Mention by ACM Workshop for Women in Cybersecurity Research 2018 - K. T. Li Young Researcher Award by IICM and ACM Taipei/Taiwan Chapter è³è¨å­¸ææåé¼éå¹´ç ç©¶ç 2018-2023 - Young Scholar Fellowship by the Ministry of Science and Technology of Taiwan 2017, 2018, 2019, 2020, 2022, 2023 - NTU Outstanding Teaching Award æå­¸åªè¯ç 2017, 2018, 2020 - CCISA Master Thesis Supervision Award Publications Conferences and Journals [C51] Bot Among Us: Exploring User Awareness and Privacy Concerns About Chatbots in Group Chats. [code (TBA)] Kai-Hsiang Chou, Yi-An Wang, Chong Kai Lau, Mahmood Sharif, Hsu-Chun Hsiao To appear in the 26th Privacy Enhancing Technologies Symposium, July 2026. [C50] Uncovering Hidden Proxy Smart Contracts for Finding Collision Vulnerabilities in Ethereum. [code (TBA)] Cheng-Kang Chen, Wen-Yi Chu, Muoi Tran, Laurent Vanbever, Hsu-Chun Hsiao In IEEE International Conference on Distributed Computing Systems (ICDCS), July 2025. [C49] Bots can Snoop: Uncovering and Mitigating Privacy Risks of Bots in Group Chats. [code] Kai-Hsiang Chou, Yi-Min Lin, Yi-An Wang, Jonathan Weiping Li, Tiffany Kim, Hsu-Chun Hsiao In the 34th USENIX Security Symposium, August 2025. [C48] Verifying Loot-box Probability Without Source-code Disclosure. J.-J. Wang, A.-J. Li, T.-Y. Fang, H.-C. Hsiao In the 40th Annual Computer Security Applications Conference (ACSAC), December 2024. [C47] AdapSan: Adaptive Input Sanitization in Medical Systems with eBPF. S. Chang, A. Li, E. Jaff, Y. Chang, J. Wang, N. Zhang, H.-C. Hsiao In ACM Workshop on Adaptive and Autonomous Cyber Defense (co-located with ACM CCS), October 2024. [C46] Uncovering Recurring Vulnerabilities through Taint-Extracted Operator Sequences. C.-M. Yang, C.-J. Hsu, T. Ban, T. Takahashi, H.-C. Hsiao In IEEE Conference on Communications and Network Security (CNS), October 2024. [J10] SPArch: A Hardware-oriented Sketch-based Architecture for High-speed Network Flow Measurements. A. Sateesan, J. Vliegen, S. Scherrer, H.-C. Hsiao, A. Perrig, N. Mentens. In ACM Transactions on Privacy and Security. (Accepted: August 2024) [C45] Detecting IP Prefix Mismatches on SDN Data Plane. S.-P. Tung, Y.-M. Lin, K.-L. Chang, H.-C. Hsiao and T. H.-J. Kim. In the 33rd International Conference on Computer Communications and Networks (ICCCN), July 2024. [C44] Risky Cohabitation: Understanding and Addressing Over-privilege Risks of Commodity Application Virtualization Platforms in Android. [code] S.-C. Hsiao, S.-W. Li, H.-C. Hsiao. In ACM Conference on Data and Application Security and Privacy (CODASPY), June 2024. [C43] ALBUS: a Probabilistic Monitoring Algorithm to Counter Burst-Flood Attacks. S. Scherrer, J. Vliegen, A. Sateesan, H.-C. Hsiao, N. Mentens, A. Perrig. In International Symposium on Reliable Distributed Systems, September 2023. [C42] Capturing Antique Browsers in Modern Devices: A Security Analysis of Captive Portal Mini-Browsers. [code] P.-L. Wang, K.-H. Chou, S.-C. Hsiao, A. T. Low, T. H.-J. Kim and H.-C. Hsiao. The 21st International Conference on Applied Cryptography and Network Security (ACNS), June 2023. (Best Student Paper Award) [C41] OmniCrawl: Comprehensive Measurement of Web Tracking With Real Desktop and Mobile Browsers. [code] D. Cassel, S.-C. Lin, A. Buraggina, W. Wang, A. Zhang, L. Bauer, H.-C. Hsiao, L. Jia, T. Libert. In Privacy Enhancing Technologies Symposium (PETS), July 2022. (Best Artifact Award) [C40] Tool: An Efficient and Flexible Simulator for Byzantine Fault-Tolerant Protocols. [code] P.-L. Wang, T.-W. Chao, C.-C. Wu, H.-C. Hsiao. In IEEE/IFIP International Conference on Dependable Systems and Networks (DSN), June 2022. [C39] LAEG: Leak-based AEG using Dynamic Binary Analysis to Defeat ASLR. [code (TBA)] W.-L. Mow, S.-K. Huang, H.-C. Hsiao. In The 6th International Workshop on Privacy, data Assurance, Security Solutions for Internet of Things, June 2022. [C38] Investigating Advertisers' Domain-changing Behaviors and Their Impacts on Ad-blocker Filter Lists. [extended] [code & dataset] S.-C. Lin, K.-H. Chou, Y. Chen, H.-C. Hsiao, D. Cassel, L. Bauer, and L. Jia. In The Web Conference (TheWebConf, formerly known as WWW), April 2022. [C37] HeadStart: Efficiently Verifiable and Low-Latency Participatory Randomness Generation at Scale. [code (TBA)] H. Lee, Y.-M. Hsu, J.-J. Wang, H.-C. Yang, Y.-H. Chen, Y.-C. Hu, and H.-C. Hsiao. In Network and Distributed System Security Symposium (NDSS), April 2022. [C36] Low-Rate Overuse Flow Tracer (LOFT): An Efficient and Scalable Algorithm for Detecting Overuse Flows. [preprint] S. Scherrer, C.-Y. Wu, Y.-H. Chiang, B. Rothenberger, D. Asoni, A. Sateesan, J. Vliegen, N. Mentens, H.-C. Hsiao, A. Perrig. In International Symposium on Reliable Distributed Systems, September, 2021. [C35] ProMutator: Detecting Vulnerable Price Oracles in DeFi by Mutated Transactions. [code & disclosure] S.-H. Wang, C.-C. Wu, Y.-C. Liang, L.-H. Hsieh and H.-C. Hsiao. In IEEE Workshop on Security & Privacy on the Blockchain (co-located with IEEE Euro S&P), September 2021. [C34] Speed Records in Network Flow Measurement on FPGA. A. Sateesan, J. Vliegen, S. Scherrer, H.-C. Hsiao, A. Perrig, and N. Mentens. In International Conference on Field-Programmable Logic and Applications (FPL), August 2021. [C33] icLibFuzzer: Isolated-context libFuzzer for Improving Fuzzer Comparability. [preprint] [code] Y.-C. Liang, H.-C. Hsiao. In NDSS workshop on Binary Analysis Research, February 2021. [J9] A decentralized framework for cultivating research lifecycle transparency. [code] W. Jeng, S.-H. Wang, H.-W. Chen, P.-W. Huang, Y.-J. Chen, H.-C. Hsiao. PLOS ONE 15(11): e0241496, 2020. [C32] On the Privacy Risks of Compromised Trigger-Action Platforms. [code] Y.-H. Chiang, H.-C. Hsiao, C.-M. Yu and T. H.-J. Kim. In European Symposium on Research in Computer Security (ESORICS), September 2020. [C31] FALCO: Detecting JavaScript-based Cyber Attack UsingWebsite Fingerprints. C.-C. Liu, H.-C. Hsiao, T. H.-J. Kim. In International Conference on Security and Cryptography (SECRYPT), July 2020. [C30] Practical and Verifiable Electronic Sortition. H. Lee, H.-C. Hsiao. In Workshop on Foundations of Computer Security, June 2020. [C29] On Using Camera-based Visible Light Communication for Security Protocols. W.-Y. Chu, T.-G. Yu, Y.-K. Lin, S.-C. Lee and H.-C. Hsiao. In IEEE Workshop on the Internet of Safe Things (SafeThings), May 2020. [J8] SAFECHAIN: Securing Trigger-Action Programming from Attack Chains. [code&dataset] K.-H. Hsu, Y.-H. Chiang, H.-C. Hsiao. IEEE Transactions on Information Forensics and Security, 14(10), pp.2607-2622, Oct. 2019. [C28] On the Feasibility of Rerouting-based DDoS Defenses. M. Tran, M. S. Kang, H.-C. Hsiao, W.-H. Chiang, S.-P. Tung and Y.-S. Wang. In IEEE Symposium on Security and Privacy (IEEE S&P), May 2019. [C27] An Investigation of Cyber Autonomy on Government Websites. (Short Paper) [dataset] H.-C. Hsiao, T. H.-J. Kim, Y.-M. Ku, C.-M. Chang, H.-F. Chen, Y.-J. Chen, C.-W. Wang and W. Jeng. In The Web Conference (TheWebConf, formerly known as WWW), May 2019. [C26] Enhancing Symbolic Execution by Machine Learning Based Solver Selection. [code] S.-H. Wen, W.-L. Mow, W.-N. Chen, C.-Y. Wang, H.-C. Hsiao. In NDSS workshop on Binary Analysis Research, February 2019. [J7] GROUPIT: Lightweight Group Key Management for Dynamic IoT Environments. Y.-H. Kung, H.-C. Hsiao. IEEE Internet of Things Journal, vol. 5, no. 6, pp. 5155-5165, Dec. 2018. [C25] Dynamic Path Pruning in Symbolic Execution. Y.-S. Chen, W.-N. Chen, C.-Y. Wu, H.-C. Hsiao, S.-K. Huang. In IEEE Conference on Dependable and Secure Computing (DSC), December 2018. [C24] CLEF: Limiting the Damage Caused by Large Flows in the Internet Core. H. Wu, H.-C. Hsiao, D. E. Asoni, S. Scherrer, A. Perrig, Y.-C. Hu. In International Conference on Cryptology and Network Security (CANS), September 2018. [C23] SDNProbe: Lightweight Fault Localization in the Error-Prone Environment. [code] Y.-M, Ke, H.-C. Hsiao, T. H.-J. Kim. In IEEE International Conference on Distributed Computing Systems (ICDCS), July 2018. [C22] DAMUP: Practical and Privacy-aware Cloud-based DDoS Mitigation. [code] S.-C. Lin, P.-W. Huang, H.-Y. Wang, H.-C. Hsiao. In IEEE/IFIP Workshop on Security for Emerging Distributed Network Technologies (DISSECT), April 2018. [C21] INSTRIM:",
  "content_length": 21137,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:14"
}