{
  "name": "Hsuan-Tien Lin",
  "homepage": "https://www.csie.ntu.edu.tw/~htlin",
  "status": "success",
  "content": "Hsuan-Tien Lin > Home Hsuan-Tien Lin Home | MOOCs | AIsk | Courses | Research Group | Awards | Publications | Presentations | Programs/Data (Taken on Mar. 12, 2009, Room 314, NTU CSIE) My two Mandarin-teaching MOOCs Machine Learning Foundations and Machine Learning Techniques have attracted more than 40K online students in total. Visit here for free Youtube video links, slides and more! My co-authored book Learning from Data: A Short Course is available for sale on Amazon, and is consistently one of the best sellers. Short Bio Prof. Hsuan-Tien Lin received a B.S. in Computer Science and Information Engineering from National Taiwan University in 2001, an M.S. and a Ph.D. in Computer Science from California Institute of Technology in 2005 and 2008, respectively. He joined the Department of Computer Science and Information Engineering at National Taiwan University as an assistant professor in 2008, and was promoted to an associate professor in 2012, and has been a professor since August 2017. He received the title of the Cyberlink/Perfect Endowed Chair Professor in 2022. Between 2016 and 2019, he worked as the Chief Data Scientist of Appier, a startup company that specializes in making AI easier in various domains, such as digital marketing and business intelligence. He continued to serve as the Chief Data Science Consultant of Appier until 2025. From the university, Prof. Lin received the Distinguished Teaching Awards in 2011 and 2021, the Outstanding Mentoring Award in 2013, and five Outstanding Teaching Awards between 2016 and 2020. He co-authored the introductory machine learning textbook Learning from Data and offered two popular Mandarin-teaching MOOCs Machine Learning Foundations and Machine Learning Techniques based on the textbook. Prof. Lin served in the machine learning community as Progam Co-chair of NeurIPS 2020, Expo Co-chair of ICML 2021, Workshop Co-Chair of NeurIPS 2022, Workshop Chair of NeurIPS 2023, Program Co-Chair of ACML 2024, and Senior Program Chair of NeurIPS 2025. His research interests include mathematical foundations of machine learning, studies on new learning problems, and improvements on learning algorithms. He received the 2012 K.-T. Li Young Researcher Award from the ACM Taipei Chapter, the 2013 D.-Y. Wu Memorial Award from National Science Council of Taiwan, the 2017 Creative Young Scholar Award from Foundation for the Advancement of Outstanding Scholarship in Taiwan, the 2025 Breakthrough Chair Professorship from Foundation for the Advancement of Outstanding Scholarship in Taiwan, and the 2025 Outstanding Research Award from National Science and Technology Council of Taiwan. He co-led the teams that won the third place of KDDCup 2009 slow track, the champion of KDDCup 2010, the double-champion of the two tracks in KDDCup 2011, the champion of track 2 in KDDCup 2012, and the double-champion of the two tracks in KDDCup 2013. Experience (complete curriculum vitae) Professor, Department of Computer Science and Information Engineering, National Taiwan University, August 2017--present (Associate Professor, August 2012--July 2017; Assistant Professor, August 2008--July 2012) Adjunct Professor, Graduate Institute of Networking and Multimedia, National Taiwan University, August 2017--present Chief Data Science Consultant, Appier, March 2019--Feb 2025 (Chief Data Scientist, February 2016--February 2019; Consultant, May 2014--January 2016) Cyberlink/Perfect Endowed Chair Professor, Department of Computer Science and Information Engineering, National Taiwan University, August 2022--July 2023 Visiting Scholar, University of California, Davis, July 2022--January 2023 Associate Chair, Department of Computer Science and Information Engineering, National Taiwan University, August 2020--May 2022 Secretary General, Taiwanese Association for Artificial Intelligence, February 2013--January 2015 Education Ph.D., Computer Science Option, California Institute of Technology, July 2003--June 2008 M. S., Computer Science Option, California Institute of Technology, July 2003--June 2005 B. S., Department of Computer Science and Information Engineering, National Taiwan University, September 1997--June 2001 Contact electronic mailing address: regular mailing address: Room 314, CSIE Building, #1 Roosevelt Rd. Sec. 4, Taipei 106, Taiwan Last updated at CST 20:02, March 12, 2025 Please feel free to contact me:",
  "content_length": 4390,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:14"
}