{
  "name": "Hu Ding",
  "homepage": "http://staff.ustc.edu.cn/~huding/index.html",
  "status": "success",
  "content": "Hu Ding Hu Ding Email: huding at ustc.edu.cn WeChat: tiger_alg Postal address: Dian San Lou 513 Ke Da Xi Qu, University of Science and Technology of China He Fei, China, 230027 Recruit: we are actively looking for associate researchers and postdocs in the following areas: theoretical computer science and algorithms, machine learning. News (Sep 2021) : our USTC innovation group grant \" Toward Electronic Design Automation: The Theories and Algorithms from Artifical Intelligence\" is approved News (Sep 2021) : Invited to serve as program committee member of SoCG 2022. News (Sep 2021) : selected as committee member of China Computer Federation (CCF) on theoretical computer science and Big Data. News (Dec 2021) : Our new grant (Young Investigator Award) from Ministry of Science and Technology (about 3 millions RMB) on optimal transportation with applications in medical imaging has been approved (with 4 co-PIs: Shaofeng Jiang, Bangxian Han, Yang Zuo, Mengqiu Liu)! Biography I am a (pre-tenure) professor in The School of Computer Science and Engineering at USTC, and direct the Data Intelligence, Algorithms, and Geometry (DIAG) group. Before moving back to China, I was a tenure-track assistant professor in the department of computer science and engineering at Michigan State University for a short time (2016-2018). I held a joint research fellow position of Tsinghua University and UC Berkeley from 2015 to 2016, which is titled as \"Simons-Berkeley Research Fellow\". I got my Ph.D under supervision of Dr.Jinhui Xu, in the Department of Computer Science and Engineering, State University of New York at Buffalo, in 2015. I received my bachelor degree in Mathematics from Sun Yat-Sen (Zhong Shan) University in 2009. My research interests lie in the fields of Algorithms, Computational Geometry, and their applications in real world, e.g., Machine Learning, Big Data, Internet of Things, Computer Vision, and Biomedical Imaging. Please see my CV and Research for details. Top",
  "content_length": 1988,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:14"
}