{
  "name": "Hu Han 0001",
  "homepage": "https://sites.google.com/site/huhanhomepage/publication",
  "status": "success",
  "content": "Hu Han - PublicationSearch this siteEmbedded FilesSkip to main contentSkip to navigationPublicationJournal Articles1. Tianxin Xie, Hu Han, Shiguang Shan, and Xilin Chen. Natural Adversarial Mask for Face Identity Protection in Physical World. IEEE Transactions on Pattern Analysis and Machine Intelligence, vol. 47, no. 3, pp. 2089-2106, Mar. 2025. [code]2. Haomiao Sun, Mingjie He, Shiguang Shan, Hu Han. Leveraging Face-prior Knowledge for General Face Representation Learning. Pattern Recognition, Vol. 168, 111784, Dec. 2025.3. Jiyao Wang, Hao Lu, Hu Han, Yingcong Chen, Dengbo He, and Kaishun Wu. Generalizable Remote Physiological Measurement via Semantic-Sheltered Alignment and Plausible Style Randomization. IEEE Transactions on Instrumentation and Measurement, vol. 74, pp. 1-14, 2025.4. Xinye Zhou, Hu Han, Shiguang Shan, and Xilin Chen. Fine-grained Open-set Deepfake Detection via Unsupervised Domain Adaptation. IEEE Transactions on Information Forensics and Security (TIFS), vol. 19, pp. 7536-7547, 2024. [code]5. Jiachen Chen, Mengyang Li, Hu Han, Zhiming Zhao, and Xilin Chen. SurgNet: Self-supervised Pretraining with Semantic Consistency for Vessel and Instrument Segmentation in Surgical Images. IEEE Transactions on Medical Imaging (TMI), vol. 43, no. 4, pp. 1513-1525, Apr. 2024. [code]6. Ling Lin, Hao Liu, Jinqiao Liang, Zhendong Li, Jiao Feng, and Hu Han. Consensus-Agent Deep Reinforcement Learning for Face Aging. IEEE Transactions on Image Processing (TIP), vol. 33, pp. 1795-1809, Mar. 2024.7. Xuri Ge, Joemon M Jose, Songpei Xu, Xiao Liu, Hu Han. MGRR-Net: Multi-level Graph Relational Reasoning Network for Facial Action Units Detection. ACM Transactions on Intelligent Systems and Technology (TIST), vol. 15, no. 3, pp. 1-20, Mar. 2024.8. Shikang Yu, Hu Han, Shiguang Shan, and Xilin Chen. CMOS-GAN: Semi-supervised Generative Adversarial Model for Cross-Modality Face Image Synthesis,  IEEE Transactions on Image Processing (TIP), vol. 32, pp. 144-158, 2023. [code]9. Xuri Ge, Joemon M. Jose, Pengcheng Wang, Arunachalam Iyer, Xiao Liu, and  Hu Han. ALGRNet: Multi-Relational Adaptive Facial Action Unit Modelling for Face Representation and Relevant Recognitions. IEEE Transactions on Biometrics, Behavior, and Identity Science (TBIOM), vol. 5, no. 4, pp. 566-578, Oct. 2023.10. Zhuming Wang, Yaowen Xu, Lifang Wu, Hu Han, Yukun Ma, and Zun Li. Improving Face Anti-Spoofing via Advanced Multi-Perspective Feature Learning, ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM), vol. 19, no. 6,  pp 1–18, Nov. 2023.11. Pengchong Qiao, Han Li, Guoli Song, Hu Han, Zhiqiang Gao, Yonghong Tian, Yongsheng Liang, Xi Li, S. Kevin Zhou, and Jie Chen. Semi-supervised CT Lesion Segmentation Using Uncertainty-based Data Pairing and SwapMix, IEEE Transactions on Medical Imaging (TMI), vol. 42, no. 5, pp. 1546-1562, May 2023.12. Abhijit Das, Xuesong Niu, Antitza Dantcheva, S L Happy, Hu Han, Radia Zeghari, Philippe Robert, Shiguang Shan, Francois Bremond, and Xilin Chen. A Spatio-temporal Approach for Apathy Classification, IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), vol. 32, no. 5, pp. 2561 - 2573, May 2022.13. Mengyao Lyu, Hu Han, and Xiangzhi Bai. Zero-Shot Embedding via Regularization-Based Recollection and Residual Familiarity Processes, IEEE Transactions on Systems, Man, and Cybernetics: Systems (TSMC), vol. 52, no. 11, pp. 6852-6869, Nov. 2022. 14. Haomiao Sun, Hongyu Pan, Hu Han, and Shiguang Shan. Deep Conditional Distribution Learning for Age Estimation,  IEEE Transactions on Information Forensics and Security (TIFS),  vol. 16, pp. 4679-4690, 2021. [code]15. Guoqing Wang, Hu Han, Shiguang Shan, and Xilin Chen. Unsupervised Adversarial Domain Adaptation for Cross-domain Face Presentation Attack Detection, IEEE Transactions on Information Forensics and Security (TIFS), vol. 16, pp. 56-69, 2021. [code]16. Jiancheng Cai, Hu Han, Jiyun Cui, Jie Chen, Li Liu, and S. Kevin Zhou. Semi-supervised Natural Face De-occlusion, IEEE Transactions on Information Forensics and Security (TIFS), vol. 16, pp. 1044-1057, 2021. [code]17. Yisheng Zhu, Hu Han, Guangcan Liu, Qingshan Liu. Collaborative Local-global Learning for Temporal Action Proposal, ACM Transactions on Intelligent Systems and Technology (TIST), vol. 12, no. 5, pp. 1-14, Sept. 2021.18. Pengbo Liu, Hu Han, Yuanqi Du, Heqin Zhu, Yinhao Li, Feng Gu, Honghu Xiao, Jun Li, Chunpeng Zhao, Li Xiao, Xinbao Wu, and S. Kevin Zhou. Deep Learning to Segment Pelvic Bones: Large-scale CT Datasets and Baseline Models, International Journal of Computer Assisted Radiology and Surgery (IJCARS), vol. 16, pp. 749–756,  2021. [dataset]19. Z. Sun, et al. Overview of biometrics research, Journal of Image and Graphics (CJIG), vol. 26, no. 6, pp. 33-42, pp. 1254-1329, Jun. 2021.20. Hao Lu and Hu Han. NAS-HR: Search of Neural Architecture for Heart-rate Estimation from Face Videos, Virtual Reality & Intelligent Hardware (VRIH), vol. 3, no. 1, pp. 33-42, Feb. 2021. [code]21. Xuesong Niu, Hu Han, and Shiguang Shan. Remote Photoplethysmography-based Physiological Measurement: A Survey,  Journal of Image and Graphics (JIG), vol. 25, no. 11, pp. 2321-2336, Nov. 2020. [paper in Chinese]22. Xuesong Niu, Shiguang Shan, Hu Han, and Xilin Chen. RhythmNet: End-to-end Heart Rate Estimation from Face via Spatial-temporal Representation, IEEE Transactions on Image Processing (TIP), vol. 29. no. 1, pp. 2409-2423, Dec. 2020. [VIPL-HR-V1, VIPL-HR-V2]23. Han Li, Hu Han, Zeju Li, Lei Wang, Zhe Wu, Jingjing Lu, and S. Kevin Zhou. High-Resolution Chest X-ray Bone Suppression Using Unpaired CT Structural Priors, IEEE Transactions on Medical Imaging (TMI), vol. 39, no. 10, pp. 3053-3063, Oct. 2020. [code]24. Jiancheng Cai, Hu Han, Shiguang Shan, and Xilin Chen. FCSR-GAN: Joint Face Completion and Super-resolution via Multi-task Learning, IEEE Transactions on Biometrics, Behavior, and Identity Science (TBIOM), vol. 2, no. 2, pp. 109-121, Apr. 2020. [code]25. Hu Han, Jie Li, Anil K. Jain, Shiguang Shan, and Xilin Chen. Tattoo Image Search at Scale: Joint Detection and Compact Representation Learning, IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), vol. 41. no. 10, pp. 2333-2348, Oct. 2019. [paper] [WebTattoo] [WebTattoo_Sketches]26. Junhua Gu, Chuanxin Lan, Wenbai Chen, and Hu Han. Joint pedestrian and body part detection via semantic relationship learning, Applied Sciences, vol. 9, no. 4, pp. 752, Feb. 2019.27. Hu Han, Anil K. Jain, Fang Wang, Shiguang Shan, and Xilin Chen. Heterogeneous Face Attribute Estimation: A Deep Multi-Task Learning Approach, IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), vol. 40, no. 11, pp. 2597-2609, Nov. 2018. [paper][demo][LFWA+ dataset]28. Keyurkumar Patel, Hu Han, and Anil K. Jain. Secure Face Unlock: Spoof Detection on Smartphones, IEEE Transactions on Information Forensics and Security (TIFS), vol. 11, no. 10, pp. 2268-2283, Oct. 2016. [paper][USSA dataset]29. Hu Han, Charles Otto, Xiaoming Liu, and Anil K. Jain. Demographic Estimation from Face Images: Human vs. Machine Performance, IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), vol. 37, no. 6, pp. 1148-1161, Jun. 2015. [paper][LFW frontal dataset]30. Di Wen, Hu Han, and Anil K. Jain. Face Spoof Detection with Image Distortion Analysis, IEEE Transactions on Information Forensics and Security (TIFS), vol. 10, no. 4, pp. 746-761, Apr. 2015. [paper][MFSD dataset][demo video]31. Scott Klum, Hu Han, Brendan Klare, and Anil K. Jain. The FaceSketchID System: Matching Facial Composites to Mugshots. IEEE Transactions on Information Forensics and Security (TIFS), vol. 9, no. 12, pp. 2248-2263, Dec. 2014. [paper][dataset]32. Lacey Best-Rowden, Hu Han, Charles Otto, Brendan Klare, and Anil K. Jain. Unconstrained Face Recognition: Identifying a Person of Interest from a Media Collection, IEEE Transactions on Information Forensics and Security (TIFS), vol. 9, no. 12, pp. 2144-2157, Dec. 2014. [paper][dataset]33. Dongoh Kang, Hu Han, Anil K. Jain, and Seong-Whan Lee. Nighttime Face Recognition at Large Standoff: Cross-Distance and Cross-Spectral Matching, Pattern Recognition (P.R.), vol. 47, no. 12, pp. 3750-3766, Dec. 2014. [paper][dataset]34. Hu Han, Shiguang Shan, Xilin Chen, and Wen Gao. A Comparative Study on Illumination Preprocessing in Face Recognition. Pattern Recognition (P.R.), vol. 46, no. 6, pp. 1691-1699, Jun. 2013. [paper][code]35. Hu Han, Brendan Klare, Kathryn Bonnen, and Anil K. Jain. Matching Composite Sketches to Face Photos: A Component Based Approach. IEEE Transactions on Information Forensics and Security (TIFS), vol. 8, no. 1, pp. 191-204, Jan. 2013. [paper][dataset]36. Changhong Liu, Wenfeng Chen, Hu Han, and Shiguang Shan. Effects of Image Preprocessing on Face Matching and Recognition in Human Observers. Applied Cognitive Psychology, vol. 27, no. 6, pp. 718-724, Nov. 2013. 37. Hu Han, Shiguang Shan, Xilin Chen, and Wen Gao. A Lighting Normalization Approach Exploiting Face Symmetry. Journal of Computer Research and Development, vol. 50, no. 4, pp. 767-775, 2013. (in Chinese) Conference Papers1. Yufei Cai, Hu Han, Yuxiang Wei, Shiguang Shan, Xilin Chen. EfficientMT: Efficient Temporal Adaptation for Motion Transfer in Text-to-video Diffusion Models, IEEE/CVF International Conference on Computer Vision (ICCV), Hawaii, USA, Oct. 19-23, 2025.2. Zhaodong Sun, Xiaobai Li, Hu Han, Jiyang Tang, Chenhang Ying, Jieyi Ge, Antitza Dantcheva, Shiguang Shan, Guoying Zhao. The 3rd Vision-based Remote Physiological Signal Sensing (RePSS) Challenge & Workshop, International Joint Conference on Artificial Intelligence (IJCAI 2024) Workshop, Jeju, South Korea, Aug.  5, 2024.3. Haozhan Wu, Hu Han, Shiguang Shan, and Xilin Chen. Multi-view Consistent 3D GAN Inversion via Bidirectional Encoder,  IEEE International Conference on Automatic Face and Gesture Recognition (FG), pp. 1-8, Istanbul, Turkey, May 27-31, 2024. (oral) [code",
  "content_length": 28825,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:15"
}