{
  "name": "Hua-Wei Huang",
  "homepage": "https://sites.google.com/site/cshwhuang",
  "status": "success",
  "content": "Huawei HUANGSearch this siteEmbedded FilesSkip to main contentSkip to navigationShort Bio, CV, and LinksHuawei Huang is a Professor at Sun Yat-sen University, and a dual-appointment professor at the Hong Kong Advanced Research Institute of SYSU and at Lingnan College of SYSU. Since 2023, he has been consecutively recognized among the Top 2% Scientists Worldwide by Stanford University. He is an IEEE Senior Member and a Senior Member of the China Computer Federation (CCF). His research interests span high-performance blockchain systems and protocols, blockchain finance, DeFi protocols, and Web3 infrastructures. He has published numerous research findings in top journals and conferences such as IEEE/ACM ToN, JSAC, TPDS, TSC, TDSC, TIFS, TMC, TC, and INFOCOM. He has chaired many academic conferences, workshops, and symposiums. He is the author of three blockchain monographs, as well as a popular science book on blockchain entitled “From Blockchain to Web3: building the next-generation Internet.” Under his leadership, his team developed and open-sourced a blockchain experimental tool named BlockEmulator, which provides researchers with a mature, high-quality experimental framework and code. Prof. Huawei Huang's research group has initialized BrokerChain, a high-performance Layer1 blockchain, which provides a research and development platform for both academia and industry, supporting blockchain innovations, DeFi protocol development, and Real-World Assets (RWA) tokenization, etc.My CV  (updated on  May 7, 2025)Email:  huanghw28[at]sysu.edu.cn ( [at] -> @ )Lab Page: http://www.xintelligence.pro https://orcid.org/0000-0002-7035-6446[Google Scholar][ResearchGate][blockEmulator]News:July 2025: The testnet of BrokerChain (a Layer1 sharding blockchain) is online! Visit its Github page here: github.com/HuangLab-SYSU/brokerchain-academic BrokerChain (academic) Testnet is EVM-compatible. Students and researchers can develop/deploy smart contracts on this testnet much cheaper than on Ethereum.BrokerChain's Dashboard (public data provided) is here: academic.broker-chain.com:56741/ This dashboard provides public data, including token minting, the number of blockchain shards, active miner nodes, the waiting list of nodes, and the faucet for developers. Anyone can claim a few BKC tokens through this page. If you are interested in BrokerChain, please find the white paper (Chinese version so far) from Google Drive: \"BrokerChain-Testnet-使用说明-2025Jul17.pdf\", URL: https://drive.google.com/file/d/1JBtqt8W5kj4BhOi4EZdr6dmq-rzjF6qM/viewMar. 26, 2025: Good News! I am promoted to a Full Professor!Mar. 03, 2025: Good News! IEEE/ACM ToN / TNet has accepted our paper. Title: “BrokerChain: A Blockchain Sharding Protocol by Exploiting Broker Accounts”.Feb. 23, 2025: Finally, “BlockEmulator: An Emulator Enabling to Test Blockchain Sharding Protocols” has been accepted by IEEE Transactions on Services Computing (TSC) as a regular paper.Dec. 7, 2024: Congrats to my Ph.D. student, Mr. Jian Zheng, for accepting his paper at INFOCOM 2025. Title: “Justitia: An Incentive Mechanism towards the Fairness of Cross-shard Transactions.” To download this paper: http://xintelligence.pro/archives/1371Sep. 19, 2024: I have again been recognized in the World Ranking of Top 2% Scientists.Jan. 2024: I am invited to be a TPC track co-chair for the IEEE Global Blockchain Conference. This conference was held in Shanghai on August 21-23, 2024. [ TPC ]Jan. 12, 2024: I am invited to join the program committee of ICDCS 2024 (44th IEEE International Conference on Distributed Computing Systems), Blockchain Track, and Industrial and Interdisciplinary Studies of Distributed Systems and Applications Track. [ TPC ]Dec. 1, 2023: Great News! Our two papers, titled “Broker2Earn: Towards Maximizing Broker Revenue and System Liquidity for Sharded Blockchains” and “Account Migration across Blockchain Shards using Fine-tuned Lock Mechanism,” have been accepted by INFOCOM 2024. Big congrats to my Ph.D. student, Mr. Qinde Chen (陈钦德), and my master's program student, Mr. Yue Lin (林岳). Good job!Nov. 8, 2023: We have provided a technical paper for our BlockEmulator, a blockchain experiment tool that enables researchers to verify their proposed new protocols and mechanisms, particularly blockchain sharding protocols. Check out our guidebook from [arXiv article].Oct. 26, 2023: I have been invited to give a talk in the Web3 forum at CNCC 2023, Shenyang. My talk title is \"Building Infrastructure for Web3: Improving the Scalability of Blockchains using Sharding.\"Oct. 11, 2023: I have been on the World Ranking of the Top 2% Scientists List (October 2023).Sep. 6, 2023: I've been appointed Youth Editorial Board Member for the ELSP Journal Blockchain (ISSN 2959-1260) [Editorial Board].May 13, 2023: Good News! We made our experimental tool for blockchain research open-source. This tool is named blockEmulator. Visit our websites –>> www.blockEmulator.com (Chinese version), and https://github.com/HuangLab-SYSU/block-emulator (English version).May. 11, 2023: Good News! Our paper  “Scheduling Most Valuable Committees for the Sharded Blockchain” has been accepted by IEEE Transactions on Networking (ToN/TNet). Congratulations to my group! [ PDF ] [公众号介绍文章]Apr 13, 2023: Good News! Our paper ``Adaptive Double-Spending Attacks on PoW-based Blockchains” has been accepted by IEEE Transactions on Dependable and Secure Computing (TDSC), a top journal in Cyber Security. Congratulations to my student Jian Zheng (郑简)!  [ 论文介绍 ] Jan. 28, 2023: I am invited to serve on the editorial board for the Journal of Blockchains (MDPI, ISSN 2813-5288) [Editorial Board].Jan. 19, 2023: My first-ever science book, ''From Blockchain to Web3\" (in Chinese), will be published in October 2023. Welcome to download the preview version from [my blog].July 1, 2022: Good News! I have been elevated to IEEE Senior Member.[more...]Research InterestsBlockchain Infrastructure (Consensus Protocols, Network, Storage)Protocol Design and Security Issues of Web3 and DeFiDistributed Systems and ComputingExperience2025 Mar.26~:  Professor (Full), Sun Yat-Sen University (China)2019 Apr.1~2025 Mar.25: Associate Professor, Sun Yat-Sen University (China)April.2018~2019: Program-Specific Assistant Professor, Kyoto University (Japan)May.2017~March.2018: Post-doc visiting scholar, Department of Computing, Hong Kong Polytechnic University (Hong Kong SAR)April.2016~March.2018: JSPS Research Fellow, University of Aizu (Japan)Teaching2022 ~ present: Web3 and Metaverse, undergraduate course, Code: SSE10012022 ~ present: Blockchain Principles and Technologies, undergraduate/graduate course, Code: DCS6290, SSE3112020 ~ present: Experimental Courses of Blockchain Technologies, undergraduate course, Code: SSE3132019 ~ present: Writing Skills for Scientific Papers, (teaching in English), undergraduate/graduate courses, Code: SSE336ProjectsAt SYSU, I focus on several research projects on blockchain Layer1 and Layer2, Web3/Metaverse Protocols, and Distributed Computing/Protocols.At Kyoto University, I was in charge of promoting a Horizon-2020 EU-Japan joint research project:ACCRA: Agile Co-Creation of Robots for AgeingEditor, Guest EditorEditorial Board Member, Associate EditorGreen Technologies and Sustainability (GTS), Associate Editor  [Editorial Board]Journal of Fintech & Sustainable Finance, Editorial Board Member [Editorial Board]FinTech and Sustainable Innovation (FSI), Editorial Board Member [Editorial Board]Journal of Blockchains, MDPI, (ISSN: 2813-5288), Editorial Board [Editorial Board]International Journal of Web Information Systems (ISSN: 1744-0084), Editorial Advisory Board [Editorial Board]Transactions on Emerging Telecom. Technologies (Wiley), Editorial Board [Editorial Board]Blockchain (ELSP), Associate Editor,  [Editorial Board]Guest EditorGuest Editor, special issue on \"TinyML for Edge-Driven 6G Networks\" at IEEE Wireless Communications,   [URL](Lead GE) Blockchain (ELSP), special issue on \"Blockchains Infrastructure for Web3: Technologies, Tools, and Applications\"  [URL] (closed)(Lead GE) IEEE JSAC special issue on Intelligent Blockchain. [URL] (closed)(Lead GE) IEEE OJ-CS Special Issue on Fusing Blockchain and AI with Metaverse: Technologies, Trends, and Applications [CFP] (closed)IEEE OJ-CS Special Issue on Blockchain Intelligence: Technologies and Applications. [URL] (closed)Keynote SpeechesSep.28, 2025, \"BrokerChain Testnet: How we design and What we have learned,\" International Conference on Blockchain (ICBC 2025), [URL]Aug.2, 2025, \"BrokerChain Testnet: How we design and What we have learned,\" The 5th International Conference on Computer Science and Blockchain (CSSB 2025) [ URL ]Oct.20, 2025, \"BrokerFi, Broker2Earn, and BlockEmulator: Building the Ecosystem of BrokerChain,\" The 9th International Conference on Computer Science and Application Engineering (CSAE 2025) [ URL ]Chairing Conferences & WorkshopsTPC memberIEEE ICWS 2025, TPC member.IEEE ICDCS 2024, TPC member, Blockchain Track, and Industrial and Interdisciplinary Studies of Distributed Systems and Applications Track [URL]Conference PC Chair2026, IEEE ICC 2026, symposium co-chair, Symposium on Communication & Information System Security2025, SCF ICBC 2025, TPC co-chair. [URL]2025, ACM CoNEXT Workshop BlockNetSys 2025 workshop, TPC chair [ URL ] 2024, VTC Fall, track co-chair, Track: Recent Results2024, BlockSys 2024, program co-chair2024, IEEE Global Blockchain Conference 2024, Track co-chair, Track5: Integration of Blockchain, Data Elements & AI [URL]2023, Executive Programming Chair of IEEE ICWS 2023 [URL]2023, IEEE SERVICES 2023 Congress Advisory Program Chair [URL]2021, The inaugural IEEE Symposium on Blockchain at IEEE SERVICES 2021 [URL]IEEE iThings 2022 Workshop on Integrating metaverse with blockchain and 6G for next-generation IoTIEEE GLOBECOM 2022 Workshop on Scalable, Secure and Intelligent Blockchain for Future Networking and Communications IEEE Symposium on Blockchain at ",
  "content_length": 21841,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:17"
}