{
  "name": "Hua Wei 0001",
  "homepage": "https://labs.engineering.asu.edu/hw",
  "status": "success",
  "content": "Welcome to the Data Mining and Reinforcement Learning (DaRL) Group / Hua Wei - DaRL Group / Hua Wei Welcome to the Data Mining and Reinforcement Learning (DaRL) Group / Hua Wei Pioneering data-driven algorithms to make actionable actions in the real world. Hua Wei Office:BYENG 586, 699 S Mill Ave., Tempe, AZ 85281 Google Scholar, Twitter, LinkedIn, CV Tweets by realhuawei Hua Wei (him/his) is an assistant professor at the School of Computing and Augmented Intelligence (SCAI) in Arizona State University (ASU). His research is mainly focused on machine learning and data mining. Before joining ASU, he worked as an Assistant Professor at the New Jersey Institute of Technology and as a Staff Researcher at Tencent AI Lab. He got his PhD from Pennsylvania State University in 2020 under the supervision of Dr. Zhenhui (Jessie) Li. He received his master’s and bachelor’s degrees from Beihang University (BUAA), majoring in Computer Science, working with Prof. Jinpeng Huai and Dr. Tianyu Wo. Research Interests: Reinforcement Learning, Data Mining, Urban Computing, Human-in-the-loop Computations Prospective Students I have several positions available for research interns (flexible time) and several fully-funded PhD positions (Spring/Fall 2026) available. If you are interested in working with me, please read this. News [11/08/2025] Our paper “Measuring What Matters: Scenario-Driven Evaluation for Trajectory Predictors in Autonomous Driving” has been accepted by AAAI 2026. [10/28/2025] Our research on shade modeling for heatwave is covered by local news: “Can AI help Arizonans find the shadiest route to keep cool? This ASU professor thinks so – KJZZ“ [10/17/2025] Glad to receive support from the Arizona Department of Transportation. [09/03/2025] Glad to receive the Cisco Faculty Research Award. [08/06/2025] Our paper “cMALC-D: Contextual Multi-Agent LLM-Guided Curriculum Learning with Diversity-Based Context Blending” is accepted by CIKM 2025. [07/28/2025] Glad to receive support from the Google Cloud Research Credits Program. [07/10/2025] Glad to receive NSF CAREER Award. [07/07/2025] Our paper “Understanding the Uncertainty of LLM Explanations: A Perspective Based on Reasoning Topology” is accepted by the Second Conference on Language Modeling (COLM’25). [07/01/2025] One paper “MC-BEVRO: Multi-Camera Bird Eye View Road Occupancy Detection for Traffic Monitoring” is accepted by ITSC’25. [06/30/2025] Glad to receive consecutive support from the OpenAI API Researcher Access Program. [05/17/2025] We will organize “The 4th Workshop on Uncertainty Reasoning and Quantification in Decision Making (UDM)” and “The 4th Workshop on AI Agent for Information Retrieval: Generating and Ranking“. Please consider submitting papers and attending our workshops! [05/15/2025] Two papers are accepted by ACL’25. [05/14/2025] Two papers are accepted by KDD’25 Research Track. [05/09/2025] Our paper “Joint-Local Grounded Action Transformation for Sim-to-Real Transfer in Multi-Agent Traffic Control” is accepted by Reinforcement Learning Conference (RLC’25). [05/08/2025] Our paper “Uncertainty Quantification for Physics-Informed Traffic Graph Networks” is awarded the Best Artifact Award by ICCPS’25. [05/07/2025] Our survey and tutorial “Uncertainty Quantification and Confidence Calibration in Large Language Models: A Survey” is accepted by KDD’25. See you in Toronto! [05/04/2025] Longchao is awarded the Best Poster Award by SIAM SDM 2025. [05/01/2025] Two papers are accepted by ICML’25. [02/20/2025] Glad to be part of a team to receive a grant to develop AI-powered tools to assist emergency response and disaster management. Check the news out on the ABOR website. [01/28/2025] Our paper “Uncertainty Quantification for Physics-Informed Traffic Graph Networks” is accepted by ICCPS’25. [12/20/2024] Two papers are accepted by SDM’25. Check them out: CoMAL: Collaborative Multi-Agent Large Language Models for Mixed-Autonomy Traffic, and Protecting Privacy against Membership Inference Attack with LLM Fine-tuning through Flatness. [10/22/2024] Glad to receive the Amazon Research Award on LLM Uncertainty! [10/21/2024] Glad to receive support from Arizona DOT! [10/15/2024] Glad to receive support from TSMC! [10/05/2024] I’m going to deliver two keynote talks in CIKM’24 at the Workshop of AI Agent for Information Retrieval and the Workshop on Data-Centric AI. See you in Boise, ID! [09/25/2024] Our paper “RegExplainer: Generating Explanations for Graph Neural Networks in Regression Tasks” has been accepted by NeurIPS’24. [09/21/2024] I’m going to deliver a keynote talk on “Simulation: Machine learning from it, for it and beyond it” at ITSC 2024. [07/16/2024] Three papers are accepted by CIKM’24. [07/10/2024] Our paper “SynTraC: A Synthetic Dataset for Traffic Signal Control from Traffic Monitoring Cameras” has been accepted by ITSC 2024.",
  "content_length": 4874,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:16"
}