{
  "name": "Hua Huang 0003",
  "homepage": "https://sites.ucmerced.edu/huahuang",
  "status": "success",
  "content": "Hua Huang Skip to main content Home Hua Huang is an Assistant Professor at CSE at UC Merced. He obtained his Ph.D in Computer Engineering at Stony Brook University. He received his M.S of Computer Science in Temple University, and B.E of Electronic and Information Sciences in Huazhong University of Science and Technology(HUST). Opening: We are looking for self-motivated students to work on research projects in wireless networking and mobile computing. Read my \"Notes to Prospective Students\" if you are interested in joining us. Research Interests Mobile Computing, Sensor Systems, Wireless Networks Publications Rahul Hoskeri, Xiaoyi Lu, Hua Huang. PULSE: Pulse Usage Monitoring Leveraging Sensing of Electromagnetic Field. International Conference on Embedded Wireless Systems and Networks (EWSN) 2025 pdf Hua Huang and Shan Lin. iBrush: Toothbrushing Monitoring using Wrist Watch.  ACM Transactions on Computing for Healthcare (HEALTH)  (ACMHealth), 2025 Rahul Hoskeri, Shan Lin, and Hua Huang. Note: SSC: Simultaneous Signal Separation and Classification for Concurrent Activities. Accepted to International Symposium of Wearable Computing (ISWC) 2025. pdf Zeyu Zhang, Hua Huang, Zhihao Peng, Shanshan Lin, and Shan Lin. 2025. MagSkin: Enabling Touchless Human-Computer Interaction with Soft Epidermal Magnetic Material. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) 2025 (Accepted). Hua Huang, Rahul Hoskeri, Yangqing Sun. Poster Abstract: Driving Behavior Monitoring with Unobtrusive Smart-glasses. IPSN '23 Lin Chen, Shan Lin, Hua Huang “Charging Path Optimization in Mobile Networks.” ACM Transactions on Networks (TON),  April 2022 Hua Huang and Shan Lin. MET: A Novel Electric Toothbrushing Monitoring System Based on Magnetic Inductance Sensing. ACM  Mobicom 2020. Hua Huang, Chenchun Ni, Xiameng Ban,  Jie Gao, Andrew T. Schneider and Shan Lin Connected Wireless Camera Network Deployment with Visibility Coverage.  ACM Transactions on Internet of Things  (TOSN), July 2020 Hua Huang, Hongkai Chen, and Shan Lin. MagTrack: Enabling Safe Driving Monitoring with  Wearable Magnetics. ACM Mobisys, 2019. Hua Huang and Shan Lin. WiDet: Device-Free Intrusion Detection based on Deep Convolutional Neural Network.  Elsvier Computer Communication Journal, 2019. Hua Huang and Shan Lin. WiDet: Device Free Walking Detection with Deep Convolutional Neural Networks. ACM MSWiM, 2018  Best paper runner up. Hua Huang and Shan Lin. Tooth brushing Recognition using Neural Networks. Poster of IEEE IoTDI, 2017. Hua Huang, Shan Lin. Toothbrushing Monitoring using Wrist Watch. ACM Sensys, 2016. Kinsum Liu, Jie Gao, Shan Lin, Hua Huang and Brad Schiller. Joint Sensor Duty Cycle Scheduling with Coverage Guarantee. ACM Mobihoc, 2016. Lin Chen, Shan Lin and Hua Huang. Charge Me If You Can: Charging Path Optimization and Scheduling in Mobile Networks. ACM Mobihoc, 2016. Fei Miao, Shuo Han, Shan Lin, John A. Stankovic, Desheng Zhang, Sirajum Munir, Hua Huang, Tian He, George J. Pappas: Taxi Dispatch With Real-Time Sensing Data in Metropolitan Areas: A Receding Horizon Control Approach. IEEE Trans Autom. Sci. Eng. 2016. Fei Miao, Shan Lin, Sirajum Munir, John A. Stankovic, Hua Huang, Desheng Zhang, Tian He, George J. Pappas: Taxi dispatch with real-time sensing data in metropolitan areas: a receding horizon control approach. ICCPS 2015. Lin Chen, Wei Wang, Hua Huang, Shan Lin: Time-constrained data harvesting in WSNs: Theoretical foundation and algorithm design. INFOCOM 2015. Hua Huang, Shan Lin, Lin Chen, Jie Gao, Anwar Mamat, Jie Wu: Dynamic Mobile Charger Scheduling in Heterogeneous Wireless Sensor Networks. MASS 2015. Hua Huang, Chien-Chun Ni, Xiaomeng Ban, Jie Gao, Andrew T. Schneider, Shan Lin: Connected wireless camera network deployment with visibility coverage. INFOCOM 2014. Hua Huang, Chien-Chun Ni, Xiaomeng Ban, Jie Gao, Shan Lin: Poster abstract: connected wireless camera network deployment with visibility coverage. IPSN 2013. Group Members Rahul Sidramappa Hoskeri Yi Liu Contact Hua Huang, Assistant Professor Email: hhuang80@ucmerced.edu Department of Computer Science and Engineering University of California, Merced, CA 95343 Google Scholar",
  "content_length": 4225,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:16"
}