{
  "name": "Hua Lu 0001",
  "homepage": "http://people.cs.aau.dk/~luhua",
  "status": "success",
  "content": "Hua LU's Homepage Hua LU Professor Department of Computer Science Aalborg University (Copenhagen campus) A.C. Meyers Vænge 15, 3-2-06 2450 København SV Denmark Tel: +45 9940 9973 Email: LastName+FirstName \"AT\" cs aau dk Photographed by Mads Folmer Jensen Projects Publications Services Students Teaching I am a professor in the Department of Computer Science, Aalborg University (AAU). I work in AAU's Copenhagen campus, where its IT related education and research are growing. From April 2020 to January 2025, I was a professor at Roskilde University (RUC). From June 2021 to January 2025, I served as RUC's contact person at Digital Research Centre Denmark (DIREC). I also served on the Education and Networking Committee of Danish Data Science Academy (DDSA) from January 2022 to June 2024. I obtained my PhD degree from the School of Computing, National University of Singapore (NUS), and my BSc (Software/CS) and MSc (GIS) degrees from Peking University (PKU), China. My research generally concerns data management, spanning database, data mining, big data and data science. My work involves different types of data such as spatial data, outdoor GPS data, indoor positioning data (e.g., RFID, Bluetooth and Wi-Fi data), and social media data (e.g., Tweets). A good deal of my research pays particular attention to locations, either explicit or implicit, in the data. A general purpose of such research is to find valuable information and knowledge efficiently from the data, which in turn are expected to enable, improve, and enrich location based services in various, especially non-conventional, scenarios. Recently, I've been working on data quality, indexes, queries, analytics and recommendation in spatial and social contexts, with a particular interest in designing efficient and effective methods that apply machine learning techniques. Currently I work on several research projects. Two IFD-funded industrial PhD projects focus on making use of AIS data to model ship behavior and predict shipping market dynamics. The Villum Synergy project DiRec investigates diversity related issues in digital news recommendation. The DFF-funded AI4Spatial empowers big spatial data management with machine learning techniques. I've served as PC co-chair (or vice chair) for PAKDD 2026, SSTD 2025, IEEE BigData 2022, NDBC 2019, MDM 2012 and ISA 2011, vice PC chair for MUE 2011, PhD forum co-chair for MDM 2016 and 2022, and demo track chair for SSDBM 2014. I have also served on the program committees for conferences and workshops including SIGMOD, VLDB, ICDE, EDBT, WWW, KDD, CIKM, SSTD, MDM, ACM SIGSPATIAL GIS, DASFAA, PAKDD, SDM, APWeb, MobiDE, ISA, and others. To prospective students If you're interested in working with me as a PhD student or a visiting student in my team, you're welcome to contact me via email. I will be happy to help you apply for tuition waiver from our university and financial support from Danish foundations or other relevant agencies. [Selected Recent Publications] [DBLP, Google Scholar] Z. Lai, H. Lu, H. Li, J. Li, C. S. Jensen: MovSemCL: Movement-Semantics Contrastive Learning for Trajectory Similarity. AAAI 2026. (Data and code) Y. Yang, D. Zhang, Y. Liang, H. Lu, G. Chen, H. Li: Not All Data are Good Labels: On the Self-supervised Labeling for Time Series Forecasting. NeurIPS 2025. (Data and code) M. D. Siampou, J. Li, J. Krumm, C. Shahabi, H. Lu: Poly2Vec: Polymorphic Fourier-Based Encoding of Geospatial Objects for GeoAI Applications. ICML 2025. (Data and code) P. Li, Y. Zhang, W. Wei, R. Zhu, B. Ding, J. Zhou, S. Hu, H. Lu: GRELA: Exploiting Graph Representation Learning in Effective Approximate Query Processing. VLDB J. 34(3):35, 2025. (Data and code) Y. Lei, X. Jiang, H. Lu, C. S. Jensen, B. Tang, H. Li: Teq: An Open and Developer-friendly Testbed for Edge-based Query Processing Algorithms. SIGMOD 2025 (demo). (Code) A. Fahmin, M. A. Cheema, M. E. Ali, A. N. Toosi, H. Lu, H. Li, D. Taniar, H. A. Rakha, B. Shen: Eco-Friendly Route Planning Algorithms: Taxonomies, Literature Review and Future Directions. ACM Computing Surveys 57(1):21:1-21:42, 2025. (DOI) M. Liu, X. Wang, J. Xu, H. Lu, Y. Tong: NALSpatial: A Natural Language Interface for Spatial Databases. TKDE 37(4):2056-2070, 2025. (DOI) X. Li, H. Li, H. Lu, C. S. Jensen: Modeling and Monitoring of Indoor Populations using Sparse Positioning Data. TKDE 37(2):794-809, 2025. (Extended version) N. Bläser, B. B. Magnussen, G. Fuentes, H. Lu, L. Reinhardt: MATNEC: AIS Data-driven Environment-adaptive Maritime Traffic Network Construction for Realistic Route Generation. Transportation Research Part C: Emerging Technologies 169, 2024. (DOI) Z. Lai, D. Zhang, H. Li, C. S. Jensen, H. Lu, Y. Zhao: LightCTS*: Lightweight Correlated Time Series Forecasting Enhanced with Model Distillation. TKDE 36(12): 8695-8710, 2024. Z. Lai, D. Zhang, H. Li, D. Zhang, H. Lu, C. S. Jensen: ReCTSi: Resource-efficient Correlated Time Series Imputation via Decoupled Pattern Learning and Completeness-aware Attentions. KDD 2024. Y. Zhang, H. Lu, N. Liu, Y. Xu, Q. Li, L. Cui: Personalized Federated Learning for Cross-City Traffic Prediction. IJCAI 2024. J. Li, T. Liu, H. Lu: CLEAR: Ranked Multi-Positive Contrastive Representation Learning for Robust Trajectory Similarity Computation. MDM 2024. (Best paper runner-up award) X. Li, H. Li, H. Lu, C. S. Jensen, V. Pandey, V. Markl: Missing Value Imputation for Multi-attribute Sensor Data Streams via Message propagation. VLDB 2024. (Data and code) P. Li, W. Wei, R. Zhu, B. Ding, J. Zhou, H. Lu: ALECE: An Attention-based Learned Cardinality Estimator for SPJ Queries on Dynamic Workloads. VLDB 2024. (Data and code) B. B. Magnussen, N. Bläser, H. Lu: DAISTIN: A Data-Driven AIS Trajectory Interpolation Method. SSTD 2023. (DOI) P. Li, H. Lu, R. Zhu, B. Ding, L. Yang, G. Pan: DILI: A Distribution-Driven Learned Index. VLDB 2023. (Data and code) T. Liu, H. Li, H. Lu, M. A. Cheema, H. Chan: Contact Tracing over Uncertain Indoor Positioning Data. TKDE 35(10):10324-10338, 2023. (Data and code) Z. Lai, D. Zhang, H. Li, C. S. Jensen, H. Lu, Y. Zhao: LightCTS: A Lightweight Framework for Correlated Time Series Forecasting. SIGMOD 2023. (Data and code) X. Li, H. Li, H. K.-H. Chan, H. Lu, C. S. Jensen: Data Imputation for Sparse Radio Maps in Indoor Positioning. ICDE 2023. (Data and code) H. Li, H. Lu, C. S. Jensen, B. Tang, M. A. Cheema: Spatial Data Quality in Internet of Things: Management, Exploitation, and Prospects. ACM Computing Surveys 55(3):57:1-57:41, 2023. (DOI) T. Liu, Z. Feng, H. Li, H.Lu, M. A. Cheema, H. Cheng, J. Xu: Towards Indoor Temporal-variation aware Shortest Path Query. TKDE 35(1):998-1012, 2023. [Awards/Honors] Best Paper Runner-up Award, IEEE MDM 2024 Outstanding Reviewer Award, IEEE ICDE 2024 Best Student Paper Runner-up Award, ADC 2022 Best Research Paper Nomination, SSTD 2021 Best Vision Paper Award, SSTD 2019 Distinguished Young Lecturer, WAIM 2016 Senior Member, IEEE 2014 [Resources] Slides and videos of SIGMOD 2022 tutorial Spatial Data Quality in the IoT Era: Management and Exploitation (together with Huan Li, Bo Tang, Muhammad Aamir Cheema and Christian S. Jensen) Data and code of an indoor keyword-aware routing system. A benchmark (data, code and workloads) for indoor spatial queries. Some indoor venue keyword data used in our recent research on indoor keyword-aware routing. TRIPS: A System for Translating Raw Indoor Positioning Data into Visual Mobility Semantics (demonstrated at VLDB 2018). Parts of the components are open source already. See details here or watch it at YouTube. Indoor mobility data generator Vita (demonstrated at VLDB 2016): A joint work with the Database Lab at Zhejiang University, it is open source now. Check it out at Github or watch it at YouTube. Muhammad Aamir Cheema (Monash University) and I gave a tutorial Indoor Data Managmement at ICDE 2016. The slides are here. Last modified: Nov 2025",
  "content_length": 7937,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:20"
}