{
  "name": "Huaicheng Li",
  "homepage": "https://huaicheng.github.io",
  "status": "success",
  "content": "Huaicheng Li About MoatLab group photos: [ 1 ] Huaicheng Li Assistant Professor, Virginia Tech CS Office: 4109 Gilbert Place Email: huaicheng@cs.vt.edu Code: Personal, MoatLab Google Scholar | DBLP Curriculum Vitae: [pdf] I am an Assistant Professor in the Computer Science department at Virginia Tech (since Fall 2022). I earned my Ph.D. in Computer Science from the University of Chicago in 2020 and completed a 2-year postdoctoral position at CMU Parallel Data Lab (PDL). My group works on Computer Systems, with a focus on Operating Systems, Storage Systems, Memory Systems, and Systems Architecture. We engage in comprehensive analysis, benchmarking, hacking, design, and implementation of systems to investigate enhanced systems support for modern and emerging hardware, interfaces, and applications. Our primary goals include improving performance, resource efficiency, and programmability. The key research themes we focus on are as follows: Performance: We co-design software/hardware stack for low and predictable end-to-end latencies and high throughput Efficiency: We design and build offloaded/disaggregated systems for improved resource and cost efficiency at scale Programmability: We develop systems/platform support tailored for emerging hardware (e.g., CXL) to foster adoption For the most up-to-date information, please refer to Huaicheng's CV. Prospective students: (1). MS/PhD openings - here. (2). Internships - here. Please feel free to reach out via email. MoatLab Research Group See https://moatlab.github.io for more information. PhD students Hansen Idden (08/24-) Sijia Li (08/24-) Hanchen Xu (08/24-) Shoaib Qazi (08/23-) Jinshu Liu (08/22-) Hamid Hadian (08/22-) =========== (*co-advised) Inho Song* (w/ Sam Noh, 08/23-) Yuyue Wang* (visiting VT) Alumni Sumit Monga ('25, PhD -> Postdoc@Inria) Subhalakshmi Selvanathan ('24, MS -> Microsoft) Publications =========== Conference papers ASPLOS'26 PACT: Fine-Grained Online Criticality-Driven Memory Tiering Hamid Hadian, Jinshu Liu, Hanchen Xu, Hansen Idden, Huaicheng Li (To Appear) ASPLOS'26 Lightweight and Accurate Performance Prediction for Heterogeneous Memory Systems Jinshu Liu, Hanchen Xu, Daniel S. Berger, Marcos K. Aguilera, Huaicheng Li (To Appear) OSDI'25 Tiered Memory Management Beyond Hotness Jinshu Liu, Hamid Hadian, Hanchen Xu, Huaicheng Li [paper] [podcast] [slides] [poster] [code] ASPLOS'25 Systematic CXL Memory Characterization and Performance Analysis at Scale Jinshu Liu, Hamid Hadian, Yuyue Wang, Daniel S. Berger, Marie Nguyen, Xun Jian, Sam H. Noh, Huaicheng Li [paper] [podcast] [slides] [poster] [code] PPoPP'25 SGDRC: Software-Defined Dynamic Resource Control for Concurrent DNN Inference on NVIDIA GPUs Yongkang Zhang, Haoxuan Yu, Chenxia Han, Cheng Wang, Baotong Lu, Zhifeng Jiang, Yang Li, Xiaowen Chu, Huaicheng Li [paper] ASPLOS'23 Distinguished Paper Award Pond: CXL-Based Memory Pooling Systems for Cloud Platforms Huaicheng Li, Daniel S. Berger, Lisa Hsu, Daniel Ernst, Pantea Zardoshti, Stanko Novakovic, Monish Shah, Samir Rajadnya, Scott Lee, Ishwar Agarwal, Mark D. Hill, Marcus Fontoura, Ricardo Bianchini [paper] [slides] [poster] [talk] [code] IEEE Micro Top Picks 2024 Honorable Mention [Huge shout-out to my student, Jinshu Liu for his significant contributions to the IEEE Micro Top Picks submission!] ASPLOS'23 RAIZN: Redundant Array of Independent Zoned Namespaces. Thomas Kim, Jekyeom Jeon, Nikhil Arora, Huaicheng Li, Michael Kaminsky, David Andersen, Gregory R. Ganger, George Amvrosiadis, Matias Bjørling [paper] [code] SYSTOR'22Best Paper Award Fantastic SSD Internals and How to Learn and Use Them In Proceedings of the 15th ACM International Systems and Storage Conference (SYSTOR), 2022. Nanqinqin Li, Mingzhe Hao, Huaicheng Li, Xing Lin, Tim Emami, and Haryadi S. Gunawi. [paper] [talk] [code] SOSP'21 IODA: A Host/Device Co-Design for Strong Predictability Contract on Modern Flash Storage In Proceedings of the 28th ACM Symposium on Operating Systems Principles (SOSP), 2021. Huaicheng Li, Martin L. Putra, Ronald Shi, Xing Lin, Gregory R. Ganger, Haryadi S. Gunawi. [paper] [slides] [animation] [short talk] [long talk] [poster] [code] ASPLOS'20 LeapIO: Efficient and Portable Virtual NVMe Storage on ARM SoCs In Proceedings of the 25th ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2020. Huaicheng Li, Mingzhe Hao, Stanko Novakovic, Vaibhav Gogte, Sriram Govindan, Dan R. K. Ports, Irene Zhang, Ricardo Bianchini, Haryadi S. Gunawi, Anirudh Badam. [paper] [slides] [animation] [talk] [code] FAST'18 The CASE of FEMU: Cheap, Accurate, Scalable and Extensible Flash Emulator In Proceedings of the 16th USENIX Conference on File and Storage Technologies (FAST), 2018. Huaicheng Li, Mingzhe Hao, Michael Hao Tong, Swaminathan Sundararaman, Matias Bjørling, Haryadi S. Gunawi. [paper] [slides] [animation] [poster] [talk] [code] FAST'18 Best Paper Nominee Fail-Slow at Scale: Evidence of Hardware Performance Faults in Large Production Systems In Proceedings of the 16th USENIX Conference on File and Storage Technologies (FAST), 2018. Haryadi S. Gunawi, Riza O. Suminto, Russell Sears, Casey Golliher, Swaminathan Sundararaman, Xing Lin, Tim Emami, Weiguang Sheng, Nematollah Bidokhti, Caitie McCaffrey, Gary Grider, Parks M. Fields, Kevin Harms, Robert B. Ross, Andree Jacobson, Robert Ricci, Kirk Webb, Peter Alvaro, H. Birali Runesha, Mingzhe Hao, Huaicheng Li. [paper] [slides] [animation] [poster] [dataset] Coverage: the Morning Paper, ZDNet, HackerNews SOSP'17 MittOS: Supporting Millisecond Tail Tolerance with Fast Rejecting SLO-Aware OS Interface In Proceedings of the 26th ACM Symposium on Operating Systems Principles (SOSP), 2017. Mingzhe Hao, Huaicheng Li, Michael Hao Tong, Chrisma Pakha, Riza Suminto, Cesar Stuardo, Andrew A. Chien, Haryadi S. Gunawi. [paper] [slides] [animation] [poster] [talk] [code] FAST'17 Best Paper Nominee Tiny-Tail Flash: Near-Perfect Elimination of Garbage Collection Tail Latencies in NAND SSDs In Proceedings of the 15th USENIX Conference on File and Storage Technologies (FAST), 2017. Shiqin Yan, Huaicheng Li, Mingzhe Hao, Michael Hao Tong, Swaminathan Sundararaman, Andrew A. Chien, Haryadi S. Gunawi. [paper] [slides] [animation] [poster] [talk] [code] =========== Journal papers TODAES'24 ZoneTrace: A Zone Monitoring Tool for F2FS on ZNS SSDs ACM Transactions on Design Automation of Electronic Systems (TODAES), 2024. Ping-Xiang Chen, Dongjoo Seo, Changhoon Sung, Jongheum Park, Minchul Lee, Huaicheng Li, Matias Bjørling, Nikil Dutt. IEEE Micro'23 Design Tradeoffs in CXL-Based Memory Pools for Cloud Platforms IEEE Micro Special Issue on Emerging System Interconnects, 2023. Daniel S. Berger, Dan Ernst, Huaicheng Li, Pantea Zardoshti, Monish Shah, Samir Rajadnya, Scott Lee, Lisa Hsu, Ishwar Agarwal, Mark D. Hill, Ricardo Bianchini. ACM TOS'23 Extending and Programming the NVMe I/O Determinism Interface for Flash Arrays ACM Transactions on Storage (TOS), Volume 19, Issue 1, February 2023. [Extended version of the IODA paper at SOSP'21] Huaicheng Li, Martin L. Putra, Ronald Shi, Fadhil I. Kurnia, Xing Lin, Jaeyoung Do, Achmad Imam Kistijantoro, Gregory R. Ganger, Haryadi S. Gunawi. ACM TOS'18Fast-Tracked Fail-Slow at Scale: Evidence of Hardware Performance Faults in Large Production Systems ACM Transactions on Storage (TOS), Volume 14, Issue 3, November 2018. [Extended version of the FailSlow paper at FAST'18] Haryadi S. Gunawi, Riza O. Suminto, Russell Sears, Casey Golliher, Swaminathan Sundararaman, Xing Lin, Tim Emami, Weiguang Sheng, Nematollah Bidokhti, Caitie McCaffrey, Gary Grider, Parks M. Fields, Kevin Harms, Robert B. Ross, Andree Jacobson, Robert Ricci, Kirk Webb, Peter Alvaro, H. Birali Runesha, Mingzhe Hao, Huaicheng Li. ACM TOS'17Fast-Tracked Tiny-Tail Flash: Near-Perfect Elimination of Garbage Collection Tail Latencies in NAND SSDs ACM Transactions on Storage (TOS), Volume 13, Issue 3, October 2017. [Extended version of the TinyTail-Flash paper at FAST'17] Shiqin Yan, Huaicheng Li, Mingzhe Hao, Michael Hao Tong, Swaminathan Sundararaman, Andrew A. Chien, Haryadi S. Gunawi. =========== Workshop papers HotStorage'23 Is Garbage Collection Overhead Gone? Case study of F2FS on ZNS SSDs In 15th ACM Workshop on Hot Topics in Storage and File Systems (HotStorage). Dongjoo Seo, Ping-Xiang Chen, Huaicheng Li, Matias Bjørling, Nikil Dutt. NVMW'23 Pond: The Case of CXL Memory Pooling for Cloud Datacenters In the 14th Annual Non-Volatile Memories Workshop (NVMW). Huaicheng Li, Daniel S. Berger, Lisa Hsu, Daniel Ernst, Pantea Zardoshti, Stanko Novakovic, Monish Shah, Samir Rajadnya, Scott Lee, Ishwar Agarwal, Mark D. Hill, Marcus Fontoura, Ricardo Bianchini. Dissertation Evolving Storage Stack for Predictability and Efficiency Huaicheng Li, Ph.D. Thesis, University of Chicago. Teaching CS5264/CS4114: (Advanced) Linux Kernel Programming (Spring 2025), Virginia Tech (cross-listed: ECE5414/ECE4414) CS3214: Computer Systems (Fall 2024), Virginia Tech CS5204: Operating Systems (Fall 2023), Virginia Tech CS6214: Advanced Topics in Operating Systems (Spring 2023), Virginia Tech CS3214: Computer Systems (Fall 2022), Virginia Tech Selected Honors & Awards Google Research Scholar Award, 2025 NSF CAREER Award, 2024 Rising Star Faculty Award, VT CS, 2024 IEEE Micro Top Picks 2024 Honorable Mention (\"Pond: CXL-Based Memory Pooling Systems\"), 2024 ASPLOS'23 Distinguished Paper Award (\"Pond: CXL-Based Memory Pooling Systems\"), 2023 SYSTOR'22 Best Paper Award (\"Fantastic SSD Internals\"), 2022 Distinguished Reviewer Award, SYSTOR'21, 2021 FAST'18 Best Paper Nominee (\"Fail-Slow At Scale\"), 2018 FAST'17 Best Paper Nominee (\"Tiny-Tail Flash\"), 2017 Service Program Committee (PC) ASPLOS'25, NSDI'25, FAST'25, MICRO'25, ICDCS'25 ASPLOS'24, NSDI'24, CCGRID'24 ASPLOS'23 (Fall cycle), SYSTOR'23, NVMW'23, SysDW'23 APSys'21, SYSTOR'21 External Review Committee (ERC) ISCA'24 ASPLOS'23 (Spring and Summer cy",
  "content_length": 11083,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:17"
}