{
  "name": "Huajie Zhang",
  "homepage": "http://www.cs.unb.ca/~hzhang",
  "status": "success",
  "content": "Huajie (Harry) Zhang Huajie (Harry) Zhang B.Sc in CS (Huazhong University of Science and Technology) M.Sc in CS (Harbin Institute of Technology) Ph.D in CS (The University of Western Ontario) Professor Address : Tel : Fax : office : email : Huajie (Harry) Zhang, Faculty of Computer Science, University of New Brunswick P.O. Box 4400, Fredericton, N.B. CANADA (506) 458-7269 (506) 453-3566 C114, Gillin Hall hzhang \\at unb \\dot ca Teaching Activities CS6735 Machine Learning CS3383 Algorithm Design Research Activities My research areas include machine learning, data mining, graphical and probabilistic models and reasoning, and intelligent systems. More precisely, I am working on the following topics: Transfer learning. Does the learned knowledge (training data, learned models, etc.) from one domain help to learn a better model for a different but related domain? This is the main target of transfer learning. Generally speaking, this kind of knowledge transfer is quite risky. However, for some specific applications, it may work well. Semi-supervised learning. In many applications, labeled data are precious or hard to obtain. How to build an accurate model with a few labeled data and a large amount of unlabeled ones is an interesting and important topic. Although there has been tons of research showing that unlabeled data do help in the learning process, our recent research shows that is not generally true. Learning probabilistic models. Probabilistic models, such as Bayesian networks and probabilistic trees, demonstrate good performance in many applications. How to design effective and efficient algorithms for learning probabilistic models from data is a traditional but still challenging research topic. Efficient learning algorithms for large data. In many data mining applications, the maximum tolerable time complexity of an algorithm is nlogn , in order to deal with large datasets (100 Megabites-1 Gigabites). Unfortunately, most learning algorithms have time complexity above that bound. In fact, for a very huge dataset, even a linear algorithm is slow. Therefore, it is crucial to invent fast and effective algorithms for real-world applications, such as data mining. Selected Publications L. Jiang, H. Zhang and Z. Cai, A Novel Bayes Model: Hidden Naive Bayes, IEEE Tran. on Knowledge and Data Engineering, 21(10): 1361-1371 , 2009. J. Su, H. Zhang, C.X. Ling and S. Matwin, Discriminative Parameter Learning for Bayesian Networks , Proceedings of the 25th International Conference on Machine Learning (ICML-2008), pp.1016-1023. J. Su and H. Zhang, A Fast Decision Tree Learning Algorithm , Proceedings of the Twenty-First National Conference on Artificial Intelligence (AAAI-06) , pp.500-505, AAAI Press(2006). J. Su and H. Zhang, Full Bayesian Network Classifiers , Proceedings of the 23rd International Conference on Machine Learning (ICML 2006) , pp.897-904, ACM(2006). H. Zhang, L. Jiang and J. Su, Augmenting Naive Bayes for Ranking , Proceedings of the 22nd International Conference on Machine Learning (ICML 2005) , pp.1025-1032, ACM(2005). J. Su and H. Zhang, Representing Conditional Independence Using Decision Trees, Proceedings of the Twentieth National Conference on Artificial Intelligence (AAAI-05) , pp.874-879, AAAI Press(2005). H. Zhang, L. Jiang and J. Su, Hidden Naive Bayes, Proceedings of the Twentieth National Conference on Artificial Intelligence (AAAI-05) , pp.919-924, AAAI Press(2005). C. X. Ling, J. Huang and H. Zhang, AUC: a statistically consistent and more discriminating measure than accuracy, Proceedings of the International Joint Conference on Artificial Intelligence (IJCAI2003), pp.519-526, Morgan Kaufmann(2003). C. X. Ling and H. Zhang, The representational power of discrete Bayesian networks. Journal of Machine Learning Research . Vol.3(2002), pp. 709-721. H. Zhang and C. X. Ling, Representational upper bounds of Bayesian networks, Proceedings of the Nineteenth International Conference on Machine Learning (ICML2002), pp. 674-681, Morgan Kaufmann(2002). H. Zhang and C. X. Ling, Learnability of augmented naive Bayes in nominal domains, Proceedings of the Eighteenth International Conference on Machine Learning (ICML2001), pp.617-623, Morgan Kaufmann (2001). A list of my recent papers. My daughter's trip to China Tiananman Square, Beijing Hui Guo Hu Park, Wuhan Dong Hu Park, Wuhan Homepage          CS Homepage",
  "content_length": 4393,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:19"
}