{
  "name": "Huanying Gu",
  "homepage": "https://site.nyit.edu/bio/hgu03",
  "status": "success",
  "content": "Huanying (Helen) Gu | New York Tech Staff & Faculty Directory Huanying Gu Professor; Computer Science, College of Engineering & Computing Sciences Associate Dean, Research & Practice; Computer Science, College of Engineering & Computing Sciences Education Credentials: Ph.D.Expertise: Data Mining, Ontologies, Object-Oriented ModelingJoined New York Tech: 2009 Huanying (Helen) Gu is a professor of computer science in NYIT College of Engineering and Computing Sciences. Her research interests include data mining, data analysis, ontologies, object-oriented modeling, conceptual modeling, and medical informatics, with an emphasis on controlled medical terminologies. Gu’s research has been supported by the National Science Foundation (NSF), the National Institutes of Health (NIH), the UMDNJ foundation, the PDR network, and New York Tech ISRC grants. Her honors include the Dean’s Award for Excellence in Research from the University of Medicine and Dentistry of New Jersey and Annual Faculty Scholars Awards from New York Tech. She is a member of the Association for Computing Machinery (ACM) and American Medical Informatics Association (AMIA) and has served as a reviewer for journals and conferences on medical informatics. Gu received her Ph.D. in computer science from New Jersey Institute of Technology. Prior to joining New York Tech, she was an associate professor of Health Informatics at the University of Medicine and Dentistry of New Jersey (now part of Rutgers University). Recent Projects/Research National Science Foundation: Implementation of a Comprehensive High-School-College Partnership and Equity-Based Curriculum in Engineering and Computer Science National Institutes of Health: A family-based framework of quality assurance for biomedical ontologies Adversarial text generation using acoustic and visual similarity Improving the prediction accuracy of the student retention model Energy-efficient body area sensor network for nonintrusive freezing-of-gait study of individuals with Parkinson’s Disease Recent Publications Jain E., Brown S., Chen J., Neaton E., Baidas M., Dong Z., Gu H., Artan N. S. Adversarial text generation for Google’s Perspective API. The 5th International Conference on Computational Science and Computational Intelligence (CSCI), Las Vegas, Nev., Dec. 13-15, 2018. In Proceedings of the 2018 International Conference on Computational Science and Computational Intelligence (CSCI), pages 1–6. Zhang M., Artan N. S., Gu H., Dong Z., Ganatra L. B., Shermon S., Rabin E. (2018). Gait study of Parkinson’s Disease subjects using haptic cues with a motorized walker. Sensors, 18(10), 3549. doi: 10.3390/s18103549. H. Gu, Z. He, D. Wei, G. Elhanan Y. Chen. Validating UMLS semantic type assignments using SNOMED CT semantic tags, Methods of Information in Medicine, 57(1), pages 43–53, 2018. D. Cirella and H. Gu. Creating abstraction networks based on the semantic similarity measure of ontology’s concept pairs, Proceedings of IEEE International Conference on Bioinformatics and Biomedicine (BIBM2017), pages 830–833, Kansas City, Mo., Nov. 2017. H. Gu, Y. Chen, Z. He, M. Halper, L. Chen. Quality Assurance of UMLS Semantic Type Assignments Using SNOMED CT Hierarchies, Methods of Information in Medicine, 55 (2), pages 158–165, 2016. U. K. Pun, H. Gu, Z. Dong, and N. S. Artan. Classification and visualization tool for gait analysis of Parkinson’s disease, Proceedings of IEEE 38th International Conference on Engineering in Medicine and Biology Society (EMBC2016), pages 2407–2410, Orland, Fla., Aug. 2016. Courses Taught at New York Tech CSCI 125 Programming I CSCI 185 Computer Programming II CSCI 235 Elements of Discrete Structures CSCI 260 Data Structures CSCI 300 Database Management CSCI 335 Design and Analysis of Algorithms CSCI 380 Introduction to Software Engineering CSCI 415 Introduction to Data Mining CSCI 760 Database Systems CSCI 820 Topics in Database Systems Contact Information Email: hgu03@nyit.edu Phone: 212.261.1709 Office: New York, NY By continuing to use the website, you consent to analytics tracking per New York Tech's Privacy StatementAccept Cookies",
  "content_length": 4132,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:21"
}