{
  "name": "Huanchen Zhang",
  "homepage": "http://people.iiis.tsinghua.edu.cn/~huanchen/index.html",
  "status": "success",
  "content": "Huanchen Zhang Huanchen Zhang Contact Email: huanchen@tsinghua.edu.cn Twitter: @huanchenzhang Office: FIT 4-6014 I am an Assistant Professor in the IIIS (Yao Class) at Tsinghua University. My research interest is in database management systems. I have particular interests in indexing/filtering data structures, data compression, and cloud databases. I received my Ph.D. degree from the Computer Science Department at Carnegie Mellon University. Before joining Tsinghua, I worked at Snowflake as a Postdoctoral Research Fellow. [CV] Students Yihao Liu Hengrui Wang Xinyu Zeng Jiansheng Qiu Yiming Qiao Yipeng Liu Yulong Hui Kai Su Jiahong Shen Ruijun Meng Weitao Wan (M.S. w/ Mingyu Gao) Fangzhou Yuan (M.S.) Jiaxin Wang (M.S.) Alumni Jiaoyi Zhang Junyi Zhao Publications Selective Late Materialization in Modern Analytical Databases Yihao Liu, Shaoxuan Tang, Yulong Hui, Hangrui Zhou, and Huanchen Zhang Proceedings of the VLDB Endowment (VLDB'25), 18(11), pp. 4616-4628. Concurrency Control as a Service Weixing Zhou, Yanfeng Zhang, Xinji Zhou, Zhiyou Wang, Zeshun Peng, Yang Ren, Sihao Li, Huanchen Zhang, Guoliang Li, and Ge Yu Proceedings of the VLDB Endowment (VLDB'25), 18(9), pp. 2761-2774. GORAM: Graph-oriented ORAM for Efficient Ego-centric Queries on Federated Graphs Xiaoyu Fan, Kun Chen, Jiping Yu, Xiaowei Zhu, Yunyi Chen, Huanchen Zhang, and Wei Xu Proceedings of the VLDB Endowment (VLDB'25), 18(10), pp. 3601-3614. HotRAP: Hot Record Retention and Promotion for LSM-trees with Tiered Storage Jiansheng Qiu, Fangzhou Yuan, Mingyu Gao, and Huanchen Zhang Proceedings of the 2025 USENIX Annual Technical Conference (ATC'25), pp. 497-511. PUSHtap: PIM-based In-Memory HTAP with Unified Data Storage Format Yilong Zhao, Mingyu Gao, Huanchen Zhang, Fangxin Liu, Gongye Chen, He Xian, Haibing Guan, and Li Jiang Proceedings of the 30th ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS'25), Volume 3, pp. 179-194. Debunking the Myth of Join Ordering: Toward Robust SQL Analytics Junyi Zhao, Kai Su, Yifei Yang, Xiangyao Yu, Paraschos Koutris, and Huanchen Zhang Proceedings of the ACM on Management of Data (SIGMOD'25), 3(3): Article 146, 28 pages. CODE SLIDES Rethinking The Compaction Policies in LSM-trees Hengrui Wang, Jiansheng Qiu, Fangzhou Yuan, and Huanchen Zhang Proceedings of the ACM on Management of Data (SIGMOD'25), 3(3): Article 207, 26 pages. Intra-Query Runtime Elasticity for Cloud-Native Data Analysis Xukang Zhang, Huanchen Zhang, and Xiaofeng Meng Proceedings of the ACM on Management of Data (SIGMOD'25), 3(3): Article 178, 28 pages. Femur: A Flexible Framework for Fast and Secure Querying from Public Key-Value Store Jiaoyi Zhang, Liqiang Peng, Mo Sha, Weiran Liu, Xiang Li, Sheng Wang, Feifei Li, Mingyu Gao, and Huanchen Zhang Proceedings of the ACM on Management of Data (SIGMOD'25), 3(3): Article 162, 29 pages. Data Chunk Compaction in Vectorized Execution Yiming Qiao and Huanchen Zhang Proceedings of the ACM on Management of Data (SIGMOD'25), 3(1): Article 26, 25 pages. ANSMET: Approximate Nearest Neighbor Search with Near-Memory Processing and Hybrid Early Termination Yiwei Li, Yuxin Jin, Boyu Tian, Huanchen Zhang, and Mingyu Gao Proceedings of the 52nd Annual International Symposium on Computer Architecture (ISCA'25), June 2025, pp. 1093 - 1107 ReaLHF: Optimized RLHF Training for Large Language Models through Parameter Reallocation Zhiyu Mei, Wei Fu, Kaiwei Li, Guangju Wang, Huanchen Zhang, and Yi Wu Proceedings of the Eighth Conference on Machine Learning and Systems (MLSys'25), May 2025. CODE Towards Functional Decomposition of Storage Formats Martin Prammer, Xinyu Zeng, Ruijun Meng, Wes McKinney, Huanchen Zhang, Andrew Pavlo, and Jignesh M. Patel Proceedings of the 2025 Conference on Innovative Data Systems Research (CIDR'25), January 2025. UDA: A Benchmark Suite for Retrieval Augmented Generation in Real-world Document Analysis Yulong Hui, Yao Lu, and Huanchen Zhang Proceedings of the Thirty-Eighth Annual Conference on Neural Information Processing (NeurIPS'24), December 2024. CODE Cloud-Native Databases: A Survey Haowen Dong, Chao Zhang, Guoliang Li, and Huanchen Zhang IEEE Transactions on Knowledge and Data Engineering (TKDE'24), 36(12), pp. 7772-7791. Blitzcrank: Fast Semantic Compression for In-memory Online Transaction Processing Yiming Qiao, Yihan Gao, and Huanchen Zhang Proceedings of the VLDB Endowment (VLDB'24), 17(10), pp. 2528-2540. CODE An Empirical Evaluation of Columnar Storage Formats Xinyu Zeng, Yulong Hui, Jiahong Shen, Andrew Pavlo, Wes McKinney, and Huanchen Zhang Proceedings of the VLDB Endowment (VLDB'24), 17(2), pp. 148-161. CODE NULLS!: Revisiting Null Representation in Modern Columnar Formats Xinyu Zeng, Ruijun Meng, Andrew Pavlo, Wes McKinney, and Huanchen Zhang Proceedings of the 20th International Workshop on Data Management on New Hardware (DaMoN'24), June 2024. CODE Making In-Memory Learned Indexes Efficient on Disk Jiaoyi Zhang, Kai Su, and Huanchen Zhang Proceedings of the ACM on Management of Data (SIGMOD'24), 2(3): Article 151, 26 pages. CODE GRF: A Global Range Filter for LSM-Trees with Shape Encoding Hengrui Wang, Te Guo, Junzhao Yang, and Huanchen Zhang Proceedings of the ACM on Management of Data (SIGMOD'24), 2(3): Article 141, 27 pages. PimPam: Efficient Graph Pattern Matching on Real Processing-in-Memory Hardware Shuangyu Cai, Boyu Tian, Huanchen Zhang, Mingyu Gao Proceedings of the ACM on Management of Data (SIGMOD'24), 2(3): Article 161, 25 pages. LeCo: Lightweight Compression via Learning Serial Correlations Yihao Liu, Xinyu Zeng, and Huanchen Zhang Proceedings of the ACM on Management of Data (SIGMOD'24), 2(1): Article 65, 28 pages. CODE SALI: A Scalable Adaptive Learned Index Framework based on Probability Models Jiake Ge, Huanchen Zhang, Boyu Shi, Yuanhui Luo, Yunda Guo, Yunpeng Chai, Yuxing Chen, and Anqun Pan Proceedings of the ACM on Management of Data (SIGMOD'24), 1(4): Article 258, 25 pages. Beyond Bloom: A Tutorial on Future Feature-Rich Filters Prashant Pandey, Martín Farach-Colton, Niv Dayan, and Huanchen Zhang Proceedings of the ACM on Management of Data (SIGMOD'24) Tutorial, June 2024. Cost-Intelligent Data Analytics in the Cloud Huanchen Zhang, Yihao Liu, Jiaqi Yan Proceedings of the 2024 Conference on Innovative Data Systems Research (CIDR'24), January 2024. SLIDES SRL: Scaling Distributed Reinforcement Learning to Over Ten Thousand Cores Zhiyu Mei, Wei Fu, Guangju Wang, Huanchen Zhang, and Yi Wu Proceedings of the Twelfth International Conference on Learning Representations (ICLR'24), May 2024. CODE AdaCom: Adaptive Compression For Databases Leon Windheuser, Christoph Anneser, Huanchen Zhang, Thomas Neumann, and Alfons Kemper Proceedings of the 27th International Conference on Extending Database Technology (EDBT'24), March 2024. G-Learned Index: Enabling Efficient Learned Index on GPU Jiesong Liu, Feng Zhang, Lv Lu, Chang Qi, Xiaoguang Guo, Dong Deng, Guoliang Li, Huanchen Zhang, Jidong Zhai, Hechen Zhang, Yuxing Chen, Anqun Pan, Xiaoyong Du IEEE Transactions on Parallel and Distributed Systems (TPDS'24), 35(6), pp. 795-812. Compressed Data Direct Computing for Databases Weitao Wan, Feng Zhang Zhang, Chenyang Zhang, Mingde Zhang, Jidong Zhai, Yunpeng Chai, Huanchen Zhang, Wei Lu, Yuxing Chen, Haixiang Li, Anqun Pan, and Xiaoyong Du IEEE Transactions on Knowledge and Data Engineering (TKDE'23), 36(5), pp. 1902-1918. Efficient Query Re-optimization with Judicious Subquery Selections Junyi Zhao, Huanchen Zhang, and Yihan Gao Proceedings of the ACM on Management of Data (SIGMOD'23), 1(2), pp. 1-26. CODE When Tree Meets Hash: Reducing Random Reads for Index Structures on Persistent Memories Ke Wang, Guanqun Yang, YiWei Li, Huanchen Zhang, and Mingyu Gao Proceedings of the ACM on Management of Data (SIGMOD'23), 1(1), pp. 1-26. CODE CompressGraph: Efficient Parallel Graph Analytics with Rule-Based Compression Zheng Chen, Feng Zhang, JiaWei Guan, Jidong Zhai, Xipeng Shen, Huanchen Zhang, Wentong Shu, and Xiaoyong Du Proceedings of the ACM on Management of Data (SIGMOD'23), 1(1), pp. 1-31. Blink-hash: An Adaptive Hybrid Index for In-Memory Time-Series Databases Hokeun Cha, Xiangpeng Hao, Tianzheng Wang, Huanchen Zhang, Aditya Akella, and Xiangyao Yu Proceedings of the VLDB Endowment (VLDB'23), 16(6), pp. 1235-1248. CODE REncoder: A Space-Time Efficient Range Filter with Local Encoder Wang, Ziwei, Zheng Zhong, Jiarui Guo, Yuhan Wu, Haoyu Li, Tong Yang, Yaofeng Tu, Huanchen Zhang, and Bin Cui Proceedings of the 39th IEEE International Conference on Data Engineering (ICDE'23). CODE Adaptive Hybrid Indexes Christoph Anneser, Andreas Kipf, Huanchen Zhang, Thomas Neumann, and Alfons Kemper Proceedings of the 2022 International Conference on Management of Data (SIGMOD'22), June 2022, pp. 1626-1639. Proteus: A Self-Designing Range Filter Eric R. Knorr, Baptiste Lemaire, Andrew Lim, Siqiang Luo, Huanchen Zhang, Stratos Idreos, Michael Mitzenmacher Proceedings of the 2022 International Conference on Management of Data (SIGMOD'22), June 2022, pp. 1670-1684. CODE Succinct Range Filters Huanchen Zhang, Hyeontaek Lim, Viktor Leis, David G. Andersen, Michael Kaminsky, Kimberly Keeton, and Andrew Pavlo Communications of the ACM (CACM). 4 (April 2021): 166-173. Everything is a Transaction: Unifying Logical Concurrency Control and Physical Data Structure Maintenance in Database Management Systems Ling Zhang, Matthew Butrovich, Tianyu Li, Yash Nannapanei, Andrew Pavlo, John Rollinson, Huanchen Zhang Proceedings of the Conference on Innovative Data Systems Research (CIDR'21), Jan. 2021. Memory-Efficient Search Trees for Database Management Systems 2021 SIGMOD Jim Gray Dissertation Award Ph.D. Dissertation, February 2020 SLIDES VIDEO Order-Preserving Key Compression for In-Memory Search Trees Huanchen Zhang, Lily Liu, David G. Andersen, Michael Kaminsky, Kimberly Keeton, and Andrew Pavlo Proceedings of the 2020 International Co",
  "content_length": 11770,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:18"
}