{
  "name": "Huanhuan Chen",
  "homepage": "http://staff.ustc.edu.cn/~hchen",
  "status": "success",
  "content": "Huanhuan Chen @ USTC Huanhuan Chen (éæ¬¢æ¬¢) Professor, Fellow of IEEE School of Computer Science and Technology University of Science and Technology of China (USTC) Email: hchen AT ustc.edu.cn Postal address: School of Computer Science and Technology, University of Science and Technology of China, Hefei, Anhui, China (å®å¾½çåè¥å¸ä¸­å½ç§å­¦ææ¯å¤§å­¦è®¡ç®æºå­¦é¢) Brief Publications     Awards & Professional Activities      Softwares Brief Huanhuan Chen (IEEE Fellow), is a professor in School of Computer Science, University of Science & Technology of China (USTC), Hefei, China. He received the B.Sc. degree from USTC, Hefei, China, in 2004, and Ph.D. degree, sponsored by Dorothy Hodgkin Postgraduate Award, in computer science at the University of Birmingham, Birmingham, UK, in 2008. He worked in University of Birmingham and University of Leeds in the UK from 2008 to 2012, respectively. His PhD thesis \"Diversity and Regularization in Neural Network Ensembles\" has received 2011 IEEE Computational Intelligence Society Outstanding PhD Dissertation award (the only winner) and 2009 CPHC/British Computer Society Distinguished Dissertations Award (the runner up). His work âProbabilistic Classification Vector Machinesâ on Bayesian machine learning published in IEEE Transactions on Neural Networks, has been awarded as IEEE Transactions on Neural Networks Outstanding 2009 Paper Award (bestowed in 2012, and only one paper in 2009 receive this award). In 2015, Dr. Chen received the International Neural Network Society (INNS)Young Investigator Award in 2015 for his significant contributions in the field of Neural Networks.His research interests include computational intelligence, statistical machine learning, data fusion, neural networks, Bayesian inference and evolutionary computation, etc.",
  "content_length": 1826,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:18"
}