{
  "name": "Huazhe Xu",
  "homepage": "https://iiis.tsinghua.edu.cn/en/People/Faculty/XuHuazhe.htm",
  "status": "success",
  "content": "ï»¿ Xu Huazhe-Institute for Interdisciplinary Information Sciences (IIIS) Home IIIS Headlines Institute Seminars About IIIS Introduction Message From Dean Current Leadership History News Latest News Media Coverage People Faculty Research Honorary Professors Adjunct Instructors Postdocs Administrative Staff Lab Assistants Yao Class About Yao Class Admission Graduate Graduate Programs Graduate Admission CQI Introduction Faculty Research Overview CQI News Research Organization Research Groups Latest Research Research Report Campus Campus Events Student Life Join Us Faculty Recruitment Postdoctoral Recruitment Staff Recruitment Alumni IIIS Alumni Community Giving People Faculty Research Honorary Professors Adjunct Instructors Postdocs Administrative Staff Lab Assistants Huazhe Xu Deep reinforcement learning, robotics, computer vision and tactile sensing Research Direction: Reinforcement Learning, Robotics, Computer Vision, and tactile sensing. Specifically, my research focuses on modeling the dynamics of the world, leveraging/finding human priors for policy learning, and further enabling algorithms to learn in a sample-efficient manner. I am also interested in solving complex real applications with deep learning and reinforcement learning. Homepage: http://hxu.rocks Google Scholar Page: https://scholar.google.com/citations?user=t9HPFawAAAAJ&hl=en Office: TBD Office Hour: TBD For students in IIIS, feel free to send me an email with any questions or concerns. I will usually reply within 12 hours :) Related information Email Office C1901-5, Tsinghua University, Beijing, China Google Scholar https://scholar.google.com/citations?user=t9HPFawAAAAJ&hl=en RM 1-208, FIT Building, Tsinghua University, Haidian District, Beijing, 100084, P. R. China +86-010-62781693      FAX: +86-010-62781693-2000     EMAIL: iiis@mail.tsinghua.edu.cnCopyright@IIIS, Tsinghua University, All Rights Reserved. TOP",
  "content_length": 1910,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:19"
}