{
  "name": "Hubert Pak Ho Shum",
  "homepage": "http://hubertshum.com",
  "status": "success",
  "content": "ï»¿Prof. Hubert Shum | Visual Computing | Durham University HOMEto discoverJOINING USto achievePUBLICATIONSto innovateGRANTSto establishACTIVITIESto engagePEOPLEto collaborateTEACHINGto inspireCONTACTSto explore Hubert Shum, Hubert PH Shum, Hubert P H Shum, H P H Shum, P H Shum, PH Shum, H P Shum Prof. Hubert P. H. Shum SMIEEE, FHEA, PhD, MSc, BEngProfessor of Visual Computing, Durham UniversityDirector of Research of the Department of Computer ScienceCo-Director of Durham University Space Research CentreResearch Interests: Responsible AI, Computer Vision, Computer Graphics, AI in HealthcareDurham ProfileGoogle ScholarYouTubeLinkedInTwitter/XGitHubORCIDResearch-GateEmailBiography Prof. Hubert P. H. Shum is a Professor of Visual Computing and the Director of Research of the Department of Computer Science at Durham University, specialising in modelling spatio-temporal information with responsible AI. He has authored over 200 research publications in the fields of Computer Vision, Computer Graphics and AI in Healthcare, underpinned by Responsible AI designs and algorithms. His work has been featured in leading venues such as CVPR, ICCV, ECCV, SIGGRAPH, MICCAI, IEEE TVCG and IEEE TIP. His research is fundamental to many disciplines, facilitating him to engage in multidisciplinary research related to healthcare, space technology, art, autonomous vehicles and robotics. He is a Co-Founder and the Co-Director of Durham University Space Research Centre, a Fellow of the Wolfson Research Institute for Health and Wellbeing, and a Steering Group Member of the Centre for Visual Arts and Culture. He is an Advisory Board member of TORUS, a Â£6 mil EPSRC project supporting Parkinson's disease patients with sensing technologies. To develop his team, he has led research projects as the Principal Investigator awarded by EPSRC, the Ministry of Defence, the Royal Society and Innovate UK. He has also been a Co-Investigator in NortHFutures, a Â£4.17 mil EPSRC project to establish a new digital health hub in North East England. These have facilitated him to have supervised more than 30 PhDs, recruited multiple Post-doctoral Researchers, and collaborated with international researchers from the UK, France, China, Japan and India. To engage the academic and industrial networks, he has chaired international conferences such as Pacific Graphics, BMVC, ACM SIGGRAPH/Eurographics SCA and ACM SIGGRAPH MIG. He has been interviewed by the UK Catapult Network for his counter-drone research. Contributing to the research community, he has served as an Associate Editor for the Computer Graphics Forum, a Guest Editor for the International Journal of Computer Vision, and a Program Committee member in over 20 conferences such as Eurographics and Pacific Graphics. He has been an Expert Panel member for EPSRC and FWO, served in the EPSRC Peer Review College, and frequently reviewed grant proposals from EPSRC, Mitacs, ANR, NSERC, FCT, UGC. Joining UsJoin us either as a PhD student, a visiting/internship student, or an academic visitor. My team has a supportive culture with members developing high-quality research while enjoying their vibrant lives in the UK.See application instructions.PhD directions include:Computer Vision with Deep-Learning Based Artificial Intelligence for High-Dimentional DataDeep Learning Based Machine Vision and Robotics for Space-Informed Applications Generative Artificial Intelligence for Virtual Characters in Computer Graphics and Computer AnimationDurham UniversityDurham University is a top British university ranked top-100 in the world and the 5th in the UK. As a member of the elite Russell Group, Durham University focuses on research excellence delivered by world-class academics. It is the third oldest university in England, following Oxford and Cambridge, with the campus's Cathedral and Castle being a UNESCO world heritage. It is located at Durham in North East England, one of the safest cities in the UK with an affordable living cost.The Department of Computer Science is ranked the 7th in the UK, evidencing its achievements in research and education. It is supported by major investments in staff recruitment and academic infrastructure. 97% of its research outputs are considered as “world-leading” and “internationally excellent” by the UK Research Excellence Framework.NewsI gave a research seminar on geometry-informed interaction modelling and video analysis at Imperial College London.Nov-25Our pedestrian trajectory prediction research was accepted in AAAI 2026.Nov-25Our interacting characters motion in-betweening research was accepted in SIGGRAPH Asia 2025.Sep-25I gave a keynote on responsible video analysis for surveillance applications in International Conference on Security, Surveillance and Artificial Intelligence 2025.Sep-25I was invited to review an EPSRC New Investigator Award proposal on healthcare and AI.Sep-25I became the PhD External Examiner of Yun Zhong from Imperial College London.Jul-02I became the PhD External Examiner of Fu Wang from the University of Exeter.Aug-25I was invited to review two NSFC/RGC Joint Research Scheme proposals and one RGC Collaborative Research Fund proposal by the Hong Kong University Grants Committee.Aug-25Li Li, my co-supervised PhD, received Durham University Computer Sscience Best PhD Thesis Prize.Jul-25Our large-scale multi-character interaction synthesis research was accepted in SIGGRAPH 2025.Jun-25Grant proposal success for my Seedcorn Funding from Singapore Management University and Durham University co-led by myself and Jiannan Li.May-25I became an Area Chair of British Machine Vision Conference 2025.May-25I am invited to be an EPSRC expert panel member for the EPSRC Open Fellowships and Open Plus Fellowships.Apr-25I am invited to be a FWO (Research Foundation - Flanders) panel expert member for the Strategic Basic research fellowships.Apr-25I gave a research seminar on AI in healthcare at Swansea UniversityApr-25I gave a research seminar at Cardiff University to introduce the Department of Computer Science at Durham University and my research on spatial-temporal data modelling.Apr-25I gave a research seminar on video analysis at the University of Bristol.Apr-25I was invited to review four RGC FDS proposals and two RGC funding proposals by the Hong Kong University Grants Committee.Apr-25Our autonomous vehicle research has become a UKRI Trustworthy Autonomous Systems Hub AI and Robotics Research Best Paper Award Finalist.Mar-25I became the PhD External Examiner of Hengfei Wang, a PhD from the University of Birmingham supervised by Dr Hyung Jin Chang.Feb-25I gave a research seminar at the University of Birmingham on responsible AI for spatio-temporal visual computing.Jan-25I participate as a speaker at the AI Knowledge Transfer Roundtable organised by Insights North East at Newcastle University.Jan-25I was invited to review a Leverhulme Trust proposal for the Research Project Grants.Dec-24I became a Program Committee member in EG 2025.Dec-24I became a Senior Program Committee member in IJCAI 2025.Dec-24Li Li, my co-supervised PhD, received the Sullivan Doctoral Thesis Prize runner-up, awarded at BMVC 2024.Nov-24I was interviewed by Durham's 100 Face of Science on my AI for space research.Nov-24I was invited to review an EPSRC proposal in a £10 mil program for transforming prediction and early diagnosis.Nov-24I became a Reviewer in CVPR 2025.Nov-24I became the external examiner of Matthew Kent Myers, a PhD at Newcastle University.Oct-24I become a Co-Organiser of IEEE/CVF Winter Conference on Applications of Computer Vision Workshop on Human-Autonomous Vehicle Interaction 2025.Oct-24Both of our LiDAR point cloud segmentation and action quality assessment research were accepted in ECCV 2024 as oral papers, i.e. top 2.3% of 8585 paper submissions.Aug-24I became the external examiner of Nefeli Andreou, a PhD at the University of Cyprus.Jul-24Our endoscopic video inpainting research was accepted in MICCAI 2024.Jun-24Our CVPR DCAMI Workshop paper has received the Best Paper Award.Apr-24I became an Area Chair in BMVC 2024.Apr-24I became an Associate Editor of IET Computer Vision.Apr-24I was invited to review a proposal from Mitacs Accelerate.Apr-24I became an Advisory Board member of TORUS, a 6 mil EPSRC project led by the University of Bristol.Mar-24I am recruiting an Associate/Assistant Professor in Artificial Intelligence for Space-Enabled Technologies for Durham University Space Research Centre.Feb-24I became a technical reviewer in ECCV 2024.Feb-24I became a member of Program Committee in IJCAI 2024.Feb-24I was invited to review a fellowship proposal and a standard proposal from EPSRC.Jan-24I co-founded Durham University Space Research Centre, a multidisciplinary research centre that was worth 2.76 mil of Durham University's investment.Dec-23I was invited to be the external examiner of the PhD Amirhossein Dadashzadeh at the University of Bristol.Dec-23I became a member of Program Committee in EG 2024.Nov-23I was interviewed by the UK Catapult Network on how AI and computer vision enhance security.Oct-23I gave a seminar in INRIA, France, on geometry-informed visual understanding.Oct-23I was invited to be the external examiner of the PhD Qian Li at the University of Rennes.Oct-23I received a Certificate on Exceptional Achievement for Excellence in PhD supervision by Durham University.Sep-23Dr Juan Zhang, an Associate Professor at Shaanxi Normal University, has joined our team as a Visiting Academic.Sep-23Two research on 360 video adaptation and hand gesture based virtual interaction were accepted in ISMAR 2023.Aug-23Two research on adversarial attack and 2D to 3D reconstruction were accepted in ICCV 2023.Jul-23I became a Fellow of the Wolfson Research Institute for Health and WellbeingJul-23Grant proposal success for the 4.17 mil Northern Health Futures (NortHFutures), an EPSRC Digital Health Hub pilot, as a co-investigator.Jun-23I was invited to review an EPSRC fellowship proposal.",
  "content_length": 25044,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:23"
}