{
  "name": "Hubie Chen",
  "homepage": "https://www.kcl.ac.uk/people/hubie-chen",
  "status": "success",
  "content": "Hubie Chen | King's College London Skip to main contentDr Hubie Chen Senior LecturerResearch interestsComputer scienceContact detailshubie.chen@kcl.ac.ukBiographyHubie Chen is a Senior Lecturer in the Department of Informatics at King’s College London. Prior to working in the UK, he was an Ikerbasque Research Professor in Donostia-San Sebastian, Spain. He has held invited positions at institutions such as E ́cole Polytechnique, Humboldt-Universit ̈at zu Berlin, and Universit ̈at Wien. He received his PhD and BS degrees in computer science and mathematics from Cornell University and Stanford University, respectively. Research interests Database theory Logic in computer science Computational complexity Constraint satisfaction Further information Personal website PublicationsResearchResearchTrusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. Finance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Algorithms and Data AnalysisThe group develops algorithmic solutions and concrete implementations for various applications.Software SystemsThe group studies design, modelling and engineering of software systems.Security HubThe Security Hub consolidates the research related to securityNewsNews17 April 2023Five King's scientists win prestigious New Investigator AwardsThe academics awarded over £2 million from the Engineering and Physical Sciences Research Council (EPSRC).Technology & ScienceFeaturesFeatures18 December 2024Unlocking a path into computer science for young women and non-binary studentsThis autumn, the Department of Informatics and the NMES Faculty Outreach Team ran a first-of-its-kind online outreach programme for female and non-binary...Technology & SciencePublicationsResearchNewsFeaturesResearchTrusted Autonomous Systems HubThe Trusted Autonomous Systems Hub develops the trustable autonomous systems of tomorrow. Finance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Algorithms and Data AnalysisThe group develops algorithmic solutions and concrete implementations for various applications.Software SystemsThe group studies design, modelling and engineering of software systems.Security HubThe Security Hub consolidates the research related to securityNews17 April 2023Five King's scientists win prestigious New Investigator AwardsThe academics awarded over £2 million from the Engineering and Physical Sciences Research Council (EPSRC).Technology & ScienceFeatures18 December 2024Unlocking a path into computer science for young women and non-binary studentsThis autumn, the Department of Informatics and the NMES Faculty Outreach Team ran a first-of-its-kind online outreach programme for female and non-binary...Technology & Science(N)5.04Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering SciencesSoftware Systems Group",
  "content_length": 3127,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:25"
}