{
  "name": "Huck Bennett",
  "homepage": "https://home.cs.colorado.edu/~hbennett",
  "status": "success",
  "content": "Huck Bennett Research Publications: Output-Sparse Matrix Multiplication Using Compressed Sensing (arXiv) Huck Bennett, Karthik Gajulapalli, Alexander Golovnev, and Evelyn Warton Preprint. Graph Inference with Effective Resistance Queries (arXiv) Huck Bennett, Mitchell Black, Amir Nayyeri, and Evelyn Warton Preprint. Asymptotic improvements to provable algorithms for the code equivalence problem (ePrint) Huck Bennett, Drisana Bhatia, Jean-François Biasse, Medha Durisheti, Lucas LaBuff, Vincenzo Pallozzi Lavorante, and Philip Waitkevich IEEE Trans. Inf. Theory (to appear). Preliminary version in ISIT 2025. Difficulties Constructing Lattices with Exponential Kissing Number from Codes (arXiv) Huck Bennett, Alexander Golovnev, and Noah Stephens-Davidowitz IEEE Trans. Inf. Theory 71 (10), pp. 7644-7648, 2025. Relating Code Equivalence to Other Isomorphism Problems (ePrint) Huck Bennett and Kaung Myat Htay Win Designs, Codes and Cryptography 93 (3), pp. 701-723, 2025. The more the merrier! On total coding and lattice problems and the complexity of finding multicollisions (ECCC) Huck Bennett, Surendra Ghentiyala, and Noah Stephens-Davidowitz ITCS 2025. Matrix Multiplication Verification Using Coding Theory (arXiv) Huck Bennett, Karthik Gajulapalli, Alexander Golovnev, and Evelyn Warton RANDOM 2024. Topological k-metrics (arXiv) Willow Barkan, Huck Bennett, and Amir Nayyeri Discrete & Computational Geometry (to appear). Preliminary version in SOCG 2024. Invited to the special issue of Discrete & Computational Geometry. Parameterized Inapproximability of the Minimum Distance Problem over all Fields and the Shortest Vector Problem in all l_p Norms (arXiv) Huck Bennett, Mahdi Cheraghchi, Venkatesan Guruswami, and João Ribeiro SIAM J. Comput. 53 (5), pp. 1439-1475, 2024. Preliminary version in STOC 2023. Lattice Problems Beyond Polynomial Time (arXiv) Divesh Aggarwal, Huck Bennett, Zvika Brakerski, Alexander Golovnev, Rajendra Kumar, Zeyong Li, Spencer Peters, Noah Stephens-Davidowitz, and Vinod Vaikuntanathan STOC 2023. The Complexity of the Shortest Vector Problem (ECCC) Huck Bennett ACM SIGACT News 54 (1), pp. 37-61, 2023. Just how hard are rotations of Z^n? Algorithms and cryptography with the simplest lattice (ePrint) Huck Bennett, Atul Ganju, Pura Peetathawatchai, and Noah Stephens-Davidowitz EUROCRYPT 2023. Hardness of the (Approximate) Shortest Vector Problem: A Simple Proof via Reed-Solomon Codes (arXiv) Huck Bennett and Chris Peikert RANDOM 2023. Improved Hardness of BDD and SVP Under Gap-(S)ETH (arXiv) Huck Bennett, Chris Peikert, and Yi Tang ITCS 2022. Reconstructing Weighted Voting Schemes from Partial Information about their Power Indices (arXiv) Huck Bennett, Anindya De, Rocco Servedio, and Emmanouil-Vasileios Vlatakis-Gkaragkounis COLT 2021. Fine-grained hardness of CVP(P)--- Everything that we can prove (and nothing else) (arXiv, blog post) Divesh Aggarwal, Huck Bennett, Alexander Golovnev, and Noah Stephens-Davidowitz SODA 2021. Hardness of Bounded Distance Decoding on Lattices in l_p Norms (arXiv, CCC talk) Huck Bennett and Chris Peikert CCC 2020. An Enumeration Technique for Lattice Basis Reduction (local copy) Huck Bennett Preprint. On the Quantitative Hardness of CVP (arXiv) Huck Bennett, Alexander Golovnev, and Noah Stephens-Davidowitz FOCS 2017. On the Lattice Distortion Problem (arXiv) Huck Bennett, Daniel Dadush, and Noah Stephens-Davidowitz ESA 2016. Planar Minimization Diagrams via Subdivision with Applications to Anisotropic Voronoi Diagrams Huck Bennett, Evanthia Papadopoulou, and Chee Yap SGP 2016. On Percolation and NP-hardness (ECCC) Huck Bennett, Daniel Reichman, and Igor Shinkar Random Structures & Algorithms 54 (2), pp. 228-257, 2019. Preliminary version in ICALP 2016. Amortized Analysis of Smooth Quadtrees in All Dimensions (link) Huck Bennett and Chee Yap Computational Geometry: Theory and Applications 63, pp. 20-39, 2017. Preliminary version in SWAT 2014. Teaching and Mentorship Classes Taught: Advanced Algorithms, University of Colorado, Spring 2025. Design and Analysis of Algorithms, University of Colorado, Fall 2025, Fall 2024. Honors Analysis of Algorithms, Oregon State University, Winter 2023. Analysis of Algorithms, Oregon State University, Fall 2021, Winter 2023, Fall 2023. Foundations of Computer Science, University of Michigan, Fall 2019 (joint with Chris Peikert and Ilya Volkovich). Lattices in Computer Science, Northwestern University, Spring 2019; Oregon State University, Spring 2022; University of Colorado, Spring 2024. Mathematical Foundations of Computer Science, Northwestern University, Winter 2018, Spring 2018, Fall 2018. Computational Geometry, Northwestern University, Fall 2017, Winter 2019. Notes on background material for discrete math are available here. Students: Ph.D.: Matthew Fox (CU physics; co-advised with Manny Knill; 2024 - Present) Peter Ly (2024 - Present) Evelyn Warton (OSU; co-advised with Amir Nayyeri; 2022 - Present) M.S.: Kaung Myat Htay Win (2023 - 2024) Willow Barkan (co-advised with Amir Nayyeri; 2022 - 2023) Undergraduate: Adithya Bhaskara (co-advised with Raf Frongillo; 2025 - present) Ian Tassin (senior honors thesis; 2021 - 2023) Ryan Little (2021 - 2022) Andrew Hwi Gue Cho (2018) About In my spare time I enjoy running, mountaineering, and skiing. Additionally, I enjoy reading and playing Go. I am originally from the bustling metropolis of Hygiene, CO, which was named for the sanitarium that it once housed, and which is now most famous as the home of Apple the Cow. My full first name, Huxley, is actually an English last name.",
  "content_length": 5598,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:25"
}