{
  "name": "Hugh P. Shanahan",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/hugh-shanahan_77128df7-1747-4d9f-8fe5-c11d30e77abc.html",
  "status": "success",
  "content": "Hugh Shanahan - Royal Holloway Research Portal View Scopus Profile Hugh Shanahan Professor BioinformaticsCentre for Systems and Synthetic BiologyProfessor, Department of Computer ScienceCentre for Intelligent Systems https://orcid.org/0000-0003-1374-6015 Phone+44 1784 443433EmailHugh.Shanahanrhul.acuk TW20 0EX Personal profile Research interestsOpen Science and Open Research Accessibility of Data Repositories Computational Notebooks Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): KeywordsOpen ScienceOpen Research Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 74 Article 4 Abstract 4 Other 4 Poster 9 More 3 Conference contribution 2 Book 1 Chapter 1 Paper 1 Editorial 1 Other contribution Research output per year Research output per year Intra-exon motif correlations as a proxy measure for mean per-tile sequence quality data in RNA-SeqAlnasir, J. J. & Shanahan, H. P., Feb 2023, In: Journal of Computational Biology . 30, 2, p. 131-148 18 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 7 Downloads (Pure) FAIR Principles for Research Software (FAIR4RS Principles)Shanahan, H., 16 Mar 2022Research output: Other contribution Open Access How to be FAIR with your dataShanahan, H., 2022, Göttingen: Göttingen University Press. 203 p.Research output: Book/Report › Book Rethinking the A in FAIR Data: Issues of Data Access and Accessibility in ResearchShanahan, H. & Bezuidenhout, L., 27 Jul 2022, In: Frontiers in Research Metrics and Analytics. 7, 912456.Research output: Contribution to journal › Article › peer-review Open Access The CODATA-RDA Data Steward SchoolShanahan, H., 15 Jun 2022, INTERNATIONAL JOURNAL OF DIGITAL CURATION. 1 ed. Edinburgh University Press, Vol. 15. Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open Access View all 95 research outputs Projects 3 Finished Projects per year Mining the Network Behaviour of BotsCavallaro, L. (PI), Gammerman, A. (CoI), Vovk, V. (CoI), Shanahan, H. (CoI) & Luo, Z. (CoI)Eng & Phys Sci Res Council EPSRC16/06/13 → 17/04/17Project: Research cTQM: A cloud based tool for testing the quality of micro-array data in H. sapiens.Shanahan, H. (CoI) & Harrison, A. (CoI)8/06/11 → 9/06/11Project: Research VENUS C ProjectShanahan, H. (PI)European Union1/06/11 → 31/05/12Project: Research Activities 7 Examination 7 Invited talk 3 Workshop, seminar, course or webinar. 2 Peer review of manuscripts 4 More 1 Participation in a conference 1 Editor of research journal 1 Membership of public/government advisory/policy group or panel 1 Supervision Activities per year Data Science Journal (Journal)Shanahan, H. (Member of editorial board)31 Jul 2015Activity: Publication peer-review and editorial work › Editor of research journal Fourth Paradigm - Next Steps worskhopShanahan, H. (Participant)4 Dec 2011Activity: Participating in or organising an event › Workshop, seminar, course or webinar. Ph.D. Internal ExaminerShanahan, H. (Examiner)30 Nov 2011Activity: Examination Reviewer for Garland Science PressShanahan, H. (Examiner)9 Nov 2011Activity: Examination STEN UEN Cloud Computing enabling innovationShanahan, H. (Invited speaker)1 Nov 2011Activity: Participating in or organising an event › Workshop, seminar, course or webinar. View all 23 activities",
  "content_length": 3840,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:26"
}