{
  "name": "Hui Yang 0001",
  "homepage": "http://infosense.cs.georgetown.edu/grace",
  "status": "success",
  "content": "Grace Hui Yang – InfoSense Lab Curriculum Vitae Google scholar DBLP Bio Dr. Grace Hui Yang is a Professor in the Department of Computer Science at Georgetown University, Washington D.C. Dr. Yang is leading the InfoSense (Information Retrieval and Sense-Making) group at Georgetown University. Dr. Yang obtained her Ph.D. from Carnegie Mellon University in 2011. Her current research interests include deep reinforcement learning, interactive agents, search engines, and privacy-preserving information retrieval. Prior to this, she conducted research on question answering, automatic ontology construction, near-duplicate detection, multimedia information retrieval, and opinion and sentiment detection. Dr. Yang’s research has been supported by the Defense Advanced Research Projects Agency (DARPA) and the National Science Foundation (NSF). Dr. Yang led the effort for the Text Retrieval Conference (TREC) Dynamic Domain Tracks from 2015 to 2017 and SIGIR privacy-preserving information retrieval workshops from 2014 to 2016 and co-organized the SIGIR Deep Reinforcement Learning Workshops since 2020. Dr. Yang is associate editor for ACM Transactions on Information Systems and served on the editorial board of Information Retrieval Journal from 2014 to 2017. She has actively served as an organizing or program committee member in many top-tier international conferences such as SIGIR, ECIR, ACL, AAAI, ICTIR, CIKM, WSDM, and WWW, and the general co-chair of SIGIR 2024. She is a recipient of the NSF Faculty Early Career Development Program (CAREER) Award and a co-author of the 2016 book “Dynamic Information Retrieval Modeling.” Join Our Team I am looking for highly motivated PhD students with a strong mathematics background, excellent programming skills, and good writing skills. If you are serious about Information Retrieval research and/or aim to invent the next big thing on the Web, please contact me. Contact Information Department of Computer Science Georgetown University 315D Saint Mary’s Hall 37th and O Streets, NW Washington, DC 20057-1232 Phone: +1 202 687 6355 Email: grace.yang@georgetown.edu",
  "content_length": 2116,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:31"
}