{
  "name": "Hui Jiang 0001",
  "homepage": "https://wiki.eecs.yorku.ca/user/hj",
  "status": "success",
  "content": "Prof. Hui Jiang [Hui Jiang] start Table of Contents Prof. Hui Jiang Welcome to Prof. Hui Jiang's Home Page at YorkU Research News Invited Talks Teaching Student Supervision Prof. Hui Jiang Welcome to Prof. Hui Jiang's Home Page at YorkU Hui Jiang Department of Electrical Engineering and Computer Science, York University 4700 Keele Street, Toronto, Ontario, M3J 1P3, CANADA Office: LAS 3014 Tel: (416) 736-2100 x33346 Fax: (416) 736-5872 Email: username AT domain DOT yorku DOT ca (username: hj; domain: eecs) Nov. 16, 2024: my homepage has been moved to a Github site from now on. My new book “Machine Learning Fundamentals” ©Hui Jiang 2021, is recently published by Cambridge University Press. Check here for details. I am maintaining a technology blog at here. Research I am currently working on various topics related to neural models for machine learning, speech and language processing, and computer vision. We are located at the NCML Lab (LAS2054). If you are interested in doing research with me, please email me at the above address. check for my research interests and recent projects News 2019/05/13: One paper is accepted by ACL2019. 2019/02/22: Two papers are accepted by NAACL2019. 2019/01/20: One paper is accepted by WWW-2019 workshop on Knowledge Graph Technology and Application. 2018/08/10: One paper is accepted by EMNLP2018. 2017/07/01: One paper is accepted by EMNLP2017. 2017/04/23: One paper is accepted by IJCAI2017. 2017/04/01: Two papers are accepted by ACL2017. 2017/03/30: Our FSMN paper is accepted by IEEE Trans. ASLP. 2017/03/01: One paper is accepted by IJCNN-2017. 2016/12/12: Our paper won 2016 IEEE SPS Best Paper Award. 2016/11/11: Our teams won the EDL track (No.1 and No.2 among all participating teams) in 2016 TAC KBP contest. The technical details of our systems can be found: arXiv:1611.03558 and arXiv:1611.00801. 2016/07/20: Our recent work on CommonSense Reasoning was mentioned in a recent article from MIT technology Review. The technical details can be found in our recent arXiv paper here. 2016/06/10: One paper is accepted by Interspeech-2016. 2016/04/04: One paper is accepted by IJCAI-2016. 2016/03/02: Two (2) papers are accepted by NAACL 2016. 2016/01/03: Our HOPE paper is accepted by JMLR. Invited Talks April 2019, “Understanding Deep Learning in Theory”, Vector Institute Seminar on April 5, 2019. (slides) December 2016, “A New General Deep Learning Approach for Natural Language Processing ”, Harbin Institute of Technology, Harbin, China. (Invited and hosted by Prof. Ting Liu) (slides) August 2015, “A New Framework to Learn Neural Networks: Hybrid Orthogonal Projection and Estimation (HOPE)”, Microsoft Research Asia, Beijing, China. (Invited and hosted by Dr. Qiang Huo) (slides) November 2013, “Why Deep Neural Network Works for Speech Recognition?” Deptartment of Electrical and Computer Engineering, Ryerson University. (Invited and hosted by Prof. Xiao-Ping Zhang) (slides) October 2013, “Why DNN Works for Speech and How to Make it More Efficient?” IBM Waston Research Center, Yorktown Heights, New York. (Invited and hosted by Dr. Xiaodong Cui) (slides) February 2013, “Why DNN Works for Acoustic Modeling in Speech Recognition?” Department of Computer Science, University of Toronto. (Invited and hosted by Prof. Gerald Penn) (slides) Teaching My teaching is here Student Supervision My supervised post-doc and graduate students are here. start.txt · Last modified: 2024/11/17 01:08 by huijiang",
  "content_length": 3468,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:29"
}