{
  "name": "Hui Chen 0001",
  "homepage": "https://huichen-cs.github.io",
  "status": "success",
  "content": "Hui Chen @ CUNY Brooklyn College & Graduate Center Skip to main content Biographical Sketch Hui Chen is on the faculty of the Department of Computer and Information Science at Brooklyn College of the City University of New York. Additionally, he is part of the doctoral faculty of the Ph.D. Program in Computer Science at the Graduate School and University Center of the City University of New York. His current research focuses on the intersection of software engineering, wireless networks, wireless sensor networks, and system and network security. He has taught and continues to teach courses in programming, software development, computer networks, computer security, and operating systems. Moreover, he holds the status of a senior member in IEEE and is also a member of ACM. Furthermore, he has served and continues to serve on technical program committees for conferences sponsored by IEEE or ACM. Research Group Professor Hui Chen leads a research group called the Modeling and Analytics of Software and Systems (MASS) lab. The group welcomes collaborations with industry, as well as motivated graduate and undergraduate students. Please contact him if you are interested in joining the research group. Contact Office: 1432N Ingersoll Hall Phone: (718)951-5000 Ext. 2055 Fax: (718)951-4842 E-mail: huichen (at) ieee (dot) org or hui.chen (at) brooklyn (dot) cuny (dot) edu Web: Official Portal Mailing Address Computer and Information Science 2109 Ingersoll Hall Brooklyn College 2900 Bedford Avenue Brooklyn, NY 11210-2889 For Ph.D. Student Professor Hui Chen particularly welcomes Ph.D. students or prospective Ph.D. students to join his group. Please review the information about the Ph.D. Program in Computer Science at the Graduate Center of the City University of New York. Search Results × Google JSON/Atom Custom Search API provides 100 search queries per day for free. The search fails when the daily limit is exceeded. You may search directly on Google again without the restriction via the search box below. Input Web Search Web Search Close",
  "content_length": 2061,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:26"
}