{
  "name": "Hui Fang 0003",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/hui-fang",
  "status": "success",
  "content": "Hui Fang | Computer Science | Loughborough University Dr Hui Fang Senior Lecturer International Partnerships Coordinator Publications +44 (0) 1509 222 579 Send email Office: N.2.02 (Haslegrave Building) Biography Research Responsibilities Dr. Hui Fang joined the computer science department, Loughborough University in January 2019. He received his B.Sc. from the University of Science and Technology Beijing (USTB), China, in 2000 and Ph.D. from the University of Bradford, UK, in 2006. Since then, he has carried out research in several world-leading universities, such as the University of Oxford and Swansea University. In 2015, he was appointed as a lecturer at Edge Hill University and promoted to senior lecturer in 2017. In 2018, he worked as a senior lecturer at Liverpool John Moores University. He has significant experience of using machine learning techniques and visualization methods in a number of projects, e.g., EU FP6 content-based video analysis, EPSRC face modelling, The Welsh Assembly funded Research Institute of Visual Computing (RIVIC) project and Innovate UK funded seismic data visual bulletin analysis (VBAS) project. Dr Hui Fang’s research interest is applying visual computing and AI technologies to digital healthcare, precision agriculture, business intelligence, environment change monitoring, and contemporary transportation systems. His ongoing projects include: Since 2018, he has been working in the Intelligent Movement Analysis (IMA) group (formed by researchers at the University of Manchester, University of Leeds, Loughborough University, and neurologists from Leeds Teaching Hospitals and University of Tasmania, Australia) to develop augmented clinical assessment tools for Parkinson’s disease. In 2020, he joined the RAMP-VIS team led by Professor Min Chen at the University of Oxford to develop visualization and visual analytics tools for the modelling scientists and epidemiologists in the Scottish COVID-19 Response Consortium. Currently, a visual analytics subsystem is under development with joint efforts from King’s College, Warwick University, Loughborough University, Swansea University and Nottingham University. He provides consultancy services to Singular Intelligence, London - a business intelligence company, and recently one KTP project and two Innovate UK smart grants project have been funded with the company. He works with the Institute of Agricultural Economics and Rural Development, Guangzhou, and Feijie New Telecom Ltd China to apply AI technology to improve agricultural production and efficiency of supply chain management. In October 2020, a PhD studentship which research topic is using AI in Agriculture was joint funded by EPSRC, the U.K. and Feijie New Telecom, China. Funding received: 2021 - 2023 PI of Singular Intelligence KTP project. £197,792. 2020 - 2021 Co-PI of Innovate UK funded project: An agent-based modelling solution for reliable decision making in crisis and market turmoil in consumer retail. £199,751. 2021 - 2022 Co-PI of EPSRC UKRI funded project: RAMP VIS: Making Visual Analytics an Integral Part of the Technological Infrastructure for Combating COVID-19. £427,038 (£533,798 at 100% FEC). 2020 - 2023 PI of EPSRC industrial matched funded PhD studentship: Drone-based AI system in agriculture. £60,866 (50% funded by EPSRC, 50% funded by Company). 2020 Co-PI of NIHR Surgical MedTech Cooperative Future Unmet Needs Call Clinically Driven Theme: The Future of Surgery. Project: Computer vision to automatically monitor urine output. £10,000. 2018 Co-I of NERC Airborne Research Facility grant project: Assessing dune field evolution at Sefton Coast. £354,354. 2017 RIF Travel Funding: £1800 for IEEE ICIP Conference in Beijing, China. 2016 RIF Travel Funding: £2200 for IEEE Vis Conference in Baltimore, USA. Research areas Dr. Hui Fang’s research interest is applying visual computing and AI technologies for digital healthcare, precision agriculture, business intelligence, environment change monitoring, and contemporary transportation systems. Teaching and research",
  "content_length": 4071,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:29"
}