{
  "name": "Hui Wang 0011",
  "homepage": "https://jessiehuiwang.github.io/index.html",
  "status": "success",
  "content": "Jessie Hui Wang @ Tsinghua University Jessie Hui Wang Home Research Papers Team Jessie Hui Wang Tenured Associate Professor Institute for Network Sciences and Cyberspace Tsinghua University Beijing, ChinaPhone: 86-10-62603212 Email: jessiewang at tsinghua.edu.cn ResearchGate Research interests: Internet routing and routing security, cloud/edge computing and distributed learning, network performance optimization. For more information, visit my research on Internet topics and my research on network systems. In recent two years, I am also working on an interdisciplinary research topic/project cyberspace governance, which involves 23 research institutions from 12 Asian and 2 European countries. I also participated in some extra-large projects in these years, such as Future Internet Technology Infrastructure Project (FITI, ongoing, broadly similar to GENI), China Next Generation Internet (CERNET2, the first native IPv6 deployment in China), Space-ground Integrated Communication Network, and China Telecom Next Generation Internet Technology Research Project. See this CCR article for an example. Education Ph.D. in Information Engineering, the Chinese University of Hong Kong. Advisor: Professor Dah Ming Chiu Co-Advisor: Professor John C.S. Lui B.S. and M.S. in Computer Science, Tsinghua University. Teaching Computer Network Management, undergraduate, 48 class hours (course info) Spring' 13, Spring' 14, Spring' 15, Spring' 16, Spring' 17, Spring' 18, Spring' 19, Spring' 20, Fall' 21, Spring' 22 Cyberspace Mapping and Situation Awareness for Cybersecurity, graduate, 48 class hours (course info) Fall' 19, Fall' 20, Fall' 21, Fall' 22 Students Shuying Zhuang (co-advised with Prof. Jilong Wang) Chenghao Rong Juncai Liu Tianhao Wu Rui Li (Master) Chao Xu Nan Jiang (Master) I am working closely with these students on some projects or papers: Jiawei Li (working closely on the cyberspace governance project) Ming Wang (working closely on the cyberspace governance project) Yi Qiao (working closely on the cyberspace governance project) Student Alumni Jianping Weng, M.S. 2018 (graduate with honor), joined Alibaba. (Thesis: Anomaly Traceback and Elastic Resource Allocation based on Cloud Platform Monitoring) I also worked with Shengchao Liu, Haibo Wang, and Congcong Miao in 2018 and 2019. Fundings PI, Overlay Routing Strategies Towards Cross-domain End-to-End Communication with Soft Guarantees, Huawei Ltd., starting from Aug. 2021. PI, A Study on the Risk of Inter-Nation Surveillance and the Evasion Game in the Internet Routing, Natural Science Foundation of China, No. 62072269, Jan. 2021 - Dec. 2024. PI, Cross-domain Collaborative Management Architecture for International Cyberspace Governance, Task of National Key Research and Development Program of China, June. 2020 - May. 2023. PI, A Multi-Dimensional Analysis on the Risk and Evolution of Internet Topology and Routing, Electronic Technology Cyber Security Co., Ltd., Jul. 2020 - Mar. 2021. Co-PI, Future Network Architecture for Time-Location-Based Services, National Science and Technology Innovation Zone Program, June. 2020 - Oct. 2021. PI, Evaluation, Design and Implementation of Layer 2 LISP through Open Source Framework, Cisco, Jun. 2013 - Jun. 2014. PI, Optimizing Peering and Routing Strategy based on Traffic Cost Model, Natural Science Foundation of China, No. 61202356, Jan. 2013 - Dec. 2015. PI, Optimizing Peering and Routing Strategy based on Traffic Cost Model, Tsinghua University Initiative Scientific Research Program, Jul. 2012 - Jun. 2015. For potential Postdocs and PhD students: Please try to work with me for several months (as intern students) before you apply for a PhD or Master position. I am looking for self-motivated and diligent PhD students with intellectual curiosity and passion in doing \"research\". I expect my students have a strong background in networking/Internet and/or distributed systems. Students who are familiar with various systems and programming skills are preferred. I am always looking for postdocs in the area of networking and Internet. If you are interested, please email me and provide me with your CV.",
  "content_length": 4143,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:30"
}