{
  "name": "Hui Xiong 0001",
  "homepage": "https://www.hkust-gz.edu.cn/people/hui-xiong",
  "status": "success",
  "content": "Hui XIONG – The Hong Kong University of Science and Technology (Guangzhou) Explore HKUST(GZ) New Student Orientation Learn More RED BIRD CHALLENGE CAMP Learn More Undergraduate Admissions Website Learn More HKUST Admissions Faculty Profiles Join Us Library Giving Copyright © The Hong Kong University of Science and Technology (Guangzhou). All rights reserved No.1 Du Xue Rd, Nansha District, Guangzhou 020-88331234 粤公网安备 44011502001012号 粤ICP备20065231号 Information Disclosure Purchase Management Accessible brows Address Contact Privacy Brand Guidelines gap wechat MicroBlog Facebook YouTube Instagram LinkedIn X 小红书 BiliBili Senior Administration Home/ about/ Leadership/ Senior Administration/ Hui XIONG Hui XIONG PhD in Computer Science University of Minnesota, Twin Cities, 2005 Associate Vice-President (Knowledge Transfer) Chair Professor Thrust of Artificial Intelligence Affiliate Professor Dept of Computer Science & Engineering Research Interest Artificial Intelligence Data Mining and Knowledge Discovery Mobile Computing Biography Professor Xiong Hui holds esteemed positions at the Hong Kong University of Science and Technology (Guangzhou) as a Chair Professor, and Associate Vice President for Knowledge Transfer. Before joining HKUST(GZ), he was a Distinguished Professor at Rutgers University and held the position of Chief Scientist (Smart City) and Deputy Dean at Baidu Research Institute, overseeing five research labs. Prof. Xiong has received numerous honors and awards, including being elected as Fellow of Association for the Advancement of Artificial Intelligence (AAAI), Fellow of the American Association for the Advancement of Science (AAAS), Fellow of the Institute of Electrical and Electronics Engineers (IEEE), Distinguished Scientist of the Association for Computing Machinery (ACM), and Fellow of the Chinese Association for Artificial Intelligence (CAAI). He is also recognized for his talent cultivation as many of his PhD students have become tenure-track professors worldwide. Important Note Directly Apply",
  "content_length": 2044,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:31"
}