{
  "name": "Hui Fang 0001",
  "homepage": "http://www.ece.udel.edu/~hfang",
  "status": "success",
  "content": "Hui Fang - ECE @ UDel Hui Fang Professor JPMorgan Chase Fellow Department of Electrical and Computer Engineering (Affiliated with Department of Computer and Information Sciences, Institute for Financial Services Analytics, Center for Bioinformatics and Computational Biology) University of Delaware 201B Evans Hall Newark, DE 19716 Email: hfang AT udel.edu Phone: (302)831-7238 || Research || Publications || Teaching   || Services   || Virtual IR Lab   || Short Biography I am a Professor in the Department of Electrical and Computer Engineering at the University of Delaware. I am also affiliated with the Department of Computer and Information Sciences, Institute for Financial Services Analytics and Center for Bioinformatics and Computational Biology. I lead the InfoLab group working on exciting topics related to information management such as Information Retrieval, Knowledge base, Data Mining and Biomedical Informatics. My research has been supported by National Science Foundation, University of Delaware Research Foundation and companies such as HP Labs and JPMorgan Chase. I received my M.S. and Ph.D degree from University of Illinois at Urbana-Champaign in 2004 and 2007, respectively, and B.S. degree from Tsinghua University in 2001. Honors and Awards JP Morgan Chase Faculty Fellow/Scholar, 2017-present. Early Career Academic Achivement Alumni Award, Department of Computer Science, University of Illinois at Urbana-Champaign, 2019. David L. and Beverley J. C Mills Career Development Chair, 2016-2020. College of Engineering Excellence in Teaching Award, University of Delaware, 2013. HP Lab Innovation Research Awards, HP Labs, 2010-2012. ACM SIGIR 2004 Best Paper Award, 2004. Research Research Publications: Publications Research interests: Information Retrieval, Enterprise Information Management, Biomedical Informatics, Data Mining I have a broad interest in all kinds of real world applications that are related to effectively and efficiently managing large amount of text information. My primary research interest is information retrieval. I am also interested in enterprise information management, biomedical informatics and data mining. One of my main research interests is axiomatic approaches to IR. Here is a link that summarizes useful information about this research topic. We have developed an online system, Virtual IR Lab, which makes it easier to implement retrieval functions and analyze their results. You are welcome to check it out! (Please use guest and guest for login). If you are interested in using the system a course assignment, please feel free to contact me (hfang AT udel.edu). Research Projects: Text Mining for Plastic Innovation, DOE. The HeNN App for Addressing Opioid Use Disorders, Delaware Bioscience CAT Award. Information Chain Support for Disaster Mitigation, Preparedness, Response and Recovery, NSF. Smartphone based Treatment Enhancement for Clinical Depression, UDRF. Models and Measures for Novel and Diverse Search Results, NSF. Truth of Misinformation? An Integrative Analytical Tool for Social Media, HP Labs. Process Improvement and Optimization for Enterprise Storage Service Management, JPMC. Improving Search Quality in Enterprise Search through Integrated Inforamtion and Collaborative Activities, HP Labs. An Early Warning System for Unrecognized Drug Side Effect Discovery, UDRF. Teaching CPEG 323 - Introduction to Computer Systems Engineering (Fall 2021, Fall 2020, Fall 2019, Fall 2018, Fall 2017, Fall 2016, Fall 2015, Fall 2014, Fall 2013, Fall 2012, Fall 2011,Fall 2010, Fall 2009) CPEG/ELEG 457/657 - Search and Data Mining (Spring 2021, Summer 2021, Spring 2020, Summer 2020, Summer 2019, Spring 2019, Summer 2018, Spring 2018, Summer 2017, Spring 2017, Spring 2014, Spring 2013, Spring 2012) ELEG 662 - Digital Systems Seminar (Spring 2013, Fall 2012, Fall 2010, Fall 2009) CPEG/ELEG 457/657 - Search Engine Technology (Spring 2011) CPEG/ELEG 467-011/667-011 - Search Engine Technology (Spring 2009) CSE788I02-Information Retrieval (OSU, Spring 2008) CSE888I02 - Information Retrieval Seminar (OSU, Spring 2008, Winter 2008) CSE671 - Introduction to Database Systems II(OSU, Winter 2008, Autumn 2007) Professional Services Program Co-Chair: ICTIR 2017 long papers, SIGIR 2021 short papers, SIGIR 2017 short papers. Associate Editor: ACM Transaction of Information Systems, Information Retrieval Journal Guest Editor : IRJ special issue on axiomatic thinking for Information Retrieval. Steering committee member : ICTIR, 2017-2020. Workshop Co-Organizer : ATIR: SIGIR'17 Workshop on Axiomatic Thinking for Information Retrieval and Related Tasks Conference Co-Chair: ICTIR 2016. IR Track PC Vice Chair:CIKM 2009. Proceedings Chair: CIKM 2014. Area Chair/Senior Program Commitee member: CIKM, WWW, SIGIR, WSDM Coordinator: Million query track in TREC 2009 Program Committee Member: ACM SIGIR; ACM CIKM; WSDM; WWW; ECIR; ICTIR; ACM KDD; ACL; NAACL-HLT; EMNLP; AAAI; ICWSM; COLING; IEEE BIBE ; ICML; ADKDD; AIRS; IJCNLP, IJCAI. Reviewer/Panelist: National Science Foundation, the first annual conference for the Institute for Financial Service Analystics, ACM Transaction on Information Systems (TOIS), IEEE Transactions on Knowledge and Data Engineering (TKDE), IEEE Transactions on Parallel and Distributed Systems (TPDS), IEEE Transactions on Dependable and Secure Compusing (TDSC), IEEE/ACM Transactios on Computational Biology and Bioinformatics (TCBB), Information Retrieval (IRJ), Knowledge and Information Systems (KIS), Journal of Computer Science and Technology (JCST), Information Processing & Management (IP&M), Information Processing Letters(IPL), Transactions on Systems Mans and Cybernetics (SMCC), ETRI Journal Faculty Advisor: Women in ECE Last updated: May, 2021",
  "content_length": 5763,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:31"
}