{
  "name": "Hui Cui 0001",
  "homepage": "https://research.monash.edu/en/persons/hui-cui",
  "status": "success",
  "content": "Hui Cui - Monash University View Scopus Profile Hui Cui Dr Senior Lecturer, Department of Software Systems & Cybersecurity https://orcid.org/0000-0002-5820-2233 EmailHui.Cuimonashedu Accepting PhD Students 20132026 Research activity per year Personal profile BiographyDr. Cui received her PhD from University of Wollongong, Australia. Before joining the Department of Software Systems and Cybersecurity, Faculty of IT, Monash University, Australia, she was a lecturer at Murdoch University, Australia. Prior to that, she worked as a research fellow first at Singapore Management University, Singapore, and then at RMIT University, Australia and Data61, CSIRO, Australia. Research interestsCryptography, Applied Cryptography, Cloud Security, IoT Security, Blockchain Security Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationCybersecurity, PhD, Privacy Preserving Public Key Cryptography Research area keywordsCryptographyApplied cryptographyCloud SecurityBlockchain securityIoT Security Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2022 2024 2027 1 Not started 2 Active 3 Finished Projects per year Grid Guru: Grid Guru - Leveraging AI-Driven Grid OptimisationWagner, M. (Primary Chief Investigator (PCI)), Abbasnejad, E. (Chief Investigator (CI)), Mak, T. (Chief Investigator (CI)), Shareghi Nojehdeh, E. (Chief Investigator (CI)), Wang, H. (Chief Investigator (CI)), Cui, H. (Chief Investigator (CI)), Goodwin, S. (Chief Investigator (CI)) & Lipscombe, S. (Project Manager)Monash University – Internal Faculty Contribution, GridGuru Solutions Pty Ltd, Electricity Transmission Ministerial Holding Corporation (trading as Transgrid)16/07/25 → 15/07/26Project: Research Ethical framework: Developing an Ethical Framework for using Blockchain-based Digital Credential Systems: Tackling the issue of Fake DegreesWhitty, M. (Primary Chief Investigator (PCI)), Cui, H. (Chief Investigator (CI)), Srivastava, A. (Chief Investigator (CI)), Liu, J. (Chief Investigator (CI)), Kumar Sinha, M. (Partner Investigator (PI)) & Young, G. (Chief Investigator (CI))Department of Foreign Affairs and Trade (DFAT) (Australia)1/11/24 → 31/10/26Project: Research Building Cyber Resilience in Fiji: Securing the Nation’s Digital FutureLiu, J. (Primary Chief Investigator (PCI)), Rudolph, C. (Chief Investigator (CI)), Boorman, J. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Yuen, J. (Chief Investigator (CI)), Ma, X. (Chief Investigator (CI)), Cui, H. (Chief Investigator (CI)) & Liu, D. (Chief Investigator (CI))2/02/26 → 29/01/27Project: Other Advancing Sustainability : Blockchain-Powered Peer-to-Peer Energy Trading: Advancing Sustainability and Affordability in Smart Residential CommunitiesCui, H. (Primary Chief Investigator (PCI)) & Cheema, A. (Chief Investigator (CI))11/11/24 → 11/11/25Project: Research Improving Secure: Improving Secure Identity Management in Blockchain-based Applications Cui, H. (Primary Chief Investigator (PCI)) & Liu, J. (Chief Investigator (CI))18/03/24 → 25/10/24Project: Research View all 6 projects Research output Research output per year 2013 2018 2023 2024 2025 2025 45 Article 22 Conference Paper 3 Review Article 1 Foreword / Postscript Research output per year Research output per year A Blockchain-Based Digital Identity Management System via Decentralized Anonymous CredentialsCui, H., Whitty, M., Miyaji, A. & Li, Z., 2025, Proceedings of the 6th ACM International Symposium on Blockchain and Secure Critical Infrastructure, BSCI 2024. Choo, K.-K. R., Gai, K., K. Liu, J. & Yu, J. (eds.). New York NY USA: Association for Computing Machinery (ACM), 11 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research Open AccessFile 2 Citations (Scopus) A Privacy Preserving Attribute-Based Access Control Model for the Tokenization of Mineral Resources via BlockchainNemala, P., Chen, B. & Cui, H., 25 Jul 2025, In: Applied Sciences (Switzerland). 15, 15, 24 p., 8290.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Audio Deepfake Detection: What Has Been Achieved and What Lies AheadZhang, B., Cui, H., Nguyen, V. & Whitty, M., 22 Mar 2025, In: Sensors. 25, 7, 33 p., 1989.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 5 Citations (Scopus) BDEC: Enhancing Learning Credibility via Post-quantum Digital CredentialsLi, Z. Z., Zhang, X., Cui, H., Zhao, J. & Chen, X., 2025, Provable and Practical Security - 18th International Conference, ProvSec 2024 Gold Coast, QLD, Australia, September 25–27, 2024 Proceedings, Part II. Liu, J. K., Chen, L., Sun, S.-F. & Liu, X. (eds.). Singapore Singapore: Springer, p. 45-64 20 p. (Lecture Notes in Computer Science; vol. 14904).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Blockchain-Empowered H-CPS Architecture for Smart AgricultureWang, X., Wu, Q., Zeng, H., Yang, X., Cui, H., Yi, X., Piran, M. J., Luo, M. & Que, Y., 17 Jul 2025, In: Advanced Science. 12, 27, 18 p., 2503102.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 3 Citations (Scopus) View all 71 research outputs Prizes Best Student Paper Award Norbu, T. (Recipient), Park, J. Y. (Recipient), Wong, K. (Recipient) & Cui, H. (Recipient), 28 Aug 2025Prize: Prize (including medals and awards)",
  "content_length": 5960,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:27"
}