{
  "name": "Hui Lv 0001",
  "homepage": "https://huilucs.github.io",
  "status": "success",
  "content": "Hui Lu Hui Lu Assistant Professor Department of Computer Science and Engineering (CSE) The University of Texas at Arlington (UTA) Email: hui.lu at uta.edu LinkedIn | Google Scholar | CV I am looking for motivated students to work with. If you are interested, please drop me an email. Welcome I am an Assistant Professor at the University of Texas at Arlington (UTA). My research interests span operating systems, systems virtualization, file and storage systems, computer networks, and systems performance optimization, especially in the context of cloud computing. Before joining UTA, I was an Assistant Professor at the State University of New York (SUNY) at Binghamton. I received my Ph.D. degree from Purdue University, where I researched in FRIENDS Lab under the direction of Professor Dongyan Xu. I am the recipient of an NSF CAREER Award (2023). Selected Publications (full list) [USENIX ATC 2025] LITESHIELD: Secure Containers via Lightweight, Composable Userspace μKernel Services [USENIX ATC 2025] DSA-2LM: A CPU-Free Tiered Memory Architecture with Intel DSA [VLDB 2025] mLoRA: Fine-Tuning LoRA Adapters via Highly-Efficient Pipeline Parallelism in Multiple GPUs (to appear) [VLDB 2024] DLRover-RM: Resource Optimization for Deep Recommendation Models Training in the Cloud [OSDI 2024] Nomad: Non-exclusive Memory Tiering via Transactional Page Migration [SOSP 2023] PVM: Efficient Shadow Paging for Deploying Secure Containers in Cloud-native Environment [USENIX ATC 2023] p2Cache: Exploring Tiered Memory for In-Kernel File Systems Caching [IPDPS 2023] mFlow: Accelerating Packet Processing in Container Overlay Networks via Packet-level Parallelism [ICDCS 2022] PRISM: Streamlined Packet Processing for Containers with Flow Prioritization [EuroSys 2021] Parallelizing Packet Processing in Container Overlay Networks [EuroSys 2020] PLASMA: Programmable Elasticity for Stateful Cloud Computing Applications [INFOCOM 2020] SDN-based Order-aware Live Migration of Virtual Machiness [SoCC 2020] BAOVERLAY: A Block-Accessible Overlay File System for Fast and Efficient Container Storage [VEE 2019] Fast and Live Hypervisor Replacement [SoCC 2016] BASS: Improving I/O Performance for Cloud Block Storage via Byte-Addressable Storage Stack [SoCC 2015] vFair: Latency-Aware Fair Storage Scheduling via Per-IO Cost-Based Differentiation [USENIX ATC 2013] vTurbo: Accelerating Virtual Machine I/O Processing Using Designated Turbo-Sliced Core Sponsored Projects National Science Foundation (NSF) User-transparent Data Management for Persistence and Crash-consistency in Non-volatile Memories (2023 - 2027) Rethinking Virtualization in Cloud-Native Systems (2023 - 2028) Salvaging Commodity Operating Systems to Support Emerging Networking Technologies (2019 - 2023) Air Force Research Laboratory (AFRL) Enabling Lightweight, Assured Secure Containers for Container-based Orchestration Platforms (2025 - 2028) Enabling Lightweight Secure Containers with Assured Isolation (2024 - 2025)",
  "content_length": 2987,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:29"
}