{
  "name": "Huijuan Wang",
  "homepage": "https://www.nas.ewi.tudelft.nl/people/Huijuan",
  "status": "success",
  "content": "Huijuan Wang Huijuan Wang Huijuan Wang was born in Harbin, China. She graduated and received her M.Sc. degree (cum laude) in Electrical Engineering at the Delft University of Technology, the Netherlands, the year 2005. She obtained her Ph.D. degree (cum laude) in 2009 at the same faculty. She is currently a tenured assistant professor in the Multimedia Computing Group at Delft University of Technology. She has been a visiting Professor at the group of Prof. H. Eugene Stanley at Boston University since August 2011. Research Interests Multi-level, multi-scale complex networks and dynamic processes such as epidemic spread, opinion interactions and cascading failures Network structure design Bio-inspired Networking: from metabolic networks to neural networks Teaching Perfomance analysis (IN4-341)-5EC Complex Networks: from Nature to Man-made Networks (ET4-389)-4EC Journal Publications Li C., Q. Li, P. Van Mieghem, H. E. Stanley, and H. Wang, \"Correlation between centrality metrics and their application to the opinion model\", to appear in The European Physical Journal B. \"Nonconsensus opinion model on directed networks\", Physical Review E 90, 052811. Qu B., Q. Li, S. Havlin, H. E. Stanley, and H. Wang, 2014, \"Nonconsensus opinion model on directed networks\", Physical Review E 90, 052811. Li D., P. Qin, H. Wang, C. Liu and Y. Jiang, 2014, \"Epidemics on interconnected lattices\", Europhysics Letters 105, 68004. Martin-Hernandez J., H. Wang, P. Van Mieghem and G. D'Agostino, 2014, \"Algebraic Connectivity of Interdependent Networks\", Physica A 44, 92-105. Li C., H. Wang and P. Van Mieghem, 2013, \"Epidemic threshold in directed networks\", Physical Review E 88, 062802. Guo D., S. Trajanovski, R. van de Bovenkamp, H. Wang and P. Van Mieghem, 2013, \"Epidemic threshold and topological structure of susceptible-infectious-susceptible epidemics in adaptive networks\", Physical Review E 88, 042802. Winterbach W., P.F.A. Van Mieghem, M.J.T. Reinders, H. Wang and D. de Ridder, 2013, \"Topology of molecular interaction networks\", BMC Systems Biology 7:90. Wang H., Q. Li, G. D'Agostino, S. Havlin, H. Eugene Stanley and P. Van Mieghem, 2013, \"Effect of the Interconnected Network Structure on the Epidemic Threshold\", Physical Review E 88 (2), 022801. Huang X., S. Shao, H. Wang, S. V. Buldyrev, S. Havlin, H. E. Stanley, \"The robustness of interdependent clustered networks\", EPL, 101, 18002 (2013). Qian L., L. A. Braunstein, H. Wang, J. Shao, H. E. Stanley, S. Havlin, 2013, \"Non-consensus Opinion Models on Complex Networks?\", Journal of Statistical Physics, Volume 151, Issue 1-2, pp 92-112. Trajanovski, S., H. Wang and P. Van Mieghem, 2012, \"Maximum modular graphs?\", The European Physical Journal B, vol. 85, No. 7, July, article 244. de Haan, W., W. M. van der Flier, H. Wang, P. Van Mieghem, P. Scheltens and C. J. Stam, 2012, \"Disruption of functional brain networks in Alzheimer's disease: what can we learn from graph spectral analysis of resting-state MEG?\", Brain Connectivity, Vol. 2, No. 2, pp. 45-55. Winterbach, W., D. de Ridder, H. Wang, M. Reinders and P. Van Mieghem, 2012, \"Do greedy assortativity optimization algorithms produce good results?\", The European Physical Journal B, vol. 85, No. 5, May, article 151. Li, C., H. Wang and P. Van Mieghem, 2012, \"Bounds for the spectral radius of a graph when nodes are removed\", Linear Algebra and its Applications, 437: 319-323. Ge, X. and H. Wang, 2012, \"Community Overlays upon Real-world Complex Networks\", The European Physical Journal B, 85: 26. Li, C., H. Wang, W. de Haan, C. J. Stam, P. Van Mieghem, 2011, \"The Correlation of Metrics in Complex Networks with Applications in Functional Brain Networks\", Journal of Statistical Mechanics: Theory and Experiment (JSTAT), issue November 2011, P11018. Wang, H., W. Winterbach and P. Van Mieghem, 2011, \"Assortativity of Complementary Graphs\", The European Physical Journal B, Vol. 83, No. 2, pp. 203-214. Wang, H., E. van Boven, A. Krishnakumar, M. Hosseini, H. van Hooff, T. Takema, N. Baken and P. Van Mieghem, 2011, \"Multi-weighted Monetary Transaction Network\", Advances in Complex Systems, Vol. 14, No. 5, pp. 691-710. Van Mieghem, P., D. Stevanovic, F. A. Kuipers, C. Li, R. van de Bovenkamp, D. Liu and H. Wang, 2011, \"Decreasing the spectral radius of a graph by link removals\", Physical Review E, Vol. 84, 016101. Winterbach, W., H. Wang, M. Reinders, P. Van Mieghem and D. de Ridder, 2011, \"Metabolic network destruction: Relating topology to robustness\", Nano Communication Networks, Vol. 41, No. 6, pp. 365-72. Van Mieghem, P., X. Ge, P. Schumm, S. Trajanovski and H. Wang, 2010, \"Spectral Graph Analysis of Modularity and Asssortativity\", Physical Review E, Vol. 82, 056113. Stam, C. J., A. Hillebrand, H. Wang,and P. Van Mieghem, 2010, \"Emergence of modular structure in a large-scale brain network with interactions between dynamics and connectivity\", Frontiers in Computational Neuroscience, volume 4, article 133. Wang, H., L. Douw, J. Martin Hernandez, J.C. Reijneveld, C. J. Stam and P. Van Mieghem, 2010, \"Effect of tumor resection on the characteristics of functional brain networks\", Physical Review E 82, 021924. Wang, H., R.E. Kooij and P. Van Mieghem, 2010, \"Graphs with given diameter maximizing the algebraic connectivity\", Linear Algebra and its Applications, 433:1889-1908. Van Mieghem, P., H. Wang, X. Ge, S. Tang and F. A. Kuipers, 2010, \"Influence of Assortativity and Degree-preserving Rewiring on the Spectra of Networks\", The European Physical Journal B, vol. 76, No. 4, pp. 643-652. Wang, H. and P. Van Mieghem, 2010, \"Sampling networks by the union of m shortest path trees\", Computer Networks, Vol. 54, pp. 1042-1053. Liu, D., H. Wang and P. Van Mieghem, 2010, \"Spectral perturbation and reconstructability of complex networks\", Physical Review E, vol. 81, January, p. 016101. Van Mieghem, P. and H. Wang, 2009, \"The Observable Part of a Network\", IEEE/ACM Transaction on Networking, Vol. 17, No. 1, February, pp. 93-105. Wang, H., J. Martin Hernandez and P. Van Mieghem, 2008, \"Betweenness Centrality in Weighted Networks\", Physical Review E, vol. 77, April, p. 046105. Conference Publications Li C., H. Wang and P. Van Mieghem, 2014, \"New lower bounds for the fundamental weight of the principal eigenvector in complex networks\", Third International IEEE Workshop on Complex Networks and their Applications, November 23-27, Marrakesh, Morocco. B. Qu, A. Hanjalic, H. Wang, 2014, \"Heterogeneous Recovery Rates against SIS Epidemics in Directed Networks\", Invited paper, International Conference on Network Games, Control and Optimization, Trento, October 29-31, 2014. T. Ouboter, D. Worm, R. Kooij, and H. Wang, 2014, \"Design of robust dependent networks against flow based cascading failures\", The 6th International Workshop on Reliable Networks Design and Modeling, Barcelona, November 17-19, 2014. Hayel Y., S. Trajanovski, E. Altman, H. Wang and P. Van Mieghem, 2014, \"Complete game-theoretic characterization of SIS epidemics protection strategies\", Proceedings of the 53rd IEEE Conference on Decision and Control (CDC’14), December 15-17, Los Angeles, CA, USA. Winterbach W., P. Van Mieghem, M. J. T. Reinders, H. Wang, and D. de Ridder, 2013, \"Local topological signatures for network-based prediction of biological functio\", Pattern Recognition in Bioinformatics 2013, vol. 7986, Nice, France, Springer, pp. 23-34. Li, C., H. Wang and P. Van Mieghem, 2012, \"Degree and Principal Eigenvectors in Complex Networks\", IFIP Networking 2012, May 21-25, Prague, Czech Republic. Winterbach, W., H. Wang, M. Reinders, P. Van Mieghem and D. de Ridder, 2010, \"Correlating the topology of a metabolic network with its growth capacity\", Bionetics 2010, December 1-3, Boston, USA. Wang, H. and P. Van Mieghem, 2008, \"Algebraic Connectivity Optimization via Link Addition\", Bionetics 2008, November 25-28, Hyogo, Japan. Tang, S, H. Wang and P. Van Mieghem, 2008, \"The Effect of Peer Selection with Hopcount or Delay Constraint on Peer-to-Peer Networking\", IFIP Networking 2008, May 5-9, Singapore. Wang, H. and P. Van Mieghem, 2007, \"Constructing the Overlay Network by Tuning Link Weights\", ChinaCom2007, August 22-24, Shanghai, China. Wang, H. and P. Van Mieghem, 2007, \"Shifting the Link Weights in Networks\", ChinaCom2007, August 22-24, Shanghai, China. Martin Hernandez, J., T. Kleiberg, H. Wang and P. Van Mieghem, 2007, \"A Qualitative Comparison of Power Law Generators\", International Symposium on Performance Evaluation of Computer and Telecommunication Systems (SPECTS 2007), July 16-18, San Diego, California, USA. A. Jamakovic, H. Wang and P. Van Mieghem, 2006, Topological characteristics of the Dutch road infrastructure, Seminar Infrastructure Reliability, Delft, the Netherlands. Kuipers, F. A., H. Wang and P. Van Mieghem, 2005, \"The Stability of Paths in a Dynamic Network\", CoNEXT 2005, October 24-27, Toulouse, France. Technical Reports Wang, H., R. E. Kooij and P. Van Mieghem, 2008, \"Graphs with given diameter maximizing the algebraic connectivity - numerical results\", Delft University of Technology, report20081118. Martin Hernandez, J., T. Kleiberg, H. Wang and P. Van Mieghem, 2006, \"A Qualitative Comparison of Power Law Generators\", Delft University of Technology, report20061115. Wang, H. and P. Van Mieghem, 2006, \"Shifting the Link Weights in Networks\", Delft University of Technology, report20061031. Interviews and Invited talks \"Non-Consensus Opinion Model on Directed Networks\", NetSci 2014, Berkeley, Jun 2-6, 2014. \"Effect of the Interconnected Network Structure on the Epidemic Threshold\", Complexity and Networks Seminar, Imperial College London, March 4, 2014. \"Effect of the Interconnected Network Structure on the Epidemic Threshold\", NetSci 2013, Network of Networks, Copenhagen, June 3-7, 2013. \"The Spreading of Economic Crisis\", Workshop on Econophysics and Networks Across Scales, Lorentz Center, Leiden, May 27 - 31, 2013. \"Effect of the Interconnected Network Structure on the Epidem",
  "content_length": 12185,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:33"
}