{
  "name": "Huining Li",
  "homepage": "https://huining-li.github.io",
  "status": "success",
  "content": "Huining Li Home News Publication Teaching Services Lab Huining Li Assistant Professor Raleigh, NC hli83(AT)ncsu(DOT)edu LinkedIn Google Scholar Huining Li Assistant Professor Raleigh, NC hli83(AT)ncsu(DOT)edu LinkedIn Google Scholar About Me About Me I am an Assistant Professor of Department of Computer Science in the North Carolina State University. I received my Ph.D. degree from the Department of Computer Science and Engineering, University at Buffalo in 2024, under the supervision of Dr. Wenyao Xu. My research interest lies broadly in mobile computing, internet-of-things, and cybersecurity. Especially, my recent focus is on applying research advancement to the field of mobile health (a.k.a, mHealth). My projects have involved developing mHealth systems to assist with chronic wound care, Parkinson’s disease management, and mental health therapy. Within these research projects, I have explored and invented a set of technical innovations such as precise measurement in biomarkers, high accessibility in mHealth service, and fairness in privacy protection. My work has received three Best Paper Awards (SenSys’19, BodyNet’21, and ICHI’22), and one Best Paper Candidate(SenSys’22). I was named among the EECS Rising Stars in 2023, and selected as NIH mHealth Training Institute Scholar in 2025. I am looking for highly motivated Ph.D. students/interns/visiting students to join my lab. News [Service] Huining is invited to serve on a NSF Panel. (2025/04) [Award] Huining is selected as NIH mHealth Training Institute Scholar in 2025. (2025/03) [Event] Three papers are accepted by IEEE/ACM CHASE 2025. Congratulations to Chongxin, Kunning, and Pinxiang! (2025/02) [Event] We are organizing the Third International Workshop on Human-Centered Sensing, Modeling, and Intelligent Systems (HumanSys’25) co-located with CPS-IoT Week 2025. See you in Irvine! (2025/01) [Service] Huining is invited to serve on a NSF Panel. (2024/12) [Event] We are organizing the The 1st Workshop on Sensing and Computing for Smart and Connected Health (SCH'2025) co-located with IEEE/ACM CHASE 2025. See you in New York City! (2024/12) [Service] Huining is invited to serve as TPC for ACM MobiSys 2025. (2024/11) [Event] Huining joined NC State CSC department and will teach CSC 591/791 Mobile Health Systems and Applications in Fall 2024. Welcome to take my course! (2024/08) More News Selected Publications Huining Li, Xiaoye Qian, Ruokai Ma, Chenhan Xu, Zhengxiong Li, Dongmei Li, Feng Lin, Ming-Chun Huang, Wenyao Xu, “TherapyPal: Towards a Privacy-Preserving Companion Diagnostic Tool based on Digital Symptomatic Phenotyping”, ACM International Conference on Mobile Computing and Networking (MobiCom’23), Madrid, Spain, October 2023. [PDF] Huining Li, Huan Chen, Chenhan Xu, Zhengxiong Li, Hanbin Zhang, Xiaoye Qian, Dongmei Li, Ming-Chun Huang, Wenyao Xu, “NeuralGait: Assessing Brain Health using Your Smartphone”, ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT/UbiComp’22), Volume 6, Number 4, December 2022. [PDF] Huining Li, Chenhan Xu, Aditya Singh Rathore, Zhengxiong Li, Hanbin Zhang, Chen Song, Kun Wang, Lu Su, Feng Lin, Kui Ren, Wenyao Xu, “VocalPrint: Exploring A Resilient and Secure Voice Authentication via mmWave Biometric Interrogation”, ACM Conference on Embedded Networked Sensor Systems (SenSys’20), Yokohama, Japan, November 2020. [PDF] All Publications",
  "content_length": 3395,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:31"
}