{
  "name": "Humberto Luiz Razente",
  "homepage": "http://www.facom.ufu.br/~humberto",
  "status": "success",
  "content": "Humberto Razente Associate Professor, Faculdade de Computação, Universidade Federal de Uberlândia Lattes | ORCID | GitHub | Lab | FACOM | PPGCO | UFU Av. João Naves de Ávila, 2121, Bairro Santa Mônica, Sala 1B144, Uberlândia, MG, 38400-902 Phone: +55 34 3239-4496 e-mail: humberto.razente at ufu.br Research interests: database systems, data mining, data science, data structures, algorithms, data visualization, and analytics. Teaching Courses at UFU! Academic Positions Associate Professor, Universidade Federal de Uberlândia, UFU (2018-now) Visiting Professor (CAPES), Arizona State University, ASU (2020) Assistant Professor, Universidade Federal de Uberlândia, UFU (2012-2017) Assistant Professor, Universidade Federal do ABC, UFABC (2010-2012) Posdoc, Universidade Federal do ABC, UFABC (2009) Visiting scholar (FAPESP), University of California at Riverside, UCR (2008) Education D.Sc, ICMC / Universidade de São Paulo, USP (2005-2009), Computer Science and Computational Mathematics, CAPES (2006) and FAPESP (2007-2009) scholarships M.Sc, ICMC / Universidade de São Paulo, USP (2002-2004), Computer Science and Computational Mathematics B.Sc, Universidade Federal de Mato Grosso, UFMT (1995-2000), Computer Science Bachelor Graduate students D.Sc: Fernanda Mendonca Silveira (FAPEMIG, in progress) Frederico Rezende Rosa (CAPES, co-advised with Felipe Louza) (in progress) Ramayane Bonacin Braga (DINTER/IFGoiano, in progress) M.Sc: Cayo Phellipe Ramalho de Oliveira (in progress) Jeovane Aparecido de Oliveira (in progress) Vinicius Guardieiro Sousa (co-advised with Camila Barioni) (in progress) Antonio Livio Mendonça (CAPES, 2025, co-advised with Camila Barioni) Ana Paula Cassiano Alves da Silva (2024) Tiago Rosa Marques Soares (2024, co-advised with Marcelo Nascimento) Frederico Rezende Rosa (2024, co-advised with Felipe Louza) Jéssica Naiara Batista de Farias (2019, co-advised with Camila Barioni) Regis Michel dos Santos Sousa (CAPES, 2017) Rafael Lucas Bernardes Lima (FAPEMIG, 2016) Tutorial Education Program (PET) PET-SI Tutor from July 2022 to July 2025. PET-SI: www, instagram, maps, spotify, #include<girls>, PET-UFU, TechWeek, VemPraUFU BSI-UDI, BSI-MC, BCC. About the program. Personal Information General Co-Chair: Brazilian Symposium on Databases (SBBD'2017 - mirror) Publications at DBLP (*), Lattes, Scopus, Scholar, AcademicTree, ORCID Academic links: research group, Brazilian Computer Society (SBC) Personal: Erdo's number Last update: November 17th, 2025",
  "content_length": 2491,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:38"
}