{
  "name": "Hung M. La",
  "homepage": "https://www.unr.edu/cse/people/la",
  "status": "success",
  "content": "Hung La | Computer Science & Engineering | University of Nevada, Reno Hung (Jim) La Associate Professor Department: Computer Science & Engineering Phone: (775) 682-6862 Email: hla@unr.edu Building: WPEB Room: 305 Mail stop: 0171 Website: Advanced Robotics and Automation Lab website Website: Jim La's Google Scholar page Biography Hung (Jim) La is currently an associate professor in the Department of Computer Science and Engineering at the University of Nevada Reno. He was previously research faculty with the Center for Advanced Infrastructure and Transportation (CAIT) at Rutgers University from 2012 to 2014. He also worked as a postdoctoral researcher in robotics and control systems at Rutgers University from 2011 to 2012. Prior to working at CAIT he was a lecturer in the Department of Electrical Engineering at the Thai Nguyen University of Technology, Vietnam from 2001 to 2007. La received the doctoral degree in electrical and computer engineering from Oklahoma State University in 2011. La was the recipient of an NSF CAREER award and some best conference paper awards. He was a key member of the CAIT team that developed the Robotics Assisted Bridge Inspection Tool (RABITTM) for the Federal Highway Administration (FHWA). Dr. La and his team received the prestigious Charles Pankow Award for Innovation for the RABITTM, from the American Society of Civil Engineers (ASCE) in 2014. Dr. La is a Senior Member of the Institute of Electrical and Electronics Engineers (IEEE). Dr. La is currently an Associate Editor of the IEEE Transactions on Human-Machine Systems, and Editorial Board Member of the International Journal of Automation and Control, and Guest Editor of the International Journal of Robust and Nonlinear Control. Education Ph.D., Electrical and Computer Engineering, Oklahoma State University, 2011 M.S., Electrical and Computer Engineering, Thai Nguyen University of Technology, Vietnam, 2003 B.S., Electrical Engineering, Thai Nguyen University of Technology, Vietnam, 2001",
  "content_length": 2004,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:35"
}