{
  "name": "Hung Viet Pham",
  "homepage": "https://hvpham.github.io",
  "status": "success",
  "content": "Hung Viet Pham - Hung Viet Pham Hung Viet PhamAssistant Professor at York University, interested in Software Engineering and Machine Learning Follow Toronto, Canada Email Bitbucket Github Google ScholarI am an Assistant Professor at the Department of Electrical Engineering and Computer Science at York University. My work applies software engineering testing techniques to ensure the reliability of machine learning and deep learning systems. My research interests include software testing, program repair, software engineering, and machine learning.PublicationsTOSEM-24 - Journal History-Driven Fuzzing For Deep Learning Libraries Nima Shiri Harzevili, Mohammad Mahdi Mohajer, Moshi Wei, Hung Viet Pham, and Song WangAIware-24 Effectiveness of ChatGPT for Static Analysis: How Far Are We? Mohammad Mahdi Mohajer, Reem Aleithan, Nima Shiri harzevili, Moshi Wei, Alvine Boaye Belle, Hung Viet Pham, and Song WangMSR-24 - Mining Challenge Can ChatGPT Support Developers? An Empirical Evaluation of Large Language Models for Code Generation Kailun Jin, Chung-Yu Wang, Hung Viet Pham, Hadi HemmatiISSTA-23 How Effective are Neural Networks for Fixing Security Vulnerabilities? Yi Wu, Nan Jiang, Hung Viet Pham, Thibaud Lutellier, Jordan Davis, Lin Tan, Petr Babkin, and Sameena ShahAAAI-23 DisGUIDE: Disagreement-Guided Data-Free Model Extraction_ Jonathan Rosenthal, Eric Enouen, Hung Viet Pham, and Lin TanISSTA-22 DocTer: Documentation-Guided Fuzzing for Testing Deep Learning API Functions Danning Xie, Yitong Li, Mijung Kim, Hung Viet Pham, Lin Tan, Xiangyu Zhang, Mike GodfreyICSE-22 EAGLE: Creating Equivalent Graphs to Test Deep Learning Libraries Jiannan Wang, Thibaud Lutellier, Shangshu Qian, Hung Viet Pham, and Lin TanNeurIPS-21 Are My Deep Learning Systems Fair? An Empirical Study of Fixed-Seed Training Shangshu Qian, Hung Viet Pham, Thibaud Lutellier, Zeou Hu, Jungwon Kim, Lin Tan, Yaoliang Yu, Jiahao Chen, and Sameena ShahETR&D-21(Jornal) Designing for robot-mediated interaction among culturally and linguistically diverse children Yanghee Kim, Sherry Marx, Hung Viet Pham, Tung T. NguyenASE-21(Tool) DEVIATE: A Deep Learning Variance Testing Framework Hung Viet Pham, Mijung Kim, Lin Tan, Yaoliang Yu, and Nachiappan NagappanASE-20 Problems and opportunities in training deep learning software systems: an analysis of variance Hung Viet Pham, Shangshu Qian, Jiannan Wang, Thibaud Lutellier, Jonathan Rosenthal, Lin Tan, Yaoliang Yu, Nachiappan NagappanISSTA-20 CoCoNuT: combining context-aware neural translation models using ensemble for program repair Thibaud Lutellier, Hung Viet Pham, Lawrence Pang, Yitong Li, Moshi Wei, Lin TanICSE-19 CRADLE: Cross-Backend Validation to Detect and Localize Bugs in Deep Learning Libraries Hung Viet Pham, Thibaud Lutellier, Weizhen Qi, Lin TanICSE-18 (NIER) Deep Learning UI Design Patterns of Mobile Apps Tam The Nguyen, Phong Minh Vu, Hung Viet Pham, Tung Thanh NguyenICSE-18 (Poster) Recommending Exception Handling Patterns with ExAssist Tam The Nguyen, Phong Minh Vu, Hung Viet Pham, Tung Thanh NguyenICSE-18 (Poster) Alpaca-advanced linguistic pattern and concept analysis framework for software engineering corpora Phong Minh Vu, Tam The Nguyen, Hung Viet Pham, Tung Thanh NguyenNL4SE-18 Improving the quality of Clone Detection with Conceptual Similarity of Source code Hung Viet Pham, Tam The Nguyen, Phong Minh Vu, Tung Thanh NguyenICSE-16 Learning API usages from bytecode: a statistical approach Tam The Nguyen, Hung Viet Pham, Phong Minh Vu, Tung Thanh NguyenASE-15 Mining user opinions in mobile app reviews: A keyword-based approach Phong Minh Vu, Tam The Nguyen, Hung Viet Pham, Tung Thanh NguyenASE-15 (Demo) Tool support for analyzing mobile app reviews Phong Minh Vu, Hung Viet Pham, Tam The Nguyen, Tung Thanh NguyenASE-15(Demo) Recommending API usages for mobile apps with hidden markov model Tam The Nguyen, Hung Viet Pham, Phong Minh Vu, Tung Thanh NguyenKSE-15 Discriminative Prediction of Enhancers with Word Combinations as Features Hung Viet Pham , Tu Minh PhuongResearch experienceResearch Assistant at University of Waterloo, Waterloo, Canada (2018 - 2022)Develop testing techniques for deep learning librariesResearch Assistant at Utah State University, Logan, UT, USA (2014 - 2017)Develop defect prediction techniques and source code embeddingsTeaching experienceTeaching Assistant, Instructional Apprentice at University of Waterloo, Waterloo, Canada (2018 - 2022)CS115: Introduction to Computer Science 1 (Winter 2018, Fall 2018, Fall 2019)CS135: Designing Functional Programs (Fall 2020)CS245: Logic and Computation (Spring 2018)CS251: Computer Organization and Design (Winter 2019, Spring 2019)Teaching Assistant at Utah State Univeristy, Logan, UT, USA (2014 - 2017)CS 5050: Advanced Algorithms (Fall 2016)Lecturer at Postal and Telecommunication Institute of Technology, Hanoi, Vietnam (2011 - 2014)Teach Introduction to AI and Image Processing coursesIndustry experienceResearch Intern at Microsoft Research, Redmond, WA, US (2021)Develop techniques to improve deep learning modelsWeb app developer at Sonic Viet, Hanoi, Vietnam (2011 - 2014)Lead a team of 8 developers, Architecure DesignJava developer at Calypso Technology, Brighton, UK (2009 - 2011)Work as a Java developer in a team working on products that optimize investment portfolios using generic algorithmsEducationPh.D in Software Engineering, University of Waterloo, Canada, (2018 - 2022)M.S. in Evolutionary and Adaptive System (EASy), University of Sussex, UK, (2008 - 2009)B.S. in Computing, Imperial College, UK, (2004 - 2007)",
  "content_length": 5591,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:35"
}