{
  "name": "Huong Ha 0001",
  "homepage": "https://www.rmit.edu.au/contact/staff-contacts/academic-staff/h/ha-dr-huong",
  "status": "success",
  "content": "Huong Ha - RMIT University Huong Ha SKIP TO CONTENT Search field Search Search RMIT Australia RMIT Europe RMIT Global RMIT Vietnam RMIT UP RMIT Online Students Alumni Staff Library RMIT Online Courses Courses by study area Undergraduate courses Postgraduate courses Vocational studies Pre-university studies Online courses and degrees Entry pathways Single courses Short courses and microcredentials Courses for international students Contact Study@RMIT Study with us How to apply Fees Scholarships School leaver information Student services Student experience Key dates Frequently asked questions Parents Career advisers Contact Study@RMIT Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Contact Study@RMIT About News Events Maps Careers Contact us Our strategy Governance & management Schools & colleges Respect for Australian Indigenous cultures Our locations and facilities Our heritage Regenerative Futures Research Our research Partnerships Impact Contact Centres and collaborations Research degrees Find researchers Partner Recruit students and graduates Workforce development Collaborate with RMIT Research partnerships Facilities, equipment and services Contact Industry Engagement Giving to RMIT International Study in Australia Apply to RMIT as an international student Courses for international students Contact Study@RMIT Fees and scholarships for international students International student services Key dates and intake information for international students Frequently asked questions Huong Ha Dr. Huong Ha Senior Lecturer See full profile Details College: School of Computing Technologies Department: School of Computing Technologies Campus: City Campus Australia huong.ha@rmit.edu.au ORCID: 0000-0003-2463-7770 Open to Masters Research or PhD student supervision About Dr. Huong Ha is a Senior Lecturer in Computer Science at the School of Computing Technologies. Her research interests include trustworthy machine learning, automated machine learning, and data-driven software engineering. Expand for full bio Collapse bio Non-academic positions Data Scientist Freelancer International Pty Limited Sydney, Australia 2017 – 2018 Supervisor projects Language Driven on Controlling Robot Trained with Synthetic Data 29 Apr 2025 Machine Learning methods for Fraud Detection on Blockchain networks 2 Apr 2025 Explainable AI in Human-Agent Planning 2 Sep 2024 An Improvement in Intelligent Incident Management for Software-Intensive Systems with Large Language Models 26 Feb 2024 Bayesian Optimisation 13 Dec 2023 Performance Prediction and Optimization for Highly Configurable Software Systems 14 Nov 2023 High-dimensional Bayesian Optimization via Evolutionary Computation 26 Sep 2022 Acknowledgement of Country RMIT University acknowledges the people of the Woi wurrung and Boon wurrung language groups of the eastern Kulin Nation on whose unceded lands we conduct the business of the University. RMIT University respectfully acknowledges their Ancestors and Elders, past and present. RMIT also acknowledges the Traditional Custodians and their Ancestors of the lands and waters across Australia where we conduct our business - Artwork 'Sentient' by Hollie Johnson, Gunaikurnai and Monero Ngarigo. More information News Events Library Maps Careers Contacts Study with Us Levels of study Online courses and degrees Single courses Applying to RMIT International students Parents Careers advisers Life at RMIT Study experience Student life Support for students Global opportunities Industry connections Research Our research Centres and collaborations Partnerships Research degrees Find researchers Research contacts Partner Workforce development Staff development and training Research partnerships Facilities and equipment services Giving About Our strategy Governance and management Values Sustainability Schools and colleges Our locations and facilities Copyright © 2025 RMIT University | Terms | Privacy | Accessibility | Website feedback | Complaints | ABN 49 781 030 034 | CRICOS provider number: 00122A | TEQSA provider number: PRV12145 | RTO Code: 3046 | Open Universities Australia | RMIT Training Pty Ltd, trading as RMIT University Pathways (RMIT UP), CRICOS Provider Code: 01912G",
  "content_length": 4264,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:38"
}