{
  "name": "Huosheng Hu",
  "homepage": "https://www.essex.ac.uk/people/huhuo40009/huosheng-hu",
  "status": "success",
  "content": "Huosheng Hu | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Huosheng Hu People Prof Huosheng Hu Emeritus Professor School of Computer Science and Electronic Engineering (CSEE) Email hhu@essex.ac.uk Location 1NW.3.11, Colchester Campus Academic support hours 1:00pm on Thursday and Friday https://essex-university.zoom.us/j/93373463933; Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Member of the Robotics Group (See also:staff research interests by category) Qualifications MSc in Industrial Automation, Central South University, China PhD in Robotics, University of Oxford, United Kingdom Appointments University of Essex Professor, Computer Science & Electronic Engineering, University of Essex (1/11/1998 - present) Other academic Lecturer, Cybernetics, University of Reading (1/11/1997 - 31/10/1998) Robotics Researcher, Engineering Science, University of Oxford (1/10/1988 - 31/10/1997) Research and professional activities Research interests Intelligent Systems and Autonomous Mobile Robots Open to supervise Networked robots and network enable systems/devices Open to supervise Smart sensors, actuators and Mechatronics Open to supervise Sensor integration and Data fusion algorithms Open to supervise Tele-rehabilitation, tele-care, tele-health, Intelligent wheelchairs Open to supervise Genetic Algorithms, Fuzzy Logic and Neural Networks in Robotics Open to supervise Pervasive computing, mobile computing, eLearning Open to supervise Distributed computer architecture and Parallel processing Open to supervise AI and Robotics Key words: Artificial Intelligence Open to supervise Teaching and supervision Previous supervision Aakash Dipakkumar Soni Thesis title: Formation Control of Autonomous Vehicles with Emotion Assessment Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 14/4/2023 Zuyuan Zhu Thesis title: Robot Learning Assembly Tasks From Human Demonstrations Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 21/12/2020 Dingtian Yan Thesis title: Robotic Cameraman for Augmented Reality Based Broadcast and Demonstration Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 24/4/2020 Qiang Liu Thesis title: Using 3D Visual Data to Build a Semantic Map for Autonomous Localization Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 18/1/2019 Richard James Clapham Thesis title: Developing High Performance Linear Carangiform Swimming Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 6/5/2016 Sen Wang Thesis title: Optimal State Estimation Based Robot Localisation in Gps-Denied 3D Space Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 26/8/2015 Hossein Farid Ghassem Nia Thesis title: Applying Machine Learning Techniques to Optical Counting Machine for Precise Counting Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 3/7/2015 Ruijiao Li Thesis title: Ros-Based Navigation and Interaction for an Intelligent Wheelchair Degree subject: Computer Science Degree type: Master of Science (by Dissertation) Awarded date: 12/3/2015 Ericka Janet Rechy-Ramirez Thesis title: Head Movements and Facial Expressions Based Human Machine Interface for an Intelligent Wheelchair. Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 23/2/2015 Ling Chen Thesis title: Localisation and Mapping of an Autonomous Underwater Vehicle with Mechanical Scanning Sonar Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 5/12/2014 James Astley Robert Cannan Thesis title: Adaptive and Wearable Forearm Emg for Interacting with Different Users and Tasks Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 27/2/2014 John Oluwagbemiga Oyekan Thesis title: Visualisation of Invisible Substances Using Unicellular Swarm Intelligence Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 22/2/2012 Publications Journal articles (328) Chen, G., Wu, W., Yang, C. and Hu, H., Dynamics Analysis of Discrete-time Sliding Mode Controller for the Nonlinear Systems. IEEE Transactions on Circuits and Systems, Part 2: Express Briefs Chen, Z., Du, D., Fei, M., Zhou, Z., Deng, J. and Hu, H., (2026). A Novel HSTF-PN Based Interconnection Model for Integration of 5G and Time-Sensitive Networking. IEEE Transactions on Network Science and Engineering. 13, 668-683 Chen, G., Xue, H., Zhao, Z., Lu, Y., Cao, G., Yang, C., Hu, H., Wu, C., Zeng, J., Weng, L. and Yang, P., (2026). Posture stability control of a beaver-like bipedal robot based on the deep interactive twin delayed deep deterministic policy gradient algorithm. Engineering Applications of Artificial Intelligence. 163, 112781-112781 Qiao, S., Tang, C., Hu, H., Wang, W., Tong, A. and Ren, F., (2025). Cross-view identification based on gait bioinformation using a dynamic densely connected spatial-temporal feature decoupling network. Biomedical Signal Processing and Control. 104, 107494-107494 Chen, G., Xu, Y., Yang, C., Yang, X., Hu, H., Dong, F., Zhang, J. and Shi, J., (2025). Dynamic modeling and experimental analysis of a novel bionic mantis shrimp robot. Journal of Field Robotics. 42 (2), 493-509 Chen, Y., Wang, J., Zhou, Q. and Hu, H., (2025). ArbiTrack: A Novel Multi-Object Tracking Framework for a moving UAV to Detect and Track Arbitrarily Oriented Targets. IEEE Transactions on Multimedia. 27, 5387-5397 Chen, Y., Xie, S., Wu, Y. and Hu, H., (2025). A novel monocular object detection and localization framework based on inverted multi-scale attention. Engineering Research Express. 7 (1), 015264-015264 Zhong, X., Luo, J., Zhong, X., Hu, H. and Liu, Q., (2025). SS-ARGNet: A Novel Cascaded Schema for Robots’ 7-DoF Grasping in Adjacent and Stacked Object Scenarios. IEEE Transactions on Instrumentation and Measurement. 74, 1-12 Chen, G., Liu, Z., Zhang, C., Zeng, J., Wu, C., Hu, H. and Tang, S., (2025). Novel liquid–gas phase change soft actuator for high efficiency drive and its underwater application. Smart Materials and Structures. 34 (3), 035036-035036 Wu, L., An, Y., Qin, P. and Hu, H-S., (2025). Prediction of significant wave height based on feature decomposition and enhancement. Expert Systems with Applications. 277, 127255-127255 Chen, G., Du, G., Yang, C., Xu, Y., Wu, C., Hu, H., Dong, F. and Zeng, J., (2025). An underwater visual SLAM system with adaptive image enhancement. Ocean Engineering. 326, 120896-120896 Chen, G., Xu, Y., Wang, Z., Hu, H. and Wu, C., (2025). Motion stability analysis of beaver-like robot. Proceedings of the Institution of Mechanical Engineers, Part M: Journal of Engineering for the Maritime Environment. 239 (4), 959-972 Chen, G., Wu, W., Yang, C., Hu, H., Zhang, J., Shi, J., Wu, C. and Ma, Y., (2025). Practical Finite-Time Observer-Based Adaptive Backstepping Super-Twisting Sliding Mode Control for Deep-Sea Hydraulic Manipulator. IEEE Transactions on Industrial Electronics. 72 (9), 1-11 Zhong, X., Zhou, Q., Sun, Y., Kang, S. and Hu, H., (2025). Deep Reinforcement Learning-Based Uncalibrated Visual Servoing Control of Manipulators with FOV Constraints. Applied Sciences. 15 (8), 4447-4447 Zhao, X., Tang, C., Hu, H., Wang, W., Qiao, S. and Tong, A., (2025). Attention mechanism based multimodal feature fusion network for human action recognition. Journal of Visual Communication and Image Representation. 110, 104459-104459 Gong, W., Li, W., Hu, H., Song, Z., Zeng, Z., Sun, J. and Song, Y., (2025). Creating a Novel Attention-Enhanced Framework for Video-Based Action Quality Assessment. Sci. 7 (2), 54-54 Chen, G., Wu, W., Yang, C., Hu, H., Zeng, J. and Wu, C., (2025). ESO-Based Adaptive Backstepping Sliding Mode Control of a Multi-DoF Deep-Sea Hydraulic Manipulator. IEEE Transactions on Instrumentation and Measurement. 74, 1-12 Xu, Y., Chen, G., Wu, C., Liu, Z., Huang, W., Hu, H. and Wu, Z., (2025). Design and depth control of bionic mantis shrimp underwater robot with miniaturized low-cost sinking and floating system. Ocean Engineering. 337, 121855-121855 Shang, H., Chi, X., Li, R., Zhao, X. and Hu, H., (2025). Obstacle-Aware and High-Reach Path Planning for Robotic Manipulators in Complex Factory Farming Environments. IEEE Transactions on Industrial Informatics. 21 (10), 7733-7741 Xu, Z., Zhong, X., Wang, N., Hu, H. and Liu, Q., (2025). VG-Fusion: A Novel Visual Geo-Localization Fused with IMU and LiDAR-Inertial Odometry for UAVs in GNSS-Denied Environments. Unmanned Systems, 1-17 Chen, Y., Xie, S., Li, Q. and Hu, H., (2025). Efficient object detection with dynamic task-aligned feature pyramids for resource-limited mobile devices. Journal of Real-Time Image Processing. 22 (4) Xu, Y., Chen, G., Yang, C., Wu, C. and Hu, H., (",
  "content_length": 108663,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:38"
}