{
  "name": "Hussein Sibai",
  "homepage": "https://engineering.washu.edu/faculty/Hussein-Sibai.html",
  "status": "success",
  "content": "Hussein Sibai | WashU McKelvey School of Engineering Education PhD, University of Illinois, Urbana-Champaign, 2021MS, University of Illinois, Urbana-Champaign, 2017BE, American University of Beirut, 2014 Research areas Cyberphysical Systems & Internet of Things Machine Learning & Artificial Intelligence Theoretical Computer Science Expertise Develops trustworthy autonomous systems Research Hussein Sibai’s research is on trustworthy autonomy, spanning the areas of cyberphysical systems (CPS), formal methods, control theory and machine learning. He develops theory and builds tools to efficiently design, evaluate and deploy assured autonomous systems. His results were published in leading control and formal verification venues such as HSCC, ATVA, TACAS, and CAV.  He designed symmetry-exploiting algorithms that enabled orders of magnitude speedup in formally verifying the safety of complex CPS with machine-learned components, found optimal bit rates for state estimation and control, and evaluated the robustness of perception modules of autonomous systems. Biography Sibai joined the McKelvey School of Engineering faculty Jan. 1, 2023, from the University of California, Berkeley, where he was a postdoctoral scholar in the electrical engineering and computer sciences department. He obtained his PhD in electrical and computer engineering from the University of Illinois Urbana-Champaign (UIUC) in 2021. He received his master's degree in electrical and computer engineering from UIUC in 2017 and a bachelor's degree in Computer and Communication Engineering from American University of Beirut. Sibai has won the best poster award in HSCC 2018 and best paper nominations at HSCC 2017 and ATVA 2019. His work has been recognized by the Rambus fellowship, the Ernest A. Reid fellowship, the MAVIS Future Faculty fellowship and the ACM SIGBED gold medal for the graduate category in the student research competition in CPS Week 21.",
  "content_length": 1941,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:39"
}