{
  "name": "Huy Hieu Pham 0001",
  "homepage": "https://huyhieupham.github.io",
  "status": "success",
  "content": "Hieu Pham Hieu Pham I am currently an Assistant Professor of Computer Science at VinUniversity, where I work on Computer Vision, Machine Learning, Artificial Intelligence (AI), and Smart Health Applications. I received my Ph.D. degree in Computer Science at the Toulouse Computer Science Research Institute (IRIT) at The University of Toulouse, France, in 2019. In 2023, I became a Visiting Scholar at the Coordinated Science Laboratory at the University of Illinois Urbana-Champaign (UIUC), USA. From 2022, I has been serving as the Associate Director of the VinUni-Illinois Smart Health Center (VISHC), that aims to conduct high-impact research on biomedical AI to provide widely accessible health monitoring and improvement for people all over the world. I spent two years as a Research Scientist at Vingroup Big Data Institute, conducting research on Medical Imaging Analysis. In 2015, I spent half a year at the ICA laboratory for working on a robotized airplane inspection project, called Air-Cobot, lead by AKKA Technologies and AIRBUS group. Before that, I did my bachelor's at the Hanoi University of Science and Technology (HUST). My graduate internship was done at International Research Institute MICA, Hanoi, Vietnam and AGIM laboratory, Université Grenoble Alpes, Grenoble, France. Ph.D. Thesis  / CV  / Google Scholar  / GitHub  / LinkedIn Research Interests My research interests include Artificial Intelligence (AI), Machine Learning, Deep Learning, and Computer Vision, especially their applications in Smart Healthcare, e.g. Medical Imaging Diagnosis, AI-based Computer-aided Diagnosis (AI-CAD), AI-assisted Diagnosis and Treatment, AI-assisted Disease Prevention and Risk Monitoring. Check my latest publications here. I am looking for self-motivated Postdocs, Ph.D. students, Research Assistants and Interns, who are interested in artificial intelligence for smart healthcare, computer vision, machine/deep learning, and natural language processing. If you are interested in doing research with us, please fill out the form. If you are a VinUni student and interested in conducting research, you can reach me via email or meet me in-person at VISHC Office, G Building, VinUni Campus for further discussion. Remote collaboration is also welcome! News ●   [Mar. 2025]   I serve as a reviewer for Nature Biomedical Engineering (Journal Impact Factor: ~30.0). Learn more about the journal here. ●   [Mar. 2025]   I became a CIC Asia Faculty Fellow at the Institute for People and Technology, Georgia Institute of Technology. Learn more about CIC. ●   [Mar. 2025]   I am honored to be named as The Outstanding Young Vietnamese Face 2024 in the field of Science and Technology. See more here. ●   [Mar. 2025]   I am honored to be named one of the 10 Outstanding Young Faces of the Hanoi Capital in 2024. See more here. ●   [Jan. 2025]   I will be an invited speaker at MICCAI 2025 held in Daejeon, Republic of Korea in September 2025. ●   [Jan. 2025]   A new paper has been accepted to the ICLR 2025 conference (rank A star). ●   [Jan. 2025]   I received the \"Rising Star in Research\" award from VinUniversity. ●   [Jan. 2025]   Our international research team from VinUniversity and Cornell University (Ivy League) is offering two (02) PhD positions focusing on human-centered healthcare design for low-cost, smart health applications for common disease screening in low- and middle-income countries. See details here. ●   [Jan. 2025]   Four (04) papers accepted by the 2025 IEEE International Symposium on Biomedical Imaging (rank A). Our team will present these study results in Texas, USA, from April 14–17, 2025! ●   [Dec. 2024]   Our research team (VinUni + EPFL) received funding from the Vietnamese-Swiss Joint Research Programme (NAFOSTED – SNSF) to develop the next generation of explainable vision-language foundation models for medical imaging. ●   [Nov. 2024]   I am honored to be awarded The Royal Academy of Engineering’s Leaders in Innovation Fellowships (LIF Global 2025). ●   [Nov. 2024]   I am honored to be recognized as an Outstanding Faculty Member in Research at the College of Engineering and Computer Science, VinUniversity. ●   [Oct. 2024]   New papers have been accepted at IEEE WACV, IEEE Big Data, Brain Informatics 2024, IEEE BIBM 2024, and Digital Health. Congratulations to all authors. Learn more about our lastest publications here. ●   [Sep. 2024]   My comments on the Vietnamese innovation ecosystem are available in Tạp chí Tia Sáng. ●   [Sep. 2024]   We are hiring a CTO for Align Health. Full job description can be found here. ●   [Sep. 2024]   I have joined as a member of the VinUni Research Affairs Committee. ●   [Aug. 2024]   VinUni-Illinois Pre-PhD Summer School 2024 started. ●   [Aug. 2024]   I founded and directed The Computer Vision and Medical AI Lab (CVMAIL) at VinUniversity. ●   [June 2024]   We are looking for multiple PhD and Postdoc candidates to work on AI-based Precision Pathology at VinUniversity (Vietnam) and UIUC (USA). ●   [June 2024]   I serve as Area Chair for the 17th Asian Conference on Computer Vision (ACCV), 2024! ●   [June 2024]   A new paper has been early accepted for presentation at the 27th Medical Image Computing and Computer-Assisted Intervention (MICCAI2024). Congratulations to Nguyen Van Phi! ●   [June 2024]   Looking for a Postdoctoral Research Associate position (a UIUC full-time appointment) working in Professor Minh Do's group. This is an interdisciplinary research position on AI for Medical Imaging (Medical AI) in collaboration with multiple groups at UIUC and Mayo Clinic. This is on a twelve-month service basis with an annual salary of $70,000. Email to me (hieu.ph@vinuni.edu.vn) if you are interested. ●   [May 2024] A new paper has been accepted for publication in the IEEE Journal of Biomedical and Health Informatics (J-BHI). Congratulations to our undergraduate students Nguyen Viet Duong and Nguyen Xuan Hieu! ●   [Mar. 2024]   We received three (03) external research grants (~143K USD in total) aimed at pioneering innovative smart health solutions and fostering a durable collaboration between VinUniversity (VN) and counterparts at KU Leuven University (Belgium) and Cardiff University (UK). See more here. ●   [Mar. 2024]   I started serving as an Editorial Board Member for Scientific Data Journal (Nature). ●   [Jan. 2024]   I am honored to receive the Faculty of the Year Award (VinUniversity 2023). ●   [Dec. 2023]   We won the Best Paper Award at The Eleventh International Symposium on Computing and Networking (CANDAR 2023). ●   [May 2023]   We open the Call for PhD Applications at VinUni and UIUC. ●   [Oct. 2023]   I have been selected to serve as the Scientific Director of the Entrepreneurship Lab (E-lab) at VinUniversity. ●   [Sep. 2023]   I won the National Outstanding Young Scientist Award (Golden Globe) in Science and Technology, Vietnam. ●   [Sep. 2023]   I received The College's Award for Exceptional Performance in Research AY 2022-2023. ●   [Aug. 2023]   One paper was accepted by IEEE Transactions on Network and Service Management (IF 5.3). ●   [Aug. 2023]   One paper was accepted by Frontiers in Cardiovascular Medicine (IF 3.6). ●   [Aug. 2023]   One paper was accepted by PLOS ONE (IF 3.7). ●   [July 2023]   I was appointed by the National Academies of Sciences, Engineering, and Medicine (NASEM) to serve as a member of the Workshop Committee for Engaging Scientists in Shared Responsible Innovation in Neuroscience in Southeast Asia. ●   [July 2023]   We have been awarded an International Grant from the Cognitive Science Society for the project “Launching Cognitive Science in Vietnam”, led by Professor K. David Harrison, PhD, VinUni's Vice Provost of Academic Affairs. ●   [May 2023]   Our international research team (VinUniversity-VN, L'Université Grenoble Alpes-FR and National Institute of Communications-BR) wins €0.5 million funding from the MIAI Grenoble Alpes Institute (France) to develop \"Smart Life Smart Living Intercontinental. AI by and for People\". ●   [May 2023]   Our paper titled \"CADIS: Handling Cluster-skewed Non-IID Data in Federated Learning with Clustered Aggregation and Knowledge DIStilled Regularization\" won the Best Paper Award (ML Track) at The 23rd IEEE/ACM international Symposium on Cluster, Cloud and Internet Computing (CCGrid 2023). ●   [May 2023]   We run our AI in Medicine Seminar. ●   [Mar. 2023]   Two papers got accepted for publication in Nature Scienfic Data (IF 11.211). Check out preprints here and here. ●   [Mar. 2023]   I have joined Coordinated Science Laboratory, UIUC as a Visiting Scholar, working on AI in Medicine with my Advisor, Prof. Minh Do. ●   [Jan. 2023]   Our VinUni-UIUC research team (with Stephen Boppart, Mark A Anastasio, Marina Marjanovic, Mai Tran, Nhung Nguyen, and Wray Buntine) got $260K funding from VISHC Research Funding Program to work on the Evaluation of the Effect of Antiviral Drugs using Polarized Light Imaging. We are looking for 5 PhDs and 1 Postdoc to join us. See more here. ●   [Jan. 2023]   Three papers got accepted (2xQ1 Journals and 1-rank A conference). Congratulations to all authors and co-authors! ●   [Nov. 2022] In the last three months, 10 research articles got accepted or provisionally accepted for publication at top journals and conferences in AI and Medicine, including PLOS One, Computers in Biology and Medicine, ACCV, and ICPP. A complete list of publications is available here. Congratulations to all authors and co-authors. ●   [Oct. 2022] Got promoted to Assistant Professor in Computer Science at the College of Engineering & Computer Science, VinUniversity. ●   [Sep. 2022] We win AI Awards 2022. ●   [Sep. 2022] Take a short-term visit to the German Center for Neurodegenerative Diseases (DZNE), Bonn, and the German Research Center for Artificial Intelligence (DFKI), in order to explore new space for collaboration with Prof. Martin Reuter (Head of Image Analysis, DZNE; Assistant Professor of Radiology, Harvard Medical ",
  "content_length": 22393,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:40"
}