{
  "name": "Hwee Tou Ng",
  "homepage": "https://www.comp.nus.edu.sg/~nght",
  "status": "success",
  "content": "Home Page Home Page of Professor NG Hwee Tou Affiliation Provost's Chair Professor Department of Computer Science School of Computing National University of Singapore 13 Computing Drive Singapore 117417 Tel: (65) 6516 8951 Fax: (65) 6779 4580 Email: nght@comp.nus.edu.sg Home Page: http://www.comp.nus.edu.sg/~nght Office: COM3 02-48 Education Ph.D. in Computer Science, 1992 University of Texas at Austin, U.S.A. M.S. in Computer Science, 1987 Stanford University, U.S.A. B.Sc. in Computer Science for Data Management (High Distinction), 1985 University of Toronto, Canada Bio Professor Hwee Tou NG is Provost's Chair Professor of Computer Science at the National University of Singapore (NUS). He received a PhD in Computer Science from the University of Texas at Austin, USA. His research focuses on natural language processing. He is a Fellow of the Association for Computational Linguistics (ACL). He has published papers in premier journals and conferences, including Computational Linguistics, Journal of Artificial Intelligence Research (JAIR), ACM Transactions on Information Systems (TOIS), ACL, NAACL, EMNLP, SIGIR, AAAI, and IJCAI. His papers received the Best Paper Award at EMNLP 2011 and SIGIR 1997. He is an associate editor of Journal of Artificial Intelligence Research (JAIR) and an action editor of ACL Rolling Review. He served as the editor-in-chief of Computational Linguistics (July 2018 - January 2024) and ACM Transactions on Asian Language Information Processing (TALIP) (May 2007 - May 2013). He also served as an editorial board member of Computational Linguistics and Journal of Artificial Intelligence Research (JAIR), the book review editor of Computational Linguistics, and an action editor of the Transactions of the Association for Computational Linguistics (TACL). He was an elected member of the ACL executive committee and a former secretary of ACL SIGNLL. He was a program co-chair of EMNLP 2008, ACL 2005, and CoNLL 2004 conferences, and has served as an area chair of ACL, NAACL, EACL, EMNLP, SIGIR, AAAI, and IJCAI conferences and as a session chair and program committee member of many past conferences including ACL, EMNLP, SIGIR, AAAI, and IJCAI. Research Area Natural Language Processing Open Positions ✷ I have open positions in my group for research fellows (postdocs) and research assistants to work on natural language processing. If you are interested, please email me your CV. Google Scholar NUS Natural Language Processing Group Awards Participation in Benchmarking Evaluations Invited Talks Selected Professional Services",
  "content_length": 2575,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:46"
}