{
  "name": "Hyeoncheol Kim",
  "homepage": "https://pure.korea.ac.kr/en/persons/hyeoncheol-kim",
  "status": "success",
  "content": "Hyeoncheol Kim - Korea University Pure View Scopus Profile Hyeoncheol Kim Professor Department of Computer Science and EngineeringHuman-inspired AI Computing Research Center Emailharrykimkorea.ackr h-index 1304 Citations 18 h-index Calculated based on number of publications stored in Pure and citations from Scopus 2000 …2026 Research activity per year Fingerprint Dive into the research topics where Hyeoncheol Kim is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Knowledge Tracing Keyphrases 100% Learning System Computer Science 83% Large Language Models Keyphrases 74% Site Analysis Keyphrases 66% Deep Learning Method Computer Science 63% Large Language Model Computer Science 61% Experimental Result Computer Science 56% Rule Extraction Keyphrases 56% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2000 2005 2021 2022 2023 2024 2026 2026 52 Article 37 Conference contribution 2 Comment/debate 2 Conference article 4 More 1 Chapter 1 Editorial 1 Letter 1 Review article Research output per year Research output per year A Comprehensive Survey and Taxonomy on Large Language Model-Based Knowledge TracingPark, S. & Kim, H., 2026, Generative Systems and Intelligent Tutoring Systems - 21st International Conference, ITS 2025, Proceedings. Graf, S. & Markos, A. (eds.). Springer Science and Business Media Deutschland GmbH, p. 246-258 13 p. (Lecture Notes in Computer Science; vol. 15723 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Language Model 100% Comprehensive Survey 100% Knowledge Tracing 100% Large Language Models 100% Real Time 100% Counterfactual Fairness Evaluation of Machine Learning Models on Educational DatasetsKim, W. & Kim, H., 2026, Generative Systems and Intelligent Tutoring Systems - 21st International Conference, ITS 2025, Proceedings. Graf, S. & Markos, A. (eds.). Springer Science and Business Media Deutschland GmbH, p. 88-103 16 p. (Lecture Notes in Computer Science; vol. 15724 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Sensitive Attribute 100% Machine Learning 100% Learning System 100% Machine Learning Model 100% Algorithmic Bias 100% Echo-Teddy: Preliminary Design and Development of Large Language Model-Based Social Robot for Autistic StudentsLee, U., Kim, H., Eom, J., Jeong, H., Lee, S., Byun, G., Lee, Y., Kang, M., Kim, G., Na, J., Moon, J. & Kim, H., 2026, Generative Systems and Intelligent Tutoring Systems - 21st International Conference, ITS 2025, Proceedings. Graf, S. & Markos, A. (eds.). Springer Science and Business Media Deutschland GmbH, p. 287-301 15 p. (Lecture Notes in Computer Science; vol. 15724 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Language Model 100% Large Language Models 100% Social Robots 100% Autistic Students 100% Social Interaction 100% ES-KT-24: A Multimodal Knowledge Tracing Benchmark Dataset with Educational Game Playing Video and Synthetic Text GenerationKim, D., Lee, U., Lee, S., Bae, J., Ahn, T., Park, J., Lee, G. & Kim, H., 2026, Generative Systems and Intelligent Tutoring Systems - 21st International Conference, ITS 2025, Proceedings. Graf, S. & Markos, A. (eds.). Springer Science and Business Media Deutschland GmbH, p. 259-273 15 p. (Lecture Notes in Computer Science; vol. 15724 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Benchmark Dataset 100% Game Playing 100% Knowledge Tracing 100% Text Generation 100% Multimodal Knowledge 100% Gamified Team Programming in MUVEs: Effects on Student Engagement and AchievementJang, Y., Choi, S., Jung, H. & Kim, H., 2026, Generative Systems and Intelligent Tutoring Systems - 21st International Conference, ITS 2025, Proceedings. Graf, S. & Markos, A. (eds.). Springer Science and Business Media Deutschland GmbH, p. 169-180 12 p. (Lecture Notes in Computer Science; vol. 15724 LNCS).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Environmental Impact 100% Student Engagement 100% Student Achievement 100% Multi-user Virtual Environments 100% Gamified 100% View all 97 research outputs",
  "content_length": 4620,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:47"
}