{
  "name": "Hyeran Jeon",
  "homepage": "https://www.mocalab.org",
  "status": "success",
  "content": "MoCA LabSearch this siteEmbedded FilesSkip to main contentSkip to navigationHeader photos are from UC Merced Image Library. Mostly taken by Veronica Adrover.Hyeran Jeon Associate Professor, CSE department @ University of California Merced. Hyeran Jeon's main research interests lie in energy-efficient, reliable and secure computer architecture and systems design. Her research lab has been sponsored by National Science Foundation, California Energy Commission, LAM Research, Xilinx, NVIDIA, and Ampere Computing. She earned her Ph.D. at the University of Southern California, under the supervision of Prof. Murali Annavaram, where she received Viterbi dean’s doctoral fellowship. She has industry experiences as an intern at IBM T.J. Watson Research Center and AMD Research, and as a systems software engineer at Samsung Electronics. She is a recipient of NSF CAREER award. contact: hjeon7_at_ucmerced.edu* I am looking for PhD students for Spring and Fall 2026. For those who want to join us to better support emerging workloads (e.g., LLMs) through efficient software-hardware interactions and architectural innovations of GPUs, please send me an email addressing your research interests and a brief background, along with your CV.  Why UC Merced? UC Merced campus is in 2-hour proximity from Silicon Valley. We are the youngest campus in the prestigious University of California system. Students will get the same benefit with the other campuses inspite of cheaper living expenses. Check our ranking for computer architecture and high-performance research here. Selected Publications (link to full list, google scholar)[BOOK CHAPTER] Jeon, H. (2023). GPU Architecture. In: Chattopadhyay, A. (eds) Handbook of Computer Architecture. Springer. [STANDARD] IEEE Recommended Practice for Developing Energy-Efficient Power-Proportional Digital Architectures IEEE 1924.1 2022 Heliostat: Harnessing Ray Tracing Accelerators for Page Table Walks, ISCA 2025Forest: Access-aware GPU UVM Management, ISCA 2025Efficient Tensor Offloading for Large Deep-Learning Model Training based on Compute Express Link, SC 2024Barre Chord: Efficient Virtual Memory Translation for Multi-Chip-Module GPUs, ISCA 2024Decepticon: Attacking Secrets of Transformers, IISWC 2023Locality-aware GPU Register File, IEEE CAL 2019Tango: A Deep Neural Network Benchmark Suite for Various Accelerators, ISPASS 2019GPGPU Register File Virtualization, MICRO 2015Warped-DMR: Light-weight Error Detection for GPGPU, MICRO 2012Recent News  Mao's paper, PASTA, has been accepted to CGO'26. Congrats Mao!I received a new grant from NRF of Korea to research energy-efficient multimodal AI computing with Ewha and Yonsei! Looking forward to a productive collaboration!Yuan will do internship at Google in Fall! Congrats!Rafi will continue his internship at PNNL in Fall! Continue your great work, Rafi!I received a new NSF grant for researching scalable GPU computing for ML with Georgia Tech! Thank you so much for the generous support, NSF!!Utkarsh will join MoCA Lab in Fall 2025. Welcome!This summer, Yuan and Rafi will do internships at ARM and PNNL. Congratulations!We have multiple members graduating this semester. All the best for your new chapter of life, Xinwei, Kevin, Dhawal, Anthony, Joshua, Gabriel, Derek, and Nawfal!Xinwei successfully defended her master's thesis about a transient execution attack survey! Congrats, Xinwei! Our collaborative paper on memory-constraint CNN has been accepted to TMLR. Congrats, Fang and Rafi!I received the Senate Faculty Grant! Thank you, UC Merced! Our two papers, Heliostat and Forest have been accepted to ISCA'25! Congrats Yuan and Mao! We have two visiting scholars from Korea University and Pusan National University this year! Looking forward to wonderful collaborations, Jonghyun and Jinmyeong!Our paper about the performance implications of UVM on DL workloads has been accepted to EuroMLSys'25. Congrats Mao! Our paper about instruction-level power & thermal characterizations on edge GPUs has been accepted to GPGPU'25. Congrats Rafi and Kevin! Mao successfully passed the qualifying exam and was advanced to a PhD candidate! Congrats, Mao!I received a CAHSI-Google Research award as a PI on privacy-preserving large language models. Thank you CAHSI and Google!Our collaborative paper \"Efficient Tensor Offloading for Large Deep-Learning Model Training based on Compute Express Link\" has been accepted to SC'24! Congratulations, Dong and Yuan! Anthony, Derek, and Nawfal joined MoCA Lab. Welcome!We received server donations from Ampere Computing. Thank you, Ampere Computing for the generous support!!Our paper \"Barre Chord: Efficient Virtual Memory Translation for Multi-Chip-Module GPUs\" has been accepted to ISCA'24! Congratulations, Yuan!!More news>>Current and Former Sponsors Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4876,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:48"
}