{
  "name": "Hyoseung Kim 0001",
  "homepage": "http://www.ece.ucr.edu/~hyoseung",
  "status": "success",
  "content": "Hyoseung Kim Hyoseung Kim Associate Professor, Electrical and Computer Engineering Chair, Computer Engineering Program Cooperating Faculty, Computer Science and Engineering University of California, Riverside Office: 346 Winston Chung Hall900 University AvenueRiverside, CA 92521 Email: hyoseung@ucr.edu Phone: (951) 827-2390 Google Scholar | LinkedIn Profile About Me I am an Associate Professor in the Department of Electrical and Computer Engineering at the University of California, Riverside. I received my Ph.D. in Electrical and Computer Engineering from Carnegie Mellon University in 2016. Research in our lab centers around real-time, embedded and cyber-physical systems. Specifically, we aim to achieve safe, predictable, and efficient computing under uncertain environments, which is a critical area of research for the continued innovation and widespread usability of intelligent autonomous technologies including self-driving cars and smart health and agriculture. We seek opportunities at the intersection of real-time cyber-physical systems and modern parallel computing platforms, and develop novel system software, algorithms, modeling and analysis techniques as a key enabler to build reliable, efficient and usable systems in practice. News Aug 2024: New CPS project on honeybee health monitoring and analysis May 2024: PAAM received Best Paper Award and Best Student Paper Award at RTAS 2024 (pic: Daniel & Hyunjong) Aug 2022: Two papers will appear at RTCSA 2022 and one paper at RTSS 2022 Oct 2021: PiCAS demonstrated at ROSCon 2021 ROS2 Executor Workshop Oct 2021: Five papers to appear at RTSS 2021 Feb 2021: Our paper on real-time ROS2 accepted to RTAS 2021 Jun 2020: Finally it's official! Received the NSF CAREER Award Jun 2020: Invited to serve as the Artifact Evaluation Chair of RTAS 2021 May 2020: Invited to serve on the TPC of RTSS 2020 May 2020: Check out our recent papers: Yecheng's real-time DNN scheduling @ RTSS 2019 (paper, slides) and Mehdi's thermal-aware mixed-criticality systems @ RTAS 2020 (paper, slides) May 2020: Invited to serve on the TPC of DATE 2021 Apr 2020: Invited to serve on the TPC of ASPDAC 2021 Mar 2020: Invited to serve on the TPC of ICCD 2020 May 2019: Two papers accepted for publication at RTCSA 2019 May 2019: Co-organizing the ACM Student Research Competition at ESWEEK 2019 (link) Feb 2019: Two papers have been accepted and will be presented at RTAS 2019, as part of the CPS Week. Both papers are first-authored by my students, Mehdi and Hyunjong. Congrats! Feb 2019: Serving on the TPC for RTCSA 2019 Feb 2019: Serving on the TPC for ICCD 2019 Feb 2019: Serving on the TPC for ICCCN 2019 Apr 2018: Our paper \"Analytical Enhancements and Practical Insights for MPCP with Self-Suspensions\" won the Best Presentation Award at RTAS 2018 Feb 2018: Serving on the TPC for RTCSA 2018 Nov 2017: Organizing the Demo session of RTAS 2018 Nov 2017: Serving on the TPC for OSPERT 2018 Aug 2017: Our paper \"A Server-based Approach for Predictable GPU Access Control\" won the Best Paper Award at RTCSA 2017 Aug 2017: I will be serving on the TPC for RTAS 2018 Jul 2017: I will be serving on the TPC for DATE 2018 (E1 track, see CFP) Jun 2017: Our paper \"A Server-based Approach for Predictable GPU Access Control\" accepted to RTCSA 2017 May 2017: Our paper \"Predictable Shared Cache Management for Multi-Core Real-Time Virtualization\" accepted to ACM TECS Jan 2017: I will be serving on the program committee for RTCSA 2017 Dec 2016: I will be serving on the program committee for EMSOFT 2017 Oct 2016: I will be serving on the program committee for OSPERT 2017 Oct 2016: Our paper \"Real-Time Cache Management for Multi-Core Virtualization\" was nominated for the Best Paper Award at EMSOFT 2016 Jul 2016: Started working at UCR! Jul 2016: I will be serving on the program committee for RTSS@Work 2016 Jun 2016: I will be serving on the program committee for WMC 2016 May 2016: Our paper \"Real-Time Cache Management for Multi-Core Virtualization\" accepted to EMSOFT 2016",
  "content_length": 4026,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:52"
}