{
  "name": "Hyoun Jin Kim",
  "homepage": "https://larr.snu.ac.kr/index.php/people",
  "status": "success",
  "content": "People – Lab for Autonomous Robotics Research Adviser ⋅H. JIN KIM Researchers ⋅YOUNGSEOK JANG ⋅DAESOL CHO ⋅JEONGHYUN BYUN ⋅JOSHUA J. DAMANIK Ph.D. Students ⋅DABIN KIM ⋅YOUNGSOO HAN ⋅INKYU JANG ⋅GYEONGCHAN KIM ⋅MINHYUK YOON ⋅JEONGJUN CHOI ⋅DAHYUN OH ⋅SEUNGYEON YOO ⋅SEUNGWOO JUNG ⋅BYEONGJUN KIM ⋅SUNWOO HWANG ⋅TAEKBEOM LEE ⋅DOHYUN EOM ⋅JONGHAE PARK ⋅GAWON LEE ⋅YONGJAE LIM m.s. students ⋅CHANGHYUN CHOI ⋅JUSUK LEE ⋅YEONSOO PARK ⋅JEONGTAE HER ⋅YEONJOON KIM ⋅HOSEUNG JUNG ⋅SUNGHA KIM ⋅SEUNGWON ROH ⋅YOUNGKYOUNG KONG ⋅JEONGYEON SEO ⋅SUNG IL SON ⋅JONGHUN SHIN ⋅SANGJIN HAN ⋅JAEWOO LEE ⋅SIHYUN CHO ⋅YONGJUN YOU ⋅JEONGHWA HEO ⋅YUBIN KIM alumni ⋅ ph.d. ⋅ m.s. 조 슈 아 Joshua J. Damanik Researcher Research interest End-to-end autonomous driving Heterogeneous vehicle simulation and control Air Traffic Management Biographical Information 2018.07, B.S., Engineering Physics, Bandung Institute of Technology, Bandung, Indonesia 2021.08, M.S., Aerospace Engineering, Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea 2025.08, Ph.D., Aerospace Engineering, Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea 2025.09 ~ present, Researcher, AI-Transformed Aerospace Research Center, KAIST, Daejeon, Korea 2025.11 ~ present, Visiting Researcher, Automation and Systems Research Institute (ASRI), Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: joshuajdmk at gmail.com Homepage: damanikjosh.com Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Department of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 김 유 빈 YUBIN KIM M.S. STUDENT Biographical Information 2025.08, B.S., Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea 2025.08, B.S., Electrical & Computer Engineering, Seoul Nat’l Univ., Seoul, Korea 2025.09 ~ present, M.S./Ph.D. Student, Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: oopuppy at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Department of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 허 정 화 JEONGHWA HEO M.S. STUDENT Biographical Information 2025.08, B.S., Mechanical & Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea 2025.09 ~ present, M.S./Ph.D. Student, Artificial Intelligence, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: hjhcnn23 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: School of Artificial Intelligence, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 유 용 준 YONGJUN YOU M.S. STUDENT Biographical Information 2025.02, B.S., Mechanical Engineering, Hanyang Univ., Seoul, Korea 2025.09 ~ present, M.S./Ph.D. Student, Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: dbys34 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Department of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 조 시 현 SIHYUN CHO M.S. STUDENT Biographical Information 2024.08, B.S., Mechanical Engineering, Yonsei Univ., Seoul, Korea 2025.03 ~ present, M.S./Ph.D. Student, Artificial Intelligence, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: sihyun01 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Graduate School of Artificial Intelligence, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 이 재 우 JAEWOO LEE M.S. STUDENT Biographical Information 2025.02, B.S., Mechanical & Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea 2025.03 ~ present, M.S./Ph.D. Student, Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: jaewoolee930 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Department of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 한 상 진 SANGJIN HAN M.S. STUDENT Biographical Information 2025.02, B.S., Autonomous Engineering, Hanyang Univ., Seoul, Korea 2025.03 ~present, M.S.Student, Future Automotive Mobility, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: evertrue0504 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Department of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 신 종 훈 JONGHUN SHIN M.S. STUDENT Research Interests Reinforcement Learning Robotics Foundation Model Biographical Information 2025.02, B.S., Mechanical Engineering, Seoul Nat’l Univ., Seoul, Korea 2025.03 ~ present, M.S./Ph.D. Student, Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: tlswhdgns0406 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Department of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 손 성 일 SUNG IL SON M.S. STUDENT Biographical Information 2025.02, B.S., Mechanical & Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea 2025.03 ~ present, M.S./Ph.D. Student, Artificial Intelligence, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: aldridge99 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Graduate School of Artificial Intelligence, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 서 정 연 JEONGYEON SEO M.S. STUDENT Research Interest Visual Reinforcement Learning Biographical Information 2024.02, B.S., Electrical & Electronic Engineering / Astronomy, Yonsei Univ., Seoul, Korea 2025.03 ~present, M.S. Student, Artificial Intelligence, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: sjyeon at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Graduate School of Artificial Intelligence, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 공 영 경 YOUNGKYOUNG KONG M.S. STUDENT Biographical Information 2024.08, B.S., Mechanical & Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea 2024.09 ~ present, M.S./Ph.D. Student, Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: kong1543 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Department of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 노 승 원 SEUNGWON ROH M.S. STUDENT Biographical Information 2024.08, B.S., Mechanical & Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea 2024.09 ~ present, M.S./Ph.D. Student, Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: rohsw1011 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Department of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 김 성 하 SUNGHA KIM M.S. STUDENT Biographical Information 2024.08, B.S., Mechanical & Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea 2024.09 ~ present, M.S./Ph.D. Student, Artificial Intelligence, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: rlatjdgk0307 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Graduate School of Artificial Intelligence, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X HOSEUNG JUNG 정 호 성 M.S. STUDENT Biographical Information 2021.02, B.S., Electrical & Computer Engineering, Seoul Nat’l Univ., Seoul, Korea 2021.06 ~2024.05, Agency for Defense Development(ADD), Daejeon, Korea 2024.09 ~ present, M.S./Ph.D. Student, Artificial Intelligence, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: ghtjdaleka at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Graduate School of Artificial Intelligence, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 허 정 태 JEONGTAE HER M.S. STUDENT Research interest Path planning System control Biographical Information 2024.02, B.S., Mechanical Engineering, Yonsei Univ., Seoul, Korea 2024.03 ~present, M.S.Student, Future Automotive Mobility, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: 49ball at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Department of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 박 연 수 YEONSOO PARK M.S. STUDENT Research interest SLAM, Spatial AI, 3D Vision Biographical Information 2023.08, B.S., Electrical & Electronic Engineering, Yonsei Univ., Seoul, Korea 2024.03 ~present, M.S.Student, Artificial Intelligence, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: ys_park at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Graduate School of Artificial Intelligence, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 이 주 석 JUSUK LEE M.S. STUDENT Research interest Robot Foundation Model Imitation Learning Biographical Information 2024.02, B.S., Mechanical Engineering, Yonsei Univ., Seoul, Korea 2024.03 ~present, M.S./Ph.D.Student, Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: jlee24 at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Graduate School of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 김 연 준 YEONJOON KIM M.S. STUDENT Biographical Information 2024.02, B.S., Mechanical & Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea 2024.03 ~ present, M.S./Ph.D. Student, Aerospace Engineering, Seoul Nat’l Univ., Seoul, Korea Contact Information Office: Bldg 300, Rm 504 Email: 0831joon at snu.ac.kr Phone: +82-2-880-1552 Fax: +82-2-888-1552 Address: Graduate School of Aerospace Engineering, Seoul National University, 1 Gwanak-ro, Gwanak-gu, Seoul, Korea. X 임 용 재 YONGJAE LIM PH.D. STUDENT Research interest Safe Planning and Control Biographical Information 2023.02, B.S., Autonomous Engineering, Hanyang Univ.",
  "content_length": 63679,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:50"
}