{
  "name": "Hyuck M. Kwon",
  "homepage": "https://www.wichita.edu/profiles/academics/engineering/EECS/Kwon-Hyuck.php",
  "status": "success",
  "content": "Hyuck M. Kwon Ph.D. Hyuck M. Kwon, Ph.D. Professor College of Engineering Electrical and Computer Engineering (316) 978-6308 hyuck.kwon@wichita.edu 306, Wallace Hall Main Campus Curriculum Vitae Information Academic Interests and Expertise Research Areas Wireless Mobile Communications, Communication Systems, Information Theory, Satellite Communications, Smart Antenna, Code Division Multiple Access, Multiple Input Multiple Output, Orthogonal Frequency Division Multiple Access, Cooperate, and 2G/3G/4G/5G Wireless Communications. Education Ph. D., University of Michigan, Ann Arbor, Computer, Information and Control Engineering, Attended from August 1980 to Dec. 16, 1984, Dissertation: “Digital Coding For Underwater Acoustic Multipath Channels,” Completed on Dec. 16, 1984. MSEE, Seoul National Univ., Seoul, Korea, Attended from Mar. 2, 1978 to Feb. 20, 1980, Thesis: “Smoothing & Prediction Control,” Completed on Feb. 20, 1980. BSEE, Seoul National University, Seoul, Korea, Attended from Mar. 2, 1974 to Feb. 20, 1978, Completed on Feb. 20, 1978. Undergraduate Research/Development Projects Supervised by Semester The following are the undergraduate senior research projects for which I was the advisor. These projects were presented at the annual Engineering Open House. The PV Control of an RC Car project has been used for the numerous Department demonstration activities, e.g. recruitment of Wallace Scholar high school students: Summer/2018, Ethen Dixon, “System and Method for Channel Statistics Dependent Frequency Hopping”. Note: Ethen Dixon was awarded the Undergraduate Engineering Research Award with stipend ($2,906.91) from the College of Engineering, WSU, for summer 2018, and put his effort to improve the TRL3 to a higher TRL for my US Patent issued with number 9,819,387 B1, November 14, 2017, by implementing the innovation with the USRPs equipment and spectrum analyzers. Spring 2006/Fall 2006, ECE585/ECE595, Ph Control. Fall 2004/Spring 2005, ECE585/ECE595, Testing an OFDMA Wireless/Mobile Communication System with System View Software by Elaniux Software. Fall 2003/Spring 2004, ECE585/ECE595, Testing a Wireless/Mobile Communication System with System View Software by Elaniux. Fall 2002/Spring 2003, ECE585/ECE595, Texas Instrument Emulation Board Kit Spring 2002/Fall 2002, ECE585/ECE595, PV Control of an RC Car 2 Spring 2001/Fall 2001, ECE585/ECE595, PV Control of an RC Car 1 Fall 1999/Spring 2000, ECE585/ECE595, Convolutional Viterbi Decoder Spring 1998/Fall 1998, ECE585/ECE595, Power Control Simulator for Digital Mobile Communication Systems Spring 1996/Fall 1996, ECE585/ECE595, Automatic Power Lock and Unlock System (APLAUS) Fall 1995/Spring 1996, ECE585/ECE595, Wireless Tone Signal Transmitter and Receiver Design for Emergency Calls Fall 1994/Spring 1995, ECE585/ECE595, Zero-Crossing Digital Demodulator Ph. D. Dissertations Supervised as a Committee Chair (Title, Department, Student, Date Completed/Expected) “Secret Key Generation using Compound Gaussian Correlated Sources,” Electrical Engineering, Vidhi Rama*, Expected Fall 2020. Co-Committee Chair with Dr. Remi Chou. “Power Constrained Uncoordinated Frequency Hopping Using Multiarmed Bandit with Switching Cost,” Electrical Engineering, Olusola Tolulope Odeyomi*, Expected Fall 2020. Co-Committee Chair with Dr. Remi Chou. “Satellite Digital Beamforming under Nonlinear High Power Amplifier,” Madhuprana Goswami*, Expected summer 2019. “Capacity of Computer-and-Forward Two-Way Relay Under Fading: Lattice Approach,” Krittetash Pinyoanuntapong*, Expected Fall 2019. “Optimal Network Control for Heavy Data Deliver,” Shuang Xia*, Completed on February 27, 2018. Co-Committee Chair with Dr. Pu Wang, and employed at Stradigi AI, Montreal, Canada. “Cell Association Attack via Reference Signal Spoofing in Multi-Cell Wireless Networks,” Electrical Engineering, Shuang Feng*, March 14, 2016, Completed and employed as a research assistant professor, the University of New Mexico, Albuquerque, NM. “Adversary Analysis of Cockroach Network under Rayleigh Fading Channel: Probability of Error and Adversary Detection,” Electrical Engineering, Tze C. Wong*, spring 2015, Completed. “User Selection with Perfect and No Primary CSIT in MIMO Cognitive Radio Networks,” Electrical Engineering, Wenhao Xiong*, fall 2014, Completed, and employed at Intelligent Fusion Technology, Inc., 20271 Goldenrod Lane, Suite 2066, Germantown, MD 20876. “Spreading Sequence Design for Relay Networks under Multipath Fading,” Electrical Engineering, Jie Yang*, January 10, 2014, Completed, and employed as an assistant professor of practice, Northern Arizona State University, Flagstaff, AZ 86001. “Comprehension of Amplify-And-Forward Relay Networks,” Electrical Engineering, Kanghee Lee*, January 3, 2014, Completed, and employed at Korean Air Force. “Ferrite Material Miniaturized Antenna with Two Elements for MIMO Communications,” Electrical Engineering, Chandana K. K. Jayasooriya*, May 23, 2013, Completed, and employed as an assistant professor, The University of Pittsburg, Johnstown, PA 15904. “Direction of Arrival Angle Estimation Schemes for Wireless Communication Systems,” Electrical Engineering, Nizar Tayem*, May 3, 2005, Completed, and employed as the Chair, Department of Electrical Engineering, Texas A&M Common Wealth University. “Comprehensive Power Controls with Pilot Channel Aided Adaptive Antennas for the 3rd Generation CDMA Wireless Communications,” Electrical Engineering, Tatcha Chulajata*, Fall 2003, Completed and employed as an assistant professor at Mahidol University, Nakornprathom 73170, Thailand. “Smart Antennas for Code Division Multiple Access Wireless Communications,” Electrical Engineering, Yoo S. Song*, Fall 2001, Completed, and employed at ETRI, Korea. “PN code Acquisition Using Smart Antenna for DS-CDMA Wireless Communications,” Electrical Engineering, Bing Wang*, Spring 2001, Completed, and employed at as a VP in a state-owned Internet Media Company in Guangzhou, China. “Interference Suppression Receiver with Adaptive Antenna Array for Code-Division Multiple Access Communications Systems,” Electrical Engineering, Weiguang Hou*, December 2000, Completed, and employed at Garmin, Kansas. “Smart Antenna Effects on Soft Handoff and Capacity in a Code Division Multiple Access Wireless Communication System,” Electrical Engineering, David Hastings*, August 2000, Completed, and employed at Mobile Care Program Manager, GE Medical Systems Information Technologies. “Symbol Synchronization for Zero-Crossing Demodulator under Static and Mobile Fading Environments,” Electrical Engineering, Kwang. S. Mun*, May 1999, Completed. Ph. D. Dissertations Supervised as a Committee Member (Title, Department, Student, Date Completed/Expected) “Unbiased of Homogeneity Test under Multivariate Order Reconstruction,” Mathematics and Statistics, Mustafa Hamdan*, April 14, 2017, Completed. “Robust Power Control (RPC) Design for Smart Grid Based on Wind Energy,” Electrical Engineering, Suliman Abdullah Alhamidi*,” November 8, 2016, Completed. “Decentralized Control of Interconnected Singularly Perturbed Systems,” Electrical Engineering, Walid Alfuhaid*, June 14, 2016, Completed. “Increasing Stability in the Inverse Problem for the Schrodinger Equation,” Mathematics and Statistics, Li Liang*, November 17, 2015, Completed. “Quantum Computing Architectures,” Electrical Engineering, Preethika Kumar*, July 6, 2007, Completed. WSU. “Design of RSD-Cyclic Hybrid RSD-Cyclic / Sigma-Delta Ads,” Electrical Engineering, Youssef H. Atris*, July 6, 2007, Completed. “Robust and Reduced Order H-infinity Filtering via LMI Approach and Its Application to Fault Detection,” Electrical Engineering, Young-Man Kim*, April 19, 2006, Completed. “Fast Pesudospectral Algorithms for Boundary Value Problems for the Laplace Equation on a Rectangle,” Math Department, Benjamin Francis Bunck*, July 2004, Completed. “Composite Control for the Singularly Perturbed Systems,” Electrical Engineering, Yong-Sik Chung*, April 2, 2002, Completed. “Performance Analysis of the Downlink Packet System in CDMA Wireless Networks,” Electrical Engineering, Jaewon Cho*, Sogang University, Seoul, Korea, December 2001, Completed. “Sequencing and Scheduling in WDM Local Network and Back Propagation Training for an Optical Neural Network,” Electrical Engineering, Mingtao Yang*, Fall 2001, Completed. “Computer Control of Decentralized Singularly-Perturbed Systems,” Electrical Engineering, Kai-Chao Yao*, Spring 2001, Completed. “Scheduling Variable-Length Messages in a Multicast Supported Local Single-Hop WDM Network,” Electrical Engineering, Mingtao Yang*, April 24, 2001, Completed. “Control of a Semi-Conducting Manufacturing System,” Electrical Engineering, Shyh-Pyng Shue*, May 2000, Completed. “Mixed-Norm Robust Control of Linear Systems,” Electrical Engineering, Craig Stanton*, May 1998, Completed. “Reliable Control of Two-Time-Scale Systems,” Electrical Engineering, Chariya Loescharatarmdee*, May 1997, Completed. “Application of Nonlinear H-infinity Theory to Robotic Systems,” Electrical Engineering, Wayne Stout*, July 1996, Completed. “Stability Robustness of Linear Discrete Time Systems,” Electrical Engineering, C. Yen*, May 1994, Completed. MS Thesis Supervised as a Committee Chair (Title, Department, Student, Date Completed/ Expected) “Performance of Digital Video Broadcasting Second Generation under Jakes Fading Channel,” Ashfia Habib*, October 16, 2017, Completed, and employed at North South University, Dhaka, Bangladesh, as an instructor. “Boundaries of Signal-To-Noise Ratio for Adaptive Code Modulations,” Krittetash Pinyoanuntapong*, June 3, 2016, Completed and employed at NIAR, and a Ph. D. student at WSU. “Nano-Antennae with Metamaterial versus Millimeter- Antennae without Metamaterial,” Electrical Engineering, Madhuprana Goswami*, June 3, 2016, Completed, and a Ph. D. student at WSU. “Analysis of MIMO Radar Impact on MIMO Communication System using a Zero-F",
  "content_length": 126879,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:53"
}