{
  "name": "Hyung Jin Chang",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/chang-jin-hyung.aspx",
  "status": "success",
  "content": "Dr Hyung Jin Chang - School of Computer Science - University of Birmingham Dr Hyung Jin Chang PhD School of Computer ScienceAssociate ProfessorHead of External Partnerships of Computer Science Contact details Emailh.j.chang@bham.ac.uk View my research portal AddressThe School of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Hyung Jin Chang is an associate professor in the School of Computer Science at the University of Birmingham. He received a PhD in machine learning and computer vision at Perception and Intelligence Lab, Seoul National University, in 2013. As a post-doctoral researcher, he worked at Imperial College London and was involved in several EU projects (EU FP7 GRANT 612139 and EU H2020 GRANT 643783) and industry projects (Samsung Electronics and Samsung GRO Grant). Dr Hyung Jin Chang's-personal webpage. PhD in Seoul National University 2013 BSc in Seoul National University 2006 Hyung Jin Chang qualified with a BSc in Electrical and Computer Engineering from Seoul National University in 2006, and PhD in Electrical Engineering and Computer Science from Seoul National University in 2013. Before joining the University of Birmingham, he was a post-doctoral researcher at Imperial College London. Dr Hyung Jin Chang’s research combines multiple areas of artificial intelligence including computer vision, machine learning, robotics, and human-robot interaction. Recently, his research has focused on exploiting and making advances in robot vision, and learning techniques to move toward intelligent interaction human-robot interaction via visual data. In particular, he is interested in human-centred visual learning covering from estimating human hand, body pose, and gaze to understanding human action and internal states. Recent publications Article Kim, B, Kim, J, Chang, HJ & Oh, T-H 2025, 'A unified framework for unsupervised action learning via global-to-local motion transformer', Pattern Recognition, vol. 159, 111118. https://doi.org/10.1016/j.patcog.2024.111118 Na, J, Jung, H, Chang, HJ & Hwang, W 2025, 'Bridging domain spaces for unsupervised domain adaptation', Pattern Recognition, vol. 164, 111537. https://doi.org/10.1016/j.patcog.2025.111537 Conference contribution Hu, H, Lin, D, Huang, Q, Hou, Y, Chang, HJ & Jiao, J 2025, Audio-Visual Separation with Hierarchical Fusion and Representation Alignment. in British Machine Vision Conference. Chen, Z, Zhang, Z, Cheng, Y, Leonardis, A & Chang, HJ 2025, Force-Aware 3D Contact Modeling for Stable Grasp Generation. in The 40th Annual AAAI Conference on Artificial Intelligence. Proceedings of the AAAI Conference on Artificial Intelligence, Association for the Advancement of Artificial Intelligence. Wang, H, Zhang, Z, Cheng, Y & Chang, HJ 2025, RTGaze: Real-Time 3D-Aware Gaze Redirection from a Single Image. in The 40th Annual AAAI Conference on Artificial Intelligence. Proceedings of the AAAI Conference on Artificial Intelligence, Association for the Advancement of Artificial Intelligence, 40th Annual AAAI Conference on Artificial Intelligence, Singapore, Singapore, 20/01/26. Dasgupta, E, Kim, B, Yeo, S-H & Chang, HJ 2025, SimForce: Force and Surface Electromyography from Full Body Video with Graph Neural Nets. in 2026 IEEE/CVF Winter Conference on Applications of Computer Vision (WACV). IEEE Winter Conference on Applications of Computer Vision, IEEE. Fan, Z, Ohkawa, T, Yang, L, Lin, N, Zhou, Z, Zhou, S, Liang, J, Gao, Z, Zhang, X, Zhang, X, Li, F, Liu, Z, Lu, F, Zeid, KA, Leibe, B, On, J, Baek, S, Prakash, A, Gupta, S, He, K, Sato, Y, Hilliges, O, Chang, HJ & Yao, A 2024, Benchmarks and Challenges in Pose Estimation for Egocentric Hand Interactions with Objects. in Computer Vision – ECCV 2024: 18th European Conference, Milan, Italy, September 29–October 4, 2024, Proceedings, Part XXV. Lecture Notes in Computer Science, vol. 15083, Springer, pp. 428–448, 18th European Conference on Computer Vision, ECCV 2024, Milan, Italy, 29/09/24. https://doi.org/10.48550/arXiv.2403.16428, https://doi.org/10.1007/978-3-031-72698-9_25 Feng, R, Gao, Y, Tse, THE, Ma, X & Chang, HJ 2024, DiffPose: SpatioTemporal Diffusion Model for Video-Based Human Pose Estimation. in 2023 IEEE/CVF International Conference on Computer Vision (ICCV)., 10378477, Proceedings of the IEEE International Conference on Computer Vision, IEEE, pp. 14815-14826, 2023 International Conference on Computer Vision, Paris, France, 2/10/23. https://doi.org/10.1109/ICCV51070.2023.01365 Kim, T, Na, J, Hwang, J, Chang, HJ & Hwang, W 2024, Dual Prototype-driven Objectness Decoupling for Cross-Domain Object Detection in Urban Scene. in M Cho, I Laptev, D Tran, A Yao & H Zha (eds), Computer Vision – ACCV 2024: 17th Asian Conference on Computer Vision, Hanoi, Vietnam, December 8–12, 2024, Proceedings, Part VIII. Lecture Notes in Computer Science, vol. 15479, Springer, pp. 121-138, 17th Asian Conference on Computer Vision, Hanoi, Viet Nam, 8/12/24. https://doi.org/10.1007/978-981-96-0966-6_8 Chen, X, Huang, Q, Hou, Y, Wu, J, Zhang, F, Chang, HJ & Jiao, J 2024, Few Exemplar-Based General Medical Image Segmentation via Domain-Aware Selective Adaptation. in M Cho, I Laptev, D Tran, A Yao & H Zha (eds), Computer Vision – ACCV 2024: 17th Asian Conference on Computer Vision, Hanoi, Vietnam, December 8–12, 2024, Proceedings, Part VIII. Lecture Notes in Computer Science, vol. 15473, Springer, pp. 159-173, 17th Asian Conference on Computer Vision, Hanoi, Viet Nam, 8/12/24. https://doi.org/10.1007/978-981-96-0901-7_10 Zheng, L, Tse, THE, Wang, C, Sun, Y, Chen, H, Leonardis, A, Zhang, W & Chang, HJ 2024, GeoReF: Geometric Alignment Across Shape Variation for Category-level Object Pose Refinement. in 2024 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR). Proceedings - IEEE Computer Society Conference on Computer Vision and Pattern Recognition, IEEE, pp. 10693-10703, 2024 IEEE/CVF Conference on Computer Vision and Pattern Recognition, Seattle, Washington, United States, 17/06/24. Katsu, J, Dasgupta, E & Chang, HJ 2024, GRF-MV: Ground Reaction Force Estimation from Monocular Video. in BMVC 2024 Workshop on Advancing Non-invasive Human Motion Characterization (ANIMA 2024). British Machine Vision Association, 35th British Machine Vision Conference, Glasgow, United Kingdom, 25/11/24. <https://bmva-archive.org.uk/bmvc/2024/workshops/ANIMA/paper1.pdf> Preprint Tse, THE, Feng, R, Zheng, L, Park, J, Gao, Y, Kim, J, Leonardis, A & Chang, HJ 2025 'Collaborative Learning for 3D Hand-Object Reconstruction and Compositional Action Recognition from Egocentric RGB Videos Using Superquadrics' arXiv. https://doi.org/10.48550/arXiv.2501.07100 Xu, C, Huang, Q, Hou, Y, Wu, J, Zhang, F, Chang, HJ & Jiao, J 2024 'Few Exemplar-Based General Medical Image Segmentation via Domain-Aware Selective Adaptation' arXiv, pp. 17. https://doi.org/10.48550/arXiv.2410.09254 Review article Parnada, A, Qu, M, Castellani, M, Jin Chang, H & Wang, Y 2025, 'Towards cost-effective and safe contact-rich robotic manipulation with reinforcement learning: A review of techniques for future industrial automation', Proceedings of the Institution of Mechanical Engineers. Part I: Journal of Systems and Control Engineering. https://doi.org/10.1177/09596518251350353 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 7436,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:55"
}