{
  "name": "Hyunjin Park",
  "homepage": "http://hyunjinpark.blogspot.com",
  "status": "success",
  "content": "Hyunjin Park(박현진) skip to main | skip to sidebar Hyunjin Park(박현진) 2010년 2월 26일 금요일 Hyunjin Park (박현진) Hyunjin Park Ph.D. Professor School of Electronic and Electrical Engineering (primary)Department of Electrical and Computer Engineering Department of Artificial IntelligenceDepartment of Biomedical Engineering Center for Neuroscience Imaging Research Sungkyunkwan University, Suwon, Korea hyunjinp@skku.edu, hyunjinp@gmail.com +82-31-299-4956 Medical Image Processing Lab (MIPL) 의료영상처리연구실 성균관대학교 전자전기공학부/전자전기컴퓨터공학과 의료영상처리연구실은 대학원생과 박사후연구원을 모집합니다. 대학원생에게는 학비지원을 포함한 많은 장학금 혜택이 있습니다. 박사후연구원은 급여를 포함하여 국내최고 대우가 가능합니다. 관심있으신 분들은 이메일로 지원하시기 바랍니다. Education and Training B.S. Electrical Engineering, Seoul National University, Seoul, South Korea, 1997 Military Service, Kwangju, South Korea, 1997-1998 M.S. Biomedical Engineering, University of Michigan, Ann Arbor, MI, 2000 M.S. Electrical Engineering, University of Michigan, Ann Arbor, MI, 2000 Ph.D. Biomedical Engineering, University of Michigan, Ann Arbor, MI, 2003 Postdoc Department of Radiology, University of Michigan, Ann Arbor, MI, 2003-2004 Academic Appointments Research Investigator: Department of Radiology, University of Michigan, Ann Arbor, MI, 2004-2007 Assistant Prof (Research): Department of Radiology, University of Michigan, Ann Arbor, MI, 2007-2009 Assistant Prof: Dept of Biomedical Engineering, Gachon University, Korea, 2009 - 2012 Assistant Prof: School of Electronic and Electrical Engineering, Sungkyunkwan University, 2012 - 2013 Associate Prof: School of Electronic and Electrical Engineering, Sungkyunkwan University, 2013 - 2019 Professor: School of Electronic and Electrical Engineering, Sungkyunkwan University, 2019 - current Research Interest Image processing for medical imagery including image registration and segmentation. Computer vision for medical imagery.Medical image analysis for cancer management. Neuroimaging analysis, radiomics, and imaging genetics. Editorial board and peer review 2013-Current Editorial board for Biomedical Engineering Letters 2018-Current Editorial board for Medicine 2019-Current Editorial board for Scientific Reports 2020-Current Editorial board for Frontiers in Neuroscience 2020-Current Editorial borad for Electronics2021-Current Editorial board for Life 2002-Current Reviewer for IEEE Transactions on Medical Imaging 2006-Current Reviewer for Medical Image Computing and Computer Aided Intervention (MICCAI) 2006-Current Reviewer for IEEE Transactions on Image Processing 2009-Current Reviewer for Medical Physics Journal Papers (n=200), Google Scholar Profile, ORCID JCR indexed (n = 169), main author papers in JCR (n = 124), LNCS (n = 18), scopus (n = 3), * equal contribution, # as corresponding author [Preprint]To be filled[2025]J. Ryu, S. Lee, E. Jeon, H. Song, H. Choi, H. Cho, H. Park, I. Baek, K. Kim, S. Ju, J. Choi, S. Lee, Y. Ha, J. Lee, W. Seo#, “Association Between Internal Carotid Artery Tortuosity and Hemorrhagic Transformation in Patients with Acute Ischemic Stroke”, accepted for European Neurology, November 2025. LinkG. Jo, J. Kim, N. Rue, H. Park#, “Harmonizing multi-domain heterogeneity in medical imaging via Gaussian mixture model”, accepted for Bioinformatics and Biomedicine  (BIBM), October 2025. LinkJ. Kim, I. Na, J. Chung, H. Song, K. Kim, S. Ju, M. Eun, W. Seo#, H. Park#, “Enhancing Intracranial Vessel Segmentation using Diffusion Models without Manual Annotation for 3D Time-of-Flight Magnetic Resonance Angiography”, Computerized Medical Imaging and Graphics, article 102651, doi: 10.1016/j.compmedimag.2025.102651, October 2025. LinkH. Choi, Y. Park, J. Lee, S. Kim, B. Park#, and H. Park#, “Spatiotemporal characterization of the functional MRI latency structure with respect to neural signaling and brain hierarchy”, Advanced Science, doi: 10.1002/advs.202504956, August 2025. LinkH. Choi, S. Kim, J. Lee, B. Park, H. Park#, “Integrating meta-analysis in multi-modal brain studies with graph-based attention transformer”, Medical image computing and computer-assisted intervention (MICCAI) 2025, doi: 10.1007/978-3-032-05162-2_40, September 2025. LinkH. Choi, J. Kim, J. Chung, B. Park, H. Park#, “PMIL: Prompt enhanced Multimodal Integrative analysis of fMRI combining functional connectivity and temporal Latency”, Medical image computing and computer-assisted intervention (MICCAI) 2025,  doi: 10.1007/978-3-032-05162-2_52, September 2025. LinkI. Na*, N. Rue*, J. Chung, H. Park#, “RadiomicsRetrieval: A Customizable Framework for Medical Image Retrieval Using Radiomics Features”, Medical image computing and computer-assisted intervention (MICCAI) 2025, doi: 10.1007/978-3-032-04927-8_53, September 2025. LinkJ. Kim, G. Jo, S. Ra, H. Park#, “Privacy-Preserving Chest X-ray Classification in Latent Space with Homomorphically Encrypted Neural Inference”, Medical image computing and computer-assisted intervention (MICCAI) 2025, doi: 10.1007/978-3-032-05185-1_47, September 2025. LinkJ. Kwon, J. Kim, T. Kim, S. Seo, H. Cho#, H. Park#, “Blood Pressure Assisted Cerebral Microbleed Segmentation via Meta-matching”, Medical image computing and computer-assisted intervention (MICCAI) 2025, doi: 10.1007/978-3-032-04927-8_8, September 2025. LinkJ. Kim, I. Na, J. Kwon, W.-K. Seo, and H. Park#, “Weakly-Supervised Segmentation using Sparse Single Point Annotations for lumen and wall of carotid arteries in 3D MRI”, Computer Methods and Programs in Biomedicine, article 108881, doi: 10.1016/j.cmpb.2025.108881, June 2025. LinkS. Oh*, S. Kim*, J. P. Kim, S. W. Seo, B. Park#, and H. Park#, “Association of APOC1 with cortical atrophy during conversion to Alzheimer’s disease”, GeroScience, doi: 10.1007/s11357-025-01695-6, May 2025. LinkS. Ra, J. Kim, I. Na, E. S. Ko, and H. Park#, “Enhancing Radiomics Features via a Large Language Model for Classifying Benign and Malignant Breast Tumors in Mammography”, Computer Methods and Programs in Biomedicine, article 108765, doi: 10.1016/j.cmpb.2025.108765, June 2025. LinkJ. Lee, K. Byeon, S. Kim, B. Park, H. Park#, “Revealing the multivariate associations between autistic traits and principal functional connectome”, Neuroinformatics, vol. 23, article 27, doi: 10.1007/s12021-025-09720-x, April 2025. LinkJ. Lee*, S. Kim*, S. Park, H. Choi, B. Park#, H. Park#, “Atypical maturation of the functional connectome hierarchy in autism”, Molecular Autism, vol. 16, article 21, doi: 10.1186/s13229-025-00641-9, March 2025. LinkJ. Kim, I. Na, E. S. Ko, H. Park#, “Tumor Synthesis conditioned on Radiomics”, Winter Conference on Applications of Computer Vision (WACV), p. 3635-3646, March 2025. LinkS. Pachade, P. Porwal, M. Kokare, G. Deshmukh, V. Sahasrabuddhe, Z. Luo, F. Han, Z. Sun, L. Qihan, S. Kamata, E. Ho, E. Wang, A. Sivajohan, S. Youn, K. Lane, J. Chun, X. Wang, Y. Gu, S. Lu, Y. Oh, H. Park, C. Lee, H. Yeh, K. Cheng, H. Wang, J. Ye, J. He, L. Gu, D. Müller, I. Soto-Rey, F. Kramer, H. Arai, Y. Ochi, T. Okada, L. Giancardo, G. Quellec, F. Mériaudeau, “RFMiD: Retinal Image Analysis for multi-Disease Detection Challenge”, Medical Image Analysis, vol. 99, article 103365, doi: 10.1016/j.media.2024.103365, January 2025. Link[2024]J. Kwon, S. W. Seo, H. Park#, “Enhancing Cerebral Microbleed Segmentation with Pretrained UNETR++”, Bioinformatics and Biomedicine (BIBM) 2024, p. 3372 – 3377, December 2024. LinkG. Jo, J. Kim, B. Park, H. Park#, “DeAFusion: Detail-Aware Image Fusion for Whitematter Hyperintensity Segmentation”, Bioinformatics and Biomedicine  (BIBM) 2024, p. 3361 – 3366, December 2024. LinkS. Kim, M. Kim, J. Lee, B. Park#, H. Park#, “Prognostic model for predicting Alzheimer’s disease conversion using functional connectome manifolds”, Alzheimer's Research & Therapy, vol. 217, article 217, doi: 10.1186/s13195-024-01589-3, October 2024. LinkJ. Kim*, M. Kim*, H. Park#, “Domain Aware Multi-Task Pretraining of 3D Swin Transformer for T1-weighted Brain MRI”, Asian Conference on Computer Vision (ACCV) 2024, p.2124 - 2144, December 2024. LinkJ. Chung, S. Kim, J. H. Won#, H. Park#, “Integrating Multimodal Neuroimaging and Genetics: A Structurally-Linked Sparse Canonical Correlation Analysis Approach”, IEEE Journal of Translational Engineering in Health & Medicine, vol. 12, p. 659 – 667, October 2024. LinkS. Oh*, S. Kim*, J. Lee, B. Park, J. H. Won, H. Park#, “Multimodal Analysis of Disease Onset in Alzheimer’s Disease Using Connectome, Molecular, and Genetics Data”, NeuroImage: Clinical, vol. 43, article 103660, doi: 10.1016/j.nicl.2024.103660, August 2024. LinkJ. Kwon, J. Kim, H. Park#, “Leveraging Segmentation-Guided Spatial Feature Embedding for Overall Survival Prediction in Glioblastoma with Multimodal Magnetic Resonance Imaging”, Computer Methods and Programs in Biomedicine, vol. 255, article 108338, doi: 10.1016/j.cmpb.2024.108338, October 2024. LinkH. Cho, J. Choe, J. Kim, Y. Oh, H. Park, K. Lee, H. Y. Lee#, “3D Airway Geometry Analysis of Factors in Airway Navigation Failure for Lung Nodules”, Cancer Imaging, vol. 24, article 84, doi: 10.1186/s40644-024-00730-7, July 2024. LinkE. Kim, G. Kwon, J. Kim, H. Park#, “Semi-supervised Segmentation through Rival Networks Collaboration with Saliency Map in Diabetic Retinopathy”, Medical image computing and computer-assisted intervention (MICCAI) 2024, doi: 10.1007/978-3-031-72120-5_59, October 2024. LinkJ. Kwon, S. W. Seo#, H. Park#, “Anatomically-Guided Segmentation of Cerebral Microbleeds in T1-weighted and T2*-weighted MRI”, Medical image computing and computer-assisted intervention (MICCAI) 2024, doi: 10.1007/978-3-031-72069-7_3, October 2024. LinkI. Na, J. Kim, E. S. Ko, H. Park#, “RadiomicsFill-Mammo: Synthetic Mammogram Mass Manipulation with Radiomics Features”, Medical image computing and computer-assisted intervention (MICCAI) 2024, doi: 10.1007/978-3-031-72384-1_68, October 2024. LinkH. Cho, J. Kim, I. Na, H. Song, J. Choi, I. Baek, J. Lee, J. Chung, C. Kim, K. Oh, O. Bang, G. Kim, W. Seo#, H. Park#, “Predicting cerebrovascular age and its clinical relevance: ",
  "content_length": 67292,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:56"
}