{
  "name": "Hyunyoung Kim 0001",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/kim-hyunyoung.aspx",
  "status": "success",
  "content": "Dr Hyunyoung Kim - School of Computer Science - University of Birmingham Dr Hyunyoung Kim School of Computer ScienceLecturer in Computer Science Contact details Emailh.kim.4@bham.ac.ukTwitter@hyunyoung_kim View my research portal AddressUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Hyunyoung Kim is a lecturer at the School of Computer Science at the University of Birmingham. Her research interest lies in the intersection of tangible interfaces and digital fabrication within HCI. Methods range from low- and high-fidelity physical prototyping, design space analysis to user study. She gets inspiration from and is keen on collaboration with other areas such as architecture, material science, robotics, and design. To see the most recent work and open positions, please visit Dr Kim's personal website. PhD in Computer Science, Université Grenoble Alpes, 2020 MSc in Digital Media, KAIST, 2011 BSe in Information and Communication Engineering, Sungkyunkwan University, 2009 Recent publications Article Jayakody, DPVJ, Lau, TY, Kim, H, Tang, K & Thomas-Seale, L 2025, 'A salient vector field-driven part orientation selection for multi-axis 3D printing', Computer-Aided Design, vol. 184, 103877. https://doi.org/10.1016/j.cad.2025.103877 Jayakody, DPVJ, Lau, TY, Kim, H, Tang, K & Thomas-Seale, LEJ 2024, 'Topological awareness towards collision-free multi-axis curved layer additive manufacturing', Additive Manufacturing, vol. 88, 104247. https://doi.org/10.1016/j.addma.2024.104247 Seifi, H, Vasquez, SA, Kim, H & Fazli, P 2023, 'First-Hand Impressions: Charting and Predicting User Impressions of Robot Hands', ACM Transactions on Human-Robot Interaction, vol. 12, no. 3, 35, pp. 1-25. https://doi.org/10.1145/3580592 Kim, H, Coutrix, C & Roudaut, A 2019, 'KnobSlider: Design of a Shape-Changing Parameter Control UI and Study of User Preferences on Its Speed and Tangibility', Frontiers in Robotics and AI. https://doi.org/10.3389/frobt.2019.00079 Chapter Greis, M, Kim, H, Korge, A, Schmidt, A & Coutrix, C 2019, SplitSlider: A Tangible Interface to Input Uncertainty. in Human-Computer Interaction – INTERACT 2019. https://doi.org/10.1007/978-3-030-29390-1_27 Conference contribution Aljammaz, K, Baber, C & Kim, H 2024, Evaluating novel technologies through the notion of affording situations. in Contemporary Ergonomics and Human Factors 2024. Chartered Institute of Ergonomics & Human Factors, Ergonomics & Human Factors 2024, Kenilworth, United Kingdom, 22/04/24. <https://publications.ergonomics.org.uk/uploads/Evaluating-novel-technologies-through-the-notion-of-affording-situations.pdf> Savage, V, Tejada, C, Zhong, M, Ramakers, R, Ashbrook, D & Kim, H 2022, AirLogic: Embedding Pneumatic Computation and I/O in 3D Models to Fabricate Electronics-Free Interactive Objects. in M Agrawala, JO Wobbrock, E Adar & V Setlur (eds), UIST '22: Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology., 9, UIST: User Interface Software and Technology, Association for Computing Machinery (ACM), New York, pp. 1-12, 35th Annual ACM Symposium on User Interface Software and Technology, UIST 2022, Bend, United States, 29/10/22. https://doi.org/10.1145/3526113.3545642 Visschedijk, A, Kim, H, Tejada, C & Ashbrook, D 2022, ClipWidgets: 3D-printed modular tangible UI extensions for smartphones. in TEI '22 : Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction., 8, Association for Computing Machinery (ACM), pp. 1-11, TEI '22, Daejeon, Korea, Republic of, 13/02/22. https://doi.org/10.1145/3490149.3501314 Kim, H, Everitt, A, Tejada, C, Zhong, M & Ashbrook, D 2021, MorpheesPlug: a toolkit for prototyping shape-changing interfaces. in CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems., 101, CHI: Conference on Human Factors in Computing Systems, Association for Computing Machinery (ACM), CHI '21: CHI Conference on Human Factors in Computing Systems, Virtual, Online, Japan, 8/05/21. https://doi.org/10.1145/3411764.3445786 Kim, H, Guimarães, PD, Coutrix, C & Roudaut, A 2019, ExpanDial: Designing a Shape-Changing Dial. in Proceedings of the 2019 on Designing Interactive Systems Conference. https://doi.org/10.1145/3322276.3322283 Kim, H, Coutrix, C & Roudaut, A 2018, KnobSlider: Design of a Shape-Changing UI for Parameter Control. in Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3173574.3173913 Kim, H, Coutrix, C & Roudaut, A 2018, Morphees+: Studying Everyday Reconfigurable Objects for the Design and Taxonomy of Reconfigurable UIs. in Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3173574.3174193 Kim, H, Coutrix, C & Roudaut, A 2016, KnobSlider: design of a shape-changing device grounded in users' needs. in Actes de la 28ième conférence francophone sur l'Interaction Homme-Machine on - IHM '16. https://doi.org/10.1145/3004107.3004125 Poster Greis, M, Kim, H, Korge, A, Coutrix, C & Schmidt, A 2019, 'Extending Input Space of Tangible Dials and Sliders for Uncertain Input'. https://doi.org/10.1145/3294109.3300985 Kim, H 2018, 'Fostering Design Process of Shape-Changing Interfaces'. https://doi.org/10.1145/3266037.3266131 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 5428,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:58"
}