{
  "name": "Hyungsoo Jung 0001",
  "homepage": "https://dbx.snu.ac.kr/people",
  "status": "success",
  "content": "PeopleSearch this siteEmbedded FilesSkip to main contentSkip to navigationDBX CrewHyungsoo Jung (정형수: 丁亨秀), Ph.D.ProfessorGraduate School of Data Science,Department of Computer Science and Engineering (affiliated),Seoul National UniversityEmail: hyungsoo dot jung @ snu dot ac dot krHomepage / Google ScholarStudentsZguem Sara (사라) Ph.D. Student in CSE (Sep 2023 ~)Education: M.S. in CSE, Seoul National University, Aug 2023Research: KV Systems and HTAP DBMSsPublications: VLDB'26 (in preparation)Email: zguemsara @ snu dot ac dot krKyungmin Lim (임경민)Ph.D. Student in DS (Mar 2025~)Education: B.S. and M.S. in CS, Hanyang University, Feb 2023 and Feb 2025, respectivelyResearch: HTAP DBMSs and DB-OS Co-designPublications: SIGMOD'25 (co-first), SIGMOD'26 (first), SIGMOD/VLDB (two in preparation)Email: kyungmin dot lim @ snu dot ac dot krDongkwang Kim (김동광)Ph.D. Student in DS (Sep 2025 ~)Education: B.A. in Sociology and M.S. in GSDS, Seoul National University, Feb 2018 and Aug 2025, respectivelyResearch: DB-OS Co-design and DB4LLMPublications: SIGMOD'26 (under review)Email: dongkwang dot kim @ snu dot ac dot krKeon Wook Park (박건욱)Ph.D. Student (integrated) in DS (Sep 2024 ~)Education: B.S. in CS, Hanyang University, Aug 2024Research: DB-OS Co-designPublications: SIGMOD'26 (under review)Email: keonwook dot park @ snu dot ac dot krYeonjin Park (박연진)Ph.D. Student (integrated) in DS (Mar 2025 ~)Education: B.S. in CS, Hanyang University, Feb 2025Research: MVCC DBMSs under HTAPPublications: SIGMOD/VLDB (in preparation)Email: yeonjin dot park @ snu dot ac dot krHyejin Choi (최혜진)M.S. Student in DS (Sep 2023 ~)Education: B.A. in Economics, Korea University, Feb 2016Research: Data Lakehouse Systems for ML/DLEmail: helen819 @ snu dot ac dot krHaeram Kim (김해람) M.S. Student in CSE (Mar 2024 ~)Education: B.S. in CS, Chungnam University, Feb 2023Research: HTAP DBMSs over Emerging HardwarePublications: SIGMOD'27 (in preparation)Email: haeram dot kim1 @ snu dot ac dot krCheol-Min Choi (최철민) M.S. Student in DS (Sep 2024 ~)Education: B.S. in CS, Hanyang University, Aug 2024Research: DB-OS Co-design and DB4LLMPublications: SIGMOD'26 (under review)Email: cheolmin dot choi @ snu dot ac dot krHanjoon Bae (배한준)Undergraduate Intern in DS (July 2025 ~)Education: B.S. in Materials Science and Engineering, Seoul National University, Feb 2026 (expected)Research: Neural Relational DataEmail: banjoon @ snu dot ac dot krJinyoung Kim (김진영)Undergraduate Intern in DS (July 2025 ~)Education: B.S. in CS, Sookmyung Women's University, Feb 2026 (expected)Research: Vector-Relational DBMSsEmail: bkjy11069 @ sookmyung dot ac dot krAlumniWoong Sul (설웅)Education: B.S. in Material Science and Engineering and Ph.D. in CSE, Seoul National University, Feb 2022 (co-advised)Work: Teaching Assistant Professor at Hanyang University - Teaching CS major courses in systems areaJongbin Kim (김종빈)Education: B.S. and Ph.D. in CS, Hanyang University, Feb 2017 and Aug 2022, respectivelyWork: Amazon Aurora DSQL (Distributed SQL Database), AWS Inc., Seattle, USA - Developing new databasesPublications: SIGMOD 2019 (first author), FAST 2019 (co-author), SIGMOD 2020 (first author), SIGMOD 2021 (first author), SIGMOD 2022 (first author)Sang-Yeop Rhee (이상엽)Education: B.S. in CS, Purdue University, and M.S. in CS, Hanyang University, Feb 2019Work: Bithumb Inc., Korea - Software developmentHyeongwon Jang (장형원)Education: B.S. and M.S. in CS, Hanyang University, Feb 2017 and Feb 2019, respectivelyWork: SAP Labs Korea - Database developmentPublications: SIGMOD 2019 (co-author)Hyeonseok Oh (오현석)Education: B.S. and M.S. in CS, Hanyang University, Feb 2017 and Feb 2019, respectivelyWork: Google Korea - Software developmentJae-eun Kim (김재은)Education: B.S. and M.S. in CS, Hanyang University, Feb 2017 and Feb 2019 (co-advised), respectivelyWork: MetisX Inc., Korea - Developing vector databasesHyunsoo Cho (조현수)Education: B.S. and M.S. in CS, Hanyang University, Feb 2018 and Feb 2020, respectivelyWork: Dnotitia Inc., Korea - Developing vector databasesPublications: SIGMOD 2020 (co-author), SIGMOD 2021 (co-author)Kihwang Kim (김기황)Education: B.S. and M.S. in CS, Hanyang University, Feb 2018 and Feb 2020, respectivelyWork: SAP Labs Korea - Database developmentPublications: SIGMOD 2020 (co-author), SIGMOD 2021 (co-first)Seohui Son (손서희)Education: B.S. and M.S. in CS, Hanyang University, Aug 2018 and Feb 2021, respectivelyWork: SAP Labs Korea (previously) now unknown (Seattle) - Database developmentPublications: SIGMOD 2019 (co-author)Jaeseon Yu (유재선)Education: B.S. and M.S. in CS, Hanyang University, Feb 2020 and Feb 2022, respectivelyWork: SAP Labs Korea - Database developmentPublications: SIGMOD 2021 (co-author), SIGMOD 2022 (co-first)Kitaek Lee (이기택)Education: B.S. and M.S. in CS, Hanyang University, Feb 2020 and Feb 2023, respectivelyWork: preparing for studying abroad - Database researchPublications: VLDB 2023 (co-first)Jaechan Ahn (안재찬)Education: B.S. and M.S. in CS, Hanyang University, Feb 2021 and Feb 2023, respectivelyWork: Ph.D. Student at the University of Maryland, College Park, USA - Database SystemsPublications: VLDB 2023 (co-first)Changmin Jeon (전창민)Education: M.S. in CSE, Seoul National University, Feb 2025Work: Samsung Electronics - Software developmentHyolim Hong (홍효림)Education: M.S. in CSE, Seoul National University, Feb 2025Work: PIOLINK - Software developmentKihwan Kim (김기환)Education: B.S. and M.S. in CS, Hanyang University, Aug 2023 and Feb 2025, respectivelyWork: XCENA (previously MetisX) - Database developmentPublications: SIGMOD 2025 (co-first), SIGMOD 2026 (accepted)Minseok Yoon (윤민석)Education: B.S. and M.S. in CS, Hanyang University, Aug 2023 and Feb 2025, respectivelyWork: Self employed - Software developmentPublications: SIGMOD 2025 (co-first), SIGMOD 2026 (accepted)Seo-Young Lee (이서영)Education: B.S. in CSE, College of Liberal Studies, Seoul National University, Aug 2025Research: Fast and Scalable Vector-Relational DBMSWork: On the job marketGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 6062,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:55"
}