{
  "name": "Hyungjoon Koo",
  "homepage": "https://secai.skku.edu",
  "status": "success",
  "content": "SecAI Lab @ Sungkyunkwan University We won the Excellence Prize (우수상) at the AI-assisted vulnerability-finding challenge, earning 2 million KRW! Nov 24, 2025 Our paper, Online Messenger Forensics Across Platforms: A Systematic Comparative Study, has been accepted to Journal of the Korea Institute of Information Security & Cryptology! Nov 21, 2025 Our paper, LLM-Based Drug Term Detection in Korean Messenger Conversations, has been accepted to Journal of the Korea Institute of Information Security & Cryptology! Nov 21, 2025 Our paper, Evolving Attack Tactics against Messaging Applications, has been accepted to CISC-W 25! Nov 10, 2025 Our paper, Analysis of Watermarking for AI-generated Text, has been accepted to CISC-W 25! Nov 10, 2025 Our paper, A Decade-long Landscape of Advanced Persistent Threats: Longitudinal Analysis and Global Trends, received a Distinguished Paper Award at CCS '25! Oct 15, 2025 Our paper, Rescuing the Unpoisoned: Efficient Defense against Knowledge Corruption Attacks on RAG Systems, has been accepted to ACSAC 25! Sep 22, 2025 Previous Next Welcome to the SecAI Lab We are a security research group at the Department of Computer Science and Engineering, College of Computing and Informatics in Sungkyunkwan University. The number of computing devices such as laptops, workstations, mobiles, Internet of Things, and cloud services has been ever increasing, communicating with each other. Accordingly, enormous amount of digitalized data become available, necessitating information security all around us. The SecAI lab focuses on system/software security and emerging technologies that require security. In particular, we are working on security with artificial intelligence (AI) where our lab name originates from. Our interests encompass varying topics to which deep learning could be applied including - but not limited to - executable binary analysis (e.g., benign software and malware), understanding of code semantics, advanced attack detection and prevention, digital forensics, etc. I am Hyungjoon Koo who leads the SecAI lab. Launching a new lab, a relatively young lab means that we have lots of potential for the future. We are temporarily closed to hire students. However, you may want to fill out the application form as a candidite in the future. (An application via an email may not be considered).",
  "content_length": 2350,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:54"
}