{
  "name": "Hyungon Moon",
  "homepage": "http://hyungon.unist.ac.kr",
  "status": "success",
  "content": "Hyungon Home (ë¬¸íê³¤) Hyungon Moon (ë¬¸íê³¤) Associate Professor with Tenure Department Head Computer Systems Security Lab Department of Computer Science and Engineering UNIST hyungon@unist.ac.kr hyungon.moon@gmail.com Building 106, Room 601-3 50 UNIST-gil Eonyang-eup, Ulju, Ulsan, South Korea, 44919 CV | Lab | Google Scholar | DBLP | ORCID: 0000-0002-4513-1034 Openings Please visit the CSSL webpage to learn more about the current openings. Some Publications (Full List) 2026 ICSE Rethinking the Capability of Fine-Tuned Language Models for Automated Vulnerability Repair. Woorim Han, Yeongjun Kwak, Miseon Yu, Kyeongmin Kim, Younghan Lee, Hyungon Moon, and Yunheung Paek. International Conference on Software Engineering (ICSE). (Accepted). Machine Learning Automated Vulnerability Repair Software Engineering 2025 ESORICS Identifying Potential Timing Leakages from Hardware Design with Precondition Synthesis. Minu Chung and Hyungon Moon. European Symposium on Research in Computer Security (ESORICS). Hardware Security Model Checking Programming Languages Security LOHEN: Layer-wise Optimizations for Neural Network Inferences over Encrypted Data with high Performance or Accuracy. Kevin Nam, Youyeon Joo, Dongju Lee, Seungjin Ha, Hyunyoung Oh, Hyungon Moon, and Yunheung Paek. USENIX Security Symposium (Security). Homomorphic Encryption Privacy Crypto SP Defeating Use-After-Free Bugs Using Memory Sweeper Without Stop-the-World. Junho Ahn, KangHyuk Lee, Chanyoung Park, Hyungon Moon, and Youngjin Kwon. IEEE Symposium on Security and Privacy \"Oakland\" (SP). Software Security OS TDSC Efficient Use-After-Free Prevention with Pooling, OS-assisted, and Opportunistic Page-Level Sweeping. Chanyoung Park, Yeongjun Kwak, and Hyungon Moon. IEEE Transactions on Dependable and Secure Computing (TDSC). Software Security OS FAST Selective On-Device Execution of Data-Dependent Read I/Os. Chanyoung Park, Minu Chung, and Hyungon Moon. USENIX Conference on File and Storage Technologies (FAST). OS Storage 2024 Security MetaSafe: Compiling for Protecting Smart Pointer Metadata to Ensure Safe Rust Integrity. Martin Kayondo, Inyoung Bang, Yeongjun Kwak, Hyungon Moon, and Yunheung Paek. USENIX Security Symposium (Security). Software Security Rust Compiler NDSS Efficient Use-After-Free Prevention with Opportunistic Page-Level Sweeping. Chanyoung Park and Hyungon Moon. Network and Distributed System Security Symposium (NDSS). Software Security OS 2023 ICCAD Hyperdimensional Computing as a Rescue for Efficient Privacy-Preserving Machine Learning-as-a-Service. Jaewoo Park, Chenghao Quan, Hyungon Moon, and Jongeun Lee. International Conference on Computer-Aided Design (ICCAD). Homomorphic Encryption Privacy Crypto Security Trust: A Compilation Framework for In-process Isolation to Protect Safe Rust against Untrusted Code. Inyoung Bang, Martin Kayondo, Hyungon Moon, and Yunheung Paek. USENIX Security Symposium (Security). Software Security Rust Compiler TMC Ambassy: A Runtime Framework to Delegate Trusted Applications in an ARM/FPGA Hybrid System. Dongil Hwang, Sanzhar Yeleuov, Jiwon Seo, Minu Chung, Hyungon Moon, and Yunheung Paek. IEEE Transactions on Mobile Computing (TMC). Confidential Computing OS Accelerator Show Full List Some Program Committee Activities USENIX Conference on File and Storage Technologies (FAST) 2023, 2025, 2026 ACM EuroSys 2025, 2026 USENIX Security Symposium 2024, 2025, 2026 Teaching 2025FallBuilding Customized Computers (CSE302) 2024SpringAdvanced Computer Architecture (CSE511) 2023Fall Principles of Programming Languages (CSE271) SpringAdvanced Operating Systems (CSE514) 2022Fall Building Customized Computers (CSE302) SpringSoftware Hacking and Defense (UNI204) SpringAdvanced Computer Architecture (CSE511) 2021Fall Computer Architecture (CSE261) Fall Principles of Programming Languages (CSE271) SpringAdvanced Computer Architecture (CSE511) 2020Fall Advanced Computer Architecture (CSE511) Fall Principles of Programming Languages (CSE341) SpringComputer Security (CSE467) 2019Fall Special Topics in CSE â ¡(Software and Systems Security) (CSE481) SpringData Structures (CSE221) SpringSystem Programming (CSE251) 2018Fall Special Topics in CSE â ¡(Computer Systems Security) (CSE481)",
  "content_length": 4243,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:54"
}