{
  "name": "Hyunwoo J. Kim",
  "homepage": "https://www.hyunwoojkim.com",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationMachine Learning & Vision LabMachine Learning & Vision LabMachine Learning and Vision Lab (MLV) led by Hyunwoo J. Kim at Korea Advanced Institute of Science & Technology (KAIST) started in February 2025. Prior to the position, he led his lab at Korea University. Earlier in his career, he worked at Amazon Lab126 in Sunnyvale, California. In 2017, he earned the Ph.D. in the Department of Computer Sciences at the University of Wisconsin-Madison (Ph.D. minor: statistics) under the supervision of Dr. Vikas Singh. In 2013, he completed his internship in the Machine Learning Analytics Team at Amazon in Seattle, Washington. The Machine Learning and Vision Lab (MLV) tackles fundamental open problems in machine learning and computer vision to advance toward artificial general intelligence (AGI) capable of handling any complex tasks. One key focus is advancing high-level visual perception, including  video foundation models, video question answering, and video-language models. Another focus is accelerating scientific discovery by understanding and generating multimodal scientific data (e.g., molecules, weather patterns), leading to generalization of models on non-Euclidean spaces, such as manifolds and graphs. We develop efficient and scalable solutions to process real-world visual data at scale, as well as in resource-limited environments. Our lab actively publishes at leading AI venues, including CVPR, ICCV, ECCV, NeurIPS, and ICML.We have openings for postdoctoral researchers (박사 후 연구원), graduate students (대학원 지원), and undergraduate interns (학부 인턴). If interested, email us.Hyunoo J.Kim (PI) contributing to the development of a specialized AI foundation model for medical and bioscience applications.Hyunwoo J.Kim (PI) has received KCCV test-of-time award (이상욱 학술상).Our paper (NF-BO) has been accepted at ICLR 2025 as an oral presentation (top 1.8%).Dohwan Ko will start his 2025 internship at Meta USA. Jinyoung Park has received 2024 Google Ph.D Fellwoship.Our paper (DAVI) has been accepted at ECCV 2024 as an oral presentation (top 2.3%).ICT Challenge 2024 Minister Award (장관상): 최미소, 송태훈, 양찬형.[IITP x Google x MLV x KAIST] Multilingual Personalized AI Tutors (2024-2027))[한계도전 R&D 프로젝트: CLIMECAST] Extreme Weather Forecasting (2024-2027)2024 CVPR, Seattle WA, USA2024. 04. 05. Picnic @ Gwangnaru Hangang Drone Park2023. 03. 31. Picnic @ Ttukseom park2022 AI Grand Challenge, Team RONY2022 CVPR, New Orleans, Louisiana[ICCV'21] PointWOLF: Point Cloud Augmentation with Weighted Local Transformations[CVPR21 Oral presentation] HOTR: End-to-End Human-Object Interaction Detection with Transformers (카카오브레인과 협력연구)[NeurIPS'21] Neo-GNNs: Neighborhood Overlap-aware Graph Neural Networks for Link Prediction[NeurIPS2021] Metropolis-Hastings Data Augmentation for Graph Neural Networks (네이버와 협력연구)AI Grand Challenge 2nd place (준우승) MLV Drone (후속연구비 6억원) News(New)  [25/11/26] Ji Soo Lee will start her 2026 internship at Meta USA. Congrats!(New) [25/11/20] Hyunwoo J. Kim (PI) will serve as an Area Chair for ICML 2026.(New) [25/11/17] Hyunwoo J. Kim (PI) contributing to the development of a specialized AI foundation model for medical and bioscience applications! [Link](New) [25/11/11] One  paper got accepted at WACV 2026. Congrats to all the coauthors!(New) [25/11/08] Three  papers got accepted at AAAI 2026. Congrats to all the coauthors!(New) [25/10/18] Jaewon Chu has been selected as the top reviewer at NeurIPS 2025(New) [25/09/18] Four  papers got accepted at NeurIPS 2025. Congrats to all the coauthors!(New) [25/09/05] Our paper has been accepted at International Journal of Computer Vision (IF 9.3). Congrats to all authors!(New) [25/09/02] Our paper has been accepted at Information Sciences (IF 6.8). Congrats to all authors![25/08/29] Our team received an Honorable Mention at the 4th Weather-AI Boostcamp. Congrats to all members![25/08/21] One paper has been accepted at EMNLP 2025  as Findings. Congrats to all the co-authors! [26/08/17] Hyunwoo J. Kim (PI) will serve as an Area Chair for CVPR 2026.[26/08/16] Hyunwoo J. Kim (PI) will serve as an Area Chair for ICLR 2026.[25/08/05] Hyunwoo J. Kim (PI) has received KCCV test-of-time award (이상욱 학술상). Congrats to all the co-authors![25/07/25] One of our ICCV papers have been selected for the highlight at ICCV 2025 (top 9.7%). Congrats to all the co-authors![25/06/26] Two papers have been accepted at ICCV 2025. Congrats to all the co-authors!  [25/06/24] A co-authored paper received the Best Paper Award at the 2025 Summer Conference of the Korean Institute of Broadcast and Media Engineers. Congrats to all the co-authors![25/06/23] Hyunwoo J. Kim (PI) will serve as an Area Chair for WACV 2026.[25/05/02] Three papers have been accepted at ICML 2025. Congrats to all the co-authors! [25/02/27] One paper has been accepted at CVPR 2025. Congrats to all the co-authors! [25/02/21] Our paper has been accepted to TPAMI (IF 20.8). Congrats to all the co-authors![25/02/05] Our paper has been accepted to Nature Electronics (IF 34.5). Congrats to all the co-authors![25/02/05] Dogyun Park will start his 2025 internship at Snap Inc. USA, Santa Monica.[25/01/23] One paper has been accepted at ICLR 2025 as an oral presentation (top 1.8%). HUGE congrats! [24/12/30] Dohwan Ko will start his 2025 internship at Meta USA. [24/12/09] Two  papers got accepted at AAAI 2025. Congrats to all the coauthors![24/11/15] Jinyoung Park has received 2024 Google Ph.D Fellwoship! Huge congrats! [Link][24/09/26] Three  papers got accepted at NeurIPS 2024. Congrats to all the coauthors![24/09/25] ICT Challenge 2024 Minister Award (ICT 챌린지 2024 장관상)![24/09/21] One paper has been accepted at EMNLP 2024 (main). Congrats to all the co-authors![24/09/14] Hyunwoo J. Kim (PI) will serve as an Area Chair for CVPR 2025.[24/09/01] Bumsoo Kim is now an assistant professor (조교수) at Chung-Ang University (중앙대).[24/08/20] Hyunwoo J. Kim (PI) will serve as an Area Chair for ICLR 2025.[24/08/19] Dr. Bumsoo Kim will join Chung-Ang University as an assistant professor![24/08/13] One of our ECCV papers has been accepted at ECCV 2024 as an oral presentation (top 2.3%). HUGE congrats! [24/07/02] Two papers got accepted to ECCV 2024. Congrats all the coauthors![24/06/19] Our grant proposal is accepted to Frontier Challenge R&D (한계도전 R&D) [한경 기사][24/05/02] One paper got accepted to ICML 2024. Congrats all the coauthors![24/02/27] Five papers got accepted to CVPR 2024. Congrats all the coauthors![24/02/23] Dohwan Ko will start his 2024 Summer internship at NEC Lab America, San Jose, CA, USA. [24/02/23] Dohwan Ko received the Outstanding Paper Award.[24/02/21] Jinyoung Park received the 2024 KU Achievement Award.[24/01/17] One paper got accepted to ICLR 2024. Congrats all the coauthors![23/10/31] MLV Lab published 12 papers at top-tier AI conferences in 2023 [명품인재 사업단].[23/10/12] Hyunwoo J. Kim (PI) served as an Organizing Chair at MedAGI (1st MICCAI workshop on foundation models for general medical AI) [Link].[23/10/07] One paper got accepted to EMNLP 2023. Congrats all the coauthors![23/09/22] Three papers got accepted to NeurIPS 2023. Congrats all the coauthors![23/08/14] Hyunwoo J. Kim (PI) will serve as an Area Chair for CVPR 2024.[23/07/21] Injae Kim will start his internship at Naver AI Lab (23/09/01~).[23/07/14] Four papers got accepted to ICCV 2023. Congrats all the coauthors![23/04/25] One paper got accepted to ICML 2023. Congrats all the coauthors![23/03/10] Jinyoung Park got a 2023  internship offer from Amazon, Seattle, WA, USA.[23/02/28] Two papers got accepted at CVPR 2023. Congrats all the coauthors![23/01/15] One paper  got accepted to Information Sciences. Congrats all the coauthors![22/11/24] 2022 AI Grand Challenge KEIT Award (인공지능 그랜드 챌린지 재난대응 드론 한국전자기술연구원장상, 3차대회 3년 연속 수상)[22/11/19] One paper with Naver AI Lab  got accepted to AAAI 2023. Congrats all the coauthors![22/09/15] Three papers  got accepted to NeurIPS 2022. Congrats all the coauthors![22/09/01] Jinyoung Park started his internship at Amazon, Seattle, WA, USA.[22/09/01] Heo Hwan started his internship at Naver AI Lab.[22/07/04] One paper  got accepted to ECCV. Congrats all the coauthors![22/05/26] We have received the GCP Credit Award ($30,000) from Google.[22/05/27] One paper  got accepted at Neural Networks. Congrats all the coauthors![22/05/05] Dr. Hyunwoo J. Kim has received Best Lecture Award (석탑강의상, Granite Tower Lecture Award) for 2021 Fall \"Deep Learning\".[22/03/02] Two papers got accepted at CVPR 2022. Congrats all the coauthors![22/01/25] Jinyoung Park has received BK21 KU-Future Talent Fellowship (4단계 BK21 KU-미래인재 펠로우십).[21/12/09]  Minister Award (장관상, 3위) and the prize grant (475M KRW, 4.75억원) in \"2021 AI Grand Challenge for disaster response drones\" (인공지능 그랜드 챌린지 3차대회 2년 연속 수상, 재난구조 드론) [아시아 타임즈 기사].[21/12/01] Our paper got accepted at AAAI 2022. Congrats all the coauthors![21/10/19] Hyperscale AI project with KakaoBrain (2021-2024) [AI Times (AI 타임스 기사)].Two papers got accepted at NeurIPS 2021. Congrats all the coauthors!Minkyu Jeon started working at the Broad Institute of MIT and Harvard as a visiting student. Our paper got accepted at ICCV 2021. Congrats all the coauthors!Our paper got accepted at CVPR 2021 as an oral presentation. Congrats all the coauthors!SeungJun Lee and Chongkeun Paik won the 2nd place and the prize grant (600,000,000 KRW) in AI Grand Challenge for disaster response drones.Our paper got accepted to NeurIPS 2020. Congrats all the coauthors!Our two papers got accepted to ECCV 2020. Congrats all the coauthors!Congratulations to our lab Ph.D. student Seongjun Yun who has just been selected for an internship at Amazon in US.Congratulations to our lab Ph.D. student Seongjun Yun who has just been selected for a summer internship at Facebook in UK.Our \"Graph Transformer Networks\" got accepted to NeurIPS 2019. Congrats all the coauthors![2019/06/28] 정보과학회 튜토리얼 (KCC Tutorial) Geometri",
  "content_length": 10335,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:56"
}