{
  "name": "Hyunseung Choo",
  "homepage": "http://monet.skku.ac.kr/main",
  "status": "success",
  "content": "SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory SUPERINTELLIGENCE Laboratory Our Research Artificial Intelligence CORE Engineering Research Areas Medical Image Processing (Eye Fundus, Bones and Chest X-Ray) AI Network Softwarization Intelligent Internet of Things Medical AI Oculomics * Large Language Models Generative Adversarial Networks and Transformers “Autonomous” Ad hoc and Sensor Networks Data Deep Learning (Life log, Network, Facial, Baseball) Reinforcement Learning Mobile Edge Computing Human “Things” Interactions (Things: Robot, Drone, Energy) * Oculomics: the science of using the eye to diagnose biological·systemic health. Lab Highlights 1 Over the past three years, our research team has published 11 top-tier journal papers and 75 conference papers (16 international, 59 domestic) in the field of Medical AI Imaging, as well as 16 top-tier journal papers and 64 conference papers (31 international, 33 domestic) in the B5G/6G AI Networking domain. In medical imaging, we focus on improving performance in computer vision, vision-language models, and large language models (LLMs) by addressing tasks such as disease diagnosis using fundus (retinal) images, biomarker prediction, and neurological disease diagnosis. Recently, these technologies were presented at MICCAI 2025, MICCAI 2024 and ACCV 2024 and have led to 16 patents and a technology transfer deal worth 47 million KRW. 2 We are also advancing and commercializing our technologies through national projects such as the “Startup Growth Technology Development Project” (worth 500 million KRW) and the “Global Competitiveness Enhancement of SW Technology” project (worth 2.2 billion KRW). In AI Networking, our research explores generative AI, time-series foundation models, and reliable AI for system stability. These outcomes have been published in top 5% journals such as IEEE IoT Journal, IEEE TCCN, and IEEE Network, and are being conducted in collaboration with KT and Samsung Electronics. 3 Recently, we have been leading a 6G R&D project (worth 12.6 billion KRW) supported by the Korean government in partnership with ETRI, SKT, and LG U+, and are also conducting a 3-year mid-career researcher project (worth 720 million KRW) focusing on Hyper-access and Mobility. General Information The Superintelligence Laboratory is an academic unit within the Sungkyunkwan University (SKKU). Our mission is to push the envelope of human live experience by conducting research and experimentation for applying state-of-the-art Artificial Intelligence (AI) methodologies in the fields of networking, computer vision, medical imaging, and data analytics. The current and past sponsors include government agencies (e.g., NRF, IITP, and ETRI), renowned global companies (e.g., SAMSUNG, LG), and SMEs (e.g., NEXDIGM, CHAHOO). Designations in Superintelligence Laboratory range from undergraduate honor’s students to experienced research professors and visiting scholars. Our cutting edge researches are actively conducted based on collaborations with researchers in Korea and abroad. Lab Location 26313A, 27301 College of Computing Sungkyunkwan University Jangangu, Seobu-ro 2066, Suwon 440-746 Korea Direction Tel: +82-31-290-7226 Fax: +82-31-299-4134 History: 통신망연구실 Networking Lab (1999~2019) (지능형) 네트워킹연구실 Intelligent Networking Lab (2020~2022) 수퍼인텔리전스연구실 Superintelligence Lab (2022~) Lab Events 2025년 10월 23일 - IITP 현장답사 2025년 09월 30~10월 2일 - AI Festa 2025년 09월 22~23일 - G-Fair AI 포럼 스탠포드대학교 Robert Chang 부교수와 안저영상 기반 진단 AI 임상 개발 글로벌 파트너십 구축 [과기정통부 주관 AI 챔피언 대회] 정신질환 망막 바이오마커 AI 개발 ‘DeepMood’팀, 사전심사 통과 미네소타대학교 BK21 사업 우수 대학원생 국제 공동연수 목다현 박사과정 파견(26년 2-8월) SKKU-OSU-UoG 중견협력연구 양희규 박사후연구원 파견(25년 7-8월) 토론토대학교 AI 융합 교육프로그램 이영민 석사과정 파견(25년 1–6월) 하노이과학기술대학교 Tien-Dung Nguyen 박사와 Graph-Modelable 문제 해결 AI 알고리즘 공동연구 글래스고대학교 Syed Muhammad Raza 교수와 글로벌 협력 B5G/6G AI기술개발 중견연구 공동연구 오하이오주립대학교 Ness B. Shroff 교수와 글로벌 협력 B5G/6G AI기술개발 중견연구 공동연구 아주대병원 이일재 교수와 AI기반 욕창 병변 분할·단계 분류 자동화 공동연구 예정 쿠알라룸푸르대학교 MIIT·안과부서와 당뇨환자 안질환 조기검출 딥러닝 모델 개발 공동과제 수행",
  "content_length": 4625,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:56"
}