{
  "name": "Hyunwoo Park",
  "homepage": "https://hyunwoopark.com",
  "status": "success",
  "content": "Hyunwoo Park - Seoul National UniversityHyunwoo ParkAssociate ProfessorGraduate School of Data ScienceSeoul National Universityhttps://hyunwoopark.comhyunwoopark@snu.ac.krExperienceSeoul National University, South KoreaSeoul National University, Seoul, South KoreaAssociate Professor, Graduate School of Data Science, 2021 – PresentVice Dean for Academic Affairs, Graduate School of Data Science, 2023 – 2025Acting Vice Dean for Student Affairs, Graduate School of Data Science, 2023 – 2024Ohio State University, Columbus, OH, USAThe Ohio State University, Columbus, OH, USAAssistant Professor in Management Sciences, Fisher College of Business, 2017 – 2021Core Faculty, Translational Data Analytics Institute, 2017 – 2021Georgia Tech, Atlanta, GA, USAGeorgia Institute of Technology, Atlanta, GA, USAPostdoctoral Fellow, Tennenbaum Institute, 2015 – 2017EducationGeorgia Tech, Atlanta, GA, USAGeorgia Institute of Technology, Atlanta, GA, USAPh.D. in Industrial Engineering (Minor in Economics), 2015Dissertation: Computational Analysis for Technological Innovation in Complex Enterprise Systems- Co-chairs: William B. Rouse, Rahul C. Basole- Committee Members: Leon F. McGinnis, Nicoleta Serban, Raul O. Chao (external; UVA Darden)UC Berkeley, CA, USAUniversity of California, Berkeley, CA, USAMaster of Information Management and Systems (Management of Technology Certificate), 2010Seoul National University, South KoreaSeoul National University, Seoul, South KoreaB.S. in Electrical Engineering (summa cum laude), 2008PublicationsAllUTD24FT50ABSUTD24 ↗FT50 ↗ABS ↗AllUTD24FT50ABSUTD24 ↗FT50 ↗ABS ↗[31]Obligatory responses to FDA inspection outcomes and future drug shortagesWang Y, Ball G, Anand G, Park H (2025). Manufacturing & Service Operations Management.UTD24FT50ABS3[30]Are All Generic Drugs Created Equal? An Empirical Analysis of Generic Drug Manufacturing Location and Serious Drug Adverse EventsNoh IJ, Gray J, Ball GP, Wright Z, Park H (2025). Production and Operations Management.UTD24FT50ABS4[29]HaluCheck: Explainable and verifiable automation for detecting hallucinations in LLM responsesHeo S, Son S, Park H (2025). Expert Systems with Applications, 272(126712).[28]Visualization system to identify structurally vulnerable links in OHT railway network in semiconductor FAB using betweenness centralityChoi J, Park Y, Choi Y, Kim S, Lee H, Park H (2024). PLoS ONE, 19(7): e0307059.[27]Gender and Serious Drug Recalls: A Textual Sentiment Analysis of Drug Reviews on WebMDBall GP, Bavafa H, Blanco C, Park H, Wowak KD (2024). Production and Operations Management.UTD24FT50ABS4[26]Complex Business Ecosystem Intelligence Using AI-Powered Visual AnalyticsBasole RC, Park H, Seuss CD (2024). Decision Support Systems, 178: 114133.ABS3[25]Rare is Beautiful? The Interplay Between Rareness, Technology Search, and Technology ValueLee J, Jung HJ, Park H (2023). Production and Operations Management, 32(4): 1019-1040.UTD24ABS4[24][Book Review] A History of Data Visualization and Graphic CommunicationPark H (2022). Journal of the American Statistical Association, 117(539): 1601-1603.ABS4[23]When to Signal? Contingencies for Career-Motivated Contributions in Online Collaboration CommunitiesLee J, Park H, Zaggl M (2022). Journal of the Association for Information Systems, 23(6): 1386-1419.ABS4*[22]Vessel Sharing and its Impact on Maritime Operations and Carbon EmissionsPark H, Blanco C, Bendoly E (2022). Production and Operations Management, 31(7): 2925-2942.UTD24FT50ABS4[21]Extended Graph Formulation for the Inequity Aversion Pricing Problem on Social NetworksChopra S, Park H, Shim S (2022). INFORMS Journal on Computing, 34(3): 1327-1344.UTD24ABS3[20]Interfirm Collaboration and Firm Value in Software Ecosystems: Evidence from Cloud ComputingBasole RC, Park H (2019). IEEE Transactions on Engineering Management, 66(4): 568-582.ABS3[19]Visual Analysis of Venture Similarity in Entrepreneurial EcosystemsBasole RC, Park H, Chao RO (2019). IEEE Transactions on Engineering Management, 66(3): 368-380.ABS3[18]Structural Anatomy and Evolution of Supply Chain Alliance Networks: A Multi-Method ApproachPark H, Bellamy MA, Basole RC (2018). Journal of Operations Management, 63: 79-96.UTD24FT50ABS4*[17]Tua Culpa: When an Organization Blames its Partner for Failure in a Shared TaskPark BS, Park H, Ramanujam R (2018). Academy of Management Review, 43(4): 792-811.UTD24FT50ABS4*[16]ecoxight: Discovery, Exploration and Analysis of Business Ecosystems using Interactive VisualizationBasole RC, Srinivasan A, Park H, Patel S (2018). ACM Transactions on Management Information Systems, 9(2).[15]Revealing Community Structures by Ensemble Clustering using Group DiffusionIvannikova E, Park H, Hämäläinen T, Lee K (2018). Information Fusion, 42: 24-36.[14]Graphiti: Interactive Specification of Attribute-based Edges for Network Modeling and VisualizationSrinivasan A, Park H, Endert A, Basole RC (2018). IEEE Transactions on Visualization and Computer Graphics, 24(1): 226-235.TOP CS[13]Two-Sided Platform Competition with Multihoming Agents: An Empirical Study on the Daily Deals MarketKim B-C, Lee J, Park H (2017). Information Economics and Policy, 41: 36-53.[12]Visualization of Innovation in Global Supply Chain NetworksBasole RC*, Bellamy MA*, Park H* (2017). Decision Sciences, 48(2): 288-306.ABS3[11]Visual Analytics for Supply Network Management: System Design and EvaluationPark H, Bellamy MA, Basole RC (2016). Decision Support Systems, 91: 89-102.ABS3[10]Bicentric Diagrams: Design and Applications of a Graph-Based Relational Set Visualization TechniquePark H*, Basole RC* (2016). Decision Support Systems, 84: 64-77.ABS3[9]Computational Analysis and Visualization of Global Supply Network RisksBasole RC, Bellamy MA, Park H, Putrevu J (2016). IEEE Transactions on Industrial Informatics, 12(3): 1206-1213.[8]Project Selection in NIH: A Natural Experiment from ARRAPark H, Lee J, Kim BC (2015). Research Policy, 44(6): 1145-1159.FT50ABS4*[7]Understanding Variations in Pediatric Asthma Care Processes in the Emergency Department using Visual AnalyticsBasole RC, Braunstein M, Kumar V, Park H, Kahng M, Chau DHP, Tamersoy A, Hirsh DA, Serban N, Bost J, Lesnick B, Schissel BL, Thompson M (2015). Journal of the American Medical Informatics Association (JAMIA), 22(2): 318-323.[6]Understanding Business Ecosystem Dynamics: A Data-Driven ApproachBasole RC, Russell MG, Hutamaki J, Rubens N, Still K, Park H (2015). ACM Transactions on Management Information Systems, 6(2).[5]Visual Analytics for Early-Phase Complex Engineered System Design SupportBasole RC, Qamar A, Park H, Paredis C, McGinnis LF (2015). IEEE Computer Graphics and Applications, 35(2): 41-51.[4]Coopetition and Convergence in the ICT EcosystemBasole RC, Park H, Barnett BC (2015). Telecommunications Policy, 39(7): 537-552.[3]Dependence Clustering, a Method Revealing Community Structure with Group DependencePark H, Lee K (2014). Knowledge-Based Systems, 60: 58-72.[2]Challenges and Opportunities for Enterprise Transformation ResearchBasole RC, Bellamy MA, Clear T, Dabkowski M, Monreal J, Park H, Valerdi R, Van Aken EM (2013). Journal of Enterprise Transformation, 3(4): 330-352.[1]Multi-Level Simulations of Health Delivery Enterprises Flight Simulators for Policy, Strategy, Planning, and ManagementPark H, Clear T, Rouse WB, Basole RC, Braunstein M, Brigham KL, Cunningham L (2012). Service Science, 4(3): 253-268.Referred Conference Proceedings[3]Rare is Beautiful? Rare Technological Resources and Value ImplicationsLee J, Jung HJ, Park H (2020). Academy of Management Best Paper Proceedings.[2]Product Innovation Contest on Service Network: Competitive Spillover from Exclusive DealingPark H, Basole RC (2015). Academy of Management Best Paper Proceedings.[1]An (Almost) Free Lunch? Social Recognition and Knowledge Sharing Behavior in a Virtual CommunityPark H, Lee J (2015). Academy of Management Best Paper Proceedings.Book Chapters and Technical Reports[3]DHL Global Connectedness Index 2014Ghemawat P, Altman SA (2014). Chapter II: Visualizing Global Connectedness.[2]Discipline of OrganizingGlushko RJ (2013). Chapter 9: Interactions with Resources.[1]Stochastic Manufacturing and Service SystemsDai JG, Park H (2012). Unpublished lecture notes.Awards, Grants, and HonorsAwardsBest Paper Award Finalist, Academy of Management Operations & Supply Chain Management (OSCM) Division, 2020Best Dissertation Award Runner-up, INFORMS Technology, Innovation Management and Entrepreneurship Section (TIMES), 2017Best Paper Award Winner, Academy of Management Organizational Communication & Information Systems (OCIS) Division, 2017Honorable Mention, 13th Places & Spaces: Mapping Science, 2017Best Student Paper Award Winner, Academy of Management Technology & Innovation Management (TIM) Division, 2015Dr. James R. Chen Award (Best Master’s project in one of three tracks), School of Information, UC Berkeley, 2010Excellence Award (1st place), Idea Competition, CEO of Samsung Electronics, 2005Army Commendation Medal, Department of the United States Army, 2005Presidential Scholar, President of the Republic of Korea, 2002Gold Medalist, 33rd International Chemistry Olympiad, 2001FellowshipsTennenbaum Institute Fellow, Georgia Institute of Technology, 2010-2017McLean Fellowship, Georgia Institute of Technology, 2013-2015Doctoral Fellow, Systems Engineering Research Center, 2014George Fellowship, Health Systems Institute, Georgia Institute of Technology, 2012John Morris Fellowship, School of Industrial and Systems Engineering, Georgia Institute of Technology, 2010-2012Doctoral Fellowship, Korea Foundation for Advanced Studies, 2010-2015Overseas Study Scholarship, Samsung Foundation, 2008-2010Undergraduate Fellowship, Korea Foundation for Advanced Studies, 2002-2008GrantsKorea NRF Emerging Scholar Program (Equivalent to NSF Career), PI, 2022-2027SNU New Faculty Startup Fund, PI, 2021-2024FDA Broad Agency Announcement (BAA) “FDA Quality Management and Pharmaceutical Firm Learning to R",
  "content_length": 23244,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:58"
}