{
  "name": "Hyun Myung",
  "homepage": "http://urobot.kaist.ac.kr/members/professor",
  "status": "success",
  "content": "Prof. Hyun MYUNG – Urban Robotics Lab Address Urban Robotics Lab. (Room No. 3239, E3-2 Bldg.) School of Electrical Engineering KAIST (Korea Advanced Institute of Science and Technology) 291 Daehak-ro Yuseong-gu Daejeon 34141 Republic of Korea Prof. Hyun MYUNG Professor, School of Electrical Engineering: Jan. 2019 ~ Present (Tenured from Mar. 2016) Adjunct Professor, KAIST Robotics Program: Mar. 2008 ~ Present Adjunct Professor, Dept. Civil and Environmental Engineering: Jan. 2019 ~ Present Adjunct Professor, KI for Robotics: Feb. 2016 ~ Present Adjunct Professor, KAIST Future Vehicle Program: Sep. 2022 ~ Present Director, USCRL (Unmanned Swarm CPS Research Lab Center): Feb. 2021 - Present Director, Hanwha Aerospace-KAIST Autonomy Hub Center: July 2023 - Present Chief, KAIST Robotics Program: July 2018 ~ Feb. 2021 Professor, Dept. Civil and Environmental Engineering: 2018.9 ~ 2018.12 (Tenured) Associate Professor, Dept. Civil and Environmental Engineering: 2012.9 ~ 2018.8 (Tenured) Assistant Professor, Dept. Civil and Environmental Engineering: 2008.3 ~ 2012.8 Biography Prof. Hyun Myung received the B.S., M.S., and Ph.D. degrees in electrical engineering from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, South Korea, in 1992, 1994, and 1998, respectively. He was a Senior Researcher with the Electronics and Telecommunications Research Institute, Daejeon, from 1998 to 2002, a CTO and the Director with the Digital Contents Research Laboratory, Emersys Corporation, Daejeon, from 2002 to 2003, and a Principal Researcher with the Samsung Advanced Institute of Technology, Yongin, Korea, from 2003 to 2008. Since 2008, he has been a Professor with the Department of Civil and Environmental Engineering, KAIST, and he has served as the Chief of the KAIST Robotics Program. From 2019, he is a Professor with the School of Electrical Engineering. He led the development of the world-first robots such as JEROS (Jellyfish removal robot), CAROS (wall-climbing drone), Mole-bot, and DreamWaQer (Blind-walking quadruped robot). He received 2015 KAIST Top 10 Research Accomplishment Award, 2018 KAIST Joint Research Award, Prime Minister’s Citation Award at 2018 Nat’l Science Day, 2022 KAIST Research Prize, Champion in 2023 IEEE ICRA AQRC (Autonomous Quadruped Robot Challenge), 1st place in 2023 IEEE ICRA HILTI SLAM Challenge LiDAR Session, and CES (Consumer Electronics Show) 2023 Innovation Award. His current research interests include autonomous robot navigation, Spatial AI, SLAM (simultaneous localization and mapping), SHM (structural health monitoring), and swarm robots. Google Scholar: LinkORCID: 0000-0002-5799-2026 Education Sep. 1998 Doctoral degree (Ph.D.) KAIST, Electrical Engineering (Subject: Intelligent Automatic Control) Feb. 1994 Master degree KAIST, Electrical Engineering Feb. 1992 Bachelor degree KAIST, Electrical Engineering (Summa Cum laude) Feb. 1988 High School Gwangju Science Academy Employment History 2008.3 ~ Present Professor KAIST 2016.2.~ 2017.2 Visiting Scholar University of California, Davis 2003.7.1 ~ 2008.2 Principal Researcher Samsung Advanced Institute of Technology, Robot Navigation Group, Micro Systems Lab., http://www.sait.sec.co.kr 2002.2 ~ 2003.6 CTO and Director of Digital Contents Research Lab. Emersys Corp. http://www.emersys.co.kr 1998.9 ~ 2002.1 Senior Researcher ETRI (Electronics and Telecommunications Research Institute), Virtual Reality R&D Center, http://www.etri.re.kr Awards Best Paper Award, ICCAS (Int’l Conf. Control, Automation, and Systems), Songdo, Incheon, Nov. 6, 2025. Best Paper Award by KFMES, ICROS’25 Annual Conference, Jeonju, June 26, 2025. 1st Place Overall, NSS (Nothing Stands Still) Challenge, IEEE International Conference on Robotics and Automation (ICRA)’25, 2025. 2nd Place, The 3rd QRC (Quadruped Robot Challenge), IEEE International Conference on Robotics and Automation (ICRA)’25, Atlanta, USA, 2025. KAIST Proud Alumni Award (KAIST 자랑스러운 동문상), KAIST Alumni Association (KAIST 총동문회), Jan. 17, 2025. IJCAS Best Senior Editor Award 2024, IJCAS (Int’l Journal of Control, Automation, and Systems), Jan. 10, 2025. Grand Prize, 2024 Technology Innovation Awards of College of Engineering (기술혁신 대상), KAIST, Dec. 17, 2024. The Hanbit Awards (한빛대상), Oct. 24, 2024. 2nd Place in Autonomous at the 2nd QRC (Quadruped Robot Challenge), IEEE ICRA’24, Yokohama, Japan, May 14-16, 2024. RED Show Award (RED Show 일반 부문 우수상), KRoC 2024, Feb. 23, 2024. KAIST Breakthroughs『Readers’ Choice Award』, Feb. 21, 2024. 2023 KAISTian of the Year Award, KAIST, Feb. 14, 2024. Best Paper Award, RiTA 2023 (The 11th International Conference on Robot Intelligence Technology and Applications), Xi’an Jiaotong-Liverpool University, Taicang, China, Dec. 6-8, 2023. 2023 KROS Academic Award (한국로봇학회 학술상), 한국로봇학회 (KROS), Dec. 1, 2023. 2023 IEEE Academic Activity Award (IEEE 학술활동상), ICROS (제어·로봇·시스템학회), Oct. 19, 2023. Champion, IEEE International Conference on Robotics and Automation (ICRA) Autonomous Quadruped Robot Challenge (QRC), May 29 – June 2, 2023. 1st Place Overall, LiDAR Single Session Category, IEEE International Conference on Robotics and Automation (ICRA)’23 HILTI SLAM Challenge, 2023. 1st Place in Academia, Vision-Only Single Session Category, IEEE International Conference on Robotics and Automation (ICRA)’23 HILTI SLAM Challenge, 2023. Best Paper Award, IEEE RA-L (Robotics and Automation Letters) 2022, June 1, 2023. Best poster award (포스터 일반 부문 우수논문상), “특징선 기반 SLAM을 위한 소실점 정보의 Loss 함수 개발,” KRoC 2023, Feb. 17, 2023. RED show award (RED Show 일반 부문 우수상), “전장 상황에서의 무인정찰을 위한 자율비행 드론,” KRoC 2023, Feb. 17, 2023. RED show award (RED Show 학부생 부문 우수상), “B2Bot Biomimetic Beetle Robot Capable of Walking and Flying,” KRoC 2023, Feb. 17, 2023. KAIST Research Prize (개교 52주년 기념 연구상), Feb. 6, 2023. KAIST Technology Innovation Award (기술혁신상), Dec. 22, 2022. CES (Consumer Electronics Show) 2023 Innovation Award, Robotics Field (with Hills Robotics), Nov. 17, 2022. 2022 Future Challenge Defense Technology Contest (2022년 미래도전 국방기술 경진대회 장려금 수상), Nov. 6, 2022. People of the Year Award, AI One Team SUMMIT 2022, Sofitel Ambassador Seoul, Oct. 25, 2022. 2nd CASH Prize (USD 3,000) in Academia, HILTI SLAM Challenge, Future of Construction Workshop, IEEE Int’l Conference on Robotics and Automation (ICRA), Philadelphia, USA, May 23-27, 2022. Excellence Award for RED (Robot Engineering & Design) Show, KRoC (Korea Robotics Conference), Pyungchang, May 11-14, 2022. The Best Poster Award, ICCAS (Int’l Conf. Control, Automation, and Systems) 2021, Jeju, Korea, Oct. 12-15, 2021. AFCV (Asian Federation of Computer Vision) Best Paper Award, KRoC 2021 (Korea Robotics Conference), Phoenix, Pyungchang, May 19-22, 2021. KAIST Breakthroughs 『Readers’ Choice Award』, Feb. 17, 2021. Outstanding Service Award, IJCAS (Int’l Journal of Control, Automation, and Systems), Jan. 6, 2021. KRI (KROS Robotics Innovation) 2020 Award, KROS (한국로봇학회), Dec. 4, 2020. Encouragement Award, Drone Image Challenge for Civil Infrastructures (사회기반시설물 드론 촬영 경진대회 장려상), “SLAM 기반 자율 비행 드론을 활용한 교량 시설물 검사,” KSCE (대한토목학회) 주최, Oct. 23, 2020. The Best Paper Award, 2020 IEMEK (Institute of Embedded Engineering of Korea) Conference (대한임베디드공학회 추계학술대회, Nov. 14, 2020. The Student Best Paper Award, “Normal Distributions Transform is Enough: Real-time 3D Scan Matching for Pose Correction of Mobile Robot Under Large Odometry Uncertainties,” ICCAS (Int’l Conf. Control, Automation, and Systems) 2020, Busan, Oct. 13-16, 2020. Academic Activity Award, IJCAS (Int’l Journal of Control, Automation, and Systems), Dec. 31, 2019. Grand Prize, Drone Image Challenge for Civil Infrastructures (사회기반시설물 드론 촬영 경진대회 최우수상), KSCE (대한토목학회) 주최, Oct. 18, 2019. The Best Paper Award, ICROS (Institute for Control, Robotics, and Systems) Annual Conference, May 2019. The Best Paper Award, ISR (Intelligent Service Robotics), Int’l Conf. on Ubiquitous Robots, Honolulu, Hawaii, June 28, 2018. KAIST Synergic Research Prize (융합연구상) (with Prof. Junmo Kim, Dept. EE), May 25, 2018. Prime Minister’s Citation Award at 2018 National Science Day (과학의 날 기념 국무총리 표창), April 20, 2018. Included in Marquis Who’s Who in the World 2020, 2019, 2018, 2017 (Albert Nelson Marquis Lifetime Achievement Award), 2016, 2015, 2014, 2013, 2012 (30th Pearl Anniversary Edition) Included in TOP 100 Engineers 2015, 2013, IBC (Int’l Biographical Center, Cambridge, England) IROS Academic Award, ICROS (Institute for Control, Robotics, and Systems), Oct. 18, 2016. Selected as KAIST’s Top 10 research accomplishments of 2015 (KAIST 대표 성과 10선 선정), Mar. 2016. The Best Paper Award, ICROS (Institute for Control, Robotics, and Systems) Annual Conference, March 2016. Awarded Yonam Overseas Visiting Scholar Fellowship, LG Yonam Foundation (LG 연암재단 해외 연수 장려금), June 2015. The Best Poster Award, URAI (Int’l Conf. Ubiquitous Robots and Ambient Intelligence) 2015, KINTEX. Oct. 2015. The Best Presentation Award, ICCAS (Int’l Conf. Control, Automation, and Systems) 2015, Busan, Oct. 2015. Academic Activity Award, IJCAS (Int’l Journal of Control, Automation, and Systems), Dec. 15, 2014 The Best Paper Award, Journal of KROS (Korea Robotics Society), Dec. 5, 2014. The Best Paper Award, ICROS (Institute for Control, Robotics, and Systems) Daejeon Chungcheong Section Annual Conference (대전충청지부 학술대회), Korea, Nov. 19, 2014. Selected as the Exemplary Achievements of 2013 that put Each College in the Spotlight, KAIST, Apr. 2014. Best Paper Award from KIPO (Korea Intellectual Property Office) (최우수 논문상 특허청장상), Oct. 2013. Best Paper Award, 2013 ICROS (Institute of Control, Robotics and Systems) Annual Conference, May 2013. KAIST Technology Innovation Award (기술혁신상), KAIST, Dec. 2012. ICROS (Institute of Control, Robotics and Systems) Academic Activity Award, Oct. 2012. The Best Paper Prize, 2012 KROC (Korea Robotics Society Annual Conference), 2012. The Best Paper Prize, 2012 ICROS (Institute of Control, Robotics and Systems) Daejeon-Chungcheong Chapter Annual Co",
  "content_length": 36116,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:52"
}