{
  "name": "Hyung-Chan An",
  "homepage": "http://opt.yonsei.ac.kr/an",
  "status": "success",
  "content": "Hyung-Chan An Hyung-Chan An I am an Associate Professor in the Department of Computer Science and Engineering at Yonsei University. Before joining Yonsei University, I was a post-doc at EPFL, under the supervision of Ola Svensson and Aleksander Mądry. I received my Ph.D. in Computer Science from Cornell University. My Ph.D. advisors are David Shmoys and Bobby Kleinberg. I received my B.S. in Computer Science and Engineering from Seoul National University. I am looking for motivated students who are interested in pursing a graduate degree or internship in the area of approximation algorithms and combinatorial optimization. If interested, please contact me via e-mail. Contact information D721 Engineering Hall IV Yonsei University 50 Yonsei-ro, Seodaemun-gu Seoul 03722 Korea (Republic of) Teaching CSI3108 Algorithm Analysis (Yonsei University, Fall 2016-2021) CSI2103 Data Structures (Yonsei University, Spring 2016-2021) CSI6107 Introduction to Approximation Algorithms (Yonsei University, Spring 2018, Spring 2021) CSI6104 Combinatorial Optimization (Yonsei University, Spring 2017, Spring 2019) CSI6529 Linear Programming for Computer Scientists (Yonsei University, Fall 2016, Spring 2020) CSI7611 Approximation Algorithms (Yonsei University, Spring 2016) CS4820 Introduction to Analysis of Algorithms (Cornell University, Summer 2012) Research papers International Journals and Conferences H.-C. An, and R. Kleinberg. A diameter-revealing proof of the Bondy-Lovász lemma. Information Processing Letters, 174, 106194, 2022. We present a strengthened version of a lemma due to Bondy and Lovász. This lemma establishes the connectivity of a certain graph whose nodes correspond to the spanning trees of a 2-vertex-connected graph, and implies the k=2 case of the Győri-Lovász Theorem on partitioning of k-vertex-connected graphs. Our strengthened version constructively proves an asymptotically tight O(|V|2) bound on the worst-case diameter of this graph of spanning trees. K. Kim, Y. Shin, and H.-C. An. Making three out of two: three-way online correlated selection. In ISAAC 2021: Proceedings of the 32nd International Symposium on Algorithms and Computation, pages 49:1-49:17, 2021. [slides (short)] Two-way online correlated selection (two-way OCS) is an online algorithm that, at each timestep, takes a pair of elements from the ground set and irrevocably chooses one of the two elements, while ensuring negative correlation in the algorithm's choices. Fahrbach, Huang, Tao, and Zadimoghaddam first invented OCS to solve the edge-weighted online bipartite matching problem, and posed the following tantalizing open question: Can we obtain n-way OCS for n>2, in which the algorithm can be given n>2 elements to choose from at each timestep? In this paper, we affirmatively answer this open question by presenting a three-way OCS. H.-C. An, and H. Yang. Fully adaptive stochastic handling of soft-errors in real-time systems. IEEE Access, 9, pages 155058-155071, 2021. In the design of real-time systems, it is important to take soft-error tolerance into account. While hardening techniques such as error detection and correction enable us to better tolerate soft-errors, they are inevitably accompanied with execution time overhead. In order to mitigate its impact, Chen et al. proposed to identify the (m,k)-constraints of real-time tasks, which demand that at least m jobs out of k consecutive task invocations must be fault-free, and to design hardening policies based on it. In this paper, we propose a new method to design hardening policies that are adaptive and stochastic. At the heart of our method is a new linear program (LP) formulation that finds an adaptive stochastic policy optimizing the CPU utilization. H.-C. An, R. Kleinberg, and D. B. Shmoys. Approximation algorithms for the bottleneck asymmetric traveling salesman problem. ACM Transactions on Algorithms, 17(4), pages 35:1-35:12, 2021. [slides (long)] (Conference version) H.-C. An, R. D. Kleinberg, and D. B. Shmoys. Approximation algorithms for the bottleneck asymmetric traveling salesman problem. In APPROX 2010: Proceedings of the 13th International Workshop on Approximation Algorithms for Combinatorial Optimization Problems, pages 1-11, 2010. We present the first nontrivial approximation algorithm for the bottleneck asymmetric traveling salesman problem. Given an asymmetric metric cost between n vertices, the problem is to find a Hamiltonian cycle that minimizes its bottleneck (or maximum-length edge) cost. We achieve an O(log n / log log n) approximation performance guarantee by giving a novel algorithmic technique to shortcut Eulerian circuits while bounding the lengths of the shortcuts needed. This allows us to build on the result of Asadpour, Goemans, Mądry, Oveis Gharan, and Saberi to obtain this guarantee. K. Kim, Y. Shin, and H.-C. An. Constant-factor approximation algorithms for the parity-constrained facility location problem. In ISAAC 2020: Proceedings of the 31st International Symposium on Algorithms and Computation, pages 21:1-21:17, 2020. [slides (long)] Facility location is a prominent optimization problem that has guided a large volume of studies in combinatorial optimization. However, unlike other problems, it was not previously known how this problem behaves in conjunction with parity constraints. In this paper, we present the first constant-factor approximation algorithm for the facility location problem with parity constraints. Although the unconstrained facility location problem as a relaxation for the parity-constrained generalization has unbounded gap, we demonstrate that it yields a structured solution whose parity violation can be corrected at small cost. H.-C. An, A. Norouzi-Fard, and O. Svensson. Dynamic facility location via exponential clocks. ACM Transactions on Algorithms, 13(2), pages 21:1-21:20, 2017. [slides (short)] (Conference version) H.-C. An, A. Norouzi-Fard, and O. Svensson. Dynamic facility location via exponential clocks. In SODA 2015: Proceedings of the 26th Annual ACM-SIAM Symposium on Discrete Algorithms, pages 708-721, 2015. Invited to a special issue of ACM Transactions on Algorithms. We present a new LP-rounding algorithm for facility location problems, which yields the first constant approximation algorithm for the dynamic facility location problem. This problem is a generalization of the classic facility location problem, proposed by Eisenstat, Mathieu, and Schabanel to model the dynamics of evolving social/infrastructure networks. Our algorithm, based on competing exponential clocks, exhibits several properties that distinguish our approach from previous LP-roundings for facility location problems. We demonstrate that these properties enable us to apply our new algorithm to the dynamic problem. H.-C. An, M. Singh, and O. Svensson. LP-based algorithms for capacitated facility location. SIAM Journal on Computing, 46(1), pages 272-306, 2017. [slides (long)] [slides (short)] (Conference version) H.-C. An, M. Singh, and O. Svensson. LP-based algorithms for capacitated facility location. In FOCS 2014: Proceedings of the 55th Annual IEEE Symposium on Foundations of Computer Science, pages 256-265, 2014. Invited to a special issue of SIAM Journal on Computing. Linear programming (LP) has played a key role in the study of algorithms for combinatorial optimization problems. In particular, a variety of LP-based methodologies have been applied to and evolved from the uncapacitated facility location problem. Unfortunately, this collection of powerful techniques had not yet been applicable to the more general capacitated facility location problem. In this paper, we present a linear programming relaxation with constant integrality gap for capacitated facility location. Our algorithmic proof of integrality gap is obtained by finally accessing the rich toolbox of LP-based methodologies: we present a constant factor approximation algorithm based on LP-rounding. H.-C. An, H. Yang, and S. Ha. A formal approach to power optimization in CPSs with delay-workload dependence awareness. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 35(5), pages 750-763, 2016. A conference version by Yang and Ha appeared in ISLPED 2015. The interaction between the cyber and physical components of CPSs induces delay-workload dependence, creating the unique challenge of power optimization with delay-workload dependence awareness. In this paper, we identify this challenge and present the first formal and comprehensive model to enable rigorous investigations on this topic. We propose a simple power management policy, and show that this policy achieves a best possible notion of optimality. We also experimentally validate the efficiency of our policy. H.-C. An, R. Kleinberg, and D. B. Shmoys. Improving Christofides' algorithm for the s-t path TSP. Journal of the ACM, 62(5), pages 34:1-34:28, 2015. [slides (long)] [slides (short)] (Conference version) H.-C. An, R. Kleinberg, and D. B. Shmoys. Improving Christofides' algorithm for the s-t path TSP. In STOC 2012: Proceedings of the 44th ACM Symposium on Theory of Computing, pages 875-886, 2012. Presented in a single-track session of STOC 2012. Finalist of George E. Nicholson 2013 Student Paper Competition. We present a deterministic (1+√5)/2-approximation algorithm for the s-t path TSP for an arbitrary metric. Given a symmetric metric cost between n vertices including two prespecified endpoints, the problem is to find a shortest Hamiltonian path between the two endpoints. The present result surpasses the 20-year-old barrier of 5/3 originating from Hoogeveen's analysis of the natural path-variant of Christofides' algorithm. The present techniques can be applied to other optimization problems as well: these applications include the prize-collecting s-t path problem and the unit-weight graphical metric s-t path TSP. H.-C. An, A. Bhaskara, C. Chekuri, S. Gupta, V. Madan, and O. Svensson. Centrality of trees for ca",
  "content_length": 12879,
  "method": "requests",
  "crawl_time": "2025-12-01 13:21:53"
}