{
  "name": "Håvard Dagenborg Johansen",
  "homepage": "https://en.uit.no/ansatte/person?p_document_id=43734",
  "status": "success",
  "content": "Dagenborg, Håvard | UiT Skip to main content Unit startpage Employees Håvard Dagenborg Professor Department of Computer Science havard.dagenborg@uit.no +4777646738 +47 91110987 Tromsø Håvard Dagenborg About Research and teaching Job description Prof. Håvard J. Dagenborg teaches and researches computer security and privacy topics. His work in overlay networks received great acclaim in the research community, providing a completely different way of approaching the problem of Byzantine fault tolerance. Dagenborg is currently focused on secure remote execution of code using Intel SGX, reactive information-flow policies, and energy-efficient blockchains based on Byzantine consensus. Dagenborg is a hands-on, full-stack software developer. He has up-to-date expertise with modern software technologies like GO, TypeScript, iOS/Android platforms, and Docker. Prof. Dagenborg also has competence in machine learning and interdisciplinary experiences in the medical, sports, and psychology domains. Work areas Research infrastructure / Research data management / Mobile / Software architecture / Applications / Servers and operating services / Security / Systems design / Interfaculty research areas Publications Scientific articles and book chapters Other Anne Bumiller, Elisavet Kozyri, Håvard Dagenborg : Privacy Preserving Identity Federation: A Literature Study ACM Computing Surveys 01. July 2025 DOI Mohsin Khan, Elisavet Kozyri, Dag Johansen, Håvard Dagenborg : Survey of Lightweight Hardware-Based Hash Functions for Security in Constrained IoT Devices IEEE Access 17. September 2025 DOI Megumi Ochi, Håvard Dagenborg : Chapter 8: Online War-crime Archives: A Call for a Universal Guideline 2025 Megumi Ochi, Håvard Dagenborg : Online War-crime Archives: A Call for a Universal Guideline Social Science Research Network (SSRN) 2025 DOI Stefan Kutschera, Wolfgang Slany, Patrick Ratschiller, Sarina Gursch, Patrick Deininger, Håvard Johansen Dagenborg : Incidental Data: A Survey towards Awareness on Privacy-Compromising Data Incidentally Shared on Social Media Journal of Cybersecurity and Privacy (JCP) 2024 DOI / ARKIV Enrico Tedeschi, Håvard Johansen Dagenborg, Dag Johansen, Øyvind Arne Moen Nohr : Mining Profitability in Bitcoin: Calculations of User-Miner Equilibria and Cost of Mining Lecture Notes in Computer Science (LNCS) 2024 DOI / ARKIV Cise Midoglu, Andreas Kjæreng Winther, Matthias Boeker, Susann Dahl Pettersen, Sigurd Pedersen, Nourhan Ragab et al.: A large-scale multivariate soccer athlete health, performance, and position monitoring dataset Scientific Data 2024 DOI / ARKIV Areeg Samir Ahmed Elgazazz, Håvard Dagenborg, Dag Johansen : QMConn: A Self-Healing Controller for Microservices Using Q-Learning and Markov Decision Processes 2024 DOI Areeg Samir Ahmed Elgazazz, Håvard Johansen Dagenborg, Nabil El Ioini : Misconfiguration of Cluster and IoT Systems Recovery: Extended Experiments 2024 DOI / ARKIV Mohsin Khan, Håvard Johansen Dagenborg, Dag Johansen : Performance Evaluation of Lightweight Stream Ciphers for Real-Time Video Feed Encryption on ARM Processor Future Internet 2024 DOI / ARKIV Tor-Arne Schmidt Nordmo, Michael Riegler, Håvard Johansen Dagenborg, Dag Johansen : Arctic HARE: A Machine Learning-Based System for Performance Analysis of Cross-Country Skiers 2023 DOI / ARKIV Stefan Kutschera, Wolfgang Slany, Patrick Ratschiller, Sarina Gursch, Håvard Dagenborg : MRNG: Accessing Cosmic Radiation as an Entropy Source for a Non-Deterministic Random Number Generator Entropy 2023 DOI / ARKIV Areeg Samir Ahmed Elgazazz, Håvard Johansen Dagenborg : Self-Healing Misconfiguration of Cloud-Based IoT Systems Using Markov Decision Processes International Conference on Cloud Computing and Services Science (CLOSER) 2023 DOI Areeg Samir Ahmed Elgazazz, Håvard Dagenborg : A Self-Configuration Controller To Detect, Identify, and Recover Misconfiguration At IoT Edge Devices and Containerized Cluster System ICISSP 2023 DOI / ARKIV Aakash Sharma, Katja Pauline Czerwinska, Dag Johansen, Håvard Johansen Dagenborg : Capturing Nutrition Data for Sports: Challenges and Ethical Issues 2023 DOI / ARKIV Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Håvard Dagenborg, Pål Halvorsen, Michael Alexander Riegler, Dag Johansen : Fishing Trawler Event Detection: An Important Step Towards Digitization of Sustainable Fishing 2023 DOI / ARKIV Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Bjørn Aslak Juliussen, Steven Hicks, Vajira L B Thambawita, Håvard D. Johansen et al.: Njord: a fishing trawler dataset 2022 DOI / ARKIV Tor-Arne Schmidt Nordmo, Ove Kvalsvik, Svein Ove Kvalsund, Birte Hansen, Pål Halvorsen, Steven Hicks et al.: FishAI: Sustainable Commercial Fishing Challenge Nordic Machine Intelligence (NMI) 2022 DOI / ARKIV Debesh Jha, Ashish Rauniyar, Håvard D. Johansen, Dag Johansen, Michael Alexander Riegler, Pål Halvorsen et al.: Video Analytics in Elite Soccer: A Distributed Computing Perspective Proceedings of the IEEE Sensor Array and Multichannel Signal Processing Workshop 2022 DOI / ARKIV Nikhil Kumar Tomar, Debesh Jha, Michael Riegler, Håvard D. Johansen, Dag Johansen, Jens Rittscher et al.: FANet: A Feedback Attention Network for Improved Biomedical Image Segmentation IEEE Transactions on Neural Networks and Learning Systems 2022 DOI / ARKIV Enrico Tedeschi, Tor-Arne Schmidt Nordmo, Dag Johansen, Håvard D. Johansen : On Optimizing Transaction Fees in Bitcoin using AI: Investigation on Miners Inclusion Pattern ACM Transactions on Internet Technology (TOIT) 2022 DOI / ARKIV Pietro Randine, Aakash Sharma, Gunnar Hartvigsen, Håvard D. Johansen, Eirik Årsand : Information and communication technology-based interventions for chronic diseases consultation: Scoping review International Journal of Medical Informatics 2022 DOI / ARKIV Aakash Sharma, Thomas Bye Nilsen, Sivert Johansen, Dag Johansen, Håvard D. Johansen : Designing a Service for Compliant Sharing of Sensitive Research Data Lecture Notes in Computer Science (LNCS) 2022 DOI / ARKIV Joakim Aalstad Alslie, Aril Bernhard Ovesen, Tor-Arne Schmidt Nordmo, Håvard D. Johansen, Pål Halvorsen, Michael Riegler et al.: Áika: A Distributed Edge System for AI Inference Big Data and Cognitive Computing 2022 DOI / ARKIV Areeg Samir Ahmed Elgazazz, Håvard D. Johansen : Technical Viewpoint of Challenges, Opportunities, and Future Directions of Policy Change and Information-Flow in Digital Healthcare Systems 2022 ARKIV Lars Brenna, Isak Sunde Singh, Håvard D. Johansen, Dag Johansen : TFHE-rs: A library for safe and secure remote computing using fully homomorphic encryption and trusted execution environments Array 2022 DOI / ARKIV Vajira L B Thambawita, Steven Hicks, Jonas L Isaksen, Mette H. Stensen, Trine B. Haugen, Jørgen K Kanters et al.: DeepSynthBody: the beginning of the end for data deficiency in medicine 2021 DOI Aril Bernhard Ovesen, Tor-Arne Schmidt Nordmo, Håvard D. Johansen, Michael Alexander Riegler, Pål Halvorsen, Dag Johansen : File system support for privacy-preserving analysis and forensics in low-bandwidth edge environments Information 2021 DOI / ARKIV Debesh Jha, Sharib Ali, Nikhil Kumar Tomar, Michael Alexander Riegler, Dag Johansen, Håvard D. Johansen et al.: Exploring Deep Learning Methods for Real-Time Surgical Instrument Segmentation in Laparoscopy 2021 DOI Debesh Jha, Pia Smedsrud, Dag Johansen, Thomas de Lange, Håvard D. Johansen, Pål Halvorsen et al.: A Comprehensive Study on Colorectal Polyp Segmentation with ResUNet++, Conditional Random Field and Test-Time Augmentation IEEE Journal of Biomedical and Health Informatics 2021 DOI / ARKIV Nikhil Kumar Tomar, Debesh Jha, Sharib Ali, Håvard D. Johansen, Dag Johansen, Michael Riegler et al.: DDANet: Dual Decoder Attention Network for Automatic Polyp Segmentation 2021 DOI Abhishek Srivastava, Debesh Jha, Sukalpa Chanda, Umapada Pal, Håvard D. Johansen, Dag Johansen et al.: MSRF-Net: A Multi-Scale Residual Fusion Network for Biomedical Image Segmentation IEEE Journal of Biomedical and Health Informatics 2021 DOI / ARKIV Mohsin Khan, Håvard Dagenborg, Dag Johansen : Software Benchmarking of NIST Lightweight Hash Function Finalists on Resource-Constrained AVR Platform via ChipWhisperer 2025 DOI Areeg Samir Ahmed Elgazazz, Håvard Johansen Dagenborg, Dag Johansen : QMConn: A Self-Healing Controller for Microservices Using Q-Learning and Markov Decision Processes 2024 Aakash Sharma, Katja Pauline Czerwinska, Dag Johansen, Håvard Dagenborg : Capturing Nutrition Data for Sports: Challenges and Ethical Issues 2023 ARKIV Håvard Johansen Dagenborg : Data Collection, Privacy, and Data Security 2023 Areeg Samir Ahmed Elgazazz, Håvard Johansen Dagenborg : A Self-Configuration and Healing Controller To Analyze Misconfigurations of Clusters and IoT Edge Devices 2023 ARKIV Areeg Samir Ahmed Elgazazz, Abdo Al-Wosabi, Mohsin Khan, Håvard Johansen Dagenborg : A Multi-pronged Self-adaptive Controller for Analyzing Misconfigurations for Kubernetes Clusters and IoT Edge Devices 2023 DOI / ARKIV Areeg Samir Ahmed Elgazazz, Håvard Johansen Dagenborg : Adaptive Controller to Identify Misconfigurations and Optimize the Performance of Kubernetes Clusters and IoT Edge Devices 2023 DOI / ARKIV Dag Johansen, Håvard D. Johansen, Michael Riegler : Muligheter og skranker for bruk av teknologi og kunstig intelligens ved forebygging av fiskerikriminalitet 2022 Areeg Samir Ahmed Elgazazz, Håvard Johansen Dagenborg : Managing Healthcare Information Flow Within Multi-Cluster System in Distributed Environment: Challenges, Opportunities and Future Directions International Conference on Cloud Computing and Services Science (CLOSER) 2022 Håvard D. Johansen, Dag Johansen, Bjørn Aslak Juliussen, Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Pål Halvorsen et al.: Sustainable commercial fishing: Digital inspectors to the rescue 2022 Michael Alexander Riegler, Dag Johansen, Bjørn Aslak Juliussen, Tor-Arne Schmidt Nordmo, Aril Bernhard Ovesen, Pål Halvorsen et al.: Njord: An out-",
  "content_length": 11610,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:03"
}