{
  "name": "Hélène Touzet",
  "homepage": "http://cristal.univ-lille.fr/~htouzet",
  "status": "success",
  "content": "Helene Touzet - CRIStAL Hélène Touzet CNRS research director CRIStAL - ESPRIT Cité scientifique 59655 Villeneuve d'Ascq Cedex France +33 (0)3 28 77 85 59 helene.touzet(AT)univ-lille.fr Member of the BONSAI team at CRIStAL Algorithmic bioinformatics The goal of my work is to develop state-of-the-art algorithms in computational biology to analyze DNA, RNA and protein molecules, and help solving problems in biology and medicine. This covers the following topics: high throughput sequencing, metagenomics, noncoding RNA, proteomics. ORCID iD: 0000-0001-5305-9987 idHal: helene-touzet Google scholar profile: google scholar News and resources The article Simultaneous Taxonomic and Sex Identification of Bos and Bison Teeth Using Low-Invasive High-Resolution Mass Spectrometry is accepted at Journal of Proteomics [June 2025] PAMPA (Protein Analysis by Mass Spectrometry for Ancient Species): v2 is available on GitHub. This new release introduces additional functionalities and includes a curated database of mammalian COL1A1 and COL1A2 sequences, along with their associated peptide markers. [March 2025] The preprint PAMPA: a software for peptide markers and taxonomic identification for ZooMS samples in Archaeology and Paleontology is available in bioRxiv [March 2025] The PAMPA software is presented at the IZAZ 2024 conference [November 2024] Karl Baltazart presents his PhD research at the First PAASTA conference: In silico methods for deep time protein sequence reconstruction. [September 2024] MSA for long reads: our paper Automated evaluation of multiple sequence alignment methods to handle third generation sequencing errors has been accepted for publication in PeerJ. See the preprint [June 2024] PAMPA webserver is online (beta version) [May 2024] The article Fascin-1 expression is associated with neuroendocrine prostate cancer and directly suppressed by androgen receptor is accepted at British Journal of Cancer [October 2023] The software SortMeRNA reached the 2000+ citations! See the paper [September 2023] Bioinformatics and SARS-CoV-2: discover the popular science dossier published in Interstices (in French) [May 2023] Adapter trimming in Nanopore reads: Porechop_ABI: discovering unknown adapters in Oxford Nanopore Technology sequencing reads for downstream trimming is published in Bioinformatics Advances. Porechop_ABI is an extension of the original well-known Porechop (R. Wick). The novelty is that it is able to infer the adapter sequences from the raw reads, without any external information. The algorithm uses approximate k-mers and assembly. We also maintain all other great functionalities of Porechop [November 2022] reads2genpop : From sequence reads to genomes and populations, Paris, MNHN (France). Program [September 2022] Plant microRNAs: The book chapter Detecting MicroRNAs in Plant Genomes with miRkwood is available. You can also read the full article in BMC Genomics and discover the software on our server (also on GitHub) [July 2022] Teaching See the webpage. Other duties Member of the scientific board of the French bioinformatics network GDR Bioinformatique Moleculaire: Modelisation et Methodologie Member of the COMESP committee of Institut Pasteur Gender equality representative for CRIStAL. See our website (restricted access) ____________________________________________ I subscribe to an open-access scientific model, and try to make all source code, publication, material and protocols available. Do not hesitate to contact me by email for any request.",
  "content_length": 3515,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:07"
}