{
  "name": "Hélio Côrtes Vieira Lopes",
  "homepage": "http://www-di.inf.puc-rio.br/~lopes",
  "status": "success",
  "content": "Hélio Côrtes Vieira Lopes Hélio Côrtes Vieira Lopes Associate Professor - Department of Informatics - PUC-Rio Site Navigation[Skip] Home Research Industry Publications Publication by kind Journal papers Conference papers Chapters on books Books Publications by area Data Science, Machine Learning and Process Mining Computer Graphics and Visualization Computer Methods for Oil Industry Data Structures and Algorithms Mesh Generation and Simulation Geometry Processing Computational Geometry and Topology Quantitative Methods for Insurance and Finance Students Courses INF2420 - Introduction to Data Science INF1032 - Introduction to Data Science Contact Sidebar[Skip] DI             PUC-Rio    CV-Lattes Short biography Hélio Lopes is an Associate Professor at the Department of Informatics of the Pontifical Catholic University of Rio de Janeiro (PUC-Rio). He has a Doctoral degree in Mathematics (1996), a Master's degree in Informatics (1992) and a Bachelor degree in Computer Engineering (1990).  All of these degrees were obtained at PUC-Rio. He worked from 1996 to 2011 in the Department of Mathematics / PUC-Rio as an (Assistant / Associate) Professor, and for six months of 2001 in the  Computer Science Department at PURDUE University as a Visiting Scholar.He likes to develop and to apply advanced mathematical and computational techniques to solve real-world problems that have engineering, scientific and industrial relevance. In the present, he is particularly interested in Data Science, Machine Learning and Process Mining. In 2017 he received the Business Process Intelligence Challenge (BPIC) Best Report Award at the Academic Category. He has also interest in promoting Innovation Programs for Industrial Digital Transformation. He is the principal investigator of the DASLAB (Data Science Laboratory)  and of the ExACTa initiative (Agile Experimentation. Co-Creation, Digital Transformation). He is also a co-coordinator of the GALGOS Laboratory (optimization algorithms for decision making) and a colaborator of the IDEIAS Laboratory (computer-human interactions, visualization and user-experiences).Hélio Lopes has h-index = 16 on the SCOPUS database, h-index = 14 on the Web of Science database, and h-index = 24 at Google Scholar Citations. The majority of his publications appears at the MENDELEY, ORCID, DBLP and at the ResearchGate portal. His research has been partially sponsored by grants from CNPq, FAPERJ, CAPES and FINEP. Since 1992, he has been applying his research to the development of computer systems for PETROBRAS, mainly in the area of reservoir characterization and in seismic modeling and analysis. He also did some consulting works for other companies like IPIRANGA, IRB-BRASIL RE, MONGERAL AEGON, GLOBO, BIZBANK, SHELL, BR DISTRIBUIDORA, PRODERJ and BRADESCO SEGUROS. He also taught data science, advanced mathematical and computational on-site courses for GLOBO, PETROBRAS, BANCO DO BRASIL, BNDES and VALE. Hélio Lopes is an associate editor of the journals: Computers & Graphics and IEICE Nonlinear Theory and Its Applications (NOLTA). He is also a member of SBC (Brazilian Computer Society) and of the SBMAC (Brazilian Society of Applied and Computational Mathematics). He has been elected for three times the president of the Special Interest Group of Computer Graphics and Image Processing (CEGRAPI) of the SBC (2006-2007, 2013-2015, 2015-2017). He was a general co-chair of SIBGRAPI in 2017 and in 2019, and he was the SIBGRAPI 2007 program co-chair. In SIBGRAPI 2020, he was one of the Invited Speakers.His CURRICULUM VITAE is available in portuguese and in English at the CNPq-Lattes plataform. e-mail: lopes at inf dot puc-rio dot brTel: 55+21+3527-1500 R:4350  Fax: 55+21+3527-1530 Pontifícia Universidade Católica do Rio de Janeiro (PUC-Rio) - Departamento de Informática - Sala 408 RDC Rua Marquês de São Vicente 225, Gávea, Rio de Janeiro, RJ, Brazil, CEP 22451-900 [Back To Top]",
  "content_length": 3936,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:06"
}