{
  "name": "Hüseyin Koçak",
  "homepage": "http://www.math.miami.edu/~hk",
  "status": "success",
  "content": "Home Page of HK Home Page of HK Hüseyin Koçak Electronic Mail: hk@cs.miami.edu hk@math.miami.edu Offices: Personal Office: Ungar 310G. Tel: 305-284-3138 Main Office: Ungar 310A. Tel: 305-284-2268 Fax: 305-284-2264 U.S. Mailing Address: Professor Hüseyin Koçak Department of Computer Science, Chair University of Miami Coral Gables, Florida 33124 U.S.A. Express Mailing Address: Ungar Building 310A 1365 Memorial Drive Coral Gables, Florida, 33146 U.S.A. Scientific Software Development Project: PHASER: A Universal Simulator for Dynamical Systems Built on Java Technology Supported in part by the National Science Foundation. Educational Software Development Project: Computing for Scientists: A A collection of episodes with videos and supporting materials on Computational Science. Select theoretical, computational, and scientific components are presented in a simple yet insightful manner, requiring no more than basic calculus. With Basar Koc. Perl for Biologists: A collection of episodes with videos, codes, and exercises for learning the basics of the Perl programming language through genomics examples. With Basar Koc. Python for Biologists: A collection of episodes with videos, codes, and exercises for learning the basics of the Python programming language through genomics examples. With Basar Koc. R for Biologists: A collection of episodes with videos, codes, and exercises for learning the basics of the R programming language. With Basar Koc. Books: Dynamics and Bifurcations, by J. Hale and H. Koçak. Springer-Verlag, New York, N.Y. (1996). MathSciNet review Differential and Difference Equations Through Computer Experiments, by H. Koçak. Springer-Verlag, New York, N.Y. (1989). MathSciNet review ECM/87. Educational computing in mathematics. Proceedings of the International Congress held at the University of Rome ``La Sapienza'', Rome, June 4--6, 1987. Edited by T. F. Banchoff, I. Capuzzo-Dolcetta, M. Dechamps-Gondim, M. Emmer, H. Koçak and D. L. Salinger. North-Holland Publishing Co., Amsterdam, 1988. x+284 pp. ISBN: 0-444-70456-6 MathSciNet Review Recent Publications: Ocean and Atmospheric Dynamics, Shadowing: Rigorous Computations in Chaotic Dynamical Systems, lossless image compression, and some old favorites. Teaching: CSC 210: Computing for Scientists CSC 405: Computer Science Seminars",
  "content_length": 2323,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:06"
}