{
  "name": "Iacopo Masi",
  "homepage": "http://iacopomasi.github.io",
  "status": "success",
  "content": "Iacopo Masi, Ph.D. | Associate Professor at the University of Rome, La Sapienza @ Computer Science Department Ciao, Welcome · Benvenuto · خوش آمدید · 欢迎 · Bienvenida · ようこそ · ברוך הבא · ترحيب · Accueil · Chào mừng · 歓迎 · добро пожаловать · Willkommen · स्वागत · 환영 · Boas-vindas · kuwakaribisha to my web-page! I am Associate Professor at Sapienza, University of Rome. Till August 2022, I was also Adjunct Research Assistant Professor at the University of Southern California (USC). I am also a researcher interested in computer vision and machine learning. I’d like to answer the question: “How can we teach machines to see like humans do?” I do not like to be formal, but what about a formal, brief bio? Iacopo Masi is Associate Professor in the Computer Science Department at Sapienza, University of Rome, PI and founder of the OmnAI Lab. Till August 2022, he was also Adjunct Research Assistant Professor in the Computer Science Department at the University of Southern California (USC). Previously, Masi was Research Assistant Professor and Research Computer Scientist at the USC Information Sciences Institute (ISI). He has served as an Area Chair for several computer vision conferences (WACVs, ICCV’21, ECCV’22, CVPR’24) and is an Associate Editor for The Visual Computer - International Journal of Computer Graphics. Additionally, he organized an International Workshop on Human Identification at ICCV’17, co-organized the Unlearning and Model Editing (U&Me) workshop at ECCV’24, and is a general chair for ICIAP’25. In 2018, Masi was honored with the prestigious Rita Levi Montalcini Award by the Italian government. His primary research interests revolve around the intersection of machine learning, computer vision, and biometrics. Currently, he is exploring various interconnected lines of research, including adversarial robustness, proactive defense against image manipulation, inverse problems, and generative AI in both the vision and NLP domains.",
  "content_length": 1964,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:13"
}