{
  "name": "Iadh Ounis",
  "homepage": "http://www.dcs.gla.ac.uk/~ounis",
  "status": "success",
  "content": "Iadh Ounis - School of Computing Science Professor Iadh Ounis I am a Professor in the School of Computing Science at the University of Glasgow. I am also currently the Deputy Director/Director of Knowledge Exchange at the Scottish Informatics & Computer Science Alliance (SICSA). Research I am the leader of the Terrier Team, where we are developing and evaluating novel large-scale text information retrieval techniques and applications. In recent years, this has encompassed models for Web search - including selective approaches and search results diversification - as well as expert search, blog search, medical records search, and searching of the physical world through sensors. Moreover, we are addressing the infrastructure aspects of Information Retrieval (part of the Big Data theme) including both efficient indexing - through MapReduce - and retrieval, using technologies such as dynamic pruning, and efficiency prediction. We have regularly participated in several and various TREC tracks using our well-known Terrier search engine and technology since 2002 (The latest release is Terrier 4.1). We are part of the Glasgow IR Group. We currently participate in a number of research projects, including the SUPER FP7 project leveraging social sensors in the management of emergencies, the ESRC iMCD project, which aims to develop services exploring social and sensor networks data in the Glasgow city planning area, and the ESRC Electoral Violence project, dedicated to the development of novel event detection and categorisation approaches that can identify electoral malpractice such as violence during elections. We also collaborate with The National Archives in the Abaca project, which aims to provide tools for the review of government records for sensitivity before their public release. Recently, we also participated in the SMART FP7 project, which aims to develop a search engine for content from social and sensor networks in support of Smart Cities, and the CROSS EPSRC project, dedicated to the real-time first story detection from massive parallel streams. I am always looking for highly motivated PhD students to work in the above general areas of research. Feel free to contact me about this to discuss possible topics of mutual interests and possible funding opportunities. A number of (competitive) PhD scholarships are currently available for IR research topics that I am willing to supervise. Activities I am currently the Deputy Director/Director for Knowledge Exchange of the Scottish Informatics and Computer Science Alliance (SICSA). We run a broad programme of Knowledge Exchange funding and events. Please get in touch if you want to engage with any of our programmes/events. I am involved in The Data Lab Innovation Centre, funded by the Scottish Funding Council (SFC), as a member of its Governance Board as well as a member of its Innovation Advisory Group. The Data Lab aims to facilitate and enhance knowledge transfer between academia, industry and the public sector in the area of data science. I have chaired a number of major information retrieval-related events. For example, I was Co-chair of the 6th ESSIR 2007 IR summer school, General Chair of the 30th ECIR 2008 IR conference, and General co-chair of the 20th ACM CIKM 2011 conference. More recently, I co-chaired the i-ASC 2014 workshop on Information Access in Smart Cities and the UCUI 2015 workshop on Understanding the City with Urban Informatics. I have led the international TREC Blog and Microblog track initiatives, which explore information seeking behaviour in the blogosphere and microblogging environments, addressing tasks such as opinion mining and retrieval as well as real-time search. I am currently a co-organiser of the NTCIR Math IR task initiative dedicated to the retrieval of content from large-scale mathematical document repositories. I am on the program committees of all major information retrieval conferences and related events, serve on the Editorial Board of the Information Processing & Management journal, and I am on the advisory or steering committees of a number of initiatives. I also regularly give keynotes/invited talks both at international conferences and industry-facing events. I regularly tweet about my activities on Twitter @iadh. Teaching In the recent years, I have taught the following courses: Information Management 2, Database Systems 3, and Advanced Research Readings in Information Retrieval M. I am currently teaching the Information Retrieval 4/M elective course. For several years, I assumed the role of PGT Convenor and Director of the Computing Science PGT programmes. I am still involved in the PGT programmes as an advisor of studies. Google Scholar Page Twitter: @iadh LinkedIn Page Terrier Team Blog Iadh Ounis School of Computing Science University of Glasgow Glasgow G12 8QQ email: iadh.ounis@glasgow.ac.uk tel: +44 141 330 5652 fax: +44 141 330 4913 Research Group Projects XHTML / CSS",
  "content_length": 4955,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:11"
}