{
  "name": "Iain Moffatt",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/iain-moffatt",
  "status": "success",
  "content": "Iain Moffatt - Royal Holloway Research Portal Iain Moffatt Professor Discrete Mathematics and its ApplicationsHead of Department (Mathematics), Department of Mathematics https://orcid.org/0000-0001-8174-6936 EmailIain.Moffattrhul.acuk TW20 0EX Personal profile Research interestsResearch Interests: Algebraic combinatorics, graph theory, and topology. Personal website: https://sites.google.com/view/iainmoffatt/home. My research centers on the interface of combinatorics and topology. I am particularly interested in the ways in which combinatorial and topological structures can be encoded in one another, and in exploiting such connections to solve hard problems in combinatorics and topology. I work extensively with topological extensions of graph polynomials and constructions. I am especially interested in using the additional topological structure to gain new understandings of classical polynomials (such as the chromatic, Tutte and Penrose polynomials), their evaluations, their connections between each other, and their connections with quantum invariants of knots and statistical mechanics. I am also interested in in quantum and finite-type invariants of knots and applications of geometric group theory to knot theory. In addition, I have recently been working on applications of graph theory to biology. Education/Academic qualificationMathematics, MSci, University of St AndrewsMathematics, PhD, University of Warwick External positionsEditor-in-Chief, Newsletter, London Mathematical Society1 Dec 2016 → 1 Dec 2019 KeywordsMathematicscombinatoricsGraph Theory Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 41 Article 6 Chapter 3 Book 1 Conference contribution Research output per year Research output per year An activities expansion of the transition polynomial of a multimatroidMerino, C., Moffatt, I. & Noble, S., 24 Jun 2025, (E-pub ahead of print) In: SIAM Journal on Discrete Mathematics. 39, 2, p. 1372-1407 36 p.Research output: Contribution to journal › Article › peer-review Open AccessFile 4 Downloads (Pure) A Negami-type splitting formula for the Jones and ribbon graph polynomialsHuggett, S. & Moffatt, I., 12 Sept 2025, (E-pub ahead of print) In: Proceedings of the Edinburgh Mathematical Society (Series 2). p. 1-20 20 p.Research output: Contribution to journal › Article › peer-review Open Access The critical group of a combinatorial mapMerino, C., Moffatt, I. & Noble, S., 15 Sept 2025, In: Combinatorial Theory. 5, 3Research output: Contribution to journal › Article › peer-review Open AccessFile 29 Downloads (Pure) A coarse Tutte polynomial for hypermapsMoffatt, I., Ellis-Monaghan, J. A. & Noble, S., 18 Aug 2024, (Accepted/In press) Model Theory, Computer Science, and Graph Polynomials. Birkhäuser Cham, 23 p. (Trends in Mathematics).Research output: Chapter in Book/Report/Conference proceeding › Chapter Open AccessFile 40 Downloads (Pure) Constructing a Tutte polynomial for graphs embedded in surfacesMoffatt, I., 2024, (Accepted/In press) 2023 MATRIX Annals. Springer, 27 p. (MATRIX Book Series).Research output: Chapter in Book/Report/Conference proceeding › Chapter Open AccessFile 105 Downloads (Pure) View all 51 research outputs Projects 9 Finished Projects per year Hypermaps: polynomials, dualities and minorsMoffatt, I. (PI)Eng & Phys Sci Res Council EPSRC1/10/24 → 30/09/25Project: Research Grant application to LMSMoffatt, I. (PI)London Mathematical Society1/04/24 → 10/04/24Project: Research Investigations of algebraic graphs of large girth and their cryptographical propertiesUstymenko, V. (PI) & Moffatt, I. (Other)British Academy4/12/23 → 4/07/24Project: Research The critical group of a topological graph: an approach through delta-matroid theoryMoffatt, I. (PI)Eng & Phys Sci Res Council EPSRC16/05/22 → 15/05/23Project: Research Collaborative research with Prof Sergei Lando at the Higher School of Economics in MoscowMoffatt, I. (PI)London Mathematical Society1/11/17 → 30/10/18Project: Research View all 9 projects",
  "content_length": 4316,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:13"
}