{
  "name": "Iain W. Phillips",
  "homepage": "https://www.lboro.ac.uk/departments/compsci/staff/academic-teaching/iain-phillips",
  "status": "success",
  "content": "Iain Phillips | Computer Science | Loughborough University Professor Iain Phillips BSc PhD FBCS CEng CITP MACM Pronouns: He/him Professor of Computer Science Research groups and centres Cyber, Networks and Systems Publications ORCiD Google Scholar +44 (0)1509 222690 Send email Office: N.3.23 (Haslegrave Building) Personal website Biography Research External activities Responsibilities PhD supervisions Dr Iain Phillips (FBCS, CEng, CITP, MACM, FHEA) has been involved in computer networks research for over 25 years, with over 100 publications in this area. His main work has been in network architecture considering performance, protocols and algorithms for the Internet and Wireless Sensor Networks. He has a BSc in Computing and Information Systems and a PhD in Computer Science from Manchester University. He has worked at Loughborough since 1992 as a Research Associate and Fellow in Electronic and Electrical Engineering before moving to Computer Science in 1999. He was Head of Computer Science from 2008 to 2011. From August 2015, he has been Director of Academic Staffing in the School of Science and, from August 2016 to August 2018, the Acting Head of Computer Science. Research areas: Internet Architectures: Routing and Performance Measurement Ad-hoc networks, VANETs, swarm networking, WSNs Bigdata and AI/machine learning Co-chair NGN MSN workshop 2014 - 2020 Past Member of the Board of the BCS Academy of Computing In the past the Chair of the Council of Professors and Heads of Computing Head of Department, Computer Science (2008-2011 and 2016-2023) Director of Academic Staffing, School of Science (2017-2023) First Aider and Fire Marshall Member of the Internet Networks and Systems (NetSys) research theme I'm willing to supervise students in the area of networks, especially ad-hoc networks and research concentrating on routing.",
  "content_length": 1855,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:13"
}