{
  "name": "Iain B. Styles",
  "homepage": "https://pure.qub.ac.uk/en/persons/iain-styles",
  "status": "success",
  "content": "Iain Styles - Queen's University Belfast View Scopus Profile Iain Styles Professor Professor, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0002-6755-0299 Emaili.stylesqub.acuk Room 0G.002 - 21 Stranmillis RoadUnited Kingdom Accepting PhD Students 20032025 Research activity per year Personal profile Fingerprint Dive into the research topics where Iain Styles is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Protein Biochemistry, Genetics and Molecular Biology 100% Models Computer Science 90% Mass Spectrometry Imaging Biochemistry, Genetics and Molecular Biology 77% Analysis Medicine and Dentistry 73% Algorithms Computer Science 70% Surface Property Biochemistry, Genetics and Molecular Biology 55% Accuracy Computer Science 55% Tissues Medicine and Dentistry 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2025 2025 2025 1 Active Projects per year R1859ECS: NILAB: NI Landscape partnership in AI for BioscienceWang, H. (PI), Bengoechea, J. (CoI), Collins, B. (CoI), Kyriazakis, I. (CoI), McKnight, A. J. (CoI) & Styles, I. (CoI)27/02/2025 → …Project: Research Research output Research output per year 2003 2016 2018 2019 2020 2021 2022 2025 2025 37 Article 11 Conference contribution 2 Meeting abstract 1 Chapter (peer-reviewed) 2 More 1 Paper 1 Poster Research output per year Research output per year Expansion microscopy allows quantitative characterisation of structural organisation of platelet aggregatesFaulkner, E. L., Pike, J. A., Garlick, E., Neely, R. K., Styles, I. B., Watson, S. P., Poulter, N. S. & Thomas, S. G., Aug 2025, In: Journal of Thrombosis and Haemostasis. 23, 8, p. 2618-2633Research output: Contribution to journal › Article › peer-review Open AccessFile Quantitative Technique 100% Thrombocyte Aggregation 100% Platelet 50% Hemostasis 20% Actin 20% 3 Downloads (Pure) High dynamic range tone mapping for confocal microscopy imagesRazumovska, Y., Pattison, A., Styles, I. & Gault, R., 04 Sept 2025, Irish Machine Vision and Image Processing Conference Proceedings 2025. Irish Pattern Recognition & Classification Society, Vol. 1. (Proceedings of the Irish Machine Vision and Image Processing Conference).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Dynamic Range 100% Confocal Microscopy 100% Tone Mapping 100% Mapping Operator 66% Signal-to-Noise Ratio 50% 2 Downloads (Pure) Intelligent point prompt generation for interactive segmentationPorter, V., Styles, I., Curtis, T. & Gault, R., 01 Sept 2025, Proceedings of the Irish Machine Vision and Image Processing Conference 2025. Irish Pattern Recognition & Classification Society, p. 144-148 (Proceedings of the Irish Machine Vision and Image Processing Conference).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Input Image 100% Limitations 100% Segmentation Quality 100% Internal Point 100% Local Cluster 100% 4 Downloads (Pure) STAIN: smooth tile-aware instance normalisation for virtual stainingArmstrong, D., Styles, I. & McLaughlin, N., 25 Jul 2025, (Accepted).Research output: Contribution to conference › Paper › peer-review Normalization Layer 100% Cancer Diagnosis 100% Contextual evaluation of segmentation models using spatial reasoningPorter, V., Styles, I., Curtis, T. M., Taggart, M. J., Albargothy, M. J. & Gault, R., 01 Oct 2024, 26th Irish Machine Vision and Image Processing Conference (IMVIP 2024): Proceedings. 10 ed. Institution of Engineering and Technology (IET), Vol. 2024. p. 266-274 9 p. (IET Conference Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Segmentation Model 100% Python 100% Decision Making 100% Electron Microscopy 100% Pythonidae 100% 37 Downloads (Pure) View all 53 research outputs Activities Activities per year 2023 2023 2025 2025 2 Participation in workshop, seminar, course 1 Participation in Festival/Exhibition Activities per year Northern Ireland Science FestivalStyles, I. (Participant), Lawler, M. (Chair), Maguire, A. (Participant), Keatley, D. (Participant), McFerran, E. (Participant) & Rogers, D.-M. (Organiser)18 Feb 2025Activity: Participating in or organising an event types › Participation in Festival/Exhibition Workshop on Discovery AI for Health: Accelerating Health Research and InnovationWang, H. (Organiser), Styles, I. (Speaker), Bengoechea, J. (Speaker), McNulty, H. (Speaker), Hughes, C. (Speaker), Yang, G. (Speaker), Zwiggelaar, R. (Speaker), Diaz-Ordaz, K. (Speaker), Hospedales, T. (Speaker), Liang, X. (Organiser), Mai, T. S. (Participant), Gault, R. (Participant) & Hughes, C. (Participant)23 Jun 2023Activity: Participating in or organising an event types › Participation in workshop, seminar, course Co-Design Workshop on Training the Next Generation of Postgraduate Researchers in Discovery AI for HealthWang, H. (Organiser), Styles, I. (Speaker), Woods, R. (Speaker), Paternostro, M. (Speaker), Mullan, P. (Speaker), Kee, F. (Speaker), Hardiman, G. (Speaker), Martin, L. (Participant), Power, U. (Participant), Gault, R. (Participant), Craig, S. (Participant), McCombe, K. (Participant), Murphy, M. (Participant), Liang, X. (Organiser) & Schroeder, F. (Participant)02 Jun 2023Activity: Participating in or organising an event types › Participation in workshop, seminar, course",
  "content_length": 5818,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:11"
}