{
  "name": "Ian James Wassell",
  "homepage": "https://www.cl.cam.ac.uk/research/dtg/www/people/ijw24",
  "status": "success",
  "content": "Digital Technology Group - People - Ian Wassell Skip to content Computer Laboratory Research Digital Technology Group People Ian Wassell Dr. Ian Wassell User ID:ijw24 Position:Senior Lecturer E-mail:ijw24@cam.ac.uk Homepage:http://www.cl.cam.ac.uk /~ijw24 / College:Churchill Overview and Interests Dr Ian Wassell joined the University of Cambridge Computer Laboratory as a Senior Lecturer in January 2006. Prior to this appointment, he was with the University of Cambridge Department of Engineering for approximately six and a half years. He received the PhD degree from the University of Southampton in 1990, where he investigated Viterbi Equalisation for wireless and mobile systems, and the BSc., BEng. Degrees from the University of Loughborough in 1983. He has in excess of 25 years experience in the simulation and design of radio communication systems gained via a number of positions in industry and higher education. He has published more than 200 publications since joining the University of Cambridge in May 1999, and has successfully supervised 23 PhD students and 6 MPhil students. He is now leading the research on wireless communications within the Digital Technology Group at the Computer Laboratory. He is also a fellow of Churchill College and has supervised second year linear systems and communication topics to Churchill engineering students for a number of years. He is a Member of the Institution of Engineering and Technology (IET) and has also served on the local Cambridge committee of the IET. His current research interests include: Broadband fixed wireless access (FWA) Sensor networks Cooperative and relay networks Propagation measurement and empirical modelling Electromagnetic (EM) based propagation modelling Turbo and convolutional coding Bit interleaved coded modulation and iterative detection Multiple-input multiple-output (MIMO) systems Signal processing for MIMO detection Compressive sensing Sparse representation of data Sparse image and video coding, and classification In the past he has investigated: Fast and hardware efficient equaliser design Combined coding and modulation Orthogonal Frequency Division Multiplex (OFDM) systems including frequency and timing correction Filtered multitone modulation Dynamic channel allocation Mobile ad hoc networks Heterogeneous networks Publications 1. Yang Liu, Zhaowen Wang, Hailin Jin, Ian Wassell, \"Synthetically Supervised Feature Learning for Scene Text Recognition,\" European Conference on Computer Vision, Sep 2018 2. Q. Chen, Y. Liu, Z Wang, I. J. Wassell, K. Chetty, \"Re-weighted Adversarial Adaptation Network for Unsupervised Domain Adaptation,\" IEEE 2018 Conference on Computer Vision and Pattern Recognition (CVPR 2018), Salt Lake City, USA, IEEE, Jun 2018 3. Y. Liu, Z Wang, H. Jin, I. J. Wassell, \"Multi-Task Adversarial Adaptation Network for Disentangled Feature Learning,\" IEEE 2018 Conference on Computer Vision and Pattern Recognition (CVPR 2018), Salt Lake City, USA, IEEE, Jun 2018 4. Yang Liu, Qingchao Chen, Wei Chen, Ian Wassell, \"Dictionary Learning Inspired Deep Network for Scene Recognition,\" AAAI Conference on Artificial Intelligence, Feb 2018 5. Xin Ding, Wei Chen, Ian Wassell, \"Joint Sensing Matrix and Sparsifying Dictionary Optimization for Tensor Compressive Sensing,\" IEEE Transactions on Signal Processing, May 2017 6. Z. Feng, I. Wassell, \"Joint channel sensing and power control scheme for cognitive radio wireless sensor networks,\" 2017 Wireless Days, pp. 180-183, Mar 2017 7. Yang Liu, Qingchao Chen, Ian Wassell, \"Deep network for image super-resolution with a dictionary leaning layer,\" IEEE International Conference on Image Processing, 2017 8. Wei Chen, David Wipf, Yu Wang, Yang Liu, Ian Wassell, \"Simultaneous Bayesian Sparse Approximation With Structured Sparse Models,\" IEEE Transactions on Signal Processing, Dec 2016 9. Z. Feng, I. Wassell, \"Competitive Distributed Spectrum Access in QoS-Constrained Cognitive Radio Networks,\" 2016 IEEE Global Communications Conference (GLOBECOM), pp. 1-6, Dec 2016 10. Yang Liu, Wei Chen, Qingchao Chen, Ian Wassell, \"Support Discrimination Dictionary Learning for Image Classification,\" European Conference on Computer Vision (ECCV), Oct 2016 11. Wei Chen, Ian Wassell, \"Bayesian Learning For The Type-3 Joint Sparse Signal Recovery,\" IEEE International Conference on Communications (ICC), May 2016 12. Z. Feng, I. Wassell, \"Dynamic power control and optimization scheme for QoS-constrained cooperative wireless sensor networks,\" 2016 IEEE International Conference on Communications (ICC), pp. 1-6, May 2016 13. Xin Ding, Wei Chen, Ian Wassell, \"Nonconvex Compressive Sensing Reconstruction For Tensor Using Structures In Modes,\" IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP), Mar 2016 14. S Herbert, I Wassell, T H Loh, \"A Simple Recursively Computable Lower Bound on the Noncoherent Capacity of Highly Underspread Fading Channels,\" IEEE Transactions on Wireless Communications, vol. PP, no. 99, IEEE, Feb 2016 15. Wei Chen, Ian J. Wassell, \"A Decentralized Bayesian Algorithm For Distributed Compressive Sensing in Networked Sensing Systems,\" IEEE Transactions on Wireless Communications, vol. 15, no. 2, pp. 1282-1292, 2016 16. Wei Chen, Ian Wassell, \"Cost-Aware Activity Scheduling for Compressive Sleeping Wireless Sensor Networks,\" IEEE Transactions on Signal Processing, 2016 17. Wei Chen, Ian Wassell, \"Optimized Node Selection for Compressive Sleeping Wireless Sensor Networks,\" IEEE Transactions on Vehicular Technology, vol. 65, no. 2, pp. 827-836, 2016 18. Xin Ding, Wei Chen, Ian Wassell, \"Compressive Sensing Reconstruction for Video: an Adaptive Approach Based on Motion Estimation,\" IEEE Transactions on Circuits and Systems for Video Technology, 2016 19. Xin Ding, Wei Chen, Ian Wassell, \"Block-Based Feature Adaptive Compressive Sensing for Video,\" The Third International Workshop on Multimedia Communications and Networking (MultiCom), held in conjunction with the 14th IEEE International Conference on Ubiquitous Computing and Communications (IUCC), Oct 2015 20. Yang Liu, Ian Wassell, \"A New Face Recognition Algorithm based on Dictionary Learning for a Single Training Sample per Person,\" Proceedings of the British Machine Vision Conference (BMVC), pp. 69.1-69.11, BMVA Press, Sep 2015 21. Yu Wang, David Wipf, Jeong Min Yun, Wei Chen, Ian J. Wassell, \"Clustered Sparse Bayesian Learning,\" The Conference on Uncertainty in Artificial Intelligence (UAI), Jul 2015 22. Yu Wang, David Wipf, Qing Ling, Wei Chen, Ian Wassell, \"Multi-Task Learning for Subspace Segmentation,\" International Conference on Machine Learning (ICML), Jul 2015 23. Wei Chen, Ian Wassell, \"Variational Bayesian Algorithm For Distributed Compressive Sensing,\" IEEE International Conference on Communications (ICC), Jun 2015 24. Xin Ding, Wei Chen, Ian Wassell, \"Sparsity-fused Kalman Filtering for Reconstruction of Dynamic Sparse Signals,\" IEEE International Conference on Communications (ICC), Jun 2015 25. Wei Chen, Ian Wassell, Miguel Rodrigues, \"Dictionary Design for Distributed Compressive Sensing,\" IEEE Signal Processing Letters, vol. 22, no. 1, pp. 95-99, 2015 26. Wei Chen, Ian Wassell, \"Compressive Sleeping Wireless Sensor Networks With Active Node Selection,\" IEEE Global Communications Conference (GLOBECOM), Dec 2014 27. Steven Herbert, Tian-Hong Loh, Ian Wassell, \"Assessment of a low-profile planar antenna for a wireless sensor network monitoring the local water distribution network,\" IET Wireless Sensor Systems, vol. 4, pp. 191-195(4), Institution of Engineering and Technology, Dec 2014 28. Steven Herbert, Tian-Hong Loh, Ian Wassell, Jonathan Rigelsford, \"On the Analogy Between Vehicle and Vehicle-like Cavities with Reverberation Chambers,\" IEEE Transactions on Antennas and Propagations, Oct 2014 29. Xin Ding, Wei Chen, Ian Wassell, \"Generalized-KFCS: Motion Estimation Enhanced Kalman Filtered Compressive Sensing for Video,\" IEEE International Conference on Image Processing (ICIP), Oct 2014 30. S. Herbert, I. Wassell, T. Loh, J. Rigelsford, \"Characterizing the Spectral Properties and Time Variation of the In-Vehicle Wireless Communication Channel,\" Communications, IEEE Transactions on, vol. 62, no. 7, pp. 2390-2399, Jul 2014 31. Yu Wang, David Wipf, Wei Chen, Ian Wassell, \"Exploiting the Convex-Concave Penalty for Tracking: A Novel Dynamic Reweighted Sparse Bayesian Learning Algorithm,\" IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP), May 2014 32. Wei Chen, Yiannis Andreopoulos, Ian Wassell, Miguel Rodrigues, \"Towards Energy Neutrality in Energy Harvesting Wireless Sensor Networks: A Case for Distributed Compressive Sensing?,\" IEEE Global Communications Conference (GLOBECOM), Dec 2013 33. Yu Wang, Wei Chen, Ian Wassell, \"Exploiting Hidden Block Sparsity: Interdependent Matching Pursuit for Cyclic Feature Detection,\" IEEE Global Communications Conference (GLOBECOM), Dec 2013 34. Steven Herbert, Tian Hong Loh, Ian Wassell, \"An impulse response model and Q factor estimation for vehicle cavities,\" IEEE Transactions on Vehicular Technology, Piscataway, NJ, vol. 62, no. 9, pp. 4240-4250, Nov 2013 35. Wei Chen, Miguel R. D. Rodrigues, Ian Wassell, \"Projections Design For Statistical Compressive Sensing: A Tight Frame Based Approach,\" IEEE Transactions on Signal Processing, vol. 61, no. 8, pp. 2016 - 2029, Apr 2013 36. Wei Chen, Miguel R. D. Rodrigues, Ian Wassell, \"A Frechet Mean Approach for Compressive Sensing Date Acquisition and Reconstruction in Wireless Sensor Networks,\" IEEE Transactions on Wireless Communications, vol. 11, no. 10, pp. 3598 -3606, Oct 2012 37. W Guo, I J Wassell, \"Capacity-Outage-Tradeoff (COT) for Cooperative Networks,\" IEEE Journal on Selected Areas of Communications (JSAC), vol. 30, no. 9, pp. 1641-1648, Oct 2012 38. Wei Chen, Miguel R. D. Rodrigues, Ian J. Wassell, \"On the Benefit of using Tight Frames for Robust Data Transmission and Compressive Data Gathering in Wi",
  "content_length": 53948,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:22"
}