{
  "name": "Ian Vince McLoughlin",
  "homepage": "http://kent.academia.edu/IanMcLoughlin",
  "status": "success",
  "content": "Ian McLoughlin - University of Kent Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Ian McLoughlinUniversity of Kent, Computing, Faculty MemberNanyang Technological University, School of Computer Engineering, EmeritusUniversity of Birmingham, Electrical and Computer Engineering, AlumnusUniversity of Science and Technology of China, EEIS@USTC, AdjunctaddFollowdoneFollowingFollowers198Following14Co-authors6Public ViewsProfessor Ian Vince McLoughlin worked with the electronics RlessRelated Authors Tiago FalkInstitut national de la recherche scientifique J. Kates Oded Ghitza John BeerendsTNO Mike Brookes Mark HuckvaleUniversity College London Andrew Hines Petko PetkovToshiba Research Europe Ltd. Nikolaos MitianoudisDemocritus University of Thrace Pejman MowlaeeRuhr-Universität BochumInterestsView All (9) Uploadsall1 About Me2 Research1 Books77 PapersAbout Me by Ian McLoughlinBackground, CV, paper list, links to more information Research by Ian McLoughlinMy communications researchVarious topics in wireless communications and networking explained (with links to papers) My speech researchThis webpage overviews most of my recent speech work, with links to various papers. Books by Ian McLoughlinApplied Speech and Audio Processing (with MATLAB examples)Applied Speech and Audio Processing is a MATLAB-based, one-stop resource that blends speech and h... more Applied Speech and Audio Processing is a MATLAB-based, one-stop resource that blends speech and hearing research in describing the key techniques of speech and audio processing. This practically oriented text provides MATLAB examples throughout to illustrate the concepts discussed and to give the reader hands-on experience with important techniques. Chapters on basic audio processing and the characteristics of speech and hearing lay the foundations of speech signal processing, which are built upon in subsequent sections explaining audio handling, coding, compression, and analysis techniques. The final chapter explores a number of advanced topics that use these techniques, including psychoacoustic modelling, a subject which underpins MP3 and related audio formats. With its hands-on nature and numerous MATLAB examples, this book is ideal for graduate students and practitioners working with speech or audio systems. Papers by Ian McLoughlinNonintrusive quality assessment of noise suppressed speech with Mel-Filtered energies and support vector regressionObjective speech quality assessment is a challenging task which aims to emulate human judgment in... more Objective speech quality assessment is a challenging task which aims to emulate human judgment in the complex and time consuming task of subjective assessment. It is difficult to perform in line with the human perception due the complex and nonlinear nature of the human auditory system. The challenge lies in representing speech signals using appropriate features and subsequently mapping these features into a quality score. This paper proposes a nonintrusive metric for the quality assessment of noisesuppressed speech. The originality of the proposed approach lies primarily in the use of Mel filter bank energies (FBEs) as features and the use of support vector regression (SVR) for feature mapping. We utilize the sensitivity of FBEs to noise in order to obtain an effective representation of speech towards quality assessment. In addition, the use of SVR exploits the advantages of kernels which allow the regression algorithm to learn complex data patterns via nonlinear transformation for an effective and generalized mapping of features into the quality score. Extensive experiments conducted using two third party databases with different noise-suppressed speech signals show the effectiveness of the proposed approach.Download Speech Recognition for Smart Homesarrow_back_iosarrow_forward_iosDownload Improvements Relating to Radio Communication Systems Evaluation of ITU-T G. 728 as a voice over IP codec for Chinese speechby Krzysztof Pawlikowski and Ian McLoughlinAbstract—Voice-over-IP is expected to become a popular service offered by the internet. Thus, it ... more Abstract—Voice-over-IP is expected to become a popular service offered by the internet. Thus, it is important to ensure high quality of service. In this paper, we look at two standards proposed for evaluating the intelligibility of Chinese speech. Adopting the philosophy and methodology of the Diagnostic Rhyme Test (DRT) for testing English speech, the Chinese Diagnostic Rhyme Test (CDRT) evaluates the six elementary phonemic attributes of Chinese words.Download Reconfigurable Processing Framework for Space-Time Block Codesby kishore mehrotra and Ian McLoughlinSpace-time block coding has emerged in recent years as a promising research topic to enable futur... more Space-time block coding has emerged in recent years as a promising research topic to enable future high-speed wireless communications networks and services. A considerable number of authors have developed algorithms and techniques that have been explored in simulations. However, fully implemented systems are rare. This paper considers the use of reconfigurable logic for implementing space-time block coding algorithms, allowing greater coding complexity than traditional DSP implemented systems.Download LSP-based speech modification for intelligibility enhancementProceedings of 13th International Conference on Digital Signal Processing, 2000CELP coders commonly use line spectral pairs (LSP) to represent linear prediction parameters, giv... more CELP coders commonly use line spectral pairs (LSP) to represent linear prediction parameters, giving stable filters and efficient coding. However, manipulation of LSPs can alter frequencies within the represented signals. This paper describes two computationally efficient LSP-based processing methods designed to enhance the intelligibility of speech degraded by acoustic interference Channel prediction for mitigating feedback link issues in transmit antenna selection systems2009 Ieee 20th International Symposium on Personal Indoor and Mobile Radio Communications, Sep 1, 2009Transmit antenna selection (TAS) in multiple-inputmultiple output (MIMO) has several advantages, ... more Transmit antenna selection (TAS) in multiple-inputmultiple output (MIMO) has several advantages, particularly in hardware-costly transmit schemes such as those requiring linearisation. However TAS requires either channel knowledge, or receiver knowledge at the transmitter, typically achieved using data transmission in the reverse direction. This process involves a reverse channel bandwidth cost, but also implies a delay between the channel sampling and the switching. To reduce reverse channel costs, the bandwidth may be rate constrained. Thus both delay and feedback rate will limit the performance of a TAS system. To mitigate against these performance limitations, in this paper a prediction scheme is applied to systems employing transmit antenna selection with maximal ratio combining.Download Low-Cost Space-Borne Processing on a Reconfigurable Parallel ArchitectureErsa, 2004This paper proposes a reconfigurable parallel architecture for space-borne on-board processing th... more This paper proposes a reconfigurable parallel architecture for space-borne on-board processing that combines the advantages of powerful computational resources with a straightforward software development. This approach introduces the concept of software payloads that enable the users the direct transfer of their ground-based applications towards space and thus the circumvention of the usual downlink bottleneck. The main emphasis is on the processing model and the software development aspect. The advantages in the proposed system are highlighted by a series of demonstration applications. A trade-off analysis of these suggested processing tasks with respect to a ground-based solution concludes the investigation.Download Reconstruction of pitch for whisper-to-speech conversion of ChineseThe 9th International Symposium on Chinese Spoken Language Processing, Sep 1, 2014 Reconfigurable, Fault Tolerant and High Performance Payload for Space MissionsThis paper discusses design concepts of a reconfigurable fault tolerant and high performance comp... more This paper discusses design concepts of a reconfigurable fault tolerant and high performance computing payload for space missions. It is based on a parallel cluster of commercial-off-theshelf (COTS) processing nodes, which are interconnected using network elements (NE) based on radiation-tolerant reconfigurable FPGAs. This Parallel Processing Unit (PPU) is a secondary payload onboard X-Sat, a micro-satellite built by Nanyang Technological University and scheduled for launch in 2006.Download Square-rich fixed point polynomial evaluation on FPGAsProceedings of the 2014 ACM/SIGDA international symposium on Field-programmable gate arrays - FPGA '14, 2014Polynomial evaluation is important across a wide range of application domains, so significant wor... more Polynomial evaluation is important across a wide range of application domains, so significant work has been done on accelerating its computation. The conventional algorithm, referred to as Horner's rule, involves the least number of steps but can lead to increased latency due to serial computation. Parallel evaluation algorithms such as Estrin's method have shorter latency than Horner's rule, but achieve this at the expense of large hardware overhead. This paper presents an efficient polynomial evaluation algorithm, which reforms the evaluation process to include an increased number of squaring steps. By using a squarer design that is more efficient than general multiplication, this can res",
  "content_length": 16699,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:29"
}