{
  "name": "Ian G. Harris",
  "homepage": "http://www.ics.uci.edu/~harris",
  "status": "success",
  "content": "Prof. Ian G. Harris - UC Irvine About Ian G. Harris is a Professor in the Computer Science Department at the University of California, Irvine. He is affiliated with the following research centers: Center for Embedded and Cyber-physical Systems (CECS) Cybersecurity Policy and Research Institute (CPRI) Professor Harris received his BS in Computer Science from Massachusetts Institute of Technology, MS and PhD in Computer Science from the University of California San Diego. He conducts research in the areas of natural language processing and hardware security. Research Areas My research focuses on several key areas in natural language processing and cybersecurity: Distributed Inference and Training of LLMs Partitioning the training and inference processes across a set of resource-constrained IoT devices.. Security of LLMs Detecting malicious prompts and mitigating their effects without disrupting helpfulness. Hate and Toxic Speech Mitigation Using LLMs to detect offensive speech and ensuring that LLMs do not generate offensive responses. Embedded System Security Designing and analyzing secure embedded system architectures. Teaching I teach various courses in the Computer Science department: ICS 53: Principles in System Design CS 145: Embedded Software ICS 31: Introduction to Programming CS 295P/297P: Capstone/Keystone Project for Computer Science SWE 267P: Cloud and Security Foundations I also teach several online courses though Coursera: An Introduction to Programming the Internet of Things (IOT) Specialization Programming with Google Go Specialization Selected Publications J. Xu, Y. Luo, and I. G. Harris, \"Efficient Digital Signature Security Enhancement for Remote Keyless Entry System\", International Conference on Dependable, Autonomic and Secure Computing (DASC), October 2025. Z. Yang and I. G. Harris, \"LogLLaMA: Transformer-based log anomaly detection with LLaMA\", International Joint Conference on Neural Networks, June 2025. S. Hashemitaheri and I. G. Harris, \"Enhancing Non-English Conversational Agents Using Synthetic Data Generation\", Workshop on Generative AI for Smart and Connected Health (GenAI4SCH), June 2025. S. Rahman and I. G. Harris, \"Summary the Savior: Harmful Keyword and Query-based Summarization for LLM Jailbreak Defense\", Workshop on Trustworthy NLP (TrustNLP 2025), May 2025. T. Giyahchi, C. Pechmann and I. Harris, \"Empathetic Reflective Response Generation: Towards Conversation Models for Online Mental Health Support\", International Conference on Machine Learning and Applications (ICMLA), December 2024. J. Xu, D. Abraham and I. G. Harris, \"Run-Time ROP Attack Detection on Embedded Devices Using Side Channel Power Analysis\", IEEE Embedded Systems Letters, December 2024. J. Zhao, Y. Song, S. Liu, I. G. Harris, and S. A. Jyothi, \"LinguaLinked: Distributed large language model inference on mobile devices\", Annual Meeting of the Association for Computational Linguistics (ACL), August 2024. J. Kim, A. Derakhshan, and I. G. Harris, \"Robust safety classifier against jailbreaking attacks: Adversarial prompt shield\", Workshop on Online Abuse and Harms (WOAH), June 2024. D. Yao, J. Zhang, I. G. Harris, and M. Carlsson, \"Fuzzllm: A novel and universal fuzzing framework for proactively discovering jailbreak vulnerabilities in large language models\", IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), April 2024. For a complete list of publications, please visit my Google Scholar profile. Contact Information Office Donald Bren Hall 3088 University of California, Irvine Irvine, CA 92697-3435 Contact Details Phone: (949) 824-8842 Email: iharris@uci.edu Office Hours By appointment",
  "content_length": 3678,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:21"
}