{
  "name": "Ian Horswill",
  "homepage": "http://www.cs.northwestern.edu/~ian",
  "status": "success",
  "content": "Ian Horswill Ian Horswill Associate Professor of Computer Science Departments of Electrical Engineering/Computer Science and Radio/Television/Film Director, Division of Graphics and Interactive Media, EECS Department Director, Animate Arts Program Email: ian@northwestern.edu Blogs: http://ianhorswill.wordpress.com (AI) http://twigblog.wordpress.com (procedural animation, web comic) Office: EECS Department, Northwestern University Ford Building, room 3-321 2133 Sheridan Road Evanston, IL 60208 Voice +1-847-467-1256 FAX: +1-847-491-5258 My work lies roughly within the areas of artificial intelligence and interactive art and entertainment.  My AI research focuses on control systems for autonomous agents: how does an agent decide from moment to moment what to do, based on an ongoing stream of sensor data and a continually varying set of goals and entanglements with the world.  My past work focused on robotics and computer vision, but my more recent work centers around the the modeling and simulation of emotion, personality, and social behavior for virtual characters for games and interactive narrative.  Interactive narrative is particularly interesting for AI because it provides a natural domain in which to examine aspects of human personality and behavior that one would not want to duplicate in service robots, such as aggression and depresssion. Within interactive art and entertainment, I'm interested in exploring alternative genres and interaction modes that can expand the medium. Interactive narrative is particularly interesting because it offers the promise of an aesthetics that emphasizes experiences of identification, empathy, and affiliation, over mastery, frustration, and control.  However, making a piece that provides those experiences in practice is a difficult task that involves a number of interesting research problems in computer science and cognitive science. I also dabble in programming language implementation and work with the LocalStyle arts collective. Information for students Courses Projects Publications Other activities Media Information for students Most people call me \"Ian\" rather than \"Professor Horswill,\" but I won't be offended either way. I'm best reached by email.  However, while I try hard to keep up with my email, but it's not uncommon for me to have to write 50-100 emails in one day, and things can get lost in my inbox.  So if I don't respond to your email, please don't be bashful about nagging me.  It's my fault, not yours. I don't have scheduled office hours because I find they rarely coincide with the times people want to see me.  But I'm very happy to meet with people.  So if you want to meet, just send me email and we'll schedule an appointment. Courses Fall 2008 EECS 111: Fundamentals of Computer Programming I AnimArt 101: Perceptual and Mathematical Spaces AnimArt 302: Culture and Connectivity Winter 2009 AnimArt 201: Perception and Programming in Time AnimArt 392-1: Senior Projects 1 Spring 2009 AnimArt 301: Interaction and Interactivity AnimArt 392-2: Senior Projects 2 Projects The Animate Arts Program The Animate Arts Program is a joint project of Northwestern's schools of Engineering, Communications, Arts and Sciences, and Music.  We offer an integrated, team-taught curriculum in the fundamentals of interactive multimedia arts and entertainment systems, including visual design, sound design, narrative, film and art theory, and of course programming and computer graphics. For information on our curriculum and how to join the program, see the Animate Arts Wiki. Modeling emotion and personality in interactive virtual characters Recent work is bringing psychological and neuroscience models of emotion and personality closer together.  These models, such as Gray and McNaughton's revised (2000) Reinforcement Sensitivity Theory, provide potential biological explanations both for 2-factor trait models of personality, as well as state disorders such as major depressive disorder and anxiety disorder, and panic disorder.  Although not phrased in computational terms, RST is sufficiently precise to be modeled computationally.  In joint work with with Karl Fua, Andrew Ortony and Bill Revelle, we are working to model and implement RST in interactive virtual characters and to apply the model to schoolyard social interactions. Modeling parent/child attachment One of my current interests is in the ways in which human behavior is built atop a substrate of more basic behaviors that we share with other mammals. A particularly good example of this is the attachment behavior system, which has been well studied in child psychology.  Attachment behavior begins as a relatively simple innate system that responds to low-level sensory cues such as parental proximity, eye contract, and smiling.  But as the child develops, the attachment system become increasingly intertwined with higher-level reasoning processes.  Moreover, both it remains active throughout the child's life, and forms part of the basis for adult romantic love.  Attachment is therefore an ideal model system to study when trying to understand the interactions of the basic motivational and behavioral systems we share with other mammals and the specially developed reasoning processes unique to humans. You can find a simple simulation here (press Tab to switch between character views and h to toggle debugging information) and a position paper on why attachment is an interesting model system here. This is based on Ainsworth's safe home base phenomenon, in which a young child explores the environment by making repeated excursions from the caregiver. Increasing distance from the parent increases anxiety, which eventually triggers attachment behaviors such as establishing eye contact, closing with the parent, and achieving physical contact (hugging). The Twig procedural animation system Most character animation is done either by hand or by instrumenting actors for motion capture, recording their movements, and then playing them back later. These techniques, although expensive, work well for films, but are expensive to apply for interactive applications such as video games where designers need to anticipate and digitize in advance every possible motion a character might need to make. Procedural animation uses software to compute the motions at run-time, allowing a wider range of motions.  In this work, I've combined a simple ragdoll physics engine with an animation system built on the principles of behavior-based robotics.  The result is fluid, evocative, and believable motion that allows physical interactions between characters such as holding hands, hugging, grappling, and fighting. Twig is free, open-source software.  You you can download the current demos and source release, as well as copies of the Twig papers, from the Twig blog. Webcomic I've been trying to test out features of Twig by writing short little pieces that use them and publishing the result as a kind of \"web comic.\"  It's published at (very) irregular intervals depending on my travel and teaching schedules, but should see a lot more activity come this summer.  As of this writing, all the episodes are scripted (since scripting was the original feature I wanted to test), but my intention is to have subsequent episodes be at least partially interactive. The Meta programming language Adrian Ledda, 2005 Meta is a free, Scheme-like programming language that provides very good integration with the Microsoft .NET system. For beginning programmers, Meta provides a high-quality programming environment that allows beginning programming students to write relatively sophisticated programs using a relatively unintimidating development environment. Its provide a slow (its interpreted) but otherwise industrial-strength lisp system with extremely good .NET integration.  Meta is used in the Animate Arts curriculum as well as in some sections of EECS-111. Selected publications Ian Horswill, \"Very Fast Action Selection for Parameterized Behaviors\", in Proceedings of the Fifth International Conference on Foundations of Digital Games (FDG-09), Orlando, FL, April 2009. Ian Horswill, \"Lightweight Procedural Animation With Believable Physical Interactions\", IEEE Transactions on Computational Intelligence and AI in Computer Games, 1(1), in press. Ian Horswill, \"Men are Dogs (and Women too)\", AAAI Fall Symposium on Natural Intelligence and AI, Arlington VA, November 2008. Ian Horswill, \"Lightweight Procedural Animation with Believable Physical Interaction,\" in Proceedings of the 2008 AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment (AIIDE-2008), Stanford CA, October 2008. Ian Horswill.  \"Psychopathology, narrative, and cognitive architecture (or: why NPCs should be just as screwed up as we are)\". AAAI Fall Symposium on Intelligent Narrative Technologies.  2007. Ian Horswill. What is Computation?  These are some unpublished course notes I wrote for introductory programming, that been used by colleagues at other universities. Ian Horswill and Marlena Novak, \"Teaching Artist-Technologists: Northwestern's Animate Arts Program\", IEEE Computer, June 2006. Robert Zubek and Ian Horswill, \"Hierarchical Parallel Markov Models of Interaction\", in Proceedings of the First Conference on Artificial Intelligence and Interactive Digital Entertainment, Marina Del Rey, June 2005. Magy Seif El-Nasr and Ian Horswill. \"Automating Lighting Design for Interactive Entertainment.\" ACM Computers in Entertainment 2(2). 2004. Aaron Khoo and Ian Horswill. \"HIVEMind: Grounding Inference in Cooperative Activity,\" Journal of Robotics and Autonomous Systems, 43(2-3):85-96, May 2003. Ian Horswill. \"Cerebus: A Higher-Order Behavior-Based System.\"  AI Magazine, 2001. Ian Horswill. \"Tagged Behavior-based Architectures: Integrating Cognition with Embodied Activity.\" IEEE Intelligent Systems, September/October 2001, pp 30-38. IEEE Computer Society, NY. Horswill, Ian. \"A Laboratory Course in Mobile Robotics,\" I",
  "content_length": 20620,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:23"
}