{
  "name": "Ian E. Pratt",
  "homepage": "http://www.cs.man.ac.uk/~ipratt",
  "status": "success",
  "content": "Homepage of Ian Pratt-Hartmann (Ian Pratt) Homepage of Dr Ian Pratt-Hartmann Ian Pratt-Hartmann studied mathematics and philosophy at Brasenose College, Oxford, and philosophy at Princeton and Stanford Universities, gaining his PhD. from Princeton in 1987. He is currently Senior Lecturer in the Department of Computer Science at the University of Manchester. Since February, 2014, Dr. Pratt-Hartmann has held a joint appointment in the Institute of Computer Science at the University of Opole. Dr. Pratt-Hartmann's research interests range widely over the field of AI and cognitive science, including computational logic, spatial logic and natural language semantics. For those who are interested in that sort of thing, here is a link to his Google Scholar page, and here is a link to his Web Of Science profile. News and current affairs Watch my exciting YouTube® channel Fragments of First-Order Logic. Interesting new book on Computational Logic: Fragments of First-Order Logic, Oxford University Press, ISBN 978 0 19 286796 4, 650 pp., 2023 (slightly cheaper on Amazon, also available in various electronic formats). Report: Why are so many academics left-wing? arXiv repository Preliminary versions of many of Ian Pratt-Hartmann's papers are posted on the arXiv pre-print server. Select Bibliography The following papers form a representative sample of Ian Pratt-Hartmann's work. Many conference papers are omitted: click here for a (reasonably up-to-date) full bibliography. Note that some links on this page are to pre-print versions; please check with the published versions when quoting. Books Ian Pratt-Hartmann: Fragments of First-Order Logic, Oxford University Press, ISBN 978 0 19 286796 4, 650 pp., 2023 (electronic formats). Marco Aiello, Ian Pratt-Hartmann and Johan van Benthem: Handbook of Spatial Logics, Springer, 2007. 1058 p., Hardcover, ISBN: 978-1-4020-5586-7. Ian Pratt: Artificial Intelligence, London: Macmillan, 1994. (pp. 280). ISBN 0333 597599. Click here for the preface. Submitted papers Currently none Forthcoming work Currently none. Word combinatorics Ian Pratt-Hartmann: \"Walking on Words\", in 35th Annual Symposium on Combinatorial Pattern Matching (CPM 2024), pp. 25:1--25:17. Computational Logic Bartosz Bednarczyk, Daumantas Kojelis and Ian Pratt-Hartmann: The Adjacent Fragment and Quine's Limits of Decision, Journal of Logic and Computation, 35(6), 2025, pp. 1--36 (author-final version). Bartosz Bednarczyk, Daumantas Kojelis and Ian Pratt-Hartmann: ``On the Limits of Decision: the Adjacent Fragment of First-Order Logic'', in 50th International Conference on Automata, Languages and Programming (ICALP 2023), pp. 111:1--21. Ian Pratt-Hartmann and Lidia Tendera: ``Adding Transitivity and Counting to the Fluted Fragment'', 31st EACSL Annual Conference on Computer Science Logic (CSL 2023), pp. 32:1--32:22, Leibniz International Proceedings in Informatics (LIPIcs), 2023 Ian Pratt-Hartmann and Lidia Tendera: The fluted fragment with transitive relations, Annals of Pure and Applied Logic 173, 2022, art. 103042, pp. 1--43. ( author-final version). Ian Pratt-Hartmann: Fluted Logic with Counting, 48th International Colloquium on Automata, Languages and Programming (ICALP 2021), pp. 141:1--141:17, Leibniz International Proceedings in Informatics (LIPIcs), 2021 Ian Pratt-Hartmann, Wiesław Szwast and Lidia Tendera: The Fluted Fragment Revisited, Journal of Symbolic Logic, vol 84(3), 2019, pp. 1020--1048 (author-final version). Ian Pratt-Hartmann and Lidia Tendera: The Fluted Fragment with Transitivity, Forty-fourth International Symposium on Mathematical Foundations of Computer Science (MFCS 2019), 18:1--15 Leibniz International Proceedings in Mathematics, vol. 138. Ian Pratt-Hartmann: The Finite Satisfiability Problem for Two-Variable, First-Order Logic with one Transitive Relation is Decidable, Mathematical Logic Quarterly, 64(3), 2018, pp. 218--248. Emanuel Kieroński, Ian Pratt-Hartmann and Lidia Tendera: Two-variable logics with counting and semantic constraints, ACM SIGLOG News, Volume 5(3), 2018, pp. 22--43 (Alternative source). Georgios Kourtis and Ian Pratt-Hartmann: Adding Path-Functional Dependencies to the Guarded Two-Variable Fragment with Counting, Logical Methods in Computer Science, Vol. 13 (4:4), 2017, pp. 1--39. Emanuel Kieroński, Ian Pratt-Hartmann and Lidia Tendera: \"Equivalence closure in the two-variable guarded fragment\", Journal of Logic and Computation, 27(4), 2017, pp. 999--1021. Ian Pratt-Hartmann, Wiesław Szwast and Lidia Tendera: Quine's Fluted Fragment is Non-elementary, in Jean-Marc Talbot and Laurent Regnier (Eds.), Proceedings, 25th EACSL Annual Conference on Computer Science Logic (CSL 2016), LIPICS, pp. 39:1--39:21. Ian Pratt-Hartmann: \"The two-variable fragment with counting and equivalence\", Mathematical Logic Quarterly, 61(6), 2015, pp. 474--515 (open access). Ian Pratt-Hartmann \"Logics with counting and equivalence\", Proceedings of the Joint Meeting of the Twenty-Third EACSL Annual Conference on Computer Science Logic (CSL) and the Twenty-Ninth Annual ACM/IEEE Symposium on Logic in Computer Science (LICS), Art. 76, 2014. (Author-final version.) Emanuel Kieroński, Jakub Michaliszyn, Ian Pratt-Hartmann and Lidia Tendera: \"Two-variable First-order Logic with Equivalence Closure\" , SIAM Journal on Computing, 43(3), 2014, pp. 1012--1063. Emanuel Kieroński, Jakub Michaliszyn, Ian Pratt-Hartmann and Lidia Tendera: \"Two-variable First-order Logic with Equivalence Closure'', in Proceedings, 27th Annual IEEE Symposium on Logic in Computer Science (LICS '12), IEEE Press, 2012, pp. 431--440. Angelo Montanari, Ian Pratt-Hartmann and Pietro Sala: \"Decidability of the Logics of the Reflexive Sub-interval and Super-interval Relations over Finite Linear Orders'', in N. Markey and J. Wijsen (eds.): Temporal Representation and Reasoning (TIME 2010), IEEE Press, 2010, pp. 27--34 (author-final version). Ian Pratt-Hartmann: \"The Two-Variable Fragment with Counting Revisited\", in A. Dawar and R. de Queiroz (Eds.): WoLLIC 2010, LNAI 6188, pp. 42--54, 2010 (author-final version). Yevgeny Kazakov and Ian Pratt-Hartmann: \"A note on the complexity of the satisfiability problem for graded modal logic\", in Proceedings, 24th Annual IEEE Symposium on Logic in Computer Science (LICS '09), IEEE Press, 2009, pp. 407--416. (Full version of the paper posted on http://arxiv.org). Ian Pratt-Hartmann Data-Complexity of the Two-Variable Fragment with Counting Quantifiers, Information and Computation, 207(8), 2009, pp. 867--888 (pre-print version posted on http://arxiv.org ). Ian Pratt-Hartmann \"On the Computational Complexity of the Numerically Definite Syllogistic and Related Logics'', Bulletin of Symbolic Logic, 14(1), 2008, pp. 1--28 (pre-print version posted on http://arxiv.org). Ian Pratt-Hartmann \"Complexity of the Guarded Two-Variable Fragment with Counting Quantifiers'', Journal of Logic and Computation, 17(1), 2007, pp. 133--155. (A preprint version may be found on the ArXiv preprint server.) Ian Pratt-Hartmann \"Complexity of the Two-Variable Fragment with Counting Quantifiers'' , Journal of Logic, Language and Information, 14(3), 2005, pp. 369--395 (author-final version). Hans de Nivelle and Ian Pratt-Hartmann: \"A resolution-based decision procedure of the two-variable fragment with equality'' in R. Gore, A. Leitsch and T. Nipkow (Eds.): IJCAR 2001, LNCS 2083, pp. 211--255, 2001. Natural language and logic Tharindu Madusanka, Marco Valentino, Iqra Zahid, Ian Pratt-Hartmann and Riza Batista-Navarro: Unravelling the Logic: Investigating the Generalisation of Transformers in Numerical Satisfiability Problems, Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 25155--25168, 2025. Tharindu Madusanka, Ian Pratt-Hartmann and Riza Batista-Navarro: Natural Language Satisfiability: Exploring the Problem Distribution and Evaluating Transformer-based Language Models, Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 15278--15294, 2024 (recipient of Best Non-Publicized Paper Award). Tharindu Madusanka, Riza Batista Navarro and Ian Pratt-Hartmann: \"Identifying the limits of transformers when performing model-checking with natural language\", Proceedings of the 17th Conference of the European Chapter of the Association for Compuational Linguistics (EACL), pp. 3539--3550, 2023 (recipient of EACL Outstanding Paper Award). Viktor Schlegel, Kamen Pavlov and Ian Pratt-Hartmann: \"Can Transformers Reason in Fragments of Natural Language?\", Proceedsings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP), pp. 11184--11199, 2022 (also available on arXiv). Ian Pratt-Hartmann: \"Semantic complexity in Natural Language\", in S. Lappin and Chris Fox (eds.) The Handbook of Contemporary Semantic Theory, 2nd Edition, Wiley Blackwell, 2015, pp. 429--454. (Author-final-version.) Ian Pratt-Hartmann: The Relational Syllogistic Revisited, Linguistic Issues in Language Technology, 9, 2014, pp. 195--227. (Author-final-version.) Ian Pratt-Hartmann: The Syllogistic with Unity, Journal of Philosophical Logic, 42(2),2013 , pp 391-407 (author-final version). Ian Pratt-Hartmann: The Hamiltonian Syllogistic, Journal of Logic, Language and Information, 20(4), 2011, pp. 445--474 (preprint version posted on on the ArXiv preprint server ). Ian Pratt-Hartmann: Computational Complexity in Natural Language, in A. Clark, C. Fox and S. Lappin (eds.) The Handbook of Computational Linguistics and Natural Language Processing, Wiley-Blackwell, 2010, pp. 43--73, (author-final version). Ian Pratt-Hartmann and Lawrence S. Moss Logics for the Relational Syllogistic, Review of Symbolic Logic, 2(4), 2009, pp. 647--683 (pre-print version posted on http://arxiv.org ). Ian Pratt-Hartmann No syllogisms for the numerical syllogistic, in Grumberg et al. (Eds.): Languages: from Formal to Natural, LNCS 5533, Springer, 2009,",
  "content_length": 19841,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:18"
}