{
  "name": "Ian Oakley",
  "homepage": "https://wit.kaist.ac.kr",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationWearable and Interactive Technology LabSchool of Electrical Engineering, KAISTThe Wearable and Interactive Technology Lab in the School of Electrical Engineering at KAIST focuses on the design, development, and evaluation of wearable, physical, and tangible interactive computing systems. Bringing together design perspectives, computer science skills, and psychological methods, the WIT lab conceives, creates, and studies the next generation of human-computer interfaces. We are hiring! We are actively recruiting new MSc and PhD students. If you are interested in joining WIT Lab, contact Ian Oakley (ianoakley@kaist.ac.kr / ian.r.oakley@gmail.com). Please include your CV, transcript, and a brief cover letter. We are recruiting interns for January/February 2026 - apply by November 26th!. Check the process and project list here and get in touch (ian.r.oakley@gmail.com) if you have any questions.  NewsUIST'25. The lab helped organize UIST'25, with Ian serving as general co-chair (with the amazing Jeeeun Kim), Jiwan as registration co-chair, and Mingyu as video recording co-chair. Yonghwan also presented his first UIST paper.  Check the event out on the UIST'25 flickr, Thank you to all the people who helped make UIST'25 happen. Looking forward to UIST'26! [October 2025]New arrivals. With the start of the fall semester, Ammar Al-Taie joined the lab as a post-doc, Hyunyoung Han as a PhD student, and Hohurn Jung as an MSc student. Welcome all! [September 2025]Faculty job. Lab alumnus Hyunjae Gil (who graduated when the lab was based at UNIST) has started as a faculty member at DGIST. Welcome back to Korea, Hyunjae - looking forward to working together again in the future! [September 2025]Paper accepted to IJHCS. Yonghwan Shin (UNIST) published a paper documenting the disruptions to pointing on HMDs caused by walking. Thanks to collaborators at Instituto Superior Técnico! [August 2025]Paper accepted to UIST'25. Yonghwan Shin (UNIST) led work to improve the stability of head pointing during the use of HMDs while walking. Looking forward to going back to Busan! [July 2025]Short paper at ETRA'25. Yeji Park published her undergraduate internship project on hand-eye coordination errors during interaction in VR and AR. Congratulations to Yeji and her graduate student mentor Jiwan Kim! [May 2025]Workshop at Ubicomp/ISWC'25. Jiwan Kim and Ian Oakley are co-organizing \"BeyondSound: The First Workshop on Intelligent Acoustic Sensing on Wearables\" at Ubicomp/ISWC'25 in Finland in October 2025. We have an amazing team of co-organizers from  Cornell, Google, UMBC, UT Austin, and U. Michigan. Submit by July 4, 2025! [May 2025]Arduino featured one of our CHI'25 papers, on multi-finger interaction with an earbud, on its LinkedIn page: ❤️ Arduino! [May 2025]Three papers and two posters were accepted to ACM CHI 2025. Two papers cover wearable input and interaction - one using sonar to interact with smartwatches and the other exploring finger identification input on earbuds. The final paper, a collaboration with SKKU and Samsung R&D, explores the usability issues of password checkup services. We also have two LBW posters on gesture-based authentication and alleviating dry-eye by promoting blinking during smart glass use. Looking forward to a busy CHI in Yokohama! [Feb 2025]Graduations! Eunyong Cheon (PhD), Hongmin Kim (PhD), and Mingyu Han (MSc), lab students at UNIST, all graduated on Feb 20th. Huge congratulations. Eunyong and Mingyu will continue their research as a post-doctoral scholar and PhD student at WIT Lab, while Hongmin has started his career at LG CNS Entrue Consulting.  [Feb 2025]Winter Interns: WIT Lab is looking for interns for Jan/Feb 2025. Take a look at the projects (click here) and apply via email to Ian Oakley <ianoakley@kaist.ac.kr>. Applications are due on Monday, 25th November [Nov 2024]UIST'25 General Co-Chair: Ian Oakley will serve as general co-chair for UIST'25, which will be held in Busan, Korea Sept 28-1st Oct 2025. I am looking forward to working with my star co-chair, Jeeeun Kim from Texas A&M, over the next year! [Oct 2024]Student Innovation Contest (SIC) at UIST'24: WIT Lab graduate student Jiwan Kim and undergraduate intern Hohurn Jung won the UIST'24 SIC People's Choice Award for a glove that gives its wearer superpowers. Three hours of hard work demoing the system in Pittsburgh paid off - congratulations! [Oct 2024]Paper accepted to VRST'24: in collaboration with colleagues at Aarhus University and the University of Konstanz we explored how psuedo-haptic feedback can enhance virtual reality training simulations - read more here. [Sept 2024]DIS'25 Program Co-Chair: Ian Oakley is one of the program co-chairs of ACM DIS'25, which will be held in Madeira, Portugal, in July 2025. Really excited to be part of an amazing team with Qian Yang from Cornell and Clement Zheng from NUS. Looking forward to a great event. [July 2024]Paper accepted to IJHCS: Together with colleagues at The University of Melbourne and UNIST, we investigated how users experience emotions when browsing social media in the wild - read more here. [June 2024]Paper accepted to ACM DIS'2024: Together with colleagues at UNIST Design, we studied the design space for augmented reality systems to support team dance learning - read more here. [May 2024]Workshop CfP Open: Join us at Ubicomp 2024 in Melbourne to discuss the latest research on Heads Up Computing. Submissions are due by July 7th. [May 2024]SIG at CHI'2024: Together with other members of the Asian SIGCHI Committee, Ian Oakley organized a discussion on HCI education in Asia, attracting around 50 attendees! We hope to use these insights to help support the development of HCI degree programs in Asia. [May 2024]Scholarship Awarded: Jiwan Kim, a PhD student in WIT Lab, received one of the prestigious inaugural presidential science scholarships for graduate students (acceptance rate of 4% and support of 96M KRW over four years). Congratulations Jiwan! [April 2024]Summer Interns: WIT Lab is looking for interns for July/August 2024. Take a look at the projects (click here) and apply via email to Ian Oakley <ianoakley@kaist.ac.kr>. Applications are due on Friday 24th May. [April 2024]Ubicomp 2024 Posters and Demos: I'm co-chairing Ubicomp 2024 Posters and Demos. Submit by 31st May 2024 and join us for an exciting Ubicomp program in Melbourne in October. [March 2024]Paper accepted to ACM CHI'2024:  SkullID studies a novel bioacoustic biometric for smart glasses. Thanks to collaborators at UNIST and Samsung Research. [March 2024]ProjectsCross, Dwell, or Pinch: Exploring sonar input on watcheshttps://doi.org/10.48550/arXiv.2503.02308 (preprint)BudsID: Finger Identification Input for Earbudshttps://doi.org/10.48550/arXiv.2503.02309 (preprint)Supporting Group Dance Practicehttps://dl.acm.org/doi/10.1145/3643834.3661568SonarID: Sensing fingers around a smartwatchhttps://doi.org/10.1145/3491102.3501935FingerText: Typing on fingernails for ARhttps://doi.org/10.1145/3411764.3445106Gestures passwords for device lockhttps://doi.org/10.1109/SP40000.2020.00034Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 7240,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:24"
}