{
  "name": "Ian Reid 0001",
  "homepage": "https://mbzuai.ac.ae/study/faculty/ian-reid",
  "status": "success",
  "content": "Ian Reid - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Ian Reid Ian Reid Department Chair and Professor of Computer Vision Research Interests Professor Reid has a 30-year history of contributions across a wide range of computer vision areas including active vision, visual SLAM, visual geometry, human motion capture and visual surveillance. His current interests see a convergence of many of these themes under the umbrellas of spatial AI and embodied AI. His research aims to endow real physical agents with life-long visual learning capabilities, common-sense reasoning, and spatial awareness through video understanding for real-time robotic decision-making. Email Share Prior to joining MBZUAI, Reid was Prior to joining MBZUAI, Professor Reid was Head of School and Professor of Computer Science at the University of Adelaide in Australia. As well as, a fellow of the Australian Academy of Technological Sciences and Engineering (ATSE), the Australian Academy of Science (AAS) and a former Rhodes Scholar, Professor Reid held an Australian Laureate Fellowship from 2013–2018 in recognition of his contribution to building Australia’s internationally competitive research capacity. Professor Reid was the Deputy Director of the Australian Centre for Robotic Vision from 2014–2021 and, in 2022, was awarded the Australian Computer Society’s Artificial Intelligence Distinguished Researcher Award in recognition of his outstanding contributions to research in computer vision and machine learning. During his career, Professor Reid has secured more than US$20 million in funding as principal investigator, has registered three patents, is supervising nine Ph.D. students currently and has successfully supervised 29 doctoral and three postgraduate students to completion. DPhil in computer vision from the University of Oxford, England, 1992 Bachelor of Science in computer science with first class honours from the University of Western Australia, 1987. Best Paper Award (with Dung Doan et al), Robotics and Autonomous Systems Letters, 2022 ACS Australasian AI Distinguished Research Contribution Award, 2022 Fellow, Australian Academy of Science, 2021 Best Paper Award (with Dung Doan et al), DICTA, 2019 Winner, Amazon Robotics Challenge (Team ACRV), 2017 Fellow, Academy of Technological Sciences and Engineering, 2016 Best Paper Award (with Zongyuan Ge et al), DICTA, 2016 Named as one of the “Knowledge Nation 100” by The Australian, 2015 ARC Australian Laureate Fellowship, 2013—2018 Best Paper Award (with Michael Milford et al), IEEE Workshop on Vehicle Technology, 2015 Best Paper Award (with Carl Ren, Victor Prisacariu and David Murray), 3DV 2014 Best reviewer award, CVPR 2015, RSS 2014 Dennis Moore Oration, Australian Computer Society WA Branch, 2013 Winner, Freescale Sense the World video competition (with V Prisacariu), 2010 Best Industrial Paper (with A Patron, M. Marsalek and A Zisserman), British Machine Vision Conference, 2010 Best Student Poster (with B Benfold), British Machine Vision Conference, 2009 Best Paper Award (with O Woodford, P Torr and A Fitzgibbon), IEEE Computer Vision and Pattern Recognition, 2008 Best Science Paper (with Philip Tresadern), British Machine Vision Conference, 2003 EPSRC Advanced Research Fellowship, 1997 Violette and Samuel Glasstone Fellowship, 1993 Rhodes Scholarship (Western Australia), 1987/88 ACS WA (top student) and IBM WA (best Honours thesis) prizes in Computer Science, University of Western Australia, 1987 Chairing/executive positions: Conference Area Chair, International Conference on Computer Vision (2023) Program Chair, Indian Conference on Computer Vision, Graphics and Image Processing (2023) Member, The Kingston AI Group (2022– ) Chair, Advisory Board, Cyber Physical Systems Program at CISRO Data61 (2020– ) General Chair, Asian Conference on Computer Vision (2018) Co-Chair, Australian National Roadmap for Robotics (2017–2018) Committee Member, Australian Academy of Sciences, National Committee for Information and Communications Sciences (2014–2018) Editorial board of Computer Vision and Image Understanding (2013–2018) Co-Chair, Academy of Science Expert Committee on Future Science for Autonomous Systems in Complex Environments (2016–2017) Editorial board of the Institute of Electrical and Electronics Engineers’ Transactions on Pattern Analysis and Machine Intelligence (2010–2017) Program Chair, Fourth International Conference on 3D Vision (2016) Program Chair, 12th Asian Conference on Computer Vision (2014) Reid has also been area chair numerous times for CVPR, ICCV, ECCV, RSS and ICRA. Reid is the author of some 300 peer-reviewed publications that have received more than 47,000 citations and an h-index of 101. Guosheng Lin, Chunhua Shen, Anton van den Hengel, Ian Reid, Exploring Context with Deep Structured models for Semantic Segmentation, vol PP, DOI 10.1109/TPAMI.2017.2708714, T-PAMI, 2017 Cesar Dario Cadena Lerma, Luca Carlone, Henry Carrillo, Yasir Latif, Davide Scaramuzza, Jose Neira, Ian Reid and John Leonard, Past, Present, and Future of Simultaneous Localization And Mapping: Towards the Robust-Perception Age, IEEE Transactions on Robotics, vol 32, num 6, Dec 2016 Garg, Vijay BG Kumar, G. Carneiro and I Reid, Unsupervised CNN for Single View Depth Estimation: Geometry to the Rescue. European Conference on Computer Vision, 2016 Benfold and I. D. Reid, Stable Multi-Target Tracking in Real-Time Surveillance Video, in Proceedings of Computer Vision and Pattern Recognition (CVPR), 2011. Woodford, P. Torr, I. D. Reid and A. Fitzgibbon, Global Stereo Reconstruction under Second Order Smoothness Priors, IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI), vol 31, no 12, 2009. Charles Bibby and Ian Reid, Robust Real-Time Visual Tracking using Pixel-Wise Posteriors, Proceedings of the European Conference on Computer Vision (ECCV), 2008 Davison, I. D. Reid, N. Molton and O. Stasse, MonoSLAM:  Real-time Single Camera SLAM, IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI), vol. 29, no. 6, pp 1052-1067, 2007. Deutscher and I. D. Reid, Articulated body motion capture by stochastic search, International Journal of Computer Vision (IJCV), Vol. 61, No. 2, 2005. H Rezatofighi, N Tsoi, JY Gwak, A Sadeghian, I Reid, S Savarese, Generalized intersection over union: A metric and a loss for bounding box regression. Proceedings of the IEEE/CVF conference on computer vision and pattern, 2019. Criminisi, I. D. Reid and A. Zisserman, Single view metrology,  International Journal  of Computer Vision, vol. 40(2), pp 123–148, 2000. Related Monday, October 27, 2025 Smoothing the way for in-context robot learning Researchers at MBZUAI have developed a novel tokenization method designed to improve robotic motion, precision, reliability, and… motion tokenization robots IROS robot learning robotics Read more Friday, September 12, 2025 Hisham Cholakkal wins inaugural MBZUAI teaching award The Assistant Professor of Computer Vision was recognized by the University’s Center for Teaching and Learning for… faculty achievements CTL Teaching impact award faculty computer vision Read more Thursday, April 24, 2025 MBZUAI to showcase AI innovation at Machines Can See 2025 with expert speakers and live demos Mohamed bin Zayed University of Artificial Intelligence (MBZUAI) will participate as an official partner at Machines Can… robotics artificial intelligence Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 8904,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:27"
}