{
  "name": "Ian Horrocks 0001",
  "homepage": "http://www.cs.ox.ac.uk/ian.horrocks",
  "status": "success",
  "content": "Ian Horrocks | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyIan HorrocksIan Horrocks Professor Ian Horrocks FRSProfessor of Computer ScienceFellow, Oriel CollegeE: ian.horrocks@cs.ox.ac.ukT: +44 1865 273939Themes:Data, Knowledge and ActionArtificial Intelligence and Machine LearningCompleted Projects:HermiTConDORSEALSExODAQueReScore!OptiqueDBOntoED3ConCurInterestsMy research interests include knowledge representation, ontologies and ontology languages, modal and description logics, automated reasoning, implementation and optimisation of reasoning systems, and applications in areas such as e-Science and the Semantic Web. Activities (selected) Editor in Chief of the new diamond open access jounal Transactions on Graph Data and Knowledge (TGDK)Founder of Oxford Semantic Technologies Publications You might be interested in An Introduction to Description Logics, a book that I co-authored (with Franz Baader, Carsten Lutz and Uli Sattler). A complete list of my publications, along with downloadable pdfs. Lists of selected, recent, and most-cited publications are also available. If you are a glutton for punishment you could also look at my Google Citations profile, or my DBLP entry. Presentations Slides from selected keynotes, seminars, tutorials and other presentations. Tools & Datasets The group has developed many tools , including, e.g., HermiT , a highly optimised OWL 2 reasoner, ELK , a consequence based OWL 2 EL reasoner, PAGOdA , a pay-as-you-go OWL 2 query answering system, RDFox , a highly scalable RDF triple store, and SemFacet , a semantic faceted search system. We also maintain a library of ontologies and datasets . Doctoral Study in Computer Science Students working towards their D.Phil (PhD) are an integral part of the Data and Knowledge Group, and make a vital contribution to our research. See our studentships page for further details, and information about funding opportunities . You might also be interested in this page about Oxford Alumnae, one of whom (Despoina Magka) did her DPhil in the KRR group and is now at Facebook. Other Links ProjectsNew & EventsOxford ImpactsSelected PublicationsView AllManage publications Faithful Rule Extraction for Differentiable Rule Learning Models Ian Horrocks Xiaxia Wang David J. Tena Cucala Bernardo Cuenca Grau In The Twelfth International Conference on Learning Representations. 2024. Details about Faithful Rule Extraction for Differentiable Rule Learning Models | BibTeX data for Faithful Rule Extraction for Differentiable Rule Learning Models | Link to Faithful Rule Extraction for Differentiable Rule Learning Models Current Students Eva FengMatthew  MorrisKaalkidan SaheleJingchuan  ShiXiaxia Wang Past Students Temitope AjileyeAna ArmasAndrew BateFederico IgneShuwen LiuDespoina MagkaHector Perez-UrbinaMaximilian PflügerRob ShearerFrantisek SimancikXinyue  ZhangYujiao Zhou Past Researchers Jiaoyan ChenSenior ResearcherJieying ChenYuan HeResearch AssociatePan HuAlina PetrovaAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 3272,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:21"
}