{
  "name": "Ian Bogost",
  "homepage": "https://engineering.washu.edu/faculty/Ian-Bogost.html",
  "status": "success",
  "content": "Ian Bogost | WashU McKelvey School of Engineering Education PhD, University of California, Los Angeles, comparative literature, 2004 MA, University of California, Los Angeles, comparative literature, 2001 BA, University of Southern California, philosophy & comparative literature, 1998 Expertise Philosopher, computationalist and award-winning game designer Research Ian Bogost is internationally recognized for his writing on video games and media studies. He is the author of 11 books, several book series, many book chapters and journal articles. His research approaches media studies from the perspective of both a critic and a practitioner. While in graduate school, Bogost also worked for tech companies in the digital media space. He will bring that technical humanist experience to Washington University and will boost the university's growing expertise in video games and new media through his primary appointment in Arts & Sciences and secondary appointment in McKelvey Engineering. Bogost’s games about social and political issues cover topics as varied as airport security, consumer debt, disaffected workers, the petroleum industry, suburban errands, pandemic flu, and tort reform. His games have been played by millions of people and exhibited or held in collections internationally, at venues including the Smithsonian American Art Museum; the Telfair Museum of Art; The San Francisco Museum of Modern Art; The Museum of Contemporary Art, Jacksonville; the Laboral Centro de Arte; and The Australian Centre for the Moving Image. Biography Ian Bogost's 11 books include Persuasive Games: The Expressive Power of Videogames, Racing the Beam: The Atari Video Computer System (with Nick Montfort), Alien Phenomenology, or What it’s Like to Be a Thing, and Play Anything: The Pleasure of Limits, the Uses of Boredom, and the Secret of Games. Bogost is also a contributing editor at The Atlantic, where he writes and edits on science, technology, design and culture. He is also co-editor of the Platform Studies book series, about how the technical design of computing systems influences creativity, and the Object Lessons book and essay series, about the secret lives of ordinary things. Bogost joins McKelvey School of Engineering from Georgia Institute of Technology, where he was the Ivan Allen College Distinguished Chair in Media Studies, professor of interactive computing, of architecture, and in the Scheller College of Business. In addition, he was affiliated faculty with the Graphics Visualization and Usability Center; the Center for 21st Century Universities; and for the Center for the Development and Application of Internet of Things Technologies. He also has an adjunct professorship at Brock University in St. Catherine’s, Ontario, Canada, in the Centre for Digital Humanities. He is a founding partner of and chief designer at Persuasive Games LLC, an independent video game developer, and a contributing editor for The Atlantic. He joined the faculty July 1, 2021. In the News How AI will change your career Digital theorist Ian Bogost (and guests) explore machine learning across industries. 10.08.2025 Games of future past ‘Retro Game Design’ explores history, technology and poetry of the Atari 2600. 10.17.2023 Bogost named Barbara and David Thomas Distinguished Professor Ian Bogost was installed as the Barbara and David Thomas Distinguished Professor March 29. 05.30.2023 Find more news about Ian Bogost",
  "content_length": 3440,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:15"
}