{
  "name": "Ian Daly",
  "homepage": "https://www.essex.ac.uk/people/dalyi03400/ian-daly",
  "status": "success",
  "content": "Ian Daly | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Ian Daly People Dr Ian Daly Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email i.daly@essex.ac.uk Telephone +44 (0) 1206 872015 Location 1NW.5.3D, Colchester Campus Academic support hours My Academic Support Hours will be 9-10 on Tuesday and Friday. I am available on Zoom and in my office. Zoom: the link for this is available from my profile on my CE161-NW/CE162-NW course MOODLE page. Please wait in the waiting room until I can admit you. In person: My office is 1NW.5.3D Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography I received an M.Eng. degree in Computer science in 2006 and a Ph.D. degree in Cybernetics in 2011 from the University of Reading, U.K. Between May 2011 2013 I worked as a post-doctoral researcher in the Laboratory of Brain-Computer Interfaces, Graz University of Technology, Graz, Austria. There I researched Brain-computer interfaces (BCIs) for individuals with stroke and cerebral palsy. I then worked for three years in the University of Reading developing BCIs for music therapy. Research and professional activities Research interests Brain-computer interfacing Research and development of devices to support communication between the human brain and a computer. Key words: Brain-computer interfacing Machine learning Understanding how computers can be taught to recognise, identify, and/or predict patterns in data. Key words: Machine learning Signal processing Key words: Signal processing Functional neural connectivity Understanding and modelling how neural activity in different brain areas relate to one another and how these relationships change over time and with function. Key words: Functional connectivity EEG Use of EEG to measure and understand brain function, development of signal processing and machine learning methods to understand the EEG, and the use of EEG in the control of brain-computer interfaces. Key words: EEG fNIRS Key words: fNIRS fMRI Key words: fMRI Motor control Understanding the human motor system and how the brain acts to plan and coordinate movement. Key words: Motor control Motor rehabilitation Development of BCI systems to aid movement rehabilitation after injury or disease. Key words: Motor rehabilitation Brain stimulation Use of brain stimulation to explore motor control, movement planning, and motor learning. Key words: Brain stimulation Teaching and supervision Current teaching responsibilities Fundamentals of Digital Systems (CE161) Digital Electronic Systems (CE162) Current supervision Alberto Sebastian Tates Puetate Thesis title: Reassessing the Viability of Speech Imagery as a Bci Paradigm Degree subject: Computer Science Degree type: Doctor of Philosophy Vishnu Pratap Singh Kirar Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Lena Marreel Thesis title: Learning to Move: Exploring the Neural Dynamics of Motor Learning Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 10/4/2025 Zilu Wang Thesis title: Eeg Based Analysis and Decoding of Multiple Actions in Separate Lower Limbs for Brain Computer Interfacing Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 25/2/2025 Federica Armani Thesis title: Physiological Correlates of Math Anxiety for Neuroadaptive Learning Systems Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 30/9/2024 Milan Rybar Thesis title: Towards Eeg/Fnirs-Based Semantic Brain-Computer Interfacing Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 14/2/2023 Publications Journal articles (81) Abdollahpour, N., Artan, S., Daly, I., Yazdchi, M. and Baharlouei, Z., Effective Connectivity-Based Unsupervised Channel Selection Method for EEG. Journal of Medical Signals and Sensors Jin, J., Xiao, W., Daly, I., Weijie, C., Xinjie, H., Xingyu, W. and Andrzej, C., (2025). Squeeze and Excitation-Based Multiscale CNN for Classification of Steady-State Visual Evoked Potentials. IEEE Internet of Things Journal. 12 (5), 5822-5833 Jin, J., Zhao, X., Daly, I., Li, S., Wang, X. and Cichocki, A., (2025). A Growing Bubble Speller Paradigm for Brain-Computer Interface Based on Event-related Potentials. IEEE Transactions on Biomedical Engineering. 72 (3), 1188-1199 Daly, I., Matran-Fernandez, A., Lebedev, MA., Kübler, A. and Valeriani, D., (2025). Editorial: Datasets for brain-computer interface applications, volume II. Frontiers in Neuroscience. 19, 1569216- Rybar, M., Poli, R. and Daly, I., (2025). Simultaneous EEG and fNIRS recordings for semantic decoding of imagined animals and tools. Scientific Data. 12 (1), 613- Tates, A., Matran-Fernandez, A., Halder, S. and Daly, I., (2025). Speech Imagery Brain-Computer Interfaces: A Systematic Literature Review. Journal of Neural Engineering. 22 (3), 031003-031003 Zhao, R., Daly, I., Chen, Y., Wu, W., Liu, L., Wang, X., Cichocki, A. and Jin, J., (2025). MSAttNet: Multi-scale attention convolutional neural network for motor imagery classification. Journal of Neuroscience Methods. 424, 110578-110578 Rybar, M., Poli, R. and Daly, I., (2024). Corrigendum: Decoding of semantic categories of imagined concepts of animals and tools in fNIRS. Journal of Neural Engineering. 21 (2), 029501-029501 Jin, J., Xu, R., Daly, I., Zhao, X., Wang, X. and Cichocki, A., (2024). MOCNN: A Multi-scale Deep Convolutional Neural Network for ERP-based Brain-Computer Interfaces. IEEE Transactions on Cybernetics. 54 (9), 5565-5576 Li, S., Daly, I., Guan, C., Cichocki, A. and Jin, J., (2024). Inter-participant transfer learning with attention based domain adversarial training for P300 detection. Neural Networks. 180, 106655-106655 Rybar, M., Poli, R. and Daly, I., (2024). Using data from cue presentations results in grossly overestimating semantic BCI performance. Scientific Reports. 14 (1), 28003- Daly, I., Williams, N. and Nasuto, SJ., (2024). TMS-evoked potential propagation reflects effective brain connectivity. Journal of Neural Engineering. 21 (6), 066038-066038 Liang, W., Jin, J., Daly, I., Sun, H., Wang, X. and Cichocki, A., (2023). Novel channel selection model based on graph convolutional network for motor imagery. Cognitive Neurodynamics. 17 (5), 1283-1296 Daly, I., (2023). Neural decoding of music from the EEG. Scientific Reports. 13 (1), 624- Sun, H., Jin, J., Daly, I., Huang, Y., Zhao, X., Wang, X. and Cichocki, A., (2023). Feature learning framework based on EEG graph self-attention networks for motor imagery BCI systems. Journal of Neuroscience Methods. 339, 109969-109969 Xie, X., Zhang, D., Yu, T., Duan, Y., Daly, I. and He, S., (2023). Editorial: Explainable and advanced intelligent processing in the brain-machine interaction. Frontiers in Human Neuroscience. 17, 1280281- Wu, R., Jin, J., Daly, I., Wang, X. and Cichocki, A., (2023). Classification of Motor Imagery Based on Multi-Scale Feature Extraction and the Channel-Temporal Attention Module.. IEEE transactions on neural systems and rehabilitation engineering. 31, 3075-3085 Li, S., Jin, J., Daly, I., Liu, C. and Cichocki, A., (2022). Feature selection method based on Menger curvature and LDA theory for a P300 brain–computer interface. Journal of Neural Engineering. 18 (6), 066050-066050 Jin, J., Sun, H., Daly, I., Li, S., Liu, C., Wang, X. and Cichocki, A., (2022). A Novel Classification Framework Using the Graph Representations of Electroencephalogram for Motor Imagery based Brain-Computer Interface. IEEE Transactions on Neural Systems and Rehabilitation Engineering. 30, 20-29 Rybář, M. and Daly, I., (2022). Neural decoding of semantic concepts: A systematic literature review.. Journal of Neural Engineering. 19 (2), 021002-021002 Liu, C., Jin, J., Daly, I., Sun, H., Huang, Y., Wang, X. and Cichocki, A., (2022). Bispectrum-based hybrid neural network for motor imagery classification. Journal of Neuroscience Methods. 375, 109593-109593 Liu, C., Jin, J., Daly, I., Li, S., Sun, H., Huang, Y., Wang, X. and Cichocki, A., (2022). SincNet-Based Hybrid Neural Network for Motor Imagery EEG Decoding.. IEEE Transactions on Neural Systems and Rehabilitation Engineering. 30, 540-549 Al-Taie, I., Di Giuseppantonio Di Franco, P., Tymkiw, M., Williams, D. and Daly, I., (2022). Sonic enhancement of virtual exhibits. PLoS One. 17 (8), e0269370-e0269370 Fang, H., Jin, J., Daly, I. and Wang, X., (2022). Feature Extraction Method Based on Filter Banks and Riemannian Tangent Space in Motor-Imagery BCI.. IEEE Journal of Biomedical and Health Informatics. 26 (6), 2504-2514 Daly, I., (2021). Neural component analysis: A spatial filter for electroencephalogram analysis. Journal of Neuroscience Methods. 348, 108987-108987 Miao, Y., Jin, J., Daly, I., Zuo, C., Wang, X., Cichocki, A. and Jung, T-P., (2021). Learning Common Time-Frequency-Spatial Patterns for Moto",
  "content_length": 31506,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:16"
}