{
  "name": "Iasonas Polakis",
  "homepage": "https://www.cs.uic.edu/~polakis",
  "status": "success",
  "content": "Jason Polakis Biography I am an Associate Professor in the Computer Science Department at the University of Illinois at Chicago. I received my B.Sc. (2007), M.Sc. (2009), and Ph.D. (2014) degrees in Computer Science from the University of Crete (Greece) while working as a research assistant in the Distributed Computing Systems Lab at FORTH. Prior to joining UIC, I was a postdoctoral research scientist in the Computer Science Department at Columbia University, and a member of the Network Security Lab. More information is available in my resume. I’m looking for excited and motivated students to work with. Information for PhD applications at UIC can be found here. Research My research interests span several areas of security and privacy. In the past few years I have focused on understanding the security limitations of web browsers and web applications, exploring the privacy threats that users face, and designing robust countermeasures. I’m also actively exploring the shortcomings of authentication and authorization mechanisms, and the robustness of bot-prevention systems. Ultimately my research focuses on understanding the Web’s threat landscape and developing countermeasures and privacy-preserving techniques for better protecting users. Teaching CS 107: Introduction to Computing and Programming: Spring 2025, Fall 2025 CS 468: Network Security : Spring 2021, Spring 2022, Fall 2023, Fall 2024, Fall 2025 CS 568: Advanced Computer Security and Online Privacy : Fall 2020, Spring 2024 CS 361: Systems Programming : Fall 2022 CS 494: Network Security : Spring 2019, Spring 2020 CS 194: Intro to CyberSecurity : Fall 2019 ENGR 194: Intro to CyberSecurity : Fall 2017, Fall 2018 CS 377: Communication and Ethical Issues in Computing : Spring 2017 CS 594: Security and Privacy in the Age of the Social Web : Fall 2016, Spring 2018 Recent Service Program Committee member: USENIX Security 2025, 2026 ACM CCS 2024 (Web Security Track Chair), 2025, 2026 WebConf 2024 (Security Area Chair) SecWeb 2024 (PC Co-Chair) ICDCS 2023 (Security and Privacy track Co-Chair) IEEE Security & Privacy 2023 EuroSec 2023 (PC Co-Chair) Contact Email: polakis@uic.edu Phone: (312) 413-2442 (email is preferred) Office: CDRLC 4460 Mailing address: 3416 CDRLC, MC 152, 850 W. Taylor St. Chicago, IL 60607-7053, USA",
  "content_length": 2311,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:31"
}