{
  "name": "Ibrahim Korpeoglu",
  "homepage": "http://www.cs.bilkent.edu.tr/~korpe/homepage/index.html",
  "status": "success",
  "content": "Ibrahim Korpeoglu Professor Computer Engineering Department Bilkent University, Ankara, Turkey Phone: +90-312-290-2599 Fax: +90-312-266-4047 Office: Engineering EA-401 Email: korpe AT cs.bilkent.edu.tr [Education] [Experience] [Publications] [Research Group] [Students] [Teaching] [Activities] [Awards] [TPC Activities] [Patents] [Personal] [Schedule] Short Biography: Ibrahim Korpeoglu received his Ph.D. and M.S. in Computer Science from University of Maryland at College Park in 2000 and 1996, respectively, under the supervision of Prof. Satish Tripathi. He received his B.S. degree (summa cum laude) in Computer Engineering, from Bilkent University in 1994. He graduated from Ankara Fen Lisesi (high school) and Ankara Anadolu Lisesi (middle school). He was born in Mengen. Since 2002, he is a faculty member in the Department of Computer Engineering of Bilkent University. Before that, he worked in Ericsson, IBM T.J. Watson Research Center, Bell Laboratories, and Bellcore, in USA. He received Bilkent University Distinguished Teaching Award in 2006 and IBM Faculty Award in 2009. He served as Associate Dean of Engineering Faculty between 2016 and 2019, and as Chair of Computer Engineering Department between 2019 and 2021. He is a member of ACM and IEEE. He speaks Turkish (native), English (fluent) and German (advanced). [Full CV] Research Interests: Data Science, Artifical Intelligence for Networks and Systems, Big Data Systems, Computer Networks, Computer Systems, Wireless Networks; Cloud Computing; Internet of Things, and Ad hoc and Sensor network, Virtualization of Networks and Systems, Resource Allocation and Managament. \u0013 Current Courses: CS342 Operating Systems, Fall 2025. CS442 Distributed Systems and Algorithms, Fall 2025. CS491-CS492: Senior Design Project, 2025-2026. (C)opyright Bilkent University - Department of Computer Engineering",
  "content_length": 1866,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:33"
}