{
  "name": "Ibéria Medeiros",
  "homepage": "https://ciencias.ulisboa.pt/perfil/ivmedeiros",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo Ibéria Medeiros Contactos Departamento de Informática Sala/Gabinete 6.3.25 Ext. Principal 526325 Telefone Direto 217500564 Email ivmedeiros@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Associado Indicadores Orcid Google Scholar CiênciaVitae Palavras Chave Deteção de vulnerabilidades Correção de código, Análise estática de códigoAprendizagem máquinaSegurança de software Cibersegurança Keywords Vulnerability detection Code correctionSource code static analysisMachine learningSoftware SecurityCybesecurity Currículo Resumido Ibéria Medeiros é Professora Associada do Departamento de Informática, da Faculdade de Ciências da Universidade de Lisboa (FCUL). É membro integrado da unidade de investigação LASIGE e membro do grupo de investigação Navigators, e membro da IEEE. Doutorou-se em Informática pela FCUL, em 2016. A sua principal área de investigação é em segurança de software, cibersegurança e aprendizagem máquina. Faz investigação em técnicas e modelos, recorrendo à aprendizagem máquina, para o melhoramento do código das aplicações web e programas de produtos industriais, dado que as aplicações web são a mais usada forma de acesso a serviços e os produtos industriais têm de ser providos de sistemas confiáveis e trabalharem corretamente. É (co-)autora de ferramentas de segurança de software que detetam e removem vulnerabilidades em aplicações web e aplicações standalone, corrigindo o seu código, e de mecanísmos e sistemas para cibersegurança visando o melhoramento da qualidade da inteligência de ameaças (proveniente de OSINT) e da deteção de incidentes e intrusões de segurança. É a princiapl investigadora do projeto I2DT. Foi a principal investigadora dos projetos SEAL e XIVT e tem participado em outros projetos, nomedamente ADMORPH, DiSIEM, SEGRID. Pelo seu trabalho de investigação, tem sido sido premiada pelo LASIGE como Melhor Aluna de Doutoramento, em 2016, e Melhor investigadora Júnior, em 2018 e 2019. Interesses Científicos Segurança de software; Análise estática de código; Deteção de Vulnerabilidades; Correção de código; Aprendizagem máquina; Mineração de dados; Processamento de linguagem natural; Segurança; cibersegurança; Inteligência de ameaças cibernéticas, deteção de intrusões, proteção em tempo-real Scientific Interests software security, vulnerability detection, code correction, cybersecurity, cyber threat intelligence, intrusion detection, runtime protection, machine learning, natural language processing, and data mining. Publicações selecionadas Ibéria Medeiros, Nuno Neves, Miguel Correia, Detecting and Removing Web Application Vulnerabilities with Static Analysis and Data Mining, IEEE Transactions on Reliability, Vol. 65, No. 1, pages 54-69, March 2016 Ibéria Medeiros, Nuno Neves, Miguel Correia. Statically Detecting Vulnerabilities by Processing Programming Languages as Natural Language. IEEE Transactions on Reliability. Jan 2022 Ibéria Medeiros, Miguel Beatriz, Nuno Neves, Miguel Correia. SEPTIC: Detecting Injection Attacks and Vulnerabilities Inside the DBMS. IEEE Transactions on Reliability. Vol. 68, No. 3, pages 1168 - 1188, Sept 2019 Paulo Nunes, Ibéria Medeiros, José Fonseca, Nuno Neves, Miguel Correia, Marco Vieira. Benchmarking Static Analysis Tools for Web Security. IEEE Transactions on Reliability. Vol. 67, No. 3, pages 1159 - 1175, Sept 2018 Cláudio Martins, Ibéria Medeiros. Generating Quality Threat Intelligence Leveraging OSINT and a Cyber Threat Unified Taxonomy. ACM Transactions on Privacy and Security, Vol. 25-3, No. 19, pages 1-39, Aug 2022 Ver todas as Publicações Prizes and Awards 2025-04-29 - Menções honrosas de Docência de Excelência em Ciências (Faculdade de Ciências da Universidade de Lisboa)2019-09-30 - Best Young Researcher (LASIGE)2018-09-30 - Best Young Researcher (LASIGE)2018-09-30 - Menções honrosas de Docência de Excelência em Ciências (Faculdade de Ciências da Universidade de Lisboa)2016-09-30 - Best PhD Student (LASIGE)",
  "content_length": 4138,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:37"
}