{
  "name": "Ida-Maria Sintorn",
  "homepage": "https://katalog.uu.se/empinfo/?id=N0-606",
  "status": "success",
  "content": "Ida-Maria Sintorn - Uppsala universitet Ida-Maria Sintorn Professor vid Institutionen för informationsteknologi; Vi3; Bildanalys Telefon: 018-471 34 61E-post: ida.sintorn@it.uu.seBesöksadress: Hus 10, Regementsvägen 10Postadress: Box 337751 05 UPPSALA Ladda ned kontaktuppgifter för Ida-Maria Sintorn vid Institutionen för informationsteknologi; Vi3; Bildanalys Akademiska meriter: civ.ing., Docent Kort presentation Professor in Computerized image processing, at the Vi3: image analysis division, Department of Information Technology. Nyckelord electron microscopymachine learningdeep learningimage processingmaskininlärningartifical intelligenceai Biografi Ida-Maria shares her time between a position as Professor in Computerized image processing at the Vi3 division, Dept. IT, Uppsala University and as CTO at Vironova AB, a biotechnology company offering services and instruments for image based nano-sized particle characterization. She obtained her PhD in computerized image analysis in 2005 from the Centre for Image Analysis, Swedish University of Agricultural Science. She has since then gained industrial as well as academic experience in a variety of image analysis applications working as image analyst at the Mathematical and Information Sciences department of the Commonwealth Scientific and Industrial Research Organization (CSIRO) in Sydney, Australia, as Head of R&D at Vironova AB, and as researcher at both Uppsala University and the Swedish University of Agricultural Sciences. Forskning My main area of research and expertise is image analysis focused towards applications in drug development, cellular, virus and nano-sized particle analysis in fluorescence and electron microscopy images. My theoretical interests are automated microscopy (multi-scale feed back loops steering acqusition), deep learning, feature descriptors (image registration and stiching) and texture analysis (filter banks and local binary patterns) Publikationer Senaste publikationer Efficient High-Resolution Template Matching with Vector Quantized Nearest Neighbour Fields Gupta, Ankit; Sintorn, Ida-Maria Ingår i Pattern Recognition, 2024 DOI för Efficient High-Resolution Template Matching with Vector Quantized Nearest Neighbour Fields Ladda ner fulltext (pdf) av Efficient High-Resolution Template Matching with Vector Quantized Nearest Neighbour Fields Classification of rotation-invariant biomedical images using equivariant neural networks Bengtsson Bernander, Karl; Sintorn, Ida-Maria; Strand, Robin; Nyström, Ingela Ingår i Scientific Reports, 2024 DOI för Classification of rotation-invariant biomedical images using equivariant neural networks Ladda ner fulltext (pdf) av Classification of rotation-invariant biomedical images using equivariant neural networks Evaluating the utility of brightfield image data for mechanism of action prediction Harrison, Philip John; Gupta, Ankit; Rietdijk, Jonne; Wieslander, Håkan et al. Ingår i PloS Computational Biology, 2023 DOI för Evaluating the utility of brightfield image data for mechanism of action prediction Ladda ner fulltext (pdf) av Evaluating the utility of brightfield image data for mechanism of action prediction SimSearch: A Human-in-The-Loop Learning Framework for Fast Detection of Regions of Interest in Microscopy Images Gupta, Ankit; Sabirsh, Alan; Wählby, Carolina; Sintorn, Ida-Maria Ingår i IEEE journal of biomedical and health informatics, s. 4079-4089, 2022 DOI för SimSearch: A Human-in-The-Loop Learning Framework for Fast Detection of Regions of Interest in Microscopy Images Ladda ner fulltext (pdf) av SimSearch: A Human-in-The-Loop Learning Framework for Fast Detection of Regions of Interest in Microscopy Images Towards Better Guided Attention and Human Knowledge Insertion in Deep Convolutional Neural Networks Gupta, Ankit; Sintorn, Ida-Maria 2022 Alla publikationer Artiklar i tidskrift Efficient High-Resolution Template Matching with Vector Quantized Nearest Neighbour Fields Gupta, Ankit; Sintorn, Ida-Maria Ingår i Pattern Recognition, 2024 DOI för Efficient High-Resolution Template Matching with Vector Quantized Nearest Neighbour Fields Ladda ner fulltext (pdf) av Efficient High-Resolution Template Matching with Vector Quantized Nearest Neighbour Fields Classification of rotation-invariant biomedical images using equivariant neural networks Bengtsson Bernander, Karl; Sintorn, Ida-Maria; Strand, Robin; Nyström, Ingela Ingår i Scientific Reports, 2024 DOI för Classification of rotation-invariant biomedical images using equivariant neural networks Ladda ner fulltext (pdf) av Classification of rotation-invariant biomedical images using equivariant neural networks Evaluating the utility of brightfield image data for mechanism of action prediction Harrison, Philip John; Gupta, Ankit; Rietdijk, Jonne; Wieslander, Håkan et al. Ingår i PloS Computational Biology, 2023 DOI för Evaluating the utility of brightfield image data for mechanism of action prediction Ladda ner fulltext (pdf) av Evaluating the utility of brightfield image data for mechanism of action prediction SimSearch: A Human-in-The-Loop Learning Framework for Fast Detection of Regions of Interest in Microscopy Images Gupta, Ankit; Sabirsh, Alan; Wählby, Carolina; Sintorn, Ida-Maria Ingår i IEEE journal of biomedical and health informatics, s. 4079-4089, 2022 DOI för SimSearch: A Human-in-The-Loop Learning Framework for Fast Detection of Regions of Interest in Microscopy Images Ladda ner fulltext (pdf) av SimSearch: A Human-in-The-Loop Learning Framework for Fast Detection of Regions of Interest in Microscopy Images Assessment of the percentage of full recombinant adeno-associated virus particles in a gene therapy drug using CryoTEM Colomb-Delsuc, Mathieu; Raim, Roman; Fiedler, Christian; Reuberger, Stefan et al. Ingår i PLOS ONE, 2022 DOI för Assessment of the percentage of full recombinant adeno-associated virus particles in a gene therapy drug using CryoTEM Ladda ner fulltext (pdf) av Assessment of the percentage of full recombinant adeno-associated virus particles in a gene therapy drug using CryoTEM TEM image restoration from fast image streams Wieslander, Håkan; Wählby, Carolina; Sintorn, Ida-Maria Ingår i PLOS ONE, 2021 DOI för TEM image restoration from fast image streams Ladda ner fulltext (pdf) av TEM image restoration from fast image streams The link between gliomas infiltration and white matter architecture investigated with electron microscopy and diffusion tensor imaging Latini, Francesco; Fahlström, Markus; Beháňová, Andrea; Sintorn, Ida-Maria et al. Ingår i NeuroImage, s. 102735, 2021 DOI för The link between gliomas infiltration and white matter architecture investigated with electron microscopy and diffusion tensor imaging TEM virus images: Benchmark dataset and deep learning classification Matuszewski, Damian J.; Sintorn, Ida-Maria Ingår i Computer Methods and Programs in Biomedicine, 2021 DOI för TEM virus images: Benchmark dataset and deep learning classification Ladda ner fulltext (pdf) av TEM virus images: Benchmark dataset and deep learning classification Rapid development of cloud-native intelligent data pipelines for scientific data streams using the HASTE Toolkit Blamey, Ben; Toor, Salman; Dahlö, Martin; Wieslander, Håkan et al. Ingår i GigaScience, s. 1-14, 2021 DOI för Rapid development of cloud-native intelligent data pipelines for scientific data streams using the HASTE Toolkit Ladda ner fulltext (pdf) av Rapid development of cloud-native intelligent data pipelines for scientific data streams using the HASTE Toolkit Detection of pulmonary micronodules in computed tomography images and false positive reduction using 3D convolutional neural networks Gupta, Anindya; Saar, Tonis; Martens, Olev; Le Moullec, Yannick et al. Ingår i International journal of imaging systems and technology (Print), s. 327-339, 2020 DOI för Detection of pulmonary micronodules in computed tomography images and false positive reduction using 3D convolutional neural networks Conventional analysis of movement on non-flat surfaces like the plasma membrane makes Brownian motion appear anomalous Adler, Jeremy; Sintorn, Ida-Maria; Strand, Robin; Parmryd, Ingela Ingår i Communications Biology, 2019 DOI för Conventional analysis of movement on non-flat surfaces like the plasma membrane makes Brownian motion appear anomalous Facilitating Ultrastructural Pathology through Automated Imaging and Analysis Sintorn, Ida-Maria; Suveer, Amit; Dragomir, Anca; Hultenby, Kjell et al. Ingår i Journal of Pathology Informatics, s. 38-39, 2019 Reducing the U-Net size for practical scenarios: Virus recognition in electron microscopy images Matuszewski, Damian J.; Sintorn, Ida-Maria Ingår i Computer Methods and Programs in Biomedicine, s. 31-39, 2019 DOI för Reducing the U-Net size for practical scenarios: Virus recognition in electron microscopy images A fast Fourier based feature descriptor and a cascade nearest neighbour search with an efficient matching pipeline for mosaicing of microscopy images Hast, Anders; Sablina, Victoria A.; Sintorn, Ida-Maria; Kylberg, Gustaf Ingår i Pattern Recognition and Image Analysis, s. 261-272, 2018 DOI för A fast Fourier based feature descriptor and a cascade nearest neighbour search with an efficient matching pipeline for mosaicing of microscopy images Image-Based Detection of Patient-Specific Drug-Induced Cell-Cycle Effects in Glioblastoma Matuszewski, Damian J.; Wählby, Carolina; Krona, Cecilia; Nelander, Sven et al. Ingår i SLAS Discovery, s. 1030-1039, 2018 DOI för Image-Based Detection of Patient-Specific Drug-Induced Cell-Cycle Effects in Glioblastoma A short feature vector for image matching: The Log-Polar Magnitude feature descriptor Matuszewski, Damian J.; Hast, Anders; Wählby, Carolina; Sintorn, Ida-Maria Ingår i PLOS ONE, 2017 DOI för A short feature vector for image matching: The Log-Polar Magnitude feature descriptor ProViz: a tool for explorative 3-D visualization and template matching in electron tomograms Sve",
  "content_length": 28150,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:38"
}