{
  "name": "Ida M. Pu",
  "homepage": "https://www.gold.ac.uk/computing/staff/i-pu",
  "status": "success",
  "content": "Dr Ida Pu | Goldsmiths, University of London Main menu Staff & students In this section Ida specialises in probabilistic and average case algorithms, data structures and communications and complexity theory. Staff details Position Lecturer Department Computing Email i.pu (@gold.ac.uk) Website http://www.doc.gold.ac.uk/~mas01ip Lecturer, deputy Senior Tutor, researcher, PhD supervisor and examiner, project manager, member of academic committee, equal opportunity representative, special needs coordinator. Areas of supervision Probabilistic and average case algorithms, data structures, networks and communications and complexity theory. Publications and research outputs BookFundamental Data Compression Pu, Ida . 2006. Fundamental Data Compression. 0-7506-6310-3: Elsevier. Book SectionEfficient algorithms for noise propagation in diffusion tensor imaging Pu, Ida ; and Shen, Y.. 2009. Efficient algorithms for noise propagation in diffusion tensor imaging. In: Joseph Chan; Jacqueline Daykin and M. Sohel Rahman, eds. London Algorithmics 2008: Theory and Practice: (Texts in Algorithmics). London: College Publications, pp. 1-21. ISBN 978-1-904-98797-0 ArticleImproving time-efficiency in blocking expanding ring search for mobile ad hoc networks Pu, Ida ; Stamate, Daniel ; and Shen, Yuji. 2014. Improving time-efficiency in blocking expanding ring search for mobile ad hoc networks. Journal of Discrete Algorithms, 24, pp. 59-67. ISSN 1570-8667 Quantification of venous vessel size in human brain in response to hypercapnia and hyperoxia using magnetic resonance imaging Shen, Yuji; and Pu, Ida . 2013. Quantification of venous vessel size in human brain in response to hypercapnia and hyperoxia using magnetic resonance imaging. Magnetic Resonance in Medicine, 69(6), pp. 1541-1552. ISSN 0740-3194 Gray matter nulled and vascular space occupancy dependent fMRI response to visual stimulation during hypoxic hypoxia Shen, Yuji; Ho, Yi-Ching L.; Vidyasagar, Rishma; Balanos, George; Golay, Xavier; Pu, Ida ; and Kauppinen, Risto A.. 2012. Gray matter nulled and vascular space occupancy dependent fMRI response to visual stimulation during hypoxic hypoxia. NeuroImage, 59(4), pp. 3450-3456. ISSN 1053-8119 Show more information Analytical Studies of Energy–Time Efficiency of Blocking Expanding Ring Search Pu, Ida ; and Shen, Yuji. 2010. Analytical Studies of Energy–Time Efficiency of Blocking Expanding Ring Search. Mathematics in Computer Science, 3(4), pp. 443-456. ISSN 1661-8270 Uniform Generation of Unlabelled Graphs Pu, Ida ; and Gibbons, A.. 2007. Uniform Generation of Unlabelled Graphs. Journal of Combinatorial Mathematics and Combinatorial Computing (JCMCC), 63, pp. 209-222. ISSN 08353026 Correction of High-Order Eddy Current Induced Geometric Distortion in Diffusion-Weighted Echo-Planar Images Pu, Ida ; Shen, Y.; Larkman, D.; and Counsell, S. J.. 2004. Correction of High-Order Eddy Current Induced Geometric Distortion in Diffusion-Weighted Echo-Planar Images. Magnetic Resonance in Medicine, 52(5), pp. 1184-1189. ISSN 07403194 Exact Analyses for a Simple Heuristic Employed in Array Compression Pu, Ida ; Gibbons, A.; and Muthukrishnan, S.. 2002. Exact Analyses for a Simple Heuristic Employed in Array Compression. The Computer Journal, 45(2), pp. 213-220. ISSN 00104620 Conference or Workshop ItemPredicting Alzheimer’s Disease Diagnosis Risk Over Time with Survival Machine Learning on the ADNI Cohort Musto, Henry ; Stamate, Daniel ; Pu, Ida ; and Stahl, Daniel. 2023. 'Predicting Alzheimer’s Disease Diagnosis Risk Over Time with Survival Machine Learning on the ADNI Cohort'. In: Computational Collective Intelligence. ICCCI 2023.. Budapest, Hungary 27–29 September 2023. A Machine Learning Approach for Predicting Deterioration in Alzheimer's Disease Musto, Henry ; Stamate, Daniel ; Pu, Ida ; and Stahl, Daniel. 2022. 'A Machine Learning Approach for Predicting Deterioration in Alzheimer's Disease'. In: 20th IEEE International Conference on Machine Learning and Applications (ICMLA). Pasadena, CA, United States 13-16 December 2021. Creating Ensembles of Generative Adversarial Network Discriminators for One-Class Classification Ermaliuc, Miha ; Stamate, Daniel ; Magoulas, George D.; and Pu, Ida . 2021. 'Creating Ensembles of Generative Adversarial Network Discriminators for One-Class Classification'. In: International Conference on Engineering Applications of Neural Networks. Halkidiki, Greece 25–27 June 2021. Show more information A Two-Step Optimised BERT-Based NLP Algorithm for Extracting Sentiment from Financial News Olaniyan, Rapheal ; Stamate, Daniel ; and Pu, Ida . 2021. 'A Two-Step Optimised BERT-Based NLP Algorithm for Extracting Sentiment from Financial News'. In: IFIP International Conference on Artificial Intelligence Applications and Innovations. Hersonissos, Crete, Greece 25–27 June 2021. Concepts for Computing Patterns in 15th Century Korean Music Moon, Sukhie; Daykin, Jacqueline W.; and Pu, Ida . 2020. 'Concepts for Computing Patterns in 15th Century Korean Music'. In: PATTERNS 2020: The Twelfth International Conference on Pervasive Patterns and Applications. Nice, France 25 - 29 October 2020. CreaTology: Patterns in Digital Creative Arts Pu, Ida ; and Daykin, Jacqueline W.. 2020. 'CreaTology: Patterns in Digital Creative Arts'. In: PATTERNS 2020: The Twelfth International Conference on Pervasive Patterns and Applications. Nice, France 25 - 29 October 2020. Diffusion Patterns of Social Network Posts Gubanov, Alexander; Mundrievskaya, Yuliya; and Pu, Ida . 2020. 'Diffusion Patterns of Social Network Posts'. In: PATTERNS 2020: The Twelfth International Conference on Pervasive Patterns and Applications. Nice, France 25 - 29 October 2020. Predicting S&P 500 based on its constituents and their social media derived sentiment Olaniyan, Rapheal ; Stamate, Daniel ; Pu, Ida ; Zamyatin, Alexander; Vashkel, Anna; and Marechal, Frederic. 2019. 'Predicting S&P 500 based on its constituents and their social media derived sentiment'. In: 11th International Conference on Computational Collective Intelligence ICCCI 2019. Hendaye, France 4-6 September 2019. Predicting First-Episode Psychosis Associated with Cannabis Use with Artificial Neural Networks and Deep Learning Stamate, Daniel ; Alghamdi, Wajdi; Stahl, Daniel; Pu, Ida ; Murtagh, Fionn ; Belgrave, Danielle; Murray, Robin; and di Forti, Marta. 2018. 'Predicting First-Episode Psychosis Associated with Cannabis Use with Artificial Neural Networks and Deep Learning'. In: IPMU 2018: 17th International Conference on Information Processing and Management of Uncertainty in Knowledge-Based Systems. Cadiz, Spain. Imperfect Information Fusion Using Rules with Bilattice Based Fixpoint Semantics Stamate, Daniel ; and Pu, Ida . 2012. 'Imperfect Information Fusion Using Rules with Bilattice Based Fixpoint Semantics'. In: 14th International Conference on Information Processing and Management of Uncertainty in Knowledge-Based Systems, IPMU 2012. Catania, Italy. A framework for chase strategies in recent energy or time efficient route discovery protocols for MANETs Pu, Ida ; and Shen, Yuji. 2011. 'A framework for chase strategies in recent energy or time efficient route discovery protocols for MANETs'. In: IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks (WoWMoM),. Lucca 20-24 June 2011. Measurement of Absolute CBV Change During Brain Activation Using Grey Matter Nulled fMRI Shen, Y.; Pu, I.M. ; and Kauppinen, R.A.. 2009. 'Measurement of Absolute CBV Change During Brain Activation Using Grey Matter Nulled fMRI'. In: Proc. Intl. Soc. Mag. Reson. Med. 17. UNDEFINED. Measurement of Parenchymal T2* Changes During Visual Stimulation Using Grey Matter Nulled and VASO fMRI'' Shen, Y.; Pu, I.M. ; and Kauppinen, R.A.. 2009. 'Measurement of Parenchymal T2* Changes During Visual Stimulation Using Grey Matter Nulled and VASO fMRI'''. In: Proc. Intl. Soc. Mag. Reson. Med 17. UNDEFINED. T2* Responses in Grey Matter Nulled and VASO fMRI Images During Visual Stimulation in Hypoxic Hypoxia Shen, Y.; Pu, I.M. ; Ho, Y-C L.; Vidyasagar, R.; Golay, X.; and Kauppinen, R.A.. 2009. 'T2* Responses in Grey Matter Nulled and VASO fMRI Images During Visual Stimulation in Hypoxic Hypoxia'. In: T2* Responses in Grey Matter Nulled and VASO fMRI Images During Visual Stimulation in Hypoxic Hypoxia. UNDEFINED. Quantification of Parenchymal T1 in the Activated Visual Cortex in Grey Matter Nulled and VASO fMRI Images Shen, Y.; Pu, I.M. ; Kauppinen, R.A.; and Golay, X.. 2009. 'Quantification of Parenchymal T1 in the Activated Visual Cortex in Grey Matter Nulled and VASO fMRI Images'. In: International Society for Magnetic Resonance in Medicine 17. UNDEFINED. Enhanced Blocking Expanding Ring Search in Mobile Ad Hoc Networks Pu, Ida ; and Shen, Yuji. 2009. 'Enhanced Blocking Expanding Ring Search in Mobile Ad Hoc Networks'. In: 3rd International Conference on New Technologies, Mobility and Security. Cairo. Assessment of Intravascular and Extravascular BOLD Signal with Grey Matter Nulled and VASO fMRI Methods Shen, Y.; Pu, I.M. ; and Kauppinen, R.A.. 2008. 'Assessment of Intravascular and Extravascular BOLD Signal with Grey Matter Nulled and VASO fMRI Methods'. In: Proc. Intl. Soc. Mag. Reson. Med. 16. UNDEFINED. Measuring energy-time efficiency of protocol performance in Mobile Ad Hoc Networks Pu, I.M. ; Shen, Y.; and Kim, J.. 2008. 'Measuring energy-time efficiency of protocol performance in Mobile Ad Hoc Networks'. In: 7th International Conference on AD-HOC Networks & Wireless, LNCS. Nice, France 10-12 September 2008. Quantification of Cerebral Blood Volume during Brain Activation with Grey Matter Nulled fMRI Shen, Y.; Pu, I.M. ; and Kauppinen, R.A.. 2008. 'Quantification of Cerebral Blood Volume during Brain Activation with Grey Matter Nulled fMRI'. In: Proc. Intl. Soc. Mag. Reson. Med. 16. UNDEFINED. Genralised Index Formulae for Prolate, Oblate and Spherical Shape Diffusion Tensors Pu, Ida ; Shen, Y.; and ",
  "content_length": 13512,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:38"
}