{
  "name": "Iddo Tzameret",
  "homepage": "https://www.doc.ic.ac.uk/~itzamere",
  "status": "success",
  "content": "Iddo Tzameret - Professor @ Imperial College London Home Papers Talks Group CV Iddo Tzameret* Professor Chair in Computational Complexity Department of Computing Imperial College London E-mail: Iddo.Tzameret@gmail.com (For internal College matters only: itzamere@ic.ac.uk ) PhD, Master's: I welcome PhD and Master's student applications to my group. If you're interested please email me. See ad here . Postdoc opportunities: please email me. Internships: see here. • During 2026 we're running a semester-long program in University of Cambridge: Logical foundations of complexity theory • I spent the spring term of 2023 at Berkeley, visiting the Simons Institute at University of California, Berkeley. My research is supported by a five-year ERC (European Research Council) Consolidator Grant, under the EPRICOT project. And EPSRC (Engineering and Physical Sciences Research Council, UKRI) Imperial and Oxford joint grant. My research lies broadly in the theory of computing, algorithms and complexity. I'm exploring the limits of efficient computation and inference, both as a natural and a mathematical phenomenon. This includes computational and proof complexity, satisfiability, algebraic, logical and combinatorial approaches in complexity, and the theory of SAT- and constraint-solving. Find out more about my research in my publication page; see also this survey. Short Bio: Since 2021 I'm a professor in the department of computing at Imperial College London. During Spring 2023 I was a visiting scholar at University of California, Berkeley. Before that I've been a professor at Royal Holloway, University of London, a visiting scholar at Oxford University (Winter/Spring 2019), an assistant professor at Tsinghua University (Beijing) and a research fellow at the academy of sciences (Prague). I completed my PhD from Tel Aviv University, Israel, under the supervision of Ran Raz (Weizmann Institute) and Nachum Dershowitz (Tel Aviv University). Postdocs 2022 - : Michal Garlik ((St. Petersburg →) Imperial) 2022 - 2023 : Tuomas Hakoniemi ((UPC Barcelona →) Imperial → Helsinki Uni.) Research Students 2023 - : Jiaqi Lu (MRes, Imperial; PhD, Imperial) 2022 - : Svyatoslav Griaznov (PhD, Imperial) 2022 - : Tal Elbaz (PhD, Imperial) 2022 : Luming Zhang (MSc, Imperial → PhD, LSE) 2021 - : Nashlen Govindasamy (PhD, Imperial) 2016 - 2019 : Fedor Part (PhD, Royal Holloway → postdoc at AVCR Prague) 2012 - 2014: Fu Li (PhD student in Tsinghua → UT Austin graduate program) 2012 - 2013: Zhengyu Wang (undergrad in Tsinghua → PhD from Harvard) Address Department of Computing Imperial College London Huxley Building, 559 South Kensington Campus London, SW7 2AZ United Kingdom Orcid: News/Events Openings: Highly motivated students interested in pursuing a PhD in the theory of computing with a strong mathematical background (including strict mathematics) can contact me. Postdoc opportunities with a provable publication track-record in complexity may also be available. See here. September 2025: Speaker at 2025 Clay Research Conference, Clay Mathematics Institute, University of Oxford March 2025: Talk at Cambridge University Dec 2024: The 5th Complexity Network Meeting at Imperial Sep 2024: Together with Jan Pich, I'm organising a Proof Complexity Workshop at Oxford. June 2024, STOC 2024, Vancouver PC member, CCC 2024 April 2024: Meta-Complexity Reunion, UC Berkeley, Simons Inst. March 2024: Oberwolfach, Proof Complexity and Beyond March 2024: The 4th Complexity Network Meeting at Oxford August 14--16, 2023: Workshop on Algebra and Computation Goteborg, Sweden. May. 2023: The 2nd Complexity Network Meeting at Imperial Spring 2023: Simons Institute, Berkeley: Meta-Complexity semester. Visiting Scientist and workshop organizer. Dec. 2022: The 1st Complexity Network Meeting at Imperial 4 -- 8 July 2022: Organising the workshop on Circuit & Proof Complexity at Edinburgh, ICMS. See slides/videos.. Oct. 2021: The Complexity Network between Imperial, Oxford & Warwick is established Paper accepted at FOCS'22 Paper accepted at LICS'21 Paper accepted at STOC'21 Invited to SIAM J. Comput. Special Issue Nov. 2020: Paper accepted at Computational Complexity Aug. 2020: Paper accepted at JACM Paper accepted at STOC'20 Jan 2020: Plenary Speaker at: CSL 2020, Barcelona. PC member, MFCS 2020 Older Stuff Paper accepted at ITCS'20 New paper posted ECCC'19 Jan--May 2019, on sabbatical at Oxford University, visiting the computational complexity group of Rahul Santhanam May 2019: Steve Cook Symposium: 50 Years of Complexity Theory. The Fields Institute, Toronto. Jan 2019: Fedor Part defended successfully his PhD thesis. Now a postdoc at AVCR Prague. Paper accepted at SIAM Jour. Comput. (SICOMP), May 2018 Paper accepted at Int. J. Algebra & Comput. , Jan 2018 Aug 2018: Bertinoro Workshop: Logic and Combinatorics WACT 2018: At University Paris Diderot, March 5-9, 2018. My Oxford Seminar talk: Linear Algebra in Weak Formal Theories of Arithmetic, Feb 2018 Dagstuhl Seminar: Proof Complexity, Jan 2018 PC member, AAAI 2018 Prague bounded arithmetic workshop, Nov 2017 Paper accepted at LICS 2017 (with Stephen Cook) Invited to JACM Upcoming Oberwolfach Workshop: Proof Complexity and Beyond, August 2017 PC member, IJCAI 2017 CCC'16 paper invited to ToC special journal issue on CCC'16 Workshop on Algebraic Complexity Theory (WACT) 2016, Tel Aviv, Israel Feb. 3-12, 2016. Visitor Count: Home Papers Talks Group Privacy notice CV Copyright Â© 2025 | Designed by I. Tzameret (based on Chocotemplates.com) x This website is using cookies. That's Fine More info.",
  "content_length": 5577,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:36"
}