{
  "name": "Idit Keidar",
  "homepage": "http://webee.technion.ac.il/~idish",
  "status": "success",
  "content": "Prof. Idit Keidar | Home page Short Bio & Research Interests I am currently the Dean of the Viterbi Faculty of Electrical and Computer Engineering. I’m broadly interested in fault-tolerant distributed and concurrent algorithms and systems. The main drive for my research is finding theoretical foundations that can help explain and improve the practice. Recently, I’ve been working on distributed storage – theory and systems, concurrent data structures and transactions, and scalable Byzantine fault-tolerance. I received my BSc (summa cum laude), MSc (summa cum laude), and PhD from the Hebrew University of Jerusalem in 1992, 1994, and 1998, respectively. My Ph.D. advisor was Danny Dolev, and according to the Mathematics Genealogy Project, my academic lineage includes Copernicus, Leibniz, Jacob Bernoulli, Euler, Lagrange, Laplace, and Poisson. I did my postdoc at MIT with Nancy Lynch. In my spare time, I enjoy writing prose, and a short story I wrote has recently won 2nd place in Shirat Ha’Mada creative writing contest for scientists; it is available (in Hebrew) in Shirat Hamada 2019, pp 18-23. short CV full CV Contact Info Prof. Idit Keidar Lord Leonard Wolfson Academic Chair Email: Phone: +972 4 829 4649 Office: Meyer 902 Address: Andrew and Erna Viterbi Faculty of Electrical and Computer Engineering Technion - Israel Institute of Technology Haifa 3200003, Israel News 14.1.25 Congratulations Gal! 19.8.23 Congratulations, Shir and Oded 27.7.23 Cordial Miners accepted to DISC'23 27.4.23 Quancurrent in SPAA'23 17.2.23 IVL accepted to J. ACM 17.2.23 Congratulations Ramy! 01.1.23 Congratulations Arik and Shaked 17.10.22 \"On Payment Channels ...\" in DISC'22 21.12.21 Accepted to VLDB - DSON: JSON CRDT Using Delta-Mutations For Document Stores 28.11.21 Idit Keidar is the Dean of ECE! all news",
  "content_length": 1812,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:40"
}