{
  "name": "Iftach Haitner",
  "homepage": "http://www.cs.tau.ac.il/~iftachh",
  "status": "success",
  "content": "Iftach Haitner's Home Page Iftach Haitner - יפתח הייטנר I am a faculty member of the School of Computer Science at Tel Aviv University and a principal researcher at Stellar Development Foundation (SDF). My main research interests are Cryptography and Computational Complexity. [Info] [Short Bio] [Professional Activity] [Teaching] [School Activity] [Group Members] [Call for Postdocs & Interns] Group Members Students Noam Mazor (PhD) Jad Silbak (PhD) Eliad Tsfadia (PhD) Daniel Nukrai (MSc) Yonatan Karidi-Heller (MSc) Past members Itay Berman (MSc) Eran Omri (Postdoc) Christopher Brzuska (Postdoc) Aris Tentes (longterm student visitor) Nissan Levi (MSc student) Ran Cohen (Postdoc) Matan Orland (MSc student) Nikolaos Makriyannis (Postdoc) Dror Chawin (MSc) Contact Information Tel Aviv university, Check Point Building, Office 444 (forth floor) Phone:+972-3-6407996 Fax: +972-3-6409373 Email: iftachh [at] tauex.tau.ac.il Mail: Iftach Haitner, Tel Aviv university, P.O.B. 39040, Ramat Aviv, Tel Aviv 69978, Israel Short Biography I am a faculty member of the School of Computer Science at Tel Aviv University and a principal researcher at the Stellar Development Foundation. I received my PhD in 2008 from the Faculty of Mathematics and Computer Science, Weizmann Institute of Science, under the supervision of Omer Reingold. I got my Master's degree also from the Weizmann Institute, under the supervision of Oded Goldreich, and did my undergraduate studies (Mathematics and Computer Science) at Tel-Aviv University. Awards and Fellowships [2018] The Kadar Family Award for Outstanding Research. [2014] The annual fruits of the Raymond and Beverly Sackler Career Development Chair, awarded by the Faculty of Exact Sciences, Tel Aviv University, in recognition of academic excellence. [2011] One of the three winning papers of the 2011 SIAM Outstanding Paper Prizes. The prizes are given for outstanding papers published in SIAM journals during the three years before the award's year. [2008] The John F. Kennedy Prize (awarded by the Weizmann Institute) [2008] Intel (Israel) award for outstanding Ph.D. students [2008] Rothschild Fellowship for Post-Doctoral Research (declined) [2007] Otto Schwartz prize for excellent studies, PhD [2007] Dean's List of Honour at the Weizmann Institute of Science [2006] Best paper CRYPTO 2006 [2006] Best paper award ICALP 2006 track C Teaching Awards [2018] The Tel Aviv University Rector's Award for Excellence in Teaching. [2017] The Tel Aviv University Rector's Award for Excellence in Teaching. At the Industry [2024--] Principal researcher at Stellar Development Foundation [2022--2024] Principal cryptographer at Coinbase. (Full time.) [2019--2022] Cryptographer at Unbound Security. [2016--2018] Consultant at Team8, working mostly with Curv. [2008--2010] Postdoctoral researcher at Microsoft Research New England. (Full time.) [1996--2001] Programmer and team leader in several technology companies. (Full time.) Grants [2023-2027] Israel Science Foundation (ISF) -- Individual research grant. [2020-2021] Blavatnik ICRC (Interdisciplinary Cyber Research) -- Group grant. [2019-2023] Israel Science Foundation (ISF) -- Individual research grant. [2015-2020] European Research Council (ERC) Starting Grant -- Individual research grant. [2015-2018] Blavatnik ICRC (Interdisciplinary Cyber Research) -- Group grant. [2011-2015] Israel Science Foundation (ISF) -- Individual research grant. [2011-2015] Israel Science Foundation (ISF) -- Equipment for new faculty. [2011-2015] Israel Science Foundation(ISF) -- Israeli Center of Research Excellence in Algorithms. [2011-2015] US-Israel Binational Science Foundation (BSF), with Salil Vadhan. Professional Activity Editor SIAM Journal on Computing (SICOMP), 2020-2024 Program Committees Eurocrypt 2025 Eurocrypt 2022 Conference on Information-Theoretic Cryptography (ITC) 2020 Eurocrypt 2019 Theory of Cryptography Conference (TCC) 2018 ICALP 2016 (Track A) Theory of Cryptography Conference (TCC) 2014 CRYPTO 2013 Conference on Computational Complexity (CCC) 2013 Theory of Cryptography Conference (TCC) 2012 Asiacrypt 2011 CT-RSA 2011 Theory of Cryptography Conference (TCC) 2010 CRYPTO 2009 Seminars and Workshops Co-organizer of the Greater Tel Aviv Area Cryptography Seminar (GTACS) Co-organizer of the Lower Bounds in Cryptography 2019 Co-organizer of the Crypto in the Galilee 2018 Co-organizer of the Second Desert Workshop in Cryptography 2016 Co-organizer of the Modeling Intractability workshop 2013 Teaching (outside of TelAviv university) Nexus of Information and Computation Theories (Secrecy and Privacy Theme), 2016 4th Bar-Ilan Winter School on Cryptography, 2014 School on Black-Box Impossibility Results, 2014 Other General co-chair of Theory of Cryptography Conference (TCC) 2016-A Teaching Foundation of Cryptography, the Basics (0368416201). Fall 25 Information Theory and Application 1 (0368327001) . With Ofer Shayevitz and Rotem Oshman. Fall 21 Information Theory and Application 2 (0368327001). With Ofer Shayevitz and Rotem Oshman. Spring 22. Computational Models. Fall 20 Foundation of Cryptography, Advanced Topics (0368413101). With Nir Bitansky. Spring 21 Foundation of Cryptography, the Basics (0368416201). With Omer Paneth. Fall 20. Applications of Combinatorics Tools in Cryptography (student seminar). (Fall 20) Applications of Information Theory  (Fall 19) Zero Knowledge Proofs (student seminar)  (Fall 19) Seminar on pseudorandomness (student seminar)  (Fall 18) Seminar on Differential Privacy (student seminar)  (Spring 18) Multi-Party Computation (student seminar)  (Spring 17) Average-Case Hardness (student seminar)  (Spring 15) Advanced Cryptography seminar (by invitation only).  Thursdays 14-16, Room 480 School Activity Excellence Program for Master Studies Call for Postdocs and Interns See the TAU crypto group call Publications (in Reverse Chronological Order) Iftach Haitner and Nikolaos Makriyannis Tight Bounds on Uniform-Challenge Black-Box Reductions from Sigma Protocols [abstract] Manuscript 2025 [eprint] Sigma protocols are fundamental cryptographic tools, serving as the foundation of many practical schemes—most notably, the Schnorr identification and signature schemes. To prove the security of Sigma protocols, one typically reduces breaking a Sigma protocol to solving a presumed hard problem (e.g., computing the discrete logarithm in a certain group). In many settings, however, these reductions are not tight: given an adversary that breaks a Sigma protocol with probability, the reduction only yields an adversary for the underlying problem with probability. This quadratic loss affects efficiency, as it forces choosing larger security parameters to reach a target security level. In this work, we show that this quadratic loss is inherent for two natural classes of reductions. For interactive protocols, we prove it for uniform-challenge, black-box reductions, which query the adversary using uniformly sampled challenges. For non-interactive protocols (i.e., in the random-oracle model), we prove it for weakly programmable, black-box reductions, which answer the adversary’s oracle queries with uniformly sampled outputs. Applying our bounds to the reductions from Schnorr identification and signatures to discrete logarithm yields lower bounds that match known positive results—namely, the classical worst-case reduction of Pointcheval and Stern (Journal of Cryptology, 2000) and the higher-moment reduction of Rotem and Segev (Journal of Cryptology, 2024). Our approach reduces the analysis of such reductions to the values of simple hitting games—combinatorial games that we introduce. Bounding these games is our main technical contribution, and we believe these bounds can enable more modular proofs of related results. Iftach Haitner and Yehuda Lindell and Nikolaos Makriyannis Integer Commitments, Old and New Tools [abstract] Manuscript 2025 [eprint] This self-contained and detailed tutorial covers RSA-based integer commitments and related protocols. It also presents a new, highly efficient setup protocol for sampling commitment parameters. Jack Doerner and Iftach Haitner and Yuval Ishai and Nikolaos Makriyannis From OT to OLE with Subquadratic Communication [abstract] ACM CCS 2025 (Distinguished Paper Award) [eprint] Oblivious Linear Evaluation (OLE) is an algebraic generalization of oblivious transfer (OT) that forms a critical part of a growing number of applications. An OLE protocol over a modulus 𝑞enables the receiver party to securely evaluate a line 𝑎·𝑋 +𝑏 chosen by the sender party on a secret point 𝑥∈Z𝑞. Motivated by the big efficiency gap between OLE and OT and by fast OT extension techniques, we revisit the question of reducing OLE to OT, aiming to improve the communication cost of known reductions. We start by observing that the Chinese Remainder Theorem (CRT) can be combined with a prior protocol of Gilboa (Crypto ’99) to reduce its communication cost from 𝑂(ℓ2) to ˜𝑂(ℓ) bits, for ℓ = log 𝑞. Unfortunately, whereas Gilboa’s protocol is secure against a semi-honest sender and a malicious receiver, a direct application of the CRT technique is only semi-honest secure (it is insecure against malicious receivers). Thus, we employ number-theoretic techniques to protect our CRT-based protocol against malicious receivers, while still retaining a concrete advantage over Gilboa’s protocol (e.g., 7.6×less communication for ℓ = 256). Furthermore, we obtain a fully malicious OLE-to-OT reduction by applying either information-theoretic techniques with moderate overhead, or RSA-based cryptographic techniques with very low overhead. We demonstrate the usefulness of our results in the context of OLE applications, including a post-quantum oblivious pseudorandom function (OPRF) and distributed signatures. In particular, assuming pre-existing random OT correlations, we can use our malicious-receiver OLE protocol to realize (a single instance of) the power-residue based OPRF candidate with",
  "content_length": 91681,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:41"
}