{
  "name": "Iftekhar Ahmed 0001",
  "homepage": "https://www.ics.uci.edu/~iftekha",
  "status": "success",
  "content": "Iftekhar Ahmed Associate Professor in Informatics University of California, Irvine I am accepting PhD students. Please send resumes and cover letters to Iftekha@uci.edu. About me I am an Associate Professor of Informatics in the Donald Bren School of Information and Computer Science at the University of California, Irvine. My research focus is on software engineering in general and combining software testing, analysis and data mining to come up with better tools and techniques in particular. I finished my B.Sc. in Computer Science and Engineering from Shahjalal University of Science and Technology, Bangladesh and after working in the industry for 4 years, did my Ph.D. at Oregon State University. I was advised by Carlos Jensen. Interests Software Engineering Testing Machine Learning Education PhD in Computer Science, 2018 Oregon State University BSc in Computer Science & Engineering, 2007 Shahjalal University of Science and Technology Research Link to a talk I gave recently at UCI summarizing my research so far My research focuses on testing, developing and understanding critical software systems and ways to combine testing, static analysis and machine learning approaches for coming up with better tools and techniques. I have been working on using static code analysis for identifying factors related to code, developer and process that affect the quality of the software measured in terms of bugs and design issues. I have been also exploring the effectiveness of mutation analysis of programs and especially how to make mutation analysis a workable technique for real-world developers and testers. Mutation analysis is a reasonable proxy for measuring the effectiveness of test suites, but its also computationally and time intensive. Even a moderately large software project would require millions of test suite runs. This makes mutation analysis impossible to use by developers and practicing testers working on real-world problems. My research focuses on how we can scale mutation analysis to real world complex software systems. Research Group Software Engineering & Testing Using Artificial Intelligence for Reliable Software (STAIRS) Awards IBM Ph.D. Fellowship for academic year 2016-2017. Graduate School tuition relief Scholarship for academic year 2016-2017 IBM Ph.D. Fellowship for academic year 2017-2018. CV and Resume Download my CV Contact iftekha@uci.edu 2438 ISEB, Irvine, CA 92697-3440 Email for appointment Advice Applying for MS or PhD Programs Guidance on Writing a Statement of Purpose (UIUC) Advice Collection Tao Xie’s advice (UIUC) Michael Ernst’s advice (UW) Jason Hong’s advice (CMU) Andy Ko’s advice (UW) Mor Harchol-Balter advice (CMU)",
  "content_length": 2693,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:40"
}