{
  "name": "Igor Pivkin",
  "homepage": "http://search.usi.ch/people/69388d464acadfb430a54e28f2c46a7c/Pivkin-Igor",
  "status": "success",
  "content": "Pivkin, Igor | Università della Svizzera italiana Università della Svizzera italiana search.usi Tools usi.ch Info Desk Links Campus map Italiano Italiano English search.usi Search for contacts, projects, courses and publications People Education Research Organisation Education Courses Funded projects Publications Competences maps Faculties Institutes Services Other organisational units Igor Pivkin http://usi.to/nbi Biography Igor V. Pivkin is a full professor at the Institute of Computing at the Faculty of Informatics at USI. He received his B.Sc. and M.Sc. degrees in Mathematics from Novosibirsk State University, Russia, M.Sc. degree in Computer Science and Ph.D. in Applied Mathematics from Brown University, USA. Before coming to Lugano, he was a Postdoctoral Associate in the Department of Materials Science and Engineering at Massachusetts Institute of Technology, USA Research The research interests of Professor Pivkin lie in the area of multiscale/multiphysics modeling, corresponding numerical methods and parallel large-scale simulations of biological and physical systems. Specific areas include biophysics, cellular and molecular biomechanics, stochastic multiscale modeling, and coarse-grained molecular simulations. Competence areas Biophysics Computational Sciences High performance computing Particle based method Contact igor.pivkin@usi.ch East Campus, Sector D, Office D5.09 (Level P5) Via la Santa 1, 6962 Lugano-Viganello Roles Faculty of Informatics Full Professor Institute of Computing (CI) Update data Edit profile Università della Svizzera italiana Via Buffi 13 6900 Lugano, Svizzera tel +41 58 666 40 00 e-mail info@usi.ch Other contacts Feedback on the website Maps and directions Lugano Campus Mendrisio Campus Bellinzona Campus Stay in touch Newsletter Annual Report Subscribe © Università della Svizzera italiana Disclaimer Credits Faculties Institutes Bodies Libraries and archives Areas Services Job offers",
  "content_length": 1946,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:52"
}