{
  "name": "Igor Melatti",
  "homepage": "http://wwwusers.di.uniroma1.it/~melatti",
  "status": "success",
  "content": "Igor Melatti Igor Melatti English version Curriculum in PDF Attuale posizione Titoli di studio Esperienze accademiche post-dottorato Articoli Tools Attività didattica (corsi) Ufficio Attuale posizione Ricercatore Universitario presso il Dipartimento di Informatica della Sapienza Università di Roma. Inizio pagina Titoli di studio 06/06/2005: dottore di ricerca in Informatica ed Applicazioni presso l'Università di L'Aquila, discutendo la tesi ``Explicit Algorithms for Probabilistic Model Checking'', con tutore il Prof.~Benedetto Intrigila 10/04/2001: laurea in Informatica con 110/110 e lode, presso la Facoltà di Scienze MM. FF. NN. dell'Università di L'Aquila. Completa gli studi nei 5 anni previsti dal piano didattico, discutendo la tesi dal titolo \"Uso di SPIN in un approccio probabilistico alla verifica automatica di sistemi concorrenti\", relatore Chiar.mo Prof. Enrico Tronci 1997: diploma in Pianoforte Principale con 10/10 presso il Conservatorio di Musica \"A. Casella\" di L'Aquila 1995: diploma di maturità classica con 60/60 presso il Liceo Ginnasio \"D. Cotugno\" di L'Aquila Inizio pagina Esperienze accademiche post-dottorato Dal 01/02/2006 è titolare, presso il Dipartimento di Informatica dell'Università ``La Sapienza'' di Roma, di un assegno di ricerca di durata biennale, dal titolo ``Algoritmi e tools per la verifica automatica di sistemi deterministici e stocastici'', con responsabile scientifico il Prof. Enrico Tronci. Dal 01/07/2005 al 31/12/2005 è stato Post Doctoral Research Associate presso la School of Computing della University of Utah (Salt Lake City, UT, USA), con referente il Prof. Ganesh Gopalakrishnan. Inizio pagina Articoli Pubblicati La lista completa degli articoli pubblicati è disponibile a questo link. Liste parziali sono disponibili qui (Google Scholar) oppure qui (DBLP) oppure qui (ISI Web of Knowledge, a pagamento) oppure qui (Scopus, a pagamento). Software di ricerca prodotto Vedere la pagina del Model Checking Group. Inizio pagina Attività didattica (corsi) Come ricercatore Presso l'Università degli studi di Roma \"La Sapienza\", Facoltà di Ingegneria dell'Informazione, Informatica e Statistica, Corso di Laurea in Statistica, Economia, Finanza ed Assicurazioni, ha tenuto il corso di Informatica negli anni accademici 2011/2012 e 2012/2013. Presso l'Università degli studi di Roma \"La Sapienza\", Facoltà di Ingegneria dell'Informazione, Informatica e Statistica, Corso di Laurea in Informatica, ha tenuto le esercitazioni del corso di Sistemi Operativi II modulo nell'anno accademico 2010/2011. Dopo il dottorato Corsi alla \"Sapienza\" Presso l'Università degli studi di Roma \"La Sapienza\", Facoltà di Scienze MM. FF. NN., Corso di Laurea in Informatica, ha tenuto le seguenti esercitazioni: Anno accademico 2007/2008: Programmazione 1 Anno accademico 2006/2007: Programmazione 1 Ha tenuto cicli di seminari all'interno dei seguenti corsi: Anno accademico 2006/2007: Programmazione ad Oggetti Corsi alla University of Utah Presso la School of Computing della University of Utah ha tenuto cicli di seminari all'interno: del corso di Model Checking (CS 6964, Fall 2005) della serie di seminari AMPS (Programming Languages and Systems Seminar, CS 7931, Fall 2005, questo è il link della nuova serie) Corsi a \"Tor Vergata\" Presso l'Università degli studi di Roma \"Tor Vergata\", Facoltà di Scienze MM. FF. NN., Corso di Laurea in Informatica, ha tenuto cicli di seminari all'interno del corso di Metodi Formali per la Verifica dei Sistemi Complessi (Anno accademico 2005/2006) Durante il dottorato Presso l'Università di L'Aquila, Facoltà di Scienze MM. FF. NN., Corso di Laurea in Informatica, ha tenuto cicli di seminari all'interno dei seguenti corsi: Anno accademico 2004/2005: Metodi Formali per la Verifica di Sistemi Complessi Anno accademico 2003/2004: Architettura degli Elaboratori Anno accademico 2003/2004: Metodi Formali per la Verifica di Sistemi Complessi Anno accademico 2002/2003: Architettura degli Elaboratori Anno accademico 2001/2002: Laboratorio di Architettura degli Elaboratori Inizio pagina Ufficio Dipartimento di Informatica Università di Roma \"La Sapienza\" Via Salaria 113 00198 Roma tel: +39 06 4991 8438 fax: +39 06 8541842 email:m e l a t t i @ d i . u n i r o m a 1 . i t Url: http://www.dsi.uniroma1.it/~melatti Inizio pagina Pagina in evoluzione...",
  "content_length": 4338,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:43"
}