{
  "name": "Ihab Francis Ilyas",
  "homepage": "https://cs.uwaterloo.ca/~ilyas",
  "status": "success",
  "content": "Ihab Ilyas Homepage Ihab Francis Ilyas Professor Emeritus / Adjunct Professor Cheriton School of Computer Science, University of Waterloo 200 University Ave. West Waterloo, Ontario, Canada N2L 3G1 email: ilyas at uwaterloo.ca Short Biography Books Data Cleaning, ACM Books Ihab F. Ilyas and Xu Chu Startups and Software Release I'm fortunate to have a great group of grad students and collaborators to build systems based on industry problems. CEO, Co-founder, Inductiv, a Waterloo-based startup on using AI for Structured Data Cleaning, 2019 (acquired by Apple) Co-founder, Tamr, a leading startup in using machine learning for large-scale data integration, 2013 HoloClean on Github: an open-source platform for using machine learning in error detection and repair. Blog Post: AI Should not Leave Structured Data Behind! (Medium - Towards Data Science) The Quest for High Quality Data (O'Rielly Media) How to Clean Noisy and Erroneous Big Data Using Machine Learning (Tamr Blog) Data Cleaning is a Machine Learning Problem that Needs Data Systems Help! (ACM SIGMOD Blog) Three Enablers for ML in Data Unification: Trust, Legacy and Scale (O'Rielly Media) HoloClean, a Machine Learning Approach to Data Cleaning Surveys and Long Papers Probabilistic Ranking Techniques in Relational Databases (Synthesis Lectures on Data Management) March 2011, 71 pages, (doi:10.2200/S00344ED1V01Y201103DTM014 Ihab F. Ilyas and Mohamed A. Soliman Foundation and Trends Paper: Trends in Cleaning Relational Data: Consistency and Deduplication (Author Copy) November 2015, Foundations and Trends in Databases: Vol. 5: No. 4, pp 281-393 Ihab F. Ilyas and Xu Chu CAREER HIGHLIGHTS Fellow of the Royal Society of Canada, 2024 IEEE Fellow, 2022 ACM Fellow, 2020 Co-founder, Inductiv, a Waterloo-based startup on using AI for Structured Data Cleaning, 2019 (acquired by Apple) Co-founder, Tamr, a leading startup in using machine learning for large-scale data integration, 2013 NSERC-Thomson Reuters Chair of Data Quality, 2018 ACM SIGMOD vice-chair, 2017 VLDB Endowment Board of Trustees, 2016 Google Faculty Award, 2014 ACM Distinguished Scientist, 2014 NSERC Discovery Accelerator, 2014-2018, NSERC Cheriton Faculty Fellowship, 2013-2016, University of Waterloo ACM SIGMOD 2015 Best Demo Award Ontario Early Researcher Award, 2008, Government of Ontario IBM CAS Faculty Fellow, 2006-2010, IBM Taha Hussein Medal for top 10 high school students in the nation, 1990, Ministry of Education, Egypt RESEARCH Publications: [DBLP]   [Google Scholar] Students and Postdoctoral Fellows Graduated: Aoqian Zhang (Postdoc, 2020) Shrinu Kushagra (Postdoc, 2020) Lanjun Wang (Postdoc, 2017) Alexandra Roatis (Postdoc, 2016) Chang Ge (PhD 2022) - Assistant Professor, University of Minnesota Alireza Heydari (PhD 2021) Hemant Saxena (PhD 2021) - SAP Mina Farid (PhD, 2020) - Inductiv (Apple) Xu Chu (PhD, 2017) - Assistant Professor, Georgia Institute of Technology Jeffrey Pound (co-supervised by Grant Weddell) (PhD 2013) - SAP George Beskales (PhD 2012) - Tamr Inc. Amr El-Helw (PhD 2012) - Greenplum Mohamed A. Soliman (PhD 2010) - Greenplum Sobhan Niknamian (Masters 2021) Omar Attia (Masters 2021) - Inductiv (Apple) Michael Azmy (Masters 2019) Jian Li (Masters 2018) - Google Anam Shadab (Masters 2018) John Morcos (Masters 2015) - Microsoft Hella Hoffmann (Masters 2015) - Thomson Reuters Artur Galiullin (Masters 2013) Mina Farid (Masters 2012) - Grad School Mina Saleeb (Masters 2012) - Oracle Hiren Patel (Masters 2010) - Microsoft Nan Jiang (Masters 2009)",
  "content_length": 3532,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:47"
}