{
  "name": "Ilia Polian",
  "homepage": "http://www.iti.uni-stuttgart.de/en/institute-of-computer-architecture-and-computer-engineering.html",
  "status": "success",
  "content": "HOCOS | Institute of Computer Architecture and Computer Engineering | University of Stuttgart jump to content jump to footer back close navigation For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. HOCOS Chair of Hardware Oriented Computer Science The Chair of Hardware-oriented Computer Science develops circuit and system architectures based on traditional and on emerging principles, including neuromorphic, stochastic and approximate architectures. Our second area is the systematic design methodology and design automation, with a strong focus on security and reliability. The Chair covers the mentioned topics in research and in teaching. Our members are present in the top conferences of these areas, and we are collaborating with outstanding international scientists. With regard to teaching, we are offering introductory courses in the Bachelor program Computer Science, several advanced lectures in different Master programs, seminars and practical lab courses. We are looking forward to cooperation with partners from industry, academia and other public organizations; please contact us if interested! We are also offering interesting Master and Bachelor thesis topics, projects and research- and teaching-assistance opportunities. Projects Current Research Projects Research We develop circuit and system architectures based on traditional and on emerging principles, … Publications Publications of the Hardware Orientied Computer Science Chair People of the Chair Hardware Orientierte Informatik (HOCOS) HOCOS - Open Positions Open Positions at the HOCOS Department Contact Ilia Polian Prof. Dr. rer. nat. habil. Head of Institute and Chair of Hardware Oriented Computer Science Profile page +49 711 685 60764 Write e-mail To the top of the page",
  "content_length": 1853,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:56"
}