{
  "name": "Illah Reza Nourbakhsh",
  "homepage": "http://www.cs.cmu.edu/~illah",
  "status": "success",
  "content": "Professor Illah R. Nourbakhsh Illah R. Nourbakhsh Kavcic-Moura Professor of Robotics Former Inaugural K&L Gates Professor of Ethics and Computational Technologies Executive Director, Center for Shared Prosperity Director, CREATE Lab The Robotics Institute Carnegie Mellon University Email: illah \"at\" cs.cmu.edu Office: Newell Simon Hall 3105 Former Robotics Group Lead Ames Research Center National Aeronautics and Space Administration [ Research | Lab | CV | Contact ] Research I am happy to announce the release of my first ever memoir, Turn Left, recently published by Sentient. The prior link will take you to information about this three-year effort, including endorsements, speaking tour dates and further information. Here is a book review by Professor Dame Diane Coyle at Cambridge. Here is a video of one of my book launch talks, this one at the Global Studies Center at the University of Pittsburgh. Also, Sentient, the publisher, has released an Instagram video of me explaining the origins of the book. In very non-robotics news, here is a website describing a 25-year project of mine involving an antique, air-cooled Porsche 911. I am happy to announce the release of our new book, AI and Humanity by the MIT Press, along with its companion website which includes an AI and Humanity Oral Archive. We at the CREATE Lab are happy to release a whole new website for understanding global change: EarthTime. Enjoy. Parenting for Technology Futures is for sale! You can purchase my monograph as a paperback or in Kindle form. Robot Futures is now for sale! You can buy it at your local neighborhood Amazon store in hardcover or electronic versions, or you can buy it direct from the publisher, MIT Press. Book reviews by: LA Review of Books, Ars technica, New Scientist, Slate, and many others. The Ethics and Robotics open course website is now released. Enjoy reading articles and visiting teacher resources to help instructors incorporate ethics and robotics into single-day or whole-term robotics courses. For more than ten years I have been exploring human-robot interaction with the aim of creating rich, effective and satisfying interactions between humans and robots. My research has focused specifically on human-robot collaboration, wherein the robotic and human agents in the system share the same unifying goal or utility function. I further sharpen my scope to human-robot collaboration for learning, in which the measurable outcomes are information gain on the part of the humans in the system. In the context of my focus on collaboration for learning, rich means a cognitively sophisticated interaction in which humans and robots communicate as peers; effective means that formal measures of human learning should yield significant outcomes; satisfying means that humans should find the interaction both useful and pleasurable. Three key questions govern my inquiry into human-robot collaboration: What enabling competencies in the areas of social perception and control are required for applicability of the resulting models? What principles of robot morphology and robot behavior design have broad applicability to the design of interaction systems? Can a principled interaction evaluation methodology enable us to implement complete, feedback-driven design life cycles for interaction systems? One research focus has been to develop embedded solutions to the problem of semantic interpretation of events using visual sensing. Another focus has been robot navigation because it is an important prerequisite to many forms of social interaction when the robot shares the human physical space. For example visual-topological navigation and hybrid metric-topological models aim to provide navigation competency with a minimum of computational and memory demands. Because of the cross-disciplinary nature of the human-robot collaboration problem, integrative research must bring robotics together with other fields that model human cognition and social behavior. I have joined and extended models of interaction and evaluation methodology from Human Factors, HCI and Cognitive Psychology, outstanding complements to robotics since these fields already consider human relationships to physical embodiments and consider human behavioral change over time. Most recently we have begun to study the role of a research lab in meaningful design, dissemination and scaling with communities of practice. Our working model is one in which participatory design, design-based thinking and robotic innovation are combined to achieve positive social impact on specific problems throughout societies. For specific information about these projects, all of which are dedicated to make real impact while also establishing models for laboratory-community interaction, see my CREATE Lab website. Biographical Sketch Short Bio: Illah R. Nourbakhsh is Kavcic-Moura Professor of Robotics at Carnegie Mellon University, inaugural Executive Director of the Center for Shared Prosperity, and co-director of the Community Robotics, Education and Technology Empowerment Lab. He was the Inaugural K&L Gates Professor of Ethics and Computational Technologies. He obtained his PhD in Computer Science from Stanford University. In 2009 the National Academy of Sciences named him a Kavli Fellow. In 2013 he was inducted into the June Harless West Virginia Hall of Fame. He was previously Robotics Group Lead for NASA/Ames during the MER landings, and is a retired civil servant, NASA GS15/10. In 2019 he was named a Hastings Fellow. He has co-authored textbooks and popular literature, including Turn Left, AI and Humanity, Robot Futures, and Parenting for Technology Futures. He has authored articles for The New Yorker and Foreign Affairs, in addition to academic journals and book chapters. He is a trustee of the Claude Worthington Benedum Foundation, Winchester Thurston School and the Southwestern Pennsylvania Environmental Health Project. He is a Director at Open Planet, a London-based Community Interest Corporation, and also President and a director at Friends of Open Planet, a 501(c)3 based in the United States. Long Bio: Illah R. Nourbakhsh is Kavcic-Moura Professor of Robotics, inaugural Executive Director of the Center for Shared Prosperity, founded in 2021, and co-director of the Community Robotics, Education and Technology . His current research projects explore community-based robotics, including educational and social robotics and ways to use robotic technology to empower individuals and communities, as described in this CREATE Lab white paper. The CREATE Lab's researchers lead diverse projects, from the application of GigaPan technology to scientific, citizen science and educational endeavours internationally to Hear Me, a project that uses technology to empower students to become leads in advocating for meaningful social change; Arts and Bots, a program for creative art and robotics fusion in middle school; Message from Me, a new system of communication between pre-K children and their parents to improve home-school consistency; Explorables, interactive visualization tools that empower communities of practice to make sense of data and communicate to broad audiences, to many other programs. The CREATE Lab's programs have already engaged more than 40,000 people globally, and the CREATE Satellite program is forging additional CREATE lab partners in new geographic zones. While on leave from Carnegie Mellon in 2004, he served as Robotics Group lead at NASA/Ames Research Center during the MER landings. He is a retired NASA civil servant, GS15/10. He was a founder and chief scientist of Blue Pumpkin Software, Inc., which was acquired by Witness Systems, Inc. Illah earned his bachelor's, master's and PhD in computer science at Stanford University and has been a faculty member of Carnegie Mellon since 1997. In 2009, the National Academy of Sciences named him a Kavli Fellow. In 2013 he was inducted into the June Harless West Virginia Hall of Fame. He was previously head of the CMU Robotics Masters program, and was Associate Director of Robotics as Faculty Director. He is co-author of the second edition MIT Press textbook, Introduction to Autonomous Mobile Robots. He is author and co-author of Robot Futures, Parenting for Technology Futures, AI and Humanity and Turn Left. He is a trustee of the Claude Worthington Benedum Foundation, a trustee of Winchester Thurston School, and trustee of the Southwestern Pennsylvania Environmental Health Project. He is also Chairman of Airviz, Inc., a company dedicated to empowering individuals regarding home air quality. He is a World Economic Forum Global Steward, a member of the Global Future Council on the Future of AI and Robotics, and the IEEE Global Initiative for the Ethical Considerations in the Design of Autonomous Systems, the Global Innovation Council of the Varkey Foundation and Senior Advisor to The Future Society, Harvard Kennedy School. He is also on the Board of Directors and co-founder of Open Planet, a London-based Community Interest Corporation and Friends of Open Planet, Inc. You can download my formal CV in PDF. Contact Information Office: 3105 Newell-Simon Hall (412) 268-2007 (voice) (412) 268-7350 (fax) Lab: Community Robotics, Education and Technology Empowerment Lab Collaborative Innovation Center, CMU Campus (412) 268-6723 Mail: Illah R. Nourbakhsh Robotics Institute, NSH 3105 Carnegie Mellon University Pittsburgh, Pennsylvania 15213 E-mail: illah \"at\" cs.cmu.edu [ The Robotics Institute | Carnegie Mellon University ] Illah R. Nourbakhsh ( illah \"at\" cs.cmu.edu)",
  "content_length": 9588,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:55"
}