{
  "name": "Ilya Shpitser",
  "homepage": "https://www.cs.jhu.edu/~ilyas",
  "status": "success",
  "content": "Ilya Shpitser Ilya Shpitser Office: Malone Hall 321. Email: first name concatenated with the first letter of last name, all lowercase, at cs.jhu.edu I am a John C. Malone Associate Professor in the Department of Computer Science in the Whiting School of Engineering at the Johns Hopkins University. I am a member of the Malone Center For Engineering in Healthcare. I graduated from UCLA where I had great privilege to be advised by Judea Pearl. As a postdoctoral scholar at the Harvard School of Public Health, I was fortunate to receive mentorship from James M. Robins. Research Interests: Causal inference, missing data, graphical models, algorithmic fairness, statistical inference in semi-parametric models. Teaching: Spring 2024: Disinformation Self-defense (600.277). Fall 2023: Causal Inference (601.477/677). Fall 2024: Introduction To Machine Learning (601.475/675). Students and Postdocs: Ph.D. Students: Trung Phang Helen Guo Jacob Chen Beatrix Wen Alumni: Numair Sani (starting a data science consulting company in India). Jaron Lee (joining Datavant as a data scientist). Amir Emad Ghassami (joining the Department of Mathematics and Statistics at Boston University). Ranjani Srinivasan (joining Boston Consulting Group as a consultant). Eli Sherman (joining Credo as a data scientist). Noam Finkelstein (joining Weill Cornell Medicine as a postdoctoral scholar under the supervision of Prof. Ashley Laughney). Dan Malinsky (joining the Department of Biostatistics at Columbia University as Assistant Professor). Razieh Nabi (joining the Department of Biostatistics at Emory University as Rollins Assistant Professor). Rohit Bhattacharya (joining the Department of Computer Science at Williams College as Assistant Professor). News: 6/11/2024. Congratulations to my colleague Jaron Lee, who has successfully defended his dissertation and will be joining Datavant as a data scientist! 3/9/2023. Congratulations to my colleague Amir Ghassami, who will be starting as a tenure track Assistant Professor at the Department of Mathematics and Statistics at Boston University! 9/2/2022. Congratulations to my colleague Eli Sherman, who has successfully defended his dissertation and will be joining Credo as a data scientist! 1/20/2022. Congratulations to my colleague Noam Finkelstein who will be starting as a postdoctoral scholar at Weill Cornell Medicine under the supervision of Prof. Ashley Laughney. 3/20/2021. Congratulations to my colleague Razieh Nabi who will be starting as a tenure track Rollins Assistant Professor at the Department of Biostatistics at Emory University! 3/20/2021. Congratulations to my colleague Rohit Bhattacharya who will be starting as a tenure track Assistant Professor at the Department of Computer Science at Williams College! 1/28/2021. Congratulations to Noam Finkelstein for winning a fellowship from the Mathematical Institute for Data Science (MINDS). 6/1/2020. Congratulations to Eli Sherman for receiving the prestigious Google PhD Fellowship Award! 5/1/2020. I am pleased to announce the public release of Ananke, a causal inference package written in Python, authored by Rohit Bhattacharya, Jaron Lee, and Razieh Nabi. Links to documentation, gitlab, and the python package index. 3/5/2020. Congratulations to my colleague Daniel Malinsky who will be starting as a tenure track Assistant Professor at the Department of Biostatistics at Columbia University! 2/14/2020. I have received the NSF Faculty Early Career Development (CAREER) award, for my project \"Robust Causal And Statistical Inference in High Dimensional Structured Systems with Hidden Variables.\" 1/17/2020. The intersession course on critical thinking and causal inference that Razieh Nabi and Rohit Bhattacharya developed and taught during the Winter Break of 2020 has been featured in the Hub magazine! 12/10/2019. Congratulations to Eli Sherman for winning a fellowship from the Mathematical Institute for Data Science (MINDS). 5/24/2019. Congratulations to Rohit Bhattacharya and Razieh Nabi for winning the Thomas R. Ten Have Award at the Atlantic Causal Inference Conference 2019 held in Montreal in 2019, for their poster titled \"Identification In Missing Data Models Represented By Directed Acyclic Graphs\". 4/25/2017. I have received the Causality in Statistics Education Award from the American Statistical Association, for developing my course in causal inference at Johns Hopkins Computer Science: CS 477-677. Recent Tutorials: \"Mediation Analysis: Old and New.\" A full day tutorial at the 36th New England Statistics Symposium (co-taught with Judith Lok). June 4th, 2023. \"Graphical Model Identification Theory For Causal Inference and Missing Data Problems.\" A full day tutorial at the Atlantic Causal Inference Conference 2019, (co-taught with James M. Robins). May 22, 2019. \"Causal Fairness Criteria: Algorithms and Open Problems\" A half-day continuing education course at the Joint Statistical Meetings 2022, (co-taught with Razieh Nabi and Dan Malinsky). August 7, 2022. Selected Recent Talks: \"Recursive Equations For Imputation Of Missing Not At Random Data With Sparse Pattern Support.\" At the Statistics and Data Science Seminar at Cornell University. Ithaca, NY. November 19, 2025. \"Introduction to Causal Discovery.\" 2025 Penn Causal Inference Summer Institute. Philadelphia, PA. May 28, 2025. \"Missing data with ? and 0 missingness tokens: identification and estimation.\" Causal representation learning workshop, NeurIPS 2024. December 15, 2024. \"Causal Inference with Hidden Mediators.\" NSF Fairness in AI Principal Investigator Meeting. Arlington, VA. January 9th, 2024. \"Fairness By Causal Mediation Analysis: Criteria, Algorithms, and Open Problems.\" Invited talk at the \"Ethical Considerations in Health Data Science\" workshop, Royal Statistical Society, London. Dec. 13, 2023. \"General methods for identification and estimation in hidden variable causal systems.\" University of Pennsylvania Center for Causal Inference Distinguished Faculty Seminar. Philadelphia, PA. November 16, 2023. \"The Proximal ID Algorithm.\" Invited talk at the Pacific Causal Inference Conference. Beijing, China. September 17, 2023. \"An Introduction to Causal Inference.\" Invited talk at the Causality in Ecology Workshop. Johns Hopkins University, Baltimore. August 21, 2023. \"Introduction to Proximal Causal Inference Part I: The Proximal ID Algorithm.\" Keynote talk at the FunCausal 2023: Fundamental Challenges on Causality colloquium, Grenoble France. May 10, 2023. \"An Introduction to Causal Inference.\" At the Causal Inference and Quantum Foundations Workshop. The Perimeter Institute, Waterloo, Canada. April 17, 2023. \"Fairness By Causal Mediation Analysis: Criteria, Algorithms, and Open Problems.\" Invited talk at the Online Causal Inference Seminar. January 10, 2023. \"Semiparametric Inference For Causal Effects In Graphical Models With Hidden Variables.\" Adobe Causal Inference Workshop. October 17, 2022. \"Semiparametric Inference For Causal Effects In Graphical Models With Hidden Variables.\" Innovative Development of Semiparametrics for Heterogeneous Causal Effects in Epidemiology — Invited Papers (Joint Statistical Meetings 2022). August 8, 2022. \"Coexisting With Potential Responses.\" Invited talk at the Rutgers Foundations of Probability Seminar. \"Satisfying Causal Fairness Criteria: Algorithms, and Open Problems.\" Invited talk at the Statistics Annual Winter Workshop 2022: Algorithm Fairness and Bias in AI, at the University of Florida. \"The Potential Outcomes Calculus.\" Invited session talk at the Society for Epidemiologic Research (SER) 2021 Annual Meeting. June 24, 2021. \"Fairness By Causal Mediation Analysis: Criteria, Algorithms, and Open Problems.\" Invited talk at the ENAR 2021 Spring Meeting. March 16, 2021. \"Identification and Estimation of Causal Parameters via a Modified Factorization of a Graphical Model.\" Invited talk at the virtual opening workshop of the SAMSI Data Science in the Social and Behavioral Sciences program. January 11, 2021. \"Understanding mechanisms behind COVID-19 disparities.\" At the Johns Hopkins Research Symposium on Engineering in Healthcare: Disparities and COVID-19. January 11, 2021. \"Identification and Estimation of Causal Parameters via a Modified Factorization of a Graphical Model.\" Invited talk at the Pacific Causal Inference Conference. September 27, 2020. \"Causal Inference Under Interference and Network Uncertainty.\" Keynote talk at the KDD Causal Discovery Workshop. August 24, 2020. \"Identification And Estimation In Graphical Models Of Missing Data.\" The Online Causal Inference Seminar, May 12, 2020. \"Fairness By Causal Mediation Analysis: Criteria, Algorithms, and Open Problems.\" Columbia Biostatistics Colloquium. January 30, 2020. \"Identification and Estimation of Causal Parameters via a Modified Factorization of a Graphical Model.\" Invited talk at the seminar for the Wharton Statistics Department at the University of Pennsylvania. \"Causal Inference And Applications In Public Health And Radiation Oncology.\" Keynote talk at the International Conference on the Use of Computers in Radiation Therapy and the International Conference on Monte Carlo Techniques for Medical Applications (ICCR-MCMA), in Montreal, Canada. June 18, 2019. \"Fairness By Causal Mediation Analysis: Criteria, Algorithms, and Open Problems.\" Keynote talk at the 10th Workshop in Decisions, Games and Logic: \"Ethics, Statistics, and Fair AI\", in Pasadena, California. June 10, 2019. \"Uncertainty and Networks.\" At the \"Causality vs Prediction\" program review, in Boston, Massachusetts. June 6, 2019. \"Identification And Estimation Via A Modified Factorization Of A Graphical Model.\" Invited talk at the workshop \"Foundations and New Horizons for Causal Inference,\" in Oberwolfach, Germany. May 29, 2019. \"Estimation Of Personalized Effects Associated With Causal Pathways.\" At the 33rd New England Statistics Symposium (NESS), in Hartford, Connecticut. May 16, 2019. \"The Potential Outcomes Calculus.\" In",
  "content_length": 24820,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:58"
}