{
  "name": "Ilyas Çiçekli",
  "homepage": "https://web.cs.hacettepe.edu.tr/~ilyas",
  "status": "success",
  "content": "Ilyas Cicekli’s Home Page Prof. Dr. Ilyas Cicekli Professor of  Department of Computer Engineering Hacettepe University, Ankara, TURKEY Email: ilyas@cs.hacettepe.edu.tr and ilyascicekli@gmail.com Telephone: (+90) 312-297-7500  Ext. 144 Address: Department of Computer Engineering, Hacettepe University, 06800 Beytepe, Ankara, TURKEY Current Research Interests Natural Language Processing, Machine Translation, Machine Learning, Data Mining, Artificial Intelligence Short Bio I have been a full professor of computer engineering at Hacettepe University, Turkey, since February 2011. I have also been the head of the Computer Science Division in the Computer Engineering Department since February 2011, and I served as the chair of the Computer Engineering Department from February 2021 to April 2024. Additionally, I served as the Dean of the Informatics Institute at Hacettepe University from March 2012 to August 2016. From 2017 to 2019, I was a full teaching professor in the Computer Science Department at Syracuse University. Previously, I worked as a faculty member in the Computer Engineering Department at Bilkent University from 1992 to 2011, after receiving my PhD in Computer Science from Syracuse University. I also worked as a visiting associate professor in the Computer Science Department at the University of Central Florida (UCF) from 2001 to 2003. You can find my full list of professional activities in my CV. Education Ph.D.   Computer & Information Science, Syracuse University M.S. Computer Science, Syracuse University B.S. Computer Engineering, Middle East Technical University Research I have mainly worked in the natural language processing research area and applied machine learning methods to various natural language processing problems. I have supervised 8 Ph.D. dissertations and 27 M.S. theses. I have published more than 80 scientific articles, including 30 journal articles, and completed 7 research projects. You can find details of some of my research activities and my full list of professional activities in my CV. Publications Sponsored Projects Theses Supervised Teaching You can reach the courses that I currently teach using the following link. · Courses",
  "content_length": 2195,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:02"
}