{
  "name": "Ilya Safro",
  "homepage": "https://www.eecis.udel.edu/~isafro",
  "status": "success",
  "content": "Homepage of Ilya Safro Ilya Safro Department of Computer and Information Sciences University of Delaware Home Publications Research Group Software Data Teaching Contact Selected recent papers Optimal fermion-qubit mappings via quadratic assignment, IEEE International Conference on Quantum Computing and Engineering (QCE), 2025 QAOA-GPT: Efficient Generation of Adaptive and Regular Quantum Approximate Optimization Algorithm Circuits, IEEE International Conference on Quantum Computing and Engineering (QCE), 2025 ELRUHNA: Elimination Rule-based Hypergraph Alignment, ASONAM, 2025 AI-based mining of biomedical literature: Applications for drug repurposing for the treatment of dementia, Artificial Intelligence In Medicine, 2025 Neural Architecture Search Algorithms for Quantum Autoencoders, IEEE Transactions on Quantum Engineering, 2025 Graph Representation Learning for Parameter Transferability in Quantum Approximate Optimization Algorithm, Quantum Machine Intelligence, 2024 Dyport: Dynamic Importance-based Hypothesis Generation Benchmarking Technique, BMC Bioinformatics, 2024 Recent funding 08/2025 NSF grant awarded Quantum-Classical Algorithms for HPC and Quantum Computing Systems 08/2024 NSF grant awarded Quantum Correlations in Quantum Approximate Optimization Algorithms and Their Implementation 08/2022 Phase II DARPA grant awarded Hybrid quantum-classical algorithms for optimization problems on graphs 09/2021 NIH grant awarded Knowledge discovery and machine learning to elucidate the mechanisms of HIV activity and interaction with substance use disorder 08/2020 NSF grant awarded Large Scale QAOA Quantum Simulator 04/2020 NSF grant awarded Automated discovery of COVID-19 related hypotheses using publicly available scientific literature 03/2020 Phase I DARPA grant awarded Hybrid quantum-classical algorithms for optimization problems on graphs Recent Lab Awards 2024 Best Paper Award in Quantum Applications in IEEE Quantum Computing and Engineering 2023 Bao Bach's team won 1st place in Chicago Quantum Exchange Hackathon 2023 Ankit Kulshrestha received Rama Marda fellowship award 2022 IEEE High Performance Extreme Computing (HPEC) Best Student Paper Award (Leading student Cameron Ibrahim) 2022 Frank A. Pehrson Graduate Student Achievement Award for Xiaoyuan Liu 2022 UD CIS Distinguished Graduate Student awards for Cameron Ibrahim, Ankit Kulshrestha, Ilya Tyagin 2020 Outstanding Mentor Award to Ilya Safro 2020 Outstanding PhD student in Computer Science for Justin Sybrandt 2019 IEEE High Performance Extreme Computing (HPEC) Best Student Paper Award (Leading student Ruslan Shaydulin) 2018-now Multiple travel awards: SIAM Parallel Processing, Supercomputing, IEEE Quantum Computing and Engineering, IEEE HPEC and more Software Check our GitHub repo at https://github.com/safrolab I am a Professor and Associate Chair for Graduate Studies and Research in the Department of Computer and Information Sciences at the University of Delaware, with a joint appointment in the Department of Physics and Astronomy. I received my Ph.D. in Applied Mathematics and Computer Science from the Weizmann Institute of Science in Israel under the supervision of Achi Brandt and Dorit Ron. Prior to joining the University of Delaware, I was a professor in the School of Computing at Clemson University and a Faculty Scholar in the Clemson University School of Health Research. Earlier, I held a research position in the Division of Mathematics and Computer Science at Argonne National Laboratory with a joint appointment with the Computation Institute, University of Chicago. I completed my undergraduate studies in Mathematics and Computer Science at Ben-Gurion University of the Negev in Israel. I am co-chairing the Quantum Algorithms technical papers track in IEEE Quantum Computing and Engineering 2025. Please submit your papers! For students and applicants: I am always actively looking for highly motivated students to work with (both undergraduate and graduate). You are welcome to stop by my office to chat. Click here to check if I have an immediate M.Sc./Ph.D./Undergraduate/Internship opening.All applications must be submitted in Academentory.com where my positions are listed with relevant questions. Do not apply via email! Undergraduate students click here. If you are interested in quantum computing, you may also consider our graduate program in Quantum Science and Engineering that has a special track in quantum computing. Research Interests Quantum computing Graph Algorithms, Network Science Machine Learning, AI Hypothesis Generation, Text Mining, NLP Combinatorial Scientific Computing Multiscale and Multilevel Algorithms FundingTotal over $7.4M NIH DARPA NSF BMW Greenville Hospital System Department of Education My Erdös number is 3 (Safro-Brandt-Gillis-Erdös, Safro-Sanders-Wormald-Erdös). This is my Ph.D. genealogy tree (courtesy Mathematics Genealogy Project) Recent Professional Activities Editorial Boards: • IEEE Transactions on Quantum Engineering • SIAM Journal on Scientific Computing (Quantum and Combinatorial Scientific Computing Areas) • PLOS ONE (Machine Learning, Data Mining and Network Science Areas) • Algorithms (former) • Springer Nature Computer Science, Section \"Quantum Computing and Emerging Technologies\" (former) • Journal of Data Intelligence (former) (co)Organizer: • Co-Chair of the Quantum Algorithms Track in IEEE Quantum Computing and Engineering 2025 • IEEE QCE25 Workshop Quantum Algorithms for Combinatorial Optimization 2025 • Co-Chair of the Quantum Algorithms Track in IEEE Quantum Computing and Engineering 2024 • IEEE QCE24 Workshop Quantum Algorithms for Combinatorial Optimization 2024 • Mini-symposium \"Scaling Up Quantum and Hybrid Quantum-Classical Algorithms\" at SIAM Conference on Parallel Processing for Scientific Computing 2024 • Leibniz Center for Informatics, Dagstuhl Seminar \"Scalable Graph Mining and Learning\", 2023 (1 week) • IEEE/ACM International Worshop on Quantum Computing 2022 • Quantum Computing mini-cluster at INFORMS 2021 (several sessions on quantum optimization and machine learning and tutorial on quantum combinatorial optimization) • Tutorial \"Tutorial on Combinatorial Optimization on Quantum Computers\" at IEEE International Conference on Quantum Computing and Engineering (QCE20) • Mini-symposium \"Recent Advances and Trends in Hybrid Quantum-Classical Algorithms\" at SIAM Conference on Parallel Processing for Scientific Computing (PP20) • Tutorial \"Combinatorial Optimization on Quantum Computers\" at SIAM Conference on Parallel Processing for Scientific Computing (PP20) • Leibniz Center for Informatics, Dagstuhl Seminar \"High-performance Graph Algorithms\", 2018 (1 week) • Session on \"Scalable Algorithms for Networks\" at International Symposium on Mathematical Programming 2015 • Leibniz Center for Informatics, Dagstuhl Seminar \"High-performance Graph Algorithms and Applications in Computational Science\", 2014 (1 week) • ICiS Workshop \"Graph and Hypergraph Problems in Computational Science\", 2012 (1 week) Technical Program Committees (regular and senior) • Supercomputing 2024 • International European Conference on Parallel and Distributed Computing (Euro-Par) 2024 • SIAM Parallel Processing and Scientific Computing 2024 • IEEE Quantum Computing and Engineering (QCE) 2021, 2022, 2023, 2024, 2025 • ACM KDD 2021, 2022, 2023, 2024 • SIAM International Conference on Data Mining (SDM) 2022, 2024, 2025 • CIKM 2021, 2022, 2023, 2024, 2025 • IEEE BIGDATA 2024 • IEEE/ACM International Worshop on Quantum Computing 2022 • Online Conference on Algorithms (ALG2021) • International Workshop on Quantum Computing: Circuits Systems Automation and Applications 2020, 2021, 2022, 2023, 2024, 2025 (QC-CSAA, co-located with IEEE Computer Society Annual Symposium on VLSI) • International Workshop on Quantum Data Science and Management (QDSM) 2023, 2024 • International Workshop on Literature-Based Discovery (LBD 2020) • INFORMS Optimization Society 2020 (IOS2020) • International Workshop on Quantum Computing for Sustainable Computing 2019 • International Conference on Big Data Analytics and Knowledge Discovery (DaWaK 2018, 2019, 2021, 2022) • IEEE Cloud Summit 2019 • SIAM Workshop in Combinatorial Scientific Computing 2016 (SIAM CSC16) • Learning and Intelligent Optimization 2011, 2012, 2013 (LION11-13) • IEEE 2nd International Workshop on Network Science 2013 (NSW13) Advisory Board Member • University of Rhode Island's Quantum Advisory Committee • The Swiss Innovation Lab • Quantum Startup Foundry at Maryland • The International Artificial intelligence and Quantum Technology Foundation Grant Panels: NIH, NSF, DOE, NASA, several funding agencies in Canada, Europe and Asia, internal panels in schools and national labs Consulting: McKinsey and Company, Coleman Research Group Our Research Group in News Think Like a Quantum Engineer Or Let AI Do It for You, 2025 For the Record: Quantum puzzle solvers, 2024 Challenges and Opportunities of Scaling Up Quantum Computation and Circuits, SIAM News, May 1, 2024 UDaily: Quantum Computing and Finance: Researchers explore quantum computing ability to speed solutions for financial sector, 2024 UDaily: A Quantum Phenomenon, 2024 UDaily/For the record: Best student paper award at IEEE HPEC 2022 for the optimal tensor network contraction paper Concentrating on Connections, our work on automated scientific hypothesis generation is featured in UDaily Artificial intelligence could aid in fight against COVID-19 Combing the best of quantum computing and classical computing The best of both worlds: how to solve real problems on modern quantum computers Future of Medicine - Man or Machine? Big Data: Future of Medicine - Man or Machine? from Clemson University on Vimeo. Summer internship of Ruslan Shaydulin Our promo video featured at ACM KDD 2017",
  "content_length": 9837,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:58"
}