{
  "name": "Ilyena Hirskyj-Douglas",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/ilyenahirskyjdouglas",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Ilyena Hirskyj-Douglas Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffIlyena Hirskyj-DouglasMr Ethan KellyZhen Tian Dr Ilyena Hirskyj-Douglas Lecturer (School of Computing Science) email: Ilyena.Hirskyj-Douglas@glasgow.ac.uk pronouns: She/her/hers Room 306, 1 Lilybank Gardens, Hillhead, Hillhead, Glasgow, Glasgow City, G12 8RZ Import to contacts https://orcid.org/0000-0001-6950-0570 Biography Dr. Ilyena Hirskyj-Douglas is a Lecturer/ Assistant Professor at The University of Glasgow and a member of the Glasgow Interactive SysTems (GIST) research section. Her research investigates ways in which animals can interact with and control computer systems, while designing and building new methods to facilitate and evaluate such interactions. Over the past decade, Hirskyj-Douglas has led research to design and develop of novel computer systems, enabling animals to control their environment and access the internet in an ethically focused manner that prioritises their well-being and agency. Her work has opened new possibilities for animals to connect and communicate with humans and other animals in new, unprecedented ways. Google Scholar has an updated list of publications Personal website ilyena.com Office: Lillybank 1, Room 306. Research interests Animal-Computer Interaction (ACI) Human-Computer Interaction (HCI) Research groupsGlasgow Interactive Systems Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017Number of items: 30.2025 Wang, Weiyun, Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570, Yu, Kejin and Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252 (2025) \"I Want to Keep My Phone Away From the Bed\": Designing a Smart Pillow for Sleep Onset. In: TEI 2026, Chicago, Illinois, USA, 08-11 Mar 2026, (Accepted for Publication) Payne, Florence, Kleinberger, Rébecca and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2025) Look What the Cat Tapped In: Exploring Digital Interactive Systems Designed for the Cat Café Experience. In: International Conference on Animal-Computer Interaction (ACI 2025), Bloomington, IN, USA, 1-4 December 2025, (Accepted for Publication) Kleinberger, Rébecca, Ashooh, Lena, Farsad, Keavan and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2025) Animals’ Entanglement with Technology: a Scoping Review. In: 2025 Conference on Human Factors in Computing Systems, Yokohama, Japan, 26 Apr - 01 May 2025, p. 767. ISBN 9798400713941 (doi: 10.1145/3706598.3713384) Wang, Jiaqi, Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2025) Reshaping Human-Animal Relationships: Exploring Lemur and Human Enrichment through Smell, Sound, and Sight. In: 2025 Conference on Human Factors in Computing Systems (CHI 2025), Yokohama, Japan, 26 Apr - 01 May 2025, p. 744. ISBN 9798400713941 (doi: 10.1145/3706598.3713311) 2024 French, F. et al. (2024) Empowering Animals Through Technology: Enhancing Animal Agency in the Sound Environment. In: International Conference on Animal-Computer Interaction (ACI 2024), Glasgow, UK, 2-5 December 2024, pp. 1-5. ISBN 9798400711756 (doi: 10.1145/3702336.3702354) Ashooh, Lena, Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 and Kleinberger, Rebecca (2024) Surveying The Extent of Demographic Reporting of Animal Participants in ACI Research. In: International Conference on Animal-Computer Interaction (ACI 2024), Glasgow, UK, 2-5 December 2024, ISBN 9798400711756 (doi: 10.1145/3702336.3702339) Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570, Nioche, Aurelien ORCID: https://orcid.org/0000-0002-0567-2637 and Sukys, Danielius (2024) Prototyping an Immersive Screen Interfaces for Dogs’ to Control Screens in Their Home. In: International Conference on Animal-Computer Interaction (ACI 2024), Glasgow, UK, 2-5 December 2024, ISBN 9798400711756 (doi: 10.1145/3702336.3702342) Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570, Cunha, Jennifer and Kleinberger, Rebecca (2024) Call of the Wild Web: Parrot Engagement in Live vs. Pre-recorded Video Calls. In: CHI Conference on Human Factors in Computing Systems (CHI24), Honolulu, HI, USA, 11-16 May 2024, ISBN 9798400703300 (doi: 10.1145/3613904.3641938) Kankaanpää, Vilma, Clark, Fay E. and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2024) LemurLounge: Lemurs’ Individual-Level, Group, and Cross-Species Use of an Interactive Audio Device in Zoos. In: ACM CHI Conference on Human Factors in Computing Systems (CHI 2024), Oʻahu, Hawaiʻi, USA, 11-16 May 2024, pp. 1-14. ISBN 9798400703300 (doi: 10.1145/3613904.3641888) Kleinberger, Rébecca, McMahon, Megan, Cunha, Jennifer and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2024) No More Angry Birds: Investigating Touchscreen Ergonomics to Improve Tablet-Based Enrichment for Parrots. In: ACM CHI Conference on Human Factors in Computing Systems (CHI 2024), Oʻahu, Hawaiʻi, USA, 11-16 May 2024, ISBN 979840070330 (doi: 10.1145/3613904.36421) Wang, Jiaqi, Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2024) Investigating Lemurs Sensory Modality in Technologies: How do Lemurs Engage with Single and Multimodal Stimuli in Zoos? In: CHI Conference on Human Factors in Computing Systems (CHI24), Honolulu, HI, USA, 11-16 May 2024, (doi: 10.1145/3613905.3651056) Wang, Jiaqi, Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2024) How can Multi-Sensory Technologies in Zoos Shape the Relationship Between Non-Human Primates and Humans. In: 10th International Conference on Animal-Computer Interaction (ACI 2023), North Carolina, USA, 04-08 Dec 2023, ISBN 9798400716560 (doi: 10.1145/3637882.3637902) 2023 Grant, Alana, Kankaanpaa, Vilma and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2023) Hum-ble Beginnings: Developing Touch- and Proximity-Input-Based Interfaces for Zoo-Housed Giraffes’ Audio Enrichment. In: ACM Interactive Surfaces and Spaces Conference (ACM ISS 2023)., Pittsburgh, PA, USA, 5-8 November 2023, pp. 175-197. (doi: 10.1145/3626470) Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2023) Systematic iterative design of interactive devices for animals: guidance and reflections. Interaction Studies, 24(2), pp. 225-256. (doi: 10.1075/is.22045.hir) Wang, Weiyun, Ding, Xianghua (Sharon) ORCID: https://orcid.org/0000-0001-8122-6252 and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2023) Everyday Space as an Interface for Health Data Engagement: Designing Tangible Displays of Stress Data. In: DIS '23: Designing Interactive Systems Conference, Pittsburgh, PA, USA, 10-14 July 2023, pp. 1648-1659. ISBN 9781450398930 (doi: 10.1145/3563657.3596096) Kleinberger, Rebecca, Cunha, Jennifer, Vemuri, Megha M. and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2023) Birds of a Feather Video-Flock Together: Design and Evaluation of an Agency-Based Parrot-to-Parrot Video-Calling System for Interspecies Ethical Enrichment. In: 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), Hamburg, Germany, 23-28 Apr 2023, p. 534. ISBN 9781450394215 (doi: 10.1145/3544548.3581166) Kankaanpää, Vilma and Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 (2023) Prototyping with Monkeys: Uncovering What Buttons for Monkeys Look Like. In: Seventeenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’23), Warsaw, Poland, 26 Feb - 01 Mar 2023, p. 4. ISBN 9781450399777 (doi: 10.1145/3569009.3572735) 2022 Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 and Kankaanpaa, Vilma (2022) Do Monkeys Want Audio or Visual Stimuli? Interactive Computers for Choice with White-Faced Sakis in Zoos. In: DIS '22: Designing Interactive Systems Conference, 13-17 Jun 2022, pp. 1497-1511. ISBN 9781450393584 (doi: 10.1145/3532106.3533577) 2021 Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570, Piitulainen, Roosa and Lucero, Andrés (2021) Forming the dog internet: prototyping a dog-to-human video call device. Proceedings of the ACM on Human-Computer Interaction, 5(ISS), 494. (doi: 10.1145/3488539) Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570 and Webber, Sarah (2021) Reflecting on Methods in Animal Computer Interaction: Novelty Effect and Habituation. In: Eighth International Conference on Animal-Computer Interaction (ACI’21), Bloomington, IN, USA, 9-11 Nov 2021, p. 8. ISBN 9781450385138 (doi: 10.1145/3493842) Hirskyj-Douglas, Ilyena ORCID: https://orcid.org/0000-0001-6950-0570, Gray, Stuart and Piitulainen, Roosa (2021) ZooDesign: Methods for Understanding and Facilitating Children’s Education at Zoos. In: 2021 ACM Interaction Design and Children Conference (IDC 2021), 24-30 Jun 2021, pp. 204-215. ISBN 9781450384520 (doi: 10.1145/3459990.3460697) French, F. et al. (2021) Ethics and Power Dynamics in Playful Technology for Anima",
  "content_length": 23929,
  "method": "requests",
  "crawl_time": "2025-12-01 13:22:59"
}