{
  "name": "Imran Razzak",
  "homepage": "https://mbzuai.ac.ae/study/faculty/imran-razzak",
  "status": "success",
  "content": "Imran Razzak - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Imran Razzak Imran Razzak Associate Professor of Computational Biology Research Interests Professor Razzak’s research lies at the intersection of human centred AI and healthcare, with a strong focus on multimodal biomedical data analysis, including genomics, medical imaging (e.g., MRI, CT, and retinal imaging), and electronic health records. His work spans foundational and applied AI, addressing challenges in early disease diagnosis, prognosis modeling, and precision medicine. He develops and applies machine learning techniques—such as self-supervised learning, multimodal representation learning, and large language models—for tasks ranging from radiogenomics to longitudinal health monitoring. Professor Razzak is also actively engaged in advancing AI safety and robustness in clinical settings, including the study of model generalization across diverse populations and federated learning for privacy-preserving medical AI. His recent efforts explore unifying architectures capable of reasoning over heterogeneous clinical inputs, including genetic, imaging, and textual data. Share Imran Razzak is an Associate Professor of Computational Biology and lead of GenMI research lab at the Mohamed bin Zayed University of Artificial Intelligence (MBZUAI) in Abu Dhabi, UAE. Before joining MBZUAI, he served as an Associate Professor in Human-Centered Machine Learning at the School of Computer Science and Engineering at the University of New South Wales (UNSW), Sydney, Australia. Imran’s research focuses on integrating language and vision to enhance the interpretation of multidimensional data, spanning machine learning, computer vision, and natural language processing, with a particular emphasis on healthcare applications. He has developed advanced ML frameworks for analyzing and interpreting various medical imaging modalities, including ultrasound, mammograms, CT scans, PET scans, MRI, and fMRI, aiming to improve patient outcomes. He has secured over $15 million in funding for more than 14 research projects and industrial partnerships, including grants from the Australian Research Council (ARC), the National Health and Medical Research Council (NHMRC), and the NSW Government. He has received many awards for his research work, including best paper awards in some top computer science conferences. PhD Machine Learning, University of Technology, Sydney Australia Graduate Certificate of Higher Education (Learning and Teaching), Deakin University IEEE M 2022 Andrew P. Sage Transactions paper award (IEEE TCSS) IEEE MDM 2022 best demo award CIKM nomination for Best Resource paper IEEE DICTA Best Industry Paper Award Winner of several MICCAI and ISBI Challenges MNGHA-Researcher and MNGHA-Young Research Award Imran’s research interests span deep learning, medical image analysis, computational biology, natural language processing (NLP), and multimodal AI. Dr. Imran Razzak has authored over 250 peer-reviewed publications in leading journals and conferences, including CVPR, ACL, MICCAI, IEEE TMI, Med Image Analysis, and IEEE TNNLS. He has received several research awards and secured over $15 million in funding. He has developed advanced ML frameworks for analyzing and interpreting various medical imaging modalities, including ultrasound, mammograms, CT scans, PET scans, MRI, and fMRI, aiming to improve patient outcomes. He is currently leading a research lab “Generative AI for Genomics and Medical Imaging (GenMI), which focuses on human-centered AI, combining multiomics, biomedical imaging, visualization, and information technologies to develop innovative clinical applications that advance patient health and well-being. GenMI research addresses critical healthcare challenges by developing foundational theories in information technologies and computer science to advance Personalized, Preventive, and Predictive Medicine. To gain comprehensive insights into disease entities, we integrate multi-layered data, including single-cell RNA sequencing, methylomics, and medical imaging. In close collaboration with clinicians at Charité, we develop clinical decision support systems for cancer treatment and solutions for routine clinical tasks, such as the automated annotation of radiological images. Through partnerships with leading industry players—such as major hospitals and healthcare companies—we translate cutting-edge research into real-world applications, spanning algorithm development, prototype creation, and commercialization. Breakthroughs in these fields lead to significant advancements in precision and personalized medicine, improving patient care and healthcare infrastructure. Our innovations enhance multimedia patient record systems, advanced computer-assisted surgery, AI-driven treatment planning, and telehealth solutions for remote patient monitoring, ultimately increasing healthcare accessibility, efficiency, and outcomes. Key Research Areas: Medical Image Segmentation Multi-Modal Large Language Model Embodied AI Genomic Sequence Analysis Early Diagnosis and Prognosis Explainable AI Google Scholar Profile ORCID Profile Personal Website Related Thursday, November 13, 2025 AI Innovation Day at MBZUAI unites UAE leaders to shape the future of AI in healthcare The event welcomed more than 200 healthcare leaders and featured talks and presentations by MBZUAI faculty about… conference research healthcare innovation health AI Innovation Day on campus Read more Friday, October 10, 2025 MBZUAI and Cleveland Clinic Abu Dhabi showcase AI advances for UAE healthcare challenges Researchers and clinicians came together in Abu Dhabi to put the spotlight on AI innovations designed to… public health hospital diabetes vision cardiovascular partnerships healthcare innovation collaborations health Read more Friday, June 13, 2025 When models see what isn’t there: Reducing hallucinations with FarSight MBZUAI researchers shared FarSight at CVPR, showcasing its ability to improve the performance of multimodal large language… computer vision llms CVPR hallucination multimodal MLLMs Read more Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 7765,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:06"
}