{
  "name": "Imtiaz Karim",
  "homepage": "https://www.imtiazkarim.net",
  "status": "success",
  "content": "ImtiazKarimSearch this siteEmbedded FilesSkip to main contentSkip to navigationImtiaz KarimAssistant Professor Department of Computer ScienceErik Jonsson School of Engineering and Computer ScienceThe University of Texas at DallasOffice: ECSS 3.706, Lab: ECSS 3.613Email: imtiaz.karim@utdallas.edu, imtiazkarimik@gmail.com; My PGP Public Key I am an Assistant Professor in the Department of Computer Science at the University of Texas at Dallas. Before that, I was a Postdoctoral Researcher in the Department of Computer Science at Purdue University. I completed my Ph.D. from the same department in Spring 2023.I lead the System and Network Security (SysNetS) lab at UTD. My research lies in the general area of systems and network security. More specifically, my focus is on ensuring the security and privacy of wireless communication protocols (e.g., cellular networks-4G/5G, Bluetooth, VoWiFi, vehicular, WiFi, and IoT) with respect to their design and implementation. My research aim is to develop tools that systematically analyze real-world systems and widely used protocols using AI (ML and NLP), formal verification, program analysis, and software testing techniques. Furthermore, with the advent of the next generation of networks (6G and beyond), my future goal is to ensure the resilience (reliability, adaptability, and security) of future network generations and develop protocols and systems that are robust and secure by design.My Research Pitch:Imtiaz Research PitchMy research focuses on the following themes:Formal analysis of protocol standards 5GReasoner [CCS 2019], VWAnalazyer [AsiaCCS 2022], WiFi Verification [AsiaCCS 2024], Vehicular [VehicleSec 2024], WCDCAnalyzer [NDSS 2026]LLM-based protocol analysis SPEC5G [AACL 2023], CellularLint [Usenix Sec 2024], PSMBENCH [NeurIPS 2025]Protocol noncompliance checking BLEDiff [IEEE S&P 2023], DIKEUE [CCS 2021]Systematic implementation analysis ProChecker[ICDCS 2021], ATFuzzer [ACSAC 2019]Secure protocol design and defenseFBSDetector [Usenix Sec 2025A], AKMA+ [Usenix Sec 2025B], TIMESAFE [ACM TOPS], 5G-FL [WiSec 2025]My research has led to several changes in the design of 4G and 5G cellular standards. Also, I have found numerous security and privacy issues in various protocols and system implementations. Due to this, I have been inducted into the GSMA Mobile Security Research Hall of Fame three times, received acknowledgments from the WiFi Alliance, and received numerous bug bounties, CVDs, and CVEs. I received the Best Paper award at IEEE TPS 2025 and ACSAC 2019 and the Best Paper award nomination at ICDCS 2021. For outstanding security research, I received the Maurice H. Halstead Memorial Award and the Bilsland Dissertation Fellowship Award from Purdue University in 2020 and 2022, respectively.I got the opportunity to work as an Applied Scientist Intern at Amazon (Summer 2021) and a Security Researcher Intern at Intel (Summer 2020, 2019).I completed my B.Sc. from the Department of Computer Science and Engineering, Bangladesh University of Engineering and Technology, in September 2017.Selected Publications: (full list)Gotta Detect ’Em All: Fake Base Station and Multi-Step Attack Detection in Cellular NetworksImtiaz Karim*, Kazi Samin Mubasshir*, and Elisa Bertino, Usenix Security Symposium, (Usenix Security), 2025. (*joint first authors)CellularLint: A Systematic Approach to Identify Inconsistent Behavior in Cellular Network SpecificationsImtiaz Karim*, Mirza Masfiqur Rahman*, and Elisa Bertino,  USENIX Security Symposium, (Usenix Security), 2024. (*joint first authors)SPEC5G: A Dataset for 5G Cellular Network Protocol AnalysisImtiaz Karim, Kazi Samin Mubasshir, Mirza Masfiqur Rahman, Elisa Bertino, The 13th International Joint Conference on Natural Language Processing and the Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics, (IJCNLP-AACL), 2023. BLEDiff: Scalable and Property-Agnostic Noncompliance Checking for BLE ImplementationsImtiaz Karim, Abdullah Al Ishtiaq, Syed Rafiul Hussain, and Elisa Bertino, IEEE Symposium on Security and Privacy (IEEE S&P), 2023.Noncompliance as Deviant Behavior: An Automated Black-box Noncompliance Checker for 4G LTE Cellular DevicesImtiaz Karim*,  Syed Rafiul Hussain*, Abdullah Al Ishtiaq, Omar Chowdhury, and Elisa Bertino, ACM Conference on Computer (CCS), 2021. (*joint first authors)ProChecker: An Automated Security and Privacy Analysis Framework for 4G LTE Protocol ImplementationsImtiaz Karim, Syed Rafiul Hussain, and Elisa Bertino, IEEE International Conference on Distributed Computing Systems (ICDCS), 2021. Best Paper Award nomination Opening Pandora’s Box through ATFuzzer: Dynamic Analysis of AT Interface for Android SmartphonesImtiaz Karim, Fabrizio Cicala, Syed Rafiul Hussain, Omar Chowdhury, and Elisa Bertino, Annual Computer Security Applications Conference (ACSAC), 2019.  Distinguished Paper AwardRecent News:[November'25] Gave a keynote at the Machine Learning for Cybersecurity (MLC) workshop, co-located with ICDM 2025 on 5G and NextG security.[November'25] LLMalMorph received best paper award IEEE TPS 2025![November'25] Received research award from Polaris Wireless ($51.7K) for research on Fake Base Station Detection! [November'25] Gave an invited talk at IEEE Workshop on Distributed, Secure, and Trustworthy Intelligence with LLMs, co-located with TPS 2025.[November'25] TIMESAFE has been accepted to ACM TOPS![October'25] Received Distinguished Reviewer Award at SecDev 2025![September'25] LLMalMorph has been accepted to IEEE TPS 2025. Congratulations Ajwad![September'25] PSMBENCH has been accepted to NeurIPS 2025 dataset and benchmarks track. Congratulations Zilin![August'25] WCDCAnalyzer has been accepted to NDSS 2026. Congratulations Zilin![July'25] Invited to serve on the PC of CCS 2026 and Euro S&P 2026![April'25] Paper on Federated Learning for 5G has been accepted to WiSec 2025. Congratulations Yiwei![April'25] Invited to serve on the PC of Usenix Security 2026[March'25] Invited to serve on the PC of NDSS 2026[March'25] Invited to serve on the PC of ACSAC 2025[February'25] Received the Distinguished Reviewer Award from NDSS 2025![February'25] Our paper on defending link-stealing attacks on GNNs has been accepted to CODASPY 2025. Congratulations Mir Imtiaz![February'25] Invited to serve on the PC of IEEE S&P 2026, RAID 2025 and SecDev 2025[January'25] FBSDetector and AKMA+ have been accepted to Usenix Security 2025![November'24] Got accepted to the NeTS Early Career Investigator Workshop.[October'24] Presented my research on 5G security at the NSF AI-EDGE Year-3 Annual Meeting.[October'24] Invited to serve on the PC of CCS 2025[July'24] Invited to serve on the PC of Usenix Security Symposium 2025[June'24] Will serve as an instructor of CS-59100-SEC for Fall 2024[May'24] Invited to serve on the PC of IEEE S&P 2025.[April'24] Serving on the PC of NDSS'25 and CCS'24.[February'24] CellularLint has been accepted to Usenix Security 2024! Congratulations Mirza![February'24] Serving on the PC of ACSAC'24 and RAID'24[January'24] Our paper on Vehicular Networks name management protocol has been accepted to VehicleSec 2024. Congratulations Sharika![December'23] Gave a talk about my research on cellular network security at UC, Irvine .[November'23] Our paper on WiFi fragmentation and PSM verification has been accepted to AsiaCCS 2024. Congratulations Zilin![October'23] Gave a talk at Intel Labs about my research on cellular network security.[September'23] SPEC5G has been accepted to AACL 2023.[March'23] Serving on the PC of NDSS'24[March'23] Defended Ph.D. thesis![February'23]: BLEDiff awarded 10,000$ USD on bug bounties from Google.[January'23]: Serving on the PC of RAID'23[December'22]: Serving on the PC of ICDCS'23[December'22]: BLEDiff has been accepted to IEEE S&P 2023.[August'22]: Serving on the Artifact Evaluation Committee of EuroSys'23 and Usenix Sec'23.[July'22]: Proposal to conduct experimental research on the Platforms for Advanced Wireless Research (PAWR) for securing next-generation networks has been funded by NSF![April'22]: Google acknowledged a DIKEUE vulnerability as high severity issue and awarded $5000 USD reward.[April'22]: Received the prestigious Bilsland Dissertation Fellowship award from Purdue University Graduate School.[March'22]: Serving on the Artifact Evaluation Committee of Wisec 2022.[February'22]: Passed Ph.D. preliminary exam. Officially a Ph.D. candidate![February'22]: VWAnalyzer has been accepted to AsiaCCS 2022![October'21]: Serving on the Artifact Evaluation Committee of Usenix Sec 2022.[September'21]: DIKEUE-Noncompliance as Deviant Behavior: An Automated Black-box Noncompliance Checker for 4G LTE Cellular Devices, has been accepted to CCS 2021![August'21]: Inducted in GSMA Mobile Security Research Acknowledgements (previously known GSMA Mobile Security Hall of Fame) for the third time for uncovering and fixing implementation flaws/weaknesses in 4G/5G networks.[July'21]:  ProChecker has been nominated for the best paper award at ICDCS 2021![March'21]:  Inducted in GSMA Mobile Security Research Hall of Fame, again for finding vulnerabilities and suggesting improvements in the 4G/5G cellular network protocol (CVD-2021-0043).[March'21]: ProChecker has been accepted to ICDCS 2021![January'21]: I will be joining Amazon Automated Reasoning Group as an Applied Scientist Intern for summer 2021.[December'20]: Two papers based on my last 2 year's internships have been accepted in Intel SWPC (Software Practitioners Conference) 2020, an industrial conference organized by Intel.[October'20]: Intel renewed the funding of $72K for our work on the analysis of Intel's Bluetooth implementation for 2021![October'20]: Presented my last 2 year's internship work at the second annual Side Channel Academic Program (SCAP) workshop, Intel 2020. [September'20]: ATFuzzer (journal version) has been accepted for publication to ACM Digital Threats: Research and Practice.[August'20]: Comple",
  "content_length": 11702,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:04"
}