{
  "name": "In-Kwon Lee",
  "homepage": "http://cga.yonsei.ac.kr/people/iklee",
  "status": "success",
  "content": "In-Kwon Lee (Professor)CGnA@Yonsei/People/In-Kwon Lee (Professor)SearchShareIn-Kwon Lee (Professor)Ph.D., ProfessorDepartment of Computer Science, Yonsei University50 Yonsei-Ro, Seodaemungu, Seoul, 03722Republic of KoreaTel: +82-2-2123-5713Email: iklee@yonsei.ac.krGoogle Scholar: https://scholar.google.com/citations?user=4id34ogAAAAJ&hl=koDBLP: https://dblp.org/pid/00/988.htmlORCID: https://orcid.org/my-orcid?orcid=0000-0002-1534-1882Education•1985-1989: Department of Computer Science, Yonsei University (B.S)•1989-1992: Department of Computer Science and Engineering, POSTECH (M.S)•1992-1997: Department of Computer Science and Engineering, POSTECH (Ph.D.)•2005-2006: Film Music Composition Expert Course, Yonsei University (Completed)Professional Experiences•1997-1999: Researcher, Institute of Geometry, Vienna Institute of Technology (비엔나 공대 기하연구소 연구원)•1999-2001: Adjunct Professor, GSIT, POSTECH (포항공대 정보통신대학원 겸임교수)•1999-2001: Senior Researcher, PIRL, POSTECH (포항공대 정보통신연구소 선임연구원)•2001-2003: Assistant Professor, Division of Media, Ajou University (아주대학교 조교수)•2003-2006: Assistant Professor, Dept. of Computer Science, Yonsei University (연세대학교 조교수)•2006-2011: Associate Professor, Dept. of Computer Science, Yonsei University (연세대학교 부교수)•2007-2009: Director, Institute of Cultural Technology, Yonsei University (연세대학교 문화기술연구소장)•2007.03.01 - 2009.02.28.: Deputy Director, Office of Information and Communication, Yonsei University (연세대학교 정보통신처 부처장)•2012.03.01 - 2013.06.05: Vice President, University Industry Foundation, Yonsei University (연세대학교 산학협력단 부단장)•2013.09.01 - 2016. 02.28. : Principal Investigator, Human-Centered Future Computing Group (BK21 Program), Yonsei University (연세대학교 컴퓨터과학과 3단계 BK21 연구단장)•2013.09.01. - 2016. 02.28. : Head, Dept. of Computer Science, Yonsei University (연세대학교 공과대학 컴퓨터과학과장)•2014.01.01. - 2016.12.31. : Director, Korean Institute of Information Scientists and Engineers (한국정보과학회 이사)•2018.03.01. - 2022.02.29. : Director, Computer Engineering Program, Graduate School of Engineering, Yonsei University (연세대학교 공학대학원 컴퓨터공학/컴퓨터소프트웨어 전공주임)•2021.03.01. - 2022.01.28. : Deputy Director, Academic Information Center, Yonsei University (연세대학교 학술정보원 정보통신부원장) •2014.01.01. - : Vice President, Korea Computer Graphics Society (한국컴퓨터그래픽스학회 부회장)•2011.09.01. - : Professor, Dept. of Computer Science, Yonsei University (연세대학교 정교수)",
  "content_length": 2831,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:05"
}