{
  "name": "Ina Fiterau",
  "homepage": "https://people.cs.umass.edu/~mfiterau",
  "status": "success",
  "content": "Ina Fiterau - Home About Me I am an Assistant Professor in the College of Information and Computer Sciences at UMass Amherst, leading the Information Fusion Lab. Previously, I was a postdoc at Stanford University, having completed a PhD in Machine Learning from Carnegie Mellon University. My current research is on hybrid models and on the development of new deep learning methodology to obtain salient representations from multimodal biomedical data, including time series, text and images. I was awarded the Marr Prize for Best Paper at ICCV 2015, the Star Research Award at the Annual Congress of the Society of Critical Care Medicine 2016 and the Manning IALS Research Award in 2019. I am keenly interested in applying my ML research towards the advancement of healthcare. I previously co-organized several editions of the NeurIPS workshop on Machine Learning in Healthcare and more recently served as area chair for the Machine Learning in Healthcare Conference. I am also the admin of the ml4health Google group. Research Group In the Information Fusion Lab, we develop hybrid models for the prediction of clinical outcomes, such as the onset of Alzheimer's disease or mortality in the ICU, as well as tools for the analysis, processing and labeling of medical data using expert knowledge. Learn more about our team, our projects and our recent publications on our lab webpage. Basic Information Location:Office 222, CICS, Amherst, MA, US Email:mfiterau@cs.umass.edu Website:https://groups.cs.umass.edu/infofusion Course Links In Spring 2024, I am teaching 651 Optimization in Computer Science. Some info and links are below. Mon Wed 4:00 - 5:15 LGRC, Room A301 umass.moonami.com/course/view.php?id=38833 piazza.com/umass/spring2024/compsci651 Public course information Class Planning Spreadsheet (accessible to the UMass community) I plan to teach Optimization again in Spring 2025.",
  "content_length": 1890,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:05"
}