{
  "name": "Inah Omoronyia",
  "homepage": "https://research-information.bris.ac.uk/en/persons/inah-omoronyia",
  "status": "success",
  "content": "Inah Omoronyia - University of Bristol View Scopus Profile Dr Inah Omoronyia BEng, MSc Senior Lecturer in Privacy, School of Computer Science https://orcid.org/0000-0001-5357-0945 Emailinah.omoronyiabristol.acuk BS8 1UB Personal profile Research interests My research focuses on the intersections of software, privacy engineering and security as well as regulatory compliance. I investigates and builds frameworks, tools and techniques for engineering secured and privacy preserving software systems. I am an ERCIM Fellow. https://inah-dev.github.io/profile/ Fingerprint Dive into the research topics where Inah Omoronyia is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 4 Similar Profiles Software Systems Computer Science 100% Regulatory Compliance Computer Science 100% Privacy Preserving Computer Science 100% Software Application Computer Science 100% Personal Data Computer Science 100% Software Solution Computer Science 25% General Data Protection Regulation Computer Science 25% Privacy Concern Computer Science 25% View full fingerprint Research output 1 Conference Contribution (Conference Proceeding) Research output per year Research output per year Personal Data-Less Personalized Software ApplicationsBelguith, S., Omoronyia, I. & Chitchyan, R., 10 Jul 2024, FSE 2024: Companion Proceedings of the 32nd ACM International Conference on the Foundations of Software Engineering. d'Amorim, M. (ed.). Association for Computing Machinery (ACM), p. 477-481 5 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Personal Data 100% Software Application 100% Software Solution 25% Privacy Concern 25% Data Minimization 25% 1 Citation (Scopus) Projects 1 Active 3 Finished Projects per year EPSRC CDT: Cyber Secure EverywhereRashid, A. (Principal Investigator), Joinson, A. N. (Co-Investigator), Omoronyia, I. (Co-Investigator), Smith, L. G. E. (Co-Investigator) & Owen, R. (Co-Investigator)1/04/24 → 30/09/32Project: Research, Parent Personal Assistant 100% Data Deletion 100% Widespread Adoption 20% Interview Study 20% Information Storage 20% Consent Verification in Autonomous SystemsOmoronyia, I. (Principal Investigator)1/07/22 → 31/01/23Project: Research Consent Verification in Autonomous SystemsOmoronyia, I. (Principal Investigator)1/02/22 → 30/06/22Project: Research, Parent View all 4 projects",
  "content_length": 2441,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:07"
}