{
  "name": "Inald Lagendijk",
  "homepage": "https://www.tudelft.nl/ewi/over-de-faculteit/afdelingen/intelligent-systems/people/profdrir-rl-inald-lagendijk",
  "status": "success",
  "content": "Staff Zoeken Sluit zoek Prof.dr.ir. R.L. (Inald) Lagendijk Prof.dr.ir. R.L. (Inald) Lagendijk Elektrotechniek, Wiskunde en Informatica Intelligent Systems Cyber Security Pure-profiel Contact R.L.Lagendijk@tudelft.nl +31 15 27 83731 Ruimte: 29.02.250 Profiel RESUME Prof.dr.ir. Inald Lagendijk (1962) is Distinguished Professor in Computing-based Society, and member of the Cybersecurity research group. He has more than 35 years of research and teaching experience in digital signal processing, including image and video processing, compression, search, watermarking, digital content protection, and artificial intelligence. In the last decade his research focused on privacy-protected signal processing, data sharing, algorithm transparency, and meaningful human control over autonomous intelligent systems. Professor Lagendijk has more than 25 years of experience in leading national and international fundamental and public-private research projects. He is currently board member of the national AiNed program, and captain of science (CTO) of the national innovation topteam on ICT. He is founding board member of the Netherlands Academy of Engineering (NAE). ACADEMIC TRACK RECORD Professor Lagendijk was awarded the Antoni van Leeuwenhoek professorship at Delft University of Technology in 1999. He was elected to the Royal Netherlands Academy of Arts and Sciences (KNAW) in 2009. He was also elected member of the Royal Holland Society of Sciences and Humanities (KHMW), and of the Netherlands Academy of Technology and Innovation (AcTI). He is a Fellow of the IEEE (class of 2007, for Contributions to Image Processing). His publication track record and citations can be found on the Google scholar page or DBLP. Professor Lagendijk has (co-)supervised over 40 completed Ph.D. theses. He has been involved as coordinator or participant in a large number of national and European projects. TEACHING Professor Lagendijk has been lecturing computer science and electrical engineering courses since 1990. His teaching expertise includes digital (multidimensional) signal processing, probability and statistics, random signal processing, digital image and video compression, watermarking, and computer vision. He is author of the text book Statistical Signal Processing (in Dutch). He has developed the free educational software package VCDemo for use in image and video compression courses. It is an often downloaded tool for learning about compression techniques: from basic sampling and DPCM, JPEG, to the most advanced scalable embedded zerotree wavelet image compression technique, and the MPEG video compression standard. CURRENT PROFESSIONAL ASSIGNMENTS Board member of the national growth fund program AiNed (since 2022). Chair of the Advisory Committee of the NWO Robust program on Trustworthy AI-based systems for sustainable growth (since 2023). Board member of the TKI ICT (since 2023). Chair of the Faculty of EEMCS Career Development Committee (since 2020). Member of the steering committee of PRIO: ICT research at Applied Universities (since 2017). Captain of Science (CTO) of the national innovation topteam on ICT (since 2015). Member of the board of the foundation COMMIT/ (since 2011). PAST PROFESSIONAL ASSIGNMENTS Member of the NWO Computer Science Advisory Committee (2018 - 2023). Member of the strategy team of the Dutch AI Coalition (NL AIC) (2020-2021). Chair of the Cybersecurity Group at Computer Science, TU Delft (2019-2021). Member of the Netherland eScience Center Advisory Committee (2015-2021). Figurehead ('boegbeeld') of the route Creating value through responsible access to and use of big data of the Dutch National Research Agenda (NWA) (2016-2021). Scientific Director of the TU Delft program AiTech on Meaningful Human Control over Autonomous Intelligent Technology (2018-2021). Coordinator of the national VSNU research program Digital Society (since 2018). Member of the board of the foundation Cybersecurity Academy (CSA) (2018-2021). Scientific leader of the NWA startimpulse project VWData: Responsible Value Creation using Big Data (2018-2021). See VWData video clips about FAIR and FACT principles. Member of the KNAW advisory committee on Storage and Availability of Data for Research (2019-2021). Chair of the NWO committee to deliver AIREA-NL: AI Reseach Agenda for the Netherlands (2019). Member of the Taskforce AI, commissioned by Ministry of Economic Affairs and Confederation of Netherlands Industry and Employers (VNO-NCW) to establish the Dutch AI Coalition (NL AIC) and its Action Agenda (2018-2019). Member of the AINED initiative by topteam DDD, ICAI, TNO, NWO, VNO-NCW, Boston Consulting, and DenkWerk, to prepare for the AI strategy for the Netherlands: AI voor Nederland (2018). Member of the management team of the ASCI Research School (2011-2019). Member of the strategic advisory committee of the Dutch node in EIT Digital (2010-2019). External examiner of the EE-program at Trinity College, Dublin (2017-2019). Head of department Computer Science 'Intelligent Systems' (2011-2018). Scientific director of the 4TU federation's Netherlands Institute on ICT (4TU.Nirict) (2012-2018). Founder and coordinator of the national topsector program Commit2Data (2014-2016). Director of TU Delft EEMCS External Relations and Valorization (ERV) team (2013-2016). Member of the Board of NWO Physical Sciences Division (Gebiedsbestuur Exacte Wetenschappen) (2013-2016). Board member of the Foundation TKI Switch2SmartGrids (2013-2016). Member of IPN: ICT Research Platform Netherlands. Member of TNO Industries Strategic Advisory Board (2015-2017). Member of the KNAW advisory committee on Digital Literacy: Skills and attitudes for the 21st century (2012-2013). Scientific director of the Center for Dependable ICT (3TU.Cedict). Member advisory council of the Netherlands ICT Research and Innovation Authority (ICTRegie) (2008-2010). Chairman of the Board of Freeband, the national research program on communication technology (2004-2009). Watch the (2009) promo movie on Ambient Life. Coordinator of the EU FP7 Network of Excellence PetaMedia (Peer-to-peer tagged media) (2008-2011). STRATEGIC DOCUMENTS AND CLIPS ON AI AND DATA Professor Lagendijk has contributed to several strategic documents and illustrative video clips on artificial intelligence and big data. An introduction to the FAIR (data) and FACT (data science) principles can be found here, with an overarching video about the NWA VWData project. An interview about trust in big data can be found here. In 2008, prof. Lagendijk presented TU Delft's Dies Natalis lecture, entitled Get Real! Reflections on Trustworthy Virtuality. The NWA movie Robin contains several dilemma's that deal with today's digital society, such as Do you let big data determine your ideal career? The Dutch AI coalition was formed on the basis of the AINED call-to-action, a landscape analysis of AI in The Netherlands, and the  NLAIC action agenda; both documents contain strategic contributions by prof. Lagendijk. He was also chair of the team of 40 Dutch AI scientists who composed the Dutch AI research agenda AIREA-NL. KEY PUBLICATIONS R.L. Lagendijk, Z. Erkin, M. Barni. Encrypted Signal Processing for Privacy Protection: Conveying the Utility of Homomorphic Encryption and Multiparty Computation. IEEE Signal Processing Magazine. vol. 30 (1), pp. 82-105, 2013. Z. Erkin, M. Franz, J. Guajardo, S. Katzenbeisser, R.L. Lagendijk, T. Toft. Privacy-Preserving Face Recognition. International Symposium on Privacy Enhancing Technologies Symposium, pp. 235-253, 2009. E.I. Lin, A.M. Eskicioglu, R.L. Lagendijk, E.J. Delp. Advances in Digital Video Content Protection. Proceedings of the IEEE. vol. 93 (1), pp. 171-183, 2005. G.C. Langelaar, I. Setyawan, R.L. Lagendijk. Watermarking Digital Image and Video Data. A state-of-the-art overview. IEEE Signal Processing Magazine. vol. 17 (5), pp. 20-46, 2000. J. Biemond, R.L. Lagendijk, R.M. Mersereau. Iterative Methods for Image Deblurring. Proceedings of the IEEE. vol. 78 (5), pp. 856-883, 1990. R.L. Lagendijk, Iterative Identification and Restoration of Images, 1990 (thesis also published as monograph by Springer). CONTACT INFORMATION AND MORE Professor Lagendijk can be found on  LinkedIn. Go here for press photographs. For details on the Big Data Route of the Dutch National Research Agenda, contact prof. Tibor Bosse (t.bosse@ru.nl) or Freek Bomhof (freek.bomhof@tno.nl). For more information about the Department of Intelligent Systems, go to https://www.tudelft.nl/en/eemcs/the-faculty/departments/intelligent-systems/. If you are writing a (personal) grant in Computer Science, get a load of useful information from previous successful submissions in this slide set Tips for Writing Personal Grant Proposals in ICT.pdf. Expertise Data Cryptography Privacy Preserving Solutions Computation Calculation methods Algorithms Algorithms Processing Encrypted Data Publicaties 2024 Trajectory Hiding and Sharing for Supply Chains with Differential Privacy Tianyu Li / Li Xu / Zekeriya Erkin / Reginald L. Lagendijk 2022 Meaningful human control: actionable properties for AI system development L. Cavalcante Siebert / M.L. Lupetti / E. Aizenberg / N.W.M. Beckers / A. Zgonnikov / H.M. Veluwenkamp / D.A. Abbink / Elisa Giaccardi / G.J.P.M. Houben / C.M. Jonker / M.J. van den Hoven / D. Forster / R.L. Lagendijk 2022 Privacy-Preserving Bin-Packing With Differential Privacy Tianyu Li / Zekeriya Erkin / Reginald L. Lagendijk 2020 Decentralized Incentive-Compatible and Sybil-Proof Transaction Advertisement Oğuzhan Ersoy / Zekeriya Erkin / Reginald L. Lagendijk 2020 PREDICT Efficient Private Disease Susceptibility Testing in Direct-to-Consumer Model Chibuike Ugwuoke / Zekeriya Erkin / Marcel Reinders / Reginald Lagendijk Meer publicaties Onderwijs 2023 Signal Processing Onderwijs 2022 Signal Processing Media 2025-05-06 Shaping the future of Artificial Intelligence (AI) in Mobility Lees artikel Shaping the future of Artificial Intelligenc",
  "content_length": 11007,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:08"
}