{
  "name": "Indrajit Ray",
  "homepage": "http://www.cs.colostate.edu/~indrajit",
  "status": "success",
  "content": "Home Page of Indrajit Ray Indrajit Ray Navigation Home Research Projects Teaching Professional Publications Students News Call for Papers (Security Conferences) CIPHER Call for papers Computer Security Conferences Links Security Mailing Lists Security & Privacy News from CNET Privacy Rights Clearinghouse The  Risks Digest Brief Bio-sketch I am a Professor at Colorado State University. I joined the faculty of the Computer Science Department at Colorado State University in fall of 2001. Prior to that (Fall 1997 to Winter 2001) I was an Assistant Professor in the Computer and Information Science at University of Michigan-Dearborn. My main research interests are in the areas of data and application security, network security, security modeling, risk management, trust models, privacy and digital forensics. At Colorado State University, I am a member of the Data and Applications Security Group, the Network Security Group, and the Software Assurance Laboratory. My research has been funded by the U.S. National Science Foundation, the Air Force Office of Scientific Research, the Air Force Research Laboratory and the Federal Aviation Administration. I was one of the founding members and the first Chair of the IFIP TC-11 Working Group 11.9 on Digital Forensics. I have served on numerous conference program committees as well as organizing committees, on grant review panels, and as external evaluator of academic programs. I am currently serving on the editorial board of three international journals. I am a member of IEEE Computer Society, ACM, ACM Special Interest Group on Security Audit and Control, IFIP  WG 11.3 on Data and Applications Security and IFIP WG 11.9 on Digital Forensics. I received the PhD. degree in Information Technology from George Mason University in Fairfax, VA in 1997. My undergraduate degree is B.E. in Computer Science and Engineering, which I received from Bengal Engineering College, India, (currently known as Bengal Engineering and Science University) in 1984. I also received the M.E. degree in Computer Science and Engineering from Jadavpur University, India, in 1991. Achievement that I am most proud of: My students past and present. My Academic Lineage (based primarily on information from the Mathematics Genealogy Project). My Erdős number is 3 Dept. of Computer Science Colorado State University 1873 Campus Delivery Fort Collins, CO 80523 Ph: (970) 491-7097 Fax: (970) 491-2466 Email: indrajit AT cs DOT colostate DOT edu",
  "content_length": 2475,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:09"
}