{
  "name": "Indranil Gupta",
  "homepage": "http://indy.cs.illinois.edu",
  "status": "success",
  "content": "Indranil Gupta : UIUC Home Page Indranil Gupta Professor, Department of Computer Science; & Affiliate Faculty, Department of ECE, ITI, Beckman Institute; @ University of Illinois, Urbana-Champaign. IEEE Fellow, ACM Distinguished Member [Podcast] [Teaching] [PhD Students] [Research and Papers] [News Articles] [Service] [CV, Awards, and Bio] [Contact] [Hobbies] Podcast I host the (free) podcast Immigrant Computer Scientists. Listen to personal stories (oral histories) of immigration from prominent and distinguished Computer Scientists from academia and industry, who immigrated from their home countries to the US. Subscribe and listen for free on Apple Podcasts, Google Podcasts, Spotify, and nearly all podcast outlets. New Episodes every week from Aug 26th, 2021 and onwards! Check it out! Episode guides available at the website for Immigrant Computer Scientists. Join the online discussion on Twitter and Facebook. Throughout 2021 and 2022, the podcast has ranked among the top 20% of podcasts in the world! (based on listener download numbers). Teaching Current CS425 / ECE 428 - Distributed Systems [Fall 2025] This year the school/department is unable to maintain a waitlist. Please do not email us to give you an override. In the past everyone (on campus) who wanted to get in, has managed (though there's no guarantees). Please continue submitting HWs and MPs. If you can't register by the end of September, email Indy. The school has informed us that we cannot approve double-booking CS425 with another class. This is due to limitations of final exam logistics. Please do not email us asking for overrides/conflict approval. This class has multiple sections: 3 cr on-campus (no MPs), 4 cr on-campus (with MPs), MCS Chicago (3cr and 4cr), and online (Coursera: 3cr and 4cr). Generally undergrads and graduate students (and in each 3cr and 4cr) are curved separately at semester end. This is an introductory course on distributed systems. Programming assignments involve building a real, working, cloud computing system, in several stages. Pre-/co-requisites include: OS or networking, and (for on-campus MPs) basic sockets programming. Past versions: [Fall 2024] [Fall 2023] [Fall 2022] [Fall 2020] [Fall 2019] [Fall 2018] [Fall 2017] [Fall 2016] [Fall 2015] [Fall 2014] [Fall 2013] [Fall 2012] [Fall 2010], [Fall 2007], [Fall 2006], [Spring 2005], [Spring 2004 (CS 328)] (older versions archived) CS 525 - Advanced Topics in Distributed Systems [Spring 2026 (Coming Soon!)] A cutting-edge graduate course covering contemporary and classical papers in multiple areas of distributed systems - cloud computing, peer to peer systems, distributed algorithms, and sensor networks. A class of 50+ graduate (and undergraduate) students reviews, presents, and debates about 80 papers. Projects are either entrepreneurial ventures, or are research-oriented - the course has a strong history of having its projects published in conferences and journals. Past versions: [Spring 2025] [Spring 2024] [Spring 2023] [Spring 2021] [Spring 2018] [Spring 2017] [Spring 2016] [Spring 2015] [Spring 2014] [Spring 2013] [Spring 2011] [Spring 2010] [Spring 2009] [Spring 2008], [Spring 2007], [Spring 2006 (CS 598IG)], [Fall 2004 (CS 598IG)], [Fall 2003 (CS 497IG)]. Cloud Computing Concepts (C3), a free online course (MOOC) on Coursera. This is a 2 part course, where each part is 5 weeks long. Current offering (started May 2016, and offered on a continuous basis since): [C3 Part 1] [C3 Part 2] If you are interested in just taking the basic Coursera course, use these links above. If you are interested in obtaining a Masters' degree around such material, apply to CS@UIUC's MCS-DS Program. First offering: Feb-Apr 2015. Cloud Computing Concepts Part 1, and Part 2 is here. Total registered students: over 250K (since 2015). Also offered as part of UIUC CS's MCS-DS program (concurrent with CS425 in Fall semesters). Since Fall 2016 semester. Capstone: Cloud Computing Specialization Current offering (started May 2016, and offered on a continuous basis since): [Cloud Capstone] [Jan - Mar 2016] Also offered as part of UIUC CS's MCS-DS program (Spring semesters). Since Spring 2018 semester. CS 591IG - Advanced Seminar in Distributed Systems This seminar is intended primarily for students who're actively working on a project with Indy, e.g., all students in the DPRG group. Course websites are hosted on wiki for registered students (older links are below). Past versions: [Fall 2013] [Spring 2013] [Fall 2012] [Spring 2009] [Fall 2008] [Spring 2008], [Fall 2007], [Spring 2007], [Fall 2006], [Spring 2006], [Fall 2005], [Spring 2005]. Older (Aug 2021 - Aug 2022: On Sabbatical, creating a new podcast! The Immigrant Computer Scientists Podcast. (Aug 2011 - Jul 2012: On leave from Illinois, working as full-time Google Employee, i.e., Google Visiting Scientist). CS 241 - System Programming: [Fall 2008] CS 423 - Operating Systems: [Fall 2005 (Undergraduate)] CS591FSN, Spring 2010 - Seminar on Mathematical Foundations and Tools for Systems and Networking Research: [Spring 2010] (UIUC access only) CS 591SN - New Systems and Networking Seminar: [Spring 2009] [Fall 2008] [Spring 2008], [Fall 2007], [Spring 2007], [Fall 2006], [Spring 2006], [Fall 2005]. A broad seminar featuring top systems papers, upcoming job talks, upcoming conference talks, and lots of questions and debate. PhD Students Current Anna Karanika Xiaojuan Ma Maleeha Masood (co-advised with Deepak Vasisht) Chirag Shetty Xinying Zheng (co-advised with Yongjoo Park) Kai-Siang Wang Sarthak Chakraborty Han-Ting Liang (co-advised with Francis Yan) Alumni Beomyeol Jeon Defended Ph.D. Jun 2024. Next Employment: Tesla. Rui Yang Defended Ph.D. Mar 2022. Next Employment: Google. Le Xu, Graduated Sep 2021. Next Employment: CIFellows Postdoc, with Prof. Aditya Akella, University of Texas-Austin. Cong Xie (co-advised with Sanmi Koyejo), Graduated 2021. Next Employment: ByteDance, USA. Faria Kalim, Graduated 2020. Next Employment: Apple, Cupertino CA. Shegufta Ahsan, Graduated 2020. Next Employment: Amazon, Austin TX. Shadi Noghabi (co-advised with Roy Campbell), Defended Ph.D. May 2018. Next Employment: Microsoft Research, Redmond WA. Mainak Ghosh, Graduated 2018. Next Employment: Twitter, San Francisco CA. Muntasir Raihan Rahman, Graduated Ph.D. August 2016. Next Employment: Microsoft, Redmond WA. Imranul Hoque, Graduated Ph.D. July 2013. Next Employment: VMWare, Palo Alto, CA. (Currently at Google). Brian Cho, Graduated Ph.D. October 2012. Defended October 2012. Next Employment: Samsung, Seoul, South Korea, then Research Scientist at Seoul Natl. Univ. (Currently at: Facebook). Steven Y. Ko, Graduated Ph.D. July 2009, Submitted August 2009. Next Employment (Currently at : Associate Professor, School of Computing Science, Simon Frasier Univ. Career Path after PhD: 2009-2010 Postdoctorate at CS/ECE Princeton University, 2010-2017 Asst. Prof. at CSE SUNY-Buffalo, 2017-2020 Assoc. Prof. at SUNY-Buffalo, 2020-Present Assoc. Prof. at Simon Frasier Univ.). Ramses V. Morales, Graduated Ph.D. June 2009, Submitted August 2009. Next Employment: Postdoctoral Scholar, Xerox Research, Webster NY (then at Pattern Insight. Currently at VMWare). Jay A. Patel, Graduated Ph.D. May 2009. Defended April 2009. Next Employment: Yahoo!, Champaign (then at Pattern Insight, VMWare, Uber Currently startup founder of Midtype). Research and Publications My research group: Distributed Protocols Research Group(this link will take you out from this website) I co-lead the Just Infrastructures Center with Karrie Karahalios (CS) and Anita Chan (I-School). Come join our awesome Speaker Series in Spring 2021 and Fall 2021! DPRG Blog (new June 2018!) What the News/Blog Media thinks about My Research and Work ``How a tiny bug spiraled into a massive outage that took down the internet.'' CNN's article on the AWS outage of Oct 19-20 2025 featured quotes and intuitive explanations from me. CS professor Indranil Gupta elevated to IEEE Fellow. CS@Illinois Article. 2024. AMD Cloud Chronicles\" Podcast Interview of Indranil Gupta on the topic of Cloud Computing. 'Immigrant Computer Scientist' Podcast Shares Human Stories of Immigrants Who Have Shaped the Computing Landscape. CS@Illinois Article about my Immigrant Computer Scientists Podcast. 2021. Immigration and Computer Science, Blog Post by Sharif Islam. Covering my Immigrant Computer Scientists Podcast. 2021. Podcast Interview by \"Software at Scale\" Series. 2021. Quartz article lists MOOC courses as one its top Computer Science courses to take. 2018. The Morning Paper's coverage of our Getafix paper in Eurosys 2018. The Morning Paper's coverage of our Service Fabric paper in Eurosys 2018. CS@Illinois article on our work involving Microsoft's Service Fabric, Apr 20, 2018 Article on Implicit Bias in Online Courses, Daily Illini, Mar 26, 2018. (Featuring an interview) Google Offers Free Cloud Access to Colleges, Plays Catch Up to Amazon, Microsoft, EdSurge Article, Aug 17, 2016. (Featuring an interview) Harnessing the power of the Data Revolution, Click Magazine, 2016. vol 1. See pages 12-18. Folks are blogging about our Cross-layer Cloud Scheduling work from IC2E 2015 -- see here. You can find the paper here. Apr 15, 2015 HP Enterprise article (Issue No. 7, Fall 2015) about public clouds. (Featuring an interview) CS@Illinois MOOC Enrolments Soar as New Specializations Launch, CS Department Article, Apr 10, 2015 How Close is too Close? Industry Courts Computer Scholars, Chronicle of Higher Education (Avi Wolfman-Arent), Aug 11, 2014 Engineers OnStage Interview (2012, Interviewers: Ravi Sathyam and David Albrecht) Chronicle of Higher Education (Avi Wolfman-Arent), Aug 11, 2014 AEL Faculty Fellowship Entrepreneurial-focused course seeks to expand on UI-Led Revolutions in Distributed Computing (Feb 22, 2010, UIUC CS news article) (July 29/30, 2008) Cloud Computing Testbed: Professor Indranil Gupta, along with Professors Mike Heath and Roy Campbell",
  "content_length": 24068,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:10"
}