{
  "name": "Indre Zliobaite",
  "homepage": "https://www.zliobaite.com",
  "status": "success",
  "content": "Indrė ŽliobaitėSearch this siteEmbedded FilesSkip to main contentSkip to navigationIndrė ŽliobaitėI am a professor at the  University of Helsinki in Finland, where I lead a research group on Computational data analysis. Our research is interdisciplinary focusing on computational approaches for understanding change processes in nature and society. We also contribute to the theory and practice of trustworthy machine learning, ethics and philosophy of AI.Keywords: data science, macroevolution, macroecology, concept drift, change detection, long term forecasting, trustworthy machine learning, robust machine learning, philosophy of AI, ethics of AI and AI for science.Google Scholar     My  research group      ORCID       UHResearchPortal       My research blog     What's up?December 2025 » The final public seminar of HAT research project will take place in Turku on December 12. The unifying theme is Transformation in the changing word. Welcome! More info is here.November 2025 » I'm giving a keynote talk on Trustworthy AI at Future Digileaders'25 at KTH, StockholmOctober 2025 » I'm giving a keynote talk on Trustworthy AI at OP bank, Designing for AI seminarJune 2025 » I will attend AIS conference in OuluJune 2025 » I will give a talk on \"AI as a measurement tool in science?\" at the Method and Convergence conferenceMay 2025 » My inaugural lecture on \"Analysing change\" will take place on May 28 at 15:00April 2025 » We are organising HAT science-art symposium in TampereMarch 2025 » I am attending OIKOS-Finland conference in JyväskyläDecember 2024 » We are organising a workshop on The Senescence of Social Systems at the Santa Fe InstituteNovember 2024 » We are organising a Symposium in memory of Finnish palaeontologist Björn Kurtén, the special issue is hereSeptember 2024 » PC Co-Chair for ECML PKDD in VilniusAugust 2024 » teaching at the 21st Estonian Summer School on Computer and Systems ScienceJuly 2024 » teaching at the Turkana Basin Institute, KenyaFebruary 2024 » I was promoted to a full ProfessorDecember 2023 » HAT symposium in TurkuSeptember 2023 » I'm attending a workshop on Limits of (Im)mortality in Complex Living Systems at Santa Fe InstituteSeptember 2023 » The NOW book is now publishedJune 2023 » I got project funding from the Academy of Finland \"Macroevolution of ecological relationships: does the key to the past wear out?\". One PhD position is now open, apply by July 4. FilledMay 2023 » Visiting Duke Lemur Center -- Duke University February 2023 » Visiting École Polytechnique in France and Max Planck Institute of Geoanthropology in GermanyJanuary 2023 » I received Björn Kurtén Prize, awarded by Nordenskiöld-samfundet, thank you so much November 2022 » Celebrating 25 years anniversary of the NOW database October 2022 » Coming up: a public HAT project seminar at Think Corner, Oct 27 17:00-19:00September 2022 » Aura Raulo is teaching a course on art-science collaboration on behalf of our HAT projectAugust 2022 » Collection work in Stuttgart and Mainz. Then attending ISDM at Senckenberg in Frankfurt.June-July 2022 » Fieldwork in Turkana (Lothagam, Loperot, Buluk). It was fantastic!December 2021 » I was elected to the Finnish Society of Sciences and Letters December 2021 » Teaching live, finally, after many months online. November 2021 » Museum and data work in Nairobi.August 2021 » I have an opening for a postdoc with a computational background in a project about early human evolution. Get in touch if interested.  Closed.June 2021 » We just got Academy funding with Miikka Tallavaara and Anu Kaakinen. The project is called \"Environments and energy use of early humans on the edge\". I'll be looking for a postdoc with a background in recommender systems. May 2021 » I'm teaching again an intensive interdisciplinary course on Analysing the changing world. This time we have students from math, data science, neuroscience, law and philosophy. Great group! February 2021 » project news item Evol­u­tion is all around us – can we model how big changes hap­pen in nature and society?January 2021 » We are looking for a data science postdoc for two years (based in Helsinki) to work on comparing evolution in nature and society within a Koneen Säätiö funded project (see below). If you are interested, please get in touch with Indrė Žliobaitė. December 2020 » Wonderful news, we got funding from Koneen Säätiö for Comparing evolution in nature and society -- 7PIs from computer science, economics, linguistics, biogeosciences and arts. October 2020 » New on Her Majesty's secret service \"All sizes for the Red Queen\".July 2020 » We are organising a Summer School on Foundations in Quantitative Palaeontology via  zoom in September 2020. Apply by August 30.May 2020 » And I wrote an opinion piece on objectivity in evolutionary sciences.April 2020 » I wrote a beginners guide to  time information in the fossil record, used my tablecloths for illustrations. March 2020 » Back from a month in Kenya collecting fossil data to new Europe. Greetings from home office.January 2020 » After over a year of preparation my workshop on Comparing evolutionary processes in biology, culture, economy and society (The HAT workshop) took place at the headquarters of The Finnish Society for Sciences and Letters. There will be very interesting follow ups, stay tuned!January 2020 » Just finished teaching an intensive course on analysing the changing world. I really really enjoyed it, and the students too, they say. And the student projects turned out wonderfully! I'll do the course again next January.November 2019 » We are starting to teach Trustworthy machine learning. This year's edition is about privacy and fairness.October 2019 » I was appointed as the General coordinator of the NOW database . That is a voluntary position of trust and expertise.October 2019 » Attending Lorenz workshop on predicting evolution, curiousier and curiousier.September 2019 » Slides from my ECMLPKDD keynote are here.September 2019 » Off to ECMLPKDD in Wuerzburg, giving a keynote talk on Palaeontology as a computational science.August 2019 » Teaching fairness and machine learning at a summer school, Technical University of Denmark. Wonderful audience again!August 2019 » Just back from Seoul, I was invited to a panel on AI policy for the future , great discussion, great audience!July 2019 » I'm in Madrid for two weeks -- fossil collections and then excavations in Batallones.June 2019 » attending MioMeet in Stockholm May 2019 » Acting as the opponent for PhD defence of Theodoros Vasiloudis at KTH, very nice piece of research work!May 2019 » Visiting fossil collections at the American Museum of Natural HistoryApril 2019 » Visiting fossil collections in BaselMarch 2019 » Attending Macroecology 2019 in WürzburgDecember 2018 » I got the Researcher of the Year Award from the Department of Computer Science.  December 2018 » visiting Stockholm University, I'm the opponent for I.Homem's defence.October 2018 » Attending a workshop in Leuven on Exploring Implicit Assumptions and Context in Debiasing and Discrimination-Awareness.September 2018 » I have an opening for a postdoc having experience in remote sensed or geospatial data analysis. Please e-mail me if you are interested.July 2018 » I am looking for a PhD student and a Postdoc to work on machine learning methods for analysing biospheric change. This is about concept drift over evolutionary times. Apply by August 15. Filled.June 2018 » I got Academy Project Funding! The topic is \"Machine learning methods for analysing biospheric change\".May 2018 » Here are the slides of my recent talk on Fairness-aware Machine Intelligence. References to my works on the topic can be found here.April 2018 » Research visit to The Museum of Evolution in Uppsala.April 2018 » I visited Dept. of Geology and Mineralogy and Life Sciences Center at Vilnius University.March 2018 » I'm hiring a postdoc with a focus on data science, macroevolution or palaeoecology. Get in touch if you are interested and have ideas on what to work together. The position is for two years in Helsinki.February 2018 » I gave a talk at CS Forum, Aalto University on Predictive modelling over evolutionary times, the slides are here.February 2018 » Meike Wortel from CEES - Centre for Ecological and Evolutionary Synthesis, University of Oslo is visiting us.December 2017 » Prof. Christine Janis from University of Bristol is visiting us.December 2017 » I'm visiting METOS, University of Oslo.November 2017 » Our Red Queen paper is out. We also wrote a blog post on the topic.September 2017 » I'm looking for a PhD student in machine learning for evolving data in biogeosciences. Apply here by 31 October, 2017. August 2017 » I put a compressed version of my rejected ERC proposal on Fairness-aware machine learning to Arxiv. Feel free to reuse, demolish or ignore.June 2017 » I got a tenure track assistant professorship in Life science informatics at the Department of Computer Science, University of HelsinkiMay 2017 » My tutorial on Machine learning for fossil data analysis is accepted to ECMLPKDD'17Feb 2017 » Visiting Turkana Basin Institute in KenyaFeb 2017 » Our new group website -- Evolutionary Palaeontology GroupJan 2017 » Research internship -- machine learning for fossil data analysis, apply by March 1Jan 2017 » I moved to the University of Helsinki full time, I'm affiliated with the Department of Geosciences and Geography and the Department of Computer ScienceNov 2016 » Our commentary regarding evolution and learning is publishedOct 2016 » Our PNAS paper is published, Herbivore teeth predict climatic limitsSep 2016 » I am attending ECMLPKDD in Riva del Garda (September 19-22)July 2016 » Visiting Saarland University and Max Planck institute in SaarbrueckenMay-June 2016 » I'm in Berlin on a research visit to the Museum of Natural HistoryMay 2016 » I am visiting EU Fundamental Rights Agency FRA (May 18)May 2016 » We are organising a workshop on Data science for social good at ECMLPKDD'16Apr 2016 » I wa",
  "content_length": 10169,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:10"
}