{
  "name": "Ing-Ray Chen",
  "homepage": "http://people.cs.vt.edu/~irchen",
  "status": "success",
  "content": "Home Page of Ing-Ray Chen Ing-Ray Chen Emeritus Professor Ing-Ray Chen Department of Computer Science Virginia Tech (Virginia Polytechnic Institute and State University) 7054 Haycock Road Falls Church, VA 22043 Tel: (703) 538-8376 Fax: (703) 538-8348 Email: irchen at cs.vt.edu Biography Professional Activities Grant Activities Teaching Schedule Recent Journal Paper Publication (Click her to see our winning paper of The 2015 IEEE Communications Society William R. Bennett Prize in the Field of Communications Networking.) Recent Conference Paper Publication Biography Click here to see Prof. Ing-Ray Chen's H-Index. Ing-Ray Chen received the BS degree from the National Taiwan University, and the MS and PhD degrees in computer science from the University of Houston, University Park. He is a professor of Department of Computer Science at Virginia Tech. Prior to joining Virginia Tech, he was on the faculty of the Department of Computer and Information Science at University of Mississippi during 1989-1994 and the Department of Computer Science and Information Engineering at National Cheng Kung University, Tainan, Taiwan, during 1995-96. His research interests are primarily in trust, network and service management as well as reliability, security and performance analysis of mobile systems and wireless networks, including Internet of Things, wireless sensor networks, service-oriented peer-to-peer networks, ad hoc networks, mobile social networks, mobile web services, mobile cloud services, and cyber physical systems. Dr. Chen has published over 120 journal papers with more than one third of them appearing in IEEE/ACM Transactions journals. He has served as an AE for IEEE Transactions on Knowledge and Data Engineering, IEEE Communications Letters, IEEE Transactions on Network and Service Management, and IEEE Transactions on Services Computing. He is a recipient of the IEEE Communications Society William R. Bennett Prize in the field of Communications Networking, and a recipient of the Army Research Laboratory Publication Award. He is a recipient of the IEEE Communications Society William R. Bennett Prize in the field of Communications Networking, a recipient of the 2023 IEEE ComSoc Network Operations & Management (CNOM) Test of Time Paper Award, and a recipient of the U.S. Army Research Laboratory (ARL) Publication Award. Dr. Chen is a member of the IEEE and ACM. Professional Activities Associate Editor, IEEE Transactions on Services Computing (IEEE Computer Society), March 2017 - 2023. Associate Editor, IEEE Transactions on Network and Service Management (IEEE Communications Society), Jan. 2011 - 2020. Editorial Board, The Computer Journal (British Computer Society), 1999 - 2021. Associate Editor, IEEE Communications Letters (IEEE Communications Society), Dec. 2010 - 2016. Associate Editor, IEEE Transactions on Knowledge and Data Engineering (IEEE Computer Society), 2000-2004. Associate Editor, Security and Communication Networks Journal (Wiley InterScience), 2009 - 2017. Associate Editor, International Journal on Artificial Intelligence Tools (World Scientific), 2002 - 2012. Editorial Board, Wireless Personal Communications (Springer), 2005 - 2016. Editorial Board, Journal of Wireless Communications and Mobile Computing (Wiley InterScience), 2007 - 2010. Program committee, 44th IEEE International Conference on Distributed Computing Systems, Jersey City, NJ, July 2024. Program committee, 8th IEEE International Conference on Fog and Edge Computing (ICFEC 2024), Philadelphia, PA, May 2024. Program committee, ACM SEC 2023 Trustworthy Edge Computing Workshop, Wilmington, DE, Dec 2023. Program committee, IEEE ICNP 2023 Workshop on Trust in AI, Services and Networking (TAISEN 2023), Reykjavik, Iceland, Oct 2023. Program committee, The 20th IEEE International Conference on Mobile Ad-Hoc and Smart Systems (MASS 2023), Toronto, Canada, Sept 2023. Program committee, 24th IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks (WoWMoM 2023), Boston, MA, June 2023. Program committee, International Conference on Smart Computing (SMARTCOMP 2023), Nashville, Tennessee, June 2023. Program committee, IEEE/IFIP Network Operations and Management Symposium (NOMS 2023), Miami, FL, May 2023. Program committee, ACM Workshop on Secure and Trustworthy Cyber-Physical Systems (SaT-CPS 2023), Charlotte, NC, April 2023. Program committee, The 2nd ICDM Machine Learning for Cybersecurity (MLC) Workshop, Orlando, Dec 2022. Program committee, 27th IEEE Pacific Rim International Symposium on Dependable Computing (PRDC 2022), Beijing, Nov 2022. Program committee, The 4th International Workshop on Challenges in Artificial Intelligence and Machine Learning for Internet of Things (AIChallengeIoT 2022), Boston, Nov 2022. Program committee, The 19th IEEE International Conference on Mobile Ad-Hoc and Smart Systems (MASS 2022), Denver, Colorado, Oct 2022. Program committee, The 20th International Symposium on Modeling and Optimization in Mobile, Ad hoc, and Wireless Networks (WiOpt2022), Turin, Italy, Sept 2022. Program committee, 2022 IEEE International Conference on Services Computing, Barcelona, Spain, July 2022. Program committee, 3rd International Conference on Cloud, Big Data and IoT (CBIoT 2022), Toronto, Canada, July 2022. Program committee, DSN 2022 Workshop on Dependable and Secure Machine Learning (DSML 2022) Baltimore, June 2022. Program committee, IEEE ICC 2022 Ad Hoc and Sensor Networking (AHSN) Symposium, Seoul, Korea, May 2022. Program committee, 4th International Workshop on Intelligent Systems for the Internet of Things (IsIoT 2022), Marina Del Rey, LA, California, May 2022. Program committee, 26th IEEE Pacific Rim International Symposium on Dependable Computing (PRDC 2021), Perth, Australia (Virtual), Dec 2021. Program committee, The 6th IEEE International Conference on Smart Cloud (IEEE SmartCloud 2021), Newark, NJ (Virtual), Nov 2021. Program committee, The 19th International Symposium on Modeling and Optimization in Mobile, Ad hoc, and Wireless Networks (WiOpt2021), Philadelphia (Virtual), Oct 2021. Program committee, International Workshop on Cyberspace Security and Artificial Intelligence, New York, NY, Oct 2021. Program committee, IEEE ICC 2021 Ad Hoc and Sensor Networking (AHSN) Symposium, Montreal, Canada (Virtual), June 2021. Program committee, IEEE ICC 2020 Ad Hoc and Sensor Networking (AHSN) Symposium, Dublin, Ireland, June 2020. Program committee, CCNC 2020 Workshop on Security and Privacy for Smart and Connected Systems (SPSCS20), Las Vegas, Jan 2020. Program committee, AAAI-20 Workshop on Artificial Intelligence of Things, New York, Feb 2020. Program committee, International Conference on Computing, Networking and Communications (ICNC 2020), Big Island, Hawaii, Feb 2020. Program committee, PerCom 2020 Workshop on Smart Edge Computing and Networking (SmartEdge'20), Austin, Texas, March 2020. Program committee, IEEE 6th World Forum on Internet of Things, New Orleans, April 2020. Program committee, 20th IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing (CCGrid 2020), Melbourne, Australia, May 2020. Program committee, DCOSS 2020 Workshop on Wireless Sensors and Drones in Internet of Things (Wi-DroIT 2020), Los Angeles, May 2020. Program committee, IEEE Globecom 2019 Adhoc and Sensor Networks Symposium, Hawaii, USA, Dec 2019. Program committee, The 6th International Conference on Internet of Vehicles, Kaohsiung, Taiwan, Dec. 2019. Program committee, Model-Based Design of Cyber Physical Systems (CyPhy'19), New York, Oct 2019. Program committee, 2019 IEEE Pacific Rim Conference on Communications, Computers and Signal Processing, Victoria, Canada, August 2019. Program committee, IEEE International Conference on Cyber, Physical and Social Computing (CPSCom 2019), Atlanta, US, July 2019. Program committee, IEEE ICC 2019 Ad Hoc and Sensor Networking (AHSN) Symposium, Shanghai, China, May 2019. Program committee, 14th IEEE International Symposium on Autonomous Decentralized Systems, Utrecht, Netherlands, April 2019. Program committee, The 3rd Workshop on Advances in IoT Architecture and Systems, Phoenix, AZ, June 2019. Program committee, The 17th IEEE International Conference on Embedded and Ubiquitous Computing (IEEE EUC 2019), New York, NY, July 2019. Program committee, IEEE Globecom 2018 Adhoc and Sensor Networks Symposium, Abu Dhabi, UAE, Dec 2018. Program committee, The Third International Workshop on Security, Privacy, and Trustworthiness in Medical Cyber-Physical Systems, Washington DC, USA, Sept 2018. Program committee, 1st International Workshop on Security and Privacy for the Internet-of-Things (IoTSec), Orlando, USA, April 2018. Program committee, IEEE International Conference on Cyber, Physical and Social Computing (CPSCom 2018), Halifax, Canada, July 2018. Program committee, IEEE ICC 2018 Ad Hoc and Sensor Networking (AHSN) Symposium, Kansas City, MO, USA, May 2018. Program committee, 23rd IEEE Pacific Rim International Symposium on Dependable Computing (PRDC 2018), Taipei, Taiwan, Dec 2018. Program committee, IEEE Globecom 2017 Adhoc and Sensor Networks Symposium, Singapore, Dec. 2017. Program committee, IEEE Symposium on Machine Learning and Metaheuristics Techniques and Applications for Dependable Distributed Systems (MADS'17), Orlando, Florida, November 2017. Program committee, 26th IEEE International Conference on Computer Communication and Networks (ICCCN 2017), Vancouver, Canada, July 2017. Program committee, IEEE ICC 2017 Ad Hoc and Sensor Networking (AHSN) Symposium, Paris, France, May 2017. Program committee, 13th International Wireless Communications and Mobile Computing Conference (IWCMC 2017) Valencia, Spain, June 2017. Program Co-Chair, IEEE 2017 ISADS Workshop on Agile Decentralized Resilient Operation of Internet of Things Systems, Bangkok, Thailand, March 2017. Program committee, 13th IEEE International Symposium on Autonomous Decentralized Systems, Bangkok, T",
  "content_length": 66807,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:14"
}