{
  "name": "Ingo J. Timm",
  "homepage": "https://www.uni-trier.de/index.php?id=35358",
  "status": "success",
  "content": "Prof. Dr. Ingo J. Timm | Universität Trier Ingo Timm ist ein international ausgewiesener KI-Forscher und Wirtschaftsinformatiker mit Forschungsschwerpunkt auf Theorie, Methoden und Anwendungen der (Verteilten) Künstlichen Intelligenz und der Simulation. In seiner Arbeitsgruppe stellen die (agentenbasierte) Sozialsimulation sowie Simulationsmethodik an sich zentrale Forschungsgegen­stände dar, die insbesondere im Kontext interdisziplinärer Diskurse untersucht werden (Medien,- und Sozialwissenschaften, Anthro­pologie, Logistik). FunktionenMitglied des Zukunftsforums Öffentliche Sicherheit e.V. (ZOES)Mitglied der Ethikkommission des Senats der Universität Trier1/2018 - 1/2024: Sprecher des Fachbereichs Künstliche Intelligenz der Gesellschaft für Informatik e.V. (FBKI, gemeinsam mit PD. Dr. Matthias Klusch, DFKI Saarbrücken).10/2014 - 6/2023: Vorsitzender des Prüfungsausschusses WirtschaftsinformatikMitglied des Zentrums für Gesundheitsökonomie (ZfG)Sprecher der Fachgruppe „Verteilte Künstliche Intelligenz“ der Gesellschaft für Informatik e.V.Short-CVSeit 2016 Sprecher des Center for Informatics Research and Technology (CIRT), Universität Trier2015 Ruf auf eine Professur (W3) für Logistik von der Exzellenz-Universität Bremen, abgelehnt.Ab WiSe 2010/11: Professor (W3) für Wirtschaftsinformatik I (Nachfolge Professor Dr. Czap) an der Universität Trier2008 – 2009: Stellv. Geschäftsführender Direktor des Instituts für Informatik an der Goethe-Universität Frankfurt am Main2007 – 2008: Geschäftsführender Direktor des Instituts für Informatik an der Goethe-Universität Frankfurt am Main2006 – 2010: Professor (W2) für Wirtschaftsinformatik und Simulation an der Goethe-Universität Frankfurt am Main2006: Habilitation (Thema: „Strategic Management of Autonomous Software Systems“) und Verleihung der venia legendi („Informatik“), Universität Bremen2006: Geschäftsführer des Bereichs Intelligente Systeme im Technologie-Zentrum Informatik der Universität Bremen2003 – 2006: Wissenschaftlicher Mitarbeiter (senior researcher), Universität Bremen2004: Promotion zum Dr.-Ing. (summa cum laude, Thema: „Dynamisches Konfliktmanagement als Verhaltenssteuerung Intelligenter Agenten“), Universität Bremen2002 – 2003: Wissenschaftlicher Mitarbeiter (senior researcher), Technische Universität Ilmenau1999 – 2000: Visiting Researcher, Indiana University-Purdue University at Indianapolis1998 – 2002: Stipendiat und Wissenschaftlicher Mitarbeiter, Universität Bremen1997: Diplom in Informatik (Thema: „Automatische Generierung von Risikoklassifikation in der Intensivmedizin“), Universität BremenSprechstunde:Im Sommersemester finden unregelmäßig Sprechstundentermine per Zoom statt. Anmeldung bitte über das Sekretariat Wirtschaftsinformatik, Silke Kruft, Tel. 3875, oder an kruftuni-trierde. [DIGITAL] Digitale Geschäftsprozesse und Entscheidungen (V) Montag 10:00 - 12:00, [DIGITAL] Digitale Geschäftsprozesse und Entscheidungen (Ü) Donnerstag 08:00 - 10:00, Kolloquien Wirtschaftsinformatik nach Vereinbarung (R) Mittwoch 13:00 - 18:00, H 321 (Informatik) Mittwoch 08:00 - 13:00, H 321 (Informatik) Forschungspraktikum - Wirtschaftsinformatik (P) Mittwoch 10:00 - 13:00, H 321 (Informatik) GRAS - Graduierendenseminar der Wirtschaftsinformatik I (O) Mittwoch 10:00 - 13:00, Grundlagen der Künstlichen Intelligenz (V) Dienstag 16:00 - 18:00, HS 13 Methodik der Wirtschaftsinformatik I (K) Donnerstag 12:00 - 14:00, HZ 202 Donnerstag 12:00 - 14:00, HZ 203 Planung und Konfiguration (V) Montag 10:00 - 12:00, H 321 (Informatik) Praktikum Künstliche Intelligenz (P) Dienstag 08:00 - 10:00, H423",
  "content_length": 3597,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:14"
}