{
  "name": "Ingo Steinwart",
  "homepage": "https://www.isa.uni-stuttgart.de/institut/team/Steinwart-00002",
  "status": "success",
  "content": "Univ.-Prof. Dr. rer. nat. Ingo Steinwart | Institut für Stochastik und Anwendungen | Universität Stuttgart zum Inhalt springen zum Footer springen zurück Navigation schließen Für die volle Funktionalität dieser Site ist JavaScript notwendig. Hier finden Sie eine Anleitung zum Aktivieren von JavaScript in Ihrem Browser. Ingo Steinwart Univ.-Prof. Dr. rer. nat. Professor, InstitutsleitungInstitut für Stochastik und AnwendungenLehrstuhl für Stochastik Kontakt +49 711 685 65388 E-Mail Website Pfaffenwaldring 57 70569 Stuttgart Deutschland Raum: 8.544 Sprechstunde Nach Vereinbarung via E-Mail Fachgebiet Statistische Lerntheorie Kernbasierte Lernverfahren Cluster Analyse Neuronale Netze Effiziente Lernverfahren für große Datenmengen Verlustfunktionen Lernen mit nicht .i.i.d. Daten Anwendungen von Lernverfahren Reproduzierende Kern-Hilberträume Kurzbeschreibungen zu diesen Themen und unseren entsprechenden Publikationen finden Sie hier. Lebenslauf Education 02/2000 Doctorate (Dr. rer. nat.) in Mathematics, Friedrich-Schiller-University, Jena 03/1997 Diploma in Mathematics, Carl-von-Ossietzky University, Oldenburg Appointments 07/2017 — Faculty Member, International Max Planck Research School for Intelligent Systems, Stuttgart/Tübingen 04/2010 — Full Professor, Institute for Stochastics and Applications, Department of Mathematics, University of Stuttgart 01/2010 — 06/2011 Associate Adjunct Professor, Jack Baskin School of Engineering, Department of Computer Science, University of California, Santa Cruz 07/2008 — 04/2010 Scientist Level 4, CCS-3, Los Alamos National Laboratory 03/2003 — 04/2010 Technical Staff Member, CCS-3, Los Alamos National Laboratory 03/2002 — 09/2002 Visiting Scientist, Johannes-Gutenberg University, Mainz 03/2000 — 03/2003 Scientific Staff Member, Friedrich-Schiller-University, Jena 04/1997 — 02/2000 Stipendiary, DFG graduate college “Analytic and Stochastic Structures and Systems”, Friedrich-Schiller-University, Jena Administrative Services 10/2010 — Member of the Senate Committee for Organisation, University Stuttgart 04/2011 — 10/2012 Vice Dean for Mathematics, Faculty of Mathematics and Physics, University of Stuttgart Editorial Services 01/2013 — Associate Editor, Journal of Complexity 12/2008 — Action Editor (Associate Editor), Journal of Machine Learning Research 01/2010 — 12/2012 Associate Editor, Annals of Statistics Program Responsibilities at Conferences Chair COLT 2013 Program Committee NIPS 2008, 2011 Program Committee ICML 2020 Program Committee ICLR 2020 Program Committee COLT 2006, 2008, 2009, 2011, 2012, 2015 Artikel, Preprints, etc Book I. Steinwart and A. Christmann, Support Vector Machines. New York: Springer, 2008. [ final ] Preprints T. Hamm and I. Steinwart, Adaptive learning rates for support vector machines working on data with low intrinsic dimension, tech. rep., Fakultät für Mathematik und Physik, Universität Stuttgart, 2020. [ preprint.pdf ] D. Holzmüller and I. Steinwart, Training two-layer ReLU networks with gradient descent is inconsistent, tech. rep., Fakultät für Mathematik und Physik, Universität Stuttgart, 2020. [ preprint.pdf ] I. Steinwart, Reproducing kernel Hilbert spaces cannot contain all continuous functions on a compact metric space, tech. rep., Fakultät für Mathematik und Physik, Universität Stuttgart, 2020. [ preprint.pdf ] I. Blaschzyk and I. Steinwart, Improved classification rates for localized SVMs, tech. rep., Fakultät für Mathematik und Physik, Universität Stuttgart, 2019. [ preprint.pdf ] N. Mücke and I. Steinwart, Global minima of DNNs: The plenty pantry, tech. rep., Fakultät für Mathematik und Physik, Universität Stuttgart, 2019. [ preprint.pdf ] I. Steinwart, A sober look at neural network initializations, tech. rep., Fakultät für Mathematik und Physik, Universität Stuttgart, 2019. [ preprint.pdf ] H. Hang and I. Steinwart, Optimal learning with anisotropic Gaussian SVMs, tech. rep., Fakultät für Mathematik und Physik, Universität Stuttgart, 2018. [ preprint.pdf ] I. Steinwart, B. Sriperumbudur, and P. Thomann, Adaptive clustering using kernel density estimators, tech. rep., Fakultät für Mathematik und Physik, Universität Stuttgart, 2017. [ preprint.pdf ] I. Steinwart and P. Thomann, liquidSVM: A fast and versatile SVM package, tech. rep., Fakultät für Mathematik und Physik, Universität Stuttgart, 2017. [ preprint.pdf ] I. Steinwart, P. Thomann, and N. Schmid, Learning with hierarchical Gaussian kernels, tech. rep., Fakultät für Mathematik und Physik, Universität Stuttgart, 2016. [ preprint.pdf ] Accepted I. Steinwart and S. Fischer, A closer look at covering number bounds for Gaussian kernels, J. Complexity, vol. ---, pp. ---, 2020. [ final | preprint.pdf ] I. Steinwart and J. Ziegel, Strictly proper kernel scores and characteristic kernels on compact spaces, Appl. Comput. Harmon. Anal., vol. ---, pp. ---, 2019. [ final | preprint.pdf ] 2020 S. Fischer and I. Steinwart, Sobolev norm learning rates for regularized least-squares algorithm, J. Mach. Learn. Res., no. 205, pp. 1--38, 2020. [ final | preprint.pdf ] 2019 A. Defant, M. Mastylo, E. Sánchez-Pérez, and I. Steinwart, Translation invariant maps on function spaces over locally compact groups, J. Math. Anal. Appl., vol. 470, pp. 795--820, 2019. [ final ] M. Farooq and I. Steinwart, Learning rates for kernel-based expectile regression, Mach. Learn., vol. 108, pp. 203--227, 2019. [ final | preprint.pdf ] I. Steinwart, Convergence types and rates in generic Karhunen-Loève expansions with applications to sample path properties, Potential Anal., vol. 51, pp. 361--395, 2019. [ final | preprint.pdf ] 2018 H. Hang, I. Steinwart, Y. Feng, and J. Suykens, Kernel density estimation for dynamical systems, J. Mach. Learn. Res., vol. 19, pp. 1--49, 2018. [ final ] I. Blaschzyk and I. Steinwart, Improved classification rates under refined margin conditions, Electron. J. Stat., vol. 12, pp. 793--823, 2018. [ final | preprint.pdf ] 2017 P. Thomann, I. Steinwart, I. Blaschzyk, and M. Meister, Spatial decompositions for large scale SVMs, in Proceedings of Machine Learning Research Volume 54: Proceedings of the 20th International Conference on Artificial Intelligence and Statistics 2017 (A. Singh and J. Zhu, eds.), pp. 1329--1337, 2017. [ final ] M. Farooq and I. Steinwart, An SVM-like approach for expectile regression, Comput. Statist. Data Anal., vol. 109, pp. 159--181, 2017. [ final | preprint.pdf ] H. Hang and I. Steinwart, A Bernstein-type inequality for some mixing processes and dynamical systems with an application to learning, Ann. Statist., vol. 45, pp. 708--743, 2017. [ final | preprint.pdf ] I. Steinwart, A short note on the comparison of interpolation widths, entropy numbers, and Kolmogorov widths, J. Approx. Theory, vol. 215, pp. 13--27, 2017. [ final | preprint.pdf ] I. Steinwart, Representation of quasi-monotone functionals by families of separating hyperplanes, Math. Nachr., vol. 290, pp. 1859--1883, 2017. [ final | preprint.pdf ] 2016 H. Hang, Y. Feng, I. Steinwart, and J. Suykens, Learning theory estimates with observations from general stationary stochastic processes, Neural Computation, vol. 28, pp. 2853--2889, 2016. [ final | preprint.pdf ] M. Meister and I. Steinwart, Optimal learning rates for localized SVMs, J. Mach. Learn. Res., vol. 17, pp. 1--44, 2016. [ final ] 2015 I. Steinwart, Measuring the capacity of sets of functions in the analysis of ERM, in Festschrift in Honor of Alexey Chervonenkis (A. Gammerman and V. Vovk, eds.), ch. 16, pp. 223--239, Berlin: Springer, 2015. [ final ] I. Steinwart, Fully adaptive density-based clustering, Ann. Statist., vol. 43, pp. 2132--2167, 2015. [ final | preprint.pdf ] P. Thomann, I. Steinwart, and N. Schmid, Towards an axiomatic approach to hierarchical clustering of measures, J. Mach. Learn. Res., vol. 16, pp. 1949--2002, 2015. [ final ] 2014 I. Steinwart, C. Pasin, R. Williamson, and S. Zhang, Elicitation and identification of properties, in JMLR Workshop and Conference Proceedings Volume 35: Proceedings of the 27th Conference on Learning Theory 2014 (M. F. Balcan and C. Szepesvari, eds.), pp. 482--526, 2014. [ final ] H. Hang and I. Steinwart, Fast learning from α-mixing observations, J. Multivariate Anal., vol. 127, pp. 184--199, 2014. [ final ] 2013 I. Steinwart, Some remarks on the statistical analysis of SVMs and related methods, in Empirical Inference -- Festschrift in Honor of Vladimir N. Vapnik (B. Schölkopf, Z. Luo, and V. Vovk, eds.), ch. 4, pp. 25--36, Berlin: Springer, 2013. [ final ] M. Eberts and I. Steinwart, Optimal regression rates for SVMs using Gaussian kernels, Electron. J. Stat., vol. 7, pp. 1--42, 2013. [ final ] 2012 B. Sriperumbudur and I. Steinwart, Consistency and rates for clustering with DBSCAN, in JMLR Workshop and Conference Proceedings Volume 22: Proceedings of the 15th International Conference on Artificial Intelligence and Statistics 2012 (N. Lawrence and M. Girolami, eds.), pp. 1090--1098, 2012. [ final ] I. Steinwart and C. Scovel, Mercer's theorem on general domains: on the interaction between measures, kernels, and RKHSs, Constr. Approx., vol. 35, pp. 363--417, 2012. [ final ] 2011 M. Eberts and I. Steinwart, Optimal learning rates for least squares SVMs using Gaussian kernels, in Advances in Neural Information Processing Systems 24 (J. Shawe-Taylor, R. Zemel, P. Bartlett, F. Pereira, and K. Weinberger, eds.), pp. 1539--1547, 2011. [ final ] I. Steinwart, Adaptive density level set clustering, in JMLR Workshop and Conference Proceedings Volume 19: Proceedings of the 24th Conference on Learning Theory 2011 (S. Kakade and U. von Luxburg, eds.), pp. 703--738, 2011. [ final ] I. Steinwart and A. Christmann, Estimating conditional quantiles with the help of the pinball loss, Bernoulli, vol. 17, pp. 211--225, 2011. [ final ] I. Steinwart, D. Hush, and C. Scovel, Training SVMs without offset, J. Mach. Learn. Res., vol. 12, pp. 141--202, 2011. [ final ] 2010 A. Christmann and I. Steinwart, Universal kernels on no",
  "content_length": 19786,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:18"
}