{
  "name": "Ingolf H. Krüger",
  "homepage": "http://jacobsschool.ucsd.edu/faculty/faculty_bios/index.sfe?fmp_recid=199",
  "status": "success",
  "content": "Faculty Profiles | Jacobs School of Engineering Skip to main content Faculty Profiles Back to Faculty Profiles Ingolf Krueger Associate Adjunct Professor, CSE Service-oriented software and systems engineering, programming methodology, and the design, implementation, and verification of distributed, reactive systems. Professor Krueger is an expert on service-oriented software architectures, and software & systems engineering for distributed, reactive systems. His current research interests include: graphical description techniques for structure and behavior; component-oriented development methods and technologies; development processes; system verification and validation; and formal methods.Krueger is the co-holder of a U.S. patent granted in June 2002 for \"automatically generating a program.\" He developed a method, an apparatus and a computer program for automatically generating program from information about the cooperation/interaction of individual components. One example: the interaction of components required to establish the locking or unlocking of a central locking system in a car; by means of Krueger's method, one could then automatically generate programs for the components executing these tasks. The technology has other applications in the area of telecommunication protocols, as well as in user interface design and database queries. The invention facilitates the process of program development since the costly, manual development of a state-based program from the specification of a system is automated at least to a substantial degree. Capsule Bio: Ingolf Krueger arrived at UCSD in 2001 as an Assistant Research Scientist with the California Institute for Telecommunications and Information Technology. He received his Ph.D. in 2000 from the Technical University of Munich (Germany), and his M.A. from the University of Texas, Austin in 1996. Before joining UCSD, Krueger was a postdoctoral researcher in Professor Manfred Broy's Software & Systems Engineering group at the Department of Informatics within the Technical University of Munich. He has consulted with several companies, including BMW and Siemens, and holds two patents. In Spring 2002, Krueger taught CSE 290, a course on Fundamental Issues in Software Architectures. Update your profile Email:ikrueger@ucsd.edu Institute Affiliations: California Institute for Telecommunications and Information Technology",
  "content_length": 2404,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:18"
}