{
  "name": "Ingo Scholtes",
  "homepage": "https://www.informatik.uni-wuerzburg.de/ml4nets/team/prof-dr-ingo-scholtes",
  "status": "success",
  "content": "Prof. Dr. Ingo Scholtes - Machine Learning for Complex Networks Intern Animation stoppen Machine Learning for Complex Networks Prof. Dr. Ingo Scholtes Head of Chair Machine Learning for Complex Networks Emil-Fischer-Strasse 50 D-97074 Würzburg Germany Gebäude: 50 Raum: 03.030 Telefon: +49 931 31-89290 E-Mail: ingo.scholtes@uni-wuerzburg.de I am heading the CAIDAS-Chair of Computer Science - Machine Learning for Complex Networks at the Center for Artificial Intelligence and Data Science of Julius-Maximilians-Universität Würzburg. Our research addresses open questions at the intersection between network science, (deep) graph learning, and computational social science. I have experience in the application of network science and machine learning to address questions in information systems, software engineering, ecology, biology, and physics. A summary of our foundational works on higher-order graph models was published in Nature Physics. In 2014 I was awarded a Juniorfellowship from the German Informatics Society. In 2018 I was awarded an SNSF Professorship with a volume of CHF 1.5 Mio from the Swiss National Science Foundation. I am founding co-chair of the Computational Social Science Section of the German Informatics Society (GI e.V.) and associate editor of EPJ Data Science and Advances in Complex Systems. In my free time, I enjoy mountain hiking, cycling and canoeing. I am also a passionate landscape photographer and astrophotographer. since 08/2021: Chair of Machine Learning for Complex Networks (W3) at Julius-Maximilians-Universität Würzburg 07/2019 - 08/2021: Chair of Data Analytics (W3) at Bergische Universität Wuppertal 08/2018 - 07/2024: SNF Professor for Data Analytics at University of Zurich, Switzerland 04/2016 - 08/2016: Temporary Professor (Vertretungsprofessor) for Applied Informatics at Karlsruher Institut für Technologie (KIT) 09/2011 - 07/2018: Postdoc and Lecturer at Chair of Systems Design, ETH Zürich, Switzerland 07/2011: Visiting Researcher at Eötvös-Lorand University Budapest, Hungary 2011: Dr. rer. nat. (summa cum lauda) in Computer Science from University of Trier 2004: Summer student in ATLAS Trigger and Data Acquisition Group, CERN 2005: Diploma in Computer Science (Minor in Mathematics) at University of Trier Workshops, Symposium & Conference Organization Co-Organizer of CAIDAS Workshop Data Analysis for the Digital Humanities, February 6 - 8 2023, Würzburg, Germany Organizer of LoG Local Meetup Würzburg, December 21 2022, Würzburg, Germany Co-Organizer of Dagstuhl seminar Higher-Order Graph Models: From Theoretical Foundations to Machine Learning, August 29 - September 1st 2021, Dagstuhl, Germany Co-Chair of Workshop on Higher-Order Models in Network Science, July 2020, Rome, Italy Chair of Symposium Computational Social Science - Quo Vadis?, April 26, 2019, Zurich, Switzerland Program Co-Chair of Data Science Track at Informatik 2019, September 23-26, 2019, Kassel, Germany Co-Chair of Workshop on Higher-Order Models in Network Science, May 28, 2019, Burlington, Vermont, USA Co-Chair of Workshop on Higher-Order Models in Network Science, June 11-12, 2018, Paris, France Co-Chair of Workshop on Self-Adaptive and Self-Organising Socio-Technical Systems (SASOST 2017), September 22, 2017, Tucson, AZ, USA Co-Chair of Workshop on Higher-Order Models in Network Science, June 20, 2017, Indianapolis, IN, USA Co-Chair of Workshop Informatik Begeisterung held at Informatik 2016, September 26, 2016, Klagenfurt, Austria Doctoral Symposium Co-Chair of 10th IEEE International Conference on Self-Adaptation and Self-Organizing Systems (SASO 2016), September 15, 2016, Augsburg, Germany Co-Chair of Workshop on Higher-Order Models in Network Science, May 30, 2016, Seoul, Korea Co-Chair of Workshop on Higher-Order Models in Network Science, June 2, 2015, Zaragoza, Spain Co-Chair of Workshop on Self-Optimisation in organic and autonomic computing systems (SAOS'15), March 24-27, 2015, Porto, Portugal Co-Chair of Workshop on Social Influence held at 6th International Conference on Social Informatics (SocInfo 2014), November 10, 2014, Barcelona, Spain Co-Chair of Workshop on Dynamics on and of Complex Networks VII held at European Conference on Complex Systems (ECCS 2014), September, 2014, Lucca, Italy Co-Chair of Workshop on Higher-Order Models in Network Science, June 3, 2014, Berkeley, CA, USA Co-Chair of Workshop on Self-optimisation in organic and autonomic computing systems (SAOS'14), February 25 - 28, 2014, Lübeck, Germany Co-Chair of Workshop on Dynamics on and of Complex Networks VI held at European Conference on Complex Systems (ECCS 2013), September, 2013, Barcelona, Spain Co-Chair of Workshop on Sozioinformatik held at GI-Jahrestagung Informatik 2013, September 14, 2013, Koblenz, Germany Co-Chair of Workshop on Self-Adaptation and Self-Organization in Socio-Technical Systems (SASO^ST 2013) held at IEEE SASO 2013, September 9, 2013, Philadelphia, PA, USA Workshop Co-Chair of the 7th IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO 2013), September 9-13, 2013, Philadelphia, PA, USA Sponsoring Co-Chair of the 7th IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO 2013), September 9-13, 2013, Philadelphia, PA, USA Co-Chair of Workshop on Self-optimisation in organic and autonomic computing systems (SAOS'13), February 20, 2013, Prague, Czech Republic Program Co-Chair of 6th IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO 2012), September 10-14, 2012, Lyon, France Co-Chair of Workshop on Complex Sciences in the Engineering of Computer Systems (CSECS 2012), February 28, 2012, Munich, Germany Co-Chair of Workshop on SocioAware Networked Computing Systems (SocioAware 2011), October 3, 2011, Ann Arbor, MI, USA Society Memberships Member of the Schweizer Informatik Gesellschaft (SI) (since 2018) Member of the Deutsche Physikalische Gesellschaft (DPG) (since 2018) Member of the Konrad Zuse Gesellschaft (since 2013) Member of the Gesellschaft für Informatik (GI) (since 2001) PhD Committee Memberships & PhD Thesis Reviews ETH Zurich, Switzerland (2021) Ludwig-Maximilians-Universität München, Germany (2021) Northeastern University, USA (2020) IMT School for Advanced Studies, Lucca, Italy (2019) University of Luxembourg (2018) External Reviewer for Professoral Hiring Commissions HTW Saar (2021) FernUniversität in Hagen (2020) RWTH Aachen (2019) Committee & Board Memberships Vice-Director of the Interdisciplinary Center for Machine Learning and Data Analytics (IZMD) (since 2020) Elected Member of the Presiding Committee of the Gesellschaft für Informatik (GI) (2017 - 2020) Ambassador of the Gesellschaft für Informatik (GI) at University of Zurich (since 2018) Member of the Data Science Task Force of the Gesellschaft für Informatik (GI) (since 2017) Founding Chair of the Computational Social Science Working Group at the Gesellschaft für Informatik (GI) (since 2016) Member of the Scientific Advisory Board of swiss innovation valley ag (2016 - 2019) Elected member of the Steering Committee of the IEEE International Conference on Self-Adaptive and Self-Organizing Systems (IEEE SASO) (2014 - 2018) Chair of the Juniorfellows at Gesellschaft für Informatik (GI e.V.) (2015-2016) Management Committee Member of EU COST Action TD1210 KNOWeSCAPE: Analyzing the dynamics of information and knowledge landscapes (2014 - 2016) Member of the Steering Committee (Leitungsgremium) of the GI section (Fachgruppe) Organic Computing (2013 - 2016) Editorial Activities Editor of EPJ Data Science (since 2018) Guest editor of Social Network Analysis and Mining Guest editor of Topical Issue in Advances in Complex Systems: Structure and Dynamics of Collaborative Software Engineering: A Complex Networks Perspective Co-editor of book Social Informatics - The Social Impact of Interactions between Humans and IT, Springer Proceedings in Complexity Reviewer for Funding Agencies Evaluator for the Royal Society of New Zealand (Te Aparangi) Evaluator for the National Research, Development and Innovation Fund, Hungary Evaluator for the Research Council of the Universitë catholique de Louvain, Belgium Evaluator for the Polish National Science Centre, Poland Evaluator for the Israel Science Foundation (ISF), Israel Reviewer for Journals PNAS Nature Physics Nature Machine Intelligence Science Advances Nature Communications Physical Review X Physical Review E Physical Review Letters EPJ Data Science Data Mining and Knowledge Discovery PlosONE Algorithms Palgrave Communications ACM Computing Surveys IEEE Software IEEE Technology and Society IEEE Transactions on Software Engineering Journal of Informetrics Scientometrics Network Science Journal of Complex Networks Physica A: Statistical Mechanics and its Applications Journal of Software: Evolution and Process Journal of Systems and Software Future Internet Concurrency and Computation: Practice and Experience IEEE Transactions on Cybernetics Special Issue in Journal of Internet Services and Applications: Software Engineering from a Social Network Perspective Special Issue in Mind & Society: Complexity Modeling in Social Science and Economics ACM Transactions on Autonomous and Adaptive Systems (ACM TAAS) Advances in Complex Systems (ACS) European Physics Journal B Physica A: Statistical Mechanics and its Applications Modern Physics Letters B: Condensed Matter Physics; Statistical Physics and Applied Physics Reviewer for Conferences and Workshops The 20th Workshop on Machine Learning in Graphs (MLG) at ECML-PKDD, September 22 2023, Torino, Italy The 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2023), Long Beach, CA, USA The 32nd ACM Web Conference 2023 (WWW 2023), Austin, TX, USA Learning on Graphs Conference (LOG 2022), Virtual Event 30th International Symposium on Graph Drawing and Network Visualization (GD 2022), Tokyo, Japan 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining",
  "content_length": 47659,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:17"
}