{
  "name": "Ingrid Zukerman",
  "homepage": "https://research.monash.edu/en/persons/ingrid-zukerman",
  "status": "success",
  "content": "Ingrid Zukerman - Monash University Ingrid Zukerman public CV View Scopus Profile Ingrid Zukerman Professor Professor, Department of Data Science & AI https://orcid.org/0000-0003-2237-5017 EmailIngrid.Zukermanmonashedu 1986 …2025 Research activity per year Personal profile BiographyIngrid works in the Faculty of Information Technology at Monash University as a Professor.Research interests Natural language processing Discourse planning Spoken language understanding User modeling Plan recognition Monash teaching commitmentProfessor Ingrid Zukerman has experience as the Chief Examiner for the following units in the Faculty of IT: FIT3080 Intelligent systems FIT4009 Advanced topics in intelligent systems FIT5047 Intelligent systems FIT9005 Computer architecture and networks Ingrid has experience as the Lecturer for the following units in the Faculty of IT: FIT3036 Computer science project FIT3080 Intelligent systems FIT4009 Advanced topics in intelligent systems FIT5047 Intelligent systems FIT9005 Computer architecture and networks Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, Doctor of Philosophy, University of California Los AngelesAward Date: 20 Jun 1986Operations Research, Master of Science, Technion - Israel Institute of TechnologyAward Date: 23 Sept 1979Industrial Engineering and Management, Bachelor of Science, Technion - Israel Institute of TechnologyAward Date: 16 Jun 1976 Research area keywordsArtificial intelligenceDiscourse PlanningMulti-Media InterfacesNatural Language ProcessingPlan recognitionUser Modelling Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2002 2002 2003 2007 2008 2009 2010 2011 2012 2013 2014 2016 2017 2018 2019 2020 2023 2027 1 Active 19 Finished Projects per year Accessible Data Exploration and Analysis for Blind PeopleMarriott, K. (Primary Chief Investigator (PCI)), Butler, M. (Chief Investigator (CI)), Zukerman, I. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)) & Lee, B. (Partner Investigator (PI))ARC - Australian Research Council28/02/23 → 27/02/27Project: Research CSIRO Next Generation Graduate Program: Enhancing General Practitioner Decision-Making in Antidepressant Prescriptions: A Data-Driven ApproachMcNaney, R. (Primary Chief Investigator (PCI)), Olivier, P. (Chief Investigator (CI)), Zukerman, I. (Supervisor), Pierce, C. (Supervisor) & Duong, T. H. H. (Chief Investigator (CI))24/07/23 → 24/05/24Project: Research Improving human reasoning with causal Bayes networks: a multimodal approachNicholson, A. (Primary Chief Investigator (PCI)), Wybrow, M. (Chief Investigator (CI)), Zukerman, I. (Chief Investigator (CI)), Lagnado, D. (Chief Investigator (CI)) & Hahn, U. (Chief Investigator (CI))1/12/20 → 2/12/24Project: Research Explaining the outcomes of complex modelsZukerman, I. (Primary Chief Investigator (PCI)), Haffari, R. (Chief Investigator (CI)) & Reiter, E. (Partner Investigator (PI))1/07/19 → 31/10/22Project: Research Explaining the outcomes of complex computational models (Explainable AI)Situ, X. (Primary Chief Investigator (PCI)), Zukerman, I. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Paris, C. (Chief Investigator (CI)) & Xu, C. (Chief Investigator (CI))1/07/18 → 18/03/22Project: Research View all 20 projects Research output Research output per year 1986 1997 1998 1999 2001 2004 2005 2006 2007 2008 2009 2010 2011 2013 2014 2017 2025 140 Conference Paper 35 Article 5 Commissioned Report 3 Chapter (Book) 8 More 3 Other 2 Edited Book 2 Paper 1 Letter Research output per year Research output per year Modeling and Detecting Urinary Anomalies in Seniors from Data Obtained by Unintrusive SensorsGe, Y., Salehi, M., Vered, M. & Zukerman, I., 2025, Machine Learning and Principles and Practice of Knowledge Discovery in Databases - International Workshops of ECML PKDD 2023 Turin, Italy, September 18–22, 2023 Revised Selected Papers, Part IV. Meo, R. & Silvestri, F. (eds.). Cham Switzerland: Springer, p. 336-344 9 p. (Communications in Computer and Information Science; vol. 2136).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review When Refreshable Tactile Displays Meet Conversational Agents: Investigating Accessible Data Presentation and Analysis with Touch and SpeechReinders, S., Butler, M., Zukerman, I., Lee, B., Qu, L. & Marriott, K., Jan 2025, In: IEEE Transactions on Visualization and Computer Graphics. 31, 1, p. 864-874 11 p.Research output: Contribution to journal › Article › Research › peer-review 7 Citations (Scopus) Communicating Uncertainty in Explanations of the Outcomes of Machine Learning ModelsZukerman, I. & Maruf, S., 2024, INLG 2024, The 17th International Natural Language Generation Conference, Proceedings of the Conference, Proceedings of the Conference. Mahamood, S., Le Minh, N. & Ippolito, D. (eds.). Stroudsburg PA USA: Association for Computational Linguistics (ACL), p. 30-46 17 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 3 Citations (Scopus) Generating Simple, Conservative and Unifying Explanations for Logistic Regression ModelsMaruf, S., Zukerman, I., Situ, X., Paris, C. & Haffari, R., 2024, INLG 2024, The 17th International Natural Language Generation Conference, Proceedings of the Conference, Proceedings of the Conference. Mahamood, S., Le Minh, N. & Ippolito, D. (eds.). Stroudsburg PA USA: Association for Computational Linguistics (ACL), p. 103-120 18 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 1 Citation (Scopus) Going beyond Imagination! Enhancing Multi-modal Dialogue Agents with Synthetic Visual DescriptionsZhan, H., Maruf, S., Zukerman, I. & Haffari, R., 2024, SIGDIAL 2024: 25th Annual Meeting of the Special Interest Group on Discourse and Dialogue. Kawahara, T., Demberg, V., Ultes, S., Inoue, K., Mehri, S., Howcroft, D. & Komatani, K. (eds.). Stroudsburg PA USA: Association for Computational Linguistics (ACL), p. 420-427 8 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access View all 191 research outputs",
  "content_length": 6793,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:21"
}