{
  "name": "Inhwan Lee",
  "homepage": "http://csl.hanyang.ac.kr",
  "status": "success",
  "content": "Beom Heyn (Ben) Kim: Home Beom Heyn (Ben) Kim Department of Computer Science and Engineering Hanyang University Contact: Engineering Building IV 404-2 55 Hanyangdaehak-ro Ansan, Gyeonggi-do 15588 Republic of Korea Phone: (031) 400-1036 Email: beomheynkim@hanyang.ac.kr Recent News Sep 13, 2024: We are hiring one more grad student currently for the next year (either Mar or Sep entrance) Sep 1, 2024: Seok Min Hong and Grace Oluwabunmi Ohiremen joined our group as Masters students. Welcome! Jun 5, 2023: 3-year $139K (186M KRW) grant awarded to CSL from the NRF (Grant no. RS-2023-00244368). Overview I am an Assistant Professor in the Department of Computer Science and Engineering at Hanyang University ERICA campus. I received my B.Sc., M.S., and Ph.D. from the Department of Computer Science at the University of Toronto. I am leading Critical System Lab (CSL) at Hanyang University ERICA. My research interest is in improving security and reliability of critical systems. For example, I worked on detecting malicious behaviors of untrusted system component and offering infrastructural supports to protect end-user's security. Also, I explored finding concurrency bugs occurred in complex distributed systems behind critical systems using formal verification techniques such as execution-based model-checking. I enjoy building novel prototype systems or tools and thoroughly evaluate those via empirical studies. In addition, I like to solve challenging but practical problems. Also, I have been presenting at top conferences and collaborating with top researchers. If you want to work with me, see below for prospective students and open positions Selected Publications Beom Heyn Kim, Taesoo Kim and David Lie. Modulo: Finding Convergence Failure Bugs in Distributed Systems with Divergence Resync Models. In Proceedings of the 2022 Annual Conference on USENIX Annual Technical Conference (ATC), 2022. Beom Heyn Kim and Hyoungshick Kim. Rocky: Replicating Block Devices for Tamper and Failure Resistant Edge-based Virtualized Desktop Infrastructure. In Proceedings of Proceedings of the 37th Annual Computer Security Applications Conference (ACSAC), 2021. Beom Heyn Kim and David Lie. Caelus: Verifying the Consistency of Cloud Services with Battery-Powered Devices. In Proceedings of the 2015 IEEE Symposium on Security and Privacy (Oakland 2015). May 2015. Mohammad Mannan, Beom Heyn Kim, Afshar Ganjali and David Lie. Unicorn: Two-Factor Attestation for Data Security. 18th ACM Conference on Computer and Communications Security (CCS 2011). October 2011. More complete publication list can be found at my Google Scholar Profile here Prospective Students and Open Positions Research stream Masters and PhD students: I am always looking for graduate students who are interested in improving critical systems security and reliability. Required background is solid understanding of operating systems, computer systems, and cybersecurity with practical experience writing and implementing software. If you are interested in joining my group, read my publications first. If you are still interested in joining my group after reading my research papers, write me an email with the following information: (1) Short biography about yourself (2) Your interest and motivation (why do you want to join my group? what do you want to achieve or what is your goal after graduation? what can you provide for the group? what do you want to work on?) (3) C.V. or resume (4) (unofficial/official) transcript with course titles on it; minimum CGPA: 3.75/4.5 or scale it (5)\tsomething demonstrating your technical experience and skills (e.g., github) NOTE: My group does not have an opening for non-research stream graduate students at the moment Undergraduate Students: I am looking for strong undergraduate students who are interested in joining my group as a research stream graduate student in the future. Note that although I am mostly teaching Database classes, my research area is in security and reliability of critical systems. So, first check if your research interest matches mine before contacting me. To join my research group, you should successfully do the followings: (1) Take classes I teach and do those well: Database in the 2nd semester of the 2nd year and Advanced Database in the 1st semester of the 3rd year. (2) Successfully complete a capstone project under my supervision in the 2nd semester of the 3rd year and the 1st semester of the 4th year. (3) Take \"Computer Science Lab Practice.\" in your 3rd or 4th year. (4) Join as a research intern after completing the step (3) during either Winter or Summer vacation Teaching For Fall 2024: CSE3010 (section 1): Database CSE3010 (section 2): Database For Spring 2024: SCS3001: Advanced Database For Fall 2023: CSE3010 (section 2): Database For Spring 2023: SCS3001: Advanced Database AIC6010: Healthcare Information Security For Fall 2022: CSE3010 (section 1): Database CSE3010 (section 2): Database Back to Top ^ layout design by tristar web design",
  "content_length": 5010,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:20"
}