{
  "name": "Inmaculada Arnedillo Sánchez",
  "homepage": "https://www.tcd.ie/research/profiles/?profile=arnedii",
  "status": "success",
  "content": "Inmaculada Arnedillo-Sanchez'Trinity Research - Trinity College Dublin Dr. Inmaculada Arnedillo-Sanchez Associate Professor, Computer Science Associate Professor, Education macu.arnedillo@tcd.ie +353 1896 3661 Biography Inmaculada Arnedillo-Sánchez has lectured in Learning Technologies in Trinity College Dublin since 2002. She is a researcher in the College's Knowledge and Data Engineering Group (KDEG), a member of Committee of the International Association for Mobile Learning (IAmLearn), and of the Steering Committee of the Mobile Learning Special Interest Group of the Kaleidoscope European Network of Excellent. Inmaculada has been involved with the IADIS Mobile Learning conference series since its inauguration and she chairs its 2008 conference. She has organised and chaired the \"Beyond Mobile Learning\" workshop and serves as a member of the programme committee for numerous conferences such as MLearn 2008, the European Conference on Technology Enhanced Learning 2008, Computer Assisted Learning (CAL) 2007, and CELDA 2006 among others. Inmaculada is a UNICEF adviser; recently collaborating with UNICEF's Speak Africa initiative, under the 2006 African Development Forum's auspices in Ethiopia. Inmaculada has led numerous research projects and currently leads the mobileDNA (Digital Narrative Approach), ShareTEC (Sharing Digital Resources in the Teaching Education Community), and Teaching and Research in Ubiquitous Secure Telecommunications Environments (TRUST-E) projects. Inmaculada received the Early Career Provost Teaching Award in 2006 which recognises an outstanding contribution in the pursuit of teaching excellence and in promoting teaching as a scholarly activity. She has coordinated postgraduate academic programs, contributed to the first European Virtual Doctoral School workshop on Mobile Learning and supervises PhD and master students. Inmaculada has published more than 30 papers and book chapters in the last four years. Her latest publication is the co-authored book chapter \"Mobile Learning: Small Devises, Big Issues\" in the Kaleidoscope Legacy book. Inmaculada is the Guest Editor of the IEEE Distributed System Online Journal Themed Issue on Mobile Learning Vol. 8 (6). Inmaculada completed an M.Sc. in Information Technology in Education in Trinity College in 2002 and is currently completing a PhD in the production of multimedia Digital Narratives with mobile technologies. She graduated from the University of Western Sydney, Australia, in Interpreting & Translation (major simultaneous interpreting) and is fluent in Spanish, English, and Italian. Prior to joining Trinity Inmaculada was a language teacher and a freelance interpreter and translator in Spain, Italy and Turkey. Publications and Further Research Outputs Peer-Reviewed Publications Non-Peer-Reviewed Publications Peer-Reviewed Publications Arnedillo-Sánchez, Socorro, Suffo-Abouza, Jose, Carmona-Rodríguez, Miguel, Morilla-Romero-de-la-Osa, Rubén, Arnedillo-Sánchez, Inmaculada, Importance Assigned to Breastfeeding by Spanish Pregnant Women and Associated Factors: A Survey-Based Multivariate Linear Correlation Study, Nutrients, 16, (13), 2024, p2116 Journal Article, 2024 DOI Boyle, Bryan, Arnedillo-Sanchez, Inmaculada, Zahid, Aejaz, Pennisi, Yvonne, The Arabic psychosocial impact of assistive devices scale: Development, translation, and evaluation, Assistive Technology, 2024, p1-8 Journal Article, 2024 DOI Bossavit, Benoit, Arnedillo-Sánchez, Inmaculada, Motion-based technology to support motor skills screening in developing children: A scoping review, Computer Methods and Programs in Biomedicine, 240, 2023, p107715 Journal Article, 2023 DOI Inmaculada Arnedillo-Sánchez, Bryan Boyle, Inmaculada Arnedillo-Sanchez, The Inclusion of Children on the Autism Spectrum in the Design of Learning Technologies: A Small-Scale Exploration of Adults\" Perspectives, Frontiers in Education, 7, 2022 Journal Article, 2022 DOI Arnedillo-Sánchez, Socorro, de la Osa, Rubén Morilla-Romero, Arnedillo-Sánchez, Inmaculada, Unhealthy gestational weight gain: Are we neglecting inadequate gestational weight gain?, Midwifery, 107, 2022, p103277 Journal Article, 2022 DOI Iván Ruiz-Rube; Inmaculada Arnedillo-Sánchez; Antonio Balderas, MISTRuST: accoMmodatIon Short Term Rental Scanning Tool, 16th International Conference on Web Information Systems and Technologies, Online Streaming, 3 - 5 November , edited by Massimo Marchiori; Francisco Domínguez Mayo; Joaquim Filipe , 1, WEBIST, 2020, pp170-177 Conference Paper, 2020 URL DOI Iván Ruiz-Rube; Rubén Baena Pérez; José Miguel Mota; Inmaculada Arnedillo-Sánchez, Model-driven development of augmented reality-based editors for domain specific languages, Interaction Design and Architecture(s) Journal - IxD&A, (45), 2020, p246 - 263 Journal Article, 2020 URL Carlos Alario-Hoyos María Jesús Rodríguez-Triana Maren Scheffel Inmaculada Arnedillo-Sánchez Sebastian Maximilian Dennerlein(ed.), Addressing Global Challenges and Quality Education. 15th European Conference on Technology Enhanced Learning, EC-TEL 2020, Lecture Notes in Computer Science, Heidelberg, Germany, 12315, September 14-18, Springer , 2020, 1- 486 p Proceedings of a Conference, 2020 DOI Designing Digital Activities to Screen Locomotor Skills in Developing Children in, editor(s)Alario-Hoyos C., Rodríguez-Triana M., Scheffel M., Arnedillo-Sánchez I., Dennerlein S. , Addressing Global Challenges and Quality Education. EC-TEL 2020. Lecture Notes in Computer Science, vol 12315, Springer, Cham, 2020, pp416 - 420 , [Bossavit B., Arnedillo-Sánchez I.] Book Chapter, 2020 DOI A Novel Approach to Monitor Loco-Motor Skills in Children: A Pilot Study in, Scheffel M., Broisin J., Pammer-Schindler V., Ioannou A., Schneider J. , Transforming Learning with Meaningful Technologies. EC-TEL 2019. Lecture Notes in Computer Science, vol 11722, Cham, Springer , 2019, pp773-776 , [Bossavit B., Arnedillo-Sánchez I.] Book Chapter, 2019 DOI Arnedillo-Sánchez, I., Isaías, P., Ravesteijn, P., Onega, G.(ed.), Mobile Learning, Utrecht, The Netherlands, 11th - 13th April 20, ternational Association for Development of the Information Society Press, 2019, 3-180 p Proceedings of a Conference, 2019 International Journal of Manpower- Special Issue: Labour market matching processes: skills, learning and measurement in the mobile age, 39, 8, (2018), Inmaculada Arnedillo-Sánchez, Martin Kahanec, Gabor Kismihok, [Editor] Journal, 2018 URL Inmaculada Arnedillo-Sánchez, Carlos De Aldama and Chrysanthi Tseloudi, rESSuME: Employability Skills Social Media SurvEy, International Journal of Manpower, 39, (8), 2018, p1 - 18 Journal Article, 2018 DOI Mota, J., Ruiz-Rubea, I., Doderoa, J., Arnedillo-Sánchez, I. , Augmented reality mobile app development for all, Computers & Electrical Engineering, 65, 2018, p250-260 Journal Article, 2018 DOI ESCORT: Employability Skills COntent cuRation Tool for Social Media Profiles in, editor(s)Lavoué É., Drachsler H., Verbert K., Broisin J., Pérez-Sanagustín M. , Data Driven Approaches in Digital Education. EC-TEL 2017. Lecture Notes in Computer Science, vol 10474., Cham, Springer, 2017, pp528 - 531, [Arnedillo-Sánchez, I., & Tseloudi, C.] Book Chapter, 2017 URL Mapping Employability Attributes onto Facebook: rESSuME: Employability Skills Social Media survEy in, editor(s)Lavoué É., Drachsler H., Verbert K., Broisin J., Pérez-Sanagustín M. , Data Driven Approaches in Digital Education. EC-TEL 2017. Lecture Notes in Computer Science, vol 10474. , Tallinn, Estonia, 2017, pp523 - 527, [Arnedillo-Sánchez, I., de Aldama, C. & Tseloudi, C.] Book Chapter, 2017 URL The application of CSCL scripts to support teaching and learning for children with Intellectual Disabilities in, editor(s)P. Cudd L. de Witte , Harnessing the Power of Technology to Improve Lives, Amsterdam, IOS Press, 2017, pp241 - 248, [Boyle, B., Arnedillo-Sánchez, I.] Book Chapter, 2017 URL Arnedillo-Sánchez, I., Boyle, B., Bossavit, B. , MotorSense: Using motion tracking technology to support the identification and treatment of gross- motor dysfunction, Harnessing the Power of Technology to Improve Lives, Sheffield, 12th -15th September, edited by P. Cudd, L. de Witte , IOS Press, 2017, pp793 - 796 Conference Paper, 2017 URL Gauttier, S., Arnedillo-Sánchez, I., An Invitation to Look at Enhancement in Technology-Enhanced Learning, Re-Imaging Learning Environments - EDEN Annual Conference Proceedings, Budapest, 14th -17th June 2016, edited by António Moreira Teixeira, András Szücs and Ildikó Mázár , European Distance and E-Learning Network, 2016, pp1 - 8 Conference Paper, 2016 Boyle, B., Arnedillo-Sanchez, .I., Zahid, A. , Designing collaborative virtual environments for children on the Autism Spectrum, T4I 2016 - Technology for Independence Communications 2016 , Sheffield, 28th November, The University of Sheffield, 2016, pp1 - 4 Conference Paper, 2016 URL Gauttier, S., Boyle, B., Tseloudi, C., Arnedillo-Sanchez I, Employing Q-method To Investigate Informal Learning In An Undergraduate Game Development Project, 6th Irish Game-Based Learning Conference, Dublin , 1st -2nd September , edited by Mairead Brady, Ann Devitt, Neil Peirce , The University of Dublin , 2016, pp71 - 82 Conference Paper, 2016 Tseloudi, C., Arnedillo-Sánchez, I, Does the Mobility of Mobile Learners across Locations Affect Memory?, Mobile Learning Futures - Sustaining Quality Research and Practice in Mobile Learning, 15th World Conference on Mobile and Contextual Learning, mLearn 2016, Sydney, 24th-26th October , edited by Laurel Evelyn Dyson, Wan Ng & Jennifer Fergusson , The University of Technology, Sydney, 2016, pp261 - 264 Conference Paper, 2016 Exploring the Role of Adults in Participatory Design for Children on the Autism Spectrum in, editor(s)A. Marcus , Design, User Experience, and Usability: Design Thinking and Methods, Switzerland, Lecture Notes in Computer Science, Springer International Publishing , 2016, pp1 - 10, [Boyle, B., Arnedillo-Sánchez, I.] Boo",
  "content_length": 57190,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:30"
}