{
  "name": "Inseok Hwang 0001",
  "homepage": "https://www.inseokhwang.com",
  "status": "success",
  "content": "Inseok Hwang Pages About Me Research Demo Publications Patents Services Activities Personal Short Bio Inseok Hwang (황인석) Associate ProfessorComputer Science and Engineering, POSTECH Adjunct Professor PositionsInstitute for Convergence Research and Education in Advanced Technology, Yonsei UniversityResearch group: Human-centered Intelligent Systems LabContact:i.hwang at postech.ac.kr (school & research)firstname dot lastname at gmail.com (personal)Google Scholar Profile | DBLPCurriculum Vitae 모바일 및 IoT, 인간-컴퓨터 상호작용, 인공지능 응용 분야에 걸쳐 전례없는 컴퓨팅 기회를 탐구하고, 작지만 강력한 새로운 지능형 시스템을 실현하여 우리의 실생활에 녹여내는 연구에 열정을 지닌 학생을 상시 찾고 있습니다. 연구에 관심이 있거나 그 밖에 이야기 하고 싶은 생각이 있는 학생은 언제든 제게 i.hwang at postech.ac.kr 으로 연락주세요. We are looking for highly motivated students who are passionate about exploring first-of-a-kind, smart, little but mighty systems to be interwoven with our real life, in the areas of Mobile  & IoT Computing, Human-Computer Interaction, and Applied AI. If you are interested, or would like to chat about any ideas, please just drop an email to Inseok at i.hwang at postech.ac.kr I am an Associate Professor in the Department of Computer Science and Engineering at POSTECH, where my students and I run together Human-centered Intelligent Systems Lab (HIS Lab) and do exciting premiere things as a team. I also hold an adjunct appointment in the Graduate School of Artificial Intelligence, POSTECH.My research interests broadly lie in the areas of Mobile Computing, HCI, and Applied AI. Specifically, I have been focusing on intelligent & interactive mobile/IoT computing systems embodied in the real-life space. I strive to explore and deepen the unknown potentials of mobile, IoT, and emerging front-end/edge systems as a platform that fosters new classes of human-centered applications permeating and enriching our real-life experiences. My research has been actively opening up new agenda in this highly dynamic, multi-dimensional research space where systems issues and real-life factors collide and evolve together. I am passionate about making novel technical contributions therein, such as the development of new socio-mobile interaction platforms, enablement of advanced services on commodity devices, computational formulations of qualitative human problems, and new system optimizations and breakthroughs under unique application-driven constraints of latency, scalability, energy, laws of physics, and human factors. Every real-world applied system is built on a specific purpose to do good in our real lives. In my research, the main ‘good’ aims at extending and augmenting our social and cognitive abilities beyond the natural-born limits. Despite the abundance of online social interaction tools, real-world interaction constitutes a crucial part of our life; it excels in conveying nuanced cues and catalyzing empathy, and needless to say, it is our universal mode of interaction. However, it is evident that real-world interaction can take place only within certain constraints, in terms of space, time, scale, and cognitive capacity. Upon solid computational foundation and often collaboration with domain experts, my research has explored new interdisciplinary systems to create and boost our socio-physical interactivity in the context of health & well-being, family support, child care, sports & games, and supporting underrepresented social groups. To date, I have been serving on the program committees and/or editorial board of a number of premier academic venues leading my areas of research, including ACM MobiSys, ACM UbiComp/IMWUT, ACM CHI, ACM CSCW, IEEE INFOCOM (including an upper-level membership a.k.a. Area TPC Chair in INFOCOM 2021) and so on. I served on the NSF panel as a panelist to review grant proposals. I am a recipient of the Best Paper Award in ACM CSCW 2014. My systems won multiple Best Demo Awards in ACM MobiSys 2019, MobiSys 2012, and so on. My research has generated 40+ papers at premier venues and 90+ issued U.S. patents so far. Before joining POSTECH in October 2020, I spent 6 years at IBM (2014-2020) as a Research Staff Member at IBM Research - Austin. Before IBM, I was a Research Assistant Professor at the Center for Mobile Software Platform in KAIST, Korea (2013-2014). I received my Ph.D. in Computer Science from KAIST in 2013 under the advisement of Dr. Junehwa Song, and B.S. / M.S. in Electrical Engineering from KAIST. Just a prosperous day at work :-) SELECT AWARDS & HONORS Popular Choice Honorable Mention Award, ACM CHI 2025.Best Paper Award, ACM MobiSys 2024.Honorable Mention Award, ACM CHI 2024.CSE Award 2024, Dept. of CSE, POSTECHPeople's Choice Award for Demos, ACM UbiComp 2023Best Poster Runner-up, ACM HotMobile 2020 Distinguished TPC Member Award, IEEE INFOCOM 2020 IBM Invention Achievement Awards - 21st Plateau (2020)Best Demo Award, ACM MobiSys 2019. Distinguished TPC Member Award, IEEE INFOCOM 2019 IBM Invention Achievement Awards - 15th, 16th, 17th, 18th, 19th, 20th Plateau (2019) IBM Invention Achievement Awards - 12th, 13th, 14th Plateau (2018) Distinguished TPC Member Award, IEEE INFOCOM 2018 Best Video Award, ACM MobiSys 2017. Distinguished TPC Member Award, IEEE INFOCOM 2017 IBM Invention Development Team Award (2017) IBM Invention Achievement Awards - 8th, 9th, 10th, 11th Plateau (2017) IBM Master Inventor (2016) IBM Invention Achievement Awards - 3rd, 4th, 5th, 6th, 7th Plateau (2016) Distinguished TPC Member Award, IEEE INFOCOM 2016 IBM Invention Achievement Awards - 1st, 2nd Plateau (2015) IBM Early Tenure Inventor Award (2015) Honorable Mention Award, ACM CHI 2014. Best Paper Award, ACM CSCW 2014. Qualcomm Fellowship Award, 2013. Best Demo Award, ACM HotMobile 2013. Best Demo Award, ACM MobiSys 2012. Best Demo Award, IEEE SECON 2012. Honorable Mention, IEEE SECON 2012. NEWS For the latest news: please visit his-lab.orgAug. 2021: Our research on AI-augmented mobile-cloud service for inter-generational interaction has been featured in multiple news media: AI Times, Chosun, 교수신문, 전자신문, etc. May 2021: Paper acceptance! (no longer conditional :-)) Our paper on a new socio-physical layer on public IoT systems has been accepted to ACM MobiSys 2021! More details will follow soon.Apr. 2021: Inseok will be serving as an Online Conference Co-Chair for ACM MobiCom 2021, co-chairing with Prof. Lu Su at Purdue University. Jan. 2021: Our paper on AI-powered facilitators for inter-generational interaction has been accepted to ACM CHI 2021!Oct. 2020: Our paper on earables & sensor-based systems for multi-user fitness monitoring and personalized coach has been accepted to ACM SenSys 2020!Oct. 2020: After 6 years of truly exciting moments at IBM Research, I have joined the Department of Computer Science and Engineering, POSTECH, as an Assistant Professor.Aug. 2020: I am serving on ACM HotMobile 2021 Technical Program Committee as a TPC Member.Mar. 2020: I am serving on IEEE Infocom 2021 Technical Program Committee as an Area TPC Chair. Mar. 2020: Our poster about sensor-assisted mobile CNN acceleration framework (a.k.a. vestibulo-ocular fusion) has been selected as the Best Poster Runner-up at ACM HotMobile 2020! June 2019: Our demo about an autonomous telepresence robot system has been selected as the Best Demo Award winner at ACM MobiSys 2019! Apr. 2019: I am serving on IEEE Infocom 2020 Technical Program Committee as a TPC member. Dec. 2018: I am serving on ACM MobiSys 2019 Organizing Committee as a Posters Co-Chair. Oct. 2018: I am serving on ACM MobiSys 2019 Technical Program Committee as a TPC Member. June 2018: I am serving on IEEE Infocom 2019 Technical Program Committee as a TPC member. May 2018: Our paper on a co-present robotic avatar system letting a user live at multiple homes at the same time has been accepted to ACM MobiSys 2018. (Thanks to my awesome intern, Bumsoo Kang, for his hard work!) Jan. 2018: I am serving on ACM UbiComp 2018 Organizing Committee as a Workshop Co-Chair. Aug. 2017: I am serving on ACM HotMobile 2018 Technical Program Committee as a TPC Member. June 2017: Our paper \"Card-stunt as a Service\" has been selected as the Best Video Award winner, as well as the runner-up of the Audience Choice Award at ACM MobiSys 2017! June 2017: I am serving on IEEE Infocom 2018 Technical Program Committee as a TPC member. May 2017: Our paper on a mobile-crowd system to create instant collective visualization on a massively packed crowd has been accepted to ACM MobiSys 2017. (Thanks again to my awesome intern, Chunkuk Yoo, for his continuing dedication on this work.) Jan. 2017: This year I am serving on an NSF Proposal Review Panel as a panelist. Dec. 2016: I am serving on IEEE MDM 2017 Organizing Committee as an Industry Track Co-Chair. Nov. 2016: I am serving as an Associate Editor of PACM on IMWUT (Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies) Oct. 2016: I have been recognized as an IBM Master Inventor. Oct. 2016: I am serving on AAAI ICWSM 2017 Technical Program Committee as a TPC member. Sep. 2016: I am serving on ACM MobiSys 2017 Organizing Committee as a Posters/Demos/Videos Co-Chair. Jul. 2016: I am serving on IEEE Infocom 2017 Technical Program Committee as a TPC member. Jan. 2016: Our paper on ubiquitous near-3D surface interactivity enabled by a single smartphone has been accepted to ACM CHI 2016. (Thanks to my awesome intern, Chungkuk Yoo, for his hard work!) Sep. 2015: Our paper on pre-installation prediction of the battery impact of mobile continuous sensing apps has been accepted to ACM SenSys 2015. Aug. 2015: I am serving on ACM MobiSys 2016 Organizing Committee as a Web Co-Chair, as well as on its External Review Committee as a reviewer. July 2015: Our paper on helping users learn the smartphone battery impact from their walking/moving behaviors has been accepted to ACM UbiComp 2015. June 2015: I am serving on ACM SenSys 2015 Organizing Committee as a Poster/Demo Co-Chair. May. 2015: I am co-chairing ACM MCSS 2015 with Youngki Lee (held in conjuncti",
  "content_length": 10631,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:23"
}