{
  "name": "Insu Yun",
  "homepage": "https://insuyun.github.io",
  "status": "success",
  "content": "Insu YunSearchInsu Yun (윤인수)Associate Professor (Untenured)School of Electrical EngineeringKAISTBiographyInsu Yun is an associate professor (untenured) at KAIST, currently leading Hacking Lab. He is interested in system security in general, especially, binary analysis, automatic vulnerability detection, and automatic exploit generation. His work has been published to the major computer conferences such as IEEE Security & Privacy, USENIX Security, and USENIX OSDI. Particularly, his research won the best paper award from USENIX Security and OSDI in 2018, and he also won DARPA AIxCC with Team Atlanta.In addition to research, he has been participating in several hacking competitions as a hacking expert. In particular, he won Pwn2Own 2020 by compromising Apple Safari and won DEFCON CTF in 2015 and 2018, which is the world hacking competition.Prior to joining KAIST, he received his Ph.D. degree in Computer Science from Georgia Tech in 2020.InterestsInformation SecuritySoftware SecurityHackingEducationPh.D. in Computer Science, 2020Georgia Institute of TechnologyB.S. in Computer Science & Mathematical Science, 2015KAISTCoursesSoftware Hacking Practice and Theory (EE517): 2025S/2024S/2023S/2022S/2021SInformation Security Laboratory (IS521): 2024FAdvanced Programming Techniques for EE (EE309): 2024F/2023FProgramming Structures for EE (EE209): 2022F/2021FRecent PublicationsJihee Park, Insu Yun, Sukyoung Ryu (2025). Bridging the Gap between Real-World and Formal Binary Lifting through Filtered-Simulation (to appear). Proceedings of the ACM SIGPLAN International Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA) 2025. CiteDongok Kim, Juhyun Song, Insu Yun (2025). CROSS-X: Generalized and Stable Cross-Cache Attack on the Linux Kernel (to appear). Proceedings of the 32nd ACM Conference on Computer and Communications Security (CCS). CiteDong-uk Kim, JunYoung Park, Sanghak Oh, Hyoungshick Kim, Insu Yun (2025). Windows plays Jenga: Uncovering Design Weaknesses in Windows File System Security (to appear). Proceedings of the 32nd ACM Conference on Computer and Communications Security (CCS). CiteTaesoo Kim, HyungSeok Han, Soyeon Park, Dae R. Jeong, Dohyeok Kim, Dongkwan Kim, Eunsoo Kim, Jiho Kim, Joshua Wang, Kangsu Kim, Sangwoo Ji, Woosun Song, Hanqing Zhao, Andrew Chin, Gyejin Lee, Kevin Stevens, Mansour Alharthi, Yizhuo Zhai, Cen Zhang, Joonun Jang, Yeongjin Jang, Ammar Askar, Dongju Kim, Fabian Fleischer, Jeongin Cho, Junsik Kim, Kyungjoon Ko, Insu Yun, Sangdon Park, Dowoo Baik, Haein Lee, Hyeon Heo, Minjae Gwon, Minjae Lee, Minwoo Baek, Seunggi Min, Wonyoung Kim, Yonghwi Jin, Younggi Park, Yunjae Choi, Jinho Jung, Gwanhyun Lee, Junyoung Jang, Kyuheon Kim, Yeonghyeon Cha, Youngjoon Kim (2025). ATLANTIS: AI-driven Threat Localization, Analysis, and Triage Intelligence System.PDF CiteTuan Dinh Hoang, Taekkyung Oh, CheolJun Park, Insu Yun, Yongdae Kim (2025). LLFuzz: An Over-the-Air Dynamic Testing Framework for Cellular Baseband Lower Layers. Proceedings of the 34th USENIX Security Symposium (Security). Cite Slides PaperSee all publications Contactinsuyun@kaist.ac.kr042-350-7469Room 812, N1, Korea Advanced Institute of Science and Technology (KAIST), Daejeon, South KoreaCite ×Copy Download",
  "content_length": 3268,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:24"
}