{
  "name": "Ioannis G. Tollis",
  "homepage": "https://www.csd.uoc.gr/CSD/index.jsp?custom=ioannis_tollis",
  "status": "success",
  "content": "Ιωάννης Τόλλης | Τμήμα Επιστήμης Υπολογιστών - Πανεπιστήμιο Κρήτης Επικοινωνία Ανακοινώσεις | Νέα Τρίπτυχο του Τμήματος GR EN webmailelearneduportal Αρχική Σελίδα Άνθρωποι Ακαδημαϊκό Προσωπικό Ιωάννης Τόλλης Ιωάννης Τόλλης A+ A- Professor of Computer Science, University of Crete University of Crete Department of Computer Science Πανεπιστημιούπολη Βουτών 700 13 Ηράκλειο Κρήτης Crete, GREECE Phone: +30 2810 393579 E-mail: tollis AT csd DOT uoc DOT gr Research Interests His research interests are in the broader area of Algorithms and Applications: Graph Analytics Network Visualization Data Science Graph Drawing Modeling and Visualization of Biomedical Data and Networks Information Visualization Data Analytics Algorithms and Applications Brief CV Dr. Ioannis (Yanni) G. Tollis is a Professor of Computer Science at the University of Crete (UOC). He was the Director of the UOC Center for Information and Comunication Technologies, and of the Data Processing Laboratory from 2013 to 2017. He was also affiliated with the Institute of Computer Science at FORTH (ICS-FORTH 2003-Sep. 2015), where he was the head of the Biomedical Informatics Laboratory (BMI lab.) 2005-2010. Dr. Tollis received his Ph.D. degree in Computer Science from the University of Illinois at Urbana-Champaign in Jan. 1988. He received his Diploma degree in Mathematics from the National University of Athens, Greece and his M.Sc. degree in Computer Science from Vanderbilt University, Nashville, Tennessee. He joined the faculty of The University of Texas at Dallas in December 1987, where he was a Professor of Computer Science until 2004. Dr. Tollis has published eight books, over 180 journal and conference papers, and has given more than 70 invited lectures worldwide. His research interests are in Graph Analytics and Network Visualization, Data Science, Modeling and Visualization of Biomedical Data and Networks, Graph Drawing, Information Visualization and Data Analytics, and Algorithms and Applications. His research has been funded by numerous funding agencies and companies. He holds a U.S. patent and several of his projects have been licensed by companies for commercial distribution. He was Vice President of Research at Tom Sawyer Software, Berkeley CA, where he worked on research, future products, and attracting VC funding. He is a Founding Editor and Executive Committee member of the electronic Journal of Graph Algorithms and Applications (he was editor-in-chief 1997-2013); he is a member of the Editorial Boards of: Journal of Healthcare Engineering, 2010-present, Journal of Discrete Mathematics 2012-present, and ISRN Combinatorics, 2012-present. He was a member of the Editorial Board of the IEEE Transactions on Computers (2000-2004). He was the organizer and Program Committee Chair of the 16th International Symposium on Graph Drawing 2008; he was co-organizer and Program Committee co-chair of the International Symposium on Graph Drawing, 1994; he was a member of several program committees of the International Symposium on Graph Drawing; and is a founding member of the steering committee for Graph Drawing. He has served as a member of program committees of many international conferences, most recently, the 1st Conference on the Virtual Physiological Human, 2010 (VPH 2010), HEALTHINF 2012, HEALTHINF 2013, HEALTHINF 2014, and HEALTHINF 2015. He received (a) the Young Engineer of the Year award, March 1993, IEEE-Dallas Section, for contributions to the area of VLSI layout, and (b) the Outstanding Service award, March 1993, IEEE Circuits & Systems-Dallas Section. As of November 2017, according to google scholar Dr. Tollis’ scientific work has received more than 8,500 citations, which result in h-index 40. Πλήρες Βιογραφικό Copyright © 2025, Τμήμα Επιστήμης Υπολογιστών - Συντελεστές - Σχόλια για Ιστότοπο",
  "content_length": 3827,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:34"
}