{
  "name": "Ioan Tabus",
  "homepage": "https://www.tuni.fi/en/ioan-tabus",
  "status": "success",
  "content": "Ioan Tabus | Tampere universitiesIoan TabusProfessor Emerita/EmeritusFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universityioan.tabus [at] tuni.fi (ioan[dot]tabus[at]tuni[dot]fi)Orcidhttps://orcid.org/0000-0003-3131-9551About meIoan Tabus received the Ph.D. degree (Hons.) from the Tampere University of Technology, Finland, in 1995. He held teaching positions at the Department of Control and Computers, Politehnica University of Bucharest, from 1984 to 1995. Since 1996 he has been a Senior Researcher and from January 2000 to July 2024 he was a Professor, with the Department of Signal Processing, Tampere University of Technology, which was merged into the Tampere University, in 2019. From July 2024 he is a Professor Emeritus. He is the coauthor of two books and more than 250 publications in the fields of signal compression, image processing, bioinformatics, and system identification. His research interests include light field image processing, plenoptic image compression, point clouds compression, audio, image, and data compression, genomic signal processing, and statistical signal processing. He was a Corecipient of 1991 Train Vuia Award of Romania, the 2001 NSIP Best Paper Award, the 2004 NORSIG Best Paper Award, the 2016 3DTV Best Paper Award, and the ICIP 2017 Light Field Image Coding Challenge Award. He served as an Associate Editor for the IEEE TRANSACTIONS ON IMAGE PROCESSING, for the IEEE TRANSACTIONS ON SIGNAL PROCESSING and for the Signal Processing (EURASIP). He has served as a Guest Editor of special issues for the IEEE Signal Processing Magazine, Signal Processing (EURASIP), and the IEEE JOURNAL OF SELECTED TOPICS IN SIGNAL PROCESSING. He was the Editor-in-Chief of the EURASIP Journal on Bioinformatics and Systems Biology, from 2006 to 2014.ResponsibilitiesProfessor Emeritus of Signal ProcessingResearch unitComputing Sciences Unit, Faculty of Information Technology and Communication SciencesResearch fieldsHis research interests include light field image processing, plenoptic image compression, point clouds compression, audio, image, and data compression, genomic signal processing, and statistical signal processing.",
  "content_length": 2207,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:30"
}