{
  "name": "Ioanna Dionysiou",
  "homepage": "https://www.unic.ac.cy/dionysiou-ioanna",
  "status": "success",
  "content": "Professor Ioanna Dionysiou - University of Nicosia Skip to content APPLY Professor Ioanna Dionysiou Professor Ioanna Dionysiou Associate Head of Department Professor School of Sciences and Engineering Department of Computer Science Member of the Senate 22841736 [email protected] Central Building›2nd Floor›B217 Brief CV Full CV Research Profile https://orcid.org/0000-0002-7274-5269 Google Scholar Dr Ioanna Dionysiou is currently a Professor of Computer Science at the University of Nicosia. Dionysiou received her PhD from Washington State University (2006), MSc and BSc degrees from Washington State University (2000 and 1997 respectively) and Diploma degree from Higher Technical Institute (1994). During her graduate studies at Washington State University, Dionysiou held instructor, teaching and research assistant appointments. Her PhD dissertation work investigated trust requirements and challenges for large-scale infrastructures, with an exemplary infrastructure being the US Electric Power Grid. Dionysiou’s PhD research was supported by three USA national organizations: NIST (National Institute of Standards and Technology), NSF (National Science Foundation), and DOE (Department of Energy). Dionysiou’s research focuses on trust, security and data protection models in collaborative environments. She is the co-director of the Informatics Security Laboratory (ISL) at the University of Nicosia, which aims mainly on devising new techniques to detect cyberattacks by analyzing attack patterns and visualizing attack attempts in an intuitive manner. Other lab research activities include, among others, applied security standards (ISO 27001), multidisciplinary security practices, data protection, and cyber warfare. She has supervised MSc students as well as several undergraduate students on security topics. Dionysiou co-authored numerous publications on trust management, security, and data protection. She served on various conference committees as an organizing member, track/session chair, and programme committee member. She is the member of various boards, including the Cyprus ECSC (European Cyber Security Challenge) Advisory Board. She has participated in locally-funded and European-funded research projects. Currently, she is the Vice-president of the ACM chapter in Cyprus and an active member of the Cyprus Computer Society. UNIC NICOSIA46 Makedonitissas Avenue, CY-2417P.O. Box 24005, CY-1700Nicosia, CyprusPhone.: +357 22 841500Email: [email protected] UNIC ATHENSNo. 17, 29th StreetElliniko 167 77Athens, GreecePhone:  +30 210 6748293Email: [email protected] USEFUL LINKSAll Academic ProgrammesUNIC Brand CentreUNIC in the NewsVerify a CertificateCareers at UNIC CONNECT WITH UNICSubscribe to NewslettersCopyright © University of Nicosia. All Rights Reserved | Privacy Policy | Terms & Conditions Page load link Live chat is available. Activate it by agreeing to the use of marketing cookies here. Please refresh the page after activation. × Go to Top",
  "content_length": 2984,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:30"
}