{
  "name": "Ioannis Caragiannis",
  "homepage": "https://cs.au.dk/~iannis",
  "status": "success",
  "content": "Ioannis Caragiannis Ioannis Caragiannis Home Research Publications Teaching People CV Contact Ioannis Caragiannis I am a professor at the Department of Computer Science of Aarhus University (since 2020) and the head of the Computational Complexity and Game Theory research group. Before coming to Aarhus, I spent approximately three decades at the University of Patras, getting my Diploma (1996) and PhD (2002), and serving as a faculty member (2004-2020) of the Department of Computer Engineering and Informatics. I am doing research on algorithm design and analysis, with a current focus on computational problems of economic nature. In particular, my research lies at the interface of Computer Science (theoretical computer science and foundations of AI) and Economics (mainly game theory and microeconomics). See research, publications, and CV or contact me for more details. Recent news Jul 2025 Together with Kasper Green Larsen, we organized ICALP 2025 in Aarhus. Apr 2025 Congratulations to Karl Fehrs, who successfully defended his PhD! Karl had been a PhD student working under my supervision from February 2021 to January 2025. His thesis title is \"Optimization and Learning in Voting\". I now have my ChatGPT-generated Ghibli-style photo. Mar 2025 I gave a talk on our recent paper on quantile agent utilities at the Online Social Choice and Welfare Seminar Series. Slides and video from the talk are available on the seminar's website. Feb 2025 Congratulations to Zhile Jiang, who successfully defended his PhD! Zhile had been a PhD student working under my supervision from November 2021 to November 2024. His thesis title is \"Randomness in Structures and Computation\". Dec 2024 I gave an invited talk with title \"Two stories about distortion in social choice\" at the 44th conference on Foundations of Software Technology and Theoretical Computer Science (FSTTCS). The video of the talk is available here.",
  "content_length": 1918,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:33"
}