{
  "name": "Ioannis Demertzis",
  "homepage": "https://idemertzis.com",
  "status": "success",
  "content": "Ioannis Demertzis Ioannis Demertzis Assistant Professor Computer Science and Engineering Dept. Baskin School of Engineering University of California, Santa Cruz Contact Office 329, Engineering 2 idemertz@ucsc.edu About Me I am an Assistant Professor at the Computer Science and Engineering Dept. of UC Santa Cruz. My research focuses on applied cryptography, security & privacy, and secure databases/systems. My goal is to bridge the gap between cryptography/security and real-world systems/databases by working in both areas; aiming to build cryptographic solutions and real systems that are simultaneously practical, efficient, and provably secure. Before joining UCSC, I was a Post-Doctoral Researcher at the EECS Dept. of UC Berkeley working with Prof. Raluca Ada Popa. I received my Ph.D. from the ECE Dept. of the University of Maryland, advised by Prof. Charalampos Papamanthou. I obtained my ECE Diploma and M.Sc at the Technical University of Crete, under the supervision of Minos Garofalakis. I am the recipient of the ACM SIGSAC Doctoral Dissertation Award Runner-up, Distinguished Dissertation Award (University of Maryland), and the Symantec Research Labs Graduate Fellowship. I have also been at the Crypto Group of Visa Research, the Research Labs of Symantec, the Hong Kong University of Science and Technology, and the Microsoft Research Labs as a PhD research intern. I am hiring PhD students and postdocs at UC Santa Cruz (starting from Fall 2025)! If you are interested you are encouraged to inform me directly about your intent to apply. Send your CV, a short description of your research experience and interests, and a link to your personal website (if any). Click here for more information. Latest News June 2025 I’m excited to present our recent results on the first TB-scale oblivious primitives at the Confidential Computing Summit together with my students Nihal Talur and Apostolos Mavrogiannakis. May 2025 I was invited to give a talk on \"Advancing Confidential Computing: Scalable Oblivious Computation for Next-Generation Private Systems, Databases, and AI\" at the Olympia Research Summit. May 2025 I will give a tutorial on \"Large-Scale Private Computation for Real-World Applications via Trusted Hardware and Obliviousness\" at ICDE 2025. May 2025 I was invited to give a talk on \"Scaling Private Computation: Next-Generation Oblivious Primitives for Systems, Databases, and LLMs\" at the Greece-Hong Konng DB Workshop. May 2025 My student, Kyle Fredricson, presents our work SPARTA at IEEE SP 2025---SPARTA is the first anonymous-communication approach that formally mitigates traffic-analysis attacks without relying on broadcast or full participation. Apr 2025 I will give a talk on \"Large‑Scale, Real‑World Oblivious Private Computation with Applications to Systems, Databases, and LLMs\" to Snap's Inc. privacy group. Mar 2025 Excited to attend RSAC and Nvidia's GTC for the first time. Mar 2025 I will give a talk on \"Scalable Oblivious-Private Computation with Applications to Systems, Databases, and LLMs\" to SystemsResearch@Google. Jan 2025 Our work OBLIVIATOR with my student Apostolos Mavrogiannakis and our collaborators at HKUST, has been accepted to USENIX 2025. First oblivious join approach—along with other oblivious query operators—capable of scaling to hundreds of GBs. Nov 2024 I will serve on the Program Committee for ACM CCS 2025, SIGMOD 2026, VLDB 2026, IEEE SP 2026. Oct 2024 Our work, SPARTA with my student Kyle Fredrickson, his co-advisor Darrell Long, and our collaborator at Apple, James Hughes achieves practical anonymity with long-term resistance to traffic analysis attacks. It will appear in IEEE Security & Privacy 2025 Sept 2024 My student Priyanka Mondal (co-advised by Owen Arden) successfully defended her thesis on Towards Making Distributed Systems Trustless. She will be joining Snap Inc. as a Privacy Engineer. June 2024 My student Amin Karbas has successfully completed his MS thesis on Dynamic Oblivious RAM and will be joining Resolve.ai a very promising and well-funded startup as an early employee. Feb 2024 Accepted at USENIX 2024, our work with my student Priyanka Mondal and collaborators from HKUST successfully integrates forward and backward privacy with I/O efficiency for DSE, disproving previous beliefs by CCS '16 and CRYPTO '24. Dec 2023 I will serve on the Program Committee for SIGMOD 2025. Nov 2023 Our paper \"Distributed & Scalable Oblivious Sorting and Shuffling\" has been accepted at IEEE SP'24. First oblivious work that scales for hundreds of GB inputs. Sep 2023 Nihal Talur joins my group at UCSC for Ph.D. July 2023 Our paper \"GraphOS: Towards Oblivious Graph Processing\" has been accepted at VLDB 2023 and will be presented at VLDB 2024. GraphOS is more secure and more efficient than prior state-of-the-art work. It also provides a new, more efficient Oblix. June 2023 I will serve on the Program Committee for ICDE 2024 and AsiaCCS 2024. Jan 2023 Exciting news! We are launching a security seminar at SRL. If you are interested in giving a talk, please contact me. Dec 2022 I will serve on the Program Committee for SIGMOD 2024. Sept 2022 We are excited to announce the launch of our Security Research Lab (SRL) at UCSC! Check out our website for more information (http://srl-ucsc.github.io). Aug 2022 Your contacts are safe! The Signal Messaging App uses our Snoopy and Oblix for oblivious contact discovery. Check out this post. Jun 2022 Our work with my student Amin Karbas on \"Dynamic Searchable Encryption with Optimal Search in the Presence of Deletions\" has been accepted at USENIX 2022. Joint work with my collaborators from HKUST. Jun 2022 Congratulations to my student Surya Keswani for completing his MSc thesis on oblivious computation. May 2022 I will serve on the Program Committee of FCS'22 (Workshop on Foundations of Computer Security 2022). Apr 2022 Two new Ph.D. students: Apostolos Mavrogiannakis and Muhammad Hamza Shahzad will join my group at UCSC in September 2022. Mar 2022 Priyanka Mondal joins my group at UCSC (co-advised with Owen Arden). Dec 2021 I will serve on the Program Committee for SIGMOD 2023. Nov 2021 Very happy to receive the SIGSAC Doctoral Dissertation Award Runners-Up and Distinguished Dissertation Award (University of Maryland) for my Ph.D. Thesis on \"Improving Efficiency, Expressiveness, and Security of Searchable Encryption\". Oct 2021 Our paper \"Snoopy: Surpassing the Scalability Bottleneck of Oblivious Storage\" has been accepted at SOSP 2021. Joint work with collaborators from UC Berkeley. Sep 2021 Amin Karbas joins my group at UCSC for Ph.D. Publications OBLIVIATOR: OBLIVIous Parallel Joins and other OperATORs in Shared Memory Environments A. Mavrogiannakis, X. Wang, I. Demertzis , D. Papadopoulos, M. Garofalakis. Proceedings of USENIX 2025, August 2025. Sparta: Practical Anonymity with Long-Term Resistance to Traffic Analysis K. Fredrickson, I. Demertzis, J. Hughes, D.Long Proceedings of IEEE Symposium on Security and Privacy (SP) 2025, May 2025. Distributed & Scalable Oblivious Sorting and Shuffling N. Ngai, I. Demertzis, JG Chamani, D.Papadopoulos Proceedings of IEEE Symposium on Security and Privacy (SP) 2024, May 2024. I/O-Efficient Dynamic Searchable Encryption meets Forward & Backward Privacy P. Mondal, JG Chamani, I. Demertzis, D.Papadopoulos Proceedings of USENIX 2024, August 2024. GraphOS: Towards Oblivious Graph Processing JG Chamani, I. Demertzis, D.Papadopoulos, Charalampos Papamanthou, Rasool Jalili Proceedings of PVLDB 2023, August 2024. [** Will be presented at VLDB'24 **] Dynamic Searchable Encryption with Optimal Search in the Presence of Deletions JG Chamani, D.Papadopoulos, M. Karbasforushan, I. Demertzis Proceedings of USENIX 2022, August 2022. Snoopy: Surpassing the Scalability Bottleneck of Oblivious Storage E.Dauterman, V.Fang, I. Demertzis, N.Crooks, R.Popa Proceedings of SOSP 2021, October 2021. SEAL: Attack Mitigation for Encrypted Databases via Adjustable Leakage I. Demertzis, D.Papadopoulos, C.Papamanthou, S.Shintre Proceedings of USENIX 2020 Security Symposium, Boston MA, August 2020. Dynamic Searchable Encryption with Small Client Storage I. Demertzis, JG Chamani, D.Papadopoulos, C.Papamanthou Proceedings of NDSS 2020, San Diego CA, February 2020. Searchable Encryption with Optimal Locality: Achieving Sublogarithmic Read Efficiency I. Demertzis, D.Papadopoulos, C.Papamanthou Proceedings of CRYPTO 2018, Santa Barbara CA, August 2018. Efficient Searchable Encryption Through Compression I. Demertzis, R. Talapatra, C. Papamanthou Proceedings of PVLDB 2018, Rio De Janeiro, August 2018. Practical Private Range Search In Depth I. Demertzis, S. Papadopoulos, O.Papapetrou, A. Deligiannakis, M. Garofalakis, C. Papamanthou Proceedings of ACM Transactions on Database Systems (TODS), Vol. 43, No. 1, March 2018. [** Special Issue on the Best Papers of SIGMOD 2016 **] Fast Searchable Encryption with Tunable Locality I. Demertzis, C.Papamanthou Proceedings of ACM SIGMOD 2017, Chicago IL, May 2017. Practical Private Range Search Revisited I. Demertzis, S. Papadopoulos, O. Papapetrou , A. Deligiannakis, M. Garofalakis Proceedings of ACM SIGMOD 2016, San Francisco CA, June 2016. Current Students Apostolos Mavrogiannakis Sept 2022 - current PhD student Nihal Talur Sept 2023 - current PhD student Kyle Fredrickson March 2022 - current PhD candidate (Co-advisedwith Prof. Darrell Long) Canran Liu Sept 2025 - current PhD student Sandhya Saravanan Sept 2025 - current PhD student Giannis Mparous Sept 2025 - current PhD student Alumni Priyanka Mondal March 2022 - October 2024 PhD (Co-advisedwith Prof. Arden) (next: Privacy Engineer at Snap Inc.) Muhammad Hamza Shahzad Sept 2022 - December 2024 MSc student (next: Torc Robotics) Amin Karbas Sept 2021 - June 2024 MSc student (next: Software Engineer at Resolve AI) Surya Keswani Jan 2022 - May 2022 MSc student (next: Software Engineer at Amazon) Courses Teaching Winter 2025: CSE239A Private Computation on Encrypte",
  "content_length": 10662,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:33"
}