{
  "name": "Ioannis Patras",
  "homepage": "http://www.eecs.qmul.ac.uk/~ioannisp",
  "status": "success",
  "content": "Prof. Ioannis (Yiannis) Patras My research is in the area of Multimodal AI, using Machine Learning, Computer Vision and Signal Processing methodologies to learn from multiple sources concepts that enable Intelligent Systems to understand the world and to communicate and collaborate with humans. My recent works and research interests are at the cross-roads of Computer Vision and NLP, and currently evolve around three themes: Learning to recognise behaviour, emotions and cognitive states of people by analysing their images, video and neuro-physiological signals Learning across modalities, and in particular at the intersections of language and vision, using large, pretrained language and audio-visual models Learning from generative models and learning to control generation for privacy, interpretability and control purposes. I have more than 300 publications in the most selective Journals and Conferences in the area of Computer Vision and Machine Learning, including CVPR, ICCV, ECCV, NeurIPS, EMNLP, TPAMI, IJCV, ECCV, TIP. I have been area chair of all major conferences in the area of Computer Vision and associate editor in three journals (Image and Vision Computing; Pattern Recognition; and Computer Vision and Image Understanding). My research has been funded by the EPSRC, EU FP7 and direct bilateral collaborations with research institutes and the industry. I am a member of the college of the EPSRC, and have been regular reviewer and evaluator for funding agencies in EU, UK, Canada, France, Netherlands, Belgium and others. I am a senior member of the IEEE and Fellow of the European Laboratory for Learning and Intelligent Systems (ELLIS). News Nov 25, 2025 1 PhD position available Oct 22, 2025 2 papers accepted at NeurIPS 2025 Jul 15, 2025 2 papers accepted at ACM MM 2025 Jul 14, 2025 1 paper accepted at ICCV 2025 Feb 26, 2025 3 papers accepted at CVPR 2025 Dec 2, 2024 1 paper accepted at COLING 2025 as an oral presentation Dec 1, 2024 Joined the European Lab For Learning & Intelligent Systems (ELLIS) as Fellow Nov 27, 2024 1 paper accepted at WACV 2025 as an oral presentation Oct 22, 2024 2 papers accepted at NeurIPS 2024 Jul 15, 2024 1 paper accepted at ACM MM 2024 Jul 11, 2024 1 paper accepted at TCSVT Jul 1, 2024 1 paper accepted at EECV 2024 Jun 26, 2024 1 paper accepted at PAMI Mar 7, 2024 2 papers accepted at CVPR 2024 Nov 10, 2023 1 paper accepted at EMNLP'23 Nov 8, 2023 2 papers accepted at WACV 2024 Sep 22, 2023 1 paper accepted at NeurIPS 2023 Aug 21, 2023 1 paper accepted at BMVC 2023 Jul 14, 2023 1 paper accepted at ICCV 2023 Mar 17, 2023 Three Papers Accepted at CVPR 2023 (One Top-10%) Feb 28, 2023 Invited talk at International AI Doctoral Academy (AIDA)) Feb 1, 2023 1 paper accepted at ICLR 2023",
  "content_length": 2755,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:40"
}