{
  "name": "Ioannis Chatzigeorgiou",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/ioannis-chatzigeorgiou",
  "status": "success",
  "content": "Ioannis Chatzigeorgiou - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Dr Ioannis Chatzigeorgiou FIMA, SMIEEE, FHEA Senior Lecturer My Role Director of International Teachning Partnerships (Aug. 2025 - present)Director of Postgraduate Studies as well as Postgraduate Examinations Officer (Aug. 2022 - July 2025)Director of Undergraduate Studies (Aug. 2020 - July 2021)Tutor of Second-Year Undergraduate Students (Aug. 2018 - July 2020)Director of the MSc programme in Wireless Communication Systems (Sep. 2017 - Aug. 2018)Curriculum Delivery Officer for Quality Assurance (Sep. 2017 - Aug. 2018)Plagiarism Officer (Sep. 2013 - Aug. 2015 and Sep. 2016 - Aug. 2017)TACT Officer (Sep. 2016 - Aug. 2017)First-Year Undergraduate Examinations Officer (Sep. 2011 - Aug. 2014)Co-organiser of SCC Guest Lectures Series (Sep. 2010 - Aug. 2011) Show more… Profile I am a Senior Lecturer at the School of Computing and Communications and a senior member of Bowland College. I received the Dipl.-Ing. degree in Electrical Engineering from Democritus University of Thrace, Greece in 1997, the MSc degree in Satellite Communications Engineering from the University of Surrey in 2000 and the PhD degree from the University of Cambridge in 2007. From 2000 to 2002, I held positions in Marconi Communications and Inmarsat Ltd. I joined Autonomy Corporation for a short period of time in 2006 but I returned to Cambridge University in 2007 as a Research Associate at the Computer Laboratory, where I remained until December 2009. Before joining Lancaster University as a Lecturer in October 2010, I was a Research Fellow at the Norwegian University of Science and Technology (NTNU) in Trondheim. Research Overview My research interests lie in the general area of communication theory and include the modelling, analysis, performance evaluation and design of communication systems. My focus has been on coding schemes for multiple-antenna systems and cooperative networks. I am particularly intested in random linear network coding over finite fields and noise decoding, e.g., guessing random additive noise decoding (GRAND), from a throughput but also from a security perspective. Career Details Academic Qualifications: Postgraduate Certificate in Academic Practice (Lancaster University, UK, 2011)PhD (University of Cambridge, UK, 2007)MSc in Satellite Communication Engineering with distinction (University of Surrey, UK, 2000)Dipl.-Ing. in Electrical Engineering (Democritus University of Thrace, Greece, 1997) Employment: Senior Lecturer (Aug. 2018 - present), Lecturer (Oct. 2010 - July 2018), School of Computing and Communications, Lancaster UniversityERCIM Research Fellow, Norwegian University of Science and Technology, Jan. 2010 - Sep. 2010Post-doctoral Research Associate, Computer Laboratory, University of Cambridge, Jan. 2007 - Dec. 2009Resource Planning Engineer, Satellite and Network Operations, Inmarsat, London, Mar. 2001 - Mar. 2002Graduate Hardware Engineer, Optical Networks, Marconi Communications, Beeston, Nottingham, Oct. 2000 - Mar. 2001 Professional Role Fellow of the Institute of Mathematics and its Applications (IMA) since 2025.Senior Member of the Institute of Electrical and Electronics Engineers (IEEE) since 2015. Member since 2005.Fellow of the Higher Education Academy (FHEA) since 2012.Member of the International Exchanges Panel of the Royal Society from Jan. 2025 to Dec. 2027.External Examiner for the MSc programme in Signal Processing and Communications at the School of Engineering, University of Edinburgh from Aug. 2024 to Nov. 2028.Full member of the EPSRC Peer Review College since Feb. 2018. Associate member from Oct. 2016 to Jan. 2018.Guest editor of the EURASIP Journal on Advances in Signal Processing, Special Issue on Network Coding, 2016Member of the COST Action CA22168 \"Physical layer security for trustworthy and resilient 6G systems\" (2023-25) and IC1104 \"Random Network Coding and Designs over GF(q)\" (2011-16).TPC member of CSNDSP (2010), IEEE WCNC (2013), ICT (2014, 2016, 2017, 2019), European Wireless 2015, ISWCS (2018, 2019, 2021) and IEEE VTC (Spring 2015, Spring 2016, Fall 2017, Spring 2019) and IEEE GLOBECOM (2020-2023).External PhD examiner for Newcaste University (2016, 2018), NTNU - Norway (2017), Universita Politecnica delle Marche - Italy (2016), University of Bristol (2016), COMSATS (2015), University of York (2013), Aston University (2011). PhD Supervision Interests Research topics that mainly focus on network coding, especially sparse implementations and integration with physical-layer techniques and compressed sensing for repairing damaged data packets. Show less Publications Projects Activities Research Groups Selected Publications Show all 64 publications A lower bound on the success probability of binary random linear network codes aided by noise decodingChatzigeorgiou, I. 26/06/2025 In: IEEE Open Journal of the Communications Society. 6, p. 4962-4977. 16 p.Journal article Constrained symbol-level noise-guessing decoding with antenna sorting for massive MIMOAllahkaram, S., Monteiro, F., Chatzigeorgiou, I. 14/11/2025 In: IEEE Open Journal of the Communications Society. 6, p. 9486-9503. 18 p.Journal article Guessing random additive noise decoding of network coded data transmitted over burst error channelsChatzigeorgiou, I., Savostyanov, D. 30/09/2024 In: IEEE Transactions on Vehicular Technology. 73, 9, p. 12842-12857. 16 p.Journal article Symbol-level GRAND for high-order modulation over block fading channelsChatzigeorgiou, I., Monteiro, F. 1/02/2023 In: IEEE Communications Letters. 27, 2, p. 447-451. 5 p.Journal article Low Complexity Optimization of the Asymptotic Spectral Efficiency in Massive MIMO NOMAHadley, L., Chatzigeorgiou, I. 1/11/2020 In: IEEE Wireless Communications Letters. 9, 11, p. 1928-1932. 5 p.Journal article Network-coded NOMA with antenna selection for the support of two heterogeneous groups of usersSaeed Khan, A., Chatzigeorgiou, I., Lambotharan, S., Zheng, G. 02/2019 In: IEEE Transactions on Wireless Communications. 18, 2, p. 1332-1345. 14 p.Journal article Opportunistic relaying and random linear network coding for secure and reliable communicationKhan, A.S., Chatzigeorgiou, I. 01/2018 In: IEEE Transactions on Wireless Communications. 17, 1, p. 223-234. 12 p.Journal article Non-orthogonal multiple access combined with random linear network coded cooperationKhan, A.S., Chatzigeorgiou, I. 09/2017 In: IEEE Signal Processing Letters. 24, 9, p. 1298-1302. 5 p.Journal article Probability of partially decoding network-coded messagesClaridge, J., Chatzigeorgiou, I. 09/2017 In: IEEE Communications Letters. 21, 9, p. 1945-1948. 4 p.Journal article Decoding delay performance of random linear network coding for broadcastChatzigeorgiou, I., Tassi, A. 08/2017 In: IEEE Transactions on Vehicular Technology. 66, 8, p. 7050-7060. 11 p.Journal article All Publications Show only selected publications Innovation and Collaboration Network for Digitalization of Water: From Sensing to Knowledge Building 15/01/2023 → 14/01/2025 Research Unfunded explorative research on noise-centric decoding 01/01/2022 → … Research Follow-up research on network coding 01/08/2015 → … Research Improving wireless information security by using physical layer dynamics 16/03/2015 → 15/03/2017 Research Network error control for Rapid and Reliable Data Delivery (R2D2) 01/02/2014 → 31/07/2015 Research Mixed Media (VLC and mmWave) HETNET Implementation for Indoor 5G Applications 01/01/1900 → … Research Unfunded research on MIMO systems 01/01/1900 → … Research Royal Society International Exchanges Panel (External organisation) Member of Advisory Panel External Examiner for the MSc Signal Processing and Communications at the School of Engineering, University of Edinburgh Examination Using Random Linear Codes to Guess Random Errors Invited talk Aarhus University Visiting an external academic institution Istanbul Technical University Visiting an external academic institution Resource allocation strategies for network-coded service delivery over LTE systems Invited talk Resource allocation strategies for network-coded service delivery over LTE/LTE-A systems Invited talk Network coding for Rapid and Reliable Data Delivery Invited talk Resource allocation frameworks for network-coded layered multicast services Invited talk EURASIP Journal on Advances in Signal Processing (Journal) Editorial activity Francisco Monteiro Hosting an academic visitor SCC (Communication Systems) Back to listing Contact Details Department: Computing and Communications Office: B43, B - Floor, Infolab TelTelephone: +44 (0)1524 510304 enable JavaScript to view email address Back to listing",
  "content_length": 8937,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:31"
}