{
  "name": "Ioanna Lykourentzou",
  "homepage": "https://lykourentzou.com",
  "status": "success",
  "content": "Ioanna Lykourentzou - Home Ioanna Lykourentzou Home Research Projects Publications Teaching Contact Home Research Projects Publications Teaching Contact I am an Associate Professor at Utrecht University. ​My research focuses on the areas of Human-centered Artificial Intelligence, Computer-Supported Collaborative Work, AI-supported creativity, crowdsourcing, and algorithmic team formation. I develop methods that help people work together, co-create, and innovate at scale and efficiently, in groups or in collaboration with AI. My approach is interdisciplinary, combining insights from computational science (machine learning, generative AI, agent-based modelling, mathematical optimization) and social sciences (personality testing, team building). At Utrecht University I lead the Collaborative Technologies Lab, and coordinate the Computing Science Master's and Information Sciences Honors Bachelor's programs. I also serve as Open Software fellow, part of the Open Science Team of the Faculty of Science, and as vice chair of the Ethics Review Board of the Faculties of Science and Geosciences. Prior to joining UU I worked as a Senior Researcher at the Luxembourg Institute of Science and Technology (LIST), where I coordinated the European H2020 project CROSSCULT. In the past I have also collaborated with the Human-Computer Interaction Institute of Carnegie Mellon University as a visiting researcher, and with INRIA Nancy-Grand Est and the Public Research Center Henri Tudor as a postdoctoral fellow. I hold a Ph.D. and an Electrical and Computer Engineering degree from the National Technical University of Athens. I am part of the ERCIM and Marie-Curie alumni networks. News 09/2025 Our paper, titled \"Bike-Bench: A Bicycle Design Benchmark for Generative Models with Objectives and Constraints\" has been accepted at the Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS 2025).  Congratulations to my co-authors Lyle Regenwetter, Yazan Abu Obaideh, Fabien Chiotti, and Faez Ahmed! 09/2025 Our paper, titled \"Excited, Skeptical, or Worried? A Multi-Institutional Study of Student Views on Generative AI in Computing Education\" has been accepted at the Koli Calling '25, the 25th International Conference on Computing Education Research. Congratulations to my co-authors Isaac Alpizar-Chacon, Hieke Keuning, Imke de Jong, and Susan Rings!08/2025 Our paper, titled \"Transdisciplinary complexity science: deepening system understanding for sustainability\" has just been published by Nature Humanities and Social Sciences Communications. Congratulations to all my co-authors and a special thanks to Lynn de Jager and Brian Dermody!07/2025 Our paper, titled \"Beyond 'Just' Text: Can an AI-Generated Graphic Novel Enhance the Reading Experience of Non-Native English Readers?\" has been accepted at Mensch und Computer 2025. Congratulations to my co-authors Alice Vitali, Isaac Alpizar-Chacon, Christina Schneegass, and Tilman Dingler! 06/2025 Our new pre-print, titled \"A Hierarchical Integer Linear Programming Approach for Optimizing Team Formation in Education\" is out! In this paper, we introduce a new modular mathematical optimization method for forming student teams that enhances practicality and can be adapted to various educational settings. Many thanks to my co-authors Aaron Kessler, Tim Scheiber, and Heinz Schmitz!04/2025 Our symposium, titled \"Transdisciplinary perspectives on the role of artificial intelligence in supporting team processes and outcomes\" has been accepted at the INGRoup conference. Congratulations to my co-organizers Heleen Kerstholt and Catarina M. Santos,  co-presenters Fieke Sluijs and Rianne van Lambalgen, and all the authors honoring us with their presence!04/2025 Our work titled \"Enhancing the formation of game development teams: towards a creative-friendly algorithm approach\" has been accepted at the INGRoup conference. Congratulations to my co-author Pedro Zambon!01/2025 Our project, titled \"TeamMeUp: Assessing the potential of computational matchmaking for the game development sector\" has received funding support from the NWO Take-off grant. Based on optimization algorithms and social sciences, TeamMeUp will explore the potential of computational team formation to help address the games industry’s problem of inefficient talent coordination.11/2024 Our paper, titled \"Prompting for Products: Investigating Design Space Exploration Strategies for Text-to-Image Generative Models\" is now published as open source by Design Science. Congratulations to my co-authors Leah Chong, ,I-Ping Lo, Jude Rayan, Steven Dow, and Faez Ahmed!10/2024 Our project, titled \"Teacher Support for Integrating GenAI Practices in Programming Courses,\" has been funded from the UU Utrecht Education Incentive Fund. The project will develop educational resources to help university instructors incorporate best practices for using GenAI in their programming courses. It builds on last year's fUSO project, which explored students' and teachers' perspectives on GenAI in programming education. Congratulations to my team of (co-)PIs: Christian Köppe, Hieke Keuning, and Isaac Alpizar Chacon!09/2024 Our paper titled \"Students’ Perceptions and Use of Generative AI Tools for Programming Across Different Computing Courses\" has been accepted by the 24th International Conference on Computing Education Research (Koli Calling '24) conference. Congratulations to my co-authors Hieke Keuning, Isaac Alpizar-Chacon, Lauren Beehler, Sergey Sosnovsky, Christian Köppe, and Imke de Jong!05/2024 Our paper titled \"From Explainable to Interactive AI: A Literature Review on Current Trends in Human-AI Interaction\" has been accepted for publication by the International Journal of Human-Computer Studies. Congratulations to my co-authors Muhammad Raees, Inge Meijerink, Vassilis-Javed Khan, and Konstantinos Papangelis!05/2024 Our paper titled \"Cad-Guided Generative Models: A Pathway to Feasible and Innovative Engineering Designs\" has been accepted by the IDETC-CIE 2024 : International Design Engineering Technical Conferences & Computers and Information in Engineering Conference. Congratulations to my co-authors Leah Chong, Jude Rayan, Steven Dow, and Faez Ahmed!01/2024 Happy to welcome Dr. Pedro Santoro Zambon to our research lab. Funded by EU Marie Skłodowska-Curie Actions (MSCA) Pedro's GameDevUp project will study algorithm-assisted team formation for the game development cultural and creative sector. 12/2024 Happy to welcome Ms. Heleen Kerstholt to our research lab. Heleen will work on AI-Enabled Teamwork with applications on education and business.11/2023 Our workshop \"Past meets Future: Workshop on Human-AI Interaction for Digital History and Cultural Heritage\" has been accepted at IUI 2024! Congratulations to my co-organizers Kurt Luther, Vikram Mohanty, Benjamin C. G. Lee, and I am looking forward to lots of fruitful discussions at the intersection of ICT and Cultural Heritage.09/2023 Our paper titled \"Optimizing Team Formation in Educational Settings\" was accepted at HCOMP 2023, Works-in-Progress and Demonstrations track. Congratulations to my co-authors Aaron Kessler, Tim Scheiber, and Heinz Schmitz!08/2023 Our paper titled \"Archaeological trails and contemporary art: Soundscapes for visually impaired visitors\" with Angeliki Antoniou and Jeff Love has been accepted to the 1st International Workshop on Accessibility and Multimodal Interaction Design Approaches in Museums with People with Impairments, at the ACM International Conference on Mobile Human-Computer Interaction - MobileHCI 2023. 08/2023 Our paper titled \"TONIC: A teamwork simulator and digital twin for organizational innovation challenges\", was presented at the 16th International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '23) conference, and is now available online by the ACM Digital Library. Congratulations to my co-author05/2023 Our 1st International Workshop on Accessibility and Multimodal Interaction Design Approaches in Museums for People with Impairments has been accepted at the Mobile HCI 2023 conference. Looking forward to discussing new emerging technologies that improve cultural inclusion!04/2023 Our project \"Generative Artificial Intelligence in Programming Education\"  received funding from Utrecht University's Education Incentive Fund (Utrechts Stimuleringsfonds Onderwijs USO). The project will explore the implications of generative AI tools, with emphasis on Copilot and ChatGPT, on programming education. Congratulations to all my talented core project team colleagues, namely Hieke Keuning, Sergey Sosnovsky, and Matthieu Brinkhuis.01/2023 Our article titled ''Tasks of a Different Color: How Crowdsourcing Practices Differ per Complex Task Type and Why This Matters'' has been accepted to the 2023 ACM Conference on Human Factors in Computing Systems (CHI 2023) conference. Congratulations to my amazing team of co-authors Yihong Wang, Konstantinos Papangelis, Vassilis-Javed Khan, Michael Saker, Alan Chamberlain, Yong Yue, and Hai-Ning Liang.09/2022 Our article titled \"Self-Organization in Online Collaborative Work Settings\" is now pushed by the SAGE/ACM Collective Intelligence journal. Congratulations to my co-authors Federica Lucia Vinella, Faez Ahmed, Costas Papastathis, Konstantinos Papangelis, Vassilis-Javed Khan, and Judith Masthoff.07/2022 Thrilled to see our paper titled \"The Dawn of Crowdfarms\" featured in the August '22 issue of the Communications of the ACM! Congratulations to all my co-authors: Yihong Wang, Konstantinos Papangelis, Vassilis-Javed Khan, Michael Saker, Yong Yue, and Jonathan Grudin.04/2022 Our project \"Crowd-AI Teams for Engineering Product Design\" has been awarded funding by the MIT-Netherlands Lockheed Martin Seed Fund. The project will explore novel ways of Human-AI collaboration for product design. Congratulations Faez Ahmed, I am looking forward to collaborating towards cutting-edge research!04/2022 Our paper titled \"T",
  "content_length": 12759,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:31"
}