{
  "name": "Ioannis Panageas",
  "homepage": "https://panageas.github.io",
  "status": "success",
  "content": "Ioannis Panageas Ioannis (Yannis) Panageas Follow Google Scholar Short bio I am an Assistant Professor in the department of Computer Science, in the Donald Bren School of Information & Computer Science at UC Irvine and the director of the GOALLab. I am affiliated with the Center for Algorithms and Theory of Computation, the Center for Machine Learning and Intelligent Systems (CML) and the Algorithms, Combinatorics and Optimization Center (ACO). I am also affiliated with Archimedes research unit. Prior to UCI, I was an Assistant Professor in Information Systems at SUTD. Before that I was a MIT Postdoctoral Fellow working with Costis Daskalakis. I obtained my PhD in Algorithms, Combinatorics, and Optimization (ACO) at Georgia Tech, advised by Prasad Tetali. At Georgia Tech, I also obtained a MSc in Mathematics. I did my undergrad studies in National Technical University of Athens. Here you can find my CV, Google Scholar and DBLP profiles. My research has been supported by NRF for AI (while at SUTD) and NSF awards. Interests I am interested in theory of computation and its interface with online learning in games, optimization (convex, non-convex, min-max), dynamical systems, probability and statistics and their applications to multi-agent Reinforcement Learning. Teaching I teach CS 280 (Algorithmic Game Theory) in the Fall. For courses I have taught see here. Selected Publications Click here for full list Semi Bandit dynamics in Congestion Games: Convergence to Nash Equilibrium and No-Regret. ICML 2023 (oral) Efficiently Computing Nash Equilibria in Adversarial Team Markov Games. ICLR 2023 (oral) Global Convergence of Multi-Agent Policy Gradient in Markov Potential Games. ICLR 2022 Regression from Dependent Observations. STOC 2019 First-order Methods Almost Always Avoid Saddle Points. Math. Programming 2019. The Limit Points of (Optimistic) Gradient Descent in Min-Max Optimization. NeurIPS 2018 Multiplicative Weights Update with Constant step-size in Congestion Games: Convergence, Limit Cycles and Chaos. NeurIPS 2017 (spotlight) News 11/2025: Stelios successfully defended his thesis! 9/2025: Very excited about the first paper of my student Rohan. Comments are welcome! 9/2025: Three papers accepted in NeurIPS 2025, one spotlight. 7/2025: Invited talk at workshop on Algorithmic Game Theory. 4/2025: Received an NSF grant award from AF. 4/2025: Invited talk at Learning theory workshop, NTU, Singapore. 3/2025: Invited talk at UC Santa Cruz, CS department. 2/2025: New paper on the complexity of min-max. 1/2025: Invited talk at SUFE and Chinese Academy of Sciences. 12/2024: Invited talk at SILO, Madison, Wisconsin. 9/2024: One paper accepted in NeurIPS 2024. Congratulations to my student Jingming for his first publication! 9/2024: Two papers accepted in WINE 2024. Older news 7/2024: Invited talk at MARL summer school, EPFL, Switzerland. 7/2024: I am co-organizing a workshop on the foundations of modern AI, NTUA, Greece. 6/2024: Invited talk at GAIMSS, Metz, France. 6/2024: I'm co-organizing the EC 2024 Mentoring Workshop with Simina Branzei. 5/2024: One paper accepted in ICML 2024. 4/2024: One paper accepted in UAI 2024. 3/2024: Talks at 2024 Informs Optimization Society Conference (IOS24) 1/2024: New paper on bandit feedback in congestion games. 1/2024: PC member for FOCS 2024, AC for ICML, NeurIPS 2024. 1/2024: Two papers accepted in ICLR 2024. 1/2024: Two papers accepted in AAAI 2024. 11/2023: Talk at Simons Laufer Mathematical Sciences Institute on learning in two player games. 10/2023: Talk at Informs on Markov polymatrix Games. 10/2023: AC for ICLR 2024, AISTATS 2024. 9/2023: Four papers accepted in NeurIPS 2023. 6/2023: I'm co-organizing the EC 2023 Mentoring Workshop with Simina Branzei. 5/2023 One paper accepted in EC 2023. 4/2023 One paper accepted in ICML 2023 as oral. 3/2023: Talk on computing Nash equilibria in Markov Games. 2/2023: New paper on time-varying games. 1/2023: Two papers accepted in ICLR 2023, one oral. Talks The complexity of symmetric min-max Learning in Bimatrix Games (MSRI talk) Nash equilibria in Markov Games Policy Gradient for Markov Potential Games On first-order methods (UCI ML seminar) Depth-width tradeoffs for NNs (MiFODS - MIT) Students Current Students (chronological order) Nikolas Patris (Fall 2022 - Present) Jingming Yan (Fall 2023 - Present) Andreas Kontogiannis (Archimedes, co-advised with A. Pagourtzis) Vasilis Pollatos (Archimedes, co-advised with P. Mertikopoulos) Rohan Chauhan (Fall 2024 - Present) Parnian Shahkar (Spring 2025 - Present) Past Students (PhD, MSc, chronological order) Sai Ganesh Nagarajan (PhD ‘21, now Assistant Professor at SDU) Stelios Stavroulakis (PhD ‘25, Senior RL Researcher at Quilter) Will Overman (MSc ‘22, now PhD at Stanford) Fivos Kalogiannis (MSc ‘24, now PhD at UCSD) Past Postdocs Xiao Wang (Assistant Professor at SUFE) Committees and Organizing Workshops PC member for FOCS 2024 SPC member for EC 2025 Area Chair at NeurIPS 2024 Area Chair at ICML 2024, 2025 Area Chair at ICLR 2024, 2025 Senior PC at AAAI 2025 Area Chair at AISTATS 2024, 2025 PC member for EC 2019, 2020, 2021, 2022, 2023 PC member for WINE 2019, 2021, 2023, 2024 Organizer of EC Mentoring Workshop 2023 and 2024 Miscellaneous International Mathematical Olympiad International Olympiad in Informatics",
  "content_length": 5325,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:37"
}