{
  "name": "Ioana Boureanu",
  "homepage": "http://people.itcarlson.com/ioana",
  "status": "success",
  "content": "Ioana Boureanu (Carlson) About Research Projects & Talks Publications Contact My Google Scholar Profile My LinkedIn Profile Committees and Boards General, Program, Local Chair -- general co-chair of ACM WiSec 2023, Guildford, Surrey, 2023 -- poster chair for ESORICS, Guildford, Surrey, September 2020 -- program co-chair of the DETIPS workshop, affiliated with ESORICS 2020, Guildford, Surrey, September 2020 -- local co-chair of the Information Security Conference (ISC), Guildford, Surrey, September 2018 -- general and programme co-chair of the FutureDB workshop on relay attacks and distance-bounding, St Miguel, Azores, Portugal, April 2018 -- general, programme and local co-chair of the 8th Workshop on Cryptography, Robustness, and Provably Secure Schemes for Female Young Researchers (CrossFyre) , September 2018 -- general and programme co-chair of the 12th International Conference on Applied Cryptography and Network Security (ACNS 2014), Lausanne, Switzerland Associate Editor -- ACM Transactions on Privacy and Security -- Journal of Computer Security -- the Information Security Journal Guest Editor -- 2021: Special Issue on \"Recent Advances in Security, Privacy, and Applied Cryptography\", Mathematics, MDPI Programm Committees, incl. Senior Member and Associate Chair -- Associate Chair of the 46th IEEE Symposium on Security and Privacy (IEEE S&P 2025), 2025 -- in the Senior Programme Committee of 24rd International Conference on Autonomous Agents and Multiagent Systems (AAMAS2024), 2024 -- the 31st ACM Conference on Computer and Communications Security (CCS 2024), 2024 -- the 45th IEEE Symposium on Security and Privacy (IEEE S&P 2024), 2024 -- the 30th ACM Conference on Computer and Communications Security (CCS 2023), 2023 -- the 32nd USENIX Security Symposium (USENIX 2023), 2023 -- the 8th IEEE European Symposium on Security and Privacy (IEEE Euro S&P 2023), 2023 -- the 16th ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec), (WiSec 2023),2023 -- the 23rd International Conference on Autonomous Agents and Multiagent Systems (AAMAS2023), 2023 -- the 43th IEEE Symposium on Security and Privacy (IEEE S&P 2022), 2022 -- the 31st USENIX Security Symposium (USENIX 2022), 2022 -- the 7th IEEE European Symposium on Security and Privacy (IEEE Euro S&P 2022), 2022 -- the 15th ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec), (WiSec 2022), 2022 -- the 28th ACM Conference on Computer and Communications Security (CCS 2021), 2021 -- the 42nd IEEE Symposium on Security and Privacy (IEEE S&P 2021), 2021 -- the 6th IEEE European Symposium on Security and Privacy (IEEE Euro S&P 2021), 2021 -- the 30th USENIX Security Symposium (USENIX 2021), 2021 -- the 14th ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec), (WiSec 2021), 2021 -- the 25th International Conference on Financial Cryptography and Data Security (FC 2021), 2021 -- the 35th AAAI Conference on Artificial Intelligence, AAAI'21, 2021 -- the 30th International Joint Conference on Artificial Intelligence (IJCAI 2021), 2021 -- the 19th International Conference on Autonomous Agents and Multiagent Systems (AAMAS2020), 2020 -- the 5th IEEE European Symposium on Security and Privacy (IEEE Euro S&P 2020), 2020 -- the 34th AAAI Conference on Artificial Intelligence, AAAI'20, 2020 -- the 4th IEEE European Symposium on Security and Privacy (IEEE Euro S&P 2019), 2019 -- the 28th International Joint Conference on Artificial Intelligence (IJCAI 2019), 2019 -- the 5th International Conference - Romanian Cryptology Days (RCD), Bucharest, Romania, 2019 -- the 18th International Conference on Autonomous Agents and Multiagent Systems (AAMAS2019), 2019 -- committees before 2019, down to 2012 have been archived I am a Professor in Secure Systems at University of Surrey. I am the Director of the Surrey Centre for Cyber Security (SCCS) , one of UK's Academic Centre of Excellence in Cyber Security Research. Between 2021 and 2023, I also acted as the Co-Director of Surrey's Gold-level ACE-CSE Academic Centre of Excellence in Cyber Security Education. From October 2021 to June 2022, I was a Royal-Society Leverhulme Senior Research Fellow. My research interests are in area of cyber security, formal verification and cryptography, with a focus on: formal security analysis: development of formal frameworks and tools for security (protocol) analysis provable security: generic framework development, protocol design, security proofs formal verification (especially model checking), applied logics wireless, mobile and IoT security: e.g., distance-bounding, RFID/NFC security, 5G News ________________________________ March 2025. Together with my colleague Dr Rajaona, I have been awarded an Amazon Research Award , to streghten and extend aspects of our Phoebe privacy model checker . February 2025. I have been awarded University of Adelaide's International Fellowship Award. January 2025. Two papers accepted at USENIX Security 2025! Check out the publications' tab!\" December 2024. For the fourth year running, in 2025, I will be a visiting researcher at University of Clermont-Auvergne! March 2023. Our paper (\"Program Semantics and Verification Technique for AI-centred Programs\" by F. Rajaona, I. Boureanu, V. Malvone and F. Belardinelli) won BEST PAPER AWARD at the 25th Symposium on Formal Methods 2023 (FM 2023) in Luebeck, Germany! February 2023. Our Apple-Visa attack is still NOT PATCHED, sadly! See an animated explanation of it here or me demo-ing it very much in real-life, on stage, here: over-the-limit-payment, live, from locked iPhone . January 2023. At SCCS, we are the general chairs of WiSec 2023 ! Come to WiSec 2023 and to SCCS in June 2023! October 2022. Our \"L1RP\" solution to prevent (most) relay attacks has been accepted as an amendment of the ISO 14443 standard. See our \"L1RP\" solution here . March 2022. The Formal Methods for Security Network (FM-SEC) is back! Check out our amazing speakers and join us here ! & © Template design by Ioana Boureanu, CSS inspired by Arcsin",
  "content_length": 6080,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:27"
}