{
  "name": "Ioannis Mitliagkas",
  "homepage": "http://mitliagkas.github.io",
  "status": "success",
  "content": "Ioannis (Yannis) Mitliagkas Γιάννης Μητλιάγκας Associate professor, Computer Science, University of Montréal Core faculty at Mila Staff research scientist Google DeepMind Affiliated Researcher Archimedes, Athens Canada CIFAR AI Chair Founder, organizer CV (September 2024) Email, Scholar, Twitter, LinkedIn Researcher in machine learning. Academic, immigrant, amateur musician, runner. I research topics in optimization, dynamics and learning, with a focus on modern machine learning. I have done work in the intersection of systems and theory. Some recent topics: Min-max optimization and the dynamics of games Generalization and domain adaptation Optimization for deep learning Statistical learning and inference See the incomplete (and slightly outdated) summary of research contributions from my group. For a list of representative projects grouped by topic (last updated in early 2022), please consult the projects page. Or check out recent manuscript activity for an idea of what I'm doing now. I work as an associate professor at the University of Montreal, and core faculty member at Mila. Grateful recipient of the Canada CIFAR AI Chair. My most important responsibility is the supervision of a dozen very talented junior researchers. Every fall, I teach ML to 100-200 grad students. Every winter, I teach an advanced research class on deep learning theory. Prospective students: I will be looking for particularly strong students, for MSc or PhD for the fall of 2025. Unfortunatley, I might not be able to respond to all emails. Please make sure to go over my recent publications and list of recent projects (below). If you think that we have a strong overlap in interests please make sure to submit your supervision request by December 1st (form opens in mid-October) and mention me as one of your faculty of choice. I will consider all good candidates, but pay extra attention to those from unusual backgrounds, underrepresented groups, and candidates coming from regions under threat of war, occupation, political instability, etc (Ukraine, Palestine, Africa, … ). For the winter semester of 2025, I am on sabbatical at Archimedes in Athens, Greece. In Montreal, I work part-time as a research scientist at Google DeepMind. I co-founded and hosted the first 2 seasons of MTL MLOpt, a bi-weekly meeting of optimization experts from Mila, UdeM, McGill (CS and math), Google DeepMind, SAIL, FAIR, MSR. We proudly share our guest speaker videos. In in the early days of interest in the area, I co-organized the Smooth games optimization and ML workshop series at NeurIPS. The opening remarks video from NeurIPS 2019, gives a nice summary of our motivation for this line of work. For a summary of relevant work in my lab you can check out this slide deck. In spring 2022 I was invited to participate at the semester on Learning and Games at Simons Institute at Berkeley, CA. For the last few summers I was honored to be invited to teach optimization for ML at the Neuromatch Academy's deep learning course. Before joining the University of Montreal, I was a postdoc with the Departments of Computer Science and Statistics at Stanford University and a PhD candidate at The University of Texas at Austin. Recent News June 2024: One more strong PhD graduation, this time it is Adam Ibrahim! He continues his work as a research scientist at H, Paris. Congratulations Dr. Ibrahim! May 2024: No Wrong Turns: The Simple Geometry Of Neural Networks Optimization Paths paper accepted at ICML 2024! May 2024: For the first time in a long while, I'm attending a big ML conference. I will be at ICLR 2024 in Vienna. April 2024: My second PhD student to graduate, Reyhane Askari Hemmat, has successfully defended her thesis. She continues her work as a research scientist at Meta, Montreal. Congratulations Dr. Askari! January 2024: Empirical Analysis of Model Selection for Heterogeneous Causal Effect Estimation paper accepted at ICLR 2024 for an spotlight presentation. January 2024: LEAD: Min-Max Optimization from a Physical Perspective invited to be presented at ICLR 2024 December 2023: For the winter semester of 2024, I am on sabbatical at Archimedes in Athens, Greece. September 2023: Additive Decoders for Latent Variables Identification and Cartesian-Product Extrapolation paper accepted at NeurIPS 2023 for an oral presentation September 2023: CADet: Fully Self-Supervised Out-Of-Distribution Detection With Contrastive Learning paper accepted at NeurIPS 2023 September 2023: Welcome to new PhD student, Zichu Liu. September 2023: Welcome to new intern, Ange-Clement Akazan who's visitting us from the African Institute for Mathematical Research and will study generative models April 2023: Synergies between Disentanglement and Sparsity: Generalization and Identifiability in Multi-Task Learning paper accepted at ICML 2023. January 2023: My first PhD student to graduate, Alexia Jolicoeur-Martineau, has successfully defended her thesis. She continues her work as a research scientist at SAIL Montreal. Congratulations Dr. Jolicoeur-Martineau!! January 2023: Performative Prediction with Neural Networks paper accepted at AISTASTS 2023. January 2023: Neural Networks Efficiently Learn Low-Dimensional Representations with SGD paper accepted at ICLR 2023 with honorable mention. September 2022: I'm excited to announce that I've started part-time work as a staff research scientist at Google Brain Montreal! Looking forward to deepening my connection to larger scale problems in industry. September 2022: Gradient Descent Is Optimal Under Lower Restricted Secant Inequality And Upper Error Bound paper accepted at NeurIPS 2022. September 2022: Kartik Ahuja has finished his postdoc and started working as a research scientist at Meta research (FAIR) Paris! July 2022: Graduating PhD candidate Alexia Jolicoeur-Martineau started work at Samsung SAIT AI Lab in Montreal! June 2022: As of June 1st, 2022 I was promoted to the post of associate professor with tenure. My sincere thanks to colleagues and my group for all their hard work. October 2021: Honored to be invited to the semester of Learning and Games at Simons. I will be visitting Berkeley in January-March of 2022. September 2021: Welcome to new MSc students, Mehrnaz Mofakhami and Divyat Mahajan. September 2021: Two papers accepted at NeurIPS 2021! [one, two] April 2021: Postdoc in our group, Nicolas Loizou accepted a tenure track position at Johns Hopkins University! March 2021: Postdoc in our group, Manuela Girotti accepted a tenure track position at St. Mary's University! In the meantime shewill spend time at the prestigious mathematical institute, MSRI, in Berkeley, CA. January 2021: Best student paper award for Charles, Baptiste and Manuela's paper at OPT2020! For their work on the fundamentals of condition numbers. Their paper was accepted for publication at AISTATS 2021. January 2021: Alexia and Rémi's paper, in collaboration with MSR Montréal has been accepted at ICLR 2021! Preprint available here. September 2020: Paper on evaluating generalization measures accepted at NeurIPS'20. September 2020: Welcome to new PhD students, Ryan D'Orazio and Hiroki Naganuma. August 2020: Kartik Ahuja awarded the IVADO postdoctoral scholarship. Excited to have him join us in January 2021! April 2020: Two papers on differentiable games (one, two) accepted at ICML'20. January 2020: Two papers on efficient methods and tight bounds for differentiable games (one, two) accepted at AISTATS'20. December 2019: Nicolas Loizou was awarded the IVADO postdoctoral scholarship at the prestigious Fellow tier. December 2019: Brady Neal graduates with an MSc. He will continue on his PhD with us. November 2019: Excited to be coorganizing the 2nd iteration of the Smooth Games Optimization and Machine Learning Workshop at NeurIPS'19. November 2019: Reducing the variance in online optimization by transporting past gradients selected for spotlight oral presentation at NeurIPS'19. October 2019: Multiple submissions to AISTATS. Preprints on the way... June 2019: At ICML with 3 papers in main conference, 2 in Deep Learning Phenomena workshop. May 2019: State-Reification Networks selected for oral presentation at ICML'19. April 2019: Excited to be listed among the most prolific authors of accepted ICML 2019 papers. April 2019: I received the NSERC Discovery grant! April 2019: In Japan for AISTATS. January 2019: h-detach paper accepted at ICLR. December 2018: Was nominated in the first cohort of Canada CIFAR AI chairs!! December 2018: Co-organizing Smooth Games Optimization in ML workshop at NeurIPS. December 2018: Negative momentum for improved game dynamics. Paper accepted at AISTATS 2019. December 2018: Full version of YellowFin manscript accepted at SysML September 2018: Excited to be teaching Machine Learning to a class of 180 graduate students at UdeM. February 2018: YellowFin selected for oral presentation at SysML'18. January 2018: Teaching new class! IFT 6085: Theoretical principles for deep learning December 2017: Accelerated power iteration via momentum, paper accepted at AISTATS 2018. November 2017: Talk at Google Brain, Montréal September 2017: Thrilled to be starting work at the University of Montreal and the Mila as an assistant professor! August 2017: Visiting my alma mater, UT Austin. August 2017: At Sydney for ICML, presenting work on YellowFin, custom scans for Gibbs sampling, and deep learning for 3D point cloud representation and generation. July 2017: New preprint! Representation Learning and Adversarial Generation of 3D Point Clouds [arxiv]. July 2017: New preprint! Accelerated stochastic power iteration [arxiv]. June 2017: New preprint! An automatic tuner for they hyperparameters of momentum SGD [arxiv]. May 2017: Custom scan sequence paper accepted for presentation at ICML 2017! April 2017: Invited talk at Workshop on Advances in Computing Architectures, Stanford SystemX March 2017: New preprint! Custom scan sequences for super fast Gibbs sampling. February 2017: Invite",
  "content_length": 22970,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:36"
}