{
  "name": "Ioannis Chatzigiannakis",
  "homepage": "http://ichatz.me/index.php/Site/Home",
  "status": "success",
  "content": "Ioannis Chatzigiannakis Site/Home View Edit History Print Backlinks Ioannis Chatzigiannakis Home Education Teaching R & D Scientific Activities Software Home Positions: Full Professor at the Department of Computer, Control & Management Engineering, Sapienza University of Rome, Italy (since November 2014). Head of Computer Networks and Pervasive Systems Research Group, Sapienza University of Rome, Italy (since January 2023). Deputy Director and Member of the Steering Committee of the Interdisciplinary Center SAPIENZA DESIGN RESEARCH (SDR), Sapienza University of Rome, Italy (since November 2018). VP Engineering, Spark Works ITC Ltd, United Kingdom (since January 2016). Research Interests: Internet of Things Pervasive Systems Distributed Computing Edge Computing Wireless Sensor Networks Algorithm Engineering Here you can find several thesis proposals for undergraduate projects (Laurea) and graduate master projects (Laurea Magistrale). Some recent topics of focus: Distributed Signal Processing and Machine Learning for Heterogeneous Edge Computing - Today, more than ever, we are able to deploy a large number of IoT devices with diverse computational and communication capabilities that are capable of carrying out a large number of heterogenious task related to the processing and analysis of data while at the same time maintaining a lower-power consumption profile. The aforementioned device and task heterogeneity usually leads to major differences in computation and communication latency of serving IoT tasks with unpredictable dynamics due to human-in-the-loop. These constraints introduce critical challenges in network design and management for IoT. Smart and Circular Cities - Rapid developments in data, computing, and communications technologies combined with innovations in materials, energy, and transportation networks are used to enable smarter data-driven urban applications, enabling Smart Cities to emerge across the world. In this setting, data innovation and mobile and pervasive computing can serve those who live, work, and visit these metropolitan areas. These technologies are central in generating civic innovation, where the best ideas are developed, amplified, and scaled. Moreover, the emergence of Smart Cities brings new challenges regarding adoption and sustainability. Recent Advances Technologies for Intelligent Sensing in Augmented Reality Environments - As global telecommunication market shift towards the 5G era, it becomes obvious that it is now realistic to expect the delivery of new application experiences that utilize augmented reality (AR) technologies and provide end users with real time as well as real world information from the sensor data collected. Gamification, Playfulness, and Ludicity in Intelligent Environments - New types of interactions are emerging that combine methods and techniques for developing playful elements with the potential of the Internet-of-Things (IoT) paradigm to directly link actions, decisions and events happening in real-life with in-game educational progress and modern gaming technologies. Advances in Sensors for Sustainable Smart Cities and Smart Buildings - New ICT technologies are being developed for the intelligent management and control of appliances that provide reliable data to citizens and guide them to achieve a change in behavior and consumption practices. Techno-Human Collective Systems for Smart Cities Innovation - The coexistence and cooperation of embedded systems with our social life is unveiling a brand new era of exciting possibilities. Publications: Google scholar profile ORCID DBLP Computer Science Bibliography Contact Info: Department of Computer, Control & Informatics Engineeringvia Ariosto 25,Rome 00185, Italy LinkedIn: ichatz E-mail: ichatz@diag.uniroma1.it Skype: ichatz Twitter: ichatzi Tel: +39 0677274073 Fax: \t+39 0677274002",
  "content_length": 3863,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:31"
}