{
  "name": "Ioan Marius Bilasco",
  "homepage": "http://cristal.univ-lille.fr/~bilasco",
  "status": "success",
  "content": "Marius BILASCO - Université de Lille Professeur des universités CNU : SECTION 27 - INFORMATIQUE Laboratoire / équipe UMR 9189 - CENTRE DE RECHERCHE EN INFORMATIQUE, SIGNAL ET AUTOMATIQUE DE LILLE Page Orcid du membre (Ouverture dans une nouvelle fenêtre) HAL mbilasco (Ouverture dans une nouvelle fenêtre) Page Researchgate du membre (Ouverture dans une nouvelle fenêtre) marius.bilasco[chez]univ-lille[point].fr Lien vers la page Viadeo ( Nouvelle fenêtre) Lien vers la page X ( Nouvelle fenêtre) Lien vers la page Linkedin ( Nouvelle fenêtre) Composantes, facultés FACULTE DES SCIENCES ET TECHNOLOGIESDEPARTEMENT INFORMATIQUE Domaines de recherche Vision par ordinateur, Analyse faciale, Mouvement Présentation Je suis PU à l'Université de Lille depuis 2023 affecté au département Informatique et au laboratoire CRIStAL (UMR 9189 CNRS / Univ. Lille). Auparavant, j'ai été MCF à l'Université de Lille depuis 2009. Enseignement Depuis ma nomination comme Maître de Conférences à l'université de Lille 1 en 2009, mes activités d'enseignement se sont déroulées au sein de la Licence et du Master mention Informatique, ainsi que du Master MIAGE 1ère année. Mes interventions ont porté sur les thèmes suivants : Algorithmique, Programmation, Structures de Données, Outils pour le travail collaboratif, Outils pour les tests. J’ai également rapidement pris des responsabilités pédagogiques dans le cadre du département. J’ai ainsi pris la responsabilité du suivi pédagogique des alternants avant de prendre la responsabilité du parcours E-Services du Master mention Informatique (de sept. 2012 à sept. 2019). Actuellement, en tant que PU, je dirige la 2ème année du Master Data Sciences (depuis sept. 2022). Recherche Je me suis consacré principalement au domaine de la vision par ordinateur sur des thématiques portant sur l'analyse faciale. Je travaille essentiellement sur la caractérisation du mouvement facial en vue d'inférer l'état affectif/cognitif de l'individu. J'ai eu l'occasion de poursuivre des travaux en relation avec ma thèse sur les métadonnées et la sémantique. Je donne aujourd'hui de nouvelles orientations à mes recherches autour de l'analyse faciale en m'intéressant à l'apprentissage évolué (en profondeur et neuromorphique). Mes activités sont structurées autour de 8 co-encadrements de thèse et de 8 participations aux projets collaboratifs (dont 5 projets européens ITEA, 1 ANR, 1 FUI et un contrat de gré à gré). Encadrement  Au delà des 10 thèses que j'ai co-encadrée (dont deux directions de thèse), je me suis investi également dans l'initiation des étudiants de Master Informatique à la recherche. Ainsi, j'ai pu encadrer des stagiaires de niveau Master 2 (15 dont 5 stages de fin d'études et 10 sur des projets universitaires en lien avec mes recherches) et des étudiants de niveau Master 1 (21 dont 20 sur des projets universitaires en lien avec mes recherches et un stage). Ces stages sont principalement, en relation avec des projets dans le domaine de l'expression et de l'estimation de la pose.",
  "content_length": 3027,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:28"
}