{
  "name": "Ion Androutsopoulos",
  "homepage": "http://www.aueb.gr/users/ion",
  "status": "success",
  "content": "Ion Androutsopoulos Ion (Ioannis) Androutsopoulos This page in Greek > Home Contact/FAQ Publications Projects Teaching Students Group Lab Department AUEB Home page Welcome to my web pages. I am Professor of Artificial Intelligence (AI) in the Department of Informatics of the Athens University of Economics and Business (AUEB). I am Head of the Department, and founder and co-director of AUEB's Natural Language Processing Group. I am also Adjunct Researcher of the Digital Curation Unit and the \"Archimedes\" Research Unit of the Research Centre \"Athena\". Before joining AUEB, I worked for the Institute of Informatics and Telecommunications of NCSR \"Demokritos\", and what is now the Centre for Language Technology of Macquarie University in Sydney. I received my PhD and MSc degrees from the University of Edinburgh, after graduating from the National Technical University of Athens. My expertise is in Artificial Intelligence, especially Natural Language Processing (NLP). My current research interests include the following topics: machine learning in NLP, especially deep learning and large language models, question answering, retrieval augmented generation, multi-step reasoning for document collections, dialog systems, especially porting them to new languages and knowledge domains, sentiment analysis and emotion recognition from text and speech, improving online discussions, including detecting and handling toxic posts and disinformation, and using large language models as facilitators, image to text generation, mostly generating diagnostic tags and diagnostic reports from medical images, NLP for biomedical, legal, financial data and NLP in the digital humanities, NLP tools for Greek. I co-organized the 3rd Athens Natural Language Processing Summer School (AthNLP 2025) and SemEval 2025 Task 10 on \"Multilingual Characterization and Extraction of Narratives from Online News\". I also co-organized the 2nd Athens Natural Language Processing Summer School (AthNLP 2024), the 3rd Workshop on Natural Legal Language Processing (NLLP 2021) at EMNLP 2021, the SemEval Toxic Spans Detection task (2021), the 11th EETN (Greek) Conference on Artificial Intelligence (SETN 2020), the 2nd Workshop on Natural Legal Language Processing (NLLP 2020) at KDD 2020, the 1st Athens Natural Language Processing Summer School (AthNLP 2019), the EACL 2009 conference in Athens, the Large Scale Hierarchical Text Classification challenges (LSHTC3 was the ECML/PKDD 2012 Discovery Challenge), the BioASQ challenges, and the SemEval Aspect-Based Sentiment Analysis task (2014, 2015, 2016). The August 2024 \"Updated science-wide author databases of standardized citation indicators\" of J.P.A. Ioannidis (Stanford University) included me in the top 2% scientists worldwide, for 2023 publications and for career-long publications up to 2023 inclusive [AUEB press release (in Greek)]. The August 2025 \"Updated science-wide author databases of standardized citation indicators\" of J.P.A. Ioannidis (Stanford University) also included me in the top 2% scientists worldwide, for 2024 publications and for career-long publications up to 2024 inclusive [AUEB press release (in Greek)]. I received AUEB's Excellent Teaching Award (for undergraduate teaching), for the academic years 2017-18, 2021-22, and 2023-24, for teaching the \"Artificial Intelligence\" course. I also received the Excellent Teaching Award of the MSc in Computer Science program, for the academic years 2021-22 and 2022-23, for teaching the \"Natural Language Processing\" course. AUEB's NLP group consistently obtains top positions in the ImageCLEFmedical Caption shared task, which requires classifying medical images and generating diagnostic captions from medical images. Specifically, our group ranked 1st in concept detection, 5th in caption prediction, and 1st in explainability in ImageCLEFmed Caption 2025. It ranked 2nd in concept detection and 4th in caption prediction in ImageCLEFmed Caption 2024. We ranked 1st in concept detection and 3rd in caption prediction in ImageCLEFmed Caption 2023 (see also this AUEB announcement in Greek). We also ranked 1st in concept detection and 2nd in caption prediction in ImageCLEFmed Caption 2021 and ImageCLEFmed Caption 2022. Our systems were also ranked at positions 1, 2, 3 and 5 among approximately 60 systems in the ImageCLEFmed Caption 2019 task, and at positions 1, 2, 6 among 49 systems in ImageCLEFmed Caption 2020 (see also this AUEB announcement). Our group also received a BioASQ award in 2018 for ranking first in three out of five document retrieval test batches and all five snippet retrieval test batches. We received another BioASQ award in 2019 for ranking first in the four document and snippet retrieval batches we participated in. We also received a BioASQ award in 2020 for ranking in the top 2 positions in 4 out of 5 document retrieval test batches, and for ranking 1st in 4 out of 5 snippet retrieval test batches. Most of my publications are available on-line, some with accompanying software and datasets. My web pages also contain information on the research projects I am involved in, the courses that I teach, the student projects that I have supervised or that I propose, and ways to contact me. You can find more information about me in my CV (in English and Greek). Last update: October 19, 2025.",
  "content_length": 5333,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:44"
}