{
  "name": "Ira Assent",
  "homepage": "https://pure.au.dk/portal/en/persons/ira-assent(012c1c28-bfa9-4107-bd8f-97dae008b06d).html",
  "status": "success",
  "content": "Ira Assent - Aarhus University View Scopus Profile Ira Assent Professor, Department of Computer Science https://orcid.org/0000-0002-1091-9948 Phone+4522962341Emailiracs.audk Åbogade 34, 5335, 3578200 Aarhus NDenmark 20072025 Research activity per year Personal profile KeywordsAlgorithms for massive datasetsData managementData miningMachine learningQuery processingData AnalyticsSearchParallel algorithmsData-Intensive SystemsText mining Fingerprint Dive into the research topics where Ira Assent is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles High Dimensional Data Computer Science 100% Graphics Processing Unit Computer Science 97% Information Retrieval Computer Science 91% Clustering Algorithm Computer Science 88% Multicore Computer Science 62% Outlier Detection Computer Science 61% Dimensionality Reduction Computer Science 54% Multimedia Databases Computer Science 50% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2011 2011 2020 2023 1 Finished 2 Active Projects per year WallViz: Improving decision making from massive data collections using wall-sized, highly interactive visualizationsAssent, I. (Participant), Mortensen, M. L. (Participant), Magnani, M. (Participant) & Bøgh, K. (Participant)01/04/2011 → …Project: Research Multicore 100% Graphics Processing Unit 100% Multiple-Criteria Decision Analysis 83% Data Structure 66% Data Exploration 66% eData: Scalable and Effective Anomaly Detection and Correction of Automatically Collected Data in e-ScienceAssent, I. (Participant), Micenkova, B. (Participant) & Dang, X.-H. (Participant)01/04/2011 → …Project: Research Outlier Detection 100% Detection Algorithm 66% Transformation Analysis 66% Lower Dimensional Space 33% Eigenvector 33% Light-IoT: Analytics Straight on Compressed IoT Data Zhang, Q. (PI), Lucani Rötter, D. E. (CoPI) & Assent, I. (CoPI)01/12/2020 → 30/09/2023Project: Research deduplication 100% Data Compression 66% Generalized Deduplication 42% Internet of Things 28% Query Processing 28% Research output Research output per year 2007 2008 2009 2010 2011 2012 2013 2014 2019 2020 2021 2022 2023 2024 2025 2025 76 Article in proceedings 24 Journal article 11 Conference article 7 Paper 16 More 5 Book chapter 5 Preprint 1 Anthology 1 Conference abstract in journal 1 Editorial 1 Preface/postscript 1 Other contribution 1 PhD thesis Research output per year Research output per year Causal Banzhaf Value for Aggregate Query ExplanationsKhani, P. & Assent, I., 2025, In: CEUR Workshop Proceedings. 3931, p. 54-58 5 p.Research output: Contribution to journal/Conference contribution in journal/Contribution to newspaper › Conference article › Research › peer-review Aggregate Query 100% Query Explanations 100% Banzhaf Value 100% Causal Explanation 100% Awareness 100% Enhancing Monocular Depth Estimation with Multi-Source Auxiliary TasksQuercia, A., Yildiz, E., Cao, Z., Krajsek, K., Morrison, A., Assent, I. & Scharr, H., 2025, Proceedings - 2025 IEEE Winter Conference on Applications of Computer Vision, WACV 2025. IEEE, p. 6435-6445 11 p.Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Multi-source 100% Monocular Depth Estimation 100% Auxiliary Task 100% Multi-Source 100% Auxiliaries 100% FAIRDEN: FAIR DENSITY-BASED CLUSTERINGKrieger, L., Beer, A., Matthews, P., Thiesson, A. M. & Assent, I., 2025, 13th International Conference on Learning Representations, ICLR 2025. International Conference on Learning Representations, ICLR, p. 19570-19589 20 p.Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Density-based Spatial Clustering of Applications with Noise (DBSCAN) 100% Sensitive Attribute 100% Clustering 100% Clustering Algorithm 100% Data Mining Tasks 50% Focal Sampling: SGD biased towards early important samples for efficient image classification with augmentation selectionQuercia, A., Nader, F., Morrison, A., Scharr, H. & Assent, I., Nov 2025, In: Knowledge and Information Systems. p. 11161-11191 31 p.Research output: Contribution to journal/Conference contribution in journal/Contribution to newspaper › Journal article › Research › peer-review Open Access Test Accuracy 100% Stochastic Gradient Descent 100% Image Classification 100% Focal Sampling 100% State of the Art 100% InteDisUX: intepretation-guided discriminative user-centric explanation for time seriesTran, H. V., Zhang, Z., Pham, T. D., Doan, N. P., Hoang, A.-T., Li, P., Vandierendonck, H., Assent, I. & Mai, T. S., 11 Apr 2025, In: Proceedings of the AAAI Conference on Artificial Intelligence. 39, 20, p. 20921-20928 8 p.Research output: Contribution to journal/Conference contribution in journal/Contribution to newspaper › Conference article › Research › peer-review Open Access Classification Task 100% Well-aligned 100% User-centric 100% Deep Learning Model 100% Local Data 100% View all 134 research outputs Activities Activities per year 2010 2011 2015 6 Member of evaluation panel 4 Lecture and oral contribution 3 Participation in or organisation af a conference 3 Participation in or organisation of workshop, seminar or course 4 More 3 Peer review of manuscripts 1 Member of committee, council or board Activities per year Effective Anomaly Detection and Explanation for Domain ExpertsAssent, I. (Lecturer)28 Jan 2015Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution Outlier detection and explanationAssent, I. (Lecturer)4 Dec 2014Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution Evaluation committee (PhD)Assent, I. (Member)4 Dec 2014Activity: Evaluation, external lectures and examination › Member of evaluation panel Private similarity search on outsourced dataAssent, I. (Invited speaker)8 Oct 2014Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution Evaluation committee (PhD)Assent, I. (Member)7 Oct 2014Activity: Evaluation, external lectures and examination › Member of evaluation panel View all 20 activities Prizes Honorable Mention Award (EuroVis 2024 Posters)Hansen, S. M. (Recipient), Assent, I. (Recipient) & Schulz, H.-J. (Recipient), 2024Prize: Prizes, scholarships, distinctions",
  "content_length": 6743,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:47"
}