{
  "name": "Iraklis Angelos Klampanos",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/iraklisklampanos",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Iraklis Klampanos Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffIraklis KlampanosMr Ethan KellyZhen Tian Dr Iraklis Klampanos Senior Lecturer in Data Systems and Data Engineering (School of Computing Science) telephone: 1640 email: Iraklis.Klampanos@glasgow.ac.uk Import to contacts Publications List by: Type | Date Jump to: 2025 | 2012 | 2011 | 2008 | 2007 | 2005 | 2003Number of items: 8.2025 Aivalis, Theodoros, Klampanos, Iraklis Angelos, Troumpoukis, Antonis and Jose, Joemon ORCID: https://orcid.org/0000-0001-9228-1759 (2025) Interpreting Generative Models through Automatically-Generated Knowledge Graphs. In: 41st ACM/SIGAPP Symposium On Applied Computing (SAC 2026), Thessaloniki, Greece, 23-27 March 2026, (Accepted for Publication) Aivalis, Theodoros, Klampanos, Iraklis, Troumpoukis, Antonis and Jose, Joemon M. ORCID: https://orcid.org/0000-0001-9228-1759 (2025) Enhancing Interpretability in Generative AI Through Search-Based Data Influence Analysis. Greeks in AI 2025, Serafeio, Athens, Greece, 19 - 20 July 2025. (Accepted for Publication) 2012 Whiting, S., Klampanos, I.A. and Jose, J.M. ORCID: https://orcid.org/0000-0001-9228-1759 (2012) Temporal pseudo-relevance feedback in microblog retrieval. Lecture Notes in Computer Science, 7224, pp. 522-526. (doi: 10.1007/978-3-642-28997-2_55) 2011 Whiting, Stewart, Klampanos, Iraklis and Jose, Joemon M. ORCID: https://orcid.org/0000-0001-9228-1759 (2011) University of Glasgow (UGLA-D) at TREC Microblog 2011: temporal pseudo-relevance feedback in microblog retrieval. In: TREC (Text REtrieval Conference) 2011, Gaithersburg, MD, USA, 15-18 Nov 2011, 2008 Punitha, P., Urruty, T., Feng, Y., Halvey, M., Goyal, A., Hannah, D., Klampanos, I., Stathopoulos, V., Villa, R. and Jose, J. ORCID: https://orcid.org/0000-0001-9228-1759 (2008) Glasgow University at TRECVID 2008. In: TRECVID 2008, Gaithersburg, Maryland, USA, 17-18 Nov 2008, 2007 Klampanos, I. and Jose, J. ORCID: https://orcid.org/0000-0001-9228-1759 (2007) An evaluation of a cluster-based architecture for peer-to-peer information retrieval. Lecture Notes in Computer Science, 4653, pp. 380-391. (doi: 10.1007/978-3-540-74469-6_38) 2005 Klampanos, I.A., Poznanski, V., Jose, J.M. ORCID: https://orcid.org/0000-0001-9228-1759 and Dickman, P. (2005) A suite of testbeds for the realistic evaluation of peer-to-peer information retrieval systems. Advances in Information Retrieval, 3408, pp. 38-51. 2003 Klampanos, I.A., Barnes, J.J. and Jose, J.M. ORCID: https://orcid.org/0000-0001-9228-1759 (2003) Evaluating peer-to-peer networking for information retrieval within the context of meta-searching. Advances in Information Retrieval, 2633, pp. 528-536. This list was generated on Sun Nov 30 22:40:57 2025 GMT. Jump to: Articles | Conference or Workshop Item | Conference ProceedingsNumber of items: 8.Articles Whiting, S., Klampanos, I.A. and Jose, J.M. ORCID: https://orcid.org/0000-0001-9228-1759 (2012) Temporal pseudo-relevance feedback in microblog retrieval. Lecture Notes in Computer Science, 7224, pp. 522-526. (doi: 10.1007/978-3-642-28997-2_55) Klampanos, I. and Jose, J. ORCID: https://orcid.org/0000-0001-9228-1759 (2007) An evaluation of a cluster-based architecture for peer-to-peer information retrieval. Lecture Notes in Computer Science, 4653, pp. 380-391. (doi: 10.1007/978-3-540-74469-6_38) Klampanos, I.A., Poznanski, V., Jose, J.M. ORCID: https://orcid.org/0000-0001-9228-1759 and Dickman, P. (2005) A suite of testbeds for the realistic evaluation of peer-to-peer information retrieval systems. Advances in Information Retrieval, 3408, pp. 38-51. Klampanos, I.A., Barnes, J.J. and Jose, J.M. ORCID: https://orcid.org/0000-0001-9228-1759 (2003) Evaluating peer-to-peer networking for information retrieval within the context of meta-searching. Advances in Information Retrieval, 2633, pp. 528-536. Conference or Workshop Item Aivalis, Theodoros, Klampanos, Iraklis, Troumpoukis, Antonis and Jose, Joemon M. ORCID: https://orcid.org/0000-0001-9228-1759 (2025) Enhancing Interpretability in Generative AI Through Search-Based Data Influence Analysis. Greeks in AI 2025, Serafeio, Athens, Greece, 19 - 20 July 2025. (Accepted for Publication) Conference Proceedings Aivalis, Theodoros, Klampanos, Iraklis Angelos, Troumpoukis, Antonis and Jose, Joemon ORCID: https://orcid.org/0000-0001-9228-1759 (2025) Interpreting Generative Models through Automatically-Generated Knowledge Graphs. In: 41st ACM/SIGAPP Symposium On Applied Computing (SAC 2026), Thessaloniki, Greece, 23-27 March 2026, (Accepted for Publication) Whiting, Stewart, Klampanos, Iraklis and Jose, Joemon M. ORCID: https://orcid.org/0000-0001-9228-1759 (2011) University of Glasgow (UGLA-D) at TREC Microblog 2011: temporal pseudo-relevance feedback in microblog retrieval. In: TREC (Text REtrieval Conference) 2011, Gaithersburg, MD, USA, 15-18 Nov 2011, Punitha, P., Urruty, T., Feng, Y., Halvey, M., Goyal, A., Hannah, D., Klampanos, I., Stathopoulos, V., Villa, R. and Jose, J. ORCID: https://orcid.org/0000-0001-9228-1759 (2008) Glasgow University at TRECVID 2008. In: TRECVID 2008, Gaithersburg, Maryland, USA, 17-18 Nov 2008, This list was generated on Sun Nov 30 22:40:57 2025 GMT.",
  "content_length": 5961,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:48"
}