{
  "name": "Iran Mansouri",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/masoumeh-mansouri.aspx",
  "status": "success",
  "content": "Dr Masoumeh Mansouri - School of Computer Science - University of Birmingham Dr Masoumeh Mansouri PhD School of Computer ScienceAssociate Professor Contact details Emailm.mansouri@bham.ac.uk AddressSchool of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Masoumeh (Iran) Mansouri is an Associate Professorof in the School of Computer Science at the University of Birmingham. Her research is primarily related to Knowledge Representation and Reasoning (KR&R) for Robotics. She has focused on hybrid methods that integrate automated task and motion planning, scheduling, as well as temporal and spatial reasoning. Her goal is twofold: to combine heterogeneous representations for the purpose of obtaining “hybrid” KR formalisms that are able to express the many nuances of real-world robotics problems; and to develop efficient methods for reasoning with these formalisms. She is also interested in the ethical and social implications of technology in general and robotics/AI in particular; as well as topics at the intersection of cultural studies and robotics. Please follow the link below to find out more about Dr Mansouri's work: Dr Mansouri's-personal web page. She also leads an interdisciplinary network initiative in Critical Cultural Robotics performing different research/network activities on the topic. PhD in Computer Science, Örebro University, 2016 MSc in Robotics and Intelligent Systems, Örebro University, 2011 BSc in Computer Science, Amirkabir University of Technology, 2008 Dr Masoumeh Mansouri received her PhD from Örebro University in 2016; this investigated a meta constraint-based reasoning approach for hybrid reasoning in robotics. Her main research interest is to employ artificial intelligence techniques in autonomous mobile robotics, with a particular focus on the use of hybrid knowledge representation and reasoning in robotics. This was followed by work as a postdoctoral researcher, then a permanent researcher contract at the Cognitive Robotic Systems project of the Center for Applied Autonomous Sensor Systems (AASS), Örebro University. She has worked in several EU projects including AI4EU, ILIAD (Intra-Logistics with Integrated Automatic Deployment), RACE (Robustness by Autonomous Competence Enhancement), and a 6-year Swedish Knowledge Foundation profile, Semantic Robots. She has also visited Prof. Nick Hawes’ robotics group at the Oxford Robotics Institute and had a research stay in Sven Koenig’s lab at the University of Southern California. Since 2019 she has been a lecturer of the School of Computer Science at the University of Birmingham. Advanced Robotics Artificial Intelligence in Autonomous Mobile Robotics Multi-robot Planning and Coordination Integrated Reasoning in Robotics Hybrid Knowledge Representation for Robotics Bridging Gender Theory and AI/Robotics Practice Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 2977,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:50"
}