{
  "name": "Irene Ye Yuan",
  "homepage": "https://ireneyeyuan.me",
  "status": "success",
  "content": "Irene Ye Yuan | HCI @ MAC Irene Ye Yuan Assistant Professor Computing & Software McMaster University Email Twitter hci.social GitHub Google Scholar Hi, I am Irene! I am an Assistant Professor in the Department of Computing and Software at McMaster University. My research is in the field of Human-Computer Interaction, with a focus in Social and Collaborative Computing. I work on designing and building computing systems that enable multimodal and embodied interactions for engaging and meaningful experience (often in a social context such as intergenerational communication and connection). I combine ethnographic, design, and mixed methods approaches to understand technology design space and to develop technology design frameworks. I am currently looking for students interested in qualitative and design methods, empowering older adults and children, and system building. If you are interested, please refer to [work with me] for more information. Selected Publications Field Trial of a Tablet-based AR System for Intergenerational Connections through Remote Reading Irene Ye Yuan, Peter Genatempo, Georgie Qiao Jin, Lana Yarosh CSCW 2024 to appear in ACM DL Virtual Reality, Real Pedagogy: A Contextual Inquiry of Instructor Practices with VR Video Goergie Qiao Jin, Yu Liu, Irene Ye Yuan, Bo Han, Feng Qian, Lana Yarosh CHI 2024 to appear in ACM DL Socio-technical Opportunities in Long-Distance Communication Between Siblings with a Large Age Difference Georgie Qiao Jin, Irene Ye Yuan, Lana Yarosh CHI 2023 [ACM DL] Tabletop Games in the Age of Remote Collaboration: Design Opportunities for a Socially Connected Game Experience Irene Ye Yuan, Jan Cao, Ruotong Wang, Lana Yarosh CHI 2021 [ACM DL] Beyond Tutoring: Opportunities for Intergenerational Mentorship at a Community Level Irene Ye Yuan Lana Yarosh CHI 2019 [ACM DL] [PDF]",
  "content_length": 1842,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:50"
}