{
  "name": "Irene Amerini",
  "homepage": "http://www.diag.uniroma1.it/users/irene%20amerini",
  "status": "success",
  "content": "Irene Amerini | Dipartimento di Ingegneria informatica, automatica e gestionale Salta al contenuto principale Home » Users » Irene Amerini Irene Amerini Professore associatopagina personalestanza: B215telefono: +39 0677274044email uniroma1: irene.amerini@uniroma1.it Biografia Irene Amerini is Associate Professor at the Department of Computer, Control and Management Engineering A. Ruberti of Sapienza University of Rome, Italy where she is leading the Computer VIsion and Multimedia Forensics Research Team at ALCORLab. From 2019-2022, she was an Assistant Professor at DIAG, Sapienza University of Rome and previously a postdoctoral researcher at the Image Forensics and Security Lab, Media Integration and Communication Center, University of Florence (Italy). In 2018 she obtained a Visiting Research Fellowship at Charles Sturt University (Australia) offered by the Australian Government – Department of Education and Training through the Endeavour Scholarship & Fellowship program and the Italian Habilitation for Associate Professor in Computer Science and Telecommunications. In 2010 she spent part of her PhD course at the Digital Data Embedding Laboratory, Department of Electrical and Computer Engineering, Binghamton University (US). In 2011 she received the Ph.D. in computer engineering, multimedia and telecommunication from the University of Florence (Italy) with the thesis “Image forensics: source identification and tampering detection”. In 2019 she co-organized the Woman In Computer Vision Workshop (WiCV) at CVPR 2019 in Long Beach, California, in 2020 the Woman In Computer Vision Workshop (WiCV) at ECCV, the W4PR (Woman at ICPR Workshop) in conjunction with ICPR 2021 and of the of the VERIMEDIA workshop in conjuction with IJCNN July 2025. She is currently a member of the IEEE Forensics and Security Technical Committee (IFS-TC), EURASIP TAC Biometrics, Data Forensics, and Security and IAPR TC6 - Computational Forensics Committee and Senior Area Editor (S-AE) for the SPS Signal Processing Letters (SPL) May 2025-2027. Her main research activities include computer vision, pattern recognition, adversarial machine learning and multimedia forensics. List of publications on dblp or Google scholar Email: amerini AT diag.uniroma1.it Website/Teaching Interessi di ricerca Multimedia forensics and deepfake analysis Machine learning and deep learning for image and video analysis Digital image and video processing Adversarial machine learning/deep learning Computer vision and monocular depth estimation Riconoscimenti e premi Member of the IEEE Information Forensics and Security Technical Committee and of the EURASIP TAC Biometrics, Data Forensics and Security. She is Associate Editor of IEEE Access journal and Guest Editor of several international journals. In 2018 she obtained the Endeavour Research Fellowship Award offered by the Australian Government, Department of Education and Training. She received the best paper award at the “The International Conference on Forensic Applications and Techniques in Telecommunications, Information and Multimedia” (eForensics) in 2009 and the highly cited research award from Signal Processing: Image Communication Journal in 2016. Highly Cited Paper from Web of Science from 2017 to 2019 with the work “A SIFT–based forensic method for copy-move attack detection and transformation recovery”. IEEE Transactions on Information Forensics and Security, 6(3):1099–1110, 2011. Membro di Computer Vision, Computer Graphics, Deep Learning Theory of Deep Learning Cybersecurity Awards 2023 Best paper award SUMAC '23 Ultime pubblicazioni Adversarial Data Poisoning for Fake News Detection: How to Make a Model Misclassify a Target News Without Modifying it in Machine Learning and Principles and Practice of Knowledge Discovery in Databases 2025 Audio Deepfake Detection: A Continual Approach with Feature Distillation and Dynamic Class Rebalancing in Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 2025 Deepfake Media Forensics: Status and Future Challenges in JOURNAL OF IMAGING 2025 HCN-TA: Hierarchical Capsule Network with Temporal Attention for a Generalizable Approach to Audio Deepfake Detection in Proceedings of the 2023 International Conference on Communication, Signal Processing and Computer Engineering 2025 JAM-net: A KAN-based Deep Neural Network for Pneumonia Detection in Chest X-Rays in 2025 IEEE Symposium on Computational Intelligence in Health and Medicine Companion, CIHM Companion 2025 2025 Lightweight transformer occupancy networks for 3d virtual object reconstruction in Lightweight Transformer Occupancy Networks for 3D Virtual Object Reconstruction 2025 PMDI: An AI-Enabled Ecosystem for Cooperative Urban Mobility in Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 2025 Last 50 publications © Università degli Studi di Roma \"La Sapienza\" - Piazzale Aldo Moro 5, 00185 Roma",
  "content_length": 5041,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:50"
}