{
  "name": "Irina Shklovski",
  "homepage": "http://miswritings.org",
  "status": "success",
  "content": "Miswritings – thinking outloud Skip to content Irina Shklovski I am professor of Communication and Computing at the University of Copenhagen working on issues of privacy, creepy technologies, data practices, ethics and accountability in technology development and technology use in coping with disruptions. News Projects Research Marie-Curie ITN D-Code funded Funding for new PhD positions on ethics in technology design practice. 02/06/2020 News Talks Talk at Data Intimacy Seminar I had the pleasure to participate in the What’s Intimate about Data Seminar organized by the Intimacy and... 14/11/2020 News Publication Talks CreepyLeaks: Rethinking Demos in HCI My colleague Erik Grönvall and I have recently published a paper at the Nordic Conference on HCI (NordiCHI... 29/10/2020 News Talks ‘Pataphysical Software – talk video The Ridiculous Software project is coming along, and the ‘Pataphysical Software paper has generated a lot of interest... 13/07/2020 News Research Project launch: Ethical Dilemmas In AI – Engineering The Way Out This project is a collaboration with the Association of Nordic Engineers, the IEEE and the Data Ethics ThinkDoTank. 09/06/2020 News Publication ‘Pataphysical Software @ DIS 2020 All software is ridiculous but some of it is useful! – DIS2020 Best Paper award. 27/05/2020 News Research Talks Closing keynote @ CHI Nordic 2020 I had a great opportunity to talk about creepy technologies and the perils of visibility at the CHI... 30/04/2020 News Talks Contact tracing in COVID times Last week I was invited to participate in an online debate on European approaches to contact tracing software... 24/04/2020 News Writing Is monitoring your kids surveillance or care? What does having new means of surveillance, visibility and knowing through IoT devices means for our close relationships?... 06/04/2020 News Writing Privacy as an ability or a state? An argument for a relational view There are many definitions for the concept of privacy, how are they different and why is this important?... 06/01/2020 Latest News Talk at Data Intimacy Seminar 14/11/2020 CreepyLeaks: Rethinking Demos in HCI 29/10/2020 ‘Pataphysical Software – talk video 13/07/2020 Project launch: Ethical Dilemmas In AI – Engineering The Way Out 09/06/2020 Contact information: Email: IAS [at] DI [dot] KU [dot] DK Visit: @DIKU: Sigurdsgade 41, Building: 879.01.1.13A @COMM: Karen Blixens Plads 8, Building: 15B-2-09 Writing aboutadvocacy (1) ai (1) creepy (2) CTP (1) data (3) design (2) ethics (3) intimacy (1) iot (2) pataphysics (1) privacy (1) relationships (1) responsible technology (1) software (1) surveillance (4) visibility (1)",
  "content_length": 2646,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:52"
}