{
  "name": "Iris Groher",
  "homepage": "https://www.se.jku.at/iris-groher",
  "status": "success",
  "content": "Iris Groher – WIN-SE Skip to content Assoz. Univ.-Prof.in Dipl.-Ing.in Dr.inAssociate Professor+43 732 2468 4259iris.groher(at)jku.atRoom: S3 0085 AboutResearch ProjectsResearch SpotlightsPublications Iris Groher is Associate Professor at the Institute of Business Informatics – Software Engineering at Johannes Kepler University Linz. She studied Software Engineering at the University of Applied Sciences Hagenberg. After her studies, she joined Siemens AG, Corporate Technology, in Munich as a PhD student and completed her doctorate with distinction in 2008. She then continued as a research scientist at Siemens AG. Following six years in industry, she returned to academia at Johannes Kepler University Linz, where she completed her habilitation in October 2017. Her current research focuses on software engineering education, sustainability in software engineering, and software product line engineering, often in collaboration with academic and industrial partners. She is (co-)author of more than 70 scientific publications in peer-reviewed journals and international conferences. She has co-organized numerous workshops and panels at international conferences, regularly reviews for journals such as IEEE Transactions on Software Engineering (TSE), Information and Software Technology (IST), Journal of Systems and Software (JSS), Empirical Software Engineering (EMSE), Science of Computer Programming (SCP), and IEEE Software, and has served on program committees of international conferences and workshops. She was program co-chair of the International Conference on Information Resources Management (Conf-IRM) in 2021 and of the Fachtagung Software Engineering (SE) in 2024. Until September 2025, she served as Dean for Teaching & Learning at the JKU Business School and as Program Director of the Business Informatics bachelor program at JKU. For a list of her scientific publications, see the entries in DBLP and Google Scholar. Iris Groher is also the JKU representative of  the Innovative Digital Pedagogy board of the European Campus University Alliance EC2U (www.ec2u.eu). Iris Groher",
  "content_length": 2103,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:54"
}