{
  "name": "Irwin King",
  "homepage": "https://www.cse.cuhk.edu.hk/irwin.king",
  "status": "success",
  "content": "home [Irwin King @ Machine Intelligence & Social Computing (MISC) Lab] Irwin King @ Machine Intelligence & Social Computing (MISC) Lab Trace: » home You are here: home Navigation Home Profile Research Interests & Projects About Us Research Group | Presentations News | Newsletter Collaborators Contact Us Publications DBLP Google Scholar Books, Edited Books & Proceedings Book Chapters Theses Patents Presentations Datasets Professional Activities Professional Achievements Awards and Recognitions Grants Teaching Education Excellence Demos & Software Finding Experts Demo MEMPM Matlab Toolbox My iApps Conference Activities Lab and Projects WISC Lab VeriGuide Project CLANS Final Year Projects (FYP) Affiliated Labs VIEW Lab CUHK MoE Microsoft Key Lab Organizations APNNA Caltech Alumni Assoc. HK IEEE CIS INNS W3C Activities In a crisis, don't hide behind anything or anybody. They are going to find you anyway. - Bear Bryant Current Activities CSC4170, CSC2100B, GEN1113, GEN2182, ICONIP'09, CollaborateCom2009, CIKM2009, ACML'09, ICCCI'09, APSIPA ASC 2009, WI'09, SocialCom-09, SIGIR2009, IJCAI-09, CASoN2009, IWSSIP2009, IJCNN2009, FAW2009, WWW2009, ICDE2009, CIDM2009, MSRAMCE2009, ECS2009, IJICC Special Issue, Springer Book See Irwin King In DBLP, Google Scholar, ResearchGate, Google, Bing, Yahoo, ACM DL, ACM Guide to CL, IEEE Xplore, Google (CiteSeer), CS Bib, MSRA Libra, Arnetminer, Google Books, A9 Book Titles Haiqin Yang, … Sparse Learning Under… ISBN 3844330305 Steven C.H. Hoi, … Social Media Modeling… ISBN 0857294350 Irwin King, … Proceedings of WSDM'11… ISBN 978-1-4503-0493-1 Zenglin Xu, Irwin King, … More Than Semi-supervised Learning… ISBN 3843379106 Irwin King, … Proceedings of CIKM-SWSM2009… ISBN 978-1-60558-806-3 Susanne Boll, … Proceedings of MM-WSM2009… ISBN 978-1-60558-608-3 Irwin King and … Weaving Services… ISBN 3642005691 Irwin King and … Advances in Comp… ISBN 1756-378X Kai-Zhu Huang, … Machine Learning:… ISBN 3540794514 Irwin King, … Neural Information… ISBN 3540464794 Irwin King, … Neural Information… ISBN 3540464816 Irwin King, … Neural Information… ISBN 3540464840 Lei Xu, … Intelligent Data… ISBN 9814021237 Kwok-Yee Michael Wong, … Theoretical Aspects of… ISBN 9813083700 Shun-Ichi Amari, … Progress in Neural… ISBN 9813083034 MISC Knowledge Bank Photos Favorite Photos Favorite Videos Books Tidbits IEEE, ACM, CUHK Private . Index Show pagesource Old revisions Login Digg this! Del.Icio.Us Google bookmark Irwin King, MISC Lab \"...the truth shall set you free.\", Caltech's Motto Professor, B.Sc. (Caltech), M.Sc., Ph.D. (USC) Vice-Chair of ACM SIGWEB and ACM WebConf Steering Committee Director, Centre for eLearning Innovation and Technology (ELITE) Principal Investigator, The Knowledge and Education Exchange Platform (KEEP) Project Principal Investigator, VeriGuide Project Former Associate Dean (Education), Engineering Faculty Former President of International Neural Network Society, (INNS) FIEEE (CIS), SMACM, APNNA (VP, BoG), FHKIE, IrwinKing.com Department of Computer Science and Engineering (Room 908) The Chinese University of Hong Kong, Shatin, NT, Hong Kong Phone: +(852) 3943 8398; Fax: +(852) 2603 5024 Email: king [ at ] cse [ dot ] cuhk [ dot ] edu [ dot ] hk See me in DBLP, Google Scholar, ResearchGate Research Interests Machine learning, social computing, neural networks, web intelligence, data mining, information retrieval, plagiarism detection, multimedia information processing Trustworthy AI, Federated learning, and related topics in security and privacy, robustness, fairness, explainability, etc. Natural language processing, LLM, Q&A, key phrase summarization, sentiment analysis, etc. Graph neural networks, graph embedding, knowledge graph, etc. AI and graph applications in medicine, e.g., protein folding, data mining of health records, medical knowledge graphs, etc.*/ Multiple Positions Available (September 2024) Looking for a qualified Postdoctoral candidate interested in trustworthy AI, federated learning, machine learning, NLP, social computing, GNN, etc. to start immediately. Looking for qualified PhD candidates interested in trustworthy AI, machine learning, federated learning, graph neural networks, NLP, social computing, AI, data mining, or related fields to start in August 2025. Looking for experienced programmers/software engineers/web developers to work in front-end and back-end web development projects involving AI, education, and related projects. Please see this link for more information on various engineering positions. Good self-financed candidates are also given priority. For Interested PhD Candidates For interested candidates, please send your CV, a publication list, and a brief (1-2 page) statement of your research interests to Prof. Irwin King, email. Postgraduate Studentship. I am always looking for excellent postgraduate students who are energetic, creative, analytical, hard-working, independent, and well-grounded in mathematics to join our group to work on machine learning and social computing-related projects. Send an email with your interests and resume. more Research Interests>> Recent Accepted Publications Yankai Chen, Yaming Yang, Yujing Wang, Jing Bai, Xiangchen Song, and Irwin King. Attentive Knowledge-aware Graph Convolutional Networks with Collaborative Guidance for Personalized Recommendation, ICDE 2022, May 9-12, 2022, Kuala Lumpur, Malaysia Zixing Song and Irwin King. Hierarchical Heterogeneous Graph Attention Network for Syntax-Aware Summarization, AAAI 2022, February 22-March 1, 2022, Vancouver, Canada Jingjing Li, Zichao Li, Tao Ge, Irwin King, and Michael Lyu. Text Revision by On-the-Fly Representation Optimization, AAAI 2022, February 22-March 1, 2022, Vancouver, Canada Yankai Chen, Menglin Yang, Yingxue Zhang, Mengchen Zhao, Ziqiao Meng, Jianye Hao, and Irwin King. Modeling Scale-free Graphs with Hyperbolic Geometry for Knowledge-aware Recommendation, February 21-25, 2022, Phoenix, AZ Recognition, Achievements, and Events CUHK's Computer Science discipline has been ranked #10 Best Global Universities for Computer Science by the US News and World Report URL1 URL2 Leading researcher in AI, Machine Learning & Mining, Natural Language Processing, and Web & Information Retrieval in CUHK by CSRanking URL Honorable Mentions in 2021 AI 2000 Most Influential Scholars in AAAI/IJCAI and Data Mining URL Honorable Mentions in 2020 AI 2000 Most Influential Scholars in AAAI/IJCAI and Data Mining URL Received 2020 Asia Pacific Neural Network Society (APNNS) Outstanding Achievement Award Received Best Student Paper Award @ ICONIP 2020, November 18-22, 2020, Bangkok, Thailand Received the University Education Award (Teams) for the 2019-2020 academic year Received the Test of Time Award at ACM SIGIR 2020. Received the Test of Time Award at ACM CIKM 2019. Becoming IEEE Fellow in 2019 Becoming ACM Distinguished Member in 2019 Becoming President of the International Neural Network Society in 2019 Organizing The WebConf2020, Taipei from April 20-24, 2020 as General Co-chair Organizing ICONIP2020, Hong Kong as General Co-chair more Conference Activities>> Experiences Visiting Professor with School of Information (iSchool), UC Berkeley (2011-2012) LMTS, AT&T Labs Research, San Francisco (2010-2012) Book Series Editor, Social Media and Social Computing, Taylor and Francis (CRC Press) Associate Editor of ACM Transactions on Knowledge Discovery from Data (ACM TKDD) Associate Editor of Journal of Neural Networks (NN) Editorial Board, International Journal of Data Science and Analytics Editorial Board, Big Data Analytics Former Associate Editor of INNS Natural Intelligence Magazine (INNS NIM) Former Associate Editor of IEEE Transactions on Neural Networks and Learning Systems (IEEE TNN) Vice-President of Membership, Board Member, Board of Governors, International Neural Network Society (INNS) Vice-President and Board Member, Asia Pacific Neural Network Assembly (APNNA) Chair, Task Force on the Future Directions of Neural Networks (IEEE CIS) Chair, SIG and Regional Chapters Committee for Asia and the Pacific (INNS) Former Member, CIS Outstanding Chapter Award Subcommittee, (IEEE CIS) Former Member of Review Panel of the Natural Science, and Engineering of Academy of Finland Former Member of Review Panel of the Natural Sciences and Engineering Research Council of Canada (NSERC) Former Member of RGC Engineering Panel, The Hong Kong SAR Government Member of Joint Research Scheme ( JRS) Panel under RGC, The Hong Kong SAR Government Principal Investigator, Chief Technologist, and Co-Founder, The VeriGuide Project, CUHK Member of the Engineering Faculty Board, The Chinese University of Hong Kong Member of the Editorial Board, Web Intelligence and Web Science (WIWS), Higher Education Press, China Kavli Fellow, Kavli Frontiers of Science Symposium, Kavli Foundation Apple's Distinguished Educator Special Issue Guest Editor, Twitter and Microblogging Services, ACM Transactions on Intelligent System and Technology (TIST), 2011-2012 Special Issue Guest Editor, Web Intelligence, Neurocomputing, 2011 General Chair, The Fourth ACM International Conference on Web Search and Data Mining (WSDM2011), February 2011, Hong Kong. Invited Speaker, The Moving Target of Mobile User Modeling, UMWA2011 Workshop at WSDM2011, February 9, 2011, Hong Kong. SPC, The 3rd Asia Conference on Machine Learning (ACML2011), November 13-15, 2011, Taoyuan, Taiwan. Vice-Program Chair, The 8th International Conference on Mobile Web Information Systems (MobiWIS), September 19-21, 2011, Niagara Falls, Ontario, Canada. SPC, AI and the Web Track, The Twenty-Fifth Conference on Artificial Intelligence (AAAI-11), August 7-11, 2011, San Francisco, USA. Keynote, The 6th International Conference on Advances in Information Technology (IAIT2012), Bangkok, Thailand, October-November, 2012. General Co-Chair, The 2012 International Conference on Advances in Social Networks Analysis and Mining (ASONAM2012), Istanbul, Turkey, August 26-29, 2",
  "content_length": 13283,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:53"
}