{
  "name": "Isaac Keslassy",
  "homepage": "http://webee.technion.ac.il/~isaac",
  "status": "success",
  "content": "Isaac Keslassy Isaac Keslassy Professor Louis and Miriam Benjamin Chair in Computer-Communication Networks Viterbi Faculty of Electrical & Computer Engineering, Technion, Israel 2025-2026: sabbatical year at NetSys, UC Berkeley. Research in Computer Networks, especially Datacenter networks High-performance routers Network device algorithms, e.g. classification, routing, hashing, coding, caching, congestion control, buffer management, and processing. Research Publications Students Courses Current: ECE 044334: Computer Networks and Internet 1 ECE 048889 Seminar: Machine Learning in Computer Networks Undergrad projects: NSSL Lab Previous: [ECE 044114: Discrete Mathematics for Electrical Engineering | EE 046993: High-Speed Networks (formerly Backbone Networks) | EE 048846 / CS 236819: Selected Topics in Computer Networks (incl. Machine Learning in Computer Networks) | EE 048866: Packet-Switch Architectures (discontinued) | EE 048982: Detection and Counting in High-Speed Networks | EE 049036: Network-on-Chip Seminar | EE 049045: Router Architectures | EE 049060: System Aspects of Computer Networks] Activities Steering committee chair for the Israel Networking Day. TPC area chair IEEE Infocom 2024, 2025, 2026. Previously: associate editor for the IEEE/ACM Transactions on Networking; TPC chair for ACM/IEEE ANCS; TPC area chair for IEEE Infocom; TPC member for ACM SIGCOMM, ACM CoNEXT, IEEE Hot Interconnects, DATE, ACM/IEEE NoCS, COMSNETS. ERC (European Research Council) Starting Grant (project: GNoC: Towards a Gaussian Network-on-Chip). Yanai Teaching Award. Alon Fellowship. 2015-2016: sabbatical year at VMware Research and Stanford. Seminar Links Weekly ceClub seminar. Short Bio Isaac Keslassy is a professor at the Viterbi faculty of Electrical & Computer Engineering of the Technion, Israel, and the Louis and Miriam Benjamin Chair in Computer-Communication Networks. He received his M.S. and Ph.D. degrees in Electrical Engineering from Stanford University, in 2000 and 2004. His recent research interests include the design and analysis of data-center networks and high-performance routers. He was the recipient of the Allon, Mani, Yanai, and Taub awards, as well as an ERC Starting Grant. He was also the recipient of the test-of-time award at ACM SIGCOMM'15, best papers at IEEE HotI'17, IEEE Computer Architecture Letters'12 and IEEE IWQoS'10, and a best-paper runner-up award at IEEE Infocom'13. He was associate editor for the IEEE/ACM Transactions on Networking, and TPC chair for ACM/IEEE ANCS'14. He is IEEE senior member. Contact E-mail: isaac (at) technion.ac.il Phone: (+972) 4-829 5738 Address: Meyer 903, ECE Technion Haifa 32000 Israel",
  "content_length": 2675,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:59"
}