{
  "name": "Isaac H. Kim",
  "homepage": "https://www.isaackimquantum.com",
  "status": "success",
  "content": "Isaac H. Kim I work in the field of Quantum Information and Quantum Computation. My research goal is to understand fundamental aspects of quantum entanglement that appear in nature. I have a fairly broad interest in anything quantum. I have worked on the following topics. Topological Order Quantum Error Correction Quantum Algorithms Black-hole information paradox Matrix Analysis These days, I am primarily focused on these topics. Entanglement bootstrap program Practical aspects of quantum error correction Tensor networks on near-term quantum computers Useful links arXiv Google Scholar X (Formerly Twitter) news Feb 17, 2024 Made a new website (at last)! selected publications Operator extension of strong subadditivity of entropy Isaac H. Kim Journal of Mathematical Physics, 2012 arXiv Bib PDF @article{Kim2012Operator, title = {Operator extension of strong subadditivity of entropy}, author = {Kim, Isaac H.}, journal = {Journal of Mathematical Physics}, volume = {53}, pages = {122204}, year = {2012}, doi = {10.1063/1.4769176}, url = {https://dx.doi.org/10.1063/1.4769176}, } Robust entanglement renormalization on a noisy quantum computer Isaac H. Kim, and Brian Swingle 2017 arXiv Bib PDF @misc{Kim2017Robust, title = {Robust entanglement renormalization on a noisy quantum computer}, author = {Kim, Isaac H. and Swingle, Brian}, year = {2017}, archiveprefix = {arXiv}, primaryclass = {quant-ph}, } The ghost in the radiation: robust encodings of the black hole interior Isaac H. Kim, Eugene Tang , and John Preskill Journal of High Energy Physics, Jun 2020 arXiv Bib PDF @article{Kim2020Ghost, author = {Kim, Isaac H. and Tang, Eugene and Preskill, John}, title = {The ghost in the radiation: robust encodings of the black hole interior}, journal = {Journal of High Energy Physics}, year = {2020}, month = jun, day = {03}, volume = {2020}, number = {6}, pages = {31}, issn = {1029-8479}, doi = {10.1007/JHEP06(2020)031}, url = {https://doi.org/10.1007/JHEP06(2020)031}, } Fusion rules from entanglement Bowen Shi , Kohtaro Kato , and Isaac H. Kim Annals of Physics, Jun 2020 arXiv Bib PDF @article{Shi2020Fusion, title = {Fusion rules from entanglement}, journal = {Annals of Physics}, volume = {418}, pages = {168164}, year = {2020}, issn = {0003-4916}, doi = {https://doi.org/10.1016/j.aop.2020.168164}, url = {https://www.sciencedirect.com/science/article/pii/S000349162030097X}, author = {Shi, Bowen and Kato, Kohtaro and Kim, Isaac H.}, keywords = {Anyon, Fusion rule, Quantum entanglement, Quantum phases, Topological order, Topological entanglement entropy}, } Entropy Scaling Law and the Quantum Marginal Problem Isaac H. Kim Phys. Rev. X, May 2021 arXiv Bib PDF @article{Kim2021Entropy, title = {Entropy Scaling Law and the Quantum Marginal Problem}, author = {Kim, Isaac H.}, journal = {Phys. Rev. X}, volume = {11}, issue = {2}, pages = {021039}, numpages = {36}, year = {2021}, month = may, publisher = {American Physical Society}, doi = {10.1103/PhysRevX.11.021039}, url = {https://link.aps.org/doi/10.1103/PhysRevX.11.021039}, } Chiral Central Charge from a Single Bulk Wave Function Isaac H. Kim, Bowen Shi , Kohtaro Kato , and Victor V. Albert Physical Review Letters, May 2021 arXiv Bib PDF @article{Kim2021Chiral, title = {Chiral Central Charge from a Single Bulk Wave Function}, author = {Kim, Isaac H. and Shi, Bowen and Kato, Kohtaro and Albert, Victor V.}, year = {2021}, journal = {Physical Review Letters}, volume = {128}, pages = {176402}, doi = {10.1103/PhysRevLett.128.176402}, url = {https://dx.doi.org/10.1103/PhysRevLett.128.176402}, } Experimental demonstration of the advantage of adaptive quantum circuits M. Foss-Feig , Arkin Tikku , Tsung-Cheng Lu , K. Mayer , Mohsin Iqbal , T. Gatterman , J. Gerber , K. Gilmore , D. Gresh , A. Hankin , Nathan H. Hewitt , Chandler V. Horst , M. Matheny , Tanner Mengle , B. Neyenhuis , Henrik Dreyer , D. Hayes , T. Hsieh , and Isaac H. Kim May 2023 arXiv Bib PDF @misc{FossFeig2023Experimental, title = {Experimental demonstration of the advantage of adaptive quantum circuits}, author = {Foss-Feig, M. and Tikku, Arkin and Lu, Tsung-Cheng and Mayer, K. and Iqbal, Mohsin and Gatterman, T. and Gerber, J. and Gilmore, K. and Gresh, D. and Hankin, A. and Hewitt, Nathan H. and Horst, Chandler V. and Matheny, M. and Mengle, Tanner and Neyenhuis, B. and Dreyer, Henrik and Hayes, D. and Hsieh, T. and Kim, Isaac H.}, year = {2023}, eprint = {2302.03029}, archiveprefix = {arXiv}, primaryclass = {quant-ph}, }",
  "content_length": 4523,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:58"
}