{
  "name": "Isaac E. Lagaris",
  "homepage": "https://cs.uoi.gr/~lagaris",
  "status": "success",
  "content": "Isaac E. Lagaris Personal Page of Isaac Elias Lagaris Isaac E. Lagaris Office phone: +30 26510 08804 Home phone: +30 26510 76859 Cell phone: +30 6945 333 203 Short CV in English Short CV in Greek PUBLICATIONS & Downloads Google Scholar Citations PREPRINTS Courses in Greek Fortran 77 Introduction to Computers Introduction to Optimization Non-linear Optimization Global Optimization Projects for the Graduate Optimization Course. Plugin Example for Global Optimization Software,  Talks, ... The Merlin/MCL Optimization Environment Merlin-Last Version - Local copy Random Number Generator in Double Precision Neural Networks for Differential Equations Neural Nets for Differential equations defined inside irregular boundaries Neural Modeling and Differential Equations Functionally Weighted Neural Networks with an Infinite number of Neurons STOPPING rules for Global Optimization Genetic Code for Global Optimization Particle Swarm Code for Global Optimization Numerical Differentiation Library BOXCQP: Convex quadratic programming for bound constraints (FORTRAN) BOXCQP: Convex quadratic programming for bound constraints (MATLAB) Software for Neural Networks (FORTRAN-MERLIN_Format) Supervised M.Sc. Dissertations \"Global Optimization Methods\"   by Fotis Theos (in Greek). \"Piecewise Neural Networks for Data Fitting\"   by Ioannis Tsoulos (in Greek). Sampling using normal distributions for Global optimization applications by Sotirios Hatzis (In Greek). Subspace optimization extending the Dog-Leg Algorithm by Arsinoi Rizou (In Greek). Supervised Ph. D. Dissertations \"Global Optimization: Methods, Software and Applications\" by Ioannis Tsoulos (in Greek). \"Methods for Local and Global Optimization\" by Costas Voglis (In English). \"Formal Description of the Home Ubihealth model using Denotational Mathematics\" by Ioannis Constantine Sarivougioukas (In English) MATERIAL FOR GRADUATE STUDENTS. (Optimization course). Articles, programs and projects Exams & Solution manuals PARALLEL OPTIMIZATION ARTICLES GLOBAL OPTIMIZATION LINKS Journal of Global Optimization Volume & Issue Summary Global Optimization Survey Global Optimization Global Optimization: past/future links Continuous Global Optimization Software: A Brief Review Optimization Online Links Global Optimization: A. Torn Handbook of Test Problems for Local and Global Optimization NEOS Guide-Global Optimization Global Optimization Laboratory Family Pictures MATHML CS_DEPT",
  "content_length": 2440,
  "method": "requests",
  "crawl_time": "2025-12-01 13:23:57"
}