{
  "name": "Isabel Trancoso",
  "homepage": "https://www.l2f.inesc-id.pt/wiki/index.php/Isabel_Trancoso",
  "status": "success",
  "content": "Isabel Trancoso - HLT@INESC-ID Isabel Trancoso From HLT@INESC-ID Isabel TrancosoProfessor Catedrático | SA-HLT E11F-57B6-72C9 0000-0001-5874-6313 Auzu_DcAAAAJ C-5965-2008 6603959337 +351213100300     231 isabel.trancoso@inesc-id.pt www.hlt.inesc-id.pt/~imt Isabel Trancoso is a full professor at Instituto Superior Técnico (IST, Univ. Lisbon), and the former President of the Scientific Council of INESC ID Lisbon. She got her PhD in ECE from IST in 1987. She chaired the ECE Department of IST. She was Editor-in-Chief of the IEEE Transactions on Speech and Audio Processing and had many leadership roles in SPS (Signal Processing Society of IEEE) and ISCA (International Speech Communication Association), namely having been President of ISCA and Chair of the Fellow Evaluation Committees of both SPS and ISCA. She currently chairs the IEEE Fellow Committee. She was elevated to IEEE Fellow in 2011, to ISCA Fellow in 2014, and to ELLIS (European Laboratory for Learning and Intelligent Systems) Fellow in 2024. She was the recipient of the 2024 ISCA Medal for Scientific Achievement. Contents 1 Research Interests 2 Academic Activities (at IST) 3 Editorial Activities 4 Conference Organization 5 Other Activities Research Interests She launched the speech processing group of INESC-ID, later restructured as L2F/HLT. Her first research topic was medium-to-low bit rate speech coding. From October 1984 through June 1985, she worked on this topic at AT&T Bell Laboratories, Murray Hill, New Jersey. After her PhD, her research focus shifted to speech synthesis and recognition, with a special emphasis on tools and resources for the Portuguese language. Her current research scope is much broader, encompassing many areas in spoken language processing. Her recent PhD advising activities cover microblog translation, lexical and prosodic entrainment in spoken dialogues, disfluency detection in spontaneous speech, and conversation quality evaluation. She has a particular interest in speech as a health biomarker and privacy preserving speech processing. Her formal retirement (from teaching) in October 2022 did not affect in any way her passion for speech and language research. She is currently a member of the Supervisory Board of the Marie Curie Doctoral Training Network PSST (Privacy for Smart Speech Technology). She is also a member of the ISCA Advisory Council, Chair of the Scientific Board of the Center for Responsible AI (CRAI) in Portugal, and Chair of the IEEE Fellow Committee (2024-2025). Academic Activities (at IST) Member of the Diversity and Gender Balance Group, since its creation in 2016 Member of the Ethics Committee since its creation in 2019 Member of the School Assembly (2021-2022) Member of the Scientific Council (2017-2020) Member of the School Council (2013-2014) President of the Department of Electrical and Computer Engineering (2015-2016) Postgraduate Course: Advanced Spoken Language Processing Seminar Graduate Course: Speech Processing Former Coordinator of EEC Undergraduate and Postgraduate Curriculum Editorial Activities Editor-in-Chief IEEE Trans. on Speech and Audio Processing (2003-2005) Member of the Editorial Board of the IEEE Proceedings (2020-2023) Member of the Senior Editorial Board of the Journal of Selected Topics on Signal Processing (2020-) Member of the Editorial Board of the Signal Processing Magazine (2012-2017) Member of the Editorial Board of Cognitive Computation Guest Editor of the Special Issue on Deep Learning for Multi-modal Intelligence across Speech, Language, Vision, and Heterogeneous Signals for the Journal of Selected Topics in Signal Processing, 2020 Guest Editor of the Special Issue on Spoofing and Countermeasures for Automatic Speaker Verification for the Journal of Selected Topics in Signal Processing, 2017 Guest Editor of IEEE/ACM T-ASL Special Issue on Continuous Space and Related Methods in NLP, March 2015 Guest Editor of Special Issue of the Speech Communication journal on Iberian Languages, November-December 2008 Conference Organization ICASSP 2025 - IEEE International Conference on Acoustics, Speech and Signal Processing, Hyderabad, India, April 2025 (Technical Program Co-Chair) Interspeech 2024 - Annual Conference of the International Speech Communication Association, Jerusalem, Israel, October 2024 (Tutorial Committee Chair) Satellite Workshop on [1] Trustworthy Speech Processing, @ICASSP 2024 (Organizer) Special Session on Trustworthy Speech Processing @Interpeech 2022 (Organizer) ASRU 2021 - IEEE Automatic Speech Recognition and Understanding Workshop, Cartagena, Colombia, December 2021 (Technical Program Co-Chair) Speech as PII - Workshop on Speech as Personal Identifiable Information, Lorentz Center, The Netherlands, November 2021 (Organizer) ICASSP 2020 - IEEE International Conference on Acoustics, Speech and Signal Processing, Barcelona, Spain, May 2020 (Plenary Sessions Co-Chair) IberSPEECH 2016 - Lisbon, Portugal, November 2016 (Plenary Talks Chair) EMNLP2015 - Empirical Methods in Natural Language Processing, Lisbon, Portugal, September 2015 (Local Publicity Chair) ICASSP 2011 - International Conference on Acoustics, Speech and Signal Processing, Prague, Czech Republic, May 2011 (Special Sessions co-Chair) SLT 2010 - IEEE Workshop on Spoken Language Technology, Berkeley, California, USA, December 2010 (Technical co-Chair) ASRU 2009 - IEEE Automatic Speech Recognition and Understanding Workshop, Merano, Italy, December 2009 (Publicity co-Chair) Interspeech 2005 - Annual Conference of the International Speech Communication Association, Lisbon, Portugal, September 2005 (Chair) Other Activities President of International Speech Communication Association (ISCA) (2007-2011) Chair of the ISCA Fellow Selection Committee (2019-2020) Chair of the ISCA Distinguished Lecturers Selection Committee (2014-2016) Member of the ISCA Advisory Council (2012-) Chair of the IEEE Fellow Ad Hoc Committee on Society/Technical Council Fellow Evaluating Committees (2019-2020) Chair of the Fellow Evaluation Committee of the IEEE Signal Processing Society (2017-2019) Member of the IEEE Fellows Committee (2014-2016, 2021-2022) Vice-Chair of the IEEE Fellows Committee (2023) Chair of the IEEE Fellows Committee (2024-2025) Member of the IEEE Publication Services and Products Board Strategic Planning Committee (2014-2016, 2021-2023) Member of IEEE PRAC - Periodicals Review and Advisory Committee (2022-2025) Member of IEEE Conferences Committee (2021) Chair of the IEEE James Flanagan Award Committee (2013-2014) Member of the Fellow Evaluation Committee of the IEEE Signal Processing Society (2012-2013) Member of IEEE Signal Processing Society Board of Governors (2006-2008) Member of IEEE Speech and Language Technical Committee (1999-2005) Former Vice-President of the Board of European Language Resources Association (ELRA) Total Publications: 427Article (Author)Exploring features for membership inference in ASR model auditingFrancisco Teixeira, Karla Pizzi, Raphael Olivier, Alberto Abad, Bhiksha Raj, Isabel Trancoso, Computer Speech & Language, vol. 95, DOI https://doi.org/10.1016/j.csl.2025.101812, January 2026CAMÕES: A Comprehensive Automatic Speech Recognition Benchmark for European PortugueseCarlos Manuel Ferreira Carvalho, Francisco Teixeira, Catarina Botelho, Anna Maria Pompili, Rubén Solera Ureña, Sérgio Paulo, Mariana Julião, Thomas Rolland, John Mendonça, Diogo Pereira, Isabel Trancoso, Alberto Abad, ASRU, December 2025Towards cyberbullying detection: Building, benchmarking and longitudinal analysis of aggressiveness and conflicts/attacks datasets from TwitterPaula Ferreira, Nádia Pereira, Hugo Rosa, Sofia Oliveira, Luísa Coheur, Joao P. Carvalho, Ricardo Ribeiro, Paula Paulino, Isabel Trancoso, Ana Margarida Veiga Simão, IEEE Transactions on Affective Computing, vol. 16, n. 3, pages 1473 - 1487, DOI 10.1109/TAFFC.2024.3518587, July 2025Speech as a Biomarker for Disease DetectionCatarina Botelho, Alberto Abad, Tanja Schultz, Isabel Trancoso, IEEE Access, vol. 12, pages 184487 - 184508, DOI 10.1109/ACCESS.2024.3506433, November 2024Privacy-oriented manipulation of speaker representationsFrancisco Teixeira, Alberto Abad, Bhiksha Raj, Isabel Trancoso, IEEE Access, vol. 12, pages 82949-82971, DOI 10.1109/ACCESS.2024.3409067, June 2024Prosociality in Cyberspace: Developing Emotion and Behavioral Regulation to Decrease Aggressive CommunicationAna Margarida Veiga Simão, Paula Ferreira, Nádia Pereira, Sofia Oliveira, Paula Paulino, Hugo Rosa, Ricardo Ribeiro, Luísa Coheur, Joao P. Carvalho, Isabel Trancoso, Cognitive Computation, vol. 13, n. 3, pages 736–750, DOI 10.1007/s12559-021-09852-7, May 2021Adaptação acústico-prosódica local em Português EuropeuVera Cabarrão, Fernando Batista, Helena Moniz, Isabel Trancoso, Ana Isabel Mata da Silva, Revista da Associação Portuguesa de Linguística, December 2019Preserving Privacy in Speaker and Speech CharacterisationAndreas Nautsch, Abelino Jiménez, Amos Treiber, Jascha Kolberg, Catherine Jasserand, Els Kindt, Héctor Delgado, Massimiliano Todisco, Mohamed Amine Hmani, Aymen Mtibaa, Mohammed Ahmed Abdelraheem, Alberto Abad, Francisco Teixeira, Driss Matrouf, Marta Gomez-Barrero, Dijana Petrovska-Delacretaz, Gerard Chollet, Nicholas Evans, Thomas Schneider, Jean-François Bonastre, Bhiksha Raj, Isabel Trancoso, Christoph Busch, Computer Speech & Language, vol. 58, pages 441--480, DOI https://doi.org/10.1016/j.csl.2019.06.001, November 2019Uma abordagem de aprendizagem semissupervisionada para a classificação automática de personalidade baseada em pistas acústico-prosódicasRubén Solera Ureña, Helena Moniz, Fernando Batista, Vera Cabarrão, Anna Maria Pompili, Ramon Fernandez Astudillo, Isabel Trancoso, Revista da Associação Portuguesa de Linguística, vol. 5, pages 348-364, DOI https://doi.org/10.26334/2183-9077/rapln5ano2019a23, September 2019Automatic cyberbullying detection: A systematic reviewHugo Rosa, Nádia Pereira, Ricardo Ribeiro, Paula da Costa Ferreira, Jo",
  "content_length": 135282,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:05"
}