{
  "name": "Isabel Nunes",
  "homepage": "https://ciencias.ulisboa.pt/perfil/minunes",
  "status": "success",
  "content": "Faculdade de Ciências da Universidade de Lisboa Passar para o conteúdo principal Ciências ULisboa Pesquisa Português English Login Está aqui / / Voltar ao Topo ISABEL NUNES Contactos Departamento de Informática Sala/Gabinete 6.3.17 Ext. Principal 26317 Telefone Direto 217500602 Email minunes@ciencias.ulisboa.pt Página Pessoal Carreira Docente Universitário Categoria Professor Auxiliar Indicadores ResearcherID Orcid Scopus Google Scholar CiênciaVitae Interesses Científicos Web semântica; Desenvolvimento de Software Orientado a Objetos; Representação do conhecimento; Raciocínio automático Scientific Interests Semantic Web; Object Oriented Software Development; Knowledge representation; Automatic reasoning Publicações selecionadas Hypothetical answers to continuous queries over data streams, L. Cruz-Filipe, G.Gaspar, and I. Nunes, Proceedings of AAAI, pages 2798-2805, 2020 Description logics, rules and multi-context systems, L. Cruz-Filipe, R. Henriques and I. Nunes, in K. McMillan, A. Middeldorp, and A. Voronkov (eds.), Logic for Programming, Artificial Intelligence, and Reasoning, 19th International Conference, LPAR-19, LNCS 8312, pages 243-257, Springer, December 2013. DOI 10.1007/978-3-642-45221-5_18 From Description-Logic Programs to Multi-Context Systems, L. Cruz-Filipe, G. Gaspar and I. Nunes. Journal of Logical and Algebraic Methods in Programming, 88:26-44. Elsevier, April 2017. DOI 10.1016/j.jlamp.2017.01.005 Bridging the Gap between Algebraic Specification and Object-oriented Generic Programming, Isabel Nunes, Antónia Lopes, and Vasco T. Vasconcelos. In Proceedings of the 9th International Workshop of Runtime Verification, volume 5779 of LNCS, pages 115-131. Springer, 2009. Active integrity constraints for general-purpose knowledge bases, L. Cruz-Filipe, G.Gaspar, I. Nunes, and P. Schneider-Kamp in Annals of Mathematics and Artificial Intelligence, pages 1-34, Springer, 2018. https://doi.org/10.1007/s10472-018-9577-y http://rdcu.be/IZMO. Ver todas as Publicações",
  "content_length": 2004,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:03"
}