{
  "name": "Isabel Sassoon",
  "homepage": "https://www.brunel.ac.uk/people/isabel-sassoon",
  "status": "success",
  "content": "Dr Isabel Sassoon | Introduction | Brunel University London Skip to Content Home People Dr Isabel Sassoon LinkedIn Twitter Dr Isabel SassoonSenior Lecturer Wilfred Brown Building 111 Email: isabel.sassoon@brunel.ac.uk Tel: +44 (0)1895 268799 Computer Science College of Engineering, Design and Physical Sciences Summary Dr Isabel Sassoon is a Senior Lecturer in Computer Science at Brunel University. Isabel was Brunel Lead Investigator on IMMUNE (Immunity Passport Service Design) an UKRI Arts and Humanities Research Council funded project. IMMUNE's aim is to research the unintended consequences and risks related to immunity passports for COVID-19 with a view to inform their design in way that mitigates these. Before joining Brunel Isabel was Research Associate on the CONSULT (Collaborative Mobile Decision Support for Managing Multiple Morbidities), an EPSRC funded project in the Department of Informatics in King’s College London. This project developed a collaborative mobile decision-support system to help patients suffering from chronic diseases to self-manage their treatment, by bringing together and reasoning with wellbeing sensor data, clinical guidelines and patient data. Prior to that Isabel was Teaching Fellow in the Department of Informatics in King’s College London, primarily on the Data Science MSc. Isabel's research interests are in data-driven automated reasoning, and its transparency and explainability. Her PhD research developed a computational argumentation based system to support the appropriate selection of statistical model given a research objective and available data. Her current research continues to explore how computational argumentation can assist in model explainability and trust. Prior to joining King's College London Isabel worked for more than 10 years as a data science consultant in industry, including 8 years in SAS UK. Isabel read Statistics, Operations Research and Economics at Tel Aviv University and received her Ph.D. in Informatics from King's College London. Isabel is a fellow of the Royal Statistical Society and Editorial Board Member of Real World Data Science, Qualifications PhD, Informatics, King's College London, UK. BA. Statistics and Operations Research and Economics, Tel Aviv University, Israel. Fellow of the Higher Education Academy Responsibility Director of Teaching and Learning, Department of Computer Science Newest selected publications Castagna, F., Kökciyan, N., Sassoon, I., Parsons, S. and Sklar, E. (2024) 'Computational Argumentation-based Chatbots: a Survey'. Journal of Artificial Intelligence Research, 80. pp. 1271 - 1310. ISSN: 1076-9757 Open Access Link Journal article Niculaescu, C-E., Sassoon, IK., Landa-Avila, IC., Colak, O., Jun, GT. and Balatsoukas, P. (2023) 'Individual Factors Influencing the Public’s Perceptions About the Importance of COVID-19 Immunity Certificates in the United Kingdom: Cross-sectional Web-based Questionnaire Survey'. JMIR Formative Research, 7. pp. 1 - 13. ISSN: 2561-326X Open Access Link Journal article Castagna, F., Garton, A., McBurney, P., Parsons, S., Sassoon, I. and Sklar, EI. (2023) 'EQRbot: A chatbot delivering EQR argument-based explanations'. Frontiers in Artificial Intelligence, 6. pp. 1 - 16. ISSN: 2624-8212 Open Access Link Journal article Chapman, M., G-Medhin, A., Sassoon, I., Kokciyan, N., Sklar, E. and Curcin, V. (2022) 'Using Microservices to Design Patient-facing Research Software'.IEEE 18th International Conference on eScience. 2022.. Utah USA. 10 - 14 October. IEEE. pp. 44 - 54. ISSN: 2325-372X Open Access Link Conference paper Drake, A., Sassoon, I., Balatsoukas, P., Porat, T., Ashworth, M., Wright, E., Curcin, V., Chapman, M., Kokciyan, N., Modgil, S., Sklar, E. and Parsons, S. et al. (2022) 'The relationship of socio-demographic factors and patient attitudes to connected health technologies: A survey of stroke survivors'. Health Informatics Journal, 28 (2). pp. 1 - 19. ISSN: 1460-4582 Open Access Link Journal article More publications(22)",
  "content_length": 4016,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:01"
}