{
  "name": "Isabelle Augenstein",
  "homepage": "http://isabelleaugenstein.github.io",
  "status": "success",
  "content": "e Isabelle Augenstein Isabelle Augenstein Isabelle Augenstein (/ˌɪːzabˈe̞l ˈaʊ̯ɡe̞nʃˈtaɪn/) Copenhagen NLU group Department of Computer Science University of Copenhagen Østervold Observatory Øster Voldgade 3 1350 Copenhagen Denmark email: augenstein@di.ku.dk I am a Professor at the University of Copenhagen, Department of Computer Science, where I head the Copenhagen Natural Language Understanding research group, the Natural Language Processing section. My main research interests are fair and accountable NLP, including challenges such as explainability, factuality and bias detection. Prior to starting a faculty position, I was a postdoctoral researcher in the UCL Machine Reading group, and I hold a PhD from the University of Sheffield. In October 2022, I became Denmark’s youngest ever female full professor. I currently hold a prestigious ERC Starting Grant on 'Explainable and Robust Automatic Fact Checking', as well as the Danish equivalent of that, a DFF Sapere Aude Research Leader fellowship on 'Learning to Explain Attitudes on Social Media'. My research has been recognised by a Karen Spärck Jones Award, as well as a Hartmann Diploma Prize. I am a member of the Royal Danish Academy of Sciences and Letters, and co-lead of the Danish Pioneer Centre for Artificial Intelligence. For more details, see my publications and CV. More information on how to join us in Copenhagen can be found here. News November 2025: I am recruiting a PhD student and postdoc for a new project on Human-Centered Explainable Retrieval-Augmented LLMs funded by Independent Research Foundation Denmark starting in autumn 2026. The application deadline is 1 February 2026. August 2025: 7 papers to be presented at EMNLP 2025, on topics including explainable AI and social NLP. May 2025: We are organising a pre-ACL workshop in Copenhagen on 26 July, supported by DDSA and the Pioneer Centre for AI. Sign up here. May 2025: Our group will be presenting 3 papers at ACL 2025 -- 2 ACL main papers, on fact checking and retrieval-augmented generation, as well as a CL survey paper on cross-cultural NLP. April 2025: I'm extremely grateful to the British Computing Society and Bloomberg for honouring me with the Karen Spärck Jones Award at ECIR 2025, which is awarded talented researchers who have endeavoured to advance our understanding of Natural Language Processing or Information Retrieval with significant experimental contributions. April 2024: We are looking to recruit a PhD student on on Interpretable Natural Language Processing, to be supervised by Pepa Atanasova and myself. The application deadline is 15 May 2025. [More details and application link] January 2025: 4 papers accepted to NAACL 2025, on topics including feature attribution and measuring cultural values. September 2024: 5 papers to be presented at EMNLP 2024, on topics including benchmarking LLMs for fairness and factuality and probing them for knowledge conflicts. July 2024: I am visiting the Kim Jaechul Graduate School of AI at the Korea Advanced Institute of Science and Technology (KAIST AI) this summer. June 2024: I am honoured to have been elected to become a member of the Royal Danish Academy of Sciences and Letters. May 2024: 4 papers accepted to ACL 2024! We present new findings within explainability, language modelling, as well as detecting distortions in scientific writing. March 2024: Honoured to announce that our paper Semantic Sensitivities and Inconsistent Predictions: Measuring the Fragility of NLI Models has received an outstanding paper award at EACL 2024! October 2023: Happy to share that my group had 5 papers accepted to EMNLP 2023, on topics ranging from explainability to language modelling. May 2023: 4 papers accepted to ACL 2023! The papers make contributions within faithfulness of explanations, measuring intersectional biases, event extraction and few-shot stance detection. April 2023: I'm extremely grateful to the Hartmann Foundation for having honoured me with the Hartmann Diploma Prize, which is awarded to younger people who are expected to make a valuable contribution to Danish society. March 2023: I have joined the Pioneer Centre for Artificial Intellgence as a co-lead of the Speech and Language collaboratory. In this context, my research group CopeNLU has moved to the Østervold Observatory, located in the Botanical Gardens in central Copenhagen. February 2023: Excited to be giving an invited talk on Modelling Information Change in Scientific Communication at AAAI 2023! November 2022: I've been awarded a prestigious ERC Starting Grant on explainable fact checking! Read more in ERC's offical press release, as well as in this post on the CopeNLU website. October 2022: Popular science article in the Danish press about work on quantifying gender biases towards politicians on Reddit and its relevance to the 2022 Denmark general election now online. October 2022: I've been promoted to full professor, making me the youngest ever female full professor in Denmark!",
  "content_length": 4993,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:02"
}