{
  "name": "Isabel Valera",
  "homepage": "https://ivaleram.github.io",
  "status": "success",
  "content": "Isabel Valera Isabel Valera Saarland Informatics Campus Prof. Dr. Isabel Valera Saarland Informatics Campus Home Research Software CV E-mail: ivalera@cs.uni-saarland.de Address: Department of Computer Science Saarland Informatics Campus Bldg. E1 1, R. 225 66123 Saarbrücken, Germany Phone: +49 (0)681 302-57328 About me I am a full Professor on Machine Learning at the Department of Computer Science of Saarland University in Saarbrücken (Germany), and Adjunct Faculty at MPI for Software Systems in Saarbrücken (Germany). I am a fellow of the European Laboratory for Learning and Intelligent Systems ( ELLIS), where I am part of the Robust Machine Learning Program and of the Saarbrücken Artificial Intelligence & Machine learning (Sam) Unit. Prior to this, I was an independent group leader at the MPI for Intelligent Systems in Tübingen (Germany) until the end of the year. I have held a German Humboldt Post-Doctoral Fellowship, and a “Minerva fast track” fellowship from the Max Planck Society. I obtained my PhD in 2014 and MSc degree in 2012 from the University Carlos III in Madrid (Spain), and worked as postdoctoral researcher at the MPI for Software Systems (Germany) and at the University of Cambridge (UK). Research interests My research focuses on developing machine learning methods that are flexible, robust, interpretable and fair. Flexible means they are capable of modeling complex real-world data, which are often heterogeneous in nature and present temporal dependencies. Secondly, I aim to improve the robustness of machine learning algorithms to outliers, missing data and mixed statistical data types. Finally, I work on making algorithms fairer and interpretable – if they are part of important decision-making processes, the outcomes should be fair and explainable. My research can be applied in a broad range of fields, from medicine and psychiatry to social and communication systems. Recently, I also began putting a special focus on consequential decision making in several domains, including hiring processes, pre-trial bail, or loan approval. Work opportunities No position open currently. More details coming soon. External links - Google Scholar profile - Saarland Infomatics Campus © 2020 Isabel Valera, Saarlan Informatics Campus",
  "content_length": 2265,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:01"
}