{
  "name": "Isabel Dietrich",
  "homepage": "https://www.isabel-wagner.net",
  "status": "success",
  "content": "Isabel Wagner Personal website of Isabel Wagner Site menu: Welcome | Tutorials | CS Posters | Personal | Welcome! I am an Associate Professor in Cyber Security at the University of Basel, Switzerland. My research focuses on privacy technologies, privacy metrics, web measurement, and smart cities. Most of this website is now maintained on my group's website at Basel. Please check my group's website at the University of Basel for current news, publications, research, and teaching! Short Bio Isabel Wagner is an Associate Professor in Cyber Security at the University of Basel, Switzerland. Dr. Wagner received her Ph.D in engineering (Dr.-Ing.) and M.Sc. in computer science (Dipl.-Inf. Univ.) from the Department of Computer Science, University of Erlangen in 2010 and 2005, respectively. In 2011 she was a JSPS Postdoctoral Fellow in the research group of Prof. Masayuki Murata at the University of Osaka, Japan. She is a Senior Member of the ACM (2017) and IEEE (2018). Her research interests are privacy and privacy-enhancing technologies, particularly metrics to quantify the effectiveness of privacy protection mechanisms, and privacy-enhancing technologies in smart cities, genomics, vehicular networks, and smart grids. She is also interested in bio-inspired mechanisms for privacy and web measurement to create transparency for corporate surveillance systems. Selected Publications Julika Feldbusch, Valentyna Pavliv, Nima Akbari and Isabel Wagner, \"No Transparency for Smart Toys,\" Proceedings of Privacy Technologies and Policy, Cham, 2024, pp. 203-227. [DOI, BibTeX, PDF and Details...] Isabel Wagner, Auditing Corporate Surveillance Systems: Research Methods for Greater Transparency, Cambridge University Press, 2022. [BibTeX, Details...] Isabel Wagner and Iryna Yevseyeva, \"Designing Strong Privacy Metrics Suites Using Evolutionary Optimization,\" ACM Transactions on Privacy and Security, vol. 24 (2), pp. Article 12 (February 2021), 35 pages, 2021. [DOI, BibTeX, PDF and Details...] Yuchen Zhao and Isabel Wagner, \"Using Metrics Suites to Improve the Measurement of Privacy in Graphs,\" IEEE Transactions on Dependable and Secure Computing, vol. 19 (1), pp. 259-274, 2022. [DOI, BibTeX, PDF and Details...] Y. Zhao and I. Wagner, \"On the Strength of Privacy Metrics for Vehicular Communication,\" IEEE Transactions on Mobile Computing, vol. 18 (2), pp. 390-403, February 2019. [DOI, BibTeX, Details...] Isabel Wagner and David Eckhoff, \"Technical Privacy Metrics: A Systematic Survey,\" ACM Comput. Surv., vol. 51 (3), pp. 57:1-57:38, June 2018. [DOI, BibTeX, PDF and Details...] David Eckhoff and Isabel Wagner, \"Privacy in the Smart City -- Applications, Technologies, Challenges and Solutions,\" IEEE Communications Surveys & Tutorials, vol. 20 (1), pp. 489-516, 2018. [DOI, BibTeX, Details...] Isabel Wagner, \"Evaluating the Strength of Genomic Privacy Metrics,\" ACM Trans. Priv. Secur., vol. 20 (1), pp. 2:1-2:34, January 2017. [DOI, BibTeX, PDF and Details...] News: September 2022: I am joining the University of Basel as an associate professor of cybersecurity | July 2022: Paper accepted at Esorics 2022 | March 2022: Book published: \"Auditing Corporate Surveillance Systems: Research Methods for Greater Transparency\" | February 2022: New Scientist article about my paper on privacy policies | January 2022: IEEE Computer Society Distinguished Visitor - webinar coming up! | November 18, 2021: Paper accepted in ACM Computing Surveys | April 4, 2021: Three encyclopedia entries published in Encyclopedia of Cryptography, Security and Privacy | February 2, 2021: Distinguished TPC Member for IEEE Infocom 2021 | November 24, 2020: Paper accepted in ACM Transactions on Privacy and Security | March 10, 2020: Paper accepted in IEEE Transactions on Dependable and Secure Computing | December 14, 2019: Paper published in Wiley Security and Privacy | July 26, 2019: Promotion to Associate Professor | April 16, 2019: Paper published in Enterprise Information Systems | October 19, 2018: IEEE Senior Member | September 6, 2018: Paper presented at Workshop on Data Privacy Management (DPM): \"Privacy Risk Assessment: From Art to Science, by Metrics\" | June 20, 2018: Paper published in ACM Computing Surveys: \"Technical Privacy Metrics: A Systematic Survey\" | June 5, 2018: Tutorial at AsiaCCS: \"Understanding and solving the privacy challenges in the smart city\" | May 4, 2018: Paper accepted in IEEE Transactions on Mobile Computing | February 26, 2018: Paper published in IEEE Comunications Surveys & Tutorials | November 2, 2017: Senior Member of the ACM | September 14, 2017: Poster series \"Inspiring Computer Scientists\" published under CC-BY-SA 4.0 | January 11, 2017: \"Evaluating the Strength of Genomic Privacy Metrics\" published in ACM Transactions on Privacy and Security | Read more » Contact: Phone: +41 (0) 61 207 05 56 Email: isabel.wagner__AT__unibas.ch Address: University of Basel Spiegelgasse 5 4051 Basel Switzerland Copyright © 2016-2025 Isabel Wagner",
  "content_length": 4992,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:03"
}