{
  "name": "Ishwar K. Sethi",
  "homepage": "https://oakland.edu/secs/directory/sethi",
  "status": "success",
  "content": "Ishwar K. Sethi, Ph.D. - School of Engineering and Computer Science - Oakland University Ishwar K. Sethi, Ph.D. School of Engineering and Computer Science Engineering Center, Room 301 115 Library Drive Rochester , MI 48309-4479 (location map) Dean's Office (248) 370-2217 Academic Advising (248) 370-2201 [email protected] School of Engineering and Computer Science Engineering Center, Room 301 115 Library Drive Rochester , MI 48309-4479 (location map) Dean's Office (248) 370-2217 Academic Advising (248) 370-2201 [email protected] Professor522 EC; (248) 370-2820; Fax: (248) 370-4625[email protected]Ph.D., Indian Institute of Technology, Kharagpur, India Joined Oakland in 1999 Professor and Chair, Computer Science and Engineering (Since August, 1999) Professor, September 1992 to August 1999, Wayne State University Visiting Professor, July 1988 to Dec. 1988, I.I.T. Delhi, India Associate Professor with Tenure, Sept. 1985 to August 1992, Wayne State University Assistant Professor, Sept. 1982 to August 1985, Wayne State University Assistant Professor, Jan. 1978 to August 1982, Dept. of Electronics, I.I.T. Kharagpur, India Indian Institute of Technology, Kharagpur (India), Ph.D., 1978 Indian Institute of Technology, Kharagpur (India), M.Tech. 1971 Indian Institute of Technology, Kharagpur (India), B.Tech., 1969 Fellow IEEE Associate Editor, IEEE Trans. Pattern Analysis and Machine Intelligence (Jan 1997 – December 2000) Associate Editor, IEEE Multimedia (July 2000 -) Associate Editor, Journal of Pattern Recognition (January 1990-) Associate Editor, Machine Vision and Applications (January 1994 -) Associate Editor, Pattern Recognition Letters (January 1996) Teaching Intro Computing with Excel Computer Vision Data mining Deep Learning Machine Learning Pattern Recognition Research Methods Research Data Mining Deep Neural Networks and Applications Machine Learning Pattern Recognition Vision Based Tracking and Surveillance Selected Publications Machine Learning Theory and Applications for Healthcare, Special Issue Co-Editor,Journal of Healthcare Engineering, Vol. 2017Computational Vision and Robotics: Proceedings of ICCVR 2014, Editor, Springer2015A Zoned Image Patch Descriptor, IEEE Signal Processing Letters, May 2015Confidence-based Active Learning, IEEE Trans. Pattern Analysis and MachineIntelligence, 2006.Classification of General Audio Data for Content-Based Retrieval, PatternRecognition Letters, April 2001Convolution-Based Edge Detection for Image/Video in Block DCT Domain, Journalof Visual Communication and Image Representation, 1996. Entropy Net: From Decision Trees to Neural Nets, Proceedings of the IEEE, 1991.Finding Trajectories of Feature Points in a Monocular Image Sequence, IEEE Trans.Pattern Analysis and Machine Intelligence, 1987. LCME Accreditation Policies and Guidelines GDPR Policy Consumer Information ©2025 Oakland University William Beaumont School of Medicine✎ Connect with Us Oakland University All Rights Reserved ✎",
  "content_length": 2978,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:05"
}