{
  "name": "Isil Dillig",
  "homepage": "http://www.cs.utexas.edu/~isil",
  "status": "success",
  "content": "Işıl Dillig | UT Austin Biography I am a professor at the Computer Science Department of the University of Texas at Austin where I lead the UToPiA research group. My primary research area is Programming Languages, with a current emphasis on program synthesis and verification. I am also a co-founder of Veridise, a blockchain/web 3 security company. I obtained all my degrees (BS, MS, PhD) in Computer Science from Stanford University. Research My primary research areas are Programming Languages and Formal Methods. I'm interested in developing techniques to make software systems more secure, reliable, and easier to build. To this end, my research primarily focuses on software analysis and verification, program synthesis, new domain-specific languages and type systems, and automated theorem proving. While I consider myself primarily a Programming Languages person, my research tends to be fairly interdisciplinary, drawing inspiration from or applying techniques to other fields such as artificial intelligence (including NLP, robotics, and machine learning), security, databases, and others. Since our research projects constantly evolve based on my students' interests, you will need to talk to me in person to learn more about current projects (or you can check out our recent publications!). Teaching I teach the following classes at UT Austin: CS311H: Honors Discrete Mathematics (Turing Scholars) Automated Logical Reasoning (Online) Team I am fortunate to work with the following group of amazing students and post-docs: Current post-docs: Eric Campbell Current PhD students: Jon Stephens, Zetten Wang, Celeste Barnaby, Noah Patton, Ruijie Fang, Shashin Halalingaiah, Maxine Xin , Robert Zhang, Anirudh Khatry, Tony (Jia) Pan , Linuz Zheng, Danny Ding Former members of my research team include: Former post-docs: Jingbo Wang , Kia Rahmani, Anders Miltner, Ruben Martins, Valentin Wuestholz Former students: Jocelyn Chen (PhD 2024), Shankara Pailoor (PhD, 2024), Ben Mariano (PhD 2024), Greg Anderson (PhD, 2023), Jiayi Wei (PhD, 2023), Ben Sepanski (MS 2022), Kostas Ferles (PhD, 2021), Yuepeng Wang (PhD, 2020), Xinyu Wang (PhD, 2019), Jia Chen (PhD, 2019), Yu Feng (PhD, 2018), Navid Yaghmazadeh (PhD, 2018), Oswaldo Olivo (PhD 2017) Service I've served as Program Committee Chair of PLDI'22, CAV'19, VMCAI'18 and several workshops. Between 2021-2024, I was also a member of the SIGPLAN Executive Committee and served as the awards co-chair. Over the years, I've served on regularly on program committees for PLDI, POPL, and OOPSLA, and CAV. I have also been serving on the Steering Committee of PLDI since 2018. Awards I am a recipient of the 2025 ACM SIGPLAN Robin Milner Award. My research has been recognized with several best or distinguished paper awards, such as at POPL'22, CHI'21, OOPSLA'20, PLDI'19, PLDI'18, OOPSLA'17, and ETAPS'17. I was also selected as a Sloan Fellow in 2015 and won an NSF CAREER award in 2015. I have also won various teaching awards, such as the UT Austin CNS Teaching Excellence Award and the \"Texas 10\" award. Personal I am an avid hiker, photographer, and scuba diver. You can check out my photos here and videos from scuba diving trips here. I really enjoy the great outdoors and discovering new places. I also enjoy swimming, trying new recipes, and chilling at home with my husband, a mathematician turned bio-informatician. I'm originally from Istanbul, Turkey and moved to California after high school. I've been living in Austin since I joined UT in 2014.",
  "content_length": 3517,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:08"
}