{
  "name": "Islem Rekik",
  "homepage": "https://basira-lab.com",
  "status": "success",
  "content": "BASIRA-LAB - Web Skip to content Brain And SIgnal Research & Analysis laboratory Develop your research skills in AI“My training has given me the tools and the confidence to understand and critically assess the contents of research papers so that I can direct my own research.” Can Gafuroğlu (Undergrad student) Applications for internships are open now. WANT TO JOIN OUR LAB ? If you are interested, please contact us and send your CV and letter of motivation to i.rekik@imperial.ac.uk Our mission The BASIRA (Brain And SIgnal Research & Analysis) Lab mission aims to develop inclusive, affordable and robust AI models and solutions that can thrive in low-to-high resource settings.  We are currently working on decreasing the compute overhead of data-hungry deep learning models across a variety of learning tasks, datasets and infrastructures. Since 2018, we pioneered the field of generative neuroAI, where we introduced the first generation of generative graph neural network models, evidenced by our 60+ peer-reviewed research projects, with application to network neuroscience to generate high-cost brain network data across time, resolutions and domains from a low-cost input. So far, our application areas include network neuroscience, connectomics, medical imaging and vision data. We are dedicated to training and empowering under-represented researchers in AI, fostering new synergies to address global challenges, such as the disparity in medical imaging.At BASIRA, we empower our members, nurture their talent, and train them to stand out. News and Events “AI: The Good, The Bad, & The Game-Changer” Book Release August 8, 2025 This project brings together a global network of voices—from leading researchers to emerging thinkers across 20+ countries—to reflect on one of the most pressing questions of our time. Read more RISE-MICCAI President Farewell April 10, 2025 Here’s my official farewell as the first (and now former) President of RISE MICCAI —2021 to 2025. Read more Imperial-X Interview with Islem Rekik February 20, 2025 Celebrating Excellence in AI! 🎉 Dr Islem Rekik (Imperial College Computing & I-X) has been awarded the prestigious Tunisian AI Award! Read more Dr Rekik receives the Tunisian AI Award 2024 January 27, 2025 Honoring Tunisia’s Top AI Pioneers Read more Back-to-Back Wins: BASIRA MSc Students Awarded Splunk Prize in 2023 & 2024 December 6, 2024 Two MSc students from our BASIRA Lab at I-X, Christopher Adnel and Kevin Mancini, have been awarded the Imperial College London Splunk Prize for Excellence for their exceptional individual projects on Graph Neural Networks (GNNs) and their Computing projects were “Distinguished”— in 2023 and 2024, respectively! Read more AI-Ready Healthcare Podcast (Spotify) July 20, 2024 Dr Rekik shares her career insights and research journey. Read more Fair Federated AI (FIFAI) Summer School 2024 June 25, 2024 We are excited to announce the successful conclusion of the “Fair Federated AI” (FIFAI) 2024 Summer School, with more than 110 global attendees all the way from Nepal to Chile! Read more See more news Islem Rekik, Ph.D. Director, BASIRA LabAssoc. Professor at Imperial College London (I-X Hub)Marie Skłodowska-Curie Horizon2020 Fellowship Alumni TUBITAK 2232 for Outstanding Researchers AwardeePresident of the RISE-MICCAI (2021-2025)Former President of Women in MICCAI (WiM) (2019-2021)For applications, please send your CV to i.rekik@imperial.ac.uk CONTACT ME Youtube Github Highlights Geng’s paper on “Metadata-Driven Federated Learning of Connectional Brain Templates in Non-IID Multi-Domain Scenarios” is accepted for publication in the journal of IEEE Transactions on Medical Imaging (IF: 9.8)!Congratulations!Oct 30, 2025 Prajit’s paper on “FireGNN: Neuro-Symbolic Graph Neural Networks with Trainable Fuzzy Rules for Interpretable Medical Image Classification” is accepted for publication in the NeurIPS 2025 Workshop!Congratulations!Sep 23, 2025 Devvrat’s paper on “HA-GNN: Learning Acyclic Hierarchies in Scientific Text with Hierarchy-Aware Graph Neural Networks” is accepted for publication in the KR’25 Conference Workshop!Congratulations!August 20, 2025 Devvrat’s paper on “Dependency Parsing-Based Syntactic Enhancement of Relation Extraction in Scientific Texts” is accepted for publication in the Main EMNLP Conference Findings!Congratulations!August 20, 2025 We have 7 papers accepted for publication in the LNCS Springer proceedings of the main MICCAI 2025 and workshops (AMAI, PRIME, GRAIL, CLIP, DGM4MICCAI), with 4 papers selected for oral presentations!Congratulations everyone!August 6, 2025 Michalis’s paper on “Predicting Infant Brain Connectivity with Federated Multi-Trajectory GNNs using Scarce Data” is accepted for publication in the Journal of  Medical Image Analysis (IF: 10.7)!Congratulations!March 3, 2025 Our FUTURE-AI Consortium paper on “FUTURE-AI: International consensus guideline for trustworthy and deployable artificial intelligence in healthcare” is accepted for publication in the BMJ (IF: 93.7)!Big congratulations to KL and all co-authors!February 20, 2025 See more highlights Search this website Type then hit enter to search",
  "content_length": 5164,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:07"
}