{
  "name": "Isma Farah Siddiqui",
  "homepage": "https://research.monash.edu/en/persons/isma-farah-siddiqui",
  "status": "success",
  "content": "Isma Farah Siddiqui - Monash University View Scopus Profile Isma Farah Siddiqui Dr Lecturer, Department of Software Systems & Cybersecurity https://orcid.org/0000-0002-2058-4336 EmailIsmaFarah.Siddiquimonashedu Accepting PhD Students 20142025 Research activity per year Personal profile Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research area keywordsInternet of Things (IoT)Distributed Data ProcessingGreen Computing Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2025 2025 2025 1 Active Projects per year ICT: Integrating Equity, Diversity, and Inclusion (EDI) into ICT Education: A GenAI-Powered Approach to Curriculum DevelopmentCheema, A. (Primary Chief Investigator (PCI)), Cosmos, A. (Chief Investigator (CI)), Arora, C. (Chief Investigator (CI)), Du, G. (Chief Investigator (CI)), Nawaz, S. (Chief Investigator (CI)), Rahayu, D. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Siddiqui, I. F. (Chief Investigator (CI)), Janjua, N. K. (Chief Investigator (CI)), Raza Khan, U. (Chief Investigator (CI)), Shibani, A. (Chief Investigator (CI)), Shah, S. A. A. (Chief Investigator (CI)) & Ulhaq, A. (Chief Investigator (CI))Australian Council of Deans of Information and Communications Technology (ACDICT)15/02/25 → 31/12/25Project: Research Research output Research output per year 2014 2017 2019 2022 2024 36 Article 15 Conference Paper 2 Review Article 1 Chapter (Book) 1 More 1 Comment / Debate Research output per year Research output per year Resource allocation-aware efficient interference management technique for ultra-dense Femto environmentGuo, W., Wang, B., Zhao, L. & Siddiqui, I. F., 1 Sept 2024, In: Computer Communications. 225, p. 120-125 6 p.Research output: Contribution to journal › Article › Research › peer-review A Fuzzy-Based Duo-Secure Multi-Modal Framework for IoMT Anomaly DetectionWagan, S. A., Koo, J., Siddiqui, I. F., Qureshi, N. M. F., Attique, M. & Shin, D. R., Jan 2023, In: Journal of King Saud University - Computer and Information Sciences. 35, 1, p. 131-144 14 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 60 Citations (Scopus) MDEV Model: A Novel Ensemble-Based Transfer Learning Approach for Pneumonia Classification Using CXR ImagesShaikh, M., Siddiqui, I. F., Arain, Q., Koo, J., Unar, M. A. & Faseeh Qureshi, N. M., 2023, In: Computer Systems Science and Engineering. 46, 1, p. 287-302 16 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 9 Citations (Scopus) Orchestrating model to improve utilization of IaaS environment for sustainable revenueBadshah, A., Ghani, A., Siddiqui, I. F., Daud, A., Zubair, M. & Mehmood, Z., Jun 2023, In: Sustainable Energy Technologies and Assessments. 57, 8 p., 103228.Research output: Contribution to journal › Article › Research › peer-review 8 Citations (Scopus) AI-Enabled Grouping Bridgehead to Secure Penetration Topics of MetaversePark, W. H., Siddiqui, I. F. & Qureshi, N. M. F., 28 Jul 2022, In: Computers, Materials and Continua. 73, 3, p. 5609-5624 16 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 8 Citations (Scopus) View all 55 research outputs Activities Activities per year 2024 2024 2025 2025 1 Editorial responsibility 1 ​Hosting an academic or industry visitor 1 Mentor/ Internship supervision Activities per year Journal of Circuits, Systems and Computers (Journal)Siddiqui, I. F. (Associate editor)2025 → …Activity: Publication peer-review and editorial work types › Editorial responsibility Decoding User Feedback: Sentiment Analysis for Enhancing Smart Home Device PerformanceSiddiqui, I. F. (Speaker) & Bodara, H. (Discussant)Nov 2024 → Mar 2025Activity: Other Teaching Engagements and non-HDR Supervisions › Mentor/ Internship supervision Muhammad Shahzad SarfarazSiddiqui, I. F. (Host)16 Oct 2024Activity: Hosting a visitor types › ​Hosting an academic or industry visitor",
  "content_length": 4503,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:09"
}