{
  "name": "Ismail Hmeidi",
  "homepage": "http://www.just.edu.jo/eportfolio/Pages/Default.aspx?email=hmeidi",
  "status": "success",
  "content": "Ismail Ibrahim Hmeidi × Sign In × JUST A-Z Sign In Faculty Member E-Portfolio Page Image Page Content ismail ibrahim hmeidi • Computer Information System Department - Faculty Member • Department of Computer Science - Faculty Member 22406 PH4 L0 Computer Information System Department hmeidi@just.edu.jo Website CV Research Gate Google Scholar Education Publications Experience Courses Activities Ph.D. of Computer Science from Illinois Institute of Technology, 1995 Msc. of Computer Science from Eastern Michigan University, 1987 Bsc. of Computer Science from Eastern Michigan University, 1986 Publications Ismail Hmeidi1,  Ghassan Kanaan2and  Martha Evens2,* , \"Design and implementation of automatic indexing for information retrieval with Arabic documents,\" Journal of the American Society for Information Science, vol. 48, no. 10, pp. 867-881, 1997 Hmeidi I, Jabri.Khalil R. and Tubashat A, \"Journal of Mathematics and Computer Sciences.,\" Journal of Mathematics and Computer Sciences., vol. 12, no. 3, pp. 219-231, 1999 E. El-Qawasmeh and I. Hemidi, \"Performance Investigation of Hamming Distance Bit Vertical Counter Applied to Associative Access Methods in Information Retrieval,\" Journal of The American Society for Information Science, USA, vol. 51, no. 5, pp. 427-432, 2000 I. Hmeidi, B. Hawashin, and E. El-Qawasmeh, \"Performance OF KNN AND SVM Classifiers on Full Word Arabic Article,\" Advanced Engineering Informatics Journal, Netherlands, vol. 22, no. 1, pp. 106-111, 2008 Hassan Najadat and Ismail Hmeidi, \"Web Spam Detection Using Machine Learning in Specific Domain Features',,\" Journal of Information Assurance and Securit, vol. 3, no. 3, pp. 220-229, 2008 Ismail Hmeidi, Ahmad Dalaleh, \"A Prediction Strategy for Decision Making of Remote Procedure Call,\" ?, International Journal of Internet Technology and Secured Transactions (IJITST), UK, vol. 1, no. 1, pp. 10-20, 2008 Amer Al-Badarneh, Qussai Yaseen, and, Ismail Hmeidi, \"A New Enhancement to the R-tree Node Splittin,\" Journal of Information Science (JIS), vol. 36, no. 1, pp. 3-18, 2010 \"Hydrocephalus classification in brain computed tomography medical images using deep learning\", Simulation Modelling Practice and Theory Salsabeel Ghassan Sa'Eed Abu Al Rub, Ahmad Imwafak Saleh Al-Aiad, Ismail Ibrahim Mefleh Hmeidi, Muhannad Qassim Mohammad Quwaider, Omar Abdelkarim Menawer Alzoubi 05/12/2022 \"Kidney Tumor Detection and Classification Based on Deep Learning Approaches: A New Dataset in CT Scans\", Journal of Healthcare Engineering Dalia Khaled Abedalaziz Alzu'Bi, Malak Abdel Ghani Mustafa Abdullah, Ismail Ibrahim Mefleh Hmeidi, Rami Shaker Abdel Razzaq Alazab, Maha Mohamed Faleh Gharaibeh, Mwaffaq Ali Husein El-Heis 22/10/2022 \"Using Deep Learning for Automatically Determining Correct Application of Basic Quranic Recitation Rules\", International Arab Journal of Information Technology Mahmoud Abdel-Karim Mahmoud Alshbool, Nooralhuda Moh'D Ali Diab Damer, Ismail Ibrahim Mefleh Hmeidi 13/04/2018 \"Automatic Arabic text categorization: A comprehensive comparative study\", Journal of Information Science Ismail Ibrahim Mefleh Hmeidi, Mahmoud Abdel-Karim Mahmoud Alshbool, Nawaf Aqbal Abdulkariam Abdulla, Abedl-Rahman Abdul-Karim M Almodawar, Raddad Dhafer Ahmed Abooraig, Nizar Abdulaziz Mahyoub Ahmed 10/11/2014 Dean, Faculty Of Computer And Information Technology, Sep 2020 - Sep 2022 Dean, Faculty Of Computer And Information Technology, Sep 2018 - Sep 2020 Deputy Head of Department, Computer Information System Department, Sep 2013 - Sep 2016 Deputy Head of Department, Department of Computer Science, Sep 2003 - Sep 2005 Deputy Head of Department, Department of Computer Science, Jul 2001 - Sep 2003 Faculty Member, Computer Information System Department, Nov 1995 - Present Full-time Lecturer, Department of Mathematics and Statistics, Jun 1995 - Nov 1995 ASSEMBLY LANGUAGE LABORATORY BASICS IN COMPUTER C PROGRAMMING(NON COLLEGE OF COMPUTER ANDINFORMATION TECHNOLOGY STUDENTS) C++ PROGRAMMING ( FOR NON COMPUTER SCIENCE INFORMATION STUDENTS) COMPUTER APPLICATIONS. COMPUTER SKILLS COMPUTER SKILLS (REMEDIAL COURSE) COMPUTER(1) :COMPUTER APPLICATIONS IN MANAGEMENT DATABASE SYSTEMS E-BUSINESS E-BUSINESS APPLICATIONS ENGLISH SKILLS IN INFORMATION TECHNOLOGY FUNDAMENTALS OF MULTIMEDIA FUNDAMENTALS OF PROGRAMMING LANGUAGES FUNDAMENTALS OF PROGRAMMING LANGUAGE INFORMATION RETRIEVAL SYSTEMS INFORMATION SYSTEMS INFORMATION TECHNOLOGY INTRODUCTION TO INFORMATION TECHNOLOGY INTRODUCTION TO INFORMATION TEGHNOLOGY Introduction to information systems PRACTICAL TRAINING PROGRAMMING IN C++ Practical training SELECTED PROGRAMMING LANGUAGE SELECTED PROGRAMMING LANGUAGES (FOR NON COMPUTER AND SCIENCE INFORMATION STUDENTS) SEMINAR IN ADVANCED COMPUTER SCIENCE SEMINAR IN ADVANCED COMPUTER SCIENCE TOPICS SOFTWARE DOCUMENTATION SYSTEM ANALYSIS AND DESIGN Data structure Information Retrieval Conference Duties Member of Technical Program Committee in the International Arab Conference on Information Technology (ACIT 2001) JUST-Jordan., Jordan, Chair Professional Memberships Faculty Member in the association (Science and Technology) Honors constellation of affiliates., 2002 Academics Academic Calendar Course Schedule Graduate Studies Resources IT Helpdesk Services Library Maharat Open Online Courses News Center Information Classification Policy Information Request Form Information & Feedback Alumni EU Projects Job Opportunities Complaints & Suggestions Newsletter Enter your email address to get the latest University news, special events and student activities delivered right to your inbox. Subscribe to JUST Newsletter ©2022, Information Technology and Communication Center. Jordan University of Science and Technology. All Rights Reserved. Contact JUST Jordan University of Science and Technology P.O.Box 3030, Irbid 22110, Jordan Tel: +962 2 7201000 Fax: +962 2 7095123 Email: public@just.edu.jo Close QS Ranking 2026 Close",
  "content_length": 5925,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:16"
}