{
  "name": "Ismail Akturk",
  "homepage": "https://faculty.ozyegin.edu.tr/ismailakturk",
  "status": "success",
  "content": "İsmail Aktürk | Assistant Professor at Özyeğin University Skip to content Welcome!Ismail is an Assistant Professor at Computer Science Department (CS) of Ozyegin University. He got his Ph.D. from the Department of Electrical and Computer Engineering at University of Minnesota, Twin Cities. Before joining Ozyegin, he was and Assistant Professor in the EECS Department of University of Missouri, Columbia. Ismail’s expertise is in Computer Architecture. He is interested in all aspect of design and implementation of energy-efficient computing systems. In particular, he focuses on unconventional computing paradigms, including (but not limited to) brain-inspired computing, and novel architectures (non-von Neumann based), such as  neuromorphic architectures in which both memory and computing  functionalities are performed spatially in the same medium without the need of transferring data between memory and computing units, back and forth (as opposed to traditional general purpose computing paradigm where computations are performed on CPUs while data resides on off-chip memory, typically DRAM). These unconventional computing paradigms and novel architectures cannot be exploited in isolation. Thus,  Ismail’s research efforts include HW/SW co-design that involves the exploitation of novel devices and advancements in algorithms used in emerging and data-intensive applications (such as deep learning). While performance (i.e., speed of computation) is one metric of interest, his group is looking for ways to increase energy efficiency of computation by developing application-specific systems with the holistic approach (from devices to algorithms) and exploiting various spatial and temporal approximations.For further information on his research and group, you check out the website of Computer Architecture and System Technologies Lab! Search for:",
  "content_length": 1861,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:08"
}