{
  "name": "Israat Tanzeena Haque",
  "homepage": "https://www.dal.ca/faculty/computerscience/faculty-staff/israat-haque.html",
  "status": "success",
  "content": "Dr. Israat Haque - Faculty of Computer Science - Dalhousie University Support Dal Current Students Faculty & Staff Family & Friends Campuses Agricultural Campus (Truro) Halifax Campuses Directory Campus Maps myDal Dal Online Brightspace OpenDal myDal Directory Maps OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal Dalhousie University Study Admissions Campus Life Libraries Research and Innovation Alumni About Dal Faculty of Computer Science For Current Students For Faculty & Staff Home About Current Students Undergraduate Graduate Research News & Events Dr. Israat Haque Associate Professor Connect with me My website My research cluster: Systems I have fellowship opportunities available Faculty of Computer Science Email: israat@dal.ca Mailing Address: Location: Room 320Faculty of Computer Science Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada Research Topics: Software-defined Networking (SDN) Cyber-physical Systems (CPS) Internet of Things (IoT) 5G/6G technologies Dr. Haque specializes in the development of cutting-edge, high-performance, secure, and dependable distributed and emerging networking systems, with a specific focus on the above domains. She is also interested in applying data-driven approaches (AI/ML) to solve practical and relevant problems. Education: PhD in Computer Science, University of Alberta MSc in Computer Science, Concordia University, Montreal Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada inquiries@cs.dal.ca Contact the Faculty of Computer Science Campus Directory Campus Map Privacy Statement Terms of Use Media Centre Contact the Faculty of Computer Science Campus Directory Campus Map Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada 902-494-2093 inquiries@cs.dal.ca",
  "content_length": 2003,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:11"
}