{
  "name": "Issa Batarseh",
  "homepage": "http://www.cecs.ucf.edu/faculty/issa-batarseh",
  "status": "success",
  "content": "Issa Batarseh - College of Engineering and Computer Science Skip to main content Return to Directory Issa Batarseh Pegasus Professor Email Department Electrical and Computer Engineering Office L3Harris Engineering Center Room 204 E-mail issa.batarseh@ucf.mail Phone 407-823-0185 (office) Florida Power Electronics Center Biography & Research Education & Specialties News & Media Biography Issa Batarseh is a Pegasus Professor in the UCF Department of Electrical and Computer Engineering. He received a bachelor's degree in electrical engineering and computer science, and master's and doctoral degrees in electrical engineering and electronics from the University of Illinois at Chicago in 1983, 1985, and 1990, respectively. Batarseh was a visiting assistant professor at Purdue University, Calumet, from 1989 to 1990 before joining UCF in 1991. Batarseh’s power electronics research focuses on the development of advanced systems for solar energy conversion to improve cost, power density, efficiency and performance. The research includes the analysis and design of high frequency DC-AC inverters, resonant converter topologies; low-voltage DC-DC converters, small signal modeling and control of PWM and resonant converters; power factor correction techniques. He is an inventor on 36 patents and author of more than 300 articles and two books, with approximately 7,000 citations to his published work. Batarseh has significant commercialization experience as a founder of two start-up companies involved solar energy conversion: Advanced Power Electronics Corp. and Petra Systems. He is also a Fellow member in National Academy of Inventors, the American Associate for the Advancement of Science and Institute of Electrical and Electronics Engineers (IEEE). He served as an associate editor for several IEEE Transactions and chaired and co-chaired several international conferences. Batarseh supervised 34 doctoral dissertations, 43 master's theses, and 15 undergraduate honor theses. Recent Publications Forthcoming Education Ph.D., Electrical and Electronics Engineering, University of Illinois at Chicago M.S., Electrical and Electronics Engineering, University of Illinois at Chicago B.S., Electrical Engineering and Computer Science, University of Illinois at Chicago Specialties Power electronics and solar energy conversion Grid-tied inverters Solar energy Photovoltaics Microinverter systems In The News IEEE Recognizes UCF Faculty for Their Contributions to Technology (January 6, 2025)",
  "content_length": 2499,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:15"
}