{
  "name": "Istvan David",
  "homepage": "https://istvandavid.com",
  "status": "success",
  "content": "Dr. Istvan David Skip to content I have one fully-funded PhD position available at the intersection of AI and model-driven engineering. [Details]I have max. two spots for EREA and/or NSERC USRA students for Summer. Reach out soon. [Contact] I am an Assistant Professor of Software Engineering at McMaster University, Canada, where I lead the Sustainable Systems and Methods Lab (SSM) and work as a researcher in the McMaster Centre for Software Certification (McSCert). My research is situated under the broader umbrella of systems engineering, with a particular interest in advanced digital technology in the overlap of model-driven engineering (MDE) and simulation, digital twins and AI.In my lab, we work on novel reinforcement learning techniques, digital twin architectures, and modeling and simulation methods. I received my PhD in Computer Science in 2019 from the University of Antwerp, Belgium, for my work on model consistency management in multi-paradigm settings with Prof. Hans Vangheluwe (ex-McGill, currently at University of Antwerp, Belgium). Afterwards, I worked as a postdoctoral researcher in the Software and Sustainability group at VU Amsterdam, the Netherlands with Prof. Ivano Malavolta; and at University of Montréal, Canada, with Prof. Eugene Syriani and Prof. Houari Sahraoui. In my Master’s years, I worked on streaming model transformations by complex event processing with the VIATRA/IncQuery team at the Budapest University of Technology and Economics, Hungary, headed by Prof. Daniel Varro (ex-McGill, currently at Linköping University, Sweden). I’m active outside of academia as well, mainly in innovation consulting. I served in multiple management and technical roles, most recently as the Head of Innovation for a multinational quality engineering corporation. Top news (click for more) ACM SIGSOFT Distinguished Paper Award at MODELS’25October 28, 2025Together with Kyanna Dagenais, we are honored to receive the ACM SIGSOFT Distinguished Paper Award at the ACM/IEEE 28th International Conference on Model Driven Engineering Languages and Systems (MODELS) for … Distinguished Reviewer Award at MODELS’25October 28, 2025I am truly honored to receive a Distinguished Reviewer Award from the ACM/IEEE 28th International Conference on Model Driven Engineering Languages and Systems (MODELS). Being invited to the Program Committee … Our PhD student Xiaoran (Sharon) Liu takes on new role in WISEOctober 23, 2025Our PhD student, Xiaoran (Sharon) Liu has been appointed as Conference Communications and Logistics Director for WISE, the McMaster Women in Science and Engineering initiative. WISE is a network of … Our lab’s showing at MODELS’25 – in numbersOctober 11, 2025This year’s MODELS conference in numbers is: one accepted foundations paper in the main track, two accepted papers for co-located and satellite events, two awards, and two workshops we led … Adwita Kashyap completes her Summer research internship at the Faculty’s Summer Research ShowcaseAugust 21, 2025Wrapping up her successful Summer coop project, Adwita Kashyap presented her work today at the Faculty’s Summer Research Showcase. Finishing only her first year in the engineering program, Adwita developed … Best Paper 2024 Runner-up in the Journal of Computer LanguagesJune 16, 2025Our journal article “Screening Articles for Systematic Reviews with ChatGPT” co-authored with Eugene Syriani and Gauransh Kumar has been in the three nominees for the 2024 Best Paper Award in the … New journal article in TOSEM on the utility of domain modeling assistance with LLMsJune 13, 2025Our journal article On the Utility of Domain Modeling Assistance with Large Language Models, co-authored with Meriem Ben Chaaben, Lola Burgueño, and Houari Sahraoui has been accepted for publication in … Panel at AST 2025 on testing for sustainability and sustainability of testingApril 25, 2025I had the pleasure to discuss this important topic with renowned colleagues at the 6th ACM/IEEE International Conference on Automation of Software Test (AST 2025). It was encouraging to see … Other news (click for more) Dr. Moira Zellner confirmed as keynote speaker at CoPaMo’25September 10, 2025Dr. Moira Zellner (Northeastern) has been confirmed as the keynote speaker of this year’s CoPaMo. Realizing the potential of community-led, science-driven participatory modeling: A case in green infrastructure planning Speaker: Dr. Moira Zellner (Northeastern University, … Accepted publication from McSCert at EDTConfAugust 24, 2025Our paper Engineering Automotive Digital Twins on Standardized Architectures: A Case Study, co-authored with colleagues at McMaster Centre for Software Certification (McSCert) has been accepted for this year’s International Conference on Engineering … New publication at MODELS’25 on developing complex model transformations by guided reinforcement learningJune 25, 2025Our paper Complex Model Transformations by Reinforcement Learning with Uncertain Human Guidance, co-authored with Kyanna Dagenais (former undergraduate and incoming graduate student in our lab) has been accepted for the … New journal article on AI simulation by digital twinsJune 6, 2025Our journal article on AI Simulation by Digital Twins: Systematic Survey, Reference Framework, and Mapping to a Standardized Architecture with Xiaoran (Sharon) Liu (PhD student in our lab) has been …",
  "content_length": 5364,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:15"
}