{
  "name": "Ivan Beschastnikh",
  "homepage": "http://www.cs.ubc.ca/~bestchai",
  "status": "success",
  "content": "Ivan Beschastnikh Ivan Beschastnikh Pronouns: he/him Associate Professor Systopia lab, SPL lab Department of Computer Science University of British Columbia bestchai@cs.ubc.ca, ICICS 327 My free/busy calendar About About me I have broad research interests that usually touch on systems and software engineering. My current projects span distributed systems, formal methods, networks, privacy, and machine learning. I enjoy building and studying real software systems and tend to be empirical in my research. You can find links to most of the software generated as part of my research on this site. In the Computer Science department, I am part of both Systopia lab and Software Practices Lab (SPL). I am also part of several other groups across UBC: Data Science Institute (DSI) Blockchain@UBC Designing for People (DFP) Research Cluster UBC ICICS Centre for AI Decision-making and Action (CAIDA) I spent my 2024-2025 sabbatical as a Visiting Researcher with Uber’s Programming Systems Team. I worked on static analysis tools for ensuring reliability of microservice-based systems. I spent my 2019-2020 sabbatical as a visiting professor, hosted by David S. Rosenblum and Abhik Roychoudhury at the National University of Singapore. I worked on a variety of topics, including fuzzing and improving reliability of neural nets in deployment. I started at UBC in 2013. Before UBC I was working on my PhD at the University of Washington in Seattle. At UW I worked with Tom Anderson, Michael Ernst, and Arvind Krishnamurthy on tools to infer models of complex systems from logs of their behavior, networked testbeds, DHTs, and other fun topics. Prior to UW, I was an undergraduate at the University of Chicago, where I was introduced to research by Pete Beckman. Here are some recent(ish) talks/interviews/etc: Emilie gave a great talk on our FSE 2024 paper on mining/interpreting Issue-PR graphs in GitHub at the Open Source Summit. April 2024. Released a co-authored CIFAR AI Insights policy document on Federated Data Access, Towards a Proportionate and Risk-Based Approach to Federated Data Access in Canada. August 2023 Compiling Distributed System Models Into Implementations with PGo, talk by Finn and Shayan on PGo, presented in the AWS Automated Reasoning Group, February 2022. Successfully Publishing your Research (Think about peer review, frequently!), talk at EuroSys Shadow PC meeting, February 2020. Compiling Distributed System Models into Implementations with PGo, talk at TLA+ Conference, September 2019. Deep Dive Into Erlay and Biscotti, Advance tech podcast, July 2019. Comparing Software Repositories Visually with RepoGrams, talk at Visualization Across UBC, April 2019. Private and secure distributed ML, FoolsGold and Biscotti (BlockML) projects, 2018. Program analysis for distributed systems, Dinv, Dara, and PGo projects, 2018. Scalable Constraint-based Virtual Data Center Allocation, talk at UC Louvain, August 2016. Mining temporal and data-temporal specifications, Texada and Quarry projects, August 2016. Helping developers make sense of distributed systems, Colloquium at Sonoma U., October 2015. Making sense of distributed systems, UBC CS FLS talk, January 2014. Modeling systems from logs of their behavior, Microsoft Research Redmond, July 2013. Here is my research statement (for my tenure review) from 2018 that summarizes my work at UBC from 2013-2018. If you intend to apply for academic jobs in CS, you may want to see my research and teaching statements (from 2013). You can also find my profiles on Google Scholar and DBLP. Projects Research projects Recent areas of focus: Using formal methods in systems, particularly distributed systems Developing novel SE tools to support systems developers Program analysis, specifically specification mining New data center designs (e.g., resource disaggregation) Private and secure distributed multi-party ML Physical insider attacks and defences Research projects sampler: PGo: source to source compiler from Modular PlusCal into Go lang. PGo compiles Modular PlusCal formal specifications into Go implementations. PGo is designed to reduce the developer burden of implementing a correct distributed system specification, and increases developers' confidence in the correctness of their implementations. Watch a video in which Finn and Shayan detail PGo. Teleoscope: a system for exploring large document sets by building machine learning workflows Teleoscope (from teleology and telescope) helps to discover purpose and meaning. The system is designed with qualitative researchers in mind, but can be used by anyone interested in exploring themes in a large dataset. The tool is publicly deployed. You can also watch a video that overviews the tool. Private and secure distributed machine learning (ML) To train multi-party ML models from user-generated data, users must provide and share their training data, which can be expensive or privacy-violating. We are exploring ways to augment state-of-the-art approaches, like federated learning, with better security/privacy (e.g., defences to sybil-based poisoning). And, we are developing brand-new distributed ML approaches that do away with centralization. LEAP: intersection of health, ML, privacy, ethics, and security We've teamed up with a group of researchers interested in topics at the intersections of health, machine learning, privacy, ethics, and security. We aspire to build usable privacy-enhancing systems that can be readily deployed in healthcare domains. We pursue a variety of projects and collaborations in different domains. Dinv: distributed system state invariant detector. (Video!) Distributed systems are difficult to debug and understand. One reasons for this is distributed state, which is not easily accessible and must be pieced together from the states of the individual nodes. Dinv statically analyzes the node source code to identify distributed state variables and then instruments the system to record these variables at runtime. After system execution Dinv uses dynamic analysis to determine consistent distributed state snapshots and infers likely distributed state invariants. NetSolver: Scalable Virtual Data Center Allocation NetSolver is an SMT-based VDC allocation tool for multi-path VDC allocation with end-to-end bandwidth guarantees. It scales to data centers with 1,000 or more servers, and can make allocations quickly enough to be applied in practice, while simultaneously improving data center utilization relative to previous work. Callback hell in JavaScript. Callbacks are a popular language features in JavaScript. However, they are also a source of comprehension and maintainability issues. The example on the left illustrates nested, anonymous callbacks, as well as asynchronous callback scheduling. Not much code, but so much complexity! We carried out a study of callbacks across 138 applications, and are developing tools to help developers manage callback hell in their applications. Our analysis code from the study is online. ShiViz and TSViz: Visualizing distributed/multi-threaded system logs. (Try ShiViz, Try TSViz) Concurrent systems generate logs that are complex and unwieldy. ShiViz helps developers understand distributed system logs through visualization. ShiViz visualizes a distributed execution that has been instrumented to record vector clock timestamps (e.g., with distributed clock instrumentation library). The visualizations are simple-to-understand and interactive. The user can understand complex system behavior by exploring the log through the visualization, comparing executions side-by-side, searching for specific behavior (by keyword and topology), and much more. TSViz, builds on ShiViz and visualizes multi-threaded logs with vector clocks and physical timestamps. Repograms: exploring and juxtaposing software repositories. Repograms is a tool for visualizing the activity in a software repositories (e.g., git). It uses a simple metaphor of multi-coloured blocks of varying sizes to encode different kinds of information about the repository. For example, each unique committer could be assigned to a colour and the sequence of blocks can reveal who works when, and how many commits each person makes. Texada: general LTL specification mining. (video) Texada is a temporal specification mining tool for extracting linear temporal logic (LTL) specifications of arbitrary length and complexity. Texada takes a user-defined LTL property type template and a log of program traces as input and outputs a set of instantiations of the property type (i.e., LTL formulas) that are true on the traces in the log. Texada is envisioned as a specification mining engine on top of which new software analyses can be developed. Perfume: Inferring performance models. (video) Perfume summarizes a system's logged executions in a performance-aware, behavioural model. Performance metrics present in logs convey vital information about most systems, yet previous model inference work ignores performance data. By leveraging this information, Perfume generates more precise models, which can help developers understand system behavior that depends on metrics like execution time, network traffic, or energy consumption. NetCheck: Diagnosing networked applications from blackbox traces. Networked applications can fail for many complex reasons having to do with the network or mis-behavior of a remote end-host. NetCheck uses traces of syscalls calls made by the application and any end-hosts that are pertinent to the application logic (e.g., the user's desktop, an SMTP server, and a DHCP server). Using these traces NetCheck reconstructs a plausible partial order of network communication without any clock synchronization. It then uses a set of rules to diagnose network issues that are apparent in the reconstructed network behavior. Distributed clocks: Augmenting logs of distributed systems with vector clocks. A major challenge in debugging distributed systems is analyzing execution logs",
  "content_length": 54347,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:20"
}