{
  "name": "Ivana Dusparic",
  "homepage": "https://www.scss.tcd.ie/Ivana.Dusparic",
  "status": "success",
  "content": "Ivana Dusparic Trinity College Dublin Ivana Dusparic Associate Professor Trinity College Dublin About Me Research Publications Teaching Contact Me About me I am an Ussher Associate Professor at the School of Computer Science and Statistics at Trinity College Dublin. I am a co-director of Center for Doctoral Training in Artificial Intelligence, and a Funded Investigator in Enable and CONNECT SFI Research Centre. My research focuses on AI-based optimisation of resources in large-scale urban infrastructures, with particular focus on Intelligent Transport Systems. News [April 2025] Looking for an intern/short-term research assistant to work on model-based RL. For more details please see Intern/short term research assistant post description. [Nov 2024] Postdoctoral researcher position available Looking for two postdoctoral reseearchers with multi-agent RL experience to join the projects within CONNECT SFI Research center . For more details please see Postdoc post description. [May 2023] Postdoctoral researcher position available - ClearWay: Advancing Deep Reinforcement Learning and Swarm Intelligence to Optimize Travel-Time Reliability in Mixed Traffic - Looking for a postdoctoral reseearcher with multi-agent RL experience to join the project . For more details please see Postdoc post description. [May 2022] New grant - ClearWay: Advancing Deep Reinforcement Learning and Swarm Intelligence to Optimize Travel-Time Reliability in Mixed Traffic - Looking for 4 PhD students and 2 postdoctoral reseearchers to join the project . For more details please see Postdoc post description and PhD post description. [February 2022] Looking for a postdoc on SATORI: Smart Networking in the Era of AI project 12-month Postdoctoral Researcher position on RL and its applications in Communications in Smart Cities and Moving Networks. For more details please see full description. o [August 2021] Launching IBM-TCD Pre-doc Fellowship in AI - 2 paid (30k+ and full EU/non-EU fees PhD positions available in Reinforcement Learning and Incremental Machine Learning. For more details please see full description. [May 2019] 30 funded PhD positions in AI available across 5 Irish universities for Sept 2019 start. If you'd like to do a PhD with me in any aspect of RL/DRL please contact me directly first before applying. For more details please see CRT in AI website. [July 2018] I am currently looking for a PhD student in AI for Smart Cities . For more details on the project and how to apply please see here. [November 2017] I am currently hiring for a Postdoc position in Intelligent Mobility/Autonomous Car Sharing for Surpass project. For more details on the project and how to apply please see here.",
  "content_length": 2705,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:26"
}