{
  "name": "Ivan Dokmanic",
  "homepage": "https://dmi.unibas.ch/de/personen/ivan-dokmanic",
  "status": "success",
  "content": "Dokmanić Ivan | Departement Mathematik und Informatik | Universität Basel Diese Webseite benötigt JavaScript, um richtig zu funktionieren. Wie aktiviere ich JavaScript in diesem Browser? English Personen Intern Suche Suche Suche Departement Mathematik und Informatik Suche Suche Suche Forschung Mathematik Informatik Scientific Advisory Board Studium Mathematik Computer Science (Informatik) Actuarial Science Data Science News & Events Departement Personen Leitung und Organisation Emeriti Ehemalige Bibliothek Kontakt Publikationen Projekte Lehrveranstaltungen Team Forschung Mathematik Informatik Scientific Advisory Board Studium Mathematik Computer Science (Informatik) Actuarial Science Data Science News & Events Departement Personen Leitung und Organisation Emeriti Ehemalige Bibliothek Kontakt Publikationen Projekte Lehrveranstaltungen Team Prof. Dr. Ivan Dokmanić Professor (FG Dokmanic (Data-Analytics))Büro Spiegelgasse 1 4051 Basel SchweizKontaktivan.dokmanic@unibas.ch+41 61 207 26 91 Website Research Group Signal and Data Analytics Associate Professor for Data-Analytics at the Department of Mathematics and Computer Science of the University of Basel My research seeks to illuminate the interplay between data science, signal processing, and physics. I work on principled machine learning and signal processing tools that address scientific challenges in computational imaging, computational acoustics, and reasoning from audiovisual data.Research InterestsSignal Processing(Scientific) Machine LearningInverse Problems and ImagingComputational Acoustics and AudioSeismic Signal ProcessingSciMLERC Starting GrantSWING (Signals, Waves, and Learning: A Data-Driven Paradigm for Wave-Based Inverse Problems) Social Media Bluesky Mastodon LinkedIn Instagram © Universität Basel Datenschutzerklärung Phil.Nat. Fakultät Impressum Nach oben",
  "content_length": 1851,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:21"
}