{
  "name": "Ivan Bjerre Damgård",
  "homepage": "https://cs.au.dk/~ivan",
  "status": "success",
  "content": "Home page of Ivan Damgård Home page of  Ivan Damgård I am a professor at the computer science department of Aarhus University. Below, you will find links, most of which are related to my main research interests: cryptography, data security, discrete math, quantum information, algorithms and complexity. Finally there are links connected to my main interest aside from work: music, and folk music in particular. Research papers 2001 or earlier, available here. For later papers, see my DBLP entry. My H-index: 55, computed using Google Scholar July 2015. New Book on Multiparty Computation With Ronald Cramer and Jesper Buus Nielsen, I have just published a new book on Information Theoretically Secure Multiparty Computation and Secret Sharing. The book is published by Cambrigde University Press. Get it here. The Provable Security Controversy In 2006-2007, a controversy started about what proofs and security reductions in cryptography actually mean and whether they are useful, a debate initiated (among others) by Koblitz and Menezes. Unfortunately, a lot of this important debate has been obscured by misunderstandings and misconceptions. In the hope of helping to clarify some of these issues, I post here my position paper on the subject, A \"Proof-Reading\" of Some Issues in Cryptography, which appeared in ICALP 2007. The version here is a slightly updated version of what appears in the proceedings. Get the PFD-file. Courses At the computer science department, I teach the following courses: The Introductory Cryptography course that runs in the fall (1.+2 .quater); and The Cryptologic Protocol Theory course that runs in the spring (3.+4. quater) The Course in Quantum Information Processing  that runs in the fall (1.+2 .quater) The dSik course, an introductory course in IT security (in Danish) that runs in the spring (4. quater) Projects, etc. I am currently involved with the following major research projects: CACE Computer Aided Cryptography Engineering CFEM Center for research in the Foundations of Electronic Markets ITSCI IT security for Citizens, see also the common site of this and two related projects. In day-to-day work, I am head of the Cryptography Group of the computer science department Business I am a co-founder and owner of Cryptomathic, a local software and consulting company in data security and cryptography I am also a co-founder of Partisia, a company doing market design and implementation, based on secure multiparty computation. Music I play primarily fiddle and guitar, mostly Danish and Nordic folk music. I am or have been involved in 4 bands: Jydsk på Næsen A 4-piece traditionally oriented band with 2 fiddles, accordion and double bass. Instrumental traditional and self-composed music for dancing and concerts. We released 1 LP, 4 CDs and several tapes and celebrated our 30 year anniversary in 2009. The home page has more info, pictures and sound clips. IntsåRing A duo with Pia Nygaard. We play nordic folk, insturmentels and songs, on fiddles, mandolin and guitar. The home page has more info, pictures and sound clips. Ostinat Expressen Originally a 4-piece band with fiddle/guitar, clarinet, accordion and double bass. After a long break, the band was revived in 2013, now including a percussionist.  On our Soundcloud page, you can hear some new demo material. The old version of the band released one CD, Waltz for a Princess. Some clips from that CD: Listeren, schottish by Julie Heebøll Waltz for a princess, by Julie Heebøll Madam Blå, hopsa by Ivan Damgård Baldrian A 4-piece band with fiddle, accordion, double bass, guitar, mandolin etc. and vocals. Not active anymore. Traditional and not so traditional folk for dancing, concerts and parties. We released one CD Zinklar. Some clips from a live recording: Reels in A (traditional Danish tunes) Øster og Vester (East and West, traditional Danish song) Brudestykker (Traditional Bridal dances from the island of Fanø)",
  "content_length": 3942,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:21"
}