{
  "name": "Ivar Farup",
  "homepage": "https://www.ntnu.edu/employees/ivar.farup",
  "status": "success",
  "content": "Ivar Farup - NTNU Ivar Farup Download press photo Download press photo Foto: Close Ivar Farup Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering ivar.farup@ntnu.no +4761135227 Ametyst-bygget, A214, Gjøvik Google Scholar Personlig webside About CV Work Experience Professor at NTNU, 2016– Professor at Gjøvik University College, 2012–2015 Associate Professor at Gjøvik University College, 2000–2012 Research Fellow at SINTEF, Oslo, 1996–2000 Researcher at FFI, 1995 Education PhD (dr. scient.) from the department of mathematics, University of Oslo, 2000 MSc (siv.ing.) in technical physics from NTH, Norway, 1994 Research Active within Colour Science Image Processing Publications 2025 Panahi, Bita; Farup, Ivar; Sole, Aditya Suneel. (2025) Modeling specular goniochromatic materials using near-specular and diffuse reflectance. Optics Express Academic article 2024 Panahi, Bita; Sole, Aditya Suneel; Farup, Ivar. (2024) Estimating Spectral BRDF Parameters Using Handheld Devices. Color and Imaging Conference (CIC) Academic article Ragoo, Luvin Munish; Farup, Ivar; Wold, Jan Henrik. (2024) Apparatus and method for measuring individual color-matching functions. Optics Express Academic article Nguyen, Mathieu; Thomas, Jean-Baptiste Denis; Farup, Ivar. (2024) Exploring Imaging Methods for In Situ Measurements of the Visual Appearance of Snow. Geosciences Academic article Nguyen, Mathieu; Thomas, Jean-Baptiste Denis; Farup, Ivar. (2024) Image-based Estimation of Physical Correlates of the Visual Appearance of Snow. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation Farup, Ivar; Rivertz, Hans. (2024) Anisotropic Diffusion in Riemannian Colour Geometry. Journal of Mathematical Imaging and Vision Academic article Ahmad, Bilal; Farup, Ivar; Floor, Pål Anders. (2024) Anisotropic Diffusion for Depth Estimation in Shape from Focus Systems. Academic chapter/article/Conference paper Ahmad, Bilal; Floor, Pål Anders; Farup, Ivar; Andersen, Casper Find. (2024) Single-Image-Based 3D Reconstruction of Endoscopic Images. Journal of Imaging Academic article Finlayson, Graham David; Farup, Ivar. (2024) Colour Meets Geometry in Colorimetric Filter Design. Color and Imaging Conference (CIC) Academic article 2023 Emblemsvåg, Jan; Krokan, Arne; Æsøy, Vilmar; Farup, Ivar; Halse, Karl Henning; Kjerstad, Øivind Kåre. (2023) Det kan ikke søkes forskingsmidler til kjernekraft: – Et sjansespill med Norges energifremtid?. Feature article Emblemsvåg, Jan; Krokan, Arne; Æsøy, Vilmar; Farup, Ivar; Halse, Karl Henning; Kjerstad, Øivind Kåre. (2023) Det kan ikke søkes forskingsmidler til kjernekraft: – Et sjansespill med Norges energifremtid?. Feature article Nguyen, Mathieu; Thomas, Jean-Baptiste Denis; Farup, Ivar. (2023) Measuring the Optical Properties of Highly Diffuse Materials. Sensors Academic article Ragoo, Luvin Munish; Farup, Ivar. (2023) A simple and cost effective colorimeter for characterising observer variability in colour matching experiments. London Imaging Meeting (LIM) Academic article Thomas, Jean-Baptiste Denis; Lapray, Pierre-Jean; Derhak, Max; Farup, Ivar. (2023) Standard representation space for spectral imaging. Color and Imaging Conference (CIC) Academic article Sagvold, Petter; Farup, Ivar; Pedersen, Marius. (2023) Spatio–Temporal Retinex–Inspired Envelopes with Anisotropic Diffusion. Journal of Imaging Science and Technology Academic article Dumoulin, Ronan; Lapray, Pierre-Jean; Thomas, Jean-Baptiste Denis; Farup, Ivar. (2023) Impact of training data on LMMSE demosaicing for Colour-Polarization Filter Array. Academic chapter/article/Conference paper Ahmad, Bilal; Farup, Ivar; Floor, Pål Anders. (2023) 3D reconstruction of gastrointestinal regions using shape-from-focus. Proceedings of SPIE, the International Society for Optical Engineering Academic article Ahmad, Bilal; Floor, Pål Anders; Farup, Ivar; Hovde, Øistein. (2023) 3D Reconstruction of Gastrointestinal Regions Using Single-View Methods. IEEE Access Academic article Trumpy, Giorgio; Andersen, Casper Find; Farup, Ivar; Elezabi, Omar Raafat Abdellatif Ahmed. (2023) Mapping Quantitative Observer Metamerism of Displays. Journal of Imaging Academic article Andersen, Casper Find; Farup, Ivar; Hardeberg, Jon Yngve. (2023) Additivity Constrained Linearisation of Camera Calibration Data. IEEE Transactions on Image Processing Academic article 2022 Prieur, Colin; Rabatel, Antoine; Thomas, Jean Baptiste; Farup, Ivar; Chanussot, Jocelyn. (2022) Machine Learning Approaches to Automatically Detect Glacier Snow Lines on Multi-Spectral Satellite Images. Remote Sensing Academic article Floor, Pål Anders; Farup, Ivar; Pedersen, Marius. (2022) 3D Reconstruction of the Human Colon from Capsule Endoscope Video. CEUR Workshop Proceedings Academic article Ahmad, Bilal; Floor, Pål Anders; Farup, Ivar. (2022) A Comparison of Regularization Methods for Near-Light-Source Perspective Shape-from-Shading. Proceedings of IEEE International Conference on Image Processing Academic article Nguyen, Mathieu; Thomas, Jean Baptiste; Farup, Ivar. (2022) Statistical Analysis of Sparkle in Snow Images. Journal of Imaging Science and Technology Academic article Ahmad, Bilal; Floor, Pål Anders; Farup, Ivar; Kresović, Milan. (2022) 3D Reconstruction of GI Regions from Single Images. CEUR Workshop Proceedings Academic article 2021 Spote, Alexandra; Lapray, Pierre-Jean; Thomas, Jean Baptiste; Farup, Ivar. (2021) Joint demosaicing of colour and polarisation from filter arrays. Academic chapter/article/Conference paper Nguyen, Mathieu; Thomas, Jean Baptiste; Farup, Ivar. (2021) Investigating the Kokhanovsky snow reflectance model in close range spectral imaging. Academic chapter/article/Conference paper Ragoo, Luvin Munish; Farup, Ivar. (2021) Optimising a Euclidean Colour Space Transform for Colour Order and Perceptual Uniformity. Academic chapter/article/Conference paper Lapray, Pierre-Jean; Thomas, Jean Baptiste; Farup, Ivar. (2021) Bio-Inspired Multimodal Imaging in Reduced Visibility. Frontiers in Computer Science Academic article Farup, Ivar. (2021) Variational Anisotropic Gradient-Domain Image Processing. Journal of Imaging Academic article 2020 Farup, Ivar. (2020) Individualised Halo-Free Gradient-Domain Colour Image Daltonisation. Journal of Imaging Academic article Sole, Aditya Suneel; Guarnera, Giuseppe Claudio; Farup, Ivar; Nussbaum, Peter. (2020) Measurement and rendering of complex non-diffuse and goniochromatic packaging materials. The Visual Computer Academic article Courtier, Guillaume; Lapray, Pierre-Jean; Thomas, Jean Baptiste; Farup, Ivar. (2020) Correlations in Joint Spectral and Polarization Imaging. Sensors Academic article Floor, Pål Anders; Farup, Ivar; Pedersen, Marius; Hovde, Øistein. (2020) Error reduction through post processing for wireless capsule endoscope video. EURASIP Journal on Image and Video Processing Academic article Mohammed, Ahmed Kedir; Farup, Ivar; Pedersen, Marius; Yayilgan, Sule Yildirim; Hovde, Øistein. (2020) PS-DeVCEM: Pathology-sensitive deep learning model for video capsule endoscopy based on weakly labeled data. Computer Vision and Image Understanding Academic article 2019 Ramirez, Aldo Mauricio Barba; Farup, Ivar; Pedersen, Marius. (2019) An Evaluation of Colour-to-Greyscale Image Conversion by Linear Anisotropic Diffusion and Manual Colour Grading. Color and Imaging Conference (CIC) Academic article Mohammed, Ahmed Kedir; Yayilgan, Sule Yildirim; Farup, Ivar; Pedersen, Marius; Hovde, Øistein. (2019) StreoScenNet: Surgical stereo robotic scene segmentation. Progress in Biomedical Optics and Imaging Academic article Sole, Aditya Suneel; Farup, Ivar; Nussbaum, Peter; Tominaga, Shoji. (2019) Erratum: Evaluating an image-based bidirectional reflectance distribution function measurement setup (Applied Optics (2018) 57 (1918?1928) DOI: 10.1364/AO.57.001918). Applied Optics Errata Sole, Aditya Suneel; Farup, Ivar; Nussbaum, Peter; Shoji, Tominaga. (2019) Evaluating an image-based bidirectional reflectance distribution function measurement setup: erratum. Applied Optics Errata 2018 Mohammed, Ahmed Kedir; Farup, Ivar; Pedersen, Marius; Hovde, Øistein; Yayilgan, Sule Yildirim. (2018) Stochastic Capsule Endoscopy Image Enhancement. Journal of Imaging Academic article Sole, Aditya Suneel; Farup, Ivar; Nussbaum, Peter; Tominaga, Shoji. (2018) Bidirectional Reflectance Measurement and Reflection Model Fitting of Complex Materials Using an Image-Based Measurement Setup. Journal of Imaging Academic article Chevallier, Emmanuel; Farup, Ivar. (2018) Interpolation of the MacAdam ellipses. SIAM Journal of Imaging Sciences Academic article Mohammed, Ahmed Kedir; Farup, Ivar; Yildirim, Sule; Pedersen, Marius; Hovde, Øistein. (2018) Variational approach for capsule video frame interpolation. EURASIP Journal on Image and Video Processing Academic article Sole, Aditya Suneel; Farup, Ivar; Nussbaum, Peter; Tominaga, Shoji. (2018) Evaluating an image-based bidirectional reflectance distribution function measurement setup. Applied Optics Academic article Simon-Liedtke, Joschua Thomas; Farup, Ivar. (2018) Multiscale Daltonization in the gradient domain. Color and Imaging Conference (CIC) Academic article Kedir, Ahmed; Yayilgan, Sule Yildirim; Farup, Ivar; Pedersen, Marius; Hovde, Øistein. (2018) Y-net: A deep convolutional neural network for polyp detection. https://arxiv.org/abs/1806.01907 Popular scientific article Moan, Steven Le; Farup, Ivar; Blahova, Jana. (2018) Towards exploiting change blindness for image processing. Journal of Visual Communication and Image Representation Academic article Thomas, Jean-Baptiste; Farup, Ivar. (2018) Demosaicing of periodic and random colour filter arrays by linear anisotropic diffusion. Journal of Imaging Science and Technology Academic article Simon-Liedtke, Joschua Thomas; Farup, Ivar. (2018) Multiscale daltonization in the gradient domain. Jo",
  "content_length": 53686,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:30"
}