{
  "name": "Ivo Grosse",
  "homepage": "https://www.informatik.uni-halle.de/arbeitsgruppen/bioinformatik/mitarbeiterinnen/grosse",
  "status": "success",
  "content": "Prof. Dr. Ivo Große Aktuelle Sprache: Deutsch switch to english version Springen Sie direkt: Zum Textanfang (Navigation überspringen) , Zur Hauptnavigation , Zur Themennavigation , Zu weiteren Einstellungen Themennavigation Studium Forschung Weiterbildung Karriere Presse International Hauptnavigation Die Universität Fakultäten Naturwissenschaftliche Fakultät III - Agrar- und Ernährungswissenschaften, Geowissenschaften und Informatik Institut für Informatik Arbeitsgruppen am Institut Bioinformatik MitarbeiterInnen Prof. Dr. Ivo Große Lehre Publikationen International Office Zentrale Einrichtungen Graduierten-Akademie Wissenschaftliche Zentren An-Institute Universitätsklinikum Kontakt Prof. Dr. Ivo Große Telefon: ++49-345-5524774 Telefax: ++49-345-5527039 Raum 4.17 Institut für Informatik Martin-Luther-Universität Halle-Wittenberg Von-Seckendorff-Platz 1 06120 Halle (Saale) Email: ivo.grosse AT informatik.uni-halle.de Sprechstunde: nach Vereinbarung Weiteres Sprache: English Schrift: größer , kleiner Login für Redakteure Prof. Dr. Ivo Große Prof. Dr. Ivo Große - AG Bioinformatik Prof. Dr. Ivo Grosse (*1969, Berlin) studierte Physik und Biophysik an der Humboldt-Universität zu Berlin (Diplom 1995) und der Boston University (Ph.D. 1999).  Er arbeitete als Postdoc auf den Gebieten der Generkennung und Promotorerkennung am Institut für Molekularbiologie und Biochemie der Freien Universität Berlin (1999 - 2000) und am Cold Spring Harbor Laboratory (2001 - 2002) sowie als Gruppenleiter auf den Gebieten der Datenintegration und der Analyse von Marker-, Sequenz-, Expressions-, Chromatin-IP- und Metabolomdaten am IPK Gatersleben (2003 - 2007).  Er leitete verschiedene Lehrveranstaltungen auf dem Gebiet der Bioinformatik am Institut für Informatik der Martin-Luther-Universität Halle-Wittenberg seit 2003 und war dort Vertretungsprofessor für Bioinformatik von 2006 bis 2007.  Seit 2007 ist er Professor für Bioinformatik am Institut für Informatik der Martin-Luther-Universität Halle-Wittenberg. Zum Seitenanfang Fußnavigation Startseite, Datenschutz, Disclaimer, Impressum, Letzte Aktualisierung: 13.01.2025 Springen Sie direkt: Zum Textanfang (Navigation überspringen) , Zur Hauptnavigation , Zur Themennavigation , Zum Seitenanfang",
  "content_length": 2253,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:27"
}