{
  "name": "Ivo F. Sbalzarini",
  "homepage": "http://mosaic.mpi-cbg.de/?q=people/ivo_sbalzarini",
  "status": "success",
  "content": "Ivo F. Sbalzarini | sbalzarini-lab.de Skip to main content You are hereHome Prof. Dr. Ivo F. Sbalzarini Group leader Lucie Weigelt Executive Assistant Krzysztof Gonciarz Research Software Engineer Serhii Yaskovets Staff Scientist Dr. Nandu Gopan CFD and Biomedical Data Science Dr. Abhishek Behera Topological Data Analysis Dr. Tommaso Bianucci High-dimensional Quadrature Alejandra Foggia Active Polar Gels on Surfaces Lennart Schulze Particle Methods in Biology Philipp Suhrcke 3D active hydrodynamics simulations Roua Rouatbi Deep Learning of Sub-Cellular Organization Dominik Sturm Data-Driven Spatial Statistics Hoang M. Dao High-Dimensional Fitness Landscapes Hiba Bensalem Spatial Bioimage AI Paulo von Petersenn Sparse Machine Learning Ivo F. Sbalzarini Prof. Dr. Ivo F. Sbalzarini Center for Systems Biology Dresden (CSBD) Prof. Dr. sc. techn. Ivo F. Sbalzarini Chair of Scientific Computing for Systems Biology Pfotenhauerstr. 108 01307 Dresden Germany Phone: +49 351 210-2525 FAX: +49 351 463-37924 E-Mail: Curriculum vitae Ivo F. Sbalzarini is a Professor on the Faculty of Computer Science of TU Dresden since 2014, where he holds the Chair of Scientific Computing for Systems Biology at the Institute of Artificial Inteligence. Ivo is also a tenured Senior Research Group Leader with the Max Planck Institute of Molecular Cell Biology and Genetics since 2012, and a Director of the Center for Systems Biology Dresden (CSBD). In addition, he is an Elected Member of the Faculty of Mathematics of TU Dresden since 2016, of the Faculty of Mechanical Science and Engineering since 2025, and he was the Dean of the Faculty of Computer Science between 2021 and 2025. He is the founder and head of the MOSAIC Group. During 1997-2002, Ivo studied Mechanical Engineering at ETH Zurich (Switzerland), with majors in Computational Fluid Dynamics and Control. In 2002 he received his Diploma (equivalent M.Sc.) in Mechanical Engineering, which was awarded the Willi Studer Prize. Between 2002 and 2006, Ivo was a Ph.D. student with the Computational Science and Engineering Lab at ETH Zurich, where he pioneered the close collaboration between Biology and Computational Science at ETH Zurich. In January 2006, he received his Doctorate in Computer Science (Dr. sc. techn.) under the supervision of Professor Petros Koumoutsakos and Professor Ari Helenius. His thesis work was awarded the Chorafas Prize for 2006 by the Dimitris N. Chorafas Foundation of the Weizmann Institute of Science. Ivo intermediately stayed at the NASA Ames Research Center, USA (2000), at the Center for Turbulence Research at Stanford University, USA (2002), and at the California Institute of Technology in Pasadena, USA (2005). In addition, he was an invited Professor of Biology at Ecole Normale Supérieure (ENS), Paris, France (2007) and a research group leader in Bioinformatics at the Mediterranean Institute for Life Sciences in Split, Croatia (2007-2008). In April 2006, Ivo was named Assistant Professor for Computational Science in the Department of Computer Science of ETH Zurich (Switzerland), where he developed and implemented the concept of a creative trans-disciplinary research group, the MOSAIC Group. In 2012, the MOSAIC Group moved from ETH Zurich to its present location in Dresden, Germany, where it became one of the four founding groups of the Center for Systems Biology Dresden (CSBD) of the Max Planck Society. In 2014, Ivo was named tenured Professor of Computer Science at TU Dresden, where he holds the Chair of Scientific Computing for Systems Biology. Ivo is a life-long honorary member of the Technical Society of Zurich (TGZ) and was a member of the workgroup \"Swiss National Strategic Plan for High Performance Computing and Networking\", advising the Federal Government of Switzerland. Ivo previously was the Vice Dean of the Faculty of Computer Science from 2014-2021 and Dean/Spokesperson of the International Max Planck Research School for Cell, Developmental, and Systems Biology (IMPRS-CellDevoSys) from 2018-2021, whose Co-Spokesperson he was before 2018. In 2021, Ivo was elected Dean of the Faculty of Computer Science. Ivo also serves on the Steering and Executive Committees of the Center for Systems Biology Dresden (CSBD), the Steering Committee of the Center for Advanced Systems Understanding (CASUS) as a representative of the Max Planck Society, and as the head of TU Dresden's Center for Advanced Modeling and Simulation (CAMS). He also is the head of the Scientific Computing and Systems Microscopy unit of the Cluster of Excellence Physics of Life (PoL) and of the Applied Data Science and AI Area in the Federal Center of Competence for Scalable Data Analytics and AI, ScaDS.AI, on whose board of directors he also serves. He is the founder of TU Dresden's international Masters Program \"Computational Modeling and Simulation\", whose coordinator and dean of studies he also was 2018-2022 and where he still coordinates the track \"Computational Life Sciences\". Ivo's work focuses on developing, applying, and teaching particle methods for image-based computational biology. This includes particle methods for multi-scale simulations, data-driven modeling, bioinspired and robust learning, and parallel high-performance computing for particle methods. Current applications revolve around the topic of Systems Biology of Development.",
  "content_length": 5362,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:28"
}