{
  "name": "Ivona Brandic",
  "homepage": "http://www.ec.tuwien.ac.at/~ivona",
  "status": "success",
  "content": "Ivona Brandic | Vienna University of Technology Foto © Luiza Puiu Univ. Prof. Dr. Ivona Brandić Head of the Research Unit for Computational Sustainability Institute for Computer Engineering TU Wien address: Favoritenstr. 9-11 2nd floor Room Nr. HE0224 1040 Vienna Austria email: ivona[at]ec.tuwien.ac.at phone: +43 (1) 58801 188761 department secretary: +43 (1) 58801 18808 fax: +43 (1) 58801 18899 consultation hour: e-mail appointment [Profile] [Research] [Teaching] [Keynotes and invited talks] [Group] [Webcasts] [Publications] [Community activities] [Media Appearance] [Projects] Profile The current focus of my research is Computational Sustainability addressing sustainable IT infrastructures and utilization of IT to build a better world. In my current projects I am developing foundational concepts of transprecision in hybrid (classic-quantum) systems (EuroPar 2023, ICLR25) and first foundational mechanisms for code-offloading in a hybrid setup (QCE24, FGCS 2024). Another focus of my current work is the development of digital twins of man-made (UCC2023, ICPADS 2024) and biological (IoT 2023) objects to maintain sustainability. During the last years I developed probabilistic and statistical methods for energy efficient resource allocation in different near-real time systems such as Edge/Cloud systems (CCGrid 2018, TPDS 2021, SIGMETRICS 2020). I developed methods for the decomposition of applications for the execution on hybrid systems such as classic/quantum systems (eScience 2022) and novel software engineering approaches for sustainable Edge applications (ASE 2023). In the past my research agenda comprised the development of QoS methods for different generations of distributed systems like Grids, Web Services, Workflows, Clouds, Multi Clouds and Edge infrastructures. During my PhD I developed novel QoS mechanisms for scientific Grid workflows such as maxillo facial surgery simulation (eScience 2005). My visit to the University of Melbourne triggered my research on SLA guaranteeing in Clouds and later on energy efficient management of ultra-scale systems (FGCS 2009). My research style is systems based. In 2012, I devised strategies for the utilization of SLAs for delivering non-trivial QoS in Clouds (FGCS 2012). Later, I have utilized control theory for the energy efficient resource allocation in IaaS Clouds and I devised novel algorithms for the energy efficient deployment of ultra-scale applications in geographically distributed massive multi Clouds (TCC 2016a, TCC 2016b). News, Announcements Open position Postdoctoral Research Position in Quantum-Classical Algorithms Congratulations Felix Zilk for receiving best paper award at ISVLSI 2025! Congratulations Sabrina Herbst for receiving Andreas Dieberger-Peter Skalicky stipend! Congratulations Sabtain Ahmand for receiving Critical Infrastructure Award 2024! Check out my TEDxTUWIEN Video about the impact of digital twins on sustainability: TEDxTUWIENYoutube May 2024: Check out my educational video on energy consumption of AI (in German), produced by the Austrian Academy of Sciences. Fäkt on Youtube March 2024: My FWF standalone project Themis -- Trustworthy and Sustainable Code Offloading -- has been accepted for funding! Dec 2023: We won best paper award at UCC 2023 for our paper A Data-driven Analysis of a Cloud Data Center: Statistical Characterization of Workload, Energy and Temperature, more details here. Nov 2023: My Master and PhD students Josip Zilic, Sabtain Ahmad, Daniel Hofstätter, and Jakob Fahringer won four scholarships from netidee foundation, which is is one of Austria's major funding campaigns for projects and theses on the internet. Sep 2023: My Master student Dahiel Hofstätter won Chair's appreciation award for junior researcher at EuroPar 2023 for our joint paper SymED: Adaptive and Online Symbolic Representation of Data on the Edge, picture 1, picture 2. We are hiring, multiple PhD positions available: details. Three papers from HPC group accepted at UCC 2022! Our paper on \"Molecular Dynamics Workflow Decomposition for Hybrid Classic/Quantum Systems\" has been accepted at (eScience 2022) to take place in Salt Lake City, USA. I am general co-chair of IC2E 2022 together with Harumi Kuno. I am joining TPC of 5th International Workshop on Edge Systems, Analytics and Networking (EdgeSys 2022) to take place in Rennes, France. I am joining TPC of 31st International ACM Symposium on High-Performance Parallel and Distributed Computing (HPDC 22) Formal CV Ivona Brandic is University Professor for High-Performance Computing Systems at the Institute of Information Systems Engineering, Vienna University of Technology (TU Wien) where she leads High Performance Computing Systems Research Group. In 2015 she was awarded the FWF START prize, the highest Austrian award for early career researchers. Since 2016 she has been a member of the Young Academy of the Austrian Academy of Sciences. From 2002 to 2007 she was Assistant Professor at the Department of Scientific Computing, University of Vienna. From 2007 to 2014 she was Assistant Professor at the Institute of Information Systems, TU Wien. She received her PhD degree in 2007 and her venia docendi for practical computer science in 2013, both from TU Wien. %From 2009 to 2012 she led the Austrian national FoSII (Foundations of Self-governing ICT Infrastructures) project funded by the Vienna Science and Technology Fund (WWTF). She was a management committee member of the European Commission's COST Action on Energy Efficient Large Scale Distributed Systems and of the COST Action on Sustainable Ultrascale Computing (NESUS). From June to August 2008 she was visiting researcher at the University of Melbourne, Australia. I. Brandic was on the Editorial Board of IEEE Magazine on Cloud Computing, IEEE Transactions on Parallel and Distributed Systems and IEEE Transactions on Cloud Computing. In 2011 she received the Distinguished Young Scientist Award from the Vienna University of Technology for her project on the Holistic Energy Efficient Hybrid Clouds. Her interests comprise virtualized HPC systems, energy efficient ultra-scale distributed systems, massive-scale data analytics, hybrid classic/quantum systems, and software engineering methods for sustasinability. She published more than 90 scientific journal, magazine and conference publications and she co-authored a text-book on federated and self-manageable Cloud infrastructures. I. Brandic co-authored the European Union's Cloud Computing report paving the future research directions of the EU. She has been serving more than 80 program committees among others Supercomputing, CCGrid, EuroPar, and IPDPS. She was invited reviewer of more than 10 renowned international journals among others IEEE Transactions on Parallel and Distributed Systems, IEEE Transactions on Service Computing, Future Generation Computer Systems, and IEEE Transactions on Computers. I. Brandic has been invited expert evaluator of the European Commission, French National Research Organization (ANR), National Science and Engineering Research Council Canada (NSERC), Netherlands Organization for Scientific Research (NWO), Australian Research Council (ARC), Research Foundation - Flanders (FWO), Ontario Research Fund, Israel Science Foundation (ISF), Portuguese national funding agency for science, research and technology (PTF) and Swedish Foundation for Strategic Research (SSF). In 2019 she chaired the CHIST-ERA panel (ANR) on Smart Distribution of Computing in Dynamic Networks (SDCDN). She is a board member of the Center for Artificial Intelligence and Machine Learning (CAIML) and a faculty member of the Vienna Center for Engineering in Medicine (ViCEM). Last changed: 17.01.2024",
  "content_length": 7727,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:28"
}