{
  "name": "J. Blustein",
  "homepage": "https://www.dal.ca/faculty/computerscience/faculty-staff/j-blustein.html",
  "status": "success",
  "content": "Dr. J. Blustein - Faculty of Computer Science - Dalhousie University Support Dal Current Students Faculty & Staff Family & Friends Campuses Agricultural Campus (Truro) Halifax Campuses Directory Campus Maps myDal Dal Online Brightspace OpenDal myDal Directory Maps OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal OpenDal Brightspace Dal Online Students Faculty & Staff Family & Friends Support Dal Dalhousie University Study Admissions Campus Life Libraries Research and Innovation Alumni About Dal Faculty of Computer Science For Current Students For Faculty & Staff Home About Current Students Undergraduate Graduate Research News & Events Dr. J. Blustein Associate Professor Connect with me My research clusters: Human-Computer Interaction, Visualization & Graphics I have fellowship opportunities available Faculty of Computer Science Email: jamie@cs.dal.ca Phone: 902-494-6104 Mailing Address: Faculty of Computer Science Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada Research Topics: Hypertext Human-computer interaction Web science Digital libraries Annotation Text analytics E-learning Sensemaking Information seeking Additional Details Homepage: http://web.cs.dal.ca/~jamie/ Location: Room 218 Education: PhD - The University of Western Ontario (1999) Titles & Honours: Cross-appointed as Associate Professor in the School of Information Management in the Faculty of Management Research Statement: I am an active researcher.  My overall goal is to help people find and use information more effectively.  I believe this goal can best be achieved through interdisciplinary and collaborative research.  Much of my research is conducted under the mantle of the HAIKU research group. Funding: CFI, NSERC, SSHRC Publications: Many of my publications are available from http://users.cs.dal.ca/~jamie/pubs/. My favourite two publications to date are J. Blustein, D. Rowe, and A.-B. Graff. Making Sense in the Margins: A Field Study of Annotation. In International Conference on Theory and Practice of Digital Libraries (TPDL) 2011 (Berlin, Germany, 25-29 Sept. 2011) TPDL 2011. DOI=http://dx.doi.org/10.1007/978-3-642-24469-8_27. Blustein, J. and Noor, M. 2004. Personal glossaries on the WWW: An exploratory study (Hypertext). In Proceedings of the 2004 ACM Symposium on Document Engineering (Milwaukee, WI, USA, 28-30 Oct.2004). DocEng '04. ACM, New York, NY, 54-56. DOI= http://doi.acm.org/10.1145/1030397.1030409. Author's copy at: http://web.cs.dal.ca/~jamie/pubs/HTML/DocEng04/. Teaching: Details about the courses I teach are at http://web.cs.dal.ca/~jamie/course/. Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada inquiries@cs.dal.ca Contact the Faculty of Computer Science Campus Directory Campus Map Privacy Statement Terms of Use Media Centre Contact the Faculty of Computer Science Campus Directory Campus Map Faculty of Computer Science, Dalhousie University 6050 University Avenue PO BOX 15000 Halifax, NS B3H 4R2 Canada 902-494-2093 inquiries@cs.dal.ca",
  "content_length": 3107,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:31"
}