{
  "name": "J. Garrett Morris",
  "homepage": "https://homepage.cs.uiowa.edu/~jgmorrs",
  "status": "success",
  "content": "J. Garrett Morris J Garrett Morris The University of Iowa introduction I am an assistant professor in the Department of Computer Science at the University of Iowa, where I lead the Iowa Foundations of Programming Group and co-lead the Computational Logic Center with Katherine Kosaian, and Cesare Tinelli. See fuller biography ❧ I am an assistant professor in the Department of Computer Science at the University of Iowa, where I lead the Iowa Foundations of Programming Group and co-lead the Computational Logic Center with Katherine Kosaian, and Cesare Tinelli. Before my current post, I was faculty at the University of Kansas, and was a postdoctoral researcher in the Laboratory for Foundations of Computer Science at the University of Edinburgh. I worked with Phil Wadler and Sam Lindley on the ABCD project, which studies the role of session types in safe concurrent and distributed programming, and contributed to the design and implementation of linear types and session types for the Links programming language. I received my Ph.D. from the computer science department at Portland State University, advised by Mark P. Jones. As part of the High Assurance Systems Programming project, I contributed to the design of the Habit programming language, particularly its class system, and to the development of the Habit compiler, particularly its typechecking and desugaring components. research group The Iowa Foundations of Programming group consists of: me, Andrew Marmaduke, Apoorv Ingle, Alex Hubers, Jason Veenendaal, and Tristan MacKinlay. We study how we construct programs and how we reason about them. Our thesis is that advances in type systems empower programmers to create better-written, better-understood programs: More precise type systems better characterize program behavior. For example, we have studied the use of substructural type systems to guarantee lock freedom in concurrent programs. More expressive type systems enable powerful, generic abstractions. For example, we have studied the use of qualified types to capture a uniform description of a variety of methods for composing records, variants, and program modules. These advances form a virtuous cycle. More precise types enable better abstractions, while expressive abstractions make precise type systems easy to use. We are always looking for new members. If you have a background in functional programming, an interest in the theory and implementation of type systems in modern functional languages, and want to pursue a PhD with us at UI, please get in touch. We am currently hiring a postdoctoral scholar to work on the foundations of type classes, type families, and extensibility. See here for more details. sponsored projects Extensible LCF-style Theorem Proving with Dependent Rows, Principal investigator. National Science Foundation. 2025–2029 This project develops new foundations for machine-verified proof in programming languages and mathematics. Formalized libraries of mathematics enable increased confidence in the correctness of proven results, large-scale collaboration on future results, and a database of relevant facts for automated reasoning. However, reuse of formalized proofs and proof components is made difficult by language limitations within theorem provers and incompatible choices between theorem provers. The projectâs novelty is a new foundational technique based on type theory, with formal tools for proof modularity and reuse at its core. The projectâs impacts are increased sharing among formalization efforts and a basis for more effectively exploring new proof theoretic foundations for mechanized theorem proving. The projectâs core contribution is a new impredicative dependent row type theory. Impredicativity captures expressive features of modern dependently typed languages, like induction-recursion, without further extension. Proof reuse is enabled by row types, used to describe extensible variants and extensible dependent records. Both object logics and constructs within them will be expressed extensible, automatically extending proof terms over simpler objects in smaller logics to apply to more complex terms in larger logics. For example, constructive proofs on groups can automatically be used as classical proofs on fields. This is NSF award 2504171; progress will be recounted here. Integrating Formal Methods into the Foundational Undergraduate Curriculum, Principal investigator. National Science Foundation. 2024–2027 Mathematics and computer science are inextricably linked. However, it is well-known among educators and education researchers that undergraduate computer scientists often do not appreciate the relevance of mathematics to their discipline. This disconnect adversely affects students, especially as they progress from concrete, practical introductory courses centered on programming to theoretical upper-level courses rooted in abstract mathematics. Researchers have observed that student performance in the classroom and retention within the major falter when these connections are not established. This projectâs impact is to address these concerns by developing pedagogy that (a) unites the mathematical foundations and practice of computer science together in a way that all undergraduates can appreciate and directly apply in their future endeavors and (b) is adoptable by as many institutions as possible, especially those with limited room to expand their curriculum. To accomplish these goals, the investigators develop, deploy, and evaluate new pedagogy that integrates formal methods techniques within the existing undergraduate computer science curriculum. Specifically, this pedagogy introduces program reasoning, an activity all computer scientists perform, as the primary vehicle for studying the mathematical foundations of computing in the contexts of introductory programming, discrete mathematics, and algorithms courses. Such pedagogy bridges the gap between mathematics and computer science for all undergraduate computer scientists and makes relevant formal methods for a new generation of programmers. Additionally, the project promotes the relevance of formal methods to undergraduate computer science educators, as exemplified by this pedagogy, through a series of workshops at the regional and national levels. This is NSF award 2422176; progress will be recounted here. A New Semantics for Type-Level Programming in Haskell, Principal investigator. National Science Foundation. 2024–2027 The project sits at the intersection of two important goals in practical and correct software development. The first is precisely and formally capturing the requirements of programs and program components: we do not want a program to rely on comparing functions for equality, or adding arbitrary integers to pointers. The second is modular and extensible program construction: program components must be developed independently, and changes internal to one component should not cause cascading changes to other components. This projectâs novelties are: a new foundation for extensible descriptions of program properties and invariants, subsuming multiple competing and complementary features used in current languages; its impementation; and its metatheory. The projectâs impacts are: regularizing and extending features for specifying program properties in existing languages; simplifying their implementation; and making these features practical for adoption in other languages. The primary focus of this project is the programming language Haskell. Haskell has an advanced type system with several features for modular and extensible specification of program properties, most prominently type classes and type families. These features have evolved mostly independently, with different approaches to their specification and implementation. The result, for both programmers and implementers, is a constellation of features with frequently surprising interactions and limitations. This project develops a new core language for Haskell, with a single feature that captures both type classes and type families. It will simplify Haskell implementations and make the existing features of Haskell more regular and more expressive. It will enable new features of Haskell, closing the gaps between type families and type classes. And, it will make it easier for other languages to adopt features from Haskell, by giving them a simpler underlying semantics. This is NSF award 2345580; progress will be recounted here. Extensibility in Theory and Practice, Principal investigator. National Science Foundation. 2021–2026 Modern software engineering relies on large ecosystems of independent software components and libraries. This poses two challenges for the design of programming languages and language tooling, both of which are addressed by this project. First, languages must support developing independent components, including identifying and abstracting reusable components from existing applications. Second, languages must provide expressive specification mechanisms to ensure that components are used correctly and that components do not have unintended interactions. The projectâs novelties are new programming language features for modular specification and implementation of program data and behavior, at all level of the software stack from user-facing applications to operating system components and hardware support. The projectâs impacts are improvements in both software reliability and programmer productivity, as the project enables language tooling to automatically help programmers identify and correctly use software components and libraries. The project has two primary themes. The first is modularity and reuse in high-level functional programs. The project develops extensible types for data and computational effects, supporting high-level abstractions including overloading, generic programming, and extensible effect handlers. The second is modularity and reuse in low-level and systems ",
  "content_length": 38005,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:36"
}