{
  "name": "J. Jim Zhu",
  "homepage": "https://www.ohio.edu/engineering/about/people/profiles.cfm?profile=zhuj",
  "status": "success",
  "content": "Jim Zhu | Ohio University Skip to main content Jim Zhu Professor Stocker Center 353 Avionics Engineering Center Center for Scientific Computing and Immersive Technologies Electrical Engineering and Computer Science zhuj@ohio.edu 740.597.1506 Dr. J. Jim Zhu is a professor in the School of Electrical Engineering and Computer Science of the Ohio University (OU) since 2000. His main research area and contribution is in time-varying linear and nonlinear systems theory and nonlinear control system design, with a focus on advanced control systems for autonomous vehicles, such as unmanned airplanes, drones, cars, marine vehicles and mobile robots, and reusable launch vehicles for space transportation. To date he has published more than 150 papers and has conducted sponsored research of more than $6M for NASA, US Air Force, NSF, etc. In particular, he served as the PI of a $4.3M contract on advanced guidance and control algorithm development for NASA’s 2nd-Generation Reusable Launch Vehicle in 2001. Holds several US and International patents on advanced flight control systems and robotic designs. Dr. Zhu is an Associate Fellow of AIAA and Senior Member of IEEE. He received the NSF Research Initiation Award in 1991. He was an AFOSR Summer Faculty Associate in 1995, a NASA Summer Research Fellow in 1999 and 2008, and a National Research Council/AFRL Summer Research Fellow in 2002 and 2005. He was a Technical Associate Editor of the Control Systems Magazine from 1996-1997, an Associate Editor of the IEEE Control System Society (CSS) Conference Editorial Board (CEB) from 1994-1997. He was the 34th CDC Program Committee Vice-Chairman for Short Papers, and the General Chair for the 28th IEEE Southeastern Symposium on System Theory (SSST). He was the Chairman/Editor of the IEEE CSS CEB and a member of the IEEE CSS Conference Activities Board from 1998-2001, and an Elected Member of the IEEE CSS Board of Governors from 2001-2003. Research Interests: nonlinear and linear time varying system theory, flight control systems, robotics All Degrees Earned: Ph.D., University of Alabama in Huntsville, 1989 Journal Article, Academic Journal (11)Zhao, Y., Zhu, J. (2016). Automatic Aircraft Loss-of-Control Prevention by Bandwidth Adaptation. Journal of Guidance, Control, and Dynamics; Online: 1-12. http://arc.aiaa.org/doi/abs/10.2514/1.G001835.Yang, X., Zhu, J. (2016). Chang Transformation for Decoupling of Singularly Perturbed Linear Time-Varying Systems. 5. New Jersey: IEEE Transaction on Automatic Control; 61: TBD.Yang, X., Zhu, J. (2016). Singular Perturbation Margin and Generalized Gain Margin for Nonlinear Time Invariant Systems. 3. International Journal of Control; 89: 451-486.Block, K., Gyllenhaal, C., Lowe, L., Amedei, A., Amin ARMR, ., Amin, A., Aquilano, K., Arbiser, J., Arreola, A., Arzumanyan, A., Ashraf, S., Azmi, A., Benencia, F., Bhakta, D., Bilsland, A., Bishayee, A., Blain, S., Block, P., Boosani, C., Carey, T., Carnero, A., Carotenuto, M., Casey, S., Chakrabarti, M., Chaturvedi, R., Chen, G., Chen, H., Chen, S., Chen, Y., Choi, B., Ciriolo, M., Coley, H., Collins, A., Connell, M., Crawford, S., Curran, C., Dabrosin, C., Damia, G., Dasgupta, S., DeBerardinis, R., Decker, W., Dhawan, P., Diehl AME, ., Dong, J., Dou, Q., Drew, J., Elkord, E., El-Rayes, B., Feitelson, M., Felsher, D., Ferguson, L., Fimognari, C., Firestone, G., Frezza, C., Fujii, H., Fuster, M., Generali, D., Georgakilas, A., Gieseler, F., Gilbertson, M., Green, M., Grue, B., Guha, G., Halicka, D., Helferich, W., Heneberg, P., Hentosh, P., Hirschey, M., Hofseth, L., Holcombe, R., Honoki, K., Hsu, H., Huang, G., Jensen, L., Jiang, W., Jones, L., Karpowicz, P., Keith, W., Kerkar, S., Khan, G., Khatami, M., Ko, Y., Kucuk, O., Kulathinal, R., Kumar, N., Kwon, B., Le , A., Lea, M., Lee, H., Lichtor, T., Lin, L., Locasale, J., Lokeshwar, B., Longo, V., Lyssiotis, C., MacKenzie, K., Malhotra, M., Marino, M., Martinez-Chantar, M., Matheu, A., Maxwell, C., McDonnell, E., Meeker, A., Mehrmohamadi, M., Mehta, K., Michelotti, G., Mohammad, R., Mohammed, S., Morre, D., Muralidhar, V., Muqbil, I., Murphy, M., Nagaraju, G., Nahta, R., Niccolai, E., Nowsheen, S., Panis, C., Pantano, F., Parslow, V., Pawelec, G., Pedersen, P., Poore, B., Poudyal, D., Prakash, S., Prince, M., Raffaghello, L., Rathmell, J., Rathmell, W., Ray, S., Reichrath, J., Rezazadeh, S., Ribatti, D., Ricciardiello, L., Robey, R., Rodier, F., Rupasinghe HPV, ., Russo, G., Ryan, E., Samadi, A., Sanchez-Garcia, I., Sanders, A., Santini, D., Sarkar, M., Sasada, T., Saxena, N., Shackelford, R., Shantha Kumara HMC, ., Sharma, D., Shin, D., Sidransky, D., Siegelin, M., Signori, E., Singh, N., Sivanand, S., Sliva, D., Smythe, C., Spagnuolo, C., Stafforini, D., Stagg, J., Subbarayan, P., Sundin, T., Talib, W., Thompson, S., Tran, P., Ungefroren, H., Vander Heiden, M., Venkateswaran, V., Vinay, D., Vlachostergios, P., Wang, Z., Wellen, K., Whelan, R., Yang, E., Yang, H., Yang, X., Yaswen, P., Yedjou, C., Yin, X., Zhu, J., Zollo, M. (2015). Designing a broad-spectrum integrative approach for cancer prevention and treatment.. Seminars in cancer biology; 35 Suppl: S276-S304.Yang, X., Zhu, J. (2015). Singular Perturbation Margin and Generalized Gain Margin for Nonlinear Time-Invariant Systems. 3. International J. of Control; 89: 451-468.Zhu, J., Yang, X., Hodel, A. (2014). Singular Perturbation Margin and Generalized Gain Margin for Linear Time Invariant Systems. International J. of Control; 88: 11-29. http://www.tandfonline.com/doi/abs/10.1080/00207179.2014.936511.Xu, X., Zhu, J., Zhang, P. (2014). The Optimal Solution of a Non-Convex State-Dependent LQR Problem and Its Applications. 4. PLoS ONE; 9: http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0094925.Zhu, J. (2013). Attitude tracking control of a quadrotor UAV in the exponential coordinates. 8. Journal of the Franklin Institute; 350: 2044-2068.Huang, R., Liu, Y., Zhu, J. (2009). Guidance, Navigation and Control System Design for a Tri-Propeller Vertical-Take-Off-and-Landing Unmanned Air Vehicle. 6. AIAA; 46: 1837-1856.Liu, Y., Zhu, J., Williams II, R., Wu, J. (2008). Omni-Directional Mobile Robot Controller Based on Trajectory Linearization. 56. Journal of Robotics and Autonomous Systems; 461-479.Liu, Y., Wu, M., Zhu, J., Lawrence, D., Gutmark, E., Myatt, H., May, C. (2008). Reactive Flow Control of Delta Wing Vortex. 3. AIAA Journal of Aircraft; 45: 880 – 892.Patent (44)Zhu, J., Sempertegui-Rosa, M. Marine Surface Vessel Trajectory Tracking Control. 18/902,224.Zhu, J., Liu, Y. SYSTEMS AND METHODS FOR USING ARTIFICIAL NEURONS AND SPIKE NEURONS TO MODEL NONLINEAR DYNAMICS AND CONTROL SYSTEMS. PCT/US24/49308.Zhu, J., Lin, L. Path planning by line of sight for tractor-trailer autonomous parking. 24009.Zhu, J., Lin, L. Path planning by line of sight for tractor-trailer autonomous parking. 24009-PROV.Zhu, J., Lin, L. Obstacle avoidance guidance for ground vehicles. US 11,904,938 B2.Zhu, J., Chen, Y. Wheeled ground vehicle rollover protection control. 23008-PCT.Zhu, J., Chen, Y. Wheeled ground vehicle rollover protection control. 23008-US.Zhu, J., Sempertegui Sosa, M. Marine Surface Vehicle (MSV) Trajectory Tracking control. TEC-24/00124.Zhu, J., Sempertegui Sosa, M. Marine Surface Vehicle (MSV) Trajectory Tracking control. 24001-PROV.Zhu, J., Liu, Y. Neuromorphic Motion and Process Controller. TEC-24/00125.Zhu, J., Liu, Y. Neuromorphic Motion and Process Controller. 24002-PROV.Zhu, J., Chen, Y. Wheeled ground vehicle rollover protection control. TEC-23/00112.Zhu, J., Chen, Y. Wheeled ground vehicle rollover protection control. 23008-PROV .Zhu, J., Chen, Y. 2.\tAutonomous Automobile Guidance and Trajectory Tracking. ZL 201780082135.9.Zhu, J., Sempertegui-Rosa, M., Randle, S. Air Data Probe. US11,566,892.Zhu, J., Chen, Y. Wheeled ground vehicle rollover prevention and mitigation control. 23008-PROV.Zhu, J., Chen, Y. Wheeled ground vehicle rollover prevention and mitigation control. TEC-23/00100 .Zhu, J., Chen, Y. Autonomous Automobile Guidance and Trajectory-Tracking. US 11,366,478.Zhu, J., Zhao, Y. Loss-Of-Control Prevention and Recovery Flight Controller. US 11,360,491.Zhu, J., Lin, L. Autonomous Parking and Obstacle Avoidance Guidance for Wheeled Ground Vehicles. OU18015.Zhu, J., Lin, L. Autonomous Parking and Obstacle Avoidance Guidance for Wheeled Ground Vehicles. OU18015.Zhu, J., Zhao, Y. Loss-of-Control Prevention and Recovery Flight Controller. OU15003.Zhu, J., Adami, T. Trajectory Tracking Flight Controller. OU09028.Zhu, J., Adami, T. Trajectory Tracking Flight Controller. OU09028.Zhu, J., Adami, T. Trajectory Tracking Flight Controller. OU09028.Zhu, J., Chen, Y. Autonomous Automobile Guidance and Trajectory Tracking, Provisional patent application. OU17014.Zhu, J., Sempertegui, M., Randle, S. Integrated Air Data Probe, Provisional patent application. OU17012.Zhu, J., Zhao, Y. Loss-of-Control Prevention and Recovery Flight Controller.Zhu, J., Wilhelm, J., Williams II, R., Uijt de Haag, M., Bartone, C., Liu, J., Chelberg, D., Liu, C., DiBenedetto, M. An Integrated, Scalable All-Weather, All-Terrain, All-Time, Autonomous Perimeter Monitoring and Ground Inspection System, Provisional patent application. OU16018.Zhu, J. Loss-of-Control Prevention and Recovery Flight Controller. OU15003 (Refiled).Zhu, J. Mutil-Modal Vehicle. US 9,132,915 B2.Zhu, J. Foldable Wing System for a Vehicle. OU9020CO (Continuation of OU9020).Zhu, J. MOTORIZED DRIVE SYSTEM AND METHOD FOR ARTICULATING A JOINT . US9097325B2.Zhu, J. Trajectory Tracking Flight Controller. ZL 2010 8 0022039.3.Zhu, J. Loss-of-Control Prevention and Recovery Flight Controller.Zhu, J. Loss-of-Control Prevention and Recovery Flight Controller.Zhu, J., Adami, T. Trajectory Tracking Flight Controller. US 8,761,966 B2.Zhu, J. Multi-Modal Vehicle. PCT/US11/35746.Zhu, J. MOTORIZED DRIVE SYSTEM AND METHOD FOR ARTICULATING A JOINT. PCT/US12/49744.Zhu, J. Elastic Cable Driven Robotic Joint. 61515485.Zhu, J. ",
  "content_length": 19850,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:39"
}