{
  "name": "J. Maurice Rojas",
  "homepage": "http://www.math.tamu.edu/~rojas",
  "status": "success",
  "content": "Prof. J. Maurice Rojas' Home Page Maurice's Home Page J. Maurice Rojas, AMS Fellow (class of 2019) Executive Associate Head for Teaching Operations, and Professor of Mathematics e-mail: lastname atsign tamu.edu Office: Blocker 305E (usually) & 620C (sometimes) Office Phone: (979) 845-7554 Fax: (979) 862-4190 Paper Mail: Department of Mathematics Texas A&M University 3368 TAMU College Station, Texas 77843 USA Full Vita Teaching Math 478: (Undergraduate) Topological Data Analysis My Teaching Before Fall 2024 Seminars of Interest The Texas A&M Algebraic Geometry Seminar (organized by Frank Sottile) The Texas A&M Algebra & Combinatorics Seminar (organized by Sarah Witherspoon) Research Interests Algorithmic Algebraic Geometry Tropical Geometry Over Complete Fields Complexity Theory Research Work You can find my research papers indexed by a full list (including supplemental software) or classified (with overlaps) by theme. The latter description contains a bit of peripheral discussion as to what my papers are about. Extremal Real Algebraic Geometry! Find out more about the Smalefest 2000 proceedings volume I co-edited with Felipe Cucker by looking at item #26 on my paper's list. Grants and Awards ``REU Site Grant: Undergraduate Research in the Mathematical Sciences and their Applications,'' ($388,556, PI is Anne Shiu, Rojas is co-PI), NSF, DMS-2150094, 5/1/2022-4/30/2025. ``Arithmetic Geometry Methods for Complexity and Communication'', ($308,005, PI at Texas A&M U: Rojas) Collaborative Research (with separately funded PIs Qi Cheng at U Oklahoma, Shuhong Gao at Clemson U, and Daqing Wan at UC Irvine), NSF, CCF-1900881, 4/1/2019-7/31/2023. ``REU Site Grant: Undergraduate Research in the Mathematical Sciences and their Applications,'' ($350,000, PIs J. Maurice Rojas and Anne Shiu), NSF, DMS-1757872, 6/1/2018-5/31/2021. John von Neumann Visiting Professor, Technische Universitat Munchen, to deliver course on Algorithmic Fewnomial Theory, Oct-Nov, 2015. ``REU Site Grant: Undergraduate Research in the Mathematical Sciences and their Applications,'' ($343,408, PIs J. Maurice Rojas and Anne Shiu), NSF, DMS-1460766, 6/1/2015-5/31/2018. ``Sparse Polynomials, Complexity, and Algorithms'', ($250,000, PI at Texas A&M U: Rojas) Collaborative Research (with separately funded PIs Qi Cheng at U Oklahoma, Shuhong Gao at Clemson U, and Daqing Wan at UC Irvine), NSF, CCF-1409020, 9/1/2014-8/31/2018. ``MCS: Randomization in Algorithmic Fewnomial Theory Over Complete Fields,'' ($400,001, PI: Rojas, co-PIs: Martin Avendano, Scott Zrebiec) Mathematics/Computer Science Interface Program, NSF, DMS-0915245, 9/1/2009-8/31/2013. ``ASCR: Topology for Statistical Modeling of Petascale Data,'' (TAMU amount $214,795, co-PI: Rojas, PI: P. Pebay of Sandia National Laboratories, and other co-PIs from University of Utah), Advanced Scientific Computing Research (Mathematics for Analysis of Petascale Data), Department of Energy, DE-SC0002505, 9/1/2009-8/31/2012. Wenner-Gren Foundation Visiting Researcher Grant (75000 Swedish Kroner), to visit and work with Mikael Passare and Boris Shapiro at Stockholm University, Sweden (awarded 12/2008, visit will be during Mar.-Jun. 2009) ``TAGS (Texas Algebraic Geometry Seminar) 2009,'' ($8690, PI: Rojas, co-PIs: J. M. Landsberg, Paulo Lima-Filho, Laura Matusevich, Frank Sottile), conference proposal, NSF, DMS-0915235, 4/1/2009-3/31/2010 NSF CAREER Award: DMS-0349309: Complexity, Reality, and Rationality in Large Nonlinear Equations Solving (9/1/04 - 8/31/09) Robust Output Sensitive Algorithms for Subanalytic Geometry: NSF Grant DMS-0211458 (jointly funded by the Computational Mathematics and Algebra/Number Theory/Combinatorics programs), 2003-2005. Degeneracy Detection for Curved Solids (co-PI with John Keyser): Incubation grant DMS-0138446 from the NSF CARGO (Computational and Algorithmic Representation of Geometric Objects) program, 2002-2003. NSF grant to co-organize (with Paulo Lima-Filho and Hal Schenck) a CBMS Lecture Series Conference during May 17-24, 2002. Journal of Complexity 2000 Best Paper Award (to be awarded at FoCM 2002). College of Science Grant (Texas A&M University), 2001-2002 Complexity and Geometric Recognition (University Grants Council, Hong Kong), 2000-2002 City U Grant (Co-investigator, with 10 other faculty from the Mathematics and Computer Science Departments): Group Research in Learning, Theory, and Applications Joint France/Hong Kong PROCORE Grant (Co-PI with Ioannis Z. Emiris of INRIA Sophia-Antipolis): Efficient Numeric and Symbolic Methods for Solving Sparse Polynomial Systems and Their Applications in Economics, 2000-2001 Polyhedral Entropy and Random p-adic Varieties (University Grants Council, Hong Kong), 1999-2001 Toric Geometric Methods for Large Real Solving (University Grants Council, Hong Kong), 1998-2000 Algebra, Algorithms, and Applications (City University of Hong Kong), 1998-1999 Polyhedral Algorithms for Fast and Stable Equation Solving (City University of Hong Kong), 1998-1999 National Science Foundation Mathematical Sciences Postdoctoral Fellowship (1995-1998) 1992 SIAM Best Student Paper Award Postdocs Timo de Wolff (Ph.D. 2013, Goethe U in Frankfurt), co-mentored with Frank Sottile, now a professor at TU Braunschweig. Harlan Kadish (Ph.D. 2011, U Michigan), co-mentored with JM Landsberg; now at Ab Initio Mounir Nisse (Ph.D. 2010, University Pierre et Marie Curie, Paris 6), co-mentored with Frank Sottile, now an associate professor at Xiamen University, Malaysia. Martin Avendano (Ph.D. 2008, U Buenos Aires; now a tenured associate professor at University of Zaragoza, Spain) Scott Zrebiec (Ph.D. 2007, JHU; now a statistical project manager at Lexis-Nexis), co-mentored with Emil Straube Current Students Weixun Deng, Ph.D. student (Mathematics) Joshua Goldstein, Ph.D. student (Mathematics) Former Students Yuyu Zhu (Ph.D. in Mathematics 2020), Research Scientist at Facebook. David Offner, (M.S. in Mathematics, 2020) Kris Watkins (M.S. in Mathematics, 2020), lecturer in mathematics at Texas A&M University. Alperen Ergür (Ph.D. in Mathematics 2016, tenure-track assistant professor at UT San Antonio; formerly a postdoc at Carnegie Mellon, Technical University of Berlin, and NC State) Sabyasachi Chakraborty (M.S. in Computer Science 2018). Emma Owusu Kwaakwah (M.S. in Mathematics 2016, now an Industrial Engineering Ph.D. student at UT Arlington) Kaitlyn Phillipson (Ph.D. in Mathematics 2016, now a tenure-track assistant professor at St. Edwards University, Austin) Korben Rusek (Ph.D. in Mathematics 2013, Senior iOS developer, A Place for Rover, Seattle) Rohun Kshirsagar (M.A. 2011) Ashraf Ibrahim (Ph.D. in Mathematics 12/2009, now a consultant at Bayer, Pittsburgh) Swaminathan Sethuraman (Ph.D. in Mathematics 5/2009, now at Credit Suisse) Michael Muzheve (M.S., 2006; Ph.D. in Mathematics Education, 2008) Theodoros Kyriopolos (M.S. in Mathematics, 12/2007) Casey Stella (M.S. in Mathematics, 2006) My Son's Web-Page My Wife (Sueli Rocha-Rojas) Defends Mothers and Babies in Hong Kong This page has been accessed at least times since the counter was last reset.",
  "content_length": 7124,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:43"
}