{
  "name": "J. M. Pierre Langlois",
  "homepage": "https://www.polymtl.ca/expertises/langlois-j-m-pierre",
  "status": "success",
  "content": "Langlois, J. M. Pierre | Répertoire des expertises Aller au contenu principal Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission Visitez-nous! Faire un don © Polytechnique Montréal 2025. Poly Bottin Cours Retour au menu principal Futur étudiant Programmes Recherche Médias Entreprises À propos Fondation et Alumni Accueil Professeurs/chercheurs Unités de recherche Projets de recherche disponibles aux étudiants des études supérieures Types d'expertise Zone étudiante Zone employé Admission © Polytechnique Montréal 2025. Répertoire des expertises Langlois, J. M. Pierre Poly Bottin Cours English Répertoire des expertises Langlois, J. M. Pierre Répertoire des expertises Retour aux résultats de recherche Modifier ma ficheAide Publications Pierre Langlois ing., PhD Publications Professeur titulaire Département de génie informatique et génie logiciel Directeur Direction des affaires académiques et de l'expérience étudiante Tél. : (514) 340-4711 poste 7191 Local : B-222.1 pierre.langlois@polymtl.ca Domaines d'expertise Matériel informatique Organisation des systèmes informatiques Traitement d'images et traitement vidéo Architecture d'ordinateur et conception Systèmes intégrés à très grande échelle (VLSI) Pôle d'excellence principal Nouvelles frontières en technologies de l'information et communications Pôle(s) d'excellence secondaire(s) Industrie du futur et société numérique Modélisation et intelligence artificielle Intérêts de recherche et affiliations Intérêts de recherche Systèmes numériques Processeurs configurables Architectures intermédiaires Réseaux pré-diffusés programmables (FPGA) et prototypage de systèmes Processeurs sur mesure pour l'internet des objets (IoT) et les calculs en périphérie Processeurs sur mesure pour la commutation dans les réseaux à haut débit et faible latence Processeurs sur mesure pour les réseaux de neurones, l'intelligence artificielle et l'apprentissage automatique Affiliation(s) Collège militaire royal du Canada, Professeur associé Ordre des ingénieurs du Québec, Membre Association for Computing Machinery (ACM), Membre IEEE, Membre Regroupement stratégique en microsystèmes du Québec, Membre Institut de valorisation des données (IVADO), Membre Type(s) d'expertises (sujets CRSNG) 2701 Matériel informatique 2702 Organisation des systèmes informatiques 2708 Traitement d'images et traitement vidéo 2719 Architecture d'ordinateur et conception 2722 Systèmes intégrés à très grande échelle (VLSI) Publications Publications récentes Communication de conférence Vaziri, M., Vakili, S., & Langlois, J. M. P. (juillet 2024). Accuracy-Aware Low-Complexity Deep Learning Models for Automatic Modulation Recognition [Communication écrite]. International Conference on Computing, Internet of Things and Microwave Systems (ICCIMS 2024), Gatineau, QC, Canada. Article de revue Vakili, S., Vaziri, M., Zarei, A., & Langlois, J. M. P. (2024). DyRecMul: Fast and Low-Cost Approximate Multiplier for FPGAs using Dynamic Reconfiguration. ACM Transactions on Reconfigurable Technology and Systems. Communication de conférence Vaziri, M., Vakili, S., Rahimifar, M. M., & Langlois, J. M. P. (septembre 2024). HENNC: Hardware Engine for Artificial Neural Network-Based Chaotic Oscillators [Communication écrite]. IEEE High Performance Extreme Computing Conference (HPEC 2024), Wakefield, MA, USA. Communication de conférence Zeghaida, A.-A., Daultani, D., Langlois, J. M. P., & David, J. P. (août 2024). Scalable Low-Complexity Implementation of Constant Matrix Multiplication Circuits [Communication écrite]. IEEE 67th International Midwest Symposium on Circuits and Systems (MWSCAS 2024), Springfield, MA, USA. Voir toutes les publications (121) Biographie Pierre Langlois est professeur titulaire au Département de génie informatique et génie logiciel de Polytechnique Montréal et directeur des affaires académiques et de l'expérience étudiante. Originaire de Sherbrooke, il détient un baccalauréat, une maîtrise et un PhD du Collège militaire royal du Canada (CMR). Il a servi comme officier du génie maritime dans la marine royale du Canada de 1990 à 1997, puis comme professeur au CMR de 1999 à 2005. Il s’est ensuite joint à Polytechnique, où il enseigne et fait de la recherche sur les processeurs sur mesure pour le traitement dans les réseaux, les algorithmes d'apprentissage automatique et le traitement vidéo. Il est auteur ou coauteur de plus de 110 articles scientifiques parus dans des revues et des comptes rendus de conférences avec comité de lecture. Comme directeur ou codirecteur de recherche, il a formé plus d'une quarantaine d’étudiants aux études supérieures dans des programmes recherche. Ses activités de recherche s’effectuent majoritairement en collaboration avec l’industrie. On lui a remis le Prix de l'excellence en enseignement du CMR en 2001, le Prix d'excellence en enseignement de Polytechnique Montréal en 2015, et un prix de l’innovation numérique au premier cycle universitaire lors du concours des Prix de la ministre en enseignement supérieur en 2022. Le professeur Langlois est membre de l'Ordre des ingénieurs du Québec, du Regroupement stratégique en microsystèmes du Québec (ReSMiQ), de l'Association for Computing Machinery (ACM) et de l'IEEE. Enseignement Voir la liste des cours de Pierre Langlois Formation Ph.D., génie informatique, Collège militaire royal, 2002 M.Sc., génie informatique, Collège militaire royal, 1999 B.Sc., génie électrique, Collège militaire royal, 1990 Encadrement à Polytechnique TERMINÉ Thèse de doctorat (10) Luinaud, T. (2022). Optimisation de la compilation de déparseurs pour processeurs réseau implémentés sur FPGA [Thèse de doctorat, Polytechnique Montréal]. Ahmadi, M. (2020). Energy-Efficient, Flexible and Fast Architectures for Deep Convolutional Neural Network Acceleration [Thèse de doctorat, Polytechnique Montréal]. Santiago da Silva, J. (2020). Fully Programming the Data Plane: A Hardware/Software Approach [Thèse de doctorat, Polytechnique Montréal]. Stimpfling, T. (2020). Mémoires associatives algorithmiques pou l'opération de recherche du plus long préfixe sur FPGA [Thèse de doctorat, Polytechnique Montréal]. Abdelsalam, A. (2019). Efficient FPGA-Based Inference Architectures for Deep Learning Networks [Thèse de doctorat, Polytechnique Montréal]. Bendaoudi, H. (2017). Flexible Hardware Architectures for Retinal Image Analysis [Thèse de doctorat, École Polytechnique de Montréal]. Vakili, S. (2014). Accuracy-Guaranteed Fixed-Point Optimization in Hardware Synthesis and Processor Customization [Thèse de doctorat, École Polytechnique de Montréal]. Farah, R. (2013). Computer Vision Tools for Rodent Monitoring [Thèse de doctorat, École Polytechnique de Montréal]. Gan, Q. (2013). Efficient Implementation of Particle Filters in Application-Specific Instruction-Set Processor [Thèse de doctorat, École Polytechnique de Montréal]. Mahvash Mohammadi, H. (2009). An effective hybrid video deinterlacing algorithm [Thèse de doctorat, École Polytechnique de Montréal]. Mémoire de maîtrise (26) Brouillard, V. P. (2023). Des milliards de flux : l'analyse d'applications à gestion d'états dans le contexte des commutateurs programmables [Mémoire de maîtrise, Polytechnique Montréal]. Ebrahimi, A. (2023). Efficient Look-Up Table Implementation of Neural Networks with Binary Activation Through Layerwise Pruning [Mémoire de maîtrise, Polytechnique Montréal]. Mohammadzadeh, R. (2023). Hardware-Aware Neural Architecture Search for Quantized Neural Networks Exploration on Resource-Constrained Devices [Mémoire de maîtrise, Polytechnique Montréal]. Richer St-Onge, P. (2022). Architecture pour la recherche exacte dans le plan des données d'un processeur réseau implémenté sur FPGA [Mémoire de maîtrise, Polytechnique Montréal]. Rousselot, A. (2022). Banc de test et protocole d'authentification pour le système d'identification automatique maritime [Mémoire de maîtrise, Polytechnique Montréal]. Traore, M. (2022). Look-Up Table Based Neural Networks For Fast Inference [Mémoire de maîtrise, Polytechnique Montréal]. Jimenez Aranda, I. (2021). Towards Improving the Security and Privacy of Discovery Protocols in IoT [Mémoire de maîtrise, Polytechnique Montréal]. Langlois, J.-G. (2021). Infrastructure de test pour la cybersécurité des systèmes maritimes [Mémoire de maîtrise, Polytechnique Montréal]. Chidambaram, S. (2019). PoET-BiN: Power Efficient Tiny Binary Neurons [Mémoire de maîtrise, Polytechnique Montréal]. Fortier, F. (2018). Estimation par analyse statique de la bande-passante d'accélérateurs en synthèse de haut niveau sur FPGA [Mémoire de maîtrise, École Polytechnique de Montréal]. Luinaud, T. (2017). Algorithmes et architectures pour l'implémentation de la détection d'expressions régulières [Mémoire de maîtrise, École Polytechnique de Montréal]. Lacroix, A. B. (2016). Implémentations logicielle et matérielle de l'algorithme Aho-Corasick pour la détection d'intrusions [Mémoire de maîtrise, École Polytechnique de Montréal]. Sarbishei, I. (2016). A Scalable High-Performance Memory-Less IP Address Lookup Engine Suitable for FPGA Implementation [Mémoire de maîtrise, École Polytechnique de Montréal]. Guigui, S. (2015). RFID : L'attaque sangsue est-elle réalisable à plus de 30 cm d'un transpondeur HF? [Mémoire de maîtrise, École Polytechnique de Montréal]. Blouin, F. (2014). Conception d'un système de vision par ordinateur pour la détection automatique d'inventaire médical [Mémoire de maîtrise, École Polytechnique de Montréal]. Fasih, M. (2014). Retinal Image Quality Assessment Using Supervised Classification [Mémoire de maîtrise, École Polytechnique de Montréal]. Keklikian, T. L. (2014). Modélisation des accès mémoire lors de la multiplication d'une matrice creuse par un vecteur sur processeur gra",
  "content_length": 18331,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:42"
}