{
  "name": "J. Michael Herrmann",
  "homepage": "http://www.research.ed.ac.uk/portal/en/persons/michael-herrmann(cf1b7c31-3a87-4812-bf0a-05cf49b0120e).html",
  "status": "success",
  "content": "Michael Herrmann - University of Edinburgh Research Explorer View Scopus Profile Michael Herrmann DR Lectureship in Robotics, School of InformaticsInstitute of Perception, Action and Behaviour Edinburgh NeuroscienceData Science and Artificial Intelligence https://orcid.org/0000-0001-6255-3944 Phone+44 131 651 7177Emailmichael.herrmanned.acukWebsitehttp://homepages.inf.ed.ac.uk/mherrman Accepting PhD Students Personal profile Research InterestsDr. Michael Herrmann's research insterests are in self-organisation, robot learning, neural avalanches, auditory system, bio-medical data analysis, metaheuristic optimisation, sensor fusion and information theory.Qualifications1988-1993 Dr. rer. nat. in Informatik, University of Leipzig  Thesis title: Hopfied-like neural networks1983-1988 Dipl.-Math., University of Leipzig  Sektion Mathematik,BiographyDr. Michael Herrmann received a Diploma (1988) from the University of Leipzig and a Doctorate for the same institution (1993). He was working as a research assistant from 1992 and as a postdoc in Denmark and Japan. His PhD focused on mathematical aspects of artificial neural networks. In 2008, after a temporary position as an assistant professor at the University of Goettingen, he was appointed to the post of Lecturer in Robotics at the School of Informatics at the University of Edinburgh. Dr. Herrmann is currently principal supervisor for five PhD students at the University of Edinburgh and has acted as principal or co-supervisor for ten successful PhD students mainly at the University of Goettingen. He has also supervised several MSc students. In recent years, he has taught courses on reinforcement learning for MSc and final year undergraduates, as well as on natural computing for third year undergraduates and is co-teaching an introductory course on vision and robotics also for third year undergraduates. Fingerprint Dive into the research topics where Michael Herrmann is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 4 Similar Profiles Neural Network Computer Science 100% Robot Computer Science 78% Manifold Mathematics 76% Criticality Computer Science 59% Organizing Map Mathematics 56% Organized Criticality Computer Science 39% Prosthesis Engineering 39% Self-Organization Engineering 36% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 89 Article 45 Conference contribution 14 Chapter 3 Poster 9 More 3 Meeting abstract 2 Preprint 1 Chapter (peer-reviewed) 1 Letter 1 Literature review 1 Working paper Research output per year Research output per year Co-designing educational robotic pet concepts with animal welfare educators and childrenVoysey, I., Baillie, L., Williams, J. & Herrmann, M., 13 Oct 2025, (E-pub ahead of print) In: International Journal of Social Robotics. 27 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Robot 100% Participatory Design 100% Animal Welfare 100% Facial Feature 50% Design Challenge 50% The prevalence and potential problem of cuteness in zoomorphic robotsVoysey, I. (Lead Author), Baillie, L., Williams, J. M. & Herrmann, J. M., 22 Aug 2025, (Accepted/In press) In: ACM Transactions on Human-Robot Interaction. 3767724.Research output: Contribution to journal › Article › peer-review Open Access Dog Breed 100% Animal Well-Being 100% Canis 100% Preference 100% Pawsitive patch: Using a robotic dog in children's animal welfare educationVoysey, I., Baillie, L., Williams, J. M. & Herrmann, J. M., 23 Jun 2025, IDC '25: Proceedings of the 24th Interaction Design and Children. ACM, p. 715-727 13 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Education 100% Intrinsic Motivation 100% Interpretability by Design for Efficient Multi-Objective Reinforcement LearningXia, Q. & Herrmann, J. M., 4 Jun 2025, University of Edinburgh, p. 1-18, 18 p.Research output: Working paper › Preprint Scheme 100% Solution Domain 33% Parameter Vector 33% Linear Map 33% Beyond jamming grippers: Granular material in roboticsLi, H., Sun, J. & Herrmann, J. M., 21 May 2024, (E-pub ahead of print) In: Advanced Robotics.Research output: Contribution to journal › Literature review › peer-review Open AccessFile Granular Material 100% Granular Matter 25% View all 160 research outputs",
  "content_length": 4680,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:42"
}