{
  "name": "J. P. Misra",
  "homepage": "http://www.bits-pilani.ac.in/pilani/computerscience/Faculty",
  "status": "success",
  "content": "Computer Science - BITS Pilani Campus Header Institute Header Home Academics Integrated first degree B.E.(Manufacturing Engineering) M.Sc.(Mathematics) M.Sc.(Chemistry) M.Sc.(General Studies) M.Sc.(Biological Sciences) M.Sc.(Physics) M.Sc.(Economics) B.E.(Mechanical) B.E.(Civil) B.E.(Electronics and Instrumentation) B.E.(Electronics and Communication) B.E.(Electrical and Electronics) B.E.(Chemical) B.Pharm.(Pharmacy) B.E.(Computer Science) Higher Degree M.E.(Sanitation Science, Technology and Management) M.E. Chemical Engineering (with specialization in Petroleum Engineering) M.E.(Chemical) MBA(Master of Business Administration In Business Analytics) Master in Public Health M.Sc. General Studies – Communication and Media Studies Stream M.E. (Mechanical with specialization in Thermal Engineering) M.E.(Software Systems) M.E. M.Pharm M.Pharm.(Pharmacology) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmacy) M.E.(Design Engineering) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E.(Microelectronics) M.E.(Mechanical) M.E.(Manufacturing Systems Engineering) M.E.(Embedded Systems) M.E. Electronics & Control M.E.(Computer Science) M.E.(Communication Engineering) M.E. Civil – Water Resource Engineering M.E.(Civil with specialization in Transportation Engineering) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Biotechnology) M.E.(Environmental Engineering) Doctoral Programmes Pharmacy Physics Civil Engineering Computer Science & Information Systems Electrical & Electronics Engineering Biological Sciences Chemical Engineering Chemistry Economics & Finance Humanities & Social Sciences Mathematics Mechanical Engineering Management WILP Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Department Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Faculty Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Students Student Activities Events & Festivals BITScan BITS Embryo Picture Gallery Convocation 2025 BITS BEAT Student Achievements Student Services Academic Counseling Academic Document/Verification Requests Student Facilities Student Welfare Procedure for Issurance of Duplicate Degree Anti Ragging Scrutiny of Grades Information for Prospective Students Prevention of Sexual Harassment Centers Teaching Learning Centre Centre for Women’s Studies Centre for Entrepreneurial Leadership Centre for Desert Development Technologies Centre for Robotics and Intelligent Systems Technology Business Incubator Central Instrumentation Facility AI Centre Alumni Quick Links Academic Counselling Center Medical Center Library e-services Outreach IT Services Unit Central Workshop Campus Pilani Dubai K K Birla Goa Hyderabad BITSoM, Mumbai BITS Law School, Mumbai Links For BITS Library Admissions Faculty Practice School Placements Student Arena Career News Alumni Internationalization Events MOUs Current Students Invest in Leaders Outreach Picture Gallery Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions BITSAT IMPORTANT CONTACTS Pilani Dubai Goa Hyderabad RESEARCH & INNOVATION Overview Sponsored Research Projects Consultancy Based Projects Patents Publications R&D Centers DEPARTMENTS Pilani Dubai Goa Hyderabad Academics Integrated First Degree B.E.(Chemical) B.E.(Civil) B.E.(Computer Science) B.E.(Electrical and Electronics) B.E. (Electronics and Computer ) B.E.(Electronics and Communication) B.E.(Electronics and Instrumentation) B.E.(Manufacturing Engineering) B.E.(Mechanical) B.Pharm.(Pharmacy) M.Sc.(Biological Sciences) M.Sc. Semiconductor and Nanoscience B.E. Environmental and Sustainability Engg. M.Sc.(Chemistry) M.Sc.(Economics) M.Sc.(General Studies) M. Sc. (Mathematics) M.Sc.(Physics) B. E. (Mathematics and Computing) Higher Degree MBA (Master of Business Administration) M.E.(Electrical with specialization in Power Electronics and Drives) M.E. Civil – Water Resource Engineering MBA (Master of Business Administration) MBA (Master of Business Administration in Business Analytics) M.E.(Communication) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E. (Mechanical with specialization in Thermal Engineering) M.E. Electronics & Control M.E. M.Pharm M.E.(Biotechnology) M.E.(Chemical) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Transportation Engineering) M.E.(Computer Science) M.E.(Design Engineering) M.E.(Embedded Systems) M.E.(Manufacturing Systems Engineering) M.E.(Mechanical) M.E. Environmental engineering M.E.(Microelectronics) M.E.(Sanitation Science, Technology and Management) M.E.(Software Systems) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmacology) M.Pharm.(Pharmacy) M.Sc. General Studies – Communication and Media Studies Stream Master in Public Health MBA(Master of Business Administration In Business Analytics) Doctoral Programmes Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities & Social Sciences Management Mathematics Mechanical Engineering Pharmacy Physics General Sciences WILP Dubai Campus Integrated First Degree Higher Degree Doctoral Programmes Explore BITS About Legacy Achievements Social Responsibility Sustainability Divisions Pilani Dubai K K Birla Goa Hyderabad Mumbai Pilani K K Birla Goa Hyderabad Dubai follow us Feedback Give us your feedback If you notice any issues or missing content, please let us know. Your feedback helps us improve. Thank you. Upload Screenshot Department of Computer Science 🌊 Call for Junior Research Fellow (JRF) —Department of Civil Engineering, BITS Pilani, Pilani Campus 🌿 Pilani Admission to the Ph.D Programme (Full-time and Part-time) in Pilani, Goa and Hyderabad Campuses of BITS Pilani for Second Semester, Academic Year 2025-26 is now open. Pilani Admission to the Ph.D. Program (Full-time and Part-time) in the Department of CSIS at BITS Pilani, Pilani Campus, for the Second Semester, Academic Year 2024-25, is now open. Pilani Research Talk on AI Infrastructure with Dr. Puneet Sharma, Director of the Networking and Distributed Systems Lab at Hewlett Packard Labs, USA to be hosted by BITS Pilani CSIS Department on September 23, 2024. Pilani Joint PhD program at BITS Pilani and La Trobe University, Australia Pilani JOINT Ph.D. SCHOLARSHIP – BITS PILANI AND RMIT UNIVERSITY, AUSTRALIA Pilani JOINT Ph.D. SCHOLARSHIP – BITS PILANI AND RMIT UNIVERSITY, AUSTRALIA Pilani JOINT PH.D. SCHOLARSHIP – BITS PILANI AND RMIT UNIVERSITY, AUSTRALIA Pilani Indian Workshop on Applied Deep Learning (IWADL2019) Pilani International Workshop on Data Analytics & Applications Pilani INDO – CHILE Workshop on BIG Data Pilani Workshop on Blockchain Technology And Applications Pilani Indian Workshop on Applied Deep Learning (IWADL2019) Pilani One day Workshop on Blockchain Technology and Applications Pilani International conference on Intelligent Human Computer Interaction-IHCI-2016 Pilani Indo-Chile Workshop on Big Data 2014 (ICWBD) Pilani International Workshop on Data Analytics & Applications 2013 (IWDAA) Pilani Workshop on Introduction to Graphs and Geometric Algorithms Pilani The Department of Computer Science was established in the year 1971 and is one of the earliest Computer Science & Engineering departments in the country. Currently, it has 25 faculty members and over 800 students working towards their Bachelor’s, Master’s and Doctoral degrees. In addition, it actively participates in select off-campus programmes. The department attracts high quality students from all over India and has an impressive placement record. Many of graduates choose to join some of the best institutions of higher learning around the world, whereas some prefer to gain a few years of work experience before deciding their next course of action. Still some others choose to chase their dream taking a path that is less travelled like taking the social welfare route or liberal arts based vocations. One of the strengths of the department is its strong entrepreneurial culture and many students have successfully involved themselves in creating entrepreneurial ventures some of which have gone fully commercial within a short span of time. While some such students benefit from the on-campus Technology Business Incubator provided by the Institute, some others choose to create virtual organizations to keep the costs low and later move onto the regular business models. In the recent past, we had benchmarked our curriculum with select institutions of higher learning around the world and currently we are carefully reviewing the impact of these consequent changes with a view to make our programmes even more strong and competitive. In the past, the department has attracted unrestricted research grants as well as competitive research grants from several sources including national funding agencies (DST, DEITY-MCIT, DEC, UGC, ATB and CAIR), International funding agencies (European Commission, MFA-Government of France) as well as from corporate research laboratories (Microsoft Research (Redmond), Microsoft Research (India), IBM, CISCO, TCS, Digital Think",
  "content_length": 31209,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:44"
}