{
  "name": "J. Ross Beveridge",
  "homepage": "http://www.cs.colostate.edu/~ross",
  "status": "success",
  "content": "Homepage for Ross Beveridge Home Teaching Research Biography Personal CS Roo Homepage for Ross Beveridge Contact information: J. Ross Beveridge Computer Science Department Colorado State University Fort Collins, CO 80523-1873 Phone: 970 491-5877 Email: Ross.Beveridge@colostate.edu Office: CSB Room 348 I am a Professor in the Computer Science Department at Colorado State University. The best part of being a professor is the balance between teaching and research. Teaching provides immediate gratification: there is always a new lecture to prepare and always new and inquisitive students to question us as they learn. Both what we teach and how we teach is constantly changing, and the intellectual give-and-take with students is invigorating. Balancing the immediacy of teaching is research. I work in an area called computer vision. People can visually see and recognize objects effortlessly. For example, a person can instantly recognize a squirrel on a log. The goal of computer vision is to develop machines that can do this just like people do. Much of my own work on computer vision has been done in partnership with my colleague Bruce Draper; the two of us jointly run the Computer Vision Group at CSU. Our recent research is centered enhanced humman machine communication through shared context including mutual understanding of physical presence non-verbal communication. My most up-to-date list of publications is available through Google Scholar. Zoom Office hours for Spring 2021: 12:20 to 1:00 PM Tue/Thur email me for Zoom link Recent Teaching Spring 2021 CS 345 Machine Learning Foundations and Practice Fall 2020 CS 410 Computer Graphics Odds and ends ... Time Well Spent hits head on how our attention is too often a commondity 'bought'; often leaving us the poorer. \"Your disability is your opportunity\" - Kurt Hahn. I owe great deal to this man's ideas and good work. Finale. A musically inclined penguin from 2004 (1st place video) - even now still makes me smile. A Notable Passage from Charlotte's Web by E.B. White.. Humor in the face of momentary ignorance helps. Your IP is 169.150.222.76 You are browsing with webkit on mac\t\t Why tell me this? Colorado State University, Fort Collins, CO 80523 USA © 2021 Colorado State University",
  "content_length": 2259,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:44"
}