{
  "name": "J. Shane Culpepper",
  "homepage": "https://researchers.uq.edu.au/researcher/41331",
  "status": "success",
  "content": "Professor Shane Culpepper | UQ Experts Skip to menu Skip to content Skip to footer Professor Shane Culpepper Email: s.culpepper@uq.edu.au Positions Affiliate of Centre for Enterprise AI Centre for Enterprise AI Faculty of Engineering, Architecture and Information Technology Professor in Artificial Intelligence School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background Shane Culpepper is a Professor of Artificial Intelligence at the University of Queensland in St. Lucia, Australia. Before joining the University of Queensland in 2023, Professor Culpepper held a continuing academic position at RMIT University in Melbourne, Australia. He received his PhD in Computer Science from the University of Melbourne in 2008. His research focuses primarily on building better Search and Recommendation Systems and is primarily interested how to responsibly integrate efficient and scalable generative AI models for search, recommendation, and question answering. Professor Culpepper’s work has applications in a number of downstream applications for Legal, Health, real estate speculation. He has been instrumental in founding the AI Research Network and the Research Center for Enterprise AI at the University of Queensland. Over his 17 year career, Professor Culpepper has supervised 19 PhD students and co-authored more than 140 peer reviewed papers with 132 different research collaborators on problems that range from core basic research, such as algorithm efficiency and scalability, to practical real world problems on building and deploying new machine learning algorithms for search and recommendation systems. While often technical, his work is always user-driven as humans are the main consumers of this technology. This user-centric research focus has led to several papers on controlled user studies which guide the development of better evaluation techniques which model human behaviour. In the last 5 years, Professor Culpepper has been a program co-chair for international conferences such as SIGIR and CIKM, and co-organized conferences such as WSDM and SWIRL. Professor Culpepper previously held an ARC DECRA fellowship in 2013 as well as an RMIT Vice-Chancellor's Principal Researcher fellowship in 2017. Before joining the University of Queensland. Professor Culpepper was the founding director of the Centre for Information Discovery and Data Analytics at RMIT University. In total, he has been a chief investigator on 11 research grants totalling ~$3.8 Million AUD. Read more Read less Availability Professor Shane Culpepper is: Available for supervision Media expert Fields of research Artificial intelligence Data engineering and data science Data management and data science Deep learning Information and Computing Sciences Information retrieval and web search Machine learning Natural language processing Neural networks Query processing and optimisation Recommender systems Semi- and unsupervised learning Qualifications Doctor of Philosophy of Computer Science, University of Melbourne Member, Association for Computing Machinery, Association for Computing Machinery Honorary Fellow, RMIT University, RMIT University Works Search Professor Shane Culpepper’s works on UQ eSpace All (121) Journal Article (30) Conference Publication (90) Book Chapter (1) 2025 Conference Publication The effects of demographic instructions on LLM personas Magnossão de Paula, Angel Felipe, Culpepper, J. Shane, Moffat, Alistair, Pathiyan Cherumanal, Sachin, Scholer, Falk and Trippas, Johanne (2025). The effects of demographic instructions on LLM personas. 48th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (ACM SIGIR 2025), Padua, Italy, 13-18 July 2025. New York, NY, United States: Association for Computing Machinery. doi: 10.1145/3726302.3730255 The effects of demographic instructions on LLM personas 2025 Conference Publication IR for AAC Users: A Hyperdimensional Computing (Vector Symbolic Architectures) approach Briegel, Hunter, Pagal, Maya and Culpepper, J. Shane (2025). IR for AAC Users: A Hyperdimensional Computing (Vector Symbolic Architectures) approach. 48th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (ACM SIGIR 2025), Padua, Italy, 13-18 July 2025. New York, NY, United States: Association for Computing Machinery. doi: 10.1145/3726302.3730273 IR for AAC Users: A Hyperdimensional Computing (Vector Symbolic Architectures) approach 2025 Journal Article Report from the 4th Strategic Workshop on Information Retrieval in Lorne (SWIRL 2025) Trippas, Johanne R., Culpepper, J. Shane, Aliannejadi, Mohammad, Allan, James, Amigó, Enrique, Arguello, Jaime, Azzopardi, Leif, Bailey, Peter, Callan, Jamie, Capra, Rob, Craswell, Nick, Croft, Bruce, Dalton, Jeff, Demartini, Gianluca, Dietz, Laura, Dou, Zhicheng, Eickhoff, Carsten, Ekstrand, Michael, Ferro, Nicola, Fuhr, Norbert, Glowacka, Dorota, Hasibi, Faegheh, Hettiachchi, Danula, Jones, Rosie, Kamps, Jaap, Kando, Noriko, Karimi, Sarvnaz, Kato, Makoto P., Koopman, Bevan ... Zuccon, Guido (2025). Report from the 4th Strategic Workshop on Information Retrieval in Lorne (SWIRL 2025). ACM SIGIR Forum, 59 (1), 1-68. doi: 10.1145/3769733.3769739 Report from the 4th Strategic Workshop on Information Retrieval in Lorne (SWIRL 2025) 2025 Conference Publication Dataset Discovery via Line Charts Ji, Daomin, Luo, Hui, Bao, Zhifeng and Culpepper, J. Shane (2025). Dataset Discovery via Line Charts. IEEE. doi: 10.1109/icde65448.2025.00046 Dataset Discovery via Line Charts 2025 Conference Publication Examining the Impact of Transcript Variation on Podcast Search and Re-ranking Mansour, Watheq, Culpepper, J. Shane and Mackenzie, Joel (2025). Examining the Impact of Transcript Variation on Podcast Search and Re-ranking. 47th European Conference on Information Retrieval, ECIR 2025, Lucca, Italy, 6–10 April 2025. Cham, Switzerland: Springer. doi: 10.1007/978-3-031-88714-7_9 Examining the Impact of Transcript Variation on Podcast Search and Re-ranking 2024 Conference Publication A fully on-disk updatable learned index Lan, Hai, Bao, Zhifeng, Culpepper, J. Shane, Borovica-Gajic, Renata and Dong, Yu (2024). A fully on-disk updatable learned index. 2024 IEEE 40th International Conference on Data Engineering (ICDE), Utrecht, Netherlands, 13-16 May 2024. Washington, DC, United States: IEEE Computer Society. doi: 10.1109/icde60146.2024.00369 A fully on-disk updatable learned index 2024 Conference Publication Enhancing human annotation: leveraging large language models and efficient batch processing Zendel, Oleg, Culpepper, J. Shane, Scholer, Falk and Thomas, Paul (2024). Enhancing human annotation: leveraging large language models and efficient batch processing. CHIIR ’24: 2024 Conference on Human Information Interaction and Retrieval, Sheffield, United Kingdom, 10-14 March 2024. New York, NY, United States: ACM. doi: 10.1145/3627508.3638322 Enhancing human annotation: leveraging large language models and efficient batch processing 2024 Conference Publication Navigating data repositories: utilizing line charts to discover relevant datasets Ji, Daomin, Luo, Hui, Bao, Zhifeng and Culpepper, Shane (2024). Navigating data repositories: utilizing line charts to discover relevant datasets. 50th International Conference on Very Large Databases, Guangzhou, China, 26-30 August 2024. New York, NY, United States: Association for Computing Machinery. doi: 10.14778/3685800.3685857 Navigating data repositories: utilizing line charts to discover relevant datasets 2024 Conference Publication Optimizing data acquisition to enhance machine learning performance Wang, Tingting, Huang, Shixun, Bao, Zhifeng, Culpepper, J. Shane, Dedeoglu, Volkan and Arablouei, Reza (2024). Optimizing data acquisition to enhance machine learning performance. 50th International Conference on Very Large Data Bases, Guangzhou, China, 26-30 August 2024. New York, NY, United States: Association for Computing Machinery. doi: 10.14778/3648160.3648172 Optimizing data acquisition to enhance machine learning performance 2023 Journal Article Updatable Learned Indexes Meet Disk-Resident DBMS - From Evaluations to Design Choices Lan, Hai, Bao, Zhifeng, Culpepper, J. Shane and Borovica-Gajic, Renata (2023). Updatable Learned Indexes Meet Disk-Resident DBMS - From Evaluations to Design Choices. Proceedings of the ACM on Management of Data, 1 (2), 1-22. doi: 10.1145/3589284 Updatable Learned Indexes Meet Disk-Resident DBMS - From Evaluations to Design Choices 2023 Conference Publication Facility relocation search for good: when facility exposure meets user convenience Luo, Hui, Bao, Zhifeng, Culpepper, J. Shane, Li, Mingzhao and Zhao, Yanchang (2023). Facility relocation search for good: when facility exposure meets user convenience. ACM Web Conference 2023, Austin, TX, United States, 30 April - 4 May 2023. New York, NY, United States: ACM. doi: 10.1145/3543507.3583859 Facility relocation search for good: when facility exposure meets user convenience 2023 Conference Publication Entropy-based query performance prediction for neural information retrieval systems Zendel, Oleg, Liu, Binsheng, Culpepper, J. Shane and Scholer, Falk (2023). Entropy-based query performance prediction for neural information retrieval systems. QPP++ 2023: Query Performance Prediction and Its Evaluation in New Tasks, co-located with The 45th European Conference on Information Retrieval (ECIR), Dublin, Ireland, 2 - 6 April 2023. CEUR-WS. Entropy-based query performance prediction for neural information retrieval systems 2022 Conference Publication Representative routes discovery from massive trajectories Wang, Tingting, Huang, Shixun, Bao, Zhifeng, Culpepper, J. Shane and Arablouei, Reza (2022). Representative routes discovery from massive trajectories. KDD '22: Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining, Washington, ",
  "content_length": 14945,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:47"
}