{
  "name": "Jaan Aru",
  "homepage": "https://sites.google.com/view/jaanaru",
  "status": "success",
  "content": "Jaan AruSearch this siteEmbedded FilesSkip to main contentSkip to navigationI am an associate professor at the Institute of Computer Science of University of Tartu in my home country Estonia.I am currently supervising 6 PhD students and 2 post-docs.ResearchI try to find and tackle fundamental problems at the intersection of cognitive science, neuroscience, and artificial intelligence. From my publications, you can see that I work in diverse fields from cellular-level neuroscience to consciousness, from artificial neural networks to virtual reality.  My group tries to combine insights from these different fields to gain a novel understanding of the human brain and to create novel AI tools.Public engagementSince 2012 I have been quite active in science communication. If you're fluent in Estonian then please check out my popular science book about the brain, my new book about creativity, and three TEDx talks on consciousness, sleep, and creativity in education. Recent papers:Aru, J., Larkum, M. E., & Shine, J. M. (2023). The feasibility of artificial consciousness through the lens of neuroscience. Trends in Neurosciences Suzuki, M., Pennartz, C. M., & Aru, J. (2023). How deep is the brain? The shallow brain hypothesis. Nature Reviews Neuroscience, 24(12), 778-791. Aru, J., Drüke, M., Pikamäe, J., & Larkum, M. E. (2023). Mental navigation and the neural mechanisms of insight. Trends in Neurosciences. Aru, J., & Rozgonjuk, D. (2022). The effect of smartphone use on mental effort, learning, and creativity. Trends in Cognitive Sciences. Aru, J., Labash, A., Corcoll, O., & Vicente, R. (2023). Mind the gap: Challenges of deep learning approaches to Theory of Mind. Artificial Intelligence Review. Tulver, K., Kaup, K. K., Laukkonen, R., & Aru, J. (2023). Restructuring insight: An integrative review of insight in problem-solving, meditation, psychotherapy, delusions and psychedelics. Consciousness and Cognition. Aru, J., Suzuki, M., & Larkum, M. E. (2020). Cellular Mechanisms of Conscious Processing. Trends in Cognitive Sciences.How I got here? I did my PhD with Lucia Melloni and Wolf Singer at the Max Planck Institute for Brain Research. I studied consciousness and neural oscillations. After that, in 2014 I returned to Estonia to work with artificial intelligence and supervised projects on virtual reality. In 2018, I obtained the Marie Skłodowska-Curie fellowship to do a post-doc with Matthew Larkum in Berlin. Since 2020 I'm back in my home country Estonia.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2538,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:47"
}