{
  "name": "Jaap Kamps",
  "homepage": "https://e.humanities.uva.nl",
  "status": "success",
  "content": "UvA :: Kamps Jaap Kamps' World You are here: > Kamps This is Jaap Kamps' home page. I am associate professor of Information Retrieval at the Faculty of Humanities. My research is part of the Institute for Logic, Language, and Computation. Both are part of the University of Amsterdam. Addresses Visiting address: Archives and Information Studies/Humanities, University of Amsterdam, Turfdraagsterpad 9, NL-1012XT AMSTERDAM, The Netherlands, Room 2.17. LAB42, University of Amsterdam, Science Park 900, NL-1098XH AMSTERDAM, The Netherlands, Room 6.48 Postal address: University of Amsterdam, PO Box 94550, NL-1090GN AMSTERDAM, The Netherlands. Research My research covers various aspects of Information Storage and Retrieval, see Publications. Conferences and Workshops: CIKM'25: 34th ACM International Conference on Information and Knowledge Management. ECIR'23: 45th European Conference on Information Retrieval. SIGIR'20: 43rd International ACM SIGIR Conference on Research and Development in Information Retrieval. ICTIR'17: 3rd ACM International Conference on the Theory of Information Retrieval. TPDL'17: 21st International Conference on Theory and Practice of Digital Libraries. SCST'17: CHIIR'17 Workshop on Supporting Complex Search Tasks. CLEF'16: 7th CLEF Conference on Experimental Information Retrieval. SEXI'16: WSDM'16 Workshop on Search and Exploration of X-rated Information. CLEF'15: 6th CLEF Conference on Experimental Information Retrieval. GSB'15: SIGIR'15 Workshop on Graph Search and Beyond. SCST'15: ECIR'15 Workshop on Supporting Complex Search Tasks. ESAIR'14: CIKM'14 Workshop on Exploiting Semantic Annotations in Information Retrieval. ESAIR'13: CIKM'13 Workshop on Exploiting Semantic Annotations in Information Retrieval. ECIR'13: 35th European Conference on Information Retrieval. SEXI'13: WSDM'13 Workshop on Search and Exploration of X-rated Information. ESAIR'12: CIKM'12 Workshop on Exploiting Semantic Annotations in Information Retrieval. IIiX'12: Fourth Symposium on Information Interaction in Context. IR evaluation efforts: CLEF'26: SimpleText track. CLEF'26: JOKER track. CLEF'25: SimpleText track. CLEF'24: SimpleText track. CLEF'23: SimpleText track. CLEF'22: SimpleText track. CLEF'21: SimpleText track. TREC'16: Contextual Suggestion track. CLEF'16: Social Book Search lab. TREC'15: Contextual Suggestion track. CLEF'15: Social Book Search lab. Externally funded research projects: OpenGov: Artificial Intelligence for Open Government. HAICu: digital Humanities Artificial Intelligence Cultural heritage. AIDA: AI for Due-diligence Analysis (part of the AI4FinTech Lab). CUE: Creative User Empowerment. ACCESS: Access to City Councils using Exploratory Search Systems. DiLiPaD: Digging into Linked Parliamentary Data (plus E-science). ExPoSe: Exploratory Political Search (plus CDH). meSch: Material EncounterS with digital Cultural Heritage. WebART: Web Archive Retrieval Tools (plus WebARTplus). v-must: Virtual Museum Transnational Network. README: Retrieving Encoded Archival Descriptions More Effectively. EfFoRT: Effective Focused Retrieval Techniques. MuSeUM: Multiple-collection Searching Using Metadata (plus MuSeUMplus). MultiMATCH: Multilingual/Multimedia Access To Cultural Heritage. Here is more information about recent projects: My WordNet related research. A sneak preview of Internet opinion polling. Analysis of Dutch Politics (in Dutch). Teaching Most of the courses I'm involved in can be found here. This page ((none) hits in December 2025) was last built in October 2025. Contact Address",
  "content_length": 3554,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:50"
}