{
  "name": "Jaap-Henk Hoepman",
  "homepage": "http://www.cs.ru.nl/~jhh",
  "status": "success",
  "content": "Jaap-Henk Hoepman @ Radboud University Nijmegen : Welcome Welcome Image credit: Robert v.d. Molen, 2020 My name is Jaap-Henk Hoepman. I am guest professor at the PRISEC - Privacy And Security group of Karlstad University, Sweden. I am also an associate professor of privacy enhancing protocols and privacy by design in the Digital Security group at the Institute for Computing and Information Sciences of the Radboud University Nijmegen, and member of iHub, Radboud University’s interdisciplinary research hub on Digitalization and Society. My main research interest are privacy by design, privacy friendly protocols and identity management. I also write a lot about the societal impact of new technologies. News I’m a member of the informal Commission Expert Group for a Technology Roadmap on Encryption. The expert group will support the European Commission in the preparation of a Technology Roadmap for lawful access to digital information, without undermining cybersecurity and while respecting fundamental rights. I’m a member of the government committee ‘Normering Bulkdata Politie’. On March 2025 I initiated a petition to urge the board of our university to for digital autonomy and independence from Big Tech. This quickly spread to other universities, and some activities at the national level. Blog I actively maintain a blog discussing security, privacy and the societal impact of new technologies. Starting March 2017 my blog is archived by the Dutch Royal Library. Seeds Seeds are raw, unfinished, or simply far fetched ideas for which I do not have the time or the courage to develop them further. Personal favourite: 0906-SORRY. Also see Improved iPhone calendar. Feel free to browse them and get inspired. But tell me if you worked on them! Key publications The Little Blue Book   Privacy Is Hard Web design inspired by the warchalking symbols designed by Matt Jones. Last Version - Mon Jul 11 11:22:13 2022 +0200 / e1e3326. (Note: changeover from CVS to dotless svn version numbers on Jan 19, 2008, and changeover to GIT versioning on May 30, 2013.) Maintained by Jaap-Henk Hoepman Email: jhh@cs.ru.nl",
  "content_length": 2132,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:49"
}