{
  "name": "Jaap Heringa",
  "homepage": "http://www.cs.vu.nl/~heringa",
  "status": "success",
  "content": "Jaap Heringa Professor of Bioinformatics Head, Department of Computer Science VU Room 11A-49 NUVU Building Bioinformatics Section Department of Computer Science Faculty of Science Vrije Universiteit De Boelelaan 1111, 1081 HV Amsterdam The Netherlands Email: j.heringa@vu.nl Phone (direct): +31 20 59 87649 Phone (secr.): +31 20 59 83563 Academic Education 1980: B.Sc. Hons. Mathematical Biology 1984: M.Sc. Biology, Majors Bioinformatics and Population Genetics, Minor Computer Science 1993: Ph.D. Bioinformatics (Cum Laude), University of Utrecht, The Netherlands. Thesis title: Local Interactions in Protein Folds: A Bioinformatic Approach Work Experience 1980 - 1984: Assistant Research Consultant (multivariate statistics), one day per week, University of Utrecht, The Netherlands 1985 - 1988: Development Programmer and Team Leader with IBM Informations Network Service Development Center (INSDC), Uithoorn, The Netherlands 1988 - 1996: Staff Researcher, Biocomputing department, European Molecular Biology Laboratory (EMBL), Heidelberg, Germany 1996 - 2002: Group leader, Division of Mathematical Biology, National Institute for Medical Research, Mill Hill, London, UK 2002 - 2003: MRC Senior Scientist, Division of Mathematical Biology, National Institute for Medical Research, Mill Hill, London, UK 2002 - Date: Professor of Bioinformatics, VU Amsterdam 2002 - Date: Head of Bioinformatics Section, Faculty of Sciences, VU Amsterdam 2003 - Date: Director of the Centre for Integrative Bioinformatics VU (IBIVU), VU Amsterdam 2009 - Date: Director of the Netherlands Bioinformatics Centre (NBIC) Education Platform \"BioWise\" 2010 - 2014: Scientific Director of the Netherlands Bioinformatics Centre (NBIC) 2014 - Date: Director of the Netherlands Bioinformatics and Systems Biology Research School (BioSB) 2014 - 2016: Deputy Head of Node of ELIXIR-NL 2016 - Date: Head of Node of ELIXIR-NL 2018 - Date: Head of Department of Computer Science, VU Amsterdam",
  "content_length": 1964,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:50"
}