{
  "name": "Jack M. Carroll 0001",
  "homepage": "https://jcarroll.ist.psu.edu",
  "status": "success",
  "content": "John M. Carroll About New Course Projects Publications Research Statement Personal Musings John M. Carroll About I am a faculty member in Penn State’s College of Information Sciences and Technology. I am Distinguished Professor and co-Director (with Professor Mary Beth Rosson) of the College of IST’s Collaboration and Innovation Laboratory. I am also the Director of Penn State’s Center for Human-Computer Interaction. I have courtesy faculty appointments as professor of Computer Science and Engineering, of Learning, Design and Technology, and of Psychology. Until August 2003, I was a professor in Computer Science at Virginia Tech. I was also Director of Virginia Tech’s Center for Human-Computer Interaction, and had secondary appointments as professor of Teaching and Learning and Psychology. And prior to that, I was a scientist at the IBM Thomas J. Watson Research Center (1976-1994), where I managed the legendary User Interface Institute. I have reached the stage in life where my colleagues have started giving me “lifetime” awards, though I have no specific plan to retire or die anytime soon: ACM Joseph T. Rigo Award (Association for Computing Machinery, 1994), ACM SIGCHI Academy (2001, ACM SIGCHI is the ACM’s Special Interest Group on Computer-Human Interaction), ACM SIGCHI Lifetime Achievement Award (2002), ACM Fellow (2003), IEEE Alfred N. Goldsmith Award (Institute of Electrical and Electronics Engineers, 2004), IEEE Fellow (2004), Honorary Fellow of the Human Factors and Ergonomics Society (2005), Fellow of the Psychonomics Society (2010, society of experimental psychologists), Fellow of the American Association for the Advancement of Science (2011), Fellow of the Association for Psychological Science (2012). I was listed in the Irish Education 100 in 2011 and 2012. I was awarded a Doctor Honoris Causa (honorary doctorate) in Engineering by the Universidad Carlos III de Madrid in September, 2012; my Discurso de investidura was entitled “Humanity, technology and HCI.”  I was elected an Honorary Member (for life) and member of Advisory Council of the International Association for Information Systems for Crisis Response and Management (ISCRAM) in May, 2013. I was named Honorary Fellow of Society for Technical Communication in June 2015. This awesome to me both in that the STC remembered my work in minimalist information and instructional design from the 1980s, and in that the previous recipients of the award were amazing, including  Alan Alda, Buckminster Fuller, Stephen J. Gould, Temple Grandin, Donald Norman, and Herbert Simon. In 2017, I received the Senior Faculty Excellence in Research Award from the College of Information Sciences and Technology at Penn State. It’s always a special thing to be acknowledged by close colleagues. In 2018, I received the Faculty Scholar Medal for Outstanding Achievement in Social and Behavioral Sciences, Penn State. This one was meaningful to me since it affirmed that social and behavioral scientists can still recognize me after all these years wandering the badlands of information technology. Penn State has an outstanding faculty throughout the social and behavioral sciences, and it’s wonderful to be recognized by them. In 2020-2021, the International Federation for Information Processing (IFIP) included me in their second class of Fellows. I also received their HCI Pioneers Award; I was the second American to ever receive this particular award. Nice to remember many international collaborations through the years! Somewhat out-of-date career narrative; A  less out-of-date research statement; Even less out of date Fun-for-me interview, Man Who Killed the Manual, SearchSearch Recent PostsMusings? Recent CommentsNo comments to show. Archives October 2008 Categories Uncategorized Copyright © 2007-2008 John M. Carroll | Adapted from Elements of SEO by Mike Colibraro and Bernie Zang",
  "content_length": 3884,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:56"
}