{
  "name": "Jacky W. Keung",
  "homepage": "http://www.cs.cityu.edu.hk/profile/jacky.keung.html",
  "status": "success",
  "content": "Jacky Wai Keung - CityUHK Scholars Prof. Jacky Wai Keung, 姜煒 Associate Professor, Department of Computer Science Phone+852 34422591EmailJacky.Keungcityu.eduhk YEUNG-Y7721 Accepting PhD Students h-index 5449 Scopus Citations 39 Scopus h-index Calculated based on number of publications stored in Pure and citations from Scopus 20042026 Research activity per year Personal profile Author IDsORCID iD: 0000-0002-3803-9600Scopus Author ID: 6603066702ResearcherID: X-4693-2019Google Scholar Profile: UpuYcQoAAAAJImpactMetrics for Academic and Research ImpactQualifications (Brief)B.Sc (Hons) Sydney, Ph.D. New South Wales (UNSW) HKCS, ACS, ACM, IEEE - Senior Member IEEE HK Computer Society - Chairman Artificial Intelligence and Software Security Research Lab (AiSS) - Leader Stanford's top 2% most highly cited scientists (2023 Oct, Version 6) Stanford's top 2% most highly cited scientists (2022 Nov, Version 5)BiographyJacky Keung received B.Sc.(Hons) in Computer Science from the University of Sydney and Ph.D. in Software Engineering from the University of New South Wales, Australia. Before joining CityU, he was then the Research Scientist in the Software Systems Research Group at NICTA (now DATA61, CSIRO) based in Sydney, Australia. Prof. Keung's research interests encompass a wide range of domains, reflecting his expertise in various areas. These include software and systems engineering, data science, AI, FinTech, machine learning, blockchain systems for FinTech applications, deep learning, LLM applications, defect prediction, and empirical modeling and evaluation of complex systems. His diverse expertise has led to fruitful collaborations with numerous software companies and government departments across the Asia Pacific region. He has produced over 150 journal and conference research papers in top venues. Moreover, Prof. Keung boasts an impressive history of forging strong partnerships with various companies spanning diverse industries, exemplifying his prowess in industry connections. These partnerships have yielded substantial external funding for research and development projects, amounting to approximately HK$20M+. His industry connection not only fosters significant engagement between academia and industry but also creates enhanced student internship and placement opportunities and promising job prospects for undergraduate students. As a result, the starting salaries for CS students have witnessed a remarkable year-on-year increase of over 15% for the past three years, reflecting the tangible impact of Dr. Keung's industry connections on their future careers. Overall, Prof. Keung contributions as a researcher, mentor, educator, and collaborator have left a significant impact on the field of software engineering and computer science. His expertise, publications, and industry partnerships demonstrate his dedication to advancing research and fostering practical applications in various domains. Selected R&D projects have been successfully awarded over HK$20M+, including GRF: HKGov University Grants Committee (UGC) - General Research Fund, ITF: HKGov Innovation and Technology Commission – Innovation and Technology Fund, TDG: UGC Teaching Development Grant. PI: HK$2.62Million (Industry Collaborative Project 9229029) Smart Intelligent Process Automation for the Mortgage Lending Industry (6/2020~6/2025) PI: HK$565,000 : (Industry Collaborative Project 9220103, 9229098, 9229109, 9220097) Deep Probabilistic Reasoning and Statistical Analysis Using Deep-Learning , (8/2019 ~ 12/2015) PI: HK $240,000 : (UGC/TDG No.6000769) Innovative Learning using Gamification to Enhance Teaching and Learning Software Engineering (6/2022 ~ 1/2024) PI: HK $781,000 : (ITF No.9678149) Software Data Analytics and Blockchain Technological Advancements, Feb/2018 ~ Jul/2022 PI: HK $6 Million: (ITF ITS/379/18FX) Deep-learning-based Artificial Intelligence Financial Portfolio Advisory Platform, 2019-2021 PI: HK $4 Million: (ITF ITS/380/18FX) Ethereum Blockchain-enabled Common Platform for Self-sovereign Identity and Clinical Record System, 2019-2021 PI: HK $333,333 : (No. GRF 11208017) A Software Analytics Framework using Deep Learning on Generalized Data Representations, Sept/2017 ~ Sep/2019 PI: HK $6.6 Million: (ITF ITS/133/17FX) Blockchain Enhanced Common Platform for Syndicate Mortgage Transactions, Dec/2017 ~ Dec/2019 PI: HK $100,000: (No. 7005217) Concept Drift in Software Defect Prediction and Its Impacts, Sept/2019 ~ Feb/2023 PI: HK $100,000: (No. 7005028) Advanced Data Integrity and Exchange Framework for Software Engineering Data, Sept/2018~ Sep/2020 PI: HK $100,000 : (No. 7004683 ) RacePoint: A Software Defect Complexity Measurement Framework for Managing Data Race Bugs of Multithreaded Software, Sep/2016 ~ Aug/2018 CoI: HK $844,559 : ( GRF 9042328) FAVOR: a testing Framework for detecting Atomicity ViOlations in concuRrent traces, Jan/2017 ~ Jan/2020 PI: HK $100,000: (No.7004474) AMORE: A Software Defect Complexity Measurement Framework for Managing Data Race Bugs of Multithreaded Software, Sep/2016 ~ Oct/2017 PI: HK $580,000: (No.7200354) Predictive Modelling in Software Engineering using Ensemble Learning Techniques, Jul/2013 ~ Dec/2015 PI: HK $100,000 (No.7004222): Exploiting Diversity in Ensembles for Software Effort Estimation Sep/2014 ~ Mar/2016 PI: HK $100,000 (No.6000485): A Pragmatic Approach to Changing the Pedagogy of Object-Oriented Programming using Interactive Programming Environment, Nov/2013 ~ Dec/2015 PI: HK $100,000 (No.7003032): Application of Case-based Reasoning in the Disease Prevention and Control of Congenital Syphilis in Southern China, Mar/2013 ~ Oct/2014 PI: ~ HK$1,200,000 Middleware Infrastructure Technology Research Grant Project, Department of Defence, Australia (DSTO) in collaboration with NICTA, 2007 ~ 2009, Australia PI: ~ HK $500,000 Boeing Airborne Mission Control System Evaluation, Department of Defence, Australia (DSTO) in collaboration with NICTA, 2009 ~ 2010, Australia Prof. Keung is accepting Industry Research Collborations and Proposals: ITF R&D Research Projects (with government cash rebate)Donations from Industry (with government 1:1 matching)Contract Research and Consultancy  (with government cash rebate) Prof. Keung is currently hiring for (2024/2025 exercise) : Post-doctoral Fellowship (with PhD from HK, or top-100) Candidates  (Salary highly competitive ) Multiple (10+) Software Developers/Programmers (Salary highly competitive) PhD Candidates in Software Engineering   (UGC/PhD Fellowship Scheme)PhD Candidates in Software Engineering (Self-Finance Scheme, early 2024 admission) Editor or Editorial MembershipJournal of Systems and Software (JSS)Information and Software Technology Journal (IST)Applied Soft Computing (ASC)Empirical Software Engineering Journal (EMSE)IEEE Transactions on Software Engineering (TSE)Prizes/HonoursStanford’s top 2% Most Highly Cited Scientist 2022President's Teaching Excellence Awards (TEA). 2020 Nomination for the UGC Teaching Award 2020 Excellent Paper Award, International Symposium on Education Technology 2023Research Excellence Award in Software Engineering (SIGSE IPSJ Japan) 2018Premium Award for Best Journal Paper (IET Software) 2018IEEE QRS 2017 Best Paper Award International Conference on Software Quality, Reliability & Security (QRS-2017)IEEE QRS 2016 Best Paper Award International Conference on Software Quality, Reliability & Security (QRS-2016)National Natural Science Award - Ministry of Education of the People Republic of China 2015 (高等學校科學研究優秀成果獎-自然科學獎)IEEE Hong Kong Competition on Cloud Computing 2011 – Silver Award Most innovative cloud computing mobile application, Hong KongIEEE ASWEC 2010 Best Paper Award Australian Software Engineering Conference, Auckland, New ZealandIEEE ICIW 2010 Best Paper Award International Conference on Internet and Web Applications and Services, Barcelona, SpainIEEE ASWEC 2008 Best Paper Award Australian Software Engineering Conference, PerthIEEE APSEC 2007 Best Paper Award Asia Pacific Software Engineering Conference, JapanIEEE ISESE 2006 Best Paper Award International Symposium on Empirical Software Engineering, BrazilPosition(s) AvailableResearch and Development Project: Blockchain Enhanced Common Platform for Syndicate Mortgage Transactions Research Fellow/Postdoctoral Fellow/Research Associate/Research Assistant (5 posts) in the Department of Computer Science (Appointment for 12 months with possibility of extension) [Ref. A/R/1000/09] -  Administrator/Clerical Officer (1 post) in the Department of Computer Science (Appointment for 12 months with possibility of extension) [Ref. A/R/1000/09] Software Developer/Programmer (10 posts) in the Department of Computer Science (Appointment for 12 months with possibility of extension) [Ref. A/R/1000/09] Doctor of Philosophy (Ph.D Student) in Computer Science and Software Engineering  Research Interests/AreasSoftware EngineeringEmpirical ExperimentsSoftware DefectsData Mining and AnalyticsMachine LearningArtificial Intelligence Data Science and Data AnalyticsDeep LearningFinancial Technology and BlockchainLarge Language Models (LLM)Services outside CityUHK IEEE Computer Society Hong Kong Chapter (IEEE CS) - ChairmanHong Kong STEM Education Alliance - Vice-PresidentHong Kong Museum Expert Adviser - Leisure and Cultural Service Department (LCSD) - Expert Adviser/Consultant for LCSDHong Kong Council for Accreditation of Academic & Vocational Qualifications (HKCAAVQ) - Assessment Specialist on Degree ProgrammesEDB Curriculum Development Council Standing Committee on STEM Education (EDB) - EDB Curriculum Development Council Panel Member Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Related Links *New PhD Applications (Pre-Application Form) - 2026/27 AdmissionContact Knowledge",
  "content_length": 18694,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:02"
}