{
  "name": "Jack Mostow",
  "homepage": "http://www.cs.cmu.edu/~mostow",
  "status": "success",
  "content": "Jack Mostow Welcome to Jack Mostows Homepage (Last updated 7/24/2016) Project: Helping kids learn to read, by getting computers to listen to them read aloud. Emeritus Research Professor, Robotics, Machine Learning, Language Technologies, Human-Computer Interaction · Team Leader, CMU RoboTutor Global Learning XPRIZE Team · Director, Project LISTEN:  A Reading Tutor that Listens · Steering Committee, Program in Interdisciplinary Educational Research School of Computer Science Carnegie Mellon University Contact Information: Mail:   RI-NSH 3113, Carnegie Mellon University, 5000 Forbes Avenue, Pittsburgh, PA 15213-3890 Email:  mostow at cs.cmu.edu (preferred means of contact) Phone:  (412) 268-1330 FAX:  (412) 268-6436 Administrative assistant:  Lynnetta Miller, 268-8126 Research Interests: I am now leading Carnegie Mellons RoboTutor team competing for the Global Learning XPRIZE, expanding my previous work on Project LISTENs Reading Tutor that listens to children read aloud. The Reading Tutor adapts automated speech recognition to analyze oral reading. The Reading Tutor responds with spoken and graphical assistance modeled in part after expert reading teachers, but adapted to the strengths and limitations of the technology. Experimental use of the Reading Tutor in elementary school classrooms improved reading proficiency. My previous work in artificial intelligence included machine learning, automated replay of design plans, and discovery of search heuristics. RoboTutor offers exciting opportunities for interdisciplinary work in intelligent tutors, educational data mining, graphic design, speech technologies, cognitive and motivational psychology, human-computer interaction, computational linguistics, artificial intelligence, and machine learning. Biographical Sketch: A.B. cum laude in Applied Mathematics (1974), Harvard University Ph.D. in Computer Science (1981) and NSF Graduate Fellow, Carnegie Mellon University Dr. Mostows research interests in artificial intelligence have included speech, machine learning, and design. After research and faculty positions at Stanford, Information Sciences Institute, and Rutgers, he joined the Carnegie Mellon faculty in 1992 to launch Project LISTEN, which is getting computers to listen to children read aloud, and help them. Dr. Mostow was Program Co-chair of the Fifteenth National Conference on Artificial Intelligence (AAAI98), and has served as an editor of Machine Learning Journal and IEEE Transactions on Software Engineering. In 2003, Dr. Mostow was awarded The Allen Newell Medal for Research Excellence. In 2010, he chaired the 10th International Conference on Intelligent Tutoring Systems and was elected President of the International Artificial Intelligence in Education Society. Click here for Dr. Mostows vita and list of publications. Favorite Quotes: Its tough to make predictions, especially about the future.   Yogi Berra You can observe a lot by watching.   Yogi Berra Wherever you go, there you are.   Buckeroo Banzai Access to all the books in the Library of Congress is of little use if you cannot read. [F. Cairncross, The Death of Distance, p. 253.] After all my time here, Ive yet to see any problem, however complicated, which when you looked at it the right way didnt become still more complicated. [spoken by Arne Viken, character in Call Me Joe, by Poul Anderson, 1957.] Claims about amplified responses to new media are often exaggerated.  Our research is a reminder that we can cry when we read, and we can be bored in a virtual world....  Ultimately, its the pictures in our heads that matter, not the ones on the screen.  [B. Reeves & C. Nass, The Media Equation:  How People Treat Computers, Television, and New Media Like Real People and Places, p. 252.] In August, 2012, I bicycled from Pittsburgh to Washington, DC, joining the week-long final segment of Hazon's (www.hazon.org) Cross USA Ride to help raise environmental awareness, have fun, get exercise, and meet other Jewish cyclists. The money raised from this ride supported Hazons year-round work promoting sustainable food and other worthy innovative projects. Day job; Sir Joseph in HMS Pinafore; Lord in Iolanthe; Mikado in Mikado March 11-20, 2011:  Duke of Plaza-Toro in Gilbert & Sullivans comic operetta Gondoliers; click here for video clip Oct. 31, 2010:  sang in Zamir Chorales 50th Anniversary concert at Carnegie Hall in NYC Oct. 15-24, 2010:  double bill of 1-act operas: ·       Gianni Schicchi (sung in English), by Puccini (his only comedy) ·       Trial by Jury, by Gilbert & Sullivan Pittsburgh City Paper:  The performances are energetic, the voices robust and the orchestra skilled crowd-pleasing comedy. March 2007:  Jack earns good review (http://www.pittsburghpostgazette.com/pg/07051/763392-325.stm) as Major-General Stanley in Pittsburgh Savoyards (www.pittsburghsavoyards.org)s production of Gilbert & Sullivans comic operetta Pirates of Penzance. June 27-30, 2004:  The Eleventh Annual Meeting of the Society for the Scientific Study of Reading provided many photo-ops, including this panorama of attendees enjoying an outdoor cafe on a houseboat-lined canal in beautiful Amsterdam. March 5-21, 2004:  Jack plays the Duke in Pittsburgh Savoyards Patience. Click here for details. October 10-25, 2003:  Jack stars as Sir Joseph Porter, K.C.B., in Pittsburgh Savoyards HMS Pinafore.  \"Savoyards splendid... stunning,\" said the Pittsburgh Post-Gazette. \"Amazing,\" said Pittsburgh CityPaper.  (Click here or on photo for a 15-second videoclip.) His admiring \"sisters, cousins, and aunts\" included Melody, ..., Emily, Janet, and friend Sara.  (Click here or on photo for a short videoclip of them.) July, 2003:  AIED2003 in Sydney, Australia, provides some fine photo opportunities. October 3-4, 2002:  Jack enjoys 2-day, 115-mile bicycle ride with Governor Mark Schweiker... ... and about 800 other riders. For 14 highlight photos, see http://photomail.photoworks.com/sharing/album.asp?Key=1~FQQ4aBru.cJVX94m3Uq30rSv1z8OK0QKX8zi.itY5gpHBVcR9uwowF0NCWO6ecDe. For 63 photos (out of 6 rolls I shot), see http://photomail.photoworks.com/sharing/album.asp?Key=1~FQQ4aBru.cKEq/kxwuuU7JVN.ji.fmt.1O7bat8dGWhYVH/7yUIl/Pwr031MN.6o July, 2001:  Jack attends 25th reunion of 1976 BikeCentennial bicycle trip across the United States, followed by Cycle Montana (6-day, 314-mile ride from Missoula to Bozeman), shooting 15 rolls of film. For summer 1976 photos (mostly BikeCentennial), see photos\\1976_summer_photos_including_BikeCentennial. The following links into http://photomail.photoworks.com/sharing/album.asp? stopped working.  You can try logging in and using the keys below. For BikeCentennial 25th reunion pictures, see http://photomail.photoworks.com/sharing/album.asp?Key=2879849160450001. To browse all 266 Cycle Montana photos, see http://photomail.photoworks.com/sharing/album.asp?Key=8432478120420806. For 60 of the best, see http://photomail.photoworks.com/sharing/album.asp?Key=9744746040430800. January 26 - February 11, 2001:  Jack and Melody perform in Gilbert & Sullivans Gondoliers. December 29, 2000:  Cross-country skiing in Laurel Ridge State Park. December 16, 2000:  Emily helps Janet lead songs: Labor Day, 2000:  Jack welcomes Vice President Al Gore to Pittsburgh. (Photo by Jacks wife Janet, who snapped it as Mr. Gore raced down the parade route shaking lots of hands, including Jacks.  We were lucky that the picture came out at all, let alone in focus and with large enough portions of both faces to be recognizable.  At the time, Janet thought shed only taken a picture of Al Gores belly.  But the picture itself is evidence of its authenticity -- any fake picture would look much better!) Click here to see summer 2000 family photos Click here to see a montage of photos from ITS2000 in Montreal taken by Dr. Mostow using a Visor eyemodule(TM). May 22, 2000:  Daughter Emily holds up diploma in \"Manners\" earned by our dog Skippy (wearing graduation cap) at Pawsitive Academy. March 3-19, 2000:  performed with daughter Melody in Gilbert & Sullivans comic operetta HMS Pinafore with the Pittsburgh Savoyards. See glowing reviews in Pittsburgh Post-Gazette (\"A highlight is the wonderful a cappella harmony shared by Gross, Jack Mostow and Todd Farwell on A British Tar.\") and In Pittsburgh.  (Photos below by castmate Tanya Veverka.)",
  "content_length": 8375,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:54"
}