{
  "name": "Jackson Woodruff",
  "homepage": "http://jacksonwoodruff.com",
  "status": "success",
  "content": "Jackson Woodruf | Compilers, Synthesis, Accelerators | Edinburgh Hi, I'm Jackson Woodruff Assistant Professor, University of Edinburgh I'm a lecturer (assistant professor) at the University of Edinburgh working on compilers for hardware accelerators. Currently Recruiting PhD Students, if interested send me an email. Research My research sets out to make fast hardware easy to use. We design compilers, software engineering tools and hardware design tools to make this easier. The key questions I set out to answer are: How do we make hardware accelerators easy to use? How can we improve existing programming models (in particular, APIs and DSLs)? How do we make it easier to build compilers for hardware accelerators? What tools do programmers need to use hardware accelerators? How can we use compilers to co-design hardware? Can we leverage hardware accelerators to reduce carbon emissions? Team Anton Lydike Making accelerators more flexible Eymen Ünay Making accelerators more performant Yanwei Ye Hardware/Software Codesign Reuben Carolan Programming hardware accelerators Publications 2026 The Configuration Wall: Characterization and Elimination of Accelerator Configuration OverheadASPLOS Josse Van Delm, Anton Lydike, Joren Dumoulin, Jonas Crols, Xiaoling Yi, Ryan Antonio, Jackson Woodruff, Tobias Grosser, Marian Verhelst PDF 2025 ScaIR: Type-safe Complier Framework Compatible with MLIRThe Scala Workshop Maks Kret, Emilien Bauer, Jackson Woodruff, Amir Shaikhha Guess, Measure & Edit: Using Lowering to Lift Tensor CodePACT José Wesley de Souza Magalhães, Jackson Woodruff, Jordi Armengol-Estapé, Alexander Brauckmann, Luc Jaulmes, Elizabeth Polgreen, Michael F.P. O'Boyle PDF 2024 Forklift: An Extensible Neural LifterCOLM Jordi Armengol-Estapé, Rodrigo R.O. Rocha, Jackson Woodruff, Psquale Minervini, Michael F.P. O'Boyle PDF Secco: Codesign for Resource Sharing in Regular Expression AcceleratorsASP-DAC Jackson Woodruff, Sam Ainsworth, Michael F.P. O'Boyle PDF, Code SLaDe: A Portable Small Language Model Decompiler for Optimized AssemblerCGO Jordi Armengol-Estapé, Jackson Woodruff, Chris Cummins, Michael F.P. O'Boyle Paper Acceleration for the many, not the fewPhD Thesis, University of Edinburgh Jackson Woodruff PDF 2023 Rewriting History: Repurposing Domain-Specific CGRAsarXiv Jackson Woodruff, Thomas Koehler, Alexander Brauckmann, Chris Cummins, Sam Ainsworth, Michael F.P. O'Boyle PDF, Code C2TACO: Lifting Tensor Code to TACOGPCE José Wesley de Souza Magalhães, Jackson Woodruff, Elizabeth Polgreen, Michael F.P. O'Boyle GPCE Best Paper AwardPaper, Code When does saving power save the planet?HotCarbon Jackson Woodruff, David Schall, Michael F.P. O'Boyle, Christopher Woodruff Paper Designing CGRAs with Deep Reinforcement LearningDoSSA Jackson Woodruff, Chris Cummins Paper, Code Matching linear algebra and tensor code to specialized hardware acceleratorsCC Pablo Antonio Martínez, Jackson Woodruff, Jordi Armengol-Estapé, Gregorio Bernabé, José Manuel García, Michael F.P. O'Boyle Preprint 2022 Bind the Gap: Compiling Real Software to Hardware FFT AcceleratorsPLDI Jackson Woodruff, Jordi Armengol-Estapé, Sam Ainsworth, Michael F.P. O'Boyle Preprint, Code, Talk ExeBench: an ML-scale dataset of executable C functionsMAPS@PLDI Jordi Armengol-Estapé, Jackson Woodruff, Alexander Brauckmann, José Wesley de Souza Magalhães, Michael F.P. O'Boyle Paper 2021 NRG: A Network Perspective on Applications' PerformanceTMA Noa Zilberman, Andrew W Moore, Billy Cooper, Jackson Woodruff, Yuta Tokusashi, Pietro Bressana, Murali Ramanujam, Salvator Galea PDF New Regular Expressions on Old Accelerators58th Design Automation Conference Jackson Woodruff, Michael F.P. O'Boyle Preprint, Code 2020 M3: Semantic API MigrationsASE Bruce Collie, Philip Ginsbach, Jackson Woodruff, Ajitha Rajan, Michael F.P. O'Boyle PDF Modeling black-box components with probabilistic synthesisGPCE Bruce Collie, Jackson Woodruff, Michael F.P. O'Boyle GPCE Best Paper AwardPDF, Code 2019 Measuring Burstiness in Data Center ApplicationsBuffers Workshop Jackson Woodruff, Andrew W Moore, Noa Zilberman PDF P4DNS: In-Network DNSEuroP4 Jackson Woodruff, Murali Ramanumjam, Noa Zilberman (Also presented at ICIN 2020 and IETF Meeting 107 to the COIN sub-group) Xilinx Open Hardware Award 2020PDF, Code, Video Getting In Touch We are based at the University of Edinburgh, in Scotland. You can contact me at Jackson [dot] Woodruff [at] ed.ac.uk",
  "content_length": 4442,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:58"
}