{
  "name": "Jack Jansen",
  "homepage": "http://homepages.cwi.nl/~jack",
  "status": "success",
  "content": "Jack Jansen Homepage (Home Page?) Jack Jansen Homepage (Home Page?) Myself My name is Jack Jansen, my email address is jack@cwi.nl (or the longer equivalent Jack.Jansen@cwi.nl, which goes to the same mailbox), my daytime phonenumber is +31 20 5924303 (020-5924303 if you live in Holland). I will spare you other personal details for now. Please note that I do not believe in hiding my email address. As a consequence, as of this writing (May 2004) I get about 1500 spam messages per day. While I have a fairly good regime for handling my spam, with a volume like this I am bound to miss some messages that are incorrectly classified as spam. So: if you try to send me mail and I don't react please try again, with different words, or a different subject, or use a different way to reach me. Work I work at CWI, the dutch national research lab for mathematics and computer science. My current areas of interest are multimedia annotation and building Ambulant, a portable, extensible multimedia playback engine. I'm also a member of the W3C SYMM working group. Previously, I worked for Oratrix, the company that created the GRiNS multimedia editing and playback system. Before that I've also worked in multimedia here at CWI, and even earlier I was involved in the Amoeba distributed systems project. Python I'm the maintainer of Python for the Macintosh and I also do a python image extension and various other things. In the process of maintaining MacPython I have ported a number of libraries to the (OS9 and earlier) Mac, distributions of these can be found at my Macintosh Software page. ADPCM Audio encoding A long time ago I implemented an ADPCM audio codec using the IMA/iDVI algorithm. Incorrect URLs to this codec float around on the net far and wide. The only correct one is http://www.cwi.nl/ftp/audio/adpcm.zip. I have long since lost interest in ADPCM, so I'm afraid you have to take this code as-is. And if you're looking for a CCITT ADPCM codec: there is one that Sun used to distribute but apparently it is difficult to find. A copy can be found at http://www.cwi.nl/ftp/audio/ccitt-adpcm.tar.gz. NLUUG I'm an active member (at least, I try to be) of the NLUUG, the dutch unix' users group. Music Music is one of my main passtimes, both listening (or going to shows) and playing it myself. I currently play bass and sing in Uit de Sloot, punkrock with dutch lyrics. You can download our latest CD (or samples of it) if you are interested. I also play in the mythical non-existent Chemical War Babies, when and if they exist. I listen to lots of different styles of music, from baroque via folk to punkrock. In case you're interested you can check out a list of gigs I've been to in the last few years (lemme know if you played in one of these:-). Unfortunately the list hasn't been updated since 2001, I'm working on that. And as they say: I was a punk before you were a punk, I were a punk before you.... Politics Another of my side-activities is Spunk Press, an electronic anarchist-oriented publishing collective. Unfortunately I have very little time to actively work on it at the moment:-( Long ago, I started and maintained the anarchy-list, a mailing list on anarchism. I'm still on the list, but I usually let heaps of messages pile up before I read them... Presentation slides Bridging C++ to Python and vice-versa is a presentation delivered at the autumn 2005 NLUUG conference. It describes experiences extending the bgen tool to allow bridging to C++ in addition to C. The accompanying paper is available too. These two documents are the only known description of how bgen works. The Sorry State of Open Source Software was presented at EuroFoo 2004. The title is hyperbole, but it lists some of my misgivings about the user experience of (some) open source packages. It should be considered unfinished work. MacPython was presented at EuroPython 2003 in Charleroi, and explains the state of MacPython at that time plus some (then:-) future plans. Jack Jansen, jack@cwi.nl, 08-Dec-05.",
  "content_length": 4011,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:56"
}