{
  "name": "Jack Dongarra",
  "homepage": "http://www.netlib.org/utk/people/JackDongarra",
  "status": "success",
  "content": "Jack Dongarra home | books | courses | jobs | notes | papers | projects | talks Emeritus Professor University of Tennessee Department of Electrical Engineering and Computer Science Former Director Innovative Computing Laboratory Turing Fellow University of Manchester School of Mathematics Adjunct Professor Rice University Computer Science Department Contact Information Jack Dongarra Electrical Engineering and Computer Science Department Innovative Computing Laboratory 1122 Volunteer Blvd Suite 203 University of Tennessee Knoxville, TN 37996-3450 E-mail: dongarra@icl.utk.edu Office: 865-974-8295 Maps Map and directions to ICL Map of Knoxville area and University of Tennessee Map to Oak Ridge National Lab Map to Oak Ridge National Lab and area Map of the world Other Information Report on the Oak Ridge National Laboratory Frontier System, J. Dongarra and A. Geist, June 2022, Tech Report No. ICL-UT-22-05. Reinventing High Performance Computing: Challenges and Opportunities, D. Reed, D. Gannon, and J. Dongarra, March 2022, https://arxiv.org/abs/2203.02544. Ten computer codes that transformed science, Nature, January 20, 2021. Report on the Japanese Fugaku Supercomputer, June 22, 2020. Ranking of CS Departments by High Perforamcnce Research. Washington Post Op-Ed, The U.S. once again has the world's fastest supercomputer. Keep up the hustle. Jack Dongarra, June 25, 2018 Report on the Sunway TaihuLight System, June 20, 2016 DOE: Applied Mathematics Research for Exascale Computing, J. Dongarra, J. Hittinger, et. al, March 2014 DOE: Assessment of Workforce Development Needs in office of Science Research Disciplines, B. Chapman, et. al, July 2014 DOE: Ten Technical Approaches to Address the Challenges of Exascale Computing, R. Lucas, et. al, February 2014 Trip Report to China and Tianhe-2 Supercomputer, June 3, 2013 Information on the UTK Interdisciplinary Graduate Minor in Computational Science. Thomas Haigh's Biography of Jack Dongarra, from IEEE Annals of the History of Computing, 2008. SC22 Keynote Turing Award Lecture \"A Not So Simple Matter of Software\" Heidelberg Laureate Forum Foundation Laureate Portraits: Jack J. Dongarra, ACM A.M. Turing Award, 2021 Knoxville Area Information Weather information for Knoxville, Tennessee Innovative Computing Laboratory Our group, called the Innovative Computing Laboratory (ICL), is part of the Electrical Engineering and Computer Science Department at the University of Tennessee and is engaged in research in various areas of high-performance computing. Biographical Sketch Jack Dongarra received a Bachelor of Science in Mathematics from Chicago State University in 1972 and a Master of Science in Computer Science from the Illinois Institute of Technology in 1973. He received his Ph.D. in Applied Mathematics from the University of New Mexico in 1980. He worked at the Argonne National Laboratory until 1989, becoming a senior scientist. He was a University Distinguished Professor of Computer Science in the Electrical Engineering and Computer Science Department at the University of Tennessee from 1989 until 2023 when he became Emeritus Research Professor and holds the title of Distinguished Research Staff in the Computer Science and Mathematics Division at Oak Ridge National Laboratory (ORNL); Turing Fellow at Manchester University; an Adjunct Professor in the Computer Science Department at Rice University. He was the founding director of the Innovative Computing Laboratory at the University of Tennessee until 2022. He specializes in numerical algorithms in linear algebra, parallel computing, the use of advanced-computer architectures, programming methodology, and tools for parallel computers. His research includes the development, testing and documentation of high quality mathematical software. He has contributed to the design and implementation of the following open source software packages and systems: EISPACK, LINPACK, the BLAS, LAPACK, ScaLAPACK, Netlib, PVM, MPI, NetSolve, Top500, ATLAS, and PAPI. He has published over 400 articles, papers, reports and technical memorandum and he is coauthor of several books. Honors & Awards ACM A.M. Turing Award (2021); IEEE Computer Pioneer Award (2020) for leadership in the area of high-performance mathematical software; SIAM/ACM Prize in Computational Science and Engineering (2019); ACM/IEEE Ken Kennedy Award (2013) for his leadership in designing and promoting standards for mathematical software used to solve numerical problems common to high performance computing; IEEE Charles Babbage Award (2011); SIAM Special Interest Group on Supercomputing's award for Career Achievement (2010); IEEE Medal of Excellence in Scalable Computing (2008); Science Foundation Ireland E.T.S. Walton Visitor Award, 2004; IEEE Sid Fernbach Award (2004) for his contributions in the application of high performance computers using innovative approaches; Fellow of the AAAS (1994), ACM (2001), IEEE (1999), and SIAM (2009) Foreign Fellow of the British Royal Society (2019); Member of the US National Academy of Sciences (2023); Member of the US National Academy of Engineering (2001); Broad Impact with Co-Authors (thanks to Dimitris Floros, Nikos Pitsianis, and Xiaobai Sun) Dongarra's Google Scholar entry Dongarra's Web of Science entry Dongarra's Scopus entry Dongarra's Guide2Research entry Dongarra's ORCID entry Dongarra's dblp entry Dongarra's ResearcherID entry Dongarra's Research Gate entry Dongarra's ACM Digital Library entry Dongarra's MathSciNet entry Dongarra's Mathematics Genealogy Page # of accesses | dongarra@icl.utk.edu",
  "content_length": 5575,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:58"
}