{
  "name": "Jack C. Wileden",
  "homepage": "https://people.cs.umass.edu/~jack/ccsl-www",
  "status": "success",
  "content": "Jack Wileden's Home Page Jack C. Wileden Professor School of Computer Science Box 34610 University of Massachusetts Amherst, MA 01003-4610 USA Director, Convergent Computing Systems Laboratory Email: wileden@cs.umass.edu Office: 206 Computer Science Building Phone: 413-545-0289 Fax: 413-545-1249 Jack C. Wileden received the A.B. degree in mathematics and the M.S. and Ph.D. degrees in computer and communications sciences from the University of Michigan, Ann Arbor in 1972, 1973 and 1978, respectively. He has been on the faculty of the University of Massachusetts at Amherst since 1978, and is currently a Professor in the School of Computer Science and Director of the Convergent Computing Systems Laboratory (CCSL). Professor Wileden's research has recently converged on the area of convergent computing systems. His work in this area is a logical outgrowth of his long-time interests in software system infrastructure and software development and analysis tools. In the infrastructure area, his work has focused on object management topics, including persistent object systems and name management, and on interoperability support for multilingual programming. Current CCSL research on interoperability centers on polylingual interoperability, while current work on persistent object systems is directed toward development of a persistent Java. In the tools area, he has worked on techniques for describing and analyzing the module structure of software systems and on a variety of development tools and techniques applicable to concurrent software systems. Recent CCSL research on tools has addressed analysis methods for name management as well as tool support for interoperability and persistence. His research has been supported by ARPA, NSF and ONR and he is the author of more than forty papers in journals and refereed conferences. Professor Wileden is a member of the Association for Computing Machinery and a senior member, and golden core member, of IEEE. He has served as an editor of the IEEE Transactions on Parallel and Distributed Systems, as an ACM National Lecturer and as an IEEE Distinguished Visitor. He has presented tutorials on interoperability, on object management and on tools for developers of distributed software systems in the U.S., South America, Europe, Australia and Japan. CCSL Home Page CMPSCI 530 & 630: Programming Languages wileden@cs.umass.edu Last Update: 2/28/98",
  "content_length": 2408,
  "method": "requests",
  "crawl_time": "2025-12-01 13:24:52"
}