{
  "name": "Jackie C. K. Cheung",
  "homepage": "http://cs.mcgill.ca/~jcheung",
  "status": "success",
  "content": "Jackie CK Cheung @McGill Jackie Chi Kit Cheung   —   張智傑 Associate Professor Canada CIFAR AI Chair, Mila Reasoning and Learning Lab, McGill NLP School of Computer Science, McGill University McGill Office: McConnell 108N Mila Office: D.08 Phone: 1 (514) 398-5491 E-mail: jackie.cheung with the suffix (@mcgill.ca) Mailing Address: 3480 University, McConnell Engineering, Room 318 Montreal, Quebec  H3A 0E9 Affiliated with: Mila - Quebec AI Institute Centre for Research on Brain, Language and Music Centre for Intelligent Machines News and Recent Activities One of our ACL 2024 papers on summarization evaluation, COSMIC, received a SAC Award. Check out the topics course on Formal and Neural Models of Pragmatics I'm teaching in Winter, 2024. I gave my thoughts on the use of AI in the customer service sector in Maclean's. As told to Jadine Ngan. Are you a prospective student or looking for a postdoc position? See this page for more details. Research Interests Evaluation of natural language processing systems Natural language generation Automatic summarization Computational semantics Commonsense reasoning in text Applications of NLP My group conducts research in natural language processing (NLP), an area of artificial intelligence in which we build computational models of human languages such as English or French. The goal of our research is to develop useful and beneficial NLP systems that can support people in accomplishing complex tasks. In our lab, we investigate machine learning techniques for making predictions about language and analyze NLP systems, datasets, and tasks using insights from linguistics and psychology. We not only produce state-of-the-art systems for natural language generation according to existing benchmarks, we also propose challenge datasets and evaluation measures. We also like thinking about the broader context of NLP technologies in education, health, and language revitalization.",
  "content_length": 1929,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:00"
}