{
  "name": "Jacob Feldman",
  "homepage": "https://ruccs.rutgers.edu/jacob",
  "status": "success",
  "content": "Jacob Feldman - Home Jacob Feldman - Home Jacob Feldman Professor Dept. of PsychologyRutgers Center for Cognitive ScienceRutgers University - New Brunswick152 Frelinghuysen Rd.Piscataway, NJ 08854 This email address is being protected from spambots. You need JavaScript enabled to view it. Research Interests: Computational models and empirical studies of human visual perception and concept learning, including perceptual organization, grouping, and shape. Selected recent papers: Feldman, J. (2025). Simplicity and complexity of probabilistically-defined concepts. In press, Psychological Review. Feldman, J. (2024). Probabilistic origins of compositional mental representations. Psychological Review, 131(3), 599-624 Destler, N., Singh, M. and Feldman, J. (2023). Skeleton-based shape similarity. Psychological Review. 130(6), 1653–1671. Feldman, J. and Choi, L.-S. (2022). Meaning and reference from a probabilistic point of view. Cognition, 223, 105058. Feldman, J. (2021). Information-theoretic signal detection theory. Psychological Review, 128(5), 976-987. Feldman, J. (2021). Mutual information and categorical perception. Psychological Science, 32(8) 1298-1310. Selected older papers: Froyen, V., Feldman, J. and Singh, M. (2015). Bayesian Hierarchical Grouping: perceptual grouping as mixture estimation. Psychological Review, 122(4), 575-597. Pantelis, P. C., Baker, C., Cholewiak, S., Sanik, K., Weinstein, A., Wu, C.-C., Tenenbaum, J. B. and Feldman, J. (2014) Inferring the intentional states of autonomous virtual agents. Cognition, 130, 360–379. Feldman, J. (2012) Symbolic representation of probabilistic worlds. Cognition, 123, 61–83. Mathy, F. and Feldman, J. (2012) What’s magic about magic numbers? Chunking and data compression in short-term memory. Cognition, 122, 346–362. Feldman, J. and Singh, M. (2006) Bayesian estimation of the shape skeleton. PNAS, 103(47), 18014–18019.  Shape toolbox software Feldman, J. (2000) Minimization of Boolean complexity in human concept learning. Nature, 407, 630–633. Subcategories Fall 2018 Spring 2018",
  "content_length": 2064,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:02"
}