{
  "name": "Jacob K. White 0001",
  "homepage": "http://www.rle.mit.edu/cpg/people_faculty.htm",
  "status": "success",
  "content": "RLE :: Computational Prototyping Group faculty :: staff :: students :: alumni Professor Jacob K. White white@mit.edu | RLE Biography Professor Jacob K. White is the principal investigator of the RLE Computational Prototyping Group. Professor White is a pioneer in numerical methods, particularly in computational prototyping tools and techniques for integrated circuit interconnect, circuit packaging, and micromachined devices. Major contributions by Professor White's research at RLE include computationally efficient numerical techniques used to simulate complicated three-dimensional structures. Applications of these techniques include the electrostatic and fluidic analysis of sensors and actuators, electromagnetic analysis of integrated-circuit interconnects and packaging, and potential flow-based analysis of wave-ocean structure interaction. Professor White's current research interests include serial and parallel numerical algorithms for problems in circuit, interconnect, and microelectromechanical system design. Professor White received his undergraduate degree in electrical engineering and computer science from MIT in 1980, and his masters degree in 1983 and his doctorate in 1985 from the University of California, Berkeley, in the same discipline. He worked at the IBM T. J. Watson Research Center from 1985 to 1987. He joined the MIT faculty in 1987 as assistant professor in EECS, becoming associate professor in 1991 and full professor in 1996. In December of 2001, Professor White was appointed as an Associate Director of the Research Laboratory of Electronics at MIT. Professor Luca Daniel luca@mit.edu | RLE Biography Luca Daniel is a Professor in the Electrical Engineering and Computer Science Department of the Massachusetts Institute of Technology (MIT). Dr. Daniel received the Laurea degree summa cum laude in Electronic Engineering from the Universita di Padova, Italy in 1996, and the Ph.D. degree in Electrical Engineering from the University of California, Berkeley, in 2003. In 1997, he collaborated with STMicroelectronics Berkeley Laboratories. In 1998, he was with HP Research Laboratories, Palo Alto. In 2001, he was with Cadence Berkeley Laboratories. His research interests include development of integral equation solvers for very large systems, stochastic field solvers for large number of uncertainties, and automatic generation of parameterized stable compact models for linear and nonlinear dynamical systems. Applications of interest include simulation, modeling and optimization for mixed-signal/RF/mm-wave circuits, power electronics, MEMs, nanotechnologies, materials, MRI, and the human cardiovascular system. Dr. Daniel has received the 1999 IEEE Trans. on Power Electronics best paper award; the 2003 best PhD thesis awards from both the Electrical Engineering and the Applied Math departments at UC Berkeley; the 2003 ACM Outstanding Ph.D. Dissertation Award in Electronic Design Automation; five best paper awards in international conferences, eight additional nominations for best paper award; the 2009 IBM Corporation Faculty Award; and the 2010 IEEE Early Career Award in Electronic Design Automation. Web Page | Curriculum Vitae | Publications Home / People: Faculty / People: Staff / People: Students / People: Alumni / Research: Projects / Research: Publications / Research: Presentations / Research: Codes / Links / Contact © Massachusetts Institute of Technology - Accessibility",
  "content_length": 3445,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:04"
}