{
  "name": "Jacob O. Wobbrock",
  "homepage": "http://faculty.washington.edu/wobbrock",
  "status": "success",
  "content": "Jacob O. Wobbrock - Home Due to the increasing cost of Ph.D. students, decreasing funding rates, and current size of the ACE Lab, I will not be taking new Ph.D. students until, at the earliest, academic year 2026-2027. UNIVERSITY of  WASHINGTON • Information School • Computer Science & Engineering Jacob O. Wobbrock Professor, The Information School By courtesy, Paul G. Allen School of Computer Science & Engineering Jacob O. Wobbrock, Ph.D. The Information School University of Washington Box 352840 Seattle, WA 98195-2840   USA Home Biography & CV Publications Teaching Videos Press Software Industry Expert Witness HCI @ UW Credit: Ruth Fremson/The New York Times Some Project Pages Catchy Titles Are Good: But Avoid Being Cute Research Contributions in HCI Podcast: How to Write CHI Papers Statistical Inference in R (#Rstats) Aligned Rank Transform R package ARTool R package multpois HCI Handbook (4th ed.) R Code Designing, Running, & Analyzing Experiments $1, $N, $P, and $Q, gesture recognizers Impact of $-family recognizers Pointing Magnifier 3 Angle Mouse TextTest TextTest++ FittsStudy Input Observer Smart Touch Slide Rule Accessible Goal Crossing EdgeWrite Welcome! I am a Professor of Information and, by courtesy, Computer Science & Engineering at the University of Washington (UW). My field is human-computer interaction (HCI) with a focus on mobile and accessible computing. I am a co-founder of the cross-campus DUB Group and the MHCI+D degree, of which I am Chair and Interim Director. I also direct the ACE Lab and am Associate Director and founding Co-Director Emeritus of the CREATE center. My Ph.D. students come from information science and computer science. I seek to scientifically understand people's performance and experiences with interactive technologies, and to design, build, and evaluate better interaction techniques and systems, especially for people with disabilities. I have done extensive work in text entry, pointing, touch, and gesture; human performance measurement and modeling; HCI research and design methods; virtual reality; mobile HCI; and accessible computing. My work primarily combines computer science, interaction design, and experimental psychology. In 2010, I received an NSF CAREER award. In 2017, I was awarded the SIGCHI Social Impact Award. In 2019, I was inducted into the CHI Academy. In 2021, I was named an ACM Fellow for \"contributions to human-computer interaction and accessible computing.\" I have received four 10-year lasting impact awards: from ASSETS 2019, ICMI 2022, UIST 2024, and ASSETS 2025. I received my Ph.D. in 2006 from the Human-Computer Interaction Institute at Carnegie Mellon University, where my advisor was Brad Myers. I received my B.S. in Symbolic Systems in 1998 and my M.S. in Computer Science in 2000 from Stanford University, where my advisor was Terry Winograd. I have also been an entrepreneur. In 2012, I co-founded AnswerDash—a SaaS company providing A.I.-powered context-sensitive help—where I was a venture-backed CEO for about three years. In 2020, AnswerDash was acquired by CloudEngage. My conversations with The New York Times and The Huffington Post capture some of my experiences as a startup CEO from academia. See my full bio, curriculum vitae, faculty profile, Wikipedia page, ACM author page, or Google Scholar page.",
  "content_length": 3327,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:06"
}