{
  "name": "Jacqueline Staub",
  "homepage": "https://ddi.uni-trier.de",
  "status": "success",
  "content": "Start | Universität Trier Seit Januar 2022 ist Jacqueline Staub Inhaberin der CZS Stiftungsprofessur für Informatik und ihre Didaktik.Im Rahmen ihrer Junior-Professur an der Universität Trier fördert sie die Aus- und Weiterbildung von Informatik-Lehrpersonen in Rheinland-Pfalz und untersucht den Umgang von Fehlern bei Programmiernovizen.Sie studierte Informatik und absolvierte das Lehramt für Informatik an der ETH Zürich. Ab 2016 entwickelte Jacqueline Staub im Rahmen ihres Doktorats eine Programmierumgebung, die der Erforschung von Fehlern bei Programmiernovizen dient. Vor ihrem Ruf an die Universität Trier war sie als Postdoc am Ausbildungs- und Beratungszentrum der ETH Zürich tätig und wirkte als Dozentin an der Pädagogischen Hochschule Graubünden mit in der Entwicklung des neuen Informatiklehrgangs.Der Schwerpunkt ihrer Arbeit liegt in der Entwicklung und Erforschung einer Programmierumgebung, die die Vermittlung von Informatikkonzepten im Spiralcurriculum vom Kindergarten bis zum Abitur ermöglichen soll. Zum Zeitpunkt ihrer Promotion 2021 wurde die Lernumgebung in der Schweiz bereits von mehreren zehntausend Schülerinnen und Schülern aktiv im Unterricht verwendet. Sie hofft, im Rahmen ihrer Tätigkeit in Trier enge Kontakte mit den regionalen Schulen knüpfen zu können und die Informatik stärker in der schulischen Bildung verankern zu können. Unser Angebot für Schulen reicht von Weiterbildungskursen an der Universität Trier oder direkt vor Ort über im Unterricht mittels erprobter Unterrichtsmaterialien bis hin zu speziell konzipierten Lehrmitteln, die in Schulprojekten entwickelt werden. Wir fokussieren besonders auf die Förderung der Informatik in der Sekundarstufe 1 sowie an Grundschulen.Lehrmittel Logo/Python:Programmieren mit LogoBlocks (3./4. Klasse)Programmieren mit Logo (5./6. Klasse)Programmieren mit Python (7.-9. Klasse)Lernumgebungen:XLogoOnline: xlogo.uni-trier.deCS Unplugged: https://abz.inf.ethz.ch/umgebungen/Offline Installer für XLogoOnline:Mac Installer (xlogo.dmg)Windows Installer (xlogo.exe)Windows Executable (xlogo.zip)Studentische Arbeiten:Rekursion im gymnasialen Programmierunterricht (Bachelorarbeit 2022/2023) Seit 2022: Juniorprofessorin Fachdidaktik Informatik (Universität Trier)3.2021-12.2021: Postdoc (ETH Zürich)2017-2021: Dozentin Fachdidaktik Informatik (PH Graubünden)2017-2021: Doktorandin (ETH Zürich)2014-2016: Lehrdiplom Informatik für Maturitätsschulen (ETH Zürich)2009-2016: Informatikstudium (ETH Zürich)Aktuelle und wiederkehrende Gremienaktivitäten:Gremiumsmitglied Graduiertenzentrums der Universität TrierMitglied TigerJython GroupMitglied Programmausschuss FSE 2025, ICSE 2024, SIGCSE Virtual 2024, Informatics in Education 2022-2025, ICER 2023-2025, Computer Science Education 2022-2025Programmausschuss ISSEP 2018, ISSEP 2019, ISSEP 2020, ISSEP 2021, ISSEP 2024Steering Committee Co-Chair der ISSEP ab 2025 Wir engagieren uns fürs Fach Informatik über sämtliche Altersstufen vom Kindergarten bis zum Abitur. In der Region in und um Trier sind wir in diverse Schulprojekte involviert und bieten vor-Ort Lehrerweiterbildungen an.Kurse an der Universität TrierWS: Grundlagen der Didaktik 2, Universität TrierWS: Didaktik des Informatikunterrichts, Universität TrierWS: Grundlagen der Programmierung 1, Universität TrierWS: Informatik und Gesellschaft, Universität TrierSS: Grundlagen der Didaktik 1, Universität TrierSS: Didaktik des Informatikunterrichts, Universität TrierSS: Grundlagen des Sachunterrichts, Universität TrierSS: Informatik und Gesellschaft, Universität TrierSS: Forschungspraktikum/-seminar, Universität TrierBetreute Bachelor-/Master/-Doktorarbeiten2025: V. Comanescu, Refactoring and Enhancing a Navigation Task Generator for Early Learners2025: R. Fernandes, Developing and Analyszing Block-based Programming in XLogoOnline2025: N. Böhnke, Anforderungen beim Verständnis des Parameter- und Argumentenkonzepts im Informatikunterricht am Beispiel der Programmiersprache XLogo2024: D. Max, Digitalisierung und Automatisierung der Bestandsrückmeldung in diskreter Fertigung2024: G. Kaufhold, TROI Trierer Olympiaden der Informatik2024: F. Sponholz, Static Analysis of Python Code inXLogoOnline2024: M. Ekhlassi, Making XLogoOnline Accessible forthe Visually Impaired2024: J. Braun, xLogo - Pyodide Integration2024: J. Marbach, An AI-Based Recommendation SystemLearnt From Sparse Student Data2024: R. Kaundal, Implementing Databases in Pyodideand Visualizing them in XLogoOnline2024: A. Mertes, XGit: Version control for XLogoOnline2023: J. Schiffer, Von der Bitmap zum Video in Turtle Graphics2023: J. Birrer, Integrating Calliope Mini into XLogoOnline2023: R. Fernandes, Making use of Turtle Graphics in Graph Algorithm Visualization2023: S. Paulus, Design und Entwicklung einer Roboter-Simulation in XLogoOnline2023: M. Zapp, XLogoOnline Maxi Exercise Mode2023: S. Molnar, Implementing an SVG-to-TikZ converter2022: J. Hartmann, Rekursion mit Turtle-Grafik2022: V. Cerkovnik, Der Bildungsroboter Maqueen und Anwendungen im Programmierunterricht2022: D. Evren, Implementing an exercise mode for the maxi version of XLogoOnline2022: J. Holzer, Meet the tiger in a turtle shell -- WebTigerTurtle2022: D. Schumacher, Autocomplete in XLogoOnline2022: J. Marbach LogoOlympia: Implementing a competition mode for turtle graphics2021: P. Wacker, LogoOlympia -- Implementing a competition System for Logo novices2021: S. Henry, An exercise mode for the midi version of XLogoOnline2020: L. Schrempp, Implementing navigation tasks for kindergartners to second graders2019: D. Weibel, Well done! Keep it up! XLogoOnline Turtle is ready to judge your code2019: M. Barnett, Implementing block-based programming for XLogoOnline2019: B. Isler, From an On-Screen Rendering to the Whiteboard 2019: D. Eschbacher, A Computer-Based Examination System for XLogoOnline2019: J. Cantieni, Building a refindes parser for XlogoOnline2019: Anna-Laura John, XLogoOnline Turtle emerges into real life2018: M. Forster, How to support children's autonomous recovery from compilation errors in Logo2018: R. Menta, Supportung Novice Programmer in Recovering from Semantic Errors2017: N. Leuzinger, Cooperative programming in turtle graphics Eine vollständige Übersicht sämtlicher Publikationen kann in DBLP gefunden werden. Alternativ dazu finden Sie auch unter Google Scholar eine Übersicht unserer Publikationen. Falls Sie zu einer unserer Veröffentlichungen gerne den vollständigen Artikel möchten, kontaktieren Sie mich.Bücher und BuchkapitelStaub, J. and Singla, A. (2026). Informatics in Schools. Fostering Problem-Solving, Creativity, and Critical Thinking Through Computer Science Education - 18th International Conference on Informatics in Schools: Situation, Evolution, and Perspectives, ISSEP 2025, Trier, Germany, September 8-10, 2025, Proceedings. Lecture Notes in Computer Science 15958, Springer 2026, ISBN 978-3-032-01221-0Fernau, H., & Schwank, I., & Staub, J. (2025). Creative Mathematical SciencesCommunication: 7th International Conference, CMSC 2024, Trier, Germany, Oc-tober 7-10, 2024, Proceedings. Lecture Notes in Computer Science 15229, Springer,ISBN 978-3-031-73256-0U. Hauser, J. Hromkovič, P. Klingenstein, R. Lacher, and J. StaubRätsel und Spiele ohne Computer -- Spielkarten350 Spielkarten, ISBN 978-3-264-84809-0, Klett und Balmer, 2020U. Hauser, J. Hromkovič, P. Klingenstein, R. Lacher, and J. StaubRätsel und Spiele ohne Computer -- Handbuch96 Seiten, ISBN 978-3-264-84808-3, Klett und Balmer, 2020M. Barnett, J. Hromkovič, A.L John, R. Lacher, P. Lütscher, and Jacqueline StaubSpielerisch Programmieren mit Robotern60 Seiten, ISBN 978-3-264-84810-6, Klett und Balmer, 2020J. Hromkovič, D. Komm, R. Lacher, and J. Staub:Teaching with LOGO philosophy.Encyclopedia of Education and Information Technologies. Springer 2019.PDF available online via Springer-Link, © Springer-Verlag; view as BIBTEX.Beiträge in Journals und ProceedingsChao Wen, Jacqueline Staub, Adish Singla:Program Synthesis Benchmark for Visual Programming in XLogoOnline Environment. ACL (1) 2025: 15812-15838Kohn, T. & Staub, J. (2024, December). The Two Powers: How Pascal and PythonShaped Programming Education. Informatic in EducationChao Wen, Ahana Ghosh, Jacqueline Staub, Adish Singla:Task Synthesis for Elementary Visual Programming in XLogoOnline Environment. AIED Companion (2) 2024: 308-316Marbach, J., Staub, J., Schmerenbeck, D. & Wen, C. (2024, December). PredictingStudent Performance Using Sequence Models in XLogoOnline. Proceedings ofthe SIGCSE Virtual conference.Wen, C., Staub, J., & Singla, A. (2024). Program Synthesis Benchmark for VisualProgramming in XLogoOnline Environment. arXiv preprint arXiv:2406.11334.Wen, C., Ghosh, A., Staub, J., & Singla, A. (2024, July). Task Synthesis forElementary Visual Programming in XLogoOnline Environment. In InternationalConference on Artificial Intelligence in Education (pp. 308-316). Cham: SpringerNature Switzerland.Staub, J. (2024, May). Eine offene Haltung gegenüber Fehlern. WirksamerInformatikunterricht. 181-187. Schneider Verlag Hohengehren GmbH, Balt-mannsweiler, Germany.Baur, R., Hartmann, J. & Staub, J. (2023, October). MazeMastery – A Python Framework for Teaching Maze-Traversal in High School. In International Conference on Informatics in Schools: Situation, Evolution, and Perspectives. Springer, Cham.Fernandes, R., & Staub, J. (October 2023). Unleashing the Power of Turtle Graphics for Graph Algorithm Visualization. In Proceedings of FabLearn 2023.Herrera Loyo, A. & Staub, J. (2023, October). Gender Differences in Problem Solving Observed in Logo Novice. In International Conference on Informatics in Schools: Situation, Evolution, and Perspectives. Poster. Springer, Cham.Staub, J., & Chothia, Z. (2022, February). Large-Scale Analysis of Error Frequencies in Logo Programming. In Proceedings of the 53rd ACM Technical Symposium on Computer Science Education V. 1 (pp. 571-577).Staub, J., Chothia, Z., Schrempp, L., & Wacker, P. (2021, Nove",
  "content_length": 12697,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:17"
}