{
  "name": "Jae-il Kim",
  "homepage": "https://sites.google.com/view/ipalab",
  "status": "success",
  "content": "KNU IPA Lab.Search this siteEmbedded FilesSkip to main contentSkip to navigationImage Processing and Analysis Lab.We believe that knowledge from big data is a golden key to improve our society in cost-effective way. We focus on image and signal processing and analysis researches in various domains, such as medicine, security, and natural science. We welcome your kind feedback and suggestions on our research. Our door is always open to highly motivated students at all stages. Contact: Jaeil Kim, Ph.D. threeyears@gmail.com , E9-527 Kyungpook National University (Daegu, South Korea)20190503_OpenLab_IPAResearch ProjectsDevelopment of Automatic Calcium Scoring Models in CT, (2021, ETRI, PI)Development of AI-based Diagnostic Technology for Medical Imaging Devices (2020~2024, Ministry of Commerce Industry and Energy (KEIT), PI)Development of Graph-based Neural Networks and Model-agnostic Analysis Techniques for Non-Alzheimer's type Dementia Diagnosis (2020 ~ 2023, Ministry of Education (NRF), PI)Development of Intelligent Inspection System for Non-destructive Inspection Equipment (2020 ~ 2021, Ministry of SMEs and Startups (TIPA), PI)Computer-aided Cerebral Hemorrhage Diagnosis in Brain CT (2018~2020, Ministry of Science and ICT (IITP), Co-PI)Development of Deep Learning Framework for Coastal Wave Analysis (2019~Current, KIOST, PI)Development of Abnormal Pattern Recognition Methods for Fabric Production (2020~2021, Ministry of SMEs and Startups(TIPA), PI)Recent Publications2022Daeho Kim, Jaeil Kim. (2022). \"Vision Transformer Compression and Architecture Exploration with Efficient Embedding Space Search\" ACCV 2022 (Acceptance Rate 33.3%, Oral Presentation (41/836))Y. S. Kim, H. G. Cho, Jaeil Kim, Sung Joon Park, Kim, H. J., Lee, S. E., ... & Lee, J. S. (2022). Prediction of Implant Size Based on Breast Volume Using Mammography with Fully Automated Measurements and Breast MRI. Annals of Surgical Oncology, 1-10. (IF: 5.344)J. Kim, M. Kwon, S. D. Kim, J. S. Kug, J. G. Ryu, Jaeil Kim. (2022). \"Spatiotemporal neural network with attention mechanism for El Niño forecasts\". Scientific Reports, 12(1), 1-15. (IF: 4.380)J. Kim, Taekyung Kim, J. Yoo, J. Ryu, K. Do, Jaeil Kim, \"STG-OceanWaveNet: Spatio-temporal geographic information guided ocean wave prediction network\", Ocean Engineering, 257, Aug. 2022 (IF: 3.795, JCR 5%)Garifulla, M., Shin, J., Kim, Chanho, Kim, W. H., Kim, H. J., Kim, Jaeil, & Hong, S. (2022). \"A Case Study of Quantizing Convolutional Neural Networks for Fast Disease Diagnosis on Portable Medical Devices.\" Sensors, 22(1), 219. (IF: 3.576)2021Kim, Jaeil, Kim, H. J., Kim, Chanho, Lee, J. H., Kim, K. W., Park, Y. M., ... & Kim, W. H. (2021). \"Weakly-supervised deep learning for ultrasound diagnosis of breast cancer.\" Scientific Reports, 11(1), 1-10. (IF: 4.379)Yun, Changhee ., Shin, Hokyung., Choo, S. Y., & Kim, Jaeil. (2021). \"An Evaluation Study on Artificial Intelligence Data Validation Methods and Open-source Frameworks.\" Journal of Korea Multimedia Society, 24(10), 1403-1413. (Domestic Journal)Kim, J., Kim, Taekyung., Oh, S. H., Do, K., Ryu, J. G., & Kim, Jaeil. (2021). \"Deep visual domain adaptation and semi-supervised segmentation for understanding wave elevation using wave flume video images.\" Scientific Reports, 11(1), 1-12. (IF: 4.379)Shin, Ho Kyung, et al. \"Prediction of Pathological Complete Response to Neoadjuvant Chemotherapy Using Multi-scale Patch Learning with Mammography.\" International Workshop on PRedictive Intelligence In MEdicine (MICCAI Workshop). Springer, Cham, 2021. Kim, Chanho, et al. \"A Multi-scale Capsule Network for Improving Diagnostic Generalizability in Breast Cancer Diagnosis Using Ultrasonography.\" International Workshop on PRedictive Intelligence In MEdicine (MICCAI Workshop). Springer, Cham, 2021. Kim, Jaeil, et al. \"Artificial intelligence in breast ultrasonography.\" Ultrasonography 40.2 (2021): 183. (IF: 3.075)Mai, Hang-Nga, et al. \"Accuracy of Portable Face-Scanning Devices for Obtaining Three-Dimensional Face Models: A Systematic Review and Meta-Analysis.\" International Journal of Environmental Research and Public Health 18.1 (2021): 94. (IF: 3.390)2020Chang-Hee Yun and Jaeil Kim, A Systematic Review on AI Platform for Public Sector, Journal of Korea Institute of Communications and Information Sciences, 45(11), 1994-2003, 2020.11 Kim, J.*, Huh, D.*, Kim, T., Kim, J.† , Yoo, J., & Shim, J. S. (2020). Raindrop-Aware GAN: Unsupervised Learning for Raindrop-Contaminated Coastal Video Enhancement. Remote Sensing, 12(20), 3461. (IF: 4.509) * Co-first author † Corresponding authorChen, G., Hong, Y., Zhang, Y., Kim, J., Huynh, K. M., Ma, J., ... & UNC/UMN Baby Connectome Project Consortium. (2020, October). Estimating Tissue Microstructure with Undersampled Diffusion Data via Graph Convolutional Neural Networks. In International Conference on Medical Image Computing and Computer-Assisted Intervention (MICCAI, pp. 280-290). Springer, Cham. Jinah Kim, Jaeil Kim, \"Estimation of Water Surface Flow Velocity in Coastal Video Imagery by Visual Tracking with Deep Learning.\", Journal of Coastal Research, 95(sp1):522-526, 2020. (IF: 1.053)Daeho Kim, Jinah Kim, Jaeil Kim, \"Elastic Exponential Linear Units for Convolutional Neural Networks\", Neurocomputing, 406:253-266, 2020. (IF: 4.438)Jinah Kim, Jaeil Kim, Taekyung Kim, Dong Huh, Sofia Caires, \"Wave-Tracking in the Surf Zone Using Coastal Video Imagery with Deep Neural Networks\", Atmosphere 2020, 11(3), 304 (IF: 2.046)Chanho Kim, Won Hwa Kim, Hye Jung Kim, Jaeil Kim, \"Weakly-supervised US breast tumor characterization and localization with a box convolution network\", Volume 11314, SPIE Medical Imaging 2020: Computer-Aided Diagnosis; 1131419 (Oral Presentation)2019Jinah Kim, Sungwon Shin, Jaeil Kim, \"Wave Celerity Estimation using Unsupervised Image Registration from Video Imagery\", Journal of KIISE, Vol. 46, No. 12, pp. 1296-1303. 2019. (Domestic Journal)Dong Huh, Jaeil Kim, Jinah Kim, \"Raindrop Removal and Background Information Recovery in Coastal Wave Video Imagery using Generative Adversarial Networks\", Journal of the Korea Computer Graphics Society, Vol. 25, No. 5, P. 1~9, 2019. (Domestic Journal)Jaeil Kim, Maria del Carmen Valdés Hernández, Jinah Park, \"Three-Dimensional Shape Modeling and Analysis of Brain Structures\", Journal of Visualized Experiments, (153), e59172, 2019. (IF: 1.325)Sungjoon Park, Doyoung Kwon, Sungmoon Jeong, Youngsup Lee, Jaechan Park, Minho Lee, Jaeil Kim, \"Anomaly Detection in Brain CT using an Uncertainty Autoencoder\", KICS Fall Conference 2019. (Domestic Conference)Jungrae Cho, Inchul Choi, Jaeil Kim, Sungmoon Jeong, Young-Sup Lee, Jaechan Park, Minho Lee. \"Affinity Graph based End-to-End Deep Convolutional Networks for CT Hemorrhage Segmentation\", In International Conference on Neural Information Processing, pp. 546-555, 2019Doyoung Kwon, Jaesin Ahn, Jaeil Kim, Inchul Choi, Sungmoon Jeong, Young-Sup Lee, Jaechan Park, and Minho Lee. \"Siamese U-Net with Healthy Template for Accurate Segmentation of Intracranial Hemorrhage.\" In International Conference on Medical Image Computing and Computer-Assisted Intervention (MICCAI), pp. 848-855. 2019. Taekyung Kim, Jaeil Kim, Jinah Kim. Hydrodynamic scene separation from video imagery of ocean wave using autoencoder. J Korea Comput Graph Soc 2019;25(4):9-16. (Domestic Journal)Kim D, Kim J, \"Elastic Multiple Parametric Exponential Linear Units for Convolutional Neural Networks\", Journal of KIISE, Vol. 46, No. 5, 469-477, 2019. (Domestic Journal)Chen G, Hong Y, Kim J, Zhang Y, Ma J, Shen D, Yap PT, “Prediction of Multi-Shell from Single-Shell Diffusion MRI Data via Graph Convolutional Neural Networks”, OHBM, Rome, Italy, June 9-13, 2019.Kim J, Hong Y, Chen G, Lin W, Yap PT, Shen D. \"Graph-Based Deep Learning for Prediction of Longitudinal Infant Diffusion MRI Data\". Computational Diffusion MRI. 2019:133. Hong Y, Kim J, Chen G, Lin W, Yap PT, Shen D, \"Longitudinal Prediction of Infant Diffusion MRI Data via Graph Convolutional Adversarial Networks\", IEEE Transactions on Medical Imaging, 17 April, 2019Shao Y, Kim J, Gao Y, Wang Q, Lin W, Shen D. Hippocampal Segmentation from Longitudinal Infant Brain MR Images via Classification-guided Boundary Regression. IEEE Access. 2019 Mar 11. Huh D, Kim T, Kim J, \"Patch-wise Weakly Supervised Learning for Object Localization in Video\", The 1st International Conference on AI in Information and Communication (ICAIIC 2019) , Japan, Feb.11-13, 2019 2018Yoon S, Seo S, Kim J, \"Automatic Foot Bone Segmentation in Plain Radiographs for Diagnosis of Foot Disorders\", Korea Software Congress 2018 (KSC2018), Dec.19-21, 2018 (Domestic Conference)Kim J, Hong Y, Chen G, Lin W, Yap PT, Shen D, \"Graph-Based Deep Learning for Prediction of Longitudinal Infant Diffusion MRI Data\", MICCAI 2018 Workshop on Computational Diffusion MRI, Spain, Sept.20, 2018Kim J, Hong Y, Chen G, Lin W, Yap PT, Shen D, \"Longitudinal Prediction of Pediatric Diffusion MRI Data using Graph-Based Deep Learning\", 104th RSNA Scientific Assembly and Annual Meeting, Chicago, USA, Nov. 25-30, 2018. Li G, Wang L, Yap PT, Wang F, Wu Z, Meng Y, Dong P, Kim J, Shi F, Rekik I, Lin W. Shen D, \"Computational Neuroanatomy of Baby Brains: A review\". NeuroImage. Mar. 21, 2018 Kim J, Chen G, Lin W, Yap PT, Shen D, \"Prediction of Diffusion-Weighted Appearance in Developing Infant Brain using Cycle-Consist Models\", OHBM, Singapore, 17-21 June, 2018Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 9493,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:20"
}