{
  "name": "Jae-sun Seo [Tech]",
  "homepage": "https://seo.ece.cornell.edu/professor",
  "status": "success",
  "content": "Professor – Seo Research Group Skip to main content Search: Submit Search Search Filters Search This Site Search Cornell Professor Jae-sun Seo received the B.S. degree from Seoul National University in 2001, and the M.S. and Ph.D. degree from the University of Michigan in 2006 and 2010, respectively, all in electrical engineering. He spent graduate research internships at Intel circuit research lab in 2006 and Sun Microsystems VLSI research group in 2008. From 2010 to 2013, he was with IBM T. J. Watson Research Center, where he worked on cognitive computing chips under the DARPA SyNAPSE project and energy-efficient integrated circuits for high-performance processors. In 2014, he joined ASU as an Assistant Professor in the School of ECEE. During the summer of 2015, he was a visiting faculty at Intel Circuits Research Lab. In 2020, he got promoted to an Associate Professor with tenure at ASU. From 2022 to 2023, he has been a visiting researcher at Meta Reality Labs. In July 2023, he joined the School of Electrical and Computer Engineering at Cornell Tech, as an Associate Professor. His research interests include efficient hardware design of machine learning / neuromorphic algorithms and integrated power management. Dr. Seo was a recipient of Samsung Scholarship (2004-2009), IBM Outstanding Technical Achievement Award (2012), NSF CAREER Award (2017), Facebook Distinguished Faculty Award (2020), Intel Outstanding Researcher Award (2021), and IEEE TVLSI Best Paper Award (2022). He is an IEEE Senior Member, and has served on the technical program committees for ISSCC (2022-2026), ESSCERC (2025), HPCA (2025), ISCA (2024), MLSys (2022), DAC (2018-2021, 2025), DATE (2021-2025), ICCAD (2018-2020), ISLPED (2013-2019, 2021, 2023-2024), and on the organizing committee for ICCD (2015-2017), AICAS (2021-2022), and ISICAS (2025). He also has served as the Associate Editor-in-Chief for IEEE Transactions on Circuits and Systems for Artificial Intelligence (TCASAI), Associate Editor for IEEE Transactions on Biomedical Circuits and Systems (TBioCAS), IEEE Open Journal of the Solid-State Circuits Society (OJ-SSCS), and IEEE Journal of Exploratory Solid-State Computational Devices and Circuits (JXCDC). Email: js3528@cornell.edu Office: Bloomberg Center 270, 2 West Loop Road, New York, NY 10044 (map) Phone: 646-971-3821",
  "content_length": 2338,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:22"
}