{
  "name": "Jae-Gil Lee 0001",
  "homepage": "http://dm.kaist.ac.kr/jaegil",
  "status": "success",
  "content": "Jae-Gil Lee | Data Mining Lab top of pageJae-Gil LeeKAIST Endowed Chair Professor School of Computing / Kim Jaechul Graduate School of AI (adjunct) / Graduate School of Data Science (adjunct) Korea Advanced Institute of Science and Technology (KAIST) Tel: +82-42-350-3545 Fax: +82-42-350-1610 E-mail: jaegil[at]kaist[dot]ac[dot]krBrief BioI am a Professor at School of Computing, Korea Advanced Institute of Science and Technology (KAIST) and am leading Data Mining Lab. Before that, I was a Postdoctoral Researcher at IBM Almaden Research Center and a Postdoc Research Associate at Department of Computer Science, University of Illinois at Urbana-Champaign. At IBM, I was one of the key contributors to IBM Smart Analytics Optimizer. At University of Illinois, I worked on spatio-temporal data mining with Prof. Jiawei Han. I earned the Ph.D degree under the supervision of Prof. Kyu-Young Whang from KAIST in 2005. My research interests encompass data-centric AI, deep learning-based big data analysis, mobility and stream data mining, and distributed deep learning. Our lab has been selected as a SW Star Lab by the Ministry of Science and ICT in 2020.Professional ExperienceFull ProfessorSchool of Computing, KAIST (2022. 9 ~ present)Associate ProfessorSchool of Computing, KAIST (2020.10 ~ 2022. 8) / Graduate School of Knowledge Service Engineering, KAIST (2014. 3 ~ 2020. 9)Assistant ProfessorDepartment of Knowledge Service Engineering, KAIST (2010. 12 ~ 2014.2)Postdoctoral ResearcherIBM Almaden Research Center (2008. 9 ~ 2010. 11)Postdoc Research AssociateDepartment of Computer Science, University of Illinois at Urbana-Champaign (2006. 7 ~ 2008. 8)Postdoctoral FellowDepartment of Computer Science, KAIST (2005. 3 ~ 2006. 6)Research InterestsData-Centric AIDeep Learning-Based Big Data AnalysisMobility and Stream Data MiningLarge-Scale Distributed Deep LearningAwardsMinister Award CertificateMinistry of Science, ICT and Future Planning, Korea Government, Apr. 2017Best Paper Award7th Int'l Conf. on Weblogs and Social Media (ICWSM), AAAI, July 2013Best Demonstration Award21st Int'l Conf. on Data Engineering (ICDE), IEEE, Apr. 2005Best Paper Award1st Int'l Conf. on Big Data and Smart Computing (BigComp), KIISE, Jan. 2014College of Engineering Technology Innovation AwardKAIST, Dec. 2018zEnterprise System Recognition AwardIBM Software Group, Nov. 2010Media AppearancesPrediction of Inbound COVID-19 Cases by AI TechnologiesKBS, YTN, YTN Science, Daejon MBC, TJB, TV Chosun, Aug. 19, 2020Science Concert in Fourth Industrial Revolution (in Korean)KBS1, Dec. 26, 2017Best Paper Award at AAAI ICWSM 2013 (in Korean)9 daily newspapers, July 31, 2013Professional ActivitiesIEEE Transactions on Knowledge and Data Engineering (TKDE), May 2019 ~ presentAssociate EditorPacific-Asia Conf. on Knowledge Discovery and Data Mining (PAKDD)Steering Committee MemberIEEE BigComp 2023Organizing ChairPAKDD 2017Program ChairACM KDD 2023, IEEE ICDM 2019Area ChairIEEE BigComp 2020, DASFAA 2012, ACM CIKM 2009Publicity ChairAAAI 2022 ~ 2023, ACM KDD 2021 ~ 2022, PAKDD 2018 ~ 2023Senior Program Committee MemberNeurIPS, ACM KDD, AAAI, IEEE ICDM, IEEE ICDE, WWW, VLDB, ACM SIGMOD, ACM CIKM, etc.Program Committee MemberData and Knowledge Engineering (DKE), Apr. 2018 ~ presentAssociate EditorLinks to Lab Homepage PublicationsDetails ProjectsDetails LecturesDetailsbottom of page",
  "content_length": 3379,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:22"
}