{
  "name": "Jae Jun Yoo",
  "homepage": "https://sites.google.com/view/jaejunyoo",
  "status": "success",
  "content": "Lab. of Advanced Imaging Tech.Search this siteEmbedded FilesSkip to main contentSkip to navigationLet there be LAIT!\"Modeling the Unseen, Understanding the Unknown.\"LAIT는 인간의 인식을 넘어, 우리가 보고 느끼는 세상을 더욱 정교하게 모델링하고 이해하는 것을 목표로 합니다. 그리고 생성 모델이 이를 위한 가장 강력한 해결책이자 효과적인 접근법이라고 믿습니다. 이 때, 단순히 높은 성능의 모델을 목표로 하기보다는, 설명 가능하고, 효율적이며, 직관적이고, 사용하기 쉬운 이미징 알고리즘 개발을 추구합니다. 이를 통해 세상을 경험하고 해석하는 방식에 혁신적인 변화를 일으키고자 합니다.Our mission is to redefine the boundaries of what can be seen and understood. Together, we go beyond perception, modeling the world we see and sense. We challenge the limits by developing intelligent models that reveal structures of the world beyond our senses.Generative models, we believe, are the most powerful—and indeed the only—solution for building systems that understands the world.Grounded in simple, clear principles, we aim to create technology that is both intuitive and easy to use—solutions that transform how we experience and interpret our world.By combining the rigor of signal processing with the creativity of machine learning, we transform imaginations into reality. We build algorithms that analyzes and synthesizes images, audios, and videos to construct comprehensive \"world models\" of the seen and the sensed. Along the way, our models uncover mathematical insights and reveal the beauty of hidden patterns in nature, pushing the frontier of signal modeling and interpretation.News[2025.09] Congratulations! Prof. Jaejun have recieved Outstanding Early Career Researcher Award(우수신진연구자상) from IEIE AISP Society. [2025.06] Congratulations! Our paper \"Understanding Flatness in Generative Models: Its Role and Benefits\" has been accepted to ICCV 2025! Good job Kyeong kook :)[2025.06] Congratulation! Jeongho and Hyeonjin have achieved third place in the Multimodal Arial View Imagery Classification Challenge 2025 at CVPR! [2025.06] Congratulations! Two papers from our group have been accepted to MICCAI 2025! Great job Dayoung and Sergey!\"Dynamic-Aware Spatio-temporal Representation Learning for Dynamic MRI Reconstruction\"\"Spherical Diffusion Process for Score-Guided Cortical Correspondence via Spectral Attention\"[2025.04] Congratulations! Our paper \"MultiDreamer3D: Multi-concept 3D Customization with Concept-Aware Diffusion Guidance\" has been accepted to IJCAI 2025! Good job Wooseok :)[2025.02] Congratulations! Our paper \"BF-STVSR: B-Splines and Fourier-Best Friends for High Fidelity Spatial-Temporal Video Super-Resolution\" has been accepted to CVPR 2025! Good job Eunjin and Hyeonjin :)[2025.02] Congratulation! Our students received Best Paper Awards (one Bronze) and two Best Poster Awards  from IPIU2025 ![2025.01] Congratulations! Our paper \"PRISM: Privacy-Preserving Improved Stochastic Masking for Federated Generative Models\" has been accepted to ICLR 2025! Good job Kyeong kook :)[2024.12] Congratulations! Our paper \"Singular Value Scaling: Efficient Generative Model Compression via Pruned Weights Refinement\" has been accepted to AAAI 2025! Good job Hyeonjin :)[2024.10] Congratulation! Jeongho and Hyeonjin have achieved third place among 77 competing teams in the Multimodal Semantic Segmentation Challenge 2024 at IEEE WHISPERS (Workshop on Hyperspectral Imaging and Signal Processing: Evolution in Remote Sensing)! [2024.09] Congratulation! Sanghun has been accepted into NAVER AI lab's internship program! [2024.08] Congratulation! Chan has been accepted into CJ AI's internship program! [2024.07] Congratulations! Three papers from our group have been accepted to ECCV 2024! \"PosterLlama: Bridging Design Ability of Langauge Model to Contents-Aware Layout Generation\"\"Nickel and Diming Your GAN: A Dual-Method Approach to Enhancing GAN Efficiency via Knowledge Distillation\"\"Hybrid Video Diffusion Models with 2D Triplane and 3D Wavelet Representation\"Read more[Wanted] I am looking for strong and motivated students (or interns). The partial list of future project topics are as follows: Computational Imaging  (e.g, super-resolution, image compression, medical image reconstruction, etc.)Generative models for High-Dimensional Data (beyond 2D)Better Conditioning, Better GenerationExplainable & Reliable Generation Understanding Intelligent Models & RepresentationsFor more details, please check Research Questions. Students who are interested in joining our lab, please check Call for Students & Interns. Publications (partial list)For an entire publication list, please check my Google Scholar Understanding Flatness in Generative Models: Its Role and BenefitsTaehwan Lee*, Kyeongkook Seo*, Jaejun Yoo, Sung Whan Yoon ICCV 2025 (Corresponding author)Paper | Code | Project pageDynamic-Aware Spatio-temporal Representation Learning for Dynamic MRI ReconstructionDayoung Baik and Jaejun YooMICCAI 2025 (Corresponding author)Paper | Code (Coming soon) | Project page MultiDreamer3D: Multi-concept 3D Customization with Concept-Aware Diffusion Guidance Wooseok Song, Seunggyu Chang, Jaejun Yoo IJCAI 2025 (Corresponding author)Paper | Code | Project page BF-STVSR: B-Splines and Fourier-Best Friends for High Fidelity Spatial-Temporal Video Super-ResolutionEunjin Kim*, Hyeonjin Kim*, Kyong Hwan Jin, Jaejun YooCVPR 2025 (Corresponding author)Paper | Code | Project page PRISM: PRivacy-preserving Improved Stochastic Masking for Federated Generative ModelsKyeongkook Seo, Dong-jun Han and Jaejun Yoo ICLR 2025 (Corresponding author)Paper | Code | Project pageSingular Value Scaling: Efficient Generative Model Compression via Pruned Weights Refinement Hyeonjin Kim and Jaejun Yoo AAAI 2025 (Corresponding author)Paper |  Code | Project pageHVDM: Hybrid Video Diffusion Models with 2D Triplane and 3D Wavelet RepresentationKihong Kim, Haneol Lee, Jihye Park, Seyeon Kim, Kwanghee Lee, Seungryong Kim, Jaejun Yoo ECCV 2024 (Corresponding author)Paper |  Code | Project pagePosterLlama: Bridging Design Ability of Language Model to Content-Aware Layout GenerationJaejung Seol, Seojun Kim, Jaejun Yoo ECCV 2024 (Corresponding author)Paper |  Code | Project pageNickel and Diming Your GAN: A Dual-Method Approach to Enhancing GAN Efficiency via Knowledge DistillationSangyeop Yeo, Yoojin Jang, Jaejun Yoo ECCV 2024 (Corresponding author)Paper |  Code | Project pageSTREAM : Spatio-TempoRal Evaluation and Analysis Metric for Video Generative ModelsPum Jun Kim, SeoJun Kim, Jaejun Yoo ICLR 2024 (Corresponding author)Paper |  Code | Project pageTopP&R: Robust Support Estimation Approach for Evaluating Fidelity and Diversity in Generative ModelsPum Jun Kim, Yoojin Jang, Jisu Kim, Jaejun YooNeurIPS 2023 (Corresponding author)Paper |  Code | Project pageCan We Find Strong Lottery Tickets in Generative Models?Sangyeop Yeo, Yoojin Jang, Jy-yong Sohn, Dongyoon Han, Jaejun YooAAAI 2023 (Corresponding author)Paper | Supplementary |  Project pageRethinking the Truly Unsupervised Image-to-Image TranslationKyungjune Baek, Yunjey Choi, Youngjung Uh, Jaejun Yoo, Hyunjung ShimICCV 2021 (Research Mentor)Paper (will be updated soon) | Code Time-Dependent Deep Image Prior for Dynamic MRIJaejun Yoo, Kyong Hwan Jin, Harshit Gupta, Jerome Yerly, Matthias Stuber, Michael UnserIEEE TMI (JCR: Journal Citation Reports IF rank upper 10%) 2021 (First author)Paper (Journal) | Paper (arXiv ver.) | CodeReliable Fidelity and Diversity Metrics for Generative ModelsMuhammad Ferjad Naeem*, Seong Joon Oh*, Youngjung Uh, Yunjey Choi, Jaejun YooICML 2020 (Corresponding author)Paper | Code | Video (En) | Video (Kr)StarGAN v2: Diverse Image Synthesis for Multiple DomainsYunjey Choi*, Youngjung Uh*, Jaejun Yoo*, Jung-Woo HaCVPR 2020 (Co-first author)Paper | Code | VideoRethinking Data Augmentation for Image Super-resolution: A Comprehensive Analysis and a New StrategyJaejun Yoo*, Namhyuk Ahn*, Kyung Ah SohnCVPR 2020 (Co-first author)Paper | Code | VideoPhotorealistic Style Transfer via Wavelet TransformsJaejun Yoo*, Youngjung Uh*, Sanghyuk Chun*, Byeongkyu Kang, and  Jung-Woo HaICCV 2019 (Co-first author)Paper | Code | Video (En) | Video (Kr)Selected TalksImage Enhancement Techniques:  CutBlur, WCT2, and SimUSR                                                         CVPR 2020 (Naver LABS)신호처리 이론으로 실용적인 스타일 변환 모델 만들기 (Better Faster Stronger Transfer)Deview 2019Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 8280,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:17"
}