{
  "name": "Jae Joon Kim",
  "homepage": "https://vlsi.snu.ac.kr/team",
  "status": "success",
  "content": "Team – SNU VLSI Homepage TeamProfessor Jae-Joon Kim Professor Jae-Joon Kim Professor Department of Electrical and Computer Engineering, Seoul National University Office BLDG 301 Room #805 Email kimjaejoon at snu.ac.kr Phone +82-2-880-1803 Research Interests Low power VLSI design Algorithm/Hardware Co-Design for In-Memory Neural Network Computing Neural network processor design On-device machine learning algorithm Work Experiences Professor, Seoul National University, 2021.9 – Present Co-founder & Advisor, SqueezeBits, 2022.3-Present Professor, POSTECH, 2019.3 – 2021.8 Associate Professor, POSTECH, 2013.2 – 2019.2 Research Staff Member, IBM T. J. Watson Research Center, 2004. 5 – 2013.1 Education Ph.D. Electrical and Computer Eng., Purdue University, 2004. M.S. School of Electrical Eng., Seoul National University, 1998. B.S. Dept. of Electronics Eng., Seoul National University, 1994. Students Hyeongju Ha Assistant Researcher Junhyeok Kim M.S Student Sungwoo Choi M.S/Ph.D Student Junhyeok Lee M.S/Ph.D Student Sooah Choi M.S/Ph.D Student Woohyun Lee M.S/Ph.D Student Junhee Lee M.S/Ph.D Student Inseong Choi M.S/Ph.D Student Jinsu Kim M.S/Ph.D Student Munyeol Park M.S/Ph.D Student Wonjun Han M.S/Ph.D Student Juchan Lee M.S/Ph.D Student Gyeonghwan Park M.S/Ph.D Student Kyungseok Oh M.S/Ph.D Student Jiwon Song M.S/Ph.D Student Juheun Lee M.S/Ph.D student Dohyun Kim M.S/Ph.D Student (Lab Representative) Hyesung Jeon M.S/Ph.D Student Wonkyung Han M.S/Ph.D Student Dongwon Jo M.S/Ph.D Student Jehun Lee Ph.D Student Byungkuk Yoon Ph.D Student Hyunjin Kim Ph.D Student Jaeyong Jang Ph.D Student Sanghyeok Han Ph.D Student Jihoon Park Ph.D Student Hyunmyung Oh M.S/Ph.D Student Hyunsung Yoon M.S/Ph.D Student Hyeongju Ha Assistant Researcher Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) mnv1009@snu.ac.kr Research Interests Neural Network Acceleration Education 2022.2 B.S in ECE, SNU Junhyeok Kim M.S Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) looky92@snu.ac.kr Research Interests Process in memory Education 2016.08. B.S in Physics, Seoul National University Sungwoo Choi M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) sungwoo.choi at snu.ac.kr Research Interests Deep Learning Accelerator Education 2025.2 B.S in ECE, Seoul National University Junhyeok Lee M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) junhyeok.lee at snu.ac.kr Research Interests Compute in memory / Technology-Circuit Co-design Education 2025.2 B.S in ECE, Seoul National University Sooah Choi M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) suachoi267 at snu.ac.kr Research Interests Compute in memory, VLSI Education 2025.2 B.S in ECE, Seoul National University Woohyun Lee M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) woohyun.lee@snu.ac.kr Research Interests Technology-Circuit Co-design Education 2025.2 B.S in MSE & SSAI, Seoul National University Junhee Lee M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) imjun0304@snu.ac.kr Research Interests Processing in memory, Ising machine Education 2025.2 B.S. in ECE, Seoul National University Inseong Choi M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) inseong.choi at snu.ac.kr Research Interests Deep Learning Accelerator/Processing in Memory Education 2025.2 B.S in ECE, Seoul National University Jinsu Kim M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) kim.jinsu at snu.ac.kr Research Interests Deep Learning Accelerator, Ising Computing Education 2024.2 B.S in ECE, Seoul National University Munyeol Park M.S/Ph.D Student Seoul National University (SNU) Interdisciplinary Program in Artificial Intelligence (IPAI) opendoor at snu.ac.kr Research Interests Deep Learning Accelerator Education 2021.2 B.S. in EE, POSTECH Work Experiences 2021.6 – 2024.5 ROND in Advanced Defense Science & Technology Research Institute, Agency for Defense Development Wonjun Han M.S/Ph.D Student Seoul National University (SNU) Interdisciplinary Program in Artificial Intelligence (IPAI) wonjun.han at snu.ac.kr Research Interests Deep Learning Accelerator, Processing in Memory Education 2024.2 B.S. in EE, POSTECH Juchan Lee M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) juchan.lee at snu.ac.kr Research Interests Deep Learning Accelerator, VLSI Education 2024.2 B.S in ECE, Seoul National University Gyeonghwan Park M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) gyeonghwan.park at snu.ac.kr Research Interests Deep Learning Accelerator/Processing in Memory Education 2024.2 B.S in ECE, Seoul National University Kyungseok Oh M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) kyungseok.oh at snu.ac.kr Research Interests Neural Network Acceleration/Compression Education 2023.8 B.S in ECE, Seoul National University Jiwon Song M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) jiwon.song at snu.ac.kr https://jiwonsong-dev.github.io/ Research Interests Neural Network Acceleration/Compression Education 2024.2 B.S in ECE, Seoul National University Juheun Lee M.S/Ph.D student Seoul National University (SNU) Interdisciplinary Program in Artificial Intelligence (IPAI) juheun.lee@snu.ac.kr Research Interests Deep Learning Accelerator, VLSI Education 2023.2 B.S. in ECE, Seoul National University Dohyun Kim M.S/Ph.D Student (Lab Representative) Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) dohyun.kim@snu.ac.kr Research Interests Deep Learning Accelerator, VLSI Education 2023.2 B.S in EE, Yonsei University Hyesung Jeon M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) hjeon2k at snu.ac.kr Research Interests Deep Learning Accelerator Education 2023.2 B.S in ECE, Seoul National University Wonkyung Han M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) wonkyung.han at snu.ac.kr Research Interests Processing in Memory, VLSI Education 2023.2 B.S. in EEE, Sungkyunkwan University Dongwon Jo M.S/Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) dongwonjo at snu.ac.kr Research Interests Deep Learning Accelerator, Deep Learning Education 2022.8 B.S in EE, Yonsei University Jehun Lee Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) jehun.lee at snu.ac.kr Research Interests Deep Learning Hardware Accelerator Education 2021.8. B.S in ECE, UNIST ~2022.2. ISRC 2024.2. M.S. in ECE, Seoul National University Byungkuk Yoon Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) bkyoon at snu.ac.kr Research Interests In-Memory Computing Design Education 2010.2 B.S in EE, Hanyang Univ 2012.8 M.S in ECE, KAIST 2012.8~ Staff Engineer in SK Hynix Hyunjin Kim Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) hyunjin.kim at snu.ac.kr Research Interests Machine Learning Accelerator, VLSI Education 2021.2 B.S. in SSE, SKKU 2022.8. M.S in Convergence IT Engineering, POSTECH Jaeyong Jang Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) Jaeyongjang at snu.ac.kr Research Interests Deep Learning Accelerator Education 2021.2 B.S. in EEE, Chung-Ang University 2022.8. M.S in Convergence IT Engineering, POSTECH Sanghyeok Han Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) hansh778 at snu.ac.kr Research Interests Machine Learning Accelerator Education 2021.2 B.S. in CiTE, POSTECH 2022.8. M.S in Convergence IT Engineering, POSTECH Jihoon Park Ph.D Student Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) jihoonpark at snu.ac.kr Research Interests Machine Learning Accelerator, VLSI Education 2019.8 B.S. in CiTE, POSTECH 2022.2. M.S in Convergence IT Engineering, POSTECH Hyunmyung Oh M.S/Ph.D Student Pohang University of Science and Technology (POSTECH) Department of Convergence IT Engineering (CiTE) hyunmyung.oh at postech.ac.kr Research Interests In-Memory Computing Education 2019.2 B.S. in CiTE, POSTECH Hyunsung Yoon M.S/Ph.D Student Pohang University of Science and Technology (POSTECH) Department of Convergence IT Engineering (CiTE) hyunsung.yoon at postech.ac.kr Research Interests Machine Learning Accelerator Sparse Processing Education 2019.2 B.S. in EEE, Chung-Ang University Post-doc Researchers Beomseok Kang Post-doc Researcher Beomseok Kang Post-doc Researcher Seoul National University (SNU) Department of Electrical and Computer Engineering (ECE) beomseok at snu.ac.kr Research Interests Efficient Deep Learning Education 2020.2 B.S in EE, Sungkyunkwan University 2022.8 M.S. in ECE, Georgia Institute of Technology 2024.12 Ph.D. in ECE, Georgia Institute of Technology Staffs Juae Choi Staff Juae Choi Staff juaechoi at snu.ac.kr Phone +82-54-279-8879 Alumni – Ph.D. Munhyeon Kim Assistant Professor, Seoul National University of Science and Technology Nameun Kang Staff Engineer, SK hynix Inhwan Lee Staff Engineer, SK hynix Seunghwan Song Senior Engineer, Samsung Electronics Eunhwan Kim Staff Researcher, Samsung Advanced Institute of Technology (SAIT) Yulhwa Kim Assistant Professor, Sungkyunkwan University Naebeom Park NPU Architect, SAPEON Korea Inc. Taesu Kim CTO & Co-Founder, SqueezeBits Inc. Daehyun Ahn Tech Lead & Co-",
  "content_length": 20200,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:18"
}