{
  "name": "Jaegul Choo",
  "homepage": "https://sites.google.com/site/jaegulchoo",
  "status": "success",
  "content": "Jaegul Choo - KAISTSearch this siteEmbedded FilesSkip to main contentSkip to navigationJaegul Choo (주재걸) [Short Bio] [CV]KAIST-Endowed Chair Professor Kim Jaechul Graduate School of Artificial Intelligence, KAISTOffice Address: 8 Seongnam-daero 331 beon-gil, KINS Tower, Suite 1801, Bundang-gu, Seongnam-si, Gyeonggi 13558, South KoreaOffice Phone No.: +82-42-350-1813E-mail: jchoo@kaist.ac.krMeeting Request: Schedule a meetingLink to My Lab WebsiteAnnouncement[2025.06.19] We are looking for Postdocs at a competitive salary for at least 90 million KRW per year through InnoCORE National Program. If you are interested, please apply [Link] . 대학원 지원을 고려하는 분들은 다음 문서를 참고해주세요: [FAQ] I am looking for prospective graduate students, and undergraduate students. If you're interested, send me an email with your full Curriculum Vitae and transcript. Courses[VIDEO] Spring 2019, COSE111: Math for Computer Science I (Linear Algebra)[VIDEO] Spring 2019,  AAA635: Data Mining[VIDEO] Spring 2019, DFC609: Big Data Analysis Basics[VIDEO] Fall 2018, COSE474: Deep Learning[VIDEO] Fall 2018,  AAA625: Numerical Linear Algebra[VIDEO] Fall 2018, DFE606: Big Data Analysis Basics[VIDEO] Spring 2018, COSE111: Math for Computer Science I (Linear Algebra)[VIDEO] Spring 2018, AAA606: Natural Language Processing Applications[VIDEO] Spring 2018, DFC609: Big Data Analysis Basics[VIDEO] Fall 2017, COSE492: Deep Learning[VIDEO] Fall 2017, COSE112: Math for Computer Science II (Probability and Statistics)[VIDEO] Fall 2017, CVH109: Big Data and Information Retrieval [VIDEO] Fall 2017, DFE606: Big Data Analysis Basics[VIDEO] Spring 2017, COSE111: Math for Computer Science I (Linear Algebra)[VIDEO] Spring 2017, AAA638: Visual Analytics[VIDEO] Spring 2017, CVH126: Data Science[VIDEO] Fall 2016, COSE112: Math for Computer Science II (Probability and Statistics)[VIDEO] Fall 2016, AAA625: Numerical Linear Algebra[VIDEO] Spring 2016, COSE111: Math for Computer Science I (Linear Algebra)Spring 2016, CRE653: Data MiningFall 2015, COSE472: Information RetrievalFall 2015, AAA638: Visual AnalyticsSpring 2015, COSE111: Math for Computer Science I (Linear Algebra)Spring 2015, CRE653: Data MiningResearch InterestVisual analytics for user-driven machine learning and deep learningDeep learning for reading comprehension-based question answeringImage generation and translation via generative adversarial networksDeep learning for program debugging and auto-completionSocial media analysis and text miningWeb and user log miningLarge-scale interactive 2D embedding using t-SNENonnegative matrix factorization (NMF) for clustering and topic modeling AwardsBest Paper Honorable Mention Award at SIGIR'24, 2024Best Student Paper Award at ICASSP'23, 2023Best Short-Paper Honorable Mention Award at EuroVIS'22, 2022Best Short-Paper Honorable Mention Award at SIGIR'22, 2022IEEE VIS'20 10-Year Test-of-Time Award for IEEE VAST 2010 Paper 'iVisClassifier: an Interactive Visual Analytics System for Classification Based on Supervised Dimension Reduction,' 2020Best Student Paper Award at ICDM'16, 2016NAVER Young Faculty Award, 2015Outstanding Research Scientist Award at Georgia Tech, 2015Best Poster Award at VAST'14, 2014Selected Publications [Google Scholar]2025Temporal In‑Context Fine‑Tuning for Versatile Control of Video Diffusion ModelsKinam Kim, Junha Hyung, and Jaegul ChooConference on Neural Information Processing Systems (NeurIPS), 2025 (24.5% acceptance rate), Accepted. Characterizing Dataset Bias via Disentangled Visual ConceptsJinho Choi, Hyesu Lim, Steffen Schneider, and Jaegul ChooConference on Neural Information Processing Systems (NeurIPS), 2025 (24.5% acceptance rate), Accepted. Delving into Large Language Models for Effective Time-Series Anomaly DetectionJunwoo Park, Kyudan Jung, Dohyun Lee, Hyuck Lee, Daehoon Gwak, ChaeHun Park, Jaegul Choo, and Jaewoong ChoConference on Neural Information Processing Systems (NeurIPS), 2025 (24.5% acceptance rate), Accepted. Attend-and-Refine: Interactive Keypoint Estimation and Quantitative Cervical Vertebrae Analysis for Bone Age AssessmentJinhee Kim,* Taesung Kim,* Taewoo Kim, Dong-Wook Kim, Byungduk Ahn, Yoon-Ji Kim, In-Seok Song, and Jaegul Choo (*: equal contributions)Medical Image Analysis, 2025, Accepted.  Machine Learning-based Classification of Adrenal Tumors Using Clinical, Hormonal, and Body Composition DataSeung Shin Park,* Jongsung Noh,* Jinhee Kim,* Taesung Kim, Hae Jin Seo, Chang Ho Ahn,  Jaegul Choo, Man Ho Choi, Jung Hee Kim (*: equal contributions)European Journal of Endocrinology, 2025, Accepted.  Two-Stage Deep Learning Model for Adrenal Nodule Detection on CT Images: A Retrospective StudyChang Ho Ahn,* Taewoo Kim,* Kyungmin Jo, Seung Shin Park, Min Joo Kim, Ji Won Yoon, Taek Min Kim, Sang Youn Kim, Jung Hee Kim, and Jaegul Choo (*: equal contributions)Radiology, 2025, Accepted.  PromptDresser: Improving the Quality and Controllability of Virtual Try-On via Generative Textual Prompt and Prompt-aware MaskJeongho Kim,* Hoiyeong Jin,* Sunghyun Park, and Jaegul Choo (*: equal contributions)International Conference on Computer Vision (ICCV), 2025 (24.0% acceptance rate). Fair Generation without Unfair Distortions: Debiasing Text-to-Image Generation with Entanglement-Free AttentionJeonghoon Park, Juyoung Lee, Chaeyeon Chung, Jaeseong Lee, Jaegul Choo, Jindong GuInternational Conference on Computer Vision (ICCV), 2025 (24.0% acceptance rate). Evaluating Visual and Cultural Interpretation: The K-Viscuit Benchmark with Human-VLM CollaborationYujin Baek,* ChaeHun Park,* Jaeseok Kim, Yu-Jung Heo, Du-Seong Chang, and Jaegul Choo (*: equal contributions)Annual Meeting of the Association for Computational Linguistics (ACL), Long Paper, 2025, Accepted. Opt-Out: Investigating Entity-Level Unlearning for Large Language Models via Optimal TransportMinseok Choi, Daniel Rim, Dohyun Lee, and Jaegul ChooAnnual Meeting of the Association for Computational Linguistics (ACL), Long Paper, 2025, Accepted. Revisiting LLMs as Zero-Shot Time Series Forecasters: Small Noise Can Break Large ModelsJunwoo Park, Hyuck Lee, Dohyun Lee, Daehoon Gwak, and Jaegul ChooAnnual Meeting of the Association for Computational Linguistics (ACL), Short Paper, 2025, Accepted. Exploring In-context Example Generation for Machine TranslationDohyun Lee, Seungil Chad Lee, Chanwoo Yang, Yujin Baek, and Jaegul ChooAnnual Meeting of the Association for Computational Linguistics (ACL), Findings Paper, 2025, Accepted. To Chat or Task: a Multi-turn Dialogue Generation Framework for Task-Oriented Dialogue SystemsDaniel Rim, Minsoo cho, Changwoo Chun, and Jaegul ChooAnnual Meeting of the Association for Computational Linguistics (ACL), Industry Track, 2025, Accepted as Oral Presentation. Hyperspherical Normalization for Scalable Deep Reinforcement LearningHojoon Lee,* Youngdo Lee,* Takuma Seno, Donghu Kim, Peter Stone, and Jaegul Choo (*: equal contributions) International Conference on Machine Learning (ICML), 2025, Accepted as Spotlight Presentation (2.6% acceptance rate for spotlight papers).Devil is in the Detail: Towards Injecting Fine Details of Image Prompt in Image Generation via Conflict-free Guidance and Stratified AttentionKyungmin Jo, Jooyeol Yun, and Jaegul Choo IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025, Accepted. Zero-Shot Head Swapping in Real-World ScenariosSohyun Jeong, Taewoong Kang, Hyojin Jang, and Jaegul Choo IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025, Accepted. Spatiotemporal Skip Guidance for Enhanced Video Diffusion SamplingJunha Hyung, Kinam Kim, Susung Hong, Min-Jung Kim, and Jaegul Choo IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2025, Accepted. Single Ground Truth Is Not Enough: Adding Flexibility to Aspect-Based Sentiment Analysis EvaluationSoyoung Yang, Hojun Cho, Jiyoung Lee, Sohee Yoon, Edward Choi, Jaegul Choo, and Won Ik ChoAnnual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL), 2025, Accepted. SurFhead: Affine Rig Blending for Geometrically Accurate 2D Gaussian Surfel Head AvatarsJaeseong Lee, Taewoong Kang, Marcel Buehler, Min-Jung Kim, Sungwon Hwang, Junha Hyung, Hyojin Jang, and Jaegul Choo International Conference on Learning Representations (ICLR), 2025, Accepted (32.08% acceptance rate).Sparse Autoencoders Reveal Selective Remapping of Visual Concepts during AdaptationHyesu Lim, Jinho Choi, Jaegul Choo, and Steffen Schneider International Conference on Learning Representations (ICLR), 2025, Accepted (32.08% acceptance rate).SimBa: Simplicity Bias for Scaling Up Parameters in Deep Reinforcement LearningHojoon Lee, Dongyoon Hwang, Donghu Kim, Hyunseung Kim, Jun Jet Tai, Kaushik Subramanian, Peter R. Wurman, Jaegul Choo, Peter Stone, and Takuma Seno International Conference on Learning Representations (ICLR), 2025, Accepted as Spotlight Presentation (5.1% acceptance rate for spotlight papers).What to Preserve and What to Transfer: Faithful, Identity-Preserving Diffusion-based Hairstyle TransferChaeyeon Chung, Sunghyun Park, Jeongho Kim, and Jaegul ChooAAAI Conference on Artificial Intelligence (AAAI), 2025, Accepted (23.40% acceptance rate). Enabling Region-Specific Control via Lassos in Point-Based ColorizationSanghyeon Lee, Jooyeol Yun, and Jaegul ChooAAAI Conference on Artificial Intelligence (AAAI), 2025, Accepted (23.40% acceptance rate). Disentangling Subject-Irrelevant Elements in Personalized Text-to-Image Diffusion via Filtered Self-distillationSeunghwan Choi, Jooyeol Yun, Jeonghoon Park, and Jaegul ChooWinter Conference on Applications of Computer Vision (WACV), 2025, Accepted.Skip-and-Play: Depth-Driven Pose-Preserved Image Generation for Any ObjectsKyungmin Jo and Jaegul ChooWinter Conference on Applications of Computer Vision (WACV), 2025, , Accepted as Oral Presentation. 2024EPIC: Effective Prompting for Imbalanced-Class Data Synthesis in Tabular Data Classification via Large Language ModelsJinhee Kim,*",
  "content_length": 65749,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:20"
}