{
  "name": "Jaeha Kung",
  "homepage": "https://idslab.korea.ac.kr",
  "status": "success",
  "content": "IDSLabSearch this siteEmbedded FilesSkip to main contentSkip to navigationIntelligent digital systems labWelcome to IDSLab at KU!Research topicsHigh-performance system design for training deep neural networksLightweight machine learning algorithms for energy-efficient inference enginesAutomated search of efficient AI modelsEnergy-efficient hardware accelerator for scientific computingAnti-tampering hardware using in-memory-computingSpike-driven neural network design and its hardware implementationPower-aware/thermal-aware system design methodologyBroader research interests include efficient AI algorithms, digital IC design, and accelerator/computer architecture. We look forward to working with highly motivated students. Please send me an e-mail if you are interested in pursuing a PhD or an integrated MS-PhD program.RECENT NEWSOur recent work on training-free full spike-driven Transformers got a silver prize at the Samsung Humantech Paper Awards. Congrats to Sangwoo Hwang, Yejin Lee, Donghun Lee, and Jiyong Park!Our collaborated research between Korea University and DGIST on a flexible on-device NeRF rendering engine has been accepted to IEEE/ACM ISCA'25. Big congrats to Seock-Hwan Noh!We have 3 papers accepted at IEEE/ACM ISLPED'25. Congrats to Sangwoo Jung, Hojin Lee, Dahoon Park, Jiyong Park, Seock-Hwan Noh!!Our recent work on 3D NAND flash PIM for serving single-batch LLMs has been accepted for presentation at IEEE ICCD'25. Congrats to Yongjoo Jang!Our recent work on versatile inference- and training-proof microscaling (MX) format has been accepted for presentation at DATE'26. Kudos to Dahoon Park and Jahyun Koo!Our recent work on the optimization of Gustavson's algorithm on SNN acceleration has been accepted for presentation at IEEE HPCA'26. Congrats to Sangwoo Hwang and Donghun Lee!Our survey paper on extreme quantization of neural networks and their realization in CIM hardware has been accepted for publication at IEEE IoT Journal. Congrats to Dahoon Park!ContactE-mailPrincipal Investigator – Jaeha Kung (jhkung@korea.ac.kr)Lab Representative – Seunghyun Lee (coder@korea.ac.kr) Lab Coordinator – Junsang Park (jshparksh@dgist.ac.kr) Please contact \"Lab Coordinator\" for inquiries about 'Lab Internship, Information about IDS Lab, etc'.Location서울특별시 성북구 안암로 145, 신공학관 512호 (교수님 연구실) / 501호 (학생 연구실)145 Anam-ro, Seongbuk-gu, Seoul, 02841, Republic of Korea,New Engineering Hall Room 512 (Professor Lab) / Room 501 (Student Lab)Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2539,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:21"
}