{
  "name": "Jaemin Yoo",
  "homepage": "https://jaeminyoo.github.io",
  "status": "success",
  "content": "Jaemin Yoo @ KAIST Jaemin Yoo Assistant Professor at KAIST I am an Assistant Professor in the School of Electrical Engineering at KAIST and jointly affiliated with the Kim Jaechul Graduate School of AI. Previously, I was a postdoctoral research fellow at Carnegie Mellon University, where I worked with Leman Akoglu and Christos Faloutsos. I received my Ph.D. and B.S. in Computer Science and Engineering from Seoul National University. I received the Google PhD Fellowship, the Qualcomm Innovation Fellowship, and the Outstanding Dissertation Award from the Korean Academy of Science and Technology. My research interests cover various topics in data mining and machine learning, including graph neural networks, time series analysis, recommender systems, and anomaly detection. Email: jaemin (at) kaist.ac.kr Research Group: KAIST Data AI Lab External Links: [ Google Scholar | DBLP | LinkedIn ] About Me Positions KAIST (Aug. 2023 - Present) Assistant Professor, School of Electrical Engineering Adjunct Professor, Kim Jaechul Graduate School of AI Carnegie Mellon University (Mar. 2022 - Jun. 2023) Postdoctoral Research Fellow, Heinz College Advisors: Prof. Leman Akoglu and Prof. Christos Faloutsos Education Seoul National University (Mar. 2016 - Feb. 2022) Ph.D. in Computer Science and Engineering Thesis: Probabilistic Approaches for Node and Graph Classification Advisor: Prof. U Kang Seoul National University (Mar. 2012 - Feb. 2016) B.S. in Computer Science and Engineering Awards and Honors Distinguished PC Member of ECML PKDD 2025 (Nov. 2025) S-OIL Outstanding Dissertation Award (Dec. 2022) SNU CSE Outstanding Dissertation Award (Feb. 2022) One of the Best-Ranked Papers of ICDM 2021 (Dec. 2021) SNU BK21 Outstanding Graduate Student Award (Jul. 2021) SIAM Student Travel Award (Apr. 2021) SNU BK21 Star Student Researcher Award (Feb. 2021) Qualcomm Innovation Fellowship (Dec. 2020) Youlchon AI Star Award (Sep. 2020) Google PhD Fellowship (In Machine Learning; Sep. 2019) Samsung HumanTech Paper Award (Feb. 2019) Google Conference Scholarship (Nov. 2017) Publications 2026 Feature-Centric Unsupervised Node Representation Learning Without Homophily Assumption Sunwoo Kim, Soo Yong Lee, Kyungho Kim, Hyunjin Hwang, Jaemin Yoo, Kijung Shin AAAI 2026 [ to appear ] 2025 Simple and Behavior-Driven Augmentation for Recommendation with Rich Collaborative Signals Doyun Choi, Cheonwoo Lee, and Jaemin Yoo BigData 2025 [ paper | code ] Parameter-Free Hypergraph Neural Network for Few-Shot Node Classification Chaewoon Bae, Doyun Choi, Jaehyun Lee, and Jaemin Yoo NeurIPS 2025 [ paper | code ] 'Hello, World!': Making GNNs Talk with LLMs Sunwoo Kim, Soo Yong Lee, Jaemin Yoo, and Kijung Shin EMNLP 2025 Findings [ paper | code ] Self-Tuning Self-Supervised Image Anomaly Detection Jaemin Yoo, Lingxiao Zhao, and Leman Akoglu KDD 2025 [ paper | code ] Aggregation Buffer: Revisiting DropEdge with a New Parameter Block Dooho Lee, Myeong Kong, Sagad Hamid, Cheonwoo Lee, and Jaemin Yoo ICML 2025 [ paper | code ] Criteria-Aware Graph Filtering: Extremely Fast Yet Accurate Multi-Criteria Recommendation Jin-Duk Park, Jaemin Yoo, and Won-Yong Shin WWW 2025 [ paper | code | bib ] End-To-End Self-Tuning Self-Supervised Time Series Anomaly Detection Boje Deforce, Meng-Chieh Lee, Bart Baesens, Estefanía Serral Asensio, Jaemin Yoo and Leman Akoglu SDM 2025 [ paper | code | bib ] 2024 Rethinking Reconstruction-based Graph-level Anomaly Detectors: Limitations and a Remedy Sunwoo Kim, Soo Yong Lee, Fanchen Bu, Shinhwan Kang, Kyungho Kim, Jaemin Yoo, and Kijung Shin NeurIPS 2024 [ paper | code | bib ] Feature Distribution on Graph Topology Mediates the Effect of Graph Convolution: Homophily Perspective Soo Yong Lee, Sunwoo Kim, Fanchen Bu, Jaemin Yoo, Jiliang Tang, and Kijung Shin ICML 2024 [ paper | code | bib ] NetEffect: Discovery and Exploitation of Generalized Network Effects Meng-Chieh Lee, Shubhranshu Shekhar, Jaemin Yoo, and Christos Faloutsos PAKDD 2024 [ paper | code | bib ] HypeBoy: Generative Self-Supervised Representation Learning on Hypergraphs Sunwoo Kim, Shinhwan Kang, Fanchen Bu, Soo Yong Lee, Jaemin Yoo, and Kijung Shin ICLR 2024 [ paper | code | bib ] Representative and Back-in-Time Sampling from Real-world Hypergraphs Minyoung Choe, Jaemin Yoo, Geon Lee, Woonsung Baek, U Kang, and Kijung Shin ACM Transactions on Knowledge Discovery from Data [ paper | code | bib ] 2023 Mining of Real-world Hypergraphs: Concepts, Patterns, and Generators Geon Lee, Jaemin Yoo, and Kijung Shin KDD 2023 and WWW 2023 (Tutorial) [ proposal | video | homepage | bib ] Self-Supervision for Tackling Unsupervised Anomaly Detection: Pitfalls and Opportunities Leman Akoglu and Jaemin Yoo BigData 2023 [ paper | bib ] DSV: An Alignment Validation Loss for Self-supervised Outlier Model Selection Jaemin Yoo, Yue Zhao, Lingxiao Zhao, and Leman Akoglu ECML PKDD 2023 [ paper | code | bib ] Less is More: SlimG for Accurate, Robust, and Interpretable Graph Mining Jaemin Yoo*, Meng-Chieh Lee*, Shubhranshu Shekhar, and Christos Faloutsos KDD 2023 [ paper | code | bib ] How Transitive Are Real-World Group Interactions? - Measurement and Reproduction Sunwoo Kim, Fanchen Bu, Minyoung Choe, Jaemin Yoo, and Kijung Shin KDD 2023 [ paper | appendix | code | bib ] Classification of Edge-dependent Labels of Nodes in Hypergraphs Minyoung Choe, Sunwoo Kim, Jaemin Yoo, and Kijung Shin KDD 2023 [ paper | appendix | code | bib ] Towards Deep Attention in Graph Neural Networks: Problems and Remedies Soo Yong Lee, Fanchen Bu, Jaemin Yoo, and Kijung Shin ICML 2023 [ paper | code | bib ] Data Augmentation is a Hyperparameter: Cherry-picked Self-Supervision for Unsupervised Anomaly Detection is Creating the Illusion of Success Jaemin Yoo, Tiancheng Zhao, and Leman Akoglu Transactions on Machine Learning Research [ paper | code | bib ] Reciprocity in Directed Hypergraphs: Measures, Findings, and Generators Sunwoo Kim, Minyoung Choe, Jaemin Yoo, and Kijung Shin Data Mining and Knowledge Discovery [ paper | code | bib ] 2022 Mining of Real-world Hypergraphs: Concepts, Patterns, and Generators Geon Lee, Jaemin Yoo, and Kijung Shin ICDM 2022 and CIKM 2022 (Tutorial) [ proposal | video | homepage | bib ] Probabilistic Approaches for Node and Graph Classification Jaemin Yoo Ph.D. Thesis, Seoul National University [ web ] Outstanding Dissertation Awards from SNU CSE & KAST (한국과학기술한림원) Accurate Stock Movement Prediction with Self-supervised Learning from Sparse Noisy Tweets Yejun Soun*, Jaemin Yoo*, Minyong Cho, Jihyeong Jeon, and U Kang BigData 2022 [ paper | bib ] Reciprocity in Directed Hypergraphs: Measures, Findings, and Generators Sunwoo Kim, Minyoung Choe, Jaemin Yoo, and Kijung Shin ICDM 2022 [ paper (extended) | code | bib ] Accurate Node Feature Estimation with Structured Variational Graph Autoencoder Jaemin Yoo, Hyunsik Jeon, Jinhong Jung, and U Kang KDD 2022 [ paper | code | bib ] Model-Agnostic Augmentation for Accurate Graph Classification Jaemin Yoo, Sooyeon Shim, and U Kang WWW 2022 [ paper | code | bib ] MiDaS: Representative Sampling from Real-world Hypergraphs Minyoung Choe, Jaemin Yoo, Geon Lee, Woonsung Baek, U Kang, and Kijung Shin WWW 2022 [ paper | code | bib ] Transition Matrix Representation of Trees with Transposed Convolutions Jaemin Yoo and Lee Sael SDM 2022 [ paper | code | bib ] Graph-based PU Learning for Binary and Multiclass Classification without Class Prior Jaemin Yoo*, Junghun Kim*, Hoyoung Yoon*, Geonsoo Kim, Changwon Jang, and U Kang Knowledge and Information Systems [ paper | bib ] Signed Random Walk Diffusion for Effective Representation Learning in Signed Graphs Jinhong Jung, Jaemin Yoo, and U Kang PLOS One [ paper | code | bib ] 2021 Accurate Graph-Based PU Learning without Class Prior Jaemin Yoo*, Junghun Kim*, Hoyoung Yoon*, Geonsoo Kim, Changwon Jang, and U Kang ICDM 2021 [ paper | bib ] One of the best-ranked papers of ICDM 2021 for fast-track journal invitation Accurate Multivariate Stock Movement Prediction via Data-Axis Transformer with Multi-Level Contexts Jaemin Yoo, Yejun Soun, Yong-chan Park, and U Kang KDD 2021 [ paper | datasets | bib ] Gaussian Soft Decision Trees for Interpretable Feature-Based Classification Jaemin Yoo and Lee Sael PAKDD 2021 [ paper | code | bib ] Attention-Based Autoregression for Accurate and Efficient Multivariate Time Series Forecasting Jaemin Yoo and U Kang SDM 2021 [ paper | code | bib ] Before 2021 Sampling Subgraphs with Guaranteed Treewidth for Accurate and Efficient Graphical Inference Jaemin Yoo, U Kang, Mauro Scanagatta, Giorgio Corani, and Marco Zaffalon WSDM 2020 [ paper | code | bib ] Samsung HumanTech Paper Award & Qualcomm Innovation Fellowship Korea Knowledge Extraction with No Observable Data Jaemin Yoo, Minyong Cho, Taebum Kim, and U Kang NeurIPS 2019 [ paper | code | bib ] Qualcomm Innovation Fellowship Korea EDiT: Interpreting Ensemble Models via Compact Soft Decision Trees Jaemin Yoo and Lee Sael ICDM 2019 [ paper | code | bib ] Belief Propagation Network for Hard Inductive Semi-Supervised Learning Jaemin Yoo, Hyunsik Jeon, and U Kang IJCAI 2019 [ paper | code | bib ] Fast and Scalable Distributed Loopy Belief Propagation on Real-World Graphs Saehan Jo, Jaemin Yoo, and U Kang WSDM 2018 [ paper | code | bib ] Supervised Belief Propagation: Scalable Supervised Inference on Attributed Networks Jaemin Yoo, Saehan Jo, and U Kang ICDM 2017 [ paper | code | bib ] Efficient Learning of Bounded-Treewidth Bayesian Networks from Complete and Incomplete Data Sets Mauro Scanagatta, Giorgio Corani, Marco Zaffalon, Jaemin Yoo, and U Kang International Journal of Approximate Reasoning [ paper | bib ] Miscellaneous Teaching @ KAIST Foundation of Big Data Analytics (Fall 2023 - 2025) Programming Structure for Electrical Engineering (Spring 2025) Introduction to Modern Software Development (Spring 2025) Discrete Methods for Electrical Engineering (Spring 2024) Professional Services Organizing Committee of PAKDD GLFM Workshop (2025) ",
  "content_length": 12083,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:24"
}