{
  "name": "Jaesik Choi",
  "homepage": "http://sailab.kaist.ac.kr/jaesik",
  "status": "success",
  "content": "Jaesik Choi – Statistical Artificial Intelligence Lab@KAIST Statistical Artificial Intelligence Lab@KAIST Artificial Intelligence and Machine Learning Research ⛵️ Home Greetings Open positions Members Jaesik Choi Active Members Alumni Publications Publications Publications in Korean Projects Research Gallery Home Greetings Open positions Members Jaesik Choi Active Members Alumni Publications Publications Publications in Korean Projects Research Gallery Jaesik Choi Contact KAIST Endowed Chair Professor (KAIST 지정석좌교수) Associate Member of the National Academy of Engineering of Korea (공학한림원 일반회원) Director of Explainable Artificial Intelligence Center Professor of Graduate School of AI at KAIST CEO of INEEJI Seongnam: 8 Seongnam-daero 331, Bundang, Seongnam, Gyeonggi, 13558, Republic of Korea (main office) Daejeon: 291 Daehak-ro, N24 , Yuseong-gu, Daejeon 34141, Republic of Korea Secretary: (031) 8022-7530 email: jaesik.choi at kaist.ac.kr CV (Korean, English) 및 강연관련정보 (약력, 초록 및 발표자료 등) Brief Bio (in third person) Jaesik Choi is a KAIST Endowed Chair Professor from March 2025 and a full professor of Graduate School of Artificial Intelligence at KAIST since September 2024. He is also a director of Explainable Artificial Intelligent Center established by the Ministry of Science and ICT, Republic of Korea. He had been an associate professor of the Graduate School of Artificial Intelligence at KAIST since September 2019. He had been the Rising-Star Distinguished associate professor in the School of Electrical and Computer Engineering at UNIST (Ulsan, Korea) and an affiliate researcher of the Lawrence Berkeley National Laboratory (the Berkeley Lab) until August 2019. He had been an assistant professor at UNIST from July 2013 to August 2017. He was a Computer Scientist Postdoctoral Fellow of Computational Research Division at the Berkeley Lab. His research focuses on learning and inference with large scale, complex systems, explainable machine learning models and spatio-temporal data analysis. He received his Ph.D. in Computer Science from the University of Illinois at Urbana-Champaign (2012) and received B.S. degree in Computer Engineering from Seoul National University (2004). News! The ministry of science and technology of Korea confirmed INEEJI to hold a national strategic technology, the predictive explainable artificial intelligence technology. (March 2025). I am appointed as the KAIST Endowed Chair Professor (March 2025). Dr. Haedong Jeong (my second PhD student) is appointed at Sogang University as an assistant professor (March 2025). I become an associate member of Korean National Academy of Engineering (January 2025). I am promoted to the full professor of Kim Jaechul Graduate School of Artificial Intelligence at KAIST (September 2024). A paper, Explainable Artificial Intelligence (XAI) 2.0: A manifesto of open challenges and interdisciplinary research directions, co-authored with Luca Longo and many others is published at Information Fusion (June 2024). Dr. Anh Tong (my first PhD student) is appointed at Korea University as an assistant professor (March 2024). INEEJI received a Series A funding, 11.1 Billion KRW (May 2022). I co-organized and present at the IPAM Explainable AI for the Sciences: Towards Novel Insights Workshop (January 2023). We received the appreciation plaque from Samsung Electronics with the explainable speech recognition explainable artificial intelligence (June 2022). INEEJI received a pre-Series A funding, 5.5 Billion KRW (May 2022). I will lead a New XAI project with a budget of 13 Billion KRW, Development of Plug and Play Explainable Artificial Intelligence Platform, which is granted by the ministry of science and ICT for the 57 months (April 2022). My tenure application is approved by the KAIST Faculty Personnel Committee and the KAIST Board of Trustees (September 2021). Thankfully, so many people (graduate students, staff, department head and external recommendations) supported the procedure (September 2021). A book, An Introduction to Lifted Probabilistic Inference, which I contributed two chapters are published by MIT press. (August 2021). The Industrial Bank of Korea and KAIST XAI Research Center agrees a MOU for AI research collaboration (August 2021). I received the POSCO O&C (Open and Collaboration) Award from POSCO (August 2021). The first PhD student, Anh Tong, successfully defended his PhD thesis (December 2020). Our team won (1st place) the AI Electricity Generation Competition of Korea East West Power (December 2020). I presented a tutorial on Interpreting and Explaining Deep Neural Networks: A Perspective on Time Series Data at KDD-2020 (August 2020). A paper, XAI – Explainable artificial intelligence, co-authored with David Gunning and other colleagues is published at Science Robotics (December 2019). I am organizing/chairing 2019 ICCV Workshop on Interpreting and Explaining Visual Artificial Intelligence Models (November 2019). I moved to KAIST and join Graduate School of Artificial Intelligence (September 2019). The joint project with POSCO is selected as a ‘Lighthouse Factory’ by World Economic Forum (July 2019). The smart blast furnace technology (deep learning based prediction and control of hot melting iro) is selected as a national core technologies of Korea (June 2019). I have received a prime minister’s commendation (April 2019). I found a company, INEEJI (January 2019). I served a co-program chair for 2018 International Explainable Artificial Intelligence Symposium (November 2018). I have been named as one of the Rising Star Distinguished professors of UNIST (September 2018). I have received a prestigious award, POSCO Innovation Award 2018, from POSCO (August 2018). Our SW (joint work with Kyowoon Lee and Sol-A Kim) won two international digital Curling competitions held at Japan (2017 November and 2018 March). The research paper, joint work with Prof. Seong-Whan Lee at Korea University, is presented at ICML 2018. I have been named as the POSCO steel fellow professor (August, 2017). I become a director of the explainable artificial intelligence (XAI) center to lead the 5 years of project that is supported by the ministry of science and ICT (July 2017). My research group, Statistical Artificial Intelligence Lab (SAIL@KAIST) at KAIST, currently has openings! If you are interested in the positions, please apply. A fast and effective way which could achieve up to 100X of compression ratio of many real-world big data. “Novel Data Reduction Based on Statistical Similarity” with Dongeun Lee, Alex Sim and John Wu is accepted at SSDBM-16 (May 2016). A new perspective to analyze the success (failure) probability in dynamical compressive sensing framework. “Improving Imprecise Compressive Sensing” with Dongeun Lee and Rafael de Lima is accepted at UAI-16 (May 2016). An improved way to generate human readable reports from time series data, “The Relational Automatic Statistician System” with Yunseong Hwang (now at NAVER Search solution) and Anh Tong is accepted at ICML-16 (April 2016). I serve on Programming Committee of AAAI 2016, KR 2016, UAI 2016, ACML 2016 and StarAI 2016, and Reviewer for NIPS 2016. Best Paper award at DataCom 2015. A predictive model for US household electricity data with Taehoon Kim, Dongeun Lee and colleagues in the Berkeley Lab receives the best paper award at DataCom 2015 (December 2015). A new pragmatic archiving scheme for spatio-temporal sensor data! “A Scalable and Flexible Repository for Big Sensor Data” with Dongeun Lee and Prof. Heonshik Shin (Seoul National University) is accepted at IEEE Sensors Journal (August 2015). A report on machine learning for Legislative Knowledge Service is published in the National Assembly Library of Korea. A large scale data reduction framework, “Data Reduction Method with Locally Exchangeable Measures” with Alex Sim (Berkeley National Lab) is now patent pending (May 2015). A new National IT Industry Promotion Agency (NIPA) grant is acknowledged (January 2015 ~ December 2016, Role: Co-PI, 200M KRW about 183K USD for my portion). This is a collaborative effort with the City of Ulsan (PI: Ulsan Economic Promotion Agency) and Daedo Techra, a local manufacturing company. A New Efficient Method for Estimating the Partition Function of Exponential Random Graph Models! Paper, “A Deterministic Partition Function Approximation for Exponential Random Graph Models”, with Wen Pu (Linked In), Yunseong Hwang and Eyal Amir (University of Illinois) is accepted at the International Joint Conference on Artificial Intelligence 2015 (IJCAI-15) (April 2015). New Machine Learning Algorithm that Monitors Memory Behaviors for Secure Embedded Systems! Paper, “Memory Heat Map: Anomaly Detection in Real-Time Embedded Systems Using Memory Behavior”, with Man-Ki Yoon, Sibin Mohan, and Lui Sha is accepted at the Design Automation Conference (DAC 2015). This research is a collaborative effort with Cyber Physical System Integration Lab at University of Illinois at Urbana-Champaign  (February 2015). I serve on Programming Committee of AAAI 2015, IJCAI 2015, UAI 2015, ACML 2015 and StarAI (Statistical Relational AI) 2015 and Reviewer for NIPS 2015. New dynamic Compressive Sensing models! Paper, “Learning Compressive Sensing Models for Big Spatio-Temporal Data” with Dongeun Lee is accepted at the 2015 SIAM International Conference on Data Mining (SDM 2015) (December 2014). A new Korean National Research Foundation (NRF) grant is acknowledged (PI: Jaesik Choi, December 2014 ~ November 2017, 600M KRW about 557K USD). This is a collaborative effort with Dr. R. Vilim and Dr. Y-S Park at the Nuclear Division of the Argonne National Laboratory. The new research project, “Development of Fault-Diagnosis Algorithms for Current and Next-Generation Nuclear Systems”  is officially initiated. Many thanks, Korean NRF and US Department of Energy (DOE), and the selection committee! The first paper (in the literature) on learning parameters in relational contin",
  "content_length": 13937,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:25"
}