{
  "name": "Jaesik Park",
  "homepage": "http://jaesik.info",
  "status": "success",
  "content": "Jaesik Park Jaesik Park Hello! I am Prof. Jaesik Park at Seoul National University. Our research group, Visual & Geometric Intelligence Lab., is looking for self-motivated students. If interested, please apply to our lab. Bio and CV ▽ Jaesik Park is an Associate Professor of Computer Science Engineering and an Interdisciplinary Program in AI at Seoul National University. He received his Bachelor’s degree from Hanyang University, and he received his Master’s and Ph.D. degrees from KAIST (supervised by Prof. Yu-Wing Tai and Prof. In So Kweon). He was a staff research scientist at Intel intelligent systems lab (led by Dr. Vladlen Koltun), where he co-created Open3D library. Before joining Seoul National University, he was a faculty member at POSTECH. His research interests include text-to-image synthesis, 3D perception, and computer vision topics. He serves as a program committee at prestigious international conferences, such as CVPR, ECCV, ICCV, ICLR, ICML, ICRA, NeurIPS and SIGGRAPH Asia. cv_jaesik_park.pdf News 🙋‍♂️🙋‍♂️🙋‍♂️ We are seeking Postdoctoral Researchers specializing in computer vision and robotics. More details 2025.10. I am honored to serve as an Associate Editor for IEEE Trans. on Pattern Analysis and Machine Intelligence (TPAMI). 2025.10. I will serve as a Lead Area Chair for CVPR 2026. 2025.09. Our OpenBox, an automatic open-set 3D anotation method, is selected as a spotlight paper at NeurIPS 2025. 2025.09. Four papers about 3D anotation, GS sampling, order prediction, and diffusion planner are accepted to NeurIPS 2025. 2025.07. Our BUFFER-X, a tough 3D registration method, is selected as a highlight paper at ICCV 2025. 2025.06. Three papers about feature field recon, 3D registration, and prompt-based image editing are accepted to ICCV 2025. Previous ▽ 2025.05. GigaGAN is referred to as one of the most cited papers in 2023 by Stanford's AI Index Report (Korean Youtube) 2025.04. Open3D is featured in 3D Data Science with Python book published by O'Reilly Media (Buy at Amazon). 2025.02. Three papers about dynamic scene reconstruction and image generation are accepted to CVPR 2025. 2025.02. A paper about point cloud registration is accepted to ICRA 2025. 2025.01. Two papers (3D Gaussian compression & ConvNet design in 2025) are accepted to ICLR 2025. 2024.12. I will serve as a Area Chair for ICCV 2025 and ICML 2025. 2024.11. I will serve as an Action Editor for Transactions on Machine Learning Research (TMLR). 2024.11. I will serve as a Lead Area Chair for CVPR 2025. 2024.09. I will serve as an Area Chair for ICLR 2025. 2024.09. A paper about brick assembly is accepted to Transactions on Machine Learning Research (TMLR). 2024.09. A paper about fast drag-based image editing is accepted to SIGGRAPH Asia 2024. 2024.06. Two papers got accepted to ECCV 2024. 2024.05. I will serve as a Area Chair for NeurIPS 2024. 2024.05. A paper about 3D parts assembly is accepted to ICML 2024. 2024.05. A paper about 3D strokes reconstruction from multi-view images is accepted to SIGGRAPH 2024. 2024.03. A paper about referring image segmentation is accepted to NAACL 2024. 2024.02. Two papers got accepted to CVPR 2024. 2024.01. Launching Open3D v0.18 (receiving 10.0k+1.6k GitHub stars). 2024.01. Our binary radiance field paper received the 30th Samsung HumanTech Paper Award (Silver Prize). 2024.01. Our stereo SLAM paper has been invited to ICRA 2024 as an oral presentation. 2023.11. I will serve as a Lead Area Chair for ECCV 2024. 2023.09. A paper about compact neural radiance fields is accepted to NeurIPS 2023. 2023.09. Our GigaGAN paper has been featured in Two Minutes Papers YouTube channel. 2023.09. After spending four and half great years at POSTECH, I joined CSE & GSAI at Seoul National University. 2023.09. I will serve as an Associate Editor for ICRA 2024. 2023.08. Our StudioGAN paper is accepted to TPAMI (with 3.2k GitHub stars). 2023.07. A paper about neural dynamic scene reconstruction is accepted to ICCV 2023. 2023.05. I will serve as an Area Chair for CVPR 2024. 2023.05. I will serve as a Technical Papers Committee for SIGGRAPH ASIA 2023. 2023.04. A paper about recovering 3D characteristic orientation is accepted to ICML 2023. 2023.03. Launching Open3D v0.17 - Open3D meets Mitsuba. Receives 8.3+1.2k GitHub stars. 2023.02. Papers about GAN based text-to-image synthesis and robust LiDAR perception are accepted to CVPR 2023. 2023.02. I will serve as an Area Chair for NeurIPS 2023. 2023.01. One ICRA 2023 paper and one Scientific Reports paper got accepted. 2022.11. I will serve as an Area Chair for ICCV 2023. 2022.10. Open3D 0.16 Release! We had a successful Google Summer of Code 2022. 2022.09. A paper about dynamic human reconstruction using a RGBD camera got accepted to SIGGRAPH Asia 2022. 2022.09. Three NeurIPS 2022 papers and two NeurIPS workshop papers got accepted. 2022.09. I will serve as an Area Chair for CVPR 2023. 2022.09. I've been promoted to Associate Professor. 2022.08. We release PeRFception: Perception using Radiance Fields dataset. 2022.07. Open3D is designated as a critical project (the top 1% of most downloaded among 388K projects) by The Python Package Index (PyPI). 2022.07. Three papers got accepted to ECCV 2022. 2022.06. StudioGAN paper - we release an extensive benchmark of state-of-the-art GANs. 2022.06. Gave a remote talk at Havard University's Interdisciplinary Science Seminar. 2022.03. Three papers got accepted to CVPR 2022. 2022.02. I will serve as an Area Chair for ECCV 2022. 2022.01. Our paper about comprehensive point cloud refinement and reconstruction is accepted to ICLR 2022. 2021.12. HUMBI: A Large Multiview Dataset of Human Body Expressions and Benchmark Challenge is accepted to TPAMI. 2021.12. Open3D 0.14 Release! Tensorboard integration + hardware optimization + new geometry functions + recent 3D perception pipelines. 2021.11. We are releasing the source code of ReACGAN as a submodule of StudioGAN. 2021.10. A paper about real-time video stablization is accepted to BMVC 2021. 2021.10. A paper about real-time colored scene reconstruction got accepted to Transactions on Graphics. 2021.09. Two papers got accepted to NeurIPS 2021. 2021.07. Three papers got accepted to ICCV 2021. 2021.07. ContraGAN project (NeurIPS 2020) is awarded as one of the POSTECH's representative research achievements. 2021.06. Check out Open3D 0.13 Release that comes with full of cool features. 2021.03. Open3D received 4.1k Github stars and Pytorch-StudioGAN received 1.5k Github stars. 2020.11. I will serve as an Area Chair for ICCV 2021. 2020.10. Open3D 0.11.0 is released with a fancy machine learning module. 2020.09. A paper about conditional image generation is accepted to NeurIPS 2020. 2020.08. I will serve as an Senior Program Committee for AAAI 2021. 2020.07. I will serve as an Area Chair for CVPR 2021. 2020.07. We open humbi-data.net that is a large corpus of high fidelity 3D human models. 2020.06. We are releasing Pytorch-StudioGAN that provides the implementation of representative GANs for image synthesis. 2020.03. Three papers got accepted to CVPR 2020. 2020.02. I will visit San Diego to attend CVPR 2020 AC meeting. 2019.09. We are releasing source code of FCGF via Github. 2019.08. I will serve as an Session Chair for ICCV 2019. 2019.07. I will serve as an Area Chair for CVPR 2020. 2019.07. One paper regarding geometric feature learning is accepted to ICCV 2019. 2019.07. One paper on high-quality texture mapping for dynamic objects is conditionally accepted to Pacific Graphics 2019. 2019.06. One paper about fast indoor scene reconstruction is accepted to IROS 2019. 2019.05. Open3D is being supported by Google Season of Docs. 2019.04. I joined POSTECH as an Assistant Professor. 2018.12. I will serve as an Area Chair for ICCV 2019. 2018.12. Our team (Marcel Nassar, Zhuwen Li, and myself) received Research Velocity Challenge Award from Intel. 2018.11. Open3D received 1k Github stars. 2018.06. I am attending CVPR 2018 to present the accepted paper. 2018.03. Our paper about new convolution framework for large-scale point cloud segmentation is accepted to CVPR 2018. 2018.01. We are releasing Open3D: a modern library for 3D data processing. Please visit www.open3d.org. 2018.01. A multi-task network for joint head detection and pose estimation is accepted to RAS. 2017.12. A learning-based method for depth from light field is accepted to TPAMI. Paper comming soon. 2017.08. Launching jaesik.info for better visualization on workstation or mobile platforms. 2017.05. We are releasing www.tanksandtemples.org: website for benchmarking photogrammetry methods. 2017.05. Our paper about image based 3D reconstruction benchmark is accepted to SIGGRAPH 2017. 2017.02. An algorithm about learning based automatic 3D view selection is accepted to Computer Graphics Forum. 2016.08. A paper about high-quality 3D reconstruction is accepted to TPAMI. 2016.07. A paper about global point-cloud registration is accepted to ECCV 2016 as an oral presentation.",
  "content_length": 9007,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:25"
}