{
  "name": "Jaewoo Kang",
  "homepage": "https://dmis.korea.ac.kr/jaewoo-kang-p-i",
  "status": "success",
  "content": "DMIS Lab, Korea University - Jaewoo Kang (P.I.)Search this siteEmbedded FilesSkip to main contentSkip to navigationProf. Jaewoo Kang, Ph.D (강재우 교수)Department of Computer Science and EngineeringKorea UniversityEmail: kangj@korea.ac.kr, Phone: +82-2-3290-4840EducationPh.D., CS, University of Wisconsin-Madison, USA, 2003 M.S., CS, University of Colorado at Boulder, USA, 1996B.S., CS, Korea University, Seoul, South Korea, 1994Work ExperienceAssistant Professor, North Carolina State University, Raleigh, NC, USA (2003-2006)CTO and Founder, WISEngine Inc., Santa Clara, CA, USA/Seoul, Korea (2000-2001)Technical Staff, Savera Systems Inc., Murray Hill, NJ, USA (1997-1998)Technical Staff, AT&T Labs Research, Florham Park, NJ, USA (1996-1997) Other AffiliationsChief Executive Officer, AIGEN Sciences Inc.Dept. Head, Interdisciplinary Graduate Program in BioinformaticsProfessor, Jointly appointed with Dept. of Medicine in KU School of Medicine.P.I., BK21PLUS Big Data Scientist Human Resource Development Project Awards [Best Performer] BioASQ Task 8B-Phase B  (A Bio-medical QA Challenge) 2020  (의생명 AI 질의응답 국제대회)Participated in exact answer and ideal answer QA challenges and won the 1st place in both challengesOur model outperformed UCSD and UMASS-Chan Zuckerberg Initiative[Best Performer] BioASQ Task 7B-Phase B  (A Bio-medical QA Challenge) 2019  (의생명 AI 질의응답 국제대회)Participated in exact answer QA challenge and won the 1st placeOur BioBERT-based QA model achieved 1st place in all 5 batches outperforming Google (2nd place  in 2 out of 5 batches)[Best Performer] IDG-DREAM Drug-Kinase Binding Prediction Challenge 2019  (약물활성예측 드림챌린지 우승)Community challenge to develop machine learning models for predicting drug-kinase binding affinitiesParticipants from UNC Chapel Hill, UIUC-Tsinghua (tied 1st), METU (4th), Texas A&M (6th), FIMM and Aalto Univ (7th), National Technical Univ of Athens (13th), etc.[Best Performer] Multi-targeting Drug DREAM Challenge 2018 (다중표적약물 드림챌린지 우승)Community challenge to develop machine learning models for predicting the structures of drug candidates that can bind to and inhibit activity of multiple independent targets190 participants from ShanghaiTech Univ (tied 1st), Univ of Lisbon (3rd), Janssen Pharmaceutica, Leiden Univ, Uppsala Univ, University of Pittsburgh, Immuneering Corp (tied 4th), Univ of Minho (9th), etc. [Best Performer] NCI-CPTAC DREAM Proteogenomics Challenge 2017 (미국 국립암연구소 유전단백체 드림챌린지 우승)Community challenge to understand the association between genome, trascriptome and proteome in tumorsDevelop models to predict protein abundances based on genome and transcriptome dataParticipants from UCLA (2nd), RWTH Aachen Univ (3rd), Icahn School of Medicine at Mount Sinai (5th), UNC Chapel Hill and MD Anderson (16th), etc. [2nd place] Disease Module Identification DREAM Challenge 2016 (질병모듈 드림챌린지 2위)Participants are challenged to apply network module identification methods to predict functional modules based on biological network topologyParticipants from Tufts Univ (1st), Univ of Michigan (tied 2nd), Stanford Univ (11th), Univ of Pennsylvania and Yale University (tied 18th), etc. [2nd place] AstraZeneca-Sanger Drug Combination Prediction DREAM Challenge 2016 (아스트라제네카-생어 약물시너지 드림챌린지 2위)Community challenge to explore fundamental traits that underlie effective combinational treatments and synergistic drug behaviorDevelop models to predict synergistic drug combinations for personalized cancer therapyParticipants from Univ of Michigan (1st), SAS Institute (tied 2nd), Stanford Univ (6th), MIT (11th), KAIST (20th), UCSD (45th), NIH (58th), etc.BiographyDr. Kang received Ph.D. from the University of Wisconsin-Madison in 2003. He is currently a professor of computer science department at Korea University, Seoul, Korea. He also served as a faculty member in computer science department at North Carolina State University, Raleigh, NC, USA, for three years from 2003 to 2006.Dr. Kang has extensive experience in both industry and academia. During his graduate career at UW-Madison, in 2000, Dr. Kang founded a start-up company, WISEngine Inc., headquartered in Seoul, Korea and branched in Santa Clara, CA, USA. WISEngine specialized in developing innovative technologies for Internet data management. During his two years of tenure at WISEngine as a CTO and Founder, he built and led the R&D group of 26 engineers and scientists, hired 40+ employees, assembled an international advisory board, presented to 20+ top class venture capitalists, and raised the first round funding of 1.7 million USD. Prior to joining UW-Madison graduate program, he was a member of technical staff at AT&T Labs Research (formerly Bell Labs), Florham Park, NJ, USA, for two years from 1996 to 1997.Dr. Kang is a member of ACM and IEEE, and regularly serves as program committee for international conferences including ACM SIGMOD, VLDB, AAAI, WWW, IEEE ICDM, ICDE etc., and reviewing articles for top journals including Nucleic Acids Research, Bioinformatics, Scientific Reports, Database, BMC Bioinformatics, PLoS ONE, etc.  He was also one of the ten US recipients of Microsoft Graduate Fellowship in 2000.Research InterestsDr. Kang's research interests in a broad sense focus on understanding the fundamental aspects of building a large-scale information system that can answer complex queries over a large number (billions) of heterogeneous data sources. He focuses on tackling the challenge particularly in data integration, Web data mining, Internet-scale distributed systems, large-scale data analytics and bio-medical informatics.Dr. Kang is currently supervising DMIS (Data Mining and Information Systems Lab) at Korea University.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 5734,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:24"
}