{
  "name": "Jaewook Lee 0001",
  "homepage": "https://slcf.snu.ac.kr/members/professor",
  "status": "success",
  "content": "SLCF Lab - ProfessorSearch this siteEmbedded FilesSkip to main contentSkip to navigationProfessorJaewook Lee, Ph.D.Director of Statistical Learning & Computational Finance (SLCF) LaboratoryDepartment of Industrial Engineering Seoul National University1 Gwanak-ro, Gwanak-gu, Seoul, Korea (R.O.K.)Office: 402 Bldg 39 Phone: 02-880-7176 (Office)Email: jaewook-at-snu.ac.krWine & Spirit Education Trust (WSET) Advanced CertificateEducationPh.D., Cornell University, August 1999B.S., Seoul National University , August 1993Research InterestMy research focuses on the design and analysis of efficient algorithms for learning, optimization, and inference problems, with a recent emphasis on their applications to Safe AI and Fintech.My works were built around the three basic pillars of theory: global optimization, dynamical systems, and statistical learning. During the period of years from 1997 to 2005, I started to work on stability analysis for nonlinear systems and convergence analysis of optimization algorithms. My research progress has best been made by means of strong links between optimality and equilibrium, for example, by applying dynamical system approach to solve optimization or learning problems or by utilizing optimization or topology theory to analyze nonlinear dynamical systems.For about a decade after 2005, I have broadened this set of theoretical and computational tools to design stable machine learning algorithms (mostly kernel-based algorithms such as support vector machines and Gaussian processes) and to develop novel model calibration, pricing, and prediction techniques for financial derivatives.Recently I’m applying these advancements to the design of truly safe AI systems that are ethically fair, privacy & security assured, algorithmically stable, and interpretable to humans. Concurrently, I am developing innovative financial instruments and processes using blockchain technology to compete with traditional financial methods in the delivery of financial services. My research works can be classified into four areas; statistical learning, computational finance, global optimization & stability analysis, and data mining and business analytics, which is briefly described below.Research AreaPrivacy & SafetyAdverarial Machine LearningPrivacy-preserving AI techniquesFair Machine LearningAI ForecastingAI Forecasting in FInancePredictive Models for Imbalanced DataCollaborative filteringComputational FinanceBlockchain and DeFi MarketsRisk and portfolio management: the P worldDerivatives Pricing: the Q worldStable Machine LearningSupport vector machines and kernel machines, Neural networks and deep learning, Gaussian processes, Clustering, Ranking, Sparse learning, Representation learning, Multivariate data analysis, Collaborative filtering..Derivatives pricing and hedging, Credit risk management, Volatility estimation, Model calibration under Levy processes, Numerical pricing for multi-asset and path-dependent payoffs in more complex option models, MCMC & Bayesian filtering.Stability Analysis and Global OptimizationMulti-basin search methods, Homotopy methods, Trajectory-based method for global optimization, Differential and algebraic topology for multi-dimensional potential surfaces, Non-hyperbolic dynamical systems and homology, Stability analysis of nonlinear control and power systemsProfessional ActivitiesFellow, Board member: the Asia Pacific Industrial Engineering and Management Society (APIEMS), Dec. 2012 - present.Associate Editor: Applied Stochastic Models in Business and Industry, Mar. 2010 - present. (SCI)Managing Editor, Manuscript Editor: Journal of Industrial Engineering and Management Systems, Feb. 2009 - present.Leader for privacy-preserving convergence technology working group, Feb. 2021 - June. 2021Guest Editor: Journal of Intelligent Manufacturing, Jan. 2015 – present. (SCI)Contacting Associate Editor: Decision Sciences, July. 2013 – present. (SSCI)Editor-in-Chief: Management Science and Financial Engineering, Jan. 2012 – Feb. 2014.Associate Editor: International Journal of Management Science, Feb. 2005 – Dec. 2011.Organizing Chair for Asia Pacific Industrial Engineering and Management Systems Conference (APIEMS 2014)General Organizing Chair for the international workshop on learning, computations, and finance (LCF 2010)Programmer Committee for the 7th & 8th international conference on data mining.Paper Reviewer for Journal of Machine Learning Research, IEEE Transactions on Pattern Analysis and Machine Intelligence, IEEE Transactions on Neural Networks, IEEE Transactions on Automatic Control,  IEEE Transactions on Circuits and Systems, Pattern Recognition, Pattern Recognition Letter, IEEE Transactions on Knowledge Discovery and Data Engineering, IEEE Transactions on System, Man, and Cybernetics, Electronics Letters, Journal of banking and Finance, International Review of Economics and Finance, Journal of Industrial Engineering and Management Systems, International Journal of Management Science, Annals of Operations Research, Expert Systems with Applications, Applied Soft Computing, Asia-Pacific Journal of Financial Studies, Journal of the Korean Operations Research and Management Science Society, Journal of the Korean Institute of Industrial Engineers, Journal of Korean Mathematics Society, etc.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 5381,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:26"
}