{
  "name": "Jaideep Vaidya",
  "homepage": "https://www.business.rutgers.edu/faculty/jaideep-vaidya",
  "status": "success",
  "content": "Jaideep Vaidya | Rutgers Business School Skip to main content Back to Top Jaideep Vaidya Distinguished Professor and Vice Dean for Faculty Affairs and Research Area of expertise Management Science & Information Systems 973-353-1441 jsvaidya@business.rutgers.edu Curriculum Vitae Jaideep Vaidya is a Distinguished Professor of Computer Information Systems and Vice Dean for Faculty Affairs and Research at Rutgers University, the Director of the Rutgers Institute for Data Science, Learning, and Applications. He received the B.E. degree in Computer Engineering from the University of Mumbai, the M.S. and Ph.D. degree in Computer Science from Purdue University. His general area of research is at the intersection of security, privacy, data mining, data management, and artificial intelligence. He has published over 200 technical papers in peer-reviewed journals and conference proceedings, and has received best paper awards from the premier conferences in data mining, databases, digital government, security, and informatics. He is a Fellow of the AAAS, ACMI, AIMBE, IAHSI, IEEE, and IFIP as well as an ACM Distinguished Scientist. He served as the Editor-in-Chief of the IEEE Transactions on Dependable and Secure Computing, proposed the IEEE Transactions on Privacy, and was the 2024 Vice President of Publication for IEEE Computer Society. Currently, he is the Editor-in-Chief of the ACM Transactions on Internet Technology. He has received several awards including the 2025 IFIP TC11 Kristian Beckman Award, the European Symposium on Research in Computer Security (ESORICS) Outstanding Research Award, and the IEEE Technical Community on Services Computing Research Innovation Award. Notably, the team he led won the first prize in the US-UK Privacy Enhancing Technologies Challenge in the Financial Crime Track in 2023. Academic degrees Ph.D., Purdue University; Computer ScienceM.S., Purdue University; Computer ScienceB.S., Mumbai University; Computer Engineering Insights Thought Leadership: Digital Privacy and Emerging Technologies Related News American Institute for Medical and Biological Engineering names professor to its prestigious College of Fellows Rutgers Business School partners with Google to enhance teaching and classroom learning with Generative AI Professor Vaidya recognized as international expert in health sciences informatics Fintech Conference Focuses on the Next Generation of Industry Leaders Professor Vaidya elected to serve as fellow with multinational organization for information technologies field More Media Mentions NJBIZ, Will computing advances mean the end of digital privacy?, Jaideep Vaidya Monday, February 13, 2023 USA Today, As more schools shift to online learning, what should they do about cyberattacks? Jaideep Vaidya Tuesday, September 15, 2020 IEEE Computer Society, Privately Identify and Help Track the Spread of COVID-19 with COVID Nearby, Jaideep Vaidya Tuesday, August 04, 2020 NJBIZ. Hackers at the gate: How small businesses can safeguard against cyber-intruders, Jaideep Vaidya Wednesday, May 08, 2019 Nature, Making digital government a better government, Jaideep Vaidya Wednesday, November 28, 2018 Dissertations Supervised Name: Hobbs, NathanielGraduation Date: 2024/October Name: Wang, XinyueGraduation Date: 2024/May Name: Elahraf, AbeerGraduation Date: 2021/October Name: Batra, GunjanGraduation Date: 2021/October Name: Asif, HafizGraduation Date: 2021/January Name: Badar, NaziaGraduation Date: 2016/OctoberThesis Title: Configuration Management in Access Control Systems(Co-Advisor with Vijay Atluri) Name: Lorenzi, DavidGraduation Date: 2016/OctoberThesis Title: Enhancing Security and Usability from a Human Perspective on the World Wide Web Name: Uzun, EmreGraduation Date: 2015/OctoberThesis Title: Formal Security Analysis of Access Control Models and Their Spatiotemporal Extensions(Co-directed with Vijay Atluri) Name: Hong, YuanGraduation Date: 2013/OctoberThesis Title: Privacy-preserving Collaborative OptimizationPlacement: Assistant Professor at University at Albany - SUNY. Name: He, XiaoyunGraduation Date: 2011/OctoberThesis Title: Privacy Preserving Analysis of Graph Structured Data.(Co-directed with Nabil Adam) Name: Lu, HaibingGraduation Date: 2011/OctoberThesis Title: Boolean Matrix Decomposition with Extensions: Application to Role Mining.(Co-directed with Vijay Atluri) Name: Guo, QiGraduation Date: 2010/OctoberThesis Title: The Role Mining Problems: A Formal Approach.(Co-directed with Vijay Atluri) Name: Shin, HeechangGraduation Date: 2010/OctoberThesis Title: Ensuring Security and Privacy in a Personalized Mobile Environment.(Co-directed with Vijay Atluri)",
  "content_length": 4665,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:31"
}