{
  "name": "Jaime Ruiz",
  "homepage": "https://www.jaimeruiz.com",
  "status": "success",
  "content": "Jaime Ruiz, Ph.D. – Ruiz HCI Lab Back to People List Jaime Ruiz, Ph.D.Associate Professorjaime.ruiz@ufl.eduhttps://www.jaimeruiz.comGoogle ScholarResearch Interests: Multimodal Interaction, Augmented Reality, HCII am an Associate Professor in the Department of Computer and Information Science and Engineering at the University of Florida in Gainesville, Florida and direct the Ruiz Human-Computer Interaction Lab. I was previously an Assistant Professor at Colorado State University. I received my doctorate degree in Computer Science from the University of Waterloo in 2012 where I worked under the supervision of Dr. Edward Lank. I also hold a MS in Computer Science from San Francisco State University and a BS in Psychology from UC Davis. The main goal of my research in human-computer interaction is to develop an understanding of users and technology to support user interaction. PublicationsCReLeRI: Explainable, Concept-centric, Representation, Learning, Reasoning, and Interaction Video Analysis SystemMichael Francis Perez, Yichi Yang, Yuheng Zha, Enze Ma, Danish Tamboli, Haodi Ma, Reza Shahriari, Vyom Pathak, Dzmitry Kasinets, Rohith Venkatakrishnan, Daisy (Zhe) Wang, Jaime Ruiz, Eric D. Ragan, Zhiting Hu, Eric Xing, and Jun-Yan Zhu. 2025. In Proceedings of the 33rd ACM International Conference on Multimedia (MM ’25). Association for Computing Machinery, New York, NY, USA, 13528–13530. https://doi.org/10.1145/3746027.3754479 When Is Self-Gaze Helpful? Examining Uni- vs Bi-directional Gaze Visualization in Collocated AR TasksDelgado, D. A., Calvo, L. C., Bowers C. J., Ruiz, J.  IEEE ISMAR. 2025. SDSL-Mobile: Enabling space-efficient data structures for mobile applicationsAlexander Barquero, Anisha Wadhwani, Tyler Pencinger, Aaron Hong, Jaime Ruiz, Mattia Prosperi, and Christina Boucher. 2025.  SoftwareX 31: 102234. https://doi.org/10.1016/j.softx.2025.102234 MuCHEx: A Multimodal Conversational Debugging Tool for Interactive Visual Exploration of Hierarchical Object ClassificationReza Shahriari, Yichi Yang, Danish Nisar Ahmed Tamboli, Michael Perez, Yuheng Zha, Jinyu Hou, Mingkai Deng, Eric D. Ragan, Jaime Ruiz, Daisy Zhe Wang, Zhiting Hu, and Eric Xing. 2025. IEEE Computer Graphics and Applications, 1–13. https://doi.org/10.1109/MCG.2025.3598204 ‘Over Time Everyone’s Gonna Be Open To It’: User Attitudes Towards Security and Privacy in Continuous Authentication for Smart HomesHeting Wang, Yu-Peng Chen, Dinank Bista, Rodrigo Calvo, Niriksha Regmi, Xuanpu Zhang, Tempestt Neal, Jaime Ruiz, and Lisa Anthony. 2025.  in IEEE Access, vol. 13, pp. 140629-140643, 2025, doi: 10.1109/ACCESS.2025.3596512 A brief online tool to increase behavioral weight loss treatment initiation: Protocol for a cluster randomized trialMegan A. McVay, Wendy S. Moore, Dieulerne Deceus, Savannah B. Townsend, Eric I. Rosenberg, Sofia Muenyi, XiangYang Lou, Fern J. Webb, Luis D. Diaz, Meena N. Shankar, Jaime Ruiz, Corrine I. Voils, and Kathryn M. Ross. 2025.  Contemporary Clinical Trials 154: 107948. https://doi.org/10.1016/j.cct.2025.107948 Exploring Users’ Perceptions on Position, Gaze Direction, and Gender of Virtual Agents in Augmented RealityRodrigo Calvo, Heting Wang, Alexander Barquero, & Jaime Ruiz. (2025). In Proceedings of Graphics Interface 2025. How Hand Constraints Influence User-Defined Gestures in Mixed RealityAlexander Barquero, Niriksha Regmi, Oluwatomisin Obajemu, Rohith Verkatakrishnan, Christina Boucher, Lisa Anthony, & Jaime Ruiz. (2025). In Proceedings of Graphics Interface 2025. May The Force be With You: Cloning Distant Objects to Improve Medium-Field Interactions in Augmented RealityDanish Nisar Ahmed Tamboli, Rohith Venkatakrishnan, Roshan Venkatakrishnan, Balagopal Raveendranath, Julia Woodward, Isaac Wang, Jesse Smith, and Jaime Ruiz. 2025.  In 2025 IEEE Conference Virtual Reality and 3D User Interfaces (VR), 472–482. https://doi.org/10.1109/VR59515.2025.00071 Design of Project STAR: A randomized controlled trial evaluating the impact of an adaptive intervention on long-term weight-loss maintenanceKathryn M. Ross, Meena N. Shankar, Peihua Qiu, Zibo Tian, Taylor N. Swanson, Armaan Shetty, Jaime Ruiz, Lisa Anthony, and Michael G. Perri. 2024. Contemporary Clinical Trials 146: 107707. https://doi.org/10.1016/j.cct.2024.107707 Understanding User Needs for Task Guidance Systems Through the Lens of CookingAlexander Barquero, Rodrigo Luis Calvo, Daniel Alexander Delgado, Isaac Wang, Lisa Anthony, and Jaime Ruiz. 2024.  In Proceedings of the 2024 ACM Designing Interactive Systems Conference (DIS ’24). Association for Computing Machinery, New York, NY, USA, 2006–2018. https://doi.org/10.1145/3643834.3661611 Deep Learning Forecast of Cognitive Workload Using fNIRS DataNicolas Grimaldi, Yunmei Liu, Ryan McKendrick, Jaime Ruiz, and David Kaber. 2024.  In 2024 IEEE 4th International Conference on Human-Machine Systems (ICHMS), 1–6. https://doi.org/10.1109/ICHMS59971.2024.10555701 Classifying Cognitive Workload Using Machine Learning Techniques and Non-Intrusive Wearable DevicesYunmei Liu, Nicolas S. Grimaldi, Niosh Basnet, David Wozniak, Eric Chen, Maryam Zahabi, David Kaber, and Jaime Ruiz. 2024.  In 2024 IEEE 4th International Conference on Human-Machine Systems (ICHMS), 1–6. https://doi.org/10.1109/ichms59971.2024.10555690 Investigating Contextual Notifications to Drive Self-Monitoring in mHealth Apps for Weight MaintenanceYu-Peng Chen, Julia Woodward, Dinank Bista, Xuanpu Zhang, Ishvina Singh, Oluwatomisin Obajemu, Meena N. Shankar, Kathryn M. Ross, Jaime Ruiz, and Lisa Anthony. 2024.  In Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems (CHI ’24). Association for Computing Machinery, New York, NY, USA, Article 993, 1–21. https://doi.org/10.1145/3613904.3641993 Human-Centered Evaluation of EMG-Based Upper-Limb Prosthetic Control ModesYunmei Liu, Joseph Berman, Albert Dodson, Junho Park, Maryam Zahabi, He Huang, Jaime Ruiz, and David B. Kaber. IEEE Transactions on Human-Machine Systems: 1-11. MyTrack+: Human-Centered Design of an mHealth App to Support Long-Term Weight Loss MaintenanceYu-Peng Chen, Julia Woodward, Meena N Shankar, Dinank Bista, Umelo Ugwoaba, Andrea Brockmann, Kathryn M Ross, Jaime Ruiz, and Lisa Anthony. Frontiers in Digital Health 6: 1334058. A low-burden, self-weighing intervention to prevent weight gain in adults with obesity who do not enroll in comprehensive treatmentMegan A. McVay, Montserrat Carrera Seoane, Melinda Rajoria, Marissa Dye, Natalie Marshall, Sofia Moony, Anas Alkanderi, Kellie B. Scotti, Jaime Ruiz, Corrine I. Voils, and Kathryn M. Ross. Obesity Science & Practice 10, 2: e745. Evaluation of Shared-Gaze Visualizations for Virtual Assembly TasksDelgado, D.A, Ruiz, J.  IEEE VR. (2024). “I used to live in Florida”: Exploring the Impact of Spam Call Warning Accuracy on Callee Decision-MakingImani NS Munyaka, Daniel A Delgado, Juan E Gilbert, Jaime Ruiz, and Patrick Traynor. In Proceedings of Symposium on Usable Security and Privacy (USEC) 2024 Assessing workload in using electromyography (EMG)-based prosthesesJunho Park, Joseph Berman, Albert Dodson, Yunmei Liu, Matthew Armstrong, He Huang, David Kaber, Jaime Ruiz & Maryam Zahabi. 2023, Ergonomics, DOI: 10.1080/00140139.2023.2221413 Stop Copying Me: Evaluating nonverbal mimicry in embodied motivational agentsIsaac Wang, Rodrigo Calvo, Heting Wang, and Jaime Ruiz. 2023.  In Proceedings of the 23rd ACM International Conference on Intelligent Virtual Agents (IVA ’23). Association for Computing Machinery, New York, NY, USA, Article 49, 1–4. https://doi.org/10.1145/3570945.3607322 A Categorical Representation Language and Computational System for Knowledge-Based Robotic Task PlanningAngeline Aguinaldo, Evan Patterson, James Fairbanks, William Regli and Jaime Ruiz. 2023. In Proceedings of 2023 AAAI Fall Symposium on Unifying Representations for Robot Application Development (UR-RAD). Pp. 1–8. AAAI, 2023. https://doi.org/10.1609/aaaiss.v2i1.27718 Cognitive Workload and Usability of Virtual Reality Simulation for Prosthesis TrainingJunho Park, Austin Music, Daniel Delgado, Joseph Berman, Albert Dodson, Yunmei Liu, Jaime Ruiz, He Huang, David Kaber, and Maryam Zahabi. 2023. Cognitive Workload and Usability of Virtual Reality Simulation for Prosthesis Training. In 2023 IEEE International Conference on Systems, Man, and Cybernetics (SMC), IEEE, 1567–1572. Designing Textual Information in AR Headsets to Aid in Adults’ and Children’s Task PerformanceJulia Woodward and Jaime Ruiz. 2023. In Proceedings of the 22nd Annual ACM Interaction Design and Children Conference (IDC ’23). Association for Computing Machinery, New York, NY, USA, 27–39. https://doi.org/10.1145/3585088.3589373 Designing Critical and Secondary Information in Augmented Reality Headsets for Situational AwarenessJulia Woodward, Jesse Smith, Isaac Wang, Sofia Cuenca, Jamie Ruiz. 2023. Journal of Engineering Research and Sciences 2(3):01-15, 2023 doi: 10.55708/js0203001 ggMOB: Elucidation of genomic conjugative features and associated cargo genes across bacterial genera using genus-genus mobilization networksGowri Nayar, Ignacio Terrizzano, Ed Seabolt, Akshay Agarwal, Christina Boucher, Ilya B Slizovskiy, Jaime Ruiz, James H Kaufman, and Noelle Robertson Noyes. 2022. Frontiers in Genetics: 3207. Cognitive Workload Classification of Upper-limb Prosthetic DevicesJunho Park, Joseph Berman, Albert Dodson, Yunmei Liu, Armstrong Matthew, He Huang, David Kaber, Jaime Ruiz, and Maryam Zahabi. In 2022 IEEE 3rd International Conference on Human-Machine Systems (ICHMS), pp. 1-6. IEEE, 2022. KARGAMobile: Android app for portable, real-time, easily interpretable analysis of antibiotic resistance genes via nanopore sequencingAlexander Barquero, Simone Marini, Christina Boucher, Jaime Ruiz, and Mattia Prosperi. 2022.  Frontiers in Bioengineering and Biotechnology 10. Examining voice assistants in the context of children’s speechMin Kyong Kim, Stefania Druga, Shaghayegh Esmaeili, Julia Woo",
  "content_length": 27972,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:37"
}