{
  "name": "Jainendra Shukla",
  "homepage": "https://www.iiitd.ac.in/jainendra",
  "status": "success",
  "content": "IIIT-Delhi Skip to main content -A A A+ AA Jainendra Shukla Jainendra Shukla Associate Professor (CSE, HCD) PhD (2018), Universitat Rovira i Virgili (URV), Spain Contact Details 011-26907523 jainendra@iiitd.ac.in Web Profile A-410 (R&D Block) Profile Jainendra Shukla, the founder, and director of the Human-Machine Interaction [HMI] research group at IIIT-Delhi, holds a distinguished Ph.D. with Industrial Doctorate and International Doctorate distinctions from Universitat Rovira i Virgili (URV), Spain. Earlier, he completed an M.Tech. in I.T. with a specialization in Robotics at the Indian Institute of Information Technology, Allahabad (IIIT-Allahabad), and a B.E. in I.T. with First Class and Distinction from the University of Mumbai. He is enthusiastic about empowering machines with emotional intelligence and adaptive interaction ability that can improve the quality of life in health and social care. His research has been disseminated in several venues of international reputation, including CHI, UbiComp, and IEEE Transactions on Affective Computing. He has co-developed the first-ever MOOC course on Affective Computing for NPTEL. He also serves as an Associate Editor on the editorial board of IEEE Transactions on Affective Computing. Currently, as the Principal Investigator, he is leading the European Education and Culture Executive Agency funded project, Capacity Building in Robotics & Autonomous Systems in India [IRAS-HUB]. Previously, his research has been supported by the Startup Research Grant (SRG) from SERB, Government of India, and Industrial Doctorate research grant from the Government of Spain. His contributions have been widely recognized, including an Honorable Mention at CHI 2024 by SIGCHI, and Distinguished Research, Research Excellence, and Teaching Excellence awards by IIIT-Delhi. Selected Publications: » A. B., Deeptanshu, S. Gulati and J. Shukla, \"Artificial Intelligence Driven Predictive Analysis of Acoustic and Linguistic Behaviors for ASD Identification\", IEEE Transactions on Artificial Intelligence, vol. 5, no. 11, pp. 5709-5719, Nov. 2024. » R. Vatsal, S. Mishra, R. Thareja, M. Chakrabarty, O. Sharma and J. Shukla, \"An Analysis of Physiological and Psychological Responses in Virtual Reality and Flat Screen Gaming\" IEEE Transactions on Affective Computing, pp 1-15, 2024. » A. Sarkar, P. R. Behera, and J. Shukla, \"Multi-Source Transfer Learning for Facial Emotion Recognition Using Multivariate Correlation Analysis\" Scientific Reports, vol. 13, no. 1, p. 21004, 2023. » V. Jain, M. Leekha, R. R. Shah, and J. Shukla, \"Exploring Semi-Supervised Learning for Predicting Listener Backchannels\" in Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, CHI’21, pp 1-12, May 8-13, Yokohama, Japan, 2021. » D. Verma, S. Bhalla, D. Sahnan, J. Shukla, and A. Parnami, \"Expressear: Sensing Fine-Grained Facial Expressions With Earables\" Proc. ACM Interact. Mob. Wearable Ubiquitous Technol., UbiComp/ISWC’21, vol. 5, September 21-26, 2021. » J. Shukla, M. Barreda-Angeles, J. Oliver, G. Nandi, and D. Puig, \"Feature Extraction and Selection for Emotion Recognition From Electrodermal Activit IEEE Transactions on Affective Computing, 12(4), 857-869, 2019. Research Interests Affective Computing Human-Computer Interaction Social Robotics Ubiquitous Computing Teaching Interests Affective Computing Machine Learning Social Robotics Affiliated Centres & Labs Infosys Centre for Artificial Intelligence (CAI) Center for Design and New Media (Supported by Tata Consultancy Services, a TCS Foundation Initiative) Human-Machine Interaction Lab (HMI)",
  "content_length": 3620,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:36"
}