{
  "name": "Jain Arijit Sur",
  "homepage": "http://www.iitg.ernet.in/arijit",
  "status": "success",
  "content": "Dr. Arijit Sur, Professor, IIT Guwahati Contactez-moi Remplissez le formulaire ci-dessous afin de m'envoyer un message. Je vous répondrais dans les plus bref délai. Tous les champs sont requis. Dr. Arijit Sur Professor Dept. of Computer Science and Engineering IIT Guwahati-781039, Assam, India Ph:  +91-361-258-2361 (office) +91-361-258-4361 (Residence) Email: arijit@iitg.ac.in Latest News July 2024: • Two of our papers, titled GraPix: Exploring Graph Modularity Optimization for Unsupervised Pixel Clustering (First Author: Sonal Kumar) and Zero-Shot Underwater Gesture Recognition (First Author: Sandipan Sarma) have been accepted in 27th International Conference on Pattern Recognition (ICPR 2024). July 2024: • A journal paper titled TMLNet: Triad Multitask Learning for change detection (First Author: Avinash Chouhan) has been accepted in Neurocomputing, Elsevier. May 2024: • A journal paper titled Collaborative Video Caching in the Edge Network using Deep Reinforcement Learning (First Author: Anirban Lekharu) has been accepted in ACM Transactions on Internet of Things. April 2024: • A journal paper titled Content-Aware Caching at the Mobile Edge Network using Federated Learning (First Author: Anirban Lekharu) has been accepted in IEEE Transactions on Emerging Trends in Computational Intelligence (TETCI). March 2024: • A journal paper titled DatUS: Data-driven Unsupervised Semantic Segmentation with Pre-trained Self-supervised Vision Transformer (First Author: Sonal Kumar) has been accepted in IEEE Transactions on Emerging Trends in Computational Intelligence (TETCI). February 2024: • A journal paper titled Reinforcement Learning based Adaptive BitRate Caching at MEC Server (First Author: Anirban Lekharu) has been accepted in IEEE Transactions on Network and Service Management. February 2024: • A journal paper titled Multi-Contextual Design of Convolutional Neural Network for Steganalysis (First Author: Brijesh Singh) has been accepted in Multimedia Tools and Applications, Springer. February 2024: • Four of our papers, titled Attention-Based Spatial-Frequency Information Network For Underwater Single Image Super-Resolution (First Author: Alik Pramanick), Boosting Zero-Shot Human-Object Interaction Detection With Vision-Language Transfer (First Author: Sandipan Sarma), Ipcl: Iterative Pseudo-Supervised Contrastive Learning To Improve Self-Supervised Feature Representation (First Author: Sonal Kumar), and X-Caunet: Cross-Color Channel Attention With Underwater Image-Enhancing Transformer (First Author: Alik Pramanick) have been accepted in IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2024). December 2023: • A journal paper titled HybridNet: Integrating Multiple Approaches for Aerial Semantic Segmentation (First Author: Avinash Chouhan) has been accepted in SN Computer Science, Springer. August 2023: • A journal paper titled DiRaC-I: Identifying Diverse and Rare Training Classes for Zero-Shot Learning (First Author: Sandipan Sarma) has been accepted in ACM Transactions on Multimedia Computing, Communications, and Applications (ACM TOMM). June 2023: • A journal paper titled Knee osteoarthritis severity prediction using an attentive multi-scale deep convolutional neural network (First Author: Rohit Kumar Jain) has been accepted in Multimedia Tools and Applications, Springer. Important Links HOME Publications Students Teaching Research Interest Multimedia Lab Projects Professional Activities Invited Talk About Dr. Arijit Sur received his M. Sc. And M. Tech. degrees from the University of Calcutta in 2001 and 2003 respectively. He received his Ph. D. degree from the Dept. of CSE, IIT Kharagpur in 2010. Dr. Sur joined the Dept. of CSE, IIT Guwahati as an Assistant professor in 2009 and now he is a professor there. His research is mainly focused on Deep Learning approaches to solving different Computer Vision problems like image, video restoration, super-resolution, semantic segmentation, and change detection in various application domains like underwater vision, satellite, and remote sensing image analysis, and medical imaging, media forensics, etc. His group is also working on different machine learning-based problems like zero-shot learning, semi-supervised learning, robotic vision, and ML-based approaches for adaptive video streaming in a 5G environment. Dr. Sur founded a research project lab named \"Multimedia Lab\" in the Dept. of CSE on 2012. Currently, eight research scholars are pursuing their Ph.D. work under his guidance, and eight students have graduated. Dr. Sur has coauthored 32 top-tier journal papers and more than 50 conference papers in different premier forums. Presently he is working as an Associate Editor of Multimedia Systems Journal, Springer, and is invited as an Associate Editor for APSIPA Trans. on Information and Signal Processing (ATSIP). For the details about his research activities, please visit Multimedia Lab website",
  "content_length": 4961,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:39"
}