{
  "name": "Jake Lever",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/jakelever",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Jake Lever Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffJake LeverMr Ethan KellyZhen Tian Dr Jake Lever Lecturer in Natural Language Processing / Information Retrieval (School of Computing Science) Affiliate (School of Cancer Sciences) email: Jake.Lever@glasgow.ac.uk pronouns: He/him/his Room 331, School of Computing Science, Sir Alwyn Williams Building, 18 Lilybank Gardens, Glasgow, G128RZ Import to contacts https://orcid.org/0000-0001-8198-2939 Biography I am a Lecturer (Assistant Professor) in the Information, Data and Analysis section in the School of Computing Science. My research focuses on extracting biomedical knowledge from biomedical text (e.g. published research literature) using different natural language processing and machine learning methods. This helps researchers to find important research knowledge and paves the way for representing biological knowledge computationally that artificial intelligence can reason on. I’ve focused in areas of precision medicine which tries to tailor treatment to an individual patient’s genetics and frequently relies on the latest research findings. Before I moved to Glasgow, I spent two years at Stanford University as a postdoctoral researcher in the Helix Group. I received my Ph.D. in Bioinformatics from the University of British Columbia in Vancouver, Canada where I undertook research at Canada’s Michael Smith Genome Sciences Centre at BC Cancer. I completed my B.Eng. degree at the University of Edinburgh in Software Engineering. I co-lead the Glasgow AI4BioMed Lab, where we work on natural language processing, knowledge graphs, language models, and more to extract and infer biomedical knowledge. If you'd be interested in working with us, please take a look at this page on the lab website. Research interests Natural language processing, especially in biomedicine Information extraction Knowledge bases & knowledge inference Applications of machine learning, particularly biomedical Bioinformatics & computational biology Research Projects | Google Scholar Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2012Number of items: 34.2025 Yi, Xinhao ORCID: https://orcid.org/0009-0006-1882-0236, Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939, Bryson, Kevin ORCID: https://orcid.org/0000-0002-1163-6368 and Meng, Zaiqiao ORCID: https://orcid.org/0000-0001-5374-0318 (2025) Can We Edit LLMs for Long-Tail Biomedical Knowledge? In: 2025 Conference on Empirical Methods in Natural Language Processing (EMNLP 2025), Suzhou, China, 05-09 November 2025, (Accepted for Publication) Alyahyan, Eyman, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 (2025) Adoption, Usage, and Perceptions of LLM-Generated Feedback in Computer Science Education: A Cross-Cultural Study of Students and Academics. In: 2025 Frontiers in Education Conference (FIE 2025), Nashville, Tennessee, 02-05 November 2025, (Accepted for Publication) Alyahyan, Eyman, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 (2025) Comparing Feedback Practices in Higher Education: Perspectives from Academics and Students in the UK and Saudi Arabia. In: 2025 Frontiers in Education Conference (FIE 2025), Nashville, Tennessee, 02-05 November 2025, (Accepted for Publication) Alyahyan, Eyman, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 (2025) WIP: A Pedagogical Prompt Engineering Framework for LLM-Based Feedback in Higher Education (PPE-LLM). In: 2025 Frontiers in Education Conference (FIE 2025), Nashville, Tennessee, 02-05 November 2025, (Accepted for Publication) Zhang, Xi, Meng, Zaiqiao ORCID: https://orcid.org/0000-0001-5374-0318, Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 and Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X (2025) Libra: Leveraging Temporal Images for Biomedical Radiology Analysis. In: 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025), Vienna, Austria, 27 July - 1 Aug 2025, (Accepted for Publication) Sanz-Cruzado, Javier ORCID: https://orcid.org/0000-0002-7829-5174 and Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 (2025) Accelerating Cross-Encoders in Biomedical Entity Linking. In: 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025), 24th BioNLP Workshop, Vienna, Austria, 1 Aug 2025, (Accepted for Publication) Alyahyan, Eyman, Bikanga Ada, Mireilla ORCID: https://orcid.org/0000-0001-5406-6935 and Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 (2025) A Systematic Mapping of Large Language Models as Feedback provider in Higher Education. In: 25th IEEE International Conference on Advanced Learning Technologies (ICALT 2025), Changhua, Taiwan, 14-17 July 2025, (Accepted for Publication) 2024 Frayling, Erlend, Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 and McDonald, Graham ORCID: https://orcid.org/0000-0002-1266-5996 (2024) UoG Siephers at \"Discharge Me!\": Exploring Ways to Generate Synthetic Patient Notes From Multi-Part Electronic Health Records. In: BioNLP 2024 Workshop, Bangkok, Thailand, 11-16 Aug 2024, pp. 712-718. Zhang, Xi, Meng, Zaiqiao ORCID: https://orcid.org/0000-0001-5374-0318, Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 and Ho, Edmond S.L. ORCID: https://orcid.org/0000-0001-5862-106X (2024) Gla-AI4BioMed at RRG24: Visual Instruction-tuned Adaptation for Radiology Report Generation. In: 62nd Annual Meeting of the Association for Computational Linguistics (ACL 2024), 23rd BioNLP Workshop, Bangkok, Thailand, 16 August 2024, pp. 624-634. (doi: 10.18653/v1/2024.bionlp-1.54) 2023 Sosa, Daniel, Hintzen, Rogier, Xiong, Betty, de Giorgio, Alex, Fauqueur, Julien, Davies, Mark, Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 and Altman, Russ B. (2023) Associating biological context with protein-protein interactions through text mining at PubMed scale. Journal of Biomedical Informatics, 145, 104474. (doi: 10.1016/j.jbi.2023.104474) (PMID:37572825) Krysiak, K. et al. (2023) CIViCdb 2022: evolution of an open-access cancer variant interpretation knowledgebase. Nucleic Acids Research, 51(D1), D1230-D1241. (doi: 10.1093/nar/gkac979) (PMID:36373660) 2022 Krysiak, K. et al. (2022) A community approach to the cancer-variant-interpretation bottleneck. Nature Cancer, 3(5), pp. 522-525. (doi: 10.1038/s43018-022-00379-w) (PMID:35624339) 2021 Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939 and Altman, Russ B. (2021) Analyzing the vast coronavirus literature with CoronaCentral. Proceedings of the National Academy of Sciences of the United States of America, 118(23), 2100766118. (doi: 10.1073/pnas.2100766118) (PMID:34016708) Wong, Mike, Previde, Paul, Cole, Jack, Thomas, Brook, Laxmeshwar, Nayana, Mallory, Emily, Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939, Petkovic, Dragutin, Altman, Russ B. and Kulkarni, Anagha (2021) Search and visualization of gene-drug-disease interactions for pharmacogenomics and precision medicine research using GeneDive. Journal of Biomedical Informatics, 117, 103732. (doi: 10.1016/j.jbi.2021.103732) (PMID:33737208) Sosa, Daniel N., Bimbin, Chen, Kaushal, Amit, Lavertu, Adam, Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939, Rensi, Stefano and Altman, Russ (2021) Repurposing biomedical informaticians for COVID-19. Journal of Biomedical Informatics, 115, 103673. (doi: 10.1016/j.jbi.2021.103673) (PMID:33486067) (PMCID:PMC7825863) 2020 Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939, Altman, Russ and Kim, Jin-Dong (2020) Extending TextAE for annotation of non-contiguous entities. Genomics and Informatics, 18(2), e15. (doi: 10.5808/gi.2020.18.2.e15) (PMID:32634869) (PMCID:PMC7362949) Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939, Barbarino, Julia M., Gong, Li, Huddart, Rachel, Sangkuhl, Katrin, Whaley, Ryan, Whirl-Carrillo, Michelle, Woon, Mark, Klein, Teri E. and Altman, Russ B. (2020) PGxMine: Text Mining for Curation of PharmGKB. In: 25th Pacific Symposium on Biocomputing, Puako, HI, USA, 03-07 Jan 2020, pp. 611-622. 2019 Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939, Jones, Martin R., Danos, Arpad M., Krysiak, Kilannin, Bonakdar, Melika, Grewal, Jasleen K., Culibrk, Luka, Griffith, Obi L., Griffith, Malachi and Jones, Steven J.M. (2019) Text-mining clinically relevant cancer biomarkers for curation into the CIViC database. Genome Medicine, 11, 78. (doi: 10.1186/s13073-019-0686-y) (PMID:31796060) (PMCID:PMC6891984) Chun, H.-J. E. et al. (2019) Identification and analyses of extra-cranial and cranial rhabdoid tumor molecular subgroups reveal tumors with cytotoxic T cell infiltration. Cell Reports, 29(8), 2338-2354.e7. (doi: 10.1016/j.celrep.2019.10.013) (PMID:31708418) (PMCID:PMC6905433) Barbaian, Artem, Thompson, I. Richard, Lever, Jake ORCID: https://orcid.org/0000-0001-8198-2939, Gagnier, Liane, Karimi, Mohammad M. and Mager, Dixie L. (2019) LIONS: analysis suite for detecting and quantifying transposable element initiated transcription from RNA-s",
  "content_length": 26613,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:38"
}