{
  "name": "Jakob H. Macke",
  "homepage": "https://uni-tuebingen.de/en/research/core-research/cluster-of-excellence-machine-learning/research/research/cluster-research-groups/professorships/machine-learning-in-science",
  "status": "success",
  "content": "Machine Learning in Science | University of Tübingen Prof. Dr. Jakob Macke Cluster W3 Professorship for 'Machine Learning in Science' Research Interests Our goal is to accelerate scientific discovery using machine learning and artificial intelligence (AI): We develop computational methods that help scientists interpret empirical data and use them gain scientific insights. We closely collaborate with experimental researchers from various disciplines. We are particularly interested in applications in the neurosciences: We want to understand how neuronal networks in the brain process sensory information and control intelligent behaviour. Further Information For further information see Jakob Macke's website. or his channel About Jakob Macke studied mathematics at the University of Oxford. After his studies, he worked as a doctoral student at the Max Planck Institute for Biological Cybernetics in Tübingen, as a postdoc at the Gatsby Unit at University College London and as a Bernstein Fellow at the Max Planck Institute in Tübingen. From 2015 to 2018, he was Max Planck Group Leader at the Caesar Research Centre in Bonn, and from 2017 he was also professor at the Centre for Cognitive Science at the Technical University of Darmstadt. From 2018 to 2020, Macke was Professor of Computational Neuroengineering at the Technical University of Munich. From 2013 to 2018 he was a member of the Young Academy at the German Academy of Sciences Leopoldina. Prof. Dr. Jakob Macke Machine Learning in Science University of Tübingen Cluster of Excellence \"Machine Learning\" Maria-von-Linden-Str. 6, 4th floor Room No. 40-28/A24 72076 Tübingen Secretary: Franziska Weiler +49 7071 29-70850 Franziska.Weilerspam prevention@uni-tuebingen.de",
  "content_length": 1736,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:39"
}