{
  "name": "Jakob Nordström",
  "homepage": "http://www.jakobnordstrom.se",
  "status": "success",
  "content": "Jakob Nordström Jakob Nordström Photo: Kennet Rouna E-mail: jn at-sign di dot ku dot dk or jakob dot nordstrom at-sign cs dot lth dot se Cellular: +46 (0)70 742 21 98 / +45 28 78 38 11 Address in Copenhagen: Datalogisk Institut, Københavns Universitet (DIKU) Algorithms & Complexity Section Universitetsparken 1, office 3-1-09 2100 Copenhagen, DENMARK Address in Lund: Institutionen för datavetenskap Lunds universitet Ole Römers väg 3, office 2130a 221 00 Lund, SWEDEN News I am looking for a postdoc and a PhD student who will help us go even further beyond the state of the art in provably correct computation with certifying algorithms (as per this tutorial) or in combinatorial solving and optimization (as explained in this series of tutorials.) This is a pretty unique opportunity if you have a strong background in both mathematics and programming and wish to combine the two. The application deadline for both positions is is January 16, 2026. Big congratulations to Andy Oertel for successfully defending his licentiate thesis on November 28! I am teaching a course Proof Complexity as a Computational Lens during the winter 2025/26 in Copenhagen and Lund together with Kilian Risse. More information, as well as links to video recordings and lecture notes, can be found on the course webpage. A big welcome to professor Noah Fleming and his PhD student Christophe Marciot, as well to the postdoctoral researchers Kilian Risse and Morgan Shirley, who have all just joined the CS department at Lund University! In January 2026 I am organizing the workshop Theory and Practice of SAT and Combinatorial Solving at the Banff International Research Station together with Olaf Beyersdorff, Daniela Kaufmann, and Ciaran McCreesh. In September I organized the 2nd International Workshop on Highlights in Organizing and Optimizing Proof-logging Systems (WHOOPS '25) at Institut Pascal outside Paris together with Ciaran McCreesh as part of the Final EuroProofNet Symposium. See the WHOOPS '25 workshop webpage for video recordings and slides of the talks. In August I chaired the program committee of the 28th International Conference on Theory and Applications of Satisfiability Testing (SAT 2025) together with Jeremias Berg. In the competitive events affiliated with the SAT 2025 conference, our proof checker VeriPB was used in both the SAT Competition and the Pseudo-Boolean Competition. Our pseudo-Boolean solver RoundingSat took the top placements in the certified tracks for both decision and optimization problems, and was even in the top-10 in the non-certified optimization track when competing with solver without proof logging certifying correctness of results. As last year, many of the other best solvers were built on top of the RoundingSat code base. In June I organized the workshop Certifying Algorithms for Automated Reasoning at Schloss Dagstuhl – Leibniz Center for Informatics together with Nikolaj Bjørner, Marijn Heule, and Daniela Kaufmann. Academic affiliation and background I am a full professor at the Department of Computer Science at the University of Copenhagen, Denmark, and also have a part-time affiliation with the the Department of Computer Science at Lund University. Prior to moving to Copenhagen and Lund, I worked at KTH Royal Institute of Technology as an assistant professor and then associate professor during the years 2011-2019. During 2008-2010 I was a postdoc at the Computer Science and Artificial Intelligence Laboratory at the Massachusetts Institute of Technology hosted by Madhu Sudan. Before that I was a PhD student of Johan Håstad in the Theory Group at KTH. where I defended my PhD thesis in 2008. Please see my biographic sketch for more information. About my research Computers are everywhere today—at work, in our cars, in our living rooms, and even in our pockets—and have changed the world beyond our wildest imagination. Yet these marvellous devices are, at the core, amazingly simple and stupid: all they can do is to mechanically shuffle around zeros and ones. What is the true potential of such automated computational devices? And what are the limits of what can be done by mindless calculations? Finding answers to this kind of questions is ultimately what my research is about. Computational complexity theory gives these deep and fascinating philosophical questions a crisp mathematical meaning. A computational problem is any task that is in principle amenable to being solved by a computer—i.e., it can be worked out by mechanical application of mathematical steps. By constructing general, abstract models of computers we can study how to design efficient methods, or algorithms, for solving different tasks, but also prove mathematical theorems showing that some computational problems just cannot be solved efficiently for inherent reasons (meaning that is impossible to design algorithms for them that are as efficient as we would like). I am particularly interested in understanding combinatorial optimization problems, which are of fundamental mathematical importance but also have wide-ranging applications in industry. My goal is, on the one hand, to prove formally that many such problems are beyond the reach of current algorithmic techniques, but also, on the other hand, to develop new algorithms that have the potential to go significantly beyond the current state of the art. In the last few years, I have also been doing research on how complexity theory can be harnessed to produce certificates that algorithms are actually computing correct results. It is an open secret in combinatorial optimization that even the most mature optimization tools in academica and industry sometimes produce wrong answers, but there has been no really principled way of addressing this problem. Our work has started to change this state of affairs. See the presentation of my research group for more information. Some links Mathematical Insights into Algorithms for Optimization (MIAO) research group Open positions Publications Software Slides (and sometimes video) for some presentations MIAO seminars with some recordings posted on the MIAO Research YouTube channel youtube.com/@MIAOresearch Teaching Biographic sketch Curriculum Vitae: long version and short version (last updated October 1, 2025) Published by: Jakob Nordström <jn~at-sign~di~dot~ku~dot~dk> Updated 2025-11-29",
  "content_length": 6353,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:40"
}