{
  "name": "Jakub Michaliszyn",
  "homepage": "http://www.ii.uni.wroc.pl/~jmi",
  "status": "success",
  "content": "Jakub Michaliszyn web page Jakub Michaliszyn In short: Currently, a Professor of the University of Wrocław. Three years as a postdoc at Imperial College London. PhD in Computer Science since 2012, habilitation since 2022. Contact: ja.kub.michaliszyngmail.com. Papers: see Google Scholar I. Verification Decidability of Model Checking Multi-Agent Systems with Regular Expressions against Epistemic HS Specifications, Jakub Michaliszyn and Piotr Witkowski, IJCAI 2019 Model Checking Multi-Agent Systems against Epistemic HS Specifications with Regular Expressions, Alessio Lomuscio and Jakub Michaliszyn, KR 2016. Verification of Multi-Agent Systems via Predicate Abstraction against ATLK specifications, Alessio Lomuscio and Jakub Michaliszyn, AAMAS 2016. Verifying Multi-Agent Systems by Model Checking Three-valued Abstractions, Alessio Lomuscio and Jakub Michaliszyn, AAMAS 2015. Decidability of model checking multi-agent systems against a class of EHS specifications, Alessio Lomuscio and Jakub Michaliszyn, ECAI 2014. An abstraction technique for the verification of multi-agent systems against ATL specifications, Alessio Lomuscio and Jakub Michaliszyn, KR 2014. Model Checking Unbounded Artifact-Centric Systems, Alessio Lomuscio and Jakub Michaliszyn, KR 2014. An Epistemic Halpern–Shoham Logic, Alessio Lomuscio and Jakub Michaliszyn, IJCAI 2013. II. Automata learning Reachability and Bounded Emptiness Problems of Constraint Automata with Prefix, Suffix and Infix, Jakub Michaliszyn, Jan Otop, Piotr Wieczorek, CONCUR 2023 Deterministic Weighted Automata under Partial Observability, Jakub Michaliszyn, Jan Otop, JELIA 2023 Learning Deterministic Visibly Pushdown Automata Under Accessible Stack, Jakub Michaliszyn, Jan Otop, MFCS 2022 Minimization of Limit-Average Automata, Jakub Michaliszyn, Jan Otop, IJCAI 2021. Learning Deterministic Automata on Infinite Words, Jakub Michaliszyn, Jan Otop, ECAI 2020. Non-deterministic weighted automata evaluated over Markov chains, Jakub Michaliszyn, Jan Otop, J. Comput. Syst. Sci. 108: 118-136 2020. Approximate Learning of Limit-Average Automata, Jakub Michaliszyn, Jan Otop, CONCUR 2019. Non-deterministic Weighted Automata on Random Words, Jakub Michaliszyn, Jan Otop, CONCUR 2018. Average Stack Cost of Büchi Pushdown Automata, Jakub Michaliszyn, Jan Otop, FSTTCS 2017. III. Modal and interval temporal logic \"Most of\" leads to undecidability: Failure of adding frequencies to LTL, Bartosz Bednarczyk, Jakub Michaliszyn, FoSSaCS 2021 Satisfiability versus Finite Satisfiability in Elementary Modal Logics, Jakub Michaliszyn, Jan Otop, Piotr Witkowski, Fundamenta Informaticae 163(2): 165-188, 2016. On the Decidability of Elementary Modal Logics, Jakub Michaliszyn, Emanuel Kieroński and Jan Otop, ACM TOCL 2015. The Undecidability of the Logic of Subintervals, Jerzy Marcinkowski and Jakub Michaliszyn, Fundamenta Informaticae 2014. Elementary Modal Logics over Transitive Structures, Jakub Michaliszyn and Jan Otop, CSL 2013. Decidability of modal logics with particular emphasis on the interval temporal logics, PhD thesis, 2012. Satisfiability vs. Finite Satisfiability in Elementary Modal Logics (journal version), Jakub Michaliszyn, Jan Otop and Piotr Witkowski, in review. Satisfiability vs. Finite Satisfiability in Elementary Modal Logics, Jakub Michaliszyn, Jan Otop and Piotr Witkowski, GANDALF 2012. Finite Satisfiability of Modal Logic over Horn Definable Classes of Frames, Jakub Michaliszyn and Emanuel Kieroński, AIML 2012. Decidable Elementary Modal Logics, Jakub Michaliszyn and Jan Otop, LICS 2012. Modal Logics Definable by Universal Formulas with Three-Variables, Emanuel Kieroński, Jakub Michaliszyn and Jan Otop, FSTTCS 2011. The Ultimate Undecidability Result for the Halpern-Shoham Logic, Jerzy Marcinkowski and Jakub Michaliszyn, LICS 2011. B and D are enough to make the Halpern-Shoham logic undecidable, Jerzy Marcinkowski, Jakub Michaliszyn and Emanuel Kieroński, ICALP 2010. IV. First-order logic Two-variable Universal Logic with Transitive Closure, Emanuel Kieroński and Jakub Michaliszyn, CSL 2012. Two-variable First-Order Logic with Equivalence Closure (journal version), Emanuel Kieroński, Jakub Michaliszyn, Ian Pratt-Hartmann, and Lidia Tendera, SIAM Journal on Computing 2014. Two-variable First-order Logic with Equivalence Closure, Emanuel Kieroński, Jakub Michaliszyn, Ian Pratt-Hartmann and Lidia Tendera, LICS 2012. Decidability of the Guarded Fragment with the Transitive Closure, Jakub Michaliszyn, ICALP 2009. Konstrukcje PDL w logice ze strażnikami (in Polish), Jakub Michaliszyn, MSc thesis, 2008. V. Others Querying Best Paths in Graph Databases, Jakub Michaliszyn, Jan Otop, Piotr Wieczorek, FSTTCS 2017. Querying Data Graphs with Arithmetical Regular Expressions, Maciej Graboń, Jakub Michaliszyn, Jan Otop, Piotr Wieczorek, IJCAI 2016. On Injective Embeddings of Tree Patterns, Jakub Michaliszyn, Anca Muscholl, Sławek Staworko, Piotr Wieczorek, Zhilin Wu, 2012. The cost of being co-Büchi is nonlinear, Jerzy Marcinkowski and Jakub Michaliszyn, 2009. Teaching - see SKOS",
  "content_length": 5098,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:43"
}