{
  "name": "Jakub Marecek",
  "homepage": "https://www.aic.fel.cvut.cz/research-areas/optimization",
  "status": "success",
  "content": "Optimization | Artificial Intelligence Center | CTU Prague OptimizationFinding optimal solution for AI tasks ↓Mathematical optimization is a field of study on the intersection of mathematics, computer science, and electrical engineering that deals with the selection of a best element out of a set with respect to some criterion. The elements of the set are known as feasible solutions and the criterion is known as the objective function. Over the past couple of centuries, much of the work in mathematical optimization has focussed on the case of a convex, time-invariant set of feasible solutions and convex, time-invariant objective functions. This special case has become the work horse of machine learning, artificial intelligence, and most fields of engineering.Research FocusIn our basic research, we focus study extensions towards (1) certain smooth, non-convex feasible sets and objective functions and (2) time-varying feasible sets and objective functions. The smooth non-convex problems, known as commutative and non-commutative polynomial optimization, have extensive applications in power systems, control theory, and machine learning, among others. The same applications can often benefit from the time-varying extensions. Particular examples of the former (1) include our paper at AAAI 2024 (https://arxiv.org/abs/2310.04469), which deals with smoothing of a non-smooth non-convex optimization problem and our papers at AAAI 2021 (https://arxiv.org/abs/2006.07315), in the Journal of AI Research (https://arxiv.org/abs/2209.05274), and IEEE Transactions on Automatic Control (https://arxiv.org/abs/2002.01444) deal with non-commutative polynomial optimization. Notably, we can get the present best results on the COMPAS dataset. Particular examples of the latter (2) include our papers at AAAI 2019 (https://arxiv.org/abs/1809.05870) and AAAI 2020 (https://arxiv.org/abs/1809.03550), as well as recent papers in SIAM Journal on Optimization and Mathematics of OR.Independent of this, in a series of papers in Automatica (e.g., https://arxiv.org/abs/1807.03256, https://arxiv.org/abs/2110.03001, https://arxiv.org/abs/2112.06767) and IJC (https://arxiv.org/abs/2209.13273), we are working on the control on non-linear systems under uncertainty in modelling repeated uses of AI systems, control problems in sharing economy, etc. Latest ProjectsExplore all projects➔OptimizationTENORSSeveral Ph.D. positions are available within Marie Skłodowska-Curie Doctoral Network for tensor modeling, geometry and optimization.March 8, 2024Read more➔OptimizationCoDietHorizon Europe project aiming to combat diet-related diseases through innovative diet-monitoring technologies, AI-assisted data analysis and personalized nutrition.August 23, 2023Read more➔OptimizationAutoFair (Human-Compatible AI with Guarantees)Horizon Europe project for fair AI algorithms supported by the EU with 3,8 million Euros. Imperial College London, the Israeli Institute of Technology Technion and the National and Capodistrian University of Athens as well as partners from the industry collaborate on developing explainable and transparent algorithms.January 31, 2023Read more➔Research ResultsOptimizationChallenges and opportunities in quantum optimizationReview study published in Nature Reviews Physics co-authored by Jakub Mareček.PublicationNovember 28, 2024Read more➔OptimizationNew research paper explores fairness in gig economyRecent publication of the Autofair project proposes a novel market-clearing mechanism to close the gender gap in two-sided markets. Application potential ranges from ride-hailing services like Uber to college admissions or labour markets.PublicationApril 17, 2023Read more➔OptimizationPredictability and fairness in load aggregation and operations of virtual power plantsTwo recent research articles published in the prestigious journal Automatica (January 2023) provide insights into how not to perform load aggregation in power systems and on the flip side, how to formulate the conditions for ergodic behavior in terms of incremental input-to-state stability and related concepts from non-linear control.PublicationJanuary 3, 2023Read more➔Team MembersWe are a diverse and balanced team comprised of students, researchers, and academics.HeadsSenior ResearchersResearchersJakub MarečekTenured Faculty MemberLinkedInGoogle ScholarWebsiteJana LepšováSenior ResearcherLinkedInGoogle ScholarWebsiteGilles BareillesSenior ResearcherLinkedInGoogle ScholarWebsiteAleš WodeckiSenior ResearcherLinkedInGoogle ScholarWebsiteJohannes AspmanSenior researcherLinkedInGoogle ScholarWebsiteGeorgios KorpasSenior Research Fellow and LecturerLinkedInGoogle ScholarWebsitePavel RytířAssistant ProfessorLinkedInGoogle ScholarWebsiteRodion NazarovMaster StudentLinkedInGoogle ScholarWebsiteRuben KarapetyanPh.D. StudentLinkedInGoogle ScholarWebsiteLlorenç Balada GaggioliPh.D. StudentLinkedInGoogle ScholarWebsiteAndrii KliachkinPh.D. StudentLinkedInGoogle ScholarWebsiteJames Rufus Alexander LawrencePh.D. StudentLinkedInGoogle ScholarWebsiteNayoon KimPh.D. StudentLinkedInGoogle ScholarWebsiteJiří Němeček PhD StudentLinkedInGoogle ScholarWebsiteWaqas ParvaizPhD StudentLinkedInGoogle ScholarWebsiteGermán Martínez MatillaPh.D. StudentLinkedInGoogle ScholarWebsiteShenyuan MaPh.D. StudentLinkedInGoogle ScholarWebsiteXiaoyu HeResearcherLinkedInGoogle ScholarWebsiteAllahkaram ShafieiPh.D. StudentLinkedInGoogle ScholarWebsiteAntonio BellonPh.D. StudentLinkedInGoogle ScholarWebsite-Open Positions-UpcomingEventsHacking human futureLatest newsExplore all news➔OptimizationFairness in Repeated Uses of AI SystemsJakub Mareček’s LION 19 keynote presents a framework for reasoning about repeated uses of AI systems and the new Interconnect toolkit for long-run properties therein.ArticleJune 26, 2025Read more➔OptimizationUnderstanding Quantum Algorithms: New Study in Nature Reviews PhysicsThe new publication, co-authored by the AIC researcher Jakub Mareček, explores challenges and opportunities in quantum optimization.ArticleJune 26, 2025Read more➔OptimizationAI Act on the horizon: Companies should start preparingBefore Christmas, so-called trilogue negotiations between the European Parliament, the Council of the European Union and the European Commission culminated in a preliminary agreement on a regulation known as the Artificial Intelligence Act (\"Regulation of the European Parliament and of the Council laying down harmonised rules on artificial intelligence\"). A few more formal steps will be needed, but the regulation will be in force before the European Parliament elections in June 2024. And after transitional periods (from 6 to 36 months, depending on the risks), it will come into effect.ArticleJanuary 27, 2024Read more➔By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts.PreferencesDenyAccept Privacy Preference CenterWhen you visit websites, they may store or retrieve data in your browser. This storage is often necessary for the basic functionality of the website. The storage may be used for marketing, analytics, and personalization of the site, such as storing your preferences. Privacy is important to us, so you have the option of disabling certain types of storage that may not be necessary for the basic functioning of the website. Blocking categories may impact your experience on the website.Reject all cookiesAllow all cookiesManage Consent Preferences by CategoryEssentialAlways ActiveThese items are required to enable basic website functionality.MarketingEssentialThese items are used to deliver advertising that is more relevant to you and your interests. They may also be used to limit the number of times you see an advertisement and measure the effectiveness of advertising campaigns. Advertising networks usually place them with the website operator’s permission.PersonalizationEssentialThese items allow the website to remember choices you make (such as your user name, language, or the region you are in) and provide enhanced, more personal features. For example, a website may provide you with local weather reports or traffic news by storing data about your current location.AnalyticsEssentialThese items help the website operator understand how its website performs, how visitors interact with the site, and whether there may be technical issues. This storage type usually doesn’t collect information that identifies a visitor.Confirm my preferences and close",
  "content_length": 8591,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:40"
}