{
  "name": "Jakub Radoszewski",
  "homepage": "http://uw.academia.edu/JakubRadoszewski",
  "status": "success",
  "content": "Jakub Radoszewski - University of Warsaw Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Jakub RadoszewskiUniversity of Warsaw, Faculty of Mathematics, Informatics and Mechanics, Post-DocaddFollowdoneFollowingFollowers22Following5Co-authors5Public ViewsRelated Authors Lasse HakulinenAalto University Miloslav Sredkov Tsvetan BogdanovSofia University \"St. Kliment Ohridski\" Krassimir N ManevNew Bulgarian University Emil StankovSs. Cyril and Methodius University (UKIM) (Univerzitet \"Sv. Kiril i Metodij\" - Skopje) Digdo ListyadiUniversity of Jember Dr. Horvath Gyula Pedro Guerreiro Niclas SchaperUniversity of Paderborn Ł. MikulskiInterests UploadsPapers by Jakub RadoszewskiA Proposal for a Task Preparation ProcessThis paper presents in details the task preparation process in the Polish Olympiad in In- formati... more This paper presents in details the task preparation process in the Polish Olympiad in In- formatics. It is a result of over 15 years of experience in organization of programming contests for high-school students. It is also a proposal of best practices that should be applied in a task prepa- ration process for any programming contest. Although many elements ofDownload Efficient Testing of Equivalence of Words in a Free Idempotent Semigroupby Wojciech Rytter and Jakub RadoszewskiWe present an automata–theoretic approach to a simple Burnside–type problem for semigroups. For t... more We present an automata–theoretic approach to a simple Burnside–type problem for semigroups. For two words of total length n over an alphabet Σ, we give an algorithm with time complexity O(n·|&amp;amp;lt;/font &amp;amp;gt;S&amp;amp;lt;/font &amp;amp;gt;|&amp;amp;lt;/font &amp;amp;gt;)O\\left(n\\cdot|\\Sigma|\\right) and space complexity O(n) which tests their equivalence under the idempotency relation x 2 ≈ x. The algorithm verifies whether one word can be transformed to another one Universal Reconstruction of a Stringby Jakub Radoszewski, Wojciech Rytter, and Tomasz KociumakaLecture Notes in Computer Science, 2015 A Note on the Longest Common Compatible Prefix Problem for Partial Wordsby Wojciech Rytter and Jakub RadoszewskiFor a partial word w the longest common compatible prefix of two positions i, j, denoted lccp(i, ... more For a partial word w the longest common compatible prefix of two positions i, j, denoted lccp(i, j), is the largest k such that w[i, i+k−1] ↑ w[j, j +k−1], where ↑ is the compatibility relation of partial words (it is not an equivalence relation). The LCCP problem is to preprocess a partial word in such a way that any query lccp(i, j) about this word can be answered in O(1) time. It is a natural generalization of the longest common prefix (LCP) problem for regular words, for which an O(n) preprocessing time and O(1) query time solution exists.Download Computing k-th Lyndon Word and Decoding Lexicographically Minimal de Bruijn Sequenceby Tomasz Kociumaka, Wojciech Rytter, and Jakub RadoszewskiABSTRACT Let Σ be a finite ordered alphabet. We present polynomial-time algorithms for computing ... more ABSTRACT Let Σ be a finite ordered alphabet. We present polynomial-time algorithms for computing the k-th in the lexicographic order Lyndon word of a given length n over Σ and counting Lyndon words of length n that are smaller than a given word. We also use the connections between Lyndon words and minimal de Bruijn sequences (theorem of Fredricksen and Maiorana) to develop the first polynomial time algorithm for decoding minimal de Bruijn sequence of any rank n (it determines the position of an arbitrary word of length n within the de Bruijn sequence). Our tools mostly rely on combinatorics on words and automata theory. A linear time algorithm for seeds computationby Wojciech Rytter and Jakub RadoszewskiProceedings of the …, 2012Periodicity in words is one of the most fundamental areas of text algorithms and combinatorics. T... more Periodicity in words is one of the most fundamental areas of text algorithms and combinatorics. Two classical and natural variations of periodicity are seeds and covers (also called quasiperiods). Linear-time algorithms are known for finding all the covers of a word, however in case of seeds, for the past 15 years only an O(n log n) time algorithm was known (Iliopoulos, . Finding an o(n log n) time algorithm for the all-seeds problem was mentioned as one of the most important open problems related to repetitions in words in a survey by Smyth . We show a linear-time algorithm computing all the seeds of a word, in particular, the shortest seed. Our approach is based on the use of a version of LZ-factorization and non-trivial combinatorial relations between the LZ-factorization and seeds. It is used here for the first time in context of seeds. It saves the work done for factors processed earlier, similarly as in Crochemore's square-free testing.Download Covering problems for partial words and for indeterminate stringsby Wojciech Rytter, Tomasz Kociumaka, Tomasz Waleń, and Jakub RadoszewskiWe consider the problem of computing a shortest solid cover of an indeterminate string. An indete... more We consider the problem of computing a shortest solid cover of an indeterminate string. An indeterminate string may contain non-solid symbols, each of which specifies a subset of the alphabet that could be present at the corresponding position. We also consider covering partial words, which are a special case of indeterminate strings where each non-solid symbol is a don't care symbol. We prove that indeterminate string covering problem and partial word covering problem are NP-complete for binary alphabet and show that both problems are fixed-parameter tractable with respect to k, the number of non-solid symbols. For the indeterminate string covering problem we obtain a 2 O(k log k) + nk O(1) -time algorithm. For the partial word covering problem we obtain a 2 O( √ k log k) + nk O(1) -time algorithm. We prove that, unless the Exponential Time Hypothesis is false, no 2 o( √ k) n O(1) -time solution exists for either problem, which shows that our algorithm for this case is close to optimal. We also present an algorithm for both problems which is feasible in practice.Download Internal pattern matching queries in a text and applicationsby Tomasz Kociumaka, Wojciech Rytter, Tomasz Waleń, and Jakub RadoszewskiWe present a linear-space data structure which enables very fast (usually constant time) answers ... more We present a linear-space data structure which enables very fast (usually constant time) answers to several types of internal queries -questions about factors (also called substrings) of a text. A factor-in-factor occurrence query asks for a representation of the set of all occurrences of one factor x in another factor y of the same text v of length n. It assumes that |y| = O(|x|), in this case the representation consists of a constant number of arithmetic progressions. This problem can be viewed as an internal version of the well-studied pattern matching problem. Our data structure is optimal: it has linear size and the query time is constant, also the construction time is linear. Using the solution to the factor-in-factor problem, we obtain very efficient data structures answering queries about: primitivity of factors, periods of factors, general substring compression, and cyclic equivalence of two factors. All these results improve upon the best previously known counterparts. Using our data structure for the period queries, we also provide the best known solutions for the recently introduced factor suffix selection queries and for finding δ-subrepetitions in a text (a more general version of maximal repetitions, also called runs). With the latter improvement we obtain the first linear time algorithm finding δ-subrepetitions for a fixed δ, which matches the linear time complexity of the algorithm computing runs. We benefit here from the linear construction time of our data structure.Download Maximum number of distinct and nonequivalent nonstandard squares in a wordby Tomasz Kociumaka, Wojciech Rytter, Tomasz Waleń, and Jakub RadoszewskiThe combinatorics of squares in a word depends on how the equivalence of halves of the square is ... more The combinatorics of squares in a word depends on how the equivalence of halves of the square is defined. We consider Abelian squares, parameterized squares and order-preserving squares. The word uv is an Abelian (parameterized, order-preserving) square if u and v are equivalent in the Abelian (parameterized, order-preserving) sense. The maximum number of ordinary squares is known to be asymptotically linear, but the exact bound is still investigated. We present several results on the maximum number of distinct squares for nonstandard subword equivalence relations. Let SQ Abel (n, k) and SQ Abel (n, k) denote the maximum number of Abelian squares in a word of length n over an alphabet of size k, which are distinct as words and which are nonequivalent in the Abelian sense, respectively. We prove that SQ Abel (n, 2) = Θ(n 2 ) and SQ Abel (n, 2) = Ω(n 1.5 / log n). We also give linear bounds for parameterized and order-preserving squares for small alphabets: SQ param (n, 2) = Θ(n) and SQ op (n, O(1)) = Θ(n). As a side result we construct infinite words over the smallest alphabet which avoid nontrivial order-preserving squares and nontrivial parameterized cubes (nontrivial parameterized squares cannot be avoided in an infinite word).Download Efficient Algorithms for Shortest Partial Seeds in Wordsby Tomasz Kociumaka, Wojciech Rytter, Tomasz Waleń, and Jakub RadoszewskiA factor u of a word w is a cover of w if every position in w lies within some occurrence of u in... more A factor u of a word w is a cover of w if every posi",
  "content_length": 16457,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:43"
}