{
  "name": "Jalaj Upadhyay",
  "homepage": "https://sites.google.com/view/jalajupadhyay/home",
  "status": "success",
  "content": "Jalaj UpadhyaySearch this siteEmbedded FilesSkip to main contentSkip to navigationabout meI am an assistant professor at Rutgers University and was a co-founder of Decompute. I am affiliated with the Center for Discrete Mathematics and Theoretical Computer Science (DIMACS), Rutgers Theory group, Applied Probability and Data Analytics Lab, and Rutgers Institute for Data Science, Learning, and Applications (IDSLA). In previous avatars, I have been a senior researcher at Apple, postdoctoral fellow at Johns Hopkins University and Pennsylvania State University, and a Ph.D. student at the University of Waterloo.Recent update: We wrote a monograph on Correlated Noise Mechanism for Differentially Private Learning to make the recent advances in this domain accessible to more people. This is written in collaboration with an amazing set of authors: Krishna Pillutla, Christopher A. Choquette-Choo, Krishnamurthy Dvijotham, Arun Ganesh, Monika Henzinger, Jonathan Katz, Ryan McKenna, H. Brendan McMahan, Keith Rush, Thomas Steinke, and Abhradeep Thakurta. Comments are welcome. My research focuses on theoretical computer science (see my Google Scholar, DBLP, or research page for more details). Of late, I have also developed some interest in mathematical physics and its application in privacy-preserving algorithms. Some of my colleagues in the physics and maths department are running Physics of ML reading group. Join us!Acknowledgement: My research has been funded by generous gifts from NSF CNS 2433628, Google (Seed Fund grant, Google Research Scholar Award), Dean Research Seed Fund, and Decanal Research Grant. Interested in working with me?The best way to reach me is to send an email to jalaj (dot) upadhyay (at) rutgers (dot) edu for academic purposes. Please do not use my personal email address for any academic purposes unless we have pre-established academic collaborations. I will delete the email without any consideration. Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 1991,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:41"
}