{
  "name": "Jamal Atif",
  "homepage": "https://www.lamsade.dauphine.fr/fr/personnes/detail-cv/profile/jamal-atif.html",
  "status": "success",
  "content": "Atif Jamal | Laboratoire d’Analyse et de Modélisation de Systèmes d’Aide à la Décision (LAMSADE) Menu Contenu Recherche AccueilPersonnes Curriculum vitae Atif Jamal Professeur des universités LAMSADE jamal.atifping@lamsade.dauphinepong.fr Tel : 01 44 05 42 30 Bureau : P620 Biographie Jamal Atif est professeur à l’Université Paris-Dauphine, Chargé de Mission \"Science des données et intelligence artificielle\" à l'Institut des Sciences de l'Information et de leurs Interactions (INS2I) du CNRS, Directeur Scientifique Adjoint du 3IA PRAIRIE, Responsable de l'équipe/projet MILES du LAMSADE (UMR CNRS-Université Paris-Dauphine), Co-porteur du Programme Transverse Intelligence Artificielle de l'Université PSL, et directeur du programme Dauphine Numérique. Ses intérêts de recherche actuels portent sur les fondements de l'intelligence artificielle responsable : préservation de la vie privée en apprentissage automatique, robustesse des algorithmes d'apprentissage profonds aux attaques malveillantes, causalité, explicabilité. Avant de rejoindre Dauphine-PSL, Jamal Atif a été membre de l'équipe TAO (CNRS, Inria, Université Paris-Sud) du LRI de 2010 à 2014, de l'équipe ESPACE de l'IRD de 2006 à 2010, du LTCI (CNRS-Télécom ParisTech) de 2004 à 2006, et du LIMSI (UPR CNRS) de 2000 à 2004. Il est l'auteur de plus 100 publications scientifiques dans le domaine de l'IA, a co-encadré ou encadre une quinzaine de doctorants, et lauréat de deux prix de la société nord-américaine en radiologie ses travaux de thèse. Dernières publications ArticlesPinot R., Meunier L., Yger F., Gouy-Pailler C., Chevaleyre Y., Atif J. (2022), On the robustness of randomized classifiers to adversarial examples, Machine Learning, vol. 111, n°9, p. 3425–3457 Labernia F., Yger F., Mayag B., Atif J. (2018), Query-based learning of acyclic conditional preference networks from contradictory preferences, EURO Journal on Decision Processes, vol. 6, n°1-2, p. 39-59 Aiguier M., Atif J., Bloch I., Pino Pérez R. (2018), Explanatory relations in arbitrary logics based on satisfaction systems, cutting and retraction, International Journal of Approximate Reasoning, vol. 102, p. 1-20 Aiguier M., Atif J., Bloch I., Hudelot C. (2018), Belief revision, minimal change and relaxation: A general framework based on satisfaction systems, and applications to description logics, Artificial Intelligence, vol. 256, p. 160-180 Isaac Y., Barthélemy Q., Gouy-Pailler C., Sebag M., Atif J. (2017), Multi-dimensional signal approximation with sparse structured priors using split Bregman iterations, Signal Processing, vol. 130, p. 389-402 Atif J., Bloch I., Hudelot C. (2016), Some relationships between fuzzy sets, mathematical morphology, rough sets, F-transforms, and formal concept analysis, International Journal of Uncertainty, Fuzziness and Knowledge-Based Systems, vol. 24, n°S2, p. 1-32 Bloch I., Atif J. (2016), Defining and computing Hausdorff distances between distributions on the real line and on the circle: link between optimal transport and morphological dilations, Mathematical Morphology. Theory and Applications, vol. 1, n°1, p. 79-99 Bloch I., Atif J. (2015), Deux approches pour la comparaison de relations spatiales floues : transport optimal et morphologie mathématique, Revue d'intelligence artificielle (RIA), vol. 29, n°5, p. 595-619 Linguet L., Atif J. (2015), Estimating surface solar irradiance from goes satellite with particle filter model and joint probability distribution, Canadian Journal of Remote Sensing, vol. 41, n°2, p. 71-85 Chapitres d'ouvrageLinguet L., Atif J. (2016), A Markov Chain Monte Carlo-based Particle Filter Approach for Spatiotemporal Modelling of an Environmental Process, in N. Janardhana Raju, Geostatistical and Geospatial Approaches for the Characterization of Natural Resources in the Environment: Challenges, Processes and Strategies Springer, p. 617-621 Communications avec actesMeunier L., Ettedgui R., Pinot R., Chevaleyre Y., Atif J. (2022), Towards Consistency in Adversarial Classification, in S. Koyejo ; S. Mohamed ; A. Agarwal ; D. Belgrave ; K. Cho ; A. Oh, Neural Information Processing Systems Foundation, Inc.Benhamou É., Saltiel D., Ohana J-J., Atif J. (2021), House allocation with randomly generated preference lists, in , Piscataway, NJ, IEEE - Institute of Electrical and Electronics Engineers, 10050 - 10057 p. DO V., Atif J., Lang J., Usunier N. (2021), Online Selection of Diverse Committees, in Zhi-Hua Zhou, International Joint Conferences on Artificial Intelligence Organization (IJCAI), 154-160 p. Saltiel D., Benhamou É., Laraki R., Atif J. (2021), Trade Selection with Supervised Learning and Optimal Coordinate Ascent (OCA), in , elsevier, Berlin Heidelberg, Springer International Publishing, 1-15 p. Benhamou É., Saltiel D., Ohana J-J., Atif J., Laraki R. (2020), Deep Reinforcement Learning (DRL) for portfolio allocatio, in Dong, Yuxiao; Ifrim, Georgiana; Mladenić, Dunja, Springer, 527-531 p. Araújo A., Negrevergne B., Chevaleyre Y., Atif J. (2018), Training Compact Deep Learning Models for Video Classification Using Circulant Matrices, in Leal-Taixé Laura; Roth Stefan, Computer Vision – ECCV 2018 Workshops Munich, Germany, September 8-14, 2018, Proceedings, Part IV, Berlin Heidelberg, Springer, 271-286 p. Pinot R., Morvan A., Yger F., Gouy-Pailler C., Atif J. (2018), Graph-based Clustering under Differential Privacy, in Amir Globerson; Ricardo Silva, Uncertainty in Artificial Intelligence (UAI) - Proceedings of the Thirty-Fourth Conference (2018), August 6-10, 2018, Monterey, California, USA, AUAI Press, 329-338 p.Yamane I., Yger F., Atif J., Sugiyama M. (2018), Uplift Modeling from Separate Labels, in S. Bengio; H. Wallach; H. Larochelle; K. Grauman; N. Cesa-Bianchi; R. Garnett, Advances in Neural Information Processing Systems 31 (NIPS 2018), Neural Information Processing Systems Foundation, Inc., 9927--9937 p.Evain T., Ripoche X., Atif J., Bloch I. (2017), Semi-automatic teeth segmentation in cone-beam computed tomography by graph-cut with statistical shape priors, in Olivier Salvado, Gary Egan, 14th IEEE International Symposium on Biomedical Imaging (ISBI), New York, IEEE - Institute of Electrical and Electronics Engineers, 1197-1200 p. Bojarski M., Choromanska A., Choromanski K., Fagan F., Gouy-Pailler C., Morvan A., Sakr N., Sarlos T., Atif J. (2017), Structured adaptive and random spinners for fast machine learning computations, in Aarti Singh, Jerry Zhu, Proceedings of the 20th International Conference on Artificial Intelligence and Statistics (AISTATS 2017), volume 54, IEEE - Institute of Electrical and Electronics Engineers, 1020-1029 p.Labernia F., Zanuttini B., Mayag B., Yger F., Atif J. (2017), Online learning of acyclic conditional preference networks from noisy data, in George Karypis, Lucio Miele, Proceedings of the IEEE International Conference on Data Mining (ICDM 2017), Piscataway, NJ, IEEE - Institute of Electrical and Electronics EngineersLabernia F., Yger F., Mayag B., Atif J. (2016), Query-based learning of acyclic conditional preference networks from noisy data, in Róbert Busa-Fekete, Eyke Hüllermeier, Vincent Mousseau, Karlson Pfannschmidt, From Multiple Criteria Decision Aid to Preference Learning : Proceedings of the DA2PL'2016 EURO Mini Conference, Paderborn, Paderborn University, 6 p.Yang Y., De Aldama R., Atif J., Bloch I. (2016), Efficient Semantic Tableau Generation for Abduction in Propositional Logic, in Gal A. Kaminka, Maria Fox, Paolo Bouquet, Eyke Hüllermeier, Virginia Dignum, Frank Dignum, Frank van Harmelen, ECAI 16, IOS Press, 1756-1757 p. Yang Y., Atif J., Bloch I. (2015), Abductive reasoning using tableau methods for high-level image interpretation, in Steffen Hölldobler, Markus Krötzsch, Rafael Peñaloza, Sebastian Rudolph, KI 2015: Advances in Artificial Intelligence: 38th Annual German Conference on AI, Berlin Heidelberg, Springer, 356-365 p. Evain T., Ripoche X., Atif J., Bloch I. (2015), Fuzzy along spatial relation in 3D. Application to anatomical structures in maxillofacial CBCT, in Vittorio Murino, Enrico Puppo, 18th International Conference on Image Analysis and Processing (ICIAP), Springer, 271-281 p. Bloch I., Atif J. (2015), Hausdorff distances between distributions using optimal transport and mathematical morphology, in Jón Atli Benediktsson, Jocelyn Chanussot, Laurent Najman, Hugues Talbot, 12th International Symposium on Mathematical Morphology, Springer, 522-534 p. Communications sans actesCYFFERS E., Pydi M., Atif J., Cappé O. (2024), Optimal Classification under Performative Distribution Shift, 38th Conference on Neural Information Processing Systems, Vancouver, CanadaAraújo A., Negrevergne B., Chevaleyre Y., Atif J. (2021), On Lipschitz Regularization of Convolutional Layers using Toeplitz Matrix Theory, 35th AAAI Conference on Artificial Intelligence, vancouver, CanadaKirat T., Virginie DO V., Atif J., Tambou O., Tsoukiàs A., Louvaris A. (2021), Fairness as a challenge for computer science and law. Introductory topic, International Workshop Which paths to achieve fairness in algorithmic decisions?, Paris, FrancePinot R., Ettedgui R., Rizk G., Chevaleyre Y., Atif J. (2020), Randomization matters How to defend against strong adversarial attacks, Thirty-seventh International Conference on Machine Learning (ICML 2020), Vienna, AutricheBeji C., Benhamou É., Bon M., Yger F., Atif J. (2020), Estimating Individual Treatment Effects throughCausal Populations Identification, 28th European Symposium on Artificial Neural Networks, Computational Intelligence and Machine Learning (ESANN 2020), Brugges, BelgiquePinot R., Yger F., Gouy-Pailler C., Atif J. (2019), A unified view on differential privacy and robustness to adversarial examples, Workshop on Machine Learning for CyberSecurity at ECMLPKDD 2019, Wurzburg, AllemagnePrépublications / Cahiers de rechercheSebag I., Pydi M., Franceschi J-Y., Rakotomamonjy A., Gartrell M., Atif J. (2024), Differentially Private Gradient Flow based on the Sli",
  "content_length": 11330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:45"
}