{
  "name": "James Boorman",
  "homepage": "https://research.monash.edu/en/persons/james-boorman",
  "status": "success",
  "content": "James Boorman - Monash University View Scopus Profile James Boorman Assoc Professor Associate Professor, Department of Software Systems & Cybersecurity https://orcid.org/0009-0001-0688-8536 EmailJames.Boormanmonashedu 1999 …2026 Research activity per year Personal profile BiographyJames is an Associate Professor of Practice in the Department of Software Systems and Cybersecurity, Pacific Lead for the Faculty of Information Technology, and Co-Director of the Information Empowered Communities Lab. He is currently a Chief Investigator for the Post-Quantum Cryptography in the Indo-Pacific program; co-supervisor for PhD students; and has previously co-supervised Policy Change Studio students from Stanford University and Industry Based Learning (IBL) cybersecurity students in the Australian Government. For more than 20 years he has worked in research, information security management and international development at University College London; University of Cambridge; UK NHS; as a Chief Information Officer and Chief Information Security Officer in the Australian Government; and the Head of Research and Capacity Building at the not-for-profit Oceania Cybersecurity Centre (OCSC). Before joining Monash, James established and led the Cybersecurity Capacity Maturity Model for Nations (CMM) and Roadmap program in the Pacific, in collaboration with Prof. Carsten Rudolph at Monash and the Global Cyber Security Capacity Centre (GCSCC) at the University of Oxford. James is a world recognised expert and trusted advisor on cybersecurity in the Pacific, regularly invited to speak on international panels, at workshops, and attend drills. He has been invited by 10 Pacific Island governments to provide advice to inform national cyber policy and strategy, leading national cyber reviews using the CMM. James has also been invited to co-develop national cyber roadmaps for the Federated States of Micronesia and Nauru. He is an active member of the Global Forum on Cyber Expertise (GFCE) Working Group A: Cyber Security Policy & Strategy; and has been a member of the GFCE Task Force: Strategy and Assessments. James was part of the team that co-designed the first Pacific government regional dialogue with the Partners in the Blue Pacific (PBP) governments of Australia, Canada, Japan, Germany, New Zealand, the Republic of Korea, UK and the USA. James co-authored the resulting PBP Pacific Cyber Capacity Building and Coordination Conference P4C 2023 Outcomes Report, including specific recommendations to inform policy and improve future cyber capacity building in the Pacific. Other capacity building work has included design and delivery of an executive workshop on National Cybersecurity Strategy for Pacific cyber leaders with the U.S. Agency for International Development (USAID); co-authored guidance on identifying critical national infrastructure with GFCE Working Groups A and B; and guidance on tools for assessing national cyber capacity with the GFCE Task Force: Strategy and Assessments. His work at the OCSC has been funded by the Victorian Government; Australian Department of Foreign Affairs and Trade (DFAT); UK Foreign, Commonwealth and Development Office (FCDO); US Department of State (DoS); USAID; UN International Telecommunications Union; World Bank; The Asia Foundation; and the Asia-Pacific Telecommunity (APT).Monash teaching commitmentAssociate Professor James Boorman is a Lecturer for the following unit in the Faculty of IT: FIT5129 - Cyber operations Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research area keywordsPacificPolicyStrategyCybersecurityCapacity Building Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2021 2021 2022 2026 2027 1 Not started 3 Finished Projects per year Building Cyber Resilience in Fiji: Securing the Nation’s Digital FutureLiu, J. (Primary Chief Investigator (PCI)), Rudolph, C. (Chief Investigator (CI)), Boorman, J. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Yuen, J. (Chief Investigator (CI)), Ma, X. (Chief Investigator (CI)), Cui, H. (Chief Investigator (CI)) & Liu, D. (Chief Investigator (CI))2/02/26 → 29/01/27Project: Other Post-Quantum Cryptography in the Indo-PacificSteinfeld, R. (Primary Chief Investigator (PCI)), Esgin, M. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Rudolph, C. (Chief Investigator (CI)), Phan, R. (Chief Investigator (CI)) & Boorman, J. (Chief Investigator (CI))Bureau of East Asian and Pacific Affairs (United States of America)26/09/22 → 30/09/25Project: Research Algorand Centre of Excellence (ACE) on Sustainability Informatics for the PacificLiu, J. (Primary Chief Investigator (PCI)), Rudolph, C. (Chief Investigator (CI)), Pink, S. (Chief Investigator (CI)), Yu, J. (Chief Investigator (CI)), Gasevic, D. (Chief Investigator (CI)), Steinfeld, R. (Chief Investigator (CI)), Du, X. (Chief Investigator (CI)), Liebman, A. (Chief Investigator (CI)), Ma, X. (Chief Investigator (CI)), Luebbers, J. (Chief Investigator (CI)), Ince, P. D. (Chief Investigator (CI)), Sakzad, A. (Chief Investigator (CI)), Yuan, X. (Chief Investigator (CI)), Baiao Dowsley, R. (Chief Investigator (CI)), He, W. (Chief Investigator (CI)), Ko, R. K. L. (Chief Investigator (CI)), Dong, N. (Chief Investigator (CI)), Kuchta, V. (Chief Investigator (CI)), Komarek, A. M. (Chief Investigator (CI)), Radke, A. (Chief Investigator (CI)), Carvalho, G. (Chief Investigator (CI)), Risius, M. (Chief Investigator (CI)), Dargusch, P. J. (Chief Investigator (CI)), Gramoli, V. (Chief Investigator (CI)), Salampasis, D. (Chief Investigator (CI)), Wang, Z. (Chief Investigator (CI)), Au, M. A. (Chief Investigator (CI)), Luo, X. D. (Chief Investigator (CI)), Ali, S. (Chief Investigator (CI)), Sharma, B. (Chief Investigator (CI)), Boorman, J. (Chief Investigator (CI)), Wainwright, T. (Chief Investigator (CI)), Esgin, M. (Chief Investigator (CI)), Cui, S. (Chief Investigator (CI)) & Cui, H. (Chief Investigator (CI))1/08/22 → 1/06/23Project: Research Developing cybercrime roadmap: Challenges facing the Federated States of MicronesiaChang, L. (Primary Chief Investigator (PCI)), Clough, J. (Chief Investigator (CI)), Rudolph, C. (Chief Investigator (CI)) & Boorman, J. (Chief Investigator (CI))Oceania Cyber Security Centre Limited1/07/21 → 31/01/22Project: Research Research output Research output per year 1999 2004 2022 2025 7 Article 4 Commissioned Report 4 Other Report 4 Review Article 2 More 1 Chapter (Book) 1 Other contribution Research output per year Research output per year Pacific IslandsCarsten, R., Boorman, J. & Jack, J., 2025, The Palgrave Handbook on Cyber Diplomacy . Christou, G., Vosse, W., Burton, J. & A. Koops, J. (eds.). Cham Switzerland: Palgrave Macmillan, p. 653–672 20 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Research › peer-review The Partners in the Blue Pacific P4C Outcomes ReportBoorman, J. & Fulwood, J., Feb 2024, Nadi Fiji: Ocean Cyber Security Centre (OCSC). 22 p.Research output: Book/Report › Commissioned Report › Other Open AccessFile Cybersecurity and sustainable development: An Intersectional AnalysisFulwood, J., Morrison, J., Boorman, J. & Carsten, R., 2022, Australia: Ocean Cyber Security Centre (OCSC). 21 p.Research output: Book/Report › Commissioned Report › Research Open AccessFile Cybersecurity Roadmap: Federated States of Micronesia Chang, L., Boorman, J. & Clough, J., 2022, Federated States of Micronesia Government. 24 p.Research output: Book/Report › Commissioned Report › Other Evaluating Technical Approaches Toward A National Digital LedgerRudolph, C., Yu, J., Boorman, J. & Han, R., 17 Feb 2022, Clayton VIC AUS: Monash University. 30 p.Research output: Book/Report › Commissioned Report › Other View all 21 research outputs Press/Media A more cyber-resilient PacificBoorman, J. & Fulwood, J.7/03/241 Media contributionPress/Media: Blogs, Podcasts and Social Media › Blogs Cybersecurity in the Pacific: how island nations are building their online defences.Rudolph, C., Boorman, J. & Whitty, M.15/06/221 Media contributionPress/Media: Blogs, Podcasts and Social Media › Blogs Global Cyber Expertise MagazineBoorman, J.9/06/211 Media contributionPress/Media: Article/Feature",
  "content_length": 8762,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:52"
}