{
  "name": "James R. Warren",
  "homepage": "https://www.cs.auckland.ac.nz/~jim",
  "status": "success",
  "content": "Jim Warren's Homepage Jim Warren, Professor of Health Informatics I am based at the University of Auckland's School of Computer Science on the City (main) campus in downtown Auckland, New Zealand. My key professional interest is the transformation of healthcare through innovative IT. This includes decision support for healthcare providers, analysis of aggregate health systems data to guide population health strategy and research, and supporting health consumers to do their best in 'co-production' of health outcomes. From a technology perspective, enabling these transformations is largely about applied AI, but very much linked with a holistic information systems perspective and great user interface design; plus there are some topics that are particularly relevant to health IT in practice, such as systems interoperability. I'm passionate about getting talented computing people really interested in the challenges and opportunities of health IT; I also really enjoy working with clinical people to understand and try to improve health delivery challenges. My recent past work has included a lot on youth mental health such as apps based on Cognitive Behavioural Therapy (CBT) and positive psychology, including gamified approaches and dialog agents that function as a type of AI wellness guide. In ongoing project work I've been looking at how LLMs can support aged care, especially for providing health summaries and identifying care priorities for clinical and non-clinical audiences. I'm also interested in 'digital phenotyping' such as how activity data from your phone can help to model the interaction of lifestyle and mood. Note that I am part-time with the University. My usual work days are Mondays, Tuesdays and Thursdays. Current projects and supervision I'm affiliated with the NAO Institute (Natural, Artificial, and Organisation Intelligence) and the Centre of Machine Learning for Social Good. I also collaborate with researchers at the Centre for Co-created Ageing Research (CCREATE-AGE) and have been involved in a major UK-based programme of research, Digital Youth Current research: LLMs for aged care summarisation. Over time, older people often accumulate a range of health conditions - minor and major - leading to the health record become increasingly long and complex. LLMs have potential to summarise longer-form and diverse health assessments for particular audiences (e.g., family / whānau or clinical) and to highlight specific information such as immediate care needs. I'm working with a team that is examining GPT for summarisation of InterRAI aged care assessments. InterRAI is a multi-faceted aged care assessment required for all individuals in residential aged care in New Zealand, and for receipt of home care services. We're working on methods to make the summaries appropriate and complete, yet succinct, and in measuring and controling bias. Ambient monitoring / digital phenotyping. Algorithms can estimate many things about our mood without directly asking how we're feeling. Such data can come from wearable devices (such as a smartwatch) or through subtler signals such as location, motion and communication patterns assessable via our mobile phones. I supervise a PhD student who's investigating ways that these patterns (our 'digital phenotype') can be used to suggest to people that they may benefit from a mental health enhancing activity (which could be as simple as taking a walk) while also enhancing user trust in the system. I also collaborate with NIHI on ambient monitoring of stress/anxiety to find the right timing to recommend a young person employs previously-learned stress management skills (e.g. deep breathing or mindfulness) based on wearable device signals such as heart rate variability. Explainable AI. It's likely that deep learning methods can produce superior predictive models in medicine as compared to simpler linear models. However, it's difficult to trust a black box, and indeed there are many ethical, professional and legal barriers to following an AI recommendation without an accompanying explanation. I supervise a PhD thesis examining the nature of 'explainability' for AI models, and looking at practical techniques to build high-performing predictive models with better explainability than typical dense neural networks. Digital tools for youth mental health. There's tremendous potential, and growing evidence, for the effectiveness of apps to enhance the mental resillience of young people and provide them with effective techniques to reduce the impacts of mild-to-moderate depression and anxiety. Such tools can take the form of chatbots/conversational agents, or can be more of a gamified experience. I am part of a large programme of work on the opportunities (and challenges) of the digital world to youth mental health, led by the University of Nottingham. We're particularly focused on how an AI agent can best engage a young person to take up, and persist in, using apps and online resources to improve their mental health. Research questions include the nature of the 'bond' formed with a digital agent and the most effective conversational strategies, e.g. in terms of how much empathy an AI should express. Coursework and Service I'm currently programme advisor for the BSc(Hons) and PGDip for the School of Computer Science, as well as coordinator of honours dissertations and postgraduate diploma (and third-year) research projects. If you currently enrolled in, or thinking to enroll in a Computer Science major in the Bachelor of Science (Honours) or Postgraduate Diploma in Science, or taking COMPSCI 789a/b, COMPSCI 691a/b, COMPSCI 380 or COMPSCI 780, then I'm a good person to talk to. Some useful links: Honours dissertation: COMPSCI 789a and b CS Postgraduate Courses Undergraduate Project in Computer Science: COMPSCI 380 Note that Dr Marc Vinyals is deputy programme director and coordinator for honours, PGDip and dissertation/project matters. He's the right person to contact at times when I'm away. In 2026 I'm teaching into the following courses: COMPSCI 765 Modelling Minds. How can researchers of artificial intelligence effectively model subjective aspects of minds, such as emotional states, desires, perceptual experience and intrinsic goals? In this course, we examine key research - new work, and older work that has proven seminal. We also seek to develop the skills to create our own such systems. I'm teaching about a third of this course in 2026 - Dr Matthew Egbert is course coordinator and teaches the rest. I mainly speak to the Cognitivist perspective: explicitly modeling concepts as symbols and identifying a sequences of operations to reach a goal, as well as how similar (sometimes better) capabilities are now being achieved with LLMs. Matthew provides counterpoint with situated reasoning, embodied and dynamical systems perspectives. Human-Computer Interaction (COMPSCI 345, SOFTENG 350, COMPSCI 704). For many years I was the primary or supporting lecturer for our HCI courses. However, since going to part-time and with other demands I'm not always directly involved in the teaching delivery. For 2026, I'll be teaching a 3-week segment including a module on visual design. Dr Yun Suen Pai is course coordinator. I'm passionate about helping students with IT capability to pick up the skills to make software that is really excellent from the perspective of usability and is thoughtful, and (where appropriate) innovative, in its design. Our HCI courses teach the skills to design and evaluate the visual interface and user experience generally. If you like this HCI course you might go on to take COMPSCI 705/SOFTENG 702 Advanced Human-Computer Interaction. Health Informatics / Digital Health at The University of Auckland. For several years I was programme director for the Postgraduate Diploma in Health Sciences in Health Informatics. The term 'Digital Health' is now more popular - see Postgraduate Study options in Digital Health. I assess some of the Digital Health papers, and you might come across a presentation by me in DIGIHLTH 701: Principles of Digital Health talking about the role of AI. Past students These are some of the PhD students who have completed their studies with me since I've moved to Auckland Dr Mehnaz Adnan Dr Guocai (Jose) Chen Associate Professor Yulong (Helen) Gu William Hsu Associate Professor Feiyu (Albert) Hu Dr Dallas Knight (Otago, associate supervisor) Dr Janet Liang (co-supervisor) Dr Thusitha Mabotuwana Dr Shyamala Nadathur (Monash) Associate Professor Chris Paton (Oxford, associate supervisor) Dr Song Shen Dr Priyesh Tiwari Dr Alex Zivaljevic Some of my more distant past PhD students (from when I worked at University of South Australia): Dr Sistine Barretto-Daniels Dr Eric Browne Dr Jean-Pierre Calabretto Dr Alex Davidovic Dr Svetla Gadzhanova Dr Chunlan Ma Dr Thomas McNeill Dr Sugath Mudali Professional organisations Health Informatics New Zealand (HINZ). I was Chair of HINZ for 2008-2010. I was Scientific Program Committee Chair for the HINZ Conference and Exhibition 2006, 2007 and 2008. The conference is an amazingly large event given the size of New Zealand – it's the place to find out what's happening in health IT in New Zealand and gets some great keynote speakers from abroad. See the HINZ conference page (now called Digital Health Week). Australasian Institute of Digital Health (AIDH). AIDH has recently formed by a merger of the Australasian College of Health Informatics (ACHI) and Health Informatics Society of Australia (HISA). ACHI was (and AIDH now is) Australia and New Zealand's peak professional body for health informatics. I'm a Foundation Fellow of ACHI, and was its Membership Chair from 2005-2010, as well as a member of the ACHI Council 2015-2016. Now I'm a Fellow of the AIDH. My Career I took up the Chair in Health Informatics at the University of Auckland in November 2005. I made the move here because the environment provides the opportunity to really make a dif",
  "content_length": 12328,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:19"
}