{
  "name": "James M. Rehg",
  "homepage": "http://rehg.org",
  "status": "success",
  "content": "Jim RehgSearchJames M. RehgFounder ProfessorUniversity of Illinois Urbana-ChampaignBiographyJames M. Rehg (pronounced “ray”) is a Founder Professor of Computer Science and Industrial and Enterprise Systems Engineering at University of Illinois Urbana-Champaign. Previously, he was a Professor in the School of Interactive Computing at the Georgia Institute of Technology, where he co-Directed the Center for Health Analytics and Informatics (CHAI). He received his Ph.D. from CMU in 1995 and worked at the Cambridge Research Lab of DEC (and then Compaq) from 1995-2001, where he managed the computer vision research group. He received an NSF CAREER award in 2001 and a Raytheon Faculty Fellowship from Georgia Tech in 2005. He and his students have received a number of best paper awards, including best student paper awards at ICML 2005, BMVC 2010, Mobihealth 2014, Face and Gesture 2015, and a Distinguished Paper Award from ACM IMWUT and a Method of the Year award from the journal Nature Methods. Dr. Rehg served as the General co-Chair for CVPR 2009 and the Program co-Chair for CVPR 2017. He has authored more than 200 peer-reviewed scientific papers and holds 26 issued US patents.Introduction to the Rehg LabWe conduct foundational research in computer vision and machine learning, with broad applications in human-centered and interdisciplinary domains. Our work spans developmental and social psychology, autism research, mobile health, and robotics. A central theme of our work is understanding human social and cognitive behavior. We develop novel sensing technologies and computational models that capture behavior in real-world contexts and connect health-related behaviors to clinical outcomes, enabling new forms of assessment and treatment. In addition, we explore machine learning paradigms inspired by child development, and biologically-inspired methods for robot perception, navigation, and control. Our recent work has expanded to multimodal foundation models, social AI, and large-scale video datasets such as Ego4D, reflecting a broader vision at the intersection of human behavior, health, and intelligent systems.Prospective Students: We welcome Masters and undergraduate students, as well as (remote) global interns. If you are interested in joining our group and are a current/incoming UIUC student, please fill out this form. If you are not currently at UIUC, please apply directly to the university.PeoplePrincipal InvestigatorJames M. RehgFounder ProfessorLab MembersJunho KimPostdocHarish HaresamudramPostdocFiona RyanPhD StudentMax XuPhD StudentBolin LaiPhD StudentXiang LiPhD StudentOzgur KaraPhD StudentWenqi JiaPhD StudentXu CaoPh.D. StudentAna JojicPhD StudentWanting MaoPhD StudentBikram BootePh.D. StudentNan HuangPhD StudentVipin GundaPhD StudentAditya RadhakrishnanPhD StudentBrian ZhaoPh.D. StudentZirui WangMaster StudentPranav VirupakshaMaster StudentVedant MahajanMaster StudentTarik OzdenMaster StudentSachidanand VSMaster StudentYifan XuMaster StudentAlumni Stefan StojanovStanford Post DocSupriya NageshAmazonMeera HahnGoogleMiao LiuMetaAlexander MorenoSTRSangmin LeeKorea Univ.Zixuan HuangMetaAnh ThaiDolbyVarol Burak AydemirBodyportNews9/23/25: Four papers accepted at NeurIPS 202501/01/23: Jim is now Founder Professor of Computer Science and Industrial and Enterprise Systems Engineering at the Univ. of Illinois at Urbana-Champaign, and is the new director of the Health Care Engineering Systems Center at UIUC.4/05/22: Congrats to my Ph.D. students Fiona Ryan and Max Xu for both winning NSF Graduate Fellowships!8/29/20: Keynote talk at 8th Intl. Workshop on Assistive Computer Vision and Robotics (ACVR) @ ECCV 20208/05/20: Two papers accepted at BMVC 20207/20/20: NIH Funded $5.9M mDOT Center to Advance Mobile Health Research7/02/20: One paper accepted at ECCV 2020 for oral presentation2/26/20: Two papers accepted to CVPR 20202/23/20: Jim attended the Workshop on the Use of Wearable and Implantable Devices in Health Research @ BIRS (Banff, Canada)9/04/19: One paper accepted at NeurIPS 2019See all ProjectsAutoRallyAutonomous drivingDevelopmental Machine LearningDevelopmental Machine LearningMobile and Computational HealthMobile and Computational HealthPublicationsDiffEye: Diffusion-Based Continuous Eye-Tracking Data Generation Conditioned on Natural ImagesNeurIPS 2025Ozgur Kara, Harris Nisar, James Matthew RehgPDF ProjectFine-Grained Preference Optimization Improves Spatial Reasoning in VLMsNeurIPS 2025Yifan Shen, Yuanzhe Liu, Jingyuan Zhu, Xu Cao, Xiaofeng Zhang, Yixiao He, Wenming Ye, James Matthew Rehg, Ismini LourentzouPDF ProjectToward Human Deictic Gesture Target EstimationNeurIPS 2025Xu Cao, Pranav Virupaksha, Sangmin Lee, Bolin Lai, Wenqi Jia, Jintai Chen, James Matthew RehgPDF ProjectCue3D: Quantifying the Role of Image Cues in Single-Image 3D GenerationNeurIPS 2025 (Spotlight, Acceptance rate 3.2%)Xiang Li, Zirui Wang, Zixuan Huang, James Matthew RehgPDF ProjectUnleashing In-context Learning of Autoregressive Models for Few-shot Image ManipulationCVPR 2025 (Highlight, Acceptance rate 3.0%)Bolin Lai, Felix Juefei-Xu, Miao Liu, Xiaoliang Dai, Nikhil Mehta, Chenguang Zhu, Zeyi Huang, James M Rehg, Sangmin Lee, Ning Zhang, Tong XiaoPDF ProjectGaze-LLE: Gaze Target Estimation via Large-scale Learned EncodersCVPR 2025 (Highlight, Acceptance rate 3.0%)Fiona Ryan, Ajay Bati, Sangmin Lee, Daniel Bolya, Judy Hoffman, James M RehgPDF ProjectImproving Personalized Search with Regularized Low-Rank Parameter UpdatesCVPR 2025 (Highlight, Acceptance rate 3.0%)Fiona Ryan, Josef Sivic, Fabian Caba Heilbron, Judy Hoffman, James M Rehg, Bryan RussellPDF ProjectShotAdapter: Text-to-Multi-Shot Video Generation with Diffusion ModelsCVPR 2025Ozgur Kara, Krishna Kumar Singh, Feng Liu, Duygu Ceylan, James M Rehg, Tobias HinzPDF ProjectSocialGesture: Delving into Multi-person Gesture UnderstandingCVPR 2025Xu Cao, Pranav Virupaksha, Wenqi Jia, Bolin Lai, Fiona Ryan, Sangmin Lee, James M RehgPDF ProjectSymmetry Strikes Back: From Single-Image Symmetry Detection to 3D GenerationCVPR 2025 (Highlight, Acceptance rate 3.0%)Xiang Li, Zixuan Huang, Anh Thai, James M RehgPDF ProjectSPAR3D: Stable Point-Aware Reconstruction of 3D Objects from Single ImagesCVPR 2025Zixuan Huang, Mark Boss, Aaryaman Vasishta, James M Rehg, Varun JampaniPDF ProjectRelCon: Relative Contrastive Learning for a Motion Foundation Model for Wearable DataICLR 2025Maxwell A Xu, Jaya Narain, Gregory Darnell, Haraldur Hallgrimsson, Hyewon Jeong, Darren Forde, Richard Fineman, Karthik J Raghuram, James M Rehg, Shirley RenPDF ProjectLeveraging Object Priors for Point TrackingECCV 2024 ILR WorkshopBikram Boote, Anh Thai, Wenqi Jia, Ozgur Kara, Stefan Stojanov, James M Rehg, Sangmin LeePDF3x2: 3D Object Part Segmentation by 2D Semantic CorrespondencesECCV 2024Anh Thai, Weiyao Wang, Hao Tang, Stefan Stojanov, James M. Rehg, Matt FeiszliPDF ProjectLEGO: Learning EGOcentric Action Frame Generation via Visual Instruction TuningECCV 2024 (Oral, Acceptance rate 2.3%, 🏆 Best Paper Finalist)Bolin Lai, Xiaoliang Dai, Lawrence Chen, Guan Pang, James M. Rehg, Miao LiuPDF ProjectSee all DatasetsGeorgia Tech Egocentric Activity DatasetsSummary Text for GTEA datasetYin Li, Alireza Fathi, Zhefan Ye, Miao Liu, James M RehgDatasetToys4K 3D Object DatasetCVPR 20214,000 3D object instances from 105 categories of developmentally plausible objectsStefan Stojanov, Anh Thai, James M RehgDatasetTeachingCS 598 CVH: Computer Vision for HealthCS 3600: Introduction to Artificial IntelligenceCS 7626: Behavioral ImagingSponsorsNIH R01 DC020048: Discovering novel predictors of minimally verbal outcomes in autism through computational modelingDARPA RACER Program: Robotic Autonomy in Complex Environments with ResiliencyNIH R01 HD104624: Infants’ self-generated visual statistics support object and category learningNIH NIBIB P41-EB028242: mHealth Center for Discovery, Optimization, and Translation of Temporally-Precise Interventions (mDOT)NSF C-Accel 2033413: Inclusion AI for Neurodiverse EmploymentNSF CNS 1823201: CRI: mResearch: A platform for Reproducible and Extensible Mobile Sensor Big Data ResearchContactjrehg [at] illinois.eduHealth Care Engineering Systems Center, 1206 W Clark St, Urbana, IL 61801Cite ×Copy Download",
  "content_length": 8274,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:10"
}