{
  "name": "James R. Foulds",
  "homepage": "https://jfoulds.informationsystems.umbc.edu",
  "status": "success",
  "content": "Homepage of James Foulds CV Teaching Group Publications About James Foulds Associate Professor Department of Information Systems University of Maryland, Baltimore County Email: jfoulds at umbc dot edu Office: ITE 447 News I haven't updated this in quite a while, but the highlights are: I got tenure! I am now an associate professor! I am writing the new edition of the Witten et al. Data Mining textbook! I got the NSF CAREER award! The IEEE Data Engineering Bulletin (DEB) Special Issue on Interdisciplinary Perspectives on Fairness and Artificial Intelligence Systems, co-edited by myself and Shimei Pan, is online! Our SDM 2021 tutorial, Mining Dynamic Networks with Generative Models, with Kevin Xu, was accepted! Our WWW 2021 paper, \"Debiasing Career Recommendations with Neural Fair Collaborative Filtering,\" was accepted. Congratulations Rashidul Islam, Kamrun Keya, et al.! Congratulations to Kamrun Keya and Rashidul Islam, et al., for their accepted SDM 2021 paper, \"Equitable Allocation of Healthcare Resources with Fair Survival Models\"! Congrats to Kamrun Keya and Rashidul Islam, et al., for their accepted AAAI Fall Symposium paper, \"Equitable Allocation of Healthcare Resources with Fair Cox Models\"! Ketki Deshpande's talk video at the FairUMAP workshop, on our paper \"Mitigating Demographic Bias in AI-based Resume Filtering,\" is now online! Our ICWSM 2021 paper, Fair Heterogeneous Network Embeddings, was accepted. Congratulations Ziqian Zheng, and my students Rashidul Islam and Kamrun Keya! Our paper on privacy-preserving variational Bayesian inference at JAIR is now online! The presentation for our ICDE paper, An Intersectional Definition of Fairness, is online due to COVID-19 crisis. Here is the link to the Talk Video and the Slides. Congratulations to my undergraduate student, Jordan Troutman, for winning a prestigious Goldwater scholarship!! Recent talks: IJCAI talk and poster, Variational Bayes in Private Settings (VIPS), January 15, 2021, Yokohama, JP (online). [5 minute talk video] [15 minute poster talk][Poster] Leidos Innovations Center (LInC) AI/ML reading group meeting, on October 16, 2020, Leidos, Arlington, VA (online talk). ICDE, An Intersectional Definition of Fairness, April 2020, online due to COVID-19 crisis. Here is the link to the Talk Video and the Slides. SDM 2020 talk, Bayesian Modeling of Intersectional Fairness: The Variance of Bias, May 8 2020, Cincinnati, OH (talk cancelled due to COVID-19 crisis) About Me I am an associate professor in the Department of Information Systems at UMBC. Previously, I was a postdoctoral scholar at the University of California, San Diego under the Data Science Postdoctoral Fellowship program, co-sponsored by ITA, Calit2, the Qualcomm Institute, CSE and ECE. Before that, I was a postdoctoral scholar in Lise Getoor's LINQS research group at UCSC, and I graduated from Padhraic Smyth's DataLab group at UCI. I go by Jimmy personally, and James professionally. For more information, see my: Publications, including links to code and slides, Courses, CV (or email for a more up to date version), PhD thesis, which has a lot of tutorial-style introductory material on probabilistic latent variable modeling that you may find useful, Github page, Photo credit: Marlayna Demond '11 for UMBC Research Interests My research interests are broadly in the area of socially conscious machine learning and artificial intelligence. My work aims to improve AI’s role in society regarding fairness and privacy, and to promote the practice of computational social science, using probabilistic models and Bayesian inference. Below is an overview of my research, as of 2018. Teaching IS 698/800 Special Topics in IS: Artificial Intelligence (Spring 2025, UMBC) [Course webpage] IS 698/800 Special Topics in IS: Ethical and Responsible AI (Fall 2024, UMBC, co-taught with Dr. Pan) IS 603 Decision Making Support Systems (Fall 2024, UMBC, co-taught with Dr. Pan) IS 698/800 Special Topics in IS: Artificial Intelligence (Spring 2024, UMBC) IS 698/800 Special Topics in IS: Ethical and Responsible AI (Fall 2023, UMBC, co-taught with Dr. Pan) IS 603 Decision Making Support Systems (Fall 2023, UMBC, co-taught with Dr. Pan) IS 757 Deep Learning (Spring 2023, UMBC) [Course webpage] IS 427 Introduction to Artificial Intelligence: Concepts and Applications (Spring 2022, UMBC) IS 698/800 Special Topics in IS: Probabilistic Machine Learning (Fall 2021, UMBC) IS 603 Decision Making Support Systems (Fall 2021, UMBC) IS 603 Decision Making Support Systems (Spring 2021, UMBC) IS 733 Data Mining (Fall 2020, UMBC) IS 428 Data Mining Techniques and Applications IS 733 Data Mining (Spring 2020, UMBC) IS 428 Data Mining Techniques and Applications (Fall 2019, UMBC) IS 733 Data Mining (Fall 2019, UMBC) IS 733 Data Mining (Spring 2019, UMBC) IS 698/800 Special Topics in IS: Probabilistic Machine Learning (Fall 2018, UMBC) [Syllabus] IS 733 Data Mining (Spring 2018, UMBC) IS 733 Data Mining (Fall 2017, UMBC) [Student evaluations] CSE291D Latent Variable Models (Spring 2017, UCSD) [Course webpage] [Student evaluations] CSE291D Latent Variable Models (Spring 2016, UCSD) [Course webpage] [Student evaluations] Tutorial Slides Generative Models for Social Media Analytics: Networks, Text, and Time. ICWSM 2018 tutorial, with Kevin Xu [Slides] [Github page] Generative Models for Social Network Data. SBP-BRiMS 2016 tutorial, with Kevin Xu [Slides] Software See publications for links to software associated with my papers. At the behest of the University of Waikato Department of Mathematics, I created Tuatara Turing Machine Simulator , a graphical Turing machine simulator and construction tool for teaching purposes. I also worked on the GUI for the Boundary Visualizer, a classification visualization tool in WEKA , a popular java open source data mining toolkit developed at the University of Waikato. Other Interests I was a member of the Japanese taiko drumming groups Watsonville Taiko and Waitaiko , and the Korean drumming group Hansori at UC Irvine. I played guitar in the rock group 4 Second Fuse. In 2007-2008, I was part of the problem reviewing/writing team for the ACM South Pacific Programming Contest. For a number of years, I was involved with the executive committee of the Waikato ACM Student Chapter . Trivia My Erdös number is two (James R. Foulds - Leslie R. Foulds - Paul Erdös). Olds Three extended abstracts were accepted for presentation at the 8th Mid-Atlantic Student Colloquium on Speech, Language and Learning (MASC-SLL 2020). Nice work to my students, Ketki Deshpande, Mahbub Rahman, Kamrun Keya, and Rashidul Islam! Two of our group's papers on fairness in machine learning were accepted, at ICDE and SDM, respectively! ArXiv preprints available here and here. Code for calculating our differential fairness metric is now available in the AI Fairness 360 toolkit from IBM Research! [Github page] My SDM 2020 tutorial with Kevin Xu, Mining Dynamic Networks with Generative Models, was accepted! Our paper about modeling microbe-metabolite interactions using neural networks was just published in Nature Methods! Our submission to the NeurIPS 2019 Workshop on Machine Learning with Guarantees was accepted! Our NSF EAGER grant proposal, AI-DCL: Fairness for the Allocation of Healthcare Resources, was accepted! My group's submission to the KDD Social Impact Track, on mitigating bias in social-media based recommender systems, was accepted for oral presentation! Congrats to my students Rashidul Islam and Kamrun Keya! [Extended Abstract] I am a co-organizer for the Workshop on Including Ethics in Data Science Pedagogy, sponsored by NSF! Our paper on Bayesian modeling of buildings' thermal dynamics was accepted at ACM e-Energy! Big news: my NSF CISE Research Initiation Initiative (CRII) proposal has been awarded!! Our paper, on a method to scale up topic models to 10,000 topics with a single machine, was accepted at NAACL 2019! Congrats to my student, Rashidul Islam! Our pre-print on Bayesian modeling of buildings' thermal dynamics is on the Arxiv. New arXiv preprint on fairness in machine learning, with Shimei Pan! Kevin Xu and I presented a tutorial on generative models for social media analytics, at ICWSM 2018, Stanford, June 25, 2018. Check out the slides, and the Github page, with python code for demos! I gave a talk, with Shimei Pan, at NIST's Information Technology Laboratory, on June 4, 2018, about fairness in machine learning and artificial intelligence systems. Three extended abstracts by my students accepted at the Mid-Atlantic Student Colloquium on Speech, Language and Learning (MASC-SLL 2018). Congrats Taif Ghiwaa, Rashidul Islam, and Kamrun Keya (who got a talk slot)! Java code for the mixed membership word embeddings training algorithms uploaded to GitHub. Check it out! Fast code for SCVB0 in the Julia language uploaded to GitHub (finally!) A new paper accepted at AISTATS 2018: Mixed Membership Word Embeddings for Computational Social Science! See the arXiv preprint. ICWSM 2018 tutorial accepted, Generative Models for Social Media Analytics: Networks, Text, and Time, with Kevin Xu! To be presented at Stanford on June 25. I am teaching IS-733 Data Mining in Fall 2017, and again in Spring 2018. I have accepted a tenure-track position at the University of Maryland, Baltimore County (UMBC), Information Systems Department, beginning Fall 2017! Our paper, Dense Distributions from Sparse Samples: Improved Gibbs Sampling Parameter Estimators for LDA, was accepted at JMLR! See the ArXiv preprint. New preprint uploaded to the arXiv: Mixed Membership Word Embeddings for Computational Social Science. I am teaching CSE291D Latent Variable Models again in Spring 2017. See last year's course webpage. Our paper on differentially private EM was accepted at AISTATS! I gave a talk at the UCSD AI seminar (Winter 2017). I am a co-chair for the 2017 Information Theory and Applications Workshop. Winner of the SoCal Machine Learning Symposium 2016 run",
  "content_length": 13414,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:19"
}