{
  "name": "James Thorne",
  "homepage": "https://jamesthorne.com",
  "status": "success",
  "content": "James Thorne I'm CTO at Theia Insights we build industry classification and factor models and serve as the foundational intelligence layer for capital markets. Contact InfoGitHub @j6mesTwitter @j6mesEmail contacts james [at] jamesthorne.com This post is a summary of the \"Next Big Ideas\" session at ACL: established members of the NLP community formed a panel presenting their view of the future of the field. The session featured a series of talks and a panel from Heng Ji, This year's ACL 2022 best paper was on the topic of incremental parsing. Parsing is something that's been well studied in the NLP, Computational Linguistics fields  before. So why does this year's best paper laud a work on a topic that some might have As any student or academic would tell you, keeping track of references is essential. That's why tools such as Mendeley [https://mendeley.com/] and Zotero [https://www.zotero.org/] are OU12 HPC RDP moduleHPC best practices for deep learning How not to waste time, money, or resources James ThorneGoogle Docs [https://docs.google.com/presentation/d/1kbLp5wVr5CCcGSoOl6pmQXdtABYVwKKtX3ZvVo4JHYs/edit#slide=id. I've recently travelled to Korea. While most of Europe has allowed quarantine-free travel, most visitors to Korea must undergo mandatory quarantine. And, without a long term visa or residency status, After completing my thesis, I needed to add binding offsets for printing. When I wrote my thesis, it was examined electronically and submitted as a PDF file. When you are Docker is a great resource for virtualizing environments. It makes deploying code and work to any environment super simple. In research, it also helps make projects repeatable and shareable through Overleaf has become an essential tool for my academic work, allowing collaboration with my team and giving the ability for me to work on manuscripts on any computer without the need for extra tools. While the tooling has a large feature set and is Enterprise Architecture was introduced to address system complexity and poor business alignment. Typically: * IT systems have become unmanageably complex or too costly to maintain * IT systems are hindering an organisations ability to respond to market conditions in a timely and cost-effective manner * Mission-critical information Wikipedia is a valuable resource to build Natural Language Processing systems for tasks such as Question Answering [https://github.com/facebookresearch/DrQA] and Fact Verification [http://fever.ai]. However, the sheer size of the resource can become an obstacle for new starters or those As part of my setup for Ghost, I wanted to have a custom editable home page as well as a listing of recent blog posts. While getting this set running was quite simple to do, there weren't many tutorials around explaining how to do How (and why) I went about switching from WordPress to Ghost You've successfully subscribed to James Thorne! Subscribe to James Thorne Stay up to date! Get all the latest & greatest posts delivered straight to your inbox Subscribe Great! Check your inbox and click the link to confirm your subscription. Please enter a valid email address!",
  "content_length": 3142,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:22"
}