{
  "name": "James A. R. Marshall",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/james-marshall",
  "status": "success",
  "content": "Professor James Marshall | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor James Marshall School of Computer Science Professor of Theoretical and Computational Biology Director of the Centre for Machine Intelligence Member of the Complex Systems Modelling research group Open staff member portrait in a modal window james.marshall@sheffield.ac.uk +44 114 222 1832 Sir Frederick Mappin Building Full contact details Professor James Marshall School of Computer Science Sir Frederick Mappin Building Mappin Street Sheffield S1 3JD Orcid ID:https://orcid.org/0000-0002-1506-167X Google Scholar Personal website (BET Lab) Profile I am an interdisciplinary researcher interested in behaviour, its mechanistic bases, and its evolution. With various colleagues I apply a variety of mathematical and computational approaches to understanding how and why behaviours evolve.I am also interested in what engineering disciplines may learn from this study. Particular research interests include collective social insect behaviour, the evolution of social behaviour, and the application of decision theory to animal behaviour. Some of my research makes use of robotics to test these ideas. Research interests My research interests cover modelling of collective behaviour, particularly in social insects, evolutionary theory, decision theory, robotics, and theoretical neuroscience Publications Books Marshall JAR (2015) Social Evolution and Inclusive Fitness Theory: An Introduction. Princeton University Press. Journal articles MaBouDi H, Roper M, Guiraud M-G, Juusola M, Chittka L & Marshall JAR (2025) A neuromorphic model of active vision shows how spatiotemporal encoding in lobula neurons can aid pattern recognition in bees. eLife, 14. View this article in WRRO Marshall JAR & Barron AB (2025) Are transformers truly foundational for robotics?. npj Robotics, 3. View this article in WRRO MaBouDi H, Richter J, Guiraud M-G, Roper M, Marshall JAR & Chittka L (2025) Active vision of bees in a simple pattern discrimination task. eLife, 14. View this article in WRRO Marshall JAR & Reina A (2024) On aims and methods of collective animal behaviour. Animal Behaviour, 210, 189-197. MaBouDi H, Marshall JAR, Dearden N & Barron AB (2023) How honey bees make fast and accurate decisions. eLife, 12. View this article in WRRO Reina A, Bose T, Srivastava V & Marshall JAR (2023) Asynchrony rescues statistically optimal group decisions from information cascades through emergent leaders. Royal Society Open Science, 10(3). Zenil H, Marshall JAR & Tegnér J (2023) Approximations of algorithmic and structural complexity validate cognitive-behavioral experimental results. Frontiers in Computational Neuroscience, 16. Marshall JAR, Reina A, Hay C, Dussutour A & Pirrone A (2022) Magnitude-sensitive reaction times reveal non-linear time costs in multi-alternative decision-making. PLoS Computational Biology, 18(10). de Croon GCHE, Dupeyroux JJG, Fuller SB & Marshall JAR (2022) Insect-inspired AI for autonomous robots. Science Robotics, 7(67). Reina A & Marshall JAR (2022) Negative feedback may suppress variation to improve collective foraging performance. PLoS Computational Biology, 18(5). Pirrone A, Reina A, Stafford T, Marshall JAR & Gobet F (2022) Magnitude-sensitivity: rethinking decision-making. Trends in Cognitive Sciences, 26(1), 66-80. View this article in WRRO Saha A, Marshall JAR & Reina A (2021) Memory and communication efficient algorithm for decentralized counting of nodes in networks. PLoS ONE, 16(11). View this article in WRRO Chandrasekhar A, Marshall JAR, Austin C, Navlakha S & Gordon DM (2021) Better tired than lost: turtle ant trail networks favor coherence over short edges. PLoS Computational Biology, 17(10). Talamali MS, Saha A, Marshall JAR & Reina A (2021) When less is more: Robot swarms adapt better to changes with constrained communication. Science Robotics, 6(56). MaBouDi H, Barron AB, Li S, Honkanen M, Loukola OJ, Peng F, Li W, Marshall JAR, Cope A, Vasilaki E & Solvi C (2021) Non-numerical strategies used by bees to solve numerical cognition tasks. Proceedings of the Royal Society B: Biological Sciences, 288(1945). Marshall J (2021) Borrowing bee brains. New Scientist, 249(3322), 23-23. MaBouDi H, Marshall JAR & Barron AB (2020) Honeybees solve a multi-comparison ranking task by probability matching. Proceedings of the Royal Society B: Biological Sciences, 287(1934). View this article in WRRO Talamali MS, Bose T, Haire M, Xu X, Marshall JAR & Reina A (2020) Sophisticated collective foraging with minimalist agents: a swarm robotics test.. Swarm Intelligence, 14, 25-56. Bose T, Bottom F, Reina A & Marshall JAR (2020) Frequency-sensitivity and magnitude-sensitivity in decision-making : predictions of a theoretical model-based study. Computational Brain & Behavior, 3(1), 66-85. View this article in WRRO Bose T, Pirrone A, Reina A & Marshall JAR (2020) Comparison of magnitude-sensitive sequential sampling models in a simulation-based study. Journal of Mathematical Psychology, 94. Marshall JAR, Reina A & Bose T (2019) Multiscale modelling tool : mathematical modelling of collective behaviour without the maths. PLOS ONE, 14(9). Bose T, Reina A & Marshall JAR (2019) Inhibition and excitation shape activity selection: Effect of oscillations in a decision-making circuit. Neural Computation, 31(5), 870-896. View this article in WRRO Marshall JAR, Kurvers RHJM, Krause J & Wolf M (2019) Quorums enable optimal pooling of independent judgements in biological systems. eLife, 8. View this article in WRRO Cope AJ, Vasilaki E, Minors D, Sabo C, Marshall JAR & Barron AB (2018) Abstract concept learning in a simple neural network inspired by the insect brain. PLoS Computational Biology, 14(9). View this article in WRRO Booton RD, Yamaguchi R, Marshall JAR, Childs DZ & Iwasa Y (2018) Interactions between immunotoxicants and parasite stress: Implications for host health. Journal of Theoretical Biology, 445, 120-127. View this article in WRRO Reina A, Bose T, Trianni V & Marshall JAR (2018) Psychophysical Laws and the Superorganism. Scientific Reports, 8. View this article in WRRO Pirrone A, Azab H, Hayden BY, Stafford T & Marshall JAR (2018) Evidence for the speed-value trade-off: human and monkey decision making is magnitude sensitive. Decision, 5(2), 129-142. View this article in WRRO Marshall JAR, Brown G & Radford AN (2017) Individual confidence-weighting and group decision-making. Trends in Ecology and Evolution, 32(9), 636-645. View this article in WRRO Ramírez JC & Marshall JAR (2017) Can natural selection encode Bayesian priors?. J Theor Biol, 426, 57-66. Bose T, Reina A & Marshall JAR (2017) Collective decision-making. Current Opinion in Behavioral Sciences, 16, 30-34. View this article in WRRO Pirrone A, Marshall JAR & Stafford T (2017) A Drift Diffusion Model account of the semantic congruity effect in a classification paradigm.. Journal of Numerical Cognition, 3(1), 77-96. View this article in WRRO Reina A, Marshall JAR, Trianni V & Bose T (2017) Model of the best-of-N nest-site selection process in honeybees. PHYSICAL REVIEW E, 95(5). View this article in WRRO Reina A, Cope A, Nikolaidis E, Marshall J & Sabo C (2017) ARK: Augmented Reality for Kilobots. IEEE Robotics and Automation Letters, 2(3), 1755-1761. View this article in WRRO Booton RD, Iwasa Y, Marshall JAR & Childs DZ (2017) Stress-mediated allee effects can cause the sudden collapse of honey bee colonies.. Journal of Theoretical Biology, 420, 213-219. View this article in WRRO Cope AJ, Sabo C, Vasilaki E, Barron AB & Marshall JA (2017) A computational model of the integration of landmarks and motion in the insect central complex.. PLoS One, 12(2). View this article in WRRO Marshall JAR (2016) What is inclusive fitness theory, and what is it for?. Current Opinion in Behavioral Sciences, 12, 103-108. View this article in WRRO Reid CR, MacDonald H, Mann RP, Marshall JAR, Latty T & Garnier S (2016) Decision-making without a brain: how an amoeboid organism solves the two-armed bandit. Interface, 13(119). View this article in WRRO Cope AJ, Sabo C, Gurney K, Vasilaki E & Marshall JAR (2016) A Model for an Angular Velocity-Tuned Motion Detector Accounting for Deviations in the Corridor-Centering Response of the Bee. PLoS Comput Biol, 12(5). View this article in WRRO Marshall JAR (2016) Errors in Allen's Review of Social Evolution and Inclusive Fitness Theory: An Introduction. BioScience, 66(3), 185-185. Barron AB, Gurney KN, Meah LFS, Vasilaki E & Marshall JAR (2015) Decision-making and action selection in insects: inspiration from vertebrate-based theories. Frontiers in Behavioral Neuroscience, 9. Fawcett TW, Marshall JAR & Higginson AD (2015) The Evolution of Mechanisms Underlying Behaviour. Current Zoology, 61(2), 221-225. View this article in WRRO Ramirez JC & Marshall JAR (2015) Self-deception can evolve under appropriate costs. Current Zoology, 61(2), 382-396. View this article in WRRO Marshall JAR, Favreau-Peigne A, Fromhage L, McNamara JM, Meah LFS & Houston AI (2015) Cross inhibition improves activity selection when switching incurs time costs. Current Zoology, 61(2), 242-250. View this article in WRRO Marshall JAR (2015) Desperately Seeking Meaning. BioScience, 65(3), 328-329. Osinga HM & Marshall JAR (2015) Adaptive Topographies and Equilibrium Selection in an Evolutionary Game. PLOS ONE, 10(2). Birch J & Marshall JAR (2014) Queller’s Separation Condition Explained and Defended. The American Naturalist, 184(4), 531-540. Pirrone A, Stafford T & Marshall JAR (2014) When natural selection should optimize speed-accuracy trade-offs.. Front Neurosci, 8, 73. Cassey TC, Evens DR, Bogacz R, Marshall JAR & Ludwig CJH (2013) Adaptive Sampling of Information in Perceptual Decision-Making. PLOS ONE, 8(11). Pais D, Hogan PM, Schlegel T, Franks NR, Leonard NE & Marshall JAR (2013) A Mechanis",
  "content_length": 25815,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:48"
}