{
  "name": "James Foley 0001",
  "homepage": "http://www.cc.gatech.edu/fac/Jim.Foley/foley.html",
  "status": "success",
  "content": "James Foley Professor, College of Computing Stephen Fleming Chair in Telecommunications Georgia Institute of Technology Atlanta, Georgia 30332-0280 (404) 385-1467 jim.foley@cc.gatech.edu Dr. Foley is Professor in the College of Computing, and Professor in the School of Electrical and Computer Engineering. He earned the Ph.D. in Computer Information and Control Engineering at the University of Michigan and the BSEE at Lehigh University, where he was initiated into Phi Beta Kappa, Tau Beta Pi and Eta Kappa Nu. Dr. Foley first came to Georgia Tech in 1991 to establish the Graphics, Visualization & Usability Center, which in 1996 was ranked #1 by US News and World Report for graduate computer science work in graphics and user interaction. In 1996, he became director of Mitsubishi Electric Research Lab in Cambridge and then in 1998 chairman and CEO of Mitsubishi Electric ITA, directing corporate R&D at four labs in North America. He returned to Georgia as Executive Director and then CEO of Yamacraw, Georgia's economic development initiative in the design of broadband systems, devices and chips. Dr. Foley is a Fellow of ACM and IEEE, an inaugural member of the ACM/CHI Academy, and recipient of the biannual ACM/SIGGRAPH Stephen Coons Award for Outstanding Creative Contributions to Computer Graphics. The graphics textbooks he has co-authored are widely used and have been translated into six foreign languages. In 1992, the Georgia Tech College of Computing graduate students named him, \"most likely to make students want to grow up to be professors.\" In July 2001, Dr. Foley became chairman of the Computing Research Association - an organization of over 200 computer science and computer engineering university departments, professional societies and industrial research labs.",
  "content_length": 1792,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:03"
}