{
  "name": "James Allan",
  "homepage": "https://ciir.cs.umass.edu/~allan",
  "status": "success",
  "content": "James Allan James Allan Manning College of Information and Computer Sciences 140 Governors Drive University of Massachusetts Amherst, MA 01003-9264 Room W370 in CSB (CS Building) +1 413/545-3240 (easy to miss because it's on Teams, so leave a message) +1 413/545-1249 (fax, though email is probably better) allan at cs.umass.edu I am a Distinguished Professor and Associate Dean for Research and Engagement in the Manning College of Information and Computer Sciences at UMass Amherst. I am also the Director of the Center for Intelligent Information Retrieval (CIIR). My current work focuses on these areas: interpretation of large language models used for retrieval, using mechanistic approaches; interactive information retrieval and organization, including browsing and other human-computer interactions; automatic information organization; evaluation of information retrieval systems; exploring how novelty can be incorporated into retrieval algorithms; understanding the controversial nature of search results and methods for recognizing controversial topics on the Web I also hold a part-time joint appointment as a GI-CoRE Affiliated Professor with the Faculty of Information Science and Technology, Hokkaido University, Japan. In Fall 2025 I am teaching COMPSCI 446, an undergraduate course in search engines. You can read a short summary of course information (other information is on Canvas now that the course was active). I serve on the organizing and program committees for major conferences in the area (SIGIR, CIKM, WSDM, etc), have been an associate editor of ACM's Transactions on Information Systems (TOIS) journal and Elsevier's Information Processing and Management (IPM) journal, the editorial board of Foundation and Trends in Information Retrieval, and have served as chair of the SIGIR organization. With my students, we received Best Paper awards in SIGIR in 2001 and in 2006 as well as a Best Student Paper from CHIIR in 2017. Those were joined by a best application paper from ECIR 2019 and a best workshop paper for NAACL/TrustNLP 2021. We also received a SIGIR Test of Time Award for a 1998 paper on event detection and tracking and an ECIR Test of Time Award for a 2009 paper on the use of topic models in IR. In 2021 I was elected to the SIGIR Academy and was elevated to Fellow of the ACM. In 2018, 2021, and 2024, I was elected to the CRA Board of Directors for consecutive three-year terms; I served as CRA's Treasurer from 2019-2025 and subsequently as Chair of the Board until July 2027. I received an M.S. degree and a Ph.D. degree in Computer Science from Cornell University in 1991 and 1995, respectively, and an A.B. in Mathematics from Grinnell College in 1983. A list of my papers is available here. (This list is generated by the CIIR publications database.) Last modified: October 22, 2025",
  "content_length": 2833,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:48"
}