{
  "name": "James Clause",
  "homepage": "https://www.eecis.udel.edu/~clause",
  "status": "success",
  "content": "James Clause @ University of Delaware About I'm an associate professor in the Computer and Information Sciences Department at the University of Delaware. My general research area is software engineering. More specifically, I focus on helping developers find and fix bugs. Currently, I'm working on projects to: help software developers write energy-efficient applications help software testers write high-quality, durable tests improve software quality by safely using potentially sensitive information gathered from users More detailed information about my academic life is available in my curriculum vitae. Contact Office: 438 Smith Hall Phone: 302-831-0084 Email: clause@udel.edu Recent News June 28, 2017 — ISSTA 2017 Impact Paper Award Our paper Dytan: A generic dynamic taint analysis framework has been selected to receive the ISSTA 2017 Impact Paper Award. This award recognizes research papers that were published at ISSTA a decade ago, and had a significant impact on research and/or practice of software testing and analysis. December 2, 2016 — CREST Open Workshop Presentation I will be presenting our work on optimizing the energy usage of software at the 50th CREST Open Workshop - Genetic Improvement. October 13, 2016 — ICSME Distinguished Reviewer Award Iâm the recipient of a Distinguished Reviewer Award for âexceptionally detailed and constructive feedback to the ICSME communityâ from the 32nd International Conference on Software Maintenance and Evolution (ICSME 2016). September 13, 2016 — The News Journal Article The News Journal published an article about our work on Enabling and Supporting the Development of Energy-Efficient Software. July 7, 2016 — ASE Paper Acceptance Our paper Towards Automatically Generating Descriptive Names for Unit Tests has been accepted to the 31st IEEE/ACM International Conference on Automated Software Engineering (ASE 2016). Upcoming Service Member of the Program Committee for the 11th IEEE Conference on Software Testing, Validation and Verification (ICST 2018) Member of the Program Committee for the 40th International Conference on Software Engineering (ICSE 2018)",
  "content_length": 2136,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:55"
}