{
  "name": "James N. Smith",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=JASMITH8",
  "status": "success",
  "content": "James Smith - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback James Smith Director, M.S. Information Security Management James Smith Director, M.S. Information Security Management Assistant Professor Academic Appointment(s)AdministrationDepartment of Computer & Cyber SciencesSchool of Computer and Cyber SciencesDepartment of Computer & Cyber SciencesAdministrationDepartment of The Graduate School Other DutiesDirector, M.S. Information Security Management, Computer & Cyber Sciences BioDr. James N. Smith, DBA, MBA, CISSP is an Assistant Professor in the School of Computing and Cyber Sciences at Augusta University. Prior to transitioning to academia, Dr. Smith spent his career bridging the corporate and academic worlds. For almost 20 years, he served in a variety of positions, both in private industry and as a civilian contractor for the U.S. Army, culminating as corporate Director of Information Technology. In addition to his industry experience he taught various security and networking courses first at Georgia Southern University and later at Mercer University prior to completing his doctorate at Kennesaw State University. His research interests focus, at the macro level, on how organizational and public policy affect change in the cybersecurity environment and, on the individual level, on how emerging neuro information systems methods can be applied to the security field. Dr. Smith also serves in various corporate and not for profit board capacities. JASMITH8@augusta.edu (706) 729-2371 GH 128 General Credentials Instruction Scholarship Service Education DBA, Management Information Systems, General Kennesaw State University, 2016 MBA, Business Administration Mercer University, 2004 BBA, Management Information Systems, General Georgia Southern University, 1998 Certifications CompTIA IT Operations Specialist (CIOS) CompTIA, 2018 CompTIA Secure Infrastructure Specialist (CSIS) CompTIA, 2018 CompTIA Advanced Security Practitioner+ (CASP+) CompTIA, 2012 A+ CompTIA, 2010 Network+ CompTIA, 2010 Security+ CompTIA, 2010 2008 2008 2008 Certified Information Systems Security Professional (CISSP) ISC2, 2007 2007 2005 1999 Microsoft Certified Systems Engineer (MCSE) Microsoft, 1999 Microsoft Certified IT Professional: Enterprise Administrator (MCITP) Microsoft, 2012 Microsoft Certified IT Professional: Server Administrator (MCITP) Microsoft, 2012 Awards & Honors 2023 Best Overall Paper Southern Association of Information Systems, 2023 2016 Beta Gama Sigma Honors Society Kennesaw State University, 2016 International Conference on Information Systems (ICIS) Doctoral Consortium Association for Information Systems, 2015 Courses Taught Most Recent Academic Year AIST 6363 Cloud Computing Security AIST 7120 Quantitative Research in IS AIST 6357 Information Risk Management AIST 4720 Enterprise System Architecture Teaching Interests My objective when teaching security and technology in the university environment is threefold. First, I seek to use the educational experience to teach state of the art solutions to help the future professional to be marketable. Second, I use that experience to teach the long term skills that the future professional will need to remain relevant in a fast changing field. Third, I seek to instill a focus on business objectives that will help the future professional succeed as a leader in the information technology field. We owe it to our students to teach them information technology using the most current products and best practices that we possibly can. It requires continual learning on our part, but it helps our students to enter the field equipped to capture their first professional position. I feel that academic research can work hand in hand with continuing professional education on our part to maintain an academic environment that is relevant to the business needs of today and tomorrow. While we are teaching them the most current technology, we owe it to our students to teach them the long term skills that will equip them to be relevant as future technologies eclipse what they were taught. The fundamentals of problem solving, systematic thinking and self-teaching are critical to the mid-career IT professional to stay competitive. This helps out students to truly grow from apprentice to journeyman to master across their career. While we teach them the technologies of today and the lifelong skills of an IT professional, we owe it to our students to teach them that technology does not exist in a vacuum. Learning, understanding, and internalizing the operational and strategic goals that IT seeks to meet will help the student see the larger picture of the organizations in which they serve. This larger picture view helps the IT professional transition from a skilled follower to a skilled leader across their career. Scholarship Selected Recent Publications , 2025 Journal Article, Academic Journal , 2025 Journal Article, Academic Journal , 2024 Conference Proceeding , 2023 Conference Proceeding , 2023 Conference Proceeding Research Interests Utilizing quantitative survey-based, qualitative and experimental approaches, I am most interested in exploring the following areas in information systems and technology: • Human factors related to cybersecurity and behavior• Cybersecurity practice and education• NeuroIS and Assistive Technologies Thus far, my research has focused on the experience of family influenced firms in the implementation and assimilation of enterprise systems. Drawing from the family business literature and IS literature looking at organizational fit to the enterprise system artifact I have proposed the existence of organizational misfit between the operations of highly family influenced firms and standard ERP systems. For my dissertation research I have developed a survey based quantitative instrument which hopes to support this proposition. In addition. I am gathering qualitative data for future work in looking to make information technology more valuable to family businesses. At present, I am engaged in data collection and analysis for my dissertation. Expanding on my industry experience in the security realm and my teaching experience in cybersecurity, I have an ongoing interest in research into cybersecurity practice and education. I hope to contribute to a pedagogy that teaches cybersecurity in a broader context in the university environment by developing a case based framework for teaching global strategic cybersecurity. College Service Graduate Curriculum Committee 2018 - Present Role: Committee Member University Service Graduate School Curriculum Subcommittee 2019 - Present Role: Committee Member Professional Service Americas Conference on Information Systems 2019 - 2019 Role: Reviewer, Conference Paper Conference of the Southern Association for Information Systems 2019 - 2019 Role: Reviewer, Conference Paper European Journal of Information Systems 2019 - 2019 Role: Reviewer, Journal Article Government Information Quarterly 2019 - 2019 Role: Reviewer, Journal Article Information & Management 2019 - 2019 Role: Reviewer, Journal Article",
  "content_length": 7151,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:13"
}