{
  "name": "James A. Storer",
  "homepage": "http://www.cs.brandeis.edu/~storer",
  "status": "success",
  "content": "Storer Home Page Jim Storer CS Department Information How to Contact Me Biographical Sketch and Research Interests Books Patents Data Compression Conference Brandeis Data Compression Group Other Research Lunar Landing Game Useful Advice The Brandeis Computer Science Department The Brandeis Computer Science department home page is: http://www.cs.brandeis.edu For questions, contact our Department Office: 781-736-2700 Contact Information Professor James Andrew Storer Computer Science Department Brandeis University Waltham, MA 02454 web: www.cs.brandeis.edu/~storer email: James A Storer or if there are problems with mail filtering., this also goes to me: email: James Andrew Storer Biographical Sketch and Research Interests James A. Storer received his B.A. in Mathematics and Computer Science from Cornell University in 1975, his M.A. in Computer Science from Princeton University in 1977, and his Ph.D. in Computer Science from Princeton University in 1979. From 1979 to 1981 he was a researcher (MTS) at Bell Laboratories in Murray Hill, New Jersey. In 1981 he came to Brandeis University, where he served as Chair of the Computer Science Department from 1992 to 2002 and is currently Full Professor of Computer Science and member of the Brandeis Center for Complex Systems. Dr. Storer's research interests include computer algorithms, communications and internet related computing, data compression and archiving (including text, images, video, and multi-media), storage and processing of large data sets, image retrieval, object recognition, text, image, and video processing, parallel computing, machine learning. He has obtained U.S. patents, does computing technology consulting, including serving as an expert witness in patent litigation, and has served as Chair of the annual Data Compression Conference (proceedings published by the IEEE Computer Society Press). Books Proceedings Data Compression Conference James A. Storer Chair 1991-2012,   Co-Chair 2013-2023,   Proceedings Chair 2024-2026 Proceeding of the Annual IEEE Data Compression Conference are published each year. Each volume has ten page extended abstracts of the presentations at technical sessions and one page abstracts of presentations at the posters session. Research areas addressed at DCC: Lossless and lossy compression algorithms for specific types of data (text, images, multi-spectral and hyper-spectral images, palette images, video, speech, music, maps, instrument and sensor data, space data, earth observation data, graphics, 3D representations, animation, bit-maps, etc.), source coding, joint source-channel coding, multiple description coding, quantization theory, vector quantization (VQ), multiple description VQ, compression algorithms that employ transforms (including wavelet transforms), bi-level image compression, gray scale and color image compression, video compression, geometry compression, speech and audio compression, compression of multi-spectral and hyper-spectral data, compression of science, weather, and space data, source coding in multiple access networks, parallel compression algorithms and hardware, fractal based methods, error resilient compression, adaptive compression algorithms, string searching and manipulation used in compression applications, closest-match retrieval in compression applications, browsing and searching compressed data, content based retrieval employing compression methods, minimal length encoding and applications to learning, system issues relating to data compression (including error control, data security, indexing, and browsing), medical imagery storage and transmission, compression of web graphs and related data structures, compression applications and issues for computational biology, compression applications and issues for the internet, compression applications and issues for mobile computing, applications of compression to file distribution and software updates, applications of compression to files storage and backup systems, applications of compression to data mining, data compression employing machine learning, data compression standards (including the JPEG, MPEG, G.xxx, and H.XXX families). 1991 - present (6 by 9 inch, approximately 500 pages hard-bound) IEEE Computer Society Press 10662 Los Vaqueros Circle Los Alamitos, CA 90720 phone: 714-821-8380 toll-free phone: 800-678-4333 fax: 714-821-4641 Hyperspectral Data Compression Giovanni Motta, Francesco Rizzo, James A. Storer, Editors This book provides a survey of recent results in the field of compression of remote sensed 3D data, with a particular interest in hyperspectral imagery. Remote sensed data present special challenges in the acquisition, transmission, analysis, and storage process. Perhaps most significant is the information extraction process. In most cases accurate analysis depends on high quality data, which comes with a price tag: increased data volume. For example, the NASA JPL's Airborne Visible/Infrared Imaging Spectrometer (AVIRIS, http://aviris.jpl.nasa.gov) records the visible and the near infrared spectrum of the reflected light of an area 2 to 12 kilometers wide and several kilometers long (depending on the duration of the flight) into hundreds of non overlapping bands. The resulting data volume typically exceeds 500 Megabytes per flight and it is mainly used for geological mapping, target recognition, and anomaly detection. On the other hand, ultraspectral sounders such as the NASA JPL's Atmospheric Infrared Sounder (AIRS, http://www airs.jpl.nasa.gov), which has recently become a reference in compression studies on this class of data, records thousands of bands covering the infrared spectrum and generates more than 12 Gigabytes of data daily. Chapter 1 addresses compression architecture and reviews and compares compression methods. Chapter 2 through 4 focus on lossless compression (where the decompressed image must be bit for bit identical to the original). Chapter 5 (contributed by the editors) describes a lossless algorithm based on vector quantization with extensions to near lossless and possibly lossy compression for efficient browsing and pure pixel classification. Chapters 6 deals with near lossless compression while Chapter 7 considers lossy techniques constrained by almost perfect classification. Chapters 8 through 12 address lossy compression of hyperspectral imagery, where there is a tradeoff between compression achieved and the quality of the decompressed image. Chapter 13 examines artifacts that can arise from lossy compression. Springer-Verlag, 2005 (425 pages, 6\" x 9\", hard-bound) ISBN: 0-387-28579-2 www.springer.com An Introduction to Data Structures and Algorithms James A. Storer Data structures and algorithms are presented at the undergraduate and first-year graduate level. The 13 chapters are: RAM Model, Lists, Induction and Recursion, Trees, Algorithm Design, Hashing, Heaps, Balanced Trees, Sets Over a Small Universe, Graphs, Strings, Graphs, Discrete Fourier Transform, Parallel Computation. Except for the introduction and bibliographic notes for each chapter, all page breaks have been put in manually and the format corresponds to a lecture style with ideas being presented in \"digestible\" page-size quantities. Chapters 1 through 4 cover elementary concepts and data structures at a slower pace than the remainder of the book. A more advanced course can essentially start with Chapter 5 (algorithm design). Although it is not clear what parallel architectures will prevail in the future, the last chapter further teaches fundamental concepts in algorithm design by exploring classic models of parallel computation, including the PRAM, generic PRAM simulation, HC/CCC/Butterfly, the mesh, and parallel hardware area-time tradeoffs. Springer-Verlag, 2002) (600 pages, 7\" x 10\", hard-bound) ISBN 0-8176-4253-6, ISBN 3-7643-4253-6 www.springer.com More information, including table of contents and errata. Data Compression: Methods and Theory James A. Storer The first two chapters contain introductory material on information and coding theory. The remaining four chapters cover some of my data compression research performed in the period 1977 - 1985 (including substantial material that has not been reported elsewhere). Chapter 3 considers on-line textual substitution methods that employ \"learning\" heuristics to adapt to changing data characteristics. Chapter 4 considers massively parallel algorithms for on-line methods and their VLSI implementations. Chapter 5 considers off-line methods (including the NP-completeness of certain methods). Chapter 6 addresses program size (Kolmogorov) complexity. The appendices present source code and empirical results. Computer Science Press (a subsidiary of W. H. Freeman Press), 1988 (419 pages 6\" x 9\", hard-bound) ISBN 0-88175-161-8 Image and Text Compression James A. Storer, Editor This is an edited volume of papers by researchers in the field; topics include: vector quantization, fractals, optical algorithms, massively parallel hardware, and coding theory. Also included is a 75 page bibliography of data compression research compiled specifically for this book. Kluwer Academic Press (part of Springer), 1992 (354 pages, 6\" x 9\", hard-bound) ISBN 0-7923-9243-4 Proceedings Compression and Complexity of Sequences Bruno Carpentieri, Alfredo De Santis, Ugo Vaccaro, and James A. Storer, Editors This is an edited volume of the papers presented at the International Conference on Compression and Complexity of Sequences, held in Positano, Italy in 1997. Papers address the theoretical aspects of data compression and its relationship to problems on sequences, and include contributions from the editors. IEEE Computer Society Press, 1998 (400 pages, 6\" x 9\", hard-bound) ISBN 0-8186-8132-2 Patents Computational Modeling of Rotation and Translation Capable Human Visual Pattern Recognition U.S. Provisional Patent Application. INVENTORS: John Lisman, James A. Storer, Martin Cohn, Antonella DiLillo FILED: August 29, 200",
  "content_length": 76473,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:50"
}