{
  "name": "James C. Gee",
  "homepage": "https://www.med.upenn.edu/apps/faculty/index.php/g275/p10656",
  "status": "success",
  "content": "James C. Gee | Faculty | About Us | Perelman School of Medicine | Perelman School of Medicine at the University of Pennsylvania About Us Our Faculty James C. Gee James C. Gee, Ph.D. Professor of Radiologic Science in Radiology Director, Penn Image Computing and Science Laboratory, Department of Radiology, Perelman School of Medicine, University of Pennsylvania, Philadelphia, PA Co-Director, Translational Bio-Imaging Center, Institute of Translational Medicine and Therapeutics, University of Pennsylvania, Philadelphia, PA Faculty Affiliate, General Robotics, Automation, Sensing and Perception (GRASP) Laboratory, University of Pennsylvania, Philadelphia, PA Director, MSE in Data Science Online Program, School of Engineering and Applied Science, University of Pennsylvania, Philadelphia, PA Co-Chair, Committee on Appointments and Promotions, Department of Radiology, Perelman School of Medicine, University of Pennsylvania, Philadelphia, PA Director, Interfaces Program in Biomedical Imaging and Informational Sciences, University of Pennsylvania, Philadelphia, PA Faculty Search Advisor, Department of Radiology, Perelman School of Medicine, University of Pennsylvania, Philadephia, PA Department: Radiology Graduate Group Affiliations Computer and Information Science Bioengineering Contact information Department of Radiology Penn Image Computing and Science Laboratory Richards - 6th Floor 3700 Hamilton WalkPhiladelphia, PA 19104-6116 Office: 215-746-6295 Email: gee@upenn.edu Links Laboratory website Biography Page, Penn Image Computing and Science Laboratory Education: B.S. (Electrical Engineering) University of Washington, 1987. B.S. (Computer Science) University of Washington, 1987. M.S. (Electrical Engineering) University of Washington, 1989. Ph.D. (Computer and Information Science) University of Pennsylvania, 1996. Permanent link > Perelman School of Medicine   > Faculty   > Details Selected Publications Phillips, J. S., Da Re, F., Irwin, D. J., McMillian, C. T., Vaishnavi, S. N., Xie, S. X., Lee, E. B., Cook P.A., Gee, J. C., Shaw, L. M., Trojanowski, J. Q., Wolk, D. A., Grossman, M. : Longitudinal progression of grey matter atrophy in non-amnestic Alzheimer's disease. Brain 142(6): 1701-1722, June 2019 Notes: DOI: 10.1093/brain/awz091. Johnson, G. A., Wang, N., Anderson, R.J., Chen, M., Cofer, G.P., Gee, J. C., Pratson, F., Tustison, N., White, L. E.: Whole mouse brain connectomics. Journal of Comparative Neurology 527(13): 2146-2157, September 2019. Duong M T, Rudie J D, Wang J, Xie L, Mohan S, Gee J C, Rauschecker A M: Convolutional Neural Network for Automated FLAIR Lesion Segmentation on Clinical Brain MR Imaging. American Journal of Neuroradiology 40(8): 1282-1290, August 2019. Claeson AA, Vresilovic EJ, Showalter BL, Wright AC, Gee JC, Malhotra NR, Elliott DM: Human Disc Nucleotomy Alters Annulus Fibrosus Mechanics at Both Reference and Compressed Loads. J Biomech Eng 141(11), May 2019. Guo, Y., Chung, F., Li, G., Wang, J., Gee, J.C., : Leveraging label-specific discriminant mapping features for multi-label learning. ACM Transactions on Knowledge Discovery from Data 13(2): art. no. 24 pp1-23, April 2019. Tustison, N. J., Avants, B. B., Lin, Z., Feng, X., Cullen, N., Mata, J. F., Flos, L., Gee, J. C., Altes, T. A., Mugler, III, J. P., Qing, K.: Convolutional Neural Networks with Template-Based Data Augmentation for Functional Lung Image Quantification. Academic Radiology 26(3): 412-423, March 2019 Notes: doi: 10.1016/j.acra.2018.08.003. Epub 2018 Sep 6. Kim H, Goo JM, Ohno Y, Kauczor HU, Hoffman EA, Gee JC, van Beek EJR: Effect of Reconstruction Parameters on the Quantitative Analysis of Chest Computed Tomography J Thorac Imaging 34(2): 92-102, March 2019. Lindsay, W.D., Ahern, C.A., Tobias, J.S., Berlind, C.G., Chinniah, C., Gabriel, P.E., Gee, J.C., Simone, C.B.: Automated data extraction and ensemble methods for predictive modeling of breast cancer outcomes after radiation therapy. Medical Physics 46(2): 1054-1063, February 2019. back to top Last updated: 09/09/2025 The Trustees of the University of Pennsylvania",
  "content_length": 4091,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:51"
}