{
  "name": "James R. Miller",
  "homepage": "http://people.eecs.ku.edu/~miller",
  "status": "success",
  "content": "James R. Miller - Home Page James R. Miller, Emeritus Faculty Department of Electrical Engineering and Computer Science 2001 Eaton Hall 1520 W. 15 Street The University of Kansas Lawrence, KS 66045-7621 jrmiller@ku.edu Graphics, Visualization, and Modeling Classes EECS 672: Introduction to Computer Graphics Tools Shader-Based OpenGL: Overview, Tutorial, and More The cryph toolkit Using cryph with OpenGL Courses with \"672: Introduction to Computer Graphics\" as a prerequisite: EECS 773: Advanced Graphics EECS 774: Geometric Modeling EECS 775: Visualization Other Classes EECS 268: Programming II (CS2) Resource: Moving From Java to C++ EECS 675: Multicore and GPU Programming Research Interests Computer Graphics and Visualization Ongoing projects with the KU Spencer Museum of Art Storytelling: Using Search, Filtering, Mapping, and Animation to tell stories from the Spencer collection The genesis of the project Art and Artists Through Time and Space (AATTS; Best viewed in Chrome) AATTS is one of a suite of Spencer Museum of Art applications. Exhibitions curated using AATTS Works by immigrant artists ; Accompanying video Works by centenarian artists Works by young adult artists Spencer Exhibition Viewer (Development has been suspended. Database changes and other issues have left the app in a rather skeletal state.) Scientific and Information Visualization Selected projects using NASA World Wind Multivariate scalar and vector field visualization on a globe Lidar data analysis and visualization for GIS Dynamic sensor field visualization in an environment with many obstructions Geometric Modeling (Curves, Surfaces, Solids) Technology in Education Selected papers Other Activities and Interests Microbrewery Quality Assurance (FSB ; Fields & Ivy ; 23rd St ; LBC ; BSB) Past President and current board member of the Arc of Douglas County, an advocacy and referral organization for people with developmental disabilities. We are affiliated with the Arc of the United States. Bike riding, Softball, Volleyball, Racquetball, Golf, ... Tae Kwon Do, Hap Ki Do",
  "content_length": 2071,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:19"
}