{
  "name": "James McKee",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/james-mckee",
  "status": "success",
  "content": "James McKee - Royal Holloway Research Portal James McKee Professor Discrete Mathematics and its ApplicationsNumber TheoryProfessor of Mathematics, Department of Mathematics Phone+44 1784 443670EmailJames.McKeerhul.acuk TW20 0EX Personal profile Research interestsJames McKee’s research interests lie at the interface of number theory and combinatorics, with computational leanings. His recent work has mostly been connected with Pisot numbers, Salem numbers, other algebraic numbers whose Galois conjugates are geometrically constrained, and associating algebraic numbers to certain combinatorial objects. Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 33 Article 5 Conference contribution 2 Book 2 Chapter 1 More 1 Working paper Research output per year Research output per year Short Mahler-measure-preserving multiples of multivariable polynomialsMcKee, J. & Smyth, C., 28 Aug 2025, (Accepted/In press) In: Mathematics of Computation. 14 p.Research output: Contribution to journal › Article › peer-review Small Mahler measures with bounds on the house and shortnessEl-Serafy, S. & McKee, J., 20 Jan 2025, (E-pub ahead of print) In: Canadian Mathematical Bulletin. 17 p.Research output: Contribution to journal › Article › peer-review Open Access 1 Downloads (Pure) The Cassels heights of cyclotomic integersMcKee, J., Oh, B.-K. & Smyth, C., 2 Sept 2022, In: Mathematische Zeitschrift. 302, p. 1785-1796 12 p.Research output: Contribution to journal › Article › peer-review Open Access Around the Unit Circle: Mahler Measure, Integer Matrices and Roots of UnityMcKee, J. & Smyth, C., 2021, Switzerland: Springer. 438 p. (Universitext)Research output: Book/Report › Book Small Mahler measures coming from digraphsCoyston, J. & McKee, J., 16 Oct 2021, (E-pub ahead of print) In: EXPERIMENTAL MATHEMATICS.Research output: Contribution to journal › Article › peer-review Open AccessFile 74 Downloads (Pure) View all 43 research outputs Projects 1 Finished Projects per year Salem, numbers, pisot numbers, graphs and matricesMcKee, J. (PI)Heilbronn Institute for Mathematical Research1/10/08 → 30/09/11Project: Research",
  "content_length": 2449,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:13"
}