{
  "name": "James Fogarty",
  "homepage": "https://homes.cs.washington.edu/~jfogarty",
  "status": "success",
  "content": "James Fogarty James Fogarty Professor Computer Science & Engineering University of Washington Paul G. Allen Center, Room 596 jfogarty [at] cs [dot] washington [dot] edu I am a Professor of Computer Science & Engineering at the University of Washington. I am also a core member of the DUB Group, our cross-campus initiative advancing Human-Computer Interaction and Design research and education. My broad research interests are in Human-Computer Interaction, User Interface Software and Technology, and Ubiquitous Computing. My focus is on developing, deploying, and evaluating new approaches to the human obstacles surrounding widespread everyday adoption of ubiquitous sensing and intelligent computing technologies. I pursue this work together with an outstanding group of collaborators and amazing current advisees: Shaan Chopra Tae Jones Aaleyah Lewis Richard Li Jesse Martinez Anant Mittal Yasaman Sefidgar Mingyuan (Jason) Zhong My research has been directly supported by the National Science Foundation, the National Library of Medicine, and the Agency for Healthcare Research and Quality. My group has also been generously supported by Adobe, FXPAL, Google, Intel, Microsoft, and Nokia. Mailing Address Computer Science & Engineering University of Washington Box 352350 Seattle, WA 98195 Remote Internship Scam My name is being used in a scam offering internships or research assistantships. This is unfortunately a scam targetting faculty around the world. My name is mostly but not exclusively being used in targetting UW students. Any communication from me will only be from my official email address: jfogarty [at] cs [dot] washington [dot] edu. If you have any doubt whether you are actually communicating with me, please ask to talk with me via Zoom. If it is actually me, I will be happy to make that time.",
  "content_length": 1821,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:01"
}