{
  "name": "James R. Wright",
  "homepage": "http://jrwright.info",
  "status": "success",
  "content": "James R. Wright Contact Dept. of Computing Science University of Alberta University Commons 7-213 Edmonton, Alberta, Canada T6G 2N8 Office: UCOMM 6-135 james.wright@ualberta.ca \"That's your game theory? Rock Paper Scissors with statistics?\" — Peter Watts, Blindsight James R. Wright Hello, I'm James Wright. I am an Associate Professor at the University of Alberta. I am also a Fellow of the Alberta Machine Intelligence Institute. Previously I was a postdoctoral researcher at Microsoft Research in New York City. I completed my Ph.D. at the University of British Columbia in 2016, advised by Kevin Leyton-Brown. Research My primary research interest is in using data-driven machine learning models to predict human strategic behavior; that is, behavior in interactions where each participant's rewards depend partially on the actions of other participants. My long-term research agenda is to build a general theory for optimally designing algorithms for mediating interactions involving humans or other realistically bounded agents rather than idealized, perfectly rational game theoretic agents. Curriculum Vitae My academic CV is available as both an HTML page and a PDF document. I also have a public Google Scholar citations page. Publications ElementaryNet: A Non-Strategic Neural Network for Predicting Human Behavior in Normal-Form Games. Greg d'Eon, Hala Murad, Kevin Leyton-Brown, and James R. Wright. AAAI 2026: AAAI Conference on Artificial Intelligence, forthcoming. How to Evaluate Behavioral Models. Greg d'Eon, Sophie Greenwood, Kevin Leyton-Brown, and James R. Wright. AAAI 2024: AAAI Conference on Artificial Intelligence, pages 9636–9644, 2024. Oral presentation. Guarantees for Self-Play in Multiplayer Games via Polymatrix Decomposability. Revan MacQueen and James R. Wright. NeurIPS 2023: Thirty-seventh Conference on Neural Information Processing Systems, pages 20230–20259, 2023. Finding an Optimal Set of Static Analyzers To Detect Software Vulnerabilities. Jiaqi He, Revan MacQueen, Natalie Bombardieri, Karim Ali, James R. Wright, and Cristina Cifuentes. ICSME 2023: IEEE International Conference on Software Maintenance and Evolution (Industry Track), pages 463–473, 2023. Exploiting Action Impact Regularity and Exogenous State Variables for Offline Reinforcement Learning. Vincent Liu, James R. Wright, Martha White. Journal of Artificial Intelligence Research, Volume 77, pages 71–101, May 2023. Non-strategic Econometrics (for Initial Play). Daniel Chui, Jason Hartline, and James R. Wright. AAMAS 2023: International Conference on Autonomous Agents and Multiagent Systems, pages 634–642, 2023. The Spotlight: A General Method for Discovering Systematic Errors in Deep Learning Models. Greg d'Eon, Jason d'Eon, James R. Wright, and Kevin Leyton-Brown. ACM Conference on Fairness, Accountability, and Transparency (ACM FAccT), pages 1962–1981, 2022. Efficient Deviation Types and Learning for Hindsight Rationality in Extensive-Form Games. Dustin Morrill, Ryan D'Orazio, Marc Lanctot, James R. Wright, Michael Bowling, and Amy Greenwald. ICML 2021: International Conference on Machine Learning, pages 7818–7828, 2021. The Role of Accuracy in Algorithmic Process Fairness Across Multiple Domains. Michele Albach and James R. Wright. EC-21: ACM Conference on Economics and Computation, pages 29–49, 2021. Hindsight and Sequential Rationality of Correlated Play. Dustin Morrill, Ryan D'Orazio, Reca Sarfati, Marc Lanctot, James R. Wright, Amy Greenwald, and Michael Bowling. AAAI 2021: AAAI Conference on Artificial Intelligence, pages 5584–5594, 2021. Disinformation, Stochastic Harm, and Costly Effort: A Principal-Agent Analysis of Regulating Social Media Platforms. Shehroze Khan and James R. Wright. Cooperative AI Workshop at NeurIPS, 2021. Incentivizing Evaluation with Peer Prediction and Limited Access to Ground Truth (Extended Abstract). Xi Alice Gao, James R. Wright, and Kevin Leyton-Brown. IJCAI-PRICAI 2020 Journal Track, pages 5140–5144, 2020. A Formal Separation Between Strategic and Nonstrategic Behavior (Abstract). James R. Wright and Kevin Leyton-Brown. EC-20: ACM Conference on Economics and Computation, pages 535–536, 2020. Why Do Software Developers Use Static Analysis Tools? A User-Centered Study of Developer Needs and Motivations. Lisa Nguyen Quang Do, James R. Wright, and Karim Ali. IEEE Transactions on Software Engineering, Volume 48, pages 835–847, March 2022. How can machine learning aid behavioral marketing research? Linda Hagen, Kosuke Uetake, Nathan Yang, Bryan Bollinger, Allison J. B. Chaney, Daria Dzyabura, Jordan Etkin, Avi Goldfarb, Liu Liu, K. Sudhir, Yanwen Wang, James R. Wright, and Ying Zhu. Marketing Letters, Volume 31, pages 361–370, 2020. Alternative Function Approximation Parameterizations for Solving Games: An Analysis of f-Regression Counterfactual Regret Minimization. Ryan D'Orazio, Dustin Morrill, James R. Wright, and Michael Bowling. AAMAS 2020: International Conference on Autonomous Agents and Multiagent Systems, pages 339–347, 2020. Learning When to Stop Searching. Daniel G. Goldstein, R. Preston McAfee, Siddarth Suri, and James R. Wright. Management Science 66:3, pages 1375–1394, March 2020. (Full version of Goldstein et al. [2017]) Bounds for Approximate Regret-Matching Algorithms. Ryan D'Orazio, Dustin Morrill, James R. Wright. Bridging Game Theory and Deep Learning Workshop at NeurIPS, 2019. A Formal Separation Between Strategic and Nonstrategic Behavior. James R. Wright and Kevin Leyton-Brown. Workshop on Behavioral EC at ACM Conference on Economics and Computation, 2019. Incentivizing Evaluation with Peer Prediction and Limited Access to Ground Truth. Xi Alice Gao, James R. Wright, and Kevin Leyton-Brown. Artificial Intelligence. 275, 2019. Level-0 Models for Predicting Human Behavior in Games. James R. Wright and Kevin Leyton-Brown. Journal of Artificial Intelligence Research, Volume 64, pages 357–383, February 2019. (supersedes Wright & Leyton-Brown [2014]) Predicting Human Behavior in Unrepeated, Simultaneous-Move Games. James R. Wright and Kevin Leyton-Brown. Games and Economic Behavior, Volume 106, pages 16–37, November 2017. (supersedes Wright & Leyton-Brown [2010, 2012]) Learning in the Repeated Secretary Problem. Daniel G. Goldstein, R. Preston McAfee, Siddarth Suri, and James R. Wright. ACM Conference on Economics and Computation (ACM-EC), 2017. (Abstract) Deep Learning for Predicting Human Strategic Behavior. Jason Hartford, James R. Wright, and Kevin Leyton-Brown. NIPS 2016: Thirtieth Annual Conference on Neural Information Processing Systems, 2016. Oral presentation. Incentivizing Evaluation via Limited Access to Ground Truth: Peer-Prediction Makes Things Worse. Xi Alice Gao, James R. Wright, and Kevin Leyton-Brown. Workshop on Algorithmic Game Theory and Data Science at ACM Conference on Economics and Computation, 2016. Mechanical TA: Partially Automated High-Stakes Peer Grading. James R. Wright, Chris Thornton, Kevin Leyton-Brown. ACM Technical Symposium on Computer Science Education (ACM-SIGCSE), 2015 Level-0 Meta-Models for Predicting Human Behavior in Games. James R. Wright and Kevin Leyton-Brown. ACM Conference on Economics and Computation (ACM-EC), 2014. Behavioral Game-Theoretic Models: A Bayesian Framework For Parameter Analysis. James R. Wright and Kevin Leyton-Brown. Proceedings of the 11th International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2012), pages 921–928, 2012. Best student paper (runner up). Linear solvers for nonlinear games: using pivoting algorithms to find Nash equilibria in n-player games. James R. Wright, Albert Xin Jiang, and Kevin Leyton-Brown. SIGecom Exchanges, volume 10, number 1, pages 9–12, 2011. Beyond Equilibrium: Predicting Human Behavior in Normal Form Games. James R. Wright and Kevin Leyton-Brown. Proceedings of the Twenty-Fourth AAAI Conference on Artificial Intelligence (AAAI-10), pages 901–907, 2010. Last update: Nov 8/2025",
  "content_length": 7961,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:19"
}