{
  "name": "James Cussens",
  "homepage": "https://research-information.bris.ac.uk/en/persons/james-cussens",
  "status": "success",
  "content": "James Cussens - University of Bristol View Scopus Profile Dr James Cussens BSc, PhD Senior Lecturer, School of Computer Science https://orcid.org/0000-0002-1363-2336 Emailjames.cussensbristol.acuk BS8 1UB Personal profile Research Groups and ThemesIntelligent Systems Laboratory Fingerprint Dive into the research topics where James Cussens is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 1 Similar Profiles Bayesian Networks Computer Science 100% Logic Programming Computer Science 81% Inductive Logic Programming Computer Science 80% Bayesian Network Mathematics 66% Learning Bayesian Network Computer Science 57% Bayesian Mathematics 55% structure learning Computer Science 55% bayesian network structure Computer Science 55% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 47 Conference Contribution (Conference Proceeding) 31 Article (Academic Journal) 7 Chapter in a book 4 Other contribution 10 More 2 Edited book 2 Book/Film/Article review (Academic Journal) 2 Working paper 1 Conference Paper 1 Conference Poster 1 Special issue (Academic Journal) 1 Digital or Visual Products Research output per year Research output per year Algorithmic tenancies and the ordinal tenant: digital risk-profiling in England’s private rented sectorWallace, A., Beer, D., Burrows, R., Ciocănel, A. & Cussens, J., 27 Jan 2025, (E-pub ahead of print) In: Housing Studies. 21 p.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open Access Digital 100% Tenants 100% Ordinal 100% England 100% UK 100% 1 Citation (Scopus) Algorithmic dwelling? Digital technologies as intermediaries in housing access and the enactment of homeBurrows, R., Wallace, A., Beer, D., Cussens, J. & Ciocănel, A., 3 Jun 2024, (E-pub ahead of print) In: Information, Communication & Society. 27, 9, p. 1737-1742 6 p.Research output: Contribution to journal › Special issue (Academic Journal) › peer-review Open Access 1 Citation (Scopus) Open Banking and data reassurance: the case of tenant referencing in the UKCiocanel, A., Wallace, A., Beer, D., Cussens, J. & Burrows, R. J., 20 Feb 2024, In: Information, Communication & Society. 27, 9, p. 1810-1825 16 p.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open Access Interface Design 100% Financial Decision 100% Application Process 100% Risk Profiling 100% Decision-Making 100% 5 Citations (Scopus) View all 99 research outputs Projects 4 Finished Projects per year Code Encounters: Algorithmic risk profiling tools as housing market intermediariesAlison, W. (Principal Investigator), Burrows, R. J. (Principal Investigator), Cussens, J. (Co-Investigator) & Beer, D. (Co-Investigator)1/01/22 → 31/12/23Project: Research Tailoring health policies to improve outcomes using machine learning, causal inference and operations research methodsCussens, J. (Principal Investigator)1/09/20 → 31/08/23Project: Research, Parent Tailoring health policies to improve outcomes using machine learning, causal inference and operations research methodsCussens, J. (Principal Investigator)1/09/20 → 31/08/23Project: Research View all 4 projects",
  "content_length": 3524,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:57"
}