{
  "name": "James Purtilo",
  "homepage": "https://seam.cs.umd.edu/purtilo",
  "status": "success",
  "content": "Purtilo Homepage Rent this space. James Purtilo Associate Professor of Computer Science University of Maryland at College Park Brendan Iribe Center 8125 Paint Branch Drive #5214 College Park MD 20742 301.405.2706 purtilo @ umd.edu Research Software Engineering @ Maryland Academics (Spring 2026) CMSC 435: Software Engineeering (Fall 2025) CMSC 435: Software Engineeering RSAC 2025 Coordinator ... on Computer Science There are 10 kinds of people. Those who understand binary, and those who don't. People say that if you play Microsoft CD's backwards, you hear satanic things, but that's nothing, because if you play one forwards, it installs Windows. \"The problem with quotes on the Internet is that they cannot be verified.\" -- Abraham Lincoln, 1865 ... on College Park Institutions of higher learning have no place for free thinkers. In fact, here you must pay a lot to be allowed to think like everyone else. What's the opposite of diversity? University. He who dares not offend cannot be honest. ... on Everything \"A fanatic is one who can't change his mind and won't change the subject.\" -- Winston Churchill \"Remember that a government big enough to give you everything you want is also big enough to take away everything you have.\" -- Davy Crockett \"Evil preaches tolerance until it is dominant, then it tries to silence good.\" -- Charles Chaput \"If you don't go over the top you can't see what's on the other side.\" -- Jim Steinman I slept, and dreamed that life is beauty;I woke, and found that life is duty. More quotes, lest we would forget. Freedom is not free. Commentary, Quotes and Resources Minority Report, produced in response to the Computer Science Department's Self-study of February 12, 2022 (2022-05-20) AI Boom Threatens to Overload America's Power Grid--And Some States Are Already Buckling (2025-11-25, ClearanceJobs.com) The Air Force Opens Its Gates to AI: Data Centers Coming to Five U.S. Bases (2025-10-29, ClearanceJobs.com) DARPA Takes Aim at AI's Energy Problem with New ML2P Program (2025-09-26, ClearanceJobs.com) From Pirates to Hackers: Lawmaker Pushes for 'Cyber Privateers' to Hunt Criminals (2025-08-27, ClearanceJobs.com) Pentagon Cancels Decade-Long Software Upgrades, Eyes Salesforce and Palantir (2025-08-18, ClearanceJobs.com) OpenAI Lands $200M Pentagon Deal as It Launches 'Gov-Only' ChatGPT Platform (2025-06-23, ClearanceJobs.com) 184M Records Exposed, Experts Warn of Impending Attacks (2025-05-28, ClearanceJobs.com) The U.S. Space Force Needs Coders to Update Nuclear Weapon Tracking System (2025-04-30, NationalInterest.org) NIST Updates Privacy Framework 1.1—Here’s What It Means for AI, Risk, and Compliance (2025-04-21, ClearanceJobs.com) Inside Stargate: What You Need to Know About Trump’s $500B AI Infrastructure Plan (2025-01-22, ClearanceJobs.com) White House Introduces U.S. Cyber Trust Mark for Internet-Connected Devices (2025-01-10, ClearanceJobs.com) Pentagon’s Cyber Intelligence Shift: From ‘Center’ to ‘Capability’—What’s Behind the Change? (2024-12-12, ClearanceJobs.com) Google’s LLM Agent Finds and Fixes Real-World Bug in Popular Database (2024-11-08, ClearanceJobs.com) Treasury’s AI Tech Stops $4 Billion in Fraud: How Machine Learning Is Changing the Game (2024-10-25, ClearanceJobs.com) Cybersecurity Experts Brace for the Next Crisis After the CrowdStrike Near-Disaster (2024-10-11, ClearanceJobs.com) 'It’s Not a Bug, It’s a Feature’ – Are Companies Too Complacent with Software Defects? (2024-08-15, ClearanceJobs.com) Rust to the Rescue: DARPA’s New Initiative to Eliminate C Language Vulnerabilities (2024-08-08, ClearanceJobs.com) Google Seeks to Acquire Cybersecurity Start-up Wiz (2024-07-18, ClearanceJobs.com) U.S. Navy NCO Demoted For Setting Up Unsecure WiFi Network on Littoral Combat Ship (2024-06-10, ClearanceJobs.com) CIA Adopts Microsoft’s Generative AI Model for Sensitive Data Analysis (2024-04-13, ClearanceJobs.com) Guarding Secrets: How Defense Contractors Approach Large Language Models in National Security (2024-03-11, ClearanceJobs.com) Deepfakes Have Been A Problem—Taylor Swift Was The Breaking Point (2024-01-27, Forbes.com) National Cyber Director Wants to Address Cybersecurity Talent Shortage by Removing Degree Requirement (2024-01-18, ClearanceJobs.com) No More Ransom Payments to Cyber Criminals: Global Effort Takes a Stand (2023-11-08, ClearanceJobs.com) Donald Trump Jr.’s X Account Hacked – Announced Father's Death (2023-09-20, Forbes.com) There Is Now A Deep Fake Video Of Ron DeSantis Dropping Out Of The 2024 Race (2023-09-02, Forbes.com) Quantum Technology Advancement: NSF Allocates $38 Million to Propel Research and Education Efforts (2023-08-25, ClearanceJobs.com) Arrested Succession Parody On YouTube Features 'Narration' By AI-Generated Ron Howard (2023-05-09, Forbes.com) The U.S. Still Needs Cybersecurity Pros Despite All the Tech Layoffs (2023-01-27, ClearanceJobs.com) The Power of ChatGPT Unleashed on Military Technology (2022-12-22, ClearanceJobs.com) Russian Software Found in Smartphone App Used by CDC and U.S. Army (2022-11-14, ClearanceJobs.com) America Is Already at War with Russia (In Cyber Space) (2022-11-11, 19fortyfive.com) Cybersecurity Remains a Top In-Demand Job But Finding Good Help Isn’t Easy (2022-10-21, ClearanceJobs.com) Social Media Now Used To Vet Gun Applicants In New York State (2022-09-12, Forbes.com) Elon Musk Suggested Possible Layoffs At Twitter (2022-05-10, Forbes.com) Professional Development May Be DoD’s Tech Recruiting Advantage (2022-04-04, ClearanceJobs.com) White House Office Pushes Move Towards Zero Trust (2022-01-28, ClearanceJobs.com) How Can IT and Cyber Candidates Meet DoD 8140 and CMMC Requirements? (2022-01-24, ClearanceJobs.com) Cyber Game Needs a Boost: Threats Will Continue in 2022 (2022-01-03, ClearanceJobs.com) 2022 Cybersecurity Predictions: Looking Ahead to Next Year’s Threats (2021-12-10, ClearanceJobs.com) NSA Investing in Cybersecurity for Smart Devices (2021-10-11, ClearanceJobs.com) Lockheed Martin Has Big Plans to Make America's Military 'Hypersonic' (2021-10-06, NationalInterest.org) Conspiracy Theories and Your Clearance: Should You Be Worried if You Get Banned from YouTube Like Robert Kennedy Jr (2021-10-01, ClearanceJobs.com) Working From Home Isn't Going Away, But It Isn't Getting Safer (2021-09-17, ClearanceJobs.com) Washington D.C. Gets Ranked as a Top City for Cybersecurity Jobs (2021-09-03, ClearanceJobs.com) The Complicated Relationship Between the Military and Video Game Industry (2021-08-27, ClearanceJobs.com) Lockheed Martin's New Skunk Works Might Be China's Worst Nightmare (2021-08-17, NationalInterest.org) Joe Biden Thinks a Cyber Attack Could Lead to a 'Shooting War'. Is He Right? (2021-07-29, 19fortyfive.com) Responding to Cyber Threats: How Much More Does U.S. Need to Update? (2021-07-23, ClearanceJobs.com) Is the Right to Repair Just Wrong? (2021-07-15, NationalInterest.org) Critical Infrastructure in the Cyber Crosshairs - Can U.S. Stop More Attacks? (2021-06-07, ClearanceJobs.com) The history of social media software (2021-06-03, HackReactor.com) Prepare for an Attack: Ransomware Will Continue to be a Problem (2021-05-21, ClearanceJobs.com) The EU's Ambitious AI Regulations: Increasing Trust or Stifling Progress? (2021-05-03, ClearanceJobs.com) FBI Reports a 69% Increase in Internet Crime in 2020 (2021-04-16, ClearanceJobs.com) Is a Dating Site a Security Concern if you Didn't Actually Sign Up? (2021-03-15, ClearanceJobs.com) Will Social Media Take Down Politicians Like Andrew Cuomo And Lauren Boebert? (2021-03-09, Forbes.com) Why Can't We Hang Up on India's Telemarketing Scams? (2021-03-01, NationalInterest.org) Chinese Tech Still in U.S. Networks Two Years After Calls for Removal (2021-02-26, ClearanceJobs.com) Your Data is Digital and Vulnerable to Tax Season Scams (2021-02-08, ClearanceJobs.com) A Data Savvy Workforce is a Key Strategy Needed This Year (2021-01-12, ClearanceJobs.com) The Lasting Headache of a Possible Breach of Classified Data in Capitol Riots (2021-01-11, ClearanceJobs.com) Deepfake Star Wars Videos Portent Ways The Technology Could Be Employed For Good And Bad (2020-12-11, Forbes.com) Social Media Proved Crucial For Joe Biden - It Allowed Him To Connect With Young Voters And Avoid His Infamous Gaffes (2020-11-17, Forbes.com) Cybersecurity Talent Shortage Calls For More Training and Better Hiring Methods (2020-11-17, ClearanceJobs.com) Five Eyes Call for Tech World to Weaken Encryption (2020-10-16, ClearanceJobs.com) Using Government Devices for Self Enrichment is Illegal: USMC Bans Cryptocurrency (2020-08-27, ClearanceJobs.com) Guns protect people from criminals when the police can't (2020-08-12, Baltimore Sun) 2020 Serves up a Cruel Summer of Cybersecurity Threats (2020-07-30, ClearanceJobs.com) More Cybersecurity Spending Does Not Equal Results (2020-07-08, ClearanceJobs.com) Could Iran Wage a Cyber War? (2020-06-20, NationalInterest.org) Top 9 software engineer movies of all time (2020-06-04, Hack Reactor) Air Force Makes Classified Information Accessible for Teleworkers (2020-05-19, ClearanceJobs.com) The U.S. Military Might Have a New Way to Beat Iran's Missiles in a War (2020-04-28, NationalInterest.org) How White Hat Hackers Keep Military Systems Safe (2020-04-19, ClearanceJobs.com) Tech Industry Calls Out DoD's Cybersecurity Efforts (2020-04-10, ClearanceJobs.com) Do Government Agencies Have the Bandwidth to Handle Telework? (2020-03-26, ClearanceJobs.com) COVID-19 and Computer Security, Part 1: Telecommuting Risks (2020-03-12, TechNewsWorld.com) The Dark Art of Turning Mountains of Stolen Data Into Cash (2020-02-28, TechNewsWorld.com) How DoD's New Cybersecurity Rules Affect Government Contractors (2020-01-17, ClearanceJobs.com) TikTok's Deepfakes Just The Latest Security Issue For The Video Sharing App (2020-01-07, Forbes.com) Tech Skills in Highest Demand in 2020 (2020-01-02, ClearanceJobs.com) Top Security Breaches of 2019: Another Bad Year for Cybersecurity",
  "content_length": 17524,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:17"
}