{
  "name": "James A. Landay",
  "homepage": "https://profiles.stanford.edu/james-landay",
  "status": "success",
  "content": "James Landay's Profile | Stanford Profiles James Landay Denning Co-Director of Stanford Institute for Human-Centered AI, Anand Rajaraman and Venky Harinarayan Professor and Senior Fellow at the Stanford Institute for Human-Centered AI Computer Science Web page: http://landay.org Print Profile Email Profile View Stanford-only Profile Tab Menu Bio Research & Scholarship Teaching Publications Bio James Landay is a Professor of Computer Science and the Anand Rajaraman and Venky Harinarayan Professor in the School of Engineering at Stanford University. He specializes in human-computer interaction. Landay is the co-founder and Co-Director of the Stanford Institute for Human-centered Artificial Intelligence (HAI). Prior to joining Stanford, Landay was a Professor of Information Science at Cornell Tech in New York City for one year and a Professor of Computer Science & Engineering at the University of Washington for 10 years. From 2003-2006, he also served as the Director of Intel Labs Seattle, a leading research lab that explored various aspects of ubiquitous computing. Landay was also the chief scientist and co-founder of NetRaker, which was acquired by KeyNote Systems in 2004. Before that he was an Associate Professor of Computer Science at UC Berkeley. Landay received his BS in EECS from UC Berkeley in 1990, and MS and PhD in Computer Science from Carnegie Mellon University in 1993 and 1996, respectively. His PhD dissertation was the first to demonstrate the use of sketching in user interface design tools. He is a member of the ACM SIGCHI Academy and an ACM Fellow. He is an ACM SIGCHI Lifetime Research Award winner. He served for six years on the NSF CISE Advisory Committee. Academic Appointments Professor, Computer Science Senior Fellow, Institute for Human-Centered Artificial Intelligence (HAI) Member, Bio-X Member, Wu Tsai Human Performance Alliance Member, Wu Tsai Neurosciences Institute Administrative Appointments Co-Director, Stanford Institute for Human-Centered AI (2024 - Present) Vice Director, Stanford Institute for Human-Centered AI (2022 - 2024) Associate Director, Stanford Institute for Human-Centered AI (2018 - 2022) Honors & Awards Fellow, ACM (2016) SIGCHI Academy Member, ACM SIGCHI (2011) Boards, Advisory Committees, Professional Organizations CISE Advisory Committee Member, National Science Foundation (2010 - 2016) Program Affiliations Symbolic Systems Program Professional Education BS, UC Berkeley, Electrical Engineering & Computer Science (1990) MS, Carnegie Mellon University, Computer Science (1993) PhD, Carnegie Mellon University, Computer Science (1996) Contact Academic University - Faculty Department: Computer Science Position: Professor Alternate Contact Aimee C. Garza Faculty Administrator acgarza@stanford.edu (650) 723-2300 (office) Additional Info Mail Code: 9035 ORCID: https://orcid.org/0000-0003-1520-8894 Current Research and Scholarly Interests Landay's current research interests include Technology to Support Behavior Change (especially for health and sustainability), Demonstrational User Interfaces, Mobile & Ubiquitous Computing, Cross-Cultural Interface Design, Human-Centered AI, and User Interface Design Tools. He has developed tools, techniques, and a top professional book on Web Interface Design. 2025-26 Courses Cross-platform Mobile App DevelopmentCS 147L (Aut) Game DevelopmentCS 146 (Win) Introduction to Human-Computer Interaction DesignCS 147 (Aut) Independent Studies (14) Advanced Reading and ResearchCS 499 (Aut, Win, Spr) Advanced Reading and ResearchCS 499P (Aut, Win, Spr) Curricular Practical TrainingCS 390A (Aut, Win, Spr) Curricular Practical TrainingCS 390B (Aut, Win, Spr) Independent ProjectCS 399 (Aut, Win, Spr) Independent ProjectCS 399P (Aut, Win, Spr) Independent StudySYMSYS 196 (Aut, Win, Spr) Independent WorkCS 199 (Aut, Win, Spr) Independent WorkCS 199P (Aut, Win, Spr) Master's Degree ProjectSYMSYS 290 (Aut, Win, Spr) Part-time Curricular Practical TrainingCS 390D (Aut, Win, Spr) Senior ProjectCS 191 (Aut, Win, Spr) Supervised Undergraduate ResearchCS 195 (Aut, Win, Spr) Writing Intensive Senior Research ProjectCS 191W (Aut, Win, Spr) Prior Year Courses 2024-25 Courses Cross-platform Mobile App DevelopmentCS 147L (Aut) Digital Canvas: An Introduction to UI/UX DesignCS 91SI (Win) Introduction to Human-Computer Interaction DesignCS 147 (Aut) 2023-24 Courses Cross-platform Mobile App DevelopmentCS 147L (Aut) Introduction to Human-Computer Interaction DesignCS 147 (Aut) User Interface Design ProjectCS 194H (Win) 2022-23 Courses Cross-Platform Mobile DevelopmentCS 47 (Aut, Win) Designing Solutions to Global Grand ChallengesCS 377E, DESIGN 297 (Spr) Introduction to Human-Computer Interaction DesignCS 147 (Aut) User Interface Design ProjectCS 194H (Win) Stanford Advisees Doctoral Dissertation Reader (AC) Bethanie Drake-Maples Doctoral Dissertation Advisor (AC) Nava Haghighi, Matthew Joerke Master's Program Advisor Maya Avital, Christina Ba, Neha Balamurugan, Cyan DeVeaux, Madison Fan, Sze Heng Douglas Kwok, Krystal Li, Irene Lin, Saniya Mahate, Ingrid Nordberg, Lizi Ottens, Naima Patel, Gaurav Tyagi, Miguel Alfonso Villanueva, Alissa Vuillier, Maria Wang, Andi Xu, Shirley Zhang Doctoral Dissertation Co-Advisor (AC) Michelle Lam, Yikai Li, Yujie Tao Doctoral (Program) Beleicia Bullock, Alan Cheng, Elizabeth Childs, Nava Haghighi, Matthew Joerke, Julia Markel, Parker Ruth, Shardul Sapkota, Danilo Symonette All Publications Leveraging Mobile Technology for Public Health Promotion: A Multidisciplinary Perspective. Annual review of public health Hicks, J. L., Boswell, M. A., Althoff, T., Crum, A. J., Ku, J. P., Landay, J. A., Moya, P. M., Murnane, E. L., Snyder, M. P., King, A. C., Delp, S. L. 2022 Abstract Health behaviors are inextricably linked to health and well-being, yet issues such as physical inactivity and insufficient sleep remain significant global public health problems. Mobile technology-and the unprecedented scope and quantity of data it generates-has a promising but largely untapped potential to promote health behaviors at the individual and population levels. This perspective article provides multidisciplinary recommendations on the design and use of mobile technology, and the concomitant wealth of data, to promote behaviors that support overall health. Using physical activity as an exemplar health behavior, we review emerging strategies for health behavior change interventions. We describe progress on personalizing interventions to an individual and their social, cultural, and built environments, as well as on evaluating relationships between mobile technology data and health to establish evidence-based guidelines. In reviewing these strategies and highlighting directions for future research, we advance the use of theory-based, personalized, and human-centered approaches in promoting health behaviors. Expected final online publication date for the Annual Review of Public Health, Volume 44 is April 2023. Please see http://www.annualreviews.org/page/journal/pubdates for revised estimates. View details for DOI 10.1146/annurev-publhealth-060220-041643 View details for PubMedID 36542772 Physical workplaces and human well-being: A mixed-methods study to quantify the effects of materials, windows, and representation on biobehavioral outcomes BUILDING AND ENVIRONMENT Douglas, I. P., Murnane, E. L., Bencharit, L., Altaf, B., Costa, J., Yang, J., Ackerson, M., Srivastava, C., Cooper, M., Douglas, K., King, J., Paredes, P. E., Camp, N. P., Mauriello, M., Ardoin, N. M., Markus, H., Landay, J. A., Billington, S. L. 2022; 224 View details for DOI 10.1016/j.buildenv.2022.109516 View details for Web of Science ID 000862289200005 Use of Crowdsourced Online Surveys to Study the Impact of Architectural and Design Choices on Wellbeing Frontiers in Sustainable Cities Altaf, B., Bianchi, E., Douglas, I. P., Douglas, K., Byers, B., Paredes, P. E., Ardoin, N. M., Markus, H. R., Murnane, E. L., Bencharit, L. Z., Landay, J. A., Billington, S. L. 2022: 19 View details for DOI 10.3389/frsc.2022.780376 StoryCoder: Teaching Computational Thinking Concepts Through Storytelling in a Voice-Guided App for Children Dietz, G., Le, J. K., Tamer, N., Han, J., Gweon, H., Murnane, E. L., Landay, J. A., ASSOC COMP MACHINERY ASSOC COMPUTING MACHINERY. 2021 View details for DOI 10.1145/3411764.3445039 View details for Web of Science ID 000758168000002 Variational Deep Knowledge Tracing for Language Learning Ruan, S., Wei, W., Landay, J., Assoc Comp Machinery ASSOC COMPUTING MACHINERY. 2021: 323-332 View details for DOI 10.1145/3448139.3448170 View details for Web of Science ID 000883342500031 EnglishRot: An Al-Powered Conversational System for Second Language Learning Ruan, S., Jiang, L., Xu, Q., Davis, G. M., Liu, Z., Brunskill, E., Landay, J. A., ASSOC COMP MACHINERY ASSOC COMPUTING MACHINERY. 2021: 434-444 View details for DOI 10.1145/3397481.3450648 View details for Web of Science ID 000747690200052 Personal identifiability of user tracking data during observation of 360-degree VR video. Scientific reports Miller, M. R., Herrera, F., Jun, H., Landay, J. A., Bailenson, J. N. 2020; 10 (1): 17404 Abstract Virtual reality (VR) is a technology that is gaining traction in the consumer market. With it comes an unprecedented ability to track body motions. These body motions are diagnostic of personal identity, medical conditions, and mental states. Previous work has focused on the identifiability of body motions in idealized situations in which some action is chosen by the study designer. In contrast, our work tests the identifiability of users under typical VR viewing circumstances, with no specially designed identifying task. Out of a pool of 511 participants, the system identifies 95% of users correctly when trained on less than 5min of tracking data per person. We argue these results show nonverbal data should be understood by the public and by researchers as personally identifying data. View deta",
  "content_length": 25976,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:48"
}