{
  "name": "James B. D. Joshi",
  "homepage": "http://www.sis.pitt.edu/jjoshi",
  "status": "success",
  "content": "James Joshi James B D Joshi Professor DINS, School of Computing and Information University of Pittsburgh 706A IS Building, 135 N. Bellefield Avenue Pittsburgh, PA 15260 Phone: (412) 624-9982 Fax: (412) 624-2788 Email: jjoshi [at] pitt.edu PITT           LERSAIS               SCI Welcome I am a Professor in the Department of Informatics and Networked Systems (DINS) at the School of Computing and Information (SCI) in the University of Pittsburgh. I joined Pitt in 2003 after completing my PhD from Purdue University. From 2019  Aug 2023, I served as a Program Director of the Secure and Trustworthy Cyberspace (SaTC) program at the NSF through the IPA program. Currently, I am serving as an intermittent Expert at the NSF Directorate of Technology, Innovation and Partnership (TIP), and recently led efforts to create the NSF Privacy-preserving Data Sharing and Analytics (PDaSP) program. My research interest is broadly in the areas of Cybersecurity and Privacy, with primary focus on advanced access control, distributed systems security and privacy, trust, and privacy in AI/ML areas. I am the founding director of Laboratory of Education and Research on Security Assured Information Systems (LERSAIS) Erdos # = 3 (Coauthor of Eugene Spafford with Erdos# = 2) Here are some current news highlights: § General Co-Chair: ACM CODASPY June, 2025 (Pittsburgh, US) § Member, OECD Data Free Flows with Trust (DFFT) Working Group (2024) § PC-Co-Chair: ICMC 2025 (India); IEEE IRI 2024 (US); IEEE BuildSEC 2024 (India) § Expert at NSF Directorate of Technology, Innovation and Partnerships (Sept 1, 2023 onwards) § Program Director of NSF CISE/CNS & SaTC program (Sept, 2019  Aug, 2023) § NSF Directors Award for Superior Achievement (Individual category) for my contribution in Privacy-Preserving Technologies related activities, Aug, 2023 · For exemplary public service and leadership in advancing privacy-preserving capabilities within data and analytics learning, showcasing nationally and internationally NSFs core values for scientific leadership, public service, innovation and collaboration § Serving in IEEE Fellow Selection Committee (2022, 2023) § Elected to IEEE Fellow effective Jan 1, 2023 for Contributions in Access Control and Privacy § IEEE Computer Society Golden Core Member, since Jan 1, 2022 § NSF Directors Award for Superior Achievement (Group category) for RINGS program, June, 2022 · For contribution in the creation of the Resilient and Intelligent Next-G Systems program § Fellow of the Asia-Pacific Artificial Information Association (AAIA) (2023) § Co-Chair of NITRD Fast Track Action Committee on Digital Assets R&D (2022-2023  Aug, 2023) § Co-Chair of NITRD Fast Track Action Committee for Advancing Privacy Preserving Data Sharing and Analytics (2022  March, 2023) § Co-Chair of NITRD Privacy Interagency Working Group (2020  Aug, 2023) § Advisory Board Member, Cyber Security Cooperative Research Centre, 2021 § Founding Steering Committee Chair of Ø IEEE International Conference on Trust, Privacy and Security for Intelligent Applications, and Systems (IEEE TPS 2023) Ø IEEE International Conference on Collaboration and Internet Computing (IEEE CIC 2023) Ø IEEE International Conference on Cognitive Machine Intelligence (IEEE CogMI 2023) § Served as EIC of IEEE Transaction on Services Computing from 2017 - 2021 Ø Increased Impact factor to 11.019 in 2022, from 3.520 in 2016 Ø Achieved: Class A journal by China Computer Federation in 2022 (was previously Class B); and A* in Australia CORE ranking (unranked previously) Past Highlights § Recipient of Society of Information Reuse and Integration (SIRI) Research Leadership and Mentoring award (at IEEE IRI 2018) § Elected Distinguished Member of the ACM, Nov, 2017 § Best Paper Award at IEEE BIGDATA Congress, 2017 § Editor-in-Chief of IEEE Transactions on Services Computing. Jan, 2017 onwards § Promoted to Professor on Jan 1, 2016 § Received in Fall, 2016: NSF:CICI: SAC-PA  Towards Security Assured Cyberinfrastructure in Pennsylvania § Received in Fall, 2015: NSA CAE Cybersecurity grant § Founding Steering Committee Chair of, IEEE CIC since 2015 § My Nepal Earthquake related Song & Video § NSF RAPID Grant with Prof. Louise Comfort (focused on Nepal Earthquake), Fall, 2015  2016 § SIRI Outstanding Service Award 2014 § Elected Fellow of SIRI (Society of Information Reuse and Integration), Aug, 2013 § Elected to ACM Senior Member, Oct, 2013 § Elevated to IEEE Senior Member, Aug, 2013 § Associate Editor of IEEE Transactions on Services Computing, 2013 § Editor-in-Chief of EAI Transactions on Collaborative Computing, 2013 - 2015 § Steering Committees: IEEE IRI, IEEE ICME, ACM SACMAT, CollaborateCom (Co-Chair, till Feb, 2015) § I am a recipient of the NSF-CAREER award, 2006 (Go to CAREER Project page) § I am a cofounder and director of LERSAIS. § Chair of SIS Council (pre-SCI) § I have had opportunity to be In news § I directed the Information Security program at the SIS (pre- SCI). § Conference Chairing (last couple of years) § PC Co-Chair of EDGE (at IEEE SERVICES), 2019 § PC Co-Chair of IEEE IRI 2019, TBD § General Co-Chair of IEEE CIC 2018, Philadelphia, PA, USA § Hosted IEEE CIC2016 in Pittsburgh, PA (Oct 31  Nov 3) § PC Co-Chairing: IEEE IRI 2016, Pittsburgh, PA, USA (July 28  30, 2016) § PC Co-Chairing  IEEE Big Data, Washington D.C., USA (Nov 15  18, 2016) § Program Co-Chair, IEEE CIC 2015, Hangzhou, China § Area Chair of Cloud Security at IEEE CLOUD 2014 § PC Co-chair for IEEE/EAI CollaborateCom 2015, China (Resigned; substituted by IEEE CIC) § PC Co-chair for IEEE IRI, 2015, USA § PC Co-Chair of IEEE ISM 2014, Taiwan § PC Co-chair for IEEE IRI, 2014, USA § PC Co-chair for IEEE IRI, 2013, USA § PC Co-Chair of IEEE SafeConfig 2013 § PC Co-Chair of IEEE/EAI C-Big, 2014 § General Co-Chair of TrustCol 2012, 2013, 2014 § General Co-chair of CollaborateCom, 2012, Pittsburgh, USA § I was General Co-chair for CollaborateCom, 2010, 2011 and 2012 § I was PC Co-chair for IEEE IRI 2011, 2012 § SACMAT 09, Italy (PC Chair); SACMAT 10, USA (General Chair) § CollaborateCom, 2008, USA (PC Chair); CollaborateCom, 2009, and 2010, USA (General Chair) § TrustCol Workshop, USA (General Chair) § IEEE IRI, 2010, USA (PC Chair) § COMPSAC - Social and Collaborative Networks (Track Co-Chair) § NASSUE-09 (Workshop) § Guest Editor Ø IEEE CIC 2017 Special issue in ACM TOIT Ø IRI Special Issue in Computers & Security Ø SACMAT Special issues in ACM TISSEC Ø SACMAT Special issues in Computer & Security Ø CollaborateCom08/CollaborateCom09/CollaborateCom10 special issues in Springer MONET EDUCATION § PhD, Computer Engineering, Purdue University (August, 2003). § MS, Computer Science, Purdue University, (May, 1998). § BE, Computer Science & Engineering, Motilal Nehru NIT, India (1993) § Short training: · Certificate in Leadership and Management Skills for Non-Managers (2022); 24  hour training (CPE Credits) · Certificate in Applied Management Principles; 60 in-class hour mini-MBA for PhD students offered by the Krannert School of Management, Purdue University (May 15- June 2, 2000) PROFESSIONAL EXPERIENCE § Professor, School of Computing and Information (SIS does not exist anymore), July 2017 onwards § Professor, School of Information Sciences, University of Pittsburgh (Jan 1, 2016 Onwards) § Associate Professor, University of Pittsburgh (Fall, 2008 - 2015) · School of Information Sciences · Department of Health Information Management (secondary appt. for several years) § Assistant Professor, University of Pittsburgh, · Information Sciences and Telecommunications (August, 2003  Summer 2008) · Department of Computer Science (Secondary appointment; Feb, 2006) § Research Assistant, Distributed Multimedia Systems Lab, ECE, Purdue University § Involved in research related to the information security projects funded by the Center of Education and Research in Information Assurance and Security (CERIAS) and National Science Foundation (NSF) (1998-2003). § Research Assistant, Purdue University (1997-1999) § National Water Quality Database Project, Agricultural/Biological Engineering, § Research Assistant, Purdue University (1996-97) § Crystal Visualization lab, Veterinary Medicine Dept., § Lecturer, Computer Science and Engineering, Kathmandu University, Nepal (1993-1996)",
  "content_length": 8327,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:53"
}