{
  "name": "James Ohene-Djan",
  "homepage": "https://www.gold.ac.uk/computing/staff/j-ohene-djan",
  "status": "success",
  "content": "Dr James Ohene-Djan | Goldsmiths, University of London Main menu Staff & students In this section James is interested in digital entrepreneurial studies, social video technologies, and location-based digital services Staff details Position Senior Lecturer and Assistant Pro Warden Department Computing Email j.djan (@gold.ac.uk) Website http://doc.gold.ac.uk/~mas01jo/ Dr James Ohene-Djan has over nine years' successful teaching experience at undergraduate level within Goldsmiths' Department of Computing, developing, preparing and delivering courses in telecommunications, database systems, electronic commerce, computer programming and information systems. In 2004 he was presented with the Goldsmiths award for the development of learning and teaching. His current administrative responsibilities within the Department of Computing range from Department Senior Tutor to Schools Liaison Officer. Areas of supervision Adaptive and personalisable hypermedia, hypertext telecommunications systems and e-commerce, user interface design and web-based database systems. Featured works James Ohene-Djan and Saduf Naqvi, An Adaptive WWW-based System to teach British Sign Language, in Proc. of the 5th IEEE International Conference on Advanced Learning Technologies ICALT 2005, pp. 575-579, Kaohsiung, Taiwan, July 2005. Saduf Naqvi, James Ohene-Djan, Rainer Spiegel, Testing the Effectiveness of Digital Representations of Sign Language with Children An International Symposium Instructional Technology and Education of the Deaf, Supporting Learners, K  College, National Technical Institute for the Deaf Rochester Institute of Technology Rochester, New York, USA, June 27 - June 30, 2005 James Ohene-Djan and M Gorle. An adaptive function for hypermedia-based advanced learning technology. In 3rd IEEE International Conference on Advanced Learning Technologies, Informatics and Telematics Institute, Centre for Research and Technology-Hellas ,Athens, Greece, July 9-11 2003. IEEE Learning Technologies Task Force, IEEE Computer Society Press. To appear. James Ohene Djan and Matt Gorle. Modelling adaptive functionality for hypermedia systems. In Poster: Hypertext 03, Fourteenth Conference on Hypertext and Hypermedia, Nottingham, UK, August 26 2003. ACM. James Ohene Djan, Christopher P. Bailey Matt Gorle, Gary B. Wills, and Hugh C. Davis. Is it possible to devise a unifying model of adaptive hypermedia and is one necessary? In Paul De Bra and Monica Schraefel, editors, AH2003: Proceedings of the Workshop on Adaptive Hypermedia and Adaptive Web-Based Systems, Fourteenth Conference on Hypertext and Hypermedia, pages 167?183, Nottingham, UK, August 26 2003. ACM. Available from http: //wwwis.win.tue.nl/ah2003/proceedings/. James Ohene-Djan and A A A Fernandes. Designing personalisable hyperdocuments for electronic books. In Workshop: E-books + E-Readers + E-jounrnals = E-education? (6th European Conference on Research and Advanced Technology for Digital Libraries), Rome, Italy, September 16-18 2002. James Ohene-Djan. Ownership transfer via personalisation as a value-adding strategy for web-based education. In P Brusilovsky, N Henze, and E. Mill?n, editors, Proceedings of the Workshop on Adaptive Systems for Web-based Education, 2nd International Conference on Adaptive Hypermedia and Adaptive Web Based Systems, Malaga, Spain, May 28 2002. James Ohene-Djan and A A A Fernandes. Modelling personalizable hyperlink-based interaction. In P Brusilovsky and P De Bra, editors, Proceedings of the 2nd Workshop on Adaptive Hypertext and Hypermedia (Ninth ACM Conference on Hypertext and Hypermedia HYPERTEXT?98), pages 87?91, Pittsburgh, USA, June 20-24 1998. ISSN 0926-4515. Publications and research outputs ArticleA computer aided drawing system evaluation with early and late blind users Fernando, Sandra; and Ohene-Djan, James . 2022. A computer aided drawing system evaluation with early and late blind users. Assistive Technology: The Official Journal of RESNA, 34(4), pp. 392-401. ISSN 1040-0435 An empirical evaluation of a graphics creation technique for blind and visually impaired individuals Fernando, Sandra; and Ohene-Djan, James . 2021. An empirical evaluation of a graphics creation technique for blind and visually impaired individuals. British Journal of Visual Impairment, 39(3), pp. 191-213. ISSN 0264-6196 Screen navigation system for visually impaired people Ohene-Djan, James ; and Fernando, Sandra . 2018. Screen navigation system for visually impaired people. Journal of Enabling Technologies, 12(3), pp. 114-128. ISSN 2398-6263 Show more information Drawing for Blind Learners: Assistive Technology for Graphical Design Ohene-Djan, James ; and Fernando, Sandra . 2016. Drawing for Blind Learners: Assistive Technology for Graphical Design. 2016 IEEE 16th International Conference on Advanced Learning Technologies (ICALT), pp. 436-440. Recovery Spaces: An Enhanced Learning Technology for Treatment and Rehabilitation Centres Ohene-Djan, James ; and Jones, Mark. 2014. Recovery Spaces: An Enhanced Learning Technology for Treatment and Rehabilitation Centres. Technology for Education (T4E), 2014 IEEE Sixth International Conference, WinkBall for Schools: An Advanced Video Modelling Technology for Learning Visual and Oral Communication Skills Ohene-Djan, James . 2010. WinkBall for Schools: An Advanced Video Modelling Technology for Learning Visual and Oral Communication Skills. Proceedings of the 2010 10th IEEE International Conference on Advanced Learning Technologies (ICALT '10), pp. 687-689. Road Safety and Deaf People: The Role of the Police Ohene-Djan, James ; Hersh, Marion; and Naqvi, Saduf. 2010. Road Safety and Deaf People: The Role of the Police. Journal of Prevention & Intervention in the Community, 38(4), pp. 316-331. ISSN 1085-2352 Investigating road safety issues and deaf people in the United kingdom: an empirical study and recommendations for good practice. Hersh, Marion; Ohene-Djan, James ; and Naqvi, Saduf. 2010. Investigating road safety issues and deaf people in the United kingdom: an empirical study and recommendations for good practice. Journal of Prevention & Intervention in the Community, 38(4), pp. 290-305. ISSN 1540-7330 A neuropsychological perspective on measuring sign language learning and comprehension Spiegel, Rainer; Naqvi, Saduf; Ohene-Djan, James ; Moore, David R; and Hsiao, Eling. 2007. A neuropsychological perspective on measuring sign language learning and comprehension. International Journal of Emerging Technologies in Learning, 2(1), ISSN 1868-8799 A personalisable electronic book for video-based sign language education Ohene-Djan, James ; Gorle, M.; Naqvi, S.; and Zimmer, Robert . 2003. A personalisable electronic book for video-based sign language education. Educational Technology & Society, 6(4), pp. 86-99. ISSN 11763647 Personalising Electronic Books Ohene-Djan, James ; and Fernandes, A.. 2003. Personalising Electronic Books. Journal of Digital Information, 3(4), ISSN 1368-7506 Modelling Personalisable Hypermedia: The Goldsmiths Model Ohene-Djan, James ; and Fernandes, Alvaro A.A.. 2002. Modelling Personalisable Hypermedia: The Goldsmiths Model. New Review of Hypermedia and Multimedia, 8(1), pp. 99-137. ISSN 1361-4568 Conference or Workshop ItemA real-time spatial measurement interface for emotional evaluation of temporal media. Ohene-Djan, James ; and Sushko, V.. 2006. 'A real-time spatial measurement interface for emotional evaluation of temporal media.'. In: The 20th BCS HCI Group conference in co-operation with ACM. Queen Mary, University of London, United Kingdom 11-15 September 2006. Measuring sign language comprehension through spatial response Nagvi, S.; Spiefel, R.; Moore, D.; Ohene-Djan, James ; and Hsiao, E.. 2006. 'Measuring sign language comprehension through spatial response'. In: Proceedings of Conference and Workshop on Assistive Technologies for Vision and Hearing Impairment: Technology for Inclusion, D. M. Hersh, Ed. Kufstein, Austrian Tyrol: Euro-Assist-VHI-4. UNDEFINED. Measuring sign language comprehension through spatial response. Ohene-Djan, James ; Naqvi, Saduf; Spiefel, R.; Moore, D.; and Hsiao, E.. 2006. 'Measuring sign language comprehension through spatial response.'. In: Conference and Workshop on Assistive Technologies for Vision and Hearing Impairment: Technology for Inclusion. Kufstein, Austria. Show more information E- subtitles: Emotional subtitles as a technology to assist the deaf and hearing-impaired when learning from television and film Ohene-Djan, James ; and Shipsey, Rachel. 2006. 'E- subtitles: Emotional subtitles as a technology to assist the deaf and hearing-impaired when learning from television and film'. In: 6th IEEE International Conference on Advanced Learning Technologies (ICALT). Kerkrade, Netherlands July 9-11 2006. Colour spectrums of opinion: An information visualisation interface for representing degrees of emotion in real time Ohene-Djan, James ; Sammon, A.; and Shipsey, R.. 2006. 'Colour spectrums of opinion: An information visualisation interface for representing degrees of emotion in real time'. In: Tenth International Conference on Information Visualisation (IV'06). London, United Kingdom. A real-time spatial measurement interface for emotional evaluation of temporal media Ohene-Djan, James ; and Sushko, V.. 2006. 'A real-time spatial measurement interface for emotional evaluation of temporal media'. In: The 20th BCS HCI Group conference in co-operation with ACM. Queen Mary, University of London, United Kingdom 11-15 September 2006. An Adaptive Function for Hypermedia-Based Advanced Learning Technology Ohene-Djan, James ; and Gorle, Matthew. 2003. 'An Adaptive Function for Hypermedia-Based Advanced Learning Technology'. In: IEEE International Conference on Advanced Learning Technologies (ICALT 2003). Athens, Greece 9-11 July 2003. A personalization framework for advanced learning technology Ohene-Djan, James ; and Fernandes, A.. 2000. 'A personalization framework for a",
  "content_length": 13689,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:15"
}