{
  "name": "James J. Martin",
  "homepage": "https://people.cs.clemson.edu/~jmarty",
  "status": "success",
  "content": "Jim Martin Jim Martin Professor : Computer Science Division School of Computing Clemson University Contact Information: Email:  jmarty at clemson.edu Office:  211 McAdams Mailing address: School of Computing 211 McAdams Hall Clemson University Clemson, South Carolina 29634-0974 Test your broadband access connection [ Courses | Vita     | Research | Outreach |  Lab's Research Publications |  Google Scholar Citations ] [ Prospective Students   |  Honors Information  | Clemson's UPE CS Honor Society | School of Computing | Clemson  ] Sites relevant for CS/ECE students: [IEEE |CS Society|Vehicular Technology Society|ACM|Upislon Pi Epsilon (UPE)] Timely/Interesting Sites: [FCC Initiatives |Network Neutrality|Recent IETF activities|Internet Society] NEWS As we enter 2022, let's hope for a better year.  At the end of Q1 of 2022 I realized that Clemson University is truly a great place to live, learn, and grow.  This is a personal statement, and is supported by my three kids who all graduated from Clemson. The sense of community is one of the most common feedback I get when I ask my network of students out in industry or academia about their Clemson experience. For any student, especially those approaching graduation,  or for those beyond traditional college years who might be (or should be) struggling to find understand yourselves,    I offer the following suggestions: Read, Read, Read.  Set goals for your self - Read one book per month?  Consider these two choices,  I recommend both. First,  in any field, knowledge if being added to the world's collective brain on a daily basis.  Stay current!!!  Be aware of trends in your field. For technical folks, make sure you always remember the foundations we tried to teach - math is a super power for everything.  For those who know something about AI, ML, or DL,  assume you know nothing. Go for books that get at the mathematics underneath the easy to use python library shell. Second, read other types of books.  Fiction, historical fiction, and non-fiction are all fine. If you seem to have an itch in your mind, perhaps you are seeking something,  do what I do.  I don't have time to decide on choices for books. I look over the latest top 10 fiction and non-fiction  books on the NY Times list. I also look at the annual 'must read' lists from folks like President Obama (and Ms Obama),  Bill and/or Melinda Gates,  and other lists from folks that I admire.   Look at the lists of top 100 classics that we all should read.  Look at books written by past presidents The following books have helped me significantly in the last several years: Sapiens: A Brief History of Humankind, by   Yuval Harari  -  #1 person who I'd like to join my tribe. The Alchemist  by Paulo Coelho  (check out his blog) -  The book is a parable that strikes home if you are at a point in your life's journey where you are able to recognize the practical truths that are artfully woven through the story.  This book was inspiring and rejuvenating - it has helped me refocus and think about what life is about. Blink by Malcom Gladwell :  A fascinating book that will can help you find your true destiny primarily by better understanding yourself and people.  We are all of one tribe but in the blink of an eye from birth to becoming an adult, we collectively alter our big beautiful world to a world that can appear broken, forlorn and over-whelming.  All students all teachers (K-12 as well as higher ed) should take time to read at least the first two chapters.  In Chapter 2, the author points to a study exploring the power of racism and just how uneducated we all are simply because we choose to not openly discuss the issue. Narrative of the Life of Frederick Douglass  by Frederick Douglass CS Lewis \"Mere Christianity\", and \"A Grief Observed\" (I lost a very good friend in 2021- the latter book helped me greatly preparing for his eulogy). Saving Us: A Climate Scientist's Case for Hope and Healing in a Divided World,  by Katharine HayHoe. And for lighter bedtime reading: Pat Conroy's The Water Wide And the two most recent books from  Amor Towles: A Gentleman in Moscow  and Rules of Civility. Most recently, I've re-read historical documents from the revolutionary war era: The Federalist Papers, The Declaration of Independence, the Constitution, and the Bill of Rights,  all available at https://www.archives.gov. I also have read some of the work that Adam Smith (the Father of capitalism) published back in the revolutionary war era.  Smith's \"Wealth of Nations\" swayed our founding fathers to frame our nation as a democracy, in part through a capitalistic economy that truly was a beacon of democracy to the world for centuries.  Smith's earlier, and more philosophic work, such as \"The Theory of Moral Sentiments\" acknowledged that a Nation based on a capitalistic economy  did need  an 'invisible hand' to ensure all the people had equal access to opportunities. The ethical and moral issues that have evolved the past decade have truly taken us back to 1860. In that era, lack of education and opportunities reflect the key strategies behind the white supremacist. I  urge anyone reading my rant to re-learn what it means to be a 'critical thinker'. Knowledge is empowering.  I challenge our students, and those that randomly landed on this page,  to educate yourselves by reading about our history. There was a peak in the public's awareness of Smith's 'invisible hand\" in 1968 when G. Hardin described the results of having an ineffective invisible hand in large democratic societies by introducing the concept of the 'Tragedy of the Commons\".  He predicts the potential harm to that society if the key decision makers in a society ignore the greater good obligation. Unfortunately, we have seen the consequences building the past decades.  This again is why I believe our Nation is at a tipping point. On a brighter note, I have never seen so many young people tuning into national and international events.   Citizen activism is at an all time high. Economists have been surprised to learn that during Covid,  companies that embrace empathy, compassion, and demonstrated a moral duty to help others get through this crisis, have in many cases not only survived the pandemic but are positioned much better than their competitors for the economic rebound. The attack on the Capital on 1/6/2021 was a symptom of a broken government. It is incomprehensible to me that  30% of the population supports a party whose leadership believes a global event, one that killed more humans than WWII, is orders of magnitude less important than a healthy stock market. Our country is at a critical point-  30% of the country have allowed others to filter their critical thinking and consequently their identities have assumed whatever thinking is needed to justify the claim. To abandon critical thinking is clear sign of a democratic republic becoming an aristocracy. To ignore what is happening is a purposeful decision to side with those that are not thinking critically. Once an aristocracy is in place, it can only be replaced through a revolution. Many red flags are suggesting without a renewed cohort of decision makers, who have the capacity for critical, ethical thinking, coming into power in the next election, I  see our country falling over the brink and bouncing back up as an aristocracy. For those experiencing that mysterious itch, that little voice, or that see these red flags, I urge you to seek out citizens activist groups. Back to academics,  the following points to information related to helpful CS/ECE certifications and to cybersecurity resource web pages Online courses Cisco Network Academy edX courses Google Digital Garage Certifications For those interested in careers in wireless systems-  the Certified Wireless Network Professionals (CWNP) training and in particular their CWNA (Certified Wireless Network Administrator) is one of the few certifications that gives the biggest 'bang' (as in future job earnings) for the 'buck' (as in the cost is cheap!!). Excellent resources  for CyberSecurityGuide SimplyCyber Check out this page before you interview for any job that requires Linux knowledge Check out th page for information on the many certifications a CS or ECE undergrad or grad student might choose to pursue. Closed out our NSF/USIgnite project involving Connected Vehicles Main project page CDC's page about COVID-19 See what the FCC is up to.....they have been very, very busy! They have re-purposed spectrum that had been isolated for use to support vehicular-to-vehicular communications :   The block of 7 10MHz channels is divided inUSDOT's vehicle-to-vehicle dedicated spectrum (5.9Ghz) - future cooperative autonomous vehicles must now deal with Co-existence with WiFi (allowing a larger number of channels to bond forming large wifi pipes) A divided spectrum block.  One for the IEEE/WiFi  and one for 3GPP. Due to this and other related FCC mandates, the big losers are the citizens of the Nation. Uncertainty surrounding the wide scale adoption of US DOT WAVE/DSCR operating at 5.9GHz has crippled the US DOT's efforts to require all new vehicles to communicate to support safey vehicular applications.  Unfortunately, another 40,000 US Citizens will die in vehiclular related accidents in 2021.    (refer to Car and Driver's article about the number killed in vehicles and pedestrians). Renewed interest in providing broadband access to all Americans - Stay tuned for our ongoing work assessing and documenting the state of Broadband Access in rural areas in South Carolina. Clemson is considered a rural area- unfortunately many of us see terrible cable service,  Internet access, and LTE coverage in the upstate. Interested in what NSF/CISE has planned- see these slides from a recent talk to Clemson by CISE Directorate Leadership. Super exciting opportunities for funded research in multidisciplinary academic areas.  Of particular interest are ideas that involve one or more of these to",
  "content_length": 14994,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:08"
}