{
  "name": "James Henri Tompkin",
  "homepage": "http://www.jamestompkin.com",
  "status": "success",
  "content": "James Tompkin Research Teaching Lab Me Undergrads in the North East: Applications are open for our Spring 2026 exploreCSR program, Socially-Responsible Artificial Intelligence. I am a visual computing researcher—computer vision, computer graphics, and human-computer interaction. My lab develops techniques for image and video creation, editing, analysis, and interaction. This requires image and scene reconstruction techniques, especially from multi-camera systems and for complex dynamic scenes, and with applications on 2D, multi-view, and VR/AR displays. Selected Publications All (Chronological) Core Areas Reconstruction Editing Multi-camera Interactive Themes View Synthesis Time of Flight Light Fields XR GenAI Visualization Perception Efficient Object Reconstruction with Differentiable Area Light Shading Yaoan Gao, Jiamin Xu, James Tompkin, Qi Wang, Zheng Dong, Hujun Bao, Yujun Shen, Huamin Wang, Changqing Zou, Weiwei Xu SIGGRAPH Asia, 2025 Zero-Shot Monocular Scene Flow Estimation in the Wild Yiqing Liang, Abhishek Badki, Hang Su, James Tompkin, Orazio Gallo Computer Vision and Pattern Recognition (CVPR), 2025 Project webpage Github Time of the Flight of the Gaussians Runfeng Li, Mikhail Okunev, Zixuan Guo, Anh Duong, Christian Richardt, Matthew O'Toole, James Tompkin Computer Vision and Pattern Recognition (CVPR), 2025 Project webpage Github Local Gaussian Density Mixtures for Unstructured Lumigraph Rendering Xiuchao Wu, Jiamin Xu, Chi Wang, Yifan Peng, Qixing Huang, James Tompkin, Weiwei Xu SIGGRAPH Asia, 2024 Project webpage Github The GAN is Dead; Long Live the GAN! A Modern GAN Baseline Yiwen Huang, Aaron Gokaslan, Volodymyr Kuleshov, James Tompkin Neural Information Processing Systems (NeurIPS), 2024 Github HuggingFace OpenReview (public reviews and response) ScaNeRF: Scalable Bundle-Adjusting Neural Radiance Fields for Large-Scale Scene Rendering Xiuchao Wu, Jiamin Xu, Xin Zhang, Hujun Bao, Qixing Huang, Yujun Shen, James Tompkin, Weiwei Xu ACM Transactions on Graphics (SIGGRAPH Asia), 2023 Project webpage Github Neural Fields for Structured Lighting Aarrushi Shandilya, Benjamin Attal, Christian Richardt, James Tompkin, Matthew O'Toole International Conference on Computer Vision (ICCV), 2023 Project Webpage Are Multi-view Edges Incomplete for Depth Estimation? Numair Khan, Min H. Kim, James Tompkin International Journal of Computer Vision (IJCV), 2024 Project Webpage Scalable Neural Indoor Scene Rendering Xiuchao Wu, Jiamin Xu, Zihan Zhu, Hujun Bao, Qixing Huang, James Tompkin, Weiwei Xu ACM Transactions on Graphics (SIGGRAPH), 2022 Project Webpage Github Neural Fields in Visual Computing and Beyond Yiheng Xie, Towaki Takikawa, Shunsuke Saito, Or Litany, Shiqin Yan, Numair Khan, Federico Tombari, James Tompkin, Vincent Sitzmann, Srinath Sridhar Eurographics State of the Art Report + CVPR Tutorial + SIGGRAPH Course, 2022 Project Webpage TöRF: Time-of-Flight Radiance Fields for Dynamic Scene View Synthesis Benjamin Attal, Eliot Laidlaw, Aaron Gokaslan, Changil Kim, Christian Richardt, James Tompkin, Matthew O'Toole Advances in Neural Information Processing Systems (NeurIPS), 2021 Project Webpage Github MatryODShka: Real-time 6DoF Video View Synthesis using Multi-Sphere Images Benjamin Attal, Selena Ling, Aaron Gokaslan, Christian Richardt, James Tompkin European Conference on Computer Vision (ECCV), 2020 Project Webpage Github Generating Handwriting via Decoupled Style Descriptors Atsunobu Kotani, Stefanie Tellex, James Tompkin European Conference on Computer Vision (ECCV), 2020 Project Webpage Github View-consistent 4D Light Field Superpixel Segmentation Numair Khan, Qian Zhang, Lucas Kasser, Henry Stone, Min H. Kim, James Tompkin International Conference on Computer Vision (ICCV), 2019 Project Webpage Github This work also produces an occlusion-aware piecewise planar scene reconstruction as a byproduct! Joint 5D Pen Input for Light Field Displays James Tompkin, Samuel Muff, James McCann, Hanspeter Pfister, Jan Kautz, Marc Alexa, Wojciech Matusik User Interface Software and Technology (UIST), 2015 Project Webpage Also at SIGGRAPH Emerging Technologies 2012: Interactive Light Field Painting Blind Video Temporal Consistency Nicolas Bonneel, James Tompkin, Kalyan Sunkavalli, Deqing Sun, Sylvain Paris, Hanspeter Pfister ACM Transactions on Graphics (SIGGRAPH Asia), 2015 Project webpage Related project: Blind Video Spatio-Temporal Consistency Interactive Intrinsic Video Editing Nicolas Bonneel, Kalyan Sunkavalli, James Tompkin, Deqing Sun, Sylvain Paris, Hanspeter Pfister ACM Transactions on Graphics (SIGGRAPH Asia), 2014 Project Webpage Paper | Video Content-adaptive Lenticular Prints James Tompkin, Simon Heinzle, Jan Kautz, Wojciech Matusik ACM Transactions on Graphics (SIGGRAPH), 2013 Project Webpage Printing light field displays with varying spatio-angular resolution. Videoscapes: Exploring Sparse Unstructured Video Collections James Tompkin, Kwang In Kim, Jan Kautz, Christian Theobalt ACM Transactions on Graphics (SIGGRAPH), 2012 Project webpage Efficient Object Reconstruction with Differentiable Area Light Shading Yaoan Gao, Jiamin Xu, James Tompkin, Qi Wang, Zheng Dong, Hujun Bao, Yujun Shen, Huamin Wang, Changqing Zou, Weiwei Xu SIGGRAPH Asia, 2025 InfoVids: Reimagining the Viewer Experience with Alternative Visualization-Presenter Relationships Ji Won Chung, Tongyu Zhou, Ivy Chen, Kevin Hsu, Ryan A. Rossi, Alexa Siu, Shunan Guo, Franck Dernoncourt, James Tompkin, Jeff Huang 2025 Zero-Shot Monocular Scene Flow Estimation in the Wild Yiqing Liang, Abhishek Badki, Hang Su, James Tompkin, Orazio Gallo Computer Vision and Pattern Recognition (CVPR), 2025 Project webpage Github Time of the Flight of the Gaussians Runfeng Li, Mikhail Okunev, Zixuan Guo, Anh Duong, Christian Richardt, Matthew O'Toole, James Tompkin Computer Vision and Pattern Recognition (CVPR), 2025 Project webpage Github Local Gaussian Density Mixtures for Unstructured Lumigraph Rendering Xiuchao Wu, Jiamin Xu, Chi Wang, Yifan Peng, Qixing Huang, James Tompkin, Weiwei Xu SIGGRAPH Asia, 2024 Project webpage Github The GAN is Dead; Long Live the GAN! A Modern GAN Baseline Yiwen Huang, Aaron Gokaslan, Volodymyr Kuleshov, James Tompkin Neural Information Processing Systems (NeurIPS), 2024 Github HuggingFace OpenReview (public reviews and response) Monocular Dynamic Gaussian Splatting: Fast, Brittle, and Scene Complexity Rules Yiqing Liang, Mikhail Okunev, Mikaela Angelina Uy, Runfeng Li, Leonidas J. Guibas, James Tompkin, Adam Harley Transactions on Machine Learning Research, 2025 Project webpage Github Flowed Time of Flight Radiance Fields Mikhail Okunev, Marc Mapeke, Benjamin Attal, Christian Richardt, Matthew O'Toole, James Tompkin European Conference on Computer Vision (ECCV), 2024 Project webpage Active Appearance and Spatial Variation Can Improve Visibility in Area Labels for Augmented Reality Hojung Kwon, Yuanbo Li, Xiaohan Ye, Praccho Muna-McQuay, Liuren Yin, James Tompkin Transactions on Visualization and Computer Graphics (IEEE Visualization short paper), 2024 Paper | PDF | PPTX | Recorded Presentation @ IEEE Vis 2024 OmniSDF: Scene Reconstruction using Omnidirectional Signed Distance Functions and Adaptive Binoctrees Hakyeong Kim, Andreas Meuleman, Hyeonjoong Jang, James Tompkin, Min H. Kim Computer Vision and Pattern Recognition (CVPR), 2024 Project webpage Github Disentangling 3D from Large Vision-Language Models for Controlled Portrait Generation Yiwen Huang, Akin Caliskan, Berkay Kicanaoglu, James Tompkin, Hyeongwoo Kim 2024 Gives insight into why disentangling with CLIP is difficult—it's the prompt noise! Removing the Quality Tax in Controllable Face Generation Yiwen Huang, Zhiqiu Yu, Xinjie Yi, Yue Wang, James Tompkin Winter Conference on Applications of Computer Vision (WACV) and AI for Content Creation (AI4CC) @ CVPR 2023, 2024 Project webpage GauFRe🧇: Gaussian Deformation Fields for Real-time Dynamic Novel View Synthesis Yiqing Liang, Numair Khan, Zhengqin Li, Thu Nguyen-Phuoc, Douglas Lanman, James Tompkin, Lei Xiao arXiv (Dec.~2023) + WACV, 2025 Project webpage Github ScaNeRF: Scalable Bundle-Adjusting Neural Radiance Fields for Large-Scale Scene Rendering Xiuchao Wu, Jiamin Xu, Xin Zhang, Hujun Bao, Qixing Huang, Yujun Shen, James Tompkin, Weiwei Xu ACM Transactions on Graphics (SIGGRAPH Asia), 2023 Project webpage Github Semantic Attention Flow Fields Yiqing Liang, Eliot Laidlaw, Alexander Meyerowitz, Srinath Sridhar, James Tompkin International Conference on Computer Vision (ICCV), 2023 Project Webpage Github Neural Fields for Structured Lighting Aarrushi Shandilya, Benjamin Attal, Christian Richardt, James Tompkin, Matthew O'Toole International Conference on Computer Vision (ICCV), 2023 Project Webpage Are Multi-view Edges Incomplete for Depth Estimation? Numair Khan, Min H. Kim, James Tompkin International Journal of Computer Vision (IJCV), 2024 Project Webpage On Human-like Biases in CNNs for the Perception of Slant from Texture Yuanhao Wang, Qian Zhang, Celine Aubuchon, Jovan Kemp, Fulvio Domini, James Tompkin ACM Transactions on Applied Perception, 2023 Github How Can Deep Neural Networks Aid Visualization Perception Research? Three Studies on Correlation Judgments in Scatterplots Fumeng Yang, Yuxin Ma, Lane Harrison, James Tompkin, David H. Laidlaw SIGCHI, 2023 Project Webpage Learning Vector Quantized Shape Codes for Amodal Blastomere Instance Segmentation Won-Dong Jang, Donglai Wei, Xingxuan Zhang, Brian Leahy, Helen Yang, James Tompkin, Dalit Ben-Yosef, Daniel Needleman, Hanspeter Pfister IEEE International Symposium on Biomedical Imaging (ISBI), 2023 Scalable Neural Indoor Scene Rendering Xiuchao Wu, Jiamin Xu, Zihan Zhu, Hujun Bao, Qixing Huang, James Tompkin, Weiwei Xu ACM Transactions on Graphics (SIGGRAPH), 2022 Project Webpage Github Neural Fields in Visual Computing and Beyond Yiheng Xie, Towaki Takikawa, Shunsuke Saito, Or Litany, Shiqin Yan, Numair Khan, Federico Tombari, James Tompkin, Vincent Sitz",
  "content_length": 94141,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:08"
}