{
  "name": "James Harold Davenport",
  "homepage": "http://people.bath.ac.uk/masjhd",
  "status": "success",
  "content": "James Davenport's Home Page Professor James Harold Davenport Departments: Computer Science and Mathematical Sciences Job Title: Hebron & Medlock Professor of Information Technology and (until 2005) University Director of Information Technology From January-June 2017 he was a Fulbright CyberSecurity Scholar at New York University: his blog is here. Since June 2020, he has largely been bicycling (electric bicycle, but using as little as possible) to work. Bathwick Hill is two centiEverests in height, hence his pleasure in this certificate (dated 1 August 2023). He is on the Advisory Board of Academy for the Mathematical Sciences. Images: Davenport in the robes of a Cambridge PhD, wearing the Bronze Medal of the University of Helsinki (awarded 2001). Davenport processing in Bath in the robes of a Timişoara Doctor of Science. Davenport lecturing at RISC (Austria) in 2007. Davenport, fully at the controls, cutting the first sod, both manually and mechanically, for the new home of the Department of Computer Science (23 September 2009). Davenport recently interviewed by BBC Radio Bristol. Davenport about to be admitted to Freedom of the City of London: the model sheep is symbolic of a Freeman's right to drive sheep free of tolls across London Bridge, but JHD was warned that the Metropolitan Police take a dim view of those doing so outside organised sheep drives. He is a Certified Sheep Driver. Timişoara: Davenport has strong links with Transylvania, in particular Universitatae de Vest din Timişoara and the SYNASC Conference series where he can be seen here lecturing in Transylvania (26 September 2009). Davenport representing computer algebra at an Honorary Degree ceremony at Universitatae de Vest din Timişoara for Distinguished Professor Stephen Watt. Professor Maruster holding a bit, in more senses than one, of the first computer in Transylvania. Davenport explaining the Transylvanian origins of non-Euclidean Geometry (in English and French). Universitatae de Vest din Timişoara recently conferred an Honorary Doctorate on Davenport. These are the reasons. Davenport tried to say \"thank you\" (in Romanian and English). The degree certificate is pretty impressive, as were the supporters. Works in Computer Algebra, where he is an author of a textbook, many papers (old HTML version here) (see here for recent ones, and his ResearchGate and Google Scholar profiles), posters and presentations, and editor-in-chief of conference volumes: CICM 2011, SYNASC 2016 and ICMS 2018. See Mathematical Reviews on JHD for a list that they consider \"mathematical\" (needs a subscription). He is a member of the MEGA (Méthodes Effectives en Géometrie Algébrique) Advisory Board. Having been General Chair of the 2018 International Congress on Mathematical Software, he edited a Special Issue of Mathematics in Computer Science. He also played a significant role in the the 2020 International Congress on Mathematical Software. His major research effort is following up his grant in Real Geometry and Connectedness via Triangular Description, and leading the exploration of the link between Symbolic Computation and Satisfiability Checking. He is Director of the Bath node of the Institute of Coding with special responsibility for the Observatory work package. He also led for Bath in the development of the Institute of Coding bid into the OfS AI Masters project, which is now starting to deliver. In particular, he participated in the writing of the \"Get ready for a Masters in Data Science and AI\" preparatory course. This is now launched: First launch (31/08/2020) and Second launch (07/12/2020) In 2016 and 2017, and jointly with Cécile Mailler in 2018, he supervised students on the IMI Undergraduate Research Internships programme. In 2017, this was funded by the SC-square project. He has other PhD research topics: see this topic list. One of his research students talks about the experience. Recent students Ph.D. Ph.D. M.Sc. B.Sc. Ph.D. Ph.D. B.Sc. M.Sc. Ph.D. Ph.D. DBA Ali El Kaafarani David Wilson Efthymia Viopoulou Stavros Kaparelos Benjamin Pring Jessica Jones Alexandra Gkolia Matthew Thorne Zak Tonks Akshar Nair Dolf Jordaan Traceability, Linkability and Policy Hiding in Attribute-Based Signature Schemes Advances in Cylindrical Algebraic Decomposition An investigation of JavaScript isolation mechanisms Sandboxing implementations Extending Cachegrind : L2 cache inclusion and TLB measuring Cryptography against an adversary with quantum resources Auto-tuning compiler options for HPC Machine Learning to Cluster Questions Poly-algorithmic Techniques in Real Quantifier Elimination Curtains in Cylindrical Algebraic Decomposition The Development of a Data-Driven Framework to Measure Teaching Presence in a Learning Management System within a Hybrid Teaching and Learning Model: A Theory and Practice Enhancement Case Study Thesis Thesis Dissertation Dissertation; Code; Slides at FOSDEM 2015 Thesis Thesis Dissertation Dissertation; code Thesis Thesis Thesis; Richard and Shirley Mawditt Prize, with supervisors He chaired the Research Committee's Working Party on Powerful Computing: report here, and is on the High-Performance Computing Facilities Advisory Group: see service details here. The recently-decommissioned system was called Balena. Looking at the Balena system. Whole album is here. He led for Bath in the GW4 project for an innovative ARM-based supercomputer, Phase 1 of which is pictured here. He chaired the Project Board looking at whether to replace Balena with a cloud offering, and is now on various working parties implementing that recommendation: the main vehicle is Nimbus. Activities: Vice-President (2014-2020) and various other things of the British Computer Society. Awarded a National Teaching Fellowship for 2014. Here are his views on the apprentice model for teaching programming and low-stakes frequent assessment for this. Awarded a Software Sustainability Fellowship for 2016. He represents the University on the Bristol Military Education Committee. He represents the University on the Institute of Coding Data Science and AI Conversion Courses consortium: Bath's own course is detailed here. He is heavily involved with the International Collegiate Programming Contest, both for UK/Ireland and for the North-West Europe Region, hosting both the 2016 and 2017 Regional contests. He represents the Institute for Mathematics and its Applications on the London Mathematical Society's Computer Science Committee. Founding Editor-in-Chief LMS Journal of Computation and Mathematics: . The first Ontario Research Chair in Computer Algebra Director of Studies, HPCDoctoral Taught Course Centre. Former Royal Society Industrial Fellow. Updater of his father's book The Higher Arithmetic. Until June 2008, Director of Studies for undergraduates, and would still like them to speak English. He is Pensions Representative for the local association of the Universities and Colleges Union. He coordinates Bath's entries for the ACM Intercollegiate Programming Contest, and in particular the Bath site of the UK/Ireland sub-regional contest. In 2016 and 2017, Bath was host to the NorthWest Europe Regional Finals: see the news feed. He spoke on security of cloud computing at BCS Bristol on March 2012, and recently commented on Data Protection. He has been heavily involved in OpenMath, and recently spoke on this, and was interviewed on Hungarian Tv Liceum. He was also Treasurer of the European Mathematical Trust. His notes on various scientific meetings are listed here. In 1958, he was taught Siberian Peasant Multiplication by Abram Besicovitch, his father's predecessor in the Rouse Ball chair. It turn, in 2023 he taught his great-nephew the same technique. Letter in the Times Higher Education Supplement: original here. Telephone: +44 1225 386181 Fax: +44 1225 383436 E-mail Address: J.H.Davenport@bath.ac.uk Postal Address: Department of Computer Science University of Bath Bath BA2 7AY United Kingdom Academic Year 2021/22 he taught CM30070: Computer Algebra, CM50209 Cybersecurity, CM50283 Cybersecurity and CM500323 Cybersecurity (three times) . He also supervised projects in Computer Science and Mathematical Sciences, and examined various tasks in EPSRC Centre for Doctoral Training in Advanced Automotive Propulsion Systems (AAPS). Academic Year 2020/21 he taught CM30070: Computer Algebra, CM50209 Cybersecurity, CM50283 Cybersecurity (twice) and CM500323 Cybersecurity (three times) . He also supervised projects in Computer Science and Mathematical Sciences. Academic Year 2019/20 he taught CM30070: Computer Algebra, CM50209 Cybersecurity, and CM50283 Cybersecurity. He also supervised projects in Computer Science and Mathematical Sciences. Academic Year 2018/19 he taught CM30070: Computer Algebra, CM50209 Cybersecurity, and XX10190: Programming and Discrete Mathematics. He also supervised projects in Computer Science. Academic Year 2017/18 he taught CM30070: Computer Algebra and XX10190: Programming and Discrete Mathematics. He also supervised projects in Computer Science. Academic Year 2016/17 he taught CM30070: Computer Algebra and XX10190: Programming and Discrete Mathematics. He also supervised projects in Computer Science. Academic Year 2015/16 he taught CM30070: Computer Algebra and XX10190: Programming and Discrete Mathematics, and contributed to CM20215: Systems Development. He also supervised projects in Computer Science and Mathematical Sciences. Academic Year 2014/15 he taught CM30070: Computer Algebra and XX10190: Programming and Discrete Mathematics, and contributed to CM20215: Systems Development. Academic Year 2013/14 he taught CM30070: Computer Algebra and XX10190: Programming and Discrete Mathematics, and contributed to CM20215: Systems Development. Academic Year 2012/13 he taught CM30070: Computer Algebra and XX10190: Programming and Discrete Mathematics (HEA workshop 4 February 2013), and contributed to CM20215: Systems Development and CM30072: safety-Critical Systems. Ac",
  "content_length": 11364,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:06"
}