{
  "name": "James D. Herbsleb",
  "homepage": "http://herbsleb.org",
  "status": "success",
  "content": "James D. Herbsleb's Home page, S3D, SIC, SCS, CMU James D. Herbsleb Professor, School of Computer Science Software and Societal Systems Department Carnegie Mellon University Home Bio Research Publications Courses People Presentations Links Contact Jim Herbsleb's Home Page Software is in everything.  Software shapes the digital environment, which in turn shapes how we find information, conduct commerce, share and socialize, do our work, and amuse ourselves. Our old ways of designing software for a specific known purpose are no longer adequate. Rather than ask How can I specify, design, and build the system that my stakeholders need? Maybe we should ask How can I set up the socio-technical ecosystem that will allow users, developers, businesses, and everyone else to cooperate and compete to build what everyone needs? Even though those needs are currently unknowable and evolving . . . These are the kinds of questions that drive my research group.  (See my research page.)  We are funded by the National Science Foundation, the Sloan Foundation, Accenture, Bosch, Google, Siemens, IBM, and the Future of Work Center, Heinz College, Carnegie Mellon University. Recent Events Keynote address at the ACM SIGSOFT International Symposium on the Foundations of Software Engineering (FSE 2016.) \"Building a Theory of Coordination: Why and How,\" November 17, 2016, Seattle, WA.  Link to paper in FSE proceedings. SIGSOFT Outstanding Research Award (2016).  Press release. Keynote address at the International Conference on Software Engineering (ICSE 2014) \"Socio-Technical Coordination,\" June 4, 2014, Hyderabad, India. Link to video on YouTube. Alan Newell Award for Research Excellence (2014), awarded by the CMU School of Computer Science (with Kathleen Carley, Marcelo Cataldo, and Patrick Wagstrom). Press release. NSF Award: Personalized Information Access for Online Deliberation Systems. Human-Centered Computing Program, awarded August 1, 2013. NSF Award: Designing Transparent Work Environments.  Virtual Organizations as Social Systems Program, awarded August 1, 2013. Keynote address at International Conference on Open Source Systems (OSS 2011), \"From Openness to Transparency: The Role of Social Media in Open Source Ecosystems,\" October 6, 2011, Salvador, Brazil. NSF Award: Large-Scale Human-Centered Coordination Systems to Support Interdependent Tasks in Context. Human-Centered Computing Program, awarded Sept. 1, 2011. Received Distinguished Paper Award at ICSE 2011, for \"Configuring Global Software Teams: A Multi-Company Analysis of Productivity, Quality, and Profits\" (with Narayanasamy Ramasubbu, Marcelo Cataldo, Rajesh Krishnan Balan) May, 2011, Honolulu, HI. NSF Award: The Scientific Software Network Map.  Science of Science Policy Program, awarded May 15, 2011. Keynote address at Workshop on SHAring and Reusing architectural Knowledge, \"Architectural Knowledge and Organizational Context: The Case for Socio-Technical Styles,\" May 24, 2011, Honolulu, HI. Received the Most Influential Paper award at ICSE 2010, for \"A case study of open source software development: The Apache server\" published in ICSE 2000 (with Audris Mockus and Roy Fielding). Best Paper Award, Academy of Management, for \"Communication, Team Performance, and the Individual: Bridging Technical Dependencies\" (with Patrick Wagstrom and Kathleen Carley) August, 2010, Montreal, Canada. Invited address at International Conference on Aspect-Oriented Development, \"Talking about Concerns\" March 23, 2011, Porto de Galinhas, Brazil. Keynote address at Mining Software Repositories, \"MSR: Mining for Scientific Results?\" May 2, 2010, Capetown, South Africa. Keynote address at Workshop on Replication in Software Engineering, \"Replication and Robust Results.\" May 4, 2010, Capetown, South Africa. Keynote address at the IEEE International Requirements Engineering Conference, \"On the Diminishing Prospects for an Engineering Discipline of Requirements.\" Sept. 2, 2009, Atlanta, GA. © 2006-2013 James D. Herbsleb. Site by ABWebworks.",
  "content_length": 4032,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:55"
}