{
  "name": "James Clawson",
  "homepage": "https://jamesclawson.com",
  "status": "success",
  "content": "James Clawson – Mobile HCI & Health Researcher Skip to the content About Me I’m an Assistant Professor of Informatics in the School of Informatics and Computing at Indiana University Bloomington and a 2015 NIH Mobile Health (mHealth) Scholar. I am a member of the Proactive Health (ProHealth) Informatics group where we design, develop, and evaluate intelligent, learning systems to empower lay people to better understand, manage, and improve their health. ProHealth researchers make valuable contributions to the fields of health informatics, human computer interaction, machine learning, pervasive computing, and privacy. In my work I focus on designing and evaluating novel mobile health technologies that improve communication and collaboration with the goal of increasing patient engagement with their health and encouraging everyday wellness. I take a long view when it comes to considering everyday health and focus my efforts on designing holistic tools that support individuals over the course of a healthcare journey. From diagnosis to recovery, I am interested in supporting healthcare journeys that begin with a fundamental shift in a patient’s identity and progress over time as the patient enters active treatment/engages with healthcare professionals and then eventually exits formal care becoming wholly responsible for their own health and wellbeing. To date, I have focused my efforts on supporting the breast cancer journey, the pregnancy journey, and the grief/bereavement journey. Prior to becoming a member of the IU faculty, I was previously  a  Post-Doctoral Fellow in the School of Interactive Computing at the Georgia Institute of Technology working with Elizabeth Mynatt and a host of  wonderful students in the Everyday Computing Lab. I received my PhD in Human-Centered Computing from Georgia Tech in 2012, where I was focused on improving mobile and wearable input and interaction under the guidance of  Thad Starner in the Contextual Computing Group. If you would like to learn more about my research or are interested in a copy of my job materials, please reach out and drop me a line via my  Contact page.",
  "content_length": 2139,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:54"
}