{
  "name": "James Cheng",
  "homepage": "http://www.cse.cuhk.edu.hk/~jcheng",
  "status": "success",
  "content": "James CHENG (CSE, CUHK, Hong Kong) Home Projects Publications Teaching Supervision Vacancies James Cheng Department of Computer Science and Engineering The Chinese University of Hong Kong (CUHK) Shatin, N.T., Hong Kong Email: jcheng@cse.cuhk.edu.hk Email: j.cheng@acm.org Telephone: (+852) 3943 4259 Fax: (+852) 2603 5024 Office: Rm 107, Ho Sin-Hang Engineering Building Research Interests Agentic RAG/Graph RAG, AI memory & context engineering, vector compression & vector search, image/video search/generation High performance systems for data analytics and machine learning Recruitment Graduate student recruitment (for August 2026 entry): Applicants who are interested in topics related to agentic RAG/Graph RAG, vector compression & vector search, and AI memory & context, may send your detailed CV and transcript to jcheng@cse.cuhk.edu.hk and j.cheng@acm.org with the email subject \"phd application\" or \"mphil application\". Special Recruitment Frontier Research on Embodied AI (å ·èº«æºè½) Frameworks for Robotics Applications: Joint research projects with a group of experts in Embodied AI from both industry and top-tier universities. Our research focuses on the following areas: Advancing Vision-Language Models (VLMs) for embodied AI tasks. Diffusion policies for delicate operations. Topics related to visual-language navigation. Building interactive AI agents, including low-latency voice assistants, MCP, memory, and proactive and personalized agents. Pioneering the next-generation Vision-Language-Action (VLA) paradigm for embodied AI. We seek highly motivated students passionate about shaping the future of embodied agents to improve the lives of thousands of families. Available positions include PhD, MPhil, RAs, and Interns.\tSend your detailed CV and transcript to jcheng@cse.cuhk.edu.hk and j.cheng@acm.org with the email subject \"Embodied AI opportunites\".",
  "content_length": 1880,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:52"
}