{
  "name": "James Patrick Cohoon",
  "homepage": "https://www.cs.virginia.edu/~cohoon",
  "status": "success",
  "content": "Jim Cohoon Jim Cohoon Department of Computer Science University of Virginia 422 Rice Hall 151 Engineer's Way Charlottesville, VA 22904-4740 Phone: +1 434.982.2210 Fax: +1 434.982.2210 TTD: 434.982.4327 Favorites Quote \"Sometimes my brother rather than snoring plays his music loud all night long.\" Result Showing that two-terminal routing is polynomial. Teacher Sixth grade homeroom. Course CS 1112 and the one I am doing right now Dance Dance of the twelve girls State New Jersey Promotional photo Leaving Las Vegas Family Mine Brushes with greatness Standing next to Gorbachev on the Lawn. Meeting Jesse Jackson. Alleged being on Sixty Minutes (relatives claim to have seen me). Smartest thing Marrying J McGrath Cohoon Bush Early blooming azaleas Bike ride Seventy-five mile ride on the Western and Old Dominion rail to trail City in the universe New York City Top ten places other than NYC Athens for the Parthenon South Dakota Badlands for its camping Charlottesville for UVA Paris for the Champs-Elysees Minneapolis for its friendliness Munich for its people Rome for Saint Peter's Basilica Salisbury for Stonehenge Venice for its supernaturalness Washington DC for democracy Baseball player Willie Mays Honor Department's first annual best teaching award Education PhD in Computer Science from the University of Minnesota M.S. in Computer Science from Pennsylvania State University BS in Mathematics from Ramapo College of NJ Research interests Algorithms, Computer Science Education, Diversity and Education, swarms, physical design Defining publications Analysis of a CS1 approach for attracting diverse and inexperienced students to computing majors, J. P. Cohoon and L. Tychonievich, SIGCSE Technical Symposium, pp. 165 - 170, Dallas, TX, 2011. Shows a Longitudinal analysis of an effective CS1 curriculum that broadly encourages all types of students to computer science. An introductory course format for promoting diversity and retention, J. P. Cohoon, SIGCSE Technical Symposium, pp. 395 - 399, Covington, Kentucky, 2007. Shows a promising approach for attracting a diverse computer science undergraduate community. Java Program Design: Third edition,  J.P. Cohoon and J. W. Davidson, McGraw-Hill, 2006. Seeks to attract a diverse audience to computing through motivating examples. C++ Program Design: Third Edition, J.P. Cohoon and J. W. Davidson, McGraw-Hill, 2002. Brings easy visualization to introductory object-oriented programming. A fast method for generalized Starting temperature determination in homogeneous two-stage simulated annealing systems, J. M. Varanelli and J. P. Cohoon, Computers and Operations Research, pp. 481-503, 1999. Allows the power of conventional simulated annealing in a fraction of the time. Distributed genetic algorithms for the floorplan design problem, J. P. Cohoon, S. U. Hegde, W. N. Martin, and D. S. Richards, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, April 1991, pp. 483-492. Couples punctuated equilibria and parallel computing to produce fast, near optimal solutions for a major VLSI problem. An optimal Steiner tree algorithm for a net whose terminals lie on the perimeter of a rectangle, J. P. Cohoon, J. S. Salowe, and D. S. Richards, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, April 1990, pp. 398-407. Put three algorithmicians  in a room and you get optimality. Beaver: a computational-geometry-based tool for switchbox routing, J. P. Cohoon and P. L. Heck, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems,  June 1988, pp. 684-697. Shows the advantages of a greedy expert system approach to the \"toughest\" of routing problems. Genetic placement, J. P. Cohoon and W. D. Paris, IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 1987, pp. 956-964. Introduces the power of genetic algorithms to VLSI physical design. A fast Line Intersection routing method for optimal wirings, J. P. Cohoon, Allerton Conference on Communication Control, 1984, pp. 488-497. Demonstrates how to route VLSI computer chips in polynomial time. Professional service contributions ACM Publications board; ACM Council, ACM-SIGBoard, ACM-SIGDA Chair, Asia-Pacific Conference on Circuits and Systems executive and programming committees, Co-organizer of the first ACM-sponsored workshop in Russia, Design Automation Conference executive, programming, and sponsor committees,  Date executive and programming committees, EuroDac executive committees,  ICCAD programming Committees, NSF reviewer Honors IEEE Computer Society Taylor Booth Education Award, Fulbright Fellowship,  SIGDA Outstanding Service Award, SIGDA Leadership Award, Design Automation Fellowship Awards, CS Best Teaching Award, UVa CS Best Teaching Award, Upsilon Pi Epsilon, and first grade arithmetic and spelling medals from Saint Catherine's School Affiliations Stonehenge Last acknowledged modification: July 2011 [JPC]",
  "content_length": 4956,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:17"
}