{
  "name": "James S. Plank",
  "homepage": "http://web.eecs.utk.edu/~plank",
  "status": "success",
  "content": "James S. Plank James S. Plank Professor, Dept. of Electrical Engineering and Computer Science, University of Tennessee Mailing Address: EECS Department, University of Tennessee, Knoxville, TN 37996 Email: jplank@utk.edu Office: 320 Min Kao Phone: (865) 974-4397 (However, I'm really never near that phone. If you want to reach me by phone, the best thing is to email me and we'll schedule a call.) Fax: (865) 974-5483 This page: http://web.eecs.utk.edu/~jplank Technical Stuff Jim Plank is a Professor of EECS at the University of Tennessee. Professor Plank received his Ph.D. from Princeton University in 1993, under the direction of the incomparable Kai Li. His research interests are currently focused on neuromorphic computing: models, software, hardware and applications. Here is the web site of our group - Neuromorphic UT. Dr. Plank also has expertise in erasure codes for storage applications, network storage, RAID, fault-tolerance, checkpointing, distributed and grid computing, systems programming and operating systems. Less related to his job at Tennessee, he also has interests in duplicate bridge, computer-mediated music performance, origami, and jgraph. He has been at the University of Tennessee since January, 1993. Links Research Papers Teaching External Funding Software: Jerasure, GF-Complete, plus jgraph, IBP/LoRS, libckpt, red-black trees, dlists Students Online Vita If I have agreed to write a recommendation letter for you Non-technical stuff Pictures Origami My Summer Student Gallery 2024Nick Skuda (g), Simon Levy (research professor), Daniel Mallett (u), Dr. P., Charlie Rizzo (research professor), Bryson Gullett (g), Jamin Hanna (u), Chris White (u). 2023I didn't take a group picture this summer, so you get a head-shot collage. Top: Charlie Rizzo (g), Will Buziak (u), Jiawai Chen (u), Louise Fry (u). Bottom: Bryson Gullett (u->g), Nick Skuda (g), Alex Zhang (u), Thomas Neuenfeind (u). 2022Front row: ChaoHui Zheng (g), Ankush Patel (g), Kuba Zeligowski (u), Charlie Rizzo (g), Louise Fry (u).Back row: Dr. Schuman, Thomas Neuenfeind (u), Nick Skuda (g), Bryson Gullett (u), Dr. P. 2021(Individual Pictures this year, because of Covid) Top Row: Katherine Huckabay (u), Nick Skuda (g), Charlie Rizzo (g), ChaoHui Zheng (u->g). Bottom Row: Dr. P, Arden Davis (u), John Carmack (u), Ankush Patel (u->g). 2020 No picture because of Covid, but the lineup was: Nick Skuda (g), Charlie Rizzo (g), Brent Hurst (g), Ankush Patel (u), John Carmack (u), ChaoHui Zheng (u). 2019Back row: Grace Zhao (g), John Reynolds (g), Dr. P, Brent Hurst (g), Nick Skuda (g). Front row: Michael Goin (u), Charlie Rizzo (u->g), Ankush Patel (u), Kody Bloodworth (u), Syd Shelby (u). 2018Back row: Jeremy Anantharaj (u), Charlie Rizzo (u), Dr. P, Leroy Todd (u), Chris Dean (u). Front row: Trevor Dixon (u), Michael Goin (u), Grant Bruer (u), Adam Disney (g), John Reynolds (g), Ksenia Burova (g). And yes, that's two years of the same shirt for Michael, three years for Grant, and four years for Adam! 2017Back row: Nick Skuda (u), Ksenia Burova (u->g), Phillip McKnight (u), Grant Bruer (u, same shirt as last year), Adam Disney (g - same shirt for the past three years), John Reynolds (g). Front row: Michael Goin(u), MaryBeth Burst (u), Dr. P, Trevor Dixon (u), Grace Zhao (u). 2016Alex Klibisz (undergrad), Aaron Young (u -> grad), Grant Bruer (u), Tori Florence (u), Katie Schuman (honored alum), Adam Disney (g - wearing the same shirt as last year...), John Reynolds (g), Dr. P. 2015Dr. P, Kelley Deuso (undergrad -> grad), John Reynolds (u -> g), Adam Disney (g). 2014Shawn Cox (undergrad -> grad), John Reynolds (u), Chao Tian (collaborating professor), Adam Disney (g), Michael Peek (our team MVP), Dr. P. (featuring some pasty legs and some prime hair) 2013Ben Arnold (undergrad), Chen Zheng (visiting professor from China), John Burnum (u), Allen McBride (u -> g), Adam Disney (u -> g), Dr. P. (wearing the same t-shirt as two years ago...) 2012Andrew LaPrise (undergrad), Dr. P, Taylor Morris (u), Adam Disney (u). 2011Michael Jugan (undergrad), Will Houston (u), Billy Pierce (PhD), Parth Deshmukh (u), Dr. P. 2010Josh Chandler (u), Billy Pierce (u), Katie Schuman (u), Dr. P, Devin Robison (u), Parth Deshmukh (u).",
  "content_length": 4241,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:24"
}