{
  "name": "James H. Moore",
  "homepage": "http://epistasis.org/jason-h-moore-phd",
  "status": "success",
  "content": "Jason H. Moore, PhD - Artificial Intelligence Innovation (A2I) Lab Jason Moore is Chair of the Department of Computational Biomedicine and Director of the Center for Artificial Intelligence Research and Education (CAIRE) at Cedars-Sinai Medical Center in Los Angeles, CA. He came to Cedars-Sinai in 2021 from the University of Pennsylvania where he was the Edward Rose Professor of Informatics and Director of the Penn Institute for Biomedical Informatics. He also served as Senior Associate Dean for Informatics and Chief of the Division of Informatics in the Department of Biostatistics, Epidemiology, and Informatics. He came to Penn in 2015 from Dartmouth where he was Director of the Institute for Quantitative Biomedical Sciences. While at Dartmouth he founded their bioinformatics core facility and built the university’s first campus-wide high-performance computer system. Prior to Dartmouth he served as Director of the Advanced Computing Center for Research and Education at Vanderbilt University where he launched their first high-performance computer. He has a Ph.D. in Human Genetics and an M.S. in Applied Statistics from the University of Michigan. He leads an active NIH-funded research program focused on the development of artificial intelligence and machine learning algorithms for the analysis of complex biomedical data. One application area is understanding how demographic, genetic, physiologic, and environmental factors interact to influence risk of common diseases such as cancer, cardiovascular disease, and neuropsychiatric diseases. He is the author of the widely used multifactor dimensionality reduction (MDR) method and software that is the leading resource for discovering genetic interactions. His work has been communicated in more than 600 peer-reviewed paper, book chapters, and editorials. In addition to an active research program, Dr. Moore is committed to undergraduate and graduate education. He has trained more than 100 students and postdocs and has founded several interdisciplinary training programs. He is an elected fellow of the American Association for the Advancement of Science (AAAS), an elected fellow of the American College of Medical Informatics (ACMI), an elected fellow of the International Academy for Health Sciences Informatics (IAHSCI), an elected fellow of the American Statistical Association (ASA), an elected member of the International Statistics Institute (ISI), and was selected as a Kavli fellow of the National Academy of Sciences. He is currently Editor-in-Chief of the open-access journal BioData Mining. His CV from 2021 can be found here. His personal web page can be found here. There is an entry on Wikipedia for him. He is a retrocomputing enthusiast and maintains the Atari Projects web page for Atari 8-bit computers. He is the author of the Gene Medic retro-edutainment video game for the Atari 2600 and author of the Atari Projects book. Cedars-Sinai Medical Center Main Campus Pacific Design Center North Campus West Hollywood Our Neighborhood",
  "content_length": 3027,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:05"
}