{
  "name": "James J. Little",
  "homepage": "http://www.cs.ubc.ca/~little",
  "status": "success",
  "content": "Jim Little James (Jim) Little I am retired (emeritus) and will not be supervising new students. The interesting blob descriptions on the right above were computed using the Maximally Stable Colour Regions descriptors of Per-Erik Forssen. See MSCR for more information. Email: little AT cs.ubc.ca URL: http://www.cs.ubc.ca/spider/little/index.html Address: Department of Computer Science University of British Columbia ICCS X463 2366 Main Mall Vancouver, B.C., Canada V6T 1Z4 Wayfinding to my office I am a Professor emeritus in the Department of Computer Science at the University of British Columbia . I am a member of the UBC ICICS Center for Artificial Intelligence Decision Making and Action. Research Google Citations As I am retired I am not taking any more students. Current Students Ph.D. Rayat Hossain (with Leonid Sigal) Shih-Han Chou (with Leonid Sigal) Former Students M.Sc. Georgii Oleinikov Shervin Mohammadi Tari Parnian Alimi Tomas Hoffman Moumita Roy Tora Julin Song Sijia Tian (Software Developer at SAP) Kevin Woo Setareh Cohan (Ph.D student, UBC) Gursimran Singh (Huawei, Vancouver) Alex Fan, PhD student, ETH Farnoosh Javadi (with Helge Rhodin), Huawei Aritro Roy Arko (with Kwang Moo Yi) Abi Kuganesan, with Helge Rhodin Ph.D. Jeff Boyd (Associate Professor, Calgary) Esfandiar Bandari Jiping Lu Rob Scharein, with Kelly Booth Don Murray, one of the founders of Point Grey Research Jason Harrison (Senior Software Engineer at Motion Metrics), co-supervised with Kelly Booth Jesse Hoey (Full Professor, Waterloo) Hossein Darbandi (Langara College) Pantelis Elinas (CSIRO) Kenji Okuma (with David Lowe) Pooja Viswanathan (Founder at Braze Mobility), co-supervised with Alan Mackworth Wei-Lwun Lu (Staff Machine Learning Engineer at Cruise), co-supervised with Kevin Murphy David Meger (Assistant Prof., McGill) Tristram Southey (Product Manager III at Google) Ankur Gupta (Samsung Research), with Bob Woodham Sina Radmard (with Elizabeth Croft), MicroTraffic Road Safety Video Analytics Fred Tung (Borealis AI) Jianhui (Jimmy) Chen (Research Engineer, Facebook Reality Labs) Julieta Martinez, co-supervised with Holger Hoos Alireza Shafaei (with Mark Schmidt) Former Visiting Students Maodi Hu Robotics Our weekly reading group on vision and robotics is: Robuddies Our weekly reading group on computer vision: CVRG Teaching As an emeritus professor I have no teaching responsibilities. PHW on how to give a talk Last updated 231211",
  "content_length": 2451,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:06"
}