{
  "name": "James B. Worrell",
  "homepage": "http://www.cs.ox.ac.uk/james.worrell",
  "status": "success",
  "content": "Department of Computer Science: James Worrell Contact us About us Privacy & Cookies Site map Our people Our research Linked in Twitter Facebook Instagram Continue… We use cookies on this website. Our privacy policy explains what cookies are and how they are being used here. If you continue to access our website, we'll assume that you consent to receiving cookies from this website. www.cs.ox.ac.uk/people/james.worrell/home.html You are here: Home People James Worrell Home James Worrell Professor of Computer Science Department of Computer Science, University of Oxford Fellow of Green Templeton College Office: 366 Wolfson Building Address: Department of Computer Science, Wolfson Building, Parks Road, Oxford OX1 3QD, UK Tel: +44 (0)1865 273 843 Email: jbw_at_cs.ox.ac.uk Research: Logic in computer science; linear dynamical systems; automated verification Beyond Linear Dynamical Systems: UKRI Fellowship (selected as an ERC Advanced Grant) (2022-2027) Verification of Linear Dynamical Systems: EPSRC Established-Career Fellowship (2016-2021) Please contact me if you are interested in postdoc positions on my UKRI project List of publications on DBLP Program Committees 41st ACM/IEEE Annual Symposium on Logic in Computer Science (LICS 2026) 53rd ACM SIGPLAN Symposium on Principles of Programming Languages (POPL 2026) 35th International Conference on Concurrency Theory (CONCUR 2024) 27th International Conference on Foundations of Software Science and Computation Structures (FoSSaCS 2024) 40th International Symposium on Theoretical Aspects of Computer Science (STACS 2023) 48th International Colloquium on Automata, Languages, and Programming (ICALP 2021) Invited Talks and Tutorials CRM Workshop Fluid Dynamics, Geometry and Computer Science in interaction. Barcelona, September 16-20, 2024. MOD23 Summer School in Safety and Security through Formal Verification, Marktoberdorf, August 1-12, 2023 RTCA Workshop in Effective Aspects in Diophantine Approximation, Lyon, March 27-31, 2023 ICALP 2023. Paderborn, July 10-14, 2023 POPL 2021. Copenhagen (online), January 17-22, 2021 SAS 2020. Chicago, November 18-20, 2020 MOVEP 2020. Grenoble, June 22-26, 2019 LICS 2019. Vancouver, June 24-27, 2019 Highlights 2018. Berlin, Sept 18-21, 2018 LATA 2018. Tel Aviv, April 9-11, 2018 ISSAC 2017. Kaiserslautern, July 25-28, 2017 Teaching Hilary 2026: Logic and Proof Some lecture notes and expository material can be found here Current Postdocs Rida Ait El Manssour Bertrand Teguia Current Graduate Students Piotr Bacik Former Postdocs Jakub Konieczny Andrew Scoones Edon Kelmendi Nikhil Balaji Pavel Semukhin Michael Cadilhac George Kenison Nathanael Fijalkow Former Graduate Students Julian D'Costa Ventsislav Chonev Ruiwen Dong Pascale Gourdeau Mehran Hosseini Rastislav Lehardt Antonia Lechner Ines Marusic Joao Sousa-Pinto Mark Jenkins Main sections Home Prospective Students Current Students Research People News Events Vacancies & Studentships Contact Us Alumni Industry Liaison RSS Feeds News News All news Awards Events Miscellaneous Project news Publications Current Projects Vacancies & studentships Vacancies & studentships Vacancies Studentships Calendars Seminars & timetables Seminars & timetables All Seminars Lecture timetable Practical timetable Class timetable Internal Internal / Intranet Edit website / database login IT Support",
  "content_length": 3355,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:51"
}