{
  "name": "James Zou 0001",
  "homepage": "https://www.james-zou.com",
  "status": "success",
  "content": "Machine learning | James Zou | Stanford top of pageTITLEHi! I am an Associate Professor of Biomedical Data Science and, by courtesy, of CS and EE at Stanford. I work broadly in AI for science, with a particular interest in applications in human disease and health. Our algorithms have received FDA approval, are used by millions of developers, and were selected as The New York Times' Good Tech. I received my Ph.D. from Harvard in 2014 and have held positions at Microsoft Research, as a Gates Scholar at Cambridge, and as a Simons Fellow at UC Berkeley. I joined Stanford in 2016, where I am a two-time Chan–Zuckerberg Investigator, a faculty director at the Stanford Data Science Institute, and a member of the Stanford AI Lab. My research has been recognized with the Overton Prize, a Sloan Fellowship, an NSF CAREER Award, multiple best paper awards, and faculty awards from Google, Amazon, Genentech, and Apple.Email: jamesz at stanford dot edu                   Office: Packard 369News11/25: Check out our 11 new papers in NeurIPS. ​ 11/25: Squidiff published in Nature Methods and LLM belief vs knowledge published in Nature MI. ​ 10/25: InterPLM published in Nature Methods. ​ 8/25: The Virtual Lab is published in Nature. ​ 7/25: Thrilled that CollabLLM won the ICML Outstanding Paper Award (6 of >12K submission)! ​ 4/25: New Nature Communications paper studying how well LLMs cite medical references. ​ 3/25: TextGrad is published in Nature! ​ 2/25: Incredibly grateful and honored to receive the Overton Prize. Huge credit to my amazing students, collaborators and mentors! ​ 2/25: Check out our new ICML and AISTATS papers on agents, LLMs and more! Agentic medicine in The Lancet. ​ 1/25: Precision cancer in Nature Comm. Predicting cardiotoxicity in Circulation. ​ 12/24: Spatial single cell aging clock published in Nature. GenePT published in Nature BME. ​ 11/24: Recommendations on LLM usage in peer reviews published in Nature. ​ 10/24: Excited to share 11 new papers in NeurIPS. Check it out here. ​ 8/24: check our our primer on LLMs for biology in Nature Methods. ADMET-AI in Bioinformatics. SCGP in Cell Reports Methods. ​ 7/24: LLM peer reviews published in NEJM AI; SPRITE in Bioinformatics. ​ 6/24: check out TextGrad, our PyTorch-for-text framework to optimize AI agents! Nuclei.io published in Nature BME. AI model card analysis published in Nature Machine Intelligence. ​ 5/24: EchoNet AI has received FDA clearance! ​ 5/24: 12 new ICML papers. Check it out here! ​ 4/24: NEJM AI paper on the economics of medical AI. TMLR papers on watermarking and membership inference. ​ 3/24: SyntheMol published in Nature Machine Intelligence (genAI for small molecule drugs). ​ 2/24: Alignability testing in PNAS; off-label cancer drugs study in Cell Reports Medicine. ​ 2/24: TISSUE: uncertainty-aware spatial transcriptomics published in Nature Methods. ​ 1/24: New ICLR papers on DataInf, LLM safety-training, analyses of datacards and zoology. ​ 1/24: New NEJM AI  paper using LLM to simplify medical consent for patients. ​ 12/23: Contrastive feature learning published in JMLR. ​ 11/23: Excited to co-organize the ML in Compbio Conference. ​ 10/23: New NEJM AI  paper studies clinical adoption of AI using billions of insurance claims. ​ 9/23: New Neurips papers on 1) OpenDataVal; 2) atypicality; 3) AI art on Twitter; 4) DataPerf 5) factorized contrastive learning. ​ 9/23: New npj Digital Medicine papers on predicting cardiovascular risk and assessing dermatology textbooks. ​ 8/23: New in Nature Medicine: we used Twitter data to build a visual-language AI for pathology. ​ 7/23: New Science paper on implications of AI-predicted race variables. Patterns paper shows that GPT detectors are biased against non-native speakers. ​ 5/23: See our Nature Biotech paper on who counts as an inventor. In silico spatial proteomics with 7-UP published in PNAS Nexus. Proteomic biomarkers of resilience to Alzheimer's published in Nature Communications. ​ 4/23: 4 new ICML papers on data valuation with Data-OOB, moon-shaped correlation of ML performances, provable subgroup-discovery, and discover-and-cure spurious correlations. ​ 4/23: EchoNet randomized clinical trial published in Nature. Generative AI amplifies human bias published in FAccT. ​ 3/23: New Cell  paper on advances in ML for cancer. Play our ArtWhisperer game and see how good you are at human-AI collaboration! Point-of-care EchoNet published. TrueImage clinical study public in  JAMA Dermatology. ​ 2/23: MetaViz published in Nature Communications (also selected for Outstanding Paper Award at 2023 Joint Statistics Meeting); EchoNet-Ped published in JASE; Joined the editorial board of New England Journal of Medicine AI. ​ 1/23: 5 new ICLR papers on: why vision-language models act like bag-of-words (top 2%); post-hoc concept bottleneck (top 10%); fair classifier on imbalanced data; fair classifier with small samples; and DrML. 2 new AISTATS papers on understanding multimodal contrastive learning and freeze-and-train. ​ 1/23: Dynamic Visualization published in Nature Computational Science; dog precision cancer paper published in npj Precision Oncology. ​ 11/22: SpaceGM (GNN for spatial proteomics) published in Nature Biomedical Engineering. ​ 9/22: 7 new NeurIPS papers on: improving SHAP attribution; human-AI collaboration, sparse data shifts, modality gap, mixReg augmentation, SkinCon, and history of ML API shifts. ​ 8/22: Science Advances paper on disparity in skin cancer AI and new Diverse Derm data; Nature Machine Intelligence article on data-centric AI; analysis of 50 years of Stanford research commercialization published in Patterns. ​ 6/22: new Nature Medicine paper on precision cancer treatment. ​ 5/22: 4 new ICML papers: explaining AI mistakes, using ML cheaply w/ frugalMCT, improving calibration w/ mix-up, and better robustness with selective augmentation. ​ 5/22: RNA-ODE published in J. Molecular Biology; f-gan in ISIT; human-AI advice in AIES. ​ 4/22: Very honored that Trial Pathfinder is selected as a Top Ten Clinical Research Achievement. ​ 4/22: In silico IHC published in Cell Reports Methods, DynaMorph in Mol. Bio. Cell and evaluation of COVID data reporting in PLoS Global Health, forecasting clinical trial efficiency in AAPS. ​ 1/22: 3 new ICLR papers: MASA assesses model shifts; Domino finds fine-grained mistake clusters in AI (oral); MetaShift offers a resource of 1000s of distribution shifts. ​ 1/22: 3 new AISTATS papers: Beta-Shapley improves and unifies data valuation (oral); MLDemon monitors ML performance over time; adapt ML to users with gradual performative gradient. ​ 1/22: Honored to be selected as a Chan-Zuckerberg Investigator for the 2nd term. ​ 10/21: NeurIPS paper shows adversarial training improves transfer learning; EBioMed paper infers biomarkers from cardiac videos; 2 PSB papers predict diseases from scRNA-seq and eye-motion. ​ 9/21: New JAMA Dermatology paper quantifies limitations in datasets used for derm AIs. ​ 6/21: New Nature Biotech paper uses patent citations to quantify research translational impact. Study of GPT-3 biases published in Nature Machine Intelligence. 5/21: ICML papers on performative gradient descent and task augmentation for meta-learning. ​ 4/21: BABEL published in PNAS and new single-cell aging score published in eLife. ​ 4/21: Our Nature paper uses real-world data and AI to make clinical trials more inclusive. 4/21: Our Nature Medicine paper identifies limitations in how medical AI are evaluated. 2/21: Honored to receive the Sloan Research Fellowship. ​ 1/21: 5 new papers at 2021 AISTATS and ICLR: how competition over data affects ML; how to use cheap unlabeled data to make models more robust; efficient data Shapley computation; how to delete data from trained predictors; and mixup as regularization. ​ 10/20: TrueImage improves photo quality for telehealth (PSB paper). ALICE shows how to use natural language explanation of contrasts to efficiently teach ML (EMNLP paper). ​ 9/20: FrugalML, Neuron Shapley and MOPO are accepted at NeurIPS. FrugalML selected for oral presentation as top 1% of submissions. ​ 7/20: Single-cell characterization of aging effects published in Nature. ​ 6/20: Our AI to generate spatial transcriptome from histology is in Nature Biomedical Engineering. ​ 6/20: Excited and honored to received the NSF CAREER Award! 6/20: New papers: statistical data value (ICML), improving dialogue systems (ACL), learning data alignment (ICLR), deep learning for proteomics (J. Proteomics), RNA-GPS (RNA), linking variants to genes (Bioinformatics), and SARS-CoV-2 subcellular localization (Cell Systems). ​ 3/20: Our video AI system to assess heart function is published in Nature. ​ 1/20: Our interactive ML platform is published in Nature Machine Intelligence. ​ 11/19: Our paper on how sex and gender analysis improves science and engineering is in Nature. ​ 9/19: Our papers on deleting data from ML (spotlight) and learning human meaningful concepts will be presented at NeurIPS. ​ 7/19: Our machine learning for genome editing paper is published in Nature Biotechnology. 5/19: AdaFDR won the RECOMB Best Paper. Extended version in Nature Communications. 5/19: At ICML we'll present papers on data valuation, concrete autoencoder, conditional features and adaptive Monte Carlo. 4/19: Check out our two knockoff papers in AISTATS. 2/19: Interpretation of neural network is fragile in AAAI and VetTag in Nature Digital Medicine. 1/19: Feedback GAN for protein design published in Nature Machine Intelligence. 11/18: Check out our interactive deep learning for genomics primer in Nature Genetics. ​ 9/18: Excited to receive a NIH Center for Excellence in Genomics and a NIH R21. 7/18: Our paper on designing fair AI is published in Nature. ​ 6/18: Honored to receive a Google Faculty Award and a Tencent AI award. 4/18: NLP reveals 100 years of stereotypes is published in PNAS and highlighted in Science. bottom of page",
  "content_length": 9952,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:27"
}