{
  "name": "James Caverlee",
  "homepage": "http://faculty.cs.tamu.edu/caverlee",
  "status": "success",
  "content": "James Caverlee :: Texas A&M :: Computer Science and Engineering James Caverlee Professor Department of Computer Science and Engineering Texas A&M University infolab [my_last_name] 'at' tamu.edu Industry engagement: Google DeepMind Visiting Researcher About Me: Howdy! I'm a Professor in the Department of Computer Science and Engineering at Texas A&M University and a Visiting Researcher at Google DeepMind. With my students and collaborators, we aim to develop trustworthy, resilient, and responsible machine learning algorithms and systems to help people connect to information and to each other. Our group focuses on personalization, efficiency, and AI risks in domains like LLMs, recommender systems, conversational systems, and speech. Our work has appeared in major venues like KDD, EMNLP, WWW, SIGIR, WSDM, AAAI, RecSys, and more. Our papers have been recognized with the 2022 SIGIR Test of Time Award Honorable Mention, the 2020 CIKM Test of Time Award, plus several Best Paper (Candidate) awards. Our research has been generously supported by an NSF CAREER award, an AFOSR Young Investigator Award, a DARPA Young Faculty Award, and multiple grants from Google, Amazon, AFOSR, DARPA, and the NSF. I was the General Co-Chair of WSDM 2020 and serve as a Senior Associate Editor of the ACM Transactions on Intelligent Systems and Technology, as well as the Senior Program Committee of many venues. Recent News: Had a great time in Sydney where I was an invited Keynote Speaker at the Resource-Efficient Learning for the Web Workshop at WWW 2025! Or you may prefer: on a boat, with my best friend Tasman the Koala, chilling, summertime, quarantine haircut, chilling out (pic by Hongning Wang), Wampa attack, thinking, coffee, guitar, Korean, bike, canoe, rainy, Gandalf, GRRM, dunno, younger me, fancy me, or collaborating (pic by Hongning Wang). Publications See also my publications at DBLP, Google Scholar, and at Semantic Scholar. DisastIR: A Comprehensive Information Retrieval Benchmark for Disaster Management. Findings of EMNLP 2025. A Survey on LLMs for Story Generation. Findings of EMNLP 2025. Flow Matching for Collaborative Filtering. KDD 2025. GraphCheck: Breaking Long-Term Text Barriers with Extracted Knowledge Graph-Powered Fact-Checking. ACL 2025. I want a horror -- comedy -- movie: Slips-of-the-Tongue Impact Conversational Recommender System Performance. INTERSPEECH 2025. Masculine Defaults via Gendered Discourse in Podcasts and Large Language Models. ICWSM 2025. ReasoningRec: Bridging Personalized Recommendations and Human-Interpretable Explanations through LLM Reasoning. NAACL Findings 2025. Combating Heterogeneous Model Biases in Recommendations via Boosting. WSDM 2025. DA^3: A Distribution-Aware Adversarial Attack against Language Models. EMNLP 2024. Secured Weight Release for Large Language Models via Taylor Expansion. EMNLP 2024. FANTAstic SEquences and Where to Find Them: Faithful and Efficient API Call Generation through State-tracked Constrained Decoding and Reranking. EMNLP 2024 Findings. Comparing ASR Systems in the Context of Speech Disfluencies. INTERSPEECH 2024. Behavior-Dependent Linear Recurrent Units for Efficient Sequential Recommendation. CIKM 2024. Mamba4Rec: Towards Efficient Sequential Recommendation with Selective State Space Models. International Workshop on Resource-Efficient Learning for Knowledge Discovery (RelKD@KDD 2024). Best Paper Award Large Language Models as Data Augmenters for Cold-Start Item Recommendation (short paper). WWW 2024. KG-Rank: Enhancing Large Language Models for Medical QA with Knowledge Graphs and Ranking Techniques. BioNLP@ACL 2024. Everything Perturbed All at Once: Enabling Differentiable Graph Attacks (short paper). WWW 2024. The Neglected Tails in Vision-Language Models. CVPR 2024. Quantifying the Impact of Disfluency on Spoken Content Summarization. LREC-COLING 2024. DACL: Disfluency Augmented Curriculum Learning for Fluent Text Generation. LREC-COLING 2024. Federated Conversational Recommender System. ECIR 2024 (\"IR for Good\" track). End-to-End Adaptive Local Learning for Alleviating Mainstream Bias in Collaborative Filtering. ECIR 2024 (\"IR for Good\" track) Probing Explicit and Implicit Gender Bias through LLM Conditional Text Generation. Socially Responsible Language Modelling Research (SoLaR) 2023: NeurIPS 2023. Bias Neutralization in Non-Parallel Texts: a Cyclic Approach with Auxiliary Guidance. EMNLP 2023. Unsupervised Candidate Answer Extraction though Differentiable Masker-Reconstructor Model. Findings of EMNLP 2023. Mitigating Bias in Pre-trained Language Models through Counterfactual Contrastive Prompt Tuning. Findings of EMNLP 2023. Robust Graph Meta-learning for Weakly-supervised Few-shot Node Classification. TKDD 2023. Incorporating Time in Sequential Recommendation Models (short paper). RecSys 2023 Empowering Long-tail Item Recommendation through Cross Decoupling Network (CDN). KDD Applied Data Science Track 2023. PromptAttack: Probing Dialogue State Trackers with Adversarial Prompts. Findings of ACL 2023. Enhancing User Personalization in Conversational Recommenders. The Web Conference (WWW) 2023. Reinforced Sequence Training based Subjective Bias Correction. EACL 2023. Closed-book Question Generation via Contrastive Learning. EACL 2023. Evolution of Filter Bubbles and Polarization in News Recommendation (short paper). ECIR 2023. Quantifying and Mitigating Popularity Bias in Conversational Recommender Systems. CIKM 2022. MetaBalance: Improving Multi-Task Recommendations via Adapting Gradient Magnitudes of Auxiliary Tasks. WWW 2022. RES: A Replicability Estimation System (demo). AAAI 2022. Meta Propagation Networks for Graph Few-shot Semi-supervised Learning. AAAI 2022. Fighting Mainstream Bias in Recommender Systems via Local Fine Tuning. WSDM 2022. Popularity Bias in Dynamic Recommendation. KDD 2021. Identifying Hijacked Reviews. 4th Workshop on e-Commerce and NLP 2021. Vibe Check: Social Resonance Learning for Enhanced Recommendation. ASONAM 2021. Fairness among New Items in Cold Start Recommender Systems. SIGIR 2021. Sequential Recommendation for Cold-start Users with Meta Transitional Learning (short paper). SIGIR 2021. Rabbit Holes and Taste Distortion: Distribution-Aware Recommendation with Evolving Interests. WWW 2021. Towards Ongoing Detection of Linguistic Bias on Wikipedia (extended abstract). WikiWorkshop 2021. Item Relationship Graph Neural Networks for E-Commerce IEEE Transactions on Neural Networks and Learning Systems (TNNLS), 2021. Session-based Recommendation with Hypergraph Attention Networks. SDM 2021. Popularity-Opportunity Bias in Collaborative Filtering. WSDM 2021. Infusing Disease Knowledge into BERT for Health Question Answering, Medical Inference and Disease Name Recognition. EMNLP 2020. PARADE: A New Dataset for Paraphrase Identification Requiring Computer Science Domain Knowledge. EMNLP 2020. Content-Collaborative Disentanglement Representation Learning for Enhanced Recommendation. RecSys 2020. Unbiased Implicit Recommendation and Propensity Estimation via Combinational Joint Learning (short paper). RecSys 2020. ADORE: Aspect Dependent Online REview Labeling for Review Generation. SIGIR 2020. Measuring and Mitigating Item Under-Recommendation Bias in Personalized Ranking Systems. SIGIR 2020. Recommendation for New Users and New Items via Randomized Training and Mixture-of-Experts Transformation. SIGIR 2020. Next-item Recommendation with Sequential Hypergraphs. SIGIR 2020. Adaptive Hierarchical Translation-based Sequential Recommendation (short paper). WWW 2020. Addressing the Target Customer Distortion Problem in Recommender Systems (short paper). WWW 2020. Recommending Music Curators: A Neural Style-Aware Approach. ECIR 2020. Consistency-Aware Recommendation for User-Generated Item List Continuation. WSDM 2020. User Recommendation in Content Curation Platforms. WSDM 2020. Key Opinion Leaders in Recommendation Systems: Opinion Elicitation and Diffusion. WSDM 2020. Time to Shop for Valentine's Day: Shopping Occasions and Sequential Recommendation in E-commerce. WSDM 2020. Improving the Estimation of Tail Ratings in Recommender System with Multi-Latent Representations. WSDM 2020. Tensor Completion Algorithms in Big Data Analytics. ACM TKDD 13(1): 6:1-6:48 (2019) Wide-Ranging Review Manipulation Attacks: Model, Empirical Study, and Countermeasures. CIKM 2019. A Hierarchical Self-Attentive Model for Recommending User-Generated Item Lists. CIKM 2019. Instagrammers, Fashionistas, and Me: Recurrent Fashion Recommendation with Implicit Visual Influence. CIKM 2019. TOmCAT: Target-Oriented Crowd Review ATtacks and Countermeasures. ICWSM 2019. A Large-Scale Study of ISIS Social Media Strategy. ICWSM 2019. Improving Top-K Recommendation via Joint Collaborative Autoencoders (short paper). WWW 2019. An Interpretable Neural Model with Interactive Stepwise Influence. PAKDD 2019. Recurrent Recommendation with Local Coherence. WSDM 2019. Pseudo-Implicit Feedback for Alleviating Data Sparsity in Top-K Recommendation. ICDM 2018. Fairness-Aware Tensor-Based Recommendation. CIKM 2018. Quality-Aware Neural Complementary Item Recommendation. RecSys 2018. Fairness-Aware Recommendation of Information Curators. 2nd FATREC Workshop on Responsible Recommendation (RecSys), 2018. TrailMix: An Ensemble Recommender System for Playlist Curation and Continuation. RecSys Challenge 2018. Vitriol on Social Media: Curation and Investigation. SocInfo 2018. Learning Geo-Social User Topical Profiles with Bayesian Hierarchical User Factorization. SIGIR 2018. DisTenC: A Distributed Algorithm for Scalable Tensor Completion on Spark. ICDE 2018. Neural Personalized Ranking for Image Recommendation. WSDM 2018. Combating Crowdsourced Review Manipulators: A Neighborhood-Based Approach. WSDM 2018. Measuring the Impact of ISIS Social Media Strategy (short paper). MIS2: Misinformation and Misbehavior Mining on the Web, workshop at WSDM 2018. Location-Sensitive User Profiling Using ",
  "content_length": 25773,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:54"
}