{
  "name": "James Cremer",
  "homepage": "https://www.cs.uiowa.edu/~cremer",
  "status": "success",
  "content": "James Cremer James F. Cremer Professor 101P MacLean Hall Computer Science Department The University of Iowa Iowa City, IA 52242 (319) 321-1893 email: james-cremer@uiowa.edu CV (circa 1996 :)) Department Chair, 2002-2010 PhD, Cornell, 1989 BS, Cornell, 1982 Co-founder, Tutor Universe, Inc., 2011 (now GotIt!) Co-founder, CTO, Digital Artefacts, LLC, 2000-2009 Research interests: sensor-based and mobile apps for healthcare, virtual environments, simulation, integration of numeric and symbolic computing, geometric modeling, problem solving environments. Papers/publications Research Projects Selected Publications Polgreen L, et al. More than Just a Game? A Randomized Controlled Trial of Pokémon Go On Physical Activity. 38th Society for Behavioral Medicine, 2017 Using Computer Vision and Depth Sensing to Measure Healthcare Worker-Patient Contacts and Personal Protective Equipment \\ Adherence within Hospital Rooms. J. Chen, J. Cremer, K. Zarei, A. Segre, and P. Polgreen. Open Forum Infectious Diseases. 3(1), 2016, doi: 10.1093/ofid/ofv200 A Mobile Phone Application for Recording Vaccine Refusals. D. Murphy, J. Cremer, and P. Polgreen. Poster. International Meeting on Emerging Diseases and Surveillance 2013 (IMED 2013), Feb. 15-18, Vienna, Austria. A Mobile Phone Application for Pertussis Classification Based on Machine Learning. M. Adamczyk, D. Parker, O. Chipara, J. Cremer, J. Picone, A. Harati, P. Polgreen. Poster. International Meeting on Emerging Diseases and Surveillance 2013 (IMED 2013), Feb. 15-18, Vienna, Austria. Manipulating Perception Versus Action In Recalibration Tasks. C. Ziemer, M. Branson, B. Chihak, J. Kearney, J. Cremer, and J. Plumert. Provisionally accepted for Attention, Perception and Psychophysics, 2013. Perceiving and Acting on Complex Affordances: How Children and Adults Bicycle Across Two Lanes of Opposing Traffic. T. Grechkin, B. Chihak, J. Cremer, J. Kearney, and J. Plumert. Online First Publication, August 27, 2012. doi: 10.1037/a0029716. Journal of Experimental Psychology; Human Perception and Performance, 39(1), 2013, p. 23-36. How Do Scale Changes Affect Distance Perception in Virtual Environments. T. Nguyen, C. Ziemer, T. Grechkin, B. Chihak, J. Plumert, J. Cremer, and J. Kearney. ACM Transactions on Applied Perception of Applied Perception in Graphics and Visualization, 8(4), 26:1--18, 2011 Effects of scene density and richness on traveled distance estimation in virtual environments. T. Nguyen, J. Cremer, J. Kearney, and J. Plumert. Proc. of the 8th ACM Siggraph Symp. on Applied Perception in Graphics and Visualization (APGV11), Toulouse, France, Aug. 27-28, 2011 Spam Detection in Online Classified Advertisements. H. Tran, T. Hornbeck, V. Ha-Thuc, J. Cremer, and P. Srinivasan. In Proceedings of the 2011 Joint WICOW/AIRWeb Workshop on Web Quality (WebQuality '11). ACM, New York, p. 35-41. Facilitating Content Creation and Content Research in Building the ``City of Lit'' Digital Library. H. Hsieh, B. Draxler, N. Dudley, J. Cremer, L. Haldeman, D. Nguyen, P. Likarish and J. Winet. Submitted to ACM/IEEE Joint Conference on Digital Libraries, 2011. Changes in children's perception-action tuning over short time scales: Bicycling across traffic-filled intersections in a virtual environment. J. Plumert, J. Kearney, J. Cremer, K. Recker, and J. Strutt. Journal of Experimental Child Psychology, 108, 2011, p322-337. An immersive virtual peer for studying social influences on child road-crossing behavior. S. Babu, T. Grechkin, B. Chihak, C. Ziemer, J. Kearney, J. Cremer, and J. Plumert. IEEE Transactions on Visualization and Computer Graphics, 17(1), 2011 p.14-25. How does presentation method and measurement protocol affect distance estimation in real and virtual environments? T. Grechkin, T. Nguyen, C. Ziemer, J. Cremer, J. Plumert, and J. Kearney. ACM Transactions on Applied Perception, of Applied Perception in Graphics and Visualization, 7(4), 2010, p.1-18. Effects of Scale Change on Distance Perception in Virtual Environments. T. Nguyen, C. Ziemer, J. Plumert, J. Cremer, and J. Kearney. To appear in Proceedings of the 6th Symposium on Applied Perception in Graphics and Visualization (APGV09), Crete, Sept. 30-Oct. 2, 2009. Estimating distance in real and virtual environments: Does order make a difference? C. Ziemer, J. Plumert, J. Cremer, and J. Kearney, K. Attention, Perception, and Psychophysics, 71, 2009. p1095-1106. A Virtual Peer for Studying Peer Influence in Children's Bicycling. S. Babu, T. Grechkin, C. Ziemer, B. Chihak, J. Cremer, J. Kearney, and J. Plumert, to appear in Proc. IEEE VR 2009, Lafayette, LA, March 14-18, 2009. How do Bicyclists Intercept Moving Gaps in a Virtual Environment? B. Chihak, S. Babu, T. Grechkin, C. Ziemer, J. Cremer, J. Kearney, and J. Plumert. Proceedings of the 5th Symposium on Applied Perception in Graphics and Visualization (APGV08), Los Angeles, August 9-10, 2008, p.188. How Does Traffic Density Influence Cyclists' Gap Choices? J. Plumert, J. Kearney, and J. Cremer, short paper and poster at International Conference on Road Safety and Simulation (RSS2007), Rome, Italy, Nov. 7-9, 2007. How does 2-way traffic impact children's road crossing behavior in a virtual environment. C. Ziemer, J. Plumert, B. Chihak, J. Cremer, and J. Kearney. Biennial Meeting of the Cognitive Development Society, Santa Fe, New Mexico, October, 2007. Children's Road Crossing: A Window Into Perceptual-Motor Development. J. Plumert, J. Kearney, and J. Cremer, Current Directions in Psychological Science, (16)5, October, 2007, p. 255-258. Making Distance Judgments in Real and Virtual Environments: Does Order Make a Difference? C. Ziemer, J. Plumert, J. Cremer, and J. Kearney, poster in Proceedings of 2006 Symposium on Applied Perception in Graphics and Visualization (APGV06), Boston, July 28-29. Steering Behaviors for Autonomous Vehicles in Virtual Environments. H. Wang, J. Kearney, J. Cremer, and P. Willemsen, Proceedings of IEEE VR 2005, Bonn,Germany, March 12-16, 2005, p. 155-162. Distance Perception in Real and Virtual Environments. J. Plumert, J. Kearney, J. Cremer, and K. Koson, ACM Transactions on Applied Perception, 2005 (extension of APGV04 paper), 2(3), p. 286-308. Distance Perception in Real and Virtual Environments, J. Plumert, J. Kearney, and J. Cremer, Proceedings of the First Symposium on Applied Perception in Graphics and Visualization (APGV '04), Aug. 7-8, 2004, Los Angeles. \"Children's Perception of Affordances: Bicycling across Traffic-Filled Intersections in an Immersive Virtual Environment,\" J. Plumert, J. Kearney, and J. Cremer, Child Development, 75(4), 2004. \"Sound Modeling in a PC-based Virtual Bicycling and Driving Environment,\" S. Jezewski, J. Cremer, and J. Kearney. 2004 Image Society Conference, Phoenix, Arizona, July 12-16, 2004. \"Steering Autonomous Driving Agents Through Intersections in Virtual Urban Environments,\" H. Wang, J. Kearney, J. Cremer, and P. Willemsen, Proceedings of International Conference on Modeling, Simulation and Visualization Methods, Las Vegas, Nevada, June 2004. \"An Abstract Virtual Environment Tool To Assess Decision-Making in Impaired Drivers,\" M. Rizzo, J. Severson, J. Cremer, and K. Price. Proceedings of the Second International Driving Symposium on Human Factors in Driver Assessment, Training and Vehicle Design. Park City, Utah, July 21-24, 2003, p. 40-47 \"Exploring Virtual History at The National Museum of American History,\" J. Severson, J. Cremer, K. Lee, D. Allison, S. Gelo, J. Edwards, R. Vanderleest, S. Heston, J. Kearney, G. Thomas. Proceedings of the 8th Intl. Conf. on Virtual Systems and Multimedia (VSMM2002), Gyeong-ju, Korea. September 25-27, 2002. p. 61-70. Real-time Extendible-resolution Display of On-line Dynamic Terrain. Y. He, J. Cremer, and Y. Papelis, to appear in Proceedings of Graphics Interface 2002, May 27-29, Calgary, Alberta. Refiner: A Problem Solving Environment for Scientific Simulator Creation. K. Hunt and J. Cremer. to appeaer in Transactions of the Society for Computer Simulation. \"This Old Digital City\" One Year Later: Experience Gained, Lessons Learned, and Future Plans. J. Cremer, J. Severson, S. Gelo, J. Kearney, M. McDermott. Proceedings of the 7th Intl. Conf. on Virtual Systems and Multimedia (VSMM2001), Berkeley, California, October 25-27, 2001. p. 49-56. This Old Digital City\": Virtual Historical Cedar Rapids, Iowa circa 1900 J. Cremer, J. Severson, J. Kearney, S. Gelo, M. McDermott, and R. Riccio. Proceedings of the 6th Intl. Conf. on Virtual Systems and Multimedia (VSMM2000), Special session on Virtual Heritage. Softopia, Ogaki, Gifu, Japan. October 2000. Pages 27-34. Dynamic Terrain for Real-time Ground Vehicle Simulation. J. Cremer, Y. He, Y. Papelis. Proceedings of The 2000 Image Conference, Scottsdale, AZ, July 2000. Geometric Awareness for Interactive Object Manipulation M. Choi, J. Cremer. Computer Graphics Forum, 19(1), p. 65-76, 2000 Interactive Manipulation of Articulated Objects with Geometry Awareness. M. Choi, J. Cremer. Proceedings of the 1999 IEEE International Conference on Robotics and Automation, Detroit, MI, May 10-15, 1999. Virtual Proving Ground Simulation for Vehicle Design. E. Haug, J. Cremer, Y. Papelis, R. Ranganathan, D. Solis. Proceedings (CD-ROM) of the 1998 ASME Design Automation Conference, Atlanta, September 13-16, 1998. Generation of Ambient Traffic for Real-time Driving Simulation. E. Bonakdarian, J. Cremer, J. Kearney, and P. Willemsen, Proceedings of 1998 Image Conference, Scottsdale, AZ, August 2-7, 1998. Embedding Scenarios in Ambient Traffic. O. Alloyer, E. Bonakdarian, J. Cremer, J. Kearney, and P. Willemsen, Proceedings of DSC 97 (Driving Simulation Conference), p. 75--84, Lyon, France, September, 1997. Directable Behavior Models for Virtual Driving Scenarios. J. Cremer, J.K. Kearney, and P. Willemsen, Transactions of the Society for Computer Simulation, special issue on Multiagent Systems, 14(2), 1997. Creating Scientific Software. J. Cremer, R. ",
  "content_length": 14651,
  "method": "requests",
  "crawl_time": "2025-12-01 13:25:58"
}