{
  "name": "James W. Hong",
  "homepage": "http://dpnm.postech.ac.kr/~jwkhong",
  "status": "success",
  "content": "James Won-Ki Hong Home Page Welcome to James Won-Ki Hong's Home Page (Wikipage) Distributed Processing & Network Management (DP&NM) Lab Dept. of Computer Science and Engineering POSTECH, Pohang, Korea My Research Interests Blockchain & Cryptocurrency Network Intelligence, Autonomic Management Intelligent Video Conferencing Systems Personalized, Self-paced, Online Education SDN (Software Defined Networking) NFV (Network Function Virtualization) AI-based Network Management List of Current Research Projects Curriculum Vitae (2024.08) Education 1991 - PhD in Computer Science, University of Waterloo, Canada 1985 - MSc in Computer Science, University of Western Ontario, Canada 1983 - HBSc in Computer Science, University of Western Ontario, Canada Professional Activities General Chair, 2024 IEEE/IFIP Network Operations and Management Symposium (NOMS 2024) Co-Director, Center for Cryptocurrency & Blockchain Research (CCBR), POSTECH Director, Innovation Center for Education, POSTECH CTO & SEVP, Advanced Institute of Technology, KT (Korea Telecom) (Mar. 2012-Feb. 2014) Professor, Dept. of Computer Science and Engineering, POSTECH Director, Distributed Processsing and Network Management (DPNM) Lab General Chair of 2019 IEEE International Conference on Blockchain and Cryptocurrency (ICBC 2019) General Chair of IEEE Blockchain Summit Korea 2018 Conference Operations Chair of IEEE Globecom 2019, Globecom 2009 General Co-Chair of IEEE NOMS 2018, IEEE NOMS 2010 General Chair of IEEE NetSoft 2016 General Chair of APNOMS 2006, General Co-Chair of APNOMS 2008 Steering Committee Member, APNOMS ( 97, 98, 99, 00, 01, 02, 03, 05, 06, 07, 08) Advisory Board Member, Korea Network Operations and Management (KNOM) Editor-in-Chief, International Journal of Network Management (IJNM), KNOM Review Journal Editorial Board Member, IEEE TNSM, JNSM IEEE NOMS/IM Steering Committee Member EMANICS Scientific Council Member TMF UP Core Team Member Technical Program Co-Chair, NOMS 2000, APNOMS'99 Publications & Seminars [ Journal | Conference | Books | Technical Reports | Invited Seminars | Patents ] Teachings [ POSTECH | University of Western Ontario | University of Waterloo ] Student Supervisions [ POSTECH | UWO ( 1995, 1994, 1993) ] My Hobbies [ Fishing | Golf | Skiing | Scuba Diving | Marathon ] Interesting Web Sites [ Jigok Catholic Church | Tourism Korea ] Visited Countries visited 37 states (16.4%) Dr. James Won-Ki Hong Professor, Dept. of Computer Science and Engineering Pohang University of Science and Technology (POSTECH) Pohang, KoreaTel: +82 54 279 2244 Fax: +82 54 279 5663 Email: jwkhong_at_postech.ac.kr Last modified: Oct. 04, 2022 This page is maintained by J. W. Hong. If you have any questions or suggestions, please send email to jwkhong_at_postech.ac.kr",
  "content_length": 2780,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:24"
}