{
  "name": "James McKinna",
  "homepage": "https://researchportal.hw.ac.uk/en/persons/james-mckinna",
  "status": "success",
  "content": "James McKinna - Heriot-Watt Research Portal View Scopus Profile James McKinna Dr Associate Professor, School of Mathematical & Computer SciencesAssociate Professor, School of Mathematical & Computer Sciences, Computer Science EmailJ.McKinnahw.acuk EH14 4ASUnited Kingdom 1993 …2025 Research activity per year Fingerprint Dive into the research topics where James McKinna is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 1 Similar Profiles Proof Computer Science 100% calculi INIS 77% transformations INIS 59% Pure Type System Computer Science 44% construction INIS 43% reduction INIS 39% Programming Language Computer Science 38% operation INIS 38% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 1993 1993 2004 2006 2008 2009 2010 2014 2015 2016 2017 2018 2025 2025 18 Conference contribution 13 Article 8 Conference article 4 Paper 6 More 3 Chapter 1 Book 1 Other report 1 Review article Research output per year Research output per year Barendregt Convenes with Knaster and Tarski: Strong Rule Induction for Syntax with Bindingsvan Brügge, J., McKinna, J., Popescu, A. & Traytel, D., 9 Jan 2025, In: Proceedings of the ACM on Programming Languages. 9, POPL, 57.Research output: Contribution to journal › Article › peer-review Open AccessFile Syntactics 100% Inductive Proof 100% Enabling System 100% Free Variable 100% Rule Induction 100% 3 Citations (Scopus) 26 Downloads (Pure) Call-by-value and call-by-name: A simple proof of a classic theoremBiernacki, D., McKinna, J. & Sieczkowski, F., 2025, In: Journal of Functional Programming. 35, e23.Research output: Contribution to journal › Article › peer-review Open AccessFile Call by Value 100% Call by Name 100% Proof 100% values 100% evaluation 100% 141 Downloads (Pure) Forward- or Reverse-Mode Automatic Differentiation: What's the Difference?van den Berg, B., Schrijvers, T., McKinna, J. & Vandenbroucke, A., Jan 2024, In: Science of Computer Programming. 231, 103010.Research output: Contribution to journal › Article › peer-review Open AccessFile Programming Technique 100% Learning Network 100% Computational Complexity 100% Neural Network 100% Machine Learning 100% 10 Citations (Scopus) 125 Downloads (Pure) Structural Subtyping as Parametric PolymorphismTang, W., Hillerström, D., McKinna, J., Steuwer, M., Dardha, O., Fu, R. & Lindley, S., 16 Oct 2023, In: Proceedings of the ACM on Programming Languages. 7, OOPSLA2, p. 1093-1121 29 p., 260.Research output: Contribution to journal › Article › peer-review Open AccessFile calculi 100% Parametric Polymorphism 100% Subtyping 100% investigations 50% power 50% 2 Citations (Scopus) 77 Downloads (Pure) A type- And scope-safe universe of syntaxes with binding: Their semantics and proofsAllais, G., Atkey, R., Chapman, J., McBride, C. & McKinna, J., 19 Oct 2021, In: Journal of Functional Programming. 31, e22.Research output: Contribution to journal › Article › peer-review Open Access programming languages 100% universe 100% Programming Language 100% implementation 33% environment 33% 16 Citations (Scopus) View all 49 research outputs",
  "content_length": 3489,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:14"
}