{
  "name": "James Lin",
  "homepage": "https://hpc.sjtu.edu.cn/~lin",
  "status": "success",
  "content": "James Lin (林新华)_SJTU HPC James Lin (林新华) Vice Director/Assocaite Professor Office: Room 503, Network Center, 800 Dongchuan Rd, Shanghai, China 200240 Email: james AT sjtu.edu.cn Homepage: https://hpc.sjtu.edu.cn/~lin Google Scholar Short Bio Dr. James Lin co-founded the High-Performance Computing Center at Shanghai Jiao Tong University in 2012 and has served as the vice director since then. The center is one of the leading university-level supercomputer centers in China, with the fastest supercomputer Siyuan-1 (6PFlops) and the largest HPC team (30+ members) of any university in China. His current research interests include performance analysis at the microarchitecture level for emerging many-core processors, and large-scale applications on supercomputers. He has published more than 30 papers on these topics. He has served on the steering committee of IEEE CLUSTER (2020-) and the standing committee of CCF TCHPC (2020-). Additionally, he has served as a TPC member and reviewer for many HPC conferences and journals, including SC, IPDPS, and Transaction on Computers (TC). He is a senior member of the ACM and CCF. In 2002, he earned a BS degree in Computer Science from Zhejiang University, and in 2005, a MS degree in Computer Science from Shanghai Jiao Tong University. In 2018, he was awarded a PhD in mathematics and computing science from Tokyo Institute of Technology, under the supervision of Prof. Satoshi Matsuoka. Higher Level Education Tokyo Institute of Technology, Japan, Mathematical and Computing Science, Ph.D., 2013-2018 Supervisor: Professor Satoshi Matsuoka Shanghai Jiao Tong University, China, Computer Science, M.S., 2002-2005 Supervisor: Professor Xinda Lu Zhejiang University, China, Computer Science, B.S., 1998-2002 Professional Appointments Shanghai Jiao Tong University, China High Performance Computing Center Vice Director, 2012-present Associate Professor of Engineering, 2015-present Assistant Professor, 2012-2014 Department of Computer Science Assistant Professor, 2008-2011 Research Associate, 2005-2007 Tokyo Institute of Technology, Japan Global Scientific Information and Computing Center (GSIC) Visiting Fellow, 2016-2018 Visiting Associate, 2013-2015 Honors & Awards Outstanding Contribution Award, Green Computing Consortium, 2019 CCF Senior Member, 2019 ACM Senior Member, 2018 SMC-Excellent Young Faculty Award, Shanghai Jiao Tong University, 2016-2018 RONPAKU Fellowship, Japan Society for the Promotion of Science, 2013-2016 Outstanding Teaching Award, Shanghai Jiao Tong University, 2013 Supercomputers I've Designed Supercomputer π 1.0, 2013-2019, was the largest one in the China's universities. Supercomputer π 2.0, 2019-present Research Projects PI, NSFC, Research on Essential Mechanisms and Key Technologies of Processor Performance Variations in Large-scale Computing Systems (NO.62072300), 2021-2024 Key member, The National Key R&D Program of China, Research on National HPC environment service mechanism and support architecture (NO.2016YFB0201400), 2016-2018 PI, Intel Parallel Computing Center, 2017-2018 Co-PI, NSF, Performance Scalability and Portability on Advanced HPC Systems (NO.ACI-1440733), 2016-2017, with Prof. William Tang PI, NVIDIA CUDA Center of Excellence (CCoE), 2011-2016 PI, NVIDIA Academic Partnership, 2009 Major Academic Services Standing Committee TCHPC, China Computer Federation (CCF), 2020-present Steering Committees IEEE International Conference on Cluster Computing (Cluster), 2020-2022 Intel eXtreme Performance Users Group (IXPUG), 2018-present Organizing Committees Technical Program Archives Vice Chair, IEEE/ACM International Conference for High Performance Computing, Networking, Storage and Analysis (SC), 2019 Co-Chair, Intel eXtreme Performance Users Group (IXPUG) Asia Workshop, 2019 Publicity co-chair, ACM International Conference on Computing Frontiers (CF), 2019, 2021 Publicity co-chair, International Conference on Parallel Architectures and Compilation Techniques (PACT), 2019 Chair, the ARM HPC Workshop in China, 2018-2019 Chair, Intel Parallel Computing Center (IPCC) Asia Summit, 2018 Publicity co-chair, IEEE International Conference on Parallel Processing (ICPP), 2017 Publicity co-chair, IEEE International Conference on Cluster Computing (Cluster), 2016 Co-Chair, IEEE TCSC Scalable Computing (SCALE) Challenge, 2015 Program Committees: IEEE/ACM International Conference for High Performance Computing, Networking, Storage and Analysis (SC), 2013, 2016 IEEE International Parallel and Distributed Processing Symposium (IPDPS), 2017 International Conference on Parallel Processing (ICPP), 2016-2017 IEEE International Conference on Cluster Computing (Cluster): 2015-2016, 2020 IEEE International Conference on High Performance Computing and Communications (HPCC), 2017 Selected Publications Bozitao Zhong, Xiaoming Su, Minhua Wen, Sicheng Zuo, Liang Hong, James Lin. ParaFold: Paralleling AlphaFold for Large-Scale Predictions. HPC Asia 2022. Binrui Li, Chenggan Chen, James Lin. tcFFT: A Fast Half-Precision FFT Library for NVIDIA Tensor Cores. IEEE CLUSTER 2021. Yi-Chao Wang, Jie Wang, Jin-Kun Chen, Si-Cheng Zuo, Xiao-Ming Su and James Lin. NeoMPX: Characterizing and Improving Estimation of Multiplexing Hardware Counters for PAPI. IEEE CLUSTER 2020. S. Chen, H.-R. Yu, D. Inman, Q. Liao, Q. Wu, and J. Lin, Cube - towards an optimal scaling of cosmological n-body simulations, in 2020 20th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGRID), IEEE, 2020. Y.-C. Wang, J.-K. Chen, B.-R. Li, S.-C. Zuo, W. Tang, B. Wang, Q.-C. Liao, R. Xie, and J. Lin, An empirical study of hpc workloads on huawei kunpeng 916 processor, in 2019 IEEE 25th International Conference on Parallel and Distributed Systems (ICPADS), pp. 360-367, IEEE, 2019. J. Lin, Z. Xu, L. Cai, A. Nukada, and S. Matsuoka, Evaluating the sw26010 many-core processor with a micro-benchmark suite for performance optimizations, Parallel Computing, vol. 77, pp. 128- 143, 2018. J. Lin, M. Wen, D. Meng, X. Liu, A. Nukada, and S. Matsuoka, Optimizing preconditioned conjugate gradient on taihulight for openfoam, in 2018 18th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGRID), pp. 273-282, IEEE, 2018. L. Cai, Y.-C. Wang, W. Tang, B. Wang, S. Ethier, Z. Liu, and J. Lin, Openacc vs the native programming on sunway taihulight: A case study with gtc-p, in 2018 IEEE International Conference on Cluster Computing (CLUSTER), pp. 88-97, IEEE, 2018. C. Liu, J. Wei, Y.-C. Wang, M. Wen, S. See, and J. Lin, Optimizing deep learning frameworks incrementally to get linear speedup: A comparison between ipoib and rdma verbs, in 2018 IEEE 24th International Conference on Parallel and Distributed Systems (ICPADS), pp. 473-480, IEEE, 2018. M. Wen, M. Chen, and J. Lin, Optimizing a particle-in-cell code on intel knights landing, in Proceedings of Workshops of HPC Asia, pp. 71-74, ACM, 2018. J. Lin, Z. Xu, A. Nukada, N. Maruyama, and S. Matsuoka, Optimizations of two compute-bound scientific kernels on the sw26010 many-core processor, in 2017 46th International Conference on Parallel Processing (ICPP), pp. 432-441, IEEE, 2017. Z. Xu, J. Lin, and S. Matsuoka, Benchmarking sw26010 many-core processor, in 2017 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW), pp. 743-752, IEEE, 2017. D. Meng, M. Wen, J. Wei, and J. Lin, Hybrid implementation and optimization of openfoam on the sw26010 many-core processor, HPC China, 2016. Y. Wang, J. Lin, L. Cai, W. Tang, S. Ethier, B. Wang, S. See, and S. Matsuoka, Porting and optimizing gtc-p on taihulight supercomputer with sunway openacc, HPC China, 2016. Y. Wei, Y. Wang, L. Cai, W. Tang, B. Wang, S. Ethier, S. See, and J. Lin, Performance and portability studies with openacc accelerated version of gtc-p, in 2016 17th International Conference on Parallel and Distributed Computing, Applications and Technologies (PDCAT), pp. 13-18, IEEE, 2016. S. Li and J. Lin, Accelerating asian option pricing on many-core architectures, Concurrency and Computation: Practice and Experience, vol. 28, no. 3, pp. 848-865, 2016. D. Ding, M. Wen, S. Zhou, M. Chen, and J. Lin, Optimization and evaluation of vlpl-s particle- in-cell code on knights landing, HPC China, 2016. Network Center, 800 Dongchuan Road, Shanghai, China 200240",
  "content_length": 8352,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:09"
}