{
  "name": "Jamie Vicary",
  "homepage": "https://www.cl.cam.ac.uk/~jv258",
  "status": "success",
  "content": "Jamie Vicary Skip to content | Access key help Search Advanced searchA–ZContact us Computer Laboratory Jamie Vicary Professor of Future Computation Royal Society University Research Fellow Fellow of King's College Email: jamie.vicary@cl.cam.ac.uk Office: FS22 Telephone: 01223 7(63510) Address: Computer Laboratory, University of Cambridge,J. J. Thomson Avenue, Cambridge, CB3 0FD, UK Graduate textbook on category theory and quantum computation now available! OUP Amazon.co.uk Amazon.com My research aims to develop new logical and structural techniques, with the goal to transform the way we compute in the future, across a range of areas including quantum and classical computation. A lot of my research uses the tools of category theory, a rich abstract language for understanding how interacting systems process information. I am also interested in studying category theory itself, finding ways to make it more powerful and easier to use. I work as part of the Cambridge Logical Structures Hub (CLASH) research group in the department. I love welcoming new members to my team. If you are interested in working with me as an undergraduate, Masters or PhD student, or if you'd like to ask about postdoctoral research opportunities, send me a message and I'd be happy to chat. Geometrical higher category theory. A longstanding problem in higher category theory has been to define a semistrict theory, where part of the syntax is trivialized, making the theory easier to use. One standard approach to this is string diagrams, and this has been a major focus over the last several years, resulting in the graphical proof assistant homotopy.io for semistrict n-categories (LICS2022#P41, LICS2019#P36, LICS2017#P29.) The latest version is developed in Rust (github), and allows construction of composites and homotopies in arbitrary dimension, in a strictly associative and unital setting, with advanced visualisation options including Morse projection, 3d and 4d rendering, and LaTeX export. Collaborators include Krzysztof Bar, Nathan Corbyn, Lukas Heidemann, Nick Hu, David Reutter and Calin Tataru. Type theory for higher category theory. An exciting major line of current activity is using type theory to understand the properties of higher categories. In recent work we gave a new definition of strictly unital ∞-category (LICS2022#P36) which has better properties than the one previously in the literature, and also the first general definition of strictly associative ∞-category (2109.01513#P39). Collaboration with Eric Finster, David Reutter and Alex Rice. Complexity of geometrical calculi. We have a developing interest in complexity-theoretic aspects of geometrical techniques, an exciting area where much remains to be done. We have shown that the word problem for monoidal categories can be solved in quadratic time (LMCS2018#P34), and that the word problem for braided monoidal categories is at least as hard as the unknot problem (ACT2021#P40). Joint work with my student Antonin Delpeuch. Quantum combinatorics. Our goal in this area is to understand the nature of a wide range of quantum combinatorial objects, and how they interact with each other, using the tools of category theory. Major contributions here include the definition of quantum Latin squares (QIC2015#P17, QIP 2016), and a new way to use higher category theory to define unitary error bases, quantum Latin squares and other combinatorial objects as biunitary vertices in the 2-category of 2-Hilbert spaces (LICS2012#P8, QIP 2017). Joint work with my students Benjamin Musto and David Reutter. Dynamics of quantum systems. Categorical techniques have powerful application in the area of quantum dynamics, where we can use simple geometrical rules to understand the origins of computational effects. In a new collaboration, we recently used these techniques to show that exact measurement correlations can be computed in heterogenous qubit networks even when measurements are interspersed arbitrarily with unitary gates (2207.00025#P42). In other work we showed how a shaded tangle calculus gives a powerful language for understanding a wide range of quantum computational phenomena, including quantum error correction, where we can see for the first time the errors being \"captured\" by \"bubbles\" and eliminated (PRSA#P30). We also showed how string diagrams can be used to understand the dynamics of some important quantum algorithms (LICS2013#P9). Collaborators include Pieter Claeys, Marius Henry, Austen Lamacraft and David Reutter. Topological quantum field theory. If a quantum field theory has the property that its partition function depends only on the diffeomorphism class of the manifold, it is called topological. We showed that 3-dimensional TQFTs extended to points are classified precisely by modular tensor categories equipped with certain extra data, settling an important long-standing conjecture (1509.06811#P18). Other work on 2-dimensional TQFT showed that the wormhole creation process is identical to the entanglement creation process, verifying in a topological setting the ER=EPR hypothesis of Maldacena and Susskind (CQG2014#P12). Collaborators include John Baez, Bruce Bartlett, Christopher Douglas and Christopher Schommer-Pries. Biography. I joined Cambridge as a member of faculty in 2020. Before that I was a faculty member in the Theoretical Computer Science research group in Birmingham, which followed several years as a postdoctoral researcher in the Quantum Group in the Computer Science department at Oxford, and also at the Centre for Quantum Technologies in Singapore. I did my PhD in Physics at Imperial College London under the supervision of Professor Chris Isham, which was awarded in 2009, and which focused on the mathematical foundations of quantum computation. Before that I took the fantastic Maths Part III course in Cambridge with a specialization in quantum physics, which followed a first degree in Physics at Mansfield College in Oxford. I am always interested in taking on new PhD or Masters students, or starting new collaborations. If you're interested in my research, feel free to get in touch. The future The past May 2024. Our paper \"Computads for weak ∞-categories as an inductive type\" has been accepted for publication in Advances in Mathematics (with Christopher Dean, Eric Finster, Ioannis Markakis and David Reutter.) April 2024. Our paper \"A syntax for strictly associative and unital ∞-categories\" has been accepted for presentation at LICS 2024. (With Eric Finster and Alex Rice.) February 2024. New preprint \"homotopy.io: a proof assistant for finitely-presented globular n-categories\", a tool description paper for the homotopy.io system. UPDATE: Accepted at FSCD 2024. January 2024. New preprint \"The theory and applications of anticolimits\", giving the theory of a new anticolimit construction, which can generate new gluing information for pushout-attachment problems. (With Calin Tataru.) June 2023. I will be an invited speaker at LOOPS '23 at the Mathematical Research and Conferences Centre in Bedlewo, Poland. May 2023. New preprint \"Posetal diagrams for logically-structured semistrict higher categories\", which defines a new type of string diagram powerful enough to represent categorical limits. (With Chiara Sarti.) UPDATE: Accepted for ACT 2023. May 2023. New preprint \"A layout algorithm for higher-dimensional string diagrams\" which uses factorization systems in the category of posets to extract the constraint data necessary for computing attractive layouts of higher-dimensional string diagrams. (With Calin Tataru.) April 2023. I will be speaking at the Midlands Graduate School 2023, delivering an invited lecture course on \"Computational models of higher categories\". February 2023. New preprint \"A 2-categorical model for exactly-solvable many-body quantum dynamics\" (with Pieter Claeys and Austen Lamacraft) which uses 2-categorical technology to unify Prosen's \"round-a-face\" dual unitarity with traditional dual unitarity, and shows how these are distinct \"quantum phases\" which can interact richly. February 2023. New preprint \"Strictly associative and unital ∞-categories as a generalized algebraic theory\" (with Eric Finster and Alex Rice). Here we give the first definition of strictly associative and unital ∞-category, along with a computer implementation. UPDATE: Accepted at LICS 2024. December 2022. The Tenth Symposium on Compositional Structures (SYCO 10) will be hosted by Chris Heunen in Edinburgh on 19-20 December. October 2022. Welcome to Chiara Sarti and Haiqi Wu who have started with me as PhD students. September 2022. The Ninth Symposium on Compositional Structures (SYCO 9) will take place on 8-9 September at the University of Insubria, organized by Nicoletta Sabadini and Elena di Lavore. August 2022. Preprint \"Computads for weak ∞-categories as an inductive type\" (with Christopher Dean, Eric Finster, Ioannis Markakis and David Reutter) where we give a new elementary, inductive definition of computad, and show how to derive many important properties of computads from first principles. UPDATE: Accepted to appear in Advances in Mathematics. August 2022. Welcome to Manuel Araujo who will be starting in my group as a postdoc. July 2022. Preprint \"Exact dynamics in dual-unitary quantum circuits with projective measurements\" (with Pieter Claeys, Marius Henry and Austen Lamacraft), which shows how we can get exactly solvable correlations in heterogenous lattices which combine biunitary dynamics with measurements in a unitary basis. UPDATE: Accepted for publication in Physical Review Research. June 2022. I have been awarded the Birkhoff–von Neumann Prize 2022 for my research on quantum foundations. May 2022. Two papers accepted to LICS 2022, \"Zigzag normalisation for associative n-categories\" and \"A type theory for strictly unital ∞-categories\". May 2022. If you're an undergraduate student in Cambridge and love programming in Rust, you're welcome to apply for my summer project worki",
  "content_length": 50689,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:30"
}