{
  "name": "Jamie H. Morgenstern",
  "homepage": "http://jamiemorgenstern.com",
  "status": "success",
  "content": "Jamie Morgenstern's Homepage Show Menu Home Teaching ￬ Introduction to Machine Learning (Winter 2023) Introduction to Machine Learning (Fall 2022) Foundations :) of Fairness in Machine Learning (Winter 2022) Introduction to Machine Learning (Fall 2021) Foundations of Computing (Spring 2021) Introduction to Machine Learning (Fall 2020) Introduction to Machine Learning (Spring 2020) Foundations of Fairness in Machine Learning (Winter 2020) Foundations of Fairness in Machine Learning (Fall 2018) Design and Analysis of Algorithms (Spring 2018) Principles of Imperative Computation (Su 2012) Publications Workshops/Tutorials ￬ AGT + Data Science, EC 2016 Dagstuhl 2017 Service Jamie Morgenstern Assistant Professor in the Paul G. Allen School of Computer Science & Engineering at the University of Washington Office: Email: 'jamiemmt' 'at' 'cs 'dot' 'washington' 'dot' 'edu' I am an assistant professor in the Paul G. Allen School of Computer Science & Engineering at the University of Washington. I was previously an assistant professor in the School of Computer Science at Georgia Tech. Prior to starting as faculty, I was fortunate to be hosted by Michael Kearns, Aaron Roth, and Rakesh Vohra as a Warren Center fellow at the University of Pennsylvania. I completed my PhD working with Avrim Blum at Carnegie Mellon University. I study the social impact of machine learning and the impact of social behavior on ML's guarantees. How should machine learning be made robust to behavior of the people generating training or test data for it? How should ensure that the models we design do not exacerbate inequalities already present in society? Working papers Multi-learner risk reduction under endogenous participation dynamics. Sarah Dean, Mihaela Curmei, Lillian J. Ratliff, Jamie Morgenstern, Maryam Fazel Optimal Spend Rate Estimation and Pacing for Ad Campaigns with Budgets. Bhuvesh Kumar, Jamie Morgenstern and Okke Schrijvers. Predictive Inequity in Object Detection , joint with Benjamin Wilson and Judy Hoffman. Code can be found here. News coverage in Vox, Businesss Insider, The Guardian, NBC News. White papers Facial Recognition Technologies in the Wild: A Call for a Federal Office, Erik Learned-Miller, Vicente Ordóñez, Jamie Morgenstern, and Joy Buolamwini. Committee for the Study of Digital Platforms, Market Structure and Antitrust Subcommittee Report, joint with Fiona Scott Morton (chair), Theodore Nierenberg, Pascal Bouvier, Ariel Ezrachi, Bruno Jullien, Roberta Katz, Gene Kimmelman, and A. Douglas Melamed. Mentoring I'm very fortunate to have worked with the following excellent students. Current students: Rachel Hong (PhD) Jie (Claire) Zhang (PhD) Yuanyuan (Chloe) Yang (PhD) Past students and visitors: Daniel Jiang (MS) Bhuvesh Kumar (PhD, SCS, joint with Jake Abernethy) Aditya Saraf (MS) Benjamin Wilson (MS) Angel (Alex) Cabrera (BS) Varun Gupta (BS) Dhamma Kimpara (BS) Postdoctoral researchers Min Jae Song Matthäus Kleindessner Sarah Dean Service In 2020, I was an area chair for ICML, on the SPC for EC, ICLR, and COLT. I served as general cochair for FAT* 2019, which took place in Atlanta! In 2019, I served as an SPC member for EC and ICML. For 2018, I was on the PC for EC, ICML, FAT*, WWW, and ALT. In 2017, I was on the PC for EC, ICML, NetEcon, and FAT/ML. I also served on the EC PC in 2016. Funding My research is currently supported by: An NSF Career award, \"Strategic and Equity Considerations in Machine Learning\". The Theory of Computing for Fairness, A Simons collaboration project. Previously, I was fortunate to be supported by the Simons Award for Graduate Students in Theoretical Computer Science (2014-2016), an NSF GFRP fellowship, as well as the Microsoft Research Graduate Women's Scholarship. Publications NeurIPS 2024 Initializing services in interactive ml systems for diverse users Avinandan Bose, Mihaela Curmei, Daniel L Jiang, Jamie Morgenstern, Sarah Dean, Lillian J Ratliff, Maryam Fazel NeurIPS 2024 Reconstruction Attacks on Machine Unlearning: Simple Models are Vulnerable Martin Bertran, Shuai Tang, Michael Kearns, Jamie Morgenstern, Aaron Roth, Zhiwei Steven Wu EAAMO 2024 Who's in and who's out? A case study of multimodal CLIP-filtering in DataComp Rachel Hong, William Agnew, Tadayoshi Kohno, Jamie Morgenstern UAI 2024 Emergent specialization from participation dynamics and multi-learner retraining. Sarah Dean, Mihaela Curmei, Lillian Ratliff, Jamie Morgenstern, Maryam Fazel UAI 2024 Fair Active Learning in Low-Data Regimes Romain Camilleri, Andrew Wagenmaker, Jamie Morgenstern, Lalit Jain, Kevin Jamieson NeurIPS 2023 Doubly Constrained Fair Clustering John Dickerson, Seyed Esmaeili, Jamie Morgenstern, Claire Jie Zhang NeurIPS 2023 Scalable Membership Inference Attacks via Quantile Regression. Martin Bertran, Shuai Tang, Aaron Roth, Michael Kearns, Jamie Morgenstern, Steven Wu AIES 2023 Evaluation of targeted dataset collection on racial equity in face recognition. Rachel Hong, Tadayohsi Kohno, and Jamie Morgenstern. AIES 2023 Multicalibrated Regression for Downstream Fairness. Ira Globus-Harris and Varun Gupta and Christopher Jung and Michael Kearns and Jamie Morgenstern and Aaron Roth. FORC 2023 Distributionally Robust Data Join. Pranjal Awasthi, Christopher Jung, Jamie Morgenstern. NeurIPS 2022 Active learning with Safety ConstraintsRomain Camilleri, Andrew Wagenmaker, Jamie Morgenstern, Lalit Jain, Kevin Jamieson. ICML 2022 Individual Preference Stability for ClusteringSaba Ahmadi, Pranjal Awasthi, Samir Khuller, Matthäus Kleindessner, Jamie Morgenstern, Pattara Sukprasert, Ali Vakilian ICML 2022 Active Sampling for Min-Max Fairness. Jacob Abernethy, Pranjal Awasthi, Matthäus Kleindessner,Jamie Morgenstern, Chris Russel, Claire Zhang. EC 2022 Preference Dynamics Under Personalized Recommendations. Sarah Dean and Jamie Morgenstern. FaccT 2021 Evaluating Fairness of Machine Learning Models Under Uncertain and Incomplete Information. Pranjal Awasthi, Alex Beutel, Matthäus Kleindessner, Jamie Morgenstern, and Xuezhi Wang. CACM 2021 Datasheets for Datasets. Timnit Gebru, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumé III, Kate Crawford. AISTATS 2020 Equalized odds postprocessing under imperfect group information. Pranjal Awasthi, Matthäus Kleindessner, Jamie Morgenstern. WINE 2020 Competition Alleviates Present Bias in Task Completion. Aditya Saraf, Anna Karlin, and Jamie Morgenstern. AIES (AI, Ethics and Society) 2020 Diversity and Inclusion in Subset Selection. Alex Hanna, Dylan Baker, Emily Denton, Nyalleng Moorosi, Ben Hutchinson, Timnit Gebru, Meg Mitchell, Jamie Morgenstern. NeurIPS 2019 Learning Auctions with Incentive Guarantees. Jacob Abernethy, Rachel Cummings, Bhuvesh Kumar, Jamie Morgenstern, Samuel Taggart. NeurIPS 2019 Multi-Criteria Dimensionality Reduction with Applications to Fairness Jamie Morgenstern, Samira Samadi, Mohit Singh, Uthaipon Tantipongpipat, Santosh Vempala. VIS 2019 FairVis: Visual Analytics for Discovering Intersectional Bias in Machine Learning. Ángel Alexander Cabrera, Will Epperson, Fred Hohman, Minsuk Kahng, Jamie Morgenstern, Duen Horng Chau. ICML 2019 Guarantees for Spectral Clustering with Fairness Constraints. Matthäus Kleindessner, Samira Samadi, Pranjal Awasthi, Jamie Morgenstern. ICML 2019 Fair k-center clustering for data summarization. Matthäus Kleindessner, Pranjal Awasthi, Jamie Morgenstern. NeurIPS 2018 The Price of Fair PCA: One Extra Dimension. Samira Samadi, Uthaipon Tantipongpipat, Mohit Singh, Jamie Morgenstern, and Santosh Vempala. NeurIPS 2018 A Smoothed Analysis of the Greedy Algorithm. Sampath Kannan, Jamie Morgenstern, Aaron Roth, Boes Waggoner, and Steven Wu. ICML 2017 Fairness in Reinforcement Learning. Shahin Jabbari, Matthew Joseph, Michael Kearns, Jamie Morgenstern, and Aaron Roth. EC 2017Fairness Incentives for Myopic Agents. Sampath Kannan, Michael Kearns, Jamie Morgenstern, Mallesh Pai, Aaron Roth, Rakesh Vohra, and Zhiwei Steven Wu.arxiv WINE 2016 Strategic Network Formation with Attack and Immunization Sanjeev Goyal, Shahin Jabbari, Michael Kearns, Sanjeev Khanna, Jamie Morgenstern.arxiv NeurIPS 2016 Fairness in Learning: Classic and Contextual Bandits. Matthew Joseph, Michael Kearns, Jamie Morgenstern, and Aaron Roth.arxiv EC 2016Simple Mechanisms for Agents with Complements Michal Feldman, Ophir Friedler, Jamie Morgenstern, Guy Reinerarxiv COLT 2016Learning Simple Auctions Jamie Morgenstern, Tim Roughgardenarxiv STOC 2016Do Prices Coordinate Markets? (short version)Justin Hsu, Jamie Morgenstern, Ryan Rogers, Aaron Roth, Rakesh Vohraarxiv NeurIPS 2015 The Pseudo-Dimension of Nearly Optimal Auctions Selected for a spotlight presentation, along with 3.6% of submissions. Jamie Morgenstern and Tim Roughgardenarxiv EC 2015Private Pareto-Optimal ExchangeSampath Kannan, Jamie Morgenstern, Ryan Rogers, and Aaron Rotharxiv EC 2015Simple Auctions with Simple StrategiesNikhil Devanur, Jamie Morgenstern, Vasilis Syrgkanis, S. Matthew Weinberg EC 2015Learning What's Going On: Reconstruction Preferences and Priorities from Opaque TransactionsAvrim Blum, Yishay Mansour, Jamie Morgensternarxiv IJCAI 2015Impartial Peer ReviewDavid Kurokawa, Omer Lev, Jamie Morgenstern, Ariel Procaccia SODA 2015Approximately Stable, School Optimal, and Student-Truthful Many-to-One Matchings (via Differential Privacy)Sampath Kannan, Jamie Morgenstern, Aaron Roth, Steven Wuarxiv AAAI 2015Learning Valuation Distributions from Partial ObservationAvrim Blum, Yishay Mansour, Jamie Morgensternarxiv ITCS 2015Privacy-preserving Public Information in Sequential GamesAvrim Blum, Jamie Morgenstern, Ankit Sharma, Adam Smitharxiv AAAI 2013How Bad is Selfish Voting?Simina Brânzei, Ioannis Caragiannis, Jamie Morgenstern, Ariel D. Procaccia COSN 2013 Hierarchical community decomposition via oblivious routing techniques William Sean Kennedy, Jamie Morgenstern, Gordon Wilfong, Lisa Zhang APPROX 2012Additive Approximation for Near-Perfect Phylogeny Constr",
  "content_length": 10935,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:28"
}