{
  "name": "Jamie Twycross",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/jamie.twycross",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Jamie TwycrossAssociate Professor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsResearchPublications Contact workRoom B48 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/ajamie.twycross@nottingham.ac.ukhttps://cs.nott.ac.uk/~pszjpt Research SummaryI am an interdisciplinary Computer Scientist working at the interface of Computer Science and the biological sciences. My research focusses on developing computational modelling and machine learning… read moreRecent Publications CHEN C, TWYCROSS J and GARIBALDI J M, 2017. A new accuracy measure based on bounded relative error for time series forecasting PLoS ONE. 12(3), e0174202BAKER M, NEGUS D, RAGHUNATHAN D, RADFORD P, MOORE C, CLARK G, DIGGLE M, TYSON J, TWYCROSS J and SOCKETT RE, 2017. Measuring and modelling the response of Klebsiella pneumoniae KPC prey to Bdellovibrio bacteriovorus predation, in human serum and defined buffer. Scientific reports. 7(1), 8329CHEN C, TWYCROSS J and GARIBALDI JM, 2017. A new accuracy measure based on bounded relative error for time series forecasting. PloS one. 12(3), e0174202CHEN, CHAO, JOHN, ROBERT, TWYCROSS, JAMIE and GARIBALDI, JONATHAN M, 2016. An extended ANFIS architecture and its learning properties for type-1 and interval type-2 models View all publications Current ResearchI am an interdisciplinary Computer Scientist working at the interface of Computer Science and the biological sciences. My research focusses on developing computational modelling and machine learning approaches to address hard, real-world biological problems. My interdisciplinary research reflects my deep interest in understanding how the biological and digital worlds work and interact. I am a member of the Intelligent Modelling and Analysis Group, and lead the Modelling Group in the Synthetic Biology Research Centre. Research expertise computational and mathematical modelling machine learning and artificial intelligence data analytics and visualisation software engineering Research areas computational biology synthetic biology systems biology systems medicine sustainable chemistry artificial life biologically-inspired computing artificial immune systems computer security and networking robotics CHEN C, TWYCROSS J and GARIBALDI J M, 2017. A new accuracy measure based on bounded relative error for time series forecasting PLoS ONE. 12(3), e0174202BAKER M, NEGUS D, RAGHUNATHAN D, RADFORD P, MOORE C, CLARK G, DIGGLE M, TYSON J, TWYCROSS J and SOCKETT RE, 2017. Measuring and modelling the response of Klebsiella pneumoniae KPC prey to Bdellovibrio bacteriovorus predation, in human serum and defined buffer. Scientific reports. 7(1), 8329CHEN C, TWYCROSS J and GARIBALDI JM, 2017. A new accuracy measure based on bounded relative error for time series forecasting. PloS one. 12(3), e0174202CHEN, CHAO, JOHN, ROBERT, TWYCROSS, JAMIE and GARIBALDI, JONATHAN M, 2016. An extended ANFIS architecture and its learning properties for type-1 and interval type-2 models BONTHALA VS, MAYES K, MORETON J, BLYTHE M, WRIGHT V, MAY ST, MASSAWE F, MAYES S and TWYCROSS J, 2016. Identification of Gene Modules Associated with Low Temperatures Response in Bambara Groundnut by Network-Based Analysis. PloS one. 11(2), e0148771BLAKES, JONATHAN, TWYCROSS, JAMIE, KONUR, SAVAS, ROMERO-CAMPERO, FRANCISCO JOSE, KRASNOGOR, NATALIO and GHEORGHE, MARIAN, 2014. Infobiotics Workbench: AP Systems Based Tool for Systems and Synthetic Biology. In: Applications of Membrane Computing in Systems and Synthetic Biology Springer International Publishing. 1-41BLAKES, J., TWYCROSS, J., ROMERO-CAMPERO, F.J. and KRASNOGOR, N., 2011. The Infobiotics Workbench: an integrated in silico modelling platform for systems and synthetic biology Bioinformatics. 27(23), 3323-3324DUPEUX, F., SANTIAGO, J., BETZ, K., TWYCROSS, J., PARK, S-Y., RODRIGUEZ, L., GONZALEZ-GUZMAN, M., JENSEN, M.R., KRASNOGOR, N., BLACKLEDGE, M., HOLDSWORTH, M., CUTLER, S.R., RODRIGUEZ, P.L. and MÁRQUEZ, J.A., 2011. A thermodynamic switch modulates abscisic acid receptor sensitivity EMBO Journal. 30(20), 4171-4184KERR, IAN D, CARRIER, DAVID J and TWYCROSS, JAMIE, 2011. Hormone transport. In: The Plant Plasma Membrane Springer. 379-397DUPEUX, FLORINE, SANTIAGO, JULIA, BETZ, KATJA, TWYCROSS, JAMIE, PARK, SANG-YOUL, RODRIGUEZ, LESIA, GONZALEZ-GUZMAN, MIGUEL, JENSEN, MALENE RINGKJØBING, KRASNOGOR, NATALIO, BLACKLEDGE, MARTIN and OTHERS, 2011. A thermodynamic switch modulates abscisic acid receptor sensitivity The EMBO journal. 30(20), 4171-4184TWYCROSS, J., BAND, L.R., BENNETT, M.J., KING, J.R. and KRASNOGOR, N., 2010. Stochastic and deterministic multiscale models for systems biology: an auxin-transport case study BMC Systems Biology. 4, 34TWYCROSS, J. and AICKELIN, U., 2010. Information fusion in the immune system Information Fusion. 11(1), 35-44JAMIE TWYCROSS, UWE AICKELIN and AMANDA WHITBROOK, 2010. Detecting Anomalous Process Behaviour using Second Generation Artificial\tImmune Systems International Journal of Unconventional Computing. 6 (3-4), 301-326GREENSMITH, JULIE, AICKELIN, UWE and TWYCROSS, JAMIE, 2010. Detecting danger: applying a novel immunological concept to intrusion detection systems arXiv preprint arXiv:1002.0696. KIM, JUNGWON, GREENSMITH, JULIE, TWYCROSS, JAMIE and AICKELIN, UWE, 2010. Malicious code execution detection and response immune system inspired by the danger theory arXiv preprint arXiv:1003.4142. TWYCROSS, JAMIE and AICKELIN, UWE, 2010. Information fusion in the immune system Information Fusion. 11(1), 35-44TWYCROSS, JAMIE, BAND, LEAH, BENNETT, MALCOLM, KING, JOHN and KRASNOGOR, NATALIO, 2010. Stochastic and deterministic multiscale models for systems biology: an auxin-transport case study BMC systems biology. 4(1), 34TWYCROSS, JAMIE, AICKELIN, UWE and WHITBROOK, AMANDA, 2010. Detecting Anomalous Process Behaviour using Second Generation Artificial Immune Systems. International Journal of Unconventional Computing. 6, TWYCROSS, JAMIE and AICKELIN, UWE, 2010. Experimenting with innate immunity arXiv preprint arXiv:1004.2854. GARCÍA-MARTÍNEZ, CARLOS, LIMA, CLAUDIO, TWYCROSS, JAMIE, KRASNOGOR, NATALIO and LOZANO, MANUEL, 2010. P system model optimisation by means of evolutionary based search algorithms In: Proceedings of the 12th annual conference on Genetic and evolutionary computation. 187-194TWYCROSS, JAMIE and AICKELIN, UWE, 2010. Towards a Conceptual Framework for Innate Immunity arXiv preprint arXiv:1006.1568. ROMERO-CAMPERO, FRANCISCO J, TWYCROSS, JAMIE, CÁMARA, MIGUEL, BENNETT, MALCOLM, GHEORGHE, MARIAN and KRASNOGOR, NATALIO, 2009. Modular assembly of cell systems biology models using P systems International Journal of Foundations of Computer Science. 20(03), 427-442TWYCROSS, JAMIE and AICKELIN, UWE, 2009. An Immune Inspired Approach to Anomaly Detection arXiv preprint arXiv:0910.3117. ROMERO-CAMPERO, FRANCISCO JOSÉ, TWYCROSS, JAMIE, CAO, HONGQING, BLAKES, JONATHAN and KRASNOGOR, NATALIO, 2009. A multiscale modeling framework based on P systems. In: Membrane Computing Springer. 63-77ALLEN, ELIZABETH, HOOKS, MARK, BERGLUND, MARTIN, CASTRO, HILMAR, LOVRICS, ANNA, PEARSON, TAL, POPOVICH, NIKOLAS, TWYCROSS, JAMIE, VIGLIOTTI, MARIA GRAZIA, VILLASANIA, MINAYA and OTHERS, 2009. Modelling carbon assimilatory and recycling pathways in Arabidopsis seedlings JAMIE TWYCROSS and UWE AICKELIN, 2008. An Immune Inspired Approach to Anomaly Detection. In: Handbook of Research on Information Security and Assurance. Chapter XTWYCROSS, JAMIE, ROMERO-CAMPERO, FRANCISCO, BENNETT, MALCOLM, CÁMARA, MIGUEL and KRASNOGOR, NATALIO, 2008. Modular assembly of cell systems biology models using P systems Proceedings of Prague International Workshop on Membrane Computing. 51-62UWE AICKELIN, JAMIE TWYCROSS, THOMAS HESKETH-ROBERTS, 2007. Rule Generalisation in Intrusion Detection Systems using Snort International Journal of Electronic Security and Digital Forensics. 1(1), 101 - 116KIM, JUNGWON, BENTLEY, PETER J, AICKELIN, UWE, GREENSMITH, JULIE, TEDESCO, GIANNI and TWYCROSS, JAMIE, 2007. Immune system approaches to intrusion detection-a review Natural computing. 6(4), 413-466TWYCROSS, JAMIE and AICKELIN, UWE, 2007. Biological inspiration for artificial immune systems. In: Artificial immune systems Springer. 300-311AICKELIN, UWE, TWYCROSS, JAMIE and HESKETH-ROBERTS, THOMAS, 2007. Rule generalisation in intrusion detection systems using SNORT International Journal of Electronic Security and Digital Forensics. 1(1), 101-116JULIE GREENSMITH, JAMIE TWYCROSS, UWE AICKELIN, 2006. Dendritic Cells for Anomaly Detection In: Proceedings of the IEEE Congress on Evolutionary Computation (CEC 2006), Vancouver, Canada,. 664-671JAMIE TWYCROSS, UWE AICKELIN, 2006. libtissue - implementing innate immunity In: Proceedings of the IEEE Congress on Evolutionary Computation (CEC 2006), Vancouver, Canada. 499 -506JAMIE TWYCROSS and UWE AICKELIN, 2006. Experimenting with innate immunity In: Proceedings of the Workshop on Artificial Immune Systems and Immune\tSystem Modelling (AISB06), Bristol, UK. 18-19GREENSMITH, JULIE, AICKELIN, UWE and TWYCROSS, JAMIE, 2006. Articulation and clarification of the dendritic cell algorithm. In: Artificial Immune Systems Springer. 404-417GREENSMITH, JULIE, TWYCROSS, JAMIE and AICKELIN, UWE, 2006. Dendritic cells for anomaly detection In: Evolutionary Computation, 2006. CEC 2006. IEEE Congress on. 664-671TWYCROSS, JAMIE and AICKELIN, UWE, 2006. Libtissue-implementing innate immunity In: Evolutionary Computation, 2006. CEC 2006. IEEE Congress on. 499-506TEDESCO, GIANNI, TWYCROSS, JAMIE and AICKELIN, UWE",
  "content_length": 12568,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:30"
}