{
  "name": "Jamie A. Ward",
  "homepage": "https://www.gold.ac.uk/computing/people/ward-jamie",
  "status": "success",
  "content": "Professor Jamie A Ward | Goldsmiths, University of London Main menu Staff & students In this section Staff details Position Head of School, Computing Department Computing Email j.ward (@gold.ac.uk) Links Websitejamieward.net Google scholar LinkedInlinkedin.com/in/jamieward Wearable Computing and Social Neuroscience Jamie's research lies at the intersection of wearable computing, theatre, and psychology, where he uses body-worn sensors to study human behaviour across a diverse range of social situations. Since 2024 he is a Prof. in Computing. He obtained his PhD from the Swiss Federal Institute of Technology (ETH), Zürich, Switzerland in 2006, and a joint degree in Computer Science and Electrical Engineering from the University of Edinburgh in 2000. Prior to joining Goldsmiths, Jamie was a post-doctoral researcher at University College London’s Institute of Cognitive Neuroscience (ICN), and at Lancaster University, where he was a Marie Curie Fellow. He is a visiting researcher at UCL ICN; from 2019-2023 he was a visiting professor at Keio University, Japan; and from 2016-2019 a visiting researcher at the German Centre for AI (DFKI). Between academic positions Jamie worked variously as a technology consultant, an analogue circuit designer, and as an actor in television, film, and theatre. Academic qualifications Dr. Sci (ETH), Activity Monitoring, Institute for Electronics, Swiss Federal Institute of Technology (ETH), Zürich 2006 Beng (hons), Joint Honours in Electronics and Electrical Engineering with Computer Science, University of Edinburgh 2000 National Cert. in Professional Acting, Drama Studio London 2011 Research interests I use my unique experience as both scientist and professional actor to explore new ways of measuring and trying to understand the mechanisms of social interaction. I bring together multi-person, multimodal wearable sensor technology with the concept of “theatre as a laboratory” to explore topics like liveness in performance and social behaviours in autism. Examples of this work include using wearables to study brain activity of actors (Hamilton 2018), using wearables to study audience synchrony in performance (Ward 2024, Sun 2023, Han 2022), using motion capture to study nonverbal communicative behaviour (Falk 2024, Hale 2020), and using wearables to uncover social interactions during theatre performances by autistic children (Ward 2018). I have taught and worked on a wide range of topics including ubiquitous computing, machine learning, signal processing, nonverbal interaction, eye-tracking, autism, acting, and in-the-wild research methods. I serve as associate editor on several journals, including ACM IMWUT, and was general chair of Augmented Humans 2023, program chair of ISWC 2019, and am a long-standing member on the steering committee for the International Symposium on Wearable Computers (ISWC). Publications and research outputs ArticleDelta-band audience brain synchrony tracks engagement with live and recorded dance Rai, Laura A. ; Lee, Haeeun ; Becke, Emma; Trenado, Carlos; Abad-Hernando, Sonia ; Sperling, Matthias; Vidaurre, Diego; Wald-Fuhrmann, Melanie; Richardson, Daniel C.; Ward, Jamie A ORCID logo ; and +1 more...Orgs, Guido . 2025. Delta-band audience brain synchrony tracks engagement with live and recorded dance. iScience, 28(7), 112922. ISSN 2589-0042 The Wand Chooses the IMU - Open Source Hardware for Synchronising Wearables using Magnetometers Han, Yuxuan; Gilbert, Thomas J; Tan, Xiangyi; and Ward, Jamie A ORCID logo . 2024. The Wand Chooses the IMU - Open Source Hardware for Synchronising Wearables using Magnetometers. ACM International Joint Conference on Pervasive and Ubiquitous Computing, pp. 939-943. Squeeze and Slide: Real-time continuous self-reports with physiological arousal to evaluate emotional engagement in short films of contemporary dance Stamm, Julie C ; Richardson, Daniel C.; and Ward, Jamie A ORCID logo . 2024. Squeeze and Slide: Real-time continuous self-reports with physiological arousal to evaluate emotional engagement in short films of contemporary dance. CHI EA '24: Extended Abstracts of the 2024 CHI Conference on Human Factors in Computing Systems, 301. Show more information A Magnetometer-based Method for In-situ Syncing of Wearable Inertial Measurement Units Gilbert, Thomas Jamin; Lin, Zexiao; Day, Sally; Hamilton, Antonia F de C; and Ward, Jamie A ORCID logo . 2024. A Magnetometer-based Method for In-situ Syncing of Wearable Inertial Measurement Units. Frontiers in Computer Science, 6, 1385392. ISSN 2624-9898 Head Nodding and Hand Coordination Across Dyads in Different Conversational Contexts Falk, Patrick; Cañigueral, Roser; Ward, Jamie A ORCID logo ; and Hamilton, Antonia F de C. 2023. Head Nodding and Hand Coordination Across Dyads in Different Conversational Contexts. Journal of Nonverbal Behaviour, ISSN 0191-5886 Using Wearable Sensors to Measure Interpersonal Synchrony in Actors and Audience Members During a Live Theatre Performance Sun, Yanke; Greaves, Dwaynica A ORCID logo ; Orgs, Guido ORCID logo ; de C. Hamilton, Antonia F; Day, Sally; and Ward, Jamie A ORCID logo . 2023. Using Wearable Sensors to Measure Interpersonal Synchrony in Actors and Audience Members During a Live Theatre Performance. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 7(1), 27. ISSN 2474-9567 Affective Umbrella – A Wearable System to Visualize Heart and Electrodermal Activity, towards Emotion Regulation through Somaesthetic Appreciation Chen, Kanyu; Han, Jiawen; Baldauf, Holger; Wang, Ziyue; Chen, Dunya; Kato, Akira; Ward, Jamie A ORCID logo ; and Kunze, Kai. 2023. Affective Umbrella – A Wearable System to Visualize Heart and Electrodermal Activity, towards Emotion Regulation through Somaesthetic Appreciation. Proceedings 4th Augmented Humans International Conference 2023, Glasgow, UK (AHs2023), pp. 231-242. Linking Audience Physiology to Choreography Han, Jiawen; Chernyshov, George; Sugawa, Moe; Zheng, Dingding; Hynds, Danny; Furukawa, Taichi; Padovani, Marcelo; Minamizawa, Kouta; Marky, Karola; Ward, Jamie A ORCID logo ; and +1 more...Kunze, Kai. 2023. Linking Audience Physiology to Choreography. ACM Transactions on Computer-Human Interaction, 30(1), 9. ISSN 1073-0516 A Simple Method for Synchronising Multiple IMUs Using the Magnetometer Gilbert, Thomas; Day, Sally; Hamilton, Antonia F De C; and Ward, Jamie A ORCID logo . 2022. A Simple Method for Synchronising Multiple IMUs Using the Magnetometer. Proceedings of the 2022 ACM International Symposium on Wearable Computers, pp. 100-102. Lessons on Collecting Data from Autistic Children Using Wrist-Worn Sensors Bell, Maria; Robinson, Elise; Day, Sally; Gilbert, Thomas Jamin; Hamilton, Antonia F De C; and Ward, Jamie A ORCID logo . 2022. Lessons on Collecting Data from Autistic Children Using Wrist-Worn Sensors. Proceedings of the 2022 ACM International Symposium on Wearable Computers, pp. 6-10. Seeing Our Blind Spots: Smart Glasses-Based Simulation to Increase Design Students’ Awareness of Visual Impairment Zhang, Qing; Barbareschi, Giulia; Huang, Yifei; Li, Juling; Pai, Yun Suen; Ward, Jamie A ORCID logo ; and Kunze, Kai. 2022. Seeing Our Blind Spots: Smart Glasses-Based Simulation to Increase Design Students’ Awareness of Visual Impairment. Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology, pp. 1-14. Frisson Waves: Exploring Automatic Detection, Triggering and Sharing of Aesthetic Chills in Music Performances He, Yan; Chernyshov, George; Han, Jiawen; Zheng, Dingding; Thomsen, Ragnar; Hynds, Danny; Liu, Muyu; Yang, Yuehui; Ju, Yulan; Pai, Yun Suen; +3 more...Minamizawa, Kouta; Kunze, Kai; and Ward, Jamie A ORCID logo . 2022. Frisson Waves: Exploring Automatic Detection, Triggering and Sharing of Aesthetic Chills in Music Performances. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 6(3), 118. ISSN 2474-9567 Nonverbal communication in virtual reality: Nodding as a social signal in virtual interactions Aburumman, Nadine; Gillies, Marco ; Ward, Jamie A. ORCID logo ; and Hamilton, Antonia F.de C.. 2022. Nonverbal communication in virtual reality: Nodding as a social signal in virtual interactions. International Journal of Human-Computer Studies, 164, 102819. ISSN 1071-5819 Comparing Sampling Strategies for Tackling Imbalanced Data in Human Activity Recognition Alharbi, Fayez ; Ouarbya, Lahcen ; and Ward, Jamie A ORCID logo . 2022. Comparing Sampling Strategies for Tackling Imbalanced Data in Human Activity Recognition. Sensors, 22(4), 1373. ISSN 1424-8220 Synchrony as a measure of conversation difficulty: Movement coherence increases with background noise level and complexity in dyads and triads Hadley, Lauren V; and Ward, Jamie A ORCID logo . 2021. Synchrony as a measure of conversation difficulty: Movement coherence increases with background noise level and complexity in dyads and triads. PLoS ONE, 16(10), e0258247. ISSN 1932-6203 Effects of Being Watched on Eye Gaze and Facial Displays of Typical and Autistic Individuals During Conversation Canigueral, Roser; Ward, Jamie A ORCID logo ; and Hamilton, Antonia F de C. 2021. Effects of Being Watched on Eye Gaze and Facial Displays of Typical and Autistic Individuals During Conversation. Autism, 25(1), pp. 210-226. ISSN 1362-3613 Are you on my wavelength? Interpersonal coordination in dyadic conversations Hale, Jo; Ward, Jamie A ORCID logo ; Buccheri, Francesco; Oliver, Dominic; and Hamilton, Antonia F. de C.. 2020. Are you on my wavelength? Interpersonal coordination in dyadic conversations. Journal of Nonverbal Behaviour, 44(1), pp. 63-83. ISSN 0191-5886 Making Sensors, Making Sense, Making Stimuli: The State of the Art in Wearables Research from ISWC 2019 Dunne, Lucy E; and Ward, Jamie A ORCID logo . 2020. Making Sensors, Making Sense, Making Stimuli: The State of the Art in Wearables Research from ISWC 2019. IEEE Pervasive Computing, 19(1), pp. 87-91. I",
  "content_length": 16303,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:30"
}