{
  "name": "Jamie Forth",
  "homepage": "https://www.gold.ac.uk/computing/people/forth-jamie",
  "status": "success",
  "content": "Dr Jamie Forth | Goldsmiths, University of London Main menu Staff & students In this section Staff details Position Lecturer Department Computing Email j.forth (@gold.ac.uk) Jamie is a musician, artist/coder, and interdisciplinary researcher interested in perception, culture and creativity Jamie is a musician, artist/coder and interdisciplinary scientific researcher. His artistic research engages with theory and practices of computational art, specialising in sound, data analysis and technological forms of social and political intervention. Jamie’s scientific research focuses on the development of computational methods for modelling processes associated with the perception, cognition and creation of music. He has undertaken post-doctoral work in the fields of computational creativity and artificial intelligence; statistical modelling of music and natural language; multi-agent systems; and knowledge representation and discovery within the Semantic Web. Academic qualifications PhD (Computer Science), Goldsmiths, University of London 2012 MA (Electroacoustic Composition), City University, London 2004 BMus Hons (Music), City University, London 2003 Teaching and supervision Jamie is programme convenor for BSc Creative Computing. BSc Creative Computing Publications and research outputs Book SectionAlgorithmic folding Forth, Jamie ORCID logo . 2025. Algorithmic folding. In: Susan Sentler and Glenna Batson, eds. Artmaking as Embodied Enquiry – Entering the Fold. Bristol: Intellect, pp. 221-242. ISBN 9781789389685 Computational Creativity and Live Algorithms Wiggins, Geraint A.; and Forth, Jamie . 2018. Computational Creativity and Live Algorithms. In: Alex McLean and Roger Dean, eds. The Oxford Handbook of Algorithmic Music. Oxford, UK: Oxford University Press. ISBN 9780190226992 IDyOT: A Computational Theory of Creativity as Everyday Reasoning from Learned Information Wiggins, Geraint A.; and Forth, Jamie . 2015. IDyOT: A Computational Theory of Creativity as Everyday Reasoning from Learned Information. In: Tarek R. Besold; Marco Schorlemmer and Alan Smaill, eds. Computational Creativity Research: Towards Creative Machines. 7 Paris: Atlantis Press, pp. 127-148. ISBN 9789462390843 Show more information An approach for identifying salient repetition in multidimensional representations of polyphonic music Forth, Jamie ; and Wiggins, Geraint A.. 2009. An approach for identifying salient repetition in multidimensional representations of polyphonic music. In: Joseph Chan; Jacqueline W. Daykin and M. Sohel Rahman, eds. London Algorithmics 2008: Theory and Practice. London: College Publications, pp. 44-58. ISBN 9781904987970 ArticleTowards a Deep Improviser: a prototype deep learning post-tonal free music generator Dean, Roger T.; and Forth, Jamie . 2020. Towards a Deep Improviser: a prototype deep learning post-tonal free music generator. Neural Computing and Applications, 32(4), pp. 969-979. ISSN 0941-0643 Conceptual Representations for Concept Creation Xiao, Ping; Toivonen, Hannu; Gross, Oskar; Cardoso, Amílcar; Correia, João; Machado, Penousal; Martins, Pedro; Goncalo Oliveira, Hugo; Sharma, Rahul; Pinto, Alexandre Miguel; +18 more...Díaz, Alberto; Francisco, Virginia; Gervás, Pablo; Hervás, Raquel; León, Carlos; Forth, Jamie ; Purver, Matthew; Wiggins, Geraint A.; Miljković, Dragana; Podpečan, Vid; Pollak, Senja; Kralj, Jan; Žnidaršič, Martin; Bohanec, Marko; Lavrač, Nada; Urbančič, Tanja; van der Velde, Frank; and Battersby, Stuart. 2019. Conceptual Representations for Concept Creation. ACM Computing Surveys, 52(1), ISSN 0360-0300 Linking neural and symbolic representation and processing of conceptual structures van der Velde, FrankORCID logo; Forth, Jamie ORCID logo ; Nazareth, Deniece S.; and Wiggins, Geraint A.ORCID logo. 2017. Linking neural and symbolic representation and processing of conceptual structures. Frontiers in Psychology, 8, 1297. ISSN 1664-1078 Show more information Evaluation of Musical Creativity and Musical Metacreation Systems Agres, Kathleen; Forth, Jamie ; and Wiggins, Geraint A.. 2016. Evaluation of Musical Creativity and Musical Metacreation Systems. Computers in Entertainment, 14(3), pp. 1-33. Entraining IDyOT : Timing in the Information Dynamics of Thinking Forth, Jamie ORCID logo ; Agres, KatORCID logo; Purver, MatthewORCID logo; and Wiggins, Geraint AORCID logo. 2016. Entraining IDyOT : Timing in the Information Dynamics of Thinking. Frontiers in Psychology, 7, 1575. ISSN 1664-1078 Academics' responses to encountered information: Context matters Pontis, Sheila; Kefalidou, GenovefaORCID logo; Blandford, AnnORCID logo; Forth, Jamie ORCID logo ; Makri, StephannORCID logo; Sharples, SarahORCID logo; Wiggins, GeraintORCID logo; and Woods, MelORCID logo. 2015. Academics' responses to encountered information: Context matters. Journal of the Association for Information Science and Technology, 67(8), pp. 1883-1903. ISSN 2330-1643 Transposition Ability in a Young Musician With Autism and Blindness: Testing Cognitive Models of Autism Boso, Marianna; Forth, Jamie ; Bordin, Annamaria; Faggioli, Raffaella; D'Angelo, Egidio; Politi, Pierluigi; Barale, Francesco; and Heaton, Pam F. . 2013. Transposition Ability in a Young Musician With Autism and Blindness: Testing Cognitive Models of Autism. Psychomusicology: Music, Mind, and Brain, 23(2), pp. 109-116. ISSN 0275-3987 Unifying Conceptual Spaces: Concept Formation in Musical Creative Systems Forth, Jamie ; Wiggins, Geraint A.; and McLean, Alex. 2010. Unifying Conceptual Spaces: Concept Formation in Musical Creative Systems. Minds and Machines, 20(4), pp. 503-532. ISSN 0924-6495 Conference or Workshop ItemConceptual spaces of metre and rhythm Forth, Jamie ; and Wiggins, Geraint A.. 2012. 'Conceptual spaces of metre and rhythm'. In: 12th International Conference on Music Perception and Cognition (ICMPC). Thessaloniki, Greece. Tools for Music Scholarship and their Interactions: A Case Study Lewis, David ; Woodley, Ron; Forth, Jamie ; Rhodes, Christophe ; and Wiggins, Geraint . 2011. 'Tools for Music Scholarship and their Interactions: A Case Study'. In: Supporting Digital Humanities. Copenhagen, Denmark. Musical creativity on the conceptual level Forth, Jamie ; McLean, Alex; and Wiggins, Geraint A.. 2008. 'Musical creativity on the conceptual level'. In: Proceedings of the 5th International Joint Workshop on Computational Creativity. Madrid, Spain. Performancescreensaver (dance with live coding) Harrington, J Neve; and Forth, Jamie . 2017. screensaver (dance with live coding). In: \"Movement Computing Conference (MOCO), London, June 2017\", Goldsmiths, University of London, United Kingdom. ReportOn Movement, Rhythm and Data Forth, Jamie ORCID logo ; Sentler, Susan; and Chua, Christina J.. 2021. On Movement, Rhythm and Data. Documentation. so-far.online, Singapore. ThesisCognitively-motivated geometric methods of pattern discovery and models of similarity in music Forth, Jamie . 2012. Cognitively-motivated geometric methods of pattern discovery and models of similarity in music. Doctoral thesis, Goldsmiths, University of London",
  "content_length": 7109,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:30"
}