{
  "name": "Jan-Joachim Rückmann",
  "homepage": "https://www.uib.no/en/persons/Jan-Joachim.R%C3%BCckmann",
  "status": "success",
  "content": "Jan-Joachim Rückmann | UiB Skip to main content Edit Jan-Joachim Rückmann Position Professor Affiliation Department of Informatics E-mail jan-joachim.ruckmann@uib.no Phone number +47 55584507 Visitor address HIB - Thormøhlens gate 555006 Bergen Postal address P.O. Box 7803 NO-5020 Bergen Norway Jan-Joachim Rückmann Position Professor Affiliation Department of Informatics Research Non-linear programming: theory, methods and applicationsMathematical financeParametric non-linear optimization(Generalized) semi-infinite programming, data envelopment analysis, robust optimizationApplications of topology and differential geometry to non-linear programming Publications See a complete overview of publications in Cristin. 1. Günzel, H., D. Hernandez  Escobar, J.-J. Rückmann: MPCC: Strong stability of weakly nondegenerate S-stationary points. Optimization 73 (2024) 10, 3121-3145. 2. Dür, M., J.-J. Rückmann, O. Stein, R. Werner: (guest editors): Preface. Parametric Optimization and Related Topics XII. Optimization 73 (2024) 10 (special issue), 3015-3017. 3. Günzel, H., D. Hernandez Escobar, J.-J. Rückmann: Strongly stable stationary points for a class of generalized equations. SIAM J. Optimization 33 (2023) 2, 950-977. 4. Flåm, S. D., J.-J. Rückmann: The Lagrangian, constraint qualifications and economics. Mathematical Methods of Operations Research 96 (2022) 2, 215-232.5. Bouza Allende, G., D.Hernandez  Escobar, J.-J. Rückmann: Some properties of K-convex mappings in variable ordering settings. Optimization 71 (2022) 14, 4125-4146.6. Hernandez Escobar, D., J.-J. Rückmann: Strongly stable C-stationary points for mathematical problems with complementarity constraints. Mathematical Programming 189 (2021) 1-2, 339-377.7. Günzel, H., D. Hernandez  Escobar, J.-J. Rückmann: MPCC: strong stability of M-stationary points. Set-Valued and Variational Analysis 29 (2021) 3, 645-659. 8. Kujawska, H., M. Slavkovik, J.-J. Rückmann: Predicting the winners of Borda, Kemeny and Dodgson elections with supervised machine learning. In: N. Bassiliades et al. (editors), Multi-Agent Systems and Agreement Technologies, Springer, Berlin, New York, 2020, 440-458.9. Hernandez  Escobar, D., J.-J. Rückmann: MPCC: Strongly stable C-stationary points when the number of active constraints is n+1. Optimization 69 (2020) 5, 1039-1067.10. Cervinka, M., J.-J. Rückmann, O. Stein (guest-editors): Preface. Parametric Optimization and Related Topics XI. Optimization 68 (2019) 2-3 (special issue), 429-431.11. Jargalsaikhan, B., J.-J. Rückmann: A note on strict complementarity for the doubly nonnegative cone. Optimization 68 (2019) 2-3, 457-464.12. Both, A.-L., H. Hisken, J.-J. Rückmann, T. Steihaug: Surrogate-based model parameter optimisation based on gas explosion experimental data. Engineering Optimization 51 (2019) 2, 301-316.13. Hernandez Escobar, D., J.-J. Rückmann: MPCC: On necessary conditions for the strong stability of C-stationary points. Optimization 68 (2019) 2-3, 593-613.14. Bouza Allende, G., D. Hernandez Escobar, J.-J. Rückmann: Generation of K-convex test problems in variable ordering settings. Investigacion Operacional 39 (2018) 3, 463-479.15. Guerra Vazquez, F., L. A. Hernandez-Rebollar, J.-J. Rückmann: On vector generalized semi-infinite programming. Investigacion Operacional 39 (2018) 3, 341-35216. Bouza Allende, G., J.-J. Rückmann, C. Tammer (guest-editors): Variational Analysis - Homage to the 70th Birthday of Boris Mordukhovich. Investigacion Operacional 39 (2018) 3 (special issue).17. Guerra Vazquez, F., J.-J. Rückmann: On duality in multiobjective semi-infinite optimization. Optimization 66 (2017) 8, 1237-1249.18. Braatz, A.-L., H. Hisken, J.-J. Rückmann: Surrogate-based optimization of model parameters for the improved modelling of industrial-scale gas explosions. In: J. Herskovits (editor), Proceedings of the 5th International Conference on Engineering Optimization, e-papers (ISBN 978-85-7650-548-8), Rio de Janeiro, Brazil, 2017, 389-398.19. Rückmann, J.-J.: A tutorial note on a convexification procedure in non-convex semi-infinite programming optimization. Investigacion Operacional 38 (2017) 4, 309-319.20. Martinez Legaz, J. E., E. Ocana Anaya, J.-J. Rückmann (guest-editors): ISORA 2015. Optimization 66 (2017) 8 (special issue).21. Canovas, M. J., J. Parra, J.-J. Rückmann, F. J. Toledo: Point-based neighborhoods for sharp calmness constants in linear programming. Set-Valued and Variational Analysis 25 (2017) 4, 757-772.22. Helmers, J., J.-J. Rückmann, R. Werner: Tight semi-model-free bounds on (bilateral) CVA. In: K. Glau et al. (editors), Innovations in Derivatives Markets, Springer, Berlin, New York, 2016, 83-101.23. Rückmann, J.-J.: A tutorial note on multiobjective semi-infinite programming. Investigacion Operacional 37 (2016) 3, 216-225.24. Guerra Vazquez, F., J.-J. Rückmann: Multiobjective semi-infinite optimization: convexification and properly efficient points. In: G. O. Tost et al. (editors), Analysis, Modelling, Optimization, and Numerical Techniques, Springer, Berlin, New York, 2015, 327-347.25. Dorsch, D., H. Th. Jongen, J.-J. Rückmann, V. Shikhman: On the local representation of piecewise smooth equations as a Lipschitz manifold. J. Math. Anal.Appl. 411 (2014), 916-930.26. Guerra Vazquez, F., J.-J. Rückmann: On proper efficiency in multiobjective semi-infinite optimization. In: H. Xu et al. (editors), Optimization and Control Techniques and Applications, Springer, Berlin, New York, 2014, 115-135.27. Guerra Vazquez, F., J.-J. Rückmann: A note on logarithmic smoothing in semi-infinite optimization under reduction approach. Croatian OR Review 4 (2013), 19-30.28. Erb, S., M. Gerdts, S. Kemble, J.-J. Rückmann, M. Schlüter: MIDACO on MINLP Space Applications. Advances in Space Research 51 (2013) 7, 1116-1131.29. Rückmann, J.-J., O. Stein (guest-editors): Parametric Optimization and Related Topics. Mathematical Programming 136 (2012) 1 (special issue).30. Gerdts, M., J.-J. Rückmann, M. Schlüter: A numerical study of MIDACO on 100 MINLP benchmarks. Optimization 61 (2012) 7, 873-900.31. Rückmann, J.-J., O. Stein (guest-editors): Parametric Optimization and Related Topics X. Optimization 61 (2012) 6 (special issue).32. Guerra Vazquez, F., J.-J. Rückmann, R. Werner: On saddle points in nonconvex semi-infinite programming. J. Global Optimization 54 (2012) 3, 433-447.33. Dorsch, D., F. Guerra Vazquez, H. Günzel, H. Th. Jongen, J.-J. Rückmann: SIP: critical value functions have finite modulus of non-convexity. Mathematical Programming 136 (2012) 1, 133-154.34. Dorsch, D., F. Guerra Vazquez, H. Günzel, J.-J. Rückmann: Semi-infinite programming: strong stability implies EMFCQ. J. Convex Analysis 19 (2012) 4, 999-1008.35. Guerra Vazquez, F., J.-J. Rückmann: Semi-infinite programming. In: J. Cochran et al. (editors), Encyclopedia of Operations Research and Management Science, Wiley, Hoboken, 2011, 4770-4479.36. Ortega, G., S. Erb, J.-J. Rückmann et al.: STA, The Space Trajectory Analysis Project. European Space Agency (ESA), Proceedings of the 4th International Conference on Astrodynamics Tools and Techniques, Madrid, Spain, 2010 (8 pages).37. Jongen, H. Th., J.-J. Rückmann: On interior logarithmic smoothing and strongly stable stationary points. SIAM J. Optimization 20 (2010) 5, 2137-2156.38. Kropat, E., J.-J. Rückmann, G.-W. Weber: Regression analysis for clusters in gene-environment networks based on ellipsoidal calculus and optimization. Dynamics of Continuous, Discrete and Impulsive Systems 17 (2010) 5, 639-657.39. Schlüter, M., J.-J. Rückmann, M. Gerdts: Non-linear mixed-integer-based optimization technique for space applications. Poster exhibition at ESTEC, European Space Agency (ESA) Partnering Day, 2010, Nordwijk, The Netherlands.40. Rückmann, J.-J., M. Sanchez Meraz, C. Sosa Paz: Joint routing, link scheduling and power control for wireless multi-hop networks for CDMA/TDMA systems. Cientifica 14 (2010) 4, 165-17241. Jongen, H. Th., J.-J. Rückmann, V. Shikhman: MPCC: critical point theory. SIAM J. Optimization 20 (2009) 1, 473-484.42. Jongen, H. Th., J.-J. Rückmann, V. Shikhman: On stability of the feasible set of a mathematical problem with complementarity problems. SIAM J. Optimization 20 (2009) 3, 1171-1184.43. Rückmann, J.-J., A. Shapiro: Augmented Lagrangians in semi-infinite programming. Mathematical Programming 116 (2009) 1-2, 499-512.44. Allende, S., M. A. Osorio, R. Rios, J.-J. Rückmann (guest-editors): Annals Oper. Res. 157 (2008) 1-2 (special issue on the XII Latin-Iberoamerican Congress of Operations Research and Systems CLAIO).45. Günzel, H., H. Th. Jongen, J.-J. Rückmann: On stable feasible sets in generalized semi-infinite programming. SIAM J. Optimization 19 (2008) 2, 644-654.46. F. Guerra Vazquez, J.-J. Rückmann, O. Stein, G. Still: Generalized semi-infinite programming: a tutorial. J. Comp. Appl. Mathematics 217 (2008), 394-419.47. Guddat, J., F. Guerra Vazquez, D. Nowack, J.-J. Rückmann: Pathfollowing methods for nonlinear multiobjective optimization problems. J. Management Sc. Eng. Man. 2 (2007) 3, 163-177.48. Guddat, J., F. Guerra Vazquez, D. Nowack, J.-J. Rückmann: On the calculation of a feasible point of a nonconvex set: pathfollowing with jumps. Optimization 56 (2007) 1-2, 73-103.49. Guddat, J., F. Guerra Vazquez, D. Nowack, J.-J. Rückmann: A modified standard embedding with jumps in nonlinear optimization. European J. Oper. Research 169 (2006) 3, 1185-1206.50. Gomez, J. A., J.-J. Rückmann: On generalized semi-infinite programming. TOP 14 (2006) 1, 1-59.51. Guerra Vazquez, F., J.-J. Rückmann: Extensions of the Kuhn-Tucker constraint qualification to generalized semi-infnite programming. SIAM J. Optimization 15 (2005) 3, 926-937.52. Guerra Vazquez, F., J.-J. Rückmann: Semi-infinite programming: properties and applications to economics. In: J. Leskow et al. (editors), New Tools of Economic Dynamics, Springer, Berlin, New York, 2005, 373-393.53. Guddat, J., H. Th. Jongen, J.-J. Rückmann, M. Todorov (editors)",
  "content_length": 16791,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:56"
}