{
  "name": "Jan Mendling",
  "homepage": "https://www.informatik.hu-berlin.de/de/forschung/gebiete/promis/team/mendling",
  "status": "success",
  "content": "Jan Mendling — Prozessmanagement und InformationssystemeMehr KontrastWeniger Kontrast Direkt zum InhaltDirekt zur SucheDirekt zur Navigation Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Prozessmanagement und Informationssysteme Mathematisch-Naturwissenschaftliche Fakultät Institut für Informatik Prozessmanagement und Informationssysteme Navigation « Dezember 2025 » month-12 Mo Di Mi Do Fr Sa So 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 1 2 3 4 Termine Promotionsvortrag: Niklas Giesa 01.12.2025 Disputation: Frau Parmida Geranmayeh, M.Sc. 10.12.2025 Disputation: Herr Pascal Sebastian Kunz, M.Sc. 12.12.2025 Promotionsvortrag Fabian Lehmann 18.12.2025 Termine - More… Impressum Für Studieninteressierte Für Studierende Für Promovierende Frauenförderung Für Beschäftigte Mitarbeiter:innen Frauenförderung Berufliche Weiterbildung FAQs E-Mails HUMBOLDT INTERN Humboldt-Universität zu Berlin - Mathematisch-Naturwissenschaftliche Fakultät - Prozessmanagement und Informationssysteme Jan Mendling ist Einstein-Professor für Process Science am Institut für Informatik der Humboldt-Universität zu Berlin. Zudem ist er Adjunct-Professor an der Wirtschaftsuniversität Wien, Principal Investigator am Weizenbaum-Institut und einer der Gründer von Noreja Intelligence GmbH. Seine Forschungsinteressen umfassen verschiedene Themen in den Bereichen Geschäftsprozessmanagement und Informationssysteme. Er hat mehr als 500 Forschungsarbeiten und Artikel veröffentlicht, unter anderem in Management Information Systems Quarterly, ACM Transactions on Software Engineering and Methodology, IEEE Transactions on Software Engineering, Journal of the Association of Information Systems, European Journal of Information Systems, Information Systems und Decision Support Systems. Er ist Mitherausgeber der Zeitschrift Process Science, Koautor der Lehrbücher Fundamentals of Business Process Management und Wirtschaftsinformatik. Forschungsinteressen Business Process Modeling Business Process Management Process Mining Information Systems Enterprise Architecture weitere Informationen zu Kontakt, Publikationen, Lehre und Auszeichnungen finden sie [hier] DE EN Mehr KontrastMehr Kontrast Weniger KontrastWeniger Kontrast Humboldt-Universität zu Berlin Institut für Informatik Rudower Chaussee 25 12489 Berlin-Adlershof Kontakt Leiter Prof. Dr. Jan MendlingHaus IV, 2. Etage, R. 203 jan.mendling@hu-berlin.de Sekretariat Nina JacquemardHaus 4, R. 202Tel.: +49 30 2093 41270 promis-office@hu-berlin.de Postanschrift Humboldt-Universität zu BerlinInstitut für InformatikUnter den Linden 610099 Berlin Hausanschrift Rudower Chaussee 25Humboldt-Universität zu BerlinInstitut für Informatik12489 Berlin Anfahrtsbeschreibung Die Humboldt-Universität bei Facebook Die Humboldt-Universität bei BlueSky Die Humboldt-Universität bei Instagram Die Humboldt-Universität bei YouTube Die Humboldt-Universität bei LinkedIn Die RSS-Feeds der Humboldt-Universität Seite bearbeiten Barrierefreiheit Datenschutz Impressum",
  "content_length": 3049,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:42"
}