{
  "name": "Jan Bender",
  "homepage": "https://www.animation.rwth-aachen.de",
  "status": "success",
  "content": "Computer Animation Home Contact Staff Research Publications Software Teaching Theses Jobs Impressum Welcome fluid dynamicsposition based dynamicsfracture simulation Welcome to the Computer Animation Group at RWTH Aachen University! The research of the Computer Animation Group focuses on physically-based simulation of rigid body systems, deformable solids, and fluids, collision handling, cutting, fracturing, and real-time simulation methods. The main application areas include virtual prototyping, simulation in engineering, medical simulation, computer games and special effects in movies. News • Best Paper AwardOur paper \"Consistent SPH Rigid-Fluid Coupling\" got the best paper award at the Eurographics Vision, Modeling, and Visualization 2023. Sept. 29, 2023 • Implicit Density Projection now available on GitHub!The code for our paper \"Implicit Density Projection for Volume Conserving Liquids\" has been implemented in the open source project Mantaflow and is now available on GitHub. Check here for the most recent version. July 27, 2022 • Best Paper AwardOur paper \"Fast Corotated Elastic SPH Solids with Implicit Zero-Energy Mode Control\" got the best paper award at the ACM SIGGRAPH / EUROGRAPHICS Symposium on Computer Animation 2021. Sept. 10, 2021 • Best Paper AwardOur paper \"Volume Maps: An Implicit Boundary Representation for SPH\" got the best paper award at the ACM SIGGRAPH Motion, Interaction and Games. Nov. 15, 2019 • Best Paper AwardOur paper \"A Micropolar Material Model for Turbulent SPH Fluids\" got the best paper award at the ACM SIGGRAPH / EUROGRAPHICS Symposium on Computer Animation. Aug. 15, 2017 • SPlisHSPlasH now available on Github!SPlisHSPlasH is an open-source library for the physically-based simulation of fluids. The simulation in this library is based on the Smoothed Particle Hydrodynamics (SPH) method which is a popular meshless Lagrangian approach to simulate complex fluid effects. Check it out here! Nov. 17, 2016 Recent Publications Adaptive Phase-Field-FLIP for Very Large Scale Two-Phase Fluid Simulation ACM Transactions on Graphics (SIGGRAPH) Capturing the visually compelling features of large-scale water phenomena,such as the spray clouds of crashing waves, stormy seas, or waterfalls, involves simulating not only the water but also the motion of the air interacting with it. However, current solutions in the visual effects industry still largely rely on single-phase solvers and non-physical “white-water” heuristics. To address these limitations, we present Phase-Field-FLIP (PF-FLIP), a hybrid Eulerian/Lagrangian method for the fully physics-based simulation of very large-scale, highly turbulent multiphase flows at high Reynolds numbers and high fluid density contrasts. PF-FLIP transports mass and momentum in a consistent, non-dissipative manner and, unlike most existing multiphase approaches, does not require a surface reconstruction step. Furthermore, we employ spatial adaptivity across all critical components of the simulation algorithm, including the pressure Poisson solver. We augment PF-FLIP with a dual multiresolution scheme that couples an efficient treeless adaptive grid with adaptive particles, along with a fast adaptive Poisson solver tailored for high-density-contrast multiphase flows. Our method enables the simulation of two-phase flow scenarios with a level of physical realism and detail previously unattainable in graphics, supporting billions of particles and adaptive 3D resolutions with thousands of grid cells per dimension on a single workstation. SymX: Energy-based Simulation from Symbolic Expressions ACM Transactions on Graphics Optimization time integrators are effective at solving complex multi-physics problems including deformable solids with non-linear material models, contact with friction, strain limiting, etc. For challenging problems, Newton-type optimizers are often used, which necessitates first- and second-order derivatives of the global non-linear objective function. Manually differentiating, implementing, testing, optimizing, and maintaining the resulting code is extremely time-consuming, error-prone, and precludes quick changes to the model, even when using tools that assist with parts of such pipeline. We present SymX, an open source framework that computes the required derivatives of the different energy contributions by symbolic differentiation, generates optimized code, compiles it on-the-fly, and performs the global assembly. The user only has to provide the symbolic expression of each energy for a single representative element in its corresponding discretization and our system will determine the assembled derivatives for the whole simulation. We demonstrate the versatility of SymX in complex simulations featuring different non-linear materials, high-order finite elements, rigid body systems, adaptive discretizations, frictional contact, and coupling of multiple interacting physical systems. SymX’s derivatives offer performance on par with SymPy, an established off-the-shelf symbolic engine, and produces simulations at least one order of magnitude faster than TinyAD, an alternative state-of-the-art integral solution. Interactive Facial Animation: Enhancing Facial Rigs With Real-Time Shell And Contact Simulation Proceedings of the ACM on Computer Graphics and Interactive Techniques (SCA) Demand for high-quality virtual 3D characters continues to grow in both entertainment and communication, and with it, the desire for interactive avatars. This presents unique challenges for high-fidelity interactive solutions that must be quick to set up, efficient to run in real-time on consumer hardware, and work well, not only on human characters, but also on fantastical and heavily stylized ones. We present Interactive Facial Animation (IFA), a novel approach to augment facial animation rigs with shell simulation and contact without requiring anatomical priors or artist intervention. Our method uses an efficient shell model that tracks the output of a face rig in real-time and incorporates realistic contact. By designing our shell model to be differentiable, we can use inverse simulation to reconstruct realistic non-uniform stiffness that captures both stiff (ears, nose) and soft (cheeks, lips) areas, based on the rig’s deformation space. The reconstruction process imposes hard limits on acceptable errors, which ensures that IFA preserves the resolution and expressiveness of the source material, a common shortcoming in many face simulation pipelines. With performance in mind, we demonstrate IFA using a variant of the Fast Mass-Springs method. However, the presented concept can be realized with any differentiable physics solver that provides reliable convergence. We showcase our method in four different character rigs, achieving simulation update runtimes between 0.39 and 1.27 milliseconds (787-2564 FPS) on a single CPU thread. Unlike existing methods that require lengthy preparation times, our pipeline can be ready to use within minutes, also on the CPU.",
  "content_length": 7028,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:41"
}