{
  "name": "Jan N. van Rijn",
  "homepage": "https://www.universiteitleiden.nl/en/staffmembers/jan-van-rijn#tab-2",
  "status": "success",
  "content": "Jan van Rijn - Leiden University Skip to main content Jan van Rijn Assistant professor algorithms artificial intelligence data science informatics machine learning metalearning open science community leiden trustworthy ai Name Dr. J.N. van Rijn Telephone +31 71 527 2727 E-mail j.n.van.rijn@liacs.leidenuniv.nl ORCID iD 0000-0003-2898-2168 Jan N. van Rijn holds a tenured position as assistant professor at Leiden University, where he works in the computer science department (LIACS) and Automated Design of Algorithms cluster (ADA). His research interests include trustworthy artificial intelligence, automated machine learning (AutoML) and metalearning. More information about Jan van Rijn PhD candidates Annelot Bosman PhD candidate Inês Isabel Correia Gomes PhD candidate / guest Nansheline Daal PhD candidate / self funded Matthias König PhD candidate Andreas Paraskeva PhD candidate Sietse Schröder PhD candidate / self funded Sandra Strakova Guest News 13 June 2024 Unique exhibition translates science into music, images and dance 15 February 2024 Not only full professors: the entire examining committee can now wear academic dress 27 June 2023 Conference on opportunities and dangers of AI: ‘Europe needs a daring vision’ 28 September 2022 By educating and doing research together, you can discover things that really matter. 22 March 2022 How to make AI systems learn better 29 January 2021 Twitter use helps predict flooding 23 November 2020 BNAIC/Benelearn conference big success 10 December 2019 Leiden University as source of inspiration for new Master's programme in Artificial Intelligence and Data Science Book: Metalearning See also Young Academy Leiden OpenML Former PhD's Matthias König Mike Huisman Open Science Community Leiden Jan N. van Rijn holds a tenured position as assistant professor at Leiden University, where he works in the computer science department (LIACS) and Automated Design of Algorithms cluster (ADA). His research interests include trustworthy artificial intelligence, automated machine learning (AutoML) and metalearning. He obtained his PhD in Computer Science in 2016 at Leiden Institute of Advanced Computer Science (LIACS), Leiden University (the Netherlands). During his PhD, he developed OpenML.org, an open science platform for machine learning, enabling sharing of machine learning results. He made several funded research visits to the University of Waikato (New Zealand) and the University of Porto (Portugal). After obtaining his PhD, he worked as a postdoctoral researcher in the Machine Learning lab at the University of Freiburg (Germany), headed by Prof. Dr. Frank Hutter, after which he moved to work as a postdoctoral researcher at Columbia University in the City of New York (USA). His research aim is to democratize access to machine learning and artificial intelligence across societal institutions, by developing knowledge and tools that support domain experts. He is one of the authors of the book ‘Metalearning: Applications to Automated Machine Learning and Data Mining’ (published by Springer). Assistant professor Faculty of Science Leiden Inst of Advanced Computer Science Work address Gorlaeus Building Einsteinweg 55 2333 CC Leiden Contact +31 71 527 2727 j.n.van.rijn@liacs.leidenuniv.nl Publications No relevant ancillary activities Share on Facebook Share by Bluesky Share on LinkedIn Share by WhatsApp Share by Mastodon Research Low-Resource Chat-based Conversational Intelligence (LESSEN) TAILOR - Trustworthy AI through the integration of learning HealthBox Organisation Science Leiden Institute of Advanced Computer Science (LIACS) Machine Learning Podcast: Computers Don't Byte Assistant Professor Jan van Rijn talks about his research into the trustworthiness of AI systems. His work focuses on the field of machine learning, with a particular emphasis on exploring and enhancing the robustness of AI systems. This website uses cookies. More information. Accept cookies Reject cookies",
  "content_length": 3967,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:43"
}