{
  "name": "Jan Gugenheimer",
  "homepage": "https://www.gugenheimer.com",
  "status": "success",
  "content": "Jan Gugenheimer Research jan Gugenheimer Since June 2022 I am an Assistant Professor (W2 TT) for Computer Science at TU Darmstadt. I will be heading the group of Human-Computer Interaction focusing on several topics around Mixed Reality (Augmented Reality and Virtual Reality). I left my position at Institute Polytechnique de Paris (Télécom Paris) inside the DIVA group As a PhD student at Ulm University I was working in the field of Human-Computer Interaction, focusing on the field of Mobile/Nomadic Virtual Reality (scholar | dblp). During my studies I had the opportunity to visit and work within a variety of exciting research labs at universities (ETH Zurich, MIT Media Lab) and research institutions (Daimler AG, IBM, Mercedes Benz Research and Development North America, Microsoft Research). For more details please have a look at my CV. In my research, I explored the interaction scenario that I named  nomadic VR. Nomadic VR, is a novel interaction scenario in which a user is immersed in a virtual environment using a mobile VR HMD inside an unknown context (e.g., watching a 360-degree video while commuting by public transport). In my thesis, I defined this novel interaction scenario as nomadic VR and systematically explored its upcoming challenges and opportunities. For this, the interaction scenario was embedded into a larger vision of ubiquitous mixed reality, using models and approaches from the field of context-aware computing which already explain a similar transformation and paradigm shift from stationary PCs to mobile computing (smartphones): The form factor changed dramatically, cursor-based input was replaced with multi-touch, sound and visual feedback was extended with vibration and the constant changing environment enabled a variety of location-based features and services. In my dissertation, I argue that a similar transformation will happen from stationary VR HMDs to mobile VR HMDs: the input will be adapted, novel output modalities will be added and the context of use will be incorporated into the virtual environment. Contact My field of interest is at the intersection of Human-Computer Interaction and Mixed Reality (Virtual and Augmented Reality).  Feel free to reach out to me if you want to talk research or just drop me a line if you are curious about some of my projects (firstname.lastname@telecom-paris.fr). You can also find me on most of the known platforms Short Bio Current Position: Assistant Professor (W2 TT) at TU-Darmstadt heading the Human-Computer Interaction group Former Position: Assistant Professor (Maître de conférences) at Télécom Paris/Institut Polytechnique de Paris Education: PhD Computer Science (Human-Computer Interaction) at Ulm University (2019) MSc Computer Science (Human-Computer Interaction) from Ulm University (2013) Semester Abroad (Information Systems) Hawaii Pacific University (2012) BSc Computer Science (Human-Computer Interaction) from Ulm University (2011) Research Experience: Research Intern at Microsoft Research Redmond working with Eyal Ofek and Hrvoje Benko (2017) Visiting Researcher at MIT Media Lab Fluid Interfaces Group lead by Pattie Maes (2015) Visiting Researcher at ETH Zurich AutoID Labs lead by Elgar Fleisch (2013) Master Thesis at Mercedes Benz Research and Development North America (2013) Working Experience: Research Assistant at Daimler AG (2010 -2013) Intern at IBM Germany (2009) Tutor for Software Development (2009) Scientific Activities Organizer: Program Chair: PerDis 2020 Web Chair: UIST 2018 Local Chair: ISCT 2015 Workshops: Ethical HMDs at CHI 2020 Social HMDs at CHI 2019 PC Committee: CHI 2020 ISS 2019 CHI LBW 2017, 2018, 2019 MUM 2017, 2018 PerDis 2018 MuC 2019, 2020 VARECo 2019, 2020 Reviewer: CHI 2015, 2016, 2017, 2018, 2019 UIST 2017, 2018, 2019 IMWUT 2020 ToCHI 2018 SIGGRAPH 2017, 2020 IEEE VR 2017, 2018 DIS 2017 CHI Play 2016, 2019 TEI 2016, 2017 Augmented Human 2015, 2016 ITS (now ISS) 2014, 2015 Automotive UI 2014, 2015 NordiCHI 2018 MobileHCI 2015 Invited Talks SIGCHI Paris 2020CHI 2017UIST 2016UIST 2016CHI 2016 Selected Projects FaceDisplay: Towards Asymmetric Multi-User Interaction for Nomadic Virtual RealityShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD UsersGyroVR: Simulating Inertia in Virtual Reality using Head Worn FlywheelsFaceTouch: Enabling Touch Interaction in Display Fixed UIs for Mobile Virtual RealityCarVR: Enabling In-Car Virtual Reality EntertainmentSwiVRChair: A Motorized Swivel Chair to Nudge Users‘ Orientation for 360 Degree Storytelling in Virtual RealityBodySign: Evaluating the Impact of Assistive Technology on Communication Quality Between Deaf and Hearing IndividualsGlass Unlock: Enhancing Security of Smartphone Unlocking through Leveraging a Private Near-eye DisplayP.I.A.N.O.: Faster Piano Learning with Interactive ProjectionUbiBeam: An Interactive Projector-Camera System for Domestic Deployment Selected Publications (Full Papers) Mark Colley, Marcel Walch, Gugenheimer, Jan, Ali Askari, and Enrico Rukzio 2020. Towardsinclusive external communication of autonomous vehicles for pedestrians with vision impairments.. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20 Best Paper Honorable Mention). Evgeny Stemasov, Tobias Wagner, Gugenheimer, Jan, and Enrico Rukzio. 2020. Mixmatch: Towards omitting modelling through in-situ alteration and remixing of model repository artifacts in mixed reality.. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). Dennis Wolf, Gugenheimer, Jan, Marco Combosch, and Enrico Rukzio. 2020. Understanding the Heisenberg effect of spatial interaction: A selection induced error for spatially tracked input devices.. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). Tobias Drey, Gugenheimer, Jan, Julian Karlbauer, Maximilian Milo, and Enrico Rukzio. 2020. Vrsketchin: Exploring the design space of pen and tablet interaction for 3d sketching in virtual reality.. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). Teresa Hirzle, Jan Gugenheimer, Florian Geiselhart, Andreas Bulling, and Enrico Rukzio. 2019. A Design Space for Gaze Interaction on Head-mounted Displays.. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). Association for Computing Machinery, New York, NY, USA, Paper 625, 1–12. DOI:https://doi.org/10.1145/3290605.3300855 M. Rietzler, J. Gugenheimer, T. Hirzle, M. Deubzer, E. Langbehn and E. Rukzio. 2018. Rethinking Redirected Walking: On the Use of Curvature Gains Beyond Perceptual Limitations and Revisiting Bending Gains. In Proceedings of the 2018 IEEE International Symposium on Mixed and Augmented Reality (ISMAR ’18). DOI:10.1109/ISMAR.2018.00041 Michael Rietzler, Teresa Hirzle, Jan Gugenheimer, Julian Frommel, Thomas Dreja, and Enrico Rukzio. 2018. VRSpinning: Exploring the Design Space of a 1D Rotation Platform to Increase the Perception of Self-Motion in VR.. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS ’18). Association for Computing Machinery, New York, NY, USA, 99–108. DOI:https://doi.org/10.1145/3196709.3196755 Michael Rietzler, Florian Geiselhart, Jan Gugenheimer, and Enrico Rukzio. 2018. Breaking the Tracking: Enabling Weight Perception using Perceivable Tracking Offsets.. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). Association for Computing Machinery, New York, NY, USA, Paper 128, 1–12. DOI:https://doi.org/10.1145/3173574.3173702 Jan Gugenheimer, Evgeny Stemasov, Harpreet Sareen, and Enrico Rukzio. 2018. FaceDisplay: Towards Asymmetric Multi-User Interaction for Nomadic Virtual Reality.. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). Association for Computing Machinery, New York, NY, USA, Paper 54, 1–13. DOI:https://doi.org/10.1145/3173574.3173628 Philipp Hock, Sebastian Benedikter, Jan Gugenheimer, and Enrico Rukzio. 2017. CarVR: Enabling In-Car Virtual Reality Entertainment.. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4034–4044. DOI:https://doi.org/10.1145/3025453.3025665 Jan Gugenheimer, Evgeny Stemasov, Julian Frommel, and Enrico Rukzio. 2017. ShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD Users.. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17 Best Paper Award). Association for Computing Machinery, New York, NY, USA, 4021–4033. DOI:https://doi.org/10.1145/3025453.3025683 Jan Gugenheimer, Katrin Plaumann, Florian Schaub, Patrizia Di Campli San Vito, Saskia Duck, Melanie Rabus, and Enrico Rukzio. 2017. The Impact of Assistive Technology on Communication Quality Between Deaf and Hearing Individuals.. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 669–682. DOI:https://doi.org/10.1145/2998181.2998203 Jan Gugenheimer, Dennis Wolf, Eythor R. Eiriksson, Pattie Maes, and Enrico Rukzio. 2016. GyroVR: Simulating Inertia in Virtual Reality using Head Worn Flywheels.. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST ’16). Association for Computing Machinery, New York, NY, USA, 227–232. DOI:https://doi.org/10.1145/2984511.2984535 Jan Gugenheimer, David Dobbelstein, Christian Winkler, Gabriel Haas, and Enrico Rukzio. 2016. FaceTouch: Enabling Touch Interaction in Display Fixed UIs for Mobile Virtual Reality.. Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST ’16). Association for Computing Machinery, New York, NY, USA, 49–60. DOI:https://doi.org/10.1145/2984511.2984576 Jan Gugenheimer, Dennis Wolf, Gabriel Haas, Sebastian Krebs, and Enrico Rukzio. 2016. ",
  "content_length": 12451,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:40"
}