{
  "name": "Jan Hajic",
  "homepage": "https://ufal.mff.cuni.cz/jan-hajic",
  "status": "success",
  "content": "Jan Hajič | ÚFAL Skip to main content Toggle navigation ÚFAL About Events Research Projects Grants Data Tools Lindat Publications Industry Cooperation People Teaching Jobs* Wiki Pakt ICCL Search form Search Toggle navigation Jan Hajič back to PEOPLE ↩ Jan Hajič office Room 420 office hours Monday 10:00-11:30 (unless traveling) email hajic@ufal.mff.cuni.cz phone +420 951 554 257 Curriculum Vitae My current CV in English (in \"Euro\" format) with a list of selected publications. Selected Bibliography Google Scholar ORCID: 0000-0002-3503-7730 Scopus ID: 6602292051 Researcher ID: D-3429-2017 (Major, Recent) News 2025/02/01 We are starting our new large EU project, OpenEuroLLM, to build new-generation, fully open LLM for all European Languages. Please see https://openeurollm.eu for more details. I am looking forward to coordinate this project, in which we have assembled world-class academic groups, companies and EuroHPC centers! 2024/09/10 Our project called \"Linguistics, artificial intelligence and language and speech technologies: from research to innovations\", in which we are teaming with the Speech'@'FIT group at Brno University of Technology and four Czech companies interested in our results for use in the commercial world (Phonexia, MamaAI, Phrase and Seznam.cz), has scored first in the Humanities and Social Sciences Area of the call, to be funded from the Structural Funds (\"OP JAK\"). We have been invited to formally enter project negotiations (which might still take some time given the unique combination of academia and industry participation). 2024/03/01 Three infrastructural projects have been awarded to broad consortia, in which also LINDAT/CLARIAH-CZ participates. While I am not involved personally in any of them, it is a big success of the Research Infrastructure to take part and to, in some cases, represent the CLARIN community: EVERSE for proper open source research software archiving, distribution and long-term preservation, ATRIUM for digitization and preservation of archaeologicical resources Europe-wide, and FIDELIS (as a sort of EUDAT continuation). 2024/01/01 Two new projects have started: the infrastructural EOSC CZ National Repository Platform project, to which we are contributing the LINDAT/CLARIAH-CZ updated repository platform, and an equipment upgrade project for LINDAT/CLARIAH-CZ itself, which will allow us to work with bigger data and improve our language tools and services. 2023/11/09 I have been invited to speak at and moderate the panel on Generative AI: opportunities, risks and challenges at the European Parliament's STOA committee. With other panelists from the EC, industry and Academia, we have agreed that continued funding is needed in the EU fror further research, most importantly, for basic research in language(s) and language technology, to fundamentally understand how language works, which would in turn help to use the latest AI technology for both economic and societal benefits, not only in the EU. 2023/07/14 At the just-ended ACL 2023 in Toronto, Canada, our paper on \"superhuman\" performance (What’s the Meaning of Superhuman Performance in Today’s NLU?) has been awarded an \"Outstanding paper\" prize. 2023/06/01 The project European Language Equality II has ended. Using several contribution from external partners funded by the FSTP mechanism, we were able to put together enough material for a Springer-pubished book, update the language technology scores in the dashboards, and see new EU calls for projects in the Computational Linguistics and Language Technology area. 2023/03/10 My Adjunct Full Professor appointment at University of Colorado boulder (0%) has been renewed until end of August, 2025. Budget allowing, I will continue to visit UCB for consultations on the LUSyD and UMR projects, as well as on lexical semantic and valency issues in general. If another opportunity arises, I will teach in the Summer semester the successful 2019 UCB Master's course on Multilingual NLP, which I have developed there. 2023/03/01 The Uniform Meaning Representation project for Czech (UMR) has started today. Funded by the Ministry of Education, Youth and Sports under the INTER-EXCELLENCE programme, it aims as fostering long-term cooperation between my team working on semantic annotation and the U.S.-based UMR project consortium, led by Brandeis University. Research Interests, Grants My research interest evolved from morphology and tagging of inflective languages (lexicons, analysis and generation tools - now reimplemented by Milan Straka as MorphoDiTa) to machine translation (French-English while at IBM and Czech-English; also, Czech-Russian and other closely related languages). I am also interested in parsing (see e.g. the CLSP Workshop on parsing Czech) and generation. However, in the past 10 years, I devoted most of my research time to creating linguistic resources, such as the Prague Dependency Treebank family of projects (Czech, English, Arabic) and managing new research projects, mainly funded by the EU (see below for a complete list). I am also involved in the Universal Dependencies project, led by Joakim Nivre of Uppsala University and hosted by LINDAT/CLARIAH-CZ as the official UD repository. My management responsibilities include the LINDAT/CLARIAH-CZ Research Infrastructure and also being the Deputy Chair of the Institute. I am also interested in spoken language understanding. I participated in the now finishing project Malach, both on the language modeling part (for ASR), on thesaurus translation and on the IR Czech test collection. I closely work not only with my students, but also with other Czech and foreign teams, such as the University or West Bohemia in the Czech Republic, Center for Speech and Language Processing at the JHU, the CLEAR lab at CU Boulder, Linguistic Data Consortium, the European Language Resources Association (ELRA/ELDA), and several European Universities on EU projects (see below). I am or have been the PI, or the national PI of several major Czech, EU and NSF (US) research projects. The list of current projects (or of those finished within the last 10 years) is below. Projects (as a PI or Co-PI only) 2023-2027 Uniform Meaning Rerpesentation (UMR) project, funded by MEYS CR. The projects supports close cooperation with our U.S.-based partners (Brandeis University, University of Colorado Boulder, New Mexico State University) on the development of UMR, including annotation of large dataset using UMR as well as the SynSemClass ontology as the result of the LUSyD project (see below). 2022-2025 High Performance Language Technology (HPLT) project, funded by Horizon Europe. The goal is to prepare textual data in many (80+) languages to train Large Language Models. The project is coordinated by us at UFAL MFF UK. 2021-2022 European Language Equality project, by EP/EC, PPP Action. Preparation of Language-centric AI Strategic Research Agenda for Digital Language Equality by 2030. 2020-2023 Humane-AI-Net / AI Centre of Excellence, Call 48 H2020 project (Co-PI for Chalres University) 2019-2022 LINDAT/CLARIAH-CZ, Large infrastructural grant for digital humanities, language resources, data access and distribution and related reseearch, project LM2018101 of the Ministry of Education of the Czech Republic (continuation and extension to digital hummanities of LM2010013 and LM2015071); complemented by the Structural Funds project \"OP VVV VI 2 LINDAT/CLARIAH-CZ\" for equipment and computing facilities extensions and renewal (PI) 2020-2024 Language Understanding: from Syntax to Discourse (LUSyD). Grant Agency of the Czech Republic, large grant from the EXPRO programme (PI). 2019-2022 European Lannguage Grid (ELG), EC Call 27 project for building a Language Technology platform with a host of resources and LT services for both commercial and reserach use. I am the Co-PI and lead of the Charles University team provding 600+ services and all resource metadata to the ELG. I also supervise the effort to fund ELG Pilot Projects which are selected in Open Calls throughout Europe, distributing almost EUR 2M through the FSTP financial mechanism. 2010-2015, extended to 2019 LINDAT/CLARIN, Large infrastructural grant for language resources, data access and distribution and related reseearch, project LM2010013 and since 2016 as LM2015071 of the Ministry of Education of the Czech Republic; now complemented by the Structural Funds project \"OP VVV LINDAT/CLARIN\" for equipment and computing facilities extensions and renewal (PI) 2017-2018 \"Document Access\" (sub)project for Prague's Mayor's Office (PI) 2016-2020 Mellon Foundation grant, with Brandeis Univ. (coordinator), Vassar Univ., Univ. of Tübingen - harmonization of access to language resources and tools between LAPPS Grid and Clarin 2016-2019 VIADAT, Virtual Assistent for Access to Oral History Archives, with the Institute of Contemporary Hisotory of the Academy of Sciences of the Czech Republic and the National Film Archive of the Czech Republic (PI) 2015-2017 CRACKER, Cracking the Language Barrier: Coordination, Evaluation and Resources for European MT Research. H2020 CSA, PI of the Czech partner, Charles University in Prague. Under negotiation. Coordinated by Hans Uszkoreit, DFKI Berlin, Germany. 2015-2018 HimL, Health in my Language. H2020 Innovation Action. PI of the Czech partner, Charles University in Prague. Under negotiation. Coordinated by Barry Haddow, University of Edinburgh, Scotland. 2015-2018 QT21, Quality Translation 21. H2020 Research and Innovatio Action. PI of the Czech partner, Charles University in Prague. Under negotiation. Coordinated by Barry Haddow, University of Edinburgh, Scotland. 2013-2016 QTLeap, Quality Translation by Deep Language Engineering Approaches. FP7 STREP project. PI of the Czech partner, Charles University in Prague. Coordinated by Antonio Branco, FCUL, Lisabon, Portugal. 2011-2015 AMALACH, Access to multilingual archives, with ZCU in Pilsen and USC, Los Angeles, USA, a Czech Ministry of Culture appl",
  "content_length": 20800,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:35"
}