{
  "name": "Jan Peleska 0001",
  "homepage": "http://www.informatik.uni-bremen.de/agbs/jp",
  "status": "success",
  "content": "Jan Peleska Universität Bremen FB3 TZI BISS AG BS > Deutsch English Jan Peleska Research Interests My current research work focuses on the development of dependable systems, with emphasis on distributed systems and reactive real-time systems. In particular, I investigate formal methods and dependability aspects: safety, reliability, availability and security formal methods for the development of fault-tolerant systems test automation for reactive real-time systems tools development for the application of formal methods CASE methods, formal methods and software development standards I am most interested in the combination and application of existing methods and corresponding tools to \"real-world\" problems; the development of new methods plays a less important role. Most results of the research activities are motivated by and applied to industrial projects in the field of safety-critical embedded systems and distributed systems, as, for example, avionic systems and railway control systems. A rather complete overview about current research activities and related industrial projects is given in my Habilitation Thesis Formal Methods and the Development of Dependable Systems. ORCID https://orcid.org/0000-0003-3667-9775 Publications Publications Projects Research Projects and Industrial Projects Publications Publications CV Curriculum Vitae Model-Based Testing of Embedded Systems Visit the Embedded Systems Testing Benchmark Site Lectures (in German) Lectures Post Graduate Programme Embedded Systems GESy Post Graduate Programme Embedded Systems GESy Programme description Other responsibilities Together with my colleague Rolf Drechsler, I am managing the Post Graduate Programme Embedded Systems GESy. I am co-editor of the BISS Monographs - Monographs of the Bremen Institute of Safe Systems, a series of publications related to safety-critical systems, Formal Methods and their applications. I am shareholder of Verified Systems International GmbH . Address: Prof. Dr. Jan Peleska FB 3 -- Informatik Universität Bremen Postfach 330 440 D-28334 Bremen Germany Room: MZH 5490 Phone: +49 421 218-63961 E-mail: peleska@uni-bremen.de Author: jp AG BS Last updated: November 2, 2022",
  "content_length": 2197,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:46"
}