{
  "name": "Jan Oliver Borchers",
  "homepage": "https://hci.rwth-aachen.de/borchers",
  "status": "success",
  "content": "Jan Borchers - Media Computing Group - RWTH Aachen University Prof. Dr. Jan BorchersHead Room 2.41 This email address is being protected from spambots. You need JavaScript enabled to view it. +49 241 80-21050 To set up a meeting, please see my basic schedule, then contact my administrator, Clarissa de Gavarelli. Jan Borchers is a full professor of computer science and head of the Media Computing Group, an endowed Chair in the Computer Science Department at RWTH Aachen University. With his research group, he explores the field of Human–Computer Interaction (HCI), with a particular interest in new user interfaces for soft robotics, textile user interfaces, 3D printing and personal fabrication, augmented reality, wearable and tangible computing, interfaces for software development, deceptive patterns, and interactive guides and exhibits. In 2009, he opened Germany's first Fab Lab. Jan established his group in 2003 and pioneered conducting modern HCI academic research and teaching in Germany [1]. It soon became a leading German lab in terms of archival publications at CHI, the top international conference in HCI. Before joining RWTH, he held faculty positions at Stanford University and ETH Zurich, after receiving his PhD 'summa cum laude' in computer science from Darmstadt University of Technology in 2000. His PhD thesis, A Pattern Approach to Interaction Design, became the first book to bring the concept of design patterns to HCI. He is a member of ACM, SIGCHI, SIGCHI Germany, and GI, and introduced the Interactivity format to the CHI conference in 2005. He has also provided usability talks, training, and consulting, as well as user interface design, prototyping, and evaluation, to clients such as AirBus, Apple, ARD, Bayer, Children's Museum Boston, Daimler, Handelsblatt, OTIS, Scout24, TEDx, and Deutsche Telekom. You can find him on BlueSky @janborchers, on Mastodon @janborchers, and on X/Twitter @borchers. For urgent matters, please contact his assistant, Clarissa de Gavarelli. Publications Jan has published around 300 research papers, including (as of 2025) 45 archival papers at ACM CHI and ACM UIST, the top international technical conferences in Human-Computer Interaction. Books: A Pattern Approach to Interaction Design • Arduino In A Nutshell • Lernkarten 3D-Druck • Handbuch Fab Labs Complete list of publications Selected Awards 'If They Have No Choice, They'll Accept!': How Children and Adolescents Assess Deceptive DesignsIDC 2025 Best Work in Progress The Deceptive Dungeon: Bringing Deceptive Patterns to the Physical WorldCHI'25 Student Games Competition Winner Usability: 4 Prinzipien guter User InterfacesRWTH-Wissenschaftsnacht 2024 Best Science Slam Attentive Notifications: Minimizing Distractions of Mobile Notifications Through Gaze TrackingMobileHCI 2023 Best Late-Breaking Work The Aachen Lab Demo: From Fundamental Perception to Design ToolsInteractivity at CHI 2023 Runner-Up From Detectables to Inspectables: Understanding Qualitative Analysis of Audiovisual DataPaper at CHI 2021 Honorable Mention Springlets: Expressive, Flexible and Silent On-Skin Tactile InterfacesPaper at CHI 2019 Honorable Mention Use the Force Picker, Luke: Space-Efficient Value Input on Force-Sensitive Mobile TouchscreensPaper at CHI 2018 Honorable Mention Combining Direct and Indirect Touch Input for Interactive Desktop Workspaces using Gaze InputPaper at SUI 2015 Honorable Mention How Tools in IDEs Shape Developers' Navigation BehaviorPaper at CHI 2013 Honorable Mention Dynamic Portals: A Lightweight Metaphor for Fast Object Transfer on Interactive SurfacesNote at ITS 2011 Best Note FingerFlux: Near-surface Haptic Feedback on TabletopsPaper & Demo at UIST 2011 Best Demos MudPad: A Multitouch Screen That Is Enhanced with Localized Active Haptic FeedbackNote & Demo at ITS 2010 Best Note & Best Demo DRAGON: A Direct Manipulation Interface for Frame-Accurate In-Scene Video NavigationNote at CHI 2008 Best Note Selected Talks Usability: 4 Prinzipien guter User Interfaces. Winner of the 1st RWTH Faculty Science Slam \"Clash of the Titans\", Aachen, Nov 8, 2024. Die Goldenen Regeln benutzbarer Technik. Invited talk, Aachen Chamber of Commerce, Aug 10, 2023. Die Renaissance der Hände: Intelligente Textilien und Möbel im Haus der Zukunft. Invited Talk, \"Technik im Alltag 2030\" Speaker Series, RWTH extern, Aachen, Jan 17, 2023. Usability kompakt. Invited Talk, Chambers of Commerce NRW & Bavaria Meeting, Aachen, Sep 28, 2021. (PDF) How To Make (Almost) Anything Usable. Recitation on usability for makers in the Fab Academy 2021 curriculum organized by MIT professor Neil Gershenfeld, May 3, 2021. fightcorona.ac: The Aachen Initiative fighting COVID-19. Invited talk, Connective Cities Virtual Event, Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ), Oct 14, 2020.(PDF) Usability. Impulse Talk for SAP Development Team at RWTH Aachen University, Aachen, Sep 23, 2020 (Part 1). Human–AI Interaction. Keynote, Inauguration Ceremony for Prof. Kay Schroeder, Zuyd Hogeschool, Heerlen, Feb 14, 2020. Digitale Fabrikation: Rapid UX Prototyping im Fab Lab. Invited speaker, 20 Jahre Gründerregion, aula carolina, Aachen, Sep 24, 2019. Best of CHI '19 for Makers. Aachen Maker Meetup, RWTH Aachen University, Aachen, Aug 21, 2019. Communicating with Artificial Intelligence. Keynote, IEEE ProComm 2019, Aachen, Jul 25, 2019. Greatest Hits & Misses: 10 Years of Aachen Maker Meetup. Keynote, Aachen Maker Meetup, Jul 17, 2019. (Video) Personal Photonics: Neue Benutzerschnittstellen für Open Innovation mit Photonik-Werkzeugen. Invited BMBF Research Project Overview, Laser World of Photonics Congress, Munich, Jun 24, 2019. Democratizing Hardware UX Prototyping. Invited Talk, Aachen Usability Meetup, Jun 18, 2019. Previous talks... Selected Professional Activities ACM CHI 2026 Reviewer; no Associate Chair due to research sabbatical ACM UIST 2025 Program Committee Member ACM CHI 2025 Associate Chair, Developing Novel Devices ACM CHI 2024 Interactivity Jury ACM CHI 2024 Associate Chair, Developing Novel Devices ACM CHI 2023 Extra Subcommittee Chair and Associate Chair, Building Devices ACM CHI 2023 Student Research Competition Jury ACM CHI 2023 Interactivity Jury ACM UIST 2022 Reviewer (UIST 2021, CHI 2022: not volunteered due to research sabbatical) ACM CHI 2021 Associate Chair, Interaction Techniques, Devices and Modalities ACM UIST 2020 Reviewer ACM CHI 2020 Associate Chair, Interaction Techniques, Devices and Modalities ACM UIST 2019 Reviewer ACM CHI 2019 Associate Chair, Interaction Techniques, Devices and Modalities ACM UIST 2018 Program Committee Member ACM CHI 2018 Associate Chair, Engineering Interactive Systems and Technologies Previous activities... For Students Tips for taking oral exams (Schwerpunktkolloquien) at our group How to write your Bachelor/Master thesis with us A must-read when you join our group as Bachelor/Master thesis student or HiWi. Career advice for HCI students in industry & academia What makes a good doctoral (PhD) student? Older materials for students... For Industry Jan frequently works for clients in industry and government as usability consultant, speaker, and trainer. Some Research Pointers Jan's Top Ten list of books on Human-Computer Interaction Free booklet: Arduino in a Nutshell dementiatools.org: A non-profit collection of technical support tools for people with dementia (also in German under demenztools.de.) LumiNet: An organic illumination network Hardware prototyping toolkits for HCI: An overview (2012) The Sweet Spot and Baroque Phase of Interactive Technology Lifecycles: A manifesto for simple technology, and a rant against feature-bloat. Published in the March/April 2008 issue of interactions. Useful Hacks Easier German umlauts on a US keyboard for macOS Toggle iCloud Private Relay: A useful macro to turn Apple's Private Relay on and off for multi-page website interactions that require to see your IP address (2024). Exporting Nixplay photo captions (2025) CHI Pages Template: An Apple Pages document template for archival Papers and Notes for the ACM CHI Conference Proceedings TimeStamper: A quick hack to capture time stamps into a text file while doing other tasks on macOS (useful for marking important moments while recording a screencast, for example). Function Keys: UI scripts to toggle between hardware and software function key mappings on macOS More on our group's software page Administrative Since March 2025, he has been the faculty patreon for TechLabs Aachen, a student initiative providing practical training opportunities in digital skills to students and the general population. From Oct 2024 until Sep 2026, Jan is deputy member (\"stellvertretender Fachgruppensprecher\") of the School's faculty council (\"Fakultätsrat der Fakultät für Mathematik, Informatik und Naturwissenschaften\") at RWTH From 2015 until February 2025, he headed the Computer Science Department's Examination Board (\"Prüfungsausschuss\"). Please use that website for all applications, appeals, and questions. Since 2010, he has coordinated the Computer Science Department's public relations and web presence. Since 2003, he has been the initiator and organizer of the Computer Science Department's weekly Faculty Lunch. From 2004 to 2010, he was the Computer Science Department's building coordinator (\"Baubeauftragter\"). That information is kept online for archival purposes. Personal Portrait pictures for press use (borchers_7154.jpg, borchers_5126.jpg) I think eBikes are the best invention since sliced bread; here's more about them I currently play piano in a jazz quartet, after previously playing in the jazz sextet riffbereit SPIEL 2018 report Some Travel Disaster Stories Frontotemporal Dementia, notes about a rare illness that my former partner suffered from. Older information on Jan's Stanford homepage, from his time at Stanford University (2001–2003). Attachments: File Description File size Downloads Last modified Toolkits.pdf Presentation at UC",
  "content_length": 10839,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:44"
}