{
  "name": "Jan Vitek",
  "homepage": "https://www.khoury.northeastern.edu/people/jan-vitek",
  "status": "success",
  "content": "Jan Vitek - Khoury College of Computer Sciences All People Jan Vitek Professor Research interests Research interests Programming languages Compilers Program analysis Memory management Virtual machine Type systems Education Education PhD in information systems, University of Geneva — Switzerland MS in computer science, University of Victoria — Canada Biography Biography Jan Vitek is a professor in the Khoury College of Computer Sciences at Northeastern University, based in Boston. Vitek's research has led to advances in the theory and practice of modern programming systems — from Objective-C and JavaScript to languages for data analytics like R — with applications in information security, memory management, and real-time safety critical systems. Vitek led the team that developed the first real-time Java virtual machine to be deployed on a drone designed by Boeing. Prior to joining Northeastern University, Vitek was a professor and faculty scholar at Purdue University, as well as a co-founder of Fiji Systems and 0xdata. He holds a leadership role in the programming language community as the former chair of the ACM Special Interest Group on Programming Languages, and served as vice-president of AITO and of the IFIP WG 2.4 on Software Technology. Vitek chairs the steering committee of the PLDI conference and has been on the steering committees of POPL, ICFP, SPLASH, and ECOOP. Labs and groups Labs and groups Programming Research Laboratory Projects Projects Published: December 23, 2015 Language and Runtime Support for Large-Scale Data Analytics Lead PI: Jan Vitek Published: February 19, 2016 Gradual Typing Across the Spectrum Lead PI: Matthias Felleisen Co PI: Jan Vitek Published: July 23, 2018 ROCKET: Scalable and Agile Analysis of Mass Spectrometry Experiments Lead PI: Olga Vitek Co PIs: Jan Vitek, Kylie Ariel Bemis Recent publications Recent publications Published: June 20, 2024 Decidable Subtyping of Existential Types for Julia Citation: Julia Belyakova, Benjamin Chung, Ross Tate, Jan Vitek. (2024). Decidable Subtyping of Existential Types for Julia Proc. ACM Program. Lang., 8, 1091-1114. https://doi.org/10.1145/3656421 Published: October 16, 2023 Reusing Just-in-Time Compiled Code Citation: Meetesh Kalpesh Mehta, Sebastián Krynski, Hugo Musso Gualandi, Manas Thakur, Jan Vitek. (2023). Reusing Just-in-Time Compiled Code Proc. ACM Program. Lang., 7, 1176-1197. https://doi.org/10.1145/3622839 Published: December 1, 2022 signatr: A Data-Driven Fuzzing Tool for R Citation: Alexi Turcotte, Pierre Donat-Bouillud, Filip Krikava, Jan Vitek. (2022). signatr: A Data-Driven Fuzzing Tool for R SLE, 216-221. https://doi.org/10.1145/3567512.3567530 Published: June 9, 2022 Deoptless: Speculation with Dispatched On-Stack Replacement and Specialized Continuations Citation: Olivier Flückiger, Jan Jecmen, Sebastián Krynski, Jan Vitek. (2022). Deoptless: Speculation with Dispatched On-Stack Replacement and Specialized Continuations CoRR, abs/2203.02340. https://doi.org/10.48550/arXiv.2203.02340 Published: October 15, 2021 Promises are made to be broken: migrating R to strict semantics Citation: Aviral Goel, Jan Jecmen, Sebastián Krynski, Olivier Flückiger, Jan Vitek. (2021). Promises are made to be broken: migrating R to strict semantics Proc. ACM Program. Lang., 5, 1-20. https://doi.org/10.1145/3485478 Published: July 12, 2018 Tests from traces: automated unit test extraction for R Citation: Filip Krikava, Jan Vitek. (2018). Tests from traces: automated unit test extraction for R ISSTA, 232-241. https://doi.org/10.1145/3213846.3213863 Published: November 15, 2017 Correctness of Speculative Optimizations with Dynamic Deoptimization Citation: Olivier Fluckiger, Gabriel Scherer, Ming-Ho Yee, Aviral Goel, Amal Ahmed and Jan Vitek Published: October 1, 2017 Orca: GC and Type System Co-Design for Actor Languages Citation: Sylvain Clebsch, Juliana Franco, Sophia Drossopoulou, Albert Mingkun Yang, Tobias Wrigstad, Jan Vitek Published: October 1, 2017 Dej́à Vu: A Map of Code Duplicates on GitHub Citation: Crista Lopes, Petr Maj, Pedro Martins, Di Yang, Jakub Zitny, Hitesh Sajnani, Jan Vitek Published: December 23, 2015 Is Sound Gradual Typing Dead? Citation: Asumu Takikawa, Daniel Feltey, Ben Greenman, Max S. New, Jan Vitek, Matthias Felleisen. \"Is Sound Gradual Typing Dead?\". POPL ‘16 Principles of Programming Languages (POPL). 456-468, 2016. DOI: 10.1145/2837614.2837630 Individual Details Tenured/Tenure-Track Faculty Campus Boston Website http://janvitek.org Google Scholar See Citations Area of Interest Software Engineering Contact j.vitek@northeastern.edu Related news The Register Boffins debunk study claiming certain languages (cough, C, PHP, JS…) lead to more buggy code than others January 31, 2019 Explore all news Previous PhD students Julia Belyakova PhD Student Locations Close this dialog window Boston Benjamin Chung PhD Student Locations Close this dialog window Boston Olivier Flückiger PhD Student Locations Close this dialog window Boston Aviral Goel PhD Student Locations Close this dialog window Boston Artem Pelenitsyn PhD Student Locations Close this dialog window Boston Alexi Turcotte PhD Student Locations Close this dialog window Boston Ming-Ho Yee PhD Student Locations Close this dialog window Boston",
  "content_length": 5286,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:54"
}