{
  "name": "Jan Maas",
  "homepage": "https://ist.ac.at/research/research-groups/maas-group",
  "status": "success",
  "content": "ISTA | Maas Group HomeResearchMaas Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Maas Group Stochastic Analysis Airplane turbulence, stock rate fluctuations, and epidemic spreading are examples of highly irregular real-world phenomena subject to randomness, noise, or uncertainty. Mathematician Jan Maas develops new methods for the study of such random processes in science and engineering.Random processes are often so irregular that existing mathematical methods are insufficient to describe them accurately. The Maas group combines ideas from probability theory, mathematical analysis, and geometry to gain new insights into the complex behavior of these processes. Their recent work has been inspired by ideas from optimal transport, a subject originating in economics and engineering that deals with the optimal allocation of resources. The Maas group applies these techniques to diverse problems involving complex networks, chemical reaction systems, and quantum mechanics. Another research focus is stochastic partial differential equations. These equations are commonly used to model high-dimensional random systems in science and engineering, ranging from bacteria colony growth to weather forecasting. The Maas group develops robust mathematical methods to study these equations, which is expected to lead to new insights into the underlying models. Group Leader Jan Maas Professor +43 2243 9000 6101 Jan.Maas@ist.ac.at Administrative Support Birgit Oosthuizen-Noczil Assistant to Professors +43 2243 9000 2150 Birgit.Oosthuizen-Noczil@ist.ac.at Team Giovanni Brigati Postdoc Giovanni.Brigati@ist.ac.at Ksenia Khudiakova PhD Student kseniia.khudiakova@ist.ac.at Hila Lifchitz PhD Student Hila.Lifchitz@ist.ac.at Assylbek Olzhabayev PhD Student Assylbek.Olzhabayev@ist.ac.at Lauro Silini Postdoc Lauro.Silini@ist.ac.at Current Projects Optimal transport on random networks | Rates of convergence for evolutionary dynamics | Entropy inequalities and dissipative quantum systems Publications Brigati G, Pedrotti F. 2025. Heat flow, log-concavity, and Lipschitz transport maps. Electronic Communications in Probability. 30, 71. View Brigati G, Stoltz G. 2025. How to construct explicit decay rates for kinetic Fokker–Planck equations? SIAM Journal on Mathematical Analysis. 57(4), 3587–3622. View Khudiakova K, Maas J, Pedrotti F. 2025. L∞-optimal transport of anisotropic log-concave measures and exponential convergence in Fisher’s infinitesimal model. The Annals of Applied Probability. 35(3), 1913–1940. View Auricchio G, Brigati G, Giudici P, Toscani G. 2025. Multivariate Gini-type discrepancies. Mathematical Models and Methods in Applied Sciences. 35(5), 1267–1296. View Kumar RR, Wirth M. 2025. Operator-valued twisted Araki–Woods algebras. Communications in Mathematical Physics. 406(5), 110. View View All Publications ReX-Link: Jan Maas Career Since 2020 Professor, Institute of Science and Technology Austria (ISTA)2014 – 2020 Assistant Professor, Institute of Science and Technology Austria (ISTA)2009 – 2014 Postdoc, University of Bonn, Germany2009 Postdoc, University of Warwick, UK2009 PhD, Delft University of Technology, The Netherlands Selected Distinctions 2016 ERC Starting Grant2013 – 2014 Project Leader in Collaborative Research Centre “The mathematics of emergent effects”2009 – 2011 NWO Rubicon Fellowship Additional Information Jan Maas websiteMathphys Analysis Seminar websiteMathematics at ISTA Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 5875,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:43"
}