{
  "name": "Jan Faigl",
  "homepage": "http://robotics.fel.cvut.cz/faigl",
  "status": "success",
  "content": "Jan Faigl Jan Faigl [cv, publications] Artificial Intelligence Center Center for Robotics and Autonomous Systems Dept. of Computer Science and Engineering Faculty of Electrical Engineering Czech Technical University in Prague Office: KN:E-333a, Karlovo namesti 13, 121 35 Praha 2, Czech Republic Tel.: +420-2-2435 7400 E-mail: faiglj@fel.cvut.cz Research Awards Students Publications Research: mobile robotics, multi-goal planning, path and motion planning, computational geometry, optimal sampling design, multi-robot systems, autonomous field navigation; in general, topics related to a robotic system for autonomous long-term environment monitoring Current activities and projects: Situation Awareness Sharing in Human-Machine Interaction using Resilient Communication in Robotics Telemetry, Ministry of Education Youth and Sports (MEYS) project No. LUABA24064 (2024-2026) Robotics and advanced industrial production (OP JAK ROBOPROX), Ministry of Education Youth and Sports (MEYS) project No. CZ.02.01.01/00/22_008/0004590 (2023-2028) Center for advanced machines and manufacturing technology, National Centres of Competence (NCK CAMAT), Technology Agency of Czech Republic, TAČR, Project No. TN02000028 (2023-2028) Automated system for critical infrastructure protection using cyber-physical technologies, Ministry of the Interior of the Czech Republic, Project No. VK01030216 (2023-2025) Recent activities: Towards Optimal Solution of Robotic Routing Problems, Czech Science Foundation (GA ČR), Project No. 22-05762S. (2022-2024) Risk-Aware Trajectory Planning and Optical Image Recognition Assisted Landing System for FixedWing UAVs, Technology Agency of the Czech Republic (TA ČR), Project No. TM03000046. (2022-2024) Learning Complex Motion Planning Policies, Czech Science Foundation (GA ČR), Project No. 21- 33041J; a joint project with J. Baltes, National Taiwan Normal University, Taiwan. Towards Optimal Curvature-Constrained Tours in Robotic Applications, Ministry of Education Youth and Sports (MEYS) project No. LTAIZ19013; a joint project with Oren Salzman, Technion, Israel (2019-2022) Multi-Robot Persistent Monitoring of Dynamic Environments, Czech Science Foundation (GA ČR) project No. GA19-20238S (2019-2021) Hybrid navigation system for autonomous vehicles in environment with denied GNSS services, Technology Agency of the Czech Republic (TA ČR) project No. TH03010362 (2018-2020) Robotic Lifelong Learning of Multi-legged Robot Locomotion Control in Autonomous Data Collection Missions, Czech Science Foundation (GA ČR) project No. GA18-18858S (2018-2020) Past activities: Invited talk at the 2018 3rd International Conference on Automation, Control and Robotics Engineering (CACRE), July 19-22, 2018, Chengdu, China on the topic Recent Progress in Information Gathering and Surveillance Missions Planning with Unmanned Aerial Vehicles, slides Efficient Information Gathering with Dubins Vehicles in Persistent Monitoring and Surveillance Missions, Czech Science Foundation (GA ČR), project No. GA16-24206S (2016-2018) Adaptive Informative Path Planning in Autonomous Data Collection in Dynamic Unstructured Environments, Czech Science Foundation (GA ČR), project No. 15-09600Y (2015-2017) Visual Navigation for Hexapod Walking Robots in Autonomous Data Collection Tasks a joint project with the University of Buenos Aires Workshop on On-line Decision-Making in Multi-Robot Coordination within the RSS 2016 Self-Organizing Maps for Multi-Goal Path Planning Tasks, Czech Science Foundation (GA ČR), project No. 13-18316P (2013-2015) Multi-Agent Coordination in Robotic Exploration and Reconnaissance Missions -- a joint project with the CITY-Lab a laboratory associated to INSA Lyon and INRIA. Workshop on On-line Decision-Making in Multi-Robot Coordination within the IROS 2015 Workshop on Multi-Agent Coordination in Robotic Exploration within the 21st European Conference on Artificial Intelligence (ECAI'14') Fulbright Visiting Scholar at the University of Southern California (USC), Robotic Embedded System Laboratory working on the topic Planning in Spatio-Temporal Spaces (10/2013-04/2014) Awards: New! 2023 - The Unmanned Ground Systems Autonomy Trials (UGV-AT), Läsna, Estonia New! 2022 - V4 - Innovation Challenge Day 2022 “Military Autonomous Systems” 2021 - IT SPY – best master thesis in the field of informatics and information technology in Czechia and Slovakia for the supervised master student J. Deckerová 2021 - DARPA SubT Challenge Finals - 2nd place in virtual competition 2021 - Amazon Research Award for the project Communication maps building in subterranean environments 2020 - AI Awards 2019, Best project of the year 2019, Czechia 2020 - DARPA SubT Challenge - 3rd place in Urban Circuit, Elma, Washington, USA 2019 - DARPA SubT Challenge -- 3rd place in Tunnel Circuit (August, Pittsburgh, USA) memebers of the CTU-CRAS team 2019 - WSOM+ 2019 Best Student Paper, Barcelona, Spain for the paper Rudolf Szadkowski, Jan Drchal, and Jan Faigl: Autoencoders Covering Space as a Life-Long Classifier 2019 - IT SPY – best master thesis in the field of informatics and information technology in Czechia and Slovakia for the supervised master student J. Bayer 2018 - RSS 2018 Best Student Paper Finalist, Pittsburgh, Pennsylvania, USA for the paper Petr Váňa, Jan Faigl: Optimal Solution of the Generalized Dubins Interval Problem 2017 - IJCNN 2017 Best Poster Honorable Mention, Anchorage, Alaska, USA for the paper On Self-Organizing Maps for Orienteering Problems 2017 - Winner team of Challenge No. 3 in Mohamed Bin Zayed International Robotics Challenge (MBZIRC), Abu Dhabi, UAE 2016 - Best poster award for the 11th Workshop on Self-Organizing Maps 2016. 2016 - Finalist for the IROS 2016 RoboCup Best Paper Award, Deajeon, Korea 2015 - Best student paper award for Jakub Mrva, a phd student supervised by me, for paper Feature Extraction for Terrain Classification with Crawling Robots ITAT 2015 2014 - Best poster award for the 10th Workshop on Self-Organizing Maps 2014. 2013 - Dean award for an exceptional bachelor thesis of Diar Masri, a bachelor student supervised by me, on a topic Motion Model of Stair Climbing in Hexapod Walking Robot (info). 2013 - Dean award for an exceptional master thesis of Lenka Mudrová, a master student supervised by me, on a topic Entropy-Like Estimation Technique in Mobile Robot Localization (info). 2013 - Fulbright scholarship award for a visiting position at University of Southern California, Los Angeles in 2013/2014. 2011 - Antonin Svoboda prize for the best PhD dissertation in the Czech Republic - Czech Society for Cybernetics and Informatics. 2010 - Best Paper Award for the Symposium Theory and Applications of Artificial Intelligence (20th European Meetings on Cybernetics and Systems Research). 2009 - 1st place in RoboTour outdoor delivery challenge. 2009 - Dean award for an exceptional master thesis of Jan Mačák, a master student supervised by me, on a topic Multi-Robot Cooperative Inspection Task (info). 2008 - 1st place in RoboTour outdoor delivery challenge 2008 - Dean award for an exceptional master thesis of Vojtěch Vonásek, a master student supervised by me, on a topic Trajectory Generation for Cooperative Inspection Task. 2007 - 3rd place in RoboTour outdoor delivery challenge. 2006 - 3rd place in RoboTour outdoor delivery challenge. Students: If you are a prospective student interested in a topic presented at this page, I encourage you to contact me for a project or thesis topic. If a specific topic is not listed bellow, there are not a specific topic; however, we can discuss a particular topic of your interest regarding your background in robotics and related fields. The current general topics (for thesis including bachelor, master or doctoral) are as follows: Principles of self-organization in optimization tasks Computational intelligence in collective robotics Motion and task allocation planning in multi-robotic systems Environment modelling for planning in autonomous systems Long-term navigation in autonomous robotic systems Sensor fusion techniques in building spatial awareness Particular topics for semestral projects, bachelor or master theses: OpenCL in feature extraction from sensoric data Graph partitioning for speeding up graph search methods Web based repository management, backuping and maintenance (svn) Low-cost vision based relative localization systems Multi-agent global localization system using low-cost web cameras Pulications: Full publications list in pdf, DBLP, Google Scholar, Ph.D. thesis - Multi-Goal Path Planning for Cooperative Sensing 2016 Premysl Kafka, Jan Faigl, Petr Vana Random Inspection Tree Algorithm in Visual Inspection with a Realistic Sensing Model and Differential Constraint ICRA 2016, pp. 2782-2787. Martin Stejskal, Jakub Mrva, Jan Faigl Road Following with Blind Crawling Robot ICRA 2016, pp. 3612-3617. Petr Cizek, Jan Faigl Low-latency Image Processing for Vision-based Navigation Systems ICRA 2016, pp. 781-786. Jan Faigl On Self-Organizing Map and Rapidly-Exploring Random Graph in Multi-Goal Planning Advances in Self-Organizing Maps and Learning Vector Quantization, 2016, pp. 143-153. 2015 Alejandro Vázquez-Otero, Jan Faigl, Raquel Dormido, Natividad Duro Reaction Diffusion Voronoi Diagrams: From Sensors Data to Computing Sensors 15(6):12736-12765, 2015. Petr Vana, Jan Faigl On the Dubins Traveling Salesman Problem with Neighborhoods IROS 2015, pp. 4029-4034. Jan Faigl, Miroslav Kulich On benchmarking of frontier-based multi-robot exploration strategies ECMR 2015. Jakub Mrva, Jan Faigl Feature Extraction for Terrain Classification with Crawling Robots ITAT 2015, pp.179-185. Jakub Mrva, Jan Faigl Tactile sensing with servo drives feedback only for blind hexapod walking robot RoMoCo 2015, pp. 240-245. 2014 Jan Faigl, Geoffrey A. Hollinger Unifying multi-goal path planning for autonomous data collection. IROS 2014, pp. 2937-2942. Petr Vaněk, Jan Faigl, Diar Masr",
  "content_length": 13724,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:35"
}