{
  "name": "Jan Paul Siebert",
  "homepage": "http://www.dcs.gla.ac.uk/~psiebert",
  "status": "success",
  "content": "Dr Jan Paul SiebertBSc, PhD, MIET, CEng. , MIEEEI am a Reader in the School of Computing Science and leader of the Computer Vision & Autonomous Systems Group (formerly the Computer Vision & Graphics Group). Keywords: Computer vision; vision science; image processing; metric 3D imaging; anthropomorphic vision approaches and cognitive vision architectures; active vision & visuo-motor behaviours; space variant imaging (foveated vision); gaze control, visual attention & visual search; visual representations based on scale-space and feature extraction in 2D & 3D and appearance-based imaging. Robotic perception and cognition: dynamic binocular robot sensor heads;  dexterous robot manipulation; soft object manipulation; physics-based environment modelling; interactive perception, proprioceptive environment exploration; symbol grounding; Deep Learning architectures.Research Interests I am interested in broad areas of spatial pattern perception and scene understanding - basically how we make sense not only of complex shapes and patterns, but also how we understand the relationships between patterns and what they mean. I have worked for many years in biologically motivated approaches to visual perception which attempt to mimic the sensing and perception mechanisms found in nature. A key objective of my work is to devise and construct vision systems that harness the visual processing principles and architectures found in nature. This research has produced a software retina which has been integrated with a complete visual classification and attention system. I am currently investigating how to combine  the known structure of the human visual system with the new Convolutional Deep Learning methods to support the development of practical general purpose robot vision systems.An animated head cloned from a 3D head scan A  view “through” an artificial software retinaMy early work at the Turing Institute (Glasgow) in 3D vision systems led to the development of commercial 3D surface scanning technology which is now marketed worldwide and used in diverse areas such as 3D surface anatomy assessment and construction of virtual cine characters, as developed and marketed,for example, by Dimensional Imaging Ltd. Many of my research collaborations have involved clinical groups, such as the Glasgow Dental School, working on 3D imaging and interpretation of surface anatomy for surgery planning and assessment.My current research now focuses on 2D and 3D computer vision methods for cognitive robot vision systems and intelligent visual sensing. This research investigates 2D and 3D feature extraction methods, computer vision architectures and active control of binocular robot sensor heads to direct their gaze autonomously. The primary objective of this research is to enable robots to interrogate real-life cluttered scenes visually and undertake tasks such as object recognition for grasping and cognitive reasoning for planning dexterous manipulation of both rigid objects and also soft materials (such as textiles or biological tissues). A combined CT skull reconstruction with 3D face scan superimposed (In collaboration with Glasgow Southern General Hospital)Dexterous Blue, an autonomous clothes folding robot developed within the EU funded CLOPEMA project.More details of my research are available here. AnnouncementsUpcoming presentation: A Biologically motivated software retina for robotic sensors for ARM-based mobile platform technology J. Paul Siebert, Adam Schmidt, Gerardo Aragon-Camarasa, Nick Hockings, Xiaomeng Wang & W. Paul Cockshott. To be presented at the ARM Research Summit 2016, Cambridge, 15-16 September, Cambridge, UK 1An Introduction to 3D Computer Vision Techniques and Algorithms, Boguslaw Cyganek, J. Paul Siebert, Wiley, ISBN: 978-0-470-01704-3, 504 pages, January 2009 is now available in ChinesePhD and Visiting Researcher applications for Academic Year 2017-2018 in Computer Vision and Robotics now open. Please contact me with enquiries relating to possible PhD and Researcher projects. I shall soon be announcing possible student projects in Computer Vision and Robotics for AY 2016-2017 here.Recent Publications J. Paul Siebert, Adam Schmidt, Gerardo Aragon-Camarasa, Nick Hockings, Xiaomeng Wang & W. Paul Cockshott A Biologically motivated software retina for robotic sensors based on smartphone technology,  Workshop on the Architecture of Smart Cameras, July 4th and 5th - 2016, Dijon, France.Sun, L., Rogers, S., Aragon-Camarasa, G., and Siebert, J. P. (2016) Recognising the Clothing Categories from Free-Configuration Using Gaussian-Process-Based Interactive Perception. In: IEEE International Conference on Robotics and Automation (ICRA), Stockholm, Sweden, 16-21 May 2016, 2464 -2470. (doi:10.1109/ICRA.2016.7487399)Sun, L., Aragon Camarasa, G., Khan, A., Rogers, S., and Siebert, P. (2016) A precise method for cloth configuration parsing applied to single-arm flattening. International Journal of Advanced Robotic Systems, 13, 70. (doi:10.5772/62513)Katina, S. et al. (2016) The definitions of three-dimensional landmarks on the human face: an interdisciplinary view. Journal of Anatomy, 228(3),  pp. 355-365. (doi:10.1111/joa.12407) (PMID:26659272) (PMCID:PMC4832301)Liu, Y., and Siebert, J. P. (2016) HBD: Hexagon-Based Binary Descriptors. In: 11th Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications, Rome, Italy, 27-29 Feb 2016, pp. 175-182. ISBN 9789897581755 (doi:10.5220/0005720401750182)Khan, A., Aragon-Camarasa, G., and Siebert, J. P. (2016) A Portable Active Binocular Robot Vision Architecture for Scene Exploration. In: 17th Towards Autonomous Robotic Systems (TAROS-16), Sheffield, UK, 28-30 June 2016, (Accepted for Publication)Qi, L., Chantler, M. J., Siebert, J. P., and Dong, J. (2015) The joint effect of mesoscale and microscale roughness on perceived gloss. Vision Research, 115(Part B),          pp. 209-217. (doi:10.1016/j.visres.2015.04.014) (PMID:25969141)Sun, L., Aragon-Camarasa, G., Rogers, S., and Siebert, J. P. (2015) Accurate Garment Surface Analysis using an Active Stereo Robot Head with Application to Dual-Arm Flattening. In: IEEE International Conference in Robotics and Automation, Seattle, WA., USA, 26-30 May 2015, pp. 185-192. (doi:10.1109/ICRA.2015.7138998) Full Publication ListGoogle Scholar Citations Current & Recent ProjectsA study into robotic coat hanger manipulation, Spring/Summer 2016CLOPEMA (Clothes Perception and Manipulation)  EU FP7 STREP completed January 2015. All projects since 2001PhD StudentsBiographyTeaching & Administration Contact: Dr Jan Paul SiebertSchool of Computing Science,Sir Alwyn Williams Building18 Lilybank Gardens,University of Glasgow,G12 8RZScotland UK Phone:+44 (0) 141 330 3124Fax: +44(0) 141 330 3119Room: S143Directions: Second floor (enter by Sir Alwyn Williams Building, No.18 Lilybank Gardens)Email: paul.siebert @ glasgow.ac.uk",
  "content_length": 6923,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:46"
}