{
  "name": "Jan van Eijck",
  "homepage": "http://homepages.cwi.nl/~jve",
  "status": "success",
  "content": "Jan van Eijck Jan van Eijck Home Activities Publications Manuscripts Courses Software Philosophy Contact About Me photograph by Yanjing Wang I am a Senior Researcher at CWI (Centre for Mathematics and Computer Science), Amsterdam, and part time full professor of computational semantics at ILLC (Institute for Logic, Language and Computation), Amsterdam. Until november 2011 I was part-time full professor of computational linguistics at Uil-OTS (Research Institute for Language and Speech), Utrecht. I teach Software Specification and Testing in the Master of Software Engineering curriculum at the University of Amsterdam. I am former scientific director of the Dutch Research School in Logic (1997 -- 2002). I am a former employee of SRI-International (Cambridge UK Laboratory), where I was involved in the design of an industrial scale natural language processing project. Before that, I held an associate professorship at the University of Tilburg. I have a PhD from the University of Groningen (1985). Here is my CV. Events and Activities Events and Activities 2017 Public Announcements and Public Lies, talk given at the Lorentz Center workshop on the Invention of Lying, January 12, 2017. Public Lies and How to Recover From Them, talk given at the Workshop on Rationality, Logic, and Decisions, January 24, 2017, organized at the occasion of the PhD defense of Paolo Galeazzi (Jan 25). 2016 Belief in Social Software, keynote address at Games, Logic and Society, An 80th Birthday Celebration Honoring Rohit Parikh, City University of New York, December 1-2, 2016. Member of the MOL Thesis Committee for Arianna Novaro, Sept 26. Member of the MOL Thesis Committee for Sirin Botan, Sept 26. Host of Kai Li, PhD student from Peking University, who is visiting CWI for the academic year 16/17. Host of dr. Fengkui Ju from Beijing Normal University, who is paying a scientific visit to ILLC for the academic year 16/17. External examiner of PhD Thesis of Faustine Maffre, Sept 23, Toulouse (University Paul Sabatier). Update, Probability, Knowledge and Belief, talk at Advances in Modal Logic 2016, Budapest, Sept 2 (joint work with Brian Renne). Modelling Legal Relations, talk at LOFT conference, Maastricht, July 20 (joint work with Fengkui Ju). Talk for DigiVita Zomerkamp 2016 (introduction to programming for fifty girls in the age range 11-15), July 18. Supervisor of the MSc Thesis Software Engineering of Ardavan Ghaffari, August 23. Supervisor of the MSc Thesis Software Engineering of Joel Bartholomew, July 13. Working visit to Gothenburgh (group of Shalom Lappin), Feb 21 - 24. External examiner of the BA Thesis of Declan Thompson, on Boolean network games, University of Auckland, New Zealand. Member of the MOL thesis committee for Eli Drumm, July 4, Amsterdam. Supervisor of the MOL thesis for Philip Michgelsen, July 5, Amsterdam. Member of the MOL thesis committee for Leanne Streekstra, July 7, Amsterdam. Participant of the Trimestre Thematique CIPPMI at University Paul Sabatier, Toulouse, April, May, June 2016. I gave a course \"Epistemic Logic Meets Probability\". Supervisor of the BSc theses (AI) for Thomas Unger, Wessel Klijnsma and Winand Renkema, July, Amsterdam. Talk on Logic and Action, AUC, Amsterdam, May 19. Member of the PhD Committee for Zoe Christoff, March 22, Amsterdam. MOL January Theme project on Genetic Programming., January 4--29. 2015 Update, Probability, Knowledge and Belief, invited LogiCIC workshop talk, Amsterdam, November 27. Logic and Action, Beijing Normal University talk, Beijing, November 5. Epistemic Model Checking Course, Tsinghua University, November 2--6. Update, Probability, and Belief, Peking University talk, Beijing, October 22. Gossip in Dynamic Networks, invited talk at the 3rd Tsinghua Logic Colloquium, Beijing, October 21. Functional Specification of Algorithms Course, Master of Logic, University of Amsterdam, Sept--Oct. To Be Announced! Synthesis of Epistemic Protocols Lorentz Center workshop, 17--21 August 2015, organized by Thomas Bolander, Hans van Ditmarsch, Jan van Eijck and Ramaswamy Ramanujam. Member of the MSc Thesis committee for Konstantinos Gkikas, September 3. Member of the MSc Thesis committee for Suzanne van Wijk, September 3. Master SE Thesis supervisor of Kai Bakker, defended on August 27. Master SE Thesis supervisor of Zarina Efendjeva, defended on August 24. Member of the MSc Thesis committee for Frank Feys, June 17. Member of the MSc Thesis committee for Babette Paping, April 20. Understanding Bias, talk held at the birthday workshop for Rineke Verbrugge, Groningen, March 12. Member of the MSc Thesis committee for Roosmarijn Goldbach, March 11. Member of the MSc Thesis committee for Ignas Vysniauskas, Jan 30. Member of the MSc Thesis committee for Johannes Emerich, Jan 30. 2014 Participated in Dagstuhl seminar Planning with Epistemic Goals, January 12--15. Member of the MSc Thesis committee for Andreea Achimescu, February 21. Member of the NWO Veni Committee 2014 for Computer Science. Member of the MSc Thesis Committee of Sarah McWhirter (Master of Logic, June 2, 2014). Member of the MSc Thesis Committee of Justin Kruger (Master of Logic, August 29, 2014) Member of the MSc Thesis Committee of Lara van Weegen (Master of Logic, December 16, 2014) BSc Thesis (Computer Science and Mathematics) supervisor for Sander in 't Veld (together with Inge Bethke). MSc Thesis (Logic) supervisor for Malvin Gattinger, Dynamic Epistemic Logic for Guessing Games and Cryptographic Protocols, June 20, 2014. MSc Thesis (Software Engineering) supervisor for Laurens Knoll, Ivan Plantevin, Santiago Carillo, Janneke Lamberink, Romy Moerbeek. Member of the PhD Thesis Committee of Atze van der Ploeg (April 8, 2015). Member of the ILLC Johan van Benthem celebration committee, September 26 and 27 (together with Alexandru Baltag, Peter van Ormondt and Robert van Rooij). Master of Software Engineering Course on Software Specification and Testing, September-October. Master of Logic Course on Formal Specification of Algorithms, September-October. ILLC Projects \"Haskell Road\" with Francesco Gavazzo, Bill Noble, Tim van der Molen, Thomas Santoli, January and June, 2014. Work in progress: Reasoning about Communication and Action, book manuscript, together with Alexandru Baltag, Johan van Benthem and Sonja Smets. What does it mean to know a number?, Dagstuhl talk, Jan 15. Logic, Languages and Programming. January 20. Source code: LLP.hs. Guest Lecture in the course `Theory of Programming' for the Minor Programming, University of Amsterdam. The two-hour talk is on video and can be viewed here (but you will need a UvA id to access the video). Cryptographic Protocol Analysis with Kripke Models, PEM talk, Amsterdam, January 24, 2014. Programming for DEL Tutorial Day, for the LiRA community, ILLC, Amsterdam, March 12, 2014. Logic, (Functional) Programming, Model Checking. Guest lecture, Logic in AI, Amsterdam, May 22, 2014. Belief, Probabilities, Updates, and Model Checking, Invited talk, Workshop on The Logical Dynamics of Information, Agency and Interaction, Amsterdam, October 2, 2014. Selected Topics in Communication and Action, Talk at LiRA seminar, Amsterdam, October 25, 2014. Knowledge, Belief, Probabilities, Updates, Model Checking. LoLaCo Guest lecture, Amsterdam, November 17, 2014. Belief, Uncertainty, and Probability, Invited talk, Synthese Conference on Qualitative and Quantitative Methods in Formal Epistemology, Amsterdam, November 20, 2014. 2013 For the record: here is a link to a letter that I wrote to the rector of our university. The letter, in Dutch, concerns prevention of exam irregularities. The letter was never answered. According to some colleagues this was a disgrace (\"een schande\"), according to some others it was only to be expected. The Haskell Road to Logic, Mahs and Programming, Second Edition, by Kees Doets and Jan van Eijck, appeared in January 2013. The book copyright page says 2012, but I received the copies in January 2013. The second edition has a new section on computing polynomial representations for number sequences, using the calculus of finite differences, plus updated code, and error corrections. Together with Floor Sietsma, I published a follow-op paper on Action Emulation, in The Journal of Philosophical Logic. This appeared in December 2013. Implementation work on DEMO for S5 and for a probabilistic version of epistemic logic. See demo_s5 and prodemo. A new Master of Logic Course on `Functional Algorithm Specification'. See here. Heleen Booy defended her Master of Logic Thesis, written under my supervision, on June 25, 2013. See here. Carsten Ruetz defended his Master Thesis in Computer Science at University of Nijmegen (Radboud University), written under the joint supervision of Jan Tretmans and me (November 8, 2013). Supervision of three master theses for the Master Programme Software Engineering (Jesse van Assen, Sven Meijer, Bas Vertelman). Host of Dr. Francois Schwarzentruber, on visit from the University of Rennes in the last week of August 2013. We wrote a paper on Probabilistic Epistemic Logic together. Member of the PhD Thesis Committee for Arno Bastenhof, University of Utrecht (April 12, 2013). Member of the PhD Thesis Committee for Frederic Moisan, University of Toulouse (September 2, 2013). Member of the master thesis committee of Robert Carrington, ILLC (Aug 20 2013). Member of the NWO assessment committee `Vrije Competitie 2013'. From Number Guessing Games to Security Protocol Analysis and Back, Invited talk for Reinhard Muskens' jubilee event, Tilburg, Dec 16, 2013. Elements of Epistemic Crypto Logic, LogiCIC Workshop, Amsterdam, December 2, 2013. Semantics, Communication, and Probability, Dagstuhl Workhop `Computational Models of Language Meaning in Context', Schloss Dagstuhl, Germany, Nov 12, 2013. Renunciation Games, IRIT Workshop Talk (invited), Toulouse, September 3, 2013. Why Learn Haskell?, Programming Summer School, University of Amsterdam, July 2, 2013. Comm",
  "content_length": 41779,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:54"
}