{
  "name": "Jan Ingemar Markendahl",
  "homepage": "https://www.kth.se/profile/janmar",
  "status": "success",
  "content": "KTH | Jan Markendahl Skip to main content Jan MarkendahlSenior Associate professorKungliga Tekniska Högskolanhttps://www.kth.se/profile/janmarDetailsWorks for Division of Communication SystemsTelephone +46 8 790 93 58Unit address Malvinas Väg 10E-mail janmar@kth.seAbout meJan Markendahl is Associate Professor (Docent in Communication Systems). He is at the Communication Systems department at the EECS school and has been involved in many EU and Vinnova projects at . Jan has a position as Associate professor ( Universitetslektor) in \"Wireless Infrastructure Deployment and Economics\" . After more than 20 years in the Industry Jan joined KTH 2003 and worked as a research program manager leading Vinnova projects and tasks in EU FP7 project in the area of  Wireless Networks. 2008 he re-started his PhD studies from the 1980´s (Jan got a Licentiate degree in Telecommunications Theory 1986). In February 2011 he presented his PhD thesis in a new research area (techno-economics), the title is:  \"Mobile Network Operators and Cooperation -  A techno-economic study of infrastructure sharing and mobile payment services\". Jan got the docent degree June 2014 and is currently building up a resaerch team in the area of techno-economic design and analysis of telecom networks and services. Current research interests include 5G , spectrum , smart city services, sharing economy and IoT platforms, services and business models. Besides beeing examiner for thesis projects the teaching assignements include development, teaching and beeing examinierfor techno-economic courses and course modules at the bachelor, master and doctoral level, see below for all courses. From 2015 he has been the main advisor for 7 PhD students. The track record so far: Istiak Hossain (PhD 2019, Lic 2016), Tatjana Apanasevic (PhD 2018, Licentiate 2015), Andres Laya (PhD 2017), Luis Martinez (PhD 2017), Ashraf Widaa (Licentiate 2017), Amirhossein Ghanbari (Licentiate 2016). CoursesMobile Networks and Services (IK2560), teacherWireless Networks (IK2510), teacherWireless Systems (IK1330), teacher",
  "content_length": 2078,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:38"
}