{
  "name": "Jan Reineke 0001",
  "homepage": "http://embedded.cs.uni-saarland.de/reineke.php",
  "status": "success",
  "content": "Real-Time and Embedded Systems Lab Real-Time and Embedded Systems Lab Team Prof. Jan Reineke Dr. Guillaume Didier Gideon Mohr Alumni Dr. Sebastian Hahn Dr. Andreas Abel Shrey Sharma Dr. Valentin Touzeau Contact Information Research Publications Presentations Tools LLVMTA An open-source WCET analysis Tool based on the LLVM compiler infrastructure uops.info - Latency, Throughput, and Port Usage Information for Instructions on Recent Intel Processors uiCA - The uops.info Code Analyzer nanoBench - A tool for running small microbenchmarks Spectector - Automatic detection of speculative information flows chi - Cache Hierarchy Inference CacheAudit: A Tool for the Static Analysis of Cache Side Channels MeMin - Mealy Minimization Relacs - Automatic Relative Competitive Analysis PTARM Simulator Sprattus - A Framework for Rapid Prototyping of Program Analyses Thesis Topics Teaching Winter 2025/2026 Advanced Course: Program Analysis Seminar: Security at the Hardware-Software Interface Group Seminar Earlier Courses Summer 2025 Course: System Architecture Group Seminar Winter 2024/2025 Advanced Course: Program Analysis Seminar: Hardware Security: Testing and Verification Group Seminar Summer 2024 Course: System Architecture Group Seminar Winter 2023/2024 Advanced Course: Program Analysis Group Seminar Summer 2023 Course: System Architecture Group Seminar Winter 2022/2023 Advanced Course: Program Analysis Seminar: Microarchitectural Security via Hardware-Software Contracts Group Seminar Summer 2022 Course: System Architecture Group Seminar Winter 2021/2022 Course: Einführung in eingebettete Systeme Group Seminar Summer 2021 Course: Systemarchitektur Group Seminar Winter 2020/2021 Advanced Course: Program Analysis Seminar: Microarchitectural Attacks and Defenses Group Seminar Summer 2020 Course: Systemarchitektur Group Seminar Winter 2019/2020 Course: Einführung in eingebettete Systeme Advanced Course: Program Analysis Group Seminar Summer 2019 Course: Systemarchitektur Group Seminar Winter 2018/2019 Course: Einführung in eingebettete Systeme Advanced Course: Program Analysis Seminar/Proseminar: Hardware Design Group Seminar Summer 2018 Course: Systemarchitektur Winter 2017/2018 Advanced Course: Verification of Real-Time Systems Course: Einführung in eingebettete Systeme Summer 2017 Course: Systemarchitektur Summer School Course: Design and Analysis of Time-Critical Systems Winter 2016/2017 Course: Einführung in eingebettete Systeme Seminar/Proseminar: Hardware Design Summer 2016 Course: Systemarchitektur Winter 2015/2016 Seminar: Resource Sharing in Real-Time Systems Seminar: Programming Language Implementation Summer 2015 Advanced Course: Verification of Real-Time Systems Winter 2014/2015 Advanced Course: Static Program Analysis Summer 2014 Course: Systemarchitektur Winter 2013/2014 Seminar: Robustness of Hardware and Software Systems Summer 2013 Advanced Course: Design and Analysis of Real-Time Systems Winter 2012/2013 Proseminar: Statische Programmanalyse Summer 2012 Doctoral Privatissimum: The impact of resource sharing on performance and performance prediction Basic Course: Programmieren für Ingenieure Thesis Topics [Accessible from University VPN] Jan Reineke Real-Time and Embedded Systems Lab Saarland University Saarland Informatics Campus Phone: +49 681 302 4448 eMail: Please active Javascript to see my eMail address. Building: E 1 3 Room: 410 Coordinates: N 49.257833° E 7.045144° Administrative Assistant: Sandra Neumann Phone: +49 681 302 3434 Building: E 1 3 Room: 430 Office Hour: Wednesday 16:00-17:00 (please send me an email, as I may be travelling; other times are possible) I am looking for PhD students and postdocs to work on safety and security problems at the hardware-software interface! Possible research topics are flexible and include but are not limited to: Static program analysis of real-time and security properties Design of timing-predictable microarchitectures Design of secure microarchitectures Formal verification of hardware w.r.t. hardware-software contracts If you are interested, please feel free to . My work is generously supported by an ERC Advanced Grant. If you are interested in working with me and my group or if you are looking for a Bachelor or Master thesis topic, please feel free to stop by my office or to drop me an email. Short CV Jan Reineke is a professor of computer science at Saarland University. Before joining Saarland University in 2012, he has been a postdoctoral scholar at UC Berkeley in the Ptolemy group from 2009 to 2011. He completed his MSc and PhD in Computer Science at Saarland University in 2005 and 2008, respectively, and his BSc in Computing Science at the University of Oldenburg in 2003. His research centers around problems at the boundary between hardware and software. In the area of real-time systems, he is particularly interested in principles for the design of timing-predictable hardware and in precise and efficient timing-analysis techniques for multi-core architectures. His recent results include the design of the first provably timing-predictable pipelined processor design (RTSS 2018) and the first exact analyses for LRU caches (CAV 2017, POPL 2019, RTSS 2019). Another focus of his work are security vulnerabilities of hardware-software systems. Recent results include the development of automatic techniques to detect information leaks introduced by speculative execution (Spectector, S&P 2020), techniques to quantify the information leakage through cache side channels (ACM TISSEC 2015), and automatic methods to obtain highly detailed performance models for modern microarchitectures (uops.info, ASPLOS 2019). In 2012, he was selected as an Intel Early Career Faculty Honor Program awardee. He was the PC chair of EMSOFT 2014, the International Conference on Embedded Software, a Topic co-chair at DATE 2016 and the PC chair of WCET 2017, the International Workshop on Worst-Case Execution Time Analysis. His papers have been awarded ten outstanding paper awards and two best-paper nominations, most recently at RTAS (2025), DATE (2024), CCS (2023), RTSS (2023, 2019, 2018), Oakland (2021), and ECRTS (2017). In 2021, he was awarded an ERC Advanced Grant. Selected Recent Publications Conference and Workshop Papers A Unified Framework for Quantitative Cache Analysis (Best Student Paper Award )S. Kahlen and J. ReinekeRTAS, 2025[doi] [bib]@inproceedings{KahlenRTAS2025, title = {A Unified Framework for Quantitative Cache Analysis}, author = {Kahlen, Sophie and Reineke, Jan}, booktitle = {31st {IEEE} Real-Time and Embedded Technology and Applications Symposium, {RTAS} 2025, Irvine, CA, USA, May 6-9, 2025}, doi = {10.1109/RTAS65571.2025.00018}, pages = {54--67}, publisher = {{IEEE}}, timestamp = {Thu, 12 Jun 2025 14:48:52 +0200}, url = {https://doi.org/10.1109/RTAS65571.2025.00018}, year = {2025} } Synthesis of Sound and Precise Leakage Contracts for Open-Source RISC-V ProcessorsZ. Wang, G. Mohr, K. Gleissenthall, J. Reineke, and M. GuarnieriCCS, 2025[bib]@inproceedings{wang2025synthesis, title = {Synthesis of Sound and Precise Leakage Contracts for Open-Source RISC-V Processors}, author = {Wang, Zilong and Mohr, Gideon and Gleissenthall, Klaus von and Reineke, Jan and Guarnieri, Marco}, booktitle = {Proceedings of the 32nd ACM Conference on Computer and Communications Security}, publisher = {ACM}, series = {CCS 2025}, year = {2025} } Synthesizing Hardware-Software Leakage Contracts for RISC-V Open-Source Processors (Best Paper Award Candidate )G. Mohr, M. Guarnieri, and J. ReinekeDATE, March 2024[bib]@inproceedings{Mohr24, title = {Synthesizing Hardware-Software Leakage Contracts for RISC-V Open-Source Processors}, author = {Mohr, Gideon and Guarnieri, Marco and Reineke, Jan}, booktitle = {Design, Automation and Test in Europe Conference and Exhibition (DATE), 2024}, month = {Mar}, organization = {IEEE}, year = {2024} } Leveraging LLVM's ScalarEvolution for Symbolic Data Cache Analysis (Outstanding Paper Award )V. Touzeau and J. ReinekeRTSS, 2023[bib]@inproceedings{Touzeau23, title = {Leveraging LLVM's ScalarEvolution for Symbolic Data Cache Analysis}, author = {Touzeau, Valentin and Reineke, Jan}, booktitle = {2023 {IEEE} Real-Time Systems Symposium, {RTSS} 2023, Taipei, Taiwan, December 5-8, 2023}, year = {2023} } Specification and Verification of Side-channel Security for Open-source Processors via Leakage Contracts (Distinguished Paper Award at CCS 2023 and Intel Hardware Security Academic Award Finalist 2024)Z. Wang, G. Mohr, K. Gleissenthall, J. Reineke, and M. GuarnieriCCS, 2023[bib]@inproceedings{wang2023specification, title = {Specification and Verification of Side-channel Security for Open-source Processors via Leakage Contracts}, author = {Wang, Zilong and Mohr, Gideon and Gleissenthall, Klaus von and Reineke, Jan and Guarnieri, Marco}, booktitle = {Proceedings of the 30th ACM Conference on Computer and Communications Security}, publisher = {ACM}, series = {CCS 2023}, year = {2023} } uiCA: Accurate Throughput Prediction of Basic Blocks on Recent Intel MicroarchitecturesA. Abel and J. ReinekeICS, 2022[bib]@inproceedings{Abel22, title = {{uiCA}: Accurate Throughput Prediction of Basic Blocks on Recent {Intel} Microarchitectures}, author = {Abel, Andreas and Reineke, Jan}, booktitle = {{ICS} '22: 2022 International Conference on Supercomputing, Virtual Event, USA, June 27-30, 2022}, series = {ICS '22}, editor = {Rauchwerger, Lawrence and Cameron, Kirk and Nikolopoulos, Dimitrios S. and Pnevmatikatos, Dionisios}, pages = {1--12}, publisher = {{ACM}}, month = {June}, year = {2022}, url = {https://dl.acm.org/doi/pdf/10.1145/3524059.3532396} } Hardware-Software Contracts for Secure Speculation (Best Paper Award )M. Guarnieri, B. Köpf, J. Reineke, and P. VilaS&P (Oakland), May 2021[bib]@inproceedings{Guarnieri21, title = {Hardware-Software Contracts for Secure Speculation}, author = {Guarnieri, Marco and K{{\\\"o}}pf, Boris and Reineke, Jan and Vila, Pepe}, booktitle = {2021 {IEEE}",
  "content_length": 12810,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:47"
}