{
  "name": "Jan Modersitzki",
  "homepage": "https://www.mic.uni-luebeck.de/people/jan-modersitzki.html",
  "status": "success",
  "content": "Jan Modersitzki: MIC Zur Navigation springenZum Content springenSearch | Impressum | Privacy About usNewsTeachingMathematikstudium in LübeckMA5038-KP08 Vertiefung BildverarbeitungStudent ProjectsResearch and ProjectsImage registration and trackingVariational Image ProcessingIndustrial SolutionsMICCAI TutorialNav EvarUpcoming ConferencesPeopleJohannes BostelmannDaniel BudelmannBernd FischerFlorian GalowOle GildemeisterStephanie HägerStefan HeldmannTemke KohlbrandtSven KuckertzAnnkristin LangeJan LellmannTanja LoßauJohannes LotzJan ModersitzkiTill NickeNils PapenbergSofie SaierKerstin SietasAngela TesdorpfHerbert ThieleJohannes VoigtsSina WalluscheckNick WeissSonja WichelmannPublicationsList of publicationsBooksPhD ThesesCareer & EducationCSE 2026RegistrationProgramCommitteesContactHow to find us MIC | Institute of Mathematics and Image Computing University of Lübeck - Institute of Mathematics and Image Computing - People - Jan Modersitzki Prof. Dr. rer. nat. Jan Modersitzki Institute of Mathematics and Image Computing University of Lübeck Fraunhofer MEVIS Maria-Goeppert-Str. 3 23562 Lübeck Email: jan.modersitzki(at)uni-luebeck.de Phone: +49 451 3101 6100 Fax: +49 451 3101 6104 Mondays 4:30-5:30 p.m. by appointment (please send email) PeopleJohannes BostelmannDaniel BudelmannBernd FischerFlorian GalowOle GildemeisterStephanie HägerStefan HeldmannTemke KohlbrandtSven KuckertzAnnkristin LangeJan LellmannTanja LoßauJohannes LotzJan ModersitzkiResearch InterestsCurriculum VitaePublicationsSoftwareTutorialsTill NickeNils PapenbergSofie SaierKerstin SietasAngela TesdorpfHerbert ThieleJohannes VoigtsSina WalluscheckNick WeissSonja Wichelmann Institute of Mathematics and Image Computing Tel:  +49 451 3101 6101 Fax: +49 451 3101 6104 Email: mic.office(at)uni-luebeck.de",
  "content_length": 1788,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:42"
}