{
  "name": "Jana Doppa",
  "homepage": "http://eecs.wsu.edu/~jana",
  "status": "success",
  "content": "Jana's Homepage Janardhan Rao ( Jana ) Doppa Professor    Huie-Rogers Endowed Chair Professor of Computer Science Berry Distinguished Professor in Engineering Chair, EECS Graduate Studies    School of EECS, Washington State University Office: EME 133 Office Hours: By appointment for Fall-2025 Voice: 1-509-335-1846 (Email is the preferred option) Email: jana.doppa [AT] wsu.edu LATEST UPDATES PhD Student Aryan Deshwal started as an Assistant Professor with University of Minnesota and won Outstanding PhD Disseration Award  from the College of Engineering PhD Student Syrine Belakaria started as a Postdoctoral Fellow @ Stanford University and won Harriet B. Rigas Award from WSU PhD Student Gaurav Narang started as a Postdoc @ Arizona State University and won Outstanding Research Assistant Award from the College of EngineeringWSU Faculty Mid-Career Award (2024) and Voiland College of Engineering Anjan Bose Outstanding Researcher Award (2024) Best Paper Award, ACM/IEEE International Symposium on Low Power Electronic Design (2023) and ACM/IEEE Embedded Systems Week Conference (2023) Best Paper Award, ACM/IEEE Embedded Systems Week Conference (2022); Best Paper Award, ACM Transactions on Design Automation of Electronic Systems (2021) PhD Student Biresh Joardar started as a Tenure-Track Assistant Professor with University of Houston and won NSF Computing Innovation Fellowiship (2020) Excited to be part of the newly funded NSF-USDA AI Institute for Agriculture Decision Support and lead the AI Thrust on modeling systems of knowns and unknowns. PhD Student Syrine Belakaria won IBM PhD Research Fellowship (2021) and was a finalist for Microsoft Research Fellowship (2021)! I'm super proud of her! Outstanding Junior Faculty in Research Award (2020) and Reid Miller Teaching Excellence Award (2018) from the Voliland College of Engineering and Architecture NSF CAREER Award (2019) Thanks NSF! Outstanding Paper Award at AAAI Conference (2013) My general research interests are in the broad field of artificial intelligence (AI), where I mainly focus on sub-fields of machine learning, and data-driven science and engineering. Current focus of my work is: AI-driven Adaptive Experimental Design with applications to engineering and scientific domains Sequential Decision-making under Uncertainty problems motivated by real-world applications including agriculture and optimization of cyber-physical systems such as smart grid and smart health Robust Machine learning and Decision-making for high-stakes applications Use-inspired AI research to enable high-impact applications in domains including agriculture, materials discovery, additive manufacturing, and healthcare Machine Learning to improve Electronic Design Automation for designing high-performance, energy-efficient, and reliable hardware for large-scale data analysis applications Optimized Computer Architectures for Big Data Computing using Emerging Technologies (e.g., Through-Silicon-Via / Monolithic 3D integration, Heterogeneous systems, and Processing-in-Memory cores) Machine Learning for Sustainable Computing and Computational Sustainability Note for Prospective Students: I'm always looking for strong, self-motivated, and ambitious PhD students. You can find more details here. For undergrad students at WSU: If you are interested in working with me for research experience and/or honors thesis, please take my data mining class (CptS 315) and we can discuss the details along the way. Please read this article for some useful advice. Undergrad / MS Non-Thesis Advising Meetings: Please drop by my office hours. If my office hours don't work for you, please send me an email for appointment. Quick Links:   [  Research ] [ Publications  ]   [  Teaching  ] [ Students ] [  Awards and Honors  ]   [  Professional Service  ] [  Reading Groups ] [  Personal ] Education Ph.D., Computer Science, Oregon State University, 2014 M.Tech., Computer Science, Indian Institute of Technology, Kanpur, India, 2006 Research I like to work on artificial intelligence and machine learning problems motivated from important real-world applications.  A sample of my current and recent research projects include: AI to Accelerate Science and Engineering How can we develop AI methods by combining valuable domain knowledge and data to accelerate scientific discovery and engineering design? We are exploring novel adaptive experiment design algorithms to provide computing and planning support for scientists and engineers in selecting experiments under resource constraints. We have developed novel Bayesian optimization (BO) algorithms to optimize combinatorial spaces (see AAAI-2020, AAAI-2021, NeurIPS-2021, AAAI-2022 , and AISTATS-2023 papers); BO for hybrid spaces (ICML-2021 paper); BO for optimizing multiple objectives (see NeurIPS-2019 , AAAI-2020 , and AAAI-2024 papers); BO for multi-fidelity optimization (see AAAI-2020 , NeurIPS-2020 workshop, and JAIR-2021 papers); BO for handling black-box constraints (see NeurIPS-2020 workshop , JAIR-2021 , and CODS-COMAD-2024 papers); and grey-box BO for Auto ML tasks (see AISTATS-2023 paper). See my IJCAI-2021 Early Career Spotlight paper for a short summary of this research. AI for electronic design automation and manycore systems design with our collaborators Partha Pande @ WSU, Krish Chakrabarty @ Duke, Helen Li @ Duke, and Deuk Heo @ WSU.  See papers in the below section. AI for electric transportation systems with our power systems collaborator Yue Cao @ Oregon State. See our ECCE-2020 conference paper and TTE-2021 journal paper. AI for nanoporous materials (NPMs) design and chemical sciences with our chemistry collaborator Cory Simon @ Oregon State. We are looking at sustainability applications of NPMs such as (gas storage) densifying hydrogen - a clean fuel - for compact storage onboard vehicles; (gas separation) capturing carbon dioxide from flue gas of coalfired power plants; subsequently sequester it to prevent global warming; and (gas sensing) detecting toxic compounds and explosives. See our MSDE-2021 and Digital Discovery-2023 papers for some initial results. AI for agricultural decision support to improve water management, farm management, and harvest management by overcoming labor shortage. Excited to be part of the newly funded NSF-USDA AI Institute for Agriculture Decision Support and lead the AI Thrust on modeling systems of knowns and unknowns. Machine Learning meets Computing Systems Design: ML for Systems and Systems for ML How can we exploit the synergies between machine learning and computing systems to enable the design of high-performance, energy-efficient, and reliable computing systems spanning from edge devices to servers to cloud, which will empower further advances in ML? Machine learning methodologies for design space exploration and optimization of manycore systems to significantly reduce the overall engineering cost and design time of application-specific hardware. We developed a theory-guided ML framework by combining the domain knowledge from manycore designers and training data from hardware simulations (see IEEE TCAD 2017, IEEE TC 2019, and ACM TECS 2019 papers) Machine learning for runtime resource management to save power by maintaining performance and temperature constraints in system-on-chips (SoCs) ranging from mobile to large-scale manycore systems. We developed a theory-guided ML framework by using the learned models of design objectives (e.g., power, performance, and temperature) as a function of the system state to provide strong supervised training data to continuously improve the resource management policy (see IEEE TVLSI 2017, IEEE TVLSI 2019, ACM TODAES 2020 , and DAC-2021 papers) How can we leverage emerging technologies and machine learning to design high-performance and energy-efficient manycore systems for Big-Data workloads? For example, 3D integration is a breakthrough technology to achieve ``More Moore and More Than Moore,'' and provides numerous benefits (better performance, lower power consumption, and higher bandwidth) by utilizing vertical interconnects and 3D stacking; Processing-in-memory cores enabled by ReRAM will reduce the data movement; and  integrating heterogeneous processing cores of different types and functional granularity allows us to bridge the energy efficiency of application-specific hardware with the programmability of general-purpose processors. See IEEE TCAD 2017 for TSV-based 3D manycore systems; ICCD-2017 for benefits of M3D in homogeneous manycore systems; ACM TODAES 2018 for improved thermal and performance trade-offs in M3D based manycore systems; ACM TODAES 2019 for overcoming the challenges due to electrostatic coupling in M3D based manycore systems;  IEEE TC 2018 for integrating heterogeneous cores including CPUs and GPUs with conflicting QoS requirements on the same 2D SoC; IEEE TC 2019 for benefits of 3D heterogenous manycore systems ACM JETC 2020 for the benefits of partially connected 3D manycore systems using near-field inductive coupling based interconnect; and ACM TODAES 2021 for benefits of M3D based heterogeneous manycore systems including GPU cores. How can we design and optimize high-performance, energy-efficient, and reliable manycore systems for training a large class of deep neural networks. See ACM JETC 2018 for 3D manycore architecture with ReRAM based processing-in-memory cores,  IEEE TCAD 2021 for training CNNs by synergistically combining the benefits of M3D integration, ReRAM, and GPUs; IEEE TCAD 2021 to improve the 3D ReRAM/GPU architecture by optimising the normalization layers using BO, ACM TECS 2021 for reliable training of CNNs on unreliable ReRAM based manycore accelerators, and DATE-2021, IEEE TVLSI 2021, and ICCAD-2021 papers on processing-in-memory based manycore architectures for high-performance training graph neural networks. How can we create energy-efficient and secure edge AI? We have developed a general hardware and software co-design framework that is applicab",
  "content_length": 87700,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:52"
}