{
  "name": "Jana Pavlasek",
  "homepage": "https://janapavlasek.com",
  "status": "success",
  "content": "Jana Pavlasek I am an Assistant Professor in the Génie informatique & génie logiciel department (Computer & Software Engineering) at Polytechnique Montreal. I am also an Associate Academic Member at Mila, the Quebec AI Institute. I hold a PhD from the Robotics Department at the University of Michigan in Ann Arbor, where I worked in the Lab for Progress with Prof. Chad Jenkins. Previously, I studied Electrical Engineering at McGill University in Montreal, Canada, where I worked with the Mobile Robotics Lab. I also interned at NVIDIA's Robotics Lab. My research focuses on uncertainty in robotics. My work touches on how to represent uncertainty in perception systems, and how to handle uncertainty in planning. I'm particularly interested in how to combine probabilistic inference with machine learning. Here are some of my recent, representative publications and projects. For all my papers, see my publications page or my    Google Scholar. Distributed Inference for Multi-Robot Coordination How can we capture the complexity of multi-robot coordination? We propose Stein Variational Belief Propagation, an algorithm for performing inference on graphs. Then, we use it to infer trajectories for decentralized multi-robot control. RA-L '24 Paper Video Website Planning to Uncertain Goals How can we plan to arbitrary goal regions? We looked out how to plan to goals that are hard to model (e.g. stable grasping) by using valid goal samples directly as a planning objective. CoRL '23 Paper Video Website Articulated Object Pose Estimation by Parts Pose estimation is challenging in heavy clutter with many occlusions. We model objects as graphs of their parts and fuse known geometric priors with a learned likelihood to get robust pose estimates for articulated objects. IROS '20 Paper Video Website Teaching Robotics with Real Robots Can we make it easier to use real robots in the undergraduate classroom? The MBot is a robot designed for undergraduate education that aims to make robots more accessible to students and instructors. Learn about the MBot I'm passionate about teaching and have been lucky to teach some great groups of students during my PhD at the University of Michigan. Most recently, I've had the opportunity to co-develop a new course, Hello, Robot! Intro to Artificial Intelligence and Programming. This video describes the pilot offering of the course in 2021! Previous Teaching Hello, Robot! Intro to Artificial Intelligence and Programming Distributed Teaching Collaborative between University of Michigan, Berea College, and Howard University Developer, Teaching Consultant Fall 2023 Intro to Artificial Intelligence and Programming (ROB 102) University of Michigan Developer, Co-instructor Fall 2022 Fall 2021 Mathematics for Robotics (ROB 501) University of Michigan Graduate Student Instructor Fall 2019 Fall 2020 Autonomous Robotics (EECS 467) University of Michigan Graduate Student Instructor Winter 2020 Design Principles & Methods (ECSE 211) McGill University Teaching Assistant Winter 2016 Fall 2017 © Jana Pavlasek. All rights reserved.Design: HTML5 UP",
  "content_length": 3095,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:54"
}