{
  "name": "Jana M. Weber",
  "homepage": "https://www.tudelft.nl/en/ewi/over-de-faculteit/afdelingen/intelligent-systems/pattern-recognition-bioinformatics/the-delft-bioinformatics-lab/people/jana-m-weber",
  "status": "success",
  "content": "Jana M. Weber Search Close search Jana M. Weber Jana M. Weber is passionate about digital solutions to sustainability problems. Jana studies how network science and machine learning can push forward the development of sustainable bioprocesses. She works on method development and modelling in the domains of biocatalytic reaction route selection, sustainability assessment, process optimisation, and molecular property prediction. Jana is excited to collaborate with theoretical and experimental research groups interested in the bioeconomy. Jana M. Weber is an assistant professor for artificial intelligence in bioscience at the Department of Intelligent Systems at the TU Delft. She is part of the Delft Bioinformatics Lab and the lab manager of the AI4b.io lab. She received her M.Sc. in environmental (process) engineering from RWTH Aachen University in 2018 where she performed her Master thesis at the Institute of Bio- and Geoscience at the Jülich Research Institute. In 2022, Jana defended her Ph.D. in chemical engineering from the University of Cambridge, UK. Publications Please visit Jana’s Google scholar account. Collaborations Our research is highly interdisciplinary and collaborative at its core. We believe that working towards a more sustainable future requires bridging disciplines and institutions. We are happy to explore industrial as well as academic collaborations. If you are interested in our work, have questions, ideas, or expertise, let’s get in touch! Student research projects If you are searching for a research project at TU Delft (B.Sc., M.Sc., Honors) have a look at the following research topics and contact me if one of them sounds interesting to you! Based on your interests, we will design individual research projects within the topic: Topic-1: Network science in the biochemical reaction space: \tBio-chemical reactions can convert biomass into target products/materials. This gives rise to an extremely large potential biochemical reaction space. Using network science, we systematically explore the complex interactions within this space. Topic-2: Molecular representation, explainability, and property prediction: \tMolecular structures encode important biochemical information, e.g. properties of molecules or functions of proteins. Using ML methods, we study the mapping of biochemical information in molecular structures. Topic-3: Bioprocess modelling and sustainability assessment: \tBioprocesses do not only circumvent the use of fossil resources as feedstock but also potentially generate less waste and have favourable energy requirements. We explore and analyse their sustainability performance. Share this page: Facebook Linkedin Twitter Email WhatsApp Share this page Jana M. Weber J.M.Weber@tudelft.nl Van Mourik Broekmanweg 6 2628 XE Delft The Netherlands",
  "content_length": 2810,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:53"
}