{
  "name": "Janaki Srinivasan",
  "homepage": "https://janakisrinivasan.wordpress.com",
  "status": "success",
  "content": "Janaki Srinivasan Janaki Srinivasan Skip to content Research Publications Panels, Talks and Workshops Teaching CV Contact me About My research examines the political economy of information-based development initiatives. I use ethnographic and archival research to examine how ideologically diverse entities deploy information and information technologies towards achieving their varied visions of development in India. At the other end, I study how the equally heterogeneous targets of these efforts fundamentally shape information use along gender, caste and class lines. By examining diverse information cultures, and insisting on the role of power relations in shaping them, my goal is to inform technology and policy design that is politically aware and directly speaks to the inequities and heterogeneous information practices within a population. My preoccupation with “information” started as a doctoral student at the UC Berkeley School of Information. In my doctoral thesis, I explored the very different ways in which information was leveraged in campaigns demanding a right to access government records in Rajasthan and in the working of community-based information kiosks in Puducherry. Following my doctoral work, I studied the circulation of price information in fishing markets of Kerala with Jenna Burrell at the UC Berkeley School of Information and Richa Kumar, Indian Institute of Technology Delhi. As a postdoctoral research associate at the Virginia Tech Department of Engineering Education in 2013,  I worked with Aditya Johri on the Aadhaar project in India to understand how information gathering by the state mediates the relationship between a population and the state. In 2014,  as a fellow at The Slow Science Institute in Berkeley, I analyzed the trajectory of development thought that has enabled the deployment of information as a development tool in recent years. My first book The Political Lives of Information: Information and the Production of Development in India is a culmination of this work. Since joining the International Institute of Information Technology Bangalore as a faculty member in January 2015, I have  continued the various strands of my study of information and digital technologies in collaboration with a great group of colleagues at IIITB and beyond! My current work examines various categories and aspects of digital labour: I study platform work as part of the global Fairwork network and the Fairwork India team; am part of a research project on Humanising Automation, and interested in the labour of Dashboard builders for a third project called COVID Data Infrastructure Builders. Other topics of interest include Privacy and Algorithmic Opacity. Archives Search for: Meta Create account Log in Create a free website or blog at WordPress.com. HomeContact me CV Panels, Talks and Workshops Publications Research Teaching Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Janaki Srinivasan Sign up Log in Copy shortlink Report this content Manage subscriptions Loading Comments... Write a Comment... Email Name Website Design a site like this with WordPress.comGet started",
  "content_length": 3260,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:54"
}