{
  "name": "Jana Gicheva Makreshanska",
  "homepage": "https://db.in.tum.de/~giceva",
  "status": "success",
  "content": "Lehrstuhl für Datenbanksysteme Technische Universität München The Entrepreneurial University www.in.tum.de de en Prof. Dr. Jana Giceva Makreshanska Adresse: Technische Universität München Institut für Informatik – Lehrstuhl III (I3) Boltzmannstr. 3 85748 Garching Raum: 02.11.043 Telefon: +49 (0)89 / 289-17286 E-Mail: jana.giceva@in.tum.de Bürozeit: Termine nach Vereinbarung Research Interests and Bio Prof. Giceva's research interests are in systems support for data management to enable efficient use of modern and future hardware. She works at the intersection of systems, data management, compilers, and computer architecture. Her research often adopts a holistic approach to address the system's challenges imposed both by emerging computing platforms and by the need to efficiently process and analyze data collected at unprecedented rates. Before joining TUM in 2020, she was a faculty member at Imperial College London. Jana Giceva received her PhD at ETH Zurich in 2017. She also held roles with Microsoft Research and Oracle Labs. Recent Papers Highlights Declarative Sub-Operators for Universal Data Processing Michael Jungmair, Jana Giceva, VLDB (2023) Programming Fully Disaggregated Systems Christoph Anneser, Lukas Vogel, Ferdinand Gruber, Maximilian Bandle, Jana Giceva, HotOS (2023) Designing an Open Framework for Query Optimization and Compilation Michael Jungmair, Andre Kohn, Jana Giceva, VLDB (2022) Sortledton: a Universal, Transactional, Graph Data Structure Per Fuchs, Domagoj Margan, Jana Giceva, VLDB (2022) Database Technology for the Masses: Sub-Operators as First Class Entities Maximilian Bandle, Jana Giceva, VLDB (2021) To Partition, or not to partition, that is the join question in a real system Maximilian Bandle, Jana Giceva, Thomas Neumann, SIGMOD (2021) Publications Bibliography Server DBLP Google Scholar Awards ACM SIGMOD Records Research Highlights Award'23 for Sortledton Best paper runner-up at VLDB'22 for our paper \"Sortledton: a Universal, Transactional Graph Data Structure\". Honorable mention at SIGMOD'21 for our paper \"To partition, or not to partition, that is the join question in a real system\". VMware Early Career Faculty Award 2019 ETH Medal for outstanding PhD dissertation in the Department of Computer Science 2018 Google PhD Fellowship for Operating Systems 2014 Best Poster Award \"Databases and Operating Systems: Friends or Foes?\", EuroSys 2012 Recent Service Chair: SoCC 2023 Diversity, SIGMOD 23/24 Mentorship PC member: OSDI 2024, VLDB 2024, HotOS 2023, ATC 2023, SIGMOD DaMoN 2023, CIDR 2023 Roles in Dept. of CS/School of CIT: Deputy Gender Equality Officer for CS Head Speaker and Departmental Representative for Talent Management and Diversity in the Department of CS Faculty care-taker of Women in CS @ TUM. Teaching Winter 23/24: Seminar - OS in the Cloud: Past, Present, and Future Winter 23/24: Cloud-Based Data Processing Summer 23: Data Processing on Modern Hardware Summer 23: Seminar - Modern Database Systems Lehrstuhl III Datenbanksysteme Prof. Kemper Prof. Neumann Prof. Giceva Fakultät für Informatik TU München Navigation Aktivieren Sie bitte JavaScript, um das Menü anzuzeigen © TUM 2009 - 2023 Datenschutzerklärung Impressum",
  "content_length": 3227,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:52"
}