{
  "name": "Jane Hayes",
  "homepage": "http://selab.netlab.uky.edu/homepage",
  "status": "success",
  "content": "Dr. Jane Hayes, Professor Emerita as of June 30, 2021 Jane Hayes, Ph.D., Professor Emerita as of June 30, 2021 Dr. Jane Hayes: Professor Emerita of the Computer Science Department at the University of Kentucky. She assisted the university in establishing a software engineering curriculum. Previously, she was a Corporate Vice President and the Manager of the Integrated System Technologies Operation of Science Applications International Corporation (SAIC). She has over 16 years of experience in the field of verification and validation, testing, software development, and process improvement. She has been the verification and validation technical lead and/or program manager on numerous trusted software development efforts. She has led and participated in numerous management process/product audits and assessments of large projects. She has assisted with process, plan, and procedure development for testing and verification and validation, including assisting with the development of a Y2K testing standard for a commercial initiative. She is a Co-Founder and was the elected Director of the Center of Excellence for Software and Systems Traceability (COEST). Dr. Hayes holds a M.S. in Computer Science from the University of Southern Mississippi and a Ph.D. in Information Technology from George Mason University (GMU). She is the founding President of the Alumni Club of the Information Software Engineering Department at GMU, as well as a founding Member of their Industrial Advisory Board. She is a member of ACM and the IEEE Computer Society. She was previously a Certified Software Test Engineer through the Quality Assurance Institute. Dr. Hayes has published over 100 articles related to topics such as software verification, validation, and testing, as well as requirements engineering and software maintenance. Education Ph.D., January 1999, Information Technology George Mason University. Fairfax, VA.Dissertation: Input Validation Testing: A System Level, Early Lifecycle TechniqueAdvisor: A. Jefferson Offutt M.S., May 1987, Computer Science University of Southern Mississippi, Hattiesburg, MS.Thesis: \"Partially Automated In-Line Documentation (PAID): Design and Implementation of a Software Maintenance Tool\"Advisor: Cliff Burgess B.A. cum laude, May 1983, Geology and Political Science (double major)Hanover College, Hanover, IN.Advisors: J. Carl Metz and Stanley Totten Curriculum Vitae from 2017 RE Cares 2020, co-located with International Conference on Requirements Engineering - a GREAT event! Check it out! RE Cares 2020 website Last Updated July 2019",
  "content_length": 2580,
  "method": "requests",
  "crawl_time": "2025-12-01 13:26:58"
}