{
  "name": "Jangwoo Kim",
  "homepage": "https://hpcs.snu.ac.kr/~jangwoo",
  "status": "success",
  "content": "Jangwoo Kim's page @ Seoul National University Jangwoo Kim CEO and Founder of MangoBoost Inc. Professor at Seoul National University Emailjangwoo /at/ snu.ac.kr LabHigh Performance Computer System Lab OfficeR902, B301 Phone+82-2-880-1868 Address  SNU, Gwanak-Gu, Seoul, Korea 08826 Biography I am currently the CEO and founder of MangoBoost Inc, and a full professor for the Department of Electrical and Computer Engineering at Seoul National University (SNU). MangoBoost is a Korea/US-based startup company which provides a next-generation server infrastruacture acceleration units (a.k.a., DPU/IPU/xPU/smart-Xdevice) driven by 10+ years of device-centric server acceleration works and various AI system acceleration works at SNU. After all, our DPU makes all commodity devices smart, while always minimizing the CPU load, and can be seamlessly deployed on the existing infrastructures. It can be easily customized/optimized for the customer applications. Before joining academia, I was a CPU/system architect at Sun Microsystems and Oracle Corporation in Silicon Valley, USA. As a CPU architect in Architecture Group, I worked on performance modeling and verification of Sun/Oracle's flagship multi-core, multi-threaded SPARC T4 CPUs. I also worked on developing highly scalable cloud computing servers that use state-of-the-art virtual machine technologies. Before joining Sun Microsystems, I earned my Ph.D. degree in Computer Engineering from Carnegie Mellon University. My advisor was Prof. Babak Falsafi and I also closely worked with Prof. James C. Hoe, Prof. Ken Mai, and Prof. Anastassia Ailamaki. At CMU, I worked mostly on defect- and fault-tolerant computer system architectures. I earned my BS degree in Electrical Engineering and M.Eng degree in Computer Science from Cornell University. Research My research lab: High Performance Computer System (HPCS) Lab My current research projects: Research Projects - CPU, Server, and Datacenter Architectures - System Modeling, Simulation, and Analysis - AI and Neuromorphic Computer Systems - Cryogenic and Quantum Computer Systems - Acceleration Systems with System SW Supports Education Ph.D. Computer Engineering Carnegie Mellon University M.Eng. Computer Science Cornell University B.S. Electrical Engineering Cornell University Employment CEO/Founder MangoBoost Inc 2022 - Current Associate/Full Professor Seoul National University (SNU) 2017 - Current Assistant/Associate Professor Pohang University of Science and Technology (POSTECH) 2010 - 2016 CPU/System Architect Sun Microsystems (later acquired by Oracle), USA 2008 - 2010 Students My students at SNU: Students Academic Service 2026: HPCA (PC), ISCA (PC) 2025: HPCA (PC), ISCA (PC), MICRO (PC), Top Picks (PC) 2024: ASPLOS (PC), HPCA (PC), ISCA (PC), MICRO (PC) 2023: ISCA (PC), MICRO (PC) 2022: ASPLOS (PC), EuroSys (PC), HPCA (PC), ISCA (ERC) 2021: EuroSys (PC), HPCA (PC), ISCA (ERC), ISPASS (PC), MICRO (PC), PACT (PC) 2020: ISCA (PC), ISPASS (PC), MICRO (PC), PACT (PC), Top Picks (PC) 2019: FPT (PC), HPCA (ERC), ISCA (ERC), ISLPED (PC), ISPASS (PC), MICRO (ERC) 2018: ASPLOS (ERC), HPC-Asia (PC), ISCA (PC), ISLPED (PC) 2017: ASPLOS (ERC), ISCA (PC), ISLPED (PC), MCSOC (PC) 2016: ICCD (PC), HPCA (PC), ISCA (PC) 2015: IISWC (PC), SC (PC) 2014: ICCD (PC), MICRO (PC), PACT (ERC) 2012: IISWC (PC) Awards ISCA Hall of Fame (2020) MICRO Hall of Fame (2019) Publications [Architecture & Cryogenic/Quantum] SuperSFQ: A Hardware Design to Realize High-Frequency Superconducting Processors Junhyuk Choi, Juwon Hong, Junpyo Kim, Jungmin Cho, Hyeonseong Jeong, Dongmoon Min, Masamitsu Tanaka, Koji Inoue, and Jangwoo Kim ACM/IEEE International Symposium on Microarchitecture (MICRO), Oct 2025 [Architecture & Cryogenic/Quantum] LANCER: Low-Overhead, Accurate, and Non-Destructive Calibration for Real-World Fault-Tolerant Quantum Applications Junpyo Kim, Jungmin Cho, Hyeonseong Jeong, Dongmoon Min, Junhyuk Choi, Juwon Hong, and Jangwoo Kim ACM/IEEE International Symposium on Microarchitecture (MICRO), Oct 2025 [Architecture & Server] MangoBoost Alice: Extremely Fast, Seamless, and Versatile FPGA-accelerated DPU Solutions Heetaek Jeong, Wonsik Lee, Eunjin Baek, Changsu Kim, Dongju Chae, Kanghyun Choi, Hamin Jang, Mohamed Elgammal, Sungmin Hong, Eriko Nurvitadhi, Dongup Kwon, and Jangwoo Kim IEEE Micro, Sep 2025 [Architecture & Server] FS2: A Fast, Scalable and Flexible Switching System for Emerging Interconnects Heetaek Jeong, Kanghyun Choi, Hamin Jang, Dongup Kwon, Eunjin Baek, Pyeongsu Park, and Jangwoo Kim IEEE Micro, May 2025 [Architecture & AI/Neuromorphic] InfiniMind: A Learning-Optimized Large-Scale Brain-Computer Interface Yeongwoo Jang, Daye Jung, Seunghyun Song, Hunjun Lee, and Jangwoo Kim ACM/IEEE International Symposium on Computer Architecture (ISCA), Jun 2025 [Architecture & Cryogenic/Quantum] SuperCore: An Ultra-Fast Superconducting Processor For Cryogenic Applications Junhyuk Choi, Ilkwon Byun, Juwon Hong, Dongmoon Min, Junpyo Kim, Jungmin Cho, Hyeonseong Jeong, Masamitsu Tanaka, Koji Inoue, and Jangwoo Kim ACM/IEEE International Symposium on Microarchitecture (MICRO), Nov 2024 [Architecture & AI/Neuromorphic] Rearchitecting a Neuromorphic Processor for Spike-Driven Brain-Computer Interfacing Hunjun Lee, Yeongwoo Jang, Daye Jung, Seunghyun Song, and Jangwoo Kim ACM/IEEE International Symposium on Microarchitecture (MICRO), Nov 2024 [Architecture & Cryogenic/Quantum] CoolDC: A Cost-Effective Immersion-Cooled Datacenter with Workload-Aware Temperature Scaling Dongmoon Min, Ilkwon Byun, Gyu-Hyeon Lee, and Jangwoo Kim ACM Transactions on Architecture and Code Optimization (TACO), May 2024 [Architecture & Cryogenic/Quantum] A Fault-Tolerant Million Qubit-Scale Distributed Quantum Computer Junpyo Kim, Dongmoon Min, Jungmin Cho, Hyeonseong Jeong, Ilkwon Byun, Junhyuk Choi, Juwon Hong, and Jangwoo Kim ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), Apr 2024 [Modeling & Datacenter] Fast, Lightweight, and Accurate Performance Evaluation using Representative Datacenter Behaviors Jaewon Lee, Dongmoon Min, Ilkwon Byun, Hanhwi Jang, and Jangwoo Kim ACM/IFIP International Middleware Conference (Middleware), Dec 2023 [Architecture & Server] F4T: A Fast and Flexible FPGA-based Full-stack TCP Acceleration Framework Junhyuk Boo, Yujin Chung, Eunjin Baek, Seongmin Na, Changsu Kim, and Jangwoo Kim ACM/IEEE International Symposium on Computer Architecture (ISCA), Jun 2023 [Modeling & Architecture & Cryogenic/Quantum] QIsim: Architecting 10+K Qubit QC Interfaces Toward Quantum Supremacy Dongmoon Min, Junpyo Kim, Junhyuk Choi, Il-Kwon Byun, Masamitsu Tanaka, Koji Inoue, and Jangwoo Kim ACM/IEEE International Symposium on Computer Architecture (ISCA), Jun 2023 [Architecture & AI/Neuromorphic] STfusion: Fast and Flexible Multi-NN Execution using Spatio-Temporal Block Fusion and Memory Management Eunjin Baek, Eunbok Lee, Taehun Kang, and Jangwoo Kim IEEE Transactions on Computers (TC), Apr 2023 [Architecture & AI/Neuromorphic] A Fast and Flexible FPGA-based Accelerator for Natural Language Processing Neural Networks Suyeon Hur, Seongmin Na, Dongup Kwon, Joonsung Kim, Jangwoo Kim, Andrew Boutros, and Eriko Nurvitadhi ACM Transactions on Architecture and Code Optimization (TACO), Feb 2023 [Architecture & AI/Neuromorphic] 3D-FPIM: An Extreme Energy-Efficient DNN Acceleration System Using 3D NAND Flash-Based In-Situ PIM Unit Hunjun Lee, Minseop Kim, Dongmoon Min, Joonsung Kim, Jongwon Back, Honam Yoo, Jongho Lee, and Jangwoo Kim ACM/IEEE International Symposium on Microarchitecture (MICRO), Oct 2022 [Modeling & Architecture & Cryogenic/Quantum] XQsim: Modeling Cross-Technology Control Processors for 10+K Qubit Quantum Computers Il-Kwon Byun, Junpyo Kim, Dongmoon Min, Ikki Nagaoka, Kosuke Fukumitsu, Iori Ishikawa, Teruo Tanimoto, Masamitsu Tanaka, Koji Inoue, and Jangwoo Kim ACM/IEEE International Symposium on Computer Architecture (ISCA), Jun 2022 [Modeling & Server] LSim: Fine-Grained Simulation Framework for Large-Scale Performance Evaluation Hamin Jang, Taehun Kang, Joonsung Kim, Jaeyong Cho, Jae-Eon Jo, Seungwook Lee, Wooseok Chang, Jangwoo Kim, and Hanhwi Jang IEEE Computer Architecture Letters (CAL), Apr 2022 [Architecture & AI/Neuromorphic] NeuroSync: A Scalable and Accurate Brain Simulation System Using Safe and Efficient Speculation Hunjun Lee, Chanmyeong Kim, Minseop Kim, Yujin Chung, and Jangwoo Kim IEEE International Symposium on High Performance Computer Architecture (HPCA), Apr 2022 [Architecture & Server] SmartFVM: A Fast, Flexible, and Scalable Hardware-based Virtualization for Commodity Storage Devices Dongup Kwon, Wonsik Lee, Dongryeong Kim, Junehyuk Boo, and Jangwoo Kim ACM Transactions on Storage (TOS), Apr 2022 [Architecture & Cryogenic] CryoWire: Wire-Driven Microarchitecture Designs for Cryogenic Computing Dongmoon Min, Yujin Chung, Ilkwon Byun, Junpyo Kim, and Jangwoo Kim ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), Feb 2022 [Architecture & AI/Neuromorphic] DLS: A Fast and Flexible Neural Network Training System with Fine-Grained Heterogeneous Device Orchestration Pyeongsu Park, Jaewon Lee, Heetaek Jeong, and Jangwoo Kim IEEE Transactions on Parallel and Distributed Systems (TPDS), Jan 2022 [Security & Architecture] UC-Check: Characterizing Micro-operation Caches in x86 Processors and Implications in Security and Performance Joonsung Kim, Hamin Jang, Hunjun Lee, Seungho Lee, and Jangwoo Kim ACM/IEEE International Symposium on Microarchitecture (MICRO), Oct 2021 [Architecture & AI/Neuromorphic] NLP-Fast: A Fast, Scalable, and Flexible System to Accelerate Large-Scale Heterogeneous NLP Models Joonsung Kim, Suyeon Hur, Eunbok Lee, Seungho Lee, and Jangwoo Kim IEEE International Conference on Parallel Architecture and Compilation Techniques (PACT), Sep 2021 [Architecture & AI/Neuromorphic] An Accurate and Fair Evaluation Methodol",
  "content_length": 25505,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:00"
}