{
  "name": "Janis Voigtländer",
  "homepage": "https://www.uni-due.de/fmi/voigtlaender",
  "status": "success",
  "content": "Fachgebietsleiter Fachgebietsleiter Prof. Dr. Janis Voigtländer Informatik / AI Anschrift Lotharstr. 65 (LF) 47057 Duisburg Raum LF 231B Telefon +49 203 379 2675 Telefax +49 203 379 3557 E-Mail janis.voigtlaender@uni-due.de Webseite https://www.uni-due.de/fmi/voigtlaender Funktionen Mitglied, Prüfungsausschuss Cyber Physical Systems (Master) Mitglied, Prüfungsausschuss Angewandte Informatik - Schwerpunkt Ingenieur- und Medieninformatik (Bachelor/Master) Universitätsprofessor/in, Formale Methoden der Informatik Vorsitzender, Promotionsausschuss Die folgenden Publikationen sind in der Online-Universitätsbibliographie der Universität Duisburg-Essen verzeichnet. Weitere Informationen finden Sie gegebenenfalls auch auf den persönlichen Webseiten der Person. Artikel in Zeitschriften Westphal, Oliver; Voigtländer, Janis Automatically testing console I/O behavior of student submissions in Haskell In: Journal of Functional Programming, Jg. 35, 2025, e18 DOI (Open Access) Grohne, Helmut; Voigtländer, Janis Formalizing semantic bidirectionalization and extensions with dependent types In: Journal of Logical and Algebraic Methods in Programming, Jg. 86, 2017, Nr. 1, S. 319 – 348 DOI Voigtländer, Janis; Hu, Zhenjiang; Matsuda, Kazutaka; Wang, Meng Enhancing semantic bidirectionalization via shape bidirectionalizer plug-ins In: Journal of Functional Programming, Jg. 23, 2013, Nr. 5, S. 515 – 551 DOI Seidel, Daniel; Voigtländer, Janis Refined typing to localize the impact of forced strictness on free theorems In: Acta Informatica, Jg. 48, 2011, Nr. 3, S. 191 – 211 DOI Johann, Patricia; Voigtländer, Janis A family of syntactic logical relations for the semantics of Haskell-like languages In: Information and Computation, Jg. 207, 2009, Nr. 2, S. 341 – 368 DOI (Open Access) Giesl, Jürgen; Kühnemann, Armin; Voigtländer, Janis Deaccumulation techniques for improving provability In: The Journal of Logic and Algebraic Programming, Jg. 71, 2007, Nr. 2, S. 79 – 113 DOI (Open Access) Voigtländer, Janis Formal efficiency analysis for tree transducer composition In: Theory of Computing Systems, Jg. 41, 2007, Nr. 4, S. 619 – 689 DOI Voigtländer, Janis; Johann, Patricia Selective strictness and parametricity in structural operational semantics, inequationally In: Theoretical Computer Science, Jg. 388, 2007, Nr. 1-3, S. 290 – 318 DOI (Open Access) Johann, Patricia; Voigtländer, Janis The Impact of seq on Free Theorems-Based Program Transformations In: Fundamenta Informaticae, Jg. 69, 2006, Nr. 1-2, S. 63 – 102 Online Volltext Voigtländer, Janis; Kühnemann, Armin Composition of functions with accumulating parameters In: Journal of Functional Programming, Jg. 14, 2004, Nr. 3, S. 317 – 363 DOI Voigtländer, Janis Using circular programs to deforest in accumulating parameters In: Higher-Order and Symbolic Computation, Jg. 17, 2004, Nr. 1-2, S. 129 – 163 DOI Vorworte / Nachworte Knoop, Jens; Voigtländer, Janis Vorwort zur 6. Arbeitstagung Programmiersprachen (ATPS 2013) In: Software Engineering 2013 Workshopband (inkl. Doktorandensymposium): Fachtagung des GI-Fachbereichs Softwaretechnik 26.02. - 01.03.2013 in Aachen / 6. Arbeitstagung Programmiersprachen (ATPS 2013), 26.02.-01.03.2013, Aachen / Wagner, Stefan; Lichter, Horst (Hrsg.). Bonn: Gesellschaft für Informatik, 2013, S. 17 – 20 Online Volltext (Open Access) Huch, Frank; Voigtländer, Janis 5. Arbeitstagung Programmiersprachen (ATPS 2012) In: Software Engineering 2012 / 5. Arbeitstagung Programmiersprachen (ATPS 2012), 27. Februar - 2. März 2012, Berlin / Jähnichen, Stefan; Küpper, Axel; Albayrak, Sahin (Hrsg.). Bonn: Gesellschaft für Informatik, 2012, S. 15 – 16 Online Volltext (Open Access) Hermann, Frank; Voigtländer, Janis First International Workshop on Bidirectional Transformations (BX 2012) : Preface First International Workshop on Bidirectional Transformations (BX 2012), 25th March 2012, Tallin, Estonia, In: Electronic Communications of the EASST. Berlin: European Association of Software Science and Technology (EASST), Jg. 49, Bidirectional Transformations 2012, 2012 DOI (Open Access) Gallagher, John P.; Voigtländer, Janis Editorial In: Higher-Order and Symbolic Computation / Dordrecht [u.a.]: Springer Science + Business Media B.V., Jg. 23, 2010, Nr. 3, S. 273 – 274 DOI Beiträge in Sammelwerken und Tagungsbänden Ritzenfeld, Patrick; Voigtländer, Janis Extensional and Intensional Checking of Student Programs in a Graphical Domain In: Proceedings Seventh Workshop \"Automatische Bewertung von Programmieraufgaben\" (ABP 2025) / 7. Workshop \"Automatische Bewertung von Programmieraufgaben\", 1.–2. Oktober 2025, Berlin / Greubel, André; Strickroth, Sven; Striewe, Michael (Hrsg.). Bonn: Gesellschaft für Informatik e.V., 2025, S. 75 – 83 DOI (Open Access) Siegburg, Marcellus; Voigtländer, Janis Variation von Aufgabenstellungen zu Modellierung in der Informatik In: Prüfungen digital gestalten: Technische und didaktische Konzepte für die Hochschullehre / Auferkorte-Michaelis, Nicole; Bonnes, Maiken; Hintze, Patrick; Liebscher, Julia (Hrsg.). Leverkusen: Verlag Barbara Budrich, 2025, S. 189 – 198 DOI (Open Access) Brocker, Annabell; Garmann, Robert; Strickroth, Sven; Striewe, Michael; Voigtländer, Janis Eine Taxonomie zur Variabilisierung von Programmieraufgaben In: Workshopband der 22. Fachtagung Bildungstechnologien (DELFI): 09.–11. September 2024, Fulda, Deutschland / 22. Fachtagung Bildungstechnologien der Gesellschaft für Informatik e.V, DELFI 2024, 09.09.–11.09.2024, Fulda, Germany / Kiesler, Natalie; Schulz, Sandra (Hrsg.). Bonn: Gesellschaft für Informatik e.V, 2024 DOI (Open Access) Koth, Leon; Voigtländer, Janis Parametrisierung von Haskell-Programmieraufgaben In: Proceedings of the 6th Workshop \"Automatische Bewertung von Programmieraufgaben\" (ABP 2023) / 6. Workshop \"Automatische Bewertung von Programmieraufgaben\", 12.–13. Oktober 2023, München / Greubel, André; Strickroth, Sven; Striewe, Michael (Hrsg.). Bonn: Gesellschaft für Informatik e.V., 2023, S. 51 – 58 DOI, Online Volltext (Open Access) Brandt, André; Siegburg, Marcellus; Voigtländer, Janis; Wang, Ke A Report on Automatic Generation of Petri Net Exercise and Exam Task Instances In: Modellierung 2022 Satellite Events / Workshop zur Modellierung in der Hochschullehre (MoHoL), Juni 2022, Hamburg / Michael, Judith; Pfeiffer, Jérôme; Wortmann, Andreas (Hrsg.). Bonn: Gesellschaft für Informatik e.V., 2022, S. 197 – 204 DOI, Online Volltext (Open Access) Westphal, Oliver; Voigtländer, Janis Describing Console I/O Behavior for Testing Student Submissions in Haskell TFPIE 2019 - Trends in Functional Programming in Education, 11. June 2019, Vancouver, Canada, In: Proceedings Eighth and Ninth International Workshop on Trends in Functional Programming in Education / Hage, Jurriaan (Hrsg.), 2020, S. 19 – 36 DOI (Open Access) Kafa, Violet; Siegburg, Marcellus; Voigtländer, Janis Exercise Task Generation for UML Class/Object Diagrams, via Alloy Model Instance Finding In: ICT Education: Revised Selected Papers / 48th Annual Conference of the Southern African Computer Lecturers’ Association, SACLA 2019, Northern Drakensberg, South Africa, July 15–17, 2019 / Tait, Bobby; Kroeze, Jan; Gruner, Stefan (Hrsg.). Cham: Springer, 2020, S. 112 – 128 DOI Voigtländer, Janis Free Theorems Simply, via Dinaturality In: Declarative Programming and Knowledge Management / Conference on Declarative Programming, DECLARE 2019, Unifying INAP, WLP, and WFLP, Cottbus, Germany, September 9–12, 2019 / Hofstedt, Petra; Abreu, Salvador; John, Ulrich; Kuchen, Herbert; Seipel, Dietmar (Hrsg.). Cham: Springer, 2020, S. 247 – 267 DOI, Online Volltext (Open Access) Siegburg, Marcellus; Voigtländer, Janis Generating diverse exercise tasks on UML class and object diagrams, using formalisations in Alloy In: Joint Proceedings of Modellierung 2020 Short, Workshop and Tools & Demo Papers / Modellierung 2020, 19.-21.02.2020, Wien / Michael, Judith; Bork, Dominik; Rehse, Jana-Rebecca; Striewe, Michael; Ullrich, Meike (Hrsg.). Aachen: RWTH Aachen, 2020, S. 89 – 100 Online Volltext (Open Access) Westphal, Oliver; Voigtländer, Janis Implementing, and Keeping in Check, a DSL Used in E-Learning In: Functional and Logic Programming: Proceedings / 15th International Symposium, FLOPS 2020, Akita, Japan, September 14–16, 2020 / Nakano, Keisuke; Sagonas, Konstantinos (Hrsg.). Cham: Springer, 2020, S. 179 – 197 DOI Siegburg, Marcellus; Voigtländer, Janis; Westphal, Oliver Automatische Bewertung von Haskell-Programmieraufgaben In: Proceedings of the Fourth Workshop \"Automatische Bewertung von Programmieraufgaben\" (ABP 2019), Essen, Germany, October 8-9, 2019 / Fourth Workshop \"Automatische Bewertung von Programmieraufgaben\" (ABP 2019), 08.-09.10. 2019, Essen / Strickroth, Sven; Striewe, Michael; Rod, Oliver (Hrsg.): GI, 2019, S. 19 – 26 DOI (Open Access) Gödderz, Tobias; Voigtländer, Janis Automatic testing of operation invariance In: (Constraint) Logic Programming and Functional and (Constraint) Logic Programming: Proceedings of the 28th Workshop on (Constraint) Logic Programming (WLP 2014) ; Proceedings of the 23rd International Workshop on Functional and (Constraint) Logic Programming / 23rd International Workshop on Functional and (Constraint) Logic Programming (WFLP 2014), 15-17 September 2014, Wittenberg, Germany / Brass, Stefan; Waldmann, Johannes (Hrsg.). Aachen: RWTH Aachen, 2015, S. 172 – 186 Online Volltext (Open Access) Grohne, Helmut; Löh, Andres; Voigtländer, Janis Formalizing Semantic Bidirectionalization with Dependent Types In: EDBT/ICDT 2014 Workshops: Proceedings of the Workshops of the EDBT/ICDT 2014 Joint Conference (EDBT/ICDT 2014) / Workshops of the EDBT/ICDT 2014 Joint Conference (EDBT/ICDT 2014), 28. March 2014, Athens, Greece. Aachen: RWTH Aachen, 2014, S. 75 – 81 Online Volltext (Open Access) Mehner, Stefan; Seidel, Daniel; Straßburger, Lutz; Voigtländer, Janis Parametricity and proving free theorems for functional-logic languages In: PPDP 2014 - Proceedings of the 1",
  "content_length": 20124,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:02"
}