{
  "name": "Janno Siim",
  "homepage": "https://sites.google.com/view/jannosiim",
  "status": "success",
  "content": "Janno SiimSearch this siteEmbedded FilesSkip to main contentSkip to navigationJanno SiimRoom 3073 in Delta,University of TartuTartu, EstoniaAbout MeI am a lecturer and researcher in cryptography at the University of Tartu and part of the Tartu cryptography research group. My main research interests are: Zero-knowledge proofs and SNARKs.The design of advanced cryptographic protocolsProvable security (especially in idealized security models).I have around 20 publications on the abovementioned topics, which have received over 600 citations.I obtained a PhD at the University of Tartu under the supervision of Helger Lipmaa. Previously, I was also a postdoctoral researcher at the University of Edinburgh under the supervision of Markulf Kohlweiss and a postdoctoral researcher at Simula UiB in Norway.Please send me an email to get in touch (jannosiim@gmail.com).  I am always interested in discussing new research ideas. NewsOur paper with Maiara Bollauf and Roberto Parisella was accepted to CiC https://eprint.iacr.org/2025/1079 (21.06.25)Our paper (with Helger Lipmaa and Roberto Parisella) was accepted to CRYPTO 2025. eprint.iacr.org/2024/994 (12.05.2025)I received the Young IT Researcher Award from the president of Estonia! president.ee/et/meediakajastus/pressiteated/57223 (17.04.2025) 1 PhD and 1 Postdoc position available in our SNARK/ZK group in Tartu: https://crypto.cs.ut.ee/Main/OpenPositions. Come and join us! (28.03.2025) I started as a lecturer at the University of Tartu! (03.02.2025)Zero-Knowledge Proofs Zero-knowledge proofs are my main research interest. Imagine the common scenario where a party has some public data x, private data w, and needs to convince others that the output y = P (x, w) of a computer program P was indeed computed correctly. For instance, in the Estonian e-voting protocol, the voting server wants to convince auditors that the tally (y) is correctly computed based on the encrypted votes (x) without revealing the private votes (w). Zero-knowledge proof is a tool that allows one to show that y is correct without revealing anything else (zero-knowledge) about w.SNARKs are particularly efficient (zero-knowledge) proofs that allow verifying the correctness of y much faster than running P. Because of their incredible speed, SNARKs have enabled applications where privacy doesn't necessarily even matter (verifiable outsourced computation, accelerating blockchains, correctness of machine learning inference, etc.).Here are a few links for further reading:Quanta magazine: How Do You Prove a Secret? (for newbies)Zero Knowledge Proofs: An illustrated primer (gentle intro by Matthew Green) Zero-knowledge rollups (application in blockchain)ZKP MOOC (best video series)Proofs, Arguments, and Zero-Knowledge (comprehensive book by Justin Thaler)StudentsCurrent students:Pritam Pal (PhD student)Sten-Egert Märtson (bachelor's student)Prior students:Shahla Atapoor (master's student. Subsequently obtained a PhD in KU Leuven)Marek Pagel (bachelor's student)Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3082,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:01"
}