{
  "name": "Janyce Wiebe",
  "homepage": "https://people.cs.pitt.edu/~wiebe",
  "status": "success",
  "content": "Janyce Wiebe/Jan Wiebe Jan Wiebe Professor, Department of Computer Science and Intelligent Systems Program University of Pittsburgh Research Interests My research areas are artificial intelligence and natural language processing (NLP). My research with students and colleagues has been in discourse processing, pragmatics, and word-sense disambiguation. A major concentration of our research is \"subjectivity analysis\", recognizing and interpreting expressions of opinions and sentiments in text, to support NLP applications such as question answering, information extraction, text categorization, and summarization. Publications, Corpora, Software, and Bibliography Click here for publications Bibliography of work in subjectivity and sentiment analysis: .bib file Click HERE for downloadable resources, including the MPQA opinion annotated corpus, OpinionFinder system, subjectivity lexicon, including prior polarity/sentiment annotations, and subjectivity sense annotations Current Teaching On Medical Leave, since Nov 2015. Current Projects Interactive Search and Review of Clinical Records with Multi-layered Semantic Annotations; with Wendy Chapman, Harry Hockheiser, and Rebecca Hwa; funded by the National Library of Medicine. Uncovering Motivations, Stances and Anomalies Through Private-State Recognition and Interpretation; with Claire Cardie and Rada Mihalcea; funded by the DARPA DEFT program. Recent Activities On medical leave, from November 2015. Presented a tutorial at ACL 2015 with Owen Rambow on Belief and Sentiment. The slides and bibliography are available here. Keynote Speaker, Canadian AI Conference. The slides are available here. Action Editor, Transactions of the ACL, 2012-2015. Member, Dietrich School, and University of Pittsburgh Senate, Nominating Committees, 2015-2015. Judge for the Intel International Science and Engineering Fair, May 2015 Area Co-Chair: EMNLP 2013 (Opinion Sentiment Analysis and Opinion Mining); ACL 2012 (Social Media and Sentiment Analysis). Pitt's 255 Anniversary: Science and Technology Highlights of the Intelligent Systems Program Presented a tutorial at ACL 2012: Rada Mihalcea, Carmen Banea, Janyce Wiebe. Multilingual Subjectivity and Sentiment Analysis Recent/Upcoming Invited Talks: Keynote, 2015 Canadian Artificial Intelligence conference , Halifax, Nova Scotia, Canada, June 2015. Invited speaker, Konvens2014 , Hildesheim, Germany, October 2014. UC Santa Cruz, November 2014. Workshop on Computational Approaches to Subjectivity and Sentiment Analysis (WASSA) ACL, South Korea, July 2012 Keynote, Sentiment Analysis Symposium , NYC, May 2012 IBM Watson Research Lab, Hawthorne, NY, May 2012 Department of Computer Science, University of Memphis, April 2012 UMIACS, University of Maryland, February 2012 Interesting Links Richard A. Wiebe New York State Senate Public Service Fellowship. Scroll down to \"Memorial Fellowships\" and click on one of the PDFs. This is a memorial fellowship honoring my father's service to the New York State Senate; my parents are doing well, living in the Austin, Texas area. Pittsburgh Technology Council Career Center -- look for Computer Science jobs in Pittsburgh SentimentAI Yahoo! group Historic Pittsburgh Image Collections Historical Pittsburgh Interactive Map Contact Information Jan Wiebe Department of Computer Science Sennott Square Building, Room 5409 210 S. Bouquet St. Pittsburgh, PA 15260, U.S.A. phone: +1 (412) 624-9590 fax: +1 (412) 624-8854 email: wiebe at cs.pitt.edu Directions: Sennott Square is on the southwest corner of Forbes and S. Bouquet. To find my office: take the elevator to the 5th floor; face the display on the wall and go through the door on your left; turn right, continue to the end of the hall, and turn left.",
  "content_length": 3751,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:07"
}