{
  "name": "Jari Korhonen",
  "homepage": "https://www.abdn.ac.uk/people/jari.korhonen",
  "status": "success",
  "content": "Dr Jari Korhonen | The University of Aberdeen Dr Jari Korhonen Dr Jari KorhonenSenior Lecturer Accepting PhDs About Email Addressjari.korhonen@abdn.ac.ukOffice Address 328 Meston BuildingOld Aberdeen CampusMeston Walk AB24 3UEView on Map School/DepartmentSchool of Natural and Computing Sciences Google ScholarPureORCiD Biography I am an experienced researcher in computer science, specialised in multimedia technologies and Quality of Experience (QoE) in particular. I received my MSc degree in information engineering at University of Oulu, Finland, in 2001, and PhD in telecommunications and signal processing at Tampere University of Technology, Finland, in 2006. In my early career, I worked as a Research Engineer at Nokia Research Center, Tampere, Finland, from 2001 to 2006, before moving to academia. Before joining the University of Aberdeen, I was working at Shenzhen University, China, from 2017 to 2022. My past research experience covers both telecommunications and signal processing aspects of multimedia communications. My current research focus primarily on visual quality assessment, and I have contributed to several models for predicting perceived image and video quality directly from the signal. As a part of this work, I have been principal investigator (PI) for a project funded by National Natural Science Foundation of China (NSFC) from 2018 to 2021. Most recently, I have studied deep learning techniques applied to visual quality assessment, as well as other related computer vision problems. In addition to my research work, I have experience of teaching several courses in the fields of visual communications, signal processing, and telecommunications. I have also supervised and co-supervised several student projects at BSc, MSc and PhD levels. Qualifications PhD Telecommunications and Signal Processing 2006 - Tampere University of Technology, Finland MSc Information Engineering 2001 - University of Oulu, Finland External Memberships IEEE Member Latest Publications COPP-Net: No-Reference Point Cloud Quality Assessment via Weighted Patch Quality Prediction 2025 - E-pub ahead of printZhu, L., Cheng, J., Wang, X., Su, H., Yuan, H., Song, J., Korhonen, J. IEEE Transactions on BroadcastingContributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/TBC.2025.3597096[ONLINE] View publication in ScopusNERO: Explainable Out-of-Distribution Detection with Neuron-level Relevance in Gastrointestinal Imaging 2025 - Accepted/In pressChhetri, A., Korhonen, J., Gyawali, P. K., Bhattarai, B. Contributions to Conferences: Papers[ONLINE] DOI: https://doi.org/10.48550/arXiv.2506.15404[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/14793565-22c1-4fc8-9929-c1aefbc54efa/download[ONLINE] Conference home page3DTA: No-Reference 3D Point Cloud Quality Assessment with Twin Attention 2024 - PublishedZhu, L., Cheng, J., Wang, X., Su, H., Yang, H., Yuan, H., Korhonen, J. IEEE Transactions on Multimedia, vol. 26, pp. 10489 - 10502Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/TMM.2024.3407698[ONLINE] View publication in ScopusGated Transformer Representing Region Importance for Image Quality Assessment 2024 - PublishedYou, J., Lin, Y., Korhonen, J. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1109/IJCNN60899.2024.10650165[ONLINE] View publication in ScopusFishIR: Identifying Pufferfish Individual based on Deep Learning and Face Recognition 2024 - PublishedLin, Y., Xie, S., Ghose, D., Liu, X., You, J., Korhonen, J., Liu, J., Dash, S. P. IEEE Access, vol. 12, pp. 59807 - 59817Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/ACCESS.2024.3390412[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/74ef474b-db00-401e-ad2c-3c2322b28c04/download[ONLINE] View publication in Scopus View My Publications Research Research Areas Accepting PhDs I am currently accepting PhDs in Computing Science. Please get in touch if you would like to discuss your research ideas further. Email Me Computing Science Accepting PhDsView Research Area Research Specialisms Artificial IntelligenceComputer VisionMultimedia Computing Science Our research specialisms are based on the Higher Education Classification of Subjects (HECoS) which is HESA open data, published under the Creative Commons Attribution 4.0 International licence. Blind Image and Video Quality Assessment Jari Korhonen has several years of experience of working on automated prediction of image and video quality, with focus on blind models for user generated photos and videos. Several models based on his work, such as Two-Level Video Quality Model (TLVQM), are publicly available. Source code in GitHub Funding and Grants National Natural Science Foundation of China (NSFC) Grant 61772348: \"Quality assessment for consumer video applications,\" 2018-21 (Shenzhen University). Teaching Teaching Responsibilities I am currently course co-ordinator for the following SCNU Joint Institute BSc courses: JC2503 Web Application Development JC4001 Distributed Systems JC4004 Computational Intelligence I also supervise coursework projects for the following SCNU Joint Institute BSc courses: JC2001 Introduction to Software Engineering JC3506 Software Design and Implementation In addition, I supervise BSc thesis projects and I am course co-ordinator for the CS programme in JC4000 Graduation Thesis. Publications Page 1 of 10 Results 1 to 10 of 97 COPP-Net: No-Reference Point Cloud Quality Assessment via Weighted Patch Quality Prediction 2025 - E-pub ahead of printZhu, L., Cheng, J., Wang, X., Su, H., Yuan, H., Song, J., Korhonen, J. IEEE Transactions on BroadcastingContributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/TBC.2025.3597096[ONLINE] View publication in ScopusNERO: Explainable Out-of-Distribution Detection with Neuron-level Relevance in Gastrointestinal Imaging 2025 - Accepted/In pressChhetri, A., Korhonen, J., Gyawali, P. K., Bhattarai, B. Contributions to Conferences: Papers[ONLINE] DOI: https://doi.org/10.48550/arXiv.2506.15404[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/14793565-22c1-4fc8-9929-c1aefbc54efa/download[ONLINE] Conference home page3DTA: No-Reference 3D Point Cloud Quality Assessment with Twin Attention 2024 - PublishedZhu, L., Cheng, J., Wang, X., Su, H., Yang, H., Yuan, H., Korhonen, J. IEEE Transactions on Multimedia, vol. 26, pp. 10489 - 10502Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/TMM.2024.3407698[ONLINE] View publication in ScopusGated Transformer Representing Region Importance for Image Quality Assessment 2024 - PublishedYou, J., Lin, Y., Korhonen, J. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1109/IJCNN60899.2024.10650165[ONLINE] View publication in ScopusFishIR: Identifying Pufferfish Individual based on Deep Learning and Face Recognition 2024 - PublishedLin, Y., Xie, S., Ghose, D., Liu, X., You, J., Korhonen, J., Liu, J., Dash, S. P. IEEE Access, vol. 12, pp. 59807 - 59817Contributions to Journals: Articles[ONLINE] DOI: https://doi.org/10.1109/ACCESS.2024.3390412[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/74ef474b-db00-401e-ad2c-3c2322b28c04/download[ONLINE] View publication in ScopusOn the Explainable Detection of Stress Levels Using Heart Rate Variability Based Deep Neural Networks 2024 - PublishedLin, Y., Ghose, D., Korhonen, J., You, J., Dash, S. P. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1109/Healthcom56612.2023.10472396[ONLINE] View publication in ScopusHigh Resolution Image Quality Database 2024 - PublishedHuang, H., Wan, Q., Korhonen, J. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1109/ICASSP48485.2024.10446520[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/1f0a565d-7148-4dde-99b1-bb818d1479b0/download[ONLINE] View publication in ScopusHigh Resolution Image Quality Database 2024 - PublishedHuang, H., Wan, Q., Korhonen, J. Working Papers: Preprint Papers[ONLINE] DOI: https://doi.org/10.48550/arXiv.2401.16087[OPEN ACCESS] http://aura.abdn.ac.uk/bitstreams/f65624f1-1749-4514-b3a9-15dcd95d67d2/downloadHalf of an image is enough for quality assessment 2023 - PublishedYou, J., Lin, Y., Korhonen, J. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.1109/ICIP49359.2023.10223124No-Reference Point Cloud Quality Assessment via Weighted Patch Quality Prediction 2023 - PublishedCheng, J., Su, H., Korhonen, J. Chapters in Books, Reports and Conference Proceedings: Conference Proceedings[ONLINE] DOI: https://doi.org/10.18293/SEKE2023-185[ONLINE] View publication in Scopus Show 10 | 25 | 50 | 100 results per page Refine Chapters in Books, Reports and Conference Proceedings Chapters (4) Conference Proceedings (67) Contributions to Conferences Papers (1) Contributions to Journals Articles (19) Conference Articles (3) Working Papers Preprint Papers (3) Update",
  "content_length": 9066,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:24"
}