{
  "name": "Jasmin Christian Blanchette",
  "homepage": "https://www.tcs.ifi.lmu.de/mitarbeiter/jasmin-blanchette_de.html",
  "status": "success",
  "content": "Jasmin Blanchette | TCS| Bio | News | Teaching | Team | Publications | Formal Proofs | Software | Activities | Media | Contact |Prof. Dr. Jasmin BlanchetteI am a professor of Theoretical Computer Science and Theorem Proving at Ludwig-Maximilians-Universität München, where I serve as the Dean of Studies for Computer Science. I am also a guest researcher in the VeriDis group at Loria in Nancy. Theorem proving plays a central role in formal methods and, more generally, in theoretical computer science. With my research, I aim at strengthening proof automation for general-purpose logics and making proof assistants more cost-effective to use. A hallmark of my research is the combination of automatic and interactive methods—of human and artificial intelligence. I envision a future in which automatic theorem provers and proof assistants will be routinely used for critical computing infrastructure, for programming language design, and more broadly for research in computer science and mathematics, thereby leading to more trustworthy systems and science.Specifically, my research focuses on the development and use of automatic theorem provers and model finders to find proofs and counterexamples in higher-order logic (with tools such as Sledgehammer and Nitpick and projects such as Matryoshka and Nekoka). I am also interested in formalizing classic results and modern research in automated reasoning (IsaFoL) and number theory (Lean Forward). Finally, I develop foundational definitional mechanisms for (co)datatypes and (co)recursive functions.NewsMartin Desharnais-Schäfer successfully defended his PhD thesis. Congratulations!Anne Baanen successfully defended their PhD thesis and was awarded the rare (Dutch) cum laude distinction. Congratulations!Since 22 January 2024, I serve as the Dean of Studies (Studiendekan) of the Institute for Informatics.Visa Nummelin, Sander Dahmen, and I won one of the two FroCoS 2023 best paper awards.Qi Qiu, Sophie Tourret, and I won the CADE 2023 best paper award for \"Verified given clause procedures\".Petar Vukmirović won the IPA dissertation award for his PhD thesis. Congratulations!TeachingSee my chair's teaching page for teaching since April 2023MSc course Logical Verification at Vrije Universiteit Amsterdam:2022–2023 (period 2), 2021–2022 (period 2), 2020–2021 (period 2), 2019–2020 (period 2), 2018–2019 (period 2), 2016–2017 (period 5)BSc course Logic and Modelling at Vrije Universiteit Amsterdam:2021–2022 (period 5), 2020–2021 (period 5; main lecturer: Robert Y. Lewis)BSc course Concrete Semantics with Isabelle/HOL at Universität des Saarlandes:2014–2015 (summer)TeamAt Ludwig-Maximilians-Universität MünchenMartin Desharnais-Schäfer (postdoc, automation of and formalization in Isabelle)Michael Kirsten (postdoc, formalization of voting systems)Yiming Xu (postdoc, formalization and application of categorical logic)Tanguy Bozec (PhD student, program verification with superposition)Xavier Généreux (PhD student, heuristics for higher-order proof search)Alexandra Graß (PhD student, verification of cyberphyical systems)Massin Guerdi (PhD student, higher-order superposition)Lydia Kondylidou (PhD student, higher-order SMT)Elisabeth Lempa (PhD student, proofs with holes)Luca Maio (PhD student, superposition for dependent type theory)Balazs Toth (PhD student, formalization of superposition prover)At Other InstitutesMartin Dvorak (PhD student, formalization of Chomsky hierarchy in Lean; cosupervisor: Vladimir Kolmogorov)Vincent Fischer (PhD student, TBD; cosupervisor: Javier Esparza)Visa Nummelin (PhD student, reasoning about Booleans and recurrences; cosupervisor: Sander Dahmen)Past MembersAnne Baanen (PhD student, formalization of number theory; cosupervisor: Sander Dahmen)Alexander Bentkamp (PhD student and postdoc, higher-order superposition)Simon Cruanes (senior software engineer, counterexample generation)Rosalie Defourné (PhD student, hammer for TLAPS; cosupervisors: Stephan Merz, Pascal Fontaine)Martin Desharnais-Schäfer (PhD student, formalization of logic; cosupervisors: Christoph Weidenbach, Martin Bromberger, Sophie Tourret)Gabriel Ebner (postdoc, Lean development and clause splitting)Daniel El Ouraoui (PhD student, higher-order SMT; cosupervisors: Stephan Merz, Pascal Fontaine)Michael Färber (postdoc, nonclausal theorem proving and connection calculus)Mathias Fleury (PhD student, formalization of inference systems; cosupervisor: Christoph Weidenbach)Johannes Hölzl (postdoc, formalization of mathematics)Robert Y. Lewis (postdoc, tool support for formalizing mathematics)Jannis Limperg (PhD student, general-purpose proof automation for Lean)Anders Schlichtkrull (PhD student, formalization of logical calculi; cosupervisors: Jørgen Villadsen, Thomas Bolander)Hans-Jörg Schurr (PhD student, higher-order SMT; cosupervisors: Stephan Merz, Pascal Fontaine)Petar Vukmirović (PhD student, implementation of higher-order superposition; cosupervisors: Wan Fokkink, Stephan Schulz)Daniel Wand (PhD student, extensions of superposition; cosupervisor: Christoph Weidenbach)Publications2025Huffman's algorithm. Jasmin Blanchette. In Nipkow, T., Functional Data Structures and Algorithms: A Proof Assistant Approach, 2025. Publisher's page ⋅ Editor's PDFIterative monomorphisation. Tanguy Bozec and Jasmin Blanchette. FroCoS 2025. Authors' PDFSledgehammering without ATPs. Martin Desharnais and Jasmin Blanchette. ITP 2025. Publisher's page ⋅ Authors' PDFExploiting instantiations from paramodulation proofs in Isabelle/HOL. Lukas Bartl, Jasmin Blanchette, and Tobias Nipkow. CADE-30. Authors' PDFAugmenting model-based instantiation with fast enumeration. Lydia Kondylidou, Andrew Reynolds, and Jasmin Blanchette. TACAS 2025. Authors' PDFThe Hitchhiker's Guide to Logical Verification. Anne Baanen, Alexander Bentkamp, Jasmin Blanchette, Xavier Généreux, Jannis Limperg, and Johannes Hölzl. 2025. PDF (desktop) ⋅ PDF (tablet)2024A modular formalization of superposition in Isabelle/HOL. Martin Desharnais, Balazs Toth, Uwe Waldmann, Jasmin Blanchette, and Sophie Tourret. In Bertot, Y., Kutsia, T., Norrish. M. (eds), 15th International Conference on Interactive Theorem Proving (ITP 2024), LIPIcs 309, pages 12:1-12:20, Schloss Dagstuhl—Leibniz-Zentrum für Informatik, 2024. Publisher's page ⋅ Authors' PDF2023Complete and efficient higher-order reasoning via lambda-superposition. Alexander Bentkamp, Jasmin Blanchette, Visa Nummelin, Sophie Tourret, and Uwe Waldmann. ACM SIGLOG News10(4): 25-40, 2023. Publishers' page ⋅ Authors' PDFRecurrence-driven summations in automated deduction. Visa Nummelin, Jasmin Blanchette, and Sander R. Dahmen. In Sattler, U., Suda, M. (eds.), 14th International Symposium on Frontiers of Combining Systems (FroCoS 2023), LNCS 14279, pp. 23–40, Springer, 2023. Publisher's page ⋅ Authors' PDF ⋅ Report (PDF)λ-Superposition: From theory to trophy. Jasmin Blanchette. In Pientka, B., Tinelli, C. (eds.), 29th International Conference on Automated Deduction (CADE-29), LNCS 14132, pp. xiii–xvi, Springer, 2023. Publisher's PDF ⋅ Author's PDFVerified given clause procedures. Jasmin Blanchette, Qi Qiu, and Sophie Tourret. In Pientka, B., Tinelli, C. (eds.), 29th International Conference on Automated Deduction (CADE-29), LNCS 14132, pp. 61–77, Springer, 2023. Publisher's page ⋅ Authors' PDFClosure properties of general grammars—formally verified Martin Dvorak and Jasmin Blanchette. In Naumowicz, A., Thiemann, R. (eds.), 14th International Conference on Interactive Theorem Proving (ITP 2023), LIPIcs 268, pages 11:1-11:16, Schloss Dagstuhl—Leibniz-Zentrum für Informatik, 2023. Publisher's page ⋅ Authors' PDFFinding mathematical proofs using computers. Alexander Bentkamp and Jasmin Blanchette. Nieuw Archief voor Wiskunde 5/24(2): 114–118, 2023. Publisher's PDF ⋅ Authors' PDFWorkshop Papers at 14th Conference on Intelligent Computer Mathematics (CICM 2021). Jasmin Blanchette, James Davenport, Peter Koepke, Andrea Kohlhase, Michael Kohlhase, Adam Naumowicz, Dennis Müller, Yasmine Sharoda, and Claudio Sacerdoti Coen (eds.). CEUR-WS 3377, 2023. Publisher's pageSAT-inspired higher-order eliminations. Jasmin Blanchette and Petar Vukmirović. Logical Methods in Computer Science19(2), 2023. Publisher's page ⋅ Authors' PDFSAT-inspired eliminations for superposition. Petar Vukmirović, Jasmin Blanchette, and Marijn J.H. Heule. Transactions on Computational Logic24(1): article 7, 2023. Publisher's page ⋅ Authors' PDFUnifying splitting. Gabriel Ebner, Jasmin Blanchette, and Sophie Tourret. Journal of Automated Reasoning67, article number 16, 2023. Publisher's page ⋅ Authors' PDFMechanical mathematicians. Alexander Bentkamp, Jasmin Blanchette, Visa Nummelin, Sophie Tourret, Petar Vukmirović, and Uwe Waldmann. Communications of the ACM66(4): 80–90, 2023. Publisher's page ⋅ Authors' PDFSuperposition for higher-order logic. Alexander Bentkamp, Jasmin Blanchette, Sophie Tourret, and Petar Vukmirović. Journal of Automated Reasoning67, article number 10, 2023. Publisher's page ⋅ Authors' PDF ⋅ Errata (PDF)Extending a high-performance prover to higher-order logic. Petar Vukmirović, Jasmin Blanchette, and Stephan Schulz. 29th International Conference on Tools and Algorithms for the Construction and Analysis of Systems (TACAS 2023), LNCS 13994, pp. 111–129, Springer, 2023. Publisher's page ⋅ Authors' PDF2022A comprehensive framework for saturation theorem proving. Uwe Waldmann, Sophie Tourret, Simon Robillard, and Jasmin Blanchette. Journal of Automated Reasoning66(4): 499–539, 2022. Publisher's page ⋅ Authors' PDFMaking higher-order superposition work. Petar Vukmirović, Alexander Bentkamp, Jasmin Blanchette, Simon Cruanes, Visa Nummelin, and Sophie Tourret. Journal of Automated Reasoning66(4): 541–564, 2022. Publisher's page ⋅ Authors' PDF11th International Joint Conference on Automated Reasoning (IJCAR 2022). Jasmin Blanchette, Laura Kovács, and Dirk Pattinson (eds.). LNCS 13385, Springer, 2022. Publisher's pageSeventeen provers under the hammer.",
  "content_length": 43098,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:45"
}