{
  "name": "Jason A. D. Atkin",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/jason.atkin",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Jason AtkinAssociate Professor, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsLink to my web pagePublications Contact workRoom C83 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKjason.atkin@nottingham.ac.ukhttp://www.cs.nott.ac.uk/~pszja BiographyHaving graduated with a BSc Hons in 'Mathematics with Computing', followed by successfully completing a PGCE to teach Secondary School Maths and IT, I worked for around 10 years in industry, as a software engineer, team leader and software consultant, before doing a PhD in Computer Science at the University of Nottingham. Following my PhD I spent about four years as a researcher, working on airport optimisation problems, before obtaining an academic position in the School of Computer Science. I am currently an Associate Professor in the same School at Nottingham. My current research involves ongoing airport and airspace modelling and optimisation work, as well as More Electric Aircraft power flow and supervisory controller optimisation work, particularly in the area of automated and optimised system and controller design.Recent Publications PINHEIRO, RODRIGO LANKAITES, LANDA-SILVA, DARIO and ATKIN, JASON, 2017. A Technique Based on Trade-off Maps to Visualise and Analyse Relationships Between Objectives in Optimisation Problems Journal of Multi-criteria Decision Analysis. 24(1-2), 37-56GEERT DE MAERE, JASON A.D. ATKIN and EDMUND K. BURKE, 2016. Pruning rules for optimal runway sequencing Transportation Science. 52(4), PATERNOSTRO, S, MOORE, T., HILL, C.J., ATKIN, J. and MORVAN, H.P., 2016. Evaluation of Advanced Receiver Autonomous Integrity Monitoring Performance on Predicted Aircraft Trajectories In: IEEE/ION PLANS 2016. (In Press.)CHRISTOPHER D. BAYLISS, GEERT DE MAERE, JASON ATKIN and MARC PAELINCK, 2016. A simulation scenario based mixed integer programming approach to airline reserve crew scheduling under uncertainty Annals of Operations Research. 1-29 View all publications My web page can be found here: http://www.cs.nott.ac.uk/~jaa PINHEIRO, RODRIGO LANKAITES, LANDA-SILVA, DARIO and ATKIN, JASON, 2017. A Technique Based on Trade-off Maps to Visualise and Analyse Relationships Between Objectives in Optimisation Problems Journal of Multi-criteria Decision Analysis. 24(1-2), 37-56GEERT DE MAERE, JASON A.D. ATKIN and EDMUND K. BURKE, 2016. Pruning rules for optimal runway sequencing Transportation Science. 52(4), PATERNOSTRO, S, MOORE, T., HILL, C.J., ATKIN, J. and MORVAN, H.P., 2016. Evaluation of Advanced Receiver Autonomous Integrity Monitoring Performance on Predicted Aircraft Trajectories In: IEEE/ION PLANS 2016. (In Press.)CHRISTOPHER D. BAYLISS, GEERT DE MAERE, JASON ATKIN and MARC PAELINCK, 2016. A simulation scenario based mixed integer programming approach to airline reserve crew scheduling under uncertainty Annals of Operations Research. 1-29YAN JIN, RONG QU and JASON ATKIN, 2016. Constrained portfolio optimisation: the state-of-the-art Markowitz models In: The 2016 International Conference on Operations Research and Enterprise Systems. S. PATERNOSTRO, TERRY MOORE, CHRIS HILL, JASON ATKIN and HERVE MORVAN, 2016. Evaluation of advanced receiver autonomous integrity monitoring performance on predicted aircraft trajectories In: IEEE/ION PLANS 2016. 842-856CHRISTOFAS STERGIANOS, JASON ATKIN, PATRICK SCHITTEKAT, TOMAS ERIC NORDLANDER, CHRIS GERADA and HERVE MORVAN, 2016. The importance of considering pushback time and arrivals when routing departures on the ground at airports In: 8th International Conference on Applied Operational Research (ICAOR 2016). 41-46GÜMÜŞ, DÜRIYE BETÜL, ÖZCAN, ENDER and ATKIN, JASON, 2016. An analysis of the Taguchi method for tuning a memetic algorithm with reduced computational time budget In: Computer and information sciences: 31st International Symposium, ISCIS 2016. 1. 12-20SIMONE PATERNOSTRO, TERRY MOORE, CHRIS HILL, JASON ATKIN, GEERT DE MAERE and HERVE MORVAN, 2016. Integration of an ARAIM algorithm in the development of an instrument approach procedure and for pre-flight operational briefing. In: International Navigation Conference of the Royal Institute of Navigation (INC 16). JUN CHEN, MICHAL WEISZER, GIORGIO LOCATELLI, STEFAN RAVIZZA, JASON ATKIN, PAUL STEWART and EDMUND K BURKE, 2016. Toward a More Realistic, Cost-Effective, and Greener Ground Movement Through Active Routing: A Multiobjective Shortest Path Approach IEEE Transactions on Intelligent Transportation Systems. 17(12), 2016KARAPETYAN, DANIELAND ATKIN, JASON A. D.AND PARKES, ANDREW J.AND CASTRO-GUTIERREZ, JUAN, 2015. Lessons from building an automated pre-departure sequencer for airports Annals of Operations Research. 1-19C STERGIANOS, J ATKIN, P SCHITTEKAT, TE NORDLANDER, C GERADA and HP MORVAN, 2015. The effects of pushback delays on airport ground movement Journal of Applied Operational Research. 7(2), 68-79RODRIGO LANKAITES PINHEIRO, DARIO LANDA-SILVA and JASON ATKIN, 2015. A variable neighbourhood search for the workforce scheduling and routing problem. In: NELISHIA PILLAY, ANDRIES P. ENGELBRECHT, AJITH ABRAHAM, MATHYS C. DU PLESSIS, VÁCLAV SNÁVSEL and AZAH KAMILAH MUDA, eds., Advances in nature and biologically inspired computing: proceedings of the 7th World Congress on Nature and Biologically Inspired Computing, NaBIC2015, in Pietermaritzburg, South Africa, held December 01-03, 2015 Springer. 247-259RODRIGO L. PINHEIRO, DARIO LANDA-SILVA and JASON ATKIN, 2015. Analysis of objectives relationships in multiobjective problems using trade-off region maps In: Proceedings of the 2015 Genetic and Evolutionary Computation Conference (GECCO 2015). 735-742L.J.P. ARAUJO, ENDER ÖZCAN, JASON ATKIN, MARTIN BAUMERS, CHRISTOPHER TUCK and RICHARD HAGUE, 2015. Toward better build volume packing in additive manufacturing: classification of existing problems and benchmarks In: Annual International Solid Freeform Fabrication Symposium. 401-410DE MAERE, GEERT and ATKIN, JASON AD, 2015. Pruning rules for optimal runway sequencing with airline preferences Lecture Notes in Management Science. 7, 77STEFAN RAVIZZA, JUN CHEN, JASON A D ATKIN, PAUL STEWART and EDMUND K BURKE, 2014. Aircraft taxi time prediction: comparisons and insights Applied Soft Computing. 14, 397-406STEFAN RAVIZZA, JASON A D ATKIN and EDMUND K BURKE, 2014. A more realistic approach for airport ground movement optimisation with stand holding Journal of Scheduling. 17(5), 507-520CHRISTOPHER BAYLISS, GEERT DE MAERE, JASON A.D. ATKIN and MARC PAELINCK, 2014. A Simulation Scenario Based Mixed Integer Programming Approach to Airline Reserve Crew Scheduling Under Uncertainty In: 10th International Conference on the Practice and Theory of Automated Timetabling (PATAT 2014). YAN JIN, RONG QU and JASON ATKIN, 2014. A Population-based Incremental Learning Method for Constrained Portfolio Optimisation In: 16th International Symposium on Symbolic and Numeric Algorithms for Scientific Computing (SYNASC 2014). EDWARD KENT, JASON ATKIN and RONG QU, 2014. Vehicle Routing in a Forestry Commissioning Operation Using Ant Colony Optimisation Lecture Notes in Computer Science: Theory and Practice of Natural Computing. 8890, 95-106MICHEL WEISZER, JUN CHEN, STEFAN RAVIZZA, JASON ATKIN and PAUL STEWART, 2014. A heuristic approach to greener airport ground movement In: IEEE Congress on Evolutionary Computation (CEC). 3280 - 3286URSZULA NEUMAN and JASON ATKIN, 2014. Airport Gate Assignment Considering Ground Movement Lecture Notes in Computer Science: Computational Logistics. 8197, 184-198ATKIN, J.A.D., DE MAERE, G., BURKE, E.K. and GREENWOOD, J.S., 2013. Addressing the pushback time allocation problem at Heathrow Airport Transportation Science. 47(4), 584-602AMADEO ASCO, JASON A D ATKIN and EDMUND K BURKE, 2013. An analysis of constructive algorithms for the airport baggage sorting station assignment problem Journal of Scheduling. (In Press.)CHRIS BAYLISS, GEERT DE MAERE, JASON A.D. ATKIN and MARC PAELINCK, 2013. Scheduling Airline Reserve crew to Minimise Crew Related Delay Using Simulated Airline Recovery and a Probabilistic Optimisation Model In: Proceedings of the IEEE International Conference on Systems, Man and Cybernetics. 1944-1950JASON A D ATKIN, 2013. Airport Airside Optimisation Problems. In: A. SIMA UYAR, ENDER OZCAN and NEIL URQUHART, eds., Automated Scheduling and Planning, From Theory to Practice 1-13RUIBIN BAI, JIAWEI LI, JASON A D ATKIN and GRAHAM KENDALL, 2013. A novel approach to independent taxi scheduling based on stable matching Journal of the Operational Research Society. (In Press.)STEFAN RAVIZZA, JASON A D ATKIN, M H MAATHUIS and EDMUND K BURKE, 2013. A combined statistical approach and ground movement model for improving taxi time estimations at airports Journal of the Operational Research Society. 64, 1347-1360STEFAN RAVIZZA, JUN CHEN, JASON ATKIN, EDMUND BURKE and PAUL STEWART, 2013. The trade-off between taxi time and fuel consumption in airport ground movement Public Transport. 5(1), 25-40BAI, R., KENDALL, G., QU, R. and ATKIN, J., 2012. Tabu assisted guided local search approaches for freight service network design Information Sciences. 189, 266-281AMADEO ASCO, JASON A D ATKIN and EDMUND K BURKE, 2012. An Evolutionary Algorithm for the Over-constrained Airport Baggage Sorting Station Assignment Problem Lecture Notes in Computer Science: Simulated Evolution and Learning. 7673, 32-41CHRISTOPHER BAYLISS, GEERT DE MAERE, JASON A D ATKIN and MARC PAELINCK, 2012. Probabilistic airline reserve crew scheduling In: Proceedings of the 12th Workshop on Algorithmic Approaches",
  "content_length": 11781,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:41"
}