{
  "name": "Jason Nieh",
  "homepage": "https://www.cs.columbia.edu/~nieh",
  "status": "success",
  "content": "Jason Nieh J A S O N   N I E H Dept of Computer Science, Columbia University Home | Research | Teaching | Publications | Facebook | Contact Info Jason Nieh is Professor of Computer Science and Co-Director of the Software Systems Laboratory at Columbia University. He is Chief Scientist of CertiK. He has also served as a consultant to both government and industry, including as a technical advisor on the Microsoft Antitrust Settlement and as an expert witness before the US International Trade Commission. Nieh has authored over a hundred peer-reviewed papers across a broad range of areas, including operating systems, virtualization, computer architecture, thin-client computing, cloud computing, mobile computing, computer security, formal verification, multimedia, web technologies, and performance evaluation. Technologies he developed are widely used in major operating system platforms, including Android and Linux, the largest cloud infrastructure providers, including Amazon Web Services and Google Cloud, and ubiquitous Arm processors, billions of which ship each year. Nieh is a Fellow of the AAAS, ACM, IEEE, and John Simon Guggenheim Memorial Foundation. Other honors for his research work include a Sigma Xi Young Investigator Award, a National Science Foundation CAREER Award, a Department of Energy Early Career Award, numerous industry research awards, including those from Amazon, Google, and IBM, and various best paper and test of time awards, including those from MobiCom, OSDI, SIGCSE, SIGMETRICS, and SOSP. A dedicated teacher, he received the Distinguished Faculty Teaching Award for his innovations in teaching operating systems and for introducing virtualization as a pedagogical tool, which has become common practice at universities around the world. Nieh earned his B.S. from MIT and his M.S. and Ph.D. from Stanford University, all in Electrical Engineering. He is married to Belinda Nieh and they have four children, Joanna, Caleb, Emma, and Zachary. They live in New York City. TEACHING AND ADVISING RECENT PROFESSIONAL ACTIVITIES Columbia College Advising Fall 2025 T2:00-4:00pm CSB 518 COMS W4118 Operating Systems I Fall 2025 TR 4:10-5:25pm NWC 501 (CS MS students see MS Waiver) COMS E6118 Operating Systems II Fall 2025 R 2:10pm-4:00pm Mudd 825 COMS E6901 Projects in Computer Science Fall 2025 COMS E6998 Hyperscale Infrastructure Fall 2024 R 2:10-4:00pm Mudd 337 Program Committee, IEEE S&P 2026 Program Committee, NSDI 2026 Program Committee, ACM CCS 2025 Program Committee, SOSP 2025 Program Committee, ASPLOS 2025 Distinguished Lecture, Academia Sinica, 2025 RECENT AND SELECTED PUBLICATIONS (Complete List) Quantum Virtual Machines Runzhou Tao, Hongzheng Zhu, Jason Nieh, Jianan Yao, and Ronghui Gu, Proceedings of the 19th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2025), Boston, MA, July 2025. Spoq: Scaling Machine-Checkable Systems Verification in Coq Xupeng Li, Xuheng Li, Wei Qiang, Ronghui Gu, and Jason Nieh, Proceedings of the 17th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2023), Boston, MA, July 2023. Design and Verification of the Arm Confidential Compute Architecture Xupeng Li, Xuheng Li, Christoffer Dall, Ronghui Gu, Jason Nieh, Yousuf Sait, and Gareth Stockwell, Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2022), Carlsbad, CA, July 2022. BlackBox: A Container Security Monitor for Protecting Containers on Untrusted Operating Systems Alexander Van't Hof and Jason Nieh, Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2022), Carlsbad, CA, July 2022. Formal Verification of a Multiprocessor Hypervisor on Arm Relaxed Memory Hardware Runzhou Tao, Jianan Yao, Xupeng Li, Shih-Wei Li, Jason Nieh, and Ronghui Gu, Proceedings of the 28th ACM Symposium on Operating Systems Principles (SOSP 2021), October 2021. (Artifact available.) DistAI: Data-Driven Automated Invariant Learning for Distributed Protocols Jianan Yao, Runzhou Tao, Ronghui Gu, Jason Nieh, Suman Jana, and Gabriel Ryan, Proceedings of the 15th USENIX Symposium on Operating Systems Design and Implementation (OSDI 2021), Santa Clara, CA, July 2021. (Jay Lepreau Best Paper Award. Artifact available.) A Secure and Formally Verified Linux KVM Hypervisor Shih-Wei Li, Xupeng Li, Ronghui Gu, Jason Nieh, and John Zhuang Hui, Proceedings of the 42nd IEEE Symposium on Security and Privacy (IEEE S&P 2021), San Francisco, CA, May 2021. (Artifact available.) NEVE: Nested Virtualization Extensions for ARM Jin Tack Lim, Christoffer Dall, Shih-Wei Li, Jason Nieh, and Marc Zyngier, Proceedings of the 26th ACM Symposium on Operating Systems Principles (SOSP 2017), Shanghai, China, October 2017. (The research resulting in the ARMv8.4 virtualization architecture.) ARM Virtualization: Performance and Architectural Implications Christoffer Dall, Shih-Wei Li, Jin Tack Lim, Jason Nieh, and Georgios Koloventzos, Proceedings of the 43rd International Symposium on Computer Architecture (ISCA 2016), Seoul, Korea, June 2016. A Measurement Study of Google Play Nicolas Viennot, Edward Garcia, and Jason Nieh, Proceedings of the ACM International Conference on Measurement and Modeling of Computer Systems (SIGMETRICS 2014), Austin, TX, June 2014. (Kenneth C. Sevcik Outstanding Student Paper Award.) KVM/ARM: The Design and Implementation of the Linux ARM Hypervisor Christoffer Dall and Jason Nieh, Proceedings of the 19th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2014), Salt Lake City, UT, March 2014. (The research resulting in KVM/ARM.) Cider: Native Execution of iOS Apps on Android Jeremy Andrus, Alexander Van't Hof, Naser AlDuaij, Christoffer Dall, Nicolas Viennot, and Jason Nieh, Proceedings of the 19th International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2014), Salt Lake City, UT, March 2014. Cells: A Virtual Mobile Smartphone Architecture Jeremy Andrus, Christoffer Dall, Alexander Van't Hof, Oren Laadan, and Jason Nieh, Proceedings of the 23rd ACM Symposium on Operating Systems Principles (SOSP 2011), Cascais, Portugal, October 2011. (Best Paper Award.) Apiary: Easy-to-use Desktop Application Fault Containment on Commodity Operating Systems Shaya Potter and Jason Nieh, Proceedings of the 2010 USENIX Annual Technical Conference (USENIX 2010), Boston, MA, June 2010. (Together with Strata, the research that led to Docker and Kubernetes.) On the Performance of Wide-Area Thin-Client Computing Albert Lai and Jason Nieh, ACM Transactions on Computer Systems (TOCS), 24(2), May 2006. (Parts of this work appeared in SIGMETRICS 2002.) THINC: A Virtual Display Architecture for Thin-Client Computing Ricardo Baratto, Leonard Kim, and Jason Nieh, Proceedings of the 20th ACM Symposium on Operating Systems Principles (SOSP 2005), Brighton, United Kingdom, October 2005. Experiences Teaching Operating Systems Using Virtual Platforms and Linux Jason Nieh and Chris Vaill, Proceedings of the 36th ACM Technical Symposium on Computer Science Education (SIGCSE 2005), St. Louis, MO, February 2005. MobiDesk: Mobile Virtual Desktop Computing Ricardo Baratto, Shaya Potter, Gong Su, and Jason Nieh, Proceedings of the 10th Annual ACM International Conference on Mobile Computing and Networking (MobiCom 2004), Philadelphia, PA, September-October 2004. (Best Student Paper Award.) The Design and Implementation of Zap: A System for Migrating Computing Environments Steven Osman, Dinesh Subhraveti, Gong Su, and Jason Nieh, Proceedings of the 5th Symposium on Operating Systems Design and Implementation (OSDI 2002), Boston, MA, December 2002. (The research that led to Linux Containers.) Examining VMware Jason Nieh and Ozgur Can Leonard, Dr. Dobb's Journal, 315, Miller Freeman, San Mateo, CA, August 2000. (Invited paper about the first course to use virtual machines.)",
  "content_length": 7964,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:53"
}