{
  "name": "Jason M. O'Kane",
  "homepage": "https://jokane.net",
  "status": "success",
  "content": "Jason M. O'Kane Jason O'Kane Professor Department of Computer Science and Engineering Texas A&M University 318 Peterson Building TAMU 3112 College Station, TX 77843-3112 United States +1-979-458-6851 (office) Curriculum vitae Need a reference letter? Research My research is broadly related to planning problems in robotics. I'm recruiting new students for my research lab. Want to join? Publications A Gentle Introduction to ROS (free book) Events: Workshop on the Algorithmic Foundations of Robotics (WAFR) 2024 Workshop on the Algorithmic Foundations of Robotics (WAFR) 2022 Workshop on Minimality and Trade-offs in Automated Robot Design (at RSS 2017) Workshop on Multi-Robot Systems in Automation: Topics in Planning and Control (at CASE 2016) Workshop on Minimality and Design Automation (at RSS 2016) Former graduate students: Hazhar Rahmani Marios Xanthidis Laura Boccanfuso Yang Song Nick Stiffler Jeremy Lewis Shervin Ghasemlou Trevor Olsen We are grateful for funding from: National Science Foundation Engineer Research and Development Center (ERDC) Texas A&M University Teaching Present: CSCE 452/752: Robotics and Spatial Intelligence Past, at Texas A&M: CSCE 452/752: Robotics and Spatial Intelligence: [Spring 2023] [Fall 2023] [Spring 2024] [Fall 2024] CSCE 643: Seminar in Intelligent Systems and Robotics: [Fall 2022] Past, at the University of South Carolina: CSCE 215 UNIX/Linux Fundamentals: [Spring 2022] [Fall 2021] CSCE 350 Data Structures and Algorithms: [Fall 2020] [Fall 2019] [Fall 2018] [Summer 2016] [Summer 2015] [Spring 2015] [Spring 2014] [Fall 2010] [Fall 2007] CSCE 374 Introduction to Robotics: [Fall 2013] [Fall 2012] CSCE 574 Robotics: [Spring 2014] [Spring 2013] [Spring 2012] [Spring 2011] [Spring 2010] [Spring 2009] [Spring 2008] CSCE 750 Analysis of Algorithms: [Fall 2020] [Fall 2019] [Fall 2018] [Fall 2017] [Fall 2016] [Fall 2015] CSCE 774 Robotic Systems: [Spring 2022] [Fall 2011] [Fall 2009] [Fall 2008] CSCE 790 Special Topics: [Spring 2016] [Fall 2016] CSCE 791 Seminar on Advances in Computing: [Fall 2011] Correct Incorrect O'Kane O'kane Okane O'Cain Kane O,Kane",
  "content_length": 2115,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:50"
}