{
  "name": "Jason I. Hong",
  "homepage": "http://www.cs.cmu.edu/~jasonh",
  "status": "success",
  "content": "﻿ Jason Hong's Homepage - Carnegie Mellon University Jason I. Hong 洪宜安 Professor School of Computer Science Human Computer Interaction Institute Carnegie Mellon University Office: 3609 Newell Simon Hall Email: jasonh cs cmu edu (see FAQ if applying to CMU) Phone: (I don't have a CMU phone# anymore, send email) Blogs: Confabulations | BLOGS@CACM Social: FaceBook | LinkedIn | SlideShare | BlueSky Admin: Reenie Kirby | 412-268-1215 | reenie cmu edu Home Publications CV Talks FAQ Bio See all publications Recent Papers What Comes After Harm? Mapping Reparative Actions in AI through Justice Frameworks (AIES 2025) A Closer Look at the Existing Risks of Generative AI: Mapping the Who, What, and How of Real-World Incidents (AIES 2025) WeAudit: Scaffolding User Auditors and AI Practitioners in Auditing Generative AI (CSCW 2025) (best paper award) Of Secrets and Seedphrases: Conceptual Misunderstandings and Security Challenges for Seed Phrase Management among Cryptocurrency Users (CHI 2025) Investigating Youth AI Auditing (FAccT 2025) Investigating What Factors Influence Users’ Rating of Harmful Algorithmic Bias and Discrimination (HCOMP 2024) (best paper award) Matcha: An IDE Plugin for Creating Accurate Privacy Nutrition Labels (IMWUT 2024) Designing for Privacy in Mobile Sensing Systems, book chapter in Mobile Sensing in Psychology: Methods and Applications Understanding Frontline Workers’ and Unhoused Individuals’ Perspectives on AI Used in Homeless Services (CHI 2023) (best paper award) The Security and Privacy Acceptance Framework (SPAF): A review of why users accept or reject cybersecurity and privacy best practices (FnT) Research Overview Note: As of end of 2024, I am officially Professor Emeritus. I am still doing some research at CMU related to Responsible AI, and also working on a new startup at the intersection of AI + HCI. My primary field is human-computer interaction. My areas of work are in usable privacy and security, mobile computing, Internet of Things, and AI fairness and bias. Below is a summary of some of my past work (see here for longer description): Pioneered research on protecting people from phishing scams. Our work on anti-phishing was adopted by industry groups, and inspired the design of anti-phishing browser warnings. Our work was also commercialized as Wombat Security, which was acquired by Proofpoint in 2018. Deployed Livehoods, which was the first paper to use geotagged social media to understand the dynamics of cities. Won ICWSM test of time award in 2022. Investigated Social Cybersecurity, which looked at how to adopt ideas from social psychology to positively influence people’s privacy and security behaviors. Won Honorable Mention for NSA Competition for Best Scientific Cybersecurity Paper. Pioneered new system architectures and developer tools for smartphone privacy, which has had positive impact on consumer privacy and on industry Deployed PrivacyGrade.org, a web site where we analyzed the privacy of over a million Android apps based on a model of people’s expectations of privacy Wrote The Design of Sites, one of the earliest books on user interface design patterns, sold about 100k copies worldwide Developed WeAudit, a suite of tools for helping everyday people collectively audit AI systems for bias and fairness Co-founded the Master’s of Product Management (MSPM), a joint program between HCII and Tepper School of Business Supervised 21 Postdocs and PhD students, and taught hundreds of undergrads and master’s students in classes, independent studies, and research projects My team's work has been featured in CNN, New York Times, BBC, CBS News, MIT Tech Review, World Economic Forum, and more. We have been generously funded by DARPA, National Science Foundation, Army Research Office, Amazon, Cisco, Google, IBM, Intel, Meta, Microsoft, Nokia, NQ Mobile, Pitney Bowes, Portugal Telecom, Samsung, Yahoo, CMU Cylab, Alfred P. Sloan Foundation, and more. What's New? Nov 11, 2025 Gave a guest lecture giving an overview of Privacy and Security for Pervasive Computing. This is a good 90-min crash course on privacy and security. Nov 11, 2025 Gave a keynote talk at the Workshop on Trustworthy and Privacy-Preserving Human-AI Collaboration entitled Auditing AI Systems for Bias and Fairness. This talk summarizes our team's past 6 years of research on this topic. Oct 24, 2025 Gave a talk at PGH Techfest entitled The Promise and Perils of AI for Products Oct 21, 2025 Our paper WeAudit: Scaffolding User Auditors and AI Practitioners in Auditing Generative AI won Best Paper Award at CSCW 2025. This paper looks at how to facilitate user-engaged auditing of AI systems. Oct 19, 2025 Gave a keynote talk at Human-Centered AI Privacy and Security (HAIPS) workshop at CCS, on Auditing AI Systems for Bias and Fairness. Dec 31, 2024 I am now officially (youngest?) Professor Emeritus at Carnegie Mellon University. I'm still doing some research on Responsible AI at CMU, while also working on new startup at the intersection of AI + HCI. Oct 18, 2024 Our paper Investigating What Factors Influence Users’ Rating of Harmful Algorithmic Bias and Discrimination won a Best Paper Award at HCOMP 2024. The basic idea was to evaluate what kinds of biases people are more likely to find in image-based generative AI, based on their own demographics (race, gender, sexual orientation). Feb 27, 2024 I gave a talk entitled An Overview of Privacy for Mobile Sensing Systems for the mDOT NIH Center. This talk is a good crash course in privacy. Feb 8, 2024 Along with several of my colleagues at CMU, I was named a 2024 Microsoft Research AI & Society fellow to do work on to do work on Regulating AI in Light of the Challenges of Doing Responsible AI in Practice. Dec 13, 2023 Gave distinguished lecture at Univ Wisconsin-Madison entitled Helping Developers with Privacy. This talk summarizes our team's past decade of work on studying developers and building better tools. Nov 20, 2023 New book chapter entitled Designing for Privacy in Mobile Sensing Systems, in the book Mobile Sensing in Psychology: Methods and Applications. I tried to summarize everything I know about legal, philosophical, design, and technical issues about privacy in this chapter. July 25, 2023 My blog post What Can the FATE Community Learn from the Successes and Failures in Privacy? was published in CACM August 2023 issue. May 27, 2023 I had the honor of being the 2023 commencement speaker at the South Carolina Governor's School for Science and Math, my alma mater. See the text of the speech or video here. Apr 20, 2023 Our paper What makes people install a COVID-19 contact-tracing app? Understanding the influence of app design and individual difference on contact-tracing app adoption intention won Best Research Paper 2019-2021 in Pervasive and Mobile Computing. This paper presents the results of a large survey examining how different factors influence people's behaviors. Apr 4, 2023 Our paper Understanding Frontline Workers’ and Unhoused Individuals’ Perspectives on AI Used in Homeless Services won a Best Paper Award at CHI 2023. This paper examined what factors frontline workers and homeless individuals thought should be incorporated in AI algorithms for housing for homeless people, using a comic book storyboarding method. Jan 19, 2023 I was named an ACM Fellow \"for contributions to ubiquitous computing and to usable privacy and security\" Jun 7, 2022 Our work on Livehoods won ICWSM Test of Time award! See the press release and livehoods.org web site. This paper pioneered the use of social media to understand cities. Nov 23, 2021 Our paper on Software-Defined Cooking Using a Microwave Oven is a Research Highlight in the Dec 2021 issue of CACM. This paper looks at how to control microwave heating for precision cooking. Apr 27, 2021 New paper on arxiv summarizing our work on DARPA Brandeis project for smartphone privacy: The Design of the User Interfaces for Privacy Enhancements for Android. Apr 24, 2021 Use our SA-6 and SA-13 survey instrument to assess people's security attitudes. You can also take the SA-6 quiz online here. Feb 14, 2020 I'm now a member of CHI Academy! Mar 5, 2019 My wife and I helped found two junior faculty chairs in the Human-Computer Interaction Institute at CMU. Nov 30, 2018 Our team has released the MobiPurpose data set. It contains over 2 million unique intercepted traffic requests from 15k+ smartphone apps, gathered from our array of smartphones. Mar 1, 2018 Wombat Security, which I co-founded in 2008, was acquired by Proofpoint May 29, 2017 I was recently honored with Alumni of the Year from my old high school, South Carolina Governor's School for Science and Math. Here is a link to my speech at the commencement. May 16, 2017 The HCII and the Tepper School of Business are offering a new Master's Degree of Product Management. I'm helping to run the HCII side. Jun 7, 2016 White paper with New America entitled Toward a Safe and Secure Internet of Things. Sep 9, 2015 Presented some of our team's work on using smartphones for healthcare at the World Economic Forum at Dalian. Aug 13, 2015 Our CCS 2014 paper Increasing Security Sensitivity with Social Proof: A Large-Scale Experimental Confirmation won Honorable Mention at NSA's Best Scientific Cybersecurity Paper Competition. Dec 26, 2014 PrivacyGrade.org presents our privacy analysis of 1 million Android apps. Our work has appeared on CNN, US News and World Report, New York Times, CNBC, IEEE Spectrum, Forbes, and more. Sep 17, 2014 My brother and I have created the Frances and Chou-Chu Hong graduate fellowship at the Veterinary and Animal Sciences Department at the University of Massachusetts. Oct 25, 2013 Gave a talk at PopTech 2013 on sensing and privacy. See slides and video here. Apr 9, 2012 Livehoods.org re-imagines how cities work in the age of social media. Livehoods has been featured in The Atlantic Cities, Wired Insider, MIT Technology Review, Fast Company Co.Design,",
  "content_length": 21301,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:47"
}