{
  "name": "Jason D. Hartline",
  "homepage": "https://sites.northwestern.edu/hartline",
  "status": "success",
  "content": "Jason Hartline, Professor | Jason Hartline Skip to content Contact Information Jason D. Hartline Seeley Mudd 3015 2233 Tech Drive Computer Science McCormick School of Engineering Northwestern University Evanston, IL 60208 Phone: (847) 467-0280 Fax: (847) 491-5258 hartline[at]northwestern.edu CoursesStudentsFormer StudentsGrantsRecent Papers Prof. Hartline’s research introduces design and analysis methodologies from computer science to understand and improve outcomes of economic, legal, and AI systems. Optimal behavior and outcomes in complex environments are complex and, therefore, should not be expected; instead, the theory of approximation can show that simple and natural behaviors are approximately optimal in complex environments. This approach is applied to auction theory and mechanism design in his graduate textbook Mechanism Design and Approximation which is under preparation. Prof. Hartline received his Ph.D. in 2003 from the University of Washington under the supervision of Anna Karlin. He was a postdoctoral fellow at Carnegie Mellon University under the supervision of Avrim Blum; and subsequently a researcher at Microsoft Research in Silicon Valley. He joined Northwestern University in 2008 where he is a professor of computer science. He was on sabbatical at Harvard University in the Economics Department during the 2014 calendar year and visiting Microsoft Research, New England for the Spring of 2015. He was on sabbatical at Stanford University for the 2023-2024 academic year. Prof. Hartline is the director of Northwestern’s Online Markets Lab, he was a founding codirector of the Institute for Data, Econometrics, Algorithms, and Learning from 2019-2022, and is a cofounder of virtual conference organizing platform Virtual Chair. Curriculum Vitae: [pdf] Headshot: [jpg] Publications. (in reverse-chronological order) Subgame Optimal and Prior-Independent Online Algorithms, with Aleck Johnsen and Anant Shah, ITCS 2026. [arxiv] Behavioral Study of Dashboard Mechanisms, with Paula Kayongo and Jessica Hullman, WINE 2026. [arxiv] Algorithmic Robust Forecast Aggregation, with Yongkang Guo, Zhihuan Huang, Yuqing Kong, Anant Shah, and Fang-Yi Yu, EC 2025. [link] [arxiv] Smooth Calibration and Decision Making, with Yifan Wu and Yunran Yang, FORC 2025. [arxiv] (best paper award) Underspecified Human Decision Experiments Considered Harmful, with Jessica Hullman and Alex Kale, CHI 2025. [link] [arxiv] Regulation of Algorithmic Collusion, Refined: Testing Pessimistic Calibrated Regret, with Chang Wang and Chenhao Zhang, CSLaw 2025. [link] [arxiv] Combinatorial Pen Testing (or Consumer Surplus of Deferred-Acceptance Auctions), with Aadityan Ganesh, ITCS 2025 [arxiv] Fundamental Limits of Throughput and Availability: Applications to prophet inequalities & transaction fee mechanism design, with Aadityan Ganesh, Atanu Sinha, and Matthew vonAllmen, EC 2024. [arxiv] A Decision Theoretic Framework for Measuring AI Reliance, with Ziyang Guo, Yifan Wu, and Jessica Hullman, FAccT 2024. [arxiv] [acm] Regulation of Algorithmic Collusion, with Sheng Long and Chenhao Zhang, CSLaw 2024. [arxiv] Error-Tolerant E-Discovery Protocols, with Jinshuo Dong, Liren Shan, and Aravindan Vijayaraghavan, CSLaw 2024. [arxiv] Designing Shared Information Displays for Agents of Varying Strategic Sophistication, with Dongping Zhang and Jessica Hullman, CSCW 2024. [arxiv] The rational agent benchmark for data visualization, with Yifan Wu, Ziyang Guo, Michalis Mamakos, and Jessica Hullman, VIS 2023. [link] [arxiv] Equivocal Blends: Prior Independent Lower Bounds, with Aleck Johnsen, ITCS 2024 [link] [arxiv] Optimal Scoring Rules for Multi-dimensional Effort, with Yingkai Li, Liren Shan, and Yifan Wu, COLT 2023. [link] [arxiv] Fair Grading Algorithms for Randomized Exams, with Jiale Chen and Onno Zoeter, FORC 2023. [link] [arxiv] (best student paper award) Screening with Disadvantaged Agents, with Hedyeh Beyhaghi, Modibo Camara, Aleck Johnsen, and Sheng Long, FORC 2023. [link] [arxiv] Non-strategic Structural Inference (for Initial Play), with Daniel Chui and James Wright, AAMAS 2023. [arxiv] Simple Mechanisms for Non-linear Agents, with Yingkai Li and Yiding Feng, SODA 2023. [link] [arxiv] Classification Protocols with Minimal Disclosure, with Jinshuo Dong and Aravindan Vijayaraghavan. CSLaw 2022. [arxiv] Algorithmic Learning Foundations for Common Law, with Daniel W. Linna Jr., Liren Shan, and Alex Tang. CSLaw 2022. [arxiv] Optimization of Scoring Rules, with Yingkai Li, Liren Shan, and Yifan Wu. EC 2022. [arxiv] [​long video] [​short video] [​flash video] Bias-Variance Games, with Yiding Feng, Ronen Gradwohl, Aleck Johnsen, and Denis Nekipelov, EC 2022. [arxiv] Karp: A Language for NP-reductions with Chenhao Zhang and Christos Dimoulas, PLDI 2022 [link] [​video] Fast Core Pricing for Rich Advertising Auctions, with Nicole Immorlica, Mohammad Reza Khani, Brendan Lucier, Mohammad Reza Khani, and Rad Niazadeh, Operations Research 2022. [link] Visualization Equilibrium, with Paula Kayongo, Glenn Sun, and Jessica Hullman. IEEE VIS 2021. [arxiv] Non-quasi-linear Agents in Quasi-linear Mechanisms, with Moshe Babaioff, Richard Cole, Nicole Immorlica, and Brendan Lucier. ITCS 2021 [arxiv] [​video] Welfare-maximizing Guaranteed Dashboard Mechanisms, with Yuan Deng, Jieming Mao, and Balasubramanian Sivan. EC 2021. [ssrn] Revelation Gap for Pricing from Samples, with Yiding Feng and Yingkai Li. STOC 2021. [arxiv] When Is Pure Bundling Optimal? with Nima Haghpanah. Review of Economic Studies 2021. [link] Bernoulli Factories and Black-box Reductions in Mechanism Design, with Shaddin Dughmi, Rad Niazadeh, and Robert Kleinberg. JACM 2021. [link] Mechanisms for a No-Regret Agent: Beyond the Common Prior, with Modibo Camara and Aleck Johnsen, FOCS 2020. [arxiv] [​video] Benchmark Design and Prior-independent Optimization, with Aleck Johnsen and Yinkai Li, FOCS 2020. [arxiv] [​short video] [​long video] Non-quasi-linear Agents in Quasi-linear Mechanisms, with Moshe Babaioff, Richard Cole, Nicole Immorlica, and Brendan Lucier. ITCS 2020. [arxiv] Simple Mechanisms for Non-linear Agents, with Yingkai Li and Yiding Feng, Working paper 2020. [arxiv] [​video] A Truthful Cardinal Mechanism for One-sided Matching, with Rediet Abebe, Richard Cole, and Vasilis Gkatzelis, SODA 2020. [arxiv] Inference from Auction Prices, with Aleck Johnsen, Denis Nekipelov, and Zihe Wang, SODA 2020. [arxiv] Dashboard Mechanisms for Online Marketplaces, with Aleck Johnsen, Denis Nekipelov, and Onno Zoeter, EC 2019. [short video] [long video] [arxiv] Optimal Auctions vs. Anonymous Pricing: Beyond Linear Utility, with Yiding Feng and Yingkai Li, EC 2019. [​video] [arxiv] Sample Complexity for Non-truthful Mechanisms, with Samuel Taggart, EC 2019. [arXiv] An End-to-end Argument in Mechanism Design (Prior-independent Auctions for Budgeted Agents), with Yiding Feng, FOCS 2018. [arxiv] Optimal auctions vs. anonymous pricing, with Saeed Alaei, Rad Niazadeh, Manolis Pountourakis, and Yang Yuan, Games and Economic Behavior 2018. [link] Mechanism Redesign, with Shuchi Chawla and Denis Nekipelov, Working paper 2017. [cs-audience-video] [gen-audience-video] [arXiv] Fast Core Pricing for Rich Advertising Auctions, with Nicole Immorlica, Mohammad Reza Khani, Brendan Lucier, and Rad Niazadeh, EC 2018. [arXiv] Bernoulli Factories and Black-Box Reductions in Mechanism Design, with Shaddin Dughmi, Robert Kleinberg, and Rad Niazadeh, STOC 2017. [arXiv] Bayesian Budget Feasibility with Posted Pricing, with Eric Balkanski, WWW 2016. [arXiv] Non-revelation Mechanism Design, with Samuel Taggart, Working paper, 2016. [arXiv] A/B Testing of Auctions, with Shuchi Chawla and Denis Nekipelov, EC 2016. [arXiv] (subsumed by Mechanism Redesign) No-Regret Learning in Bayesian Games, with Vasilis Syrgkanis and Eva Tardos, NIPS 2015. [arXiv] Optimal auctions vs. anonymous pricing, with Saeed Alaei, Rad Niazadeh, Manolis Pountourakis, and Yang Yuan, FOCS 2015. [arxiv] Non-optimal Mechanism Design, with Brendan Lucier, American Economic Review 2015. [link] Bayesian Incentive Compatibility via Matching, with Bobby Kleinberg and Azarakhsh Malekian, Games and Economic Behavior 2015. [link] Envy freedom and prior-free mechanism design, with Nikhil Devanur and Qiqi Yan, Journal of Economic Theory 2015. [link] [arxiv] Optimal Crowdsourcing Contests, with Shuchi Chawla and Balu Sivan, Games and Economic Behavior 2015. [link] Multi-dimensional Virtual Values and Second-degree Price Discrimination, with Nima Haghpanah. Working paper, 2014-2016. [arxiv] Mechanism Design for Data Science, with Shuchi Chawla and Denis Nekipelov. EC 2014. [arxiv] (subsumed by Mechanism Redesign) Price of Anarchy for Revenue, with Darrell Hoy and Samuel Taggart. EC 2014. [arxiv] [​video] Optimal Auctions for Correlated Buyers with Sampling, with Hu Fu, Nima Haghpanah, and Robert Kleinberg. EC 2014. [arxiv] The Simple Economics of Approximately Optimal Auctions, with Saeed Alaei, Hu Fu, Nima Haghpanah. FOCS 2013. [pdf] [arXiv] Bayesian Mechanism Design (a survey), Foundations and Trends in Theoretical Computer Science 2013. [pdf] [link] Auction with Unique Equilibria, with Shuchi Chawla, EC 2013. [pdf] Prior-independent Auctions for Risk-averse Agents, with Hu Fu and Darrell Hoy. EC 2013. [pdf] [arXiv] Prior-free Auctions for Budgeted Agents, with Nikhil Devanur and Bach Ha. EC 2013. [pdf] [arXiv] Prior-independent Mechanisms for Scheduling, with Shuchi Chawla, David Malec, and Balu Sivan, STOC 2013. [pdf] [arXiv] Badminton and the Science of Rulemaking, with Robert Kleinberg. Huffington Post, 2012. [pdf] [link] The Biased Sampling Profit Extraction Auction, with Bach Ha. Working paper, 2012. [arXiv] Approximation in Mechanism Design, AER: Papers and Proceedings 2012[pdf] Bayesian Optimal Auctions via Multi- to Single-agent Reduction, with Saeed Alaei, Hu Fu, Nima Haghpanah, and Azarakhsh Malekian, EC 2012 [abstract] [arXiv] Optimal Crowdsourcing Contests, with ",
  "content_length": 15312,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:47"
}