{
  "name": "Jason Alexis Valentine Crampton",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/jason-crampton",
  "status": "success",
  "content": "Jason Crampton - Royal Holloway Research Portal View Scopus Profile Jason Crampton Professor Emeritus Professor Information Security, Department of Information Security Phone+44 1784 443117EmailJason.Cramptonrhul.acuk TW20 0EX Personal profile Personal profileI was awarded a BSc (Hons) in Mathematics from the University of Manchester in 1986. I worked as a maths teacher for several years and then for a trade union, during which time I completed a part-time MSc in Computer Science in 1996. I returned to full-time education in 1998, being awarded a PhD in 2002.  I joined the Information Security Group in September 2002, becoming a reader in 2007 and a professor of information security in 2011.Research interestsMy research focuses on authorization and access control, particularly role-based access control, cryptographic enforcement methods for access control and the application of partial order theory to access control. My current work focuses on the theoretical foundations of mechanisms that can enforce business rules in workflow management systems and business process management systems, and on the development of frameworks for the specification of authorization policies and access control systems. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 70 Conference contribution 27 Article 15 Chapter 6 Working paper 4 More 2 Anthology 1 Paper 1 Doctoral Thesis Research output per year Research output per year PTaCL: A Language for Attribute-Based Access Control in Open SystemsCrampton, J. & Morisset, C., 2012, POST 2012: Principles of Security and Trust - First International Conference. Degano, P. & Guttman, J. (eds.). Springer, p. 390-409 20 p. (Lecture Notes in Computer Science; vol. 7215).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Practical and efficient cryptographic enforcement of interval-based access control policiesCrampton, J., May 2011, In: ACM Transactions on Information and System Security. 14, 1, 30 p., 14.Research output: Contribution to journal › Article › peer-review An authorization framework resilient to policy evaluation failuresCrampton, J. & Huth, M., 2010, Computer Security – ESORICS 2010: 15th European Symposium on Research in Computer Security, Athens, Greece, September 20-22, 2010: Proceedings. Springer, p. 472-487 16 p. (Lecture Notes in Computer Science; vol. 6345).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Specifying and enforcing constraints in role-based access controlCrampton, J., 2003, Proceedings of 8th ACM Symposium on Access Control Models and Technologies. ACM Press, p. 43-50 8 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Administrative Scope: A Foundation for Role-Based Administrative ModelsCrampton, J. & Loizou, G., 2003, In: ACM Transactions on Information and System Security. 6, 2, p. 201-231 31 p.Research output: Contribution to journal › Article › peer-review View all 122 research outputs Projects 8 Finished Projects per year Analyzing Security-aware Workflows (funded by Leverhulme Trust)Gutin, G. (PI), Crampton, J. (CoI) & Cohen, D. (CoI)1/01/19 → 31/12/21Project: Research CLARUS: A Framework for user centred privacy and Security in the CloudMartin, K. M. (PI) & Crampton, J. (PI)European Commission1/01/15 → 31/12/17Project: Research Centre for Doctoral Training in Cyber SecurityCid, C. (PI), Crampton, J. (CoI), Martin, K. M. (CoI) & Paterson, K. (CoI)Eng & Phys Sci Res Council EPSRC1/04/13 → 31/12/19Project: Research Parameterized Algorithmics for the Analysis and Verification of Constrained Workflow SystemsGutin, G. (PI), Cohen, D. (CoI) & Crampton, J. (CoI)Eng & Phys Sci Res Council EPSRC1/02/13 → 1/05/16Project: Research Academic Centre of Excellence in Cyber Security ResearchCrampton, J. (PI) & Mayes, K. (CoI)Eng & Phys Sci Res Council EPSRC1/07/12 → 30/06/15Project: Research View all 8 projects Activities 47 Participation in a conference 2 Editor of research journal 1 Workshop, seminar, course or webinar. Activities per year 2nd Workshop on Security in Business ProcessesCrampton, J. (Member of programme committee)2013Activity: Participating in or organising an event › Participation in a conference 18th European Symposium on Research in Computer Security (ESORICS 2013)Crampton, J. (Chair)2013Activity: Participating in or organising an event › Participation in a conference 18th ACM Symposium on Access Control Models and TechnologiesCrampton, J. (Member of programme committee)2013Activity: Participating in or organising an event › Participation in a conference 9th Information Security Practice & Experience ConferenceCrampton, J. (Member of programme committee)2013Activity: Participating in or organising an event › Participation in a conference 7th IFIP WG 11.11 International Conference on Trust ManagementCrampton, J. (Member of programme committee)2013Activity: Participating in or organising an event › Participation in a conference View all 50 activities Prizes Best paper award at 20th ACM Symposium on Access Control Models and Technologies (SACMAT 2015)Gutin, G. (Recipient), Crampton, J. (Recipient) & Karapetyan, D. (Recipient), 2015Prize: Prize (including medals and awards) Best paper award at 21st ACM Symposium on Access Control Models and Technologies (SACMAT 2016)Gutin, G. (Recipient), Crampton, J. (Recipient) & Watrigant, R. (Recipient), 2016Prize: Prize (including medals and awards) Best paper award at SACMAT 2022Crampton, J. (Recipient), Eiben, E. (Recipient), Gutin, G. (Recipient), Karapetyan, D. (Recipient) & Majumdar, D. (Recipient), 10 Jun 2022Prize: Prize (including medals and awards) Best paper award at the 26th ACM Symposium on Access Control Models and Technologies (SACMAT 2021)Crampton, J. (Recipient), Eiben, E. (Recipient), Gutin, G. (Recipient), Majumdar, D. (Recipient) & Karapetyan, D. (Recipient), 2021Prize: Prize (including medals and awards)",
  "content_length": 6540,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:47"
}