{
  "name": "Jason Tsong-Li Wang",
  "homepage": "https://web.njit.edu/~wangj",
  "status": "success",
  "content": "Homepage of Dr. Jason T. L. Wang: Contact Information Dr. Jason T. L. Wang Professor and Director, Data and Knowledge Engineering Lab Contact | Classes | Education | Research | Publications | Exhibits | Software | Information E-mail: wangj@njit.edu Phone: (973) 596-3396 Fax: (973) 596-5777 Office: GITC 4211 Address: Prof. Jason T. L. Wang Department of Computer Science New Jersey Institute of Technology University Heights Newark, NJ 07102-1982 Search my website using Google (add any keywords but do not erase wangj) WWW web.njit.edu Calendar Current Weather Machine Learning Software Scientific Data Mining Software https://orcid.org/0000-0002-2486-1097 Research NJIT Board of Overseers, College of Computing Sciences Research Award, 2013 Teaching NJIT University Excellence in Teaching Award for Excellence in Graduate Instruction, 2016 Book Co-Author Bioinformatics Database Systems (CRC Press) Pattern Recognition in Computational Molecular Biology: Techniques and Approaches (Wiley) Biological Data Mining and Its Applications in Healthcare (World Scientific Publishing Company) Computational Intelligence and Pattern Analysis in Biological Informatics (Wiley) Analysis of Biological Data: A Soft Computing Approach (World Scientific Publishing Company) Data Mining in Bioinformatics (Springer) Computational Biology and Genome Informatics (World Scientific Publishing Company) Mining the World Wide Web: An Information Search Approach (Springer) [English Version and Japanese Translation] Pattern Discovery in Biomolecular Data: Tools, Techniques, and Applications (Oxford University Press) Journal Special Issue Editor Research Topic: Using Machine Learning in Solar and Heliospheric Physics, Frontiers in Astronomy and Space Sciences Journal Editor/Editorial Board Member ACM Transactions on Knowledge Discovery from Data (TKDD) Knowledge and Information Systems Information Systems World Scientific Annual Review of Artificial Intelligence Contact | Classes | Education | Research | Publications | Exhibits | Software | Information If you have any comments or questions, please send them to wangj@njit.edu.",
  "content_length": 2119,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:54"
}