{
  "name": "Jason D. Bakos",
  "homepage": "https://cse.sc.edu/~jbakos",
  "status": "success",
  "content": "Jason D. Bakos | Home Jason D. Bakos Office:   Storey 2213 Phone:  803-777-8627 E-mail:  jbakos@cse.sc.edu Current CV University of South Carolina College of Engineering and Computing Professor News Nov. 13, 2023: Dr. Bakos co-organizes H2RC for the ninth year! May 15, 2023: New funding from NSF: Collaborative Research: SHF: Small: Sub-millisecond Topological Feature Extractor for High-Rate Machine Learning Nov. 14, 2022: Dr. Bakos co-organizes H2RC for the eighth year! May 17, 2022: FCCM 2022 presentation: High-Rate Machine Learning for Forecasting Time-Series Signals Nov. 15, 2021: Dr. Bakos co-organizes H2RC for the seventh year! Nov. 13, 2020: Dr. Bakos co-organizes H2RC for the sixth year! Aug. 1, 2020: New funding from NSF: \"Collaborative Research:SHF:Medium:Machine Learning on the Edge for Real-Time Microsecond State Estimation of High-Rate Dynamic Events\", PI: Jason D. Bakos, 2020-2024. Nov. 26, 2019: Jason D. Bakos, Charles A. Daniels, and Philip Conrad sign contract with Cognella Publishers to write a textbook: \"Integrative Design and Programming of Internet-of-Things and Cyberphysical Platforms\" Nov. 25, 2019: Rasha Karakchi successfully defends her Ph.D. dissertation \"An Overlay Architecture for Pattern Matching\" Nov. 21, 2019: New funding from AFOSR DURIP: \"Real-Time Edge Computing in Structures Experiencing Shock\", PI: Austin Downey, CoPIs: Jason D. Bakos, Paul Ziehl, Sourav Banerjee, Lingyu Yu, 2020-2021 Nov. 17, 2019: Dr. Bakos co-organizes H2RC for the fifth year! Sept. 4, 2019: Dr. Bakos signs contract with Elsevier Publishing to write the second edition of his textbook \"Embedded Systems: ARM Programming and Optimization\" Aug. 5, 2019: New funding from NSF: \"RTML: Small: Collaborative: A programming model and platform architecture for real-time machine learning for sub-second systems\", PI: Austin Downey, CoPI: Jason D. Bakos, 2019-2022 July 29, 2019: New funding from NSF: \"SHF:Small:A Unified Approach for Scheduling Computer Vision Dataflow Graphs\" PI: Jason D. Bakos, 2019-2021 July 16, 2019: Rasha Karakchi gives talk at ASAP 2019 \"An Overlay Architecture for Pattern Matching\" July 16, 2019: Madushan Abeysinghe gives talk at ASAP 2019 \"OpenVX Graph Optimization for Visual Processor Units\" Jan. 1, 2019: New funding from SRNL: \"Data Analysis, Computer Vision, and Machine Learning for DOE-STD-3013 Plutonium Surveillance Program\", PI: Jason D. Bakos, 2019-2019 Jason D. Bakos Office:   Storey 2213 Phone: 803-777-8627 Email: jbakos@cse.sc.edu College of Engineering and Computing",
  "content_length": 2535,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:46"
}