{
  "name": "Jason Pacheco",
  "homepage": "https://www2.cs.arizona.edu/~pachecoj",
  "status": "success",
  "content": "Jason Pacheco | University of Arizona Computer Science Office: Gould-Simpson, Rm. 707 Mailing Address University of Arizona Department of Computer Science 1040 E 4th St. Tucson, AZ 85721 Jason L. Pacheco Statistical Machine Learning and Stochastic Systems About me. I am an Assistant Professor in the Department of Computer Science at the University of Arizona in sunny Tucson Arizona. Before joining UA I completed my PhD in Computer Science at Brown University with Erik Sudderth. I also held a postdoc position at MIT CSAIL with John Fisher III. Research.My research in statistical machine learning aims to build intelligent systems for automated reasoning in stochastic systems. To achieve this requires the development of algorithms that yield efficient inferences, while remaining flexible enough to adapt to complex domains. My research interests span a variety of application domains including computer vision, signal processing, computational biology, and computational neuroscience. For more details see my CV. For more information about machine learning at UA see our website. Recent News Our paper Risk-Sensitive Exponential Actor Critic was accepted to AAAI 2026 Our paper Reverse-Annealed Sequential Monte Carlo for Efficient Bayesian Optimal Experiment Design was accepted to NeurIPS 2025 Our paper Risk-Sensitive Variational Actor-Critic: A Model-Based Approach was accepted to ICLR 2025 Our paper Flow-based Variational Mutual Information: Fast and Flexible Approximations was accepted to ICLR 2025 Congratulations to Dr. Caleb Dahlke for a successful PhD defense! Recieved the Air Force Office of Scientific Research (AFOSR) Young Investigator Program (YIP) award for Robust Maximum Entropy Planning, Learning, and Control in Uncertain Environments Interested in working with me? I am happy to collaborate with motivated students! If you would like to join my group, see the following items before emailing me: Take my classes CSC 535 : Intro. to Probabilistic Graphical Models or CSC 665 : Advanced Topics in Probabilistic Graphical Models. If you wish to work with me as a PhD student read more here. Checkout some of my recent publications for project ideas. © Jason Pacheco, 2019",
  "content_length": 2201,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:53"
}