{
  "name": "Jaspal Subhlok",
  "homepage": "http://www2.cs.uh.edu/~jaspal",
  "status": "success",
  "content": "Jaspal Subhlok Jaspal_Subhlok Professor Department of Computer Science Department of Electical and Computer Engineering University of Houston,  Houston, TX 77204 Office: PGH 217  V: (713) 743-3340  E: jaspal AT uh.edu Office Hours:  By appointment. Professional Interests Educational technologies and their impact on learning Enhance CS Education in schools - collaboration with teachHOUSTON Publications Google Scholar (Please contact me if you cannot find the content of any paper) Teaching COSC1336: Computer Science and Programming Syllabus (Course content will be on Teams/Canvas) Other courses taught in recent years: COSC 4354/6354: Software Development Practices COSC 4377: Introduction to Computer Networks Research Focus of current research is the Videopoints project that employs AI to transform a lecture video into an interactive learning companion. More information and an advanced lecture video platform for educational institutions available at videopoints.org A list of  past HPC projects available under: High Performance Systems Lab Current Research Team Jatindera \"Jay\" Walia (PhD), Dipayan Biswas (PhD), Rauf Momin (PhD) Research Team Alumni PhD: Tsung-I \"Mark\" Huang (Texas A&M;), Troy Leblanc (NASA), Kevin Leigh (Hewlett Packard), Md. Rajiur Rahman (Bangla Desh Air Force) Tanvir Rahman (Nordstrom), Tayfun Tuna (Amazon), Qiang Xu (CGG) MS: Ryan Long (American National Insurance Company), Gautam Bhatt (Oracle), Rucha Borgaonkar (Amazon),    Farah Naz Chowdhury (Muncy Machine & Tool) Yu-Ren Chung, Pranav Desai (MobileIron, Bengaluru), Ping Du (IHS, NY), Mala Ghanesh, Srikanth Goteti (FinMkt), Qiaomei Huang, Tarikul Islam (PwC), Mahima Joshi (3PL Central), Nagarajan Kanna (eBay) , Praveen Karoshi (OfficeTimer, Bangaluru), Raga Shalini Koka (Amazon)  Sathish Kumar (Univ. Houston), Joanna Li, Georgi Kutiev (Schlumberger) , Amit Lodh (Schlumberger), Siva Nagarajan, Girish Nandagudi (Microsoft), Hien Nguyen (Amazon), Ravi Parthasarathy, Eshwar Pedamallu (Oceaneering), Gautam Puranam (Oracle), Sui Shen, Amitoj Singh (FermiLabs), Sukhdeep Sodhi (Microsoft), Aditya Toomula (LinkedIn), Shreenivasa Venkataramaiah (HP), Varun Varghese (JPMorgan), Anshul Verma (Facebook), Deepti Vyas (Twitter) , Yuan Zhang, Ming Zu (Emerson) Jaspal Subhlok is a Professor of Computer Science and Electrical and Computer Engineering at the University of Houston. He has served as the Chair of the Computer Science Department since from 2010-2019. His research interests are primarily focused on Parallel and Distributed Computing and Educational Technologies. He is a recipient of the University of Houston Teaching Excellence Award for Innovative Educational Technologies. He has also received the UH Department of Computer Science awards for Excellence in Teaching, Excellence in Research, as well as Excellence in Service. He was the co founder and CEO of Videopoints LLC (2016-2022), and he co-hosted a radio show called Border Crossings from 2002 to 2008. Blog Musings Link to profile by Rice University Making Informed Decisions about Advanced Degrees",
  "content_length": 3068,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:58"
}