{
  "name": "Jassim Happa",
  "homepage": "https://pure.royalholloway.ac.uk/en/persons/jassim-happa",
  "status": "success",
  "content": "Jassim Happa - Royal Holloway Research Portal Jassim Happa Dr Senior Lecturer in Information Security, Department of Information Security https://orcid.org/0000-0002-0860-5130 Phone+44 1784 276863EmailJassim.Happarhul.acuk TW20 0EX Personal profile Personal profileDr Jassim Happa has an extensive research background in both cyber security and computer graphics. His research focuses on developing tools and methods to support human and machine decision making. In cyber security his research topics include: visual analytics, resilience, network defences with machine learning, Cyber Threat Intelligence (CTI), privacy and human factors. In computer graphics, his research topics include: high-fidelity rendering, virtual archaeology, high dynamic range imaging, data visualization and human-computer interaction. Education/Academic qualificationEngineering, PhD, High-Fidelity Rendering and Display of Cultural Heritage, University of WarwickAward Date: 23 Apr 2012Computing Science, BSc, University of East AngliaAward Date: 18 Jul 2006 External positionsVisiting Lecturer, University of Oxford1 Sept 2019 → 1 Oct 2022 Research output 23 Article 11 Conference contribution 4 Paper 2 Chapter 1 More 1 Book Research output per year Research output per year Cyber Security Foundations: Fundamentals, technology and societyMartin, K. M., Happa, J., Mersinas, K. & Schmitz, G., 3 Mar 2025, London: Kogan Page. 287 p.Research output: Book/Report › Book From Embodied Abuse to Mass Disruption: Generative, Inter-Reality Threats in Social, Mixed-Reality PlatformsBaldry, M. K., Happa, J., Steed, A., Smith, S. & Glencross, M., 9 Dec 2024, In: Digital Threats: Research and Practice. 5, 4, 36 p., 38.Research output: Contribution to journal › Article › peer-review Open Access ViLanIoT: A visual language for improving Internet of Things systems representationGómez-Cabrera, A., Escamilla-Ambrosio, P. J. & Happa, J., Mar 2024, In: Journal of Industrial Information Integration. 38, 22 p., 100567.Research output: Contribution to journal › Article › peer-review Open AccessFile 85 Downloads (Pure) Detecting CAN Attacks on J1939 and NMEA 2000 NetworksRogers, M., Weigand, P., Happa, J. & Rasmussen, K., 14 Jun 2022, (E-pub ahead of print) In: IEEE Transactions on Dependable and Secure Computing.Research output: Contribution to journal › Article › peer-review Open AccessFile 241 Downloads (Pure) Assessing a Decision Support Tool for SOC AnalystsHappa, J., Agrafiotis, I., Helmhout, M., Bashford-Rogers, T., Goldsmith, M. & Creese, S., 8 Jun 2021, In: Digital Threats: Research and Practice. 2, 3Research output: Contribution to journal › Article › peer-review Open Access View all 41 research outputs Projects 1 Active Projects per year ResilMesh: Situation Aware enabled Cyber Resilience for Dispersed, Heterogenous Cyber SystemsHappa, J. (PI) & Mersinas, K. (CoI)UK Research and Innovation UKRI1/10/23 → 30/09/26Project: Research",
  "content_length": 2929,
  "method": "requests",
  "crawl_time": "2025-12-01 13:27:58"
}