{
  "name": "Javed Khan",
  "homepage": "http://www.cs.kent.edu/~javed",
  "status": "success",
  "content": "Javed's MCS Home Page Courses Research interest Graduate students Personal research pages Research Publications More Publications (older) Research links Kent State University Kent State Computer Science Kent State Calender Kent Schedule of Courses Contact info/Office hours javed@kent.edu Page last updated August  24, 2012 Dr. Javed I. Khan Professor & Chair Department of Computer Science Kent State University Research Interest: Applying multi-area expertise in cross-cutting problems in networking and communication. Recent topics are concurrent networking, network  based systems and applications, semantic composition, complex community, man/machine symbiotic communication. Other interests include active & programmable networking, parallel and distributed computing, video/image transmission and communication, MPEG, video/ image database, complex system exploration and visualization, content-based image search, associative information retrieval, medical imaging, PACS, holographic associative memory, fault-tolerant parallel algorithms. Laboratory: Media Communications and Networking Research Laboratory Research Profile: To get a research profile click here. Graduate Thesis/Topics: Information for graduate students searching for research area/topics Opportunities Upcoming Courses in Internetworking and WWW Graduate Affairs (CPT, Thesis, Rules etc.) Research Labs: Networking and Media Communications Research Lab | [Mirror Site] MEDIANET Collaboration Server | [Mirror Site] Internet Teaching Lab (ITL) Student Research Portal Activities Guest Editor, Disruptive Networking [DOI] Guest Editor, Foundation of Peer-to-Peer Systems [DOI] [call for paper] Guest Editor, Active and Programmable Internet [call for paper] Editor: International Jounral of Distance Education Technologies NASA Space Internet (SI) Workshop New Vision in Large Scale Netwoking (LSN) IEEE Technical Committee on The Internet Interest/Expertise Medical Systems Networking (DICOM, PACS, HL7), Medical Imaging Video Security, Extreme Networking, Monitoring, Transcoding (MPEG-2, MPEG-7, HDT) ISP Traffic Engineering (BGP), Web based Enterprize Systems & Services, International Research & Education Networks, Digital Library, LMS, Digital Campus. Courses: Semester Title Fall 2013 CS 6/75995 Foundation of Peer-to-Peer & Cyber Community Computing Fall 2012 CS 6/75995 Foundation of Peer-to-Peer & Cyber Community Computing Spring 2012 CS 4/55231 Internet Engineering Fall 2011 CS 4/55201 Computer Networks Spring 2011 CS 6/75995 Complex Networks Fall 2010 CS 4/55201 Computer Networks Spring 2010 CS 6/75995 Foundation of Peer-to-Peer Computing CS 4/53201 Operating Systems Fall 2009 CS 4/55201 Computer Networks CS 4/55231 Internet Engineering Spring 2009 CS 6/75995 Complex Networks CS 4/55201 Computer Networks Fall 2008 CS 4/55201 Computer Networks Spring 2008 CS 6/75995 Foundation of Peer-to-Peer Computing CS 4/55201 Computer Networks Fall 2007 CS 4/55231 Internet Engineering CS 4/55201 Computer Networks Spring 2007 CS 4/56101 Design and Analysis of Algorithms CS 4/55201 Computer Networks Fall 2006 CS 4/55201 Computer Networks CS 4/56101 Design and Analysis of Algorithms Spring 2006 CS 6/75995 Internet  Based Applications Systems Design CS 4/53201 Operating Systems Spring 2005 CS 4/55231 Internet Engineering Fall 2004 CS 6/75995 Internet  Based Applications Systems Design Spring 2004 CS 4/55231 Internet Engineering Fall 2003 CS 6/75995 Internet  Based Applications Systems Design Spring 2003 CS 4/55231 Internet Engineering Spring 2002 CS 4/53201 Operating Systems CS 4/59995 Internet Engineering Fall 2001 CS 6/75995 Internet  Based Applications Systems Design Fall 2000 CS 4/55201 Computer Networks Spring 2000 CS 4/59995 Internet Engineering CS 4/56101 Design and Analysis of Algorithms CS 85991 Networking Seminar Fall 1999 CS 4/56101 Design and Analysis of Algorithms Spring 99 CS 6/75995 Internet  Based Applications & Systems Design CS 4/56101 Design and Analysis of Algorithms Fall 98 CS 4/55201 Computer Networks CS 4/54201 Artificial Intelligence CS 6/79995 ST: Intelligent Systems Summer 98 CS 4/59995 Internet Engineering CS 4/53201 Operating Systems Spring 98 CS 4/53201 Operating Systems Links: Scientific American Internet-2 IEEE Internet Project MISSION Holographic Associative Computing Holographic associative memory Holographic medical image archive Live Camera Hawaii East West Center Alumni University of Hawaii College of Engineering Homepage UH Parallel and Intelligent Systems Lab BUET Links ORCA Links More  Links: Contact Card: OHIO HAWAII",
  "content_length": 4569,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:02"
}