{
  "name": "Javier Andrade Garda",
  "homepage": "https://pdi.udc.es/en/File/Pdi/7379E",
  "status": "success",
  "content": "Javier Andrade Garda File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Laboratorio de Ingeniería del Software Research lines Ingeniería del Software, Análisis, Conceptualización, Gestión del Conocimiento, Metodologías, Marcos Metodológicos, Informática en Medio Ambiente Keywords Ingeniería del Software, Análisis, Conceptualización, Gestión del Conocimiento, Metodologías, Marcos Metodológicos, Informática en Medio Ambiente Contacto UDC directory Orcid id0000-0002-9630-2534 ResearcherIDU-8124-2018 Scopus7201722058 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Master's Dissertation Master's in Computer Engineering Compulsory 0 2.5 Project Management Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 89.5 Quality Assurance Degree in Computer Engineering Master's in Computer Engineering Optional 0 93 Work Placement Degree in Data Science and Engineering Compulsory 0 5 Subject and involved studies Type Distance hours Total hours Project Management Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 83.5 Quality Assurance Degree in Computer Engineering Master's in Computer Engineering Optional 0 72 Work Placement Degree in Data Science and Engineering Compulsory 0 4 Subject and involved studies Type Distance hours Total hours Project Management Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 79.5 Quality Assurance Degree in Computer Engineering Master's in Computer Engineering Optional 0 72 Work Placement Degree in Data Science and Engineering Compulsory 0 3 Subject and involved studies Type Distance hours Total hours AI Project Management Master's Degree in Artificial Intelligence Compulsory 0 0 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 8 Project Management Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 90 Quality Assurance Degree in Computer Engineering Master's in Computer Engineering Optional 0 72 Subject and involved studies Type Distance hours Total hours Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 8 Project Management Degree in Computer Engineering Master's in Computer Engineering Master's in Computer Engineering Compulsory 0 90 Quality Assurance Degree in Computer Engineering Master's in Computer Engineering Master's in Computer Engineering Optional 0 93 Subject and involved studies Type Distance hours Total hours Project Management Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 102 Quality Assurance Degree in Computer Engineering Master's in Computer Engineering Optional 0 72 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Monday 08:30 a 09:30 Despacho 3.08 1st quarter Monday 10:30 a 11:30 Despacho 3.08 1st quarter Monday 12:30 a 13:30 Despacho 3.08 1st quarter Thursday 13:30 a 14:30 Despacho 3.08 1st quarter Thursday 09:30 a 10:30 Despacho 3.08 1st quarter Thursday 11:30 a 12:30 Despacho 3.08 2nd quarter Tuesday 08:30 a 11:30 Despacho 3.08 2nd quarter Wednesday 11:30 a 13:00 Despacho 3.08 2nd quarter Thursday 11:30 a 13:00 Despacho 3.08 EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2024/2025 2020/2021 2019/2020 2015/2016 Study and implementation of SDUI architecture to improve dynamic content in Inditex's e-commerce Design and implementation of a REST API using .NET to mange the insurance policies of a bank institution Development of the backend of a Life and Payment Protection Insurance Application Human resources management subsystem in Odoo for a hydrocarbon distribution company Web-platform to support the study of the uncertainties associated to the aerosol radiative forcing Web platform for the management of sampling campaigns and their environmental data Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Complete books Book chapters PhD theses directed Conference papers 2025 2023 2022 2020 2019 ... 2018 2017 2015 2013 2010 2008 2007 2006 2005 2004 2003 1999 1995 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Elisabeth Alonso Blanco Type Proyecto Programas Nacionales Dates From 01/09/2025 to 31/08/2028 Funding entity Ministerio de Ciencia e Innovación Main researches MUNIATEGUI LORENZO, SOLEDAD (IP1) / ANDRADE GARDA JOSÉ M (IP2). Type Proyecto Programas Nacionales Dates From 01/09/2023 to 31/08/2026 Funding entity MINISTERIO DE DEFENSA Main researches Alejandro Pazos Sierra Type Contrato Dates From 17/11/2023 to 17/11/2027 Funding entity Xunta de Galicia (Consellería de Política Social e Xuventude) Main researches Javier Andrade Garda y Víctor Manuel Carneiro Díaz Type Proyecto Programas Autonomicos Dates From 01/12/2023 to 30/09/2024 Funding entity Ministerio de Ciencia e Innovación Main researches Begoña Artíñano Rodríguez de Torres y Francisco J. Gómez Moreno Type Proyecto Programas Nacionales Dates From 01/09/2022 to 31/08/2025 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Francisco J. Gómez Moreno Type Proyecto Programas Nacionales Dates From 01/01/2020 to 31/12/2022 Funding entity AUTORIDAD PORTUARIA DE A CORUÑA Main researches Víctor Manuel Carneiro Díaz y Javier Andrade Garda Type Contrato Dates From 02/03/2020 to 01/03/2021 Funding entity ODEENE Ingeniería Main researches José Carlos Dafonte Vázquez / Víctor Carneiro Díaz Type Contrato Dates From 15/06/2020 to 15/03/2021 Funding entity ODEENE Ingeniería Main researches José Carlos Dafonte Vázquez / Víctor Carneiro Díaz Type Contrato Dates From 01/08/2020 to 30/04/2021 Funding entity AUTORIDAD PORTUARIA DE A CORUÑA Main researches Víctor Manuel Carneiro Díaz y Javier Andrade Garda Type Contrato Dates From 07/12/2020 to 06/12/2021 Funding entity BETMEDIA SOLUCIONES S.L. (Grupo PRISA) Main researches Javier Andrade Garda (responsable de Ingeniería del Software) y José Carlos Dafonte Vázquez (responsable de Ingeniería de Sistemas) Type Contrato Dates From 01/01/2019 to 31/05/2019 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Begoña Artíñano Rodríguez de Torres y Francisco J. Gómez Moreno Type Proyecto Programas Nacionales Dates From 01/01/2018 to 30/09/2021 Funding entity Universidad Técnica de Machala Main researches Jennifer Célleri Pacheco Type Proyecto Internacional Dates From 01/07/2017 to 01/07/2018 Funding entity MINISTERIO DE DEFENSA Main researches Alejandro Pazos Sierra Type Contrato Dates From 20/12/2017 to 20/12/2020 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches Begoña Artíñano Rodríguez de Torres y Francisco J. Gómez Moreno Type Proyecto Programas Nacionales Dates From 01/01/2015 to 31/12/2017 Funding entity Ministerio de Defensa Main researches Alejandro Pazos Sierra Type Contrato Dates From 03/01/2013 to 03/01/2015 Funding entity Ministerio de Defensa Main researches Alejandro Pazos Sierra Type Contrato Dates From 29/09/2010 to 29/09/2012 Funding entity MINISTERIO DE DEFENSA Type Contrato Dates From 02/09/2008 to 02/09/2010 Funding entity INSTITUTO NACIONAL DE ADMINISTRACIÓN PÚBLICA (INAP) Main researches Fernando Alonso Amo y Juan Pazos Sierra Type Contrato Dates From 25/03/2008 to 31/12/2008 Funding entity Dirección Xeral de Investigación, Desenvolvemento e Innovación Main researches José Manuel Andrade Garda Type Proyecto Programas Autonomicos Dates From 04/12/2007 to 04/12/2009 Funding entity INSTITUTO NACIONAL DE ADMINISTRACIÓN PÚBLICA (INAP) Main researches Fernando Alonso Amo y Juan Pazos Sierra Type Contrato Dates From 09/04/2007 to 31/12/2007 Funding entity MINISTERIO DE DEFENSA Type Contrato Dates From 01/01/2006 to 01/01/2007 Funding entity INSTITUTO NACIONAL DE ADMINISTRACIÓN PÚBLICA (INAP) Main researches Fernando Alonso Amo y Juan Pazos Sierra Type Contrato Dates From 30/05/2006 to 31/12/2006 Funding entity CONSELLERÍA DE INNOVACIÓN E INDUSTRIA Main researches Eloy Eduardo Fernández Corral (por el I.M.Q. San Rafael) y Alejandro Pazos Sierra (por la Universidade da Coruña) Type Proyecto Programas Autonomicos Dates From 01/07/2005 to 30/09/2008 Funding entity Secretaría de Estado de Investigación, Desarrollo e Innovación (Ministerio de Economía, Industria y Competitividad-MEIC) Main researches Juan Manuel Ares Casal Type Proyecto Programas Nacionales Dates From 01/07/2005 to 31/10/2005 Funding entity INSTITUTO NACIONAL DE ADMINISTRACIÓN PÚBLICA (INAP) Main researches Fernando Alonso Amo y Juan Pazos Sierra Type Contrato Dates From 26/05/2005 to 31/12/2005 Funding entity Universidade da Coruña (UDC) Main researches Javier Andrade Garda Type Proyecto Otros Programas Dates From 01/07/2004 to 30/06/2005 Funding entity Secretaria Xeral de Investigación e Desenvolvemento Tecnolóxico Main researches Rafael García Vázquez Type Proyecto Programas Autonomicos Dates From 15/07/2003 to 14/07/2005 Funding entity Universidade da Coruña (UDC) Main researches Santiago Rodríguez Yáñez Type Proyecto Otros Programas Dates From 01/07/2003 to 30/06/2004 Funding entity Universidade da Coruña (UDC) Main researches Marta López Fernández Type Proyecto Otros Programas Dates From 06/05/1999 to 06/05/2000 Funding entity Dirección Xeral de Universidades Main researches Guillermo Rojo Sánchez Type Proyecto Programas Autonomicos Dates From 01/01/1995 to 31/12/1996 2020 2017 2011 2010 2009 ... 2005 2004 Type Software Registrado Entity Universidade da Coruña (UDC) Authors Víctor Carneiro, Laura V. Vigoya, Fidel Cacheda Seijo, Di",
  "content_length": 30989,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:05"
}