{
  "name": "Javid Taheri",
  "homepage": "https://pure.qub.ac.uk/en/persons/javid-taheri",
  "status": "success",
  "content": "Javid Taheri - Queen's University Belfast Javid Taheri public CV View Scopus Profile Javid Taheri Professor Professor, School of Electronics, Electrical Engineering and Computer Science https://orcid.org/0000-0001-9194-010X Emailjavid.taheriqub.acuk 20132024 Research activity per year Personal profile KeywordsQA75 Electronic computers. Computer scienceCloud ComputingEdge and Fog ComputingDistributed and Parallel ComputingHigh Performance ComputingVirtualization TechniquesSoftware-Defined NetworkingResource Allocation and Scheduling AlgorithmsOptimization TechniquesArtificial Intelligence (Neural Networks, Fuzzy, etc)Machine Learning Fingerprint Dive into the research topics where Javid Taheri is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Edge Computing Computer Science 100% Microservice Computer Science 68% Cloud Infrastructure Computer Science 49% Resource Utilisation Computer Science 49% Resource Allocation Computer Science 49% task-scheduling Computer Science 46% Workflows Computer Science 45% Internet of Things Computer Science 45% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2013 2021 2022 2023 2024 21 Article 19 Conference contribution 3 Book 1 Editorial Research output per year Research output per year Cost-effective and robust service provisioning in multi-access edge computingXiang, Z., Zheng, Y., Wang, D., Taheri, J., Zheng, Z. & Guo, M., 13 Aug 2024, In: IEEE Transactions on Parallel and Distributed Systems. 35, 10, p. 1765-1779 15 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Multi-Access Edge Computing 100% Edge Computing 100% Resource Allocation 66% Scheduling Strategy 66% Computing Technology 33% 3 Citations (Scopus) 20 Downloads (Pure) Graph attention networks and deep Q-learning for service mesh optimization: a digital twinning approachKhan, M. G., Taheri, J., Kassler, A. & Asl, A. B., 20 Aug 2024, ICC 2024 - IEEE International Conference on Communications: Proceedings. Valenti, M., Reed, D. & Torres, M. (eds.). Institute of Electrical and Electronics Engineers Inc., p. 2913-2918 6 p. (IEEE International Conference on Communications).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Attention (Machine Learning) 100% Microservice 100% Graph Representation 33% Performance Optimization 33% Representation Learning 33% 20 Downloads (Pure) Optimizing service placement in edge-to-cloud AR/VR systems using a multi-objective genetic algorithmHerabad, M. G., Taheri, J., Ahmed, B. S. & Curescu, C., 15 Aug 2024, Proceedings of the 14th International Conference on Cloud Computing and Services Science, CLOSER 2024. van Steen, M. & Pahl, C. (eds.). Science and Technology Publications, Lda, Vol. 1. p. 77-91 15 p. (International Conference on Cloud Computing and Services Science, CLOSER - Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Virtual Reality System 100% Augmented Reality 100% multi-objective evolutionary algorithm 100% Response Time 50% Virtual Reality 33% 2 Citations (Scopus) 18 Downloads (Pure) Security, reliability, cost, and energy-aware scheduling of real-time workflows in compute-continuum environmentsTaghinezhad-Niar, A. & Taheri, J., 06 Sept 2024, In: IEEE Transactions on Cloud Computing. 12, 3, p. 954-965Research output: Contribution to journal › Article › peer-review Open AccessFile Energy Consumption 100% Resource Configuration 33% Scheduling Algorithm 33% Computing Environment 33% Security Requirements 33% 13 Citations (Scopus) 25 Downloads (Pure) Using machine learning to predict the exact resource usage of microservice chainsTaheri, J., Gördén, A. & Al-Dulaimy, A., 04 Apr 2024, UCC '23: Proceedings of the IEEE/ACM 16th International Conference on Utility and Cloud Computing. Association for Computing Machinery, p. 1–9 (Proceedings of the IEEE/ACM 16th International Conference on Utility and Cloud Computing).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Kubernetes 100% Microservice 100% Machine Learning 100% Resource Usage 100% Data Preprocessing 100% 87 Downloads (Pure) View all 44 research outputs Prizes Best Demo Award in the IEEE-NFV-SDN conferenceTaheri, J. (Recipient), 2018Prize: Prize (including medals and awards) Best Paper Award in the IEEE NoF conferenceTaheri, J. (Recipient), 2018Prize: Prize (including medals and awards) Best Poster Award in the Information Processing in Sensor Networks (IPSN)Taheri, J. (Recipient), 2020Prize: Prize (including medals and awards) IEEE Outstanding Paper Award from the IEEE Transactions on Industrial InformaticsTaheri, J. (Recipient), 2021Prize: Prize (including medals and awards) IEEE Senior MemberTaheri, J. (Recipient), 2021Prize: National/international honour View all 9 prizes",
  "content_length": 5311,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:02"
}