{
  "name": "Javier Andreu-Perez",
  "homepage": "https://www.essex.ac.uk/people/andre09407/javier-andreu-perez",
  "status": "success",
  "content": "Javier Andreu-Perez | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Javier Andreu People Dr Javier Andreu-Perez Reader School of Computer Science and Electronic Engineering (CSEE) Email j.andreu-perez@essex.ac.uk Location 5B.542, Colchester Campus Academic support hours 3pm-5pm Tuesday (4285295445) Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Dr Andreu-Perez, Reader (Associate Professor) in Human-Centred Artificial Intelligence is a British computer scientist (born in Malaga, Spain). He also chairs the Smart Health Technologies Group at the Centre for Computational Intelligence. He holds a PhD (2012) in Intelligent Systems from Lancaster University (Bowland College), United Kingdom. Javier was also awarded a Senior Talentia Fellow and an Invitational Fellowship of Japan's Society for the Promotion of Science. Before joining the University of Essex, Javier held research staff positions at Imperial College London and Lancaster University. He has also been a visiting academic fellow of the Faculty of Health (St Mary's Hospital) at Imperial College London. He has contributed to a number of research projects funded by the EU, NHS, the UK’s Ministry of Defence (MoD), as well as the industry. Javier's fundamental science research is actively supported by UK Governmental agencies, foundations, trusts and charities. He is a Senior Member of the IEEE Society in Computational Intelligence, has co-edited special issues in the area and published highly cited papers in top journals and conferences in the area of artificial intelligence and health informatics. His research work has been licensed by UK FTSE companies such as GlaxoSmithKline plc. Furthermore, he actively participates in knowledge transfer programs with SMEs to help UK companies to innovate. These companies are from various domains, such as robotics, intelligent systems and machines, IoT, health and big data analytics. Beyond the financial benefits, Javier also contributes to the analysis and discussion of Responsible AI frameworks for intelligent systems that can collaborate with humans in a meaningful and safe way. Javier serves as an editorial board member of prestigious journals in artificial intelligence (AI), and he acts as associate Editor-in-Chief for the journal Neurocomputing (Elsevier). He regularly chairs special sessions at renowned world conferences (IEEE-FUZZ and WCCI). He is currently leading an international Scientific IEEE Task Force on uncertainty models for computing with words. He actively participates in public engagement activities such as open days, showcases, and professional gatherings from other disciplines. His main research focus is fundamental research questions of artificial intelligence, machine learning and their applications in engineering, bioengineering, health informatics, human-robot interaction, computer vision, smart sensing & industrial informatics. Favourite quote: “Everything is theoretically impossible until it is done.” – Robert A. Heinlein. Qualifications PhD In Intelligent Systems (Artificial Intelligence) Lancaster University, Appointments University of Essex Reader, School of Computer Science and Electronic Engineeringg, University of Essex (1/3/2025 - present) Senior Lecturer, School of Computer Science and Electronic Engineering, University of Essex (1/10/2019 - present) Lecturer, School of Computer Science and Electronic Engineering, University of Essex (1/9/2017 - 1/10/2019) Other academic Research scientist, Department of Computing, Imperial College London (1/12/2012 - 1/12/2017) Research and professional activities Research interests Continual Learning Key words: Artificial Intelligence Open to supervise Biomedical Informatics Key words: Artificial intelligence Open to supervise Cognitive Computing Key words: Brain Sciences Large Vision Models (LVMs) Open to supervise Large Language Models (LLMs) Key words: Artificial Intelligence Open to supervise Generative AI Key words: Artificial Intelligence Open to supervise Soft Computing Open to supervise Human centred Artificial Intelligence Key words: Artificial Intelligence Open to supervise Agentic AI Key words: Artificial Intelligence Open to supervise Physical AI Key words: Artificial Intelligence Open to supervise Conferences and presentations Competition Chair for Clinical BCI Challenge Invited presentation, IEEE World Congress on Computational Intelligence (WCCI), 19/7/2020 Chair Special Session of Fuzzy Systems for Brain Sciences and Brain-Computer Interfaces (BCI) under uncertainty Invited presentation, IEEE World Congres on Computational Intelligence 2020, 19/1/2020 Keynote on Developing fine-grained actigraphy’s for rheumatoid arthritis patient Keynote presentation, 1st Digital Rheumatoid Arthritis, Lausanne, Switzerland, 1/2/2019 Teaching and supervision Current teaching responsibilities Introduction to Data Science (CE207) Current supervision Rusul Raeed Qasim Degree subject: Computer Science Degree type: Doctor of Philosophy Rusul Raeed Qasim Qasim Degree subject: Computer Science Degree type: Doctor of Philosophy Nikolaos Gkatzoulis Degree subject: Artificial Intelligence Degree type: Doctor of Philosophy Mohammadreza Jamalifard Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Abbas Salami Thesis title: Explainable Deep Learning-Based Eeg Analysis for Biomarker Discovery and its Application on Depersonalisation/Derealisation Disorder Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 4/7/2023 Mariha Tahsin Thesis title: Micro and Macro Indexes of Economic Activity: Multiple Indicators and Multiple Methods Using Bangladesh as a Test Case Degree subject: Economics Degree type: Doctor of Philosophy Awarded date: 11/10/2022 Mehrin Kiani Thesis title: Explainable Artificial Intelligence for Functional Brain Development Analysis: Methods and Applications. Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 6/7/2022 Publications Publications (10) Balsamo, D., Offeddu, V., Aghamohammadi, Z., Chiavenna, C., Leone, LP., D’Agnese, E., Sharma, D., Torbica, A., Shayegh, S., Andreu-Perez, J. and Melegaro, A., (2025). Mapping Inequities in Global Vaccine Sentiment Research Fumanal-Idocin, J., Fernandez-Peralta, R. and Andreu-Perez, J., (2025). Compact Rule-Based Classifier Learning via Gradient Descent Ramos-Cruz, B., Andréu-Pérez, J., Quesada, FJ. and Martínez, L., (2024). Fuzzychain: An Equitable Consensus Mechanism for Blockchain Networks. Jamalifard, M., Andreu-Perez, J., Hagras, H. and López, LM., (2024). Fuzzy Norm-Explicit Product Quantization for Recommender Systems Flores, C., Contreras, M., Macedo, I. and Andreu-Perez, J., (2024). Transfer Learning with Active Sampling for Rapid Training and Calibration in BCI-P300 Across Health States and Multi-centre Data Miranda, JA., López-Ongil, C. and Andreu-Perez, J., (2023). Personalised and Adjustable Interval Type-2 Fuzzy-Based PPG Quality Assessment for the Edge Córdova, JC., Flores, C. and Andreu-Perez, J., (2023). EMGTFNet: Fuzzy Vision Transformer to decode Upperlimb sEMG signals for Hand Gestures Recognition Fumanal-Idocin, J., Andreu-Perez, J., Cordón, O., Hagras, H. and Bustince, H., (2023). ARTxAI: Explainable Artificial Intelligence Curates Deep Representation Learning for Artistic Images using Fuzzy Techniques Kiani, M., Andreu-Perez, J. and Hagras, H., (2022). A Temporal Type-2 Fuzzy System for Time-dependent Explainable Artificial Intelligence Filippetti, ML., Andreu-Perez, J., Klerk, CD., Richmond, C. and Rigato, S., (2022). Are advanced methods necessary to improve infant fNIRS data analysis? An assessment of baseline-corrected averaging, general linear model (GLM) and multivariate pattern analysis (MVPA) based approaches Show all Journal articles (58) Urio-Larrea, A., ANDREU-PEREZ, J. and Pereira Dimuro, G., (2025). Data stream clustering: introducing recursively extendable aggregation functions for incremental cluster fusion processes. IEEE Transactions on Cybernetics. 55 (3), 1421-1435 Jones, B., Waterworth, S., Rogerson, M., ANDREU-PEREZ, J., Moran, J., Cooper, C., Adams, T., Hope, E., Singh, J., Neary, P., Perrett, J. and Jamalifrard, M., (2025). Cerebral haemodynamic assessment following sport-related concussion (mild traumatic brain injury) in youth and amateur rugby union players. Sports Medicine - Open. 11 (1), 47- Ramos-Cruz, J., ANDREU-PEREZ, J., Quesada, FJ. and Martínez, L., (2025). Fuzzychain: An Equitable Consensus Mechanism for Blockchain Networks. Journal of Network and Computer Applications. 241, 104204-104204 Fumanal-Idocin, J. and Andreu-Perez, J., (2025). Reliable Classification with Conformal Learning and Interval-Type 2 Fuzzy Sets.. CoRR. abs/2504.15360 Fernandez-Peralta, R., Fumanal-Idocin, J. and Andreu-Perez, J., (2025). Crisp complexity of fuzzy classifiers.. CoRR. abs/2504.157",
  "content_length": 33889,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:02"
}