{
  "name": "Javier Ruiz-Hidalgo",
  "homepage": "https://imatge.upc.edu/web/people/javier-ruiz-hidalgo",
  "status": "success",
  "content": "Javier Ruiz Hidalgo | Image Processing Group Skip to main content Image Processing Group Signal Theory and Communications Department Universitat Politècnica de Catalunya. BARCELONATECH People Publications Projects Demos Teaching Contact Search form Search User login Log in using UPC credentials Log in using UPC credentials Log in using UPC credentials Username * Password * Log in using UPC credentials Cancel CAS login Javier Ruiz Hidalgo Position e-mail Associate Professor j.ruiz@upc.edu Office Phone D5-009 (Barcelona - ETSETB) +34 9373 98980 Journals Books Conferences Theses Other Projects Research Demos Teaching Biography Javier Ruiz Hidalgo received a degree in Telecommunications Engineering at the Universitat Politècnica de Catalunya (UPC), Barcelona, Spain in 1997. From 1998 to 1999, he developed an MSc by Research on the field of Computer Vision by the University of East Anglia (UEA) in Norwich, UK. During 1999 he joined the Image Processing Group at UPC working on image and video indexing in the context of the MPEG-7 standard. In 2006, he received his PhD. in the field of image processing. Since 1999 he has been involved in various European Projects as a researcher from the Image Processing Group at UPC. During 1999 and 2000 he worked in the ACTS(AC308) DICEMAN project developing new descriptors and representations for image and video sequences. Since 2001 he is also involved in the IST/FET(2000-26467) project MASCOT developing an efficient compression scheme exploiting metadata information. In 2009 he worked as principal researcher for the national project HESPERIA involved in improving the security of large infrastructures such as airports and power plants. From 2010 to 2013 he was principal researcher for the EU project FASCINATE working on interactive human computer interfaces using 3D data. During 2017 to 2021 he was the principal researcher for the national project MALEGRA developing tools combining graph signal representation and processing ideas with machine learning technology. Since 2001 he is an Associate Professor at the Universitat Politècnica de Catalunya. He is currently lecturing on the area of digital signal and systems, image processing and computer vision. His current research interests include 3D video coding and analysis, graph neural networks, conditional generative networks and super-resolution. Journal Articles top 2025 A. Solé, Mosella-Montoro, A., Cardona, J., Gómez-Coca, S., Aravena, D., Ruiz, E., and Ruiz-Hidalgo, J., “A Cartesian Encoding Graph Neural Network for Crystal Structures Property Prediction: Application to Thermal Ellipsoid Estimation”, Digital Discovery, 2025.DOI Google Scholar BibTex (10.39 MB) J. Cardona, Solé, A., Mella, P., Aravena, D., Ruiz-Hidalgo, J., Gómez-Coca, S., and Ruiz, E., “Exploring Hyperfine Coupling in Molecular Qubits”, Chemical Science, no. 16, pp. 11291 - 11303, 2025.DOI Google Scholar BibTex (8.11 MB) M. Wang, Li, D., Casas, J., and Ruiz-Hidalgo, J., “Adaptive Fusion of LiDAR Features for 3D Object Detection in Autonomous Driving”, Sensors, vol. 25, no. 13, 2025.DOI Google Scholar BibTex (4.09 MB) 2024 J. Gené-Mola, Ferrer-Ferrer, M., Hemming, J., Dalfsen, P., Hoog, D., Sanz-Cortiella, R., Rosell-Polo, J. R., Morros, J. R., Vilaplana, V., Ruiz-Hidalgo, J., and Gregorio, E., “AmodalAppleSize_RGB-D dataset: RGB-D images of apple trees annotated with modal and amodal segmentation masks for fruit detection, visibility and size estimation”, Data in Brief, vol. 52, 2024.DOI Google Scholar BibTex 2023 J. Gené-Mola, Ferrer-Ferrer, M., Gregorio, E., Blok, P. M., Hemming, J., Morros, J. R., Rosell-Polo, J. R., Vilaplana, V., and Ruiz-Hidalgo, J., “Looking behind occlusions: A study on amodal segmentation for robust on-tree apple fruit size estimation”, Computers and Electronics in Agriculture, vol. 209, 2023.DOI Google Scholar BibTex (9.02 MB) see all Book Chapters and Bookstop 2014 O. Schreer, Macq, J., Niamut, O., Ruiz-Hidalgo, J., Shirley, B., Thallinger, G., and Thomas, G., Media Production, Delivery and Interaction for Platform Independent Systems, vol. ISBN 978-1-118-60533-2. Wiley, ISBN 978-1-118-60533-2, 2014.Google Scholar BibTex 2009 F. Marqués, Menezes, M., and Ruiz-Hidalgo, J., “How are digital TV programs compressed to allow broadcasting?”, in Applied signal processing, T. Dutoit and Marqués, F. 2009, pp. 311–359.Google Scholar BibTex F. Marqués, Menezes, M., and Ruiz-Hidalgo, J., “How are digital images compressed in the web?”, in Applied signal processing, T. Dutoit and Marqués, F. 2009, pp. 265–310.Google Scholar BibTex 2006 J. Neumann, Casas, J., Macho, D., and Ruiz-Hidalgo, J., “Multimodal Integration of Sensor Network”, in Artificial Intelligence Applications and Innovations, vol. 204, Boston: Springer, 2006, pp. 312–323.DOI Google Scholar BibTex Conference Papers top 2025 J. Lo Anguera, Lázaro, J. A., Ruiz-Hidalgo, J., Solé, A., Casas, J., Sarmiento, S., and Lerín, A., “Quantum Machine Learning for Intrusion Detection in Software-Defined Networks”, in 1st Intl. Workshop on Quantum Computing and Artificial Intelligence (QC+AI 2025) , Philadelphia, 2025.Google Scholar BibTex (851.1 KB) J. Lo Anguera, Ruiz-Hidalgo, J., Solé, A., Casas, J., Lázaro, J. A., Sarmiento, S., and Lerín, A., “Leveraging Quantum Machine Learning for Intrusion Detection in Software-Defined Networks”, in IEEE International Conference on Machine Learning for Communication and Networking, Barcelona, 2025.DOI Google Scholar BibTex (1.41 MB) J. Antonio Lázaro, Casas, J., Royo, S., Ruiz-Hidalgo, J., Fàbrega, J. M., Martínez, R., Renaudier, J., Mardoyan, H., Jensen, J. B., Altabás, J. A., García-Gómez, P., Riu, J., Baskopoulos, P., Kalavrouziotis, D., Syrivelis, D., C. de Beeck, O., Theodoropoulou, E., Lyberopoulos, G., and Thor, J., “Verifying Key Performance Indicators across Multiple 6G-EWOC Demonstrations”, in European Conference on Networks and Communications (EuCNC) , Poznan, Poland, 2025.Google Scholar BibTex (333.96 KB) 2024 J. A. Lázaro, Casas, J., Ruiz-Hidalgo, J., Cortada-Garcia, M., Martín-Pey, G., Salavedra-Pujol, J., Wang, M., Theodoropoulou, E., Lyberopoulos, G., García-Gómez, P., Royo, S., Riu, J., Marcus, C., Eriksson, O., Schrenk, B., and Fàbrega, J. M., “6G-EWOC: Crowdsourced SLAM Data Fusion for Safe and Efficient ADAS Driving”, in IEEE Future Networks World Forum: Symposium on Future Networks for Connected and Automated Mobility , Dubai, 2024.DOI Google Scholar BibTex (2.73 MB) 2023 C. Hurtado, Shekkizhar, S., Ruiz-Hidalgo, J., and Ortega, A., “Study of Manifold Geometry using Multiscale Non-Negative Kernel Graphs”, in IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), Rhodes Island, Greece, 2023.DOI Google Scholar BibTex (1.4 MB) see all Theses top 2023 A. Mosella-Montoro, “Graph Convolutional Neural Networks for 3D Data Analysis”, Universitat Politècnica de Catalunya, Barcelona, 2023.Google Scholar BibTex 2020 A. Pujol-Miró, “Learning to extract features for 2D-3D multimodal registration”, Universitat Politècnica de Catalunya (UPC), 2020.Google Scholar BibTex (14.22 MB) 2017 E. Perez-Pellitero, “Manifold Learning for Super Resolution”, Leibniz Universität Hannover, Hannover, 2017.Google Scholar BibTex (18.6 MB) M. Maceira, “Multi-view depth coding based on a region representation combining color and depth information”, Universitat Politècnica de Catalunya (UPC), 2017.Google Scholar BibTex (15.24 MB) 2013 X. Suau, “Human body analysis using depth data”, Universitat Politècnica de Catalunya (UPC), 2013.Google Scholar BibTex (10.67 MB) see all Other top 2022 R. Terradas, Domingo, P., Grau, M., Alarcón, E., and Ruiz-Hidalgo, J., “A method, system and computer programs to automatically transform an image”, 2022.Google Scholar BibTex Patent 2021 D. Bonet, “Improved Neural Network Generalization using Channel-Wise NNK Graph Constructions”. Final Year Project, UPC, 2021.Google Scholar BibTex (3.67 MB) Unpublished 2018 E. Perez-Pellitero, Salvador, J., Ruiz-Hidalgo, J., and Rosenhahn, B., “Method for upscaling an image and apparatus for upscaling an image”, U.S. Patent US 20170132759 A12018.Google Scholar BibTex Patent 1999 J. Ruiz-Hidalgo, “The representation of images using scale trees”, University of East Anglia, 1999.Google Scholar BibTex (2.33 MB) Report Projects top Collaborative heterogeneous 3D scene representations for Urban Mobility National Sep 2025 Aug 2028 Smart digital solutions for multimodal, accessible, resilient, user-centric urban infrastructure European Jul 2025 Jul 2028 AI-Enhanced Fiber-Wireless Optical 6G Network in Support for Connected Mobility European Jan 2024 Dec 2026 DeeLight: Efficient Deep Learning for Video Sequences and Point Clouds National Sep 2021 Aug 2025 Generación automática de estadísticas y vídeos para la mejora deportiva de equipos semiprofesionales mediante IA Other Jan 2023 Jun 2024 see all Research Areas top Region-based image and video processing Internal Jan 1992 Dec 2020 Multiview Coding Internal Jul 2010 Jul 2018 Multi-view/Multi-sensor scene capture, analysis and representation Internal Mar 2004 Nov 2015 Demos and Resources top Correspondence matching in unorganized 3D point clouds using Convolutional Neural Networks Software Oct 2018 Spatio-Temporal Road Detection from Aerial Imagery using CNNs - Dataset Dataset Dec 2016 Registration of images to unorganized 3D point clouds using contour cues Software Sep 2016 Interactive registration for 3D data fusion Demo Jul 2016 Interactive registration for 3D data fusion Demo Jul 2016 see all Teaching top Acronym Title Level College PAE Advanced Project in Science and Telecommunication Technologies (CDIO) 3rd year Telecom BCN - ETSETB IHCV C1. Introduction to Humand and Computer Vision Master in Computer Vision (MCV) UAB, UB, UOC, UPC & UPF 3DV C4. 3D Vision Master in Computer Vision (MCV) UAB, UB, UOC, UPC & UPF CVDL Computer Vision with Deep Learning Master in Telecommunications Engineering (MET) ETSETB - Telecom BCN IPSAV Introdu",
  "content_length": 10232,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:06"
}