{
  "name": "Jay-Yoon Lee",
  "homepage": "https://www.skiml.snu.ac.kr/members",
  "status": "success",
  "content": "SKI-ML - MembersSearch this siteEmbedded FilesSkip to main contentSkip to navigationMembersFacultyJay-Yoon LeeAssistant Professor, Graduate School of Data Science, Seoul National UniversityPostdoctoral Research Associate under Professor Andrew McCallum, UMass AmherstPh.D. in Computer Science, Carnegie Mellon University M.S. in Computer Science, Carnegie Mellon University B.S. in Electrical Engineering, KAISTGraduate StudentsYunju ChoPh.D. StudentB.S./M.S. in Industrial Engineering, POSTECHTime Series, Multi-view ConsistencyJiyong AnPh.D. StudentM.S. in Data Science, SNUB.S. in Information Systems, Univ. of IllinoisMedical NLP, RAGHyeryung SonPh.D. StudentM.S. in Data Science, SNUB.A. in Economics, Dartmouth CollegeControlled Text Generation, Computational Methods for Neuroscience/PsychologyMooho SongPh.D. StudentM.S. in Data Science, SNUB.S. in Mathematics Education, SNUNeuro-Symbolic AI, Structured Prediction, Logical Reasoning, Constraint InjectionYeonsung KimPh.D. StudentB.S. in Electronic Engineering, Hanyang Univ.Changhee ChoPh.D. StudentB.A. in Philosophy, Computer Science, Sogang Univ. LLM-Human Alignment, Controllable LMYezun ChungPh.D. StudentB.S. in School of Computing, KAISTInformation RetrievalChiho SongPh.D. StudentB.S. in Computer Science, Purdue Univ.Gahyun YooPh.D. StudentB.A. in Linguistics, Computer Science , SNUMachine Translation, Diffusion ModelsJeongseok OhM.S. StudentB.S. in Industrial Engineering, Hanyang Univ.Self-consistency for Consistent OutputJunha KimM.S. StudentB.S. in Earth and Environmental Science, Minor in Computer Science and Engineering, SNUSSM, Timeseries ForecastingJi Woo KimM.S. StudentB.S. in Computer Science, Carnegie Mellon Univ.SSM, AI for ScienceSung Geun AnM.S. StudentB.A. in Geography Education, SNUHyeonje ChoiM.S. StudentB.S. in Cyber Defencse, Financial Engineering, Korea Univ.Suji GwakM.S. StudentB.S. in Atmospheric Sciences, Yonsei Univ.Cellular modelingSeona OhM.S. StudentB.A. in Economics, Computational Sciences, SNUJongbin WonM.S. StudentB.A. in Linguistics, Artificial Intelligence, Korea Univ.RAGJaehoon JeongM.S. StudentB.S. in Public Administration and Criminal Intelligence Analysis, Korean National Police Univ.LLM in Legal ApplicationsSolbee ChoM.S. StudentB.S. in Computer Science, Sookmyung Women's Univ.RAGSu-Young JinM.S. StudentB.S. in Life Sciences, Statistics, Ewha Womans Univ.Seung-Woo ChoiM.S. StudentB.A. in Economics, Information Science & Culture, SNUInternsJaewan ParkComputer Science and Engineering, SNUHyeseo JeonEnglish Language & Literature, Computer Science & Engineering,Korea Univ.MyeongSeop KimApplied Aritificial Intelligence, Sungkyunkwan Univ.SeonHo YooIndustrial Management Engineering, Korea Univ.AlumniYikyung Kim, Hanjun Cho, Seong-il Park, Kiseung Kim, Yunseub Kim, Hyewon JeonGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2876,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:07"
}