{
  "name": "Jay Sarraf",
  "homepage": "https://cse.kiit.ac.in/profiles/jay-sarraf",
  "status": "success",
  "content": "Jay Sarraf - KIIT School of Computer Engineering Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Jay Sarraf Jay Sarraf Assistant ProfessorDr. Jay Sarraf currently works as an Assistant Professor at the School of Computer Engineering, KIIT University. With more than 7 years of experience supporting marketing and development to enhance internal processes for small firms, he is a multifaceted, self-starter, and trustworthy IT specialist. His research areas focus on the brain-computer interface and signal and image processing. Dr. Sarraf is also a passionate public speaker and motivator. Dr. Jay Sarraf has a strong commitment to social work. He thinks that working with the underprivileged population through socialist practises can bring about change. He adheres to the teachings of Dr. Achyuta Samanta, who seeks to end hunger and poverty by ensuring that everyone has access to education. In order to preserve, preach, and teach the philosophy of Art of Giving for the underprivileged community through technical, mental, and physical processes, Dr. Sarraf has organized social events involving his students and served as an influential activist for the social welfare of people. He also served as a Kickstarter for various welfare programmes. Profile LinksEmail :[email protected]Website :jsarraf.comScopus Id :57189071980Google Scholar :https://scholar.google.co.in/citations?user=Jr7fbNEAAAAJ Social LinksProfileRecent PublicationsProfileEducational QualificationPh.D. in Computer Science & EngineeringResearch Interests Signal & Image Processing Brain Computer Interface Cloud Computing Web Technology Administrative Responsibility Member, Student Counselling Committee MembershipsMember IET UKOutreach Activity1. Faculty coordinator for Art of Giving 2. Khwaab societyRecent PublicationsJournals/Conferences :1. Sarraf, J, & Pattnaik, P. K.(2018). Brain-Computer Interface issues on hand movement. Journal of King Saud University-Computer and Information Sciences, 30(1), 18-24. 2. Sarraf, J., Chakrabarty, S., & Pattnaik, P. K. (2017). EEG Based Oscitancy Classification System for Accidental Prevention. In Proceedings of the 5th International Conference on Frontiers in Intelligent Computing: Theory and Applications (pp. 235-243). Springer, Singapore. 3. Sarraf J., Priyadarshini I., Pattnaik P.K. (2016) Real Time Bus Monitoring System. In: Satapathy S., Mandal J., Udgata S., Bhateja V. (eds) Information Systems Design and Intelligent Applications. Advances in Intelligent Systems and Computing, vol 433. Springer, New Delhi 4. Priyadarshini I., Sarraf J. (2017) Smart and Accountable Water Distribution for Rural Development. In: Satapathy S., Bhateja V., Udgata S., Pattnaik P. (eds) Proceedings of the 5th International Conference on Frontiers in Intelligent Computing: Theory and Applications. Advances in Intelligent Systems and Computing, vol 515. Springer, Singapore 5. Sarraf, Jay, and Pattnaik, P. K. \"A study of classification techniques on P300 speller dataset.\" Materials Today: Proceedings (2021). 6. Sarraf, Jay, and Pattnaik, P. K. “Analysis of Motor Imagery EEG signal classification based on amplitude based Peak detection method and Pisarenko Harmonic Decomposition”, Journal of Theoretical and Applied Information Technology 7. Sarraf, Jay, Chakraborty, S and Pattnaik, P. K. “Comparative Analysis of Motor imagery EEG Signals using Discrete Wavelet Transform and Peak Detection Method”. Journal of Critical Reivews, VOL 7, ISSUE 19, 2020 8. Vaibhaw, Behera, P., Bal, V., Sarraf, J. (2022). Early Detection of Parkinson’s Disease as a Pre-diagnosis Tool Using Various Classification Techniques on Vocal Features. In: Bapi, R., Kulkarni, S., Mohalik, S., Peri, S. (eds) Distributed Computing and Intelligent Technology. ICDCIT 2022. Lecture Notes in Computer Science(), vol 13145. Springer, Cham. 9. Sarraf, J., Vaibhaw, Chakraborty, S., Pattnaik, P.K. (2021). Detection of Network Intrusion and Classification of Cyberattack Using Machine Learning Algorithms: A Multistage Classifier Approach. In: Pattnaik, P.K., Sain, M., Al-Absi, A.A., Kumar, P. (eds) Proceedings of International Conference on Smart Computing and Cyber Security. SMARTCYBER 2020. Lecture Notes in Networks and Systems, vol 149. Springer, Singapore. 10. Vaibhaw, Sarraf, J., Pattnaik, P.K. (2022). Early Detection of Botnet Based Attacks Using Various Classification Techniques on Traffic Behavioral Features. In: Pattnaik, P.K., Sain, M., Al-Absi, A.A. (eds) Proceedings of 2nd International Conference on Smart Computing and Cyber Security. SMARTCYBER 2021. Lecture Notes in Networks and Systems, vol 395. Springer, Singapore. https://doi.org/10.1007/978-981-16-9480-6_20 Books :1. Pattnaik, P. K., Swetapadma, A., & Sarraf, J. (2018). Expert System Techniques in Biomedical Science Practice (pp. 1-280). Hershey, PA: IGI Global. doi:10.4018/978-1-5225-5149-2 sachi2022-08-17T22:28:10+05:30 Page load link Go to Top",
  "content_length": 4985,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:08"
}