{
  "name": "Jay Ligatti",
  "homepage": "http://www.cse.usf.edu/~ligatti",
  "status": "success",
  "content": "Jay Ligatti Content Research Interests Publications Teaching Current Students Former Students Talks Research interests Software security and programming languages Publications, arranged by Publication date: 2025-2022, 2021-2018, 2017-2014, 2013-2010, 2009-2006, 2005-2002 ▶ 2025 Measuring the Absolute and Relative Prevalence of SQL Concatenations and SQL-Identifier Injections. Parisa Momeni*, Gabriel Laverghetta*, Kevin Dennis, Bianca Dehann, and Jay Ligatti. Communications in Computer and Information Science (CCIS). Springer. To appear. Preliminary local version containing an old abstract. SQL-Identifier Injection Vulnerabilities (SQL-IDIVs) are a class of SQL Injection Vulnerabilities (SQLIVs) that originate from the insertion of user-specified SQL identifiers into SQL code. SQL-IDIVs are noteworthy because prepared statements - the standard defense against SQLIVs - do not support placeholders for SQL identifiers. We verified this incompleteness of prepared statements through a survey of 10 public prepared statement implementations, finding that all of these implementations lack support for identifier insertion. This article measures the absolute prevalence of concatenation into SQL statements and SQL-IDIVs via what is, as far as we know, the most comprehensive study of publicly available code ever conducted. Using our automated GitHub crawler program, we obtained 4,762,175 source code files from 944,316 GitHub projects to uncover instances of concatenation into SQL statements. Our crawler program classified whether each concatenation constitutes a potential SQL-IDIV. The crawler flagged 63% of the obtained files as containing at least one instance of SQL statement concatenation. Of these files that concatenate into SQL code, 15% contain SQL-identifier concatenation. We manually verified these results, finding that our SQL-IDIV classifier exhibits an accuracy of 93.4%. In addition, we attempted to exploit a subset of the manually verified applications, finding that about 22.7% of these web applications meet all the additional requirements to be exploitable in practice via SQL-identifier injection. We also investigated the prevalence of SQL-IDIVs relative to other software vulnerabilities by analyzing all 3,757 CVE reports of SQLIVs published in 2022-2023, and finding that at least 8% of these reports pertain to SQL-IDIVs. We observed that the prevalence of SQL-IDIVs has risen from 2022 to 2023. Based on these results, we conclude that SQL-IDIVs are nontrivially represented in publicly available code and public vulnerability records. [Abstract] Toward satisfactory public accessibility: A crowdsourcing approach through online reviews to inclusive urban design. Lingyao Li, Songhua Hu, Yinpei Dai, Min Deng, Parisa Momeni, Gabriel Laverghetta, Lizhou Fan, Zihui Ma, Xi Wang, Siyuan Ma, Jay Ligatti, and Libby Hemphill. Computers, Environment and Urban Systems, Vol 122. Elsevier, December 2025. Preventing Variadic Function Attacks Through Argument Width Counting. Brennan Ravenscroft*, Kevin Dennis*, Gabriel Laverghetta, Parisa Momeni, and Jay Ligatti. Studies in Computational Intelligence (SCI), Vol 1193, pp 1-17. Springer, April 2025. Local version. Variadic-function attacks and format-string attacks continue to threaten modern C/C++ software applications. When successfully executed, attackers are able to read, write, or execute arbitrary program memory. To address the problem of variadic-function attacks, this paper proposes Argument Width Counting (AWC), a new memory access-control policy that, when enforced, mitigates all observed variadic-function attacks, including format-string attacks, by tracking the initial size of variadic arguments on the stack and limiting requests to this number of bytes. A prototype for AWC has been implemented and evaluated on LLVMâs Clang C/C++ compiler and the accompanying libc++ standard library. The implementation modifies the compilerâs function-generation code to store variadic argument widths and to validate these values later when variadic arguments are accessed. The prototype's performance overhead was tested and compared to existing solutions. The prototype incurs low overhead and outperforms the existing solutions. Microbenchmarking AWC returns around 22% overhead for 0 to 16 arguments. The overhead is less than 1% when benchmarked on real-world programs. [Abstract] Technology Ownership, Use, and Perceptions of Web-based Program Design Features for Older Adults Prescribed Oral Anticancer Medication. Victoria Marshall, Melody Chavez, Tina Mason, Martine Extermann, Lanie Simon, Jay Ligatti, Usha Menon, Laura Szalacha. Journal of Geriatric Oncology, Vol 16, No 2. Elsevier, March 2025. ▶ 2024 Large-Scale Analysis of GitHub and CVEs to Determine Prevalence of SQL Concatenations. Kevin Dennis, Bianca Dehaan, Parisa Momeni, Gabriel Laverghetta, and Jay Ligatti. Proceedings of the International Conference on Security and Cryptography (SECRYPT), July 2024. Local version. SQL Injection Attacks (SQLIAs) remain one of the top security risks in modern web applications. Vulnerabilities to SQLIAs arise when applications concatenate unsanitized input into dynamically constructed SQL statements. The standard technique for mitigating SQLIAs---using prepared statements---avoids concatenating unsanitized inputs into SQL statements. To investigate the prevalence of SQL concatenations in real code, we conducted what is, to our knowledge, the largest analysis of open-source software to date. We crawled 4,762,175 files in 944,316 projects on GitHub and classified whether the code constructs SQL statements using concatenation operators. When a SQL statement is constructed via concatenation, we further classified whether the concatenation is into a portion of the SQL statement reserved for an identifier, such as a table or column name. This further classification is of interest because existing public prepared-statement implementations do not allow dynamic insertion of identifiers. Because existing public implementations cannot insert identifiers into prepared statements, programmers have no choice but to concatenate dynamically determined identifiers directly into SQL statements. If any such concatenated identifier is not sanitized prior to concatenation, a SQLIA is possible. This kind of SQLIA is called a SQL Identifier Injection Attack (SQL-IDIA). Our automated GitHub crawler and analyzer classified 42% of Java, 91% of PHP, and 56% of C# web-application files as constructing SQL statements via concatenation. It further found that 27% of the Java, 6% of the PHP, and 22% of the C# files that concatenate to construct SQL statements concatenate identifiers. Manual analysis of a random sampling of these files indicates that the automated SQL-IDIA classifier achieved an overall accuracy of 93.4%. Further vulnerability testing suggests approximately 22.7% of the web applications meet all of the additional requirements to be exploitable in practice via a SQL-IDIA. PHP applications were particularly exploitable, with 38% of applications being exploitable in practice. [Abstract] Preventing Variadic Function Attacks Through Argument Width Counting. Brennan Ward*, Kevin Dennis*, Gabriel Laverghetta, Parisa Momeni, and Jay Ligatti. IEEE/ACIS International Conference on Software Engineering, Management and Applications (SERA), May 2024. Invited to appear in Springer's Studies in Computational Intelligence (SCI). Variadic-function attacks and format-string attacks continue to threaten modern C/C++ software applications. When successfully executed, attackers are able to read, write, or execute arbitrary program memory. While such attacks are well-known, and a number of mitigating techniques have been proposed, the only widely adopted mitigations are compiler warnings. These warnings are an incomplete solution because they rely on programmers to take action. To address the problem of variadic-function attacks, this paper proposes Argument Width Counting (AWC), a new memory access-control policy that, when enforced, mitigates all observed variadic-function attacks, including format-string attacks. AWC tracks the initial width or size of variadic arguments allocated on the stack and requires that variadic functions cannot request more bytes than initially allocated. When enforced, this policy limits variadic functions to the segments of memory allocated to the variadic arguments. A prototype for AWC has been implemented and evaluated on LLVMâs Clang C/C++ compiler and the accompanying libc++ standard library. The implementation modifies the compiler's function-generation code to store variadic argument widths and to validate these values later when variadic arguments are accessed. As part of the evaluation, the prototype's performance overhead was tested and compared to existing solutions. Due to the simplicity of the related calculations and checks, the prototype incurs low overhead and outperforms the existing lightweight solutions. Microbenchmarking AWC returns around 22% overhead for 0 to 16 arguments. This overhead is less than 1% when benchmarked on real-world programs. [Abstract] A Preliminary Study on Using Large Language Models in Software Pentesting. Kumar Shashwat, Francis Hahn, Xinming Ou, Dmitry Goldgof, Lawrence Hall, Jay Ligatti, S. Raj Rajgopalan, Armin Ziaie Tabari. Proceedings of the Workshop on SOC Operations and Construction (WOSOC), February 2024. Large language models (LLM) are perceived to offer promising potentials for automating security tasks, such as those found in security operation centers (SOCs). As a first step towards evaluating this perceived potential, we investigate the use of LLMs in software pentesting, where the main task is to automatically identify software security vulnerabilities in source code. We hypothesize that an LLM-based AI agent can be improved over time for a specific security task as human operators interact with it. Such improvement can be made, as a first",
  "content_length": 187565,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:10"
}