{
  "name": "Jay McCarthy",
  "homepage": "https://jeapostrophe.github.io/home",
  "status": "success",
  "content": "Jay McCarthy►Jay Mc  Carthy1 About Me2 Research Interests3 Publications4 Students5 Teaching6 Service7 Projects8 Personal9 Links10 Contact11 PGP Public KeyOn this page:Jay Mc  Carthy1 About Me2 Research Interests3 Publications4 Students5 Teaching5.1 Archived Courses from Vassar5.2 Archived Courses from BYU6 Service7 Projects7.1 Current7.2 Past8 Personal9 Links10 Contact11 PGP Public Key    contents Jay McCarthy1 About MeI am the CTO and co-founder of Reach. Previously, I was an associate professor at the University of Massachusetts at Lowell in the Computer Science Department. Before that, I was at Brigham Young University and then Vassar College.I am a member of the PLT research group. I work on the Racket programming language.I completed a Ph.D. at Brown University in the Computer Science Department. I worked with Shriram Krishnamurthi. I was an NSF Graduate Research Fellow.I graduated from the University of Massachusetts at Lowell where I studied Computer Science, Mathematics, and Economics.My work has been supported by the National Science Foundation’s Software and Hardware Foundations (CISE/CCF) program, Secure and Trustworthy Cyberspace (SaTC) program, and Computing Education for the 21st Century (CISE/CNS) program.2 Research InterestsI am interested in applying programming languages research techniques to cryptographic protocols and the Web, as well as other areas of security and systems. I am also very interested in theorem provers and program verification.3 PublicationsMatthew Flatt, Taylor Allred, Nia Angle, Stephen De Gabrielle, Robert Bruce Finder, Jack Firth, Kiran Gopinathan, Ben Greenman, Siddhartha Kasivajhula, Alex Knauth, Jay McCarthy, Sam Phillips, Sorawee Porncharoenwase, Jens Axel Søgaard, and Sam Tobin-Hochstadt. “Rhombus: A New Spin on Macros Without All the Parentheses”. OOPSLA 2023. (PDF)Kimball Germane and Jay McCarthy. “Newly-Single and Loving It: Improving Higher-Order Must-Alias Analysis with Heap Fragments”. ICFP 2021. (Publisher) (PDF)Ralph D. Clifford, Firas Khatib, Trina Kershaw, Kavitha Chandra, and Jay McCarthy. “Brief of Amicus Curiae Interdisciplinary Research Team on Programmer Creativity Addressing Expressions and Ideas”. Google LLC vs Oracle America, Inc. in the Supreme Court of the United States (18-956, 2020). (Publisher) (PDF)Radha Nakade, Eric Mercer, Peter Aldous, Kyle Storey, Benjamin Ogles, Joshua Hooker, Sheridan Jacob Powell, and Jay McCarthy. “Model Checking Task Parallel Programs for Data-race”. Innovations in Systems and Software Engineering 2019. (PDF)Kimball Germane, Jay McCarthy, Michael Adams, and Matthew Might. “Demand Control-Flow Analysis”. VMCAI 2019.Matthias Felleisen, Robert Bruce Findler, Matthew Flatt, Shriram Krishnamurthi, Eli Barzilay, Jay McCarthy, and Sam Tobin-Hochstadt. “A Programmable Programming Language”. Communications of the ACM, March 2018. (Publisher) (Slides)Radha Nakade, Eric Mercer, Peter Aldous and Jay McCarthy. “Model Checking Task Parallel Programs for Data-race”. NASA Formal Methods Symposium 2018.Max S. New, Burke Fetscher, Jay McCarthy, and Robert Bruce Findler. “Fair Enumeration Combinators”. Journal of Functional Programming 27, e19, 2017. (Publisher) (PDF) (Code)Jay McCarthy, Burke Fetscher, Max New, Daniel Felty, and Robert Bruce Findler. “A Coq Library For Internal Verification of Running-Times”. Science of Computer Programming 2017. (Publisher) (PDF) (Code)Jay McCarthy. “Bithoven: Gödel Encoding of Chamber Music and Functional 8-Bit Audio Synthesis”. FARM 2016. (PDF) (Code)Jay McCarthy, Burke Fetscher, Max New and Robert Bruce Findler. “A Coq Library For Internal Verification of Running-Times”. FLOPS 2016. (PDF) (Code)Helen H. Hu, Cecily Heiner, and Jay McCarthy. “Deploying Exploring Computer Science Statewide”. SIGCSE 2016. (PDF)Matthias Felleisen, Robert Bruce Findler, Matthew Flatt, Shriram Krishnamurthi, Jay McCarthy, and Sam Tobin-Hochstadt. “The Racket Manifesto”. SNAPL 2015. (PDF)Neil Toronto, Jay McCarthy, and David Van Horn. “Running Probabilistic Programs Backwards”. ESOP 2015. (PDF)Neil Toronto and Jay McCarthy. “Practically Accurate Floating-Point Math”. Computing in Science and Engineering, July 2014. (Publisher) (PDF)Yu Huang, Eric Mercer, and Jay McCarthy. “Proving MCAPI Executions are Correct using SMT”. ASE 2013. (PDF)Gregory H. Cooper, Arjun Guha, Shriram Krishnamurthi, Jay McCarthy, and Robert Bruce Findler. “Teaching Garbage Collection without Learning Compilers or Interpreters”. SIGCSE 2013. (PDF)Neil Toronto and Jay McCarthy. “Computing in Cantor’s Paradise with LambdaZFC”. FLOPS 2012. (PDF) (Code) (Slides)Everett Morse, Nick Vrvilo, Eric Mercer, and Jay McCarthy. “Modeling Asynchronous Message Passing for C Programs”. VMCAI 2012. (PDF) (Code)Casey Klein, John Clements, Christos Dimoulas, Carl Eastlund, Matthias Felleisen, Matthew Flatt, Jay McCarthy, Jon Rafkind, Sam Tobin-Hochstadt, Robert Bruce Findler. “Run Your Research: On the Effectiveness of Lightweight Mechanization”. Symposium on Principles of Programming Languages, 2012. (PDF) (Code)Casey Klein, Jay McCarthy, Steven Jaconette and Robert Bruce Findler. “A Semantics for Context-Sensitive Reduction Semantics”. Asian Symposium on Programming Languages and Systems, 2011. (PDF) (Code)Tim Disney, Cormac Flanagan, and Jay McCarthy. “Temporal Higher-Order Contracts”. International Conference on Functional Programming, 2011. (PDF) (Code) (Slides)Neil Toronto and Jay McCarthy. “From Bayesian Notation to Pure Racket via Discrete Measure-Theoretic Probability in LambdaZFC”. Symposium on Implementation and Application of Functional Languages, 2011. (PDF) (Slides)Jay McCarthy. “The Two-State Solution: Native and Serializable Continuations Accord”. International Conference on Object Oriented Programming, Systems, Languages and Applications, 2010. (PDF) (Code)Jay McCarthy and Shriram Krishnamurthi. “Trusted Multiplexing of Cryptographic Protocols”. International Workshop on Formal Aspects in Security and Trust, 2009. (PDF) (Code)Jay McCarthy. “Automatically RESTful Web Applications Or, Marking Modular Serializable Continuations”. International Conference on Functional Programming, 2009. (PDF) (Code)Jay McCarthy. “Static Analyses of Cryptographic Protocols”. PhD Dissertation, Brown University, 2009. (PDF) (Code)Jay McCarthy and Shriram Krishnamurthi. “Cryptographic Protocol Explication and End-Point Projection”. European Symposium on Research in Computer Security, 2008. (PDF) (Code)Jay McCarthy and Shriram Krishnamurthi. “Minimal Backups of Cryptographic Protocol Runs”. Formal Methods in Security Engineering, 2008. (PDF) (Code)Jay McCarthy, Joshua Guttman, John Ramsdell, and Shriram Krishnamurthi. “Compiling Cryptographic Protocols for Deployment on the Web”. International World Wide Web Conference, 2007. (PDF) (Code)Shriram Krishnamurthi, Fiona Hopkins, Jay McCarthy, Paul T. Graunke, Greg Pettyjohn, and Matthias Felleisen. “Implementation and Use of the PLT Scheme Web Server”. Higher-Order and Symbolic Computation, 2007. (PDF) (Code)Jay McCarthy and Shriram Krishnamurthi. “Interaction-Safe State for the Web”. In Scheme and Functional Programming, September 2006. (PDF) (Code)4 StudentsConor Finegan (PhD, Fall 2018–Spring 2020)Chike Abuah (PhD, Fall 2018)Lindsey Reams (PhD, Fall 2016–Fall 2018)Srividya Kuppa (MS, Fall 2016–Spring 2017)Gerald Pipes (Ugrad, Fall 2016–Spring 2017) (now: Software Engineer at Carbonite)Blake Johnson (MS, Winter 2010–Fall 2014) (now: Software Engineer at Flexport)Project: Racket DemodularizerNick Shelley (Ugrad, Fall 2010) (MS, Winter 2011–Summer 2014) (now: Senior iOS Developer at Ancestry)MS Thesis: Autocompletion Without Static TypingNeil Toronto (PhD, Summer 2008–Summer 2014) (now: Microsoft Research Cambridge)PhD Thesis: Trustworthy, Useful Languages for Probablistic Modeling and Inference (Defense)Christine Unsicker (nee Kendall) (Ugrad, Fall 2013-Winter 2014) (now: Online Adjunct Instructor at BYU-Idaho)Project: How Students Learn to Debug and Dynamic Interactive Programming.Andrew Kent (PhD, Spring 2013–Winter 2014) (now: CS PhD student at Indiana University)Trevor Oakes (Ugrad, Spring 2012–Fall 2013)Alicia Wood (nee Crowder) (Ugrad, Spring 2013–Summer 2013) (now: Software Engineer at Adobe)Project: Exploring Computer Science, Unit 5 revisions for Utah Exploring Computer Science InitiativeLogan Kearsley (Ugrad, Winter 2013) (now: Computational Linguistics grad student at BYU)Project: Implementing a Vau-based Language With Multiple Evaluation StrategiesSean Reque (MS, Winter 2010–Winter 2013) (now: Software Reliability Engineer at Fitbit)MS Thesis: An Optimized R5RS Macro Expander (code)Dan Burton (Ugrad, Winter 2012–Fall 2013) (now: Clojure Developer at Funding Circle US)Project: Type Class-style Generics for RacketChase White (Ugrad, Spring 2012–Fall 2013) (now: Software Engineer at Restaurant365)Project: Verified Linear Logic Theorem ProverKimball Germane (MS, Winter 2012–Fall 2012) (now: CS PhD student at University of Utah)MS Thesis: A CPS-like Transformation of Continuation MarksPeter Aldous (Ugrad, Winter 2010–Summer 2010) (now: Postdoc at BYU)Undergrad Honors Thesis: Parallelization of tasks without a priori knowledge of their dependenciesRenae McDougal (nee Ferguson) (Ugrad, Winter 2010) (now: User Experience Designer at Qualtrics)Daniel Davis (Ugrad, Winter 2009–Winter 2010) (now: Software Engineer at L-3 Communications)Jensen Warnock (Ugrad, Winter 2009–Winter 2010) (now: Managing Director at Diversification Partners)5 Teaching2021 Fall:  304 - Foundations of Computer Science 2021 Fall:  301 - Organization of Programming Languages 2021 Spring:  406 - Compiler Construction 2020 Fall:  304 - Foundations of Computer Science (feedback)2020 Fall:  301 - Organization of Programming Languages (feedback)2020 Summer:  304 - Foundations of Computer Science 2020 Summer:  301 - Organization of Programming Languages 2019 Fall:  304 - Foundations of Computer Science (feedback)2019 Fall:  301 - Organization of Programming La",
  "content_length": 17007,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:06"
}