{
  "name": "Jayadev Misra",
  "homepage": "http://www.cs.utexas.edu/~misra",
  "status": "success",
  "content": "Jayadev Misra Jayadev Misra Schlumberger Centennial Chair Emeritus in Computer Science University Distinguished Teaching Professor Emeritus Email, Home Page, Full Vita email: \"The shorter one of my first and last names\"@utexas.edu This Home Page: http://www.cs.utexas.edu/users/misra Wikipedia Page Full Vita Address (I rarely check my mailbox) Jayadev Misra Dept. of Computer Science The University of Texas at Austin 2317 Speedway, Mail Stop D9500 Austin, Texas 78712-1757 Education B.Tech. (1969), Indian Institute of Technology, Kanpur, India Ph.D. (1972), Johns Hopkins University, Baltimore, Maryland Awards, Honors Member, National Academy of Engineering. Harry H. Goode Memorial Award, IEEE (jointly with K. Mani Chandy). Doctor Honoris Causa, Ecole Normale Superieure de Cachan, France. Regents' Outstanding Teaching Award, University of Texas. Distinguished Teaching Professor, University of Texas at Austin. Identified as a \"highly cited researcher\" by Thomson Reuters ISI, 2004. ACM Fellow. IEEE Fellow. IFIP Fellow. John Simon Guggenheim Fellow. Distinguished alumnus, I.I.T., Kanpur, India. Member, TAMEST (The Academy of Medicine, Engineering and Science of Texas). Summary of Research My interest is in applying formal methods in practice, particularly in the specifications and designs of concurrent systems. My current research is focussed on the design of a concurrent programming language, Orc. See http://orc.csres.utexas.edu Publications and Speeches Verfied Software: Theories, Tools and Experiments. A joint project with Tony Hoare. The Orc Project, a system for orchestrating concurrent and distributed computations Selected Publications and Books Notes on UNITY Unpublished Short Notes Texts of Speeches Slides used in Presentations Teaching I retired as of Sept. 1, 2015. I used to teach: CS 336 (Analysis of Algorithms) Class Handouts and Tests and Solutions CS 337 (Theory in Programming Practice) Class Handouts and Tests and Solutions and Other CS 380D (Distributed Computing) Class Home page for Fall 2009",
  "content_length": 2037,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:11"
}