{
  "name": "Jayant Taneja",
  "homepage": "http://www.jaytaneja.com",
  "status": "success",
  "content": "Jay Taneja @ STIMA Lab, UMass Amherst CICS Jay Taneja (he/his) Associate Professor, Computer Science Adjunct Associate Professor, Electrical and Computer Engineering University of Massachusetts - Amherst jtaneja@umass.edu - +1-413-545-6428 A267 Lederle Graduate Research Center 740 N. Pleasant Street, Amherst, MA 01003, U.S.A. ResearchGate - Google Scholar - LinkedIn I study the application of computing tools to measuring and managing infrastructure in industrialized and developing regions, including energy and building systems, but also transportation, water, and sanitation systems. In my work, I develop and apply embedded/IoT and mobile systems as well as machine learning techniques. I am always considering strong PhD students. Please write me a descriptive email with your interests and attach your CV. Research I direct the STIMA Lab (Systems Towards Infrastructure Measurement and Analytics Laboratory)  in the Manning College of Information and Computer Sciences @ UMass. Here are some current projects: Electricity Growth and Use In Developing Economies. Technology improvements in distributed generation, energy storage, and embedded systems have enabled a range of solar home systems and microgrids for providing electricity access to previously unelectrified households and communities. Though costs for these alternatives do not yet approach those of centralized electricity grids, the broader set of options available to utilities, policymakers, and other energy service providers places more emphasis on smart planning for growth in electricity consumption. However, there has been little research on projecting electricity consumption for households and communities that have not previously had access. We are addressing this shortcoming by partnering with electricity service companies to develop models for predicting growth in consumption in low-income communities, enabling better planning for utilities and entrepreneurs providing new access to electricity. We are also studying the impacts of reliability on consumption growth. Joint work with Columbia University, Carnegie Mellon University, and Colorado School of Mines. Smart Electricity Grids in sub-Saharan Africa. Electricity grids in low-income countries generally have little sensing at the edges of the network. As utilities elsewhere invest heavily in smart meters, utilities in these contexts are faced with the choice of installing smart meters to improve existing customers’ electricity supplies or extending the grid to new customers. This project aims to augment electricity systems by adding alternative means of sensing to improve grid operation and planning, obtaining some of the capabilities of smart meters at a fraction of the cost. Benefiting from the groundswell of low-cost smartphones with a wide array of sensors, we are building mobile and camera-based applications that enable continuous grid sensing where it did not previously exist, providing more granular insight into network conditions. This information can enable utilities to more quickly respond to power outages, prevent future outages, monitor power quality, and intelligently place future instrumentation. The computing challenges in this work center on predictive modeling using grid and mobile data as well as exploring new modalities such as computer vision. This work will extend towards other architectures for adding smart electricity services using commodity devices. Joint work with UC Berkeley. Demand Stimulation. Many newly-built grid and minigrid connections have low utilization. This stems from low incomes among customers, limited access to appliances, insufficient local economies, and poor electricity reliability, among other reasons. However, for electricity access to truly improve economic prospects, consumption will need to grow. In this project, we are studying active interventions that electricity service companies can use to grow consumption, both for their effects on people and their livelihoods as well as those on the sustainability of business models for providing electricity. Joint work with Carnegie Mellon University. Measuring Infrastructure Quality in Developing Regions. Enormous drives towards improving access to infrastructure in developing regions have resulted in larger road networks, more electricity connections, increasingly available financial services, and better education and health services in many settings. While there are still crucial gains to be made in each of these areas, an area that deserves equal or greater attention is the quality of the services that are being delivered. To help address this shortcoming, we are developing techniques to measure the quality of infrastructure, particularly roads and electricity systems, using remote sensing data and machine learning methods. With better measurement of the condition of roads and the reliability and quality of electricity supply, we can help to direct investments towards improving shortcomings, as well as create knowledge about the true economic value of these inputs. Joint work with the University of Washington. Students in the STIMA Lab STIMA Lab - Sept. 2019 (missing Simone!) PhD Mercy Kyatha Kiki Massa Bob Muhwezi Musaab Mohammed Ali Nana Sereboo Sylvia Imanirakiza Sanuratu Koroma Sam Osebe Tunmise Raji (@ RIT – Co-Advised with Nathan Williams) Master’s Anjali Anjali Undergraduate Nathan Ware Research Associate Stephen Lee Alumni Lefu Maqelepo (PhD., 2024, Rochester Institute of Technology – co-advised with Nathan Williams) – “Rural Electrification Subsidies: Quantification, Structure and Policy Implications” – Analyst, ISO-New England Aggrey Muhebwa (Ph.D., 2023, UMass Amherst, Electrical and Computer Engineering) – “Incorporating Machine Learning with Satellite Data to Support Critical Infrastructure Measurement and Sustainable Development” – Postdoctoral Fellow, Stanford University, Civil and Environmental Engineering Zeal Shah (Ph.D., 2023, UMass Amherst, Electrical and Computer Engineering) – “Side-Channel Measurement Techniques for Monitoring Electricity Grids” – Meta June Lukuyu (Ph.D., 2023, UMass Amherst, Electrical and Computer Engineering) – “Stimulating Electricity Demand to Enhance Sustainable Human Development in Sub-Saharan Africa” – Assistant Professor, University of Washington, Electrical and Computer Engineering Santiago Correa (Ph.D., 2022, UMass Amherst, Electrical and Computer Engineering) – “Models and Machine Learning Techniques for Improving the Planning and Operations of Electricity Systems in Developing Regions” – Data Scientist, BlocPower Simone Fobi (Ph.D., 2022, Columbia University, Mechanical Engineering – co-advised with Vijay Modi) – “Data-Driven Decision Support for Low Electricity Access Settings” – Research Scientist, Microsoft AI For Good Nathan Williams (Ph.D., 2017, Carnegie Mellon Engineering and Public Policy – co-advised with Paulina Jaramillo) – “Microgrid Utilities for Rural Electrification in East Africa: Challenges and Opportunities” – Faculty at Rochester Institute of Technology, Golisano Institute of Sustainability Daksha Naik (M.S., 2019, UMass Amherst, Electrical and Computer Engineering) – Modeling Grid Flexibility Potentials in Kenya: Industrial Demand Response and Electric Vehicles – Dräger Shuya Zhang (M.S., 2019, UMass Amherst, Electrical and Computer Engineering) – Control of Hybrid Minigrids for Energy Access Applications – Amazon Kyle Taubert (B.S., 2023, UMass Amherst, Electrical and Computer Engineering) – Identifying Locations of Sewer and Septic Sanitation Systems Using Street-Level Imagery Anvita Patel (B.S., 2022, UMass Amherst, Electrical and Computer Engineering) – Measuring Pollution from Diesel-Driven Irrigation using Satellite Data – Dell EMC Aidas Jakubenas (B.S., 2022, UMass Amherst, Electrical and Computer Engineering) – Characterizing Electricity Outages in New England – Cisco Berke Belge (B.S., 2022, UMass Amherst, Electrical and Computer Engineering) – Identifying Locations of Sewer Sanitation Systems Using Satellite Imagery – Dell EMC Xavier Farrell (B.S., 2021, UMass Amherst, Electrical and Computer Engineering) – Neighborhood-Scale Pollution Monitoring of Vehicles in Nairobi Using Satellite Data – U. of M*ch*g*n PhD Alex Yen (B.S., 2020, UMass Amherst, Electrical and Computer Engineering) – Measurement of AC Electricity Parameters Using Imagery – UCSD PhD Joe Breda (B.S., 2019, UMass Amherst, Electrical and Computer Engineering) – Side-channel Sensing on Smartphones: Power Quality and Ambient Temperature – UW (Washington) CSE PhD Ajey Pandey (B.S., 2019, UMass Amherst, Electrical and Computer Engineering) – Using Cameras to Help Map Power Grids – Cadmus Group –> Reading Municipal Light District CK Wijesundara (B.S., 2018, UMass Amherst, Electrical and Computer Engineering) – Using Smartphones to Determine Ambient Temperature – UMass CS M.S. –> Systems & Technology Research Teaching CICS 590X – Decarbonization and Data Science (F’23, F’24) ECE 597DE/697DE – Data-Enabled Electricity Networks (S’21, S’22) ECE 597ED/697ED – Electricity Infrastructure and Delivery in Developing Regions (F’17, F’18) ENG 100 – Introduction to Engineering (F’18, F’19, F’20, F’21, F’22) ECE 232 / ECE 331 – Hardware Organization and Design (S’17, S’18) Publications (many available for download at Google Scholar and ResearchGate) Tunmise Raji, Courage Ekoh, Jay Taneja, and Nathan Williams. “Paved with Good Reflections: Road Quality Mapping with Multispectral Satellite Imagery.” In the 11th ACM International Conference on Systems for Energy-Efficient Built Environments, Cities, and Transportation (BuildSys’24), November 2024. Lefu Maqelepo, Fhazhil Wamalwa, Jay Taneja, and Nathan Williams. “Two Sides of a Coin: Assessing Trade-offs Between Reliability and Profit in Mini Grids and the Policy Implications for Subsidies.” Applied Energy, 2024. June Lukuyu, Rebekah Shirley, and Jay Taneja. “Managing Grid Impacts From Increased Electric Vehicle Adoption in African ",
  "content_length": 32884,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:13"
}