{
  "name": "Jayant R. Haritsa",
  "homepage": "http://dsl.cds.iisc.ac.in/~haritsa",
  "status": "success",
  "content": "Jayant Haritsa Home Page Jayant R. Haritsa Senior Professor Department of Computational and Data Sciences (CDS) and Department of Computer Science and Automation (CSA) Indian Institute of Science (IISc) Bangalore, India [Research Interests] [Professional Activities] [Institute Activities] [History] [Honors] [Contact Information] Research Interests: Database Systems   (Design, Implementation and Testing of Database Engine Components) For details of my technical activities, see Database Systems Lab. The associated publications are available at Publications and (a subset) in my DBLP listing. ( Curriculum Vitae ) Current Professional Activities: General Co-Chair, SIGMOD 2026 Co-Chair, ACM PTF on Regional Offices Member, ACM India Awards Steering Committee Current Institute Activities: Convenor, Database Systems Lab, CDS/CSA Member, Faculty Recruitment Committee, CDS History: SSLC, Vijaya High School, Jayanagar, Bangalore Pre-University (Science), National College (Basavanagudi), Bangalore BTech (Electronics), Dept. of Electrical Engineering, Indian Institute of Technology (Madras) MS and PhD (Computer Science), Computer Sciences Department, University of Wisconsin (Madison) Research Fellow, Institute for Systems Research, University of Maryland (College Park) Honors: President, Association of Computing Machinery, India (ACMI), 2020-22 Fellow, Association of Computing Machinery (ACM), USA, 2015 Fellow, Institute of Electrical and Electronics Engineers (IEEE), USA, 2013 Fellow, Indian National Science Academy (INSA), 2020 Fellow, Indian Academy of Sciences (IASc), India, 2010 Fellow, Indian National Academy of Engineering (INAE), India, 2009 Fellow, The National Academy of Sciences (NASI), India, 2006 J C Bose National Fellow, DST, Govt. of India, 2015 IISc Alumni Award for Excellence in Research for Engineering, 2015 Distinguished Alumnus, Indian Institute of Technology (Madras), India, 2012 Infosys Prize (Engineering and Computer Science), Infosys Science Foundation, 2014 ACCS-CDAC Foundation Award, Advanced Computing and Communication Society, 2013 Shanti Swarup Bhatnagar Prize (Engineering Sciences), CSIR, Govt. of India, 2009 Hari Om Ashram Prerit Dr. Vikram Sarabhai Research Award (Electronics, Informatics, Telematics and Automation), PRL, Govt. of India, 2007 Swarnajayanti Fellowship (Engineering Sciences), DST, Govt. of India, 2002 Sir C V Raman Young Scientist Award (Computer Science), KSCST, Govt. of Karnataka, 2001 Research Awards from IBM, Google, Microsoft and HP PotPourri: Favorite Quotes: In Silicon Valley, if you stop for lunch, you will be lunch ! (Comment left on a blog article) IISc is an institution set up to provide a luxurious life for egotists and lunatics while they pretend to be professors. Of all the professors there, perhaps 1% make the grade to qualify as good human beings. (Comment left on a blog article) Education to the Indian middle class is largely a job ticket carried in a wallet, or a designer shirt flaunted at a party. Education is acquired and owned, it does not permeate and transform people. My Erdos number is 3. General Info: IISc IP Policy (by Intellectual Property Cell, IISc) PhD program in Computer Science (by Mor Harchol-Balter) Technical Writing (by Vikram Pudi) Contact Information Email haritsa@iisc.ac.in Alternate: jharitsa@gmail.com Office Room 222, CDS Telephone +91 (80) Direct 2293-2793 CDS 2360-0654   extn 222 Fax 2360-2648 Post Dept. of Computational & Data Sciences Indian Institute of Science Sir C V Raman Road Bangalore 560012 INDIA Bangalore Weather Bangalore Time Last updated on 01/10/2025",
  "content_length": 3603,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:10"
}