{
  "name": "Jean-Yves Potvin",
  "homepage": "http://www.iro.umontreal.ca/~potvin",
  "status": "success",
  "content": "Jean-Yves Potvin Département d'informatique et de recherche opérationnelle Jean-Yves Potvin Courrier électronique: potvin@iro.umontreal.ca Téléphone: (514) 343-7307 Télécopieur: (514) 343-7121 Matière pour l'examen général de synthèse (prédoc) Intérêts de recherche Optimisation combinatoire, transport, télécommunications, tournées de véhicules, conception de réseaux, apprentissage automatique, algorithmes génétiques, recherche tabou, parallélisme Mes intérêts de recherche se situent au niveau de l'intégration des techniques de la recherche opérationnelle et de l'intelligence artificielle pour la résolution de problèmes complexes dans le domaine des transports et des télécommunications. Ainsi, je m'intéresse à la conception de systèmes évolutifs ou adaptatifs pour le routage et la répartition de véhicules. Je développe des approches de résolution qui s'inspirent des mécanismes observés au cours de l'évolution des espèces (algorithmes génétiques, programmation génétique) afin de générer des tournées de véhicules satisfaisant des contraintes physiques ou d'opération, par exemple une capacité maximale pour les véhicules ou des fenêtres de temps pour le service aux clients. Je m'intéresse également à l'application de méta-heuristiques comme la recherche tabou pour résoudre des problèmes de conception de réseaux. Finalement, j'étudie diverses approches de parallélisation de la recherche tabou et des algorithmes génétiques, afin de répondre aux applications qui demandent la génération d'une solution en temps réel, comme la répartition dynamique de véhicules dans un service de courrier rapide. Publications représentatives J.-F. Bérubé, M. Gendreau and J.-Y. Potvin, An exact epsilon-constraint method for bi-objective combinatorial optimization problems: Application to the Traveling Salesman Problem with Profits, European Journal of Operational Research 194, 39-50, 2009. M. Tagmouti, M. Gendreau and J.-Y. Potvin, Arc routing problems with time-dependent service costs, European Journal of Operational Research 181, 30-39, 2007. S. Ichoua, M. Gendreau and J.-Y. Potvin, Exploiting knowledge about future demands for real-time vehicle dispatching, Transportation Science 40, 211-225, 2006. M. Gendreau, F. Guertin, J.-Y. Potvin and R. Séguin, Neighborhood search heuristics for a dynamic vehicle dispatching problem with pick-ups and deliveries, Transportation Research Part C 14, 157-174, 2006. M. Gendreau, J.-Y. Potvin, A. Smires and P. Soriano, Multi-period capacity expansion for a local access telecommunications network, European Journal of Operational Research 172, 1051-1066, 2006. J.-Y. Potvin, X. Ying and I. Benyahia, Vehicle routing and scheduling with dynamic travel times, Computers and Operations Research 33, 1129-1137, 2006. S. Ichoua, M. Gendreau and J.-Y. Potvin, Vehicle dispatching with time-dependent travel times, European Journal of Operational Research 144, 379-396, 2003. B. Gendron, J.-Y. Potvin and P. Soriano, A tabu search with slope scaling for the multicommodity capacitated location problem with balancing requirements, Annals of Operations Research 122, 193-217, 2003. D. Berger, B. Gendron, J.-Y. Potvin, S. Raghavan and P. Soriano, Tabu Search for a Network Loading Problem with Multiple Facilities, Journal of Heuristics 6, 253-267, 2000. S. Ichoua, M. Gendreau and J.-Y. Potvin, Diversion issues in real-time vehicle dispatching, Transportation Science 34, 426-438, 2000. E.D. Taillard, P. Badeau, M. Gendreau, F. Guertin and J.-Y. Potvin, A tabu search heuristic for the vehicle routing problem with soft time windows, Transportation Science 31, 170-186, 1997. J.-Y. Potvin, Genetic algorithms for the traveling salesman problem, Annals of Operations Research 63, 339-370, 1996. J.-Y. Potvin, T. Kervahut, B. L. Garcia and J. M. Rousseau, The vehicle routing problem with time windows - Part I: Tabu search, INFORMS Journal on Computing 8, 158-164, 1996. J.-Y. Potvin and S. Bengio, The vehicle routing problem with time windows - Part II: Genetic search, INFORMS Journal on Computing 8, 165-172, 1996. J.-Y. Potvin, The traveling salesman problem: A neural network perspective, ORSA Journal on Computing 5, 328-348, 1993. Adresse postale complète Jean-Yves Potvin Dép. Informatique et Recherche Opérationnelle Bureau 3527, Pavillon André-Aisenstadt Université de Montréal CP 6128, Succ. Centre-Ville Montréal (Québec), Canada H3C 3J7 Research interests Combinatorial optimization, transportation, vehicle routing, learning, genetic algorithms, tabu search, parallelism My research integrates operations research and artificial intelligence techniques to solve complex transportation and telecommunications problems. More precisely, I am interested in the development of adaptive systems, using genetic algorithms, tabu search and neural networks, to solve network design problems and vehicle routing and scheduling problems with various side constraints. I also work on parallel implementations of these techniques for real-time applications, like dynamic vehicle dispatching.",
  "content_length": 5039,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:30"
}