{
  "name": "Jean Chamberlain Chedjou",
  "homepage": "https://www.aau.at/team/chedjou-jean-chamberlain",
  "status": "success",
  "content": "Visitenkarte Chedjou Jean Chamberlain – Universität Klagenfurt Student CockpitePaymentTermin- & LV-ManagementCampus-SystemForschungsdokumentationCampus SucheBeschäftigten-PortalOrganisationshandbuchBetriebsmitteilungen, Interne & Persönliche Mitteilungen LinksBibliothek Webmail Stellenausschreibungen Mitteilungsblätter Schwarzes Brett Personensuche Campus Plan IT Services (ZID) Center for University Learning and Teaching Familienservice USI ÖH Klagenfurt Informationen fürSchüler:innen Studieninteressierte Studierende International Weiterbildung Wissenschaftler:innen Mitarbeiter:innen Lehrende Menschen mit Behinderungen Alumni & Karriere Partner:innen & Förder:innen Medien UNIVERSITÄT Assoc. Prof. Dr.-Ing. Jean Chamberlain ChedjouE-Mail: Jean [dot] Chedjou [at] aau [dot] atTelefon: +43 463 2700 3552Raum: B04a.2.123 Lakesidepark Haus B04, Ebene 2 (Institut für Intelligente Systemtechnologien)Sprechstunde: Freitag von 14-15.00 Uhr, vorherige E-mail - RegistrierungZugehörigkeit: Institut für Intelligente SystemtechnologienCampus-Portal Visitenkarte | Lehrveranstaltungen | Forschung Google Scholar Profil Forschungsschwerpunkte / ÖSTAT-SachgebieteAnalog ComputingDynamische SystemeElektrotechnik, Elektronik, InformationstechnikNeuro-computing with applications in systems simulation and ultra-fast differential equations solvingNonlinear oscillatory theory with applicationsTraffic Modeling and simulationVerkehrstelematikCurriculum VitaeLaufbahn Academic employment 1992-1995 : Part-time Assistant Lecturer, University of Yaoundé, Cameroon. 1996-1999 : Assistant Lecturer, Department of Physics, University of Dschang, Cameroon. 1999-2003 : Senior Lecturer, Laboratory of Electronics, University of Dschang, Cameroon. 2003 -2004 : Researcher and Doctoral student at Leibniz University of Hanover, Hanover,                            Germany (DAAD (German Agency for Academic Exchanges) Research Fellow). 2004-2006 : Associate Researcher at the Abdus Salam International Centre for Theoretical                          Physics (ICTP), Trieste, Italy. 2005-2006 : Researcher at  Université Blaise Pascal, Clermont-Ferrand, France.                                           (AUF (Agence Universitaire de la Francophonie) Research Fellow). 2006-2007 : Senior Lecturer and Head/Chair of the Laboratory of Electronics, University of                          Dschang, Cameroon. 2007-2009 :  Researcher, Transportation Informatics, Institute of Smart Systems                                          Technologies, Alpen-Adria_Universität Klagenfurt, Austria. 2009-2014 :  Assistant Professor, Transportation Informatics, Institute of Smart Systems                              Technologies, Alpen-Adria_Universität Klagenfurt, Austria. 2014-now:   Associate Professor, Institute of Smart Systems Technologies, Alpen-Adria                               Universität Klagenfurt, Austria. Administrative and scientific activities Member of the Curriculum Commission for Information Technology, Faculty of Technical Sciences,  Alpen-Adria Universität Klagenfurt, Austria Member of the 'Performance-oriented budgeting' Commission, Faculty of Technical Sciences, Alpen-Adria Universität Klagenfurt, Austria Supervisor/Co-supervisor of several Master and PhD Theses Member of the Editorial Board, Journal of Communications (JCM) ISSN: 1796-2021 (Online); 2374-4367 (Print) Member of the Review Committee, Universal Journal of Electrical and Electronic Engineering ISSN: 2332-3280 (Print), ISSN: 2332-3299 (Online) Member of the Technical Program Committee, International Conference on Advanced Technologies for Communications, IEEE Communications Society Member of the Technical Program Committee, International Workshop on Nonlinear Dynamics and Synchronization (INDS) Member of the Organization Committee, International Workshop on Nonlinear Dynamics and Synchronization (INDS) Co-Editor of several books published by: Springer, Shaker Verlag (GmbH), Atlantis Press, and CRC-Press Taylor & Francis (In press) Reviewer of  several international journals: IEEE Transaction on Circuits and Systems (TCAS), IEEE Transactions on Neural Networks and Learning Systems (TNNLS), Neural Networks (NEUNET), Neurocomputing (NeuCom), Neural Computing and Applications (NCAA), International Journal of Electronics and Communications (AEÜ), International Journal of Machine Learning and Cybernetics (JMLC), Nonlinear Dynamics (NODY),  International Journal of Bifurcation and Chaos (IBC), Mathematical Problems in Engineering (Math Probl Eng), etc. Award in teaching (Alpen-Adria Universität Klagenfurt)                                               “Ausgezeichnete Lehre an der Universität Klagenfurt”) See:  http://www.uni-klu.ac.at/onlinebroschueren/unisono/201306/#20 Research focus Dynamic systems Traffic Modeling and simulation Neuro-computing with applications in systems simulation and ultra-fast differential equations solving Nonlinear oscillatory theory with applications Analog Computing Ausbildung Academic degrees 1990 : Bachelor degree in Physics, University of Yaoundé, Cameroon. 1992 : Master degree in Electronics, University of Yaoundé, Cameroon. 1999 : Doctorate (French: Doctorat de troisème cyle) in Electronics, University of Yaoundé,                Cameroon. 2004 : Dr.-Ing. Degree in Electrical Engineering and Information Technology, Leibniz                          University of Hanover, Hanover, Germany. 2014 : Habilitation, Institute of Smart Systems Technologies, Alpen-Adria-Universität                          Klagenfurt, Austria. QuicklinksBibliothek Webmail Stellenausschreibungen Mitteilungsblatt Schwarzes Brett Personensuche Campus Plan IT Services (ZID) Familienservice USI ÖH Klagenfurt Index A-Z Plattformen Campus-­System Student Cockpit Beschäftigten-­Portal Moodle Facebook Bluesky LinkedIn Youtube Instagram TikTok Informationen fürSchüler:innen Studieninteressierte Studierende International Weiterbildung Wissenschaftler:innen Mitarbeiter:innen Lehrende Menschen mit Behinderungen Alumni & Karriere Partner:innen & Förder:innen Medien Adresse Universität Klagenfurt Universitätsstraße 65-67 9020 Klagenfurt am Wörthersee Austria +43 463 2700 uni [at] aau [dot] at www.aau.at Campus Plan Anreise Ihre Privatsphäre ist uns wichtig! Unser Webauftritt verwendet Cookies, um die grundlegende Funktionalität unseres Webauftritts zu gewährleisten sowie unsere Webseiten für Sie optimal zu gestalten und fortlaufend zu verbessern. Dazu ist es erforderlich, Informationen an die jeweiligen Dienstanbieter weiterzugeben. Durch Betätigen des Buttons „Alle Cookies akzeptieren“ stimmen Sie der Verwendung zu. Sie können Ihre bevorzugten Einstellungen jederzeit nachträglich unter „Einstellungen verwalten“ anpassen. Weitere Informationen zu den verwendeten Cookies erhalten Sie in unserer Datenschutzerklärung. Einstellungen verwaltenAlle Cookies akzeptieren Cookies und Privatsphäre-Einstellungen Wie wir Cookies verwendenWir setzen auf unserer Website Cookies ein, um unsere Webseiten für Sie optimal zu gestalten und fortlaufend zu verbessern. Klicken Sie auf die verschiedenen Kategorienüberschriften, um mehr zu erfahren und die Standardeinstellungen zu ändern. Beachten Sie bitte, dass die Ablehnung einiger Cookies Auswirkungen auf die Funktionsweise unserer Website haben kann. Möglicherweise werden Webseiten nicht richtig dargestellt und funktionieren nicht einwandfrei. Hinweis auf Verarbeitung Ihrer auf dieser Webseite erhobenen Daten in Staaten ohne angemessenes Datenschutzniveau: Mit Klick auf 'Alle Cookies akzeptieren' willigen Sie gemäß Art. 49 Abs. 1 lit. a DSGVO in die Übermittlung Ihrer personenbezogenen Daten an Anbieter in Drittländern (z. B. USA) ein. Diese Anbieter (z. B. Google, Facebook, LinkedIn, Twitter, YouTube) unterliegen möglicherweise keinem der EU gleichwertigen Datenschutzniveau. Die Übermittlung erfolgt nur mit Ihrer ausdrücklichen Einwilligung. Unbedingt erforderliche Cookies & Cookie HinweisUnbedingt erforderliche Cookies Diese Cookies sind zum Funktionieren der Website erforderlich. Essenzielle Cookies ermöglichen grundlegende Funktionen und sind für das einwandfreie Funktionieren der Website erforderlich. Sie können Ihren Browser so einstellen, dass diese Cookies blockiert oder Sie über diese Cookies benachrichtigt werden. Einige Bereiche der Website funktionieren dann aber möglicherweis nicht wie erwartet. Diese Cookies speichern keine personenbezogenen Daten. Aktivieren / deaktivieren der unbedingt erforderlichen Cookies. Wenn der Regler links steht und grün gefärbt ist, sind unbedingt erforderliche Cookies aktiviert. Wenn der Regler rechts steht und grau gefärbt ist, sind unbedingt erforderliche Cookies deaktiviert. Ausblenden des Cookies-Hinweises Schieben Sie den Regler nach links, damit der Cookie-Hinweis dauerhaft ausgeblendet wird und alle Cookies, denen nicht zugestimmt wurde, abgelehnt werden. Zwei Cookies werden benötigt, damit diese Einstellung gespeichert wird. Andernfalls wird dieser Hinweis bei jedem Seitenladen wieder eingeblendet. Google Tag ManagerWir nutzen Tracking- und Analysetools um eine fortlaufende Optimierung und bedarfsgerechte Gestaltung unserer Webseite sicherzustellen. Mit Hilfe von Tracking-Maßnahmen ist es uns auch möglich, die Nutzung unserer Website durch Besucher statistisch zu erfassen und unser Onlineangebot mit Hilfe der dadurch gewonnenen Erkenntnisse für Sie weiterzuentwickeln. Um zu verhindern, dass Informationen zu Ihrer Nutzung unserer Website durch Google und Facebook erfasst und übertragen werden, deaktivieren Sie das Tracking hier: Wenn der Regler links steht und grün gefärbt ist, ist der Dienst aktiviert. Wenn der Regler rechts steht und grau gefärbt ist, ist der Dienst deaktiviert. Andere externe DiensteWir verwenden verschiedene externe Dienste wie z. B. Google Webfonts, Google Maps oder Youtube-Videos. Da diese Dienste personenbezogene Daten sammeln können, haben Sie die Möglichkeit diese zu blockieren. Bitte denken Sie daran, dass eine Bl",
  "content_length": 11195,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:18"
}