{
  "name": "Jeanette Falk Olesen",
  "homepage": "http://jeanettefalk.com",
  "status": "success",
  "content": "Jeanette Falk I am an assistant professor at Aalborg University in Copenhagen at the Department of Computer Science in the Human-Centered Computing Group. My expertise in HCI research focus on temporality in terms of: long-term and short-term design processes, and fast and slow paced design thinking, and how time and temporality shape people's creativity and design processes. This includes exploring how temporality plays a role in design and how we may design tools for supporting fast or slow design thinking. Considering the accelerating role of AI technology in many contexts, I critically explore the temporality of AI technology and the impact on design processes and creativity. Research Areas: Participatory Design, HCI, Interaction Design, Hackathons, Game Jams, Creativity Publications 2025 Nanna Inie, Jeanette Falk, Raghavendra Selvan.How CO2STLY Is CHI? The Carbon Footprint of Generative AI in HCI Research and What We Should Do About It. CHI '25: Proceedings of the CHI Conference on Human Factors in Computing Systems Nanna Inie, Jeanette Falk, Raghavendra Selvan.(preprint) The HCI GenAI CO2ST Calculator: A Tool for Calculating the Carbon Footprint of Generative AI Use in Human-Computer Interaction Research. Jeanette Falk Yiyi Chen, Janet Rafner, Mike Zhang, Johannes Bjerva, Alexander Nolte. (preprint) How Do Hackathons Foster Creativity? Towards AI Collaborative Evaluation of Creativity at Scale. CHI '25: Proceedings of the CHI Conference on Human Factors in Computing Systems 2024 Katerina Cerna, Ferran Altarriba Bertran, Svenja Keune, Åsa Ståhl, Andrea Resmini, Jeanette Falk, and Stephan HruzaTiny pop-up living labs: augmenting physical space to to facilitate co-design. NordiCHI '24 Adjunct: Adjunct Proceedings of the 2024 Nordic Conference on Human-Computer Interaction Jeanette Falk, Daniel Spikol, Diana Meda, and Mark Melnykowycz. The Role of Slowing Down in Fast-Paced Game Jams. ICGJ '24: Proceedings of the 8th International Conference on Game Jams, Hackathons and Game Creation Events Jeanette Falk, Alexander Nolte, Daniela Huppenkothen, Marion Weinzierl, Kiev Gama, Daniel Spikol, Erik Tollerud, Neil P. Chue Hong, Ines Knäpper, Linda Bailey Hayden The Future of Hackathon Research and Practice IEEE Access Matheus Valentim, Jeanette Falk and Nanna Inie. Hacc-Man: An Arcade Game for Jailbreaking LLMs DIS '24 Companion: Companion Publication of the 2024 ACM Designing Interactive Systems Conference Jeanette Falk, Anna Blumenkranz, Moritz Kubesch, Ralf Vetter, Lisa Hofer, and Christopher Frauenberger. Designing Diverse Pathways for Participation. CHI '24: Proceedings of the CHI Conference on Human Factors in Computing Systems 2023 Nanna Inie, Jeanette Falk, and Steve Tanimoto. Designing participatory AI: Creative professionals’ worries and expectations about generative AI. In CHI EA '23: Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems Jeanette Falk Moritz Kubesch, Anna Blumenkranz, and Christopher Frauenberger. Three Design Directions for a Diversity Computing Design Space. In CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems 2022 Jeanette Falk, Alexander Nolte, Daniela Huppenkothen, Marion Weinzierl, Kiev Gama, Daniel Spikol, Erik Tollerud, Neil Chue Hong, Ines Knäpper, Linda Bailey Hayden. The Future of Hackathon Research and Practice arxiv.or Jeanette Falk and Nanna Inie. Materializing the abstract: Understanding ai by game jamming. Frontiers in Computer Science Journal, 2022 Jeanette Falk, Christopher Frauenberger, and Gopinaath Kannabiran. How shortening or lengthening design processes configure decision making. In NordiCHI, New York, NY, USA, 2022. Association for Computing Machinery Jeanette Falk and Faith Young. Supporting fast design: The potential of hackathons for co-creative systems. In Creativity and Cognition, C&C ’22, page 515–519, New York, NY, USA, 2022. Association for Computing Machinery 2021 Jeanette Falk, Gopinaath Kannabiran and Nicolai Brodersen Hansen (2021) What Do Hackathons Do? Understanding Participation in Hackathons Through Program Theory Analysis. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. BEST PAPER AWARD. Jeanette Falk, Michael Mose Biskjaer, Kim Halskov, and Annakaisa Kultima. How organisers understand and promote participants’ creativity in game jams. In Sixth Annual International Conference on Game Jams, Hackathons, and Game Creation Events, ICGJ 2021, page 12–21, New York, NY, USA, 2021. Association for Computing Machinery 2020 Jeanette Falk Olesen and Kim Halskov (2020) 10 Years of Research With and On Hackathons. In Proceedings of the Designing Interactive Systems Conference, ACM, pages 1073–1088 Nanna Inie, Jeanette Falk Olesen, and Leon Derczynski (2020) The Rumour Mill: Making the Spread of Misinformation Explicit and Tangible. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, pages 1–4 2019 Søren Rasmussen, Jeanette Falk Olesen, and Kim Halskov (2019) Co-notate: Exploring Real-Time Annotations to Capture Situational Design Knowledge. In Proceedings of the Designing Interactive Systems Conference, pages 161–172 Sarah-Kristin Thiel, Jeanette Falk Olesen, Kim Halskov, and Ida Larsen-Ledet (2019) Group Dynamics in Gameful Collaborative Innovation Processes. In International Conference on Collaboration and Technology, pages 222–231. Springer 2018 Jeanette Falk Olesen, Nicolai Brodersen Hansen, and Kim Halskov (2018) Four Factors Informing Design Judgement at a Hackathon. In Proceedings of the 30th Australian Conference on Computer-Human Interaction, pages 473–483 Jeanette Falk Olesen and Kim Halskov (2018) The Dynamic Design Space during a Game Jam. (pdf download) In Proceedings of the 22nd International Academic Mindtrek Conference, pages 30–38 Caroline Lundqvist, Daniel Klinkhammer, Kim Halskov, Stefan Paul Feyer, Jeanette Falk Olesen, Nanna Inie, Harald Reiterer, and Peter Dalsgaard (2018) Physical, Digital, and Hybrid Setups Supporting Card-Based Collaborative Design Ideation. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction, pages 260–272 2017 Jeanette Falk Olesen (2017) Design Processes in Game Jams: Studies of Rapid Design Processes. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play, pages 723–726 Graham Dove, Michael Mose Biskjaer, Caroline Lundqvist, Jeanette Falk Olesen, and Kim Halskov (2017) Constraints and Ambiguity: Some Design Strategies for Supporting Small-Scale Creativity in the Classroom. In Proceedings of the European Conference on Cognitive Ergonomics 2017, pages 69–76 2016 Jeanette Falk Olesen (2016) Conflict Minerals: Articulating Cultural and Societal Issues by Analyzing through a Critical Design Perspective presented at Conference: Student Interaction Design Research conference (SIDeR), Malmø, Sweden Selected Projects Hacc-Man - Playful experience at DIS2024 – ACM Designing Interactive Systems 2024 This is a playful experience where players can try to jailbreak an LLM. I contributed to developing the idea, design and interaction design. See more here for a demo video. Rumour Mill - Installation accepted for the CHI 2020 Interactive track This is a playful art piece commenting on the spread of rumours and automatically-generated misinformation. I contributed to the idea development and provided assistance in building the installation. See more here for the publication and demo video. Plant a Light - Media Facade project for European Capital of Culture Aarhus 2017 Plant a Light was an interactive installation where viewers could interact with the collumn to generate visuals on the building. I contributed to the idea development and research process of the project. See more here for details and video of the project. Wrist Nutritionist - 1st prize winner The prototype was selected by the company Creuna as the winner of their hackathon case at AU Hack 2017. I contributed to the idea development, and assembled the electronics for the prototype. See more here. Co-Op Twister - Developed for a local game developers' event A cooperative game where players have to create connections between coloured switches scattered across a room before the time runs out, using the Makey Makey platform. I contributed to developing the idea as part of the game collective GOLD. A short clip of the gameplay can be seen in the first part of this video. Cobots This game was developed during Nordic Game Jam 2016 under the theme \"Leak\". I contributed to the idea generation, level and game design, and implementation in Unity. The game can be played here. Rabbit Fire - Best Audio The game was developed during Arsenalets Spring Jam 2016 in 72 hours. The theme of the game jam was \"Cheating at the Nordic Game Jam\". I contributed to programming the game. Our game won the \"Best Audio\"-award. Clockwork Dream - Graduation Game In the Autumn of 2015, I was accepted at the National Academy of Digital Interactive Entertainment, DADIU, as a level designer. My team produced the tablet game, Clockwork Dream, an atmospheric point-and-tap art game. The game can be played here Icescape Icescape was developed for the Nexus 9 tablet during my course at DADIU, The National Academy of Digital Interactive Entertainment. I designed and implemented the levels in Unity. See a trailer for the game here SMS Pong - Developed for a local game developers' event A text message-based social game, developed as part of the game dev collective GOLD. A player would randomly recieve a \"Pong\" text, and would have to reply \"Ping\" before the time ran out in order to \"send the ball\" to the next random player who had signed up for the game at the event. The player with the highest score had open bar. Sheerboard - 1st prize winner The concept was selected by the company Ditmer as the first prize winner of the Katrinebjerg Kompetition. The concept was an automated and interactive visualization tool which e",
  "content_length": 11441,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:31"
}