{
  "name": "Jean Gallier",
  "homepage": "http://www.cis.upenn.edu/~jean",
  "status": "success",
  "content": "Jean Gallier's Home Page Jean Gallier, Professor Computer and Information Science Department School of Engineering and Applied Science University of Pennsylvania Email: jean@cis.upenn.edu Telephone: (215) 898-4405 Office: GRW 476 Curriculum Vitae (pdf) Ancestor \"Billy the Kid\" Gallier (from Wyoming) (jpg) Editor's Duties - Also a member of: Department of Mathematics (secondary appointment) Center for Human Modelling and Simulation GRASP Laboratory Institute for Research in Cognitive Science Logic and Computation Group Gran Paradiso (Italy, 2013) Col Rosset (3023 m) After the storm Jean Jean Col Bassac Dere (3082 m) From the Col Bassac Dere Jean Descending from Bassac Dere Rio, Copacabana (2011) Jean Rio Ipanema Mia, Ipanema Sugarloaf, Rio de Janeiro (2011) jaws Mia IMPA, Rio (2011) Moebius strip Trimester poster Office Rio 2011 (a) zip Rio 2011 (b) zip Mont-Blanc, TMB (2011) Jean Mont Dolent Celine Jean Anne & Jean cold group Mia Mont-Blanc Iguassu, Brazil (2011) Anne Falls, Argentinian side Jean Jean Jean Jean Jean Christmas 2011 Demetrius Bahari Sylvie Sylvie and the guys Mom, summer 2011 November 30, 2007. My grandson, Demetrius, his mother, grandfather (me) and father jpg The Gallier family (before Mia!) at the Col d'Arsine (Hautes Alpes) Mia eating ice cream, Summer 99 Mia after Eurodysney, Summer 99 Mia in pink, Fall 97 Philippe, Sylvie, My mother June 1999 Mia and me in China, October 97 Sylvie and me on the equator, December 96 More photos Alpes, August 2004 The \"Gallier Brothers\" Anne's Artwork html Research Interests Before 1993: Friendly compilers, incremental compilation, program verification, automated deduction, unification Selected Writings After 1993: Geometry and its applications (3D graphics, computer vision, robotics), geometric modeling, geometry of curves and surfaces, algebraic geometry, differential geometry, medical imaging Selected Writings Book Series: Mathematical Foundations for Computer Vision, Machine Learning, and Robotics (html) Research Papers and Books Most Recent Books and Papers Mathematical Foundations and Aspects of Discrete Mathematics (html) Aspects of Harmonic Analysis and Representation Theory (html) Homology, Cohomology, and Sheaf Cohomology for Algebraic Topology, Algebraic Geometry, and Differential Geometry (html) Linear Algebra and Optimization with Applications to Machine Learning (html) Differential Geometry and Lie Groups (html) Proofs, Lambda Calculi, Computability, Undecidability, and Complexity. An Introduction (html) Algebra, Topology, Differential Calculus, and Optimization Theory for Computer Science and Machine Learning (html) Solving the Elastic Net and Lasso Regression Problems (pdf) Aspects of Convex Geometry Polyhedra, Linear Programming, Shellings, Voronoi Diagrams, Delaunay Triangulations (html) Notes on Primality Testing and Public Key Cryptography Part 1: Randomized Algorithms Miller-Rabin and Solovay-Strassen Tests (04/2025) (pdf) Spectral Graph Theory of Unsigned and Signed Graphs Applications to Graph Clustering: A Survey (12/2014) Posted to arXiv as paper cs.CV arXiv:1311.2492 (pdf) Introduction to discrete probability (07/2025) (pdf) Published Books Aspects of Harmonic Analysis on Locally Compact Abelian Groups. World Scientific. (html) (World Scientific) (Amazon, html) Aspects of Representation Theory and Noncommutative Harmonic Analysis. World Scientific. (html) (Amazon, html) Homology, Cohomology, and Sheaf Cohomology for Algebraic Topology, Algebraic Geometry, and Differential Geometry. World Scientific. (html) (World Scientific) (Amazon, html) Differential Geometry and Lie Groups: A Computational Perspective Geometry and Computing, Vol 12 (html) (Springer) (Amazon, html) Differential Geometry\tand Lie\tGroups:\tA Second Course Geometry and Computing, Vol 13 (html) (Springer) (Amazon, html) AI Generated Review (07/2025) (pdf) (html) (World Scientific) (Amazon, html) (html) (World Scientific) (Amazon, html) (html) (Amazon, html) (html) (Springer, html) (SpringerLink, html) (Amazon, html) Review in Choice pdf Review in zbMath html Review in MAA html (html) (Springer, html) (SpringerLink, html) (Amazon, html) Review in zbMath html Review in Choice pdf (html) (Springer, html) (SpringerLink, html) (Amazon, html) Review in MathSciNet (item 2) MathSciNet Review in zbMath html (html) Morgan Kaufmann and Amazon.com Review in MathSciNet (item 1) MathSciNet Lambda Calculus, Constructive Logics, Unification Papers All Books Complete List Hot off the Press! Papers in progress Other Recent Manuscript(s) Isometries of Hermitian Spaces (pdf) A Glimpse at Hilbert Spaces (pdf) Parametric Pseudo-Manifolds. With M. Siqueira and Dianna Xu (10/2012), Differential Geometry and Applications Vol. 30, 702-736 (2012) (pdf) Aspects of Harmonic Analysis and Representation Theory (html) Algebraic Geometry and Algebra Books in progress, class notes, etc. Lecture Notes Computational Manifolds and Applications (html) Lecture Notes (html) More on Research Interests, Teaching, etc: Click here",
  "content_length": 5021,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:16"
}