{
  "name": "Jean-Yves Le Boudec",
  "homepage": "https://people.epfl.ch/jean-yves.leboudec",
  "status": "success",
  "content": "EPFL - Jean-Yves Le Boudec Données administratives Jean-Yves Le Boudec jean-yves.leboudec@epfl.ch +41 21 693 66 31 https://leboudec.github.io/leboudec/ vCard Nationalité: Suisse et Française Professeur honoraire, Professeurs honoraires IC +41 21 693 66 31 EPFL › IC › IC-DEC › PH-IC Site web: https://www.epfl.ch/schools/ic/about/faculty-members/#emeritus Biographie Enseignement et PhD Jean-Yves Le Boudec is honorary professor at EPFL and fellow of the IEEE. He graduated from Ecole Normale Superieure de Saint-Cloud, Paris, where he obtained the Agregation in Mathematics in 1980 (rank 4) and received his doctorate in 1984 from the University of Rennes, France. From 1984 to 1987 he was with INSA/IRISA, Rennes. In 1987 he joined Bell Northern Research, Ottawa, Canada, as a member of scientific staff in the Network and Product Traffic Design Department. In 1988, he joined the IBM Zurich Research Laboratory where he was manager of the Customer Premises Network Department. In 1994 he joined EPFL as associate professor.His interests are in the performance and architecture of communication systems. In 1984, he developed analytical models of multiprocessor, multiple bus computers. In 1990 he invented the concept called \"MAC emulation\" which later became the ATM forum LAN emulation project, and developed the first ATM control point based on OSPF. He also launched public domain software for the interworking of ATM and TCP/IP under Linux. He proposed in 1998 the first solution to the failure propagation that arises from common infrastructures in the Internet. He contributed to network calculus, a recent set of developments that forms a foundation to many traffic control concepts in the internet.He earned the Infocom 2005 Best Paper award, with Milan Vojnovic, for elucidating the perfect simulation and stationarity of mobility models, the 2008 IEEE Communications Society William R. Bennett Prize in the Field of Communications Networking, with Bozidar Radunovic, for the analysis of max-min fairness and the 2009 ACM Sigmetrics Best Paper Award, with Augustin Chaintreau and Nikodin Ristanovic, for the mean field analysis of the age of information in gossiping protocols.He is or has been on the program committee or editorial board of many conferences and journals, including Sigcomm, Sigmetrics, Infocom, Performance Evaluation and ACM/IEEE Transactions on Networking. He co-authored the book \"Network Calculus\" (2001) with Patrick Thiran and is the author of the book \"Performance Evaluation of Computer and Communication Systems\" (2010). Enseignement et PhD Past Phd As Director Stephan Robert-Nicoud, Sam Manthorpe, Olivier Crochat, Werner Almesberger, Silvia Giordano Cremonese, Eric Gauthier, Ljubica Blazevic, Paul Hurley, Catherine Boutremans, Lukas Kencl, Milan Vojnovic, Sonja Buchegger, Bozidar Radunovic, Ruben Merz, Slavisa Sarafijanovic, Gianluca Rizzo, Alaeddine El Fawal, Hai Zhan, Manuel Flury, Irina Baltcheva, Marc Philippe Stöcklin, Nikodin Ristanovic, Konstantina Christakou, Miroslav Popovic, Tech Tsegay Tesfay, Maaz Mashood Mohiuddin, Wajeb Saab, Cong Wang, Marguerite Marie Nathalie Delcourt, Roman Rudnik, Ehsan Mohammadpour, Seyed Mohammadhossein Tabatabaee Past Phd As Codirector Edmund James Colli-Vignarelli, Plouton Grammatikos Back to top",
  "content_length": 3290,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:28"
}