{
  "name": "Jeanine K. Stefanucci",
  "homepage": "https://psych.utah.edu/people/faculty/stefanucci-jeanine.php",
  "status": "success",
  "content": "Jeanine Stefanucci, Ph.D. - Department of Psychology - The University of Utah Skip to content Search Site: Powered by Search Campus: Powered by Search Campus Reveal Menu Jeanine Stefanucci, Ph.D. Professor, Cognition and Neural Science | CNS, Health Psychology Curriculum VitaeFred Rhodewalt Social Psychology Winter ConferenceDynamic Vision GroupSpatial Cognition and Navigation (SCAN) ProjectVisual Perception and Spatial Cognition ResearchVAAST Lab Contact Information Office: 1002 BEHSPhone: 801-585-7895Email: jeanine.stefanucci@psych.utah.edu Research Interests I am interested in understanding how people perceive, act in, and remember the spaces around them. For example, how do we perceive the steepness of hills or the magnitude of heights? How do we effectively navigate spaces and remember where we have been? Theoretically, my research addresses whether a person’s bodily states, be they emotional, physiological, or physical, and their bodily size modulates their perception of and memory for spatial layout (e.g., distance, slopes, height, and size). To conduct this research, I gather data in outdoor natural settings, indoors in hallways or buildings, and in mixed realities (virtual and augmented environments). I also test a wide range of age groups to further examine how the relationship between emotion and spatial cognition develops and changes over the lifespan. I find my work rewarding because I strive to make it applicable to issues beyond psychology, including but not limited to the design and development of virtual environments for simulation and training, the participation of women in STEM fields, and the treatment of anxiety disorders and phobias. Opportunities For Students I love hearing from students interested in joining our research group as an undergraduate research assistant, graduate student, or postdoctoral scholar. Please email me your credentials if interested. Education Ph.D., University of Virginia (Psychology, 2006)M.S., University of Virginia (Psychology, 2004)B.A., University of Virginia (Psychology & Cognitive Science, 1999) Selected Publications Munion, A., Stefanucci, J. K., Rovira, E., Squire, P., & Hendricks, M. (in press). Gender differences in spatial navigation: Characterizing exploration patterns during wayfinding. Psychonomic Bulletin & Review. Ruginski, I., Creem-Regehr, S.H., Stefanucci, J. K., & Cashdan, E. (in press). GPS-use negatively affects environmental learning through spatial transformation abilities. Journal of Environmental Psychology. Stefanucci, J. K. (2019). Publish with undergraduates or perish?: Strategies for preserving faculty time in undergraduate research supervision at large universities and liberal arts colleges. Frontiers in Psychology: Educational Psychology. doi: 10.3389/fpsyg.2019.00828. Gagnon, K. T., Thomas, B. J., Munion, A., Creem-Regehr, S. H., Cashdan, E. A., & Stefanucci, J. K. (2018). Not all those who wander are lost: Spatial exploration patterns and their relationship to gender and spatial memory. Cognition, 108-117. Adams, H., Narasimham, G., Rieser, J. J., Creem-Regehr, S. H., Stefanucci, J. K., & Bodenheimer, R. E. (2018). Locomotive and prism recalibration of children and teens in immersive virtual environments. Transactions on Visualization and Computer Graphics, 24, 1408-1417. Guess, M. N., McCardell, M. J., & Stefanucci, J. K. (2016). Fear similarly alters perceptual estimates of and action over gaps. PLoS One. 11(7): e0158610. Thompson, W. B., Fleming, R. W., Creem-Regehr, S. H., & Stefanucci, J. K. (2011). Visual Perception from a Computer Graphics Perspective, New York: CRC Press, Taylor & Francis Group. My Current Graduate Students Holly GagnonDevin GillGrant PointonMorgan SaxonMirinda Whitaker Last Updated: 8/15/24",
  "content_length": 3765,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:30"
}