{
  "name": "Jean Paul Degabriele",
  "homepage": "https://degabriele.info",
  "status": "success",
  "content": "Jean Paul Degabriele Jean Paul Degabriele Technology Innovation Institute Cryptography Research Center Masdar City Abu Dhabi, U.A.E. email: jeanpaul.degabriele [at] tii [dot] ae twitter: @jpdega I am a Principal Researcher at the Cryptography Research Center in TII and a Research Group Leader in the Computer Science Department at TU Darmstadt, where I lead the Cryptography and Network Security Group. My main area of research is cryptography, with an emphasis on real-world applications and rigorous security analysis. Previously I held postdoctoral positions in the Cryptoplexity Group at TU Darmstadt, Royal Holloway University of London, and the University of Maryland. I earned my PhD from Royal Holloway in 2014 under the supervision of Kenny Paterson. I hold an MSc in Information Security from Royal Holloway and a Bachelor of Engineering from the University of Malta. Research Interests Real-World Cryptographic Protocols such as TLS, SSH, IPsec, Tor and EMV. Symmetric Cryptography, mostly relating to Provably-Secure Schemes. Security Definitions and Bridging the Gap Between Cryptographic Theory and Practice. Defenses Against Mass Surveillance. Publications SoK: Efficient Design and Implementation of Polynomial Hash Functions over Prime Fields Jean Paul Degabriele, Jan Gilcher, Jérôme Govindenand, and Kenneth G. Paterson IEEE Symposium on Security and Privacy - Oakland 2024 Populating the Zoo of Rugged Pseudorandom Permutations [pdf] Jean Paul Degabriele and Vukašin Karadžić Advances in Cryptology - ASIACRYPT 2023 The Indiﬀerentiability of the Duplex and its Practical Applications [pdf] Jean Paul Degabriele, Marc Fischlin, and Jérôme Govinden Advances in Cryptology - ASIACRYPT 2023 Overloading the Nonce: Rugged PRPs, Nonce-Set AEAD, and Order-Resilient Channels [pdf] Jean Paul Degabriele and Vukašin Karadžić Advances in Cryptology - CRYPTO 2022 The Security of ChaCha20-Poly1305 in the Multi-User Setting [pdf] Jean Paul Degabriele, Jérôme Govinden, Felix Günther, and Kenneth G. Paterson ACM Conference on Computer and Communications Security - CCS 2021 Hiding the Lengths of Encrypted Messages via Gaussian Padding [pdf] Jean Paul Degabriele ACM Conference on Computer and Communications Security - CCS 2021 Sponges Resist Leakage: The Case of Authenticated Encryption [pdf] Jean Paul Degabriele, Christian Janson, and Patrick Struck Advances in Cryptology - ASIACRYPT 2019 Simulatable Channels: Extended Security that is Universally Composable and Easier to Prove [pdf] Jean Paul Degabriele and Marc Fischlin Advances in Cryptology - ASIACRYPT 2018 Untagging Tor: A Formal Treatment of Onion Encryption [pdf] Jean Paul Degabriele and Martijn Stam Advances in Cryptology - EUROCRYPT 2018 A Surfeit of SSH Cipher Suites [pdf] Martin Albrecht, Jean Paul Degabriele, Torben Hansen, and Kenneth G. Paterson ACM Conference on Computer and Communications Security - CCS 2016 - Best paper award Backdoors in Pseudorandom Number Generators: Possibility and Impossibility Results [pdf] Jean Paul Degabriele, Kenneth G. Paterson, Jacob C.N. Schuldt, and Joanne Woodage Advances in Cryptology - CRYPTO 2016 A More Cautious Approach to Security Against Mass Surveillance [pdf] Jean Paul Degabriele, Pooya Farshim, and Bertram Poettering Fast Software Encryption - FSE 2015 Unpicking PLAID - A Cryptographic Analysis of an ISO-standards-track Authentication Protocol [pdf] Jean Paul Degabriele, Victoria Fehr, Marc Fischlin, Tommaso Gagliardoni, Felix Gunther, Giorgia Azzurra Marson, Arno Mittelbach, and Kenneth G. Paterson Security Standardisation Research - SSR 2014 On Symmetric Encryption with Distinguishable Decryption Failures [pdf] Alexandra Boldyreva, Jean Paul Degabriele, Kenneth G. Paterson, and Martijn Stam Fast Software Encryption - FSE 2013 Security of Symmetric Encryption in the Presence of Ciphertext Fragmentation [pdf] Alexandra Boldyreva, Jean Paul Degabriele, Kenneth G. Paterson, and Martijn Stam Advances in Cryptology - EUROCRYPT 2012 On the Joint Security of Encryption and Signature in EMV [pdf] Jean Paul Degabriele, Anja Lehmann, Kenneth G. Paterson, Nigel P. Smart, and Mario Strefler Cryptographer's Track RSA 2012 Provable Security in the Real World Jean Paul Degabriele, Kenneth G. Paterson, and Gaven J. Watson IEEE Security and Privacy Magazine May/June 2011 On the (In)Security of IPsec in MAC-then-Encrypt Configurations [pdf] Jean Paul Degabriele and Kenneth G. Paterson ACM Conference on Computer and Communications Security - CCS 2010 Economic Aspects of a Utility Computing Service Jean Paul Degabriele and David Pym International ICST Conference on Networks for Grid Applications - GridNets 2007 Attacking the IPsec Standards in Encryption-only Configurations [pdf] Jean Paul Degabriele and Kenneth G. Paterson IEEE Symposium on Security and Privacy - Oakland 2007 Academic Service Program Committee Member 2025: ACM CCS, ASIACRYPT. 2024: ACNS. 2023: PKC, CRYPTO, ACM CCS, Security Standardisation Research, IMA ICCC. 2022: Real World Crypto, EUROCRYPT, ACM CCS, CT-RSA. 2021: Real World Crypto, CT-RSA, Financial Cryptography, CoronaDef (NDSS Affiliated Workshop). 2019: Real World Crypto, CRYPTO, SAC, Security Standardisation Research 2018: Financial Cryptography, Security Standardisation Research, ProvSec 2017: CT-RSA, Financial Cryptography, Latincrypt 2015: ACNS External Reviewer 2022: CRYPTO, Journal of Cryptology 2021: EUROCRYPT, CRYPTO 2020: CT-RSA, ACM TOPS, TCS Journal, CRYPTO 2019: The Computer Journal 2018: EUROCRYPT, PKC, Formal Aspects of Computing, ACM CCS, TCC 2017: EUROCRYPT, CRYPTO, PQCRYPTO 2016: EUROCRYPT, FSE, CRYPTO, TCC, ACM CCS, SAC 2015: EUROCRYPT, Elsevier Computers & Security, Journal of Mathematical Cryptology, IMACC 2013: IEEE Transactions on Information Forensics and Security 2012: AFRICACRYPT, CRYPTO, EUROCRYPT 2011: CRYPTO, EUROCRYPT, FSE Event Organisation IACR–CROSSING School on Combinatorial Techniques in Cryptography SPY – Surveillance, Privacy, and You (EUROCRYPT 2019 Affiliated Event) COST-IACR School on Randomness in Cryptography PhD Thesis Authenticated Encryption in Theory and in Practice [pdf] Presentations Rugged Pseudorandom Permutations and Their Applications - Talk given at RWC 2022 Untagging Tor: A Tale of Onions, Raccoons, and Security Definitions - Talk given at RWC 2018 A Surfeit of SSH Cipher Suites - Talk given at CCS 2016 A More Cautious Approach to Security Against Mass Surveillance - Talk given at FSE 2015 On the Joint Security of Encryption and Signature in EMV - Talk given at CT-RSA 2012 On the (In)Security of IPsec in MAC-then-Encrypt Configurations - Talk given at CCS 2010",
  "content_length": 6622,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:18"
}