{
  "name": "Jean-Baptiste Tristan",
  "homepage": "https://jtristan.github.io",
  "status": "success",
  "content": "Jean-Baptiste Tristan I am interested in program verification (especially in Lean), randomized/probabilistic algorithms, reinforcement learning, and compilers. I am the co-recipient of the 2022 Programming Languages Software Award and the 2021 ACM Software System Award . Publications ICSE'25 Formally Verified Cloud-Scale Authorization Aleks Chakarov, Jaco Geldenhuys, Matthew Heck, Michael Hicks, Samuel Huang, Georges-Axel Jaloyan, Anjali Joshi, K. Rustan M. Leino, Mikael Mayer, Sean McLaughlin, Akhilesh Mritunjai, Clement Pit-Claudel, Sorawee Porncharoenwase, Florian Rabe, Marianna Rapoport, Giles Reger, Cody Roux, Neha Rungta, Robin Salkeld, Matthias Schlaipfer, Daniel Schoepe, Johanna Schwartzentruber, Serdar Tasiran, Aaron Tomb, Emina Torlak, Jean-Baptiste Tristan, Lucas Wagner, Michael W. Whalen, Remy Willems, Tongtong Xiang, Taejoon Byun, Joshua Cohen, Ruijie Fang, Junyoung Jang, Jakob Rath, Hira Taqdees Syeda, Dominik Wagner, Yongwei Yuan PDLI'23 Verified Density Compilation for a Probabilistic Programming Language Joseph Tassarotti, Jean-Baptiste Tristan JCTC Dual-Level Training of Gaussian Processes with Physically Inspired Priors for Geometry Optimizations Chong Teng, Yang Wang, Daniel Huang, Katherine Martin, Jean-Baptiste Tristan, Lucas Bao NARE Dry Reforming of Methane on Doped Ni Nanoparticle: Feature-Assisted Optimizations and Ranking of Doping Metals for Direct Activations of CH4 and CO2 Shiru Lin, Yang Wang, Jean-Baptiste Tristan, Lucas Bao LICS'22 Computable PAC Learning of Continuous Features Nathanael Ackerman, Julian Asilis, Jieqi Di, Cameron Freer and Jean-Baptiste Tristan JCP Geometry Meta-Optimization (Link) Daniel Huang, Lucas Bao, Jean-Baptiste Tristan JOMC mad-GP:Automatic Differentiation of Gaussian Processes for Molecules and Materials Link Daniel Huang, Chong Teng, Lucas Bao, Jean-Baptiste Tristan ICML'21 Conjugate Energy-Based Models (PDF) Hao Wu, Babak Esmaeili, Michael Wick, Jean-Baptiste Tristan, Jan-Willem van de Meent AISTATS'21 Rate-Regularization and Generalization in Variational Autoencoders (PDF) Alican Bozkurt, Babak Esmaeili, Jean-Baptiste Tristan, Dana H. Brooks, Jennifer G. Dy, Jan-Willem van de Meent CPP'21 A Formal Proof of PAC Learnability for Decision Stumps (PDF) Joseph Tassarotti, Koundinya Vajjha, Anindya Banerjee, Jean-Baptiste Tristan WSDM'21 Online Post-Processing In Rankings For Fair Utility Maximization (PDF) Justin Payan, Eric Johnson, Ananya Gupta, Aditya Roy, Ari Kobren, Michael L. Wick, Swetasudha Panda, Jean-Baptiste Tristan NeurIPS'19 Unlocking Fairness: a Trade-off Revisited (PDF) Michael L. Wick, Swetasudha Panda, Jean-Baptiste Tristan TOPC'19 Using Butterfly-Patterned Partial Sums to Draw from Discrete Distributions (PDF) Guy L. Steele Jr., Jean-Baptiste Tristan AKBC'19 Scaling Hierarchical Coreference with Homomorphic Compression (PDF) Michael L. Wick, Swetasudha Panda, Joseph Tassarotti, Jean-Baptiste Tristan AAAI'19 Gradient-based Inference for Networks with Output Constraints (PDF) Jay-Yoon Lee, Sanket Mehta, Michael L. Wick, Jean-Baptiste Tristan, Jaime Carbonell AISTATS'19 Sketching for Latent Dirichlet-Categorical Models (PDF) Joseph Tassarotti, Jean-Baptiste Tristan, Michael L. Wick PLDI'17 Flexible Compilation for Probabilistic Programs (PDF) Daniel Huang, Jean-Baptiste Tristan, Greg Morrisett TOPC'17 Adding Approximate Counters (PDF) Guy L. Steele Jr., Jean-Baptiste Tristan AISTSATS'16 Exponential stochastic cellular automata for massively parallel inference (PDF) Manzil Zaheer, Michael L. Wick, Jean-Baptiste Tristan, Alex Smola, Guy L. Steele Jr. ICML'15 Efficient training of LDA on a GPU by mean-for-mode estimation (PDF) Jean-Baptiste Tristan, Joseph Tassarotti, Guy L. Steele Jr. NIPS'14 Augur: data-parallel probabilistic modeling (PDF) Jean-Baptiste Tristan, Daniel Huang, Joseph Tassarotti, Adam Pocock, Stephen J. Green, Guy L. Steele Jr. PLDI'12 Rocksalt: better, faster, stronger SFI for the x86 (PDF) Greg Morrisett, Gang Tan, Joseph Tassarotti, Jean-Baptiste Tristan, Edward Gan PLDI'11 Evaluating value-graph translation validation for LLVM (PDF) Jean-Baptiste Tristan, Paul Govereau, Greg Morrisett POPL'10 A simple, verified validator for software pipelining (PDF) Jean-Baptiste Tristan, Xavier Leroy PLDI'09 Verified validation of lazy code motion (PDF) Jean-Baptiste Tristan, Xavier Leroy POPL'08 Formal verification of translation validators (PDF) Jean-Baptiste Tristan, Xavier Leroy",
  "content_length": 4440,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:20"
}