{
  "name": "Jean Goubault",
  "homepage": "http://www.lsv.ens-cachan.fr/~goubault/?l=fr",
  "status": "success",
  "content": "Laboratoire Spécification et Vérification Jean Goubault-Larrecq Full Professor Selected Publications In the editorial board of LMCS, of Topology and its Applications, of Theoretical Computer Science. Upcoming events: coorganizer, TianYuan mathematics research center Seminar on Domain Theory and Its Application (Dec. 14-20, 2025, Kunming City, Yunnan Province, PRC); PC member, FOSSACS (part of ETAPS 2026), ICALP 2026, LICS 2026 (part of FLOC 2026), TACL 2026 My GPG public key (but beware of spoofing...) The general topology blog. This serves as a collection of supplements to my book, \"Non-Hausdorff Topology and Domain Theory - Selected Topics in Point-Set Topology\", Cambridge University Press. A few open problems. I am looking for bright students: if you think you can solve one, please get in touch with me! Lecture notes, in brief:Programming and semantics (L3), Graph algorithms (L3), Computability (L3), Logic and computer science - the lambda-calculus (L3), Advanced complexity theory, see also here if anything is missing from the previous page (M1), Theory of databases (M2 FESUP - agrégation), Algorithmic aspects of the theory of well-quasi-orders (M2 MPRI), lambda-calculus for the agrégation. More details on the French version of this Web page. English, by a real Frenchman Some ongoing projects. Beware! I've got a tendency to try and write a few pages on a given topic to get things straight, then it ends as a book... Le Pavé (\"cobblestone\"): A wonderful theory of games, belief functions, plausibilities, and previsions in a topological setting: pdf. I am planning to rewrite everything, as a book, in English. My topology book will serve as foundations. The ORCHIDS page. ORCHIDS is a real-time, multi-event, multi-source intrusion detection tool based on efficient temporal model-checking algorithms. Get in touch with me if you are interested. the GimML language The H1 tool suite: a set of tools for handling finite tree automata, set constraints, doing automated deduction in the decidable class H1. Written almost exclusively in GimML. A few recent or less recent talks: An introduction to semitopological barycentric algebras, Tianyuan Mathematics Center, Kunming, Yunnan, PRC, December 15, 2025. A journey through the semantics of higher-order probabilistic languages,domain theory, and topology, talk at the yearly seminar of LMF, June 13th, 2023. Topological functors and Cartesian-closed categories, talk (video) at the seminar on Categorical Topology, Benemérita Universidad Autónoma de Puebla, Puebla, México, May 24th, 2023. On completeness for Kantorovich Rubinstein quasi-metrics, invited talk at the 9th International Symposium on Domain Theory (ISDT'22), online, July 4-6th, 2022, Singapore. Continuous R-valuations, contributed talk at the 9th International Symposium on Domain Theory (ISDT'22), online, July 4-6th, 2022, Singapore. Noetherian spaces, wqos, and their statures, invited talk at the 10th Conference on Topology, Algebra, Categories in Logic (TACL'22), June 20-24, 2022, Coimbra, Portugal. Is there a Fubini-Tonelli-type theorem for continuous valuations on Dcpo?, seminar given at Hunan University, Changsha, Hunan, China, April 14th, 2022. A probabilistic and non-deterministic call-by-push-value language, talk at the LICS 2019 international conference, Vancouver, BC, Canada; see also the long version of the same talk Domain-complete and LCS-complete spaces, invited talk at the International Symposium on Domain Theory (ISDT), Yangzhou, Jiangsu, Chine, 2019 Previsions=powercones, invited talk at the International Symposium on Domain Theory (ISDT), ShiJiaZhuang, Hebei, Chine, 2017 A semantics for ∇, Dale Miller Festschrift, Paris, France, 2016 On the complexity of monitoring Orchids signatures, Runtime Verification conference, Madrid, Spain, 2016 A few things on Noetherian spaces, plenary invited talk, 31st Summer Topology Conference, Leicester, UK, 2016 An introduction to asymmetric topology and domain theory: why, what and how, invited talk, Galway Colloquium, Leicester, UK, 2016 Formal balls, invited talk, Domains XII, Cork, Ireland, 2015 The VJGL lemma, invited talk, mini-workshop 38 \"Well-quasi orders: from theory to applications\" of the Jahrestagung der deutschen Mathematiker-Vereinigung, Hamburg, Germany, 2015 Miscellaneous tasks and duties: head of the topology group (interactions) at LMF (2020-), of the M2 MPRI curriculum at University Paris-Saclay (2021-), of the M2 MPRI programme itself (2024-); member of `commission formation' of the Digicosme labex (2016-2022), of the `comité de mention informatique des masters' of University Paris-Saclay (2021-); member of the Ackermann outstanding dissertation award of the EACSL (2019-23, 2025-); member of the steering committee of the EACSL (2021-). Earlier: in charge of preparation to agrégation option D computer science at ENS Paris-Saclay (2017-2021); PC cochair of FOSSACS'2020 and coeditor of the associated special issue of the journal LMCS (with Barbara König); PC cochair of CSL'2021 (with Christel Baier). About LSV News People Research Seminars Teaching Contact Private Pages English Français Contact Address LMF Bâtiment 650 Ada Lovelace - Université Paris-Saclay Rue Raymond Castaing 91190 Gif-sur-Yvette E-Mail contact-jgl@lmf.cnrs.fr",
  "content_length": 5286,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:18"
}