{
  "name": "Jean Cardinal",
  "homepage": "http://www.ulb.ac.be/di/algo/jcardin",
  "status": "success",
  "content": "Algorithms Research Group (ULB) Algorithms Research Group Computer Science Department Faculté des Sciences Université libre de Bruxelles (ULB) Campus de la Plaine, CP 212 B-1050 Brussels, Belgium Keywords: Discrete and computational geometry, algorithmic and structural graph theory, combinatorial optimization, data structures. The Team Alumni Visitors CS Seminars Template by Bootstrapious.com & ported to Hugo by Kishan B. The Team Alumni Visitors CS Seminars Algorithms Research Group Computer Science Department Faculté des Sciences Université libre de Bruxelles (ULB) Campus de la Plaine, CP 212 B-1050 Brussels, Belgium Jean Cardinal Professor Keywords: Combinatorial algorithms, computational geometry, geometric combinatorics. Office: 2.O8.112 Samuel Fiorini Professor (Math Department) Keywords: Combinatorial optimization, polyhedral combinatorics, graph theory. Gwenaël Joret Professor Keywords: Graph theory, combinatorial optimization, approximation algorithms. Office: 2.O8.111 John Iacono Professor Keywords: Data structures, computational geometry. Office: 2.O8.114 Stefan Langerman Research director (FNRS) Keywords: Computational geometry. Office: 2.O8.113 Sébastien Collette Professor (part-time) Keywords: Computational geometry, data structures. Yelena Yuditsky Postdoctorcal researcher (FNRS) Office: 2.O8.110 Mathieu Vallée Postdoctorcal researcher Office: 2.O8.213 Robert Hickingbotham Postdoctorcal researcher Office: 2.O8.213 Stefan Kober Postdoctorcal researcher Office: 2.O8.110 Akash Pareek Postdoctorcal researcher Office: 2.O8.214 Martin P. Seybold Postdoctorcal researcher Office: 2.O8.214 Wouter Cames van Batenburg Postdoc Keywords: extremal combinatorics, percolation, colouring and packing of graphs. Office: 2.O8.110 Quentin Claus PhD Student (math) Office: 2.O8.206 Robin Petit PhD Student Office: 2.O8.210 Julien Baudru PhD Student Office: 2.O8.214 Eileen Robinson PhD Student (math)",
  "content_length": 1930,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:20"
}