{
  "name": "Jean Pichon-Pharabod",
  "homepage": "https://jeanpichon.github.io",
  "status": "success",
  "content": "Jean Pichon-Pharabod Jean Pichon-Pharabod Tenure-track assistant professor in the Logic & Semantics group at the Institut for Datalogi of Aarhus University. Before that, I was a Research associate in Peter Sewell's group at the Computer Laboratory of the University of Cambridge, working on the REMS project, and an affiliated lecturer. Before that, I was a PhD student supervised by Peter Sewell. Contact jean.pichon at cs.au.dk Office: Turing 129 (building 5341) Google Scholar orcid: 0000-0002-4442-6543 institutional webpage LinkedIn page Research interests I am interested in bridging the gap between programming language theory and the industrial practice of programming with real-world systems, focusing in particular on relaxed memory concurrency and systems programming, from modelling and tooling to developing new reasoning methods I am looking for motivated PhD students, PostDocs, and interns. Students Zongyuan Liu started 2020 Maxime Legoupil started 2022 June Rousseau started 2022 Funding Amazon ARC Award 2024 Google ASPIRE 2023 award Google ASPIRE 2022 award Google ASPIRE 2021 award AUFF Starting Grant Outreach Reactive Scratch: helping children learn programming using the technology of the 80s (rather than that of the 60s). Teaching 2nd year Computer Architecture, Operating Systems and Networks 3rd year Compilers Master's Advanced Topics in Programming Language Theory Cambridge Part II (3rd year) Hoare Logic & Model Checking Student projects Student projects Software CppMem, an interactive C/C++ memory model explorer Cerberus-BMC, an executable semantics for a substantial fragment of C rmem, an interactive ISA and memory model explorer wasm_coq, a Coq formalisation of WebAssembly 1.0 (based on C. Watt's WebAssembly semantics in Isabelle) CertiCoq-Wasm (student project) pdf Publications See DBLP. Precise exceptions in relaxed architectures, Ben Simner, Alasdair Armstrong, Thomas Bauereiss, Brian Campbell, Ohad Kammar, Jean Pichon-Pharabod, Peter Sewell, in ISCA 2025 pdf CertiCoq-Wasm: A Verified WebAssembly Backend for CertiCoq, Wolfgang Meier, Martin Jensen, Jean Pichon-Pharabod, Bas Spitters Spitters, in CPP 2025 pdf Iris-MSWasm: Elucidating and Mechanising the Security Invariants of Memory-Safe WebAssembly, Maxime Legoupil, June Rousseau, Aina Linn Georges, Jean Pichon-Pharabod, Lars Birkedal, in OOPSLA 2024 pdf An axiomatic basis for computer programming on the relaxed Arm-A architecture: The AxSL Logic, Angus Hammond, Zongyuan Liu, Thibaut Pérami, Peter Sewell, Lars Birkedal, Jean Pichon-Pharabod, in POPL 2024 pdf VMSL: A Separation Logic for Mechanised Robust Safety of Virtual Machines Communicating above FF-A, Zongyuan Liu, Sergei Stepanenko, Jean Pichon-Pharabod, Amin Timany, Aslan Askarov, and Lars Birkedal, in PLDI 2023 pdf Iris-Wasm: Robust and Modular Verification of WebAssembly Programs, Xiaojia Rao, Aïna Linn Georges, Conrad Watt, Maxime Legoupil, Jean Pichon-Pharabod, Philippa Gardner, and Lars Birkedal, in PLDI 2023 pdf Islaris: Verification of Machine Code Against Authoritative ISA Semantics, Michael Sammler, Angus Hammond, Rodolphe Lepigre, Brian Campbell, Jean Pichon-Pharabod, Derek Dreyer, Deepak Garg, Peter Sewell, in PLDI 2022 pdf Relaxed virtual memory in Armv8-A, Ben Simner, Alasdair Armstrong, Jean Pichon-Pharabod, Christopher Pulte, Richard Grisenthwaite, Peter Sewell, in ESOP 2022 pdf Two Mechanisations of WebAssembly 1.0, Conrad Watt, Xiaojia Rao, Jean Pichon-Pharabod, Martin Bodin, Philippa Gardner, in FM 2021 pdf Repairing and Mechanising the JavaScript Relaxed Memory Model, Conrad Watt, Christopher Pulte, Anton Podkopaev, Guillaume Barbier, Stephen Dolan, Shaked Flur, Jean Pichon-Pharabod, Shu-yu Guo, in PLDI 2020 pdf ARMv8-A system semantics: instruction fetch in relaxed architectures, Ben Simner, Shaked Flur, Christopher Pulte, Alasdair Armstrong, Jean Pichon-Pharabod, Luc Maranget, and Peter Sewell, in ESOP 2020 pdf Weakening WebAssembly, Conrad Watt, Andreas Rossberg, Jean Pichon-Pharabod, in OOPSLA 2019 pdf Cerberus-BMC: a Principled Reference Semantics and Exploration Tool for Concurrent and Sequential C, Stella Lau, Victor B. F. Gomes, Kayvan Memarian, Jean Pichon-Pharabod, and Peter Sewell, in CAV 2019 pdf Promising-ARM/RISC-V: a simpler and faster operational concurrency model, Christopher Pulte, Jean Pichon-Pharabod, Jeehoon Kang, Sung-Hwan Lee, and Chung-Kil Hur, in PLDI 2019 pdf A separation logic for a promising semantics, Kasper Svendsen, Jean Pichon-Pharabod, Marko Doko, Ori Lahav, and Viktor Vafeiadis, in ESOP 2018 pdf A concurrency semantics for relaxed atomics that permits optimisation and avoids thin-air executions, Jean Pichon-Pharabod and Peter Sewell, in POPL 2016 pdf A Separation Logic for Fictional Sequential Consistency, Filip Sieczkowski, Kasper Svendsen, Lars Birkedal, and Jean Pichon-Pharabod, in ESOP 2015 pdf The Problem of Programming Language Concurrency Semantics, Mark Batty, Kayvan Memarian, Kyndylan Nienhuis, Jean Pichon-Pharabod, and Peter Sewell, in ESOP 2015 pdf Thesis: A no-thin-air memory model for programming languages, Jean Pichon-Pharabod webpage Last modified: 11 Dec 2024",
  "content_length": 5143,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:18"
}