{
  "name": "Jeanette Hällgren Kotaleski",
  "homepage": "https://www.kth.se/profile/jeanette",
  "status": "success",
  "content": "KTH | Jeanette Hällgren Kotaleski Hoppa till huvudinnehållet Jeanette Hällgren KotaleskiProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/jeanetteDetaljerArbetar vid Beräkningsvetenskap och beräkningsteknikTelefon +46 8 790 69 03Enhetens adress Lindstedtsvägen 5E-post jeanette@kth.seForskareForskar-IDORCID IDGoogle Scholar IDOm migThe main focus of my research is to use modeling and simulations to understand the neural mechanisms underlying information processing and learning in the brain. The levels of investigation range over multiple biological scales, from large-scale simulations of cellular level neural networks down to kinetic models (i.e. systems biology approaches) of molecular and cellular processes. For most of the projects, interdisciplinary collaborations with experimental labs nationally and internationally are, and have been, crucial. I have a long experience in training cross-disciplinary students/postdocs in addition to collaborating with experimentalists. Currently I have a research group with doctoral students and postdocs/senior researchers divided between CST/EECS at KTH and Dept Neurosci at Karolinska Institutet (KI). I'm also working closely with the International Neuroinformatics Coordination Facility, promoting FAIR principles within the neuroscience field. Presently I'm also coordinating the building up of EBRAINS-Sweden. EBRAINS is the infrastructure for brain research resulting from the EU flagship, the Human Brain Project (HBP). At KTH I'm also one of the PIs of the collaborative projects within SeRC as well as Digital Futures frameworks. KurserExamensarbete i datalogi och datateknik med inriktning mot industriell ekonomi, avancerad nivå (DA235X), examinatorExamensarbete i datalogi och datateknik med inriktning mot maskininlärning, avancerad nivå (DA233X), examinatorExamensarbete i datalogi och datateknik med inriktning mot systemteknik och robotik, avancerad nivå (DA236X), examinatorNeurovetenskap (DD2401), examinator, lärareNeurovetenskap (FDD3401), examinator",
  "content_length": 2037,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:42"
}