{
  "name": "Jean-Guy Schneider",
  "homepage": "https://research.monash.edu/en/persons/jean-guy-schneider",
  "status": "success",
  "content": "Jean-Guy Schneider - Monash University View Scopus Profile Jean-Guy Schneider Professor Professor, Department of Software Systems & Cybersecurity https://orcid.org/0000-0002-9827-5496 EmailJean-Guy.Schneidermonashedu Accepting PhD StudentsPhD projectsSoftware Engineering; Software Engineering for Machine Learning; Software Engineering for Quantum Computing 1996 …2023 Research activity per year Personal profile BiographyProf. Schneider holds a PhD degree in Computer Science and Applied Mathematics from the University of Bern, Switzerland, and has more then 20 years experience in the Higher Education Sector in Australia. He has held a variety of leadership positions and is currently the Associate Dean (Education) of the Faculty of IT at Monash University.His main research interests lie in the general area of reliable software technologies with a special focus on component technologies and user-centred approaches. More specifically, his research interests are in object-oriented and concurrent/distributed/service-oriented software systems, service virtualization, software metrics, cloud and mobile computing, and quantum software. Furthermore, he is interested in methodologies and tools in the context of the evolution of object- and component-based software systems, agile software development processes, as well as the influence and applicability of software development methodologies in tertiary education. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationComputer Science, PhD, Components, Scripts, and Glue: A conceptual framework for software composition, Universität Bern (University of Bern)Award Date: 28 Oct 1999 Research area keywordsSoftware EngineeringQuantum computingProgramming LanguagesUser Experience (UX)Software Quality Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 1996 2008 2010 2012 2015 2020 2022 2023 72 Conference Paper 19 Article 2 Foreword / Postscript 1 Review Article Research output per year Research output per year Energy efficient node selection in edge-fog-cloud layered IoT architectureFereira, R., Ranaweera, C., Lee, K. & Schneider, J. G., 29 Jun 2023, In: Sensors. 23, 13, 27 p., 6039.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 17 Citations (Scopus) MLGuard: Defend your Machine Learning model!Wong, S., Barnett, S., Rivera-Villicana, J., Simmons, A., Abdelkader, H., Schneider, J. G. & Vasa, R., 2023, Proceedings of the 1st International Workshop on Dependability and Trustworthiness of Safety-Critical Systems with Machine Learned Components. Chechik, M., Elbaum, S., Hu, B. C., Marsso, L. & von Stein, M. (eds.). New York NY USA: Association for Computing Machinery (ACM), p. 10-13 4 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research Open AccessFile 2 Citations (Scopus) Monitoring the energy consumption of Docker containersWarade, M., Lee, K., Ranaweera, C. & Schneider, J. G., 2023, Proceedings - 2023 IEEE 47th Annual Computers, Software, and Applications Conference, COMPSAC 2023. Shahriar, H., Teranishi, Y., Cuzzocrea, A., Sharmin, M., Towey, D., Majumder, A. J. A., Kashiwazaki, H., Yang, J.-J., Takemoto, M., Sakib, N., Banno, R. & Ahamed, S. I. (eds.). Piscataway N J USA: IEEE, Institute of Electrical and Electronics Engineers, p. 1703-1710 8 p. (Proceedings - International Computer Software and Applications Conference; vol. 2023-June).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research 7 Citations (Scopus) Optimising workflow execution for energy consumption and performanceWarade, M., Lee, K., Ranaweera, C. & Schneider, J. G., 2023, Proceedings - 2023 IEEE/ACM 7th International Workshop on Green And Sustainable Software, GREENS 2023. Verdecchia, R. (ed.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 24-29 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research 2 Citations (Scopus) An experimental comparison of clone detection techniques using Java BytecodeSchneider, J. G. & Lee, S. U., 2022, Proceedings - 2022 29th Asia-Pacific Software Engineering Conference, APSEC 2022. Choi, E. & Han, D. (eds.). Piscataway NJ USA: IEEE, Institute of Electrical and Electronics Engineers, p. 139-148 10 p. (Proceedings - Asia-Pacific Software Engineering Conference, APSEC; vol. 2022-December).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 4 Citations (Scopus) View all 94 research outputs",
  "content_length": 5133,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:23"
}