{
  "name": "Jeeeun Kim",
  "homepage": "http://www.jeeeunkim.com",
  "status": "success",
  "content": "Jeeeun Kim Jeeeun Kim [Google Scholar] [CV] Assistant Professor Computer Science & Engineering, Texas A&M University Director of HCIed (HCI Engineering & Design) Lab Founding organizer of TxHCI Seminar Series Faculty advisor of Aggie Women in Computer Science (AWICS) Student Organization If you are interested in working with me, please complete this form, then email me! Latest News 06/25   FABRIC is accepted to IROS'25 05/25   Instance Detection in Open World is accepted to CVPR'25 05/25   LumosX is presented at CHI'25 03/25   Honored to be named a TEES Young Faculty Fellow by the College of Engineering 09/24   Honored to be named a Montague-Center for Teaching Excellence Scholar 04/24   Thrilled to receive the NSF CAREER Award! 04/24   Serving a general co-chair with Ian Oakley for UIST'25 03/24   Serving a subcommittee chair (Devices, Materials, and Fabrication) for CHI'25 01/24   AccessLens, MorphMag, and Sustainable Unmaking (workshop) are accepted to CHI'24 01/24   Excited to be part of the NSF NRI project as a Co-PI 01/23   Serving a Doctoral Consortium co-chair for UIST'24 09/23   Excited to be part of the NSF FW-HTF-RM project as a Co-PI 09/23   3DPFIX is accepted to CSCW'24 for the first time! 09/23   HighRes Instance Detection Dataset is accepted to NeurIPS'23 for the first time! 09/23   Resuming the TxHCI Seminar Series 07/23   E3D is accepted to Ubicomp'23 for the first time! 05/23   Serving a subcommittee chair (Devices, Materials, and Fabrication) for CHI'24 01/23   Measurement Patterns is accepted to CHI'23 01/23   One paper accepted by Composite Sturcture (Elsevier) 07/22   Received two NSF Grants, HCC and FW-HTF-P as a PI 07/22   ShrinkCells is accepted to UIST'22 05/22   Serving on the program committee for CHI'23 03/22   CustomizAR is accepted to DIS'22 01/22   Two papers, One panel, and One LBW paper is accpeted to CHI'22 01/22   Serving on the program committee for UIST'22 11/21   Organizing 4D Printing Workshop for K-12 students 10/21   Happy to be part of founding member of VIVID Lab, Texas A&M Institute of Data Science! 10/21   Telelife accepted to Frontiers in Virtual Reality 08/21   Multi-ttach is accepted to SCF'21 07/21   Successfully organized a virtual science camp for high school students and E3 program to promote STEM/CTE educator's research experience 06/21   Serving on the program committee (PC) for CHI'22 06/21   Recieved Ralph E. Powe Junior Faculty Enhancement Award! 04/21   Serving as an HCI Area chair (PC) for SCF'21 01/21   One paper accpeted to TExSS'21, Workshop on iUI'21 01/21   Serving on the program committee for UIST'21 01/21   Panelist at Digital Fabrication at Korea HCI'21 12/20   Invited talk at Tactual Labs 12/20   One paper accepted to CHI'21 12/20   One paper accepted to IUI'21 12/20   Recieved Triads for Transformation (T3) seed grant! 10/20   Programmable Filament is featured at IEEE Spectrum and ACM TechNews 10/20   One paper accepted to TEI'21 09/20   Serving as a posters program co-chair at UIST'21 09/20   Started organizing the TxHCI Seminar Series with awesome Cesar Toress at UTA and Sam Shorey at UT! 08/20   Programmable Filament got the Best Paper Honorable Mention Award! 07/20   Serving as a program committee (AC) for EICS'21 06/20   One paper accepted to NordiCHI'20 06/20   Two papers accepted to UIST'20 05/20   Named a 9th Heidelberg Laureate Young Researcher! 03/20   Serving as a short paper char for IUI'21 10/20   Serving on the program committee (AC) for UIST'20 10/20   Serving as a Reg chair for UIST'20 06/20   Serving as a Posters chair for SCF'20 04/20   Invited talk, Berkeley Institute of Design, UC Berkeley 04/20   Serving as a steering committee for TxGraph'20 01/20   Started teaching CHI:Computer-Human Interaction (CSCE 436) for spring 2020 11/19   Invited talk at HCI@KAIST, Korea 11/19   Invited talk at KAIST EECS, Korea 11/19   Invited talk at IPD Lab @ UNIST, Korea 11/19   Invited talk at Ewha Woman's University, Korea 09/19   Received gift funding from Adobe Research! 08/19   Started teaching Fabricating Future Interaction Technologies (CSCE 667) for fall 2019 08/19   I am on the top of the Adobe Research Fellowship page! 08/19   My first day as an assistant professor at Texas A&M University 07/19   Two papers accpeted to UIST'19 06/19   One paper accepted to CogSci'19 05/19 Thesis defended 03/19   One paper accepted to TEI'19 02/19   Serving as a Registrations co-chair at UIST'19 12/19 Serving as an Associate Chair for LBW program at CHI'19 12/19   One paper acceptedtot CHI'19 07/18   Received Adobe Research Fellowship 07/18   Invited talk @ HP Palo Alto 05/18   Invited talk @ SNU, Korea Publications FABRIC: FAbricating Bodily-Expressive Robots for Inclusive and Low-Cost Design In Proceedings the 2025 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS'25) [PDF] Solving Instance Detection from an Open-World Perspective In Proceedings of IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR'25) [PDF] LumosX: 3D Printed Anisotropic Light-Transfer In Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems (CHI'25) [PDF] 3D Printed Kerf Structures In Proceedings of Nineteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI'25) [PDF] Unmake to Remake: Materiality-driven Rapid Prototyping ACM Transactions on Computer-Human Interaction (ToCHI, Presented at UIST’24) [PDF] Reconfigurable Interfaces by Shape Change and Embedded Magnets In Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems (CHI'24) [PDF] AccessLens: Auto-detecting Inaccessibility of Everyday Objects In Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems (CHI'24) [arXiv] 3DPFIX: Improving Remote Novices' 3D Printing Troubleshooting through Human-AI Collaboration In Proceedings of the ACM on Human-Computer Interaction (CSCW’24) [arXiv] A High-Resolution Dataset for Instance Detection with Multi-View Instance Capture In Proceedings of Advances in Neural Information Processing Systems. (NeurIPS’23) [PDF [Project Page] E3D: Harvesting Energy from Everyday Kinetic Interactions Using 3D Printed Attachment Mechanisms In Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT, Presented at Ubicomp'23) [PDF] Tuning mechanical properties of 3D printed composites with PLA: TPU programmable filaments In Composite Structures Vol. 318, Elsevier [PDF] Measurement Patterns: User-Oriented Strategies for Dealing with Measurements and Dimensions in Making Processes In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems (CHI'23) [PDF] An exploration of 3D printed freeform kerf structures In Proceedings of SPIE Smart Structures + Nondestructive Evaluation, Vol. 12484 [PDF] ShrinkCells: Localized and Sequential Shape-Changing Actuation of 3D-Printed Objects via Selective Heating In Proceedings of the Annual Symposium on User Interface Software and Technology (UIST’22, To appear) [PDF] CustomizAR: Facilitating Interactive Exploration and Measurement of Adaptive 3D Designs In Proceedings of ACM Conference on Designing Interactive Systems (DIS'22) [PDF] Mobiot: Augmenting Everyday Objects into Moving IoT Devices Using 3D Printed Attachments Generated by Demonstration In Proceedings of the 40th Annual ACM SIGCHI Conference on Human Factors in Computing Systems (CHI’22) [PDF] Roman: Making Everyday Objects Robotically Manipulable with 3D-Printable Add-on Mechanisms In Proceedings of the 40th Annual ACM SIGCHI Conference on Human Factors in Computing Systems (CHI’22) [PDF] Fab4D: An Accessible Hybrid Approach for Programmable Shaping and Shape Changing Artifacts In Proceedings of Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI’22) ACM SIGGRAPH 2022 Labs (SIGGRAPH'22) [PDF] Telelife: The Future of Remote Living In Frontiers of Virtual Reality [PDF] Multi-ttach: Techniques to Enhance Multi-material Attachments in Low-cost FDM 3D Printing In Proceedings of the ACM SCF'21 [PDF] [Project Website/System] 3D4ALL: Toward an Inclusive Pipeline to Classify 3D Contents In Proceedings of the TExSS'21 (Workshop on iUI'21) [PDF] [Project Website/Open Dataset] EscapeLoom: Fabricating New Affordances for Hand Weaving In Proceedings of the 39th Annual ACM SIGCHI Conference on Human Factors in Computing Systems (CHI’21) [PDF] HowDIY: Towards Meta-Design Tools to Support Anyone to 3D Print Anywhere In Proceedings of 26th Annual Conference on Intelligent User Interfaces (IUI’21) [PDF] [Project Website/System] OmniSoft: A Design Tool for Soft Objects by Example In Proceedings of International Conference on Tangible, Embedded, and Embodied Interaction (TEI’21) [PDF] Programmable Filament: Printed Filaments for Multi-material 3D Printing In Proceedings of the Annual Symposium on User Interface Software and Technology (UIST’20) *SIGCHI Best of UIST Honorable Mention Award [PDF] Romeo: A Design Tool for Embedding Transformable Parts in 3D Models to Robotically Augment Default Functionality. In Proceedings of the Annual Symposium on User Interface Software and Technology (UIST’20) [PDF] “Anyone Can Print”: Supporting Collaborations with 3D Printing Services to Empower Broader Participation in Personal Fabrication In Proceedings of the 11th Nordic Conference on Human-Computer Interaction (NordiCHI’20) [PDF] 3D Printed Fabric: Techniques for Design and 3D Weaving Programmable Textiles. In Proceedings of the Annual Symposium on User Interface Software and Technology (UIST’19) [PDF] Robiot: A Design Tool for Actuating Everyday Objects with Automatically generated 3D Printable Mechanisms. In Proceedings of the Annual Symposium on User Interface Software and Technology (UIST’19) [PDF] Parent-Child Interactions and Word Learning: Introducing vocabulary in different play contexts. In Proceedings of the 41st Annual Meeting of the Cognitive Science Society (CogSci’19 To appear) 3D Pen + 3D Printer: Explor",
  "content_length": 12063,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:34"
}