{
  "name": "Jeehoon Kang",
  "homepage": "https://cp.kaist.ac.kr/jeehoon.kang",
  "status": "success",
  "content": "Jeehoon Kang (강지훈) - KAIST CP The concurrency and parallelism laboratory is shut down. After 6.5 beautiful years at KAIST, I moved to FuriosaAI Research to search for the “right” abstractions for AI accelerators. I was a Tenure-Track Associate Professor at the KAIST School of Computing and the Principal Investigator at the Concurrency and Parallelism Laboratory. I also served as an adjunct faculty at the Graduate School of AI Semiconductor, the Department of Semiconductor System Engineering, and the Graduate School of Quantum Science and Technology. I earned my Ph.D. in Computer Science from Seoul National University, where I was advised by Prof. Chung-Kil Hur (supervisor) and Prof. Kwangkeun Yi (mentor). I was passionate about searching for the “right” abstraction for concurrency and parallelism. My research focused on the design and verification of concurrent and parallel systems, from micro-architectures to programming languages and algorithms. I aimed to significantly improve performance and reduce power consumption in these systems, which is essential for today’s AI-driven world. Contact Email: jeehoon.kang@cp.kaist.ac.kr GitHub: jeehoonkang Bibliography: ORCID, DBLP, Google Scholar Place: Rm. 4433, Bldg. E3-1, KAIST (+82-42-350-3578) GPG key Education (2019) Ph.D. in Computer Science and Engineering. Seoul National University (thesis, supervisor: Prof. Chung-Kil Hur). Experiences Chief Research Officer at FuriosaAI, from July 2025 to present. Associate and Assistant Professor at KAIST School of Computing, from February 2019 to July 2025. Intern (Researcher) at MPI-SWS, from September 2015 to December 2015. (Focus: relaxed-memory concurrency; Advisor: Dr. Derek Dreyer) Intern (Software Engineer) at Google Korea, from June 2008 to August 2008. (Focus: machine translation) Research For more information on my research projects and publications, please visit the projects and publications pages. Teaching Details about my lectures can be found on the lectures page. Professional Activities Program Committee Chairs 2021 POPL AEC 2020 POPL AEC Program Committee Members 2025: CPP, ISMM 2024: POPL, PLDI, MPLR 2023: ACM SRC, APLAS 2022: PLDI, ESOP, CPP 2021: POPL, OOPSLA, HOPE, PLOS 2020: ICSE NIER, ICSE SEIP, ASPLOS (ERC) 2019: POPL AEC Others: 2023: APSEC Student Research Competition Chair 2022: POPL Student Research Competition Co-Chair, CGO Proceedings Chair 2021: CGO Proceedings Chair 2020: ICSE Virtualization Technology Chair Open Source Contributions Crossbeam: a concurrency library in Rust Crellvm: a verified credible compilation framework for LLVM SepCompCert: verification of separate compilation of CompCert Invited Talks iRRAM-Coq: Fearless Verification of Exact Real Arithmetic Programs. The 1st Workshop on Real Verification (RV 2017). [development] Awards and Honors 황규영 학술진흥기금 커리어 어워드, KAIST 전산학부, 2023. Distinguished Paper Award, ACM SIGPLAN Symposium on Principles of Programming Languages (POPL), 2022. Doctoral Dissertation Award, Dept. of Computer Science and Engineering, Seoul National University, 2019. Distinguished Paper Award, ACM SIGPLAN Conference on Programming Languages Design and Implementation (PLDI), 2017.",
  "content_length": 3180,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:32"
}