{
  "name": "Jefersson Alex dos Santos",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/jefersson-alex-dos-santos",
  "status": "success",
  "content": "Dr Jefersson Alex dos Santos | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Jefersson Alex dos Santos School of Computer Science Lecturer in Computer Vision Admissions Tutor Open staff member portrait in a modal window j.santos@sheffield.ac.uk Regent Court (DCS) Full contact details Dr Jefersson Alex dos Santos School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-8889-1586 Google Scholar Profile Jefersson A. dos Santos is currently an Assistant Professor (Lecturer) in Computer Vision at the University of Sheffield, United Kingdom. He used to hold a position as Associate Professor at the Universidade Federal de Minas Gerais, Brazil (2013 - 2022). Jefersson got a Ph.D in Computer Science at the University of Campinas (Unicamp), Brazil, and at the University of Cergy-Pontoise, France, in 2013. He earned a Master's Degree in Computer Science from Unicamp in 2009 and a Bachelor Degree in Computer Science from University of Mato Grosso do Sul (UEMS), Brazil, in 2006. Jefersson is an IEEE Senior Member. He is currently an Associate Editor for the IEEE Geoscience and Remote Sensing Letters and Co-Chair for the ISPRS Working Group for AI/ML for Geospatial Data. Jefersson also serves as a PC member for several refereed journals and conferences and is currently the vice president of the IEEE GRSS Brazilian Chapter. Jefersson held the prestigious CNPq Productivity Research Scholarship (2016 - 2022). In 2021, he was awarded a competitive research grant from the Serrapilheira Institute, Brazil. His research interests include remote sensing image processing, computer vision and machine learning. Jefersson is the founder of the Laboratory of Pattern Recognition and Earth Observation (PATREO) at the Department of Computer Science, UFMG, Brazil. Research interests My current research interests include machine learning, computer vision, image processing, and remote sensing. Besides always aiming at excellence and impacting outcomes in Computer Science, I am especially interested in inter-, cross-, multidisciplinary research. Publications Journal articles Roscher R, Russwurm M, Gevaert C, Kampffmeyer M, Santos JAD, Vakalopoulou M, Hänsch R, Hansen S, Nogueira K, Prexl J & Tuia D (2025) Better, Not Just More: Data-centric machine learning for Earth observation. IEEE Geoscience and Remote Sensing Magazine, 13(3), 512-532. da Silva MP, Correa SPLP, Schaefer MAR, Reis JCS, Nunes IM, dos Santos JA & Oliveira HN (2025) Advancing agricultural remote sensing: A comprehensive review of deep supervised and Self-Supervised Learning for crop monitoring. Computers & Graphics, 104434-104434. Silva MPD, Vieira L, de Santana CTC, Nunes IM, Dos Santos JA & Oliveira HN (2025) A Lightweight Pipeline for Crop Time-Series Parcel Classification via Self-Supervision. IEEE Geoscience and Remote Sensing Letters, 22, 1-5. Valois PHV, Macedo J, Ribeiro LSF, dos Santos JA & Avila S (2025) Leveraging self-supervised learning for scene classification in child sexual abuse imagery. Forensic Science International: Digital Investigation, 53, 301918-301918. Monteiro GAA, Monteiro BAA, dos Santos JA & Wittemann A (2025) Pre-trained artificial intelligence-aided analysis of nanoparticles using the segment anything model. Scientific Reports, 15. View this article in WRRO Roscher R, Russwurm M, Gevaert C, Kampffmeyer M, Dos Santos JA, Vakalopoulou M, Hänsch R, Hansen S, Nogueira K, Prexl J & Tuia D (2024) Better, Not Just More: Data-centric machine learning for Earth observation. IEEE Geoscience and Remote Sensing Magazine, 12(4), 335-355. Rodrigues CN, Nunes IM, Pereira MB, Oliveira H & dos Santos JA (2024) From superpixels to foundational models: An overview of unsupervised and generalizable image segmentation. Computers & Graphics, 123, 104014-104014. Laranjeira C, Pereira M, Oliveira R, Barbosa G, Fernandes C, Bermudi P, Resende E, Fernandes E, Nogueira K, Andrade V , Quintanilha J et al (2024) Automatic mapping of high-risk urban areas for Aedes aegypti infestation based on building facade image analysis. PLOS Neglected Tropical Diseases, 18(6). View this article in WRRO Nunes IM, Pereira MB, Oliveira H & Santos JAD (2024) FuSC: fusing superpixels for improved semantic consistency. IEEE Access, 12, 20232-20250. View this article in WRRO dos Santos JA, Apolinário AL, Miranda F & Distante C (2023) Foreword to Special Section on SIBGRAPI 2022. Pattern Recognition Letters, 175, 81-82. Nunes I, Laranjeira C, Oliveira H & dos Santos JA (2023) A systematic review on open-set segmentation. Computers & Graphics, 115, 296-308. Souza AP, Oliveira BA, Andrade ML, Starling MCVM, Pereira AH, Maillard P, Nogueira K, dos Santos JA & Amorim CC (2023) Integrating remote sensing and machine learning to detect turbidity anomalies in hydroelectric reservoirs. Science of The Total Environment, 902, 165964-165964. Apolinário AL, dos Santos JA, Miranda F & Distante C (2023) Foreword to special section on SIBGRAPI 2022. Computers & Graphics, 114, A4-A6. Gama PHT, Oliveira H, dos Santos JA & Cesar RM (2023) An overview on Meta-learning approaches for Few-shot Weakly-supervised Segmentation. Computers & Graphics, 113, 77-88. Carvalho T, Martinez JAC, Oliveira H, Santos JAD & Feitosa RQ (2023) Outlier Exposure for Open Set Crop Recognition From Multitemporal Image Sequences. IEEE Geoscience and Remote Sensing Letters, 20, 1-5. Machado G, Pereira MB, Nogueira K & Santos JAD (2023) Facing the Void: Overcoming Missing Data in Multi-View Imagery. IEEE Access, 11, 12547-12554. Barros P, Queiroz F, Figueiredo F, Santos JAD & Ramos H (2023) A New Similarity Space Tailored for Supervised Deep Metric Learning. ACM Transactions on Intelligent Systems and Technology, 14(1), 1-25. Gama PHT, Oliveira H, Junior JM & Santos JAD (2023) Weakly Supervised Few-Shot Segmentation via Meta-Learning. IEEE Transactions on Multimedia, 25, 1784-1797. Oliveira H, Silva C, Machado GLS, Nogueira K & dos Santos JA (2023) Fully convolutional open set segmentation. Machine Learning, 112(5), 1733-1784. Monteiro BAA, Oliveira H & Santos JAD (2022) Self-Supervised Learning for Seismic Image Segmentation From Few-Labeled Samples. IEEE Geoscience and Remote Sensing Letters, 19, 1-5. Liesenberg V, Estrabis NV, Junior JM, Gomes AR, Paes RL, Pabon REC & Santos JAD (2022) The IEEE GRSS Brazil Chapter: 2020 Activities [Chapters]. IEEE Geoscience and Remote Sensing Magazine, 10(1), 354-360. Apolinário AL, Dos Santos JA, Miranda F & Distante C (2022) Message from the Program Chairs. Proceedings 2022 35th Conference on Graphics Patterns and Images Sibgrapi 2022. Chamorro Martinez JA, Oliveira H, Santos JAD & Feitosa RQ (2022) Open Set Semantic Segmentation for Multitemporal Crop Recognition. IEEE Geoscience and Remote Sensing Letters, 19, 1-5. Nogueira K, Chanussot J, Mura MD & Santos JAD (2021) An Introduction to Deep Morphological Networks. IEEE Access, 9, 114308-114324. Pereira EM, Torres RDS & dos Santos JA (2021) A genetic algorithm approach for image representation learning through color quantization. Multimedia Tools and Applications, 80(10), 15315-15350. Osco LP, Nogueira K, Marques Ramos AP, Faita Pinheiro MM, Furuya DEG, Gonçalves WN, de Castro Jorge LA, Marcato Junior J & dos Santos JA (2021) Semantic segmentation of citrus-orchard using deep neural networks and multispectral UAV-based imagery. Precision Agriculture, 22(4), 1171-1188. Machado G, Ferreira E, Nogueira K, Oliveira H, Brito M, Gama PHT & Santos JAD (2021) AiRound and CV-BrCT: Novel Multiview Datasets for Scene Classification. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 14, 488-503. Liesenberg V, Marcato J, Feitosa RQ, Gomes AR, dos Santos JA, Paes RL, Mitishita EA, Tommaselli AMG, Sombra de Sombra FN & Frery AC (2020) IEEE GRSS Brazil Chapter: Status and Activities in 2019 [Chapters]. IEEE Geoscience and Remote Sensing Magazine, 8(4), 144-151. Oliveira H, Mota V, Machado AMC & dos Santos JA (2020) From 3D to 2D: Transferring knowledge for rib segmentation in chest X-rays. Pattern Recognition Letters, 140, 10-17. Oliveira HN, Ferreira E & Santos JAD (2020) Truly Generalizable Radiograph Segmentation With Conditional Domain Adaptation. IEEE Access, 8, 84037-84062. Mota VF, de Oliveira HN, Scalzo S, Dittz D, Santos RJ, dos Santos JA & Araújo ADA (2020) From video pornography to cancer cells: a tensor framework for spatiotemporal description. Multimedia Tools and Applications, 79(19-20), 13919-13949. Caetano C, de Melo VHC, Brémond F, dos Santos JA & Schwartz WR (2019) Magnitude-Orientation Stream network and depth information applied to activity recognition. Journal of Visual Communication and Image Representation, 63, 102596-102596. Nogueira K, Dalla Mura M, Chanussot J, Schwartz WR & dos Santos JA (2019) Dynamic Multicontext Segmentation of Remote Sensing Images Based on Convolutional Networks. IEEE Transactions on Geoscience and Remote Sensing, 57(10), 7503-7520. Nogueira K, dos Santos JA, Menini N, Silva TSF, Morellato LPC & Torres RDS (2019) Spatio-Temporal Vegetation Pixel Classification by Using Convolutional Networks. IEEE Geoscience and Remote Sensing Letters, 16(10), 1665-1669. Menini N, Almeida AE, Lamparelli R, le Maire G, dos Santos JA, Pedrini H, Hirota M & Torres RDS (2019) A Soft Computing Framework for Image Classification Based on Recurrence Plots. IEEE Geoscience and Remote Sensing Letters, 16(2), 320-324. Nogueira K, Fadel SG, Dourado IC, de O. Werneck R, Munoz JAV, Penatti OAB, Calumby RT, Li LT, dos Santos JA & Torres RDS (2018) Exploiting ConvNet Diversity for Flooding Identification. IEEE Geoscience and Remote Sensing Letters, 15(9), 1446-1450. Esmael AA, dos Santos JA & da Silva Torres R (2018) On the ensemble of multiscale object-based classifiers for aerial images: a comparative study. Multimedia Tools and Applications, 77(19), 24565-24",
  "content_length": 39797,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:37"
}