{
  "name": "Jeffrey A. Fessler",
  "homepage": "https://web.eecs.umich.edu/~fessler",
  "status": "success",
  "content": "Fessler, Jeffrey A.: UM EECS Web page. Jeffrey A. Fessler [he/him/his] (NameCoach for Fɛs-lɚr) is the William L. Root Distinguished University Professor of EECS. He is a Professor in the ECE Division of the Electrical Engineering and Computer Science department of the College of Engineering, located within the scenic North Campus of The University of Michigan in the #1 ranked town of Ann Arbor, Michigan. He is also affiliated with the Biomedical Engineering Department and with the Department of Radiology. The University of Michigan has been rated as the top US public university that is #1 in value and is a great place to work. New book from Cambridge University Press Linear Algebra for Data Science, Machine Learning, and Signal Processing by Jeffrey A. Fessler and Raj Rao Nadakuditi Preview of accompanying software demos at https://github.com/JeffFessler/book-la-demo Table of contents and chapter abstracts here. See https://www.cambridge.org/highereducation/isbn/9781009418140 for adoption information, https://doi.org/10.1017/9781009418164 for eBook, and Barnes & Noble books. See preview at google books or the vitalsource version, and check out our competition with graph paper. This book is suitable for readers of all ages! My research interests include medical imaging, tomography, nonparametric estimation, and inverse problems, with current and past projects in X-ray CT, MRI, PET, SPECT, radiation therapy, and image registration. I am interested both in developing algorithms for these problems, as well as analyzing and predicting the properties of these algorithms. My group works on a wide variety of imaging projects, both for medical imaging and some non-medical imaging problems. For a snapshot of our current research, see recent preprints under the \"publication\" link below. Publications: reprints and preprints. [Google Scholar] [Semantic Scholar] [DBLP] [arXiv] [exaly] Software: Michigan image reconstruction toolbox (MIRT) (for Matlab): Includes tomography, NUFFT, MRI. Open source and free! github includes MIRT.jl, the Julia version of MIRT, and MIRT demos in Jupyter notebooks ASPIRE image reconstruction software (free compiled binaries) TERSE: transmission and emission reconstruction environment for SPECT Vspline (vector spline) smoothing package Reproducible research code Results illustrating iterative image reconstruction (picture gallery). Prospective interns, students, post-docs, visitors please read this! Group members / dissertations Collaborators Course information Biographical information Bibliographies for imaging url public Junk under construction Online seminars / talks YouTube channel Imaging & inverse problems (IMAGINE) Mathematics of INformation, Data, and Signals (MINDS) Signal Processing And Computational imagE formation (SPACE) 2020 SIAM Math of Data Science Machine Learning and AI in imaging: Sep. 12-13, 2022: Workshop on modern image reconstruction algorithms and practices for medical imaging [recordings] 2021 ICCV: 2nd Learning for Computational Imaging (LCI) Workshop; Sensing, Reconstruction, and Analysis 2020 SIAM Conf. on Imaging Science (IS20): Minitutorial (video on YouTube) 2020 IPAM workshop on Deep Learning and Medical Applications 2019 IMA computational imaging workshop Tutorial in computational imaging using the Julia programming language 2019 ICCV: Learning for Computational Imaging (LCI) Workshop 2018 ISBI: Special Session on Smart Imaging Systems 2018 Special issue of IEEE Transactions on Medical Imaging: Machine Learning for Image Reconstruction 2018 MLSP: Special session on Machine Learning for Computational Imaging 2017 Imaging Summit: Medical imaging in the era of AI Past conferences: Feb. 5-10, 2023: BASP Frontiers June 25-30, 2023: Leveraging Model- and Data-Driven Methods in Medical Imaging Upcoming conferences: Research in my group has been supported in part by generous GPU donations from NVIDIA, research support from GE Healthcare, Intel Corporation, and KLA-Tencor, as well as state and federal sources. Jeff Fessler fessler at umich dot edu 734-763-1434 4431 EECS Bldg., 1301 Beal Ave. University of Michigan Ann Arbor, MI 48109-2122",
  "content_length": 4152,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:43"
}