{
  "name": "Jeff M. Phillips",
  "homepage": "http://www.cs.utah.edu/~jeffp",
  "status": "success",
  "content": "Jeff M Phillips Jeff M Phillips Professor, Kahlert School of Computing, University of Utah BS Computer Science, Rice University (2003) BA Mathematics, Rice University (2003) Ph.D. Computer Science, Duke University (2009) CI Postdoctoral Fellow, School of Computing, University of Utah (2009-2011) Director, Utah Center for Data Science. Director, Data Science Program in the Kahlert School of Computing, including the Graduate Program in Data Science. Faculty Co-Director One U Data Science Hub. part of Utah DB Group. Utah and an AI-lead for NSF-Simons CosmicAI Institute Students | Teaching | Books | Funding | News | External Service | Publications | Bio U of Utah Address: 50 S Central Campus Dr. 3190 Salt Lake City, UT 84112 (801) 585-8224 (main office) (801) 581-5843 (fax) Email: jeffp|at|cs.utah.edu Office: 3404 Merril Engineering Building CV: CV (probably out of date) Official UU page: Elements Bio Research Interests: Algorithms for Big Data Analytics: Geometric Data Analysis, Computational Geometry, Coresets and Sketches, Machine Learning, Spatial Statistics, Data Management, AI, Handling Uncertainty, Data Mining. Students and Postdoc: Meysam Alishahi (PhD) expected graduation in winter 2025-26 Foad Namjoo (PhD) started 2023 Hamid ShafieAsl (PhD) started 2024 Gazi Abdur Rakib (PhD) started 2024 Remy Ogasawara (PhD) started 2025 Cullen Anderson (BS at UMass, REU at UU) expected graduation in 2026 Ashley Lujan (MS) started 2025 Jens Kristian (JK) Schou (RAI postdoctoral Fellow) started 2025 Former Students Teaching: Data Mining | CS 6140/5140 / DS 4140 | Fall 2025 | MW 1:25-2:45pm | HEB 2004 old: Foundations of Data Analysis (Math for Data) | Fall 2022 | Fall 2021 | Fall 2020 | Fall 2019 | Fall 2017 | Fall 2016 Data Mining | Spring 2025 | Spring 2020 | Spring 2019 | Spring 2018 | Spring 2017 | Spring 2016 | Spring 2015 | Spring 2014 | Spring 2013 | Spring 2012 Ethics in Data Science (CS/DS 3390) | Spring 2021 High-Dimensional Data Analysis | Fall 2024 Programming for BioMedical Data Science (run & led by Rebecca Barter) | Fall 2024 | Fall 2025 Probability and Statistics for Engineers | Spring 2023 | Fall 2014 Data Mining Seminar | Spring 2015 (Matrix Sketching) | Fall 2013 (MCMD) | Fall 2012 (sampling) | Fall 2010 (uncertainty) Data Science Seminar | Spring 2023 | Fall 2021 | Fall 2020 | Spring 2020 | Spring 2019 | Spring 2018 | Spring 2017 | Spring 2016 | Fall 2014 | Spring 2014 | Spring 2012 Models of Computation for Massive Data | Fall 2013 | Fall 2011 Books: Mathematical Foundations for Data Analysis Springer-Nature 2021. Funding: NSF Spatial Data Multi-Agent Simulations | NSF-Simons AI Institute for Cosmic Origins | NSF Geometry of Learning on Structured Data Objects | Extracting Models from Reactive Flow Data | previous: Big Data Summaries | STORM : Spatio-Temporal Data | SEAL : Secure Cloud Analytics | Detecting Spectrum Offenders | Interactive and Online Sampling and Analytics | Persistent Data Summaries | Noisy Geometric Data Analysis | News and notes: A number of Utah students (mostly Michael Matheny, Foad Namjoo, and Simon Gonzalez) have contributed to the pyScan library for finding spatial anomalies. This repo by Simon Gonzalez is the best starting point. Peter Jacobs (joining U Wisconsin Statistcs as postdoc) defended his PhDs in Summer 2025. Hasan Pourmahmood (joining Walmart) and Mingxuan Han (joining Meta) defended their PhDs in Summer 2024. I organized (with Alex Munteanu) the CG-Week (which includes SOCG) Workshop on Geometry and Machine Learning. It took place June 13, 2024 in Athens, Greece. I also co-organized previous iterations in 2023, 2022, 2021, 2019, 2018, 2017, and 2016. Tao Yang (joining Amazon) and Benwei Shi (joining Meta) defended their PhDs in late Fall 2023. I was co-PC Chair for SoCG 2024. I am spending Fall 23 - Spring 24 on sabbatical in Leipzig, Germany at SCaDS.AI, Uni Leipzig, and MPI for Math in Sciences. I was promoted to (Full) Professor in Summer 2023. Prince Osei Aboagye (joining Visa Research) defended his PhD in Summer 2023. Zhuoyue Zhao (joining U Bufallo as Assistant Prof) and Zhao Chang (joining Xidan University as faculty) both defneded their PhDs in Spring/Summer 2020. Both were coadvised by Feifei Li. My \"Math for Data\" book Mathematical Foundation for Data Analysis is published by Springer and also available on Amazon. I helped form a new university center, the Utah Center for Data Science. It launched in October 2019, and I am the founding director. I helped create a new undergraduate major, a Bachelors of Science in Data Science. It launched in Fall 2019, and I am the director. I post and live-stream many videos of my lectures on Youtube. They now appear on the Utah Data Youtube Channel. Older versions are here and here. Selected Program Committees: SoCG 2024 (co-PC Chair), 2021, 2016, SODA 2024, 2015, ICDT 2026, ICDT 2024, 2017, ICDE 2022 (Demo Co-Chair), 2014, FWCG 2021, 2014, 2012, ESA (track A) 2021, 2013, (track B) 2017, ICALP 2020, NeurIPS 2018, 2019, 2020, 2021, 2022, 2024, 2025 AIStats 2018, 2019, 2020, 2021,2022, 2025 SIGSPATIAL 2017 2018, 2019, and 2020, PODS 2017, 2015 CG:YRF 2016, ICDE 2016, MASSIVE 2014, CIKM 2013, KDD 2012. Selected Journal Service: Editorial Board Computing in Geometry and Topology (2021 - ). Action Editor Transactions on Machine Learning Research (2023 - ). Associate Editor IEEE Transactions on Knowledge and Data Engineering (2016 - 2020), Associate Editor SIAM Journal of Scientific Computing, Special Issue for Software and Big Data (2014 - 2016). Publications: (DBLP, Google Scholar, Semantic Scholar, ArXiv) Designing a Secure and Resilient Distributed Smartphone Participant Data Collection System. Foad Namjoo, Neng Wan, Devan Mallory, Yuyi Chang, Nithin Sugavanam, Long Yin Lee, Ning Xiong, Emre Ertin, Jeff M. Phillips. EAI SmartSP 2025 Conference. December 2025. arXiv:2510.19938. October 2025. Enhancing Urban Paratransit Reliability: A Spatial-Temporal and Causal Analysis of Service Inefficiencies . Arman Malekloo; Xiaoyue Cathy Liu; Nikola Markovic; Chenxi Liu; Jeff Phillips. ASCE Journal of Urban Planning and Development. 2025. Dimension-Independent Kernel eps-Covers. Jeff M. Phillips and Hasan Pourmahmood-aghababa. Computing in Geometry and Topology. June 2025. preliminary version at as For Kernel Range Spaces a Constant Number of Queries Are Sufficient at Fall Workshop on Computational Geometry. October 2022. arXiv:2306.16516. June 2023. Zombie Hashing: Reanimating Tombstones in Graveyard. Benwei Shi, Yuvaraj Chesetti, Jeff M. Phillips, and Prashant Pandey. International Conference on Management of Data (SIGMOD). June 2025. Estimation of Large Zipfian Distributions with Sort and Snap. Peter Matthew Jacobs, Jeff M. Phillips, Anirban Bhattacharya, Debdeep Pati, and Lekha Patel. Artificial Intelligence and Statistics (AIStats). May 2025. Standard Gaussian Process Can Be Excellent for High-Dimensional Bayesian Optimization (Oral). Zhitong Xu, Haitao Wang, Jeff M. Phillips, Shandian Zhe. International Conference on Learning Representations (ICLR). April 2025. Robust High-Dimensional Mean Estimation With Low Data Size, an Empirical Study. Cullen Anderson and Jeff M. Phillips. Transactions on Machine Learning Research (TMLR). February 2025. Fast Comparative Analysis of Merge Trees Using Locality-Sensitive Hashing. Raghavendra Sridharamurthy, Nancy Lyu, Jeff M. Phillips, and Bei Wang. IEEE VIS: Visualization & Visual Analytics (VIS). October 2024. arXiv:2409.08519. September 2024. No Dimensional Sampling Coresets for Classification. Meysam Alishahi and Jeff M. Phillips. International Conference on Machine Learning (ICML) (Spotlight). July 2024. arXiv:2402.05280. February 2024. Linear Distance Metric Learning with Noisy Labels. Meysam Alishahi, Anna Little, and Jeff M. Phillips. Journal of Machine Learning Research (JMLR). April 2024. arXiv:2306.03173. June 2023. Mitigating Exploitation Bias in Learning to Rank with an Uncertainty-aware Empirical Bayes Approach. Tao Yang, Cuize Han, Chen Luo, Parth Gupta, Jeff M. Phillips, and Qingyao Ai. The Web Conference. May 2024. arXiv:2305.16606. May 2023. Sketching Multidimensional Time Series for Fast Discord Mining. Chin-Chia Michael Yeh, Yan Zheng, Menghai Pan, Huiyuan Chen, Zhongfang Zhuang, Junpeng Wang, Liang Wang, Wei Zhang, Jeff M. Phillips, and Eamonn Keogh. IEEE International Conference on Big Data. December 2023. Locally Adaptive and Differentiable Regression. Mingxuan Han, Varun Shankar, Jeff M. Phillips, Chenglong Ye. Journal of Machine Learning for Modeling and Computing 4(4):103-122. 2023. arXiv:2308.07418. August 2023. VERB: Visualizing and Interpreting Bias Mitigation Techniques for Word Representations. Archit Rathore, Sunipa Dev, Jeff M. Phillips, Vivek Srikumar, Yan Zheng, Chin-Chia Michael Yeh, Junpeng Wang, Wei Zhang, and Bei Wang. ACM Transactions on Interactive Intelligent Systems. 2023. arXiv:2104.02797. April 2021. KDD21 Tutorial Ferret: Reviewing Tabular Datasets for Manipulation. Devin Lange, Shaurya Sahai, Jeff M. Phillips, and Alexander Lex. 25th EG Conference on Visualization (EuroVis). June 2023. OSF.IO/anj8v. December 2022. Interpretable Debiasing of Vectorized Language Representations with Iterative Orthogonalization. Prince Osei Aboagye, Yan Zheng, Jack Shunn, Chin-Chia Michael Yeh, Junpeng Wang, Zhongfang Zhuang, Huiyuan Chen, Liang Wang, Wei Zhang, and Jeff Phillips. International Conference on Learning Representations (ICLR). April 2023. An Experimental Study On Classifying Spatial Trajectories. Hasan Pourmahmood-aghababa and Jeff M. Phillips. Knowledge and Information Systems (KAIS). December 2022. arXiv:2209.01322. September 2022. Batch Multi-Fidelity Active Learning with Budget Constraints. Shibo Li, Jeff Phillips, Xin Yu, Robert Kirby, Shandian Zhe. Neural Information Processing Systems (NeurIPS). December 2022. arXiv:2210.12704. October 2022. Local Kernel Ridge Regression for Scalable, Interpolating, Continuous Regression. Mingxuan Han, Chenglon",
  "content_length": 35743,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:40"
}