{
  "name": "Jeffrey Xu Yu",
  "homepage": "http://www.se.cuhk.edu.hk/people/yu.html",
  "status": "success",
  "content": "Prof. YU, Xu, Jeffrey 于 旭 教授 - Department of Systems Engineering and Engineering Management, CUHK Prof. YU, Xu, Jeffrey 于 旭 教授 Home » People » Academic Staff » Prof. YU, Xu, Jeffrey 于 旭 教授 Prof. YU, Xu, Jeffrey 于 旭 教 授 Emeritus Professor BE, ME, PhD (University of Tsukuba) Research Interests : * Graph Database and _Query Processing * Graph Mining * Social Networks * Big Data and Cloud _Computing * Machine Learning _in Database Email : yu@se.cuhk.edu.hk DB-group webpage Biography Dr. Jeffrey Xu Yu is our Emeritus Professor of the Department of Systems Engineering and Engineering Management, The Chinese University of Hong Kong. His current main research interests include keywords search in relational databases, graph mining, graph query processing, and graph pattern matching. Dr. Yu served/serves in over 300 organization committees and program committees in international conferences/workshops including the PC Co-chair of APWeb’04, WAIM’06, APWeb/WAIM’07, WISE’09, PAKDD’10, DASFAA’11, ICDM’12, NDBC’13, ADMA’14, CIKM’15, Bigcomp’17, DSAA’19 and CIKM’19, and conference general co-chair of APWeb’13 and ICDM’18. Dr. Yu served as an Information Director and a member in ACM SIGMOD executive committee (2007-2011), an associate editor of IEEE Transactions on Knowledge and Data Engineering (2004-2008), an associate editor in VLDB Journal (2007-2013), and the chair of the steering committee in Asia Pacific Web Conference (2013-2016). Currently, he serves as associate editor in ACM Transactions on Database Systems, WWW Journal, the International Journal of Cooperative Information Systems, the Journal of Information Processing, and Journal on Health Information Science and Systems. Jeffrey Xu Yu is a member of ACM, a senior member of IEEE, and a member of IEEE Computer Society. Book Publications Keyword Search in Databases, Jeffrey Xu Yu, Lu Qin, and Lijun Chang, Morgan & Claypool, 2009. Web Communities: Analysis and Construction, Yanchun Zhang, Jeffrey Xu Yu, and Jingyu Hou, Springer, 2006. Selected Publications (@DBLP, @ACM, @AMiner,  @Google-Scholar) Jiadong Xie, Jeffrey Xu Yu, and Yingfan Liu: Fast Approximate Similarity Join in Vector Databases, ACM SIGMOD International Conference on Management of Data (SIGMOD’25) 2025. Rui Li, Zongyan He, and Jeffrey Xu Yu: Join optimization revisited: a novel DP algorithm for join&sort order selection, VLDB Journal, Vol 34, No 3, 2025. Zongyan He and Jeffrey Xu Yu: A Branch-&-Bound Algorithm for Fractional Hypertree Decomposition, in Proceedings of the VLDB Endowment (PVLDB), Vol 17, No 13, 2024. Zhixun Li, Yushun Dong, Qiang Liu, and Jeffrey Xu Yu: Rethinking Fair Graph Neural Networks from Re-balancing, in Proceedings of the 30th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (SIGKDD’24), 2024. Jia Li, Xiangguo Sun, Yuhan Li, Zhixun Li, Hong Cheng, and Jeffrey Xu Yu: Graph Intelligence with Large Language Models with Prompt Learning, in Proceedings of the 30th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (SIGKDD’24), 2024. Hao Zhang, Jeffrey Xu Yu, Yikai Zhang, and Kangfei Zhao: Parallel Query Processing: To Separate Communication from Computation. ACM SIGMOD International Conference on Management of Data (SIGMOD’22) 2022. Kangfei Zhao, Jiao Su, Jeffrey Xu Yu, Hao Zhang: “SQL-G: Efficient Graph Analytics by SQL”, IEEE Transactions on Knowledge and Data Engineering, Vol. 33, No. 5, 2021. Hao Zhang, Jeffrey Xu Yu, Yikai Zhang, and Kangfei Zhao: “Distributed Subgraph Counting: A General Approach”, in Proceedings of the VLDB Endowment (PVLDB), Vol. 13, No. 11, 2020. Yikai Zhang, and Jeffrey Xu Yu: “Unboundedness and Efficiency of Truss Maintenance in Evolving Graphs”, in Proceedings of the 2019 ACM SIGMOD International Conference on Management of Data (SIGMOD’19), 2019. Kangfei Zhao and Jeffrey Xu Yu: “All-in-One: Graph Processing in RDBMSs Revisited”, in Proceedings of the 2017 ACM SIGMOD International Conference on Management of Data (SIGMOD’17), 2017. Department Prospectus 25-26 (PDF) FinTech Programme Leaflet 25-26 (PDF) SEEM Programme Leaflet 25-26(PDF)",
  "content_length": 4086,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:03"
}