{
  "name": "Jeffrey S. Rosenshein",
  "homepage": "http://www.cs.huji.ac.il/~jeff",
  "status": "success",
  "content": "Jeff Rosenschein's Homepage Rachel and Selim Benin School of Computer Science and Engineering/Computer Science Jeffrey S. Rosenschein Sam and Will Strauss Professor of Computer Science The Rachel and Selim Benin School of Computer Science and Engineering  The Hebrew University of Jerusalem  The Edmond J. Safra Campus, Givat Ram, Jerusalem  91904  Israel email: jeff at cs.huji.ac.il  office: Rothberg Engineering Building, Room C527   phone: +972-2-549-4563   office hour: send me an email to arrange a meeting I am director of the Multiagent Systems Research Group at Hebrew University, which made its mark in early work on game theory and mechanism design as applied to multiagent negotiation and planning. That research explored issues of cooperation and competition among agents, and the use of economic theory, voting theory, and game theory to establish appropriate foundations for Multiagent Systems (MAS). Our more recent work has touched on a variety of additional artificial intelligence research areas, including search, planning, multiagent learning, reputation systems, and dynamic control, though we remain particularly active in the area of computational social choice and preference aggregation. Here is a historical 2008 photo of the group, and a 2016 \"alumni photo\". My PhD graduate, Reshef Meir, was named in January 2016 by IEEE Intelligent Systems in its (once every two year) list of \"AI's 10 to Watch\", 10 young stars in the field of Artificial Intelligence. In the previous list (in 2013), two of my former PhD graduates, Ariel Procaccia and Aviv Zohar, were included. And Ariel Procaccia was the winner of the 2015 IJCAI Computers and Thought Award, given \"to outstanding young scientists in artificial intelligence\". Visit the Critical MAS web site to find out more about our research group. In the spring semester of 2023-2024, I taught Introduction to Artificial Intelligence. I was named one of Hebrew University's outstanding teachers (based on student evaluations) for 2008/2009, 2009/2010, 2011/2012, 2013-2014, and for 2015-2016. I was a recipient of the 2011 Hebrew University Rector's Prize for Excellence in Research, Teaching and Active Participation in the Academic Life of the University. I am a contributor to the Handbook of Computational Social Choice, which came out in April 2016. This is the official website of the book. As of May 2017, Cambridge University Press is providing a password-free version. Here is a lecture I gave on Cooperative Games in Multiagent Systems, as part of a workshop sponsored by the Israeli Center of Knowledge for Machine Learning and Artificial Intelligence, on May 27, 2014. I am a Fellow of the Association for Computing Machinery (ACM), a Fellow of the Association for the Advancement of Artificial Intelligence (AAAI), a Fellow of the European Association for Artificial Intelligence (EurAI), and the recipient of the 2013 ACM/SIGART Autonomous Agents Research Award (now ACM/SIGAI). I served as the General Conference Chair of the combined 27th International Joint Conference on Artificial Intelligence and 23rd European Conference on Artificial Intelligence (IJCAI/ECAI 2018), held in Stockholm, Sweden in 2018 (and was on the IJCAI Board of Trustees from 2015 to 2020). I was Program Co-Chair for the Sixth International Workshop on Computational Social Choice (COMSOC 2016), held in Toulouse, France in June 2016 (and was on the COMSOC Steering Committee from 2016 to 2021). I was co-Editor-in-Chief (along with first Michael Wooldridge, and then Peter Stone) of the Journal of Autonomous Agents and Multiagent Systems (JAAMAS) from January 2008 through December 2013 (I continue as a Coordinating Editor). From July 2004 through June 2007 I served as president of the International Foundation for Autonomous Agents and Multiagent Systems (IFAAMAS), formerly known as IFMAS, a non-profit organization whose purpose is to promote science and technology in the areas of artificial intelligence, autonomous agents, and multiagent systems. IFAAMAS sponsors the annual International Conference on Autonomous Agents and Multi-Agent Systems, which will be held in 2025 in Detroit, after past conferences in Bologna, Melbourne, New York, Utrecht, Hakodate, Honolulu, Estoril (Portugal), Budapest, Toronto, Taipei, Valencia, Saint Paul, Minnesota, Paris, Istanbul, Singapore, São Paulo, Stockholm, Montreal, Auckland, London, and Auckland. I was chairman of the Israeli Association for Artificial Intelligence from June 2008 to June 2010. I served as Head of The Rachel and Selim Benin School of Computer Science and Engineering, from October 2011 through September 2014. Between October 2003 and June 2007 I was Department Chair of Computer Engineering, within the School of Computer Science and Engineering at Hebrew University; I had previously served as Department Chair of Computer Science, from February 1999 to October 2000. Publications CV Multiagent Systems Research Group (Critical MAS) Early MAS Research at Hebrew University Back to CS HUJI Home Page jeff at cs.huji.ac.il Last modified: 31 July 2024 Â© All rights reserved to The Hebrew University of Jerusalem",
  "content_length": 5149,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:03"
}