{
  "name": "Jeffrey Popyack",
  "homepage": "https://www.cs.drexel.edu/~jpopyack",
  "status": "success",
  "content": "Jeffrey L. Popyack Professional Affiliations/Activities Current: Emeritus Professor of Computer Science Department of Computer Science, Drexel University Member, Executive Council, Upsilon Pi Epsilon, 1991-2009, 2010-17, 2018- International President: 1995-6, 2000-2, 2006-8, 2014-6, 2021-2 columnist, ACM Inroads. columns Principal Investigator, Jumpstarting Philadelphia CS for All Researcher-Practitioner Partnership (w/Jamie Payton, Tammy Pirmmann) (2020-) Co-chair, CS4Philly Advisory Committee (w/Jamie Payton) (2019-) Co-chair, Philadelphia STEM Ecosystem Computer Science Workgroup (w/Jamie Payton) (2019-) Member, Philadelphia STEM Ecosystem Steering Committee (2019-) Old Favorites: Faculty Advisor, Upsilon Pi Epsilon Student Chapter (1989-2022) REThink CS @ Drexel (2013-6), (2017-2020) (Research Experiences for Teachers Site for Machine Learning to Enhance Human-Centered Computing) Visiting Professor, Department of Computer Science, Duke University (Spring 2017) Phase II Pilot Site/Instructor for AP Computer Science Principles (2013-6) Robot Springboard @ Drexel (2013-19), an exciting outreach program for which I was pleased and proud to be a mentor Faculty Advisor, DUCSTeach (2012-7), Women in Computing Society (2006-8), MCS Society (1999-2012) Academic Director, Drexel University Computing Academy, 2009-12 (formerly Pennsylvania Governor's School for Information, Society and Technology, 2001-8) Project DUPLEX (2000-2005) Associate Head for Undergraduate Affairs, Department of Computer Science, 2002-2012 Coach, Scholastic Computer Programming Team, 1984-2011 Course Information Highlights ARCHIVES: Designing the Personal Computer of the Year 2000 (from UPE Spring 2000 newsletter) ARCHIVES: My Eyewitness Account of DEEP BLUE's Historic Defeat of Garry Kasparov, Feb. 10, 1996 Post-It Pandemonium Read about our Post-It Pandemonium educational activities. Inside Scoop on Commencement Activities Armed with a digital camera, your intrepid photographer has recorded these images from Drexel's Commencement Exercises... (Note: from 2009-14, pictures taken by Julie Fisher and/or me appear on the CS Dept. Facebook page.) Commencement 2008 Commencement 2007 Commencement 2006 Commencement 2005 Commencement 2004 Commencement 2003 Commencement 2002 Commencement 2001 Commencement 2000 Commencement 1999 Commencement 1998 Commencement 1997 How to Contact Me At Drexel University: Electronic Mail:  My Last Name   Symbol   drexel   Symbol   edu Mailing Address Dept. of Computer Science Phone (215) 895-1846 Drexel University Dept. Office (215) 895-2669 Philadelphia, PA 19104-2875 FAX (215) 895-0545 Office Location 3675 Market Street, Room 1060 (see Campus Map) Computer Science Dept. Homepage College of Computing and Informatics Homepage Drexel University Homepage",
  "content_length": 2792,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:02"
}