{
  "name": "Jeffery Raphael",
  "homepage": "https://www.kcl.ac.uk/people/jeffery-raphael",
  "status": "success",
  "content": "Jeffery Raphael | King's College London Skip to main contentDr Jeffery Raphael Lecturer in Computer ScienceResearch interestsComputer scienceContact details+44 020 7848 8665jeffery.raphael@kcl.ac.ukBiographyDr Jeffery Raphael is a Lecturer in Computer Science in the Department of Informatics, King’s College London. He received his PhD at the University of Liverpool where he studied auction-based cooperation mechanisms in MultiAgent systems. He developed the first King's International Foundation, Introduction to Computer Science and Engineering module. This module is part of a programme that prepares international students for their entry into the UK Higher Education system. His research interests include cooperation in MultiAgent systems and application of Generative AI for automated marking & feedback and assessment creation. More specifically, how Generative AI techniques can be used to create assessment tasks that better match student ability. Jeffery is also a Fellow of the UK Higher Education Academy. Research Interests Machine learning Multi-agent System Intelligent Transportation Systems Generative AI Educational Chatbots ResearchResearchReasoning and PlanningThe group focuses on the fundamental AI challenge of creating, representing and reasoning. Computing Education Research Centre (CERC)The Computing Education Research Centre at King's College London carries out research, develops tools, conducts studies, creates pedagogy, and supervises PhD projects related to computer science education.ResearchResearchReasoning and PlanningThe group focuses on the fundamental AI challenge of creating, representing and reasoning. Computing Education Research Centre (CERC)The Computing Education Research Centre at King's College London carries out research, develops tools, conducts studies, creates pedagogy, and supervises PhD projects related to computer science education.(S)5.03Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering SciencesComputing Education Research Centre (CERC)",
  "content_length": 2089,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:43"
}