{
  "name": "Jeffrey A. Miller",
  "homepage": "https://pressroom.usc.edu/jeffrey-miller",
  "status": "success",
  "content": "Pressroom - USC Today Skip to Content Pressroom Show more Information Guests and media turnout for the LA Memorial Coliseum reopening celebration, August 15, 2019. (Photo/Gus Ruelas) USC Pressroom is the journalist’s gateway to connecting with USC’s faculty and subject matter experts, staying updated on USC press releases, and accessing USC’s media contacts—all in one reliable resource for media professionals. Find an Expert Media Contacts Email Us Call Us Media Access The Latest from USC Source Alerts As the world mourns Pope Francis, USC scholars offer insight on the history and future of the papacy USC scholars are available to provide expert commentary on the history and significance of the papacy, the Vatican’s role in global affairs and the intricate process of electing a new pope. Apr 23, 2025 U.S. presidential transition: USC experts available for policy analysis, discussion USC experts are available to provide analysis and insights on the pressing issues shaping the U.S. presidential transition. Feb 6, 2025 Quantum computing’s future USC scientists are available to discuss quantum technology and where it is headed. Jan 29, 2025 News Releases Quantum computer outperforms supercomputers in approximate optimization tasks USC-led study demonstrates the first quantum scaling advantage for approximate optimization problem-solving using a quantum annealer. Apr 30, 2025 ‘Solar canals’: A bright solution for California’s water and energy needs? The USC-led California Solar Canal Initiative could transform major portions of the state’s 4,000 miles of canals into a powerful source of clean energy and water conservation. Mar 26, 2025 Exposure to certain pollution sources harms children’s learning and memory, USC study shows The peer-reviewed study contributes to mounting evidence that the fine particulates PM2.5 are detrimental for memory and cognition for people of all ages. Oct 31, 2024 Get Expert Insight and Opinion Christian Grose Expert in U.S. politics and government, especially the role of race in the political process Dima Qato Expert in health policy, pharmacoepidemiology, drug safety and health disparities Aya Gruber Expert on criminal law and procedure, feminist legal theory and criminal justice A Resource for Journalists Pressroom is a centralized resource for journalists, reporters, and other media professionals, offering a comprehensive listing of USC faculty subject matter experts, allowing access to authoritative voices. Media Inquiries: uscnews@usc.edu (213) 740-2215 Visit emergency.usc.edu for information on USC’s emergency resources and university bulletins during emergencies. Get News Releases by Email Name Email Subscribe",
  "content_length": 2687,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:44"
}