{
  "name": "Jeffrey C. Carver",
  "homepage": "http://carver.cs.ua.edu",
  "status": "success",
  "content": "[ Jeffrey C. Carver @ University of Alabama ] Jeffrey C. Carver, Ph.D. James R. Cudworth Professor Associate Department Head for Graduate Studies Department of Computer Science University of Alabama Box 870290 Tuscaloosa, AL 35487 Tel: (205) 348-9829 Email: EXPAND ALL SECTIONS COLLAPSE ALL SECTIONS Introduction Overview Short Biography » CV (PDF)» I am a Full Professor in the Department of Computer Science at The University of Alabama. I completed my PhD work under the supervision of Dr. Victor Basili at the University of Maryland. My general research interest lie in the area of empirical software engineering and human factors in software engineering. My research focuses on topics including: software engineering for research software, software quality assurance, peer code review, software security, human errors, and software engineering education. Grants Active Grants NSF Collaborative Research: Planning: CROSS: Building a Community aROund Securing the Research Software Supply Chain PI: Jeffrey Carver, Amount: $44,891 Dates: September 1, 2025 - August 31, 2027. NSF Collaborative Research: CyberTraining: Implementation: Medium: Broadening and Deepening the Impact of INTERSECT PI: Jeffrey Carver, Amount: $403,536 Dates: August 15, 2025 - July 31, 2029. NSF Collaborative Research: Transforming Computing Education Research through Replication and Mentoringa> PI: Jeffrey Carver, Amount: $942,836 Dates: August 1, 2025 - July 31, 2030. NSF Boosting Student Capacity to Ensure Software Quality with an Inquiry-Based Learning Tool PI: Jeffrey Carver, Amount: $262,753 Dates: June 15, 2025 - May 31, 2028. Sloan Foundation Code Review in Research Software -- The RSE Experience PI: Jeffrey Carver, Amount: $249,432 Dates: Jan. 1, 2023 - Dec. 31, 2025. NOAA Community Water Model Infrastructure, Stewardship, and Integration PI: Steven Burian, Co-PIs: James Halgren, Jeffrey C. Carver, and Puri Bangalore, Amount: $6,525,054, Dates: Aug. 1, 2022 - July 31, 2025. [Part of the Cooperative Institute for Research to Operations in Hydrology] NSF Collaborative Research: Frameworks for Intelligent Adaptive Experimentation: Enhancing and Tailoring Digital Education, PI: Jeffrey Carver, Amount: $400,000, Dates: August 1, 2022 - July 31, 2027. NSF An Inquiry-Based Pedagogy and Supporting Tool to Improve Student Learning of Software Testing Concepts, PI: Jeffrey Carver, Amount: $403,156, Dates: Oct. 1, 2020 - Sept. 30, 2026. NSF SFS@BAMA: Shaping the Next Generation of Cyber Professionals, PI: Jeffrey Carver, Co-PIs: Travis Atkison (UA), Matthew Hudnall (UA), Raynond Partin (UA), Amount: $3,101,018, Dates: Jan. 1, 2020 - Dec. 31, 2025. Publications Most Recent Publications All Publications» Empirical Software Engineering Nasir U. Eisty, Jeffrey C. Carver, Johanna Cohoon, Ian A. Cosden, Carole Goble, and Samuel Grayson, Ten Simple Rules for Catalyzing Collaborations and Building Bridges between Research Software Engineers and Software Engineering Researchers, Computing in Science & Engineering Vol 2, 2025. Empirical Software Engineering Nasir U. Eisty, Upulee Kanewala, and Jeffrey C. Carver, Testing Research Software: An In-Depth Survey of Practices, Methods, and Tools\", Empirical Software Engineering Vol 30, 2025. Digital Scholarship in Humanities Julia Damerow, Rebecca Koeser, Jeffrey C. Carver, and Malte Vogl. Code Review in Digital Humanities, Digital Scholarship in Humanities, Accepted for Publication, 2024. Information and Software Technology Sweta Mahaju, Jeffrey C. Carver, and Gary L. Bradshaw, Human Error Management in Requirements Engineering: Should We Fix the People, the Processes, or the Environment?, Information and Software Technology Vol 160, pp. 107223, 2023. All Publications » Awards Awards CiSE Service Award 2022 Computing in Science & Engineering Service Award Faculty Research Day 2016 University of Alabama Faculty Research Day Award Winner Software Editorial Boards Editor-in-Chief Computing in Science & Engineering Special Content Editor Information and Software Technology Editorial Board Member Empirical Software Engineering Steering Committees Steering Committees US-RSE United States Research Software Engineering Association (2018-2025) [Founding Member] ESEM International Symposium on Empirical Software Engineering and Measurement (2017-2024) ISERN International Software Engineering Research Network (2019-2024) Courses Courses The Discipline of Computing (CS121) Fall 2019 Software Engineering (CS315) Spring 2011, Fall 2011, Spring 2012, Fall 2012 Software Interface Design (CS407/507) Fall 2012, Fall 2013, Fall 2016, Fall 2018 Testing and Quality Assurance (CS 416/516) Fall 2008, Fall 2017, Fall 2015, Spring 2014, Spring 2015, Spring 2017, Fall 2023 Software Security (CS444/544) Spring 2024 Capstone Computing (CS495) Spring 2018, Spring 2019, Fall 2022 Foundations of Software Engineering (CS600) Fall 2009, Fall 2010, Spring 2017 Empirical Software Engineering (CS630) Spring 2025, Spring 2009, Spring 2010, Fall 2015, Spring 2011, Spring 2013 Conference Committees Recent Conference Committees 2025 Technical Program Committee AI4DEV Technical Program Committee International Conference on Software Engineering Education & Training Technical Program Committee International Symposium on Empirical Software Engineering and Measurementa Registered Reports Program Committee International Conference on Software Maintenance and Evoluation Technical Program Committee IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER) 2024 Organizing Committee NSF CSSI PI Meeting Technical Program Committee International Conference on Software Engineering Education & Training Technical Program Committee International Symposium on Empirical Software Engineering and Measurement Technical Program Committee International Conference on Technical Debt Technical Program Committee Research Software Engineers in HPC Advising Advising Current students Ph.D. (2019 - present) Lacey Wicks Ph.D. (2019 - present) Matthew Armstrong Ph.D. (2021 - present) Md Niaz Morshed Ph.D. (2022 - present) Shiza Andleeb Ph.D. (2023 - present) Awwal Badru Ph.D. (2023 - present) Md Ariful Malik Completed students Ph.D. (2016 - 2022) Sweta Mahaju Ph.D. (2017 - 2021) Eduardo Caballero - Full-time professor with doctorate, Universidad Tecnologica de Panama Ph.D. (2016 - 2020) Nasir Eisty - Assistant Professor, Department of Computer Science, Boise State University Ph.D. (2015 - 2019) Mahran Al-Zyoud - Assistant Professor, Al-Ahliyya Amman University Ph.D. (2015 - 2019) Amanda Lee - Industry Visiting Scholar (2017 - 2018) Lilian Scatalon - Postdoctoral Researcher, University de Sao Paulo. Visiting Scholar (2017 - 2018) Talita Ribero - PhD Student, COPPE, Federal University of Rio de Janeiro. Ph.D. (2013 - 2017) Ahmed Al-Zubidy - Industry, Intential Ph.D. (2013 - 2017) Wenhua Hu - Assistant Professor, Computer Science, Wuhan University. Visiting Scholar (2017 - 2018) Silvana Melo - Adjunct Professor, Universidade Federal de Grande Dourados. M.S. (2015-2016) Morgan Burcham - Industry. Ph.D. (2010 - 2015) Amiangshu Bosu - Assistant Professor, Departement of Computer Science, Wayne State University Ph.D. (2009 - 2015) Dustin Heaton - Industry. Ph.D. (2009 - 2014) Debarshi Chatterji - Industry. Visiting Scholar (2012 - 2013) Elis Hernandes - Brazil Ph.D. (2009 - 2013) Aziz Nanthaamornphong - Assistant Professor, College of Computing, Prince of Songkla University. M.S. (2009-2010) Jason Oslin Industry. Ph.D. (2005-2010) Lulu He - State Key Lab of Software Engineering, Wuhan University. Ph.D. (2004-2009) Byron Williams - Associate Professor, Department of Computer & Information Sciences, University of Florida. Ph.D. (2004-2009) Gursimran Walia - Associate Dean and Professor, School of Computer and Cyber Sciences, Augusta University. M.S. (2007-2008) Bryan Robbins - Industry - Siemens Digital Industries Software.",
  "content_length": 7915,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:44"
}