{
  "name": "Jeff A. Bilmes",
  "homepage": "https://people.ece.uw.edu/bilmes",
  "status": "success",
  "content": "Jeff Bilmes | UW Department of Electrical & Computer Engineering Skip to main content Jeff Bilmes Professor Machine Learning, AI, Biosystems, Data Science 418 ECE Campus Box 352500 University of Washington Seattle, WA 98195 Phone: 206-221-5236 Email: bilmes@ece.uw.edu Personal Web Page: people.ece.uw.edu/bilmes/p/index.html Biography Jeff A. Bilmes joined the University of Washington Department of Electrical & Computer Engineering faculty in the fall of 1999. He received a B.S. degree in Electrical Engineering and Computer Science from U.C. Berkeley in 1989, a S.M. degree from MIT in 1993, and a Ph.D. in Computer Science from U.C. Berkeley in 1999. He was also a member of the International Computer Science Institute in Berkeley, CA. He is the author of over 100 journal and conference papers on topics ranging from speech, language, statistical machine learning, human-computer interfaces, bio-informatics, pattern recognition, parallel programming, and high-performance software coding techniques.Prof. Bilmes is also an adjunct associate professor in the University of Washington Department of Linguistics and in Computer Science and EngineeringHis primary interests lie in statistical modeling (particularly graphical modeling approaches), combinatorial optimization, and signal processing for pattern classification, speech recognition, language processing, audio processing, and biological signal processing (bio-informatics). He also has strong interests in speech-based human-computer interfaces (and in fact is the principle investigator in the well-known vocal joystick system for speech based continuous control), the statistical properties of natural objects and natural scenes, information theory and its relation to natural computation by humans and pattern recognition by machines, and computational music processing (such as human timing subtleties). He is also quite interested in high performance computing systems, submodularity in machine learning, computer architecture, and software techniques to reduce power consumption. Awards and Honors Professor Bilmes and Grad Student Wenruo Bai Receive Best Paper AwardEE Faculty Early Career Award WinnersBilmes, Iyer, Jegelka Receive Best Paper AwardBilmes and Iyer Win Best Paper at the 2013 Neural Information Processing Systems Conference Recent Publications See this updated list of publications or the google scholar list. University of Washington Be boundless © 2018 University of Washington | Seattle, WA",
  "content_length": 2485,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:35"
}