{
  "name": "Jeff Yu Lei",
  "homepage": "http://ranger.uta.edu/~ylei",
  "status": "success",
  "content": "Jeff Lei - UT Arlington Main - Brief Bio - Teaching - Research- Publications - Contact - Jeff Y. Lei Professor Department of Computer Science and Engineering The University of Texas at Arlington Email: ylei at cse dot uta dot edu Dr. Lei is looking for bright and highly motivated PhD students to join his group! News Explaining and Analyzing AI Decisions, Nov. 2021 Research Area: Software Engineering, Trustworthy AI Software, Software Security Research Group: Lei's Group (part of Software Engineering Research Center) Office: Engineering Research Building (ERB), Room 531 Office Hours (Spring 2025): Tue & Thu: 9.00 to 10.00am (on Microsoft Teams) Teaching (Spring 2025): CSE 4321: Software Testing and Maintenance Recent Publications: (For more publications, check his Google Scholar Profile.) X. Ren, M. Ren, Y. Lei, J. Ming. Revisiting Optimization-Resilience Claims in Binary Diffing Tools: Insights from LLVM Peephole Optimization Analysis. Proceedings of ACM International Conference on Foundations of Software Engineering (FSE), 2025. F. Sikder, Y. Lei, Y. Ji, Efficient Adaptation of Large Language Models for Smart Contract Vulnerability Detection, Proceedings of 21st International Conference on Predictive Models and Data Analytics in Software Engineering (PROMISE), 2025. S. Shree, K. Khadka, Y. Lei, R. N. Kacker, and D. R. Kuhn, Constructing Surrogate Models in Machine Learning Using Combinatorial Testing and Active Learning, Proceedings of 39th IEEE/ACM International Conference on Automated Software Engineering (ASE), 2024. C. Rao, N. Li, Y. Lei, J. Guo, Y. Zhang, R. N. Kacker, D. R. Kuhn. Combinatorial Test Generation for Multiple Input Models with Shared Parameters. IEEE Transactions on Software Engineering, 2022. X. Niu, H. Wu, N. Changhai, Y. Lei and X. Wang, A theory of pending schemas in combinatorial testing, IEEE Transactions on Software Engineering, 2022.",
  "content_length": 1893,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:42"
}