{
  "name": "Jeffrey O. Shallit",
  "homepage": "https://cs.uwaterloo.ca/~shallit",
  "status": "success",
  "content": "Home page of Jeffrey O. Shallit Jeffrey O. Shallit Professor Emeritus School of Computer Science University of Waterloo Waterloo, Ontario N2L 3G1 Canada E-mail: shallit at uwaterloo . ca There is a constant 1.369451... named after me. It is not as important as Euler's constant. Here is a Maple file to compute some estimates of it. Recently Sadov computed many more digits; his paper appeared in Mathematical Notes 110 (2021), 375-392. This photo was taken in the stairway of the Math & Computer building (MC) at the University of Waterloo, June 27 2024. Areas of interest: Combinatorics on words, formal languages and automata theory (especially connections with number theory), algorithmic number theory (primality testing, factoring, etc.), history of mathematics and computer science, ethical use of computers, debunking pseudoscience and pseudomathematics. Foreign member, Finnish Academy of Science and Letters. Elected 2020. Here is an interview with me and Toufik Mansour, describing some of my favorite open problems. Here I am on google scholar citations. There are two different sequences named after me. The first appeared in D. Boyd, Linear recurrence relations for some generalized Pisot sequences, Advances in Number Theory, Oxford University Press, 1993, pp. 333-340, and is defined as follows: a0 = 8, a1 = 55, and for n ≥ 1 we have an+1 is the least integer such that an+1/an > an/an–1. The sequence starts 8, 55, 379, 2612, 18002, ... and appears to satisfy the recurrence an = 6an–1 + 7an–2 – 5an–3 – 6an–4. But it does not; the identity fails at n = 11056. See here for more details. The second is actually a family of sequences, defined here by Moree et al. Are you interested in graduate study in theoretical computer science? Please read this. Professional Activities My new book The Logical Approach To Automatic Sequences: Exploring Combinatorics on Words with Walnut, published by Cambridge University Press. The combinatorics on words wiki (send me e-mail to get an account to edit it) Co-editor of The Role of Theory in Computer Science: Essays Dedicated to Janusz Brzozowski, World Scientific Press, June 2017 My book, Neverending Fractions, co-written with the late Jon Borwein, Wadim Zudilin, and the late Alf van der Poorten (1943-2010) ACM Distinguished Scientist, 2008. A Second Course in Formal Languages and Automata Theory, Cambridge University Press, September 2008. Automatic Sequences: Theory, Applications, Generalizations, Cambridge University Press, July 2003. Algorithmic Number Theory published by MIT Press, August 1996. Editor-in-chief, Journal of Integer Sequences Center for Applied Cryptographic Research Courses taught by JOS Curriculum vitae of JOS (not updated since 2002, sorry!) A more recent CV, with approximate career totals and details for the period 2012-2019 Walnut, free software for solving problems in combinatorics on words and number theory Selected papers of JOS Recent talks by JOS Book reviews by JOS Published and unpublished essays by JOS Co-Authors of JOS Graduate students supervised by JOS This week's Math/CS talks at Waterloo Upcoming talks in our Algorithms and Complexity group CS Theory Event Aggregator Unprofessional Activities My blog, Recursivity Family Friends Quotations Letters to the editor by JOS Community Editorial Board JOS's favorite animal My Elvis number Travel Photographs Urban Legends Debunked Disclaimer: Nothing on this page should be taken to represent the official views of the University of Waterloo.",
  "content_length": 3504,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:00"
}