{
  "name": "Jeffrey Kramer",
  "homepage": "http://wp.doc.ic.ac.uk/jk",
  "status": "success",
  "content": "| Department of Computing Emeritus Professor of Distributed ComputingFREng, FCGI, FACM, FIET, FBCS, MIEEE, MAE Distributed Software Engineering Research SectionDepartment of Computing, Huxley BuildingImperial College London.180 Queen’s Gate, London SW7 2AZ, UK. Email: : j.kramer@imperial.ac.uk Web : https://wp.doc.ic.ac.uk/jk/ Visiting Professor at National Institute of Informatics (NII), Tokyo, Japan. Distinguished Visiting Professor at The Chinese University of Hong Kong, Hong Kong (2019-2024). Academic Qualifications BSc (Eng) (First Class) in Electrical Engineering, University of KwaZulu-Natal, South Africa, 1967 – 1971 MSc (with Distinction) in Computing, Imperial College London, United Kingdom, 1971 – 1972 PhD in Computing, Imperial College London, United Kingdom, 1974 – 1979 Academic Career 1973 – 1976     Research Associate, Department of Computing, Imperial College London 1976 – 1987     Lecturer, Department of Computing, Imperial College London 1987 – 1990     Senior Lecturer, Department of Computing, Imperial College 1990 – 1995     Reader, Department of Computing, Imperial College London 1991 Computing Expert,  World Bank Project for the improvement of the Provincial Universities of Peoples Republic of China 1995     Visiting Fellowship to South Africa, Ernest Oppenheimer Memorial Trust – W D Wilson 1995 – 2021     Professor,  Department of Computing, Imperial College 1999 – 2004    Head of Department, Computing, Imperial College London 2006 – 2009    Dean of Faculty of Engineering, Imperial College London (now titled Consul) 2009 – 2012    Senior Dean and Member of Council, Imperial College London (Senior Consul) 2021 – Emeritus Professor,  Department of Computing, Imperial College Publications Editor Editor in Chief of Transactions on Software Engineering (IEEE TSE) (2006 – 2009 ) Associate Editor of Transactions on Software Engineering (IEEE TSE) (2003 – 2005 ) Associate Editor of ACM Transactions on Software Engineering and Methodology (TOSEM) (1995-2001) Associate Editor of IEEE Concurrency (1995-2001) Fellowships & Awards The Imperial College Medal  in recognition of his outstanding contribution to the life and work of Imperial College, in 2021. Member of Academia Europaea (MAE) in 2015. Fellow of The Royal Academy of Engineering (FREng) in 2008. Fellow of The City and Guilds of London Institute (FCGI) in 2007. Fellow of the ACM, (FACM) 2001 Association for Computing Machinery, New York. Fellow of The Institution of Engineering and Technology, (FIET) in 1992. Chartered Fellow of The British Computer Society, (FBCS) in 2005. ACM SIGSOFT Outstanding Research Award (award) in 2005 for significant and lasting research contributions to software engineering (joint with Jeff Magee). ACM SIGSOFT Distinguished Service Award (award) in 2011 in recognition of his significant and extensive service to the Software Engineering community. Paper awards Most Influential Paper Award (retrospective award) at International Conference on Software Engineering (ICSE 2003) for the paper from the ICSE meeting of 10 years previously judged to have had the most influence on the theory or practice of software engineering during the 10 years since its original publication. The award-winning paper is entitled “Expressing the Relationships Between Multiple Views in Requirements Specifications”, and was co-authored by B. Nuseibeh and A. Finkelstein and published in the IEEE Proceedings of ICSE-93 held in Baltimore, USA, in May 1993. ACM SIGSOFT Impact Paper Award (retrospective award) in 2012 for a highly influential paper presented at a SIGSOFT conference at least 10 years prior. The award-winning is the 1996 paper entitled “Dynamic Structure in Software Architectures”, Proc. of the 4th ACM SIGSOFT Symposium on Foundations of Software Engineering (FSE), in San Francisco in 1996, co-authored with J. Magee. Most Influential Paper Award (retrospective award) at 16th International Symposium on Software Engineering for Adaptive and Self-Managing  (SEAMS 2021) for the paper from the SEAMS meeting of  2008 judged to have had the most influence during the 10 years since its original publication. The award-winning paper is entitled “From goals to components: a combined approach to self-management”, and was co-authored by D. Sykes, W. Heaven and J. Magee and published in the IEEE/ACM Proceedings of ICSE-08 held in Leipzig, Germany, in May 2008. Best Paper awards: Kramer, J., and Cunningham, R.J., “Towards a Notation for the Functional Design of Distributed Processing Systems”, (IEEE Int. Conf. on Parallel Processing, 1978), 69-76. Award for the Most Original Paper. Russo, A. Miller, R., Nuseibeh, B. and Kramer, J., “An abductive approach for analysing event-based requirements specifications”, (International Conference on Logic Programming Copenhagen, Denmark, July 29th – August 1st, 2002). Best Applications Paper Award. Nahabedian L, Braberman V, D’Ippolito N, Honiden S, Kramer J, Tei K, and Uchitel S., “Assured and Correct Dynamic Update of Controllers”, 11th International Symposium on Software Engineering for Adaptive and Self-Managing Systems (SEAMS 2016), Austin, Texas. May 16-17,2016, 96-107). Conference Best Paper. Selected Conference Keynotes and Involvement (2010 …) ICSE Invited Keynote at 34th ACM/IEEE International Conference on Software Engineering (ICSE 2012), Zurich, June 2012. Whither Software Architecture? (slides Download: 12.3Mb) Chart of the most tweeted words at #icse2012, taken from 3000 tweets by 300+ people over 8 days. APSEC Invited Keynote at 19th ACM/IEEE Asia-Pacific Conference on Software Engineering (APSEC 2012), Hong Kong, December 2012. Whither Software Architecture? (slides Download: 12.4Mb) SEAMS Invited Keynote at 10th ACM/IEEE Symposium on Software Engineering for Adaptive and  Self-Managing Systems (SEAMS 2015), Florence, May 2015. Adventures in Adaptation: a software engineering playground (slides Download: 34.4Mb). AWASE Invited Keynote at Asian Workshop on Advanced Software Engineering (AWASE 2017), Chongqing, China, May 2017. Architectures for Adaptation (slides Download: 43.1Mb) SEFM Invited Keynote at 15th International Conference on Software Engineering and Formal Methods (SEFM’17), Trento, September 2017. The Challenge of Change (slides Download: 43Mb) RE Invited Keynote at Requirements Engineering  (RE 2020), Zurich, Switzerland, Sept 2020. Keynote – RE @ runtime – the challenge of change     (see updated talk:  Resilience Through Adaptation – the challenge of change 21st June 2021) Selected Conference Involvement Over 100 memberships of Conference Program Committees from 1986 Chair of the Steering Committee for IEEE International Conference on Configurable Distributed Systems (CDS) 1994-1998 (precursor to SEAMS). ICSE PC Co-Chair for ACM/IEEE International Conference on Software Engineering (ICSE-1999), Los Angeles, May, 1999. Chair of the Steering Committee for ACM/IEEE International Conference on Software Engineering 2000-2002. ICSE General Co-Chair for ACM/IEEE International Conference on Software Engineering (ICSE-2010), Cape Town, May, 2010. ICSE 2010 Welcome Address by Archbishop Desmond Tutu (scripted video YouTube or Download : 60Mb) Programme Co-Chair for IEEE Israeli Software Engineering Conference (SwSTE’10), Herzlia, June 2010. ICSE Member of the Program Board of 39th ACM/IEEE International Conference on Software Engineering (ICSE 2017), Buenos Aires, Argentina, May 2017. Professorship Inaugural Lecture 1995: “The Skeleton in the Software Cupboard” describes my overall research work in rigorous software engineering, covering behavior analysis, the use of models and architectural approaches to construction and dynamic evolution of software systems. Some early fun images of DSE Members Login Main campus address: Imperial College London, South Kensington Campus, London SW7 2AZ, tel: +44 (0)20 7589 5111 Campus maps and information About this site This site uses cookies © Copyright 2014 – Imperial College London",
  "content_length": 7992,
  "method": "requests",
  "crawl_time": "2025-12-01 13:28:58"
}