{
  "name": "Jehan-Francois Paris",
  "homepage": "http://www2.cs.uh.edu/~paris",
  "status": "success",
  "content": "Home Page Jehan-François Pâris Professor Emeritus University of Houston Department of Computer Science 516 Philip G. Hoffman Hall Houston, Texas 77204-3010 Office Hours: after classes Email: jfparis (at sign) uh (dot) edu Bio: (CV) Before joining the University of Houston, Dr. Pâris was faculty at Purdue University and the University of California, San Diego. He received his Ingénieur Civil degree from the Université Libre de Bruxelles, Belgium, his Diplôme d'Etudes Approfondies from the Université Pierre et Marie Curie (Paris VI), France, his Licence et Maîtrise en Informatique from the Université de Namur, Belgium and his PhD in EECS from the University of California, Berkeley. Courses Taught: COSC 1306: Computer Science and Programming (fall 2017) COSC 3360/6310: Fundamentals of Operating Systems (spring 2023) If you are currently enrolled in the course, please go first to the course Team COSC 6340: Databases (spring 2015) COSC 6360: Operating Systems (fall 2021) Research: My background is in applied performance evaluation. I look at problems where the choice of the right policy has a direct impact on the performance of computer systems. Depending of the problem, my co-authors and I have used probabilistic models, discrete-event simulation, and/or trace-driven simulation. My main area of interest is data survival in storage systems: As many organizations now keep on line vast amounts of data for very long periods of time, we need to figure the best ways to protect these data against equipment failures. Most of my work is joint work with colleagues and associate members of the Storage Systems Research Center of the University of California, Santa Cruz. Recent Publications: (all online publications) J.-F. Pâris and T. Schwarz, S. J., Three-dimensional RAID Arrays with Fast Repairs, Proceedings of the 2021 International Conference on Electrical Computer and Energy Technologies (ICECET 2021), Cape Town, South Africa, Dec. 2021. J.-F. Pâris and T. Schwarz, S. J , Merkle Hash Grids Instead of Merkle Trees, Proceedings of the 28th International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems (MASCOTS 2020), Nice, France, Nov. 2020. J.-F. Pâris, Bundling Together RAID Disk Arrays for Greater Protection and Easier Repairs, Proceedings of the 27th International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems (MASCOTS 2019), Rennes, France. V. Estrada-Galiñanes, E. Miller, P. Felber and J.-F. Pâris, Alpha Entanglement Codes: Practical Erasure Codes to Archive Big Data in Unreliable Environments, Proceedings of the 2018 IEEE/IFIP International Conference on Dependable Systems and Networks, Luxembourg, Luxembourg, June 2018. J.-F. Pâris, V. Estrada-Galiñanes, A. Amer, C. A. Rincón, Using Entanglements to Increase the Reliability of Two-Dimensional Square RAID Arrays, Proceedings of the 36th International Performance of Computers and Communication Conference (IPCCC 2017), San Diego, CA, Dec. 2017. C. A. Rincón, J.-F. Pâris, R. Vilalta, A. M. K. Cheng, and D. D. E. Long, Disk Failure Prediction in Heterogeneous Environments, Proceedings of the 2017 International Symposium on Performance Evaluation of Computer and Telecommunication Systems (SPECTS 2017), Seattle, WA, July 2017. V. Estrada-Galiñanes, J.-F. Pâris and P. Felber, Simple Data Entanglement Layouts with High Reliability, Proceedings of the 35th International Performance of Computers and Communication Conference (IPCCC 2016), Las Vegas, NV, Dec. 2016. J.-F. Pâris, T. Schwarz, S. J. and D. D. E. Long, Improving Disk Array Reliability Through Faster Repairs, Proceedings of the 35th International Performance of Computers and Communication Conference (IPCCC 2016), Las Vegas, NV, Dec. 2016. T. Schwarz, S. J., A. Amer, T. Kroeger, E. L. Miller, D. D. E. Long and J.-F. Pâris, Reliable Storage at Exabyte Scale, Proceedings of the 24th International Symposium on Modeling, Analysis and Simulation of Computer and Telecommunication Systems (MASCOTS 2016), London, GB, Sep. 2016. (Best paper award) J.-F. Pâris and D. D. E. Long, Pirogue, a lighter dynamic version of the Raft distributed consensus algorithm, Proceedings of the 34th International Performance of Computers and Communication Conference (IPCCC 2015), Nanjing, China, Dec. 2015, (Best paper runner-up). T. Schwarz, S. J., D. D. E. Long and J.-F. Pâris,, Proceedings of the 21st IEEE Pacific Rim International Symposium on Dependable Computing (PRDC 2015), Zhangjiajie, China, Nov. 2015. T. Schwarz, S. J., A. Amer, and J.-F. Pâris, Combining Low IO-Operations During Data Recovery with Low Parity Overhead in Two-Failure Tolerant Archival Storage, Proceedings of the 21st IEEE Pacific Rim International Symposium on Dependable Computing (PRDC 2015), Zhangjiajie, China, Nov. 2015. J.-F. Pâris and D. D. E. Long, Reducing the Energy Footprint of a Distributed Consensus Algorithm, Proceedings of the 11th European Dependable Computing Conference (EDCC 2015), Paris, France, Sep. 2015. J.-F. Pâris, A. Amer, D. D. E. Long and T. Schwarz, S. J. Self-Repairing Disk Arrays, Fifth International Workshop on Adaptive Self-tuning Computing Systems (ADAPT 2015), Amsterdam, NL, Jan. 2015.",
  "content_length": 5232,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:04"
}