{
  "name": "Jelani Nelson",
  "homepage": "http://people.eecs.berkeley.edu/~minilek",
  "status": "success",
  "content": "Jelani Nelson Jelani Nelson Professor, Department of EECS UC Berkeley About me: I am a member of the Theory Group in the UC Berkeley EECS department. I also currently serve as EECS Department Chair. Current students: Ishaq Aden-Ali (co-advised with Peter Bartlett) Xin Lyu (co-advised with Avishay Tal) Mihir Singhal (co-advised with Venkatesan Guruswami) Hongxun Wu (co-advised with Avishay Tal) Current postdoc: Ce Jin (Miller Fellow) Former students: Jarosław Błasiok. Assistant Professor, Bocconi University. Vasileios Nakos. Assistant Professor, National and Kapodistrian University of Athens. Zhengyu Wang. Quantitative Researcher, Citadel Securities. Haofeng (Fred) Zhang. Research Scientist, Google DeepMind. Former postdocs: Samson Zhou. Assistant Professor, Texas A&M. Shay Golan. Postdoc, Haifa University and Reichman University. Jan van den Brand. Assistant Professor, Georgia Tech. Paris Syminelakis. Research Scientist, Cruise. Kyle Luh. Assistant Professor, University of Colorado Boulder. Rasmus Kyng. Assistant Professor, ETH Zürich. Huacheng Yu (co-hosted by Madhu Sudan). Assistant Professor, Princeton University. Jakub Pachocki. Chief Scientist, OpenAI. Yi Li. Associate Professor, Nanyang Technological University. Other activities: AddisCoder, JamCoders, USVICoder, workshop on chaining , Simons program on probability, geometry, and computation in high dimensions Notes on sketching and streaming algorithms from the TUM Summer School on Mathematical Methods for High-Dimensional Data Analysis. Notes on dimensionality reduction from the MADALGO Summer School on Streaming Algorithms. See also my curriculum vitae. Teaching CS 270 (UC Berkeley). Combinatorial Algorithms and Data Structures. Spring’23. CS 294-165 (UC Berkeley). Sketching Algorithms. Fall’20. CS 170 (UC Berkeley). Efficient Algorithms and Intractable Problems. Spring’20, Fall’21, Fall’22. CS 125 (Harvard). Algorithms & Complexity. Fall’16. CS 224 (Harvard). Advanced Algorithms. Fall’14, Spring’17. CS 124 (Harvard). Data Structures and Algorithms. Spring’14 ‘15 ‘18 ‘19. CS 226 (Harvard). Sketching Algorithms for Big Data. Fall’13 ‘15 ‘17. AddisCoder. Algorithms and Programming for High Schoolers in Addis Ababa, Ethiopia. Summer’11 ‘16 ‘18 ‘19. JamCoders. Algorithms and Programming for High Schoolers in Kingston, Jamaica. Summer’22. USVICoder. Algorithms and Programming for High Schoolers in St. Thomas, US Virgin Islands. January’15. Contact minilek@berkeley.edu 633 Soda Hall, Berkeley, CA 94720-1776",
  "content_length": 2504,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:04"
}