{
  "name": "Jelena Marasevic",
  "homepage": "http://www.jelena-diakonikolas.com",
  "status": "success",
  "content": "Jelena Diakonikolas HOME ABOUT NEWS CONTACT Jelena Diakonikolas I am an Assistant Professor at the Department of Computer Sciences and (by courtesy) the Department of Statistics, at the University of Wisconsin-Madison. I am also an affiliate of the Data Science Institute at UW-Madison. My main research interests are in the area of large-scale optimization. I am also interested in applications of optimization methods, particularly within machine learning. Prior to joining UW-Madison, I was a Postdoctoral Fellow at UC Berkeley's Foundations of Data Analysis (FODA) TRIPODS Institute, where I primarily worked with Mike Jordan. In Fall 2018, I was a Microsoft Research Fellow at the Simons Institute for the Theory of Computing, associated with the program on Foundations of Data Science. Prior to starting the postdoctoral position at UC Berkeley, I was a Postdoctoral Associate at the Department of Computer Science, Boston University, where I worked with Lorenzo Orecchia. I completed my Ph.D. at the Department of Electrical Engineering, Columbia University, where I was co-advised by Gil Zussman and Cliff Stein. Some of my publications are under my maiden name -- Marašević. Prospective students: I am receiving a large volume of email and cannot respond to individual requests. All of the graduate students in the CS program at UW-Madison are admitted by the department, not by individual faculty. Thus, I can only respond to requests from students who are already admitted to UW-Madison. I am an Assistant Professor in the Department of Computer Sciences and (by courtesy) the Department of Statistics at UW-Madison. I am also an affiliate of the Data Science Institute at UW-Madison. My full CV can be found here. My maiden name is Marašević. Research Interests First-order convex and non-convex optimization algorithms; momentum-based methods Variational inequalities and fixed-point iterations Optimization in learning applications; Width-independent algorithms (optimization on a relative scale) Lower bounds in optimization Selected Honors & Awards Google ML & Systems Junior Faculty Award (2025) NSF CAREER Award (2025) AFOSR Young Investigator Program award (2024) UW-Madison Provost's Award for Mentoring Undergraduates In Research, Scholarly, and Creative Activities (2023) Simons-Berkeley Research Fellowship and Microsoft Research Fellowship (2018) Morton B. Friedman Memorial Prize for Excellence at Columbia Engineering (2017) Columbia EE Dept. Collaborative Research Award (2017) Qualcomm Innovation Fellowship (2015) MIT EECS Rising Star (2015) Jacob Millman Award (Outstanding TA) (2013) Columbia University M.S. Award of Excellence (2013) Professional Activities I am on the scientific committee of ELLIIT Symposium on Optimization for Learning, to be held as part of ELLIIT Focus Periods, in Lund, Sweden, in May 2026. I am on the program committee of the INFORMS Optimization Society conference 2026, as an Optimization in Data Science track co-chair. [conference website] I am a cluster chair for ICCOPT 2025, for the cluster on \"Fixed Points and Variational Inequalities\". [conference website] I am on the organizing committee of the OPT 2024 workshop @ NeurIPS 2024 [workshop website]. I was on the program committee of the INFORMS Optimization Society conference 2024, as an Optimization in Data Science track co-chair. [conference website] Co-organized a mini symposium on Advances in First-Order Primal-Dual Methods at SIAM OP 23. [mini symposium program Part 1 out of 4] Co-organized the NeurIPS Workshop Order Up! The Benefits of Higher-Order Optimization in Machine Learning. [workshop website] Co-organizing the WISCERS exploreCSR program: a research mentorship program for undergraduate students, intended to increase research participation of historically underrepresented groups in computing. [program website] Co-organized the Workshop on Sampling Algorithms and Geometries on Probability Distributions at the Simons Institute, as part of the Geometric Methods in Optimization and Sampling Fall 2021 program. [workshop website] Co-organized the Conference on Optimization, as part of the Focus Program on Data Science and Optimization at the Fields Institute, in November 2019. [workshop website] Organized the INFORMS session on the Continuous-time Perspective in Optimization in 2019. Conference program committees: STOC'26 (PC Member), NeurIPS'25 (Area Chair and Workshop PC), COLT'25 (senior PC member), ICLR'25 (Area Chair), NeurIPS'24 (Workshop PC), FOCS'24 (PC Member), SODA'24 (PC Member), COLT'24 (senior PC member), ICML'24 (Area Chair), ICLR'24 (Area Chair), ITCS'24 (PC Member), NeurIPS'23 (Workshop PC), COLT'23 (senior PC member), ICML'23 (Area Chair), COLT'22 (senior PC member), ICLR'22 (Area Chair), NeurIPS'21 (Area Chair), ICML'21 (Workshop PC), ICLR'21 (Area Chair), ICML'20 (Area Chair), ICALP'20 (PC member), ICNP'18 (PC member), NETGCOOP'18 (PC member). Teaching (Fall 2025) CS839: Learning and Optimization (Spring 2025) CS541: Theory & Algorithms for Data Science [course website] (Fall 2024) CS839: Advanced Topics in Nonlinear Optimization (Spring 2024) CS639: Theoretical Foundations of Data Science (Fall 2023) CS726: Nonlinear Optimization I [course website] (Spring 2023) CS639: Foundations of Data Science [course website] (Fall 2022) CS726: Nonlinear Optimization I [course website] (Spring 2022) CS639: Foundations of Data Science [course website] (Fall 2020) CS726: Nonlinear Optimization I [course website] (Spring 2020) CS726: Nonlinear Optimization I [course website] Advising PhD Students Puqian Wang [CS], Fall 2021 -- Present Guyang Cao [CS], Fall 2024 -- Present Undergraduate Students Qiushi Lu [CS, DS, & Math], Spring 2025 -- Present Rishit Malpani [CS], Summer 2025 -- Present Past Group Members and Visitors Shuyao Li [CS, co-advised with S. Wright], Summer 2021 -- Summer 2025 Cheuk Yin (Eric) Lin [CS], Spring 2020 -- Spring 2025 (PhD; now a research scientist at Meta) Xufeng Cai [CS], Fall 2020 -- Spring 2025 (PhD; now a research scientist at Meta) Yi Wei [Math & CS], Spring 2024 -- Spring 2025 (undergrad; starting a PhD at U. Washington) Chris Cai [CS & Math], Summer 2024 -- Spring 2025 (undergrad; starting an MS at Princeton) Rahul Choudhary [CS], Spring 2023 -- Spring 2024 (MS/PhD student) Nott Laoaron [CS], Spring 2023 -- Fall 2023 (undergrad; now a PhD student at U. Maryland) Xintong Li [CS], Spring 2022 -- Spring 2023 (undergrad; now a PhD student at UCSD) Binhao Chen [CS], Summer 2022 -- Spring 2023 (undergrad; now a PhD student at Brown) Chaobing Song, November 2020 -- April 2022 (postdoc; now at Huawei) Chenghui Li [Stats, co-advised with N. G. Trillos], Fall 2020 -- Summer 2022 (PhD student) Lakshmi Muraleedharan Nair [ISyE], Summer 2022 (MS student, independent study) Swati Padmanabhan (U. Washington PhD student; now a postdoc at MIT -> faculty at U. Minnesota ISyE), Summer 2021 (intern) Puqian Wang, Summer & Fall 2020 (undergraduate student; now a PhD student at UW-Madison) Upcoming and Recent Talks “Efficient Learning of Single-Index Models,” DeepMath Conference, Ann Arbor, MI, November 2025, invited talk “On Efficient Solvers for Fixed-Point Equations: Classical Results and New Twists,” Workshop on Regret, Optimization, and Games, Institut Henri Poincaré, Paris, France, November 2025, invited talk “Better Convergence Bounds for Cyclic Methods,” Algorithms and Randomness Center Colloquium Series, GA Tech, Atlanta, GA, October 2025, invited talk “On Efficient Solvers for Fixed-Point Equations: Classical Results and New Twists,” Session on Advances in min-max optimization algorithms for machine learning, ICCOPT, July 2025, invited talk “On Efficient Solvers for Fixed-Point Equations: Classical Results and New Twists,” 2025 PKU Workshop on Optimization Theory and Methods, Beijing, China, June 2025, invited talk “Gradient alignment, learning, and optimization,” Strategies for Handling Applications with Nonconvexity Workshop, Banff International Research Station (BIRS), Canada, May 2025, invited talk “Faster Solutions to Variational Inequalities with Highly Nonuniform Component or Block Lipschitz Constants,” Continuous Optimization – Algorithms, Applications, and Analysis, Canada Mathematical Society (CMS) Winter Meeting, Vancouver, BC, Dec 2024, invited talk “Optimization on a Finer Scale: Bounded Local Subgradient Variation Perspective,” invited session on Large-Scale Methods for Linear and Nonlinear Optimization, INFORMS Annual Meeting, Seattle, WA, Oct 2024, invited talk “Robust Learning of Single-Index Models: An Optimization Perspective,” Workshop on Algorithms for Learning and Economics (WALE 2024), Kefalonia, Greece, Jun 2024, keynote talk “Optimization on a Finer Scale: Bounded Local Subgradient Variation Perspective,” Distinguished Seminar in Optimization & Data @ UWashington, Seattle, WA, Apr 2024, invited talk [video] “Cyclic Block Coordinate Methods on a Finer Scale: Tighter Bounds and New Methods,” IEOR Colloquium Series, UC Berkeley, Berkeley, CA, Mar 2024, invited talk “Robust Learning of a Single Neuron: Bridging Computational Gaps Using Insights from Optimization,” IPAM EnCore Workshop on Computational vs Statistical Gaps in Learning and Optimization, IPAM UCLA, Los Angeles, CA, Feb 2024, invited talk [video] Publications by venue or by year Preprints I. Diakonikolas, J. Diakonikolas, D.M. Kane, J.C.H. Lee, T. Pittas “Linear Regression under Missing or Corrupted Coordinates,” arXiv preprint, arXiv:2509.19242, 2025. [arXiv] R. Mehta, J. Diakonikolas, Zaid Harchaoui “Min-Max Optimization with Dual-Linear Coupling,” arXiv preprint, arXiv:2507.06328, 2025. [arXiv] J. Diakonikolas “Pushing the Complexity Boundaries of Fixed-Point Equations: Adaptation to Contraction and Controlled Expansion,” arXiv preprint, arXiv:2506.17698, 2025. [arXiv] X. Cai, J. Altschuler, J. Diakonikolas “Near-Linear Runtime for a Classical Matrix Preconditioning A",
  "content_length": 43089,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:04"
}