{
  "name": "Jelena Tesic",
  "homepage": "http://cs.txstate.edu/~j_t463",
  "status": "success",
  "content": "Jelena Tešić | Јелена Тешић Jelena Tešić Associate Professor Computer Science Department College of Science and Engineering Texas State University Pronunciation: Yeh-LE-nah TE-shich Contact: jtesic -at- txstate.edu Lab page: DataLab12.github.io Publications on Google Scholar. Curriculum Vitae Research Dr. Tešić's research project span topics in machine learning and data science for large unstructured imagery, social, health, and sensor data sources. More details on the current projects can be found on DataLab12 page. 2023 Research Narrative Teaching Image Processing and Computer Vision (Ph.D.): Spring 2025 Introduction to Machine Learning: Spring 2025 Data-Driven Computational Methods (Ph.D): Fall 2024 Introduction to Recommender Systems : Fall 2023 Object Oriented Design and Programming: Spring 2023 Machine Learning and Applications (M.Sc.): Fall 2021 2023 Teaching Narrative Service 2023 Service Narrative Short Bio Jelena Tešić is an Associate Professor, Department of Computer Science, Texas State Unviersity, San Marcos, Texas, USA. From 2009 to 2017 Dr. Tešić was a senior research scientist @ Mayachitra Inc. From 2004 to 2009, Dr. Tešić was a Research Staff Member at IBM Watson Research Center, NY. Dr. Tešić received her Ph.D. (2004), M.Sc. (1999) in Electrical and Computer Engineering from University of California Santa Barbara, CA, USA, and Dipl. Ing. (1998) in Electrical Engineering from University of Belgrade, Serbia. Dr. Tešić served as an Area Chair for ACM Multimedia, ACM MMSys, IEEE ICIP and ICME. She has served as Guest Editor in a Special Issue on Collaborative Tagging of Multimedia, in IEEE Multimedia Magazine, July-September 2008 issue, and as a reviewer for numerous IEEE and ACM Journals. She has authored over 80 scientific papers, her work has been cited over 3260 times, and she currently holds SEVEN U.S. patents: 12,093,970; 9,710,760; 8,738,695; 8,032,539; 7,958,068; 7,818,329; and 7,707,162. Her research has been sponsored, by DoD, DoE, NSF, TxDoT, and the industry. She is an IEEE senior member.",
  "content_length": 2049,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:08"
}