{
  "name": "Jenay M. Beer",
  "homepage": "https://ssw.uga.edu/people/name/jenay-beer",
  "status": "success",
  "content": "Directory - School of Social Work Request InfoApplyGive Menu DirectoryHome>About>DirectorySort by Research Interest: SELECTALLChild Safety & Family Well-beingCivil Rights & Social JusticeCommunity Health & Well-beingCulturally Informed PracticeHealth & Behavioral Health Prevention & InterventionHuman Trafficking & Human RightsSocial & Economic Policy & DevelopmentTrauma & Violence Sort by Type: SELECTALLAdjunct / Courtesy FacultyAdministrationFacultyFaculty EmeritiFull-Time FacultyPart-Time FacultyPh.D. StudentsStaff Sort Alphabetically: ALLABCDEFGHIJKLMNOPQRSTUVWXYZNo items were found matching the selected filters. Jennifer Abbott Executive Assistant to the Dean Director of External Affairs and Strategic Initiatives [email protected] (706) 542-5424  279 Williams Street, Room 151-A Athens, GA 30602 Mary Ager Associate Professor BSW Program Director [email protected] (706) 542-5464  279 Williams Street Room: 344 Athens, GA 30602 Mandi Albanese Director of Human Resources [email protected] (706) 542-5471  Room: 146 Laquetta Danielle Anderson Part-time Instructor [email protected] Lydia Aletraris Part-Time Associate Research Scientist [email protected] Thomas A. Artelt Part-time Instructor [email protected]  279 Williams Street Room: 105 Athens, GA 30602 Rachel Ashton Director of Finance [email protected]  279 Williams Street, Room 154 Athens, GA 30602 Christina Autry Associate Director of Finance [email protected] (706) 542-5427  279 Williams Street, Room 155 Athens, GA 30602 Maryanna Axson Business Manager Associate Human Resources Manager [email protected]  279 Williams Street, Room 150 Athens, GA 30602 Amy Baldwin Professor, School of Social Work (Courtesy Appointment) Professor of Medical Education, Department of Interdisciplinary Biomedical Sciences Director, Humanism in Medicine, Office of Personalized Health and Well-Being, University of Georgia School of Medicine Adjunct Professor of Biochemistry and Molecular Biology, Medical College of Georgia  Health Sciences Campus 1425 Prince Avenue Room: 163 Russell Hall Athens, GA 30602 Leon Banks Assistant Professor LCSW [email protected] (706) 542-5428  279 Williams Street Room: 246 Athens, GA 30602 Catherine Nalley Banks MSW Program Support and Advising [email protected] (706) 542-5422  279 Williams Street, Room 117 Athens, GA 30602 Jenay Beer Associate Professor, School of Social Work (Courtesy Appointment) Associate Professor, College of Public Health [email protected] (706) 542-1054  101 Hudson Hall Room: 148 Jason Bennett Part-time Instructor Jennifer L. Benford Part-time Instructor Cameron Bics PhD Student Cheran Bodry-Stone Part-time Instructor [email protected] (706) 549-7755 Claire Bolton Program Manager – APRIES [email protected] (706) 542-4113  Sanford Hall, Room 317 312 Herty Drive Athens, GA 30602 Cynthia Bray Part-Time Instructor [email protected] (706)475-3188  1199 Prince Avenue Athens, GA 30606 Jamie Bray Part-time Instructor Harold E. Briggs Pauline M. Berger Professor in Family and Child Welfare [email protected]  279 Williams Street Room: 249B Athens, GA 30602 Alejandra Calva Part-time Instructor [email protected] Ethan Chandler PhD Student MSW, LCSW, LCAS [email protected]  279 Williams Street Athens, GA 30602 Sumin Cheon PhD Student [email protected]  279 Williams Street Athens, GA 30602 Y. Joon Choi Adjunct Professor Director and Professor, Georgia State University School of Social Work [email protected] (404) 413-1052  School of Social Work, Andrew Young School of Policy Studies Georgia State University, PO Box 3995 Atlanta, GA 30303-3992 Michelle Clark Part-time Instructor [email protected] Anna Cody Assistant Research Scientist, Center on Human Trafficking Research & Outreach (CenHTRO) [email protected] Autumn Collier PhD Student CANDIDATE Joshua Comp Part-time Instructor PhD Student ABD [email protected] Sam Cook IT and Communications Manager [email protected] (706) 542-5457  279 Williams Street, Room 219 Athens, GA 30602 Zach Cooper PhD Student ABD [email protected] Llewellyn J. Cornelius Professor Donald L. Hollowell Distinguished Professor of Social Justice and Civil Rights Studies Director, Center for Social Justice, Human and Civil Rights [email protected] (706) 542-0244  2530 Sever Road Room 213 Lawrenceville, GA. 30043 Maurice C. Daniels Dean Emeritus Professor Emeritus [email protected]  279 Williams Street Athens, GA Jessica Davis Program Coordinator, MANML Academic Advisor BSW [email protected] (706) 542-2328  279 Williams Street Room 133 Athens, GA 30602 Katheryn B. “Kathy” Davis Assistant Professor Emerita Kimberley Dawn DeCelle Part-time Instructor Edward Anthony Delgado-Romero Professor, School of Social Work (Courtesy Appointment) Associate Dean and Professor, College of Education [email protected] (706) 542-4107   Aderhold Hall, G3H 110 Carlton St, Athens, GA 30602 Hope Dockweiler APRIES Policy Officer [email protected]  312 Herty Drive, Room 510 Athens, GA 30602 Kasandra Dodd PhD Student ABD Allison Dunnigan Associate Professor Title IV-E Program Director [email protected] (706) 542-5409  279 Williams Street Room: 353 Athens, GA 30602 Jennifer Elkins Associate Professor Director, MSW Program [email protected]  279 Williams Street Room: 123 Athens, GA 30602 Alberta “Bert” Ellett Professor Emerita Kat Farlowe Graphic Design and Communications (part-time) [email protected]  279 Williams Street, Room 133 Athens, GA 30602 Latanya Farrar Part-time Instructor [email protected] Tonya Malone Ferguson Part-time Instructor [email protected] Kim Franklin Part-time Instructor [email protected] Rachel A. Fusco Professor and Associate Dean for Faculty and Academic Affairs UGA Athletic Association Professor in Health and Well-Being Director, Northern Ireland Studies Abroad Program [email protected]  279 Williams Street Room: 153A Athens, GA 30602 Daniel J. Gibbs Assistant Professor MSW/JD Dual-Degree Program Coordinator [email protected] (706) 542-5426   279 William Street Room: 351 Athens, GA 30602 Jeremy J. Gibbs Associate Professor LCSW DIRECTOR, PhD PROGRAM [email protected] (706) 542-5456  279 Williams Street Room: 354 Athens, GA 30602 John W. Gilford Part-time Instructor [email protected] (678) 596-0872 Pedro Goulart Data Analyst, CenHTRO [email protected]  Sanford Hall, Room 323 312 Herty Drive Athens, GA 30602 Ebony Green Part-time Instructor [email protected] Joy Green PhD Student Candidate Crystal Hamilton Part-time Instructor [email protected] Mamie Harper PhD Student Kamisha Hayes LCSW Part-time Instructor [email protected] Allison Haynes Admissions and Recruitment Coordinator Online MSW Program Coordinator [email protected] (706) 542-5429  279 Williams Street, Room 246 Athens, GA 30602 Philip Hong Dean and Professor [email protected] (706) 542-5424  279 Williams Street Room: 145 Athens, GA 30602 Jonathan Hope Part-time Instructor [email protected] June Gary Hopps Thomas M. \"Jim\" Parham Professor of Family and Children Studies [email protected]  279 Williams Street Room: 341 Athens, GA 30602 Stephanie Hunter Part-time Instructor [email protected] Tochuku Ikedionwu Part-time Instructor [email protected] Joel Izlar Part-time Instructor [email protected] Kristina Jaskyte Professor [email protected]  279 Williams Street Room: 352 Athens, GA 30602 Karen A. Johnson Associate Professor [email protected]  279 Williams Street Athens, GA 30602 Zoe Minor Johnson Clinical Associate Professor Coordinator, Public Behavioral Health Fellowship Program LCSW PhD [email protected] (706) 542-5419  279 Williams Street, Rm 109 Athens, GA 30602 Evonne S. Jones Academic Professional LCSW Director, BSW Program BSW and Online MSW Programs Practicum Coordinator [email protected] (706) 542-9311  279 Williams Street, Room 113 Athens, GA 30602 Jameelah Jones Assistant to the Associate Dean for Faculty and Academic Affairs Graduate Program Administrator PhD Program Coordinator [email protected] 706-542-5461  279 Williams Street, Room 152 Athens, GA 30602 David Kelley Part-time Instructor [email protected] (706) 542-7770  Room: 223 Naynette Kennett Clinical Assistant Professor [email protected] (706) 542-3300  279 Williams Street Athens, GA 30602 Soobin Kim POSTDOCTORAL RESEARCH ASSOCIATE [email protected]  279 Williams Street Athens, GA 30602 Sally Kimel-Sheppard Part-time Instructor LCSW [email protected] Lemuel LaRoche Instructor [email protected]  Room: 201 Hee Yun Lee PhD, MSW, LICSW Thomas P. Holland Distinguished Professor Director, Institute for Nonprofit Organizations [email protected]  279 Williams Street Room: 117 Athens, GA 30602 Jaesung Lee PhD Student Gloria G. Leslie Practicum Coordinator [email protected]  279 Williams Street Room: 109 Athens, GA 30602 Yue Li ITS Applications Analyst [email protected]  279 Williams Street Athens, GA 30602 Liu Liu Assistant Research Scientist, Center on Human Trafficking Research & Outreach(CenHTRO) [email protected] (706) 542-9250  Sanford Hall, Room 322 312 Herty Drive, Athens, GA 30602 Tony B. Lowe Associate Professor [email protected] (678) 985-6791  UGA Gwinnett Campus 2530 Sever Road Lawrenceville, GA 30043 Amelia Mahan Part-time Instructor [email protected] Christina Mahoney Part-time Instructor [email protected] Anthony J. Mallon Clinical Professor [email protected] (706) 542-5467  279 Williams Street Room: 125 Athens, GA 30602 Shannen Malutinok Director of Practicum and Professional Education Academic Professional LCSW, MPH [email protected]  279 Williams Street, Room 105 Athens, GA 30602 Elizabeth Marston PhD Student LCSW [email protected]  279 Williams Street Athens, GA 30602 Rebecca Matthew Associate Professor Josiah Meigs Distinguished Teaching Professor [email protected]  279 Williams Street Room: 350 Athens, GA 30602 Emma Mattox Application and Enrollment Specialist [email protected] (706) 542-5421  279 Williams Street, Room 244 Athens, GA 30602 Valerie Dunn McBee Limited term instructor [email protected] Jane McPherson Associate Professor Director, Global Engagement [email protected]  279 ",
  "content_length": 15955,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:08"
}