{
  "name": "Jennifer G. Dy",
  "homepage": "https://www.khoury.northeastern.edu/people/jennifer-dy",
  "status": "success",
  "content": "Jennifer Dy - Khoury College of Computer Sciences All People Jennifer Dy Professor, Jointly Appointed with College of Engineering Research interests Research interests Machine learning Data mining Statistical pattern recognition Computer vision Image processing Education Education PhD in Electrical and Computer engineering, Purdue University MS in Electrical and Computer engineering, Purdue University BS in Electrical Engineering, University of the Philippines Biography Biography Jennifer G. Dy is a professor in the College of Engineering and Khoury College of Computer Sciences at Northeastern University, based in Boston. Dy received an NSF Career award in 2004. She has been an editorial board member for the journal Machine Learning since 2004 and program committee member for ICML, ACM SIGKDD, AAAI, and SIAM SDM. Additionally, she was publications chair for the International Conference on Machine Learning in 2004. Recent publications Recent publications Published: March 28, 2022 Deep Layer-wise Networks Have Closed-Form Weights Citation: Chieh Tzu Wu, Aria Masoomi, Arthur Gretton, Jennifer G. Dy. (2022). Deep Layer-wise Networks Have Closed-Form Weights AISTATS, 188-225. https://proceedings.mlr.press/v151/tzu-wu22a.html Published: February 23, 2021 Using Undersampling with Ensemble Learning to Identify Factors Contributing to Preterm Birth Citation: Shi Dong , Zlatan Feric, Guangyu Li, Chieh Wu, April Z. Gu, Jennifer G. Dy, John Meeker, Ingrid Y. Padilla, José Cordero, Carmen Velez Vega, Zaira Rosario, Akram Alshawabkeh, David R. Kaeli. (2020). Using Undersampling with Ensemble Learning to Identify Factors Contributing to Preterm Birth ICMLA, 759-764. https://doi.org/10.1109/ICMLA51294.2020.00124 Published: December 1, 2020 Instance-wise Feature Grouping Citation: Aria Masoomi, Chieh Wu, Tingting Zhao, Zifeng Wang , Peter J. Castaldi, Jennifer G. Dy. (2020). Instance-wise Feature Grouping NeurIPS. https://proceedings.neurips.cc/paper/2020/hash/9b10a919ddeb07e103dc05ff523afe38-Abstract.html Individual Details Tenured/Tenure-Track Faculty Campus Boston Website https://mllabneu.github.io/ Google Scholar See Citations Areas of Interest Artificial Intelligence Machine Learning Contact j.dy@northeastern.edu",
  "content_length": 2240,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:09"
}