{
  "name": "Jennie Rogers",
  "homepage": "http://users.eecs.northwestern.edu/~jennie",
  "status": "success",
  "content": "Jennie Rogers - Northwestern University Jennie Rogers Associate Professor Computer Science Northwestern University Mudd Hall 2233 Tech Drive Room 3123 Evanston, IL 60208 jennie@northwestern.edu Curriculum Vitae DBLP Google Scholar ResearchGate I am an associate professor of computer science at Northwestern University. My research is motivated by empowering people with data. More specifically, I investigate pragmatic privacy-preserving data analytics, federating databases over multiple data models, and new approaches with which individuals can explore and understand their datasets. I am especially interested in private data federations, wherein two or more mutually distrustful data providers compute SQL queries over the union of their records without revealing their sensitive input tuples to others. I received the NSF CAREER Award in 2019. My Erdös number is 3. Research Projects VaultDB: A Private Data Federation For many people seeking actionable insights from data, their first major obstacle is getting access to relevant datasets. Despite the abundance of information we collect on practically every domain of life, much of it is fractured among many private data stores. For example, electronic health records on a given patient are often partitioned among multiple hospitals. Querying fractured datasets is often challenging owing to regulatory requirements and privacy concerns. A private data federation (PDF) queries the union of the private records of multiple autonomous data stores such that no one learns about the data of its peers. VaultDB, our PDF prototype, translates SQL queries into secure multi-party computation protocols and orchestrates their execution among the data providers. These cryptographic protocols incur substantial overhead for PDF queries with runtimes typically three or more orders of magnitude slower than that of an insecure execution of the same query. We are researching a query optimizer for VaultDB that leverages properties of the relational model to enable PDF queries to run efficiently. Papers: [pdf], [pdf], Code: [github] BigDAWG: A Federator for Heterogeneous Data Models BigDAWG explores a new view of data federations to address the growing need for cross-database querying over heterogeneous data stores. This need is fueled by the proliferation of storage engines and data models - such as arrays, graphs, and text engines - each usually having its own query language and storage semantics. We are studying how to integrate and optimize queries that span many disparate data models through a single query interface. Papers: [pdf], [pdf], Code: [github] Systems for Emerging Data Scientists and Data Enthusiasts We are investigating novel data models and query frameworks for non-traditional data analysts. We have researched this in two domains: personal data-driven decision making and querying for scientists conducting research. In the latter, our focus is on principles and techniques for making the scientific method a first-class citizen in the database. We designed these frameworks based on interviews with individuals who are presently underserved by relational databases who also have an abundance of data. We have synthesized our initial findings from these studies into two vision papers. Papers: [pdf] [pdf] Selected Publications For the most up-to-date list of my publications, please see my Google Scholar page. Johes Bater, Yongjoo Park, Xi He, Xiao Wang, and Jennie Rogers. SAQE: Practical Privacy-preserving Approximate Query Processing for Data Federations. In the Proceedings of the VLDB Endowment, 2020. [pdf] Jennie Rogers, Johes Bater, Xi He, Ashwin Machanavajjhala, Madhav Suresh, and Xiao Wang. \"Privacy Changes Everything,\" in POLY Workshop at VLDB, pages 96-111, 2019. [pdf] Presented at HPTS 2019: [slides] Johes Bater, Xi He, Will Ehrich, Ashwin Machanavajjhala, and Jennie Rogers. \"Shrinkwrap: Efficient SQL Query Processing in Differentially Private Data Federations,\" PVLDB, 12(3), 2018. [pdf] Johes Bater, Greg Elliott, Craig Eggen, Satyender Goel, Abel Kho, and Jennie Rogers, \"SMCQL: Secure Querying for Federated Databases,\" in PVLDB, 10(6), pages 673-684, 2017. [pdf] [code] [slides] Jennie Duggan and Michael Brodie, \"Hephaestus: Data Reuse for Accelerating Scientific Discovery,\" in Proceedings of CIDR, 2015. [pdf] [slides] Extended version: [pdf]. Jennie Duggan, Aaron Elmore, Michael Stonebraker, Magdalena Balazinska, Bill Howe, Jeremy Kepner,et al., \"The BigDAWG Polystore System,\" in Sigmod Record, 44(3), 2015. [pdf] Jennie Duggan and Michael Stonebraker, \"Incremental Elasticity for Array Databases,\" in SIGMOD 2014. [pdf] Jennie Duggan, \"The Case for Personal Data-Driven Decision Making,\" in VLDB, 7(11), pages 943-946, 2014. [pdf] Jennie Duggan, Ugur Cetintemel, Olga Papaemmanouil, Eli Upfal, \"Performance Prediction for Concurrent Database Workloads,\" in SIGMOD, 2011. [pdf] Philippe Cudre-Mauroux, Hideaki Kimura, Kian-Tat Lim, Jennie Rogers, Roman Simakov, Emad Soroush, et al., \"A Demonstration of SciDB: A Science-Oriented DBMS,\" in VLDB, pages 1534-1537, 2009. [pdf] Prospective Students I am looking for graduate and senior undergraduate students to work on research projects. If you are Northwestern student and are interested in working with me, please drop me a line to set up an appointment. Please include a brief summary of your background and interests. If you are not enrolled at Northwestern, you should apply (undergraduate, graduate) to join us before touching base. Teaching COMP_SCI/EECS 339: Introduction to Database Systems - Winter 2015, Winter 2016, Fall2016, Spring 2017, Fall 2017, Winter 2018, Fall 2018, Spring 2019, and Spring 2020 COMP_SCI/EECS 396/496: Data Science Seminar - Fall 2015, Spring 2018, Fall 2018, Fall 2019, and Fall 2020 Professional Service VLDB 2021, Program Committee Member SIGMOD 2021, Program Committee Member VLDB 2020, Program Committee Member CIDR 2020, Program Committee Member SIGMOD 2020, Finance Chair, Program Committee Member CIDR 2019, Program Committee Member SIGMOD 2018, Program Committee Member SIGMOD 2017, Mentorship Co-Chair, Local Arrangements Co-Chair, Program Committee Member VLDB 2017, Program Committee Member CIDR 2017, Program Committee Member ICDE 2016, Program Committee Member SIGMOD 2016, Demo Committee Co-Chair, Program Committee Member VLDB 2015, PhD Workshop Co-Chair, Program Committee Member SOCC 2015, Program Committee Member SIGMOD Record 2015, Journal Reviewer TKDE 2015, Journal Reviewer BIRTE 2014, Proceedings Chair NSF CISE, Panelist SOCC 2014, Program Committee Member VLDB 2009, External Reviewer SIGMOD 2009, Student Volunteer Coordinator EDBT 2009, External Reviewer Miscellaneous Tim Mattson, Jennie Rogers, and Aaron Elmore. The BigDAWG Polystore System. In Making Databases Work: the Pragmatic Wisdom of Michael Stonebraker, pages 279-289. ACM and Morgan & Claypool, 2018. (book chapter) Big Data Is Opening the Door To Revolutions: Databases Should Be Next. Michael Brodie and Jennie Duggan, SIGMOD Blog, November 8, 2014. The Anatomy of a Diploma Mill, Jennie Duggan, Independent research project on the security of university degrees, 2012. Tunnels, Bunkers and Nukes: My Underground Vacation, Jennie Duggan, Conduit! 20(1), Spring 2011, Brown Computer Science.",
  "content_length": 7286,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:08"
}