{
  "name": "Jennifer George",
  "homepage": "https://www.gold.ac.uk/computing/people/george-jennifer",
  "status": "success",
  "content": "Professor Jennifer George | Goldsmiths, University of London Main menu Staff & students In this section Staff details Position Professor of Computing Department Computing Email j.george (@gold.ac.uk) Links X@jenni26cg LinkedInlinkedin.com/in/jennifer-george-86833a18 Jennifer’s research areas include human computer interaction, accessibility and research through design Jennifer is a Professor of Computing and is passionate about inclusion and accessibility and has championed Goldsmiths to improve student experience by being more disability inclusive. She was awarded a National Teaching Fellowship for her contribution. She served as Head of Computing until 2024 and taught and supervised students in various areas of human computer interaction. Jennifer’s research areas include human-computer interaction, faith and belief in the digital world and inclusion and accessibility in learning, teaching and assessments. She has a keen interest in pedagogy and technology-enhanced learning and was previously academic lead for learning technologies and digital media at Anglia Ruskin University. Jennifer is also passionate about international partnerships and is always ready to explore ways of collaborating. Grants and awards 2021: Joy in the Digital World 2023: 5 Minutes of Digital Inclusion 2025: 5 Minutes of Digital Inclusion (review) 2025: Teaching and Learning Innovation Fund Exploring equity in generative AI in Goldsmiths 2025: Goldsmiths Research Internship Programme (GRIP) 2025 Use of Generative AI by students Publications and research outputs Conference or Workshop ItemGenerative AI Framework for Higher Education George, Jennifer . 2025. 'Generative AI Framework for Higher Education'. In: Oxford Collaboration for Theology and Artificial Intelligence Workshop 1.2 | Listening to Practitioners (India, Africa, Europe, and Americas). Online, United Kingdom 6 March 2025. Gen AI Framework for Goldsmiths George, Jennifer . 2025. 'Gen AI Framework for Goldsmiths'. In: Gen-AI Mini Conference at Goldsmiths. Online, United Kingdom 20 February 2025. AI and Disability George, Jennifer . 2024. 'AI and Disability'. In: Disability Awareness Series. University of Vavuniya, Sri Lanka. Show more information Does AI remove or create barriers for accessibility? George, Jennifer . 2024. 'Does AI remove or create barriers for accessibility?'. In: Goldsmiths Digital Accessibility Conference. Online, United Kingdom 5 December 2024. The Role of Disability, Religion, and Belief in the Ethics of AI George, Jennifer . 2024. 'The Role of Disability, Religion, and Belief in the Ethics of AI'. In: Lovelace-Hodgekin Symposium on AI Ethics. University of Glasgow Advanced Research Centre, United Kingdom 2 - 4 October 2024. Building for Joy in the Digital World Robertson, Rachel Siow; George, Jennifer ; and Kuan Johnson, Matthew. 2023. 'Building for Joy in the Digital World'. In: 14th International Conference on Applied Human Factors and Ergonomics (AHFE 2023) and the Affiliated Conferences. San Francisco, United States 20-24 July 2023. A Strategic Approach to a Disability Inclusive Academic Department George, Jennifer . 2023. 'A Strategic Approach to a Disability Inclusive Academic Department'. In: 10th International Conference on Software Development and Technologies for Enhancing Accessibility and Fighting Info-exclusion (DSAI 2022). Lisbon, Portugal 31 August – 2 September 2022. Disability Inclusion in a Computing Department George, Jennifer . 2023. 'Disability Inclusion in a Computing Department'. In: Improving Diversity in STEM 2023. Online, United Kingdom 19 April 2023. A book review of Biblical Critical Theory by Chris Watkin George, Jennifer . 2022. 'A book review of Biblical Critical Theory by Chris Watkin'. In: Forming a Christian Mind Autumn 2022 Conference: Biblical Critical Theory. Cambridge, United Kingdom 26 November 2022. Accelerating Inclusion in Higher and Further Education George, Jennifer . 2022. 'Accelerating Inclusion in Higher and Further Education'. In: TechSharePro 2022. Online, United Kingdom 15 - 17 November 2022. How Disability Inclusive is your organisation? George, Jennifer . 2022. 'How Disability Inclusive is your organisation?'. In: TechSharePro 2022. Online, United Kingdom 15 - 17 November 2022. Leading Change: Towards and Inclusive and Accessible Department George, Jennifer . 2021. 'Leading Change: Towards and Inclusive and Accessible Department'. In: Equality, Diversity and Inclusion Conference 2022: Inclusive Institutions in Action. Manchester, United Kingdom 16 - 17 March 2022. An Inclusive Approach to Exams as a Response to the Pandemic George, Jennifer . 2021. 'An Inclusive Approach to Exams as a Response to the Pandemic'. In: 19th Academic Practice and Technology Conference (APT2021). Online, United Kingdom 2 July 2021. A Social Approach to Accessible Social Networking Using the CAT Model George, Jennifer ; Cockton, Gilbert; and Greenough, Thomas. 2010. 'A Social Approach to Accessible Social Networking Using the CAT Model'. In: ICCHP 2010: 12th International Conference on Computers Helping People with Special Needs. Vienna, Austria 14-16 July 2010. Towards comprehensive ICF compatible sociodigital approaches to choice and use of assistive technology for young children George, Jennifer ; and Cockton, Gilbert. 2009. 'Towards comprehensive ICF compatible sociodigital approaches to choice and use of assistive technology for young children'. In: DSAI 2009: Software Development for Enhancing Accessibility and Fighting Info-exclusion. Lisbon, Portugal 3 - 5 June 2009. Tabletop computers as Assistive technology George, Jennifer ; and Cockton, Gilbert. 2008. 'Tabletop computers as Assistive technology'. In: Shareable Interfaces for Learning Workshop 2008. University of Sussex, United Kingdom 11-12 September 2008. ArticleBridging the Gap: 5 Minutes of Digital Inclusion Empowers Educators in Higher Education for Learner Success Carlisle, Damaris; and George, Jennifer . 2025. Bridging the Gap: 5 Minutes of Digital Inclusion Empowers Educators in Higher Education for Learner Success. Asia Pacific Journal of Developmental Differences, 12(1), p. 35. ISSN 2717-5200 MIIND and HEART: Measuring and designing for thicker qualities of user experience Robertson, Rachel Siow; George, Jennifer ; and Johnson, Matthew. 2023. MIIND and HEART: Measuring and designing for thicker qualities of user experience. International Conference on Computer Ethics, 1(1), Designed for Joy? Reflections on the Creation and Use of Digital Technology George, Jennifer ; and Robertson, Rachel Siow. 2023. Designed for Joy? Reflections on the Creation and Use of Digital Technology. Cambridge Papers, 32(1), ISSN 1361-7710 Show more information A book review of \"The Robot Will See You Now, a book on Artificial Intelligence and the Christian Faith\" George, Jennifer . 2022. A book review of \"The Robot Will See You Now, a book on Artificial Intelligence and the Christian Faith\". Ethics in Conversation, 26(3), Professional ActivityGenAI: Roundtable panel discussion George, Jennifer . 2025. GenAI: Roundtable panel discussion. Technology and Disability Inclusion in Education George, Jennifer . 2025. Technology and Disability Inclusion in Education. Relational Dimensions of Teaching in the age of Generative AI George, Jennifer . 2025. Relational Dimensions of Teaching in the age of Generative AI. Show more information A Round Table: Lasting cultural change in digital inclusion George, Jennifer . 2023. A Round Table: Lasting cultural change in digital inclusion. ThesisA case study of balance and integration in worth-focused research through design George, Jennifer . 2016. A case study of balance and integration in worth-focused research through design. Doctoral thesis, Northumbria University Professional projects 2025: Chair of Generative AI Working Group and lead for the Generative AI Framework for Goldsmiths impacting on policy, regulations and gen AI related resources for staff and students. 2021-2023: EDI Lead for the School of Professional Services, Science and Technology 2022: Lead for Disability Inclusion review across Goldsmiths, influencing disability policy, VLE templates and Goldsmiths Strategy, Curriculum Blueprint and Digital Transformation strategy. Conferences and talks 2024: The Role of Disability, Religion, and Belief in the Ethics of AI Keynote at Lovelace-Hodgekin Symposium on AI Ethics on 2-4th October 2024",
  "content_length": 8426,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:10"
}