{
  "name": "Jennifer Parham-Mocello",
  "homepage": "https://engineering.oregonstate.edu/people/jennifer-parham-mocello",
  "status": "success",
  "content": "Jennifer Parham-Mocello | College of Engineering | Oregon State University Skip to main content Facilities People Tools & Services Units Chemical, Biological, and Environmental Engineering Civil and Construction Engineering Electrical Engineering and Computer Science Mechanical, Industrial, and Manufacturing Engineering Nuclear Science and Engineering Biological & Ecological Engineering About Academics Research Alumni & Partners Jennifer Parham-Mocello Jennifer Parham-Mocello Associate Professor Organizations Electrical Engineering and Computer Science Email parhammj@eecs.orst.edu Office Phone (541) 737-8895 Address 2101 Kelley Engineering Ctr Corvallis, OR 97331 United States Research Website web.engr.oregonstate.edu/~parhammj/ Degrees Postdoctoral Researcher, Engineering and Science Education, Clemson University, Clemson, SC Ph.D., Computer Science, Clemson University, 2009 M.S., Computer Science, The University of Montana, 2003 B.S., Computer Science, Appalachian State University, 999 Research Groups Computer Science Education Biography Jennifer Parham-Mocello fell in love with computer science while pursuing an undergraduate degree in secondary math education. Since then, her focus turned to computer science education. Immediately after obtaining her bachelor’s in computer science, she became an adjunct instructor at a community college. She subsequently pursued a master’s in computer science, which sparked her interest in how people learn computer science, the best ways to teach computer science, and the higher-order/logical thinking skills needed for computer science. She returned to school for a doctorate focusing on how people solve problems in computer science. Her mission is to improve computer science education through exploratory research and empirical evidence, best teaching practices, and community efforts supporting computational literacy for all. Awards/Accolades 2021-2023 College of Engineering Kearney Faculty Scholar 2018 College of Engineering Austin-Paul Engineering Faculty Award 2018 EECS Professor of the Year 2017 Delta Tau Delta Fraternity Outstanding Teaching Award 2017 EECS Innovative Teaching Award 2015 EECS Outstanding Teaching Award 2014 Vice Provost's Award for Excellence in Innovation – Online Teaching 2014 EECS Innovative Teaching Award 2013 EECS Professor of the Year Additional Links Learn more about Jennifer Parham-Mocello Related Stories June 9, 2025 A computer science student's journey to a master's and a job at Microsoft Sept. 14, 2021 Endowments: Funding Faculty Excellence March 26, 2021 Catalyst Dec. 29, 2020 Changing course Read other Engineering stories. Related Podcasts Image Using games to teach computer science remotely, S10E3 Can middle schoolers learn computer science concepts using tabletop games? How about during a pandemic, when classroom interaction takes place remotely? Researchers in…",
  "content_length": 2886,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:10"
}