{
  "name": "Jennifer M. Groh",
  "homepage": "http://people.duke.edu/~jmgroh",
  "status": "success",
  "content": "Groh Lab - Home The  S P A C E  Lab We Study Spatial Coding. Computationally. Experimentally. Jennifer M. Groh, Ph.D. Home People Papers Projects News Openings Contact Welcome to the SPACE Lab! Our Mission Research in the SPACE laboratory is devoted to investigating neural representations of space. We combine theoretical/computational and experimental approaches to study how our brains encode the locations of sights and sounds and how the brain performs computations on different sensory inputs to permit communication between the senses despite a shifting relationship between the eyes and ears across eye movements. We are developing new theories of neural representations to address shortcomings in the prevailing dogma regarding how sensory information is encoded in neural activity patterns. Latest Studies Neuronal Multiplexing. We are currently working on a new theory of how neurons might represent multiple stimuli across time, called time division multiplexing (Caruso et al. Nat Comm 2018; Jun et al. 2022; Schmehl et al. 2024) and summarized in an opinion piece in TiCS (Groh et al. 2024). Such a coding strategy would enhance the brain's processing capacity and could account for widespread discrepancies between perceptual resolution and receptive field size. This is collaborative work with Prof Surya Tokdar (Duke Statistics) as well as Prof Marlene Cohen (U Pittsburgh, U Chicago), Prof Winrich Freiwald (Rockefeller University), Prof Brent Doiron (U Chicago), Prof Liz Romanski, and Prof Farran Briggs (Univ Rochestor). Eye-Movement-Related Eardrum Oscillations (EMREOs). Another important problem in neural representations concerns how auditory and visual representations link up, particularly given movements of the sense organs such as the eyes, head, and ears. After decades of neurophysiological studies revealing widespread oculomotor signals in auditory brain regions, we took the question out the periphery, namely the ear, where we made a novel discovery: the eardrums move when the eyes move. These signals in the ear reflect descending brain signals and carry accurate information about the direction and amplitude of eye movements as they happen. This work involves past and present collaborations with Kurtis Gruters, PhD (lab alum), David Murphy, PhD (lab alum), Dr. David Kaylie, MD (Duke), Prof. Christopher Shera, PhD (USC)and Prof. David Smith, PhD (Univ Florida). Our latest work on this topic is available in PNAS (Lovich et al 2023), Hearing Research (King et al. 2023) and Phil Trans B (Lovich et al 2023).   Datasets are published here and here. Books Making Space How the Brain Knows Where Things Are By Jennifer M. Groh I believe space is so important to brain function that I've written a whole book about it: Making Space: How the Brain Knows Where Things Are (Harvard Univ Press, 2014). The book is designed for a general audience, with particular consideration for interested students. This writing of this book was supported by a Guggenheim fellowship. Making Space(Amazon) Companion Course(Coursera) Book Review(New Scientist) Book Review(Nature) Media Coverage Our recent work on eardrum movements accompanying eye movements (Gruters, Murphy et al. PNAS 2018) was covered in The Atlantic by Ed Yong. This work reaches down into the ear itself and shows a form of interaction between sensory systems.  Perhaps there are no safe spaces... Earlier coverage of our biorxiv preprint at the New Scientist. For \"Making Space\" I was on BBC World Service: The Forum on October 18, 2014: Natural Navigation. Audio here. And on WUNC (NPR) \"The State of Things\" with Frank Stasio on Dec 5, 2014. Audio here. Also Ideas Roadshow and CBC radio's IDEAS. The 2014 Nobel Prize in Medicine was awarded to John O'Keefe, May-Britt Moser, and Edvard Moser for their elegant work on spatial coding in the hippocampus. I made a video about their scientific discoveries. See also this article. Ventriloquism and the Brain on CBC's Quirks and Quarks. More here. Article in Telegraph. Another ventriloquism study. Article in Raleigh News and Observer. Interview on. WPTF radio. And our study showing that the superior colliculus uses a map for visual stimuli and a meter for sounds - and this is even true for the motor-related activity. Coverage here and here. Communicating About Science I occasionally tweet about science, education, and policy as @JMGrohNeuro. Here is my ResearchGate profile Anne's List (Last updated Feb 2017) Graduate Student Openings Groh Lab anticipates an opening for a graduate student fall 2023. Students have historically come from one or more of the following programs: Neurobiology Psychology and Neuroscience Cognitive Neuroscience Admitting Program Students may also be admitted through computer science or biomedical engineering programs. Interested applicants should contact Jennifer Groh (), and are encouraged to take her free course, \"The Brain and Space,\" to learn about her outlook on the brain, the lab's prior work, and other discoveries in the same research niche. Job Openings Summer/Fall 2024. We are currently hiring postdocs and research associates (see job description). Applicants should email me a cover letter describing relevant experimental and computational experience, their CV, and names of reference.",
  "content_length": 5286,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:12"
}