{
  "name": "Jennifer G. Kim",
  "homepage": "https://faculty.cc.gatech.edu/~jkim693",
  "status": "success",
  "content": "Jennifer G. Kim Jennifer Gahee Kim Assistant Professor at Georgia Institute of Technology Contact: jennifer.kim [at] cc.gatech.edu | Office: CODA1578B Pronouns: She/her I obtained my Ph.D. from the Department of Computer Science speicialized in Human-Computer Intearction at University of Illinois at Urbana-Champaign. I was advised by Dr. Karrie Karahalios, as part of the Social Spaces Group. I received my M.S. degree from Georgia Tech where I worked with Dr. Gregory Abowd and Dr. Rosa Arriaga. My research interests are in Human-Computer Interaction (HCI) and Computer-Supported Collaborative Work (CSCW), with a focus on health and wellbeing. My work understands, designs, and evaluates social and health information systems to promote advocacy and empathy. Please see my projects and publications and to learn more about my research. News 08/2025 | Our LLM job coach project, in collaboration with Prof. Mark Riedl's lab has been funded by NSF! O7/2025 | Kaely will be prersenting our work on uncovering Human-AI misalignment in job-Seeking support for neurodivergent users at ASSETS 2025! 06/2025 | Our LLM chatbot project for eating disorder recovery, in collaboration with Prof. Sung-ju Lee's lab at KAIST has received an Honorable Mention Award at CHI! 01/2025 | Two papers on Chatbot Support for Balanced Neurodiverse Social Interactions and on LLM Chatbot Support for Eatidng Disorder Recovery have been accepted to CHI 2025! 10/2024 | Georgia Tech (PIs: Prof. Sehoon Ha and me) is leading a $7M research project in collaboration with Neuromeka, ETRI, and KAIST to develop a mobile humanoid: News Students PhD students: Rachel Lowy, Kaely Hall, Seungwan Jin, Hyesoo Park MS students: Yeonsoo Chang, Alejandra Bernabel, Ethan Sylvia BS students: Korina Goldsmith, Aakrishtaa Kumar, Tanisha Paryani, Veena Gonugondla Classes CS 4803 & 8803: Personal Health Informatics | Spring 2021, Fall 2021, Spring 2022, Fall 2022 CS 6750: Human-Computer Interaction | Spring 2023 CS 3751: Introduction to UI Design | Spring 2024, Spring 2025, Fall 2025 Selected Publications | Google Scholar Understanding Human-AI Misalignment in LLM-Based Job-Seeking Support for Neurodivergent Users | Upcoming Kaely Hall, Marcus Ma, Xinyue Zhang, Vedant Das Swain Jennifer G Kim | ASSETS 2025 Working Together Toward Interdependence: Chatbot-based Support for Balanced Social Interactions Between Neurodivergent and Neurotypical Individuals | PDF Ha-Kyung Kong, Rachel Lowy, Youjin Choi, Jennifer G Kim | CHI 2025 Private Yet Social: How LLM Chatbots Support and Challenge Eating Disorder Recovery. | PDF (Honorable Mention) Ryuhaerang Choi, Taehan Kim, Subin Park, Jennifer G Kim, Sung-ju Lee | CHI 2025 More Understanding or More Burden? Benefits and Risks of Sensing and Sharing Non-verbal Cues in Remote Psychotherapy. | pdf Lan Gao, Munmun De Choudhury, Jennifer G Kim | CSCW 2025 Co-designing Robot Dogs with and for Neurodivergent Individuals: Opportunities and Challenges. | pdf *Hidy Kong, *Derek Xie, Ankith Chandra, Rachel Lowy, Arielle Maignan, Sehoon Ha, Chung Hyuk Park, and Jennifer G. Kim | ASSETS 2024 Research-Education Partnerships: A Co-Design Classroom for College Students with Intellectual and Developmental Disabilities. | pdf Rachel Lowy, Khushi Magiawala, Shravika Mittal, Kaely Hall, Jessica Roberts, Jennifer G. Kim | CSCW 2024 Designing for Strengths: Opportunities to Support Neurodiversity in the Workplace. | pdf Kaely Hall, Parth Arora, Rachel Lowy, Jennifer G. Kim | CHI 2024 Understanding Online Job and Housing Search Practices of Neurodiverse Young Adults to Support Their Independence. | pdf *Hidy Kong, *Saloni Yadav, Rachel Lowy, Daniella Rose Ruzinov, Jennifer G. Kim | CHI 2024 Patient Perspectives on AI-Driven Predictions of Schizophrenia Relapses: Understanding Concerns and Opportuni- ties for Self-Care and Treatment | pdf Dong Whi Yoo, Hayoung Woo, Viet Cuong Nguyen, Michael L. Birnbaum, Kaylee Payne Kruzan, Jennifer G Kim , Gregory D. Abowd, Munmun De Choudhury. | CHI 2024 Promoting Self-Efficacy of Individuals With Autism in Practicing Social Skills in the Workplace Using Virtual Reality and Physiological Sensors: Mixed Methods Study. | pdf Sung-In Kim, So-youn Jang, Taewan Kim, Bogoan Kim, Dayoung Jeong, Taehyung Noh, Min- gon Jeong, Kaely Hall, Meelim Kim, Hee Jeong Yoo, Kyungsik Han, Hwajung Hong, and Jennifer G Kim. | JMIR Formative Research 2024 V-DAT (Virtual Reality Data Analysis Tool): Supporting Self-Awareness for Autistic People from Multimodal VR Sensor Data | pdf Bogoan Kim, Dayoung Jeong, Jennifer G. Kim , Hwajung Hong, and Kyungsik Han | UIST 2023 Building Causal Agency in Autistic Students through Iterative Reflection in Collaborative Transition Planning | pdf Rachel Lowy, Chung-Eun Lee, Gregory Abowd, and Jennifer G. Kim | CSCW 2023 It Takes Two to Avoid Pregnancy: Addressing Conflicting Perceptions of Birth Control Pill Responsibility in Romantic Relationships | pdf Marcus Ma*, Rachel Kim*, Kaely Hall, and Jennifer G. Kim | CSCW 2023 Toward Inclusive Mindsets: Design Opportunities to Represent Neurodivergent Work Experiences to Neurotypical Co-Workers in Virtual Reality | pdf Rachel Lowy, Lan Gao, Kaely Hall, and Jennifer G. Kim | CHI 2023 Supporting the Contact Tracing Process with WiFi Location Data: Opportunities and Challenges | pdf Kaely Hall, Dong Whi Yoo, Wenrui Zhang, Mehrab Bin Morshed, Vedant Das Swain, Gregory D. Abowd, Munmun De Choudhury, Alex Endert, John Stasko, Jennifer G. Kim | CHI 2022 The Workplace Playbook VR: Exploring the Design Space of Virtual Reality to Foster Understanding and Support of Autistic People in the Workplace | pdf Jennifer G. Kim, Taewan Kim, Sungin Kim, Soyeon Jang, Stephanie Lee, Heejung Yoo, Kyungsik Han, Hwajung Hong | CSCW 2022 Designing a Medical Crowdfunding Website from Sense of Community Theory | pdf Jennifer G. Kim, Robert E. Kraut, Karrie Karahalios | CSCW 2022 VISTA: Understanding Characteristics of Autistic People through a VR-based Interactive Social Skills Training System | Upcoming Bogoan Kim, Dayoung Jeong, Mingon Jeong, Taehyung Noh, Sung-In Kim, Taewan Kim, So-youn Jang, Hee Jeong Yoo, Jennifer G. Kim, Hwajung Hong, and Kyungsik Han | VRST 2022 Person-centered Transition Planning for Youth on the Autism Spectrum: What are We Still Missing? | pdf Chung-Eun Lee, Jennifer G. Kim | Exceptionality, Special Ed. Journal 2021 Enriched Social Translucence in Medical Crowdfunding | pdf Jennifer G. Kim, Ha-Kyung Kong, Hwajung Hong, and Karrie Karahalios | DIS 2020 Understanding Identity Presentation in Medical Crowdfunding | pdf Jennifer G. Kim, Hwajung Hong, and Karrie Karahalios | CHI 2018 Skin Conductance as an In Situ Marker for Emotional Arousal in Children with Neurodevelopmental Communication Impairments: Methodological Considerations and Clinical Implications | pdf Mariana Aparicio Betancourt, Laura S. Dethorne, Karrie Karahalios, and Jennifer G. Kim | TACCESS 2017 Copyright (c) 2022 Jennifer G. Kim",
  "content_length": 6965,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:08"
}