{
  "name": "Jennifer Listgarten",
  "homepage": "http://www.jennifer.listgarten.com",
  "status": "success",
  "content": "Jennifer Listgarten Jennifer Listgarten Mailing address: University of California, Berkeley Electrical Engineering and Computer Science 387 Soda Hall, MC 1776 Berkeley, CA, 94720 Before contacting me, students please read this. jennl [at] berkeley.edu About me I am a Professor in UC Berkeley's EECS department , Center for Computational Biology, Bioengineering, and a member of the steering committee for the Berkeley AI Research (BAIR) Lab. From 2007 to 2017 I was at Microsoft Research, through Cambridge, MA, Los Angeles and Redmond, WA. Before that I did my PhD in the machine learning group at the University of Toronto. (Feel free to use this short bio and picture for announcements.) My expertise is in machine learning, applied statistics, computational biology. I'm interested in both methods development as well as application of methods to enable new insight into basic biology and medicine. Recently I have also started to work on computational chemistry. A recent print interview focused on my CRISPR work can be found here. If you're interested more generally in how machine learning and biology go together, check out this Talking Machines interview with me instead (alternate link to audio here). Finally, if you want to hear about my random walk in education & career space, take a look at this Berkeley Science Review profile. Current areas of interest include: computational methods for protein design/optimization/engineering for properties such as expression, flurorescence, binding, stability, etc.; related methods for molecule design and chemical reactions; drug repositioning and discovery; machine learning methods development, and in particular at the intersection of graphical models, neural networks and variational inference, as well as optimizing black box probablistic functions with pathological regions that can't be trusted. Previous focus areas include: machine learning methods for time series alignment and normalization; LC-MS proteomics; statistical genetics methods to correct for confounding factors in GWAS, epigenome-WAS and eQTL studies; problems in immunoinformatics such as HLA class I epitope prediction and HLA allele imputation. If you're interested in my statistical genetics work (FaST-LMM or EWASher), please go to this landing page. Industry engagements: I also spend some of my time with companies. At the moment, these: Dayzero Diagnostics (Scientific Advisory Board). Deep Apple Therapeutics (Scientific Advisory Board). Inscripta (Scientific Advisory Board). Fable Therapeutics (Academic co-founder). Research group You can find us here. If you are looking to do your PhD, applications go through academic entities such as EECS the Center for Computational Biology, or the Bioengineering program, for which you should list me as a faculty of interest. For EECS applicants, please choose as your primary area, CS:AI-SCIENCE. Announcements New pieces Structural ontogeny of protein-protein interactions Aerin Yang*, Hanlun Jiang*, Kevin M. Jude*, Deniz Akpinaroglu, Stephan Allenspach*, Alex Jie Li, James Bowden, Carla Patricia Perez, Liu Liu, Po-Ssu Huang, Tanja Kortemme, Jennifer Listgarten+, K. Christopher Garcia+ Science 2025 (in press) *(equal contributions), +(co-corresponding) Guide your favorite protein sequence generative model Junhao Xiong*, Hunter Nisonoff*, Maria Lukarska*, Ishan Gaur, Luke M. Oltrogge, David F. Savage+, Jennifer Listgarten+ arXiv 2025 (link) *(equal contributions), +(co-corresponding) Unlocking Guidance for Discrete State-Space Diffusion and Flow Models {Hunter Nisonoff*, Junhao Xiong*, Stephan Allenspach*}, Jennifer Listgarten ICLR 2025 (link) *(equal contributions) CS 294-150 Machine Learning and Statistics Meet Biology (Spring 2023) If you have questions about enrolling in this class, or otherwise, please read the bcourses web page, noting the year in case it's out of date. This site also contains a link for those unable to automatically enroll to fill out an application to enroll---please make sure only to fill out for the correct year (and please email me if the semester is about to start and it hasn't been updated). Undergraduate, graduate and post-doc opportunities Please see \"Joining the group\" here. SelectedPublications Structural ontogeny of protein-protein interactions Aerin Yang*, Hanlun Jiang*, Kevin M. Jude*, Deniz Akpinaroglu, Stephan Allenspach*, Alex Jie Li, James Bowden, Carla Patricia Perez, Liu Liu, Po-Ssu Huang, Tanja Kortemme, Jennifer Listgarten+, K. Christopher Garcia+ Science 2025 (in press) *(equal contributions), +(co-corresponding) Guide your favorite protein sequence generative model Junhao Xiong*, Hunter Nisonoff*, Maria Lukarska*, Ishan Gaur, Luke M. Oltrogge, David F. Savage+, Jennifer Listgarten+ arXiv 2025 (link) *(equal contributions), +(co-corresponding) Unlocking Guidance for Discrete State-Space Diffusion and Flow Models {Hunter Nisonoff*, Junhao Xiong*, Stephan Allenspach*}, Jennifer Listgarten ICLR 2025 (link) *(equal contributions) The perpetual motion machine of AI-generated data and the distraction of \"ChatGPT as scientist\" Jennifer Listgarten Nature Biotechnology 2024(link) and a freely available version here, and a talk at the 2024 National Academy of Sciences annual meeting. Optimal trade-off control in machine learning-based library design, with application to adeno-associated virus (AAV) for gene therapy D Zhu*, DH Brookes*, A Busia*, A Carneiro, C Fannjiang, G Popova, D Shin, KC Donohue,, LF Lin, ZM Miller, ER Williams, EF Chang, TJ Nowakowski, J Listgarten*, DV Schaffer* (*equal contributions, corresponding) Science Advances 2024 (paper link) Is novelty predictable? Clara Fannjiang and Jennifer Listgarten Cold Spring Harbor Perspectives in Biology 2023 (paper link), similar version also available on arXiv). MBE: model-based enrichment estimation and prediction for differential sequencing data Akosua Busia and Jennifer Listgarten Genome Research 2023 (paper link) Learning protein fitness models from evolutionary and assay-labeled data Chloe Hsu, Hunter Nisonoff, Clara Fannjiang, Jennifer Listgarten Nature Biotechnology 2022 (paper) Rethinking drug design in the artificial intelligence era P Schneider, WP Walters, AT Plowright, N Sieroka, J Listgarten, RA Goodnow Jr., J Fisher, JM Jansen, JS Duca, TS Rush, M Zentgraf, JE Hill, E Krutoholow, M Kohler, J Blaney, K Funatsu, C Luebkemann and G Schneider in Nature Reviews Drug Discovery 2019 (paper link) Conditioning by adaptive sampling for robust design David H. Brookes, Hahnbeom Park and Jennifer Listgarten accepted at ICML 2019 (paper link, arXiv version is most up-to-date) (5% acceptance rate for 20 min. oral presentation) Predicting off-target effects for end-to-end CRISPR guide design J Listgarten, M Weinstein, B Kleinstiver, AA Sousa, JK Joung, J Crawford, K Gao, M Elibol, L Hoang, J Doench, N Fusi (equal contributions and corresponding) Nature Biomedical Engineering (2018) (paper link) Associated tools and resources available here. Orthologous CRISPR-Cas9 for Combinatorial Genetic Screens F Najm*, C Strand*, K Donovan*, M Hegde*, KR. Sanson*, EW Vaimberg, ME Sullender, E Hartenian, N Fusi, J. Listgarten, ST Younger*, BE Bernstein**, DE Root**, JG Doench** Nature Biotechnology (2018) (paper link) (*equal contributions, **corresponding) Optimized sgRNA design to maximize activity and minimize off-target effects for genetic screens with CRISPR-Cas9 JG Doench*, N Fusi*, M Sullender*, M Hegde*, EW\tVaimberg*, KF Donovan, I Smith, Z Tothova, C Wilen , R Orchard , HW Virgin, J Listgarten*, DE Root Nature Biotechnology 2016 doi:10.1038/nbt.3437 (*equal contributions, corresponding) A pre-print of just the computational aspects of this paper is available on bioRxiv Source code and prediction server available from here: here. [Microsoft Research blog post] [Broad Institute blog post] Epigenome-wide association studies without the need for cell-type composition James Zou, C. Lippert, D. Heckerman, Martin Aryee, Jennifer Listgarten Nature Methods 2014 (journal link) Python software available from here, and R software available from here. Corrigendum: Supp. Figure 1 was not run with filters as described in the paper, but without any filters. We have contacted the journal to post this correction. FaST-LMM-Select for addressing confounding from spatial structure and rare variants Jennifer Listgarten, Christoph Lippert, David Heckerman (equal contributions and corresponding) Nature Genetics 2013 (journal link) Improved linear mixed models for genome-wide association studies Jennifer Listgarten, C. Lippert, C. Kadie, R. Davidson, E. Eskin and D. Heckerman (equal contributions and corresponding) Nature Methods 2012, doi:10.1038/nmeth.2037 Source and executables available here. FaST Linear Mixed Models for Genome-Wide Association Studies C. Lippert, Jennifer Listgarten, Y. Liu, C.Kadie, R. Davidson and D. Heckerman (equal contributions and corresponding) Nature Methods Aug. 2011, doi:10.1038/nmeth.1681 , freely available author copy including SI, Source and executables available here. Correction for Hidden Confounders in the Genetic Analysis of Gene Expression Jennifer Listgarten, Carl Kadie, Eric Schadt, David Heckerman PNAS 2010, doi: 10.1073/pnas.1002425107 (paper, Supplementary Information, software, GenomeWeb coverage) Bayesian detection of infrequent differences in sets of time series with shared structure. Jennifer Listgarten, Radford M. Neal, Sam T. Roweis, Rachel Puckrin and Sean Cutler, NIPS   2006 Best Student Paper, Honorable Mention. (abstract, paper) Statistical and computational methods for comparative proteomic profiling using liquid chromatography-tandem mass spectrometry. Jennifer Listgarten and Andrew Emili, Molecular and Cellular Proteomics 2005 4:419-434. (abstract) (paper) Multiple alignment of continuous time series. Jennifer Listgarten, Radford M. Neal, Sam T. Roweis and Andrew Emili, NIPS   2004 (abstract, paper, slides, and audio demo) All Publications Structural ontogen",
  "content_length": 29417,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:10"
}