{
  "name": "Jennifer T. Chayes",
  "homepage": "http://jenniferchayes.com",
  "status": "success",
  "content": "Jennifer Tour Chayes Jennifer Tour Chayes is Associate Provost of the Division of Computing, Data Science, and Society and Dean of the School of Information at the University of California, Berkeley, where she is also Professor of Electrical Engineering and Computer Sciences, Mathematics, Statistics, and Information. She is deeply committed to increasing racial and gender diversity in science, technology, engineering, and mathematics (STEM). Chayes research areas include phase transitions in computer science, structural and dynamical properties of networks including graph algorithms, and applications of machine learning. She is one of the inventors of the field of graphons, which are widely used for the machine learning of large-scale networks. Her prior work in the modeling and analysis of random, dynamically growing graphs, is used to model the internet, the World Wide Web, and social and economic networks. Her more recent work focuses on machine learning, including applications in cancer immunotherapy, ethical decision-making, and climate change. She is the co-author of more than 150 scientific papers and the co-inventor of 30 patents. Prior to joining UC Berkeley in 2020, Chayes worked at Microsoft Research for 23 years. She was Technical Fellow and Managing Director of Microsoft Research New England in Cambridge, Massachusetts, which she co-founded in 2008, Microsoft Research New York City, which she co-founded in 2012, and Microsoft Research Montreal, which she co-founded in 2017. Chayes developed Microsoft Research laboratories into world-renowned multidisciplinary centers, bringing together computer scientists, mathematicians, physicists, social scientists, and biologists. Chayes co-founded the Theory Group at Microsoft Research and was Research Area Manager for Mathematics, Theoretical Computer Science, and Cryptography. Among her contributions to Microsoft technologies are the development of methods to analyze the structure and behavior of various networks, the design of auction algorithms, and the design and analysis of various business models for the online world. Before working at Microsoft, Chayes was Professor of Mathematics at UCLA. She has received numerous awards for leadership and scientific contributions, including the Anita Borg Institute Women of Vision Leadership Award, the Society for Industrial and Applied Mathematics (SIAM) John von Neumann Lecture Award, the Association for Computing Machinerys (ACM) Distinguished Service Award, and honorary doctorates from Bard College and Leiden University. Chayes is a member of the American Academy of Arts and Sciences and the National Academy of Sciences. She is a fellow of the American Association for the Advancement of Science, the American Mathematical Society, the Association of Computing Machinery, the Association of Women in Mathematics, and the Fields Institute. Chayes is a member of numerous advisory boards and steering and oversight committees, including the UC Center for Data-Driven Insights and Innovation, the UC Health Governance Task Force, Massachusetts Institute of Technologys (MIT) Institute for Data, Systems, and Society and Schwarzman College of Computing, Harvard Universitys Institute for Applied and Computational Science, the Howard Hughes Medical Institute (HHMI) Janelia Campus, the International Centre for Theoretical Sciences in Bangalore, India, the Center for Minorities and People with Disabilities in IT, the Systems and Machine Learning conference, the Climate Change AI initiative, and the National Science Foundations (NSF) Institute for AI and Fundamental Interactions. She is also a member of the selection committee for the VinFuture Prize. She received a bachelors degree in biology and physics from Wesleyan University  graduating first in her class  and earned her Ph.D. in mathematical physics at Princeton. She completed her postdoctoral work in mathematics and physics at Harvard and Cornell. Chayes is married to Christian Borgs, her primary scientific collaborator and Professor of Electrical Engineering and Computer Sciences at UC Berkeley. For more details, download the detailed CV here. Selected Publications Graph Limits, Graphons and Nonparametric Network Models Counting graph homomorphisms (with C. Borgs, L. Lovasz, V. Sos, B. Szegedy and K. Vesztergombi) in Topics in Discrete Mathematics (eds. M. Klazar, J. Kratochvil, M. Loebl, J. Matousek, R. Thomas, P. Valtr), 315-371, Springer (2006). Graph limits and parameter testing (with C. Borgs, L. Lovasz, V. Sos, B. Szegedy and K. Vesztergombi) Proceedings of the 38rd Annual ACM Symposium on the Theory of Computing (STOC), 261-270 (2006). Convergent sequences of dense graphs I: Subgraph frequencies, metric properties and testing (with C. Borgs, L. Lovasz, V. Sos, and K. Vesztergombi) Advances in Math. 219, 1801-1851 (2008). Convergent sequences of dense graphs II: Multiway cuts and statistical physics (with C. Borgs, L. Lovasz, V. Sos, and K. Vesztergombi) Ann. of Math. 176, 151-219 (2012). Moments of two-variable functions and the uniqueness of graph limits (with C. Borgs and L. Lovasz) GAFA 19, 1597-1619 (2010). Limits of randomly grown graph sequences (with C. Borgs, L. Lovasz, V. Sos, K. Veszterbombi) Eur. J. Comb. 32, 985-999 (2011). Left and right convergence of graphs with bounded degree (with C. Borgs, J. Kahn, L. Lovasz) Random Struct. Alg. 42, 1-28 (2013). Asymptotic behavior and distributional limits of preferential attachment graphs (with N. Berger, C. Borgs, A. Saberi) Ann. Probab. 42(1), 1-40 (2014). Convergent sequences of sparse graphs: A large deviations approach (with C. Borgs, and D. Gamarnik) Random Struct. Alg. 51, 52-89 (2017). An Lp theory of sparse graph convergence I: limits, sparse random graph models, and power law distributions (with C. Borgs, H. Cohn and Y. Zhao). Trans. Amer. Math. Soc. 372, 30193062 (2019). An Lp theory of sparse graph convergence II: LD convergence, quotients, and right convergence (with C. Borgs, H. Cohn and Y. Zhao) Annals of Prob. 45, 337-396 (2018). Graphons: a nonparametric method to model, estimate, and design algorithms for massive networks (with C. Borgs). Proceedings of the 18th ACM Conference on Economics and Computation (EC17), 665672, (2017). Sparse exchangeable graphs and their limits via graphon processes (with C. Borgs, H. Cohn and N. Holden) Journal of Machine Learning Research 18 (210), 1-71 (2018). Sampling perspectives on sparse exchangeable graphs (with C. Borgs, H. Cohn, V. Veitch). Annals of Prob. 47 (5), 2754-2800 (2019). Identifiability for graphexes and the weak kernel metric (with C. Borgs, H. Cohn, L. M. Lovasz). In: I. Brny, G. Katona, A. Sali, Attila (Eds.), Building Bridges II - Mathematics of Laszlo Lovasz. Bolyai Society Mathematical Studies, Vol. 28, 29157 (2020). Limits of sparse conguration models and beyond: graphexes and multi-graphexes (with C. Borgs, S. Dhara, and S. Sen). Preprint (2019). A correction to Kallenberg's theorem for jointly exchangeable random measures (with C. Borgs, S. Dhara, and S. Sen). Preprint (2019). A large deviation principle for block models (with C. Borgs, J. Gaudio, S. Petti and S. Sen). Preprint (2020). Mechanism Design, Social Choice and Recommendation Systems Multi-unit auctions with budget-constrained bidders (with C. Borgs, N. Immorlica, M. Mahdian and A. Saberi) Proceedings of the 6th ACM Conference on Electronic Commerce (EC), 44-51 (2005). Bid optimization in online advertisement auctions (with C. Borgs, O. Etesami, N. Immorlica and M. Mahdian) 2nd Workshop on Sponsored Search Auctions (2006) and Proceedings of the 16th international conference on World Wide Web (WWW), 531-540 (2007). The myth of the folk theorem (with C. Borgs, N. Immorlica, A. Kalai, V. Mirrokni and C. Papadimitriou) Proceedings of the 40th Annual ACM Symposium on the Theory of Computing (STOC) (2008). Trust-based recommendation systems: An axiomatic approach (with R. Andersen, C. Borgs, U.Feige, A. Flaxman, A. Kalai, V. Mirrokni and M. Tennenholtz) Proceedings of the 17th international conference on World Wide Web (WWW), 199-208 (2008). A novel approach to propagating distrust (with C. Borgs, A. Kalai, A. Malekiany, M. Tennenholtz) Proceedings of the 6th International Workshop on Internet and Network Economics (WINE) 87-105 (2010). Game-theoretic models of information overload in social networks (with C. Borgs, B. Karrer, B. Meeder, R. Ravi, R. Reagans and A. Sayedi) Proceedings of the 7th Workshop on Algorithms and Models for the Web Graph (WAW) 146-161 (2010). Fast convergence of natural bargaining dynamics in exchange networks (with Y. Kanoria, M. Bayati, C. Borgs and A. Montanari) Proceedings of the 22nd ACM-SIAM Symposium on Discrete Algorithm (SODA) 1518-1537 (2011). The hitchhiker's guide to affiliation networks: A game-theoretic approach (with C. Borgs, J. Ding and B. Lucier) Proceedings of the 2nd Symposium on Innovations in Computer Science (ICS) 389-400 (2011). Pricing and queuing (with C. Borgs, S. Doroudi, M. Harchol-Balter, K. Xu) SIGMETRICS Performance Evaluation Review 40(3): 71-73 (2012). Priority pricing in queues with a continuous distribution of customer valuations (with S. Doroudi, M. Akan, M. Harchol-Balter, J. Karp, C. Borgs) CMU technical report CMU-CS-13-109 (2013). The optimal admission threshold in observable queues with state dependent pricing (with C. Borgs, S. Doroudi, M. Harchol-Balter, K. Xu) Probability in the Engineering and Informational Sciences 28, 101-110 (2014). Optimal multi-period pricing with service guarantees (with O. Candogan, C. Borgs, I. Lobel, and H. Nazerzadeh) Management Science 60, 1792-1811 (2014). Bargaining dynamics in exchange networks (with M. Bayati, C. Borgs, Y. Kanoria and A. Montanari) J. Econ. Theory 156, 417-454 (2015). An axiomatic approach to community detection (with C. Borgs, A. Marple, and S.-H. Teng) Proceedings of the 2016 ACM Conference on Innovations in Theoretical Computer Science (ITCS '16), 13",
  "content_length": 22265,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:12"
}