{
  "name": "Jenq-Kuen Lee",
  "homepage": "http://pllab.cs.nthu.edu.tw/~jklee",
  "status": "success",
  "content": "§õ¬F±X Jenq-Kuen Lee Ph.D., Indiana University Professor Department of Computer Science, National Tsing-Hua University, Hsinchu, Taiwan Research Interests: Optimizing compilers, Compilers for low-power, AI compilers, Computer architectures jklee@cs.nthu.edu.tw Room.547, Tel:03-5715131 ext. 33519 A. Publications: B. Course Homepage Computer Architecture (cs4100) -- Introduction to High-Performance and Low-Power Architectures Advanced Compiler Course (cs5404) -- Optimizing Compilers for High-Performance and Low-Power Architectures Advanced Programming Language Course (cs5403) -- Advanced Programming Languages Embedded Compiler (cs5405) -- Introduction to High-Performance and Low-Power Compilers for Embedded Systems Compiler Course (cs340402) -- Generating Bitcode Assembly for C language Software Studio Course (Software Lab.)(cs2410) -- Labs: Java + Android C. Affiliations Our Research Lab.: Programming Language Research Lab. We were funded by a MOEA project for software/system infrastructures and designs for dual-core embedded processors (2005-2008): MOEA Compiler and Processor Project. Our MOEA project is renewed for software/system infrastructures and designs for multi-core embedded processors (2008-2011): MOEA Compiler and Embedded Multi-core Project. Our MOEA project is now for software/system infrastructures and designs for GPU and HSA processors (2012-2015): MOEA Compiler and GPU/HSA Project. I am currently participating in compiler optimizations with NNEF, TVM, RISC-V, SPIR-V, OpenCL, etc. D. On-Going Research Grants (2005-2008-2011-2015-2018-now ) Compilers for GPU Processors and Vulkan/OpenCL and SPIR-V Compilers Optimizations for RISC-V Processors Compilers Optimization for Halide Language for Vision Processing Compilers for DSP Processors NNEF (deep Learning and AI) Compiler",
  "content_length": 1814,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:13"
}