{
  "name": "Jens Palsberg",
  "homepage": "http://www.cs.ucla.edu/~palsberg",
  "status": "success",
  "content": "Jens Palsberg Jens Palsberg Professor of Computer Science PhD, MBA UCLA Computer Science Department University of California, Los Angeles Engineering VI, Lab 486, Los Angeles, CA 90095-1596, USA palsberg@ucla.edu Phone: 310-825-6320 Fax: 310-794-5057 Curriculum vitae and brief biography Publications, DBLP, h-index = 50 UCLA compilers group Research Programming languages, software engineering, quantum computing Projects (former) NJR: A Normalized Java Resource Reasoning about the Java memory model Quantum computing, as a member of CIQC (an NSF QLCI), as reported by UCLA Tutorial EMSOFT 2005 tutorial on Programming Sensor Networks by Mani B. Srivastava and Jens Palsberg Activities (former) Director, Science Hub for Humanity and Artificial Intelligence Member of the ACM Council Member of the ACM Athena Lecturer Award committee Journals TQC Edit. Board ACM Transactions on Quantum Computing TC Edit. Board IEEE Transactions on Computers I&C Edit. Board Information and Computation SCP Edit. Board Science of Computer Programming Conferences 2026 PLDI'26 RC Member ACM Conference on Programming Language Design and Implementation PLanQC'26 PC Member ACM Workshop on Programming Languages for Quantum Computing (Rennes) Conferences 2025 (1994-2024) ASPLOS'25 PC Member ACM International Conference on Architectural Support for Programming Languages and Operating Systems (Rotterdam) QCRC'25 Co-organizer Quantum Computing Research Challenges (Albuquerque, New Mexico) POPL'25 PC Member ACM Symposium on Principles of Programming Languages (Denver) CC'25 PC Co-Chair ACM International Conference on Compiler Construction (Las Vegas) PEPM'25 PC Member ACM International Workshop on Partial Evaluation and Program Manipulation (Denver) Honors National Science Foundation CAREER Award, 1998. Purdue University Faculty Scholar, 1999-2004, in recognition of outstanding academic distinction. One of the Ten Best Teachers of Undergraduates in the School of Science, Purdue University, for a course on compilers, 2001 Okawa Foundation Research Award, 2003. IBM Faculty Award, 2005. ACM Distinguished Speaker, 2006-2014. ACM SIGPLAN Distinguished Service Award, 2012. Eon Instrumentation Excellence in Teaching Award at UCLA for courses on quantum computing, 2023. JensFest 2024, picture, picture, picture, picture, video. POPL 2025 keynote speaker: Welcome to Quantum 3.0! Software The Java Tree Builder, a frontend for The Java Compiler Compiler Ph.D. Students Keli Huang Zhuoyang (John) Ye Former Students Tian Zhao, Ph.D. 2002, now an associate professor at University of Wisconsin, Milwaukee Dennis Brylow, Ph.D. 2003, now a professor at Marquette University, Milwaukee Mayur Naik, M.S. 2003, now a professor at U. Pennsylvania. Ma, Di, Ph.D. 2004, now at Synopsys Krishna Nandivada, Ph.D. 2005, now a professor at IIT, Madras. Christian Grothoff, Ph.D. 2006, now a professor at Bern University of Applied Sciences, Switzerland. Benjamin Titzer, Ph.D. 2007, now at CMU. Fernando Pereira, Ph.D. 2008, now a professor at Univ. Federal de Minas Gerais (UFMG), Brazil. Jonathan K. Lee, Ph.D. 2010, now at Google. Mahdi Eslamimehr, Ph.D. 2014, now at Quandary Peak Research and at USC. Mohsen Lesani, Ph.D. 2014, now a professor at UC Santa Cruz. Matt Brown, Ph.D. 2017, now at Intentionet; received the Outstanding Graduating Ph.D. Student Award. John Bender, Ph.D. 2019, now at Sandia National Laboratories. Christian Kalhauge, Ph.D. 2020, now an associate professor at DTU, Denmark. Akshay Utture, Ph.D. 2023, now at Uber. Zeina Migeed, Ph.D. 2023, now at Meta. Shuyang Liu, PhD. 2024, now at Meta; received both the Outstanding TA Award and the Outstanding Mentorship Award. Courses at UCLA (more) CS 132 Compiler Construction: F03 F04 F05 F06 S08 S09 W10 F11 F12 F14 S16 F16 F17 F18 F19 F20 F21 S23 S24 S25 CS 238 Quantum Programming: S19 S20 W21 W22 F22 F23 F24 F25 CS 238B Quantum Algorithms: S21 S22 W23 W24 W25 Worth Reading The King of Denmark; so long, and thanks for the Ph.D; some advice on dissertations, talks, and how to have your abstract rejected; yes, Virginia, there is a Santa Claus; Angel, stylish Angel, cool Angel, plus Angel pondering some entries in CiteSeer. Angel. Hobbit dictionary for children.",
  "content_length": 4221,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:21"
}