{
  "name": "Jeongseob Ahn",
  "homepage": "https://sites.google.com/korea.ac.kr/csl",
  "status": "success",
  "content": "CSL@KUSearch this siteEmbedded FilesSkip to main contentSkip to navigationComputer Systems Laboratory컴퓨터 시스템 연구실 석사/박사과정 및 학부 인턴에 대해 궁금한 학생들은 jsahn@csl.korea.ac.kr 혹은 상담 신청서 통해서 연락 주세요 :)Welcome to CSL @ Korea UniversityOur research group was established at Ajou University in 2017 and is now at Korea University. Our research interests lie in the area of computer systems and architecture. The following keywords describe our research interests: Computer Architecture, Operating Systems, AI Systems, and Datacenter (Cloud) Computing. We are actively looking for graduate students and undergraduate interns. If you are interested in our research group, feel free to contact us (jsahn@csl.korea.ac.kr). The following research projects (but not limited to) are as follows.Fast, efficient, and scalable AI Systems Designing and optimizing LLM serving engines (e.g., vLLM, SGLang, and Llama.cpp) and frameworks (e.g., PyTorch)Co-designing hardware (e.g., GPU, CPU, and PNM/PIM) and software platformsOperating Systems for datacenter & cloud computingProfiling and understanding the performance behaviors of  emerging (cloud and serverless) applications Exploring new solution space using generative AI modelsSOSP 2025, SeoulJinwoo presented his paper at ASPLOS 2025김종현 박사 (2025) 졸업 기념컴퓨터시스템 소사이어티 동계학술대회 2025 @ 용평2024 고려대 신공학관SIGARCH Korea 2024 @ 연세대컴퓨터시스템 소사이어티 동계학술대회 2024 @ 용평EuroSys 2023 @ Rome, Italy컴퓨터시스템 소사이어티 동계학술대회 2023 @ 용평USENIX ATC/OSDI 2022, Carlsbad, California2020 Ajou2019 아주대 캠퍼스News2025[Oct. 2025] Our paper \"An Efficient DNN Model Serving System using Layer-wise Caching and Direct-Host-Access\" was accepted for publication in the ACM Transactions on Computer Systems (TOCS) journal. Congratulations Jinwoo![Oct. 2025] We are excited to announce that our LLM serving framework, LMServe, is now publicly available! Check it out at https://github.com/Sys-KU/LMServe and give it a try![Sep. 2025] Jeongseob was invited to serve on the program committee for ISPASS 2026.[Sep. 2025] Jeongseob delivered an invited talk at SAIT on \"Towards Cost-Effective LLM Serving Systems\".[Sep. 2025] Jongho started his master's program.[Aug. 2025] Jinwoo received a Research Excellence award from the Graduate School, Korea University. Congratulation Jinwoo! [Photo][Jul. 2025] Jeongseob was invited to serve on the external review committee for HPCA 2026.[Jun. 2025] Kyumin left our group to start his career at NAVER. Best wishes to Kyumin![Jun. 2025] A collaborative work titled \"Déjà Vu: Efficient Video-Language Query Engine with Learning-based Inter-Frame Computation Reuse\" was accepted for publication at the VLDB 2025.[Mar. 2025] Seunggon and Woohyung started their PhD program, and Eunseok started his master's program.[Feb. 2025] Jeongseob was invited to serve on the program committee for MICRO 2025 and ASPLOS 2026.[Feb. 2025] Congratulations to Dr. Jonghyeon Kim for starting his career at MangoBoost! Wish you all the best in your next chapter. [Photo][Feb. 2025] We are very excited to announce that our work \"Accelerating LLM serving systems for multi-turn dialogues\" was accepted to ACM ASPLOS 2025. Congratulations Jinwoo! [Photo][Jan. 2025] Our two early-stage studies were accepted for publication in IEEE Computer Architecture Letters (CAL). Congratulations Jongho, Jonghyeon, Woohyung, Jinwoo, and co-authors![Jan. 2025] Jiye, a senior student at the University of Waterloo, joined our group as an undergraduate intern during the spring.2024[Dec. 2024] Eunseok and Kyumin joined our group. Welcome![Dec. 2024] Gyeonggeun left our group to start his graduate studies in the Spring of 2025 at KAIST. Best wishes to Gyeonggen![Dec. 2024] Jeongseob was invited to serve on the program committee for ISPASS 2025[Dec. 2024] Woohyung successfully defended his M.S. thesis. Congratulation! He will be continuing his research as a PhD student at Korea University.[Nov. 2024] Jonghyeon successfully defended his Ph.D. thesis. Congratulation! Dr Kim. He is now on the job market.[Aug. 2024] Soonjae joined our group for his PhD study. Welcome![Jul. 2024] Dr. Jungi Jeong (Google) visited our group and gave a technical talk about \"Speculation Techniques to Tackle Data Dependency in CPU Microarchitecture (Why Apple CPUs are faster than others)\"[Jul. 2024] Seunggon, Gyeonggeun, and Yumin joined our research group as interns. Welcome aboard![Jun. 2024] Jonghyeon joined ETRI as a research intern this summer.[Mar. 2024] Our group moved from Ajou University to Korea University. 2023[Dec. 2023] Jeongseob was invited to serve on the program committee for  SYSTOR 2024, ICS 2024, and ASPLOS 2025.[Aug. 2023] Jongho joined our research group as an undergraduate intern. Welcome to our team![Jul. 2023] Jeongseob delivered an invited talk at SIGARCH Korea on \"Serving DNNs on GPU servers in the Face of Cold Starts\".[May 2023] Our EuroSys 2023 work received Gilles Muller Best Artifact Award. Congratulations Jinwoo and Seungsu! [Tweet | Ajou News | AiTimes | Photo ][May 2023] Jeongseob was invited to serve on the program committee for HPCA 2024. [Apr. 2023] A collaborative work titled \"EnvPipe: Performance-preserving DNN Training Framework for Saving Energy\" was accepted for publication at the USENIX 2023 Annual Technical Conference (ATC).[Feb. 2023] Our group's proposal \"Building High-Performance AI Inference Serving Systems\" was funded by the National Research Foundation of Korea (NRF, 신진연구) from Mar. 2023 to Feb 2026.[Feb. 2023] WooHyung joined our research group as a master's student. He was an engineer developing mobile games at a startup company. Welcome!2022[Dec. 2022] We are armed with an NVIDIA A100 (80GB) GPU for research! See our server infrastructure :)[Nov. 2022] Our research paper \"Server Load and Network-aware Adaptive Deep Learning Inference Offloading for Edge Platforms\" was accepted for publication in the Elsevier Internet of Things (IoT) journal. Congratulations Dr. Jungmo Ahn![Oct. 2022] Jeongseob gave an invited talk at NVRAMOS 2022 about \"Memory Harvesting in Multi-GPU Systems with Hierarchical Unified Virtual Memory\". [Photo][Oct. 2022] We have two undergraduate interns joining us this fall. Welcome aboard  Youngjoon and Jiho![Aug. 2022] We are thrilled to announce that our work building a fast and efficient DNN model serving system has been accepted for publication at the ACM EuroSys 2023. Kudos to Jinwoo and Seungsu. [Aug. 2022] SeongJae who is a Linux kernel maintainer visited our group and gave a technical talk about \"Data Access-aware Operating System\" [Photo][Jul. 2022] Our group attended the 2022 USENIX ATC/OSDI conference in Carlsbad, CA. [Photos] [Jun. 2022] Jungmo successfully defended his Ph.D. thesis. He will be joining Hyundai MOBIS in July. Congratulations! Dr. Ahn[Apr. 2022] We are excited to share that our paper titled \"Memory Harvesting in Multi-GPU Systems with Hierarchical Unified Virtual Memory\" was accepted for publication at the USENIX 2022 Annual Technical Conference (ATC). Congratulations co-authors! 2021[Dec. 2021] Jinwoo presented our research on accelerating DL inferences on modern GPU servers at the KSC 2021. This is a preliminary version. Stay tuned![Dec. 2021] Jonghyeon was invited to present our multi-tiered memory study (USENIX ATC 2021) at the KSC 2021 top-conference session. [Dec. 2021] Suhyun received an excellent prize for her research on “Analyzing the memory management schemes in the Linux Kernel” at the 2021 Fall Ajou Software Concert. Congratulations Suhyun![Oct. 2021] Jeongseob gave an invited talk at NVRAMOS 2021 about \"Operating System Support for Multi-Tiered Memory: A Case Study of Intel's Optane DCPMM\".[Sep. 2021] Suhyun joined our research group as an undergraduate intern. [Jul. 2021] Our group joined an IT research center to research the topic of VR/AR-based intelligent life consultants for 8 years. [AiTimes News, Ajou News][Jun. 2021] Wonkyo and Taeklim left our group to start their Ph.D. studies from Fall 2021 at the University of Virginia and the University of Texas at Austin, respectively. Also, Jieun left our group and joined ETRI as an undergraduate intern. We wish them all the best.[Jun. 2021] Our paper titled “Rethinking Remote Memory Placement on Large-Memory Systems with Path Diversity” was accepted for ACM SIGOPS Asia-Pacific Workshop on Systems (APSys). Congratulation Wonkyo![Jun. 2021] Ji-Eun won the grand prize for her research on “CPU and GPU cooperation to efficiently train deep learning-based recommendation models” at the 2021 Spring Ajou Software Concert. Congratulations Jieun![Apr. 2021] We are happy to announce that our group has two papers accepted for publication at the USENIX 2021 Annual Technical Conference (ATC). Congratulations Jonghyeon, Wonkyo, and co-authors![Apr. 2021] Jeongseob was invited as a reviewer for ACM Transactions on Computer Systems (TOCS).[Feb. 2021] We invited Prof. Chang Hyun Park at Uppsala University to our department virtually for a technical seminar and discussed a collaboration opportunity.[Jan. 2021] We received funding from SK Hynix for conducting research on \"CXL-based Memory-Centric Server Systems\" from Jan. 2021 to Dec. 2022 (2 years).2020[Dec. 2020] Seungsu joined our research group as an undergraduate intern. Welcome aboard! [Dec. 2020] Wonkyo successfully defended his masters thesis. Congratulations! [Photo][Oct. 2020] Jeongseob was invited as a program committee member for ISPASS 2021.[Oct. 2020] Our alumna Jiwon joined PetaIO, a startup company concentrating on storage solutions, as an engineer. Congratulations![Sep. 2020] Our group has been affiliated with the Department of Artificial Intelligence and has been supported by BK21 for \"Ajou DREAM Artificial Intelligence Division for Educating Innovative Leaders\" from Sep. 2020 ~ Aug. 2027 (7 years)![Aug. 2020] Our position paper titled \"A Study of Memory Placement on Hardware-assisted Tiered Memory Systems\" was accepted for IEEE Computer Architecture Letters (CAL). Congratulations Wonkyo and Jonghyeon![Jul. 2020] Our",
  "content_length": 13443,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:22"
}