{
  "name": "Jeong-Gil Ko",
  "homepage": "http://www.eis-lab.org",
  "status": "success",
  "content": "EIS Lab @ YonseiSearch this siteEmbedded FilesSkip to main contentSkip to navigationEmbedded Intelligent Systems Laboratory @ Yonsei University College of Computing연세대학교 지능형임베디드시스템 연구실Welcome to the Embedded Intelligent Systems Laboratory at the School of Integrated Technology, College of Computing, Yonsei University! 연세대학교 인공지능융합대학 IT융합공학과 지능형임베디드시스템 연구실 방문을 환영합니다!We are interested in a broad range of research topics within the domain of mobile and embedded computing systems, cyber physical systems, intelligent computing and human-computer interaction. Overall, we are interested in how we can design various forms of computing systems in a human-centered manner.The basis of our research is in identifying interesting system-level requirements for real-world computing applications, and spans to designing hardware/software prototypes for addressing challenging application tasks. Specifically, our lab focuses on research topics such as low-power mobile and embedded computing systems, sensing-based context recognition systems, and ambient intelligent sensing system design for applications such as healthcare, transportation or buildings.We are always on the search for devoted students to join our research group. If you are interested in building smart embedded systems and performing research in this domain, please send us (anyone in the lab) an email! Note that we have limited spaces for students and researchers, so make sure that you are willing to work hard and have strong programming skills (C, Java, Python or whatever language you like the best) before contacting us. Recent News and Lab Log2025.11Kichang's paper on analyzing the impact of ABS on strike-ball calls in the KBO league has been accepted to Scientific Reports.Our collaborative work with Singapore Management University on utilizing drone-based videos for swimmer performance analysis has been accepted to IEEE/CVF WACV 2026.2025.10JeongGil will be serving on the TPC for ACM MobiSys 2026.2025.09JeongGil will be delivering a keynote talk at IEEE MSN 2025.Our paper on proposing a new direction of research that emphasizes adaptive sensing has been accepted as a position paper to NeurIPS 2025.2025.08JeongGil will be delivering a keynote talk at the IEEE ICNP Cloud-Edge Continuum (CEC) Workshop 2025.Sungmin is back from his 6-month visit to the University of Michigan. Welcome back!Satoki (Hamachu) from Keio University will be visiting us again for three weeks. Welcome back!2025.07JeongGil will be serving on the TPC for IEEE PerCom 2026.Yujin will be visiting the University of Michigan for 6 months working with Professor Pei Zhang.2025.06JeongGil has been elected as the Treasurer of ACM SIGMOBILE and will be serving a two year term on the executive committee starting July 2025. Thank you for your support!2025.05JeongGil will be serving on the editorial board for ACM Transactions on Internet of Things (TIOT) as an associate editor.JeongGil received a Commendation from the Deputy Prime Minister and Minister of Education of the Republic of Korea for his contribution in mobile computing research and education.JeongGil will be joing the ICDCN 2025 program committee.Kichang will take part in ACM SenSys 2026 as the publicity chair.2025.04JeongGil is awarded the Outstanding Teaching Award from Yonsei University for courses taught in 2024. 2025.03Our work on proposing a lightweight algorithm for adaptive jamming detection is accepted to IEEE DCOSS-IoT 2025.JeongGil will be serving on the 2025 ACM SIGMOBILE Doctoral Dissertation Award Selection Committee.JeongGil will be serving a 2-year term as the Chair Professor for the Integrated IT Major in the School of Integrated Technology.Satoki (Hamachu) from Keio University will be visiting us for two weeks. Welcome to the research team!2025.02Jaewon will start a position as a researcher at Seoul National University Hospital starting May 2025. He will be continuing his Ph.D. studies with our research group as he prepares his dissertation.Kichang returned from his six month visit to SMU. Welcome back!2025.01JeongGil will be serving as the artifact evaluation chair for ACM MobiCom 2025.Our work PowDew, presented at ACM MobiSys 2024, has been invited and published in GetMobile.Sungmin will be starting his 6-month visit to EECS @ University of Michigan. 2024.12Our work on designing a light-weight classifier using gzip for extremely constraint platforms has been accepted to ICT Express. Congratulations to Sungmin and Kichang!Our work on identifying novel index-hijacking attacks for autoencoder-based systems has been accepted to the Internet of Things journal. Congratulations to Kichang and Jaeho!2024.11Starting next March, Joonhee will continue his studies at our group as a masters student and Gyeongmin will be joining our group as a masters student from the Department of Mobility Systems Engineering! Welcome!JeongGil will be serving on the program committee for ACM SenSys 2025.2024.10JeongGil will be serving on the program committee for EWSN 2025.JeongGil will be serving on the program committee for ACM CHASE 2025.Our work on exploring factors that influence depressive symptoms among middle-aged and elderly adult population has been accepted to Archives of Gerontology and Geriatrics.2024.09Our work on designing a federated learning system for systems with heterogeneous embedded devices has been accepted to ACM SenSys 2024! Congratulations Yujin, Kichang and Sungmin, and thank you to our collaboration team at SNU!JeongGil will be serving on the IEEE ICDCS 2025 Program Committee.Mone Tanaka, a masters student from Osaka University, has joined our lab as a visiting researcher. Welcome Mone!Our survey paper on on-device training frameworks for resource constraint platforms will be published in the ACM Transactions on Sensor Networks. Excellent collaboration with Uppsala University and RISE. Congratulations Shuai!2024.08Our group's Ph.D. graduate Dr. JaeYeon Park will be joining Dankook University as a tenure-track assistant professor! He will be with the Department of Mobile Systems Engineering (Undergraduate) and the Department of Computer Science (Graduate). Congratulations Professor Park! Kichang will start his 6-month visit to the School of Computing and Information Systems at Singapore Management University.2024.07Our work on designing a benchmark for federated learning in IoT systems will be published in the Journal of Data-centric Machine Learning Research (DMLR).Minju will be continuing her research as a Ph.D. student in our research group.JeongGil will be serving on the PC for IEEE SECON 2025.2024.06Our poster on designing a foundational model for ECG data using contrastive learning was awarded the Best Poster Award from the Korean Society of Medical Informatics Spring Conference! Congratulations Kichang!Jaeho will be joining our group as a Ph.D. student starting this fall. Congratulations on your acceptance to the Ph.D. program and welcome!Yong Un has successfully defended his masters thesis! Congratulations Yong Un! He will be returning to his position as a software engineer for LX Semicon.Kichang has been selected as a visiting student researcher to Singapore Management University. His visit will be from Aug 2024 to Feb 2025.JeongGil will be serving as an associate chair for ACM CHI 2025.Our work on detecting counterfeit powdered food products using a smartphone camera, PowDew, received the Best Paper Award from ACM MobiSys 2024! Congratulations to Kichang and all the authors from the CyPhyLab@KAIST and the Human-centered Intelligent Systems Lab@POSTECH!Sungmin and Kichang's work on designing an ultra-lightweight time-series classification model with gZip compression received the Best Poster Runner-Up Award from ACM MobiSys 2024. Congratulations!2024.05Our proposal for initiating the YKCS Open RAN Global Collaboration Center (PI: Dongku Kim) will be funded by the Ministry of Science and ICT.JeongGil will serve as a technical advisor for SK Magic, a SK Networks company.JeongGil will serve as the Publication Chair for ACM SenSys 2024.Our proposal on initiating the 6G Cloud Research and Education Open Hub (PI: Chan-Byoung Chae) will be funded by the Ministry of Science and ICT.2024.04We will be extending our collaborations with LG Electronics with a new project related to developing small-scale language models for personalized HVAC system management.2024.03JeongGil will be serving on the ACM SenSys 2024 TPC.Our work on detecting counterfeit powdered food products using a smartphone camera has been accepted to ACM MobiSys 2024! Congratulations to Kichang and the team at KAIST and POSTECH!2024.02JeongGil will be serving as the publications chair for ACM SenSys 2024.JeongGil will be joining the editorial board of the IEEE Transactions on Quantum Engineering as an Associate Editor.Joonhee will join our group as an undergraduate research intern. Welcome!2024.01We will be starting a new project supported by the Ministry of Science and ICT on developing machine learning techniques for effectively supporting ultra-precision 6G networking. 2023.12Dr. Hyunmi Kim from ETRI will be joining our group as a visiting scholar from Dec. 2023 to May 2024! Welcome Hyunmi!HeeWon will be joining our lab as a masters student starting March 2024! Welcome to the team!We will be initiating a project on designing algorithms for vehicular radar-based environment and object classification with 42dot, a Hyundai Motors Company.2023.11Our work in tracking people across densely populated indoor environments has been accepted to the Pervasive Mobile Computing journal.2023.10JeongGil has been selected as a senior member of the ACM.JeongGil will be serving on the ACM/IEEE IoTDI program committee.JeongGil will be visiting Keio University as a Guest Associate Professor at Keio University SFC in January 2024.2023.09Congratulations to JaeYeon for starting his career as a principle researcher at Samsung Electronics Mobile R&D Center! Congratulations JaeYeon!Startin",
  "content_length": 13489,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:21"
}