{
  "name": "Jeremiah Blocki",
  "homepage": "https://www.cs.purdue.edu/homes/jblocki",
  "status": "success",
  "content": "Jeremiah Blocki @Purdue Associate Professor Department of Computer Science Purdue University Email: [jblocki AT purdue] CV: blocki-cv.pdf Purdue Bio: Profile Bio: I am an Associate Professor in Computer Science at Purdue University. Broadly, my research interests include cryptography, data privacy and security. I like to describe myself as a theoretical computer scientist who is interested in applying fundamental ideas from computer science to address practical problems in usable privacy and security. I am especially interested in developing usable and secure authentication protocols for humans. Are there easy ways for humans to create and remember multiple strong passwords? Can we design secure cryptographic protocols that are so simple that can be run by a human? Prior to joining Purdue I completed my PhD on Usable Human Authentication at Carnegie Mellon University where I was fortunate to be advised by Manuel Blum and Anupam Datta. I also spent a year at Microsoft Research New England as a postdoc. Data Structures and Algorithms (CS 251): Fall 2025, Fall 2023, Fall 2022 Advanced Cryptography (CS 655): Spring 2023 Competitive Programming 1 and 2 (CS290/CS390): Fall 2021 Cryptography (CS 555): Spring 2021, Fall 2018, Fall 2017, Spring 2017 Introduction to the Analysis of Algorithms (CS 381): Spring 2024, Fall 2020, Fall 2019 Passwords and Human Authentication: Spring 2025, Spring 2020, Fall 2016 Algorithm Design, Analysis, And Implementation (CS 580): Spring 2019, Spring 2018 Justin Zhang Nathan Smearsoll. Mohammad Hassan Ameri Ekhtiarabadi. Blake Holman. Seunghoon Lee (2024). Postdoc at University of Waterloo. Peiyuan Liu (2024). Meta. Wenjie Bai (2023). Google. Tamalika Mukherjee [Co-Advised with Elena Grigorescu] (2023). Research Group Leader at Max Planck institute for Security and Privacy. Alexander Block (2022). Assistant Professor at University of Illinois at Chicago. Ben Harsha (2021). Amazon. Seunghoon Lee Samson Zhou. Texas A&M. A Tight Lower Bound on the TdScrypt Trapdoor Memory-Hard Function. with Seunghoon Lee. IACR Communications in Cryptology [Full Version] Differentially Private Compression and the Sensitivity of LZ77. with Seunghoon Lee and Brayan Sebastian Yepes Garcia. TCC 2025. [Full Version] Provably Memory-Hard Proofs of Work With Memory-Easy Verification. with Nathan Smearsoll. TCC 2025. [Full Version] Amortized Locally Decodable Codes for Insertions and Deletions. with Justin Zhang. Information-Theoretic Cryptography 2025. Amortized Locally Decodable Codes. with Justin Zhang. ISIT 2025 [Full Version] The Impact of Reversibility on Parallel Pebbling. with Blake Holman and Seunghoon Lee. EUROCRYPT 2025. [Full Version] Differential privacy and Sublinear time are incompatible sometimes. with Hendrik Fichtenberger, Elena Grigorescu, Tamalika Mukherjee. ITCS 2025 [Full Version] Conditional Encryption with Applications to Secure Personalized Password Typo Correction. with Mohammad Hassan Ameri. CCS 2024. [Full Version] How to Make Your Approximation Algorithm Private: A Black-Box Differentially-Private Transformation for Tunable Approximation Algorithms of Functions with Low Sensitivity. with Elena Grigorescu, Tamalika Mukherjee and Samson Zhou. RANDOM 2023 [Full Version] On Relaxed Locally Decodable Codes for Hamming and Insertion-Deletion Errors. with Alex Block, Kuan Cheng, Elena Grigorescu, Xin Li, Yu Zheng, Minshen Zhu. CCC 2023 [Full Version] Computationally Relaxed Locally Decodable Codes, Revisited. with Alexander Block. ISIT 2023 Confident Monte Carlo: Rigorous Analysis of Guessing Curves for Probabilistic Password Models. With Peiyuan Liu and Wenjie Bai. IEEE S&P 2023. [Full Version] Differentially Private L2-Heavy Hitters in the Sliding Window Model. with Seunghoon Lee, Tamalika Mukherjee and Samson Zhou. ICLR 2023 The Parallel Reversible Pebbling Game: Analyzing the Post-Quantum Security of iMHFs. with Blake Holman and Seunghoon Lee. TCC 2022 [Full Version] Towards a Rigorous Statistical Analysis of Empirical Password Datasets. with Peiyuan Liu. IEEE S&P 2023. [Full Version] Cost-Asymmetric Memory Hard Password Hashing. with Mohammad Hassan Ameri and Wenjie Bai. SCN 2022. [Full Version] Memory-Hard Puzzles in the Standard Model with Applications to Memory-Hard Functions and Resource-Bounded Locally Decodable Codes. with Mohammad Hassan Ameri and Alex Block. SCN 2022. [Full Version] Sustained Space and Cumulative Complexity Trade-offs for Data-Dependent Memory-Hard Functions. with Blake Holman. CRYPTO 2022. [Full Version] Privately Estimating Graph Parameters in Sublinear time. with Elena Grigorescu and Tamalika Mukherjee. ICALP 2022. [Full Version] DALock: Password Distribution-Aware Throttling. with Wuwei Zhang. PETS 2022 [Full Version] On the Multi-User Security of Short Schnorr Signatures with Preprocessing. with Seunghoon Lee. EUROCRYPT 2022 . [Full Version] On Explicit Constructions of Extremely Depth Robust Graphs. with Mike Cinkoske, Seunghoon Lee and Jin Young Son. STACS 2022. [Full Version] Password Strength Signaling: A Counter-Intuitive Defense Against Password Cracking. with Wenjie Bai and Ben Harsha. GameSec 2021. [Full Version] HACCLE: Metaprogramming for Secure Multi-Party Computation with Yuyan Bao, Kirshanthan Sundararajah, Raghav Malik, Qianchuan Ye, Christopher Wagner, Nouraldin Jaber, Fei Wang, Mohammad Hassan Ameri, Donghang Lu, Alexander Seto, Benjamin Delaware, Roopsha Samanta, Aniket Kate, Christina Garman, Pierre-David Letourneau, Benoit Meister, Jonathan Springer, Tiark Rompf, and Milind Kulkarni. GPCE 2021. Exponential Lower Bounds for Locally Decodable Codes Correcting Insertions and Deletions. with Kuan Cheng, Elena Grigorescu, Xin Li, Yu Zheng, Minshen Zhu. FOCS 2021. [Full Version] On the Security of Proofs of Sequential Work in a Post-Quantum World. with Seunghoon Lee and Samson Zhou. ITC 2021 [Full Version] Relaxed Locally Correctable Codes in Computationally Bounded Channels. with Venkata Gandikota, Elena Grigorescu and Samson Zhou. IEEE Transactions on Information Theory 2021 Conference Version: ISIT 2019. [Full Version] [ICALP 2018 Brief Announcement] Private and Resource-Bounded Locally Decodable Codes for Insertions and Deletions. with Alexander Block. ISIT 2021 [Full Version] Differentially Private Sublinear-Time Clustering. with Elena Grigorescu and Tamalika Mukherjee. ISIT 2021 Bicycle Attacks Considered Harmful: Quantifying the Damage of Widespread Password Length Leakage. with Ben Harsha, John Springer and Melissa Dark. Computers & Security 2021 (Volume 100) [DOI] [Full Version] [LinkedIn Password Frequency Corpus] DAHash: Distribution Aware Tuning of Password Hashing Costs. with Wenjie Bai. FC 2021 [Full Version] A New Connection Between Node and Edge Depth Robust Graphs. with Mike Cinkoske. ITCS 2021 [Full Version] (Full List) (DBLP)",
  "content_length": 6836,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:23"
}