{
  "name": "Jeremy Singer",
  "homepage": "http://www.dcs.gla.ac.uk/~jsinger",
  "status": "success",
  "content": "Jeremy Singer : home page Jeremy Singer : home page I am a Professor of Computer Systems and Programming Languages at the School of Computing Science, in the University of Glasgow. My main research themes are Compilers, Language Runtimes, and Cybersecurity. I lead the Systems Research section at Glasgow. You can find out more about my research, or browse through my publications list. I am a Senior Member of the ACM and a Fellow of the BCS. Research Projects M4Secure: Making Memory Management More Secure, 2023-2026, funded by EPSRC. Capabilities for Coders, 2022-2023, funded by EPSRC. See [project website]. Capable VMs, 2020-2024, funded by EPSRC. See [project website]. ... and several previous EPSRC-funded grants. People I work with I supervise the following PhD students at Glasgow: Niall Barr Tools to support Domain Specific Language development and Product Family Engineering Yuxin Qin Performance Optimization for WebAssembly Interpreters Charles Varley Programming Language Abstractions for Named Data Networking Kai Feng Early detection of zero-day exploits in Industrial Control Systems Jacob Trevor Quantum Memory Management Duncan Lowther Future Secure Memory Systems Completed PhDs: Khaled Alnowaiser Garbage collection optimization for non uniform memory access architectures [Thesis] Dhahi Alshammari Evaluation of cloud computing modelling tools: simulators and predictive models [Thesis] Dejice Jacob Opportunistic acceleration of array-centric Python computation in heterogeneous environments [Thesis] Adrian Ramsingh Improving interoperability in distributed multi-tier software stacks [Thesis] Yousef Alhaizaey  Task Scheduling for Heterogeneous Edge Micro Clusters [Thesis] Ohud Alasmari Development and validation of an instrument for evaluating online coding tutorial systems [Thesis] I am always looking for talented Computer Scientists who want to study for a systems research PhD at Glasgow. Please contact me if you intend to apply. Service I am a peer review college member for EPSRC and a Carnegie Research Assessor. From 2016-18, I was the Graduate Academy director for SICSA, with responsibility for enhancing PhD experience for Scottish Computing Science students. I am external examiner for undergraduate programmes in Computer Science at Queen's University Belfast Until 2024, I was on the editorial board of the Computer Journal. I was program chair for Onward! Essays 2022 and workshops co-chair for EuroPar 22 in Glasgow. In 2021, I organized the Scottish Programming Languages and Verification PhD Summer School. I also served as Program Chair for the ACM SIGPLAN Managed Programming Languages and Runtimes conference (MPLR 21). I was on the steering committee for ACM SIGPLAN International Symposium on Memory Management (ISMM). Useful Links Check out my textbook on Operating Systems Foundations with Linux on the Raspberry Pi I contributed to the first ever textbook on SSA: SSA-Based Compiler Design I co-developed a Functional Programming in Haskell MOOC I co-developed a Teaching Data Science MOOC I co-developed a Computational Thinking in JavaScript specialization for Coursera Raspberry Pi Cloud project Recycle your Raspberry Pi My Software Engineering mini-lectures on ITunesU http://orcid.org/0000-0001-9462-6802 home page research publications teaching code christian contact me",
  "content_length": 3337,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:31"
}