{
  "name": "Jeremias Sulam",
  "homepage": "https://www.bme.jhu.edu/people/faculty/jeremias-sulam",
  "status": "success",
  "content": "Jeremias Sulam - Johns Hopkins Biomedical Engineering Skip to Content Menu Search Search Search Apply Contact BME Accreditation Give In this Section Johns Hopkins Biomedical Engineering People Faculty Jeremias Sulam Jeremias Sulam, PhD Research Interests: Inverse problems in biomedical imaging, responsible and trustworthy machine learning, biomarker discovery Lab Website: Sulam Group Publications: From Google Scholar Contact jsulam1@jhu.edu Clark 320B Research Interests Research Interests Jeremias’ research focuses on the foundations of machine learning and applications to biomedical imaging. He is interested in learning under parsimonious structures in data, robustness, and ethical implications of data-driven methods, as well as in the interpretability and auditing of the resulting models. His work is motivated by applications of diagnostic imaging in radiology, inverse problems, and biomarker discovery in neuroscience and digital pathology. Titles & Affiliations Titles William R. Brody Faculty Scholar Assistant Professor, Biomedical Engineering Assistant Professor, Computer Science Assistant Professor, Applied Mathematics and Statistics Affiliated Centers & Institutes Center for Imaging ScienceKavli Neuroscience Discovery InstituteMathematical Institute for Data Science (MINDS) Education Education PhD, Computer Science, Technion Israel Institute of Technology, Israel, 2018 Biongineering, Universidad Nacional de Entre Rios, Argentina, 2013 Faculty News Recent Highlights July 24, 2025 Jeremias Sulam appointed the William R. Brody Faculty Scholar The award supports promising young faculty in the Department of Biomedical Engineering. July 16, 2025 Environment near tumors may hold key information Johns Hopkins engineers use AI to analyze tissue patterns and gain new insights into why some patients respond better to specific breast cancer treatments. September 11, 2024 New tool blends classic math and AI to tackle complex challenges Learned Proximal Networks offer reliable solutions for tasks like image restoration, reconstruction of medical scans, and other estimation problems. June 25, 2024 13 from Hopkins BME among those selected to receive Johns Hopkins Discovery Awards The Discovery Awards are intended to spark new interactions among investigators across the university rather than to support established projects. Teams can apply for up to $100,000 to explore a new area of collaborative work with special emphasis on preparing for an externally funded large-scale grant or cooperative agreement. Read the Johns Hopkins University privacy statement here. Accept",
  "content_length": 2603,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:25"
}