{
  "name": "Jeremy Gibbons",
  "homepage": "http://www.cs.ox.ac.uk/jeremy.gibbons",
  "status": "success",
  "content": "Jeremy Gibbons | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyJeremy GibbonsJeremy Gibbons Professor Jeremy Gibbons CEng MBCS CITP FIAPProfessor of Computer ScienceGoverning Body Fellow, Kellogg CollegeE: jeremy.gibbons@cs.ox.ac.ukT: 01865 283508T: 01865 283521I: ORCIDI: DBLPI: Google ScholarS: Twitter Room 462, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Programming LanguagesCompleted Projects:Datatype-Generic Programmingmore…See Also:YoutubeBlogPearlsmore…InterestsMy research interests are in programming methodology—that is, in better languages for writing computer programs, and better ways of using the languages we already have. I am particularly concerned with functional languages (which emphasize computing with values rather than with actions) and object-oriented languages (which encourage program structures that reflect the structure of the real-world entities they are modelling), and with ways of expressing and reasoning about recurring patterns in software structure. You might be interested in my blog. I lead the Algebra of Programming research group; I am member of IFIP Working Group 2.1 on Algorithmic Languages and Calculi (and was chair for 6 years, and secretary for 13 years), and of IFIP Working Group 2.11 on Program Generation; and between 2012 and 2018 I was Vice Chair then Past Vice Chair of ACM SIGPLAN. I am co-Editor-in-Chief of the Journal of Functional Programming, and an Editor of The Programming Journal: The Art, Science, and Engineering of Programming and Compositionality: The open-access journal for the mathematics of composition; do consider submitting a paper! If you would like to study with me, please read this note first. BiographyOxford-centric bio: I am teach on the Software Engineering Programme, which offers part-time professional Masters' degrees in Software Engineering and in Software and Systems Security (and have formerly served as Director). For the academic years 2008-2010 I was also Deputy Director of the Computing Laboratory (now the Department of Computer Science), and I served as Chair of the Faculty of Computer Science from 2012 to 2016. I am a fellow of Kellogg College. Before taking up this post in 1999, I held lectureships at Oxford Brookes University and the University of Auckland, New Zealand. Bio for talks etc: Jeremy Gibbons is Professor of Computing at the University of Oxford, where he leads the Algebra of Programming research group, and is a lecturer on the part-time professional postgraduate master’s programme in Software Engineering. His research interests are in programming languages, especially functional programming and patterns in programming. He is Editor-in-Chief of the journal The Art, Science, and Engineering of Programming, an Editor (and until recently Editor-in-Chief) of the Journal of Functional Programming, an Editor of Compositionality, a member (and former chair and secretary) of IFIP Working Group 2.1 on Algorithmic Languages and Calculi, a member of IFIP Working Group 2.11 on Program Generation, and former Vice Chair of ACM SIGPLAN.RolesView AllCompositionality JournalEditorBX 2015Programme Committee memberPEPM 2015Programme Committee memberSee alsoYoutubeBlogPearlsMastodonSelected PublicationsView AllManage publications Turner‚ Bird‚ Eratosthenes: An Eternal Burning Thread Jeremy Gibbons In Journal of Functional Programming. Vol. 35. No. e5. 2025. Details about Turner‚ Bird‚ Eratosthenes: An Eternal Burning Thread | BibTeX data for Turner‚ Bird‚ Eratosthenes: An Eternal Burning Thread | DOI (10.1017/S0956796824000194) | Download (pdf) of Turner‚ Bird‚ Eratosthenes: An Eternal Burning Thread Agda−ventures with PolyP Jeremy Gibbons and Patrik Jansson In Alex Gerdes‚ Hieke Keuning and Wouter Swierstra, editors, Taalblaat: Festschrift for Johan Jeuring. 2025. Details about Agda−ventures with PolyP | BibTeX data for Agda−ventures with PolyP | DOI (10.5281/zenodo.17181794) | Download (pdf) of Agda−ventures with PolyP Trends in Functional Programming Jeremy Gibbons, editor Details about Trends in Functional Programming | BibTeX data for Trends in Functional Programming | DOI (10.1007/978-3-031-99751-8) ActivitiesSoftware EngineeringClinical InformaticsResearch InformaticsFunctional ProgrammingAlgebra of ProgrammingInformation ModellingCompleted ProjectsDatatype-Generic ProgrammingCancerGridChoreographing Complex ServicesGeneric and Indexed ProgrammingSemantic FrameworksEvolving Health InformaticsUnifying Theories of ObjectsAccelerating Cancer Research Using Semantics-Driven TechnologyReusability and Dependent TypesHospital of the FutureModel-driven software developmentUnifying Theories of Generic ProgrammingBidirectional TransformationsALIGNED Current Students Juuso  HaavistoJohannes Hartmann Research Jack  Liell-CockPart-time Research Assistant, Doctoral Student Past Students Guillaume BoisseauKwok-Ho CheungOliver GoldsteinJosh KoRolf MorelMaciej PirogDan ShieblerAnthony SmithMeng WangPeter WongTimothy ZakianMaaike ZwartAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 5304,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:25"
}