{
  "name": "Jeremy Buhler",
  "homepage": "https://www.cse.wustl.edu/~jbuhler",
  "status": "success",
  "content": "Jeremy Buhler's Home Page Jeremy Buhler's Home Page Position: Professor, CSE Institution: Washington University in St. Louis Departments: Computer Science and Engineering and Genetics Office: McKelvey 1036 E-mail Address: jbuhler AT wustl DOT edu Office Phone: 314-935-6180 Postal Address: MSC 1045-213-1010J One Brookings Drive St. Louis, MO 63130 Research Activities My primary research interests lie in analysis of scientific datasets that meets throughput and/or latency goals while operating under constraints on available processing power. My group studies how to best implement these computations on modern, highly parallel computing architectures, including low-power multicores, GPUs, and field-programmable gate arrays (FPGAs). Utilizing these powerful accelerator architectures effectively raises a number of interesting theoretical and engineering problems in mapping and scheduling of parallel computations to meet performance goals and in the design of programming frameworks to support streaming and modular computation. It is often necessary to modify algorithms, or to invent entirely new algorithms, that exploit the parallelism in accelerator hardware. Historically, most of my work was on analyzing databases of DNA and protein sequences produced by molecular biologists. The lessons I've learned in accelerating computations on such data have application well beyond bioinformatics, including computations such as network packet filtering, chemical and gravitational simulations, and branch-and-bound optimization. More recently, I've collaborated with colleagues in astrophysics to design real-time, balloon- and satellite-based analysis pipelines for gamma-ray telescopes. For more information on my contributions, please see my curriculum vitae. I am a member of the Stream-Based Supercomputing (SBS) Lab. Selected research products MERCATOR -- infrastructure for mapping irregular streaming computations onto NVIDIA GPUs Mandala -- a tool for designing spaced seeds for biosequence similarity search the Projection Genomics Toolkit, including the PROJECTION motif finder -- tools to apply random projection techniques to biosequence similarity search Dapple -- a tool for DNA microarray scanning and quantitation tool Selected Teaching and Service Activities Some of the courses I teach: CSE 347 -- Analysis of Algorithms CSE 541T -- Advanced Algorithms CSE 447T -- Introduction to Formal Languages and Automata CSE 584A -- Algorithms for Biosequence Comparison CSE 7900 -- Parallel Computing Journal Club CSE 7800 / BIO 5496 -- Computational Molecular Biology Journal Club I am my department's Director of Master's Programs Just for Grins Hanukkah Song lyrics from 2011 Holiday Party Recommended reading My graduate alma mater: University of Washington My undergraduate alma mater: Rice University Everybody loves combinatorics! Jeremy Buhler (jbuhler AT wustl DOT edu) Last Update: 11/30/2022",
  "content_length": 2919,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:25"
}