{
  "name": "Jeremy Aarons",
  "homepage": "http://monash.academia.edu/JeremyAarons",
  "status": "success",
  "content": "Jeremy Aarons - Monash University Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless Jeremy AaronsMonash University, Caulfield School of IT, Faculty MemberaddFollowdoneFollowingFollowers4Following0Public ViewsRelated Authors Noel B. SalazarKU Leuven Nathan AndrewsMcMaster University David SeamonKansas State University Armando Marques-GuedesUNL - New University of Lisbon Noe CornagoUniversity of the Basque Country, Euskal Herriko Unibertsitatea Ina VandebroekThe University of the West Indies, Mona, Jamaica Dirisa MulindwaUniversity of Sunderland Puiu NISTOREANUThe Bucharest Academy of Economic Studies Fabrice LumineauThe University of Hong Kong Uday ChandraSFS Qatar (Georgetown University)Interests UploadsPapers by Jeremy AaronsEpistemology and Knowledge Management... 118-157). Stanford, CA: Stanford University Press. Galison, P.(1997). Image and logic. Chicag... more ... 118-157). Stanford, CA: Stanford University Press. Galison, P.(1997). Image and logic. Chicago: University of Chicago Press. Gettier, EL (1963). Is justified true belief knowledge? Analysis, 23, 121-123. Retrieved June 2004 from http:// www. ditext. com/gettier/gettier. ... Supporting organisational knowledge work: Integrating thinking and doing in task-based supportDownload Filling the Knowledge Management Sandwich: An Exploratory Study of a Complexwork Environment FROM PHILOSOPHY TO KNOWLEDGE MANAGEMENT AND BACK AGAIN ×CloseLog InLog in with GoogleorEmailPasswordRemember me on this computeror reset passwordEnter the email address you signed up with and we'll email you a reset link. Need an account? Click here to sign up AboutPressPapersTopicsAcademia.edu Journals We're Hiring! Help CenterFind new research papers in:PhysicsChemistryBiologyHealth SciencesEcologyEarth SciencesCognitive ScienceMathematicsComputer ScienceTermsPrivacyCopyrightContent PolicyAcademia ©2025",
  "content_length": 2107,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:25"
}