{
  "name": "Jernej Barbic",
  "homepage": "https://viterbi-web.usc.edu/~jbarbic",
  "status": "success",
  "content": "Jernej Barbic Professor of computer science, University of Southern California, Los Angeles, USA. Research interests: computer graphics, animation, interactive physics, FEM, model reduction, deformable models, anatomically based modeling, medical imaging, haptics. Hand MRI dataset Author of Co-founder and CTO of acquired by Unity Technologies. Students: •   Jiahao Wen, PhD cand. •   Huanyu Chen, PhD cand. •   Zhiyuan Gao, PhD cand. •   Past students Teaching: Spring 2025: CS-520 Computer Animation and Simulation Spring 2025: CS-420 Computer Graphics Spring 2024: CS-520 Computer Animation and Simulation Spring 2024: CS-420 Computer Graphics Spring 2023: CS-520 Computer Animation and Simulation Spring 2023: CS-420 Computer Graphics Spring 2022: CS-520 Computer Animation and Simulation Spring 2022: CS-420 Computer Graphics Older classes Awards: Academy Award for Scientific and Technical Achievement, 2025 ACM Distinguished Member, 2020 Infinity Festival Monolith Award for Technology, 2019 USC Stevens Commercialization Award, 2017 Sloan Fellowship, 2014 Okawa Foundation Research Grant, 2014 MIT Technology Review, 35 Innovators Under 35 (in the world), 2011 NSF CAREER Award Viterbi Early Career Chair, USC Film credits: The Hobbit: The Desolation of Smaug (2013). Publications: Zhiyuan Gao, Jiageng Mao, Hong-Xing Yu, Haozhe Lou, Emily Yue-ting Jia, Jernej Barbič, Jiajun Wu, Yue Wang: Seeing the Wind from a Falling Leaf, Conference on Neural Information Processing Systems (NeurIPS) 2025 Gao and Mao contributed equally, and should be considered equal first authors. Huanyu Chen, Jiahao Wen, Jernej Barbič: ANIME-Rod: Adjustable Nonlinear Isotropic Materials for Elastic Rods, ACM Transactions on Graphics 44(4) (SIGGRAPH 2025), Vancouver, Canada, 2025 Jiahao Wen, Jernej Barbič, Danny Kaufman: Optimal r-Adaptive In-Timestep Remeshing for Elastodynamics, ACM Transactions on Graphics 44(4) (SIGGRAPH 2025), Vancouver, Canada, 2025 Mianlun Zheng, Jernej Barbič: Multi-Resolution Real-Time Deep Pose-Space Deformation, ACM Transactions on Graphics 43(6) (SIGGRAPH Asia 2024), Tokyo, Japan, 2024 Jiahao Wen, Bohan Wang, Jernej Barbič: Large-Strain Surface Modeling using Plasticity, IEEE Trans. on Visualization and Computer Graphics, 30(8), 2024 Jiahao Wen, Jernej Barbič: Kirchhoff-Love Shells with Arbitrary Hyperelastic Materials, ACM Transactions on Graphics 42(6) (SIGGRAPH Asia 2023), Sydney, Australia, 2023 Huanyu Chen, Danyong Zhao, Jernej Barbič: Capturing Animation-Ready Isotropic Materials Using Systematic Poking, ACM Transactions on Graphics 42(6) (SIGGRAPH Asia 2023), Sydney, Australia, 2023 Mianlun Zheng, Bohan Wang, Jingtao Huang, Jernej Barbič: Simulation of Hand Anatomy Using Medical Imaging, ACM Transactions on Graphics 41(6) (SIGGRAPH Asia 2022), Daegu, South Korea, 2022 Zheng and Wang contributed equally, and should be considered equal first authors. David Millard, James Preiss, Jernej Barbič, Gaurav Sukhatme: Parameter Estimation for Deformable Objects in Robotic Manipulation Tasks, International Symposium on Robotics Research 2022 Omey Manyar, Junyan Cheng, Reuben Levine, Vihan Krishnan, Jernej Barbič, Satyandra K. Gupta: Synthetic Image Assisted Deep Learning Framework for Detecting Defects During Composite Sheet Layup, ASME Computers and Information in Engineering Conference 2022, Best Paper Award Danyong Zhao, Yijing Li, Timothy Langlois, Siddhartha Chaudhuri, Jernej Barbič: ERGOBOSS: Ergonomic Optimization of Body-Supporting Surfaces, IEEE Transactions on Visualization and Computer Graphics, 28(12), 2022 Yi-Wei Chen, Rex Jomy Joseph, Alec Kanyuck, Shahwaz Khan, Rishi K. Malhan, Omey M. Manyar, Zachary McNulty, Bohan Wang, Jernej Barbič, Satyandra K. Gupta: A Digital Twin for Automated Layup of Prepreg Composite Sheets, ASME Manufacturing Science and Engineering Conference; and ASME Journal of Manufacturing Science and Engineering, 2021 Mianlun Zheng, Yi Zhou, Duygu Ceylan, Jernej Barbič: A Deep Emulator for Secondary Motion of 3D Characters, CVPR 2021 (oral presentation) Omey M. Manyar, Jaineel Ashok Desai, Nimish Deogaonkar, Rex Jomy Joseph, Rishi K. Malhan, Zachary McNulty, Bohan Wang, Jernej Barbič, Satyandra K. Gupta: A Simulation-Based Grasp Planner for Enabling Robotic Grasping during Composite Sheet Layup, ICRA 2021 Mianlun Zheng, Danyong Zhao, Jernej Barbič: Evaluating the Efficiency of Six-DoF Haptic Rendering-Based Virtual Assembly Training, IEEE Transactions on Haptics, 14(1), 2021 Bohan Wang, George Matcuk, Jernej Barbič: Modeling of Personalized Anatomy using Plastic Strains, ACM Transactions on Graphics (TOG), 40(2), 2021 Bohan Wang, Jernej Barbič: CUDA Deformers for Model Reduction, ACM SIGGRAPH Conference on Motion, Interaction and Games (MIG), 2020 Bohan Wang, Mianlun Zheng, Jernej Barbič: Adjustable Constrained Soft-Tissue Dynamics, Pacific Graphics 2020 (Best Paper Award), and Computer Graphics Forum, 2020 Bohan Wang, George Matcuk, Jernej Barbič: Hand Modeling and Simulation Using Stabilized Magnetic Resonance Imaging, ACM Transactions on Graphics 38(4) (SIGGRAPH 2019), Los Angeles, CA, 2019 Yijing Li, Jernej Barbič: Multi-Resolution Modeling of Shapes in Contact, Symposium on Computer Animation (SCA) 2019, Los Angeles, CA; and Proc. of the ACM in Computer Graphics and Interactive Techniques (PACMCGIT), 2(2), 2019 Yijing Li, Jernej Barbič: Immersion of Self-Intersecting Solids and Surfaces, ACM Transactions on Graphics 37(4) (SIGGRAPH 2018), Vancouver, Canada, 2018 Danyong Zhao, Yijing Li, Jernej Barbič: 6-DoF Haptic Rendering of Static Coulomb Friction Using Linear Programming, IEEE Transactions on Haptics 2018, 11(3), 2018 Bohan Wang, Yili Zhao, Jernej Barbič: Botanical Materials Based on Biomechanics, ACM Transactions on Graphics 36(4) (SIGGRAPH 2017), Los Angeles, CA, USA Hongyi Xu, Jernej Barbič: Example-Based Damping Design, ACM Transactions on Graphics 36(4) (SIGGRAPH 2017), Los Angeles, CA, USA Yijing Li, Hongyi Xu, Jernej Barbič: Enriching Triangle Mesh Animations With Physically Based Simulation, IEEE Transactions on Visualization and Computer Graphics, 23(10), 2017 Hongyi Xu, Jernej Barbič: 6-DoF Haptic Rendering using Continuous Collision Detection Between Points and Signed Distance Fields, IEEE Transactions on Haptics, 10(2), 2017 Danyong Zhao, Yijing Li, Jernej Barbič: Asynchronous Implicit Backward Euler Integration, Symposium on Computer Animation (SCA) 2016, Zurich, Switzerland James Jacobs, Jernej Barbič, Essex Edwards, Crawford Doran, Andy van Straten: How To Build a Human: Practical Physics-Based Character Animation, DigiPro Symposium, 2016 Hongyi Xu and Jernej Barbič: Pose-Space Subspace Dynamics, ACM Transactions on Graphics 35(4) (SIGGRAPH 2016), Anaheim, CA, USA Hongyi Xu and Jernej Barbič: Adaptive 6-DoF Haptic Contact Stiffness Using the Gauss Map, IEEE Transactions on Haptics, 9(3), 2016 Yijing Li and Jernej Barbič: Stable Anisotropic Materials, IEEE Transactions on Visualization and Computer Graphics, 21(10), 2015 Hongyi Xu, Fun Shing Sin, Yufeng Zhu, Jernej Barbič: Nonlinear Material Design Using Principal Stretches, ACM Transactions on Graphics 34(4) (SIGGRAPH 2015), Los Angeles, CA, USA Yu Wang, Alec Jacobson, Jernej Barbič, Ladislav Kavan: Linear Subspace Design for Real-Time Shape Deformation, ACM Transactions on Graphics 34(4) (SIGGRAPH 2015), Los Angeles, CA, USA Koki Nagano, Graham Fyffe, Oleg Alexander, Jernej Barbič, Hao Li, Abhijeet Ghosh, Paul Debevec: Skin Microstructure Deformation with Displacement Map Convolution, ACM Transactions on Graphics 34(4) (SIGGRAPH 2015), Los Angeles, CA, USA Hongyi Xu, Yijing Li, Yong Chen, Jernej Barbič: Interactive Material Design Using Model Reduction, ACM Transactions on Graphics (TOG), 34(2), 2015 Hongyi Xu, Jernej Barbič: Continuous Collision Detection Between Points and Signed Distance Fields, Workshop on Virtual Reality Simulation and Physical Simulation, 2014 Yijing Li, Jernej Barbič: Stable Orthotropic Materials, Symposium on Computer Animation (SCA) 2014, Copenhagen, Denmark, Honorable Mention Best Paper Award Hongyi Xu, Jernej Barbič: Signed Distance Fields for Polygon Soup Meshes, Graphics Interface 2014, Montreal, Canada Hongyi Xu, Yili Zhao, Jernej Barbič: Implicit Multibody Penalty-based Distributed Contact, IEEE Transactions on Visualization and Computer Graphics, 20(9), 2014 Xu and Zhao both contributed equally to this paper, and should be considered equal first authors. Yili Zhao, Jernej Barbič: Interactive Authoring of Simulation-Ready Plants, ACM Transactions on Graphics 32(4) (SIGGRAPH 2013), Anaheim, CA, USA, July 2013 Fun Shing Sin, Daniel Schroeder, Jernej Barbič: Vega: Nonlinear FEM Deformable Object Simulator, Computer Graphics Forum, 32(1), 2013, p. 38-50. Video. Jernej Barbič, Fun Shing Sin, Eitan Grinspun: Interactive Editing of Deformable Simulations, ACM Transactions on Graphics 31(4) (SIGGRAPH 2012), Los Angeles, CA, USA, August 2012 Jernej Barbič, Yili Zhao: Real-time Large-deformation Substructuring, ACM Transactions on Graphics 30(4) (SIGGRAPH 2011), Vancouver, Canada, August 2011 Jernej Barbič, Doug L. James: Subspace Self-collision Culling, ACM Transactions on Graphics 29(4) (SIGGRAPH 2010), Los Angeles, CA, USA, July 2010 Jernej Barbič, Marco da Silva, Jovan Popović: Deformable Object Animation Using Reduced Optimal Control, ACM Transactions on Graphics 28(3) (SIGGRAPH 2009), New Orleans, LA, USA, August 2009 Jernej Barbič, Jovan Popović: Real-time Control of Physically Based Simulations using Gentle Forces, ACM Transactions on Graphics 27(5) (SIGGRAPH Asia 2008), Singapore, Dec 2008 Jernej Barbič, Doug L. James: Six-DoF Haptic Rendering of Contact Between Geometrically Complex Reduced Deformable Models, IEEE Trans. on Haptics, 1(1), 2008, p. 39-52 Jernej Barbič, Doug L. James: Time-critical Distributed Contact for 6-DoF Haptic Rendering of Adaptively Sampled Reduced Deformable Models, Best paper-and-presentation award, Symposium on Computer Animation (SCA) 2007, p. 171-180, San Dieg",
  "content_length": 16366,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:36"
}