{
  "name": "Jeroen Keppens",
  "homepage": "https://www.kcl.ac.uk/people/jeroen-keppens",
  "status": "success",
  "content": "Jeroen Keppens | King's College London Skip to main contentDr Jeroen Keppens Senior LecturerResearch interestsComputer scienceContact details+44 020 7848 1591jeroen.keppens@kcl.ac.ukBiographyResearch Interests Artificial intelligence and law Approximate reasoning Qualitative reasoning Knowledge representation Compositional modelling More Information Research Profile Research Funding PublicationsResearchResearchSecurity HubThe Security Hub consolidates the research related to securityKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Reasoning and PlanningThe group focuses on the fundamental AI challenge of creating, representing and reasoning. Security HubThe Security Hub consolidates the research related to securityNewsNews28 February 2020King's Informatics student wins WCIT Silver Award for outstanding academic results and enhancing student experienceKayla Phillips Sanchez, a BSc Computer Science with Management student in the Department of Informatics has been awarded a Silver Information Technology Award...StudentTechnology & SciencePublicationsResearchNewsResearchSecurity HubThe Security Hub consolidates the research related to securityKing's Cybersecurity CentreAn EPSRC-NCSC Academic Centre of Excellence in Cyber Security Research (ACE-CSR). It provides expertise on most areas of cyber security, it has a critical mass of researchers working on three main research themes and their interrelationship.Reasoning and PlanningThe group focuses on the fundamental AI challenge of creating, representing and reasoning. Security HubThe Security Hub consolidates the research related to securityNews28 February 2020King's Informatics student wins WCIT Silver Award for outstanding academic results and enhancing student experienceKayla Phillips Sanchez, a BSc Computer Science with Management student in the Department of Informatics has been awarded a Silver Information Technology Award...StudentTechnology & Science(N)7.17Bush HouseStrand campus, 30 Aldwych, London, WC2B 4BGBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 2302,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:32"
}