{
  "name": "Jerome Knopp",
  "homepage": "https://sce.umkc.edu/about/directory/name/jerome-knopp-ph-d",
  "status": "success",
  "content": "Home | Science and Engineering | University of Missouri - Kansas City University of Missouri-Kansas city School of Science and Engineering Science and Engineering Apply Visit Get Info Find an Area of Study That's Right for You! We offer a variety of degrees in science and engineering programs that use cutting-edge technology, experimentation, learning and discovery to prepare our students for success in whatever comes next. Explore our programs Home No matter where you are in your academic journey, we're here to help you plan your path. Our programs focus on experimentation, learning and discovery — there's no limit to how far you can go. We Are the School of Science and Engineering We welcome students from across the nation and around the world to join us in the pursuit of high-quality educational experiences and extracurricular activities that help shape the professionals they become. We can’t wait for you to be part of SSE! Academics Through our four academic divisions, we offer a variety of programs for undergraduate and graduate students, as well as kids still completing their K-12 education. Explore our programs Admissions We combine the personal touch of a small college with the student experience of a big university. Learn how to apply Affordability We have more than 125 scholarships reserved just for students in our programs. Get help paying for college Research Our research supports advances in healthcare, public safety, technology and other industries. Explore our research Community Outreach Enhance or pivot your career Sign up for Professional Programs Access new technologies Visit Innovation Studio Find ways to give Give back to SSE Science and Engineering News Stargazing at UMKC: Explore the Warko Observatory Warkoczewski Observatory received a mayoral proclamation to honor its 50th anniversary UMKC Hosts Regional Stakeholders to Discuss Critical Materials Crossroads Project That Would Shape America’s Industrial Future Initiative would enhance national security and create thousands of jobs UMKC Recognizes Outstanding Alumni for the 2026 Alumni Awards 15 alumni and one family will be honored on April 17 St. Louis Resident Wants to Help Others with Degree from UMKC “I am interested in working with prosthetics and pursuing a biomedical engineering degree. UMKC is known for its engineering and medical programs, so I look forward to learning more.” Atlas Sizemore Engineering Learn more about UMKC More to Explore Find support and resources Meet our faculty and staff Join our alumni network Learn more about us We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn More",
  "content_length": 2685,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:33"
}