{
  "name": "Jerry Fails",
  "homepage": "https://www.boisestate.edu/coen-cs/people/faculty/jerry-alan-fails",
  "status": "success",
  "content": "Jerry Alan Fails, Ph.D. - Computer Science Skip to main content Computer Science People Faculty Jerry Alan Fails, Ph.D. Jerry Alan Fails, Ph.D. Jerry Alan Fails, Ph.D. Chair & Professor Visit Jerry’s website CCP 363 Call: (208) 426-5783 jerryfails@boisestate.edu Visit Jerry’s website About Jerry Alan Fails Bio Education Research Bio Jerry Alan Fails is the Department Chair and a Professor in the Computer Science Department at Boise State University in Boise, Idaho. He loves to teach and help students learn the fundamentals of computer programming and user-centered design. His general area of research is Human-Computer Interaction, with a focus on designing technology with and for children. His primary area of research is human-computer interaction (HCI), with a focus on technologies that engage children with one another, get them active, and encourage them to explore the world around them. He has designed technologies with and for children using participatory design methods for the last 20+ years. As part of his research he directs an intergenerational design team called Kidsteam. The team consists of young children and adults who work together as partners to improve and design new technologies. He cares deeply about the ethical concerns surrounding children’s involvement in the design process and how data collected about children is utilized. His current projects focus on seeking to support children as they search for information online, understanding privacy and fear within family contexts, supporting children’s privacy and security needs online, and expanding methods of designing technologies with and for children to online, hybrid, and in-person modalities at the local and global scale. He serves as an adjunct chair for conferences for ACM SIGCHI (which sponsors 25+ conferences). He is the International Interaction Design and Children (ACM) Steering Committee Chair. He hosted the ACM IDC Conference in Boise in 2019. He serves as an IJCCI Associate Editor among other editorial and reviewing duties. In addition to his service as Department Chair, he is a member of several university-wide committees. Education Ph.D., University of Maryland M.S., Brigham Young University B.S., Brigham Young University Research Technologies with and for Children Participatory Design – working with children to give them a voice in the design of technologies Human-Computer Interaction (HCI) Computer Science computerscience@boisestate.edu (208) 426-5766 City Center Plaza (CCP), RM 364 Back To Top",
  "content_length": 2520,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:32"
}