{
  "name": "Jerry L. Prince",
  "homepage": "https://iacl.ece.jhu.edu/index.php?title=Main_Page",
  "status": "success",
  "content": "IACL Main Page From IACL Jump to navigation Jump to search Samuel W. Remedios presenting his poster \"Cycle-consistent zero-shot through-plane super-resolution for anisotropic head MRI\" at the 29th Conference on Information Processing in Medical Imaging (IPMI 2025), Kos Island, Greece, May 25–30, 2025. Which won Best Poster! Savannah Hays presenting her award winning poster \"The Importance of Super-Resolution and Harmonization in a Pragmatic Clinical MR Image Dataset\" at the ACTRIMS Young Scientist Conference 2025. Dr. Lianrui Zuo of Vanderbilt University presenting our collaboration \"Counterfactual brain amyloid pathology image synthesis\" at Proceedings of SPIE Medical Imaging (SPIE-MI 2025), San Diego, CA, February 16–20, 2025. Prof. J.L. Prince with Shimeng Wang, Carlos Rivas, and Dr. Jinwei Zhang at Proceedings of SPIE Medical Imaging (SPIE-MI 2025), San Diego, CA, February 16–20, 2025. Meeting at the Henry Jackson Foundation for the team behind the Brain Biomechanics Imaging Resources on NITRC, made possible by the NIH through U01 NS112120 (PI: P.V. Bayly). Drs. Yihao Liu and Lianrui Zuo after their hooding by Prof. J.L. Prince. IACL at the ACTRIMS Young Scientist Meeting. From left to right, Dr. Blake Dewey, Dr. Jinwei Zhang, Savannah Hays, Dr. Shuwen Wei, & Shimeng Wang. IACL Group Photo from the Proceedings of SPIE Medical Imaging (SPIE-MI 2024), San Diego, CA, February 18–22, 2024. Zhangxing Bian presenting his award winning paper \"Is Registering Raw Tagged-MR Enough for Strain Estimation in the Era of Deep Learning?\" at the Proceedings of SPIE Medical Imaging (SPIE-MI 2024), San Diego, CA, February 18–22, 2024. Zhangxing Bian presenting \"MomentaMorph: Unsupervised Spatial-Temporal Registration with Momenta, Shooting, and Correction\" at the MICCAI Workshop on Time-Series Data Analytics and Learning (MTSAIL 2023) in conjunction with the 26th International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI 2023), Vancouver, Canada, October 8–12, 2023. IACL Lab members at CMSC 2023 in Aurora, Colorado. Dr. Muhan Shao being hooded by Prof. Jerry L. Prince. Recent News Items 2025 December Dr. Shuwen Wei presents his paper titled \"Optical Coherence Tomography Harmonization with Anatomy-Guided Latent Metric Schrödinger Bridges\" at the Conference on Neural Information Processing Systems (NeurIPS 2025), San Diego, CA, December 2–7, 2025. For more details see   . Dr. Jinwei Zhang presents his paper title \"Automated Unique Lesion Tracking (AULTRA): A Framework for Longitudinal Lesion-wise Morphometric Analysis in Multiple Sclerosis\" at the annual meeting of the Radiological Sociey of North America (RSNA 2025), Chicago, IL, November 30 – December 4, 2025. November Dr. Chen has yet another paper accepted in Medical Image Analysis, this one titled \"Unsupervised learning of spatially varying regularization for diffeomorphic image registration\" to appear in February 2026.  (doi) October Samuel W. Remedios successfully defends his thesis titled \"Through-plane super-resolution of anisotropic multi-slice magnetic resonance images\". M. Faizyab Ali Chaudhary joins IACL from the University of Alabama at Birmingham. September IACL papers at the 28th International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI 2025), Daejeon, South Korea, September 23–27, 2025. Samuel W. Remedios presented \"Exploring the feasibility of zero-shot super-resolution in preclinical imaging\".  (doi) Samuel W. Remedios also presented \"Unsupervised OCT image interpolation using deformable registration and generative models\" on behalf of Dr. Shuwen Wei.  (doi) Anqi \"Amy\" Feng presented \"Segmenting Thalamic Nuclei: T1 Maps Provide a Reliable and Efficient Solution\" as part of the Workshop on Interpretability of Machine Intelligence in Medical Image Computing (iMIMIC). Samuel W. Remedios presented \"Exploring the feasibility of zero-shot super-resolution in preclinical imaging\". Anqi \"Amy\" Feng presenting \"Segmenting Thalamic Nuclei: T1 Maps Provide a Reliable and Efficient Solution\". Samuel W. Remedios also presented \"Unsupervised OCT image interpolation using deformable registration and generative models\". Savannah P. Hays had a poster presentation titled \"Improving MR image harmonization for clinical and research applications in multiple sclerosis\" at the 150th Annual Meeting of the American Neurological Association (ANA2025) in Baltimore, MD. IACL at ANA 2025 July Savannah Hays presenting \"An Unsupervised Approach for Artifact Severity Scoring in Multi-Contrast MR Images\" at Medical Imaging with Deep Learning (MIDL 2025), Salt Lake City, UT, July 9–11, 2025. IACL papers at Medical Imaging with Deep Learning (MIDL 2025), Salt Lake City, UT, July 9–11, 2025. Savannah P. Hays had a poster presentation of her work titled \"An Unsupervised Approach for Artifact Severity Scoring in Multi-Contrast MR Images\". Dr. Junyu Chen had a poster presentation of his work titled \"Pretraining Deformable Image Registration Networks with Random Images\". June The Whiting School of Engineering publishes Student Wins Best Poster Award at 2025 ACTRIMS Young Scientist Conference celebrating Savannah Hays' win! May J.L. Prince presenting \"Brightness-invariant tracking estimation in tagged MRI\" at the 29th Conference on Information Processing in Medical Imaging (IPMI 2025), Kos Island, Greece, May 25–30, 2025. IACL papers at the 29th Conference on Information Processing in Medical Imaging (IPMI 2025), Kos Island, Greece, May 25–30, 2025. Samuel W. Remedios presented \"Cycle-consistent zero-shot through-plane super-resolution for anisotropic head MRI\". Prof. J.L. Prince presented Zhangxing Bian's work \"Brightness-invariant tracking estimation in tagged MRI\". Congratulations to Samuel W. Remedios for winning the Best Poster award at the 29th Conference on Information Processing in Medical Imaging (IPMI 2025), Kos Island, Greece, May 25–30, 2025. Savannah Hays presented \"Rescuing Incomplete MR Data: Anatomy Imputation of Restricted Field of View Images Using Multi-Contrast MR Images\" at the 33rd Annual meeting of the International Society for Magnetic Resonance in Medicine (ISMRM 2025), Honolulu, Hawaiʻi, May 10–15, 2025. IACL abstracts at the 33rd Annual meeting of the International Society for Magnetic Resonance in Medicine (ISMRM 2025), Honolulu, Hawaiʻi, May 10–15, 2025. Savannah P. Hays had an oral presentation of her work titled \"Rescuing Incomplete MR Data: Anatomy Imputation of Restricted Field of View Images Using Multi-Contrast MR Images\". Dr. Jinwei Zhang remotely presented \"Accelerating Multi-parametric MRI Sequences Using Learned Acquisition and Reconstruction Optimization (LARO):A Retrospective Study\", Savannah P. Hays presenting her award winning poster \"The Importance of Super-Resolution and Harmonization in a Pragmatic Clinical MR Image Dataset\" at the ACTRIMS Young Scientist Conference 2025. Congratulations to Savannah P. Hays on winning a Best Poster Award at the ACTRIMS Young Scientist Conference 2025. IACL abstracts at the 2025 Consortium of Multiple Sclerosis Centers (CMSC) Annual Meeting, Pheonix, AZ, May 28–31, 2025. Savannah P. Hays had an oral presentation of her work titled \"The importance of super-resolution and harmonization in a pragmatic clinical MR image dataset\". April Our paper titled \"Average biomechanical responses of the human brain grouped by age and sex\" led by Prof. Ahmed Alshareef from Univ. of South Carolina has appeared in the Annals of Biomedical Engineering.  (doi) February Carlos Rivas' award for best poster titled \"Unique MS lesion identification from MRI\" at the Proceedings of SPIE Medical Imaging (SPIE-MI 2025), San Diego, CA, February 16–20, 2025. Congratulations to Carlos Rivas on winning a Best Poster Award at the Proceedings of SPIE Medical Imaging (SPIE-MI 2025), San Diego, CA, February 16–20, 2025. IACL papers at the Proceedings of SPIE Medical Imaging (SPIE-MI 2025), San Diego, CA, February 16–20, 2025. Carlos Rivas presented \"Unique MS lesion identification from MRI\". Shimeng Wang presented \"Longitudinal analysis of cerebellum volume changes in a multiple sclerosis cohort\". Dr. Jinwei Zhang presented \"Bi-directional MS lesion filling and synthesis using denoising diffusion implicit model-based lesion repainting\". Xiaojian Chen's paper titled \"Correlation ratio for unsupervised learning of multi-modal deformable registration\", was presented by Dr. Jinwei Zhang. Other accepted papers at SPIE-MI 2025 coming from collaborations with IACL. Dr. Lianrui Zuo from Vanderbilt University, presented \"Counterfactual brain amyloid pathology image synthesis\". IACL at SPIE-MI 2025 Carlos Rivas presenting his award winning poster titled \"Unique MS lesion identification from MRI\". Shimeng Wang presenting his poster \"Longitudinal analysis of cerebellum volume changes in a multiple sclerosis cohort\". Dr. Jinwei Zhang presenting his SPIE-MI Deep Dive titled \"Bi-directional MS lesion filling and synthesis using denoising diffusion implicit model-based lesion repainting\". Prof. J.L. Prince with current lab members and special guests (Dr. Muhan Shao and Dr. Lianrui Zuo). Prof. J.L. Prince with current lab members. January The latest version of our super-resolution software is now available with pip install eclare. The related publication is: S.W. Remedios, S. Han, L. Zuo, A. Carass, D.L. Pham, J.L. Prince, and B.E. Dewey, \"Self-Supervised Super-Resolution for Slice Gap MRI\", Simulation and Synthesis in Medical Imaging (SASHIMI 2023) in conjunction with the 26th International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI 2023), Vancouver, Canada, October 8–12, 2023. (doi) Our paper titled \"A survey on deep learning in medical image registration: New technologies, uncertainty, evaluation metrics, and beyond\" led by Dr. Junyu Chen has appeared in Medical Image Analysis.  (doi) 2024 November Dr. Yihao Liu of Vanderbilt University has co-authored a paper wi",
  "content_length": 11654,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:34"
}