{
  "name": "Jes Frellsen",
  "homepage": "https://frellsen.org",
  "status": "success",
  "content": "Jes Frellsen | Associate Professor About I have been an Associate Professor since 2016, and I am currently Associate Professor in Machine Learning and Signal Processing at the Technical University of Denmark (DTU). Before that, I was at the IT University of Copenhagen. Previously I have been a postdoc with Professor Zoubin Ghahramani in the Machine Learning group at the University of Cambridge. Before that, I was a graduate student and postdoc at the Bioinformatics Centre, University of Copenhagen, where I have worked with Professor Anders Krogh and Associate Professor Thomas Hamelryck. Research interests I work on statistical machine learning with particular interest in: Generative AI Deep Learning Deep Generative Models Bayesian Modelling and Inference Directional Statistics Markov chain Monte Carlo methods Missing data Application in Bioinformatics Research group Postgraduate members: Elizabeth Baker (Postdoc, principal supervisor) Federico Bergamin (Postdoc, principal supervisor) Gabriel Niels Damsholt (PhD Student, co-supervisor) Paul Jeha (PhD Student, principal supervisor) Jakob Larsen (PhD Student, co-supervisor) Noah Wulff Mottelson (PhD Student, co-supervisor) Raul Ortega (PhD Student, co-supervisor) Johanne Badsberg Overgaard (PhD Student, co-supervisor) Ignacio Peis (Postdoc, principal supervisor) Mikkel Niklas Rasmussen (PhD Student, principal supervisor) Hugo Senetaire (Postdoc, principal supervisor) Anshuk Uppal (PhD Student, principal supervisor) I am also frequently supervising several BSc and MSc thesis students. Contact Phone: +45 4525 3923 Building 321, room 221 Postal address: Technical University of Denmark Richard Petersens Plads Building 321, room 221 2800 Kgs. Lyngby Denmark Short biography Principal academic appointments Jul 2019 - Associate Professor Department of Applied Mathematics and Computer Science, Technical University of Denmark Aug 2016 - Jun 2019 Associate Professor Department of Computer Science, IT University of Copenhagen May 2013 - Jun 2016 Postdoctoral researcher with Zoubin Ghahramani Department of Engineering, University of Cambridge Dec 2011 - Apr 2013 Postdoctoral researcher with Anders Krogh Bioinformatics Centre, University of Copenhagen Mar 2011 - Aug 2011 Postdoctoral researcher with Thomas Hamelryck Bioinformatics Centre, University of Copenhagen Education 2011 PhD in Bioinformatics Bioinformatics Centre, University of Copenhagen. \"Probabilistic methods in macromolecular structure prediction\" Supervisor: Thomas Hamelryck, co: Jesper Ferkinghoff-Borg 2007 MSc in Bioinformatics, University of Copenhagen (I was awarded the highest possible grade for my master thesis) 2005 BSc in maths and CS, University of Copenhagen 2004-2005 EAP exchange student at the University of California, Santa Cruz (worked in Kevin Karplus's Lab group wither and spring) Publications Ochoa RO, Vegge T, Frellsen J (2025) MolMiner: Towards Controllable, 3D-Aware, Fragment-Based Molecular Design. EurIPS 2025 Workshop on SIMBIOCHEM. OpenReview. James B, Pollok S, Frellsen J, Rasmus Bjørk (2025) The magnetic scalar potential for a rectangular prism. Appearing in IEEE Transactions on Magnetics. arXiv: 2501.18604. Frellsen J, Kassem MM, Bengtsen T, Olsen L, Lindorff-Larsen K, Ferkinghoff-Borg J, Boomsma W (2025) Zero-shot protein stability prediction by inverse folding models: a free energy interpretation. Appearing at Advances in Neural Information Processing Systems 39 (NeurIPS 2025). arXiv: 2506.05596. Kruse J, Lindskow K, Andersen MR, Shimizu R, McAuley J, Mattei PA, Frellsen J (2025) Normative Alignment of Recommender Systems via Internal Label Shift. Proceedings of the Nineteenth ACM Conference on Recommender Systems (RecSys 2025). doi: 10.1145/3705328.3759309. Peis I, Koyuncu B, Valera I, Frellsen J (2025) Hyper-Transforming Latent Diffusion Models. Proceedings of the 42nd International Conference on Machine Learning (ICML 2025). OpenReview, arXiv: 2504.16580. Cornet FRJ, Bergamin F, Bhowmik A, Garcia-Lastra JM, Frellsen J, Schmidt MN (2025) Kinetic Langevin Diffusion for Crystalline Materials Generation. Proceedings of the 42nd International Conference on Machine Learning (ICML 2025). OpenReview, arXiv: 2507.03602. Kruse, J, Lindskow, K, Andersen MR, Frellsen J (2025) Why design choices matter in recommender systems. Nature Machine Intelligence, 7(6), 979-980. doi: 10.1038/s42256-025-01043-5 Cohen Y, Navarro AKW, Frellsen J, Turner RE, Riemer R, Pakman A (2025) Bayesian Circular Regression with von Mises Quasi-Processes. The 28th International Conference on Artificial Intelligence and Statistics. OpenReview, arXiv: 2406.13151. Lee CK, Jeha P, Frellsen J, Liò P, Albergo MS, Vargas F (2025) Debiasing Guidance for Discrete Diffusion with Sequential Monte Carlo. ICLR 2025 Workshop on Frontiers in Probabilistic Inference: Sampling Meets Learning. arXiv: 2502.06079. Cornet FRJ, Bergamin F, Bhowmik A, Garcia-Lastra JM, Frellsen J, Schmidt MN (2025) Kinetic Langevin Diffusion for Crystalline Materials Generation. ICLR 2025 Workshop on AI for Accelerated Materials Design. OpenReview. Zepf K, Wanna S, Miani M, Moore J, Frellsen J, Hauberg S, Warburg F, Feragen A (2024). Laplacian Segmentation Networks Improve Epistemic Uncertainty Quantification. Medical Image Computing and Computer Assisted Intervention (MICCAI 2024). doi: 10.1007/978-3-031-72111-3_33, arXiv: 2303.13123. Kruse J, Lindskow K, Kalloori S, Polignano M, Pomo C, Srivastava A, Uppal A, Andersen MR, Frellsen J (2024) RecSys Challenge 2024: Balancing Accuracy and Editorial Values in News Recommendations. Proceedings of the 18th ACM Conference on Recommender Systems. doi: 10.1145/3640457.3687164, arXiv: 2409.20483. Kruse J, Lindskow K, Kalloori S, Polignano M, Pomo C, Srivastava A, Uppal A, Andersen MR, Frellsen J (2024) EB-NeRD a large-scale dataset for news recommendation. Proceedings of the Recommender Systems Challenge 2024. doi: 10.1145/3687151.3687152, arXiv: 2410.03432. Khomiakov M, Andersen MR, Frellsen J (2024) GeoFormer: A Multi-Polygon Segmentation Transformer. The 35th British Machine Vision Conference, (BMVC 2024). Online version, arXiv: 2411.16616. Zepf K, Frellsen J, Feragen A (2024) Navigating Uncertainty in Medical Image Segmentation. IEEE International Symposium on Biomedical Imaging (ISBI 2024). doi: 10.1109/ISBI56570.2024.10635367, arXiv: 2407.16367. Jeha P, Grathwohl WS, Andersen MR, Ek CE, Frellsen J (2024) Variance reduction of diffusion model's gradients with Taylor approximation-based control variate. ICML 2024 Workshop on Structured Probabilistic Inference & Generative Modeling. OpenReview. Cohen Y, Navarro AKW, Frellsen J, Turner RE, Riemer R, Pakman (2024) von Mises Quasi-Processes for Bayesian Circular Regression. ICML 2024 Workshop on Structured Probabilistic Inference & Generative Modeling. OpenReview. Arts M, Frellsen J, Boomsma W (2024) Internal-Coordinate Density Modelling of Protein Structure: Covariance Matters. Transactions on Machine Learning Research (TMLR). OpenReview. Khomiakov M, Andersen MR, Frellsen J (2024) GAST: Geometry-Aware Structure Transformer. Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision (WACV) Workshops, pp. 776-784. Online version, doi: 10.1109/WACVW60836.2024.00089 Uppal A, Stensbo-Smidt K, Boomsma W, Frellsen J (2023) Implicit Variational Inference for High-Dimensional Posteriors. Advances in Neural Information Processing Systems 37 (NeurIPS 2023). Spotlight presentation. Online version, arXiv: 2310.06643 Senetaire HHJ, Garreau D, Frellsen J*, Mattei PA* (2023) Explainability as statistical inference. Proceedings of the 40th International Conference on Machine Learning (ICML 2023), PMLR 202:30584-30612. arXiv: 2212.03131. *Equal contribution. Khomiakov M, Andersen M, Frellsen J (2023) Polygonizer: An auto-regressive building delineator. Machine Learning for Remote Sensing Workshop at ICLR 2023. arXiv: 2304.04048. Ulmer D, Hardmeier C, Frellsen J (2023) Prior and Posterior Networks: A Survey on Evidential Deep Learning Methods For Uncertainty Estimation. Transactions on Machine Learning Research (TMLR). OpenReview. arXiv: 2110.03051. Khomiakov M, Mahou AV, Sánchez AR, Frellsen J*, Andersen MR* (2023) Learning to Generate 3D Representations of Building Roofs Using Single-View Aerial Imagery. IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP 2023). doi: 10.1109/ICASSP49357.2023.10095974, arXiv: 2303.11215. *Equal contribution. Zepf K, Petersen E, Frellsen J, Feragen A (2023) That Label's got Style: Handling Label Style Bias for Uncertain Image Segmentation. International Conference on Learning Representations (ICLR 2023). OpenReview. Bartels S, Stensbo-Smidt K, Moreno-Muñoz P, Boomsma W, Frellsen J, Hauberg S (2023) Adaptive Cholesky Gaussian Processes. Proceedings of The 26th International Conference on Artificial Intelligence and Statistics (AISTATS), PMLR 206:408-452. arXiv: 2202.10769. Bartels S, Boomsma W, Frellsen J, Garreau D (2023) Kernel-Matrix Determinant Estimates from stopped Cholesky Decomposition. Journal of Machine Learning Research, 24(71):1−57. arXiv: 2107.10587. Kruse J, Lindskow K, Andersen MR, Frellsen J (2023) Creating the next generation of news experience on ekstrabladet.dk with recommender systems. Proceedings of the 17th ACM Conference on Recommender Systems (RecSys '23), pp. 1067-1070. doi: 10.1145/3604915.3610248. Ulmer D, Frellsen J, Hardmeier C (2022) Exploring Predictive Uncertainty and Calibration in NLP: A Study on the Impact of Method & Data Scarcity. Findings of the Association for Computational Linguistics: EMNLP 2022, 2707–2735. ACL Anlanthology, arXiv: 2210.15452. Ulmer D, Hardmeier C, Frellsen J (2022) deep-significance: Easy and Meaningful Signifcance Testing in the Age of Neural Networks. ML Evaluation Standards Workshop at ICLR 2022. Online version, arXiv: 2204.06815. Ipsen NB, Mattei P-A, Frellsen J (2022) How to deal with missing data in supervised deep learning? International ",
  "content_length": 21785,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:38"
}