{
  "name": "Jesper Buus Nielsen",
  "homepage": "https://pure.au.dk/portal/en/persons/jesper-buus-nielsen(f428c4b3-80b3-403a-ada6-9ecb0fad97b2).html",
  "status": "success",
  "content": "Jesper Buus Nielsen - Aarhus University View Scopus Profile Jesper Buus Nielsen Professor, Department of Computer Science Phone+4520586210Emailjbncs.audk Åbogade 34, 5335, 2858200 Aarhus NDenmark 20002025 Research activity per year Personal profile KeywordsData securityCryptographic protocolsCryptologyPublic-key encryptionComputational number theoryGame theoryDistributed software systems Fingerprint Dive into the research topics where Jesper Buus Nielsen is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Secure Protocol Computer Science 100% Communication Complexity Computer Science 71% secure multiparty computation Computer Science 64% Proof Computer Science 57% Security Parameter Computer Science 53% Cryptographic Protocol Computer Science 51% Secret Sharing Computer Science 49% Reference String Computer Science 47% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2000 2009 2014 2015 2016 2017 2025 72 Article in proceedings 20 Conference article 11 Journal article 5 Net publication - Internet publication 18 More 5 Working paper 4 Book chapter 2 Anthology 2 Report 2 Preprint 1 Book 1 Paper 1 PhD thesis Research output per year Research output per year OCash: Fully Anonymous Payments Between Blockchain Light ClientsHansen, A. B., Nielsen, J. B. & Simkin, M., 2025, Public-Key Cryptography – PKC 2025 - 28th IACR International Conference on Practice and Theory of Public-Key Cryptography, Proceedings. Jager, T. & Pan, J. (eds.). Springer Science and Business Media Deutschland GmbH, p. 169-202 34 p. (Lecture Notes in Computer Science, Vol. 15678 LNCS).Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Blockchain 100% Light Client 100% Anonymous Payment 100% Full Node 60% Anonymity 50% Early Stopping for Any Number of CorruptionsLoss, J. & Nielsen, J. B., 2024, Advances in Cryptology – EUROCRYPT 2024: 43rd Annual International Conference on the Theory and Applications of Cryptographic Techniques, Proceedings. Joye, M. & Leander, G. (eds.). Springer, Vol. III. p. 457-488 32 p. (Lecture Notes in Computer Science, Vol. 14653).Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Fundamental Question 100% Distributed Computing 100% Broadcast Protocol 100% Public Key Infrastructure 100% Byzantine Broadcast 66% 2 Citations (Scopus) CRAFT: Composable Randomness Beacons and Output-Independent Abort MPC From TimeBaum, C., David, B., Dowsley, R., Kishore, R., Nielsen, J. B. & Oechsner, S., Feb 2023, Public-Key Cryptography – PKC 2023: 26th IACR International Conference on Practice and Theory of Public-Key Cryptography, Atlanta, GA, USA, May 7–10, 2023, Proceedings, Part I. Boldyreva, A. & Kolesnikov, V. (eds.). Springer Science and Business Media Deutschland GmbH, Vol. 1. p. 439-470 32 p. (Lecture Notes in Computer Science, Vol. 13940 ).Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Random Beacon 100% Composable 100% Universally Composable 100% Time-lock Puzzles 100% Verifiable Delay Function 100% 9 Citations (Scopus) On Valiant's Conjecture: Impossibility of Incrementally Verifiable Computation from Random OraclesHall-Andersen, M. N. & Nielsen, J. B., Apr 2023, Advances in Cryptology – EUROCRYPT 2023: 42nd Annual International Conference on the Theory and Applications of Cryptographic Techniques, Lyon, France, April 23–27, 2023, Proceedings, Part II. Hazay, C. & Stam, M. (eds.). Cham: Springer, p. 438-469 32 p. (Lecture Notes in Computer Science, Vol. 14005).Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Valiant 100% Random Oracle 100% Verifiable Computation 100% Proof 100% Hash Function 100% 3 Citations (Scopus) Practical Large-Scale Proof-Of-Stake Asynchronous Total-Order BroadcastAlpos, O., Cachin, C., Kamp, S. H. & Nielsen, J. B., Oct 2023, 5th Conference on Advances in Financial Technologies, AFT 2023. Bonneau, J. & Weinberg, S. M. (eds.). Dagstuhl Publishing, 22 p. 31. (Leibniz International Proceedings in Informatics, LIPIcs, Vol. 282).Research output: Contribution to book/anthology/report/proceeding › Article in proceedings › Research › peer-review Proof 100% Total Order Broadcast 100% Fully Homomorphic Encryption 40% Threshold Cryptography 20% Existing Protocol 20% View all 126 research outputs Activities Activities per year 2002 2009 2010 28 Participation in or organisation af a conference 4 Lecture and oral contribution 2 Member of research network 2 Visiting an external academic institution 2 More 1 Consultancy 1 Peer review of manuscripts Activities per year 29th International Cryptology Conference (Journal)Nielsen, J. B. (Editor)1 Jan 2010Activity: Publication peer-review and editorial work types › Peer review of manuscripts › Research ARES 2010 : Fifth International Conference on Availability, Reliability and SecurityNielsen, J. B. (Organizer)9 Oct 2009 → …Activity: Participating in or organising an event types › Participation in or organisation af a conference Tillid uden TrustNielsen, J. B. (Lecturer)7 Oct 2009Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution On the Number of Synchronous Rounds Sufficient for Authenticated Byzantine AgreementNielsen, J. B. (Lecturer)25 Sept 2009Activity: Presentations, memberships, employment, ownership and other activities › Lecture and oral contribution Distributed Computing : 23rd International Symposium on Distributed Computing. Elche/Elx, Spain, September 23-25, 2009Nielsen, J. B. (Participant)23 Sept 2009 → 25 Sept 2009Activity: Participating in or organising an event types › Participation in or organisation af a conference View all 38 activities",
  "content_length": 6271,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:40"
}