{
  "name": "Jesper Nederlof",
  "homepage": "http://www.staff.science.uu.nl/~neder003/index.html",
  "status": "success",
  "content": "Homepage of Jesper Nederlof About Jesper Nederlof Jesper Nederlof is an associate professor in the Algorithms and Complexity group at Utrecht University. He received his M.Sc. in Applied Computing Science from Utrecht University (the Netherlands) in 2008, and successfully defended his PhD thesis titled `Space and Time Efficient Structural Improvements of Dynamic Programming Algorithms’ in December 2011, which he obtained at the University of Bergen (Norway). He was fortunate enough to have Pinar Heggernes as PhD supervisor. In 2012-2014, he worked as a postdoctoral researcher at Utrecht University. From February 2014 to October 2014, he worked as a postdoctoral researcher at Maastricht University, and from November 2014 until January 2020 he worked as Assistant Professor at TU/e. Since then he works at Utrecht University. News: I have been awarded an ERC Consolidator grant!! The planned starting date of the grant is May 2025 (my ERC Starting grant ends in February 2025), so I'll have to opportunity to hire Postdocs and PhD students from then on. Program Committees: IPEC'14, IPEC'17, ISAAC'18, CIAC'19, SODA'20, STOC'21, CSR'21, ICALP'21,IPEC'21,APPROX'21,SOSA'21, IPEC'22, SODA'23, ICALP'23, STOC'24, STOC'25 Editorial Boards: ACM Transactions on Computation Theory Present PhD students (as co-promotor / daily supervisor): None! Past PhD students (as co-promotor / daily supervisor): Greg Koumoutsos, Marek Eliáš, Shashwat Garg, Céline Swennenhuis, Isja Mannens, Krisztina Szilágyi Present Postdocs: Tomohiro Koana Past Postdocs: Carla Groenland, Thekla Hamm, Ivan Bliznets Miscellaneous links the website of LNMB'19 course `Algorithms and Complexity': click here the website of course 2MMD30'16: click here (note: newer offerings are moved to Canvas) my MSc. thesis: click here my PhD. thesis: click here lecture notes on OPP algo’s: click here a short note about a cool (relatively unknown) algorithm for bipartite matching: click here the full version of the ESA’16 paper “Exponential Time Paradigms Through the Polynomial Time Lens” with Drucker and Santhanam: click here",
  "content_length": 2093,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:48"
}