{
  "name": "Jesper Tegnér",
  "homepage": "https://www.kaust.edu.sa/en/study/faculty/jesper-tegner",
  "status": "success",
  "content": "Jesper Tegnér - Professor, Bioscience - King Abdullah University of Science and Technology Top Home Study Faculty Jesper Tegnér Professor, Bioscience Principal Investigator, AI Biomedicine Lab Biological and Environmental Science and Engineering Division jesper.tegner@kaust.edu.sa AI4BioMedicine By unraveling the logic of cells and brain circuits, we unlock the future of medicine and drive the next generation of AI Program Affiliations Bioscience Computer Science Bioengineering Statistics Biography Professor Jesper Tegner is an M.D./Ph.D. Doctor of Medicine and has a Ph.D. in Experimental and Computational Neuroscience from the Karolinska Institute, Sweden. He also holds three distinct undergraduate degrees: Mathematics (minor in Theoretical Physics), Medicine (Medical School), and Philosophy (minor in Psychology), and two years of postgraduate education in Pure and Applied Computational Mathematics. Following his M.D./Ph.D., he received a faculty position as Assistant Professor in Computer Science. While on leave, he was a visiting scientist as a five-year fellow at Wenner-Gren in New York, and an Alfred P Sloan Fellow in Boston, U.S. Upon his return, he was recruited as an Assistant Professor in Computer Science & Bioinformatics. Next, he became a chaired full Professor 4.5 years after his Ph.D., serving as the Head of the Division (Chaired Full Professor) for Computational Biology, Department of Physics (2002-2010). He was then recruited as a Director and received a lifetime named Strategic Chaired Professorship in Computational Medicine at the Center for Molecular Medicine (Karolinska Institute and Karolinska University Hospital, 2010-2021). He is the Founder of two Biotech startups and serves as an Executive Director at Immune Algorithmics. Professor Tegner has been at KAUST since 2016 and is affiliated with the Bioscience, Computer Science, Bioengineering, and Statistics programs. Research Interests Professor Tegner’s research and teaching interests range from developing bioinformatics to artificial intelligence technologies for life sciences and medical research. His research team targets fundamental genomics, such as the dynamical regulatory architecture of cells, with special reference to causality and foundational machine learning for AI and the understanding of the brain. His group’s translational work includes focus on cancer (melanoma, breast cancer) and neurodegenerative diseases (multiple sclerosis, Alzheimer's, frontal dementia). Professor Tegner has published 400 papers, has more than 20,000 citations, and an H-index > 65. agenticAI Multiple Sclerosis Foundation Models Algorithmic Complexity Network Science Education Profile Ph.D. Medicine/Medicine Doctor, Karolinska Institutet, 1997Advanced Ph.D. courses in pure and computational mathematics (corresponding 2 years full time), Royal Institute for Technology & Stockholm University, 1992-1996B.Sc. Medicine (Med Kand, Physician Program), Karolinska Institutet, 1990B.Sc. Philosophy, Stockholm University, 1990B.Sc. Mathematics, Stockholm University, 1988 Awards and Recognitions ERC Consolidator Grant, Co-Investigator “Outstanding” rating, Karolinska Institute evaluation Finalist, Göran Gustafsson Prize (Mathematics) SciLifeLab Faculty Fellow, European Society for Preventive Medicine Winner, DREAM System ID Challenge Winner, NeurIPS Single Cell Challenge (2 of 3 tasks) KAUST Convocation Faculty Speaker Finalist, KAUST Best Teaching Award Show more Publications Google Scholar Show more Research Areas Computational Bioscience Computer Science Machine Learning Multimedia - X - Causal Disentanglement is the Next Frontier in AI - Understanding the Intelligence of Decision Making - AI for Cells Helps Illuminate Their Identity - The Theory of Everything That Wasn’t - Faculty Spotlight",
  "content_length": 3808,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:42"
}