{
  "name": "Jesse Hoey",
  "homepage": "https://cs.uwaterloo.ca/~jhoey",
  "status": "success",
  "content": "Home Page for Jesse Hoey University of Waterloo School of Computer Science MenuhomeresearchpublicationsteachingbiographyQuick Links BayesACTSPUDDCOACHTHEMIS.COGCHILExternal LinksACTAGEWELLAAACIATSLPervasive HealthaispaceDylan HoeyCatherine Hoey Jesse Hoey I am a Professor in the David R. Cheriton School of Computer Science at the University of Waterloo and leader of the Computational Health Informatics Lab (CHIL). I am a Faculty Affiliate at the Vector Institute. I am Editor-in-Chief of the IEEE Transactions on Affective Computing. See my Google Scholar profile, my ACM Digital Library Profile Page or my ResearchGate Profile. Contact Email (research and teaching): Phone: +1.519.888.4567x37744 (retired) Fax: +1.519.885.1208 (retired) URL:http://www.cs.uwaterloo.ca/~jhoey/ Office: DC3613 Lab (CHIL): DC2584 Twitter: @drjessehoey Address: David R. Cheriton School of Computer Science University of Waterloo 200 University Avenue West Waterloo, Ontario N2L 3G1 CANADA Recent News server is down, check back again later Positions Available I am regularly seeking HUMAN graduate students. I cannot reply to all email requests. I will not reply to AI-generated emails telling me how \"critical\" my research is and other parrotted garbage. Write something yourself! Make speling mistakes! Show me its really you writing it! People (students and postdocs) server is down, check back again later Miscellaneous A free energy interpretation of Small Pig My proposal for a Waterloo Formula 1 circuit Brutalist Structures Jesse has seen Current Internet Time: @270.beats Current time on Baker Island (last time on earth): Sun Nov 30 17:29:31 2025 I have 654 Twitter followers and 11,151 citations on Google Scholar, which means my current Kardashian index (K-index) is 0.766: I'm not a Science Kardashian and I'm appropriately valued. Help me become a Science Kardashian!: Follow @drjessehoey Read my analysis of Bedevere's logic from the witch scene in Monty Python's Holy Grail. Read my analysis of Disney's \"Steamboat Willie\" using the Ortony-Clore-Collins model of emotions A simple python script to find out how many actual citations each of your papers has (with self-citations by any author removed). Use with care. Get it here. A really irritating (but harmless) javascript I wrote a long time ago: (requires a popup window). Going to Europe? Want some help planning your route? Try this tool. Who is the greatest hockey player of all time? Quotes \"Science is mere speculation, mere formulation of conjecture.\" Nassim Taleb, \"Fooled by Randomness\", p.128. (although this slightly misses the fact that the other part of science is finding evidence to disprove the speculation, so might be more precisely formulated as \"Science is the falsification of conjecture\"). However, science is certainly not \"truth\" as in the nefarious sound byte \"science is truth,\" which is probably the most untrue statement that can be made about science. \"Maximum remedium irae mora est.\" Latin proverb, translation: \"The greatest remedy for anger is delay.\" \"When you have to shoot, shoot! Don't talk.\" -- Eli Wallach as Tuco Ramírez in The Good, The Bad and the Ugly, 1966. \"In this [the Platonic] view, '2+2=4' is genuine knowledge, but such a statement as 'snow is white' is so full of ambiguity and uncertainty that it cannot find a place in the philosopher's corpus of truths\" -- Bertrand Russell, A History of Western Philosophy, 1945, p.149. \"You cannot tickle yourself even if you have swapped bodies with someone else\" -- Jakob Hohwy, The Predictive Mind, OUP, 2013, p.84. \"It's the human element and long may it live.\" -- Doc Emrick, May 13 2018 commentating a bad high sticking call on Oshie vs. Hedman. \"C'est parce que les agents ne savent jamais complètement ce qu'ils font que ce qu'ils font a plus de sens qu'ils ne le savent\" -- Pierre Bourdieu, Le Sens Pratique, Les Editions de Minuit, p116, 1980. (\"It is because agents never know completely what they are doing that what they do has more sense than they know\" The Logic of Practice, Polity Press, p69, 1990). \"Nay, it is chiefly from this regard to the sentiments of mankind, that we pursue riches and avoid poverty.\" -- Adam Smith, The Theory of Moral Sentiments, 1759. \"Let's get this Boeing going!\" -- Stewardess on Westjet flight 556 from Calgary, Oct 24, 2015 \"You must sleep some time between lunch and dinner, and no half-way measures. Take off your clothes and get into bed. That's what I always do. \" -- Winston Churchill, 1946. Jesse Hoey, School of Computer Science, University of Waterloo.",
  "content_length": 4554,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:42"
}