{
  "name": "Jessica A. Enright",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/jessicaenright",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Dr Jessica Enright Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffDr Jessica EnrightMr Ethan KellyZhen Tian Dr Jessica Enright Reader (Computing Science) email: Jessica.Enright@glasgow.ac.uk M121 Lilybank Gardens Import to contacts https://orcid.org/0000-0002-0266-3292 Biography I completed a PhD at the University of Alberta in 2011 with Prof. Lorna Stewart, and then moved to Scotland for a postdoc at the University of Glasgow, followed by posts at the University of Stirling, University of Edinburgh, and now at the University of Glasgow. Research interests I have interests in intersection graph classes, temporal and multi-layered graphs, and parameterised algorithmics. In more applied work, I have interests in modelling and optimisation for agricultural and infectious disease applications, including diseases of terrestrial and aquatic livestock. During the COVID-19 pandemic, I contributed to pandemic modelling in various ways, including: As part of the Scottish Covid Response Consortium At events organised by the Virtual Knowledge Exchange in Mathematical Sciences Research groupsFormal Analysis, Theory & Algorithms Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2011 | 2008 | 2007Number of items: 54.2025 Agdur, Vilhelm, Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Larios-Jones, Laura ORCID: https://orcid.org/0000-0003-3322-0176, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073, Skerman, Fiona and Yates, Ella (2025) Approximating temporal modularity on graphs of small underlying treewidth. In: International Symposium on Algorithmics of Wireless Networks (ALGOWIN 2025), Warsaw, Poland, 18-19 September 2025, (Accepted for Publication) Corsini, Timothée, Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Larios-Jones, Laura ORCID: https://orcid.org/0000-0003-3322-0176 and Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 (2025) Temporal Orienteering with Changing Fuel Costs. In: International Symposium on Algorithmics of Wireless Networks (ALGOWIN 2025), Warsaw, Poland, 18-19 September 2025, (Accepted for Publication) Davot, Tom, Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292 and Larios-Jones, Laura ORCID: https://orcid.org/0000-0003-3322-0176 (2025) Parameterised algorithms for temporally satisfying reconfiguration problems. In: International Symposium on Algorithmics of Wireless Networks (ALGOWIN 2025), Warsaw, Poland, 18-19 September 2025, (Accepted for Publication) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073, Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 and Sylvester, John ORCID: https://orcid.org/0000-0002-6543-2934 (2025) Tangled paths: a random graph model from mallows permutations. Electronic Journal of Combinatorics, 32(2), P2.35. (doi: 10.37236/11602) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 and Molter, Henrik (2025) Counting temporal paths. Algorithmica, 87(5), pp. 736-782. (doi: 10.1007/s00453-025-01301-3) (PMID:40352583) (PMCID:PMC12062201) Davot, Tom, Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Madathil, Jayakrishnan and Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 (2025) Temporal Triadic Closure: Finding Dense Substructures in Social Networks That Evolve Over Time. In: 39th AAAI Conference on Artificial Intelligence (AAAI-25), Philadelphia, PA, USA, 25 Feb - 04 Mar 2025, pp. 26939-26946. ISBN 9781577358978 (doi: 10.1609/aaai.v39i25.34899) Hunter, Ethan and Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292 (2025) The Firefighter Game with state-varying cost functions. In: Cherifi, Hocine, Donduran, Murat, Rocha, Luis M., Cherifi, Chantal and Varol, Onur (eds.) Complex Networks and Their Applications XIII. Series: Studies in computational intelligence, 4. Springer: Cham, pp. 76-86. ISBN 9783031824395 (doi: 10.1007/978-3-031-82439-5_7) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Larios-Jones, Laura, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 and Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 (2025) Reachability in Temporal Graphs under Perturbation. In: 50th International Conference on Current Trends in Theory and Practice of Computer Science (SOFSEM 2025), Bratislava, Slovakia, 20-23 Jan 2025, pp. 255-269. ISBN 978-3-031-82669-6 (doi: 10.1007/978-3-031-82670-2_19) 2024 Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Lee, Duncan ORCID: https://orcid.org/0000-0002-6175-6800, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073, Sylvester, John ORCID: https://orcid.org/0000-0002-6543-2934 and Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 (2024) The complexity of finding and enumerating optimal subgraphs to represent spatial correlation. Algorithmica, 86(10), pp. 3186-3230. (doi: 10.1007/s00453-024-01256-x) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Hand, Samuel D., Larios-Jones, Laura ORCID: https://orcid.org/0000-0003-3322-0176 and Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 (2024) Structural Parameters for Dense Temporal Graphs. In: 49th International Symposium on Mathematical Foundations of Computer Science, Bratislava, Slovakia, 26-30 Aug 2024, 52:1-52:15. ISBN 9783959773355 (doi: 10.4230/LIPIcs.MFCS.2024.52) 2023 Trombetta, Enrico ORCID: https://orcid.org/0000-0001-5162-1059, Jakubiak, Sara, Kutkova, Sara, Lipschutz, Debby, O’Hare, Anthony and Enright, Jessica A. ORCID: https://orcid.org/0000-0002-0266-3292 (2023) A modeling study of the impact of treatment policies on the evolution of resistance in sea lice on salmon farms. PLoS ONE, 18(11), e0294708. (doi: 10.1371/journal.pone.0294708) (PMID:38019751) (PMCID:PMC10686416) Hunter, Ethan T. P. ORCID: https://orcid.org/0000-0002-4309-6861, Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292 and Miller, Alice A. ORCID: https://orcid.org/0000-0002-0941-1717 (2023) Feasibility assessments of a dynamical approach to compartmental modelling on graphs: scaling limits and performance analysis. Theoretical Computer Science, 980, 114247. (doi: 10.1016/j.tcs.2023.114247) Fraser, S. D.S. et al. (2023) Multidisciplinary ecosystem to study lifecourse determinants and prevention of early-onset burdensome multimorbidity (MELD-B) – protocol for a research collaboration. Journal of Multimorbidity and Comorbidity, 13, (doi: 10.1177/26335565231204544) (PMID:37766757) (PMCID:PMC10521301) Catsis, S. et al. (2023) Process modelling of NHS cardiovascular waiting lists in response to the COVID-19 pandemic. BMJ Open, 13(7), e065622. (doi: 10.1136/bmjopen-2022-065622) (PMID:37474168) Sulaimon, Tijani A., Chaters, Gemma L., Nyasebwa, Obed M., Swai, Emanuel S., Cleaveland, Sarah ORCID: https://orcid.org/0000-0002-0456-0959, Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Kao, Rowland R. and Johnson, Paul C.D. ORCID: https://orcid.org/0000-0001-6663-7520 (2023) Modeling the effectiveness of targeting Rift Valley fever virus vaccination using imperfect network information. Frontiers in Veterinary Science, 10, 1049633. (doi: 10.3389/fvets.2023.1049633) (PMID:37456963) (PMCID:PMC10340087) Ekwem, Divine, Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Hopcraft, J. Grant C. ORCID: https://orcid.org/0000-0002-9617-9951, Buza, Joram, Shirima, Gabriel, Shand, Mike ORCID: https://orcid.org/0000-0002-0085-4896, Mwajombe, James K., Bett, Bernard, Reeve, Richard ORCID: https://orcid.org/0000-0003-2589-8091 and Lembo, Tiziana ORCID: https://orcid.org/0000-0002-6405-1849 (2023) Local and wide-scale livestock movement networks inform disease control strategies in East Africa. Scientific Reports, 13, 9666. (doi: 10.1038/s41598-023-35968-x) (PMID:37316521) (PMCID:PMC10267211) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073, Pettersson, William ORCID: https://orcid.org/0000-0003-0040-2088 and Sylvester, John (2023) Cops and robbers on multi-layer graphs. In: Graph-Theoretic Concepts in Computer Science:49th International Workshop, WG 2023, Fribourg, Switzerland, June 28–30, 2023, Revised Selected Papers. Series: Lecture notes in computer science (14093). Springer: Cham. ISBN 9783031433795 (Accepted for Publication) Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292, Meeks, Kitty ORCID: https://orcid.org/0000-0001-5299-3073 and Molter, Hendrik (2023) Counting Temporal Paths. In: 40th International Symposium on Theoretical Aspects of Computer Science (STACS 2023), Hamburg, Germany, 07-10 Mar 2023, p. 30. (doi: 10.4230/LIPIcs.STACS.2023.30) Colman, Ewan, Puspitarani, Gavrila A., Enright, Jessica ORCID: https://orcid.org/0000-0002-0266-3292 and Kao, Rowland R. (2023) Ascertainment rate of SARS-CoV-2 infections from healthcare and community testing in the UK. Journal of Theoretical Biology, 558, 111333. (doi: 10.1016/j.jtbi.2022.111333) (PMID:36347306) (PMCID:PMC9636607) Dangerfield, C. E. et al. (2023) Getting the most out of maths: How to coordinate mat",
  "content_length": 39990,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:45"
}