{
  "name": "Jesse Thomason",
  "homepage": "https://jessethomason.com",
  "status": "success",
  "content": "Jesse Thomason - GLAMOR Jesse Thomason I lead the GLAMOR Lab at USC. Our research enables agents and robots to better understand and respond to human language by considering the grounded context in which that language occurs by considering three threads: 1) We jointly learning models with language, world perception, and physical action to enable end-to-end agent behavior and improve continual learning; 2) We investigate ways to take advantage of the extra-textual visual world and embodied context in which language is uttered to improve reasoning in language-and-vision and language-guided robotics tasks; and 3) We work to improve speech and sign recognition by leveraging contextual and structural information, as well as to apply language technologies to accessibility and health applications. Assistant Professor @ University of Southern California jessetho🙃usc.edu Thomas Lord Department of Computer Science I am hiring one to two PhD students interested in computational approaches to sign languages or working with robot hardware for language-guided interaction; apply in Fall 2025! NewsInvited Talk  UT AustinForum for Artificial IntelligencewebsiteslidesSeptember 2025    Invited Talk  RSSLarge Foundation Model for Interactive Robot Learning: Large Pretrained Models Enable Symbolic Planning without Expert SpecificationwebsiteslidesJune 2025    Invited Talk  RSSWorkshop on Semantic Reasoning and Goal Understanding in Robotics: Embracing Language as Grounded CommunicationwebsiteslidesJune 2025    Invited Talk  UPennComputational Linguistics lunch: Embracing Language as Grounded CommunicationwebsiteslidesMay 2025 Show more...Invited Talk  CoRLWorkshop on Language and Robot Learning: Flip the Script: Bring Robotics to NLPwebsiteslidesNovember 2024    Invited Talk  Georgia TechSummit on Responsible Computing, AI, and Society: Use AI Grout without Losing AI GritwebsiteslidesOctober 2024    Invited Talk  RO-MANHRI4Wellbeing Workshop: Bringing LPTMs and Symbolic Reasoning Together for RobotswebsiteslidesAugust 2024    Featured Research  Scientific AmericanScientists Are Putting ChatGPT Brains Inside Robot Bodies. What Could Possibly Go Wrong?websiteMarch 2024 Show more...Invited Talk  University of Utah@ Utah Robotics Center Seminar: Language Guided RobotsslidesJanuary 2024    Invited Talk  NeurIPS6th Robot Learning Workshop: LPTMs Can Help Robots Without Ignoring RoboticswebsiteslidesDecember 2023    Invited Talk  CMULTI Colloquium: Using Large Models as Duct Tape, Not HammerswebsiteslidesvideoOctober 2023    Invited Talk  ICMLWorkshop on Interactive Learning with Implicit Human FeedbackwebsiteslidesJuly 2023 Show more...Organizer  CoRLWorkshop on Language and Robot Learning (LangRob)websiteDecember 2022    Dataset Release  AmazonTEACh: Task-driven Embodied Agents that ChatwebsiteOctober 2021    Organizer  IROSSemantic Policy and Action Representations for Autonomous Robots (SPAR) WorkshopwebsiteSeptember 2021    New Position  University of Southern CaliforniaAssistant Professor - Viterbi Department of Computer SciencewebsiteAugust 2021 Show more...Invited Talk  USC/ISI@ USC/ISI NL SeminarwebsiteslidesvideoFebruary 2021    Outreach  PhD Recruiting2020-2021 CS[-ish] PhD RecruitingwebsiteNovember 2020    Invited Talk  Stanford@ Stanford NLP SeminarwebsiteslidesOctober 2020    Organizer  ECCVEmbodied Vision, Actions & Language (EVAL) WorkshopwebsiteAugust 2020 Show more...New Position  AmazonVisiting Academic at Alexa AIAugust 2020    Invited Talk  ACL–NLP4ConvAI@ Second Workshop on NLP for Conversational AIwebsiteslidesJuly 2020    Organizer  ACLFirst Workshop on Advances in Language and Vision Research (ALVR)websiteJuly 2020    Invited Talk  NeurIPS–ViGIL@ Visually Grounded Interaction and Language (ViGIL) WorkshopwebsiteslidesvideoDecember 2019 Show more...Invited Talk  University of Southern California@ USC AI Rising Stars SymposiumslidesDecember 2019    Invited Talk  University of Utah@ Utah Robotics Center SeminarslidesNovember 2019    Invited Talk  IROS–SPAR@ Semantic Policy and Action Representations for Autonomous Robots (SPAR) WorkshopwebsiteNovember 2019    Invited Talk  Microsoft ResearchVision-and-Dialog NavigationslidesvideoJuly 2019 Show more...Co-Chair  NAACLCombined Workshop on Spatial Language Understanding (SpLU) and Grounded Communication for Robotics (RoboNLP)websiteJune 2019    Organizer  SIGdialSpecial Session on Physically Situated DialoguewebsiteJuly 2018    Organizer  RSSWorkshop on Models and Representations for Natural Human-Robot CommunicationwebsiteJune 2018    New Position  UWPostdoc with Luke ZettlemoyerJune 2018 Show more...Dissertation Defense  UT AustinContinually Improving Grounded Natural Language Understanding through Human-Robot DialogApril 2018 Teaching CSCI 699: History of Language and Computingdetails ▶This course is designed for early career PhD students with an interest in understanding the bases and common assumptions in modern natural language processing research. We will study the history of thought and paradigms surrounding language and computing. We will read original texts as well as retrospectives and summary arguments from influential writers and researchers in recent history as well as those predating modern computation. Students will draw connections between historical perspectives and abstractions to modern day technological innovations and assumptions in natural language processing. Students will develop a rich understanding of the historical context of their own work in computing and language, and be better prepared to situate their research contributions in the long context of language processing. •Spring 2025 syllabus•Spring 2024 syllabusCSCI 444: Natural Language Processingdetails ▶Natural Language Processing (NLP) is an area of computing research and practice that aims to enable machines to reason over human text and speech. High profile technologies like ChatGPT brought NLP to the forefront of public discussion both inside and outside academia. But what underpins such technologies? This course will explore how natural language can serve as an interaction medium between users and machines with a focus on the history and development of language models (LMs). Students will become familiar with concepts and methods in NLP like distributional semantics, and see how those concepts feed into the architectural design of modern LMs trained using deep learning, and will get hands-on experience with building and evaluating small-scale LMs. The class will also explore details and variants of the real-world consequences of deploying large-scale LMs and NLP technologies more generally, such as the ethics and harms associated with them.•Fall 2024 syllabusCSCI 566: Deep Learning and its Applicationsdetails ▶Recently, deep learning has advanced many AI-related problems: image retrieval, video analysis, natural language processing, self-driving, medical applications, and more. Our goal is to guide students to get familiar with these recent cutting-edge deep learning (DL) advances in computer vision and natural language processing. Through this course, students will gain a basic understanding of DL algorithms, and how to set up and solve problems involving deep learning techniques. The course will include a couple of practical assignments and a final course project. For the final course project, students will be encouraged to pick their own topics, but can also select from a provided list of projects.•Spring 2023 websitesyllabusCSCI 499: Natural Language Processing for Interactive AIdetails ▶Natural Language Processing for Interactive AI is an upper division undergraduate course in which students explore how natural language can serve as an interaction medium between users and AI agents. We cover topics in natural language processing, computer vision, and machine learning, as well as the intersection of planning and search-oriented machine learning algorithms with such language understanding techniques and paradigms. The core modules of the course cover text classification, language modeling with LSTMs and word embeddings, attention mechanisms and Transformers, and multimodality and reinforcement learning. Deliverables include paper reviews, a paper presentation, three increasingly complex coding assignments, and a course project expected to be carried out throughout the semester.•Fall 2022 syllabusCSCI 699: Grounding Natural Languagedetails ▶Grounding Natural Language is a PhD seminar course introducing the broad space of both multimodal language processing, for example language and vision models, and language models for decision making, for example dialogue systems and language-guided robotics. The course explores the ways in which other sensory modalities, especially visual input and embodiment in 3-dimensional space, can influence and guide representation learning for language. Deliverables include hour-long paper presentations, in which students digest research papers and present them in the context of modern NLP, and a course project expected to be carried out throughout the semester.•Spring 2022 syllabus Papers and Preprintssearch by category:language and vision | language and robotics | physical robots | neurosymbolic | evaluation | dialogue | language and planning | benchmark | vln | language and action | interpretability | reinforcement learning | continual learning | sign language | AI trust | semantic parsing | speech recognition | cognitive health | community tools | langauge and roboticsShow All2026Learning to Deliberate: Meta-policy Collaboration for Agentic LLMs with Multi-agent Reinforcement LearningWei Yang and Jesse Thomason.Conference on Artificial Intelligence (AAAI), 2026.categories: reinforcement learning, neurosymbolicconference paperbib@inproceedings{yang:learning2deliberate,  title={Learning to Deliberate: Meta-policy Collaboration for Agentic {LLMs} with Multi-agent Reinforcement Learning},  author={Wei Yang and Jesse Thomason},  booktitle={Conference on ",
  "content_length": 68896,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:43"
}