{
  "name": "Jessica R. Cauchard",
  "homepage": "https://informatics.tuwien.ac.at/people/jessica-cauchard",
  "status": "success",
  "content": "Jessica Cauchard — TU Wien Informatics People Overview Professors Scientific Staff Administrative Staff Student Staff External Lecturers By Responsibilities By Committee By Name Related Guest Professors Honoraries Alumni (LinkedIn) #5qw Jessica Cauchard On Leave Univ.Prof.in / PhD Research Focus Visual Computing and Human-Centered Technology: 100% Research Areas Intelligent Systems, intelligent agents, Interaction Design, Mobile Robot, User interfaces, Human Machine Interface Design, Artificial intelligence, Computer Vision, Virtual Reality, Wearable Computing, GIS, ComputerScience, User Interface, AI, Semantics, Cognitive Science, Augmented Reality, Human-Computer Interaction, Haptics, Human-Machine Interaction, Multi modal User interfaces, Human-Robot Interaction, User Interface Design, Cognitive robotics and computer vision, Sensors and Actuators Roles Full Professor Artifact-based Computing and User Research, E193-04 Curriculum Commission for Informatics Substitute Member Contact jessica.cauchard@tuwien.ac.at +43-1-58801-193417 Favoritenstrasse 9, Room HA0202 vCard from TISS orcid.org/0000-0002-8916-8787 informatics.tuwien.ac.at/people/jessica-cauchard tiss.tuwien.ac.at/person/411044 Courses 2025W Bachelor Thesis for Informatics and Business Informatics / 187.A99 / PR Embodied Systems: A Human-Drone Interaction Perspective / 193.164 / PR Embodied Systems: A Human-Drone Interaction Perspective / 193.163 / VU Project in Computer Science 1 / 193.117 / PR Project in Computer Science 2 / 193.118 / PR Scientific Research and Writing / 193.052 / SE Seminar for PhD Students / 187.A72 / SE Seminar Media and Human-Centered Computing / 193.099 / SE 2026S Seminar for PhD Students / 187.A72 / SE Publications Integrate design thinking into drones / Cauchard, J. R., & Brock, A. (2025, May 28). Integrate design thinking into drones [Presentation]. Drones in society, Copenhagen, Denmark. http://hdl.handle.net/20.500.12708/219193 Towards Natural Human-Drone Interaction / Cauchard, J. R. (2025, May 28). Towards Natural Human-Drone Interaction [Presentation]. Drones in society, Copenhagen, Denmark. http://hdl.handle.net/20.500.12708/219191 “I Have a Package For Mr. and Mrs. Smith, Can You Point Me to Their House?”—Co-Designing Bystanders’ Interaction with Autonomous Delivery Vehicles / Krämer, S., Ginosar, E., Koelle, M., Müller, H., Boll, S., & Cauchard, J. R. (2025). “I Have a Package For Mr. and Mrs. Smith, Can You Point Me to Their House?”—Co-Designing Bystanders’ Interaction with Autonomous Delivery Vehicles. ACM Transactions on Human-Robot Interaction, 14(3), Article 53. https://doi.org/10.1145/3724131 Navigating Partial Automation in Firefighting with Drones: Trust, Take-Over, and Human-Drone Teaming / Boonyard, C., Jouffrais, C., Cauchard, J. R., & Brock, A. (2025, April 27). Navigating Partial Automation in Firefighting with Drones: Trust, Take-Over, and Human-Drone Teaming [Conference Presentation]. AutomationXP25: Hybrid Automation Experiences, Yokohama, Japan. http://hdl.handle.net/20.500.12708/216086 Firefighting with Drone Assistance: User Needs and Design Considerations for Thailand / Boonyard, C., Jouffrais, C., Cauchard, J. R., & Brock, A. M. (2025). Firefighting with Drone Assistance: User Needs and Design Considerations for Thailand. In CHI ’25: Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems (pp. 1–18). https://doi.org/10.1145/3706598.3714172 Mapping Emotions to Gestures: Affective Haptics in Human Drone Interaction / Fartook, O., Herdel, V., Oron-Gilad, T., & Cauchard, J. R. (2025). Mapping Emotions to Gestures: Affective Haptics in Human Drone Interaction. International Journal of Human-Computer Interaction, 1–16. https://doi.org/10.1080/10447318.2025.2537801 Exploring the Effects of Emotion Appropriateness on User Perception: A Delivery Drone Case Study / Herdel, V., Parmet, Y., & Cauchard, J. R. (2025). Exploring the Effects of Emotion Appropriateness on User Perception: A Delivery Drone Case Study. In 2025 20th ACM/IEEE International Conference on Human-Robot Interaction (HRI) (pp. 747–756). IEEE. https://doi.org/10.1109/HRI61500.2025.10974116 Crossing Cultures - Global Technology Perspectives / Cauchard, J. R. (2024, October 1). Crossing Cultures - Global Technology Perspectives [Conference Presentation]. ACM International Conference on Mobile Human-Computer Interaction (MobileHCI 2024), Melbourne, Australia. On and Out-of-Body Interactions & Experiences / Cauchard, J. R. (2024, September 19). On and Out-of-Body Interactions & Experiences [Presentation]. Seminar National University of Singapore 2024, National University of Singapore, Singapore. On-Body and Out-of-Body Interactions & Experiences / Cauchard, J. R. (2024, September). On-Body and Out-of-Body  Interactions & Experiences [Presentation]. Seminar University of New South Wales 2024, University of New South Wales (UNSW), Australia.",
  "content_length": 4918,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:46"
}