{
  "name": "Jesse Davis",
  "homepage": "https://people.cs.kuleuven.be/~jesse.davis",
  "status": "success",
  "content": "Jesse Davis Jesse Davis Professor Address: Dept. of Computer Science KU Leuven Celestijnenlaan 200A 3001 Heverlee Belgium Telephone: Fax: +32 16 32 79 96 Email: first name + dot + last name at cs dot kuleuven dot be Office: 1.06 About Me I joined K.U. Leuven in October 2010. I am a member of the Machine Learning group within the Declarative Languages and Artificial Intelligence Lab (DTAI). In general, my research interests span machine learning, data mining, big data, artificial intelligence, and sports analytics. I did a post-doc with Pedro Domingos at the University of Washington. I worked on Markov logic networks, which are publicly available as the Alchemy system. I was involved with the MURI project entitled A Unified Approach to Abductive Inference. I did my Ph.D at the University of Wisconsin-Madison under the supervision of David Page. Highlights Our research on soccer analytics was recently profiled by Leander Schaerlaeckens in The Guardian I was member of the AI working group for the International Olympic Committee that produced their AI Agenda I am involved with an initiative to develop a Common Data Format (CDF) for data arising from football (soccer) matches Our work on passing creativity was covered by ESPN.com Our MIT Sloan Sports Analytics Conference paper Leaving Goals on the Pitch was covered by fivethirtyeight I am the co-founder of the spinoff Runeasi that launched in December 2020 Our paper on valuing on-the-ball actions in soccer received the Best Paper Award in the ADS track at KDD 2019. This work has discussed numerous times in the news such as by The Economist and ESPN Education Ph.D in Computer Sciences from the University of Wisconsin-Madison. (August 2007) M.S. in Computer Sciences from the University of Wisconsin-Madison. (May 2005) B.A. in Computer Science from Williams College. (June 2002) Current Team Jose Manual Alvarez, post-doctoral researcher (Joint with Wouter Verbeke, Jente Van Belle) Sieglinde Bogaert (Promoter: Benedicte Vanwanseele) Lotte Bransen Lorenzo Cascoili Thomas Daniels Enrique Dehaerne Timo Martens Murat Kocack Loren Nuyts Pieter Robberechts Wei Sun Luca Stradiotti Maaike Van Roy, post-doctoral researcher Allen Wang Alumni Jessa Bekker, PhD in December 2018, Currently a research manager in DTAI Luca Bindini (visiting PhD student) Arne De Brabandere, PhD October 2022, Currently at KBC Tom Decroos, PhD October 2020, Currently at Meta Laurens Devos, PhD in October 2025, Currently a post-doc with Mathias Verbeke Thomas Dierckx, PhD in November 2022 (Promoter: Wim Schoutens) Sarah ElShal, PhD in October 2016 (Primary promoter: Yves Moreau) Kilian Hendrickx, PhD in Marcvh 2022, Current Position: Wahoo (Co-promoter: Konstantinos Gryllias, Bram Cornelis from Siemens Industry Software) Marc Mertens (joint with Bart Vanrumste) Hugo Neto-Rios (visiting masters student), Currently at Orlando City SC Tim Op De Beeck, PhD June 2019, Currently CTO of runeasi Lorenzo Perini, PhD March 2024, Currently at Meta Andrea Pugnana (visiting PhD student) Irma Ravkic, PhD in October 2016 Jonas Schouterden, PhD in June 2022, Currently at Google Zurich (Promoter: Hendrik Blockeel) Kurt Schutte, PhD in November 2017, Currently CEO of runeasi (Promoter: Benedicte Vanwanseele, co-promoter: Daniel Berckmans) Nima Taghipour, PhD in March 2013 (Promoter: Hendrik Blockeel) Pietro Totis, PhD in March 2023 (Other Promoters: Luc De Raedt and Angelika Kimmig) Jan Van Haaren, PhD in December 2016, Currently Data Scientist at Club Brugge Vincent Vercruyssen, PhD in December 2020 followed by a post-doc (Co-Promoter: Wannes Meert). Currently: Co-founder predikt.tech Dries Van der Plas, PhD in May 2025 (Co-promoter: Wannes Meert, Johan Verbraecken) Guillermo Vinue (post-doc) Martin Znidarsic, post-doctoral research from 2012-2013 (Joint with Jan Ramon) Kaja Zupanc (visiting PhD student) Software We maintain a number of sports-related software packages Many of our papers have open source implementations availabe on the ML group's github account. I've contributed to several packages for learning the structure of a Markov network: BLM and GSSL The source code for our TODTLER system for transfer learning is also publicly available. See our AAAI 2015 paper for more details. Mark Goadrich and I have written a java package for generating ROC and Precision Recall curves and computing AUC It can also calculate the area under the curve. For more information about ROC and PR curves, see our paper at ICML 2006. Selected Publications The best source for the papers are lirias, Google Scholar, or my (somewhat) update chronological list. Below is a representative subset of highlights. Journals Loren Nuyts, Lorenzo Perini, and Jesse Davis (2025). TSelect: selecting relevant and non-redundant channels for multivariate time series classification. Data Mining and Knowledge Discovery 39 (6), 1-62 Sigrid Olthof, and Jesse Davis (2025). Perspectives on data analytics for gaining a competitive advantage in football: computational approaches to tactics. Science and Medicine in Football, 1-13 Jesse Davis, Lotte Bransen, Laurens Devos, Arne Jaspers, Wannes Meert, Pieter Robberechts, Jan Van Haaren and Maaike Van Roy (2024). Methodology and evaluation in sports analytics: challenges, approaches, and lessons learned. Machine Learning 113 (9), 6977-7010 Maaike Van Roy, Pieter Robberechts, Wen-Chi Yang, Luc De Raedt, and Jesse Davis (2023). A Markov framework for learning and reasoning about strategies in professional soccer. Journal of Artificial Intelligence Research 77, 517-562 Dries Van der Plas, Johan Verbraecken, Marc Willemen, Wannes Meert, and. Jesse Davis (2021). Evaluation of Automated Hypnogram Analysis on Multi-Scored Polysomnographies. Frontiers in Digital Health. Kilian Hendrickx, Wannes Meert, Yves Mollet, Johan Gyselinck, Bram Cornelis, Konstantinos Gryllias and Jesse Davis (2020). A general anomaly detection framework for fleet-based condition monitoring of machines. Mechanical Systems and Signal Processing Tim Op De Beéck, Arne Jaspers, Michel S. Brink, Wouter G. P. Frencken, Filip Staes, Jesse Davis, and Werner Helsen (2019). Predicting future perceived wellness in professional soccer: the role of preceding load and wellness. International Journal of Sports Physiology and Performance. Arne Jaspers, Tim Op De Beéck, Michel S. Brink, Wouter G. P. Frencken, Filip Staes, Jesse Davis, and Werner Helsen (2018). Relationships between the external and internal training load in professional soccer: what can we learn from machine learning? International Journal of Sports Physiology and Performance. Arne De Brabandere, Tim Op De Beéck, Kurt H. Schötte, Wannes Meert, Benedicte Vanwanseele, and Jesse Davis (2018). Data fusion of body-worn accelerometers and heart rate to predict VO2max during submaximal running. Plos One. Daniel Lowd and Jesse Davis (2014). Improving Markov Network Structure Learning Using Decision Trees. Journal of Machine Learning Research. Nima Taghipour, Daan Fierens, Jesse Davis and Hendrik Blockeel (2013). Lifted Variable Elimination: Decoupling the Operators from the Constraint Language. Journal of Artificial Intelligence Research. PDF Elizabeth S. Burnside, Jesse Davis, Jagpreet Chhatwal, Oguzhan Alagoz, Mary J. Lindstrom, Berta M. Geller, Benjamin Littenberg, Katherine A. Shaffer, Charles E. Kahn, Jr, and C. David Page (2009). Probabilistic Computer Model Developed from Clinical Data in National Mammography Database Format to Classify Mammographic Findings. In Radiology. Conferences Thomas Daniels, Maarten Bosteels, Pieter Robberechts, Jesse Davis (2025). RegCheck: A Real-Time Approach for Flagging Potentially Malicious Domain Name Registrations. Proceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery and Data Mining Laurens Devos, Timo Martens, Deniz Can Oruc, Wannes Meert, H Blockeel, Jesse Davis (2025). Compressing tree ensembles through Level-wise Optimization and Pruning. Proceedings of the Forty-second International Conference on Machine Learning. Pawel Teisseyre, Timo Martens, Jessa Bekker, Jesse Davis (2025). Learning from biased positive-unlabeled data via threshold calibration. Proceedings of AISTATS 2025 Loren Nuyts and Jesse Davis (2025). The When and How of Target Variable Transformations. Proceedings of the International Symposium on Intelligent Data Analysis, 113-126 Lorenzo Cascioli, Laurens Devos, Ondrej Kuzelka, and Jesse Davis (2024). Faster repeated evasion attacks in tree ensembles. Advances in Neural Information Processing Systems 37, 24762-24794 Laurens Devos, Lorenzo Cascioli, Jesse Davis (2024). Robustness verification of multi-class tree ensembles. Proceedings of the AAAI Conference on Artificial Intelligence 38 (19) Chaahat Jain, Lorenzo Cascioli, Laurens Devos, Marcel Vinzent, Marcel Steinmetz, Jesse Davis, Joerg Hoffmann (2024). Safety verification of tree-ensemble policies via predicate abstraction. Proceedings of 27th European Conference on Artificial Intelligence. Luca Stradiotti, Lorenzo Perini, Jesse Davis (2024). Combining active learning and learning to reject for anomaly detection. Proceedings of the 27th European Conference on Artificial Intelligence. Luca Stradiotti, Lorenzo Perini, Jesse Davis (2024). Semi-supervised isolation forest for anomaly detection Proceedings of the 2024 SIAM International Conference on Data Mining. Lorenzo Perini, Jesse Davis (2023). Unsupervised anomaly detection with rejection. Advances in Neural Information Processing Systems 36, 69673-69691 Laurens Devos, Lorenzo Perini, Wannes Meert, Jesse Davis (2023). Detecting evasion attacks in deployed tree ensembles. Proceedings of ECML/PKDD 2023 Pieter Robberechts, Maaike Van Roy, Jesse Davis (2023). un-xPass: Measuring Soccer Player's Creativity. Proceedings of the 29th ACM SIGKDD conference on knowledge discovery and Knowledge Discovery and Data Mining. Kilian Hendrickx, Wannes Meert, Bram Cornelis, Jesse Davis (2022). Know your limits: Machine learning with rejection for vehic",
  "content_length": 22323,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:42"
}