{
  "name": "Jessica Hammer",
  "homepage": "https://www.hcii.cmu.edu/people/jessica-hammer",
  "status": "success",
  "content": "Jessica Hammer | Human-Computer Interaction Institute Skip to main content Search Expand Menu Close Menu Jessica Hammer Associate Professor Director, Center for Transformational Play Faculty Campus Address Rand Building, Suite 101 Links Website Google Scholar Research Areas AR / VR / XR Research through Design Games and Play Healthcare + HCI Learning Sciences and Educational Technologies Advisees Erica Cruz Noor Hammad Rotem Guttman Beatrice (Bea) Maggipinto Morgan Evans Administrative Staff Julia Chadwick Associate Professor Jessica Hammer is jointly appointed in the HCI Institute and the Entertainment Technology Center at Carnegie Mellon University. Her research focuses on transformational games, which are games that change how players think, feel, or behave. She is also an award-winning game designer. In the News Designing for \"Vibes\" Anyone who has ever worked to carefully craft a video, whether to commemorate a family event or immortalize an amusing moment with a pet, ... View Details HCII Highlights in Spring Issue of The Link The Spring 2025 issue of The Link magazine from the School of Computer Science at Carnegie Mellon University is now available. \"Optimizing... View Details CMU at CHI 2025 Our halls are abuzz with talk of “CHI” (pronounced “kai”), the nickname for the upcoming conference on computer human interaction (CHI). ... View Details Using Virtual Reality to Connect Players With Ocean Ecosystems Fewer people have been to the deepest parts of the ocean than have walked on the surface of the moon. Researchers at Carnegie Mellon Unive... View Details Related Projects Project Echo of the Abyss Echo of the Abyss is a Virtual Reality (VR) experience that uses animal guides and immersive environments to cultivate a sense of kinship towards marine l Echo of the Abyss is a Virtual Reality (VR) experience that uses animal guides and immersive environments to cultivate a sense of kinship towards marine life. It emphasises the impact of design elemen ... View Details Project Monsters of Appalachia Monsters of Appalachia is a game designed by the Center for Transformational Play at Carnegie Mellon University. It is a role-playing game designed to hel Monsters of Appalachia is a game designed by the Center for Transformational Play at Carnegie Mellon University. It is a role-playing game designed to help people learn how to build better local movem ... View Details Project Eye into AI Recent developments in explainable AI (XAI) aim to improve the transparency of black-box models. However, empir Recent developments in explainable AI (XAI) aim to improve the transparency of black-box models. However, empirically evaluating the interpretability of these XAI techniques is still an open challenge ... View Details Project Polyphonic The Polyphonic project explores collecting real-world data by piggybacking on game streaming communities such as Twitch, which capture over a trillion min The Polyphonic project explores collecting real-world data by piggybacking on game streaming communities such as Twitch, which capture over a trillion minutes of viewer attention a year. By embedding ... View Details Back to Top",
  "content_length": 3164,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:45"
}