{
  "name": "Jessica K. Hodgins",
  "homepage": "http://www.cs.cmu.edu/~jkh",
  "status": "success",
  "content": "Jessica Hodgins's Home Page Jessica K. Hodgins Professor, Computer Science and Robotics Carnegie Mellon University 5000 Forbes Avenue Pittsburgh PA 15213-3890 Voice: (412) 268-6795 Fax: (412) 268-6436 Office: Smith 231 jkh@cs.cmu.edu Jessica Hodgins is a Professor in the Robotics Institute and Computer Science Department at Carnegie Mellon University. From 2008-2016, she founded and ran research labs for Disney, rising to VP of Research and leading the labs in Pittsburgh and Los Angeles. From 2005-2015, she was Associate Director for Faculty in the Robotics Institute, running the promotion and tenure process and creating a mentoring program for pre-tenure faculty. Prior to moving to Carnegie Mellon in 2000, she was an Associate Professor and Assistant Dean in the College of Computing at Georgia Institute of Technology. She received her Ph.D. in Computer Science from Carnegie Mellon University in 1989. Her research focuses on computer graphics, animation, and robotics with an emphasis on generating and analyzing human motion. She has received a NSF Young Investigator Award, a Packard Fellowship, and a Sloan Fellowship. She was editor-in-chief of ACM Transactions on Graphics from 2000-2002 and ACM SIGGRAPH Papers Chair in 2003. She was an elected director at large on the ACM SIGGRAPH Executive Committee from 2012-2017 and in 2017 she was elected ACM SIGGRAPH President. In 2010, she was awarded the ACM SIGGRAPH Computer Graphics Achievement Award and in 2017 she was awarded the Steven Anson Coons Award for Outstanding Creative Contributions to Computer Graphics. Unofficial Bio Research Computer Animation Humanoid Robotics (coming soon) Human Robot Interaction Courses 15-465 and 60-404 Animation Art and Technology Spring 2009 15-894 Generating Natural Human Motion Spring 2008 15-465 and 60-404 Animation Art and Technology Spring 2008 15-465 and 60-404 Animation Art and Technology Spring 2007 15-462 Computer Graphics Spring 2007 15-894 Generating Natural Human Motion Spring 2006 15-465 and 60-404 Animation Art and Technology Spring 2006 15-505 and 60-404 Animation Art and Technology Spring 2005 15-493 Programming Video Games Spring 2005 CSD Immigration Course Fall 2003 15-869 Data-driven Character Animation 15-505 and 60-404 Animation Art and Technology Fall 2003 16-899E Legged Locomotion Spring 2003 15-505 and 60-404 Animation Art and Technology Spring 2003 15-462 Computer Graphics I Fall 2002 15-497/861 Computer Animation 15-462 Computer Graphics I Fall 2001 16-864 Humanoids Spring 2001 15-497/861 Computer Animation CS 4496/7496 Computer Animation (at Gatech)",
  "content_length": 2602,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:45"
}