{
  "name": "Jessica Lin 0001",
  "homepage": "http://cs.gmu.edu/~jessica",
  "status": "success",
  "content": "Dr. Jessica Lin Jessica Lin, Ph.D. (林 虹汎) Associate Professor Department of Computer Science George Mason University Office: Engineering Building, Room 4419 Tel: (703) 993-4693 Fax: (703) 993-1710 Email: jessica [AT] gmu [DOT] edu Office hours: My office hours vary each semester based on class schedule. Please check here for the most current information. CV Education 2005        Ph.D. in Computer Science, UC Riverside 2002 M.S in Computer Science, UC Riverside 1999 B.S in Computer Science, UC Riverside Research Research interests: My research has focused on the mining of large datasets. While most of my work has focused on mining time series data, I have also considered and am interested in mining images, texts and other types of multimedia data. I have published work on time series similarity search, clustering, motif discovery, symbolic representation, visualization, anomaly detection, and grammar induction. Publications Resources GrammarViz 3.0 SAX (Symbolic Aggregate approXimation) VizTree Danger of Dimensionality Reduction Former PhD Students Li Zhang (2023). Assistant Professor at University of Texas, Rio Grande Valley Rasaq Otunba (2022) Yifeng Gao (2021). Assistant Professor at University of Texas, Rio Grande Valley Xiaosheng Li (2020). Now at Ant Group Rohan Khade (2019). Now at Amazon Xing Wang (2017). Now at Airbnb Chun-Kit Ngan (2013). Now an Associate Teaching Professor at Worcester Polytechnic Institute. Co-Advised with Alexander Brodsky. Eiman Al-Shammari (2010). Now a faculty member at Kuwait University. Current PhD Students Wenjie Xi Prommy Sultana Hossain (co-advised with Dr. Emanuela Marasco) Allan Fong Thirumalai Vinjamoor Akhil Srinivas Majidur Rahman (co-advised with Dr. Ozlem Uzuner) Kaiyan Liu Teaching Current semester Fall 2025: CS484 (Data Mining), CS584 (Data Mining) Past semesters Fall 2020: CS450 (Database Concepts) Spring 2020: CS584 (Data Mining) Fall 2019: CS484 (Data Mining) Spring 2019: CS484 (Data Mining) Fall 2018: CS484 (Data Mining) Fall 2018: CS584 (Data Mining) Fall 2018: CS504 (Principles of Data Management and Mining) Spring 2018: CS450 (Database Concepts) Fall 2017: CS 550 (Database Systems) Spring 2017: CS 484 (Data Mining), CS 674 (Data Mining on Multimedia Data) Fall 2016: CS 550 (Database Systems) Spring 2016: CS 584 (Data Mining) Fall 2015:CS 450 (Database Concepts), CS 484 (Data Mining) Spring 2014: CS 504 (Principles of Data Management and Mining) Fall 2013: CS 780 (Data Mining on Multimedia Data), INFS 614 (Database Management) Spring 2013: CS 484 (Data Mining), INFS 614 (Database Management) Fall 2012: INFS 614 (Database Management) Spring 2012: CS 450 (Database Concepts), CS 750 (Data Mining) Fall 2011: CS 450 (Database Concepts) Spring 2011: CS 450 (Database Concepts), CS 795 (Special Topics on Data Mining) Fall 2010: CS 450 (Database Concepts), CS 780 (Data Mining on Multimedia Data) Fall 2009: INFS 614 (Database Management), CS 780 (Data Mining on Multimedia Data) Fall 2008: INFS 614 (Database Management), CS 780 (Data Mining on Multimedia Data) Spring 2008: CS 450 (Database Concepts) Fall 2007: INFS 795 (Special Topics on Data Mining: Temporal Data Mining), INFS 614 Spring 2007: INFS 795 (Special Topics on Data Mining: Data Mining on Multimedia and High-Dimensional Data) Fall 2006: INFS 590 (Program Design and Data Structures), INFS 795 (Special Topics on Data Mining: Temporal Data Mining) Spring 2006: INFS 590 (Program Design and Data Structures) Fall 2005: INFS 590 (Program Design and Data Structures) Professional Activities Editor-in-Chief, Big Data Research Journal, 2025-Present Journal Editorial Board Member/Associate Editor: ACM Transactions on Intelligent Systems and Technology (ACM TIST), 2023-Present Knowledge and Information Systems Journal (KAIS), 2019-Present Pattern Recognition Journal, 2016-Present Big Data Research Journal, 2016-2025 Conference Organizer: Application Track Program Chair, IEEE 10th International Conference on Data Science and Advanced Analytics (DSAA), 2024 Local Arrangement Chair, 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (2022) Workshop Organizer: General Chair, International Workshop on Data Mining for Geoinformatics (DMG) in Cooperation with SIGSPATIAL GIS 2010 General Chair, Special Session on Data Mining for Geoinformatics in Cooperation with the 17th International Conference on Geoinformatics, 2009 Program Chair, International Workshop on Spatial and Spatiotemporal Data Mining (SSTDM 08) in Cooperation with IEEE ICDM 2008 Program Chair, International Workshop on Spatial and Spatiotemporal Data Mining (SSTDM 09) in Cooperation with IEEE ICDM 2009 Area Chair/Meta-Reviewer/Senior Program Committee Member: PAKDD: 2025 AAAI: 2021, 2022, 2024 SDM: 2020, 2021, 2022, 2023, 2024, 2025 ECML/PKDD: 2024 ECAI: 2023 KDD: 2023 ICDM: 2020, 2022, 2025 Program Committee Member: SDM: 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019 ECML/PKDD: 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018 ICDM: 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019 KDD: 2006, 2007, 2011, 2012, 2015, 2016, 2018, 2019, 2020 CIKM: 2013, 2014 ICMLA 2010 KDD Workshop on Mining and learning from Time Series (MiLeTS): 2015, 2016, 2022 ICDE Workshop on Multivariate Time Series Analytics: 2024, 2025 The First Workshop on Spatial and Spatial-temporal Data Mining, in conjunction with ICDM 2006 (SSTDM 2006) Journal Reviewer: Knowledge and Information Systems (KAIS) IEEE Tran. on Knowledge and Data Engineering (TKDE, IEEE Computer Society) Data Mining and Knowledge Discovery (DAMI, Springer) ACM Computing Survey Journal of Intelligent Information Systems (JIIS, Springer) International Journal on Very Large Data Bases (VLDB Journal) The Visual Computer (Springer) Journal of Classification (Springer) Special Issue of Advances in Econometrics (AIE, Elsevier Science) Pattern Recognition Journal (Elsevier)",
  "content_length": 5954,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:50"
}