{
  "name": "Jesualdo Tomás Fernández-Breis",
  "homepage": "http://webs.um.es/jfernand/miwiki/doku.php",
  "status": "success",
  "content": "inicio [JESUALDO TOMAS FERNANDEZ BREIS] Main menu Main menu Home Research interests Research results Awards Other research activities Teaching Oferta de PFC/TFG/TFM (Spanish) Public schedule Biography I was born in Archena, Murcia on May 20, 1976. I received a Bs degree in Computer Science from the University of Murcia in 1997, and a Ms degree in Computer Engineering from the same university in 1999. I obtained a European PhD degree in Computer Engineering in 2003 from the University of Murcia, which was possible thanks to a PhD Scholarship from the Seneca Foundation. I am a Professor in the Department of Informatics and Systems, which I joined in 2003. I have served as Vicedean of the School of Computer Science at the University of Murcia (Spain) from 2006 to 2010. Some of my responsabilities were the International Exchange Programmes and the Industrial Placements of our students. I was part of the organizing committee of the XXV Anniversary of the computing studies at the University of Murcia. In 2010 I became Web Coordinator of the University of Murcia. I am currently the Head of the Department of Informatics and Computer Systems, Director of the Master in Bioinformatics of the University of Murcia, and member of the Internal Scientific Committee of the Regional BioHealth Research Institute/Instituto Murciano de Investigación Biosanitaria (IMIB). I am the co-founder of the spin-off LongSeq Applications. My current research activity is developed in the field of Semantic Web technologies with special focus on Biomedical Semantics. In the next links you can find more details about my research interests and research results. I am member of THe Regional BioHealth Research Institute/Instituto Murciano de Investigación Biosanitaria (IMIB), The International Association for Ontology and its Applications (IAOA), IEEE and International Society for Computational Biology (ISCB). Office: 2.26-Faculty of Computer Science Phone: +34 868884613 (ext 4613) Email: jfernand at um.es Fax: +34 868884151 Facultad de Informática. Campus de Espinardo, Universidad de Murcia, 30100, Murcia, Spain Check my public schedule My research profiles: My DBLP - my PubMed - My Citations - Google - My LinkedIn inicio.txt Última modificación: 2020/11/14 15:33por jfernand@um.es",
  "content_length": 2281,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:48"
}