{
  "name": "Ji-Yong Shin",
  "homepage": "https://www.jiyongshin.info",
  "status": "success",
  "content": "Ji-Yong ShinSearch this siteEmbedded FilesSkip to main contentSkip to navigationJi-Yong ShinAssistant ProfessorKhoury College of Computer SciencesNortheastern UniversityEmail: j.shin@northeastern.eduOffice: 342 West Village H, 440 Huntington Ave, Boston, MA 02115(Mailing address:  202 West Village H, 360 Huntington Ave, Boston, MA 02115)I am an Assistant Professor in the Khoury College of Computer Sciences at Northeastern University. I jointly run the systems research group with other faculty. I am interested in designing novel systems (operating systems, distributed systems, storage systems, etc.) and exploring formal verification methods that can be applied to system designs. Prior to joining Northeastern University, I was an Associate Research Scientist at Yale University and received my Ph.D. degree from Cornell University. [Recruiting Ph.D. students in 2025/26] I am looking for talented PhD students who are interested in systems and/or formal methods (see my research page). If you are interested in working with me, you may contact me via email (note that I may not be able to timely respond due to a huge volume of emails I get). Information about officially applying for the graduate program at Northeastern can be found here.  In the application, please indicate my name as the faculty of interest so that your application is properly routed to me.News[10/08/25] I will serve as a PC member for OSDI 2026.[10/03/25] ZStore,  an efficient and strongly consistent distributed KV store over NVMe-oF and zoned namespace interface, is accepted to SoCC 2025. [09/26/25] Moveri, a model-driven verification framework for weakly consistent distributed systems, is accepted to PLOS 2025.[05/16/25] I will serve as a PC member for OOPSLA 2026.[04/02/25] LiDO-DAG, safety and liveness verification of DAG-based blockchains, is accepted to PLDI 2025.[03/24/25] I will serve as a PC member for NSDI 2026.[03/24/25] ReCraft, a split/merge/member-change reconfiguration protocol for Raft, is accepted to DSN 2025. [01/02/25] I won the NSF CAREER Award. [12/09/24] I will serve as a PC member for USENIX ATC 2025. [12/09/24] I will serve as the Co-General Chair for HotStorage 2025. [09/19/24] I will serve as the Publications Chair for SoCC 2024.[08/21/24] I will teach CS7670 Seminar in Computer Systems (advanced topics in distributed systems) this fall.[04/01/24] LiDO is accepted to PLDI 2024.[02/26/24] AdoB is accepted to OOPSLA 2024.Older News[12/05/23] I will teach CS7610 Foundations of Distributed Systems in the spring. [12/05/23] FusionFlow is accepted to VLDB 2024. [07/31/23] I will serve as a PC member for EuroSys 2024.[01/20/23] I am teaching CS3650 Computer Systems this spring.[06/05/22] I will serve as a PC member for USENIX OSDI 2023 and ACM SoCC 2022. [05/21/22] I will teach CS7610 Foundations of Distributed Systems this fall. [04/04/22] ADORE (Atomic Distributed Objects with Certified Reconfiguration) will be presented at PLDI 2022. [12/06/21] I will teach CS 7680 Special Topics in Computer Systems in the coming spring (click for detailed information).  [11/02/21] I will serve as a PC member for USENIX OSDI 2022. [09/13/21] Paper on atomic distributed object (ADO) will be presented at OOPSLA 2021. [09/07/21] I will be teaching CS7610 Foundations of Distributed Systems this fall. [01/05/21] I will be teaching CS5600 Computer Systems this spring.[08/24/20] Joined Khoury College of Computer Sciences at Northeastern University. [06/25/20] I will be teaching CS6650 building scalable distributed systems this fall. [06/19/20] Received NSF FMitF grant with Zhong Shao and Robert Soule.[05/22/20] Work on atomic distributed objects will be presented at REMS-DeepSpec Workshop. Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3789,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:53"
}