{
  "name": "Jia-Bin Huang 0001",
  "homepage": "https://jbhuang0604.github.io",
  "status": "success",
  "content": "Jia-Bin Huang Jia-Bin Huang Capital One endowed Associate Professor Department of Computer Science University of Maryland, College Park My research interests lie at the intersection of computer vision, computer graphics, and machine learning. Research Group | Teaching | Talks | Publications | Open Office Hours Email: jbhuang@umd.edu More about me: CV | CV of Failures | Awesome Tips | YouTube | Twitter/X | BlueSky Current teaching Fall 2025: CMSC848K Multimodal Foundation Models Past teaching and evaluations Spring 2025: CMSC426 Computer Vision | Student evaluation Spring 2025: CMSC800 How to Conduct Great Research | Student evaluation Fall 2024: CMSC848K Multimodal Foundation Models | Student evaluation (MS) | Student evaluation (PhD) Prospective Ph.D. students starting in Fall 2026: If you are not at UMD: We will be recruiting highly motivated Ph.D. students to join our lab. Please apply through the CS department and include my name as a potential advisor in your application. If you are already a UMD student, please email me your CV, prior experiences, and how you would like to get involved. Questions? Check out my answers to the Ph.D. Advisor Guide. Prospective short-term students: If you are undergraduate/gradudate students at UMD or at external institute looking to work on research with us, please fill the form. We will contact you if there is a match. (Please submit the form again if you used the old version before. Sorry!) Prospective Undergraduate Students at UMD: Interested in engaging with computer vision research? Please fill out the form. My email inbox is flooded with various requests that I cannot handle. We will review the form and reach out via email if there is a match. Prospective Faculty at UMD: The CS department is hiring multiple faculty! Find out more here. Please feel free to reach out if you have any questions. Research Group PhD students Yao-Chih Lee Vinayak Gupta Yue Feng Yi-Ting Chen Ting-Hsuan Liao Hadi Alzayer Seungjae (Jay)Lee Kevin Zhang (with Furong Huang) (with Christopher Metzler) Quynh Phung Haowen Liu Grace Su Undergraduate students Alumni Former PhD Students Jinwoo Choi, PhD 2020, now an Assistant Professor at Kyung Hee Univeristy Badour AlBahar, PhD 2022, now an Assistant Professor at Kuwait University Chen Gao, PhD 2022, now a Research Scientist at Meta Yuliang Zou, PhD 2022, now a Research Scientist at Waymo Yiran Xu, PhD 2025, next a Research Scientist at Adobe Research Songwei Ge, PhD 2025, (with David Jacobs), now Research Scientist at Reve Former MS/BS Students At University of Maryland College Park Sanjali Yadav, next a PhD student at University of Maryland College Park. Vaibhav Sanjay, next a MSR student at Carnegie Mellon University Spencer Lutz Elizabeth Qiu At Virginia Tech Esther Robb (MS 2021), next a PhD student at Stanford University. Joseph Messou (MS 2020), next a PhD student at University of Maryland College Park. Shih-Yang Su (MS 2020), next a PhD student at University of British Columbia. Subhashree Radhakrishnan (MS 2018), next a Deep Learning Software Engineeer at NVIDIA. Po-Han Huang (MS 2018), next a Deep Learning Software Engineeer at NVIDIA. Sanket Lokegaonkar (MS 2018), next a Software Engineeer at Amazon AWS. Adithya Nallabolu (MS 2017), next a Computer Vision R&D Engineer at Qualcomm. At University of Illinois, Urbana-Champaign Le Wang (BS 2014), next MS at Stanford, next ASIC/RTL Designer at Google. Michael Qiu (BS 2014), next Senior Data Engineer at Capital One. Anarghya Mitra (BS 2014), next Software Engineer at Google. Zelun Luo (BS 2013), next a PhD student at Stanford University. JunYoung Gwak (BS 2013), next a PhD student at Stanford University. Danyang (Mike) Wang (BS 2012), next Analog Design Engineer at Analog Devices. Linjia Chang (BS 2012), next MS at UIUC, now technical marketing engineer at Intel. Sakshi Srivastava (BS 2012), next PhD student at UIUC. Kevin Han (BS 2012), next PhD at UC Berkeley, now Senior Engineer at Pinnacle Photonics. Former Interns Yu-Ying Yeh, PhD student at University of California San Diego. Yu-Lun Liu, PhD student at National Taiwan University, now at Assistant Professor at National Yang Ming Chiao Tung University. Ishit Mehta, PhD student at University of California San Diego. Chris Rockwell, PhD student at University of Michigan Ann Arbor. Benjamin Attal, PhD student at Carnegie Mellon University. Andreas Meuleman, PhD student at KAIST. Xiaoming Zhao, PhD student at UIUC. Badour AlBahar, PhD student at Virginia Tech. Geng Lin, PhD student at University of Maryland College Park. Chen Gao, PhD student at Virginia Tech, now Resarch Scientist at Meta. Wenqi Xian, PhD student at Cornell Tech. Xuan Luo, PhD student at University of Washington, now Resarch Scientist at Google. Former Visiting Students Ting-I Hsieh (Intern 2020) Yun-Chun Chen (Intern 2019), next PhD student at University of Toronto. Chieh Hubert Lin (Intern 2019), next PhD student at UC Merced. Meng-Li Shih (Intern 2018), next PhD student at University of Washington. Jin-Dong Dong (Intern 2018), next PhD student at Carnegie Mellon University. Wei-Yu Chen (Intern 2018), next PhD student at Carnegie Mellon University. Chen Gao (Intern 2018), next PhD student at Virginia Tech. Yen-Chen Lin (Intern 2017), next PhD student at MIT. Hao-Wei Yeh (Intern 2017), next PhD student at University of Tokyo. Publications CineVerse: Consistent Keyframe Synthesis for Cinematic Scene Composition Quynh Phung, Long Mai, Fabian David Caba Heilbron, Feng Liu, Jia-Bin Huang, and Cusuh Ham Proceedings of IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2026 [Paper (PDF)] [Project page] Bridging Diffusion Models and 3D Representations: A 3D Consistent Super-Resolution Framework Yi-Ting Chen, Liao, Pengsheng Guo, Alexander Schwing, Jia-Bin Huang Proceedings of IEEE/CVF International Conference on Computer Vision (ICCV), 2025 [Paper (PDF)] [Project page] [Code] Imagine, Verify, Execute: Memory-guided Agentic Exploration with Vision-Language Seungjae Lee, Daniel Ekpo, Haowen Liu, Furong Huang, Abhinav Shrivastava, Jia-Bin Huang Conference on Robot Learning (CoRL) 2025 [Paper (PDF)] [Project page] PAD3R: Pose-Aware Dynamic 3D Reconstruction from Casual Videos Ting-Hsuan Liao, Haowen Liu, Yiran Xu, Songwei Ge, Gengshan Yang, and Jia-Bin Huang ACM SIGGRAPH Asia 2025 [Paper (PDF)] [Project page] [Code] Generative Omnimatte: Learning to Decompose Video into Layers Yao-Chih Lee, Erika Lu, Sarah Rumbley, Michal Geyer, Jia-Bin Huang, Tali Dekel, and Forrester Cole Proceedings of IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Paper (PDF)] [Project page] Generative Multiview Relighting for 3D Reconstruction under Extreme Illumination Variation Hadi Alzayer, Philipp Henzler, Jonathan T. Barron, Jia-Bin Huang, Pratul P. Srinivasan, and Dor Verbin Proceedings of IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Paper (PDF)] [Project page] Textured Gaussians for Enhanced 3D Scene Appearance Modeling Brian Chao, Hung-Yu Tseng, Lorenzo Porzi, Chen Gao, Tuotuo Li, Qinbo Li, Ayush Saraf, Jia-Bin Huang, Johannes Kopf, Gordon Wetzstein, and Changil Kim Proceedings of IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Paper (PDF)] [Project page] [Code] IRIS: Inverse Rendering of Indoor Scenes from Low Dynamic Range Images Zhi-Hao Lin, Jia-Bin Huang, Zhengqin Li, Zhao Dong, Christian Richardt, Tuotuo Li, Michael Zollhöfer, Johannes Kopf, Shenlong Wang, and Changil Kim Proceedings of IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Paper (PDF)] [Project page] [Code] VideoGigaGAN: Towards Detail-rich Video Super-Resolution Yiran Xu, Taesung Park, Richard Zhang, Yang Zhou, Eli Shechtman, Feng Liu, Jia-Bin Huang, and Difan Liu Proceedings of IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Paper (PDF)] [Project page] Shape My Moves: Text-Driven Shape-Aware Synthesis of Human Motions Ting-Hsuan Liao, Yi Zhou, Yu Shen, Chun-Hao Paul Huang, Saayan Mitra, Jia-Bin Huang, Uttaran Bhattacharya Proceedings of IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Paper (PDF)] [Project page] [Code] Large Inverse Rendering Model for Reconstruction of Shape, Materials and Realistic Radiance Field Zhengqin Li, Dilin Wang, Ka chen, Zhaoyang Lv, Thu Nguyen-Phuoc, Milim Lee, Jia-Bin Huang, Lei Xiao, Yufeng Zhu, Carl S Marshall, Yuheng Ren, Richard Newcombe, and Zhao Dong Proceedings of IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Paper (PDF)] [Project page] MaDCoW: Marginal Distortion Correction for Wide-Angle Photography with Arbitrary Objects Kevin Zhang, Jia-Bin Huang, Jose Echevarria, Stephen DiVerdi, and Aaron Hertzmann Proceedings of IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 [Paper (PDF)] [Project page] Expressive Text-to-Image Generation with Rich Text Songwei Ge, Taesung Park, Jun-Yan Zhu, and Jia-Bin Huang International Journal of Computer Vision (IJCV), 2025 [Paper (PDF)] [Project page] [Code] [Demo] Coherent Zero-Shot Visual Instruction Generation Quynh Phung, Yu Fu, Songwei Ge, and Jia-Bin Huang arXiv preprint 2024 [Paper (PDF)] [Project page] Illusion3D: 3D Multiview Illusion with 2D Diffusion Priors Yue Feng, Vaibhav Sanjay, Spencer Lutz, Badour AlBahar, Songwei Ge, and Jia-Bin Huang arXiv preprint 2024 [Paper (PDF)] [Project page] Magic Fixup: Streamlining Photo Editing by Watching Dynamic Videos Hadi Alzayer, Zhihao Xia, Xuaner Zhang, Eli Shechtman, Jia-Bin Huang, and Michael Gharbi ACM Transcactions on Graphics (ToG), 2025 (Presented at SIGGRAPH Asia 2025) [Paper (PDF)] [Project page] [Code] UrbanIR: Large-Scale Urban Scene Inverse Rendering from a Single Video Zhi-Hao Lin, Bohan Liu, Yi-Ting Chen, Kuan-Sheng Chen, David Forsyth, Jia-Bin Huang, Anand Bhattad, and Shenlong Wang 3D Vision (3DV) 2025 [Paper (PDF)] [Project page] [Code] Rethinking Score Dis",
  "content_length": 47733,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:55"
}