{
  "name": "Jia Pan 0001",
  "homepage": "https://sites.google.com/site/panjia",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationJia PANAssociate ProfessorDepartment of Computer Science, the University of Hong KongOffice: Room 410, Chow Yei Ching Building, the University of Hong KongPhone: +852-2857 8441 Email: jpan [at] cs.hku.hkNews2021-5-21: We are organizing the HKU CS Distinguished Zoom Lecture in Robotics2020-8-25: Present as an invited speaker in IROS Workshop on managing deformation: a step towards higher robot autonomy2020-4-11: Present as an invited speaker in Computer Science Research Week 2020, National University of Singapore, Singapore2019-11-8: Present as an invited speaker in IROS Workshop on Learning Representations for Planning and Control, Macau2019-10-9: Present as an invited speaker in Intelligent Robotics Forum, China National Computer Congress (CNCC)2018-11-6: We are organizing the Workshop on Intelligent & Computational Robotic Devices for Human-Centric and Wearable Applications2018-9-1: Check out our collision avoidance framework CrowdMove.2017-5-29: We are organizing the Workshop on Recent Advances in Dynamics for Industrial Applications at ICRA 2017.2016-9-23: Check out our work about applying the technique in deep learning for multi-agent collision avoidance on real robots -- it is completely distributed: without the requirement of any AR tags or motion capture devices2016-9-23: Check out our work on parallel dynamics computation and deep learning for multi-agent collision avoidance.2016-5-10: We are organizing the workshop on recent advances in planning and manipulation for industrial robots at RSS 20162016-3-22: Check our technical report and video for the Amazon Picking Challenge 2015!2016-2-24: Undergraduate Tommy Hu got admitted by Stanford ME Department with the prestigious School of Engineering Fellowship!2016-2-23: Ernest Cheung got admitted by the CS Department at UNC Chapel Hill~2016-1-15: 3rd year undergraduate Chao Cao got one paper accepted by ICRA 2016 as the first author!About MeI received a B.S. in Control Theory and Engineering from Tsinghua University in 2005, where I started my robotics work. I went on to graduate from the M.S. program at the National Laboratory of Pattern Recognition (NLPR), Institute of Automation, Chinese Academy of Sciences in 2008, where my advisors were Qing Yang and Chunhong Pan. While at NLPR, I worked on Computer-Aided Design (CAD). After that, I graduated from the Ph.D. program at the Department of Computer Science at the University of North Carolina at Chapel Hill (UNC) in 2013, where my advisor was Dinesh Manocha. While at UNC, I worked in the Gamma Lab and completed internships at Willow Garage with Sachin Chitta and Ioan Sucan. In 2014, I completed a post-doc at UC Berkeley working with Pieter Abbeel. In October 2014 I started at the University of Hong Kong in the Computer Science Department, and then moved to the Department of Mechanical and Biomedical Engineering at the City University of Hong Kong as an assistant professor in 2015. After three years, I moved back to The University of Hong Kong and now is an associate professor in the Computer Science Department. Research interestsMy research focuses on creating algorithms that allow robots to efficiently and intelligently interact with the world and collaborate with people. These general-purpose sensing, control, planning, and manipulation algorithms can be applied to robots that work in homes, factories, laboratories, or fields. I am interested in various aspects of algorithm development and system design; including creating efficient algorithms, proving their theoretical properties, validating them on real-world problems, integrating them with sensing and task/system level reasoning, and distributing them to open-source communities. I draw ideas in search, optimization, control, artificial intelligence, and differential geometry to develop algorithms that enable autonomous decision making for one or more robots. I also seek to develop approaches which can generalize to many types of practical tasks and applications, including deformable object manipulation, soft robot control, and 3D printing.Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4193,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:54"
}