{
  "name": "Jia Rao",
  "homepage": "http://ranger.uta.edu/~jrao",
  "status": "success",
  "content": "Jia Rao Menu Home Publications Teaching CSE5306 Jia Rao Associate Professor in Computer Science Department of Computer Science and Engineering The University of Texas at Arlington 500 UTA Blvd. Arlington, TX 76019 Email: jia.rao at uta dot edu Phone: (817) 272-0770 Office: SEIR 223 Jia Rao is an Associate Professor of Computer Science at The University of Texas at Arlington and he was an Assistant Professor at University of Colorado at Colorado Springs from 2012 to 2016. He obtained B.S and M.S degrees in Computer Science from Wuhan University, Wuhan, China in 2004 and 2006, respectively, and a Ph.D. degree in Computer Engineering from Wayne State University, Detroit, Michigan in 2011. His research is in the broad area of Operating Systems, Distributed Systems, and Parallel Computing. I am looking for highly motivated students interested in my research. Please email me your CV if you are interested. Research Interests The goal of his research is to build computer systems that are adaptive to changing workloads, scalable for platform growth, and capable of providing Quality-of-Service guarantees and service differentiation. He is especially interested in improving the resource management and scheduling in Cloud systems with a focus on easier application management, better QoS, higher efficiency, more predictable performance, and more equitable service. His work combines performance analysis at application, OS, and hardware levels with machine learning techniques to characterize the complex behaviors of Cloud systems. He recently works on the following areas: Data Centers and Cloud Computing Fairness and Performance Isolation Differentiated Cloud Services Resource Metering Reinforcement Learning and Feedback Control Efficient CPU Scheduling on NUMA Multicore Systems Resource Management on Heterogeneous Clusters Selected Publications (complete list) Nomad: Non-exclusive Memory Tiering via Transactional Page Migration, accepted to OSDI’24 PVM: Efficient Shadow Paging for Deploying Secure Containers in Cloud-native Environments, SOSP’23. P2CACHE: Exploring Tiered Memory for In-Kernel File Systems Caching, USENIX ATC’23. Characterizing the Performance of Intel Optane Persistent Memory – A Close Look at its On-DIMM Buffering, EuroSys’22. SwitchFlow: Preemptive Multitasking for Deep Learning, Middleware’21, Best paper award (1 out of 107 submissions). Towards Exploiting CPU Elasticity via Efficient Thread Oversubscription, HPDC’21 Parallelizing Packet Processing in Container Overlay Networks, EuroSys’21 Preemptive Multi-Queue Fair Queuing, HPDC’19 Adaptive Resource Views for Containers, HPDC’19 A Side-channel Attack on HotSpot Heap Management, HotCloud’18 Characterizing and Optimizing Hotspot Parallel Garbage Collection on Multicore Systems, EuroSys’18 An Analysis and Empirical Study of Container Networks, INFOCOM’18 Dynamic Vertical Memory Scalability for OpenJDK Cloud Applications, ISMM’18 vNetTracer: Efficient and Programmable Packet Tracing in Virtualized Networks, ICDCS’18 eBrowser: Making Human-Mobile Web Interactions Energy Efficient with Event Rate Learning, ICDCS’18 Scheduler Activations for Interference-resilient SMP Virtual Machine Scheduling, Middleware’17 Preserving I/O Prioritization in Virtualized OSes, SoCC’17. Preemptive, Low Latency Datacenter Scheduling via Lightweight Virtualization, USENIX ATC’17. Characterizing and Optimizing the Performance of Multithreaded Programs Under Interference, PACT’16 Time Capsule: Tracing Packet Latency across Different Layers in Virtualized Systems, APSys’16, Best paper award (2 out of 52 submissions). vScale: Automatic and Efficient Processor Scaling for SMP Virtual Machines, EuroSys’16. StoreApp: A Shared Storage Appliance for Efficient and Scalable Virtualized Hadoop Clusters, Infocom’15. Improving MapReduce Performance in Heterogeneous Environments with Adaptive Task Tuning, Middleware’14. Moving Hadoop into the Cloud with Flexible Slots, SC’14. Towards Fair and Efficient SMP Virtual Machine Scheduling, PPoPP’14. iShuffle: Improving Hadoop Performance with Shuffle-on-Write, ICAC’13, Best paper award (1 out of 73 submissions). Interference and Locality-Aware Task Scheduling for MapReduce Applications in Virtual Clusters, HPDC’13, Best paper nominee (3 out of 131 submissions). Optimizing Virtual Machine Scheduling in NUMA Multicore Systems, HPCA’13, Best paper nominee (4 out of 249 submissions). VCONF: A Reinforcement Learning Approach to Virtual Machines Auto-configuration, ICAC’09. RL is a machine learning algorithm behind Google AlphaGo. Page generated 2024-03-21 21:01:25 CDT, by jemdoc.",
  "content_length": 4620,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:03"
}