{
  "name": "Jia Liu 0008",
  "homepage": "https://cs.nju.edu.cn/liujia",
  "status": "success",
  "content": "Homepage of Jia Liu Jia Liu 刘佳 Associate Professor 副教授, Nanjing University Home Publications Events Projects Teaching Service I'm currently an associate professor in Department of Computer Science and Technology at Nanjing University. Before that, I received my Ph.D. degree from Nanjing University in 2016 and my BSc degree from Xidian University in 2010. 中文简介：刘佳，副教授，博士生导师。2016 年于南京大学获博士学位。曾在美国佛罗里达大学、香港理工大学进行访问与合作交流。主要研究方向为智能感知、物联网、普适计算、移动机器人。近年来在NSDI, MOBICOM, MOBISYS, SIGMOD, ATC等重要国际会议与期刊上发表学术论文80+篇，其中包含CCF A 类论文40+ 篇。主持多项国家/省部级科研项目，包括基金委重点项目课题、面上项目、国家重点研发计划子课题、中国博士后特别资助项目。授权发明专利20+ 项、美国专利3项。曾获江苏省333 高层次人才培养对象（第三层次）、ACM SIGBED China 新星奖、江苏省计算机学会青年科技奖等荣誉。积极推进科研成果转化，研发移动物联网定位系统，在20多个省份与国际市场落地应用，系统入选2022世界智能制造十大科技进展、日内瓦国际发明展金奖。指导学生多人次获得江苏省卓博、江苏省双创博士、江苏省计算机学会优秀硕士论文、南京大学博士创新A计划、南京大学本科毕设一等奖等奖项，学生被华为、字节、腾讯、京东、摩根、小米、阿里、美团、网易、Geek+、微软、华泰等知名企业、以及南京大学、河海大学等高校聘用。 My research interest includes: Internet of Things, RFID, and Ubiquitous Computing. Hi Undergrads! Please do not hesitate to contact me and join us! 如果你积极上进、踏实认真、充满激情，欢迎加入！请附上简历邮件与我联系。 News 2025/11: Our one paper was accepted to IEEE TMC! 2025/09: Our one paper was accepted to IEEE TMC! 2025/07: Our one paper was accepted to USENIX NSDI'26! 2025/05: Our three papers were accepted to IEEE/ACM IWQoS'25! 2025/04: Our one paper was accepted to IEEE/ACM TNET! 2025/03: 祝贺潇宇、成瑄获批江苏省研究生科研与实践创新计划项目！ 2024/12: Our one paper was accepted to IEEE TMC! 2024/12: Our one paper was accepted to IEEE INFOCOM'25! 2024/11: 祝贺郭琪、傅成瑄等获得泛在智能感知创新技术大赛一等奖! 2024/04: We won Gold Medal in the 49th Geneva's Invention Expo! 2024/01: 祝贺余曦获江苏省计算机学会优秀硕士论文奖（全省10人）! 2023/12: Our one paper was accepted to IEEE INFOCOM'24! 2023/11: Our one paper was accepted to IEEE TPAMI'23! 2023/08: Our one paper was accepted to ACM MOBICOM'23! 2023/07: Our one paper was accepted to ACM SIGMOD'24! 2023/01: 祝贺牛钰茜获江苏省计算机学会优秀硕士论文奖（全省10人）! 2022/12: Our one paper was accepted to IEEE INFOCOM'23! 2022/11: 图客入选\"2022 世界智能制造十大科技进展\"! 2022/04: Our one paper was accepted to UAI'22! 2022/02: Our one paper was accepted to IEEE ICRA'22! 2021/12: 祝贺王严严、王霞博士获得江苏省双创博士称号! 2021/12: Our two papers were accepted to IEEE INFOCOM'22! 2021/11: Our one paper was accepted to IEEE/ACM TNET! 2021/06: 祝贺陈星宇获南大博士创新A计划（全校12人，80,000RMB奖励）! 2021/05: Our one paper was accepted to ACM MobiSys'21! 2021/03: Our one paper was accepted to IEEE TMC! 2020/08: Our one paper was accepted to IEEE ICNP'20! 2020/06: Our one paper was accepted to IEEE/ACM TNET! 2020/04: Our one paper was accepted to USENIX ATC'20! 2020/03: Our one paper was accepted to IEEE SECON'20! 2020/02: Our one paper was accepted to ACM TOSN! 2020/01: Our one paper was accepted to IEEE TMC! 2019/12: Our one paper was accepted to USENIX NSDI'20! Selected Publications [NSDI'26] Jia Liu, Yifei Ma, Xingyu Chen, et. al, Decoding RSSI Compression in RFID: Dynamic RCS Modeling and Tag-Intrinsic Power Metrics for Reliable Backscatter Networks, in Proc. of USENIX NSDI, 2026. (CCF-A). [MOBICOM'23] Xingyu Chen, Jia Liu, He Huang, Yu-E Sun, Xu Zhang, and Lijun Chen, \"Revisiting Cardinality Estimation in COTS RFID Systems\", in Proc. of ACM MOBICOM, 2023. (CCF-A). [NSDI'20] Xingyu Chen*, Jia Liu*, Xia Wang, Haisong Liu, Dong Jiang, and Lijun Chen, \"Eingerprint: Robust Energy-related Fingerprinting for Passive RFID Tags\", in Proc. of USENIX NSDI, 2020. (*These authors contributed equally to this work, CCF-A). [ATC'20] Jia Liu, Xingyu Chen, Shigang Chen, Wei Wang, Dong Jiang, Lijun Chen, Retwork: Exploring Reader Network with COTS RFID Systems, in Proc. of USENIX ATC, Boston, MA, USA, pages 889-896, July 2020. (Acceptance rate: 18.6%, CCF-A). [MobiSys'21] Xingyu Chen, Jia Liu, Fu Xiao, Shigang Chen, Lijun Chen, \" Thermotag: Item-level Temperature Sensing with a Passive RFID Tag\", in Proc. of ACM MobiSys, 2021. (CCF-B). [TNET'22] Jia Liu, Xi Yu, Xuan Liu, Xingyu Chen, Haisong Liu, Yanyan Wang, Lijun Chen, \"Time-efficient Range Detection in Commodity RFID Systems\", in IEEE/ACM Transactions on Networking, 2022. (CCF-A). [ICNP'20] Jia Liu, Xingyu Chen, Haisong Liu, Hualin Gong, Yanyan Wang, Lijun Chen, \"Time-efficient Range Detection in Commodity RFID Systems\", in Proc. of IEEE ICNP, 2020. (Acceptance rate:31/184=16.8%, CCF-B). [TNET'20] Jia Liu, Shigang Chen, Min Chen, Qingjun Xiao, and Lijun Chen, \"Pose Sensing With a Single RFID Tag\", in IEEE/ACM Transactions on Networking, 2020. (CCF-A). [INFOCOM'19] Jia Liu, Xingyu Chen, Xiulong Liu, Xiaocong Zhang, Xia Wang, and Lijun Chen, \"On Improving Write Throughput in Commodity RFID Systems\", in Proc. of IEEE INFOCOM, 2019. (Acceptance rate:19.7%, CCF-A). [INFOCOM'19] Jia Liu, Xingyu Chen, Shigang Chen, Xiulong Liu, Yanyan Wang, and Lijun Chen, \"TagSheet: Sleeping Posture Recognition with an Unobtrusive Passive Tag Matrix\", in Proc. of IEEE INFOCOM, 2019. (Acceptance rate:19.7%, CCF-A). [ICDCS'19] Jia Liu, Youlin Zhang, Shigang Chen, Min Chen, and Lijun Chen, \"Collision-resistant Communication Model for State-free Networked Tags\", in Proc. of IEEE ICDCS, 2019. (Acceptance rate:19.6%, CCF-B). [TNET'19] Jia Liu, Shigang Chen, Qingjun Xiao, Min Chen, Bin Xiao, Lijun Chen, \"Efficient Information Sampling in Multi-category RFID Systems\", in IEEE/ACM Transactions on Networking, 2019. (CCF-A). [TNET'19] Jia Liu, Bin Xiao, Xuan Liu, Kai Bu, Lijun Chen, Changhai Nie, \"Efficient Polling-based Information Collection in RFID Systems\", in IEEE/ACM Transactions on Networking, 2019. (CCF-A). [INFOCOM'17] Jia Liu, Feng Zhu, Yanyan Wang, Xia Wang, Qingfeng Pan, and Lijun Chen, \"RF-Scanner: Shelf Scanning with Robot-assisted RFID Systems\", in Proc. of IEEE INFOCOM, 2017. (CCF-A). [INFOCOM'17] Jia Liu, Min Chen, Shigang Chen, Qingfeng Pan, and Lijun Chen, \"Tag-Compass: Determining the Spatial Direction of an Object with Small Dimensions\", in Proc. of IEEE INFOCOM, 2017. (Acceptance rate:20.9%, CCF-A). [TNET'16] Jia Liu, Min Chen, Bin Xiao, Feng Zhu, Shigang Chen, and Lijun Chen. \"Efficient RFID Grouping Protocols\", in IEEE/ACM Transactions on Networking, Oct. 2016. (CCF-A). [INFOCOM'15] Jia Liu, Bin Xiao, Shigang Chen, Feng Zhu, and Lijun Chen. \"Fast RFID Grouping Protocols\", in Proc. of IEEE INFOCOM, 2015. (CCF-A). [INFOCOM'14] Jia Liu, Bin Xiao, Kai Bu, and Lijun Chen. \"Efficient Distributed Query Processing in Large RFID-enabled Supply Chains\", in Proc. of IEEE INFOCOM, 2014. (Acceptance ratio:19.4%, CCF-A). Awards 2024 第49届日内瓦国际发明展金奖 2023 华为\"难题揭榜\"火花奖 2022 世界智能制造十大科技进展 2022 ACM SiGBED China Rising Star Award (ACM SIGBED 中国新星奖) 2021 江苏省333 高层次人才培养对象（第三层次） 2021 江苏省计算机学会青年科技奖 2020 南京大学双创之星 2018 Special Gold Medal in the 46th Geneva's Invention Expo 2017 ACM Nanjing Rising Star Award 2017 Jiangsu Computer Society Outstanding Ph.D. Thesis Award Contact jialiu@nju.edu.cn jialiu.cs@gmail.com Rm 719, CS Bldg, 163 Xianlin Ave, Qixia Dist, Nanjing City, China, 210023 Visitor Map Last Updated: 2025",
  "content_length": 6847,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:53"
}