{
  "name": "Jia Jia 0001",
  "homepage": "http://hcsi.cs.tsinghua.edu.cn",
  "status": "success",
  "content": "Jia Jia's Homepage Major Awards more 2024 Supported by the National Science Fund for Distinguished Young Scholars, 2024 å½å®¶æ°åºéå¹´ç§å­¦åºéè·å¾è ï¼2024ï¼ 2024 Pioneer in Management and Education Award, Beijing Education System, 2024 åäº¬å¸æè²ç³»ç»âç®¡çè²äººå éâï¼2024ï¼ 2024 NeurIPS 2024 Spotlight Award, 2024 2023 Best Paper Award, China Multimedia Conference (ChinaMM), 2023 ä¸­å½å¤åªä½å¤§ä¼æä½³è®ºæå¥ï¼2024ï¼ 2022 Second Prize in National Teaching Achievement Award in Higher Education, 2022 é«ç­æè²å½å®¶çº§æå­¦ææäºç­å¥ï¼2022ï¼ 2022 First Prize of Teaching Award in Beijing Higher Education, 2022 åäº¬å¸é«ç­æè²æå­¦ææå¥ä¸ç­å¥ï¼2022ï¼ 2021 Award of Outstanding Scientific and Technological Achievement in the Chinese Association for Artificial Intelligence (CAAI), 2021 ä¸­å½äººå·¥æºè½å­¦ä¼CCAI 2021å¹´åº¦ä¼ç§ç§æææå¥ï¼2021ï¼ 2020 Supported by Young Changjiang Scholars Program of China, 2020 æè²é¨âé¿æ±å­¦è å¥å±è®¡åâéå¹´å­¦è ï¼2020ï¼ 2019 First Prize of Scientific and Technological Progress in the Chinese Institute of Electronics(CIE), 2019 ä¸­å½çµå­å­¦ä¼ç§æè¿æ­¥ä¸ç­å¥ï¼2019ï¼ 2018 ACM SIGMM Emerging Leaders, 2018 2018 ACM Multimedia Best Demo Award, 2018 2018 IJCAI Early Career Spotlight, 2018 About me more Jia JiaTenure Professor Department of Computer Science and Technology Tsinghua University Contact: Email: jjia@tsinghua.edu.cn Office: 3-522, FIT Building, Tsinghua University, Beijing, 100084, China PR. Biography: Dr. Jia Jia is a tenure professor in Department of Computer Science and Technology, Tsinghua University. She got bachelor degree at Tsinghua University in 2003, and received her Ph.D. degree from Tsinghua University in 2008. Research Interests Her main research interest is digital avatar synthesis, affective computing and human computer speech interaction. Selected Publications more Recent Conference Papers Shikun Sun, Chengrui Wang, Min Zhou, Zixuan Wang, Xiaoyu Qin, Tiezheng Ge, Bo Zheng, Jia Jia. DEPO: Enhancing E-commerce Image Background Generation with Short Trajectory Direct Expected Preference Optimization. In Proceedings of the 33rd ACM International Conference on Multimedia (MM' 25) [PDF] Sihan Zhao, Zixuan Wang, Tianyu Luan, Jia Jia, Wentao Zhu, Jiebo Luo, Junsong Yuan, Nan Xi. PP-Motion: Physical-Perceptual Fidelity Evaluation for Human Motion Generation. In Proceedings of the 33rd ACM International Conference on Multimedia (MM' 25) [PDF] Xingqi Wang, Xiaoyuan Yi, Xing Xie, and Jia Jia. Specify Privacy Yourself: Assessing Inference-Time Personalized Privacy Preservation Ability of Large Vision-Language Models. In Proceedings of the 33rd ACM International Conference on Multimedia (MM' 25) [Code] [PDF] Songtao Zhou, Xiaoyu Qin, Yixuan Zhou, Qixin Wang, Zeyu Jin, Zixuan Wang, Zhiyong Wu, Jia Jia. HarmoniVox: Painting Voices to Match the Avatar's Soul. In Proceedings of the 33rd ACM International Conference on Multimedia (MM'25) [Demo] [PDF] Houlun Chen, Xin Wang, Hong Chen, Wei Feng, Zihan Song, Jia Jia, Wenwu Zhu. Localizing Step-by-Step: Multimodal Long Video Temporal Grounding with LLM In Proceedings of IEEE International Conference on Multimedia & Expo 2025 (ICME'25) [PDF] Shikun Sun, Min Zhou, Zixuan Wang, Xubin Li, Tiezheng Ge, Zijie Ye, Xiaoyu Qin, Junliang Xing, Bo Zheng, Jia Jia Minimal Impact ControlNet: Advancing Multi-ControlNet Integration. The Thirteenth International Conference on Learning Representations, 2025 (ICLR'25) [Arxiv] [PDF] Zijie Ye, Jia-Wei Liu, Shikun Sun, Jia Jia, Mike Zheng Shou. Skinned Motion Retargeting with Dense Geometric Interaction Perception. Advances in Neural Information Processing Systems (NeurIPS'24 Spotlight) Houlun Chen, Xin Wang, Hong Chen, Zeyang Zhang, Wei Feng, Bin Huang, Jia Jia, Wenwu Zhu. VERIFIED: A Video Corpus Moment Retrieval Benchmark for Fine-Grained Video Understanding. In Proceedings of the 38th Annual Conference on Neural Information Processing Systems (NeurIPS'24) [Paper] Yixuan Zhou, Xiaoyu Qin, Zeyu Jin, Shuoyi Zhou, Shun Lei, Songtao Zhou, Zhiyong Wu, Jia Jia. VoxInstruct: Expressive Human Instruction-to-Speech Generation with Unified Multilingual Codec Language Modelling. In Proceedings of the 32nd ACM International Conference on Multimedia (MM'24, Oral) [Demo] Xingqi Wang, Xiaoyuan Yi, Xing Xie, Jia Jia. Embedding an Ethical Mind: Aligning Text-to-Image Synthesis via Lightweight Value Optimization. In Proceedings of the 32th ACM International Conference on Multimedia (MM' 24) [Code] Shuo Huang, Shikun Sun, Zixuan Wang, Xiaoyu Qin, Yanmin Xiong, Yuan Zhang, Pengfei Wan, Di Zhang, Jia Jia. PlacidDreamer: Advancing Harmony in Text-to-3D Generation. In Proceedings of the 32th ACM International Conference on Multimedia (MM'24) [Arxiv] [Code] Yixuan Zhou, Xiaoyu Qin, Zeyu Jin, Shuoyi Zhou, Shun Lei, Songtao Zhou, Zhiyong Wu, Jia Jia. VoxInstruct: Expressive Human Instruction-to-Speech Generation with Unified Multilingual Codec Language Modelling. In Proceedings of the 32th ACM International Conference on Multimedia (MM'24) [PDF] [Arxiv] [Page] Zeyu Jin, Jia Jia, Qixin Wang, Kehan Li, Shuoyi Zhou, Songtao Zhou, Xiaoyu Qin, Zhiyong Wu. SpeechCraft: A Fine-grained Expressive Speech Dataset with Natural Language Description. In Proceedings of the 32th ACM International Conference on Multimedia (MM'24) [PDF] [Arxiv] [Page] [Code] Zixuan Wang, Jiayi Li, Xiaoyu Qin, Shikun Sun, Songtao Zhou, Jia Jia, Jiebo Luo. DanceCamAnimator: Keyframe-Based Controllable 3D Dance Camera Synthesis. In Proceedings of the 32nd ACM International Conference on Multimedia (MM'24) [PDF] [Arxiv] [Page] [Code] Zixuan Wang, Jia Jia, Shikun Sun, Haozhe Wu, Rong Han, Zhenyu Li, Di Tang, Jiaqing Zhou, and Jiebo Luo. 2024. DanceCamera3D: 3D Camera Movement Synthesis with Music and Dance. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR'24) [PDF] [Arxiv] [Page] [Code] Shikun Sun, Longhui Wei, Zhicai Wang, Zixuan Wang, Junliang Xing, Jia Jia, Qi Tian. Inner classifier-free guidance and its taylor expansion for diffusion models. In Proceedings of the Twelfth International Conference on Learning Representations (ICLR'24) Zijie Ye, Jia Jia, Junliang Xing. Semantics2Hands: Transferring Hand Motion Semantics between Avatars. In Proceedings of the 31th ACM International Conference on Multimedia (MM'23 Best BNI Paper) [PDF] [Page] Zeyu Jin, Zixuan Wang, Qixin Wang, Ye Bai, Yi Zhao, Hao Li, Xiaorui Wang, and Jia Jia. HoloSinger: Semantics and Music Driven Motion Generation with Octahedral Holographic Projection. In Proceedings of the 31th ACM International Conference on Multimedia (MM'23) [PDF] Houlun Chen, Xin Wang, Xiaohan Lan, Hong Chen, Xuguang Duan, Jia Jia, Wenwu Zhu. Curriculum-Listener: Consistency- and Complementarity-Aware Audio-Enhanced Temporal Sentence Grounding. In Proceedings of the 31th ACM International Conference on Multimedia (MM'23) [PDF] Haoyu Wang, Haozhe Wu, Junliang Xing, Jia Jia. Versatile Face Animator: Driving Arbitrary 3D Facial Avatar in RGBD Space. In Proceedings of the 31th ACM International Conference on Multimedia (MM'23) [PDF] Shuo Huang, Zongxin Yang, Liangting Li, Yi Yang, Jia Jia. AvatarFusion: Zero-shot Generation of Clothing-Decoupled 3D Avatars Using 2D Diffusion. In Proceedings of the 31th ACM International Conference on Multimedia (MM'23) [PDF] Haozhe Wu, Songtao Zhou, Jia Jia, Junliang Xing, Qi Wen, Xiang Wen. Speech-Driven 3D Face Animation with Composite and Regional Facial Movements. In Proceedings of the 31th ACM International Conference on Multimedia (MM'23) [PDF] Xianhao Wei, Jia Jia, Xiang Li, Zhiyong Wu, Ziyi Wang. A Discourse-level Multi-scale Prosodic Model for Fine-Grained Emotion A nalysis. China Multimedia 2023 (China MM'23 Best Paper) [PDF] Shikun Sun, Longhui Wei, Junliang Xing, Jia Jia, Qi Tian. SDDM: Score-Decomposed Diffusion Models on Manifolds for Unpaired Image-to-Image Translation. In Proceedings of the 40th International Conference on Machine Learning (ICML'23) [PDF] Zijie Ye, Jia Jia, Haozhe Wu, Shuo Huang, Shikun Sun, Junliang Xing. Salient Co-Speech Gesture Synthesizing with Discrete Motion Representation. International Conference on Acoustics, Speech and Signal Processing (ICASSP'23) [PDF] Shikun Sun, Jia Jia, Haozhe Wu, Zijie Ye, Junliang Xing. MSNet: A Deep Architecture Using Multi-Sentiment Semantics for Sentiment-Aware Image Style Transfer. International Conference on Acoustics, Speech and Signal Processing (ICASSP'23) [PDF] Shuo Huang, Jia Jia, Zongxin Yang, Wei Wang, Haozhe Wu, Yi Yang, Junliang Xing. Shuffled Autoregression for Motion Interpolation. International Conference on Acoustics, Speech and Signal Processing (ICASSP'23) [PDF] Jinghe Cai, Xiaohan Li, Bohan Chen, Zhigang Wang, Jia Jia. CatHill: Emotion-Based Interactive Storytelling Game as a Digital Mental Health Intervention. ACM Conference on Human Factors in Computing Systems (CHI'23) [PDF] Zhihan Yang, Zhiyong Wu, Ying Shan, Jia Jia. What Does Your Face Sound Like? 3D Face Shape Towards Voice. In Proceedings of the 37th AAAI Conference on Artificial Intelligence (AAAI'23) [PDF] Zixuan Wang, Jia Jia, Haozhe Wu, Junliang Xing, Jinghe Cai, Fanbo Meng, Guowen Chen, Yanfeng Wang. GroupDancer: Music to Multi-People Dance Synthesis with Style Collaboration. In Proceedings of the 30th ACM International Conference on Multimedia (MM'22) [PDF] Jingbei Li, Yi Meng, Xixin Wu, Zhiyong Wu, Jia Jia, Helen Meng, Qiao Tian, Yuping Wang, Yuxuan Wang. Inferring Speaking Styles from Multi-modal Conversational Context by Multi-scale Relational Graph Convolutional Networks. In Proceedings of the 30th ACM International Conference on Multimedia (MM'22) [PDF] Jia Jia, Wei Chen, Kai Yu, Xiaodong He, Jun Du, Heung-Yeung Shum. The Practice of Speech and Language Processing in China. Communications of the ACM. [PDF] Haozhe Wu, Jia Jia, Haoyu Wang, Yishun Dou, Chao Duan, Qingshan Deng. Imitating Arbitrary T",
  "content_length": 20425,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:52"
}