{
  "name": "Jia Zou 0001",
  "homepage": "https://sites.google.com/view/jiazou-web/home",
  "status": "success",
  "content": "jiazou-webSearch this siteEmbedded FilesSkip to main contentSkip to navigationJia ZouAssistant ProfessorComputer Science and EngineeringSchool of Computing and Augmented IntelligenceArizona State University     jia.zou@asu.eduBioNews and ActivitiesAwardsPublicationsGranted PatentsTeachingProfessional ActivitiesDepartment ServicesRecent PresentationsBioJia Zou is a Tenure-Track Assistant Professor in the School of Computing and Augmented Intelligence,  Ira A. Fulton Schools of Engineering,  Arizona State University - Tempe,  starting in summer 2019. She is the director of the CACTUS data-intensive systems lab founded in the summer of 2020. Jia Zou is also affiliated with the Lawrence Berkeley National Lab since 2023.  Before 2019, she was a Research Scientist in the Department of Computer Science of Rice University.  Before that she worked in IBM Research - China as a researcher. She received her Ph.D in Computer Science from Tsinghua University, China. Jia Zou received a prestigious NSF CAREER award in 2022, an Amazon Research Award in 2023, and an IBM faculty award in 2021. Her research interests include database systems, AI/ML in database, applied AI/ML to database, and federated data management. She has more than 30 papers published in VLDB, SIGMOD, ICDE, VLDB journal, SoCC, ICDCS, ICDM, and so on, and has been granted 15 patents. Her work received VLDB 2019 best paper honorable mention award and SIGMOD 2020 research highlight award.More project information is here.[New!!!] We have 2 Ph.D openings starting for 2024 fall,  if you are interested in database systems research, please send your CV to jia.zou@asu.edu. [More Details] . News and ActivitiesOur paper \"INFERF: Declarative Factorization of AI/ML Inferences over Joins\", with my Postdoc Kanchan Chowdhury, my Ph.D students Lixi Zhou and Lulu Xie, and our collaborator Mason Fu from Amazon, was accepted to SIGMOD 2026.Our paper \"ProGQL: A Provenance Graph Query System for Cyber Attack Investigations\", collaborating with Fei Shao, Dr. Zhichao Cao, and Dr. Xusheng Xiao, has been accepted to ICDE 2026.  Thanks to all co-authors!Lixi Zhou, a Ph.D candidate at SCAI supervised by Jia Zou,  started Aug 2020,  has successfully defended his Ph.D thesis with full research papers published in VLDB, ICDE, and SIGMOD, and will join Google!Kanchan Chowdhury, a postdoctoral researcher at SCAI supervised by Jia Zou, will join Marquette University, ranking 86 nationally,  as a tenure-track assistant professor. He previously earned his Ph.D. from SCAI in 2024, co-supervised by Mohammed Sarwat and Jia Zou.One full research paper on privacy-aware AI model deduplication is officially accepted to SIGMOD 2025. Congratulations, Hong and all co-authors!!Our collaborative research project \"A Database Architecture for Enhanced Privacy in Machine-Learning Applications\" with Dr. Deepti Gupta from TAMU-CT, has been awarded by NSF! The total amount is $600,000, my portion is $249,998 (as ASU sole PI)We have received 9000 USD credits from OpenAI team to support our LLM-based data transformation research. Thanks, OpenAI!!Two papers on LLM-based data manipulation, collaborating with Mayo Clinic, have been accepted to Journal of the American Medical Informatics Association (JAMIA) and ICDE 2025 demo track. Thanks to our Mayo collaborators and congratulations to all co-authors.Our synthetic identity document dataset, IDNet, created using our unique AI-assisted, Few-shot, Quality-driven, and Explainable methodology, has been downloaded 10000+ times on Zenodo! Our IDNet paper has been accepted to IEEE Big Data 2024 (Industrial and Government Track) as a regular paper with high ratings! Congratulations to all co-authors!Jia will serve as the Co-chair of the Ph.D Workshop of EDBT 2026.Collaborating with Irbaz Riaz, Arsalan Naqvi, and Parminder Singh, Jia has won a prestigious 2024 Mayo Clinic and ASU Faculty Summer Residency Award. We will work on Scalable Infrastructure for Human-Artificial Intelligence Collaboration (HumAI) and Longitudinal Analysis on Electronic Health Records and Clinical Practice Guidelines.Our work \"DeepMapping: Learned Data Mapping for Lossless Compression and Efficient Lookup. \" collaborating with Dr. Selcuk Candan was accepted to ICDE 2024 as a full research paper!  Congratulations to Lixi!!! Our vision paper \"Serving Deep Learning Model in Relational Databases\" was accepted to EDBT 2024. Congratulations to our co-authors!Our paper \"Automatic Data Transformation Using Large Language Model: An Experimental Study on Building Energy Data.\" has been accepted to IEEE Big Data 2023 (Industrial and Government Track) as a full research paper. Congratulations to Ankita, Xuanmao, Hong, Jasper (Guoxin), and all other co-authors!!! A pre-print can be found here. So many thanks to the three anonymous reviewers who gave us one Strong Accept and two Accepts, which greatly encouraged our research along the line!Our paper \"A Comparison of End-to-End Decision Forest Inference Pipelines\" has been accepted to ACM SoCC 2023. Congratulations to Hong and all co-authors!!Jia will serve as a co-chair of New Researcher Symposium in SIGMOD 2024.Our paper \"Privacy-Preserving Redaction of Diagnosis Data through Source Code Analysis\" has been accepted to SSDBM 2023. Congratulations to Lixi, and co-authors Lei Yu and Hong Min!!Jia received an Amazon Research Award (70,000 USD and 50,000 USD Cloud Credit) for our works in DNN Inference Query Compilation!We received a summer fellowship (58,800 USD) from DOE and SHI to support the work of Jia and two students, Ankita Sharma and Hong Guan,  on scientific data management, in the Lawrence Berkeley National Lab this summer. We are super excited about it!!Our project  \"A Federated Query Optimizer for Privacy-Preserving Analytics and Machine Learning\" collaborating with Co-PIs Prof. Chaowei Xiao and Prof. Yingzhen Yang, gets funded by U.S. Department of Homeland Security (DHS) Center for Accelerating Operational Efficiency.  Congratulations to the team!!  (125,000 USD for the first six months, expect 874,998 USD in total)Lixi has won an NSF VLDB 2022 Travel Grant. Congratulations, Lixi!Our paper \"Benchmark of DNN Model Search at Deployment Time\" was accepted by SSDBM 2022 as a research paper. Congratulations to Lixi and all co-authors.Our paper \"Serving Deep Learning Models with Deduplication from Relational Databases\" was officially accepted by VLDB 2022 as a research paper. Congratulations to Lixi and all co-authors.Jia wins an NSF CAREER Award of 547, 584 USD. The project title is \"CAREER: Rethink and Redesign of Analytics Databases for Machine Learning Model Serving\" (Link). Thanks, NSF!Jia will serve as a New Researcher Symposium Co-Chair and a Program Committee Member of SIGMOD 2023Jia wins an ACM WSDM 2022 Outstanding Service AwardOne of Jia's patents has been assigned to DoorDash, Inc We've received an IBM Global University Program Academic Award of 40,000 USD. The project title is \"Low-Latency and Large-Scale Serving of Machine Learning Models in DB2\". Thanks IBM!!We have two research papers accepted to VLDB 2021. Congratulations to Amitabh, Pratik, and all co-authors !Jia will serve as a Local Arrangement Chair of WSDM 2022Lixi received a CIDSE doctoral fellowship. Congratulations, Lixi!An abstract \"Using Deep Learning Models to Replace Large Materialized Views in Relational Database\" has been accepted to CIDR 2021.Our paper \"Integration of Fast-Evolving Data Sources Using A Deep Learning Approach\" has been accepted to SFDI 2020 (in conjunction with VLDB 2020). Congratulations to Zijie and Lixi!Our paper \"Declarative Recursive Computation on an RDBMS, or, why you should use a database for distributed machine learning\" has been selected for 2020 ACM SIGMOD Research Highlight Award!Our paper \"WATSON: A Workflow-based Data Storage Optimizer for Analytics\" (with Ming Zhao,  Juwei Shi, Chen Wang) has been accepted to MSST 2020Jia  will serve as a Program Vice Chair in IEEE Big Data 2020Our paper \"Architecture of A Distributed Storage that Combines File System, Memory and Computation in A Single Layer\" (with Arun Iyengar and Chris Jermaine) has been accepted to VLDB journal.Our application for the Amazon AWS Cloud Credits for Research program was successful! We have been awarded $15,000 AWS credits for our automatic data placement project from Oct 2019.Our paper “Declarative Recursive Computation on an RDBMS” has been selected for Best Paper Honorable Mention Award at VLDB 2019.Google Cloud provides a research credit of 5,000 USD to support our work in automatic memory tuning of the TensorFlow system, starting from Aug 2019.AwardsMayo Clinic and ASU Faculty Summer Residency Award, 2024Amazon Research Award, 2023DOE SRP Fellowship, 2023NSF CAREER Award, 2022WSDM Outstanding Service Award, 2022IBM Academic Award, 2021 SIGMOD Research Highlight Award, 2020VLDB Best Paper Award Runner-up, 2019Publon Top Peer Reviewer Award, 2018IBM Patent Awards, 2011-2014Other awards gained as a student: Two Meritorious Awards in American Mathematical Contest in ModelingPublications(Supervised students are marked with *)2026[SIGMOD 2026]  Kanchan Chowdhury, Lixi Zhou, Lulu Xie, Xinwei Fu, Jia Zou. InferF: Declarative Factorization of AI/ML Inferences over Joins. SIGMOD 2026 (To Appear) [15 pages][ICDE 2026]  Fei Shao, Jia Zou, Zhichao Cao, Xusheng Xiao. ProGQL: A Provenance Graph Query System for Cyber Attack Investigations. ICDE 2026. (To Appear) [14 pages][SIGCSE (Poster)] Adwaith Chittavally Dugge Gowda, Jaykumar Tandel, Sharvari Rajiv Joshi, Jia Zou. Applications of Large Language Models to SQL Learning. SIGCSE 2026 (To Appear) [2 pages]2025[SIGMOD 2025] Hong Guan*, Lei Yu, Lixi Zhou*, Li Xiong, Kanchan Chowdhury*, Lulu Xie*, Xusheng Xiao, and Jia Zou. Privacy and Accuracy-Aware AI/ML Model Deduplication. International Conference on Management of Data 2025 (SIGMOD 2025) [14 pages][ICDE 2025 (Demo)]  Ankita Sharma*, Jaykumar Tandel*, Xuanmao Li*, Lanjun Wang, Anna Fariha,",
  "content_length": 26014,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:55"
}