{
  "name": "Jia Li 0004",
  "homepage": "https://lj2lijia.github.io",
  "status": "success",
  "content": "Jia Li's Homepage Jia Li (李佳) I am the Assistant Professor of College of AI at Tsinghua University. I obtained my PhD degree from Peking University in 2025, supervised by Prof. Zhi Jin and Prof. Ge Li. My research lies in the intersection of Artificial Intelligence (AI) and Software Engineering (SE). Specifically, my research interests include: AI for SE (aka. Intelligent Software Engineering): We develop AI techniques for improving the efficiency and quality of software development, such as code generation, test generation, and code repair. SE for AI: We explore SE techniques for improving the performance and reliability of AI systems. I am looking for highly-motivated interns to join my research group. Feel free to email me with your resume attached. 长期招收线上/线下科研实习生，可提供工位、定期一对一讨论，欢迎优秀本科生和研究生联系我，请附带上简历。 jia_li(at)mail.tsinghua.edu.cn Google Scholar GitHub Twitter ORCID News 2025 Our paper (DAVSP) has been accepted by AAAI 2026. Nov 08 Our paper (AdapTrack) has been accepted by ICSE 2026. Oct 16 Our paper (M2CVD) has been accepted by TOSEM 2025. Oct 09 Our paper (aiXcoder-7B-v2) has been accepted by ASE 2025. Sep 26 Congratulations! Four of our papers were accepted by NeurIPS 2025, including one Spotlight and three Poster papers! Sep 19 I joined the College of AI at Tsinghua University as an assistant professor! Aug 01 I passed the defense of my PhD thesis! May 22 Congratulation, our two papers are accepted by ACL 2025! May 16 Our paper Line-level Semantic Structure Learning for Code Vulnerability Detection has been accepted by Internetware 2025. Apr 16 Our paper Escalating LLM-based Code Translation Benchmarking into the Class-level Era has been accepted by ISSTA 2025. Feb 28 Selected Publications (view all ) SATURN: SAT-based Reinforcement Learning to Unleash Language Model Reasoning Huanyu Liu, Jia Li, Hao Zhu, Yihong Dong, Kechi Zhang, Ge Li The Thirty-ninth Annual Conference on Neural Information Processing Systems (NeurIPS 2025), Just Accepted, 2025 Spotlight (3.2%) [Paper] [Code] SATURN: SAT-based Reinforcement Learning to Unleash Language Model Reasoning Huanyu Liu, Jia Li, Hao Zhu, Yihong Dong, Kechi Zhang, Ge Li The Thirty-ninth Annual Conference on Neural Information Processing Systems (NeurIPS 2025), Just Accepted, 2025 Spotlight (3.2%) [Paper] [Code] aiXcoder-7B: A Lightweight and Effective Large Language Model for Code Processing Siyuan Jiang*, Jia Li*, He Zong, Huanyu Liu, Hao Zhu, Shukai Hu, Erlu Li, Jiazheng Ding, Yu Han, Wei Ning, Ge Li (* equal contribution) The 47th International Conference on Software Engineering (ICSE 2025 SEIP Track), Pages 215-226, 2025 Oral [Paper] [Code] aiXcoder-7B: A Lightweight and Effective Large Language Model for Code Processing Siyuan Jiang*, Jia Li*, He Zong, Huanyu Liu, Hao Zhu, Shukai Hu, Erlu Li, Jiazheng Ding, Yu Han, Wei Ning, Ge Li (* equal contribution) The 47th International Conference on Software Engineering (ICSE 2025 SEIP Track), Pages 215-226, 2025 Oral [Paper] [Code] EvoCodeBench: An Evolving Code Generation Benchmark with Domain-Specific Evaluations Jia Li, Ge Li, Xuanming Zhang, Yihong Dong, Zhi Jin, Binhua Li, Fei Huang, Yongbin Li The 38th Conference on Neural Information Processing Systems (NeurIPS 2024 D&B Track), 2024 [Paper] [Data] EvoCodeBench: An Evolving Code Generation Benchmark with Domain-Specific Evaluations Jia Li, Ge Li, Xuanming Zhang, Yihong Dong, Zhi Jin, Binhua Li, Fei Huang, Yongbin Li The 38th Conference on Neural Information Processing Systems (NeurIPS 2024 D&B Track), 2024 [Paper] [Data] Structured Chain-of-Thought Prompting for Code Generation Jia Li, Ge Li, Yongmin Li, Zhi Jin ACM Transactions on Software Engineering and Methodology (TOSEM), Volume 34, Issue 2, Pages 1-23, 21 January 2025 [Paper] Structured Chain-of-Thought Prompting for Code Generation Jia Li, Ge Li, Yongmin Li, Zhi Jin ACM Transactions on Software Engineering and Methodology (TOSEM), Volume 34, Issue 2, Pages 1-23, 21 January 2025 [Paper] All publications",
  "content_length": 3985,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:54"
}