{
  "name": "Jiafeng Zhou",
  "homepage": "https://liverpool.ac.uk/electrical-engineering-and-electronics/staff/jiafeng-zhou",
  "status": "success",
  "content": "Dr Jiafeng Zhou | Our people | University of Liverpool Skip to main content Close Search Find courses, people, research, information and more. Please ignore What types of page to search? All Courses Academic staff News Events Search Popular pages: Undergraduate Postgraduate PhD Accommodation Research International students Alternatively use our A-Z index. About Jiafeng Zhou received a BSc degree in Radio Physics from Nanjing University, Nanjing, China and a Ph.D. degree from the University of Birmingham, Birmingham, U.K. His doctoral research concerned high-temperature superconductor microwave filters. He was with the National Satellite Meteorological Centre of China, Beijing, China. After completing his PhD, he was with the University of Birmingham, where his research concerned phased arrays for reflector observing systems. Then he moved to the Department of Electronic and Electrical Engineering, University of Bristol, Bristol, U.K. His research in Bristol was mainly on the development of highly efficient and linear amplifiers. He is with the Department of Electrical Engineering and Electronics, University of Liverpool, Liverpool, UK since 2013. His past and current research interests include microwave power amplifiers, filters, electromagnetic compatibility, frequency selective surfaces, energy harvesting and wireless power transfer. Prizes or Honours Student Award, Design of Multiple Antiparallel Rectangular Coils for Range Stable Wireless Power Transfer (2019 Asian Wireless Power Transfer Workshop (AWPT), 2019) Best Student Paper, A Highly Efficient Rectifier with a Wide Dynamic Range Based on Variable Self-Bias Voltage (International Symposium on Antennas and Propagation 2020, 2021) Best Student Paper, A Wide Dynamic Range Rectifier Based on HEMT Device with a Variable Self-Bias Voltage (2020 Asian Wireless Power Transfer Workshop (AWPT), 2020) Shortlisted, Pattern Reconfigurable Metasurface Antenna with Three States (14th European Conference on Antennas and Propagation (EuCAP, Denmark), 2020) Best Student Paper, Electric Field Energy Harvesting on Electrical Cables and Its Applications in Voltage Measurement (2019 Asian Wireless Power Transfer Workshop ( AWPT), 2019) Best Student Paper, Cavity Backed Slot Antenna Fed by Novel Gap Waveguide (13th UK, Europe, China Conference on Millimetre Waves and Terahertz Technologies, 2020) Best Paper Award, Design of Reconfigurable Power Dividers with Wide Tuning Ranges (The Automated RF & Microwave Measurement Society (ARMMS) Conference, 2018) Best Student Paper First Prize, Range-adaptive wireless power transfer system using multi-antiparallel loops (IEEE Asian Pacific Conference on Antenna Propagation, Auckland, New Zealand,, 2018) Best Paper Award, Frequency Selective Surface with Miniaturized Elements: a Different Approach (The Automated RF & Microwave Measurement Society (ARMMS) Conference, 2018) Best Symposium Paper, Distributed Matching Network design for broadband power amplifiers (IEEE Electrical Design of Advanced Packaging and System Symposium, 2017) Best Interactive Paper, Dual-band Wearable Antenna for Simultaneous Wireless Communications and Energy Harvesting (Annual Active and Passive RF Devices Seminar (5th : 2017 : London, England), 2017)",
  "content_length": 3258,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:03"
}