{
  "name": "Jiaheng Lu",
  "homepage": "https://www.cs.helsinki.fi/u/jilu",
  "status": "success",
  "content": "Jiaheng Lu's homepage Jiaheng Lu's homepage Jiaheng Lu Professor Group leader of UDBMS Department of Computer Science University of Helsinki Email : jiahenglu.at.gmail.com Office : Exactum C211 [Suomi] [中文] Short biography Research goal: Improving the performance and usability of databases systems I am a computer scientist and a teacher, with a research interest in databases and data management. My recent topics include multi-model database management systems, quantum computing for databases and job optimization for big data platform. I was awarded Ph.D. degree in 2007 from the National University of Singapore. My PhD topic was about XML query processing. I did two years Postdoc research at the University of California, Irvine. Then I joined the Renmin University of China in 2008, where I have worked for seven years. I am now working at the University of Helsinki, Finland. I have the broad research and teaching experiences in four countries (China, Singapore, USA, and Finland). Books News I gave a keynote talk on \"An algebraic framework for multi-model data management\" in ISIC 2025 conference. [ Slides ] (23.10.2025) We gave a new tutorial about vector databases and vector embedding at Europe Database Conference ADBIS 2025. [ Slides ] (03.10.2025) My paper (single author) was published in Applied Category Theory conference 2025. This paper proposes the categorical algebra and calculus for multi-model databases. [ PDF ] [ Slides ] [ Presentation ] (17.06.2025) We are organizing a summer study group focusing on LLM, RAG, and Multi-modality. We welcome you to join us! [Details] (02.07.2024) We will organize the second workshop in VLDB 2024 on quantum computing [Workshop website] (12.04.2024) Media report about our research on Big Data and a short video (13.05.2023) We will organize a new workshop in VLDB 2023! The First International Workshop on Quantum Data Science and Management [Workshop website] (07.03.2023) We will give a new tutorial in SIGMOD 2023! Quantum Machine Learning: Foundation, New techniques, and Opportunities for Database Research [Details] (07.02.2023) It is my honor to be selected as 2022 Top-10 Distinguished Chinese Science Talents in Europe. [News (in Chinese)] (19.11.2022) Congratulations to Gongsheng Yuan who successfully passed the public defense and received PhD degree. (23.7.2022) We will give a new tutorial in ICDE 2022! \"Automatic Performance Tuning for Distributed Data Stream Processing Systems\" [Details] (19.3.2022). We will give a new tutorial in DASFAA 2022! \"Make Wise Decisions for Your DBMSs: Workload Forecasting and Performance Prediction Before Execution\" [Details] (12.2.2022). Congratulations to Yuxing Chen who successfully passed the public defense and received PhD degree. (20.1.2022) More news ... Research Topics Multi-model database management systems: As more businesses realized that data, in all forms and sizes, is critical to making the best possible decisions, we see the continued growth of systems that support massive volume of non-relational or unstructured forms of data. Our research focus is to develop new theories and algorithms of a novel multi-model database management system to manage both well-structured data and NoSQL data. Our approach will reduce integration issues, simplify operations, and eliminate migration issues between relational and NoSQL data. Selected papers: Jiaheng Lu, Irena Holubova : Multi-model Databases: A New Journey to Handle the Variety of Data, ACM Computing Surveys 2019 [PDF] Jiaheng Lu, Irena Holubova, Bogdan Cautis: Multi-model Databases and Tightly Integrated Polystores CIKM 2018 Tutorial[PDF] Jiaheng Lu: Towards Benchmarking Multi-Model Databases(Abstract) CIDR 2017[PDF] Jiaheng Lu, Irena Holubova: Multi-model Data Management: What's New and What's Next? EDBT 2017 Tutorial [PDF][slides] Chao Zhang, Jiaheng Lu, Pengfei Xu, Yuxing Chen: UniBench: A Benchmark for Multi-model Database Management Systems. TPCTC 2018: 7-23 [PDF] Codes and dataset release Multi-model data generation and benchmark: We developed a new benchmark called UniBench to give a comprehensive evaluation for multi-model databases. Download the data and scripts here. PhD students Valter Uotila (2021-) Shuxun Zhang (2020-) Zhengtong Yan (2020-) Gongsheng Yuan (2017-2022) Thesis title: Keyword Searches and Schema Transformation for Multi-Model Databases Yuxing Chen (2017-2021) Thesis title: Performance Tuning and Query Optimization for Big Data Management Pengfei Xu (2016-2021) Thesis title: Efficient Approximate String Matching with Synonyms and Taxonomies Chao Zhang (2015-2021) Thesis title: Performance Benchmarking and Query Optimization for Multi-Model Databases Yu Liu (RenminU niversity of China) (2014-2018) (Co-supervised with Prof. Zhewei Wei) Thesis title: Structural-Based Approximate Algorithms for Massive Graphs Juwei Shi (Renmin University of China) (2013-2018) Thesis title: Performance Evaluation, Models and Optimization for Big Data Analytics Platforms Zhaoan Dong (Renmin University of China) (2013-2018) (Co-supervised with Prof. Xiaofang Zhou and Prof. Ju Fan) Thesis title: Crowdsourcing-Based Knowledge Acquisition Tutorials \"Quantum Machine Learning: Foundation, New techniques, and Opportunities for Database Research\", Tobias Winker, Sven Groppe,Valter Uotila, Zhengtong Yan, Jiaheng Lu, Maja Franz, Wolfgang Mauerer: SIGMOD 2023 [Slides] \"Fusion of Relational and Graph Database Techniques: An Emerging Trend\", Yu Liu, Qingsong Guo, Jiaheng Lu: DASFAA 2023 [Slides] \"Automatic Performance Tuning for Distributed Data Stream Processing Systems\", \tHerodotos Herodotou, Lambros Odysseos, Yuxing Chen, Jiaheng Lu: ICDE 2022 \"Make Wise Decisions for Your DBMSs: Workload Forecasting and Performance Prediction Before Execution\", Zhengtong Yan, Jiaheng Lu, Qingsong Guo, Gongsheng Yuan, Calvin Sun, Steven Yuan: DASFAA 2022 \"Workload-Aware Performance Tuning for Autonomous DBMSs\", Zhengtong Yan, Jiaheng Lu, Naresh Chainani, Chunbin Lin: ICDE 2021 \"Multi-Model Data Query Languages and Processing Paradigms\", Qingsong Guo, Jiaheng Lu, Chao Zhang, Calvin Sun, Steven Yuan: CIKM 2020 [Slides] Academic service Associate Editor: Data and Knowledge Engineering (2022-) Workshop co-chair: Quantum Data Science and Management with VLDB 2023, 2024 ER 2018 Keyword search and data exploratory workshop 2016 with ICDE 2016 Keyword search on structured data (KEYS) workshop with SIGMOD 2012 XML-DM Workshop with WAIM 2010 Cloud-DB workshop with CIKM 2010 Proceeding chair: IEEE ICDE Conference 2013 Program Committee: ACM SIGMOD'2010, 2013, 2014, 2015, 2016, 2023 Very Large Database Conference Proceeding PVLDB 2010, 2015, 2017, 2020, 2021, 2025 IEEE ICDE Conference 2011, 2017, 2019, 2020, 2023 (Meta-reviwer) ER Conference 2018, 2019 Database Systems for Advanced Applications Conference DASFAA 2010, 2012, 2013, 2014, 2020, 2021,2023, 2024 (Meta-reviwer), 2025 (Meta-reviwer) Asia-Pacific Web Conference APWeb 2008, 2009, 2011, 2013, 2014, 2015 Web-age information management Conference WAIM 2014,2015,2016 WAIM-APWEB Conference 2017 Web System Engineering (WISE) Conference 2009 Chinese Conference on Information Retrieval (CCIR) 2015, 2016 Australia Database Conference ADC 2013, 2017, 2018, 2019",
  "content_length": 7243,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:00"
}