{
  "name": "Jiaheng Zhang",
  "homepage": "https://zjhzjh123.github.io",
  "status": "success",
  "content": "Jiaheng Zhang Jiaheng Zhang I am an assistant professor in School of Computing at National University of Singapore (NUS). I am also affiliated with NUS AI Institute and AIDF. I obtained the Ph.D. degree in Computer Science at UC Berkeley, where I was advised by Prof. Dawn Song. I also worked closely with Prof. Yupeng Zhang. And I was a member of RISE Lab, Initiative for Cryptocurrencies & Contracts Lab (IC3), The Berkeley Center for Responsible, Decentralized Intelligence (RDI) and Berkeley AI Research (BAIR). My research interests lie in LLM/AI security and privacy, applied cryptography, especially zero-knowledge proofs and applications on blockchain and machine learning models. My research of zkBridge focusing on cross-chain bridges in blockchain has been successfully commercialized by Polyhedra Network. Before coming to Berkeley, I received my Bachelor's degree in ACM Honors Class of Shanghai Jiao Tong University, where I worked under the supervision of Prof. Xiaotie Deng. During my undergraduate, I was also a research intern at Cornell, advised by Prof. Elaine Shi. I have interned at Meta, NTT Research, Qizhi Institute, and Alibaba. I was supported by the Facebook Fellowship during my PhD. I am listed at Forbes 30 Under 30 Asia and MIT Technology Review Innovators Under 35 Asia Pacific. I am looking for motivated students to join my group, including visiting PhDs, interns, postdocs, and CSC students. Please send an email to jiahengzhang.recruit AT gmail.com with your CV and transcript. Email / Google Scholar / Selected Publications (* indicates equal contribution) Reliable and Responsible Foundation Models Transactions on Machine Learning Research (TMLR), 2025 CNN-Verf, A Zero-Knowledge Proof System for Convolutional Neural Network inference with Optimal Complexity Wenjie Qu*, Yanpei Guo*, Yue Ying, Jiaheng Zhang Oakland (S&P), 2026 GuardReasoner-VL: Safeguarding VLMs via Reinforced Reasoning Yue Liu, Shengfang Zhai, Mingzhe Du, Yulin Chen, Tri Cao, Hongcheng Gao, Cheng Wang, Xinfeng Li, Kun Wang, Junfeng Fang, Jiaheng Zhang, Bryan Hooi NeurIPS, 2025 Mosformer: Maliciously Secure Three-Party Inference Framework for Large Transformers Ke Cheng, Yuheng Xia, Anxiao Song, Jiaxuan Fu, Wenjie Qu, Yulong Shen, Jiaheng Zhang CCS, 2025 NaviDet: Efficient Input-level Backdoor Detection on Text-to-Image Synthesis via Neuron Activation Variation Shengfang Zhai, Jiajun Li, Yue Liu, Huanran Chen, Zhihua Tian, Wenjie Qu, Qingni Shen, Ruoxi Jia, Yinpeng Dong, Jiaheng Zhang ICCV (Highlight), 2025 Scalable Collaborative zk-SNARK and Its Application to Fully Distributed Proof Delegation Xuanming Liu, Zhelei Zhou, Yinghao Wang, Yanxin Pang, Jinye He, Bingsheng Zhang, Xiaohu Yang, Jiaheng Zhang USENIX Security, 2025 FlipAttack: Jailbreak LLMs via Flipping Yue Liu, Xiaoxin He, Miao Xiong, Jinlan Fu, Shumin Deng, Yingwei Ma, Jiaheng Zhang, Bryan Hooi ICML, 2025 Prompt Inversion Attack against Collaborative Inference of Large Language Models Wenjie Qu, Yuguang Zhou, Yongji Wu, Tingsong Xiao, Binhang Yuan, Yiming Li, Jiaheng Zhang Oakland (S&P), 2025 HyperPianist: Pianist with Linear-Time Prover and Logarithmic Communication Cost Chongrong Li, Pengfei Zhu, Yun Li, Cheng Hong, Wenjie Qu, Jiaheng Zhang Oakland (S&P), 2025 Provably Robust Multi-bit Watermarking for AI-generated Text Wenjie Qu, Wengrui Zheng, Tianyang Tao, Dong Yin, Yanze Jiang, Zhihua Tian, Wei Zou, Jinyuan Jia, Jiaheng Zhang USENIX Security, 2025 DeepFold: Efficient Multilinear Polynomial Commitment from Reed-Solomon Code and Its Application to Zero-knowledge Proofs Yanpei Guo, Xuanming Liu, Kexi Huang, Wenjie Qu, Jiaheng Zhang USENIX Security, 2025 zkGPT: An Efficient Non-interactive Zero-knowledge Proof Framework for LLM Inference Wenjie Qu, Yijun Sun, Xuanming Liu, Tao Lu, Yanpei Guo, Kai Chen, Jiaheng Zhang USENIX Security, 2025 A Fully Pipelined GPU-Accelerated System for Batch Generation of Zero-Knowledge Proofs Tao Lu, Yuxun Chen, Zonghui Wang, Xiaohang Wang, Wenzhi Chen, Jiaheng Zhang ASPLOS, 2025 Pianist: Scalable zkRollups via Fully Distributed Zero-Knowledge Proofs [pdf] Tianyi Liu, Tiancheng Xie, Jiaheng Zhang, Dawn Song, Yupeng Zhang IEEE Symposium on Security and Privacy (S&P), 2024 Correlation Intractability and SNARGs from Sub-exponential DDH [pdf] (Alphabetical order) Arka Rai Choudhuri, Sanjam Garg, Abhishek Jain, Zhengzhong Jin, Jiaheng Zhang Annual International Cryptology Conference (CRYPTO), 2023 zkBridge: Trustless Cross-chain Bridges Made Practical [pdf] Tiancheng Xie, Jiaheng Zhang, Zerui Cheng, Fan Zhang, Yupeng Zhang, Yongzheng Jia, Dan Boneh, Dawn Song The ACM Conference on Computer and Communications Security (CCS), 2022 Polynomial Commitment with a One-to-Many Prover and Applications [pdf] Jiaheng Zhang, Tiancheng Xie, Thang Hoang, Elaine Shi, Yupeng Zhang USENIX Security Symposium (Security), 2022 Doubly Efficient Interactive Proofs for General Arithmetic Circuits with Linear Prover Time [pdf] Jiaheng Zhang, Tianyi Liu, Weijie Wang, Yinuo Zhang, Dawn Song, Xiang Xie, Yupeng Zhang The ACM Conference on Computer and Communications Security (CCS), 2021 Zero Knowledge Proofs for Decision Tree Predictions and Accuracy [pdf] [code] Jiaheng Zhang, Zhiyong Fang, Yupeng Zhang, Dawn Song The ACM Conference on Computer and Communications Security (CCS), 2020 Transparent Polynomial Delegation and Its Applications to Zero Knowledge Proof [pdf] [video] [code] Jiaheng Zhang*, Tiancheng Xie*, Yupeng Zhang, Dawn Song IEEE Symposium on Security and Privacy (S&P), 2020 Libra: Succinct Zero-Knowledge Proofs with Optimal Prover Computation [pdf] [video] [code] Tiancheng Xie*, Jiaheng Zhang*, Yupeng Zhang, Charalampos Papamanthou, Dawn Song Annual International Cryptology Conference (CRYPTO), 2019 Education Aug 2018 - May 2023: Ph.D., Computer Science, UC Berkeley. Advisor: Prof. Dawn Song Sep 2014 - Jun 2018: B.S., ACM Honors Class, Shanghai Jiao Tong University Program Committee and Reviewer CCS'26, USENIX Security'26, CCS'25, CCS'22, Oakland'21 (shadow PC), CESC'22, PKC'24, AsiaCCS'24, COLM'25, TOSEM, TIFS External reviewer for CCS'21, Oakland'22, CRYPTO'21, CRYPTO'22, CRYPTO'24, CRYPTO'25, Eurocrypt'22, TCC'23 Selected Awards CCS 2025 Top Reviewers Award • October 2025 • SIGSAC CCS Robert Brown Promising Researcher Award • September 2025 • Ministry of Education, Singapore Innovators Under 35 Asia Pacific • September 2025 • MIT Technology Review Yunfan Bright Star Award • July 2025 • World AI Conference Forbes 30 Under 30, Asia • April 2025 • Forbes Facebook Fellowship in Security and Privacy • April 2021 • Facebook Top 1.2%: 26/2163; 2 fellows in Security and Privacy Berkeley EECS Department Fellowship • August 2018 • UC Berkeley Chinese National Scholarship • October 2015 • Ministry of Education of the People's Republic of China",
  "content_length": 6815,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:57"
}