{
  "name": "Jiajun Huang 0001",
  "homepage": "https://jiajunhuang1999.github.io",
  "status": "success",
  "content": "About me - Jiajun Huang Jiajun HuangCS Assistant Professor at USF Follow Tampa, FL, USAEmailGoogle ScholarORCIDGitHubLinkedInHi, my name is Jiajun Huang (黄嘉俊). I am an Assistant Professor in the Bellini College of Artificial Intelligence, Cybersecurity and Computing at the University of South Florida (USF) since Fall 2025, and am currently hiring multiple Ph.D. students. I lead the High Performance & Intelligence Lab (Pi Lab or π Lab), where we focus on building high-performance systems for large-scale artificial intelligence and scientific applications. I received my Ph.D. in Computer Science from the University of California, Riverside, advised by Dr. Zizhong Chen. I previously worked with the MPICH and SZ teams at Argonne National Laboratory, and I continue to collaborate closely with Dr. Sheng Di, Dr. Yanfei Guo, Dr. Rajeev Thakur, and Dr. Franck Cappello.I am the founder of ZCCL.org, an initiative developed in collaboration with scientists at Argonne National Laboratory. ZCCL.org is dedicated to advancing both compression and communication and has introduced the first compression-accelerated collective communications library–ZCCL, enabling direct communication and computation with compressed data. You can explore my publications here. Feel free to reach out to me at jiajunhuang(at)usf.edu.Job OpportunitiesI am actively recruiting 2–3 highly motivated Ph.D. students with full scholarships to join my research group. Areas of focus include high-performance computing and communication, high-performance deep learning, parallel & distributed computing, and big data management & analytics.Click here for more details before reaching out via email.News [6/2025] MPICH has been awarded the 2024 ACM Software System Award! Huge congratulations to everyone! [6/2025] Presented our paper \"ghZCCL: Advancing GPU-aware Collective Communications with Homomorphic Compression\" at ICS2025 in Salt Lake City, Utah. [4/2025] Our HPDC '25 paper, IPComp: Interpolation-Based Progressive Lossy Compression for Scientific Applications, has been nominated as one of the three Best Paper candidates! [4/2025] We have two papers accepted to ICS '25 and one paper accepted to HPDC '25. Congratulations to all my collaborators and students on this exciting achievement! [4/2025] Our paper, GlobaZip: An Interactive, Efficient Distributed Compression-as-a-Service Platform with Optimized Data Compression Techniques, has been accepted by IEEE Transactions on Parallel and Distributed Systems (TPDS). [3/2025] Benjamin De Jong has been selected as an Elmhurst Jans Fellow and will be joining our group as a summer intern at Argonne National Laboratory. Congratulations, Benjamin! [2/2025] I have won the Dissertation Completion Fellowship Award from the University of California, Riverside. This recognition identifies me as one of the top Ph.D. graduates in my program and university. [11/2024] Presented our paper \"hZCCL: Accelerating Collective Communication with Co-Designed Homomorphic Compression\" at SC2024 in Atlanta, Georgia. [9/2024] Presented our paper \"FT K-Means: A High-Performance K-Means on GPU with Fault Tolerance\" at CLUSTER2024 in Kobe, Japan. [6/2024] Presented our paper \"gZCCL: Compression-Accelerated Collective Communication Framework for GPU Clusters\" at ICS2024 in Kyoto, Japan. [5/2024] Presented our paper \"An Optimized Error-controlled MPI Collective Framework Integrated with Lossy Compression\" at IPDPS2024 in San Francisco, California. [1/2024] Our paper \"An Optimized Error-controlled MPI Collective Framework Integrated with Lossy Compression\" has been accepted by IPDPS2024. Looking foward to see you in San Francisco, California. [11/2023] Won the First Place Award at ACM Student Research Competition (Graduate) in SC23! [11/2023] Our travel grant for participating in the ACM SRC at SC23 has been granted! [11/2023] Will present a poster at SC2023 in Denver, CO. Looking foward to see you at SC2023. [10/2023] Our NSF Travel Grant application for the IEEE Cluster 2023 conference has been ACCEPTED! [10/2023] Will present a paper at CLUSTER2023 in Santa Fe, New Mexico. Looking foward to see you at CLUSTER2023. [6/2023] Presented a poster at HPDC2023 in Orlando, Florida. Happy to meet you at FCRC2023. [12/2022] Attended SC22 in Dallas, Texas as a student volunteer. Very happy to be part of the HPC community. [1/2022] Started my life as a PhD student in University of California, Riverside.Research InterestsHigh-Performance Computing and CommunicationMachine Learning SystemsHigh-Performance Deep LearningDistributed and Parallel Computing/SystemsBig Data Management and ReductionEducational BackgroundUniversity of California, Riverside, 2022-2025 Ph.D. in Computer Science Dean’s Distinguished FellowshipUniversity of Glasgow, UK, 2017-2021 BEng (Hons) Electronics and Electrical Engineering with Information Engineering Graduated with Honors of the First ClassUESTC (University of Electronic Science and Technology of China), China, 2017-2021 Bachelor of Engineering in Electronic Information EngineeringResearch ExperienceAssistant Professor, Bellini College of Artificial Intelligence, Cybersecurity and Computing, University of South Florida, 2025-NowVisiting Student - Graduate, MPICH team, Argonne National Laboratory, 2022-2025 Mentors: Dr. Rajeev Thakur, Dr. Yanfei GuoVisiting Student - Graduate, SZ team, Argonne National Laboratory, 2022-2025 Mentors: Dr. Franck Cappello, Dr. Sheng DiGraduate Student Researcher, SuperLab, University of California, Riverside, 2022-2025 Advisor: Dr. Zizhong ChenSelected Awards First Place Award, ACM Student Research Competition, SC 2023 Best Paper Finalist, HPDC 2025 Dissertation Completion Fellowship Award, UC Riverside Dean's Distinguished Fellowship, UC Riverside ACM SRC Travel Grant for SC 2023 NSF Student Travel grant for IEEE Cluster 2023 James Watt Innovative Talent Scholarship, (3%) 1st Class Academic Scholarship, (3%) UESTC Outstanding Student Scholarship, (5%) thrice Excellent bachelor’s degree thesis (3%) Outstanding Individual of UESTC Summer Camp, twice Glasgow Excellent Volunteer Certificate Outstanding Individual of Summer Social PracticeStudentsJiefeng Zhou – B.Sc., Yingcai Honors College, UESTCBenjamin De Jong - Elmhurst Jans Fellow & Summer Intern from Argonne National LaboratoryTalks & Presentations [3/2025] Advancing Exascale Collective Communications with Co-Designed Compression, Invited talk, FZ+ZF Workshop, Sarasota, Florida, USA [2/2025] Advancing Exascale Collective Communications with Co-Designed Compression, Research Seminar, University of South Florida, Tampa, Florida, USA [1/2025] Advancing Exascale Collective Communications with Co-Designed Compression, Research Seminar, The University of Alabama, Tuscaloosa, Alabama, USA [9/2024] Accelerating Collective Communication with Error-Bounded Lossy Compression, Research Seminar, Tokyo Institute of Technology, Tokyo, Japan [9/2024] FT K-means: A High-Performance K-means on GPU with Fault Tolerance, Papaer presentation, Cluster '24, Kobe, Japan [9/2024] Codesigning Compression with Communication, Invited talk, FZ Workshop, The Ohio State University, Columbus, Ohio, USA [6/2024] Accelerating Collective Communication with Error-Bounded Lossy Compression, Research Seminar, RIKEN Center for Computational Science (R-CCS), Tokyo, Japan [6/2024] Accelerating Collective Communication with Error-Bounded Lossy Compression, Invited talk, CASS Community MPICH BoF, Online [6/2024] gZCCL: Compression-Accelerated Collective Communication Framework for GPU Clusters, Paper presentation, ICS '24, Kyoto, Japan [5/2024] An Optimized Error-controlled MPI Collective Framework Integrated with Lossy Compression, Paper presentation, IPDPS '24, San Francisco, California, USA [11/2023] Accelerating Collective Communications with Lossy Compression on GPU, Poster presentation, SC '23, Denver, Colorado, USA [10/2023] PiP-MColl: Process-in-Process-based Multi-object MPI Collectives, Paper presentation, CLUSTER '23, Santa Fe, New Mexico, USA [6/2023] Accelerating MPI Collectives with Process-in-Process-based Multi-object Techniques, Poster presentation, HPDC '23, Orlando, Florida, USAAcademic ServicesSession Chair: CLUSTER ‘24Reviewers & Subreviewers: ACM Computing Surveys, IEEE Transactions on Computers, IEEE Transactions on Parallel and Distributed Systems, Parallel Computing, IPDPS ‘24, CCGRID ‘24 ‘25, ICDCS ‘25, Cluster ‘25, GPGPU ‘25, DRBSD ‘25Student Volunteers: SC ‘21, SC ‘22Personal InterestsMusic: 🎷 Saxophone, Cucurbit flute (Hulusi), Bamboo flute (Dizi), Vertical bamboo flute (Xiao)Sports: 🏓 Table tennis",
  "content_length": 8607,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:58"
}