{
  "name": "Jiajing Wu",
  "homepage": "http://xplanet.site",
  "status": "success",
  "content": "eXPLore the Amazing NETworks 跳至内容 Dr. Jiajing Wu is currently a Professor at School of Software Engineering in Sun Yat-Sen University, Zhu Hai, China. She received a PhD from The Hong Kong Polytechnic University (HKPU) in 2014. Her research area includes Network Science, Cyber-Physical System, Representation Learning on Network, Data Mining, and Blockchain. (Google Scholar) Position Opening! Students who have backgrounds in Computer Science, Electronic Information Engineering, Software Engineering, Statistical Physics, Computational Mathematics, etc. are welcome to apply for graduate students. If you want to know more, please visit the InplusLab homepage (off-campus visit this website) or email me (wujiajing@mail.sysu.edu.cn.) What’s new 2025/10/31,One paper has been accepted by Springer 2025/9/28, One paper has been accepted by IEEE Transactions on Services Computing (TSC) (CCF A). 2025/8/24, One paper has been accepted by ACM Transactions on Software Engineering and Methodology (TOSEM) (CCF A). 2025/7/7, One paper has been accepted by IEEE Transactions on Information Forensics and Security(TIFS) (CCF A). 2025/6/09, One paper has been accepted by IEEE Transactions on Software Engineering（TSE) (CCF A). 2025/4/24, One paper has been accepted by ACM Transactions on Software Engineering and Methodology (TOSEM) (CCF A). 2025/2/26, One paper has been accepted by IEEE Transactions on Systems, Man, and Cybernetics: Systems (TSMC) (CCF B). 2025/1/20, Two papers has been accepted by The Web Conference (WWW) (CCF A). 2024/12/09, One paper has been accepted by Knowledge-Based Systems (KBS). 2024/11/19, One book has been accepted by Springer Book. 2024/10/21, One paper has been accepted by IEEE Transactions on Information Forensics and Security (TIFS) (CCF A). 2024/10/15, One paper has been accepted by IEEE International Conference on High Performance Computing and Communications (HPCC). 2024/10/10, One paper has been accepted by IEEE Transactions on Dependable and Secure Computing(TDSC) (CCF A). 2024/9/18, One paper has been accepted by IEEE Transactions on Information Forensics and Security (TIFS) (CCF A). 2024/9/16, One paper has been accepted by the ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA) (CCF A). 2024/7/13-14, Dr. Wu and team members attended 2024 International Conference on Blockchain, Metaverse and Trustworthy Systems (Hangzhou) (BlockSys). 2024/6/23, Team members attended CSIAM-BTAF 2024: CSIAM Blockchain Technology and Application Forum (Changchun) (区块链技术与应用高峰论坛). The team’s student Dan Lin reported on a published paper that won the second price. 2024/5/19-22, Team members attended IEEE International Symposium on Circuits and Systems 2024 (ISCAS). The team member reported on a published paper that won the Best Paper Award. 2024/3/5, One paper has been accepted by the International Symposium on Software Testing and Analysis (ISSTA) (CCF A). 2024/1/23, One paper has been accepted by the ACM Web Conference (WWW) (CCF A). 2024/1/11, One paper has been accepted by IEEE Transactions on Information Forensics and Security (TIFS) (CCF A). 2023/12/23-24, Dr. Wu and team members attended 2023大湾区计算机创新技术大会. Dr. Wu was elected as the Vice Chairman of ACM China Zhuhai Branch. 2023/12/22-23, Team members participated in the second CCF & ATEC College Student Blockchain Security, Privacy and Innovative Application Contest, won Grand Prize (特等奖). 2023/12/13, One paper has been accepted by IEEE Transactions on Information Forensics and Security (TIFS) (CCF A). 2023/11/21, One paper has been published in IEEE Transactions on Systems, Man, and Cybernetics: Systems (TSMC) (中科院1区). 2023/10/11, Dr. Jiajing Wu has been recognized in the list of World Ranking of Top 2% Scientists (October 2023). 2023/9/14-17, Dr. Wu and team members attended China Service 2023 (中国数字服务大会). Dr. Wu gave a presentation and the team’s student Zheng Ziye reported on a published paper that won the Outstanding Paper Award. 2023/8/12-8/15，Dr. Wu attended the CCF中国区块链技术大会 2023. 2023/8/8-8/10, Dr. Wu and team members attended BlockSys 2023. Dr. Wu gave a keynote speech. Team members presented two accepted papers. 2023/6/26-6/28, Team member attended IEEE International Conference on Metaverse Computing, Networking and Applications (Metacom) and presented one paper. 2023/5/21-5/25, Team members attended the IEEE International Symposium on Circuits and Systems(ISCAS) and presented four papers. 2023/5/20-5/21, Dr. Wu attended the China Society for Industrial and Applied Mathematics – Blockchain Technology and Application Forum (CSIAM-BTAF). 2023/5/12-5/14, Dr. Wu and team members attended the CCF 16th International Conference on Service Science (CCF ICSS). Dr. Wu chaired the Panel Metaverse, Blockchain, and Service . 2023/4/30-2023/5/4, Zhiying Wu attended WWW 2023 (CCF A) and presented an accepted paper. 2023/4/12, One paper has been accepted by Information Processing and Management (IPM). 2023/3/19, One paper has been accepted by IEEE Transactions on Information Forensics and Security (TIFS) (CCF A). 2023/3/18, One paper has been accepted by IEEE International Conference on Metaverse Computing, Networking and Applications. 2023/3/15, One paper has been accepted by IEEE Transactions on Computational Social Systems (TCSS). 2023/2/10-12, Dr. Wu and team members attended CCF中国区块链技术大会 2022. Team members participated in the first CCF & ATEC College Student Blockchain Security, Privacy and Innovative Application Contest, won two awards. 2022/7/25-29, Dr. Wu and team members attended NetSci 2022. 2022/4/1, One paper has been accepted by IEEE Transactions on Network Science and Engineering. 2021/6/6, One paper has been accepted by Journal of Network and Computer Applications. 2020/12/29, One paper has been accepted by IEEE Transactions on Systems, Man, and Cybernetics: Systems. 2020/9/22, One paper has been accepted by IEEE Journal on Emerging and Selected Topics in Circuits and Systems. 2020/08/11, One paper has been accepted by IEEE Transactions on Systems, Man, and Cybernetics: Systems. 2020/08/06-07, we organized the BlockSys 2020 as a virtual event. 2020/08/07, Zihao Yuan gave oral presentation on BlockSys 2020. 2020/08/07, Dr Wu gave an invited speech on BlockSys 2020. 2020/08/06, Yijing Zhao gave oral presentation on BlockSys 2020. 2020/07/09, One paper has been accepted by IEEE Transactions on Network Science and Engineering. 2020/05/11, One paper has been accepted by Frontiers in Physics. 2020/01/16, One paper has been accepted by IEEE Transactions on Circuits and Systems II: Express Briefs. 2019/12/01, One paper has been accepted by Physica A: Statistical Mechanics and its Applications. 2019/04/18, One paper has been accepted by 26th International Conference on Web Services (CCF-B). Latest publications [TSC] Dan Lin, Ziye Zheng, Jiajing Wu*, Jingjing Yang, Kaixin Lin, Huan Xiao, Bowen Song, Zibin Zheng, “Track and Trace: Automatically Uncovering Cross-Chain Transactions in the Multi-Blockchain Ecosystems”, IEEE Transactions on Services Computing, 2025, Accepted. [SCI Impact Factor = 5.8] [TOSEM] Ziwei Li, Jiajing Wu, Zhiying Wu*, Dongcheng Tan, Weipeng Zou, Zigui Jiang, Yi Zhen, Zheng Zhang,Zibing Zheng, “CCIHunter: Enhancing Smart Contract Code-Comment Inconsistencies Detection via Two-Stage Pre-Training”, ACM Transactions on Software Engineering and Methodology, 2025, Accepted. [SCI Impact Factor = 6.2] [TIFS] Dan Lin, Jiajing Wu*, Yuxin Su, Ziye Zheng, Yuhong Nan, Qinnan Zhang, Bowen Song, Zibin Zheng, “CONNECTOR: Enhancing the Traceability of Decentralized Bridge Applications via Automatic Cross-chain Transaction Association”, IEEE Transactions on Information Forensics and Security, vol. 20, pp.7588-7601, 2025, doi: 10.1109/TIFS.2025.3588249. [SCI Impact Factor = 8.5] [TSE] Hui Zhang, Jiajing Wu*, Zhiying Wu, Zhe Chen, Dan Lin, Jiachi Chen, Yuren Zhou, Zibin Zheng, “Malo in the Code Jungle: Explainable Fault Localization for Decentralized Applications”, IEEE Transactionson Software Engineering, vol. 51, pp. 2197-2210, 2025, doi: 10.1109/TSE.2025.3578816. [SCI Impact Factor = 6.5] [TOSEM] Jinze Chen, Jieli Liu, Jianlin Wu, Dan Lin*, Jiajing Wu, Zibin Zheng, “PonziHunter: Hunting Ethereum Ponzi Contract via Static Analysis and Contrastive Learning”, ACM Transactions on Software Engineering and Methodology, 2025, doi: 10.1145/3735971. [SCI Impact Factor = 3.685] [TSMC] Junyuan Fang, Han Yang, Jiajing Wu*, Zibin Zheng, Chi K. Tse, “What Contributes More to the Robustness of Heterophilic Graph Neural Networks?”, IEEE Transactions on Systems, Man, and Cybernetics: Systems, vol. 55, no. 6, pp. 3989-4000, 2025, doi: 10.1109/TSMC.2025.3548860. [SCI Impact Factor = 8.821] [WWW] Jiajing Wu, Kaixin Lin, Dan Lin*, Bozhao Zhang, Zhiying Wu, Jianzhong Su, “Safeguarding Blockchain Ecosystem: Understanding and Detecting Attack Transactions on Cross-chain Bridges”, in Proc. ACM Web Conference, pp. 4902-4912, 2025, doi: 10.1145/3696410.3714604. [WWW] Zhiying Wu, Jiajing Wu*, Hui Zhang, Zibin Zheng, Weiqiang Wang, “Hunting in the Dark Forest: A Pre-trained Model for On-chain Attack Transaction Detection in Web3”, ACM Web Conference, pp. 4519-4530, 2025, doi: 10.1145/3696410.3714928. [KBS] Han Yang, Junyuan Fang, Jiajing Wu*, Dan Li, Yaonan Wang, Zibin Zheng, “Soft Label Enhanced Graph Neural Network under Heterophily”, Knowledge-Based Systems, vol. 309, pp. 112861, 2025, doi: 10.1016/j.knosys.2024.112861. [SCI Impact Factor = 7.2] [TDSC] Dan Lin, Jiajing Wu*, Qishuang Fu, Zibin Zheng, Ting Chen, “RiskProp: Account Risk Rating on Ethereum via De-anonymous Score and Network Propagation”, IEEE Transactions on Dependable and Secure Computing, vol. 22, no. 3, pp. 2132 – 2145, 2025, doi: 10.1109/TDSC.2024.3475825. [SCI Impact Factor = 6.45] [HPCC] Ziye Zheng, Jiajing Wu, Dan Lin*, Quanzhong Li, Na Ruan, “XSema: A Novel Framework for Semantic Extraction of Cross-Chain Transactions”, IEEE International Conference on High Performance Computing and Communi",
  "content_length": 25844,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:58"
}