{
  "name": "Jiajun Wu 0001",
  "homepage": "https://jiajunwu.com",
  "status": "success",
  "content": "Jiajun Wu Jiajun Wu Office: Gates Building, Room 252 Email: jiajunwu [at] cs (dot) stanford (dot) edu Google Scholar / DBLP / Stanford Profiles Research Communities Stanford AI Lab (SAIL) Stanford Vision and Learning Lab (SVL) Stanford Computer Graphics Lab Stanford Robotics Center (SRC) Human-Centered Artificial Intelligence (HAI) I am an Assistant Professor of Computer Science and, by courtesy, of Psychology at Stanford University. Before joining Stanford, I was a Visiting Faculty Researcher at Google Research, working with Noah Snavely. I finished my PhD at MIT, advised by Bill Freeman and Josh Tenenbaum, and my undergraduate degrees at Tsinghua University, working with Zhuowen Tu. Research My group studies physical scene understanding---building machines that see, reason about, and interact with the physical world. Besides learning algorithms, what are the levels of abstraction needed by AI systems in their representations, and where do they come from? Our research aims to answer these fundamental questions, drawing inspiration from nature, i.e., the physical world itself, and from human cognition. Representative projects include Galileo, MarrNet, 4D Roses, the Neuro-Symbolic Concept Learner, and the Scene Language. In addition to developing the representations themselves, we simultaneously explore their applications in various domains: multi-modal perception from visual, acoustic, and tactile signals, as in ObjectFolder and RealImpact; visual generation of the 4D, physical world, as in 3D-GAN, pi-GAN, Point-Voxel Diffusion, SDEdit, and WonderWorld; visual reasoning via physical concept grounding, often in a neuro-symbolic way, as in NS-VQA, Shape Programs, CLEVRER, and LEFT; robotics and embodied AI using the learned physical scene representations, as in RoboCook and BEHAVIOR. Here is some information for prospective students and visitors. Thank you for your interest in joining my group! Due to the large number of emails I receive, I cannot respond to every email individually. Please review the information below before contacting me. Thanks. Current Stanford students and prospective visiting students: please fill out this form. For Stanford MS students and undergraduates, the minimum time commitment is 15 hours per week for six months. For visiting graduate students, the minimum length of a visit is six months. Prospective postdocs: please email me directly with your CV. Prospective graduate students: please apply through the system and list me as a potential advisor in your application. There is no need to contact me, unless you have a particular research question/idea that you would like to discuss further. Group Postdocs Raven Huang (with Fei-Fei Li) R. Kenny Jones (with Maneesh Agrawala) Ruohan Zhang (with Fei-Fei Li and Silvio Savarese) PhD Students Cristobal Eyzaguirre (with Juan Carlos Niebles) Chen Geng Joy Hsu Zizhang Li Kyle Sargent (with Fei-Fei Li) Stephen Tian Koven Yu Yanjie Ze (with Karen Liu) Yunzhi Zhang Affiliates Zhanpeng He (with Amazon) Klemen Kotar (with Dan Yamins) Maggie Wang (with Mac Schwager) Alumni Jiaman Li (PhD 2025, with Karen Liu), Applied Scientist, Amazon Fan-Yun Sun (PhD 2025, with Nick Haber), Co-Founder & CEO, Moonlake AI Samuel Clarke (PhD 2025), Senior ML Engineer, Tesla Kyle Hsu (PhD 2025, with Chelsea Finn), Senior ML Engineer, Tesla Michelle Guo (PhD 2025, with Karen Liu), Research Scientist, Meta Weiyu Liu (postdoc 2025), Assistant Professor, University of Utah (starting 2026) Mengdi Xu (postdoc 2025, with Fei-Fei Li), Assistant Professor, Tsinghua University Stefan Stojanov (postdoc 2025, with Dan Yamins), Applied Scientist, Amazon Eric Chan (2024, with Gordon Wetzstein), Co-Founder, Stealth Startup Elliott Wu (postdoc 2024), Assistant Professor, University of Cambridge Manling Li (postdoc 2024), Assistant Professor, Northwestern University Yunzhu Li (postdoc 2023, with Fei-Fei Li), Assistant Professor, Columbia University Ruohan Gao (postdoc 2023, with Fei-Fei Li and Silvio Savarese), Assistant Professor, University of Maryland, College Park Sumith Kulal (PhD 2023, with Alex Aiken), Co-Founder, Black Forest Labs Michael Lingelbach (2023, with Fei-Fei Li), Founder & CEO, Hedra Huazhe Xu (postdoc 2022), Assistant Professor, Tsinghua University Teaching SYMSYS1/SYMSYS200/CS24/LINGUIST35/PHIL99/PSYCH35: Minds and Machines, Spr 2026, Wtr 2025, 2024, Fall 2022 (with Thomas Icard) CS348I: Computer Graphics in the Era of AI, Wtr 2024, Fall 2021, 2020 (all with Karen Liu) CS231N: Deep Learning for Computer Vision, Spr 2022 (with Fei-Fei Li and Ruohan Gao) PSYCH225/CS322: Triangulating Intelligence: Melding Neuroscience, Psychology, and AI, Wtr 2022 (with Hyo Gweon and Dan Yamins) CS221: Artificial Intelligence: Principles and Techniques, Wtr 2021 (with Tatsu Hashimoto) CS131: Computer Vision: Foundations and Applications, Fall 2020 (with Juan Carlos Niebles) Talks Research Overview (Jan 2023) Scene Understanding via Intrinsics (July 2024) Reasoning and Concept Learning (Nov 2024) Publications (show selected / show all by date / show all by topic) Year: 2025 / 2024 / 2023 / 2022 / 2021 / 2020 / 2019 / 2018 / 2017 / 2016 / 2015 / 2014 and before Current Research Topics: Physical Scene Understanding / Multi-Modal Perception / Visual Generation / Visual Reasoning / Robotics and Embodied AI; Past Research Topic: Weakly-Supervised Learning (* and † indicate equal contribution or alphabetical order)",
  "content_length": 5434,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:00"
}