{
  "name": "Jiajun Jiang",
  "homepage": "https://xgdsmileboy.github.io",
  "status": "success",
  "content": "Jiajun JIANG's Homepage HOME NEWS PUBLICATIONS PROJECTS TEACHING SERVICES HONORS 中文 Jiajun JIANG (姜 佳君) Associate Professor with TenureCo-Appointed Research Professor Software Analysis and Intelligence Lab. College of Intelligence and Computing Tianjin University Office: Room A317, Building #55, Tianjin University (Beiyangyuan Campus) Email: News 欢迎对软件分析、自动化程序调试以及程序变换相关研究感兴趣的同学(2026年研究生入学)与我联系,可以发送个人简历到我的邮箱或与我约时间交流.长期招收本科生进入实验室参与科研实习. [Sep. 11, 2025]Our ICSME 2025 paper is awarded the IEEE TCSE Distinguished Paper Award. Congrats to all. [Aug. 13, 2025]One paper is accepted by OOPSLA 2025. In this paper, we proposed an innovative silent MLIR compiler bug detection method. Congrats to Chenyao, Yongjia, and Qingchao. [May 8, 2025]One paper is accepted by ICSME 2025. In this paper, we proposed an automated program repair method that leverages fine-grained pattern mining to guide the patch generation process. Congrats to all. [Apr. 3, 2025]Two papers are accepted by the Journal First program of FSE 2025, and will be presented there. Looking forward to share our latest results about program repair and program transformation. Feel free to talk to us. Congrats to Fengjie and Zhenfei. [Mar. 8, 2025]One paper is accepted by TSE. In this paper, we have comprehensively evaluated the performance of spectrum-based fault localization techniques in the scenario of localizing bugs in deep learning libraries. Congrats to Ming and Tianjie. [Mar. 6, 2025]One paper is accepted by 《Journal of Software》. In this paper, we proposed an innovative automated testing method for QA systems, aiming at improving the logical reasoning capability of QA systems. Congrats to Qingchao, Xingjian, and Yixian [Jan. 9, 2025]One paper is accepted by TOSEM. In this paper, we proposed an innovative automated program repair by leveraing LLMs and static program analysis. The core idea is that LLM-generated patches, although not necessarily correct, offer valuable guidance for the patch generation. This is also a follow-up work of our ICSE-NIER paper. Congrats to Fengjie and Jiajun More... Education & Employment Jan, 2024 - Now, Tianjin University, Associate Professor with Tenure, Co-Appointed Research Professor, Doctoral Advisor Jul, 2020 - Dec. 2023, Tianjin University, Tenure-track Associate Professor, Master Advisor Sep, 2015 - Jul, 2020, Peking University, Doctorate Diploma of Computer Software and Theory. Advisors: Prof. Yingfei Xiong, Prof. Zhenjiang Hu and Prof. Xiangqun Chen Jul, 2019 - Oct, 2019, Research Intern at Microsoft Research Asia, DKI (Data, Knowledge, Intelligence) Group. Mentor: Qingwei Lin Jan, 2019 - May, 2019, The University of Texas at Dallas, USA, Visiting Research Scholar under the supervision of Prof. Lingming Zhang Jun, 2017 - Dec, 2017, The University of Newcastle, AU, Visiting Ph.D. Student under the supervision of Prof. Hongyu Zhang Sep, 2011 - Jul, 2015, Northwestern Polytechnical University, Bachelor Diploma of Computer Science and Technology Research Interest Automated Program Repair : finding and repairing defects to make programs conform to the given specification. Fault Localization : localizing buggy code in programs identified by some test cases in programs. ML/DL Debugging : improving the performance of ML/DL systems. Bug Detection : detecting unknown potential bugs to improve the quality of software. Program Transformation : focusing on API adaptation, program migration and improving the usability of general transformation techniques. [TIPS : Here are a collection of representative papers (partial papers published before 2020) for beginners in the research fields of Fault Localuzation, Program Repair, and Program Synthesis. More learning resources about program repair are available Here.] Publications [Google Scholar | DBLP] Note: The authors marked with \"#\" are equal contributors to the paper and their names are sorted in alphabetic order by last or first name, marked with \"*\" are corresponding authors. [OOPSLA25]DESIL: Detecting Silent Bugs in MLIR Compiler Infrastructure [PDF]Chenyao Suo, Jianrong Wang, Yongjia Wang, Jiajun Jiang, Qingchao Shen, Junjie Chen*In: Object-oriented Programming, Systems, Languages, and Applications, October, 12-18, 2025, Singapore [ICSME25]Boosting Redundancy-based Automated Program Repair by Fine-grained Pattern Mining [PDF]Jiajun Jiang, Fengjie Li, Zijie Zhao, Zhirui Ye, Mengjiao Liu, Bo Wang, Hongyu Zhang, Junjie Chen*In: The 41st International Conference on Software Maintenance and Evolution, September 7-12, 2025, Auckland, New Zealand IEEE TCSE Distinguished Paper Award [TSE25]Evaluating Spectrum-based Fault Localization on Deep Learning Libraries [PDF]Ming Yan, Junjie Chen*, Tianjie Jiang, Jiajun Jiang, Zan WangTSE: IEEE Transactions on Software Engineering, 2025, 51(5):1399-1414 [JOS25]Research on Logical Reasoning Testing Technology of Question Answering Software [PDF]Qingchao Shen, Xingjian Li, Jiajun Jiang*, Junjie Chen, Yixian Qi, Zan WangJournal of Software (In Chinese) 2025 [TOSEM25]Hybrid Automated Program Repair by Combining Large Language Models and Program Analysis [PDF]Fengjie Li, Jiajun Jiang*, Jiajun Sun, Hongyu ZhangTOSEM: ACM Transactions on Software Engineering and Methodology, 2025 Invited to be presented at the FSE 2025 journal-first program [ICSE25-C]Evaluating the Generalizability of LLMs in Automated Program Repair [PDF]Fengjie Li, Jiajun Jiang*, Jiajun Sun, Hongyu ZhangIn: The IEEE/ACM International Conference on Software Engineering (New Ideas and Emerging Results), April 27-May 3, 2025, Ottawa. Canada [ISSTA24a]Testing Graph Database Systems with Graph-State Persistence Oracle [PDF]Shuang Liu, Junhao Lan, Xiaoning Du, Jiyuan Li, Wei Lu*, Jiajun Jiang, Xiaoyong DuIn: The ACM SIGSOFT International Symposium on Software Testing and Analysis, September 16-20, 2024, Vienna, Austria, pages 666-677 [ISSTA24b]Fuzzing MLIR Compiler Infrastructure via Operation Dependency Analysis [PDF]Chenyao Suo, Junjie Chen*, Shuang Liu, Jiajun Jiang, Yingquan Zhao, Jianrong WangIn: The ACM SIGSOFT International Symposium on Software Testing and Analysis, September 16-20, 2024, Vienna, Austria, pages 1287-1299 [OOPSLA24]Dependency-aware Code Naturalness [PDF]Chen Yang, Junjie Chen*, Jiajun Jiang, Yuliang HuangIn: Proceedings of the ACM on Programming Languages, OOPSLA, October 20-25, 2024, California, United States, pages 2355-2377 [ISSTA24c]A Large-scale Empirical Study on Improving the Fairness of Image Classification Models [PDF] [Tool]Junjie Yang, Jiajun Jiang*, Zeyu Sun, Junjie ChenIn: The ACM SIGSOFT International Symposium on Software Testing and Analysis, September 16-20, 2024, Vienna, Austria, pages 210-222 [TOSEM24]Mapping APIs in Dynamic-typed Programs by Leveraging Transfer Learning [PDF] [Tool]Zhenfei Huang, Junjie Chen, Jiajun Jiang*, Yihua Liang, Hanmo You, Fengjie LiTOSEM: ACM Transactions on Software Engineering and Methodology, 2024, 33(4):1-29 Invited to be presented at the FSE 2025 journal-first program [TOSEM23a]A Post-Training Framework for Improving the Performance of Deep Learning Models via Model Transformation [PDF] [Tool]Jiajun Jiang, Junjie Yang, Yingyi Zhang, Zan Wang, Hanmo You, Junjie Chen*TOSEM: ACM Transactions on Software Engineering and Methodology, 2023, 33(3):1-41 [TOSEM23b]Variable-Based Fault Localization via Enhanced Decision Tree [PDF] [Tool]Jiajun Jiang, Yumeng Wang, Junjie Chen*, Delin Lv, Mengjiao LiuTOSEM: ACM Transactions on Software Engineering and Methodology, 2023, 33(2):1-32 [ISSRE23]Can Code Representation Boost IR-Based Test Case Prioritization [PDF]Lin Yang, Junjie Chen*, Hanmo You, Jiachen Han, Jiajun Jiang, Zhe Sun, Xinqi Lin, Fang Liang, Yuning KangIn: The 34th IEEE International Symposium on Software Reliability Engineering, October 9-12, 2023, Florence, Italy, pages 240-251 [TOSEM23c]Toward Understanding Deep Learning Framework Bugs [PDF]Junjie Chen, Yihua Liang#, Qingchao Shen#, Jiajun Jiang*, Shuochuan LiTOSEM: ACM Transactions on Software Engineering and Methodology, 2023, 32(6):1-31 Invited to be presented at the ICSE 2024 journal-first program [ISSTA23]Silent Compiler Bug De-duplication via Three-Dimensional Analysis [PDF]Chen Yang, Junjie Chen*, Xingyu Fan, Jiajun Jiang, Jun SunIn: The 32nd International Symposium on Software Testing and Analysis, July 17-21, 2023, Seattle, Washington, USA, pages 677–689 [ICSE23a]Achieving Last-Mile Functional Coverage in Testing Chip Design Software Implementations [PDF]Ming Yan, Junjie Chen*, Hangyu Mao, Jiajun Jiang, Jianye Hao, Xingjian Li, Zhao Tian, Zhichao Chen, Dong Li, Zhangkong Xian, Yanwei Guo, Wulong Liu, Bin Wang, Yuefeng Sun, Yongshun CuiIn: The 45th International Conference on Software Engineering (Software Engineering in Practice), May. 14-20, 2023, Melbourne, Australia, pages 343-354 [ICSE23b]Compiler Test-Program Generation via Memoized Configuration Search [PDF]Junjie Chen, Chenyao Suo, Jiajun Jiang*, Peiqi Chen, Xingjian LiIn: The 45th International Conference on Software Engineering, May. 14-20, 2023, Melbourne, Australia, pages 2035–2047 [ASE22]Toward Improving the Robustness of Deep Learning Models via Model Transformation [PDF] [Tool] [Media]Yingyi Zhang, Zan Wang, Jiajun Jiang*, Hanmo You, Junjie ChenIn: The 37th IEEE/ACM International Conference on Automated Software Engineering, Oct. 10-14, 2022, Ann Arbor, Michigan, United States, pages 1-13 [FSE21-C]Accelerating Redundancy-Based Program Repair via Code Representation Learning and Adaptive Patch Filtering [PDF] [Media]Chen Yang, Jiajun Jiang, Junjie ChenIn: The 29th ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (Student Research Competition), Aug. 23-28, 2021, Athens, Greece, pages 1672-1674 Student Research Competition Award (Gold in undergraduate category) [FSE21]A Comprehensive Study on Learning-based PE Malware Family Classification Methods [PDF] [Tool]Yixuan Ma, Shuang Liu*, Jiajun Jiang, Guanhong Chen, Keqiu LiIn: The 29th ACM Joint E",
  "content_length": 17140,
  "method": "requests",
  "crawl_time": "2025-12-01 13:29:59"
}