{
  "name": "Jianguo Wang 0001",
  "homepage": "https://www.cs.purdue.edu/homes/csjgwang",
  "status": "success",
  "content": "Jianguo Wang @ Purdue Jianguo Wang Assistant Professor Department of Computer Science Purdue University West Lafayette, Indiana Email: csjgwang@purdue.edu Office: LWSN 2142B Phone: (765) 496-0726 Biography Jianguo Wang is currently a Tenure-Track Assistant Professor in the Department of Computer Science at Purdue University. Prior to joining Purdue, he worked at Zilliz on Milvus, a purpose-built vector database system. Before that, he worked at Amazon Web Services (AWS) on Amazon Aurora, a cloud-native database system. He also interned at Microsoft Research, Oracle, and Samsung on various database systems. He obtained his PhD degree in Computer Science from the University of California, San Diego, his MPhil degree from The Hong Kong Polytechnic University, and his Bachelor's degree from Zhengzhou University, China. Research Interests Currently, I'm leading a team of students working on Database Systems for the Cloud and Large Language Models, including Disaggregated Databases and Vector Databases. Disaggregated Database Systems (for the Cloud) Memory-Disaggregated Databases Storage-Disaggregated Databases Distributed Shared-Memory & Shared-Storage Databases Serverless Databases with Disaggregation Disaggregated Databases for Data Lakes [Papers: SIGMOD'26a, SIGMOD'26b, VLDB'25, Patent'24, SIGMOD'24a, SIGMOD'24b, VLDBJ'24a, VLDB'23, SIGMOD'23, ICDE'23] [Major Open-source: We built OpenAurora, an open-source version of Amazon Aurora, based on PostgreSQL v13.0. OpenAurora is a cloud-native database prototype optimized for the storage-disaggregated infrastructure. We are currently working on memory disaggregation and multi-masters within OpenAurora. We hope it will be used by the broader database system research community.] [External Grants: NSF CAREER Award] Vector Database Systems (for Large Language Models) Supporting Vector Data Management inside Relational Databases Multi-Model Vector Databases (Vector + \"X\") for Advanced RAGs Cost-Efficient Vector Databases Auto Tuning in Vector Databases Beyond Vector Databases: RAGs and Multi-Model Databases [Papers: CIDR'26, SIGMOD'26c, SIGMOD'25, VLDB'24a, VLDB'24b, SIGMOD'24c, SIGMOD'24d, ICDE'24, VLDBJ'24b, SIGMOD'21, ICDT'19] Working Experience Assistant Professor, Department of Computer Science, Purdue University   01/2021 - Present Milvus Vector Database Team, Zilliz, Remote   07/2020 - 12/2020 Project: Milvus: A Purpose-Built Vector Database System (SIGMOD'21) Aurora Cloud Database Team, Amazon AWS, Palo Alto, CA   03/2019 - 07/2020 Project: Write Forwarding in Amazon Aurora Globally-Distributed Database Patent: Selective Forwarding for Multi-statement Database Transactions Recent Publications Jiayi Liu, Yunan Zhang, Chenzhe Jin, Aditya Gupta, Shige Liu, Jianguo Wang. Fast Vector Search in PostgreSQL: A Decoupled Approach. Conference on Innovative Data Systems Research (CIDR), 2026. Chenzhe Jin, Yunan Zhang, Jiayi Liu, Jianguo Wang. Efficient Vector Index Management in Vector Databases. Proceedings of ACM Conference on Management of Data (SIGMOD), 2026. Xi Pang, Jianguo Wang. Reducing Tail Latency in Storage-Disaggregated Database Systems. Proceedings of ACM Conference on Management of Data (SIGMOD), 2026. More publications... Team Ruihong Wang (since Fall 2020), co-advised with Walid G. Aref Xi Pang (since Fall 2021) Shige Liu (since Fall 2022) Chenzhe Jin (since Fall 2022) Chuqing Gao (since Fall 2022) Yunan Zhang (since Fall 2023) Te Guo (since Fall 2023) Jiayi Liu (since Fall 2024) Yibo Wang (since Fall 2025) Yinghao He (since Fall 2025) Hiring I'm always looking for highly motivated students in database systems (hiring info). Please feel free to contact me if you're interested. Teaching CS592 (Seminar): Databases for AI: Vector Databases Spring 2026 CS592 (Seminar): Disaggregated Database Systems Spring 2023 CS590 (Seminar): Cloud-native Database Systems Spring 2021 CS440: Large-scale Data Analytics Fall 2025, Fall 2024, Fall 2023, Fall 2022, Fall 2021 CS448: Introduction to Database Systems Spring 2022 CS541: Graduate Database Systems Spring 2026 Honors and Awards Invited to the Dagstuhl Seminar on Vector Databases, 2026 IEEE TCDE Rising Star Award, 2025 Google ML and Systems Junior Faculty Award, 2025 Purdue College of Science Professional Achievement Award, 2025 ACM SIGMOD Research Highlight Award, 2025 NSF CAREER Award, 2024 Panel Moderator of VLDB'24 Panel on Vector Databases, 2024 Distinguished Reviewer of VLDB, 2024 Purdue Ross-Lynn Research Scholar, 2022 Facebook Research Award Finalists, 2021 Bests of the International Conference on Database Theory (ICDT), 2019 Services Professional Services SIGMOD Program Committee: 2027, 2025, 2024, 2022, 2021 VLDB Program Committee: 2026, 2025, 2024, 2023, 2022, 2021, 2020 ICDE Program Committee: 2026, 2025, 2024, 2023, 2022, 2021 NSF Panelist: 2025, 2024 University Services Purdue CS PhD Admission Committee: 2025, 2024, 2023, 2022, 2021",
  "content_length": 4923,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:12"
}