{
  "name": "Jianbing Zhang",
  "homepage": "https://cs.nju.edu.cn/zhangjb",
  "status": "success",
  "content": "Academic Homepage Jian-Bing Zhang (张建兵) NJUNLP,School of Artificial Intelligence, Nanjing University, China Nanjing University, Xianlin Campus Mailbox 603 Email: zjb at nju.edu.cn Correspondence Mail: Jian-Bing Zhang Natural Language Processing Group Nanjing University, Xianlin Campus Mailbox 603 163 Xianlin Avenue, Qixia District Nanjing 210023,China Office: 202, Information Technology Services Center, Xianlin Campus. Tel: 025-89681032 Email: zjb at nju.edu.cn Research Interests AI for Science MultiModal Learning Short Biography After receiving his PhD from the Nanjing University, Jiangsu, China, Jian-Bing Zhang worked at the Nanjing University till now. He is an Associate professor and Ph.D. Supervisor at the School of Artificial Intelligence, Nanjing University. Awards 2024 江苏省高层次人才培养计划第七期第三层次培养对象 2023 第十三届“挑战杯”大学生创业计划竞赛 全国总决赛铜奖 指导教师 2023 NLPCC23 Best Paper 2023 南京大学优秀德育导师 2022 南京大学“育教融合奖” 2022 美国大学生数学建模竞赛 F 奖 指导教师 2022 中国大学生计算机设计大赛 二等奖、江苏省特等奖 指导教师 2021 第七届中国国际“互联网+”大学生创新创业大赛 全国总决赛银奖 指导教师 2021 第三届 DIGIX 全球校园人工智能算法精英大赛 一等奖 指导教师 2020 江苏省优秀专业硕士学位论文 指导教师 2020 南京大学新华报业奖教金 2019 南京大学孙钟秀教育基金奖教金 2019 南京大学“本科实践教学优秀指导教师” 2018 南京大学国家双创示范基地人工智能科创实验室（南京市科创实验室） 执行主任 2018 第四届“互联网+”创新创业大赛 全国总决赛银奖 指导教师 2017 第三届“互联网+”创新创业大赛 全国总决赛铜奖 指导教师 2016 第二届“互联网+”创新创业大赛 全国总决赛银奖 指导教师 2016 第五届江苏省大学生机器人大赛 单项冠军、亚军 指导教师 2016 南京大学国家双创示范基地智能机器人实验室 执行主任 2010 南京大学“五四奖章” Projects 科技部，科技创新2030-“新一代人工智能国家科技重大专项”重大项目子课题，跨尺度化学大模型驱动的高效快速新材料智能设计，2023/03 至 2026/02，在研，主持 国家自然科学基金委员会, 面上项目, 62176115, 预训练模型中多模态融合问题研究, 2022-01-01 至 2025-12-31, 在研, 主持 科技部，科技创新2030-“新一代人工智能国家科技重大专项”重大项目，高级强化学习理论研究，2020/11 至 2023/10，在研，主要参与人 国家自然科学基金委员会, 面上项目, 61976114, 融合细粒度情感分析的推荐系统研究, 2020-01-01 至 2023-12-31, 资助期满, 参与 国家自然科学基金委员会, 面上项目, 51975294, 基于机器学习面向复杂非线性的机电伺服作动系统 高精度运动关键控制方法研究, 2020-01-01 至 2023-12-31, 资助期满, 参与 国家自然科学基金委员会, 联合基金项目, U1836221, 基于知识的智能机器翻译方法研究, 2019-01- 01 至 2022-12-31, 结题, 参与 Selected Publications Zheng Ma, Haotian Yang, Jianbing Zhang, Jiajun Chen. KnowBench: Evaluating the Knowledge Alignment on Large Visual Language Models. JCST, 40(5): 1209−1219, Sept. 2025. Kanzhi Cheng, Wenpo Song, Jiaxin Fan, Zheng Ma, Qiushi Sun, Fangzhi Xu, Chenyang Yan, Nuo Chen, Jianbing Zhang, Jiajun Chen. CapArena: Benchmarking and Analyzing Detailed Image Captioning in the LLM Era. Findings of ACL, pages 14077–14094, Vienna, Austria. 2025. Mianzhi Pan, Tianhao Tan, Yawen Ouyang, Qian Jin, Yougang Chu, Weiying Ma, Jianbing Zhang , Lian Duan, Dong Wang, Hao Zhou. Generative AI-powered inverse design for tailored narrowband molecular emitters. Digital Discovery, 4(10), 2942-2953. 2025 Kanzhi Cheng, Yantao Li, Fangzhi Xu, Jianbing Zhang, Hao Zhou, Yang Liu. Vision-Language Models Can Self-Improve Reasoning via Reflection. In Proceedings of the 2025 Conference of the Nations of the Americas Chapter of the Association for Computational Linguistics(NAACL): Human Language Technologies (Volume 1: Long Papers), pages 8876–8892, Albuquerque, New Mexico. Association for Computational Linguistics. 2025 Hanlin Wu, Yuxuan Song, Jingjing Gong, Ziyao Cao, Yawen Ouyang, Jianbing Zhang, Hao Zhou, Weiying Ma, and Jingjing Liu. A Periodic Bayesian Flow for Material Generation\". ICLR Spotlight, pages 11741--11770. 2025 Shangyu Xing, Fei Zhao, Zhen Wu, Tuo An, Weihao Chen, Chunhui Li, Jianbing Zhang, Xinyu Dai. EFUF: Efficient Fine-Grained Unlearning Framework for Mitigating Hallucinations in Multimodal Large Language Models. In Proceedings of the 2024 Conference on Empirical Methods in Natural Language Processing(EMNLP), pages 1167–1181, Miami, Florida, USA. 2024 Lingxing Kong, Yougang Chu, Zheng Ma, Jianbing Zhang, Liang He, Jiajun Chen. MixRED: A Mix-lingual Relation Extraction Dataset. In Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING), pages 11361–11370, Torino, Italia. 2024 Liang He, Hongke Wang, Zhen Wu, Jianbing Zhang, Xinyu Dai, Jiajun Chen. Focus & Gating: A Multimodal Approach for Unveiling Relations in Noisy Social Media. In Proceedings of the 32nd ACM International Conference on Multimedia(ACMMM'2024) (pp. 1379-1388). 2024 Kanzhi Cheng, Qiushi Sun, Yougang Chu, Fangzhi Xu, YanTao Li, Jianbing Zhang, Zhiyong Wu. SeeClick: Harnessing GUI Grounding for Advanced Visual GUI Agents. Proceedings of the 62nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics, 2024. Lingxing Kong, Zheng Ma, Jianbing Zhang, Liang He, Jiajun Chen. EmoRED: A Dataset for Relation Extraction in Texts with Emoticons. In ICASSP 2024-2024 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP) (pp. 10746-10750). 2024 Lingxing Kong, Jiuliang Wang, Zheng Ma, Qifeng Zhou, Jianbing Zhang, Liang He, Jiajun Chen. A Hierarchical Network for Multimodal Document-Level Relation Extraction. Proceedings of the AAAI Conference on Artificial Intelligence, 38(16), 18408-18416. 2024 Kanzhi Cheng, Wenpo Song, Zheng Ma, Wenhao Zhu, Zixuan Zhu, Jianbing Zhang. Beyond Generic: Enhancing Image Captioning with Real-World Knowledge using Vision-Language Pre-Training Model. The 31th ACM International Conference on Multimedia (ACMMM'2023), Ottawa, Canada, 2023 Zheng Ma, Mianzhi Pan, Wenhan Wu, Kanzhi Cheng, Jianbing Zhang, Shujian Huang, and Jiajun Chen. Food-500 Cap: A Fine-Grained Food Caption Benchmark for Evaluating Vision-Language Models. The 31th ACM International Conference on Multimedia (ACMMM'2023), Ottawa, Canada, 2023 Zheng Ma, Changxin Wang, Bo Huang, Zixuan Zhu, and Jianbing Zhang. Bounding and Filling: A Fast and Flexible Framework for Image Captioning. The 12th CCF International Conference on Natural Language Processing and Chinese Computing (NLPCC'2023), Foshan, China, 2023 Liang He, Hongke Wang, Yongchang Cao, Zhen Wu, Jianbing Zhang, Xinyu Dai. MORE: A Multimodal Object-Entity Relation Extraction Dataset with a Benchmark Evaluation. The 31th ACM International Conference on Multimedia (ACMMM'2023), Ottawa, Canada, 2023 Shangyu Xing, Fei Zhao, Zhen Wu, Chunhui li, Jianbing Zhang and Xinyu Dai. DRIN: Dynamic Relation Interactive Network for Multimodal Entity Linking. The 31th ACM International Conference on Multimedia (ACMMM'2023), Ottawa, Canada, 2023 Robert Ridley, Zhen Wu, Jianbing Zhang, Shujian Huang, Xinyu Dai. Addressing Linguistic Bias through a Contrastive Analysis of Academic Writing in the NLP Domain. The 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP'2023), Singapore, 2023 Fei Zhao, Chunhui li, Zhen Wu, Yawen Ouyang, Jianbing Zhang, Xinyu Dai. M2DF: Multi-grained Multi-curriculum Denoising Framework for Multimodal Aspect-based Sentiment Analysis. The 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP'2023), Singapore, 2023 Yawen Ouyang, Yongchang Cao, Yuan Gao, Zhen Wu, Jianbing Zhang and Xinyu Dai. On Prefix-tuning for Lightweight Out-of-distribution Detection. The 61st Annual Meeting of the Association for Computational Linguistics (ACL'2023), Toronto, Canada, 2023 Sen Yang, Shujian Huang, Wei Zou, Jianbing Zhang, Xinyu Dai and Jiajun Chen. Local Interpretation of Transformer Based on Linear Decomposition. The 61st Annual Meeting of the Association for Computational Linguistics (ACL'2023), Toronto, Canada, 2023 Zheng Ma, Shi Zong, Mianzhi Pan, Jianbing Zhang, Shujian Huang, Xinyu Dai, Jiajun Chen. Probing Cross-modal Semantics Alignment Capability from the Textual Perspective. The 2022 Conference on Empirical Methods in Natural Language Processing (Findings of EMNLP'2022), Abu Dhabi, 2022 Kanzhi Cheng, Zheng Ma, Shi Zong, Jianbing Zhang, Xinyu Dai, Jiajun Chen. ADS-Cap: A Framework for Accurate and Diverse Stylized Captioning with Unpaired Stylistic Corpora. The 11th CCF International Conference on Natural Language Processing and Chinese Computing (NLPCC'2022), Guilin, China, 2022 Jianbing Zhang, Peng Wu, Yingjie Zhang, Shujian Huang, Xinyu Dai, Jiajun Chen. Integrating Heterogeneous Thesauruses for Chinese Synonyms. Front. Comput. Sci. 15, 152312. 2021 Peng Wu, Shujian Huang, Rongxiang Weng, Zaixiang Zheng, Jianbing Zhang, Xiaohui Yan and Jiajun Chen. Learning Representation Mapping for Relation Detection in Knowledge Base Question Answering. The 57th Annual Meeting of the Association for Computational Linguistics (ACL), Florence, Italy, Aug 2019 Meng Liu, Xuyun Zhang, Chi Yang, Qiang He, Jianbing Zhang. Curve fitting based efficient parameter selection for robust provable data possession. Journal of Parallel and Distributed Computing.Volume 120, October, Pages 62-76. 2018 Hongjian Xue, Xinyu Dai, Jianbing Zhang, Shujian Huang, Jiajun Chen. Deep Matrix Factorization Models for Recommender Systems. In: Proceedings of the 26th International Joint Conference on Artificial Intelligence (IJCAI'17), Melbourne. 2017 Jianbing Zhang, Yixin Sun, Shujian Huang, Cam-Tu Nguyen, Xiaoliang Wang, Xinyu Dai, Jiajun Chen, and Yang Yu. AGRA: An analysis-generation-ranking framework for automatic abbreviation from paper titles. In: Proceedings of the 26th International Joint Conference on Artificial Intelligence (IJCAI'17), Melbourne, Australia, 2017 Jianbing Zhang, Yixin Sun, Dechuan Zhan. Multiple-Instance Learning for Text Categorization Based on Semantic Representation. Big Data and Information Analytics, Volume 2, Number 1, January 2017 pp. 69-75. 2017 Xinyu Dai, Jianbing Zhang, Shujian Huang, Jiajun Chen, and Zhihua Zhou. Structured sparsity with group-graph regularization. In: Proceedings of the 29th AAAI Conference on Artificial Intelligence (AAAI'15), Austin, TX, 2015. Course Introduction to AI Industry, For undergraduate students © This is a personal page. All rights reserved by author.",
  "content_length": 9697,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:07"
}