{
  "name": "Jian-Jia Chen",
  "homepage": "https://ls12-www.cs.tu-dortmund.de/daes/de/daes/mitarbeiter/jjchen.html",
  "status": "success",
  "content": "Prof. Jian-Jia Chen - DAES - TU Dortmund To path indicator Subpages of “Staff“ To navigation To quick access To footer with other services To content Design Automation for Embedded Systems Department of Computer Science E-mail: jian-jia.chencs.tu-dortmundde Phone  +49 231  755-6078 Fax +49 231  755-6116 Secretary: Claudia Graute , send an e-mail, phone: +49  231  755-6112 Address: Technische Universität Dortmund Fakultät für Informatik, Informatik 12 Otto-Hahn-Str. 16 44227 Dortmund Room E21 Office hours:  Please send me an e-mail in urgent cases or contact with the secretary. © Roland Baege​​/​​TU Dort­mund Research Interests Real-time systems Cyber-physical systems Embedded software Low-power software Timing predictability Fault resilient embedded software Distributed computing Awards and Honors European Research Council (ERC) Consolidator Award 2019 IEEE Real-Time Systems Symposium (RTSS) 2018 Outstanding Paper Award IEEE International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA) 2018 Best Student Paper Award International Conference on Bio-inspired Systems and Signal Processing (BIOSIGNALS) 2018 Best Paper Award IEEE Real-Time Systems Symposium (RTSS) 2016 Outstanding Paper Award Euromicro Conference on Real-Time Systems (ECRTS) 2016 Outstanding Paper Award IEEE International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA) 2015 Best Paper Award IEEE/ACM International Conference on Hardware/Software Codesign and System Synthesis (CODES+ISSS), 2014 Best Paper Award International Conference on Smart Cities and Green ICT Systems (Smart-Green), 2014 Best Student Paper Award IEEE International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA) 2013 Best Paper Award IEEE Real-Time Systems Symposiums (RTSS) 2011 Best Paper Candidate ACM Symposium on Applied Computing (SAC) 2009 Best Paper Award 2006 Institute of Information & Computing Machinery (IICM) Doctoral Dissertation Award NTU CSIE 2006 Spring Semester Excellent Teaching Assistant Award (for Game Theory) IEEE International Conference on Embedded and Real-Time Computing Systems and Applications (RTCSA) 2005 Best Paper Award EDUCATION Ph.D., 2002--2006, Department of Computer Science and Information Engineering, National Taiwan University \t Graduation: June 2006  Ph.D. dissertation: Energy-Efficient Scheduling for Real-Time Tasks in Uniprocessor and Homogeneous Multiprocessor Systems Dissertation  Advisor: Professor Tei-Wei Kuo M.Sc., 2001--2002, Department of Computer Science and Information Engineering National Taiwan University \t Pursuing Ph.D. degree after the first-year study B.S., 1996--2001, Department of Chemistry, National Taiwan University Working Experience Juniorprofessor at Faculty of Informatics, Karlsruhe Institute of Technology (KIT) Germany, May 2010 - March 2014 Post-doc at ETHZ, Switzerland, Jan. 2008 -April 2010 Serviceman (compulsory service) at Fisheries Agency, Council of Agriculture, Executive Yuan, Taiwan, Dec. 2006 - Dec. 2007 Postdoc at CSIE Department NTU, Jul. - Oct. 2006 Research assistant at CSIE Department NTU, Sep. 2001 - Jun. 2006 Programmer in INE Technology, May - Nov. 2000 more Info. can be found under PUBLICATIONS. TEACHING. To top of page",
  "content_length": 3281,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:13"
}