{
  "name": "Jian Yang 0001",
  "homepage": "https://researchers.mq.edu.au/en/persons/jian-yang",
  "status": "success",
  "content": "Jian Yang - Macquarie University View Scopus Profile Jian Yang Professor Professor, School of ComputingCentre for Applied Artificial IntelligenceData Horizons Research CentreFuture Communications Research CentreDirector of Industrial PhD Program (Secondment), School of ComputingEmerging Risks Research Centre https://orcid.org/0000-0002-4408-1952 Phone+61 2 9850 9584Emailjian.yangmq.eduau h-index 4352 Citations 33 h-index Calculated based on number of publications stored in Pure and citations from Scopus 1997 …2025 Research activity per year Personal profile BiographyProf Jian Yang is a Co-Director of Data Horizons research Centre and Deputy Director of Applied Artificial Intelligence Research Centre. She received her PhD in Data Integration  from The Australian National University in 1995. Before she joined Macquarie University, she worked as an associate professor at Tilburg University, Netherlands (2000-2003), a senior research scientist at the Division of Mathematical and Information Science, CSIRO, Australia (1998-2000), and as a lecturer at Dept of Computer Science, The Australian Defence Force Academy, University of New South Wales (1993-1998). She has been recognised among the Stanford/Elsevier Top 2% Scientists globally for her career-long impact, spanning from 2019 to 2025.Research interestsProf Yang's current interests are: graph mining; trust, fake news detection, recommendation in social media; fraud detection; data fusion, data driven process analytics; service orineted computing; smart city; aging and aged care. Her research has been supported by various sources: ARC Discovery, ARC Linkage, ARC LIEF, CRCs, Data61 CSIRO CRP, and EU six framework. Recent projects include: trust and spam detection in social media; grand truth discovery in web; fraud detection in finance and insurance; smart city; detection and early prediction for thyroid cancer; data fusion for medical data. She has published papers in top international journals and conferences such as IEEE TKDE, TNNIS, TSC; ACM TOIS, TWeb;  Information Systems, VLDBJ, CACM, VLDB, ICDE, SIGKDD, IJCAI, ICDM, WSDM, NuerIPS, ICDCS, ICSOC, ICWS, CAiSE, CIKM, etc.She is the founding member and steering committee chair of the prime international conference on service oriented computing (ICSOC). She was general chair and program committee chair of several international conferences such as ICSOC and BPM. External positionsDirector of Industry PhD Program, Digital Finance CRC Limited1 Jul 2023 → …Executive , The Computing Research and Education Association of Australasia (CORE)2019 → 2024 Fingerprint Dive into the research topics where Jian Yang is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 12 Similar Profiles Business Process Computer Science 100% Graph Neural Network Computer Science 61% Web Service Computer Science 60% Social Network Computer Science 47% Quality of Service Computer Science 38% Experimental Result Computer Science 37% Service Composition Computer Science 37% Fake News Detection Computer Science 36% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2006 2020 2022 2023 2034 10 Active 24 Finished Projects per year Head Agreement (Griffith led): Solving Plastic Waste CRCChen, C. (Chief Investigator), Gu, T. (Primary Chief Investigator), Singh, A. (Chief Investigator), Sheng, M. (Chief Investigator), Yang, J. (Chief Investigator), Beheshti, A. (Chief Investigator), Wang, Y. (Chief Investigator), Asadnia, M. (Chief Investigator), Bishop, M. (Chief Investigator), Cain, A. (Chief Investigator), Feih, S. (Chief Investigator), Naebe, M. (Chief Investigator), Giurco, D. (Chief Investigator) & Ball, A. (Chief Investigator)15/09/24 → 15/09/34Project: Research Transformation of Data to Data products for a Trusted Data-Driven Economy: Technology Innovation and ApplicationYang, J. (Primary Chief Investigator), Beheshti, A. (Chief Investigator), Wu, J. (Chief Investigator), Zhang, W. (Chief Investigator), Yarom, Y. (Chief Investigator), Huang, Y. (Chief Investigator), Gu, T. (Other), Sheng, M. (Other), McKenzie, J. (Other), Chen, P. (Other) & He, D. (Other)24/05/23 → 30/07/27Project: Research MQDRC: MQRC Consilience Macquarie University Data Research CentreYang, J. (Primary Chief Investigator), Selvadurai, N. (Primary Chief Investigator), Shang, H. (Primary Chief Investigator) & Sowman, P. (Primary Chief Investigator)23/02/23 → 3/01/28Project: Other DP230100899: New Graph Mining Technologies to Enable Timely Exploration of Social EventsWu, J. (Primary Chief Investigator) & Yang, J. (Chief Investigator)1/01/23 → 31/12/25Project: Research Intelligent Storytelling with Business DataBeheshti, A. (Primary Chief Investigator), Sheng, M. (Chief Investigator), Wu, J. (Chief Investigator), Yang, J. (Chief Investigator), Zhang, X. (Chief Investigator), Alinejad Rokny, H. (Chief Investigator) & Asghari, P. (Partner Investigator)3/11/22 → 1/01/27Project: Research View all 34 projects Research Outputs Research output per year 1997 2020 2023 2024 2025 2025 182 Conference proceeding contribution 79 Article 15 Editorial 8 Chapter 9 More 5 Foreword/postscript/introduction 2 Conference abstract 1 Letter 1 Review article Research output per year Research output per year A collaborative service composition approach considering providers' self-interest and minimal service sharingWang, X., Xu, H., Yang, J., Xu, X. & Wang, Z., Mar 2025, In: IEEE Transactions on Parallel and Distributed Systems. 36, 3, p. 598-615 18 p.Research output: Contribution to journal › Article › peer-review Service Composition 100% Federated machine learning 11% Learning Framework 11% Traditional Method 11% User Requirement 11% A multiagent-based framework on RoboCup simulation system for enhancing rescue operation during dynamic disaster environmentsLyu, Q., Cao, X., Yu, Y., Xue, S., Yang, J., Wu, J. & Beheshti, A., 2025, WWW Companion '25: Companion proceedings of the ACM Web Conference 2025. New York: Association for Computing Machinery, p. 1180-1183 4 p.Research output: Chapter in Book/Report/Conference proceeding › Conference proceeding contribution › peer-review Open AccessFile multi-agent 100% Simulation System 100% Rescue Operation 100% path planning method 100% Path Planning 100% 28 Downloads (Pure) A survey on truth discovery: concepts, methods, applications, and opportunitiesWang, S., Zhang, H., Sheng, Q. Z., Li, X., Sun, Z., Cai, T., Zhang, W. E., Yang, J. & Gao, Q., 2025, In: IEEE Transactions on Big Data. 11, 2, p. 314-332 19 p.Research output: Contribution to journal › Article › peer-review Supervised Learning 100% Unsupervised Learning 100% Problem Discovery 100% Information Explosion 100% Independent Source 100% A unified hypergraph framework for inter and intra-session dynamics in session-based social recommendationsKhan, B., Wu, J., Yang, J., Hayat, M. K. & Xue, S., 2 May 2025, (E-pub ahead of print) In: IEEE Transactions on Big Data.Research output: Contribution to journal › Article › peer-review Hyperedges 100% Nodes 100% Graph Neural Network 66% Single Session 66% Limitations 50% 2 Citations (Scopus) Beyond pairwise relationships: a transformer-based hypergraph learning approach for fraud detectionHaghighi, V., Soltani, B., Shabani, N., Wu, J., Zhang, Y., Yao, L., Yang, J. & Sheng, Q. Z., Sept 2025, In: Knowledge and Information Systems. 67, 9, p. 7987-8022 36 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Fraud Detection 100% Learning Approach 100% Order Relationship 28% Online Social Network 14% Detection Method 14% 10 Downloads (Pure) View all 293 research outputs Prizes Best Student Paper Awards for “FRAUDRE: Fraud Detection Dual-Resistant to Graph Inconsistency and Imbalance” Zhang, G. (Recipient), Wu, J. (Recipient), Yang, J. (Recipient), Beheshti, A. (Recipient), Xue, E. (Recipient), Zhou, C. (Recipient) & Sheng, M. (Recipient), 2021Prize Fraud Detection 100% Data Mining 50% Faculty Excellence in HDR Supervision Yang, J. (Recipient), 2019Prize ICPR 2024 Best Student Paper AwardZhang, Z. (Recipient), Li, L. (Recipient), Zhang, J. (Recipient), Hu, Z. (Recipient), Wang, H. (Recipient), Yan, C. (Recipient), Yang, J. (Recipient) & Qi, Y. (Recipient), 2024Prize Most Influential IJCAI2020 Paper Award for “Deep learning for community detection: Progress, challenges and opportunities”Liu, F. (Recipient), Xue, E. (Recipient), Wu, J. (Recipient), Zhou, C. (Recipient), Hu, W. (Recipient), Paris, C. (Recipient), Nepal, S. (Recipient), Yang, J. (Recipient) & Yu, P. S. (Recipient), 2020Prize Deep Learning Method 100% Community Detection 100% Artificial Intelligence 50%",
  "content_length": 9011,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:05"
}