{
  "name": "Jianbin Huang",
  "homepage": "https://web.xidian.edu.cn/jbhuang",
  "status": "success",
  "content": "黄健斌 | 个人信息 | 西安电子科技大学个人主页 学术信息网 西电导航 关于 使用说明 搜索 系统首页 登录 控制面板 收藏 黄健斌的留言板 黄健斌的主页:个人信息科学研究学术著作荣誉奖励学术兼职招生信息课程教学科研团队English 基本信息大数据智能计算研究中心 黄健斌，博士，教授，博士生导师 计算机科学与技术学院 CCF高级会员/ ACM会员 CCF数据库专委、模式识别与人工智能专委委员 硕士生学科：计算机软件与理论、计算机技术 博士生学科：软件工程 教育经历1999-2002 西电计算机软件与理论专业硕士2003-2007 西电模式识别与智能系统专业博士2009-2010 美国伊利诺伊大学香槟分校 计算机科学系 数据库与信息系统实验室(DAIS) 博士后2017-2018 美国加州大学圣芭芭拉分校 计算机科学系 访问学者联系方式通信地址：西安市太白南路２号西安电子科技大学61信箱邮编：710071电子邮箱：jbhuang@xidian.edu.cnjbhuang_xdu@126.com办公地点：北校区行政楼403南校区G楼519 热点新闻2019.10.05 博士周瑜的论文被数据挖掘领域权威期刊ACM Trans on TKDD录用2018.11.19 博士生杨洲的研究论文被计算机学会A类期刊IEEE Trans on TKDE录用2017.6.28 吕泽、孙晓晶的硕士毕业论文被评为校级优秀硕士学位论文二等奖2016.10.8 硕士生吕泽的研究论文被计算机学会B类期刊The Computer Journal录用2016.10.01 2014级硕士生吕泽获得国家奖学金奖励2016.09.22 博士生周瑜的研究论文被计算机学会B类期刊Journal of Computer Science and Technology录用2016.08.02 博士生周瑜的研究论文被计算机学会B类牛津大学出版社的The Computer Journal期刊录用2016.01.18 刘可的硕士论文获“校级优秀硕士学位论文一等奖”2016.01.18 万梦洁的硕士论文获得“校级优秀硕士学位论文二等奖”2016.01.15 李雁妮老师的论文被数据库领域顶级会议ICDE 2016录用2015.11.01 博士生周瑜的论文获得2015年学术年会“校级优秀论文一等奖”2015.08.24 刘可的论文被Elsevier Knowledge-Based Systems录用2015.08.08 美国加州大学圣塔芭芭拉分校的严锡峰副教授应邀来校访问并做学术报告2015.01.01 皇甫学军硕士的研究论文在IEEE Trans. on Knowledge and Data Engineering正式发表刊出研究方向主要研究领域   数据挖掘与知识发现、大数据分析与管理、网络信息检索与推荐、Web工程、机器学习 感兴趣的研究主题  图挖掘和信息网络分析  轨迹与移动数据挖掘  手机APP使用模式挖掘  软件源代码挖掘与软件缺陷检测  海量文本分析和抽取  Web实体搜索和排序  个性化信息推荐  Web信息系统研究生招生信息2017-2018年招收博士生1名，接收硕士保送生3-5名，此外招收国家统考的硕士研究生1-2名。有意者请邮件联系。 特别说明：（1）本人招收的工学博士生学科为“软件工程”、工学类硕士生学科为“计算机软件与理论”、工程硕士学科为“计算机技术”，所有博士、硕士研究生行政上归属计算机学院管理；（2）保送生和考生在网上报名时，请注意选择的方向与本人在招生简章上的研究方向完全一致，因为本校研究数据挖掘相近方向的导师有好几位，常发生报错导师的情况。欢迎以下两类学生报考：（1）专业知识扎实，数学和英语基础好，勤思考，求知欲强，做事认真负责；（2）喜欢软件开发，熟悉C++/Java/PHP等语言之一，编程能力强，工作作风踏实。实习生招生信息招收本科实习生n名。本研究组常年招收计算机科学与技术、软件工程、网络工程等相关专业的大三、大四优秀本科生（特别是有志于出国、读研、读博深造，求知欲强，对前沿科学问题研究有浓厚兴趣，喜欢算法设计和机器学习）参加科研项目实践。有意者欢迎邮件咨询、联系。 版权声明 未经西安电子科技大学以及个人主页教师本人许可，不得复制、转载和传播本页内容，禁止用于任何商业用途。如需转载请征得主页所有者同意，并附上主页链接！ 更新 黄健斌的留言板 技术支持：电院网络中心陕ICP备05016463号-3© 2025 西安电子科技大学",
  "content_length": 1890,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:06"
}