{
  "name": "Jian Pei 0001",
  "homepage": "https://sites.google.com/view/jpei/jian-peis-homepage",
  "status": "success",
  "content": "Jian Pei, Ph.D.Search this siteEmbedded FilesSkip to main contentSkip to navigationProfessor, Duke UniversityDepartment of Computer Science, Trinity College of Arts & Sciences;Department of Biostatistics and Bioinformatics, School of Medicine;Department of Electric and Computer Engineering,Pratt School of EngineeringFellowthe Royal Society of Canada (FRSC),the Canadian Academy of Engineering (CAE),ACM, and IEEEResearch Areas: data science, big data, data mining, database systems, and enterprise data strategiesPh.D. Student RecruitingI am recruiting multiple Ph.D. students at Duke University. Ambitious students with solid background and strong interest in data science, data mining, databases, data engineering, computational statistics, and their applications in healthcare, economics, climate changes, green energy, and social good are sincerely welcome to apply. I am particularly eager to look for Ph.D. students passionate about the following directions.Data markets and applicationsEnd-to-end outlier and statistical paradox detection and analysisEfficient and scalable statistical analysis in spatial and temporal applicationsCausality, interpretation, and sound and embodied data miningFemale students and students of under-represented groups in computer science and engineering are especially encouraged to apply.If interested, please submit your formal application to the Department of Computer Science, the Department of Electrical and Computer Engineering, or the Department of Biostatistics and Bioinformatics at Duke University and list me as a potential advisor. You are welcome to send me a brief introduction by email <j.pei@duke.edu>.  I will try my best to reply to those demonstrating great potential matches.Evidence of research aptitude, such as publications, working papers, project reports/descriptions, and well-written thoughts about your research interests may substantially strengthen your application. Moreover, priority will be given to students with excellent undergraduate training and proven research experience in computer science, computer engineering, and statistics.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2183,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:04"
}