{
  "name": "Jianhua He",
  "homepage": "https://www.essex.ac.uk/people/hejia61606/jianhua-he",
  "status": "success",
  "content": "Jianhua He | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Jianhua He People Professor Jianhua He Professor School of Computer Science and Electronic Engineering (CSEE) Email j.he@essex.ac.uk Location 5B.529, Colchester Campus Academic support hours My Academic Support Hours will be 2pm-3pm on Wednesday via zoom. The zoom link for this is available from my profile on my CE235 course MOODLE page. Please wait in the waiting room until I can admit you. Profile Teaching and supervision Publications Grants and funding Contact Profile Teaching and supervision Publications Grants and funding Contact Profile Biography Dr Jianhua He’s research interests cover wireless communications, mobile networking, mobile computing, Internet of Things, edge computing, connected vehicles, autonomous driving, smart cities, computer security and blockchain, machine learning and artificial intelligence, deep learning for object detection and segmentation, data analytics, OCR, document understanding and key information extraction. He has published 170+ scientific papers in these areas in leading international conferences and journals (including Mobicom, Infocom, ICC, IEEE Tran. Wireless Communication, IEEE Trans. Intelligent Transport). These papers received 4500+ citations. He filed 16 patents with 4 granted on OCR, document understanding and knowledge graph. Dr He is currently the coordinator of the EU H2020 COSAFE project on smart connected and autonomous vehicles (2018-2023) and EU H2020 VESAFE project on 5G supported collaborative autonomous driving (2021-2023). He is the principal investigator of Horizon EU project SECOM on semantic 5G vehicle communication for connected autonomous driving (2023-2025). He is the principal investigator of Horizon EU project COVER on Cooperative and Intelligent Unmanned Aerial Vehicles for Emergency Response Applications (2023-2026). He was the principle investigator of EPSRC funded DSRC based cooperative road safety project. He was a co-investigator of several other projects, including UK Mobile VCE programme Green Radio, which is one of the first projects working on the energy efficient telecommunications in the world. He has worked extensively with industry partners, including Nokia, IDIADA, Ranplan Wireless, Dr He is a Senior IEEE Member. He is an editor for the IEEE Wireless Communications Letters, Computer journal and the Frointiers in Future Transportation. He served as editor/guest editor for Mathematical, IEEE Access on Mobile Edge Computing, IEEE Access on Millimeter-Wave Communications, Wireless Communications and Mobile Computing, and International Journal of Distributed Sensor Networks. Dr He is a Steering Committee of MobiArch 2021 and 2022, which is held in conjunction with MobiCom 2021 and 2022 respectively. He is the leading co-chair of the first IEEE workshop ICAV'21 on intelligent networks of connected autonomous driving, which is held in conjunction of ICNP'21. Dr He was a Steering Committee Member of KSII Transactions on Internet and Information Systems. Dr He was TPC Chair of MobiArch2020, General Chair of ICAIT2010, ICONI2010, TPC co-chair of ICAIT2009. He is an organizer of ICDAR’19 Competition SROIE on Scanned Receipts OCR and Information Extraction, which is one of the first competition in scanned document understanding and key information extraction. Dr He was TPC member of many major international conferences in mobile communications, computing and networking, including Globecom, ICC, LCN, ICDAR, WCNC, LCN and VTC. Dr He and his research team welcome PhD applications and post-doc/fellowship applications for research in the frontier of wireless communications, mobile networks, 5G/6G, V2X, Internet of things, connected vehicles, ADAS/autonomous driving, intelligent transport, smart cities, AI/deep learning and digital twins, document understanding and intelligence. Qualifications PhD Nanyang Technological University, (2002) MEng Huazhong University of Science and Technology, BEng Huazhong University of Science and Technology, Teaching and supervision Current teaching responsibilities Computer Security (CE235) Previous supervision Han Yang Thesis title: Robust and Efficient Federated Learning Algorithms Against Adaptive Model Poisoning Attacks Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 1/5/2024 Publications Journal articles (119) Zheng, J., He, J., Chen, H-H., Yang, H. and Gao, T., Spam Call Detection with Hybrid Call ID Spoofing Detection and Cryptographic User Authentication. IEEE Communications Magazine Yang, Y., Sun, W., He, J., Fu, Y. and Xu, L., (2025). Large Generative Model-Enabled Digital Twin for 6G Networks. IEEE Network. 39 (3), 29-36 Cao, J., Leng, S., He, J. and Zhang, H., (2025). A Hierarchical Consensus Based Negotiation Scheme for Multi-platoon Cooperative Control. IEEE Internet of Things Journal. 12 (7), 8325-8337 Huang, W., Feng, H., Xu, H., Liu, X., He, J., Gan, L., Wang, X. and Wang, S., (2025). Surface Vessels Detection and Tracking Method and Datasets with Multi-Source Data Fusion in Real-World Complex Scenarios. Sensors. 25 (7), 2179-2179 Pei, D., Wu, Y., He, J., Liu, K., Chen, M., Xiao, X., Zhang, S. and Zheng, J., (2025). Methodology and Benchmark for Automated Driving Theory Test of Large Language Models. IEEE Transactions on Intelligent Transportation Systems. 26 (10), 17013-17026 Wang, X., Feng, H., Xu, H. and He, J., (2025). An adaptive radar surface vessel tracking method with interacting multiple model and gated memory. Measurement. 255, 117798-117798 He, J., Chen, H-H., Yang, K., Gao, T. and Cao, Z., (2025). Automated Spam Call Traceback: Two Efficiency Enhancement Approaches. IEEE Network, 1-1 Wu, Y., He, J., Zhang, K., Huang, X., Wu, F. and Zhang, Y., (2025). Embodied intelligence-based hybrid edge computing networks for scalable task execution in Industrial IoT. Journal of Industrial Information Integration. 47, 100916-100916 Huang, R., Zhou, S., Li, P., Yang, K., Chen, Z., He, J., Chu, X., Zhou, Z. and Zhai, G., (2025). A Sparse Transformer-Enhanced Graph Convolutional Model for Robust Node Importance Ranking in Complex Networks. IEEE Transactions on Network Science and Engineering, 1-21 Yang, Y., Ma, W., Sun, W., He, J., Fu, Y., Yuen, C. and Zhang, Y., (2025). Diffusion-based Multi-agent Reinforcement Learning for Semantic Vehicular Edge Computing. IEEE Transactions on Services Computing, 1-15 Wang, S., Xu, H., Feng, H., Wang, X., Song, P., Liu, S. and He, J., (2025). Inland waterway object detection in multi-environment: Dataset and approach. Engineering Applications of Artificial Intelligence. 162, 111994-111994 He, J., Tang, Z., Yang, K. and Chen, H-H., (2024). Matching 5G Connected Vehicles to Sensed Vehicles for Safe Cooperative Autonomous Driving. IEEE Network. 38 (3), 227-235 Wang, P., Yang, Y., Sun, W., Wang, Q., Guo, B., He, J. and Bi, Y., (2024). Federated Learning with Privacy-Preserving Incentives for Aerial Computing Networks. IEEE Transactions on Network Science and Engineering. 11 (6), 5336-5348 Yang, H., Gu, D. and He, J., (2024). A Robust and Efficient Federated Learning Algorithm Against Adaptive Model Poisoning Attacks. IEEE Internet of Things Journal. 11 (9), 16289-16302 Li, X., Yang, Y., Yuan, Z., Wang, Z., Wang, Q., Xu, C., Li, L., He, J. and Zhang, L., (2024). Progression Cognition Reinforcement Learning with Prioritized Experience for Multi-Vehicle Pursuit. IEEE Transactions on Intelligent Transportation Systems. 25 (8), 10035-10048 Feng, H., Tang, W., Xu, H., Jiang, C., Ge, SS. and He, J., (2024). Meta-learning based infrared ship object detection model for generalization to unknown domains. Applied Soft Computing. 159, 111633-111633 Wang, Y., Xu, H., Feng, H., He, J., Yang, H., Li, F. and Yang, Z., (2024). Deep reinforcement learning based collision avoidance system for autonomous ships. Ocean Engineering. 292, 116527-116527 Pei, D., He, J., Liu, K., Chen, M. and Zhang, S., (2024). Application of large language models and assessment of their ship-handling theory knowledge and skills for connected maritime autonomous surface ships. Mathematics. 12 (15), 2381-2381 Feng, H., Liu, W., Xu, H. and He, J., (2024). A lightweight dual-branch semantic segmentation network for enhanced obstacle detection in ship navigation. Engineering Applications of Artificial Intelligence. 136, 108982-108982 Xiao, X., Wang, W., He, J. and Zhang, Q., (2024). Task-Oriented Video Compressive Streaming for Real-time Semantic Segmentation. IEEE Transactions on Mobile Computing. 23 (12), 14396-14413 Du, H., Leng, S., He, J., Xiong, K. and Zhou, L., (2024). Digital twin empowered cooperative trajectory planning of platoon vehicles for collision avoidance with unexpected obstacles. Digital Communications and Networks. 10 (6), 1666-1676 Chai, H., Leng, S., He, J. and Zhang, K., (2024). Digital twin empowered lightweight and efficient blockchain for dynamic internet of vehicles. Digital Communications and Networks. 10 (6), 1698-1707 Chen, X., Len",
  "content_length": 45842,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:13"
}