{
  "name": "Jiang Hu",
  "homepage": "http://cesg.tamu.edu/faculty/jiang-hu",
  "status": "success",
  "content": "Jiang Hu Skip to main content Skip to primary sidebarSecondary MenuProfessor Department of Electrical and Computer Engineering Texas A&M University Jiang Hu received the B.S. degree in optical engineering from Zhejiang University (China) in 1990, the M.S. degree in physics in 1997 and the Ph.D. degree in electrical engineering from the University of Minnesota in 2001. He worked with IBM Microelectronics from January 2001 to June 2002. In 2002, he joined the electrical engineering faculty at Texas A&M University. His research interest is in VLSI design automation, architecture optimization, hardware security, machine learning applications and smart systems. Honors include receiving a best paper award at the ACM/IEEE Design Automation Conference in 2001, an IBM Invention Achievement Award in 2003, a best paper award at the IEEE/ACM International Conference on Computer-Aided Design in 2011, a best paper award at the IEEE International Conference on Vehicular Electronics and Safety in 2018, the best paper award in MICRO 2021, the best paper award in ASPDAC 2023 and the best paper award in MLCAD 2024. He has served as technical program committee members for DAC, ICCAD, ISPD, ISQED, ICCD, DATE, ISCAS, ASP-DAC and ISLPED. He is the general chair for the 2012 ACM International Symposium on Physical Design. He served as an associate editor of IEEE Transactions on CAD 2006-2011 and an associated editor for the ACM Transactions on Design Automation of Electronic Systems. He received the Humboldt Research Fellowship in 2012. He was named an IEEE Fellow in 2016. He received Texas A&M AgriLife Research Director’s Award in 2019 and Agricultural Blue Legacy Award in 2021. He received Hans Fischer senior fellowship in 2023. Starting from 2024, he serves as the Editor-in-Chief of ACM TODAES. He was the TPC co-chair of the ACM/IEEE International Workshop on ML CAD and now serves as the general co-chair of the ACM/IEEE International Symposium on ML CAD. SLICE: Shared machine Learning Infrastructure for the Community of EDA NSF Workshop on Shared Infrastructure for Machine Learning EDA Jiang Hu Contact Courses Publications Research Service Students and Visitors",
  "content_length": 2178,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:10"
}