{
  "name": "Jiantao Jiao",
  "homepage": "https://people.eecs.berkeley.edu/~jiantao",
  "status": "success",
  "content": "Jiantao Jiao Home About me Google Scholar Research Reports Software Group Teaching Teaching Jiantao Jiao I am an Assistant Professor in the Department of Electrical Engineering and Computer Sciences and Department of Statistics at University of California, Berkeley. I received the Ph.D. degree from Stanford University in 2018. I co-direct the Center for the Theoretical Foundations of Learning, Inference, Information, Intelligence, Mathematics, and Microeconomics at Berkeley (CLIMB). I am also a member of the Berkeley Artificial Intelligence Research (BAIR) Lab, the Berkeley Laboratory of Information and System Sciences (BLISS), and the Berkeley Center for Responsible, Decentralized Intelligence (RDI). My recent research has been focusing on generative AI and foundation models, covering the entire pipeline of data curation, pre-training, supervised fine-tuning, instruction fine-tuning, reinforcement learning with human feedback (RLHF), inference, and building security guardrails to defend against jailbreaking and prompt injection. I am also broadly interested in statistical machine learning, optimization, privacy and security of machine learning systems, reinforcement learning, the economic perspective of machine learning, and the applications of machine learning in natural language processing, code generation, computer vision, autonomous driving, and robotics. Recently, I co-founded Nexusflow, where we harness our cutting edge research to democratize GenAI agents for enterprises. Recent publications End-to-end Story Plot Generator Hanlin Zhu, Andrew Cohen, Danqing Wang, Kevin Yang, Xiaomeng Yang, Jiantao Jiao, Yuandong Tian Fine-Tuning Language Models with Advantage-Induced Policy Alignment Banghua Zhu, Hiteshi Sharma, Felipe Vieira Frujeri, Shi Dong, Chenguang Zhu, Michael I Jordan, Jiantao Jiao Pairwise Proximal Policy Optimization: Harnessing Relative Feedback for LLM Alignment Tianhao Wu, Banghua Zhu, Ruoyu Zhang, Zhaojin Wen, Kannan Ramchandran, Jiantao Jiao On Optimal Caching and Model Multiplexing for Large Model Inference Banghua Zhu, Ying Sheng, Lianmin Zheng, Clark Barrett, Michael I. Jordan, Jiantao Jiao, NeurIPS 2023 Optimal Conservative Offline RL with General Function Approximation via Augmented Lagrangian Paria Rashidinejad, Hanlin Zhu, Kunhe Yang, Stuart Russell, Jiantao Jiao, ICLR 2023 (Spotlight) Minimax Optimal Online Imitation Learning via Replay Estimation Gokul Swamy, Nived Rajaraman, Matthew Peng, Sanjiban Choudhury, J Andrew Bagnell, Zhiwei Steven Wu, Jiantao Jiao, Kannan Ramchandran, NeurIPS 2022 Bridging Offline Reinforcement Learning and Imitation Learning: A Tale of Pessimism Paria Rashidinejad, Banghua Zhu, Cong Ma, Jiantao Jiao, Stuart Russell, NeurIPS 2021 Generalized Resilience and Robust Statistics Banghua Zhu, Jiantao Jiao, Jacob Steinhardt, Annals of Statistics Robust Estimation via Generalized Quasi-gradients Banghua Zhu, Jiantao Jiao, Jacob Steinhardt, Information and Inference: A Journal of the IMA Theoretically Principled Trade-off between Robustness and Accuracy Hongyang Zhang, Yaodong Yu, Jiantao Jiao, Eric P. Xing, Laurent El Ghaoui, Michael I. Jordan, ICML 2019 (Long Oral) Contact University of California, Berkeley Department of Electrical Engineering and Computer Sciences 257M Cory Hall Berkeley, CA 94720-1770 Email: jiantao [at] cs [dot] berkeley [dot] edu Due to the large volume of emails that I receive, I generally do not respond to unsolicited inquiries about student or postdoc openings, or research advice. Nevertheless, if you have a strong quantitative background and think your interests are compatible with mine, please feel free to contact me. Page generated 2024-01-31 18:30:07 Pacific Standard Time, by jemdoc.",
  "content_length": 3729,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:17"
}