{
  "name": "Jiangchuan Liu",
  "homepage": "http://www.cs.sfu.ca/~jcliu",
  "status": "success",
  "content": "Jiangchuan Liu - Simon Fraser University ↑ Jiangchuan Liu Professor, School of Computing Science, Simon Fraser University, BC, Canada Fellow of the Royal Society of Canada Fellow of The Canadian Academy of Engineering Fellow of IEEE NSERC E.W.R. Steacie Memorial Fellow Office: TASC I 9005  |  Email: jcliu {at} sfu {dot} ca Bio (IEEE Style) Jiangchuan Liu is a Full Professor (with University Professorship) in the School of Computing Science at Simon Fraser University, British Columbia, Canada. He is a Fellow of the Royal Society of Canada, a Fellow of The Canadian Academy of Engineering, an NSERC E.W.R. Steacie Memorial Fellow, and a Fellow of IEEE. He received BEng (Magna cum laude) from Computer Science at Tsinghua University in 1999, and PhD from The Hong Kong University of Science and Technology (HKUST) in 2003 (recipient of 2004 Hong Kong Young Scientist Award for the PhD work). From 2003 to 2004, he was an Assistant Professor in the Department of Computer Science and Engineering at The Chinese University of Hong Kong. He was an EMC-Endowed Visiting Chair Professor of Tsinghua University (2013–2016) and a Distinguished Guest Professor of Tsinghua Shenzhen International Graduate School (2022–). He was also a Microsoft Research Fellow and worked at Microsoft Research Asia (MSRA) in the summers of 2000, 2001, 2002, 2007, and 2011. Research Interests Internet, wireless mobile and space networking Networked multimedia systems and applications Cloud and edge computing Energy efficient computing and smart energy systems Distributed AI systems and applications AI/Satellite-empowered wildlife monitoring in remote areas and underwater - The SalmonVision Project - SFU SalmonVision Blog Awards Fellow of the Royal Society of Canada (FRSC, Academy of Science), 2025 Fellow of The Canadian Academy of Engineering (FCAE), 2019 Fellow of IEEE, 2017 (for contributions to multimedia communications and content distribution over the Internet) University Professorship, 2015–2020 (the highest ranked professorship within SFU) HKUST CSE Distinguished Alumni Award, 2017 (Inaugural year) NSERC E.W.R. Steacie Memorial Fellowship, 2015 (NSERC's most prestigious award to young researchers in Canadian universities; 6 recipients per year from all science and engineering fields nationwide; awarded by David Johnston, Governor General of Canada) IEEE ICDCS Distinguished Paper Award, 2024 IEEE MASS Best Paper Award, 2021 Test of Time Paper Award of IEEE INFOCOM, 2015 (Inaugural year) ACM SIGMM TOMCCAP Nicolas D. Georganas Best Paper Award, 2013 ACM Multimedia Best Paper Award, 2012 Professional Services Editor/Associate Editor: IEEE/ACM ToN, IEEE TNSE, TBD, TMM, COMST, IoTJ TPC Chair: IEEE INFOCOM 2021; General Chair: IEEE INFOCOM 2024 (Vancouver) Steering Committee Member: IEEE TMC (2017-2019) Steering Committee Chair: IEEE/ACM IWQoS (2015-2017) Textbook Fundamentals of Multimedia, 3rd Edition Z. Li, M. Drew, and J. Liu Springer Texts in Computer Science Series, 2021 This 824-page textbook has been used in undergraduate and graduate multimedia courses in over 30 countries worldwide (with Chinese translated version) Recent Publications List of Publications Google Scholar Profile, Total citation: 27K+ H-index: 79 NeurIPS 2025 Quantifying the Potential of Control Algorithms through Large Language Models L. Jia, C. Li, H. Qian, T. Huang, J. Liu, and L. Sun SIGGRAPH Asia'2025 TrackerSplat: Exploiting Point Tracking for Fast and Robust Dynamic 3D Gaussians Reconstruction D. Yin, I. Ding, Y. Jin, J. Shi, and J. Liu ACM MM'2025 Generative Flow Networks for Personalized Multimedia Systems: A Case Study on Short Video Feeds Y. Jin, L. Pan, R. Zhang, J. Liu, and X. Liu ACM MM'2025 Generative AI for Multimedia Communication: Recent Advances, An Information-Theoretic Framework, and Future Opportunities Y. Jin, X. Liu, and J. Liu ACM MM'2025 Beyond Interpretability: Exploring the Comprehensibility of Adaptive Video Streaming through Large Language Models L. Jia, C. Li, Z. Yuan, J. Chen, T. Huang, J. Liu, and L. Sun SIGCOMM'2025 Towards User-level QoE: Large-scale Practice in Personalized Optimization of Adaptive Video Streaming L. Jia, C. Zhou, C. Li, J. Liu, and L. Sun IJCAI'2025 Exploring Multimodal Foundation AI and Expert-in-the-Loop for Sustainable Management of Wild Salmon Fisheries in Indigenous Rivers C. Xu, Y. Jin, S. Ma, R. Qian, H. Fang, J. Liu, X. Liu, E.C. Ngai, W.I. Atlas, K.M. Connors, and M.A. Spoljaric INFOCOM'2025 BAROC: Concealing Packet Losses in LSNs with Bimodal Behavior Awareness for Livecast Ingestion H. Zhao, J. Shi, G. Wu, H. Fang, Y. Chou, L. Chen, F. Wang, and J. Liu ICDCS'2024 Distinguished Paper Award Towards Integrated Energy-Communication-Transportation Hub: A Base-Station-Centric Design in 5G and Beyond L. Shen, G. Wu, C. Zhang, X. Fan, and J. Liu SenSys'2024 SALINA: Towards Sustainable Live Sonar Analytics in Wild Ecosystems C. Xu, R. Qian, H. Fang, X. Ma, W.I. Atlas, J. Liu, and M.A. Spoliaric ATC'2024 Enhancing Resource Management of the World's Largest PcDN system for On-Demand video streaming R. Zhang, H. Wang, S. Shi, X. Pang, Y. Peng, Z. Xue, and J. Liu ACM MM'2024 Robust Live Streaming over LEO satellite Constellations: Measurement, Analysis, and Handover-Aware Adaptation H. Fang, H. Zhao, J. Shi, M. Zhang, G. Wu, Y. Chou, F. Wang, and J. Liu ACM MM'2024 StarStream: Live Video Analytics over Space Networking M. Zhang, J. Li, H. Zhao, L. Shen, and J. Liu ACM MM'2024 FSVFG: Towards Immersive Full-scene Volumetric Video Streaming with Adaptive Feature Grid D. Yin, J. Shi, M. Zhang, Z. Huang, J. Liu, and F. Dong INFOCOM'2024 Fed-CVLC: Compressing Federated Learning Communications with Variable-Length Codes X. Su, Y. Zhou, L. Cui, J.C. Lui, and J. Liu PIEEE'2024 Cover Story Digital Phenotyping and Feature Extraction on Smartphone Data for Depression Detection M. Yang, E.C. Ngai, X. Hu, B. Hu, J. Liu, E. Gelenbe, and V.C. Leung INFOCOM'2023 Network Characteristics of LEO Satellite Constellations: A Starlink-Based Measurement from End Users S. Ma, Y. Chou, H. Zhao, L. Chen, X. Ma, and J. Liu INFOCOM'2023 OmniSense: Towards Edge-Assisted Online Analytics for 360-Degree Videos M. Zhang, Y. Zhu, L. Shen, F. Wang, and J. Liu ACM MM'2022 AggCast: Practical Cost-effective Scheduling for Large-scale Cloud-edge Crowdsourced Live Streaming R. Zhang, C. Yang, X. Wang, T. Huang, C. Wu, J. Liu, and L. Sun INFOCOM'2022 CASVA: Configuration-Adaptive Streaming for Live Video Analytics M. Zhang, F. Wang, and J. Liu INFOCOM'2022 Optimal Rate Adaption in Federated Learning with Compressed Communication L. Cui, X. Su, Y. Zhou, and J. Liu INFOCOM'2022 Batch Adaptative Streaming for Video Analytics L. Zhang, Y. Zhang, X. Wu, F. Wang, L. Cui, Z. Wang, and J. Liu MobiCom'2021 Microphone Array Backscatter: An Application-Driven Design for Lightweight Spatial Sound Recording over the Air J. Zhao, W. Gong, and J. Liu AAAI'2021 Personalized Cross-Silo Federated Learning on Non-IID Data Y. Huang, L. Chu, Z. Zhou, L. Wang, J. Liu, J. Pei, and Y. Zhang ACM MM'2021 TBRA: Tiling and Bitrate Adaptation for Mobile 360-Degree Video Streaming L. Zhang, Y. Suo, X. Wu, F. Wang, Y. Chen, L. Cui, J. Liu, and Z. Ming MMSys'2021 Towards Cloud-Edge Collaborative Online Video Analytics with Fine-Grained Serverless Pipelines M. Zhang, F. Wang, Y. Zhu, J. Liu, and Z. Wang INFOCOM'2020 Intelligent Video Caching at Network Edge: A Multi-Agent Deep Reinforcement Learning Approach F. Wang, J. Liu, Z. Wang, L. Sun INFOCOM'2020 Look Ahead at the First-mile in Livecast with Crowdsourced Highlight Prediction C. Zhang, F. Wang, J. Liu, R. Shea, and L. Sun ACM MM'2020 Leveraging QoE Heterogeneity for Large-Scale Livecast Scheduling R. Zhang, M. Ma, T. Huang, H. Li, J. Liu, and L. Sun MobiSys'2020 Towards Scalable Backscatter Sensor Mesh with Decodable Relay and Distributed Excitation J. Zhao, W. Gong, and J. Liu Teaching CMPT 365 (Undergraduate)/820 (Graduate) Multimedia Systems CMPT 371 (Undergraduate)/771 (Graduate) Computer Networking Supervised Graduates and Postdocs in Academia Jianxin Shi (2024) – Assistant Professor at Nankai University Gaoyang Liu (2024) – Assistant Professor at Huazhong University of Science and Technology Hengzhi Wang (2022) – Assistant Professor at Shenzhen University Fangxin Wang (2020) – Assistant Professor at The Chinese University of Hong Kong, Shenzhen Yifei Zhu (2020) – Associate Professor at Shanghai Jiatong University Xiulong Liu (2019) – Professor at Tianjin University Lei Zhang (2019) – Associate Professor at Shenzhen University Wei Gong (2018) – Professor at University of Science and Technology of China Jihong Yu (2018) – Professor at Beijing Institute of Technology Ryan Shea (2016) – Assistant Professor at Simon Fraser University; passed away in 2019 after a heroic battle with cancer Yang Yang (2015) – Associate Professor at Hubei University Ouldooz Baghban Karimi (2013) – Lecturer and Rajan Family Scholar at Simon Fraser University Haiyang Wang (2013) – Associate Professor at University of Minnesota at Duluth Feng Wang (2012) – Associate Professor at University of Mississippi Yanfang Zhou (2009) – Professor at Fudan University Edith C.H. Ngai (2007) – Associate Professor at University of Hong Kong; previously at Uppsala University Dan Wang (2007) – Professor at Hong Kong Polytechnic University Yuanzhu Peter Chen (2005) – Professor at Queen's University",
  "content_length": 9404,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:12"
}