{
  "name": "Jian Yao 0002",
  "homepage": "https://cvrs.whu.edu.cn/jianyao",
  "status": "success",
  "content": "姚剑 CVRS Lab 主页 成员 论文 专利 项目 活动 公告 加入我们 联系我们 English 姚剑 姚剑，湖南省涟源市人，1975年12月生。教授，博士生导师，湖北省“楚天学者”特聘教授，武汉大学遥感信息工程学院学科带头人，国家重大人才工程A类青年项目公示入选者，江西省双千计划，长沙市引进紧缺急需和战略型人才计划领军人才，武汉市3551创新创业高层次人才，武汉市光谷产业教授，百度Alpha学院2019级学员，广东开放大学人工智能学院学科带头人，广东开放大学人工智能应用创新中心主任，共达地创新技术（深圳）有限公司研究院院长，厦门大学航空航天大学兼职教授，泰国格乐大学客座教授、工程技术领域博士生导师，松花江千人产业研究院特聘研究员，武汉大学计算机视觉与遥感实验室（WHU-CVRS Lab）负责人，武汉大学3D大数据人工智能创新研究中心主任，现任中国人工智能学会理事，中国计算机学会（CCF）学会计算机视觉专业委员会委员，中国图像图形学学会成像探测与感知专委会委员，中国图像图形学会机器视觉专委委员，中国图像图形学会三维视觉专委委员，中国测绘学会大数据与人工智能工作委员会委员，AEIC学术交流中心专家委员会委员，深圳市人工智能行业协会专家委员会委员，山南市数字经济领域（信息化）专家委员会专家，湖北省暨武汉市新侨专业人士联谊会理事。2012年4月作为学科带头人引进加盟武汉大学遥感信息工程学院任教至今，2013年入选为湖北省“楚天学者”特聘教授。曾参与过欧盟第六和第七框架计划等多个大型项目，以及与国际原子能机构等合作项目。近年来，在 Pattern Recognition、Computer Vision & Image Understanding、International Journal of Robotics Research、IEEE Transactions on Image Processing, ISPRS Journal of Photogrammetry and Remote Sensing、IEEE Transactions on Geoscience and Remote Sensing (TGRS)等国际权威期刊和CVPR、ECCV、ICRA 等国际顶级学术会议上发表论文150余篇，申请国家发明专利等知识产权80余项，授权国家发明专利40余项。长期担任相关领域的国际核心期刊和顶级国际学术会议的审稿人。自加盟武汉大学即创建成立计算机视觉与遥感实验室（WHU-CVRS Lab），目前本实验室成员包括4名国内外合作导师，1名博士后，30余名博士和硕士研究生。自从成立至今，主持和参与了一系列国家 级和省部级科研项目，包括国家重点研发计划（课题负责人）、973计划（参与）、国家自然科学基金面上项目（负责人）与重点项目（参与排名第二）、湖北省科技支撑项目（负责人）、江苏省科技支撑项目（负责人）等，也与行业相关企业（腾讯、华为、阿里巴巴、滴滴、长安汽车、中核集团、中科院深圳先进院、立得空间、吉威时代、武汉尺子科技、江苏智途、深圳积木易搭、深圳见得空间、共达地、武汉轻购云、湖南桥康、顺德天行健等）开展了一系列横向科技合作和学生培养合作，目前主要研究方向包括：计算机视觉、人工智能、机器人技术、高精度地图、SLAM、导航与定位、无人驾驶、3D技术、VR/AR等。教育背景哲学博士：香港中文大学 电子工程系 2002-2006博士：华中科技大学 控制科学与工程系 2000-2002硕士：武汉大学 计算机学院 计算机应用技术 1997-2000本科：厦门大学 自动化系 系统工程 1993-1997工作经历2012年-至今、武汉大学、遥感信息工程学院、教授、博士生导师、湖北省“楚天学者”特聘教授、国家重大人才工程A类青年项目公示入选者、学术带头人2011年-2012年、研究员、博士生导师、中国科学院深圳先进技术研究院集成所智能仿生研究中心（徐杨生院士团队）2009年-2012年、研究员、欧盟委员会联合研究中心（JRC）公民保护和安全研究所（意大利Ispra）2009年-2009年、特聘副教授、广西大学计算机与电子信息学院2006年-2008年、博士后研究员、瑞士达尔·摩尔感知人工智能感应（IDIAP）研究所2006年-2006年、助理研究员、香港中文大学电子工程系2001年-2002年、研究助理、香港城市大学深圳研究院混沌加密研究小组（陈光荣讲座教授，IEEE Fellow，发展中国家科学院院士，欧洲科学院院士）教学经历本科生课程：模式识别本科生课程：人工智能导论（Introduction to Artificial Intelligence）（全英文授课）本科生课程：模式识别与计算机视觉研究生课程：LiDAR数据处理研究生课程：机器视觉与测量（Computer Vision）（全英文授课）研究生课程：航空航天摄影测量研究生课程：图像解译与模式识别联系方式地址：湖北省武汉市武昌区珞瑜路 129 号武汉大学遥感信息工程学院 5号楼 425 室（邮编：430079）Web：http://cvrs.whu.edu.cn/EMail：jian.yao@whu.edu.cn jianyao75@qq.comTel：18040585008 （微信） × 联系我们 计算机视觉与遥感实验室（CVRS Lab） 武汉大学遥感信息工程学院5号楼425室 中国湖北省武汉市洪山区珞喻路129号 Web:  http://cvrs.whu.edu.cn   http://www.scholat.com/jianyao Email:  jian.yao@whu.edu.cn  jianyao75@qq.com Phone:  +86-27-68771218 (Office)   +86-18040585008 (Mobile) Fax:  +86-27-68778086",
  "content_length": 2461,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:04"
}