{
  "name": "Jianping Pan 0001",
  "homepage": "https://webhome.cs.uvic.ca/~pan",
  "status": "success",
  "content": "Jianping Pan, PhD, FIEEE, SMACM A-Z: advising/collaborating - biography - contact - lab/mypage - publication - research - service - teaching - webb/blog if your email a@b.c was sent from domain x.y.z, it may have been eaten by spam filters! What's newest? What's newer? What's new? Courses CSc 361 (Computer Communications and Networks): Spring 2017, Fall 2015, Fall 2014, Fall 2013, Fall 2011, Spring 2011, Spring 2009, Fall 2008 CSc 466/579 (Advanced Computer Networks: Overlay and Peer-to-Peer Networking): Spring 2017, Summer 2015, Spring 2015, Fall 2013, Spring 2013, Spring 2011, Spring 2010 (586F), Spring 2009 (586B) CSc 349a (Numerical Analysis): Fall 2016 CSc 360 (Introduction to Operating Systems): Summer 2015, Fall 2014, Fall 2010, Spring 2010, Summer 2009, Fall 2007, Fall 2006, Summer 2006 CSc 461/561 (Multimedia Systems): Spring 2015, Spring 2014, Spring 2006 CSc 225 (Algorithms and Data Structures: I): Fall 2007 CSc 450/550 (Computer Communications and Networks): Summer 2007, Summer 2006 CSc 485B/586B, SEng 480B (Advanced Computer Networks): Summer 2007 CSc 591 (Graduate Directed Studies): Spring 2013 (Cloud Computing and Networking, individual), Fall 2008 (Network Support for P2P Systems, individual), Summer 2007 (Network Measurement, individual), Spring 2007 (Networking Fundamentals, group) Undergrad Directed Studies, Technical Projects, NSERC USRA, MITACS Globalink, etc MITACS Globalink: Summer 2013 (Cognitive Radio), Summer 2012 (P2P VoD), Summer 2011 (Vehicular Networks, Random Distances), Summer 2010 (Vehicular Networks) ELEC/CENG 499 (Design Project): Spring 2010 (IPTV In-Home Distribution) NSERC USRA: Summer 2009 (P2P Audio Tagging) CSc 499 (Honors Project): Spring 2014 (Redundant Array of Independent Clouds), Spring 2009 (Firewire Security), Fall 2007 (Video Streaming) SEng 490 (Directed Studies): Spring 2008 (Network Support for Online Games), Spring 2006 (NAT Traversal) CSc 490 (Directed Studies): Summer 2014 (Network Vulnerabilities), Fall 2006 (NAT Traversal and Emulation) Projects (Summary and Posters) Protocols for advanced networking: design and evaluation of link, network and transport layer protocols to support multi-party, multimedia traffic over mobile, wireless networks of various scales Cognitive and Cooperative Networking (CCN) Channel Assignment (CA) for Robust Topology Control (RTC) with Multi-Channel and Multi-Radio (MCMR) Wireless and Mobile Sensor Networks (W/MSN) Vehicular Ad-hoc Networks (VANET), Mobility and Mobile Social Networks (MSN) Performance analysis of networked systems: performance measurement, analysis, diagnosis and improvement of large-scale networked systems in new, challenging environments IPTV service provisioning and in-home distribution Video streaming over multi-hop wireless networks Video streaming over multi-link \"no-new-wires\" networks Video streaming over UWB networks Large-scale distributed systems (Web, CDN, DNS, BGP, LFN, etc) Cloud computing networks Peer-to-Peer (P2P) systems File Sharing and Video Streaming Applied network security: enhancing network security, especially on the control plane of the protocol stack, in a practical, affordable way Distributed network measurement P2P Traffic Analysis Network anomaly detection through traffic behavior analysis IEICE 2009 Best Paper Award; TAF 2010 Telesys Award SIP, DNS and BGP security Students and collaborators UVic by rankings: http://www.uvic.ca/home/about/facts-reports/ranking/ For UVic undergrads: NSERC USRA and USRA opportunities, BCNET BIC, ACM ICPC, and UVic URS If you want to do CSc/SEng 490 (Directed Studies) or CSc 499 (Technical Project) with me, drop by or make appointment for a meeting. Spring 2008: Network Support for Online Games Fall 2007: Live video streaming in Linux Fall 2006: NAT traversal and emulation Spring 2006: NAT and NAT traversal For UVic grads: CSc 591 (Directed Studies) is also available by arrangement. Also, MITACS ACCELERATE internship opportunities Fall 2008: Network Support for P2P Systems Summer 2007: Network measurement Spring 2007: Networking fundamentals For prospective grads: I am actively recruiting students who want to take graduate study at UVic. If you are interested in what I am doing (I highly encourage the applicants to take a look at my recent papers and my student's theses first) and/or you think I will be interested in what you are doing, please let me know by sending your CV and PS in PDF or TXT format through email with [app] included in the subject line. But if you are interested in graduate study at UVic, you will have to apply at UVic Graduate Admissions, so I can see your full documents (you can indicate my name if you want---finally we have an electronic system, and I can see your file easily---we now have many strong applicants ;-). Thanks. Also consider our new and popular industrial Master's program! For Canadian citizen or permanent resident (CPR), or international students interested in being nominated for Vanier Canada PhD Scholarship ($50K/year), please refer to Vanier and UVic procedures. For CPR or international PhDs interested in being nominated for Banting Postdoctoral Fellowship ($70K/year), please refer to Banting and UVic procedures ($5K/year top-up). For CPR students, also refer to NSERC PGS scholarship and PDF fellowship. For international students, also refer to NSERC IPS. For students interested in being sponsored by the China Scholarship Council (CSC) to study at or visit UVic, please refer to CSC-UVic MOU. For students interested in being sponsored by the MITACS BC-India/China/Brazil Internship Program, please refer to MITACS Globalink. Summer 2010: VANET simulation [DOI] Summer 2011: Vehicle trace analysis [PDF] Please refer to university and department admission guidelines, policies and deadlines. If you are more interested in the communications side of the networking research field, please also check UVic ECE. due to the number of inquiries we receive everyday, we can only respond to external inquiries at most once a week. sorry! © 2008 J Pan - UVic CSc - ECS 566 - (250) 472-5796 - Pan@UVic.CA - Web.UVic.CA/~pan",
  "content_length": 6116,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:18"
}