{
  "name": "Jian Li 0021",
  "homepage": "https://sdic.sjtu.edu.cn/index.php/jian-li",
  "status": "success",
  "content": "李健 (Jian Li) – Welcome to SDIC Group ！ Skip to content Basic Information 职称：研究员 Researcher 研究领域：Cloud Computing、High Perf. Networking、SmartNIC based Heterogeneous Computing， Phone： 021-34204701 Mailbox： li-jian@sjtu.edu.cn Homepage：sdic.sjtu.edu.cn Educational Background 天津大学 电子与信息工程 学士 (1997—2001) 加拿大McGill大学 助理研究员 (至2008年12月) 法国南锡第一大学 计算机科学 硕士 (2002—2003) 法国洛林理工学院 计算机科学 博士 (2003— 2007) 加拿大多伦多大学 博士后 (2007—2008） Projects 起止时间 项目名称 项目来源 合同经费 本人承担 (到款) 完成 情况 本人 角色 2020.01 ~2023.12 异构云平台中新型I/O虚拟化方法及运行支撑技术研究 自然基金面上项目 60 48 在研 主持 2016.07~2020.06 新型设备虚拟化与巨型虚拟机 科技部-重点研发计划 800 240 在研 子课题 2021/04~2022.03 新型虚拟化平台下的虚拟机监控器软件技术研究 中兴 50 15 在研 主持 2021.02~2022.01 可迁移直通I/O设备标准接口设计与基于Post-Copy的高效热迁移方法 阿里 50 15 在研 主持 2018.03                        2019.06 云计算数据中心高可用技术 万达 150 150 在研 主持 2018.11                         2021.11 下一代异构并行操作系统创新实验室合作协议 华为–交大 1854 242 在研 课题 2020.07~2021.07 密态数据库中高性能半同态加密算法研究 华为 102.5 73.9 在研 主持 2018~2019, 2019~2020, 2020~2021 QAT for Cloud Computing  acceleration and Security  Enhancement 1期 2期 3期 Intel 61.29 61.29 结题 主持 2017-09~2018-09 大数据交易市场标准化体系研制示范项目 邦盛 9.31 9.31 结题 主持 Publication: Zhuang, J. Zhao, J. Li, P. Yu, Y. Zhang and H. Guan, “HAVS: Hardware-accelerated Shared-memory-based VPP Network Stack,” IEEE INFOCOM 2021 – IEEE Conference on Computer Communications, 2021, pp. 1-10, doi: 10.1109/INFOCOM42981.2021.9488808. Zhang, Z., Zhang, H., Wang, J., Hu, X., Li, J., Yu, W., … & Guan, H. (2021)., “QKPT: Securing Your Private Keys in Cloud with Performance, Scalability and Transparency,” in IEEE Transactions on Dependable and Secure Computing, doi: 10.1109/TDSC.2021.3137403. Hu, XiaoKang and Li, Jian and Wei, Changzheng and Li, Weigang and Zeng, Xin and Yu, Ping and Guan, Haibing., “STYX: A Hierarchical Key Management System for Elastic Content Delivery Networks on Public Clouds,” in IEEE Transactions on Dependable and Secure Computing, vol. 18, no. 2, pp. 843-857, 1 March-April 2021, doi: 10.1109/TDSC.2019.2918278. Hubin Zhang, Xiaokang Hu, Jian Li, Haibing Guan, A comprehensive test framework for cryptographic accelerators in the cloud, Journal of Systems Architecture, 2020, Li et al., “QWEB: High-Performance Event-Driven Web Architecture With QAT Acceleration,” in IEEE Transactions on Parallel and Distributed Systems, vol. 31, no. 11, pp. 2633-2649, 1 Nov. 2020, doi: 10.1109/TPDS.2020.2999353. Xiaokang Hu, Jian Li, Ruhui Ma, Haibing Guan. ES2: Building an Efficient and Responsive Event Path for I/O Virtualization. IEEE Transactions on Cloud Computing, 2020. Jian Zhao, Shujun Zhuang, Jian Li, and Haibing Guan. 2020. RECANS: Low-Latency Network Function Chains with Hierarchical State Sharing. In Proceedings of the 29th International Symposium on High-Performance Parallel and Distributed Computing (HPDC ’20). Association for Computing Machinery, New York, NY, USA, 209–220. DOI:https://doi.org/10.1145/3369583.3392691 Lin L, Wei D S L, Ma R, et al. Online traffic-aware linked VM placement in cloud data centers[J]. Science China Information Sciences, 2020, 63(7): 1-23. Xiaokang Hu, Changzheng Wei, Jian Li, Brain Will, Ping Yu, Lu Gong, Haibing Guan, QTLS: High-Performance TLS Asynchronous Offload Framework with Intel QuickAssist Technology, Principles and Practice of Parallel Programming (PPoPP) Feb 16-21, 2019. Washington, DC, USA Xiaokang Hu, Fuzong Wang, Weigang Li, Jian Li, and Haibing Guan. 2019. QZFS: QAT accelerated compression in file system for application agnostic and cost efficient data storage. In Proceedings of the 2019 USENIX Conference on Usenix Annual Technical Conference (USENIX ATC ’19). USENIX Association, USA, 163–176. Jian Li, Jianmin Qian and Haibing Guan, “A Holistic Model for Performance Prediction and Optimization on NUMA-based Virtualized Systems,” IEEE INFOCOM 2019 – IEEE Conference on Computer Communications, 2019, pp. 352-360, doi: 10.1109/INFOCOM.2019.8737447. Qian, Jianmin, Li, Jian, Ma, Ruhui, & Guan, Haibing (2019). vDARM: Dynamic Adaptive Resource Management for Virtualized Multiprocessor Systems. 2019 Design, Automation & Test in Europe Conference & Exhibition (DATE), 658-661. Jianmin Qian, Jian Li, Ruhui Ma, Liwei Lin, Haibing Guan, LG-RAM: Load-aware global resource affinity management for virtualized multicore systems, Journal of Systems Architecture, Volume 98, 2019, Pages 114-125, ISSN 1383-7621, https://doi.org/10.1016/j.sysarc.2019.06.007. Lixia Chen, Jian Li, Ruhui Ma, Haibing Guan, Hans-Arno Jacobsen. COMPJ-2018-10-0794.R2 – Balancing Power and Performance in HPC Clouds. The Computer Journal, 2019. Lixia Chen, Jian Li, Ruhui Ma, Haibing Guan, and Hans-Arno Jacobsen. 2019. EnclaveCache: A Secure and Scalable Key-value Cache in Multi-tenant Clouds using Intel SGX. In Proceedings of the 20th International Middleware Conference (Middleware ’19). Association for Computing Machinery, New York, NY, USA, 14–27. Liwei Lin, Xiaodong Liu, Ruhui Ma, Jian Li, Dajin Wang, Haibing Guan, vSimilar: A high-adaptive VM scheduler based on the CPU pool mechanism, Journal of Systems Architecture, Volume 98, 2019, Pages 361-373, ISSN 1383-7621, https://doi.org/10.1016/j.sysarc.2019.02.002. Jianmin Qian, Jian Li, Ruhui Ma and Haibing Guan. Characterizing and Optimizing Virtual Resource Management in Consolidated NUMA Servers, 2018 IEEE International Conference on Computer Design (ICCD). Wang Zhang, Xiaokang Hu, Jian Li and Haibing Guan, “CoINT: Proactive Coordinator for Avoiding the Interruptability Holder Preemption Problem in VSMP Environment”, IEEE INFOCOM, Honolulu, USA. April 2018 Jianmin Qian, Jian Li and Ruhui Ma, “Topology-Aware Virtual Resource Management For Heterogeneous Multicore System” The 21st Automation and Test in Europe (DATE) conference and exhibition, Germany, 19–23 March, 2018. Changzheng Wei, Jian Li, Weigang Li, Ping Yu, and Haibing Guan. “STYX: a trusted and accelerated hierarchical SSL key management and distribution system for cloud based CDN application”. In Proceedings of the 2017 Symposium on Cloud Computing (SoCC ’17). ACM, New York, NY, USA, 201-213. Xiaokang Hu, Wang Zhang, Jian Li, Ruhui Ma, Feng Wu, Haibing Guan, “ES2: Aiming at an Optimal Virtual I/O Event Path”, 2017 46th International Conference on Parallel Processing (ICPP), 00, no. , pp. 141-150, 2017 Jinshi Zhang, Eddie Dong, Jian Li, and Haibing Guan. 2017. MigVisor: Accurate Prediction of VM Live Migration Behavior using a Working-Set Pattern Model. In Proceedings of the 13th ACM SIGPLAN/SIGOPS International Conference on Virtual Execution Environments (VEE ’17). ACM, New York, NY, USA, 30-43. DOI: https://doi.org/10.1145/3050748.3050753 Li, S. Xue, W. Zhang, r. ma, Z. Qi and h. Guan, “When I/O Interrupt Becomes System Bottleneck: Efficiency and Scalability Enhancement for SR-IOV Network Virtualization,” in IEEE Transactions on Cloud Computing, vol. PP, no. 99, pp. 1-1.doi: 10.1109/TCC.2017.2712686 Leave a commentYou must be logged in to post a comment.",
  "content_length": 6899,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:04"
}