{
  "name": "Jianfu Zhang 0003",
  "homepage": "http://www.qingyuan.sjtu.edu.cn/a/Jianfu-Zhang.html",
  "status": "success",
  "content": "Jianfu Zhang Home Introduction Overview AdminTeam AdminOffice Faculty Full time teacher Part time teacher Research Research Center Research News Fund Projects Education Graduate Program PhD Program Guozhi Class Introduction Faculty Student Column Admission Join Us News bulletin Research News Notice 中文 Home Introduction Overview AdminTeam AdminOffice Faculty Full time teacher Part time teacher Research Research Center Research News Fund Projects Education Graduate Program PhD Program Guozhi Class Introduction Faculty Student Column Admission Join Us News bulletin Research News Notice 中文 educationthe root Excellent education resources, use talents to cultivate more excellent talents. Jianfu Zhang      Assistant Professor Address：SEIEE-3-301Mailbox：c.sis@sjtu.edu.cnNumber：021-34204113 Jianfu Zhang joined Qingyuan Research Institute of Shanghai Jiao Tong University as a tenure-track assistant professor in Feb. 2023, working on generated content and trustworthy models of AI. He has published over twenty papers in top AI conferences and journals. He was a special fellow in RIKEN AIP. He received a Ph.D. degree in Computer Science from the Department of Computer Science and Engineering, Shanghai Jiao Tong University, China, in 2020. Prior to that, he received a bachelor’s degree in ACM Honored Class, Zhiyuan College, Shanghai Jiao Tong University, China, in 2015. He was honored with China National Scholarship and the “Yuanqing Yang Education Fund” Fellowship. Links Shanghai Jiao Tong University SEIEE of Shanghai Jiao Tong University Surrounding Traffic Campus Map contact us Address：800 Dongchuan Road, Minhang District, Shanghai Postcode：200240 Telephone：021 – 34204113 Mailbox：qingyuan@sjtu.edu.cn copyright © Qingyuan Research Institute of Shanghai Jiaotong University 　　Shanghai Jiaotong ICP preparation 20200349",
  "content_length": 1835,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:08"
}