{
  "name": "Jian-She Wu",
  "homepage": "https://web.xidian.edu.cn/jshwu",
  "status": "success",
  "content": "吴建设 | 个人信息 | 西安电子科技大学个人主页 学术信息网 西电导航 关于 使用说明 搜索 系统首页 登录 控制面板 收藏 吴建设的留言板 吴建设的主页:个人信息科学研究论文成果科研团队课程教学招生信息English 基本信息  吴建设 教授，硕士/博士研究生导师   硕士学科： 计算机科学与技术， 模式识别与智能系统博士学科： 计算机科学与技术工作单位： 人工智能学院联系方式办公室地点：长安校区（南校区）网安大楼CII-0808Emial: jshwu@mail.xidian.edu.cn电话:西安电子科技大学长安校区邮政101信箱人工智能学院邮编：710126研究方向智能决策课题组主要研究方向包括：1.  复杂网络、网络数据挖掘、预测与推理，图神经网络;2.  知识图谱构建、网络表示学习；3.  群体智能、博弈智能、强化学习；4.  态势感知与智能决策。 个人简介    现为西安电子科技大学智能感知与图像理解教育部重点实验室教授,博士生导师。教育部重点实验室骨干成员，教育部创新团队骨干成员，国家 “111计划” 创新引智基地骨干成员。IEEE高级会员， 中国计算机学会高级会员，中国人工智能学会智能科学专委会委员，中国指挥与控制学会网络科学与工程专委会委员，中国系统仿真学会智能物联专委会委员，中国工业与应用数学学会复杂网络专委会委员。      陕西耀县人，1992年于四川大学物理系获学士学位，2001年于西安电子科技大学电路与系统专业获硕士学位，2007年于西安电子科技大学模式识别与智能系统专业获博士学位。1. Journal of Information Security and its Applications (JCR分区：Q2,  Impact Factor: 5.6) 编委。2.  International Journal of Distributed Sensor Networks (Impact Factor: 0.727) 编委(2013.3-2016.2)。3. 数字工程与现代化（中文核心期刊，709所主办）编委。4.  2018, 2019, 2020, 2021, 2020, 2023, 2024, 2025全国复杂网络大会程序委员会委员。5. 国家自然科学基金通信评审专家、博士后特别资助基金通信评审专家。6. 是包括IEEE Transactions on Evolutionary Computation, IEEE Transactions on Cybernatics, IEEE Transactions on Industrial Electronics, IEEE Transactions on Knowledge and Data Engineering, IEEE Transactions on Circuits and Systtems, Knowledge-Based Systems, Applied Soft Computing, Physica A, Physica D,International Journal of  Modern Physics B 在内的多个国际期刊的审稿人。 是包括电子学报、物理学报、中国科学等多个国内期刊的审稿人。7. 发表SCI检索论文60余篇（详见论文成果页面）。8 主持国际自然科学基金面上项目、科技部重大专项子课题、陕西省自然科学基础研究计划面上项目、以及多项横向合作研究课题。        课题组动态2024年10月，课题组刘欣皓等五位硕士生组成的参赛队参加首届反无创新创意大赛模型/算法组大赛，以作品“基于强化学习的机动控制算法”获得最佳创意奖，获奖金一万元。2019年9月，李江涛等同学完成的工作“Large-scale Nodes Classification with Deep Aggregation Network,\" 被IEEE Transactions on Knowledge and Data Engineering 录用，IEEE Transactions on Knowledge and Data Engineering 是中科院JCR期刊分区一区期刊。2019年6月，陈子雄、李江涛及其他三位同学组成团队SleepTight，获得2019年京东杯算法大赛“用户对品类下店铺的购买预测”赛题亚军，获奖金2万元。2019年6月，16级临近毕业同学组织课题组全体老师同学参加“毕业相见终南山寨”活动，丰富大家的课余生活。2019年1月，申星和皎魁同学完成的工作“Game-based Memetic Algorithm to the Vertex Cover of Networks, \" 被IEEE Trans. on Cybernatics录用，IEEE Trans. on Cybernatics是中科院JCR期刊分区一区期刊，影响因子IF=10.387.2018年12月18，高剑与人工智能学院其他两位同学组成团队获“探寻地球密码”——天宫数据利用青年创新大赛”一等奖，获奖金3万元。2018年9月12日，中兴通信有限公司终端部张晓勇部长率科研团队来实验室协商“APP推荐”项目合作。2018年1月28日，受王龙教授邀请，吴建设在西安电子科技大学机电工程学院做了题为“Game-Based Memetic Algorithm to the Vertex Cover of Networks”的报告。2017年6月30日，受吴建设教授邀请，国际著名信息融合专家，美国新奥尔良大学李晓榕教授到访实验室，在校图书馆西裙楼三楼做题为“统计决策：常见错误与性能评估”的学术报告。2017年6月6日，赵小文同学与其他三位同学组成的参赛队获京东JDATA算法大赛冠军，获30万巨奖。 版权声明 未经西安电子科技大学以及个人主页教师本人许可，不得复制、转载和传播本页内容，禁止用于任何商业用途。如需转载请征得主页所有者同意，并附上主页链接！ 更新 吴建设的留言板 技术支持：电院网络中心陕ICP备05016463号-3© 2025 西安电子科技大学",
  "content_length": 2552,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:06"
}