{
  "name": "Jianyong Wang 0001",
  "homepage": "http://dbgroup.cs.tsinghua.edu.cn/wangjy",
  "status": "success",
  "content": "Jianyong Wang (Íõ½¨ÓÂ). Professor Department of Computer Science and Technology Tsinghua University Beijing, 100084, P.R. China Email: jianyong@tsinghua.edu.cn. Fax: +86-10-62771138 Research My research group focuses on some fundamental problems in data mining, machine learning, and artificial intelligence in health and medicine, and is partially supported by National Natural Science Foundation of China, National Key Research and Development Program of China, National Basic Research Program of China (i.e., 973 program), State Education Ministry of China, Microsoft Research, Google Inc., HP Labs Innovation Research Program, the Okawa Foundation Research Grant (Japan), Samsung Inc. (Korea), Huawei Technologies Co., Ltd,  Sohu Inc. (Sogou Inc.), and ByteDance.  Some data mining algorithms and machine learning models proposed by my research group have become the state-of-the-art approaches, typical examples include the BIDE closed sequential pattern mining algorithm, the GSDMM topic model for short text clustering, and the RRL neuro-symbolic classifier which achieves both high classification performance and good interpretability. ¡¤ Publications o   From DBLP or Google Scholar Citations o   Selected publications ¡¤ Research group Teaching Software Engineering  (Under-Graduate course, Tsinghua University) ¡¤       Autumn 2020- Data Mining: Principles and Algorithms (Graduate  course, Tsinghua University) ¡¤        Spring 2006, Spring 2007, Autumn 2007- Computer Networks and Distributed Systems (Graduate course, Peking University) ¡¤       Autumn 1999, Autumn 2000 Academic service & Membership Useful Links Journals:           TKDE, TKDD, TODS, VLDB J., DMKD, TPAMI, JMLR, ML, Bioinformatics, SIGIR, TOIS, TNNLS TWEB, JDIQ, KAIS , DKE Conferences:     SIGKDD, WWW, SIGMOD, VLDB, ICDE, NeurIPS, ICML, ICLR, IJCAI, AAAI, SIGIR, ACL ICDM, SIAM-SDM, WSDM, ECML/PKDD, EDBT, CIKM, ICDT,  EMNLP PAKDD, DEXA, DASFAA, DaWak, APWeb, WAIM Most cited papers published in SIGMOD, VLDB, and ICDE Last updated on Oct. 1, 2024",
  "content_length": 2031,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:19"
}