{
  "name": "Jianping Zeng 0001",
  "homepage": "https://jianpingzeng.github.io",
  "status": "success",
  "content": "Jianping Zeng Jianping Zeng Tenure-track Assistant Professor School of Computing and Augmented Intelligence (SCAI) Arizona State University (ASU) 660 S Mill Avenue, Tempe, AZ 85281, USA Office: CTRPT 203-05 Google Scholar DBLP jpzeng (at) asu (dot) edu Biography I am a Tenure-track Assistant Professor of Computer Science and Engineering in the School of Computing and Augmented Intelligence (SCAI) at ASU since Fall 2025. Before that, I was a computer architecture researcher in the Samsung Memory Solutions Lab (MSL) with a Ph.D. degree in Computer Science from Purdue University under the guidance of Prof. Changhee Jung. Prior to joining Purdue University, I worked as a compiler engineer with focus on optimizing GCC and Clang/LLVM compilers at Alibaba Group, China. I will take on 1-2 PhD students to start in Fall 2026, focusing on hardware/software (i.e., Compilers, Runtime, OS, and Architectures) co-design for performance, reliability, and security issues. Please email me your CV, transcript, and English test report and submit your application [here] before December 31, if you are interested in working with me. If you are already an ASU graduate student in either CSE or EECE program and would like to work with me, please shoot me an email as well. Research At ASU, I lead the Phoenix Architecture and Compiler Exploration (PACE) Lab, focusing on compilers and computer architectures. Specifically, PACE lab aims to co-design compilers and computer architectures, driven by application-level demand, addressing performance, reliability, and security issues of computing systems including energy harvesting systems and data centers. My prior research work is typically published at top-tier venues in computer architecture, high-performance computing, and programming languages, e.g., ISCA, MICRO, ICS, and PLDI. News November 2025: Congratulations to Gan on Kagura accepted to HPCA 2026! October 2025: Invited to serve on the program committee (PC) of NVMW 2026 and ICS 2026 August 2025: Officially join the Arizona State University! August 2025: Invited to serve on the program committee (PC) of ASPLOS 2026 May 2025: Invited to serve on the program committee (PC) of CGO 2026 and HPCA 2026 April 2025: Congratulations to Gan on IPEX selected as Best Paper Candidate at ISCA 2025! March 2025: Our paper about performance analysis of Samsung CMM-H accepted to IEEE Micro Special Issue. Please keep in touch for the final copy. March 2025: IPEX accepted to ISCA 2025, congratulation to Gan. This is the pride of being a mentor! March 2025: Invited to serve on the program committee (PC) of LCTES 2025 March 2025: Invited to serve on the program committee (PC) of MICRO 2025 January 2025: Invited to serve on the program committee (PC) of CF 2025 November 2024: Invited to serve on the program committee (PC) of ICS 2025 November 2024: Invited to serve on the program committee (PC) of ISCA 2025 August 2024: I will be joining the Memory Solutions Lab at Samsung Semiconductor as a Computer Architect! July 2024: Invited to join the program committee (PC) of PPoPP'25 July 2024: LightWSP accepted to MICRO 2024, congratulation to Yuchen. This is the pride of being a mentor! June 2024: I successfully defended my thesis! April 2024: VeriPipe accepted to ICS 2024 March 2024: cWSP accepted to ISCA 2024 March 2024: Receive the Merit Recognition Award from the CS department at Purdue. Big thanks to the department and my advisor! February 2024: PPA is nominated as Memorable Paper Award Finalist at NVMW 2024! February 2024: 3 papers accepted to NVMW 2024 July 2023: RTailor accepted to RTSS 2023 July 2023: PPA and SweepCache accepted to MICRO 2023 March 2023: WL-Cache accepted to ISCA 2023. Thanks a lot to my collaborators. March 2023: I will join Memory Solutions Lab (MSL) of Samsung Semiconductor, Inc as a System Architecture Intern this summer. Feb 2023: One paper accepted to NVMW 2023 April 2022: One paper accepted to NVMW 2022 March 2022: One paper accepted to HPDC 2022 March 2022: I will join the Computing Technology Lab of Alibaba Group, US this summer as a Research Intern focusing on computer architecture. July 2021: Two papers (ReplayCache and Turnpike) accepted to MICRO 2021 February 2020: One paper (Penny) accepted to PLDI 2020 Publications Intermittence-Aware Cache Compression Gan Fang, Jianping Zeng, Yuchen Zhou, and Changhee Jung [TOP-TIER] 32th International IEEE High-Performance Computer Architecture (HPCA), Sydney, Australia, January 2026. Acceptance rate: 21.1% (119 out of 563 submissions) Performance Characterizations and Usage Guidelines of Samsung CXL Memory Module Hybrid Prototype [PDF] Jianping Zeng, Shuyi Pei, Da Zhang, Yuchen Zhou, Amir Beygi, Xuebin Yao, Ramdas Kachare, Tong Zhang, Zongwang Li, Marie Nguyen, Rekha Pitchumani, Yang Seok Ki, Changhee Jung IEEE Micro Special Issue (Impact Factor: 3.6) Rethinking Prefetching for Intermittent Computing [PDF] Gan Fang, Jianping Zeng, Aditya Gupta, and Changhee Jung [TOP-TIER] 52th International ACM/IEEE Symposium on Computer Architecture (ISCA),Tokyo, Japan, June 2025. Acceptance rate: 22.3% (127 out of 570 submissions) Best Paper Honorable Mention (2 out of 570) LightWSP: Whole-System Persistence on the Cheap [PDF] Yuchen Zhou, Jianping Zeng, Changhee Jung [TOP-TIER] 57th International IEEE/ACM Symposium on Microarchitecture (MICRO), Austin, Texas, November 2024. Acceptance rate: 22.7% (113 out of 497 submissions) Compiler and Architecture Co-design for Reliable Computing [PDF] Jianping Zeng Doctoral Dissertation, Department of Computer Science, Purdue University, August 2024. Compiler-Directed Whole-System Persistence [PDF] [PPT] Jianping Zeng, Tong Zhang, Changhee Jung [TOP-TIER] 51th International ACM/IEEE Symposium on Computer Architecture (ISCA), Buenos Aires, Argentina, June 2024. Acceptance rate: 19.6% (83 out of 423 submissions) Soft Error Resilience at Near-Zero Cost [PDF] [PPT] Jianping Zeng, Shao-Yu Huang, Jiuyang Liu, Changhee Jung [TOP-TIER] 38th ACM International Conference on Supercomputing (ICS), Kyoto, Japan, June 2024. RTailor: Parameterizing Soft Error Resilience for Mixed-Criticality Real-Time Systems [PDF] Shao-Yu Huang, Jianping Zeng, Xuanliang Deng, Sen Wang, Ashrarul Haq Sifat, Burhanuddin Bharmal, Jia-Bin Huang, Ryan Williams, Haibo Zeng and Changhee Jung [TOP-TIER] 44th International IEEE Real-Time Systems Symposium (RTSS), Taipei, December 2023. Persistent Processor Architecture [PDF] [PPT] Jianping Zeng, Jungi Jeong, Changhee Jung [TOP-TIER] 56th International IEEE/ACM Symposium on Microarchitecture (MICRO), Toronto, Canada, October 2023. Acceptance rate: 23.8% (101 out of 404 submissions) Nominated as Memorable Paper Finalist in NVMW'24 SweepCache: Intermittence-Aware Cache on the Cheap [PDF] [PPT] Yuchen Zhou, Jianping Zeng, Jungi Jeong, Jongouk Choi, Changhee Jung [TOP-TIER] 56th International IEEE/ACM Symposium on Microarchitecture (MICRO), Toronto, Canada, October 2023. Acceptance rate: 23.8% (101 out of 404 submissions) Write-Light Cache for Energy Harvesting Systems [PDF] Jongouk Choi, Jianping Zeng, Dongyoon Lee, Changwoo Min, Changhee Jung [TOP-TIER] 50th International ACM/IEEE Symposium on Computer Architecture (ISCA), Orlando, USA, June 2023. Acceptance rate: 21% (79 out of 373 submissions) Capri: Compiler and Architecture Support for Whole-System Persistence [PDF] [PPT] Jungi Jeong, Jianping Zeng, Changhee Jung [TOP-TIER] 31th International ACM Symposium on High-Performance Parallel and Distributed Computing (HPDC), Minneapolis, USA, June 2022. Acceptance rate: 19% (21 out of 108 submissions) ReplayCache: Enabling Volatile Caches for Energy Harvesting Systems [PDF] [PPT] Jianping Zeng, Jongouk Choi, Xinwei Fu, Ajay P. Shreepathi, Dongyoon Lee, Changwoo Min, and Changhee Jung [TOP-TIER] 54th IEEE/ACM International Symposium on Microarchitecture (MICRO), Online, October 2021. Acceptance rate: 21.8% (94 out of 430 submissions) Turnpike: Lightweight Soft Error Resilience for In-Order Cores [PDF] [PPT] Jianping Zeng, Hongjune Kim, Jaejin Lee, and Changhee Jung [TOP-TIER] 54th IEEE/ACM International Symposium on Microarchitecture (MICRO), Online, October 2021. Acceptance rate: 21.8% (94 out of 430 submissions) Compiler-Directed Soft Error Resilience for Lightweight GPU Register File Protection [PDF] Hongjune Kim, Jianping Zeng, Qingrui Liu, Mohammad Abdel-Majeed, Jaejin Lee, and Changhee Jung [TOP-TIER] 41th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI), Online, June 2020. Acceptance rate: 22.5% (77 out of 341 submissions) Teaching At Arizona State University CSE 325: Embedded Microprocessor Systems (Spring 2026) Students Huatao Wu, PhD Student since Fall'25 Honors & Awards Best Paper Honorable Mention in ISCA 2025 Memorable Paper Finalist in NVMW 2024 Merit Recognition Award from the CS department at Purdue (top 10% among faculty, staff, post-docs, and grads) Travel Award: NVMW (2022, 2023), MICRO (2023), ISCA (2024), ICS (2024) Academic Service Organization Committee Languages, Compilers, Tools and Theory of Embedded Systems (LCTES): 2020 (Web Chair) Intl. Conference on Parallel Architectures and Compilation Techniques (PACT): 2025 (Registration Chair) Program Committee Intl. Symposium on Computer Architecture (ISCA): 2025 (LPC) Intl. Symposium on Microarchitecture (MICRO): 2025 Intl. Symposium on High Performance Computer Architecture (HPCA): 2026 Intl. Conference on Architectural Support for PLs and OSs (ASPLOS): 2026 Intl. Symposium on Code Generation and Optimization (CGO): 2026 Intl. Conference on Supercomputing (ICS): 2025-2026 Nonvolatile Memory Workshop (NVMW): 2026 Languages, Compilers, Tools and Theory of Embedded Systems (LCTES): 2025 Principles and Practice of Parallel Programming (PPoPP): 2025 Intl. Conference on Computing Frontiers (CF): 2025 Journal Reviewer ACM Trans. on Architecture and Code Optimization (TACO): 2023-2025 ACM Trans. on Embedded Computing Systems (TECS): 2024 IEEE Computer Architecture Le",
  "content_length": 10437,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:16"
}