{
  "name": "Jianhua Sun 0002",
  "homepage": "http://csee.hnu.edu.cn/people/sunjianhua",
  "status": "success",
  "content": "孙建华-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 孙建华 我的位置在： 首页 > 学院概况 > 师资力量 > 孙建华 教师介绍 教授，博导，岳麓学者，现工作于湖南大学信息科学与工程学院。主要研究方向为系统安全和网络安全，并行与分布式等领域。担任多个国际国内期刊审稿人和国际学术会议程序委员会委员。作为课题负责人主持和参与国家重点研发计划、国家重点基础研究发展计划(973计划)、国家自然科学基金、湖南省自然科学基金等国家和省部级项目10余项。以第一作者或通讯作者在VLDB、SIGMOD、USENIXATC、IEEE-TC、IEEE-TPDS、PACT、IPDPS、IWQoS、ICPP、CCGrid、中国科学、计算机研究与发展等国内外高水平计算机学术刊物上发表论文90余篇，申请国家发明专利30余项。联系邮箱：jhsun@hnu.edu.cn 中文名： 孙建华 英文名： 学历： 职称： 教授 联系电话： 电子邮件： jhsun@hnu.edu.cn 研究方向： 系统安全，网络安全，并行与分布式 联系地址： 湖南省长沙市岳麓区麓山南路2号,湖南大学信息科学与工程学院（410082） 所属机构： 网络空间安全系 学院教师 部分论文 [1] A quantitative evaluation of persistent memory hash indexes. The VLDB Journal, 2023.09（CCF A类）[2] DongTing: A large-scale dataset for anomaly detection of the Linux kernel. J. Syst. Softw(JSS), 2023 (CCF B类)[3] TEEFuzzer: A fuzzing framework for trusted execution environments with heuristic seed mutation. Future Gener.Comput. Syst(FGCS).144: 192-204 (2023) (中科院2区)[4] Halo: A Hybrid PMem-DRAM PersistentHash Index with Fast Recovery. ACM SIGMOD International Conference on Management of Data(SIGMOD), 2022: 1049-1063 (CCF A类会议)[5] TLB-pilot: Mitigating TLB Contention Attack on GPUs with Microarchitecture-Aware Scheduling. ACM Transactions on Architecture and Code Optimization (TACO), 1(19):1–23, March 2022 (CCF B类期刊) [6] Cost-Aware Performance Optimization for Mixed-Precision Neural Network Training. USENIX Annual Technical Conference 2022: 505-518(CCF A类会议)[7] Efficient Buffer Overflow Detectionon GPU. IEEE Transactions on Parallel and Distributed Systems(TPDS),2021,32(5):1161-1177. (CCF A类)[8] Address Randomization for Dynamic Memory Allocators on the GPU. Proc. of the 21st International Conference on High Performance Computing and Communications (HPCC), 2019, 570-577, (CCF C类)[9] GMOD: A Dynamic GPU Memory Overflow Detector. Proc. of the 27th International Conference on Parallel Architecturesand Compilation Techniques (PACT'18), November 1-4, 2018, Limassol, Cyprus.(CCF B类)，[10] Concurrent Hash Tables on Multicore Machines: Comparison, Evaluation and Implications. Future Generation ComputerSystems (FGCS), 82(2018):127-141[11] Optimizing Graph Processing on GPUs. IEEE Transactions on Parallel and Distributed Systems(TPDS), 2017,28(4):1149-1162.(CCF A类)[12] Redundant Network Traffic Elimination with GPU Accelerated Rabin Fingerprinting. IEEE Transactions on Parallel and Distributed Systems (TPDS), 2016, 27(7): 2130-2142. (CCF A类)[13] Coral: A Cloud-Backed Frugal File System. IEEE Transactions on Parallel and Distributed Systems (TPDS),2016,27(4): 978-991. (CCF A 类)[14] GPSA: A Graph Processing System with Actors. Proc. of the 44th International Conference on Parallel Processing(ICPP'15), September 1-4, 2015, Beijing, China. (CCF B 类)[15] BAG: Managing GPU as Buffer Cache in Operating Systems. IEEE Transactionson Parallel and Distributed Systems(TPDS), 2014, 25(6):1393-1402. (CCF A 类)[16] A Fast RPC System for Virtual Machines. IEEE Transactions on Parallel and Distributed Systems(TPDS), 2013,24(7):1267-1276. (CCF A 类)[17] vCUDA: GPU-Accelerated High Performance Computing in Virtual Machines. IEEE Transactions on Computers(TC),2012, 61(6):804-816. (CCF A 类)[18] VMRPC: A High Efficiency and Light Weight RPC System for Virtual Machines. Proc. of the 18th IEEE International Workshop on Quality of Service (IWQoS'10), June 16-18, 2010, Beijing, China.(CCF B类)[19] vCUDA: GPU Accelerated High Performance Computing in Virtual Machines. Proc. of the 23rd IEEE International Parallel and Distributed Processing Symposium(IPDPS'09), May25-29, 2009, Rome,Italy. (CCF B 类) 科研项目：1.国家自然科学基金，GPU硬件虚拟内存关键技术研究(61972137)，2020.01-2023.122.基于飞腾E2000教育开发平台的实验教学课程开发与推广，2022.03.09-2025.03.093.国产操作系统软件适配项目，2022.06.16-2024.06.15，企业合作项目4.科技部重点专项，面向图计算的通用计算机技术与系统，联合申报，2018.05-2021.045.国家自然科学基金，云环境GPU虚拟化的安全问题研究（61572179），2016.01-2019.126.国家自然科学基金，异构内存计算系统的扩展性问题研究（61772183），2018.1-2021.127.国家自然科学基金，基于程序分析方法的Web安全研究(61173166)，2012.1-2015.128.国家自然科学基金，web系统的安全分析与防御方法研究（NO. 60803130），2009.01-2011.129.湖南省自然科学基金，GPU通用计算安全虚拟化方法研究（2016JJ3042），2016.01-2019.1210.重点实验室开放基金资助课题，基于成本效益的云文件系统设计，2013.10-2014.1011.中央高校基本科研扶持基金基础研究、交叉学科基金，基于GPU异构体系结构的高性能网络安全系统，2011-201212.国家自然科学基金，GPU通用计算系统检查点方法研究(61272190)，2013.1-2016.1213.973国家重点基础研究发展计划项目子课题，GPU图形系统虚拟化方法研究，2007.07-2011.12 专利：1.      基于GPU的隐藏通道的研究方法。专利号：ZL 201811473843.82.   一种基于地址压缩技术的动态检测GPU上内存溢出的方法。专利号：ZL201711114892.8.3.      一种从Web日志中挖掘攻击频繁序列模式的方法。专利号：201610023573.54.      一种基于网络定位的负载均衡方法。专利号：ZL 200810143562.65.      一种基于动态光照图的增强现实系统光照算法。专利号：ZL 200910044517.X6.      一种基于系统调用序列的文件系统安全保护方法。申请号：202310482893.77.      基于内存隔离的文件系统安全保护方法。申请号：202310477825.18.一种基于多GPU的A*搜索方法。申请号：202010377266.39.一种GPU上的图计算数据划分方法。申请号：201911020211.010.一种基于深度学习进行JavaScript类型推断的方法。申请号：201911020317.011.一种数据驱动的敏感信息泄露检测框架。申请号：201910030202.312.基于GPU三种共享内存的隐藏通道的实现方法。申请号：201810211839.813.一种动态随机化防御Cache攻击的方法。申请号：201810252891.814.基于行为的Cache攻击检测方法。申请号：201810449942.6 讲授课程：1.本科生课程，软件安全测试[2023秋][2022秋][2021秋]2.本科生课程，网络安全原理[2018秋][2017秋][2016秋]3.研究生课程，网络攻击与防御技术[2024春][2023春][2022春] 学生培养 【欢迎编程能力强且对云计算、大模型和安全领域感兴趣的同学报考】目前有若干硕士名额和博士名额，欢迎联系1. 对科研感兴趣的学生，导师提供宽松的科研氛围和悉心指导，帮助学生拓展学术视野，提升研究能力，积累科研成果。2. 对编程实践感兴趣的学生，提供难得的参与系统软件开发的机会，这些项目在大规模真实场景落地，学生可以获得宝贵的实践经验，积累项目经验。3. 为学生提供充足的津贴待遇，以支持其学习和研究。对于能力突出的学生，津贴更具竞争力。4. 对于发表CCF知名会议论文的学生，资助其参加国际会议。5. 优秀的硕士毕业生有机会继续攻读博士学位，或推荐至知名企业实习或就业。 湖大官网 湖大微信 湖大微博 版权所有©湖南大学2017          湖南大学党委宣传部          地址：湖南省长沙市岳麓区麓山南路麓山门          邮编：410082          Email：xiaoban@hnu.edu.cn          域名备案信息：[www.hnu.edu.cn,www.hnu.cn/湘ICP备05000239号]          [hnu.cn 湘教QS3-200503-000481 hnu.edu.cn 湘教QS4-201312-010059]",
  "content_length": 5791,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:12"
}