{
  "name": "Jian Huang 0006",
  "homepage": "http://jianh.web.engr.illinois.edu",
  "status": "success",
  "content": "Jian's webpage Professor • Computer Arch • Systems Builder I am an Associate Professor and Y. T. Lo Faculty Fellow in Electrical and Computer Engineering, and an affiliated Associate Professor in Computer Science at the University of Illinois at Urbana-Champaign (UIUC). I lead the Systems Platform Research Group. I received my Ph.D. in Computer Science from Georgia Tech in August 2017. During my Ph.D study, I specialized in building storage systems for platforms spanning from wearables to mobiles to large-scale data centers. My Ph.D. dissertation received the College of Computing Dissertation Award at Georgia Tech. Most recently, I am super excited to build sustainable AI infrastructures and platforms with computer architecture and systems techniques to accelerate the AI-driven knowledge discovery and retrieval. Our research received the MICRO Best Paper Runner Up in 2024 and IEEE Micro Top Picks in 2025. We also organized the Workshop on Hot Topics in System Infrastructure (HotInfra'23 and HotInfra'24). I have been working on memory and storage systems, with a focus on their access Interface, architecture Specialization, and development Approaches (the ISA of memory and storage systems). My research received the inaugural ACM SIGMICRO Early Career Award, NSF CAREER Award, NSF CRII Award, Dean's Award for Early Innovation, IEEE Micro Top Picks, USENIX Best Paper Award, and a few industry awards. Some of them have been transferred into products and featured by popular media agencies. Research • 2023 -- present Towards Sustainable AI Infrastructure Publication • 08/20/2023 When Software-Defined Storage Meets Software-Defined Networking Publication • 08/01/2023 How to Make Unified GPU Memory/Storage Architectures Truly Usable for AI? Research • 2023 -- present Building a Learning-based Storage Ecosystem Research • 07/25/2023 How to Virtualize NPUs for Cloud Platforms? Research • 07/15/2023 The first Workshop on Hot Topics in System Infrastructure (HotInfra'23) Research • 07/15/2023 Defend Against Ransomware with Storage Innovations Award • 10/23/2025 Our ReGate work received the Best Artifact Award at MICRO'25! Publication • 09/18/2025 Two of our recent studies TeraIO and EngDesign will appear at NeurIPS'25! Publication • 07/15/2025 Our GoFS built for managing scalable direct storage accesses for GPUs will appear at SOSP'25! Publication • 07/14/2025 Two of our recent studies on AI chips: ReGate and ELK will appear at MICRO'25! Talk • 05/12/2025 I will give a keynote talk at the AI4Sys 2025 workshop! Talk • 03/02/2025 I'm honored to give a keynote talk at the 16th Annual Non-Volatile Memories Workshop! Publication • 03/01/2025 Our research on CXL-based SSDs (SkyByte) is presented at HPCA'25! Award • 02/15/2025 Our NPU virtualization work was selected as one of the IEEE Micro Top Picks!",
  "content_length": 2832,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:01"
}