{
  "name": "Jian Li 0008",
  "homepage": "https://sites.google.com/stonybrook.edu/jianli",
  "status": "success",
  "content": "Welcome to Jian Li's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationJian LiAssistant ProfessorData Science Program  Department of Applied Mathematics and StatisticsDepartment of Computer ScienceCollege of Engineering and Applied Sciences Stony Brook UniversityE-mail: jian.li.3 AT stonybrook DOT edu Short BiographyJian Li is an Assistant Professor of Data Science in the Department of Applied Mathematics and Statistics and the Department of Computer Science within the College of Engineering and Applied Sciences at Stony Brook University, State University of New York (SUNY). He is also a core faculty member of the AI Innovation Institute (AI3) and affiliated with the Institute for Advanced Computational Science (IACS). Previously, he was an assistant professor at SUNY-Binghamton, and a postdoctoral researcher at the College of Information and Computer Sciences, University of Massachusetts Amherst, hosted by Prof. Don Towsley. He received his Ph.D. in Computer Engineering from Texas A&M University in 2016 under the supervision of Prof. Srinivas Shakkottai. He also worked very closely with Prof. Vijay Subramanian from University of Michigan. He received his B.E. from Shanghai Jiao Tong University in 2012. Dr. Li is a recipient of the NSF CAREER Award (2024) and NSF CISE CRII Award (2021). His research has been recognized with several awards, including the ACM/IEEE SC'24 Best Student Paper Finalist, the ACM e-Energy'21 Best Paper Runner-Up Award and the IEEE MASCOTS'18 Best Paper Runner-Up Award. His research has been supported by NSF, ARO, NIH and DOE. Research InterestsTheory: Reinforcement Learning, Multi-Armed Bandits, Federated/Decentralized Learning, Stochastic Optimization and Control, RL with Human Feedback (RLHF) and Alignment for Large Language Models (LLMs), RL for LLM Reasoning and Agentic AI Systems and Security: Large-Scale Networked and Trustworthy Intelligent Systems including LLMs, smart health, wireless networks, edge and cloud computing, caching and content delivery, serverless computing and Internet-of-ThingsNews09/2025: [Paper] One paper accepted to NeurIPS 2025 (acceptance rate: 24.52%). 09/2025: [Grant] Our AI-driven Smart Health (SCH) Project has been funded by NIH. 08/2025: [Paper] One paper accepted to EMNLP 2025 (acceptance rate: 22.16%). 08/2025: [Service] I will serve as an Area Chair for ICLR 2026 and AISTATS 2026. 07/2025: [Award] Excellence in Teaching Award for Spring 2025.06/2025: [Service] I will serve as a Tutorial Co-Chair for ACM SIGMETRICS 2026 and a SPC for AAAI 2026.06/2025: [Talk] Delivered an invited talk at the Workshop on Frontiers in Stochastic Control and Reinforcement Learning. 05/2025: [Paper] One paper accepted to ICML 2025 (acceptance rate: 26.9%). 05/2025: [Student] My former Ph.D. student Shufan Wang honored with the Excellence in Research Award in Data Science. 03/2025: [Talk] Delivered an invited talk at the CS Department Seminar, Queens College, CUNY.02/2025: [Call for Submission] We are organizing the ACM SIGMETRICS 2025 Workshop: AI Crossroads: Systems, Energy, and Applications (Submission Deadline: 04/01/25, Workshop Date: 06/13/25)02/2025: [Service] I will serve as an Area Chair for NeurIPS 2025. 02/2025: [Talk] Delivered an invited talk at the CSE Department Seminar, University of California, Merced.02/2025: [Award] Excellence in Teaching Award for Fall 2024.02/2025: [Talk] Delivered an invited talk at Information Theory and Applications Workshop - ITA 2025. 01/2025: [Paper] Three papers accepted to ICLR 2025  (acceptance rate: 32.08%).I am actively looking for highly motivated Ph.D. students and postdocs with strong background in machine learning (particularly reinforcement learning), applied mathematics, statistics, optimization, and/or operation research, as well as  interests in applications of next-generation networked systems (e.g., wireless networks, edge and could computing) and LLMs. Please feel free to apply to either the Department of Computer Science or the Department of Applied Mathematics and Statistics and mention my name in your application if you are interested in joining our group!Report abusePage detailsPage updated Report abuse",
  "content_length": 4207,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:01"
}