{
  "name": "Jian Peng 0001",
  "homepage": "http://jianpeng.web.engr.illinois.edu",
  "status": "success",
  "content": "Jian Peng Jian Peng Associate Professor & Willett Faculty Fellow Department of Computer Science College of Medicine (by courtesy) Institute of Genomic Biology (affiliate) Cancer Center at Illinois (affiliate) National Center of Supercomputing and Applications (affiliate) University of Illinois at Urbana-Champaign Office: 2118 Siebel Center, 201 N Goodwin Ave Urbana, IL, 61801 Email: jianpeng(AT)illinois.edu Publications Research Interests Computational Biology and Medicine: Functional and Structural Genomics, Cancer Genomics, Pharmacogenomics, Neurodegenerative Diseases Machine learning: Deep Learning, Reinforcement Learning, Applications to Biology and Cheminformatics. Recent news -Jian joined the the Senior Editorial Board of Journal of Computational Biology. -Congratulations to Yunan! He will be joining CSE@Georgia Tech as an assistant professor in Jan 2022. -Jian joined the the Advisory Board of Cell Systems. -Jian is the Program Committee Chair of RECOMB 2021. -Honored to receive a collaborative grant from ASAP Research Initiative to study Parkinson's Disease via stem cells and machine learning. -Jian will be co-leading the new NSF AI institute, Molecular Maker Lab. -Congratulations to Sheng! He will be joining CS@UW-Seattle as an assistant professor in Jan 2021. -Grateful to be selected as a Donald Biggar Willett Faculty Fellow. -So humbled and honored to receive the 2020 ISCB Overton Prize. Grateful for the support from my amazing students, fantastic collaborators, and great mentors. -Thrilled and grateful to receive the 2020 Dean’s Award for Excellence in Research from Engineering@UIUC. -Congratulations to Yunan for winning the 2020 Baidu Fellowship. -Honored and grateful to receive the 2019 C.W. Gear Junior Faculty Award from CS@UIUC. -Our team QED is a winner of the IDG-DREAM Drug-Kinase Binding Prediction Challenge 2019. Selected recent awards Donald Biggar Willett Faculty Fellow Award, 2020 Overton Prize, 2020 Dean’s Award for Excellence in Research, 2020 C.W. Gear Junior Faculty Award, 2019 Teacher Ranked as Excellent by Their Students, 2019 NSF CAREER Award, 2017-2022 PhRMA Foundation Award in Informatics, 2017-2018 NCSA Faculty Fellowship, 2016 Sloan Research Fellowship, 2016",
  "content_length": 2233,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:04"
}