{
  "name": "Jianfei Cai 0001",
  "homepage": "https://research.monash.edu/en/persons/jianfei-cai",
  "status": "success",
  "content": "Jianfei Cai - Monash University View Scopus Profile Jianfei Cai Professor Professor, Department of Data Science & AI https://orcid.org/0000-0002-9444-3763 EmailJianfei.Caimonashedu Accepting PhD StudentsPhD projectsVision and language, 3D vision 1998 …2026 Research activity per year Personal profile BiographyJianfei Cai is currently a Professor at the Faculty of IT, Monash University, where he previously served as the inaugural Head of the Data Science & AI Department. Before that, he was a full professor, a cluster deputy director of the Data Science & AI Research Center (DSAIR), Head of the Visual and Interactive Computing Division, and Head of the Computer Communications Division at Nanyang Technological University (NTU). His major research interests include computer vision, multimedia, and visual computing. He has published more than 300 technical papers in international conferences and journals. He is a co-recipient of paper awards in ACCV, ICCM, IEEE ICIP, and MMSP, and the winner of Monash FIT’s Dean's Researcher of the Year Award. He is currently on the editorial board of TPAMI and IJCV. He has served as an Associate Editor for IEEE T-IP, T-MM, and T-CSVT as well as serving as Area Chair for CVPR, ICCV, ECCV, ACM Multimedia, IJCAI, ICME, ICIP, and ISCAS. He was the Chair of IEEE CAS VSPC-TC during 2016-2018. He also served as the leading TPC Chair for IEEE ICME 2012 and the best paper award committee chair/co-chair for IEEE T-MM 2020/2019. He is the leading General Chair for ACM Multimedia 2024 and a Fellow of IEEE. (Ad: Positions might be available for top PhD students and visiting students in computer vision and deep learning areas.) (Personal webpage: https://jianfei-cai.github.io/) (Google Scholar: https://scholar.google.com/citations?hl=en&user=N6czCoUAAAAJ) (Office address: Room 201-B, 20 Exhibition Walk, Clayton VIC 3800) (For DSAI Department matters, please send email to [email protected]) Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationElectrical Engineering, Doctor of Philosophy, University of Missouri ColumbiaAward Date: 19 May 2002Electrical Engineering, Master of Engineering, Southeast University (Jiangsu, China)Award Date: 24 Apr 1997Electrical Engineering, Bachelor of Engineering, Nanjing University of Aeronautics and AstronauticsAward Date: 24 Jun 1994 Research area keywordsvisual computingcomputer visionvision and language3D imaging and analysisdeep learningMultimedia Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2023 2023 2024 2034 1 Not started 3 Finished 8 Active Projects per year Can Machines Unlearn? : Can Machines Unlearn? Toward Next-Generation Safe Artificial IntelligencePhung, D. (Primary Chief Investigator (PCI)), Tafazzoli Harandi, M. (Chief Investigator (CI)), Le, T. (Chief Investigator (CI)), Zhang, J. (Chief Investigator (CI)) & Cai, J. (Chief Investigator (CI))ARC - Australian Research Council30/05/25 → 29/05/29Project: Research Adobe’s giftZhuang, B. (Primary Chief Investigator (PCI)) & Cai, J. (Chief Investigator (CI))1/02/25 → 31/01/27Project: Research Google Gift: MVSplat: Efficient 3D Gaussian Splatting from Sparse Multi-View ImagesChen, Y. (Primary Chief Investigator (PCI)) & Cai, J. (Supervisor)17/09/24 → …Project: Research Adobe Research Gift Fund: Adobe Research Gift FundCai, J. (Primary Chief Investigator (PCI))Adobe Systems Incorporated15/07/24 → 14/07/34Project: Research TMLGenAI: Trustworthy Generative AI: Towards Safe and Aligned Foundation ModelsPhung, D. (Primary Chief Investigator (PCI)), Vu, T. (Chief Investigator (CI)), Qu, L. (Chief Investigator (CI)), Le, T. (Chief Investigator (CI)), Haffari, R. (Chief Investigator (CI)), Webb, G. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)), Ke, Q. (Chief Investigator (CI)), Cai, J. (Chief Investigator (CI)) & Bui, T. (Chief Investigator (CI))11/06/24 → 10/07/26Project: Research View all 12 projects Research output Research output per year 1998 2005 2007 2008 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 2026 253 Conference Paper 133 Article 3 Editorial 2 Review Article 1 More 1 Foreword / Postscript Research output per year Research output per year Hierarchical Prompt-Enhanced Image Generation Using Hyperbolic SpaceChen, S., Pan, Z., Cai, J., Fang, P., Harandi, M. & Phung, D., 2026, Neural Information Processing - 31st International Conference, ICONIP 2024 Auckland, New Zealand, December 2–6, 2024 Proceedings, Part XI. Mahmud, M., Doborjeh, M., Wong, K., Leung, A. C. S., Doborjeh, Z. & Tanveer, M. (eds.). Singapore Singapore: Springer, p. 121-136 16 p. (Communications in Computer and Information Science; vol. 2292).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 1 Citation (Scopus) Differentiable Convex Polyhedra Optimization from Multi-view ImagesRen, D., Mei, H., Shi, H., Zheng, J., Cai, J. & Yang, L., 2025, Computer Vision – ECCV 2024 - 18th European Conference Milan, Italy, September 29–October 4, 2024 Proceedings, Part IX. Leonardis, A., Ricci, E., Roth, S., Russakovsky, O., Sattler, T. & Varol, G. (eds.). Cham Switzerland: Springer, p. 251-269 19 p. (Lecture Notes in Computer Science; vol. 15067).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Diffusion Model for Robust Multi-sensor Fusion in 3D Object Detection and BEV SegmentationLe, D.-T., Shi, H., Cai, J. & Rezatofighi, H., 2025, Computer Vision – ECCV 2024 - 18th European Conference Milan, Italy, September 29–October 4, 2024 Proceedings, Part LXVIII. Leonardis, A., Ricci, E., Roth, S., Russakovsky, O., Sattler, T. & Varol, G. (eds.). Cham Switzerland: Springer, p. 232-249 18 p. (Lecture Notes in Computer Science; vol. 15126).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 3 Citations (Scopus) Explicit Correspondence Matching for Generalizable Neural Radiance FieldsChen, Y., Xu, H., Wu, Q., Zheng, C., Cham, T. J. & Cai, J., Dec 2025, In: IEEE Transactions on Pattern Analysis and Machine Intelligence. 47, 12, p. 11708-11719 12 p.Research output: Contribution to journal › Article › Research › peer-review Fast Feedforward 3D Gaussian Splatting CompressionChen, Y., Wu, Q., Li, M., Lin, W., Harandi, M. & Cai, J., 2025, The International Conference on Learning Representations 2025. LeCun, Y. (ed.). Portland OR USA: OpenReview, p. 28308-28321 14 p. 702Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 1 Citation (Scopus) View all 392 research outputs Prizes First Place AwardSharma, G. (Recipient), Stefanov, K. (Recipient), Dhall, A. (Recipient) & Cai, J. (Recipient), 2022Prize: Prize (including medals and awards)",
  "content_length": 7358,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:08"
}