{
  "name": "Jianqing Liu",
  "homepage": "https://jianqing-liu.github.io",
  "status": "success",
  "content": "Jianqing Liu - Homepage Jianqing Liu Home Lab Research Publications Teaching Awards Activity Associate ProfessorDepartment of Computer ScienceDepartment of Electrical & Computer Engineering (courtesy)North Carolina State UniversityRaleigh, NC 27606 Email: jliu96 at ncsu dot eduPhone: +1 (919) 515-2179Office: 2401 EB III ABOUT ME I am an associate professor with the CS Department at NC State University. I received Ph.D. degree from the University of Florida in 2018 and B.Eng. degree from the University of Electronic Science and Technology of China in 2013. I am a member of IEEE and ACM. My lab's research interest is to tackle the security, data privacy, and communication & networking challenges in future communication systems such as 5G (beyond) and quantum internet. The applied methodology includes theories (e.g., optimization, control, and statistics) and experiments (e.g., reverse-engineering, system implementation, and hardware-software co-design). Our mission is to build more secure and functional communication systems for the future connected world. 2022 - present 2018 - 2022 2014 - 2018 2013 - 2014 2009 - 2013 For more information, please find me on: News! [07.2025] Papers on differential privacy and optimized GKP-based quantum sensing will appear in IEEE COINs and Quantum Week, respectively! [06.2025] Congratulations Sahil for defending his MS thesis! He will join Meta as a software engineer! [06.2025] Our paper on network slicing for satellite-terrestrial networks was accepted by IEEE Transactions on Wireless Communications! [05.2025] I was invited to serve as the editor for IEEE JSAC Quantum Series: Quantum Communications and Networking. Please consider submitting your work. [05.2025] Our paper on 4T SRAM design for differential privacy was accepted by IEEE Transactions on Circuits and Systems II! [04.2025] I will be promoted to associate professor with tenure, effective in August 2025! [03.2025] Congratulations Thinh for receiving the Quantum Computing Summer School Fellowship from Los Alamos National Laboratory (acceptance rate: 20/1,000)! [03.2025] Congratulations Raj for defending his MS thesis! ​More News... Copyright © Jianqing Liu | \"You must be the change you wish to see in the world.\" Home Lab Research Publications Teaching Awards Activity",
  "content_length": 2297,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:16"
}