{
  "name": "Jian Zhang 0004",
  "homepage": "https://www.lsu.edu/eng/cse/people/faculty/zhang.php",
  "status": "success",
  "content": "Jian Zhang | Computer Science & Engineering Skip to main content Jian Zhang Associate Professor Contact jz@lsu.edu Office 3272KPatrick F. Taylor Hall Educational Background Ph.D. in Computer Science, Yale University, 2005 M.S. in Computer Science, Yale University, 2002 M.S. in Neuroscience, Brandeis University, 2000 B.S. in Physiology and Biophysics, Peking (Beijing) University, 1997 Visit Website CSC 2730: Data Science and Analytics CSC 4700: Applied Deep Learning CSC 7343: Deep Learning Systems Machine Learning and Applications Big Data Guo, H., Peng, L., Zhang, J., Qi, F., & Duan, L. (2019, October). Hardware accelerator for adversarial attacks on deep learning neural networks. In 2019 Tenth International Green and Sustainable Computing Conference (IGSC) (pp. 1-8). IEEE. Shams, S., Platania, R., Zhang, J., Kim, J., Lee, K., & Park, S. J. (2018). Deep generative breast cancer screening and diagnosis. In Medical Image Computing and Computer Assisted Intervention–MICCAI 2018: 21st International Conference, Granada, Spain, September 16-20, 2018, Proceedings, Part II 11 (pp. 859-867). Springer International Publishing. Sun, M., Li, F., & Zhang, J. A multi-modality deep network for cold-start recommendation. Big Data Cogn. Comput. 2 (1), 7 (2018). Nix, R., & Zhang, J. (2017, May). Classification of Android apps and malware using deep neural networks. In 2017 International joint conference on neural networks (IJCNN) (pp. 1871-1878). IEEE. Shakya, S., Zhang, J., & Karki, B. (2016). ToPoMine: A graph miner for analysis of atom-dynamics simulation data in material science. Intelligent Data Analysis, 20(5), 1181-1198. Shakya, S. S., Karki, B. B., & Zhang, J. (2014). Analyzing molecular dynamics scattered data for large atomic movements. Computational materials science, 95, 198-206. Zhang, J. (2011, December). Deep transfer learning via restricted boltzmann machine for document classification. In 2011 10th International Conference on Machine Learning and Applications and Workshops (Vol. 1, pp. 323-326). IEEE. Jiang, L., Zhang, J., & Allen, G. (2010, July). Transferred correlation learning: An incremental scheme for neural network ensembles. In The 2010 international joint conference on neural networks (IJCNN) (pp. 1-8). IEEE. Zhang, J., Porras, P., & Ullrich, J. (2010). Gaussian process learning for cyber‐attack early warning. Statistical Analysis and Data Mining: The ASA Data Science Journal, 3(1), 56-68. Feigenbaum, J., Kannan, S., McGregor, A., Suri, S., & Zhang, J. (2005, January). Graph distances in the streaming model: the value of space. In SODA (Vol. 5, pp. 745-754). 2019: Best Paper Award, IEEE International Green and Sustainable Computing Conference 2008: Best Paper Award, 17th USENIX Security Conference 2025: Source: LSU Foundation, Title: Real-Time Intraoperative Mapping of Tumor Margins During Resection of Pancreatic Adenocarcinoma Using Artificial Intelligence Enabled Raman Spectroscopy, PI: Jian Zhang, $250,000. 202-2026: Source: ONR/Integer, Title: Intelligent Data Management for Distributed Naval Platforms, Co-PI: Jian Zhang, Total Amount: $5,041,697, Share: $756,254.55. 2020-2025: Source: NSF, Title: RIII Track 1: Louisiana Materials Design Alliance (LAMDA), SI: Jian Zhang, Total Amount: $10,109,552, Share: $707,668.64. Top This website uses cookies to ensure site visitors get the best experience on our website. By continuing to use this site, you accept our use of cookies and Privacy Statement. To learn more, please visit LSU Privacy Statement. I agree. Search Search Search POPULAR SEARCHES: MajorsAcademic CalendarIs the Dining Hall Food Good? FootballThings to Do on CampusHow Much is Tuition? × Video Modal ©",
  "content_length": 3686,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:06"
}