{
  "name": "Jian Ma 0004",
  "homepage": "http://www.cs.cmu.edu/~jianma",
  "status": "success",
  "content": "Jian Ma :: Carnegie Mellon School of Computer Science Skip to main content Jian Ma Ray and Stephanie Lane Professor of Computational Biology School of Computer Science Carnegie Mellon University Director, Center for AI-Driven Biomedical Research (AI4BIO) Office: GHC 7705 ∣ Phone: (412) 268-2776 AI4BIO Center Admin / Admin Assistant: Ally Ricarte Follow Us: Bluesky ∣ Twitter/X ∣ LinkedIn If you are interested in a postdoc position in the group, please reach out to me directly. Prospective PhD students should apply to Computational Biology or Machine Learning. I am the Ray and Stephanie Lane Professor of Computational Biology in the School of Computer Science at Carnegie Mellon University, where I am also an Affiliated Faculty member in Machine Learning. Our group was established at the University of Illinois at Urbana-Champaign in August 2009 and moved to Carnegie Mellon in January 2016. I have been fortunate to receive several honors, including recognition as a \"Tomorrow's PI\" by Genome Technology (2011), a National Science Foundation CAREER Award (2011), a Guggenheim Fellowship (2020), and the Allen Newell Award for Research Excellence (2025). I am an elected Fellow of ISCB, AIMBE, and AAAS. I served as Program Chair for RECOMB 2024 and currently serve as Proceedings Chair for ISMB 2026. I also serve on the Scientific Advisory Board of the Chan Zuckerberg Biohub Chicago and the RECOMB Steering Committee. Our research focuses on developing biologically grounded AI to uncover the principles of cellular organization, communication, and function, with broad implications for health and disease. Current directions include nuclear architecture, single-cell epigenomics, spatial omics, tissue dynamics, and complex molecular interactions. We develop probabilistic and deep learning models, particularly graph-based and generative approaches, to drive discovery and guide experimentation. We are also exploring biological foundation models and large language models to reveal gene regulatory mechanisms and the multiscale organization of cells within tissues. Ultimately, our goal is to learn the language of cells and harness AI to transform how we understand and model biological systems. Our lab led a Center in the NIH 4D Nucleome (4DN) Program [CMU News], where I also served as Co-Chair of the 4DN Steering Committee. In addition, our group contributes to the NIH SenNet and IGVF Consortia. We launched the Center for AI-Driven Biomedical Research (AI4BIO) [CMU News], which aims to catalyze innovations at the intersection of AI and biomedicine across the School of Computer Science and the broader CMU community. Selected Publications ▮ By topic: 3D epigenomics ∣ single-cell & tissue ∣ AI for biology ∣ comparative genomics Recent News ▮ all updates 11/27/2025. We released a series of exciting AI/ML methods for modeling cells and tissues. See preprints. 08/01/2025. Jian serves as Proceedings Chair for ISMB 2026. 04/08/2025. Jian received the Allen Newell Award for Research Excellence. 03/11/2025. Jian has been elected as an ISCB Fellow [CMU News]. 10/02/2024. We launched the Center for AI-Driven Biomedical Research (AI4BIO) [CMU News]. 08/09/2024. Interpretable ML Perspective article published in Nature Methods [CMU News]. 05/14/2024. GAGE-seq published in Nature Genetics [News & Views]. 04/08/2024. scGHOST published in Nature Methods [CMU News]. 01/31/2023. Jian is elected 2022 AAAS Fellow [CMU News]. 01/13/2023. SPICEMIX published in Nature Genetics as a Cover Story [CMU News]. 10/11/2021. Higashi published in Nature Biotechnology [CMU News]. 09/29/2021. Jian is named the Ray and Stephanie Lane Professor of Computational Biology [CMU News]. Photo from the celebration on 08/29/2022. 04/09/2020. Jian received Guggenheim Fellowship (in Computer Science) [CMU News]. Mailing Address School of Computer Science, Carnegie Mellon University 5000 Forbes Avenue, Pittsburgh, PA 15213, USA",
  "content_length": 3930,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:04"
}