{
  "name": "Jianguo Chen 0001",
  "homepage": "http://sse.sysu.edu.cn/teacher/253",
  "status": "success",
  "content": "éå»ºå½ | ä¸­å±±å¤§å­¦è½¯ä»¶å·¥ç¨å­¦é¢ ç»å½ æç´¢ é¦é¡µ å­¦é¢æ¦åµ å­¦é¢ç®ä» ç°ä»»é¢å¯¼ ç®¡çæå¡ å¸èµéä¼ ææ å¯ææ å©çææ è®²å¸/æå ç ç©¶å/å¯ç ç©¶å å¤èææ æ ¡å¤å¯¼å¸ æ°é»å¨æ å­¦æ¯ç§ç  ç§ç å¨æ ç§ç å¹³å° å­¦æ¯è®²åº§ äººæå¹å » æ¬ç§çæè² ç ç©¶çæè² å ç¾¤å·¥ä½ å å²å­¦ä¹ å å»ºå·¥ä½ å­¦çå·¥ä½ å­¦å·¥éç¥ å­¦çæ´»å¨ åäºæå äº¤æµåä½ äººææè äººæå¼è¿ éå»ºå½ è½¯ä»¶å·¥ç¨å­¦é¢ å¯ææ https://sse.sysu.edu.cn/teacher/253 çµå­é®ä»¶ chenjg33@mail.sysu.edu.cn ä¸ªäººç®ä»ï¼éå»ºå½ï¼å¯ææï¼åå£«çå¯¼å¸ï¼ä¸­å±±å¤§å­¦ç¾äººè®¡åéå¹´å­¦æ¯éª¨å¹²ãå¹¿ä¸çéå¤§äººæå·¥ç¨å ¥éè ãå ¨çTop-2%ç§å­¦å®¶æ¦åãæ¹åå¤§å­¦è®¡ç®æºç§å­¦ä¸ææ¯åå£«ï¼ç¾å½ä¼å©è¯ºä¼å¤§å­¦èåå¹å »åå£«ï¼æ¾ä»»å æ¿å¤§å¤ä¼¦å¤å¤§å­¦åå£«åï¼æ°å å¡A*STARç§æç ç©¶å±ç ç©¶ç§å­¦å®¶ã ç ç©¶æ¹åï¼ç®åä¸»è¦ç ç©¶æ¹åæ¯åå¸å¼æºè½è®¡ç®ãèé¦å­¦ä¹ ãç«¯ä¾§å¤§æ¨¡åãæ äººéç¾¤åååºç¨ãç®åå¨IEEE-TIIãIEEE-TITSãIEEE-TPDSãIEEE-TKDEãIEEE/ACM-TCBBãACM-TISTãACM-TCPSç­å½é èåæååä¼è®®ä¸åè¡¨å­¦æ¯è®ºæ70ä½ç¯ãä¸»æå½å®¶èªç¶ç§å­¦åºéé¢ä¸é¡¹ç®ãéå¹´é¡¹ç®ãåå£«åå½é äº¤æµè®¡åæ´¾åºé¡¹ç®ãå¹¿è¥¿çéç¹ç åè®¡åé¡¹ç®ãå¹¿ä¸çèªç¶ç§å­¦åºéé¢ä¸é¡¹ç®ãæ¹åçèªç¶ç§å­¦åºééå¹´é¡¹ç®ç­é¡¹ç®ãä½ä¸ºç§ç éª¨å¹²å åæ¾åä¸å½å®¶é«ææ¯ç ç©¶åå±è®¡åï¼863è®¡åï¼ãå½å®¶éç¹åºç¡ç ç©¶åå±è®¡åï¼ 973 è®¡åï¼ç­å¤é¡¹ç§ç è¯¾é¢é¡¹ç®ãæ ä»»å½é å­¦æ¯æåãNeurocomputing ãå¯ç¼è¾ããInternational Journal of Embedded Systemsãå¯ç¼è¾ããJournal of Current Scientific Researchãå¯ç¼è¾ããInformation Sciencesãå®¢åº§ç¼è¾ããNeural Computing and Applicationsãå®¢åº§ç¼è¾ï¼ä»¥åå¤ä¸ªå½é å­¦æ¯ä¼è®®çææ¯å§åä¼æåã ç ç©¶ä¸æçï¼å¨åå¸å¼æºè½è®¡ç®ãèé¦å­¦ä¹ ãç«¯ä¾§å¤§æ¨¡åãæ äººéç¾¤åååºç¨ç­æ¹åææ¶ç¡å£«ç ç©¶çååå£«ç ç©¶çãè¯¾é¢ç»ä¸ºç§ç è¡¨ç°ä¼å¼çåå­¦æä¾å¤ç§å½¢å¼çæµ·å å¤é«æ ¡åç§ç æºæçå­¦æ¯äº¤æµè®¿é®æºä¼ä»¥åå½å å¤åå¤§äºèç½å ¬å¸çå®ä¹ ä¸å·¥ä½æºä¼ï¼ä¸ºä¼ç§ç¡å£«çæä¾ç¡è½¬åè¡æ¥å¹å »æºä¼ãé¿å¹´æèåå£«åå²ãæ¬¢è¿æææ¥èçåå­¦éè¿çµå­é®ä»¶ä¸æåå¾èç³»ã çµå­é®ä»¶ï¼chenjg33@mail.sysu.edu.cn å­¦æ¯æåå¾ç¨¿ï¼Mathematicså¾ç¨¿ï¼ä¸­ç§é¢SCI 3åºï¼ï¼å¹¶è¡ä¸åå¸å¼è®¡ç®çè®ºä¸åºç¨ä¸åï¼æ¬¢è¿æç¨¿!Special Issue \"Parallel and Distributed Computing: Theory and Applications\"https://www.mdpi.com/journal/mathematics/special_issues/3GA6ZFCFD4 ç§ç é¡¹ç® 2024-2027, å½å®¶èªç¶ç§å­¦åºéé¢ä¸é¡¹ç®, 50ä¸, ä¸»æ.2024-2026, å¹¿è¥¿çéç¹ç åè®¡åé¡¹ç®å­è¯¾é¢ï¼180ä¸ï¼ä¸»æ.2023-2025, å¹¿ä¸çèªç¶ç§å­¦åºéé¢ä¸é¡¹ç®, 10ä¸, ä¸»æ.2021-2023, å½å®¶èªç¶ç§å­¦åºééå¹´é¡¹ç®, 24ä¸, ä¸»æ.2020-2021, æ¹åçèªç¶ç§å­¦åºééå¹´é¡¹ç®, 5ä¸,ä¸»æ.2018-2020, åå£«åå½é äº¤æµè®¡åæ´¾åºé¡¹ç®, 30ä¸, ä¸»æ.å­¦æ¯è®ºæ [1]     J. Chen, Q. Deng, X. Yang. Non-cooperative game algorithms for computation offloading in mobile edge computing environments. Journal of Parallel and Distributed Computing (JPDC). 2023, 172: 18-31. (IF: 4.542)[2]     J. Chen, N. Yang, Y. Pan, H. Liu, Z. Zhang. Synchronous Medical Image Augmentation Framework for Deep Learning-based Image Segmentation. Computerized Medical Imaging and Graphics. 2023, 104: 102161 (IF: 7.422)[3]     J. Chen, K. Li, P. S. Yu. Privacy-Preserving Deep Learning Model for Decentralized VANETs Using Fully Homomorphic Encryption and Blockchain. IEEE Transactions on Intelligent Transportation Systems (IEEE-TITS), 2022, 23(8): 11633 - 11642 (IF: 6.492)[4]     J. Chen, X. Yang, S. Leng, R. S. Tan, Z. Zeng, L. Zhong . MANet: Mitral Annulus Point Tracking Network in Cardiac Magnetic Resonance. IEEE International Conference on Image Processing (ICIP 2022). Accepted. 2022[5]     J. Chen, N. Yang, M. Zhou, Z. Zhang, X. Yang. A Configurable Deep Learning Framework for Medical Image Analysis. Neural Computing and Application. 2022, 34: 7375â7392 (2022) (IF: 5.606)[6]     J. Chen, K. Li, Z. Zhang, K. Li , P. S. Yu. A Survey on Applications of Artificial Intelligence in Fighting Against COVID-19. ACM Computing Surveys, 2022, 54(8): No.158, (IF: 10.282)[7]     J. Chen, P. S. Yu. A Domain Adaptive Density Clustering Algorithm for Data with Varying Density Distribution. IEEE Transactions on Knowledge and Data Engineering (IEEE-TKDE). 2021, 33(6): 2310-2321. (IF: 6.977)[8]     J. Chen, K. Li, K. Li , P. S. Yu, Z. Zeng. Dynamic Planning of Bicycle Stations in Dockless Public Bicycle-sharing System using Gated Graph Neural Network. ACM Transactions on Intelligent Systems and Technology. 2021,12(2): No.25. (IF: 4.654)[9]     J. Chen, K. Li, S. Yu, K. Li , P. S. Yu. A Coflow-oriented Partitioning Algorithm for Parallel Data Stream Processing in Distributed Computing Environments. Information Sciences. Accepted. 2021 (IF: 5.524)[10]  J. Chen, K. Li, K. Li , P. S. Yu, Z. Zeng. Dynamic Bicycle Dispatching of Dockless Public Bicycle-sharing Systems using Multi-objective Reinforcement Learning. ACM Transactions on Cyber-Physical Systems, 2021, 5(4): No. 34, (IF: 0.720)[11]  J. Chen, K. Li, Q. Deng, K. Li , P. S. Yu. Distributed Deep Learning Model for Intelligent Video Surveillance Systems with Edge Computing, IEEE Transactions on Industrial Informatics (IEEE-TII), 2019, In Press. DOI: 10.1109/TII.2019.2909473 (IF: 10.215)[12]  J. Chen, K. Li, Z. Tang , K. Bilal, S. Yu, C. Weng, K. Li . A Parallel Random Forest Algorithm for Big Data in a Spark Cloud Computing Environment. IEEE Transactions on Parallel and Distributed Systems (IEEE-TPDS). 2017, 28(4): 919-933. (IF: 3.971, Highly Cited)[13]  J. Chen, K. Li, K. Bilal, X. Zhou, K. Li , P. S. Yu. A Bi-layered Parallel Training Architecture for Large-scale Convolutional Neural Networks. IEEE Transactions on Parallel and Distributed Systems (IEEE-TPDS). 2019, 30 (5), 965 - 976. (IF: 2.600)[14]  J. Chen, K. Li, K. Bilal, A. A. Metwally, K. Li , P. S. Yu. Parallel Protein Community Detection in Large-scale PPI Networks Based on Multi-source Learning. IEEE/ACM Transactions on Computational Biology and Bioinformatics. 2018, In Press. DOI: 10.1109/TCBB.2018.2868088, (IF: 2.896)[15]  J. Chen, K. Li, H. Rong, K. Bilal, K. Li , P. S. Yu. A Periodicity-based Parallel Time Series Prediction Algorithm in Cloud Computing Environments. Information Sciences. 2019, 496, 506-537. (IF: 5.910)[16]  J. Chen, K. Li, H. Rong, K. Bilal, N. Yang, K. Li . A Disease Diagnosis and Treatment Recommendation System Based on Big Data Mining and Cloud Computing. Information Sciences. 2018, 435:124-149. (IF: 5.524)[17]  J. Chen, K. Li, Z. Tang , K. Bilal,K. Li . A Parallel Patient Treatment Time Prediction Algorithm and Its Applications in Hospital Queuing-Recommendation in a Big Data Environment. IEEE ACCESS. 2016,4: 1767-1783. (IF: 3.367)[18]  J. Peng, K. Li, J. Chen, K. Li . HEA-PAS: A Hybrid Energy Allocation Strategy for Parallel Applications Scheduling on Heterogeneous Computing Systems. Journal of Systems Architecture. 2022, 122: No. 102329 (IF: 2.552)[19]  K. N. Win, K. Li*, J. Chen*, P. F. Viger, K. Li . Fingerprint Classification and Identification Algorithms for Criminal Investigation: A survey. Future Generation Computer Systems. 2020,110: 758-771. (IF: 7.187)[20]  X. Liu, L. Yang*, J. Chen*, S. Yu, K. Li . Region-to-boundary Deep Learning Model with Multi-scale Feature Fusion for Medical Image Segmentation. Biomedical Signal Processing and Control. 2021, 27(Part A): 102165. (IF: 3.880)[21]  J. Peng, K. Li, J. Chen, K. Li . Reliability/Performance-aware Scheduling for Parallel Applications with Energy Constraints on Heterogeneous Computing Systems. IEEE Transactions on Sustainable Computing. 2022, 7(3): 681-695. (IF: 4.908)[22]  X. Liu, Y. Hu, J. Chen, K. Li . Shape and boundary-aware multi-branch model for semi-supervised medical image segmentation. Computers in Biology and Medicine. 2022, 143. No. 105252 (IF: 6.698)[23]   B. Pu, Y. Lu, J. Chen, S. Li, N. Zhu, W. Wei, K. Li. MobileUNet-FPN: A Semantic Segmentation Model for Fetal Ultrasound Four-chamber Segemation in Edge Computing Environments, IEEE Journal of Biomedical and Health Informatics, 2022. doi: 10.1109/TII.2021.3069470. (IF: 7.021).[24]  Z. Lei, K. Li, B. Pu, J. Chen, S. Li, X. Liao. An Ultrasound Standard Plane Detection Model of Fetal Head Based on Multi-task Learning and Hybrid Knowledge Graph, Future Generation Computer Systems. 2022, 135: 234-243. (IF: 7.307).[25]  B. Pu, J. Liu, Y. Kang, J. Chen, P. S. Yu. MVSTT: A Multi-View Spatial-Temporal Transformer Network for Traffic Forecasting, IEEE Transactions on Cybernetics. (IF: 19.118). 2022[26]  J. Hu, K. Li, C. Liu, J. Chen, K. Li. Coalition formation for deadline-constrained resource procurement in cloud computing. Journal of Parallel and Distributed Computing. 2021, 149:1-12 (IF: 4.542)[27]  H. Wang, Y. Zeng, J. Chen, Z. Zhao, H. Chen. A Spatiotemporal Graph Neural Network for session-based recommendation. Expert Systems with Applications. 2021, 202, No. 117114 (IF: 8.665)[28]  Y. Kang, B. Pu, Y. Kou, Y. Yang, J. Chen, M. Hijji. A deep graph network with multiple similarity for user clustering in humanâcomputer interaction. ACM Transactions on Multimedia Computing, Communications and Applications. Accepted. 2022.[29]   K. N. Win, J. Chen*, Y. Chen, P. F. Viger. PCPD: A Parallel Crime Pattern Discovery System for Large-Scale Spatiotemporal Data Based on Fuzzy Clustering. International Journal of Fuzzy Systems, 2019, 21(6): 1961-1974. (IF: 4.673)[30]   K. N. Win, J. Chen*, G. Xiao, Y. Chen, P. F. Viger. A Parallel Crime Activity Clustering Algorithm Based on Apache Spark Cloud Computing Platform. IEEE 21st International Conference on High Performance Computing and Communications (",
  "content_length": 13523,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:10"
}