{
  "name": "Jiann-Shiun Yuan",
  "homepage": "https://sites.google.com/site/yuanjs168",
  "status": "success",
  "content": "Jiann-Shiun (Peter) YuanSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeJiann-Shiun (Peter) YuanPegasus ProfessorElectrical and Computer EngineeringUniversity of Central Florida Site Director of NSF MIST CenterThe Multi-functional Integrated System Technology (MIST) Center is an NSF Industry/University Cooperative Research Center (I/UCRC) led by the University of Florida and the University of Central Florida. Jiann-Shiun Yuan received the M.S. and Ph.D. degrees from the University of Florida, Gainesville, in 1984 and 1988, respectively. He was with Texas Instruments Incorporated, Dallas, where he was involved with the 16-MB complementary metal–oxide–semiconductor dynamic random access memory design. Since 1990, after one year of industrial experience with Texas Instruments Incorporated, he has been a Faculty Member with the University of Central Florida (UCF), Orlando, where he is currently a Professor and the Director of the Secure CMOS Design and Reliability Laboratory, and the Co-Director of the NSF MIST Center. He is the author of Semiconductor Device Physics and Simulation (Plenum, 1998) and SiGe, GaAs and InP Heterojunction Bipolar Transistors (Wiley, 1999) and has authored 300 papers in journals and conference proceedings. He supervised 30 Ph.D. dissertations and 35 M.S. theses at UCF. Since 1990, he has been conducting many research projects funded by the National Science Foundation, Motorola, Harris, Lucent Technologies, National Semiconductor, and State of Florida.Dr. Yuan is a member of Eta Kappa Nu and Tau Beta Pi. He is an Editor of the IEEE Transactions on Device and Materials Reliability and a Distinguished Lecturer for the IEEE Electron Devices Society. He was the recipient of the 1993 Outstanding Engineering Educator Award, IEEE Florida Council; the 1995, 2004, 2010, and 2015 Teaching Award, UCF; the 2003 Research Award, UCF; the 2003 Outstanding Engineering Award, IEEE Orlando Section; and the 2016 Pegasus Professor Award, highest academic honor given to senior faculty at UCF.Dr. Yuan's current research interests include applied machine learning, power semiconductor devices (silicon superjunction LDMOS/VDMOS and GaN HEMTs), 3D IC Design, Deep Learning for Biomedical Applications, neuromorphic computing, secure hardware design using CMOS or emerging technologies, ultra-low power ADC design using emerging tunnel FET, flexible electronics for internet of things (IoT), RF energy harvesting/wireless power transfer, and RF circuit design for reliability and variability. Contact Information:Jiann-Shiun YuanPegasus ProfessorHarris Corporation Engineering Center, Room 423Department of Electrical and Computer EngineeringUniversity of Central FloridaPhone: (407) 823-5719E-mail: yuanj@mail.ucf.eduGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2849,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:16"
}