{
  "name": "Jianlong Wu",
  "homepage": "https://jlwu1992.github.io",
  "status": "success",
  "content": "Jianlong Wu Jianlong Wu (吴建龙) I'm Jianlong Wu, a professor and doctoral advisor in School of Computer Science and Technology, Harbin Institute of Technology(Shenzhen). I worked as an assistant professor in Shandong University from 2019 to 2022. I received my Ph.D. degree in computer vision from the ZERO Lab, School of Electronics Engineering and Computer Science, Peking University in 2019, advised by Professor Zhouchen Lin (IEEE Fellow) and Professor Hongbin Zha. In 2014, I received my bachelor's degree in electronics and information engineering from the advanced class, Huazhong University of Science and Technology (HUST). Research Interest Computer Vision, Multi-modal Learning. wujianlong@hit.edu.cn Google Scholar 中文简介 Recruit I'm recruiting self-motivated postdoctoral fellow, Ph.D. and master students who have strong mathematical abilities and coding skills to work with me on multimodal learning related research topics. Welcome to send me your detailed resume! News [2025/10] I will serve as an Associate Editor of IEEE TPAMI and TMM. [2025/09] Selected for the World's Top 2% Scientists. One paper accepted by TPAMI. [2025/07] Our work won the Zuchongzhi Outstanding Achievement Award and CVPR2025 VideoLLMs Championship. One paper accepted by TPAMI. [2025/02] Our work won the first prize of CAA Natural Science Award. Several papers were accepted by TPAMI, TMM, and TCSVT. [2024/10] I will serve as an Area Chair of CVPR 2025 and ICML 2025. Several papers were accepted by ECCV, ACM MM, and NeurIPS. [2024/03] I will serve as an Area Chair of NeurIPS 2024 and ACM MM 2024. Two papers were accepted by TPAMI. [2023/12] Won the first prize of Shandong Provincial Technological Invention Award and the Young Elite Scientists Sponsorship Program by CAST. [2023/08] Three papers were accepted by ACM MM. [2023/05] I will serve as an Area Chair of ACM Multimedia 2023. Two papers were accepted by ACL and SIGIR, respectively. [2023/03] I will serve as an Area Chair of NeurIPS 2023 and a Guest Editor of TCSVT. Two papers were accepted by CVPR and TIP, respectively. [2022/07] Three papers were accepted by TNNLS, ECCV 2022, and ACM MM 2022, respectively. [2022/02] Two papers were accepted by CVPR 2022 and three papers were accepted by IEEE Trans. Multimedia. [2021/12] Our work won the first prize of the Shandong Provincial Science and Technology Progress Award in 2021. [2021/07] Our paper received the Best Student Paper Award of SIGIR 2021. And one paper was accepted by ICCV 2021. [2021/04] One paper was accepted by PR and another paper was accepted by SIGIR 2021. [2020/09] Four papers were accepted by NeurIPS 2020, ICML 2020, SIGIR 2020, and ECCV 2020, respectively. [2019/11] Three papers were accepted by AAAI 2020. [2019/07] Two papers were accepted by ICCV 2019 with one oral presentation. [2019/05] Two papers were accepted by IEEE Trans. Image Processing and ICML 2019. Publications (* denotes equal contributions and ^ denotes corresponding author) Preprint Mamba-FSCIL: Dynamic Adaptation with Selective State Space Model for Few-Shot Class-Incremental Learning Xiaojie Li, Yibo Yang, Jianlong Wu^, Bernard Ghanem, Liqiang Nie, Min Zhang [PDF] Continuous Knowledge-Preserving Decomposition for Few-Shot Continual Learning Xiaojie Li, Yibo Yang, Jianlong Wu^, David A Clifton, Yue Yu, Bernard Ghanem, Min Zhang [PDF] ReTaKe: Reducing Temporal and Knowledge Redundancy for Long Video Understanding Xiao Wang, Qingyi Si, Jianlong Wu^, Shiyu Zhu, Li Cao, Liqiang Nie [PDF] Wkvquant: Quantizing Weight and Key/Value Cache for Large Language Models Gains More Yuxuan Yue, Zhihang Yuan, Haojie Duanmu, Sifan Zhou, Jianlong Wu^, Liqiang Nie [PDF] MegaSR: Mining Customized Semantics and Expressive Guidance for Image Super-Resolution Xinrui Li, Jianlong Wu^, Xinchuan Huang, Chong Chen, Weili Guan, Xian-Sheng Hua, Liqiang Nie [PDF] 2025 A Survey on Video Temporal Grounding with Multimodal Large Language Model Jianlong Wu, Wei Liu, Ye Liu, Meng Liu, Liqiang Nie, Zhouchen Lin, Chang Wen Chen IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025 [PDF] ClusMatch: Improving Deep Clustering by Unified Positive and Negative Pseudo-label Learning Jianlong Wu, Zihan Li, Wei Sun, Jianhua Yin, Liqiang Nie, Zhouchen Lin IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025 [PDF] Video DataFlywheel: Resolving the Impossible Data Trinity in Video-Language Understanding Xiao Wang, Jianlong Wu^, Zijia Lin, Fuzheng Zhang, Di Zhang, Liqiang Nie^ IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2025 [PDF] HAIC: Improving Human Action Understanding and Generation with Better Captions for Multi-modal Large Language Models Xiao Wang, Jingyun Hua, Weihong Lin, Yuanxing Zhang, Fuzheng Zhang, Jianlong Wu^, Di Zhang, Liqiang Nie^ The Annual Meeting of the Association for Computational Linguistics (ACL), 2025 [PDF] AdaReTaKe: Adaptive Redundancy Reduction to Perceive Longer for Video-language Understanding Xiao Wang, Qingyi Si, Jianlong Wu^, Shiyu Zhu, Li Cao, Liqiang Nie^Findings of the Annual Meeting of the Association for Computational Linguistics (ACL), 2025 [PDF] FineBadminton: A Multi-Level Dataset for Fine-Grained Badminton Video Understanding Xusheng He, Wei Liu, Shanshan Ma^, Qian Liu, Chenghao Ma, Jianlong Wu^ ACM Conference on Multimedia (ACM MM), 2025 [PDF] RA-BLIP: Multimodal Adaptive Retrieval-Augmented Bootstrapping Language-Image Pre-training Muhe Ding, Yang Ma, Pengda Qin, Jianlong Wu^, Yuhong Li, Liqiang Nie IEEE Transactions on Multimedia (TMM), 2025 [PDF] Preview-based Category Contrastive Learning for Knowledge Distillation Muhe Ding, Jianlong Wu^, Xue Dong, Xiaojie Li, Pengda Qin, Tian Gan, Liqiang Nie IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2025 [PDF] LipGen: Viseme-Guided Lip Video Generation for Enhancing Visual Speech Recognition Bowen Hao, Dongliang Zhou, Xiaojie Li, Xingyu Zhang^, Liang Xie, Jianlong Wu^, Erwei Yin IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 2025 [PDF] DKDM: Data-Free Knowledge Distillation for Diffusion Models with Any Architecture Qianlong Xiang, Miao Zhang, Yuzhang Shang, Jianlong Wu, Yan Yan, Liqiang Nie IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2025 Affordgrasp: In-context affordance reasoning for open-vocabulary task-oriented grasping in clutter Yingbo Tang, Shuaike Zhang, Xiaoshuai Hao, Pengwei Wang, Jianlong Wu, Zhongyuan Wang, Shanghang Zhang The IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2025 [PDF] 2024 GenView: Enhancing View Quality with Pretrained Generative Model for Self-supervised Learning Xiaojie Li, Yibo Yang^, Xiangtai Li, Jianlong Wu^, Yue Yu, Bernard Ghanem, Min Zhang European Conference on Computer Vision (ECCV), 2024 [PDF] Differential-Perceptive and Retrieval-Augmented MLLM for Change Captioning Xian Zhang, Haokun Wen, Jianlong Wu^, Pengda Qin, Hui Xue, Liqiang Nie^ ACM Conference on Multimedia (ACM MM), 2024 [PDF] CorDA: Context-oriented Decomposition Adaptation of Large Language Models Yibo Yang, Xiaojie Li, Zhongzhu Zhou, Shuaiwen Leon Song, Jianlong Wu, Liqiang Nie, Bernard Ghanem Advances in Neural Information Processing Systems (NeurIPS), 2024 [PDF] Detecting and Grounding Multi-modal Media Manipulation and Beyond Rui Shao, Tianxing Wu, Jianlong Wu, Liqiang Nie, Ziwei Liu IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024 [PDF] Self-Training Boosted Multi-Factor Matching Network for Composed Image Retrieval Haokun Wen, Xuemeng Song, Jianhua Yin, Jianlong Wu, Weili Guan, Liqiang Nie IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 2024 [PDF] SSCNet: Learning-based subspace clustering Xingyu Xie, Jianlong Wu, Guangcan Liu, Zhouchen Lin Visual Intelligence, 2024 [PDF] 2023 Neighbor-guided Consistent and Contrastive Learning for Semi-supervised Action Recognition Jianlong Wu, Wei Sun, Tian Gan, Ning Ding, Feijun Jiang, Jialie Shen, Liqiang Nie IEEE Transactions on Image Processing (TIP), 2023 [PDF] CHMATCH: Contrastive Hierarchical Matching and Robust Adaptive Threshold Boosted Semi-Supervised Learning Jianlong Wu, Haozhe Yang, Tian Gan, Ning Ding, Feijun Jiang, Liqiang Nie IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), 2023 [PDF] Self-adaptive Context and Modal-interaction Modeling For Multimodal Emotion Recognition Haozhe Yang, Xianqiang Gao, Jianlong Wu^, Tian Gan, Ning Ding, Feijun Jiang, Liqiang Nie Findings of the Annual Meeting of the Association for Computational Linguistics (ACL), 2023 [PDF] Fine-grained Key-Value Memory Enhanced Predictor for Video Representation Learning Xiaojie Li, Jianlong Wu^, Shaowei He, Kang Shuo, Yue Yu, Liqiang Nie, Min Zhang ACM Conference on Multimedia (ACM MM), 2023 [PDF] Temporal Sentence Grounding in Streaming Videos Tian Gan, Xiao Wang, Yan Sun, Jianlong Wu^, Qingpei Guo, Liqiang Nie ACM Conference on Multimedia (ACM MM), 2023 [PDF] Mask Again: Masked Knowledge Distillation for Masked Video Modeling Xiaojie Li, Shaowei He, Jianlong Wu^, Yue Yu, Liqiang Nie^, Min Zhang ACM Conference on Multimedia (ACM MM), 2023 [PDF] Semantic-aware Modular Capsule Routing for Visual Question Answering Yudong Han, Jianhua Yin, Jianlong Wu, Yinwei Wei, Liqiang Nie IEEE Transactions on Image Processing (TIP), 2023 [PDF] SNP-S3: Shared Network Pre-training and Significant Semantic Strengthening for Various Video-Text Tasks Xingning Dong, Qingpei Guo, Tian Gan, Qing Wang, Jianlong Wu, Xiangyuan Ren, Yuan Cheng, Wei Chu IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2023 [PDF] Multi-Granularity Interaction and Integration Network for Video Question Answering Yuanyuan Wang, Meng Liu, Jianlong Wu, Liqiang Nie IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2023 [PDF] OFAR: A Multimodal Evidence Retrieval Framework for Illegal Live-streaming Identification Dengtian Lin, Yang Ma,",
  "content_length": 19169,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:15"
}