{
  "name": "Jianbo Jiao",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/jiao-jianbo.aspx",
  "status": "success",
  "content": "Dr Jianbo Jiao | University of Birmingham. - University of Birmingham Dr Jianbo Jiao PhD, FHEA, MIEEE School of Computer ScienceAssociate Professor in Computer Science Contact details Emailj.jiao@bham.ac.uk View my research portal AddressUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Jianbo Jiao is an Associate Professor in Computer Vision and Machine Learning in the School of Computer Science at University of Birmingham. where he leads the MIx (Machine Intelligence + x) group. Before joining Birmingham, he was a Postdoctoral Researcher in the Biomedical Image Analysis (BioMedIA) group and the Visual Geometry Group (VGG) at the University of Oxford, working on the projects SeeBiByte and VisualAI. His research is mainly about Computer Vision and Machine Learning, especially on learning from limited supervision and multi-modal data, in an open world. For more information, please visit Dr Jianbo Jiao’s homepage and his group page. Jianbo’s research interests include Computer Vision and Machine Learning, with their applications to challenging and interesting vision and healthcare problems. He obtained his MSc from Peking University in 2015, and PhD in Computer Science from City University of Hong Kong in 2018, supported by the Hong Kong PhD Fellowship Scheme. He was a visiting scholar with the Beckman Institute at the University of Illinois at Urbana-Champaign from 2017 to 2018, working with Prof Thomas S. Huang. After that, He joined the BioMedIA group and VGG in Oxford as a postdoctoral researcher, where he worked on the EPSRC projects SeeBiByte and VisualAI with Prof Alison Noble and Prof Andrew Zisserman. Jianbo is leading the MIx (Machine Intelligence + x) group, a Fellow of the Higher Education Academy (FHEA), and was a Royal Society Short Industry Fellow, a recipient of the Amazon Research Award. He has been consistently publishing at top venues in computer vision and machine learning (e.g. ICCV/CVPR/ECCV/BMVC/TPAMI/IJCV/NeurIPS/AAAI, etc.), and holds 3 patents. He has also been actively contributing to the community, and served as the Associate Editor for The Transactions on Machine Learning Research (TMLR), IEEE Transactions on Circuits and Systems for Video Technology (T-CSVT), The Visual Computer (International Journal of Computer Graphics), Co-Chair of the 25th Annual Conference on Medical Image Understanding and Analysis (MIUA), Area Chair of various leading international conferences (e.g. NeurIPS, ICML, ICLR, ACM MM, etc.), Senior Program Committee member of the 30th International Joint Conference on Artificial Intelligence (IJCAI), and on the program committee of several leading international conferences and journals. He has also been recognised by several Outstanding Reviewer Awards from the leading conferences and journals (e.g. CVPR, ECCV, ICCV, NeurIPS, ICML and MICCAI, etc). Computer Vision Machine Learning Healthcare AI4Science Jianbo’s research interests include Computer Vision, Machine Learning, Healthcare, and AI4Science. His current research interests mainly focus on learning representations in the open world, by exploring auxiliary information from different modalities (e.g. image/video, speech/audio, text/NLP, depth/stereo, gaze/saliency, motion, etc.) and reducing the dependency on supervision (e.g. self-supervised/weakly-supervised/semi-supervised learning, transfer learning). More information with an updated publication list please see his Google Scholar profile. Recent publications Article Liang, J, Xu, Y, Song, H, Lu, Y, Deng, Y, Long, Y, Huang, Y, Liu, S, Jiao, J & He, S 2025, 'ContX: Scene context prediction via context bank and layout perception', Pattern Recognition, vol. 168, 111852. https://doi.org/10.1016/j.patcog.2025.111852 Gao, G, Zhang, A, Jiao, J, Liu, CH & Wei, Y 2025, 'PRFormer: Matching Proposal and Reference Masks by Semantic and Spatial Similarity for Few-Shot Semantic Segmentation', IEEE Transactions on Circuits and Systems for Video Technology. https://doi.org/10.1109/TCSVT.2025.3550879 Wu, W, Leonardis, A, Jiao, J, Jiang, J & Chen, L 2025, 'Transformer-Based Models for Predicting Molecular Structures from Infrared Spectra Using Patch-Based Self-Attention', Journal of Physical Chemistry A, vol. 129, no. 8, pp. 2077–2085. https://doi.org/10.1021/acs.jpca.4c05665 Jiao, J, Alsharid, M, Drukker, L, Papageorghiou, AT, Zisserman, A & Noble, JA 2024, 'Audio-visual modelling in a clinical setting', Scientific Reports, vol. 14, no. 1, 15569. https://doi.org/10.1038/s41598-024-66160-4 Conference contribution Li, H & Jiao, J 2025, An Explorative Study on Abstract Images and Visual Representations Learned from Them. in British Machine Vision Conference. Hu, H, Lin, D, Huang, Q, Hou, Y, Chang, HJ & Jiao, J 2025, Audio-Visual Separation with Hierarchical Fusion and Representation Alignment. in British Machine Vision Conference. Zhang, K, Jiao, J & Noble, JA 2025, Out-of-Clinical-Distribution Detection with a Softmax-Conditioned Variational Autoencoder Regulariser: Application to Fetal Ultrasound. in R Su, AF Frangi & Y Zhang (eds), Proceedings of 2024 International Conference on Medical Imaging and Computer-Aided Diagnosis (MICAD 2024): Medical Imaging and Computer-Aided Diagnosis. 1 edn, Lecture Notes in Electrical Engineering, vol. 1372, Springer, pp. 558-568, 5th International Conference on Medical Imaging and Computer Aided Diagnosis, MICAD 2024, Manchester, United Kingdom, 19/11/24. https://doi.org/10.1007/978-981-96-3863-5_51 Huang, Q, Hu, H & Jiao, J 2025, Revisit the open nature of open vocabulary segmentation. in The Thirteenth International Conference on Learning Representations: ICLR 2025. Thirteenth International Conference on Learning Representations, Singapore, Singapore, 24/04/25. <https://openreview.net/forum?id=2vHIHrJAcI> Sun, Q, Huang, Q, Yang, Y, Wang, H & Jiao, J 2025, What Can We Learn from Harry Potter? An Exploratory Study of Visual Representation Learning from Atypical Videos. in British Machine Vision Conference. Chen, H, Hou, Y, Qu, C, Testini, I, Hong, X & Jiao, J 2024, 360 + x: A Panoptic Multi-modal Scene Understanding Dataset. in 2024 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR). Conference on Computer Vision and Pattern Recognition (CVPR), IEEE, pp. 19373-19382, 2024 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Seattle, Washington, United States, 17/06/24. https://doi.org/10.1109/CVPR52733.2024.01833 Zhang, A, Gao, G, Jiao, J, Liu, CH & Wei, Y 2024, Bridge the Points: Graph-based Few-shot Segment Anything Semantically. in Advances in Neural Information Processing Systems 37 (NeurIPS 2024). Advances in neural information processing systems, NeurIPS, Thirty-Eighth Annual Conference on Neural Information Processing Systems, Vancouver, British Columbia, Canada, 10/12/24. <https://proceedings.neurips.cc/paper_files/paper/2024/hash/3a2ef31a1e45908901adc0ca853a8faf-Abstract-Conference.html> Kang, B, Zhang, Y, Xiong, Y, Jia, X, Jiao, J & Li, J 2024, Bridging the Gap: Cross-modal Knowledge Driven Network for Radiology Report Generation. in X Jiang, H Wang, R Alhajj, X Hu, F Engel, M Mahmud, N Pisanti, X Cui & H Song (eds), 2023 IEEE International Conference on Bioinformatics and Biomedicine (BIBM)., 10385967, IEEE International Conference on Bioinformatics and Biomedicine (BIBM), IEEE, pp. 1202-1209, 2023 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), 5/12/23. https://doi.org/10.1109/BIBM58861.2023.10385967 Xiong, K, Peng, R, Zhang, Z, Feng, T, Jiao, J, Gao, F & Wang, R 2024, CL-MVSNet: Unsupervised Multi-view Stereo with Dual-level Contrastive Learning. in 2023 IEEE/CVF International Conference on Computer Vision (ICCV)., 10376500, International Conference on Computer Vision (ICCV), IEEE, pp. 3746-3757, 2023 International Conference on Computer Vision, Paris, France, 2/10/23. https://doi.org/10.1109/ICCV51070.2023.00349 Zhang, Z, Gao, G, Jiao, J, Liu, CH & Wei, Y 2024, CoinSeg: Contrast Inter- and Intra- Class Representations for Incremental Segmentation. in 2023 IEEE/CVF International Conference on Computer Vision (ICCV)., 10378563, International Conference on Computer Vision (ICCV), IEEE, pp. 843-853, 2023 International Conference on Computer Vision, Paris, France, 2/10/23. https://doi.org/10.1109/ICCV51070.2023.00084, https://doi.org/10.1109/ICCV51070.2023.00084 Preprint Qu, C, Chen, H & Jiao, J 2025 'Exploring Image Representation with Decoupled Classical Visual Descriptors' arXiv, pp. 1-14. https://doi.org/10.48550/arXiv.2510.14536 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 8701,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:09"
}