{
  "name": "Jianli Pan",
  "homepage": "https://mason.gmu.edu/~jpan22",
  "status": "success",
  "content": "Jianli Pan's Homepage Jianli Pan Ph.D., Associate Professor Department of Information Sciences and Technology College of Engineering and Computing George Mason University Address: 437 Research Hall, Mail Stop 5B5, 4400 University Dr., Fairfax, VA 22030 Email: jpan22@gmu.edu Phone: (703)-993-7285 Research Profile: Google Scholar Profile Home  |  Projects  |  Publications  |  Teaching  |  Awards  |  News I am currently looking for self-motivated students or scholars to work on topics such as AI and Machine Learning, Intelligent IoT/Edge Systems, and Cybersecurity. Please contact jpan22@gmu.edu. Biography: I am currently a tenured associate professor in the Department of Information Sciences and Technology at George Mason University (GMU). I earned my Ph.D. degree from the Department of Computer Science and Engineering of Washington University in Saint Louis. My Ph.D. advisor was Prof. Raj Jain. Before that, I graduated from Beijing University of Posts and Telecommunications (BUPT), China. My research interests broadly cover: AI and Machine Learning, Intelligent IoT/Edge Systems, and Cybersecurity. I am particularly interested in solving emerging important problems at the intersections of the above-mentioned areas, in addressing the real-world grand challenges that our society faces, and in enabling intelligent and secure systems for future homes, campuses, factories, communities, and cities. News: • Paper: Our paper on future UAV/Drone Systems titled \"REPA: Resilient and Proactive Resource Allocation for Last-mile Heterogeneous Edge-IoT Systems\" has been accepted by IEEE Internet of Things Journal (IOT-J), Impact Factor: 10.6. (2025/10) • Recognition: I am honored to be recognized as a top 0.5% scholar worldwide (of 30 million scholars), Ranked by the ScholarGPS (scholargps.com), operated by Meta Analytics LLC, USA. (2025/06) • Paper: Our paper on future UAV/Drone Systems titled \"Future UAV/Drone Systems for Intelligent Active Surveillance and Monitoring\" has been accepted by ACM Computing Surveys. Impact Factor: 28. (2025/05) • Paper: Our paper on autonomous Edge-UAV Systems titled \"PREUS: Proactive and Robust Edge-UAV Systems for Autonomous Monitoring in Dynamic Environments\" has been accepted by ACM Transactions on Intelligent Systems and Technology. Impact Factor: 7.2 (2025/04) • Grant: As a Co-PI of an IST-CYSE joint team at GMU, we received a CyberCorps grant (about $4 million, 2025-2029) from the National Science Foundation (NSF) to empower American Government Leadership in Cybersecurity Education. (2025/01). • Paper: Our paper on AI-based Cyber Threat Detection titled \"CyberMALT: Machine Learning-Assisted Traffic Analysis for Cyber Threat Detection and Classification\" has been accepted by IEEE Consumer Communications and Networking Conference (IEEE CCNC 2025). (2025/01) • Paper: Our paper on IoT Intelligent and Active Defense titled \"CICADA: Cloud-based intelligent classification and active defense approach for IoT security\" has been accepted by IEEE INFOCOM 2023 Workshop. (2023/05) • Service: I will serve as an associate editor for IEEE Internet of Things Journal (IOT-J), Impact Factor: 10.24. (2023/01). • Grant: As a team of three faculty members of IST at GMU, we received a Cybersecurity Research Innovation grant ($750K, 2022-2025) from the National Security Agency (NSA) on metadata traffic analysis for cybersecurity. (2022/08). • Moving: I will join the Department of Information Sciences and Technology at the George Mason University this Fall semester. (2022/08) • Award: I received \"Outstanding Research\" award of 2022 from the Department of Computer Science, UMSL. (2022/05) • Award: I am honored to be recognized as an \"AI 2000 Most Influential Scholar Honorable Mention in Internet of Things\" (awarded to top 11 to 100 researcher worldwide in the field), by Tsinghua University AI 2000 Most Influential Scholar Annual List (AMiner.org). (2022/04) • Recognition: I am honored to be recognized as a top 2% scholar worldwide in Information and Communications Technology of 2020 by the Stanford-Elsevier Worldwide Scholar Research Impact Report. Media report: \"UMSL faculty members ranked among the top 2% of scholars worldwide,\" UMSL Daily. (2022/03) • Award: I am honored to be recognized as a Distinguished Member of the 2022 IEEE INFOCOM Technical Program Committee (TPC). (2022/02) • Paper: Our paper on Intelligent and Adaptive Edge-IoT Resorce Facilitation titled \"I-HARF: Intelligent and Hierarchical Framework for Adaptive Resource Facilitation in Edge-IoT Systems\" has been accepted by IEEE Internet of Things Journal (IOT-J). Impact Factor: 9.94. (2022/02) • Paper: Our paper on Intelligent and QoE-based Edge-IoT resource management titled \"DeepEdge: A New QoE-based Resource Allocation Framework Using Deep Reinforcement Learning for Future Heterogeneous Edge-IoT Applications\" has been accepted by IEEE Transactions on Network and Service Management (TNSM). Impact Factor: 6.43. (2021/10) • Grant: As a Co-PI, we teamed up with the University of Missouri-Columbia (MU) and received a Cybersecurity Research Innovation grant ($510K, 2021-2024) from the National Security Agency (NSA) on automated and intelligent security for IoT Edge/Cloud systems. (2021/09). Media report: \"Computer scientist Jianli Pan working to make IoT security smarter and automated with new NSA grant,\" UMSL Daily. (2021/11). • Award: I am honored to receive 2021 UMSL \"Innovator of the Year\" award. Media report: \"UMSL recognizes six faculty members for outstanding research, innovation over the past year,\" UMSL Daily. (2021/04) • Patent: We filed a patent entitled \"Method and System for Intelligent, Scalable, and Plug and Play Monitoring and Detection of Misbehavior and Botnets for Heterogeneous IoT Devices,\" as U.S. Provisional Patent Application Serial No. 64/174,864 in April, 2021. (2021/04) • Service: I will serve as a TPC member for 2022 IEEE International Conference on Computer Communications (IEEE INFOCOM 2022). (2021/04). • Recognition: I am honored to be elevated to the senior member grade for both IEEE and ACM. (2021/04) • Paper: Our paper on enhancing the robustness of AI based network intrusion detection titled \"Def-IDS: An Ensemble Defense Mechanism Against Adversarial Attacks for Deep Learning-based Network Intrusion Detection\" has been accepted by IEEE International Conference on Computer Communications and Networks (ICCCN 2021). (2021/04) • Paper: Our paper on Intelligent and behavior-aware Edge-IoT system management titled \"BEHAVE: Behavior-Aware, Intelligent and Fair Resource Management for Heterogeneous Edge-IoT Systems\" has been accepted by IEEE Transactions on Mobile Computing (TMC). Impact Factor: 5.12. (2021/03) • Patent: Our patent entitled \"Method and System for Secure Resource Management Utilizing Blockchain and Smart Contracts\" has been officially issued as U.S. Patent No. 10,924,36. (2021/02) • Paper: Our paper on Intelligent Access Control for Internet of Vehicle (IoV) titled \"An Intelligent Edge-Chain Enabled Access Control Mechanism for IoV\" has been accepted by IEEE Internet of Things Journal (IOT-J). Impact Factor: 9.94. (2021/02) • Paper: Our paper on novel owner-centric and data-driven management paradigm for future IoT systems titled \"ORCA: Enabling an Owner-centric and Data-driven Management Paradigm for Future Heterogeneous Edge-IoT Systems\" has been accepted by IEEE Communications Magazine. Impact Factor: 11.05. (2020/12) • Award: I am honored to receive 2020 \"Inventor of the Year\" award by the Bar Association of Metropolitan St. Louis (BAMSL), (2020/11). Media report: \"Jianli Pan receives 'Inventor of the Year' award for patented technology to enhance security of Internet of Things systems,\" UMSL Daily. (2021/01) • Paper: Our paper on advanced Q-learning for resource management of individual Edge-IoT domains titled \"Enhanced Online Q-Learning Scheme for Resource Allocation with Maximum Utility and Fairness in Edge- IoT Networks\" has been accepted by IEEE Transactions on Network Science and Engineering (TNSE). Impact Factor: 5.22. (2020/08) • Paper: Our paper on Internet of Vehicle titled \"An Access Control Mechanism Based on Risk Prediction for the IoV\" has been accepted by IEEE 91st Vehicular Technology Conference (VTC). (2020/05) • Grant: The sole PI of a National Science Foundation (NSF) research grant on using deep reinforcement learning (DRL) techniques for edge cloud resource allocation for future IoT applications. Media report: \"National Science Foundation awards Jianli Pan $500K to research edge cloud computing,\"UMSL Daily. (2019/09) • Grant: A Co-PI of a University of Missouri System Strategic Plan Research Investment grant of 2.75 millions USD for \"Energy Reliability and Resiliency of Electrified Transportation Infrastructure\". Media report: \"UM System's $20.5M research investment,\"UMSL Daily. (2019/08) • Outreach: A mentor and faculty advisor for 2019 Jennings-UMSL internship program for underepresented high school students from Jennings High School. (2019/07) • Grant: The PI of an UMSL Research Award for \"Permissioned Blockchain for IoT Convergence and Security\". (2019/05). • Paper: Our paper on Edge-IoT systems empowered by blockchain and smart contracts \"EdgeChain: An Edge-IoT Framework and Prototype Based on Blockchain and Smart Contracts\" has been accepted by by IEEE Internet of Things Journal (IOT-J), Special issue on \"The Convergence of Blockchain and IoT: Opportunities, Challenges, and Solutions\". Impact Factor: 9.94. (2018/10) • Paper: Our paper on edge computing offloading \"Edge Cloud Offloading Algorithms: Issues, Methods, and Perspectives\" has been accepted by ACM Computing Surveys (CSUR). Impact Factor: 7.99. (2018/10) • Press: \"Jianli Pan receives recognition, funding for work on edge cloud computing, cybersecurity,'' UMSL Daily. (2018/07) • Award: Honored to receive 2018 \"Junior Faculty Investigator of the Year\" award from UMSL. (2018/05) • Award: Received 2018 \"Outstanding Research\" ",
  "content_length": 10084,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:15"
}