{
  "name": "Jianwu Wang 0001",
  "homepage": "https://bdal.umbc.edu/people/jianwu",
  "status": "success",
  "content": "Lab Director: Jianwu Wang – Big Data Analytics Lab – UMBC Skip to main content Big Data Analytics Lab Menu Apply Search Search Context This Site All of UMBC In this section Location ITE 471 Contact Contact Us Big Data Analytics Lab on Twitter Professor of Data Science Department of Information Systems University of Maryland, Baltimore County Baltimore, MD, U.S.A. Email: jianwu _at_ umbc.edu Phone: 410-455-3883 Office: ITE 423 Availability Twitter/X: @JianwuWang See me at: Google Scholar, ORCID, DBLP, LinkedIn, ScholarWorks Short Biography Dr. Jianwu Wang is a Professor of Data Science at the Department of Information Systems, University of Maryland, Baltimore County (UMBC). He leads the Center for Scalable Data and Computational Science (ScaleS) and the Big Data Analytics Lab (BDAL) at UMBC and co-leads the NSF HDR Institute for Harnessing Data and Model Revolution in the Polar Regions (iHARP). He is also an affiliate faculty at the Department of Computer Science and Electrical Engineering and the Joint Center for Earth Systems Technology (JCET), UMBC. He received his Ph.D. degree in Computer Science from Institute of Computing Technology, Chinese Academy of Sciences in 2007. His research interests include Big Data Analytics, Causal AI, Earth Informatics and Distributed Computing. He has published 160+ papers with more than 4000 citations (h-index: 28). He is/was associate editor or editorial board member of four international journals, conference organization committee member of eight conferences and co-chair of eight related workshops. He is also program committee member for over 40 conferences/workshops, and reviewer of over 15 journals or books. Since joining UMBC in 2015, he has received multiple external grants as PI (over $3.7M in total), Co-PI (over $13.7M in total) or Senior Personnel (over $20.3M in total) funded by ARL, NSF, NASA, DOE, State of Maryland, and Industry. He received Early-Career Faculty Excellence award from UMBC in 2019, NSF CAREER award in 2020 and Mid-Career Faculty Excellence award from UMBC in 2025. Research Topics Big Data Analytics Earth and Climate Informatics Causal Artificial Intelligence Distributed Computing (Cluster, Grid, Cloud, IoT) Smart Manufacturing Scientific Workflow Service-Oriented Computing For Prospective Students I’m looking for undergraduate, master, Ph.D. students to work on Big Data, workflow and distributed computing related projects through volunteering, independent study, hourly paid position and Research Assistant. I’m also looking for visiting scholars and Ph.D. students. More information is at Resources -> Phd Student Positions tab. Please contact me if you are interested. Education 2001.9 ~ 2007.7 Ph.D. in Computer Software and Theory, Institute of Computing Technology, University of the Chinese Academy of Sciences. Dissertation: “A Domain Oriented and Business User Friendly Service Model”. 1997.9 ~ 2001.7 B.S. in Computer Science and Technology. Tianjin University Employment 2024.7 ~ Present: Professor at the Department of Information Systems, University of Maryland, Baltimore County (UMBC), Baltimore, MD, U.S.A. 2022.5 ~ Present: Affiliate Faculty at the Department of Computer Science and Electrical Engineering, University of Maryland, Baltimore County (UMBC), Baltimore, MD, U.S.A. 2021.11 ~ Present: Affiliate Faculty at the Goddard Earth Sciences Technology and Research (GESTAR) II, University of Maryland, Baltimore County (UMBC), Baltimore, MD, U.S.A. 2021.7 ~ 2024.6: Associate Professor at the Department of Information Systems, University of Maryland, Baltimore County (UMBC), Baltimore, MD, U.S.A. 2021.5 ~ Present: Affiliate Faculty at the Center for Real-time Distributed Sensing and Autonomy (CARDS), University of Maryland, Baltimore County (UMBC), Baltimore, MD, U.S.A. 2018.8 ~ Present: Affiliate Faculty at the Joint Center for Earth Systems Technology (JCET) , University of Maryland, Baltimore County (UMBC), Baltimore, MD, U.S.A. 2018.8 ~ Present: Affiliate Faculty at the NSF IUCRC Center for Accelerated Real Time Analytics (CARTA), University of Maryland, Baltimore County (UMBC), Baltimore, MD, U.S.A. 2015.8 ~ 2021.6: Assistant Professor at the Department of Information Systems, University of Maryland, Baltimore County Baltimore, MD, U.S.A. Awards CAREER Award, National Science Foundation (NSF), 2020. Early-Career Faculty Excellence Award, UMBC, 2019. Experiences Sabbatical visit, AI Center of Excellence, NASA Goddard Grants News Students Teaching Professional Services Publications Talks Location ITE 471 Contact Contact Us Big Data Analytics Lab on Twitter © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 4951,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:20"
}