{
  "name": "Jianliang Xu",
  "homepage": "http://www.comp.hkbu.edu.hk/~xujl",
  "status": "success",
  "content": "Jianliang Xu's Homepage Home Grants Publications Services Teaching Travel DB Group Family CV Jianliang Xu Head & Chair Professor Department of Computer Science (Map) Hong Kong Baptist University Kowloon Tong, Hong Kong Email: Jianliang Xu is a Chair Professor and the Head of the Computer Science Department at Hong Kong Baptist University. He received his PhD degree in Computer Science from Hong Kong University of Science and Technology in 2002, and his BEng degree in Computer Science and Engineering from Zhejiang University in 1998. Prior to his undergraduate study, he completed his secondary education at Suzhou High School from 1991 to 1994. Prof. Xu has been a visiting scholar at Pennsylvania State University, University Park (Summer 2005) and a senior visiting fellow at Fudan University (Winter 2009). He serves as a director of the Blockchain and FinTech Lab and leads the Database Research Group at Hong Kong Baptist University. With an H-index of 65, Prof. Xu has published more than 300 refereed articles in top-tier international conferences and journals, including SIGMOD, VLDB, ICDE, TKDE, and VLDBJ. He has been invited to serve as Program Committee Co-Chair for several reputed international conferences, such as ICDCS '12, WAIM '16, APWeb-WAIM '18, MDM '19, and NDBC '20. He was a recipient of HKBU President's Award for Outstanding Performance in Scholarly Work (2017), HKBU President's Award for Outstanding Performance in Teaching (2018), and VLDB Distinguished Reviewer Award (2019). He has served as an Associate Editor of IEEE Transactions on Knowledge and Data Engineering (TKDE), IEEE Transactions on Big Data (TBD), IEEE Transactions on Parallel and Distributed Systems (TPDS), Proceedings of VLDB Endowment (PVLDB), and Springer Journal of Data Science and Engineering (DSE). He is a Fellow of IEEE. Looking for PhD students and Postdoc/senior researchers; please email me your CV and supporting documents Hong Kong PhD Fellowship Scheme (HKPFS) 2026/27 for strong applications If nominated by HKBU and awarded by RGC: support of HK$50,000/month + waive of tuition fee If nominated by HKBU but not awarded by RGC: support of HK$28,400/month If not nominated by HKBU: standard support of HK$18,930/month Some experience on research student supervision Current Research Interests: Databases, Blockchain, Applied AI & LLM, Data Security and Privacy Recent News: [2024-12]: Named IEEE Fellow (Computer Society) [2024-11]: Named Highly Ranked Scholar by ScholarGPS [2024-04]: Awarded Silver Medal at Geneva International Exhibition of Inventions [2023-03]: Invited to deliver a Keynote at DASFAA 2023 [2022-11]: Released Hong Kong COVID-19 Hotspot Map (KDV library, press release, media reports) [2022-10]: Recognized among the world's top 2% scientists by Stanford University [2022-01]: Awarded $6.7M CRF funding on secure data sharing and analytics [2020-10]: Best Paper Nominee at CIKM 2020 [2020-08]: Rolled out BU-Trace for COVID-19 contact tracing and risk alerting (paper, video, media reports) [2020-06]: Invited to be a Lecturer for VLDB Summer School 2020 (Blockchain Database) [2019-07]: New book Community Search over Big Graphs Recent Activities: PVLDB 2026, 2024 (Associate Editor) ICDE 2026, 2025, 2024 (Area Chair) KDD 2025 (Area Chair) IEEE MDM 2022 (General Co-Chair) IEEE BlockDM 2021 (TPC Co-Chair) PVLDB 2020, 2021, 2023, 2025 (Review Board Member) NDBC 2020 (TPC Co-Chair) IEEE MDM 2019 (TPC Co-Chair) APWeb-WAIM 2018 (TPC Co-Chair) H-index: 65 @Google Scholar Associate Editor, IEEE Transactions on Big Data (TBD) Associate Editor, IEEE Transactions on Parallel and Distributed Systems (TPDS) Associate Editor, Data Science and Engineering (DSE) Media coverage and interviews (Mingpao, Singtao, RTHK, Phoenix TV, etc.) Student Achievements: Xinyi Zhang: ACM SIGMOD 2024 Student Travel Award Ruofei Tang: Best Student Paper Award at ACM/IEEE 32th Int'l Workshop on Logic & Synthesis (IWLS) Dezhi Chen: First Prize Award in 2023 Pan-Pearl River Delta+ University IT Projects Competition Ce Zhang: IEEE ICDE 2019 Student Travel Award Cheng Xu: ACM SIGMOD 2018 Student Travel Award Wenzhou Wei and Haixin Wang: Third Prize in 2017 HSBC FinTech Safeguard App Competition Yafei Li: 2016 ACM China Doctoral Dissertation Award Chapter Winner Qian Chen: ACM SIGMOD 2015 Student Travel Award Lei Chen: IEEE ICDE 2015 Student Travel Award Shen Gao: First-Class Award in the 12th National Challenge Cup Contest Chushi Ren, Chun Xie, You Ding: Bronze Prize in 2011 Pan-Pearl River Delta Region FYP Competition HKBU Teams: Champion University Award in 2008 IBM DB2 Programming Contest Recent Research Grants (More): PrivRAG: Private High-Dimensional Similarity Search for Cloud-Based Retrieval Augmented Generation (PI, RGC/GRF, 12201925, 2026-2028) TrustLLM: Trustworthy Large Language Models: A Multifaceted Strategy for Truthfulness, Fairness, and Privacy Preservation (Co-PI, RGC/CRF, C1043-24GF, 2025-2028) VecSim: Vector Similarity Search in High-Dimensional Spaces (PI, RGC/GRF, 12202024, 2025-2027) FedGraph: Federated Graph Management and Querying: Subgraphs, Keywords, and Privacy (Co-PI, RGC/YCRG, C2003-23Y, 2024-2027) ChatSRA: Integrating ChatGPT with Search Engine, Recommender System and Online Advertising to Enhance User Experience on Online Service Platforms (Co-PI, RGC/RIF, R1015-23, 2024-2027) LIMBO: When Learned Index Meets Blockchain: Design, Algorithms, and Performance Evaluation (PI, RGC/GRF, 12200022, 2023-2025) USHARE: User-controlled Secure Data Sharing and Analytics with Blockchain and Trusted Computing Technologies (PI, RGC/CRF, C2004-21GF, 2022-2025) Selected Recent Publications (Complete List, DBLP, Google Scholar): X. Zhang, L. Liang, A. Ailamaki, and J. Xu. \"HIRE: A Hybrid Learned Index for Robust and Efficient Performance under Mixed Workloads.\" Proc. of the ACM SIGMOD Int'l Conf. on Management of Data (SIGMOD '26), Bengaluru, India, 2026. Y. Cao, Z. Gao, Z. Li, X. Xie, S. K. Zhou, and J. Xu. \"LEGO-GraphRAG: Modularizing Graph-based Retrieval-Augmented Generation for Design Space Exploration.\" Proc. of the 51st International Conference on Very Large Data Bases (PVLDB '25), London, United Kingdom, 2025. C. Zhang, C. Xu, H. Hu, and J. Xu. \"COLE: A Column-based Learned Storage for Blockchain Systems.\" Proc. of the 22nd USENIX Conference on File and Storage Technologies (FAST '24), Santa Clara, CA, USA, 2024. X. Zhang, Q. Wang, C. Xu, Y. Peng, and J. Xu. \"FedKNN: Secure Federated k-Nearest Neighbor Search.\" Proc. of the ACM SIGMOD Int'l Conf. on Management of Data (SIGMOD '24), Santiago, Chile, 2024. Y. Peng, B. Choi, T. N. Chan, J. Yang, and J. Xu. \"Efficient Approximate Nearest Neighbor Search in Multi-dimensional Databases.\" Proc. of the ACM SIGMOD Int'l Conf. on Management of Data (SIGMOD '23), Seattle, WA, USA, 2023. T. N. Chan, P. L. Ip, L. H. U, B. Choi, and J. Xu. \"SWS: A Complexity-Optimized Solution for Spatial-Temporal Kernel Density Visualization.\" Proc. the 47th International Conference on Very Large Data Bases (PVLDB '22), Sydney, Australia, 2022. [demo video] [project page] X. Liao*, Q. Liu*, J. Jiang, X. Huang, J. Xu, and B. Choi. \"Distributed D-core Decomposition over Large Directed Graphs.\" Proc. the 47th International Conference on Very Large Data Bases (PVLDB '22), Sydney, Australia, 2022. (*equal contribution) T. N. Chan, L. H. U, B. Choi, and J. Xu. \"SLAM: Efficient Sweep Line Algorithms for Kernel Density Visualization.\" Proc. the ACM SIGMOD International Conference on Management of Data (SIGMOD '22), Philadelphia, USA, June 2022. [demo video] [project page] H. Wang, C. Xu, C. Zhang, J. Xu, Z. Peng, and J. Pei. \"vChain+: Optimizing Verifiable Blockchain Boolean Range Queries.\" Proc. the 38th IEEE International Conference on Data Engineering (ICDE '22), Kuala Lumpur, Malaysia, May 2022. [pdf/code/cite] C. Xu*, C. Zhang*, J. Xu, and J. Pei. \"SlimChain: Scaling Blockchain Transactions through Off-Chain Storage and Parallel Processing.\" Proc. the 47th International Conference on Very Large Data Bases (PVLDB '21), Copenhagen, Denmark, 2021. (*equal contribution) [eprint] [code] Q. Liu, M. Zhao, X. Huang, J. Xu, and Y. Gao. \"Truss-based Community Search over Large Directed Graphs.\" Proc. the ACM SIGMOD International Conference on Management of Data (SIGMOD '20), Portland, OR, USA, June 2020. C. Xu, C. Zhang, and J. Xu. \"vChain: Enabling Verifiable Boolean Range Queries over Blockchain Databases.\" Proc. the ACM SIGMOD International Conference on Management of Data (SIGMOD '19), Amsterdam, Netherlands, 2019. [eprint] [code]",
  "content_length": 8570,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:14"
}