{
  "name": "Jianjun Hu",
  "homepage": "http://www.cse.sc.edu/~jianjunh",
  "status": "success",
  "content": "Jianjun Hu Hompage, CSE, University of South Carolina University of South Carolina Department of Computer Science and Engineering College of Engineering & Computing Machine Learning and Evolution Group (MLEG) Home Teaching Research Publications Software Services Jianjun Hu CV Professor Department of Computer Science and Engineering University of South Carolina Columbia, SC 29208 Office: 2223 Storey Innovation Center Phone: 803-777-7304 Fax: 803-777-3767 Email: jianjunh_AT_cse.sc.eduOffice hours:TBD or by appointment via Email. I am looking for highly motivated Ph.D. and Master students with RA/TA assistantship and outstanding undergraduate students to join my lab and work on projects in Deep Learning, material informatics, bioinformatics,data mining or machine learning. You are expected to have good programming skills and teamwork spirit. Teaching Fall 2022 Data Mining and Warehousing (CSCE822) TTH 10:05PM- 11:30PM, SWGN 2A11 Research Interests My research interests are in the areas of machine learning, deep learning, data mining, big data, evolutionary computation and their applications in bioinformatics, material informatics, and health informatics. Our research has been sponsored by NSF, NIH, Nvidia, and the South Carolina Department of Transportation. Currently, our major research focus is developing deep learning algotrithms for solving challenging application problems such as: Intelligent audio/sound processing Data-driven material discovery Disease diagnosis and prediction, medical image analysis Bioinformatics: protein-peptide binding prediction for drug design, and protein design Big data driven predictive analytics for healthcare Fault diagnosis, text mining, and intelligent transportation For more information, pls visit my lab's homepage here: Machine Learning and Evolution Group (MLEG) Bio: I joined CSE department of the University of South Carolina in August 2007. I am now working on deep learning, data mining and their applications in audio processing, material informatics, bioinformatics, and health informatics.  I got my Ph.D. in Computer Science in the area of machine learning and particularly evolutionary computation at the Genetic Algorithm Research and Application Group (GARAGe) of Michigan State University. My dissertation focuses on sustainable evolutionary computation algorithms and automated computational synthesis. I have worked as Postdoc at  Purdue University Computational Molecular Biology Division at the University of Southern California. Education Postdoc University of Southern California, Computational Molecular Biology 09/05 - 06/07 Postdoc Purdue University, Biological Science 09/04 - 08/05 Ph.D. Michigan State University, Computer Science 08/00 - 07/04 M.S. Wuhan University of Technology, China, Mechanical Engineering 07/95 - 04/98 B.S. Wuhan University of Technology, China, Mechanical Engineering 09/91 - 07/95 Selected Publications [Complete List] [Check Google Scholar for latest publications] Dissertation J. Hu. Sustainable Evolutionary Algorithms and Scalable Evolutionary Synthesis of Dynamic Systems”, PhD thesis, Department of Computer Science and Engineering, Michigan State University, East Lansing, Michigan, 48823, USA, 2004. Advisor: Erik Goodman Selected Journal Publications Generative design of stable semiconductor materials using deep learning and dft ,npj Computational Materials, 2022. Siriwardane, Edirisuriya, Zhao, Yong, Perera, Indika and Hu, JianjunAccurate prediction of voltage of battery electrode materials using attention based graph neural networks , 2022. Louis, Steph-Yves, Siriwardane, Edirisuriya, Joshi, Rajendra, Omee, Sadman, Kumar, Neeraj and Hu, JianjunStudying patterns and predictors of hiv viral suppression using a big data approach: a research protocol BMC Infectious Diseases 22, 1-12, 2022. Zhang, Jiajia, Olatosi, Bankole, Yang, Xueying, Weissman, Sharon, Li, Zhenlong, Hu, Jianjun and Li, XiaomingLarge scale dataset of real space electronic charge density of cubic inorganic materials from density functional theory (dft) calculations Scientific Data 9, 1-9, 2022. Wang, Fancy Qian, Choudhary, Kamal, Liu, Yu, Hu, Jianjun and Hu, MingCrystal structure prediction using an age-fitness multiobjective genetic algorithm and coordination number constraints The Journal of Physical Chemistry A, 2022. Yang, Wenhui, Dilanga Siriwardane, Edirisuriya M and Hu, JianjunDeepxrd, a deep learning model for predicting of xrd spectrum from materials composition arXiv preprint arXiv:2203.14326, 2022. Dong, Rongzhi, Zhao, Yong, Song, Yuqi, Fu, Nihang, Omee, Sadman Sadeed, Dey, Sourin, Li, Qinyang, Wei, Lai and Hu, JianjunPhysics guided generative adversarial networks for generations of crystal materials with symmetry constraints arXiv preprint arXiv:2203.14352, 2022. Zhao, Yong, Siriwardane, Edirisuriya M Dilanga, Wu, Zhenyao, Hu, Ming, Fu, Nihang and Hu, JianjunGenetic programming-based learning of carbon interatomic potential for materials discovery arXiv preprint arXiv:2204.00735, 2022. Eldridge, Andrew, Rodriguez, Alejandro, Hu, Ming and Hu, JianjunMaterialsatlas. org: a materials informatics web app platform for materials discovery and survey of state-of-the-art npj Computational Materials 8, 1-12, 2022. Hu, Jianjun, Stefanov, Stanislav, Song, Yuqi, Omee, Sadman Sadeed, Louis, Steph-Yves, Siriwardane, Edirisuriya, Zhao, Yong and Wei, LaiTcsp: a template-based crystal structure prediction algorithm for materials discovery Inorganic Chemistry, 2022. Wei, Lai, Fu, Nihang, Siriwardane, Edirisuriya MD, Yang, Wenhui, Omee, Sadman Sadeed, Dong, Rongzhi, Xin, Rui and Hu, JianjunCrystal transformer: self-learning neural language model for generative and tinkering design of materials arXiv preprint arXiv:2204.11953, 2022. Wei, Lai, Li, Qinyang, Song, Yuqi, Stefanov, Stanislav, Siriwardane, Edirisuriya, Chen, Fanglin and Hu, JianjunScalable deeper graph neural networks for high-performance materials property prediction Patterns, 100491, 2022. Omee, Sadman Sadeed, Louis, Steph-Yves, Fu, Nihang, Wei, Lai, Dey, Sourin, Dong, Rongzhi, Li, Qinyang and Hu, Jianjun 2021 Alphacrystal: contact map based crystal structure prediction using deep learning arXiv preprint arXiv:2102.01620, 2021. Hu, Jianjun, Zhao, Yong, Yang, Wenhui, Song, Yuqi, Siriwardane, Edirisuriya, Li, Yuxin and Dong, RongzhiNode-select: a graph neural network based on a selective propagation technique arXiv preprint arXiv:2102.08588, 2021. Louis, Steph-Yves, Nasiri, Alireza, Rolland, Fatima J, Mitro, Cameron and Hu, JianjunDeep learning pan-specific model for interpretable mhc-i peptide binding prediction with improved attention mechanism Proteins: Structure, Function, and Bioinformatics, 2021. Jin, Jing, Liu, Zhonghao, Nasiri, Alireza, Cui, Yuxin, Louis, Stephen, Zhang, Ansi, Zhao, Yong and Hu, JianjunSoundclr: contrastive learning of representations for improved environmental sound classification arXiv preprint arXiv:2103.01929, 2021. Nasiri, Alireza and Hu, JianjunMeta-learning for few-shot bearing fault diagnosis under complex working conditions Neurocomputing 439, 197-211, 2021. Li, Chuanjiang, Li, Shaobo, Zhang, Ansi, He, Qiang, Liao, Zihao and Hu, JianjunReal-time motion tracking of cognitive baxter robot based on differential inverse kinematics International Journal of Advanced Robotic Systems 18, 17298814211024052, 2021. Li, Shaobo, Zhang, Xingxing, Yang, Jing, Bai, Qiang, Hu, Jianjun, Song, Qisong and Li, ZhiangContact map based crystal structure prediction using global optimization CrystEngComm 23, 1765-1776, 2021. Hu, Jianjun, Yang, Wenhui, Dong, Rongzhi, Li, Yuxin, Li, Xiang, Li, Shaobo and Siriwardane, Edirisuriya MDMlatticeabc: generic lattice constant prediction of crystal materials using machine learning ACS omega 6, 11585-11594, 2021. Li, Yuxin, Yang, Wenhui, Dong, Rongzhi and Hu, JianjunDeepseqpanii: an interpretable recurrent neural network model with attention mechanism for peptide-hla class ii binding prediction IEEE/ACM Transactions on Computational Biology and Bioinformatics, 2021. Liu, Zhonghao, Jin, Jing, Cui, Yuxin, Xiong, Zheng, Nasiri, Alireza, Zhao, Yong and Hu, JianjunComputational discovery of new 2d materials using deep learning generative models ACS Applied Materials \\& Interfaces, 2021. Song, Yuqi, Siriwardane, Edirisuriya M Dilanga, Zhao, Yong and Hu, JianjunFirst-principles investigation of ti2cso and ti2csse janus mxene structures for li and mg electrodes The Journal of Physical Chemistry C, 2021. Siriwardane, Edirisuriya M Dilanga and Hu, JianjunFirst-principles investigation of tiâcso and tiâcsse janus mxene structures for li and mg electrodes , 2021. Siriwardane, Edirisuriya M Dilanga and Hu, JianjunAccurate prediction of voltage of battery electrode materials using attention based graph neural networks , 2021. Siriwardane, Edirisuriya, Louis, Steph-Yves, Joshi, Rajendra, Kumar, Neeraj and Hu, JianjunPredicting lattice phonon vibrational frequencies using deep graph neural networks arXiv preprint arXiv:2111.05885, 2021. Nguyen, Nghia, Louis, Steph-Yves, Wei, Lai, Choudhary, Kamal, Hu, Ming and Hu, JianjunPiezoelectric modulus prediction using machine learning and graph neural networks arXiv preprint arXiv:2111.05557, 2021. Hu, Jeffrey and Song, YuqiBig data driven product design: a survey arXiv preprint arXiv:2109.11424, 2021. Quan, Huafeng, Li, Shaobo, Zeng, Changchang, Wei, Hongjing and Hu, JianjunScalable deeper graph neural networks for high-performance materials property prediction arXiv e-prints, arXiv-2109, 2021. Sadeed Omee, Sadman, Louis, Steph-Yves, Fu, Nihang, Wei, Lai, Dey, Sourin, Dong, Rongzhi, Li, Qinyang and Hu, JianjunTcsp: a template based crystal structure prediction algorithm and web server for materials discovery arXiv preprint arXiv:2111.14049, 2021. Wei, Lai, Fu, Nihang, Siriwardane, Edirisuriya, Yang, Wenhui, Omee, Sadman Sadeed, Dong, Rongzhi, Xin, Rui and Hu, JianjunPhysics guided deep learning generative models for crystal materials discovery arXi",
  "content_length": 24119,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:14"
}