{
  "name": "Jianwei Huang 0001",
  "homepage": "https://jianwei.cuhk.edu.cn",
  "status": "success",
  "content": "Jianwei Huang @ CUHK Home      Research Teaching Presentation Service Bio CV Presidential Chair Professor Associate Vice President (Institutional Development) The Chinese University of Hong Kong, Shenzhen (CUHK-Shenzhen) Past Editor-in-Chief, IEEE Transactions on Network Science and Engineering Associate Director, Shenzhen Institute of Artificial Intelligence and Robotics for Society IEEE Fellow (2016) AAIA (Asia-Pacific Artificial Intelligence Association) Fellow (2022) IEEE Communications Society Distinguished Lecturer (2015-2018) Web of Science Highly Cited Researcher in Computer Science (2016/2017) Email: jianweihuang [at] cuhk.edu.cn Office: Administration Building, Room 623, CUHK-Shenzhen My Profiles: Google Scholar, ResearcherID, DBLP, LinkedIn, Twitter Follow NCEL (Network Communications and Economics Lab) WeChat Public Account: ncel_cuhk (QR code) Highlights My reserach focuses on Networked Intelligence. We have multiple PhD and Postdoc openings, including joint supervision with CUHK and SLAI. To apply, please email me your CV and representative publications. NCEL members won 12 Best Paper Awards from leading venues, such as IEEE Transactions on Wireless Communications, E-energy, WiOpt, and SmartGridComm. NCEL Alumni became faculty members in leading universities worldwide, such as Hong Kong University of Science and Technology, City University of Hong Kong, Monash University, University of Macau, Singapore University of Technology and Design, The Chinese University of Hong Kong, Shenzhen, Hong Kong University of Science and Technology (Guangzhou), Kunshan-Duke University, Harbin Institute of Technology (Shenzhen), Xiamen University, South China University of Technology, Sun Yat-Sen University, Tsinghua University, Northwest Polytechnical University, ShanghaiTech University, Beijing Institute of Technology, University of Electronic Science and Technology of China, Zhejiang University, Southern University of Science and Technology, Hunan University, Huazhong University of Science and Technology, and Southeast University. Experiences Associate Vice President, The Chinese University of Hong Kong, Shenzhen, 2022 - now Associate Dean, School of Science and Engineering, The Chinese University of Hong Kong, Shenzhen, 2019 - 2022 Presidential Chair Professor, School of Science and Engineering, The Chinese University of Hong Kong, Shenzhen, 2019 - now Adjunct Professor, Department of Information Engineering, The Chinese University of Hong Kong, 2020 - now Professor, Department of Information Engineering, The Chinese University of Hong Kong, 2017 - 2020 (on leave during 2019-2020) Associate Professor, Department of Information Engineering, The Chinese University of Hong Kong, 2013 - 2017 Assistant Professor, Department of Information Engineering, The Chinese University of Hong Kong, 2007 - 2013 Postdoc Research Associate, Department of Electrical Engineering, Princeton University, 2005 - 2007 Ph.D., Department of Electrical Engineering and Computer Science, Northwestern University, 2005 Master, Department of Electrical Engineering and Computer Science, Northwestern University, 2003 Bachelor, Department of Radio Engineering, Southeast University, 2000 Research Awards IEEE WiOpt Best Paper Award, 2025 Research.com Best Computer Scientists, 2025 (world ranking: 1866, national ranking: 226) ScholarGPS Highly Ranked Scholar (world ranking: 18 in Mobile Computing lifetime), 2024 IEEE SmartGridComm Best Paper Award, 2024 Research.com Best Computer Scientists, 2023 (world ranking: 1758, national ranking: 169) Distinguished Research Award, The Chinese University of Hong Kong, Shenzhen, 2023 IEEE Communications Society TCCN Publication Award, 2022 AAIA (Asia-Pacific Artificial Intelligence Association) Fellow, 2022 ACM E-energy Best paper Award, 2022 Elsevier Most Cited Chinese Researcher, 2021 Stanford top 2% Scientists in the World, 2019-2021 IEEE WiOpt Best paper Award, 2021 Distinguished Professor of Cheung Kong Scholars Program, Chinese Ministry of Education, 2020 Guangdong Leading Talent in Science and Technology, 2020 Shenzhen Pengcheng Distinguished Professor, 2020 IEEE Fellow, 2016 Web of Science Highly Cited Researcher in Computer Science, 2016 & 2017 IEEE Communications Society Distinguished Lecturer, 2015-2018 CUHK Young Researcher Award, 2014 IEEE Marconi Prize Paper Award in Wireless Communications, 2011 IEEE Communications Society Young Professional Best Paper Award (as the advisor), 2017 IEEE INFOCOM Best Paper Award Finalist, 2016 IEEE WiOpt Best Student Paper Award (as the advisor), 2015 IEEE WiOPT Best Paper Award, 2014 IEEE WiOPT Best Paper Award, 2013 IEEE SmartGridComm Best Paper Award, 2012 Wireless Internet Conference Best Paper Award, 2011 IEEE GLOBECOM Best Paper Award, 2010 Asia-Pacific Conference on Communication Best Paper Award, 2009 IEEE ComSoc Asia-Pacific Outstanding Young Researcher Award, 2009 Professional Services Chair, IEEE Koji Kobayashi Award Committee (2025-) Editor-at-Large, IEEE Transactions on Network Science and Engineering (2025-) Editor-in-Chief, IEEE Transactions on Network Science and Engineering (2021-2024) Associate Editor-in-Chief, IEEE Open Journal of the Communication Society (2019-2021) Editor, IEEE/ACM Transactions on Networking (2016-2020) Editor, IEEE Transactions on Mobile Computing (2018-2020) Editor, IEEE Transactions on Cognitive Communications and Networking (2015 -) Co-Chair, Steering Committee, IEEE ComSoc\tTechnical\tCommittee on Cognitive Networks Alumni News Dr. Lingjie Duan (NCEL PhD 2012) joins HKUST-GZ as a Full Professor in 2025. Dr. Bo Liu (NCEL Associate Researcher) joins Shenzhen University of Advanced Techlogy as an Assistant Professor in 2025. Dr. Xiaomin Ouyang (NCEL PhD 2023) joins Hong Kong University of Science and Technology as an Assistant Professor in 2024. Dr. Ningning Ding (NCEL PhD 2022) joins Hong Kong University of Science and Technology (Guangzhou) as an Assistant Professor in 2024. Dr. Yunshu Liu (NCEL PhD 2023) joins Northwest Polytechnical University as a Full Professor in 2024. Dr. Bing Luo (NCEL Postdoc 2019-2022) joins Kunshan-Duke University as an Assistant Professor in 2022. Dr. Peng Sun (NCEL Postdoc 2020-2022) joins Hunan University as an Associate Professor in 2022. Dr. Jin Xu (NCEL Postdoc 2020-2022) joins Huazhong University of Science and Technology as an Assistant Professor in 2022. Dr. Qisheng Huang (NCEL Postdoc 2020-2022) joins Harbin Institute of Technology Shenzhen as an Assistant Professor in 2022. Dr. Junling Li (NCEL Postdoc 2020-2022) joins Southeast University as an Associate Professor in 2022. Dr. Lihua Ruan (NCEL Postdoc 2019-2022) joins Soochow University as an Assistant Professor in 2022. Dr. Ming Tang (NCEL PhD 2019) joins SusTech as an Assistant Profesor in 2021. Dr. Dongwei Zhao (NCEL PhD 2021) joins MIT as a Postdoc in 2021. Dr. Guocheng Liao (NCEL PhD 2021) joins the Sun Yat-Sen University as an Assistant Professor in 2021. Dr. Meng Zhang (NCEL PhD 2020) joins the UIUC-Zhejiang University Joint Institute as an Assistant Professor in 2021. Dr. Yuan Luo (NCEL PhD 2015) joins the Chinese University of Hong Kong, Shenzhen as an Assistant Professor in 2021. Dr. Man Hon Cheung (NCEL Postdoc 2012-2017) joins the City University of Hong Kong as an Assistant Professor in 2020. Dr. Hao Wang (NCEL PhD 2016) joins Monash University as a Lecturer in 2020. Dr. Haoran Yu (NCEL PhD 2016) joins Beijing Institute of Technology as an Associate Professor in 2020. Dr. Qian Ma (NCEL PhD 2017) joins Sun Yat-Sen University as an Associate Professor in 2020. Dr. Zhixuan Fang (NCEL Postdoc 2019-2020) joins Tsinghua University as an Assistant Professor in 2020. Dr. Yanru Zhang (NCEL Postdoc 2018-2019) joins UESTC as a Professor in 2019 and received the Chinese Thousand Talents Award for Young Professionals in 2020. Dr. Lin Gao (NCEL Postdoc 2010-2015) received the IEEE ComSoc APB Young Researcher Award 2016. Dr. Gao is an Associate Professor at Harbin Institute of Technology (Shenzhen). Dr. Yuan Luo (NCEL PhD 2015) received the 2015 CUHK Postgraduate Research Output Award and 2015 CUHK Young Scholar Thesis Award. Yuan is the only awardee from Faculty of Engineering for both awards this year. Dr. Luo is a Research Fellow at Imperial College London. Dr. Xu Chen (NCEL PhD 2012) received the 2017 IEEE Communications Society Young Professional Best Paper Award, the 2017 IEEE Comsoc APB Young Researcher Award, the 2016 Chinese Thousand Talents Award for Young Professional, and the 2014 Hong Kong Young Scientist Award (runner-up). Dr. Chen is a Full Professor in SYSU. Dr. Lingjie Duan (NCEL PhD 2012) received the 2016 SUTD Excellence in Research Award, the 2015 IEEE Comsoc APB Young Researcher Award, and the 2014 Hong Kong Young Scientist Award (finalist). Dr. Duan is a Assistant Professor at SUTD. Dr. Liqun Fu (NCEL PhD 2010) received the 2015 Chinese Thousand Talents Award for Young Professionals. Dr. Fu is a Distinguished Professor in Xiamen University. Copyright © 2026 Jianwei Huang. All Rights Reserved. Designed by SmartWebby.com",
  "content_length": 9083,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:17"
}