{
  "name": "Jiang Yu",
  "homepage": "https://sites.google.com/site/jiangyu198964/home",
  "status": "success",
  "content": "Welcome! More information about our group can be referred to www.wingtecher.comSearch this siteEmbedded FilesSkip to main contentSkip to navigationYu Jiang Ph.DAssociate ProfessorSchool of Software,  Tsinghua University,  ChinaSoftware System Security Assurance GroupEmail: jy1989@mail.tsinghua.edu.cnAddress: 11-319, East-Main Building, TsinghuaGroup Website: www.wingtecher.comOur works and tools have discovered 1000+ bugs in widely used system software such as Safari, Linux Kernel, PostgreSQL, and MySql, with more than 300+ registered as CVEs at the US National Vulnerabilities Database. Details of the bug list and CVE list can be referred to  http://www.wingtecher.com/bugs/cve.BiographyI am an associate professor in the School of Software, Tsinghua University, Beijing, China. I received a BS in software engineering from the Beijing University of Post and Telecommunication, China, in 2010.6. I got my Ph.D. in computer science under the supervision of Prof. Jiaguang Sun from  Tsinghua University in 2015.1. I worked with Prof. Lui Sha as a Postdoc at the University of Illinois at Urbana-Champaign, IL, USA,  between 2015.03--2016.08. I joined the School of Software at Tsinghua University as an assistant professor between 2016.09--2019.11. ResearchSafety-assured formal model-driven design of CPS Aiming at the heterogeneous challenges of CPS, such as asynchronous and synchronous behaviors, a formal model-driven design method is proposed, which realizes the construction of heterogeneous CPS models and code generation algorithms. This method reduces the difficulty of CPS software coding and improves the correctness of the design process. We apply the approach in the design of automatic vehicle controllers and the design of the medical cyber-physical system.Security of embedded softwareFor the security issues of embedded software,  a learning-based vulnerability search and fuzzing of cross-platform embedded firmware of IoT devices are proposed. Those methods reduce the difficulty of embedded software analysis and improve the correctness and effectiveness of vulnerability detection and defense methods. Validation of basic software via cross-layer fuzzingEnsuring the security of basic software systems has become a critical challenge. A semantic-aware fuzzing framework for a cross-layer software stack is proposed, where our current fuzzing work supports c/c++ applications, communication protocols, databases, and operating system kernels. The approach significantly improves the efficiency of software bug detection for different types of systems.Selected AwardsCareer Award, NSFC， 2026Distinguished Paper Award, ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2025First Prize for Technical Invention, China Computer Federation (CCF): 2024First Prize for Beijing Science and Technology Progress, Beijing Municipal: 2024Distinguished Paper Award, USENIX Security:2024Best Paper Nominee, ACM SIGBED International Conference on Embedded Software (EMSOFT): 2022SIGSOFT  Distinguished Paper Award, ACM SIGSOFT International Symposium on Foundations of  Software Engineering (FSE):2022Early Career Award, NSFC: 2020DAMO Academy Young Fellow, Alibaba: 2020Best Paper Nominee, ACM SIGBED International Conference on Embedded Software (EMSOFT): 2020Best Paper Nominee, ACM SIGSOFT International Conference on Software Engineering- Software Engineering in Practice(ICSE-SEIP): 2020Best Paper Nominee, ACM SIGBED International Conference on Embedded Software (EMSOFT): 2019Young Elite Scientists Sponsorship Program, CAST (China Association for Science and Technology): 2018Microsoft Young Rising Star Program, Microsoft Aisa: 2017Distinguished Dissertation Award, China Computer Federation (CCF): 2015Selected Conference Publications （* means correspondence author）Zehong Yu, Zhuo Su, Rui Wang, and Yu Jiang*: Synthesizing Hardware-Specific Instructions for Efficient Code Generation of Simulink. ACM SIGSOFT International Conference on Software Engineering(ICSE), 2026. Zhiyong Wu, Jie Liang, Jingzhou Fu, Wenqian Deng, and Yu Jiang*: Fawkes: Finding Data Durability Bugs in DBMSs via Recovered Data State Verification. ACM Symposium on Operating Systems Principles (SOSP), 2025.Lihua Guo, Yiwei Hou, Chijin Zhou, Quan Zhang, and Yu Jiang*: Ransomware Detection through Temporal Correlation between Encryption and I/O Behavior. Proc. ACM Softw. Eng. 2 (FSE), 2025.Yiwei Hou, Lihua Guo, Chijin Zhou, Quan Zhang, Wenhuan Liu, Chengnian Sun, and Yu Jiang*: Preventing Disruption of System Backup against Ransomware Attacks. Proc. ACM Softw. Eng. 2 (ISSTA), 2025.Zhiyong Wu, Jie Liang, Jingzhou Fu, Wenqian Deng, and Yu Jiang*:  DDLUMOS: Understanding and Detecting Atomic DDL Bugs in DBMSs. USENIX Annual Technical Conference (ATC), 2025.Yuanliang Chen, Fuchen Ma, Yuanhang Zhou, Zhen Yan, and Yu Jiang*:  CAFault: Enhance Fault Injection Technique in Practical Distributed Systems via Abundant Fault-Dependent Configurations. USENIX Annual Technical Conference (ATC), 2025.Cundi Fang, Jie Liang, Zhiyong Wu, Jingzhou Fu, Zhouyang Jia, Chun Huang, Yu Jiang, Shanshan Li: DepState: Detecting Synchronization Failure Bugs in Distributed Database Management Systems. Proc. ACM Softw. Eng. 2 (ISSTA), 2025.Zhiyong Wu, Jie Liang, Jingzhou Fu, Mingzhe Wang, and Yu Jiang*: Hulk: Exploring Data-Sensitive Performance Anomalies in DBMSs via Data-Driven Analysis. Proc. ACM Softw. Eng. 2(ISSTA, Distinguished Paper Award), 2025.Fuchen Ma, Yuanliang Chen, Yuanhang Zhou, Zhen Yan, Hao Sun, and Yu Jiang*: \"Finding Metadata Inconsistencies in Distributed File Systems via Cross-Node Operation Modeling\". (USENIX Security), 2025.Jingzhou Fu, Jie Liang, Zhiyong Wu, Yanyang Zhao, Shanshan Li, and Yu Jiang*: \"Understanding and Detecting SQL Function Bugs: Using Simple Boundary Arguments to Trigger Hundreds of DBMS Bugs\". ACM European Systems Conference (EuroSys), 2025.Yuanliang Chen, Fuchen Ma, Yuanhang Zhou, Zhen Yan, Qing Liao, and Yu Jiang*: \"Themis: Finding Imbalance Failures in Distributed File Systems via a Load Variance Model\". ACM European Systems Conference (EuroSys), 2025.Chijin Zhou, Quan Zhang, Bingzhou Qian, and Yu Jiang*: \"JANUS: Detecting Rendering Bugs in Web Browsers via Visual Delta Consistency\". ACM SIGSOFT International Conference on Software Engineering(ICSE), 2025. Wenqian Deng, Jie Liang, Zhiyong Wu, Jingzhou Fu, Mingzhe Wang, and Yu Jiang*: \"CONI: Detecting Database Connector Bugs via State-Aware Test Case Generation \".  ACM SIGSOFT International Conference on Software Engineering(ICSE), 2025.Zhiyong Wu, Jie Liang, Jingzhou Fu, Mingzhe Wang, and Yu Jiang*: \"PUPPY: Finding Performance Degradation Bugs in DBMSs via Limited-Optimization Plan Construction\".  ACM SIGSOFT International Conference on Software Engineering(ICSE), 2025.Ying Fu, Zhiyong Wu, Yuanliang Zhang, Jie Liang, Jingzhou Fu, Yu Jiang, Shanshan Li, Xiangke Liao: \"THANOS: DBMS Bug Detection via Storage Engine Rotation Based Differential Testing\".  ACM SIGSOFT International Conference on Software Engineering(ICSE, Distinguished Paper Award), 2025.Zhuo Su, Zehong Yu, Dongyan Wang, Wanli Chang, Bin Gu, and Yu Jiang*: \"Test Case Generation for Simulink Models using Model Fuzzing and State Solving\". ACM SIGSOFT International Conference on Automated Software Engineering (ASE), 2024.Quan Zhang, Chijin Zhou, Gwihwan Go, Binqi Zeng, Heyuan Shi, Zichen Xu, and Yu Jiang*: \"Imperceptible Content Poisoning in LLM-Powered Applications\". ACM SIGSOFT International Conference on Automated Software Engineering (ASE), 2024.Jianzhong Liu, Yuheng Shen, Yiru Xu, and Yu Jiang*: \"Leveraging Binary Coverage for Effective Generation Guidance in Kernel Fuzzing\". ACM Conference on Computer and Communications Security (CCS), 2024.Chijin Zhou, Bingzhou Qian, Gwihwan Go, Quan Zhang, Shanshan Li, and Yu Jiang*: \"PolyJuice: Detecting Mis-compilation Bugs in Tensor Compilers with Equality Saturation Based Rewriting\". ACM SIGPLAN International Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA), 2024.Zhengxiong Luo, Junze Yu, Qingpeng Du, Yanyang Zhao, Feifan Wu, Heyuan Shi, Wanli Chang, and Yu Jiang*: \"Parallel Fuzzing of IoT Messaging Protocols through Collaborative Packet Generation\". ACM SIGBED International Conference on Embedded Software(EMSOFT), 2024.Qiang Zhang, Yuheng Shen, Jianzhong Liu, Yiru Xu, Heyuan Shi, Yu Jiang, and Wanli Chang: \"ECG: Augmenting Embedded Operating System Fuzzing via LLM-based Corpus Generation\". ACM SIGBED International Conference on Embedded Software(EMSOFT), 2024.Jie Liang, Mingzhe Wang, Chijin Zhou, Zhiyong Wu, Jianzhong Liu, and Yu Jiang*: \"Dodrio: Parallelizing Taint Analysis Based Fuzzing via Redundancy-Free Scheduling \". ACM SIGSOFT International Symposium on Foundations of  Software Engineering (FSE), 2024.Feifan Wu, Zhengxiong Luo, Yanyang Zhao, Qingpeng Du, Junze Yu, Ruikang Peng, Heyuan Shi, and Yu Jiang*: \"Logos: Log Guided Fuzzing for Protocol Implementations\". ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2024.Gwihwan Go, Chijin Zhou, Quan Zhang, Xiazijian Zou, Heyuan Shi, and Yu Jiang*: \"Towards More Complete Constraints for Deep Learning Library Testing via Complementary Set Guided Refinement\". ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2024.Yuheng Shen, Jianzhong Liu, Yiru Xu, Hao Sun, Mingzhe Wang, Nan Guan, Heyuan Shi, and Yu Jiang*: \"Enhancing ROS System Fuzzing through Callback Tracing\". ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA), 2024.Jie Liang, Zhiyong Wu, Jingzhou Fu, Yiyuan Bai, Qiang Zhang, and Yu Jiang*: \"WingFuzz: Implementing Continuous Fuzzing for DBMSs\". USENIX Annual Technical Conference (ATC), 2024.Mingzhe Wang, Jie Liang, Chijin Zhou, Zhiyong Wu, Jingzhou Fu, Zhuo Su, Qing Liao, Bin Gu, Bodong Wu, and Yu Jiang*: \"Data Coverage for Guided Fuzzing\". USENIX Security Symposium (SECURITY, Distinguished Paper Award), 2024.Jie Liang, Ming",
  "content_length": 39029,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:08"
}