{
  "name": "Jiaoyan Chen 0001",
  "homepage": "https://chenjiaoyan.github.io",
  "status": "success",
  "content": "Jiaoyan Chen Jiaoyan Chen Contact Information Office: 2.91, Kilburn Building, Oxford Road, Manchester M13 9PL UK Email: firstname.lastname@manchester.ac.uk, firstname4ai@gmail.com Hive, LinkedIn, CV, Google Scholar Biography Jiaoyan is a Senior Lecturer (Associate Professor) in Department of Computer Science, The University of Manchester. Before that, he was a Lecturer in Manchester (from Nov 2022), a Senior Researcher in Department of Computer Science, University of Oxford (with Prof. Ian Horrocks from Nov 2017), and a postdoctoral in Heidelberg University. Jiaoyan got his PhD and bachelor degrees both in Zhejiang University on Computer Science and Technology in 2016 and 2011, respectively. He was a visiting PhD in Department of Informatics, Zurich University from 2014 to 2015. News! 10 Nov: visit Shanxi University and give a presentation 9 Nov: one paper on benchmarking LLM reasoning accepted by AAAI'26 1 Nov: one paper on knowledge graph and RAG accepted by Information Fusion Research Interests Knowledge Representation: construction and curation of knowledge graphs and ontologies, semantic techniques. Machine Learning: knowledge representation learning, semantic embedding, neural-symbolic integration. Data and Knowledge Management for AI: evaluating and augmenting large language models (LLMs) with knowledge graphs, ontologies and structured data. PhD / MPhil Recruiting Please email me before applying online, if you have interests in the following PhD projects RAG project, LLM explanability and evaluation project, or other topics that fall into my scope. MPhil (research-oriented master, usually self-funded) applications are also welcomed. I am also open to application of visiting PhD, but only consider topics within my interests. As there are so many enquires and applicants, I will not be able to respond to all of them, but only those qualified (e.g., oversee PhD applicants require outstanding academic performance evidenced by more than one of the following: excellent transcripts, degree from top universities, top publications with key contributions, and outstanding final-year project mark). I apologize for that in advance. Recent Projects / Grants EPSRC New Investigator Award \"OntoEm: Semantic Embeddings for Ontologies\" (EP/Y017706/1), 2023 - 2026, PI. The Manchester-Melbourne-Toronto (MMT) Research Fund, \"AI-Driven Solutions for Child Protection: Utilizing LLMs and Knowledge Graph\" (collaborative research initiatives), 2024 - 2026, PI with Jia Xue from University of Toronto. EPSRC \"ConCur: Knowledge Graph Construction and Curation\" (EP/V050869/1), 2021 - 2025, Research Co-Investigator. Turing Innovation Catalyst Manchester (TICM) funded Collaborative R&D Project \"Multi-modal Semantic Search with Ontologies and Modern AI Techniques\", 2024 - 2025, PI. Turing-Manchester Feasibility Project \"Knowledge Graph for Explainability, Guidance and Human-in-the-loop in Machine Learning\", 2022 - 2023, PI. Recent Services Associate Editor of Transactions on Graph Data and Knowledge (TGDK) (2023 - ). Editor Board of Data Intelligence (2021 - ). Membership of EPSRC Peer Review College (2023 - ) Co-organiser of the OAEI Track Bio-ML in ISWC (2022 - 2024). PC/SPC/Area Chair of ISWC, The Web Conference, NeurIPS, ARR, etc. Regular proposal reviewer for main research grant bodies in the UK and EU including ERC, DFG and NWO. Publications Google Scholar, DBLP, Selected Selective Invited Talks and Tutorials Integrating Knowledge Graphs and Large Language Models for Advancing Scientific Research. Tutorial at ICDCS 2025, Glasgow, UK. 20/07/2025. Slides Ontology Embedding and Construction in the Large Language Model Era. Invited Talk in Southeast University, Nanjing. 10/01/2025. Slides Integrating Knowledge Graphs and Large Language Models for Advancing Scientific Research. Tutorial at Learning on Graph Conference (LoG), 26/11/2024. Slides Data Intensive Question Answering with Large Language Models. Invited Talk at University of Stuttgart. 31/10/2024. Slides Knowledge Engineering meets (Large) Language Models. Amazon Search Research Talk Series. 12/07/2024. Slides Neural-symbolic Knowledge Representation and Reasoning with Ontology and Knowledge Graph Embeddings. Seminar at King Abdullah University of Science and Technology (KAUST), 04/2024. Slides Knowledge-aware Zero-shot Learning (K-ZSL): Concepts, Methods and Resources. Tutorial in IJCAI 2023 (August 19 - 25). Software OWL2Vec* (an OWL ontology embedding framework) DeepOnto (a library for ontology engineering with language models and machine learning) Teaching in Manchester \"Data Engineering Technologies (COMP63502)\". 2025-2026. \"Advanced Topics in Knowledge Representation and Reasoning (COMP64602)\". 2025-2026. \"Data Engineering (COMP60711)\". 2024-2025. \"Querying Data on the Web (COMP62421)\". 2023-2024, 2024-2025. Current Research Students / Associates Hui Yang (Postdoctoral, 06/2024 - ) Jonathon Dilworth (Research Assistant, 07/2025 - ) Hira Beril Kucuk (PhD, 04/2025 - ) Hanhua Hong (PhD, 09/2024 - ) Yiping Song (PhD, 04/2024 - ) Ian Hyland (half-time PhD, 04/2024 - ) Zhenyu Wu (PhD, 09/2022 - ) Tianzhe Zhao (visiting PhD from Xi'an Jiaotong University, 01/2024 - ) Past Research Students / Associates Hang Dong (Postdoctoral, Department of Computer Science, University of Oxford, 2022 - 2024) Yuan He (PhD, Department of Computer Science, University of Oxford, 2020 - 2024) Melis Kupeli (Research Assistant, Alliance Manchester Business School, The University of Manchester, 2022 - 2023) Yuxia Geng (PhD, College of Computer Science and Technology, Zhejiang University, 2018 - 2023) Erik Bryhn Myklebust (PhD, NIVA & SIRIUS, University of OSLO, 2019 - 2022) (external co-supervisor) Mathias Jackermeier (MSc, Department of Computer Science, University of Oxford, 2022) Yan Zhou (MSc, GIScience, University of Heidelberg, 2016 - 2017)",
  "content_length": 5863,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:21"
}