{
  "name": "Jiaqi Wang 0002",
  "homepage": "https://jackqqwang.github.io",
  "status": "success",
  "content": "Jiaqi Wang Top Jiaqi (Jack) Wang Department of Computer Science and Software Engineering Auburn University 3106 Shelby Center Email: jqwang [at] auburn [dot] edu Bio I am an assistant professsor in Department of Computer Science and Software Engineering at Auburn University. I received my Ph.D. degree from The Pennsylvania State University in 2025, where I was advised by Prof. Fenglong Ma. My research interests include machine learning, healthcare informatics, foundation models, and large language models (LLMs). More about my research can be found in the Group Page. Prior to that, I obtained my M.S. from University of Georgia and B.E. from Zhejiang University. [Recruitment] The opportunities of Ph.D. students and research interns can be found in the Group Page. News [11/2025] Gave an invited talk in the Department of Statistics and Data Science at University of Central Florida. Thanks Dr. Xie's invitation. [10/2025] Gave an invited talk at UAB Medicine about AI for healthcare. Thanks Dr.Cimino's invitation and host. [08/2025] One paper was accepted by ICCV25 T2FM 2025 on federated foundation models. [08/2025] I joined the Department of CSSE at Auburn University as a tenure-track assistant professor. [07/2025] I was invited to serve as a PC for AAAI 2026. [05/2025] I joined Amazon as an applied research scientist summerintern. [05/2025] Two paper were accepted by Findings of ACL 2025. [05/2025] Two paper were accepted by KDD 2025. [05/2025] One paper was accepted by ICML 2025 on foundation model domain adaption. [04/2025] I was invited to serve as a reviewer for NeurIPS 2025. [03/2025] One paper was accepted by IJCNN 2025 on foundation models in FL. [02/17/25] I successfully passed my Ph.D. dissertation defense! Huge thanks to my advisor, committee members, labmates, and collaborators for their guidance and support throughout this journey. [01/2025] I was invited to serve as a reviewer for ICML 2025. [11/2024] One paper was accepted by KDD 2025 on healthcare disparities. [10/2024] One tutorial was accepted by AAAI 2025 on multimodal artificial intelligence in healthcare. [09/2024] One paper was accepted as a splotlight by NeurIPS 2024 Dataset and Benchmark on federated medical foundation models. [09/2024] One paper was accepted by NeurIPS 2024 on federated learning. [09/2024] One paper was accepted by ACM BCB 2024 on decentralized federated medical imaging as an oral presentation. [09/2024] Two paper were accepted by EMNLP 2024 (one main and one findings). [08/2024] One paper on scaling foundation model with federated learning won Best Paper Award at FL@FM-IJCAI'24. [05/2024] One paper was accepted by KDD 2024 on multimodal electronic health record synthesization via diffusion models. [05/2024] One paper was accepted by ACL 2024 main conference on collaborative pre-training across multimodal medical sources. [05/2024] One paper was accepted by ICML 2024 on federated learning. [04/2024] One survey paper \"Recent Advances in Predictive Modeling with Electronic Health Records\" was accepted by IJCAI 2024. [03/2024] Received the IST Ph.D. Student Award for Research Excellence, the highest honor for IST graduate students in research. Thank my advisor and collaborators! [02/2024] One tutorial was accepted by PAKDD 2024 on heterogeneity in federated learning. [02/2024] Received SDM 2024 Travel Award. [02/2024] One paper was accepted by LREC-Coling 2024 on automated ICD coding. [02/2024] Two paper were accepted by PAKDD 2024 on personalized federated learning (oral presentation) and foundation models in federated learning (poster). [01/2024] I was invited to serve as a PC member for IJCAI 2024. [01/2024] I will join Sony AI as a research intern working on foundation models in federated learning this spring. [12/2023] Two paper were accepted by SDM 2024 on EHR data generation with diffusion models and automated machine learning for risk prediction. [11/2023] One paper was accepted by AAAI 2024 on security of pre-trained models. [11/2023] One tutorial was accepted by SDM 2024 on heterogeneity in federated learning. [10/2023] One paper was accepted by International Workshop on Federated Learning in the Age of Foundation Models in Conjunction with NeurIPS 2023 on foundation model security in federated learning. [10/2023] Received NeurIPS 2023 Scholar Award. [10/2023] One paper was accepted by EMNLP 2023 on hierarchical pretraining using multimodal EHR data. [09/2023] One paper was accepted by Rare Disease and Orphan Drugs Journal on federated learning for rare disease detection. [09/2023] One paper was accepted by NeurIPS 2023 on heterogeneous model reassembly in FL. [09/2023] I was invited to serve as a PC member for SDM 2024. [08/2023] I was invited to serve as a reviewer for Learning on Graphs 2023. [08/2023] One survey paper \"Multimodal Federated Learning: A Survey\" was accepted by Sensors. [03/2023] Received KDD 2023 Travel Award. [06/2023] One paper was accepted by Federated Learning for Distributed Data Mining, KDD 2023 on heterogeneous model aggregation in FL. [06/2023] I was invited to serve as a reviewer for EMNLP 2023. [05/2023] I was invited to serve as a PC member for FL for Distributed Data Mining KDD 2023. [04/2023] I will join Visa Research as a machine learning research intern at the ATL office this summer. [03/2023] Received SDM 2023 Travel Award. [02/2023] Received IST College 2023 Travel Award. [02/2023] I was invited to serve as a reviewer for IEEE Transactions on Neural Networks and Learning Systems. [01/2023] I passed the comprehensive exam and became a Ph.D. candidate. [01/2023] I was invited to serve as a reviewer for AAAI 2023 Workshop for AI Acceleration. [12/2022] One paper was accepted by SDM 2023 on semi-supervised federated learning. [12/2022] I was invited to serve as a PC member for KDD 2023. [12/2022] I was invited to serve as a PC member for ACL 2023. [11/2022] I was invited to serve as a PC member for AAAI 2023 Workshop. [11/2022] Received IST College 2022 Travel Award. [10/2022] One paper was accepted by BIBM 2022 on automated medical risk predictive modeling on EHR. [10/2022] I was invited to serve as a reviewer for NeurIPS 2022 Workshop MetaLearn. [09/2022] I was invited to serve as a reviewer for Learning on Graphs 2022. [08/2022] One paper was accepted by ICDM 2022. [08/2022] I was invited to serve as a PC Member for FedGraph 2022. [07/2022] I was invited to serve as a PC Member for AAAI 2023. [06/2022] One paper was accepted by ECML PKDD 2022 on COVID-19 vaccine side effect prediction using federated learning. [03/2022] I will join Visa Research as a machine learning research intern this summer. [02/2022] I start to cooperate with Sony R&D Center to work on federated learning in multi-domain applications. [10/2021] One paper was accepted by BigData 2021 on semi-supervised federated learning. [04/2021] One paper was accepted by Asian Chi 2021. Thanks Dr. Ritter! [04/2021] I will join Analytics Center of Excellence, IQVIA as a machine learning research intern in 2021 summer. [03/2021] Received IST College 2021 Travel Award. [02/2021] I was invited to serve as a reviewer for ACL-IJCNLP 2021. [01/2021] One paper was accepted by AAAI Workshop 2021 and selected as Spotlight Presentation. [11/2020] I was invited to serve as a session chair at IEEE Cybermatics Congress 2020. [10/2020] I was invited to give a talk at Kennesaw State University. Thank Dr. Xu for host. [10/2020] One paper was accepted by W-NUT 2020. [09/2020] Served as an external reviewer for WSDM 2021. [08/2020] Served as an external reviewer for CCS 2020. [08/2020] I was invited to serve as a reviewer for IEEE IPCCC 2020. [06/2020] I was invited to serve as a reviewer for WASA 2020. [06/2020] I was invited to serve as a reviewer for Information Discovery and Delivery. [10/2019] I was invited to give a talk at the annual conference of Zhejiang University Alumni Association in North America. [08/2019] I moved from Georgia to Pennsylvania. Bye old friends and hi new friends! [03/2019] I received the 2019 Brahm Verma Graduate Leadership Award - Honorable Mention. [10/2018] I was invited to give a talk at the Youth Scholar Forum hold by Georgia Tech and Association of Chinese Professionals. Selected Publications Tutorials Tutorial: Multimodal Artificial Intelligence in Healthcare Jiaqi Wang, Xiaochen Wang, Yuan Zhong, Ziyi Yin, Aofei Chang, Cao Xiao, Fenglong Ma AAAI 2025 [Website] Tutorial: Heterogeneity in Federated Learning Jiaqi Wang, Fenglong Ma PAKDD 2024, SDM 2024 [Slides] Preprint Papers Survey on Neural Network Parameter Acquisition: from Optimization to Generation Jiaqi Wang, Yusen Zhang, Xi Li, Simeng Han, Zining Zhu, Lingjuan Lyu, Yaqing Wang, Ruiquan Huang, Arman Cohan, Rui Zhang, Sheng Li, Xin(Eric) Wang [Paper] NeuroGen: Neural Network Parameter Generation via Large Language Models Jiaqi Wang*, Yusen Zhang*, Xi Li* arXiv preprint arXiv:2505.12470 [Paper] Conference Papers 2025 Chain-of-Scrutiny: Detecting Backdoor Attacks for Large Language Models Xi Li, Ruofan Mao, Yusen Zhang, Renze Lou, Chen Wu, Jiaqi Wang Findings of ACL 2025 [Paper] Shadow-Activated Backdoor Attacks on Multimodal Large Language Models Ziyi Yin, Muchao Ye, Yuanpu Cao, Jiaqi Wang, Aofei Chang, Han Liu, Jinghui Chen, Ting Wang, Fenglong Ma Findings of ACL 2025 Towards Collaborative Fairness in Federated Learning Under Imbalanced Covariate Shift Tianrun Yu, Jiaqi Wang, Mingquan Lin, Han Liu, Nelson S. Yee, Fenglong Ma KDD 2025 MedDiTPro: A Prompt-Guided Diffusion Transformer for Multimodal Longitudinal Medical Data Synthesis Yuan Zhong, Xiaochen Wang, Jiaqi Wang, Xiaokun Zhang, Fenglong Ma KDD 2025 Enhancing Foundation Models with Federated Domain Knowledge Infusion Jiaqi Wang, Jingtao Li, Weiming Zhuang, Chen Chen, lingjuan Lyu, Fenglong Ma ICML 2025 Foundation Models in Federated Learning: Assessing Backdoor Vulnerabilities Xi Li, Chen Wu, Jiaqi Wang* IJCNN 2025 [Paper] Asymmetrical Reciprocity-based Federated Learning for Resolving Disparities ",
  "content_length": 19159,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:22"
}