{
  "name": "Jiatao Gu",
  "homepage": "https://jiataogu.me",
  "status": "success",
  "content": "Jiatao Gu - The Stars My Destination Toggle navigation The Stars My Destination Home About Team Publications Activities Welcome! I am an Assistant Professor in the Department of CIS at the University of Pennsylvania. I also work part-time as a Staff Research Scientist at Apple (MLR) and was a full-time researcher since 2022. Prior to joining Apple, I was a Research Scientist at Meta AI (FAIR Labs). I obtained my Ph.D. degree at the department of Electrical and Electronic Engineering, University of Hong Kong in 2018 and I was supervised by Prof. Victor O.K. Li. My doctoral work explored efficient neural machine translation systems. I also spent a wonderful time visiting the CILVR Lab, New York University working with Prof. Kyunghyun Cho. Before that, I obtained my Bachelor’s degree at the Electronic Engineering Department, Tsinghua University in 2014. Prospective Students I will be recruiting self-motivated PhD students, visiting students and research interns for this graduate application cycle. I encourage to use this form. Research Interests My research goal is to advance the capabilities of AI agents to interact with the physical world, with a special emphasis on leveraging generative machine learning approaches for world modeling, iterative reasoning, and effective decision-making. I am particularly interested in developing multi-modal generative models that span natural language, images, videos, and 3D, ensuring these models are Efficient, Flexible, Scalable, and Knowledgeable. By bridging foundational machine learning research with real-world applications, my research seeks to create robust AI systems capable of operating seamlessly in complex and dynamic environments. Jiatao Gu (顾佳涛) 2018, Ph.D. EEE, HKU 2014, B.Eng. EE, THU News 18 Sep, 2025 Four paper was accepted by NeurIPS 2025.. 10 Aug, 2025 One paper was accepted by SIGGRAPH ASIA 2025.. 1 May, 2025 One paper was accepted by ICML 2025.. 26 Feb, 2025 Two papers were accepted by CVPR 2025.. ... see all News I will be attending #ICML2025 Tue to Sat at Vancouver. Please also come and check our oral presentation and spotlight poster on TARFlow on Thu:https://t.co/I3aQg3TDG5Looking forward to chatting with old and new friends on next-gen generative models and world models!! — Jiatao Gu (@thoma_gu) July 14, 2025 © 2024 The Stars My Destination Contact Jiatao via email: jiataogu32_AT_gmail.com (personal) jgu32_AT_apple.com (Apple) jgu32_AT_cis.upenn.edu (Penn) Coordinates: 11 Penn Plaza, New York, NY, 10001, United States 3333 Chestnut Street, Philadelphia, PA, 19104, United States",
  "content_length": 2580,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:22"
}