{
  "name": "Jiawei Yuan",
  "homepage": "https://www.umassd.edu/directory/jyuan",
  "status": "success",
  "content": "Jiawei Yuan | UMass Dartmouth Skip to main content Toggle share controls Share on Facebook Share this on X Share on LinkedIn Print this page Email this page Copy URL Link copied to clipboard! University of Massachusetts Dartmouth faculty Jiawei Yuan Associate ProfessorComputer & Information Science Research Website Contact 508-999-8299 etp\\i;ph\\nn_)`_p Dion 308A Education2015University of Arkansas Little RockPhD2011University of Electronic Science and Technology of ChinaBS TeachingProgramsProgramsComputer Science BS, BS/MSComputer Science Cybersecurity Computer Science MSEngineering and Applied Science PhD Teaching Courses CIS 452: Database Systems Use of DBMS software in the development of an information system. Overview of the ANSI/SPARC Study Group on Database Management Systems model. Relational database model techniques. Emphasis on user views necessary to support data management and retrieval. CIS 580: Paradigmatic Sftware Dev Software development in the context of various paradigms. The strategies and methods of the procedural, object-oriented, and functional paradigms are studied and practiced. The modeling of software processes will be considered from both the process and product views, as will the appropriateness and measures of effectiveness of these processes in the design of software systems. Students will apply these measures to the course exercises, determining and reviewing the impact of these methods on individual design. CIS 600: Master's Project Prerequisites: Completion of three core courses.   Development of a detailed, significant project in computer science under the close supervision of a faculty member, perhaps as one member of a student team. This project may be a software implementation, a design effort, or a theoretical or practical written analysis. Project report with optional oral presentation must be evaluated by three faculty members including the project supervisor. DSC 690: Master's Thesis Written presentation of an original research topic in Data Science which demonstrates the knowledge & capability to conduct independent research. The thesis shall be completed under the supervision of a faculty advisor. An oral examination in defense is required. EAS 701: Doctoral Dissertation Research Investigations of a fundamental and/or applied nature representing an original contribution to the scholarly research literature of the field. PhD dissertations are often published in refereed journals or presented at major conferences. A written dissertation must be completed in accordance with the rules of the Graduate School and the College of Engineering. Admission to the course is based on successful completion of the PhD comprehensive examination and submission of a formal proposal endorsed by the student's graduate committee and submitted to the EAS Graduate Program Director. Teaching Online and Continuing Education Courses CIS 580: Paradigmatic Sftware Dev Software development in the context of various paradigms. The strategies and methods of the procedural, object-oriented, and functional paradigms are studied and practiced. The modeling of software processes will be considered from both the process and product views, as will the appropriateness and measures of effectiveness of these processes in the design of software systems. Students will apply these measures to the course exercises, determining and reviewing the impact of these methods on individual design. ResearchResearch awards $ 299,999 awarded by National Science Foundation for Collaborative Research: CISE-MSI: DP: OAC: Integrated and Extensible Platform for Rethinking the Security of AI-assisted UAV Paradigm$ 8,844 awarded by University of Maryland Baltimore County for SaTC: EDU: Collaborative: Bolstering UAV Cybersecurity Education through Curriculum Development with Hands-on Laboratory Framework$ 240,000 awarded by National Science Foundation for Collaborative Research: Building Cybersecurity Mindset through Continuous Cross-module Learning$ 1,218,640 awarded by National Science Foundation for CyberCorps Scholarship for Service: Accelerating Cybersecurity Education, Scholarship and Service$ 140,000 awarded by the National Science Foundation for Collaborative Research: CyberTraining: Pilot: Operationalizing AI/Machine Learning for Cybersecurity Training Latest from Jiawei Mentioned inJul 21, 2023 Jiawei Yuan receives $240K NSF grant Jan 31, 2023 The CyberCorps Scholarship for Service: Accelerating Cybersecurity Education, Scholarship and Service Contact 508-999-8299 etp\\i;ph\\nn_)`_p Dion 308A Search staff directory Profile edit +t4 Back to top of screen CLOSE MAIN MENU Check My Status myUMassD Support UMassD Directory Search",
  "content_length": 4699,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:23"
}