{
  "name": "Jiawei Jiang",
  "homepage": "http://bluesjjw.github.io",
  "status": "success",
  "content": "Jiawei Jiang's Resume About me I am a full professor in School of Computer Science of Wuhan University. I obtained my Ph.D in Computer Science from Peking University in 2018, M.Sc from University of Chinese Academy of Sciences in 2014, and B.Sc from University of Science Technology of China in 2011 respectively. And I worked in Data Platform Department of Tencent as a senior researcher from 2018 to 2019, and a postdoc researcher in Department of Computer Science of ETH Zürich from 2019 to 2022. Education Research interests: Big data processing and analysis, distributed machine learning, distributed optimization Thesis: Distributed Gradient Optimization of Machine Learning Algorithm Research interests: Multimedia on mobile devices, near duplicate video retrieval, web crawler, network load balancing Thesis: Research and Implementation of Video Aggregation and Multi-Screen Service System Thesis: Implementation of Distributed Load Balance System on Nginx Employment Publications - Jiawei Jiang, Yusong Hu, Xiaosen Li, Wen Ouyang, Zhitao Wang, Fangcheng Fu, Bin Cui. Analyzing Online Transaction Networks with Network Motifs. SIGKDD. 2022. - Lijie Xu, Shuang Qiu, Binhang Yuan, Jiawei Jiang, et al. In-Database Machine Learning with CorgiPile: Stochastic Gradient Descent without Full Data Shuffle. SIGMOD, 2022. - Jiawei Jiang, Shaoduo Gan, Yue Liu, Fanlin Wang, Gustavo Alonso, Ana Klimovic, Ankit Singla, Wentao Wu, Ce Zhang. Towards Demystifying Serverless Machine Learning Training. SIGMOD, 2021. - Fangcheng Fu, Yingxia Shao, Lele Yu, Jiawei Jiang, Huanran Xue, Yangyu Tao, Bin Cui. VF2Boost: Very Fast Vertical Federated Gradient Boosting for Cross-Enterprise Learning. SIGMOD, 2021. - Xupeng Miao, Xiaonan Nie, Yingxia Shao, Zhi Yang, Jiawei Jiang, Lingxiao Ma, Bin Cui. Heterogeneity-Aware Distributed Machine Learning Training via Partial Reduce. SIGMOD, 2021. - Yang Li, Yu Shen, Wentao Zhang, Yuanwei Chen, Huaijun Jiang, Mingchao Liu, Jiawei Jiang, Jinyang Gao, Wentao Wu, Zhi Yang, Ce Zhang, Bin Cui. Openbox: A generalized black-box optimization service. SIGKDD, 3209-3219, 2021. - Yang Li, Yu Shen, Wentao Zhang, Jiawei Jiang, Bolin Ding, Yaliang Li, Jingren Zhou, Zhi Yang, Wentao Wu, Ce Zhang, Bin Cui. VolcanoML: speeding up end-to-end AutoML via scalable search space decomposition. VLDB, 2021. - Yang Li, Shen Yu, Jiawei Jiang, Jinyang Gao, Ce Zhang, Bin Cui. MFES-HB: Efficient Hyperband with Multi-Fidelity Quality Measurements. AAAI, 2021. - Xupeng Miao, Wentao Zhang, Yingxia Shao, Bin Cui, Lei Chen, Ce Zhang, Jiawei Jiang. Lasagne: A multi-layer graph convolutional network framework via node-aware deep architecture. TKDE, 2021. - Yang Li, Jiawei Jiang, Jinyang Gao, Yingxia Shao, Ce Zhang, Bin Cui. Efficient Automatic CASH via Rising Bandits. AAAI Conference on Artificial Intelligence, 2020. - Fangcheng Fu, Yuzheng Hu, Yihan He, Jiawei Jiang, Yingxia Shao, Zhang Ce, Bin Cui. Don’t Waste Your Bits! Squeeze Activations and Gradients for Deep Neural Networks via TinyScript. Thirty-seventh International Conference on Machine Learning (ICML), 2020. - Jiawei Jiang, Pin Xiao, Lele Yu, Xiaosen Li, Jiefeng Cheng, Xupeng Miao, Zhipeng Zhang, Bin Cui. PSGraph: How Tencent trains large-scale graphs with Spark? IEEE International Conference on Data Engineering (ICDE) (Industry track), 2020. - Zhipeng Zhang, Wentao Wu, Jiawei Jiang, Lele Yu, Bin Cui. ColumnSGD: A Column-oriented Framework for Distributed Stochastic Gradient Descent. IEEE International Conference on Data Engineering (ICDE), 2020. - Wentao Zhang, Jiawei Jiang, Yingxia Shao, Bin Cui. Efficient Diversity-Driven Ensemble for Deep Neural Networks. IEEE International Conference on Data Engineering (ICDE), 2020. - Jiawei Jiang, Fangeheng Fu, Tong Yang, Yingxia Shao, Bin Cui. SKCompress: compressing sparse and nonuniform gradient in distributed machine learning. The VLDB Journal, 2020. - Yunyan Guo, Zhipeng Zhang, Jiawei Jiang, Wentao Wu, Ce Zhang, Bin Cui, Jianzhong Li. Model Averaging in Distributed Machine Learning: A Case Study with Apache Spark. The VLDB Journal, 2020. - Xupeng Miao, Lingxiao Ma, Zhi Yang, Yingxia Shao, Bin Cui, Lele Yu, Jiawei Jiang. CuWide: Towards Efficient Flow-based Training for Sparse Wide Models on GPUs. IEEE Transactions on Knowledge and Data Engineering (TKDE), 2020. - Wentao Zhang, Xupeng Miao, Yingxia Shao, Jiawei Jiang, Lei Chen, Olivier Ruas, Bin Cui. Reliable Data Distillation on Graph Convolutional Network. ACM SIGMOD International Conference on Management of Data, 2020. - Fangeheng Fu, Jiawei Jiang, Yingxia Shao, Bin Cui. An experimental evaluation of large scale GBDT systems. Proceedings of the VLDB Endowment, 2019. - Zhipeng Zhang, Bin Cui, Yingxia Shao, Lele Yu, Jiawei Jiang, Xupeng Miao. PS2: Parameter server on Spark. ACM SIGMOD International Conference on Management of Data, 2019. - Zhipeng Zhang, Jiawei Jiang, Wentao Wu, Ce Zhang, Lele Yu, Bin Cui. MLlib*: Fast training of GLMs using Spark MLlib. IEEE International Conference on Data Engineering (ICDE), 2019. - Haobo Sun, Yingxia Shao, Jiawei Jiang, Bin Cui, Kai Lei, Yu Xu, Jiang Wang. Sparse Gradient Compression for Distributed SGD. The 24th International Conference on Database Systems for Advanced Applications (DASFAA), 2019. - Huanran Xue, Jiawei Jiang, Yingxia Shao, Bin Cui. FeatureBand: A Feature Selection Method by Combining Early Stopping and Genetic Local Search. Asia-Pacific Web (APWeb) and Web-Age Information Management (WAIM) Joint International Conference on Web and Big Data, 2019. - Jiawei Jiang, Bin Cui, Ce Zhang, Fangcheng Fu. DimBoost: Boosting Gradient Boosting Tree to Higher Dimensions. ACM SIGMOD International Conference on Management of Data, 2018. - Jiawei Jiang, Fangcheng Fu, Tong Yang, Bin Cui. SketchML: Accelerating Distributed Machine Learning with Data Sketches. ACM SIGMOD International Conference on Management of Data, 2018. - Jiawei Jiang, Ming Huang, Jie Jiang, Bin Cui. TeslaML: Steering Machine Learning Automatically In Tencent. APWeb-WAIM Joint Conference on Web and Big Data, 2017. - Jie Jiang, Jiawei Jiang, Bin Cui, Ce Zhang. TencentBoost: A Gradient Boosting Tree System with Parameter Server. IEEE International Conference on Data Engineering (ICDE), 2017. - Jiawei Jiang, Bin Cui, Ce Zhang, Lele Yu. Heterogeneity-aware Distributed Parameter Servers. ACM SIGMOD International Conference on Management of Data, 2017. - Jiawei Jiang, Zhipeng Zhang, Bin Cui, Yunhai Tong, Ning Xu. StroMAX: Partitioning-based Scheduler for Real-time Stream Processing System. The 22nd International Conference on Database Systems for Advanced Applications (DASFAA), 2017. - Jiawei Jiang, Yunhai Tong, Hua Lu, Bin Cui, Kai Lei, Jie Jiang, Lele Yu. GVoS: A General System for Near-Duplicate Video Related Applications on Storm. ACM Transactions on Information System (TOIS), 2017. - Jie Jiang, Lele Yu, Jiawei Jiang, Yihong Liu, Bin Cui. Angel: A new large scale machine learning system. National Science Review, 2017. - Jiawei Jiang, Haojiang Deng, Xue Liu. A Predictive Dynamic Load Balancing Algorithm with Service Differentiation, The 15th IEEE International Conference on Communication Technology, 2013. - Distributed machine learning method and system. US Patent App. 16/266,559. - Data Management Method and Equipment (数据处理方法及装置), 201710327036.4. - A Method and Equipment of Multimedia Retrieval (一种多媒体信息检索方法及装置), 201710326718.3. - Parameter Server Based Implementation and Equipment of GBDT (基于参数服务器的梯度提升决策树的实现方法及相关设备), 201710326930.X. - A Distributed Machine Learning Method and System (分布式机器学习方法和系统), 201610968121.4. - A Dynamic Load Balancing Method Based on Resource Prediction (一种基于资源消耗预测的动态负载均衡方法及装置), 201310029902.3. - A Duplicate Video Removal Method (一种视频内容去重的处理方法), 201310221597.8. - A Video Aggregation Method and System Based on Popular Topics of Microblogs (一种基于微博热门话题的视频聚合方法及系统), 201310566249.4. - A Fast Switch Device and Method for VOD Between Screens (一种实现多屏间的视频点播快速切换装置及方法), 201410008421.9. - A Crawler for Video Source and Content (一种视频内容及内容源爬取方法), 201310022725.6. Professional Services VLDB: 2023 KDD: 2019, 2020, 2021 ICDE: 2022 AAAI: 2021, 2022 TKDE: 2020, 2021, 2022 VLDBJ: 2022 TMM: 2022 SysML: 2019 DASFAA: 2020, 2021, 2022 CIKM: 2020 WISE: 2021 SDM: 2022 Honors CCF Outstanding Doctoral Dissertation Award, 2019 ACM China Doctorial Dissertation Award, 2018 Outstanding Graduate Award (Top 2%), 2018 Outstanding Doctoral Thesis (Top 1%), 2018 Top Research Student Award (Top 1%), 2018 National Scholarship (Top 1%), 2017 Outstanding Student, 2017 President Scholarship (Top 2%), 2017 National Scholarship (Top 2%), 2013 Outstanding Student, 2013 First-class Scholarship (Top 5%), 2010 Skills Java, Scala, Python C/C++, Objective-C, Android/iOS Development, Javascript, HTML Spark, Hadoop, Storm, PyTorch, Tensorflow, Sklearn Hive, MySql, MongoDB, Lucene, Kafka Social activities Online donation system development and mantainance. Hobbies Sports, Music, Movies, Travelling. >",
  "content_length": 8963,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:22"
}