{
  "name": "Jiawei Zhang 0001",
  "homepage": "http://jiaweizhang.net",
  "status": "success",
  "content": "Jiawei Zhang | Homepage Jiawei Zhang Associate Professor IFM Lab Director Department of Computer Science University of California, Davis About Me (CV) I'm an Associate Professor in the Department of Computer Science at University of California, Davis. I founded IFM Lab in 2017, and have been working as the director since then. IFM Lab is a research oriented academic laboratory, providing the latest academic research works and application tools to both academia and industry. Publication Project IFM.py Toolkit Textbook Course Data Award (2012 - Present) Best Student Paper Runner Up Award, ASONAM (2016) SIGIR Student Travel Award, CIKM (2016) Student Travel Award, KDD (2015) Student Travel Award, IEEE CIC, 2016 Student Travel Award, ICDM (2015) Student Travel Award, WSDM (2014) UIC Scholar Travel Grant (2014) Service Information Specialist Information Director and Information Specialist, ACM Transactions on Knowledge Discovery from Data (TKDD) Conferences Session Chair ASONAM: IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining, Session 7C: Adversarial/Trust 2, ASONAM (2016) Conferences Program Committee ACM SIGKDD Conference of Knowledge Discovery and Data Mining, KDD 2016 ACM International Conference on Information and Knowledge Management, CIKM 2015, CIKM 2016, CIKM 2017 Asia Information Retrieval Societies Conferenc, AIRS 2016, AIRS 2017 IEEE International Conference on Information Reuse and Integration, IRI 2017 International Conference on Data Mining, ICDM 2017 International World Wide Web Conference, WWW 2017 International Conference on Data Analytics, DATA ANALYTICS 2016 International Conference on Advanced Data Mining and Applications, ADMA 2017 Journals Reviewer TKDD: ACM Transactions on Knowledge Discovery from Data, (2013, 2014, 2015) TKDE: ACM Transactions on Knowledge and Data Engineering, (2014) Contact E-mail: jiwzhang [AT] ucdavis [dot] edu Address 2075 Academic Surge Building 1124 Crocker Ln Department of Computer Science University of California, Davis Davis, CA 95616 United States",
  "content_length": 2065,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:24"
}