{
  "name": "Jiaxuan You",
  "homepage": "https://cs.stanford.edu/people/jiaxuan",
  "status": "success",
  "content": "Jiaxuan You's Homepage Assistant Professor Siebel School of Computing and Data Science University of Illinois at Urbana-Champaign Email: jiaxuan@illinois.edu [Google Scholar] [Github] I am currently an Assistant Professor at UIUC CS, started from 2024 Fall. I lead the amazing U Lab @ UIUC. I received my Ph.D. and M.S. degrees from Department of Computer Science, Stanford University, advised by Prof. Jure Leskovec. I was supported by JPMC PhD Fellowship and Baidu Scholarship during my PhD. My research leads to Kumo AI, where I built the first graph learning predictive system for relational databases as a core founding member from 2021 to 2023. In the past, I have developed data-driven methods to study our interconnected world. I am broadly interested in deep learning for graphs, relational data, and databases. I am also excited about knowledge-augmented LLMs and multi-modal foundation models. You may also check out a summary of my past research: Core graph/relational learning methods: Learning from graphs [NeurIPS 2018b/2019b/2020a, ICML 2019, AAAI 2021]; Generating & optimizing graphs [ICML 2018, NeurIPS 2018a/2019a] Democratize graph learning: Software and systems that make graph learning accessible to researchers and practitioners [GraphGym, PyG, Kumo AI] Graph-inspired machine learning: Neural architecture design [ICML 2020], multi-task learning [ICLR 2022], deep learning with missing data [NeurIPS 2020b]. Interdisciplinary applications: crop yield prediction [AAAI 2017], drug discovery [NeurIPS 2018a], recommender systems [WWW 2019], financial transactions [KDD 2022], relational database [Kumo AI] Ultimately, my research lab aims at building AGI in the digital world. AI Agent: Exploring methodologies to enable AI to utilize tools and optimize itself based on those tools. ML System: Strategies to enhance the inference and training of Large Language Models (LLMs) & Foundation Models, and facilitate their deployment and application. Empowering AI with Relational Data: Investigating the utilization of AI to analyze and comprehend the interconnected digital world. AI and Beyond: Delving into how AI research can profoundly reshape the future of scientific research and the broader human society. We warmly welcome students to propose new directions and insights. Together, we will strive towards the goal of realizing AGI in the Digital World. Prospective student Given the large number of requests that I receive daily, I may not be able to respond to all of them. Thank you for your understanding! PhD openings: I am looking for multiple self-motivated PhD students starting in 2025 Fall (application occurs in Dec 2024). Students with strong ML or ML system background are preferred (e.g., could you explain data, model, tensor, pipeline, and FSDP parallelism?). If you are a prospective PhD student, I highly suggest reaching out to me early so that we can both check if there is a fit between us. Intern openings: I am also looking for self-motivated remote intern students starting at any time. Similarly, students with strong ML or ML system background are preferred. I would prefer that you are interested in working with me as a PhD student in the long run. Email format: \"Interested in {position, e.g., Ph.D.} at {expected time, e.g., Fall 2025}â): - CV: Include your background, experiences, and future research interests. - Research: Summarize any projects, publications, and open-source software you have done. - Why Us?: Any research work from me that you are interested in. Mention any new topics (could be fully unrelated to my past research) that you would like to explore. Google Form: You may also register your information on this Google Form. I will make sure to check out your information during the application process. News [2024/01] I am organizing the ICLR 2024 AGI Workshop: How Far Are We From AGI. We are fortunate to have Yoshua Bengio, Yejin Choi, and Joshua Tenenbaum as our invited speakers. Welcome to submit your works (7 or 9 pages, ICLR format) to the workshop before Feb 9! [2023/10] We have released DBGym, a user-friendly platform for ML research and application on databases. Please try it out by simply pip install dbgym! [2023/08] I am leading the NeurIPS 2023 Workshop: New Frontiers in Graph Learning (GLFrontiers) with amazing colleagues again! Looking forward to your submissions and seeing you at New Orleans! [2023/01] I am excited to be the Guest Instructor for Stanford CS224W: Machine Learning with Graphs with 300+ enrolled students, where I have taught 6 lectures on graph machine learning in-person. [2022/08] I gave an invited talk and joined as a panelist at KDD 2022 Workshop: Knowledge Graphs & Open Knowledge Network. I also presented my paper at the KDD 2022 research track. [2022/08] I am organizing the NeurIPS 2022 Workshop: New Frontiers in Graph Learning (GLFrontiers) with amazing colleagues! The submission is due Sept 15, 2022. Looking forward to your submissions! [Official Workshop website] [OpenReview submission site] [2022/04] Kumo AI officially announced the $18.5 million Series A funding led by Sequoia! I have been leading the development of the relational learning engine for cloud databases at Kumo over the past year. [Official post] [Forbes] [Yahoo] [Business Wire] [2021/09] I graduated from Stanford University with Ph.D. and M.S. degrees in Computer Science! Here is my Ph.D. Thesis -- Empowering Deep Learning with Graphs . [2021/09] I gave two invited talks at Stanford Graph Learning Workshop 2021 . The event has received amazing attention -- over 7000 attendees have attended the event! Talk 1: Graph Learning in Financial Networks [Slides] [Video] Talk 2: GraphGym: Easy-to-use API for Graph Learning [Slides] [Video] [2021/09] I am officially a core lead at PyG (PyTorch Geometric) Team. PyG is the most popular graph learning library with 14K Github stars. I have integrated my GraphGym platform into PyG to support end-to-end automated graph learning. [2021/08] I gave two invited talks on Graph Neural Networks at Mercari and Fidelity [Slides] [2021/04] Stanford CS224W 2021 is posted on Youtube! As the Head TA, I led the course design this year. Enjoy the course! [CS224W 2021 slides], [CS224W 2021 Youtube playlist] [2021/04] I am fortunate to receive JPMC PhD Fellowship and Baidu Scholarship [2020/10] I released GraphGym, an easy-to-use platform for designing and evaluating GNNs. Welcome to try it out! Work/Teaching Experience Pinterest, Research Intern June 2018 - Sept 2018 Mentor: Aditya Pal, Pong Eksombatchai, Chuck Rosenberg Developed large-scale dynamic recommender systems, published on WWW 2019. Facebook AI Research (FAIR), Research Intern June 2019 - Feb 2020 Mentor: Saining Xie, Kaiming He Graph Inspired Neural Network architecture design, published on ICML 2020. Stanford CS224W, Head TA Jan 2021 - Apr 2021 Course Materials: CS224W 2021 slides, CS224W 2021 Youtube playlist (live update every Tuesday/Thursday!) I lead the TA team to completely redesign the Stanford CS224W course in 2021. Now the course covers most of the state-of-the-art topics on graph representation learning. Among the slides I have created, I especially love Lecture 7 and Lecture 8 on Graph Neural Networks. There, based on the insights from my research, I gave general, in-depth and practical discussions on how to build a GNN system, which are greatly appreciated by the students. I gave a live lecture on Lecture 20 on GNN design space as well. Kumo AI, Founding member 2021 - June 2023 I built the first proof-of-concept learning pipeline on relational database via graph learning. I have been leading the development of the relational learning engine for cloud databases at Kumo AI. Professional Services Senior Program Committee member: IJCAI 2021 Program Committee member / Reviewer: Journals: IEEE TPAMI (20+ times), other IEEE/ACM Journals (20+ times) Conferences: NeurIPS 2019(top reviewer award)/2020/2021/2022, ICML 2019/2020/2021/2022, ICLR 2021/2022, KDD 2021/2022, WWW 2020/2021/2022, AAAI 2020, IJCAI 2022, SIGGRAPH 2019, ICWSM 2020/2021, Worshops: NeurIPS 2018/2019, ICLR 2019, ICML 2019/2020, on Graph/Relational representation learning Open-source Software PyG (Pytorch Geometric): Graph Neural Network Library for PyTorch. [Github (14K+ stars)] [Homepage] [Documentation] GraphGym: Platform for designing and evaluating Graph Neural Networks (GNN). [Github (~1K stars)] [Paper] [Webpage] DeepSNAP: Python library assists deep learning on graphs. [Github] [Documentation] Publications AutoTransfer: AutoML with Knowledge Transfer -- An Application to Graph Neural Networks Kaidi Cao, Jiaxuan You, Jiaju Liu, Jure Leskovec International Conference on Learning Representations (ICLR 2023) [PDF] ROLAND: Graph Learning Framework for Dynamic Graphs Jiaxuan You, Tianyu Du, Jure Leskovec 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2022) [PDF] [Code] Relational Multi-Task Learning: Modeling Relations between Data and Tasks Kaidi Cao*, Jiaxuan You*, Jure Leskovec 10th International Conference on Learning Representations (ICLR 2022) Spotlight presentation [PDF] [Code] On the Opportunities and Risks of Foundation Models Rishi Bommasani, ..., Jiaxuan You, ..., Percy Liang [PDF] Empowering Deep Learning with Graphs Jiaxuan You Ph.D. Thesis in Computer Science, 2021, Stanford University [PDF] Identity-aware Graph Neural Networks Jiaxuan You, Jonathan Gomes-Selman, Rex Ying, Jure Leskovec 35th AAAI Conference on Artificial Intelligence (AAAI 2021) [PDF] [Code] [Webpage] Design Space for Graph Neural Networks Jiaxuan You, Rex Ying, Jure Leskovec 34th Conference on Neural Information Processing Systems (NeurIPS 2020a) Spotlight presentation [PDF] [Code] [Webpage] Handling Missing Data with Graph Neural Networks Jiaxuan You*, Xiaobai Ma*, Daisy Yi Ding*, Mykel Kochenderfer, Jure Leskovec 34th Conference on Neural Information Processing Systems (NeurIPS 2020b) [PDF] [Code] [Webpage] Graph Structure of Neural Networks",
  "content_length": 18248,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:24"
}