{
  "name": "Jiaxin Ding 0001",
  "homepage": "https://jhc.sjtu.edu.cn/~jiaxinding",
  "status": "success",
  "content": "Jiaxin Ding Search Jiaxin Ding Tenure-Track Associate Professor Shanghai Jiao Tong University Biography Hi, I’m Jiaxin Ding. I am currently a tenure-track associate professor in the John Hopcroft Center for Computer Science, Shanghai Jiao Tong University. I received Ph.D. degree from Computer Science, Stony Brook University in 2018, under the advisory of Prof. Jie Gao and B.S. degree from Electronics Engineering and Computer Science, Peking University in 2012. I worked as a postdoc researcher with Prof. Xin Liu in Computer Science, University of California, Davis, from Jan. 2019 to Dec. 2019. Perspective Students I am always looking for self-motivated students who are interested in pursuing master’s or Ph.D. degrees in the areas of Structure-aware Learning, Reinforcement Learning, and Privacy Protection. Please feel free to send me an email if you are interested. Group Members Ph.D.: Fan Xu, Shiqing Gao, Yule Xie, Yijun Zhang, Zhuo Wang Master: Haochen Han, Sibo Zhang, Xin Ding, Haoxiang Zhang Master Alumni: Shichuan Xi (Business Analyst, Huatai Securities), Jiaqi Zhai (Algorithm Engineer, Kuaishou), Bowen Zhang (Algorithm Engineer, Baidu), Kailong Wu (Software Engineer, Shanghai Shantai Information Technology) Interests Structure-aware Learning Reinforcement Learning Privacy Protection Education Ph.D. in Computer Science, 2012-2018 Stony Brook University B.S. in Artificial Intelligence, 2008-2012 Peking University B.A. in Economics(double major), 2009-2012 Peking University Publications Shiqing Gao, Yihang Zhou, Shuai Shao, Haoyu Luo, Yiheng Bing, Jiaxin Ding, Luoyi Fu, Xinbing Wang, âExtreme Value Policy Optimization for Safe Reinforcement Learningâ, International Conference on Machine Learning (ICML), 2025. Shiqing Gao, Jiaxin Ding, Luoyi Fu, Xinbing Wang, âControlling Underestimation Bias in Constrained Reinforcement Learning for Safe Explorationâ, International Conference on Machine Learning (ICML), 2025. Yutong Zhang, Lixing Chen, Shenghong Li, Nan Cao, Yang Shi, Jiaxin Ding, Zhe Qu, Pan Zhou, Yang Bai, âWay to Specialist: Closing Loop Between Specialized LLM and Evolving Domain Knowledge Graphâ, ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), 2025. Yi Xu, Luoyi Fu, Shuqian Sheng, Bo Xue, Jiaxin Ding, Lei Zhou, Xinbing Wang, Chenghu Zhou, âDeepReport: An AI-assisted Idea Generation System for Scientific Researchâ, ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR), 2025. Cheng Xin, Fan Xu, Xin Ding, Jie Gao, Jiaxin Ding, âTopInG: Topologically Interpretable Graph Learning via Persistent Rationale Filtrationâ, International Conference on Machine Learning (ICML), 2025. Yule Xie, Jiaxin Ding, Pengyu Xue, Xin Ding, Haochen Han, Luoyi Fu, Xinbing Wang, âLeveraging Homophily under Local Differential Privacy for Effective Graph Neural Networksâ, European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML PKDD), 2025. Yiwei Xu, Xiumian Hu, Eduardo Garzanti, Jiexing Qi, Huquan Kang, Hanqi Nong, Luwen Wu, Jiaxin Ding, Xinbing Wang, Chengshan Wang, âA Century of Knowledge Growth in Sedimentologyâ, Gondwana Research, 2025. Huquan Kang, Hanyan Dong, Yuang Ding, Zhouyang Jin, Luoyi Fu, Jiaxin Ding, Xinbing Wang, Lei Zhou, Chenghu Zhou, âDeep Learning and COVID-19: Two Pathways to Scientific Evolutionâ, Applied Sciences, 2025. Huawei Ji, Cheng Deng, Bo Xue, Zhouyang Jin, Jiaxin Ding, Xiaoying Gan, Luoyi Fu, Xinbing Wang, Chenghu Zhou, âAceParse: A Comprehensive Dataset with Diverse Structured Texts for Academic Literature Parsingâ, IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2025. Kailong Wu, Yule Xie, Jiaxin Ding, Yuxiang Ren, Luoyi Fu, Xinbing Wang, Chenghu Zhou, âCharacterizing the Influence of Topology on Graph Learning Tasksâ, International Conference on Database Systems for Advanced Applications (DASFAA), 2024. Shuqian Sheng, Yi Xu, Luoyi Fu, Jiaxin Ding, Lei Zhou, Xinbing Wang, Chenghu Zhou, âIs Reference Necessary in the Evaluation of NLG Systems? When and Where?â, North American Chapter of the Association for Computational Linguistics (NAACL-HLT), 2024. Shuqian Sheng, Yi Xu, Tianhang Zhang, Zanwei Shen, Luoyi Fu, Jiaxin Ding, Lei Zhou, Xiaoying Gan, Xinbing Wang, Chenghu Zhou, âRepEval: Effective Text Evaluation with LLM Representationâ, Empirical Methods in Natural Language Processing (EMNLP), 2024. Shiqing Gao, Jiaxin Ding, Luoyi Fu, Xinbing Wang, Chenghu Zhou, âExterior Penalty Policy Optimization with Penalty Metric Network under Constraintsâ, International Joint Conference on Artificial Intelligence (IJCAI), 2024. Haochen Han, Shuaiyu Yang, Jiaxin Ding, Luoyi Fu, Xinbing Wang, Chenghu Zhou, âAdversarial Reconstruction of Trajectories: Privacy Risks and Attack Models in Trajectory Embeddingâ, ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems (SIGSPATIAL), 2024. Yu Zhao, Meng Wang, Jiaxin Ding, Jiexing Qi, Luwen Wu, Sibo Zhang, Luoyi Fu, Xinbing Wang, Li Cheng, âData-Enhanced Revealing of Trends in Geoscienceâ, Journal of Data and Information Science, 2024. Bo Xue, Yi Xu, Yunchong Song, Yiming Pang, Yuyang Ren, Jiaxin Ding, Luoyi Fu, Xinbing Wang, âUnlock the Power of Frozen LLMs in Knowledge Graph Completionâ, arXiv, 2024. Huquan Kang, Luoyi Fu, Russell J. Funk, Xinbing Wang, Jiaxin Ding, Shiyu Liang, Jianghao Wang, Lei Zhou, Chenghu Zhou, âScientific and Technological Knowledge Grows Linearly Over Timeâ, arXiv, 2024. Xinbing Wang, Luoyi Fu, Xiaoying Gan, Ying Wen, Guanjie Zheng, Jiaxin Ding, Liyao Xiang, Nanyang Ye, Meng Jin, Shiyu Liang, et al., âAcemap: Knowledge Discovery Through Academic Graphâ, arXiv, 2024. Xinbing Wang, Huquan Kang, Luoyi Fu, Jiaxin Ding, Jianghao Wang, Xiaoying Gan, Chenghu Zhou, John E. Hopcroft, âQuantifying Knowledge from the Perspective of Information Structurizationâ, PLOS ONE, 2023. Chong Zhang, Qiang Guo, Luoyi Fu, Jiaxin Ding, Xinde Cao, Fei Long, Xinbing Wang, Chenghu Zhou, âFinding the Source in Networks: An Approach Based on Structural Entropyâ, ACM Transactions on Internet Technology (TOIT), 2023. Cheng Deng, Bo Tong, Luoyi Fu, Jiaxin Ding, Dexing Cao, Xinbing Wang, Chenghu Zhou, âPK-Chat: Pointer Network Guided Knowledge Driven Generative Dialogue Modelâ, arXiv, 2023. Cheng Deng, Jiaxin Ding, Luoyi Fu, Weinan Zhang, Xinbing Wang, Chenghu Zhou, âCOVIDia: COVID-19 Interdisciplinary Academic Knowledge Graphâ, arXiv, 2023. Chong Zhang, Luoyi Fu, Jiaxin Ding, Xinde Cao, Fei Long, Xinbing Wang, Lei Zhou, Jing Zhang, Chenghu Zhou, âCommunity Deception in Large Networks: Through the Lens of Laplacian Spectrumâ, IEEE Transactions on Computational Social Systems, 2023. Xinbing Wang, Huquan Kang, Luoyi Fu, Jiaxin Ding, Shiyu Liang, Jianghao Wang, Lei Zhou, Chenghu Zhou, âKnowledge Does Not Explode but Increases Linearly Over Timeâ, arXiv, 2023. Jiaxin Ding, Shichuan Xi, Kailong Wu, Pan Liu, Xinbing Wang, Chenghu Zhou, “Analyzing Sensitive Information Leakage in Trajectory Embedding Models”, Proceedings of International Conference on Advances in Geographic Information Systems (SIGSPATIAL 2022), 2022. Jiaxin Ding, Bowen Zhang, Xinbing Wang, Chenghu Zhou, “TSNE: Trajectory Similarity Network Embedding”, Proceedings of International Conference on Advances in Geographic Information Systems (SIGSPATIAL 2022), 2022. Jiaxin Ding, Abhirup Ghosh, Rik Sarkar, Jie Gao, “Publishing Asynchronous Event Times with Pufferfish Privacy”, Proceedings of International Conference on Distributed Computing in Sensor Systems, 2022. Jianzhi Tang, Luoyi Fu, Jiaxin Ding, Xinbing Wang, Guihai Chen, “Connectivity Maintenance in Uncertain Networks under Adversarial Attack”, Proceedings of IEEE International Conference on Computer Communications (INFOCOM 2022), 2022. Haonan Zhang, Luoyi Fu, Jiaxin Ding, Feilong Tang, Yao Xiao, Xinbing Wang, Guihai Chen, Chenghu Zhou, “Maximizing the Spread of Effective Informationv in Social Networks”, IEEE Transactions on Knowledge and Data Engineering, 2021. Yongshuai Liu, Jiaxin Ding, Zhi-Li Zhang, Xin Liu, “CLARA: A Constrained Reinforcement Learning Based Resource Allocation Framework for Network Slicing”, Proceedings of IEEE Big Data 2021. Yuanjie Li, Esha Datta, Jiaxin Ding, Ness B. Shroff, Liu Xin, “Can Online Learning Increase the Reliability of Extreme Mobility Management?\", Proceedings of IEEE/ACM 29th International Symposium on Quality of Service (IWQOS 2021), 2021. Haotian Wang, Abhirup Ghosh, Jiaxin Ding, Rik Sarkar, Jie Gao, “Heterogeneous interventions reduce the spread of COVID-19 in simulations on real mobility data”, Scientific Reports, 2021. Abhirup Ghosh*, Jiaxin Ding*, Rik Sarkar, Jie Gao, “Differentially Private Range Counting in Planar Graphs for Spatial Sensing”, Proceedings of IEEE International Conference on Computer Communications (INFOCOM 2020), 2020. Yongshuai Liu, Jiaxin Ding, Xin Liu, “IPO: Interior-point Policy Optimization under Constraints”, the 34th AAAI Conference on Artificial Intelligence (AAAI 2020), 2020. Boris Aronov, Alon Efrat, Ming Li, Jie Gao, Joseph S. B. Mitchell, Valentin Polishchuk, Boyang Wang, Hanyu Quan, Jiaxin Ding, “Are Friends of My Friends Too Social? Limitations of Location Privacy in a Socially-Connected World”, Proceedings of ACM International Symposium on Mobile Ad Hoc Networking and Computing (MobiHoc 2018), 2018. Jiaxin Ding, Chien-chun Ni, Jie Gao, “Fighting Statistic Re-identification in Human Trajectory Publication”, Proceedings of ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems (ACM SIGSPATIAL 2017), 2017. Jiaxin Ding, Chien-chun Ni, Mengyu Zhou, Jie Gao, “MinHash Hierarchy for Privacy Preserving Trajectory Sensing and Query”, Proceedings of ACM/IEEE International Conference on Information Processing in Sensor Networks (IPSN'17), 2017. Su Jia, Xin Jin, Golnaz Ghasemiesfeh, Jiaxin Ding, Jie Gao, “Competitiv",
  "content_length": 11089,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:23"
}