{
  "name": "Jibesh Patra",
  "homepage": "https://jibesh.com",
  "status": "success",
  "content": "Jibesh Patra - Assistant Professor - IIT KGP I am an Assistant Professor in the Computer Science and Engineering department at the Indian Institute of Technology Kharagpur (IIT KGP), India. My research interest lies in the applications of Large Language Models (LLMs) on Software Engineering and Software Security problems. I completed my PhD from the University of Stuttgart, Germany on analyzing code corpora to improve the correctness and reliability of programs advised by Prof. Michael Pradel. During my PhD, I spent two wonderful summers interning at Microsoft Research Cambridge and Bangalore respectively. Email: jibesh.patra@gmail.com You can check my latest CV Links: Google Scholar LinkedIn Facebook Teaching Year ID Course Name Autumn 2025 CS60059 Object-Oriented Systems Autumn 2025 CS61065 Theory and Applications of Blockchain Spring 2025 CS29202 Software Engineering Laboratory Autumn 2024 CS60059 Object-Oriented Systems Positions and Experience IIT Kharagpur May 2024 - Present Assistant Professor, Kharagpur, India Honda Research Institute Feb. 2023 - May 2024 Senior Scientist, Offenbach am Main, Germany SAP SE May 2021 - Jan. 2023 Senior Developer, Walldorf, Germany University of Stuttgart Mar. 2019 - Apr. 2021 Research Assistant, Stuttgart, Germany Microsoft Research Jun. 2018 - Sep. 2018 Research Intern, Cambridge, United Kingdom Microsoft Research Jun. 2017 - Sep. 2017 Research Intern, Bangalore, India TU Darmstadt Mar. 2015 - Feb. 2019 Research Assistant, Darmstadt, Germany Max Planck Institute for Software Systems Oct. 2013 - Dec. 2013 Intern, Kaiserslautern, Germany Max Planck Institute for Heart and Lung Research Jun. 2013 - Sep. 2013 Intern, Bad Nauheim, Germany Google Summer of Code May 2012 - Aug. 2012 Intern, Remote High School Aug. 2010 - Aug. 2011 and Apr. 2014 - Jan. 2015 Assistant Teacher, Bud Bud, India Wipro Technologies May 2010 - Aug. 2010 Project Engineer, Hyderabad, India Professional Activities 2025 ASIACCS 2025 - Research Paper - Program Committee 2024 TOSEM 2024 - Research Paper - Reviewer FSE 2025 - Poster Track - Program Committee CAIN 2025 - Industry Track - Program Committee 2016 ISSTA 2017 - Artifact Evaluation - Committee Education Ph.D. University of Stuttgart, Germany - 2021 M.Tech. National Institute of Technology Durgapur, India - 2013 B.Tech. West Bengal University of Technology, India - 2009 News Research Funding Received funding from Honda Research Institue, Germany to conduct research on 'Analysis of AI-based Code Assistance for Quality and Security.' April 2025 IndiaAI Fellowship Budagam Devichand, an undergrad student working with me has been granted the IndiaAI Fellowship. Congrats! Devichand. February 2025 Joined IIT KGP Joined IIT KGP as a faculty in the Computer Science and Engineering department. May 2024 Joined HRI Joined the Honda Research Institute, Offenbach am Main, Germany. Will be working on Software Engineering and Software Security. Feb. 2023 ICSE Paper gets accepted Our paper on finding name-value inconsistencies has been accepted in ICSE'22. Dec. 2021 Older News 🔨 Last Updated: 16 October 2025, Asia/Calcutta",
  "content_length": 3123,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:25"
}