{
  "name": "Jichen Zhu",
  "homepage": "https://pure.itu.dk/portal/da/persons/jichen-zhu",
  "status": "success",
  "content": "Jichen Zhu - IT-Universitetet i København Jichen Zhu Professor Professor, Human-Computer Interaction and DesignForskningsgruppeleder, Procedural eXpression Lab https://orcid.org/0000-0001-6740-4550 E-mailjiczitudk 20202025 Publikationer pr. år Personlig profil EmneordAI in design & artHCI: human-computer interactionUser-centered design Fingeraftryk Dyk ned i forskningsemnerne, hvor Jichen Zhu er aktive. Disse emneetiketter kommer fra dennes persons arbejder. Sammen danner de et unikt fingerprint. 6 Lignende profiler Artificial Intelligence Computer Science 100% Neural Network Keyphrases 76% Explainable Artificial Intelligence Computer Science 50% Network Games Keyphrases 46% Mental Models Keyphrases 46% Personalization Paradox Keyphrases 46% Social Comparison Keyphrases 46% Player Modeling Keyphrases 46% Se fuldt fingerprint Samarbejde og topforskningsområder i de sidste fem år Seneste eksterne samarbejde på lande-/områdeniveau. Dyk ned i detaljerne ved at klikke på prikkerne eller Vælg et land/område fra listen Dyk ned i detaljerne Vælg et land/område for at vise delte publikationer og projekter Luk Vælg et land/område fra listen Udforsk netværk yderligere Publikation Publikationer pr. år 2020 2021 2022 2023 2025 22 Konferencebidrag i proceedings 4 Tidsskriftartikel 3 Paper 2 Konferenceartikel Publikationer pr. år Publikationer pr. år The Centers and Margins of Modeling Humans in Well-being TechnologiesZhu, J., Sanches, P., Tsaknaki, V., van der Maden, W. & Kaklopoulou, I., 25 apr. 2025, Proceedings of the 2025 CHI Conference on Human Factors in Computing Systems. New York: Association for Computing Machinery, s. 1-16 16 s. 518Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgang Machine Learning 100% Learning System 100% Machine Learning Modeling 100% Case Study 100% Learning Model 100% Death of the Design Researcher? Creating Knowledge Resources for Designers Using Generative AIMaden, W. V. D., Beek, E. V., Halperin, B. A., Jääskeläinen, P., Kang, E., Kun, P., Lomas, J. D., Merritt, T., Lindley, J., Muller, M., Nicenboim, I., Zhu, J. & van der Burg, V., jul. 2024, Companion Publication of the 2024 ACM Designing Interactive Systems Conference. New York: Association for Computing Machinery, s. 396-400 5 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgang Knowledge Resources 100% Creating Knowledge 100% Generative 100% Designer 100% Artificial Intelligence 100% Machine Learning Processes as Sources of Ambiguity: Insights from AI ArtSivertsen, C., Salimbeni, G., Løvlie, A. S., Benford, S. & Zhu, J., 11 maj 2024, Proceedings of the 2024 CHI Conference on Human Factors in Computing Systems. New York, NY, USA: Association for Computing Machinery, s. 1-14 14 s. 165Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgang Machine Learning 100% AI Art 100% Machine Learning Workflow 100% Learning Process 100% Artificial Intelligence 100% Slide to Explore 'What If': An Analysis of Explainable InterfacesMeyer, L. S. & Zhu, J., 13 okt. 2024, I: Proceedings of NordiCHI. s. 1-6 6 s., 2.Publikation: Artikel i tidsskrift og konference artikel i tidsskrift › Konferenceartikel › Forskning › peer review Explainable Interfaces 100% Explainable Artificial Intelligence 100% Human-centered XAI 33% Designing for Playfulness in Human-AI Authoring ToolsLiapis, A., Guckelsberger, C., Zhu, J., Harteveld, C., Kriglstein, S., Denisova, A., Gow, J. & Preuss, M., 2023, Proceedings of the 18th International Conference on the Foundations of Digital Games. s. 1-4 4 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgangFil Se alle 31 publikationer Projekter Projekter pr. år 2021 2021 2027 1 Igangværende Projekter pr. år ExPAI: Explainable Personalization AI for Health and Well-BeingZhu, J. (PI), Malmborg, L. (CoI), Meyer, L. S. (CoI) & Maden, W. L. A. V. D. (CoI)Novo Nordisk Foundation01/01/2021 → 01/05/2027Projekter: Projekt › Forskning Artificial Intelligence 100% Explainable Artificial Intelligence 66% Machine Learning 37% AI in Healthcare 33% Well-being 33% Presse/medier Novo Nordisk Fonden uddeler startpakker for første gang - styrker danske universiteter i kampen om de bedste hjernerZhu, J.21/08/20251 MediebidragPresse/medie STARTPAKKE TIL FEM YNGRE FORSKEREZhu, J. & István, Z.11/03/20211 MediebidragPresse/medie To internationale AI- og data storage-forskerprofiler flytter til ITUZhu, J.02/02/20211 MediebidragPresse/medie PRM / Novo Nordisk Fonden uddeler startpakker for første gang - styrker danske universiteter i kampen om de bedste hjernerZhu, J.22/01/20211 MediebidragPresse/medie Priser Best Paper Award, 2021 Conference of Foundation of Digital Games (FDG’21)Zhu, J. (Modtager), Löwe, M. K. K. (Modtager), Villareale, J. (Modtager), Freed, E. (Modtager), Sladek, A. (Modtager) & Risi, S. (Modtager), 2021Pris: Priser, stipendier, udnævnelser Digital Games 100% Best Paper Award 100% Game Research 50% Acceptance Rate 50% Academic Conferences 50% Best Paper Award FinalistGrabe, I. (Modtager) & Zhu, J. (Modtager), 2022Pris: Priser, stipendier, udnævnelser Best Paper Award 100% Gaussian Mixture Model 100% Gaussian Distribution 100% Evolutionary Search 50% Fashion Style 50% Honorable Mentions Paper Award, 2021 Conversational User Interface Conference (CUI’21)Zhu, J. (Modtager), Myers, C. M. (Modtager), Laris Pardo, L. F. (Modtager), Acosta-Ruiz, A. V. (Modtager) & Canossa, A. (Modtager), 2021Pris: Priser, stipendier, udnævnelser Conversational User Interface 100% Honorable Mention 100% User Interfaces 100% Language Technology 33% Human-computer Interaction 33% Aktiviteter Aktiviteter pr. år 2016 2016 2021 2022 2022 3 Redaktør af tidsskrift 2 Organisation og deltagelse i konference 2 Foredrag og mundtlige bidrag 1 Redaktør af serie Aktiviteter pr. år 2021 CHI Conference on Human Factors in Computing SystemsZhu, J. (Conference Chair)2021 → 2022Aktivitet: Deltagelse i eller arrangement af en begivenhed - typer › Organisation og deltagelse i konference I E E E Transactions on Computational Intelligence and A I in Games (Tidsskrift)Zhu, J. (Anmelder)2016 → …Aktivitet: Udgivelse af peer-review og redaktionelt arbejde - typer › Redaktør af tidsskrift › Forskning IEEE Transactions on Games (Tidsskrift)Zhu, J. (Redaktør)2016 → …Aktivitet: Udgivelse af peer-review og redaktionelt arbejde - typer › Redaktør af tidsskrift › Forskning IEEE Transactions on Games (Tidsskrift)Warpefelt, H. (Redaktør), Salge, C. (Redaktør), El-Nasr, M. S. (Redaktør), Eladhari, M. (Anmelder), Zhu, J. (Anmelder) & Zhu, J. (Redaktør)dec. 2022Aktivitet: Udgivelse af peer-review og redaktionelt arbejde - typer › Redaktør af tidsskrift › Forskning MIT Press (Forlag)Zhu, J. (Anmelder) & Zhu, J. (Redaktør)2021 → …Aktivitet: Udgivelse af peer-review og redaktionelt arbejde - typer › Redaktør af serie › Forskning Se alle 8 aktiviteter",
  "content_length": 7138,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:27"
}