{
  "name": "Jicong Fan 0001",
  "homepage": "https://jicongfan.github.io",
  "status": "success",
  "content": "About Me - Jicong Fan’s Personal Site Jicong FanAssistant Professor, CUHK-Shenzhen Follow Shenzhen, China Email Github Google Scholar樊继聪老师现为香港中文大学(深圳)数据科学学院助理教授、博士生导师、校长青年学者。在此之前，他是康奈尔大学的博士后(advisor:Madeleine Udell)。他在香港城市大学电子工程系取得博士学位(导师:Tommy W.S. Chow)，在北京化工大学获得控制科学与工程硕士学位(导师:王友清)和自动化学士学位。他曾是美国威斯康星大学麦迪逊分校访问学生和香港大学研究助理。他的研究方向是人工智能和机器学习，他在矩阵/张量方法、聚类算法、图学习、异常检测和推荐系统等方面做了大量研究工作，在知名学术期刊和国际会议上，如IEEE TSP/TNNLS/TII、NeurIPS、ICLR、ICML、CVPR、KDD、AAAI，发表论文50余篇。 他是IEEE高级会员，目前担任国际期刊《Pattern Recognition》（中科院一区）和《Neural Processing Letters》的副编辑，担任国际人工智能/机器学习会议ICML、NeurIPS和ICLR领域主席、IJCAI高级程序委员会成员，主持国家自然科学基金青年项目、面上项目、广东省面上项目，获得2023年中国自动化学会自然科学奖一等奖，入选斯坦福大学/爱思唯尔2023、2024、2025(年度/终身)“全球Top 2% 科学家”榜单。樊老师课题组目前主要研究以下问题：1)图基础模型; 2)异常检测大模型; 3)无监督自动机器学习; 4)人工智能在生命科学、化学和化工中的应用; 5)基于大数据的健康监测和疾病诊断系统。I am an Assistant Professor at the School of Data Science, The Chinese University of Hong Kong, Shenzhen. Before joining CUHK-Shenzhen, I was a Postdoctoral Associate (advisor: Madeleine Udell) at the School of Operations Research and Information Engineering, Cornell University, Ithaca, USA. I completed my PhD at City University of Hong Kong in Electronic Engineering under the supervision of Prof. Tommy W.S. Chow. During my PhD, I was a visiting scholar at the Department of Electrical and Computer Engineering, University of Wisconsin-Madison, USA. I obtained my Bachelor (Automation) and Master (Control Science and Engineering, supervisor: Youqing Wang) degrees from Beijing University of Chemical Technology. After that, I was a Research Assistant at The University of Hong Kong.Research InterestsMy research interests are Artificial Intelligence and Machine Learning. Some specific research topics of mine are as follows:Matrix and tensor methodsAlgorithms for missing data, outlier, and noiseRecommendation systemAutomated machine learningClustering algorithmsLearning with graphsPrivacy and fairness in machine learningNon-smooth optimizationAnomaly/novelty/fault detectionMachine learning for bioinformatics and healthcareSee the examples on the “Research” page.Selected Publications (* indicates corresponding author)Feng Xiao, Xiaoying Tang, Jicong Fan*. Fairness-aware Anomaly Detection via Fair Projection. NeurIPS 2025. [PDF]Feng Xiao, Youqing Wang, S Joe Qin, Jicong Fan*. Semi-Supervised Anomaly Detection Using Restricted Distribution Transformation. IEEE TNNLS 2025. [PDF]Jinyu Cai, Yunhe Zhang, Jicong Fan*. Self-Discriminative Modeling for Anomalous Graph Detection. ICML 2025. [PDF]Jicong Fan. Graph Minimum Factorization Distance and Its Application to Large-Scale Graph Data Clustering. ICML 2025. [PDF]Xudong Wang, Ziheng Sun, Chris Ding, Jicong Fan*. Explainable Graph Representation Learning via Graph Pattern Analysis. IJCAI 2025.Wei Dai, Jicong Fan*. AutoUAD: Hyper-parameter Optimization for Unsupervised Anomaly Detection. ICLR 2025. [PDF]Liangqi Xie, Jicong Fan*. Multi-Subspace Matrix Recovery from Permuted Data. AAAI 2025. [PDF]Tongle Wu, Ying Sun*, Jicong Fan*. Non-Convex Tensor Recovery from Local Measurements. AAAI 2025. [PDF]Dong Qiao, Xinxian Ma, Jicong Fan*. Federated t-SNE and UMAP for Distributed Data Visualization. AAAI 2025. [PDF]Wei Dai, Kai Hwang, Jicong Fan*. Unsupervised Anomaly Detection for Tabular Data Using Noise Evaluation. AAAI 2025. [PDF]Tongle Wu, Jicong Fan*. Smooth Tensor Product for Tensor Completion. IEEE Transactions on Image Processing, 2024. [PDF]Zixiao Wang, Jicong Fan*. Graph Classification via Reference Distribution Learning: Theory and Practice. NeurIPS 2024. [PDF]Feng Xiao, Jicong Fan*. Unsupervised Anomaly Detection in The Presence of Missing Values. NeurIPS 2024. [PDF]Ziheng Sun, Xudong Wang, Chris Ding, Jicong Fan*. Learning Graph Representation via Graph Entropy Maximization. ICML 2024. [PDF]Yunhe Zhang, Yan Sun, Jinyu Cai, Jicong Fan*. Deep Orthogonal Hypersphere Compression for Anomaly Detection. ICLR 2024. (Spotlight, acceptance rate=5%) [PDF]Yan Sun, Jicong Fan*. MMD Graph Kernel: Effective Metric Learning for Graphs via Maximum Mean Discrepancy. ICLR 2024. (Spotlight, acceptance rate=5%) [PDF]Jicong Fan, Rui Chen, Zhao Zhang, Chris Ding. Neuron-Enhanced AutoEncoder Matrix Completion and Collaborative Filtering: Theory and Practice. ICLR 2024. [PDF]Dazhi Fu, Zhao Zhang, Jicong Fan*. Dense Projection for Anomaly Detection. AAAI 2024. [PDF]Ziheng Sun, Chris Ding, Jicong Fan*. Lovász Principle for Unsupervised Graph Representation Learning. NeurIPS 2023. [PDF]Zhihao Wu, Zhao Zhang, Jicong Fan*. Graph Convolutional Kernel Machine versus Graph Convolutional Networks. NeurIPS 2023. [PDF]Dong Qiao, Chris Ding, Jicong Fan*. Federated Spectral Clustering via Secure Similarity Reconstruction. NeurIPS 2023. [PDF]Jicong Fan, Lijun Ding, Chengrun Yang, Zhao Zhang, Madeleine Udell. Euclidean-Norm-Induced Schatten-p Quasi-Norm Regularization for Low-Rank Tensor Completion and Tensor Robust Principal Component Analysis. Transactions on Machine Learning Research 2023. [PDF]Jicong Fan, Yiheng Tu, Zhao Zhang, Mingbo Zhao, Haijun Zhang. A Simple Approach to Automated Spectral Clustering. NeurIPS 2022. [PDF]Jinyu Cai, Jicong Fan*. Perturbation Learning Based Anomaly Detection. NeurIPS 2022. [PDF]Jinyu Cai, Jicong Fan*, Wenzhong Guo, Shiping Wang, Yunhe Zhang, Zhao Zhang. Efficient Deep Embedded Subspace Clustering. CVPR 2022. [PDF]Jicong Fan. Multi-Mode Deep Matrix and Tensor Factorization. ICLR 2022. [PDF]Jicong Fan. Dynamic Nonlinear Matrix Completion for Time-Varying Data Imputation. AAAI 2022. (acceptance rate=15%) [PDF]Jicong Fan. Large-Scale Subspace Clustering via k-Factorization. KDD 2021. (acceptance rate=15.4%) [PDF]Jicong Fan*, Tommy WS Chow, S Joe Qin. Kernel Based Statistical Process Monitoring and Fault Detection in the Presence of Missing Data. IEEE TII 2022. [PDF]Jicong Fan*, Chengrun Yang, Madeleine Udell. Robust Non-Linear Matrix Factorization for Dictionary Learning, Denoising, and Clustering. IEEE TSP 2021. [PDF]Jicong Fan, Yuqian Zhang, Madeleine Udell. Polynomial matrix completion for missing data imputation and transductive learning. AAAI 2020. (Oral, acceptance rate=6%) [PDF]Jicong Fan, Lijun Ding, Yudong Chen, Madeleine Udell. Factor group sparse regularization for efficient low-rank matrix recovery. NeurIPS 2019. (acceptance rate=21.1%) [PDF]Jicong Fan, Tommy W.S. Chow. Exactly robust kernel principal component analysis. IEEE TNNLS 2020. [PDF]Jicong Fan, Madeleine Udell. Online high-rank matrix completion. CVPR 2019 (Oral, acceptance rate=5.6%). [PDF]Research FundsNSFC Youth Fund Programme (国自然青年项目), 2022.01-2024.12, PI.General Program of Natural Science Foundation of Guangdong Province (广东省面上项目), 2024.01-2026.12, PI.NSFC General Programme (国自然面上项目), 2024.01-2027.12, PI.Academia ServicesAssociate Editor of Pattern RecognitionAssociate Editor of Neural Processing LettersArea Chair of ICML, NeurIPS, and ICLRSenior Program Committee Member of IJCAISenior Member of IEEEConference PC Member: COLT, AISTATS, NeurIPS, ICLR, ICML, CVPR, AAAI, KDD, IJCAIJournal Reviewer: IEEE TNNLS/TII/TSP/TIP/TPAMI/TKDE, Pattern Recognition, SIAM Journal on Mathematics of Data Science, Mathematical Programming, Journal of Scientific Computing, etc.Honors and AwardsFirst Prize of the Natural Science Award of Chinese Association of Automation, 2023.10CityU Outstanding Academic Performance Award / Research Tuition Scholarship, 2017.08Outstanding graduates of Beijing University of Chemical Technology (5%), 2013.06Excellent master’s thesis award of Beijing University of Chemical Technology (5%), 2013.06Zhang Zhong-Jun Academician Outstanding Paper Award (1%), 2012.08",
  "content_length": 7592,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:25"
}