{
  "name": "Jidong Zhai",
  "homepage": "http://pacman.cs.tsinghua.edu.cn/~zjd",
  "status": "success",
  "content": "Jidong Zhai Search Jidong Zhai Professor (é¿èææãåå£«çå¯¼å¸) PACMAN Lab Institute of High Performance Computing Department of Computer Science and Technology Tsinghua University zhaijidong AT tsinghua.edu.cn Biography Jidong Zhai (ç¿å­£å¬) is a Full Professor in the Department of Computer Science and Technology of Tsinghua University. He was a Visiting Professor of Stanford University (2015-2016) and a Visiting Scholar of MSRA (Microsoft Research Asia) in 2013. He is the general secretary of ACM SIGHPC China. His current research interests include parallel computing, compiler, programming language, and performance evaluation. He has published in prestigious conferences (such as SC, ICS, PPOPP, ASPLOS, MICRO, OSDI, ATC, and PACT) and top-tier journals (such as IEEE TC and IEEE TPDS). His research received 2021 Best Paper Award for IEEE TPDS, Best Paper Award at CLUSTER'21, Best Student Paper Award at ICSâ21, Best Paper Honorable Mention Award at ICDCSâ20, and Best Paper Finalist at SCâ14. He has served as a PC member for a number of international conferences including SC, ICS, PPoPP, IPDPS, ICPP, Cluster, and PACT. He was a program co-chair of NPC 2018. He is currently on the editorial boards of IEEE Transactions on Computers (TC), IEEE Transactions on Parallel and Distributed Systems (TPDS), IEEE Transactions on Cloud Computing (TCC), Journal of Parallel and Distributed Computing (JPDC), and Journal of Parallel Computing (PARCO). He is the advisor of Tsinghua Student Cluster Team. The team led by him has achieved 13 international champions in student supercomputing challenges at SC, ISC, and ASC. In 2015 and 2018, the team led by him swept all three champions. He has got a number of awards including NSFC Distinguished Young Scholar (2022), First Prize of CCF Natural Science Award (2021), CCF-IEEE CS Young Computer Scientist Award (2020), IEEE TPDS Award for Editorial Excellence (2019), NSFC Young Career Award (2017), and CCF outstanding doctoral dissertation Award (2010). Recent News Posdoc Positions. Our group has postdoc positions, about parallel computing, compiler, programming models, and performance evaluation. If you are interested in these topics, feel free to talk with me. Visiting Interns. Our group is looking for undergraduate interns. If you are interested in system research, parallel computing and compiler optimization, please contact with me. [2024.12] I was invited to serve as the TPC member of ICS 2025. [2024.1] I was invited to serve as the IPDPS steering committee. [2023.12] Our paper received Best Paper Runner-up for IEEE Transactions on Parallel and Distributed Systems 2022. [2023.11] I was invited to serve as the TPC member of SC 2024. [2023.8] I was invited to serve as the TPC member of IPDPS 2024. [2022.12] Our paper received Best Paper Award for IEEE Transactions on Parallel and Distributed Systems 2021. [2022.7] I was invited to serve as the Young Associate Editor of Big Data Mining and Analytics. [2022.4] I was invited to serve as track co-chair of IEEE ICPADS 2022. [2021.12] I was invited to serve as track chair of IEEE SBAC-PAD 2022. [2021.10] I was invited to serve as the member of IEEE TPDS 2020 Best Paper Award Committee. Contact zhaijidong@tsinghua.edu.cn 010 62789028 Room1-510, Ziqiang Technology Building, Tsinghua University, Haidian District, Beijing 100084 Cite × Copy Download",
  "content_length": 3393,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:24"
}