{
  "name": "Jie Jiang 0011",
  "homepage": "http://cse.sustech.edu.cn/faculty/~jiangj",
  "status": "success",
  "content": "About Jie Jiang loading... Hi, I am Jie Jiang (姜洁) Research Assistant Professor at SUSTech To learn more, please scroll down scroll down Work experience Research Assistant Professor, Southern University of Science and Technology, China, 2019-now Research Fellow, University of Surrey, UK, 2016-2019 Visiting Researcher, Imperial College London, UK, 2015-2016 Education Ph.D. in Artificial Intelligence, Delft University of Technology, Netherlands, 2010-2015 M.Sc. in Automation, Xi’an Jiaotong University, China, 2007-2010 B.Eng. in Automation, Chang’an University, China, 2003-2007 Research Energy Disaggregation Home activities (e.g., laundry, cooking) are mostly assisted by electrical appliances and can be characterised by the energy profiles of the appliances being used. The rapid development of deep learning methods provides powerful tools for modeling complex patterns. This project tries to use these tools to infer the electricity (energy) consumption of individual appliances from the mains reading at high frequencies. Activity Recognition The advance of IoT devices can vastly improve home life and also provide a great opportunity for social researchers to study home activity in larger scales. In this project, we have been trying to identify home activities from sensory data via machine learning based methods. The sensory data was collected through the IoT platform developed in collaboration with 5GIC and the ground truth was collected via survey and time use diaries. We evaluated various machine learning methods for activity recognition tasks based on the heterogeneous data collected from real households. Contamination Source Identification Water distribution network (WDN) is one of the most essential infrastructures all over the world and ensuring water quality is always a top priority. To this end, water quality sensors are often deployed at multiple points of WDNs for real-time contamination detection and fast contamination source identification (CSI). Specifically, CSI aims to identify the location of the contamination source, together with some other variables such as the starting time and the duration. Such infor- mation is important in making an efficient plan to mitigate the contamination event. More Selected publications [1] Yujue Zhou; Jie Jiang; Yulong Ding; Shuang-Hua Yang; Ligang He. Graph Convolutional Networks Based Contamination Source Identification Across Water Distribution Networks, accepted by Process Safety and Environmental Protection, doi: 10.1016/j.psep.2021.09.008. (Corresponding author, JCR Q1). [2] Yujue Zhou; Jie Jiang; Shuang-Hua Yang; Ligang He; Yulong Ding. MuSDRI: Multi-Seasonal Decomposition Based Recurrent Imputation for Time Series, accepted by IEEE Sensors Journal, doi:10.1109/JSEN.2021.3107836. (Corresponding author, JCR Q2). [3] Kai Qian; Jie Jiang; Yulong Ding; Shuang-Hua Yang. DLGEA: A Deep Learning Guided Evolutionary Algorithm For Water Contamination Source Identification, Neural Computing and Applications, 33, 11889–11903, 2021. (Corresponding author, JCR Q1). [4] Jie Jiang; Qiuqiang Kong; Mark Plumbley; Nigel Gilbert; Mark Hoogendoorn; Diederik Roijers. Deep Learning Based Energy Disaggregation and On/Off Detection of Household Appliances, accepted by ACM Transactions on Knowledge Discovery from Data (accepted, CCF B, JCR Q2). [5] Jie Jiang; Riccardo Pozza; Nigel Gilbert; Klaus Moessner; MakeSense: An IoT Testbed for Social Research of Indoor Activities, ACM Transactions on Internet of Things, 2020, 1(3):1-25. [6] Jie Jiang, Riccardo Pozza, Kristrun Gunnarsdottir, Nigel Gilbert, Klaus Moessner. Using Sensors to Study Home Activities, Journal of Sensor and Actuator Networks, 2017, 6, 32. [7] Kai Qian; Jie Jiang; Yulong Ding; Shuang-Hua Yang.Deep Learning Based Anomaly Detection in Water Distribution Systems, IEEE International Conference on Networking, Sensing and Control, Nanjing, China, 2020. [8] Jie Jiang; Mark Hoogendoorn; Diederik Roijers; Qiuqiang Kong; Nigel Gilbert; Predicting Appliance Usage Status In Home Like Environments, 23rd International Conference on Digital Signal Processing (DSP), 2018 Contact social media email：jiangj@sustech.edu.cn Github：@jiejiang Prospective students Please feel free to contact me if you are interested in our research",
  "content_length": 4290,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:25"
}