{
  "name": "Jie Zhang 0059",
  "homepage": "https://pure.qub.ac.uk/en/persons/jie-zhang",
  "status": "success",
  "content": "Jie Zhang - Queen's University Belfast View Scopus Profile Jie Zhang Dr Lecturer, School of Electronics, Electrical Engineering and Computer Science Emailjie.zhangqub.acuk Accepting PhD StudentsPhD projectsOpen to PhD applications in the fields of: AI for next-generation wireless systems; wireless sensing and communications for healthcare. 20202025 Research activity per year Personal profile ParticularsJie Zhang is currently a Lecturer (Assistant Professor) at the Centre for Wireless Innovation (CWI), School of Electronics, Electrical Engineering and Computer Science, Queen’s University Belfast, U.K. From 2022 to 2024, he was a Marie Curie Research Fellow at the University of Leeds, U.K. He was an Associate Professor at the University of Science and Technology Beijing, China, in 2022. From 2019 to 2021, he was a Postdoctoral Research Fellow at the Peking University, China. His main research interests include intelligent sensing, wireless systems, AIoT, wearable computing, and machine learning, etc. He has authored and co-authored over 70 papers in peer-reviewed journals and conferences. Jie Zhang is always looking for self-motivated candidates with strong mathematical and programming backgrounds to conduct Ph.D. research in the fields of AI for next-generation wireless systems, and wireless sensing and communications for healthcare. If you are interested in these areas, please feel free to contact [email protected]. Research InterestsIntelligent sensingWireless systemsAIoTWearable computingSmart healthMachine learningTeachingCSC1033 Introduction to Computer ArchitectureCSC3058 Advanced Computer Architecture Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Fingerprint Dive into the research topics where Jie Zhang is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Extreme Learning Machine Engineering 100% Wi-Fi Engineering 90% Localization Performance Engineering 83% Channel State Information Computer Science 75% Collected Data Computer Science 75% Image Reconstruction Engineering 68% Conventional Method Engineering 68% Hardware Complexity Engineering 68% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2025 2025 2025 1 Active Projects per year R1798ECS: HASC Hub in all spectrum connectivity Additional FundingCotton, S. (PI), Yurduseven, O. (CoI), Zhang, J. (CoI) & Zhang, P. (CoI)17/07/2025 → …Project: Research Research output Research output per year 2020 2022 2023 2024 2025 2025 29 Article 6 Conference contribution Research output per year Research output per year An analysis of 6 GHz, 60 GHz, and Low-THz propagation for Wi-Fi 8 UHR in future factoriesDoone, M. G., Zhang, J., Zhang, P., Yurduseven, O., Duong, T. Q. & Cotton, S. L., 19 Aug 2025, 2025 IEEE International Symposium on Dynamic Spectrum Access Networks (DySPAN): Proceedings. IEEE, p. 97-98 2 p. (IEEE International Symposium on Dynamic Spectrum Access Networks (DySPAN): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Wi-Fi 100% Antenna 100% Directional 25% High Data Rate 25% Wireless Communication 25% ClassiGAN: joint image reconstruction and classification in computational microwave imagingZhang, J., Alvarez Narciandi, G., Garcia-Fernandez, M., Sharma, R., Zhang, J., del Hougne, P., Abbasi, M. A. B. & Yurduseven, O., 19 Feb 2025, (Early online date) In: IEEE Transactions on Radar Systems. 12 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Image Reconstruction 100% State of the Art 25% Data Acquisition 25% Microwave Frequency 25% Classification Task 25% 39 Downloads (Pure) Contactless and continuous blood pressure detection with FMCW millimeter-wave radarLiu, L., Zhang, J., Feng, Z., Zhang, S., Zhang, Z. & Xiao , W., 11 Mar 2025, In: IEEE Sensors Journal. 25, 9, p. 15489 - 15501 14 p.Research output: Contribution to journal › Article › peer-review Wave Reflection 100% Target Network 100% Pressure Measurement 75% Cooperative co-evolutionary dynamic multiobjective optimization for burden surface profile decision in blast furnace ironmakingLi, Y., Zhang, Y., Li, Q. & Zhang, J., 25 Feb 2025, In: IEEE Transactions on Instrumentation and Measurement. 74, 12 p., 2511712.Research output: Contribution to journal › Article › peer-review Surface Profile 100% Multiobjective Optimization 100% Burden Surface 100% Blast Furnace Ironmaking 100% Multiobjective Optimization Problem 40% 2 Citations (Scopus) Efficient 6 GHz Wi-Fi based occupancy detection: channel model-informed feature engineering and random forest optimizationLi, Z., Zhang, J., Da Silva, C. R. C. M., Yurduseven, O., Duong, T. Q., Fischione, C. & Cotton, S. L., 09 Oct 2025, (Early online date) In: IEEE Internet of Things Journal. 13 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Channel Coherence Time 100% Smart Building Application 100% 1 Downloads (Pure) View all 35 research outputs Prizes Marie Sklodowska - Curie Actions - Individual Fellowships (MSCA-IF)Zhang, J. (Recipient), 2021Prize: Fellowship awarded competitively Activities Activities per year 2024 2024 2025 2025 3 Participation in conference 2 Editorial activity 2 Other 1 Hosting an academic visitor Activities per year IEEE 11th World Forum on Internet of ThingsZhang, J. (Member of the scientific committee)27 Oct 2025 → 30 Oct 2025Activity: Participating in or organising an event types › Participation in conference IEEE INFOCOM 2025Zhang, J. (Member of the scientific committee)19 May 2025 → 22 May 2025Activity: Participating in or organising an event types › Participation in conference Zhiwen QiaoZhang, J. (Host)Mar 2025 → Mar 2026Activity: Hosting a visitor types › Hosting an academic visitor Biomimetic Intelligence and Robotics (Journal)Zhang, J. (Editorial board member)2025 → 2026Activity: Publication peer-review and editorial work types › Editorial activity Robot Learning (Journal)Zhang, J. (Editorial board member)2025 → 2027Activity: Publication peer-review and editorial work types › Editorial activity View all 8 activities",
  "content_length": 6686,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:31"
}