{
  "name": "Jie Wu 0001",
  "homepage": "https://cis.temple.edu/~wu",
  "status": "success",
  "content": "Dr. Jie Wu Jie Wu, Ph.D., Fellow of AAAS, and Fellow of IEEE Director of Center for Networked Computing (CNC) Laura H. Carnell Professor, Department of Computer and Information Sciences Temple University Openings Positions available for Ph.D. students with assistantships, including visiting scholars/students Research Center Center for Networked Computing (CNC) Recent Publications 2025 Publications: IEEE/ACM ToN, IEEE TMC, IEEE TKDE, IEEE TSC, IEEE TWC, EDBT'25, ICASSP'25, INFOCOM'25, ICDE'25, ICDCS'25, IJCAI'25, and ICPP'25 2024 Publications: IEEE/ACM ToN, IEEE TMC, IEEE TDSC, IEEE TKDE, IEEE TSC, IEEE TNSE, IEEE TWC, IEEE TCC, INFOCOM'24, ICDCS'24, ICDE'24, and SECON'24 2023 Publications: IEEE/ACM ToN, IEEE TMC, IEEE TPDS, IEEE JSAC, IEEE TDSC, IEEE TWC, IEEE TCC, INFOCOM'23, IWQoS'23 2022 Publications: IEEE/ACM ToN, IEEE TMC, IEEE TPDS, IEEE JSAC, IEEE TDSC, IEEE TSC, IEEE TCC, INFOCOM'22, IWQoS'22, and CNS'22 2021 Publications: IEEE/ACM ToN, IEEE TMC, IEEE TPDS, ACM TKDD, ACM TIT, IEEE TSC, IEEE TBD, IEEE TNSE, IEEE TDSC, IEEE TIFS, INFOCOM'21, IWQoS'21, and ICPP'21 2020 Publications: IEEE/ACM ToN, IEEE TMC, IEEE TPDS, IEEE TNSE, IEEE THMS, IEEE TII, INFOCOM'20, WWW'20, PerCom'20, SECON'20, ICPP'20, ICDCS'20, MobiHoc'20, and NIPS'20 2019 Publications: ACM TSN, IEEE JSAC, IEEE TMC, IEEE TVT, IEEE TKDB, IEEE TPDS, IEEE TSC, IEEE TNSE, SECON'19, ICDCS'19, DSN'19, and CNS'19 2018 Publications: IEEE TMC, IEEE TBD, IEEE TSC, IEEE TNSE, ICDCS'18, CNS'18, Percom'18, IWQoS'18, ICPP'18, and ICNP'18 New Book: Network Security Empowered by Artificial Intelligence, Springer, 2024 New Book: Mobile Crowdsourcing: From Theory to Practice, Springer, 2023 New Book: Fog/Edge Computing For Security, Privacy, and Applications, Springer, 2021 New Book: Opportunistic Mobile Social Networks, Taylor & Francis, 2014 (Book Review) New Book: Energy-Aware Scheduling on Multiprocessor Platforms, Springer, 2013 Sample Publications: 1985-2013 and Top-25: self-rated Sample Recent Publications: J. Li, J. Wang, W. Liang, J. Wu, Q. Chen, and Z. Xu, \"Social-Aware DT-Assisted Service Provisioning in Serverless Edge Computing,\" (MASS 2024). Best paper Award. [Slides] C. Wu, M. Xiao, J. Wu, Y. Xu, J. Zhou, and H. Sun, \"Towards Federated Learning on Fresh Datasets,\" (MASS 2023). Best paper Award. [Slides] J. Wu, \"On Cost-Optimal Parallel Solution of the Majority Problem,\" (APDCM 2023). [Slides] Z. Li, K. Hwang, K. Li, J. Wu, and T. Ji, \"Graph-generative Neural Network for EEG-based Epileptic Seizure Detection via Discovery of Dynamic Brain Functional Connectivity,\" (Scientific Reports-Nature.com 2022). J. Wu, \"A Note on a Combinatorics Partition Problem,\" (Academia Letters 2022) (English)(Chinese). J. Wu and S. Jiang, \"On Increasing Scalability and Liquidation of Lightning Networks for Blockchains,\" (TNSE 2022). A. Sawwan and J. Wu, \"Minimizing Epidemic Viral Total Exposure under the Droplet and Aerosol Models,\" (ICDH 2021). J. Shang and J. Wu, \"Protecting Real-time Video Chat against Fake Facial Videos Generated by Face Reenactment,\" (ICDCS 2020). J. Wu and N. Wang, \"Approximating Special Social Influence Maximization Problems,\" (Tsinghua Science and Technology 2020) J. Wu, \"Challenges and Opportunities in Algorithmic Solutions for Re-Balancing in Bike Sharing Systems,\" (Tsinghua Science and Technology 2020). J. Wu, \"A Multi-tiered Network with Aerial and Ground Coverage,\" (CC 2018). J. Wu, Y. Chen, and H. Zheng, \"Approximation Algorithms for Dependency-Aware Rule-Caching in Software-Defined Networks, \" (GLOBECOM 2018). J. Wu, S. Lu, and H. Zheng, \"On Maximum Elastic Scheduling of Virtual Machines for Cloud-based Data Center Networks,\" (ICC 2018).[Slides] J. Wu, \"Uncovering the Useful Structures of Complex Networks in Socially-Rich and Dynamic Environments,\" (ICDCS 2017). [Slides] [Video] H. Zheng, W. Chang, and J. Wu, \"Coverage and Distinguishability Requirements for Traffic Flow Monitoring Systems,\" (IWQoS 2016). [Slides] J. Wu, \" Stable Matching Beyond Bipartite Graphs,\" (APDCM) (in conjunction with IEEE IPDPS 2016). [Slides] J. Wu and Y. Wang, \"Hypercube-based Multi-path Social Feature Routing in Human Contact Networks,\" (TC 2014). J. Wu, \"Collaborative Mobile Charging and Coverage,\" (JCST 2014). [Slides] J. Wu, M. Xiao, and L. Huang, \"Homing Spread: Community Home-based Multi-copy Routing in Mobile Social Networks,\"(INFOCOM 2013). [Slides] C. Liu and J. Wu, \"Practical Routing in a Cyclic MobiSpace,\" (ToN 2011). Special Issues Guest Editor: (Call for papers) Smart Systems and Intelligent Networking Powered with Big Data Analytics , IEEE Transactions on Network Science and Engineering , Dec. 1, 2019 Guest Editor:  Security & Privacy in Social Big Data , Journal of Parallel and Distributed Computing , Dec. 2019 Guest Editor:  High-Performance Computing in Edge Computing Networks , Journal of Parallel and Distributed Computing , Oct. 2018 Guest Editor:  Mobile Big Data Management and Innovative Applications, IEEE Transactions on Service Computing, Oct/Nov. 2016 NSF Workshop 2013 NSF CAREER Proposal Writing Workshop, March 15, 2013 Conference Organizations The 24th IEEE/ACM international Symposium on Cluster, Cloud and Internet Computing (CCGrid), 2024 (General Co-Chair) IEEE Conference on Communications and Network Security(CNS), 2024 (Area Chair) IEEE Conference on Computer Communications (INFOCOM), 2024 (Area TPC Chair) IEEE International Parallel & Distributed Processing Symposium (IPDPS), 2023 (General Co-Chair) The 24th International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing (MobiHoc), 2023 (General Co-Chair) IEEE Conference on Computer Communications (INFOCOM), 2023 (Area TPC Chair) IEEE International Conference on Networking, Architecture, and Storage (NAS), 2022 (General Chair) International Conference on Mobility, Sensing and Networking (MSN), 2022 (General Co-Chair) International Conference of Distributed Computing and Networking (ICDCN), 2022 (General Co-Chair) IEEE Conference on Computer Communications (INFOCOM), 2022 (Program Area Chair) The 7th International Symposium on Security and Privacy in Social networks and Big Data (SocialSec), 2021 (General Co-Chair) IEEE Conference on Computer Communications (INFOCOM), 2023 (Area TPC Chair) The 19th International Symposium on Modeling and Optimization in Mobile, Ad hoc, and Wireless Networks (WiOpt), 2021 (General Co-Chair) The 29th International Conference on Computer Communications and Networks (ICCCN), 2020 (Program Co-Chair) International Workshop on Computational Intelligence and Big Data Towards Trustworthy IoT (in conjunction with GLOBECOM), 2019 (Workshop Co-Chair) The Sixth National Workshop for REU Research in Networking and Systems (REUNS 2019) (in conjunction with MASS), 2019 (Workshop General Chair) IEEE International Conference on Distributed Computing (ICDCS), 2019 (Vice Chair) International Workshop on Computational Intelligence and Big Data Towards Trustworthy IoT (in conjunction with GLOBECOM), 2018 (Workshop Co-Chair) The 45th International Conference on Parallel Processing (ICPP), 2016 (General Chair) IEEE Conference on Communications and Network Security (CNS), 2016 (General Chair) Resilient Communication Systems, Resilience week (RW), 2016 (Symposium Chair) 15th ACM International Symposium on Mobile Ad Hoc Networking and Computing (MobiHoc), 2014 (General Chair) 22nd IEEE International Conference on Network Protocols (ICNP), 2014 (Program Area Chair) 33rd IEEE International Conference on Distributed Computing Systems (ICDCS), 2013 (General Chair) CCF China National Computer Congress (CNCC), 2013 (Program Chair) Recent Awards Best paper award               C. Wu, M. Xiao, J. Wu, Y. Xu, J. Zhou, and H. Sun, \"Towards Federated Learning on Fresh Datasets,\"              Proc. of the 20th IEEE International Conference on Mobile Ad-Hoc and Smart Systems (MASS 2023), September 25-27, 2023.[ppt] Faculty Research Award              Temple University, 2022-2023. Distinguished Research Award              College of Science and Technology, Temple University, 2021-2022. Distinguished Mentoring Award              College of Science and Technology, Temple University, 2020-2021. Outstanding Service Award              IEEE Technical Committee on Distributed Processing (TCDP), 2018. Best paper award               Y. Chen and J. Wu, \"Multi-hop Coflow Routing and Scheduling in Data Centers,\"              Proc. of the IEEE International Conference on Communications(ICC 2018), May 20-24, 2018. [ppt] Best paper award               M. Z. Alam Bhuiyan and J. Wu, \"Event Detection through Differential Pattern Mining in Internet of Things,,\" Proc. of the 13th IEEE International Conference on Mobile Ad hoc and Sensor Systems(MASS 2016), October 10-13, 2016. [ppt] Best paper award H. Zheng, W. Chang and J. Wu, \"Coverage and Distinguishability Requirements for Traffic Flow Monitoring Systems,\" Proc. of the 24th IEEE/ACM International Symposium on Quality of Service(IWQoS 2016), June 20-21, 2016. [ppt] Best paper runner-up award H. Zheng, Z. Wan, and J. Wu, \"MapReduce Framework through Joint Scheduling of Overlapping Phases,,\" Proc. of the 25th International Conference on Computer Communications and Networks (ICCCN 2016), August 1-4, 2016. [ppt] China Computer Federation (CCF) Overseas Outstanding Achievement Award \"Some Reflections on C&I Education,\" [video] [ppt in English and ppt in Chinese] CCF China National Computer Congress (CNCC), 2011, Keynote Speaker Keynotes/Distinguished Lectures/Panels Keynote Speaker: Scalability and Liquidation Enhancement in QoS Lightning Networks, IEEE ICPADS, 2024. Keynote Speaker: Challenges and Opportunities in Re-Balancing of Bike Sharing Systems, FICC 2021, IEEE SmartIoT 2024. [ppt] Keynoter Speaker: Edge-Cloud Networks for Efficient AI/ML Implementations, Cloudnet 2023, IEEE ICMC 2024, Bigcom 2024. [ppt] Keynoter Speaker: On Cloud-Network Convergence and Elastic Computing, SIGCOMM Symposium in A",
  "content_length": 14439,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:28"
}