{
  "name": "Jie Xu 0007",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/331/professor-jie-xu",
  "status": "success",
  "content": "Professor Jie Xu | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Professor Jie Xu Position: Professor of Computing Areas of expertise: distributed computing systems; cloud computing; system and software dependability; fault tolerance; data analytics; simulation Email: J.Xu@leeds.ac.uk Phone: +44(0)113 343 5193 Location: 3.25a Sir William Henry Bragg Building Website: My personal site Profile I am the leader for a Research Peak of Excellence at Leeds, the director of the EPSRC-funded White Rose Grid e-Science Centre, involving the three White Rose Universities of Leeds, Sheffield and York, and the head of the Distributed Systems and Services (DSS) Theme (with a total of over 40 theme members) at Leeds. I have worked in the field of Distributed Computing Systems for over thirty-five years, engaging closely with industrial leaders such as Rolls-Royce, BAE Systems, and JLR. I received a PhD in Computing Science from the University of Newcastle upon Tyne, and was Professor of Distributed Systems at the University of Durham (https://www.dur.ac.uk/) before joined Leeds in 2003. I am an executive member of UKCRC (UK Computing Research Committee) and a Turing Fellow in AI and Data Science. I have served as an academic expert for numerous governments and industries, such as Singapore IDA, Lenovo, UK EPSRC, and UK DTI (InnovateUK). In addition, I have extensive editorial experience, having served as an editor for IEEE Distributed Systems from 2000 to 2005, and currently acting as an associate editor of IEEE Transactions on Parallel and Distributed Systems and ACM Computing Surveys. I am a Steering Committee member for several prestigious IEEE conferences, such as SRDS, ISORC, HASE, SOSE, JCC, and CISOSE, as well as serving on the executive board of IEEE TC on BIS. I have also been a General Chair/PC Chair for various IEEE international conferences. With over 300 academic publications, including papers in top-ranked IEEE and ACM Transactions, I have received international research prizes, such as the BCS/AT&T Brendan Murphy Prize, and led or co-led more than 20 research projects worth over £25M. I am also the co-founder of two university spin-outs that specialize in data analytics and AI software for optimizing data center performance and in co-simulation and digital twins. The EPSRC-funded WRG e-Science centre (2002-2014), led by me, is a highly successful and internationally leading e-Research centre. It represents a strategic partnership between the three major Yorkshire research universities - Leeds, Sheffield and York - which has added significant value to their research projects in the areas of Internet-Based Computing and Advanced Engineering Applications (e.g. a highly successful partnership with Rolls-Royce), raising the national and international profile of the universities. From an initial investment of £7 million from the three universities, the centre has gone on to generate research income from both research councils and industry worth more than £20 million over the next 10 years. I am now leading a collaborative research team, investigating fundamental theories and models for distributed systems (e.g. the theory for fault-diagnosable and large-scale distributed systems, and the formalisation for dynamic multi-party authentication) and developing advanced Internet and Cloud technologies with a focus on complex system engineering (e.g. with Rolls-Royce and JLR), energy-efficient computing (e.g. with Google and Alibaba), dependable and secure collaboration (e.g. large-scale data processing and analysis for social science and e-healthcare applications with TPP and X-Lab Ltd), and evolving system architectures (e.g. with BAE Systems). Responsibilities Head of Distributed Systems and Services Theme Research interests My main research interests are on massive-scale distributed computing systems, complex resource management for Edge-Cloud computing, and data-centric system engineering, focusing on investigating, designing and implementing system components and mechanisms to tackle performance, efficiency, dependability and cost-effectiveness challengies and manage their trade-offs. I am also working on system and software dependability, including software fault tolerance, and rapid error recovery in Cloud data centres. I have had for many years an exceptional track record of continuously obtaining and successfully delivering large-scale research projects (with a total of over £25M). My research activities have been supported so far by more than 20 research projects, mainly from the UK Research Councils, TSB/DTI, JISC, EU and industrial sources, e.g. being the PI for the prestigious EPSRC Platform grant on the WRG grid system (£1.2M+ since 2002). Other examples of important grants related to my research areas are: the UK TSB STRAPP project on using data provenance to enhance the trustworthiness of decision making process (2011-14, £1.37M, PI), the EPSRC PSi project on engineering a complex system of systems (2013-18, £0.75M, PI, industrial partner: JLR) within the EPSRC Simulation Innovation programme (£12M), and an on-going £1M+ EPSRC grant on using AI and data analytics to manage resources intelligently in massive-scale distributed systems (EP/T01461X/1, 2020-24). I also led the JISC Grid Testbed/NGS project at Leeds, Phases I, II and III (over £1.5M) and was one of the four academic leaders for the EPSRC/BAES System Engineering programme (£9.4M, industrial partner: BAE Systems). I was the PI for the EPSRC/DTI e-Science Core Programme project: e-Demand (over £0.6M) on developing a service-oriented Grid architecture, with support from industrial partners including SUN Microsystems, Sharp, and Sparkle Computers Ltd. I co-led successfully the design and development of a data-driven Grid system for e-Social Science applications through the ESRC MoSeS and GENeSIS projects (£2.2M), and was a co-leader of the successful EPSRC IBHIS project (£0.7M) for integrating distributed diverse data sources. I have published in excess of 300 academic papers, book chapters and edited books in areas largely related to exploring and building dependable distributed systems (with 10,000+ Google citations). My major work has appeared in IEEE Transactions on Computers, IEEE Transactions on Parallel and Distributed Systems, and IEEE Computer in the areas including (you may find the details of my publications in my full publication list below): 1) Accelerating Massive-Scale Model Training Sun X, Wang W, Qiu S, Yang R, Huang S, Xu J, Wang Z. 2022. STRONGHOLD: Fast and Affordable Billion-Scale Deep Learning Model Training. International Conference for High Performance Computing, Networking, Storage, and Analysis (SC22), Association for Computing Machinery. Lin L, Qiu S, Yu Z, You L, Long X, Sun X, Xu J, Wang Z. 2022. AIACC-Training: Optimizing Distributed Deep Learning Training through Multi-streamed and Concurrent Gradient Communications. 42nd IEEE International Conference on Distributed Computing Systems (ICDCS), IEEE. 2) Intelligent Distributed Computing Mommessin C, Yang R, Shakhlevich N, Sun X, Kumar S, Xiao J, Xu J. 2023. Affinity-Aware Resource Provisioning for Long-Running Applications in Shared Clusters. Journal of Parallel and Distributed Computing (funded by the £1M+ UK EPSRC project EP/T01461X/1 from 2020 to 2024). Wen Z, Hu H, Yang R, Qian B, Sham RWH, Sun R, Xu J, Patel P, Rana O, Dustdar S, Ranjan R. 2022. Orchestrating Networked Machine Learning Applications Using Autosteer. IEEE Internet Computing. 26(6), pp. 51-58. Zhu J, Yang R, Sun X, Wo T, Hu C, Peng H, Xiao J, Zomaya AY, Xu J. 2022. QoS-Aware Co-Scheduling for Distributed Long-Running Applications on Shared Clusters. IEEE Transactions on Parallel and Distributed Systems. 33(12), pp. 4818-4834. Song Y, Jiao L, Yang R, Wo T, Xu J. 2022. Incentivizing Online Edge Caching via Auction - Based Subsidization. IEEE International Conference on Sensing, Communication, and Networking (SECON), IEEE. Zhu J, Yang R, Hu C, Wo T, Xue S, Ouyang J, Xu J. 2021. Perph: A Workload Co-location Agent with Online Performance Prediction and Resource Inference. IEEE/ACM 21st International Symposium on Cluster, Cloud and Internet Computing (CCGrid). Yang R, Hu C, Sun X, Garraghan P, Wo T, Wen Z, Peng H, Xu J, Li C. 2020. Performance-Aware Speculative Resource Oversubscription for Large-Scale Clusters. IEEE Transactions on Parallel and Distributed Systems. 31(7), pp. 1499-1517. 3) Secure and Dependable Computing Sun X, Ye Q, Hu H, Wang Y, Huang K, Wo T, Xu J. 2023. Synthesizing Realistic Trajectory Data with Differential Privacy. IEEE Transactions on Intelligent Transportation Systems, pp. 1-14. Yang Y, Yang R, Li Y, Cui K, Yang Z, Wang Y, Xu J, Xie H. 2022. RoSGAS: Adaptive Social Bot Detection with Reinforced Self-Supervised GNN Architecture Search. ACM Transactions on the Web. Hei Y, Yang R, Peng H, Wang L, Xu X, Liu J, Liu H, Xu J, Sun L. 2021. Hawk: Rapid Android Malware Detection through Heterogeneous Graph Attention Networks. IEEE Transactions on Neural Networks and Learning Systems. Wen Z, Lin T, Yang R, Ji S, Ranjan R, Romanovsky A, Lin C, Xu J. 2020. GA-Par: Dependable Microservice Orchestration Framework for Geo-Distributed Clouds. IEEE Transactions on Parallel and Distributed Systems. 31(1), pp. 129-143. Garraghan P, Ouyang X, Yang R, McKee D, Xu J. 2019. Straggler Root-Cause and Impact Analysis for Massive-Scale Virtualized Cloud Datacenters. IEEE Transactions on Services Computing. 12(1), pp. 91-104. 4) Data Engineering and Knowledge Discovery Wang Y, Yin H, Chen T, Liu C, Wang B, Wo T, Xu J. 2022. Passenger Mobility Prediction via Representation Learning for Dynamic Directed and Weighted Graphs. ACM Transactions on Intelligent Systems ",
  "content_length": 12852,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:28"
}