{
  "name": "Jie Cao 0010",
  "homepage": "https://mlciv.com",
  "status": "success",
  "content": "Jie Cao | Dialogue, NLP, ML Jie CaoAssistant Professor School of Computer Science University of Oklahoma 110 W. Boyd St., DEH 210-B, Norman, OK 73019Dr. Jie Cao is an Assistant Professor in the School of Computer Science at the University of Oklahoma, leading the OUNLP lab. I am also affiliated with the Data Science and Analytics Institute at OU. Before joining OU, he spent two years as a post-doctoral researcher at the NSF AI Institute for Student-AI Teaming (iSAT) at the University of Colorado Boulder, where he mainly worked with Dr. James Martin and Dr. Martha Palmer. He obtained his Ph.D. from the Kahlert School of Computing at the University of Utah, where he worked with Dr. Vivek Srikumar. Earlier in his academic journey, he completed his M.S. and B.S. in Computer Science at Huazhong University of Science of Technology~(HUST) in China, and he has also worked/interned in industrial companies including Alibaba, Baidu, Sohu, WeChat(@Palo Alto), and Amazon, etc.Research InterestsI work on Natural Language Processing and Machine Learning. Current research interests include:Multi-party Multi-modal Dialogue/Discourse Analysis on Mental Health, Education, etcLLM/MLLM Alignement and Agents, focusing on Domain Specific “World” Model and Human-AI Teaming, etcEfficient Structured Prediction and Symbolic Methods for Controlling and Augmenting Neural NetworksRobust Deployment, and Evaluation of Trustworthy AINews11/2025: Invited Talk on “Decoding Classroom Dialogue: Discourse Analysis in STEM Education” at Rice University Ken Kennedy Institute AI Seminar Series11/2025: New preprint “Translation via Annotation: A Computational Study of Translating Classical Chinese into Japanese” is now available on arXiv.10/2025: New preprint “Rethinking On-policy Optimization for Query Augmentation” is now available on arXiv. We present the first systematic comparison of prompting-based and RL-based query augmentation and introduce a novel hybrid method OPQE that outperforms both approaches.10/2025: Congratulations to Cuong Huynh! His undergraduate summer research on text simplication has been accepted to TSAR2025 Workshop@EMNLP. Multi-round fine-grained symbolic rules could further refine the LLM-based simiplication.09/2025: Our collaborative proposal on semic simulation was awarded by Nvidia for 4 Max-Q GPUs.09/2025: Our proposal on Small Language Model awarded by NSF ACCESS for GPU Credits.08/2025: Thrilled to share that our paper using state space model for reservoir release has been accepted in Journal of Hydrology. Grateful to my coauthors for guiding me into the hydrology journey alongside AI.08/2025: One paper on frame semantics and LLM got accepted to EMNLP’2025 Main Conference!08/2025: Congratulations to Tiffany and Ava for receiving the Undergraduate Engineering Research Fellowship for Fall 2025!07/2025: One paper on “AQUAH: Automatic Quantification and Unified Agent in Hydrology” got accepted to ICCV’2025 Workshop on Sustainability with Earth observation and AI.05/2025: Congratulations to Masiko Mamba on being awarded the Undergraduate Engineering Research Fellowship for Summer 2025.04/2025: Our paper on multi-perspective discourse analysis on teaching and tutoring dialogue got accepted to EDM2025.04/2025: I was awarded Alternative Textbook Grant on practical course content on recent advances in LLM and Agentic AI.03/2025: Invited Talk in Graduate Student Community@Gallogly College of Engineering: Advances in Open LLM02/2025: New preprint on multimodal LLM on material science MatterChat.11/2024: Our paper “Enhancing Talk Moves Analysis in Mathematics Tutoring through Classroom Teaching Discourse” got accepted to COLING’2025.11/2024: Our paper on visualization for network pruning got accepted to TVCG.10/2024: Invited Talk on “Modularized Conversational Modeling” at the OU DISC.09/2024: Talk with students on “History of NLP” at the OU AI/ML Club.07/2024: Our paper on dialogue classification via LLM finetuning is accepted to L@S’24.02/2024: Invited Talk on “Modularized Conversational Modeling” at Emory University, Georgia State University.11/2023: In Fall 2023, I taught NLP class~(CSCI-LING 5832) with James Martin. I newly created course materials on LLMs, In-Context Learning, Dialogue Generation, etc.05/2023: Our paper on Question Generation accepted to BEA’2305/2023: A short paper on “Mind the Gap between the Application Track and the Real World” got accepted to ACL’2304/2023: Our paper on “A Comparative Analysis of Automatic Speech Recognition Errors in Small Group Classroom Discourse” got accepted to UMAP’23.03/2023: My research on conversational simulation on small-group discussion got awarded by iSAT Trainee Grant.02/2023: Our paper on AI agent for Jigsaw Classrooms got accepted on AIAIC’23.12/2022: Our paper on Dependency Dialog Act got accepted on IWSDS’23.12/2022: Invited Talk on Database Workload Characterization work at Microsoft’s Gray Systems Lab. Slides.08/2022: I joined NSF AI Institute for Student-AI Teaming (iSAT) as a post-doctoral researcher.06/2022: New preprint on visual analysis of neural network pruning.Selected Publications(See full list in Publication Page or Google Scholar) arXiv Zilong Li and Jie Cao. 2025. Translation via Annotation: A Computational Study of Translating Classical Chinese into Japanese. BibTeX@misc{li2025translation, title = {Translation via Annotation: A Computational Study of Translating Classical Chinese into Japanese}, author = {Li, Zilong and Cao, Jie}, year = {2025}, eprint = {2511.05239}, archiveprefix = {arXiv}, primaryclass = {cs.CL}, url = {https://arxiv.org/abs/2511.05239} } |  URL TSAR Cuong Huynh and Jie Cao. 2025. OUNLP at TSAR 2025 Shared Task Multi-Round Text Simplifier via Code Generation. In Matthew Shardlow, Fernando Alva-Manchego, Kai North, Regina Stodden, Horacio Saggion, Nouran Khallaf, and Akio Hayakawa, editors, Proceedings of the Fourth Workshop on Text Simplification, Accessibility and Readability (TSAR 2025), pages 223–230, Suzhou, China, November. Association for Computational Linguistics. BibTeX@inproceedings{huynh-cao-2025-ounlp, title = {{OUNLP} at {TSAR} 2025 Shared Task Multi-Round Text Simplifier via Code Generation}, author = {Huynh, Cuong and Cao, Jie}, editor = {Shardlow, Matthew and Alva-Manchego, Fernando and North, Kai and Stodden, Regina and Saggion, Horacio and Khallaf, Nouran and Hayakawa, Akio}, booktitle = {Proceedings of the Fourth Workshop on Text Simplification, Accessibility and Readability (TSAR 2025)}, month = nov, year = {2025}, address = {Suzhou, China}, publisher = {Association for Computational Linguistics}, url = {https://aclanthology.org/2025.tsar-1.19/}, pages = {223--230}, isbn = {979-8-89176-176-6} } |  PDF  |  URL arXiv Zhichao Xu, Shengyao Zhuang, Xueguang Ma, Bingsen Chen, Yijun Tian, Fengran Mo, Jie Cao, and Vivek Srikumar. 2025. Rethinking On-policy Optimization for Query Augmentation. arXiv preprint arXiv:2510.17139, October. BibTeX@article{xu2025rethinking, title = {Rethinking On-policy Optimization for Query Augmentation}, author = {Xu, Zhichao and Zhuang, Shengyao and Ma, Xueguang and Chen, Bingsen and Tian, Yijun and Mo, Fengran and Cao, Jie and Srikumar, Vivek}, journal = {arXiv preprint arXiv:2510.17139}, year = {2025}, month = oct, url = {https://arxiv.org/abs/2510.17139} } |  URL J. Hydrol. Jiaorui Zhang, Haowen Yue, Milad Basirifard, Jie Cao, and Tiantian Yang. 2025. A Mamba-type of Deep State Space Model for Reservoir Release Simulation with a Large-Scale Verification over 441 Dams across CONUS. Journal of Hydrology:134145. BibTeX@article{ZHANG2025134145, title = {A {{Mamba-type}} of Deep State Space Model for Reservoir Release Simulation with a Large-Scale Verification over 441 Dams across {{CONUS}}}, author = {Zhang, Jiaorui and Yue, Haowen and Basirifard, Milad and Cao, Jie and Yang, Tiantian}, year = {2025}, journal = {Journal of Hydrology}, pages = {134145}, issn = {0022-1694}, doi = {10.1016/j.jhydrol.2025.134145}, url = {https://www.sciencedirect.com/science/article/pii/S0022169425014830}, keywords = {Large scale,Release simulation,SHAP,Structured State Space Model,Water management} } |  URL EMNLP Jayanth Krishna Chundru, Rudrashis Poddar, Jie Cao, and Tianyu Jiang. 2025. Do LLMs Encode Frame Semantics? Evidence from Frame Identification. In Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing(To Appear). Association for Computational Linguistics, November. BibTeX@inproceedings{jayanth2025emnlp, title = {Do LLMs Encode Frame Semantics? Evidence from Frame Identification}, booktitle = {Proceedings of the 2025 Conference on Empirical Methods in Natural Language Processing(To Appear)}, author = {Chundru, Jayanth Krishna and Poddar, Rudrashis and Cao, Jie and Jiang, Tianyu}, year = {2025}, month = nov, publisher = {Association for Computational Linguistics}, venue = {Suzhou, China} } |  PDF ICCV Workshop Songkun Yan, Zhi Li, Siyu Zhu, Yixin Wen, Mofan Zhang, Mengye Chen, Jie Cao, and Yang Hong. 2025. AQUAH: Automatic Quantification and Unified Agent in Hydrology. 1st workshop on Sustainability with Earth observation and AI (co-located with ICCV), 2025 (To Appear). BibTeX@article{songkun2025sea, title = {AQUAH: Automatic Quantification and Unified Agent in Hydrology}, author = {Yan, Songkun and Li, Zhi and Zhu, Siyu and Wen, Yixin and Zhang, Mofan and Chen, Mengye and Cao, Jie and Hong, Yang}, journal = {1st workshop on Sustainability with Earth observation and AI (co-located with ICCV), 2025 (To Appear)}, url = {https://arxiv.org/abs/2508.02936}, year = {2025} } |  PDF  |  URL EDM Jannatun Naim, Jie Cao, Fareen Tasneem, Jennifer Jacobs, Brent Milne, James Martin, and Tamara Sumner. 2025. Towards Actionable Pedagogical Feedback: A Multi- Perspective Analysis of Mathematics Teaching and Tutoring Dialogue. In Proceedings of the 18th International Conference on Educational Data Mining, pages 328–341. International Educational Data Mining Society, July. BibTeX@inproceedings",
  "content_length": 20591,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:25"
}