{
  "name": "Jie Wei",
  "homepage": "https://www.ccny.cuny.edu/profiles/jie-wei",
  "status": "success",
  "content": "Jie Wei | The City College of New York Skip to main content > Home / Faculty and Staff Profiles / Jie Wei Jie Wei Professor Main Affiliation Computer Science Additional Departments/Affiliated Programs Computer Engineering Building North Academic Center Office 8/209A Phone (212) 650-5604 Fax (212) 650-6248 Email jwei@ccny.cuny.edu Website http://www-cs.ccny.cuny.edu/~csjie Jie Wei Profile Prof. Jie Wei received his B.S, M.Sc and Ph.D from the University of Science and Technology of China, Hefei, China; Institute of Software in Chinese Academy of Sciences, Beijing, China; and Simon Fraser University,  Burnaby, Canada, all in computer science. Since 1999 he has been on the faculty of the Dept. of Computer Science, City College and the Graduate Center, the City University of New York, where he is now a full professor. His research interests are multi-modal computing, computer vision, medical imaging, and machine learning. His researches have been supported by NIH, NSF, AFOSR, AFRL, ARO and ONR. Education Ph.D. Computer Science, Simon Fraser University, Burnaby, Canada, 1999 M.Sc. Computer Science, Institute of Software, Chinese Academy of Sciences, Beijing, China, 1992 B.Sc. Computer Science, University of Science and Technology of China, Hefei, China, 1989 Courses Taught CS32200: Software Engineering CS47900: Digital Libraries CS59866&67: Capstone I&II I1000: Database I Research Interests Professor Wei's research interests include multi-modal computing, computer vision, medical imaging, and machine learning. Publications Representative publications:​ M. Chao, J. Wei, Y. Lo, J. Penagaricano, \"Dost cluster model parameterization of the parotid gland in irradiation of head and neck cancer\", Physical of Engineering Sciences in Medicine, Vol. 43: 143-153, 2020. J. Wei, C. Liu, Z. Zhu, L. Cain, V. Velten, \"Vehicle engine classification using normalized tone-pitch indexing and neural coputing on short remote vibration sensing data\", Expert System with Applications, Vol. 115: 276-286, 2019. J. Wei, A. Mowshowitz, \"Laser Doppler Vibrometer with Artificial Intelligence: A Valuable Tool in the Fight Against Crime and Terrorism\", Police Chief, Sept. 2019. M. Chao, J. Wei, G. Narayanansamy, Y. Yuan, J. Penagaricano, \"Three-dimensional Cluster Formation and Structures in Heterogeneous Dose Distributions of Intensity Modulated Radiation Therapy\", Radiotherapy and Oncology, 127(2): 197-205, May, 2018. J. Wei, C. Liu, H. Clouse, \"Spectral eigen index: military vehicle fingerprinting using eigen analysis in spectral domain\", Pattern Recognition Letters, Vol. 112: 98-103, 2018. J. Wei, M. Chao, \"A constrained linear regression optimization algorithm for diaphragm motion tracking with cone beam CT projections\", Physica Medica: European Journal of Medical Physics, Vol. 46: 7-15, Feb., 2018. J. Wei, L. Zhang, B.M. Fu, \"Automatic Quantification of Endothelial Nitric Oxide Levels in a Microvessel with and without Tumor Cell Adhesion\", Int. J. of Image and Graphics, 18(1): 1-22, 2018. G. Li, J. Wei, M. Kadbi, et. al., \"A novel super-resolution approach to time-resolved volumetric 4DMRI with high spatiotemporal resolution for multi-breathing cycle motion assessment\", International Journal of Radiation Oncology, Biology, Physics, 98(2): 454-462, 2017. G. Li, J. Wei, D. Olek, M. Kadbi, N. Tyagi, K. Zakian, J. Mechalakos, J. Deasy, M. Hunt, \"Direct comparison of respiration-correlated four-dimensional magnetic resonance imaging (4DMRI) reconstructed based on concurrent internal navigator and external bellows\", International Journal of Radiation Oncology, Biology, Physics, 97(3): 596-605, 2017. M. Chao, J. Wei, T. Li, Y. Yuan, K. Rosenzweig, Y. Lo, \"Robust breathing signal extraction from cone beam CT projections based on adaptive and global optimization techniques\", Physics in Medicine and Biology, Vol. 16, No. 8, pages 3109-3126, 2016. A. Yuan, J. Wei, C. Gaebler, H. Huang, D. Olek, G. Li, \"A novel respiratory motion perturbation model adaptable to patient breathing irregularities\", International Journal of Radiation Oncology, Biology, Physics, 96(5): 1087-1096, 2016. G. Li, J. Wei, H. Huang, Q. Chen, C. Gaebler, T. Lin, A. Yuan, A. Rimner, J. Mechalakos, \"Characterization of optical-surface-imaging (OSI)-based spirometry for respiratory surrogating in radiotherapy\", Medical Physics Journal, Vol. 43, No.3, pages 1348-1360, 2016. J. Wei, B. Cai, L. Zhang and B.M. Fu, \"Automatic classification and quantification of cell adhesion locations on the endothelium\", Annals of Biomedical Engineering, 43(8), pages 1803-1814, 2015. G. Li, J. Wei, H. Huang, C. Gaebler, A. Yuan, J. Deasy, \"Automatic assessment of average diaphragm motion trajectory from 4DCT images through machine learning\", Biomedical Physics & Engineering Express, Vol. 1, No. 4, 13 pages, 2015. G. Li, H. Huang, J. Wei, D.G. Li, Q. Chen, C.P. Gaebler, J. Sullivan, J. Zatcky, A. Rimner, and J. Mechalakos, \"Novel spirometry based on optical surface imaging\", Medical Physics Journal, Vol. 42, No. 4, pages 1690-1697, 2015. J. Wei and G. Li, \"Automated Lung Segmentation and Image Quality Assessment for Clinical 3D/4D Computed Tomography\", IEEE J. of Translational Engineering in Health and Medicine, Vol. 2, No. 1, 10 pages, 2014. J. Wei, K. Vongsy, O. Mendoza-Schrock, C. Liu, \"Vehicle engine classification using spectral tone-pitch vibration indexing and neural network\", Int. J. on Surveillance & Monitoring Res. Tech., Special issue on Machine learning and sensor fusion techniques, Vol. 2 No. 3, pages 32-50, 2014. G. Li, M. Caraveo, J. Wei, A. Rimner, A. Wu, K. Goodman, E. Yorke, \"Rapid estimation of 4DCT motion-artifact severity based on 1D breathing-surrogate periodicity\", Medical Physics Journal, Vol. 41, No. 11, 9 pages, 2014. J. Wei, A. Yuan, G. Li, \"An automatic toolkit for efficient and robust analysis of 4D respiratory motion\", Best in Physics award (joint imaging therapy), AAPM, 2014. J. Wei, \"On Markov Earth Mover's Distance\", Int. J. of Image and Graphics, Vol. 14, No. 4, 32 pages, 2014. J. Wei, \"Small moving object detection from video sequences\", Int. J. of Image and Graphics, 14(3), 2013. J. Wei, \"Numerical sequence matching based on local sum functions\", Pattern Recognition Letters, 31: 600-608, 2010; J. Wei, \"Shape Indexing and Recognition based on Regional Analysis\", IEEE Trans. on Multimedia, Vol. 9, No. 5, pages 1049-1061, 2007. J. Wei, \"Video Content Classification based on 3-dimensional Eigen Analysis\", IEEE Trans. on Image Processing, Vol 14, No. 5, pages 662-673, 2005. J. Wei, \"Lebesgue anisotropic image denoising\", Int. J. on Imaging & Sys. Tech., 15(1): 64-73, 2005. J. Wei, \"Markov Edit Distance\", IEEE Trans. on Pattern Analysis and Machine Intelligence, Vol 26, No. 3, pages 311-321, 2004. J. Wei, \"Robust recovery of multiple light source based on local light source constant constraint\", Pattern Recognition Letters, 24(1-3): 159-172, 2003. J. Wei, \"Color object indexing and recognition in digital libraries\", IEEE Trans. on Image Processing, 11(8): 912-922, 2002. J. Wei, \"Image segmentation based on situational DCT descriptors\", Pattern Recognition Letters, Vol. 23: 295-302, 2002. J. Wei and Z.N. Li, \"On active camera control and camera motion recovery with foveate wavelet transform\", IEEE Trans. on Pat. Ana. & Mach. Intel., 23(8): 896-903, 2001. J. Wei and Z.N. Li, \"An Efficient Two-pass MAP-MRF Algorithm for Motion Estimation based on Mean Field Theory\", IEEE Trans. on Circuits and Systems for Video Technology, 9(6), pages 960-972, 1999. M.S. Drew, J. Wei and Z.N. Li, \"Illumination-invariant color object recognition via compressed chromaticity histograms of color-channel-normalization images\", Pages 533-540, Proc. ICCV'98, 1998. J. Wei and Z.N. Li, \"An enhancement to MRMC scheme in video compression\", IEEE Trans. on Circuits and Systems for Video Technology, 7(3): 564-568, 1997.",
  "content_length": 7871,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:27"
}