{
  "name": "Jie Zhang 0071",
  "homepage": "https://vipl.ict.ac.cn/people/_jzhang",
  "status": "success",
  "content": "Jie Zhang----Visual Information Processing and Learning (VIPL) Location： Home > 人员信息>Jie Zhang People Professor Associate Professor Assistant Research Fellow Postdoctoral Fellow Engineer Past Member Jie Zhang Jie Zhang Associate Professor Email： jie.zhang@vipl.ict.ac.cn Research area： Computer Vision, Pattern Recognition, Machine Learning Jie Zhang received his Ph.D. degree in computer science from the Institute of Computing Technology (ICT), Chinese Academy of Sciences (CAS), Beijing, China, in 2017. Now he is an associate professor at Institute of Computing Technology, Chinese Academy of Sciences. His research interests cover computer vision, pattern recognition, machine learning, particularly include deep learning and its application in face recognition. He has published more than 30 papers in refereed journals and proceedings in the areas of computer vision and pattern recognition, such as TPAMI， IJCV, TIP, CVPR, ICCV and ECCV. He has also won several awards, namely, Championship Award in ACM MM Kinship Recognition Challenge 2017, Runner-up Award in IEEE CVPR Landmark Detection Challenge 2017, Runner-upAwardin ICCV Apparent Age Estimation Challenge 2015, etc. He was successively selected for the Beijing Science and Technology Nova Program, the Youth Innovation Promotion Association of the Chinese Academy of Sciences, and the MSRA \"Casting Star Project\". Experience Educational experience2007.9-2011.7 China University of Geosciences, Wuhan, B.S.2011.9-2017.6 the Institute of Computing Technology (ICT), Chinese Academy of Sciences (CAS), Beijing, Ph.D. Academic service Journal servicesTPAMI，IJCV，TIP，TMM，TNNLS，TCSVT，PR，TITS, Neural Networks, Information Sciences, Information Fusion, Computers & Security, Expert Systems With Applications, Knowledge-Based Systems, NeurocomputingConference servicesCVPR，ICCV，ECCV，NeurIPS，ICLR Research content 1.   Adversarial Attacks and Defenses2.   Backdoor Attacks and Detection3.   Out-of-Distribution Generalization and Detection4.   Fairness, Privacy Leakage Assessmen5.   Deepfake Detection and Tracing, and Liveness Detection Research project Invited Talks and Papers Papers[TPAMI 2024] Zheng Yuan, Jie Zhang*, Zhaoyan Jiang, Liangliang Li, Shiguang Shan. \"Adaptive Perturbation for Adversarial Attack,\" IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) , 2024.[IJCV 2024] Zheng Yuan, Jie Zhang*, Yude Wang, Shiguang Shan, Xilin Chen. Towards Robust Semantic Segmentation against Patch-based Attack via Attention Refinement. International Journal of Computer Vision (IJCV), 2024.[TIP 2024]Mingjie He, Jie Zhang, Shiguang Shan*, Xilin Chen. \" Enhancing Face Recognition with Detachable Self-Supervised Bypass Networks,\" IEEE Transactions on Image Processing (TIP), vol. 33, pp. 1588 – 1599, 2024. [CVPR 2024] SiboWang, Jie Zhang, Zheng Yuan, Shiguang Shan. “Pre-trained Model Guided Fine-Tuning for Zero-Shot Adversarial Robustness,” IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024.[CVPR 2024] Zonghui Guo, Xinyu Han, Jie Zhang, Shiguang Shan, Haiyong Zheng. “Video Harmonization with Triplet Spatio-Temporal Variation Patterns,” IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2024.[ECCV 2024] Zhongqi Wang, Jie Zhang, Shiguang Shan, Xilin Chen. T2IShield: Defending Against Backdoors on Text-to-Image Diffusion Models. European Conference on Computer Vision (ECCV), 2024.[CVIU 2024] Changzhen Li, Jie Zhang*, Shuzhe Wu, Xin Jin, Shiguang Shan. \"Hierarchical Compositional Representations for Few-shot Action Recognition,\" Computer Vision and Image Understanding (CVIU), vol. 240, pp. 103911, 2024.[TIP 2023] Yude Wang, Jie Zhang, Meina Kan, Shiguang Shan, Xilin Chen. \"BLPSeg: Balance the Label Preference in Scribble-Supervised Semantic Segmentation,\" IEEE Transactions on Image Processing (TIP), vol. 32, pp. 4921-4934, 2023.[TIFS 2023] Xingming Long, Jie Zhang, Shuzhe Wu, Xin Jin, Shiguang Shan*. \"Dual Sampling Based Causal Intervention for Face Anti-Spoofing with Identity Debiasing,\" IEEE Transactions on Information Forensics and Security (TIFS), vol. 19, pp. 851-862, 2023.[MM 2023] Qiankun Li, Xiaolong Huang, Zhifan Wan, Lanqing Hu, Shuzhe Wu, Jie Zhang, Shiguang Shan, Zengfu Wang. \"Data-efficient Masked Video Modeling for Self-supervised Action Recognition,\" ACM International Conference on Multimedia (ACM MM), pp. 2723-2733, 2023. [CVPR 2022] Mingjie He, Jie Zhang, Shiguang Shan, Xilin Chen. \"Enhancing Face Recognition With Self-Supervised 3D Reconstruction,\" IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), pp. 4062-4071, 2022.[PR 2022]Yude Wang, Jie Zhang*, Meina Kan, Shiguang Shan. \" Learning Pseudo Labels for Semi-and-weakly Supervised Semantic Segmentation,\" Pattern Recognition (PR), vol. 132, pp. 108925, 2022.[ECCV 2022] Zheng Yuan, Jie Zhang, Shiguang Shan. \"Adaptive Image Transformations for Transfer-Based Adversarial Attack,\" European Conference on Computer Vision (ECCV), pp. 1-17, 2022.[TIP 2021] Mingjie He, Jie Zhang, Shiguang Shan*, Xiao Liu, Zhongqin Wu, Xilin Chen. \"Locality-aware Channel-wise Dropout for Occluded Face Recognition,\" IEEE Transactions on Image Processing (TIP), vol. 31, pp. 788-798, 2021. [TIFS 2021] Yunpei Jia, Jie Zhang*, Shiguang Shan. \"Dual-branch Meta-learning Network with Distribution Alignment for Face Anti-spoofing,\" IEEE Transactions on Information Forensics and Security (TIFS), vol. 17, pp. 138-151, 2021.[ICCV 2021] Zheng Yuan, Jie Zhang, Yunpei Jia, Chuanqi Tan, Tao Xue, Shiguang Shan. \" Meta Gradient Adversarial Attack,\" IEEE/CVF International Conference on Computer Vision (ICCV), pp. 7748-7757, 2021.[PR 2021] Yunpei Jia, Jie Zhang, Shiguang Shan*, Xilin Chen. \"Unified Unsupervised and Semi-supervised Domain Adaptation Network for Cross-scenario Face Anti-spoofing,\" Pattern Recognition (PR), vol.115, pp. 107888, 2021.[CVPR 2020] Yude Wang, Jie Zhang, Meina Kan, Shiguang Shan, Xilin Chen. \"Self-Supervised Equivariant Attention Mechanism for Weakly Supervised Semantic Segmentation,\" IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), pp. 12272-12281, 2020.[CVPR 2020] Yunpei Jia, Jie Zhang, Shiguang Shan, Xilin Chen. \"Single-side Domain Generalization for Face Anti-spoofing,\" IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), pp. 8484-8493, 2020.[PR 2018] Mingjie He, Jie Zhang, Shiguang Shan*, Meina Kan, Xilin Chen. \" Deformable Face Net for Pose Invariant Face Recognition,\" Pattern Recognition (PR), vol.100, pp. 107113, 2018.[CVPR 2016] Jie Zhang, Meina Kan, Shiguang Shan, and Xilin Chen. \"Occlusion-free Face Alignment: Deep Regression Networks Coupled with De-corrupt AutoEncoders,\" IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pp. 3428-3437, 2016.[ICCV 2015] Jie Zhang, Meina Kan, Shiguang Shan, and Xilin Chen. \"Leveraging Datasets With Varying Annotations for Face Alignment via Deep Regression Network,\" IEEE International Conference on Computer Vision (ICCV), pp. 3801-3809, 2015.[ECCV 2014] Jie Zhang, Shiguang Shan, Meina Kan, and Xilin Chen. \"Coarse-to-Fine Auto-encoder Networks (CFAN) for Real-time Face Alignment,\" European Conference on Computer Vision (ECCV), pp. 1-16, 2014.",
  "content_length": 7284,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:29"
}