{
  "name": "Jie Zhang 0050",
  "homepage": "https://sites.google.com/view/jie-zhang",
  "status": "success",
  "content": "Jie M. Zhang's HomepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationJie M. Zhang (张洁)Lecturer (Assistant Professor), King's College London, UK.Email: jie.zhang@kcl.ac.uk     Links:    CV     Google Scholar    Office: Bush House, Strand Campus, 30 Aldwych, London, WC2B 4BG, UK Research InterestMy research focuses on bridging software engineering (SE) and artificial intelligence (AI) to enhance the trustworthiness of both domains. This involves two key directions:AI for SE: Leveraging AI technologies to automate software engineering tasks, such as code generation, test case creation, program localisation, and automated program repair. Recent advancements in large language models (LLMs) have significantly improved capabilities in these areas, enabling more efficient and accurate software development processes.SE for AI: Applying software engineering principles to AI systems by treating them as specialised software. This direction uses established software engineering techniques to automatically detect and fix issues within AI models. I have been selected as the 2025 ACM Sigsoft early career researcher award winner “for pioneering contributions to software engineering for AI, significantly shaping and transforming the field of AI system testing”. The award is widely recognised as the most prestigious honour for early career researchers in software engineering community and is granted to just one recipient each year. Before joining King's College London,  I was a research fellow at University College London working with Professor Mark Harman and Professor Federica Sarro. I obtained my PhD degree in Computer Science from Peking University, China. My Phd advisors are Professor Lu Zhang and Professor Dan Hao.NewsNov 8th, our paper \"Fairness Aware Reinforcement Learning via Proximal Policy Optimization\" (by Gabriele La Malfa, Jie M. Zhang, Michael Luck, Elizabeth Black) was accepted by AAAI 2026 as an oral paper!Nov 8th, our paper \"DSCodeBench: A Realistic Benchmark for Data Science Code Generation\" (by Shuyin Ouyang, Dong HUANG, Jingwen Guo, Zeyu Sun, Qihao Zhu, Jie M. Zhang) was accepted by AAAI 2026 as a poster.26th Sep, our paper \"Large Language Models Miss the Multi-agent Mark\" (by Emanuele La Malfa, Gabriele La Malfa, Samuele Marro, Jie M. Zhang, Elizabeth Black, Michael Luck, Philip Torr, Michael J. Wooldridge) is accepted at NeurIPS 2025 position paper track (acceptance rate: 5.7%). 18th Sep, \"EffiBench-X: A Multi-Language Benchmark for Measuring Efficiency of LLM-Generated Code\" is accepted at NeurIPS 2025 datasets and benchmarks track. 10th August, our paper “Stealthy Backdoor Attack for Code Models”  (Zhou Yang, Bowen Xu, Jie M. Zhang, Hong Jin Kang, Jieke Shi, Junda He, David Lo) has got the IEEE TSE 2024 Best Paper Award!20th June 2025, our paper \"Measuring the Influence of Incorrect Code on Test Generation\" by Dong Huang, Jie M. Zhang, Mark Harman, Mingzhe Du, and Heming Cui is accepted by ICSE 2026. 16th May 2025, two ACL main train papers accepted: LLM-Powered Test Case Generation for Detecting Bugs in Plausible Programs (by Kaibo Liu, Zhenpeng Chen, Yiyang Liu, Jie M. Zhang, Mark Harman, Yudong Han, Yun Ma, Yihong Dong, Ge Li, Gang Huang) and Personality-Guided Code Generation Using Large Language Models (Yaoqi Guo, Zhenpeng Chen, Jie Zhang, Yang Liu, Yun Ma).1st May 2025, our FSE 2025 paper  \"Hallucination Detection in Large Language Models with Metamorphic Relations\" (by Borui Yang,  Md Afif Al Mamun, Jie M. Zhang, Gias Uddin) got the distinguished paper award at FSE 2025!1st May 2025, our paper \"SWIFTCODE: Enhancing Code Generation in Large Language Models through Efficiency-Aware Fine-tuning\" (by Dong HUANG, Guangtao Zeng, Jianbo Dai, Meng Luo, Han Weng, Yuhao QING, Heming Cui, Zhijiang Guo, Jie M. Zhang) is accepted by ICML 2025.25 Feb 2025, our paper \"Bias Testing and Mitigation in LLM-based Code Generation\" (by Dong Huang, Jie M. Zhang, Qingwen Bu, Xiaofei Xie, Junjie Chen, and Heming Cui) is accepted by TOSEM.19 Jan 2025, our paper \"Knowledge-Enhanced Program Repair for Data Science Code\" (by Shuyin Ouyang, Jie M. Zhang, Zeyu Sun, Albert Merono Penuela) is accepted by ICSE 2025.15 Jan 2025, our paper \"Hallucination Detection in Large Language Models with Metamorphic Relations\" (by Borui Yang,  Md Afif Al Mamun, Jie M. Zhang, Gias Uddin) is accepted by FSE 2025. 2nd Nov 2024, our paper \"Diversity Drives Fairness: Ensemble of Higher Order Mutants for Intersectional Fairness of Machine Learning Software\" (by Zhenpeng Chen, Xinyue Li, Jie M. Zhang, Federica Sarro, Yang Liu) is accepted at ICSE 2025. 26th Sep 2024, our paper \"EffiBench: Benchmarking the Efficiency of Automatically Generated Code\" (by Dong HUANG, Yuhao QING, Weiyi Shang, Heming Cui, Jie M. Zhang) has been accepted by NeurIPS 2024 Datasets and Benchmarks track. 26th Sep 2024, our paper \"SOAP: Enhancing Efficiency of Generated Code via Self-Optimization\" (by Dong HUANG, Jianbo Dai, Han Weng, Puzhen Wu, Yuhao QING, Heming Cui, Zhijiang Guo, Jie M. Zhang) has been accepted by NeurIPS 2024 as a main track poster.23rd August 2024, our paper \"An Empirical Study of the Non-determinism of ChatGPT in Code Generation\" (by Shuyin Ouyang, Jie M. Zhang, Mark Harman, Meng Wang) has been accepted by ACM TOSEM.15th April 2024, our paper \"MirrorFair: Fixing Fairness Bugs in Machine Learning Software via Counterfactual Predictions\" (by Ying Xiao, Jie M. Zhang, Yepang Liu, Mohammad Reza Mousavi, Sicen Liu, Dingyuan Xue) has been accepted by FSE 2024.15th April 2024, our paper \"Fairness Testing of Machine Translation Systems\" (by Zeyu Sun, Zhenpeng Chen, Jie M. Zhang, Dan Hao) has been accepted by TOSEM.28th March 2024, I got the Royal Society International Exchange Grant to support my research collaboration with Prof. Yepang Liu from SUSTech China. 23rd Jan 2024, our paper titled \"Stealthy Backdoor Attack for Code Models\" (by Zhou Yang, Bowen Xu, Jie M. Zhang, Jin Hong, Jieke Shi, Junda He, David Lo) has been accepted by IEEE Transactions on Software Engineering.Research ExperienceResearch Fellow | March, 2019 – May, 2022 | CREST, UCL, UK | Supervisor : Prof. Mark Harman and Prof. Federica SarroResearch Associate | February, 2018 – December, 2018 | CREST, UCL, UK | Supervisor : Prof. Mark Harman and Prof. Earl BarrPHD student | Sep, 2015 – June, 2018 | GOSTA, Peking University, China | Supervisor : Prof. Lu Zhang and Prof. Dan HaoIntern | June,2017-December, 2017 | Software Analysis group, Microsoft Research Asia, China | Mentor: Shi HanVisiting student | Sep, 2016–Dec, 2016 | CREST, University College London, UK | Supervisor : Mark HarmanHonors and Awards2018 Outstanding PHD Graduate Award, Peking University2017 Top-ten Research Excellence Award, EECS, Peking University2016 Fellowship at Microsoft Research Asia2016 Lee Wai Wing Scholarship at Peking University2015 National Scholarship2015 Award for Scientific Research2014 Learning Scholarship at Peking University2014 Award for Scientific Research2014 Innovation Award at Peking University2013 Learning Excellence Award at Peking UniversityGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 7150,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:29"
}