{
  "name": "Jie Li 0002",
  "homepage": "https://www.cs.sjtu.edu.cn/~lijie",
  "status": "success",
  "content": "Dr. Jie Li Dr. Jie Li Chair Professor School of Computer Science Director, Intelligent Big Data System (iBDSys) Lab. Director, SJTU Blockchain Research Centre Shanghai Jiao Tong University (SJTU) Chief Scientist, Shanghai Key Lab. of Trusted Data Circulation and Governance and Web3 (2024 --) Member of the Blockchain Expert Committee of Shanghai Member of the advisory board of Shanghai Frontiers Science Center for Artificial Intelligence and Deep Learning, NYU Shanghai - New York University (2024 --) IEEE Fellow, AAIA Fellow, Foreign Fellow of Engineering Academy of Japan (EAJ) Corresponding Member of NAAI Chinese version here Dr. Jie Li is a Chair Professor in School of Computer Science, Director of Intelligent Big Data System (iBDSys) Lab., Director of SJTU Blockchain Research Centre, Adjunct Professor of Zhiyuan College with Zhiyuan Honors Program and SJTU Paris Elite Institute of Technology (SPEIT), Shanghai Jiao Tong University (SJTU), Shanghai, China. He serves as the Chief Scientist, Shanghai Key Lab. of Trusted Data Circulation and Governance and Web3. He is a member of the Blockchain Expert Committee of Shanghai, an IEEE Fellow, AAIA Fellow, Foreign Fellow of the Engineering Academy of Japan (EAJ), and Corresponding Member of NAAI. He is on the advisory board of Shanghai Frontiers Science Center for Artificial Intelligence and Deep Learning, NYU Shanghai - New York University. He was a full Professor in Department of Computer Science, University of Tsukuba, Japan. He was a visiting Professor in Yale University, USA, Inria Sophia Antipolis and Inria Grenoble-Rhone-Aples, France, during the sabbatical year in September 2014 through August 2015. He has been a visiting Professor/Adjunct Professor of The Chinese University of Hong Kong (CUHK), The Hong Kong Polytechnical University (PolyU), City University of Hong Kong, Tsinghua University, and University of Science and Technology of China (USTC). His current research interests are in Big Data, AI, Blockchain, network systems and security, and smart city. His research has been continuously supported by many national and industrial research grants. He is a Fellow of IEEE, a senior member of ACM, and a member of CCF and IPSJ. He is the founding chair of the IEEE ComSoc Technical Committee on Big Data (TCBD) and the co-chair of IEEE Big Data Community. He has served as an editor and a guest editor for many international journals such as IEEE TBD, IEEE JSAC, IEEE IoTJ, IEEE TVT, IEEE TCC, IEEE TNSE, and IEEE Network, etc. He had served as a secretary for Study Group on System Evaluation of IPSJ and on Steering Committees of the SIG of System EVAluation (EVA) of IPSJ, the SIG of DataBase System (DBS) of IPSJ, and the SIG of MoBiLe computing and ubiquitous communications of IPSJ. He has also served on the program committees for several international professional conferences. Dr. Jie Li welcomes motivated undergraduate students, graduate students, and postdocs to join the iBDSys Lab! Research/Educational Interests Big Data and AI Blockchain and Private Preserving Computing Network System and Security Smart City Professional Activities/Services Publications Awards/Honors Contact Information Dr. Jie Li School of Computer Science Shanghai Jiao Tong University 800 Dongchuan RD. Minhang District, Shanghai, China Email: lijiecs@sjtu.edu.cn",
  "content_length": 3340,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:26"
}