{
  "name": "Jiebo Luo 0001",
  "homepage": "http://www.cs.rochester.edu/u/jluo",
  "status": "success",
  "content": "Jiebo Luo's Home Page Professor Jiebo Luo Albert Arendt Hopeman Professor Department of Computer Science 3101 Wegmans Hall University of Rochester Rochester, NY 14627 Email: username -at- domain.edu where username = jluo, domain = cs.rochester.edu Phone: 585-276-5784 Prospective Students Computer Vision Urban Computing Health/Wellness Analytics Image Retrieval Image Segmentation Scene Classification Big Data Contextual Inference Machine Learning  Vision+Language Random Field Photo Collection Multimedia Video Analytics Human-Centered Media & Interaction Mobile Media Location-based service Geo Tagging Action Recognition Heterogeneous Information Networks Social Multimedia  Data Mining Crowdsourcing 360D User Profiling News 2025 09/03/2025: An Interview with Prof. Luo by the IEEE Computer Society, entitled \"Curiosity Drives Broad Innovation and Real-world Solutions\" 08/22/2025: \"Text-to-Video AI Blossoms with New Metamorphic Video Capabilities\" is a recorded segment by The Academic Minute. Hosted by Dr. Lynn Pasquerella, President of The American Association of Colleges and Universities, The Academic Minute features a different professor each day, drawing experts from top international research institutions. The module is syndicated to several stations throughout North America and streamed via the web internationally. 05/07/2025: Congrats to newly minted Dr. Hang Hua who is joining MIT-IBM Watson AI Lab 04/02/2025: Congrats to newly minted Dr. Jie An who is joining Meta Reality Labs 03/31/2025: Prof. Luo attends the induction ceremony of Fellow of AIMBE (American Institute for Medical and Biological Engineering) 2024 12/31/2024: Prof. Luo is selected as a recipient of the 2025 Edward J. McCluskey Technical Achievement Award by the IEEE Computer Society 11/04/2024: Prof. Luo is elected to Fellow of AIMBE (American Institute for Medical and Biological Engineering) 10/30/2024: Prof. Luo is a Keynote Speaker at the 2024 ACM Multimedia Conference 10/16/2024: Prof. Luo wins the inaugural Debra Haring Excellence in Research Award, which recognizes \"a faculty member who has done research that has had a transformational impact on the field, or who has accumulated a body of research that has changed the field in positive ways.\" 10/10/2024: Some members of VIStA watched the magnificent aurora together off Webster Pier in Rochester, NY 09/12/2024: Prof. Luo is an invited speaker at the Global AI Summit (GAIN) 08/29/2024: Congratulations to Hanjia Lyu for being awarded the 2024 Google PhD Fellowship 08/27/2024: IEEE CS releases an interview with Prof. Luo at CVPR 2024 on industry vs. academic careers, why publishing, why attending conferences, how to choose research topics, and so on. 08/07/2024: Our study that shows the tech community is split over AI is covered by Futurity, Quantum Zeitgeist, and CODU Compute. 05/18/2024: Our study on the factors contributing to crowdfunding success is featured in the Wall Street Journal 05/15/2024: Prof. Luo receives another major award - the 2024 Edmund A. Hajim Outstanding Faculty Award 04/08/2024: (Day of Total Solar Eclipse): Prof. Luo receives the 2024 William H. Riker University Award for Excellence in Graduate Teaching, which recognizes a faculty member who has excelled in graduate instruction, particularly in the University's doctoral programs. 03/28/2024: Congratulations to Alexander Martin for winning the 2024 Charles L. Newton Prize (awarded to senior engineering students who show a special proficiency in an engineering subject and have conducted research, given a presentation, or published a paper) 01/15/2024: Congratulations to Alexander Martin for an Honorable Mention in the 2023-2024 Computing Research Association's Outstanding Undergraduate Researcher Award Competition 01/04/2024: We release a joint survey of Video Understanding with Large Language Models 2023 12/12/2023: We release a joint survey of Large Language Models in Medicine: Principles, Applications, and Challenges 11/15/2023: We release an evaluation report on GPT-4V(ision) as A Social Media Analysis Engine 10/25/2023: Professor Luo serves as General Co-Chair of IEEE ICME 2024 (Call for Papers) in Niagara Falls 09/18/2023: News 10 NBC WHEC-TV Rochester features our NIH and NSF funded project SMARTeeth in their In-Depth Investigative program entitled \"Bringing the dentist to you: UR developing app to identify tooth decay in children\"; also reported by News 8 WROC-TV in their Rochester First program entitled \"Eastman Institute using AI creates app for early tooth decay detection\" 09/13/2023: We receive the Adobe 2023 Data Science Research Award to support our data science research 07/13/2023: In our new studies (ICWSM 2024, ICWSMW 2023), we uncover media bias in 1.8 million headlines across the political spectrum. Our findings suggest that media bias is growing. The work is covered by StudyFinds, and shared by ScienceBlog, RealClearScience, Nation, Mirage.News, Phys.org, and the American Association for the Advancement of Science (AAAS) via EurekAlert! 07/10/2023: Congratulations to Patrick Jingyuan Chen (a rising junior) for winning the Best Student Paper Award at the 2023 IEEE International Conference on Digital Health (ICDH) for the work on \"sDREAMER: Self-distilled Hierarchical Mixture of Modality Experts Transformer are Efficient Mice Sleep Learners\" 06/17/2023: Professor Luo receives the 2023 Contribution Award from Health Data Science (a Science partner journal) \"in recognition of contributions to Health Data Science\" 05/22/2023: Congrats to newly minted Dr. Wei Zhu who has joined Amazon Research 05/19/2023: Congrats to newly minted Dr. Haitian Zheng who is joining Adobe Research 05/12/2023: Congratulations to Peirong Hao for receiving the CS Department Best Senior Award 05/12/2023: Congratulations to Yufei Zhao for receiving the CS Excellence in Undergraduate Research Award and Donald M. Barnard Prize (awarded to engineering students on the basis of personal qualification and achievement) 03/09/2023: Congratulations to Hanjia Lyu for being awarded the 2023 Arts, Sciences and Engineering Donald M. and Janet C. Barnard Fellowship 2022 12/08/2022: Professor Luo is elected to Fellow of NAI (National Academy of Inventors) for \"have demonstrated a highly prolific spirit of innovation in creating or facilitating outstanding inventions that have made a tangible impact on the quality of life, economic development, and welfare of society\" 10/10/2022: Congrats to Zhengyuan Yang, who graduated in 2021 from URCS and is now a Senior Researcher with Microsoft Research, for winning the 2022 ACM SIGMM Award for Outstanding PhD Thesis for his PhD thesis entitled \"Visual Grounding: Building Cross-Modal Visual-Text Alignment\" 09/01/2022: Professor Luo is recognized as the Albert Arendt Hopeman Professor of Engineering 08/01/2022: Professor Luo's group joins the Data Score of the NIH U19 project on Neural Circuit Control of Fluid and Solute Clearance During Sleep (by UR, MIT, and UPenn under the NIH Brain Initiative) 06/17/2022: Professor Luo is elected to a Member of Academia Europaea, a pan-European academy of humanities, law, and science based on sustained academic excellence in his field, as well as significant Europe-wide activities 06/14/2022: Congrats to newly minted Dr. Wei Xiong who is joining Adobe Photoshop 06/09/2022: Congrats to newly minted Dr. Weijian Li who is joining Amazon Go 03/25/2022: Our study on the scale and scope of the influence of misinformation and fact-based news about COVID-19 vaccines on social media platforms on the vaccine uptake is covered by multiple news outlets including Medical Economics, News Medical, News Wise, UK Today News, and Medical Xpress 02/01/2022: Application is open for NSF Summer REU on Imaging in Medicine and Biology for Underrepresented Minorities at University of Rochester 2021 10/22/2021: Professor Luo receives the 2021 ACM SIGMM Award for Outstanding Technical Contributions to Multimedia Computing, Communications and Applications for his \"outstanding, pioneering and continued research contributions in the areas of multimedia content analysis and social media analytics and for outstanding and continued service to the multimedia community\" 09/21/2021: Professor Luo reaches a milestone of 100 in his h-index according to Google Scholar 07/08/2021: Professor Luo delivers a keynote on \"Vision and Language: The Past, Present and Future\" at the 2021 IEEE International Conference on Multimedia and Expo (ICME). The slides are available in slideshare.net. 06/25/2021: Congrats to newly minted Dr. Tianlang Chen who has joined Amazon 06/07/2021: Congrats to newly minted Dr. Zhengyuan Yang who has joined Microsoft Research 05/26/2021: Congratulations to Songyang Zhang for winning the NAACL Best Long Paper Award at the 2021 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL) for the work on \"Video-aided Unsupervised Grammar Induction\" 05/19/2021: In a new study, we dissect the public responses to the #StopAsianHate movement using large scale Twitter data and provide findings that can help design better ways of reducing tension and misunderstandings between ethnic groups. The work is also covered by Rochester Beacon and Futurity. 01/29/2021: U.S. Senate Majority Leader Charles E. Schumer and U.S. Senator Kirsten Gillibrand today announced federal funding to support the research and development of oral disease detection and intervention technology at the University of Rochester 2020 12/15/2020: Congratulations to Yipeng Zhang, who is selected for Honorable Mention for the Computing Research Association's (CRA) Outstanding Undergraduate Researcher Award for 2021 12/12/2020: The latest CS Rankings data show that in the area of Computer Vision, Rochester ranks 8th in the United States for the year of 2020 11/27/2020: Data Skeptic, a popular data science podcast reaching 30k+ listeners nationwide per week, airs a full episode on our recent w",
  "content_length": 181088,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:34"
}