{
  "name": "Jieming Shi 0001",
  "homepage": "https://www4.comp.polyu.edu.hk/~jiemshi",
  "status": "success",
  "content": "Jieming Shi Dr. Jieming SHI Assistant Professor Department of Computing The Hong Kong Polytechnic University I am looking for highly self-motivated PhD students, PostDocs, and research assistants. If you are interested, please send me your CV. Thanks! (All CVs are carefully evaluated. Only matched candidates will be responded.) Research Interests Data Management and Mining, with a focus on - Large-scale graph processing, e.g., algorithms on complex types of graphs, and - Efficient multi-dimensional data management, e.g., spatial, tabular, vector data. Email: Short Bio I am an assistant professor in the Department of Computing at The Hong Kong Polytechnic University (PolyU). I earned my PhD in Computer Science from The University of Hong Kong (HKU) and completed a postdoctoral fellowship at the School of Computing at the National University of Singapore (NUS). I received my bachelor’s degree from Nanjing University. Selected Honors 2022 ACM SIGMOD Research Highlight Award Best Research Paper Award in VLDB 2021 Selected Publications (Full list, Google scholar, DBLP) [ # Corresponding Author, * Co-first] Retrieve-and-Verify: A Table Context Selection Framework for Accurate Column Annotations Zhihao Ding, Yongkang Sun, Jieming Shi#. SIGMOD 2026, in the Proceedings of the ACM Conference on Management of Data, 2026. Effective and Efficient Attributed Hypergraph Embedding on Nodes and Hyperedges Yiran Li, Gongyao Guo, Chen Feng, Jieming Shi#. PVLDB 2025, in the Proceedings of the VLDB Endowment, 2025. SteerConf: Steering LLMs for Confidence Elicitation Ziang Zhou, Tianyuan Jin, Jieming Shi#, Qing Li. NeurIPS 2025, in the Proceedings of the Advances in Neural Information Processing Systems, 2025. TINED: GNNs-to-MLPs by Teacher Injection and Dirichlet Energy Distillation Ziang Zhou, Zhihao Ding, Jieming Shi#, Qing Li, Shiqi Shen. ICML 2025, in the International Conference on Machine Learning, 2025. Efficient Integration of Multi-View Attributed Graphs for Clustering and Embedding Yiran Li, Gongyao Guo, Jieming Shi#, Sibo Wang, Qing Li. ICDE 2025, in the IEEE International Conference on Data Engineering, 2025. Efficient Methods for Accurate Sparse Trajectory Recovery and Map Matching Wei Tian, Jieming Shi#, Man Lung Yiu. ICDE 2025, in the IEEE International Conference on Data Engineering, 2025. Efficient Dynamic Indexing for Range Filtered Approximate Nearest Neighbor Search Fangyuan Zhang, Mengxu Jiang, Guanhao Hou, Jieming Shi, Hua Fan, Wenchao Zhou, Feifei Li, Sibo Wang SIGMOD 2025, in the Proceedings of the ACM Conference on Management of Data, 2025. DIGRA: A Dynamic Graph Indexing for Approximate Nearest Neighbor Search with Range Filter Mengxu Jiang, Zhi Yang, Fangyuan Zhang, Guanhao Hou, Jieming Shi, Wenchao Zhou, Feifei Li, Sibo Wang SIGMOD 2025, in the Proceedings of the ACM Conference on Management of Data, 2025. GraSP: Simple yet Effective Graph Similarity Predictions [Paper] Haoran Zheng, Jieming Shi, Renchi Yang AAAI 2025, in the Proceedings of the AAAI Conference on Artificial Intelligence, 2025. RingFormer: A Ring-Enhanced Graph Transformer for Organic Solar Cell Property Prediction (Oral)[Paper] Zhihao Ding, Ting Zhang, Yiran Li, Jieming Shi, Chen Jason Zhang AAAI 2025, in the Proceedings of the AAAI Conference on Artificial Intelligence, 2025. A Versatile Framework for Attributed Network Clustering via K-Nearest Neighbor Augmentation [Paper] Yiran Li, Gongyao Guo, Jieming Shi#, Renchi Yang, Shiqi Shen, Qing Li, Jun Luo. VLDBJ 2024, in the VLDB Journal, 2024. SGOOD: Substructure-enhanced Graph-Level Out-of-Distribution Detection [Paper] Zhihao Ding, Jieming Shi#, Shiqi Shen, Xuequn Shang, Jiannong Cao, Zhipeng Wang, Zhi Gong. CIKM 2024, in the Proceedings of the ACM International Conference on Information and Knowledge Management, 2024. Effective Illicit Account Detection on Large Cryptocurrency MultiGraphs [Paper] Zhihao Ding, Jieming Shi#, Qing Li and Jiannong Cao. CIKM 2024, in the Proceedings of the ACM International Conference on Information and Knowledge Management, 2024. Effective Clustering on Large Attributed Bipartite Graphs [Paper] Renchi Yang, Yidu Wu, Xiaoyang Lin, Qichen Wang, Tsz Nam Chan, Jieming Shi. KDD 2024, in the Proceedings of the ACM SIGKDD international conference on Knowledge discovery and data mining, 2024. Efficient High-Quality Clustering for Large Bipartite Graphs [Paper] Renchi Yang, Jieming Shi#. SIGMOD 2024, in the Proceedings of the ACM Conference on Management of Data, 2024. Minimum Strongly Connected Subgraph Collection in Dynamic Graphs [Paper] Xin Chen, Jieming Shi#, You Peng, Wenqing Lin, Sibo Wang, Wenjie Zhang. PVLDB 2024, in the Proceedings of the VLDB Endowment, 2024. BOURNE: Bootstrapped Self-supervised Learning Framework for Unified Graph Anomaly Detection [Paper] Jie Liu, Mengting He, Xuequn Shang, Jieming Shi, Bin Cui, Hongzhi Yin ICDE 2024, in the Proceedings of the IEEE International Conference on Data Engineering, 2024. Effective and Efficient Route Planning Using Historical Trajectories on Road Networks [Paper] [Code] Wei Tian, Jieming Shi, Siqiang Luo, Hui Li, Xike Xie, Yuanhang Zou. PVLDB 2023, in the Proceedings of the VLDB Endowment, 2023. EmbedX: A Versatile, Efficient and Scalable Platform to Embed Both Graphs and High-Dimensional Sparse Data [Paper] [Code] Yuanhang Zou*, Zhihao Ding*, Jieming Shi, Shuting Guo, Chunchen Su, Yafei Zhang. PVLDB 2023, in the Proceedings of the VLDB Endowment, 2023. SlotGAT: Slot-based Message Passing for Heterogeneous Graphs (Heterogeneous Graph Neural Networks). [Paper] [Code] Ziang Zhou, Jieming Shi, Renchi Yang, Yuanhang Zou, Qing Li ICML 2023, International Conference on Machine Learning, 2023. Efficient and Effective Attributed Hypergraph Clustering via K-Nearest Neighbor Augmentation. [Paper] [Code] Yiran Li, Renchi Yang, Jieming Shi SIGMOD 2023, in the Proceedings of the ACM Conference on Management of Data, 2023. PANE: Scalable and Effective Attributed Network Embedding. [Paper] [Code] Renchi Yang, Jieming Shi, Xiaokui Xiao, Yin Yang, Sourav S. Bhowmick, Juncheng Liu VLDB Journal, 2023. Effective Stabilized Self-Training on Few-Labeled Graph Data. [Paper] Ziang Zhou, Jieming Shi, Shengzhong Zhang, Zengfeng Huang, Qing Li Information Sciences (JCR Q1), 2023. No PANE, No Gain: Scaling Attributed Network Embedding in a Single Server. (2022 ACM SIGMOD Research Highlight Award) [Paper] Renchi Yang, Jieming Shi, Xiaokui Xiao, Yin Yang, Sourav S Bhowmick, Juncheng Liu ACM SIGMOD Record, 2022. Scalable and Effective Bipartite Network Embedding. [Paper] Renchi Yang, Jieming Shi, Keke Huang, Xiaokui Xiao SIGMOD 2022, in the Proceedings of the ACM Conference on Management of Data, 2022. Effective and Scalable Clustering on Massive Attributed Graphs. [Paper] Renchi Yang, Jieming Shi#, Yin Yang, Keke Huang, Shiqi Zhang and Xiaokui Xiao TheWebConf (WWW) 2021, in the Proceedings of The Web Conference, 2021. Scaling Attributed Network Embedding to Massive Graphs. (Best Research Paper Award in VLDB 2021) [Paper] Renchi Yang, Jieming Shi, Xiaokui Xiao, Yin Yang, Juncheng Liu, Sourav S Bhowmick. PVLDB 2020, in the Proceedings of the VLDB Endowment, 2020. Realtime Index-Free Single Source SimRank Processing on Web-Scale Graphs. Jieming Shi*, Tianyuan Jin*, Renchi Yang, Xiaokui Xiao, Yin Yang. [Code] PVLDB 2020, in the Proceedings of the VLDB Endowment, 2020. Realtime Top-k Personalized PageRank over Large Graphs on GPUs. [Technical Report] Jieming Shi, Renchi Yang, Tianyuan Jin, Xiaokui Xiao, Yin Yang. [Code] PVLDB 2020, in the Proceedings of the VLDB Endowment, 2020. Teaching COMP5434, Big Data Computing, 2021/22, 2022/23, 2023/24, 2024/25, 2025/26 COMP2013, Data Structures and Algorithms, 2023/24, 2024/25 COMP6434, Big Data Analytics and Artificial Intelligence, 2020/21, 2022/2023 COMP3131, Business and Information Systems Strategies, Fall 2020 Professional Service I serve as: Workshop Chair of PAKDD 2026 Area Chair for KDD 2025 Datasets and Benchmarks Track Production Chair of The Data Engineering Bulletin I am/was a program committee member for the following conferences: Proceedings of the VLDB Endowment (VLDB), 2022, 2023, 2024, 2025, 2026 ACM SIGKDDD Conference on Knowledge Discovery and Data Mining (KDD), 2022, 2023, 2024, 2025, 2026 IEEE International Conference on Data Engineering (ICDE), 2022 (research and demo tracks), 2024, 2025, 2026 International Conference on Machine Learning (ICML), 2024 The Web Conference (WWW), 2022 The Thirty-Fifth AAAI Conference on Artificial Intelligence (AAAI), 2021, 2022 International Joint Conference on Artificial Intelligence (IJCAI), 2020, 2021, 2022, 2023, 2024 ACM International Conference on Information and Knowledge Management (CIKM), 2019, 2021, 2022, 2023 The Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD), 2020, 2021, 2022 The International Symposium on Spatial and Temporal Databases (SSTD), 2021 (Session Chair) I am/was invited reviewers for the following journals: IEEE Transactions on Knowledge and Data Engineering (TKDE) The International Journal of Very Large Data Bases (VLDBJ) World Wide Web: Internet and Web Information Systems (WWWJ) IEEE Transactions on Big Data (TBD) Information Sciences Acknowledgement Our research is supported generously by The Hong Kong Polytechnic University, NSFC, Hong Kong RGC, Tencent Technology Limited, etc.",
  "content_length": 9371,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:30"
}