{
  "name": "Jieru Zhao",
  "homepage": "https://zjru.github.io",
  "status": "success",
  "content": "Jieru Zhao's Homepage Jieru Zhao (赵杰茹) 上海交通大学计算机学院 副教授 博士生导师 Tenure-track Associate Professor, Ph.D. Advisor Emerging Parallel Computing Center (EPCC) School of Computer Science Shanghai Jiao Tong University Email: zhao-jieru@sjtu.edu.cn Office: SEIEE Building 3-529 Short Bio Jieru Zhao is currently a tenure-track associate professor at School of Computer Science, Shanghai Jiao Tong University (SJTU). Before joining SJTU, she received the Ph.D. degree in Electronic and Computer Engineering from the Hong Kong University of Science and Technology in 2020, supervised by Prof. Wei Zhang , and the B.S. degree from Nanjing Univerity in 2015. She worked as a research scientist intern at DAMO academy (Aug-Nov 2020). Her research interests lie in the area of computer systems, specifically focusing on automatic design tools, hardware-software co-design and efficient AI systems. She has received two best paper awards (ICCAD'17, HPCA'24) and five best paper nominations (ICCD'24, ISCA'24, DATE'22, SC'21, CASES'18) in top conferences. Openings I am looking for self-motivated PhD, Master and Undergraduate students. Please send me an email with your CV if you are interested in compiler optimization, HW-SW co-design, AI system and architecture, and machine learning for design automation. 课题组招收博士生、硕士生和对科研感兴趣的本科生，目前有如下多个科研课题：1. 大模型KV cache压缩与加速；2. 多模态模型推理加速；3. AI编译、系统、架构优化；4. AI for EDA。感兴趣的同学欢迎发邮件与我们交流。 Teaching The Principles of Compilers, 2021-2022 Spring, 2022-2023 Spring, 2023-2024 Spring, 2024-2025 Spring. Advanced Computer Architecture, 2023-2024 Autumn, 2024-2025 Autumn, 2025-2026 Autumn. Principles and Practice of Problem Solving (in English), 2021-2022 Autumn, 2022-2023 Autumn. Professional Services Track Chair for ICCD 2025 Program Committee for DAC 2022/2023/2024, ICCAD 2023/2024/2025, FPT 2021/2022/2025 Co-chair for Ph.D. Forum at FPT 2022 Co-chair for SIGDA Student Research Forum at ASP-DAC 2022, 2023 (SRF@ASP-DAC 2022, 2023) Judge for EDAthon 2019 contest [link] and EDAthon 2018 contest [link]. Reviewer for top conferences in the areas of EDA and FPGA, including DAC, ICCAD, DATE, ICCD, FPGA, FCCM, FPL, etc. Reviewer for top journals including TCAD, TVLSI, TRETS, TODAES, Integration VLSI, etc. Honors and Awards ICCD Best Paper Nomination in 2024 (3 out of 276 submissions) ISCA Best Paper Nomination in 2024 HPCA Distinguished Artifact Award in 2024 (2 out of 75 accepted papers and 410 submissions) Shanghai Overseas High-level Talent in 2022 DATE Best Paper Nomination in 2022 Shanghai Pujiang Talent in 2021 SC Best Reproducibility Advancement Award Finalist in 2021 HKUST SENG Academic Award for 2018-2019 (School of Engineering, Top Research Post-Graduate (Rpg) Award) ESWEEK CASES Best Paper Nomination in 2018 (9 out of 270 submissions) William J. McCalla ICCAD Best Paper Award in 2017 (2 out of 399 submissions) [HKUST-ECE News] Postgraduate Studentship for 2019-2020 (HKUST) Hong Kong Ph.D. Fellowship from 2015 to 2019 (Top 3% among more than 4000 applications) Outstanding Graduate of Nanjing University in 2015 Canadian Globalink Research Internship Award in 2014 National Scholarship (Top 2%) in 2013 Outstanding Student of Nanjing University (Top 5%) in 2012, 2013 Research Group Graduate Students Weichuang Zhang (Ph.D. 2021) Guangda Liu (Ph.D. 2022) Kunyun Wang (Ph.D. 2024) Chi Zhang (Ph.D. 2024), co-supervised Yiquan Wang (Ph.D. 2025) Chenqi Zhang (M.S. 2023) Yufei Shangguan (M.S. 2023) Zhenyu Ning (M.S. 2024) Chengwei Li (M.S. 2024) Keyu Liu (M.S. 2025) Xinzhou Zhang (M.S. 2025) Alumni Guan Shen (M.S. 2021-2024), now working in Alibaba Ant Group (ssp offer) Haibo Xu (Ph.D. 2023), co-supervised, now in JKW Beijing Mingzhe Gao (M.S. 2022-2025), now working in ByteDance (sp offer) Pai Zeng (M.S. 2022-2025), now working in Baidu Haoran Jin (Undergraduate, 2019). Placement: Ph.D. in CSE at University of Michigan Kun Su (Undergraduate, 2019). Placement: M.S. in microelectronics at SJTU Publications [DAC 2025] ClusterKV: Manipulating LLM KV Cache in Semantic Space for Recallable Compression Guangda Liu, Chengwei Li, Jieru Zhao*, Chenqi Zhang and Minyi Guo, in the 62nd IEEE/ACM Design Automation Conference, 2025. [DAC 2025] StreamingGS: Voxel-Based Streaming 3D Gaussian Splatting with Memory Optimization and Architectural Support Chenqi Zhang, Yu Feng, Jieru Zhao*, Guangda Liu, Wenchao Ding, Chentao Wu and Minyi Guo, in the 62nd IEEE/ACM Design Automation Conference, 2025. [SC 2025] DHAP: Towards Efficient OLAP in a Disaggregated and Heterogeneous Environment Guangda Liu, Chenqi Zhang, Yizhou Shan, Hao Feng, Zeke Wang, Shixuan Sun, Minyi Guo, Jieru Zhao*, in the International Conference for High Performance Computing, Networking, Storage, and Analysis, 2025. [ICCAD 2025] HIPPO: A Hierarchy-Preserving and Noise-Tolerant Pre-HLS Power Modeling Framework for FPGA Zefan Lin, Zedong Peng, Mingzhe Gao, Jieru Zhao*, Zhe Lin, in the 44th IEEE/ACM International Conference on Computer-Aided Design, 2025. [ASPLOS 2025] StreamGrid: Streaming Point Cloud Analytics via Compulsory Splitting and Deterministic Termination Yu Feng, Zheng Liu, Weikai Lin, Zihan Liu, Jingwen Leng, Minyi Guo, Zhezhi He, Jieru Zhao and Yuhao Zhu, in the 30th ACM International Conference on Architectural Support for Programming Languages and Operating Systems, 2025. [HPCA 2025] RpcNIC: Enabling Efficient Datacenter RPC Offloading on PCIe-attached SmartNICs Jie Zhang, Hongjing Huang, Xuzheng Chen, Xiang Li, Jieru Zhao, Ming Liu, Zeke Wang, in IEEE International Symposium on High-Performance Computer Architecture, 2025. [ICCD 2024] AutoVCoder: A Systematic Framework for Automated Verilog Code Generation using LLMs Mingzhe Gao, Jieru Zhao*, Zhe Lin, Wenchao Ding, Xiaofeng Hou, Yu Feng, Chao Li, Minyi Guo, in the 42nd IEEE International Conference on Computer Design, 2024. Best Paper Nomination [ECCV 2024] O2V-Mapping: Online Open-Vocabulary Mapping with Neural Implicit Representation Muer Tie, Julong Wei, Zhengjun Wang, Ke Wu, Shansuai Yuan, Kaizhao Zhang, Jie Jia, Jieru Zhao, Zhongxue Gan, Wenchao Ding, in the European Conference on Computer Vision (ECCV) , 2024. [Preprint 2024] The CAP Principle for LLM Serving Pai Zeng, Zhenyu Ning, Jieru Zhao, Weihao Cui, Mengwei Xu, Liwei Guo, Xusheng Chen, Yizhou Shan, Arxiv Preprint, 2024. [TCAD 2024] Automatic Mapping of Heterogeneous DNN Models on Adaptive Multi-Accelerator Systems Jieru Zhao*, Guan Shen, Wenchao Ding, Quan Chen, Minyi Guo, in IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 2024. [ISCA 2024] A Tale of Two Domains: Exploring Efficient Architecture Design for Truly Autonomous Things Xiaofeng Hou, Tongqiao Xu, Chao Li, Cheng Xu, Jiacheng Liu, Yang Hu, Jieru Zhao, Jingwen Leng, Kwang-Ting Cheng, Minyi Guo, in the 51st Annual International Symposium on Computer Architecture, 2024. Best Paper Nomination [TRETS 2024] FADO: Floorplan-Aware Directive Optimization Based on Synthesis and Analytical Models for High-Level Synthesis Designs on Multi-Die FPGAs Linfeng Du, Tingyuan Liang, Xiaofeng Zhou, Jinming Ge, Shangkun Li, Sharad Sinha, Jieru Zhao, Zhiyao Xie, Wei Zhang, in ACM Transactions on Reconfigurable Technology and Systems, 2024. [HPCA 2024] An Optimizing Framework on MLIR for Efficient FPGA-based Accelerator Generation Weichuang Zhang, Jieru Zhao*, Guan Shen, Quan Chen, Chen Chen, Minyi Guo, in the 30th IEEE International Symposium on High-Performance Computer Architecture, 2024. Distinguished Artifact Award [TCAD 2024] Hardware-Software Co-Design Enabling Static and Dynamic Sparse Attention Mechanisms Jieru Zhao*, Pai Zeng, Guan Shen, Quan Chen, Minyi Guo, in IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems , 2024. [ASPLOS 2024] DataFlower: Exploiting the Data-flow Paradigm for Serverless Workflows Zijun Li, Chuhao Xu, Quan Chen, Jieru Zhao, Chen Chen, Minyi Guo, in ACM Conference on Architectural Support for Programming Languages and Operating Systems , 2024. [AAAI 2024] Swift-Mapping: Online Neural Implicit Dense Mapping in Urban Scenes Ke Wu, Kaizhao Zhang, Mingzhe Gao, Jieru Zhao, Zhongxue Gan, Wenchao Ding, in AAAI Conference on Artificial Intelligence , 2024. [DATE 2024] Hierarchical Source-to-Post-Route QoR Prediction in High-Level Synthesis with GNNs Mingzhe Gao, Jieru Zhao*, Zhe Lin, Minyi Guo, in Design, Automation and Test in Europe Conference, 2024. [TCAD 2024] AMF-Placer 2.0: Open Source Timing-driven Analytical Mixed-size Placer for Large-scale Heterogeneous FPGA Tingyuan Liang, Gengjie Chen, Jieru Zhao*, Sharad Sinha, Wei Zhang, in IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 2024. [DAC 2023] MARS: Exploiting Multi-Level Parallelism for DNN Workloads on Adaptive Multi-Accelerator Systems Guan Shen, Jieru Zhao*, Zeke Wang, Zhe Lin, Wenchao Ding, Chentao Wu, Quan Chen and Minyi Guo, in the 60th Design Automation Conference, 2023. [DAC 2023] SpMMPlu: A Compiler Plug-in with Sparse IR for Efficient Sparse Matrix Multiplication Tao Yang, Yiyuan Zhou, Qidong Tang, Feng Xu, Hui Ma, Jieru Zhao* and Li Jiang, in the 60th Design Automation Conference, 2023. [TCAD 2023] HL-Pow: Learning-Assisted Pre-RTL Power Modeling and Optimization for FPGA HLS Zhe Lin, Tingyuan Liang, Jieru Zhao, Sharad Sinha, Wei Zhang, in IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 2023. [ICRA 2023] FlowMap: Path Generation for Automated Vehicles in Open Space Using Traffic Flow Wenchao Ding, Jieru Zhao*, Yubin Chu, Haihui Huang, Tong Qin, Chunjing Xu, Yuxiang Guan and Zhongxue Gan, in IEEE International Conference on Robotics and Automation , 2023. [ICS 2023] Preference-Aware Co-location Scheduling on Heterogeneous NUMA Architectures To Improve Resource Utilization Pu Pang, Yaoxuan Li, Bo Liu, Quan Chen, Zhou Yu, Zhibin Yu, Deze Zeng, Jingwen Leng, Jieru Zhao and Minyi Guo, in the ACM International Conference on Supercomputing, 2023. [HotOS 2023] Skadi: Building a Distributed Runtime for Data Systems in",
  "content_length": 15181,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:31"
}