{
  "name": "Jieyang Chen",
  "homepage": "https://jieyangchen7.github.io",
  "status": "success",
  "content": "The Homepage of Jieyang Chen Home   | Publications   | Teaching   | Service & Awards   | CV Jieyang Chen Assistant Professor Department of Computer Science University of Oregon Eugene, OR 97403 Email: jieyang AT uoregon DOT edu Biography Jieyang Chen is an assistant professor in the Department of Computer Science at the University of Oregon. He was a Computer Scientist in Computer Science and Mathematics Division at Oak Ridge National Laboratory mentored by Dr. Dave Pugmire and Dr. Scott Klasky. He received a Ph.D. degree in Computer Science from University of California, Riverside advised by Dr. Zizhong Chen in 2019. He had a research internship at Pacific Northwest National Laboratory (PNNL) mentored by Dr. Shuaiwen Song in 2018 and a long-term research internship at Los Alamos National Laboratory (LANL) in the Data Science at Scale (DSS) team mentored by Dr. Qiang Guan and Dr. James Ahrens in 2017. He received a Master degree in Computer Science at University of California, Riverside in 2014. He had an one-year exchange study at The State University of New York at Buffalo in 2011. He received a Bachelor degree in Computer Science from Beijing University of Technology in 2012. Research Interests High performance computing/Cloud computing GPU computing High performance big data analytics Distributed machine learning Selected Publications (Full List) IPDPS'25 Jieyang Chen, Qian Gong, Xin Liang, Qing Liu, Lipeng Wan, Yanliang Li, Norbert Podhorszki, Scott Klasky. HPDR: High-Performance Portable Scientific Data Reduction Framework, The 39th IEEE International Parallel & Distributed Processing Symposium, Milano, Italy. Jun. 2025. PPoPP'25 Yuhang Liang, Xinyi Li, Jie Ren, Ang Li, Bo Fang, Jieyang Chen. ATTNChecker: Highly-Optimized Fault Tolerant Attention for Large Language Model Training, The 30th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming, Las Vegas, NV. Mar. 2025.Acceptance Rate: 20.1% (38/189) PPoPP'23 Jieyang Chen, Xin Liang, Kai Zhao, Hadi Zamani Sabzi, Laxmi Bhuyan, Zizhong Chen. Improving Energy Saving of One-sided Matrix Decompositions on CPU-GPU Heterogeneous Systems, The 28th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming, Montreal, Canada. Feb 2023. Acceptance Rate: 23.7% (31/131) IPDPS'21 Jieyang Chen, Lipeng Wan, Xin Liang, Ben Whitney, Qing Liu, David Pugmire, NicholasThompson, Jong Youl Choi, Matthew Wolf, Todd Munson, Ian Foster, Scott Klasky. Accelerating Multigrid-based Hierarchical Scientific Data Refactoring on GPUs, 35th IEEE International Parallel and Distributed Processing Symposium, Portland, OR. May 2021. ICS'19 Jieyang Chen, Nan Xiong, Xin Liang, Dingwen Tao, Sihuan Li, Kaiming Ouyang, Kai Zhao, Nathan DeBardeleben, Qiang Guan, and Zizhong Chen TSM2: Optimizing Tall-and-Skinny Matrix-Matrix Multiplication on GPUs, Proceedings of the 33rd ACM International Conference on Supercomputing, Phoenix, AZ, USA, June 26 - 28, 2019. Acceptance Rate: 23.3% (45/193) BigData'18 Jieyang Chen, Qiang Guan, Xin Liang, Paul Bryant, Patricia Grubel, Allen McPherson, Li-Ta Lo, Timothy Randles, Zizhong Chen and James Ahrens Build and Execution Environment (BEE): an Encapsulated Environment Enabling HPC Applications Running Everywhere, Proceedings of the 2018 IEEE International Conference on Big Data, Seattle, WA, USA, Dec 10-13, 2018. Acceptance Rate: 18.9% (98/518) SC'18 Jieyang Chen, Hongbo Li, Sihuan Li, Xin Liang, Panruo Wu, Dingwen Tao, Kaiming Ouyang, Yuanlai Liu, Kai Zhao, Qiang Guan, and Zizhong Chen Fault Tolerant One-sided Matrix Decompositions on Heterogeneous Systems with GPUs, Proceedings of the 30th ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis, Dallas, Texas, USA, Nov 11 - 16, 2018. Acceptance Rate: 19.1% (55/288) ICDCS'18 Jieyang Chen, Qiang Guan, Zhao Zhang, Xin Liang, Louis Vernon, Allen Mcpherson, Li-Ta Lo, Zizhong Chen, Patricia Grubel, and James Ahrens BeeFlow : a Workflow Management System for In situ Processing Across HPC and Cloud Systems, Proceedings of the 38th IEEE International Conference on Distributed Computing Systems, Vienna, Austria, July 2-5, 2018. Acceptance Rate: 20.6% (78/378) SC'16 Jieyang Chen*, Li Tan*, Panruo Wu, Dingwen Tao, Hongbo Li, Xin Liang, Sihuan Li, Rong Ge, Laxmi Bhuyan, and Zizhong Chen GreenLA: Green Linear Algebra Software for GPU-Accelerated Heterogeneous Computing, Proceedings of the 28th ACM/IEEE International Conference for High Performance Computing, Networking, Storage and Analysis, Salt Lake City, Utah, USA, Nov 13- 18, 2016. Acceptance Rate: 18.4% (82/446) *Authors contributed equally. IPDPS'16 Jieyang Chen, Xin Liang, and Zizhong Chen Online Algorithm-Based Fault Tolerance for Cholesky Decomposition on Heterogeneous Systems with GPUs, Proceedings of the 30th IEEE International Parallel & Distributed Processing Symposium, Chicago, Illinois, USA, May 23-27, 2016. Acceptance Rate: 22.98% (114/496) Last update: Jan. 08, 2025",
  "content_length": 4998,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:31"
}