{
  "name": "Jifeng Xuan",
  "homepage": "http://jifeng-xuan.com",
  "status": "success",
  "content": "Jifeng Xuan's Homepage Jifeng Xuan, Professor School of Computer ScienceWuhan University, China jxuan (at) whu.edu.cnjifeng.xuan (at) gmail.com Biography Dr. Jifeng Xuan is a professor and a deputy dean at the School of Computer Science, Wuhan University, China. Wuhan University was founded in 1893, which locates in Wuhan, a central city of China. The city of Wuhan has a long history of 3,500 years with a current population of over 10 million people. Here is his official homepage at Wuhan University. He is the founder of CSTAR - Centre of Software Testing, Analysis and Reliability. He was a postdoctoral researcher at SPIRALS Team in INRIA Lille - Nord Europe in France. He has co-worked with Dr. Martin Monperrus and Prof. Lionel Seinturier. He received the bachelor degree and the PhD degree at OSCAR Lab, School of Software, Dalian University of Technology, China. His PhD supervisor is Prof. He Jiang. Before university, he graduated from Harbin No. 3 High School, Harbin, China. He is a member of ACM, IEEE, and CCF (China Computer Federation). His research interest is Software Analysis and Testing, including software testing and debugging, software data analysis, and search based software engineering. The research group is looking for PhD students and master students, who have interests in software engineering. Self-motivated bachelor students are also warmly welcomed. Any interest or question, please contact via emails on the page top. Publications Selected Publications Jifeng Xuan, Matias Martinez, Favio DeMarco, Maxime Clement, Sebastian Lamelas Marcote, Thomas Durieux, Daniel Le Berre, Martin Monperrus. Nopol: Automatic Repair of Conditional Statement Bugs in Java Programs. IEEE Transactions on Software Engineering, vol. 43, no. 1, Jan. 2017, pp. 34-55. [Pdf], [IEEE], [Bibtex] Jifeng Xuan, He Jiang, Yan Hu, Zhilei Ren, Weiqin Zou, Zhongxuan Luo, Xindong Wu. Towards Effective Bug Triage with Software Data Reduction Techniques. IEEE Transactions on Knowledge and Data Engineering, vol. 27, no. 1, Jan. 2015, pp. 264-280. [Pdf], [IEEE], [Bibtex] Jifeng Xuan, He Jiang, Zhilei Ren, Zhongxuan Luo. Solving the Large Scale Next Release Problem with a Backbone Based Multilevel Algorithm. IEEE Transactions on Software Engineering, vol. 38, no. 5, Sept.-Oct. 2012, pp. 1195-1212. [Pdf], [IEEE], [Bibtex] Jifeng Xuan, Martin Monperrus. Test Case Purification for Improving Fault Localization. Proceedings of the 22nd ACM SIGSOFT International Symposium on the Foundations of Software Engineering (FSE 2014), Hong Kong, China. Nov. 16-22, 2014, pp. 52-63. [Pdf], [ACM], [Bibtex] Jifeng Xuan, He Jiang, Zhilei Ren, Weiqin Zou. Developer Prioritization in Bug Repositories. Proceedings of 34th International Conference on Software Engineering (ICSE 2012), Zurich, Switzerland. June 2-9, 2012, pp. 25-35. [Pdf], [IEEE], [Bibtex] Journal Papers Xiaohui Wang, Youshuai Tan, Zishuo Ding, Jinfu Chen, Jifeng Xuan, Weiyi Shang. Enhancing Log Sentiments: An Exploratory Study of Sentiments and Emotions with Software Logs. ACM Transactions on Software Engineering and Methodology, 2025. Hua He, Xiaofan Liu, Lei Xu, Guanghui Mei, Jifeng Xuan. Mergebot: A Platform of Semi-Structured Merge Conflict Resolution for C/C++ Code. SoftwareX, 2025. Xiangping Chen, Xing Hu, Yuan Huang, He Jiang, Weixing Ji, Yanjie Jiang, Yanyan Jiang, Bo Liu, Hui Liu, Xiaochen Li, Xiaoli Lian, Guozhu Meng, Xin Peng, Hailong Sun, Lin Shi, Bo Wang, Chong Wang, Jiayi Wang, Tiantian Wang, Jifeng Xuan, Xin Xia, Yibiao Yang, Yixin Yang, Li Zhang, Yuming Zhou, Lu Zhang. Deep Learning-Based Software Engineering: Progress, Challenges, and Opportunities. Science China Information Sciences, vol. 68, no. 1, 2025, pp. 1-88. Weiqin Zou, Jingxuan Zhang, Xiaowei Zhang, Lin Chen, Jifeng Xuan. A Survey of Research on Bug Report Quality. Journal of Software (Chinese article with English abstract), vol. 34, no. 1, 2023, pp. 171-196. Lei Zhao, Pengcheng Cao, Yue Duan, Heng Yin, Jifeng Xuan. Probabilistic Path Prioritization for Hybrid Fuzzing. IEEE Transactions on Dependable and Secure Computing, vol. 19, no. 3, 2022, pp.1955-1973. [IEEE] Xiaoyuan Xie, Yuhui Su, Songqiang Chen, Lin Chen, Jifeng Xuan, Baowen Xu. MULA: A Just-In-Time Multi-labeling System for Issue Reports. IEEE Transactions on Reliability, vol. 71, no. 1, 2022, pp. 250-263. [IEEE] Yisen Xu, Fan Wu, Xiangyang Jia, Lingbo Li, Jifeng Xuan. Mining the Use of Higher-Order Functions: An Exploratory Study on Scala Programs. Empirical Software Engineering, vol. 25, no. 6, 2020, pp. 4547-4584. [Pdf] Ping Ma, Hangyuan Cheng, Jingxuan Zhang, Jifeng Xuan. Can This Fault Be Detected: A Study on Fault Detection via Automated Test Generation. Journal of Systems and Software, vol. 170, 2020, page 110769. Yisen Xu, Xiangyang Jia, Fan Wu, Lingbo Li, Jifeng Xuan. Automatically Identifying Calling-Prone Higher-Order Functions to Assist Testers. Journal of Computer Science and Technology, vol. 35, no. 6, 2020, pp. 1278-1294. Shuyan Zhang, Zhilei Ren, Cuixia Li, Jifeng Xuan. A perturbation adaptive pursuit strategy based hyper-heuristic for multi-objective optimization problems. Swarm and Evolutionary Computation, vol. 54, 2020. Yongfeng Gu, Ping Ma, Xiangyang Jia, He Jiang, Jifeng Xuan. Progress on Software Crash Research. Scientia Sinica Informationis, 2019, to appear (Chinese article with English abstract). [SciChina] Weiqin Zou, Jifeng Xuan, Xiaoyuan Xie, Zhenyu Chen, Baowen Xu. How does Code Style Inconsistency Affect Pull Request Integration? An Exploratory Study on 117 GitHub Projects. Empirical Software Engineering, to appear. [Pdf], [Springer], [Bibtex] Yongfeng Gu, Jifeng Xuan, Hongyu Zhang, Lanxin Zhang, Qingna Fan, Xiaoyuan Xie, Tieyun Qian. Does the Fault Reside in a Stack Trace? Assisting Crash Localization by Predicting Crashing Fault Residence. Journal of Systems and Software, vol. 148, Feb. 2019, pp. 88-104. [Pdf], [Elsevier], [Bibtex] Jian Zhang, Chao Zhang, Jifeng Xuan, Yingfei Xiong, Qianxiang Wang, Bin Liang, Lian Li, Wensheng Dou, Zhenbang Chen, Liqian Chen, Yan Cai. Recent Progress in Program Analysis. Journal of Software, vol. 30, no. 1, Jan. 2019, pp. 80-109 (Chinese article with English abstract). [Pdf], [JoS], [Bibtex] He Jiang, Xiaochen Li, Zhilei Ren, Jifeng Xuan, Zhi Jin. Towards Better Summarizing Bug Reports with Crowdsourcing Elicited Attributes. IEEE Transactions on Reliability, vol. 68, no. 1, Jan. 2019, pp. 2-22. [Pdf], [Elsevier], [Bibtex] Jiangyi Geng, Shi Ying, Xiangyang Jia, Ting Zhang, Xuan Liu, Lanqing Guo, Jifeng Xuan. Supporting Many-Objective Software Requirements Decision: An Exploratory Study on the Next Release Problem. IEEE Access, vol. 6, Dec. 2018, pp. 60547-60558. [Pdf], [Elsevier], [Bibtex] Jifeng Xuan, Matias Martinez, Favio DeMarco, Maxime Clement, Sebastian Lamelas Marcote, Thomas Durieux, Daniel Le Berre, Martin Monperrus. Nopol: Automatic Repair of Conditional Statement Bugs in Java Programs. IEEE Transactions on Software Engineering, vol. 43, no. 1, Jan. 2017, pp. 34-55. [Pdf], [IEEE], [Bibtex] Zongzheng Chi, Jifeng Xuan, Zhilei Ren, Xiaoyuan Xie, He Guo. Multi-Level Random Walk for Software Test Suite Reduction. IEEE Computational Intelligence Magazine, vol. 11, no. 2, May, 2017, pp. 24-33. [Pdf], [IEEE], [Bibtex] Jifeng Xuan, He Jiang, Hongyu Zhang, Zhilei Ren. Developer Recommendation on Bug Commenting: A Ranking Approach for the Developer Crowd. Science China Information Science, vol. 60, 2017, pp. 072105:1–072105:18. [Pdf], [Springer], [Bibtex] Matias Martinez, Thomas Durieux, Romain Sommerard, Jifeng Xuan, Martin Monperrus. Automatic Repair of Real Bugs in Java: A Large-Scale Experiment on the Defects4J Dataset. Empirical Software Engineering, vol. 22, no. 4, Aug. 2017, pp. 1936-1964. [Pdf], [Springer], [Bibtex] Zhilei Ren, He Jiang, Jifeng Xuan, Shuwei Zhang, Zhongxuan Luo. Feature Based Problem Hardness Understanding for Requirements Engineering. Science China Information Science, vol. 60, no. 3, 2017, pp. 032105:1-032105:20. [Pdf], [Springer], [Bibtex] Jifeng Xuan, Benoit Cornu, Matias Martinez, Benoit Baudry, Lionel Seinturier, Martin Monperrus. B-Refactoring: Automatic Test Code Refactoring to Improve Dynamic Analysis. Information and Software Technology, vol. 76, Aug. 2016, pp. 65-80. [Pdf], [Elsevier] , [Bibtex] Jifeng Xuan, Zhilei Ren, Ziyuan Wang, Xiaoyuan Xie, He Jiang. Progress on Approaches to Automatic Program Repair. Journal of Software, vol. 27, no. 4, Apr. 2016, pp. 771-784 (Chinese article with English abstract). [Pdf], [Press], [Bibtex] Jifeng Xuan, He Jiang, Yan Hu, Zhilei Ren, Weiqin Zou, Zhongxuan Luo, Xindong Wu. Towards Effective Bug Triage with Software Data Reduction Techniques. IEEE Transactions on Knowledge and Data Engineering, vol. 27, no. 1, Jan. 2015, pp. 264-280. [Pdf], [IEEE], [Bibtex] He Jiang, Jifeng Xuan, Zhilei Ren, Youxi Wu, Xindong Wu. Misleading Classification. Science China Information Science, Jan 2014, pp. 1-17. [Pdf], [Springer], [Bibtex] Jifeng Xuan, He Jiang, Zhilei Ren, Zhongxuan Luo. Solving the Large Scale Next Release Problem with a Backbone Based Multilevel Algorithm. IEEE Transactions on Software Engineering, vol. 38, no. 5, Sept.-Oct. 2012, pp. 1195-1212. [Pdf], [IEEE], [Supplement Material] , [Bibtex] Zhilei Ren, He Jiang, Jifeng Xuan, Yan Hu, Zhongxuan Luo. New Insights Into Diversification of Hyper-Heuristics. IEEE Transactions on Cybernetics, vol. 44, no. 10, Oct. 2014, pp. 1746-1761. [Pdf], [IEEE] , [Bibtex] Jifeng Xuan, Yan Hu, He Jiang. Debt-Prone Bugs: Technical Debt in Software Maintenance. International Journal of Advancements in Computing Technology, vol. 4, no. 19, 2012, pp. 453-461. [Pdf] , [Bibtex] Zhilei Ren, He Jiang, Jifeng Xuan, Zhongxuan Luo. An Accelerated Limit Crossing Based Multilevel Algorithm for the p-Median Problem. IEEE Transactions on Systems, Man, and Cybernetics, Part B: Cybernetics, vol. 42, no. 2, Aug. 2012, pp. 1187-1202. [Pdf], [IEEE] , [Bibtex] Zhilei Ren, He Jiang, Jifeng Xuan, Zhongxuan Luo. Hyper",
  "content_length": 41045,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:31"
}