{
  "name": "Jignesh M. Patel",
  "homepage": "https://jigneshpatel.org",
  "status": "success",
  "content": "Jignesh Patel's homepage Jignesh M. Patel Professor Computer Science Department Carnegie Mellon University Office: 9103 GHC Tel: (412) 268-1453 Email: [firstname]@cmu.edu Blog: BigFastData Address: 5000 Forbes Ave. Pittsburgh, PA 15213 Research The research in my group focuses on efficient methods to generate insights from data. We focus on improving both system efficiency (e.g., designing high-performance data analysis algorithms), and human efficiency (e.g., designing methods to improve the productivity of users interacting with data systems). CV. LinkedIn. Selected Publications Hermes: Off-the-Shelf Real-Time Transactional Analytics. E. Milkai, X. Yu, J. M. Patel. VLDB 2025. The Key to Effective UDF Optimization: Before Inlining, First Perform Outlining. S. Arch, Y. Liu, T. C. Mowry, J. M. Patel, A. Pavlo. VLDB 2025. DReX: Accurate and Scalable Dense Retrieval Acceleration via Algorithmic-Hardware Codesign. D. Quinn, E. E. Yücel, M. Prammer, Z. Fan, K. Skadron, J. M. Patel, J. F. Martínez, M. Alian. ISCA 2025. SplitDF: Splitting Dataframes for Memory-Efficient Data Analysis., A. Kakaraparthy, J. M. Patel. VLDB 2024. Code. ReAcTable: Enhancing ReAct for Table Question Answering, Y. Zhang, J. Henkel, A. Floratou, J. Cahoon, S. Deep, J. M. Patel. VLDB 2024. Rethinking the Encoding of Integers for Scans on Skewed Data, M. Prammer, J. M. Patel. SIGMOD 2024. Simple Adaptive Query Processing vs. Learned Query Optimizers: Observations and Analysis, Y. Zhang, Y. Chronis, J. M. Patel, T. Rekatsinas. VLDB 2023. Exploiting Structure in Regular Expression Queries, L. Zhang, S. Deep, A. Floratou, A. Gruenheid, J. M. Patel, Y. Zhu. SIGMOD 2023. Code. DataChat: An Intuitive and Collaborative Data Analytics Platforms, R. J. Leo John, D. Bacon, J. Chen, U. Ramesh, J. Li, D. Das, R. Claus, A. Kendall , J. M. Patel. SIGMOD 2023. Accelerating database analytic query workloads using an associative processor, H. Caminal, Y. Chronis, T. Wu, J. M. Patel, J. F. Martínez. ISCA 2022. SQLite: Past, Present, and Future, K. P. Gaffney, M. Prammer, L. Brasfield, D. R. Hipp, D. Kennedy, J. M. Patel. VLDB 2022. Code, Hacker News. Efficiently Searching In-Memory Sorted Arrays: Revenge of the Interpolation Search? P. VanSandt, Y. Chronis, J. M. Patel. SIGMOD 2019. Quickstep: A Data Platform Based on the Scaling-Up Approach, The Quickstep Team. VLDB 2018. Code. Looking Ahead Makes Query Plans Robust, J. Zhu, N. Potti, S. Saurabh, J. M. Patel. VLDB 2017. The case against specialized graph analytics engines, J. Fan, G. Soosai Raj, J. M. Patel. CIDR 2015. Slides. Code. WideTable: An Accelerator for Analytical Data Processing, Y. Li, J. M. Patel, VLDB 2014. Blog. BitWeaving: Fast Scans for Main Memory Data Processing, Y. Li, J. M. Patel, SIGMOD 2013. Blog. Wimpy Node Clusters: What About Non-Wimpy Workloads?, W. Lang, J. M. Patel, S. Shankar, DaMoN 2010. Best paper award. Hamilton's Blog Perspective. List of all publications at DBLP, Google Scholar, and PubMed. The documents distributed by this server have been provided by the contributing authors as a means to ensure timely dissemination of scholarly and technical work on a noncommercial basis. Copyright and all rights therein are maintained by the authors or by other copyright holders, notwithstanding that they have offered their works here electronically. It is understood that all persons copying this information will adhere to the terms and constraints invoked by each author's copyright. These works may not be reposted without the explicit permission of the copyright holder. Selected Teaching Activities CMU 15-445/645: Database Systems (F23, S24). CMU 15-721: Advanced Database Systems (F24, F25). Selected Professional Activities Companies co-founded: Paradise (1997), Locomatix (2007), Quickstep (2015), DataChat (2017). Recent Program Committees: SIGMOD 2025 (AE), CIDR 2024 (co-Chair); SIGMOD 2024 (AE); PVLDB 2024.",
  "content_length": 3902,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:32"
}