{
  "name": "Jihun Hamm",
  "homepage": "http://www.cs.tulane.edu/~jhamm3",
  "status": "success",
  "content": "Jihun Hamm -- Machine Learning Group Jihun Hamm -- Machine Learning Group Associate Professor Department of Computer Science Tulane University office : 6823 St. Charles Ave, 402B Stanley Thomas Hall, New Orleans, LA 70118 email : jhamm3 links : home | publications | people and projects | software | courses Student Hiring I am currently hiring PhD students for Fall 2026 in the areas of Generative/Foundational AI and Medical Imaging. Research Interests ML algorithms Generative AI: diffusion models, vision-language models, synthetic data AI Safety: jailbreaking and misalignment of vision-lanugae models Private ML: differential privacy, bilevel optimization Robust ML: distribution shift, test-time adaptation, transferability ML Applications Materials design: generative models, Bayesian optimization Health sciences: synthetic data generation, medical image analysis Publications You can find the list of publications from Google scholar. News Our paper titled \"Doctor Approved: Generating Medically Accurate Skin Disease Images through AI-Expert Feedback\" has been accepted for publication at NeurIPS'25 (Sep 2025). Our paper titled \"Visual Instance-aware Prompt Tuning\" has been accepted for publication at ACM Multimedia'25 (Oct 2025). Our paper titled \"eSkinHealth: A Multimodal Dataset for Neglected Tropical Skin Diseases\" has been accepted for publication at ACM Multimedia'25 (Oct 2025). Our paper titled \"SOFA: Deep Learning Framework for Simulating and Optimizing Atrial Fibrillation Ablation\" has been accepted for publication at MICCAI'25 (Sep 2025). Our paper titled \"SoK: Can Synthetic Images Replace Real Data? A Survey of Utility and Privacy of Synthetic Image Generation\" has been accepted for publication at USENIX'25 (Aug 2025). Congrats to Tianyi for successfully passing the thesis defense! (July 2025) Congrats to Ziyu for successfully passing the oral qualifier! (July 2025) Our paper titled \"DPCore: Dynamic Prompt Coreset for Continual Test-Time Adaptation\" has been accepted for publication at ICML'25 (July 2025). Yilun Zhou is joining the machine learning group. Welcome! Congrats to Xin for successfully passing the oral qualifier! (June 2025) Congrats to Hajar for successfully passing the prospectus! (May 2025) Congrats to Jiarui for successfully passing the oral qualifier! (Apr 2025) Congrats to Henger for successfully defending the phd theses! (Feb 2025) Our paper titled \"Enhancing Skin Disease Diagnosis: Interpretable Visual Concept Discovery with SAM Empowerment\" has been accepted for publication at WACV'25 (Oct 2024). I have been awarded a NAIRR Pilot project titled \"Accuracy and Unbiasedness of AI-Generated Synthetic Medical Images\" (Oct 2024). I will be giving an invited talk at on \"Can fake images be better than real ones? utility and privacy of synthetic images in dermatology\" at AI-ML Systmes Workshop on Generative AI. (Oct 2024) Our paper titled \"Understanding the Transferability of Representations via Task-Relatedness\" has been accepted for publication at NeurIPS (Sep 2024). Yunsung will be presenting \"Bridging the Gap: Synthetic Data Augmentation through Inversion and Distribution Matching for Few-shot Learning\" at the International Conference on AI-MLSystems Workshop. (Sep 2024) Our paper titled \"OT-VP: Optimal Transport-guided Visual Prompting for Test-Time Adaptation\" has been accepted for publication at WACV (Sep 2024). Our paper titled \"From Majority to Minority: A Diffusion-based Augmentation for Underrepresented Groups in Skin Lesion Analysis\" has been accepted for publication at the MICCAI workshop ISIC Skin Image Analysis (Aug 2024). We also received Honorable Mention Award for this work. I'm a Co-PI to the Louisiana Cancer Research Center (LCRC) new investigator award \"Machine learning to increase the accuracy of non-invasive diagnosis and staging of gastroenteropancreatic neuroendocrine neoplasms.\" Congrats, Dr. Limbach! Our paper titled \"Accelerating High-Entropy Alloy Discovery: Efficient Exploration Via Active Learning\" was accepted for publication in Scripta Materialia.. (May 2024) I'm on the program committees of NeurIPS'24 and ICML'24. I have received 2024 Tulane SSE Diversity Award(May 2024). Congrats to Akshay for receiving the prestigious Tulane 34 award! (May 2024) Congrats to Akshay for successfully defending the phd theses! (Apr 2024) Akshay will be presenting our paper titled \"Test-time Assessment of a Model’s Performance on Unseen Domains via Optimal Transport\" at CVPR Workshop on Fair, Data-efficient, and trusted computer vision. (June 2024) Yunbei will be presenting our paper titled \"OT-VP: Optimal Transport-guided Visual Prompting for Test-Time Adaptation\" at CVPR Workshop on Test-Time Adaptation: Model, Adapt Thyself! (MAT). (June 2024) Janet will be presenting our paper titled \"From Majority to Minority: Enhancing Underrepresented Group via Diffusion-based Augmentation in Skin Lesion Analysis\" at CVPR Workshop on Data Curation and Augmentation in Enhancing Medical Imaging Applications. (June 2024) Janet will be presenting our paper titled \"Achieving Reliable and Fair Skin Lesion Diagnosis via Unsupervised Domain Adaptation\" at CVPR Workshop on Domain adaptation, Explainability, Fairness in AI for Medical Image Analysis (DEF-AI-MIA). (June 2024) Congrats to Gloria for successfully defending the phd theses! (April 2024) Congrats to Mikey for successfully defending the honor theses! (April 2024)",
  "content_length": 5434,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:36"
}