{
  "name": "Jilin Hu",
  "homepage": "https://homes.cs.aau.dk/~hujilin",
  "status": "success",
  "content": "Jilin Hu Ph.D., Department of Computer Science at Aalborg University Selma Lagerlöfs Vej 300, 9220 Aalborg East, Denmark hujilin [at] cs.aau.dk +45 99048891 Google scholar | DBLP Jilin Hu is an Associate Professor at the Department of Computer Science, Aalborg University. Prior to that, he was a tenure-track Assistant Professor at the Department of Computer Science, Aalborg University. He was a Research Assocaite at Inception Institute of Artificial Intelligence (UAE) under the supervision of Prof. Jianbing Shen. He obtained the Ph.D. degree from Aalborg Unviersity in 2019, under the supervision of Prof. Christian S. Jensen and Prof. Bin Yang. From Oct. 2017 to April. 2018, he visited University of California, Berkeley under the supervision of Prof. Alexandre Bayen. Research interest: Spatio-Temporal Data Management, Traffic Data Analysis, Graph Neural Network Never stop looking for highly self-motivated students. News May 23, 2023 One paper is accepted by SIGMOD 2024! May 17, 2023 One paper is accepted by KDD 2023! Feb 23, 2023 One paper “CGF: A Category Guidance Based PM_2.5 Sequence Forecasting Training Framework” is accepted by IEEE TKDE! Sep 22, 2022 I am elected as the Chair of Computer Society Chapter, IEEE Denmark Section! Selected Publications (# Corresponding Author) SIGMOD Origin-Destination Travel Time Oracle for Map-based Services Yan Lin, Huaiyu Wan, Jilin Hu# , Shengnan Guo, Bin Yang, Youfang Lin, and Christian S. Jensen 2024 arXiv Bib @misc{2307.03048, author = {Lin, Yan and Wan, Huaiyu and Hu, Jilin and Guo, Shengnan and Yang, Bin and Lin, Youfang and Jensen, Christian S.}, title = {Origin-Destination Travel Time Oracle for Map-based Services}, year = {2024}, arxiv = {https://arxiv.org/abs/2307.03048}, booktitle = {SIGMOD}, selected = {true}, corr = {true}, bibtex_show = {true}, abbr = {SIGMOD} } KDD LightPath: Lightweight and Scalable Path Representation Learning Sean Bin Yang, Jilin Hu# , Chenjuan Guo, Bin Yang, and Christian S. Jensen In Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining 2023 arXiv Bib @inproceedings{10.1145/3580305.3599415, author = {Yang, Sean Bin and Hu, Jilin and Guo, Chenjuan and Yang, Bin and Jensen, Christian S.}, title = {LightPath: Lightweight and Scalable Path Representation Learning}, year = {2023}, doi = {10.1145/3580305.3599415}, booktitle = {Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining}, pages = {2999–3010}, location = {Long Beach, CA, USA}, bibtex_show = {true}, abbr = {KDD}, corr = {true}, selected = {true}, %code = {}, arxiv = {https://arxiv.org/abs/2307.10171} } ICDE Weakly-supervised Temporal Path Representation Learning with Contrastive Curriculum Learning - Extended Version Sean Bin Yang, Chenjuan Guo, Jilin Hu# , Bin Yang, Jian Tang, and Christian S. Jensen 2022 arXiv Bib Code @article{DBLP:journals/corr/abs-2203-16110, author = {Yang, Sean Bin and Guo, Chenjuan and Hu, Jilin and Yang, Bin and Tang, Jian and Jensen, Christian S.}, title = {Weakly-supervised Temporal Path Representation Learning with Contrastive Curriculum Learning - Extended Version}, booktitle = {38th {IEEE} International Conference on Data Engineering, {ICDE}}, year = {2022}, bibtex_show = {true}, abbr = {ICDE}, selected = {true}, corr = {true}, code = {https://github.com/Sean-Bin-Yang/TPR.git}, arxiv = {https://arxiv.org/abs/2203.16110} } AAAI Hyperverlet: A Symplectic Hypersolver for Hamiltonian Systems Frederik Mathiesen, Bin Yang, and Jilin Hu# 2022 Bib Code @article{aaai22_hamilton, author = {Mathiesen, Frederik and Yang, Bin and Hu, Jilin}, title = {Hyperverlet: A Symplectic Hypersolver for Hamiltonian Systems}, booktitle = {AAAI}, year = {2022}, bibtex_show = {true}, abbr = {AAAI}, selected = {true}, corr = {true}, code = {https://github.com/Zinoex/hyperverlet} } IJCAI Unsupervised Path Representation Learning with Curriculum Negative Sampling Sean Bin Yang, Chenjuan Guo, Jilin Hu# , Jian Tang, and Bin Yang In Proceedings of the Thirtieth International Joint Conference on Artificial Intelligence, IJCAI 2021, Virtual Event / Montreal, Canada, 19-27 August 2021 2021 arXiv Bib PDF Code @inproceedings{DBLP:conf/ijcai/YangGHT021, author = {Yang, Sean Bin and Guo, Chenjuan and Hu, Jilin and Tang, Jian and Yang, Bin}, title = {Unsupervised Path Representation Learning with Curriculum Negative Sampling}, booktitle = {Proceedings of the Thirtieth International Joint Conference on Artificial Intelligence, {IJCAI} 2021, Virtual Event / Montreal, Canada, 19-27 August 2021}, pages = {3286--3292}, year = {2021}, bibtex_show = {true}, abbr = {IJCAI}, pdf = {IJCAI21.pdf}, selected = {true}, corr = {true}, code = {https://github.com/Sean-Bin-Yang/Path-InfoMax.git}, arxiv = {https://arxiv.org/abs/2106.09373} } ICDE Stochastic Origin-Destination Matrix Forecasting Using Dual-Stage Graph Convolutional, Recurrent Neural Networks Jilin Hu , Bin Yang, Chenjuan Guo, Christian S. Jensen, and Hui Xiong In 36th IEEE International Conference on Data Engineering, ICDE, Dallas, TX, USA, April 20-24 2020 Bib PDF Code @inproceedings{DBLP:conf/icde/Hu0GJX20, author = {Hu, Jilin and Yang, Bin and Guo, Chenjuan and Jensen, Christian S. and Xiong, Hui}, title = {Stochastic Origin-Destination Matrix Forecasting Using Dual-Stage Graph Convolutional, Recurrent Neural Networks}, booktitle = {36th {IEEE} International Conference on Data Engineering, {ICDE}, Dallas, TX, USA, April 20-24}, pages = {1417--1428}, publisher = {{IEEE}}, year = {2020}, bibtex_show = {true}, abbr = {ICDE}, selected = {true}, pdf = {ICDE2020}, code = {https://github.com/hujilin1229/od-pred} } ICDE Stochastic Weight Completion for Road Networks Using Graph Convolutional Networks Jilin Hu , Chenjuan Guo, Bin Yang, and Christian S. Jensen In 35th IEEE International Conference on Data Engineering, ICDE, Macao, China, April 8-11 2019 Bib PDF Code @inproceedings{DBLP:conf/icde/HuG0J19, author = {Hu, Jilin and Guo, Chenjuan and Yang, Bin and Jensen, Christian S.}, title = {Stochastic Weight Completion for Road Networks Using Graph Convolutional Networks}, booktitle = {35th {IEEE} International Conference on Data Engineering, {ICDE}, Macao, China, April 8-11}, pages = {1274--1285}, year = {2019}, bibtex_show = {true}, abbr = {ICDE}, pdf = {ICDE2019.pdf}, code = {https://github.com/hujilin1229/GraphCompletion}, selected = {true} } ISs Residual memory inference network for regression tracking with weighted gradient harmonized loss Huanlong Zhang, Jiapeng Zhang, Guohao Nie, Jilin Hu# , and W.J. (Chris) Zhang Information Sciences 2022 Bib @article{ZHANG2022105, author = {Zhang, Huanlong and Zhang, Jiapeng and Nie, Guohao and Hu, Jilin and Zhang, W.J. (Chris)}, title = {Residual memory inference network for regression tracking with weighted gradient harmonized loss}, journal = {Information Sciences}, volume = {597}, pages = {105-124}, year = {2022}, bibtex_show = {true}, abbr = {ISs}, corr = {true}, selected = {true} } GeoInformatica Enabling time-dependent uncertain eco-weights for road networks Jilin Hu , Bin Yang, Christian S. Jensen, and Yu Ma GeoInformatica 2017 Bib PDF @article{DBLP:journals/geoinformatica/HuYJM17, author = {Hu, Jilin and Yang, Bin and Jensen, Christian S. and Ma, Yu}, title = {Enabling time-dependent uncertain eco-weights for road networks}, journal = {GeoInformatica}, volume = {21}, number = {1}, pages = {57--88}, year = {2017}, pdf = {GeoInfo.pdf}, bibtex_show = {true}, abbr = {GeoInformatica}, selected = {true} } VLDBJ Risk-aware path selection with time-varying, uncertain travel costs: a time series approach Jilin Hu , Bin Yang, Chenjuan Guo, and Christian S. Jensen VLDB J. 2018 Bib PDF @article{DBLP:journals/vldb/HuYGJ18, author = {Hu, Jilin and Yang, Bin and Guo, Chenjuan and Jensen, Christian S.}, title = {Risk-aware path selection with time-varying, uncertain travel costs: a time series approach}, journal = {{VLDB} J.}, volume = {27}, number = {2}, pages = {179--200}, year = {2018}, bibtex_show = {true}, abbr = {VLDBJ}, selected = {true}, pdf = {https://link.springer.com/article/10.1007/s00778-018-0494-9} } TNNLS Few-Shot Object Detection with Self-Supervising and Cooperative Classifier Qi Di, Jilin Hu# , and Jianbing Shen IEEE Transactions on Neural Networks and Learning Systems 2022 Bib @article{qi2022fsod, title = {Few-Shot Object Detection with Self-Supervising and Cooperative Classifier}, author = {Di, Qi and Hu, Jilin and Shen, Jianbing}, journal = {IEEE Transactions on Neural Networks and Learning Systems}, pages = {To appear}, year = {2022}, bibtex_show = {true}, abbr = {TNNLS}, selected = {true}, corr = {true} } Visitors",
  "content_length": 8660,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:39"
}