{
  "name": "Jiliang Wang",
  "homepage": "http://tns.thss.tsinghua.edu.cn/~jiliang",
  "status": "success",
  "content": "Jiliang Wang Jiliang Wang (王继良) Associate Professor School of Software & BNRIST Tsinghua University, P.R.China Email: jiliangwang AT tsinghua.edu.cn [Home] [Publications] [Service] [Funds] Biography Jiliang Wang is currently an associate professor at School of Software, Tsinghua University, P.R.China. He is broadly interested in Internet of Things (IoT) combined with AI. He is particularly focused on advancing communication, sensing, and data processing techniques using AI with IoT techniques, with applications in industrial and health domains. Jiliang Wang received his Ph.D. degree at the Department of Computer Science and Engineering, Hong Kong University of Science and Technology, and his B.Eng from University of Science and Technology of China. 课题组招收硕士、博士生、博士后 Currently, I am looking for self-motivated undergraduate/MPhil/PhD students and PostDocs to work with me. If you are interested in my research areas, please contact me. 物联网通信感知基础或《物联网导论》课程的基本信息，可以访问 [这里]。My course material on Introduction to Internet of Things can be found [here]. 大模型移动应用开发或《移动应用开发》课程信息，可以访问 [这里]。My course material on LLM enhanced Mobile App Development [here]. Some thoughts on paper writing for students in our group [link]. News [10/25] Our work is accepted by MobiCom 25. [01/25] 博士生童率获得CCF博士论文激励计划. [01/25] We are organizing TIOT Special issue on LLM Empowered Internet of Things. Consider submit your work to the SI. [11/23] Our work on large-scale LoRa network measurement won the ACM SenSys 2023 Best Paper Award Runner-up. [10/23] I am serving as the publicity chair of ACM MobiCom 2024. Please consider submit your work to MobiCom. [09/23] Our work on long range active LoRa sensing is accepted by ICNP 2024. [08/23] I am serving as the publicity chair of ACM MobiSys 2024. Please consider submit your work to MobiSys. [12/21] We are organizing the ACM TOSN Special Issue on Low Power Wide Area Networks (LPWANs). Please consider submit your work to this special issue. [11/21] Our work NELoRa won the best paper at ACM SenSys 2021. [08/21] Two papers are accepted in ACM MobiCom 2021. [08/21] Our work AlignTrack for LoRa collision decoding is accepted in IEEE ICNP 2021. [07/21] Our work won the IWQoS 2021 Best Paper Award Runner-up. [01/21] 物联网课程材料: IoT course material and code is also available at link. [01/21] INFOCOM 2021: Our work Pyramid, a real time LoRa decoder, was accepted in INFOCOM 2021. Source code is also available at code. [05/20] MOBISYS 2020: Our work NSCale, a receiver side concurrent LoRa collision decoding method, was accepted. [05/20] MOBISYS 2020: Our work BlueDoor on analyzing the Bluetooth low energy (BLE) communication vulnerability was accepted. [05/20] SECON 2020: Our work FlipLoRa, an effective technique to improve concurrency by flip LoRa symbol, was accepted. [12/19] INFOCOM 2020: Our work CoLoRa on concurrent packet reception in LPWAN was accepted. [12/19] INFOCOM 2020: Our work DyLoRa on dynamic transmission control and parameter selection for LPWAN was accepted. [12/19] INFOCOM 2020: Our work AcouRadar on single source acoustic based localization was accepted. [04/19] ICDCS 2019 & IWQOS 2019: Two works on adaptive video streaming and bitrate adaption for mobile and wireless networks are accepted in ICDCS 2019 and IWQoS 2019, respectively. [12/19] Invited to be the publicity chair of IEEE SECON 2020. [04/19] Invited to be a TPC member of IEEE INFOCOM 2020. [08/18] We are organizing two workshops on LPWAN in conjunction with ICPADS 2018 and EWSN 2019, respectively. The two workshops are The 1st workshop on Low Power Wide Area Networks for Internet of Things (LPNET) and The 1st Workshop on LPWAN Systems and Applications (LPWANSys 2018). [07/18] MOBICOM 2018: Our work RainbowLight on ambient visible light positioning is accepted in ACM MobiCom 2018. [07/18] TON: Our work GeneWave, on fast and secure acoustic based device to device (also mobile to mobile) communication, is accepted in Transactions on Networking (ToN). [04/18] Invited to be a TPC member of IEEE INFOCOM 2019. [02/18] INFOCOM 2018: 4 papers from our group, on wireless sensing, wireless and edge computing, and IoT security, respectively, were accepted in IEEE INFOCOM 2018. [02/18] Awarded as Distinguished TPC Member of IEEE INFOCOM 2018. More... [08/17] Our work, on mobile gaze tracking and application, was accepted in Ubicomp 2017. [08/17] Our work, on low power wireless design, was accepted in IEEE ICNP 2017. [06/17] Our work on energy efficient communication in coexistence environment was accepted in IEEE Transactions on Communications. [06/17] Our work on efficient data flooding was accepted in IEEE/ACM Transactions on Networking (ToN). [04/17] Awarded as Distinguished TPC Member of IEEE INFOCOM 2017. [12/16] Our work was accepted in IEEE SECON 2017. [12/16] Our work was accepted in IEEE INFOCOM 2017. [12/16] Best paper award: our work \"Link level behaviour measurement in a large scale wireless sensor network\" won the best paper award in MSN 2016. [10/16] Invited to be a TPC member in IEEE SECON 2017. [04/16] Awarded as Distinguished TPC Member of INFOCOM 2016. [12/15] Our work \"Smokey\", a wireless based smoking detection system, accepted in INFOCOM 2016. Seminar Recent Publications Conference [MOBICOM] Shuai Tong, Qian Chen, Jiliang Wang: OptSamp: Optimizing the Sampling Rate for LoRa Energy Efficiency Enhancement. ACM MobiCom 2025 [ICNP] Xinyi Liu, Shuai Tong, Hang Li, Jiliang Wang, Shen Gao, Jie Wu: Wireless Channels as Fingerprints: Towards Collision-Free LoRa Networks. IEEE ICNP 2025 [MOBISYS] Jinyan Jiang, Jiliang Wang, Yijie Chen, Shuai Tong, Pengjin Xie, Yihao Liu, Yunhao Liu: Willow: Practical WiFi Backscatter Localization with Parallel Tags. ACM MobiSys 2024 [MOBISYS] Chenning Li, Yidong Ren, Shuai Tong, Shakhrul Iman Siam, Mi Zhang, Jiliang Wang, Yunhao Liu, Zhichao Cao: ChirpTransformer: Versatile LoRa Encoding for Low-power Wide-area IoT. ACM MobiSys 2024 [IPSN] Jinyan Jiang, Jiliang Wang, Yihao Liu, Yijie Chen, Yunhao Liu: WiCloak: Protect location privacy of WiFi devices. ACM/IEEE IPSN 2024 [SENSYS] Guanyu Cai, Jiliang Wang: Locating Your Smart Devices with a Single Speaker. ACM SenSys 2024 [INFOCOM] Boxin Hou, Jiliang Wang: LoBaCa: Super-Resolution LoRa Backscatter Localization for Low-Cost Tags, IEEE INFOCOM 2024 [INFOCOM] Guanyu Cai, Jiliang Wang: ATP: Acoustic Tracking and Positioning under Multipath and Doppler Effect, IEEE INFOCOM 2024 [INFOCOM] Yihao Liu, Jinyan Jiang, Jiliang Wang: LoMu: Enable Long-Range Multi-Target Backscatter Sensing for Low-Cost Tags, IEEE INFOCOM 2024 [IPSN] Jinyan Jiang, Jiliang Wang, Yihao Liu, Yijie Chen, Yunhao Liu: WiCloak: Protect Location Privacy of WiFi Devices. IPSN 2024 [SenSys] Shuai Tong, Jiliang Wang, Jing Yang, Yunhao Liu, Jun Zhang \"Citywide LoRa Network Deployment and Operation: Measurements, Analysis, and Implications\", ACM SenSys 2023. Best Paper Award Runner-up [PDF] [ICNP] Zhipeng Song, Shuai Tong, Jiliang Wang \"LoSense: Integrated Long-Range Sensing and Communication with LoRa Signals\", IEEE ICNP 2023. [MOBISYS] Jinyan Jiang, Jiliang Wang, Yijie Chen, Yihao Liu and Yunhao Liu. \"LocRa: Enable Practical Long-Range Backscatter Localization for Low-Cost Tags\", ACM MobiSys 2023. [PDF] [NSDI] Yihang Song, Li Lu, Jiliang Wang, Chong Zhang, Hui Zheng, Shen Yang, Jinsong Han, Jian Li. \"μMote: Enabling Passive Chirp De-spreading and μW-level Long-Range Downlink for Backscatter Devices\", USENIX NSDI 2023. [PDF] [MOBICOM] Shuai Tong, Yangliang He, Yunhao Liu, Jiliang Wang. \"De-spreading over the air: long-range CTC for diverse receivers with LoRa\", ACM MobiCom 2022. [PDF] [UBICOMP] Jing Yang, Baishun Dong, Jiliang Wang. \"VULoc: Accurate UWB Localization for Countless Targets without Synchronization\", ACM IMWUT(Ubicomp) 2022. [PDF] [ICNP] Zhenqiang Xu, Pengjin Xie, Jiliang Wang, and Yunhao Liu . \"Ostinato: Combating LoRa Weak Links in Real Deployments\", IEEE ICNP 2022. [PDF] [SENSYS] Chenning Li, Hanqing Guo; Shuai Tong; Xiao Zeng, Zhichao Cao, Mi Zhang, Qiben Yan, Li Xiao, Jiliang Wang, Yunhao Liu. \"NELoRa: Towards Ultra-low SNR LoRa Communication with Neural-enhanced Demodulation\", ACM SenSys 2021. Best Paper Award [PDF] [MOBICOM] Shuai Tong, Zilin Shen, Yunhao Liu, Jiliang Wang. \"Combating Link Dynamics for Reliable LoRa Connection in Urban Settings\", ACM MobiCom 2021. [PDF] [MOBICOM] Jinyan Jiang, Zhenqiang Xu, Jiliang Wang. \"Long-Range Ambient LoRa Backscatter with Parallel Decoding\", ACM MobiCom 2021. [PDF] [ICNP] Qian Chen, Jiliang Wang. \"AlignTrack: Push the Limit of LoRa Collision Decoding\", IEEE ICNP 2021. [PDF] [IWQoS] Chunyu Qiao, Jiliang Wang, Yanan Wang, Yunhao Liu, Hu Tuo. \"Understanding and Improving User Engagement in Adaptive Video Streaming\", IEEE/ACM IWQoS 2021. Best Paper Award Runner-up [INFOCOM] Zhenqiang Xu, Pengjin Xie, Jiliang Wang. \"Pyramid: Real-Time LoRa Collision Decoding withPeak Tracking\", IEEE INFOCOM 2021. [PDF code] [MOBISYS] Shuai Tong, Jiliang Wang, Yunhao Liu. \"Combating Packet Collisions Using Non-Stationary Signal Scaling in LPWANs\", ACM MOBISYS 2020. [PDF] [MOBISYS] Jiliang Wang, Feng Hu, Ye Zhou, Hanyi Zhang, Zhe Liu, Yunhao Liu. \"BlueDoor: Breaking the Secure Information Flow via BLE Vulnerability\", ACM MOBISYS 2020. [SENSYS] Pengjin Xie, Lingkun Li, Jiliang Wang, Yunhao Liu. \"LiTag: localization and posture estimation with passive visible light tags\", ACM SENSYS 2020. [SECON] Zhenqiang Xu, Shuai Tong, Pengjin Xie, Jiliang Wang, \"FlipLoRa: Resolving Collisions with Up-Down Quasi-Orthogonality\", IEEE SECON 2020 [INFOCOM] Yinghui Li, Jing Yang, Jiliang Wang. \"DyLoRa: Towards Energy Efficient Dynamic LoRa Transmission Control\", IEEE INFOCOM 2020. [INFOCOM] Shuai Tong, Zhenqiang Xu, Jiliang Wang. \"CoLoRa: Enable Muti-Packet Reception in LoRa\", IEEE INFOC",
  "content_length": 23171,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:35"
}