{
  "name": "Jillian Aurisano",
  "homepage": "https://researchdirectory.uc.edu/p/aurisajm",
  "status": "success",
  "content": "Expert Profile: Jillian Aurisano | Research Directory Jillian Aurisano , PhD Asst Professor Rhodes Hall CEAS - Computer Science - 0030 513-556-2988EmailDownload V-Card Laboratory website: https://www.davinci-uc.org/ Data visualization & visual analytics; Human-computer interaction; Large and collaborative display environments; Immersive analytics & virtual reality; Multi-modal interaction; Computer-supported cooperative work.Peer Reviewed Publications Aurisano J.; Kumar A.; Alsaiari A.; Eugenio B.D.; Johnson A. (06-01-2020. ) Many At Once: Capturing Intentions to Create And Use Many Views At Once In Large Display Environment.Computer Graphics Forum, , 39 (3 ) ,229-240 More Information Kumar A.; Di Eugenio B.; Aurisano J.; Johnson A. (01-01-2020. ) Augmenting small data to classify contextualized dialogue acts for exploratory visualization .LREC 2020 - 12th International Conference on Language Resources and Evaluation, Conference Proceedings, , 590-599 Kumar A.; Aurisano J.; Di Eugenio B.; Johnson A. (01-01-2020. ) Intelligent assistant for exploring data visualizations .Proceedings of the 33rd International Florida Artificial Intelligence Research Society Conference, FLAIRS 2020, , 538-543 Aurisano J.; Hwang J.; Johnson A.; Long L.; Crofoot M.; Berger-Wolf T. (10-01-2019. ) Bringing the Field into the Lab: Large-Scale Visualization of Animal Movement Trajectories within a .2019 IEEE 9th Symposium on Large Data Analysis and Visualization, LDAV 2019, , 83-84 More Information Renambot L.; Marrinan T.; Aurisano J.; Nishimoto A.; Mateevitsi V.; Bharadwaj K.; Long L.; Johnson A.; Brown M.; Leigh J. (01-01-2016. ) SAGE2: A collaboration portal for scalable resolution displays.Future Generation Computer Systems, , 54 ,296-305 More Information Dang T.; Murray P.; Aurisano J.; Forbes A. (08-13-2015. ) ReactionFlow: An interactive visualization tool for causality analysis in biological pathways.BMC Proceedings, , 9 , More Information Aurisano J.; Reda K.; Johnson A.; Marai E.; Leigh J. (08-13-2015. ) BactoGeNIE: A large-scale comparative genome visualization for big displays.BMC Bioinformatics, , 16 (11 ) , More Information Aurisano J.; Nanavaty A.; Cruz I. (01-01-2015. ) Visual analytics for ontology matching using multi-linked views .CEUR Workshop Proceedings, , 1456 ,25-36 Marrinan T.; Aurisano J.; Nishimoto A.; Bharadwaj K.; Mateevitsi V.; Renambot L.; Long L.; Johnson A.; Leigh J. (01-01-2015. ) SAGE2: A new approach for data intensive collaboration using Scalable Resolution Shared Displays.CollaborateCom 2014 - Proceedings of the 10th IEEE International Conference on Collaborative Computing: Networking, Applications and Worksharing, , 177-186 More Information Aurisano J.; Reda K.; Johnson A.; Leigh J. (01-16-2014. ) Bacterial gene neighborhood investigation environment: A large-scale genome visualization for big di.IEEE Symposium on Large Data Analysis and Visualization 2014, LDAV 2014 - Proceedings, , 103-104 More Information Reda K.; Febretti A.; Knoll A.; Aurisano J.; Leigh J.; Johnson A.; Papka M.; Hereld M. (08-02-2013. ) Visualizing large, heterogeneous data in hybrid-reality environments.IEEE Computer Graphics and Applications, , 33 (4 ) ,38-48 More Information Schumer M.; Birger R.; Tantipathananandh C.; Aurisano J.; Maggioni M.; Mwangi P. (05-01-2013. ) Infestation by a common parasite is correlated with ant symbiont identity in a plant-ant mutualism.Biotropica, , 45 (3 ) ,276-279 More Information",
  "content_length": 3464,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:40"
}