{
  "name": "Jim Hendler",
  "homepage": "http://www.cs.rpi.edu/~hendler",
  "status": "success",
  "content": "Prof. James A. Hendler For an easy to read version of most of the good stuff below, see my Wikipedia page. For some of my presentations and/or videos about the Semantic Web and related topics, please check my presentations and videos page slides from more recent talks are on My slideshare page Professor James A. Hendler Tetherless World Professor of Computer, Web and Cognitive Sciences Director, Rensselaer Future of Computing Institute Director,RPI-IBM Artifical Intellligence Research Collaboration Rensselaer Polytechnic Institute (RPI), Troy, NY 12180. Formerly: Director, The Joint Institute for Knowledge Discovery Co- Director (and head of Semantic Web and Agents Research), Maryland Information and Network Dynamics Laboratory Head, Autonomous Mobile Robotics Laboratory All at the Universty of Maryland, College Park (which, unfortunately, does not archive older web sites and thus direct links to all of the above are gone. You can find information on many of these sites via the Internet Archive.) @jahendler on Twitter FOAF Contact Information A short bio sketch (updated 12/2019) My full vita (pdf) (last update, 12/2019) Various and Sundry of Interest My Google Scholar Page My papers autogenerated from DBLP For some of my presentations and/or videos about the Semantic Web and related topics, please check my presentations and videos page My 2013 Interview in Geek magazine. My Testimony to the New York State Assembly on the State's need for an open Data Web Site, May 22, 2012. Yes, it is true, I was mentioned in Playboy magazine (Oct 2010) - but no photo and only with respect to my role as a professor - you can see the Press Release - so stop snickering. I often get asked about the phrase \"A little Semantics Goes a Long Way\" and it's history. I finally created this Web page in response. Learn more about Web Science and check out Dr. Web's Wide World my blog on the Nature Network. The Emerging Science of the World Wide Web Workshop was held in London September 12-15, 2005. I gave the Robert Engelmore Memorial Lecture at AAAI 2005, entitled Knowledge is Power: the view from the Semantic Web. (8M PDF download). The W3C Web Ontology Working Group which I co-chaired produced The Web Ontology Language OWL . Slides from my presentations on the Semantic Web and related topics can be found at my presentations page. My 1st Policy Forum in Science can be found on the Science Web site here with more background here. My article \"Is there an intelligent agent in your future (Nature Webmatters, 3/99)\" which was the recipient of the \"2000 AAAI Effective Expository Writing Award.\" An article entitled Agents on the Semantic Web which describes a model of how agents and ontologies play together in the web of the future. View the transcript of my 1/1/01 CNN.COM chat on the future of Artificial Intelligence. (Ten years later I am amazed -- I got a lot of it right!) FUNDING TUTORIAL SLIDES Slides from my tutorial entitled \"How to get that first grant:A young scientist's guide to (AI) funding in America\" which was delivered at AAAI-98, Madison, Wisconsin, 1998. (these slides have been updated from time to time, so should still be relevant) Research Interests: (a list desperately in need of updating) My RPI work in using the Semantic Web to enhance Open Government Data Sharing efforts. The Tetherless World Constellation at RPI which is where you can see my new work in Web Science, Semantic Web, and AI My UMCP Semantic Web Research AI projects I used to work in Robotics I'm still proud of this great project in robotics and education Some of my books: Social Machines: The coming collision of Artificial Intelligence, Social Networking, and Humanity Apress (Spring), 2016. Semantic Web for the Working Ontologist:Effective modeling in RDFS and OWL(Second Edition) Morgan-Kaufman, 2011. (With Dean Allemang). Spinning the Semantic Web, MIT Press, 2002 Robots for Kids, Morgan Kaufmann Publishers, 2000. (MK page) Massively Parallel Artificial Intelligence, AAAI/MIT Press, 1994. (AAAI Press page) The Semantic Web - ISWC 2002 (proceedings) Springer-Verlag, Lecture Notes in Computer Science 2342. Former Thesis Students: I learned much from my teachers, more from my colleagues, but from my students most of all. --- T.B. Ta'anith 7a Note: My apology to my MS student advisees, but the list just became too long Dr. Nkechinyere (Nneka) Agu, (PhD, 2022) Dr. Eric Ameres, (PhD, 2018) Dr. Medha Atre, (PhD, 2011) Dr, Garth Barbour, (Phd, 2002) Prof. Bernardo Cuenca-Grau (PhD, University of Valencia, 2005) Dr. Dominic Difranzo, (PhD 2015) Dr. Rahul Divekar, (PhD 2020) Dr. Ahmed Eleish(PhD 2022) Dr. Simon Ellis, (PhD 2016) Dr. Kutluhan Erol(PhD, 1995) Prof. Matthew Evett(PhD, 1994) Prof. Jennifer Golbeck(PhD, 2005) Dr. Kristine Gloria Garcia (PhD 2016) Dr. Alvaro Graves-Fuenzalida(PhD, 2013) Dr. Christian Halaschek-Wiener(PhD, 2007) Prof. Jeff Heflin , (PhD 2001) Prof. Subbarao Kambhampati(PhD, 1989) Dr. Aditya Kalyanpur(PhD, 2006) Prof. Neha Keshan (PhD,2023) Dr. Brian Kettler(PhD, 1995) Dr. Matthew Klawonn (PhD, 2019) Dr. Emily Klein(PhD, 2023) Dr. Robert Kohout (PhD, 1998) Dr. Vladimir Kolovski (PhD, 2008) Dr. Xian Li(PhD, 2013) Prof. Sean Luke (PhD, 2000) Alexander (Sasha) Lutsevich (PhD, 2024) Dr. Bassem Makni (PhD, 2018) Dr. James Michaelis (PhD, 2014) Dr. Jaime Montemayor (PhD, 2004) Shweta Narkar (PhD, 2024) Dr. Eduardo Ostertag (PhD, 1992) Dr. Feifei Pan(PhD, 2022) Dr. Nidhi Rastogi (PhD, 2018) Dr. Cara Reedy (PhD, 2020) Dr. Vijay Sadashivaiah (PhD, 2025) Dr. Bhanushee Sharma (PhD, 2022) Dr. Joshua Shinavier (PhD 2015) Dr, David Silberberg, (Phd, 2002) Dr. Evren Sirin(PhD,2006) Prof. Lee Spector(PhD, 1992) Prof. Merwyn Taylor(PhD, 1998) Brenda Thompson (PhD,2024) Dr. Reiko Tsuneto(PhD, 1998) Neha Upadaya, (PhD, 2024) Dr. Amar Viswanathan (PhD, 2018) Dr. Jesse Weaver (Phd, 2013) Dr. Greg Williams (Phd, 2013) Dr. Anne Wilson (PhD, 1993) Dr. Bingsheng Yao (PhD, 2024) Photo gallery Some photos from various things I've done in my career: world Economic Forum A 2004 talk at the Jewish Agency in Jerusalem. Photos from the 1996-1997 IDA Defense Science Study Group. (For more info on the DSSG program click here.) Photos from the Cognitive Systems Workshop which Rod Brooks , Raj Reddy, Bob Kahn and I organized under DARPA IPTO sponsorship - Nov, 2002. Photos from Dastuhl Seminar on Control of Search in AI Planning. Group Photo: The 1986 Connectionist Models Summer School (Gif, 342k). Outside Interests: Scuba Diving, travel, my kid Still useful advice: If Austin Tate suggests you go with him after the meeting, DO IT! Fun with embedded markup The following links are to test RDFa services with Yahoo Search Monkey and/or Google's Rich Snippets. event test: event News test: news The following is generated by a schema.org person description on this page. Jim Hendler Professor Tetherless World Constellation RPI 110 8th Street Troy, NY 12180 (518) 276-4401 My Constellation Chair colleagues: Deborah McGuinness Peter Fox My Google Profile",
  "content_length": 7008,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:44"
}