{
  "name": "Jim McCann",
  "homepage": "http://www.cs.cmu.edu/~jmccann",
  "status": "success",
  "content": "Jim McCann's Page Jim McCann (Sometimes known as James L. McCann) E-Mail: jmccann (at cs dot cmu.edu) Cell Phone: (412) 400 three one nine nine Desk Phone: (412) 268 three nine nine seven Office: Smith 229 CV: pdf format Campus Mailing (not office!) Address: 4804 Forbes Ave Newell-Simon Hall Robotics, 4th Fl, Rm 4104 Pittsburgh, PA 15213 Home Address: 616 East End Ave. Pittsburgh, PA 15221 About I am an Associate Professor in the Carnegie Mellon Robotics Institute. I think that creativity – making things and ideas! – is the best thing that humans do. So my research involves producing creative tools (software, hardware, and even theories) to help people do more creating. I am particularly interested in systems and interfaces that operate in real-time and build user intuition; lately, I've been applying these ideas to textiles fabrication and machine knitting as the co-leader of the Carnegie Mellon Textiles Lab. This page is a monolithic presentation of the research software and projects I'm associated with. If you are interested in my personal life, games, or terse ramblings, please visit my web server at tchow.com. I was a PhD student in the graphics lab advised by Nancy Pollard. Having mostly graduated in August 2010, I began a postdoc at Adobe's research lab in Boston. In October of 2012 I moved back to Pittsburgh to work full time on writing video games, creating Rktcr [for Windows, OSX, and Linux] and Rainbow [for iOS and Android]. In February of 2014, I took a job with Disney Research Pittsburgh, mainly because they offered me the opportunity to make real things with my research. In May of 2017, I joined the faculty of the Carnegie Mellon Robotics Institute. My brother Mike McCann also earned a PhD at Carnegie Mellon University. Students Current: Yuichi Hirose (PhD) -- \"solid knitting\" machines and software. Gabrielle Ohlson (PhD) -- knit calibration, microstructures, and assistive devices. Graduated: Jenny Lin (PhD) -- planning and discrete algorithms for knit manufacturing. Nur Yildirim (PhD) -- intelligent tools, designing with AI. Tianhong \"Catherine\" Yu (MS) -- knit sensing. Vidya Narayanan (PhD) -- design and simulation for machine knitting. Ruta Desai (PhD) -- robot design for everyone. Ticha Sethapakdi (Masters) -- texture painting with real-time video input. Evan Shimizu (PhD) -- creativity support tools for parametrized design spaces. Research NOTE: For textiles-related projects, see https://textiles-lab.github.io/publications/ for a more complete and up-to-date list. There's volumetric knitting and deployable quilted furniture over there, and I don't mention either of those below! Non-Mirroring Infinity Mirrors (2025) A solo(!) side project. Over a few months in 2025 I developed and implemented an interesting idea: build an infinity mirror – an optical novelty device that makes a tunnel of reflected copies of a scene using two facing mirrors – where the reflected scenes don't look reflected. This allows for things that were previously impossible in an infinity mirror; for example, speed tunnel effects. This work appeared as a poster at SIGGRAPH 2025. For details and fun demo videos, see the project page. I still have a few more ideas up my sleeve and some larger first-surface acrylic mirrors in my project box. Machine Knitting Design Tools (2015, Ongoing) With Nat Hurtig, Jenny Lin, Gilbert Bernstein, Adriana Schulz, Tom Price, Lea Albaugh, Vidya Narayanan, April Grow, Jennifer Mankoff, David Levin, Wojciech Matusik, Jessica Hodgins Industrial knitting machines are amazing pieces of hardware, but the software stack that drives them is heavily manufacturing-focused. My group is building the tools and infrastructure for rapid iteration and once-off manufacturing with machine knitting. One approach we have taken is to build a \"compiler\" to perform low-level scheduling of knit primitives, leaving high-level design to the user. This makes it easy to knit complicated 3D shapes without worrying about stitch placement on the machine bed. A description of our compiler for knitting appeared at SIGGRAPH 2016. For more information see the project page. We've also developed tools to automatically convert 3D meshes directly to machine knitting instructions. Project page. More generally, we've tackled the problem of output-domain editing of knit structures while preserving knitability. Project page. We've also been delving into the semantics of knitting programs, specified in terms of a topological object we call a \"labelled tangle\" (project page). In follow-on work we give necessary and sufficient conditions for checking if a particular presentation of a labelled tangle corresponds to a knitting program (project page). The crown jewel of this line of knitout semantics work, in my opinion, is our algorithm that canonicalizes knitting programs, allowing for fast equivalence checking (project page.) Design Tools for Parameterized Spaces (2019-2020) With Evan Shimizu, Matt Fisher, Sylvain Paris, Kayvon Fatahalian Many modern design tasks -- from particle effect generation to material design -- boil down to exploring and refining parameter selections in high-dimensional spaces. The Design Adjectives framework presents a modern take on how to integrate machine learning with design exploration and refinement. This work connects to a larger theme of my work: building tools that help everyone become more creative and productive. The Design Adjectives system specifically fits with this goal by providing both exploration tools (good for everyone, but especially for non-experts trying to understand a domain) and low-level adjustment tools (required by experts). This work appeared at UIST 2020. For more information, see the project page. Lightweight Structure Design (2016-2018) With Erva Ulu, Levent Burak Kara The flexibility of 3D printers means that structures can now be designed with complex internal geometry. This allows -- along other things -- informed trade-offs between strength and weight. We've explored optimization algorithms to deal with these trade-offs in a few interesting cases. In one case, we have developed a lightweighting approach that works with unknown force locations by optimizing for the worst-case force. Project Page. In a later project, we used a novel heat-based shell structure to ensure that the optimized object contains a single, connected, inner cavity for ease of cleaning or filling. Project Page. Low-Latency Interaction with RFID Tags (2015-2016) With Andrew Spielberg, Alanson Sample, Scott Hudson, and Jennifer Mankoff During his internship at Disney Research, we set Andrew the task of tracking cover and motion events with RFID tags 10x faster than previous work, a feat he accomplished through the power of Bayes filters. As part of the RapID pipeline, we built a Unity-compatible runtime, which allowed us to create some fun and cool looking example applications. This work appeared at CHI 2016. For more information see the project page. I was also involved in a follow-on project about deploying RFID readers in a light-bulb form-factor, which was appeared at UbiComp 2017. Project page. A Layered Fabric 3D Printer for Soft Interactive Objects (2015) With Huaishu Peng, Jennifer Mankoff, and Scott Hudson My first Disney-affiliated paper describes a 3D printer that works with layered felt. Huaishu managed to take this project from back-of-a-napkin sketches (from Scott, Jen, and I) to a finished device in just 3 months. There are a lot of challenges inherent in handling, cutting, and bonding fabric, and this 3D printer manages to tackle them all in elegant ways. This work appeared in the ACM Conference on Human Factors in Computing Systems (CHI) 2015. For more information, see the project page. Optimizing Product Images (2012-2014) With Tianqiang Liu, Wilmot Li, Thomas Funkhouser Another Adobe intern project. Tianqiang worked on optimizing the layout of furnishings in attempt to automatically generate product images in the style of catalogs (e.g. IKEA). Perhaps unsurprisingly, this required an optimization with quite a few terms in its objective function. That said, the results it produces are actually quite good (in a statistically-meaningful way). This work appeared in Computer Graphics Forum (Proceedings of Eurographics 2015). For more information, consult the project page. Dynamic Sprites (2012-2013) With Ben Jones, Jovan Popovic, Wilmot Li, Adam Bargteil This project (which began when Ben was an intern at at Adobe) describes a hybrid of traditional sprite sheets and physics-driven animation. These \"dynamic sprites\" try to keep their large-scale deformations close to an artist-authored pose manifold while allowing physics to control both their fine-scale deformations and overall trajectory. A paper describing this work appeared at the Motion in Games conference in November, 2013. For more information, see the project page. Physics Storyboards (2012-2013) With Sehoon Ha, C. Karen Liu, and Jovan Popovic In this intern project at Adobe, Sehoon designed a system for tuning physical (and pseudo-physical) simulations. Given a storyboard consisting of example behaviors and objective functions, this system is able to find parameters that optimize the objective, thus automatically tuning the game or simulation. We demonstrated this system on three games ranging from the classically-physical (an Angry Birds clone), to arcade-physics (a top-view racing game), to pseudo-physics (an RTS). This work appeared at Eurographics 2013. Project Page. Align and Distribute Behavior (2012-2018) Graphics programs provide align and distribute buttons that do something (often based on object bounding boxes), but does this thing match what people do? I performed a series of Mechanical Turk experiments to answer this question. In each experiment, turkers were asked to align an object horizontally or vertically with two other objects, or distribute the space between objects evenly. These experiments suggest that perpendicul",
  "content_length": 20811,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:46"
}