{
  "name": "Jim Laird",
  "homepage": "http://www.bath.ac.uk/comp-sci/contacts/academics/james_laird",
  "status": "success",
  "content": "James Laird - the University of Bath's research portal View Scopus Profile James Laird Dr Reader, Department of Computer ScienceMathematical Foundations of Computation https://orcid.org/0000-0002-3636-8937 Phone+44 (0) 1225 384438EmailJ.D.Lairdbath.acuk 1 WEST 4.64 Personal profile Research interestsResearch interests lie in and around denotational semantics: the interpretation of computer programs and logical proofs as mathematical objects, such as strategies for a game, functions between domains or morphisms in a category. Jim aims to use these representations to describe, constrain and reason about particular computational effects and control and data flow generally. Fingerprint Dive into the research topics where James Laird is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 2 Similar Profiles Denotational Semantics Computer Science 100% Programming Language Computer Science 100% Functional Languages Computer Science 88% Proof Computer Science 86% Calculus Mathematics 84% Call by Value Computer Science 63% Game Semantics Mathematics 46% Control Operator Computer Science 40% View full fingerprint Projects 6 Finished Projects per year Games and Differential Nets for Concurrent SystemsLaird, J. (PI), Guglielmi, A. (CoI), McCusker, G. (CoI) & Power, J. (CoI)The Royal Society1/08/15 → 30/11/17Project: Research council Semantic Types for Verified Program BehaviourLaird, J. (PI)Engineering and Physical Sciences Research Council28/02/14 → 31/07/17Project: Research council Programming Language 100% Denotational Semantics 95% Nondeterminism 78% Control Flow 65% Calculus 60% Sharing and Sequentiality in Proof Systems with LocalityGuglielmi, A. (PI), Bruscoli, P. (CoI), Laird, J. (CoI), McCusker, G. (CoI) & Power, J. (CoI)The Royal Society29/03/12 → 30/06/14Project: Research council Graph Models of Functional, Imperative and Logic ProgrammingMcCusker, G. (PI), Guglielmi, A. (CoI), Laird, J. (CoI) & Power, J. (CoI)The Royal Society20/01/11 → 31/01/14Project: Research council Semantic Structures for Higher-Order Information FlowLaird, J. (PI)Engineering and Physical Sciences Research Council20/06/10 → 19/06/12Project: Research council Programming Language 100% Calculus 57% Proof 40% lambda-calculus 34% Intuitionistic Logic 34% View all 6 projects Research output 22 Chapter in a published conference proceeding 21 Article 10 Book chapter 2 Paper 1 More 1 Conference article Research output per year Research output per year An Axiomatic Account of a Fully Abstract Game Semantics for General ReferencesLaird, J. & McCusker, G., 2 Aug 2023, Samson Abramsky on Logic and Structure in Computer Science and Beyond. Palmigiano, A. & Sadrzadeh, M. (eds.). Cham, Switzerland: Springer, Cham, p. 251-292 42 p. (Outstanding Contributions to Logic; vol. 25).Research output: Chapter or section in a book/report/conference proceeding › Book chapter Denotational Semantics 100% Finite Element Analysis 100% Proof 100% Dinaturality Meets Genericity: A Game Semantics of Bounded PolymorphismLaird, J., 28 Jun 2023, 8th International Conference on Formal Structures for Computation and Deduction, FSCD 2023. Gaboardi, M. & van Raamsdonk, F. (eds.). Schloss Dagstuhl- Leibniz-Zentrum fur Informatik GmbH, Dagstuhl Publishing, 33. (Leibniz International Proceedings in Informatics, LIPIcs; vol. 260).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Open Access Type Systems 100% Liveness 100% Polymorphic Type 50% Semantic Representation 50% Subtype Polymorphism 50% Revisiting Decidable Bounded Quantification, via DinaturalityLaird, J., 22 Feb 2023, In: Electronic Notes in Theoretical Informatics and Computer Science. 16 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Type Systems 100% Instantiation 50% Variable Abstraction 25% 36 Downloads (Pure) A Compositional Cost Model for the λ-calculusLaird, J., 29 Jun 2021, 2021 36th Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2021. IEEE, Vol. 2021-June. p. 1-13 9470567. (Proceedings - Symposium on Logic in Computer Science; vol. 2021-June).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Open AccessFile Call by Value 100% Constant Factor 100% Explicit Substitution 100% Random Access 100% 1 Citation (SciVal) 245 Downloads (Pure) Extensional and Intensional Semantics of Bounded and Unbounded NondeterminismLaird, J., 24 Nov 2021, In: Logical Methods in Computer Science. 17, 4, p. 11:1-11:37Research output: Contribution to journal › Article › peer-review Open AccessFile Nondeterminism 100% Sequential Algorithm 100% Functional Languages 33% lambda-calculus 33% Functional Program 33% 42 Downloads (Pure) View all 56 research outputs",
  "content_length": 4857,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:46"
}