{
  "name": "Jim Davies",
  "homepage": "http://www.cs.ox.ac.uk/jim.davies",
  "status": "success",
  "content": "Jim Davies | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyJim DaviesJim Davies Professor Jim Davies CITPProfessor of Computer Science (Software Engineering)Governing Body Fellow, Kellogg CollegeE: jim.davies@cs.ox.ac.ukT: 44 1865 283521 Room 461, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Computational Biology and Health InformaticsCompleted Projects:Cancer BioinformaticsSemantic Frameworksmore…InterestsJim directs a programme of advanced, professional education in software engineering, teaching advanced techniques to people working full-time in industry.  He is leading the development of semantics-driven technology for medical research and electronic governance, and a related programme of work into the automatic generation of systems from re-usable models of structure and functionality. BiographyJim studied mathematics at New College, Oxford, joining the Computing Laboratory (now Department of Computer Science) in 1986 for a Masters' and doctorate. After working as a researcher and lecturer in computer science, at Oxford and Reading, he became a lecturer in software engineering at Oxford in 1995. He has led the Software Engineering Programme since 2000, and was made Professor of Software Engineering in 2006. RolesView AllSBMF 2012: Brazilian Symposium on Formal Methods, NatalProgramme Committee, Steering GroupIFM 2012: Integrated Formal MethodsProgramme CommitteeRAISE 2012: Realising AI Synergies in Software Engineering, ZurichProgramme CommitteeSee alsoThe CancerGrid ProjectSelected PublicationsView AllManage publications The CancerGrid Experience: Metadata−Based Model−Driven Engineering for Clinical Trials Jim Davies‚ Jeremy Gibbons‚ Steve Harris and Charles Crichton In Science of Computer Programming. Vol. 89B. Pages 126−143. September, 2014. Details about The CancerGrid Experience: Metadata−Based Model−Driven Engineering for Clinical Trials | BibTeX data for The CancerGrid Experience: Metadata−Based Model−Driven Engineering for Clinical Trials | DOI (10.1016/j.scico.2013.02.010) | Download (pdf) of The CancerGrid Experience: Metadata−Based Model−Driven Engineering for Clinical Trials Machine Learning and Software Engineering in Health Informatics David A. Clifton‚ Jeremy Gibbons‚ Jim Davies and Lionel Tarassenko May, 2012. Details about Machine Learning and Software Engineering in Health Informatics | BibTeX data for Machine Learning and Software Engineering in Health Informatics | DOI (10.1109/RAISE.2012.6227968) | Download (pdf) of Machine Learning and Software Engineering in Health Informatics Model−driven Engineering of Information Systems: 10 years and 1000 versions Jim Davies‚ Jeremy Gibbons‚ James Welch and Edward Crichton In Science of Computer Programming. Vol. 89B. Pages 88−104. September, 2014. Details about Model−driven Engineering of Information Systems: 10 years and 1000 versions | BibTeX data for Model−driven Engineering of Information Systems: 10 years and 1000 versions | DOI (10.1016/j.scico.2013.02.002) ActivitiesSoftware EngineeringResearch InformaticsInformation ModellingCompleted ProjectsCancer BioinformaticsSemantic FrameworksIntegrative BiologyCancerGridEvolving Health InformaticsAccelerating Cancer Research Using Semantics-Driven TechnologyULICEHospital of the FutureModel-driven software developmentVaccines Data ManagementALIGNED Current Student Alastair McCullough Past Students Mohammed AboulsamhOwen  DwyerEamonn MaguireDavid MilwardAadya ShuklaJackie Wang Past Researcher James WelchAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 3802,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:43"
}