{
  "name": "Jim Hollan",
  "homepage": "http://hci.ucsd.edu/hollan",
  "status": "success",
  "content": "Professor Hollan FAQ Brief Bio Academic Vitae Requests to Meet Undergrads & Research Undergrad Honors Projects Letters of Recommendation Graduate Applicants to UCSD Advice to Students Slides (PDF) WEEKLY MEETINGS Department: Wed 12:00-2:00 Design Lab: Wed 2:00-3:00 Office Hour: Send email TRAVEL Nov 2023 - Dec 2023 Insitute for Advanced StudyParis, France UC San Diego, La Jolla, CA 92093 EMAIL: hollan@ucsd.edu PHONE: +1.858.534.8156 OFFICE: 362 Design and Innovation Building (DIB) LAB: 340 DIB J i m H o l l a n Distinguished Professor of Cognitive Science & Professor of Computer Science Founding Co-Director of Distributed Cognition and HCI Lab & UC San Diego Design Lab My research explores the cognitive consequences of computational media. It is motivated by a belief that we are at the beginning of a paradigm shift in thinking about representational media, one that is starting to appreciate the importance of representations that are not only dynamic and interactive but also adapt to the structure of tasks, the history and context of activities, and our relationships with others. My goal is to better understand the cognitive, computational, and social ecology of dynamic interactive adaptive systems. My interests span across cognitive design, distributed and embodied cognition, human-computer interaction, multiscale information visualization, multimodal interaction, cognitive ethnography, and software tools for design and visualization. My work involves four intertwined activities: developing theory and methods, designing representations, implementing prototypes, and evaluating their effectiveness to better understand the broader design space in which they are situated. Current research is funded by the National Science Foundation (NSF) and Microsoft Research. Recently completed research has been funded by California's Digital Media Innovation Program, Chancellor's Interdisciplinary Collaboratories Program, Darpa, Intel, Microsoft, Nissan, NSF, Sony, Toyota, and the UC MICRO Program. Honored to have received the ACM SIGCHI Lifetime Research Award in 2015. courses current academic year Fall 2023 No Class Winter 2024 Design 2: Designing Your Future Life Tues-Thur Spring 2024 Cognitive Science 10: Cognitive Consequences of Technology Tues-Thur recent research publications Visualization Psychology: Foundations for an Interdisciplinary Reserarch Programme. Amy R. Fox and James D. Hollan, Visualization Psychology, Editor Danielle Albers Szafir, book chapter in press, 2021. From Detectables to Inspectables: Understanding Qualitative Analysis of Audiovisual Data. Krishna Subramanian, Johannes Maas, Jan Borchers, and James D. Hollan. In Proceedings of the 2021 ACM Conference on Human Factors in Computing Systems, CHI 2021, ACM, May 2021. (Honorable Mention Award.) Towards a Dynamic Multiscale Personalized Information Space: Beyond Application and Document Centered Views of Information. Amy R. Fox, Philip Guo, Clemens Nylandsted Klokmose, Peter Dalsgaard, Arvind Satyanarayan, Haijun Xia and James D. Hollan, 4th International Conference on the Art, Science, and Engineering of Programming (’20), March 23–26, 2020, Porto, Portugal. Proceedings of the Convivial Computing Salon at PROGRAMMING 2020. https://doi.org/10.1145/3397537.3397542 When Graph Comprehension Is An Insight Problem. Amy R. Fox, Caren Walker, and James D. Hollan, Proceedings of the Annual Meeting of the Cognitive Science Society. Montreal, Canada, 330-336, 2019. Read It This Way: Scaffolding Comprehension for Unconventional Statistical Graphs Amy R. Fox and James D. Hollan, International Conference on Theory and Application of Diagrams, 40-47, 2018. https://doi.org/10.1007/978-3-319-91376-6_40 Exploration and Explanation in Computational Notebook. Adam Rule, Aurelien Tabard, and James D. Hollan, Proceedings of CHI 2018, ACM Conference on Human Factors in Computing Systems, 2018. Stories We Tell Ourselves: Using Visual Histories to Make Sense of Interrupted Activities. Adam Rule, Aurelien Tabard, and James D. Hollan, Human Computer Interaction, 511-558, 2017. Sharing, Human Values, and Computer Activity Tracking. Karen Boyd, Adam Rule, Aurelien Tabard, and James D. Hollan, Proceeding os ACM Computer Supported Cooperative Work and Social Computing , 233-236, 2016. Thinking in 4D. Adam Rule, Aurelien Tabard, and James D. Hollan, Proceeding of ACM Computer Supported Cooperative Work and Social Computing , 389-392, 2016. Traces: A Flexible Open-Source Activity Tracker for Workplace Studies. Adam Rule, Aurelien Tabard, and James D. Hollan, Workshop ACM Computer Supported Cooperative Work and Social Computing , 1-6, 2016. Hands that Speak: An Integrated Approach to Studying Complex Human Communicative Body Movements. Nadir Weibel, So-One Hwang, Stven Rick, Erfin. Sayyari, Dan Lenzen, and James D. Hollan, Proceedings of HICSS-49, Hawaii International Conference on System Sciences, Kauai, HI, USA, January 2016. Thinking with Computers. James D. Hollan, SIGCHI Lifetime Research Award, Proceeding of CHI'15, ACM Conference on Human Factors in Computing Systems, Seoul, Korea, 817-820, 2015. Restoring the Context of Interrupted Work with Desktop Thumbnails. Adam Rule, Aurelien Tabard, Karen Boyd, and James D. Hollan, Cognitive Science Society , 2045-2050, 2015. Gesture and Action Recognition. Nadir Weibel and James D. Hollan. Abstracts of ISGS 2014, International Society of Gestures Studies 6, San Diego, USA, July 2014. Panel on Sensing Technologies. Designing Audio-Enhanced Paper Photos for Older Adult Emotional Wellbeing Anne Marie Piper, Nadir Weibel, and James D. Hollan, International Journal of Human-Computer Studies, 629-639, 2014. Factors affecting physician-patient communication in the medical exam room Jennifer Lyons, Ram Dixit, Colleen Emmenegger, Nadir Weibel, and James D. Hollan. Proceedings of HCI International 2013, 15th International Conference on Human-Computer Interaction (Abstracts) Interpreter-Mediated Physician-Patient Communication: Opportunities for Multimodal Healthcare Interfaces Nadir Weibel, Colleen Emmenegger, Jennifer Lyons, Ram Dixit, Linda L. Hill, and James D. Hollan. Proceedings of PervasiveHealth 2013, International Conference on Pervasive Computing Technologies for Healthcare, Venice, Italy, May 2013. Multimodal Data Analysis and Visualization to Study Usability of Electronic Health Records Nadir Weibel, Shazia Ashfaq, Alan Calvitti, Zia Agha, and James D. Hollan. Proceedings of PervasiveHealth 2013, International Conference on Pervasive Computing Technologies for Healthcare, Venice, Italy, May 2013. Reifying Social Movement Trajectories Adam Fouse Nadir Weibel, Chris Johnson, and Jim Hollan. Proceedings of CHI'13, ACM Conference on Human Factors in Computing Systems, Paris, France, in press, 2013. (PDF) Interactive Space: A Framework for Prototyping Multitouch Interaction On and Above the Desktop Yang Liu, Nadir Weibel, and James D. Hollan. Proceedings of CHI 2013, ACM Conference on Human Factors in Computing Systems (Work-in-Progress), Paris, France, May 2013. Audio-Enhanced Paper Photos: Encouraging Social Interaction at Age 105 Anne Marie Piper, Nadir Weibel, and Jim Hollan. Proceedings of CSCW'13, ACM Conference on Computer Supported Cooperative Work and Social Computing, San Antonio, TX, USA, in press, 2013. (PDF) Activity-Enriched Computing: Capturing and Mining Activity Histories. James D. Hollan Computer, 84-87, 2012. Microanalysis of Active Reading Behaviors to Inform Design of Interactive Desktop Workspaces Matthew Hong, Anne Marie Piper, Nadir Weibel, Simon Olberding, and James D Hollan. Proceedings of ITS12, ACM Conference on Interactive Tabletops and Surfaces, Cambridge, MA, USA, 215-224, 2012. (PDF) TraumaPen: A Paper-Digital Interface for Information Capture and Display in Time-Critical Medical Work Aleksandra Sarcevic, Nadir Weibel, James D. Hollan and Randall Burd, Proceedings of PervasiveHealth 2012, International Conference on Pervasive Computing Technologies for Healthcare, San Diego, CA, USA, 17-24, 2012. (PDF) Digital Pen and Paper Practices in Observational Research Nadir Weibel, Adam Fouse, Colleen Emmenegger, Whitney Friedman, Edwin Hutchins, and James D. Hollan. Proceedings of CHI 2012, ACM Conference on Human Factors in Computing Systems, Austin, TX, USA, 1331-1340, 2012. (PDF) TAP & PLAY: An End-User Toolkit for Authoring Interactive Pen and Paper Language Activities Anne Marie Piper, Nadir Weibel, and James D. Hollan Proceedings of CHI 2012, ACM Conference on Human Factors in Computing Systems, Austin, TX, USA, 149-158, 2012. (PDF) TAP & PLAY: An End-User Toolkit for Authoring Interactive Pen and Paper Language Activities Anne Marie Piper, Nadir Weibel, and James D. Hollan Extended Abstracts (Interactivity) of CHI 2012, ACM Conference on Human Factors in Computing Systems, Austin, TX, USA, 2012. (PDF) Using Overlays to Support Collaborative Interaction with Display Walls Arvind Satyanarayan, Nadir Weibel and James D. Hollan.Proceedings of IUI 2012, International Conference on Intelligent User Interfaces, Lisbon, Portugal, 105-108, 2012. (PDF) A Pen-Based Toolkit for Authoring Collaborative Language Activities Anne Marie Piper, Nadir Weibel and James D. Hollan.Extended Abstracts of CSCW 2012, Seattle, USA,, 269-270, 2012. (PDF) Write-N-Speak: Authoring Multimodal Digital-Paper Materials for Speech-Language Therapy, Anne Marie Piper, Nadir Weibel, and James D. Hollan. Transactions on Accessible Computing (TACCESS), 1-20, 2011. (PDF) Supporting Medical Communication for Older Patients with a Shared Touch-Screen Computer Anne Marie Piper and James D. Hollan. International Journal of Medical Informatics, in press, 2011. (PDF) Ubiquitous Sketching for Social Media Lisa L. Cowan, Nadir Weibel, Laura Pina, William G. Griswold, and James D. Hollan. Proceedings of MobileHCI, in press, 2011. (PDF) Supporting an Integrated Paper-Digital Workflow for Observational Research Nadir Weibel, Adam Fouse, Edwin Hutchins, and",
  "content_length": 17649,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:45"
}