{
  "name": "Jim Buffenbarger",
  "homepage": "https://www.boisestate.edu/coen-cs/people/faculty/jim-buffenbarger",
  "status": "success",
  "content": "Jim Buffenbarger, Ph.D. - Computer Science Skip to main content Computer Science People Faculty Jim Buffenbarger, Ph.D. Jim Buffenbarger, Ph.D. Jim Buffenbarger, Ph.D. Associate Professor Visit Jim’s website CCP 258 Call: (208) 426-5766 buff@cs.boisestate.edu Visit Jim’s website About Jim Buffenbarger Education Publications Areas of Interest Education Ph.D., Computer Science, University of California, Davis. December 1990. Dissertation: Equational Specification and Verification of Concurrent Systems. Advisors: Dr. Gene Fisher, Dr. Ron Olsson, and Dr. Myla Archer. Master of Science, Computer Science, San Jose State University. December 1985. Specialization: Microprocessors and Microcomputers. Thesis: RACL: A Threaded Interpretive Language for Robot Arm Control. Advisor: Dr. Rajinder Loomba. Bachelor of Science, Computer Science, California State University, Hayward. Minor in Mathematics. December 1982 Lower-Division Study, Computer Science, Diablo Valley Community College, Pleasant Hill, California. 1978–1980 Publications Jim Buffenbarger and Kirk Gruell. A Language for Software Subsystem Composition. In 34th Hawaii International Conference on System Sciences (HICSS-34), 2001. Jim Buffenbarger and Kirk Gruell. A Branching/Merging Strategy for Parallel Software Development.In InProceedings of the 9th International Symposium on System Configuration Management (SCM-9), pages 86-99. Springer, 1999. Also: Lecture Notes in Computer Science #1675. Jim Buffenbarger and Kirk Gruell. What Have You Done for Me Lately? (Branches, Merges, and Change Logs). In Proceedings of the 7th International Workshop on Software Configuration Management (SCM-7), pages 18-24. Springer, 1997. Also: Lecture Notes in Computer Science #1235. Jim Buffenbarger. A Software Tool for Maintaining File and Macro Build Dependencies. Journal of Software Maintenance, 8(6):421-431, November-December 1996. Jim Buffenbarger. A Tool for Maintaining Software-Build Dependencies. In Proceedings of the International Conference on Software Maintenance, Industry Track, 1996. Jim Buffenbarger. A href=”http://cs.boisestate.edu/~buff/publications/hpjrnl96/abstract.html”>Interface Translation: Reuse of Assembly-Language Modules in a Two-Language Environment. Hewlett-Packard Journal, 47(3):76-81, June 1996. Jim Buffenbarger. A Tool for Maintaining Software-Build Dependencies (Design Document). Technical report, Hewlett-Packard, 1995. Jim Buffenbarger. DEP: A Tool for Maintaining Software-Build Dependencies (Users’ Manual). Technical report, Hewlett-Packard, 1995. Jim Buffenbarger. Syntactic Software Merging. In Proceedings of the 5th International Workshop on Software Configuration Management (SCM-5), pages 153-172. Springer, 1995. Also: Lecture Notes in Computer Science #1005. Jim Buffenbarger. Remote ClearTool Users’ Guide. Technical report, Hewlett-Packard, 1993. Jim Buffenbarger. Software Configuration Management at Hewlett-Packard’s Boise Printer Laboratories. Technical report, Hewlett-Packard, 1992. Jim Buffenbarger. Interobject Message Passing for Large Equational Specifications. In Software Engineering Research Forum (accepted for poster session), 1992. Jim Buffenbarger and Gene Fisher. Specification and Verification of Concurrency in OBJC. Technical Report CSE-90-5, Division of Computer Science, UC Davis, 1990. Areas of Interest Software Engineering Programming Languages Programming Language Translators Computer Science computerscience@boisestate.edu (208) 426-5766 City Center Plaza (CCP), RM 364 Back To Top",
  "content_length": 3525,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:41"
}