{
  "name": "Jim Alves-Foss",
  "homepage": "http://www.uidaho.edu/engr/departments/cs/our-people/faculty/jim-alves-foss",
  "status": "success",
  "content": "Department of Computer Science and Cybersecurity | University of Idahoskip to main contentskip to footerComputer ScienceMenuEngineeringAcademicsStudent successOur PeopleNews and eventsEngineering OutreachResearchPartnershipsLead in AI, cybersecurity and roboticsBecome a leader in our rapidly evolving tech landscape and tackle modern computing challenges — from software development to cybersecurity — with a strong emphasis on hands-on learning and real-world applications.University of Idaho's Department of Computer Science will put you at the forefront of technological innovation. You’ll explore cutting-edge advancements in computer science, artificial intelligence and cybersecurity in a dynamic, interactive learning environment.The department offers undergraduate and graduate computer science and cybersecurity programs on campus in Moscow and Coeur d’Alene and graduate programs in Idaho Falls. Distance learning courses are also available through Engineering Outreach.Ranked among the best computer science programs in the nationNational recognition has underscored the computer science department’s commitment to delivering high-quality, affordable programs. You’ll benefit from an undergraduate computer science program that’s recognized by U.S. News and World Report among the best undergraduate programs in the United States.Join the Department of Computer Science and Cybersecurity to make a difference in our world.Explore degreesExplore computer science and cybersecurity degrees and certificates.Find degreesFind degreesBuild the skills your employers are looking forPrepare yourself to lead in AI-driven technologies and solve problems in healthcare, agriculture, environmental monitoring and more. Work directly with state-of-the-art mobile and full-size robots used in a variety of applications. Train alongside professors and researchers who are nationally recognized for their expertise in cybersecurity.In this academic department, you’ll gain practical experience to build the skills employer's demand. You’ll learn to remain adaptable, innovative and capable of addressing evolving challenges in your field.ApplyJoin the Department of Computer Science and Cybersecurity to make a difference in our world.Apply todayApply todayAdvanced laboratory access and researchU of I computer scientists conduct pioneering research in areas such as artificial intelligence (AI), machine learning (ML), cybersecurity and data science. Faculty and students collaborate to solve real-world problems, develop innovative solutions in fields like healthcare, agriculture and environmental monitoring. This work drives technological advancements through practical applications.Explore our researchLearn more about how the Department of Computer Science is making an impact throughout Idaho.Explore our researchExplore our researchGet involved. Make friends. Find success.Connect with others who share your interests and values and demonstrate skills beyond the classroom. Join our Polymorphic Games Studio, Cyber Defense Club and Association for Computing Machinery.Our college also offers 20+ clubs and organizations tied to international and national engineering organizations, national competition teams, mentorship programs and professional skills programs.Student successExplore clubsBuild professional skillsFaculty mentorship and staff supportFaculty and staff in the Department of Computer Science are eager to meet you.Department of Computer ScienceSteve WangProfessor and Department Chair\tDaniel Conte de LeonAssociate Professor, Acting ChairRobert RinkerAssociate Professor, Associate ChairJim Alves-FossUniversity Distinguished ProfessorJoules BeestonClinical FacultyBruce BoldenSenior InstructorRobert HiromotoProfessorHasan JamilAssociate ProfessorConstantinos (Costas) KoliasAssociate ProfessorJohnny (Liujun) LiAssistant ProfessorMarshall (Xiaogang) MaAssociate Professor, Dean's Distinguished FellowBhaskar RimalAssistant ProfessorFrederick “Rick” SheldonProfessorJohn ShovicResearch Faculty; Director of the Center for Intelligent Industrial RoboticsJia SongAssociate ProfessorTerry SouleProfessorAlex VakanskiAssociate ProfessorMichael WilderClinical Faculty Assistant ProfessorMin XianAssociate ProfessorBoyu ZhangAssistant ProfessorClose AllStudent services staff Arleen FuredyAdministrative CoordinatorJanssen 236208-885-1503arleen@uidaho.eduCampus: MoscowTammy St John-TeskyAdministrative CoordinatorHedlund Building 202208-292-2509tammy@uidaho.eduCampus: Coeur d'AleneOur computer science and cybersecurity storyExplore stories and news articles about our current students and employees and their achievements in the Department of Computer Science and Cybersecurity.Read about our departmentRead about our departmentYour degree is accreditedThe Computer Science B.S.C.S. program is accredited by the Computing Accreditation Commission of ABET, under the commission’s general criteria and program criteria for Computer Science and Similarly Named Computing Programs. Learn about accreditation.Cybersecurity program seeking initial ABET accreditation The Cybersecurity B.S. program is currently seeking initial accreditation from ABET. To meet the requirements of an accredited program, we are guided by a set of Program Educational Objectives and a set of Student Outcomes that frame the course offerings and curriculum requirements. Close AllCybersecurity Program Educational ObjectivesWithin a few years of graduation graduates of the program will be advancing in their chosen career path and benefiting society by:identifying, formulating, and solving cybersecurity problems through application of their knowledge of mathematics, computer science, cybersecurity, and the scientific method in their chosen career path, and will be continuing to expand their awareness of the role of cybersecurity in multiple disciplines;will be capable of specifying the requirements of a secure computing system and of modeling, designing, implementing and verifying secure computing systems to meet specified requirements and real-world constraints;communicating effectively with team members, constituents, and/or the public;continuing the process of life-long learning by further extending their knowledge and professional capabilities;contributing to society through active engagement with professional societies, schools, civic organizations or other community activities; Cybersecurity Student OutcomesThe Student Outcomes for the cybersecurity program are that upon graduation, students will have:Analyze a complex computing problem and apply principles of computing and other relevant disciplines to identify solutions.Design, implement, and evaluate a computing-based solution to meet a given set of computing requirements in the context of the program’s discipline.Communicate effectively in a variety of professional contexts.Recognize professional responsibilities and make informed judgments in computing practice based on legal and ethical principles.Function effectively as a member or leader of a team engaged in activities appropriate to the program’s discipline.Apply security principles and practices to maintain operations in the presence of risks and threats.",
  "content_length": 7200,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:41"
}