{
  "name": "Jim Demmel",
  "homepage": "https://www.cs.berkeley.edu/~demmel",
  "status": "success",
  "content": "Homepage for James Demmel James Demmel Professor of the Graduate School, in Mathematics and Computer Science Dr. Richard Carl Dehmel Distinguished Professor Emeritus Former EECS Department Chair Former CS Division Chair Former Chief Scientist of CITRIS, the Center for Information Technology Research in the Interest of Society Office: 564 Soda Hall (also known as \"Virginia\") 831 Evans Hall Computer Science Division Department of Mathematics University of California at Berkeley Berkeley CA 94720-1776 Email: demmel@berkeley.edu Office: (510) 643-5386 Administrative Assistant for Research Matters: Tammy Chouteau Office: 565 Soda Hall (also known as \"Hilgard\") Email: tamille@berkeley.edu Telephone: (510)643-4816 Grants Administrator: Miriam Kader Email: mkader@berkeley.edu Teaching: Graduate Designated Emphasis in Computational and Data Science and Engineering (CSE) Teaching for Spring 2025 Ma55, Discrete Mathematics , T Th 3:30-5, 10 Evans Office Hours: M 1-2 (changed) and F 11-12 in 564 Soda (ring the doorbell to get into the SLICE Lab) CS267, Applications of Parallel Computers, T Th 11-12:30, 306 Soda Office Hours: F 9-10 and F 11-12 in 564 Soda (ring the doorbell to get into the SLICE Lab) Teaching for Fall 2024 Ma221, Matrix Computations, T Th 12:30-2, 241 Cory Office Hours: W 10-11 and F 11-12 (starting Aug 28) in 567 Soda (ring the doorbell to get into the SLICE Lab) Teaching for Spring 2024 CS267, Applications of Parallel Computers, T Th 11-12:30, 306 Soda Office Hours: T 1-2 (starting Jan 23) and F 12-1 in 567 Soda (ring the doorbell to get into the SLICE Lab) Teaching for Fall 2023 Ma221, Matrix Computations, MWF 2-3pm, 102 Wheeler Office Hours, T Th 1-2pm in 567 Soda Hall (ring doorbell to get into SLICE Lab) Teaching for Spring 2023 Ma55, Discrete Mathematics , MWF 3-4, 105 Stanley Office Hours: T 12-1 in 831 Evans, Th 1-2 in 567 Soda (ring the doorbell to get into the SLICE Lab)) CS267, Applications of Parallel Computers, T Th 8-9:30, 306 Soda Office Hours: T 1-2 in 831 Evans, Th 12-1 in 567 Soda (ring the doorbell to get into the SLICE Lab) Teaching for Fall 2022 CS170, Efficient Algorithms and Intractable Problems, T Th 9:30-11, 245 Li Ka Shing Office Hours, Th 11:30-12:30 in 564 Soda Hall (ring doorbell to get into SLICE Lab) Teaching for Spring 2022 Ma221, Matrix Computations, T Th 8-9:30 CS267, Applications of Parallel Computers, T Th 11-12:30 Office Hours: M 2-3, W 9-10 and F 10-11; on line through Jan 28, in 567 Soda Hall after that. Teaching for Spring 2021 CS170, Efficient Algorithms and Intractable Problems, T Th 9-10:30, on-line CS267, Applications of Parallel Computers, T Th 11-12:30, on-line Office Hours: W 2:30-3:30 (changed), F 11-12 ( Change: W 10-11 cancelled) (We will begin the semester without designating which office hours are for CS267 and which are for CS170, but can change this depending on how it works.) Office Hours cancelled on Mar 19. Teaching for Fall 2020 Ma221, Matrix Computations, T Th 11-12:30, on-line Office Hours: Changed (9/28): T 11-12, W 2-3, F 11-12 on-line Teaching for Spring 2020 CS267, Applications of Parallel Computers, T Th 11-12:30, 306 Soda Ma221, Matrix Computations, T Th 8-9:30, 310 Hearst Mining Office Hours: M 2-3, W 10-11, F 2-3, in 569 Soda Hall Teaching for Spring 2018 CS267, Applications of Parallel Computers Fall 2016 Office Hours: W 8:30-9:30 in 389 Soda Hall Teaching for Spring 2016 CS267, Applications of Parallel Computers Math 221, Matrix Computations CS294-76/Ma270-1, Communication-Avoiding Algorithms Office hours: M 9-10, T 9-10 and F 1:30-2:30, in 564 Soda Hall Fall 2015 - On Sabbatical Guest lecture on Communication-Avoiding Algorithms for Linear Algebra and Beyond, Sept 22, 11-12:30pm, 320 Soda, for CS294, on \"Randomized Algorithms in Linear Algebra\" Teaching for Spring 2015: Reading Group on Randomized Numerical Linear Algebra Tuesdays 2-3 in 540AB Cory Hall Lecture notes for Feb 24 We will be video capturing the presentations for live webcast and archiving on youtube. We will post more detailed instructions later, but for Feb 24, click here Lecture notes for Mar 3 The video from Mar 3 will be available here The video from Mar 17 will be available here For later video links, click here The video from Apr 7 will be available here CS267, Applications of Parallel Computers This course will also be broadcast on-line by XSEDE. For an introduction to the on-line version, see pptx or pdf Teaching for Fall 2014: Math 221, Matrix Computations Teaching for Spring 2014: CS267, Applications of Parallel Computers Teaching for Fall 2013: Math 16B, Analytic Geometry and Calculus Teaching for Spring 2013: CS 267, Applications of Parallel Computers and Math 16B, Analytic Geometry and Calculus Teaching for Spring 2012: CS 267, Applications of Parallel Computers Teaching for Fall 2011: CS 170, Efficient Algorithms and Intractable Problems, Ma 221, Matrix Computations, and CS 294, Communication-Avoiding Algorithms Teaching for Spring 2011: CS 267, Applications of Parallel Computers and CS 70, Discrete Mathematics and Probability Theory Teaching for Fall 2010: Math 221, Matrix Computations Teaching for Spring 2010: CS 267, Applications of Parallel Computers and CS 170, Efficient Algorithms and Intractable Problems Teaching for Fall 2009: Math 221, Matrix Computations Teaching for Spring 2009: CS 267, Applications of Parallel Computers Teaching for Fall 2008: Math 16A, Analytic Geometry and Calculus Guest Lectures for Spring 2008: CS 267, Applications of Parallel Computers Teaching for Fall 2007: Math 55, Discrete Mathematics Guest Lectures for Spring 2007: CS 267, Applications of Parallel Computers Teaching for Spring 2007: CS 170, Efficient Algorithms and Intractable Problems Teaching for Spring 2006: CS 267, Applications of Parallel Computers Teaching for Fall 2005: Math 110, Linear Algebra Teaching for Spring 2005: CS 267, Applications of Parallel Computers Teaching for Fall 2004: Math 221, Matrix Computations Teaching for Spring 2004: Math 55, Discrete Mathematics Teaching for Spring 2002: Math 128a, Numerical Analysis Teaching for Spring 2001: CS 170, Efficient Algorithms and Intractable Problems (co-taught by Prof. Jonathan Shewchuk) Teaching for Fall 2000: Math 55, Discrete Mathematics Teaching for Fall 1999: CS 170, Efficient Algorithms and Intractable Problems Teaching for Fall 1999: Math 221, Matrix Computations Teaching for Spring 1999: CS 267, Applications of Parallel Computers Teaching for Fall 1998: Math 128a, Numerical Analysis Teaching for Spring 1998: CS 170, Efficient Algorithms and Intractable Problems Teaching for Fall 1997: Math 221, Matrix Computations Selected Awards: American Academy of Arts and Sciences, 2018 SIAG on Supercomputing Best Paper Prize, 2016 (with L. Grigori, M. Hoemmen, J. Langou) American Association for the Advancement of Science, Fellow, 2015 ACM Paris Kanellakis Theory and Practice Award, 2014 IPDPS Charles Babbage Award, 2013 AMS Fellow, 2012 SIAG on Linear Algebra Prize (2012, with G. Ballard, O. Holtz. O. Schwartz; 1991, with W. Kahan; 1988) National Academy of Sciences, 2011 Sidney Fernbach Award, 2010 SIAM Fellow, 2009 Distinguished Alumnus Award in Computer Sciences and Engineering, UC Berkeley, 2004 Invited Speaker, International Congress on Industrial and Applied Mathematics (ICIAM), 2003 Invited Speaker, International Congress of Mathematicians (ICM), 2002 IEEE Fellow, 2001 National Academy of Engineering, 1999 ACM Fellow, 1999 NSF-CBMS Lecturer on Parallel Numerical Linear Algebra, San Francisco, 1995 J. H. Wilkinson Prize in Numerical Analysis and Scientific Computing, 1993 Presidential Young Investigator Award, 1986 IBM Faculty Development Award, 1985 Research Projects See the Bebop (Berkeley Benchmarking and OPtimization Group) webpage for the most-up-to-date list of projects and publications. The New BLAS Standard. The BLAS (Basic Linear Algebra Subroutines) Standards Committee has reconvened to consider adding new functions requested by different user communities, including batched BLAS (eg many small or medium sized matrix multiplications done at once), low precision BLAS, and reproducible BLAS (bitwise reproducible results, independent of number of processors, summation order, etc). Presentations from Feb 2017 meeting Presentations from May 2016 meeting Draft Proposal for a Next-Generation BLAS (comments welcome, may be inserted in google doc) Draft Checking and Reporting Exceptions in the BLAS (comments welcome, may be inserted in google doc) Communication-Avoiding Algorithms Tutorial slides for Supercomputing'16 Australian Math Society Plenary Lecture (Sep 28, 2015) and UC Berkeley Math Colloquium (Oct 1, 2015), in pptx or pdf Tutorial slides for Supercomputing'14 The following talks (given at U. Wisconsin-Madison) survey our work in this field as of September 2013: Communication Avoiding Algorithms for Linear Algebra and Beyond (pptx) Implementing Communication Avoiding Algorithms (pptx) Communication Lower Bounds and Optimal Algorithms for Programs that Reference Arrays (pdf) Keynote talk at IPDPS'13 (1 hour), 22 May 2013, in pptx The following talks survey our work in this field as of November 2012, in 3 different formats (45 minutes, 1 hour, and 1.5 hours): Invited talk at Supercomputing'12 (45 minutes): in pptx or pdf Presentations at RPI, IBM Yorktown Heights and NYU (1 hour): in pptx or pdf Tutorial and Workshop at Supercomputing'12 (1.5 hours): in pptx or pdf Technical reports and papers Cornell University presentation (on 12/2/10) (in (ppt)) (in (pdf)) Sidney Fernbach Award presentation (pdf) 10 hour short course (slides and video), taught in June 2010 at the Gene Golub SIAM Summer School 2010 Power point presentation at the 2009 SIAM Applied Linear Algebra Meeting, Longer version (ppt) presented at ACM Colloquium, Caltech, Nov 9 2009 Older presentation (ppt) from Householder Meeting in June 2008 The ASPIRE project (Algorithms and Specializers for Provably Optimal Implementations with Resi",
  "content_length": 20641,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:45"
}