{
  "name": "Jiming Liu 0001",
  "homepage": "http://www.comp.hkbu.edu.hk/~jiming",
  "status": "success",
  "content": "Jiming Liu: AI & Machine Learning, Complex Systems & Autonomy-Oriented Computing, and AI for Social Good Jiming Liu BSc, MA, MEng, PhD, IEEE Fellow Chair Professor in Computer Science Associate Vice-President (Research Development) HONG KONG BAPTIST UNIVERSITY Department of Computer Science Kowloon Tong, Hong Kong SAR Phone: (852) 34117088   Email: jiming{at}hkbu.edu.hk Professor Jiming Liu is a Chair Professor in Computer Science (since 2010) and the Associate Vice-President (Research Development) at Hong Kong Baptist University (HKBU), where he and his team conduct funded research on AI, Multi-Agent Autonomy-Oriented Computing and Machine Learning, as well as Computational/Systems Epidemiology, while at the same time engaging the real-world challenges/initiatives of AI and Data Science-enabled disease prevention. Professor Liu is a Fellow of the IEEE (Institute of Electrical and Electronic Engineers), since 2011, for his research contributions to Multi-Agent Autonomy-Oriented Computing (AOC) and Web Intelligence (WI).  He was a recipient of the Chinese Association for Artificial Intelligence (CAAI) WU Wen-Jun Artificial Intelligence Science and Technology Award in 2017, and the HKBU President's Award for Outstanding Performance in Scholarly Work in 2007.  Professor Liu has delivered Invited Talks at numerous international conferences, including the International Joint Conference on Artificial Intelligence (IJCAI ’03). Professor Liu earned his PhD and Master of Engineering degrees in Electrical Engineering, both from McGill University (with Centre for Intelligent Machines), Canada.  He joined HKBU in late 1993, and served as the Associate Vice-President (Research; Research Development) (2017-2019; 2022-present), the Dean of the Faculty of Science (act.2015-2017; 2021-2023), the Associate Dean of Science (Research) (2011-2017), and the Head of the Department of Computer Science (2003-2011).  He was the Director and Tenured Professor of the School of Computer Science at the University of Windsor, Canada, in 2006-2007, and was a Visiting Scholar in Stanford AI Lab (SAIL), Department of Computer Science, Stanford University, USA, in 1999 (Sabbatical). Short Biography  (English) (Chinese) Areas of Research Artificial Intelligence and Machine Learning Multi-Agent Autonomy-Oriented Computing (AOC) and Web Intelligence (WI) Complex Systems and Complex Networks Health Informatics and Computational Epidemiology Publications Research Articles:  Google Scholar | DBLP | PubMed Authored Monographs and Edited Volumes:  Amazon.com Impact Case (RAE 2020):  Overview | Study Lectures for Future AI Researchers On Nature (Philosophy) of Research On Methodology (Science) of Research On Practice (Impact) of Research On Advancement (Evolution) of Research The Takeaway Message",
  "content_length": 2803,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:46"
}