{
  "name": "Jimmy Lin",
  "homepage": "https://cs.uwaterloo.ca/~jimmylin",
  "status": "success",
  "content": "Jimmy Lin » Homepage Jimmy Lin University of Waterloo Home Publications Students About Me I'm a Professor and hold the David R. Cheriton Chair in the David R. Cheriton School of Computer Science at the University of Waterloo. Previously, I was at the University of Maryland. I completed my Ph.D. in Electrical Engineering and Computer Science at MIT in 2004. My research aims to build tools that help users make sense of large amounts of data. I work at the intersection of information retrieval, natural language processing, and data management. I'm passionate about translating research into real-world impact. Presently, I serve as the Chief Scientist of Primal, a Waterloo-based company focused on building enterprise-grade AI solutions that exploit the best of what neural networks and knowledge graphs have to offer. Previously, I was the Chief Scientist of RSVP, a Waterloo-based startup that builds deep natural language understanding technologies to facilitate seamless dialogues between users and systems. From 2010-2012, I spent an extended sabbatical at Twitter working on services designed to identify relevant content to users (search, recommendation, etc.) and analytics infrastructure to support data science (Hadoop tools, machine learning libraries, etc.). Follow me on Twitter (ops, I mean X!) here! I've also worked for Cloudera: In 2009, I was responsible for helping them build out a training and certification program; in fact, I wrote their very first certification exam! I'm a Fellow of the ACM, a member of the SIGIR Academy, and a Fellow of the ACL. Interesting tidbit: Friedrich Leibniz was my (grand-14)advisor. Contact Information Jimmy Lin David R. Cheriton School of Computer Science University of Waterloo 200 University Avenue West Waterloo, ON N2L 3G1 Canada Old links: Projects, Teaching, Resources Copyright © Jimmy Lin. Last updated: Adapted from a WordPress Theme by NeoEase. Valid XHTML 1.1 and CSS 3. keywords: Jimmy Lin, information retrieval (IR), natural language processing (NLP), big data, MapReduce, Hadoop, large-scale distributed systems, data-intensive text processing, question answering",
  "content_length": 2138,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:49"
}