{
  "name": "Jin-Hee Cho",
  "homepage": "http://people.cs.vt.edu/~jicho",
  "status": "success",
  "content": "Homepage of Jin-Hee Cho Welcome to Trustworthy Cyberspace Lab (tClab) Courses CS 6804 Advanced Topics on Computational Social Science for Cybersecurity (Graduate Course; Spring'2023) CS 5914 Decision Making Under Uncertainty (Graduate Course; Fall'2022) CS 6804 Advanced Topics on Game Theoretic Cybersecurity (Graduate Course; Spring'2021) CS/ECE 5584: Network Security (Graduate Course; Fall'2019-2021, Fall 2023) CS 5114: Theory of Algorithms (Graduate Course; Spring'2020, Spring'2022; Fall'2018; Summer'2012-2015) CS 6204: Advanced Topics in Network Science (Graduate Course; Spring'2019, Summer'2016) Publications (Full List & Google Scholar) Recent Services Editorial Board Editorial Board, Associate Editor, IEEE Transactions on Services Computing (IEEE Communications Society; Impact Factor 5.823 in 2020), 2021 - current Editorial Board, Associate Editor, IEEE Transactions on Network and Service Management (IEEE Communications Society; Impact Factor 3.878 in 2019-2020), 2019 - current Editorial Board, Associate Editor, The Computer Journal (Oxford Academic; 2020 Impact Factor 1.494), 2016 – 2021 Selected (Co)Chairs or Technical Program Committee (TPC) Program Co-Chair, The First AAAI Workshop on Uncertainty Reasoning and Quantification in Decision Making (UDM-AAAI-23), co-located with Thirty-Seventh AAAI Conference on Artificial Intelligence (AAAI'2023), Feb. 2023. Program Co-Chair, The Second Workshop on Uncertainty Reasoning and Quantification in Decision Making, co-located with The 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), Aug. 2023. Program Co-Chair, 26th IEEE Pacific Rim International Symposium on Dependable Computing (PRDC 2021) 2021 TPC, 2023 IEEE International Conference on Big Data (IEEE BigData 2023) TPC, The 17th ACM ASIA Conference on Computer and Communications Security (ACM AsiaCCS 2022-23) TPC, The 42nd IEEE International Conference on Distributed Computing Systems (ICDCS 2022-23) TPC, The 36th AAAI Conference on Artificial Intelligence (AAAI 2022) TPC, Annual Computer Security Applications Conference (ACSAC 2019-2023) TPC, TPC, IEEE Conference on Cognitive and Computational Aspects of Situation Management (CogSIMA 2014 -- 2023) TPC, IARIA The Thirteenth International Conference on Emerging Security Information, Systems and Technologies (SECURWARE 2020) TPC, The 20th World Conference on Information Security Applications (WISA 2019 - 2020) TPC, IEEE Military Communications Conf. (MILCOM 2019) TPC, The IEEE/ACM Int'l Conf. on Social Network Analysis and Mining (ASONAM 2019) TPC, The 20th World Conference on Information Security Applications (WISA 2019) TPC, IEEE Conference on Communications and Network Security (CNS 2019) TPC, IEEE CogSIMA, 2019 TPC, IEEE SecDev, 2019 Funded Projects at Virginia Tech (For more details, click the current research of interest) External Funding Lead PI with PI Paulo Costa (GMU), Agency for Defense Development (ADD), Republic of Korea (South Korea), ``DALNIM: Dependency-based Assessment of Litigious Network events Impacting the Mission'' (Total $260K; VT/My share: $175K; $85K for GMU as a subawardee; 05/01/2022 -- 04/30/2023) Co-PI with the lead PI Peter Beling (VT, Hume Center), Old Dominion University and Norfolk State University collaborators, Funding Program of Virtual Institutes for Cyber and Electromagnetic Spectrum Research and Employ (VICEROY), ``Cybersecurity Research and Advanced Training of ROTC Students (CREATORS),'' (Total: $1,487,269; VT: $812,269; My share: $62,025; 12/25/2021 - 12/24/2023). Lead PI with Co-PI Hoda Eldardiry (CS, VT), PI Hongyi Wu (ODU), and Co-PI Rui Ning (ODU), The Commonwealth Cyber Initiative (CCI) Collaboration Funding Program, ``Deep Resilience for Multifaceted Federated Learning in Internet-of-Everything'' (Total $125K; VT: $75K; My share: $40K; 12/25/2021-12/24/2022) Co-PI with lead PI Dong S. Ha (ECE, VT), PI Swarun Kumar (ECE, CMU) and Co-PI Robin White (Animal and Poultry Science, VT), NSF CNS: Medium: ``Energy Centric Wireless Sensor Node System for Smart Farms'' (Total $750K; VT: $573,750; My share: $191,108; 10/01/2021-09/30/2025) PI with lead PI Feng Chen (UTD) and PI Dong Hyun Jeong (UDC), NSF III: Medium: ``Multidimensional Uncertainty-Aware Deep Learning Framework'' (Total $1.2M; My share: $500K; 10/01/2021-09/30/2025) PI, ARO: ``Uncertainty-Aware Deep Reinforcement Learning-based Defense for Resilient Cyber-Physical Systems'' (Total/VT/My share: $240K; 05/01/2021 - 04/30/2024) PI with co-PI Munindar Singh (CS, North Carolina State University): Army Research Office (ARO): ``Foureye: Cyber Defensive Deception based on Hypergame Theory for Tactical Networks'' (Total $285K; VT/My share: $190K; 05/2020-4/2023) PI with lead PI Hongyi Wu (ODU) et al., The Commonwealth Cyber Initiative (CCI): ``Backdoor Detection and Mitigation in Deep Neural Networks'' (Total $184,816; VT/My share: $48,284; 05/2021-04/2022) Co-PI with PI Hwajung Lee (Radford University) and other 5 VT Co-PIs, The Commonwealth Cyber Initiative (CCI): ``5G Enabled Smart Farms through Secure and Intelligent Wireless Sensors'' (Total $20K; VT: $10K; My share: $1,667; 01/2021-06/2021) Co-PI with PI Dong S. Ha (ECE, VT) and Co-PI Robin White (APS, VT): FY20 Southwest Virginia Collaboration Grant Proposal sponsored by The Commonwealth Cyber Initiative (CCI) Southwest Virginia Node Institutions: ``Secure Wireless IoT Sensors for Smart Farms,'' (Total $20K; My share: $6.7K; 07/2020 - 12/2020) Internal Funding Co-PI with PI Dong S. Ha (ECE, VT) and Co-PI Robin White (APS, VT): Internal Funding; ICTAS EFO Opportunity Seed Investment Grant: ``Secure Wireless IoT Sensors for Smart Farms'' (Total $10K; My share: $3.3K; 01/2021 - 06/2021) PI with PI Lifu Huang (CS, VT) and Co-PIs Kee Jeong Kim (Human Development and Family Science), Mary Beth Dunkenberger (Policy and Government), Lara Nagle (Policy and Government), Internal Funding, ISDA-ISERC (Integrated Security Destination Area-The Integrated Security Education and Research Center) research proposal entitled ``Building Youth Resilience to Cybergrooming: Transdisciplinary Prevention Approach'' (Total $10K; My share: $3K; 07/01/2021 - 06/31/2022) Selected Awards & Honors 2022 Dean's Awards for Excellence, Faculty Fellow, College of Engineering, Virginia Tech Team Award for the Cyber Strategic Challenge Group of TTCP (The Technical Cooperation Program) by DoD OUDS (R&E), Feb. 2019 Best Paper Award, IEEE CogSIMA 2018, June 2018 Best-In-Session Presentation Award, IEEE INFOCOM 2018, April 2018 Best Paper Award, IEEE GLOBECOM 2017, Dec. 2017 ARL’s Publication Award, Nov. 2016 2013 Presidential Early Career Award for Scientists and Engineers (PECASE), May 2016 The 2015 IEEE Communications Society William R. Bennett Prize in the Field of Communications Networking, Apr. 2015 Elevation to IEEE Senior Member, Aug. 2014 Best Paper Award, BRIMS 2013 Best Paper Award, IEEE TrustCom 2009 To the top",
  "content_length": 6933,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:53"
}