{
  "name": "Jin Ryong Kim",
  "homepage": "https://www.jessekim.com",
  "status": "success",
  "content": "Jin Ryong Kim About me I am an Assistant Professor in the Department of Computer Science and a Director of the Multimodal Interaction Lab (MI Lab, https://mi-lab.io) at the University of Texas at Dallas. My research strives to create novel haptics interactions to tackle technical and human factors' challenges to amplify human satisfaction through enriched user experience. My research goal is to establish an interdisciplinary research collaboration program to solve real-world challenges in haptics interaction and address issues in human perception and multimodalities in immersive environments.I received my Ph.D. in Electrical and Computer Engineering (Advisor: Dr. Hong Z. Tan) and an M.S. in Computer Science, both from Purdue University. I also received M.S. and B.S. in Electrical and Computer Engineering from Hanyang University, Seoul, Korea. Prior to the current position, I was a Staff Researcher at Alibaba Group in Sunnyvale, California, and a Senior Researcher at the Electronics and Telecommunications Research Institute (ETRI). I also worked at Microsoft Research Asia (Beijing, China), Samsung Advanced Institute of Technology (Yongin, Korea), and NHK Science and Technology Research Laboratories (Tokyo, Japan) as a research intern (CV). Research Area Human-Computer Interaction (UI/UX, interaction techniques, text entry, gestures, mobile, wearables) Tactile and Haptic Interaction (haptics interfaces, mid-air haptics, thermal, tactile Internet) Virtual Reality (multimodal interaction, holographic 3D interaction, interactive user interfaces) News (November 4, 2025) We now accept applications for the Spring 2026 Research Internship Opportunities. If you’re interested, please apply here: https://forms.gle/KZ59RRwb5K9d8JHPA (Deadline: Sunday, December 21). (September 17, 2025) Our UIST paper, HeatFlow: A Thermal-Tactile Display for Dynamic 2D Thermal Movements, has received the UIST 2025 Best Paper Honorable Mention Award (top 5%)! Congrats, Yatharth and Daniel! 🏆 (September 2, 2025) One paper has been accepted to ACM VRST 2025! Congratulations, Ayush, Ashish, Abbas, Yatharth, and Hyunjae! (August 20, 2025) We now accept applications for the Fall 2025 Research Opportunities at MI Lab. If you’re interested in gaining hands-on research experience in VR and HCI, please apply here: https://forms.gle/6p4pCErVa4ivTjp29 (Deadline: Sunday, September 7). (July 13, 2025) Dr. Kim will serve on the Program Committee for the IEEE Haptics Symposium 2026. (July 11, 2025) We received the Best Demo Award at the IEEE World Haptics Conference 2025! Congrats, Haokun, Yatharth, Hyunjae, and Daniel! 🏆 (July 9, 2025) Dr. Kim will serve as an Associate Chair for CHI 2026. (July 8, 2025) Dr. Kim will serve on the XR Committee for the SIGGRAPH Asia 2025. (July 4, 2025) One IMWUT paper has been accepted for publication in ACM IMWUT! Congratulations, Ayush and Ashish! (July 3, 2025) Two UIST papers have been accepted to ACM UIST 2025! Congratulations, Yatharth, Daniel, Ayush, Abbas, and Richard! (May 22, 2025) Dr. Kim will serve as Demo and Exhibits Co-Chair for IEEE Haptics Symposium 2026. (March 30, 2025) We now accept applications for the Summer/Fall 2025 Training Program at MI Lab. If you’re interested in gaining hands-on research experience in VR and HCI, please apply here: https://forms.gle/YMKxnj6EKReCzzYx6 (Deadline: Sunday, May 18). (March 26, 2025) Our paper, PropType: Everyday Props as Typing Surfaces in Augmented Reality, has received the CHI 2025 Best Paper Honorable Mention Award (top 5%)! Congrats, Hyunjae, Ashish, and Iniyan! 🏆 (March 21, 2025) Dr. Kim will serve as Workshop Co-Chair for the IEEE World Haptics Conference 2027. (February 25, 2025) Dr. Kim has received a prestigious NSF CAREER Award for Designing Next-Generation Thermal User Interfaces for Multisensory VR Experiences! Thanks to NSF for supporting this research on advancing thermal-tactile interactions for immersive computing! 🏆🏆 (January 16, 2025) One paper has been accepted to ACM CHI 2025! Congratulations, Hyunjae, Ashish, and Iniyan! (January 14, 2025) We are organizing the CHI 2025 Workshop on Opportunities and Challenges for XR Productivity Workstations. Submit your work here: https://sites.google.com/view/xr-phy-2025/home. (January 5, 2025) Dr. Kim will serve as an Associate Chair for UIST 2025. (December 6, 2024) Dr. Kim will serve as a Proceedings Co-Chair for UIST 2025. (November 14, 2024) We are now accepting applications for the Spring 2025 Training Program at MI Lab. If you’re interested in gaining hands-on research experience in VR and HCI, please apply here: https://forms.gle/sjoS4kjZeajzyYnr9 (Deadline: Sunday, December 15). (October 25, 2024) We received the Best Demo Award at the IEEE ISMAR 2024! Congratulations again, Yatharth, Daniel, and Haokun! What a month! 🏆 (October 18, 2024) Dr. Kim will serve as a Workshop/Tutorial Session Chair for UR2025. (October 17, 2024) We received the Best Demo Honorable Mention Award at the ACM UIST 2024! Congratulations to Yatharth, Daniel, and Haokun! Great Work! 🏆 (August 25, 2024) Four demo submissions have been accepted to IEEE ISMAR 2024! (August 12, 2024) Three demo submissions have been accepted to ACM UIST 2024! (August 12, 2024) Dr. Kim will serve as an Associate Chair for CHI 2025. (July 16, 2024) One paper has been accepted to IEEE ISMAR 2024! Congratulations to Yatharth and Daniel! (July 12, 2024) We received an NSF grant “CIRC: Dev: SMILE: Scan to Multi-sensorial Interactive Learning Environment” (Award CNS-2346528, 07/2024-06/2026). (June 30, 2024) Two papers have been accepted to ACM UIST 2024! Congratulations, Yatharth, Haokun, Hyunjae, and Daniel! (May 1, 2024) Two Emerging Technologies Installation submissions have been accepted for presentation at SIGGRAPH 2024 in Denver, Colorado! Great work, Yatharth, Haokun, and Ayush! (April 16, 2024) One paper was accepted to ACM IMWUT. Congratulations to Haokun and Yatharth! (April 11, 2024) We won the Best Demo Honorable Mention Award at the IEEE Haptics Symposium 2024. Congratulations to Haokun and Yatharth! 🏆 (March 21, 2024) Dr. Kim will serve on the Program Committee for UIST 2024. (March 21, 2024) Dr. Kim will serve on the Technical Program Committee for Ubicomp/ISWC 2024. (February 3, 2024) Dr. Kim will serve on the program committee for EuroHaptics 2024. (January 27, 2024) One poster paper has been accepted to IEEE VR 2024! Another great news! (January 21, 2024) Two demo papers have been accepted to IEEE VR 2024! Great news! (January 19, 2024) Our submission to ACM CHI 2024 has been conditionally accepted! Congratulations, Haokun, Yatharth, and Hyunjae! (December 15, 2023) We received the Best Student Demo Award at the SIGGRAPH Asia Emerging Technologies held in Sydney, Australia! Congrats, Yatharth and Haokun! 🏆 Check out here. (October 17, 2023) Haokun presented “Fabric Thermal Display using Ultrasound Waves” at IEEE ISMAR 2023 in Sydney, Australia! (September 29, 2023) Dr. Kim gave a talk at the University of Chicago (Pedro Lopes’ Lab). (September 6, 2023) Dr. Kim will serve as a WIP Paper Co-Chair for the IEEE World Haptics Conference 2025. (September 1, 2023) The MI Lab website is now on. Please check https://mi-lab.io. (August 9, 2023) Our submission to IEEE ISMAR 2023 has been conditionally accepted! Congratulations, Haokun and Yatharth! (August 9, 2023) Dr. Kim will serve as an associate editor of Frontiers in Virtual Reality (Haptics Section). (July 31, 2023) Our submission to SIGGRAPH Asia 2023 Emerging Technologies has been conditionally accepted! Congratulations, Yatharth and Haokun! (July 20, 2023) Dr. Kim will serve as a program committee member for IEEE Haptics Symposium 2024. (July 19, 2023) Dr. Kim gave a talk on Multimodal Interfaces for Immersive Virtual Reality at CEA, Palaiseau, France. (July 18, 2023) Dr. Kim gave a talk on Multimodal Interfaces for Immersive Virtual Reality at CNRS/INRIA, Rennes, France. (July 10, 2023) Dr. Kim presented “Interplaying Thermal and Tactile Sensations for Immersive Virtual Reality” at WHC 2023 Workshop on Touching the Future: Science and Technology of Multisensory Cutaneous Displays” in Delft, the Netherlands. The workshop was organized by Lynette Jones and Hsin-Ni Ho, and Dr Kim joined as a panelist, along with Pedro Lopes, Allison Okamura, and Yasemin Vardar. (July 4, 2023) Dr. Kim gave a talk on Multimodal Interfaces for Immersive Virtual Reality at BK21 Workshop, Cheonan, Korea. (March 30, 2023) Our paper “Recent Advances and Opportunities of Active Materials for Haptic Technologies in Virtual and Augmented Reality” has been selected as one of the top downloaded articles during its first 12 months of publication in Advanced Functional Materials. (March 29, 2023) Our paper “Upper Body Thermal Referral and Tactile Masking for Localized Feedback” has been nominated for the Best Paper at IEEE VR 2023. 🏆 (January 30, 2023) Dr. Kim will serve as a program committee member for the IEEE World Haptics Conference 2023. (December 19, 2022) Our paper “Upper Body Thermal Referral and Tactile Masking for Localized Feedback” has been conditionally accepted for presentation at IEEE VR 2023 and for publication in a special issue of the IEEE Transactions on Visualization and Computer Graphics (IEEE TVCG)! Congrats, Haokun and Yatharth! (December 5, 2022) Dr. Kim will serve as a Guest Editor for IEEE Transactions on Haptics (ToH to WHC track). (December 1, 2022) We received Best Poster Award from VRST 2022! Congrats, Ayush! 🏆 (October 4, 2022) The book chapter entitled “Multimodal Interaction with Mid-Air Haptics” by Dr. Kim was published. This chapter is one of the contributions in Ultrasound Mid-Air Haptics for Touchless Interfaces published by Springer. (September 6, 2022) Two poster papers were accepted to VRST 2022! Congratulations, Ayush, Henry, and Brandon! (June 20, 2022) Dr. Jin Ryong Kim received an Outstanding Associate Editor Award from the IEEE Robotics and Automation Letters for his distingu",
  "content_length": 50258,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:51"
}