{
  "name": "Jina Huh-Yoo",
  "homepage": "https://huhjina.github.io/personal",
  "status": "success",
  "content": "Jina Huh-Yoo | Home Jina Huh-Yoo Associate Professor of Computer Science, Stevens Institute of Technology jhuhyoo [AT] stevens.edu Bio CV I am an Associate Professor of Computer Science at the Charles V. Schaefer, Jr. School of Engineering and Science Stevens Institute of Technology where I lead the Health and Happiness Design Lab. Previously, I held faculty positions at the College of Computing and Informatics at Drexel University, the University of California San Diego School of Medicine, and the College of Communication Arts and Sciences at Michigan State University. As PI, I have been awarded career grants as well as research grants from the National Institutes of Health and the National Science Foundation. I got a PhD from the University of Michigan Ann Arbor School of Information and a Master in HCI at Human-Computer Interaction Institute at Carnegie Mellon University School of Computer Science. I play piano and tennis, learn Japanese, and consult my husband's local pediatric dentistry and orthodontics office in my spare time. I am interested in how technological innovation can support people's everyday health as well as serious illnesses. This inquiry involves first understanding emerging technologies and its potential and limitations so we find best ways the technologies can be designed for people in ways that are safe, useful, and meaningful. Moreover, I am interested in how these technologies can maintain or further foster, and not hinder, social connections--which are essential in maintaining one's health, according to the socio-ecological model. I use qualitative methods, including content analysis, interviews, co-design activities, and community-based participatory research as well as quantitative and computational methods, involving statistics and text data analytics methods to understand social phenomena around emerging technologies. Through these mixed methods approach, I am able to understand people's perceptions, behavioral practices, and implications for design. I then use these conclusions to design, build, and evaluate technological systems. Prospective Students I invite students who are passionate, open-minded, creative, with strong work ethic, who are strong communicators. You can email me your relevant experience and goals. You can apply to the Department of Computer Science PhD program at Stevens Institute of Technology, and mention me in your application. Publications For a (likely) more up-to-date list of publications, see Google Scholar. Selected All TITLE AUTHORS VENUE. YEAR. Paper Preprint TITLE AUTHORS VENUE. YEAR. Paper Preprint Recent News October 22, 2024. Speaker, 'The Role of Artificial Intelligence in Caregiving.' Application of Artificial Intelligence for Behavioral Intervention: Opportunities and Limitations. American Society of Preventive Oncology (ASPO) Behavioral Science and Health Communication SIG Webinar. Online (more info). October 21, 2024. Keynote Speaker, 'The Role of Artificial Intelligence in Social Relationships.' The 7th IEEE International Conference on Universal Village 2024 (IEEE UV2024). Online. (more info). August 16, 2024. AHRQ Grant Awarded as Co-I: 'Implementing decision support for long term care' ($449,999, 2024-2027) (more info). Lab For more information about H2DesignLab and the people I am lucky to work with, check out our lab website. Website Design Design by Mor Naaman, forked by permission from his Github. Jina Huh-Yoo jhuhyoo [AT] stevens.edu",
  "content_length": 3473,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:52"
}