{
  "name": "Jinbo Bi",
  "homepage": "http://www.engr.uconn.edu/~jinbo",
  "status": "success",
  "content": "Bi, Jinbo | College of Engineering Our websites may use cookies to personalize and enhance your experience. By continuing without changing your cookie settings, you agree to this collection. For more information, please see our University Websites Privacy Notice. UConn Cookie Information What are Cookies? Authentication Cookies Analytics Cookies Opt Out Web cookies (also called HTTP cookies, browser cookies, or simply cookies) are small pieces of data that websites store on your device (computer, phone, etc.) through your web browser. They are used to remember information about you and your interactions with the site. Purpose of Cookies: Session Management: Keeping you logged in Remembering items in a shopping cart Saving language or theme preferences Personalization: Tailoring content or ads based on your previous activity Tracking & Analytics: Monitoring browsing behavior for analytics or marketing purposes Types of Cookies: Session Cookies: Temporary; deleted when you close your browser Used for things like keeping you logged in during a single session Persistent Cookies: Stored on your device until they expire or are manually deleted Used for remembering login credentials, settings, etc. First-Party Cookies: Set by the website you're visiting directly Third-Party Cookies: Set by other domains (usually advertisers) embedded in the website Commonly used for tracking across multiple sites Authentication cookies are a special type of web cookie used to identify and verify a user after they log in to a website or web application. What They Do: Once you log in to a site, the server creates an authentication cookie and sends it to your browser. This cookie: Proves to the website that you're logged in Prevents you from having to log in again on every page you visit Can persist across sessions if you select \"Remember me\" What's Inside an Authentication Cookie? Typically, it contains: A unique session ID (not your actual password) Optional metadata (e.g., expiration time, security flags) Analytics cookies are cookies used to collect data about how visitors interact with a website. Their primary purpose is to help website owners understand and improve user experience by analyzing things like: How users navigate the site Which pages are most/least visited How long users stay on each page What device, browser, or location the user is from What They Track: Some examples of data analytics cookies may collect: Page views and time spent on pages Click paths (how users move from page to page) Bounce rate (users who leave without interacting) User demographics (location, language, device) Referring websites (how users arrived at the site) Here’s how you can disable cookies in common browsers: 1. Google Chrome Open Chrome and click the three vertical dots in the top-right corner. Go to Settings > Privacy and security > Cookies and other site data. Choose your preferred option: Block all cookies (not recommended, can break most websites). Block third-party cookies (can block ads and tracking cookies). 2. Mozilla Firefox Open Firefox and click the three horizontal lines in the top-right corner. Go to Settings > Privacy & Security. Under the Enhanced Tracking Protection section, choose Strict to block most cookies or Custom to manually choose which cookies to block. 3. Safari Open Safari and click Safari in the top-left corner of the screen. Go to Preferences > Privacy. Check Block all cookies to stop all cookies, or select options to block third-party cookies. 4. Microsoft Edge Open Edge and click the three horizontal dots in the top-right corner. Go to Settings > Privacy, search, and services > Cookies and site permissions. Select your cookie settings from there, including blocking all cookies or blocking third-party cookies. 5. On Mobile (iOS/Android) For Safari on iOS: Go to Settings > Safari > Privacy & Security > Block All Cookies. For Chrome on Android: Open the app, tap the three dots, go to Settings > Privacy and security > Cookies. Be Aware: Disabling cookies can make your online experience more difficult. Some websites may not load properly, or you may be logged out frequently. Also, certain features may not work as expected. Close UConn College of Engineering COE Search University of Connecticut Search UConn Search University Communications Search UConn Search UConn A to Z Index UConn A to Z Index Click to open menu Professor, School of Computing Email jinbo.bi@uconn.edu Phone (860) 486-1458 Mailing Address University of Connecticut 371 Fairfield Way, Unit 4155 Storrs, CT 06269-4155 Campus Storrs Link Research Website Google Scholar Link Overview Research Interests Projects Teaching Publications Related News Fellows Brief Bio Bi is the Frederick H. Leonhardt Professor of Computer Science and associate head of the department. She holds a Ph.D. from Rensselaer Polytechnic Institute. Her research interests include artificial intelligence, machine learning, data mining, pattern recognition, optimization, computer vision, bioinformatics, medical informatics, drug discovery. Artificial Intelligence, Machine learning, Data mining, Pattern recognition, Optimization, Computer vision, Bioinformatics, Medical informatics, Drug discovery Spring 2019, Machine Learning Spring 2018, Machine Learning Spring 2017, Machine Learning Spring 2016, Artificial Intelligence Spring 2015, Artificial Intelligence Fall 2014, Machine Learning Fall 2014, Introduction to Discrete Systems Spring 2014, Introduction to Discrete Systems Fall 2013, Machine Learning Fall 2013, Numerical Methods in Scientific Computation Spring 2013, Machine Learning in Biomedical Informatics Fall 2012, Introduction to Discrete Systems Fall 2012, CSE Special Topic: Computational Biomedical Informatics Spring 2012, Introduction to Discrete Systems Fall 2011, Numerical Methods in Scientific Computation Spring 2011, Introduction to Discrete Systems Fall 2010, CSE Special Topic: Computational Medical Informatics Communication-Optimal Distributed Dynamic Graph Clustering.pdf, Chunjiang Zhu, Tan Zhu, Kam-Yiu Lam, Song Han, and Jinbo Bi To appear in the Proceedings of the 33rd AAAI Conference on Artificial Intelligence (AAAI), 2019. End-to-End Structure-Aware Convolutional Networks for Knowledge Base Completion.pdf, Chao Shang, Yun Tang, Jing Huang, Jinbo Bi, Xiaodong He, and Bowen Zhou To appear in the Proceedings of the 33rd AAAI Conference on Artificial Intelligence (AAAI), 2019. Top-down Indoor Localization with Wi-Fi Fingerprints using Deep Q-network.pdf, Fei Dou, Jin Lu, Zigeng Wang, Xia Xiao, Jinbo Bi, Chun-Hsi Huang To appear in the Proceedings of the 15th IEEE International Conference on Mobile Ad-hoc and Sensor Systems, 2018. Large-scale Automatic Depression Screening Using Meta-data from Wi-Fi Infrastructure.pdf, Shweta Ware, Chaoqun Yue, Reynaldo Morillo, Jin Lu, Chao Shang, Jinbo Bi, Jayesh Kamath, Alexander Russell, Athanasios Bamis, and Bing Wang Proceedings of the ACM on Interactive Mobile, Wearable and Ubiquitous Technologies (IMWUT), a premier journal for research relevant to the post-PC era, 2(4):195, pp.195:1-195:27, 2018. Fusion Location Data for Depression Prediction.pdf, Chaoqun Yue, Shweta Ware, Reynaldo Morillo, Jin Lu, Chao Shang, Jinbo Bi, Jayesh Kamath, Alexander Russell, Athanasios Bamis, and Bing Wang IEEE Transactions on Big Data, DOI: 10.1109/TBDATA.2018.2872569, 2018. Inferring Phenotypes from Substance Use via Collaborative Matrix Completion.pdf, Jin Lu, Jiangwen Sun, Xinyu Wang, Henry R. Kranzler, Joel Gelernter, and Jinbo Bi BMC Systems Biology, 12(S6):104, DOI: 10.1186/s12918-018-0623-5, 2018. Reforming Generative Autoencoders via Goodness-of-Fit Hypothesis Testing.pdf, Aaron Palmer, Dipak K. Dey, and Jinbo Bi Proceedings of the Uncertainty in Artificial Intelligence (UAI), 2018. Joint Modeling of Heterogeneous Sensing Data for Depression Assessment via Multi-task Learning.pdf, Jin Lu, Chao Shang, Chaoqun Yue, Reynaldo Morillo, Shweta Ware, Jayesh Kamath, Athanasios Bamis, Alexander Russell, Bing Wang, and Jinbo Bi Proceedings of the ACM on Interactive Mobile, Wearable and Ubiquitous Technologies (IMWUT), a premier journal for research relevant to the post-PC era, 2(1):21, pp.21:1-21:21, 2018. Latent Sparse Modeling of Longitudinal Multi-dimensional Data.pdf, Ko-Shin Chen, Tingyang Xu, and Jinbo Bi Proceedings of the 32nd AAAI Conference on Artificial Intelligence, pp. 2135-2142, 2017. Collaborative Phenotype Inference from Comorbid Substance Use Disorders and Genotypes.pdf, Jin Lu, Jiangwen Sun, Xinyu Wang, Henry R. Kranzler, Joel Gelernter, and Jinbo Bi Proceedings of IEEE International Conference on Bioinformatics and Biomedicine (BIBM), pp. 392-397, 2017. VIGAN: Missing View Imputation with Generative Adversaial Networks.pdf, Chao Shang, Aaron Palmer, Jiangwen Sun, Ko-Shin Chen, Jin Lu, and Jinbo Bi Proceedings of IEEE International Conference on Big Data (BigData), 2017. Identifying and Quantifying Nonlinear Structured Relationships in Complex Manufactural Systems.pdf, Tingyang Xu, Tan Yan, Dongjin Song, Wei Cheng, Haifeng Chen, Guofei Jiang, and Jinbo Bi Proceedings of IEEE International Conference on Big Data (BigData), 2017. Fusing Location Data for Depression Prediction.pdf, Chaoqun Yue, Shweta Ware, Reynaldo Morillo, Jin Lu, Chao Shang, Jinbo Bi, Jayesh Kamath, Alexander Russell, Anthanasios Bamis, and Bing Wang Proceedings of the 14th International Conference on Ubiquitous Intelligence and Computing (UIC), 2017. Classification of Neurological Gait Disorders Using Multi-task Feature Learning.pdf, Ioannis Papavasileiou, Wenlong Zhang, Xin Wang, Jinbo Bi, Li Zhang, Song Han Proceedings of the 2nd IEEE/ACM Conference on Connected Health: Applications, Systems and Engineering Technologies (CHASE), 2017. A Sparse Inductive Model for Matrix Completion with Side Information.pdf, Jin Lu, Guannan Liang, Jiangwen Sun, and Jinbo Bi Advances in Neural Information Processing Systems 29, pp. 4071 – 4079, 2016. A supplementary file with proofs c",
  "content_length": 30410,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:00"
}