{
  "name": "Jindong Wang 0001",
  "homepage": "https://jd92.wang",
  "status": "success",
  "content": "Jindong Wang Assistant Professor, William & Mary jdw [at] wm.edu, jindongwang [at] outlook.com Integrated Science Center 2273, Williamsburg, VA Google scholar | DBLP | Github | Twitter/X | LinkedIn | Zhihu | Bilibili || CV PhD and interns: You can apply for 2026 PhD or Internship or collaboration. [Chinese blog] I am open to industry and university visit, consultant, and more collaboration! Dr. Jindong Wang is an Assistant Professor at Department of Data Science, William & Mary. He is also a faculty member of Future of Life Institute. Previously, he was a Senior Researcher in Microsoft Research Asia from 2019 to 2024. His research interest spans machine learning, large foundation models, and generative AI for social science. He is among World’s Top 2% Highly Cited Scientists and Most Influential AI Scholars. He is associate editor of IEEE Transactions on Neural Networks and Learning Systems (TNNLS), guest editor for ACM Transactions on Intelligent Systems and Technology (TIST), area chair for ICML, NeurIPS, ICLR, KDD, ACL, ACMMM, and ACML, and SPC of IJCAI and AAAI. He published over 60 papers at top-tier venues (23000+ citations, H-index 54). His research is supported by Amazon Research Award, Google Research Award, AMD University Program AI & HPC Award, Microsoft Accelerate Foundation Model Research Award, and William & Mary Faculty Research Award. His research was integrated into Microsoft health products that reduced token consumptions by 15%, and quant finance with increased prediction accuracy. His work was reported by Forbes, MIT Technology Review, and other international media. He received best papers awards at several conferences and workshops. He published a book Introduction to Transfer Learning and gave tutorials at IJCAI’22, WSDM’23, KDD’23, AAAI’24, AAAI’25, and CVPR’25. News Nov 24, 2025 We have 1 paper accepted by AAAI 2026 and KDD 2026, respectively. Congrats to authors! Nov 20, 2025 Invited to be an area chair (AC) of ICML 2026. Oct 22, 2025 We got the prestigious Amazon Research Award! Oct 17, 2025 We received an unrestricted gift (award) from Google Deepmind! Oct 16, 2025 We got the AMD University Program HPC Award! Oct 13, 2025 Our NeurIPS 2025 workshop on LLM persona has been accepted! Oct 07, 2025 We got the Google Cloud Research Credit award! Sep 18, 2025 Three papers got accepted by NeurIPS 2025. Congrats!",
  "content_length": 2372,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:53"
}