{
  "name": "Jing Ma 0004",
  "homepage": "https://majingcuhk.github.io",
  "status": "success",
  "content": "MA, Jing   馬 晶 [Full-time Faculty] Assistant Professor Department of Computer Science Hong Kong Baptist University Office: Room 638, David C. Lam Building, Kowloon Tong, Hong Kong Email: majing@hkbu.edu.hk Phone: (852) 3411 5313 Fax:(852) 3411 7892 Brief Biography I received my PhD degree from the Department of Systems Engineering and Engineering Management (SEEM), The Chinese University of Hong Kong (CUHK) in 2020. Before that, I obtained both of my B.E. and M.E. degree from Beijing University of Posts and Telecommunications (BUPT) in 2013 and 2016 respectively. Early on I was working as a research intern in Baidu (with natural language processing group) and Tencent (with AI Lab). I have authored and co-authored over 60 publications, with more than 7000 citations so far (H-index 29). I was recognised as one of “The 2022 Women in AI” and included in the list of the world’s top 2% most-cited scientists by Stanford University at 2022. My paper was selected as Top Five Outstanding TIST Articles at 2022. In recent years, I served as Area Chair for AACL 2023, NAACL 2024, ACL 2024, EMNLP 2024 and NLPCC 2024; Program Committee Member for WSDM 2023, WWW2021 2023, AAAI 2019-2021, ACL 2019, EMNLP 2019, etc, and was invited to review journal papers such as TIST, TKDE, TOMM, TNNLS, TPAMI, etc. NEWS I'm looking for PhD students, post-docs, research assistants, and visitors. For those who are interested in working with me, please feel free to email me with your CV. Remote collaboration is also welcome! Academic Appointments Assistant Professor, Hong Kong Baptist University, Hong Kong [Apr'20 - ] Visiting Scholar, Nanyang Technological University (NTU), Singapore. Work with Shaffiq Rayhan Joty [Dec'18 - Aug'19] Visiting Scholar, Institute for Basic Science (IBS), South Korea. Work with Meeyoung Cha [Dec'19 - Feb'20] PhD in SEEM, The Chinese University of Hong Kong, Hong Kong [Aug'16 - Feb'20] Research Interests Natural Language Processing Information Verification: Fake News, Rumor, Misinformation, Harmful Memes, etc Social Media Analytics, Opinion Mining Question and Answering, Dialog System Information Retrieval Explainable Machine Learning Large Language Model, Vision Language Model",
  "content_length": 2208,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:57"
}