{
  "name": "Jing Deng 0001",
  "homepage": "https://home.uncg.edu/~j_deng",
  "status": "success",
  "content": "Prof. Jing Deng at UNC Greensboro Welcome to Prof. Jing Deng's Homepage Home | Teaching | Research | Publications | CV | Misc Jing Deng, Ph.D., IEEE Fellow Associate Dean, College of Arts and Sciences Bank of America Distinguished Professor, Computer Science UNC Greensboro, 105 Foust Building 1400 Spring Garden St. Greensboro, NC 27412-6170 Email: jing.deng@ieee.org jing.deng@uncg.edu Office: 105 Foust Building Virtual Office on Microsoft Teams Phone: (336) 334-3974 Education: Ph.D., Cornell University (Electrical and Computer Engineering), 2002 M.E., Tsinghua University (Electronic Engineering), Beijing, P. R. China, 1997 B.E., Tsinghua University (Electronic Engineering), Beijing, P. R. China, 1994 Short Bio: Dr. Jing Deng is an Associate Dean in the College of Arts and Sciences and the Bank of America Distinguished Professor in the Department of Computer Science (CS) at UNC Greensboro (UNCG). He served as the Head of Computer Science between 2019 and 2024. Dr. Deng visited the Department of Electrical Engineering at Princeton University and the Department of Electrical and Computer Engineering, WINLAB at Rutgers University in Fall of 2005. He was with the Department of Computer Science at the University of New Orleans from 2004 to 2008. He served as a Research Assistant Professor in the Department of Electrical Engineering & Computer Science at Syracuse University from 2002 to 2004. He received his Ph.D. degree from School of Electrical and Computer Engineering at Cornell University, Ithaca, NY in January, 2002. Dr. Deng is a Fellow of the IEEE. In 2015, Dr. Deng's joint paper (with Dr. Fu and Mr. Yang) on social network received the best paper award in IARIA's Third International Conference on Building and Exploring Web Based Environments (WEB'15). In 2013, Dr. Deng received the prestigious Test-of-Time Award presented by the ACM Special Interest Group on Security, Audit and Control (SIGSAC) for his joint publication with Drs. Du, Han, and Varshney in the area of key predistribution in wireless sensor networks, published in CCS 2003. Dr. Deng is an associate editor for IEEE Open Journal of the Computer Society. He served as an associate editor of IEEE Transactions on Mobile Computing (TMC) (2018-2023) and IEEE Transactions on Vehicular Technology (TVT) (2008-2018). Dr. Deng's research focuses include online social networks, wireless networks, and network security. Graduate Assistant Position: Ph.D. applicants are welcome to contact me for their interests in my research. Our Graduate Research Assistant (GRA/GA/RA) positions provide full financial support, which include monthly stipend and full tuition remissions. Recent Publications: N. Pokala, S. Hossan, J. Deng, and D. Huang, \"Stock Prediction Based On Annual Reports Using Large Language Model,\" in Proc. of the International Conference on Artificial Intelligence, Computer, Data Sciences and Applications (ACDSA 2026), Boracay Island, Philippines, February 5-7, 2026. to appear. [PDF] [BibTeX] S. Hossan and J. Deng, \"Detection of LLM Hallucinations Using Late Internal Representations,\" in Proc. of the 24th International Conference on Machine Learning and Applications (ICMLA), Special Session on Robustness and Security of Large Language Models (ROSE-LLM 2025) Boca Center, FL, USA, December 3-5, 2025. to appear. [PDF] [BibTeX] S. Hossan and J. Deng, \"MMEC: Using MoE Efficiently for Mobile Edge Computing,\" in Proc. of the International Conference on ICT Convergence (ICTC 2025), Jeju Island, Korea, October 14-17, 2025. to appear. [PDF] [BibTeX] W. Yang, C. Lin, J. Deng, H. Dai, L. Chen, X. Fan, and L. Zhang, \"Secure Charging Scheduling in Wireless Rechargeable Sensor Networks,\" IEEE Transactions on Mobile Computing, 2025. to appear. [PDF] [BibTeX] C. Zhu, B. Gaines, J. Deng, and J. Bi, \"Adversarially Attacking Graph Properties and Sparsification in Graph Learning,\" in Proc. of the 34th ACM International Conference on Information and Knowledge Management (CIKM 2025) (short paper), Seoul, Korea, November 10-14, 2025. to appear. [PDF] [BibTeX] S. Hossan, J. Deng, R. Schwendler, and C. P. Egeland, \"Identifying Social Interaction Outliers with the Use of Network Analysis: Disk Decoration in the Middle Magdalenian Period,\" in Proc. of the 17th International Conference on Social Networks Analysis and Mining (ASONAM 2025), Niagara Falls, ON, Canada, August 25-28, 2025. to appear. [PDF] [BibTeX] Y. Chi, C. Lin, J. Deng, K. Ning, X. Fan, and G. Wu, \"Edge Computing for Underwater Optical Wireless Sensor Networks,\" IEEE Transactions on Mobile Computing, 2025. to appear. [PDF] [BibTeX] Y. Xu, J. Liu, E. Wang, B. Yang, D. Luan, Y. Yang, and J. Deng, \"Rethinking the Effect of Sparse Data Completion on Sparse Mobile Crowdsensing Tasks,\" IEEE Transactions on Mobile Computing, vol. 24, no. 6, pp. 5094-5105, June 2025. doi: 10.1109/TMC.2025.3531362. [PDF] [BibTeX] F. Chen, P. Li, T. H. Luan, Z. Su, and J. Deng, \"SPIN: Accelerating Large Language Model Inference with Heterogeneous Speculative Models,\" in Proc. of the 44th Conference of the IEEE Communications Society (INFOCOM '25), London, U. K., May 19-22, 2025, pp. 1-10, doi: 10.1109/INFOCOM55648.2025.11044522. [PDF] [BibTeX] J. Deng and E. Wang, \"Just Enough Disclosure (JED): Taking Advantage of Non-IID Data for Federated Learning in Mobile Edge Computing,\" in Proc. of the 6th International Workshop on Data Driven Intelligence for Networks and Systems (DDINS'24), in conjunction with the IEEE International Conference on Communications (ICC'24), Denver, CO, USA, June 9-13, 2024, pp. 656-660, doi: 10.1109/ICCWorkshops59551.2024.10615798. [PDF] [BibTeX] F. Chen, P. Li, S. Pan, L. Zhong, and J. Deng, \"Giant Could be Tiny: Efficient Inference of Giant Models on Resource-Constrained UAVs,\" IEEE Internet of Things Journal Special Issue on Tiny Machine Learning in Internet of Unmanned Aerial Vehicles, vol. 11, no. 12, pp. 21170-21179, June 2024. doi: 10.1109/JIOT.2024.3366531. [PDF] [BibTeX] Y. Long, J. Zhuang, S. Gong, B. Gu, J. Xu, and J. Deng, \"Exploiting Deep Reinforcement Learning for Stochastic AoI Minimization in Multi-UAV-assisted Wireless Networks,\" in Proc. of IEEE Wireless Communications & Networking Conference, Mobile and Wireless Networks (WCNC '24), Dubai, United Arab Emirates, April 21-24, 2024, pp. 1-6, doi: 10.1109/WCNC57260.2024.10570857. [PDF] [BibTeX] J. Deng, V. Kolesnikov, and A. A. Schwarzmann, \"Cryptology and Network Security - 22nd International Conference, CANS 2023, Augusta, GA, USA, October 31 – November 2, 2023, Proceedings,\" Lecture Notes in Computer Science, Springer Singapore, 2023. doi: 10.1007/978-981-99-7563-1. [PDF] [BibTeX] J. Deng, P.-N. Chen, and Y. S. Han, \"perMAC: Perturbation-based MAC for Dense Wireless Networks with Periodic Traffic,\" in Proc. of the 2023 International Conference on Computing, Networking and Communications (ICNC'23): Mobile and Wireless Networking, Honolulu, HI, USA, February 20-22, 2023, pp. 372-376, doi: 10.1109/ICNC57223.2023.10074191. [PDF] [BibTeX] L. Yao, J. Li, J. Deng, and G. Wu, \"Detection of Cache Pollution Attack Based on Federated Learning in Ultra-Dense Network,\" Elsevier Computers & Security, vol. 124, pp. 102965, January 2023, doi: 10.1016/j.cose.2022.102965. [PDF] [BibTeX] L. Yao, X. Xu, J. Deng, G. Wu, Z. Li, \"A Cooperative Caching Scheme for VCCN with Mobility Prediction and Consistent Hashing,\" IEEE Transactions on Intelligent Transportation Systems, vol. 23, no. 11, pp. 20230-20242, November 2022. doi: 10.1109/TITS.2022.3171071. [PDF] [BibTeX] S. Muttineni and J. Deng, \"Estimating Sentiment in Social Media - a Case Study of the Migrant Caravans News on Twitter,\" in Proc. of the 9th International Workshop on Semantic Computing for Social Networks and Organization Sciences: from user information to social knowledge (SCSN '21), in conjunction with the 15th IEEE International Conference on Semantic Computing (ICSC '21), Virtual, January 27-29, 2021, pp. 404-408, doi: 10.1109/ICSC50631.2021.00074. [PDF] [BibTeX] C. Lin, Z. Yang, Y. Sun, J. Deng, L. Wang, and G. Wu, \"Cooperative Game for Multiple Chargers with Dynamic Network Topology,\" in Proc. of the 49th International Conference on Parallel Processing (ICPP '20), Edmonton, AB, Canada, August 17-20, 2020, article number: 17, pp. 1-10, doi: 10.1145/3404397.3404469. [PDF] [BibTeX] K. Lin, Y. Li, J. Deng, P. Pace, and G. Fortino, \"Clustering-learning-based Long-term Predictive Localization in 5G-Envisioned Internet of Connected Vehicles,\" IEEE Transactions on Intelligent Transportation Systems, vol. 22, no. 8, pp. 5232-5246, August 2021. doi: 10.1109/TITS.2020.2997472. [PDF] [BibTeX] C. Jia, K. Lin, and J. Deng, \"A Multi-property Method to Evaluate Trust of Edge Computing Based on Data Driven Capsule Network,\" in Proc. of the 2nd International Workshop on Data Driven Intelligence for Networks (DDIN), in conjunction with the 39th Conference of the IEEE Communications Society (INFOCOM '20), Toronto, Canada, July 6-9, 2020, pp. 616-621, doi: 10.1109/INFOCOMWKSHPS50562.2020.9163069. [PDF] [BibTeX] B. Joyce and J. Deng, \"Sentiment Analysis Using Naive Bayes Approach with Weighted Reviews - a case study,\" in Proc. of IEEE Global Telecommunications Conference - Special Areas in Communications - Social Networks (GLOBECOM '19), Waikoloa, HI, USA, December 9-13, 2019, pp. 1-6, doi: 10.1109/GLOBECOM38437.2019.9013588. [PDF] [BibTeX] L. Yao, B. Jiang, J. Deng, and M. S. Obaidat, \"LSTM-based Detection for Timing Attacks in Named Data Network,\" in Proc. of IEEE Global Telecommunications Conference - Communication and Information Systems Security Symposium (GLOBECOM '19), Waikoloa, HI, USA, December 9-13, 2019, pp. 1-6, doi: 10.1109/GLOBECOM38437.2019.9013144. [PDF] [BibTeX] C. Lin, C. Guo, W. Du, J. Deng, L. Wang, and G. Wu, \"Maximizing Energy Efficiency of Period-Area Coverage with UAVs for Wireless Rechargeable Sensor Networks,\" in Proc. of the 16th IEEE International Conference on Sensing, Communication, and Networks (SECON ",
  "content_length": 11626,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:56"
}