{
  "name": "Jingtao Wang",
  "homepage": "https://people.cs.pitt.edu/~jingtaow",
  "status": "success",
  "content": "Welcome to Jingtao Wang's Homepage Jingtao Wang Assistant Professor Mobile Interfaces and Pedagogical Systems (MIPS) Group E-Mail: Department of Computer Science 210 S Bouquet Street, Room 5423 University of Pittsburgh Pittsburgh, PA 15260 Phone: 412-624-8454 Learning Research and Development Center 3939 O'Hara Street, Room 702 University of Pittsburgh Pittsburgh, PA 15260 Phone: 412-624-7498 I joined Google as a Senior Research Scientist in May 2018. I no longer take new students or postdocs in Pitt. I look for research interns (in both summers and regular semesters) who are highly motivated and enjoy learning new things. Please drop me a line at jingtaow _at_ google _dot_ com if you are interested in working with me or have good candidates to recommend. Here is a list of students I advised in the past. Jingtao Wang is an Assistant Professor in Computer Science and LRDC at the University of Pittsburgh. He leads the Mobile Interfaces and Pedagogical Systems (MIPS) Research Group. His primary research lies at the intersection between Human-Computer Interaction (HCI) and Artificial Intelligence (AI). Jingtao's research interests include Mobile Interfaces, Education/Learning Technology, Intelligent User Interfaces, and Interactive Machine Learning. Jingtao received his Ph.D. in Computer Science from UC Berkeley, Master degree in Computer Engineering, Bachelor degree in E.E. both from Xi'an Jiaotong University, China. MIPS Lab, teaching, and recent publications. Recent News The class website for CS1635 Spring 2018 is online. New Congratulations to Phuong Pham for passing his Ph.D. dissertation defense! New The class website for CS2610 Fall 2017 is online. New I have received a Microsoft Azure for Research Award for building and deploying intelligent mobile learning systems in large scale for 2017. New Here comes an official press release of AttentiveLearner in ACM CHI 2017! New Congratulations to Xiangmin Fan for passing his Ph.D. dissertation defense! (dissertation) New The class website for CS1635 Spring 2017 is online. New Contratulations to Phuong Pham for receiving the Best Student Paper Award from ACM ICMI 2016! New Congratulations to Xiang Xiao for passing his Ph.D. dissertation defense! (dissertation) New Special thanks to Lenovo for the donation of Moto 360 smartwatches to my lab. My lab just received a generous gift from Byte Dance Telecommunications. I have received a Google Faculty Research Award for 2016. I have received a NVIDIA Academic Hardware Grant for using deep learning to enhance mobile MOOC learning. CourseMIRROR is available in the Apple iOS App Store now. MindMiner's public website is online. AttentiveLearner's public website is online. We have released the source code of LivePulse Games under BSD license. We have released the source code of BayesHeart under BSD license. CourseMIRROR's public website is online. CourseMIRROR is available in the Google Play Store now. We have released the source code of LensGesture under BSD license. Last modified: 10/11/2017 6:52 PM",
  "content_length": 3039,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:07"
}