{
  "name": "Jing Jiang 0001",
  "homepage": "https://comp.anu.edu.au/people/jing-jiang",
  "status": "success",
  "content": "Jing Jiang | ANU School of Computing School Sharepoint College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Research Interests I am broadly interested in natural language processing, text mining, and machine learning. My research focuses on the applied side of NLP, and I have worked on a range of topics including information extraction, topic modelling, sentiment analysis, social media analysis, question answering, and the evaluation of vision-language models. Biography Jing Jiang is a Professor in the School of Computing at the Australian National University. Prior to joining the ANU, she was a Professor of Computer Science at the Singapore Management University and Director of the AI and Data Science Cluster of the School of Computing and Information Systems at SMU. Jing’s research focuses on the applied side of natural language processing. She has worked on a broad range of topics in NLP including information extraction, topic modelling, sentiment analysis, social media analysis, question answering, and the evaluation of vision-language models. She served as a program co-chair for the Conference on Empirical Methods in Natural Language Processing (EMNLP) 2019, as an action editor for the Transactions of the Association for Computational Linguistics (TACL), and currently serves as one of the Editors-in-Chief of ACL Rolling Review (ARR). Jing received her PhD degree in Computer Science from the University of Illinois at Urbana-Champaign and her B.S. and M.S. degrees from Stanford University. She was named one of the Singapore 100 Women in Tech in 2021. Teaching COMP4650/6490: Document Analysis (Semester 2, 2025 and 2024) COMP4670/8600: Statistical Machine Learning (Semester 1, 2025) bars search times",
  "content_length": 1816,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:56"
}