{
  "name": "Jing Ren 0003",
  "homepage": "https://engineering.ontariotechu.ca/people/ecse/jing.ren.php",
  "status": "success",
  "content": "Dr. Jing Ren, PEng | Faculty of Engineering and Applied Science About Us Mission and Vision Dean's Welcome Technology-Enriched Learning Environment (TELE) Health and safety Administrative Code Governance Alumni Profiles Natalie Prole (Maheu) Mohamd Imad Mert Temiz Mert Temiz Mert Temiz Mert Temiz Ignite Magazine Letters to a Young Engineer Future Students Explore Undergraduate Labs Women in Engineering Campus Services Undergraduate Admission information Tuition information Undergraduate Programs Engineering Co-Op Pre-Engineering Graduate Admission Information Tuition Information Financial Aid Graduate Programs Your Main Points of Contact Frequently Asked Questions Graduate Faculty Current Students First-Year zone First-Year Engineering Success Program Peer Mentorship Program GEARS First-Year FAQ Engineering Orientation Survival Guide Undergraduate Academic Advising Program Maps Electives List Frequently Asked Questions (FAQ) Registration Guidelines Specializations Minors Capstone Design 2025 Capstone Projects 2024 Capstone Projects 2023 Capstone Projects 2022 Capstone Projects 2021 Capstone Projects 2020 Capstone Projects 2019 Capstone Projects Clubs and Societies ASME Engineering Students' Society IEEE Student Branch Ontario Tech Racing Ri3D (Robot in 3 Days) Women in Engineering Sub-Society RoboMaster Ontario Tech Space and Rocketry NAYGN Canadian Nuclear Society Ontario Tech Branch Engineering Co-Op Program Details Job Search Assistance Registration Information Frequently Asked Questions Employer Information Reverse Career Fair Engineering Co-op Annual Report Experiential Learning Innovation and Design Studio Experiential Learning Workshop Series Student Competitions Women in Engineering About Us Women in Engineering Sub-Society Scholarships Women in Engineering Peer Mentoring Career Mentorship Events Volunteer Opportunities Future Students Campus Services Graduate Your Main Points of Contact Deadlines and Procedures MEng Project MASc Thesis Thesis Deadlines Thesis Procedures Important Graduate Resources Seminar Courses & Workshops Graduate Academic Calendar Important Dates Student Forms FEAS Graduate Student Forms Registration Guides Student Finances Frequently Asked Questions Campus Services Departments Automotive, and Mechatronics Engineering Electrical, Computer, and Software Engineering Energy and Nuclear Engineering Mechanical and Manufacturing Engineering Research The Research Rundown Podcast Research Labs Aerodynamic & Energy Research Group (AER) Aerodynamic and Climatic Adaptation Research (AeroClimar) Centre Automotive Centre of Excellence Borehole Thermal Energy Storage System Energy Research Centre Power Electronics and Drives Applications Laboratory (PEDAL) Weather Adaptation Lab Research Day Automotive Systems Communications and Signal Processing Electric Power Systems and Smart Electric Grid Internet of Things Manufacturing and Materials and Mechanics of Solids and Structures Noise, Vibration, and Harshness Nuclear and Energy Systems Robotics, Automation and Controls Software Systems Thermo-fluids and Heat Transfer Speaker Spotlight People Dean's Office Department of Automotive, and Mechatronics Engineering Dr. Greg Rohrauer Dr. Haoxiang Lang Dr. Jaho Seo Dr. Moustafa El-Gindy Dr. Nasim Moallemi Dr. Scott Nokleby Dr. Xianke Lin Dr. Yuping He Dr. M. Aydin Dr. Zeinab El-Sayegh Dr. Meaghan Charest-Finn Dr. Shabnam Pejhan Dr. Aaron Yurkewich Dr. Mitchell Rushton Department of Electrical, Computer and Software Engineering Dr. Akramul Azim Dr. Anwar Abdalbari Dr. Jing Ren Dr. Khalid Abdel Hafeez Dr. Khalid Elgazzar Dr. Masoud Makrehchi Dr. Mikael Eklund Dr. Min Dong Dr. Mohamed El-Darieby Dr. Mohamed Youssef Dr. Namdar Saniei Dr. Nasim Beigi-Mohammadi Dr. Qusay Mahmoud Dr. Ramiro Liscano Dr. Ruth Milman Dr. Sanaa Alwidian Dr. Shahram ShahbazPanahi Dr. Sheldon Williamson Dr. Tarlochan Sidhu, PEng, CEng Dr. Vijay K. Sood Dr. Walid Morsi Ibrahim Dr. Ying Wang Department of Energy and Nuclear Engineering Dr. Akira Tokuhiro Dr. Anthony Waker Dr. Brian Ikeda Dr. Daniel Hoornweg Dr. Edward Waller Dr. Eleodor Nichita Dr. Filippo Genco Dr. George Bereznai Dr. Glenn Harvel Dr. Hossam Gaber Dr. Igor Pioro Dr. Jennifer McKellar Dr. Kirk Atkinson Dr. Lixuan Lu Dr. Matthew Kaye Dr. Rachid Machrafi Department of Mechanical and Manufacturing Engineering Dr. Jana Abou-Ziki Dr. Martin Agelin-Chaab Dr. Eda Aydin Dr. Ahmad Barari Dr. Ibrahim Dincer Dr. Naglaa Elagamy Dr. Horia Hangan Dr. Ali Hosseini Dr. Dima Jawad Dr. Amirkianoosh Kiani Dr. Hossam Kishawy Dr. Tao Liu Dr. Brendan MacDonald Dr. Atef Mohany Dr. Remon Pop-Iliev Dr. Bale Reddy Dr. Ghaus Rizvi Dr. Marc Rosen Dr. Ebrahim Esmailzadeh Dr. Zia Saadatnia Samuel Yousefi Administrative Services Personnel Stephan Anthonipillai Janette Banga Zahraa Bassyouni Candace Chard Michelle Cholak Kelly Crocker Hunter Johnson David Kim Cherry Lam Shari Martin Nicole Mullins Alex Piliounis Nabil Saleh Sydney Smith Melanie Stryde Laura Thursby Kailey Tinline Sarah Wedge Teaching Faculty, Laboratory and Technical Services Hidayat Shahid Govind Rehal Peter Kahr Russell Papadimitriou Ali Ismail Masoud Farzam Qi Shi Leon Wu Sharman Perera Robert Ulrich Megha Verma Engineers in Residence Outreach Experiential Learning Skip to main content Home People Department of Electrical, Computer and Software Engineering Dr. Jing Ren Jing Ren BSc, MBA, PhD (Western), PEng Professor Department of Electrical, Computer and Software Engineering Faculty of Engineering and Applied Science Contact information 2000 Simcoe Street North Oshawa, Ontario L1G 0C5 Office: ERC 3033 905.721.8668 ext. 2865 905.721.3370 (fax) jing.ren@ontariotechu.ca Research topics Haptics and virtual reality robotics and control image processing soft computing Education MBA, Schulich Business School, York University, Canada, 2018 PhD (Electrical Engineering), University of Western Ontario, Canada, 2005 MSc (Electrical Engineering), University of Western Ontario, Canada, 2003 BSc (Electrical Engineering), Shandong University, China, 1993 Courses Discrete Mathematics Introductory Electronics Circuit Design Advanced Control Systems Advanced Image Processing Electric Circuits Introduction to Programming Intelligent Control Systems Computer Architecture Introduction to Control Systems Discrete-Time Control Systems Introduction to Engineering Research and expertise Work experience Honours and awards Robarts Research Institute, Postdoctoral Fellow, 2005-2006 Ontario Graduate Scholarship (OGS), York University, (2017-2018) Dean’s Entrance Award, Schulich Business School, York University, 2017 University Faculty Award (2006-2011) Ontario Graduate Scholarship (OGS), Western University, (2004-2005) Publications and presentations Selected publications and presentations X. Huang, J. Moore, G. Guiraudon, D. Boughner, J. Ren and T.M. Peters, “Rapid Registration of 2D Ultrasound and 3D CT Images for Surgical Guidance”, IEEE Transaction on Medical Imaging, 2008 (Accepted). J. Ren, R.V. Patel, K.A. McIsaac, G. Guiraudon and T. M. Peters, Dynamic 3D Virtual Fixtures of the Beating Heart, IEEE Transaction on Medical Imaging, Volume: 27, No. 8, pp.1061-1070, 2008 J. Ren, K.A. McIsaac and R.V. Patel, Modified Newton's Method Applied to Motion Planning for Nonholonomic Mobile Robots, Robotica, Volume: 26, pp. 285-294, 2007 X. Huang, D. Ho, J. Ren and L.F. Capretz, Improving the COCOMO Model with a Neuro-Fuzzy Approach, Applied Soft Computing, Volume: 7, Issue: 1, pp. 29-44, January 2007 J. Ren, K.A. McIsaac, R.V. Patel and T.M. Peters, A New Potential Model Using Generalized Sigmoid Functions, to appear in IEEE Transaction on Systems, Man and Cybernetics (Part B), Volume: 37, No. 2, pp. 477- 484, 2007 J. Ren, K.A. McIsaac and R.V. Patel, Modified Newton Method Applied to Potential Field Based Motion Planning, IEEE Transaction on Robotics, Volume: 21, Issue: 2, pp. 384-391, 2006 J. Ren, K.A. McIsaac and R.V. Patel, A Hybrid Navigation Scheme for Reconfigurable Multi-Agent Teams, International Journal of Robotics and Automation, Volume: 21, Issue: 2, 2006 X. Huang, D. Ho, J. Ren and L.F. Capretz, A Soft Computing Framework for Software Effort Estimation, Soft Computing, Volume: 10, Issue: 2, pp. 170-177, 2006 C. Zhang and J. Ren, Fuzzy-PI Composite Control System for Urea Absorbing Tower of Luman Fertilizer Factory, Basic Automation (in Chinese), No. 3, pp. 135-143, 1995 Patents X. Huang, D. Ho, J. Ren, L.F. Capretz, “System and Method for Software Estimation”, U.S. Patent, No. 10/920,236, Jan. 2008",
  "content_length": 8521,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:59"
}