{
  "name": "Jingchao Ni",
  "homepage": "https://nijingchao.github.io",
  "status": "success",
  "content": "Jingchao Ni Home  | Publications  | Teaching  | Services  | D2I Group Short Bio I am an Assistant Professor in the Department of Computer Science at the University of Houston. Prior to this, I was a researcher at the Data Science Department of NEC Labs from 2018 to 2022 and the AWS AI Labs from 2022 to 2024. I received my Ph.D. degree from College of IST, The Pennsylvania State University in 2018, advised by Prof. Xiang Zhang. My research is centered around machine learning, data mining, and artificial intelligence, with a focus on time series analysis through cross-modal learning, multimodal integration, and LLM reasoning. My research has been extended to applications in healthcare (including personalized healthcare, press coverage: Science Japan, KeguanJP), biomedicine, cyber-physical systems, and AIOps (e.g., deployed in AWS cloud systems), and published in refereed conferences (e.g., ICLR, ICML, NeurIPS, ACL, AAAI, CVPR, KDD, WWW) and journals (e.g., IEEE TKDE, ACM TKDD), with more than 20 patents filed or granted. Research Interests Machine learning: time series analysis with LVMs/LLMs/LMMs; agentic AI; generative models; anomaly/OOD analysis; graph learning Data science: AI for science (e.g., neuroscience, geoscience), AI for social good (e.g., healthcare, cyber-physical systems, AIOps) News [Prospective Students] I am looking for self-motivated Ph.D. students to join my group in Fall 2026. If you are interested, please drop me an email at jni7 [at] uh [dot] edu with your CV/resume, transcripts and any materials that you think are helpful. Selected Publications Full List | Google Scholar | DBLP ♮ indicates equal contribution, ★ indicates students / interns I have advised. Multi-Modal View Enhanced Large Vision Models for Long-Term Time Series Forecasting ChengAo Shen★, Wenchao Yu, Ziming Zhao★, Dongjin Song, Wei Cheng, Haifeng Chen, Jingchao Ni Proceedings of the Conference on Neural Information Processing Systems (NeurIPS), 2025 Github Harnessing Vision Models for Time Series Analysis: A Survey Jingchao Ni, Ziming Zhao★, ChengAo Shen★, Hanghang Tong, Dongjin Song, Wei Cheng, Dongsheng Luo, Haifeng Chen Proceedings of the International Joint Conferences on Artificial Intelligence (IJCAI), 2025 Github Multi-modal Time Series Analysis: A Tutorial and Survey Yushan Jiang, Kanghui Ning, Zijie Pan, Xuyang Shen, Jingchao Ni, Wenchao Yu, Anderson Schneider, Haifeng Chen, Yuriy Nevmyvaka, Dongjin Song Proceedings of the ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD), 2025 Github [website] Exploring Multi-Modal Data with Tool-Augmented LLM Agents for Precise Causal Discovery ChengAo Shen★, Zhengzhang Chen, Dongsheng Luo, Dongkuan Xu, Haifeng Chen, Jingchao Ni Proceedings of the Annual Meeting of the Association for Computational Linguistics (ACL Findings), 2025 Github Interpreting Graph Neural Networks with In-Distributed Proxies Zhuomin Chen, Jiaxing Zhang, Jingchao Ni, Xiaoting Li, Yuchen Bian, Md Mezbahul Islam, Ananda Mohan Mondal, Hua Wei, Dongsheng Luo Proceedings of the International Conference on Machine Learning (ICML), 2024 Truestworthy Learning on Graphs Workshop at the Web Conference (TrustLOG @ WWW), 2024 [pdf] Github Hierarchical Gaussian Mixture based Task Generative Model for Robust Meta-Learning Yizhou Zhang★, Jingchao Ni, Wei Cheng, Zhengzhang Chen, Liang Tong, Haifeng Chen, Yan Liu Proceedings of the Conference on Neural Information Processing Systems (NeurIPS), 2023 Superclass-Conditional Gaussian Mixture Model for Learning Fine-Grained Embeddings Jingchao Ni, Wei Cheng, Zhengzhang Chen, Takayoshi Asakura, Tomoya Soma, Sho Kato, Haifeng Chen The International Conference on Learning Representations (ICLR), 2022 (Spotlight Presentation, 5%) Github FACESEC: A Fine-Grained Robustness Evaluation Framework for Face Recognition Systems Liang Tong, Zhengzhang Chen, Jingchao Ni, Wei Cheng, Dongjin Song, Haifeng Chen, Yevgeniy Vorobeychik Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR), 2021 Github [arXiv] [suppl] Dynamic Gaussian Mixture based Deep Generative Model for Robust Forecasting on Sparse Multivariate Time Series Yinjun Wu★, Jingchao Ni, Wei Cheng, Bo Zong, Dongjin Song, Zhengzhang Chen, Yanchi Liu, Xuchao Zhang, Haifeng Chen, Susan Davidson Proceedings of the AAAI International Conference on Artificial Intelligence (AAAI), 2021 Github [arXiv] Robust Graph Representation Learning via Neural Sparsification Cheng Zheng, Bo Zong, Wei Cheng, Dongjin Song, Jingchao Ni, Wenchao Yu, Haifeng Chen, Wei Wang Proceedings of the International Conference on Machine Learning (ICML), 2020 [suppl] Inductive and Unsupervised Representation Learning on Graph Structured Objects Lichen Wang, Bo Zong, Qianqian Ma, Wei Cheng, Jingchao Ni, Wenchao Yu, Yanchi Liu, Dongjin Song, Haifeng Chen, Yun Fu The International Conference on Learning Representations (ICLR), 2020 Asymmetrical Hierarchical Networks with Attentive Interactions for Interpretable Review-based Recommendation Xin Dong★, Jingchao Ni, Wei Cheng, Zhengzhang Chen, Bo Zong, Dongjin Song, Yanchi Liu, Haifeng Chen, Gerard de Melo Proceedings of the AAAI International Conference on Artificial Intelligence (AAAI), 2020 [arXiv] A Deep Neural Network for Unsupervised Anomaly Detection and Diagnosis in Multivariate Time Series Data C. Zhang, D. Song, Y. Chen, X. Feng, C. Lumezanu, W. Cheng, Jingchao Ni, B. Zong, H. Chen, N. Chawla Proceedings of the AAAI International Conference on Artificial Intelligence (AAAI), 2019 [arXiv] (Most Influential Papers of AAAI 2019 by PaperDigest)",
  "content_length": 5580,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:01"
}