{
  "name": "Jing Li 0025",
  "homepage": "https://web.njit.edu/~jingli",
  "status": "success",
  "content": "Jing Li N J I T Home Short Bio News Education Research Publications Awards Services Students Courses Jing Li Assistant Professor Department of Computer Science Ying Wu College of Computing New Jersey Institute of Technology Office: GITC 4106, University Heights, Newark, NJ 07102 E-mail: jingli AT njit DOT edu Short Bio My research encompasses a broad area of real-time systems, parallel computing, cyber-physical systems, and reinforcement learning for system design and optimization. I am particularly interested in developing theoretical foundations and practical platforms for executing parallel applications with temporal objectives, such as the applications in autonomous cyber-physical systems and interactive online cloud services. My work develops provably good and practically efficient platforms that provide quality of service guarantees to applications while preserving scalability on large-scale parallel systems. My recent interest also includes developing reinforcement learning frameworks for various system design tasks with huge search space, such as resource allocation in systems, traffic signal control, and circuit design automation. I received my Ph.D. at Washington University in St. Louis in 2017, where I was advised by Professor Chenyang Lu and Kunal Agrawal. News Positions available for self-motivated PhD students: I am interested in working with both strong theory students and strong system students. If you are interested in my research and working with me, please include some samples of your work when contacting me. I will serve as the Track 2 Deputy Chair of 29th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2023) on May 9-12, 2023. I will serve on the TPC of RTAS 2023, DATE 2023, and AAAI 2023. I received the Outstanding Achievement in Research from Ying Wu College of Computing at NJIT in 2022. I served as the Registrations Chair of 43rd IEEE Real Time Systems Symposium (RTSS 2022) on Dec 5-8, 2022. I served on the TPC of RTSS 2022, RTAS 2022, DAC 2022, PPoPP 2022, and HiPC 2022. I served as the Publicity Co-Chair of 28th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2022) on May 4-6, 2022. I served on the TPC of RTSS 2021, DAC 2021, and SPAA 2021. I co-chaired the 7th International Workshop on Mixed Criticality Systems on Dec 3rd 2019, affiliated with the Real Time Systems Symposium (RTSS 2019). I served on the TPC of RTSS 2020 and ICESS 2020. I attended the Workshop on Mathematical Challenges in Scheduling Theory in Oct 2019 at Tsinghua Sanya International Mathematical Forum (TSIMF), China. I served on the TPC of RTAS 2020, and ICCCN 2020. I attended the Annual Summit on Women and IT as one of the representatives at NJIT, organized by National Center for Women and Information Technology (NCWIT), May 2019. I attended the Dagstuhl Seminar of Analysis, Design, and Control of Predictable Interconnected Systems in March 2019 in Dagstuhl, Germany. I served on the TPC of EMSOFT 2019, ESA 2019, RTAS 2019, ICCCN 2019 and ISORC 2019. Our paper titled \"Reservation-Based Federated Scheduling for Parallel Real-Time Tasks\" received Outstanding Paper Award at RTSS 2018. Congrats! I attended the Aussois Seminar of New Challenges in Scheduling Theory in April 2018 in Aussois, France. My thesis titled \"Parallel Real-Time Scheduling for Latency-Critical Applications\" received the Turner Dissertation Award at Washington University in St Louis in 2017. I am excited to join the Department of Computer Science at New Jersey Institute of Technology as an assistant professor. Education Ph.D. in Computer Science, Washington University in St. Louis (Summer 2017) Thesis: Parallel Real-Time Scheduling for Latency-Critical Applications Advisors: Chenyang Lu, Kunal Agrawal M.S. in Computer Science, Washington University in St. Louis (2014) Thesis: Global EDF Scheduling for Parallel Real-Time Tasks B.S. in Computer Science, Harbin Institute of Technology, China (2011) Research Research Interests: Real-Time and Cyber-Physical Systems Parallel Computing Reinforcement Learning for System Design and Optimization Scheduling and Operations Research Current Projects: Enabling Efficient Real-Time Systems upon Multiple Parallel Resources [NSF CRII:CSR] Model-based Reinforcement Learning with Active Learning for Converter Design [ARPA-E, IBM] Research Experience: Parallel Real-Time Scheduling for AI-Enhanced Systems Establish new scheduling paradigm for systems with complex interactions among real-time tasks using AI algorithms Develop theoretical foundations to enable parallel real-time systems to utilize multiple resources efficiently Design system methodologies and mechanisms to effectively handle the interdependencies between tasks and multiple resources Devise the formulation of the holistic performance modeling and optimization in AI-Enhanced Systems Reinforcement Learning for System Design, Scheduling, and Optimization Develop reinforcement learning framework for scheduling in complex systems Extend the reinforcement learning framework for solving general mixed integer optimization Apply active learning to improve the efficiency of the optimization Design effective parallelization methods for reinforcement learning Scheduling Parallel Jobs in Interactive Cloud Services Research Intern, Microsoft Research, Redmond, USA (06/2014 to 09/2014) Mentors: Sameh Elnikety, Yuxiong He, Kathryn McKinley Design a new parallel scheduling strategy to improve tail latency of jobs Implement the scheduler in a parallel runtime system (Intel Thread Building Block) Reduce tail latency on real-world workloads (Bing search and finance server workloads) Parallel Real-Time Scheduling Theory and System Research Assistant, Washington University in St. Louis (01/2012 to 08/2017) Develop theoretical techniques for analyzing real-time schedulers for parallel tasks Prove best known theoretical bounds for well known real-time schedulers Design novel scheduling strategies with provably better performances for various scenarios Implement practically efficient schedulers in middleware systems to run parallel real-time applications written in widely used parallel languages (OpenMP and Cilk Plus) Online Scheduling Problem for Parallel Jobs Research Assistant, Washington University in St. Louis (06/2014 to 08/2017) Propose online schedulers for parallel jobs with various temporal objectives Analyze and proving performance bounds for proposed schedulers Improve schedulers to reduce overheads while maintaining comparable theoretical performances Implement practical schedulers in a parallel runtime system (Cilk Plus) Publications Google Scholar Profile 2023 W. Du, J. Ye, J. Gu, J. Li, H. Wei, and G. Wang. SafeLight: A Reinforcement Learning Method toward Collision-free Traffic Signal Control. AAAI Conference on Artificial Intelligence (AAAI'23), February 2023. Z. Wang, J. Zhao, K. Agrawal, H. Liu, M. Xu, and J. Li. Provably Good Randomized Strategies for Data Placement in Distributed Key-Value Stores. ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming (PPoPP'23), March 2023. 2022 W. Jia, J. Zhang, J. Shan, J. Li, and X. Ding. Achieving Low Latency in Public Edges by Hiding Workloads Mutual Interference. ACM Symposium on Cloud Computing (SoCC'22), pp. 477-492. November 2022. S. Fan, S. Zhang, J. Liu, N. Cao, X. Guo, J. Li, and X. Zhang. Power Converter Circuit Design Automation using Parallel Monte Carlo Tree Search. ACM Transactions on Design Automation of Electronic Systems (TODAES), July 2022. Z. Wang, C. Xu, K. Agrawal, and J. Li. Adaptive Scheduling of Multiprogrammed Dynamic-Multithreading Applications. Journal of Parallel and Distributed Computing (JPDC), vol. 162, pp. 76-88, April 2022. J. Bian, A. Arafat, H. Xiong, J. Li, L. Li, H. Chen, J. Wang, D. Dou, and Z. Guo. Machine Learning in Real-Time Internet of Things (IoT) Systems: A Survey. IEEE Internet of Things Journal (IOTJ), 9(11), pp. 8364-8386, March 2022. L. Nie, C. Fan, S. Lin, L. Zhang, Y. Li, and J. Li. Holistic Resource Allocation under Federated Scheduling for Parallel Real-Time Tasks. ACM Transactions on Embedded Computing Systems (TECS), 21(1), pp.1-29, January 2022. 2021 J. Li, K. Agrawal, and C. Lu. Parallel Real-Time Scheduling. In: Tian YC., Levy D.C. (eds), Handbook of Real-Time Computing. Springer, 2021. S. Fan, N. Cao, S. Zhang, J. Li, X. Guo, and X. Zhang. From Specification to Topology: Automatic Power Converter Design via Reinforcement Learning. IEEE/ACM International Conference on Computer-Aided Design Proceedings (ICCAD'21), November 2021. 2020 K. Agrawal, S. Baruah, Z. Guo, J. Li, and S. Vaidhun. Hard-Real-Time Routing in Probabilistic Graphs to Minimize Expected Delay. IEEE Real-Time Systems Symposium (RTSS'20), December 2020. Z. Wang, C. Xu, K. Agrawal, and J. Li. AMCilk: A Framework for Multiprogrammed Parallel Workloads. IEEE International Conference on High Performance Computing, Data, and Analytics (HiPC'20), December 2020. K. Agrawal, S. Baruah, Z. Guo, and J. Li. The Safe and Effective Application of Probabilistic Techniques in Safety-Critical Systems. IEEE/ACM International Conference on Computer-Aided Design Proceedings (ICCAD'20), November 2020. L. Ben Yamin, J. Li, K. Sarpatwar, B. Schieber, and H. Shachnai. Maximizing Throughput in Flow Shop Real-Time Scheduling. International Conference on Approximation Algorithms for Combinatorial Optimization Problems (APPROX'20), August 2020. J. Sun, J. Li, Z. Guo, A. Zou, X. Zhang, K. Agrawal, and S. Baruah, Real-Time Scheduling upon a Host-Centric Acceleration Architecture with Data Offloading, IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS'20), April 2020. K. Agrawal, S. Baruah, P. Ekberg and J. Li, Optimal Scheduling of Measurement-Based Parallel Real-Time Tasks. Real-Time Systems (RTS), vol. 56, no. 3, pp. 247-253. Springer, March 2020. X. Ni, J. Li, M. Yu, W. Zhou, and K. Wu. Generalizable Resource Allocation in Stream Processing v",
  "content_length": 18575,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:58"
}