{
  "name": "Jing Li 0073",
  "homepage": "https://www.seas.upenn.edu/~janeli/index.html",
  "status": "success",
  "content": "i!DOCTYPE html> Jing (Jane) Li Jing (Jane) Li Eduardo D. Glandt Faculty Fellow, Associate Professor (with tenure) Department of Electrical and Systems Engineering Department of Computer and Information Science University of Pennsylvania Email: janeli at seas.upenn.edu Lab website: PennCIL Google Scholar LinkedIn Twitter ORCID CV Dr. Jing (Jane) Li is the Eduardo D. Glandt Faculty Fellow and Associate Professor (with tenure) at the Department of Electrical and System Engineering and the Department of Computer and Information Science at the University of Pennsylvania. Previously she was the Dugald C. Jackson Assistant Professor at the University of WisconsinâMadison and a faculty affiliate with the UW-Madison Computer Architecture group and Machine Learning group. She is one of the PIs in SRC JUMP center â Center for Research on Intelligent Storage and Processing-In-Memory (CRISP). She spent her early career at IBM T. J. Watson Research Center as a Research Staff Member after obtaining her PhD degree from Purdue University in 2009. She is attracted to all the big problems she can find in computer system across the stack regardless the specific sub-areas. She is a passionate computer experimentalist and enjoy building real computer systems (both hardware and software). She has made contributions to the following “memory-centric” areas: 1) domain-specific accelerator and its interaction with emerging memories (HMC/HBM/NVM), 2) programmable in-memory computing architecture enabled by emerging nonvolatile memories (PCM/RRAM), 3) system support (e.g., virtualization) for accelerators (e.g., FPGA), and 4) FPGA-based full system simulation infrastructure (MEG) for memory system research. She has strong ties with leading technology companies and has successful technology transfer experience (>40 issued/pending patents). She is the recipient of prestigious NSF Career Award in 2018, DARPA’s Young Faculty Award (one out of 2 in computer area and one out of 26 across all areas in science and technology nationwide, the first awardee in computer engineering and computer science at UW-Madison) in 2016, WARF Innovation Awards (WIA) Finalist (only 6 patented technologies out of 400+ patents got selected university wide), IBM Research Division Outstanding Technical Achievement Award in 2012 for successfully achieving CEO milestone, multiple invention achievement awards and high value patent application awards from IBM from 2010-2014, IBM Ph.D. Fellowship Award in 2008, Meissner Fellowship in 2004 from Purdue University, etc. Her research was reported by Yahoo News, Newegg Business, Digital Trends, etc. And she was featured in Madison Magazine (Channel 3000) as a rising research star. She has been serving on the technical committee for the ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), International Symposium on Computer Architecture (ISCA), MLSys, International Symposium on High Performance Computer Architecture (HPCA), International Symposium on Field-Programmable Gate Arrays (FPGA), International Symposium on Field-Programmable Custom Computing Machines (FCCM), Design Automation Conference (DAC), International Conference on ComputerâAided Design (ICCAD), International Symposium on Low Power Electronics and Design (ISLPED), International Symposium on Microarchitecture (MICRO) (external), IEEE International Symposium on Circuits and Systems (ISCAS), International Electron Devices Meeting (IEDM), etc.. She served as the advisory chair/general chair / technical chair / finance chair / publicity chair for a premier industry memory conference, International Memory Workshop (IMW) and co-organized it with Intel/Micron/SK Hynix/CEA LETI to hold annual meetings with worldwide memory vendors. She is in the Steering/Organizing Committee for IMW, and serves as the Publicity Chair for FPGA'20, FPGA'19 and ISLPED'18, the Demo Chair for MLSys'20 . She is an editor for Journal of Low Power Electronics (JOLPE), and associate editor for Transactions on Reconfigurable Technology and System (TRETS) and IEEE Computer Architecture Letters (CAL). She is serving at ACM SIGDA Technical Committee on FPGAs and Reconfigurable Computing (TC-FPGA). Education PhD in Computer Engineering, 2009 Purdue University BSc in Electrical Engineering, 2004 Shanghai Jiaotong University Research Interests Computer Architecture Compiler Machine Learning Distributed Systems VLSI Selected Honors and Awards Eduardo D. Glandt Faculty Fellow, University of Pennsylvania, 2020 Johnson & Johnson WiSTEM2D Scholars Award Nominee (sole nominee university wide in the Engineering category), University of Wisconsin-Madison, 2019 Madison Teaching and Learning Excellence (MTLE) faculty fellowship, 2019 Best Paper nominee, FCCM, 2019 Best of CAL (Best Paper Award), IEEE Computer Architecture Letters, 2018 Moore Inventor Fellowship Nominee (1 out of 2 university wide), University of Wisconsin-Madison, 2018 NSF Career Award, National Science Foundation, 2018 Featured in Madison Magazine (Channel 3000) as a Rising Research Star, 2017 Dugald C. Jackson Faculty Scholar of Electrical and Computer Engineering Â (named after the first department chair of ECE),Â University of Wisconsin-Madison, 2017 Hilldale Faculty Research Fellowship,Â University of Wisconsin-Madison, 2017 DARPA Young Faculty Award, Defense Advanced Research Projects Agency (one out of 2 in computer area and one out of 26 across all areas in science and technology nationwide, the first awardee in computer engineering and computer science at UW-Madison), 2016 WARFÂ Innovation Awards (WIA) Finalist, University of Wisconsin-Madison (6 out of 400++ patents), 2016 VLSI Transactions Best Paper Award, IEEE Circuits and Systems Society, 2013 Outstanding Research Division Technical Achievement Award ( highest technical award for successfully achieving CEO milestone on Storage Class Memory), IBM T. J. Watson, 2012 IBM High ValueÂ Patent Application Awards, IBM T. J. Watson, 2014 IBM Invention Achievement Awards, IBM T. J. Watson, 2010-15 IBM PhDÂ Fellowship Award, 2008-09 The Dean’s and Semester Honors for Outstanding Scholastics Performance, Purdue University, 2007-08. Magoon Award for Excellence in Teaching, Purdue University, 2005-06 Meissner Fellowship Award, Electrical and Computer Engineering department, Purdue University, 2004-05. Publications Students under my supervision are denoted by \"S\" Selected Invited Talks (external) âLiquid Silicon: A New Computing Paradigm Enabled by Monolithic 3D Cross-point Memory,â Dept. of Electrical and Computer Engineering, Stanford University, Apr. 3rd, 2019 âLiquid Silicon: A New Computing Paradigm Enabled by Monolithic 3D Cross-point Memory,â Dept. of Electrical and Systems department, University of Pennsylvania, Feb. 7th, 2019 âLiquid Silicon: A New Computing Paradigm Enabled by Monolithic 3D Cross-point Memory,â Dept. of Electrical and Computer Engineering, Cornell University, Dec. 12th, 2018 âLiquid Silicon: A New Computing Paradigm Enabled by Monolithic 3D Cross-point Memory,â Dept. of Electrical and Computer Engineering, Carnegie Mellon University (CMU), Nov. 30th, 2018. âLiquid Silicon: A New Computing Paradigm Enabled by Monolithic 3D Cross-point Memory,â Dept. of Computer Science, University of Chicago, Nov. 6th, 2018 âLiquid Silicon: A New Computing Paradigm Enabled by Monolithic 3D Cross-point Memory,â Dept. of Electrical Engineering, Yale University, Nov. 2nd, 2018. âLiquid Silicon: A New Computing Paradigm Enabled by Monolithic 3D Cross-point Memory,â Dept. of Electrical and Computer Engineering, University of California, Los Angeles (UCLA), 12:30pmâ1:30pm PST, Oct. 15th, 2018. âLiquid Silicon: A New Computing Paradigm Enabled by Monolithic 3D Cross-point Memory,â Harvard University, 3:00pmâ4:00pm EST, September 28th, 2018 âEnabling Nonvolatile Memory forÂ Data-Centric Computing: Technology, Circuit and System,â Panasonic Corp., 4:00pm to 5:00pm, Kyoto, Japan, July 16th, 2015 âEnabling Phase-change Memory forÂ Data-Centric Computing: Technology, Circuit and System,âÂ Special session at IEEE international Symposium on Circuits and Systems (ISCAS), Lisbon, May 25th, 2015 âEmerging-Materials-Enabled Devices for Data-Centric Computing,â Special guest lecture co-sponsored by CTO, APTD, and WPDN, Applied Materials, 3:00pm â 4:00pm PST, August 27th, 2014 âData Centric Computing in Emerging Technologies: A PCM-CMOS Hybrid Hardware Accelerator,â Colloquium of Electrical and Computer department at Purdue University, 3:00pm â 4:00pm EST, April 28th, 2014 âData Centric Computing in Emerging Technologies: A PCM-CMOS Hybrid Hardware Accelerator,â Colloquium of Electrical and Systems department at University of Pennsylvania, 11:00am â 12:00pm EST, March 17th, 2014 âData Centric Computing in Emerging Technologies: A PCM-CMOS Hybrid Hardware Accelerator,â Electrical Engineering Seminar Series at Harvard University, 3:00pm â 4:00pm EST, March 7th, 2014 âData Centric Computing in Emerging Technologies: A PCM-CMOS Hybrid Hardware Accelerator,â Electrical and Computer Engineering Department Seminar at University of Illinois Urbana-Champaign (UIUC), 4:00pm â 5:00pm CST, March 3rd, 2014 âData Centric Computing in Emerging Technologies: A PCM-CMOS Hybrid Hardware Accelerator,â Computer Engineering Seminar at University of California Santa Barbara (UCSB), 11:00am â 12:00pm PST, February 12th, 2014 âData Centric Computing in Emerging Technologies: A PCM-CMOS Hybrid Hardware Accelerator,â Joint CSSI and CALCM Seminar Series at Carnegie Mellon University (CMU), 12:00pm â 1:00pm EST, 1st, 2013 âData Centric Computing in Emerging Technologies: A PCM-CMOS Hybrid Hardware Accelerator,â Electrical Engineering Seminar Series at University of California, Los Angeles (UCLA), 1:00pm â 2:30pm PDT, Oct 28th, 2013 âData Centric Computing in Emerging Technologies",
  "content_length": 12005,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:57"
}