{
  "name": "Jingwen Leng",
  "homepage": "https://www.cs.sjtu.edu.cn/~leng-jw/index.html",
  "status": "success",
  "content": "Jingwen Leng's Homepage Welcome Welcome to my home page I am a Professor in John Hopcroft Computer Science Center and Computer Science and Engineering Department at Shanghai Jiao Tong University. I received the Ph.D. degree from the University of Texas at Austin. My past research focused on improving the efficiency and resiliency of general-purpose GPUs. I was the lead co-author for GPUWattch, one of the most widely used open-sourced GPU power model. I am currently interested at building intelligent and robust system for artificial intelligence. I believe the virtuous cycle of algorithm-software-hardware is the key to enable next-generation AI technology in practice. This is the golden age to conduct research on computer architecture and system. I am looking for self-motivated students who would like to conduct high-quality research in building efficient and reliable systems for deep learning. Please send me an email if you are interested at working with me. You can find our group reading list here.Office: éµè¡æ ¡åºè½¯ä»¶å­¦é¢1å·æ¥¼410Lab (Mostly)ï¼éµè¡æ ¡åºçµä¿¡ç¾¤æ¥¼3å·æ¥¼119Email: leng-jw at sjtu dot edu dot cnNewsI am promoted to full professor. I am teaching EI 200 Computer Organization in the spring 2020. The course information can be found here. Project \"Robust and Efficient System Architecture for AI Applications with Effective Path\" is funded by MSRA.I am co-teaching graduate course Advanced Computer Architecture. The course information can be found here.Project \"Asymmetric Resilience for Reliable Accelerator-Rich Systems\" is funded NSFC.I am teaching EE 204 Embedded System Principle and Practice (åµå ¥å¼ç³»ç»åçä¸å®éª) in the spring 2018. The course information can be found here.I am looking for self-motivated graduate students as well as undergrads who are interested in conducting high-quality research in building efficient and reliable systems for deep learning.EducationPh.D., The University of Texas at Austin, 2012 - 2016M.S., The University of Texas at Austin, 2010 - 2012B.S., Shanghai Jiao Tong University, 2006 - 2010Industry ExperienceIBM T.J. Watson Research Center, Research Intern, March 2015 - December 2016SRI International, Research Intern, Summer 2013Samsung Austin Research and Development Center, Summer Intern, Summer 2011",
  "content_length": 2304,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:04"
}