{
  "name": "Jing Zhang 0001",
  "homepage": "https://xiaojingzi.github.io",
  "status": "success",
  "content": "Jing Zhang's Homepage Jing ZHANG Professor Department of Computer Science and Technology School of Information Renmin University of China Email: zhang-jing AT ruc DOT edu DOT cn Address: Room 427, Information Building, Renmin University of China, Beijing Publications | Students | Talks | Services | Teaching I am a professor at School of Information, Renmin University of China. Prior to that, I received my Ph.D. degree from Department of Computer Science and Technology, Tsinghua University under supervision of Professor Jie Tang and Professor Juanzi Li. My research focuses on data mining and knowledge discovery, with an emphasis on tailoring large language models (LLMs) for structured data processing to advance their application in data science. Specifically, I investigate model alignment methods, including data synthesis and learning from human-AI feedback, to enhance LLMs' capabilities in querying, manipulating, and analyzing structured data stored in databases, spreadsheets, and APIs. Additionally, I explore model compression techniques and efficient inference methods to improve the efficiency of post-training and deployment of these models. More information about my experience and research can be found on Google Scholar. I am looking for highly-motivated students to work with me. If interested, please drop me a message by email. Publications all : conference | journal | pre-print LLM : LLM Alignment | LLM Compression | LLM Inference Acceleration | LLM for Structured Data | LLM4DB | LLM Tool Using | LLM Hallucination | LLM Evaluation | VLM | VLM Evaluation knowledge reasoning : entity linking | entity alignment | knowledge graph completion | question answering | dialogue | text2sql graph representation learning : gnn | pre-training and SSL for gnn | probabilistic graphic model | node similarity social computing : recommendation | social influence | link prediction Optimizing Native Sparse Attention with Latent Attention and Local Global Alternating Strategies. Yuxuan Hu, Jianchao Tan, Jiaqi Zhang, Wen Zan, Pingwei Sun, Yifan Lu, Yerui Sun, Yuchen Xie, Xunliang Cai, Jing Zhang* arXiv:2511.00819. GeoVLMath: Enhancing Geometry Reasoning in Vision-Language Models via Cross-Modal Reward for Auxiliary Line Creation. Shasha Guo, Liang Pang, Xi Wang, Yanling Wang, Huawei Shen, Jing Zhang* arXiv:2510.11020. A Multi-Agent Collaborative Framework for Database Konb Tuning. Yiyan Li, Haoyang Li, Jing Zhang, Renata Borovica-Gajic, Shuai Wang, Tieying Zhang, Jianjun Chen, Rui Shi, Cuiping Li, Hong Chen SIGMOD'26. Efficient Low-Rank Adaptation for Sparse Large Language Model. Yuxuan Hu, Tian Tian, Xiaodong Chen, Zhe Zhao, Tao Tao, Weifang Zhang, Yuanfeng Li, Yuhang Liang, Cuiping Li, Hong Chen, Jing Zhang* Tsinghua Science and Technology'25. Hidden Question Representations Tell Non-Factuality Within and Across Large Language Models. Yanling Wang, Haoyang Li, Hao Zou, Jing Zhang*, Xinlei He, Qi Li, Ke Xu EMNLP'25. A Query Optimization Method Utilizing Large Language Models. Zhiming Yao, Haoyang Li, Jing Zhang*, Cuiping Li, Hong Chen arXiv:2503.06902. LLMIdxAdvis: Resource-Efficient Index Advisor Utilizing Large Language Model. Xinxin Zhao, Haoyang Li, Jing Zhang*, Xinmei Huang, Tieying Zhang, Jianjun Chen, Rui Shi, Cuiping Li, Hong Chen arXiv:2503.07884. E2ETune: End-to-End Knob Tuning via Fine-tuned Generative Language Model. Xinmei Huang, Haoyang Li, Jing Zhang*, Xinxin Zhao, Zhiming Yao, Yiyan Li, Tieying Zhang, Jianjun Chen, Hong Chen, Cuiping Li VLDB'26. OmniSQL: Synthesizing High-quality Text-to-SQL Data at Scale. Haoyang Li, Shang Wu, Xiaokang Zhang, Xinmei Huang, Jing Zhang*, Fuxin Jiang, Shuai Wang, Tieying Zhang, Jianjun Chen, Rui Shi, Hong Chen, Cuiping Li VLDB'25. Dynamic Scaling of Unit Tests for Code Reward Modeling. Zeyao Ma, Xiaokang Zhang, Jing Zhang*, Jifan Yu, Sijia Luo, Jie Tang ACL'25. VisualSimpleQA: A Benchmark for Decoupled Evaluation of Large Vision-Language Models in Fact-Seeking Question Answering. Yanling Wang, Yihan Zhao, Xiaodong Chen, Shasha Guo, Lixin Liu, Haoyang Li, Yong Xiao, Jing Zhang*, Qi Li, Ke Xu arXiv:2503.06492. benchmark SAM Decoding: Speculative Decoding via Suffix Automaton. Yuxuan Hu, Ke Wang, Xiaokang Zhang, Fanjin Zhang, Cuiping Li, Hong Chen, Jing Zhang* ACL'25. P^2Law: Scaling Law for Post-Training After Model Pruning. Xiaodong Chen, Yuxuan Hu, Xiaokang Zhang, Yanling Wang, Cuiping Li, Hong Chen, Jing Zhang* ACL'25. Uncovering the Impact of Chain-of-Thought Reasoning for Direct Preference Optimization: Lessons from Text-to-SQL. Hanbing Liu, Haoyang Li, Xiaokang Zhang, Ruotong Chen, Haiyong Xu, Tian Tian, Qi Qi, Jing Zhang* ACL'25. CoT-based Synthesizer: Enhancing LLM Performance through Answer Synthesis. Bohan Zhang, Xiaokang Zhang, Jing Zhang*, Jifan Yu, Sijia Luo, Jie Tang ACL'25. TableLLM: Enabling Tabular Data Manipulation by LLMs in Real Office Usage Scenarios. Xiaokang Zhang, Sijia Luo, Bohan Zhang, Zeyao Ma, Jing Zhang*, Yang Li, Guanlin Li, Zijun Yao, Kangli Xu, Jinchang Zhou, Daniel Zhang-Li, Jifan Yu, Shu Zhao, Juanzi Li, Jie Tang Findings of ACL'25. code&model&data&demo Compressing Large Language Models by Streamlining the Unimportant Layer. Xiaodong Chen, Yuxuan Hu, Jing Zhang*,Yanling Wang, Cuiping Li, Hong Chen ICLR'25. A Solution-based LLM API-using Methodology for Academic Information Seeking. Yuanchun Wang, Jifan Yu, Zijun Yao, Jing Zhang*, Yuyang Xie, Shangqing Tu, Yiyang Fu, Youhe Feng, Jinkai Zhang, Jingyao Zhang, Bowen Huang, Yuanyao Li, Huihui Yuan, Lei Hou, Juanzi Li, Jie Tang KDD'25. code model checkpoint demo benchmark Large Language Model for Table Processing: A Survey. Weizheng Lu, Jing Zhang*, Ju Fan, Zihao Fu, Yueguo Chen, Xiaoyong Du Frontiers of Computer Science (FCS'24). SpreadsheetBench: Towards Challenging Real World Spreadsheet Manipulation. Zeyao Ma, Bohan Zhang, Jing Zhang*, Jifan Yu, Xiaokang Zhang, Xiaohan Zhang, Sijia Luo, Xi Wang, Jie Tang Neurips'24. code&data PowerPM: Foundation Model for Power Systems. Shihao Tu, Yupeng Zhang, Jing Zhang, Zhendong Fu, Yin Zhang, and Yang Yang. Neurips'24. PCQPR: Proactive Conversational Question Planning with Reflection. Shasha Guo, Lizi Liao, Jing Zhang, Cuiping Li, Hong Chen EMNLP'24. R-Eval: A Unified Toolkit for Evaluating Domain Knowledge of Retrieval Augmented Large Language Models. Shangqing Tu, Yuanchun Wang, Jifan Yu, Yuyang Xie, Yaran Shi, Xiaozhi Wang, Jing Zhang*, Lei Hou, Juanzi Li KDD'24. code&data Transferable and Efficient Non-Factual Content Detection via Probe Training with Offline Consistency Checking. Xiaokang Zhang, Zijun Yao, Jing Zhang*, Kaifeng Yun, Jifan Yu, Juanzi Li, Jie Tang ACL'24. AlignBench: Benchmarking Chinese Alignment of Large Language Models. Xiao Liu, Xuanyu Lei, Shengyuan Wang, Yue Huang, Zhuoer Feng, Bosi Wen, Jiale Cheng, Pei Ke, Yifan Xu, Weng Lam Tam, Xiaohan Zhang, Lichao Sun, Hongning Wang, Jing Zhang, Minlie Huang, Yuxiao Dong, Jie Tang ACL'24. SP^3: Enhancing Structured Pruning via PCA Projection. Yuxuan Hu, Jing Zhang*, Zhe Zhao, Chen Zhao, Xiaodong Chen, Cuiping Li, Hong Chen. Findings of ACL'24. CodeS: Towards Building Open-source Language Models for Text-to-SQL. Haoyang Li, Jing Zhang*, Hanbing Liu, Ju Fan, Xiaokang Zhang, Jun Zhu, Renjie Wei, Hongyan Pan, Cuiping Li, Hong Chen. SIGMOD'24. code&model&data Disentangling Domain and General Representations for Time Series Classification. Youmin Chen, Xinyu Yan, Yang Yang, Jianfeng Zhang, Jing Zhang, Lujia Pan, Juren Li IJCAI'24. Authorship style transfer with inverse transfer data augmentation. Zhonghui Shao, Jing Zhang*, Haoyang Li, Xinmei Huang, Chao Zhou, Yuanchun Wang, Jibing Gong, Cuiping Li, Hong Chen AI Open'24. Open-World Semi-Supervised Learning for Node Classification. Yanling Wang, Jing Zhang*, Lingxi Zhang, Lixin Liu, Yuxiao Dong, Cuiping Li, Hong Chen, Hongzhi Yin. ICDE'24. A Cause-Effect Look at Alleviating Hallucination of Knowledge-grounded Dialogue Generation. Jifan Yu, Xiaohan Zhang, Yifan Xu, Xuanyu Lei, Zijun Yao, Jing Zhang, Lei Hou, Juanzi Li LREC-COLING'24. Diversifying Question Generation over Knowledge Base via External Natural Questions. Shasha Guo, Jing Zhang*, Xirui Ke, Cuiping Li, Hong Chen LREC-COLING'24. SGSH: Stimulate Large Language Models with Skeleton Heuristics for Knowledge Base Question Generation. Shasha Guo, Lizi Liao, Jing Zhang*, Yanling Wang, Cuiping Li, Hong Chen Findings of NAACL'24. A Generation-based Deductive Method for Math Word Problems. Yuxuan Hu, Jing Zhang*, Haoyang Li, Cuiping Li, Hong Chen. EMNLP'23. FFAEval: Evaluating Dialogue System via Free-For-All Ranking. Zeyao Ma, Zijun Yao, Jing Zhang*, Jifan Yu, Xiaohan Zhang, Juanzi Li, Jie Tang. Findings of EMNLP'23. GLM-Dialog: Noise-tolerant Pre-training for Knowledge-grounded Dialogue Generation. Jing Zhang, Xiaokang Zhang, Daniel Zhang-Li, Jifan Yu, Zijun Yao, Zeyao Ma, Yiqi Xu, Haohua Wang, Xiaohan Zhang, Nianyi Lin, Sunrui Lu, Juanzi Li, Jie Tang. KDD'23 (ADS). Web-Scale Academic Name Disambiguation: the WhoIsWho Benchmark, Leaderboard, and Toolkit. Bo Chen, Jing Zhang*, Fanjin Zhang, Tianyi Han, Yuqing Cheng, Xiaoyan Li, Yuxiao Dong, Jie Tang. KDD'23 (ADS). FC-KBQA: A Fine-to-Coarse Composition Framework for Knowledge Base Question Answering. Lingxi Zhang, Jing Zhang*, Yanling Wang, Shulin Cao, Xinmei Huang, Cuiping Li, Hong Chen, Juanzi Li. ACL'23. Chain of Thought Prompting Elicits Knowledge Augmentation. Dingjun Wu, Jing Zhang*, Xinmei Huang. Findings of ACL'23. RESDSQL: Decoupling Schema Linking and Skeleton Parsing for Text-to-SQL. Haoyang Li, Jing Zhang*, Cuiping Li, Hong Chen. AAAI'23. A Multi-Strategy based Pre-Training Method for Cold-Start Recommendation. Bowen Hao, Hongzhi Yin, Jing Zhang, Cuiping Li, Hong Chen. TOIS'23. A survey on complex factual question answering. Lingxi Zhang, Jing Zhang*, Xirui Ke, Haoyang Li, Xinmei Huang, Zhonghui Shao, Shulin Cao, Xin Lv. AI Open'22. Graph Contrastive Learning for Anomaly Detection. Bo Chen, Jing Zhang*, Xiaokang Zhang, Yuxiao Dong, Jian Song, ",
  "content_length": 24092,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:59"
}