{
  "name": "Jing Li 0049",
  "homepage": "http://www4.comp.polyu.edu.hk/~jing1li",
  "status": "success",
  "content": "Jing's Homepage Jing Li 李菁 Assistant Professor Department of Computing The Hong Kong Polytechnic University Address PQ 714, Mong Man Wai Building The Hong Kong Polytechnic University Hung Hom, Kowloon Hong Kong SAR, China Email jing-amelia.li [AT] polyu [DOT] edu [DOT] hk News [NEW] Our recent benchmark YesBut about humorous contradition understanding was accepted at NeurIPS 2024 for oral presentation. Congratulations to Zhe! [Paper] [Project] [Github] [Hugging Face] [NEW] Our recent research work AnglE for angle-optimized text embeddings was published at ACL 2024 and achieved over 4 million downloads on Hugging Face last month (over 10 million accmululated downloads since its opensource on Sep 2023). As of 18:00, 25 Feb 2025, it is ranked the top 64th globally by downloads among all HuggingFace models (DeepSeek R1 ranked 63rd). Congrats to Xianming, and thanks to the Hugging Face team! [Paper] [Github] [Hugging Face]. [NEW] Our recent research work with SUSTech, LLM4Decompile, for Decompiling Binary Code with Large Language Models was published at EMNLP 2024 and achieved over 5.1k stars (☆) on Github, ranked the top 0.214% among all Github projects. Congrats to Hanzhuo! [Paper] [Github]. [NEW] Congratulations to the establishment of PolyU Embodied Artificial Intelligence Lab under PolyU COMP. I'm excited to work with a wonderful team of research students and staff! Drop me your CV if you are interested in joining our team as a PhD/Research Associate/Research Assistant/Post-doc. I may not be able to reply all emails (but I do read them).! Biography Dr. Jing Li is an Assistant Professor of the Department of Computing, The Hong Kong Polytechnic University (PolyU) since 2019. She established and currently leads the PolyU Embodied Artificial Intelligence Lab under PolyU-COMP, and is a member of Research Centre of Data Sciences and Artificial Intelligence (RC-DSAI). Before joining PolyU, she worked in the Natural Language Processing Center, Tencent AI Lab as a senior researcher from 2017 to 2019. Jing obtained her PhD degree from the Department of Systems Engineering and Engineering Management, The Chinese University of Hong Kong in 2017 under supervision of Professor Kam-Fai Wong. Before that, she received her B.S. degree from Department of Machine Intelligence, Peking University in 2013. Jing has broad research interests on Natural Language Processing (NLP), Computational Social Science (CSS), and Machine Learning (ML). Particularly, she researches novel algorithms for language representation learning, social media language understanding, conversational and social interaction modeling, and language grounding for human-centered applications. The mission of her research is to make NLP models more human-like, with a human-centered focus on understanding humans, communicating with humans, and coexisting with humans in society. Research Topics Pre-training and Language Representation Learning Natural Language Understanding (NLU) for Social Media Contents Human-Centered Natural Language Processing (NLP) Large Language Models for Embodied Agents Selected Projects (as PI/PC) Aug 2024 - Jul 2029: PolyU Embodied Artificial Intelligence Lab. Gift Fund from Boyushenhang. Jul 2024 - Jun 2026: Simultaneous Translation for Multilingual Meetings. Gift Fund from Microware (Co-PIs: Dr. Jibin Wu and Dr. Yancheng Yuan) Jun 2024 - May 2025: Socially-Aligned Large Language Model and Its Applications. Gift Fund from Huawei. Apr 2023 - Apr 2026: AI-Care: A Multimodal Financial Assistant for the Visually Impaired. ITF (Innovation Technology Fund). Jul 2022 - Mar 2024: NLP-Enhanced STEM Education for Hong Kong Adolescents: A Trial Study on Secondary School Students. Gift Fund from HCL. Mar 2022 - Feb 2023: Knowledge-Enhanced Automatic Essay Grading Research. Gift Fund from Zhongjiaoyunzhi. Jan 2022 - Dec 2024: Social-Transformers: A Deep Pre-training Framework for Social Media Language Understanding. RGC Early Career Scheme (ECS). July 2021 - June 2022: Development of a 3-hour Online Programme on Artificial Intelligence and Data Analytics. PolyU Internal Fund under Freshman Seminar for the Online Teaching Development and Educational Research Grant (Co-PI: Dr. Richard Lui). Feel free to explore the AIDA Interactive Playground (only for internal use of PolyU students)! Jan 2022 - Dec 2022: Pre-training Methods for Short Texts. CCF-Baidu Open Fund. Jan 2021 - Dec 2021: Comment-Aware Weakly-Supervised Classification for Social Media Texts. CCF-Tencent Rhino-Bird Young Faculty Open Research Fund. Jan 2021 - Dec 2023: Characterize, Detect, and Neutralize: Context-Aware Computational Methods for Media Bias on Social Platforms. NSFC (Young Scientists Fund). Oct 2019 - Sep 2022: Discourse Parsing for Online Conversations. PolyU Internal Fund. Selected Publications [Google Scholar] Zhe Hu, Tuo Liang, Jing Li, Yiren Lu, Yunlai Zhou, Yiran Qiao, Jing Ma, Yu Yin Cracking the Code of Juxtaposition: Can AI Models Understand the Humorous Contradictions NeurIPS 2024 (oral). [Project] Zhe Hu, Yixiao Ren, Jing Li, Yin Yu VIVA: A Benchmark for Vision-Grounded Decision-Making with Human Values EMNLP 2024. [Project] Hanzhuo Tan, Qi Luo, Jing Li, Yuqun Zhang LLM4Decompile: Decompiling Binary Code with Large Language Models EMNLP 2024. [Github] (3.2k stars) Libo Zhao, Jing Li, Ziqian Zeng PsFuture: A Pseudo-Future-based Zero-Shot Adaptive Policy for Simultaneous Machine Translation EMNLP 2024. [Github] Erxin Yu, Jing Li, Ming Liao, Siqi Wang, Gao Zuchen, Fei Mi, Lanqing Hong CoSafe: Evaluating Large Language Model Safety in Multi-Turn Dialogue Coreference EMNLP 2024 (short paper). [Github] Xianming Li and Jing Li Generative Deduplication For Socia Media Data Selection EMNLP 2024 (Findings). [Github] Siqi Wang, Chao Liang, Yunfan Gao, Yang Liu, Jing Li, Haofen Wang Decoding Urban Industrial Complexity: Enhancing Knowledge-Driven Insights via IndustryScopeGPT ACM MM 2024. [Github] Erxin Yu, Jing Li, Chunpu Xu RePALM: Popular Quote Tweet Generation via Auto-Response Augmentation ACL 2024 (Findings). Sirry Chen, Shuo Feng, Liang Songsong, Chen-Chen Zong, Jing Li, Piji Li CACL: Community-Aware Heterogeneous Graph Contrastive Learning for Social Media Bot Detection ACL 2024 (Findings). [Github] Jiashuo Wang, Chunpu Xu, Chak Tou Leong, Wenjie Li, Jing Li Muffin: Mitigating Unhelpfulness in Emotional Support Conversations with Multifaceted AI Feedback ACL 2024 (Findings). [Github] Xianming Li and Jing Li AoE: Angle-optimized Embeddings for Semantic Textual Similarity (a.k.a., AnglE) ACL 2024. [Github] [Hugging Face] (over 5 million downloads in under a year) Luyang Lin, Lingzhi Wang, Xiaoyan Zhao, Jing Li, Kam-Fai Wong IndiVec: An Exploration of Leveraging Large Language Models for Media Bias Detection with Fine-Grained Bias Indicators EACL 2024 (Findings). [Github] Xianming Li and Jing Li BeLLM: Backward Dependency Enhanced Large Language Model for Sentence Embeddings NAACL 2024. [Github] Erxin Yu, Jing Li, Chunpu Xu PopALM: Popularity-Aligned Language Models for Social Media Trendy Response Prediction LREC-COLING 2024. [Github] Hanzhuo Tan, Chunpu Xu, Jing Li, Yuqun Zhang, Zeyang Fang, Zeyu Chen, Baohua Lai HICL: Hashtag-Driven In-Context Learning for Social Media Natural Language Understanding TNNLS 2024. [Github] Yuji Zhang, Jing Li, Wenjie Li VIBE: Topic-Driven Temporal Adaptation for Twitter Classification EMNLP 2023. [Github] Renzhi Wang, Jing Li, Piji Li InfoDiffusion: Information Entropy Aware Diffusion Process for Non-Autoregressive Text Generation EMNLP 2023 (Findings). [Github] Chunpu Xu, Jing Li, Piji Li, Min Yang Topic-Guided Self-Introduction Generation for Social Media Users ACL 2023 (Findings). [Github] Yibing Liu, Haoliang Li, Yangyang Guo, Chengqi Kong, Jing Li, Shiqi Wang Rethinking Attention-Model Explainability through Faithfulness Violation Test ICML 2022. [Github] Zhengran Zeng, Hanzhuo Tan, Haotian Zhang, Jing Li, Yuqun Zhang, Lingming Zhang An Extensive Study on Pre-trained Models for Program Understanding and Generation ISSTA 2022. [Github] Chunpu Xu and Jing Li Borrowing Human Senses: Comment-Aware Self-Training for Social Media Multimodal Classification EMNLP 2022. [Github] Chunpu Xu, Hanzhuo Tan, Jing Li, and Piji Li Understanding Social Media Cross-Modality Discourse in Linguistic Space EMNLP 2022 (Findings). [Github] Kaifa Zhao, Le Yu, Shiyao Zhou, Jing Li, Xiapu Luo, Yat Fei Aemon Chiu, Yutong Liu A Fine-grained Chinese Software Privacy Policy Dataset for Sequence Labeling and Regulation Compliant Identification EMNLP 2022. [Github] Xiaoxin Lu, Yubo Zhang, Jing Li, Shi Zong Doctor Recommendation in Online Health Forums via Expertise Learning ACL 2022. [Github] Lingzhi Wang, Jing Li, Xingshan Zeng, Kam-Fai Wong Successful New-entry Prediction for Multi-Party Online Conversations via Latent Topics and Discourse Modeling WWW 2022. [Github] Yuji Zhang, Yubo Zhang, Chunpu Xu, Jing Li, Ziyan Jiang, and Baolin Peng #HowYouTagTweets: Learning User Hashtagging Preferences via Personalized Topic Attention EMNLP 2021. [Github] Xingshan Zeng, Jing Li, Lingzhi Wang, and Kam-Fai Wong Modeling Global and Local Interactions for Online Conversation Recommendation ACM TOIS 2021. Rong Xiang, Jing Li, Mingyu Wan, Jinghang Gu, Qin Lu, Wenjie Li, Chu-Ren Huang Affective Awareness in Neural Sentiment Analysis KBS Journal Volume 226 (2021). Zexin Lu, Keyang Ding, Yuji Zhang, Jing Li, Baolin Peng, and Lemao Liu Engage the Public: Poll Question Generation for Social Media Posts ACL-IJCNLP 2021. [Github] Lu Ji, Zhongyu Wei, Jing Li, Qi Zhang, and Xuanjing Huang. Discrete Argument Representation Learning for Interactive Argument Pair Identification NAACL 2021. Lei Chen, Zhongyu Wei, Jing Li, Baohua Zhou, Qi Zhang, and Xuanjing Huang. Modeling Evolution of Message Interaction for Rumor Resolution [Code] COLING 2020. Keyang Ding, Jing Li, and Yuji Zhang. Hashtags, Emotions, and Comments: A Large-Scale Dataset to Understand Find-Grained Social Emotions to Online Topi",
  "content_length": 20225,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:57"
}