{
  "name": "Jing Liu 0006",
  "homepage": "https://faculty.xidian.edu.cn/LJ22/zh_CN/index.htm",
  "status": "success",
  "content": "西安电子科技大学主页平台管理系统 刘静 首页 中文主页 登录 西安电子科技大学 English bP24QzRvEO7U7fj98ejFOJ1X5xRVDSwgtWIdvNjGzjPMEkhTBZuV2TUrcCUn 首页 发表的论著 科学研究 教学研究 教学资源 授课信息 教学成果 获奖信息 招生信息 学生信息 教师博客 我的相册 刘静 个人信息Personal Information 教授 博士生导师 硕士生导师 性别：女 毕业院校：西安电子科技大学 学历：博士研究生毕业 学位：博士研究生毕业 在职信息：在岗 所在单位：广州研究院 双肩挑单位： 人工智能学院 学科：计算机科学与技术. 智能科学与技术 办公地点：广州市黄埔区中新知识城知明路83号西安电子科技大学广州研究院厚德楼1803 联系方式：ba55421dc33f96da1d916ec3a2c54e68efac1a3db259fd29eefd9bd8f447eb2fcbf05a39a1604781d68c74c3936eda32dc240f52c83c720736a1b4dccc4487a99f7b7db9e4646ef7cdb53206d8caa5a7833bdd90ab06e63a32cbaa98fe6107f435ee6b562d732aa77c6ed3199928b423ae65ba6f9c7570af0d00c8105407f479 电子邮箱：ba55421dc33f96da1d916ec3a2c54e68efac1a3db259fd29eefd9bd8f447eb2fcbf05a39a1604781d68c74c3936eda32dc240f52c83c720736a1b4dccc4487a99f7b7db9e4646ef7cdb53206d8caa5a7833bdd90ab06e63a32cbaa98fe6107f435ee6b562d732aa77c6ed3199928b423ae65ba6f9c7570af0d00c8105407f479 扫描关注 同专业博导 同专业硕导 个人简介Personal Profile 刘静，西安电子科技大学广州研究院副院长、二级教授、博士生导师。长期从事智能优化，复杂网络系统认知、预测与调控，时间序列分析，计算机视觉领域的研究工作，已合作出版专著4部、发表国际期刊论文160余篇、国际会议论文100余篇。2015-2020任人工智能领域顶级期刊《IEEE Trans. Evolutionary Computation》副编，2017-2018任IEEE智能计算学会涌现科技技术委员会主席。已主持多项国家级、省部级科研项目。2013年作为第三完成人获得国家自然科学二等奖，2014年获得吴文俊人工智能科学技术创新二等奖（个人奖），2015年入选国家级青年人才，2018年入选国家级人才，同年被批准为享受国务院特殊津贴专家。 招生说明（2025.2.10日更新）： 1. 本人选择博士生、硕士生的条件是要有积极主动进取的学习态度，能全身心地投入到科研工作中，具有责任心，以追求卓越的科研成果为目标，经得起挫折，对学生的本科毕业院校、专业背景没有要求； 2. 我目前全职在我校广州研究院工作，博士生、硕士生在本部修完主要课程后需在广州进行科研实践培养，对此不能接受的请勿联系； 3. 2025年3月报名批次已无工学博士招生名额、有1~2个工程博士招生名额（可以在职攻读），感兴趣的同学请先评估自己满足以上两个条件再联系我； 4. 2025年9月报名的硕士推免名额充足：2~3个工学硕士推免名额，4~5个工程硕士推免名额。欢迎即将取得推免资格的同学评估自己满足以上两个条件后尽快联系我； 5. 有意保送或报考我研究生的同学请先发简历至我的邮箱neouma@mail.xidian.edu.cn！由于工作繁忙，不能一一回复邮件，我仅给我初选合格的学生回复邮件以确定进一步的事宜（一般会在3天内回复），望谅解！ 6. 对我团队感兴趣的同学也可以联系团队其他教师：刘晓涛、赵宏、黄婷、滕祥意、吴凯。 专著 1.        Jing Liu, Hussein A. Abbass, and Kay Chen Tan, Evolutionary Computation and Complex Networks, Springer, 2018. 2.        David G. Green, Jing Liu, and Hussein A. Abbass, Dual Phase Evolution, Springer, 2013. 3.        Licheng Jiao, Jing Liu, and Weicai Zhong, Coevolutionary Computation and Multiagent Systems, WIT, U. K., 2012. 4.        焦李成，刘静，钟伟才，协同进化计算与多智能体系统，科学出版社，2006. 指导研究生发表的国际期刊论文 （第一作者均为我的博士生或硕士生） 智能优化（按发表年份倒序排列） 5.        Chao Wang, Jing Liu, Kai Wu, and Zhaoyang, Wu, Solving multi-task optimization problems with adaptive knowledge transfer via anomaly detection, IEEE Transactions on Evolutionary Computation, 26(2): 304-318, 2022. 6.        Xingxing Hao, Rong Qu, and Jing Liu, A unified framework of graph-based evolutionary multitasking hyper-heuristic, IEEE Transactions Evolutionary Computation, 25(1): 35-47, 2021. 7.        Baihao Qiao, Jing Liu, and Xingxing Hao, A multi-objective differential evolution algorithm and a constraint handling mechanism based on variables proportion for dynamic economic emission dispatch problems, Applied Soft Computing Journal, 108: 107419, 2021. 8.        Yating Cao, Jing Liu, and Zhouwu Xu, A hybrid particle swarm optimization algorithm for RFID network planning, Soft Computing, 25: 5747-5761, 2021. 9.        Xingxing Hao, Jing Liu, Mathematical model and simulated annealing algorithm for Chinese high school timetabling problems under the new curriculum innovation, Frontiers of Computer Science, 15, 151309, 2021. 10.    Baihao Qiao and Jing Liu, Multi-objective dynamic economic emission dispatch based on electric vehicles and wind power integrated system using differential evolution algorithm, Renewable Energy, 154: 316-336, 2020. 11.    Xingxing Hao, Jing Liu, Xiaoxiao Yuan, Xianglong Tang, Zhangtao Li. A moving block sequence-based evolutionary algorithm for resource-constrained project scheduling problems. International Journal of Bio-Inspired Computation, 14(2): 85-102, 2019. 12.    Tao Zhang, Jing Liu, An efficient and fast kinematics-based algorithm for RFID network planning, Computer Networks, 121: 13-24, 2017. 13.    Penghui Liu, Jing Liu, Multi-leader PSO (MLPSO): a new PSO variant for solving global optimization problems, Applied Soft Computing, 61: 256-263, 2017. 14.    Yawen Zhou, Jing Liu, and Xiaohui Gan, A multi-objective evolutionary algorithm for multi-period dynamic emergency resource scheduling problems, Transportation Research Part E, 99: 77-95, 2017. 15.    Xingxing Hao and Jing Liu, A multiagent evolutionary algorithm with direct and indirect combined representation for constraint satisfaction problems, Soft Computing, 21(3): 781-793, 2017. 16.    Xiaoxiao Yuan, Jing Liu, and Xingxing Hao, A moving block sequence-based evolutionary algorithm for resource investment project scheduling problems, Big Data and Information Analytics, 2(1): 39-58, 2017. 17.    Yutong Zhang, Jing Liu, Mingxing Zhou, and Zhongzhou Jiang, A multi-objective memetic algorithm based on decomposition for big optimization problems, Memetic Computing, 8(1): 45-61, 2016. 复杂网络（按发表年份倒序排列） 18.  Kai Wu, Xingxing Hao, and Jing Liu, Online reconstruction of complex networks from streaming data, IEEE Transactions on Cybernetics, 52(6): 5136-5147, 2022. 19.  Xiangyi Teng, Jing Liu, and Liqiang Li, A synchronous feature learning method for multiplex network embedding, Information Sciences, 574: 176-191, 2021. 20.  Fang Shen, Jing Liu, and Kai Wu, Evolutionary multitasking network reconstruction from time series with online parameter estimation, Knowledge-Based Systems, 222, 107019, 2021. 21.  Shuai Wang, Jing Liu, and Yaochu Jin, A computationally efficient evolutionary algorithm for multi-objective network robustness optimization, IEEE Trans. Evolutionary Computation, 25(3): 419-432, 2021. 22.  Kai Wu, Jing Liu, Xingxing Hao, Penghui Liu, and Fang Shen, An evolutionary multi-objective framework for complex network reconstruction using community structure, IEEE Transactions on Evolutionary Computation, 25(2): 247-261, 2021. 23.  Shuai Wang, Jing Liu, Yaochu Jin, Finding influential nodes in multiplex networks using a memetic algorithm, IEEE Trans. Cybernetics, 51(2): 900-912, 2021. 24.  Xiangyi Teng, Jing Liu, Mingming Li, Overlapping community detection in directed and undirected attributed networks using a multiobjective evolutionary algorithm, IEEE Trans. Cybernetics, 51(1): 138-150, 2021. 25.  Shuai Wang, Jing Liu, and Yaochu Jin, Surrogate-assisted robust optimization of large-scale networks based on graph embedding, IEEE Trans. Evolutionary Computation, 24(4): 735-749, August, 2020. 26.  Mingming Li, Jing Liu, Peng Wu, and Xiangyi Teng, Evolutionary network embedding preserving both local proximity and community structure, IEEE Transactions on Evolutionary Computation, 24(3): 523-535, 2020. 27.  Shuai Wang, Jing Liu, Yaochu Jin, Robust structural balance in signed networks using a multi-objective evolutionary algorithm, IEEE Computational Intelligence Magazine, pp. 24-35, May, 2020. 28.  Luowen Liu and Jing Liu, Reconstructing gene regulatory networks via memetic algorithm and LASSO based on recurrent neural networks, Soft Computing, 24(6): 4205-4221, 2020. 29.  Liqiang Li and Jing Liu, The aggregation of multiplex networks based on the similarity of networks, Physica A, 540, 122976, 2020. 30.  Shuai Wang and Jing Liu, Community robustness and its enhancement in interdependent networks, Applied Soft Computing, 77: 665-677, 2019. 31.  Shuai Wang and Jing Liu, Constructing robust community structure against edge-based attacks, IEEE Systems Journal, 13(1): 582-592, 2019. 32.  Kai Wu, Jing Liu, and Dan Chen, Network reconstruction based on time series via memetic algorithm, Knowledge-Based Systems, 164: 404-425, 2019. 33.  Shuai Wang, Jing Liu, Designing comprehensively robust networks against intentional attacks and cascading failures, Information Sciences, 478, 125-140, 2019. 34.  Yonglei Lu and Jing Liu. The impact of information dissemination strategies to epidemic spreading on complex networks. Physica A: Statistical Mechanics and its Applications, vol. 536, 120920, 2019. 35.  Penghui Liu and Jing Liu, Good influence transmission structure strengthens cooperation in prisoner’s dilemma games, European Physical Journal B, 91: 321: 1-12, 2018. 36.  Zhirou Yang and Jing Liu, A memetic algorithm for determining the nodal attacks with minimum cost on complex networks, Physica A, 503, 1041-1053, 2018. 37.  Xiaodong Wang and Jing Liu, A comparative study of the measures for evaluating community structure in bipartite networks, Information Sciences, 448-449: 249-262, 2018. 38.  Lei Rong and Jing Liu, A heuristic algorithm for enhancing the robustness of scale-free networks based on edge classification, Physica A: Statistical Mechanics and its Applications, 503:503-515, 2018. 39.  Mingming Li and Jing Liu, A link clustering based memetic algorithm for overlapping community detection, Physica A: Statistical Mechanics and its Applications, 503: 410-423, 2018. 40.  Zhangtao Li, Jing Liu, and Kai Wu, A multi-objective evolutionary algorithm based on structural and attribute similarities for community detection in attributed networks, IEEE Trans. Cybernetics, 48(7): 1963-1976, JULY 2018. 41.  Shuai Wang and Jing Liu, A multi-objective evolutionary algorithm for promoting the emergence of cooperation and controllable robustness on directed networks, IEEE Transactions on Network Science and Engineering, 5(2): 92-100, 2018. 42.  Zhirou Yang and Jing Liu, Robustness of scale-free networks with various parameters against cascading failures, Physica A: Statistical Mechanics and its Applications, 492: 628-638, 2018. 43.  Shuai Wang, Jing Liu, and Xiaodong Wang, Mitigation of attacks and errors on community structure in complex networks, Journal of Statistical Mechanics Theory and Experiment, 4, 043405, 2017. 44.  Jing Liu, Mingxing Zhou, Shuai Wang, and Penghui Liu, A comparative study of network robustness measures, Frontiers of Computer Science, 11(1): 1-17, 2017. 45.  Penghui Liu and Jing Liu, Multilevel evolutionary algorithm that optimizes the structure of scale-free networks for the promotion of cooperation in the prisoner’s dilemma game, Scientific Reports, 7, 4320, 2017. 46.  Penghui Liu and Jing Liu",
  "content_length": 20774,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:57"
}