{
  "name": "Jingjing Li 0001",
  "homepage": "https://lijin118.github.io",
  "status": "success",
  "content": "Dr. Jingjing Li's Personal Website WELCOME TO MY HOMEPAGE Hi, I am Dr. Jingjing Li is currently a professor at University of Electronic Science and Technology of China (UESTC). His research interest includes Computer Vision, Machine Learning and Multimedia Analysis. Specifically, he focuses on Domain Adaptation, Zero-shot Learning and Recommender Systems. Office: Room B1-705, Main Building, UESTC Qingshuihe Campus. Email: jjl at uestc dot edu dot cn Homepage in Chinese: faculty.uestc.edu.cn/jjl Highlights Jingjing Li, Zhiqi Yu, Zhekai Du, Lei Zhu, and Heng Tao Shen. \"A Comprehensive Survey on Source-Free Domain Adaptation.\" In IEEE Transactions on Pattern Analysis and Machine Intelligence, pp. 5743-5762, (TPAMI) 2024, CCF A, [pdf] [code] 李鑫尧, 李晶晶, 朱磊, 申恒涛. \"资源受限的大模型高效迁移学习算法研究综述.\"计算机学报, pp. 2491-2521, (计算机学报) 2024, CCF A, [pdf] [code] (Corresponding author) Liyuan Shen, Jingjing Li, Lichao Meng, Lei Zhu and Heng Tao Shen, Transfer Learning-based State of Charge and State of Health Estimation for Li-ion Batteries: A Review, IEEE Transactions on Transportation Electrification (IEEE TTE) 2023 [pdf] [code] (Corresponding author) Zhu, Lei, Chaoqun Zheng, Weili Guan, Jingjing Li, Yang Yang, and Heng Tao Shen. \"Multi-modal hashing for efficient multimedia retrieval: A survey.\" IEEE Transactions on Knowledge and Data Engineering 36, no. 1 (2023): 239-260. (IEEE TKDE) 2023 [pdf] [code] Selected Publications Codes for recently published papers: github.com/orgs/TL-UESTC/repositories 2024 Jingjing Li, Zhiqi Yu, Zhekai Du, Lei Zhu, and Heng Tao Shen. \"A Comprehensive Survey on Source-Free Domain Adaptation.\" In IEEE Transactions on Pattern Analysis and Machine Intelligence, pp. 5743-5762, (TPAMI) 2024, CCF A, [pdf] [code] 李鑫尧, 李晶晶, 朱磊, 申恒涛. \"资源受限的大模型高效迁移学习算法研究综述.\"计算机学报, pp. 2491-2521, (计算机学报) 2024, CCF A, [pdf] [code] (Corresponding author) Xinyao Li, Jingjing Li, Fengling Li, Lei Zhu, and Ke Lu. \"Agile Multi-Source-Free Domain Adaptation.\" In Proceedings of the AAAI Conference on Artificial Intelligence, pp. 13673-13681, (AAAI) 2024, CCF A, [pdf] [code] (Corresponding author) Xinyao Li, Jingjing Li, Zhekai Du, Lei Zhu, Ke Lu, and Heng Tao Shen. \"Cross-domain Recommendation via Dual Adversarial Adaptation.\" In ACM Transactions on Information Systems, pp. 1-26, (TOIS) 2024, CCF A, [pdf] [code] (Corresponding author) Xinyao Li, Yuke Li, Zhekai Du, Fengling Li, Ke Lu, and Jingjing Li. \"Split to Merge: Unifying Separated Modalities for Unsupervised Domain Adaptation.\" In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pp. 23364-23374. (CVPR) 2024, CCF A, [pdf] [code] (Corresponding author) Zhekai Du, Xinyao Li, Fengling Li, Ke Lu, Lei Zhu, and Jingjing Li. \"Domain-agnostic Mutual Prompting for Unsupervised Domain Adaptation.\" In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pp. 23375-23384. (CVPR) 2024, CCF A, [pdf] [code] (Corresponding author) Hongzu Su, Lichao Meng, Lei Zhu, Ke Lu, and Jingjing Li. \"DDPO: Direct Dual Propensity Optimization for Post-Click Conversion Rate Estimation.\" In Proceedings of the 47th International ACM SIGIR Conference on Research and Development in Information Retrieval, pp. 1179–1188. (SIGIR) 2024, CCF A, [pdf] [code] (Corresponding author) Hongzu Su, Jingjing Li, Fengling Li, Ke Lu, and Lei Zhu. \"SOIL: Contrastive Second-Order Interest Learning for Multimodal Recommendation.\" In Proceedings of the 32nd ACM International Conference on Multimedia, pp. 5838–5846. (ACM MM) 2024, CCF A, [pdf] [code] (Corresponding author) Zhang, Xinyue, Cong Huang, Kun Zheng, Hongzu Su, Tianxu Ji, Wei Wang, Hongkai Qi, and Jingjing Li. \"Adversarial-Enhanced Causal Multi-Task Framework for Debiasing Post-Click Conversion Rate Estimation.\" In Proceedings of the ACM on Web Conference 2024, pp. 3287-3296. (WWW) 2024, CCF A, [pdf] [code] (Corresponding author) Jing, Mengmeng, Jingjing Li, Ke Lu, Lei Zhu, and Heng Tao Shen. \"Visually source-free domain adaptation via adversarial style matching.\" IEEE Transactions on Image Processing (TIP) 2024, CCF A, [pdf] [code] (Corresponding author) Kangkai Wu, Jingjing Li, Lichao Meng, Fengling Li, and Ke Lu. \"Online Adaptive Fault Diagnosis With Test-Time Domain Adaptation.\" In IEEE Transactions on Industrial Informatics, (TII) 2024, JCR I, [pdf] [code] (Corresponding author) Zhang, Dan, Zhekai Du, Jingjing Li, Lei Zhu, and Heng Tao Shen. \"Domain-adaptive Energy-based Models for Generalizable Face Anti-Spoofing.\" IEEE Transactions on Multimedia, (TMM) 2024, JCR I, [pdf] [code] (Corresponding author) 李鑫尧, 陈洪波, 沈力源, 冯雪松, 李晶晶. \"锂电池状态跨域估计算法综述.\" 电子科技大学学报, pp. 749-761, (电子科大学报) 2024, [pdf] [code] (Corresponding author) Wang, Tianshi, Fengling Li, Lei Zhu, Jingjing Li, Zheng Zhang, and Heng Tao Shen. \"Invisible Black-Box Backdoor Attack against Deep Cross-Modal Hashing Retrieval.\" ACM Transactions on Information Systems 42, no. 4 (2024): 1-27. (TOIS), 2024, CCF A, [pdf] [code] Cui, Hui, Lihai Zhao, Fengling Li, Lei Zhu, Xiaohui Han, and Jingjing Li. \"Effective Comparative Prototype Hashing for Unsupervised Domain Adaptation.\" In Proceedings of the AAAI Conference on Artificial Intelligence, vol. 38, no. 8, pp. 8329-8337. (AAAI), 2024, CCF A, [pdf] [code] Li, Fengling, Bowen Wang, Lei Zhu,Jingjing Li, Zheng Zhang, and Xiaojun Chang. \"Cross-Domain Transfer Hashing for Efficient Cross-modal Retrieval.\" IEEE Transactions on Circuits and Systems for Video Technology. (TCSVT), 2024, JCR I, [pdf] [code] Shi, Dan, Lei Zhu, Jingjing Li, Guohua Dong, and Huaxiang Zhang. \"Incomplete Cross-Modal Retrieval with Deep Correlation Transfer.\" ACM Transactions on Multimedia Computing, Communications and Applications 20, no. 5 (2024): 1-21. (TOMM), 2024, JCR I, [pdf] [code] Xu, Yang, Lei Zhu, Jingjing Li, Fengling Li, and Heng Tao Shen. \"Temporal Social Graph Network Hashing for Efficient Recommendation.\" IEEE Transactions on Knowledge and Data Engineering (2024). (TKDE), 2024, CCF A, [pdf] [code] 2023 Zhekai Du, Jingjing Li, Diffusion-Based Probabilistic Uncertainty Estimation for Active Domain Adaptation, Neural Information Processing Systems, (NeurIPS) 2023, CCF A, [pdf] [code] (Corresponding author) Hongzu Su, Jingjing Li, Zhekai Du, Lei Zhu, Ke Lu, Heng Tao Shen, Cross-domain Recommendation via Dual Adversarial Adaptation, ACM Transactions on Information Systems (TOIS), 2023, CCF A, [pdf] [code] (Corresponding author) Mengmeng Jing, Xiantong Zhen, Jingjing Li, Cees GM Snoek, Order-preserving Consistency Regularization for Domain Adaptation and Generalization.\" In Proceedings of the IEEE/CVF International Conference on Computer Vision, (ICCV) 2023, CCF A, [pdf] [code] (Corresponding author) Hongzu Su, Jingjing Li, Fengling Li, Lei Zhu, Ke Lu, Yang Yang, Task-Adversarial Adaptation for Multi-modal Recommendationg, Proceedings of the 31st ACM International Conference on Multimedia, ACM Multimedia 2023, CCF A [pdf] [code] (Corresponding author) Zhiqi Yu, Jingjing Li, Zhekai Du, Fengling Li, Lei Zhu, Yang Yang, Noise-Robust Continual Test-Time Domain Adaptation, Proceedings of the 31st ACM International Conference on Multimedia, ACM Multimedia 2023, CCF A [pdf] [code] (Corresponding author) Kangkai Wu, Jingjing Li, Lichao Meng, Fengling Li, Heng Tao Shen, Privacy-Preserving Adaptive Remaining Useful Life Prediction via Source-Free Domain Adaption, IEEE Transactions on Instrumentation and Measurement (TIM) 2023, JCR I, [pdf] [code] (Corresponding author) Xinyue Zhang, Jingjing Li, Hongzu Su, Lei Zhu, Heng Tao Shen, Multi-Level Attention-Based Domain Disentanglement for Bidirectional Cross-Domain Recommendation, ACM Transactions on Information Systems (TOIS), 2023, CCF A, [pdf] [code] (Corresponding author) Hongzu Su, Zhekai Du, Jingjing Li, Lei Zhu, Ke Lu, Cross-domain Adaptative Learning for Online Advertisement Customer Lifetime Value Prediction, AAAI Conference on Artificial Intelligence (AAAI) 2023, CCF A, [pdf] [code] (Corresponding author) Liyuan Shen, Jingjing Li, Lichao Meng, Lei Zhu and Heng Tao Shen, Transfer Learning-based State of Charge and State of Health Estimation for Li-ion Batteries: A Review, IEEE Transactions on Transportation Electrification (IEEE TTE) 2023 [pdf] [code] (Corresponding author) Jinghan Ru, Jun Tian, Chengwei Xiao, Jingjing Li, Heng Tao Shen, Imbalanced open set domain adaptation via moving-threshold estimation and gradual alignment, IEEE Transactions on Multimedia (TMM) 2023, JCR I, [pdf] [code] (Corresponding author) Jieyan Liu, Hongcai He, Mingzhu Liu, Jingjing Li, Ke Lu, Manifold Regularized Joint Transfer for Open Set Domain Adaptation, IEEE Transactions on Multimedia (TMM) 2023, JCR I, [pdf] [code] (Corresponding author) Zhiqi Yu, Jingjing Li, Lei Zhu, Ke Lu, Heng Tao Shen. Classification Certainty Maximization for Unsupervised Domain Adaptation. IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2023, [pdf] [code] (Corresponding author) Hongzu Su, Jingjing Li, Lei Zhu, Ke Lu, Heng Tao Shen. Dual-aligned Feature Confusion Alleviation for Generalized Zero-shot Learning. IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2023, [pdf] [code] (Corresponding author) Zhiqi Yu, Jingjing Li, Lei Zhu, Ke Lu, Heng Tao Shen. Uneven Bi-Classifier Learning for Domain Adaptation. IEEE Transactions on Circuits and Systems for Video Technology (TCSVT), 2023, [pdf] [code] (Corresponding author) Lei Zhu, Xize Wu, Jingjing Li, Zheng Zhang, Weili Guan, Heng Tao Shen, Work Together: Correlation-Identity Reconstruction Hashing for Unsupervised Cross-modal Retrieval, IEEE Transactions on Knowledge and Data Engineering (TKDE), 2023, CCF A, [pdf] [code](Corresponding author) Ke Zhang, Miao Long, Jie Chen, Mingzhu Liu, Jingjing Li, CFPNet: a denoising network for Complex frequency band signal processing, IEEE Transactions on Multimedia (TMM) 2023, JCR I, [pdf] [code] (Corresponding author) Liyuan Shen, Jingjing Li, Lin Zuo, Lei Zhu and Heng Tao Shen, Source-Free Cross-Domain State of ",
  "content_length": 28976,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:02"
}