{
  "name": "Jingling Xue",
  "homepage": "http://www.cse.unsw.edu.au/~jingling",
  "status": "success",
  "content": "Jingling Xue's Home Page Jingling Xue, IEEE Fellow (Computer Society) Scientia Professor School of Computer Science and Engineering UNSW Sydney, NSW 2052, Australia Office: Room 501L, K-17 Phone: +61 (2) 9385 4889 Email: j.xue@unsw.edu.au Open-Source Tools Awards Publications Team Funding Professional Activities Teaching Short Biography Jingling Xue holds the esteemed position of Scientia Professor in the School of Computer Science and Engineering at UNSW Sydney, overseeing the Programming Languages and Compilers group. He obtained his B.Eng and M.Eng degrees in Computer Science and Engineering from Tsinghua University in 1984 and 1987, respectively, followed by his PhD in Computer Science and Engineering from the University of Edinburgh in 1992. Recognized for his significant advancements in compiler optimisation and program analysis, he has been honored as an IEEE Fellow by the IEEE Computer Society. Research Interests Jingling Xue's research spans programming languages, compiler technology, and program analysis. He strives to achieve the practical relevance of his research by focusing on developing innovative solutions and open-source tools for real-world software applications. He is interested in sharing the outcomes of his research projects in the form of open-source tools, by supporting scientific replicability and reproducibility. His current research projects include compiler techniques for improving parallelism and locality, pointer/alias analysis techniques and tools for million-line-scale programs, and static and dynamic program analysis techniques and tools for detecting bugs and security vulnerabilities in real-world software applications (e.g., web browsers and Android apps). He has published a research monograph on loop tiling (one of the most important loop transformations for improving parallelism and locality), 70+ journal articles, and 170+ conference papers, with many in prestigious IEEE/ACM journals and conferences in his field. Awards Jingling Xue's papers have been selected for best/distinguished/test-of-time paper/artifact awards at a number of prestigious conferences in programming languages, compiler technology, and software engineering. These include (1) the Best Paper Award at CGO'13, (2) the Best Paper Award at CGO'16, (3) a Distinguished Paper Award at ECOOP'16, (4) a Distinguished Paper Award at ICSE'18, (5) a Distinguished Paper Award at ISSTA'19, (6) a Distinguished Paper Award at ASE'19, (7) a Distinguished Artifact Award at ISSTA'23, (8) the Best Artifact Award at FSE'23, and (9) a Distinguished Paper Award at ASE'23. In addition, he has also received the Test-of-Time award at CGO'21 (for his CGO'10 paper on pointer/alias analysis, selected as a paper that was published 10 -- 12 years prior and has had a lasting impact on the field). Services Jingling Xue served as the Program/General Chair of a number of major conferences in his field, including the Program Chair of LCTES'13, the Program Chair of CC'18, the Program Chair of CGO'20, the General Chair of LCTES'20. In addition, he has also served on the program committees of a number of major conferences in programming languages, compiler technology, and software engineering, including PLDI (ERC), POPL (ERC), OOPSLA, ECOOP, PPoPP, SC, CGO, CC, ICPP, ICS, IPDPS, PACT, ICSE, ASE, ISSTA, LCTES, CASES, and EMSOFT. He served as an Associate Editor for IEEE TC, and is currently serving on the editorial boards of IEEE TETC and SP&E (among others). Prospective PhD Students Jingling Xue has successfully supervised 30 PhD students to completion in his research areas, many of whom have transitioned into roles as professors in academia or researchers/engineers/practitioners in industry. In recognition of his outstanding supervision, he was awarded the Research Supervisor Award by the Arc Postgraduate Council at UNSW Sydney in 2020. Currently, Jingling Xue is actively seeking self-motivated individuals to join his esteemed research group. If you are interested in pursuing a PhD under his guidance, please reach out by providing your CV, copies of your publications, and academic transcripts. Some exciting areas of research within his group include memory safety in Rust, smart contract analysis and verification, AI compilers, compilation for privacy-preserving computation, and adversarial attacks and defenses in deep learning.",
  "content_length": 4374,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:04"
}