{
  "name": "Jingxian Wang",
  "homepage": "https://wangwireless.com",
  "status": "success",
  "content": "Jingxian Wang I’m an NUS Presidential Young Professor in the Computer Science Department at the National University of Singapore, where I lead the Avant Lab. My research builds next-generation wireless systems and satellite networks. Before joining NUS, I was a researcher at Microsoft Research in Redmond. I received my Ph.D. from Carnegie Mellon University. Hiring: I am seeking well-motivated Ph.D. students, M.S. students, and undergraduate interns to work with me on exciting Wireless Systems research projects. System In-Orbit Multimodal AI Our work has received research highlights three times in Communications of the ACM and ACM SIGMOBILE, the best paper and demo at UbiComp, and the best paper at IPSN, and has been selected for Microsoft's accelerating foundation models program. I am a recipient of the acm sigmobile doctoral dissertation award, the microsoft research fellowship in North America, and the inaugural Emerging Rockstar in IEEE Pervasive Computing. Selected Publications SaTE: Low-Latency Traffic Engineering for Satellite Networks Hao Wu, Yizhan Han, Mohit Rajpal, Qizhen Zhang, and Jingxian Wang SIGCOMM 2025 MmBack: Clock-free Multi-Sensor Backscatter with Synchronous Acquisition and Multiplexing Yijie Li, Weichong Ling, Taiting Lu, Yi-Chao Chen, Vaishnavi Ranganathan, Lili Qiu, and Jingxian Wang arXiv:2507.01360, 2025 Frequency-Selective Actuation of Liquid Crystalline Elastomer Actuators with Radio-Frequency Yiwen Song, Zefang Li, Mason Zadan, Jingxian Wang, Swarun Kumar, Carmel Majidi Nature Communications 2025 An Empirical Study of the Impact of Federated Learning on Machine Learning Model Accuracy Haotian Yang, Zhuoran Wang, Benson Chou, Sophie Xu, Hao Wang, Jingxian Wang, Qizhen Zhang arXiv:2503.20768, 2025 Bridge: Enabling BLE Direction Finding Feature Compatible with All Bluetooth Devices Runting Zhang, Yijie Li, Dian Ding, Yi-Chao Chen, Yida Wang, Dongyao Chen, Jingxian Wang, Jiadi Yu, Ling Ma, Guangtao Xue MobiCom 2025 Enhancing LoRa Reception with Generative Models Kanav Sabharwal, Soundarya Ramesh, Jingxian Wang, Dinil Mon Divakaran, Mun Choon Chan SenSys 2024 Wireless Actuation for Soft Electronics-free Robots Jingxian Wang, Yiwen Song, Mason Zadan, Yuyi Shen, Vanessa Chen, Carmel Majidi, Swarun Kumar MobiCom 2023 Navigating Soft Robots through Wireless Heating Yiwen Song, Mason Zadan, Jingxian Wang, Kushaan Misra, Zefang Li, Carmel Majidi, Swarun Kumar ICRA 2023 Ultra Low-Latency Backscatter for Fast-Moving Location Tracking Jingxian Wang, Vaishnavi Ranganathan, Jonathan Lester, Swarun Kumar UbiComp 2022 Locating Everyday Objects using NFC Textiles Jingxian Wang†, Junbo Zhang†, Ke Li, Chengfeng Pan, Carmel Majidi, Swarun Kumar [Best Paper Award] [Communications of the ACM Research Highlights] IPSN 2021 RFID Tattoo: A Wireless Platform for Speech Recognition Jingxian Wang, Chengfeng Pan, Haojian Jin, Vaibhav Singh, Yash Jain, Jason Hong, Carmel Majidi, Swarun Kumar [Best Long Wearables Paper Award] [IJCAI 2021 SC Best Papers] UbiComp 2020 Pushing the Range Limits of Commercial Passive RFIDs Jingxian Wang, Junbo Zhang, Rajarshi Saha, Haojian Jin, Swarun Kumar NSDI 2019 Software Defined Cooking using a Microwave Oven Haojian Jin, Jingxian Wang, Swarun Kumar, Jason Hong [ACM SIGMOBILE Research Highlights] [Communications of the ACM Research Highlights] MobiCom 2019 On the Feasibility of Wi-Fi Based Material Sensing Diana Zhang, Jingxian Wang, Junsu Jang, Junbo Zhang, Swarun Kumar MobiCom 2019 WiSh: Towards a Wireless Shape-aware World using Passive RFIDs Haojian Jin†, Jingxian Wang†, Zhijian Yang, Swarun Kumar, Jason Hong MobiSys 2018 Team PhD: Jinfan Liu Kin Whye Chew Jiahao Xu Post-Doc: Yijie Li Zehua Sun Post-Doc Alumni: Hao Wu Contact wang@nus.edu.sg 2025 © Jingxian Wang",
  "content_length": 3764,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:05"
}