{
  "name": "Jing Sun 0002",
  "homepage": "https://www.cs.auckland.ac.nz/~jingsun",
  "status": "success",
  "content": "Associate Professor Jing Sun - University of Auckland Teaching Research Interests Qualification Work Experience Professional Activities Publications Dr. Jing Sun Associate Professor School of Computer Science University of Auckland Private Bag 92019 Auckland 1142 New Zealand Email: jing.sunauckland.ac.nz Phone: +64 9 923 2286 Fax: +64 9 373 7453 Office: 903-426 (Newmarket Campus) Google Scholar, DBLP, ORCID, Scopus Teaching SOFTENG 351 / COMPSCI 351 S1 C - Fundamentals of Database Systems COMPSCI 751 S1 C - Advanced Topics in Database Systems SOFTENG 752 S2 C - Formal Specification and Design Research Interests Computer-Aided Verification, AI-Driven Automated Software Engineering Generative AI for Code Generation, LLM Applications in Cybersecurity Automated Design Model Repair, Information Security Strategies Simulation and Analysis, Model Checking, Theorem Proving Qualification Ph.D. (01/2000 - 06/2003), Department of Computer Science, School of Computing, National University of Singapore, Singapore. B.Sc. (09/1994 - 07/1998), Department of Computer Science & Technology, Nanjing University, China. Work Experience Faculty Member (08/2003 - present), School of Computer Science, University of Auckland, New Zealand. Professional Activities General Chair of 19th International Symposium on Automated Technology for Verification and Analysis (ATVA 2021), Gold Coast, Australia, 18-22 October 2021. Program Committee Chairs of 2nd International Sports Analytics Conference and Exhibition (ISACE 2025), Shanghai, China, 26-27 September 2025. 24th International Conference on Engineering of Complex Computer Systems (ICECCS 2019), Guangzhou, China, 10-13 November 2019. 20th International Conference on Formal Engineering Methods (ICFEM 2018), Gold Coast, Australia, 12-16 November 2018. 22nd Asia-Pacific Software Engineering Conference (APSEC 2015), New Delhi, India, 1-4 December 2015. 15th International Conference on Formal Engineering Methods (ICFEM 2013), Queenstown, New Zealand, 29 October - 1 November 2013. The First International Workshop on Model Checking Secure and Reliable systems (MoCSeRS 2010), Singapore, 9 June 2010. 12th IEEE International Conference on Engineering of Complex Computer Systems (ICECCS'07), Auckland, New Zealand, 11-14 July 2007. Local Organising Chair of 18th International Semantic Web Conference (ISWC2019), Auckland, New Zealand. Editorial Board Member of Innovations in Systems and Software Engineering - A NASA Journal (ISSE), Springer. Program Committee Members of (selected list) 26th International Conference on Formal Engineering Methods (ICFEM 2025), Hangzhou, China, 10-13 November 2025. (ICFEM 2024, Japan. ICFEM 2023, Australia. ICFEM 2022, Spain. ICFEM 2020, Singapore. ICFEM 2019, Shenzhen, China. ICFEM 2018, Gold Coast, Australia. ICFEM 2017, Xi'an, China. ICFEM 2016, Tokyo, Japan. ICFEM 2015, Paris, France. ICFEM 2014, Luxembourg. ICFEM 2013, Queenstown, New Zealand. ICFEM 2012, Kyoto, Japan. ICFEM 2011, Durham, United Kingdom. ICFEM 2010, Shanghai, China. ICFEM 2008, Kitakyushu-city, Japan.) 29th IEEE International Conference on Engineering of Complex Computer Systems (ICECCS 2025), Hangzhou, China, 2-7 July 2025. (ICECCS 2024, Cyprus. ICECCS 2023, France. ICECCS 2022, Japan. ICECCS 2020, Singapore. ICECCS 2019, Guangzhou, China. ICECCS 2017, Fukuoka, Japan. ICECCS 2016, Dubai, UAE. ICECCS 2015, Gold Coast, Australia. ICECCS 2014, Tianjin, China. ICECCS 2013, Singapore. ICECCS 2012, Paris, France. ICECCS 2011, Las Vegas, USA. ICECCS 2010, University of Oxford, United Kingdom. ICECCS 2009, Potsdam, Germany. ICECCS'08, Belfast, Northern Ireland. ICECCS'07, Auckland, New Zealand. ICECCS'05, Shanghai, China.) 36th IEEE/ACM International Conference on Automated Software Engineering (ASE 2021), Australia, 15-19 November 2021. (ASE 2020, Melbourne, Australia) 32nd International Conference on Software Engineering and Knowledge Engineering (SEKE 2020), Wyndham Pittsburgh University Centre, Pittsburgh, 9-11 July 2020. (SEKE 2019, Lisbon, Portugal. SEKE 2018, Redwood City, USA. SEKE 2017, Pittsburgh, USA. SEKE 2016, California, USA. SEKE 2015, Pittsburgh, USA. SEKE 2014, Vancouver, Canada. SEKE 2013, Boston, USA. SEKE 2012, San Francisco Bay, USA.) 14th International Symposium on Theoretical Aspects of Software Engineering (TASE 2020), Hangzhou, China, 15-17 July 2020. (TASE 2019, Guilin, China. TASE 2016, Shanghai, China. TASE 2015, Nanjing, China. TASE 2013, Birmingham, United Kingdom. TASE 2010, Taipei, Taiwan. TASE 2009, Tianjin, China.) 17th International Semantic Web Conference (ISWC 2018), California, USA, 8-12 October 2018. (ISWC 2017, Vienna, Austria. ISWC 2016, Kobe, Japan. ISWC 2015, Bethlehem, USA. ISWC 2014, Trentino, Italy. ISWC 2013, Sydney, Australia.) 24th Asia-Pacific Software Engineering Conference (APSEC 2017), Nanjing, China, 4-8 December 2017. (APSEC 2016, Hamilton, New Zealand. APSEC 2015, New Delhi, India. APSEC 2014, Korea. APSEC 2013, Bangkok, Thailand. APSEC 2012, Hong Kong, China. APSEC 2011, Ho Chi Minh city, Vietnam. APSEC 2010, Sydney, Australia. APSEC 2008, Beijing, China.) The 2017 IEEE International Conference on Software Quality, Reliability and Security (QRS 2017), Prague, Czech Republic, 25-29 July 2017. (QRS 2016, Vienna, Austria. QRS 2015, Vancouver, Canada.) 32nd International Conference on Computers and Their Applications (CATA 2017), Honolulu, Hawaii, USA, 20-22 March 2017.(CATA 2016, Nevada, USA.) 5th International Conference on ASM, Alloy, B, TLA, VDM and Z (ABZ 2016), Linz, Austria, 23-27 May 2016.(ABZ 2014, Toulouse, France.) 13th International Conference on Software Engineering and Formal Methods (SEFM 2015), York, United Kingdom, 7-11 September 2015. (SEFM 2014, Grenoble, France.) 12th International Symposium on Automated Technology for Verification and Analysis (ATVA 2014), Sydney, Australia, 3-7 November 2014. 14th International Conference on Quality Software (QSIC 2014), Dallas, USA, 2-3 October 2014. (QSIC 2013, Nanjing, China.) 19th International Symposium on Formal Methods (FM 2014), National University of Singapore, Republic of Singapore, 12-16 May 2014. 9th International Workshop on Semantic Web Enabled Software Engineering (SWESE 2013), Berlin, Germany, 2-5 December 2013. (SWESE 2012, Nara, Japan.) 35th Annual IEEE Software Engineering Workshop (SEW-35), Heraclion, Crete, Greece, 12-13 October 2012. (SEW-34, Limerick, Ireland. SEW-33, Skovde, Sweden.) Publications Editorial Zhe Hou, Vijay Ganesh and Jing Sun (Editors). Innovations in Systems and Software Engineering - A NASA Journal (ISSE), Volume 18, Issue 3, Springer Nature, September 2022. (DOI: 10.1007/s11334-022-00482-2) Jing Sun (Editor). International Journal of Software Engineering and Knowledge Engineering (IJSEKE), Special Issue on Semantic Enabled Software Engineering (SESE), Volume 30, Issue 06, World Scientific Publishing, June 2020. (DOI: 10.1142/S0218194020020027) Jing Sun and Jun Pang (Editors), Proceedings of the 24th International Conference on Engineering of Complex Computer Systems (ICECCS 2019), Guangzhou, China, IEEE Computer Society, November 2019. Jing Sun and Meng Sun (Editors), Formal Methods and Software Engineering, Proceedings of the 18th International Conference on Formal Engineering Methods, LNCS, Vol. 11232, Springer-Verlag, November 2018. (DOI: 10.1007/978-3-030-02450-5) Raghu Reddy, Jing Sun, Anjaneyulu Pasala and Arun Bahulkar (Editors), Proceedings of the 22nd Asia Pacific Software Engineering Conference (APSEC 2015), Page xi, IEEE Publisher, December 2015. (DOI: 10.1109/APSEC.2015.5) Lindsay Groves and Jing Sun (Editors), Formal Methods and Software Engineering, Proceedings of the 15th International Conference on Formal Engineering Methods, LNCS, Vol. 8144, Springer-Verlag, October 2013. (DOI: 10.1007/978-3-642-41202-8) Jin Song Dong and Jing Sun (Editors). Science of Computer Programming, Special Issue on the Grand Challenge, Volume 74, Issue 4, Elsevier, February 2009. (DOI: 10.1016/j.scico.2008.10.001) Book Chapters Hai Wang, Yuan Fang Li, Jing Sun, Hongyu Zhang and Jeff Pan. Towards a Consistent Feature Model using OWL. Chapter IV in Book: Semantic Web Enabled Software Engineering, pages 67-91, Volume 17, Series - Studies on the Semantic Web, IOS Press, July 2014. (DOI: 10.3233/978-1-61499-370-4-67) Hai Wang, Jin Song Dong, Jing Sun, Terry Payne, Nick Gibbins, Yuan Fang Li and Jeff Pan. An Integrated Formal Approach to Semantic Work Environments Design. Chapter XV in Book: Emerging Technologies for Semantic Work Environments: Techniques, Methods, and Applications, pages 262-280, Information Science Reference, Hershey, New York, USA, June 2008. (DOI: 10.4018/978-1-59904-877-2.ch015) Referred Journal Articles Zhiyuan Wei, Jing Sun, Zhe Hou, Zijian Zhang, Zixiao Zhao, Chunmiao Li, Mingchao Wan, Jin Dong. A Dynamic Plan-Execute Framework for Advanced Smart Contract Security Analysis, ACM Transactions on Software Engineering and Methodology (TOSEM), October 2025. (Accepted) Zhiyuan Wei, Jing Sun, Yuqiang Sun, Ye Liu, Daoyuan Wu, Zijian Zhang, Xianhao Zhang, Meng Li, Yang Liu, Chunmiao Li, Mingchao Wan, Jin Dong and Liehuang Zhu. Advanced Smart Contract Vulnerability Detection via LLM-Powered Multi-Agent Systems, IEEE Transactions on Software Engineering (TSE), August, 2025. (DOI: 10.1109/TSE.2025.3597319, Available Online) Cheng-Hao Cai, Jing Sun and Gillian Dobbie. The Automation of Design Model Repair, Science of Computer Programming, Elsevier, 3 April 2025. (DOI: 10.1016/j.scico.2025.103313, Available Online) Yingxue Liu, Jing Sun, Zhuo Chen, Feng Gao, Xiangbo Yuan, Zijian Zhang, Lei Zhang, Meng Li, Qi Gao and Liehuang Zhu. Covert Transmission via Steganography and Smart Contract, IEEE Internet of Things Journal, November 2024. (DOI: 10.1109/JIOT.2024.3486994) Zhiyuan Wei, Jing Sun, Zijian Zhang, Xianhao Zhang, Xiaoxuan Yang and Liehuang Zhu. Survey on Quality Assurance of Smart Contracts, ACM Computing Surveys, Association for Computing Machinery, Septemb",
  "content_length": 43996,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:59"
}