{
  "name": "Jing Ma 0002",
  "homepage": "https://jma712.github.io",
  "status": "success",
  "content": "academicpages is a ready-to-fork GitHub Pages template for academic personal websites - Jing Ma Jing Ma Assistant professor Department of Computer & Data Sciences Case Western Reserve University (CWRU) Follow Google Scholar DBLP Email LinkedIn Twitter Github I am a Timothy E. and Allison L. Schroeder Assistant Professor (tenure track) in the Department of Computer & Data Sciences at Case Western Reserve University (CWRU). Before that, I obtained my Ph.D. in the Department of Computer Science at University of Virginia (UVA) in 2023 summer, working with Prof. Jundong Li and Prof. Aidong Zhang. I obtained my master's degree and bachelor's degree at Shanghai Jiao Tong University (SJTU). Research Interest: I am broadly interested in machine learning and data mining. My current research mainly focuses on: Trustworthy AI: generalization, explanation, fairness, robustness, etc. Causality: causal machine learning, causal inference, causality in LLMs Graph learning: graph foundation models, graph neural networks LLMs: explanation/causality/safety/ethics in LLMs, LLM applications AI for social good: AI in important domains such as science and healthcare I am actively looking for self-motivated PhD/Master/intern students. Please feel free to send me an email with your CV if you are interested! News [2025.11] One paper has been accepted by AAAI 2026 [2025.10] One paper has been accepted by IEEE BigData 2025 [2025.09] One paper has been accepted by NeurIPS 2025 [2025.09] Our tutorial \"Explaining the ‘Unexplainable’ Large Language Models\" has been accepted by ICDM 2025 [2025.07] One paper has been accepted by JBI [2025.05] One paper has been accepted by ACL 2025 [2025.05] One paper has been accepted by KDD 2025 [2025.02] Invited to be a keynote speaker in Artificial Intelligence with Causal Techniques Workshop at AAAI 2025 [2025.01] Two papers have been accepted by NAACL 2025 [2025.01] One paper has been accepted by ICLR 2025 [2024.12] Invited to be a panelist in Causal Representation Learning Workshop at NeurIPS 2024 [2024.12] Our workshop proposal \"Foundational AI for Pervasive Computing\" has been accepted by PAKDD 2025 [2024.12] One paper has been accepted by AAAI 2025, congrats to my student Yiran Qiao [2024.11] One paper has been accepted by WACV 2025 [2024.10] Our survey paper about LLM + health/law/finace has been accepted by TMLR with a Survey Certification [2024.09] One paper has been accepted by NeurIPS 2024 (Oral) [2024.09] Glad to receive a DoE grant as a Co-PI [2024.09] Our survey paper about LLM + causal inference is available now! [2024.09] Invited to serve as a PC member for SDM 2025 [2024.09] One paper has been accepted by AI Magazine [2024.07] One paper has been accepted by ACM MM 2024 [2024.05] Our tutorial \"Causal Inference with Latent Variables\" has been accepted by KDD 2024 [2024.05] Honored to receive the Outstanding Ph.D. Student Award at UVA [2024.05] Our survey paper about LLM + health/law/finace and a related reading list are available now! [2024.04] One paper has been accepted by ICML 2024 [2024.03] One demo paper has been accepted by WWW 2024 [2024.01] Invited to serve as a PC member for BigData 2024 [2024.01] One paper has been accepted by PAKDD 2024 [2024.01] Invited to serve as a reviewer for UAI 2024 [2023.11] Selected for the AAAI 2024 New Faculty Highlights Program [2023.10] One paper has been accepted by TKDD [2023.09] Appoined as the Timothy E. and Allison L. Schroeder Assistant Professor at CWRU [2023.08] Joined CWRU as an Assistant Professor",
  "content_length": 3529,
  "method": "requests",
  "crawl_time": "2025-12-01 13:30:57"
}