{
  "name": "Jingjing Yao",
  "homepage": "https://www.myweb.ttu.edu/jinyao",
  "status": "success",
  "content": "Jingjing Yao Intelligent Internet of Things Lab HomeResearchPublicationTeamTeachingAward Jingjing Yao, Ph.D.Assistant ProfessorDepartment of Computer ScienceTexas Tech UniversityOffice: EC 306F          Email: Jingjing.Yao AT ttu.eduGoogle Scholar, Research GateBiographyI am an Assistant Professor in the Department of Computer Science, Texas Tech University (TTU). I received by Ph.D. in 2021 from the Department of Electrical and Computer Engineering, New Jersey Institute of Technology (NJIT), under the supervision of Prof. Nirwan Ansari. Before that, I received my M.E. from University of Science and Technology of China (USTC) under the supervision of Prof. Zuqing Zhu, and B.E. from Dalian University of Technology (DUT). My research interests include internet of things (IoT), internet of drones, federated learning, reinforcement learning, mobile edge computing/caching, and cybersecurity.I intent to build an internet of drones (IoD) system to realize real-time object tracking application. This can be implemented by 1) designing reliable and high-speed communication protocol between drones and the ground controller, and 2) controlling drone navigation and flight trajectory. I am looking for highly motivated PhD students (1 open PhD position) who are interested in improving the system performance of IoT network communication and drone control. If you are interested, please feel free to send your CV, transcripts, GRE and TOEFL scores (if applicable) to my email. Prospective PhD students, with strong programming skills (e.g., Python, C++, and MATLAB) and theoretical background (e.g., optimization theory, robotics, and machine learning), are preferred. Experience with writing software or modifying hardware for robotic platforms will be viewed as a plus.Research InterestInternet of ThingsInternet of DronesFederated LearningReinforcement LearningMobile Edge Computing/CachingCybersecurityEducationPh.D., Computer Engineering, New Jersey Institute of Technology (NJIT), 2016-2021M.E., Information and Communication Engineering, University of Science and Technology of China (USTC), 2013-2016B.E., Information and Communication Engineering, Dalian University of Technology (DUT), Dalian, China, 2009-2013",
  "content_length": 2225,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:04"
}