{
  "name": "Jinhua Guo 0001",
  "homepage": "https://www-personal.umd.umich.edu/~jinhua",
  "status": "success",
  "content": "Jinhua Guo Jinhua Guo Associate Professor Department of Computer and Information Science University of Michigan-Dearborn Office: 211 CIS Email: jinhua@umich.edu Phone: (313) 583-6439 Announcement: Call for Paper: Special Issue on Vehicular Networks and Applications (Due: 1 December 2018) Short Bio Dr. Jinhua Guo is the founder and director of Vehicular Networking Systems Research Laboratory and an Associate Professor in the Computer and Information Science Department at the University of Michigan - Dearborn. He obtained his Ph.D. from the University of Georgia in the Department of Computer Science. He also held B.E. and M.E. both in Computer Science from Dalian University of Technology, China. Dr. Guo has worked on a range of problems in experimental computer systems, spanning vehicular networking, mobile computing, cloud computing, and security & privacy. His research has been funded by highly competitive external and internal sources, including NSF, Chrysler, Amazon, OVPR, Rackham, and CEEP. He was also a recipient of the IEEE/ASEE Frontiers in Education New Faculty Fellow Award. Research Interests Networking, Vehicular Networking, Data Center Networking Distributed Systems, Distributed Computing, Interactive Steering Optimization, Scientific Computing Recent Grants NSF Grant: co-PI, “EDU: Collaborative: Enhancing Pervasive and Mobile Computing Security Education with Research Integration,” US National Science Foundation, 2014–2016 (PI: D. Ma). Amazon: PI, “Amazon AWS in Education Coursework Grant award,” 2012-2015, in AWS credits. NSF Grant: PI, “Acquisition of Instruments for Mobile Computing Research in the Context of Automotive Applications,” US National Science Foundation, 2005–2010 (co-PIs: H. Abdu, K. Akingbehin, N. Patel, W. Xiang, and Q. Zhu; Senior Person: P. Richardson). Chrysler Research Grant: PI, “Developing a Delay Tolerant Networking Convergence Layer for Vehicular Internet,” Chrysler LLC/Brightstar Corp, 2008 – 2009. IAVS Grant: PI, “Optimizing Traffic Flow Management, Topology Control, and Virtual Machine Placement in Cloud Data Centers,” 2014 (co-PI: D. Ma) OVPR: PI, “Increasing Broadcast Reliability in Vehicular Ad Hoc Networks,” 2006 – 2007. Rackham: PI, “Development of Routing Protocols for Vehicular Ad hoc Networks,” 2004 – 2005. CEEP: PI, “Secure and Privacy-Preserving Inter-Vehicle Communication Framework,” 2006 – 2008. Selected Publications Refereed Journal Articles J. Liu and J. Guo, “Energy Efficient Scheduling of Real-Time Tasks on Multi-core Processors with Voltage Islands,” Future Generation Computer Systems, Elsevier, Vol 56 (2016), pp, 202-210. K. Liu, J. Guo, N. Lu, F. Liu, X. Wang, P. Wang, “RAMC: A RSU-Assisted Multi-Channel Coordination MAC Protocol for VANET,” IEICE Transactions on Communications, Vol. 94-B (1), pp. 203-214, 2011. J. Guo, L. Yang, “CAR: Context-Aware Routing for Vehicular Ad hoc Networks,” IJEI: International Journal of Engineering and Industries, Vol. 1 (1), pp. 10-29, December 2010. Z.J. Shi and J. Guo, “Global Convergence of Conjugate Gradient Method,” Optimization, Taylor and Francis, Volume 58, Issue 2 (2009), pp. 163-179. Z.J. Shi and J. Guo, “A New Family of Conjugate Gradient Methods,” Journal of Computational and Applied Mathematics, Elsevier. Volume 224, Number 1 (February 2009), pp. 444-457. Z.J. Shi and J. Guo, “A New Trust Region Method with Adaptive Radius,” Computational Optimization and Applications, Springer, Volume 41, Number 2 (November 2008), pp. 225-242. D. Butcher, X. Li, and J. Guo, “Security Challenge and Defense in VoIP Infrastructures,” IEEE Transactions on Systems, Man, and Cybernetics--Part C. vol. 37, no. 6, 2007, pp. 1152-1162. T. Jiang, W. Xiang, P. Richardson, J. Guo, and G. Zhu, “PAPR Reduction of OFDM signals Using Partial Transmit Sequences with Low Computation Complexity.” IEEE Transactions on Broadcasting. vol. 53, no. 3, 2007, pp. 719-724. Z.J. Shi and J. Guo, “Convergence of Memory Gradient Methods,” International Journal of Computer Mathematics, Taylor and Francis, Volume 85, Number 7 (2008), pp. 1039 - 1053. Z.J. Shi and J. Guo, “A New Trust Region Method for Unconstrained Optimization,” Journal of Computational and Applied Mathematics, Elsevier, Volume 213, Number 2 (2008), pp. 509-520. Z.J. Shi and J. Guo, “A new algorithm of nonlinear Conjugate gradient method with strong convergence,” Computational and Applied Mathematics. vol. 27, no. 1, 2008, pp. 93-106. Z.J. Shi and J. Guo, “Some Extensions of Trust Region Method,” Pacific Journal of Optimization. Volume 3, Number 3 (September 2007), pp. 539-554. J. Guo, “Consistency Verification in Transaction-based Optimistic Steering of Distributed Computations,” International Journal of Parallel, Emergent, and Distributed Systems, Taylor and Francis, Volume 21, Number 6 (2006), pp. 385-404. J. Guo and J.P. Baugh, “Security and Privacy in Vehicle Safety Communication Applications,” SAE 2006 Transactions Journal of Passenger Cars: Electronic and Electrical Systems, Volume 115, Number 7 (2006), pp. 721-727. J. Guo, W. Xiang, S. Wang, “Reinforce Networking Theory with OPNET Simulation,” Journal of Information Technology Education, Volume 6 (2007), pp. 215-226. J. Guo and T. Taha, “Parallel Implementation of the Split-step Fourier Method and the Pseudospectral Method For Solving Higher KdV Equation,” Mathematics and Computers in Simulation, Elsevier, Volume 62, Number 1 (2003), pp. 41-51. E. Kraemer, J. Wang, J. Guo, S. Hopkins, and J. Arnold, “An Analysis of Gene-Finding Programs for Neurospora Crassa,” Bioinformatics, Volume 7, Number 10 (2001), pp. 901-912. Conference Proceedings Papers J. Baugh and J. Guo, “A Per-Face Popularity Scheme to Increase Cache Robustness in Information-Centric Networks,” the 13th International Conference on Future Networks and Communications (FNC-18), Gran Canaria, Spain, August 2018. R. Bankston and J. Guo, “Performance of Container Network Technologies in Cloud Environments,” Proceedings of the 18th Annual IEEE International Conference on Electro Information Technology (eit2018), Rochester, Michigan, May 2018. V. Singh and J. Guo, “Optimization of Power Usage Effectiveness for Heterogeneous Modular Data Centers using Neural Network,” Proceedings of the Sixth International Conference on Smart Grids, Green Communications and IT Energy-aware Technologies (Energy 2016), Lisbon, Portugal, June 2016. V. Singh and J. Guo, “Improving Service Levels Using Internet of Things Infrastructure in Data Centers,” Proceedings of the 2nd IEEE International Conference on Smart Computing (SMARTCOMP 2016), St. Louis, Missouri, May 2016. J. Liu, J. Guo, and D. Ma, “Traffic Aware Virtual Machine Packing in Cloud Data Centers,” Proceedings of the IEEE International Conference on High Performance and Smart Computing, pp. 256-261, New York City, April 2016. J. Liu and J. Guo, “Voltage Island Aware Energy Efficient Scheduling of Real-Time Tasks on Multi-core Processors,” Proceedings of the 11th IEEE International Conference on Embedded Software and Systems (ICESS 2014), pp. 645-652, 2014. Y. Cao, J. Guo, and Y. Wu, “SDN enabled content distribution in vehicular networks,” Proceedings of the Fourth International Conference on Innovative Computing Technology (INTECH), IEEE, pp. 164-169, 2014 J. Richmond and J. Guo, “Pricing the Internet for Congestion Control and Social Welfare,” Proceedings of the 8th International Workshop on Wireless Mesh and Ad-hoc Networking in conjunction with 23rd International Conference on Computer Communications and Networks (ICCCN 2014) , pp. 1-6, 2014. K. Liu, J.Guo, N. Lu, and F. Liu, “RAMC: A RSU-Assisted Multi-channel Coordination MAC Protocol for VANET,” IEEE Workshop on Networking Intelligent Vehicles and Infrastructures (NiVi), Honolulu, Hawaii, December 2009. L. Yang, J. Xu, Y. Wu, and J. Guo, “Road Probing: RSU Assisted Data Collection in Vehicular Networks,” The 5th International Conference on Wireless Communications, Networking and Mobile Computing, Beijing, China, September 2009. Y. Wu, L. Yang, G. Wu, and J. Guo, “An Improved Coded Repetition Scheme for Safety Messaging in VANETs,” The 5th International Conference on Wireless Communications, Networking and Mobile Computing, Beijing, China, September 2009. L. Yang, J. Guo, and Y. Wu, “Piggyback Cooperative Repetition for Reliable Broadcasting of Safety Messages in VANETs,” The IEEE Intelligent Vehicular Communication Systems (IVCS), Las Vegas, Nevada, January 2009. L. Yang and J. Guo, “Increasing Broadcast Reliability by Coded Cooperative Repetition in VANETs,” The First International Conference on Wireless Access in Vehicular Environments (WAVE 2008), Dearborn, Michigan, December 2008. C. Atkins and J. Guo, “Creating a Viable Vehicular Network: A VTP Convergence Layer for DTN,” The First International Conference on Wireless Access in Vehicular Environments (WAVE 2008), Dearborn, Michigan, December 2008. L. Yang, J. Guo, and Y. Wu “Channel Adaptive One Hop Broadcasting for VANETs,” The 11th IEEE Conference on Intelligent Transportation Systems (ITSC2008), Beijing, China, October 2008. S-Y Chang, L. Yang, and J. Guo, “Sybil Attacks on Vehicular Ad-Hoc Networks,” 2008 SAE World Congress Session on In-Vehicle Networks, Detroit, Michigan, April 2008, Paper number: 2008-01-0770. J. Guo, J.P. Baugh, and S. Wang, “A Group Signature Based Secure and Privacy-Preserving Vehicular Communication Framework,” CD-ROM Proceedings of the Mobile Networking for Vehicular Environments (MOVE) workshop in conjunction with IEEE INFOCOM, Anchorage, Alaska, May 2007, pp 103-108. J. Guo and G. Xing, “Using Mobile Agent-based Middleware to Support Distributed Coordination for Vehicle Telematics,” Proceedings of the 2007 IEEE International Symposium on Ubiquitous Computing and Intelligence (UCI-07), Niagara Falls, Canada, May 2007, pp. 374-379 G. Xing, Z. Xia, and J. Guo, “Clustering XML Documents Based on Structural Similarity,” Proceedings of the 12th International Conference on Database Systems for Advanc",
  "content_length": 14823,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:09"
}