{
  "name": "Jinhui Xu 0001",
  "homepage": "https://cse.buffalo.edu/~jinhui",
  "status": "success",
  "content": "Welcome to Jinhui Xu's Homepage Jinhui Xu, PhD, Professor Department of Computer Science and Engineering, State University of New York at Buffalo (SUNY Buffalo), 338 Davis Hall, Buffalo, NY 14260, USA Phone: (716) 645-4734 Fax: (716) 645-3464 Email: jinhui AT buffalo DOT edu Home Research Teaching Contacts University at Buffalo (SUNY) Dept. of Comp. Sci. and Eng. Dr. Xu is currently a professor of  Computer Science and Engineering  at the University at Buffalo,  the State University of  New York. He received his BS and MS degrees in Computer Science from the University of Science and Technology of China (USTC), and his PhD degree in Computer Science and Engineering from the University of Notre Dame in 2000. Dr. Xu works in the fields of Algorithms, Computational Geometry, Machine Learning, Differential Privacy and their applications in several applied domains (such as medicine, biology, and networking). His research is about developing the most efficient geometric algorithms, machine learning techniques, and differentially private methods for a wide range of fundamental problems. In recent years, he has focused on solving high dimensional geometric problems, especially those from machine learning. Dr. Xu's research has been supported by National Science Foundation (NSF), National Institute of Health (NIH),  NYSTAR, IBM, and University at Buffalo. He is the recipient of a number of prestigious awards, such as the SUNY Chancellor's Award for Excellence in Scholarship and Creative Activities (2017), UB Exceptional Scholar: Sustained Achievement Award (2015), UB Excellence in Graduate Mentoring Award (2021), and the NSF CAREER Award (2005). Graduate Student Recruiting:  Potential Ph.D. students with strong mathematical background (including math students) are welcome to apply.",
  "content_length": 1803,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:09"
}