{
  "name": "Jinhao Dong",
  "homepage": "https://djjjjhao.github.io",
  "status": "success",
  "content": "Jinhao Dong's Homepage | 董谨豪 - Homepage Jinhao Dong Renmin University of China Lecturer, Young Talents Program (青年英才) and Consultant of Xiaomi’s LLM Core Team Email:dongjinhao at ruc dot edu dot cn Beijing, China Email Github Google Scholar Jinhao Dong, Ph.D., is a lecturer in Key Laboratory of Data Engineering and Knowledge Engineering and School of Information, Renmin University of China, and is selected into the Young Talents Program (青年英才) of Renmin University of China. He joins the research group led by Professor Xiaoyong Du and Professor Wei Lu. He is also the technical advisor of Xiaomi’s LLM Core Team, primarily responsible for code-related LLM development, including pretraining, reinforcement learning, and agent. He took the lead in establishing the RUC–Xiaomi Joint Key Laboratory for Foundation Large Language Models and serves on its Technical Committee. He obtained his Ph.D. from the School of Computer Science, Peking University in 2025, under the supervision of Professor Dan Hao, and his Bachelor’s degree from School of Computer Science and Technology, Xidian University. He was a visiting scholar in National University of Singapore (NUS) for one year, under the supervision Prof. Jun Sun, Prof. Yun Lin, and Prof. Jin Song Dong. If you’re interested in our research group or in pursuing an internship at Xiaomi, feel free to email me. 📖 Educations 2020.09 - 2025.07, Peking University, Ph.D. in Computer Science, supervised by Prof. Dan Hao 2023.11 - 2024.11, National University of Singapore (NUS), Visiting Scholar in Computer Science, supervised by Prof. Jun Sun, Prof. Yun Lin, and Prof. Jin Song Dong 2016.-09 - 2020.07, Xidian University, Bachelor in Software Engineering 📝 Publications [Technical Report] MiMo-Audio: Audio Language Models are Few-Shot Learners [PDF] [GitHub] Contributor [Technical Report] MiMo-VL Technical Report [PDF] [GitHub] Contributor [Technical Report] MiMo: Unlocking the Reasoning Potential of Language Model – From Pretraining to Posttraining [PDF] [GitHub] Core contributor, responsible for code pre-training and reinforcement learning. Process the code pre-training and post-training data, and propose a test-difficulty–driven code reward to mitigate the sparse-reward problem in code reinforcement learning. [ISSTA’25] ConTested: Consistency-Aided Tested Code Generation with LLM [PDF] [GitHub] Jinhao Dong, Jun Sun, Wenjie Zhang, Jin Song Dong, and Dan Hao [ASE’24] Revisiting the Conflict-Resolving Problem from a Semantic Perspective [PDF] [GitHub] Jinhao Dong, Jun Sun, Yun Lin, Yedi Zhang, Murong Ma, Jin Song Dong, and Dan Hao [ASE’23] Merge Conflict Resolution: Classification or Generation? [PDF] [GitHub] Jinhao Dong, Qihao Zhu, Zeyu Sun, Yiling Lou, and Dan Hao [ICSE’23] Revisiting Learning-based Commit Message Generation [PDF] [GitHub] Jinhao Dong, Yiling Lou, Dan Hao, and Lin Tan [ICSE’22] FIRA: Fine-Grained Graph-Based Code Change Representation for Automated Commit Message Generation [PDF] [GitHub] Jinhao Dong, Yiling Lou, Qihao Zhu, Zeyu Sun, Zhilin Li, Wenjie Zhang, and Dan Hao [ICSE’22] Recommending good first issues in github oss projects [PDF] [GitHub] Wenxin Xiao, Hao He, Weiwei Xu, Xin Tan, Jinhao Dong, and Minghui Zhou [SCIS] What can we learn from quality assurance badges in open-source software? [PDF] [GitHub] Feng Li, Yiling Lou, Xin Tan, Zhenpeng Chen, Jinhao Dong, Yang Li, Xuanzhi Wang, Dan Hao, and Lu Zhang [ESEC/FSE’21] Boosting Coverage-Based Fault Localization via Graph-Based Representation Learning [PDF] [GitHub] Yiling Lou, Qihao Zhu, Jinhao Dong, Xia Li, Zeyu Sun, Dan Hao, Lu Zhang, and Lingming Zhang [ASE’20 NIER track] SRRTA: regression testing acceleration via state reuse [PDF] [GitHub] Jinhao Dong, Yiling Lou, and Dan Hao [ISSRE’20] Cost-effective testing of a deep learning model through input reduction [PDF] [GitHub] Jianyi Zhou, Feng Li, Jinhao Dong, Hongyu Zhang and Dan Hao [NeurIPS’19] Margingan: Adversarial training in semi-supervised learning [PDF] [GitHub] Jinhao Dong, Tong Lin 🎖 Honors and Awards 2023.12: Exceptional Award for Academic Innovation, Peking University 2022.12: Merit Student, Peking University 2022.12: Ubiquant Scholarship, Peking University 2021.12: Exceptional Award for Academic Innovation, Peking University 2021.12: Sanda Fighting Match, Bronze Medal, Peking University 2021.09: President Scholarship, Peking University 2020.09: President Scholarship, Peking University 2020.06: Outstanding Graduate, Xidian University 2019.11: President Fellowship, Xidian University 2018.10: International Collegiate Programming Contest (ICPC), Bronze Medal 2018.04: Mathematical Contest in Modeling (MCM), Meritorious Winner 💬 Invited Talks 2023.12: Excellent Doctor Symposium of CCF ChinaSoft, Shanghai, China 💻 Services Program Committee Member 2026: ICSE Research Track 2025: ASE Research Track 2024: ASE Research Track 2024: NeurIPS Main Conference 2023: PRDC Fast Abstract Committee Reviewer 2024: Formal Aspects of Computing (FAC) 2024: Science China Information Sciences (SCIS) 🥊Hobbies Sanda (Chinese Kickboxing) and Mantis Boxing Hiking and Camping",
  "content_length": 5103,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:07"
}