{
  "name": "Jinkyu Lee 0001",
  "homepage": "https://rtclskku.github.io/website/index.html",
  "status": "success",
  "content": "RTCL@SKKU Real-Time Computing Laboratory Sungkyunkwan University (SKKU) RTCL@SKKU Prof. Jinkyu Lee Members Research Publications Courses Recruit Welcome to RTCL @ SKKU Real-Time Computing Laboratory, College of Computing and Informatics, Sungkyunkwan University (SKKU), #26314A (Stud.) and #27322B (Prof.), Engineering 2 Building, 2066 Seobu-ro, Jangan-gu, Suwon-si, Gyeonggi-do, Republic of Korea We are conducting a broad scope of research in the area of computer science/engineering: (1) Real-Time Scheduling and Systems, (2) Software Defined Batteries, and (3) Mobile Computing and Systems. Recently, we are investigating ML for RT (Machine Learning for Real-Time) and RT for ML (Real-Time for Machine Learning). - Watch a presentation by Prof. Jinkyu Lee in 2022 (in Korean). - Watch a presentation by Prof. Jinkyu Lee in 2021 (in Korean). Please click on \"Research\" in the left menu to find more details. Latest News 2012-2024 Prof. Jinkyu Lee published his papers at IEEE RTSS (Real-Time Systems Symposium) for 13 consecutive years. May 2025 Jaeheon Kwak presented \"Scheduling EV Battery Swap/Charge Operations\" in the 31st IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2025). May 2025 Prof. Jinkyu Lee served as a publicity co-chair of the 31st IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2025). Dec. 2024 Prof. Jinkyu Lee published two papers (out of 33 papers) in the 45th IEEE Real-Time Systems Symposium (RTSS 2024). - RT-BEV: Enhancing Real-Time BEV Perception for Autonomous Vehicles (Presenter: Prof. Jinkyu Lee) - Mixed-Criticality Federated Scheduling for Relaxed-Deadline DAG Tasks Dec. 2024 Prof. Jinkyu Lee served as a publications chair of the 45th IEEE Real-Time Systems Symposium (RTSS 2024). Dec. 2024 Prof. Jinkyu Lee served as a technical program committee of the 45th IEEE Real-Time Systems Symposium (RTSS 2024). Sep. 2024 A paper, entitled \"Batch-MOT: Batch-Enabled Real-Time Scheduling for Multi-Object Tracking Tasks\" was presented in the 24th ACM SIGBED International Conference on Embedded Software (EMSOFT 2024). July 2024 RTCL@SKKU is supported by \"International Cooperation Network Strategy Enhancement Project\" from National Research Foundation of Korea, 2024.7-2027.6 with 300 million wons per year. Jinkyu Lee is the PI (Principal Investigator) of this project, entitled \"Timing Guarantees for Inference of AI Models in Embedded Systems\" 한국 연구재단 국제협력 네트워크 전략 강화 사업, 2024.7-2027.6, 연간 3억원, 과제명: 임베디드 시스템에서 인공지능 모델 추론 실시간성 보장 기술 개발, 연구책임자: 이진규 June 2024 Sukmin Kang presented \"RT-MDM: Real-Time Scheduling Framework for Multi-DNN on MCU Using External Memory\" in the 61st ACM/IEEE Design Automation Conference (DAC 2024). May 2024 A paper, entitled \"RT-Swap: Addressing GPU Memory Bottlenecks for Real-Time Multi-DNN Inference\" was presented in the 30th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2024). May 2024 Prof. Jinkyu Lee served as a technical program committee of the 30th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2024). Feb. 2024 Prof. Jinkyu Lee has been awarded the 2023 SKKU Fellowship. NEWS LINK Dec. 2023 Seunghoon Lee presented \"RT-Blockchain: Achieving Time-Predictable Transactions\" in the 44th IEEE Real-Time Systems Symposium (RTSS 2023). Dec. 2023 Prof. Jinkyu Lee served as a publications chair and a session chair of the 44th IEEE Real-Time Systems Symposium (RTSS 2023). Aug. 2023 Prof. Jinkyu Lee and Seunghoon Lee received the SKKU-Samsung Electronics Industry-Acamedic Cooperation 2023 Best Patent Award. June 2023 Jaeheon Kwak presented \"MixMax: Leveraging Heterogeneous Batteries to Alleviate Low Battery Experience for Mobile Users\" in the 21st ACM International Conference on Mobile Systems, Applications, and Services (MobiSys 2023). May 2023 Prof. Jinkyu Lee served as a technical program committee of the 29th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2023). Dec. 2022 RTCL@SKKU published THREE papers (out of 37 papers) in the 43rd IEEE Real-Time Systems Symposium (RTSS 2022). - Response Time Analysis for Real-Time Global Gang Scheduling (First author & presenter: Seongtae Lee, Second author: Seunghoon Lee, Corresponding author: Prof. Jinkyu Lee) - Design and Timing Guarantee for Non-Preemptive Gang Scheduling (First author & presenter: Seongtae Lee, Corresponding author: Prof. Jinkyu Lee) - RT-MOT: Confidence-Aware Real-Time Scheduling Framework for Multi-Object Tracking Tasks (Second author: Seunghoon Lee, Co-corresponding author: Prof. Jinkyu Lee) Dec. 2022 Prof. Jinkyu Lee served as a publications chair of the 43rd IEEE Real-Time Systems Symposium (RTSS 2022). Dec. 2022 Prof. Jinkyu Lee served as a technical program committee of the 43rd IEEE Real-Time Systems Symposium (RTSS 2022). June 2022 RTCL@SKKU is supported by the Basic Research Lab. funding from National Research Foundation of Korea, 2022.6-2025.2 with 500 million wons per year. Jinkyu Lee is the PI (Principal Investigator) of this project, entitled Real-Time Computing for Battery-of-Things Research Lab. 한국 연구재단 기초연구실 지원사업, 2022.6-2025.2, 연간 5억원, 과제명: 사물 배터리 중심 실시간 컴퓨팅 연구실, 연구책임자: 이진규 May 2022 A paper, entitled \"DNN-SAM: Split-and-Merge DNN Execution for Real-Time Object Detection\" was presented in the 28th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2022). May 2022 Prof. Jinkyu Lee served as a technical program committee member of the 28th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS 2022). Apr. 2022 Prof. Jinkyu Lee served as a technical program committee member of the 37th ACM/SIGAPP Symposium on Applied Computing (SAC 2022).",
  "content_length": 5693,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:10"
}