{
  "name": "Jinku Li",
  "homepage": "https://web.xidian.edu.cn/jkli",
  "status": "success",
  "content": "李金库 | | 西安电子科技大学个人主页 学术信息网 西电导航 关于 使用说明 搜索 系统首页 登录 控制面板 收藏 李金库的留言板 李金库的主页:English 李金库 教授/博导/硕导 博士学科：网络空间安全/电子信息硕士学科：网络空间安全/电子信息工作单位：网络与信息安全学院/广州研究院大数据安全教育部工程研究中心陕西省网络与系统安全重点实验室联系方式通信地址：陕西省西安市西沣路兴隆段266号（710126）电子邮箱：jkli AT xidian.edu.cn办公地点：南校区网安大楼A-1048 个人简介李金库，男，西安电子科技大学网络与信息安全学院/广州研究院教授，博士生导师，硕士生导师，大数据安全教育部工程研究中心副主任，产业大数据应用联合实验室主任。分别于1998年7月、2001年4月和2005年6月获得西安交通大学计算机科学与技术专业学士、硕士和博士学位，2009年3月至2011年3月在美国北卡罗来纳州立大学的计算机科学系进行访问研究（任Research Associate）。主持多项国家、省、部级及公司合作科研项目；以主要作者身份在包括USENIX Security、ACM CCS、NDSS、IEEE/ACM ICSE、IEEE/ACM ASE、ACM EuroSys、IEEE TIFS、IEEE TDSC等国际顶级学术会议和期刊上发表学术论文60多篇；出版学术著作2部；获得省部级科技一等奖2项，二等奖3项；申请技术发明专利100余项，已授权专利50多项；获得计算机软件著作权17项；完成科技成果转化5项。主要研究方向系统与软件安全，云计算及其安全，人工智能及其安全，大数据应用及其安全。代表性论文[30] Ziyi Lin, Haoyu Ma, Kexin Liu, Bowen Li, Jinku Li, and Jianfeng Ma. One Size Does Fit All: Kernel-Assisted Fine-Grained Debloating and Layout Randomization for Shared Libraries. To appear in Proceedings of the 48th IEEE/ACM International Conference on Software Engineering (ICSE 2026), Rio de Janeiro, Brazil, Apr. 2026. [29] Xunqi Liu^, Nanzi Yang^, Chang Li, Jinku Li, Jianfeng Ma, and Kangjie Lu. The Dark Side of Flexibility: Detecting Risky Permission Chaining Attacks in Serverless Applications. To appear in Proceedings of the 33rd Network and Distributed System Security Symposium (NDSS 2026), San Diego, CA, USA, Feb. 2026. (^Co-first authors) [28] Rui Jiao, Yue Zhang, Jinku Li, and Jianfeng Ma. Hit The Bullseye On The First Shot: Improving LLMs Using Multi-Sample Self-Reward Feedback for Vulnerability Repair. To appear in Proceedings of the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025), Seoul, South Korea, Nov. 2025. [27] Nanzi Yang, Xingyu Liu, Wenbo Shen, Jinku Li, and Kangjie Lu. Dangers Behind Access Control: Understanding and Exploiting Implicit Permissions in Kubernetes. To appear in Proceedings of the 32nd ACM Conference on Computer and Communications Security (ACM CCS 2025), Taipei, China, Oct. 2025. [26] Rui Jiao, Yue Zhang, Jinku Li, and Boyang Ma. SCCA: A Multi-Agent Code Security Analysis Framework for AI-Assisted Code Generation. To appear in Proceedings of the IEEE MASS Workshop on Data Security and LLM Safety in Smart Systems 2025 (DLS 2025), Chicago, USA, Oct. 2025. [25] Boyang Ma, Linxuan Zhou, Chong Liao, Yajin Zhou, Jinku Li, and Jianfeng Ma. RansomSentry: Runtime Detection of Android Ransomware with Compiler-based Instrumentation. IEEE Transactions on Dependable and Secure Computing (IEEE TDSC), 2025, 22(4):3354-3370. [24] Wenbo Shen, Yifei Wu, Yutian Yang, Qirui Liu, Nanzi Yang, Jinku Li, Kangjie Lu, and Jianfeng Ma. Towards Understanding and Defeating Abstract Resource Attacks for Container Platforms. IEEE Transactions on Dependable and Secure Computing (IEEE TDSC), 2025, 22(1):474-490. [23] Hao Xiang, Zehui Cheng, Jinku Li, Jianfeng Ma, and Kangjie Lu. Boosting Practical Control-Flow Integrity with Complete Field Sensitivity and Origin Awareness. In Proceedings of the 31st ACM Conference on Computer and Communications Security (ACM CCS 2024), Salt Lake City, USA, Oct. 2024. [22] Zhuo Chen, Lei Wu, Yubo Hu, Jing Cheng, Yufeng Hu, Yajin Zhou, Zhushou Tang, Yexuan Chen, Jinku Li, and Kui Ren. Lifting The Grey Curtain: Analyzing the Ecosystem of Android Scam Apps. IEEE Transactions on Dependable and Secure Computing (IEEE TDSC), 2024, 21(4):3406-3421. [21] Ziyi Lin, Jinku Li, Bowen Li, Haoyu Ma, Debin Gao, and Jianfeng Ma. TypeSqueezer: When Static Recovery of Function Signatures for Binary Executables Meets Dynamic Analysis. In Proceedings of the 30th ACM Conference on Computer and Communications Security (ACM CCS 2023), Copenhagen, Denmark, Nov. 2023. ​[20] Nanzi Yang, Wenbo Shen, Jinku Li, Xunqi Liu, Xin Guo, and Jianfeng Ma. Take Over the Whole Cluster: Attacking Kubernetes via Excessive Permissions of Third-party Applications. In Proceedings of the 30th ACM Conference on Computer and Communications Security (ACM CCS 2023), Copenhagen, Denmark, Nov. 2023. [19] Boyang Ma, Yilin Yang, Jinku Li, Fengwei Zhang, Wenbo Shen, Yajin Zhou, and Jianfeng Ma. Travelling the Hypervisor and SSD: A Tag-Based Approach Against Crypto Ransomware with Fine-Grained Data Recovery. In Proceedings of the 30th ACM Conference on Computer and Communications Security (ACM CCS 2023), Copenhagen, Denmark, Nov. 2023. [18] Zhuo Chen, Jie Liu, Yubo Hu, Lei Wu, Yajin Zhou, Yiling He, Xianhao Liao, Ke Wang, Jinku Li, and Zhan Qin. Detecting Underground Economy Apps Based on UTG Similarity. In Proceedings of the 2023 ACM SIGSOFT International Symposium on Software Testing and Analysis (ISSTA 2023), Seattle, Washington, United States, Jul. 2023. [17] Jietao Xiao^, Nanzi Yang^, Wenbo Shen, Jinku Li, Xin Guo, Zhiqiang Dong, Fei Xie, and Jianfeng Ma. Attacks are Forwarded: Breaking the Isolation of MicroVM-based Containers Through Operation Forwarding. In Proceedings of the 32nd USENIX Security Symposium (USENIX Security 2023), Anaheim, CA, USA, Aug. 2023. (^Co-first authors) [16] Zechao Cai, Jiaxun Zhu, Wenbo Shen, Yutian Yang, Rui Chang, Yu Wang, Jinku Li, and Kui Ren. Demystifying Pointer Authentication on Apple M1. In Proceedings of the 32nd USENIX Security Symposium (USENIX Security 2023), Anaheim, CA, USA, Aug. 2023. [15] Jun Qiu^, Xuewu Yang^, Huamao Wu, Yajin Zhou, Jinku Li, and Jianfeng Ma. LibCapsule: Complete Confinement of Third-party Libraries in Android Applications. IEEE Transactions on Dependable and Secure Computing (IEEE TDSC), 2022, 19(5):2873-2889. (^Co-first authors) [14] Nanzi Yang^, Wenbo Shen^, Jinku Li, Yutian Yang, Kangjie Lu, Jietao Xiao, Tianyu Zhou, Chenggang Qin, Wang Yu, Jianfeng Ma, and Kui Ren. Demons in the Shared Kernel: Abstract Resource Attacks Against OS-level Virtualization. In Proceedings of the 28th ACM Conference on Computer and Communications Security (ACM CCS 2021), Virtual Conference, Nov. 2021. (^Co-first authors) [13] Zhongyuan Jiang, Xiaoke Tang, Yong Zeng, Jinku Li, and Jianfeng Ma. Adversarial link deception against the link prediction in complex networks. Physica A: Statistical Mechanics and its Applications, 2021, 577(2021):126074. [12] Fei Tang, Boyang Ma, Jinku Li, Fengwei Zhang, Jipeng Su, and Jianfeng Ma. RansomSpector: An introspection-based approach to detect crypto ransomware. Computers & Security, 2020, 97(2020):1-14. [11] Xiaonan Zhu, Jinku Li, Yajin Zhou, and Jianfeng Ma. AdCapsule: Practical Confinement of Advertisements in Android Applications. IEEE Transactions on Dependable and Secure Computing (IEEE TDSC), 2020, 17(3):479-492. [10] Zhen Cheng^, Xinrui Hou^, Runhuai Li, Yajin Zhou, Xiapu Luo, Jinku Li, and Kui Ren. Towards a First Step to Understand the Cryptocurrency Stealing Attack on Ethereum. In Proceedings of the 22nd International Symposium on Research in Attacks, Intrusions and Defenses (RAID 2019), Beijing, China, Sep. 2019. (^Co-first authors) [9] Qingsong Yao, Jianfeng Ma, Rui Li, Xinghua Li, Jinku Li, and Jiao Liu, Energy-aware RFID authentication in Edge Computing, IEEE Access, 2019, 7(1):77964-77980. [8] Jinku Li, Yangtian Ye, Yajin Zhou, and Jianfeng Ma. CodeTracker: A Lightweight Approach to Track and Protect Authorization Codes in SMS Messages. IEEE Access, 2018, 6(1):10107-10120. [7] Jinku Li, Xiaomeng Tong, Fengwei Zhang, and Jianfeng Ma. FINE-CFI: Fine-Grained Control-Flow Integrity for Operating System Kernels. IEEE Transactions on Information Forensics and Security (IEEE TIFS), 2018, 13(6):1535-1550. [6] Qingsong Yao, Jianfeng Ma, Cong Sun, Xinghua Li, and Jinku Li. Attack gives me power: DoS-defending constant-time privacy-preserving authentication of low-cost devices such as backscattering RFID tags. In Proceedings of the 3rd ACM Workshop on Mobile Sensing, Computing and Communication (MSCC 2016), Paderborn, Germany, Jul. 2016. [5] Cong Sun, Ning Xi, Jinku Li, Qingsong Yao, and Jianfeng Ma. Verifying secure interface composition for component-based system designs. In Proceedings of the 21st Asia-Pacific Software Engineering Conference (APSEC 2014), Jeju Island, South Korean, Dec. 2014. [4] Jinku Li, Zhi Wang, Tyler Bletsch, Deepa Srinivasan, Michael Grace, and Xuxian Jiang. Comprehensive and Efficient Protection of Kernel Control Data. IEEE Transactions on Information Forensics and Security (IEEE TIFS), 2011, 6(4):1404-1417. [3] Sina Bahram, Xuxian Jiang, Zhi Wang, Mike Grace, Jinku Li, Deepa Srinivasan, Junghwan Rhee, and Dongyan Xu. DKSM: Subverting Virtual Machine Introspection for Fun and Profit. In Proceedings of the 26th IEEE International Symposium on Reliable Distributed Systems (SRDS 2010), New Delhi, India, Oct. 2010. [2] Michael Grace, Zhi Wang, Deepa Srinivasan, Jinku Li, Xuxian Jiang, Zhenkai Liang, and Siarhei Liakh. Transparent Protection of Commodity OS Kernels using Hardware Virtualization. In Proceedings of the 6th International Conference on Security and Privacy in Communication Networks (SecureComm 2010), Singapore, Sep. 2010. [1] Jinku Li, Zhi Wang, Xuxian Jiang, Mike Grace, and Sina Bahram. Defeating Return-Oriented Rootkits with \"Return-less\" Kernels. In Proceedings of the 5th ACM SIGOPS European Conference on Computer Systems (ACM EuroSys 2010), Paris, France, Apr. 2010. 课程教学- X2CE1011 - 计算系统安全- CE204017 - 计算机网络原理 版权声明 未经西安电子科技大学以及个人主页教师本人许可，不得复制、转载和传播本页内容，禁止用于任何商业用途。如需转载请征得主页所有者同意，并附上主页链接！ 更新 李金库的留言板 技术支持：电院网络中心陕ICP备05016463号-3© 2025 西安电子科技大学",
  "content_length": 9364,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:08"
}