{
  "name": "Jinming Duan 0001",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/computer-science/academic-staff/duan-jinming.aspx",
  "status": "success",
  "content": "Dr Jinming Duan - School of Computer Science - University of Birmingham Dr Jinming Duan BSc PhD School of Computer ScienceLecturer of Computer Science Contact details Emailj.duan@bham.ac.uk View my research portal AddressThe School of Computer ScienceUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Dr Jinming Duan is a Lecturer in Artificial Intelligence in Medicine. His work focuses on cutting-edge machine learning methods for cardiovascular imaging. His PhD thesis focused on modern variational and partial differential equation (PDE)-based methods, with applications to image processing and analysis. He is a lead collaborator of the EPSRC SmartHeart Programme at University of Birmingham. His research works have appeared across multiple application publications, including proceedings such as MICCAI, and journals such as Nature Machine Intelligence, IEEE Transactions on Medical Imaging, IEEE Transactions on Image Processing, etc. He regularly reviews more than 30 reputable journals. For more information, please see Dr Jinming's Computer Science profile. Before moving to University of Birmingham, he was a Research Associate jointly within Department of Computing and Institute of Clinical Sciences at Imperial College London. There, he has been working closely with Prof. Daniel Rueckert , and researching cutting-edge artificial intelligence methods for cardiovascular imaging. Prior to that, he studied his PhD in Computer Science at University of Nottingham. His PhD thesis focused on modern variational and partial differential equation (PDE)-based methods, with applications to image processing and analysis. He acquired both his undergraduate and master degrees in Computer Science. His research works have appeared across multiple application publications, including proceedings such as International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI), and journals such as Nature Machine Intelligence, IEEE Transactions on Medical Imaging, IEEE Transactions on Image Processing, IEEE/ACM Transactions on Computational Biology and Bioinformatics, Pattern Recognition, Physics in Medicine and Biology, Journal of Mathematical Imaging and Vision, Journal of Global Optimisation, etc. He regularly reviews more than 30 reputable journals. His research includes deep neural nets, variational methods, partial/ordinary differential equations, numerical optimisation, and finite difference/element methods, with applications to image processing, computer vision and medical imaging analysis. Recent publications Article Ghodrati, V, Duan, J, Ali, F, Bedayat, A, Prosper, A & Bydder, M 2025, 'Accelerating cardiac radial-MRI: Fully polar based technique using compressed sensing and deep learning', Medical Image Analysis, vol. 105, 103732. https://doi.org/10.1016/j.media.2025.103732 Hu, L, Wu, X, Higashita, R, Xing, X, Zhou, M, Lin, S, Li, X, Yue, Y, Xiao, Z, Zhang, Y, Yao, C, Duan, J & Liu, J 2025, 'Long-term stabilized iris tracking with unsupervised constraints on dynamic AS-OCT', Medical Image Analysis, vol. 107, no. A, 103787. https://doi.org/10.1016/j.media.2025.103787 Zhang, Y, Liu, B, Bunting, KV, Brind, D, Thorley, A, Karwath, A, Lu, W, Zhou, D, Wang, X, Mobley, AR, Tica, O, Gkoutos, GV, Kotecha, D & Duan, J 2024, 'Development of automated neural network prediction for echocardiographic left ventricular ejection fraction', Frontiers in Medicine, vol. 11, 1354070. https://doi.org/10.3389/fmed.2024.1354070 Bian, Q, Castellani, M, Shepherd, D, Duan, J & Ding, Z 2024, 'Gait Intention Prediction Using a Lower-limb Musculoskeletal Model and Long Short-term Memory Neural Networks', IEEE Transactions on Neural Systems and Rehabilitation Engineering, vol. 32, 10433200, pp. 822-830. https://doi.org/10.1109/TNSRE.2024.3365201 Meng, Y, Zhang, Y, Xie, J, Duan, J, Joddrell, M, Madhusudhan, S, Peto, T, Zhao, Y & Zheng, Y 2024, 'Multi-granularity learning of explicit geometric constraint and contrast for label-efficient medical image segmentation and differentiable clinical function assessment', Medical Image Analysis. https://doi.org/10.1016/j.media.2024.103183 Bartlett, JJ, Davey, CE, Johnston, LA & Duan, J 2024, 'Recovering high‐quality fiber orientation distributions from a reduced number of diffusion‐weighted images using a model‐driven deep learning architecture', Magnetic Resonance in Medicine. https://doi.org/10.1002/mrm.30187 Duan, J, Jia, X, Bartlett, J, Lu, W & Qiu, Z 2023, 'Arbitrary Order Total Variation for Deformable Image Registration', Pattern Recognition, vol. 137, 109318. https://doi.org/10.1016/j.patcog.2023.109318 BigData@Heart Consortium and the cardAIc group 2023, 'Artificial intelligence to enhance clinical value across the spectrum of cardiovascular healthcare: artificial intelligence framework', European Heart Journal, vol. 44, no. 9, pp. 713–725. https://doi.org/10.1093/eurheartj/ehac758 Hering, A, Hansen, L, Mok, TCW, Chung, ACS, Siebert, H, Hager, S, Lange, A, Kuckertz, S, Heldmann, S, Shao, W, Vesal, S, Rusu, M, Sonn, G, Estienne, T, Vakalopoulou, M, Han, L, Huang, Y, Yap, P-T, Brudfors, M, Balbastre, Y, Joutard, S, Modat, M, Lifshitz, G, Raviv, D, Lv, J, Jaouen, V, Visvikis, D, Fourcade, C, Rubeaux, M, Pan, W, Xu, Z, Jian, B, De Benetti, F, Wodzinski, M, Gunnarsson, N, Sjolund, J, Grzech, D, Qiu, H, Li, Z, Thorley, A, Duan, J, Grossbrohmer, C, Hoopes, A, Reinertsen, I, Xiao, Y, Landman, B, Huo, Y, Murphy, K, Lessmann, N, Van Ginneken, B, Dalca, AV & Heinrich, MP 2023, 'Learn2Reg: comprehensive multi-task medical image registration challenge, dataset and evaluation in the era of deep learning', IEEE Transactions on Medical Imaging, vol. 42, no. 3, pp. 697-712. https://doi.org/10.1109/TMI.2022.3213983 Conference contribution Yin, J, Cheng, X, Duan, J, Pang, Y, O'Regan, D, Reynaud, H & Meng, Q 2025, MCM: Mamba-based Cardiac Motion Tracking using Sequential Images in MRI. in Medical Image Computing and Computer Assisted Intervention – MICCAI 2025 Workshops. Lecture Notes in Computer Science, Springer, 28th International Conference on Medical Image Computing and Computer Assisted Intervention, Daejeon, Korea, Republic of, 23/09/25. Cheng, X, Zhang, T, Lu, W, Meng, Q, Frangi, AF & Duan, J 2025, SACB-Net: Spatial-awareness Convolutions for Medical Image Registration. in The IEEE/CVF Conference on Computer Vision and Pattern Recognition 2025. Cheng, X, Jia, X, Lu, W, Li, Q, Shen, L, Krull, A & Duan, J 2024, WiNet: Wavelet-Based Incremental Learning for Efficient Medical Image Registration. in Medical Image Computing and Computer Assisted Intervention – MICCAI 2024: 27th International Conference, Marrakesh, Morocco, October 6–10, 2024. Lecture Notes in Computer Science, vol. 15002, Springer, 27th International Conference on Medical Image Computing and Computer Assisted Intervention, Marrakesh, Morocco, 6/10/24. https://doi.org/10.1007/978-3-031-72069-7_71 Editorial Zhou, D, Duan, J, Qin, C & Luo, G 2024, 'Editorial: The combination of data-driven machine learning approaches and prior knowledge for robust medical image processing and analysis', Frontiers in Medicine, vol. 11, 1434686. https://doi.org/10.3389/fmed.2024.1434686 Preprint Chen, W, Jia, X, Zhang, Z, Chang, HJ, Shen, L, Duan, J & Leonardis, A 2022 'Category-Level 6D Object Pose Estimation with Flexible Vector-Based Rotation Representation' arXiv. Review article Țica, O, Champsi, A, Duan, J & Țica, O 2025, 'Artificial Intelligence in the Diagnosis and Management of Atrial Fibrillation', Diagnostics, vol. 15, no. 20, 2561. https://doi.org/10.3390/diagnostics15202561 View all publications in research portal Undergraduate prospectus Request a prospectus Our impact: find out about recent advances Explore our Research Spotlights",
  "content_length": 7749,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:11"
}