{
  "name": "Jinqiu Yang 0001",
  "homepage": "https://jinqiuyang.github.io",
  "status": "success",
  "content": "Jinqiu Yang at Concordia University Jinqiu Yang Associate Professor Computer Science and Software Engineering at Concordia University jinqiu.yang at concordia.ca @Google Scholar @DBLP Research interests: software reliability, quality assurance of machine learning systems including autonomous vehicles, software testing, automated program repair, text analytics of software artifacts, and mining software repositories, and in the broad area of software engineering. I am looking for a few students (funding available for Master's and PhD) Recent Publications (full list...) ICSE-25 Time to Retrain? Detecting Concept Drifts in Machine Learning Systems Tri Minh-Triet Pham, Karthikeyan Premkumar, Mohamed Naili, and Jinqiu Yang To Appear in the 47th International Conference on Software Engineering - SEIP Track AAAI-25 Bias Unveiled: Investigating Social Bias in LLM-Generated Code. Lin Ling, Fazle Rabbi, Song Wang, and Jinqiu Yang. To Appear in the Thirty-Ninth AAAI Conference on Artificial Intelligence EMSE-25 Towards effectively testing machine translation systems from white-box perspectives. Hanying Shao, Zishuo Ding, Weiyi Shang, Jinqiu Yang, Nikolaos Tsantalis. Empirical Software Engineering Journal Recent Service Program Committee and Organizing Committee 2021 - present: EMSE Editorial Board 2026: ICSE technical track PC 2025: ICSE technical track PC, MSR technical track PC, ICPC technical track PC, ICPC RENE track PC, ASE technical track PC 2024: FSE technical track PC, FSE tool demo PC, SANER technical track PC, MSR technical track PC 2023: SANER technical track PC, SANER RENE track co-chair 2022: MSR technical track, ICPC technical track, ICSME technical track, ICSE poster track, iMLSE 2021: ICPC Tool Demo PC, ICPC Education Track PC, MSR Hackthon PC, IBF PC, FSE industry track PC, FSE IVR track PC, ASE late breaking PC, ICSME PC SCAM PC Journal Referee: IEEE Transactions on Sofware Engineering , The Journal of Empirical of Software Engineering (EMSE), ACM Transactions on Software Engineering and Methodology (TOSEM), ACM Computing Survey, ASE Journal, Journal of Systems and Software, IEEE Transactions on Dependable and Secure Computing Funding (PI unless noted otherwise) NOVA – FRQNT-NSERC PROGRAM, 2024 - 2027, PI (Co-PIs: Lili Wei and Yuan Tian) Volt-Age Seed Grant, 2024 - 2026, Co-PI Gina Cody Research and Innovation Fellowship, 2024 - 2026, PI NSERC CREATE Program SE4AI, 2021 - 2026, Co-PI Concordia University Facility Optimization Program, 2020 Mitacs Accelerate, 2020 - 2023 NSERC Discovery Grant, 2019 - 2025 NSERC ECR Supplement, 2019 Concordia University Startup Grant, 2018 - 2021 Professional Experience Tenure-Track Assistant Professor at Concordia University (2018 – 2023) IBM Watson Research Lab. (2016.05 – 2016.08) I worked with API Harmony team to extract Web API specifications by mining documentation. IBM CAS. (2014 – 2017) I worked with IBM developers to improve users’ adaption of security warnings of AppScan Source. Education PhD and MASc from University of Waterloo, supervised by Prof. Lin Tan B.Eng. in Software Engineering from Nanjing University",
  "content_length": 3114,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:10"
}