{
  "name": "Jinsong Su",
  "homepage": "https://cdmc.xmu.edu.cn/info/1010/1054.htm",
  "status": "success",
  "content": "ï»¿ èå²æ¾-å¦é¨å¤§å­¦æ°å­åªä½è®¡ç®ä¸­å¿ èå²æ¾ ææãåå£«çå¯¼å¸ å¦é¨å¤§å­¦ä¿¡æ¯å­¦é¢ææãåå£«çå¯¼å¸ï¼çµå½±å­¦é¢ï¼äººå·¥æºè½ç ç©¶é¢åèå¯¼å¸ãå½å®¶ä¸äººè®¡åéå¹´æå°äººæï¼ç¦å»ºçæ»éãæ°éåºéè·å¾è ï¼å¦é¨å¤§å­¦åå¼ºéå¹´æå°Aç±»äººæï¼å ¥é2022-2024å¹´åº¦å ¨çå2%é¡¶å°ç§å­¦å®¶æ¦åã2011å¹´æ¯ä¸äºä¸­å½ç§å­¦é¢è®¡ç®ææ¯ç ç©¶æï¼è·å¾å·¥å­¦åå£«å­¦ä½ãä¸»è¦ç ç©¶æ¹åæ¯èªç¶è¯­è¨å¤çï¼å¤§æ¨¡åï¼æºå¨ç¿»è¯ãå ±åè¡¨CCF-A/Bè®ºæ160ä½ç¯ï¼è·å¾2020å¹´é±ä¼é¿ä¸­æä¿¡æ¯å¤çç§å­¦ææ¯å¥âæ±çéå¹´åæ°å¥ï¼å½å®¶ç¤ºèåè½¯ä»¶å­¦é¢èç20å¨å¹´ä¼ç§ä¸èæå¸å¥ï¼æ¾å¹å »ç¡å£«çè·å¾ç¾åº¦å¥å­¦éï¼è ¾è®¯ççé¸å¥å­¦éãè¯¾é¢ç»ä»¥ç§ç ä¸ºä¸»ï¼åäºèç½å¤§åç´§å¯åä½ï¼å¯¼å¸å ¨ç¨æå¯¼ï¼è¯¾é¢ç»90%ç¡å£«çåæ1å¹´ä»¥ä¸çç¥åäºèç½å ¬å¸ç®æ³å²å®ä¹ ç»åï¼æ¬¢è¿å¯¹ç§ç æå ´è¶£çåå­¦èç³» jssu@xmu.edu.cnè¯­è¨æºè½ææ¯å°ç»ç½ç«ï¼https://xmudeeplit.github.io/è£èªâ¢ 24å¹´ç¦å»ºçï¼é¦å±ï¼æ»å ³éå¹´åºéè·å¾è â¢ 23å¹´å½å®¶ç¤ºèæ§è½¯ä»¶å­¦é¢20å¨å¹´ä¼ç§ä¸èæå¸å¥â¢ 22å¹´å¦é¨å¤§å­¦åå¼ºéå¹´æå°Aç±»äººæâ¢ 22/23/24å¹´æ¯å¦ç¦å¤§å­¦çå ¨çå2%é¡¶å°ç§å­¦å®¶â¢ 21å¹´âå½å®¶ç¹æ¯è®¡åâéå¹´æå°äººæâ¢ 20å¹´ä¸­å½ä¸­æä¿¡æ¯å­¦ä¼é±ä¼é¿ä¸­æä¿¡æ¯å¤çç§å­¦ææ¯å¥âæ±çéå¹´åæ°å¥â¢ 20å¹´ç¦å»ºçæ°åºéå¹´åºéè·å¾è â¢ 19/20/21/23å¹´è ¾è®¯ççé¸ç²¾è±äººæå¹å »è®¡åä¼ç§å¯¼å¸å¥å­¦æ¯å ¼èâ¢ ä¸­å½ä¸­æä¿¡æ¯å­¦ä¼çäºãéå·¥å§å§åãæºå¨ç¿»è¯ä¸å§ä¼å§åãå¤§æ¨¡åä¸å§ä¼å§åâ¢ ä¸­å½è®¡ç®æºå­¦ä¼èªç¶è¯­è¨å¤çä¸ä¸å§åä¼å§åãéå·¥å§å¸¸å¡å§å(17-19)â¢ ä¸­å½äººå·¥æºè½å­¦ä¼çäºãç»ç»å·¥ä½å§åä¼å¯ç§ä¹¦é¿ãå¤è¯­ç§æºè½å¤çä¸å§ä¼å§åâ¢ ç¦å»ºçäººå·¥æºè½å­¦ä¼å¸¸å¡çäºâ¢ èªç¶è¯­è¨å¤çå½é ä¼è®®ACL/EMNLP/NAACL/COLINGé¢åä¸»å¸­20ä½æ¬¡ï¼äººå·¥æºè½å½é ä¼è®®AAAI/IJCAI èµæ·±ç¨åºå§å10ä½æ¬¡â¢ å ¨å½æºå¨ç¿»è¯å¤§ä¼CCMT21ç¨åºå§åä¼ä¸»å¸­ãCCMT24ç»ç»ä¸»å¸­â¢ CAAI Transactions on Intelligenceéå¹´ç¼å§â¢ é¿ææ ä»»ACL/AAAI/EMNLPç­æå¨å½é ä¼è®®ï¼T-PAMI/T-IS/T-ASLPç­40ä½ä¸ªæå¨æåå®¡ç¨¿äººå­¦çå¹å »â¢ 22å¹´é¿éå·´å·´è¾¾æ©é¢å­¦æ¯åä½ä¼ç§å®ä¹ çï¼å ¨å½13åï¼â¢ 20å¹´ççé¸ç²¾è±äººæå¹å »è®¡åçªç ´è¿åå¥â¢ 18/19/20/21/23å¹´è ¾è®¯ççé¸ç²¾è±ç ç©¶çå¹å »è®¡åâ¢ 19å¹´è ¾è®¯ççé¸å¥å­¦éï¼å ¨å½6åï¼â¢ 18å¹´ç¦å»ºçä¼ç§å­¦æ¯ç¡å£«å­¦ä½è®ºæâ¢ 17å¹´ç¾åº¦å¥å­¦éï¼å ¨ç10åï¼å½å¹´å¯ä¸è·å¥ç¡å£«ï¼åè¡¨è®ºæå ±åè¡¨CCF-A/Bç±»è®ºæ160ä½ç¯ï¼é¨åä»£è¡¨ä½å¦ä¸ï¼[29] Qinggang Zhang+, Zhishang Xiang+, Yilin Xiao, Le Wang, Junhui Li, Xinrun Wang, and Jinsong Su*. 2025. FaithfulRAG: Fact-Level Conflict Modeling for Context-Faithful Retrieval-Augmented Generation. In Proc. of ACL2025. (CCF-Aç±»)[28] Liang Zhang+, Ziyao Lu+, Fandong Meng, Hui Li, Jie Zhou, and Jinsong Su*. 2025. Advancing SMoE for Continuous Domain Adaptation of MLLMs: Adaptive Router and Domain-Specific Loss. In Proc. of ACL2025. (CCF-Aç±»)[27] Liang Zhang, Yang zhang, Ziyao Lu, Fandong Meng, Jie Zhou, and Jinsong Su*. 2025. A Self-Denoising Model for Robust Few-Shot Relation Extraction. In Proc. of ACL2025. (CCF-Aç±»)[26] Suhang Wu, Jialong Tang, Chengyi Yang, Pei Zhang, Baosong Yang, Junhui Li, Junfeng Yao*, Min Zhang, and Jinsong Su*. 2025. Locate-and-Focus: Enhancing Terminology Translation in Speech Language Models. In Proc. of ACL2025. (CCF-Aç±»)[25] Ante Wang, Linfeng Song*, Ye Tian, Dian Yu, Haitao Mi, Xiangyu Duan, Zhaopeng Tu*, Jinsong Su*, and Dong Yu. 2025. Don't Get Lost in the Trees: Streamlining LLM Reasoning by Overcoming Tree Search Exploration Pitfalls. In Proc. of ACL2025. (CCF-Aç±»)[24] Yaoxiang Wang+, Haoling Li+, Xin Zhang+, Jie Wu, Xiao Liu, Wenxiang Hu, Zhongxin Guo, Yangyu Huang, Ying Xin, Yujiu Yang*, Jinsong Su*, Qi Chen, Scarlett Li. 2025. EpiCoder: Encompassing Diversity and Complexity in Code Generation. In Proc. of ICML2025. (CCF-Aç±»)[23] Xiaoyue Wang+, Xin Liu+, Lijie Wang, Suhang Wu, Jinsong Su*, and Hua Wu. 2024. A Simple yet Effective Self-Debiasing Framework for Transformer Models. Artificial Intelligence. (CCF-Aç±»)[22] Jianheng Huang+, Leyang Cui+, Ante Wang, Chengyi Yang, Xinting Liao, Linfeng Song, Junfeng Yao, and Jinsong Su*. 2024. Mitigating Catastrophic Forgetting in Large Language Models with Self-Synthesized Rehearsal. In Proc. of ACL2024. (CCF-Aç±»)[21] Zhiwei Cao+, Qian Cao+, Yu Lu, Ningxin Peng, Luyang Huang, Shanbo Cheng*, and Jinsong Su*. 2024. Retaining Key Information under High Compression Rates: Query-Guided Compressor for LLMs. In Proc. of ACL2024. (CCF-Aç±»)[20] Yongjing Yin+, Jiali Zeng+, Jinsong Su*, Chulun Zhou, Fandong Meng, Jie Zhou, Degen Huang, and Jiebo Luo. 2023. Multi-modal Graph Contrastive Encoding for Neural Machine Translation. Artificial Intelligence. (CCF-Aç±»).[19] Zhiwei Cao, Baosong Yang, Huan Lin, Suhang Wu, Xiangpeng Wei, Dayiheng Liu, Jun Xie, Min Zhang and Jinsong Su*. 2023. Bridging the Domain Gaps in Context Representations for k-Nearest Neighbor Neural Machine Translation. In Proc.  of ACL2023. (CCF-Aç±»)[18] Zhibin Lan+, Jiawei Yu+, Xiang Li, Wen Zhang, Jian Luan, Bin Wang, Degen Huang and Jinsong Su*. 2023. Exploring Better Text Image Translation with Multimodal Codebook. In Proc.  of ACL2023. (CCF-Aç±»)[17] Ante Wang+, Linfeng Song+, Qi Liu, Longyue Wang, Zhaopeng Tu, Jinsong Su*, Dong Yu. 2023. Search-Engine-augmented Dialogue Response Generation with Cheaply Supervised Query Production. Artificial Intelligence. (CCF-Aç±»)[16] Chulun Zhou+, Yunlong Liang+, Fandong Meng, Jie Zhou, Jinan Xu, Hongji Wang, Min Zhang and Jinsong Su*. 2023. A Multi-task Multi-stage Transitional Training Framework for Neural Chat Translation. IEEE Transactions on Pattern Analysis and Machine Intelligence. (CCF-Aç±»)[15] Chulun Zhou, Fandong Meng, Jie Zhou, Min Zhang, Hongji Wang, Jinsong Su*. 2022. Confidence Based Bidirectional Global Context Aware Training Framework for Neural Machine Translation. In Proc. of ACL2022. (CCF-Aç±»)[14] Hui Jiang, Chulun Zhou, Fandong Meng, Biao Zhang, Jie Zhou, Degen Huang, Qingqiang Wu and Jinsong Su*. 2021. Exploring Dynamic Selection of Branch Expansion Orders for Code Generation. In Proc. of ACL2021. (CCF-Aç±»)[13] Huan Lin, Liang Yao, Baosong Yang, Dayiheng Liu, Haibo Zhang, Weihua Luo, Degen Huang and Jinsong Su*. 2021. Towards User-Driven Neural Machine Translation. In Proc. of ACL2021. (CCF-Aç±»)[12] Xin Liu, Baosong Yang, Dayiheng Liu, Haibo Zhang, Weihua Luo, Min Zhang, Haiying Zhang and Jinsong Su*. 2021. Bridging Subword Gaps in Pretrain-Finetune Paradigm for Natural Language Generation. In Proc. of ACL2021. (CCF-Aç±»)[11] Jinsong Su, Jialong Tang, Hui Jiang, Ziyao Lu, Yubin Ge, Linfeng Song, Deyi Xiong, Le Sun, and Jiebo Luo. 2021. Enhanced Aspect-Based Sentiment Analysis Models with Progressive Self-supervised Attention Learning. Artificial Intelligence. (CCF-Aç±»)[10] Yongjing Yin, Fandong Meng, Jinsong Su*, Chulun Zhou, Zhengyuan Yang, Jie Zhou and Jiebo Luo. 2020. A Novel Graph-based Multi-modal Fusion Encoder for Neural Machine Translation. In Proc. of ACL2020. (CCF-Aç±»)[9] Chulun Zhou, Liangyu Chen, Jiachen Liu, Xinyan Xiao, Jinsong Su*, Sheng Guo and Hua Wu. 2020. Exploring Contextual Word-level Style Relevance for Unsupervised Style Transfer. In Proc. of ACL2020. (CCF-Aç±»)[8] Linfeng Song, Ante Wang, Jinsong Su*, Yue Zhang, Kun Xu, Yubin Ge and Dong Yu. 2020. Structural Information Preserving for Graph-to-Text Generation. In Proc. of ACL2020. (CCF-Aç±»)[7] Jinsong Su, Jiali Zeng, Jun Xie, Huating Wen, Yongjing Yin and Yang Liu. 2019. Exploring Discriminative Word-Level Domain Contexts for Multi-domain Neural Machine Translation. IEEE Transactions on Pattern Analysis and Machine Intelligence. (CCF-Aç±»).[6] Jinsong Su, Xiangwen Zhang, Qian Lin, Yue Qin, Junfeng Yao and Yang Liu. 2019. Exploiting Reverse Target-Side Contexts for Neural Machine Translation via Asynchronous Bidirectional Decoding. Artificial Intelligence. (CCF-Aç±»)[5] Jialong Tang, Ziyao Lu, Jinsong Su*, Yubin Ge, Linfeng Song, Le Sun and Jiebo Luo. 2019. Progressive Self-Supervised Attention Learning for Aspect-Level Sentiment Analysis. In Proc. of ACL2019. (CCF-Aç±»)[4] Biao Zhang, Deyi Xiong, Jinsong Su*. 2018. Neural Machine Translation with Deep Attention. IEEE Transactions on Pattern Analysis and Machine Intelligence. (CCF-Aç±»)[3] Biao Zhang, Deyi Xiong, Jinsong Su*. 2018. Accelerating Neural Transformer via an Average Attention Network. In Proc. of ACL 2018. (CCF-Aç±»)[2] Jinsong Su, Deyi Xiong, Yang Liu, Xianpei Han, Hongyu Lin, Junfeng Yao, Min Zhang. 2015. A Context-Aware Topic Model for Statistical Machine Translation. In Proc. of ACL 2015, Oral. (CCF-Aç±»)[1] Jinsong Su*, Hua Wu, Haifeng Wang, Yidong Chen, Xiaodong Shi, Huailin Dong, Qun Liu. 2012. Translation Model Adaptation for Statistical Machine Translation with Monolingual Topic Information. In Proc. of ACL 2012, Oral. (CCF-Aç±») Â© Copyright Center for Digital Media Computation of Xiamen Universityèç³»äººï¼èèå¸ é®ç®±ï¼jssu@xmu.edu.cn",
  "content_length": 9258,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:10"
}