{
  "name": "Jinsong Dong",
  "homepage": "https://www.comp.nus.edu.sg/~dongjs",
  "status": "success",
  "content": "NUS School of Computing - Dr. Jin Song DONG National University of Singapore Dr. DONG, Jin Song Professor, Computer Science Department, School of Computing, National University of Singapore 13 Computing Drive Singapore 117417 E-mail: dcsdjs at nus dot edu dot sg or dongjs1@gmail.com Brief Bio Qualifications Work Experiences Publications PhD Students Personal Interests (This is a CV like homepage) Brief Bio Dr. Jin-Song Dong is a full professor at the National University of Singapore. His research spans a range of fields, including formal methods, safety and security systems, probabilistic reasoning, sports analytics, trusted machine learning, and verified LLM code synthesis. He co-founded the commercialized PAT verification system, which has garnered thousands of registered users from over 150 countries. Jin Song co-founded the commercialized trusted machine learning system Silas (www.depintel.com). He served on the editorial board of ACM Transactions on Software Engineering and Methodology, Formal Aspects of Computing, and Innovations in Systems and Software Engineering, A NASA Journal. He has successfully supervised 33 PhD students, many of whom have become tenured faculty members at leading universities worldwide. He is also a Fellow of the Institute of Engineers Australia. Jin Song developed Markov Decision Process (MDP) models for tennis strategy analysis using PAT, assisting professional players with pre-match analysis (outperforming the world's best). In his spare time, he is a Junior Grand Slam coach and takes pleasure in coaching tennis to his students, and his three children, all of whom have reached the #1 national junior ranking in Singapore/Australia. Two of his children have earned NCAA Division 1 full scholarships, while his second son, Chen Dong (professionally ranked in ATP), played #1 singles for Australia in the Junior Davis Cup World Final and participated in both the Australian Open and US Open Junior Grand Slams. Research areas design analysis and model checking (PAT) trusted machine learning, LLM, and decision making (Silas) sports analytics (new ISACE series) context awareness and pervasive computing (Semantic Space) real-time concurrent system specification (TCOZ) ontology, services, agent and reasoning formal methods and safety/security critical systems object, component, and language semantics Qualifications PhD, University of Queensland, Australia (93 - 95) BInfTech with First Class Honours, University of Queensland, Australia (89-92) - Major in Software Engineering. Work Experiences Professor (2016) Associate Professor (2005) Assistant Professor (1998), Computer Science Department , School of Computing, National University of Singapore (NUS) Deputy Head (CS Department, 2023-2024). Faculty Promotion Committee (SoC, 2021-current). Graduate Committee (SoC, 2001-2014, 2022-current). NUS Senate Member (2020-current) Search Committee (CS Department, 2005-2008, 2019-2023). Member of PhD supervisors at NUS Graduate School for Integrative Sciences and Engineering (NGS) Assistant Dean (Graduate Office, SoC, 2005-2008, 2022). SINGA committee Member (NUS, 2007-2009). Co-Director of the IPAL Lab (2013-2019) Publication Ranking Committee (CS Department, 2001-2010). PhD QE Co-ordinator (CS Department, 2008-2014). CS Exco Committee Member (CS Department, 2008-2011). Senior Research Scientist (1998), Research Scientist (1995-98), Division of Mathematical and Information Sciences, Commonwealth Scientific and Industrial Research Organisation (CSIRO), Australia Tutor (1991-95), CS Department, The University of Queensland. Senior Research Assistant, Software Verification Research Centre (11/92-1/93) Research Assistant, CS Dept, The University of Queensland (11/91-1/92) Some Awards/Recognition ACM SIGSOFT Distinguished Paper Award for ICSE 2020 NUS Research Recognition Award (2020) Fellow of Institute of Engineers Australia (2018) 20 Year ICFEM Most Influential System Award (2018) Visiting Fellow at Kellogg College, Oxford University (elected during 2006 sabbatical) NUS Young Researcher Award (2004) Richard Jago Memorial Prize (1995), Australian Postgraduate Award (93-95) Some Professional and Research Activities Organisations: Editorial Board Member of ACM Transactions on Software Engineering and Methodology (ACM TOSEM) (2015-2020) Editorial Board Member of Formal Aspects of Computing Journal (FAoC) Editorial Board Member of Innovations in Systems and Software Engineering, A NASA Journal (ISSE) Advisory Board Member of FME, Formal Methods Europe Steering Committee Member of ICFEM, International Conference on Formal Engineering Methods Steering Committee Member of PRDC, IEEE Pacific Rim International Symposium on Dependable Computing Steering Committee Member of APSEC, Asia-Pacific Software Engineering Conference General Chair of the 19th International Symposium on Formal Methods, FM'14, Singapore, May 2014. General Co-Chair of 18th IEEE International Conference on Engineering of Complex Computer Systems (ICECCS'13), Singapore, July 2013. General Co-Chair of The 15th International Conference on Formal Engineering Methods, Queenstown, NZ. Oct 29 - Nov 1, 2013. Program Co-Chair of The 12th International Conference on Formal Engineering Methods, Shanghai, China, Nov 2010. General Chair of 8th International Symposium on Automated Technology for Verification and Analysis (ATVA'10) 21-24 September 2010, Singapore General Chair of The 4th IEEE International Conference on Secure Software Integration and Reliability Improvement (SSIRI'10), Singapore, 9-11 June, 2010 Conference Co-Chair of 6th International Conference on Integrated Formal Methods (IFM'07), Oxford, UK, 2-6 July 2007 Program Co-Chair of 12th IEEE International Conference on Engineering of Complex Computer Systems (ICECCS'07), Auckland, NZ, 11-14 July 2007. Tutorial Chair of the 14th International Symposium on Formal Methods, FM 2006, Canada. Program Co-Chair of International Workshop on Web Languages and Formal Methods WLFM 2005, UK. Program Co-Chair of ICFEM 2003, Singapore. Program Co-Chair of APSEC 2000, Singapore. Program Committee Member of The 36th International Conference on Software Engineering, ICSE'14, Hyderabad, India, June 1-7, 2014, ICSE'10, Cape Town, May 2010 FM 2011: 17th International Symposium of Formal Methods, Ireland. June 2011. FM'09, Eindhoven, the Netherlands, 13th FM'05, Newcastle, UK. FM'99, World Congress, Toulouse France, 1999. 9th International Conference on Integrated Formal Methods IFM2012, Pisa, Italy. IFM2010, Nancy, France. IFM'07, Oxford, UK, IFM'05, Eindhoven, The Netherlands. Nov 2005 , IFM'04, Canterbury UK . IFM'02, Turku, Finland . IFM'00, Schloss Dagstuhl, Germany . IFM'99, York, UK . 13th ICFEM 2011, Durham, UK. 10th ICFEM 2008, Kitakyushu-City, Japan. ICFEM'07, Florida, USA.. ICFEM'05, Manchester UK. ICFEM'04, Seattle USA. ICFEM'03, Singapore. ICFEM'02, Shanghai China, ICFEM'00, York UK , ICFEM'98, Brisbane Australia The 2nd NASA Formal Methods Symposium NFM'10, Washington D.C., April 13-15, 2010 The 5th Annual European Semantic Web Conference ESWC 2008, Tenerife, Spain. 2008 The 5th International Semantic Web Conference ISWC 2006, Athens, USA. and SWESE 2006 4th International Conference of B and Z Users ZB'05, Guildford UK, 11th IEEE International Conference on Engineering of Complex Computer Systems ICECCS'06, Stanford University, USA. ICECCS'05, Shanghai China. ICECCS'04, Florence, Italy. ICECCS'02, Greenbelt USA. ICECCS'01, Skovde, Sweden . ICECCS'00, Tokyo, Japan. ICECCS'99, Las Vegas, USA. 8th International Conference on Quality Software, QSIC'08, Oxford, UK. QSIC'07, Oregon USA . QSIC'05, Melbourne Australia. QSIC'04 Braunschweig Germany. QSIC'03, Dallas USA. APAQS'01, Hong Kong . 15th APSEC'08, Beijing, China. APSEC'07, Nagoya, Japan. APSEC'06, Bangalore, India. APSEC'04, Busan, Korea. APSEC'03, Chiangmai, Thailand. APSEC'02, Gold Coast, Australia . APSEC'01, Macau . APSEC'00, Singapore . APSEC'99, Takamatsu Japan 5th IEEE International Conference on Software Engineering and Formal Methods SEFM'07, London, UK. SEFM'05, Koblenz Germany. SEFM'04, Beijing China. SEFM'03, Brisbane Australia. 20th International Conference on Software Engineering and Knowledge Engineering, SEKE'08, San Francisco, USA. SEKE'07, Boston, USA. SEKE'06, San Francisco Bay, USA. SEKE'05, Taipei Taiwan, 2005 Research projects Publications Book/Editorship S. Mirjalili, J. S. Dong, A. Lewis: Nature-Inspired Optimizers - Theories, Literature Reviews and Applications. Springer 2020 S. Mirjalili, J. S. Dong, Multi-objective optimization using artificial intelligence techniques Springer, 2020 J. S. Dong and H. Zhu (Editors), Formal Methods and Software Engineering, Proceedings of the 12th International Conference on Formal Engineering Methods, LNCS (vol 2885), Springer-Verlag, Nov 2010. J. S. Dong and J. Sun (Editors). Special Issue on the Grand Verification Challenge, Science of Computer Programming, Volume 74(4): (2009) A. Arenas, J. S. Dong, A. Martin, B. Matthews (Editors). Special Issue on Web Languages and Formal Methods (WLFM'05). Electr. Notes Theor. Comput. Sci. 151(2): (2006) J. S. Dong and J. Woodcock (Editors), Formal Methods and Software Engineering, Proceedings of the 5th International Conference on Formal Engineering Methods, LNCS (vol 2885), Springer-Verlag, Nov 2003. J. S. Dong, J. He and M. Purvis (Editors), Proceedings of The 7th Asia-Pacific Software Engineering Conference, IEEE Press. Dec 2000. Refereed Papers in Journals/Monographs/Conferences (partial list) Y Zhang, Y Sun, A Lee, J Dong, RvLLM: LLM Runtime Verification with Domain Knowledge, NeurIPS 2025 W Jin, Y Cao, J Su, J Xue, J Hao, K Xu, J Dong, D Wang, ALMGuard: Safety Shortcuts and Where to Find Them as Guardrails for Audio¿Language Models, NeurIPS 2025 W Dai, B Li, N Dong, G Bai, J Dong, FracFace: Breaking the Visual Clues¿Fractal-Based Privacy-Preserving Face Recognition, NeurIPS 2025 Y Zhang, Y Cai, X Zuo, X Luan, K Wang, M Sun, Z Hou, J Sun, J Dong,",
  "content_length": 40447,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:11"
}