{
  "name": "Jinwei Ye",
  "homepage": "https://ivlab.cse.lsu.edu",
  "status": "success",
  "content": "IV Lab 2022.01   Dr. Ye joins George Mason University (GMU) in Spring 2022. 2021.10   Welcome Zhang Chen to join our lab as Research Fellow in Fall 2021. 2021.09   Simron has successfully defended her Ph.D. thesis and will join 3M Research in Oct. Congratulations to Simron! 2021.07   Our group has three papers accepted to ICCV 2021 (one as Oral). Congratulations to Yuqi, Nianyi, and Simron! 2021.07   Dr. Ye receives an NSF IIS Small grant as lead PI (with co-PI: Corina Barbalata). 2021.06   Dr. Ye will serve as an area chair for CVPR 2022. 2021.05   Nianyi Li will join Clemson University as Tenure-Track Assistant Proferssor in this fall. Congratulations to Nianyi! 2021.01   Our team participates in the NSF Innovation Corps (I-Corps) program. 2020.09   Our NRI-CmmUS-LSU website is online. 2020.08   Dr. Ye receives an NSF NRI grant as co-PI with Corina Barbalata (lead PI), Marcio de Queiroz, Hunter Gilbert and Genevieve Palardy. 2020.07   Our paper \"3D Fluid Flow Reconstruction Using Compact Light Field PIV\" is accepted by ECCV 2020. 2020.03   Dr. Ye receives the NSF CRII (CISE Research Initiation Initiative) award. 2020.03   Our CVPR paper has been selected as Oral Presentation. 2020.03   Our ICCP paper has been recommended for publication in the PAMI special issue on Computational Photography. 2020.02   Our paper \"Dynamic Fluid Surface Reconstruction Using Deep Neural Network\" is accepted by CVPR 2020. 2020.02   Dr. Ye will serve as an area chair for ICPR 2020. 2020.02   Our paper \"Shape and Reflectance Reconstruction Using Concentric Multi-Spectral Light Field\" is accepted by ICCP 2020. 2020.01   Dr. Ye will serve as an area chair for CVPR 2021. 2019.12   IV lab receives a gift grant from DGene, Inc. 2019.11   Our paper \"Structure from Motion on XSlit Cameras\" is accepted by PAMI. 2019.10   Dr. Ye receives the LSU LIFT2 (Leveraging Innovation for Technology Transfer) award. 2019.07   Welcome Nianyi Li to join our lab as Research Fellow in Fall 2019. 2019.03   Our paper \"Mirror Surface Reconstruction Using Polarization Field\" is accepted by ICCP 2019. more 2018.08   Welcome Yuqi Ding and Simron Thapa to join our lab as PhD student in Fall 2018. 2018.07   Our paper \"Learning to Dodge A Bullet\" is accepted by ECCV 2018. 2018.06   CVPR 2022 will be held in New Orleans, LA! Jinwei Ye will serve as local arrangements chair. 2018.06   Our paper \"Content Aware Image Pre-Compensation\" is accepted by PAMI. 2018.05   Welcome Zhang Chen and Anpei Chen to join our lab as Visiting Students in Summer 2018. 2018.05   Congratulations to Sirazum M. Tisha for winning the GHC 18 Scholarship! 2018.05   Welcome Mingyuan Zhou and Zhong Li to join our lab as Visiting Scholars in Summer 2018. 2018.03   IV lab receives grant from Louisiana Board of Regents. 2017.12   Welcome Jie Lu, Shi Jin and Ruiyang Liu to join our lab as Visiting Students in Winter 2017. 2017.09   Welcome Sirazum M. Tisha to join our lab as PhD student in Fall 2017. 2017.09   Lab website is online. less A new reciprocal theory extends the classical Helmholtz stereopsis by considering the polarization state of light in the reciprocal paths. A light lield-based PIV solution to track dense particles floating in the fluid and reconstruct the 3D fluid flow. A deep neural network that estimates the depth and normal maps of a fluid surface by analyzing the refractive distortion of a reference background pattern. A Concentric multi-spectral light field (CMSLF) design that is able to recover the shape and reflectance of surfaces of various materials in one shot. A novel computational imaging approach for reconstructing complex mirror surfaces using a dense illumination field with angularly varying polarization states. A learning-based solution that is capable of producing the bullet-time effect from only a small set of images. A graph-based non-rigid shape registration framework that can simultaneously recover 3D human body geometry and estimate pose/motion at high fidelity. A two-layer liquid crystal display (LCD) setup for reconstructing the mirror-type specular objects. A spectral plenoptic camera design by encoding the microlens array to reconstruct plenoptic images with high spectral and spatial resolution. A new saliency detection algorithm for light fields which provides useful focusness, depths, and objectness cues with unique refocusing capability. New metric to measure the contrast and ringing of a pre-compensated image, and a non-linear tone mapping function significantly improves the contrast. A prototype XSlit camera by modifying a commercial interchangeable lens camera (Sony NEX-5N). Its lens is replaced by a pair of cylindrical lenses. A light field probe based solution to reconstruct the refractive index field (RIF) within the gas volume. A new normal estimation from Ray-Ray correspondences and a angular-domain surface integration scheme to recover the fluid surface.",
  "content_length": 4911,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:14"
}