{
  "name": "Jinyang Liu 0003",
  "homepage": "https://jliu-1.github.io",
  "status": "success",
  "content": "Jinyang's Homepage Jinyang Liu Assistant Professor Department of Computer Science University of Houston Email: jliu 217 at central dot uh dot edu Google Scholar CV Biography Jinyang Liu is an assistant professor at the Department of Computer Science of the University of Houston. He received a PhD degree in Computer Science at the University of California, Riverside in June 2024. Prior to that, He received Master's degree in Data Science from Peking University in 2019 and received B.S. degree in Mathematics and Applied Mathematics from Peking University in 2016. He has also been worked as a long-term research intern at the Argonne National Laboratory (ANL). Jinyang's major research field is High-Performance Computing, focusing on the topics of error-bounded lossy compression for scientific data. He also has research interests and experiences broadly in the areas of Parallel Computing, Data management/reduction, and Artificial Intelligence. He has presented publications in various highly prestigious conferences and journals such as SIGMOD, VLDB, SC, ICDE, ICS, HPDC, IEEE IPDPS, etc. He has received the Dissertation Year Fellowship (DYP) award from UCR and Best Paper Nominations from ICS 23 and HPDC 25. He has developed several popular different scientific data error-bounded lossy compressors, such as SZ3, QoZ, and cuSZ. Jinyang is looking for several Ph. D. students to join his lab in Spring 2026 or later. His full CV is at: My CV. Check here for more information about opening PhD positions in his lab. Research Interests High Performance Computing Scientific Data Management Deep learning for High Performance Computing and Data Reduction AI for Science Education Ph. D. in Computer Science, University of California, Riverside, 2019 - 2024. M. S. in Data Science, Peking University, 2016 - 2019. B. S. in Mathematics and Applied Mathematics, Peking University, 2011 - 2016. Awards Best Paper Nomination in the 34th ACM International Symposium on High-Performance Parallel and Distributed Computing (HPDC '25), 2025 Best Paper Nomination in International Conference on Supercomputing 2023 (ICS '23), 2023 Dissertation Year Program Fellowship, University of California, Riverside, 2023 Outstanding Graduate Student, Peking University, 2019 Outstanding Research Award, Peking University, 2018 Students Ziwei Qiu (PhD @ UH CS, 2025.01 - ) Nicholas Anderson (PhD @ UH CS, 2025.08 - ) Alumni Jinwen Pan (Thesis advisee, MS @ TUM CS, 2024.12 - 2025.07) Melis Irmak (Thesis advisee, MS @ UH CS, 2024.09 - 2025.05) Latest News Our paper: \"Boosting Scientific Error-Bounded Lossy Compression through Optimized Synergistic Lossy-Lossless Orchestration\" was accepted by SC 25. Congratulations to Shixun and Jinwen! 06/2025: Our NSF CSSI project \"SGCC: An Efficient GPU-oriented Data Reduction Cyberinfrastructure for Scientific Data Analysis\" was awarded (total amount: $600K, my role: lead PI, my share: $180K). 04/2025: Our HPDC '25 paper was nominated for the Best Paper Award. 04/2025: My first-author paper QPET: A Versatile and Portable Quantity-of-Interest-Preservation Framework for Error-Bounded Lossy Compression was accepted by VLDB '25. 04/2025: One paper was accepted by CSUR. 04/2025: One paper was accepted by HPDC '25. 04/2025: One paper was accepted by ICS '25. 12/2024: One paper was accepted by IPDPS '25. 11/2024: One paper was accepted by PPoPP '25. 10/2024: One paper was accepted by SIGMOD '25. 08/2024: My employment as an assistant professor of the department of Computer Science at the University of Houston started. 07/2024: One paper was accepted by CLUSTER '24. 06/2024: My first-author paper CUSZ-i: High-Ratio Scientific Lossy Compression on GPUs with Optimized Multi-Level Interpolation and another 1 paper were accepted by SC '24. 04/2024: One paper was accepted by ICS '24. 03/2024: I will join the department of Computer Science at the University of Houston on Fall 2024. 01/2024: Two papers were accepted by IPDPS '24. 11/2023: One paper was accepted by ICDE '24. 11/2023: My first-author paper High-performance Effective Scientific Error-bounded Lossy Compression with Auto-tuned Multi-component Interpolation was accepted by SIGMOD '24. 10/2023: My first-author paper Scientific Error-bounded Lossy Compression with Super-resolution Neural Networks and two other papers were accepted by BigData '23. 09/2023: One paper was accepted by TPDS. 08/2023: One poster was accepted by Cluster '23. 07/2023: One paper was accepted by Cluster '23. 06/2023: Attended the ICS '23 conference. Made a presentation of my paper FAZ: A flexible auto-tuned modular error-bounded compression framework for scientific data. 05/2023: My accepted ICS '23 paper FAZ: A flexible auto-tuned modular error-bounded compression framework for scientific data was nominated for the Best Paper Award. Teaching 2025 Fall: COSC 6397: Information Theory and Data Compression (@UH-CS). 2025 Spring: COSC 2306: Data Programming (@UH-CS). 2024 Fall: COSC 2306: Data Programming (@UH-CS). Services Program Committee: ICS 2025, Cluster 2025, CCGrid 2025, ICDCS 2025, GPGPU 2025, IWBDR 2023, DRBSD-10/11. Reviewer: HiPC 2024, IPDPS 2024, CCGrid 2024, ICS 2023, DCC 2023, HDIS 2022, IWBDR 2022/2023, ICMLA 2021, TPDS, THPC, TOMM. Selected Publications ( Full list in Google Scholar) SC '25 Shixun Wu*, Jinwen Pan*, Jinyang Liu+, Jiannan Tian, Ziwei Qiu, Jiajun Huang, Kai Zhao, Xin Liang, Sheng Di, Zizhong Chen, Franck Cappello. Boosting Scientific Error-Bounded Lossy Compression through Optimized Synergistic Lossy-Lossless Orchestration. SC25: International Conference for High Performance Computing, Networking, Storage and Analysis. (*: Co-first authors, +: Corresponding author) VLDB '25 Jinyang Liu*, Pu Jiao*, Kai Zhao, Xin Liang, Sheng Di, Franck Cappello. QPET: A Versatile and Portable Quantity-of-Interest-Preservation Framework for Error-Bounded Lossy Compression. VLDB 2025: 51st International Conference on Very Large Data Bases. (*: Co-first authors) SC '24 Jinyang Liu*, Jiannan Tian*, Shixun Wu*, Sheng Di, Boyuan Zhang, Robert Underwood, Yafan Huang, Jiajun Huang, Kai Zhao, Guanpeng Li, Dingwen Tao, Zizhong Chen, Franck Cappello. CUSZ-i: High-Ratio Scientific Lossy Compression on GPUs with Optimized Multi-Level Interpolation. SC24: International Conference for High Performance Computing, Networking, Storage and Analysis. (*: Co-first authors) SIGMOD '24 Jinyang Liu, Sheng Di, Kai Zhao, Xin Liang, Sian Jin, Zizhe Jian, Jiajun Huang, Shixun Wu, Zizhong Chen, Franck Cappello. High-performance Effective Scientific Error-bounded Lossy Compression with Auto-tuned Multi-component Interpolation. 2024 ACM International Conference on Management of Data (SIGMOD). ICS '23 (Best Paper Nominee) Jinyang Liu, Sheng Di, Kai Zhao, Xin Liang, Zizhong Chen, Franck Cappello. FAZ: A flexible auto-tuned modular error-bounded compression framework for scientific data. 2023 International Conference on Supercomputing (ICS) SC '22 Jinyang Liu, Sheng Di, Kai Zhao, Xin Liang, Zizhong Chen, Franck Cappello. Dynamic quality metric oriented error bounded lossy compression for scientific datasets. 2022 SC22: International Conference for High Performance Computing, Networking, Storage and Analysis (SC). BigData '23 Jinyang Liu, Sheng Di, Sian Jin, Kai Zhao, Xin Liang, Zizhong Chen, Franck Cappello. Scientific Error-bounded Lossy Compression with Super-resolution Neural Networks. 2023 IEEE International Conference on Big Data (BigData). Cluster '21 Jinyang Liu, Sheng Di, Kai Zhao, Sian Jin, Dingwen Tao, Xin Liang, Zizhong Chen, Franck Cappello. Exploring autoencoder-based error-bounded compression for scientific data. 2021 IEEE International Conference on Cluster Computing (CLUSTER). IWBDR-2 Jinyang Liu, Sihuan Li, Sheng Di, Xin Liang, Kai Zhao, Dingwen Tao, Zizhong Chen, Franck Cappello. Improving lossy compression for SZ by exploring the best-fit lossless compression techniques. The Second International Workshop on Big Data Reduction (held with BigData 2021). HPDC '25 (Best Paper Nominee) Zhuoxun Yang, Sheng Di, Longtao Zhang, Ruoyu Li, Ximiao Li, Jiajun Huang, Jinyang Liu, Franck Capello, Kai Zhao. IPComp: Interpolation Based Progressive Lossy Compression for Scientific Applications. The ACM International Symposium on High-Performance, Parallel and Distributed Computing (HPDC 2025). ICS '25 Wenqi Xia, Zewen Hu, Youyuan Liu, Boyuan Zhang, Jinzhen Wang, Jinyang Liu, Wei Niu, Stavros Kalafatis, Junzhou Huang, Sian Jin, Daoce Wang, Jiannan Tian, Miao Yin. NeurLZ: An Online Neural Learning-based Method to Enhance Scientific Lossy Compression. 2025 InternationalConference on Supercomputing (ICS). IPDPS '25 Pu Jiao, Sheng Di, Mingze Xia, Xuan Wu, Jinyang Liu, Xin Liang, Franck Capello. Improving the Efficiency of Interpolation-Based Scientific Data Compressors with Adaptive Quantization Index Prediction. 39th IEEE International Parallel & Distributed Processing Symposium (IPDPS 2025). SIGMOD '25 Longtao Zhang, Ruoyu Li, Congrong Ren, Sheng Di, Jinyang Liu, Jiajun Huang, Robert Underwood, Pascal Grosset, Dingwen Tao, Xin Liang, Hanqi Guo, Franck Cappello, Kai Zhao. LCP: Enhancing Scientific Data Management with Lossy Compression for Particles. 2025 ACM Internation Conference on Management of Data (SIGMOD). PPoPP '25 Shixun Wu, Yujia Zhai, Jinyang Liu, Jiajun Huang, Zizhe Jian, Huangliang Dai, Sheng Di, Zizhong Chen, Franck Cappello. TurboFFT: Co-Designed High-Performance and Fault-Tolerant Fast Fourier Transform on GPUs ACM SIGPLAN Symposium on Principles and Practice of Parallel Programming 2025 (PPoPP). SC '24 Jiajun Huang, Sheng Di, Xiaodong Yu, Yujia Zhai, Jinyang Liu, Zizhe Jian, Xin Liang, Kai Zhao, Xiaoyi Lu, Zizhong Chen, Franck Cappello, Yanfei Guo, Rajeev Thakur. ZCCL: Significantly Improving Collective Communication With Error-Bounded Lossy Compression. 2024 SC24: International Conference for High Performance Computing, Networking, Storage and Analysis. Cluster '24 Shixun Wu, Yitong Ding, Yujia Zhai, Jinyang Liu, Jiajun H",
  "content_length": 12608,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:13"
}