{
  "name": "Jinyu Gu 0001",
  "homepage": "https://ipads.se.sjtu.edu.cn/pub/members/jinyu_gu",
  "status": "success",
  "content": "Jinyu Gu (古金宇) [IPADS] pub:members:jinyu_gu Table of Contents Jinyu Gu (古金宇) About Me Teaching Serivices Research Interests Selected Publications Awards and Honors Jinyu Gu (古金宇) Associate Professor Shanghai Jiao Tong University 800 Dongchuan Road, Minhang District, Shanghai, P.R.China Zip/Postal Code: 200240 Email: gujinyu@sjtu.edu.cn About Me I am an associate professor in School of Software, Shanghai Jiao Tong University (SJTU). I received my bachelor's degree in software engineering from SJTU in 2016, and my Ph.D. degree in computer science from SJTU in 2021, advised by Prof. Haibo Chen, Prof. Yubin Xia, and Prof. Binyu Zang. My research mainly focuses on Operating Systems, Machine Learning Systems,and Systems Security. 中文主页 Google Scholar | DBLP I am always looking for self-motivated students who are interested in operating system areas. Drop me an E-mail if you want to join us or want to do research intern! Teaching Introduction to Computer Systems (CSAPP) Operating System Course Labs We also publish an education paper on SIGCSE TS. Experiences with ChCore Experimental Operating System Kernel. Haibo Chen, Yubin Xia and Jinyu Gu. Proceedings of the 56th ACM Technical Symposium on Computer Science Education. February 2026. Advanced Operating System Serivices Program Committee Member EuroSys 2026/2025/2023 SOSP 2025 SRC Chair USENIX ATC 2025 SIGCSE TS 2026 ChinaSys 2024 Transaction Reviewer: TOCS, TCC, Chinese Journal of Computers Contest Judge: National Collegiate Operating Systems Competition, OpenHarmony Contest Research Interests Microkernel Operating System UnderBridge: Leveraging new hardware features to significantly reduce inter-process communication (IPC) latency in microkernel operating systems. (ATC '20) TxIPC: Enhancing system fault tolerance by introducing transactional abstractions to microkernel IPC. (ICDCS '21) EPK/HyBridge: Proposing a scalable, lightweight memory domain design; continuing the research approach of UnderBridge to further reduce IPC latency in microkernel operating systems. (ATC '22) TEE Security Kernel for OpenHarmony OS (Co-founder of the OpenTrustee Project) Split Container: Building confidential containers with microkernel + Confidential Virtual Machine (CVM). (Security '25) μEFI: A Microkernel-Style UEFI with Isolation and Transparency. (ATC '25) System Software Research for Trusted Execution Environments (TEE) SGX-migration: Supporting dynamic migration in SGX trusted execution environments. (DSN '17) Enclavisor: Enhancing the flexibility and security of AMD SEV to support various secure scenarios. (TC '20) vTZ: Supporting ARM TrustZone virtualization through system design. (Security '17) UniTEE: Creating a unified programming abstraction across heterogeneous TEE platforms and supporting heterogeneous migration. (JCST '21) LightEnclave: Constructing multiple lightweight enclaves within a single SGX enclave. (Security '22) TZ-LLM: Securing on-device LLMs with ARM TrustZone. (EuroSys '26) Design of New Operating System Primitives Pisces: Designing a scalable persistent transactional memory programming interface for non-volatile memory (NVM). (ATC '19) LibASL: Designing highly scalable locks for big.LITTLE architectures. (PPoPP '22) Mitosis: A remote fork mechanism over RDMA interconnects. (OSDI '23) On-Demand Remote Paging: An OS paging mechanism for disaggregated memory architectures. (NSDI '25) Container Kernel Isolation: A hardware-software co-design for secure containers. (EuroSys '25) Efficient GPU Checkpoint/Restore: PhoenixOS: Concurrent OS-level GPU Checkpoint and Restore with Validated Speculation. (SOSP '25) Remote Memory Malloc/Free: OneSidedMW: Managing Disaggregated Memory Efficiently, Flexibly, and Securely with RNIC Offloading. (NSDI '26) Machine Learning Systems SAVE: How to make model inference tolerant GPU memory bit flips. (ATC '25) ASDSV: Accerlerate diffusion-based multi-modal generation with speculative inference. (NeurIPS '25) AMS: Leveraging OS-Level Primitives for Robotic Action Management. Selected Publications Conference Paper: [EuroSys] Xunjie Wang, Jiacheng Shi (co-first author), Zihan Zhao, Yang Yu, Zhichao Hua, Jinyu Gu ✉️. TZ-LLM: Protecting On-Device Large Language Models with Arm TrustZone. Proceedings of the 21th European Conference on Computer Systems, Edinburgh, UK, April, 2026. [USENIX NSDI] Zixuan Wang, Jinyu Gu ✉️, Xingda Wei, Yubin Xia. OneSidedMW: Managing Disaggregated Memory Efficiently, Flexibly, and Securely with RNIC Offloading. The 23rd USENIX Symposium on Networked Systems Design and Implementation. Renton, WA, USA, May 4–6, 2026. [NeurIPS] Kaijun Zhou, Xingyu Yan, Xingda Wei, Xijun Li, Jinyu Gu ✉️. Multimodal Generation Made Efficient with Approximately Speculative Diffusion and Speculative Verification. NeurIPS 2025. [SOSP] PhoenixOS: Concurrent OS-level GPU Checkpoint and Restore with Validated Speculation. Xingda Wei, Zhuobin Huang, Tianle Sun, Yingyi Hao, Rong Chen, Mingcong Han, Jinyu Gu, Haibo Chen. The 31st Symposium on Operating Systems Principles, 2025. [USENIX ATC] Wenxin Zheng, Bin Xu, Jinyu Gu ✉️, Haibo Chen. SAVE: Software-Implemented Fault Tolerance for Model Inference against GPU Memory Bit Flips. USENIX Annual Technical Conference, Boston, MA, USA, July 2025. [USENIX ATC] Le Chen, Yiyang Wu, Jinyu Gu ✉️, Yubin Xia, Haibo Chen. μEFI: A Microkernel-Style UEFI with Isolation and Transparency. USENIX Annual Technical Conference, Boston, MA, USA, July 2025. [EuroSys] A Hardware-Software Co-Design for Efficient Secure Containers. Jiacheng Shi, Yang Yu, Jinyu Gu ✉️ and Yubin Xia. The 20th ACM SIGOPS European Conference on Computer Systems, Rotterdam, Netherlands, 2025. [USENIX Security] Jiacheng Shi, Jinyu Gu ✉️, Yubin Xia and Haibo Chen. Serverless Functions Made Confidential and Efficient with Split Containers. The 34th USENIX Security Symposium, Seattle, WA, USA, 2025. [USENIX NSDI] Zixuan Wang, Xingda Wei, Jinyu Gu ✉️, Hongrui Xie, Rong Chen, Haibo Chen. ODRP: On-Demand Remote Paging with Programmable RDMA. 22nd USENIX Symposium on Networked Systems Design and Implementation, Philadelphia, PA, USA, April 28–30, 2025. [ICDCS] Wentai Li, kaijun Zhou, Jiacheng Shi, Xingman Chen, Yadong Liu, Luyuan Wang, Jinyu Gu ✉️. Understanding the IO Performance Gap between OS-level and VM-level Containers in High-Density Deployment. 44th IEEE International Conference on Distributed Computing Systems. New Jersey, USA, July 2024. [OSDI] No Provisioned Concurrency: Fast RDMA-codesigned Remote Fork for Serverless Computing. Xingda Wei, Fangming Lu, Tianxia Wang, Jinyu Gu, Yuhan Yang, Rong Chen, and Haibo Chen. 17th USENIX Symposium on Operating Systems Design and Implementation, Boston, MA, US, July 2023. [USENIX ATC] Jinyu Gu, Hao Li, Wentai Li, Yubin Xia, Haibo Chen. EPK: Scalable and Efficient Memory Protection Key. USENIX Annual Technical Conference, Carlsbad, CA, USA, July 2022. [USENIX Security] Jinyu Gu, Bojun Zhu, Mingyu Li, Wentai Li, Yubin Xia, and Haibo Chen. A Hardware-Software Co-design for Efficient Intra-Enclave Isolation. The 31st USENIX Security Symposium, Boston, MA, USA, 2022. [PPoPP] Nian Liu, Jinyu Gu ✉️, Dahai Tang, Kenli Li, Binyu Zang, Haibo Chen. Asymmetry-aware Scalable Locking. The 27th ACM SIGPLAN Annual Symposium on Principles and Practice of Parallel Programming, Seoul, Korea, 2022. [ICDCS] Wentai Li, Jinyu Gu ✉️, Nian Liu, Binyu Zang. Efficiently Recovering Stateful System Components of Multi-server Microkernels. In Proceedings of the 41st IEEE International Conference on Distributed Computing Systems, 2021. [USENIX ATC] Jinyu Gu, Xinyue Wu, Wentai Li, Nian Liu, Zeyu Mi, Yubin Xia, and Haibo Chen. Harmonizing Performance and Isolation in Microkernels with Efficient Intra-kernel Isolation and Communication. USENIX Annual Technical Conference, Boston, MA, USA, July 2020. [USENIX ATC] Jinyu Gu, Qianqian Yu, Xiayang Wang, Zhaoguo Wang, Binyu Zang, Haibing Guan, and Haibo Chen. Pisces: a scalable and efficient persistent transactional memory. USENIX Annual Technical Conference, Renton, WA, USA, July 2019. [USENIX Security] Zhichao Hua, Jinyu Gu, Yubin Xia, Haibo Chen, Binyu Zang, and Haibing Guan. vTZ: Virtualizing ARM TrustZone. The 26th USENIX Security Symposium, Vancouver, Canada, August 2017. [DSN] Jinyu Gu, Zhichao Hua, Yubin Xia, Haibo Chen, Binyu Zang, Haibing Guan, Jinming Li. Secure Live Migration of SGX Enclaves on Untrusted Cloud. The 47th IEEE/IFIP International Conference on Dependable Systems and Networks, Denver, CO, USA, 2017. Journal Paper: [IEEE TPDS] Ziqu Yu, Jinyu Gu ✉️ (co-first author), Zijian Wu, Nian Liu and Jian Guo. HTLL: Latency-Aware Scalable Blocking Mutex. IEEE Transactions on Parallel and Distributed Systems, 2025. [JCST] Wentai Li , Zixuan Wang, Jinyu Gu ✉️, Yubin Xia and Binyu Zang. Harmonizing Security and Performance in Microkernel File Servers. Journal of Computer Science and Technology, 2025. [IEEE TC] Jinyu Gu ✉️, Jiacheng Shi, Haoran Su, Wentai Li, Binyu Zang, Haibin Guan, Haibo Chen. Understanding and Mitigating Twin Function Misuses in Operating System Kernel[J]. IEEE Transactions on Computers, 2023. [IEEE TC] Yubin Xia, Zhichao Hua, Yang Yu, Jinyu Gu, Haibo Chen, Binyu Zang and Haibing Guan. COLONY: A Privileged Trusted Execution Environment with Extensibility. IEEE Transactions on Computers, 2021. [JCST] Jinyu Gu, Hao Li, Yubin Xia, Haibo Chen, Cheng-gang Qin, and Zheng-yu He. Unified Enclave Abstraction and Secure Enclave Migration on Heterogeneous TEE Architectures. Journal of Computer Science and Technology, 2021. [IEEE TC] Jinyu Gu, Xinyue Wu, Bojun Zhu, Yubin Xia, Binyu Zang, Haibing Guan, and Haibo Chen. Enclavisor: A Hardware-software Co-design for Enclaves on Untrusted Cloud. IEEE Transactions on Computers, 2020. [SCIS] Zhichao Hua, Yang Yu, Jinyu Gu, Yubin Xia, Haibo Chen and Binyu Zang. TZContainer: Protecting Container from Untrusted OS with ARM TrustZone. In Proceedings of SCIENCE CHINA Information Sciences, 2020. Awards and Honors Shanghai Jiao Ton",
  "content_length": 10554,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:13"
}