{
  "name": "Jinzhen Wang",
  "homepage": "https://sites.google.com/charlotte.edu/hpdilab/about-pi",
  "status": "success",
  "content": "HPDi Lab | UNC Charlotte - About PISearch this siteEmbedded FilesSkip to main contentSkip to navigationDr. Jinzhen WangAssistant Professor of CS@UNC CharlotteEmail: jwang96 at charlotte.eduOffice: Woodward Hall 210B Scholar / CV / GithubI am a tenure-track assistant professor in Computer Science at the University of North Carolina at Charlotte. I received my Ph.D. at the New Jersey Institute of Technology (NJIT) under the supervision of Dr. Qing Liu. I obtained my Bachelor's Degree from Shandong University in 2015. I was a research intern at the Los Alamos National Laboratory from 2022 to 2023. I lead the High-Performance Data Intensive (HPDi) Lab and I am also affiliated with the High Performance Computing and Systems lab at UNC-Charlotte. My research focuses on High-performance Computing and Scientific Data Management. I have contributed to over 10 papers in top conferences and journals, including ICDE, IPDPS, IEEE TPDS, and IEEE TC.Research InterestData reduction and compressionScientific Data ManagementParallel and Distributed SystemsEducationPh.D. in Electrical EngineeringNew Jersey Institute of Technology, Jan 2018 - Aug 2023M.S. in Electrical EngineeringNew Jersey Institute of Technology, Sep 2015 - May 2017B.S. in Internet of ThingsShandong University, Sep 2011 - May 2015TeachingITCS 6145/8145: Parallel Computing [UNCC, F2024, S2025]CISC.3310: Principles of Computer Architecture [BC@CUNY, S2024]CISC.1050: Introduction to Computer Applications [BC@CUNY, F2023, S2024]ECE-394: Digital Systems Laboratory [NJIT, F2018, S2019]Professional ServicePanelistNSF Panel 2024DOE Panel 2024OrganizerNRDPISI 2024, 2025Journal reviewerThe Journal of SupercomputingIEEE Internet of Things JournalIEEE Transactions on Smart GridJournal of Parallel and Distributed ComputingConference reviewerSIAM International Conference on Data Mining 2024IEEE International Conference on Data Engineering 2022, 2023, 2024IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing 2024International Conference in Parallel Processing 2024 (Poster)Report abusePage detailsPage updated Report abuse",
  "content_length": 2111,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:14"
}