{
  "name": "Jiri Friml",
  "homepage": "https://ist.ac.at/research/research-groups/friml-group",
  "status": "success",
  "content": "ISTA | Friml Group HomeResearchFriml Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Friml Group Developmental and Cell Biology of Plants When conditions get tough, animals typically fight or flee, but plants are rooted in their environment, and, as a result, have become remarkably adaptable. The Friml group investigates the mechanisms underlying plants’ adaptability during embryonic and postembryonic development. Plants and animals have different life strategies. Plants are highly adaptive, and able to modify development and physiology to environmental changes; they can easily regulate growth, initiate new organs or regenerate tissues. Many of these developmental events are mediated by the plant hormone auxin. The Friml group investigates the unique properties of auxin signaling, which can integrate both environmental and endogenous signals. Employing methods spanning molecular physiology, developmental and cell biology, genetics, biochemistry, and mathematical modeling, the group focuses on auxin transport, cell polarity, endocytic recycling, as well as non-transcriptional mechanisms of signaling. In their work, the Friml group gains insights into the mechanisms governing plant development, and have shown how signals from the environment are integrated into plant signaling and result in changes to plant growth and development. Group Leader Jiří Friml Professor +43 2243 9000 5401 jiri.friml@ist.ac.at Administrative Support Alexandra Mally Assistant to Professors +43 2243 9000 1105 Alexandra.Mally@ist.ac.at Team Haiyue Ai Postdoc Haiyue.Ai@ist.ac.at Shubhajit Das Postdoc Shubhajit.Das@ist.ac.at Lukas Fiedler PhD Student Lukas.Fiedler@ist.ac.at Zengxiang Ge Postdoc Zengxiang.Ge@ist.ac.at Bin Guan Postdoc Bin.Guan@ist.ac.at Mengting Lu PhD Student Mengting.Lu@ist.ac.at Yuanrong Pei Postdoc Yuanrong.Pei@ist.ac.at Marek Randuch PhD Student Marek.Randuch@ist.ac.at Adrijana Smoljan PhD Student adrijana.smoljan@ist.ac.at Anastasiia Teplova PhD Student anastasia.teplova@ist.ac.at Dmitrii Vladimirtsev PhD Student Dmitrii.Vladimirtsev@ist.ac.at Huawei Zhai Postdoc Huawei.Zhai@ist.ac.at Zhongqin Zhang PhD Student Zhongqin.Zhang@ist.ac.at Minxia Zou Postdoc Minxia.Zou@ist.ac.at Milan Zupunski Postdoc Milan.Zupunski@ist.ac.at Current Projects Auxin signaling | Second messengers in plant signaling | Auxin transport | Cell polarity and polar targeting | Endocytosis and recycling Publications Glanc M, Van Gelderen K, Hörmayer L, Tan S, Naramoto S, Zhang X, Domjan D, Vcelarova L, Hauschild R, Johnson AJ, de Koning E, van Dop M, Rademacher E, Janson S, Wei X, Molnar G, Fendrych M, De Rybel B, Offringa R, Friml J. 2021. AGC kinases and MAB4/MEL proteins maintain PIN polarity by limiting lateral diffusion in plant cells. Current Biology. 31(9), 1918–1930. View Hajny J, Prat T, Rydza N, Rodriguez Solovey L, Tan S, Verstraeten I, Domjan D, Mazur E, Smakowska-Luzan E, Smet W, Mor E, Nolf J, Yang B, Grunewald W, Molnar G, Belkhadir Y, De Rybel B, Friml J. 2020. Receptor kinase module targets PIN-dependent auxin transport during canalization. Science. 370(6516), 550–557. View Hörmayer L, Montesinos López JC, Marhavá P, Benková E, Yoshida S, Friml J. 2020. Wounding-induced changes in cellular pressure and localized auxin signalling spatially coordinate restorative divisions in roots. Proceedings of the National Academy of Sciences of the United States of America. 117(26), 202003346. View Narasimhan M, Johnson AJ, Prizak R, Kaufmann W, Tan S, Casillas Perez BE, Friml J. 2020. Evolutionarily unique mechanistic framework of clathrin-mediated endocytosis in plants. eLife. 9, e52067. View Skokan R, Medvecká E, Viaene T, Vosolsobě S, Zwiewka M, Müller K, Skůpa P, Karady M, Zhang Y, Janacek DP, Hammes UZ, Ljung K, Nodzyński T, Petrášek J, Friml J. 2019. PIN-driven auxin transport emerged early in streptophyte evolution. Nature Plants. 5(11), 1114–1119. View View All Publications ReX-Link: Jirí Friml Career Since 2013 Professor, Institute of Science and Technology Austria (ISTA)2007 – 2012 Full Professor, University of Ghent, Belgium2006 Full Professor, University of Göttingen, Germany2002 – 2005 Group Leader, Habilitation, University of Tübingen, Germany2002 PhD, Masaryk University, Brno, Czech Republic2000 PhD, University of Cologne, Germany Selected Distinctions 2024 Wittgenstein Award2024 ERC Advanced Grant2019 Neuron Award for Contribution to Science, Czech Republic2017 ERC Advanced Grant2016 Charles Albert Shull Award, ASPB2015 Selected to 2015 World’s Most Influential Scientific Minds2015 Erwin Schrödinger Prize, Austrian Academy of Science (ÖAW)2014 Běhounek Prize, Czech Ministry of Education2012 EMBO Gold Medal 2011 Elected Elected Fellow of the American Association for the Advancement of Science (AAAS)2010 Member, EMBO2010 Körber European Science Award2010 Olchemim Scientific Award2005 Heinz Maier-Leibnitz Prize2004 EMBO Young Investigator Award2000 Max Planck Society Award: The Otto Hahn Medal Additional Information CV Jiří FrimlERC grant Jiří Friml PSDPERC Advanced Grant Jiří Friml ETAPFWF Stand-alone Project MethylationFWF International Project Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 7561,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:19"
}