{
  "name": "Jiri Matas",
  "homepage": "http://cmp.felk.cvut.cz/~matas",
  "status": "success",
  "content": "Jiri Matas Jiri MATAS My old home page at U. of Surrey Professor The Center for Machine Perception Department of Cybernetics Faculty of Electrical Engineering Czech Technical University, Prague Karlovo namesti 13, 121 35 Praha 2, Czech Republic Office: G1 (building G, room 1), see map Tel.: +420-603-140180, Fax:+420-2-24357385 E-mail: surname@fel.cvut.cz ORCID: 0000-0003-0863-4844 CV: Publications. Demos: (mostly outdated) Awards Students Teaching: Pattern Recognition, Digital Image Processing, Computer Vision Methods, Vision and Sports Summer School Service: Editor-in-Chief of IJCV, Associate Editor-in-Chief of IEEE PAMI (2009-2013), Programme Chair ECCV'04, ECCV'16, CVPR'07, General Chair CVPR'22, ECCV'22. Research: Visual recognition, Tracking, Image Retrieval, Sequential decision-making, Pattern recognition, Wide-baseline Matching, RANSAC, Face detection and recognition, Biometric authentication, Colour-based recognition, Hough Transform. Awards: 2022 Best paper award, @ BMVC, 33rd British Machine Vision Conference, A. Lukezic, Z. Trojer , J. Matas, M. Kristan Trans2k: Unlocking the Power of Deep Models for Transparent Object Tracking 2019 Honorable Mention for Outstanding Contribution Award, @ GCPR, 41st German Conf. on Pattern Recognition, R. Rozumnyi, J. Kotera, F. Sroubek J. Matas: Non-Causal Tracking by Deblatting 2017 Best paper award , 3rd International Workshop on Robust Reading @ Asian Conf. on Comp. Vision, M. Busta, Y. Patel, J. Matas: E2E-MLT: an Unconstrained End-to-End Method form Multi-Language Scene Text 2017 First place in the ICDAR Robust Reading Multi-language Task 2 - Script identification. Yash Patel, Michal Busta, Lukas Neumann and Jiri Matas 2017 Attila Kuba Prize: D. Barath, J. Matas, and L. Hajder: Multi-H: Efficient Recovery of Tangent Planes in Stereo Images 2015 Best Paper Prize at ICDAR, the 13th International Conference on Document Analysis and Recognition (Nancy, France): L. Neumann and Matas J.: Efficient Scene Text Localization and Recognition with Local Character Refinement 2013 Best Paper Prize at IVCNZ 2013: J. Pritts, O. Chum, J. Matas, Approximate Models for Fast and Accurate Epipolar Geometry Estimation 2013 Best Student Paper Prize at ICDAR, the 12th International Conference on Document Analysis and Recognition (Washington, USA): L. Neumann and Matas J.: On Combining Multiple Segmentations in Scene Text Recognition , presentation. 2013 Best Paper Prize at the Scandianavian Conference on Image Analysis SCIA : T. Vojir, J. Noskova and J. Matas.Robust Scale-Adaptive Mean-Shift for Tracking , presentation. 2011 Zdenek Kalal, a PhD student co-supervised by me and K. Mikolajczyk at the U. of Surrey, was awarded the ICT Pioneers Prize in the \"Technology Everywhere\" category for the TLD tracker developed during the PhD. 2010 My student Lukas Neumann won the Czech Master Thesis of Year 2010 in Informatics award. The work is summarized in our ACCV'10 paper A method for text localization and recognition in real-world images 2010 Outstanding Reviewer, CVPR 2010. 2009 My student (co-supervised with T. Svoboda) Karel Zimmermann was awarded the CSKI prize for the best PhD work in 2008 for his PhD thesis Fast Learnable Methods for Object Tracking. See the related PAMI paper . 2007 Best Paper Prize at Asian Conference on Computer Vision (ACCV). J. Sochman and J. Matas: Learning A Fast Emulator of a Binary Decision Process. 2006 My student S. Obdrzalek won the Doctorandus prize for the most innovative PhD work in the Czech Rep. 2005 Best paper prize at BMVC: J. Matas, S. Obdrzalek: Sub-linear Indexing for Large Scale Object Recognition. 2005 The CMP Team I advised of finished second in the ICCV 2005 Contest. 2004 Best scientific result prize of the Czech Technical University Prague. 2002 Best paper prize at BMVC: J. Matas et al.: Robust wide baseline stereo from maximally stable extremal regions. 1987 MSc thesis awarded the Chancellor's prize. Students: current: Radim Spetlik, Michal Neoral, Jonas Serych, , [Google Scholar], former: Yash Patel [Google Scholar], (PhD'23, thesis awarded the Dean's Prize), Dmytro Mishkin (PhD'21, thesis awarded the Rector's Prize and the Dean's Prize), Tomas Hodan (PhD'21, thesis awarded the Rector's Prize), Milan Sulc (PhD'21), Maksym Ivashechkin (MSc'21), Denys Rozumnyi (MSc'19), Tomas Vojir (PhD'18), Lukas Neumann (MSc'10, PhD'17), Andrej Mikulik (MSc'09, PhD'15), Michal Perdoch (MSc'04, PhD'11), Zdenek Kalal (MSc'05, PhD'11), Lukas Zich (MSc), Jura Trefny (MSc), Jan Sochman (Phd'09), Karel Zimmermann(PhD'08,MSc'04), Stepan Obdrzalek (PhD'07), Ondra Chum (PhD'05), Mirek Hamouz (PhD'05), Kenneth Jonsonn (PhD'02), Ulises Ramos Sanchez (PhD'01), Yongping Li (PhD'01) Publications: @ DBLP @ Google Scholar @ Arnetminer @ MS Academic Bibliometrics: H-index: 71 (WoS) H-index: 101 (Google Scholar) Citations: ~36000 (WoS) Citations: ~79000 (Google Scholar) 2018 2017 2016 till 2015 Selected: (recent work is best found on arXiv) Serych, J. and Matas, J. Visual Coin-Tracking: Tracking of Planar Double-Sided Objects In GCPR 2019 Kart U, Lukezic A, Kristan M, Kamarainen JK, Matas J. Object Tracking by Reconstruction with View-Specific Discriminative Correlation Filters. In CVPR 2019 Barath D, Matas J, Noskova J. MAGSAC: marginalizing sample consensus. In CVPR 2019 Qian Y, Kamarainen JK, Nikkanen J, Matas J. On Finding Gray Pixels. In CVPR 2019 D. Mishkin, F. Radenovic and J.Matas. Repeatability is not enough: Learning affine regions via discriminability. In ECCV 2018 Hodan T, et al. BOP: Benchmark for 6D object pose estimation In ECCV 2018 Barath D, Matas J. Multi-class model fitting by energy minimization and mode-seeking In ECCV 2018 Barath D, Matas J. Graph-cut RANSAC In CVPR 2018 Neoral M, Sochman J, Matas J Continual Occlusion and Optical Flow Estimation In ACCV 2018, (ArXiv:1811.01602v1 version) Busta M, Patel Y, Matas J. E2E-MLT-an unconstrained end-to-end method for multi-language scene text In ACCV 2018, (arXiv:1801.09919 version) Lukezic A, Cehovin-Zajc L, Vojir T, Matas J, Kristan M FuCoLoT -- A Fully-Correlational Long-Term Tracker In ACCV 2018, (arXiv:1711.09594v2 version) Mishchuk A, Mishkin D, Radenovic F, Matas J Working hard to know your neighbor's margins: Local descriptor learning loss In NIPS 2017, Sulc M, Matas J. Fine-grained recognition of plants from images. Plant methods. 2017 Dec;13(1):115 open access Smid, M and Matas, J Rolling Shutter Camera Synchronization with Sub-millisecond Accuracy. In VISIGRAPP (4: VISAPP) 2017, (arXiv:1902.11084 version) Hodan T, Haluza P, Obdrzalek S, Matas J, Lourakis M, Zabulis X. T-LESS: An RGB-D dataset for 6D pose estimation of texture-less objects In WACV 2017 (arXiv:1701.05498v1 version) Rozumnyi D, Kotera J, Sroubek F, Novotny L, Matas J. The world of fast moving objects In CVPR 2017 Lukezic A, Vojir T, Cehovin Zajc L, Matas J, Kristan M Discriminative correlation filter with channel and spatial reliability In CVPR 2017 Radenovic F, Schonberger JL , Ji D , Frahm JM , Chum O, Matas J From dusk till dawn: Modeling in the dark In CVPR 2016 D. Mishkin, M. Perdoch and J.Matas. MODS: Fast and Robust Method for Two-View Matching. Computer Vision and Image Understanding. 2015 Dec 1;141:81-93. L. Neumann and J. Matas Efficient Scene Text Localization and Recognition with Local Character Refinement In ICDAR, 2015, . Awarded the Best Paper Prize D. Mishkin, M. Perdoch, J.Matas and K. Lenc. WxBS: Wide Baseline Stereo Generalizations. Proc. of the British Machine Vision Conference 2015 L. Neumann and J. Matas On Combining Multiple Segmentations in Scene Text Recognition Proc. of 12th Intl. Conf. on Doc. Anal. and Recog. (ICDAR), 2013. , Awarded the Best Student Paper Prize H. Cai, T. Werner and J. Matas. Fast Detection of Multiple Textureless 3-D Objects. Proc. of the 9th Intl. Conf. on Computer Vision Systems (ICVS), 2013. T. Vojir, J. Noskova and J. Matas. Robust Scale-Adaptive Mean-Shift for Tracking Proc. Scandinavian Conf. on Image Analysis (SCIA), 2013. Awarded the Best Paper Prize Z. Kalal, K. Mikolajczyk and J. Matas. Tracking-Learning-Detection IEEE T. PAMI. 34(7): 1409-1422, July 2012 L. Neumann and Matas J. Real-time scene text localization and recognition In CVPR , 2012. . L. Ellis, N. Dowson, J. Matas, and R. Bowden. Linear regression and adaptive appearance models for fast simultaneous modelling and tracking. International Journal of Computer Vision (2011) 95:154-179 L. Neumann, J. Matas. A method for text localization and recognition in real-world images. In ACCV 2010. O. Chum, J. Matas. Planar Affine Rectification from Change of Scale. In ACCV 2010. A. Mikulik, M. Perdoch, O. Chum, J. Matas. Learning a Fine Vocabulary. In ECCV (3) 2010: 1-14 J. Cech, J. Matas, M. Perdoch. Efficient Sequential Correspondence Selection by Cosegmentation. IEEE T. PAMI. 32(9): 1568-1581, September 2010 [data and code] O. Chum and J. Matas. Unsupervised discovery of co-occurrence in sparse high dimensional data. In CVPR 2010 H. Grabner, J. Matas, L. van Gool, and P. Cattin. Tracking the invisible: Learning where the object might be. In CVPR 2010 Zdenek Kalal, Jiri Matas, and Krystian Mikolajczyk. P-n learning: Bootstrapping binary classifiers by structural constraints. In CVPR 2010 O. Chum, J. Matas. Large-Scale Discovery of Spatially Related Images. IEEE Trans. Pattern Analalysis and Mach. Intell. 32(2): 371-377, February 2010 J. Sochman, J. Matas. Learning Fast Emulators of Binary Decision Processes. International Journal of Computer Vision 83(2): 149-163, June 2009 K. Zimmermann, J. Matas, and T. Svoboda. Tracking by an optimal sequence of linear predictors. IEEE Transactions on Pattern Analysis and Machine Intelligence, 31(4):677-692, April 2009. O. Chum, M. Perdoch, J. Matas. Geometric min-Hashing: Finding a (thick) needle in a haystack. CVPR 2009: 17-24 O. Chum and J. Matas. Optimal randomized RANSAC. IEEE Transactions on Pattern Analysis and Machine Intelligence, 30(8):1472-1482, August 2008. J. Sochman and J. Matas",
  "content_length": 13890,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:19"
}