{
  "name": "Jiri Bittner",
  "homepage": "https://dcgi.fel.cvut.cz/people/bittner",
  "status": "success",
  "content": "Jiří Bittner | DCGI prof. Ing. Jiří Bittner Ph.D. Zástupce vedoucího pro výzkum CG e-mailbittner@fel.cvut.cz telefon+420-22435-7658 Rozvrh Web Všechny publikace Praha 2, Karlovo náměstí 13, KN:E‑421 Předměty Publikace Závěrečné práce Výzkumné projekty Předměty Počítačové hry Algoritmy počítačové grafiky Publikace SAH-Optimized k-DOP Hierarchies for Ray Tracing Martin Káčerik Jiří Bittner Proceedings of the ACM on Computer Graphics and Interactive Techniques (Proceedings of HPG 2024) 7(3):32, 2024 PVLI: Potentially Visible Layered Image for Real-time Ray Tracing Jaroslav Kravec Martin Káčerik Jiří Bittner The Visual Computer 39(8):3359-3372, 2023 QuadStack: An Efficient Representation and Direct Rendering of Layered Datasets Alejandro Graciano Antonio J. Rueda Adam Pospíšil Jiří Bittner Bedřich Beneš IEEE Transactions on Visualization and Computer Graphics 27(9):3733-3744, 2021 Spatio-temporal BRDF: Modeling and Synthesis Daniel Meister Adam Pospíšil Imari Sato Jiří Bittner Computers & Graphics 97(1):279-291, 2021 Ray Classification for Accelerated BVH Traversal Jakub Hendrich Adam Pospíšil Daniel Meister Jiří Bittner Computer Graphics Forum (Proceedings of EGSR 2019) 38(4):49-56, 2019 Real-time External Labeling of Ghosted Views Ladislav Čmolík Jiří Bittner IEEE Transactions on Visualization and Computer Graphics 25(7):2458-2470, 2019 Parallel Locally-Ordered Clustering for Bounding Volume Hierarchy Construction Daniel Meister Jiří Bittner IEEE Transactions on Visualization and Computer Graphics 24(3):1345-1353, 2018 Parallel Reinsertion for Bounding Volume Hierarchy Optimization Daniel Meister Jiří Bittner Computer Graphics Forum (Proceedings of Eurographics 2018) 37(2):463-473, 2018 Lightdrum—Portable Light Stage for Accurate BTF Measurement on Site Vlastimil Havran Jan Hošek Šárka Němcová Jiří Čáp Jiří Bittner Sensors 17(3):423, 2017 Parallel BVH Construction using Progressive Hierarchical Refinement Jakub Hendrich Daniel Meister Jiří Bittner Computer Graphics Forum (Proceedings of Eurographics 2017) 36(2):487-494, 2017 Parallel BVH Construction using K-Means Clustering Daniel Meister Jiří Bittner The Visual Computer (Proceedings of CGI 2016) 32(6):977-987, 2016 Parallel On-Demand Hierarchy Construction on Contemporary GPUs Marek Vinkler Vlastimil Havran Jiří Bittner Jiří Sochor IEEE Transactions on Visualization and Computer Graphics 22(7):1886-1898, 2016 CHC+RT: Coherent Hierarchical Culling for Ray Tracing Oliver Mattausch Jiří Bittner Alberto Jaspe Villanueva Enrico Gobbetti Michael Wimmer Renato Pajarola Computer Graphics Forum (Proceedings of Eurographics 2015) 34(2):537-548, 2015 Incremental BVH Construction for Ray Tracing Jiří Bittner Michal Hapala Vlastimil Havran Computers & Graphics 47(1):135-144, 2015 T-SAH: Animation Optimized Bounding Volume Hierarchies Jiří Bittner Daniel Meister Computer Graphics Forum (Proceedings of Eurographics 2015) 34(2):527-536, 2015 Fast Insertion-Based Optimization of Bounding Volume Hierarchies Jiří Bittner Michal Hapala Vlastimil Havran Computer Graphics Forum 32(1):85-100, 2013 Massively Parallel Hierarchical Scene Processing with Applications in Rendering Marek Vinkler Jiří Bittner Vlastimil Havran Michal Hapala Computer Graphics Forum 32(8):13-25, 2013 Temporally Coherent Adaptive Sampling for Imperfect Shadow Maps Tomáš Barák Jiří Bittner Vlastimil Havran Computer Graphics Forum (Proceedings of EGSR 2013) 32(4):87-96, 2013 Shadow Caster Culling for Efficient Shadow Mapping Jiří Bittner Oliver Mattausch Ari Silvennoinen Michael Wimmer Proceedings of ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, pp. 81-88, 2011 Layout-aware optimization for interactive labeling of 3D models Ladislav Čmolík Jiří Bittner Computers & Graphics 34(4):378-387, 2010 Adaptive Global Visibility Sampling Jiří Bittner Oliver Mattausch Peter Wonka Vlastimil Havran Michael Wimmer ACM Transactions on Graphics (Proceedings of SIGGRAPH 2009) 28(3):94, 2009 Game Engine Friendly Occlusion Culling Jiří Bittner Oliver Mattausch Michael Wimmer RDH: Ray Distribution Heuristics for Construction of Spatial Data Structures Jiří Bittner Vlastimil Havran Proceedings of Spring Conference on Computer Graphics, pp. 51-57, 2009 CHC++ – Coherent Hierarchical Culling Revisited Oliver Mattausch Jiří Bittner Michael Wimmer Computer Graphics Forum (Proceedings of Eurographics 2008) 27(2):221-230, 2008 Visibility-driven Mesh Analysis and Visualization through Graph Cuts Kaichi Zhou Eugene Zhang Jiří Bittner Peter Wonka IEEE Transactions on Visualization and Computer Graphics (Proceedings of IEEE Visualization 2008) 14(6):1667-1674, 2008 Optimized Subdivisions for Preprocessed Visibility Oliver Mattausch Jiří Bittner Peter Wonka Michael Wimmer Proceedings of Graphics Interface, pp. 335-342, 2007 Ray Tracing with Sparse Boxes Vlastimil Havran Jiří Bittner Proceedings of Spring Conference on Computer Graphics, pp. 49-54, 2007 Adaptive Visibility-Driven View Cell Construction Oliver Mattausch Jiří Bittner Michael Wimmer Proceedings of Eurographics Symposium on Rendering, pp. 195-205, 2006 Závěrečné práce Virtuální stínové mapy Matěj Sakmary Diplomová práce 2025 V této práci prezentuji Virtuální Stínové Mapy (VSMs), metodu pro vykreslování stínových map s výrazně lepší kvalitou a paměťovou efektivitou v porovnaní se současnými metodami. Metoda odděluje logický... Výpočet přímého a nepřímého osvětlení v Unreal Engine Ondřej Maceška Bakalářská práce 2025 V této bakalářské práci se věnuji analýze technologie Lumen. Jedná se o nový osvětlovací systém v Unreal Engine 5, který využívá inovativních konceptů pro výpočet globálního osvětlení a přesných zrcadlových... Interaktivní editor bloků silniční sítě Adam Pončák Diplomová práce 2025 Tato diplomová práce se zabývá potřebou interaktivního nástroje pro tvorbu a úpravu bloků silničních sítí ve virtuálním prostředí, konkrétně v rámci systému Virtual Reality Universal Toolkit (VRUT). Vyvinutý... Široké hierarchie obalových těles pro metody sledování paprsků Lukáš Cezner Diplomová práce 2025 Sledování paprsků, jako technika pro generování fotorealistických obrazů, se široce používá při offline vykreslování a stále více se prosazuje v aplikacích pracujících v reálném čase. Moderní nástroje... Modelování skupinového chování pro videohry Vojtěch Nápravník Bakalářská práce 2025 Nehráčské postavy (NPC) jsou důležité pro vytvoření pohlcujícího herního zážitku tím, že simulují svět, který je neustále živý i když hráč zrovná není aktivní. Dosažení tohoto cíle často zahrnuje implementaci... Zobrazování 3D Gaussiánů pomocí sledování paprsku Matěj Gargula Diplomová práce 2025 Techniky vykreslování zaznamenaly v posledních desetiletích významný pokrok, přechází od tradiční rastrizace k sofistikovaným objemovým reprezentacím. Mezi nimi se vynořila slibná metoda 3D Gaussian Splatting... Navádění světelných cest podle ohnisek Petr Šádek Diplomová práce 2025 Hlavním cílem této práce je reimplementace algoritmu navádění světelných cest podle ohnisek v real-time renderovacím frameworku Falcor od NVIDIA. Začneme úvodem do problematiky vrhání paprsků. Poté se... Zobrazování nočních měst Tereza Hlavová Diplomová práce 2025 V poslední době je možné častěji virtuálně zkoumat reálné lokace kvůli pokroku a širšímu využití metod 3D rekonstrukce. Dokonce v některých případech jsou k dispozici modely celých měst. Pro účely ať... Procedurální generování obsahu v Unreal Enginu Lukáš Jůza Bakalářská práce 2025 Tato práce představuje soudržný systém pro nekonečnou generaci světů za běhu v Unreal Engine 5.5. Předkládáme vícevláknový C++ generátor terénu založený na vlastních šumových funkcích, který dokáže plynule... Interaktivní detekce místnosti Martin Němec Diplomová práce 2024 Cílem této práce je implementace 2D algoritmu pro detekci místností a vytvoření rozdělení na Buňky a Portály pomocí algoritmu Breaking the Walls. Vstupem jsou samostatné stěny definované jako úsečky,... Využití těsných obálek pro hierarchie obalových těles Lucie Veverková Diplomová práce 2024 Tato práce se zabývá metodami stavby hierarchie obálek (BVH), které jsou využitelné v algoritmech sledování paprsku. Soustředí se na techniky aplikovatelné pro interaktivní aplikace pracující s dynamickými... Efektivní vzorkování pro výpočet komplexního osvětlení v reálném čase Karel Tomanec Diplomová práce 2023 Tato práce se zabývá pokročilými technikami pro výpočet komplexního přímého a nepřímého osvětlení v reálném čase se zaměřením na metodu ReSTIR (Reservoir-based SpatioTemporal Importance Resampling). Součástí... Implementace zobracovacího řetězce pomocí GPGPU technik Jakub Profota Bakalářská práce 2023 Tato bakalářská práce implementuje jednoduchý zobrazovací řetězec pomocí technik obecných výpočtů na moderních grafických procesorech. Implementace v technologii CUDA se soustředí na efektivní paralelní... Knihovna materiálů v unity Fedor Timushev Bakalářská práce 2023 Tento projekt se zabýval a popsal problematiku modelování vzhledu materiálů s důrazem na fyzikálně založené modely. Dotýká se také témat tvorby materiálů pomocí shader grafů, pomocí nichž byly vytvořeny... Procedurální generování venkovních scén Ondřej Kyzr Bakalářská práce 2023 Tato bakalářská práce popisuje implementaci snadno použitelného nástroje pro herní engine Unity, který dokáže procedurálně generovat venkovní scény. Nástroj je rozdělen na jednotlivé generátory, aby si... Využití herního enginu pro vytváření a sdílení poznámek Ivan Oryshchenko Bakalářská práce 2023 Tato diplomová práce se zabývá návrhem a vývojem aplikace pro psaní poznámek, která kombinuje efektivní techniky výuky, gamifikuje proces studia a umožňuje uživatelům volně prozkoumávat poznámky ostatních.... Simulace herní umělé inteligence Matěj Gargula Bakalářská práce 2023 Téměř každá dnešní hra obsahuje nějaký druh simulace umělé inteligence. Jednou z nejpoužívanějších je simulace umělé inteligence nehráčských postav. Tyto simulace jsou o vytváření algoritmů, díky nimž... Dynamické difuzn",
  "content_length": 20438,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:19"
}