{
  "name": "Jirí Fiala 0001",
  "homepage": "https://kam.mff.cuni.cz/~fiala",
  "status": "success",
  "content": "Jiri Fiala (english page) Czech version HOMONOLO Jiří Fiala Contact Office address: Department of Applied Mathematics (KAM) Faculty of Mathematics and Physics, Charles University, Malostranské nám. 25 Praha 1, 118 00 Czech Republic Email address: fialakam.mff.cuni.cz Phone: +420 - 951 554 322 Photo by xax Teaching winter term 2025-2026 No teaching in English this term. Office hours are on Wednesday 10:30 till 11:30 AM in my office at Impakt. I recommend to negotiate an appointment in advance, eg by email. Without an appointment I may not be present or I may attend to other students. See also my class schedule. Personal information Education: 1991 - 1997, Charles University - graduated at Master degree (Mgr.) in 1997 1997 - 2000, Charles University - graduated at Doctor degree (PhD.) in 2000 Prsent occupation since 2008, associate professor at Charles University, Prague, Czech Republic Past occupation 2000 - 2008, research and teaching assistant at Charles University, Prague, Czech Republic 2000 - 2001, postdoc at University of Kiel, Germany 2001 - 2002, postdoc at University of Bergen, Norway 2012 - 2013, Fulbright fellow at University of Oregon, Eugene, U.S.A. Research interests Graph algorithms and their complexity Restricted graph classes - bounded width, topological restrictions, geometric intersection graphs Algebraic graph theory - homomorphisms and covering projections Graph coloring and distance labeling Hamiltonian properties Theses Structure and Complexity of Locally Constrained Graph Homomorphisms, Habilitation Thesis, Charles University, 2007 (BibTeX) Locally injective homomorphisms, Doctoral Thesis, Charles University, 2000 (BibTeX) Pokrývání grafů (Graph covers), Master Thesis, Charles University, 1996 (in czech, recompiled from the source so page/line breaks may differ from the original) (BibTeX) List of publications Full list of publications (2023). Majority of my papers (including bibliographic information) is available via DBLP Bibliography Server. For citation reports see my records at ResearcherID: I-5123-2016 ORCID ID: 0000-0002-8108-567X Scopus Author ID: 35580076200 Google Scholar Below are my papers that are not available via DBLP: The Subchromatic Index of Graphs, with Van Bang Le Tatra Mountain Mathematical Publications, 36 (2007), pp. 129-146. (BibTeX) © Tatra Mountain Mathematical Publications Note on the computational complexity of covering regular graphs, 9th Annual Conference of Doctoral Students, WDS'00, (2000), pp. 89-90. (BibTeX) Lecture notes Graph minors, decompositions and algorithms, gradually updated version, published formerly as ITI Series 2003-132 Course instructors, write me for a version with all solutions. (If some images aren't displayed properly, use the Adobe Reader, rather than a browser plugin.)",
  "content_length": 2794,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:18"
}