{
  "name": "Jirí Srba",
  "homepage": "http://people.cs.aau.dk/~srba",
  "status": "success",
  "content": "Jiri Srba - Professor at Aalborg University Jiri SrbaProfessor at Aalborg University Jiri Srba I am employed as professor at Department of Computer Science at Aalborg University, Denmark. The main area of my interest is within concurrency theory, in particular: software verification with particular focus on quantitative systems, model checking of (timed-arc) Petri nets and timed automata process algebra, modal transition systems, weighted automata decidability and complexity issues for various classes of infinite state systems, and applying formal methods for verification and synthesis of computer networks. Links: List of publications. Given talks. Curriculum vitae. Roadmap of infinite results. Book: Reactive Systems: Modelling, Specification and Verification. NetVAS - Network Verification and Automation, Bertinoro Seminar, 2022 Tools: TAPAAL Tool - Verification of Timed-Arc Petri Nets AalWiNes - Network Verification Suite CAAL - Concurrency Workbench, Aalborg Edition WKTool - Model Checking of Weighted Systems Events where I am a PC member: ACM SIGMETRICS'26 TACAS'26 Petri Nets'25 QEST-FORMATS'24 RAMiCS'24 LPAR'24 FORMATS'23 SPIN'23 NWPT'22 ATVA'22 FMICS'22 FOSSACS'22 NWPT'21 SPIN'21 FORMATS'20 LATA'20 and '21 NWPT'19 FMi'19 FORMATS'19 CONCUR'19 SPIN'19 NWPT'18 FMi'18 HIGHLIGHTS'18 FORMATS'18 MOVEP'18 ICALP'18 FOSSACS'18 LATA'18 NWPT'17 FMi'17 FORMATS'17 QAPL'17 SOFSEM'17 NWPT'16 RP'16 FORMATS'16 MOVEP'16 CASSTING'16 SynCoP'16 FMi'16 MEMICS'15 FMi'15 CONCUR'15 SynCoP'15 ICTAC'15 MEMICS'14 ICALP'14 CompSysTech'14 INFINITY'13 YR-CONCUR'12 EXPRESS'12 FORMATS'12 YR-CONCUR'11 MEMICS'11 FORMATS'11 EXPRESS'11 SOFSEM'11 CompSysTech'11 MEMICS'10 YR-CONCUR'10 CompSysTech'10 EPEW'10 FORMATS'09 CompSysTech'09 TiSto'09 MEMICS'09 SOFSEM'09 INFINITY'08 MEMICS'08 INFINITY'07 MEMICS'07 INFINITY'05 Jiri Srba University of Aalborg Department of Computer Science Selma Lagerlofs Vej 300 9220 Aalborg East Denmark Office: 1.2.32 Phone: +45 99 40 98 51 Fax : +45 99 40 97 98 Mobil: +45 20 45 35 14 Email: srba@cs.aau.dk Last modified: 2013-08-14 by Jiri Srba.            Back to my homepage",
  "content_length": 2101,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:22"
}