{
  "name": "Jirí Zára",
  "homepage": "https://dcgi.fel.cvut.cz/people/zara",
  "status": "success",
  "content": "Jiří Žára | DCGI prof. Ing. Jiří Žára CSc. Vedoucí katedry e-mailzara@fel.cvut.cz telefon+420-22435-7311 Rozvrh Web Všechny publikace Praha 2, Karlovo náměstí 13, KN:E‑320 Předměty Publikace Závěrečné práce Výzkumné projekty Předměty Algoritmy počítačové grafiky Publikace Distinctive Approaches to Computer Graphics Education Beatriz Sousa Santos Jean-Michel Dischler Valery Adzhiev Eike Falk Anderson Andrej Ferko Oleg Fryazinov Martin Ilčík Ivana Ilčíková Pavel Slavík Veronica Sundstedt Lucie Svobodová Michael Wimmer Jiří Žára Computer Graphics Forum 37(1):403-412, 2018 Stateless generation of distributed virtual worlds Jiří Danihelka Lukáš Kencl Jiří Žára Computers & Graphics 44(1):33-44, 2014 Geometric Skinning with Approximate Dual Quaternion Blending Ladislav Kavan Steven Collins Jiří Žára Carol O'Sullivan ACM Transactions on Graphics 27(4):105, 2008 Polypostors: 2D Polygonal Impostors for 3D Crowds Ladislav Kavan Simon Dobbyn Steven Collins Jiří Žára Carol O'Sullivan Proceedings of ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, pp. 149-155, 2008 Skinning Arbitrary Deformations Ladislav Kavan Rachel McDonnell Simon Dobbyn Jiří Žára Carol O'Sullivan Proceedings of ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, pp. 53-60, 2007 Skinning with Dual Quaternions Ladislav Kavan Steven Collins Jiří Žára Carol O'Sullivan Proceedings of ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, pp. 39-46, 2007 Efficient Collision Detection for Spherical Blend Skinning Ladislav Kavan Carol O'Sullivan Jiří Žára Proceedings of International Conference on Computer Graphics and Interactive Techniques in Australasia and South-East Asia, pp. 147-156, 2006 Fast Approximation to Spherical Harmonic Rotation Jaroslav Křivánek Jaakko Konttinen Sumanta Pattanaik Kadi Bouatouch Jiří Žára Proceedings of Spring Conference on Computer Graphics, pp. 51-58, 2006 Making Radiance and Irradiance Caching Practical: Adaptive Caching and Neighbor Clamping Jaroslav Křivánek Kadi Bouatouch Sumanta Pattanaik Jiří Žára Proceedings of Eurographics Symposium on Rendering, pp. 127-138, 2006 Virtual Reality Course – A Natural Enrichment of Computer Graphics Classes Jiří Žára Computer Graphics Forum 25(1):105-112, 2006 Web-Based Historical City Walks: Advances and Bottlenecks Jiří Žára PRESENCE: Teleoperators and Virtual Environments 15(3):262-277, 2006 Colorization of Black-and-White Cartoons Daniel Sýkora Jan Buriánek Jiří Žára Image and Vision Computing 23(9):767-782, 2005 Fast Collision Detection for Skeletally Deformable Models Ladislav Kavan Jiří Žára Computer Graphics Forum (Proceedings of Eurographics 2005) 24(3):363-372, 2005 Sketching Cartoons by Example Daniel Sýkora Jan Buriánek Jiří Žára Proceedings of Eurographics Workshop on Sketch-Based Interfaces and Modeling, pp. 27-34, 2005 Spherical Blend Skinning: A Real-time Deformation of Articulated Models Ladislav Kavan Jiří Žára Proceedings of ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games, pp. 9-16, 2005 Video Codec for Classical Cartoon Animations with Hardware Accelerated Playback Daniel Sýkora Jan Buriánek Jiří Žára Advances in Visual Computing (Proceedings of ISVC 2005) 1(43):50, 2005 Adaptive Mesh Subdivision for Precomputed Radiance Transfer Jaroslav Křivánek Sumanta Pattanaik Jiří Žára Proceedings of Spring Conference on Computer Graphics, pp. 104-109, 2004 Unsupervised Colorization of Black-and-White Cartoons Daniel Sýkora Jan Buriánek Jiří Žára Proceedings of International Symposium on Non-Photorealistic Animation and Rendering, pp. 121-128, 2004 Virtual Reality and Cultural Heritage on the Web Jiří Žára Proceedings of International Conference Computer Graphics and Artificial Inteligence, pp. 101-112, 2004 Fast Depth of Field Rendering with Surface Splatting Jaroslav Křivánek Jiří Žára Kadi Bouatouch Proceedings of Computer Graphics International, pp. 196-201, 2003 Real Time Skin Deformation with Bones Blending Ladislav Kavan Jiří Žára Proceedings of Winter School of Computer Graphics, pp. 69-74, 2003 Segmentation of Black-and-White Cartoons Daniel Sýkora Jan Buriánek Jiří Žára Proceedings of Spring Conference on Computer Graphics, pp. 223-230, 2003 Závěrečné práce Úniková hra s rozšířenou realitou Peter Vataščin Bakalářská práce 2024 V této bakalářské práci je popsán postup vytváření únikové hry pro více hráčů v rozšířené realitě. Nejprve jsou porovnány podobné existující hry. Dále jsou analyzovány vývojářské nástroje pro tvorbu her... Interaktivní model tokamaku Golem Ondřej Pluhař Bakalářská práce 2011 Tokamak Golem je unikátní zařízení, které se nachází na Českém vysokém učení technickém v Praze, konkrétně na Fakultě jaderné a fyzikálně inženýrské. Hlavní zaměření této práce je na vytvoření interaktivního... Virtuální galerie v kostele Sv. Petra a Pavla u Líšné Daniel Šrám Bakalářská práce 2010 Tato bakalářská práce se zabývá návrhem a realizací virtuální galerie pro návštěvníky kostela Sv. Petra a Pavla u Líšné na Zbirožšku. Práce se skládá ze dvou částí, virtuálního modelu kostela, spolu s... Model zámeckého parku ve Vlašimi Jan Zimandl Bakalářská práce 2009 Tato bakalářská práce se zabývá tvorbou virtuální prohlídky zámeckého parku ve Vlašimi ve VRML a její začlenění do webové stránky. Text se věnuje převážně způsobu modelování jednoduchých 3D modelů, které... Výzkumné projekty Výzkumné centrum informatiky (RCI) Jiří Žára Jiří Bittner Vlastimil Havran Daniel Sýkora Miroslav Macík RCI je centrem vědecké excelence v informatice a umělé inteligenci, které posiluje a integruje mezinárodně konkurenceschopný výzkum prováděný na ČVUT. Cílem RCI je podporovat spolupráci mezi odborníky... Virtuální digitální šatník Jiří Žára David Sedláček Ivo Malý Cílem projektu je navrhnout postup pokročilé digitalizace a prezentace textilních předmětů a ověřit tuto metodu na předmětech ze sbírky Muzea hlavního města Prahy. Výsledky budou zahrnovat prototyp zařízení... Langweilův model Prahy jako školní historický pramen Jiří Žára David Sedláček Ivo Malý Cílem projektu je podpořit spolupráci Muzea hlavního města Prahy a základních a středních škol z celé ČR prostřednictvím nově vytvořených interaktivních (digitálně vzdělávacích - DVZ) materiálů a navazujících... Centrum kompetence pro zpracování vizuálních informací (V3C) Jiří Žára Daniel Sýkora Zdeněk Míkovec Ladislav Čmolík Pavel Slavík Roman Berka Záměr projektu spočívá ve vytvoření Centra kompetence pro zpracování vizuálních informací (V3C – Visual Computing Competence Center) jako uskupení dvou významných výzkumných organizací a čtyř průmyslových... Virtualní srdce střední Evropy (VHCE) Jiří Žára Roman Berka Pavel Slavík Cílem tohoto projektu EU bylo digitálně zrekonstruovat vybrané významné objekty kulturního dědictví ve čtyřech evropských městech Praze, Bratislavě, Mariboru a Štýrském Hradci a uložit je pro budoucnost... Rozšířená realita ve školním prostředí (ARiSE) Jiří Žára Vlastimil Havran Daniel Sýkora Cílem projektu je integrovat výukovou platformu AR (ARTP) do každodenního prostředí učitelů a studentů. Zobrazení audiovizuálního a multimediálního obsahu v souladu s potřebami, které identifikovali odborníci... Centrum počítačové grafiky (CPG) Jiří Žára Jiří Bittner Ladislav Čmolík Cílem projektu je navrhnout optimální metody interakce ve virtuální realitě, algoritmy pro modelování, zobrazování a řešení dynamických problémů ve VR světech, vyvinout problémově orientované metody vizualizace...",
  "content_length": 7446,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:22"
}