{
  "name": "Jirí Sgall",
  "homepage": "https://iuuk.mff.cuni.cz/~sgall",
  "status": "success",
  "content": "Jiri Sgall Jiří Sgall I am a member of the Computer Science Institute of Charles University in Prague, which is a part of the Faculty of Mathematics and Physics. Currently I serve as its Vice-Dean for Computer Science. Up to 2011, I was affiliated with the Department of Applied Mathematics. Up to 2016, I was also affiliated with the Institute of Mathematics of the Academy of Sciences of the Czech Republic. Publications and research interests Surveys On-line and approximation algorithms, scheduling Complexity and combinatorics (including communication complexity, complexity of propositional proof systems, and circuit complexity) Other areas (combinatorial games, cryptography, DNA computations, alternative set theory) Teaching - výuka Seminar on Theory of Computing - Seminář z teoretické informatiky more (mostly in Czech) Scientific activities Editorial Associate Editor of Information and Computation (since 2017) Associate Editor of Operations Research Letters (since 2000) Associate Editor of Discrete Optimization (2010-2016) Field Editor of Discrete Mathematics & Theoretical Computer Science (2002-2015) Associate Editor of Algorithmica (2011-2013) Associate Editor of Journal of Scheduling (2003-2009) Proceedings of TTCS 2017, Springer LNCS 10608 Guest Editor of a special volume of  Information and Computation from MFCS 2013 Proceedings of MFCS 2013, Springer LNCS 8087 Guest Editor of a special volume of  Information and Computation from ICALP 2011 Proceedings of ICALP 2011, Springer LNCS 6755 and 6756 Proceedings of MAPSP 2011, ITI series 2011-525 Guest Editor of a special volume of Theoretical Computer Science from MFCS 2001 Proceedings of MFCS 2001, Springer LNCS 2136 Conference committee Organizing committee chair of ICALP 2018 Program committee chair of TTCS 2017 Program committee chair of MFCS 2013 Program committee chair of ICALP 2011 Program committee co-chair and organizing committee chair of MAPSP 2011 Program committee chair of MFCS 2001 Steering committee member of MFCS and MAPSP Program committee member: WAOA 2017, CALDAM 2017, EUROPAR 2016, WAOA 2015, Hightlights 2015, MFCS 2015, SPAA 2014, MATCOS 2013, COCOON 2013, WAOA 2012, CSR 2012, MFCS 2010, STACS 2010, ESA 2009, PPAM-SPC 2009, IFIP TCS 2008, SAGA 2007, ESCAPE 2007, APPROX 2006, ICALP 2006, AAIM 2006, MAPSP 2005, ICALP 2003, MAPSP 2003, ESA 2002, MFCS 2002,  MFCS 2000, STACS 1999, MFCS 1998. Organizing committee member: ESA 1999, Logic Colloquium 1998 Other Czech Science Foundation - computer science panel chair 2009-2011 EATCS council member 2001-2009, since 2017 My CV, also in Czech (usually slightly obsolete) Contact Information Mail: Computer Science Institute of Charles University Malostranské nám. 25 118 00 Praha 1 Czech Republic Room: 307 Phone: +420-951 554 293  (office) +420-951 554 245  (secretary) Email: last name at iuuk.mff.cuni.cz Last changed February 2018",
  "content_length": 2890,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:20"
}