{
  "name": "Jiwu Shu",
  "homepage": "http://storage.cs.tsinghua.edu.cn/~jiwu-shu",
  "status": "success",
  "content": "Home - Jiwu Shu Toggle navigation Storage Research Group Home Team Publications Research Join Us Wiki 中文 Jiwu Shu Professor, IEEE Fellow Storage Research Group Department of Computer Science and Technology Tsinghua University Room 1-506, Ziqiang Science and Technology Building, Tsinghua University, Beijing, China Email: shujw AT tsinghua dot edu dot cn Education Background Bachelor of Computer Science, National University of Defense Technology, Changsha, China, 1991; Master of Computer Science, Jiangsu University, Zhenjiang, China, 1996; Ph.D. in Computer Science, Nanjing University, Nanjing, 1998. Areas of research interests/research projects Network (/cloud/big data) storage systems; Nonvolatile memory systems and technologies; Reliability for storage systems; Parallel/distributed processing technology. Beijing Municipal Science and Technology Commission: Research on the architecture and optimization technology of big data processing software platform based onheterogeneous mixing memory system (2015-2016). National High Technology Research and Development Program of China: Advanced storage structure and the key technology for large data (2013-2015). State Key Program of National Natural Science of China: Network public storage reliability and disaster recovery technology (2013-2017). Branch project of National Ministry of Information Industry in China: Key technology and system cloud services for mobile communication business on cloud computing platform (2013-2015). The National Science and Technology Support Program: Storage virtualization software development and industrialization (2010-2013). National Science Foundation for Distinguished Young Scholars: Research on Key Techniques of Reliability in Large-Scale Network Storage Systems (2010-2013). National Natural Science Foundation of China: Research on Fault Tolerance in Large-Scale Network Storage Systems (2009-2011). National Basic Research Program of China (The 973 Program): Research on the Allocation-on-Demand Storage Model and Quality of Storage Service on the Next Generation Internet (2004-2009). National 863 High-Tech Program: Mass-Storage System Software and Key Techniques (2009-2010). Textbooks and Monographs Jiwu Shu, Data Storage Architectures and Technologies. Posts & Telecommunications Press, 2023 [Chinese Version] [English Version] Selected Publications Full publication lists Switch∆: Asynchronous Metadata Updating for Distributed Storage with In-Network Data Visibility. Junru Li, Qing Wang, Zhe Yang, Shuo Liu, Jiwu Shu, Youyou Lu, 42nd IEEE International Conference on Data Engineering (ICDE'26), 2026 PDF High-Throughput, Cost-Effective Billion-Scale Vector Search with a Single GPU. Haodi Jiang, Hao Guo, Minhui Xie, Jiwu Shu, Youyou Lu, ACM SIGMOD International Conference on Management of Data (SIGMOD'26), 2026 PDF Cost-efficient Archive Cloud Storage with Tape: Design and Deployment. Qing Wang, Fan Yang, Qiang Liu, Geng Xiao, Yongpeng Chen, Hao Lan, Leiming Chen, Bangzhu Chen, Chenrui Liu, Pingchang Bai, Bin Huang, Zigan Luo, Mingyu Xie, Yu Wang, Youyou Lu, Huatao Wu, Jiwu Shu, The 24th USENIX Conference on File and Storage Technologies (FAST'26), 2026 PDF Weaver: Efficient Multi-LLM Serving with Attention Offloading. Shiwei Gao, Qing Wang, Shaoxun Zeng, Youyou Lu, Jiwu Shu, USENIX Annual Technical Conference (USENIX ATC'25), 2025 PDF GPreempt: GPU Preemptive Scheduling Made General and Efficient. Ruwen Fan, Tingxu Ren, Minhui Xie, Shiwei Gao, Jiwu Shu, Youyou Lu, USENIX Annual Technical Conference (USENIX ATC'25), 2025 PDF Stripeless Data Placement for Erasure-Coded In-Memory Storage. Jian Gao, Jiwu Shu, Bin Yan, Yuhao Zhang, Keji Huang, The 19th USENIX Symposium on Operating Systems Design and Implementation (OSDI'25), 2025 PDF ShiftLock: Mitigate One-sided RDMA Lock Contention via Handover. Jian Gao, Qing Wang, Jiwu Shu, The 23rd USENIX Conference on File and Storage Technologies (FAST'25), 2025 PDF Achieving Wire-Latency Storage Systems by Exploiting Hardware ACKs. Qing Wang, Jiwu Shu, Jing Wang, Yuhao Zhang, The 22nd USENIX Symposium on Networked Systems Design and Implementation (NSDI'25), 2025 PDF Fast State Restoration in LLM Serving with HCache. Shiwei Gao, Youmin Chen, Jiwu Shu, The 20th European Conference on Computer Systems (EuroSys'25), 2025 PDF Deft: A Scalable Tree Index for Disaggregated Memory. Jing Wang, Qing Wang, Yuhao Zhang, Jiwu Shu, The 20th European Conference on Computer Systems (EuroSys'25), 2025 PDF Designing an Efficient Tree Index on Disaggregated Memory. Qing Wang, Youyou Lu, Jiwu Shu, Communications of the ACM (CACM), 2025 PDF Accelerating Distributed Filesystem Metadata Service via Decoupling Directory Semantics from Metadata Indexing. Wenhao Lv, Hao Guo, Qing Wang, Youyou Lu, Jiwu Shu, ACM Symposium on Cloud Computing (SoCC'25), 2025 PDF Ares-Flash: Efficient Parallel Integer Arithmetic Operations Using NAND Flash Memory. Jian Chen, Congming Gao, Youyou Lu, Yuhao Zhang, Jiwu Shu, 57th Annual IEEE/ACM International Symposium on Microarchitecture (MICRO-57), 2024 PDF Exploring the Asynchrony of Slow Memory Filesystem with EasyIO. Bohong Zhu, Youmin Chen, Jiwu Shu, The 19th European Conference on Computer Systems (EuroSys'24), 2024 PDF TeRM: Extending RDMA-Attached Memory with SSD. Zhe Yang, Qing Wang, Xiaojian Liao, Youyou Lu, Keji Huang, Jiwu Shu, The 22nd USENIX Conference on File and Storage Technologies (FAST'24), 2024 PDF Revisiting Secondary Indexing in LSM-based Storage Systems with Persistent Memory. Jing Wang, Youyou Lu, Qing Wang, Yuhao Zhang, Jiwu Shu, USENIX Annual Technical Conference (USENIX ATC'23), 2023 PDF SingularFS: A Billion-Scale Distributed File System Using a Single Metadata Server. Hao Guo, Youyou Lu, Wenhao Lv, Xiaojian Liao, Shaoxun Zeng, Jiwu Shu, USENIX Annual Technical Conference (USENIX ATC'23), 2023 PDF PetPS: Supporting Huge Embedding Models with Persistent Memory. Minhui Xie, Youyou Lu, Qing Wang, Yangyang Feng, Jiaqiang Liu, Kai Ren, Jiwu Shu, The 49th International Conference on Very Large Data Bases (VLDB'23), 2023 PDF λ-IO: A Unified IO Stack for Computational Storage. Zhe Yang, Youyou Lu, Xiaojian Liao, Youmin Chen, Junru Li, Siyu He, Jiwu Shu, The 21st USENIX Conference on File and Storage Technologies (FAST'23), 2023 PDF Citron: Distributed Range Lock Management with One-sided RDMA. Jian Gao, Youyou Lu, Minhui Xie, Qing Wang, Jiwu Shu, The 21st USENIX Conference on File and Storage Technologies (FAST'23), 2023 PDF Patronus: High-Performance and Protective Remote Memory. Bin Yan, Youyou Lu, Qing Wang, Minhui Xie, Jiwu Shu, The 21st USENIX Conference on File and Storage Technologies (FAST'23), 2023 PDF Mobius: Fine Tuning Large-scale Models on Commodity GPU Servers. Yangyang Feng, Minhui Xie, Zijie Tian, Shuo Wang, Youyou Lu, Jiwu Shu, The 28th Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS'23), 2023 PDF Replicating Persistent Memory Key-Value Stores with Efficient RDMA Abstraction. Qing Wang, Youyou Lu, Jing Wang, Jiwu Shu, The 17th USENIX Symposium on Operating Systems Design and Implementation (OSDI'23), 2023 PDF RIO: Order-Preserving and CPU-Efficient Remote Storage Access. Xiaojian Liao, Zhe Yang, Jiwu Shu, The 18th European Conference on Computer Systems (EuroSys'23), 2023 PDF SwitchTx: Scalable In-Network Coordination for Distributed Transaction Processing. Junru Li, Youyou Lu, Yiming Zhang, Qing Wang, Zhuo Cheng, Keji Huang, Jiwu Shu, Proceedings of The 48th International Conference on Very Large Data Bases (VLDB'22), 2022 PDF Pacman: An Efficient Compaction Approach for Log-Structured Key-Value Store on Persistent Memory. Jing Wang, Youyou Lu, Qing Wang, Minhui Xie, Keji Huang, Jiwu Shu, USENIX Annual Technical Conference (USENIX ATC'22), 2022 PDF AlNiCo: SmartNIC-accelerated Contention-aware Request Scheduling for Transaction Processing. Junru Li, Youyou Lu, Qing Wang, Jiazhen Lin, Zhe Yang, Jiwu Shu, USENIX Annual Technical Conference (USENIX ATC'22), 2022 PDF Fleche: An Efficient GPU Embedding Cache for Personalized Recommendations. Minhui Xie, Youyou Lu, Jiazhen Lin, Qing Wang, Jian Gao, Kai Ren, Jiwu Shu, The 17th European Conference on Computer Systems (EuroSys'22), 2022 PDF InfiniFS: An Efficient Metadata Service for Large-Scale Distributed Filesystems. Wenhao Lv, Youyou Lu, Yiming Zhang, Peile Duan, Jiwu Shu, USENIX Conference on File and Storage Technologies (FAST'22), 2022 PDF Plor: General Transactions with Predictable, Low Tail Latency. Youmin Chen, Xiangyao Yu, Paraschos Koutris, Andrea Arpaci-Dusseau, Remzi Arpaci-Dusseau, Jiwu Shu, ACM SIGMOD International Conference on Management of Data (SIGMOD'22), 2022 PDF Sherman: A Write-Optimized Distributed B+Tree Index on Disaggregated Memory. Qing Wang, Youyou Lu, Jiwu Shu, ACM SIGMOD International Conference on Management of Data (SIGMOD'22), 2022 PDF Crash Consistent Non-Volatile Memory Express. Xiaojian Liao, Youyou Lu, Zhe Yang, Jiwu Shu, The 28th ACM Symposium on Operating Systems Principles (SOSP'21), 2021 PDF ParaBit: Processing Parallel Bitwise Operations in NAND Flash Memory based SSDs. Congming Gao, Xin Xin, Youyou Lu, Youtao Zhang, Jun Yang, Jiwu Shu, 54st Annual IEEE/ACM International Symposium on Microarchitecture (MICRO'21), 2021 PDF Max: A Multicore-Accelerated File System for Flash Storage. Xiaojian Liao, Youyou Lu, Erci Xu, Jiwu Shu, USENIX Annual Technical Conference (USENIX ATC'21), 2021 PDF Nap: A Black-Box Approach to NUMA-Aware Persistent Memory Indexes. Qing Wang, Youyou Lu, Junru Li, Jiwu Shu, The 15th USENIX Symposium on Operating Systems Design and Implementation (OSDI'21), 2021 PDF Aria: Tolerating Skewed Workloads in Secure In-memory Key-value Stores. Fan Yang, Youmin Chen, Youyou Lu, Qing Wang, Jiwu Shu, 37th IEEE International Conference on Data Engineering (ICDE'21), 2021 PDF Scalable Persistent Memory File System with Kernel-Userspace Collaboration. Youmin Chen, Youyou Lu, Bohong Zhu, Andrea Arpaci-Dusseau, Remzi Arpaci-D",
  "content_length": 25104,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:21"
}