{
  "name": "Jiyao An",
  "homepage": "http://csee.hnu.edu.cn/people/anjiyao",
  "status": "success",
  "content": "安吉尧-湖大信息科学与工程学院 教师登录 English 返回首页 学院概况 学院简介 学院领导 师资力量 机构设置 决策机构 教学单位 计算机科学系 软件工程系 通信工程系 信息工程系 计算机工程系 网络空间安全系 实验中心 基础教学部 研究机构 特色学院 条件装备 办事机构 人才培养 本科培养 研究生培养 博士生培养 留学生培养 学科专业方向 科学研究 科研项目 科研成果 成果转化 学术信息 工作流程 招生就业 本科招生 硕士招生 博士招生 学生就业 实习就业基地 学生工作 学生动态 学生党建 团学工作 日常管理 心理健康 奖励工作 社团组织 党群工作 党建工作 工会工作 关工委工作 学术资源 资源管理系统 精品课程 实验仪器设备 安吉尧 我的位置在： 首页 > 学院概况 > 师资力量 > 安吉尧 教师介绍 安吉尧，博士，教授，博士生导师。湖南慈利人，1998年硕士毕业于湘潭大学，2012年博士毕业于湖南大学。1998年就职于湖南创智软件园有限公司，曾担任软件设计师和项目组主管。2000年8月加入湖南大学计算机科学系。2013-2014年加拿大滑铁卢大学访问学者，进行模糊系统及应用方面的研究与交流。 中文名： 安吉尧 英文名： 学历： 职称： 教授 联系电话： 电子邮件： jt_anbob@hnu.edu.cn 研究方向： 1）智能交通认知计算与应用；2）深度学习及其可解释性；3）新一代汽车CPS关键技术；4）模糊系统及应用 联系地址： 湖南省长沙市岳麓区麓山南路2号,湖南大学信息科学与工程学院（410082） 所属机构： 计算机工程系 学院教师 个人信息 安吉尧   博士，教授，博士生导师。CCF高级会员，CAAI会员，IEEE会员，ACM会员。近年已在IEEE TFS、TPDS、TC、TSC、TCAD、TITS、TII、TSMCS，FSS，ISA Trans，FI，FGCS，JNSA；Fuzz-IEEE，MSC，IECON，ISIE，CIKM等国际著名学术期刊和会议上发表六十余篇高水平科研论文，SCIE检索四十余篇，ESI高被引4篇。在湖南大学所在学科（ESI）作者贡献中排名前10%。已主持和主研国家重点研发计划专项、国家自然科学基金重点项目/面上项目、教育部重点项目、863重点项目、省科技项目等20项，申请国家发明专利17项（已授权十二项），登记软件著作权7项。兼任教育部学位与研究生教育评估专家，国家自然科学基金通讯评审专家，国家留学基金委出国人才项目评审专家，北京市自然科学基金评审专家，湖南省科技咨询与评审专家，湖南省高新技术企业认定评审专家，湖南省科技奖励评审专家等。是CCF嵌入式系统专业委员会委员，CCF大数据专家委员会委员，CAAI科普工作委员会委员。也是TIE、TFS、TII、TSP、TCyb、InformSci、ASC、JCAS等多个国际知名SCI期刊的特约审稿人，MSC、ICCSA等国际著名学术会议程序委员会委员（TPC Member）。 目前研究兴趣：    1）智能交通认知计算与应用；    2）深度学习及其可解释性；    3）新一代汽车CPS关键技术；    4）模糊系统及应用。Teaching Courses: Combinatorial Optimization Theory and Algorithm, 2020 spring/autumn; Policy decision, Planing and Control, 2020 autumn.Jiyao AN, Ph.D, Professor, Ph.D. supervisor of College of Computer Science and Electronic Engineering, Hunan University.---------------------------------------------------------------------------NOTE: I am always looking for collaboration with other academic staffs, industry partners and potential research students for exciting research work. If you are interested in my research areas, please feel free to contact me. Particularly, I am very interested in the following topics at the moment:Research Interesting Areas: Intelligent traffic cognition, Deep learning model and its interpretability, Automotive CPS, Fuzzy System and Application, etc..---------------------------------------------------------------------------Department of Computer Engineering,College of Computer Science and Electronic Engineering,Hunan University#2 Lushan Road (South), Yuelu District,Changsha, 410082, ChinaFax: (731) 8882-2417  |  Email: jt_anbob@hnu.edu.cn--------------------------------------------------------------------------- 科研业绩 22. 可解释深度学习模糊建模方法及其交通流动态漂移认知应用研究，湖南省自然科学基金面上项目，2023.1-2025.1221.  城市智能客车多模态协同感知与安全高效行驶关键技术研究，国家自然科学基金区域联合重点项目，2022.1-2025.1220. 面向智能交通认知的CPS计算架构与可解释深度学习模型研究，国家自然科学基金面上项目，2022.1-2025.1219.湖南大学-广州润乾数据信息大数据及人工智能，企业产学研项目，2021.1-2022.1118.三维影像信息系统，企业横向项目，2020.6-2025.617. 消防施工项目成本控制技术与系统, 企业横向项目，2018.8-2020.1216. 新一代汽车CPS的模糊智能控制策略与算法研究，湖南省自然科学基金项目，2018.1-2020.1215. 体系结构感知的程序优化方法研究，国家重点研发计划高性能计算专项课题，2016.7-2018.614.  一类CPS中基于模糊理论的系统建模方法研究，国家自然科学基金面上项目，2014.1-2017.1213.  大规模SNP数据挖掘及其在复杂疾病分析中的应用研究，国家自然科学基金面上项目，2014.1-2017.1212. 城市计算中基于Brownian Agent的路径优化层级模型研究，湖南省自然科学基金，2013.1-2015.1211.  行业应用市场分析和电磁计算软件研发，国家863高技术重点项目，2013.1-2014.1210.  湖南大学青年教师成长计划资助，中央高校基本科研业务费，2012.1-2015.129.  车载CPS混合动态系统的随机模糊控制策略与算法研究，湖南省科技厅项目，2012.1-2013.128.  车辆振动随机脉冲模糊控制方法研究，中央高校基本科研业务费，2011.9-2012.127.  随机脉冲控制方法研究及其在汽车振动控制系统中的应用，中央高校基本科研业务费，2010.12-2011.126.  月球探测移动机器人结构设计与自主导航技术，教育部科技项目重点项目，2009.1-2011.125.软件及数字媒体IP资源验证和组织技术研究及系统开发，国家863高技术项目，2007.8-2010.124.匿名通信系统攻防研究，湖南省科技厅项目，2006.12-2007.123.示范性教学资源系统5，国家发改委项目，2004.7-2005.122.多变量不确定因素工艺配方优化系统，国家科技部攻关项目，2002.1-2004.31.高速网络环境下入侵检测技术研究，湖南省自然科学基金项目，2004.1-2005.12 学术成果 My Google Scholar Profile：https://scholar.google.com/citations?user=BeWWwfsAAAAJMy Researchgate Scholar Profile：https://www.researchgate.net/profile/Jiyao_An Forthcoming papers:1. Recent View of Multisensor Conflict Data Fusion for Vehicular Cyber-Physical Systems, Information Fusion, under review.2. Fuzzy-based Multi-objective Dynamic Optimization Algorithm for Electric Vehicle Charging System with Time-varying Electricity Price, Soft computing, under review.3. A Novel Model for Generalized Sparse Non-negative Tensor Factorization in Large-scale Industrial Applications, IEEE TETC, under review.4. Novel Fuzzy-based Stock Investment Strategies For Daily Stock Trading System, IEEE TFS, major revision.5. Recent View of Intelligent Traffic Flow Prediction for Intelligent Transportation Systems, IET Intelligent Transport Systems, under review.2022-接受/发表的部分论文：[52]. Jiyao An;  Xuan Zhang; Ju Fang, and Qingqin Liu, FST-GNN: A fuzzy-based spatial-temporal graph neural network for traffic flow prediction during emergent epidemics, C. Kahraman et al.(Eds.): INFUS 2024, LNNS 1089, pp.758-766, August 2024, [51]. Jiyao An; Jin Zhao; Qingqin Liu; Xinjiao Qian; and Jiali Chen, Self-constructed deep fuzzy neural network for traffic flow prediction, Electronics, 2023, 12, 1885, April 2023, DOI://10.3390/electronics12081885. (JCR SCI-Q2)[50]. Jiyao An; Ju Fang; Xuan Zhang; and Qingqin Liu, A novel fuzzy-clustering-based deep learning approach for spatio-temporal traffic speed prediction, INFUS 2023, LNNS 758, pp.569-576, August 2023, [49]. Hongfang Gong; Renfa Li; Jiyao An; Guoqi Xie, Reliability Modeling and Assessment for a Cyber-Physical System With a Complex Boundary Behavior, IEEE Transactions on Reliability, Early Access, April 2022, DOI://10.1109/TR.2022.3160460. (JCR SCI-Q1，TOP期刊)[48]. Jiyao An; Wei Liu; Qingqin Liu; Liang Guo; Ping Ren; Tao Li, DGInet: Dynamic graph and interaction-aware convolutional network for vehicle trajectory prediction, Neural Networks, Vol.151, pp.336-348, August 2022. (JCR SCI-Q1，CCF-B)[47]. Hao Li; Kenli Li; Jiyao An; Keqin Li, An Online and Scalable Model for Generalized Sparse Non-negative Matrix Factorization in Industrial Applications on Multi-GPU, IEEE Transactions on Industrial Informatics, Vol.18, No.1, pp.437-447, January, 2022. (中科院SCI一区，TOP期刊，CCF-A，ESI高被引论文).2021-2017年：[46] 李哲，袁小芳，王耀南，李智勇，安吉尧. 基于虚拟仿真的机器人专业综合设计实验方案探索，计算机教育，第11期，33-37，2021.11[45] Jing Huang, Renfa Li, Jiyao An, et al., A DVFS-Weakly-Dependent Energy-Efficient Scheduling Approach for Deadline-Constrained Parallel Applications on Heterogeneous Systems, IEEE Transactions on computer-aided design of integrated circuits and systems, Vol.40, No.2, pp.2481-2494, December, 2021 (中科院SCI三区，CCF-A)[44] Jiyao An*, Liang Guo, Wei Liu, Zhiqiang Fu, Ping Ren, Tao Li, IGAGCN:Information Geometry and Attention Based Spatiotemporal Graph Convolutional Networks for Traffic Flow Prediction, Neural Networks, Vol.143, pp.355-367, November 2021. (中科院SCI二区，CCF-B)[43] Jing Huang, Renfa Li, Yehua Wei, Jiyao An, Wanli Chang, Bi-Directional Timing-Power Optimisation on Heterogeneous Multi-Core Architectures, IEEE Transactions on Sustainable Computing, Vol.6, No.4, pp.572-585, Oct.-Dec. 1, 2021.[42] Hongfang Gong, Renfa Li, Jiyao An, et al., Quantitative modeling and analytical calculation of anelasticity for a cyber-physical system, IEEE Transactions on Systems, Man, and Cybernetics: Systems, Vol.50, No.11, pp.4746-4761, November 2020. (中科院SCI一区，TOP期刊)[41] Wu Wufei, Li Renfa, Xie Guoqi, An Jiyao, et al., A Survey of Intrusion Detection for In-Vehicle Networks, IEEE Transactions on Intelligent Transportation Systems, Vol.21, No.3, pp.919-933, March, 2020. (中科院SCI二区，TOP期刊，ESI高被引论文)[40]. Weihong Chen, Jiyao An*, Renfa Li, Guoqi Xie. Tensor-train fuzzy Deep Computation Model for Citywide Traffic Flow Prediction, IEEE Access, Vol.7, No.1, pp.120581-120593, December, 2019. (中科院SCI二区)[39]. Jing Huang, Yan Liu, Renfa Li, Keqin Li, Jiyao An, Yang Bai, Fan Yang, Guoqi Xie. Optimal power allocation and load balancing for non-dedicated heterogeneous distributed embedded computing systems, Journal of Parallel and Distributed Computing, Vol.130, pp.24-36, August, 2019. (中科院SCI三区)[38]. Jiyao An*, Li Fu, Meng Hu, Weihong Chen, Xiawei Zhan, A novel fuzzy-based convolutional neural network method to traffic flow prediction with uncertain traffic accident information, IEEE Access, Vol.7, No.1, pp.20708-20722, Feb., 2019. (中科院SCI二区)[37]. Hao Li, Kenli Li, Jiyao An, Keqin Li, An Online and Scalable Model for Generalized Sparse Non-negative Matrix Factorization in Industrial Applications on Multi-GPU, IEEE Transactions on Industrial Informatics, Online, DOI:10.1109/TII.2019.2896634, Jan., 2019. (中科院SCI一区，TOP期刊，CCF-A).[36]. Jiyao An*, Yingjun Yu, Jie Tang and Jiawei Zhan, Fuzzy-based hybrid location algorithm for vehicle position in VANETs via fuzzy Kalman filtering approach, Advances in Fuzzy Systems, Vol.2019, ArticleID.5142937, 11 Pages, DOI:10.1155/2019/5142937, Jan., 2019.[35]. Jiyao An*, Meng Hu, Li Fu, Jiawei Zhan, A novel fuzzy approach for combining uncertain conflict evidences in the Dempster-Shafer theory, IEEE Access, Vol.7, Issue 1, pp.7481-7501, Jan., 2019. (中科院SCI二区，ESI高被引论文)[34]. Hao Li, Keqin Li, Jiyao An, Weihua Zheng, Kenli Li, An Efficient Manifold Regularized Sparse Non-negative Matrix Factorization Model for Large-scale Recommender Systems on GPU, Information Science, Vol.496, pp.464-484, Sep., 2019, （SCI-1区，TOP期刊，CCF-B）[33]. Hao Li, Kenli Li, Jiyao An, Keqin Li, CUSNTF: A Scalable Sparse Non-negative Tensor Factorization Model for Large-scale Industrial Applications on Multi-GPU, in Proc. of The 27th ACM International Conference on Information and Knowledge Management (CIKM'2018), pp.1113-1122, Oct. 17,2018, (AcceptedRate:17%，CCF-B)[32]. Hongfang Gong, Renfa Li, Yang Bai, Jiyao An, Keqin Li, Message Response Time Analysis for Automotive Cyber-Physical Systems with Uncertain Delay: An M/PH/1 Queue Approach，Performance Evaluation, Vol.125, pp.21-47, Sep. 2018, （SCI-3区，CCF-B）[31]. Weihong Chen, Jiyao An*, Renfa Li, Li Fu, Guoqi Xie, Md Zakirul Alam Bhuiyan, and Keqin Li. A novel fuzzy deep-learning approach to traffic flow prediction with uncertain spatial-temporal data features. Future Generation Computer Systems, Vol.89, pp.78-88, Dec. 2018, DOI://10.1016/j.future.2018.06.021. （SCI-2区，CCF-C）[30]. Jiyao An*, Qianying Chen, M",
  "content_length": 19075,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:22"
}