{
  "name": "Jize Yan",
  "homepage": "https://www.ecs.soton.ac.uk/people/jy12g15",
  "status": "success",
  "content": "Professor Jize Yan | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Professor Jize Yan Professor Research interests Sensor Technology, Microsystems and Cleanroom Fabrication Monitoring and Metrology for Infrastructure, Space, Healthcare and Quantum. Information, Physics and AI for Sensing, Computing and Communication More research Accepting applications from PhD students. Connect with Jize Email: J.Yan@southampton.ac.uk Tel: +44 23 8059 9179 ORCID On this page About Research Publications External roles and responsibilities About Research Publications External roles and responsibilities About Prof. Jize Yan, an expert in Sensor Technology and Microsystems at the University of Southampton, holds a BEng from Tsinghua University and a PhD from the University of Cambridge. He's been awarded over £30M in research grants (e.g. PI of the EPSRC Grant (EP/V000624/1, Integrated levitated optomechanical gravimeter) and its IAA Funds. Co-I on several grants awarded in 2024: the £12M UK Semiconductor Innovation and Knowledge Centre (EP/Z531066/1, CORNERSTONE Photonics Innovation Centre), £1.3M+¥220M Japan-UK Semiconductor Collaboration Grant (APP45220, Heterogeneous material integrated MEMS/NEMS-Photonics platform for secure communication), £1.1M Innovate UK Accelerating Trustworthy AI Grant (10092974, DeepMyna Phase 2), £0.5M UK ARIA Grant (Miniaturised multimodal sensors mimicking skin mechanosensation for AI-enhanced neurovascular precision) and £0.24M UK Space Agency Grant (Silicon photonic beam pointing for free space optical communications). Co-I of £10M EMSET Grant at Cambridge CARE. etc.). He published more than 100 peer-reviewed publications, and received multiple best-paper awards. He leads a research team of over 20 PhD students, Post-Docs and industry visitors, working with industry leaders to solve critical metrology challenges in infrastructure safety, space observatory, health care and quantum technology. Jize's pioneering research has set world records, driving innovations in areas such as meta-lenses, vortex-beam sensors, distributed fiber optic sensors, MEMS and optomechanical sensors, wireless sensor networks, energy harvesting, and cleanroom fabrication. His theoretical research interests, which bridges theory and practical applications, includes work on classically entangled light, optical hyper-entanglement, holographic duality, fisher information flow and optical computing. With more than 10 patents, Jize co-founded several spin-out companies (8power, Wisen, Traco) and facilitated technology transfer for companies like Silicon Microgravity, NXP Semiconductors, and Cementation Skanska, generating over £20M in income. He has been invited to serve on venture capital panels, evaluating more than 30 startup proposals. At the Faculty of Engineering and Physical Sciences, he initiated and coordinates the Quantum@FEPS events, bringing together academics with an interest in quantum technologies to shape a cohesive quantum strategy for Southampton. At the School of Electronics and Computer Science, he enhanced the internal grant review process, serves as EEE Impact Champion for REF2029, and mentors commercialization initiatives. He is also an associate editor for five international journals and a member of the UKRI Talent Review College and the EPSRC Peer Review College. In education, Jize works with leading AI education enterprises to advance AI technologies and shape future AI education standards. His commitment to his team’s development has resulted in rapid career progression for his students—some have achieved full professorships at esteemed universities at an early age, while others secured tenure-track positions at prestigious institutions like UC Berkeley and EPFL. One student was even knighted. His former students have also founded successful spin-off companies, with one gaining a significant share of the UK market. Jize is always open to PhD and fellowship applicants and is dedicated to helping candidates secure academic positions or achieve their career aspirations. Research Research groups Member of: Centre for Risk Research Smart Electronic Materials and Systems Centre for Machine Intelligence Research interests Sensor Technology, Microsystems and Cleanroom Fabrication Monitoring and Metrology for Infrastructure, Space, Healthcare and Quantum. Information, Physics and AI for Sensing, Computing and Communication Research projects Active projects Heterogeneous Material Integrated MEMS/NEMS-Photonics Platform for Secure Communication Researchers: Doctor Yoshishige Tsuchiya Doctor Bruce (Jun-Yu) Ou , Professor Jize Yan Completed projects Integrated levitated optomechanical sensors Researchers: Professor Jize Yan Professor Hendrik Ulbricht Sponsor: EPSRC Prototype construction of integrated LOMS gravimeter for oil/gas and infrastructure applications Researchers: Professor Jize Yan Professor Hendrik Ulbricht MEMS Backscattered Antenna for Passive Wifi and RF Power Harvester Researchers: Doctor Bruce (Jun-Yu) Ou Professor Jize Yan Publications Levitation and controlled MHz rotation of a nanofabricated rod by a high-NA metalens Hailong Pi, Chuang Sun, Kian Shen Kiang, Tiberius-stefan Georgescu, Bruce Jun-Yu Ou, Hendrik Ulbricht & Jize Yan, 2025, Microsystems and Nanoengineering, Nature publication group, 11(1) DOI: 10.1038/s41378-025-00886-7 Type: article Arbitrary hybrid and higher-order Poincaré sphere beams generation by metasurfaces via a unified design framework Chuang Sun, Hailong Pi, Kian Shen Kiang, Jun-Yu Ou & Jize Yan, 2025, Advanced Photonics Nexus, 4(1) DOI: 10.1117/1.APN.4.1.016015 Type: article Nonclassical spin-multiplexing metasurfaces enabled multifunctional meta-scope Chuang Sun, Zixuan Wang, Kian Shen Kiang, Oleksandr Buchnev, Dawei Tang, Jize Yan & Bruce (Jun-Yu) Ou, 2024, Small, 20(49) DOI: 10.1002/smll.202404003 Type: article Digital-coding metamaterials for on-chip beamsteering and reconfigurable millimeter-wave interconnects Zhicheng Shen, Sajjad Taravati & Jize Yan, 2024, IEEE Access, 12, 190775-190790 DOI: 10.1109/ACCESS.2024.3508574 Type: article RAM-adaptive parallel generating and minimizing the layout file of wafer-scale metalens Chuang Sun, Jun-Yu Ou, Kian Shen Kiang & Jize Yan, 2024 Type: conference Modelling and analysis of vector and vector vortex beams reflection for optical sensing Wangke Yu & Jize Yan, 2024, Photonics, 11(8) DOI: 10.3390/photonics11080729 Type: article Near-infrared metalens empowered dual-mode high resolution and large FOV microscope Chuang Sun, Hailong Pi, Kian Shen Kiang, Jize Yan & Jun-Yu Ou, 2024, Advanced Optical Materials, 12(21) DOI: 10.1002/adom.202400512 Type: article Controlled generation and imaging application of Poincaré sphere beams via all-dielectric metasurface Chuang Sun, Hailong Pi, Kian Shen Kiang, Jun-Yu Ou & Jize Yan, 2024 Type: conference Tunable on-chip optical traps for levitating particles based on single-layer metasurface Chuang Sun, Hailong Pi, Kian Shen Kiang, Tiberius S. Georgescu, Jun-Yu Ou, Hendrik Ulbricht & Jize Yan, 2024, Nanophotonics DOI: 10.1515/nanoph-2023-0873 Type: article Manipulation of higher-order Poincaré sphere beams beyond the diffraction limit using single-layer metasurface Chuang Sun, Hailong Pi, Kian Shen Kiang, Jize Yan & Jun-Yu Ou, 2024 Type: conference External roles and responsibilitie",
  "content_length": 31304,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:27"
}