{
  "name": "Jizhong Zhao",
  "homepage": "http://www.xjtu.edu.cn/jsnr.jsp?urltype=tree.TreeTempUrl&wbtreeid=1632&wbwbxjtuteacherid=626",
  "status": "success",
  "content": "教师内容页-西安交通大学 设为首页|English Version 在校生 | 教职工 | 校友 | 考生与访客 | 合作者 | 捐赠 全部 标题 正文 标签 摘要 作者 来源 栏目 全部时间 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 首页 交大概况 交大简介 元旦献辞 学校领导 统计数据 校史沿革 学校标识 院系设置 数学学院 物理学院 化学学院 前沿院 机械学院 电气学院 能动学院 电信学部 人工智能学院 材料学院 人居学院 生命学院 航天学院 化工学院 仪器科学与技术学院 医学部 经金学院 金禾经济中心 管理学院 公管学院 人文学院 新媒体学院 马克思主义学院 法学院 外国语学院 体育学院 继续（网络）教育学院 国际教育学院 钱学森学院 创新创业学院 未来技术学院 西交米兰学院 国家储能平台（中心） 国家卓越工程师学院 国家医学攻关平台（中心） 组织机构 党群机构 行政部门 直属单位 附属单位 创新港研究院 其它 本科书院 彭康书院 文治书院 宗濂书院 启德书院 仲英书院 励志书院 崇实书院 南洋书院 钱学森书院 医学教育 医学部 基础医学院 综合办公室 公共卫生学院 人才培养处 药学院 人力资源处 法医学院 科学技术与学科建设处 护理学系 医院管理处 第一临床医学院(第一附属医院) 第二临床医学院(第二附属医院) 口腔医学院(口腔医院) 全球健康研究院 科学研究 科技概况 科研基地 产学研合作 学术资源 学术期刊 仪器设备 科研系统 中国西部科技创新港 师资队伍 师资介绍 两院院士 知名教授 博士生导师 博士后站 招聘信息 人才培养 教学基地 本科生教育 研究生教育 留学生教育 远程教育 继续教育 国际交流 国际合作与交流处 上海合作组织大学（中国） 丝绸之路大学联盟 国际教育学院 西交利物浦大学 图书档案 钱学森图书馆 档案馆、博物馆 交大西迁博物馆 数字文博平台 出版社 校友服务 交大校友网 知名校友 基金会 校园生活 工会活动 学生党建 学生会 校园文化 奖学金 勤工助学 信息服务 校园基本建设 校园通讯建设 交大校历 常用电话 病毒防治 正版软件 运动场馆 校园风物 资料下载 当前位置: 首页 >> 师资队伍 师资队伍 师资介绍 两院院士 知名教授 博士生导师 博士后站 招聘信息 教师内容页 赵季中 研究领域（方向） 移动计算 分布式系统 智能感知 物联网 安全与隐私保护。 个人及工作简历 工学博士，教授，博士生导师，2013年获国家自然科学基金杰出青年基金资助，现任ACM协会西安分会副主席，“核高基”国家科技重大专项总体组专家，中国计算机协会普适计算委员会委员，《科学通报》编委，西安交通大学领军人才，西安交通大学大学视觉信息处理与应用国家工程实验室副主任。2001年博士毕业后留校任教至今，发表学术论文160余篇，其中中国计算机协会推荐的A类期刊和会议论文40余篇，谷歌学术单篇最高引用近300次，主持国家级科研项目10余项，包括“核高基”国家科技重大专项课题2项，国家自然科学基金杰出青年基金1项，基金重大项目子课题，基金重点项目子课题，基金海外合作项目，973子课题，国家科技支撑计划、863目标导向课题多项，授权发明专利10余项。2006年评选为教育部“新世纪优秀人才”，2007年获国家技术发明二等奖和陕西省科学技术一等奖各一次。指导博士生10余人，硕士生60余人。 科研项目 1.国家自然科学基金面上基金，61672424，基于视觉和惯性传感器融合的用户意图感知问题研究，2017/01-2020/12，主持； 2.核高基国家重大专项，XXX（涉密），抗辐照XXX（涉密），2015/1-2017/6，主持； 3.国家自然科学基金杰出青年科学基金，61325013，物联网多维信息智能感知与计算关键技术研究，4.2014/01-2017/12，主持； 国家自然科学基金海外学者合作研究基金，61228202，普适计算环境下的网络模型与管理问题研究，2013/01-2014/12，主持（国内）； 5.国家自然科学基金重大项目子课题，61190112，规模型泛在系统非基于领域知识的自演化与自导向诊断，2012/01-2016/12，主持； 6.陕西省科技统筹项目，2012KTCL01-1，基于物联网技术的企业供应链物流开放式软件服务平台研发及典型应用，2012/01-1014/12，主持； 7.教育部博士点基金（博导类），20110201110064，基于多维社会网络结构数据仓库的网络舆情监控平台研究，2012/01-2014/12，主持； 8.横向（四川长虹电器股份有限公司），无，智能终端的新型智能交互实现与应用程序框架层设计，2012/01-2013/12，主持； 9.973计划子课题，2011CB302705HZ，物联网综合验证平台，2010/01-2012/12，主持； 10.核高基国家重大专项，XXX（涉密），视觉XXX，2009/01-2011/12，主持； 11.国家自然科学基金面上项目，60873262，普适计算环境下隐私保护模型及关键技术研究，2009/01-2011/12，主持； 12.国家科技支撑计划，01Z12007AA01Z180，古代建筑虚拟修复及WEB表现技术研究，2007/01-2008/12，主持； 13.国家自然科学基金面上项目，60573119，基于普适环境的上下文感知共享模型研究，2006/01-2008/12，主持。 学术及科研成果、专利、论文 论文： 一、期刊 1. Qinghua Yu, Jinjun Wang, Shizhou Zhang, Yihong Gong, Jizhong Zhao: Combining local and global hypotheses in deep neural network for multi-label image classification. Neurocomputing 235: 38-45 (2017); 2. Lin-Yuan He, Jizhong Zhao, Nanning Zheng, Duyan Bi: Haze Removal Using the Difference- Structure-Preservation Prior. IEEE Trans. Image Processing 26(3): 1063-1075 (2017); 3. Bin Zhang, Jizhong Zhao: Hardware Implementation for Real-Time Haze Removal. IEEE Trans. VLSI Syst. 25(3): 1188-1192 (2017); 4. Ce Li, Yang Yang, Limei Xiao, Yongxin Li, Yannan Zhou, Jizhong Zhao: A novel image enhancement method using fuzzy sure entropy. Neurocomputing 215: 196-211 (2016); 5. Qiubo Chen, Hongbin Sun, Xuchong Zhang, Huibin Tao, Jie Yang, Jizhong Zhao, Nanning Zheng: Algorithm and VLSI Architecture of Edge-Directed Image Upscaling for 4k Display System. IEEE Trans. Circuits Syst. Video Techn. 26(9): 1758-1771 (2016); 6. Peng Cheng, Xiang Lian, Lei Chen, Jinsong Han, Jizhong Zhao: Task Assignment on Multi-Skill Oriented Spatial Crowdsourcing. IEEE Trans. Knowl. Data Eng. 28(8): 2201-2215 (2016); 7. Jinsong Han, Chen Qian, Panlong Yang, Dan Ma, Zhiping Jiang, Wei Xi, Jizhong Zhao: GenePrint: Generic and Accurate Physical-Layer Identification for UHF RFID Tags. IEEE/ACM Trans. Netw. 24(2): 846-858 (2016); 8. Jinsong Han, Chen Qian, Xing Wang, Dan Ma, Jizhong Zhao, Wei Xi, Zhiping Jiang, Zhi Wang: Twins: Device-Free Object Tracking Using Passive Tags. IEEE/ACM Trans. Netw. 24(3): 1605-1617 (2016); 9. Jinsong Han, Han Ding, Chen Qian, Wei Xi, Zhi Wang, Zhiping Jiang, Longfei Shangguan, Jizhong Zhao: CBID: A Customer Behavior Identification System Using Passive Tags. IEEE/ACM Trans. Netw. 24(5): 2885-2898 (2016); 10. Lei Rao, Bin Zhang, Jizhong Zhao: Hardware Implementation of Reconfigurable 1D Convolution. Signal Processing Systems 82(1): 1-16 (2016); 11. Hai-Jiang Xie, Jizhong Zhao: A lightweight identity authentication method by exploiting network covert channel, Peer-to-Peer Networking and Applications, 8(6): 1038-1047(2015); 12. Lei Rao, Bin Zhang, Jizhong Zhao: Hardware Implementation of Reconfigurable 1D Convolution, Journal of Signal Processing Systems, 1-16 (2015); 13. Yanwei Wu, Jizhong Zhao, Xiang-Yang Li: Throughput Optimization in Wireless Mesh Networks Using Zero-Sum Game, Ad Hoc & Sensor Wireless Networks, 21(1-2): 151-175(2014); 14. Rui Li, Kebin Liu, Xiangyang Li, Yuan He, Wei Xi, Zhi Wang, Jizhong Zhao, Meng Wan: Assessing Diagnosis Approaches for Wireless Sensor Networks:  Concepts and Analysis, J. Comput. Sci. Technol, 29(5): 887-900(2014); 15. Zhi Wang, Jinsong Han, Wei Xi, Jizhong Zhao: Efficient and secure key extraction using channel state information, The Journal of Supercomputing, 70(3): 1537-1554(2014); 16. Yanwei Wu, Jizhong Zhao, Xiang-Yang Li: Throughput Optimization in Wireless Mesh Networks Using Zero-Sum Game, Ad Hoc & Sensor Wireless Networks, 21(1-2):  151-175 (2014); 17. ZP Jiang, W Xi, X Li, S Tang, JZ Zhao, JS Han, K Zhao, Z Wang, B Xiao: Communicating is crowdsourcing:  Wi-Fi indoor localization with CSI-based speed estimation, Journal of Computer Science and Technology, 29 (4), 589-604 2014; 18. Zhi Wang, Zhiping Jiang, Jizhong Zhao, Shaojie Tang, Jinsong Han: Infrastructure-Free Precise Indoor Road Map Construction and Localization by Smartphone, Ad Hoc & Sensor Wireless Networks, PP(99), 2014; 19. Rui Li, Jinsong Han, Zhi Wang, Jizhong Zhao, Yihong Gong, Xiaobin Zhang: Tracer:  Taming Anomalous Events with CRFID Tags for Trajectory Management, IJDSN, 2013 (2013); 20. Shuo Lian, Jizhong Zhao, Xu Zhao: Near-Optimal Diagnosis System Deployment in Wireless Sensor Networks, IJDSN, 2013 (2013); 21. Lufeng Mo, YuJia Jiang, Guoying Wang, Jizhong Zhao: Segmental Dynamic Duty Cycle Control for Sampling Scheduling in Wireless Sensor Networks, IJDSN, 2013 (2013); 22. Zhi Wang, Han Ding, Jinsong Han, Jizhong Zhao: Secure and Efficient Control Transfer for IoT Sevices, International Journal of Distributed Sensor Networks, 2013. (SCI:  000327652400001, EI:  20135117097243); 23. Shuo Lian, Jizhong Zhao and Yuan He: Event Localization and Actuation in Wireless Sensor Network without Locations, Ad Hoc & Sensor Wireless Networks, (SCI 201305); 24. Zhao.J.*, Xi.W., He.Y., Liu.Y., Li.X.-Y., Mo.L., Yang.Z: Localization of Wireless Sensor Networks in the Wild:  Pursuit of Ranging Quality, IEEE/ACM TRANSACTION ON NETWORKING, 21(1): 311-323, 2013; 25. Shan Chang, Yong Qi, Hongzi Zhu, Jizhong Zhao: Footprint:  Detecting Sybil Attacks in Urban Vehicular Networks, IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS, 23(6):  1103-1114, 2012; 26. Rui Li, Jizhong Zhao*, Kebin Liu, Yuan He: Ranking-based feature selection for anomaly detection in sensor networks, Ad Hoc & Sensor Wireless Networks, 2012; 27. Jizhong Zhao, Lufeng Mo, Xiaoping Wu: Error Estimation of Iterative Maximum Likelihood Localization in Wireless Sensor Networks, Ad Hoc & Sensor Wireless Networks, 2012 28. Sun Hongbin, Liu Chuanyin, Xu Wei, Zhao Jizhong, Zheng Nanning, Zhang Tong: Using Magnetic RAM to Build Low-Power and Soft Error-Resilient L1 Cache, IEEE TRANSACTIONS ON VERY LARGE SCALE INTEGRATION SYSTEMS, 20(1): 19-28, 2012; 29. Xu Ping, Li Xiang-Yang, Tang ShaoJie, Zhao Jizhong: Efficient and Strategyproof Spectrum Allocations in Multichannel Wireless Networks, IEEE TRANSACTIONS ON COMPUTERS, 60(4): 580-593, 2011; 30. Wang ShiGuang, Mao XuFei, Tang Shao-Jie, Li Xiang-Yang, Zhao Jizhong, Dai GuoJun: On Movement-Assisted Connectivity Restoration in Wireless Sensor and Actor Networks, IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS, 22(4): 687-694, 2011; 31. Han Jinsong*, Zhao Jizhong, Xi Min, Sun Xingming: Removing dubious feedback from mobile wireless ad hoc peer-to-peer systems, INTERNATIONAL JOURNAL OF AD HOC AND UBIQUITOUS COMPUTING, 8(1-2): 106-113, 2011; 32. Xi Min, Qi Yong, Wu Kui, Zhao Jizhong, Li Mo: Using Potential to Guide Mobile Nodes in Wireless Sensor Networks, AD HOC & SENSOR WIRELESS NETWORKS, 12(3-4): 229-251, 2011; 33. Du S.Y., Zhu J.H., Zheng N.N., Zhao J.Z., Li C: Isotropic scaling iterative closest point algorithm for partial registration, Electronics Letters, 47(14), 2011; 34.Zhang Jun, Mei Kuizhi, Zhao Jizhong: Filtering cache pollution based on confidence estimation, Gaojishu Tongxin/Chinese High Technology Letters, 21(6), 2011; 35. Liu Yunhao, Zhou Guo33mo, Zhao Jizhong, Dai GuoJun, Li Xiang-Yang, Gu Ming, Ma Huadong, Mo Lufeng, He Yuan, Wang Jiliang, Li Mo, Liu Kebin, Dong Wei, Xi Wei: Long-term large-scale sensing in the forest:  recent advances and future directions of GreenOrbs, FRONTIERS OF COMPUTER SCIENCE IN CHINA, 4(3): 334-338, 2010; 36. Han Jinsong, Miao Jun, Zhao Jizhong, Huai Jinpeng, Ni Lionel M: Efficient Data Retrieving in Distributed Data-streaming Environments, AD HOC & SENSOR WIRELESS NETWORKS, 10(2-3): 135-151, 2010; 37. Li Xiang-Yang, Nusairat Ashraf, Wu Yanwei, Qi Yong, Zhao Jizhong, Chu Xiaowen, Liu Yunhao: Joint Throughput Optimization for Wireless Mesh Networks, IEEE TRANSACTIONS ON MOBILE COMPUTING, 8(7): 895-909, 2009; 38. Li Mo, Chen Lei, Zhao Jizhong, Zhang Qian, Liu Yunhao: Signature-file-based approach for query answering over wireless sensor networks, IEEE TRANSACTIONS ON VEHICULAR TECHNOLOGY, 57(5): 3146-3154, 2008; 二、会议: 1. Han Ding, Nan Yang, Ge Wang, Jinsong Han, Jizhong Zhao: Poster: Bidimensional Relative Localization Leveraging Interference among Passive Tags. EWSN 2017: 204-205; 2. Ge Wang, Chen Qian, Longfei Shangguan, Han Ding, Jinsong Han, Nan Yang, Wei Xi, Jizhong Zhao: HMRL: Relative Localization of RFID Tags with Static Devices. SE",
  "content_length": 20906,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:22"
}