{
  "name": "Jnyana Ranjan Mohanty",
  "homepage": "https://ksca.kiit.ac.in/profiles/jnyana-ranjan-mohanty",
  "status": "success",
  "content": "Jnyana Ranjan Mohanty – School of Computer Applications Skip to content Go to KIIT Home pageKIIT HomeProf. Achyuta Samanta Founder – KIIT & KISS achyutasamanta.com Jnyana Ranjan Mohanty Jnyana Ranjan Mohanty Jnyana Ranjan Mohanty Professor and Controller of ExaminationsDr. Jnyana Ranjan Mohanty received his Ph.D. degree in Computer Science from Utkal University, Bhubaneswar in the year 2008. He has more than 25 years of teaching experience (UG & PG levels). He joined KIIT Deemed to be University, Bhubaneswar in July 1997 as a Lecturer, and presently he is a Professor. He has served KIIT in different administrative capacities too (as Associate Dean & Controller of Examinations). Presently, he is the Registrar of KIIT Deemed to be University. Prior to joining KIIT, he served as a Lecturer at Institute of Business Administration and Training, Bhubaneswar. He is actively engaged in research work and has a number of Ph.D. scholars under his guidance. He has authored books and has to his credit innumerable publications in reputed International Scopus/ SCI indexed journals and in International Conference proceedings. He has also edited books published by Springer and IJCA Volumes. He has conducted several conferences and workshops as the organising chair/ program chair. His research interests include Queuing Theory, Computational Intelligence, and Cloud Computing. Profile LinksEmail :[email protected]Scopus Id :55627877886Google Scholar :https://scholar.google.co.in/citations?user=DHvFWE0AAAAJ&hl=en Social LinksProfileRecent PublicationsProfileEducational QualificationPh.D. in Computer ScienceResearch InterestsQueuing Theory, Computational Intelligence, and Cloud ComputingAdministrative ResponsibilityRegistrarAwards & Honours Best Faculty Award in 2010MembershipsLife Member of ISTE and ISCAOutreach ActivityArt of GivingRecent PublicationsJournals/Conferences :1. Bhol, S. G., J R Mohanty, P Mukherjee, P K Pattnaik, \"\"Selecting Location for Agro-Based Industry Using ELECTRE III Method\"\". IoT and WSN Applications for Modern Agricultural Advancements: Emerging, IGI Global, 2020. 2. Jena, T., J R Mohanty, S C Satapathy, \"\"Categorization of Intercloud users and auto-scaling of resources\"\". Evolutionary Intelligence. 2019. https://doi.org/10.1007/s12065-019-00220-x. 3. Padhy, N., S C Satapathy, J R Mohanty, R Panigrahi, \"\"Software reusability metrics prediction by using evolutionary algorithms: The interactive mobile learning application RozGaar\"\". International Journal of Knowledge-Based and Intelligent Engineering Systems, Vol. 22, Issue 4, 2018, 261-276. 4. Sahoo, P., J R Mohanty, \"\"Test effort estimation in early stages using Use Case and Class models for web applications\"\". International Journal of Knowledge-Based and Intelligent Engineering Systems, Vol. 22, Issue 3, 2018, 215-229. 5. Jena, T., J R Mohanty,\"\"GA-Based Customer-Conscious Resource Allocation and Task Scheduling in Multi-cloud Computing\"\". Arabian Journal for Science and Engineering, Vol. 43, Number 8, Springer, pp.4115-4130, 2018. 6. Mohanty, J. R., Swati Samantaray, \"\"Cyber Feminism: Unleashing Women Power through Technology\"\". Rupkatha Journal on Interdisciplinary Studies in Humanities, Vol. IX, No. 2, 2017. 7. Sahoo, P., J R Mohanty, \"\"Early Test Effort Prediction using UML Diagrams\"\", Indonesian Journal of Electrical Engineering and Computer Science, Vol. 5, No. 1, 2017, 220-228. 8. Jena, T., J R Mohanty, \"\"Disaster Recovery Services in Intercloud using Genetic Algorithm Load Balancer\"\", International Journal of Electrical and Computer Engineering, Vol. 6 No. 4, 2016. 9. Chand, P., J R Mohanty, “Environmental multi objective uncertain transport trail model using variant of predator prey evolutionary strategy”, International Journal of Applied Decision Sciences, InderScience, Vol. 8, No. 1, 2015. 10. Goswami, V., J R Mohanty, S K Samanta, “Discrete-time bulk-service queues with accessible and non-accessible batches”, ELSEVIER, Applied Mathematics & Computations, Vol.182, 2006, 898-906. 11. Jena, T., J R Mohanty, D Sahoo, \"\"Paradigm shift to green cloud computing\"\", Journal of Theoretical and Applied Information Technology, Vol. 77, No. 3, 2015, 394-402, . 12. Nayak, R. K., B S P Mishra, J R Mohanty, M K Mishra, \"\"A multi deport cluster ranking VRP solved by non-dominated parallel genetic algorithm with time window\"\". Journal of Advanced Research in Dynamical and Control Systems, Vol. 10, Issue 3 Special Issue, 2018, 561-570. 13. Chand, P., J R Mohanty, \"\"Multi Objective Genetic Approach for solving Vehicle Routing Problem with Time Window”, Communications in Computer and Information science, Springer-Verlag Berlin Heidelberg, Vol. 204, part 1, 2011, 336-343. 14. Sahoo, P., J R Mohanty, “System Test Effort Estimation Using Class Model: A Case Study”. Smart Computing and Informatics, Smart Innovation, Systems and Technology, Springer, Vol. 159, 2020, 239-250, 2020.Books :1. Satapathy, S. C., Mohanty, J. R., Bhateja, V., & Udgata, S. K. (2020). Smart Intelligent Computing and Applications, Smart Innovation, Systems and Technology Series, Springer Nature, Vol. 159. 2. Satapathy, S. C., Mohanty, J. R., Bhateja, V., & Udgata, S. K. (2020). Smart Intelligent Computing and Applications, Smart Innovation, Systems and Technology Series, Springer Nature, Vol. 160. 3. Satapathy, S. C., Tavares, J. M. R. S., Bhateja, V., & Mohanty, J. R. (2018). Information and Decision Sciences, Advances in Intelligent Systems and Computing, Springer Nature, VOL.701. 4. Mohanty, H., Mohanty, J. R., & Balakrishnan, A. (2017).Trends in Software Testing, Springer Nature, ISBN 978-981-10-1415-4. sachi2025-10-29T12:03:25+05:30 Page load link Go to Top",
  "content_length": 5683,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:28"
}