{
  "name": "Joab R. Winkler",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/joab-winkler",
  "status": "success",
  "content": "Dr Joab Winkler | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Dr Joab Winkler PhD School of Computer Science Reader Course Director for MSc Artificial Intelligence Member of the Machine Learning research group Open staff member portrait in a modal window j.r.winkler@sheffield.ac.uk +44 114 222 1834 Regent Court (DCS) Full contact details Dr Joab Winkler School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:http://orcid.org/0000-0002-4629-8928 Personal website Profile Joab Winkler is a Reader in The Department of Computer Science at The University of Sheffield. He obtained his undergraduate and PhD degrees at Imperial College London and University College London, respectively. He worked for a few years in industry, before returning to university to conduct research into algebraic and numerical properties of curves and surfaces in computer-aided design systems. He has extended this interest in numerical methods to work on blind image deconvolution, optical flow and neural networks. More details are in the section 'Research interests'. Research interests Joab Winkler’s main research interest is the algebraic and numerical properties of curves and surfaces in computer-aided design systems. Most of this work has been performed using resultant matrices, and this has led him to consider more general issues of robust computations on polynomials that are corrupted by added noise. Examples include the computation of a structured low rank approximation of the Sylvester resultant matrix, the deconvolution of two polynomials and the determination of an approximate greatest common divisor of two polynomials.He has developed a polynomial root solver for the determination of multiple roots of the theoretically exact form of a polynomial, when the coefficients of the given polynomial are corrupted by added noise. He has applied the methods used in this work on polynomials to the deblurring of an image when the point spread function is unknown and must therefore be computed. This is a difficult problem because it is necessary to determine the rank of a matrix whose entries are subject to error. This is one of the most difficult problems in linear algebra.He has also considered numerical and computational issues in optical flow, which is an important problem in computer vision, in order to identify problems that arise in two commonly used algorithms. More recently, he has started work on numerical properties of echo state networks, which are one form of a neural network. Publications Books Winkler J, Lawrence N & Niranjan M (2005) Lecture Notes in Computer Science (Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics): Preface. Journal articles Winkler JR & Mitrouli M (2025) Analysis and implications of a negative parameter in Tikhonov regularisation. Communications in Statistics - Theory and Methods. View this article in WRRO Lakshmi MV & Winkler J (2025) Numerical properties of solutions of LASSO regression. Applied Numerical Mathematics, 208(Part A), 297-309. View this article in WRRO Winkler JR (2024) Error analysis and condition estimation of the pyramidal form of the Lucas-Kanade method in optical flow. Electronics, 13(5). View this article in WRRO Winkler J, Mitrouli M & Koukouvinos C (2022) The application of regularisation to variable selection in statistical modelling. Journal of Computational and Applied Mathematics, 404. View this article in WRRO Bourne M, Winkler J & Yi S (2021) The computation of the greatest common divisor of three bivariate Bernstein polynomials defined in a rectangular domain. Applied Numerical Mathematics, 166, 348-368. View this article in WRRO Bourne M, Winkler JR & Su Y (2021) An approximate factorisation of three bivariate Bernstein basis polynomials defined in a triangular domain. Journal of Computational and Applied Mathematics, 390. Bourne M, Winkler JR & Su Y (2020) The computation of the degree of the greatest common divisor of three Bernstein basis polynomials. Journal of Computational and Applied Mathematics, 373. Winkler JR & Mitrouli M (2020) Condition estimation for regression and feature selection. Journal of Computational and Applied Mathematics, 373. View this article in WRRO Bourne M, Winkler J & Su Y (2020) The computation of multiple roots of a Bernstein basis polynomial. SIAM Journal on Scientific Computing, 42(1), A452-A476. View this article in WRRO Winkler JR & Halawani H (2018) The Sylvester and Bézout Resultant Matrices for Blind Image Deconvolution. Journal of Mathematical Imaging and Vision, 60(8), 1284-1305. Bourne M, Winkler JR & Su Y (2017) A non-linear structure-preserving matrix method for the computation of the coefficients of an approximate greatest common divisor of two Bernstein polynomials. Journal of Computational and Applied Mathematics, 320, 221-241. View this article in WRRO Winkler JR, Bourne M & Yi S (2016) The computation of the degree of an apprixmate greatest common divisor of two Bernstein polynomials. Applied Numerical Mathematics, 111, 17-35. Winkler JR (2014) Structured matrix methods for the computation of multiple roots of a polynomial. Journal of Computational and Applied Mathematics, 272, 449-467. View this article in WRRO Winkler JR & Yang N (2014) A structure-preserving matrix method for the deconvolution of two Bernstein basis polynomials. Computer Aided Geometric Design. Winkler JR & Yang N (2013) Resultant matrices and the computation of the degree of an approximate greatest common divisor of two inexact Bernstein basis polynomials. Computer Aided Geometric Design, 30(4), 410-429. Winkler JR & Hasan M (2013) An improved non-linear method for the computation of a structured low rank approximation of the Sylvester resultant matrix. Journal of Computational and Applied Mathematics, 237(1), 253-268. Winkler JR, Lao X & Hasan M (2012) The computation of multiple roots of a polynomial. Journal of Computational and Applied Mathematics. Winkler JR, Hasan M & Lao X (2012) Two methods for the calculation of the degree of an approximate greatest common divisor of two inexact polynomials. Calcolo, 49(4), 241-267. Winkler JR & Lao X (2011) The calculation of the degree of an approximate greatest common divisor of two polynomials. J COMPUT APPL MATH, 235(6), 1587-1603. Winkler JR & Hasan M (2010) A non-linear structure preserving matrix method for the low rank approximation of the Sylvester resultant matrix. J COMPUT APPL MATH, 234(12), 3226-3242. Winkler JR (2008) A unified approach to resultant matrices for Bernstein basis polynomials. COMPUT AIDED GEOM D, 25(7), 529-541. Winkler JR & Allan JD (2008) Structured total least norm and approximate GCDs of inexact polynomials. J COMPUT APPL MATH, 215(1), 1-13. Winkler JR & Allan JD (2008) STRUCTURED LOW RANK APPROXIMATIONS OF THE SYLVESTER RESULTANT MATRIX FOR APPROXIMATE GCDS OF BERNSTEIN BASIS POLYNOMIALS. ELECTRON T NUMER ANA, 31, 141-155. Winkler JR (2006) High order terms for condition estimation of univariate polynomials. SIAM J SCI COMPUT, 28(4), 1420-1436. Winkler JR (2006) The numerical condition of univariate and bivariate degree elevated Bernstein polynomials. J COMPUT APPL MATH, 191(1), 32-49. Winkler JR (2005) Backward errors and condition numbers of regular and singular points on algebraic curves. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 3604 LNCS, 413-433. Bini DA, Gemignani L & Winkler JR (2005) Structured matrix methods for CAGD: An application to computing the resultant of polynomials in the Bernstein basis. NUMERICAL LINEAR ALGEBRA WITH APPLICATIONS, 12(8), 685-698. Winkler JR (2004) The transformation of the companion matrix resultant between the power and Bernstein polynomial bases. APPL NUMER MATH, 48(1), 113-126. Winkler JR (2003) A companion matrix resultant for Bernstein polynomials. Linear Algebra and Its Applications, 362, 153-175. Winkler JR (2003) A statistical analysis of the numerical condition of multiple roots of polynomials. COMPUT MATH APPL, 45(1-3), 9-24. Rees JM, Staszewski WJ & Winkler JR (2001) Case study of a wave event in the stable atmospheric boundary layer overlying an Antarctic Ice Shelf using the orthogonal wavelet transform. DYNAMICS OF ATMOSPHERES AND OCEANS, 34(2-4), 245-261. Winkler JR (2001) Condition numbers of a nearly singular simple root of a polynomial. APPL NUMER MATH, 38(3), 275-285. Winkler JR (2001) A note on the backward error of the roots of polynomials.. Neural Parallel Sci. Comput., 9, 91-96. Winkler JR (2001) A comparison of the average case numerical condition of the power and bernstein polynomial bases. International Journal of Computer Mathematics, 77(4), 583-602. Winkler JR (2000) A resultant matrix for scaled Bernstein polynomials. LINEAR ALGEBRA APPL, 319(1-3), 179-191. Winkler JR (1999) Backward error analysis of the roots of polynomials. Neural, Parallel and Scientific Computations, 7, 463-486. Winkler JR (1997) An ill-conditioned problem in computer aided geometric design. Neural, Parallel & Scientific Computations, 5(1-2), 179-200. Winkler JR (1997) Polynomial basis conversion made stable by truncated singular value decomposition. APPL MATH MODEL, 21(9), 557-568. Winkler JR (1997) Tikhonov regularisation in standard form for polynomial basis conversion. APPL MATH MODEL, 21(10), 651-662. Winkler JR (1996) Singular projective transformation matrices. APPL MATH MODEL, 20(10), 771-778. WINKLER JR & DAVIES JB (1986) ACCURATE FIELD ANALYSIS OF THE PROPAGATION OF ELASTIC-WAVES THROUGH AN ACOUSTIC MICROSCOPE .1. THEORY. IEEE T ULTRASON FERR, 33(6), 644-656. WINKLER JR & DAVIES JB (1986) ACCURATE FIELD ANALYSIS OF THE PROPAGATION OF ELASTIC-WAVES THROUGH AN ACOUSTIC MICROSCOPE .2. RESULTS. IEEE T ULTRASON FERR, 33(6), 657-668. WINKLER JR & DAVIES JB (1984",
  "content_length": 14851,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:28"
}