{
  "name": "Joachim Hertzberg",
  "homepage": "http://www2.inf.uni-osnabrueck.de/hertzberg",
  "status": "success",
  "content": "Joachim Hertzberg School of Mathematics/Computer Science — Institute of Computer Science — Knowledge-Based Systems Research Group Prof. Dr. Joachim Hertzberg Joachim Hertzberg Professional CV Publications Courses Theses Projects Job Offers Address: Osnabrück University Institute of Computer Science Wachsbleiche 27 Room: 50/606 49090 Osnabrück (Use above address (including street and room number!!!) when sending express mail!) (Use UOS's bulk post code 49069 for sending regular paper mail.) Fon: (0|+49) 541/969-2622 Fax: (0|+49) 541/969-2799 E-mail: click here! Office Hour: Tue 10-11, plus whenever my office door is open, plus by e-mail appointment. Fields of interest: Artificial Intelligence Autonomous mobile robots Action planning Plan-based robot control Sensor data interpretation Semantic mapping Robotics in agriculture I am heading the Knowledge-Based Systems Research Group (KBS). I have a secondary affiliation (Kooptierung) with the Institute of Cognitive Science. I am also affiliated with the German Research Center for Artificial Intelligence (DFKI), heading the research group on Plan-Based Robot Control and serving as the speaker of the DFKI Lab Niedersachsen at Osnabrück and Oldenburg. My recent public research community services (committee memberships, editorships etc.) are listed here. Note for students from abroad: We offer no internships! PhD student applications make no sense unless you have a strong(!) proven(!) background in AI and Robotics! Otherwise, unsolicited applications will not be answered. News Stack [Apr 25, 2019] Jan H. Schoenke has finished his PhD exam. His thesis Algorithms for Scalable On-line Machine Learning on Regression Tasks is online [UOS repOSitorium publication]. [Feb 28, 2018] Sven Albrecht has finished his PhD exam. His thesis Transparent Object Reconstruction and Registration Confidence Measures for 3D Point Clouds based on Data Inconsistency and Viewpoint Analysis is online [UOS repOSitorium publication]. [Mar 17, 2017] Sebastian Stock has finished his PhD exam. His thesis Hierarchische hybride Planung für mobile Roboter is online [UOS repOSitorium publication]. [Jul 22, 2016] Wolfram Strothmann has finished his PhD exam; this was a cooperative PhD project with Prof. Arno Ruckelshausen's group at Univ. Applied Sciences Osnabück. [UOS repOSitorium publication] [Jul 11, 2016] The Computer Science institute has moved into its new building Wachsbleiche 27. Note the address change! [Aug 20, 2015] Thomas Schüler's dissertation Abstrakte virtuelle Illusionen für die Schlaganfalltherapie, finished in the KBS group in 11/2014, has appeared as a monograph at Springer/Vieweg. [Web page at Springer] [Jun 10, 2015] I was appointed member of the Advisory Board (Wissenschaftlich-technischer Beirat) of the Forschungsstelle RobotRecht (research unit robot law) of the University of Würzburg. [board Web page] Olds (News significantly older than a year) are here. Joachim Hertzberg Professional CV Publications Courses Theses Projects Job Offers Last changed: Apr 16, 2019",
  "content_length": 3046,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:29"
}