{
  "name": "Joachim Hornegger",
  "homepage": "https://lme.tf.fau.de/person/joachim-hornegger",
  "status": "success",
  "content": "Joachim Hornegger - Pattern Recognition Lab Simulate organization breadcrumb open Simulate organization breadcrumb close Friedrich-Alexander-Universität Pattern Recognition Lab PRL Joachim Hornegger Joachim Hornegger Prof. Dr.-Ing. Joachim HorneggerProf. Dr. Joachim Hornegger, Präsident der Friedrich-Alexander-Universität Erlangen-Nürnberg (Bild: FAU/Thomas Einberger)Department of Computer ScienceLehrstuhl für Informatik 14 (Bild- und Sprachverarbeitung)Room: Room 09.138Martensstrasse 391058 ErlangenPhone number: +49 9131 85-27775Fax number: +49 9131 85-27270Email: praesident@fau.deWebsite: https://lme.tf.fau.de/person/joachim-hornegger/ Academic CV Prof. Dr.-Ing. Joachim Hornegger graduated in Theoretical Computer Science/Mathematics (1992) and received his Ph.D. degree in Applied Computer Science (1996) at the University of Erlangen-Nuremberg (Germany). His Ph.D. thesis was on statistical learning, recognition, and pose estimation of 3D objects. Joachim was an assistant professor at the University of Erlangen-Nuremberg (1996/97), a visiting scientist at the Technion (Haifa, Israel), a visiting scholar at the Massachusetts Institute of Technology (Cambridge, MA, USA), and a visiting scholar and lecturer at Stanford University (Stanford, CA, USA) in the academic year 1997/98. In 1998 he joined Siemens Medical Solutions Inc., where he was working on 3D angiography. In Nov. 2001 Joachim was promoted to director of medical image processing, and in March 2003 director of imaging systems. In parallel to his responsibilities in industry he was a lecturer at the Universities of Erlangen (1998-1999), Eichstaett-Ingolstadt (2000), and Mannheim (2000-2003). Joachim is the author and coauthor of more than 50 scientific publications including a monography on applied pattern recognition and a book on statistical object recognition. Besides his education in computer science, in 2003 Joachim also achieved a diploma in Advanced Management (Cross Functional and General Management, Entrepreneurship, Accounting and Controlling) from the Fuqua School of Business (Duke University, NC, USA) and Siemens. In Oct. 2003 Joachim became Professor of Medical Image Processing at the University of Erlangen-Nuremberg, and since Oct. 2005 he is a chaired professor heading the Chair of Pattern Recognition. His main research topics are currently medical image processing, medical vision, image registration, sensor data fusion, and digital sports. Prof. Joachim Hornegger is a member of the Chief Organization Committee of the Max-Planck-Research School on Optics and Imaging, the Erlangen Graduate School in Advanced Optical Technologies, SFB 532 (project lead), SFB 603 (project lead), IEEE Computer Society, GI. Projects 2014 Magnetresonanz am Herzen (Third Party Funds Single) Term: March 1, 2014 - June 30, 2017Funding source: Siemens AG →More information 2013 Bewegungskompensation für Überlagerungen in der interventionellen C-Bogen Bildgebung (Third Party Funds Single) Term: June 1, 2013 - November 30, 2016Funding source: Siemens AG →More information 2012 RTG 1773: Heterogeneous Image Systems (Third Party Funds Group – Overall project) Term: October 1, 2012 - March 31, 2017Funding source: DFG / Graduiertenkolleg (GRK) Abstract Systeme zur Verarbeitung, Erzeugung und übertragung digitaler Bilder (Bildsysteme) unterliegen sehr oft harten Anforderungen an Rechenleistung, Latenz, Durchsatz und Kosten. Typische Beispiele sind die medi-zinische Bildverarbeitung, Computerspiele oder die Videokompression in Camcordern. Um diese Anforde-rungen zu erfüllen, werden oft dedizierte Hardware-Beschleuniger eingesetzt als auch Grafikprozessoren (GPUs) oder digitale Signalprozessoren (DSPs). Die entstehenden Bildsysteme sind in zweierlei Hinsicht heterogen. Zum einen ist innerhalb eines Systems die Berechnung auf mehrere verschiedenartige Kompo-nenten verteilt, zum anderen gibt es eine große, heterogene Menge an Architekturen, auf denen unter-schiedliche Bildanwendungen laufen können und sollen. Beide Arten von Heterogenität führen nun zu sehr interessanten und wichtigen Forschungsfragestellungen, die in dem Graduiertenkolleg erforscht werden sollen. Dies betrifft im Wesentlichen drei Bereiche: dedizierte Hardware-Architekturen für Bildsysteme, Werkzeuge und Methoden für die Programmierung heterogener Bildsysteme, sowie Anwendungen und Algorithmen für heterogene Bildsysteme. Bildsysteme haben in Forschung und Praxis eine große Bedeutung. Ihre Planung, Entwicklung und Reali-sierung erfordert themenübergreifendes und interdisziplinäres Wissen zu Soft- und Hardware, Methoden- und Werkzeugentwurf, sowie zur Algorithmenentwicklung. Das Thema eignet sich daher hervorragend für ein Graduiertenkolleg, gerade am Standort Erlangen. Die Doktoranden des Kollegs erhalten in ihrem Studi-enprogramm eine breit gefächerte Ausbildung, die anschließend in der Dissertation in speziellen Problem-stellungen vertieft wird. Postdoktoranden mit größerem fachlichen überblick bilden eine fachliche Klammer. Sie qualifizieren sich interdisziplinär, sammeln aber vor allem auch Lehrerfahrung. Die bereits bestehende tiefe Verankerung der Thematik in der Lehre ermöglicht die Einbeziehung begabter Studenten in das For-schungsprogramm. Schließlich bietet Erlangen ein industrielles Umfeld, das durch eine direkte Beteiligung am Graduiertenkolleg wichtige Impulse für die Forschung liefern wird, aber auch von neuen Ideen aus dem Graduiertenkolleg sowie hochqualifizierten Absolventen profitieren wird. →More information 2011 miLife - an innovative wearable computing platform for data analysis of wearable sensors to be used in team sports and health (Third Party Funds Single) Term: August 1, 2011 - October 31, 2014Funding source: Bayerisches Staatsministerium für Wirtschaft, Infrastruktur, Verkehr und Technologie (StMWIVT) (bis 09/2013) Abstract Body Sensor Networks are getting more and more important in sports and health. Currently, various isolated applications exist that use body sensors to assist athletes and monitor elderly people. Systems like the adidas miCoach and Nike+ prove the potential of information and communication engineering technology for manufacturers of sports equipment. The perfect product for a leading position in this market would be a central, flexible and generic wearable computing platform instead of isolated applications. To facilitate such a solution, sensors integration in clothing and sports equipment and data analysis capabilities have to be substantially advanced. Additionally, to succeed on the market, new communication and sensor technologies as well as innovative applications have to be developed. The goal of the project is to bundle and enhance the expertise of the project partners in the described field to develop innovative products. The existing miCoach platform will be the basis for a comprehensive communication and application platform for body sensor network data called \"miLife\". This platform will provide flexible sensor connection, data analysis and social networking capabilities for applications in team sports, exercise motivation and health monitoring. →More information 2010 Open Access Publishing (Third Party Funds Single) Term: January 1, 2010 - December 31, 2019Funding source: DFG-Einzelförderung / Sachbeihilfe (EIN-SBH) Abstract Um ihre Angehörigen bei der Veröffentlichung von Open-Access-Zeitschriftenartikeln zu unterstützen, möchte die Universität Erlangen-Nürnberg einen Publikationsfonds etablieren. über die Anschubfinanzierung der DFG soll so eine verlässliche Struktur zur Finanzierung von Publikationskosten geschaffen werden. Aus dem Fonds können Gebühren für die Veröffentlichung von Artikeln in originären, qualitätsgeprüften Open-Access-Zeitschriften übernommen werden. Begleitende Maßnahmen im organisatorischen, technischen und rechtlichen Bereich stellen sicher, dass Wissenschaftler und Wissenschaftlerinnen ein wirklicher Service für die Bereitstellung ihrer Forschungsergebnisse im Open Access geboten wird. →More information 2008 Zukunftsorientierte Produkte und Dienstleistungen für die demographischen Herausforderungen (Third Party Funds Group – Overall project) Term: August 1, 2008 - April 30, 2011Funding source: Bayerische Forschungsstiftung Abstract Die alternde Gesellschaft und die damit verbundene demographische Entwicklung stellen eine der größten Herausforderungen des 21. Jahrhunderts dar. Um die daraus entstehenden Probleme zu meistern, besteht unmittelbarer Handlungsbedarf für Wirtschaft, Politik und Wissenschaft. Im von der Bayerischen Forschungsstiftung geförderten Verbund »FitForAge« ist es gelungen, ein Team von hochmotivierten und kompetenten Partnern aus Industrie, Forschung und Universitäten zu bündeln. Ziel des Forschungsverbundes ist es, technische Lösungsansätze zu finden, die den alternden Menschen in Wohnung und Haus, im Arbeitsleben wie in der Kommunikation mit der Umwelt und im Verkehr ein aktives und bezahlbares Leben erhalten, auch wenn das durchschnittliche Alter der Bevölkerung weiter zu- und gleichzeitig die Zahl der arbeitsfähigen, jüngeren Menschen abnimmt. Letztendlich sollen nicht nur ältere Menschen, sondern alle Altersgruppen der Gesellschaft von den Lösungen profitieren. Im Forschungsverbund werden konkrete Ergebnisse, aber auch ein Instrumentarium an Methoden angestrebt, das über die realisierten Lösungen und Nutzerkreise hinaus Anwendung finden kann. →More information Publications 2023 Authored Books Hornegger J.:AI Makes Medicine More Efficient, Individual and PreventiveSpringer Fachmedien Wiesbaden, 2023ISBN: 9783658402327DOI: 10.1007/978-3-658-40232-7_33BibTeX: Download 2019 Journal Articles Lu Y., Kowarschik M., Huang X., Xia Y., Choi JH., Chen S., Hu S., Ren Q., Fahrig R., Hornegger J., Maier A.:A learning-based material decomposition pipeline for multi-energy x-ray imagingIn: Medical Physics 46 (2019), p. 689-703ISSN: 0094-2405DOI: 10.1002/mp.13317BibTeX: Download Ghesu FC., Georgescu B., Zheng Y., Grbic S",
  "content_length": 297395,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:30"
}