{
  "name": "Joachim Weickert",
  "homepage": "http://www.mia.uni-saarland.de/weickert/index.shtml",
  "status": "success",
  "content": "Joachim Weickert, Professor, Mathematical Image Analysis Group, Saarland University Office Hour: Tuesday, 14:15-15:15 (please send e-mail for online appointments) Phone: +49-681-302-57340 Secretariat: +49-681-302-57341 (Andrea Kreutzer) Fax: +49-681-302-57342 E-Mail: weickert -at- mia.uni-saarland.de (please replace anti-spam -at- by @) Address: Faculty of Mathematics and Computer Science Saarland University, Campus E1.7 66041 Saarbrücken, Germany Office: Room 4.23 (Building E1.7, Saarbrücken Campus, visitor information) WWW: https://www.mia.uni-saarland.de/weickert/index.shtml Joachim Weickert is professor of mathematics and computer science at Saarland University where he heads the Mathematical Image Analysis Group since 2001. He received a diploma and a Ph.D. degree in mathematics from the University of Kaiserslautern (1991, 1996), and a habilitation degree in computer science from the University of Mannheim (2001). He worked as research assistant at the University of Kaiserslautern, as post-doctoral researcher at the universities of Utrecht and Copenhagen, and as assistant professor at the University of Mannheim. Joachim Weickert performs research in image processing, computer vision and scientific computing, focussing on techniques based on partial differential equations, variational principles, wavelets, morphological and nonlocal methods, as well as neuroexplicit approaches. He has developed mathematical models and efficient numerical algorithms for image restoration, enhancement, segmentation, compression, optic flow computation, stereo reconstruction, shape from shading, as well as signal processing methods for tensor fields. These ideas have entered a number of applications in industry, biomedical image analysis, and other fields. The scientific work of Joachim Weickert covers more than 350 publications. He has been editor-in-chief of the Journal of Mathematical Imaging and Vision and has served in the editorial boards of ten international journals and book series. Joachim Weickert has been reviewer for more than 70 journals and 20 funding organisations and has given over 190 invited talks at conferences, workshops and other universities. He has received 35 research, teaching and reviewer awards, including a Gottfried Wilhelm Leibniz Prize which is considered the most important research award in Germany. In 2017 he has been awarded an ERC Advanced Grant for Inpainting-based Compression of Visual Data. He is elected member of the Academia Europaea - The Academy of Europe. At Saarland University, Joachim Weickert has initiated a Master Programme in Visual Computing, which is the first of its kind in Germany and uses English as language of instruction. He has supervised more than 250 bachelor or master theses. Joachim Weickert has established many interdisciplinary collaborations with colleagues from medicine, bioinformatics, pharmacy, physics, mechatronics, and mechanical engineering. He was Principal Investigator for Visual Computing within the Multimodal Computing and Interaction Cluster of Excellence, and he served in the Steering Committee of the Intel Visual Computing Institute. From 2008 to 2010, he was dean of the Faculty of Mathematics and Computer Science. Some Recent or Forthcoming Activities: An Innovative Study Program Mathematics and Computer Science (integrated degree master program) Teaching Differential Equations in Image Processing and Computer Vision Seminar: Inpainting-based Image Compression Mathematical Image Analysis Group Seminar (Oberseminar) Information for Prospective Students If you have enjoyed the classes of our group and consider writing your thesis with us, here is some information for prospective students. Editorial Boards Computational Imaging and Vision (2016-present) Electronic Letters on Computer Vision and Image Analysis (2002-2014) Foundations and Trends in Computer Graphics and Vision (2003-present) IEEE Transactions on Pattern Analysis and Machine Intelligence (2005-2009) International Journal of Computer Vision (2003-present) Inverse Problems and Imaging (2006-present) Journal of Mathematical Imaging and Vision (2007-2011, Editor-in-Chief: 2011-2022) Journal of Visual Communication and Image Representation (2009-present) Logic Journal of the IGPL (2008-present) SIAM Journal on Imaging Sciences (2014-2022) Ten Selected Publications J. Weickert: Anisotropic Diffusion in Image Processing. Teubner, Stuttgart, 1998. Cited more than 3700 times. More information and free download. J. Weickert, B.M. ter Haar Romeny, M.A. Viergever: Efficient and reliable schemes for nonlinear diffusion filtering. IEEE Transactions on Image Processing, Vol. 7, No. 3, 398-410, March 1998. Cited more than 1700 times. T. Brox, A. Bruhn, N. Papenberg, J. Weickert: High accuracy optical flow estimation based on a theory for warping. In T. Pajdla, J. Matas (Eds.): Computer Vision - ECCV 2004. Lecture Notes in Computer Science, Vol. 3024, Springer, Berlin, 25-36, 2004. Awarded the 2004 ECCV Longuet-Higgins Prize and the 2014 Jan Koenderink Prize for Fundamental Contributions in Computer Vision. Cited more than 3700 times. G. Steidl, J. Weickert, T. Brox, P. Mrázek, M. Welk: On the equivalence of soft wavelet shrinkage, total variation diffusion, total variation regularization, and SIDEs. SIAM Journal on Numerical Analysis, Vol. 42, No. 2, 686-713, 2004. Shortened version of Technical Report No. 94, Dept. of Mathematics, Saarland University, Saarbrücken, Germany, August 2003. A. Bruhn, J. Weickert, T. Kohlberger, C. Schnörr: A multigrid platform for real-time motion computation with discontinuity-preserving variational methods. International Journal of Computer Vision, Vol. 70, No. 3, 257-277, December 2006. I. Galić, J. Weickert, M. Welk, A. Bruhn, A. Belyaev, H.-P. Seidel: Image compression with anisotropic diffusion. Journal of Mathematical Imaging and Vision, Vol. 31, 255–269, 2008. C. Schmaltz, P. Gwosdek, A. Bruhn, J. Weickert: Electrostatic halftoning. Computer Graphics Forum, Vol. 29, No. 8, 2313-2327, December 2010. Revised version of Technical Report No. 260, Department of Mathematics, Saarland University, Saarbrücken, Germany, February 2010. See also: Supplementary Material Webpage. J. Weickert, S. Grewenig, C. Schroers, A. Bruhn: Cyclic schemes for PDE-based image analysis. International Journal of Computer Vision, Vol. 118, No. 3, 275-299, July 2016. Also available as Technical Report No. 327 (revised), Department of Mathematics, Saarland University, Saarbrücken, Germany, April 2015. M. Welk, J. Weickert: PDE evolutions for M-smoothers in one, two, and three dimensions. Journal of Mathematical Imaging and Vision, Vol. 42, No. 2, 157-185, February 2021. Also available as arXiv:2007.13191 [eess.IV], July 2020. T. Alt, K. Schrader, M. Augustin, P. Peter, J. Weickert: Connections between numerical algorithms for PDEs and neural networks. Journal of Mathematical Imaging and Vision, Vol. 65, 185-208, 2023. For additional publications, please check out the full publication list. Publications Talks Reviewing Awards",
  "content_length": 7068,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:32"
}