{
  "name": "Joachim M. Buhmann",
  "homepage": "http://www.ml.inf.ethz.ch",
  "status": "success",
  "content": "Homepage – Institute for Machine Learning | ETH Zurich Homepage Navigation Search Content Footer Contact Sitemap Main content Institute for Machine Learning We are dedicated to learning and inference of large statistical models from data. Our focus includes optimization of machine learning models, validation of algorithms and large scale data analytics. Data driven scientific modeling permeates all areas of natural science, engineering, social science and more recently also humanities. The resulting methodological challenges strongly suggest to combine high performance algorithmics and cutting edge statistical modeling. Applications range from medicine and the life sciences to distributed sensing and natural language processing. The institute includes ten research groups: Computational genetics and epigenetics of cancer (Prof. Valentina Boeva) external page Rycolab (Prof. Ryan Cotterell) Optimization and Decision Intelligence Group (Prof. Niao He) Data Analytics (Prof. Thomas Hofmann) Learning and Adaptive Systems (Prof. Andreas Krause) Biomedical Informatics (Prof. Gunnar Rätsch) Learning Reasoning and Education Lab (Prof. Mrinmaya Sachan) external page Machine learning and causal inference (Prof. Bernhard Schölkopf) Medical Data Science (Prof. Julia Vogt) Statistical Machine Learning (Prof. Fanny Yang) The institute administrates the external page Max Planck ETH Center for Learning Systems Additional Information Machine learning (ML) -- the pursuit of computational methods for making predictions and decisions from data -- plays a central role in our information society. Read more Contact ETH ZurichDept of Computer Science Institute for Machine Learning Universitaetstrasse 6 Building CAB, floors E/F/G 8092 Zurich Schweiz Show more Show less JavaScript has been disabled in your browser",
  "content_length": 1816,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:33"
}