{
  "name": "Joanne F. Selinski",
  "homepage": "http://www.cs.jhu.edu/~joanne",
  "status": "success",
  "content": "Joanne Selinski J O A N N E   (HOULAHAN)   S E L I N S K I   PhD Teaching Professor Director of Undergraduate Studies Associate Head for Education (CS) Department of Computer Science Johns Hopkins University Malone 225 410-516-4117 joanne -at- cs.jhu.edu pronouns: she/her/hers COMPUTER SCIENCE DEPARTMENT FACULTY NEWS & EVENTS UNDERGRADUATE STUDIES WHITING SCHOOL OF ENGINEERING JOHNS HOPKINS UNIVERSITY CS Department Student Info Computer science undergraduate students are supported by multiple people currently. Collectively we answer emails and meet with students or faculty to answer questions related to computer science undergraduate programs. Lyn, Abby and Joanne are points of contact for declaring a CS major/minor. You can reach us with questions or to make an appointment through advising -at- cs.jhu.edu. Kelly is our department liason from the Office of Engineering Advising. Our pronouns are she/her/hers. See below for office hour details. Joanne Selinski, Director of Undergraduate Studies & Associate Head for Education (CS faculty) Lyn Doan, Sr. Academic Program Coordinator (CS staff) Abby Fanara, Sr. Academic Program Coordinator (CS staff) Kelly Barnhart, Academic Adviser (WSE staff) Declared CS second majors and minors in need of CS-specific faculty mentoring are welcome to email Prof. Joanne Selinski and Prof. Sara More jointly with your questions or for an appointment. Students interested in declaring a CS major or minor will need to Submit a major/minor change/declaration request form on SIS (“Registration” > “Online Forms” > “Add a Major or Minor\") If you are changing your first major from KSAS to WSE, you will then need to meet with Engineering Advising to get a new academic advisor. Complete a 4-year plan to demonstrate how you will meet the requirements alongside any other majors/minors you have using one of the CS major worksheets in the first section of our majors advising page, the CS minor worksheet Meet with one of Joanne, Lyn or Abby to review your plan and get departmental approval. Your professional academic advisor will then need to provide the final approval step online. Contact them if there seems to be a delay after meeting with one of us. Please visit the links below and to the left for information regarding academics, courses and activities in the department. Feel free to drop by office hours with questions or to simply chat about anything going on. Undergraduate Academics & Advising HopHacks - our biannual hackathon Account forms: Declared majors/minors needing a CS account form signed should simply email it to support -at- cs.jhu.edu and they'll take care of it. Course Assistants: Application, Training Document (requires JHU authentication for access) Departmental Course Information Office Hours See the table and notes below for CS department office hour information. If attending drop-in office hours in person, please wait quietly in the hallway until it is your turn. If on zoom, you'll join a virtual waiting room and be invited in when it's your turn. If you can't meet with any of us during our pre-scheduled office hours, please email advising -at- cs.jhu.edu to request an appointment, including the purpose of the appointment and possible times in the Mon-Fri 9a-6p timeframe. Office of Engineering Advising drop-in hours schedule is posted here. Thanksgiving Week: no drop-in hours for Joanne, limited availability for Lyn and Abby. Joanne's hours will be by appointment only starting in December, through to the start of the Spring semester. Fall 2025MondayTuesdayWednesdayThursdayFriday Lyn's Hours - sign up for a time slot here9:30-11:30a 2:00-4:00pby apptby appt 1:00-3:00p Abby's Hours - drop-in hours listed or email for appointmentby appt by apptby appt11:30-12:30, zoomby appt Joanne's Hours - email for appointment by apptn/aby apptby apptby appt Teaching Current and recent courses (on Blackboard/Piazza/Gradescope): EN.500.112 Gateway Computing: JAVA EN.601.220 Intermediate Programming EN.601.226 Data Structures EN.601.290 User Interfaces and Mobile Applications Here are a few pages to help with learning common software development tools for use in our courses: Unix tutorial FAQ for using JHU CS undergrad unix accounts Git overview Checkstyle overview JUnit overview VirtualBox/Lubuntu installation Undergraduate Ethics Policies Academic Interests Please note that I do not admit, advise or supervise graduate students in any way. Computer Science Education -> please join our mailing list Software Engineering Graph Theory & Algorithms Education: 1996: Ph.D. in Computer Science, Johns Hopkins University Dissertation: \"Sandwich Networks for Conferencing\" 1986: M.S.E. in Electrical Engineering & Computer Science, Johns Hopkins University 1984: B.S. in Mathematics, Chestnut Hill College, Philadelphia, PA Mailing Address: 160 Malone Hall 3400 N. Charles St Baltimore, MD 21218 Dept Office: 410-516-8775 Dept Fax: 410-516-6134 Zoom Room: jselinski",
  "content_length": 4956,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:40"
}