{
  "name": "Joanna McGrenere",
  "homepage": "http://www.cs.ubc.ca/~joanna",
  "status": "success",
  "content": "Joanna McGrenere JoannaMcGrenere She, Her, Hers Professor & Co-Head | Computer Science University of British Columbia joanna@cs.ubc.ca Copied ICICS/CS X665 (Directions) 604 827-5201 201-2366 Main Mall Dept. of Computer Science University of British Columbia Vancouver, B.C., V6T 1Z4 Canada My Calendar Research My research is in Human-Computer Interaction, with a particular focus on the following areas: Personalized User Interfaces Universal Usability Interactive Technologies for Older Adults Computer Supported Cooperative Work Qualitative and Quantitative Methodologies More details, including, publications can be found on my group's website. eDapt Website Teaching As Co-Head of the Department of Computer Science, I am not currently teaching. I have typically taught courses on Human-Computer Interaction (HCI), at both the undergrad and graduate level, as well as first year introduction to computation and programming. Most recently I have taught: 2019 to 2023: CPSC 110- first year undergrad course on Computation, Programs, and Programming CPSC 444- fourth year undergrad course in Advanced HCI Methods CPSC 544- graduate course in HCI on the Fundamentals of Designing Interactive Computational Technology for People (DFP) Full details can be found starting on page 2 of my CV. Presenting the best student paper award at ASSETS 2018 Service Research Community: I am a member of the editorial board for ACM Transactions on Computer-Human-Interaction (ToCHI), ACM Transactions on Accessible Computing (TACCESS), and Communications of the ACM Research Highlights. I recently served as the Technical Program Co-Chair for ACM CHI 2020 and the Program Chair for ACM ASSETS 2018. Department of Computer Science and UBC: In addition to serving as Co-Head of the department, I recently served on the Dean’s Advisory Committee on Promotion and Tenures (DACOPAT) and CS’s Peer Teaching Evaluation. I was also the Chair for CS’s inaugural Committee on Outreach Diversity and Equity (CODE) and the Associate Head of CS’s Graduate Program. Full details can be found on page 16 of my CV. Biography Joanna McGrenere is a Co-Head and Professor in the Department of Computer Science at the University of British Columbia (UBC, Canada) and recently completed a five year Inria & Université of Paris Saclay International Research Chair (France). Joanna received a PhD from the University of Toronto in 2002, an MSc from UBC in 1996, and a BSc from Western University in 1993, all in Computer Science. Her broad research area is Human Computer Interaction (HCI), with a specialization in interface personalization, universal usability, assistive technology, and computer supported cooperative work. Joanna often serves on the program and organizing committees for the top conferences in HCI, including serving as the overall Technical Program Co-Chair for CHI 2020, the Program Co-Chair for ASSETS 2018, and the Papers Co-Chair for CHI 2015. She is an elected member of the ACM SIGCHI Academy (2025), won a UBC Killam Research Prize (2024), is an ACM Distinguished Member (2022) and an elected Member of the College of New Scholars in the Royal Society of Canada (2017), earned a Microsoft Research Software Engineering Innovation Foundation award (2013), a UBC Killam award for Excellence in Mentoring (2012), an Outstanding Young Computer Science Research Award from the Canadian Association of Computer Science (2011), was appointed as a Peter Wall Institute for Advanced Studies Early Career Scholar (2010), and was the first recipient of the Computing Research Association Women (CRA-W) Anita Borg Early Career Scholar Award (2004). Joanna is a member of the editorial board for ACM Transactions on Computer-Human-Interaction (ToCHI) and ACM Transactions on Accessible Computing (TACCESS). Joanna kickstarted and led the HCI@UBC initiative: an interdisciplinary meeting for scholars working in the area of Human-Computer Interaction across UBC campus (2013-15) which has been rebranded as the Designing for People (DFP) initiative (2016 - 2024). She served as Curriculum Lead for the NSERC CREATE DFP graduate enrichment program (2017- 2024). DFP was recognized as a top research cluster at UBC. CV embed google map Directions I am located in the X-wing of the ICICS/CS Building on UBC campus. The main address from the ICICS/CS building is 2366 Main Mall. If you enter from this address, follow the signs to the X-wing, then take the south elevator to the 6th floor. My office is X665. The most direct way to get to my office is to enter the X-wing from street level (X-wing is it's own building, connected by walkways to the old building). The entrance is at the corner of Engineering Road and Agronomy Road, then take the south elevator to the 6th floor. The interactive Google map shows the Engineering and Agronomy roads. The closest parking is in the Health Sciences Parkade.",
  "content_length": 4886,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:37"
}