{
  "name": "Joan Daemen",
  "homepage": "https://cs.ru.nl/~joan",
  "status": "success",
  "content": "Joan Daemen Homepage Home Projects Research Papers Contact About me Since March 2015, I am full professor symmetric cryptography at Radboud University Nijmegen in the Digital Security (DiS) Group and since September 2018 this has become my full-time job. Currently I'm head of the DiS group. Until October 2018, I worked near Brussels, Belgium as a security architect and cryptographer for STMicroelectronics (2003-2018), previously Proton World (1998-2003), previously Banksys (1996-1998), all that time in the security engineering group led by Yves Moulart. Before that I worked shortly at Bacob Bank (1996) in Brussels as a security architect and I spent one year in IT support at J&J (1995-1996) on the Janssen site in Beerse, Belgium. I did a PhD on the design of symmetric cryptography at COSIC in Leuven from 1988 until 1995. Grants Early 2018 I was awarded an ERC advanced grant for my research proposal ESCADA on the foundations of security in symmetric crypto. This has started in October 2018 and ended in September 2024. With Bart Mennink, then Radboud, now Universiteit Maastricht, I have received mid 2018 an NWO TOP grant for our research proposal related to the design of symmetric crypto optimally exploiting available multipliers. This project has started in August 2019 and ended in February 2024. Additionally I received some funding from industry for a project on lightweight cryptography and one on low-latency crypto and I'm part of some consortia leading to some more PhD students. PhD students and postdocs My PhD students: Jan Schoone: ESCADA, design and analysis of symmetric cryptography, co-supervised by Wieb Bosma of IMAPP, Radboud. Jonathan Fuchs: ESCADA, design and analysis of symmetric cryptography. Koustabh Ghosh: SCALAR, design of symmetric crypto optimally exploiting available multipliers. Solane El Hirch: analysis and design of lightweight symmetric cryptography, co-supervised by Silvia Mella. Mohammed Rachidi (external PhD at Tii, UAE): cryptanalysis of lightweight symmetric cryptography, co-supervised by Emanuele Bellini of Tii, UAE. Cas Korporaal: PROACT, integrated design and cryptanalysis, co-supervised by Bernd Souvignier of IMAPP, Radboud. Bart van Vulpen: CICS, design and analysis of high-throughput symmetric cryptography, co-supervised by Bart Mennink, Universiteit Maastricht. Rusydi Makarim (external PhD with own funding): design and analysis of lightweight symmetric cryptography, co-supervised by Håvard Raddum, Simula, Bergen, Norway. Anjan Roy (external PhD with own funding): Design and implementation of pos-quantum and symmetric cryptographic primitives, co-supervised by Gilles van Assche, STMicroelectronics Belgium. PhD students supervised by Bart Mennink with me as promotor Charlotte Lefevre: provable security of symmetric crptography. Alexandre Bouez: provable security of symmetric cryptography. Mario Marhuenda Beltran: provable security of symmetric cryptography. Former PhD students: Bobby Subroto: Bobby defended his PhD thesis titled \"Commutative algebra and symmetric cryptography\" on Friday, November 21, 2025. Yanis Belkheyar, co-supervised by Shahram Rasoolzadeh of Ruhr University, Bochum. Yanis defended his PhD thesis titled \"A Race Against Time: How to design and analyze low-latency symmetric cryptographic algorithms\" on Tuesday, November 11, 2025. Daniel Kuijsters: Daniel defended his PhD thesis titled \"Structured Randomness\" on Thursday, July 3, 2025. Alireza Mehrdad, co-supervised by Silvia Mella. Alireza defended his PhD thesis titled \"Trail Search, Discovering the Perfect Path for Adventure\" on Friday, November 15, 2024. Aldo Gunsing, (with Bart Mennink): Aldo defended his PhD thesis titled \"Provably Secure Symmetric Cryptography, If the Proof is Correct\" on February 5, 2024. Niels Samwel (with Lejla Batina): side channel and fault attacks. Niels defended his PhD thesis titled \"Physical Attacks and Countermeasures on Real-World Cryptographic Implementations\" on December 5, 2022. Ko Stoffelen (with Peter Schwabe): Ko defended his PhD thesis titled Optimizations in Symmetric Cryptography on June 1, 2022. Benoît Viguier (with Peter Schwabe, Freek Wiedijk and Herman Geuvers): Benoît defended his PhD thesis titled A Panorama on Classical Cryptography on December 13, 2021. Anna Guinet: ESCADA, side channel attacks and countermeasures. Anna abandoned her PhD at Radboud in 2021 and started another one at Ruhr University in Bochum under the supervision of Tim Güneysu, Ruhr University, Bochum. Former postdocs: Christoph Dobraunig: Design and analysis of symmetric cryptography. Yann Rotella: ESCADA, design and analysis of symmetric cryptography. Tingting Cui: design and analysis of symmetric cryptography. Lorenzo Grassi: ESCADA, design and analysis of symmetric cryptography. Shahram Rasoolzadeh: SCALAR, design of symmetric crypto optimally exploiting available multipliers. Silvia Mella: analysis and design of lightweight symmetric cryptography. Teaching I teach and coordinate two bachelor computer security courses here at Radboud University: Computer Security (6ec) and Introduction to Cryptography (6ec). The former I teach together with Simona Samardjiska and Christine Utz and the latter with Durba Shatterjee. I teach one master course in the Radboud cybersecurity master specialization: Cryptology (6ec), together with Simona Samardjiska who is course coordinator. I accompany internships, bachelor and master theses in my own specialization but also in other domains of cryptography and information security. (top) Last modified: January 11, 2025",
  "content_length": 5576,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:34"
}