{
  "name": "Joana Gonçalves",
  "homepage": "http://joanagoncalves.org",
  "status": "success",
  "content": "Computational Molecular Biomedicine Breast cancer cells (programmed cell death)Annie Cavanagh / Wellcome Images From temporal expressionto regulatory mechanisms.Joana Gonçalves Computational Biomedicine Delft University of Technology No research positions are currently available. Research interests Computer Science: algorithmics, pattern recognition, and machine learning. Molecular Biology: gene regulation and DNA damage and repair. Biomedicine: characterization of disruptions in complex disease, discovery of therapeutic targets. Embedding Delft Unit of ELLIS - European Laboratory for Learning and Intelligent Systems (web) TU Delft Bioengineering Institute (web) TU Delft AI Initiative (web) Funding US National Institutes of Health (NIH) Convergence for Health and Technology (web) INSY / TU Delft Short Bio In Aug 2017, I started as an Assistant Professor at the Delft University of Technology (TUDelft). My lab will focus on computational approaches to understand gene regulation and DNA repair, uncover disruptions involved in complex disease (especially cancer), and predict novel targets for therapy. Between 2014 and 2017 I was a postdoc in computational cancer biology with Lodewyk Wessels at the TU Delft and the Netherlands Cancer Institute (NKI). Prior to that I was a Marie Curie/ERCIM postdoctoral fellow in algorithmic computational biology with Gunnar Klau at the Netherlands Research Centre for Mathematics and Informatics (CWI). I did a PhD in computer science with Sara Madeira at the Technical University of Lisbon (IST and INESC-ID), during which I also spent just over a year in the lab of Yves Moreau at the University of Leuven (KU Leuven). Education 2013 PhD in Computer Science Tecnical University of Lisbon 2007 Diploma (5-year) in Computer Science University of Beira Interior Positions 2017-present Assistant Professor Delft University of Technology 2017-2020 Guest Researcher Netherlands Cancer Institute (NL) 2014-2017 Postdoctoral Researcher Delft University of Technology Netherlands Cancer Institute (NL) 2013-2014 Marie Curie/ERCIM Fellow Centre for Math & Informatics (NL) 2012-2012 Research Assistant Imperial College London (UK) 2009-2010 Visiting Scholar University of Leuven (BE) 2007-2012 Doctoral Researcher Technical University of Lisbon and INESC-ID (PT)",
  "content_length": 2305,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:34"
}