{
  "name": "Jocelyn Simmonds",
  "homepage": "http://www.dcc.uchile.cl/~jsimmond",
  "status": "success",
  "content": "Jocelyn Simmonds' homepage Jocelyn Simmonds I am an Associate Professor at the University of Chile (Santiago, Chile). I am mainly interested in the creation and application of automated reasoning techniques to a broad range of domains. In particular, I am interested in program analysis and verification, object-oriented analysis and design, and model-driven engineering. My other interests include web and mobile development, computer science education, and diversity, equity and inclusion in technology. Publications | Projects | Organization | Service | Outreach | Teaching | Students | Awards Contact Info Address: Departamento de Ciencias de la Computación, Beauchef 851, Edificio Poniente, Santiago, Chile Office: BP-P-3-19 Email: jsimmond@dcc.uchile.cl Phone: +56 2 2978 4876 Publications Recent Publications Jocelyn Simmonds, Cecilia Bastarrica, Nancy Hitschfeld-Kahler, Pablo Villar Mascaró, Diego S. Wistuba La Torre, Jo Muñoz Montenegro, Millaray Cárdenas: Re-thinking gender diversity and inclusion initiatives for CS and SE in a university setting. Editors: D. Damian, K. Blincoe, D. Ford, A. Serebrenik, Z. Masood. Book: Equity, Diversity, and Inclusion in Software Engineering: Best Practices and Insights. Apress, to appear in 2023. Sebastian Alfaro, Alexandre Bergel, Jocelyn Simmonds: µPrintGen: Supporting Workflow Logs Analysis Through Visual Microprint. To appear in VISSOFT 2023, 2023. Jocelyn Simmonds, Constanza Diaz, Carlos Estay: Introducing Computational Thinking at Vocational High Schools. ITiCSE 2023, pg. 68-74, 2023. Cecilia Bastarrica, Jocelyn Simmonds: The effects of team gender composition in capstone software development projects. SCCC 2022, pg. 1-6, 2022. Jocelyn Simmonds, Francisco Gutierrez, Nancy Hitschfeld, Catalina Torrent, Cecilia Casanova, Sebastian Toro-Guajardo, Valentin Munoz: A Model for Infusing Computational Thinking Skills at Teacher Colleges in a Developing Country. In WiPSCE 2022 (Poster), pg. 1-2, 2022. Mabel Vidal, Jazmine Maldonado, Teresa Bracamonte, Florencia Miranda, Antonia Labarca, Jocelyn Simmonds: Niñas Pro: An Initiative to Educate, Inspire and Empower Women. Congress of Latin American Women in Computing. CEUR Publications. Pages: 35-46. 2021 Jocelyn Simmonds, Cecilia Bastarrica, Nancy Hitschfeld: Impact of Affirmative Action on Female Computer Science/Software Engineering Undergraduate Enrollment. In IEEE Software, volume 38, number 2, pg. 32-37, 2021. Jocelyn Simmonds, Francisco Gutierrez, Federico Meza, Catalina Torrent, Jaime Villalobos: Changing Teacher Perceptions about Computational Thinking in Grades 1-6, through a National Training Program. In SIGCSE 2021: pg. 260-266, 2021. Carla Sepúlveda-Díaz, Elson Stuardo Rojas, Jocelyn Simmonds, Francisco Gutierrez, Nancy Hitschfeld, Cecilia Casanova, Cecilia Sotomayor: Lessons Learned From Introducing Preteens in Parent-Led Homeschooling to Computational Thinking. SIGCSE 2020: pg 65-71, 2020. Cecilia Bastarrica, Jocelyn Simmonds: Gender Differences in Self and Peer Assessment in a Software Engineering Capstone Course. GE@ICSE2019, 2019. Pablo Estefó, Jocelyn Simmonds, Romain Robbes, Johan Fabry: The Robot Operating System: Package reuse and community dynamics. Journal of Systems and Software, volume 151, pg 226-242, 2019. Jocelyn Simmonds, Francisco Gutierrez, Cecilia Casanova, Cecilia Sotomayor, Nancy Hitschfeld: A Teacher Workshop for Introducing Computational Thinking in Rural and Vulnerable Environments. SIGCSE 2019: pg 1143-1149, 2019. Maíra Marques, Jocelyn Simmonds, Pedro Rossel, Cecilia Bastarrica: Software product line evolution: A systematic literature review. Information and Software Technology, volume 105, pg 190-208, 2019. Cecilia Bastarrica, Nancy Hitschfeld, Maíra Marques Samary, Jocelyn Simmonds: Affirmative action for attracting women to STEM in Chile. GE@ICSE2018: pg 45-48, 2018. Jocelyn Simmonds, Maíra Marques Samary, Milenko Tomic, Francisco Madrid, Constanza Escobar: Software Engineering for Millennials, by Millennials. SEEM@ICSE2018: pg 72-79, 2018. Francisco Gutierrez, Jocelyn Simmonds, Cecilia Casanova, Cecilia Sotomayor, Nancy Hitschfeld: Assessing Software Development Skills Among K-6 Learners in a Project-Based Workshop with Scratch. ICSE (SEET) 2018: 98-107, 2018. Francisco Gutierrez, Jocelyn Simmonds, Cecilia Casanova, Cecilia Sotomayor, Nancy Hitschfeld: Coding or Hacking? Exploring Inaccurate Views on Computing and Computer Scientists among K-6 Learners in Chile. SIGCSE 2018: pg 993-998, 2018. Jérémy Barbay, Jocelyn Simmonds, Adriana Keiko Nishida, Monael Pinheiro Ribeiro: \"Teaching is Learning\": Pedagogical material created and evaluated by students. Frontiers in Education: pg 1-5, 2016. Fabian Rojas, Jocelyn Simmonds and Cecilia Bastarrica: The v-algorithm for discovering software process lines. Journal of Software: Evolution and Process, 28(9): pg 783-799, 2016. Alexis Silva and Jocelyn Simmonds: BehaviorDroid: Monitoring Android Applications. MOBILESoft 2016: pg 19-20, 2016. Diego Rivera, Sebastian Blasco, Javier Bustos-Jiménez and Jocelyn Simmonds: Spin lock killed the performance star. SCCC 2015: pg 1-6, 2015. Jocelyn Simmonds, Daniel Perovich, Cecilia Bastarrica and Luis Silvestre: A Megamodel for Software Process Line Modeling and Evolution. MODELS 2015: pg 406-415, 2015. Fabian Rojas, Jocelyn Simmonds and Cecilia Bastarrica: Software Process Line Discovery. ICSSP 2015: pg 127-136, 2015. Fabian Rojas, Cecilia Bastarrica and Jocelyn Simmonds: Software Process Line Discovery from (Noisy) Logs. REVASOFT 2014, 2014. Cecilia Bastarrica, Jocelyn Simmonds and Luis Silvestre: Using megamodeling to improve industrial adoption of complex MDE solutions. MiSE 2014: pg 31-36, 2014. Marina Pilar, Jocelyn Simmonds and Hernán Astudillo: Semi-automated Tool Recommender for Software Development Processes. Electronic Notes in Theoretical Computer Science 302: pg 95-109, 2014. Links to my Google Scholar and DBLP profiles. Back to top. Projects 2023-2025. Fondo de Fomento al Desarrollo Científico y Tecnológico (Fondef IDeA), ANID, A model for including computational thinking and programming in teacher training programs. Director: Jocelyn Simmonds 2019-2021. Convenio de Colaboración y Transferencia de Recursos entre el Ministerio de Educación (Mineduc) y el Departamento de Ciencias de la Computación (DCC) de la Universidad de Chile. Estudio, seguimiento y evaluación del Plan Nacional de Lenguajes Digitales (PNLD). Director: Jocelyn Simmonds 2016-2017. Programa de apoyo al entorno para el emprendimiento y la innovación (PAEI), Corfo, Generación de un ecosistema de innovación sustentable a través de aprendizaje y servicio. Director: Jocelyn Simmonds, Sub-Director: Alejandra Avila 2014-2016. Fondo de Fomento al Desarrollo Científico y Tecnológico (Fondef IDeA), Conicyt, Gestión Experimental de la Mejora de Software (GEMS). Principal Investigator: Cecilia Bastarrica, Associated Researcher: Jocelyn Simmonds. 2015-2017. Fondo de Inserción Académica, Runtime Monitoring of Mobile Applications. Principal Investigator: Jocelyn Simmonds. 2011-2014. Fondo de Fomento al Desarrollo Científico y Tecnológico (Fondef), Conicyt, Adaptable Domain and Process Technology Engineering (ADAPTE). Principal Investigator: Cecilia Bastarrica. Associated Researcher: Jocelyn Simmonds. 2011-2012. Dirección General de Investigación y Posgrado, Universidad Técnica Federico Santa María, Análisis Dinámico de Aplicaciones Web. Principal Investigator: Jocelyn Simmonds. 2009. Mathematics of Information Technology and Complex Systems (MITACS) ACCELERATE award, Planning for Recovery from Webservice Failures. Principal Investigator: Marsha Chechik. Student: Jocelyn Simmonds. 2008. Mathematics of Information Technology and Complex Systems (MITACS) ACCELERATE award, Automated Recovery from Webservice Failures, Principal Investigator: Marsha Chechik. Student: Jocelyn Simmonds. Back to top. Organization Program Co-Chair, Research track, Evaluation and Assessment in Software Engineering (EASE '22) Regional Publicity Chair (South America), ACM/IEEE 23rd International Conference on Model Driven Engineering Languages and Systems (MODELS '20) Scholarships Co-Chair, Latin American Women in Technology (Latinity '19) Co-Chair, 10th Workshop on Modelling in Software Engineering (MiSE '18) Co-Chair, 8th International Workshop on Feature-Oriented Software Development (FOSD '17) Student Volunteers Co-Chair, 39th International Conference on Software Engineering(ICSE '17) Tutorial Co-Chair, 20th International Systems and Software Product Line Conference (SPLC '16) General Co-Chair, Latin American Women in Technology (LAtINiTY '15) Co-Organizer, III Encuentro de Mujeres en Computación (WSCCC '13) Chair, Workshops, Jornadas Chilenas de Computación (JCC '13) Regional Co-Organizer, Olimpiadas Chilenas de Informática (OCI '13) Co-Organizer, Lo Mejor de lo Nuestro (LMLN '12) Co-Organizer, II Encuentro de Mujeres en Computación (WSCCC '12) Co-Organizer, I Encuentro de Mujeres en Computación (WSCCC '11) Back to top. Service Program Committees Evaluation and Assessment in Software Engineering (EASE '24) -- Research Track ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE '23) -- Research Track International Conference on Software Engineering (ICSE '23) -- Software Engineering Education and Training Track ACM/IEEE 24th International Conference on Model Driven Engineering Languages and Systems (MODELS '21) -- Foundation Track ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE '21) -- Research Track International Conference on Software Engineering (ICSE '21) -- Doctoral Symposium International Systems and Software Product Line Conference (SPLC '20) -- Doctoral Symposium ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE '20) -- Research Track ACM/IEEE 22th International Conferen",
  "content_length": 24646,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:46"
}