{
  "name": "Joe K. Kearney",
  "homepage": "http://homepage.cs.uiowa.edu/~kearney",
  "status": "success",
  "content": "Home Page of Joseph K. Kearney Joseph K. Kearney Professor Department of Computer Science University of Iowa Iowa City, IA 52242-1419 office: 101 MLH telephone: (319) 335-0741 fax: (319) 335-3624 email: kearney@cs.uiowa.edu Ph.D., Minnesota, 1983 Interests Simulation Virtual Environments Animation Human Computer Interaction Projects Hank: Real-Time Ground Vehicle Simulation Virtual Environments as Laboratories for Studying Human Behavior Behavior Modeling and Scenario Authoring for Virtual Environments Environment Modeling Recent Courses 22C:034 Discrete Structures 22C:0296 Seminar on Human Computer Interaction 22C:0196 Computer Animation Art Gallery Wire-frame sculptures created by students in CS III Recent Publications Traffic Generation for Studies of Gap Acceptance , J. Kearney, T. Grechkin, J. Cremer, and J. Plumert, Driving Simulation Conference, DSC 2006 , Paris, France pp. 177-186, October 2006. [PDF] A Parametric Model for Oriented, Navigable Surfaces in Virtual Environments , H. Wang and J. Kearney, ACM International Conference on Virtual Reality Continuum and Its Applications, VRCIA , Hong Kong, pp. 51-57, June 2006. [ACM Digital Library Reference] Ribbon Networks for Modeling Navigable Paths of Autonomous Agents in Virtual Environments , P. Willemsen, J. Kearney, and H. Wang, IEEE Transactions on Visualization and Computer Graphics , 12(3), pp. 331-342, March 2006. Steering Behaviors for Autonomous Vehicles in Virtual Environments , H. Wang, J. Kearney, J. Cremer, and P. Willemsen Proceedings of the IEEE Virtual Reality Conference, Bonn, Germany pp. 155-162, March 2005. [PDF] Ribbon Networks for Modeling Navigable Paths of Autonomous Agents in Virtual Environments, P. Willemsen, J. Kearney, and H. Wang Proceedings of the IEEE Virtual Reality Conference, Los Angeles, CA, pp. 79-86, March 2003. [PDF] Arc-Length Parameterized Spline Curves for Real-Time Simulation, H. Wang, J. Kearney, and K. Atkinson Proceedings of the 5th International Conference on Curves and Surfaces, San Malo, France, pp. 387-396, June 2002. [PDF] Robust and Efficient Computation of the Closest Point on a Spline Curve, H. Wang, J. Kearney, and K. Atkinson Proceedings of the 5th International Conference on Curves and Surfaces, San Malo, France, pp. 397-406, June 2002. [PDF] Strolling Down the Avenue with a Few Close Friends, T. Hostetler and J. Kearney, Eurographics Ireland 2002 Workshop, Dublin, Ireland, pp. 7-14, March 2002. [PDF] This Old Digital City: One Year Later: Experience Gained, Lessons Learned, and Future Plans, J. Cremer, J. Severson, S. Gelo, J. Kearney, M. McDermott. Proceedings of the 7th International Conference on Virtual Systems and Multimedia (VSMM2000), pp. 49-56, October 2001. This Old Digital City: Virtual Historical Cedar Rapids, Iowa circa 1900, J. Cremer, J. Severson, J. Kearney, S. Gelo, M. McDermott, and R. Riccio. Proceedings of the 6th International Conference on Virtual Systems and Multimedia (VSMM2000), Softopia, Ogaki, Gifu, Japan, pp. 27-34, October 2000. Scenario Languages for Driving Simulation, J. Kearney, P. Willemsen, Stephane Donikian, and Frederic Devillers, Driving Simulation Conference: DSC'99, Paris, France, pp. 377-393, July, 1999. [PDF] Generation of Ambient Traffic for Real-time Driving Simulation, E. Bonakdarian, J. Cremer, J. Kearney, and P. Willemsen, Proceedings of 1998 Image Conference, Scottsdale, AZ, August, 1998. Embedding Scenarios in Ambient Traffic, O. Alloyer, E. Bonakdarian, J. Cremer, J.K. Kearney, and P. Willemsen, Driving Simulation Conference: DSC'97, Lyons, France, pp. 75-84, September, 1997. Directable Behavior Models for Virtual Driving Scenarios, J. Cremer, J.K. Kearney, and P. Willemsen, Transactions of the Society of Computer Simulation International, special issue on Multiagent Systems, 14(2), pp. 87-96, 1997. Tile-based Scene Modeling for Driving Simulation, J. Kearney, S. Allen, Shaheen Bahauddin, Michael J. Bartelme, T. Chow, D. Evans, and B. Mannlein, IMAGE V Conference, July 1996, Tucson, AZ. Simulation and Scenario Support for Virtual Environments, J. Cremer, J.K. Kearney, and H. Ko, Computers and Graphics, pp. 16-20, September, 1996. Driving Simulation: Challenges for VR Technology, J. Cremer, J. Kearney, and Y. Papelis, IEEE Computer Graphics and Applications, pp. 16-20, September, 1996. On Animating Whip-type Motions, D. Bhat and J.K. Kearney, The Journal of Visualization and Computer Animation, 5, pp. 229-249, 1996. HCSM: A Framework for Behavior and Scenario Control in Virtual Environments, J. Cremer, J.K. Kearney, and Y. Papelis, ACM Transactions on Modeling and Simulation, 5(3), July 1995, pp. 242-267.",
  "content_length": 4650,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:49"
}