{
  "name": "Joe Finney",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/joe-finney",
  "status": "success",
  "content": "Joe Finney - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Joe Finney Professor Research Overview My research revolves around the investigation of network and system support for mobile, embedded and ubiquitous computing. I typically employ an experimental methodology in my research. Through the prototyping of novel and emerging applications, I work to discover new requirements, architectures, protocols and techniques for future networks and systems. I find adopting such a pragmatic and experimental approach not only provides accurate research results and insights, but also enables more direct dissemination of research results into both the academic and industrial research communities. As an example of this, previous work I undertook around the Mobile IPv6 protocol was later adopted by Microsoft and integrated in their Windows XP and CE operating systems, and have developed patented and licensed technology for the creation of emergent displays. Show more… Career Details Academic qualifications: Ph.D. Computer Science, Lancaster 1999 B.Sc. Hons Computer Science (1st Class Hons), Lancaster 1995 Employment: Professor, School of Computing and Communications, Lancaster University, 2019 - present. Senior Lecturer, School of Computing and Communications, Lancaster University, 2007 - 2019. Lecturer, Department of Computing, Lancaster University, 2001 - 2007. Research Associate, Department of Computing, Lancaster University, 1998 - 2001. Professional Role Exemplar professional roles (past and present include): Technical Program Committee Memberships ACM MobicomACM Advances in Computer EntertainmentIEEE INFOCOM IEEE/ACM IDMS/PROMS/MIPSIFIP NetworkingIFIP Workshop on Challenges of Mobility Research Leadership Program co-chair: IEEE EuroSSC, EU Cabernet Radicals WorkshopDemo chair: ACM Advances in Computer EntertainmentLocal organizer:ACM/IEEE WMCSA, ACM/IEEE Iinterative Distributed Multimeda Systems External Examiner Positions Undergraduate External Examiner: University of StirlingMSc External Examiner: University of Sussex Show less Publications Projects Activities PhD Students Research Groups Selected Publications Show all 76 publications Toward emergent technology for blended public displaysChandler, A., Finney, J., Lewis, C., Dix, A. 2009Conference contribution/Paper Network Interrupts: supporting delay sensitive applications in low power wireless control networksBrown, J., Finney, J., Efstratiou, C., Green, B., Davies, N., Lowton, M., Kortuem, G. 2007Conference contribution/Paper Experiences of designing and deploying intelligent sensor nodes to monitor hand-arm vibrations in the fieldEfstratiou, C., Davies, N., Kortuem, G., Finney, J., Hooper, R., Lowton, M. 12/2007Conference contribution/Paper Mobile 4-in-6: a novel IPv4/IPv6 transitioning mechanism for mobile hostsFinney, J., Scott, A., Schmid, S. 13/03/2005Conference contribution/Paper All Publications Show only selected publications Blended education for STEM teaching 01/01/2025 → 01/01/2027 Research DSI: BEST: Blended Education for STEM Teaching 01/12/2024 → 30/11/2026 Research Pro2 Network+: From Prototyping to Production of Digital Devices 01/01/2023 → 31/12/2027 Research DSI : Energy In Schools funded extension - Micro Bit Energy Project Phase 4 30/03/2021 → 31/12/2021 Research iCASE: Enabling Long-tail Hardware: Bringing reproducibility to low volume device manufacture 01/10/2020 → 30/09/2025 Research Blackpool Illuminations Odyssey 01/09/2020 → 06/02/2023 Consultancy DSI: Energy in Schools 01/09/2018 → 31/07/2022 Research DSI: Energy in Schools 01/03/2018 → 30/01/2020 Research Child Proofing the Internet of Things 01/11/2017 → 31/10/2018 Other Firefly 01/11/2009 → 31/07/2013 Research Pro2 Device Prototyping Summer School Participation in conference -Mixed Audience Aron Eggens PhD student enable JavaScript to view email address Kier Palin PhD student, Associate Lecturer enable JavaScript to view email address Education (SCC) Morecambe Bay Curriculum SCC (Pervasive Systems) Back to listing Contact Details Department: Computing and Communications TelTelephone: enable JavaScript to view email address Back to listing",
  "content_length": 4407,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:46"
}