{
  "name": "Joe Gibbs Politz",
  "homepage": "https://jpolitz.github.io",
  "status": "success",
  "content": "Joe Gibbs Politz - JOE GIBBS POLITZ Associate Professor of TeachingUC San Diego CSE Contact Brian W. Kernigan on programming: \"Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.\" (Click for more wisdom) Courses Many of my course offerings are designed with reusable materials, including videos, notes, and starter code for assignments. Feel free to check them out, and get in touch if you have questions or find them helpful. Systems Programming & Software Tools (UCSD CSE 29) [Summer1 2025] [Fall 2024] Software Tools & Techniques Laboratory (UCSD CSE 15L) [Winter 2024] [Spring 2023] [Winter 2023] [Winter 2022] Advanced Compiler Design/Construction (UCSD CSE 231) [Spring 2023] [Spring 2022] [Winter 2021, see Experience Report] Compiler Construction (UCSD CSE 131) [Spring 2023] [Fall 2019] [Spring 2018] [Spring 2017] Software Engineering (UCSD CSE 110) [Spring 2022, with Bill Griswold] Introduction to Object-Oriented Programming in Java: Accelerated Pace (UCSD CSE 11) [Fall 2021, with Greg Miranda, see Experience report on video exams] [Spring 2020, see Remote Teaching Information] [Spring 2017] [Winter 2017, with Phil Papadopoulos] Race, Gender, and Computing (UCSD CSE 194) [Spring 2021, with Christine Alvarado; email for information] Introduction to Programming and Computational Problem Solving 1 (UCSD CSE 8A [formerly Programming in Java 1]) [Winter 2021] Advanced Data Structures (UCSD CSE 100) [Spring 2020, with Niema Moshiri and Sander Valstar] Introduction to Programming in Java: 1 (UCSD CSE 8A) [Winter 2020] [Fall 2018, with Mia Minnes; see Reflection on Using jshell] Discrete Math for CS (UCSD CSE 20) [Spring 2019, with Mia Minnes; see also an Experience Report on Adaptive Rubrics] Basic Data Structures and Object-Oriented Design (UCSD CSE 12) [Winter 2019] [Winter 2018] Computer Organization and Systems Programming (UCSD CSE 30) [Fall 2017] Principles of Compiler Design (Swarthmore CS 75) [Spring 2016] Data Structures and Algorithms (Swarthmore CS 35) [Fall 2015] Programming Languages (Swarthmore CS 91) [Spring 2015] Programming Languages (Brown University CS173; with Shriram Krishnamurthi) [Fall 2013] [Fall 2012] Recent & Active Projects CSE-PACE is a first-year experience for computing students at UCSD. code.pyret.org is the best way to run Pyret programs. Pyret is a functional scripting language designed for programming education. Bootstrap builds and does professional development for curricula that integrate computing into middle- and high-school courses. Several Bootstrap curricula use Pyret. Selected Publications Expanding Models for Physics Teaching: A Framework for the Integration of Computational Modeling Rebecca Elizabeth Vieyra, Colleen Megowan-Romanowicz, Kathi Fisler, Benjamin S. Lerner,Joe Gibbs Politz and Shriram Krishnamurthi. Education Sciences 2024, 14(8), 861. (html/pdf) Welcoming Students to Undergraduate Computer Science Programs: On-ramps, Rest Areas, and Lane Changes. Niharika Bhaskar, Amari N. Lewis, Rona Darabi, Joana Fang, Jingting Liu, Kristen Vaccaro, Joe Gibbs Politz, and Mia Minnes. SIGCSE 2024. (acm) Stream Your Exam to the Course Staff: Asynchronous Assessment via Student-Recorded Code Trace Videos. Rachel S. Lim, Joe Gibbs Politz, and Mia Minnes. SIGCSE 2023. (pdf) Integrated Data Science for Secondary Schools: Design and Assessment of a Curriculum. Emmanuel Schanzer, Nancy Pfenning, Flannery Denner, Sam Dooman, Joe Gibbs Politz, Benjamin S. Lerner, Kathi Fisler, and Shriram Krishnamurthi. SIGCSE 2022. (pdf) Learning about the Experiences of Chicano/Latino Students in a Large Undergraduate CS Program. Amari N. Lewis, Joe Gibbs Politz, Kristen Vaccaro, and Mia Minnes. ITiCSE 2022. (paper) Combining Interactive and Whole-Program Editing with Repartee. Luna Phipps-Costin, Michael MacLeod, Alex Vo, Tiffany Nguyen, Joe Gibbs Politz, Shriram Krishnamurthi, and Benjamin S. Lerner. PLATEAU 2021. (pdf, code, and demo videos) Course Experience Report: Full-Class Compiler Collaboration. Joe Gibbs Politz and Yousef Alhessi. SPLASH-E 2021. (pdf) Evolving a K-12 Curriculum for Integrating Computer Science into Mathematics. Kathi Fisler, Emmanuel Schanzer, Steve Weimar, Annie Fetter, K. Ann Renninger, Shriram Krishnamurthi, Joe Gibbs Politz, Benjamin Lerner, Jennifer Poole, and Christine Koerner. SIGCSE 2021. (pdf) Event Loops as First-Class Values: A Case Study in Pedagogic Language Design. Joe Gibbs Politz, Benjamin S. Lerner, Sorawee Porncharoenwase, and Shriram Krishnamurthi. ‹Programming› 2019.(paper & code). Putting in All the Stops: Execution Control for JavaScript. Sam Baxter, Rachit Nigam, Joe Gibbs Politz, Shriram Krishnamurthi, and Arjun Guha. PLDI 2018.(talk) (arxiv) (acm). The Sweep: Essential Examples for In-Flow Peer Review. Joe Gibbs Politz, Joseph M. Collard, Arjun Guha, Kathi Fisler, and Shriram Krishnamurthi. SIGCSE 2016.(pdf). In-Flow Peer-Review. Dave Clarke, Tony Clear, Kathi Fisler, Matthias Hauswirth, Shriram Krishnamurthi, Joe Gibbs Politz, Ville Tirronen, Tobias Wrigstad. ITiCSE 2014 Working Group Report. (pdf) CaptainTeach: Multi-Stage, In-Flow Peer Review for Programming Assignments. Joe Gibbs Politz, Daniel Patterson, Kathi Fisler, and Shriram Krishnamurthi. ITiCSE 2014. (pdf) Macaroons: Cookies with Contextual Caveats for Decentralized Authorization in the Cloud. Arnar Birgisson, Joe Gibbs Politz, Úlfar Erlingsson, Ankur Taly, Michael Vrable, and Mark Lentczner. NDSS 2014. (open source, 3rd-party implementation) (pdf & bib) Python: The Full Monty―A Tested Semantics for the Python Programming Language. Joe Gibbs Politz, Alejandro Martinez, Mae Milano, Sumner Warren, Daniel Patterson, Junsong Li, Anand Chitipothu, and Shriram Krishnamurthi. OOPSLA 2013. (paper and code) TeJaS: Retrofitting Type Systems for JavaScript. Benjamin S. Lerner, Joe Gibbs Politz, Arjun Guha, and Shriram Krishnamurthi. DLS 2013. (pdf) A Tested Semantics for Getters, Setters, and Eval in JavaScript. Joe Gibbs Politz, Matthew J. Carroll, Benjamin S. Lerner, Justin Pombrio, and Shriram Krishnamurthi. DLS 2012. (paper, code, & test results) Progressive Types. Joe Gibbs Politz, Hannah Quay-de la Vallee, and Shriram Krishnamurthi. Onward! 2012. (paper, code, & proofs) ADsafety: Type-based Verification of JavaScript Sandboxing. Joe Gibbs Politz, Spiridon Aristides Eliopoulos, Arjun Guha, and Shriram Krishnamurthi. USENIX Security 2011. (paper, code, & proofs) (bib) (talk video [USENIX Security]) (talk video [Mozilla])",
  "content_length": 6583,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:46"
}