{
  "name": "Joel H. Saltz",
  "homepage": "https://bmi.stonybrookmedicine.edu/people/joel_saltz",
  "status": "success",
  "content": "Joel Saltz | Stony Brook Dept of Biomedical Informatics Skip to main content The State University of New York Home Contact Us Research Department of Biomedical Informatics School of Medicine and College of Engineering and Applied Sciences Joel Saltz Distinguished Professor and Founding Chair, Department of Biomedical Informatics Endowed Charith Professor Department of Biomedical Informatics HSC L3-043 Stony Brook, NY 11794 Phone:  (631) 638-1420 Website (URL):  https://bmi.stonybrookmedicine.edu/Joel_Saltz_Research Email:  joel.saltz@stonybrookmedicine.edu INTERESTS Artificial Intelligence,  Digital Pathology,  Biomedical Informatics Pathology Foundation Models & Open Source Pathology Tools - 2023 Wrap up BIOGRAPHY Dr. Saltz has led numerous cross‑disciplinary initiatives spanning biomedicine, engineering, and computer science and has founded and chaired three highly successful Biomedical Informatics departments at Ohio State, Emory and now Stony Brook. The Stony Brook Department of Biomedical Informatics is dually housed in the School of Medicine and Engineering with a strong focus on artificial intelligence methods. Dr. Saltz also founded the Clinical Informatics group at Stony Brook; this group offers ACGME Clinical Informatics subspecialty fellowship positions. Dr. Joel Saltz is a leader in research on advanced information technologies for large scale data science and biomedical/scientific research. He has developed innovative pathology informatics methods, including: the first published whole slide virtual microscope system; pioneering pathology computer-aided diagnosis techniques; and methods for decomposing pathology images into features and linking those features to cancer “omics”, response to treatment and outcome. He has broken new ground in big data through development of the filter-stream based DataCutter system, the map-reduce style Active Data Repository and the inspector-executor runtime compiler framework. He has also been an active contributor in clinical informatics, having developed predictive models for hospital readmissions, point of care laboratory testing quality assurance systems, decision support systems for electrophoresis interpretation and graphical user  interfaces to support clinical data warehouse queries. Dr. Saltz is trained both as a computer scientist and as a physician through the MSTP program at Duke University. He has deep experience in computer science, having served on the computer science faculties at Yale University and the University of Maryland. He completed his residency in clinical pathology at Johns Hopkins University and he is a board certified clinical pathologist with a subspecialty certification in Clinical Informatics. RESEARCH Dr. Saltz is a pioneer in developing Digital Pathology tools, methods and algorithms with the ultimate goal of extracting and leveraging digitalized Pathology information to better predict cancer outcome and to steer cancer therapy. He is also an expert in high end computing and has developed a variety of highly cited systems software methods. His research in Pathology spans twenty years and consists of closely coordinated efforts in image analysis, machine learning, database design and high end computing. He has developed tools and methods through years of funded projects supported by a wide range of institutes and agencies including NCI, NLM, NIBIB, NSF, DARPA, AFOSR, NASA, DOD and DOE. His seminal work in digital imaging laid the foundation for digital pathology as it is today. He was the first to develop the “Virtual Microscope,” and pioneered developments in digital pathology whole slide image navigation, data management and computer aided classification. Dr. Saltz’s initial efforts included development of the first whole slide image viewer, and devising efficient methods for management, caching and supporting analytics carried out on whole slide datasets. This work became the foundation of the new field of Pathology Imaging Informatics, today investigators he mentored can be found carrying out exciting research in institutions across the country. Over the years, Dr. Saltz has developed a rich set of Pathology informatics tools, methods and algorithms. Dr. Saltz's team applies generative AI models to digital pathology, developing systems that can create realistic microscopic tissue images. Their diffusion models can generate pathology images from text descriptions and synthesize large-scale tissue samples without requiring time-consuming manual annotations. The team's ZoomLDM system can create gigapixel-sized images that maintain both microscopic detail and overall tissue structure across different magnification levels—similar to how a pathologist would zoom in and out when examining slides. These AI models have shown utility for disease diagnosis, with their learned features performing better than existing methods in detecting breast cancer and genetic mutations. Through their Gen-SIS framework, the team has demonstrated how synthetic images can enhance AI training without additional human labeling, which could help develop diagnostic tools while reducing the burden on medical professionals. The team has developed a variety of methods for interpretable AI. SI-MIL (Self-Interpretable MIL) integrates handcrafted pathological features into a linear prediction branch for Multiple Instance Learning, enabling interpretable predictions through human-understandable descriptors like tumor cellularity and necrosis rather than opaque attention maps. GECKO (Gigapixel Vision-Concept Contrastive Pretraining) aligns whole slide images with pathology concept priors through contrastive learning, producing concept-aware embeddings that allow pathologists to inspect predictions via concept activation maps. HIPPO (Histopathology Interpretability via Prototypes and Perturbations of WSI) leverages prototypical learning and counterfactual explanations to enable visual interpretation of model decisions through human-understandable image patches and perturbation-based feature importance. These frameworks demonstrate that computational pathology models can achieve strong performance while maintaining clinical interpretability through concept-based reasoning and visual explanations. These frameworks demonstrate that computational pathology models can achieve strong performance while maintaining clinical interpretability through concept-based reasoning. Members of the Saltz team are carrying out research with the ultimate aim of creating an autonomous pathology system that would function in a manner analogous to a self-driving car by using attention heatmap predictions as perception models to identify diagnostic regions (like detecting road features), while Pathologist scanpath prediction acts as navigation planning to determine optimal viewing sequences through the WSI. The system would maintain dynamic working memory of examined areas and automatically adjust magnification levels based on tissue complexity, similar to how autonomous vehicles track surroundings and adapt speed to conditions. The groundwork for this project has been laid in a set of carefully controlled experiments involving development of models to predict Pathologist attention and scan path during prostate cancer classification. He and his group have developed a rich set of pipelines to compute a variety of biologically significant Pathology features, including spatial maps of tumor infiltrating lymphocytes (TILs). The quantification of TILs is well documented to have prognostic value in many contexts; understanding patient immune response to tumors is increasingly important with the advance of cancer immunotherapy. For most cancer types, Pathologists do not comment on TILs in their reports and even in cancer types where TIL comments are sometimes made, they only use high level terms such as “brisk” or “sparse”. Dr. Saltz is able to precisely quantify percent tumor infiltrating lymphocytes and is also able to generate detailed TIL Maps. He has used these methods to generate publicly available whole slide TIL maps and spatial statistics for 13 cancer types and 5,000 subjects – these are available on The Cancer Imaging Archive. His team is now extending and leveraging these methods in many other studies. His MSTP student, Jakub Kaczmarzyk has developed WSinfer -- QuPath linked software to efficiently computer patch based predictions including tumor/TIL maps. An H&E image, its TIL map, and the diagram of clusters of TIL locations for spatial pattern analysis [3]. Dr. Saltz and collaborators have also developed a variety of machine learning methods to target analysis of whole slide images. This includes a variety of methods that target Neuroblastoma classification as well as methods that are able to leverage coarse grained whole slide training data through combining patch- level convolutional neural networks with supervised decision fusion. He achieved state-of-the-art results in predicting the subtypes of brain and lung tumors. Finally, Dr. Saltz made foundational contributions to data science through development of innovative methods for moving computation to data, development of a very early prototype map/reduce type framework, foundational methods for runtime compiler analysis of adaptive applications and analyses of key data structures employed in the management of spatial data (Hilbert Space-Filling Curves). Tools derived from these methods was awarded the 2024 VLDB Test of Time award(https://www.vldb.org/awards_10year.html) Joel Saltz received his MD and Computer Science PhD from the Medical Scientist Training Program at Duke University. He was trained in Clinical Pathology at Johns Hopkins Medical School and served on the Johns Hopkins faculty as Professor and Director of Pathology Informatics. He has launched new Departments of Biomedical Informatics at Stony Brook, Emory and Ohio State and has also served on the Computer Science faculty at Yale University and the University of Mary",
  "content_length": 17377,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:51"
}