{
  "name": "Joel E. Fischer",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/joel.fischer",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Joel FischerProfessor of Human-Computer Interaction, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom C10c Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/aJoel.Fischer@nottingham.ac.ukhttp://www.cs.nott.ac.uk/~jef BiographyI'm Professor of Human-Computer Interaction at the School of Computer Science, University of Nottingham, UK, where I am a member of the Mixed Reality Lab. My research takes a human-centred view on AI-infused technologies to understand and support human activities and reasoning. My research is frequently concerned with how interactive technology can be designed to support collocated people interacting face-to-face. My research approach is multidisciplinary, drawing on ethnography, participatory design, prototyping, and studies of technology deployments, often with an ethnomethodological and conversation analytic lens. Please visit my homepage for more information.Selected Publications FISCHER, JOEL E., GREENHALGH, CHRIS, JIANG, WENCHAO, RAMCHURN, SARVAPALI D., WU, FENG and RODDEN, TOM, 2017. In-the-loop or on-the-loop? Interactional arrangements to support team coordination with a planning agent Concurrency and Computation: Practice and Experience. e4082-n/aJOEL FISCHER, ANDY CRABTREE, JAMES COLLEY, TOM RODDEN and ENRICO COSTANZA, 2017. Data Work: How Energy Advisors and Clients Make IoT Data Accountable Computer Supported Cooperative Work: The Journal of Collaborative Computing and Work Practices. 26(4-6), 597-626FISCHER, JOEL E., CRABTREE, ANDY, RODDEN, TOM, COLLEY, JAMES A., COSTANZA, ENRICO, JEWELL, MICHAEL O. and RAMCHURN, SARVAPALI D., 2016. 'Just Whack It on Until It Gets Hot': Working with IoT Data in the Home In: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5933-5944REYES-CRUZ, GISELA, FISCHER, JOEL E and REEVES, STUART, 2020. Reframing Disability as Competency: Unpacking Everyday Technology Practices of People with Visual Impairments In: ACM CHI. View all publications RADY, AHMED, FISCHER, JOEL, REEVES, STUART, LOGAN, BRIAN and WATSON, NICHOLAS JAMES, 2020. The Effect of Light Intensity, Sensor Height, and Spectral Pre-Processing Methods When Using NIR Spectroscopy to Identify Different Allergen-Containing Powdered Foods SENSORS. 20(1), CANDELLO, HELOISA, MUNTEANU, COSMIN, CLARK, LEIGH, SIN, JAISIE, TORRES, MARÍA INÉS, PORCHERON, MARTIN, MYERS, CHELSEA M, COWAN, BENJAMIN, FISCHER, JOEL, SCHLÖGL, STEPHAN and OTHERS, 2020. CUI@ CHI: Mapping Grand Challenges for the Conversational User Interface Community In: Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1-8REYES-CRUZ, GISELA, FISCHER, JOEL E and REEVES, STUART, 2020. Reframing Disability as Competency: Unpacking Everyday Technology Practices of People with Visual Impairments In: ACM CHI. RADY, AHMED, FISCHER, JOEL, REEVES, STUART, LOGAN, BRIAN and JAMES WATSON, NICHOLAS, 2020. The effect of light intensity, sensor height, and spectral pre-processing methods when using NIR spectroscopy to identify different allergen-containing powdered foods Sensors. 20(1), 230NILSSON, TOMMY, FISCHER, JOEL E, CRABTREE, ANDY, GOULDEN, MURRAY, SPENCE, JOCELYN and COSTANZA, ENRICO, 2020. Visions, Values, and Videos: Revisiting Envisionings in Service of UbiComp Design for the Home arXiv preprint arXiv:2005.08952. CAROLINA FUENTES, MARTIN PORCHERON, JOEL E. FISCHER, ENRICO COSTANZA, OBAID MALILK and SARVAPALI D. RAMCHURN, 2019. Tracking the Consumption of Home Essentials In: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). 639:1-639:13NILSSON, TOMMY, CRABTREE, ANDY, FISCHER, JOEL and KOLEVA, BORIANA, 2019. Breaching the future: understanding human challenges of autonomous systems for the home Personal and Ubiquitous Computing. 1-21NILSSON, TOMMY, CRABTREE, ANDY, FISCHER, JOEL and KOLEVA, BORIANA, 2019. Creating Worlds: Exploring Animated Videos as a Tool for Contextualization in User Research In: Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1-2FUENTES, CAROLINA, PORCHERON, MARTIN, FISCHER, JOEL E, COSTANZA, ENRICO, VERDEZOTO, NERVO, HERSKOVIC, VALERIA, ZUCKERMAN, OREN and TAKAYAMA, LEILA, 2019. New Directions for the IoT: Automate, Share, Build, and Care In: Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1-8CRABTREE, ANDY, HYLAND, LEWIS, COLLEY, JAMES, FLINTHAM, MARTIN, FISCHER, JOEL E and KWON, HYOSUN, 2019. Probing IoT-based consumer services:'insights' from the connected shower Personal and Ubiquitous Computing. 1-17FISCHER, JOEL E, REEVES, STUART, PORCHERON, MARTIN and SIKVELAND, REIN OVE, 2019. Progressivity for voice interface design In: Proceedings of the 1st International Conference on Conversational User Interfaces. 1-8FUENTES, CAROLINA, PORCHERON, MARTIN, FISCHER, JOEL E, COSTANZA, ENRICO, MALILK, OBAID and RAMCHURN, SARVAPALI D, 2019. Tracking the consumption of home essentials In: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1-13MARTIN PORCHERON, JOEL E. FISCHER, STUART REEVES and SARAH SHARPLES, 2018. Voice Interfaces in Everyday Life In: Proceedings of the 2018 ACM Conference on Human Factors in Computing Systems (CHI '18). KWON, HYOSUN, FISCHER, JOEL E., FLINTHAM, MARTIN and COLLEY, JAMES, 2018. The Connected Shower: Studying Intimate Data in Everyday Life Proc. ACM Interact. Mob. Wearable Ubiquitous Technol.. 2(4), 176:1-176:22REEVES, STUART, PORCHERON, MARTIN and FISCHER, JOEL, 2018. 'This is Not What We Wanted': Designing for Conversation with Voice Interfaces Interactions. 26(1), 46-51HYLAND, LEWIS, CRABTREE, ANDY, FISCHER, JOEL, COLLEY, JAMES and FUENTES, CAROLINA, 2018. ''What do you want for dinner?'' - need anticipation and the design of proactive technologies for the home Computer Supported Cooperative Work (CSCW). 27(3), 917-946VERAME, JHIM KIEL M., COSTANZA, ENRICO, FISCHER, JOEL, CRABTREE, ANDY, RAMCHURN, SARVAPALI D., RODDEN, TOM and JENNINGS, NICHOLAS R., 2018. Learning from the Veg Box: Designing Unpredictability in Agency Delegation In: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 447:1-447:13HUYNH, TRUNG DONG, EBDEN, MARK, FISCHER, JOEL, ROBERTS, STEPHEN and MOREAU, LUC, 2018. Provenance network analytics Data Mining and Knowledge Discovery. 32(3), 708-735PORCHERON, MARTIN, FISCHER, JOEL E., REEVES, STUART and SHARPLES, SARAH, 2018. Voice Interfaces in Everyday Life In: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 640:1-640:12MARTIN PORCHERON, JOEL E. FISCHER and SARAH SHARPLES, 2017. “Do Animals Have Accents?”: Talking with Agents in Multi-Party Conversation In: Proceedings of the 20th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '17). 207-219JOEL FISCHER, ANDY CRABTREE, JAMES COLLEY, TOM RODDEN and ENRICO COSTANZA, 2017. Data Work: How Energy Advisors and Clients Make IoT Data Accountable Computer Supported Cooperative Work: The Journal of Collaborative Computing and Work Practices. 26(4-6), 597-626FISCHER, JOEL E., GREENHALGH, CHRIS, JIANG, WENCHAO, RAMCHURN, SARVAPALI D., WU, FENG and RODDEN, TOM, 2017. In-the-loop or on-the-loop? Interactional arrangements to support team coordination with a planning agent Concurrency and Computation: Practice and Experience. e4082-n/aPORCHERON, MARTIN, FISCHER, JOEL E., MCGREGOR, MOIRA, BROWN, BARRY, LUGER, EWA, CANDELLO, HELOISA and O'HARA, KENTON, 2017. Talking with Conversational Agents in Collaborative Action In: Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 431-436PORCHERON, MARTIN, FISCHER, JOEL E. and SHARPLES, SARAH, 2016. Using Mobile Phones in Pub Talk In: Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 1649-1661FISCHER, JOEL E., CRABTREE, ANDY, RODDEN, TOM, COLLEY, JAMES A., COSTANZA, ENRICO, JEWELL, MICHAEL O. and RAMCHURN, SARVAPALI D., 2016. 'Just Whack It on Until It Gets Hot': Working with IoT Data in the Home In: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5933-5944SARVAPALI D RAMCHURN, TRUNG DONG HUYNH, FENG WU, YUKKI IKUNO, JACK FLANN, LUC MOREAU, JOEL E FISCHER, WENCHAO JIANG, TOM RODDEN, EDWIN SIMPSON, STEVEN REECE, STEPHEN ROBERTS and NICHOLAS R JENNINGS, 2016. A Disaster Response System based on Human-Agent Collectives Journal of Artificial Intelligence Research (JAIR). 57, 661-708ALAN, ALPER T., COSTANZA, ENRICO, RAMCHURN, SARVAPALI D., FISCHER, JOEL, RODDEN, TOM and JENNINGS, NICHOLAS R., 2016. Tariff Agent: Interacting with a Future Smart Energy System at Home ACM Trans. Comput.-Hum. Interact.. 23(4), 25:1-25:28SARVAPALI D. RAMCHURN, JOEL E. FISCHER, YUKI IKUNO, FENG WU, JACK FLANN and ANTONY WALDOCK, 2015. A study of human-agent collaboration for multi-UAV task allocation in dynamic environments In: International Joint Conference on Artificial Intelligence (IJCAI-15). 1184-1192RAMCHURN, SARVAPALI D., HUYNH, TRUNG DONG, IKUNO, YUKI, FLANN, JACK, WU, FENG, MOREAU, LUC, JENNINGS, NICHOLAS R., FISCHER, JOEL E., JIANG, WENCHAO, RODDEN, TOM, SIMPSON, EDWIN, REECE, STEVEN and ROBERTS, STEPHEN J., 2015. HAC-ER: A Disaster Response System Based on Human-Agent Collectives In: Proceedings of the 2015 International Conference on Autonomous Agents and Multiagent Systems. 533-541FENG WU, SARVAPALI D. RAMCHURN, WENCHAO JIANG, JOEL E. FISCHER, TOM RODDEN and NICHOLAS R. JENNINGS, 2015. Agile planning for real-world disaster response In: International J",
  "content_length": 18456,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:50"
}