{
  "name": "Joel Moses",
  "homepage": "https://esd.mit.edu/Faculty_Pages/moses/moses.htm",
  "status": "success",
  "content": "Home - IDSS Subscribe Search About Leadership Community External Advisory Board Visiting Committee Jobs & Grants People Faculty Senior Research Staff Research Staff Graduate Students Administrative Staff Directory Research Our Approach Collaborations Seed Funds Research Domains Academics PhD Program in Social & Engineering Systems Technology and Policy Program Interdisciplinary Doctoral Program in Statistics Minor in Statistics and Data Science IDSSx: Data Science Online MicroMasters Program in Statistics and Data Science (SDS) IDSS Classes IDSS Student Council News & Events News Newsletters Podcast: Data Nation Events Past Events Engage IDSS Alliance IDSS Strategic Partnerships Alumni Invest in IDSS Contact Building networks of data science talent Through partnerships with organizations like BREIT in Peru, IDSS is upskilling hundreds of learners around the world in data science and machine learning. READ MORE MIT Maritime Consortium A new international collaboration unites MIT and maritime industry leaders to develop nuclear propulsion technologies, alternative fuels, data-powered strategies for operation, and more. READ MORE Data Science and Machine Learning: Making Data-Driven Decisions Learn to uncover data’s true value and make data-driven business decisions with MIT faculty and mentorship from industry practitioners. READ MORE Institute for Data, Systems, and Society (IDSS) is committed to addressing complex societal challenges by advancing education and research at the intersection of statistics, data science, information and decision systems, and social sciences. MORE News MIT News | November 24, 2025 New AI agent learns to use CAD to create 3D objects from sketches The virtual VideoCAD tool, developed by researchers including IDSS faculty Faez Ahmed, could boost designers’ productivity and help train engineers learning computer-aided design. VoxDev | November 19, 2025 Can development aid counter insurgencies? Lessons from Afghanistan Evidence suggests aid programs can be effective when insurgencies are locally driven, but may be detrimental when insurgents don't rely on local populations for support, say researchers including IDSS Director Fotini Christia. MIT News | November 18, 2025 Bigger datasets aren’t always better MIT researchers including IDSS faculty Saurabh Amin and Asu Ozdaglar developed a way to identify the smallest dataset that guarantees optimal solutions to complex problems. TPP News | November 7, 2025 Exploring Market Opportunities for Ancillary Services in India’s Renewable Energy Sector Supported by the MISTI India program, TPP student Grant Lee explored how ReNew, one of India’s largest renewable energy producers, can strategically participate in the newly opened ancillary services market. View More News... Upcoming Wed 03 Fotini Christia (IDSS) Zoom December 3, 2025 @ 9:00 am - 9:45 am Feb 06 Subhodh Kotekal (MIT) E18-304 February 6, 2026 @ 11:00 am - 12:00 pm Feb 10 TBA E18-304 February 10, 2026 @ 4:00 pm - 5:00 pm Feb 13 Max Simchowitz (Carnegie Mellon University) E18-304 February 13, 2026 @ 11:00 am - 12:00 pm Feb 20 Dmitriy Drusvyatskiy (University of California, San Diego) E18-304 February 20, 2026 @ 11:00 am - 12:00 pm View More Events... MIT Institute for Data, Systems, and Society Massachusetts Institute of Technology 77 Massachusetts Avenue Cambridge, MA 02139-4307 617-253-1764 Accessibility About▼LeadershipCommunityExternal Advisory BoardVisiting CommitteeJobs & GrantsPeople▼FacultySenior Research StaffResearch StaffGraduate StudentsAdministrative StaffDirectoryResearch▼Our ApproachCollaborations▼Initiative on Combatting Systemic RacismIDSS COVID-19 Collaboration (Isolat)Seed FundsResearch Domains▼Energy SystemsFinanceHealth CareSocial NetworksUrban SystemsAcademics▼PhD Program in Social & Engineering Systems▼SES AdmissionsSES Program and ResourcesSES FundingSES + StatisticsSES GraduatesSES NewsTechnology and Policy ProgramInterdisciplinary Doctoral Program in StatisticsMinor in Statistics and Data ScienceIDSSx: Data Science Online▼Data Science and Machine Learning: Making Data-Driven DecisionsOnline Programs and Short CoursesMicroMasters Program in Statistics and Data Science (SDS)IDSS ClassesIDSS Student CouncilNews & Events▼NewsNewslettersPodcast: Data NationEvents▼Conferences and WorkshopsIDSS Distinguished Seminar SeriesIDSS Special SeminarsStatistics and Data Science Seminar SeriesResearch to Policy EngagementOnline EventsOther EventsPast Events▼Conferences and WorkshopsIDSS Distinguished Seminar SeriesIDSS Special SeminarsStatistics and Data Science Seminar SeriesResearch to Policy EngagementOnline EventsOther EventsEngage▼IDSS Alliance▼Great LearningIDSS Strategic Partnerships▼Partnerships in EducationPartnerships in ResearchAlumniInvest in IDSSContact Search",
  "content_length": 4795,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:55"
}