{
  "name": "Joel S. Bader",
  "homepage": "https://www.baderzone.org",
  "status": "success",
  "content": "Bader Lab | Joel S. Bader and Lab, Johns Hopkins University Bader Lab Joel S. Bader and Lab, Johns Hopkins University Joel S. Bader and Lab Department of Biomedical Engineering, Whiting School of Engineering, Johns Hopkins University High-Throughput Biology Center, Institute of Basic Biological Sciences, Johns Hopkins School of Medicine We study the relationship between genotype, the DNA sequence that encodes life’s information, and phenotype, a living system’s observable properties. Applications are to human disease, primarily complex genetic disorders and cancer, and to designed synthetic systems. The Human Genome Project, which provided a reference sequence of the 3 billion DNA letters that are the instructions for human life, also identified heritable genetic variants that influence disease risk. Mutations that arise in individual cells similarly can lead to cancer and other diseases. We develop new computational methods and joint wet-lab approaches to define how inborn genetic variants and acquired mutations lead to disease, with the goal of developing new therapies. Image: Organoids generated from human breast tumors are displayed in false color. These organoids are groups of 300-500 cells from fresh tissue that were grown in three-dimensional culture by our collaborators in the Ewald lab to generate phenotypes relevant to invasive breast cancer. We are developing methods that identify the genes that drive breast cancer invasion, dissemination, and metastatic outgrowth in the hopes of developing new therapeutic strategies for metastatic breast cancer and other cancers. In Archive © 2025 Bader Lab ↑ Create a website or blog at WordPress.com Bader Lab Sign up Log in Copy shortlink Report this content Manage subscriptions Loading Comments... Write a Comment... Email Name Website",
  "content_length": 1812,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:53"
}