{
  "name": "Joel Carpenter",
  "homepage": "http://researchers.uq.edu.au/researcher/11891",
  "status": "success",
  "content": "Associate Professor Joel Carpenter | UQ Experts Skip to menu Skip to content Skip to footer Associate Professor Joel Carpenter Email: j.carpenter@uq.edu.au Phone: +61 7 336 51656 Positions ARC Future Fellow School of Electrical Engineering and Computer Science Faculty of Engineering, Architecture and Information Technology Overview Background I work with manipulating and measuring the spatial/polarisation and spectral/temporal properties of light, mostly as it travels through multimode fibre. This has applications in optical telecommunications, biomedical imaging, quantum mechanics and astronomical instrumentation but is also just a lot of fun. There's a good chance that at any point in time I'm using a spatial light modulator in some way to acheive these goals. 2012-2014 : Postdoctoral researcher, The University of Sydney, Australia 2009-2012 : Doctor of Philosophy, University of Cambridge, UK 2008-2009 : Codan Limited, Microwave Design Engineer, The University of Queensland, Australia 2007 : Master of Engineering (ME), The University of Queensland, Australia 2002-2006 : Bachelor of Engineering (BE), Bachelor of Science (BSc), The University of Queensland, Australia Read more Read less Availability Associate Professor Joel Carpenter is: Available for supervision Qualifications Doctor of Philosophy, University of Cambridge Works Search Professor Joel Carpenter’s works on UQ eSpace All (89) Journal Article (22) Other Outputs (3) Conference Publication (64) 2025 Conference Publication High Dimensional Spatiotemporal Toroidal Light Beams with Arbitrary Polarization and Orientation Through a Multimode Fiber Komonen, Andrew V., Fontaine, Nicolas K., Morote, Marcos Maestre, Ploschner, Martin, Neilson, David T., Carpenter, Joel and Mounaix, Mickael (2025). High Dimensional Spatiotemporal Toroidal Light Beams with Arbitrary Polarization and Orientation Through a Multimode Fiber. IEEE. doi: 10.23919/oecc/psc62146.2025.11109532 High Dimensional Spatiotemporal Toroidal Light Beams with Arbitrary Polarization and Orientation Through a Multimode Fiber 2024 Conference Publication Programable High-dimensional Quantum Gates via MPLC Dahl, Daniel S., Plöschner, Martin, Fontaine, Nicolas K., Romero, Jacqui and Carpenter, Joel (2024). Programable High-dimensional Quantum Gates via MPLC. Frontiers in Optics 2024, Denver, CO United States, 23-26 September 2024. Washington, DC United States: Optica. doi: 10.1364/fio.2024.fm5c.5 Programable High-dimensional Quantum Gates via MPLC 2023 Journal Article Roadmap on spatiotemporal light fields Shen, Yijie, Zhan, Qiwen, Wright, Logan G., Christodoulides, Demetrios N, Wise, Frank, Willner, Alan, Zou, Kaiheng, Zhao, Zhe, Porras, Miguel Angel, Chong, Andy, Wan, Chenhao, Bliokh, Konstantin Yu, Liao, Chen-Ting, Hernandez Garcia, Carlos, Murnane, Margaret M., Yessenov, Murat, Abouraddy, A, Wong, Liang Jie, GO, Michael, Kumar, Suraj, Guo, Cheng, Fan, Shanhui, Papasimakis, Nikitas, Zheludev, Nikolay I, Chen, Lu, Zhu, Wenqi, Agrawal, Amit, Mounaix, Mickael, Fontaine, Nicolas K. ... Forbes, Andrew (2023). Roadmap on spatiotemporal light fields. Journal of Optics, 25 (9) 093001, 1-59. doi: 10.1088/2040-8986/ace4dc Roadmap on spatiotemporal light fields 2023 Conference Publication Arbitrary vector spatiotemporal beamshaping: any amplitude, phase and polarization at any delay Mounaix, Mickael, Fontaine, Nicolas K., Neilson, David T., Ryf, Roland, Chen, Haoshuo, Alvarado-Zacarias, Juan Carlos and Carpenter, Joel A. (2023). Arbitrary vector spatiotemporal beamshaping: any amplitude, phase and polarization at any delay. SPIE Photonics West 2023, San Francisco, CA United States, 28 January - 2 February 2023. Bellingham, WA United States: SPIE. doi: 10.1117/12.2652118 Arbitrary vector spatiotemporal beamshaping: any amplitude, phase and polarization at any delay 2023 Conference Publication Spatial tomography of light resolved in time, spectrum, and polarization Ploschner, Martin, Morote, Marcos M., Dahl, Daniel S., Mounaix, Mickael, Light, Greta, Rakic, Aleksandar D. and Carpenter, Joel (2023). Spatial tomography of light resolved in time, spectrum, and polarization. Smart Photonic and Optoelectronic Integrated Circuits 2023;, San Francisco, CA USA, 28 January-3 February 2023. Washington, DC USA: SPIE. doi: 10.1117/12.2658893 Spatial tomography of light resolved in time, spectrum, and polarization 2023 Journal Article Controlled generation of picosecond-pulsed higher-order Poincaré sphere beams from an ytterbium-doped multicore fiber amplifier Ji, Kunhao, Lin, Di, Davidson, Ian A., Wang, Siyi, Carpenter, Joel, Amma, Yoshimichi, Jung, Yongmin, Guasoni, Massimiliano and Richardson, David J. (2023). Controlled generation of picosecond-pulsed higher-order Poincaré sphere beams from an ytterbium-doped multicore fiber amplifier. Photonics Research, 11 (2), 181-188. doi: 10.1364/PRJ.475287 Controlled generation of picosecond-pulsed higher-order Poincaré sphere beams from an ytterbium-doped multicore fiber amplifier 2023 Conference Publication Wafer scale fabrication of multi-plane light conversion devices Fontaine, Nicolas K., Huang, Yetian, Huang, Hanzi, Dallachiesa, Lauren, Mazur, Mikael, Ryf, Roland, Chen, Haoshuo, Neilson, David T., Earnshaw, Mark, Cappuzzo, Mark, Kopf, Rose, Pardo, Flavio, Bolle, Cris and Carpenter, Joel (2023). Wafer scale fabrication of multi-plane light conversion devices. 49th European Conference on Optical Communications (ECOC 2023), Glasgow, United Kingdom (and Virtual), 1-5 October 2023. Piscataway, NJ, United States: Institution of Engineering and Technology. doi: 10.1049/icp.2023.2435 Wafer scale fabrication of multi-plane light conversion devices 2023 Conference Publication Experimental investigation of reduced complexity MIMO equalization in a 55-mode fiber SDM transmission system Ospina, Ruby S. B., Rademacher, Georg, Luis, Ruben S., Puttnam, Benjamin J., Fontaine, Nicolas K., Mazur, Mikael, Chen, Haoshuo, Ryf, Roland, Neilson, David T., Dahl, Daniel, Carpenter, Joel, Sillard, Pierre, Achten, Frank, Bigot, Marianne, Mello, Darli A. A. and Furukawa, Hideaki (2023). Experimental investigation of reduced complexity MIMO equalization in a 55-mode fiber SDM transmission system. Optical Fiber Communications Conference and Exhibition (OFC), San Diego, CA United States, 5-9 March 2023. New York, NY United States: Institute of Electrical and Electronics Engineers. doi: 10.23919/OFC49934.2023.10117222 Experimental investigation of reduced complexity MIMO equalization in a 55-mode fiber SDM transmission system 2023 Conference Publication Referenceless, low-coherence, multimode fiber characterization Morote, M. Maestre, Plöschner, M., Mounaix, M., Komonen, A.V and Carpenter, J. (2023). Referenceless, low-coherence, multimode fiber characterization. 2023 Conference on Lasers and Electro-Optics, CLEO 2023, San Jose, CA United States, 7 - 12 May 2023. Washington, DC United States: Optica Publishing Group. doi: 10.1364/cleo_si.2023.sm3l.1 Referenceless, low-coherence, multimode fiber characterization 2023 Conference Publication 3.56 Peta-bit/s C+L Band Transmission over a 55-mode Multi-Mode Fiber Rademacher, Georg, Lúis, Ruben S., Puttnam, Benjamin J., Fontaine, Nicolas K., Mazur, Mikael, Chen, Haoshuo, Ryf, Roland, Neilson, David T., Dahl, Daniel, Carpenter, Joel, Sillard, Pierre, Achten, Frank, Bigot, Marianne, Sakaguchi, Jun and Furukawa, Hideaki (2023). 3.56 Peta-bit/s C+L Band Transmission over a 55-mode Multi-Mode Fiber. 49th European Conference on Optical Communications (ECOC 2023), Glasgow, United Kingdom (and Virtual), 1-5 October 2023. Piscataway, NJ, United States: Institution of Engineering and Technology. doi: 10.1049/icp.2023.1834 3.56 Peta-bit/s C+L Band Transmission over a 55-mode Multi-Mode Fiber 2023 Conference Publication Proof-of-concept of a 90-port optical time reverser over 90nm bandwidth and two planes of phase manipulation Mounaix, M., Fontaine, N.K., Neilson, D. and Carpenter, J. (2023). Proof-of-concept of a 90-port optical time reverser over 90nm bandwidth and two planes of phase manipulation. 2023 Conference on Lasers and Electro-Optics, CLEO 2023, San Jose, CA United States, 7 - 12 May 2023. Washington, DC United States: Optica Publishing Group. doi: 10.1364/cleo_si.2023.sth3n.5 Proof-of-concept of a 90-port optical time reverser over 90nm bandwidth and two planes of phase manipulation 2022 Journal Article Photonic lanterns, 3-D waveguides, multiplane light conversion, and other components that enable space-division multiplexing Fontaine, Nicolas K., Carpenter, Joel, Gross, Simon, Leon-Saval, Sergio, Jung, Yongmin, Richardson, David J. and Amezcua-Correa, Rodrigo (2022). Photonic lanterns, 3-D waveguides, multiplane light conversion, and other components that enable space-division multiplexing. Proceedings of the IEEE, 110 (11), 1821-1834. doi: 10.1109/JPROC.2022.3207046 Photonic lanterns, 3-D waveguides, multiplane light conversion, and other components that enable space-division multiplexing 2022 Conference Publication Broadband 15-Mode Multiplexers based on Multi-Plane Light Conversion with 8 Planes in Unwrapped Phase Space Fontaine, Nicolas K., Mazur, Mikael, Ryf, Roland, Dallachiesa, Lauren, Chen, Haoshuo, Neilson, David, Bolle, Cris and Carpenter, Joel (2022). Broadband 15-Mode Multiplexers based on Multi-Plane Light Conversion with 8 Planes in Unwrapped Phase Space. European Conference on Optical Communication (ECOC), Online, 18-22 September 2022. Piscataway, NJ United States: Institute of Electrical and Electronics Engineers. Broadband 15-Mode Multiplexers based on Multi-Plane Light Conversion with 8 Planes in Unwrapped Phase Space 2022 Conference Publication 1.53 Peta-bit/s C-Band Transmission in a 55-Mode Fiber Rademacher, Georg, Luis, Ruben S., Puttnam, Benjamin J., Fontaine, Nicolas K., Mazur, Mikael, Chen, Haoshuo, Ryf, Roland, Neilson, David T., Dahl, Daniel, Carpenter, Joel, Sillard, Pierre, Achten, Frank, Bigot, Marianne, Sakaguchi, Jun and Furukawa",
  "content_length": 16294,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:52"
}