{
  "name": "Joel Reardon",
  "homepage": "http://pages.cpsc.ucalgary.ca/~joel.reardon",
  "status": "success",
  "content": "Joel Reardon Joel Reardon Affiliation Associate Professor at the University of Calgarye-mail addresspostal address Joel Reardon University of Calgary 2500 University Dr. NW ICT Building, ICT602 Calgary, Alberta T2N 1N4 About me: [Curriculum Vitae] Teaching Fall 2025: CPSC 526/626 Network System Security Winter 2025: CPSC 599/601: Mobile Security and Privacy Winter 2025: ISEC 631 Privacy by Design CVEs CVE-2022-23491 for removal of TrustCor certs in Certifi based on dev-security-policy discussion CVE-2021-31815 sensitive contact tracing is being logged. blog post explaining issue CVE-2020-0454 android apps able to get router SSID without holding permission. acknowledged for November 2020 CVE-2020-0293 access to sensitive network state due to a missing permission check Investigative Stories Washington Post coverage of Trustcor, a root certificate authority. Follow up reporting about Browser's distrusting the CA. Also on the register and Faculty of Science news. Google's response on their blog. Wall Street Journal coverage of Spyware SDK with ties to Packet Forensics and Vostrom. Subsequence BBC and Forbes Vice News coverage of Huq tracking users without consent and original research. Subsequent Vice News coverage of action against the apps. Further reporting from the BBC and the NRK Media Interviews Interviewed for Globe and Mail article on Running and Fitness apps. Interviewed for ICTjournal on the privacy flaw in Google's implementation of GAEN (en Francais). Interviewed for Markup Article on the privacy flaw in Google's implementation of GAEN Interviewed for Wall Street Journal Article on government surveillance. Interviewed for Online tracking investigation for Le Temps (en Francais). Interviewed for Wall Street Journal Article on TikTok's side channel use. Interviewed for What the Tech Podcast. Interviewed for El Pais (en Espanol). Interviewed for Mediapart (en Francais) Interviewed for a El Pais article related to apps circumenting the permission system (en Espanol). Interviewed for a CBC article related to protecting personal data. Interviewed for an episode of reply all related to apps and robocalls. Interviewed for an episode of CBC spark related to tracking of children by apps. Interviewed by the Financial times related to tracking and sharing of data by phones. Other Media Google issues warning to location-sharing apps The future of money: The digital currency revolution is here, and may sweep away 5,000 years of monetary history BEUC submits an external alert to the CPC-Network about TikTok UCalgary professors advise the Bank of Canada on a central bank digital currency design A Day in the Life of your Data by Apple, Inc. Apple and Google to Stop X-Mode From Collecting Location Data From Users’ Phones in Wall Street Journal A popular fertility app shared data without user consent, researchers say in Washington Post Trust in digital space COVID-19 Apps in Wall Street Journal Kaspersky Daily Slides from Talks [slides]: 2021 B-Sides Keynote CVEs from CNN [slides]: A talk on writing and typography for CPSC 699 [slides]: A talk on Blockchain at an Undergraduate Society's Blockchain workshop. Books Peer-Reviewed Magazine Articles Joel Reardon, Alvaro Feal, Primal Wijesekera, Amit Elazari Bar On, Narseo Vallina- Rodriguez, and Serge Egelman 50 Ways to Leak Your Data: An Exploration of Apps Circumvention of the Android Permissions System USENIX ;login: magazine, Winter 2019. [free copy] [official copy] Primal Wijesekera, Arjun Baokar, Lynn Tsai, Joel Reardon, Serge Egelman, David Wagner, Konstantin BeznosovDynamically Regulating Mobile Application Permissions, February 2018 pp. 64-71 [free copy] [copyright owner copy] [bibtex] Joel Reardon, David Basin, and Srdjan CapkunOn Secure Data Deletion, May 2014 pp. 37-44 [free copy] [copyright owner copy] [bibtex] Peer-Reviewed Conference Papers Paul-Olivier Dehaye and Joel ReardonProximity Tracing in an Ecosystem of Surveillance Capitalism, November 2020Workshop on Privacy in the Electronic Society[]free official copy] [video of talk] [blog post] Joel Reardon, Alvaro Feal, Primal Wijesekera, Amit Elazari Bar On, Narseo Villina-Rodriguez, Serge Egelman 50 Ways to Leak Your Data: An Exploration of Apps' Circumvention of the Android Permissions System, August 2019Proceedings of the 28th USENIX Security Symposium. Distinguished paper award! Received 2022 Emilio Aced Research and Personal Data Protection Award [free official copy] [blog stories] [slides from talk] [slides from rumpsession] Irwin Reyes, Primal Wijesekera, Joel Reardon, Amit Elazari Bar On, Abbas Razaghpanah, Narseo Vallina-Rodriguez, and Serge Egelman Won't Somebody Think of the Children? Examining COPPA Compliance at Scale, July 2018Proceedings of the 2018 Privacy Enhancing Technologies Symposium (PETS) Won The Caspar Bowden Award for Outstanding Research in Privacy Enhancing Technologies at PETS 2020. [free official copy] [full data set] [video of talk] [CBC coverage] Primal Wijesekera, Joel Reardon, Irwin Reyes, Lynn Tsai, Jung-Wei Chen, Nathan Good, David Wagner, Kostantin Beznosov, and Serge EgelmanContextualizing Privacy Decisions for Better Prediction (and Protection), April 20182018 Computer Human Interaction Conference Proceedings (CHI) (honorable mention) [free copy] Lynn Tsai, Primal Wijesekera, Joel Reardon, Irwin Reyes, Serge Egelman, David Wagner, Nathan Good, Jung-Wei ChenTurtle Guard: Helping Android Users Apply Contextual Privacy Preferences, July 2017Proceedings of the 2017 Symposium on Usable Privacy and Security (SOUPS) pp. 145--162 [free copy] [slides] [bibtex] Primal Wijesekera, Arjun Baokar, Lynn Tsai, Joel Reardon, Serge Egelman, David Wagner, Konstantin BeznosovThe Feasibility of Dynamically Granted Permissions: Aligning Mobile Privacy with User Preferences, May 2017Proceedings of the IEEE Symposium on Security and Privacy pp. 1077–-1093 [free copy] [copyright owner copy] [talk] [bibtex] Joel Reardon, Hubert Ritzdorf, David Basin and Srdjan CapkunSecure Data Deletion from Persistent Media, November 2014Proceedings of the 2013 ACM SIGSAC Conference on Computer and Communications Security pp. 271–-284 [free copy] [copyright owner copy] [slides] [bibtex] Joel Reardon, David Basin and Srdjan CapkunSoK: Secure Data Deletion, May 2013Proceedings of the IEEE Symposium on Security and Privacy pp. 301--315 [free copy] [copyright owner copy] [slides] [bibtex] Joel Reardon, Srdjan Capkun, and David BasinData Node Encrypted File System: Efficient Secure Deletion for Flash Memory, August 2012Proceedings of the 2012 USENIX Security Symposium pp. 333-–348 [free copy] [slides] [talk] [bibtex] Chris Alexander, Joel Reardon, and Ian GoldbergPlinko: Polling with a Physical Implementation of a Noisy Channel, 2009Workshop on Privacy in the Electronic Society [free copy] [copyright owner copy] [bibtex] Joel Reardon and Ian GoldbergImproving Tor Using a TCP-over-DTLS Tunnel, August 2009Proceedings of the USENIX Security Symposium pp. 333–-348 [free copy] [slides] [bibtex] Technical Reports Joel Reardon, Claudio Marforio, Srdjan Capkun and David BasinSecure Deletion on Log-Structured File Systems, June 2011arXiv:1106.0917 Joel Reardon, Jeff Pound, and Ian GoldbergRelational-Complete Private Information Retrieval, November 2007CACR Tech Report 2007-34 Joel Reardon, Alan Kligman, Brian Agala, and Ian GoldbergKleeQ: Asynchronous Key Management for Dynamic Ad-Hoc Networks, January 2007CACR Tech Report 2007-03 313 tools turing machines context-free grammars regular expressions non-deterministic finite automata deterministic finite automata set theory Code harbriner: tool to prettyprint and decode HAR files. A webassembly version is available to run in browser here logserver: tool for fast search and navigation of logfiles jpush string deobfuscator for smali files Last updated: 12/03/2023 21:25:28",
  "content_length": 7847,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:55"
}