{
  "name": "Joel David Hamkins",
  "homepage": "http://jdh.hamkins.org",
  "status": "success",
  "content": "Joel David Hamkins | mathematics and philosophy of the infinite Skip to primary contentSkip to secondary content This will be a talk for the Logic Seminar at the University of Notre Dame, Tuesday 18 November 20215 2pm 125 Hayes-Healy Building. Abstract. I shall introduce what I call the first-order elementary theory of surreal arithmetic, a theory that is true in the surreal field when equipped with its birthday order structure. This structure, I shall prove, is bi-interpretable with the set-theoretic universe (V,∈), and indeed the theory of surreal arithmetic SA is bi-interpretable with ZFC. This is very new joint work in progress with myself, Junhong Chen, and Ruizhi Yang, of Fudan University, Shanghai. Share: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on Reddit (Opens in new window) Reddit Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print More Click to share on LinkedIn (Opens in new window) LinkedIn Click to share on Tumblr (Opens in new window) Tumblr Click to share on Pocket (Opens in new window) Pocket Click to share on Pinterest (Opens in new window) Pinterest I am honored to be giving the 2025-26 Charles R. DePrima Memorial Lecture for the Mathematics Department of the California Institute of Technology. This lecture series aims to bring mathematical researchers to Caltech to give talks for a primarily undergraduate audience. This invitation truly gives me a lot of pleasure, first, because Caltech is my alma mater (B.S. Mathematics 1988), but second, because my daughter is currently an undergraduate student at Caltech, majoring in mathematics. So I am looking forward to this talk. De Prima Lecture Flyer 2025Download Share: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on Reddit (Opens in new window) Reddit Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print More Click to share on LinkedIn (Opens in new window) LinkedIn Click to share on Tumblr (Opens in new window) Tumblr Click to share on Pocket (Opens in new window) Pocket Click to share on Pinterest (Opens in new window) Pinterest Recently I had the pleasure to give a talk at the Conference on the occasion of Jörg Brendle’s 60th birthday at Kobe University in Japan, and I was invited to make remarks at the conference banquet given in his honor. I feel a special affinity with Jörg, since we had both first come to Japan in 1998 at almost exactly the same time, within a week of each other, and naturally we were faced with similar bewildering differences in language and culture in those first early days after arriving in Japan. I had taken up a one-year JSPS Research Fellowship at Kobe University, while Jörg had entered into his permanent position there. He went on to build an impressive research career there with many accomplishments and many students. My own stay in Japan was a formative period in my life, greatly enjoyed. At the banquet, I related some anecdotes from the early days, but also expressed heartfelt philosophical reflections on the significance of major life decisions and the sanguineity one might feel about alternative life paths not taken. What a blissful enjoyable life I might have had, for example, if I had somehow managed to remain in Japan and build a life there as Jörg has done. I proceed to continue my remarks as follows regarding the Sannoymiya incident… Allow me, finally, to relate what I know of the infamous Sannomiya incident, an event which marks to my way of thinking the time when Jörg first made his big splash in the Japanese art world, the time when he first hit the big stage. It was a late summer afternoon, early evening, and Jörg, wearing his customary straw hat, was walking home down the mountain from the university into town. Carrying some newly procured oil paints, he was full of anticipation and artistic plans. Inadvisably, however, in his excitement he opened some of the tubes while he was walking, in order to judge the quality, in part by smelling the oils. At this, he was startled by a coarse grunt behind him on the trail—an inoshishi* had noticed the smell of the oils and begun to follow Jörg. And it wasn’t one of those small inoshishi that you can scare away by grunting yourself, but rather a large bold inoshishi. Jörg nervously quickened his pace to get away, gripping the oils tightly, but the inoshishi was gaining on him. In his preoccupation with the inoshishi, Jörg hadn’t noticed the large crane flying over head. But the crane had definitely noticed Jörg, or more specifically, his straw hat, which I suppose the bird coveted for his nest. The bird swooped down and, with surprising speed, grabbed the hat directly off Jörg’s head! Of course Jörg was not going to let a bird steal his hat, and he held fast onto it. In the struggle, with the bird’s great wings flapping and Jörg holding tight to the hat, he was stretched upward. The inoshishi saw his chance and charged right between Jörg’s legs, who was thrust up onto the back of the inoshishi, finding himself to be riding it like a horse. The three of them were set galloping down the mountain. The great crane ahead, flapping its wings and pulling the hat, to which Jörg clung, while riding the squealing inoshishi, who carried them all down the mountain trail at full speed. Imagine the sight. Caught in the tight grasp of Jörg’s hands, paint began to ooze out of the tubes, which began to make a mess on Jörg, dripping also onto the inoshishi, who became increasingly splotched with various bright colors. The trail came down to the precipice, where normally one would make the turn and continue on the trail downhill. But the crane had no reason to turn, and instead flew straight out over the edge. Inexplicably, Jörg did not let go and found himself dangling precariously as the bird flew out over the neighborhood below. The inoshishi, wrapped in Jörg’s legs and taken completely by surprise with this new situation, was gripping for dear life on to Jörg. In the frantic struggle, the inoshishi had bitten off both of Jörg’s shoes, which fell away below. Thus the absurd triple—the great flying crane holding the hat, with now barefoot Jörg dangling below and the squealing inoshishi, covered with paint—soared over the city, heading to Sannomiya in the Kobe city center. At that time there was a Matsuri summer festival taking place downtown, and people strolled about in elegant yukatas*, browsing the various fine fabrics on display, the theme of the festival. A great linen fabric, with an almost imperceptible white on white pattern, was spread across the big stage at the center of the festival, surrounded by onlookers who stood around it taking in its subtle, starkly spare nature. Presently all attention turned skyward—the festival crowd gasped with bewilderment as Jörg and the crane and the squealing inoshishi came into view overhead. By this time, of course, the crane was tiring, and suddenly it just let go. The tangled paint-smeared mess of Jörg and the inoshishi fell to Earth, Splash!, landing right on the great white linen canvas spread upon the big stage. The inoshishi stood up, grunting and squealing, but then, looking at the spot of the fall, let off a strange twitch and became suddenly transfixed, relaxed and silent. The crowd, initially full of shouts and alarm, also became suddenly calm, every person looking intently before them. Stepping back in his awkward barefootedness, Jörg realized that the people were not looking at him or at the inoshishi at all, but rather directly at the fabric, right at the spot right where they had landed. The inoshishi seemed as though hypnotized by the canvas, of course now smeared with paint from the crash, overcome with its……beauty. The people were similarly dumbstruck, overcome with emotion and profound meaning—to a person they gazed at the sublime work of art that Jörg and the inoshishi had created on the canvas. A voice broke through the silence Ichi man en!*, an opening bid in the hotly contested impromptu auction that ensued. Soon, the work was sold for a great sum. Jörg was asked to sign his mark. So that is what I know of the story of the Sannomiya incident, in which Jörg first made his big splash in the Japanese art scene, the time when he hit the big stage. Now, I have heard that some people doubt this story, but then again, some people doubt the existence of a unique absolute set-theoretic universe, so evidently like Descartes one can doubt absolutely anything, even incontrovertible truths such as the account I have just related. Joel David Hamkins4 September 2025Kobe, Japan *An inoshishi is a kind of wild boar, commonly seen in the early evenings in the Kobe hills, including the university campus *A yukata is a traditional cotton summer kimono, often worn by both men and women at summer festivals *The phrase “ichi man en” means ten-thousand yen Art Show next week Incidentally, Jörg has an art show exhibition in Japan next week. Follow the links to the main show, which lists a few of his pieces there. Look under the category “Award Winning”. https://shunyo-kai.or.jp/lists-2/list-101/ https://shunyo-kai.or.jp/lists-2/list-102/ Mathematician’s year in Japan For those who are interested, I wrote a book A mathematician’s year in Japan relating my experiences in Japan during that year I lived in Kobe. Share: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on Reddit (Opens in new window) Reddit Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print More Click to share on LinkedIn (Opens in new wi",
  "content_length": 37937,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:51"
}