{
  "name": "Johannes Borgström",
  "homepage": "https://katalog.uu.se/empinfo/?id=N10-775",
  "status": "success",
  "content": "Johannes Borgström - Uppsala universitet Johannes Borgström Universitetslektor vid Institutionen för informationsteknologi; Datalogi Telefon: 018-471 31 65E-post: johannes.borgstrom@it.uu.seBesöksadress: Hus 10, Regementsvägen 10Postadress: Box 337751 05 UPPSALA Ladda ned kontaktuppgifter för Johannes Borgström vid Institutionen för informationsteknologi; Datalogi Akademiska meriter: DocentCV: Ladda ned CVORCID: 0000-0001-5990-5742 Kort presentation Jag är lektor i datavetenskap på avdelningen för datalogi vid institutionen för IT, och programansvarig för kandidatprogrammet i datavetenskap. Min forskning rör semantik för programmeringsspråk och processalgebror, med inriktning mot både tillämpningar och algebraiska egenskaper. Just nu arbetar jag på probabilistiska programmeringsspråk för statistiska modeller och Bayesisk inferens, samt hur e-grafer kan användas för att förbättra optimerande kompilatorer. Nyckelord programming languagessemanticsprobabilistic programmingcompilationprocess calculiprogram equivalencesoperational semantics Biografi Jag arbetar i forskargruppen för programmeringsspråk, huvudsakligen med projekt relaterade till semantik för funktionella och kommunicerande programmeringsspråk (t.ex. Erlang) samt probabilistiska (Bayesianska) modelleringsspråk.Mitt tidigare arbete var inom projektet Applied Process Calculi, där vi utvecklade familjer av små formella modelleringsspråk, kallade psi-kalkyler, för olika typer av parallella, distribuerade och kommunicerande system. Den centrala forskningsfrågan var att tillhandahålla uttrycksfulla modelleringsspråk som fortfarande uppfyller vissa väsentliga metateoretiska egenskaper: en naturlig ekvivalens mellan system måste vara en kongruens och validera vissa algebraiska lagar (t.ex. kommutativitet för variabelbindare och kommutativa monoidlagar för parallell komposition). För absolut säkerhet kontrollerades bevisen maskinellt med hjälp av en interaktiv teorembevisare.Under min postdoc vid Microsoft Research i Cambridge arbetade jag med tre slags moderna primitiver i programmeringsspråk: probabilistiska observationer för Bayesiansk modellering, transaktionellt minne för säker parallell imperativ programmering och beroende typer för verifiering av tillståndsberoende program.Jag doktorerade med Uwe Nestmann vid EPFL på processkalkyler för kryptografiska protokoll. Mitt främsta bidrag var definitionen av nya programekvivalenser (kontextkänsliga bisimuleringar) som på ett korrekt sätt approximerar observationell processekvivalens, samt bevis för korrespondens och skillnader mellan dem vilket löste flera öppna problem.Under min tid som doktorand tillämpade jag också processkalkylstekniker inom andra områden, nämligen modellering och verifiering av peer-to-peer distribuerade hashtabeller, modeller för modala säkerhetslogiker och visualisering av meddelandeutbyten. Publikationer Urval av publikationer Modal Logics for Nominal Transition Systems Parrow, Joachim; Borgström, Johannes; Eriksson, Lars-Henrik; Forsberg Gutkovas, Ramunas et al. Ingår i Logical Methods in Computer Science, 2021 DOI för Modal Logics for Nominal Transition Systems Ladda ner fulltext 1 (pdf) av Modal Logics for Nominal Transition Systems Ladda ner fulltext 2 (pdf) av Modal Logics for Nominal Transition Systems Correctness of Sequential Monte Carlo Inference for Probabilistic Programming Languages Lunden, Daniel; Borgström, Johannes; Broman, David Ingår i Programming Languages And Systems, ESOP 2021, s. 404-431, 2021 DOI för Correctness of Sequential Monte Carlo Inference for Probabilistic Programming Languages Ladda ner fulltext (pdf) av Correctness of Sequential Monte Carlo Inference for Probabilistic Programming Languages Universal probabilistic programming offers a powerful approach to statistical phylogenetics Ronquist, Fredrik; Kudlicka, Jan; Senderov, Viktor; Borgström, Johannes et al. Ingår i Communications Biology, 2021 DOI för Universal probabilistic programming offers a powerful approach to statistical phylogenetics Ladda ner fulltext (pdf) av Universal probabilistic programming offers a powerful approach to statistical phylogenetics Deriving Probability Density Functions from Probabilistic Functional Programs Bhat, Sooraj; Borgström, Johannes; Gordon, Andrew D.; Russo, Claudio Ingår i Logical Methods in Computer Science, 2017 DOI för Deriving Probability Density Functions from Probabilistic Functional Programs A Lambda-Calculus Foundation for Universal Probabilistic Programming Borgström, Johannes; Dal Lago, Ugo; Gordon, Andrew D.; Szymczak, Marcin Ingår i SIGPLAN notices, s. 33-46, 2016 DOI för A Lambda-Calculus Foundation for Universal Probabilistic Programming Ladda ner fulltext (pdf) av A Lambda-Calculus Foundation for Universal Probabilistic Programming Higher-order psi-calculi Parrow, Joachim; Borgström, Johannes; Raabjerg, Palle; Åman Pohjola, Johannes Ingår i Mathematical Structures in Computer Science, 2014 DOI för Higher-order psi-calculi Ladda ner fulltext (pdf) av Higher-order psi-calculi Senaste publikationer Modal Logics for Nominal Transition Systems Parrow, Joachim; Borgström, Johannes; Eriksson, Lars-Henrik; Forsberg Gutkovas, Ramunas et al. Ingår i Logical Methods in Computer Science, 2021 DOI för Modal Logics for Nominal Transition Systems Ladda ner fulltext 1 (pdf) av Modal Logics for Nominal Transition Systems Ladda ner fulltext 2 (pdf) av Modal Logics for Nominal Transition Systems Correctness of Sequential Monte Carlo Inference for Probabilistic Programming Languages Lunden, Daniel; Borgström, Johannes; Broman, David Ingår i Programming Languages And Systems, ESOP 2021, s. 404-431, 2021 DOI för Correctness of Sequential Monte Carlo Inference for Probabilistic Programming Languages Ladda ner fulltext (pdf) av Correctness of Sequential Monte Carlo Inference for Probabilistic Programming Languages Universal probabilistic programming offers a powerful approach to statistical phylogenetics Ronquist, Fredrik; Kudlicka, Jan; Senderov, Viktor; Borgström, Johannes et al. Ingår i Communications Biology, 2021 DOI för Universal probabilistic programming offers a powerful approach to statistical phylogenetics Ladda ner fulltext (pdf) av Universal probabilistic programming offers a powerful approach to statistical phylogenetics Deriving Probability Density Functions from Probabilistic Functional Programs Bhat, Sooraj; Borgström, Johannes; Gordon, Andrew D.; Russo, Claudio Ingår i Logical Methods in Computer Science, 2017 DOI för Deriving Probability Density Functions from Probabilistic Functional Programs Weak Nominal Modal Logic Parrow, Joachim; Weber, Tjark; Borgström, Johannes; Eriksson, Lars-Henrik Ingår i Formal Techniques for Distributed Objects, Components, and Systems, s. 179-193, 2017 DOI för Weak Nominal Modal Logic Alla publikationer Artiklar i tidskrift Modal Logics for Nominal Transition Systems Parrow, Joachim; Borgström, Johannes; Eriksson, Lars-Henrik; Forsberg Gutkovas, Ramunas et al. Ingår i Logical Methods in Computer Science, 2021 DOI för Modal Logics for Nominal Transition Systems Ladda ner fulltext 1 (pdf) av Modal Logics for Nominal Transition Systems Ladda ner fulltext 2 (pdf) av Modal Logics for Nominal Transition Systems Universal probabilistic programming offers a powerful approach to statistical phylogenetics Ronquist, Fredrik; Kudlicka, Jan; Senderov, Viktor; Borgström, Johannes et al. Ingår i Communications Biology, 2021 DOI för Universal probabilistic programming offers a powerful approach to statistical phylogenetics Ladda ner fulltext (pdf) av Universal probabilistic programming offers a powerful approach to statistical phylogenetics Deriving Probability Density Functions from Probabilistic Functional Programs Bhat, Sooraj; Borgström, Johannes; Gordon, Andrew D.; Russo, Claudio Ingår i Logical Methods in Computer Science, 2017 DOI för Deriving Probability Density Functions from Probabilistic Functional Programs A Sorted Semantic Framework for Applied Process Calculi Borgström, Johannes; Gutkovas, Ramunas; Parrow, Joachim; Victor, Björn et al. Ingår i Logical Methods in Computer Science, s. 1-49, 2016 DOI för A Sorted Semantic Framework for Applied Process Calculi Ladda ner fulltext (pdf) av A Sorted Semantic Framework for Applied Process Calculi Modal Logics for Nominal Transition Systems Weber, Tjark; Eriksson, Lars-Henrik; Parrow, Joachim; Borgström, Johannes et al. Ingår i Archive of Formal Proofs, 2016 A Lambda-Calculus Foundation for Universal Probabilistic Programming Borgström, Johannes; Dal Lago, Ugo; Gordon, Andrew D.; Szymczak, Marcin Ingår i SIGPLAN notices, s. 33-46, 2016 DOI för A Lambda-Calculus Foundation for Universal Probabilistic Programming Ladda ner fulltext (pdf) av A Lambda-Calculus Foundation for Universal Probabilistic Programming Broadcast psi-calculi with an application to wireless protocols Borgström, Johannes; Huang, Shuqin; Johansson, Magnus; Raabjerg, Palle et al. Ingår i Software and Systems Modeling, s. 201-216, 2015 DOI för Broadcast psi-calculi with an application to wireless protocols Ladda ner fulltext (pdf) av Broadcast psi-calculi with an application to wireless protocols The Psi-Calculi Workbench: A Generic Tool for Applied Process Calculi Borgström, Johannes; Gutkovas, Ramunas; Rodhe, Ioana; Victor, Björn Ingår i ACM Transactions on Embedded Computing Systems, 2015 DOI för The Psi-Calculi Workbench: A Generic Tool for Applied Process Calculi Ladda ner fulltext (pdf) av The Psi-Calculi Workbench: A Generic Tool for Applied Process Calculi Higher-order psi-calculi Parrow, Joachim; Borgström, Johannes; Raabjerg, Palle; Åman Pohjola, Johannes Ingår i Mathematical Structures in Computer Science, 2014 DOI för Higher-order psi-calculi Ladda ner fulltext (pdf) av Higher-order psi-calculi Measure transformer semantics for Bayesian machine learning Borgström, Johannes; Gordon, Andrew D.; Greenberg, Michael; Margetson, James et al. Ingår i Logical Methods in Computer Science, s. 11, 2013 DOI för Measure tra",
  "content_length": 17889,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:14"
}