{
  "name": "Johan Hoffman",
  "homepage": "https://www.kth.se/profile/jhoffman",
  "status": "success",
  "content": "KTH | Johan Hoffman Skip to main content Johan HoffmanProfessorKungliga Tekniska Högskolanhttps://www.kth.se/profile/jhoffmanDetailsWorks for Division of Computational Science and TechnologyTelephone +46 8 790 77 83Unit address Lindstedtsvägen 5E-mail jhoffman@kth.seRoom4432AResearcherResearcher IDORCID IDWeb of Science ResearcherIDScopus IDGoogle Scholar IDResearchGateAbout meJohan Hoffman is professor of numerical analysis, and deputy head of the division of computational science and technology. He is on the editorial boards of the SIAM Computational Science and Engineering book series and the Elsevier journal Computers & Fluids. His research combines fundamental research on mathematics, computer science and computational mechanics with applied research in interdisciplinary collaborations with industry and society, focused on aerodynamics, aerospace, urban planning, renewable energy and biomedicine. He is founder of the FEniCS open source software project, founder of a spinoff company based on his research, and partner in the EU project GENEX on digital twins. His research is funded by the Swedish Research Council and the European Commission. In 2015 he received a European Research Council (ERC) Proof of Concept Grant, and in 2014 a Bizkaia Talent Grant (Marie Curie Action). He was selected for a Research Fellowship of the Swedish Research Council (VR) in 2010, in 2008 he was awarded an ERC Starting Grant and an Individual Grant for the Advancement of Research Leaders by the Swedish Foundation for Strategic Research (SSF). His research is also supported by EU through Horizon 2020, the Swedish Governmental Agency for Innovation Systems (VINNOVA), the Swedish Energy Council, the Partnership for Advanced Computing in Europe (PRACE), and the Swedish National Infrastructure for Computing (SNIC). He is the recipient of the Ingvar Carlsson Award (by SSF) in 2005, the Leslie Fox Prize in Numerical Analysis (by the Institute of Mathematics and its Applications IMA) in 2005, and the Bill Morton Prize on Computational Fluid Dynamics (by the Oxford Institute for Computational Fluid Dynamics ICFD) in 2001. He earned his Ph.D. in applied mathematics at Chalmers University; was a postdoc fellow at the Courant Institute at New York University; and a visiting researcher at Oxford University, University of Chicago, Stanford University, University of Heidelberg, UPC Barcelona, the Auckland Bioengineering Institute, and the Basque Center for Applied Mathematics. CoursesAdvanced Computation in Fluid Mechanics (DD2365), teacher, course responsible, examinerDegree Project in Computer Science and Engineering, specializing in Industrial Management, Second Cycle (DA235X), examinerDegree Project in Computer Science and Engineering, specializing in Interactive Media Technology, Second Cycle (DA232X), examinerDegree Project in Computer Science and Engineering, specializing in Machine Learning, Second Cycle (DA233X), examinerDegree Project in Computer Science and Engineering, specializing in Systems, Control and Robotics, Second Cycle (DA236X), examinerEngineering Skills in Engineering Mathematics (SA1006), teacherMethods in Scientific Computing (DD2363), teacher, course responsible, examinerProject Course in Scientific Computing (DD2444), examiner, course responsiblePublicationsPublication listPortfolioProjectsStudentsStudent research opportunitiesLinksBook chapter: A posteriori error control and mesh adaptation for turbulence (2024)IMA review of the book Methods in Computational Science (2023).Letter in Physics of Fluids on the triple decomposition of fluid flow (2023).Book: Methods in Computational Science, SIAM (2021)Article on fluid-structure interaction, Num. Methods in Engg. (2021).Letter in Physics of Fluids on stability analysis of turbulence (2021).Book: Computational Turbulence Incompressible Flow, Springer (2007)LinkedIn",
  "content_length": 3876,
  "method": "requests",
  "crawl_time": "2025-12-01 13:31:59"
}