{
  "name": "Johannes Bjerva",
  "homepage": "https://bjerva.github.io/index.html",
  "status": "success",
  "content": "I do not update this site | Johannes Bjerva, PhD I do not update this site For up-to-date information, please see my official AAU website: https://vbn.aau.dk/en/persons/jbjerva Research Profile I’m a Full Professor affiliated with the Data, Knowledge, and Web Engineering (DKW) research group at the Department of Computer Science, Aalborg University (Campus Copenhagen). Before this, I was a tenure-track assistant professor for just under a year in the same group. I’m currently the team lead for the Copenhagen branch of the Department of Computer Science, and a member of Det Unge Akademi (the Young Royal Danish Academy of Sciences and Letters). I spent three years as a postdoctoral researcher working with Isabelle Augenstein in CopeNLU, one of the NLP groups at the Department of Computer Science, University of Copenhagen. I did my PhD in Natural Language Processing at the University of Groningen working within the Parallel Meaning Bank project supervised by Johan Bos, and co-supervised by Barbara Plank. I spent most of the final year of my PhD visiting the Department of Linguistics at Stockholm University. My research is characterised by a high focus on interdisciplinary interaction between linguistics and NLP. In 2022 I was awarded a Semper Ardens: Accelerate grant of 5 million DKK from the Carlsberg Foundation which funds three PhD students and a three-year postdoc, focussing on this interaction. Most recently I’ve been exploring the possibilities and risks in using Large Language Models (LLMs, e.g. ChatGPT and similar technologies) in the education system. I teach on the Software BSc. education, where I focus on delivering high-quality teaching, with an approach emphasising elements of interactivity and connecting theory to practice. As a result, I was in 2020-2021 selected by our students as Teacher of the Year at the Department of Computer Science at AAU. Academic Background 2024- | Full Professor, Data, Knowledge, and Web Engineering (DKW), Department of Computer Science, Aalborg University (Campus Copenhagen), Denmark 2021-2024 | Associate Professor, Data, Knowledge, and Web Engineering (DKW), Department of Computer Science, Aalborg University (Campus Copenhagen), Denmark 2020-2021 | Assistant Professor (Tenure-Track), Database and Web-technologies (DW), Department of Computer Science, Aalborg University (Campus Copenhagen), Denmark 2017-2020 | Postdoctoral Researcher, Machine Learning section, Department of Computer Science, University of Copenhagen, Denmark 2013-2017 | PhD, Natural Language Processing, CLCG, University of Groningen, The Netherlands – Thesis: One Model to Rule them all – Multitask and Multilingual Modelling for Lexical Analysis 2012-2013 | M.A. Computational Linguistics Department of Linguistics, Stockholm University, Sweden 2009-2012 | B.A. Computational Linguistics Department of Linguistics, Stockholm University, Sweden Links Twitter Scholar GitHub LinkedIn Activities 2023 I stopped updating this site - for up-to-date information, please see my official AAU website: https://vbn.aau.dk/en/persons/jbjerva I’ve been admitted to Det Unge Akademi (the Young Royal Danish Academy of Sciences and Letters). I’ve been appointed team lead of the Copenhagen branch of the Department of Computer Science, AAU. I’ll be at NoDaLiDa and EACL, where some of the TypNLP project’s first publications by Marcell Fekete and Yiyi Chen will be presented! I was live on TV2 News discussing ChatGPT in education and exams. I was interviewed by TV2 on ChatGPT in Exams I was interviewed by Børsen about the impact of Large Language Models on low-resource language communities. I was interviewed for Danish national media (DR.dk and the evening news (~20:00 in this clip)) regarding ChatGPT - (1) On usage of ChatGPT to optimize writing processes, and (2) on ChatGPT in Web Search. I featured in an episode of the podcast “Lærerværelset”, discussing Language Models such as ChatGPT in the context of High School Education (in Danish). We got seed funding for a project entitled Comparing Multilingual Discourse on Migration Using NLP. Very excited to start a new collaboration with Anamaria Dutceac Segesten and Kristian Gade Kjelmann! I was interviewed for two articles in Gymnasieskolen.dk, broadly on the topic of ChatGPT in High School Education in Denmark. I gave a webinar for EGN on possibilities and risks in integrating ChatGPT and similar technologies, with 1,000 attendees. 2022 I was featured in the Danish evening news (DR) as an NLP expert, approximately at 14:05 in this clip. I appeared in the Danish national media (DR) as an NLP expert, regarding ChatGPT and its use in education. The entire project team (3 PhD students + 1 postdoc) for the Carlsberg project have started I'm hiring three PhD students, starting on 1 September 2022 I’ve been awarded a Semper Ardens: Accelerate grant / Carlsberg Foundation Young Researcher Fellowship of 5 million DKK! 2021 As of 1 November, I’m on paternity leave for 4.5 months :) As of 1 July, I’ve been promoted to associate professor at AAU Copenhagen! I gave a keynote talk at the SIGTYP 2021 workshop I gave an invited talk at HHU Düsseldorf I’m currently hosting a visit from Arturo Oncevay (PhD student, U. of Edinburgh), funded by a Multi3Generation STSM. I’ll be giving an invited talk at the Cambridge NLP Seminar Series, on 5 March I’ll be giving an invited talk at the AAU AI Seminar Series, on 25 March Looking forward to meta-reviewing papers as Area Chair for *SEM 2021 Paper on computational typology with adversarial training accepted to EACL 2021! I’ll be a keynote speaker at SigTyp 2021, co-located with EACL 2021! 2020 Happy to have been invited as one of the area chairs for EACL 2021 Our Shared Task description paper for SigTyp 2020 is now online! [Pre-print] Held a workshop for SSH scholars, as part of the DigHumLab’s Digital Literacy course [Presentation Slides] Paper on Unsupervised QA Evaluation with my previous MSc. student Lukas Muttenthaler accepted to BlackBoxNLP @ EMNLP 2020! Two papers accepted to EMNLP 2020. Looking forward to share joint work with CopeNLU and Megagon Labs Excited to begin a tenure-track assistant professorship at Aalborg University, Campus Copenhagen, from 15 August onward I’m coordinating the SIGTYP shared task on computational typology Our paper on temporal data drift in NLP has been accepted to AAAI 2020 2019 Very excited to have a grant proposal (4,000,000 SEK) on Structured Multilinguality accepted by the Swedish Research Council. The project is lead by Robert Östling at Stockolm University. Visiting Megagon Labs (Mountain View, CA) for two weeks in October/November, and gave a talk on computational typology Visited the University of Zurich and gave a talk on computational typology, in October Our paper on transductive auxiliary task self-training has been accepted to DeepLo 2019 at EMNLP! I was awarded 7,000 USD as part of the Google Cloud Platform research credits programme! Our paper entitled “Uncovering Probabilistic Implications in Typological Knowledge Bases” has been accepted to ACL 2019! Visited the University of Waikato (New Zealand) and gave a talk on computational typology, in April Our paper entitled “A Probabilistic Generative Model of Linguistic Typology” has been accepted to NAACL 2019! Our paper on Language Representations has been accepted to the journal Computational Linguistics (June 2019 issue)! I will be on a panel discussing AI in the context of the movie Her, both in February and March 2019. 2018 I was asked to comment on AI Theory of Mind for a New Scientist article. I was an external reviewer for the European Research Council (ERC - Advanced Grant - €2.5 million) Short paper with Miryam de Lhoneux accepted to EMNLP 2018! I was a lab monitor at Lisbon Machine Learning School (LxMLS 2018), Lisbon, Portugal. Presented work on computational typology at NAACL 2018, New Orleans, LA. [Article] Long paper accepted to NAACL 2018! [Article] I spent two weeks as a visiting researcher at Jörg Tiedemann’s NLP group (University of Helsinki, Finland) *Presented a paper at IWCLUL-2018 – Helsinki, Finland [Slides] 2017 I succesfully defended my PhD thesis at the University of Groningen! I was awarded a Titan Xp GPU as part of the NVIDIA GPU Grant Program! I am serving as Publicity Chair for *SEM 2018! I attended the Google NLP Summit in Zürich, Switzerland Presented a poster at the BEA workshop in Copenhagen Started my postdoc at CoAStaL NLP Submitted my PhD thesis! I’m joining the CoAStaL NLP group, post-docing for Isabelle Augenstein! Presented joint work with Robert Östling at CoNLL-SIGMORPHON 2017 in Vancouver, Canada [Article] Won best short paper at NoDaLiDa 2017! [Article] Presented two short papers at NoDaLiDa 2017 in Gothenburg, Sweden",
  "content_length": 8779,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:11"
}