{
  "name": "Johannes Fink",
  "homepage": "https://ist.ac.at/research/research-groups/fink-group",
  "status": "success",
  "content": "ISTA | Fink Group HomeResearchFink Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Fink Group Quantum Integrated Devices The Fink group’s research is positioned between quantum optics and mesoscopic condensed matter physics. The team studies quantum physics in electrical, mechanical, and optical chip-based devices with the goal of advancing quantum technology for simulation, communication, metrology, and sensing. One of the Fink group’s goals is to develop a router that converts a microwave photon to an optical photon with near-unity efficiency. With such devices, the researchers seek to perform quantum communication between superconducting circuits via robust fiber optic links at room temperature. Another focus area of the team is to develop new qubit-encoding concepts that offer intrinsic protection from noisy environments. The group has observed fluxon lifetimes of more than three hours in a recently demonstrated superconducting qubit and is exploring new concepts of dynamical control to implement nanosecond timescale quantum gates in such circuits. Group Leader Johannes Fink Professor +43 2243 9000 2020 Johannes.Fink@ist.ac.at Administrative Support Sandra Widdmann Assistant to Professors +43 2243 9000 1178 Sandra.Widdmann@ist.ac.at Team Alejandro Andres Juanes PhD Student alejandro.andresjuanes@ist.ac.at Carla Borja Espinosa PhD Student carlanataly.borjaespinosa@ist.ac.at Samarth Hawaldar PhD Student Samarth.Hawaldar@ist.ac.at Lucky Kapoor PhD Student Lucky.Kapoor@ist.ac.at Andrei Militaru Postdoc Andrei.Militaru@ist.ac.at Erfan Riyazi PhD Student Erfan.Riyazi@ist.ac.at Rishabh Sahu Postdoc +43 2243 9000 2125 Rishabh.Sahu@ist.ac.at Jennifer Sanchez Naranjo PhD Student jennifer.sanchez@ist.ac.at Christian Siegele Postdoc Christian.Siegele@ist.ac.at Andrea Trioni Postdoc Andrea.Trioni@ist.ac.at Thomas Werner PhD Student Thomas.Werner@ist.ac.at Martin Zemlicka Postdoc +43 2243 9000 2024 Martin.Zemlicka@ist.ac.at Current Projects Circuit and waveguide quantum electrodynamics | Quantum electro- and optomechanics | Quantum electro-optics and microwave photonics | Ultra-high impedance physics | Hardware-protected qubits | Multi-qubit quantum electrodynamics | Resonant nonlinear optics See the group website for up to date projects. Publications Kapoor L, Ruzickova N, Zivadinovic P, Leitner V, Sisak MA, Mweka CN, Dobbelaere JA, Katsaros G, Schanda P. 2025. Quantifying the carbon footprint of conference travel: The case of NMR meetings. Magnetic Resonance. 6(2), 243–256. View Trioni A. 2025. High-impedance quantum circuits for mesoscopic physics : Geometric superinductors and insulating Josephson Chains. Institute of Science and Technology Austria. View Hawaldar S, Khaire SS, Delsing P, Suri B. 2025. On-demand single-microwave-photon source in a superconducting circuit with wideband frequency tunability. Physical Review Applied. 23(4), 044042. View Sett R. 2025. Quantum remote sensing and non-equilibrium phase transitions in the microwave regime. Institute of Science and Technology Austria. View Arnold GM, Werner T, Sahu R, Kapoor L, Qiu L, Fink JM. 2025. All-optical superconducting qubit readout. Nature Physics. 21, 9470. View View All Publications ReX-Link: Johannes Fink Career Since 2021 Professor, Institute of Science and Technology Austria (ISTA)2016 – 2021 Assistant Professor, Institute of Science and Technology Austria (ISTA)2015 – 2016 Senior Staff Scientist, California Institute of Technology, Pasadena, USA2012 – 2015 IQIM Postdoctoral Research Scholar, California Institute of Technology, Pasadena, USA2011 – 2012 Postdoctoral Research Fellow, ETH Zurich, Switzerland2010 PhD, ETH Zurich, Switzerland Selected Distinctions 2023 ERC Consolidator Grant2018 Fritz Kohlrausch Award2017 ERC Starting Grant2012 IQIM Postdoctoral Prize Fellowship2010 ETH Medal for Outstanding Dissertation2009 CSF Award at the QSIT Conference on Quantum Engineering Additional Information Download CVView group websitePhysics & Beyond at ISTA Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6430,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:14"
}