{
  "name": "Johan Jeuring",
  "homepage": "http://www.staff.science.uu.nl/~jeuri101/homepage/Publications/index.html",
  "status": "success",
  "content": "List of Publications List of Publications 2020 Sally Fincher, Johan Jeuring, Craig S. Miller, Peter Donaldson, Benedict du Boulay, Matthias Hauswirth, Arto Hellas, Felienne Hermans, Colleen Lewis, Andreas Mühling, Janice L. Pearce, and Andrew Petersen. Notional machines in computing education: the education of attention. In 2020 ITiCSE Working Group Reports (ITiCSE-WGR ’20), 2020. Hieke Keuning, Bastiaan Heeren, and Johan Jeuring. Student Refactoring Behaviour in a Programming Tutor. In Proceedings Koli Calling '20: the 20th Koli Calling International Conference on Computing Education Research, 2020. Imke de Jong and Johan Jeuring. Computational thinking interventions in higher education: a scoping literature review of interventions used to teach computational thinking. In Proceedings Koli Calling '20: the 20th Koli Calling International Conference on Computing Education Research, 2020. Josje Lodder, Bastiaan Heeren, Johan Jeuring, and Wendy Neijenhuis. Generation and Use of Hints and Feedback in a Hilbert-Style Axiomatic Proof Tutor. In Journal of Artificial Intelligence in Education, 2020. Timo Overbeek, Raja Lala, and Johan Jeuring. Scenario smells: signalling potential problems indialogue scenarios in a serious game. In International Journal of Serious Games, 2020. Sietske Tacoma, Paul Drijvers, Bastiaan Heeren, and Johan Jeuring. Intelligent Feedback on Hypothesis Testing. In Journal of Artificial Intelligence in Education, 2020. Sietske Tacoma and Paul Drijvers, and Johan Jeuring. Combined inner and outer loop feedback in an intelligent tutoring system for statistics in higher education. In Journal of Computer Assisted Learning, 2020. Sander Kamps, Bastiaan Heeren, and Johan Jeuring. Assessing the quality of evolving Haskell systems by measuring structural inequality. In Proceedings Haskell Symposium 2020. Sally Fincher, Johan Jeuring, Craig S Miller, Peter Donaldson, Benedict du Boulay, Matthias Hauswirth, Arto Hellas, Felienne Hermans, Colleen Lewis, Andreas Mühling, Janice L Pearce, Andrew Petersen. Capturing and Characterising Notional Machines. Proceedings of the 2020 ACM Conference on Innovation and Technology in Computer Science Education. Bastiaan Heeren and Johan Jeuring. Automated feedback for mathematical learning environments. In Proceedings of ICTMT 14, 2020. Josje Lodder, Bastiaan Heeren, and Johan Jeuring. Providing hints, next steps and feedback in a tutoring system for structural induction. In P. Quaresma, W. Neuper and J. Marcos (editors): Theorem proving components for Educational software 2019 (ThEdu’19), EPTCS 313, pages 17 – 34, 2020. Sietske Tacoma, Corine Geurts, Bert Slof, Johan Jeuring, and Paul Drijvers. Enhancing learning with inspectable student models: Worth the effort? To appear in Computers in Human Behavior, 2020. 2019 Raja Lala, Gemma Corbalan, and Johan Jeuring. Evaluation of Interventions in Blended Learning Using a Communication Skills Serious Game. A. Liapis et al. (editors), Proceedings of GALA 2019, LNCS 11899, pages 322 – 331, 2019. (The final authenticated version is available online at https://doi.org/10.1007/978-3-030-34350-7_31.) Raja Lala, Johan Jeuring, and Marcell van Geest. Scaffolding Open Text Input in a Scripted Communication Skills Learning Environment. A. Liapis et al. (editors), Proceedings of GALA 2019, LNCS 11899, pages 169 – 179, 2019. (The final authenticated version is available online at https://doi.org/10.1007/978-3-030-34350-7_17.) Renate van der Bent, Johan Jeuring, and Bastiaan Heeren. The diagnosing behaviour of intelligent tutoring systems. In Proceedings of ECTEL 2019: the Fourteenth European Conference on Technology Enhanced Learning, LNCS 11722, pages 112 – 126, Springer, 2019. (The final authenticated version is available online at https://doi.org/10.1007/978-3-030-29736-7_9.) Hieke Keuning, Bastiaan Heeren, and Johan Jeuring. How teachers would help students to improve their code. In Proceedings of ITiCSE 2019: the 24th Annual Conference on Innovation and Technology in Computer Science Education, ACM Press, 2019. Sietske Tacoma, Bastiaan Heeren, Johan Jeuring, and Paul Drijvers. Automated feedback on the structure of hypothesis tests. (Extended version of paper below.) In Proceedings of the Eleventh Congress of the European Society for Research in Mathematics Education, pages 2969 - 2976, 2019. Sietske Tacoma, Bastiaan Heeren, Johan Jeuring and Paul Drijvers Automated feedback on the structure of hypothesis tests In Proceedings of AIED 2019: the International Conference on Artificial Intelligence in Education, 2019 Ștefan Rușeți, Raja Lala, Gabriel Guțu-Robu, Mihai Dascălu, Johan Jeuring, and Marcell van Geest. Semantic Matching of Open Texts to Pre-scripted Answers in Dialogue-Based Learning In Proceedings AIED 2019: the International Conference on Artificial Intelligence in Education, 2019. Raja Lala, Marcell van Geest, Ștefan Rușeți, Johan Jeuring, Mihai Dascălu, Jordy van Dortmont, Gabriel Guțu-Robu, and Michiel Hulsbergen. Enhancing Free-text Interactions in a Communication Skills Learning Environment. In Proceedings of CSCL 2019: the 13th International Conference on Computer Supported Collaborative Learning, Volume 2, pages 877 – 878, ISLS, 2019. Josje Lodder, Bastiaan Heeren and Johan Jeuring. A comparison of elaborated and restricted feedback in LogEx, a tool for teaching rewriting logical formulae. Journal of Computer Assisted Learning, 2019. Nico Naus and Johan Jeuring. Building a Generic Feedback System for Rule-Based Problems. In David Van Horn, John Hughes, editors, Proceedings of TFP 2016: the 17th International Conference on Trends in Functional Programming, LNCS 10447, pages 172 – 191, Springer, 2019. Aurora Constantin, Catherine Lai, Elaine Farrow, Beatrice Alex, Ruth Pel-Littel, Henk Herman Nap, and Johan Jeuring. ”Why is the doctor a man?” Reactions of Older Adults to a Virtual Training Doctor. In Proceedings of CHI 2019: the ACM CHI Conference on Human Factors in Computing Systems, 2019. A Systematic Literature Review of Automated Feedback Generation for Programming ExercisesHieke Keuning, Johan Jeuring, Bastiaan HeerenACM Transactions on Computing Education (TOCE), 2018 2018 Ruth Pel-Littel, Henk van Zeijts, Nadine Schram, Henk Herman Nap, and Johan Jeuring. A training simulation for practicing shared decision making for older patients. In Proceedings ICTH 2018: the 8th International Conference on Current and Future Trends of Information and Communication Technologies in Healthcare, 2018. Bastiaan Heeren, Johan Jeuring, Sergey Sosnovsky, Paul Drijvers, Peter Boon, Sietske Tacoma, Brigitte Grugeon-Allys, Franoise Chenevotot, Jesse Koops, Armin Weinberger, Jorn van Wijk, and Ferdinand van Walree. Fine-grained cognitive assessment based on free-form input for math story problems. In V. Pammer-Schindler et al., editors, Proceedings of ECTEL 2018: the Thirteenth European Conference on Technology Enhanced Learning, LNCS 11082, pages 1-15, Springer, 2018. Use expert knowledge instead of data: generating hints for hour of code exercisesMilo Buwalda, Johan Jeuring, Nico NausL@S '18 Proceedings of the Fifth Annual ACM Conference on Learning at Scale, 2018 Sietske Tacoma, Sergey Sosnovsky, Peter Boon, Johan Jeuring, and Paul Drijvers The Interplay between Inspectable Student Models and Didactics of Statistics In Digital Experiences in Mathematics Education, 2018. Jürgen Börstler, Harald Störrle, Daniel Toll, Jelle van Assema, Rodrigo Duran, Sara Hooshangi, Johan Jeuring, Hieke Keuning, Carsten Kleiner, and Bonnie MacKellar. ``I know it when I see it'' - Perceptions of Code Quality. In ITiCSE'17 Working Group Reports, 2018. 2017 Nienke van Es and Johan Jeuring. Designing and comparing two Scratch-based teaching approaches for students aged 10-12 years. In Proceedings of the 17th Koli Calling International Conference on Computing Education Research, 2017. Hugo Arends, Bastiaan Heeren, Hieke Keuning, and Johan Jeuring. An intelligent tutor to learn the evaluation of microcontroller I/O programming expressions. In Proceedings of the 17th Koli Calling International Conference on Computing Education Research, 2017. Nico Naus and Johan Jeuring. Building a generic feedback system for rule-based problems. In TFP 2016: the 17th Symposium on Trends in Functional Programming. Raja Lala, Johan Jeuring and Timo Overbeek. Analysing and adapting communication scenarios in virtual learning environments for one-to-one communication skills training. In iLRN 2017: the Immersive Learning Research Network conference track on personalisation in immersive and game-based learning environments. Ivica Milovanovic and Johan Jeuring. Cognitive Modelling with Term Rewriting. In ICCM 2017: the 15th Annual Meeting of the International Conference on Cognitive Modelling. Raja Lala, Johan Jeuring, Jordy van Dortmont, and Marcell van Geest. Scenarios in virtual learning environments for one-to-one communication skills training. In ETHE: the International Journal of Educational Technology in Higher Education. Bastiaan Heeren, and Johan Jeuring. An extensible domain-specific language for describing problem-solving procedures. In AIED 2017. Hieke Keuning, Bastiaan Heeren, and Johan Jeuring. Code quality issues in student programs. In ITiCSE 2017. Josje Lodder, Bastiaan Heeren, and Johan Jeuring. Generating hints and feedback for Hilbert-style axiomatic proofs. In SIGCSE 2017. Alex Gerdes, Bastiaan Heeren, Johan Jeuring, and Thomas van Binsbergen. Ask-Elle: an adaptable programming tutor for Haskell giving automated feedback. In Journal of Artificial Intelligence in Education, 2017. 2016 Josje Lodder, Bastiaan Heeren, and Johan Jeuring. A domain reasoner for propositional logic. In Journal of Universal Computer Science, vol. 22, no. 8, 1097-1122, 2016. Ivica Milovanovic and Johan Jeuring. The automatic generation of knowledge spaces from problem solving strategies. In Alessandro Micarelli, John Stamper, and Kitty Panourgia, editors, Proceedings of ITS 2016: the ",
  "content_length": 45013,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:10"
}