{
  "name": "Johannes Kinder",
  "homepage": "https://www.plai.ifi.lmu.de/people/professors/kinder",
  "status": "success",
  "content": "Professor Dr. Johannes Kinder - Chair of Programming Languages and AI - LMU Munich Links and Functions www.en.lmu.de Faculty of Mathematics, Informatics, and Statistics Institute of Informatics Sitemap Breadcrumb Navigation Home Team Professors Professor Dr. Johannes Kinder Main Navigation News Team Professors Administrative Staff Scientific Staff Technical Staff Student Assistants Alumni Publications Research Teaching Jobs Contact print Content Prof. Dr. Johannes Kinder Head of Group Contact Ludwig-Maximilians-Universität MünchenInstitut für InformatikPLAI - Lehrstuhl für Programmiersprachen und KIOettingenstr. 6780538 MünchenGermany Room: E 104 Phone: +49-89-2180-9310 Email: j o h a n n e s . k i n d e r [at] lmu * de Office hours: By appointment Short Biography Prof. Dr. Johannes Kinder is Professor and Chair of Programming Languages and Artificial Intelligence at the Institute of Informatics at LMU Munich. In his research, he works on securing software systems using program analysis and machine learning. He focuses on the detection of software vulnerabilities and malware, reverse engineering, and on instrumenting software to prevent exploitation. Hailing from a background in formal methods, he enjoys applying well-founded theory to concrete problems in systems security. Before joining LMU, Johannes Kinder held positions as full professor at the Research Institute CODE of Bundeswehr University Munich and at Royal Holloway, University of London. He was a postdoctoral researcher at École Polytechnique Fédérale de Lausanne (EPFL) and earned his doctorate from TU Darmstadt and his Diplom from TU München, both in Computer Science. Conference and Workshop Organization ACNS 2025: General Chair ACM CCS 2019: General Chair ESSoS 2016: Doctoral Symposium Chair Program Committee Memberships 2026: ACM CCS, NDSS 2025: ACSAC, IEEE SecDev, DIMVA, STMUS 2024: ACSAC, IEEE SecDev, DIMVA 2023: ACSAC, IEEE SecDev, DIMVA 2022: IEEE S&P, DIMVA, ICTAC, PriSC, CheckMATE, GI Sicherheit 2021: ACM CCS, DIMVA, CheckMATE 2020: RAID 2019: RAID, APLAS 2017: ESSoS 2016: SPRO, RV, PPREW, ESSoS 2015: SPRO 2014: SAS, ICST, PPREW, EUC 2013: ICST, PPREW 2012: EDCC, SOFSEM, SEW 2011: SEW Selected Publications A list of all publications can be found here or on DBLP and Google Scholar. Tristan Benoit, Yunru Wang, Moritz Dannehl, and Johannes Kinder. BLens: Contrastive Captioning of Binary Functions using Ensemble Embedding. In 34th USENIX Security Symposium (USENIX Security), USENIX Association, 2025. BibTeX PDF @inproceedings{usenixsecurity25-blens, author = {Tristan Benoit and Yunru Wang and Moritz Dannehl and Johannes Kinder}, title = {{BLens}: Contrastive Captioning of Binary Functions using Ensemble Embedding}, booktitle = {34th USENIX Security Symposium (USENIX Security)}, publisher = {USENIX Association}, year = {2025}, } James Patrick-Evans, Moritz Dannehl, and Johannes Kinder. XFL: Naming Functions in Binaries with Extreme Multi-label Learning. In Proc. IEEE Symp. Security and Privacy (S&P), pp. 2375–2390, IEEE, 2023. BibTeX PDF @inproceedings{oakland23-xfl, author = {James Patrick-Evans and Moritz Dannehl and Johannes Kinder}, title = {{XFL}: Naming Functions in Binaries with Extreme Multi-label Learning}, booktitle = {Proc. IEEE Symp. Security and Privacy (S\\&P)}, pages = {2375--2390}, publisher = {IEEE}, year = {2023}, doi = {10.1109/SP46215.2023.00096}, } Hernán Ponce-de-León and Johannes Kinder. Cats vs. Spectre: An Axiomatic Approach to Modeling Speculative Execution Attacks. In Proc. IEEE Symp. Security and Privacy (S&P), pp. 235–248, IEEE, 2022. BibTeX PDF @inproceedings{oakland22-cats-vs-spectre, author = {Hern{\\'{a}}n Ponce-de-Le{\\'{o}}n and Johannes Kinder}, title = {Cats vs. Spectre: An Axiomatic Approach to Modeling Speculative Execution Attacks}, booktitle = {Proc. IEEE Symp. Security and Privacy (S\\&P)}, pages = {235--248}, publisher = {IEEE}, year = {2022}, doi = {10.1109/SP46214.2022.00082}, } Daniel Lehmann, Johannes Kinder, and Michael Pradel. Everything Old is New Again: Binary Security of WebAssembly. In 29th USENIX Security Symposium (USENIX Security), pp. 217–234, USENIX Association, 2020. BibTeX PDF @inproceedings{usenixsecurity20-wasm, author = {Daniel Lehmann and Johannes Kinder and Michael Pradel}, title = {Everything Old is New Again: Binary Security of WebAssembly}, booktitle = {29th USENIX Security Symposium (USENIX Security)}, pages = {217--234}, year = {2020}, publisher = {USENIX Association}, } Feargus Pendlebury, Fabio Pierazzi, Roberto Jordaney, Johannes Kinder, and Lorenzo Cavallaro. TESSERACT: Eliminating Experimental Bias in Malware Classification across Space and Time. In 28th USENIX Security Symposium (USENIX Security), pp. 729–746, USENIX Association, 2019. BibTeX PDF @inproceedings{usenixsecurity19-tesseract, author = {Feargus Pendlebury and Fabio Pierazzi and Roberto Jordaney and Johannes Kinder and Lorenzo Cavallaro}, title = {{TESSERACT}: Eliminating Experimental Bias in Malware Classification across Space and Time}, booktitle = {28th USENIX Security Symposium (USENIX Security)}, pages = {729--746}, year = {2019}, publisher = {USENIX Association}, } Blake Loring, Duncan Mitchell, and Johannes Kinder. Sound Regular Expression Semantics for Dynamic Symbolic Execution of JavaScript. In Proc. ACM SIGPLAN Conf. Programming Language Design and Implementation (PLDI), pp. 425–438, ACM, 2019. BibTeX PDF @inproceedings{pldi19-regex, author = {Blake Loring and Duncan Mitchell and Johannes Kinder}, title = {Sound Regular Expression Semantics for Dynamic Symbolic Execution of JavaScript}, booktitle = {Proc. ACM SIGPLAN Conf. Programming Language Design and Implementation (PLDI)}, pages = {425--438}, publisher = {ACM}, year = {2019}, doi = {10.1145/3314221.3314645}, } Jonas Wagner, Volodymyr Kuznetsov, George Candea, and Johannes Kinder. High System-Code Security with Low Overhead. In Proc. IEEE Symp. Security and Privacy (S&P), pp. 866-879, IEEE, 2015. BibTeX PDF @inproceedings{oakland15-asap, author = {Jonas Wagner and Volodymyr Kuznetsov and George Candea and Johannes Kinder}, title = {High System-Code Security with Low Overhead}, booktitle = {Proc. IEEE Symp. Security and Privacy (S\\&P)}, pages = {866-879}, publisher = {IEEE}, year = {2015}, } Stefan Bucur, Johannes Kinder, and George Candea. Prototyping Symbolic Execution Engines for Interpreted Languages. In Proc. 19th Int. Conf. Architectural Support for Programming Languages and Operating Systems (ASPLOS), pp. 239–254, ACM, 2014. BibTeX PDF @inproceedings{asplos14-chef, author = {Stefan Bucur and Johannes Kinder and George Candea}, title = {Prototyping Symbolic Execution Engines for Interpreted Languages}, booktitle = {Proc. 19th Int. Conf. Architectural Support for Programming Languages and Operating Systems (ASPLOS)}, pages = {239--254}, doi = {10.1145/2541940.2541977}, publisher = {ACM}, year = {2014}, } Volodymyr Kuznetsov, Johannes Kinder, Stefan Bucur, and George Candea. Efficient state merging in symbolic execution. In Proc. ACM SIGPLAN Conf. Programming Language Design and Implementation (PLDI), pp. 193–204, ACM, 2012. BibTeX PDF @inproceedings{pldi12-statemerging, author = {Volodymyr Kuznetsov and Johannes Kinder and Stefan Bucur and George Candea}, title = {Efficient state merging in symbolic execution}, pages = {193--204}, booktitle = {Proc. ACM SIGPLAN Conf. Programming Language Design and Implementation (PLDI)}, publisher = {ACM}, year = {2012}, } Johannes Kinder, Stefan Katzenbeisser, Christian Schallhart, and Helmut Veith. Proactive Detection of Computer Worms Using Model Checking. IEEE Trans. Dependable Sec. Comput., 7(4):424–438, October 2010. BibTeX PDF @article{tdsc10-mocca, author = {Johannes Kinder and Stefan Katzenbeisser and Christian Schallhart and Helmut Veith}, title = {Proactive Detection of Computer Worms Using Model Checking}, journal = {IEEE Trans. Dependable Sec. Comput.}, volume = {7}, number = {4}, pages = {424--438}, month = oct, year = {2010}, } Johannes Kinder and Helmut Veith. Jakstab: A Static Analysis Platform for Binaries. In Proc. 20th Int. Conf. Computer Aided Verification (CAV), pp. 423–427, Springer, 2008. BibTeX PDF @inproceedings{cav08-jakstab, author = {Johannes Kinder and Helmut Veith}, title = {Jakstab: A Static Analysis Platform for Binaries}, booktitle = {Proc. 20th Int. Conf. Computer Aided Verification (CAV)}, pages = {423--427}, publisher = {Springer}, series = {LNCS}, volume = {5123}, year = {2008}, } print top Footer Contact Privacy Policy Imprint Accessibility",
  "content_length": 8539,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:19"
}