{
  "name": "Johannes Schilp",
  "homepage": "https://www.uni-augsburg.de/de/fakultaet/fai/informatik/prof/pi/lehrstuhl/mitarbeiter/schilp",
  "status": "success",
  "content": "Prof. Dr.-Ing. Johannes Schilp Lehrstuhl für Produktionsinformatik Universität Fakultäten Fakultät für Angewandte Informatik Institut für Informatik Lehrstühle und Professuren der Informatik Ingenieurinformatik mit Schwerpunkt Produktionsinformatik Lehrstuhl Mitarbeiter Prof. Dr.-Ing. Johannes Schilp Prof. Dr.-Ing. Johannes Schilp Professor Lehrstuhl für Produktionsinformatik Telefon: +49 (0)821 598 69310 E-Mail: johannes.schilp@informatik.uni-augsburginformatik.uni-augsburg.de () Raum: 3060 (F) Sprechzeiten: Nach Vereinbarung Kontakt (.vcf) Lebenslauf Studium Maschinenbau an der Technischen Universität München Promotion am iwb der Technischen Universität München 2007 bis 2015: Geschäftsführer des Produktionstechnischen Anwenderzentrums Augsburg Seit 2015: Universitätsprofessor und Ordinarius am Lehrstuhl für Produktionsinformatik der Universität Augsburg Mitglied der wissenschaftlichen Gesellschaft für Montage, Handhabung und Industrieroboter WGMHI Hauptabteilungsleiter des Wissenschaftsbereichs Verarbeitungstechnik am Fraunhofer IGCV Mitglied des Expertengremiums Additive Fertigung bei Bayern Innovativ und des Leitungsgremiums des Arbeitskreises Automatisierung der additiven Fertigung im VDMA. Gründungs- und Vorstandsmitglied des Industry Business Network 4.0 e.V. Forschungsschwerpunkte Digitalisierung und Vernetzung in der Produktion Integration additiver Fertigungsprozesse in Produktionsabläufe Publikationen 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2008 | 2007 | 2006 | 2004 | 2003 | 2002 2025 Mario Luber, Sarah Wagner, Marc Wegmann and Johannes Schilp. 2025. Concept of a plug-and-play, machine learning digital twin of the production resource for detailed capacity planning and scheduling. Procedia Computer Science 253, 1266-1275. DOI: 10.1016/j.procs.2025.01.188PDF | BibTeX | RIS | DOI Christopher Singer, Max Horn, Georg Schlick, Johannes Schilp, Saba Zabihzadeh, Christina-Margarita Charalampidou and Nikolaos D. Alexopoulos. 2025. Multi-material laser powder bed fusion: the effect of cross-contaminations of Cu particles in AlSi10Mg feedstock on the mechanical properties of the part. Procedia Structural Integrity 68, 854-860. DOI: 10.1016/j.prostr.2025.06.141PDF | BibTeX | RIS | DOI Thomas Bjarsch, Klaus Drechsler and Johannes Schilp. 2025. Ontologies for FAIR data in additive manufacturing: a use case‐based evaluation. Advanced Engineering Materials 27, 8, 2401528. DOI: 10.1002/adem.202401528PDF | BibTeX | RIS | DOI 2024 Raoul Zebisch and Johannes Schilp. 2024. A template for digital human representation in digital twin simulations of social human-robot interaction. In 2024 4th International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME), 4-6 November 2024, Male, Maldives. IEEE, Piscataway, NJ, 1-6 DOI: 10.1109/iceccme62383.2024.10796060PDF | BibTeX | RIS | DOI Patrick Zimbrod, Michael Fleck and Johannes Schilp. 2024. An application-driven method for assembling numerical schemes for the solution of complex multiphysics problems. Applied System Innovation 7, 3, 35. DOI: 10.3390/asi7030035PDF | BibTeX | RIS | DOI Tom Roeger, Ludwig Vogt, Tobias Friedrich and Johannes Schilp. 2024. Analysis of the relationship between training data volume and model quality for surrogate models in physical simulations. Procedia CIRP 126, 745-750. DOI: 10.1016/j.procir.2024.08.302PDF | BibTeX | RIS | DOI Andreas Leinenbach, Marcel Wagner, Fabio Oettl and Johannes Schilp. 2024. Anwendung des Process Data Twin. WT Werkstattstechnik online 114, 3, 40-45. DOI: 10.37544/1436-4980-2024-03-12PDF | BibTeX | RIS | DOI Robin Huwa, Marcus Albrecht, Andreas Leinenbach and Johannes Schilp. 2024. Flexibility dimensions in cyber-physical production systems. In 2024 4th International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME), 4-6 November 2024, Male, Maldives. IEEE, Piscataway, NJ, 1-6 DOI: 10.1109/iceccme62383.2024.10796674PDF | BibTeX | RIS | DOI Florian Pleier and Johannes Schilp. 2024. Predictive-reactive scheduling to increase robustness of production systems. In 2024 4th International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME), 4-6 November 2024, Male, Maldives. IEEE, Piscataway, NJ, 1-6 DOI: 10.1109/iceccme62383.2024.10796054PDF | BibTeX | RIS | DOI Andreas Leinenbach, Marcel Wagner, Fabio Oettl and Johannes Schilp. 2024. The process data twin for digitized production. In D. Herberger, M. Hübner (Eds.). Proceedings of the CPSL 2024 - 6th Conference on Production Systems and Logistics. publish-Ing., Hannover, 647-655 DOI: 10.15488/17753PDF | BibTeX | RIS | DOI 2023 Oliver Kunze, Johannes Schilp, Fabian Frommer, Fabio Oettl and Galiya Klinkova. 2023. 3D-Druck für Führungskräfte: Technik, Prozesse, Wirtschaftlichkeit und Umweltverträglichkeit der additiven Fertigung. Carl Hanser, München. DOI: 10.3139/9783446477285BibTeX | RIS | DOI Ludwig Vogt, Robert Ludwig and Johannes Schilp. 2023. Automatic end tool alignment through plane detection with a RANSAC-algorithm for robotic grasping. Procedia CIRP 118, 253-258. DOI: 10.1016/j.procir.2023.06.044PDF | BibTeX | RIS | DOI Fabio Oettl, Leonard Eckart and Johannes Schilp. 2023. Cost estimation approach of a digital twin implementation in industry. Procedia CIRP 118, 318-323. DOI: 10.1016/j.procir.2023.06.055PDF | BibTeX | RIS | DOI Tobias Wittmeir, Fabio Oettl and Johannes Schilp. 2023. Digitaler Zwilling für die additive Fertigung. wt Werkstattstechnik online 113, 3, 119-123. DOI: 10.37544/1436-4980-2023-03-53PDF | BibTeX | RIS | DOI Fabio Oettl, Tobias Tischer, Tobias Wittmeir and Johannes Schilp. 2023. From data to decisions: a method for evaluating the strategic value of digital twins. In 3rd International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME), 19-21 July 2023, Tenerife, Canary Islands, Spain. IEEE, Piscataway, NJ, 1-5 DOI: 10.1109/iceccme57830.2023.10252781PDF | BibTeX | RIS | DOI Fabio Oettl, Sebastian Hörbrand, Tobias Wittmeir and Johannes Schilp. 2023. Method for evaluating the monetary added value of the usage of a digital twin for additive manufacturing. Procedia CIRP 118, 717-722. DOI: 10.1016/j.procir.2023.06.123PDF | BibTeX | RIS | DOI Fabio Oettl, Sebastian Dietl, Sebastian Göltl, Daniel Müssig and Johannes Schilp. 2023. Method for identifying and evaluating the fields of application of a digital twin. In D. Herberger, M. Hübner, V. Stich (Eds.). Proceedings of the Conference on Production Systems and Logistics, CPSL 2023, February 28 ‐ March 3, 2023, Santiago de Querétaro, Mexico. publish-Ing, Hannover, 290-300 DOI: 10.15488/13448PDF | BibTeX | RIS | DOI Tobias Wittmeir, Michael Heider, André Schweiger, Michaela Krä, Jörg Hähner, Johannes Schilp and Joachim Berlak. 2023. Towards robustness of production planning and control against supply chain disruptions. In David Herberger, Marco Hübner, Volker Stich (Eds.). Proceedings of the Conference on Production Systems and Logistics: CPSL 2023. publish-Ing., Hannover, 65-75 DOI: 10.15488/13425PDF | BibTeX | RIS | DOI 2022 Fabio Oettl, Jan Schoeler and Johannes Schilp. 2022. Development of a method for evaluating the benefits of using a digital twin. In 2022 International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME), 16-18 November 2022, Maldives, Maldives. IEEE, Piscataway, NJ, 1-7 DOI: 10.1109/iceccme55909.2022.9988218PDF | BibTeX | RIS | DOI Lukas Langer, Matthias Schmitt, Georg Schlick and Johannes Schilp. 2022. Development of an automated process chain for hybrid additive manufacturing using laser powder bed fusion. Procedia CIRP 112, 358-363. DOI: 10.1016/j.procir.2022.09.009PDF | BibTeX | RIS | DOI Patrick Zimbrod, Magdalena Schreter and Johannes Schilp. 2022. Efficient simulation of complex capillary effects in advanced manufacturing processes using the finite volume method. In Aishath Shehenaz Adam, Mahendra Gooroochurn, Rıza Altınok (Eds.). 2022 International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME), 16-18 November 2022, Maldives. IEEE, Piscataway, NJ, 1-6 DOI: 10.1109/ICECCME55909.2022.9988504PDF | BibTeX | RIS | DOI Julia Foerster, Krunoslav Vranjes, Maximilian Binder, Georg Schlick, Christian Seidel and Johannes Schilp. 2022. Electrophotographic powder application for metal powder bed based additive manufacturing. Procedia CIRP 113, 353-360. DOI: 10.1016/j.procir.2022.09.142PDF | BibTeX | RIS | DOI Julia Foerster, Marco Michatz, Maximilian Binder, Alexander Frey, Christian Seidel, Georg Schlick and Johannes Schilp. 2022. Electrostatic powder attraction for the development of a novel recoating system for metal powder bed-based additive manufacturing. Journal of Electrostatics 115, 103641. DOI: 10.1016/j.elstat.2021.103641PDF | BibTeX | RIS | DOI Christian Härdtlein, Florian Karg, Julia Berger and Johannes Schilp. 2022. Energieorientierte Leitsteuerung mobiler Roboter / Energy-oriented control system for mobile robots. wt Werkstattstechnik online 112, 3, 161-165. DOI: 10.37544/1436-4980-2022-03-59BibTeX | RIS | DOI Ludwig Vogt and Johannes Schilp. 2022. Finite element based compression and volumetric load analysis for grasped objects. In 2022 International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME), 16-18 November 2022, Maldives, Maldives. IEEE, Piscataway, NJ, 1-6 DOI: 10.1109/iceccme55909.2022.9987947PDF | BibTeX | RIS | DOI Michaela Krä, Leonard Eckart, Marinella Rito and Johannes Schilp. 2022. Levels of autonomy in production logistics: terminology and framework. In D. Herberger, M. Hübner (Eds.). Proceedings of the Conference on Production Systems and Logistics: CPSL 2022. publish-Ing., Hannover, 713-722 DOI: 10.15488/12140PDF | BibTeX | RIS | DOI Christopher Singer, Matthias Schmitt, Georg Schlick and Johannes Schilp. 2022. Multi-mater",
  "content_length": 26976,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:18"
}