{
  "name": "Johannes Krugel",
  "homepage": "https://www.dei.uni-hannover.de/de/krugel",
  "status": "success",
  "content": "Prof. Dr. Johannes Krugel – Didaktik der Elektrotechnik und Informatik – Leibniz Universität Hannover Prof. Dr. Johannes Krugel – Didaktik der Elektrotechnik und Informatik – Leibniz Universität Hannover Fakultät Fakultät für Elektrotechnik und Informatik English Start Kontakt English Didaktik der Elektrotechnik und Informatik Fachgebiet Team Prof. Dr. Johannes Krugel Prof. Dr. Johannes Krugel © Julian Martitz Prof. Dr. Johannes Krugel Telefon +49 511 762 5516 Fax +49 511 762 4012 E-Mail krugeldei.uni-hannover.de Adresse Appelstraße 9a 30167 Hannover Gebäude 3408 Raum 1211 © Julian Martitz Prof. Dr. Johannes Krugel Telefon +49 511 762 5516 Fax +49 511 762 4012 E-Mail krugeldei.uni-hannover.de Adresse Appelstraße 9a 30167 Hannover Gebäude 3408 Raum 1211 Funktionen Stellvertretung der Professorinnen und Professoren Fakultätsrat der Fakultät für Elektrotechnik und Informatik Fachstudienberatung Lehramt Informatik Fachstudienberatungen der Fakultät für Elektrotechnik und Informatik (er/ihm) Professur für Digitale Bildung und Didaktik der Informatik Research and projects My research interests are in the fields of computer science education and computer-supported learning. Current projects: Leibniz AI Academy - Disziplinübergreifende, hybride Micro-Degrees für Studium & Weiterbildung, BMBF, Künstliche Intelligenz in der Hochschulbildung AKoFOOP: Automatisierte Kompetenzmessung und Feedbackerzeugung zum objektorientierten Programmieren, DFG NFDIxCS (National Research Data Infrastructure for and with Computer Science): Sub project \"Reproduzierbarkeit von Studien im Bereich E-Assessment von Programmieraufgaben\", DFG LernMINT - Datengestützter Unterricht in den MINT-Fächern, Promotionsprogramm, Ministerium für Wissenschaft und Kultur, Niedersachsen Lernen objektorientierter Programmierung Completed projects: Kompetenzzentrum für Lehrkräftefortbildung Robotik Hannover, Mensch-Roboter-Kollaboration Robonatives, Landesinitiative n-21 Studienbezogene Verstärkung der Exzellenzstrategie (TU München) KETTI: Kompetenzerwerb von Tutorinnen und Tutoren in der Informatik, funded by the BMBF (German Federal Ministry of Education and Research). Leitung der Nachqualifikation von Informatiklehrkräften für das bayerische Gymnasium (Masterplan BAYERN DIGITAL II) Inklusion im Informatikunterricht PAPI: Practical Approximate Pattern Matching with Index Structures, funded by the DFG (German Research Foundation) as part of the focus program 1307 Algorithm Engineering. Academic Activities Associate editor (AE) / Program committee (PC) / Reviewer for the following organizations, journals, and conferences: TOCE Journal (AE): ACM Transactions on Computing Education Koli Calling (PC): International Conference on Computing Education Research WiPSCE (PC): Workshop in Primary and Secondary Computing Education INFOS (PC): GI-Fachtagung Informatik und Schule EDUCON (PC): IEEE Global Engineering Education Conference DFG: Deutsche Forschungsgemeinschaft BMBWF: Bundesministerium für Bildung, Wissenschaft und Forschung (Österreich) / OeAD Österreichischer Austauschdienst CC2020: ACM/IEEE Computing Curricula 2020 CSE Journal: Computer Science Education CSE: IEEE International Conference on Computational Science and Engineering ICALP: International Colloquium on Automata, Languages and Programming CSR: International Computer Science Symposium in Russia PARS: Parallel-Algorithmen, -Rechnerstrukturen und -Systemsoftware WG: International Workshop on Graph-Theoretic Concepts in Computer Science Conference organization: till 2022: Tag der Informatiklehrerinnen und -lehrer in Niedersachsen und Bremen JASS 2012: Joint Advanced Student School in St. Petersburg \tMember of the organization committee ISSAC 2010: International Symposium on Symbolic and Algebraic Computation \tMember of the local organization committee Publications Zeige Ergebnisse 1 - 34 von 34 2025 Stanja, J., Dannemann, S., Krugel, J., & Hoppe, A. (2025). Investigating evidence-oriented generation of synthetic text data with a generative large language model in science education. International Journal of Science Education. Vorabveröffentlichung online. https://doi.org/10.1080/09500693.2025.2538834 Details im Forschungsportal „Research@Leibniz University“ Stanke, L., Olbricht, C., Goedicke, M., & Krugel, J. (2025). Using graph-based queries to detect patterns in program structures for introductory programming. In Automatisierte Bewertung von Programmieraufgaben (ABP) (S. 13-22) https://doi.org/10.18420/abp2025_02 Details im Forschungsportal „Research@Leibniz University“ 2024 Amanuel, Y., Garlisch, J., & Krugel, J. (2024). Block-Based Programming Learning Tool for ML and AI Education (Work in Progress). In 2024 IEEE Global Engineering Education Conference (EDUCON) (S. 1-3). ( IEEE Global Engineering Education Conference). https://doi.org/10.1109/EDUCON60312.2024.10578627 Details im Forschungsportal „Research@Leibniz University“ Buttke, H., & Krugel, J. (2024). Information Encoding in Computer Science Education Using the Cup Song. In EDUCON 2024 - IEEE Global Engineering Education Conference, Proceedings (IEEE Global Engineering Education Conference, EDUCON). IEEE Computer Society. https://doi.org/10.1109/EDUCON60312.2024.10578599 Details im Forschungsportal „Research@Leibniz University“ Buttke, H., & Krugel, J. (2024). Information Encoding Modeling in Computer Science Education. In T. Michaeli, S. Sentance, & N. Bergner (Hrsg.), WiPSCE '24: Proceedings of the 19th WiPSCE Conference on Primary and Secondary Computing Education Research Artikel 28 https://doi.org/10.1145/3677619.3678125 Details im Forschungsportal „Research@Leibniz University“ Dieckmann, T., Hussy-Kramer, A., & Krugel, J. (2024). A Hybrid Course System on Artificial Intelligence: Insights Into the Didactic Support of Instructors. In 2024 IEEE 3rd German Education Conference (GECon) (S. 1-6) https://doi.org/10.1109/GECon62014.2024.10734022 Details im Forschungsportal „Research@Leibniz University“ Stanja, J., Hoppe, A., Dannemann, S., & Krugel, J. (2024). Generation and Evaluation of Synthetic Text Data for the Students’ Conceptions Identification Task. In Instructional Design and Technology Enhanced Learning: Current States and Future Perspectives: Book of Abstracts (S. 57) https://www.earli.org/assets/images/2024SIG6-7Conference_BookAbstract_Corrected.pdf Details im Forschungsportal „Research@Leibniz University“ 2023 Fleger, C.-B., Amanuel, Y., & Krugel, J. (2023). Learning Tools Using Block-Based Programming for AI Education. In Proceedings of the 2022 IEEE Global Engineering Education Conference, EDUCON 2023 ( IEEE Global Engineering Education Conference). IEEE Computer Society. https://doi.org/10.1109/EDUCON54358.2023.10125154 Details im Forschungsportal „Research@Leibniz University“ Stanja, J., Gritz, W., Krugel, J., Hoppe, A., & Dannemann, S. (2023). Formative assessment strategies for students' conceptions—The potential of learning analytics. British Journal of Educational Technology, 54(1), 58-75. https://doi.org/10.1111/bjet.13288, https://doi.org/10.15488/13652 Details im Forschungsportal „Research@Leibniz University“ Steinmaurer, A., Savic, R., Krugel, J., & Gütl, C. (2023). Analyzing Social Networks and Learning Content on a Discussion Forum of an Introductory Programming MOOC in Higher Education. In Proceedings of 2023 IEEE Learning With MOOCS (LWMOOCS) IEEE. https://doi.org/10.1109/lwmoocs58322.2023.10305937 Details im Forschungsportal „Research@Leibniz University“ Stender, B., & Krugel, J. (2023). Introducing fundamental ideas as a didactic approach for vocational education. In Proceedings of the 2023 IEEE German Education Conference (GeCon) IEEE. https://doi.org/10.1109/GECon58119.2023.10295075 Details im Forschungsportal „Research@Leibniz University“ Landesinitiative n-21: Schulen in Niedersachsen online e. V. , Krugel, J. A. (Hrsg.), Lilge, T., Becker, M., Bartholdt, M. N., Oel, F., May, I., Bersiner, M., Dos Anjos, V., Tekaya, A., Strating, H., Rokossa, D., Egbers, R., Icken, F., Auf der Landwehr, M., Albersmann, J., Röben, P., Wallhoff, F., Landherr, J., ... Neiß-Theuerkauff, T. (2023). Roboter im Unterricht: Mensch-Roboter-Kollaboration im schulischen Einsatz. https://www.n-21.de/portal/seiten/publikationen-900000090-10056.html Details im Forschungsportal „Research@Leibniz University“ 2022 Hubwieser, P., Krugel, J. A., Talbot, M., Striewe, M., & Goedicke, M. (2022). Empirical Definition of Object-oriented Programming Competencies: Combining Automated Assessment and Item Response Theory to Define Competencies for Implementing Abstract Data Types. Institutionelles Repositorium Leibniz Universität Hannover. https://doi.org/10.15488/11962 Details im Forschungsportal „Research@Leibniz University“ Kögl, A., Hubwieser, P., Talbot, M., Krugel, J., Striewe, M., & Goedicke, M. (2022). Efficient Structural Analysis of Source Code for Large Scale Applications in Education. In M. Jemni, I. Kallel, & A. Akkari (Hrsg.), Proceedings of the 2022 IEEE Global Engineering Education Conference, EDUCON 2022 (S. 24-30). (IEEE Global Engineering Education Conference, EDUCON; Band 2022-March). IEEE Computer Society. https://doi.org/10.1109/educon52537.2022.9766748 Details im Forschungsportal „Research@Leibniz University“ Steinmaurer, A., Schatz, C., Krugel, J., & Gütl, C. (2022). Analyzing Behavioral Patterns in an Introductory Programming MOOC at University Level. In Proceedings of 2022 IEEE Learning With MOOCS (LWMOOCS) (S. 114-119). IEEE. https://doi.org/10.1109/lwmoocs53067.2022.9927886 Details im Forschungsportal „Research@Leibniz University“ Stender, B., & Krugel, J. (2022). Basiskonzepte und Fundamentale Ideen: Ein Blick auf die Situation in der Elektrotechnik. In G. Kammasch, S. Keil, & D. Winkler (Hrsg.), Produktions- und Dienstleistungsstrukturen der Zukunft im Fokus. Wege zu technischer Bildung: Referate der 15. Ingenieurpädagogischen Regionaltagung 2021 an der Hochschule Zittau/Görlitz vom 17.-19. Juni 2021 (S. 217-222) Details ",
  "content_length": 16598,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:15"
}