{
  "name": "Johannes Schöning",
  "homepage": "https://johannesschoening.de",
  "status": "success",
  "content": "Johannes Schöning – Professor of Computer Science | Speaker | Consultant Skip to content Welcome to my private academic homepage. I am a professor of Human-Computer Interaction (HCI) at the University of St. Gallen. On my webpage, one can find more about my research, my academic activities and publications.With our research, we want to empower individuals and communities with the information they need to make better data-driven decisions by developing novel user interfaces with them. Our research mission is to fit human and technological needs and empower users using novel interfaces. We want to understand the interplay between rapidly advancing technologies and how digital interfaces can empower users in their rich set of activities. We focus on a broad range of use cases from geographic information science, public health, medical contexts, and extreme conditions such as space missions. We love to work in interdisciplinary teams to create novel insights. To do so, we use rigorous methods from AI, computer graphics and cognitive psychology and commit to a theoretical and practice-based inquiry. I am particularly interested in applying user-centred design methodologies and mixed methods approaches.In our lab, we are committed to creating a productive and detox-free academic environment so that we can focus on teaching and research. We aim to publish our disruptive research results and ideas at the most prestigious conferences in the field of HCI, including ACM CHI, ACM MobileHCI, among others. Our ideas have shaped these and other fields. We also publish our interdisciplinary work outside the HCI community in prestigious journals such as NATURE or Plos One.We are currently looking for students excited about doing work (bachelor & master thesis students, student assistants, as well as PhD students and PostDocs) at the intersection of HCI, geoinformatics, and Ubicomp technologies. Undergraduate and graduate students who want to join or visit my group should feel free to e-mail me directly. Please include a little bit about yourself (e.g. your major, degrees, CV, resume) and let me know something about your research interests. I love to work with students (with strong technical skills) and backgrounds across disciplines. If you have any further questions, please get in touch with me via email.",
  "content_length": 2330,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:17"
}