{
  "name": "Johan Montelius",
  "homepage": "https://people.kth.se/~johanmon",
  "status": "success",
  "content": "Johan Montelius Johan Montelius Detta är en personlig webbsida. Mer information. Home Publications Courses Projects Master theses Welcome I currently hold a position as Associate Professor in Communication Systems, at the school of Electrical Engineering and Computer Science at KTH - the Royal Institute of Technology. My area of interests are: programming languages, parallel machines, distributed systems and mobile applications. Past activites I took my masters degree in computing science at the Computing Science Department, Uppsala University. The department was at that time involved in functional and logic programming languages and this also became my research topic. I joined SICS as a researcher in 1989 and worked in the Laboratory for Logic Programming and Parallel Architectures, lead by Prof. Seif Haridi, on parallel implementations of concurrent constraint based languages. This work was later presented in my Ph.D. thesis. In 1996 I had started to work on mobile applications together with groups at Ericsson Research. The applications that we developed where contact management using voice navigation. The systems where mainly developed in Erlang. In 1998 I was part in the start of the company Intelligence that was later acquired by Jupiter Communications. I continued to work for Jupiter as a analyst in the area of mobile technology until 2001. As of 2002 I have been at KTH and during 2004 - 2006 I was the coordinator of the international masters program of Internetworking; One of the programs with the highest number of applicants at the school of ICT. In 2006 I joined the group of Software and Computer Systems (formerly Distributed Computer Systems) and have since worked in the area. Current focus is on large scale, fault tolerant systems. In 2009 I spent a year at Departament d'Arquitectura de Computadors at UPC in Barcelona as a visting lecturer. 2010 to 20016, the coordinator of the Eramsus Mundus master program European Master in Distributed Computing, jointly given by IST in Lisbon and UPC in Barcelona. Since 2016 I'm giving the course in operating systems. Also known for being very skeptical to the climate threat. In my opinion it is a sad example of how the academic community has failed in helping the society (pages in Swedish where I present a more realistic view of the climate threat ). Contact johanmon@kth.se KTH - Forum 120 164 40 Kista Sweden office: +46 8 790 42 83 mobile: +46 737 65 20 65",
  "content_length": 2448,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:02"
}