{
  "name": "Johann Eder",
  "homepage": "https://www.aau.at/en/isys/ics/team/eder-johann",
  "status": "success",
  "content": "O. Univ.-Prof. Dipl.-Ing. Dr. Johann Eder – Team ICS, Department of Informatics Systems Student CockpitePaymentAppointment & course managementCampus SystemResearch Information SystemCampus searchStaff PortalOrganisation handbookOperational messages, internal & personal messages LinksWebmail Library Vacancies University bulletin Bulletin Board Staff Search Campus Map IT Services (ZID) eLearning Service USI OEH Klagenfurt Information forPupils Alumni & Career Prospective Students Continuing Education Researchers Students Staff Teaching Staff Partners & Sponsors International INFORMATION AND COMMUNICATION SYSTEMS AAU1/...Department of Informatics Systems2/Research Group Information and Communication Systems3/Team ICS4/O. Univ.-Prof. Dipl.-Ing. Dr. Johann EderO. Univ.-Prof. Dipl.-Ing. Dr. Johann Eder O.Univ.-Prof. Dipl.-Ing. Dr. Johann EderDeputy Head of Department+43 463 2700 3511Johann [dot] Eder [at] aau [dot] atS.2.82Campus-Portal profile | Courses | Research Short CV: Johann Eder is full professor for Information and Communication Systems in the Department of Informatics-Systems of the University of Klagenfurt, Austria. From 2005-2013 he served as Vice President of the Austrian Science Funds (FWF).  He held positions at the Universities of Linz, Hamburg and Vienna and was visiting scholar at AT&T Shannon Labs, NJ. The research interests of Johann Eder are databases, information systems and data management for medical research. A particular focus of his work is the evolution of information systems and the modelling and management of temporal information and temporal constraints. Another focus is the application of Information technology for medical research from information systems for biobanking, information privacy to modelling of biological processes. He successfully directed numerous competitively funded research projects on workflow management systems, temporal data warehousing, process modelling with temporal constraints, application interoperability and evolution, information systems modelling, information systems for medical research, etc. Johann Eder has contributed to workflow systems and business process management for 2 decades, in particular in the area of workflow systems languages and architectures, exception handling, time management, and data management. His research led to the development of the commercial workflow management systems altavistaWorks and  @enterprise. Johann Eder authored one book, edited 22 books, proceedings, special issues of journals and published more than 160 papers in international journals and conference proceedings. See dbpl, google scholar, ISYS publication server and the research database of AAU for lists of publications. He served in numerous program committees for international and acted as general chair / PC chair for CAiSE, ADBIS, BPM, CoopIS, and  DAWAK conferences. He is editor and referee for international journals and conferences (including ACM TODS, ACM TOIS, IEEE TKDE, IEEE Transactions on Services Computing TSCSI, Information Systems, Artificial Intelligence Review, Dat and Knowledge Engineering, Computer Journal, JCSE, JUCS, DSS, JSS, etc.). Johann Eder received the degrees of Diplom-Ingenieur and Doctor of technical sciences from the University of Linz, Austria. From 1985 till 1990 he was assistant professor at the University of Klagenfurt. In 1990 he was visiting professor at the University of Hamburg, Germany. From 1990-1991 he was associate professor (tenured) at the University of Vienna, Austria. From 1991-2005 he was full professor for information and communication systems at University of Klagenfurt and he chaired the Department of Informatics-Systems from 1994- 2005, and 2009-2013. From 2005 to 2007 he was full professor for informatics (workflow) at the University of Vienna. In 1998 he was visiting scholar with AT&T Research Shannon Labs, NJ, USA. Teaching: Databases, Information Systems, Process Engineering, Interoperability, Research Methods in Computer Science Research Topics: Workflows and Process Aware Information Systems, Evolution of Databases and Information Systems, Temporal Aspects of Information Systems, Information Systems for Medical Research Research areas / ÖSTAT - Subject areasArtificial intelligenceComputer SciencesComputer supported cooperative work (CSCW)Data & Knowledge EngineeringData WarehouseDatenbanken: Design, Auswahl, Realisierung, TuningDaten im World Wide WebEvolution von InformationssystemenExpertensysteme, regelbasierte Systeme, aktive und deduktive DatenbankenInformation systemsKonzeptuelle ModellierungSoftware developmentWorkflow-Management-SystemeXML und semistrukturierte Daten Publications: Here is a list of the latest publications. Massimiliano de Leoni, Johann Eder, Manfred Reichert, Matteo Zavatteri: Special issue: Verification, Control, and Repair in Business Process Management. Elsevier B.V., Amsterdam, 2025, Franziska Selina Hollauf, Johann Eder: Time and Cost Aware Instantiation of Composed Services. 2024 26th International Conference on Business Informatics (CBI), 62504, 2024, S. 208 - 217.Johann Eder, Roberto Posenato, Carlo Combi, Marco Franceschetti, Franziska Selina Hollauf: Agile Controllability of Simple Temporal Networks with Uncertainty and Oracles. 31st International Symposium on Temporal Representation and Reasoning , Schloss Dagstuhl - Leibniz-Zentrum für Informatik, 318, Dagstuhl, 2024, S. 1 - 16.Vladimir A. Shekhovtsov, Bence Slajchó, Aron Sacherer, Johann Eder: CollectionLocator Level 1: Metadata-Based Search for Collections in Federated Biobanks. http://arxiv.org/, 2024, Robert Buchmann, Johann Eder, Hans-Georg Fill, Ulrich Frank, Dimitris Karagiannis, Laurenzi Emanuele, John Mylopoulos, Dimitris Plexousakis, Maribel Yasmina Santos: Large language models: Expectations for semantics-driven systems engineering. Data & Knowledge Engineering, Elsevier B.V., 152, Amsterdam, 2024, Roberto Posenato, Marco Franceschetti, Carlo Combi, Johann Eder: Introducing Agile Controllability in Temporal Business Processes. Enterprise, Business-Process and Information Systems Modeling (BPMDS 2024, EMMSAD 2024) , Springer, Cham, 511, 2024, S. 87 - 99.Marco Franceschetti, Johann Eder: Advanced Temporal Control Structures for Business Process Modeling. Proceedings of the 57th Hawaii International Conference on System Sciences, 57, 2024, S. 6022 - 6031.Roberto Posenato, Carlo Combi, Johann Eder: Technical Report: Some results and challenges Extending Dynamic Controllability to Agile Controllability in Simple Temporal Networks with Uncertainties. ONLINE - CATALOGO DEI PRODOTTI DELLA RICERCA, 1, 2023, S. 1 - 19.Marco Franceschetti, Roberto Posenato, Carlo Combi, Johann Eder: Dynamic Controllability of Parameterized CSTNUs. SAC '23: Proceedings of the 38th ACM/SIGAPP Symposium on Applied Computing, Association for Computing Machinery (ACM), New York, 2023, S. 965 - 973.Josef Lubas, Johann Eder: A Time-Aware Model for Legal Smart Contracts. Enterprise, Business-Process and Information Systems Modeling, Springer, Cham, 479, 2023, S. 121 - 135.Rudolf Wittner, Petr Holub, Cecilia Mascia, Francesca Frexia, Heimo Müller, Markus Plass, Clare Alloca, Fay Betsou, Tony Burdett, Ibon Cancio, Adriane Chapman, Martin Chapman, Mélanie Courtot, Vasa Curcin, Johann Eder, Mark Elliot, Katrina Exter, Carole Goble, Martin Golebiewski, Bron Kisler, Andreas Kremer, Simone Leo, Sheng Lin-Gibson, Anna Marsano, Marco Mattavelli, Josh Moore, Hiroki Nakae, Isabelle Perseil, Ayat Salman, James Sluka, Stian Soiland-Reyes, Caterina Strambio-De-Castillia, Michael Sussman, Jason R. Swedlow, Kurt Zatloukal, Jörg Geiger: Toward a common standard for data and specimen provenance in life sciences. Learning Health Systems, Wiley Periodicals, Inc., 8, 2023, S. 1 - 9.Johann Eder, Volodymyr Shekhovtsov: Managing the Quality of Data and Metadata for Biobanks. 9th International Conference, FDSE 2022, Ho Chi Minh City, Vietnam, November 23–25, 2022,, Springer Singapore, 1688, 2022, S. 52 - 69.Volodymyr Shekhovtsov, Johann Eder: Metadata Quality for Biobanks. Applied Sciences, MDPI Publishing, 12, Basel, 2022, Josef Lubas, Marco Franceschetti, Johann Eder: Resolving Conflicts in Process Models with Temporal Constraints. ER-Forum-PhD 2022 ER Forum and PhD Symposium 2022, CEUR Workshop Proceedings (CEUR-WS.org), 3211, Aachen, 2022, S. 103Franziska Selina Hollauf, Marco Franceschetti, Johann Eder: Time-Cost Tradeoffs for Composed Services. CAiSE 2022 - Advanced Information Systems Engineering - 34rd International Conference , Springer Nature Switzerland AG, 13295, 2022, S. 533 - 548.Johann Eder, Marco Franceschetti, Josef Lubas: Dynamic Controllability of Processes without Surprises. Applied Sciences, MDPI Publishing, 12, Basel, 2022, Volodymyr Shekhovtsov, Johann Eder: Data Item Quality for Biobanks. Transactions on Large-Scale Data- and Knowledge-Centered Systems, Springer Berlin Heidelberg, 50, 2022, S. 77 - 115.Marco Franceschetti, Johann Eder: Determining temporal agreements in cross-organizational business processes. Information and Computation, Elsevier, 281, 2021, S. 104792Johann Eder, Marco Franceschetti, Josef Lubas: Time in Data Models. FDSE 2021 - Future Data and Security Engineering - 8th International Conference, Springer, Cham, 13076, 2021, S. 23 - 35.Franziska Selina Hollauf, Marco Franceschetti, Johann Eder: Towards Representing Time-Cost Tradeoffs for Service Compositions. 2021 IEEE International Conference on Services Computing (SCC), IEEE International Conferences on Communications, 2021, S. 79 - 88.Johann Eder, Volodymyr Shekhovtsov: Data quality for federated medical data lakes. International Journal of Web Information Systems, Emerald Group Publishing Limited, Vol. 17, Bingley, 2021, S. 407 - 426.Carlo Combi, Johann Eder, Mark Reynolds: 28th International Symposium on Temporal Representation and Reasoning . Schloss Dagstuhl - Leibniz-Zentrum für Informatik, 206, Dagstuhl, 2021, Marco Franceschetti, Johann Eder: Semi-contingent Task Duratio",
  "content_length": 25951,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:10"
}