{
  "name": "Johannes Peter Wallner",
  "homepage": "https://wallner.ist.tugraz.at",
  "status": "success",
  "content": "Johannes P. Wallner Johannes Peter Wallner Address Graz University of Technology Faculty of Computer Science and Biomedical Engineering Institute of Software Engineering and Artificial Intelligence Inffeldgasse 16b/II 8010 Graz, Austria Mail TU Graz online personal entry Page@institute personal page Group page KRR A reminder \"The choices and actions implemented in this decade will have impacts now and for thousands of years (high confidence).\" IPCC, 2023: Summary for Policymakers. In: Climate Change 2023: Synthesis Report. Core Writing Team, H. Lee and J. Romero (eds.). Contents About me Research Interests Professional Activities Teaching Software Publications Competitions About me I am an associate professor at Graz University of Technology (TU Graz). I work in the Institute of Software Engineering and Artificial lntelligence, Faculty of Computer Science and Biomedical Engineering. I am leading the group specialized in Knowledge Representation and Reasoning (KRR). Previously, I was a researcher in the DBAI group of the Institute of Logic and Computation, TU Wien and a member of the Constraint Reasoning and Optimization group at the University of Helsinki, Computer Science Department. Before working at universities, I had several internships at Siemens PSE, working with software testing and configuration management tools. More details can be found in my CV http://orcid.org/0000-0002-3051-1966 Awards and Recognitions Early Career Track at IJCAI 2024 (by invitation only; 12 selected researchers globally) \"Top Scholar\" according to ScholarGPS in 2024 (top 0.5 % worldwide in Artifical Intelligence). \"AI 2000 Most Influential Scholar Honorable Mention in Knowledge Engineering\" by AMiner in 2021 and 2022 (top 11-100 scholars in the domain). Runner-Up Best Student Paper Award at ECAI 2016 Distinguished student paper prize at KR 2012 Honorable mention from International Competition on Computational Models of Argumentation (ICCMA) 2015 for participating solver cegartix IJCAI 2019 Distinguished Program Committee member, \"Discussion Master\" award for ECAI 2023. Invited Talks and Funding Invited talk at Arg&App 2025 Invited as visiting professor to Université Toulouse Capitole in 2025 Invited talk at SAFA 2024 Invited talk at the Workshop on Recent Trends in Formal Argumentation Invited talk at the Oberseminar of the Artificial Intelligence Group at FernUnversität Hagen Project funding (PI): A Novel Computational Workflow for Argumentation in AI. Funded by Austrian Science Fund (FWF) under grant P 35632 (358.848 €). Project funding (PI): Extending Belief Change to Advance Dynamics in Argumentation. Funded by Austrian Science Fund (FWF) under grant P30168-N31 (353.438 €). Professional Activities Member of the program committee (PC) of, or reviewer for 2026: AAAI, ICLP, SAC, PADL 2025: AAAI, ICAPS, LICS, JELIA, ICLP, SAC (KRR track), ASPOCP, RCRA, IM, TKR, ArgXAI, 2024: AAAI, IJCAI, UAI, ECAI, LPNMR, COMMA, PADL, SAC (KRR track), ASPOCP, ArgXAI, SAFA, RCRA, 2023: AAAI, IJCAI, KR, ECAI, JELIA, SAC (KRR), ASPOCP, RCRA, ArgXAI, FCR, 2022: IJCAI, KR, UAI, COMMA, LPNMR, SAC (KRR track), RCRA, 2021: AAAI, IJCAI (senior PC), KR, UAI, SAC (KRR track), 2020: AAAI, IJCAI, KR, ECAI, SAC, COMMA, SAFA, STAIRS, ASPOCP, 2019: AAAI, IJCAI, AAMAS, LPNMR, SAC (KRR track), ASPOCP, RCRA, 2018: AAAI, IJCAI, KR, COMMA, SAFA, RCRA 2017: IJCAI, IEA/AIE (AppArg track), RCRA, TAFA, 2016: IJCAI (main track), COMMA, RCRA, SAFA, TAASP, 2015: IJCAI (KR track), and RCRA. Member of the Program Committee Board of IJCAI (2022-2024). Organization activities Co-Chair of the Doctoral Consortium at KR 2024. Member of the local arrangements committee of IJCAI 2022 (part of the workshop and tutorial coordinators). Co-organizer of the workshop on Recent Advances in Collaborative and Argumentative Decision-Making. Co-organizer of the fourth international workshop on systems and algorithms for formal argumentation (SAFA 2022). Co-organizer of the workshop on New Trends in Formal Argumentation 2017. Member of the editorial board of Argument and Computation. Member of the steering committee of ICCMA. Fifth place for solving JELIA'23 puzzle. Research Interests Knowledge representation and reasoning, artificial intelligence, argumentation, abduction, belief change, inconsistency handling and measurement, computational social choice, computational complexity, Boolean satisfiability, and answer set programming. Teaching For Bachelor's or Master's thesis, see topics. Logic-based Knowledge Representation (TU Graz) [ 2022 | 2023 | 2024 | 2025 ] Intelligent Systems (TU Graz) [ 2025 | 2026 ] Declarative Programming (TU Graz) [ 2026 ] Artificial Intelligence 2 (former Basics in AI and Logic) (TU Graz) [ 2021 | 2022 | 2023 | 2024 | 2025 | 2026 ] Foundations of Computer Science (TU Graz, FH Joanneum, FH Campus 02) [ 2022 | 2023 | 2024 ] Data Base Systems (TU Wien) [ 2020 ] Scientific Writing for MSc in Computer Science (University of Helsinki) [ 2016 ] Seminar on Computational Social Choice (University of Helsinki) [ 2016 ] Seminar on Tractability (University of Helsinki) [ 2015 ] Abstract Argumentation (TU Wien) [ 2012 | 2014 | 2017 | 2018 | 2019 ] Software I contributed to the (theory of the) following systems. CEGARTIX: a SAT-based argumentation system for argumentation frameworks Vispartix: a visualization of argumentation frameworks generated from knowledge bases (using the software ARVis) ADFsys: an ASP-based argumentation system for abstract dialectical frameworks SAT-based argumentation systems: software using SAT-extensions for argumentation frameworks QADF: QBF-based implementation of ADF semantics GERD: Genteel Extended argumentation Reasoning Device, an ASP-based system for computing extensions of EAFs Pakota: MaxSAT and IP based implementation for extension and status enforcement for abstract argumentation AbHS: A propositional abduction solver based on the implicit hitting set paradigm AFSynth: AF synthesis via MaxSAT aba2af: system for reasoning about acceptance in assumption-based argumentation via argumentation frameworks k++ADF: a SAT-based reasoner for abstract dialectical frameworks ASPARTIX: ASP-based system for reasoning in argumentation frameworks ASP for ABA: ASP-based system for reasoning tasks in assumption-based argumentation AcbAr: a solver for assumption-based argumentation instantiating optimized AFs ASTRA: a solver for reasoning in assumption-based argumentation based on tree-decompositions (requires D-FLAT) Publications and Presentations See also: [ Google Scholar | DBLP | profile@TU Graz ] 2026 [96] Under-Approximating Semantics in Clustered Assumption-Based Argumentation Iosif Apostolakis and Johannes P. Wallner. Accepted to AAAI 2026 2025 [95] CompLogDL and its Implementation in Answer Set Programming Lucrezia Mosconi and Johannes P. Wallner. In Tobias Geibinger, Tobias Stolzmann, and Alice Tarzariol, editors, Proceedings of the Workshop on Trends and Applications of Answer Set Programming, TAASP 2025, Vienna, Austria, 2025 [ Link ] [94] Sixth International Competition on Computational Models of Argumentation: Preliminary Report Iosif Apostolakis, Andrei Popescu, and Johannes P. Wallner. In Oana Cocarascu, Sylvie Doutre, Jean-Guy Mailly, and Antonio Rago, editors, Proceedings of the Second International Workshop on Argumentation and Applications, Arg&App 2025, invited paper, Melbourne, Austrialia, 2025 [ Link ] [93] Completing Structured Arguments in Assumption-based Argumentation Andrei Popescu and Johannes P. Wallner. In Giovanni Casini, Besik Dundua, and Temur Kutsia, editors, Proceedings of the 19th European Conference on Logics in Artificial Intelligence, JELIA 2025, pages 95-111, Kutaisi, Georgia, 2025 [ DOI ] [92] Argumentative Reasoning in ASPIC+ under Incomplete Information Daphne Odekerken, Tuomo Lehtonen, Johannes P. Wallner, and Matti Järvisalo. Journal of Artificial Intelligence Research, Vol. 83. 2025 [ DOI | conference version: [74] ] [91] Dynamic Programming Algorithms for Probabilistic Bipolar Argumentation Frameworks Andrei Popescu and Johannes P. Wallner. In Jiman Hong, Sebastiano Battiato, Christian Esposito, Juw Won Park, and Adam Przybylek, editors, Proceedings of the 40th ACM/SIGAPP Symposium on Applied Computing, SAC 2025, pages 1051-1052, Catania, Italy, 2025 [ DOI | accepted manuscript ] 2024 [90] Reasoning in Structured Argumentation: Assumption-based Argumentation and ASPIC+ Johannes P. Wallner. In AnneMarie Borg, Stefan Ellmauthaler, Jean-Guy Mailly, and Andreas Niskanen, editors, Proceedings of the Fifth International Workshop on Systems and Algorithms for Formal Argumentation, SAFA 2024, pages 7-10, Hagen, Germany, 2024 [ Link ] [89] A Semantical Approach to Abstraction in Answer Set Programming and Assumption-based Argumentation Iosif Apostolakis, Zeynep G. Saribatur, and Johannes P. Wallner. In Carmine Dodaro, Gopal Gupta, and Maria Vanina Martinez, editors, Proceedings of the 17th International Conference on Logic Programming and Non-monotonic Reasoning, LPNMR 2024, pages 228-234, Dallas, USA, 2024 [ DOI | accepted manuscript ] [88] Advancing Algorithmic Approaches to Probabilistic Argumentation under the Constellation Approach Andrei Popescu and Johannes P. Wallner. In Pierre Marquis, Magdalena Ortiz, and Maurice Pagnucco, editors, Proceedings of the 21st International Conference on Principles of Knowledge Representation and Reasoning, KR 2024, pages 585-596, 2024 [ DOI ] [87] Abstraction in Assumption-based Argumentation Iosif Apostolakis, Zeynep G. Saribatur, and Johannes P. Wallner. In Pierre Marquis, Magdalena Ortiz, and Maurice Pagnucco, editors, Proceedings of the 21st International Conference on Principles of Knowledge Representation and Reasoning, KR 2024, pages 49-59, 2024 [ DOI ] [86] Complexity Results and Algorithms for Preferential Argumentative Reasoning in ASPIC+ Tuomo Lehtonen, Daphne Odekerken, Johannes P. Wallner, and Matti Järvisalo. In Pierre Marquis, Magdalena Ortiz, and Maurice Pagnucco, ",
  "content_length": 39933,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:17"
}