{
  "name": "John Black",
  "homepage": "https://www.cs.colorado.edu/~jrblack",
  "status": "success",
  "content": "John R. Black's WebPage John Black Associate Professor of Computer Science, University of Colorado at Boulder Phone: +1 (303) 492-7514 Fax: +1 (303) 492-2844 CS Office: +1 (303) 492-7514 Professional Stuff Teaching Publications Students Curriculum Vita Fun Stuff Personal Pix Rockclimbing Page Leap Beta Page Nose-in-a-Day Page Photo Album Personal Info John R. Black, Associate Professor, University of Colorado, Department of Computer Science 430 UCB, Boulder, CO 80309-0430 USA. My favorite things Rockclimbing I love rockclimbing . It is absolutely the best sport ever invented. How else can you be in such beautiful places, push yourself mentally and physically, and never have to pay a dime! Volleyball I've played a lot of volleyball; it used to be my raison d'etre. I guess I never got higher than about the A level with USVBA or grass doubles, but I really loved it. I still do, but don't play much anymore. Triathlons I was a swimmer in college, a runner all through life, and a cyclist from about 1990 to 1995. So doing triathlons was a natural thing for me; I've only done about 5 of them, but I want to do more some day. My longest one contained a 1 mile swim, 25 mile bike ride, and a 10k run. Computer Science I really like computers. It used to be a novel thing; now it's just a cliche. I love math. Computer science is my secret way of doing math but still having some opportunity for employment later in life. My Erdös Number is four: Rogaway-Coppersmith-Graham-Erdös. My area of research is cryptography and security. I'm competely obsessed with this stuff now... the most fascinating science I've ever seen; I was lucky to find it as a grad student! I'm also interested in combinatorial algorithms, graph theory, and recreational math. Oh, and my best times at minesweeper are 5, 34, and 112 seconds. And my fastest Rubik's cube solve is 18.11 seconds. My friends Friends and family are the greatest thing a human being can possess; I'm fortunate to have a bunch of them, but only some currently have a Web page. Here are a few who do: Scott Nollet is one of my closest friends. We've hiked, biked, white-water rafted, played chess, done math, and I've even tricked him into going climbing with me a few times! Lately we've been studying Spanish together a little. Scott is currently Professor of Mathematics at Texas Christian University in Dallas/Ft. Worth. Ted Krovetz is a faster swimmer than I have ever been. Ted was Phil's other student, so we've worked together quite often. Ted is now at Cal State Sacramento and has three beautiful children. Ty Jones was easily my closest friend in Reno and we still try to keep in touch. He's one of the best volleyball players I've known, beats me at racquetball, golf, and ping-pong every time, but fortunately I can still out-climb him... Ty had his first child, Ava, in early 2006. Fred Chong is a professor at UC Santa Barbara conducting research on classical computer architecture and quantum architectures. Fred climbs pretty hard for someone who never trains, is a small-airplane pilot (instrument rating), an avid hocky player, and an experienced world traveller, not to mention being one of the most distinguished young researchers in his area. Tom Shrimpton is my academic little brother (ie, his current advisor was my advisor). Tom is one of the hardest-working guys I know. Tom is now an assistant professor at Portland State University. John Black's WWW Page / John R. Black / (jrblack@cs.colorado.edu)",
  "content_length": 3482,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:27"
}