{
  "name": "John Sheppard 0001",
  "homepage": "https://www.cs.montana.edu/sheppard",
  "status": "success",
  "content": "Dr. John W. Sheppard John W. Sheppard, PhD, FIEEE Home Research Publications Courses Curriculum Vitae Contact Information Dr. John W. Sheppard Norm Asbjornson College of Engineering Distinguished Professor Director, Numerical Intelligent Systems Laboratory Gianforte School of Computing 365 Barnard Hall Montana State University Bozeman, MT 59717 V: +1 406 994 4835 E: john dot sheppard at montana dot edu A Note to Prospective Graduate Students Being that I am approaching retirement in a few years, I have suspended accepting new students into my lab. Unless something radical changes that would force me to extend my retirement date greatly, I do not see this situation changing. Therefore, if you wish to pursue a graduate degree (MS or PhD) in computer science at Montana State University, please reach out to a different instructor in the Gianforte School of Computing. Biographical Sketch Dr. John Sheppard is a Norm Asbjornson College of Engineering Distinguished Professor of Computer Science at Montana State University and previously was the RightNow Technologies Distinguished Professor in Computer Science at MSU. He holds a BS in computer science from Southern Methodist University and an MS and PhD in computer science from Johns Hopkins University. In 2007, he was elected as an IEEE Fellow \"for contributions to system-level diagnosis and prognosis.\" Prior to entering academia, he was a Fellow at ARINC Incorporated, a defense aerospace company in Annapolis, MD where he worked for 20 years. Dr. Sheppard performs research in probabilistic graphical models, deep learning, evolutionary and swarm-based algorithms, distributed optimization, and applications to system-level test, diagnosis, and predictive health. Recently, his research has expanded into the areas of prostate cancer diagnosis, precision agriculture, and wildfire management. He has published over 200 papers in peer-reviewed conference proceedings and journals as well as three books on the subject of system-level diagnosis and systems engineering. In addition, Dr. Sheppard is active in IEEE Standards activities where, currently, he serves as the chair of the IEEE P2848 Prognostics and Health Management for Automatic Test Systems standards development working group under SCC20 and the IEEE P1232 Standard for System Diagnostic Data and Services. He is also a member of the IEEE P2976 eXplainable AI standards working group. Education BS, Computer Science (magna cum laude), Southern Methodist University, 1983 MS, Computer Science, The Johns Hopkins University, 1990 PhD, Computer Science, The Johns Hopkins University, 1997 Appointments Norm Asbjornson College of Engineering Distinguished Professor in Computer Science, Montana State University Lecturer, Computer Science Program, Engineering and Applied Science Programs for Professionals, The Johns Hopkins University Professional Activities IEEE Fellow IEEE Computer Society IEEE Computational Intelligence Society IEEE Instrumentation and Measurement Society IEEE Standards Association ACM Special Interest Group on Evolutionary Computation (SIGEVO) Tutorials Chair, IEEE AUTOTESTCON 2017ff Research Interests Machine Learning Data Mining Data Science Probabilistic Graphical Models Neural Networks Explainable and Ethical AI Population-based Metaheuristic Search Factored and Distributed Optimization System-Level Fault Diagnosis and Prognosis Courses Taught Montana State University CSCI 246: Discrete Structures CSCI 440: Database Systems CSCI 446: Artificial Intelligence CSCI 447: Machine Learning: Soft Computing CSCI 500: Seminar in Machine Learning CSCI 546: Advanced Artificial Intelligence CSCI 547: Machine Learning CSCI 548: Reasoning Under Uncertainty CSCI 550: Data Mining Johns Hopkins University 600.335/435: Artificial Intelligence (Homewood) 600.475: Machine Learning (Homewood) 600.735: Seminar in Machine Learning (Homewood) 605.445: Artificial Intelligence (EP) 605.621: Foundations of Algorithms (EP) 605.649: Introduction to Machine Learning (EP) 605.746: Advanced Machine Learning (EP) 605.747: Evolutionary Computation (EP) Current Graduate Students Muhammad Arju (PhD Advisee) Seyedmojtaba Mohasel (PhD Committee) Nishu Nath (PhD Advisee) Asad Noor, ABD (PhD Advisee) Fatima Ododo (PhD Advisee) Gideon Popoola, ABD (PhD Advisee) Jordan Schupbach, ABD (PhD Advisee, with Dr. John Borkowski) Prior PhD Students Dr. Stephyn Butcher (2018), Information Sharing and Conflict Resolution in Particle Swarm Optimization Variants, now at Johns Hopkins University. Dr. Patrick Donnelly (2015), Learning Spectral Filters for Single- and Multi-Label Classification of Musical Instruments, now at Oregon State University, Bend. Dr. Nathan Fortier (2015), Inference and Learning in Bayesian Networks Using Overlapping Swarm Intelligence, now at Golden Helix. Dr. Richard McAllister (2020), Extracting Abstract Spatio-Temporal Features of Weather Phenomena for Autoencoder Transfer Learning, now at Weather Stream. Dr. Benjamin Mitchell (2017), The Spatial Inductive Bias of Deep Learning, now at Swarthmore College. Dr. Giorgio Morales (2025), Decomposable Neuro Symbolic Regression with Uncertainty Awareness, now at the University of Caen Normandy. Dr. Amy Peerlinck (2023), Multi- and Many-Objective Factored Evolutionary Algorithms, now at Western Colorado University. Dr. Logan Perreault (2017), Improved Scalability and Expressiveness for Continuous Time Bayesian Networks now at Cruise Automation. Dr. Shane Strasser (2017), Factored Evolutionary Algorithms: Cooperative Coevolutionary Optimization with Overlap, now at Globality, Inc.. Dr. Liessman Sturlaugson (2014), Extensions to Modeling and Inference in Continuous Time Bayesian Networks, now at Boeing Research & Technology. Dr. Hasari Tosun (2016), Efficient Machine Learning Using Partitioned Restricted Boltzmann Machines, now at Turnitin. Dr. Scott Wahl (2021), Hierarchical Fuzzy Spectral Clustering in Campaign Finance Social Networks, now a contractor for the University of Illinois.",
  "content_length": 6013,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:08"
}