{
  "name": "John R. Terry",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/metabolism-systems/Terry-John.aspx",
  "status": "success",
  "content": "Professor John Terry - Department of Metabolism and Systems Science - University of Birmingham Professor John Terry PhD, FMedSci Department of Metabolism and Systems ScienceHonorary Professor Contact details Emailj.r.terry@bham.ac.ukTwitter@JT_running View my research portal AddressMetabolism and Systems Science (MSS)College of Medicine and HealthUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Professor Terry’s personal research seeks to understand the complexities of biological systems, particularly in neuroscience and endocrinology. With a focus on epilepsy and the stress-responsive hypothalamic-pituitary-adrenal axis. He currently hold a prestigious £2M EPSRC Established Career Fellowship. Professor Terry is affiliated with the School of Mathemtics and School of Computer Science. PhD in Applied Mathematics 2000 University of Surrey BSc (Hons) in Mathematics 1997 University of Reading John is a dynamic leader with a proven track record in both academia and industry, driving innovation and excellence at the intersection of science, technology and medicine. He is Professor of Digital Health Innovation at the University of Plymouth, Honorary Professor at the University of Birmingham and Co-Founder and Managing Director of Neuronostics Ltd. His work has attracted over £30M in funding from leading organizations including the EPSRC, MRC, BBSRC, Innovate UK, the NIHR and the Wellcome Trust. At the University of Birmingham, he established the Centre for Systems Modelling & Quantitative Biomedicine in 2019, a team of innovators in mathematics, data science, and physics, who pioneer groundbreaking research with significant implications for biomedical and clinical advancements. Key to its success was robust engagement with stakeholders, including experimental scientists, clinicians, industry partners, and the public, ensuring our research is both impactful and relevant. He currently hold a prestigious £2M EPSRC Established Career Fellowship, was awarded TechSpark Founder of the Year in 2024 and was elected a Fellow of the Academy of Medical Sciences in 2025. Prior to my current roles, I held senior leadership positions at the University of Exeter where I successfully built teams of 30-40 faculty members, researchers, and PhD students, securing over £35M in research funding to deliver impactful research outcomes in biomedical and clinical research. John is PI on the EPSRC Network+ award N-CODE, which brings together communities to focus on new solutions for diagnosis and management of neurological conditions in non-hospital settings. John has published over 75 pieces of original research (in areas as diverse as attractor theory, cardiac arrhythmias, epilepsy, the mammalian stress response and nonlinear laser dynamics). John holds 1 patent with 1 pending, and alongside Wessel Woldman is co-founder of Neuronostics (a spinout established in 2018). John is a passionate science communicator and partnering with Paul Jepson and the Exeter Northcott Theatre co-wrote and co-directed Beyond My Control, a unique piece of theatre that brings to life what it is like to have epilepsy, the mathematics behind understanding brain networks and how this can be used to better diagnose and treat epilepsy. John is also motivated by developing leadership: both his own and in others. He is a graduate of the Leadership Foundation’s Senior Strategic Leadership Course (2016) and was one of just 14 individuals selected to graduate from the 6th and final cohort of the Wellcome Trust’s Research Leadership Development Programme (2018/19). Partnering with Julian Shreeve, he has established a leadership programme for early career researchers built around developing productive communication skills, needs identification and screening, creating narratives, and interview performance. John has successfully mentored 15 early career researchers to secure independent research fellowships valued in excess of £8M since 2016. John has a strong track-record of PhD supervision and welcomes applications from prospective PhD candidates who seek to push the frontiers of knowledge through mathematical or data science approaches to understanding biological, biomedical or clinical questions. John has a long track-record in multidisciplinary research with scientists in clinical and experimental neuroscience, where he is internationally renowned for systems modelling approaches in neuroscience and endocrinology, in particular applications to epilepsy, Parkinson’s disease and the Hypothalamic-Pituitary-Adrenal axis. John’s current research includes: Characterising the evolution of epilepsies using neural modelling techniques, with the aim to create improved diagnosis techniques for clinicians and to better predict treatment outcomes. Developing tools for describing networks of interacting brain regions and characterising seizure initiation based upon network structure. Developing models for interpreting the effects of Deep Brain Stimulation with applications to Parkinson’s and Epilepsy. Exploring the interactions between neural dynamics and hormone secretions in the Hypothalmic-Pituitary-Adrenal axis; by understanding the mechanisms responsible for fluctuations observed in blood concentrations of steroids, more appropriate treatments for a number of clinical conditions may be developed. Developing models of the phenomenology of electrical data recording clinically during radiofrequency ablation therapy for the treatment of cardiac arrhythmias. Current activities Epilepsy Research Institute (2024-DATE) UKRI Future Leaders Fellowship Panel Committee (2018-DATE) Neuronostics Co-Founder and Director (2018-DATE) International League Against Epilepsy Task Force on Network Basis of Disease (2017-DATE) EPSRC Peer-Review College (2011-DATE) Previous activities Epilepsy Research UK Scientific Advisory Committee (2018-2024) MRC Non-Clinical Training and Career Development Panel (2017-2021) MRC Skills Development Panel (2014-2017) Recent publications Article Mason, SL, Junges, L, Woldman, W, Ftouni, S, Anderson, C, Terry, JR & Bagshaw, AP 2024, 'Associating EEG functional networks and the effect of sleep deprivation as measured using psychomotor vigilance tests', Scientific Reports, vol. 14, no. 1, 27999. https://doi.org/10.1038/s41598-024-78814-4 Tait, L, Staniaszek, LE, Galizia, E, Martin‐Lopez, D, Walker, MC, Azeez, AAA, Meiklejohn, K, Allen, D, Price, C, Georgiou, S, Bagary, M, Khalsa, S, Manfredonia, F, Tittensor, P, Lawthom, C, Howes, BB, Shankar, R, Terry, JR & Woldman, W 2024, 'Estimating the likelihood of epilepsy from clinically noncontributory electroencephalograms using computational analysis: A retrospective, multisite case–control study', Epilepsia. https://doi.org/10.1111/epi.18024 Junges, L, Galvis, D, Winsor, A, Treadwell, G, Richards, C, Seri, S, Johnson, S, Terry, JR & Bagshaw, AP 2024, 'The impact of paediatric epilepsy and co-occurring neurodevelopmental disorders on functional brain networks in wake and sleep', PLOS One, vol. 19, no. 8, e0309243. https://doi.org/10.1371/journal.pone.0309243 Harrington, E, Kissack, P, Terry, J, Woldman, W & Junges, L 2024, 'Treatment effects in epilepsy: a mathematical framework for understanding response over time', Frontiers in network physiology, vol. 4, 1308501. https://doi.org/10.3389/fnetp.2024.1308501 Marinelli, I, Walker, JJ, Seneviratne, U, D’Souza, W, Cook, MJ, Anderson, C, Bagshaw, A, Lightman, SL, Woldman, W & Terry, J 2023, 'Circadian distribution of epileptiform discharges in epilepsy: candidate mechanisms of variability', PLoS Computational Biology, vol. 19, no. 10, e1010508. https://doi.org/10.1371/journal.pcbi.1010508 Mason, SL, Junges, L, Woldman, W, Facer-Childs, ER, Campos, BMD, Bagshaw, AP & Terry, JR 2023, 'Classification of human chronotype based on fMRI network-based statistics', Frontiers in Neuroscience, vol. 17, 1147219. https://doi.org/10.3389/fnins.2023.1147219 Grant, AD, Upton, TJ, Terry, J, Smarr, BL & Zavala, E 2022, 'Analysis of wearable time series data in endocrine and metabolic research', Current Opinion in Endocrine and Metabolic Research, vol. 25, 100380. https://doi.org/10.1016/j.coemr.2022.100380 Cook, B, Peterson, A, Woldman, W & Terry, J 2022, 'Neural field models: a mathematical overview and unifying framework', Mathematical Neuroscience and Applications, vol. 2, 2. https://doi.org/10.46298/mna.7284 Cao, M, Galvis, D, Vogrin, SJ, Woods, WP, Vogrin, S, Wang, F, Woldman, W, Terry, JR, Peterson, A, Plummer, C & Cook, MJ 2022, 'Virtual intracranial EEG signals reconstructed from MEG with potential for epilepsy surgery', Nature Communications, vol. 13, no. 1, 994. https://doi.org/10.1038/s41467-022-28640-x Lopes, MA, Krzemiński, D, Hamandi, K, Singh, KD, Masuda, N, Terry, JR & Zhang, J 2021, 'A computational biomarker of juvenile myoclonic epilepsy from resting-state MEG', Clinical Neurophysiology, vol. 132, no. 4, pp. 922-927. https://doi.org/10.1016/j.clinph.2020.12.021 Lopes, MA, Junges, L, Tait, L, Terry, JR, Abela, E, Richardson, MP & Goodfellow, M 2020, 'Computational modelling in source space from scalp EEG to inform presurgical evaluation of epilepsy', Clinical neurophysiology : official journal of the International Federation of Clinical Neurophysiology, vol. 131, no. 1, pp. 225-234. https://doi.org/10.1016/j.clinph.2019.10.027 Creaser, J, Lin, C, Ridler, T, Brown, JT, D'Souza, W, Seneviratne, U, Cook, M, Terry, JR & Tsaneva-Atanasova, K 2020, 'Domino-like transient dynamics at seizure onset in epilepsy', PLoS Computational Biology, vol. 16, no. 9, 1008206. https://doi.org/10.1371/journal.pcbi.1008206 Zavala, E, Voliotis, M, Zerenner, T, Tabak, J, Walker, JJ, Feng Li, X, Terry, J, Lightman, SL, O'Byrne, K & Tsaneva-Atanasova, K 2020, 'Dynamic hormone control of stress and fertility', Frontiers in Physiology. https://doi.org/10.1101/2020.08.24.264234 Preprint Kamaraj, AK, Szuromi, MP, Galvis, D, Stacey, W, Skeldon, AC & Terry, J 2023 'Using compartmental models to understand e",
  "content_length": 10811,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:06"
}