{
  "name": "John Zimmerman",
  "homepage": "https://www.cs.cmu.edu/~johnz",
  "status": "success",
  "content": "John Zimmerman: Home John Zimmerman Human-Computer Interaction Institute - The School of Design - Carnegie Mellon University Home Research Publications Patents Portfolio CV I am an interaction designer and researcher with a joint appointment as an Associate Professor at the Human-Computer Interaction Institute and at the School of Design. Currently I am on sabbatical (Yeah!!!), spending my time with the Designing Quality in Interaction group at the Technical University in Eindhoven. I will be in the Netherlands until the end of December, then back to Carnegie Mellon for the Spring 2012 semester. While in the Netherlands, I am focusing on understanding new methods and approaches for connecting theoretical and philosophical frameworks to the design process.I have four main research areas: Designing for the Self: I have been investigating how to operationalize theories on material possession attachment and theories on material practices in the design of interactive products and services. These theories describe how meaning and attachment grow from repeated use of different artifacts. One example I really like is how parents develop an attachment to specific books they read to their children. If you visit parents 20 years after their children have left home, many still possess and cherish these books. My work looks at how to make things that help people become the person they desire to be; how a product can help a person feel they are moving towards their idealized self in a specific role. Examples of things I have made with my students and collaborators include the reverse alarm clock that keeps young children from waking their parents; a smart activity bag that allows parents to pass the responsibility of preparing for an activity to a child; and the family time flow, a system that learns the routines of busy families and then uses this knowledge to support these families. Recently I have been taking this work in a new direction, looking at how teens construct value with their virtual possessions; things like their music, photos, text messages, video game avatars, and social network profiles. Research through Design: This work investigates how the design process can be recast as a method of inquiry. Design has an ability to holistically embrace “wicked problems;” an approach much different than the reductionist practices found in engineering and scientific inquiry. My work in this area has been to formalize research through design so that contributions made following this approach will be accepted in the HCI research community. Recent work on this with Jodi Forlizzi and Erik Stolterman has focused on the activity of theory building. In addition, I am currently working on a book with Ilpo Koskien, Thomas Binder, Johan Redström, and Stephan Wensveen that takes a broader view. In the book we describe “Constructive Design Research” as three approaches (lab, field, and showroom) that have arisen in different design schools over the last 15 years. Mixed-initiative Interaction: Many years ago when I started working at Philips Research, I began to work with researchers working on machine-learning systems. This began my fascination with how to best combine human and machine intelligence. My recent work with Anthony Tomasic has focused on the needs of non-programming office workers. I have been designing interfaces that allow them to automate their work through collaboration with software agents. The VIO system learns to recognize incoming emails that require office workers to update databases. VIO selects the correct update form and fills it out as much as it can. It then waits for the user to make any repairs and approve the update. The MIXER system allows workers to automate information retrieval tasks. Workers design a table, filling in the first row and then MIXER completes the retrieval following the patterns the user demonstrated. I am just beginning a new project in this space on a decision support tool that helps physicians decide on whether to use a mechanical circulatory device for patients suffering from heart failure. Service Design for Public Services: I am very interested in how citizens can feel ownership and responsibility for the public services they use. I have set an impossible idealized state where the citizens of Pittsburgh can learn to love and feel ownership for a public service with the same passion they bring to the beloved Pittsburgh Steelers football team. Working with Aaron Steinfeld and Anthony Tomasic, we have created a mobile application called Tiramisu (means “pick me up” in Italian). This service allows transit riders to share GPS traces in order to create real-time bus arrival information. The work attempts to operationalize service design theory on co-production. In this case the riders are working with the transit service to make the information they desire. Current Course 05-499/899: Designing Mobile Services HCI Institute: Spring 2011 Course Description Attention all inventors! This course teaches the emerging art and science of inventing effective mobile services. In this class, students will work in small, interdisciplinary teams to conceive of a mobile service. Students will learn a human-centered service design process to discover unmet needs within a targeted set of users. They will then work to iteratively refine their concept of a mobile service by considering the technical viability, the financial viability (model for making money), and the desire viability (the user experience). By the end of the class, student teams will to have produced a plan for a mobile service that when implemented could become a startup company. In addition, they will have produced a video that documents their service concept and the user experience it is intended to produce. Background Over the last several years there has been an increasing move in the software industry to reframe traditional products as services, and this has given rise to the concept of software as a service. Today many of the resources needed by tech startups such as servers, electronic storefronts, analytics, and financial transactions can be purchased at very low cost as a service. In addition, there has been explosive growth in social computing with the arrival of crowd-sourced services such as Wikipedia, sharing services such as Flickr and YouTube, and social networks such as mySpace and Facebook. Finally, the arrival of smart phones has opened a new domain for location-based, just-in-time, context aware, and highly social applications to emerge. Arriving with these new smart phones are mobile application distribution centers like the iTunes App Store and the Android Marketplace, which further reduce the amount of effort needed to create and distribute a successful software application. This represents an exciting new frontier for mobile service startups. The barriers to entry in the mobile application market are so low; people can literally run a startup on the weekends with some friends. But how can you create a successful startup that makes service applications that can sell for $.99, that standouts against the constant explosion of new products and services, and that gains a foothold while moving towards profitability? Course Objectives In this class students will design a mobile service. Working in interdisciplinary teams of approximately 5, students will work to imagine and communicate a mobile service that is desirable for a target set of users, fills a gap within the current competitive landscape, is technical feasibility, and is financial viability. In this class, students will specifically learn how to Discover a service opportunity in terms of user experience, co-production of value, customer competence, and market gap. Generate a business model that describes the systemic interaction between stakeholders including the flows of value and money. Generate a system architecture that describes server actions, client actions and interactions between the server and the clients. Create an effective presentation for pitching a mobile service startup to a venture capitalist.",
  "content_length": 8115,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:16"
}