{
  "name": "John K. Tsotsos",
  "homepage": "http://www.cse.yorku.ca/~tsotsos/Tsotsos/Home.html",
  "status": "success",
  "content": "John Konstantine Tsotsos - John K. Tsotsos × Global Search search box search button Skip to main content Skip to local navigation John K. Tsotsos Department of Electrical Engineering and Computer Science Lassonde School of EngineeringYork University tsotsos@yorku.ca Links of Interest Laboratory for Active and Attentive Vision Google Scholar Page Publications Wikipedia Page Academic Ancestry Page 65th Birthday Spoken Festschrift and Celebratory Symposium Loop Page ResearchGate Page ORCID Page Current Position (August 2025) Distinguished Research Professor of Vision Science, Dept. of Electrical Engineering and Computer Science, Lassonde School of Engineering, York University Member, Centre for Innovation in Computing @ Lassonde, York University Member, Centre for Vision Research, York University Adjunct Professor, Ophthalmology and Vision Sciences, Temerty Faculty of Medicine, University of Toronto Research Interests Computer Vision Visual Attention Active Vision Systems Human Vision Visually Guided Robotics Artificial Intelligence Feature of the Month Attentional Mechanisms Bridge Seeing to Looking, June 20, 2025, Science of Intelligence Lecture Series, TU Berlin Education Post-Doctoral Fellow – Ontario Heart Foundation Fellowship held at the Cardiovascular Unit, Toronto General Hospital, 1979-81 Supervisor: Dr. E.D. Wigle, Chief of Cardiology Ph.D. – Computer Science, University of Toronto, 1980Title: A Framework for Visual Motion Understanding Supervisors: J. Mylopoulos, H.D. Covvey (Toronto General Hospital), S.W. Zucker (McGill University) External Appraiser: H.-H. Nagel, University of Hamburg, Germany M.Sc. – Computer Science, University of Toronto, 1976 Supervisor: J. Mylopoulos B.A.Sc. (Honours) – Engineering Science (Computer Science Option), University of Toronto, 1974 Honours Fellow, Canadian Academy of Engineering 2024 Fellow, Asia-Pacific Artificial Intelligence Association 2022 CS-Can|Info-Can Award for Lifetime Achievement in Computer Science 2020 Fellow, IEEE (Computer Society) 2018 (achieved Life Fellow 2024) Citation: For contributions to active vision and computational models of visual attention Sir John William Dawson Medal, Royal Society of Canada, 2015 First Computer Scientist to receive this medal since award inception in 1987 Citation: Computer scientist John Tsotsos is a world leader in interdisciplinary research on human and computational vision. In visual psychology, his Selective Tuning theory has prompted new discoveries of human attentive behaviour. In neurobiology, his theory predicted novel characteristics of top-down processing in human perception. Finally, his seminal contributions to computational vision span early and intermediate visual representations, computational complexity of perception, visual attention, robotic active perception, and medical image analysis. Geoffrey J. Burton Memorial Lecture 2011 Awarded jointly in 2011 by the Applied Vision Association and the British Machine Vision Association at their Joint Meeting, Cardiff, UK, May 26. Fellow, Royal Society of Canada,Div. of Mathematical and Physical Sciences, Academy of Science 2010 Citation: John Tsotsos is Canada’s premiere interdisciplinary vision scientist, spanning computer and human vision. An international leader in active vision and computational models of vision and attention, he provided the first formal theorems regarding the complexity of human vision. Using these, he defined a neural architecture and theory of human visual attention, including counterintuitive predictions. These predictions have been strongly supported experimentally, now forming a new basis for vision science. His leadership in Canada is second to none, having built world-class vision groups and networks, and leading major scientific activities internationally in both computer and human vision science. Distinguished Research Professor of Vision Science, York University  2008 First Computer Scientist to receive this honour since award inception in 1983 Canadian Image Processing and Pattern Recognition Society Award: Research Excellence and Service  2006 Awards and Distinctions Best Student Paper Award (3rd), 35th IEEE Intelligent Vehicles Symposium, June 2024, South Korea, for Kotseruba, I., Tsotsos J.K. SCOUT+: Towards practical task-driver drivers’ gaze prediction 1st Prize: Best Computer Vision Poster, Int. Conference on Predictive Vision, Toronto, Jun. 10-13, 2019, for Wloka, C., Kunic, T., Kotseruba, I, Tsotsos, J.K., SMILER: An Easy and Consistent Way to Compute Saliency Maps. Winner, Visual Domain Decathlon (Image Classification in 10 Domains), PASCAL in Detail Workshop Challenge, IEEE/CVF Computer Vision and Pattern Recognition (CVPR), July 26, 2017, Honolulu, Hawaii for Rosenfeld, A., Tsotsos, J.K., Incremental Learning Through Deep Adaptation, arXiv:1705.04228. Best Conference Paper Finalist Award, Int. Conference on Computer Vision Systems, Shenzhen, China, Jul. 10-13, 2017, for Chen, B., Sahdev, R., Tsotsos, J.K., Integrating Stereo Vision with a CNN Tracker for a Person-Following Robot. Best Robotics Paper Award, Canadian Conference on Computer and Robot Vision (CRV) May 2017, Edmonton, for Chen, B., Sahdev, R., Tsotsos, J.K., Person Following Robot Using Selected Online Ada-Boosting with Stereo Camera. 1st President’s Research Excellence Award, York University, Nov. 2009 Inaugural award celebrating York University’s 50th birthday. Best Robotics Paper Prize, 5th Canadian Conference on Computer and Robot Vision, Windsor, Ont., May 28-30, 2008, for Andreopoulos, A., Tsotsos, J.K., Active Vision for Door Localization and Door Opening using Playbot: A Computer Controlled Wheelchair for People with Mobility Impairments. Best Papers at Conference Special Issue, Image and Vision Computing Journal 27(1-2), 2009, for Bauckhage, C., Tsotsos, J.K., Bunn, F.E., Automatic detection of abnormal gait. Mekuz, N., Bauckhage, C., Tsotsos, J.K., Subspace manifold learning with sample weights. Best Paper Prize, Canadian Conference on Computer and Robot Vision, Victoria, BC, May 2005, for Bauckhage, C., Tsotsos, J.K., Bunn, F.E., Detecting Abnormal Gait. NSERC Tier I Canada Research Chair in Computational Vision, Oct. 1, 2003 – Sept. 30, 2024. Gold Student Poster Award, 12th Canadian Conference on Intelligent Systems, Calgary, May 29, 2002, for B. Kapralos, M. Jenkin, E. Milios, J. K. Tsotsos, Detection of Hand Gestures Utilizing an Omni-directional Video Sensor for a Remote Teaching Application. Best Paper Nomination, 8th International Conference on Artificial Intelligence: Methodology, Systems, Applications, Sozopol, Bulgaria, Sept. 21-23, 1998, for Ye, Y., Tsotsos, J.K., Knowledge granularity and action selection. CITO 1997 Innovation Award for Leadership in Product Development  (with W. J. MacLean), Center for Information Technology Ontario, Province of Ontario Centers of Excellence Best Papers at Conference, Int. Symposium on Intelligent Robotic Systems, Lisbon, Portugal, July 1996, for Tsotsos, J.K., Intelligent Control for Perceptually Attentive Agents: The S* Proposal,  Also in Special Issue of Best at Conference of Robotics and Autonomous Systems Journal, 21-1, July 1997. Canadian Pacific/Unitel Ltd. Fellow, Artificial Intelligence and Robotics Program, Canadian Institute for Advanced Research, 1990-1995 David Marr Prize Award (Honorable Mention), 1st Int. Conference on Computer Vision, London, UK 1987, for Tsotsos, J.K.,  A ‘Complexity Level’ Analysis of Vision. Also in David Marr Prize Special Issue International Journal of Computer Vision, 2(1), Sept. 1988. Fellow, Canadian Institute for Advanced Research, Artificial Intelligence, Robotics & Society Program, 1985-1990. Canadian Heart Foundation Research Scholarship, 1981 - 1984 Ontario Heart Foundation Postdoctoral Fellowship, 1979 - 1981 Academic Career (chronological order) Instructor, Dept. of Mathematics and Computer Science, Atkinson College, York University, 1977-1978 Assistant Professor, Dept. of Medicine (Cardiology), University of Toronto, 1981-1984 Assistant Professor, Dept. of Computer Science, University of Toronto, 1980-1985 Founder, Computer Vision Research Group, Dept. of Computer Science, University of Toronto, 1980 Visiting Assistant Professor, Fachbereich Informatik, University of Hamburg, Germany, summer 1981 Founder, Research in Biological and Computational Vision Technical Report Series (RBCV-TR), University of Toronto, 1984 - 1996 Assistant Professor, Dept. of Engineering Science, University of Toronto, 1984-1985 Associate Professor (status), Dept. of Medicine (Cardiology), University of Toronto, 1984-1999 Associate Professor with Tenure, Dept. of Computer Science, University of Toronto, Jul. 1985 – Jun. 1990 Professor, Dept. of Computer Science, University of Toronto, Jul. 1990 – Dec. 1999 Visiting Professor, Multimedia Systems Institute of Crete, Technical University of Crete, Greece 1992 Associate Chair, Dept. of Computer Science, University of Toronto, Jul. 1996 – Dec. 1999 Visiting Scientist, Centre for Advanced Studies, IBM Canada, Toronto Labs, 1996 – 2002 Professor with Tenure, Dept. of Computer Science, York University, Jan. 2000 – present Director, Centre for Vision Research, York University, Jan. 2000 – Nov. 2006 Adjunct Professor, Dept. of Computer Science, University of Toronto, Jan. 2000 – 2023 Adjunct Professor, Dept. of Ophthalmology and Vision Sciences, University of Toronto, Jul. 2000 – present Adjunct Professor, Dept. of Computer Science, University of Western Ontario, 2001 – 2002 Faculty Fellow, Centre for Advanced Studies, IBM Canada, Toronto Labs, 2002 – 2003 Visiting Professor, INRIA Sophia-Antipolis, NeuroMathComp Laboratory, France, summer 2007 Adjunct Scientist, Toronto, Rehab Institute, University of Toronto, Apr. 2011 – Apr. 2013 Visiting Professor, Brain & Cognitive Sciences, Massachusetts Institute for Technology, Jan. – Jun. 2014 Founding Director, Centre for Innovation in Computing @ Lassonde, Jul. 2014 – Jun. 2024 200+ compl",
  "content_length": 12630,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:46"
}