{
  "name": "John Wright 0004",
  "homepage": "https://people.eecs.berkeley.edu/~jswright",
  "status": "success",
  "content": "John Wright - UC Berkeley CS John Wright Assistant Professor Department of Electrical Engineering and Computer Sciences, University of California, Berkeley My research is in theoretical computer science, with an emphasis on quantum computing. More specifically, I work on quantum state learning, quantum complexity theory, property testing, and approximation algorithms. Before joining UC Berkeley, I was at MIT, Caltech and UT Austin. I received my Ph.D. from Carnegie Mellon University, where I was advised by Ryan O'Donnell. I received my B.Sc. in computer science from UT Austin. Current teaching CS170: Efficient Algorithms and Intractable Problems Workshops STOC 2021: MIP* = RE Other writings A primer on the statistics of longest increasing subsequences and quantum states Joint with Ryan O'Donnell Slightly longer version of a survey appearing in SIGACT News See also an expanded version of this survey by Ryan O'Donnell How to learn a quantum state My CMU PhD thesis, 2016. Prior teaching Spring 2025: CS170: Efficient Algorithms and Intractable Problems Fall 2024: CS 294: Quantum Learning Theory Spring 2024: CS 294: Quantum Coding Theory Fall 2023: CS170: Efficient Algorithms and Intractable Problems Spring 2023: CS170: Efficient Algorithms and Intractable Problems Fall 2022: CS 294: Quantum Complexity Theory Spring 2022: CS170: Efficient Algorithms and Intractable Problems Fall 2020: CS395T: Advanced Quantum Complexity Theory (UT Austin) Fall 2015: 15-859BB: Quantum Computation and Information (Carnegie Mellon University) Contact Info Email: jswright@berkeley.edu Publications Mixed state tomography reduces to pure state tomography Angelos Pelecanos, Jack Spilecki, Ewin Tang, John Wright Manuscript The debiased Keyl's algorithm: a new unbiased estimator for full state tomography (video) Angelos Pelecanos, Jack Spilecki, John Wright QIP '26 Optimal lower bounds for quantum state tomography Thilo Scharnhorst, Jack Spilecki, John Wright QIP '26 Conjugate queries can help Ewin Tang, John Wright, Mark Zhandry Appearing in QIP '26 as the merged paper Quantum oracles, weak and strong Haar random codes attain the quantum Hamming bound, approximately Fermi Ma, Xinyu Tan, John Wright QIP '26 Are controlled unitaries helpful? Ewin Tang, John Wright Appearing in QIP '26 as the merged paper Quantum oracles, weak and strong Amplitude amplification and estimation require inverses Ewin Tang, John Wright Appearing in QIP '26 as the merged paper Quantum oracles, weak and strong Beating full state tomography for unentangled spectrum estimation Angelos Pelecanos, Xinyu Tan, Ewin Tang, John Wright SODA '26 The state hidden subgroup problem and an efficient algorithm for locating unentanglement (video) Adam Bouland, Tudor Giurgică-Tiron, John Wright STOC '25, QIP '25 Invited to the SICOMP Special issue for STOC '25 Short plenary talk at QIP '25 A one-query lower bound for unitary synthesis and breaking quantum cryptography Alex Lombardi, Fermi Ma, John Wright STOC '24, QIP '24 See Quanta magazine for coverage of our results. Unique Games hardness of Quantum Max-Cut, and a conjectured vector-valued Borell's inequality (slides) Yeongwoo Hwang, Joe Neeman, Ojas Parekh, Kevin Thompson, John Wright SODA '23, QIP '23 Testing matrix product states Mehdi Soleimanifar, John Wright SODA '22, QIP '22 Quantum soundness of testing tensor codes Zhengfeng Ji, Anand Natarajan, Thomas Vidick, John Wright, Henry Yuen FOCS '21 Quantum soundness of the classical low individual degree test Zhengfeng Ji, Anand Natarajan, Thomas Vidick, John Wright, Henry Yuen Manuscript MIP* = RE (video) Zhengfeng Ji, Anand Natarajan, Thomas Vidick, John Wright, Henry Yuen Manuscript See Quanta magazine, Gizmodo, Vice, ScienceNews, MyCQState, Shtetl-Optimized, Windows on Theory, Combinatorics and more, and Quantum Frontiers for coverage of our results. NEEXP ⊆ MIP* (video) Anand Natarajan, John Wright FOCS '19, QIP '20 Best paper award at FOCS '19 Plenary talk at QIP '20 See Quanta magazine, MyCQstate, and Computational Complexity for coverage of our results. See also a short story by Henry Yuen. Quantum State Certification (video) Costin Bădescu, Ryan O'Donnell, John Wright STOC '19, QIP '18 Which Distribution Distances are Sublinearly Testable? Costis Daskalakis, Gautam Kamath, John Wright SODA '18 Efficient quantum tomography II (slides) Ryan O'Donnell, John Wright STOC '17 Improved and simplified inapproximability for k-means Euiwoong Lee, Melanie Schmidt, John Wright Information Processing Letters 120, pp. 40-43 (2017) Efficient quantum tomography (video) Ryan O'Donnell, John Wright To appear, Journal of the ACM. STOC '16, QIP '16 See also our note on the Haah et al. tomography algorithm (pdf). Beating the random assignment on constraint satisfaction problems of bounded degree (slides) Boaz Barak, Ankur Moitra, Ryan O'Donnell, Prasad Raghavendra, Oded Regev, David Steurer, Luca Trevisan, Aravindan Vijayaraghavan, David Witmer, John Wright APPROX '15 Adaptivity helps for testing juntas (slides) Rocco Servedio, Li-Yang Tan, John Wright CCC '15 Quantum spectrum testing Ryan O'Donnell, John Wright Communications in Mathematical Physics 387(1), pp. 1-75 (2021) Conference version: STOC '15, QIP '15 Improved NP-inapproximability for 2-variable linear equations (slides) Johan Håstad, Sanxia Huang, Rajsekar Manokaran, Ryan O'Donnell, John Wright Theory of Computing 13(19), pp. 1-51 (2017) Conference version: APPROX '15 Optimal strong parallel repetition for projection games on low threshold rank graphs (slides) Madhur Tulsiani, John Wright, Yuan Zhou ICALP '14 A composition theorem for parity kill number Ryan O'Donnell, Xiaorui Sun, Li-Yang Tan, John Wright, Yu Zhao CCC '14 Hardness of robust graph isomorphism, Lasserre gaps, and asymmetry of random graphs (video) Ryan O'Donnell, John Wright, Chenggang Wu, Yuan Zhou SODA '14 Decision trees, protocols, and the Fourier Entropy-Influence Conjecture (slides) Andrew Wan, John Wright, Chenggang Wu ITCS '14 New NP-hardness results for 3-Coloring and 2-to-1 Label Cover Per Austrin, Ryan O'Donnell, Li-Yang Tan, John Wright ACM Transactions on Computation Theory 6(1), pp. 2:1-20 (2014) Preliminary version: APPROX '12, A new point of NP-hardness for 2-to-1 Label Cover A new point of NP-hardness for Unique Games Ryan O'Donnell, John Wright STOC '12 The Fourier Entropy-Influence Conjecture for certain classes of Boolean functions Ryan O'Donnell, Yuan Zhou, John Wright ICALP '11",
  "content_length": 6468,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:14"
}