{
  "name": "John Board",
  "homepage": "https://ece.duke.edu/faculty/john-board",
  "status": "success",
  "content": "John Board | Duke Electrical & Computer Engineering John Board Jr., Ph.D. Electrical and Computer Engineering Associate Professor of Electrical and Computer Engineering John Board Jr., Ph.D. Profile Photo Research Themes Trustworthy Computing Research Interests High performance scientific computing and simulation, novel computer architectures, cluster computing and parallel processing; ubiquitous computing. Bio John Board is an Associate Professor of ECE and of Computer Science. He also serves as Associate Chief Information Officer for Duke University.  He received his D.Phil in 1986 from Oxford University. His research interests include: High performance scientific computing and simulation, novel computer architectures, cluster computing and parallel processing; ubiquitous computing. Education B.S.E. Duke University, 1981 M.S. Duke University, 1982 Ph.D. University of Oxford (United Kingdom), 1986 Positions Associate Professor of Electrical and Computer Engineering Associate Professor of Computer Science Bass Fellow Awards, Honors, and Distinctions Klein Family Distinguished Teaching Award. Duke University, Pratt School of Engineering. 2008 Rhodes Scholar. The Rhodes Trust. 2008 Member. Eta Kappa Nu. 2008 Distinguished Young Alumnus. Duke University. 2008 Distinguished Teaching Award. Duke University School of Engineering. 2008 Member. Tau Beta Pi. 2008 Member. Phi Beta Kappa. 2008 Courses Taught HOUSECS 59: House Course ENGLISH 498: Distinction Critical Research Independent Study ECE 899: Special Readings in Electrical Engineering ECE 495: Special Topics in Electrical and Computer Engineering ECE 494: Projects in Electrical and Computer Engineering ECE 493: Projects in Electrical and Computer Engineering ECE 391: Projects in Electrical and Computer Engineering ECE 350L: Digital Systems ECE 250D: Computer Architecture COMPSCI 350L: Digital Systems COMPSCI 250D: Computer Architecture Publications Li X, Chang X, Board JA, Trivedi KS. A novel approach for software vulnerability classification. In: Proceedings Annual Reliability and Maintainability Symposium. 2017. Ybarra GA, Collins LM, Huettel LG, Coonley KD, Massoud HZ, Board JA, et al. Integrated sensing and information processing theme-based redesign of the undergraduate electrical and computer engineering curriculum at Duke University. Advances in Engineering Education. 2010;2(4). Ybarra GA, Collins LM, Huettel LG, Massoud HZ, Board JA, Brooke M, et al. Integrating sensing and information processing in an electrical and computer engineering undergraduate curriculum. In: Proceedings Frontiers in Education Conference Fie. 2009. Brown A, Ybarra G, Massoud H, Board J, Holmes J, Coonley K, et al. Redesign of the core curriculum at Duke University. In: ASEE Annual Conference and Exposition, Conference Proceedings. 2006. Brown A, Ybarra G, Massoud H, Board J, Holmes J, Coonley K, et al. Redesign of the core curriculum at Duke University. In: ASEE Annual Conference and Exposition Conference Proceedings. 2006. Banerjee S, Board JA. Efficient charge assignment and back interpolation in multigrid methods for molecular dynamics. Journal of computational chemistry. 2005 Jul;26(9):957u201367. Collins LM, Huettel LG, Brown AS, Ybarra GA, Holmes JS, Board JA, et al. Theme-based redesign of the duke university ECE curriculum: The first steps. In: ASEE Annual Conference and Exposition, Conference Proceedings. 2005. p. 14313u201326. Pormann JB, Board JA, Rose DJ, Henriquez CS. Large-scale modeling of cardiac electrophysiology. Computers in Cardiology. 2002 Dec 1;29:259u201362. Jones E, Krishnapuram B, Pormann J, Board J, Carin L. An electromagnetic simulation environment. Proceedings of SPIE the International Society for Optical Engineering. 2001 Jan 1;4367:137u201343. Toukmaji A, Sagui C, Board J, Darden T. Efficient particle-mesh Ewald based approach to fixed and induced dipolar interactions. Journal of Chemical Physics. 2000 Dec 1;113(24):10913u201327. Pormann J, Board J, Henriquez C. Modular simulation of cardiac dynamics on distributed memory parallel computers. Annals of Biomedical Engineering. 2000 Dec 1;28(SUPPL. 1). Pormann JB, Board JA, Rose DJ, Henriquez CS. Automated membrane model creation. Computers in Cardiology. 2000 Dec 1;235u20138. Pormann J, henriquez CS, board JA, rose DJ, harrild D, henriquez AP. Computer simulations of cardiac electrophysiology. SCu201900 Proceedings of the 2000 ACM/IEEE conference on Supercomputing. 2000 Nov 1; Cramer CE, Board JA. The development and integration of a distributed 3D FFT for a cluster of workstations. In: Proceedings of 4th Annual Linux Showcase and Conference 2000 Als 2000. 2000. Board J, Schulten K. The fast multipole algorithm. Computing in Science and Engineering. 2000 Jan 1;2(1):76u20139. Pormann J, Board J, Henriquez C. Modular simulation of cardiac dynamics on distributed memory parallel computers. Annals of Biomedical Engineering. 2000;28(SUPPL 1):30. Schlick T, Skeel RD, Brunger AT, Kalu00e9 LV, Board JA, Hermans J, et al. Algorithmic Challenges in Computational Molecular Biophysics. Journal of Computational Physics. 1999 May 1;151(1):9u201348. Schlick T, Skeel RD, Brunger AT, Kale LV, Jr BJA, Hermans J, et al. Algorithmic challenges in computational molecular biophysics. J Comput Phys (USA). 1999;151(1):9u201348. Portmann JB, Board JA, Rose DJ. The implicit pipeline method. Proceedings of the 1st Merged International Parallel Processing Symposium and Symposium on Parallel and Distributed Processing IPPS Spdp 1998. 1998 Jan 1;1998-March:721u20135. Board JA. Introduction to u201cA Fast Algorithm for Particle Simulationsu201d. Journal of Computational Physics. 1997 Aug;135(2):279u2013279. Bakhoum EG, Board JA. The geometric solution of Laplace's equation. Journal of Computational Physics. 1996 Jan 1;123(2):274u201395. Elliott WD, Board JA. Fast fourier transform accelerated fast multipole algorithm. SIAM Journal on Scientific Computing. 1996 Jan 1;17(2):398u2013415. Toukmaji AY, Board JA. Ewald summation techniques in perspective: A survey. Computer Physics Communications. 1996 Jan 1;95(2u20133):73u201392. Lambert CG, Darden TA, Board JA. A multipole-based algorithm for efficient calculation of forces and potentials in macroscopic periodic assemblies of particles. Journal of Computational Physics. 1996 Jan 1;126(2):274u201385. Walsh SJ, Board JA. Pollution control caching. Proceedings IEEE International Conference on Computer Design VLSI in Computers and Processors. 1995 Dec 1;300u20136. Rankin WT, Board JA. Portable distributed implementation of the parallel multipole tree algorithm. IEEE International Symposium on High Performance Distributed Computing Proceedings. 1995 Dec 1;17u201322. Board JA, Hakura ZS, Elliott WD, Gray DC, Blanke WJ, Leathrum JF. Scalable implementations of multipole-accelerated algorithms for molecular dynamics. Proceedings of the Scalable High Performance Computing Conference. 1994 Dec 1;87u201394. Board JA, Kalu00e9 LV, Schulten K, Skeel RD, Schlick T. Modeling Biomolecules: Larger Scales, Longer Durations. IEEE Computational Science and Engineering. 1994 Jan 1;1(4):19u201330. Bakhoum EG, Board JA. Generalized formula for the first derivative of the electric-field intensity. Physical review E, Statistical physics, plasmas, fluids, and related interdisciplinary topics. 1993 May;47(5):3682u20135. Board JA, Causey JW, Leathrum JF, Windemuth A, Schulten K. Accelerated molecular dynamics simulation with the parallel fast multipole algorithm. Chemical Physics Letters. 1992 Oct 2;198(1u20132):89u201394. Leathrum, F J, Jr, Board, A J. Mapping the adaptive fast multipole algorithm onto MIMD systems. Unstructured Scientific Computation on Scalable Multiprocessors. 1992;161u201377. Board JA. Grand challenges in biomedical computing. Critical reviews in biomedical engineering. 1992 Jan;20(1u20132):1u201324. Madden PA, Ou2019Sullivan K, Board JA, Fowler PW. Light scattering by alkali halide melts: A computer simulation study. Journal of Chemical Physics. 1991 Jan 1;94(2):918u201327. Board JA, Batchelor RR, Leathrum JF. High performance implementations of the fast multipole algorithm. American Society of Mechanical Engineers Heat Transfer Division Publication HTD. 1990 Dec 1;133:27u201333. Board, A J, Jr, Lu S-J, J. Performance of parallel neural network simulations. Transputer Research and Applications 2 NATUG-2 Proceedings of the North American Transputer Users Group. 1990;185u2013200. Board, A J, Jr, Leathrum, F J. The fast multipole algorithm on Transputer networks. Transputer Research and Applications 3 NATUG-3 Proceedings of the Third North American Transputer Users Group. 1990;63u201374. Board JA, Elliott RJ. Shell model molecular dynamics calculations of the Raman spectra of molten NaI. Journal of Physics Condensed Matter. 1989 Dec 1;1(13):2427u201340. Board, A J, Jr, Frank, A G. Algorithms and architecture constraints for a class of real-time image processing problems. Proc SPIE - Int Soc Opt Eng (USA). 1989;977:96u2013103. Madden PA, Board JA. Light scattering by liquid and solid sodium chloride. A simulation study. Journal of the Chemical Society Faraday Transactions 2 Molecular and Chemical Physics. 1987 Dec 1;83(10):1891u2013908. Zoppi M, Buckingham AD, Keyes T, De Schepper IM, Huijts RA, Yarwood J, et al. General discussion. Journal of the Chemical Society Faraday Transactions 2 Molecular and Chemical Physics. 1987 Jan 1;83(10):1921u201337. Board JA, Marinos PN. INTERACTIVE SIMULATION FACILITY FOR THE EVALUATION OF SHARED-RESOURCE ARCHITECTURES (PARALLEL ARCHITECTURE SIMULATOR - PARSIM). Proceedings Design Automation Conference. 1983 Jan 1;83u201392. In The News Duke Celebrates 70 Years of Discovery and Research at the National Science Foundation (May 14, 2020 | Duke Government Relations)",
  "content_length": 9798,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:26"
}