{
  "name": "John J. Regazzi",
  "homepage": "http://liu-post.academia.edu/JohnRegazzi",
  "status": "success",
  "content": "John Regazzi - LIU Post Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless John RegazziLIU Post, Library and Information Science, Faculty MemberaddFollowdoneFollowingFollowers58Following25Co-author1Public ViewsRelated Authors Enrique Orduña-MaleaUniversidad Politécnica de Valencia Emilio Delgado López-CózarUniversity of Granada José Ortega José Luis OrtegaCSIC (Consejo Superior de Investigaciones Científicas-Spanish National Research Council) Isidro AguilloCSIC (Consejo Superior de Investigaciones Científicas-Spanish National Research Council) Isidro F. AguilloCSIC (Consejo Superior de Investigaciones Científicas-Spanish National Research Council) Daniel Torres-SalinasUniversity of Granada Enrique Orduña damola bankole Jeyashree swaminathanQueen Marys CollegeInterests UploadsPapers by John RegazziInfluence of the Academic Library on US University Reputation: A Webometric Approachby Enrique Orduña-Malea and John RegazziTechnologies, 2013A previous study conducted through a survey of academic libraries at 100 US universities with the... more A previous study conducted through a survey of academic libraries at 100 US universities with the highest total expenditures on academic libraries according to data presented by the National Center for Education Statistics (NCES). The results pointed out an unexpectedly weak correlation among web variables, concluding that the complex online structure of US academic libraries was the main driver of this effect. The present study replicates this research applying the same web indicators but at the university level, to check whether the weak compactness among web indicators persists. Additionally, the percentage (in terms of web data) of academic libraries at universities is analyzed. Finally, the correlation among web and economic indicators (research expenditures, student population, and reputational rank position) for universities is calculated to check for a possible relationship. Results confirm a strong correlation among university web indicators. Otherwise, the strength of academic libraries at universities is moderate in terms of page count, but weak in terms of visits. Finally, the correlation among university web indicators and research expenditures depends on student population.Download Author-perceived quality characteristics of science, technology and medicine (STM) journals Signal generator melds speed with low phase noise Comparing Academic Library Spending with Public Libraries, Public K-12 Schools, Higher Education Public Institutions, and Public Hospitals Between 1998–2008The Journal of Academic Librarianship, Jan 1, 2012Download The Shifting Sands of Open Access Publishing, a Publisher's ViewSerials Review, Jan 1, 2004This paper sets Open Access (OA) publishing in the context of today's scientific, technical, and ... more This paper sets Open Access (OA) publishing in the context of today's scientific, technical, and medical (STM) publishing trends. Four areas are covered: (a) a brief overview of STM publishing and its value today; (b) OA's place in the industry; (c) the underlying economics of OA, particularly its author-pays model; and (d) directions in moving towards “universal access” to STM information, where both researchers and the public have access to the scientific information they need. WILSONLINE: a review of featuresLibrary hi tech, Jan 1, 1985RefDoc Bienvenue - Welcome. Refdoc est un service / is powered by. ... The Uses of CD-ROM and Other Information Delivery Systems for Libraries: A Publisher's ViewPage 1. JOHN J. REGAZZI President and CEO Engineering Information, Inc. New York, New York The Us... more Page 1. JOHN J. REGAZZI President and CEO Engineering Information, Inc. New York, New York The Uses of CD-ROM and Other Information Delivery Systems for Libraries: A Publisher&amp;#x27;s View INTRODUCTION The delivery ... Why Did Elsevier Buy Endeavor?The Charleston Advisor, Jan 1, 2000 A bend in the road: the current state of author pays journals Open Access journal growth has been slowed down since 2001. There are 98 OA journals started in... more  Open Access journal growth has been slowed down since 2001. There are 98 OA journals started in 2004, down from 218 in 2001, among which 18 are by BMC, one by PLoS and the other author pays is Advances in Electronics Manufacturing Technology, published by ... Continuing Education in On-Line Searching: An Instructional Module for Special Librarians.Special Libraries, Jan 1, 1978EJ183723 - Continuing Education in On-Line Searching: An Instructional Module for Special Librari... more EJ183723 - Continuing Education in On-Line Searching: An Instructional Module for Special Librarians. ALCOHOL INFORMATION: Some Perspectives on the Development of a Problem-Oriented System. John J. Regazzi Center of Alcohol Studies Rutgers- …… information: Anaheim, California, October 5-10, 1980, Jan 1, 1980 User driven: The evolution of the Ei reference deskLibrary hi tech, Jan 1, 1992Abstract: Growth in the primary engineering literature has been accompanied by a boom in electron... more Abstract: Growth in the primary engineering literature has been accompanied by a boom in electronic secondary information-retrieval products and services which can access information that is increasingly current, specific, and inclusive. While these services provide more options and solutions for researchers, the perception of an overwhelming array of hard-to-use electronic searching alternatives has been confusing. Users want an electronic searching system simple enough for library patrons to use, while at the same time ... Norman Thomas Reconsidered: A Quest for Individual and Societal Excellence EXECUTIVE IN A PUBLISHING FIRM OFFERING PRINT AND COMPUTER-BASED INFORMATION SERVICESOpening new doors: alternative careers for …, Jan 1, 1993 Trends in the Higher Education E-Learning Marketsigi-global.comDownload The Development of Some Automated Techniques of Information Retrieval in Family Planning and Population Libraries.ED112900 - The Development of Some Automated Techniques of Information Retrieval in Family Planni... more ED112900 - The Development of Some Automated Techniques of Information Retrieval in Family Planning and Population Libraries. Constrained?An Analysis of US Academic Library Shifts in Spending, Staffing and Utilization, 19982008College & Research Libraries, Jan 1, 2011< 1,000 J J J 1,000 -2,999 J J 3,000 -9,999 J J 10,000 + J J Note: J indicates primary category (... more < 1,000 J J J 1,000 -2,999 J J 3,000 -9,999 J J 10,000 + J J Note: J indicates primary category (> 50%) by size class; two categories indicated means neither achieved 50%.Download Economic Trade-offs of Information Delivery Systems John J. RegazziDollars and sense: implications of the …, Jan 1, 1987 Combining the information and measurement worlds to improve system performance and operational readiness… Proceedings, 2000 IEEE, Jan 1, 2000Abstract Standardization of software and hardware interfaces has led to a breakthrough in measure... more Abstract Standardization of software and hardware interfaces has led to a breakthrough in measurement product architectures. It is now possible to embed the measurement science of high-performance automatic test equipment in a PC. Doing so provides connectivity ... Converting the HW Wilson Company indexes to an automated system: a functional analysisInformation services & use, Jan 1, 1984RefDoc Bienvenue - Welcome. Refdoc est un service / is powered by. ... ×CloseLog InLog in with GoogleorEmailPasswordRemember me on this computeror reset passwordEnter the email address you signed up with and we'll email you a reset link. Need an account? Click here to sign up AboutPressPapersTopicsAcademia.edu Journals We're Hiring! Help CenterFind new research papers in:PhysicsChemistryBiologyHealth SciencesEcologyEarth SciencesCognitive ScienceMathematicsComputer ScienceTermsPrivacyCopyrightContent PolicyAcademia ©2025",
  "content_length": 8206,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:45"
}