{
  "name": "John Marty Emmert",
  "homepage": "https://researchdirectory.uc.edu/p/emmertj",
  "status": "success",
  "content": "Expert Profile: John Emmert | Research Directory John Martin Emmert Interim Dean Rhodes Hall 812D CEAS - College of Eng & Appl Science - 0030 EmailDownload V-Card Dr. John (Marty) Emmert is a Professor in the Department of Electrical Engineering and Computer Science. He is also Director of the NSF Center for Hardware and Embedded Systems Security and Trust (CHEST) IUCRC. He has seven United States patents and has directed over $9M in research funding. In addition, he and colleagues have been awarded five phase II Small Business Innovative Research contracts from the Department of Defense. He is a senior member of the Institute of Electrical and Electronics Engineers (IEEE), and he has received the IEEE Harold Nobel Award and the AFRL Sensors Directorate James B. Tsui Award for best patent. His research interests span various topics including: VLSI Design and Architectures; ASICs; FPGAs; Embedded Systems; Hardware Security, Assurance, and Trust; Reconfigurable Computing; Fault Tolerance for Integrated Circuits; Electronic Warfare; GPS; and Automated Tools for IC Design and Trust. His research has been funded by the Air Force, the Army, the Navy, DARPA, NSF, the State of Ohio and various industries. He also served on active duty and as a reservist in the United States Air Force from 1989-2015. In the Air Force he held positions from UAV pilot to reserve wing commander, and he retired after 26 years as a Colonel. He has been awarded the Air Force Legion of Merit and five Meritorious Service Medals.Ph.D.: University of Cincinnati Cincinnati, Ohio, 1999 (Computer Engineering) M.S.: Air Force Institute of Technology Dayton, OH, 1993 (Electrical Engineering) B.S.: University of Kentucky Lexington, KY, 1987 (Electrical Engineering) Computer Hardware (HW), especially Integrated Circuit (IC) Design: Field Programmable Gate Arrays (FPGA) and Application Specific Integrated Circuits (ASIC); Very Large Scale Integrate Circuit (VLSI) Design; Assurance, Security, and Trust for HW; HW Fault Tolerance; Asynchronous Circuit Design; Reconfigurable Computing; Cyber Physical Systems (CPS); Embedded Systems; Automated Computer Aided Design (CAD) Algorithm and Tool Development for IC HW; Circuits, Systems, and Sensors for Electronic Warfare (EW); and Integration of Global Positioning System (GPS) Algorithms and Methods. Grant: #Subcontract 2104 PROJECT AB10438 / FA807518D0004 Investigators:Emmert, John; Harknett, Richard 08-01-2021 -09-29-2027 Department of the Air Force Center for Cyber Strategy and Policy Role:Collaborator 0.00 Hold Level:Federal Grant: #IAC/TAT #P1-17-1559 Investigators:Emmert, John 07-01-2021 -09-30-2026 Air Force Research Laboratory PRE-MASTER AGREEMENT: Microelectronics Assurance for Secure Trustworthy Electronics Research (MASTER) Air Force Research Laboratory (AFRL)/Trusted Electronics Branch (RYDT) Role:PI 0.00 Hold Level:Federal Grant: #DGE-2043106 Investigators:Cahay, Marc; Emmert, John; Harknett, Richard; Li, Chengcheng; Michael, Rebekah; Said, Hazem 02-15-2021 -01-31-2026 National Science Foundation Cybersecurity Scholar Incubator at University of Cincinnati (CSI:UC) Role:Collaborator $1,383,804.00 Awarded Level:Federal Grant: #MITRE / CNS-1916722 Investigators:Emmert, John 10-01-2020 -09-30-2024 National Science Foundation CHEST IAB Membership Agreement with the MITRE Corporation Role:PI 50000.00 Hold Level:Federal Grant: #RRI / CNS-1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2020 -09-30-2024 National Science Foundation IAB Membership Agreement for Riverside Research Role:PI $50,000.00 Active Level:Federal Grant: #TAME01-UC-2020 / 47QFLA20R0008/47QFLA20F0096 Investigators:Emmert, John; Jha, Rashmi 09-01-2020 -12-31-2020 Air Force Research Laboratory (RFP) TAME01-UC-2020 Role:PI $43,991.00 Active Level:Federal Grant: #IPIP 001 - Reverse Engineering / CNS-1916722 Investigators:Emmert, John; Purdy, Carla 06-01-2020 -05-31-2021 National Science Foundation Internal Award to Dr. Emmert from the program Income account in the CHEST Grant. This project, Reverse Engineering Methodology for FPGA Bitstreams, was approved by the IAB. Role:PI $50,000.00 Active Level:Federal Grant: #IPIP 002 - Asynchronous Design / CNS-1916722 Investigators:Emmert, John 06-01-2020 -05-31-2021 National Science Foundation Asynchronous Design for Side Channel Avoidance Role:PI $100,000.00 Active Level:Federal Grant: #ADI / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation IAB Membership Agreement for Analog Devices, Inc. (ADI) Role:PI $50,000.00 Awarded Level:Federal Grant: #Tennet 3, LLC / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 Tenet 3, LLC IAB Membership Agreement for Tenet 3 Role:PI $50,000.00 Awarded Level:Industry Grant: #S20-1996-S001 / 1916741 Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation Allocation from UC Davis to provide partial support for the CHEST Manager of Research Development position over five year project duration. Role:PI $10,000.00 Active Level:Federal Grant: #CNS-1916722 Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation Center for Hardware and Embedded Systems Security and Trust (CHEST) Role:PI $750,000.00 Active Level:Federal Grant: #1907167 / 1916750 Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation Allocation from University of Texas at Dallas to provide partial salary support for CHEST Research Manager position over term of five-year project duration Role:PI $20,000.00 Active Level:Federal Grant: #ECI / NSF 1916722- CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation IAB Membership Agreement for Edaptive Computing, Inc. (ECI) Role:PI $50,000.00 Awarded Level:Federal Grant: #CSDI / / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation IAB Membership Agreement for Draper Laboratory Role:PI $50,000.00 Active Level:Federal Grant: #ARA / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation CHEST IAB Membership Agreement for Applied Research Associates, Inc. Role:PI $50,000.00 Active Level:Federal Grant: #CCALS / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation IAB Membership for Commonwealth Center for Advanced Logistics Systems (CCALS) Role:PI $125,000.00 Awarded Level:Federal Grant: #Raytheon / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation IAB Membership Agreement for Raytheon Company Role:PI $50,000.00 Awarded Level:Federal Grant: #GA11454.PO#2237483 / 1916760 Investigators:Emmert, John 10-01-2019 -09-30-2021 National Science Foundation Allocation from University of Virginia provide partial salary support for CHEST Research Manager position over term of five-year project duration Role:PI $20,000.00 Active Level:Federal Grant: #Fermata / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation IAB Membership Agreement for Fermata, LLC (dba Fermata Energy) Role:PI $50,000.00 Awarded Level:Federal Grant: #Nimbis / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation IAB Membership Agreement for Nimbis Services, Inc. Role:PI $50,000.00 Awarded Level:Federal Grant: #TDKC / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 The Design Knowledge Company CHEST IAB Membership Agreement with The Design Knowledge Company (TDKC) Role:PI $50,000.00 Awarded Level:Industry Grant: #UTC / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation IAB Membership for United Technologies Corporation (UTC) Role:PI $50,000.00 Awarded Level:Federal Grant: #393947 / 1916756 Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation The application from the University of Connecticut is to provide salary support for the Manager of Research Development for the CHEST IUCRC grant for a five year duration Role:PI $20,000.00 Active Level:Federal Grant: #KBR Wyle / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 KBR Wyle IAB Membership Agreement for KBR Wyle, LLC Role:PI 0.00 Hold Level:Industry Grant: #ASTC / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation IAB membership with Alion Science and Technology Corporation Role:PI 50000.00 Hold Level:Federal Grant: #BAH / NSF 1916722 - CHEST Membership Funds Investigators:Emmert, John 10-01-2019 -09-30-2024 National Science Foundation IAB Membership Agreement for Booz Allen Hamilton, Inc. (BAH) Role:PI 50000.00 Hold Level:Federal Grant: #502789-78050 / 1916762 Investigators:Emmert, John 09-15-2019 -08-31-2020 National Science Foundation Allocation from Northeastern University (NEU) to provide partial salary support for CHEST Research Manager position over term of five-year project duration Role:PI $10,000.00 Active Level:Federal Grant: #SETS03-UC-2019 / FA8650-14-D-1724/0003 Investigators:Emmert, John 06-01-2019 -04-30-2020 Air Force Research Laboratory Secure Engineering of Trusted Systems (SETS 03) Role:PI $50,155.00 Closed Level:Federal Grant: #Teaming Agreement Investigators:Emmert, John 04-26-2019 -04-25-2020 Booz Allen Hamilton TEAMING AGREEMENT By and between BOOZ ALLEN HAMILTON INC. and University of Cincinnati Role:PI $.00 Awarded Level:Industry Grant: #CNS-1854461 (transfer in 1747726) Investigators:Emmert, John 08-01-2018 -01-31-2019 National Science Foundation Planning IUCRC University of Cincinnati: Center for Hardware and Embedded System Security and Trust (CHEST) Role:PI $13,375.00 Closed Level:Federal Investigators:Cahay, Marc; Emme",
  "content_length": 13469,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:20"
}