{
  "name": "John C. Grundy",
  "homepage": "https://research.monash.edu/en/persons/john-grundy",
  "status": "success",
  "content": "John Grundy - Monash University XView Scopus Profile John Grundy Professor Professor, Department of Software Systems & Cybersecurity https://orcid.org/0000-0003-4928-7076 EmailJohn.Grundymonashedu Accepting PhD StudentsPhD projects<a href=\"https://supervisorconnect.it.monash.edu/\" onclick=\"target='_blank';\">https://supervisorconnect.it.monash.edu/</a> 1993 …2025 Research activity per year Personal profile BiographyI am Australian Laureate Fellow and a Professor of Software Engineering at Monash University. I hold the BSc(Hons), MSc and PhD degrees, all in Computer Science, from the University of Auckland. I am a Fellow of Automated Software Engineering, Fellow of Engineers Australia, Certified Professional Engineer, Engineering Executive, Member of the ACM and Senior Member of the IEEE. In my 5 year Laureate Fellowship I will be researching new approaches to engineering software systems that fully take into account the \"human\" aspects of end users and team members. This project aims to find fundamentally new ways to capture and use human-centric software requirements during model-driven software engineering and verifying that systems meet these requirements. There are major issues with misaligned software applications in terms of accessibility, usability, emotions, personality, age, gender, and culture. We aim to address these through new conceptual foundations and modelling techniques for their support during software engineering. The intended outcomes are enhanced theory, models, tools and capability for next-generation software engineering with these critical elements. Significant benefits are expected to include greatly improved software quality, developer productivity and cost savings. Previously I was the Senior Deputy Dean for the Faculty of Information Technology. I took up that role at the beginning of February 2018. I was 2IC to the Executive Dean, Faculty of IT. I worked with the Dean, Faculty Manager, Deputy Deans, Associate Deans and others to help lead and manage the Faculty, including people development and management, strategic planning, operations, finances, research and teaching leadership, engagement, … Until February 2018 I was Pro Vice-Chancellor ICT Innovation and Translation at Deakin University and an Alfred Deakin Professor. I provided strategic leadership of ICT research across the university with an emphasis on building collaborative teams across groups and disciplines, building teams to tackle larger problems and working with diverse stakeholders and partners on various externally funded projects. Before that I was at the Swinburne University of Technology, Melbourne, Australia and was the Dean of the School of Software and Electrical Engineering and the Director of the large Research Centre Swinburne University Centre for Computing and Engineering Software Systems (SUCCESS). I was previously the Head of Computer Science and Software Engineering  at Swinburne and briefly Deputy Dean for the previous Faculty of ICT. Before coming to Australia at the end of 2009 I was Head of Department for Electrical and Computer Engineering at the University of Auckland, New Zealand. From 2014-2017 I was also a Senior Principal Researcher with Data61. My teaching is mostly in the area of team projects, software requirements and design, software processes, distributed systems, and programming.  My research is mostly in the area of software tools and techniques, software architecture, model-driven software engineering, visual languages, software security engineering, service-based and component-based systems and user interfaces. My work is generally pretty applied and I do consulting work with a range of companies.  These have included, among many others, Unisono, Mailguard, Thales Australia, CA Labs, XSol Ltd, Orion Health Ltd, Peace Software Ltd, and Whitecloud Systems Ltd. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationSoftware Engineering, Doctor of Science (DSc), Domain-specific visual languages for model-driven software engineering, University of AucklandAward Date: 8 Jun 2023Computer Science, Doctor of Philosophy, University of AucklandAward Date: 6 May 1994Computer Science, Master of Science (with Distinction), University of AucklandAward Date: 10 May 1991Computer Science, Bachelor of Science (with First Class Honours), University of AucklandAward Date: 4 May 1989 Research area keywordsSoftware Engineeringmodel-driven engineeringdomain-specific visual languageshuman-centric software engineeringsoftware toolsuser interfaces Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2018 2018 2019 2020 2023 2024 2028 8 Active 13 Finished Projects per year Multi-Hazard public information and warning platforms for the futureDootsan, P. (Primary Chief Investigator (PCI)), Mehta, A. (Chief Investigator (CI)), Greer, D. (Chief Investigator (CI)), Murray, S. (Chief Investigator (CI)), Kuligowski, E. (Chief Investigator (CI)), Grifin, A. (Chief Investigator (CI)), Morrison, R. (Chief Investigator (CI)), Mocatta, G. (Chief Investigator (CI)), Stellmach, D. (Chief Investigator (CI)), Abrahams, J. (Chief Investigator (CI)), Grundy, J. (Chief Investigator (CI)), Hidellaarachchi, D. (Chief Investigator (CI)) & Begg, C. (Chief Investigator (CI))3/02/25 → 1/07/27Project: Research Personal Future Health PredictionGrundy, J. (Primary Chief Investigator (PCI)), Foley, M. (Partner Investigator (PI)) & Foley, B. (Partner Investigator (PI))1/09/24 → 31/03/28Project: Research CSIRO Next Generation Graduates Program: Building National Cybersecurity Capabilities for Digital Transformation in Manufacturing Xiang, Y. (Primary Chief Investigator (PCI)), Georgakopoulos, D. (Chief Investigator (CI)), Grundy, J. (Chief Investigator (CI)), Du, X. (Chief Investigator (CI)), Chen, C. (Chief Investigator (CI)), Ma, S. (Chief Investigator (CI)), Ruan, D. (Associate Investigator (AI)), Zhang, J. (Associate Investigator (AI)), Eisenbart, B. (Associate Investigator (AI)), Jayaraman, P. P. (Associate Investigator (AI)), Wen, S. (Associate Investigator (AI)) & Li, L. (Associate Investigator (AI))CSIRO - Commonwealth Scientific and Industrial Research Organisation3/07/23 → 31/12/27Project: Research ARC Training Centre for Optimal AgeingLim, Y. Y. (Primary Chief Investigator (PCI)), Kulic, D. (Chief Investigator (CI)), Grundy, J. (Chief Investigator (CI)), Batstone, J. (Chief Investigator (CI)), Olivier, P. (Chief Investigator (CI)), Wilson Rajaratnam, S. (Chief Investigator (CI)), Cornish, K. (Chief Investigator (CI)), Anderson, C. (Chief Investigator (CI)), Klein, B. (Chief Investigator (CI)), Browning, C. (Chief Investigator (CI)), Pase, M. (Chief Investigator (CI)), Abdi, E. (Chief Investigator (CI)), Robinson, N. (Chief Investigator (CI)), McNaney, R. (Chief Investigator (CI)), Srikanth, V. (Chief Investigator (CI)), Hill, K. (Chief Investigator (CI)), Flynn, D. (Chief Investigator (CI)), Callisaya, M. (Chief Investigator (CI)), Brusco, N. (Chief Investigator (CI)), Carreno-Medrano, P. (Chief Investigator (CI)), Cronin, J. (Partner Investigator (PI)), Fripp, J. (Partner Investigator (PI)), Kothari, N. (Partner Investigator (PI)), Toms, M. (Partner Investigator (PI)), Browne, E.-J. (Partner Investigator (PI)), Neilson, P. (Partner Investigator (PI)), Orelowitz, J. (Partner Investigator (PI)), Udagedara, I. B. (Partner Investigator (PI)), De Chaumont Rambert, C. (Partner Investigator (PI)), Haddock, R. (Partner Investigator (PI)), Pitt, A. (Partner Investigator (PI)), Pearman, A. (Partner Investigator (PI)), Lethlean, G. (Partner Investigator (PI)), Skye, S. (Partner Investigator (PI)), Cai, J. (Chief Investigator (CI)), Ayton, D. (Chief Investigator (CI)), Jackson, M. (Chief Investigator (CI)), Little, K. (Project Manager), Cook, A. (Partner Investigator (PI)), Foley, M. (Chief Investigator (CI)), Foley, B. (Partner Investigator (PI)), Varma, P. (Chief Investigator (CI)), Turner, A. (Partner Investigator (PI)), Manifold, J. (Chief Investigator (CI)) & McNaney, R. (Chief Investigator (CI))ARC - Australian Research Council, Flagstaff Group Limited, Future Wellness Group Holdings Pty Ltd, Aunty Grace Pty Ltd, Andromeda Robotics Holdings Pty Ltd25/05/23 → 25/05/28Project: Research RAISE: RAISE: Creating Responsible AI Software Engineering CapabilityTantithamthavorn, K. (Primary Chief Investigator (PCI)), Grundy, J. (Chief Investigator (CI)), Abdelrazek, M. A. (Chief Investigator (CI)), Thongtanunam, P. (Chief Investigator (CI)), Aleti, A. (Chief Investigator (CI)), Nakisa, B. (Chief Investigator (CI)), Treude, C. (Associate Investigator (AI)), Zahedi, M. (Associate Investigator (AI)), Arora, C. (Associate Investigator (AI)), Hoda, R. (Associate Investigator (AI)), Chen, C. (Associate Investigator (AI)), Chen , J. (Associate Investigator (AI)), Cooray, M. (Associate Investigator (AI)), Bigdeli, A. (Associate Investigator (AI)), Uzunov, A. (Associate Investigator (AI)), Hurse, M. (Associate Investigator (AI)) & Saunders, S. (Associate Investigator (AI))Episoft Pty Ltd, Swordfish Computing Pty Ltd1/01/23 → 31/12/27Project: Research View all 21 projects Research output Research output per year 1993 2020 2021 2022 2023 2024 2025 353 Conference Paper 185 Article 15 Paper 15 Review Article 30 More 14 Chapter (Book) 8 Editorial 6 Foreword / Postscript 1 Book 1 Edited Book Research output per year Research output per year Accessibility of low-code approaches: A systematic l",
  "content_length": 12221,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:29"
}