{
  "name": "John Woods",
  "homepage": "https://www.essex.ac.uk/people/woods19406/john-woods",
  "status": "success",
  "content": "John Woods | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage John Woods People Dr John Woods Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email woodjt@essex.ac.uk Location 1NW.3.10, Colchester Campus Academic support hours 9 - 11 Tuesday Morning. Zoom or f2f by email appointment Profile Research Teaching and supervision Publications Grants and funding Contact Profile Research Teaching and supervision Publications Grants and funding Contact Profile Biography Member of the Robotics Research Group (See also:staff research interests by category) Research and professional activities Research interests Image processing Open to supervise model-based coding and 3-D modelling Open to supervise IP and ATM networks Open to supervise telecommunications principles Open to supervise robotics and autonomous vehicles Open to supervise sensor networks and robotic aviation Open to supervise Teaching and supervision Current teaching responsibilities Electronic System Design and Integration (CE721) Group Project with Industrial Practice (CE722) Individual Project (CE905) MSc Industry Based Project and Dissertation (CE911) Current supervision Billy Baker Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Previous supervision Carolyn Jean Swinney Thesis title: Signal Classification At Discrete Frequencies Using Machine Learning Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 10/1/2023 Salman Tilkidagi Thesis title: Identification of Commonalities in 2D Video Games for Realisation in Ai Degree subject: Computer Science Degree type: Master of Science (by Dissertation) Awarded date: 30/11/2021 Michael Walton Thesis title: The Machine That Lives Forever Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 23/7/2021 Onalenna Junior Makhura Thesis title: Video Object Counting in Unconstrained Environments Using Density-Based Clustering Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 19/12/2019 Amit Sadanand Walinjkar Thesis title: Signal Processing for Early Warning Arrhythmia Detection and Survival Prediction for Clinical Decision Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 22/11/2019 Sameera A'Amer Abdul-Kader Thesis title: An Online Feedable New Born Conversational Agent Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 5/11/2018 Thabat Fakhri Younus Thabet Thesis title: Efficient Magnetic Resonance Wireless Power Transfer Systems Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 14/9/2018 Atinat Palawan Thesis title: Scalable Video Transportation Using Look Ahead Scheduling Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 26/6/2018 Rabab Jasim Mohsin Al-Zaidi Thesis title: An Iot Enabled System for Marine Data Acquisition and Cartography Degree subject: Electronic Systems Engineering Degree type: Doctor of Philosophy Awarded date: 25/6/2018 Arief Setyanto Thesis title: Hierarchical Visual Content Modelling and Query Based on Trees Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 15/6/2016 Mohammed Abdulrahman M Alreshoodi Thesis title: Prediction of Quality of Experience for Video Streaming Using Raw Qos Parameters Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 6/5/2016 Kamaludin Bin Mohamad Yusof Thesis title: Short-Range Estimation Based on a Deep Fade Linearity Function Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 30/10/2014 Publications Journal articles (56) Walinjkar, A. and Woods, J., FHIR Tools for Healthcare Interoperability. Biomedical Journal of Scientific and Technical Research. 9 (5) Baker, B., Woods, J., Reed, M. and Afford, M., (2024). A Survey of Short-Range Wireless Communication for Ultra-Low-Power Embedded Systems. Journal of Low Power Electronics and Applications. 14 (2), 27-27 Swinney, CJ. and Woods, JC., (2022). A Review of Security Incidents and Defence Techniques Relating to the Malicious Use of Small Unmanned Aerial Systems. IEEE Aerospace and Electronic Systems Magazine. 37 (5), 14-28 Swinney, CJ. and Woods, JC., (2022). K-Means Clustering Approach to UAS Classification via Graphical Signal Representation of Radio Frequency Signals for Air Traffic Early Warning. IEEE Transactions on Intelligent Transportation Systems. 23 (12), 24957-24965 Swinney, C. and Woods, J., (2022). Low-Cost Raspberry-Pi-Based UAS Detection and Classification System Using Machine Learning. Aerospace. 9 (12), 738-738 Swinney, CJ. and Woods, JC., (2021). Unmanned Aerial Vehicle Operating Mode Classification Using Deep Residual Learning Feature Extraction. Aerospace. 8 (3), 79-79 Swinney, CJ. and Woods, JC., (2021). The Effect of Real-World Interference on CNN Feature Extraction and Machine Learning Classification of Unmanned Aerial Systems. Aerospace. 8 (7), 179-179 Walton, M. and Woods, J., (2020). Intelligent control of micro power – Immortal machine. Nano Energy. 72, 104699-104699 Makhura, OJ. and Woods, JC., (2019). Learn-select-track: An approach to multi-object tracking. Signal Processing: Image Communication. 74, 153-161 Al-Zaidi, R., Woods, JC., Al-Khalidi, M. and Hu, H., (2018). Building Novel VHF-based Wireless Sensor Networks for the Internet of Marine Things. IEEE Sensors Journal. 18 (5), 2131-2144 Thabet, T. and Woods, J., (2018). Using Input Impedance to Calculate the Efficiency Numerically of Series-Parallel Magnetic Resonant Wireless Power Transfer Systems. Advances in Science, Technology and Engineering Systems Journal. 3 (3), 38-42 Camp, EF., Dong, LF., Suggett, DJ., Smith, DJ., Boatman, TG., Crosswel, JR., Evenhuis, C., Scorfield, S., Walinjkar, A., Woods, J. and Lawson, T., (2017). A novel membrane inlet-infrared gas analysis (MI-IRGA) system for monitoring of seawater carbonate system. Limnology and Oceanography: Methods. 15 (1), 38-53 Adeyemi-Ejeye, AO., Alreshoodi, M., Al-Jobouri, L., Fleury, M. and Woods, J., (2017). Packet loss visibility across SD, HD, 3D, and UHD video streams. Journal of Visual Communication and Image Representation. 45, 95-106 Al-Zaidi, R., Woods, J., Al-Khalidi, M. and Hu, H., (2017). An IOT-enabled System for Marine Data Aquisition and Cartography. Transactions on Networks and Communications. 5 (1), 53-69 Palawan, A., Woods, JC. and Ghanbari, M., (2016). Continuity-Aware Scheduling Algorithm for Scalable Video Streaming. Computers. 5 (2), 11-11 M. Alreshoodi, A. O. Adeyemi-Ejeye, J. Woods and S. D. Walker, (2015). Fuzzy logic inference system-based hybrid quality prediction model for wireless 4kUHD H.265-coded video streaming. IET Networks. 4 (6), 296-303 M. Alreshoodi, E. Danish, J. Woods, A. Fernando and C. D. Alwis, (2015). Prediction of perceptual quality for mobile video using fuzzy inference systems. IEEE Transactions on Consumer Electronics. 61 (4), 546-554 Thabet, T. and Woods, JC., (2015). An Approach to Calculate the Efficiency for an N-Receiver Wireless Power Transfer System. International Journal of Advanced Computer Science and Applications. 6 (9) Abdul-Kader, SA. and Woods, JC., (2015). Survey on Chatbot Design Techniques in Speech Conversation Systems. International Journal of Advanced Computer Science and Applications. 6 (7) Mohsin, RJ., Woods, J. and Shawkat, MQ., (2015). (AMDC) Algorithm for wireless sensor networks in the marine environment. International Journal of Advanced Computer Science and Applications. 6 (6) Hernández Ochoa, M., Siller, M., Woods, J. and Duran-Limon, HA., (2014). A Performance Analysis Framework for WiFi/WiMAX Heterogeneous Metropolitan Networks Based on Cross-Layer Design. International Journal of Distributed Sensor Networks. 10 (3), 750971-750971 Qadri, MT., Woods, J., Tan, KT. and Ghanbari, M., (2013). Temporal masking in no reference mode using motion vectors analysis. ICIC Express Letters. 7 (11), 2913-2920 Woods, JC. and Alreshoodi, M., (2013). Survey on QoE/QoS correlation models for multimedia services. International Journal of Distributed and Parallel Systems. 4 (3), 53-72 Qadri, MT., Woods, J., Tan, KT. and Ghanbari, M., (2012). Importance of Frame Selection in Video Quality Assessment. International Journal of Engineering Research and Applications (IJERA). 2 (5), 14-17 Samanta, SK., Woods, J. and Ghanbari, M., (2011). Automatic Language Translation. International Journal of Technology and Human Interaction. 7 (1), 1-18 Samanta, SK., Pan, H., Woods, J. and Ghanbari, M., (2011). Internet pricing: a two sided market perspective. International Journal of Economics and Business Research. 3 (2), 225-225 S. Ghanbari, J. C. Woods and S. M. Lucas, (2010). Object-based semi-automatic tool for content retrieval. Electronics Letters. 46 (1), 44-46 Yusof, KM., Woods, J. ",
  "content_length": 34665,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:14"
}