{
  "name": "John G. Stell",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/258/dr-john-stell",
  "status": "success",
  "content": "Dr John Stell | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Dr John Stell Position: Senior Lecturer Areas of expertise: artificial intelligence; qualitative spatial reasoning; mereotopology; knowledge representation; logic; spatial representation in the digital humanities Email: J.G.Stell@leeds.ac.uk Phone: +44(0)113 343 1076 Location: 2.33 Bragg Building Profile I studied Mathematics and later Computer Science at the University of Manchester. I worked at Keele University both in Mathematics and in Computer Science. I came to Leeds in 2001 as a Lecturer and have been Senior Lecturer since 2003. While working at Leeds I studied Fine Art part time at Leeds College of Art, graduating with a first class degree in 2010. I have used this interdisciplinary background to combine research in Computer Science with work on spatial concepts in the digital humanities. Responsibilities Programme Director, Computer Science, SWJTU-Leeds Joint School Research interests My research interests lie in the area of qualitative spatial representation and reasoning.  Particular current concerns include models of spatial information at multiple levels of detail and discrete models of space. This involves the application to mathematical logic to the representation of spatial knowledge. I also work with in interdisciplinary collaborations to connect the use of spatial concepts in the digital humanities with approaches to space in computer science. I am a Turing Fellow (2021-22) and I am a member of two interest groups at the Alan Turing Institute: AI and Arts and Humanities and Data Science. In logic, a continuing programme of work uses bi-intuitionistic modal logic in the study of graphs at different levels of detail in knowledge representation. In 2019 the International Journal of Humanities and Arts Computing published a Special Section on Qualitative Spatial Representation containing reports from my AHRC Research Network on Space and Narrative in the Digital Humanities. This project (2018-2019) was in collaboration with Ian Gregory at Lancaster University. In the humanities spatial data is often fundamentally vague, uncertain, or metaphorical, but conventional Geographical Information Systems (GIS) are limited in their ability to repesent this type of data in ways that are useful for humanities scholars. The project investigated for the first time how qualitative spatial representation and other related methods can be used as novel ways of handling the kind of spatial data that is important in the humanities but which does not fit with existing GIS technology. I am currently working (2021-22) on an interdisciplinary  project funded by the Leeds Humanities Research Institute. This project, “Space on the Page”, explores spatial representation in the context of visual poetry and other kinds of text where spatial arrangement of words and letters is a key part of meaning. Qualifications BSc (Mathematics) Manchester BA (Fine Art) Leeds MSc (Computer Science) Manchester PhD (Computer Science) Manchester Student education My teaching has involved a wide variety of undergraduate Computer Science topics including Artificial Intelligence, Databases, Discrete Mathematics, and Logic Programming. I am currently Programme Director for the Computer Science Programme at the SWJTU-Leeds Joint School in Chendu, China. I am also involved in teaching on this programme and have delivered modules to students at the Joint School in China. Research groups and institutes Artificial Intelligence Current postgraduate researchers Ignacio Bellas Acosta Mathew Henrickson <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 4563,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:37"
}