{
  "name": "John C. S. Lui",
  "homepage": "http://www.cse.cuhk.edu.hk/~cslui",
  "status": "success",
  "content": "LUI, John Chi Shing (John C.S. Lui), CUHK CS Prof. John C.S. Lui Fellow of ACM, Fellow of IEEE, Croucher Senior Research Fellow, Fellow of the Hong Kong Academy of Engineering (HKAE), Choh-Ming Li Chair Professor of Computer Science and Engineering Affiliated member in the Information Engineering Department Department of Computer Science & Engineering The Chinese University of Hong Kong Shatin, N.T, Hong Kong Email: cslui at cse dot cuhk dot edu dot hk Office: HSH Bldg Room 111, phone: (852) 3943-8407 Fax: (852) 2603-5024 Biography: John C.S. Lui is currently the Choh-Ming Li Chair Professor in the Department of Computer Science & Engineering (CSE) at The Chinese University of Hong Kong (CUHK). He received his Ph.D. in Computer Science from UCLA. After his graduation, he joined the IBM Laboratory and participated in research and development projects on file systems and parallel I/O architectures. He later joined the CSE Department at CUHK. He has been a visiting professor in computer science departments at UCLA, Columbia University, University of Maryland at College Park, Purdue University, University of Massachusetts at Amherst and Universit degli Studi di Torino in Italy. Currently, he is leading a group of students and post-docs in the Advanced Networking and System Research Laboratory (ANSRLab). His current research interests are in online learning algorithms and applications (e.g., multi-armed bandits, reinforcement learning), quantum Internet, OS support on emerging applications, machine learning on network sciences and networking systems, large scale data analytics, network/system security, network economics, large scale storage systems and performance evaluation theory. John is an active consultant to industry, believing that it is an effective way to do technology transfer and a wonderful way to learn about real and relevant research problems. John is currrently the senior editor in the IEEE/ACM Transactions on Networking, and has been serving in the editorial board of ACM Transactions on Modeling and Performance Evaluation of Computing Systems , IEEE Transactions on Network Science & Engineering, IEEE Transactions on Mobile Computing, IEEE Transactions on Computers, IEEE Transactions on Parallel and Distributed Systems, Journal of Performance Evaluation, Journal of Network Science and International Journal of Network Security. He is a member of the review panel in the IEEE Koji Kobayashi Computers and Communications Award committee, and has served at the IEEE Fellow Review Committees. John has also been a reviewer and panel member for NSF, Canadian Research Council and the National Natural Science Foundation of China (NSFC). John served the Associate Dean of Research in the College of Engineering at CUHK (2014-2018) and the chairman of the CSE Department (and lessons learnt) from 2005-2011. He received various departmental teaching awards and the CUHK Vice-Chancellor's Exemplary Teaching Award. John also received the CUHK Faculty of Engineering Research Excellence Award (2011-2012). John is a co-recipient of the best paper award in the IFIP WG 7.3 Performance 2005, IEEE/IFIP NOMS 2006, SIMPLEX 2013, and ACM RecSys 2017. He is an elected member of the IFIP WG 7.3, Fellow of ACM, Fellow of IEEE, Senior Research Fellow of the Croucher Foundation, Fellow of the Hong Kong Academy of Engineering (HKAE), and was the past chair of the ACM SIGMETRICS (2011-2015). His personal interests include films and general reading. Research Interests: Quantum Internet, Online Machine Learning (e.g., multi-armed bandit, reinforcement learning, etc) and Statistical Machine Learning, Future Internet Architectures and Protocols, Network Science and Economics, Kernel Support for Large Scale AI Systems. We are now seeking good postdocs to join our dynamic group: Important information for potential post-doc We are now seeking Ph.D students to join our dynamic group: Important information for potential Ph.D students Recent Research Selected publications by topics. Selected publications. Partial search results from Google Scholar DBLP Best Paper Awards: Best Paper Runner-Up in the ACM SIGMETRICS, 2025. Beijing Science and Technology Award -- Second Prize for Natural Science, 2024. Best Paper Runner-Up in the IEEE Transactions on Mobile Computing (TMC), 2024. Best Paper Runner-Up in the 28th ACM Int. Conf. on Knowledge Discovery and Data Mining (KDD), '22. Best Paper in the 6th Int. Conf. on Big Data Computing and Communication, '20. One of the Top 3 Papers in IEEE INFOCOM'20. Best Paper Runner-Up in ACM Mobihoc'18. Best Paper Award in ACM Conference on Recommender Systems (RecSys), 2017. Best Paper and nominated for IEEE TKDE publication, IEEE ICDE'16. Best Paper Runner-Up in ASONAM'17. Top 9 papers in ACM KDD'14 (fast-track publication to ACM TKDD) Best Paper Award in SIMPLEX 2013 (Conjunction with WWW'13) Best Paper Award in IEEE/IFIP NOMS 2006. Best Paper Award in IFIP WG 7.3 Performance 2005. Professional Services Editorialship: Editor-in-Chief, Proc. of the ACM on Measurement and Analysis of Computing Systems (POMACS), 2024-2027. IEEE/ACM Trans. on Netowrking, senior editor (2016-now) IEEE Transactions on Network Science & Engineering (2017-now) ACM Transactions on Modeling and Performance Evaluation of Computing Systems (2014-now) IEEE Trans. on Mobile Computing, associate editor (2016-now) Performance Evaluation Journal, associate editor (2008-now) Journal of Network Science, associate editor (2011-now) Int. Journal of Network Security, associate editor (2010-now) IEEE/ACM Trans. on Netowrking, editor-at-large (2013-2015) IEEE/ACM Transactions on Networkings, associate editor (2007-2011) IEEE Trans. on Computers, associate editor (2007-2011) IEEE Trans. on Parallel and Distributed Systems, associate editor (2006-2010) Conference Chairs The 13th Workshop on the Economics of Networks, Systems and Computation (NetEcon), TPC Co-Chair, 2018. IFIP WG 7.3 Performance, TPC Co-Chair, 2018. Workshop of Machine Learning and AI for Networks (co-located with ICNP), TPC Co-Chair, 2017. ACM TURC 2017, TPC Co-Chair, 2017 IEEE ICNP 2016, General Co-Chair, 2016 IEEE INFOCOM, TPC Co-Chair, 2015. IEEE ICDCS, Network/Web/P2P Protocol & Applications, TPC Co-Chair, 2012. IEEE ICNP Conference, General Co-Chair, 2007. ACM SIGMETRICS Conference, TPC Co-Chair, 2005. Professional Societies: Steering committee member, IEEE Transactions on Network Science & Engineering ACM SIGMETRICS Chair, (2011-2015). ACM SIGMETRICS Vice-Chair, (2007-2011). ACM SIGMETRICS Board of Directors, (2005-2007). Conference (Organization or TPC) Interesting Personal Reminders The Paradoxical Commandments: Finding personal meaning in this crazy world Desiderata: Words for Life, by Max Enhrmann Adage from Arnold O. Beckman Advice on Research Computer science research, writing and speaking advice Wilson Hsieh's resources on academia Teaching Decision Analysis and Game Theory (CMSC5728) Fundamentals of Machine Learning (CSCI3320) Advanced Topics in Cloud Computing (CMSC5735) Advanced Topics in Internet Technology (CMSC5709) Introduction to Python (CSCI2040): 2-unit course Introduction to Network Science (CMSC5734) Hands-on Introduction to Python (CSCI1040): 1-unit course Hands-on Introduction to MATLAB (CSCI1050) Advanced Topics in Parallel / Distributed Systems (CMSC5702) Computer and Network Security (CMSC5726) Engineering Math III (ENGG2430) Probability Models and Applications (ERG2040c) Introduction to Operating Systems (CSC3150) Distributed Systems and Networks (CEG4430) Introduction to Social Networks (CSCI4190) Computer System Performance Evaluation (CSC5420) Distributed Multimedia and Networks (CSC5480) Advanced Topics in Network Analysis (CSC6480) Parallel and Distributed Computing (CSC4160) Digital Circuits (CENG3470) Advanced Topics in Internet Technology (CSC7221) Arts & Literature Corner Personal Leisure Reading Chinese Literature Web Museum On Line Library of Literature Public's Library and Digital Archive Photo Net Favorite Song My Way Jokes Collected items Released Software under GPL Reliable Multimedia Streaming Server (RMSS) (Server & Client Software Package for multimedia-on-demand system.) Reliable Multimedia Streaming Server PLUS (RMSS+) (Server & Client Software Package for Performing Dynamic Multicasting of Multimedia Contents.) Secure Multimedia Library (SML) (Library based on Asymmetric Parametric Sequence Method for Implementing Secure Multimedia Streaming Proxy.) Secure Group Communication Library (SEAL) (C language API which provides necessary software components for developers to write secure dynamic group-oriented applications without any centralized key server.) OPERA: an open-source extensible router architecture (A Linux-based package for implementing a software programmable router architecture with the aim to facilitate networking experiments for the research community. Using this architecture, one can dynamically load new extension and services into the programmable router. Some interesting extensions include QoS support and traceback of DDoS attacks.) DroidAnalytics: A Signature Based Analytic System to Collect, Extract, Analyze and Associate Android Malware (TrustCom, 2013) A signature based analytic system for Android Devices. The system can automatically collect, manage, analyze and extract android malware. DroidAnalytics facilitates analysts to retrieve, associate and reveal malicious logics at the opcode level. Released in May 2013. ADAM: An An Automatic and Extensible Platform to Stress Test Android Anti-Virus Systems (DIMVA 2012) Implementation of assessing the robustness of Android Anti-Virus Systems by generating various types of malware variants. Released in April 2012.",
  "content_length": 9731,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:30"
}