{
  "name": "John S. Baras",
  "homepage": "https://www.cs.umd.edu/people/baras",
  "status": "success",
  "content": "John Baras | UMD Department of Computer Science Skip to main content Explore People People FacultyFaculty Awards In Memoriam Staff Dept. PhonebookFaculty Staff Students As PDF University Directory Search People Overview Name Search by name Title Search by title Location Search by location Apply Reset John Baras Affiliate Professor Distinguished University Professor, Lockheed Martin Chair in Systems Engineering, Director HyNET, Founding Director, ISR Email: barasumd[.dot.]edu Phone: (301) 405-6606 Location: 2247 A.V. Williams Bldg. Website: http://dev-baras.pantheonsite.io/ Google Scholar: xuguQ60AAAAJ Education: B.S. National Technical University of Athens, Greece, Electrical Eng. M.S. Harvard University, Applied Mathematics Ph.D. Harvard University, Applied Mathematics Appointments: CS, ECE, ISR Biography John S. Baras received the B.S. in Electrical Engineering from the National Technical University of Athens, Greece, in 1970, and the M.S. and Ph.D. in Applied Mathematics from Harvard University in 1971 and 1973. Professor Baras was the Founding Director of the Institute for Systems Research (one of the first six NSF Engineering Research Centers) from 1985 to 1991.  Since August 1973 he has been with the Electrical and Computer Engineering Department (ECE), and the Applied Mathematics Faculty, at the University of Maryland, College Park, where he is currently a Distinguished University Professor holding a permanent joint appointment with ECE and ISR. In February 1990 he was appointed to the Lockheed Martin Chair in Systems Engineering.  Since 1992  Dr. Baras has been the Founding Director of the Maryland Hybrid Networks Center (HyNet) ) (an industry-university-government consortium, with substantial support from DoD, NASA and industry focusing on hybrid wireless networks). He was named a Distinguished University Professor by the University of Maryland in 2018. It is the highest honor bestowed by the university on its faculty. Among his awards are: a 1978 Naval Research Laboratory Research Publication Award; the 1980 Outstanding Paper Award of the IEEE Control Systems Society; 1983 and 1993 Alan Berman Research Publication Awards from NRL; 1991 Outstanding Invention of the Year Award from the University of Maryland for the invention of a “Low Complexity CELP Speech Coder”; 1994 Outstanding Invention of the Year Award from the University of Maryland for the invention of \"A System Design for a Hybrid Network Data Communications Terminal Using Asymmetric TCP/IP to Support Internet Applications\"; November 1995, Outstanding Contributions to Seniors Award, from the Vice President for Student Affairs and the Senior Council; January 1996, Outstanding Paper Award, \"ATM in Hybrid Networks\", presented at Design SuperCon 1996 Conference, Santa Clara, CA;  April 1996, MIPS Research Award of Excellence for Outstanding Contributions in Advancing Maryland Industry for work done with Hughes Network Systems; December 1998, the Mancur Olson Research Achievement Award, from the Univ. of Maryland College Park (award recognizes faculty whose research achievements have been extraordinary); December 2002, Best paper Award at the 23rd Army Science Conference, Orlando, Florida; September 2004, Best paper Award 2004 Wireless Security conference. Dr. Baras is a Fellow of IEEE, SIAM, AAAS, the National Academy of Inventors, IFAC and AMS. He was elected Foreign Member of the Royal Swedish Academy of Engineering Sciences, March 2006. He has consulted extensively with industry and government on various automation, systems and telecommunication problems. He has served in the following: Board of Governors of the IEEE Control Systems Society; IEEE Engineering R&D Committee; Aerospace Industries Association advisory committee on advanced sensors; IEEE Fellow evaluation committee. He is currently serving on the editorial board of Mathematics of Control, Signals, and Systems, the editorial board of Systems and Control: Foundations and Applications, the editorial board of IMA J. of Mathematical Control and Information, the editorial board of Systems Automation-Research and Applications. Dr. Baras is a world renowned researcher in communication and automation systems, has received many awards for his papers and research, has more than 450 technical papers published and was the editor of the book “Recent Advances in Stochastic Calculus”, Springer, 1990. He holds three patents (all in signal processing) and has four pending. He has graduated 42 PhD students and 70 MS students. He has sponsored and supervised 32 postdoctoral scholars. Dr. Baras is internationally known for his leadership of industry-university-government consortia and has collaborated effectively with both industry and government scientists and engineers. Professor Baras' research interests include: wireless networks, sensor networks, distributed networked control systems, satellite and hybrid communication networks, integrated network management systems, fast Internet services via hybrid, satellite and wireless networks, network security and intrusion detection, stochastic systems, robust control of nonlinear systems, real-time parallel architectures for nonlinear signal processing, intelligent control systems, expert and symbolic systems for control and communication systems synthesis, distributed parameter systems, planning and optimization, real-time architectures for intelligent control, speech and image compression and understanding, biomimetic algorithms and systems for signal processing and sensor networks, model-based systems engineering, model-based software engineering, integration of logic programming and nonlinear programming for trade-off analysis, object oriented modeling of complex engineering systems, validation and verification of systems models and designs, intelligent manufacturing of smart materials, integrated product-process design. He is widely credited for inventing and establishing Internet over satellite and hybrid networks and for initiating the new “component based” approach to wireless network modeling and design. He has more than 30 years experience and contributions to defense related problems. Professor Baras was the initial principal architect of the ISR M.S. program in Systems Engineering. He arranged for industry participation in advisory and teaching capacity. More recently Dr. Baras has been heavily involved in the development of new core courses for systems engineering. These include courses on systems modeling, systems engineering fundamentals, system requirements analysis, system trade-off analysis and tools, system validation-verification and testing and systems integration. In his efforts to teach systems thinking at the undergraduate level to all Engineering majors he is developing three courses, with the objective to introduce in the foundational core for engineering education the key concepts of system models, controls and signals in a way that integrates computer related ideas and constructs into these foundations from the start. His efforts address the often emphasized need for a new integrative approach to engineering (holistic rather than in parts) which in turn addresses the needs for modular design, systems thinking and team work.",
  "content_length": 7244,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:07"
}