{
  "name": "John Regehr",
  "homepage": "http://www.cs.utah.edu/~regehr",
  "status": "success",
  "content": "John Regehr's Home Page John Regehr Professor School of Computing University of Utah Intro Links Teaching Papers Contact Computers are amazingly fun and useful, but why do they crash and hang? Why are they so terrifyingly insecure? The problem is many-faceted, but an important aspect is that people who develop software must consider a huge number of possible executions of their code, and the human mind doesn't turn out to be all that good at this. Even a single execution of a medium-sized piece of software can be mind-numbingly complex, requiring many hours before an expert can understand what is going on. The part of the solution to the software problem that I am most interested in is using software tools to make it easier to develop correct and efficient software. Basically, we can create programs to show us possibilities inherent in our software -- such as crashes -- that we did not know about, or better yet create programs to verify that such possibilities do not exist. Similarly, good abstractions such as high-level programming languages make it easier to express our intent, and then we can offload to software tools the problem of making programs run quickly. The software tool developed by my group that I am most proud of is Csmith, which generates random C programs; here is a fragment of one. Although it sounds easy to generate random code, it is not: C has hundreds of rules that must be followed, and violating any one of them renders the randomly generated code useless. Over several years we used Csmith to find serious bugs in every compiler that we tested, including those that are used to compile safety-critical avionics software. The worst kind of compiler bug, and the kind we specialized in finding, causes the compiler to silently generate incorrect executable code. We found so many bugs (around 500) that we had to write a new tool, C-Reduce, to take large programs that trigger compiler bugs and reduce them to tiny programs that people can understand. Since Csmith is open source software, everyone is free to use it. One time Csmith received a Christmas card from a development team at a compiler company! (Top) See my: Github page, where my group's recent software lives, including: Souper, a synthesis-based superoptimizer for LLVM; C-Reduce, a test-case reducer for C, C++, and OpenCL; and, Csmith, a random C program generator that helped us discover and report hundreds of bugs in production-quality compilers. Blog, where I post mostly-technical content that doesn't seem to belong in peer-reviewed publications. I've found that people are a lot more likely to read a blog post than a paper! Google Scholar and DBLP pages. CV. Personal web page. (Top) Recent Teaching CS 4000, Senior Capstone Project, Fall 2025 CS 4400, Computer Systems, Spring 2025 CS 6475, Advanced Compilers, Fall 2024 CS 1810, Intro to Computing Systems, Spring 2024 CS 4500, Senior Capstone Project, Fall 2023 CS 4500, Senior Capstone Project, Spring 2022 CS 6465, Advanced Operating Systems, Fall 2021 CS 4470, Intro to Compilers, Spring 2021 (Top) Papers Nice to Meet You: Synthesizing Practical MLIR Abstract Transformers. Xuanyu Peng, Dominic Kennedy, Yuyou Fan, Ben Greenman, John Regehr, Loris D'Antoni. In 53rd ACM SIGPLAN Symposium on Principles of Programming Languages (POPL 2026), January 2026. Translation Validation for LLVM's AArch64 Backend. Ryan Berger, Mitch Briles, Nader Boushehrinedaj, Nicholas Coughlin, Kait Lam, Nuno P. Lopes, Stefan Mada, Tanmay Tirpankar, and John Regehr. In Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA), October 2025. First-Class Verification Dialects for MLIR. Mathieu Fehr, Yuyou Fan, Hugo Pompougnac, John Regehr, and Tobias Grosser. In Proceedings of the ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2025), June 2025. Minotaur: A SIMD-Oriented Synthesizing Superoptimizer. Zhengyang Liu, Stefan Mada, and John Regehr. In Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA), October 2024. Hydra: Generalizing Peephole Optimizations with Program Synthesis. Manasij Mukherjee and John Regehr. In Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA), October 2024. High-Throughput, Formal-Methods-Assisted Fuzzing for LLVM. Yuyou Fan and John Regehr. In Proceedings of the International Symposium on Code Generation and Optimization (CGO), March 2024. Fuzzing Loop Optimizations in Compilers for C++ and Data-Parallel Languages. Vsevolod Livinskii, Dmitry Babokin, and John Regehr. In Proceedings of the ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2023), June 2023. Alive2: Bounded Translation Validation for LLVM. Nuno P. Lopes, Juneyoung Lee, Chung-Kil Hur, Zhengyang Liu, and John Regehr. In Proceedings of the ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2021), June 2021. Dataflow-based Pruning for Speeding up Superoptimization. Manasij Mukherjee, Pranav Kant, Zhengyang Liu, John Regehr. In Proceedings of the Conference on Object-Oriented Programming Systems, Languages, and Applications (OOPSLA) 2020, November 2020. Random Testing for C and C++ Compilers with YARPGen. Vsevolod Livinskii, Dmitry Babokin, and John Regehr. In Proceedings of the Conference on Object-Oriented Programming Systems, Languages, and Applications (OOPSLA) 2020, November 2020. Testing Static Analyses for Precision and Soundness. Jubi Taneja, Zhengyang Liu, and John Regehr. In Proceedings of the International Symposium on Code Generation and Optimization (CGO) 2020, San Diego, CA, USA, February 2020. Future Directions for Optimizing Compilers. Nuno P. Lopes and John Regehr. Reconciling High-level Optimizations and Low-level Code in LLVM. Juneyoung Lee, Chung-Kil Hur, Ralf Jung, Zhengyang Liu, John Regehr, and Nuno P. Lopes. In OOPSLA 2018. (Supplementary material.) Practical Verification of Peephole Optimizations with Alive. Nuno Lopes, David Menendez, Santosh Nagarakatte, and John Regehr. Communications of the ACM. Volume 61 Issue 2, February 2018. Souper: A Synthesizing Superoptimizer. Raimondas Sasnauskas, Yang Chen, Peter Collingbourne, Jeroen Ketema, Gratian Lup, Jubi Taneja, John Regehr. arXiv paper. Revised April 2018. Research for practice: vigorous public debates in academic computer science. John Regehr. Communications of the ACM. Volume 60 Issue 12, December 2017. Taming Undefined Behavior in LLVM. Juneyoung Lee, Yoonseung Kim, Youngju Song, Chung-Kil Hur, Sanjoy Das, David Majnemer, John Regehr, and Nuno P. Lopes. In Proceedings of 38th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2017), Barcelona, Spain, June 2017. Abstractions for Practical Virtual Machine Replay. Anton Burtsev, David Johnson, Mike Hibler, Eric Eide, and John Regehr. In Proceedings of the 12th International Conference on Virtual Execution Environments (VEE'16), Atlanta, GA, USA, April 2016. Cause reduction: delta debugging, even without bugs. Alex Groce, Mohammad Amin Alipour, Chaoqiang Zhang, Yang Chen, and John Regehr. In Software Testing, Verification and Reliability, Volume 26 Issue 1, January 2016. Understanding Integer Overflow in C/C++. Will Dietz, Peng Li, John Regehr, and Vikram Adve. ACM Transactions on Software Engineering and Methodology (TOSEM), Volume 25, Issue 1, November 2015. (ACM link.) This is an updated and expanded version of our ICSE 2012 paper. Deniable Backdoors Using Compiler Bugs. Scotty Bauer, Pascal Cuoq, and John Regehr. International Journal of PoC||GTFO 0x08, June 2015. Provably Correct Peephole Optimizations with Alive. Nuno Lopes, David Menendez, Santosh Nagarakatte, and John Regehr. In Proceedings of 36th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2015), Portland, OR, USA, June 2015. This paper won a Distinguished Paper Award. Intent fuzzer: crafting intents of death. Raimondas Sasnauskas and John Regehr. In Proceedings of the 2014 Joint International Workshop on Dynamic Analysis (WODA) and Software and System Performance Testing, Debugging, and Analytics (PERTEA). San Jose, CA, USA, July 2014. Cause Reduction for Quick Testing. Alex Groce, Amin Alipour, Chaoqiang Zhang, Yang Chen, and John Regehr. In IEEE International Conference on Software Testing, Verification and Validation (ICST), Cleveland, Ohio, March-April 2014. (ICST 2014 Best Paper Award) Help, help, I'm being suppressed! The significance of suppressors in software testing. Alex Groce, Chaoqiang Zhang, Mohammad Amin Alipour, Eric Eide, Yang Chen, John Regehr. In Proceedings of the 24th International Symposium on Software Reliability Engineering (ISSRE), Pasadena, CA, USA, November 2013. Taming Compiler Fuzzers. Yang Chen, Alex Groce, Chaoqiang Zhang, Weng-Keen Wong, Xiaoli Fern, Eric Eide, and John Regehr. In Proceedings of 34th ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2013), Seattle, WA, USA, June 2013. Swarm Testing. Alex Groce, Chaoqiang Zhang, Eric Eide, Yang Chen, and John Regehr. In Proceedings of the International Symposium on Software Testing and Analysis (ISSTA 2012), Minneapolis, MN, USA, July 2012. Test-Case Reduction for C Compiler Bugs. John Regehr, Yang Chen, Pascal Cuoq, Eric Eide, Chucky Ellison, and Xuejun Yang. In Proceedings of 33rd ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI 2012), Beijing, China, June 2012. Understanding Integer Overflow in C/C++. Will Dietz, Peng Li, John Regehr, and Vikram Adve. In Proceedings of the 34th International Conference on Software Engineering (ICSE 2012). Zurich, Switzerland, June 2012. (ACM SIGSOFT Distinguished Paper Award) Testing static analyzers with randomly generated programs. Pascal Cuoq, Benjamin Monate, Anne Pacalet, Virgile Prevosto, John Regehr, Boris Yakobowski, and Xuejun Yang. Short paper in Proceedings of the 4th NASA Formal Methods Symposium (NFM 2012). Norfolk, Virginia, USA, April 2012. Advanced A",
  "content_length": 21050,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:06"
}