{
  "name": "John Jose",
  "homepage": "https://www.iitg.ernet.in/johnjose",
  "status": "success",
  "content": "John Jose JOHN JOSE Associate Professor Department of Computer Science & Engineering Indian Institute of Technology Guwahati Guwahati - 781039, Assam, India Contact Details Office: Room Number H-201, CSE Dept, IITG Phone: 0361- 2583256 Email: johnjose [AT] iitg [DOT] ac [DOT] in Home | News & Updates | Research | Courses | Students | MARS Lab Video || * Short CV * || * DBLP * || * Google Scholar * || * Scopus Author Profile * || * IRINS Faculty Profile * || News & Updates [Last updated on 01.02.2025]    || Skip News || 29.01.2025: Amit Puri defended his Ph D. thesis. Congratulations Dr. Amit. 29.01.2025: Sivakumar S. defended his Ph D. thesis. Congratulations Dr. Sivakumar. 28.01.2025: Syam Sankar defended his Ph D. thesis. Congratulations Dr. Syam. 15.01.2025: ISEA FDP on 5G-V2X and Network Security, 24-27, Feb.2025. [Application deadline: 09.02.2025]. 16.12.2024: John Jose took charge as Head, Center For Career Development, IIT Guwahati. 10.12.2024: Skill Enhancement Workshop in Teaching and Research, 28.02.25 - 01.03.25. 26.10.2024: John Jose is inducted as a core member in VLSI Society of India, North East chapter. 22.10.2024: Submissions by Sivakumar S. and Syam Sankar accepted for presentation in SRF track of VLSI Design 2025. 13.09.2024: Manju R. defended her Ph D. thesis. Congratulations Dr. Manju. 22.08.2024: Amit Puri submitted his Ph.D thesis. 22.08.2024: Sivakumar S. submitted his Ph.D thesis. 01.18.2024: John Jose is serving as the Student Research Forum Chair of VLSI Design 2025. 18.07.2024: Syam Sankar submitted his Ph.D thesis. 15.07.2024: Syam Sankar rejoined NSSCE Palakkad after his Ph.D leave under QIP scheme. 13.05.2024: Amit Puri joined AMD Bangalore as Senior Silicon Design Engineer. 01.06.2024: Paper by Manju et al. accepted for publication in IEEE COINS 2024. 01.06.2024: John Jose joined as Co-PI in ISEA Phase-3 for the thematic cluster Security in Distributed Wireless Networks. 01.05.2024: Phrangboklang Lyngton Thangkhiew joined as Assistant Professor at CSE department, IIT Guwahati. 24.04.2024: Manju R. submitted her Ph.D thesis. 04.04.2024: Paper by Sivakumar et al. accepted for publication in ACM TODAES. 01.04.2024: John Jose is nominated as Local Organizing Chair of IEEE ANTS 2024. 30.03.2024: Paper by Amit Puri et al. accepted for publication in 38th ACM SIGSIM-PADS 2024. 23.02.2024: Amit Puri received an offer from AMD Bangalore as Senior Silicon Design Engineer. 11.02.2024: John Jose received the COMSYS Young Achiever Award. 01.02.2024: John Jose is organizing INAE-SERB Pedagogy workshop on Teaching and Research during 15-16 March, 2024. 04.02.2024: John Jose is re-appointed as the Vice Chair-Industry Academia Collaboration of IEEE India Council for the year 2024. 13.01.2024: Paper by Rose Kunthara et al. accepted in World Scientific Journal of Circuits, Systems & Computers 12.01.2024: Work submitted by Syam Sankar accepted in Ph.D Forum of DATE 2024 Valencia, Spain. For more News and Updates Click Here. Dr. John Jose works in the domain of multicore computer architecture. His research group in Multicore ARchitecture and Systems (MARS) Lab explore various cutting edge research problems in the following domain. An overview of MARS lab, its members and research works are briefed here. For more details about ongoing research click here. Network on Chip (NoC) and Cache Optimisation in Tiled Chip Multi-Processors (TCMP) Wireless On Chip Interconnects and Edge/Fog Computing Machine Learning based Domain Specific Accelerators for NoCs Non-Volatile Memory (NVM) Technology Secure System on Chip Design Techniques Disaggregated Memory Management in Data Center Architectures Academic Profile Ph.D Indian Institute of Technology Madras, Chennai, Tamil Nadu 2009-2014 M.Tech Vellore Institute of Technology, Vellore, Tamil Nadu 2004-2006 B.Tech College of Engineering Adoor, Cochin University, Kerala 1999-2003 Professional Experience Associate Professor, CSE Department, IIT Guwahati, Guwahati. October 2021 till date Assistant Professor, CSE Department, IIT Guwahati, Guwahati. July 2015 to October 2021 Assistant Professor, Rajagiri School of Engineering & Technology, Cochin. July 2013 to June 2015 Teaching & Research Assistant, CSE Department, IIT Madras, Chennai. January 2009 to June 2013 Assistant Professor, Viswajyothi College of Engineering and Technology, Muvattupuzha. June 2003 to December 2008",
  "content_length": 4394,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:45"
}