{
  "name": "John Murray-Bruce",
  "homepage": "https://www.cse.usf.edu/~murraybruce",
  "status": "success",
  "content": "ISCI Lab ISCI Lab. Our research focuses on two core areas: computational imaging and information science. In particular, our key goal is to conceive of next-generation imaging systems that optimally combine advances in hardware and software. Our approach is to exploit insights gained through fundamental characterizations of the amount of information captured by (or flowing through) such systems. The ISCI Lab is led by: John Murray-Bruce Research highlight NLOS imaging with ordinary cameras. This research explores how subtle variations of penumbrae in a single, brief snapshot of a diffuse surface obtained using a consumer digital camera can enable imaging of non-line-of-sight scenes. learn more Lab news Manuscript published in Nature Communications February 2024 Robinson 's work that creatively turns regular door frames into carmeras for NLOS imaging appeared in Nature communications . Excellent work, Robinson! Two Manuscripts Accepted to ICASSP 2024 in Seoul December 2023 Raji and Robinson each had a manuscript accepted to IEEE Int. Conf. on Acoustics, Speech, and Signal Processing (ICASSP) 2024. They'll be presenting their work in Seoul, South Korea. Congrats to them both. Keval joins ISCI Lab September 2023 Keval Kataria , recent USF math graduate joins ISCI group. Keval also received the University Graduate Research Fellowship. Welcome and congratulations to Keval. Press We were on TV February/March 2024 We were in the local Tampa bay broadcast news for our work on exploiting doorways for 3D imaging without line of sight. Robinson is famous! Watch the coverages by: Fox 13 10 Tampa Bay Bay News 9 ABC Action News Online press coverage February/March 2024 Several online news outlets covered our work. Read more about the work in these articles: Current teaching Computational methods for imaging and vision Spring 2024 Time: 3:30 PM - 4:45 PMLecture location: BEH 103Office hours: 2:00 PM - 3:30 PMOffice location: ENG 117A Prior teaching Fall of 2023, 2022, 2021, 2020 CIS 4250: Ethical issues and professional conduct for computer scientists. Spring of 2023, 2022, 2021, 2020 CIS 6930 & CIS 4930: Computational methods for imaging and vision. This site was created with the Nicepage",
  "content_length": 2213,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:00"
}