{
  "name": "John T. Stasko",
  "homepage": "http://www.cc.gatech.edu/~john.stasko",
  "status": "success",
  "content": "John T. Stasko Home Page Georgia Tech College of Computing School of Interactive Computing GT Vis Lab Information Interfaces Group John T. Stasko Professor Emeritus School of Interactive Computing Georgia Institute of Technology 85 5th St., NW Technology Square Research Building Atlanta, GA 30332-0760 Office: Technology Square Research Building, Room 355 (404) 894-5617 Directions to John's office Lab: Technology Square Research Building, Room 334 Fax: (404) 894-3146 Email: staskoccgatechedu URL: https://faculty.cc.gatech.edu/~stasko Weekly Schedule Curriculum vita (updated Aug '25) Google Scholar (h-index: 78) Publications Recent talks As I See It blog My non-CS blog @johntstasko Some pictures of John Background John is a Professor Emeritus in the School of Interactive Computing (IC) in the College of Computing at Georgia Tech. He retired as a Regents Professor in the summer of 2025 after 36 years on the Georgia Tech faculty. John joined GT in 1989 after receiving Sc.M. and Ph.D. degrees in Computer Science from Brown University in Providence, Rhode Island (1985 and 1989) and a B.S. degree in Mathematics from Bucknell University in Lewisburg, Pennsylvania (1983). From 2021-2022, John also served as the Interim School Chair of Interactive Computing. John was additionally an Adjunct Faculty member of the School of Computing Instruction at GT, as he regularly taught one of the large CS intro courses. In 2013, John was named an Honorary Professor in the School of Computer Science at the University of St. Andrews in Scotland. Upon his retirement in September 2025, the School of Interactive Computing held a reception for John and announced the creation of the new John Stasko Award for Teaching Excellence created in his honor. John's primary research areas are data and information visualization, approaching each from a human-computer interaction perspective. In 2013, he served as General Chair of the IEEE VIS conference, the flagship academic conference for his research area, when it was held in Atlanta. John was inducted into the ACM CHI Academy in 2016 and the IEEE VIS Academy in 2019, and he was named an IEEE Fellow in 2014 and an ACM Fellow in 2022. In 2012, John received the IEEE VGTC Visualization Technical Achievement Award, and in 2023 he received the IEEE VGTC Visualization Lifetime Achievment Award. On the instructional side, John has twice received the College of Computing's annual gus baird Teaching Award. Research John is Director of the Information Interfaces Research Group whose mission is to help people take advantage of information to enrich their lives. As the amount of data available to people and organizations has skyrocketed over the past 10-20 years, largely fueled by the growth of the internet, insufficient methods for people to benefit from this flood of data have been developed. A central focus of many of the group's projects is the creation of information visualization and visual analytics tools to help people explore, analyze, understand, and communicate data sets. In particular, they are creating visual analytics systems to help people with \"sense-making\" activities on data sets such as large document collections. The group also has developed many techniques and systems for providing people with peripheral awareness of useful information. John's passion about research in, and the value of, data visualization is illustrated in his EuroVis 2014 Conference Capstone invited lecture. He describes his more recent research on designing flexible and natural interfaces for human-data interaction in this 2022 CSIG-VIS lecture. Students Current PhD Alex Bendeck Completed PhD Yu Fu, 2025, Assistant Professor at Univ. of Central Florida Hayeong Song, 2024, Research Scientist at Western Digital Po Ming \"Terrance\" Law, 2021, Research Scientist at Epsilon, (co-advisor with A. Endert) John Thompson, 2020, Research Scientist with AutoDesk Arjun Srinivasan, 2020, Research Scientist at Tableau Research Alex Godwin, 2018, Assistant Professor at American Univ. Mengdie Hu, 2018, Research Scientist at Facebook Ramik Sadana, 2017, Senior Engineer at Uber Yi Han, 2016, Assistant Professor at National Sun Yat-sen University, (co-advisor with G. Abowd) Chad Stolper, 2016, Software Engineer at Google, (co-advisor with P. Chau) Youn ah Kang, 2012, Associate Professor at Yonsei University Zhicheng Liu, 2012, Assistant Professor at Univ. of Maryland Chris Plaue, 2009, Senior Lecturer and Undergraduate Coordinator at Clemson Univ. James Eagan, 2008, Associate Professor at Telecom-ParisTech Ji Soo Yi, 2008, Vice President at Samsung Jun Xiao, 2006, CEO and Founder, Immune Arch Duke Hutchings, 2006, Professor & Dept. Chair at Elon University Alex Zhao 2001, Senior Software Engineer at Google Scott McCrickard, 2000, Assoc. Professor at Virginia Tech Brad Topol, 1998, IBM Distinguished Engineer, (co-advisor with M. Ahamad) Dean Jerding, 1997, VP at Cognizant Softvision Eileen Kraemer, 1995, Professor & Former Director, School of Computing at Clemson Univ. Keith Edwards, 1995, Professor at Georgia Tech Mariano Garcia, 1993, UPR-Cayey, (co-advisor with A. Badre) Service Overall Papers Co-Chair, IEEE VIS 2023 Co-organizer, AVI 2018 Workshop on Multimodal Interaction for Data Visualization Papers Co-Chair, 2016 IEEE VAST General Chair, IEEE VIS 2013 Co-Organizer, VIS 2013 Workshop on Sports Data Visualization Co-Organizer, VIS 2013 Workshop on Public Health's Wicked Problems: Can InfoVis Save Lives? Co-Organizer, VisWeek 2012 2nd Workshop on Interactive Visual Text Analytics Judge, TeamRanking.com's Stat Geek Idol Co-Organizer, AVI 2012 Workshop on Supporting Asynchronous Collaboration in Visual Analytics Systems Papers Co-Chair, 2009 IEEE VAST General Chair, 2007 IEEE InfoVis Papers Co-Chair, 2006 IEEE Symposium on Information Visualization Papers Co-Chair, 2005 IEEE Symposium on Information Visualization Co-Organizer, CHI 2005 Workshop on Distributed Display Environments Program Chair, 2003 ACM Symposium on Software Visualization Co-Organizer, CHI 2003 Workshop on Providing Elegant Peripheral Awareness Steering Committee, IEEE Visual Analytics Science and Technology (VAST) Conference, 2015-2020 At Large Member, IEEE Visualization and Graphics Technical Committee (VGTC) Executive Committee, IEEE VisWeek, 2009-2012 Steering Committee, IEEE Information Visualization (InfoVis) Conference, 2006-2012 Steering Committee, ACM Symposium on Software Visualization (SoftVis), 2003-2012 Associate Editor, IEEE Transactions on Visualization and Computer Graphics (TVCG), 2004-2008, 2017-2021 Associate Editor, Information Visualization (IV), 2001-present Associate Editor, ACM Transactions on Computer-Human Interaction (ToCHI), 2006-2013 Associate Editor, Journal of Visual Languages and Computing (JVLC), 1994-2015 Teaching Past courses CS 1331--Introduction to Object-Oriented Programming (Spring '25) CS 3158--Design and Analysis of Algorithms (Fall '98) CS 4460--Intro. to Information Visualization (Fall '17) CS 4801 SA--Sports Analytics (Spring '12) CS 6452--Prototyping Interactive Systems(Fall '16) CS 6730--Data Visualization: Principles & Applications (Fall '24) CS/PSY 6750--Human-Computer Interaction (Spring '07) CS 7390--Software Visualization (Spring '98) CS 7450--Information Visualization (Spring '23) CS 8001 VDE--Visualization Design Seminar (Spring '16) Personal In his free time, Prof. Stasko enjoys doing some vacation travel with his wife Christy, bugging his kids Tommy, Mitchell and Audrey, playing golf, gardening around his yard, tending to his fish pond, and cheering on Atlanta United FC, the Atlanta Braves, Falcons, and Hawks. My second home. Fun stuff - Browse only if you have a sense of humor. The current date and time. Zip code decoder. Questions or Comments? Visit our GVU FAQ and Feedback Pages. Last Modified on .",
  "content_length": 7844,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:18"
}