{
  "name": "John Sampson",
  "homepage": "http://www.cse.psu.edu/~jms1257",
  "status": "success",
  "content": "John (Jack) Morgan Sampson John (Jack) Sampson Associate Professor Contact information: Email - jms1257 [at] psu.edu Office - W324 Westgate Building University Park, PA 16802 Phone - Ext. 57496 CSE Department, School of EECS, College of Engineering, PSU Home Status: (Last Updated SP 2023) Associate Professor at Penn State since July, 2019 Assistant Professor at Penn State August, 2013 - June, 2019 Office Hours for SP 2023: Tu/Th 10:45-noon µBio: PhD, Computer Science (Computer Engineering) UCSD, 2010; BS, EECS, UC Berkeley, 2002 Artifacts and Notables Summary: Cites: 4040; H-index: 31 (via Google Scholar @ Feb 6th, 2023) Conference Proceedings (DBLP count): 77 - DBLP link Journals and other Periodicals (DBLP count): 26 - DBLP Link Awards and Honors NAS 2021 Best Architecture Track Paper: Govindaraj, et al. \"PowerPrep: A power management proposal for user-facing datacenter workloads\" [C73] ASP-DAC 2017 Best Paper: Ma, et al. \"Spendthrift: Machine Learning Based Resource and Frequency Scaling for Ambient Energy Harvesting Nonvolatile Processors\" [C47] IEEE TMSCS 2017 Best Paper: Tsai, et al. \"Enabling New Computation Paradigms with HyperFET - an Emerging Device\" [J6] IEEE Micro Magazine Top Picks from the 2015 Computer Architecture Conferences: Ma, et al. \"Nonvolatile Processor Architectures: Efficient, Reliable Progress with Unstable Power\" [J8] HPCA 2015 Best Paper: Ma, et al. \"Architecture Exploration for Ambient Energy Harvesting Nonvolatile Processors\" [C28] Dorothy Quiggle Faculty Development Assistant Professorship: 2013-2016 Currently (SP/23) teaching: CMPEN 431 (Undergraduate Computer Architecture) Active research keywords: Computer Architecture, Emerging Devices, Energy-efficiency, Memory Specialization, Non-Volatile Processors, Event-based sparse computations, Post-Dennard Architectures News General/Random Links October, 2022 Our paper, An architecture interface and offload model for low-overhead, near-data, distributed accelerators, was presented at MICRO 2022. @Penn State NSF Expeditions in Computing: Visual Cortex on Silicon High Performance Computing Lab @ PSU Microsystems Design Lab @ PSU General WikiCFP: Computer Architecture ETC ISCA \"Hall of Fame\" MICRO \"Hall of Fame\"",
  "content_length": 2223,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:12"
}