{
  "name": "John K. Antonio",
  "homepage": "https://www.ou.edu/coe/cs/people/faculty/john-antonio",
  "status": "success",
  "content": "John Antonio OU Homepage Search OU The University of Oklahoma Skip Navigation John Antonio John Antonio Dean, Mewbourne College of Earth and Energy and Lester A. Day Family Chair Email: antonio@ou.edu Phone: (405) 325-3821 Office: Sarkeys Energy Center Room 1510 Curriculum Vitae (PDF) Education Ph.D., Electrical Engineering Texas A&M University M.S., Electrical Engineering Texas A&M University B.S., Electrical Engineering Texas A&M University Research Focus Distributed, high-performance, and cloud computing; optimal scheduling and control of large-scale production computing data centers; low-power embedded processing; reconfigurable computing. Experience and Awards Senior Associate Vice President for Research and Partnerships, University of Oklahoma Senior Associate Dean, Howard & Suzanne Kauffmann Chair in Engineering, University of Oklahoma Director and David W. Franke Professor, University of Oklahoma Associate Professor, Texas Tech University Assistant Professor, Purdue University Senior Member of IEEE; Member of ACM; Member of European Academy of Sciences. Dedicated Service Awards from Texas Tech University and the University of Oklahoma; Lockheed Martin Award for Excellence in Engineering Teaching, Halliburton Award for Excellence, Texas Tech University; Ruth and Joel Spira Outstanding Teacher Award, Purdue University Biography Dr. John Antonio assumed the role of Senior Associate Vice President for Research and Partnerships at OU. In this position, he provides leadership in the development and implementation of the OU Norman Research Strategic Framework and Plan. John remains a valued member of the GCoE faculty as a professor of computer science and a strong partner in the development and implementation of our research strategy. Dr. Antonio was Senior Associate Dean and held the Howard & Suzanne Kauffmann Chair in the Gallogly College of Engineering at the University of Oklahoma.  As Senior Associate Dean, Dr. Antonio oversaw the College’s research portfolio, graduate programs, and faculty development. He provided leadership in identifying and developing strategic opportunities for faculty and students in the realm of high-impact research and development. Dr. Antonio received his PhD in electrical engineering from Texas A&M University in 1989. He was a faculty member at Purdue University and Texas Tech before joining OU as professor and director of computer science in 1999.  During seven years of service as CS director, John oversaw a 50% growth in the number computer science faculty members and a tripling of the school’s research expenditures.  John has been an investigator for a number of funded research projects.  Defense agencies supporting this work include Rome Laboratory (Air Force Research Laboratory), NRaD (Navy Research and Development), DoD/STTR, and DARPA.  This body of work included a major project funded by DARPA for the design and development of an ultra-low power parallel computing platform, housed on a small unmanned aerial vehicle, for real-time synthetic aperture radar processing.  During the period 2008 to 2011, John received grants from RiskMetrics Group, Inc. This work included research and development of scheduling and control mechanisms for a massively distributed computing platform.  From 2011 to 2013, John worked for MSCI, Inc. where he led a global team chartered with optimizing the performance and stability of the company’s massively parallel production computing platform. Selected Projects State of Oklahoma, Department of Education; “Central Oklahoma Rural Partnership for Science (CORPS),” Feb. 23, 2016 to Feb 23, 2017, $550,000. U. S. Department of Defense; Defense Intelligence Agency, Subaward through OU Health Sciences Center; “Center for Intelligence and National Security,” Sep. 15, 2014 to Sep. 14, 2019, $330,509. RiskMetrics Group; “Performance Analysis of Distributed Service-Oriented Architectures, Phase 3,\" Jan 2010-Dec 2010. Selected Publications Khondker S. Hasan, John K. Antonio, and Sridhar Radhakrishnan, “A Model-driven Approach for Predicting and Analysing the Execution Efficiency of Multi-core Processing,” International Journal of Computational Science and Engineering (IJCSE), Vol. 14, no. 2, 2017, pp. 105-125. Khondker S. Hasan, John K. Antonio, and Sridhar Radhakrishnan, “A New Multi-core CPU Resource Availability Prediction Model for Concurrent Processes,” Proceedings of the IANG International MultiConference of Engineers and Computer Scientists 2017, Hong Kong, March 2017. Jackie L. Foos, Randa L. Shehab, John K. Antonio, “Experiences Moving from Residential Camps to Nonresidential Day Camps,” Proceedings of the 123rd ASEE Annual Conference and Exposition, New Orleans, LA, June 2016. Khondker S. Hasan, Amlan Chatterjee, Sridhar Radhakrishnan, and John K. Antonio, “Performance Prediction Model and Analysis for Compute-intensive Tasks on GPUs,” The 11th IFIP International Conference on Network and Parallel Computing (NPC 2014), Published by: Lecture Notes Computer Science (LNCS), Springer, Vol. 8707, Ilan, Taiwan, pp. 612-617, Sep. 2014. Khondker S. Hasan, John K. Antonio, and Sridhar Radhakrishnan, “A New Composite CPU/Memory Model for Predicting Efficiency of Multi-core Processing,” The 20th IEEE International Symposium on High Performance Computer Architecture (HPCA-2014) Workshop, Sponsored by: IEEE Computer Society, Orlando, FL, Feb. 2014. Patents John K. Antonio, Mark B. Yeary, and Thomas D. Hosman, “Ultrasonic Communication System for Communication through RF-Impervious Enclosures and Abutted Structures,” Patent No. US 9,361,877; Date of Patent: June 7, 2016. Brian F. Veale, John K. Antonio, and Monte P. Tull, “Configuration Steering for a Reconfigurable Superscalar Processor,” Patent No.US 7,757,069; Date of Patent: July 13, 2010. School of Computer Science Devon Energy Hall 110 W. Boyd St. Norman, OK 73019 Phone: (405) 325-4042 Accessibility Sustainability HIPAA OU Job Search Policies Legal Notices Copyright Resources and Offices OU Report It! Updated 12/19/2024 by School of Computer Science: cs@ou.edu",
  "content_length": 6077,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:44"
}