{
  "name": "John A. Clark",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/john-clark",
  "status": "success",
  "content": "Professor John Clark | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor John Clark School of Computer Science Professor of Computer and Information Security Director of Siemens Digital MINE Head of the Security of Advanced Systems research group Open staff member portrait in a modal window john.clark@sheffield.ac.uk Regent Court (DCS) Full contact details Professor John Clark School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Google Scholar Profile John Clark is a Professor of Computer and Information Security at the University of Sheffield since April 2017 and leads the Security of Advanced Systems Research Group. Previously he was Professor of Critical Systems at the University of York, having joined academia in 1992 as a Lecturer in Safety Critical Systems.He studied Maths and then Applied Statistics at Oxford, before joining the security division of the software and systems house Logica (where he worked on security evaluation and security R&D). Research interests His major research interests lie in cybersecurity and software engineering, most notably the use of Artificial Intelligence to these areas. Publications have included work on: threat modelling, security policies, covert channel analysis, cryptographic building blocks, intrusion detection, insider detection, and automated synthesis of security protocols.Current work addresses the automated discovery of classical cryptanalytic strategies, intrusion detection, and the search for quantum approaches to cryptanalysis via evolutionary computation.He is particularly interested right now in building up research in the security of robotic and autonomous systems and in the security of advanced manufacturing systems. Publications Books Clark JA, Paige RF, Polack FAC & Brooke PJ (2006) Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics): Preface. Wright J, Stepney S, Clark JA & Jacob JL (2005) Formalizing anonymity: A review. Department of Computer Science, University of York. Srivratanakul T, Clark JA & Polack F (2004) Writing Effective Security Abuse Cases. Department of Computer Science, University of York. Srivratanakul T, Clark JA & Polack F (2004) Security Zonal Analysis. Department of Computer Science, University of York. Zhan Y & Clark JA (2004) Automatic test-data generation for testing simulink models. Department of Computer Science, University of York. Stepney S, Clark JA & Chivers H (2004) Breaking the Model: finalisation and a taxonomy of security attack. Department of Computer Science, University of York. Hao C, Clark JA & Jacob JL (2004) A search-based approach to the automated design of security protocols. Smith A, Clark JA & Burke EK (1997) Four methods for maintenance scheduling. Citeseer. Clark JA & Jacob JL (1997) A survey of authentication protocol literature: Version 1.0. Citeseer. Journal articles Alattas E, Clark J, Al-Aama A & Jarraya SK (2025) Evaluating features and variations in deepfake videos using the CoAtNet model. Journal of Imaging, 11(6). View this article in WRRO Abdolmaleki B, Clark J, Foroutani M, Khazaei S & Nasirzadeh S (2025) A Generic Framework for Practical Lattice-Based Non-interactive Publicly Verifiable Secret Sharing.. IACR Cryptol. ePrint Arch., 2025, 901-901. Das S, Pasikhani AM, Gope P, Clark JA, Patel C & Sikdar B (2024) AIDPS: Adaptive Intrusion Detection and Prevention System for Underwater Acoustic Sensor Networks.. IEEE/ACM Trans. Netw., 32, 1080-1095. Patel C, Pasikhani A, Gope P & Clark J (2024) User-empowered secure privacy-preserving authentication scheme for Digital Twin. Computers & Security, 140. View this article in WRRO Das S, Pasikhani AM, Gope P, Clark JA, Patel C & Sikdar B (2024) AIDPS: Adaptive intrusion detection and prevention system for underwater acoustic sensor networks. IEEE/ACM Transactions on Networking, 32(2), 1080-1095. View this article in WRRO Pasikhan AM, Clark JA & Gope P (2023) Incremental hybrid intrusion detection for 6LoWPAN. Computers & Security, 135. View this article in WRRO ALGorain FT & Clark JA (2023) Covering arrays ML HPO for static malware detection. Eng, 4(1), 543-554. Alromih A, Clark JA & Gope P (2023) A Privacy-Preserving Energy Theft Detection Model for Effective Demand-Response Management in Smart Grids.. CoRR, abs/2303.13204. Pasikhani AM, Clark JA & Gope P (2022) Adversarial RL-based IDS for evolving data environment in 6LoWPAN. IEEE Transactions on Information Forensics and Security, 17, 3831-3846. View this article in WRRO ALGorain FT & Clark JA (2022) Bayesian hyper-parameter optimisation for malware detection. Electronics, 11(10). Czekster RM, Morisset C, Clark JA, Soudjani S, Patsios C & Davison P (2021) Systematic review of features for co‐simulating security incidents in Cyber‐Physical Systems. SECURITY AND PRIVACY, 4(3). Pasikhani AM, Clark JA, Gope P & Alshahrani A (2021) Intrusion detection systems in RPL-based 6LoWPAN: a systematic literature review. IEEE Sensors Journal, 21(11), 12940-12968. View this article in WRRO Clark J (2021) Antitrust and Data: What Your Car Knows and Who It Should Tell. Journal of European Competition Law & Practice, 12(2), 82-91. Delgado-Perez P, Habli I, Gregory S, Alexander R, Clark J & Medina-Bulo I (2018) Evaluation of Mutation Testing in a Nuclear Industry Case Study. IEEE Transactions on Reliability, 67(4), 1406-1419. (2016) Handling Security Threats to the RFID System of EPC Networks, 63-82. Patrick M, Alexander R, Oriol M & Clark JA (2015) Subdomain-based test data generation. Journal of Systems and Software, 103, 328-342. Poulding S, Alexander R, Clark JA & Hadley MJ (2015) The optimisation of stochastic grammars to enable cost-effective probabilistic structural testing. Journal of Systems and Software, 103, 296-310. Pérez MG, Tapiador JE, Clark JA, Pérez GM & Gómez AFS (2014) Trustworthy placements: Improving quality and resilience in collaborative attack detection. Computer Networks, 58, 70-86. View this article in WRRO Tapiador JE & Clark JA (2013) The placement-configuration problem for intrusion detection nodes in wireless sensor networks. Computers & Electrical Engineering, 39(7), 2306-2317. Anand S, Burke EK, Chen TY, Clark J, Cohen MB, Grieskamp W, Harman M, Harrold MJ, McMinn P, Bertolino A , Jenny Li J et al (2013) An orchestrated survey of methodologies for automated software test case generation. Journal of Systems and Software, 86(8), 1978-2001. Chivers H, Clark J, Nobles P, Shaikh S & Chen H (2013) Knowing who to watch: Identifying attackers whose actions are hidden within false alarms and background noise. Information Systems Frontiers, 15(1), 17-34. Bechmann M, Clark J & Sebald A (2013) Genetic algorithms and solid state NMR pulse sequences. Journal of Magnetic Resonance, 228, 66-75. Briand L & Clark J (2013) Guest Editorial: Special section of the best papers from the 2nd International Symposium on Search Based Software Engineering 2010. Information and Software Technology, 55(1), 111-111. Sen S & Clark JA (2011) Evolutionary computation techniques for intrusion detection in mobile ad hoc networks. Computer Networks, 55(15), 3441-3457. White DR, Arcuri A & Clark JA (2011) Evolutionary Improvement of Programs. IEEE Transactions on Evolutionary Computation, 15(4), 515-538. Tapiador JE, Hernandez-Castro JC, Peris-Lopez P & Clark JA (2011) Cryptanalysis of Song’s advanced smart card based password authentication protocol. Arxiv preprint arXiv:1111.2744. Tapiador JE & Clark JA (2011) Masquerade mimicry attack detection: A randomised approach. Computers & Security, 30(5), 297-310. Poulding S & Clark JA (2010) Efficient Software Verification: Statistical Testing Using Automated Search. IEEE Transactions on Software Engineering, 36(6), 763-777. Dong X, Clark JA & Jacob JL (2010) Defending the weakest link: phishing websites detection by analysing user behaviours. Telecommunication Systems, 45(2-3), 215-226. Feldt R, Cohen M, Arcuri A, Baresel A & Clark JA (2010) SBST: 3rd International Workshop on Search-Based Software Testing. computer.org. Chivers H, Clark JA & Cheng P-C (2009) Risk profiles and distributed risk assessment. Computers & Security, 28(7), 521-535. Tapiador JE, Hernandez-Castro JC, Clark JA & Stepney S (2009) Highly entangled multi-qubit states with simple algebraic structure. Journal of Physics A: Mathematical and Theoretical, 42(41), 415301-415301. Shaikh SA, Chivers H, Nobles P, Clark JA & Chen H (2009) Towards scalable intrusion detection. Network Security, 2009(6), 12-16. Şen S & Clark JA (2009) Intrusion Detection in Mobile Ad Hoc Networks, 427-454. Shaikh SA, Chivers H, Nobles P, Clark JA & Chen H (2008) False positive response. Network Security, 2008(12), 11-15. Shaikh SA, Chivers H, Nobles P, Clark JA & Chen H (2008) Network reconnaissance. Network Security, 2008(11), 12-16. Shaikh SA, Chivers H, Nobles P, Clark JA & Chen H (2008) Characterising intrusion detection sensors, part 2. Network Security, 2008(10), 8-11. Shaikh SA, Chivers H, Nobles P, Clark JA & Chen H (2008) Characterising intrusion detection sensors. Network Security, 2008(9), 10-12. Stepney S & Clark JA (2008) Searching for Quantum Programs and Quantum Protocols. Journal of Computational and Theoretical Nanoscience, 5(5), 942-969. Zhan Y & Clark JA (2008) A search-based framework for automatic testing of MATLAB/Simulink models. Journal of Systems and Software, 81(2), 262-285. Stepney S & Clark JA (2008) Searching for quantum programs and quantum protocols: a review. Journal of Computational and Theoretical Nanoscience, 5, 942-969. Dong X, Clark JA & Jacob JL (2008) A user-phishing interaction model. Conference on Human System Interaction. Woodcock J, Stepney S, Cooper D, Clark J & Jacob J (2008) The certification of the Mondex electronic purse to ITSEC Level E6. Formal Aspects of Comput",
  "content_length": 46430,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:21"
}