{
  "name": "John-Paul Ore",
  "homepage": "https://jpwco.com",
  "status": "success",
  "content": "John-Paul Ore I work on robots because robots can help us overcome the world's vital challenges: our changing climate, food production, nuclear responsibilities, exploring space, environmental monitoring, and liberating people from dangerous, dirty, and dull work. I am actively recruiting motivated PhD students to join my lab. If you're interested, please contact me at jwore at ncsu dot edu. Background I'm John-Paul Ore, an assistant professor of computer science at the North Carolina State University I have a B.A. in Philosophy from the University of Chicago. Research Interests My research interests focus on applying program analysis techniques to software that controls robots and senses and acts in the physical world. This includes abstract type inference of physical unit types (like 'meters-per-second') with dataflow analysis, Probabilistic techniques for combining semantic information in identifiers (variable names) with code flow inference, and empirical measurements of how developers make decisions about robotic software, and how to connect program analysis with robotic simulation. I'm specifically focused on program analysis and software testing that helps make systems safer and more reliable while remaining practical and economically efficient. I seek to accelerate and amplify the processes and tools that can be a catalyst for new capabilities. PUBLICATIONS 2021 An Empirical Study on Physical Type Annotations: Accuracy, Speed, and Suggestion Effectiveness Automated Object Manipulation Using Vision-based Mobile Robotic System for Construction Applications 2019 Dimensional Analysis of Robot Software without Developer Annotations (Ph.D. thesis) 2018 Assessing the Type Annotation Burden John-Paul Ore, Sebastian Elbaum, Carrick Detweiler, and Lambros Karkazis ASE 2018 Automated Software Engineering Phys: Probabilistic Physical Unit Assignment and Inconsistency Detection Sayali Kate, John-Paul Ore, Xiangyu Zhang, Sebastian Elbaum and Zhaogui Xu FSE 2018 Foundations of Software Engineering Towards Code-Aware Robotic Simulation John-Paul Ore, Carrick Detweiler, and Sebastian Elbaum 1st International Workshop on Robotics Software Engineering (RoSE) Sensing Water Properties at Precise Depths from the Air (Journal Version) John-Paul Ore and Carrick Detweiler Journal of Field Robotics Sensing Water Properties at Precise Depths from the Aircite John-Paul Ore and Carrick Detweiler FSR'17 - Field and Service Robotics @InProceedings{10.1007/978-3-319-67361-5_14, author=\"Ore, John-Paul and Detweiler, Carrick\", editor=\"Hutter, Marco and Siegwart, Roland\", title=\"Sensing Water Properties at Precise Depths from the Air\", booktitle=\"Field and Service Robotics\", year=\"2018\", publisher=\"Springer International Publishing\", address=\"Cham\", pages=\"205--220\", isbn=\"978-3-319-67361-5\" } 2017 Dimensional Inconsistencies in Code and ROS Messages: a Study of 5.9M Lines of Code cite John-Paul Ore, Carrick Detweiler, and Sebastian Elbaum IROS'17 - International Conference on Intelligent Robots and Systems @INPROCEEDINGS{8202229, author={J. P. Ore and S. Elbaum and C. Detweiler}, booktitle={2017 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)}, title={Dimensional inconsistencies in code and ROS messages: A study of 5.9M lines of code}, year={2017}, volume={}, number={}, pages={712-718}, keywords={control engineering computing;operating systems (computers);robot programming;source code (software);ROS classes;ROS code;ROS messages;ROS programs;ROS software;dimensional analysis;dimensional inconsistencies;inconsistencies detection;inconsistency type;physical quantities;physical unit manipulation;robot operating system;robot software;C++ languages;Geometry;Libraries;Meters;Robots;Software;Tools}, doi={10.1109/IROS.2017.8202229}, ISSN={}, month={Sept}} Lightweight Detection of Physical Unit Inconsistencies without Program Annotations cite John-Paul Ore, Carrick Detweiler, and Sebastian Elbaum ISSTA`17 - International Symposium on Software Testing and Analysis @inproceedings{Ore:2017:LDP:3092703.3092722, author = {Ore, John-Paul and Detweiler, Carrick and Elbaum, Sebastian}, title = {Lightweight Detection of Physical Unit Inconsistencies Without Program Annotations}, booktitle = {Proceedings of the 26th ACM SIGSOFT International Symposium on Software Testing and Analysis}, series = {ISSTA 2017}, year = {2017}, isbn = {978-1-4503-5076-1}, location = {Santa Barbara, CA, USA}, pages = {341--351}, numpages = {11}, url = {http://doi.acm.org/10.1145/3092703.3092722}, doi = {10.1145/3092703.3092722}, acmid = {3092722}, publisher = {ACM}, address = {New York, NY, USA}, keywords = {dimensional analysis, physical units, program analysis, robotic systems, static analysis, type checking, unit consistency}} Phriky-Units: a Lightweight, Annotation-Free Physical Unit Inconsistency Detection Toolcite Best Tool Demonstration Award, ISSTA'17 John-Paul Ore, Carrick Detweiler, and Sebastian Elbaum ISSTA`17 - Demonstration Track @inproceedings{Ore:2017:PLA:3092703.3098219, author = {Ore, John-Paul and Detweiler, Carrick and Elbaum, Sebastian}, title = {Phriky-units: A Lightweight, Annotation-free Physical Unit Inconsistency Detection Tool}, booktitle = {Proceedings of the 26th ACM SIGSOFT International Symposium on Software Testing and Analysis}, series = {ISSTA 2017}, year = {2017}, isbn = {978-1-4503-5076-1}, location = {Santa Barbara, CA, USA}, pages = {352--355}, numpages = {4}, url = {http://doi.acm.org/10.1145/3092703.3098219}, doi = {10.1145/3092703.3098219}, acmid = {3098219}, publisher = {ACM}, address = {New York, NY, USA}, keywords = {dimensional analysis, physical units, program analysis, robotic systems, static analysis, type checking, unit consistency} } 2016 Obtaining the Thermal Structure of Lakes from the Air. cite Michaella Chung, Carrick Detweiler, Michael Hamilton, Jim Higgins, John-Paul Ore, and Sally Thompson Water @Article{w7116467, AUTHOR = {Chung, Michaella and Detweiler, Carrick and Hamilton, Michael and Higgins, James and Ore, John-Paul and Thompson, Sally}, TITLE = {Obtaining the Thermal Structure of Lakes from the Air}, JOURNAL = {Water}, VOLUME = {7}, YEAR = {2015}, NUMBER = {11}, PAGES = {6467}, URL = {http://www.mdpi.com/2073-4441/7/11/6467}, ISSN = {2073-4441}, DOI = {10.3390/w7116467} } 2015 Autonomous Aerial Water Sampling.cite John-Paul Ore, Sebastian Elbaum, Amy Burgin, and Carrick Detweiler. Journal of Field Robotics @article{ore2015autonomous, title={Autonomous aerial water sampling}, author={Ore, John-Paul and Elbaum, Sebastian and Burgin, Amy and Detweiler, Carrick}, journal={Journal of Field Robotics}, volume={32}, number={8}, pages={1095--1113}, year={2015}, publisher={Wiley Online Library} } Bringing Unmanned Aerial Systems Closer to the Environment.cite Carrick Detweiler, John-Paul Ore, David Anthony, Sebastian Elbaum, Amy Burgin, and Aaron Lorenz. Cambridge Journal of Environmental Practice @article{detweiler2015environmental, title={ENVIRONMENTAL REVIEWS AND CASE STUDIES: Bringing Unmanned Aerial Systems Closer to the Environment}, author={Detweiler, Carrick and Ore, John-Paul and Anthony, David and Elbaum, Sebastian and Burgin, Amy and Lorenz, Aaron}, journal={Environmental Practice}, volume={17}, number={3}, pages={188--200}, year={2015}, publisher={Taylor \\& Francis} } Surface Classification for Sensor Deployment from UAV Landings.cite David Anthony, Elizabeth Basha, Jared Ostdiek, John-Paul Ore, and Carrick Detweiler. ICRA - Proceedings of IEEE International Conference on Robotics and Automation Seattle, Washington @inproceedings{anthony2015surface, title={Surface classification for sensor deployment from UAV landings}, author={Anthony, David and Basha, Elizabeth and Ostdiek, Jared and Ore, John-Paul and Detweiler, Carrick}, booktitle={Robotics and Automation (ICRA), 2015 IEEE International Conference on}, pages={3464--3470}, year={2015}, organization={IEEE} } On Air-to-Water Radio Communication between UAVs and Water Sensor Networks.cite Jacob Palmer, Nicholas Yuen, John-Paul Ore, Carrick Detweiler, and Elizabeth Basha. ICRA - Proceedings of IEEE International Conference on Robotics and Automation Seattle, Washington, 2015. @inproceedings{palmer2015air, title={On air-to-water radio communication between UAVs and water sensor networks}, author={Palmer, Jacob and Yuen, Nicholas and Ore, John-Paul and Detweiler, Carrick and Basha, Elizabeth}, booktitle={Robotics and Automation (ICRA), 2015 IEEE International Conference on}, pages={5311--5317}, year={2015}, organization={IEEE} } 2014 Controlled Sensor Network Installation with Unmanned Aerial Vehicles.cite David Anthony, John-Paul Ore, Elizabeth Basha, and Carrick Detweiler. ACM Conference on Embedded Networked Sensor Systems (SenSys) , Memphis, TN. @inproceedings{anthony2014controlled, title={Controlled sensor network installation with unmanned aerial vehicles}, author={Anthony, David and Ore, John-Paul and Detweiler, Carrick and Basha, Elizabeth}, booktitle={Proceedings of the 12th ACM Conference on Embedded Network Sensor Systems}, pages={348--349}, year={2014}, organization={ACM} } 2013 Autonomous Aerial Water Sampling (link to journal version). John-Paul Ore, Sebastian Elbaum, Amy Burgin, Baoliang Zhao, and Carrick Detweiler. FSR'13 -Field and Service Robotics. Brisbane, Australia MISCELLANEOUS PUBLICATIONS An airborne robotic platform for mapping thermal structure in surface water bodies. cite Sally Thompson, Michelle Chung, Carrick Detweiler, and John-Paul Ore. In AGU Fall Meeting Abstracts. 2015. @inproceedings{thompson2015airborne, title={An airborne robotic platform for mapping thermal structure in surface water bodies}, author={Thompson, SE and Chung, M and Detweiler, C and Ore, JP}, booktitle={AGU Fall Meeting Abstracts}, year={2015} } Co-Aerial Ecologist Poster at National Robotics Initiative - Primary Investigators Meeting, Washington DC, 2015. Towards Monitoring Saline Wetlands with Micro UAVs.cite Ore John-Paul, Amy Burgi",
  "content_length": 16353,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:16"
}