{
  "name": "John J. Heslen",
  "homepage": "https://www.augusta.edu/faculty/directory/view.php?id=JHESLEN",
  "status": "success",
  "content": "John Heslen - Faculty Profile Home Faculty Directory Profile Update Your Profile Directory FAQs PACT Login Give Feedback John Heslen Associate Professor John Heslen Associate Professor Academic Appointment(s)Pamplin College of Arts, Humanities, and Social SciencesDepartment of Social SciencesSchool of Computer and Cyber SciencesDepartment of Information Systems/TechnologyAdministrationDepartment of The Graduate School BioI am a retired USAF intelligence officer with appointments in the School of Computer and Cyber Sciences as well as Pamplin College. JHESLEN@augusta.edu UH 106 General Credentials Instruction Scholarship Service Education Ph.D., Multi-/Interdisciplinary Studies, Other University of Oklahoma - Norma, 2016 MA, Multi-/Interdisciplinary Studies, General University of Oklahoma - Norma, 2003 BA, History, General University of Georgia, 1998 Awards & Honors NSA's National Cybersecurity Curriculum Program National Security Agency, 2018 Courses Taught Most Recent Academic Year AIST 6353 Human Factors in Info Security AIST 6355 Info Sec Policy Development SECR 7200 US Intel Theory SECR 6414 Medical Intelligence SECR 6607 OSINT: Theory & Practice SECR 6412 Intelligence Collection Teaching Interests My teaching interests include courses on the U.S. Intelligence Community and Cyber War. Scholarship Selected Recent Publications Cyber-Enabled Education Operations: Towards a Strategic Cybersecurity Curriculum for the Social Sciences, 2025 Journal Article, Academic Journal Local government cyber insecurity: Causes and recommendations for improvement, with D.F. Norris; L. Mateczun; W. Hatcher; W. Mears; and J. Heslen, 2023 Journal Article, Academic Journal Preliminary Analysis of Privacy Implications Observed in Social-Media Posts Across Shopping Platforms” with Bethany Sumner, Gokila Dorai., and John J. Heslen, 2022 Conference Proceeding Epi-Intel Fusion Centers: Health Security & COVID-19 in the Dominican Republic” with Craig D. Albert, Lance Hunter, Alejandro Baez, John J. Heslen. and Josh Rutland, 2022 Journal Article, Academic Journal The cybersecurity of municipalities in the United States: an exploratory survey of policies and practices, 2020 Journal Article, Academic Journal Research Interests My research interest include cognitive performance and decision making and the U.S. Intelligence Community. Department Service Fort Gordon Cyber Protection Brigade Info Session 2017 - Present Role: Attendee, Meeting Office of Faculty Development and Teaching Excellence Advisory Committe 2017 - Present Role: Committee Member Development of MAISS Intro to Intelligence Course 2018 - 2019 Role: Other Talk to Mark's United Methodist Church 2018 - 2018 Role: Other Development of Intro to Intelligence class for Undergrads 2018 - 2018 Role: Other University Service Frontiers for Young Mind Mentor 2021 - Present Role: Mentor",
  "content_length": 2861,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:42"
}