{
  "name": "John R. Kender",
  "homepage": "http://www.cs.columbia.edu/~jrk",
  "status": "success",
  "content": "Home Page of John R. Kender John R. Kender Welcome to my home page. (Like much of life itself, continually under construction) I am: Professor, Department of Computer Science Great Teacher, Society of Columbia Graduates Distinguished Faculty Teacher, Columbia Engineering School Alumni Association former Vice Dean, Fu Foundation School of Engineering and Applied Science at Columbia University in New York City and most recently co-General Chair of the 2016 ACM International Conference on Multimedia Retrieval I do computer vision, video understanding, gesture recognition, artificial intelligence. See: Google Scholar Patents and Applications My research has been supported by: Government: DARPA, IARPA/DTO/ARDA, NSF, NYState Sci&Tech Foundation, ONR Big Industry: AT&T, Digital Equipment, Ford Motor, IBM, Intel, Microsoft, Philips Small Industry: D/ADA, Matrix, Unimation Information about the NSF IIS-Sponsored Project on \"Tagging and Browsing Videos According to the Preferences of Differing Affinity Groups\" My graduated Doctoral students are: Emad Barsoum, 2019 Chun-Yu (Claire) Tsai, 2017 John R. Zhang, 2013 Michelle Merler, 2012 Heather Morris, 2011 Alex Haubold, 2008 Hassan Malik, 2007 Ramon Lluis Felip, 2007 Lijun Tang, 2006 Yan Liu, 2005 Lalitha Agnihotri, 2005 Juan-Maria Sanchez-Secades, 2003 Tiecheng Liu, 2003 Aya Aner, 2002 Samuel Fenster, 1999 Frederik Kjeldsen, 1996 David Yang, 1996 Alicia Abella, 1995 Il-Pyung Park, 1993 Thomas Ellman, 1989 Mark Moerdler, 1989 Michalis Hatzitheodorou, 1989 Dong Jae Choi, 1988 Terrance Boult, 1986 David Lee, 1985 Hussein Ibrahim, 1984 Steven Shafer, 1983 My past, present, and future teaching is: Fall (all years): COMS W3107x: Clean Object-Oriented Design Spring (even years): COMS W4735y: Visual Interfaces to Computers Spring (odd years): COMS E6735y: Visual Databases Fall, Spring, and Summer (all years): COMS W4901: Projects in Computer Science COMS E6901: Projects in Computer Science On demand: A Lecture on Teaching jrk atsign cs dot columbia dot edu Finger plan and contact information Be careful of what you ask for",
  "content_length": 2088,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:04"
}