{
  "name": "John Aycock",
  "homepage": "http://www.cpsc.ucalgary.ca/~aycock",
  "status": "success",
  "content": "Unfettered by Content: John's Home Page John Aycock Nonstick Yurt Salesperson of the Month Professor Department of Computer Science University of Calgary ICT 646, (403) 210-9409 aycock@ucalgary.ca @herrprofdr@mastodon.social he/him Silly stuff Courses Books Papers Research Art Games One-Note Sam (2024): 32 levels in 3.5KiB for the unexpanded VIC-20. Cronosoft. Idol Time (2021): 45 levels in 3.5KiB for the unexpanded VIC-20. Cronosoft. SMitten by Art An art project: computer-generated parody of Mitt Romney's political tweets. The @TransforMitt Twitter feed A tweet-to-tweet comparison of @MittRomney vs. @TransforMitt An FAQ A technical report with the gory, geeky details The final academic paper Painting the Internet Conceptual art. Because I like the concept of staying out of jail. J. Aycock. Painting the Internet. Leonardo 41, 2 (April 2008), pp. 112-113, MIT Press. Transactions section. This is the condensed and extended version of the tech report below. J. Aycock. Painting the Internet: A Different Kind of Warhol Worm, Technical Report 2006-834-27, Department of Computer Science, University of Calgary, 2006. Photography Some of my pictures, and some unintended side effects of taking them. Current and Upcoming Courses Fall 2025 CPSC 399.07, The Command Line Interface Winter 2026 CPSC 399.05, Introduction to Reverse Engineering CPSC 411, Compiler Construction Past Courses Taught CPSC 217, Introduction to Computer Science for Multidisciplinary Studies I CPSC 231, Introduction to Computer Science for Computer Science Majors I CPSC 399.05, Introduction to Reverse Engineering CPSC 411, Compiler Construction (I) CPSC 457, Principles of Operating Systems CPSC 510, Compiler Construction II CPSC 527/627, Computer Viruses and Malware (was CPSC 599.48/601.92) CPSC 599.55/601.02, Compiler Code Generation and Optimization CPSC 528/628, Spam and Spyware (was CPSC 599.63/601.12) CPSC 599.82, Retrogames CPSC 601.01, Creative Programming II CPSC 601.89, Readings in Compiler Construction ISEC 621, Ethical Hacking Laboratory Research Interests \"Retro\" computer and video game implementation Binary reverse engineering Multidisciplinary things related to computer science, including areas like archaeology, art, economics, ethics, history, and law Past Projects (At least those with web pages..) SPARK, the Scanning, Parsing, And Rewriting Kit AGATE: All Good Acronyms Taken, Evidently Books J. Aycock. Amnesia Remembered: Reverse Engineering a Digital Artifact. Berghahn, 2023. J. Aycock. Retrogame Archeology: Exploring Old Computer Games. Springer, 2016. J. Aycock. Spyware and Adware. Advances in Information Security, volume 50, Springer-Verlag, 2011. The Mystery of the Missing Circles If you're looking for the circles I mentioned in the Preface that indicate endnotes, they were quietly lopped off in production by the publisher. I apologize! The full errata list is here. Reviews D. Werden. Review of Spyware and Adware by John Aycock, ACM SIGACT News 44, 1 (2013), pp. 17-19. J. Aycock. Reading and Modifying Code, 2008. Download it here. FAQ The book is self-published. That means it's no good, right? The book content has actually been reviewed by more people than any given peer-reviewed publication I've ever had. (Historical note: it was available via BookSurge from 2008-2014.) J. Aycock. Computer Viruses and Malware. Advances in Information Security, volume 22, Springer-Verlag, 2006. Reviews G. Ledin. M. Stamp. A. Ortiz-Tapia. An Authentic Breakthrough, IEEE Distributed Systems Online 7, 12 (2006). M. Sanford. Computer viruses and malware by John Aycock, ACM SIGACT News 41, 1 (2010), pp. 44-47. Papers J. Aycock, K. Biittner, S. Z. Khaleel, C. Therrien, A. Querengesser, and H. Sikstrom. AI vs. AI: Comparing Artificial Intelligence with Actual Intelligence for a Gameplay Task. 2025 IEEE Conference on Games, short paper, 2025, 4pp. J. Durno, J. Aycock, and A. Tenney. Big Baggy Shorts: Recovering Data From Canada's Telidon System. IEEE Annals of the History of Computing 47, 1 (2025), pp. 64-71. Errata. K. Biittner, C. Therrien, J. Aycock, D. Bailey, and P. A. Newell. Computer Theatre: Raising the Curtain on a Visual Novel Prototype. ROMchip: A Journal of Game Histories 6, 2 (2024). J. Aycock and K. Biittner. Experimental Archaeogaming: A Case Study. Advances in Archaeological Practice 12, 2 (2024), pp. 75-85. S. Ganesh, J. Aycock, and K. Biittner. FrAG: A Framework for the Analysis of Games. 2023 IEEE Conference on Games, short paper, 2023, 4pp. J. Aycock. Binary Reverse Engineering for All. 28th Annual Conference on Innovation and Technology in Computer Science Education (V. 1), 2023, pp. 243-249. J. Aycock. spy3: A Python Subset for CS1. 25th Western Canadian Conference on Computing Education, 2023, Article 6, 6pp. T. Kendon, L. Wu, and J. Aycock. AI-Generated Code Not Considered Harmful. 25th Western Canadian Conference on Computing Education, 2023, Article 3, 7pp. J. Aycock and K. Biittner. Archaeogaming is X. Chapter 8 of Archaeology Outside the Box, H. Barnard, ed., Cotsen Institute of Archaeology Press, 2023, pp. 83-77. J. Aycock, S. Ganesh, K. Biittner, P. A. Newell, and C. Therrien. The Sincerest Form of Flattery: Large-Scale Analysis of Code Re-Use in Atari 2600 Games. 18th International Conference on the Foundations of Digital Games, 2022, Article 26, 10pp. P. A. Newell, J. Aycock, and K. M. Biittner. Still Entombed After All These Years: The continuing twists and turns of a maze game, Internet Archaeology 59, 2022. Errata. J. Aycock and H. Kroepfl. The Desolation of Vixens. In Return to the Interactive Past: The Interplay of Video Games and Histories, Sidestone Press, 2021, pp. 45-55. Free online access via publisher's web site. J. Aycock. The coming tsunami of digital artefacts. Antiquity 95, 384 (2021), pp. 1584-1589. Debate paper, with three responses, and my response to those. M. Reimsbach and J. Aycock. Decoding the Cauzin Softstrip: A Case Study in Extracting Information from Old Media. Archival Science 21, 3 (2021), pp. 281-294. J. Aycock. Teaching Social Engineering Using Improv. 26th ACM Annual Conference on Innovation and Technology in Computer Science Education, 2021, pp. 629-630. Tips, Techniques, and Courseware paper. J. Aycock, C. Poremba, and C. Therrien (eds.). Remediation of Cinema Images in Videogames. In Encyclopedia of Film Techniques and Technologies, edited by A. Gaudreault, L. Le Forestier, and G. Mouëllic. 2020. J. Aycock and K. Biittner. LeGACy Code: Studying How (Amateur) Game Developers Used Graphic Adventure Creator. 15th International Conference on the Foundations of Digital Games, 2020, Article 23, 7pp. Free access via ACM. J. Aycock. Interview with Bryan Dent re: Allenbach Industries. Technical Report 2020-1118-04, Department of Computer Science, University of Calgary, 2020. J. Aycock. Interview with Mark Raintree re: DisCopyLabs. Technical Report 2020-1116-02, Department of Computer Science, University of Calgary, 2020. J. Aycock. Interview with Scott Cronce re: Disclone. Technical Report 2020-1117-03, Department of Computer Science, University of Calgary, 2020. J. Aycock. Interview with Peter Brown re: XEMAG. Technical Report 2020-1115-01, Department of Computer Science, University of Calgary, 2020. H. Wright and J. Aycock. 10 Binary Games for Computer Science Education. ACM SIGCSE 2020, poster, p. 1308. Free access via ACM. J. Aycock and K. Biittner. Inspecting the Foundation of Mystery House. Journal of Contemporary Archaeology 6, 2 (2019), pp. 183-205. J. Aycock and P. Finn. Uncivil Engineering: A Textual Divide in Game Studies. Game Studies 19, 3 (2019). E. Kaltman, J. Osborn, and J. Aycock. S4LVE: Shareable videogame analysis and visualization. 14th International Conference on the Foundations of Digital Games, 2019, Article 61, 5pp. Demo paper. Free access via ACM. J. Aycock, A. Reinhard, and C. Therrien. A Tale of Two CDs: Archaeological Analysis of Full-Motion Video Formats in Two PC Engine/TurboGrafx-16 Games. Open Archaeology 5, 1 (2019), pp. 350-364. Errata. J. Aycock. Interview with James Terry re: Amnesia. Technical Report 2019-1112-04, Department of Computer Science, University of Calgary, 2019. J. Aycock. Interview with Charlie Kreitzberg re: Amnesia. Technical Report 2019-1111-03, Department of Computer Science, University of Calgary, 2019. J. Aycock. Interview with Don Daglow re: Amnesia. Technical Report 2019-1113-05, Department of Computer Science, University of Calgary, 2019. J. Aycock. Interview with Jane Isay re: Amnesia. Technical Report 2019-1110-02, Department of Computer Science, University of Calgary, 2019. J. Aycock, H. Wright, J. Hildebrandt, D. Kenny, N. Lefebvre, M. Lin, M. Mamaclay, S. Sayson, A. Stewart, and A. Yuen. Adapting the “Unessay” for Use in Computer Science. 24th Western Canadian Conference on Computing Education, 2019, Article 2, 6pp. Free access via ACM. J. Aycock. Interview with Glen Hartley re: Amnesia. Technical Report 2019-1109-01, Department of Computer Science, University of Calgary, 2019. J. Aycock and T. Copplestone. Entombed: An Archaeological Examination of an Atari 2600 Game. The Art, Science, and Engineering of Programming, 3, 2 (2019), Article 4, 33pp. J. Aycock. Finding the Invisible: An Experience-based Methodology for Selecting Retrogame Archaeology \"Sites.\" Kinephanos, August 2018, pp. 34-50. J. Aycock, A. Groeneveldt, H. Kroepfl, and T. Copplestone. Exercises for Teaching Reverse Engineering. 23rd ACM Annual Conference on Innovation and Technology in Computer Science Education, 2018, pp. 188-193. Free access via ACM. J. Aycock. Stick to the Script: Lightweight Recording and Playback of Live Coding. 23rd ACM Annual Conference on Innovation and Technology in Computer Science Education, 2018, pp. 350-351. Tips, Techniques, and Courseware paper. Free access via ACM. J. Aycock. Game Studies at Scale: Towards Facilitating Exploration of Game Corpora. Loading... (journal of the Canadian Game Studies Association), 10, 17 (2017), pp. 93-111. J",
  "content_length": 34947,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:29"
}