{
  "name": "John Cartlidge",
  "homepage": "https://seis.bristol.ac.uk/~cszjpc",
  "status": "success",
  "content": "John Cartlidge John Cartlidge Home Publications Prof. John Cartlidge Professor of Financial Technology School of Engineering Mathematics and Technology University of Bristol 2.48 Merchant Venturers Building Email: john.cartlidge@bristol.ac.uk Full contact details and vCard I joined the Department of Computer Science at the University of Bristol in August 2017. Previously, I spent two years as Assistant Professor in Computer Science at the University of Nottingham's campus in Ningbo, China. I am a Fellow of the HEA, and visiting scholar at the University of Nottingham Ningbo China. I perform consultancy and advisory services for government and industry and have previously consulted for the UK Government and acted as expert witness for the high court and crown court in London in the area of automated trading technologies and financial systems. I have also acted as academic advisor on regulation technologies for the Financial Conduct Authority. History: I received a first class BSc Hons in Artificial Intelligence and Mathematics (Leeds, 2000) and a PhD in Evolutionary Computation (Leeds, 2004), in the area of coevolutionary optimisation. Subsequently, I worked for the London Stock Exchange and Hewlett-Packard Labs on a collaborative research project exploring disruptive technology innovation in financial markets and effects on liquidity discovery and market impact. I then co-founded a tech start-up company offering eBay analytics software, and financial trading software including a bespoke prototype GUI for a dark-pool trading venue. Returning to academia, I completed post-doctoral research posts in Evolutionary Computation and Finance at the University of Central Lancashire, and Cloud Computing at the University of Bristol, before becoming Lecturer. Research and Supervision I supervise final year projects. If you are interested in undertaking research projects in the areas of financial technology, trading technologies, or more generally in data science and machine learning, please contact. Administration I am Programme Director for MSc Financial Technology with Data Science (new for 2021). Apply now Back to top Copyright © 2017-2024 John Cartlidge",
  "content_length": 2183,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:32"
}