{
  "name": "John Anderson 0001",
  "homepage": "http://www.cs.umanitoba.ca/~andersj",
  "status": "success",
  "content": "Welcome to John Anderson Online What's new here? I am a member of the University of Manitoba's COVID-19 Academic Team Due to the global pandemic, we will not be traveling to robotics competitions this year. See the galleries on the Lab Website for previous competitions. I was one of the 2012 recpients of the Student-Teacher Recognition Award. That's far from new at this point, but it was a really touching event. Thanks to UTS for putting it on and Derek Cormier for nominating me. You might be looking for slides from my seminar on grad school for students from when I was Grad Chair, or information about our policies for faculty. Our Lab Website always has the most up-to-date research information. Welcome! (Technically, 'Welcome to my public_html directory', but that sounds nerdy) I am a Full Professor in the Computer Science Department in the Faculty of Science at the University of Manitoba. I was Head of the Department from 2012-17. My office is 476 E2 in the Engineering and Information Technology Complex. You can check out the view if the webcam is on. I do Research in Multiagent and Multirobot Systems, Autonomous Agents, Robotics, and related areas of Artificial Intelligence. The page for my laboratory has more information about this. I also dabble in Lots of Other Things. I also, not surprisingly, Teach here. Most of the courses you'll find me in are in my research area or in other software related areas, but I do cover other areas as needed. I am also involved with the University in a number of other ways. I am in my third term as a member of the Board of Governors of the University of Manitoba, and I am one of the longest-serving elected members of the University's Senate, representing the Faculty of Science. These are the senior business and academic decision-making bodies of the University, respectively. I am also a member of the University Discipline Committee of the Board of Governors. I was chair of that committee for three years, stepping down when I assumed the headship of Computer Science. With the time I have left over, there is still Much that Keeps Me Busy. Unfortunately, updating this is not often one of those things, so please excuse dated items. Despite the apparent minimalism, there is a fair bit here. Feel free to explore at your leisure (and note the Usual Disclaimers). Commentary from regular (and irregular) viewers is always welcome. Contents ©1993-2034 John Eric Anderson, unless otherwise noted. This page has been out of date since Saturday, 14-Aug-2021 15:50:24 CDT.",
  "content_length": 2536,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:22"
}