{
  "name": "John Schneider",
  "homepage": "http://www.eecs.wsu.edu/~schneidj",
  "status": "success",
  "content": "Home Page for John Brand Schneider John Brand Schneider School of Electrical Engineering and Computer Science P.O. Box 2752, Electrical and Mechanical Engineering Bldg. (EME) 221 Washington State University Pullman, WA 99164-2752 (509) 335-6457 john_schneider@wsu.edu Education Ph.D., University of Washington, Electrical Engineering, 1991. M.S., University of Washington, Electrical Engineering, 1985. B.S., Summa Cum Laude, Tulane University, Electrical Engineering, 1983. Some Professional Stuff Curriculum vitae. Conference and other “unreviewed” publications. Journal papers. My FDTD book. 时域有限差分方法及编程技巧. My book in Chinese! (I get no proceeds from this. I said to the gentleman interested in doing the translation that if I were sent five copies of the translation, they could do what they want with it.) Our Python book. Some Personal Stuff My past. The family. Description of Ironman Coeur d'Alene 2004. Description of Boston Marathon 2005. The Demonic Ride. Reason you should pack your bike when visiting the Palouse (yes, if you know where to look, I do make multiple appearances in this). Words to Live by (engineers’ credo): And he gave for his opinion, that whoever could make two ears of corn or two blades of grass to grow upon a spot of ground where only one grew before, would deserve better of mankind, and do more essential service to his country than the entire race of politicians put together. — Johnathan Swift, 1647–1745 Words to Lecture by (professors’ credo): This is a one line proof if we start sufficiently far to the left. — From an electrical engineering lecture given at Cambridge University (lecturer unknown) Words to Guide One’s Actions (human’ credo): Yet again, the earth willingly teaches righteousness to those who can learn; for the better she is served, the more good things she gives in return. — Xenophon, c. 430–355 BCE",
  "content_length": 1863,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:10"
}