{
  "name": "John Dingliana",
  "homepage": "https://www.scss.tcd.ie/John.Dingliana",
  "status": "success",
  "content": "Home Page: Dr. John Dingliana John Dingliana | Associate Professor in Computer Science CONTACT INFO | RESEARCH | TEACHING | PUBLICATIONS John Dingliana (Ph.D., B.Sc.(Hons.)) Associate Professor in Computer Science Graphics and Vision Lab [GV2] School of Computer Science and Statistics [SCSS] Trinity College Dublin [TCD] Location: 02-014 Stack B, Custom's House Quay [MAP] Phone: (+3531) 896 3680 Email: John.Dingliana AT tcd.ie Research Research Interests 3D Graphics and Animation Virtual and Augmented Reality Non-photorealistic Rendering Level of Detail and Real-time Techniques Collision Detection and Physically-Based Animation Games and Graphics Technologies Perceptually-adaptive Graphics and Visualization Interactive Visualization Volume Rendering and Scientific visualization Information Visualization Research Projects [2022-2025] TransMIXR : Ignite the Immersive Media Sector by Enabling New Narrative Visions [CONSORTIUM PAGE|LOCAL PAGE] FUNDING SOURCE: Horizon Europe. ROLE: Co-PI [2022-2026] Life in the Currents FUNDING SOURCE: Prendergast Challenge-Based Mutli-Disciplinary Project Awards. ROLE: Co-PI [2021-] ADAPT Phase 2: SFI Research Centre for AI-driven Digital Content Technology [URL] FUNDING SOURCE: SFI Research Centres. ROLE: Funded Investigator [2019-2027] D-REAL: SFI Centre for Research Training in Digitally-Enhanced Reality [URL] FUNDING SOURCE: Science Foundation Ireland (SFI) Centre for Research Training. ROLE: Collaborator [2019-2027] CRT-AI: SFI Centre for Research Training in Artificial Intelligence [URL] FUNDING SOURCE: Science Foundation Ireland (SFI) Centre for Research Training. ROLE: Collaborator [2020-2024] Style-Independent Pose/View Classification for Traditional Animation FUNDING SOURCE: IRCSET Employment-based PhD, in collaboration with Cartoon Saloon. ROLE: Co-supervisor [2021-2022] Occlusion-capable Optical See-Through AR Display FUNDING SOURCE: TCD Research Boost Programme. ROLE: Principal Investigator [2020-2021] 3D CRAFT UK-Ireland Digital Humanities Network [URL] FUNDING SOURCE: IRC & UKRI AHRC Digital Humanities Networking call. ROLE: Co-Investigator [2014-2019] ADAPT: SFI Centre for Next Generation Content [URL] FUNDING SOURCE: SFI Research Centres. ROLE: Collaborator [2014-2019] ARTIVVIS: Real-time Time Variant Visualisation [URL] FUNDING SOURCE: SFI Investigators Programme. ROLE: Principal Investigator [2015-2016] INFOCARVE: Focus-and-Context Augmented Reality Visualisation [URL] FUNDING SOURCE: SFI TIDA. ROLE: Principal Investigator [2012-2014] Inside Joycean Dublin [URL] FUNDING SOURCE: misc. ROLE: Collaborator [2011-2015] Analysing the Imagery of The Book of Kells FUNDING SOURCE: TCD Innovation Bursary in collaboration with History of Art Department. ROLE: Co-PI [2011-2014] VERVE: Vanquishing fear and apathy through e-inclusion: personalised and populated realistic virtual environments for clinical, home and mobile platforms [URL] FUNDING SOURCE: EU FP7 Collaborative Project. ROLE: Deputy Co-ordinator | Co-PI [2011] Dynamic Visualisation of Energy Data FUNDING SOURCE: Enterprise Ireland (EI) Innovation Voucher - Tictoc Platforms Ltd. ROLE: Principal Investigator [2010] IQ/EQ Brain-training Game FUNDING SOURCE: Enterprise Ireland Innovation Voucher - Neurosynergy Games. ROLE: Principal Investigator [2010-2014] Illustrative Visualisation of Volume Data FUNDING SOURCE: PhD student funded by TCD Postgraduate Scholarship. ROLE: Principal Investigator/Supervisor [2008] Perceptually Optimised Rendering for Interactive 3D Visualisation [URL] FUNDING SOURCE: SFI-Research Frontiers. ROLE: Principal Investigator [2007-2010] Perceptually Optimised Interactive Large-scale Visualization FUNDING SOURCE: IRCSET PhD Studentship co-funded by Intel Ireland. ROLE: Principal Investigator [2006-2009] Interactive 3D Authoring and Non-Photo-realistically Rendered Interfaces FUNDING SOURCE: IRCSET PhD Studentship. ROLE: Principal Investigator/Supervisor [2006-2009] Real-time Non-photorealistic Rendering FUNDING SOURCE: PhD student funded by TCD Postgraduate Scholarship.ROLE: Principal Investigator/Supervisor [2002-2006] IITAC2 - Institute for Information Technology and Advanced Computation : Program for research in Graphics and Visualization FUNDING SOURCE: HEA PRTLI. ROLE: Collaborator [2000-2002] Real-time Adaptive Animation Techniques FUNDING SOURCE: Enterprise Ireland. ROLE: Collaborator [2000] Non-photorealistic animation and rendering for real-time interactive virtual environments FUNDING SOURCE: TCD Startup Lecturer's Grant. ROLE: Principal Investigator [1998-2000] Time-Critical Adaptive Techniques for Perceptually Sensitive Real-time Animation FUNDING SOURCE: EI. ROLE: PhD Student Programme Committee, Conference organisation, Editorial Activities, etc. General Chair - International Conference on Artificial Telexistence & Eurographics Symposium on Virtual Environments 2023, Dublin, Ireland. [URL] Chair of the EUROGRAPHICS Irish Chapter (2014-present) [URL] International Programme Committee Service Expressive - Joint Symposium on Computational Aesthetics (CAe), Sketch-based Interfaces & Modelling (SBIM) and Non-photorealistic Animation & Rendering (NPAR) 2013 - 2019 Non-Photorealistic Animation and Rendering (NPAR) 2011 - 2012 Virtual Reality Interaction and Physical Simulation (VRIPhys) 2008 - 2019 International Conference in Central Europe on Computer Graphics, Visualization and Computer Vision (WSCG) 2007 - 2019 International Joint Conference on Computer Vision, Imaging and Graphics Theory & Applications (GRAPP) 2007 - 2019 International Symposium on Visual Computing (ISVC) 2006 - 2019 Annual Conference of Swedish Chapter of Eurographics (SIGRAD) 2015 - 2016 Spring Conference on Computer Graphics (SCCG) 2012 Irish Human Computer Interaction Conference (iHCI) 2010-2011 Journal Reviewer: IEEE Transactions on Visualization and Computer Graphics (TVCG), Wiley - Computer Graphics Forum (CGF), ACM Transactions on Applied Perception (TAP), IEEE Computer Graphics and Applications (CG&A) , IEEE Spectrum, Elsevier - Computers & Graphics (CAG), International Journal of Interactive Worlds (IJIW) , Electronics and Telecommunications Research Institute (ETRI) Journal , Springer - Frontiers of Information Technology & Electronic Engineering (FIT&EE) Conference Reviewer: VRST, ACM SIGGRAPH; Eurographics Annual Conference, ACM SIGGRAPH ASIA, Pacific Graphics, Symposium on Computer Animation (SCA), ISVC, VRIPHYS, Information Visualization , Computer Graphics Animation & Games, IEEE 3D User Interfaces (3DUI) , Eurographics-Ireland , iHCI , ACM Web3D Symposium Co-Chair, VRIPhys'07: 4th International Workshop on Virtual Reality Interactions and Physical Simulations 2007, Dublin, Ireland [Poster] Co-ordinator for the EUROGRAPHICS stand at Siggraph 2007-08 Co-Chair, Eurographics 2005 Short Presentations Programme, Dublin, Ireland. Co-organizer, Surgery Simulations Track, ISVC 2005, Lake Tahoe Nevada, US Programme Committee Coordinator / Editor, EG Ireland Workshop 2001, Dublin, Ireland Teaching and Administrative Activities Modules Taught [2017-26] CS7DS4/CSU44056 Data Visualization for multiple cohorts (including MSc in Computer Science, Masters in Computer Science, BAI/MAI Computer Engieering) [2016-18, 2020-26] CS7029a: Visual Computing for the MSc in Interactive Digital Media [2017-18] CS7GV6 Computer Graphics for MSc in Computer Science [2007-17] CS7057: Realtime Physics for the MSc in Interactive Entertainment Technology degree [2012-15] CS7038: IET Team Project for the MSc in Interactive Entertainment Technology [2012-13] CS7029: Image Processing and 3D Modelling for the MSc in Interactive Digital Media [2010-12] CS7055: Realtime Rendering for the MSc in Interactive Entertainment Technology degree [2005-10] CS7029 (aka mm112, mm105): Image Processing and 3D Modelling for the MSc in Interactive Digital Media [2007] CS4: Introduction to Computer Graphics for the BSc Computer Science Evening Degree [1999-2003] CS5: Computer Graphics for BSc Computer Science evening degree [1999-2005] 3D4: Computer Aided Design I, to JS BAI Engineering and JS/SS Maths Students Administrative Roles Course Co-Director for Admissions - MSc. in Computer Science, from September 2021 - present Course Director - MSc. in Computer Science, from July 2019 - August 2021 Associate Director of Postgraduate Teaching and Learning (Responsible for Taught Postgraduate Programmes) - School of Computer Science and Statistics, TCD, from 2017-2019 Course Director - MSc. in Interactive Entertainment Technology from 2008 - 2014 SCSS Research Ethics Committee Member. 2013 - 2015 Course Committee Member - MSc in Computer Science (Interactive Entertainment Technology). 2014 - 2017 Course Committee Member - MSc in Interactive Digital Media from 2009 - Thesis External Examiner: 1 PhD and 2 MSc Thesis Internal Examiner: 18 PhD and 4 MSc SCSS Postgraduate Appeals Committee Erasmus Co-ordinator for the Computer Science Dept. from 2006-09 Supervision Overview: 11 completed PhD students (9 as principal supervisor, 2 as co-supervisor), 5 Current PhD Students, 12 Postdocs, 9 Research Assistants, 2 MSc Research Students, 50+ MSc Dissertations, 30+ Undergraduate Final Year Projects. PhD Research Students, Currently Supervised: Xuyu Li (2023-Present) Yinghan Xu (2023-Present) Priyansh Jalan (2021-Present) Elea Thuilier (2021-Present, Co-supervised with Attracta Brennan (NUIG)) Rachael Schwartz (2020-Present, Co-supervised with Rachel McDonnell) PhD Research Students, completed: Kieran Nolan (PhD 2019, Digital Arts and humanities PhD Program): Natural Interface Design, Video Games and Human Computer Interaction Salaheddin Alakkari (PhD 2019), Perceptual optimization of time-variant volume rendering Pisut Wisessing (PhD 2020, Co-supervised with Rachel McDonnell), Engaging Virtual Avatars Rowan Hughes (PhD 2016): Modelling Plausible Steering Behaviours or Autonomous Virtual Humans in Complex Environments Shengzhou Luo (PhD 2015): Transfer Function Optimization f",
  "content_length": 37581,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:36"
}