{
  "name": "John D. Owens",
  "homepage": "https://www.ece.ucdavis.edu/~jowens",
  "status": "success",
  "content": "John Owens / Electrical and Computer Engineering / UC Davis John Owens Child Family Professor of Engineering and Entrepreneurship Department of Electrical and Computer Engineering University of California, Davis office: Kemper Engineering Building (Engineering II) Room 3175 (map) postal: Electrical and Computer Engineering, University of California, One Shields Avenue, Davis, CA 95616-5294 email: [please enable JavaScript to see email address]   twitter: @jowens   github: jowens   keybase: jowens web: http://www.ece.ucdavis.edu/~jowens/ office phone: 530-754-4289 fax: 530-752-8428 Navigate home ECE homepage travel calendar schedule teaching research publications › h-index › Google Scholar advice common errors bibliography errors applying CV (PDF) Welcome to the homepage of Professor John Owens of the Department of Electrical and Computer Engineering at the University of California, Davis. Affiliations Department of Electrical and Computer Engineering and those faculty in Computer Engineering Graduate Groups of Electrical and Computer Engineering and Computer Science. Visiting Scientist at Lawrence Berkeley National Laboratory (Future Technologies Group) Research I am interested in broad topics in the field of computer systems, in particular those that use innovative hardware and software working together to solve challenging engineering problems. I am particularly interested in parallel computing, both hardware and software, and my most significant work is leading research projects in GPU computing/GPGPU/graphics hardware. Our largest current project is our GPU graph analytics system, Gunrock. If you are interested in applying to Davis and doing research with our group, and are thinking about contacting me, please read this first. My publication list (h index, Google Scholar citation list) is available online. I've assembled some Advice to Graduate Students and Researchers and a list of Common Errors In Technical Writing (many of which are LaTeX specific). Teaching In 2021–22, I expect to teach a new graduate course (EEC 289Q) on “Performance Engineering of Software Systems” in fall 2021 and the undergraduate computer architecture course (EEC 170) in winter 2022. I am looking forward to getting back to the classroom! More information on my courses can be found on my out-of-date teaching page. In 2013, I launched a Udacity (online) course on parallel computing, which I cotaught with David Luebke. To date this course has enrolled over 82,000 students. Funding We are grateful to our funding agencies for making our research possible. Thanks to the DARPA XDATA program, the SciDAC Institute for Ultrascale Visualization, the Department of Energy's Early Career Principal Investigator Award, the National Science Foundation, the Intel Science and Technology Center for Visual Computing, the UC Laboratory Fees Research Program, Los Alamos National Laboratory, Sandia National Laboratory, the HP Labs Innovation Research Program, and UC MICRO for their support, and thanks also to our industrial supporters: NVIDIA, BMW, Intel, AMD, Adobe, Hewlett-Packard, Microsoft, Rambus, ChevronTexaco, and Lockheed-Martin. Contacting Me The best way to contact me is almost certainly through email. My travel calendar and weekly schedule may be of use in reaching me in person. Biography I am currently a professor of electrical and computer engineering at the University of California, Davis. I began my appointment at Davis in January 2003, was promoted to associate professor on 1 July 2008, and was promoted to professor on 1 July 2014. I earned my Ph.D. in November 2002 in the Computer Systems Laboratory, Department of Electrical Engineering, Stanford University. At Stanford I was a member of the Concurrent VLSI Architecture Group and the Computer Graphics Laboratory. I was an architect of the Imagine Stream Processor, working closely with the Imagine team and my advisor, Bill Dally. My dissertation research explored polygon rendering on stream architectures such as Imagine. My CV (with publication list) can be found here (pdf). I earned my B.S. in Electrical Engineering and Computer Sciences at the University of California, Berkeley in 1995. Go Bears! My Erdős number is 3 (Erdős to Joel Spencer to Michael Mitzenmacher to me, and also Erdős to Peter Winkler to Joe Kniss to me). I also appeared in the documentary Ivory Tower, with an actor credit, with my boss, Governor Jerry Brown, who appeared in The Last Party with William (“Billy”) Baldwin, who was in Flatliners with the one and only Kevin Bacon. Documentaries aren't quite kosher for a real Bacon number, so I'm still going to work on an non-documentary actor credit, but it's at least a quasi-Erdős-Bacon number of 6. My offer still stands: anyone who can get me in a movie with Kevin Bacon can join me as an author on the paper of your choice*. I also occasionally officiate weddings (and look good) upon request. *: To promotion and tenure committees: Not a serious offer†. †: To Hollywood producers: Yes it is. Last updated .",
  "content_length": 5035,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:33"
}