{
  "name": "John van de Wetering",
  "homepage": "https://vdwetering.name",
  "status": "success",
  "content": "John van de Wetering Homepage Dr. John van de Wetering Assistant Professor Theoretical Computer Science Informatics Institute University of Amsterdam LAB42, Science Park 900 1098XH Amsterdam, The Netherlands Email: You can find me on Google Scholar, arXiv, github and ORCID. Here's my CV. EXPAND ALL SECTIONS COLLAPSE ALL SECTIONS Introduction I am an assistant professor at the Theoretical Computer Science group of the Informatics Institute of the University of Amsterdam, working together with the QuSoft research center. I wrote a book! Picturing Quantum Software, co-written with Aleks Kissinger, is now available for free as a pre-print, and teaches you everything you need to know about quantum compilation and the ZX-calculus. I am currently looking for a PhD student! You can apply here. If you are still doing your Bachelors, consider applying to our Master programme in Quantum Computer Science at the UvA! If you are (or know) an interested Bachelor student looking for a world-class education in quantum computing, check it out. My research focuses on two areas. The first is the usage of diagrammatic techniques in quantum computation. In particular, figuring out how the ZX-calculus can be used to improve our reasoning about quantum processes in order to do better quantum circuit optimisation, classical simulation and verification. I am cocreator of the open source optimising quantum compiler PyZX, a Python tool for using the ZX-calculus on quantum circuits. Check out my review article on the ZX-calculus if you want to learn more. My second area of research is in quantum foundations where I try to better understand the nature of quantum mechanics through algebraic and compositional methods. The guiding question here is why nature is described by the laws of quantum mechanics. I try to answer this question by showing that certain natural assumptions or restrictions on physical theories automatically lead one down the path of quantum theory. Publications Publications and Preprints All Selected papers Quantum computation Quantum foundations ZX-calculus ZH-calculus Optimisation Simulation Completeness Reconstructions Jordan algebras Effect algebras Qudits Optimal compilation of parametrised quantum circuitsJohn van de Wetering, Richie Yeung, Tuomas Laakkonen and Aleks Kissinger, Quantum 9 (2025)Show abstract ⇲ video 🎥Parametrised quantum circuits contain phase gates whose phase is determined by a classical algorithm prior to running the circuit on a quantum device. Such circuits are used in variational algorithms like QAOA and VQE. In order for these algorithms to be as efficient as possible it is important that we use the fewest number of parameters. We show that, while the general problem of minimising the number of parameters is NP-hard, when we restrict to circuits that are Clifford apart from parametrised phase gates and where each parameter is used just once, we can efficiently find the optimal parameter count. We show that when parameter transformations are required to be sufficiently well-behaved that the only rewrites that reduce parameters correspond to simple 'fusions'. Using this we find that a previous circuit optimisation strategy by some of the authors [Kissinger, van de Wetering. PRA (2019)] finds the optimal number of parameters. Our proof uses the ZX-calculus. We also prove that the standard rewrite rules of the ZX-calculus suffice to prove any equality between parametrised Clifford circuits. A Complete and Natural Rule Set for Multi-Qutrit Clifford CircuitsSarah Meng Li, Michele Mosca, Neil J. Ross, John van de Wetering and Yuming Zhao, Proceedings of the 22nd International Conference on Quantum Physics and Logic, Varna, Bulgaria, 14 July 2025 - 18 July 2025 pp. 23-78 (2025)Show abstract ⇲ We present a complete set of rewrite rules for n-qutrit Clifford circuits where n is any non-negative integer. This is the first completeness result for any fragment of quantum circuits in odd prime dimensions. We first generalize Selinger's normal form for n-qubit Clifford circuits to the qutrit setting. Then, we present a rewrite system by which any Clifford circuit can be reduced to this normal form. We then simplify the rewrite rules in this procedure to a small natural set of rules, giving a clean presentation of the group of qutrit Clifford unitaries in terms of generators and relations. Quantum Circuit Optimization with AlphaTensorFrancisco JR Ruiz, Tuomas Laakkonen, Johannes Bausch, Matej Balog, Mohammadamin Barekatain, Francisco JH Heras, Alexander Novikov, Nathan Fitzpatrick, Bernardino Romera-Paredes, John van de Wetering, Alhussein Fawzi, Konstantinos Meichanetzidis and Pushmeet Kohli, Nature Machine Intelligence (2025)Show abstract ⇲ A key challenge in realizing fault-tolerant quantum computers is circuit optimization. Focusing on the most expensive gates in fault-tolerant quantum computation (namely, the T gates), we address the problem of T-count optimization, i.e., minimizing the number of T gates that are needed to implement a given circuit. To achieve this, we develop AlphaTensor-Quantum, a method based on deep reinforcement learning that exploits the relationship between optimizing T-count and tensor decomposition. Unlike existing methods for T-count optimization, AlphaTensor-Quantum can incorporate domain-specific knowledge about quantum computation and leverage gadgets, which significantly reduces the T-count of the optimized circuits. AlphaTensor-Quantum outperforms the existing methods for T-count optimization on a set of arithmetic benchmarks (even when compared without making use of gadgets). Remarkably, it discovers an efficient algorithm akin to Karatsuba's method for multiplication in finite fields. AlphaTensor-Quantum also finds the best human-designed solutions for relevant arithmetic computations used in Shor's algorithm and for quantum chemistry simulation, thus demonstrating it can save hundreds of hours of research by optimizing relevant quantum circuits in a fully automated way. Classically simulating intermediate-scale instantaneous quantum polynomial circuits through a random graph approachJulien Codsi and John van de Wetering, Physical Review A 111(1) (2025)Show abstract ⇲ Quantum Supremacy is a demonstration of a computation by a quantum computer that can not be performed by the best classical computer in a reasonable time. A well-studied approach to demonstrating this on near-term quantum computers is to use random circuit sampling. It has been suggested that a good candidate for demonstrating quantum supremacy with random circuit sampling is to use \\emph{IQP circuits}. These are quantum circuits where the unitary it implements is diagonal. In this paper we introduce improved techniques for classically simulating random IQP circuits. We find a simple algorithm to calculate an amplitude of an \\(n\\)-qubit IQP circuit with dense random two-qubit interactions in time \\(O(\\frac{\\log^2 n}{n} 2^n )\\), which for sparse circuits (where each qubit interacts with \\(O(\\log n)\\) other qubits) runs in \\(o(2^n/\\text{poly}(n))\\) for any given polynomial. Using a more complicated stabiliser decomposition approach we improve the algorithm for dense circuits to \\(O\\left(\\frac{(\\log n)^{4-\\beta}}{n^{2-\\beta}} 2^n \\right)\\) where \\(\\beta \\approx 0.396\\). We benchmarked our algorithm and found that we can simulate up to 50-qubit circuits in a couple of minutes on a laptop. We estimate that 70-qubit circuits are within reach for a large computing cluster. Optimising quantum circuits is generally hardJohn van de Wetering and Matt Amy, arXiv preprint arXiv:2310.05958 (2024)Show abstract ⇲ video 🎥In order for quantum computations to be done as efficiently as possible it is important to optimise the number of gates used in the underlying quantum circuits. In this paper we find that many gate optimisation problems for approximately universal quantum circuits are NP-hard. In particular, we show that optimising the T-count or T-depth in Clifford+T circuits, which are important metrics for the computational cost of executing fault-tolerant quantum computations, is NP-hard by reducing the problem to Boolean satisfiability. With a similar argument we show that optimising the number of CNOT gates or Hadamard gates in a Clifford+T circuit is also NP-hard. Again varying the same argument we also establish the hardness of optimising the number of Toffoli gates in a reversible classical circuit. We find an upper bound to the problems of T-count and Toffoli-count of \\(\\text{NP}^{\\text{NQP}}\\). Finally, we also show that for any non-Clifford gate \\(G\\) it is NP-hard to optimise the \\(G\\)-count over the Clifford+\\(G\\) gate set, where we only have to match the target unitary within some small distance in the operator norm. Exact Synthesis of Multiqutrit Clifford-Cyclotomic CircuitsAndrew N. Glaudell, Neil J. Ross, John van de Wetering and Lia Yeh, Proceedings of the 21st International Conference on Quantum Physics and Logic, Buenos Aires, Argentina, July 15-19, 2024 pp. 44-62 (2024)Show abstract ⇲ It is known that the matrices that can be exactly represented by a multiqubit circuit over the Toffoli+Hadamard, Clifford+\\(T\\), or, more generally, Clifford-cyclotomic gate set are precisely the unitary matrices with entries in the ring \\(\\mathbb{Z}[1/2, \\zeta_k]\\), where \\(k\\) is a positive integer that depends on the gate set and \\(\\zeta_k\\) is a primitive \\(2^k\\)-th root of unity. In the present paper, we establish an analogous correspondence for qutrits. We define the multiqutrit Clifford-cyclotomic gate set of degree \\(3^k\\) by extending the classical qutrit gates \\(X\\), \\(CX\\), and \\(CCX\\) with the Hadamard gate \\(H\\) and the \\(T_k\\) gate \\(T_k=\\mathrm{diag}(1,\\omega_k, \\omega_k^2)\\), where \\(\\omega_k\\) is a primitive \\(3^k\\)-th root of unity. This gate set is equivalent to the qutrit Toffoli+Hadamard gate set when \\(k=1\\), and to the qutrit Clifford+\\(T_k\\) gate set when \\(k>1\\). We then prove that a \\(3^n\\times 3",
  "content_length": 70370,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:17"
}