{
  "name": "John R. Rose",
  "homepage": "http://www.cse.sc.edu/~rose",
  "status": "success",
  "content": "Home page for John R. Rose John R. Rose, Professor Department of Computer Science and Engineering University of South Carolina Columbia, SC 29208 Storey Engineering and Inovation Center, RM 2257 rose@cse.sc.edu 803-777-2405(voice) 803-777-3767(fax) Office hours: 3:30-5:00 TW Education BMus: Music, Immaculate Heart College, 1980 MS: Computer Science, SUNY at Stony Brook, 1989 PhD: Computer Science, SUNY at Stony Brook, 1991 Spring 2024 Courses: CSCE/STAT 587: Big Data Analytics All lectures and class material for CSCE/STAT 587 are being provided on Microsoft Teams If you are registered for the course, you will have been added to your section's Team. CSCE/STAT 594: Strategic Management of Information Systems All lectures and class material for CSCE 594 are being provided on Microsoft Teams If you are registered for the course, you will have been added to your section's Team. Research Interests: Bioinformatics Pattern Recognition Biological Databases Distributed Artificial Intelligence and Multiagent Systems Data Fusion Knowledge Discovery in Databases Computational Chemistry I am a professor of computer science in the Department of Computer Science and Engineering at the University of South Carolina. Prior to this position, I was a postdoctoral fellow at the Laboratory for Computational Chemistry at the Technical University of Munich. Before that, I labored as a research assistant in data mining in chemical reaction databases at SUNY-Stony Brook. I am currently a member of IEEE. I am the author of over 60 technical papers, and book chapters in bioinformatics, machine intelligence, and computational science. My research interests are in the areas of bioinformatics, normative reasoning and planning, DAI and multiagent systems, and computational chemistry. I have conducted research funded by NSF, NIH, NASA, DOD/ONR, Alexander von Humboldt Foundation, BMFT (German NSF equivalent), as well as the South Carolina Commission on Higher Education. I have been a NASA Institute for Advanced Concepts (NIAC) Fellow. I was formerly the Director of the SC INBRE Bioinformatics Core. A major focus of my research group is de novo peptide sequencing. Selected Publications A. V. Kish, J. R. Rose, C. Farkas, Efficient Partitioning and Allocation of Data for Workload Queries, in Proc. of The 9th Annual International Joint Conferences on Computer, Information, Systems Sciences, & Engineering (CISSE) E-Conference, December, 2013. J. Cleveland, J.R. Rose, Identification of b-/y-ions in MS/MS Spectra Using a Two Stage Neural Network, Proteome Science 2013, 11(Suppl 1):S4 doi:10.1186/1477-5956-11-S1-S4. Epub 2013 Nov 7. A. El Allali, J.R. Rose, MGC: A Metagenomic Gene Caller, BMC Bioinformatics, 14 Suppl 9:S6. doi: 10.1186/1471-2105-14-S9-S6. Epub 2013 Jun 28. J. Cleveland, J.R. Rose, A Neural Network Approach to the Identi?cation of b-/y-ions in MS/MS Spectra. Proceedings of the 6th IEEE International Conference on Bioinformatics and Biomedicine (BIBM 2012) 2012:588-592. MGC: Gene calling in metagenomic sequences,  (with A. El Allali) 8th International Symposium on Bioinformatics Research and Applications, Dallas, ISBRA 2012 Short Abstracts pp. 55-58. A Neural Network Approach to Pre-filtering MS/MS spectra, (with J. Cleveland) 8th International Symposium on Bioinformatics Research and Applications, Dallas, TX. ISBRA 2012 Short Abstracts pp. 82-84. Speciation of coagulase negative staphylococci, isolated from indoor air, using SDS page gel bands of expressed proteins followed by MALDI TOF MS and MALDI TOF-TOF MS-MS analysis of tryptic peptides.(with K. Fox, A. Fox, and M. Walla) J. Micro. Meth. 84:243-250. 2011. An Information Theoretic Approach to Rescoring Peptides Produced by De Novo Peptide Sequencing, (with J. Cleveland) in Proceedings of the ICBCB 2010 : International Conference on Bioinformatics and Computational Biology, Paris, World Academy of Science, Engineering and Technology 71:2010, pp. 265270. Mim: A Species Independent Approach For Classifying Coding And Non-coding Dna Sequences In Bacterial And Archaeal Genomes, (with A. El Allali) in Proceedings of the ICBCB 2010 : International Conference on Bioinformatics and Computational Biology, Paris, edited by C. Ardil, World Academy of Science, Engineering and Technology 71:2010, pp. 136143. Mutual Information Measure for Distinguishing Coding and Non-Coding DNA Sequences, (with A. El Allali) BIOCOMP08, 2008. Evidence for Protein Fragment Homology in Viral Genome Types,(with R. Mukhopadhyay)  Proceedings of BIOCOMP06, 2006, pp 82-85 Gene Family Content-Based Phylogeny of Prokaryotes: the Effect of Criteria for Inferring Homology, (with A.L. Hughes, V. Ekollu, and R. Friedman) Systematic Biology, 54(2):268-276, 2005. Exploiting Belief Locality in Run-Time Decision-Theoretic Planners, (with W.H. Turkett) FLAIRS-2005 (May 15-17, 2005). Correlation of Amino Acid Preference and Mammalian Viral Genome Type, (with W.H. Turkett, I.C. Oroian, W.W. Laegreid, J. Keele ) Bioinformatics 21: 1349-1357, 2005. Dblox: a genome-wide test for ancient segmental duplication, (with R. Friedman,  V. Ekollu,and  A.L. Hughes, ) Bioinformatics, 2004,  bth275. Social Organization in a Software Agent Community with a Non-zero-Sum Game Interaction Model, in Regulated Agent-Based Social Systems, (with M. Vanninen) G. Lindemann, D. Moldt, M. Paolucci (Eds.) LNAI 2934, Springer-Verlag, Berlin Heidelberg, 2004, pp 176-188. \"Non-Random Association of Transposable Elements with Duplicated Genomic Blocks in Arabidopsis thaliana\" (with A. Hughes, R. Friedman, and V. Ekollu) A. Hughes) Molecular Phylogenetics and Evolution, 29 pp 410-416, 2003. \"Machine Learning in Chemistry,\" in Chemoinformatics  From Data to Knowledge, Gasteiger, Engel (Eds.), Wiley-VCH, Weinheim, Germany Volume 3, pp1082-1097, Wiley-VCH, Weinheim, Germany, 2003. An Evaluation of Philosophical Agent Architectures  for Mission Robustness,, in Innovative Concepts for Agent-Based Systems, (with W. Turkett, M. Huhns, S. Roy)  W. Truszkowski, C. Rouff, M. Hinchey (Eds.) LNAI 2564, Springer-Verlag, Berlin Heidelberg, 2003, pp.201-214. Planning with Agents: An Efficient Approach Using Hierarchical Dynamic Decision Networks, ( with W. H. Turkett) Fourth International Workshop: Engineering Societies in the Agents Worls (ESAW03), A. Omicini, P Petta, J. Pitts (Eds.), London, UK, 2003,  pp195-202. Integrating Organizational Knowledge for Dynamic Scalable Multiagent Systems (with W. A. Smith) IEEE KIMAS: Integration of Knowledge Intensive Multi-Agent Systems, Henry Hexmoor, editor, IEEE, 2003, p. 184-189. Parallel Algorithms for Bayesian Phylogenetic Inference (with X. Feng, D. Buell, and P. Waddell) Journal of Parallel and Distributed Computing63, pp 707-718, 2003. \"Massive Deliberation.\" (with W. Turkett and M. Huhns) IEEE Internet Computing, Vol. 7, No. 1, pp. 72-75, 2003. \"Emergent Planning with Philosophical Agents\" (with W. Turkett) in Proceedings of the 3rd International Nasa Workshop on Planning and Scheduling for Space, Houston, Texas, Oct. 27-29, 2002. \"An Agent Architecture for Long-Term Robustness\" (with M. Huhns, S. Roy, and W. Turkett) in Proceedings First International Joint Conference on Autonomous Agents and Multiagent Systems (AAMAS), Bologna, Italy, July 15-19, pp. 1149-1156, 2002. \"Social Organization in a Software Agent Community with a Non-Zero-Sum Game Interaction Model\" (with M Vanninen) in Proceedings of International Workshop on Regulated Agent-Based Social Systems: Theories and Applications (RASTA'02), Bologna, Italy, July 16, 2002. \"An Agent Architecture for Comprehensive Mission Robustness\" (with M. Huhns) in Proceedings of the Goddard/JPL Workshop on Radical Agent Concepts`, Tyson's Corner, VA, Section IV, pp. 1-2, January 2002. ` \"Philosophical Agents\" (with M. Huhns) IEEE Internet Computing, Vol. 5, No. 3, 2001, pp. 104-106. \"An Information Model for the Representation of Multiple Biological Classifications\" (with Neville Yoon) In: Alexandrov VN, Dongarra JJ, Juliano BA, Renner RS, Tan CJK, editors. Computational Science - ICCS 2001: International Conference, San Francisco, CA, USA, May 2001 Proceesings, Part 1. New York:Springer. pp 937-946. \"A Biologically-Motivated Approach to Direction Sensitive Velocity-Tuned Motion Detectors\" (with Dudley Girard) Proceedings of SCI2000/ISAS2000, Orlando, Florida, 2000, Vol. 6, pp. 173-178. \" Neural Systems for Motion Analysis: Single Neuron and Network Approaches\" (with Terry Huntsberger and Dudley Girard) in S.K. Pal, A. Gosh, M.K. Kundu (Eds.), Soft Computing for Image Processing. Physica-Verlag, 2000. \"Behavior-based Control for Autonomous Mobile Robots\" (with Terry Huntsberger) Proceedings of Robotics 2000 Conference Albuquerque, New Mexico, 2000, pp. 299-305. \"A Distributed Agent Environment System for Simulating a Naive Sensor/Emitter Model\" Proceedings of the 1999 Summer Computer Simulation Conference (SCSC 31), 1999, pp. 359-363. \"Integrated Vision/Control System for Autonomous Planetary Rovers\" (with Terry Hunstberger and Toshiro Kubota) IAPR Workshop on Machine Vision (MVA '98) , Nov. 17-19, 1998, pp 34-37. \"Machine Learning Techniques in Chemistry\" Encyclopedia of Computational Chemistry Paul von Rague Schleyer, Editor (John Wiley & Sons, Ltd.), 1998. \"BISMARC: a biologically inspired system for map-based autonomous rover control\" (with Terry Huntsberger) Neural Networks, Vol. 11, 1998, pp. 1497-1510. \"Fuzzy-Face: A Hybrid Wavelet/Fuzzy Self-Organizing Feature Map System for Face Processing\" (with Terry Huntsberger and Shashidhar Ramaka) Journal of Biological Systems, Vol. 6, No. 3, 1998, pp. 281-298. \"Characterization of a Reaction Database in Terms of a Lower Bound on the Number of Reaction Classes\" (with Rakesh Goyal) Foundation of Computing and Decision Sciences, Vol. 22, No. 2, 1997, pp. 59-68. \"Computer Simulations of Bimodal Neurons and Networks: Integrating Infrared and Visual Stimuli\" (with Terry Huntsberger) in Computer mode",
  "content_length": 13354,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:05"
}