{
  "name": "John C. Duchi",
  "homepage": "https://web.stanford.edu/~jduchi",
  "status": "success",
  "content": "John Duchi John Duchi Home Group Books Publications Teaching Contact information Curriculum vitae John Duchi John Duchi, Stanford University John C. Duchi Associate Professor Statistics Electrical Engineering Stanford University (highres photo) Biography John Duchi is an associate professor of Statistics and Electrical Engineering at Stanford University. His work spans statistical learning, optimization, information theory, and computation, with a few driving goals. (1) To discover statistical learning procedures that optimally trade between real-world resources — computation, communication, privacy provided to study participants — while maintaining statistical efficiency. (2) To build efficient large-scale optimization methods that address the spectrum of optimization, machine learning, and data analysis problems we face, allowing us to move beyond bespoke solutions to methods that robustly work. (3) To develop tools to assess and guarantee the validity of — and confidence we should have in — machine-learned systems. He has won several awards and fellowships. His paper awards include the SIAM SIGEST award for “an outstanding paper of general interest” and best papers at the Neural Information Processing Systems conference, the International Conference on Machine Learning, the International Conference on Learning Theory, and an INFORMS Applied Probability Society Best Student Paper Award (as advisor). He has also received the Society for Industrial and Applied Mathematics (SIAM) Early Career Prize in Optimization, an Office of Naval Research (ONR) Young Investigator Award, an NSF CAREER award, a Sloan Fellowship in Mathematics, the Okawa Foundation Award, the Association for Computing Machinery (ACM) Doctoral Dissertation Award (honorable mention), and U.C. Berkeley's C.V. Ramamoorthy Distinguished Research Award. He has graduated dozens of PhD students who have gone to careers in academia (Columbia University, ETH Zurich, Northwestern University, Stanford University, Tel Aviv University, University of Illnois), technology (e.g., Amazon, Apple, Google, Safe Super Intelligence), and finance. Page generated 2025-07-07 12:14:20 PDT, by jemdoc+MathJax.",
  "content_length": 2186,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:28"
}