{
  "name": "John Hale",
  "homepage": "https://faculty.utulsa.edu/faculty/john-hale",
  "status": "success",
  "content": "The University of Tulsa Skip to main content × Close Menu Academics Back to Academics Academics Overview Explore Programs Explore Programs All Programs Undergraduate Graduate Professional Studies Online Programs Colleges & Schools Colleges & Schools Arts & Sciences Business Engineering & Computer Science Health & Natural Sciences Law Graduate School Honors College Online Programs Beyond the Classroom Beyond the Classroom Jumpstart UTulsa Global Engagement Special Programs Student Research Opportunities Academic Support Academic Support Academic Advising & Enrollment Pathfinders Program Tutoring Services Academic Resources Academic Resources Academic Calendar Bulletins Undergraduate Bulletin Graduate Bulletin Law Bulletin Study Resources & Centers Academic Journals & Publications McFarlin Library Faculty Directory Request Info Apply Research Back to Research Research Overview Research Opportunities Research Opportunities Popular Research Programs Research Projects Research Colloquium Tulsa Undergraduate Research Challenge (TURC) Support & Services Support & Services Office of Research Office of Technology Commercialization Research Compliance & Training Research News Contact Research Office About Back to About Why The University of Tulsa Who We Are Who We Are About TU Strategic Plan Points of Pride UTulsa Fast Facts History & Traditions Leadership & Faculty Leadership & Faculty Office of the President Provost Executive Staff Faculty Directory Board of Trustees Working at TU Offices Directory Contact Us TU News Student Life Back to Student Life Student Life Overview Campus Living Campus Living Living on Campus Housing Residence Hall Life Apartment Life Parking Dining Facilities Facilities Student Union Bookstore Fitness Center More Facilities Clubs & Organizations Clubs & Organizations Student Organization Directory Student Government Association Student Activities Sorority & Fraternity Life Esports & Gaming Lounge Office for Resilience and Belonging Wellness & Support Wellness & Support Counseling Services Hurricane Health Center Fitness & Recreation Nutrition CaneCares Student Coaching Groups Student Accessibility D-CARES Campus Security Sexual Violence Prevention & Education Title IX Student Success Student Success Office of Student Engagement CaneCareers Tutoring Services Resources & Guides Resources & Guides Student Resource Guides Student Policies & Procedures Tuition & Aid Back to Tuition & Aid Funding Your Education Tuition & Costs Tuition & Costs Tuition & Costs Net Price Calculator Financial Aid Financial Aid Financial Aid Process Financial Aid FAQs Summer Session Aid Study Abroad Aid Other Funding Options Other Funding Options Scholarships Assistantships & Fellowships Student Employment Grants Loans Counseling & Support Admissions Back to Admissions TU Admissions Apply Apply Undergraduate Admission Graduate Admission Law Admission International Admission Online Programs Visit Visit Visit Campus Virtual Tour Video Tours Campus Maps Explore the City of Tulsa Counselors & Support Counselors & Support Undergraduate Admission Counselors Graduate Program Advisers Information for Prospective Parents Request Information Why TU Alumni Back to Alumni Alumni Home Alumni Giving Athletics Back to Athletics Athletics Home Tickets News Events Back to Events Events Calendar Submit an Event Make a Gift Back to Make a Gift Giving Opportunities Ways to Give Minds. Momentum. Mission. Campaign ×Close Menu Submit Filter Results Search within... Collins College of Business College of Engineering & Natural Sciences College of Law Graduate School Kendall College of Arts & Sciences Oxley College of Health Sciences × Close Menu Prospective Students Prospective Students Current Students Parents & Families Alumni & Friends Faculty & Staff Community & Fans More Admission Info Why UTulsa Research Opportunities Virtual Tour Explore the City of Tulsa Explore Programs Visit Apply Business, cyber security undergrads named 2025 Gilman Scholars The University of Tulsa is proud to announce two recent recipients of Benjamin A. Gilman International Scholarships: Eden Knepper and Ayden Whittaker. Each year, the U.S. Department of State awards the nationally competitive Gilman awards... More Student Info Course Bulletin IT Help Research Opportunities Student Orgs Student Hub Housing Portal Academic Calendar Cultivating cultural conversations: Meet UTulsa’s Professor Lansana Quraysh Ali Lansana, applied associate professor of English & creative writing, is a distinguished scholar of African American studies, journalist and author of 23 books including poetry, nonfiction and children’s literature. His journey as a writer led him from Enid, Oklahoma, to studying and teaching in cities like Chicago and New York. However, after 30 […] More Family Info About UTulsa UTulsa Leadership & Faculty Explore the City of Tulsa UTulsa Merchandise & Gifts Resources for Parents & Families Parent & Family Portal Get Involved New alumnus offered elite IBM cybersecurity position months before graduation Serving nontraditional students, such as military veterans, is nothing new at The University of Tulsa, and Don Cowan’s success is a prime example of how students from all backgrounds thrive on campus. Humble and soft-spoken, Cowan (B.S. ’25) graduated from Owasso High School and served eight years as a U.S. Marine before returning to Tulsa […] More Alumni Info Alumni Benefits Request Transcripts TU Merchandise & Gifts TU Alumni Association TU Alumni Events Kendall College welcomes television and film writer Taylor Chukwu to Board of Visitors The University of Tulsa Kendall College of Arts & Sciences has welcomed alumna Taylor Chukwu as the newest member of its Board of Visitors. More Employee Info Employee Benefits IT Help Applications Directory Hurricane Hub Employment Opportunities Seagraves leads national charge in AI-powered real estate innovation UTulsa assistant professor Cayman Seagraves is leading the charge toward integrating AI into the real estate and finance sectors. More Community Info TU Athletics 101 Archer Gilcrease Museum Tulsa Mayfest Calendar of Events Campus Maps Life Long Learning Mellon Foundation grants $677,000 for new UTulsa, Muscogee (Creek) Nation project UTulsa has received a $677,000 grant from the Public Knowledge program of the Mellon Foundation to support a joint effort between the university and the Muscogee (Creek) Nation’s Historic and Cultural Preservation Department. Stand out. Belong. Toggle Playback Info For... Prospective Students Current Students Parents & Families Alumni & Friends Faculty & Staff Community & Fans Explore Degrees Find your passion Submit Undergraduate Majors Graduate Programs Law School Online Programs Tomorrow begins today MINDS. MOMENTUM. MISSION. For more than 130 years, The University of Tulsa has been a proving ground for the best and brightest minds — providing a launchpad for lives of promise and a catalyst for community. Anchored in our history and reaching for tomorrow, we set our focus on the heart of our university: Our students. In the campaign for TU’s tomorrow, we are investing in the minds that shape our future, giving them the momentum to excel and empowering them to pursue a mission that matters. Learn How You Can Help SUPPORT. SERVICE. SUCCESS. Job Placement Advising & Coaching Student Life Financial Aid Mentoring Health & Wellness UTulsa is so confident in its outcomes, they're guaranteed. The Center for Career Development, aka CaneCareers, provides extensive job preparation for students throughout their academic journeys. UTulsa's job placement guarantee promises that students who follow the program will land an entry-level job in their chosen field or continue their education within six months of graduation or we'll give them a free semester of grad school. Job Placement Guarantee CaneCareers We're here to empower students to reach their full potential. Our team of success coaches will help you maximize your opportunities by assisting with degree planning, connecting you to resources and keeping you on track for graduation. From getting enrolled in your first class to finding a free tutor, this is square one. Student Success Coaches advising & enrollment What's it like to be a UTulsa undergraduate? Whatever you make it! Our attentive staff is here to make your move to college life as easy (and fun!) as possible. We have a beautiful campus, amazing amenities and hundreds of opportunities to connect. Our students are friendly, inclusive and hail from 45 states and Washington, D.C. And our graduate and law students enjoy the same level of welcoming support. New Student Programs Student Orgs Scholarships and support come from many sources. Paying for college involves a partnership between our students, their families and the university. Student Financial Services carefully examines each student's unique circumstances and offers the best package of support possible. We are proud to offer a wide range of scholarships and financial aid options to help students on their journeys! Tuition & Costs Financial Aid Seeking advice? Need a boost? Questions, meet answers. Whether it's pairing undergraduates with upperclassmen who can light the way, chatting with approachable professors who are invested in students' academic achievement, or matching soon-to-be graduates with connected alumni in their chosen field, UTulsa's extensive mentoring network is there to lend a helping hand. Peer Mentors UTulsaConnect UTulsa supports the whole student - physically, mentally and emotionally. Hurricane Health Center treats minor illnesses and injuries in a traditional medical setting, and UTulsa's Counseling and Psychological Services provides resources to assist students as they adjust to college life. Across campus, Collins Fitness Center is a great place to get or stay in shape, and Campus Recreation offers sports and activities to keep students moving! Counseling and Psychological Services Hurricane Health Dis",
  "content_length": 12515,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:42"
}