{
  "name": "John Bustard",
  "homepage": "https://pure.qub.ac.uk/en/persons/john-bustard",
  "status": "success",
  "content": "John Bustard - Queen's University Belfast View Scopus Profile John Bustard Dr Lecturer (Education), School of Electronics, Electrical Engineering and Computer ScienceCentre for Education and Society (CES) Emailj.bustardqub.acuk 20082025 Research activity per year Personal profile Fingerprint Dive into the research topics where John Bustard is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Biometrics Computer Science 100% Algorithms Computer Science 43% Spoofing Attack Computer Science 42% Attack Computer Science 40% Identity Social Sciences 32% Biometric System Computer Science 26% Evaluation Computer Science 26% Design Computer Science 26% View full fingerprint Projects Projects per year 2015 2015 2022 1 Finished Projects per year R1518ECI: CSIT 2 - EPSRC / TSBO'Neill, M. (PI), Bustard, J. (CoI), Cao, X. (CoI), Farshim, P. (CoI), Kurugollu, F. (CoI), Liu, W. (CoI), McCanny, J. V. (CoI), McLaughlin, K. (CoI), Miller, P. (CoI), O'Kane, P. (CoI), O'Sullivan, E. (CoI) & Sezer, S. (CoI)23/03/2015 → 31/07/2022Project: Research Android 100% Malware Detection 100% Malware 66% Evasion Technique 33% Android Application 33% Research output Research output per year 2008 2010 2013 2014 2015 2020 2023 2025 2025 14 Conference contribution 6 Article 2 Chapter 2 Abstract 1 More 1 Paper Research output per year Research output per year A data science course utilizing genAIBrowning, J. W., Bustard, J., Anderson, N. & Galway, L., 26 Feb 2025, IEEE Frontiers in Education Conference (FIE 2024): proceedings. Institute of Electrical and Electronics Engineers Inc., 7 p. ( IEEE FIE Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Data Science 100% Artificial Intelligence 100% Science Education 15% Student Projects 15% Decision Making 15% 2 Citations (Scopus) 35 Downloads (Pure) ASTRO: a semi-automated grading and feedback system for programming assignmentsBrowning, J., Bustard, J. & Anderson, N., 01 Jun 2025, (Accepted) 2025 IEEE Frontiers in Education Conference (FIE): Proceedings. Institute of Electrical and Electronics Engineers Inc., 8 p. (IEEE Frontiers in Education Conference (FIE): Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Abstract Syntax Tree 100% Static Program Analysis 9% Static Code Analysis 9% Design Implementation 9% Individual Student 9% Evaluating the impact of unrestricted genAI usage on experiential-based learningBrowning, J. W., Bustard, J., Anderson, N. & Galway, L., 20 Mar 2025, IEEE 13th International Conference on Engineering Education (ICEED 2024): Proceedings. Institute of Electrical and Electronics Engineers Inc., 6 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Learning Course 100% Team Member 100% Critical Reflection 100% Academic Year 100% Peer Assessment 100% 11 Downloads (Pure) Queering software engineering education: integrative approaches and student experiencesBrowning, J. W., Bustard, J. & Anderson, N., 16 Jan 2025, 2024 21st International Conference on Information Technology Based Higher Education and Training (ITHET): proceedings. Institute of Electrical and Electronics Engineers Inc., 8 p. (ITHET Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution Open AccessFile Student Experience 100% Engineering Education 100% LGBTQIA+ 100% Pedagogical Practice 16% Systematic Review 16% 45 Downloads (Pure) A systematic literature review of entrepreneurial education in electrical, electronic, and computer engineering curriculaBrowning, J. W. & Bustard, J., 10 Jan 2024, In: IEEE Access. 12, p. 7927 - 7941 15 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Education 100% Curriculum 100% Electronic Engineering 100% Computers 100% Entrepreneurship 100% 7 Citations (Scopus) 182 Downloads (Pure) View all 25 research outputs Activities Activities per year 2012 2012 2013 2014 2015 2018 2019 2019 5 Invited talk 2 Membership of peer review panel or committee 1 Participation in workshop, seminar, course 1 Contribution to the work of national or international committees and working groups Activities per year Inspiring and learning from the next generation to revolutionise the future of manufacturingBustard, J. (Invited speaker)13 Feb 2019Activity: Talk or presentation types › Invited talk Prototyping projects in QlabBustard, J. (Invited speaker)30 Jan 2019Activity: Talk or presentation types › Invited talk Come for the tools, stay for the people. Building a Makerspace in a UniversityBustard, J. (Invited speaker)16 Mar 2018Activity: Talk or presentation types › Invited talk Soteria Framework 7 European Union Research Project (External organisation)Bustard, J. (Chair)2015 → …Activity: Membership types › Membership of peer review panel or committee Workshop on biometric and location tracking technologies, Ethics, and Politics: Towards an inter-disciplinary research agendaBustard, J. (Organiser)23 Sept 2014Activity: Participating in or organising an event types › Participation in workshop, seminar, course View all 9 activities Press/Media Get ready to have your biometrics tracked 24/7Bustard, J.26/03/20141 item of Media coveragePress/Media: Expert Comment",
  "content_length": 5376,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:29"
}