{
  "name": "John Andrew Carroll",
  "homepage": "http://www.sussex.ac.uk/informatics/people/peoplelists/person/25069",
  "status": "success",
  "content": "John Carroll : Informatics contacts : ... : School of Engineering and Informatics : University of Sussex Cookies on our website We use some essential cookies to make this website work. We'd like to set additional cookies to understand how you use our site so we can improve it for everyone. Also, we'd like to serve you some cookies set by other services to show you relevant content. View our privacy policy. Reject all Accept all Prof John CarrollPost:Emeritus Professor (Informatics)Other posts:Professor of Computational Linguistics (Data Intensive Science Centre at the University of Sussex)Location:CHICHESTER 1 CI161Email:J.A.Carroll@sussex.ac.ukPersonal homepage:users.sussex.ac.uk/~johnca/ What is this? BiographyI retired from the University of Sussex in 2021. Previously I was Professor of Computational Linguistics (2006 onwards), and for several years was Head of the Department of Informatics. I joined the University of Sussex in 1996 on an EPSRC Advanced Research Fellowship. Before that, I studied for my bachelors degree and PhD in Computer Science at the University of Cambridge, and subsequently worked there as a research assistant on a number of national- and EU-funded projects in natural language processing (NLP). At various points in my career I have been visiting associate professor / lecturer / scholar at the Tokyo Institute of Technology, University of Paris 7, and Stanford University. Roles in service to the research community have included: secretary of EACL (the European Chapter of the ACL), president of SIGPARSE (ACL Special Interest Group on Natural Language Parsing), programme committee area chair for EACL'99, COLING'00, ACL'02 and IJCNLP'04, and general chair of ACL'07. Some career highlights have been: best paper awards at ACL'04 and IJCNLP'05, and keynote talks at TSD'10 and CICLing'12. I have published around 150 journal articles, refereed conference / workshop papers, and book chapters. I have also made major contributions to two large open source NLP software systems. RoleEmeritus Professor; formerly Professor of Computational Linguistics. Community and BusinessI co-founded and am a director of iLexIR Ltd, which has commercialised some of my research and deployed it in text mining, document classification and search applications.",
  "content_length": 2290,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:26"
}