{
  "name": "John Betts",
  "homepage": "https://research.monash.edu/en/persons/john-betts",
  "status": "success",
  "content": "John Betts - Monash University John Betts public CV View Scopus Profile John Betts Dr Senior Lecturer, Department of Data Science & AI https://orcid.org/0000-0002-2715-104X EmailJohn.Bettsmonashedu 1996 …2025 Research activity per year Personal profile BiographyJohn is a Senior Lecturer in the Faculty of Information Technology at Monash University and Course Director of the Bachelor of Information Technology. His main interests are in the areas of computational modelling, optimization and simulation. These problems are characterized by the need to understand the effect of variability on the behaviour of critical systems and allocate resources optimally.Monash teaching commitmentDr John Betts has experience as the Chief Examiner for the following units in the Faculty of IT: FIT1006 Business information analysisFIT2017 Computer models for business decision makingFIT3152 Data scienceFIT5097 Business intelligence modelling John has experience as the Lecturer for the following units in the Faculty of IT: FIT1006 Business information analysisFIT2017 Computer models for business decision makingFIT3152 Data scienceFIT5097 Business intelligence modelling Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationOperations Research, Doctor of Philosophy, Monash UniversityAward Date: 8 Mar 2003Operations Research, Graduate Diploma in Statistics / Operations Research, RMIT UniversityAward Date: 2 May 1996Mathematics, Postgraduate Diploma in Mathematics and Mathematics Education, University of MelbourneAward Date: 2 May 1992Education, Diploma in Education, Monash UniversityAward Date: 6 Jun 1984Arts, Bachelor of Arts, Monash UniversityAward Date: 20 May 1983 Research area keywordsComputational ModellingOptimisationSimulationData Science Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2017 2017 2021 2022 2023 2026 2 Finished 2 Active Projects per year Detecting Threats in Temporal NetworksStuckey, P. (Primary Chief Investigator (PCI)), Betts, J. (Chief Investigator (CI)), Wilson, C. (Partner Investigator (PI)) & Dalins, J. (Chief Investigator (CI))30/05/23 → 30/08/26Project: Research Optimising multi-item retail inventoriesBetts, J. (Primary Chief Investigator (PCI)), Stuckey, P. (Chief Investigator (CI)) & Wetenhall, P. (Partner Investigator (PI))14/09/21 → 14/09/26Project: Research MH: Mapping the scientific knowledge and approaches to defining and measuring hate crime, hate speech, and hate incidentsBetts, J. (Chief Investigator (CI))20/10/22 → 1/03/23Project: Research Biofocussed prostate cancer RadioTherapy (BiRT): A personalised approach to delivering the right dose to the right placeHaworth, A. (Primary Chief Investigator (PCI)), Williams, S. G. (Chief Investigator (CI)), Ebert, M. A. (Chief Investigator (CI)), Reynolds, H. M. (Chief Investigator (CI)), Dowling, J. (Chief Investigator (CI)), Wraith, D. (Chief Investigator (CI)), Liney, G. (Chief Investigator (CI)), Mears, C. D. (Chief Investigator (CI)), Betts, J. (Chief Investigator (CI)) & Murphy, D. (Chief Investigator (CI))1/02/17 → 30/04/21Project: Research Research output Research output per year 1996 2014 2015 2016 2017 2018 2019 2020 2024 2025 2025 24 Conference Paper 23 Article 6 Chapter (Book) 4 Abstract 4 More 1 Other Report 1 Comment / Debate 1 Letter 1 Review Article Research output per year Research output per year Environmental framing and left-wing political orientation promote sustainability in a US-based common-pool resource dilemmaHansen, R. R. S. F., Koomen, J. A., Buck, B., Betts, J. M., Bliuc, A. M. & Koomen, R. M., Aug 2025, In: Journal of Environmental Psychology. 105, 11 p., 102663.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Predict+Optimize Problem in Renewable Energy SchedulingBergmeir, C., de Nijs, F., Genov, E., Sriramulu, A., Abolghasemi, M., Bean, R., Betts, J., Bui, Q., Dinh, N. T., Einecke, N., Esmaeilbeigi, R., Ferraro, S., Galketiya, P., Glasgow, R., Godahewa, R., Kang, Y., Limmer, S., Magdalena, L., Montero-Manso, P. & Peralta, D. & 8 others, Kumar, Y. P. S., Rosales-Pérez, A., Ruddick, J., Stratigakos, A., Stuckey, P., Tack, G., Triguero, I. & Yuan, R., 2025, In: IEEE Access. 13, p. 60064-60087 24 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) Predict and optimize: a smart inventory management model for beauty retailNamazian, Z., Betts, J. M. & Stuckey, P. J., 24 Jul 2025, (Accepted/In press) In: Optimization Letters. 21 p.Research output: Contribution to journal › Article › Research › peer-review Open Access A theoretical framework for polarization as the gradual fragmentation of a divided societyBliuc, A.-M., Betts, J. M., Vergani, M., Bouguettaya, A. & Cristea, M., 15 Aug 2024, In: Communications Psychology. 2, 10 p., 75.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Examining the Influence of Charismatic Leaders' Communication on De-Polarisation: A Comparative Analysis of Communication Patterns in Populist and Non-Populist Political DiscourseBetts, J. M., Bliuc, A.-M. & Yilmaz, I., 2024. 1 p.Research output: Contribution to conference › Abstract Open AccessFile View all 61 research outputs Activities Activities per year 2010 2016 2016 4 Committees and working groups 2 Professional association or peak discipline body 1 Membership of an advisory panel/policy group/ board Activities per year Member - Australian Society for Operational ResearchBetts, J. (Member)1 Jan 2016Activity: External Academic Engagement › Professional association or peak discipline body Member - Operational Research Society (UK)Betts, J. (Member)1 Jan 2016Activity: External Academic Engagement › Professional association or peak discipline body Course Director - Bachelor of Business Information Systems - Faculty of Information Technology, Monash UniversityBetts, J. (Chair/ Co-Chair)1 Jan 2016Activity: External Academic Engagement › Committees and working groups Course Director - Bachelor of Information Technology - Faculty of Information Technology, Monash UniversityBetts, J. (Chair/ Co-Chair)1 Jan 2016Activity: External Academic Engagement › Committees and working groups Member - Undergraduate Programs Committee - Faculty of Information Technology, Monash UniversityBetts, J. (Member)1 Jan 2016Activity: External Academic Engagement › Committees and working groups View all 7 activities Press/Media The Effect of Charismatic Influencers on Societal PolarizationBetts, J., Bliuc, A.-M. & Cristea, M.15/06/231 Media contributionPress/Media: Article/Feature",
  "content_length": 7163,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:25"
}