{
  "name": "John Lapinskas",
  "homepage": "https://research-information.bris.ac.uk/en/persons/john-a-lapinskas",
  "status": "success",
  "content": "John A Lapinskas - University of Bristol View Scopus Profile Dr John A Lapinskas BSc, MSc, PhD Senior Lecturer, School of Computer Science https://orcid.org/0000-0003-3197-0854 Emailjohn.lapinskasbristol.acuk BS8 1UB Personal profile Research Groups and ThemesAlgorithms and Complexity Fingerprint Dive into the research topics where John A Lapinskas is active. These topic labels come from the works of this person. Together they form a unique fingerprint. Contention Resolution Computer Science 100% Multiple Processor Computer Science 75% Probability Theory Mathematics 62% Extinction Probability Mathematics 50% Single Message Computer Science 25% Cloud Computing Computer Science 25% queueing model Computer Science 25% Running Time Mathematics 25% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 15 Article (Academic Journal) 6 Conference Contribution (Conference Proceeding) 1 Conference Paper Research output per year Research output per year Instability of backoff protocols with arbitrary arrival ratesGoldberg, L. A. & Lapinskas, J. A., 4 Mar 2025, (E-pub ahead of print) In: Journal of Computer and System Sciences. 103638.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open Access Multiple Processor 100% Contention Resolution 100% Four universal growth regimes in degree-dependent first passage percolation on spatial random graphs IIKomjathy, J., Lapinskas, J. A., Lengler, J. & Schaller, U., 25 Sept 2024, (Accepted/In press) In: Electronic Journal of Probability.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open Access Nearly optimal independence oracle algorithms for edge estimation in hypergraphsDell, H., Lapinskas, J. A. & Meeks, K., 14 Apr 2024, (Accepted/In press).Research output: Contribution to conference › Conference Paper › peer-review Open Access View all 22 research outputs Datasets Simulation data for \"Increasing efficacy of contact-tracing applications by user referrals and stricter quarantining\"Goldberg, L. A. (Creator), Jorritsma, J. (Creator), Komjáthy, J. (Creator) & Lapinskas, J. (Creator), Zenodo, 12 Mar 2021DOI: 10.5281/zenodo.4601163, https://zenodo.org/record/4601163Dataset",
  "content_length": 2554,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:51"
}