{
  "name": "John Derrick",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/john-derrick",
  "status": "success",
  "content": "Professor John Derrick | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor John Derrick DPhil School of Computer Science Acting Vice-President and Head of Faculty of Science Professor of Computer Science Member of the Foundations of Computation and Testing research groups Open staff member portrait in a modal window j.derrick@sheffield.ac.uk +44 114 222 1849 +44 114 222 9762 (PA: Sophie Jacob) Regent Court (DCS) Full contact details Professor John Derrick School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0002-6631-8914 Google Scholar Personal website Profile John graduated with a degree in Mathematics from the University of Nottingham, before taking his DPhil in Oxford. From 1990 to 2005 he worked at the University of Kent at Canterbury, moving to Sheffield in 2005.He was Head of Department between 2009 and 2015. In 2015 he was appointed to the post of Deputy PVC for Research and Innovation. Since 2017 he has been Vice President and Head of the Faculty of Science. Research interests Specification, refinement and testing using formal methods:Refinement in state-based systems.Integrated formal methods.Viewpoint specification using formal methods.Model checking Erlang code.Testing of formal specifications.Process algebraic refinement.Frameworks for distributed systems: architectural semantics, specification templates, object orientation, interfaces. Publications Books Derrick J & Boiten E (2018) Refinement. Springer International Publishing. Derrick J, Vain J & IFIP WG (2007) Formal techniques for networked and distributed systems-- FORTE 2007. Springer-Verlag New York Inc. Boiten E, Derrick J & Smith G (2004) Integrated formal methods. Springer. Derrick J & Boiten E (2001) Refinement in Z and Object-Z. Springer London. Derrick J & Boiten E (2001) Refinement in Z and Object-Z. Springer Verlag. Ben-Dov Y & Hodgson CJ (1997) Preface. Elsevier. Edited books Bowman H & Derrick J (Ed.) (2001) Formal Methods for Distributed Processing: A Survey of Object-Oriented Approaches. Cambridge Univ Press. Journal articles Abid SB, Kosiol J, Mittal R, Ober I, Posse E, Al Lail M, Balaban M, Bandyoapdhyay S, Bezerra J, Boulanger F , Bouquet F et al (2024) Preface to the 21th edition of the Workshop on Model Driven Engineering, Verification and Validation (MoDeVVa 2024). Proceedings Models 2024 ACM IEEE 27th International Conference on Model Driven Engineering Languages and Systems Companion Proceedings, lxviii-lxix. Derrick J, Doherty S, Dongol B, Schellhorn G & Wehrheim H (2021) Verifying correctness of persistent concurrent data structures: a sound and complete method. Formal Aspects of Computing, 33(4-5), 547-573. Winter K, Smith G & Derrick J (2019) Modelling concurrent objects running on the TSO and ARMv8 memory models. Science of Computer Programming, 184, ---. Derrick J, Doherty S, Dongol B, Schellhorn G, Travkin O & Wehrheim H (2017) Mechanized proofs of opacity: a comparison of two techniques. Formal Aspects of Computing, 30(5), 597-625. View this article in WRRO Dongol B & Derrick J (2015) Interval-based data refinement: A uniform approach to true concurrency in discrete and real-time systems. Science of Computer Programming, 111, 214-247. View this article in WRRO Dongol B & Derrick J (2015) Verifying Linearisability. ACM Computing Surveys, 48(2), 1-43. Schellhorn G, Derrick J & Wehrheim H (2014) A Sound and Complete Proof Technique for Linearizability of Concurrent Data Structures. ACM Transactions on Computational Logic, 15(4). View this article in WRRO Boiten EA, Derrick J & Reeves S (2014) Editorial. Formal Aspects of Computing, 1-1. Derrick J, Smith G, Groves L & Dongol B (2014) Using coarse-grained abstractions to verify linearizability on TSO architectures. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 8855, 1-16. View this article in WRRO Dongol B, Derrick J & Smith G (2014) Reasoning Algebraically About Refinement on TSO Architectures. THEORETICAL ASPECTS OF COMPUTING - ICTAC 2014, 8687, 151-168. View this article in WRRO Derrick J, Dongol B, Schellhorn G, Tofan B, Travkin O & Wehrheim H (2014) Quiescent consistency: Defining and verifying relaxed linearizability. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 8442 LNCS, 200-214. Dongol B, Derrick J & Hayes IJ (2013) Deriving real-time action systems with multiple time bands using algebraic reasoning. Science of Computer Programming. Derrick J & Boiten E (2012) Relational concurrent refinement part III: traces, partial relations and automata. Formal Aspects of Computing, 1-26. Schellhorn G, Wehrheim H & Derrick J (2012) How to prove algorithms linearisable. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 7358 LNCS, 243-259. Derrick J & Gnesi S (2012) Preface to iFM & ABZ 2012. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 7316 LNCS, V-VI. Boiten E, Derrick J & Schellhorn G (2011) Selected papers of the Refinement Workshop Turku (2008). Science of Computer Programming, 76(9), 737-738. Derrick J & Boiten E (2011) Relational concurrent refinement: Timed refinement. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6722 LNCS, 121-137. Derrick J, Schellhorn G & Wehrheim H (2011) Verifying linearisability with potential linearisation points. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6664 LNCS, 323-337. Derrick J & Smith G (2011) Temporal-logic property preservation under Z refinement. Formal Aspects of Computing, 1-24. Derrick J, Schellhorn G & Wehrheim H (2011) Mechanically verified proof obligations for linearizability. ACM Transactions on Programming Languages and Systems, 33(1). Derderian K, Hierons RM, Harman M & Guo Q (2010) Estimating the feasibility of transition paths in extended finite state machines. AUTOMAT SOFTW ENG, 17(1), 33-56. Walkinshaw N & Derrick J (2010) Incrementally discovering testable specifications from program executions. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6286 LNCS, 272-289. Boiten E & Derrick J (2010) Incompleteness of relational simulations in the blocking paradigm. SCI COMPUT PROGRAM, 75(12), 1262-1269. Derrick J & Wehrheim H (2010) Model transformations across views. SCI COMPUT PROGRAM, 75(3), 192-210. Guo Q, Derrick J, Benac Earle C & Fredlund LA (2010) Model-checking Erlang - A comparison between EtomCRL2 and McErlang. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6303 LNCS, 23-38. Guo Q & Derrick J (2010) Formally based tool support for model checking Erlang applications. International Journal on Software Tools for Technology Transfer, 1-22. Derrick J, Walkinshaw N, Arts T, Benac Earle C, Cesarini F, Fredlund LA, Gulias V, Hughes J & Thompson S (2010) Property-based testing - The ProTest project. Lecture Notes in Computer Science Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics, 6286 LNCS, 250-271. Boiten E, Butler M, Derrick J & Smith G (2010) Editorial. FORM ASP COMPUT, 22(1), 1-1. Boiten EA, Derrick J & Reeves S (2009) Preface.. REFINE@FMWeek, 1-1. Aichernig BK, Boiten E, Butler M, Derrick J & Groves L (2009) Editorial. FORM ASP COMPUT, 21(1-2), 1-1. Derrick J & Boiten E (2009) Relational Concurrent Refinement: Automata. Electronic Notes in Theoretical Computer Science, 259(C), 21-34. Derrick J, North S & Simons AJH (2009) Z2SAL: a translation-based model checker for Z. Formal Aspects of Computing, 1-29. Hierons RM, Bogdanov K, Bowen JP, Cleaveland R, Derrick J, Dick J, Gheorghe M, Harman M, Kapoor K, Krause P , Luttgen G et al (2009) Using Formal Specifications to Support Testing. ACM COMPUT SURV, 41(2). Aichernig BK, Boiten E, Butler M, Derrick J & Groves L (2009) Formal Aspects of Computing: Editorial. Formal Aspects of Computing, 21(1-2), 1. Derrick J & Boiten E (2008) More Relational Concurrent Refinement: Traces and Partial Relations. Electronic Notes in Theoretical Computer Science, 214(C), 255-276. Derrick J & Smith G (2008) Using Model Checking to Automatically Find Retrieve Relations. Electronic Notes in Theoretical Computer Science, 201(C), 155-175. Boiten EA, Derrick J & Schellhorn G (2008) Preface.. Refine@FM, 1-1. Derrick J & Boiten E (2007) Relational Concurrent Refinement with Internal Operations. Electronic Notes in Theoretical Computer Science, 187, 35-53. Derrick J & Wehrheim H (2007) On using data abstractions for model checking refinements. ACTA INFORM, 44(1), 41-71. Boiten EA, Derrick J & Smith G (2007) Preface.. REFINE@IFM, 1-1. Aichernig BK, Boiten EA, Derrick J & Groves L (2006) Preface.. Refine@ICFEM, 187, 1-1. Koh SCL & Gunasekaran A (2006) Editorial. International Journal of Business Performance Management, 8(1), 1-4. Banach R & Derrick J (2006) Filtering retrenchments into refinements. Proceedings 4th IEEE International Conference on Software Engineering and Formal Methods Sefm 2006, 60-69. Derrick J, Harman M & Hierons RM (2006) Guest Editorial.. Formal Aspects Comput., 18, 1-2. Derrick J & Boiten EA (2005) Preface.. REFINE, 137, 1-3. Boiten EA, Derrick J & Smith G (2005) Guest Editorial Integrated Formal Methods.. Formal Aspects Comput., 17, 389-389. Earle CB, Fredlund LA & Derrick J (2005) Verifying fault-tolerant Erlang programs. Erlang 05 Proceedings of the ACM SIGPLAN 2005 Erlang Workshop, 26-34. Sm",
  "content_length": 36619,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:36"
}