{
  "name": "John P. Conley",
  "homepage": "http://eecs.oregonstate.edu/~jconley",
  "status": "success",
  "content": "Home Page of John Conley Conley Group: Emerging Materials and Devices Electrical Engineering and Computer Science | Materials Science | Oregon State University HOME RESEARCH TEACHING CV PUBLICATIONS PEOPLE FACILITIES STUDENT OPPORTUNITIES HIGH SCHOOL OUTREACH SENIOR DESIGN & HONORS PROJECTS SUPPORT HAVING FUN IN THE NEWS Group WIKI John F. Conley, Jr. Professor, Electrical Engineering / Materials Science Fellow, Institute of Electrical and Electronics Engineers (IEEE) Fellow, American Vacuum Society (AVS) Signature Faculty Fellow, Oregon Nanoscience and Microtechnologies Institute (ONAMI) Director, Materials Synthesis and Characterization (MASC) Facility Ph.D. ESM - Penn State University (1995) B.S. EE - Penn State University (1991) School of Electrical Engineering and Computer Science Office: 3089 Kelley Engineering Center Phone: (541)737-9874; Email: jconley@eecs.oregonstate.edu SHIPPING ADDRESS: School of EECS Oregon State University 1148 Kelley Engineering Center 110 SW Park Terrace Corvallis, OR 97331-5501 Research Interests Dr. Conley's current research interests include atomic layer deposition, metal/insulator/metal devices (MIM & MIIM tunnel diodes, RRAM / memristors, and MIM high-Îº capacitors), internal photoemission (IPE), thin film transistors, electron spin resonance (ESR) identification of point defects that play a role in reliability and radiation induced instabilities in novel electronic materials, and directed integration of nanomaterials and devices. (See here for brief overview, Google Scholar Profile). Biography (see here for a profile article) John F. Conley, Jr. Â earned his B.S. in electrical engineering in 1991 and Ph.D. in engineering science and mechanics in 1995 from The Pennsylvania State University where he won a 1996 Xerox Prize for his Ph.D. dissertation.Â He was at Dynamics Research Corporation from 1995 to 2000 and at the Jet Propulsion Laboratory from 2000-2001, where he received a JPL achievement award.Â  In 2001, he became a senior member of the technical staff at Sharp Laboratories of America (SLA) and from 2005-2007 was Leader of the Novel Materials and Devices Group.Â  In 2002-03, he served as an adjunct professor at the Vancouver campus of Washington State University.Â  Since 2007, he has been a full Professor and an ONAMI Signature Faculty Fellow at Oregon State University in both the School of Electrical Engineering and Computer Science and the Intercollege Materials Science Program. Dr. Conley has also served a consultant for RedWave Energy, Inc. and an expert witness for Morgan, Lewis, and Bockius, LLP. Dr. Conley is currently Associate Editor of IEEE Transactions on Electron Devices and has previously served as a guest editor for three special issues of IEEE Transactions on Device and Material Reliability and has served on the technical and management committees of the American Vacuum Society, the MRS Electronic Materials Conference, IEEE Nano, IEEE IRPS, the IEEE SOI Conference, and the IEEE Nuclear and Space Radiation Effects Conference (NSREC), was technical program chair of the IEEE Microelectronics Reliability and Qualification Workshop, general program chair of the IEEE International Integrated Reliability Workshop (IIRW), General and Technical Program Chair of the 2017 AVS International Conference on Atomic Layer Deposition, and General Chair of the 2023 AVS Workshop on Innovative Nanoscale Devices and Systems (WINDS). He has authored or co-authored over 130 technical papers and over 130 additional conference presentations (including 18 invited).Â  He also holds twenty U.S. patents and has presented tutorial short courses on high-k dielectrics at two international conferences.Â Dr. Conley is a Fellow of the Institute of Electrical and Electronics Engineers (IEEE), a Fellow of the American Vacuum Society (AVS), and a Fellow of the Oregon Nanoscience and Microtechnologies Institute (ONAMI). John F. Conley, Jr.: jconley@ eecs.oregonstate.edu, ph (541)737-9874, 3089 Kelley Engineering Center",
  "content_length": 4012,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:02"
}