{
  "name": "John Georgas",
  "homepage": "https://www.cefns.nau.edu/~jg455",
  "status": "success",
  "content": "John Georgas @ NAU – About John Georgas @ Northern Arizona University John Georgas is the Senior Vice Provost for Academic Operations at Northern Arizona University (NAU) in Flagstaff, Arizona, responsible for the strategic and administrative leadership of a broad portfolio of offices and functional areas that underpin academic operations and student success. His team consists of 10 direct reports and more than 240 full-time faculty and staff, with leadership oversight over the offices of University Advising, Office of the Registrar, NAU Online, Cline Library, Office of Undergraduate Research and Creative Activity, Academic Affairs Marketing, Academic Affairs Business Analysts, and the U.S. Air Force and U.S. Army Reserve Officersâ Training Corps programs. In prior roles, he served as vice provost, interim dean for the College of Engineering, Informatics, and Applied Sciences (now Steve Sanghi College of Engineering), the interim associate dean for the same, the associate director for Research and Graduate Programs for the School of Informatics, Computing, and Cyber Systems, the associate director for the Informatics and Computing program, and as the computer science program lead and associate chair for the department of Electrical Engineering and Computer Science. Georgas is a tenured professor, with research interests that include software and architectural visualization, self-adaptive software systems, domain-specific architecture and architectural styles, software engineering pedagogy and learning, and pedagogies that support underrepresented learners. His work has been supported by various funding agencies, including the National Science Foundation and the National Institutes of Health, and appears in national and international venues. His teaching has spanned courses across undergraduate and graduate levels in computer science and software engineering, with a focus on introductory computer science and programming, software engineering, and software architecture and design. A first-generation college graduate from an immigrant family, Georgas earned his bachelorâs degree in computer science from California State Polytechnic University, Pomona, after beginning his studies as a community college student at Mt. San Jacinto College. He earned his masterâs and doctoral degrees in information and computer science from the University of California, Irvine. He is a member of the Association for Computing Machinery and the American Society for Engineering Education and is an alumnus of the Harvard Institute for Management and Leadership in Education. Current CV in PDF (366KB; updated spring 2025) Contact Email: john [dot] georgas [at] nau [dot] edu Office: Babbitt Administrative Center (51), room 201C Office Hours I don't have regularly scheduled office hours; please email for an appointment.",
  "content_length": 2845,
  "method": "requests",
  "crawl_time": "2025-12-01 13:32:38"
}