{
  "name": "Jon Youn",
  "homepage": "https://www.cune.edu",
  "status": "success",
  "content": "Concordia University, Nebraska | A Distinctly Lutheran Education Discover a distinctly Christian community equipping you to live by faith. Undergraduate Programs Graduate Programs Spiritual life Why Concordia?  At Concordia University, Nebraska, you’ll be surrounded by peers, professors and a distinctive community of believers that will not only help you discover what you’re meant to do, but also the joy of being part of something bigger than yourself. By intentionally combining our Christian, Lutheran faith, rigorous academics and practical, real-life experiences, Concordia will help you fulfill a higher purpose in your vocations and your life. $29,000Average amount of financial aid provided to each undergraduate student100%Of full-time undergraduate students receive financial aid98%Recent graduates attended graduate school or were employed within six months of graduation 14:1Student to faculty ratio15LCMS-affiliated churches within 20 miles of campus1,500Weekly chapel attendees “We strive to create a learning community that sees each student as a unique child of God, full of potential, and that invites people to approach their lives, learning and work with conviction, character, courage and compassion.” Dr. Bernard Bull, President A Community Rooted in Christ Faith is the heart of everything we do at Concordia University, Nebraska. Through worship and service opportunities, a Christ-centered community and a campus where faith is woven into every class, conversation and experience, you’ll grow spiritually, deepen your relationship with God and discover His calling for your life.  Explore spiritual life on campus Concordia Stories Academics, News, Students Concordia Nebraska named as Fostering the Future participating university Nov 24, 2025 Campus Life, News Concordia Nebraska’s Bulldogs4Life group hosts Y4Life, Lutherans for Life event Nov 20, 2025 Academics, Graduate School Advancing Your Coaching Career with a Graduate Degree Nov 19, 2025 More Concordia Stories Inquire Visit Apply Give",
  "content_length": 2024,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:29"
}