{
  "name": "Jon Bird",
  "homepage": "https://research-information.bris.ac.uk/en/persons/jon-bird",
  "status": "success",
  "content": "Jon Bird - University of Bristol View Scopus Profile Dr Jon Bird BSc, DPhil Senior Lecturer, School of Computer Science https://orcid.org/0000-0002-1681-1532 Emailjon.birdbristol.acuk BS8 1UB Personal profile Research Groups and ThemesBristol Interaction Group Fingerprint Dive into the research topics where Jon Bird is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Autopsy Medicine & Life Sciences 100% Cause of Death Medicine & Life Sciences 18% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 11 Conference Contribution (Conference Proceeding) 7 Article (Academic Journal) 1 Conference Paper Research output per year Research output per year Burnout by Design: How Digital Systems Overburden Neurodivergent Students in Higher EducationTcherdakoff, A., Marshall, P., Dowthwaite, A., Bird, J. & Cox, A. L., 22 Jun 2025, CHIWORK 2025 - Proceedings of the 4th Annual Symposium on Human-Computer Interaction for Work. Amsterdam: Association for Computing Machinery (ACM), p. 1-18 18 p. 17. (CHIWORK 2025 - Proceedings of the 4th Annual Symposium on Human-Computer Interaction for Work).Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Digital Systems 100% Semistructured Interview 50% 188 Downloads (Pure) Challenges When Co-Designing With Children in the ClassroomCharitos, S., Thompson, L., Brigden, A., Brady, E., Dooley, E., Wintle, K. & Bird, J., 25 Apr 2025, CHI EA 2025 - Extended Abstracts of the 2025 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery (ACM), 8 p. 659. (Conference on Human Factors in Computing Systems - Proceedings).Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open AccessFile Participatory Design 100% Focus Group 100% Practical Solution 25% Behavior Management 25% Facilitated Workshop 25% 9 Downloads (Pure) Exploring the Use of Smartwatches and Activity Trackers for Health-Related Purposes for Children Aged 5 to 11 years: Systematic ReviewThompson, L. B. P., Charitos, S. R., Bird, J., Marshall, P. & Brigden, A. L. C., 27 Jan 2025, In: Journal of Medical Internet Research. 27, 20 p., e62944.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open Access Access Control 100% Database Searches 100% Extracted Data 100% Smartphone App 100% Inclusion Criterion 100% 1 Citation (Scopus) View all 19 research outputs Projects 3 Finished Projects per year “Can sharing app data assist communication and rapport between young people and mental health practitioners and enhance clinical consultations?Biddle, L. A. (Principal Investigator), Bould, H. E. (Co-Investigator) & Bird, J. (Co-Investigator)1/02/22 → 25/07/22Project: Research Eating Disorder Stakeholder GroupBould, H. E. (Principal Investigator), Biddle, L. A. (Co-Investigator), Bird, J. (Co-Investigator) & Penton-Voak, I. S. (Co-Investigator)31/03/21 → 31/07/21Project: Research 8030 EPSRC via Newcastle University EP/R033900/1 INTUITBird, J. (Principal Investigator)1/11/18 → 30/04/22Project: Research",
  "content_length": 3536,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:22"
}