{
  "name": "Jon Froehlich",
  "homepage": "http://www.cs.umd.edu/~jonf",
  "status": "success",
  "content": "Jon E. Froehlich Jon E. Froehlich ProfessorAllen School of Computer ScienceUniversity of Washington Director, Makeability LabVisiting Researcher, Google Research Associate Director, CREATE Associate Director, PacTransMember, DUB Contact:Paul G. Allen Center, Room 642jonf@cs.uw.edu ORCID:0000-0001-8291-3353 Follow Makeability Lab Lab Handbook LinkedIn Bluesky Twitter GitHub Google Scholar Join us! I am recruiting new PhD students in Human-AI research in Urban Computing, Augmented Reality (AR), and/or Creativity Support Tools. The application deadline is Dec 15, 2025 (see Allen School PhD Admissions). Example projects in core areas: Urban Computing / GeoAI: Geo-Visual AI Agents, Project Sidewalk, FlyMeThrough, NightLight, GeoQA^3, AccessParkCV Augmented Reality: GazePointAR, SonoCraftAR, ARSports, SonifyAR, RASSAR Creativity Support Tools: ImaginateAR, DepthScape, ArtInsight, MobiPrint If interested, please begin by reading our Makeability Lab handbook and our recent papers in the area on the Makeability Lab website. Then, email me at jonf@cs.uw.edu with \"Prospective PhD Student in Human-AI Research\" in the subject. Include your CV and a brief statement about how your prior work and future interests intersect with my lab. Hi 👋, I’m Jon, a Professor in Human-Computer Interaction at UW’s Allen School of Computer Science and Engineering where I work with an extraordinary set of students and collaborators on problems related to accessibility, urban informatics, environmental sustainability, and STE(A)M education. I am also a Visiting Faculty Researcher on the Society-Centered AI team at Google Research. At UW, I direct the Makeability Lab and am the Associate Director of CREATE (Center for Research and Education on Accessible Technology and Experiences), Associate Director of Tech Transfer and Outreach of PacTrans, and co-founder of Project Sidewalk, a web tool aimed at transforming how sidewalks are mapped, analyzed, and visualized using crowdsourcing+AI. I also serve as a Core Faculty Member in the Interdisciplinary PhD Program in Urban Design and Planning within the UW Graduate School. In 2022, I was the General Chair for ASSETS’22, the premier ACM conference for research on the design, evaluation, use, and education related to computing for people with disabilities and older adults, where I spearheaded the first ever hybrid conference in ASSETS history and developed the new workshop track—both initiatives continue today. From 2021-2024, I was the Faculty Chair of UW’s cross-disciplinary MHCI+D program. I was selected as a Sloan Fellow in 2016, the UW College of Engineering Outstanding Faculty in 2021, and the PacTrans Outstanding Researcher in 2022. Our lab has accrued 23 Best Paper and Honorable Mention Awards at leading scientific venues in Human-Computer Interaction, including at: CHI, ASSETS, UIST, and IMWUT. Students One of the great privileges of being a professor is working with students. In the Makeability Lab, we work with students across multiple disciplines and levels from high school to PhD. For a full list, see the Makeability Lab’s People page. Makeability Lab PhD Students If you’re interested in working with me, please read our Makeability Lab Handbook. I currently advise these fantastic students: Arnavi Chheda-Kothary, AI-powered accessibility for mixed-ability families (co-advised with Professor Jacob O. Wobbrock) Chu Li, advancing urban science through interactive technology Daniel Campos Zamora, urban computing and pervasive fabrication Jaewook Lee, re-imagining augmented reality for all Jared Hwang, AI-powered urban informatics Xia Su, creativity support tools and indoor accessibility Makeability Lab PhD Alumni Manaswi Saha, University of Washington, 2022 Dissertation: Designing Interactive Data-driven Tools for Understanding Urban Accessibility at Scale Now at Accenture Labs Liang He, University of Washington, 2022 Dissertation: Fabricating Kinetic Objects with 3D Printable Spring-Based Mechanisms for Interactivity. Now an Assistant Professor at University of Texas, Dallas. Dhruv Jain, University of Washington, 2022 Dissertation: Sound Sensing and Feedback Techniques for Deaf and Hard and Hearing People. Co-advised with Professor Leah Findlater. Now an Assistant Professor at the University of Michigan. Seokbin Kang, University of Maryland, 2020 Dissertation: Augmented Reality Systems and User Interaction Techniques for STEM Learning. Now at Zoom. Matt Mauriello, University of Maryland, 2018 Dissertation: Designing and Evaluating Next-Generation Thermographic Systems to Support Residential Energy Audits. Postdoc at Stanford. Now an Assistant Professor at University of Delaware. Lee Stearns, University of Maryland, 2018 Dissertation: HandSight: A Touch-Based Wearable System to Increase Information Accessibility for People with Visual Impairments. Co-advised with Rama Chellappa. Now at Johns Hopkins Applied Physics Laboratory. Kotaro Hara, University of Maryland, 2016 Dissertation: Scalable Methods to Collect and Visualize Sidewalk Accessibility Data for People with Mobility Impairments. Postdoc at CMU. Now an Assistant Professor at Singapore Management University. I also worked closely with HCDE PhD students Steven Goodman and Emma McDonnell on sound recognition and captioning tools to support people who are deaf or hard of hearing with Co-PI Professor Leah Findlater (NSF #1763199) Teaching In the Allen School, I teach CS courses that explore the materiality of computing and the ever-changing relationships between humans, bits, and atoms such as CSE490 Physical Computing, CSE590 Ubiquitous Computing, and CSE599 Prototyping Interactive Systems. I also co-teach HCID521 Prototyping Studio in the Master of Human-Computer Interaction Design (MHCI+D) program. Topics across these courses include prototyping with electronics, microcontrollers, code, 3D printers, and lo-fi craft material. See our teaching website for more details. Acknowledgments and funding The Makeability Lab is grateful for funding support from the NSF, the Department of Defense’s Clinical and Rehabilitative Medicine Research Program, the PacTrans Consortium, UW CREATE, UW’s Global Innovation Fund, and the UW Reality Lab as well as corporate sponsors, including: Google Faculty Research Awards, a 3M Faculty Award, and research funding from Adobe, Apple, Nokia, Microsoft, and Meta. We are also grateful for our PhD student funding awards, including two Google PhD Fellowships, an IBM Fellowship, a Google-CMD-IT LEAP Alliance Fellowship, an Allen School First-Year Fellowship, an NSF GRFP, a GEM Fellowship, and a Microsoft Dissertation Grant. We are honored and humbled that our work has been recognized with 23 Best Paper and Honorable Mention Awards, including five Best Papers at CHI, three Best Papers at ASSETS, one Best Paper Inclusion Award at UIST, and a 10-Year Impact Award at UbiComp. Learn more You can learn more about our research by following the Makeability Lab Twitter or my personal Twitter.",
  "content_length": 7006,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:27"
}