{
  "name": "Jon Atle Gulla",
  "homepage": "https://www.ntnu.edu/employees/jon.atle.gulla",
  "status": "success",
  "content": "Jon Atle Gulla - NTNU Jon Atle Gulla Download press photo Download press photo Download press photo Foto: Kai T. Dragland / NTNU Close Jon Atle Gulla Director of NorwAI & Professor Department of Computer Science Faculty of Information Technology and Electrical Engineering jon.atle.gulla@ntnu.no +4773591847 +4791347759 IT-bygget, 114, Gløshaugen, Sem Sælands vei 9 Home page About CV Jon Atle Gulla is director of the Norwegian Research Center for AI Innovation (NorwAI). This is a center for research-based innovation (SFI) that develops new technologies for successful and responsible exploitation of data-driven artificial intelligence in industrial innovations.  NorwAI is supported by the Research Center of Norway, three universities, two research institutes and 11 companies. Jon Atle Gulla is a professor at the Norwegian University of Science and Technology (NTNU) in Trondheim.  He was the head of the Department of Computer and Information Science 2010—2012 and the deputy head 2009-2010 and 2012-2013.  Gulla has a MSc (1988) and a PhD (1993) in Computer Science from the Norwegian Institute of Technology. He has a MSc in Linguistics from the University of Trondheim (1995) and a MSc of Management (Sloan fellowship) from London Business School (2003).  He is a member of the Royal Norwegian Society of Sciences and Letters. Gulla’s research centers around Semantics and Natural Language Processing and its use in Recommender Systems, Information Retrieval, and Text Analytics.  He has a keen interest in Digitalization and AI-based Innovation and Entrepreneurship, facilitating AI adoption in industrial companies as well as exploring new business opportunities in startups. Gulla has close to 150 international publications and has supervised around 70 MSc students, 30 PhD students and 10 post docs. He has served as opponent/administrator for numerous PhD defenses and is a frequently invited speaker at both industrial and academic events. Gulla is a reviewer for many international journals, like Data & Knowledge Engineering, Information Processing and Management and AI Magazine, and for international conferences like ACL, EKAW and ECIL.  He is also a co-founder and general chair of the annual international workshop on News Recommendation and Analytics (INRA) and the annual Norwegian Big Data Symposium (NOBIDS). Selected research projects: Big Data & Machine Learning with DNB:  AI techniques for conversational systems, detection of money laundering activities and transaction analysis in finance. RecTech (BIA):  AI-driven news recommendation for Adresseavisen and Cxense/Piano. Trondheim Analytica (NTNU Digital Transformation program): Multi-disciplinary research on political mining and social media analysis Contextual (FORNY):  Commercialization of research on AI-based real-time company news monitoring and analytics Courses: TDT4215 Recommender Systems TDT4290 Customer-Driven Project TDT44 Semantic Web Innovation & Entrepreneurship Gulla has years of experience from managerial positions in industry and is used as an advisor for AI adoption in industry and commercialization of new AI research.  He has taken part in four technology startups: Fast Search & Transfer: Early stage manager/CEO of German subsidiary.  Large-scale internet search engine and enterprise search. Established in 1997, acquired by Microsoft in 2008 for USD 1.3 billion. LingIT: Co-founder. Spell-checkers, question-answering systems and other linguistic software.  Established in 2001, acquired by Verdane Capital in 2017. Businesscape:  Co-founder. Automatic business process mining.  Established in 2004, closed down in 2016. Mito.ai/Strise.ai:  Co-founder. Real-time media monitoring and analysis.  Established in 2016, exit in 2017. Gulla Gaard Jon Atle Gulla is the owner of Gulla Gaard, a well-known traditional English fishing lodge located next to one of the finest salmon rivers in Norway, Surna.    Among the sports fishermen visiting Gulla since 1872, there are ministers, diplomats and wealthy business men from all over the world, as well as King Haakon VII in 1931. The whole history of Gulla Gaard is discussed in the book “Portvin og laks på Gulla Gaard” (Port and salmon at Gulla Gaard), written by Jon Atle Gulla in 2006. In the media \"Neste generasjons chatboter kan komme fra forskningssenteret NorwAI\" \"Kunsten å ikke forsvinne i vrimmelen\" \"Nytt forskningssenter for kunstig intelligens i Trondheim\" \"Nytt forskningssenter for kunstig intelligens skal skape verdier\" \"Trondheimsbedrift vant datapris i London\" «Retriever vil analysere tekst med kunstig intelligens – nytt samarbeid med NTNU» «How much does our use of social media reveal about our political views?» «Forskning på algoritmer kan avsløre falske nyheter» «Trondheimsfirma vil koble finansnyheter med aksjesalg» «Personaliserte nyheter: NTNU og Adressa vil ta Facebook og Google» «Endelig kan søkemotoren forstå deg» «Tar språkproblemene ut i verden» “Towards a Semantic Information Platform for Subsea Petroleum Processes” «Unge gründere med brukerfokus» Publications 2025 Rosa, Javier De La; Mikhailov, Vladislav; Zhang, Lemei; Wetjen, Freddy; Samuel, David; Liu, Peng. (2025) The Impact of Copyrighted Material on Large Language Models: A Norwegian Perspective. Academic chapter/article/Conference paper 2024 Doan, Tu My; Baumgartner, David; Kille, Benjamin Uwe; Gulla, Jon Atle. (2024) Automatically Detecting Political Viewpoints in Norwegian Text. Lecture Notes in Computer Science (LNCS) Academic article Liu, Peng; Zhang, Lemei; Farup, Terje Nissen; Lauvrak, Even Wienenga; Ingvaldsen, Jon Espen; Eide, Simen. (2024) NLEBench+NorGLM: A Comprehensive Empirical Analysis and Benchmark Dataset for Generative Language Models in Norwegian. Academic chapter/article/Conference paper Doan, Tu My; Gulla, Jon Atle. (2024) Viewpoints Detection in Political Speeches. Norges teknisk-naturvitenskapelige universitet Norges teknisk-naturvitenskapelige universitet Doctoral dissertation 2023 Zhang, Lemei; Liu, Peng; Gulla, Jon Atle. (2023) Recommending on graphs: a comprehensive review from a data perspective. User modeling and user-adapted interaction Academic literature review Liu, Peng; Zhang, Lemei; Gulla, Jon Atle. (2023) Pre-train, Prompt, and Recommendation: A Comprehensive Survey of Language Modeling Paradigm Adaptations in Recommender Systems. Transactions of the Association for Computational Linguistics Academic article Doan, Tu My; Kille, Benjamin Uwe; Gulla, Jon Atle. (2023) SP-BERT: A Language Model for Political Text in Scandinavian Languages. Lecture Notes in Computer Science (LNCS) Academic article Xing, Yujie; Gulla, Jon Atle. (2023) Improving Context-Awareness on Multi-Turn Dialogue Modeling with Extractive Summarization Techniques. Lecture Notes in Computer Science (LNCS) Academic article 2022 Kvale, Knut; Gulla, Jon Atle; Adde, Line; Solberg, Per Erik; Svendsen, Torbjørn Karl; Moshagen, Sjur Nørstebø. (2022) Taleteknologi og kunstig intelligens. Teknologirådet Teknologirådet Report Doan, Tu My; Gulla, Jon Atle. (2022) A Survey on Political Viewpoints Identification. Online Social Networks and Media (OSNEM) Academic literature review Doan, Tu My; Kille, Benjamin Uwe; Gulla, Jon Atle. (2022) Using Language Models for Classifying the Party Affiliation of Political Texts. Lecture Notes in Computer Science (LNCS) Academic article Özgöbek, Özlem; Lommatzsch, Andreas; Kille, Benjamin Uwe; Liu, Peng; Malthouse, Edward C.; Gulla, Jon Atle. (2022) Preface to INRA 2022. CEUR Workshop Proceedings Editorial Özgöbek, Özlem; Lommatzsch, Andreas; Kille, Benjamin Uwe; Liu, Peng; Malthouse, Edward C.; Gulla, Jon Atle. (2022) Preface to INRA and IWILDS 2022. CEUR Workshop Proceedings Editorial Liu, Peng; Marco, Cristina; Gulla, Jon Atle. (2022) Building Sentiment Lexicons for Mainland Scandinavian Languages Using Machine Translation and Sentence Embeddings. Academic chapter/article/Conference paper 2021 Özgöbek, Özlem; Lommatzsch, Andreas; Kille, Benjamin; Liu, Peng; Pu, Zhixin; Gulla, Jon Atle. (2021) Preface to the Ninth International Workshop on News Recommendation and Analytics (INRA 2021). CEUR Workshop Proceedings Editorial Özgöbek, Özlem; Lommatzsch, Andreas; Kille, Benjamin Uwe; Liu, Peng; Pu, Zhixin; Gulla, Jon Atle. (2021) 9th International Workshop on News Recommendation and Analytics. Fifteenth ACM Conference on Recommender Systems Academic article Gulla, Jon Atle; Svendsen, Rolf Dyrnes; Zhang, Lemei; Stenbom, Agnes; Frøland, Jørgen Hovelsen. (2021) Recommending news in traditional media companies. The AI Magazine Article in business/trade/industry journal Liu, Peng; Zhang, Lemei; Gulla, Jon Atle. (2021) Multilingual Review-aware Deep Recommender System via Aspect-based Sentiment Analysis. ACM Transactions on Information Systems Academic article Xing, Yujie; Mohallick, Itishree; Gulla, Jon Atle; Özgöbek, Özlem; Zhang, Lemei. (2021) An Educational News Dataset for Recommender Systems. Communications in Computer and Information Science (CCIS) Academic article Barlaug, Nils; Gulla, Jon Atle. (2021) Neural Networks for Entity Matching: A Survey. ACM Transactions on Knowledge Discovery from Data Academic literature review 2020 Liu, Peng; Marco, Cristina; Gulla, Jon Atle. (2020) Semi-supervised Sentiment Analysis for Under-resourced Languages with a Sentiment Lexicon. CEUR Workshop Proceedings Academic article Özgöbek, Özlem; Kille, Benjamin; Gulla, Jon Atle; Lommatzsch, Andreas. (2020) 7th international workshop on news recommendation and analytics (INRA 2019). CEUR Workshop Proceedings Editorial 2019 Liu, Peng; Zhang, Lemei; Gulla, Jon Atle. (2019) Dynamic attention-based explainable recommendation with textual and visual fusion. Information Processing & Management Academic article Zhang, Lemei; Liu, Peng; Gulla, Jon Atle. (2019) Dynamic attention-integrated neural network for session-based news recommendation. Machine Learning Academic article Özgöbek, Özlem; Kille, Benjamin; Gulla, Jon Atle; Lommatzsch, Andreas. (201",
  "content_length": 73373,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:21"
}