{
  "name": "Jon M. Kleinberg",
  "homepage": "https://www.cs.cornell.edu/home/kleinber",
  "status": "success",
  "content": "Jon Kleinberg's Homepage Jon Kleinberg Tisch University Professor Department of Computer Science Department of Information Science Cornell University Ithaca, NY 14853 I am a professor at Cornell University. My research focuses on algorithms and networks, the roles they play in large-scale social and information systems, and their broader societal implications. My work has been supported by an NSF Career Award, an ONR Young Investigator Award, a MacArthur Foundation Fellowship, a Packard Foundation Fellowship, a Simons Investigator Award, a Sloan Foundation Fellowship, a Vannevar Bush Faculty Fellowship, and grants from Facebook, Google, Yahoo, the MacArthur and Simons Foundations, and the AFOSR, ARO, and NSF. I am a member of the National Academy of Sciences, the National Academy of Engineering, the American Academy of Arts and Sciences, and the American Philosophical Society. Link to: Contact information. Books and Teaching Since Spring 2021, Karen Levy and I have been teaching a course entitled Choices and Consequences in Computing (INFO 1260 / CS 1340). The course is designed at an introductory level with no formal prerequisites, and covers a range of ethical, societal, and policy implications of computing and information. D. Easley, J. Kleinberg. Networks, Crowds, and Markets: Reasoning About a Highly Connected World. Cambridge University Press, 2010. This book is based on an inter-disciplinary course that we teach entitled Networks. The book, like the course, is designed at the introductory undergraduate level with no formal prerequisites. To support deeper explorations, most of the chapters are supplemented with optional advanced sections. There is an on-line edX course based on the book: Networks, Crowds, and Markets, taught jointly with David Easley and Eva Tardos. J. Kleinberg, E. Tardos. Algorithm Design. Addison Wesley, 2005. This book is based on the undergraduate algorithms course that we both teach. We also use the more advanced parts for our graduate algorithms course. I teach a PhD-level course on network models, entitled The Structure of Information Networks (CS 6850). Advising Current and former Ph.D. students: Katy Blumer, Cazamere Comrie, Yanbang Wang, Ben Laufer (co-adv. with Helen Nissenbaum), Emily Ryu (co-adv. with Eva Tardos), Kenny Peng (co-adv. with Nikhil Garg), Sophie Greenwood (co-adv. with Nikhil Garg), Katherine Van Koevering (2025), Marios Papachristou (2025), Kiran Tomlinson (2024), Anna Evtushenko (2024), Kate Donahue (2024), Michela Meister (2024), Manish Raghavan (2021), Maithra Raghu (2020), Rediet Abebe (2019), Rahmtin Rotabi (2017), Isabel Kloumann (2016), Johan Ugander (2014), Sigal Oren (2013), Tim Novikoff (2013, co-adv. with Steve Strogatz), Shaomei Wu (2012, co-adv. with Dan Cosley, Michael Macy), Daniel Romero (2012), Lars Backstrom (2009), Alex Slivkins (2006), Mark Sandler (2006), Elliot Anshelevich (2005), David Kempe (2003), Amit Kumar (2002), Debra Goldberg (2001), Current and former postdocs (and associated visiting scientist / research assistant professor positions): David M. Liu, Harini Suresh (2024), Lydia Liu (2024), Jonas Juul (2022), Nate Veldt (2021), David Robinson (2021), Hoda Heidari (2020), Austin Benson (2018), Flavio Chierichetti (2012), Jure Leskovec (2009), Sid Suri (2008), Gregory Kossinets. (2008), Mohammad Mahdian (2006), Frank McSherry (2003), Anupam Gupta (2001). Research Papers The papers below are also available in a chronological list. Additional bibliographic information can be found at DBLP and Google Scholar. Recent Papers J. Kleinberg, F. Wei. Density Measures for Language Generation. Proc. 66th IEEE Symposium on Foundations of Computer Science (FOCS), 2025. S. Greenwood, K. Levy, S. Barocas, H. Heidari, J. Kleinberg. Designing algorithmic delegates: The role of indistinguishability in human-AI handoff. Proc. 26th ACM Conference on Economics and Computation (EC), 2025. G. Noti, K. Donahue, J. Kleinberg, S. Oren. AI-Assisted Decision Making with Human Learning. Proc. 26th ACM Conference on Economics and Computation (EC), 2025. R. Movva, K. Peng, N. Garg, J. Kleinberg, E. Pierson. Sparse Autoencoders for Hypothesis Generation. Proc. 42nd Intl. Conf. on Machine Learning (ICML), 2025. K. Donahue, J. Kleinberg. Private Blotto: Viewpoint Competition with Polarized Agents. Proc. 39th AAAI Conference on Artificial Intelligence (AAAI-25), 2025. K. Peng, N. Garg, J. Kleinberg. A No Free Lunch Theorem for Human-AI Collaboration. Proc. 39th AAAI Conference on Artificial Intelligence (AAAI-25), 2025. K. Tomlinson, T. Namjoshi, J. Ugander, J. Kleinberg. Replicating Electoral Success. Proc. 39th AAAI Conference on Artificial Intelligence (AAAI-25), 2025. E. Pierson, D. Shanmugam, R. Movva, J. Kleinberg, M. Agrawal, M. Dredze, K. Ferryman, J.W. Gichoya, D. Jurafsky, P.W. Koh, K. Levy, S. Mullainathan, Z. Obermeyer, H. Suresh, K. Vafa. Using Large Language Models to Promote Health Equity. New England Journal of Medicine AI (NEJM AI) 2(2), 2025. K. Blumer, J. Kleinberg. Tracking Patterns in Toxicity and Antisocial Behavior Over User Lifetimes on Large Social Media Platforms. Scientific Reports 15(25369), 2025. K. Tomlinson, J. Ugander, J. Kleinberg. Exclusion Zones of Instant Runoff Voting. arXiv/2502.16719, 2025. K. Vafa, S. Bentley, J. Kleinberg, S. Mullainathan. What's Producible May Not Be Reachable: Measuring the Steerability of Generative Models. arXiv/2503.17482, 2025. B. Laufer, J. Kleinberg, H. Heidari. The Backfiring Effect of Weak AI Safety Regulation. arXiv/2503.20848, 2025. M. Papachristou, J. Kleinberg. Echoes of Disagreement: Measuring Disparity in Social Consensus. arXiv/2504.07480, 2025. K. Peng, R. Movva, J. Kleinberg, E. Pierson, N. Garg. Use Sparse Autoencoders to Discover Unknown Concepts, Not to Act on Known Concepts. arXiv/2506.23845, 2025. Z. Tang, D. Jiao, E. Xue, R. McIlroy-Young, J. Kleinberg, S. Sen, A. Anderson. Learning to Imitate with Less: Efficient Individual Behavior Modeling in Chess. arXiv/2507.21488, 2025. T. Qiu, B. Laufer, J. Kleinberg, H. Heidari. A Formal Model of the Economic Impacts of AI Openness Regulation. arXiv/2507.14193, 2025. B. Laufer, H. Oderinwale, J. Kleinberg. Anatomy of a Machine Learning Ecosystem: 2 Million Models on Hugging Face. arXiv/2508.06811, 2025. J. Kleinberg, S. Mullainathan. Language Generation in the Limit. Advances in Neural Information Processing Systems (NeurIPS) 38, 2024. Z. Tang, D. Jiao, R. McIlroy-Young, J. Kleinberg, S. Sen, A. Anderson. Maia-2: A Unified Model for Human-AI Alignment in Chess. Advances in Neural Information Processing Systems (NeurIPS) 38, 2024. K. Vafa, J.Y. Chen, J. Kleinberg, S. Mullainathan, A. Rambachan. Evaluating the World Model Implicit in a Generative Model. Advances in Neural Information Processing Systems (NeurIPS) 38, 2024. Y. Wang, H. Cui, J. Kleinberg. Microstructures and Accuracy of Graph Recall by Large Language Models. Advances in Neural Information Processing Systems (NeurIPS) 38, 2024. B. Laufer, J. Kleinberg, H. Heidari. Fine-Tuning Games: Bargaining and Adaptation for General-Purpose Models. Proc. 33rd International World Wide Web Conference, 2024. C. Dwork, C. Hays, J. Kleinberg, M. Raghavan. Content Moderation and the Formation of Online Communities: A Theoretical Framework. Proc. 33rd International World Wide Web Conference, 2024. K. Peng, M. Raghavan, E. Pierson, J. Kleinberg, N. Garg. Reconciling the accuracy-diversity trade-off in recommendations. Proc. 33rd International World Wide Web Conference, 2024. K. Hamade, R. McIlroy-Young, S. Sen, J. Kleinberg, A. Anderson. Designing Skill-Compatible AI: Methodologies and Frameworks in Chess. Proc 12th International Conference on Learning Representations (ICLR), 2024. Y. Wang, J. Kleinberg. From Graphs to Hypergraphs: Hypergraph Projection and its Remediation. Proc 12th International Conference on Learning Representations (ICLR), 2024. C. Dwork, C. Hays, J. Kleinberg, M. Raghavan. Equilibria, Efficiency, and Inequality in Network Formation for Hiring and Opportunity. Proc. 25th ACM Conference on Economics and Computation (EC), 2024. J. Kleinberg, S. Oren, E. Ryu, E. Tardos. Modeling reputation-based behavioral biases in school choice. Proc. 25th ACM Conference on Economics and Computation (EC), 2024. M. Meister, J. Kleinberg. Containing the spread of a contagion on a tree. Proc. 23rd Intl. Conf. on Autonomous Agents and Multiagent Systems (AAMAS), 2024. K. Tomlinson, J. Ugander, J. Kleinberg. The Moderating Effect of Instant Runoff Voting. Proc. 38th AAAI Conference on Artificial Intelligence (AAAI-24), 2024. L.T. Liu, S. Barocas, J. Kleinberg, K. Levy. On the Actionability of Outcome Prediction. Proc. 38th AAAI Conference on Artificial Intelligence (AAAI-24), 2024. A. F. Cooper, K. Lee, M. Z. Choksi, S. Barocas, C. De Sa, J. Grimmelmann, J. Kleinberg, S. Sen, B. Zhang. Is My Prediction Arbitrary? The Confounding Effects of Variance in Fair Classification Benchmarks. Proc. 38th AAAI Conference on Artificial Intelligence (AAAI-24), 2024. J. Kleinberg, E. Ryu, E. Tardos. Calibrated Recommendations for Users with Decaying Attention. 17th International Symposium on Algorithmic Game Theory (SAGT), 2024. A. Hemida, A.B. Asghar, C. Kamhoua, J. Kleinberg. A Game-Theoretic Framework for Multi-Domain Cyber-Deception. Proc. IEEE European Symposium on Security and Privacy Workshops (EuroS&PW), 2024. J. Juul, A. Benson, J. Kleinberg. Hypergraph patterns and collaboration structure. Frontiers in Physics 11(2024). A. Evtushenko, J. Kleinberg. A comprehensive generalization of the Friendship Paradox to weights and attributes. Scientific Reports 14(13730), 2024. J. Kleinberg, J. Ludwig, S. Mullainathan, M. Raghavan. The Inversion Problem: Why Algorithms Should Infer Mental State and Not Just Predict Behavior. Perspectives on Psychological Science 19:5(2024). K. Van Koevering, J. Kleinberg. How Random is Random? Evaluating the Randomness and Humanness of LLMs' Coin Flips. arXiv/2406.00092, 2024. K. Van Ko",
  "content_length": 54960,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:29"
}