{
  "name": "Jon Chamberlain",
  "homepage": "https://www.essex.ac.uk/people/chamb94408/jon-chamberlain",
  "status": "success",
  "content": "Jon Chamberlain | University of Essex University of Essex homepage Skip to content I'm looking for... Courses Research People Something else Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities Person query We are different and we are the same. #WeAreEssex Search query Looking for student or staff information? Student Directory Staff Directory Courses Course query Course level Select Level Undergraduate Postgraduate Prefer to see our subject areas? Browse courses by subject Research Research query Looking for funded postgraduate opportunities? View doctoral training partnerships Browse postgraduate research opportunities People Person query We are different and we are the same. #WeAreEssex Something else Search query Looking for student or staff information? Student Directory Staff Directory University of Essex homepage Jon Chamberlain People Dr Jon Chamberlain Senior Lecturer School of Computer Science and Electronic Engineering (CSEE) Email jchamb@essex.ac.uk Telephone +44 (0) 1206 872366 Location 5A.538, Colchester Campus Academic support hours Academic support is available by pre-arranged Zoom meeting or face-to-face meeting. My support hours are 11am-1pm on Friday but please contact me by email to confirm you will attend or to arrange a meeting at a more convenient time. Research Teaching and supervision Publications Grants and funding Contact Research Teaching and supervision Publications Grants and funding Contact Research and professional activities Research interests Problem solving with collective intelligence and distributed human tasking (crowdsourcing/human computation) Key words: crowdsourcing Open to supervise Citizen science through games, gamification and games-with-a-purpose Key words: citizen science Open to supervise Computer vision in 3D modelled environments Key words: computer vision Open to supervise Teaching and supervision Current teaching responsibilities Coral Reef Biology (BS255) Tropical Marine Field Research Skills (BS256) Coral Reef Biodiversity and Management Field Trip (BS710) Web Development (CE154) Computer Vision (CE316) Computer Vision (CE866) Current supervision Reyhaneh Hashempour Degree subject: Computer Science Degree type: Doctor of Philosophy Richard Barry Raymond Lay-Flurrie Degree subject: Computer Science Degree type: Doctor of Philosophy Jessica Louise Rhodes Degree subject: Marine Biology Degree type: Doctor of Philosophy Emma Poliakova Degree subject: Computer Science Degree type: Doctor of Philosophy Previous supervision Jessica Paige Wright Thesis title: Computational Analysis of Reef Structure and Benthic Composition. Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 2/4/2024 Mahsa Abazari Kia Thesis title: Question-Driven Text Summarization with Extractive-Abstractive Frameworks. Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 24/4/2023 Edward Henry Longford Thesis title: Modelling Group Dynamics with Symlog and Snowdrift for Intelligent Classroom Environments Degree subject: Computing and Electronic Systems Degree type: Doctor of Philosophy Awarded date: 14/2/2022 Steven Edward Zimmerman Thesis title: Exploring Strategies to Prevent Harm From Web Search Degree subject: Computer Science Degree type: Doctor of Philosophy Awarded date: 24/2/2021 Publications Journal articles (11) Smallbone, JA., Gregson, BH., McGenity, TJ., Holland, RD., Whitby, C., Cameron, TC., Chamberlain, J., Clift, LG., Hynes, C. and McKew, BA., (2026). Effects of the 2023 Poole Harbour oil spill on sediment bacterial communities and ecosystem functioning. Marine Pollution Bulletin. 222 (3), 118904-118904 Wright, J. and Chamberlain, J., (2024). Investigating human impacts on rocky reefs using measures of complexity and relief from 3D photogrammetry. Ecosphere. 15 (2), e4763- Kia, MA., Garifullina, A., Kern, M., Chamberlain, J. and Jameel, S., (2024). Question-Driven Text Summarization Using an Extractive-Abstractive Framework. Computational Intelligence. 40 (3) Kia, MA., Garifullina, A., Kern, M., Chamberlain, J. and Jameel, S., (2022). Adaptable Closed-Domain Question Answering Using Contextualized CNN-Attention Models and Question Expansion. IEEE Access. 10, 45080-45092 Chamberlain, J., Turpin, B., Maged, A., Chatsiou, A. and O'Callaghan, K., (2021). Designing for Collective Intelligence and Community Resilience on Social Networks. Human Computation. 8 (2), 15-32 Chamberlain, J., Kruschwitz, U. and Poesio, M., (2018). Optimising crowdsourcing efficiency: Amplifying human computation with validation. it - Information Technology. 60 (1), 41-49 Russell-Rose, T., Chamberlain, J. and Azzopardi, L., (2018). Information retrieval in the workplace: A comparison of professional search practices. Information Processing and Management. 54 (6), 1042-1057 Paun, S., Carpenter, B., Chamberlain, JD., Hovy, D., Kruschwitz, U. and Poesio, M., (2018). Comparing Bayesian Models of Annotation. Transactions of the Association for Computational Linguistics. 6 (2018), 571-585 Russell-Rose, T. and Chamberlain, J., (2017). Expert Search Strategies: The Information Retrieval Practices of Healthcare Information Professionals. JMIR Medical Informatics. 5 (4), e33-e33 Russell-Rose, T. and Chamberlain, J., (2016). Searching for talent. Business Information Review. 33 (1), 40-48 Poesio, M., Chamberlain, J., Kruschwitz, U., Robaldo, L. and Ducceschi, L., (2013). Phrase detectives: Utilizing collective intelligence for internet-scale language resource creation. ACM Transactions on Interactive Intelligent Systems. 3 (1), 1-44 Show all Book chapters (4) Chamberlain, J., (2018). Using Social Media for Biomonitoring: How Facebook, Twitter, Flickr and Other Social Networking Platforms Can Provide Large-Scale Biodiversity Data. In: Advances in Ecological Research. Academic Press. 133- 168. 9780128143179 Chamberlain, J., Kruschwitz, U. and Poesio, M., (2013). Methods for Engaging and Evaluating Users of Human Computation Systems. In: Handbook of Human Computation. Editors: . Springer New York. 679- 694. 9781461488057 Chamberlain, J., Fort, K., Kruschwitz, U., Lafourcade, M. and Poesio, M., (2013). Using Games to Create Language Resources: Successes and Limitations of the Approach. In: The People?s Web Meets NLP : Collaboratively Constructed Language Resources. Editors: Gurevych, I. and Kim, J., . Springer. 3- 44. 9783642350849 Poesio, M., Diewald, N., Stührenberg, M., Chamberlain, J., Jettka, D., Goecke, D. and Kruschwitz, U., (2011). Markup Infrastructure for the Anaphoric Bank: Supporting Web Collaboration. In: Studies in Computational Intelligence. Editors: . Springer Berlin Heidelberg. 175- 195. 9783642226120 Conferences (50) Yu, J., Paun, S., Camilleri, M., Carretero Garcia, P., Chamberlain, J., Kruschwitz, U. and Poesio, M., (2023). Aggregating Crowdsourced and Automatic Judgments to Scale Up a Corpus of Anaphoric Reference for Fiction and Wikipedia Texts Garcia Seco De Herrera, A., Ionescu, B., Müller, H., Péteri, R., Ben Abacha, A., Friedrich, CM., Rückert, J., Bloch, L., Brüngel, R., Idrissi-Yaghir, A., Schäfer, H., Kozlovski, S., Dicente Cid, Y., Kovalev, V., Chamberlain, J., Clark, A., Campello, A., Schindler, H., Deshayes, J., Popescu, A., S¸tefan, L-D., Constantin, MG. and Dogariu, M., (2022). ImageCLEF 2022: Multimedia Retrieval in Medical, Nature, Fusion, and Internet Applications Chamberlain, J., Garcia Seco De Herrera, A., Campello, A. and Clark, A., (2022). ImageCLEFcoral task: Coral reef image annotation and localisation Ionescu, B., Müller, H., Péteri, R., Rückert, J., Abacha, AB., GARCIA SECO DE HERRERA, A., Friedrich, CM., Bloch, L., Brüngel, R., Idrissi-Yaghir, A., Schäfer, H., Kozlovski, S., Cid, YD., Kovalev, V., Ştefan, L-D., Constantin, MG., Dogariu, M., Popescu, A., Deshayes-Chossart, J., Schindler, H., Chamberlain, J., Campello, A. and Clark, A., (2022). Overview of the ImageCLEF 2022: Multimedia Retrieval in Medical, Social Media and Nature Applications Madge, C., Brightmore, J., Kicikoglu, D., Althani, F., Bartle, R., Chamberlain, J., Kruschwitz, U. and Poesio, M., (2022). LingoTowns: A Virtual World For Natural Language Annotation and Language Learning Madge, C., Bartle, R., Chamberlain, J., Kruschwitz, U. and Poesio, M., (2021). WordClicker: Tuning our approach for language resourcing Ionescu, B., Müller, H., Péteri, R., Ben Abacha, A., Demner-Fushman, D., Hasan, SA., Sarrouti, M., Pelka, O., Friedrich, C., Garcia Seco De Herrera, A., Jacutprakart, J., Kovalev, V., Kozlovski, S., Liauchuk, V., Dicente Cid, Y., Chamberlain, J., Clark, A., Campello, A., Moustahfid, H., Oliver, T., Schulz, A., Brie, P., Berari, R., Fichou, D., Tautenau, A., Dogariu, M., Stefan, LD., Constantin, MG., Deshayes, J. and Popescu, A., (2021). The 2021 ImageCLEF Benchmark: Multimedia Retrieval in Medical, Nature, Internet and Social Media Applications Brill, J., Albakour, D., Esquivel, J., Kruschwitz, U., Martinez, M. and Chamberlain, J., (2021). Signal Briefings: Monitoring News Beyond the Brand Wright, J., Palosanu, I-L., Clift, L., Garcia Seco De Herrera, A. and Chamberlain, J., (2021). Pixelwise annotation of coral reef substrates Ionescu, B., Müller, H., Péteri, R., Abacha, AB., Sarrouti, M., Demner-Fushman, D., Hasan, SA., Kozlovski, S., Liauchuk, V., Cid, YD., Kovalev, V., Pelka, O., Garcia Seco De Herrera, A., Jacutprakart, J., Friedrich, CM., Berari, R., Tauteanu, A., Fichou, D., Brie, P., Dogariu, M., Ştefan, LD., Constantin, MG., Chamberlain, J., Campello, A., Clark, A., Oliver, TA., Moustahfid, H., Popescu, A. and Deshayes-Chossart, J., (2021). Overview of the ImageCLEF 2021: Multimedia Retrieval in Medical, Nature, Internet and Social Media Applications Chamberlain, J., Garcia Seco De Herrera, A., Campello, A., Clark, A., Oliver, TA. ",
  "content_length": 22091,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:21"
}