{
  "name": "Jon McCormack",
  "homepage": "https://research.monash.edu/en/persons/jon-mccormack",
  "status": "success",
  "content": "Jon McCormack - Monash University Jon McCormack public CV View Scopus Profile Jon McCormack Professor Professor, Department of Human Centred ComputingFaculty of Art, Design and Architecture https://orcid.org/0000-0001-6328-5064 EmailJon.McCormackmonashedu Accepting PhD StudentsPhD projectshttps://sensilab.monash.edu/work-with-us/practice-based-phd/ 1992 …2025 Research activity per year Personal profile BiographyProfessor Jon McCormack is jointly appointed in the Faculty of Art Design & Architecture (MADA) and Faculty of Information Technology. He is the founder and director of SensiLab.Research interestsComputational Creativity Human-machine interfaces Tangible interfaces Cybernetic systems Agent-based modelling Visualisation and virtual environments Electronic Media Art Evolutionary Music and Art Artificial Life Computer Music Generative SystemsSupervision interestsComputational Creativity Human-machine interfaces Tangible interfaces Cybernetic systems Agent-based modelling Visualisation and virtual environments Electronic Media Art Evolutionary Music and Art Artificial Life Computer Music Generative Systems Monash teaching commitmentResearch only staff member Education/Academic qualificationComputer Science, Doctor of Philosophy, Monash UniversityAward Date: 15 Oct 2004Computer Science / Applied Mathematics, Bachelor of Science Honours, Monash UniversityAward Date: 1 Nov 1987Film and Animation, Graduate Diploma of Art (Film and Television), Swinburne University of TechnologyAward Date: 1 Nov 1986Computer Science / Applied Mathematics, Bachelor of Science, Monash UniversityAward Date: 1 Oct 1985 Research area keywordsARTS/HUMANITIES/CULTURAL ACTIVITIESArt Works/ArtifactsArtificial Intelligence/CyberneticsArtificial LifeElectronic Media ArtEvolutionary ComputingComputer MusicComputer GraphicsCreativityDevelopmental ModelsDigital Computers/ComputingDigital DesignDigital MusicDigital imaging and photomediaEcosystemsElectronic MediaEvolutionary computingGenerative ArtL-SystemsMorphogenesisSound ArtsVirtual RealityVisual ArtsVisualizationInteraction DesignAugmented RealityMusic Composition Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2003 2018 2020 2023 2027 5 Active 23 Finished Projects per year Making Crime Pay: Manufacturing Heritage Experiences in a Digital AgeMaxwell-Stewart, H. (Primary Chief Investigator (PCI)), Wise, J. (Chief Investigator (CI)), Roberts, D. A. (Chief Investigator (CI)), Gibbs, M. D. (Chief Investigator (CI)), Moore, A. (Chief Investigator (CI)), Lueg, C. (Partner Investigator (PI)), Twidale, M. (Partner Investigator (PI)), McCormack, J. (Chief Investigator (CI)) & Carlin, S. (Partner Investigator (PI))ARC - Australian Research Council, University of New England (Australia)22/10/23 → 21/10/26Project: Research Project 44 - Generative architectural design engine Cruz Gambardella, C. (Primary Chief Investigator (PCI)), Phung, D. (Chief Investigator (CI)), McCormack, J. (Chief Investigator (CI)), Cai, J. (Chief Investigator (CI)), Murray, S. (Chief Investigator (CI)), Weiss, K.-H. (Chief Investigator (CI)), Patterson, D. (Chief Investigator (CI)), Huang, S. (Chief Investigator (CI)) & Gribble, A. (Chief Investigator (CI))1/07/23 → 30/06/26Project: Research Explainable Artificial CreativityMcCormack, J. (Primary Chief Investigator (PCI)) & Colton, S. (Partner Investigator (PI))1/03/22 → 28/02/26Project: Research Building 4.0 CRC: Better buildings, new efficiencies through technology and collaborationAitchison, M. (Primary Chief Investigator (PCI)), Ngo, T. D. (Chief Investigator (CI)), Maxwell, D. (Chief Investigator (CI)), Couper, R. (Chief Investigator (CI)), Breen Lovett, S. (Chief Investigator (CI)), Cumarasamy, S. (Project Manager), Blue, K. (Project Manager), Laverty, C. (Project Manager), Gerber, P. (Chief Investigator (CI)), Merkoulova, Y. (Chief Investigator (CI)), Sohal, A. (Chief Investigator (CI)), Dare, R. (Chief Investigator (CI)), Moehler, R. (Chief Investigator (CI)), Nicholson, A. (Chief Investigator (CI)), Grundy, J. (Chief Investigator (CI)), Garcia De La Banda Garcia, M. (Chief Investigator (CI)), McCormack, J. (Chief Investigator (CI)), Vu, L. H. (Chief Investigator (CI)), Dwyer, T. (Chief Investigator (CI)), Murray, S. (Chief Investigator (CI)), Kulic, D. (Chief Investigator (CI)), Bai, Y. (Chief Investigator (CI)), Davies, C. (Chief Investigator (CI)), Zhou, J. (Chief Investigator (CI)), Duffield, C. (Chief Investigator (CI)), Singh, P. J. (Chief Investigator (CI)), Bridge, A. (Chief Investigator (CI)), Erol, I. (Chief Investigator (CI)), Drogemuller, R. (Chief Investigator (CI)) & Mahendran, M. (Chief Investigator (CI))10/09/20 → 30/06/27Project: Research Conviction Politics: the convict routes of Australian democracyMoore, A. (Primary Chief Investigator (PCI)), McCormack, J. (Chief Investigator (CI)), Marriott, K. (Chief Investigator (CI)), Maxwell-Stewart, H. (Chief Investigator (CI)), Quinlan, M. (Chief Investigator (CI)), Carter, N. (Chief Investigator (CI)), Davis, M. (Chief Investigator (CI)), Brookes, J. (Partner Investigator (PI)) & Thomas, S. (Partner Investigator (PI))Union Education Foundation, University of Tasmania11/02/20 → 10/02/26Project: Research View all 28 projects Research output Research output per year 1992 2004 2009 2012 2020 2021 2022 2023 2024 2025 70 Conference Paper 29 Article 25 Chapter (Book) 4 Edited Book 21 More 3 Foreword / Postscript 3 Other 3 Editorial 3 Digital Creative Work 2 Design / Architecture 1 Book 1 Abstract 1 Paper 1 Comment / Debate 1 Curation 1 Software 1 Other contribution Research output per year Research output per year Mixer Metaphors: audio interfaces for non-musical applicationsMcNamara, T., McCormack, J. & Llano, M. T., 19 Jun 2025, Proceedings of the International Conference on New Interfaces for Musical Expression 2025. Buse Cavdir, D. & Berthaut, F. (eds.). NIME, 9 p. (Proceedings of the International Conference on New Interfaces for Musical Expression).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Transhuman Ansambl: a system for immersive and performative experience of music heritageIvsic, L., McCormack, J. & Dziekan, V., 2025, In: International Journal of Heritage Studies. 31, 11, p. 1391-1413 23 p.Research output: Contribution to journal › Article › Research › peer-review Open Access Visually-Led Design for Gestural Audiovisual InstrumentsTrolland, S., Ilsar, A. & McCormack, J., 19 Jun 2025, Proceedings of the International Conference on New Interfaces for Musical Expression 2025. Buse Cavdir, D. & Berthaut, F. (eds.). NIME, 9 p. (Proceedings of the International Conference on New Interfaces for Musical Expression).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Building Simulations with Generative Artificial IntelligenceMcCormack, J. & Grierson, M., 2024, Climate Disaster Preparedness: Reimagining Extreme Events through Art and Technology. Del Favero, D., Thurow, S., J. Ostwald, M. & Frohne, U. (eds.). Cham Switzerland: Springer, p. 137-150 13 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Research › peer-review Open AccessFile Designing Cultural Experiences within Technosocial SystemsDziekan, V., McCormack, J., Ivšić, L., Raby, O. & Rajcic, N., 2024, Museums and Technologies of Presence. Shehade, M. & Stylianou-Lambert, T. (eds.). Oxon UK: Routledge, p. 74-92 19 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Research › peer-review 1 Citation (Scopus) View all 149 research outputs Prizes 2022 Designers Australia Awards, Use Category - Award of Merit: Blundstone Intelligent FootwearPage, R. (Recipient), Wilson, E. (Recipient), Dickinson, A. (Recipient), McCormack, J. (Recipient), Armstrong, M. (Recipient), Flynn, D. (Recipient), Kidd, R. (Recipient), Brown, H. (Recipient), Morfuni, R. (Recipient) & Kerley, B. (Recipient), 2022Prize: Prize (including medals and awards) 2022 Good Design Award, Design Research, Gold Winner: Blundstone Intelligent Footwear for HealthcareWilson, E. (Recipient), Page, R. (Recipient), Dickinson, A. (Recipient), McCormack, J. (Recipient), Armstrong, M. (Recipient), Flynn, D. (Recipient), Kidd, R. (Recipient), Morfuni, R. (Recipient) & Kerley, B. (Recipient), 2022Prize: Prize (including medals and awards) On the Machine Condition and its Creative ExpressionLlano Rodriguez, T. (Recipient), Colton, S. (Recipient), Pease, A. (Recipient), Guckelsberger, C. (Recipient) & McCormack, J. (Recipient), Sept 2020Prize: Prize (including medals and awards) Activities Activities per year 2008 2008 2010 2011 2016 2020 2020 3 External research organisation, centre or institute 1 Editorial responsibility 1 Public lecture/debate/seminar Activities per year Human collaboration with an AI musicianLlano Rodriguez, T. (Contributor), McCormack, J. (Contributor), Ilsar, A. (Contributor), d’Inverno, M. (Contributor) & Yee-King, M. (Contributor)Oct 2020 → …Activity: Community Talks, Presentations, Exhibitions and Events › Public lecture/debate/seminar Member - Faculty Research Committee - Faculty of Information Technology, Monash UniversityMcCormack, J. (Member)1 Jan 2016Activity: External Academic Engagement › External research organisation, centre or institute Artist in Residence - Ars Electronica Future LabMcCormack, J. (Visitor)1 Sept 2011 → 31 Jul 2012Activity: External Academic Engagement › External research organisation, centre or institute Visiting Research Fellow - Goldsmith University of LondonMcCormack, J. (Fellow)1 Jan 2010 → 31 Dec 2012Activi",
  "content_length": 12123,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:28"
}