{
  "name": "Jonathan Shapiro",
  "homepage": "https://www.research.manchester.ac.uk/portal/jonathan.l.shapiro.html",
  "status": "success",
  "content": "Jonathan Shapiro - Research Explorer The University of Manchester Jonathan Shapiro Dr Reader, Machine Learning and Robotics https://orcid.org/0000-0002-9572-9544 Personal profile BiographyI am a Reader in the School of Computer Science, where I teach and carry out research on machine learning, probabilistic modeling and evolutionary algorithms. I have particular interests in reinforcement learning and active learning for optimization. I am the head of the Machine Learning and Optimization Research Group in the School of Computer Science, Deputy Director of CICADA, an interdisciplinary project on hybrid systems spaning the schools of Computer Science, Control Engineering and Mathematics. I have previously been associated with the Santa Fe Institute, through their programs on Adaptive Computation and Evolutionary Dynamics and by directing their Complex Systems Summer School in 2003. Previously, I was a research theoretical physicist at the University of Manchester and the University of California, where I did research on condensed matter physics.My groupData Science InstituteMachine Learning and OptimisationOpportunitiesI currrently have projects in machine learning applied to optimization, learning in multi-agent systems and methods of adaptation in hybrid dynamical systems associated with the CICADA project. Students with a good background in probabilistic mathematics or physics are particularly welcome. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Research Beacons, Institutes and PlatformsDigital FuturesKeywordsEstimation of Distribution AlgorithmsEvolutionary ComputationLearning in GamesMachine LearningReinforcement Learning Fingerprint Dive into the research topics where Jonathan Shapiro is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Temporal Sequence Computer Science 100% Associative Memory Computer Science 83% Reinforcement Learning Computer Science 66% Model Complexity Computer Science 66% Bayesian Networks Computer Science 66% Intrinsic Delay Computer Science 66% Robot Engineering 66% Candidate Solution Engineering 66% View full fingerprint Research output 30 Conference contribution 14 Article 1 Chapter Research output per year Research output per year A Bayesian Approach to Dealing with Device Heterogeneity in an Indoor Positioning SystemDavies, K., Jones, I. & Shapiro, J., 2018, IPIN 2018 - 9th International Conference on Indoor Positioning and Indoor Navigation. 8533730. (2018 International Conference on Indoor Positioning and Indoor Navigation (IPIN)).Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Bayesian Approach 100% Indoor Positioning Systems 100% Access Point 100% Bayesian 100% Probabilistic Model 100% Opponent Modelling by Expectation-Maximisation and Sequence Prediction in Simplified PokerMealing, R. & Shapiro, J. L., 1 Mar 2017, In: IEEE Transactions on Computational Intelligence and AI in Games. 9, 1, p. 11-24 14 p.Research output: Contribution to journal › Article › peer-review Open AccessFile Learning Algorithm 100% 996 Downloads (Pure) Convergence of Strategies in Simple Co-Adapting GamesMealing, R., Shapiro, J. L., He, J. (Editor), Jansen, T. (Editor), Ochoa, G. (Editor) & Zarges, C. (Editor), 2015, Proceedings of the 2015 ACM Conference on Foundations of Genetic Algorithms XIII, Aberystwyth, United Kingdom, January 17 - 20, 2015. He, J., Jansen, T., Ochoa, G. & Zarges, C. (eds.). ACM Digital Library: Association for Computing Machinery, p. 176-190 15 p.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review File Detection Method 100% Change Detection Method 100% 435 Downloads (Pure) Detecting and reducing redundancy in alarm networksButters, T. D., Guttel, S. & Shapiro, J. L., 2015, {IEEE} International Conference on Automation Science and Engineering, {CASE} 2015, Gothenburg, Sweden, August 24-28, 2015. p. 1224-1229 6 p.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review Run-Time Analysis of Population-Based Evolutionary Algorithm in Noisy EnvironmentsPrügel-Bennett, A., Rowe, J., Shapiro, J., He, J. (Editor), Jansen, T. (Editor), Ochoa, G. (Editor) & Zarges, C. (Editor), 2015, Proceedings of the 2015 ACM Conference on Foundations of Genetic Algorithms XIII, Aberystwyth, United Kingdom, January 17 - 20, 2015. He, J., Jansen, T., Ochoa, G. & Zarges, C. (eds.). ACM Digital Library: Association for Computing Machinery, p. 69-75 7 p.Research output: Chapter in Book/Conference proceeding › Conference contribution › peer-review File Evolutionary Algorithm 100% Function Evaluation 66% Variance 33% Noise Variance 33% 515 Downloads (Pure) View all 45 research outputs Projects 1 Finished Projects per year New generation algorithims using historical data and market and human behaviour change to optimise clients' return on investmentAllmendinger, R. (PI) & Shapiro, J. (CoI)1/01/17 → 31/12/18Project: Research Return on Investment 100% Historical Data 100% Knowledge Transfer 50% Computer Science 50% Digital Product 50% Impacts Making industrial installations safer and more efficient by identifying real and false alarmsButters, T. (Participant), Guettel, S. (Participant), Higham, N. (Participant) & Shapiro, J. (Participant)Impact: Economic",
  "content_length": 5574,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:09"
}