{
  "name": "Jonathan Berant",
  "homepage": "http://www.cs.tau.ac.il/~joberant",
  "status": "success",
  "content": "Jonathan Berant Jonathan Berant Associate Professor The Blavatnik School of Computer Science Tel-Aviv University Checkpoint 255 +972-3-640-6718 joberant@cs.tau.ac.il [Publications] [Resources] Sabbatical I am currently on leave of absence at Google (based in Seattle) and am not taking students until summer 2026. Research My field of research is Natural Language Processing. I work on Natural Language Understanding problems such as Semantic Parsing, Question Answering, Paraphrasing, Reading Comprehension, and Textual Entailment. I am mostly excited about learning from weak supervision that is easy to obtain and grounded in the world, and in tasks that require multi-step inference or handling of language compositionality. I am an associate professor at the Blavatnik School of Computer Science, and a Research Scientist and The Allen Institute for Artificial Intelligence. Publications that are part of the ERC DELPHI project are listed here. Ph.D Students Ohad Rubin Samuel Amouyal Ori Yoran Alumni M.Sc: Dor Muhlgay (moved to AI21), Omri Koshorek (moved to AI21), Guy Tevet (moved to Google), Veronica Latcinnik (moved to Loora), Omer Goldman (moved to Ph.D at BIU), Matan Hasson, Inbar Oren (moved to Second Nature), Ori Yoran (moved to Ask AI), Uri Katz (moved to Ph.D. at BIU with Yoav Goldberg), Elad Segal (moved to Loora), Samuel Amouyal (to start Ph.D.), Gai Gutherz (at Google), Guy Dar, Itay Levy. Ph.D: Alon Talmor (moved to Allen Institute for AI), Mor Geva (moved to the Allen Institute for AI), Jonathan Herzig (moved to Google Research), Ben Bogin (at Ask-AI and moving to AI2/UW), Tomer Wolfson (moved to post-doc at UPenn), Maor Ivgi (moved to SSI). Post-docs: Ankit Gupta (moved to IBM research). Teaching Advanced Topics in NLP seminar: Ongoing NLP: Spring 2017, Spring 2018, Spring 2019, Fall 2019 First Steps in Research: Fall 2018, Fall 2019 Undergrad seminar in NLP: Spring 2020 Education 2015-16: Post-doctoral researcher at Google Mountain View 2012-15: Post-doctoral fellow at Stanford University with Percy Liang and Chris Manning 2006-12: Ph.D from Tel-Aviv University. Advisors: Ido Dagan, Jacob Goldberger, Eytan Ruppin. Thesis: Global Learning of Textual Entailment Graphs. 2003-06: B.Sc in Computer Science and Linguistics, Tel-Aviv University",
  "content_length": 2283,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:36"
}