{
  "name": "Jonathan Barrett",
  "homepage": "https://www.cs.ox.ac.uk/people/jonathan.barrett",
  "status": "success",
  "content": "Jonathan Barrett | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleJonathan BarrettJonathan Barrett Professor Jonathan Barrett Director of Graduate StudiesProfessor of Computer Science (Quantum Information Science)Governing Body Fellow, Wolfson CollegeE: jonathan.barrett@cs.ox.ac.ukT: +44 1865 273842Wolfson Building, Parks Road, Oxford OX1 3QD Themes:QuantumCompleted Projects:QISSInterestsMy research is interdisciplinary, spanning computer science, physics and the philosophy of physics. My main interests are in quantum information science and the foundations of quantum theory. My work focuses on developing new ways in which quantum systems can be used for tasks such as computation and cryptography, and on the use of tools from information science to address the conceptual problems of quantum theory.Selected PublicationsView AllManage publications The computational landscape of general physical theories J. Barrett‚ N. de Beaudrap‚ M. J. Hoban and C. M. Lee February, 2017. Details about The computational landscape of general physical theories | BibTeX data for The computational landscape of general physical theories | Link to The computational landscape of general physical theories Can a quantum state over time resemble a quantum state at a single time? D. Horsman‚ C. Heunen‚ M. F. Pusey‚ J. Barrett and R. W. Spekkens In Proceedings of the Royal Society A: Mathematical‚ Physical and Engineering Sciences. Vol. 473. Pages 20170395. 2017. Details about Can a quantum state over time resemble a quantum state at a single time? | BibTeX data for Can a quantum state over time resemble a quantum state at a single time? | DOI (10.1098/rspa.2017.0395) | Link to Can a quantum state over time resemble a quantum state at a single time? Thermodynamics and the structure of quantum theory M. Krumm‚ H. Barnum‚ J. Barrett and M.P. Müller In New Journal of Physics. Vol. 19. No. 4. 2017. Details about Thermodynamics and the structure of quantum theory | BibTeX data for Thermodynamics and the structure of quantum theory | DOI (10.1088/1367-2630/aa68ef) ActivitiesQuantum Group Current Student Shengqiao  Luo Past Students Isaac FriendVojtech HavlicekJames HeffordHlér KristjánssonCiaran LeeRobin LorenzLuca MondadaNick OrmrodNicola PinzaniSubhayan Roy MoulikCarlo Maria ScandoloTein van der LugtMatthew Wilson Past Researchers Cristina CirstoiuResearch AssociateOwen MaroneySina SalekNathan WalkAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2699,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:32"
}