{
  "name": "Jonathan P. Whiteley",
  "homepage": "https://www.cs.ox.ac.uk/people/jonathan.whiteley",
  "status": "success",
  "content": "Jonathan Whiteley | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleJonathan WhiteleyJonathan Whiteley Professor Jonathan Whiteley Deputy Director of Graduate StudiesAssociate Professor of Computer ScienceGoverning Body Fellow, Linacre CollegeE: Jonathan.Whiteley@cs.ox.ac.ukT: +44 1865 273858 Room 365, Wolfson Building, Parks Road, Oxford OX1 3QD United Kingdom Themes:Computational Biology and Health InformaticsCompleted Projects:more…InterestsMy research focuses on mathematical modelling and scientific computing related to multiscale, multiphysics problems arising in physiology and biology.BiographyI received the BA, MA and DPhil degrees from the University of Oxford. After holding various temporary posts at the University of Oxford and the University of Sydney I was appointed to a University Lectureship.Selected PublicationsView AllManage publications Sensitivity of cartilage mechanical behaviour to spatial variations in material properties J.P. Whiteley‚ C.P. Brown and E.A. Gaffney In Journal of the Mechanical Behavior of Biomedical Materials. Vol. 156. Pages 106575. 2024. Details about Sensitivity of cartilage mechanical behaviour to spatial variations in material properties | BibTeX data for Sensitivity of cartilage mechanical behaviour to spatial variations in material properties | DOI (https://doi.org/10.1016/j.jmbbm.2024.106575) Modelling articular cartilage: the relative motion of two adjacent poroviscoelastic layers J.P. Whiteley‚ C.P. Brown and E.A. Gaffney In Mathematical Medicine and Biology. Vol. 39. Pages 251−298. 2022. Details about Modelling articular cartilage: the relative motion of two adjacent poroviscoelastic layers | BibTeX data for Modelling articular cartilage: the relative motion of two adjacent poroviscoelastic layers | DOI (10.1093/imammb/dqac005) Model Reduction for Initial Value ODEs A. Ambuehl and J.P. Whiteley In Mathematical Biosciences. Vol. 337. Pages 108618. 2021. Details about Model Reduction for Initial Value ODEs | BibTeX data for Model Reduction for Initial Value ODEs | DOI (10.1016/j.mbs.2021.108618) Completed ProjectsChasteAdaptive finite element computations of nonlinear elasticity problems Past Students Antonietta AmbuehlDouglas BruceLloyd ChapmanKatie LeonardPhilip MaybankJames MountainMargarita SatrakiDavid StoneAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 2590,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:00"
}