{
  "name": "Jonathan Crowcroft",
  "homepage": "https://www.cl.cam.ac.uk/~jac22",
  "status": "success",
  "content": "Jon Crowcroft's Cyberhome Computer Laboratory > People > Jon Crowcroft's Home Page Cal: agenda + bio + pix + week + family PPP: papers + professments + projects + blog + stories E-mail: Jon.Crowcroft@cl.cam+but do NOT snail mail - I may not pick it up for months www: under new management + giving(sober october) + saving the planet I am the Marconi Professor of Communications Systems in the Computer Lab, at the University of Cambridge, almost exactly 100 years after Marconi's \"groundbreaking\" first transatlantic wireless call, and researcher-at-large at the Turing Inst. and i am a fellow of Wolfson College; plus Visiting Prof at Imperial I-X and DoC; 25 years ago, i was a professor in the Department of Computer Science University College London. i was also an honorary prof in stats there. i graduated in Physics from Trinity College, Cambridge University in 1979. i got an MSc in Computing in 1981, and PhD in 1993 both from UCL. (before that i even went to primary and 2ndary school once). i'm a fellow of the Royal Society, the ACM, the British Computer Society, the IET the Royal Academy of Engineering and the IEEE. I'm a member of UCU and have been (or its equivalent) since 1979. Technical advisory boards i am on include Matrix, Dataswyft, Foundation for Information Policy Research. IMDEA Networks. input part II principles of communications & course blog Part II projects mphil network architecture Part III, ACS projects Advice on technical writing and speaking research current phd students The Turing Inst: Trustworthy Digital Infrastructure, interest group + annual conference + policy + old ideas and reading. The Centre for ReDecentralisation including EPSRC funded CAMB project Cyber Security + Science and Policy for UK gov, with Digital Statescraft future phds: my reading+roles+movies -- the future is already here, its just unfairly distributed output net ideas blog papers + talks + projects gadgets + ware (books/code) + tabs (cure) + names xen (x), & Zen), & raspberry pi (r) and unikernels music i was involved in past students, work and whereabouts, and advisor family tree conferences FLedge ai Nov 8 2025, HK journals journal & blog & zenodoon Data&Policy Federated Learning meets IoT IEEE/Transactions on Networks editor at large Communications of the ACM Research Highlights IEEE Communications Surveys and Tutorials and IEEE Network Magazine Internet Protocol Journal Powered by Web 0.95 Technology. Last touched 17/11/25",
  "content_length": 2461,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:33"
}