{
  "name": "Jonathan Immanuel Brachthäuser",
  "homepage": "https://se.cs.uni-tuebingen.de/team/brachthaeuser",
  "status": "success",
  "content": "Universität Tübingen - Jun.-Prof. Dr. Jonathan Immanuel Brachthäuser Jun.-Prof. Dr. Jonathan Immanuel Brachthäuser Head of the SE research group Jonathan Brachthäuser Software Engineering FB Informatik Universität Tübingen Sand 13 72076 Tübingen Germany Telephone+49 - (0) 70 71 - 29 - 75491 E-Mailjonathan.brachthaeuser(at)uni-tuebingen.de OfficeB215 Office hoursby appointment Publications on Google Scholar Publications on DBLP SELECTED RESEARCH AREAS Ergonomic Type- and Effect Systems Structuring Complex Control Flow Efficient Compilation Publications Publications 2025 The Simple Essence of Monomorphization by Matthew Lutze, Philipp Schuster, and Jonathan Immanuel Brachthäuser In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA), 2025. Dynamic Wind for Effect Handlers by David Voigt, Philipp Schuster, and Jonathan Brachthäuser In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA), 2025. Compiling Classical Sequent Calculus to Stock Hardware: The Duality of Compilation by Philipp Schuster, Marius Müller, Klaus Ostermann, and Jonathan Immanuel Brachthäuser In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA), 2025. Multiple Resumptions and Local Mutable State, Directly by Serkan Muhcu, Philipp Schuster, Michel Steuwer, and Jonathan Brachthäuser In Proceedings of the International Conference on Functional Programming (ICFP), 2025. Tracing Just-in-time Compilation for Effects and Handlers by Marcial Gaißert, CF Bolz-Tereick, and Jonathan Brachthäuser In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA), 2025. The Simple Essence of Overloading: Making Ad-Hoc Polymorphism More Algebraic with Flow-Based Variational Type-Checking by Jiří Beneš and Jonathan Brachthäuser In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA), 2025. Publications 2024 Qualifying System F-sub by Edward Lee, Yaoyu Zhao, Ondřej Lhoták, James You, Kavin Satheeskumar, and Jonathan Immanuel Brachthäuser In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA), 2024. Publications 2023 Back to Direct Style: Typed and Tight by Marius Müller, Philipp Schuster, Jonathan Immanuel Brachthäuser, and Klaus Ostermann In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA), 2023. From Capabilities to Regions: Enabling Efficient Compilation of Lexical Effect Handlers by Marius Müller, Philipp Schuster, Jonathan Lindegaard Starup, Klaus Ostermann, and Jonathan Immanuel Brachthäuser In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA), 2023. With or Without You: Programming with Effect Exclusion by Matthew Lutze, Magnus Madsen, Jonathan Immanuel Brachthäuser, and Philipp Schuster In Proceedings of the International Conference on Functional Programming (ICFP). ACM Press, 2023. Getting into the Flow: Towards Better Type Error Messages for Constraint-Based Type Inference by Ishan Bhanuka, Lionel Parreaux, David Binder, and Jonathan Immanuel Brachthäuser In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA), 2023. Publications 2022 Effects, Capabilities, and Boxes: From Scope-based Reasoning to Type-based Reasoning and Back by Jonathan Immanuel Brachthäuser, Philipp Schuster, Edward Lee, and Aleksander Boruch-Gruszecki In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA), 2022. Type-Level Programming with Match Types by Olivier Blanvillain, Jonathan Immanuel Brachthäuser, Maxime Kjaer, and Martin Odersky In Proc. ACM Program. Lang. 6(POPL). Association for Computing Machinery, 2022. Region-based Resource Management and Lexical Exception Handlers in Continuation-Passing Style by Philipp Schuster, Jonathan Immanuel Brachthäuser, and Klaus Ostermann In European Symposium on Programming (ESOP 2022), 2022. A Typed Continuation-Passing Translation for Lexical Effect Handlers by Philipp Schuster, Jonathan Immanuel Brachthäuser, Marius Müller, and Klaus Ostermann In Proceedings of the International Conference on Programming Language Design and Implementation (PLDI), 2022. What You See Is What You Get: Practical Effect Handlers in Capability-Passing Style by Jonathan Immanuel Brachthäuser In Ernst Denert Award for Software Engineering 2020. Springer International Publishing, 2022. Publications 2021 All About That Stack: A Unified Treatment of Regions and Control Effects by Philipp Schuster, Jonathan Immanuel Brachthäuser, and Klaus Ostermann Technical report. University of Tübingen, Germany, 2021. Tracking Captured Variables in Types by Aleksander Boruch-Gruszecki, Jonathan Immanuel Brachthäuser, Edward Lee, Ondrej Lhoták, and Martin Odersky In CoRR abs/2105.11896, 2021. Virtual ADTs for Portable Metaprogramming by Nicolas Stucki, Jonathan Immanuel Brachthäuser, and Martin Odersky In Proceedings of the 18th ACM SIGPLAN International Conference on Managed Programming Languages and Runtimes, pages 36–44. Association for Computing Machinery, 2021. Multi-Stage Programming with Generative and Analytical Macros by Nicolas Stucki, Jonathan Immanuel Brachthäuser, and Martin Odersky In Proceedings of the 20th ACM SIGPLAN International Conference on Generative Programming: Concepts and Experiences, pages 110–122. Association for Computing Machinery, 2021. Safer Exceptions for Scala by Martin Odersky, Aleksander Boruch-Gruszecki, Jonathan Immanuel Brachthäuser, Edward Lee, and Ondřej Lhoták In Proceedings of the 12th ACM SIGPLAN International Symposium on Scala, pages 1–11. Association for Computing Machinery, 2021. Representing Monads with Capabilities by Jonathan Brachthäuser, Aleksander Boruch-Gruszecki, and Martin Odersky Technical report. Higher-Order Programming with Effects (HOPE), 2021. Publications 2020 Effekt: Capability-Passing Style for Type- and Effect-Safe, Extensible Effect Handlers in Scala by Jonathan Immanuel Brachthäuser, Philipp Schuster, and Klaus Ostermann In Journal of Functional Programming 30: , 2020. Compiling Effect Handlers in Capability-Passing Style by Philipp Schuster, Jonathan Immanuel Brachthäuser, and Klaus Ostermann In Proceedings of the International Conference on Functional Programming (ICFP). ACM Press, 2020. Effect Handlers, Evidently by Ningning Xie, Jonathan Immanuel Brachthäuser, Daniel Hillerström, Philipp Schuster, and Daan Leijen In Proceedings of the International Conference on Functional Programming (ICFP). ACM Press, 2020. Effekt: Lightweight Effect Polymorphism for Handlers (Technical Report) by Jonathan Immanuel Brachthäuser, Philipp Schuster, and Klaus Ostermann Technical report. University of Tübingen, Germany, 2020. Effects as Capabilities: Effect Handlers and Lightweight Effect Polymorphism by Jonathan Immanuel Brachthäuser, Philipp Schuster, and Klaus Ostermann In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA). ACM Press, 2020. Design and Implementation of Effect Handlers for Object-Oriented Programming Languages by Jonathan Immanuel Brachthäuser PhD thesis. University of Tübingen, Germany, 2020. Publications 2019 Programming with Implicit Values, Functions, and Control by Jonathan Immanuel Brachthäuser and Daan Leijen Technical report MSR-TR-2019-7. Microsoft Research, 2019. Zero-cost Effect Handlers by Staging (Technical Report) by Philipp Schuster, Jonathan Immanuel Brachthäuser, and Klaus Ostermann Technical report. University of Tübingen, Germany, 2019. Publications 2018 Typing, Representing, and Abstracting Control: Functional Pearl by Philipp Schuster and Jonathan Brachthäuser In Proceedings of the International Workshop on Type-Driven Development. ACM Press, 2018. Publications 2017 Towards Naturalistic EDSLs using Algebraic Effects by Jonathan Immanuel Brachthäuser In Workshop for Domain Specific Languages, Design and Implementation (DSLDI), 2017. Effekt: Extensible Algebraic Effects in Scala (Short Paper) by Jonathan Immanuel Brachthäuser and Philipp Schuster In Proceedings of the International Symposium on Scala. ACM Press, 2017. Publications 2016 Revisiting the Cake Pattern: Scaling \"Scalable Component Abstractions\" by Paolo G. Giarusso and Jonathan Immanuel Brachthäuser Technical report. Talk at Scala Symposium 2016, University of Tübingen, Germany, 2016. Prioritizing Regression Tests for Desktop and Web-Applications Based on the Execution Frequency of Modified Code by Matthias Hirzel, Jonathan Immanuel Brachthäuser, and Herbert Klaeren In Proc. of the Intl. Conference on Principles and Practices of Programming on the Java Platform: Virtual Machines, Languages, and Tools. Association for Computing Machinery, 2016. Parsing with First-Class Derivatives by Jonathan Brachthäuser, Tillmann Rendel, and Klaus Ostermann In Proceedings of the International Conference on Object-Oriented Programming, Systems, Languages and Applications (OOPSLA). ACM Press, 2016. Publications 2014 Modularization of Algorithms on Complex Data Structures: An Encoding of Typesafe Extensible Functional Objects by Jonathan Immanuel Brachthäuser Master thesis. University of Marburg, Germany, 2014. From Object Algebras to Attribute Grammars by Tillmann Rendel, Jonathan Immanuel Brachthäuser, and Klaus Ostermann In Proceedings of the 2014 ACM International Conference on Object Oriented Programming Systems Languages & Applications (OOPSLA), pages 377–395. ACM Press, 2014. Curriculum Vitae Since Nov 2021 Junior Professor Software EngineeringUniversity of Tübingen Aug 2020 - Aug 2021 Postdoctoral",
  "content_length": 29195,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:50"
}