{
  "name": "Jonathan M. Roberts",
  "homepage": "https://research.qut.edu.au/qcr/people/jonathan-roberts",
  "status": "success",
  "content": "Jonathan Roberts - QUT Centre for Robotics Skip to content Prof Jonathan Roberts Home Our People Prof Jonathan Roberts Please enable JavaScript Please enable JavaScript Find Jonathan Roberts onJonathan Roberts's full profile, contact information and publications are available on: Professor (Field Robotics, Medical Robotics, Performance Robotics and Design Robotics, Cobots) PhD (University of Southhampton)I am a Professor in Robotics within the School of Electrical Engineering and Robotics at Queensland University of Technology (QUT). I am the Director of the Australian Cobotics Centre and also the Technical Director of the Advanced Robotics for Manufacturing (ARM Hub. I am a Chief Investigator at the QUT Centre for Robotics, and an Associate Investigator at QUT's Centre for Biomedical Technologies. My main research interests are in the areas of Field Robotics and robotics that incorporates human interaction such as Medical Robotics, Performance Robotics and Design Robotics.I graduated from the University of Southampton, UK, in 1991 with an Honours degree in Aerospace Systems Engineering. I then furthered my interest in computer vision while completing a PhD (1991-1994) at the University of Southampton where I also developed skills in parallel computing. In 1995 I joined CSIRO (Australia’s largest government research agency) to work in the area of mining robotics where I worked on numerous large robot machines including 3,500 tonne draglines, 30 tonne underground haul trucks and autonomous underground explosive loading vehicles. Work with my colleagues on the navigation system of semi-autonomous Load-Haul-Dump (LHD) vehicles was commercialised by Caterpillar.I was appointed a Science Leader at CSIRO in the area of Robotics and then went on to lead the Autonomous Systems Laboratory also at CSIRO where I was Research Director. I co-invented the UAV Challenge Outback Rescue, an international flying robot competition in which teams search for a lost bushwalker using autonomous robotic aircraft, and I am featured on BBC International News in 2014 and 2016 talking about the event.In 2013 I, along with my research team, won the Australia and New Zealand Internet Award for Innovation for their Museum Robot Project. This project deployed two mobile robots in the National Museum of Australia in Canberra which were used by remote school students to visit the museum with an educator guide, on a weekly basis. In 2013, I made international news by being the first person to 3D map the interior of the Leaning Tower of Pisa using our team's Zebedee mobile mapping system. My colleagues and I mapped Fort Lytton in Brisbane in conjunction with Queensland Parks and The University of Queensland, and it became the first Australian heritage site to be archived on CyArk, the international digital cultural heritage database.In 2014 I left CSIRO to join QUT and in 2017 I became a Chief Investigator at the Australian Centre for Robotic Vision. I was part of the team that in 2017 was awarded an Australia-India Strategic Research Fund project to develop new vision technologies for minimally invasive knee surgery.I was President of the Australian Robotics & Automation Association Inc. from 2007-2008, and between 2008 and 2013 was Deputy Research Director of the Australian Research Centre for Aerospace Automation (ARCAA), a joint venture between CSIRO and Queensland University of Technology (QUT). I am a frequent contributor to The Conversation where I write on many topics related to robotics and the use of technology in society.Publications Please see my Google Scholar page for a list of publications and their citationsGoogle Scholar: http://scholar.google.com.au/citations?hl=en&user=1e_R-xoAAAAJPatentsMethod and system for machinery control, Inventors: Peter Corke, Jonathan Roberts, Publication date 2011/5/5/, Patent office US Application number US20110106384 A1Digital terrain mapping with GPS and laser system, Inventors: Jonathan Michael Roberts, Graeme John Winstanley, Publication date 2007/10/4, Patent office US Application number 12515279A system for Relative Vehicle Navigation, Inventors: Elliot Stanley Duff, Jonathan Michael Roberts, Peter Ian Corke, Jock Bernard Cunningham, Publication date 2002/5/15 Patent office EP Patent number 1204905 Projects (Chief investigator)Training Centre for Collaborative Robotics in Advanced Manufacturing ProjectsLunaRoo - A hopping Lunar science platformMultiple Target Finding and Action Using Unmanned Aerial SystemsNavigating Under the Forest Canopy and in the Urban JungleRobotic knee arthroscopy Additional information Awards TypeEditorial Role for an Academic JournalReference year2015DetailsSenior EditorTypeEditorial Role for an Academic JournalReference year2015DetailsMember of Editorial BoardTypeCommittee Role/Editor or Chair of an Academic ConferenceReference year2013DetailsGeneral ChairTypeAppointment to Prestigious PositionsReference year2007DetailsPresident NewsDr Fernando Vanegas Alvarez awarded Advanced Queensland Industry Research Fellowship Grant!Posted: September 19, 2024QCR CI Aaron McFadyen Wins 2024 Australian Museum Eureka Prize!Posted: September 8, 2024From PhD to Lecturer: Dr Jasmin Martin's JourneyPosted: August 18, 2024Recent TweetsFollow @QUTRobotics",
  "content_length": 5277,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:59"
}