{
  "name": "Jonathan Scarlett",
  "homepage": "https://www.comp.nus.edu.sg/~scarlett",
  "status": "success",
  "content": "Jonathan Scarlett's Home Page About Me I am an Associate Professor in the Department of Computer Science, Department of Mathematics, and Institute of Data Science at the National University of Singapore My research interests are in the areas of information theory, machine learning, and high-dimensional statistics. Please see my research and publications pages for details. Office: COM3 #02-57 (Comp. Sci.), S17 #05-17 (Maths) Phone: +65 6516 1179 (Comp. Sci.), +65 6516 2952 (Maths) Email: \"scarlett\" followed by \"@comp.nus.edu.sg\" News: (Sept. 2025) Paper Sequential 1-bit Mean Estimation with Near-Optimal Sample Complexity uploaded to arXiv (Sept. 2025) Paper Improved Regret Bounds for Linear Bandits with Heavy-Tailed Rewards accepted to NeurIPS 2025 (July 2025) Paper Error Exponents for DNA Storage Codes with a Variable Number of Reads accepted to IEEE JSAIT (June 2025) Paper Optimal Non-Adaptive Group Testing with One-Sided Error Guarantees uploaded to arXiv (June 2025) Paper Exact Error Exponents of Concatenated Codes for DNA Storage accepted to IEEE Transactions on Information Theory (May 2025) Paper Statistical Mean Estimation with Coded Relayed Observations uploaded to arXiv (April 2025) Congratulations to Yang Sun for successfully defending his PhD thesis titled \"Data-Driven Techniques for Inverse Problems: Priors, Measurements, and Decoding\" (March 2025) Congratulations to Zihan Li for successfully defending her PhD thesis titled \"Towards Sharp Performance Bounds for Kernel-Based Bandit Optimization Problems\" (March 2025) Congratulations to Yan Hao Ling for successfully defending his PhD thesis titled \"Coding Techniques and Information-Theoretic Limits for Multi-Hop Relaying Problems\" (Jan. 2025) Paper Lower Bounds for Time-Varying Kernelized Bandits accepted to AISTATS 20255 (Jan. 2025) Paper A General Framework for Clustering and Distribution Matching with Bandit Feedback accepted to IEEE Transactions on Information Theory (Dec. 2024) Paper Quantile Multi-Armed Bandits with 1-Bit Feedback accepted to ALT 20255 (Nov. 2024) Congratulations to Arpan Losalka for successfully defending his PhD thesis titled \"Safety and Reliability in Bayesian Optimization: Algorithms and Regret Guarantees\" (Oct. 2024) Paper Exact Thresholds for Noisy Non-Adaptive Group Testing accepted to SODA 2025 (Aug. 2024) Paper Robust Instance Optimal Phase-Only Compressed Sensing uploaded to arXiv (July 2024) Congratulations to Xu Cai for successfully defending his PhD thesis titled \"On Error Bounds for Kernel-Based Optimization and Integration with Black-Box Queries\" (June 2024) Paper Approximate Message Passing with Rigorous Guarantees for Pooled Data and Quantitative Group Testing accepted to SIMODS5 (May 2024) Paper Optimal 1-bit Error Exponent for 2-hop Relaying with Binary-Input Channels accepted to IEEE Transactions on Information Theory (May 2024) Paper Regret Bounds for Noise-Free Cascaded Kernelized Bandits accepted to TMLR (April 2024) Paper Concomitant Group Testing accepted to IEEE Transactions on Information Theory (April 2024) I have been promoted to Associate Professor (Jan. 2024) Paper \"No-Regret Algorithms for Safe Bayesian Optimization with Monotonicity Constraints\" accepted to AISTATS 2024 (Jan. 2024) Congratulations to Eric Han for successfully defending his PhD thesis titled \"Bayesian Optimisation Techniques for High-Dimensional and Adversarial Settings\" (Jan. 2024) Paper Mismatched Rate-Distortion Theory: Ensembles, Bounds, and General Alphabets accepted to IEEE Transactions on Information Theory [News Archive]",
  "content_length": 3573,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:07"
}