{
  "name": "Jonathan Richard Shewchuk",
  "homepage": "http://www.cs.berkeley.edu/~jrs",
  "status": "success",
  "content": "Jonathan Richard Shewchuk Jonathan Shewchuk Professor in Computer Science University of California at Berkeley Office 529 Soda Hall Computer Science Division University of California at Berkeley Berkeley, California 94720-1776 (510) 642-3936 [five ten NICE ZEN] Office hours By appointment only (until Spring 2026). Email is the best way to contact me. There's a chance you'll find me in my office afternoons or early evenings (typically 1–6 PM) on Mondays, Wednesdays, or Fridays during spring semesters. While you're by, ask me to make a pot of tea. I get teas from Upton Tea Imports, a first-rate importer in Massachusetts, and I enjoy introducing people to the good stuff. Mornings I sleep. During summers and fall semesters, I mostly work at home. Attempts to phone me then are futile. I DO RESEARCH in computational geometry (especially mesh generation, numerical robustness, and surface reconstruction), scientific computing, numerical methods, physically-based animation, and neural network mathematics. If you came here with a specific object in mind, you're probably looking for my triangular mesh generator Triangle, my paper An Introduction to the Conjugate Gradient Method Without the Agonizing Pain, or my paper What Is a Good Linear Finite Element? Interpolation, Conditioning, Anisotropy, and Quality Measures. If you are considering applying for graduate school or a postdoctoral position in the Computer Science Division, please read this note. New: Announcing what I think is the best paper I've ever written (with former UC Berkeley student Sagnik Bhattacharya). We characterize the geometry and topology of the fiber of W: the set of all weight vectors for which a linear neural network computes the same linear transformation W. The fiber is an algebraic variety, but usually not a manifold. We stratify the fiber—that is, we partition it into smooth manifolds of varying dimensions called strata. We derive the dimensions of these strata and the relationships by which they adjoin each other. To help achieve these goals, we first derive what we call a Fundamental Theorem of Linear Neural Networks, analogous to what Strang calls the Fundamental Theorem of Linear Algebra. We show how to decompose each layer of a linear neural network into a set of subspaces that show how information flows through the neural network. Each stratum of the fiber represents a different pattern by which information flows (or fails to flow). The topology of a stratum depends solely on its basis flow diagram. So does its geometry, up to a linear transformation in weight space. Jonathan Richard Shewchuk and Sagnik Bhattacharya, The Geometry of the Set of Equivalent Linear Neural Networks, arXiv:2404.14855 [cs.LG]. PDF (color, 99 pages) from arXiv, or you can download a locally stored copy. Product TRIANGLE. A production-quality C program for two-dimensional constrained Delaunay triangulation and quality mesh generation. See the Triangle page to obtain the source code and for hypertext instructions. I expect to release its three-dimensional successor, Star, in the near future. The algorithms behind Triangle and Star are discussed in my dissertation and in several other papers on my Papers page. STELLAR. A C program for aggressively improving the quality of tetrahedral meshes, making them suitable for finite element analysis. Stellar routinely improves meshes so that the smallest dihedral angle is larger than 30 degrees and the largest dihedral angle is smaller than 140 degrees. See the Stellar page to obtain the source code, hypertext instructions, and publications describing its algorithms. STREAMING GEOMETRIC SOFTWARE. Software tools for processing huge meshes and point sets, including Delaunay triangulation construction in two or three dimensions and computations for GIS (Geographic Information Systems). Need to triangulate billions of points, or use them to construct elevation maps and isocontours, on an ordinary computer? Martin Isenburg, I, and our collaborators have streaming tools for constructing huge Delaunay triangulations, constructing Digital Elevation Maps and isolines, processing LIDAR data in LAS format, and visualizing LIDAR data in Google Earth. Our algorithms for processing gobs of data are discussed in several papers on my Papers page. EXACT ARITHMETIC AND ROBUST GEOMETRIC PREDICATES. I've written a set of fast routines for exact floating-point addition and multiplication, which I've used to create fast correct geometric predicates, namely the two- and three-dimensional orientation and incircle tests. These predicates are used to make the Delaunay triangulation routines in Triangle and Star robust against roundoff error. See my Robust Predicates page for more information, for papers, or to obtain the C source code. Proselytization PAPERS. All my publications are available here. The conjugate gradient method Mesh generation Physically-based computer animation Streaming geometry Numerical analysis of finite element quality Numerically robust geometry Constrained Delaunay triangulations Surface reconstruction Large-scale earthquake simulation Parallel finite element methods Communication requirements of unstructured simulations Route planning on real-world maps RESEARCH OVERVIEW. Here's a self-contained summary of some of my research. This is the fastest way to learn a bit about my work. THREE SINS OF AUTHORS IN COMPUTER SCIENCE AND MATH. A short crotchety essay that will improve your technical writing, or annoy you trying. You won't find these sins decried in the usual books of writing advice. While you're at it, you might be interested in my (less snarky) advice on Giving an Academic Talk. Professing CS 294: MESH GENERATION AND GEOMETRY PROCESSING IN GRAPHICS, ENGINEERING, AND MODELING (Spring 2012, Spring 2008, Autumn 1999). Techniques for generating and processing meshes for finite element methods, graphics, interpolation, Geographical Information Systems, and other applications. Algorithms for computing optimal triangulations. CS 274: COMPUTATIONAL GEOMETRY (Spring 2019, Spring 2017, Spring 2015, Spring 2013, Autumn 2009, Autumn 2006, Spring 2005, Spring 2003). Geometric algorithms, analyses, and applications. Polygons, polytopes, triangulations, planar and spatial subdivisions, convex hulls, halfspace intersections, Voronoi diagrams, Delaunay triangulations, arrangements of lines and hyperplanes. Geometric queries (databases, point location), binary space partitions, robot motion planning, cartography, solid modeling, small-dimensional linear programming, and more. CS 189 / CS 289A: INTRODUCTION TO MACHINE LEARNING (Spring 2025, Spring 2024, Spring 2023, Spring 2022, Spring 2021, Spring 2020, Spring 2019, Spring 2017, Spring 2016). The study of how computers can “learn” by finding patterns in data and using them to make predictions. Covers supervised learning methods such as classification and regression, and unsupervised learning methods such as clustering, dimensionality reduction, and density estimation. CS 170: EFFICIENT ALGORITHMS AND INTRACTABLE PROBLEMS (Spring 2001). The study of advanced algorithms, including graph algorithms, dynamic programming, linear programming, matrix multiplication, and number theory, plus an introduction to the theory of NP-completeness. CS 61B: DATA STRUCTURES (Spring 2014, Spring 2013, Spring 2012, Autumn 2010, Spring 2009, Autumn 2006, Spring 2005, Spring 2004, Spring 2002, Spring 2000, Autumn 1998). An introduction to data structures (lists, trees, hash tables, graphs, etc.), simple algorithms (searching and sorting), encapsulation, and the language Java. CS 4 aka CS 39L: INTRODUCTION TO COMPUTING FOR ENGINEERS (Spring 2006). An introductory computer programming class that employs examples from engineering and science. An alternative to CS 3, taught in the language Java. Protégés MARTIN ISENBURG, 1972–2021, In Memoriam. Martin was a Post-Doctoral Scholar under my supervision from the summer of 2005 to the summer of 2007. He developed a software suite called the LAStools for fast streaming computation of geographical information (including Delaunay triangulations) on huge data sets, which he subsequently promoted through his personal company, rapidlasso GmbH. I wrote an extended obituary for him after his sad early death. MARC KHOURY in May 2020 completed his Ph.D. on restricted constrained Delaunay triangulations and the geometry of adversarial examples. Read his dissertation, Geometric Sampling Theory, Triangulations, and Robust Machine Learning. He now works at Hudson River Trading. BRYAN KLINGNER in November 2008 completed his Ph.D. on tetrahedral mesh improvement algorithms and physical simulations with dynamically changing geometry. Read his dissertation, Improving Tetrahedral Meshes. He now works at Google. RAVIKRISHNA KOLLURI in December 2005 completed his Ph.D. on surface reconstruction algorithms, including spectral surface reconstruction, scan registration, moving least squares interpolation for generating implicit surfaces (which won the Best Student Paper Award at the 2005 Symposium on Discrete Algorithms), and the very cool power crust. Read his dissertation, From Range Images to 3D Models. He now works at Google. FRANÇOIS LABELLE in August 2007 completed his Ph.D. on tetrahedral mesh generation algorithms with guaranteed dihedral angles (notably isosurface stuffing). Read his dissertation, Tetrahedral Mesh Generation with Good Dihedral Angles Using Point Lattices. During his time at Berkeley, he also did lovely work in anisotropic mesh generation. JESSICA SCHOEN in May 2008 completed her M.S. on robust anisotropic mesh generation in the plane. Read her thesis, Robust, Guaranteed-Quality Anisotropic Mesh Generation. Promotion CARNEGIE MELLON UNIVERSITY'S SCHOOL OF COMPUTER SCIENCE IS HELL. My t-shirt design for the 1992 Immigration Course, a three-week departmental orientation for new doctoral students. If you want to print it, I recommend downloading the full-size version (38",
  "content_length": 20180,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:07"
}