{
  "name": "Jonathan C. L. Liu",
  "homepage": "https://www.cise.ufl.edu/~jcliu",
  "status": "success",
  "content": "Jonathan C.L. Kavalan's Web Home Page Jonathan C.L. Kavalan, Ph.D., Associate Professor Office : Room 4117, DSIT/Malachowsky Building Department of Computer & Information Science and Engineering P.O. Box 116120 University of Florida Gainesville, FL 32611-6120 Phone: (352) 294-6655 (Leave Messages) Fax: (352) 273-0738 Email : jcliu@cise.ufl.edu Formerly known as Chien-Liang Liu, Dr. Jonathan Kavalan's legal name was changed officially in March 2017 (to pay the tribute on his Formosan ancestors). Jonathan Kavalan was born in Taiwan, and formally educated with computer science/engineering BS degree in 1980s. He then received the M.S. degree in Computer Science from University of Alabama and the Ph.D. degree in Computer Science from University of Minnesota. In 1993-1996, Dr. Kavalan had associated with the Distributed Multimedia Research Center(DMRC) at University of Minnesota, where he had R&D cooperation with Honeywell Technology Center (HTC) and IVI Publishing. In 1996-1999, Dr. Kavalan was an Assistant Professor of Computer Science with the School of Electrical Engineering and Computer Science at Washington State University. Since August 1999, Dr. Kavalan has been with the CISE Department at University of Florida, where he is now a tenured Associate Professor. His current research interests include high-speed wired and wireless networks, multimedia communications, parallel processing and artificial intelligence. Dr. Kavalan has published over 90 technical papers including 38 journal papers in the above areas. Dr. Kavalan is the recipient of the National Science Foundation CAREER Award. Dr. Kavalan is a senior member of IEEE and a professional member of ACM. Dr. Kavalan has taught 2,090 graduate students and 4,432 undergraduate students in his classes upto Spring Semester 2024. Research Projects: (Always) Under Construction In general, since early 1990s, Dr. Kavalan's research has focused on the various aspects of large-scale distributed multimedia systems in order to guarantee the end-to-end application-level performance over the emerging high-speed networks (wired and wireless). Research Information and News Some popular references for research in distributed multimedia systems (and high-speed wired and wireless networks) (THE TOTAL AUDIENCE REPORT: Q4 2014) \"Increased video viewing on digital platforms to both native digital content and TV-produced content, as well as the rise of subscription-based video on-demand (SVOD) across all platforms, are changing the way we look at the consumption of traditional media. \" (Source: Nielsen on SVOD, Mar. 2015) (State of Internet 2015) \"Akamai has again identified candidate geographies that are most likely to sustain connection speeds above 15 Mbps, as Ultra HD adaptive bitrate streams typically require bandwidth between 10 and 20 Mbps. South Korea remained the country with the highest level of 4K readiness, with two-thirds of its connections to Akamai at or above 15 Mbps.\" (Source: Akamai Report on the State of Internet, Jan. 2015) (State of Internet Q3-2014) (InfoGraphics) Austin, TX is chosen as the next Google Gigabit-Fiber city (as Apr. 10, 2013). Small Satellite Design Club presents Tom Moss at 6:30pm, Thursday Jan. 31, 2013, Location Reitz 282. (State of Internet) The top three average connection speeds around the world, (1) South Korea (16.7 Mbps), Hong Kong (10.5 Mbps) and Japan (8.9 Mbps). (Source: Akamai Report on the State of Internet, 2012) (100 Fastest Cities Worldwide) Cities in Asia overwhelmingly continued to dominate the top 100 list, once again accounting for three-quarters of the list, with 61 cities in Japan and 13 cities in South Korea and Hong Kong. Only thirteen U.S. cities made the list, with San Jose, CA ranking as the fastest U.S. city (#57 out of 100). The overall average connection speed for the U.S. as a whole in the third quarter of 2010 was 5.0 Mbps. (Source: Akamai Report on the State of Internet , Jan. 24, 2011) (Global Connection Speeds) Globally, the average connection speed once again increased, both quarter-over-quarter and year-over-year, reaching nearly 2 Mbps. Taiwan’s 24% quarterly growth was the most significant among the top 10 countries/regions, enabling it to achieve an average connection speed of 5 Mbps. In examining the average peak speeds around the world, only four countries/regions had speeds of 30 Mbps or more – South Korea, Japan, Hong Kong and Romania. (Source: Akamai Report on the State of Internet , Jan. 24, 2011) Software Engineers and Computer Systems Analyst are the Top-1 and Top-5 of The Best Jobs of 2011. (Source: CareerCast, Jan, 2011) Intel Demos 50Gbps Silicon Photonics Laser Link (Optical fibers can transmit data inside computers faster and over greater distances than current copper wire technology. A potential break-through to transform electronic computers into optical computers eventually) (Source: Information Week, Jul. 28, 2010) U.S. not getting broadband fast enough, FCC says Also, the definition of \"broadband\" has been revised from 200 kbps to 4 Mbps (as the minimum generally required for today's video-rich applications and services). (Source: CNN, Jul. 21, 2010) Course Information, Fall Semester 2019 CNT 6885 Distributed Multimedia Systems CIS 4930 Multimedia Expert Systems Previously Collaborations Ronald Vetter, Ph.D. (UNC at Wilmington, NC) MengJou Lin, Ph.D. (Streaming21, a US company HQ in Taiwan) Rose Tsang, Ph.D. (Sandia National Lab., CA) Jenwei Hsieh, Ph.D. (Dell Computer, TX) Simon Shim, Ph.D. (SAP USA, CA) Yuewei Wang, Ph.D. (Streaming21, CA) Bin Bai, Ph.D. (Micron Technology, ID) A. Pavan, Ph.D. (Honeywell Technology Center, MN) Wei Ling, Ph.D. (Lucent Technology, NJ) Chung-Wei Lee, Ph.D. (University of Illinois at Springfield, IL) Ju Wang, Ph.D. (Virginia Commonwealth University, VA) Yu-Ju Lin, Ph.D. (Charleston Southern University, SC) Mark Foster, Ph.D. (US Government Agency, MD) K.R. Chen, Ph.D. (Marshall University, WV) Eunsam Kim, Ph.D. (Hongik University, South Korea) Sungwook Chung, Ph.D. (Changwon National University, South Korea) Shiuh-Jeng Wang, Ph.D. (Central Police University, Taiwan) ..... Chih-Yang Lin, Ph.D. (National Central University, Taiwan) S. Kamath, M.S. (Oracle Corp., CA) A. Srivinas, M.S. (Oracle Corp., CA) J. Zhen, M.S. (Computer Associates, WA) J.B. Min, M.S. (Samsung Corp., CA) L. Xia, M.S. (Adobe Inc., WA) S. Dai, M.S. (Adobe Inc., WA) M. Elicin, M.S. (Lucent Technology, IL) Y. He, M.S. (Continue Ph.D. study at UMass) N. Kamat, M.S. (Florida's local industry) A. Steele, M.S. (Florida's local industry) A. Abraham, M.S. (Continue Ph.D. study at UFL) S. Sen, M.S. (Continue Ph.D. study at University of Kentucky) V. Kulkarni, M.S. (Dell Corp., TX) Jimmy Y.S. Chen, M.S. (ASUS Technolgy., Taiwan) ..... Teja Ankit Batchali, M.S. (Machine Learning Engineer at Amazon) Atharva Mangeshkumar Agrawal, M.S. (Continue Ph.D. study at University of Texas)",
  "content_length": 6920,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:34"
}