{
  "name": "Jonas Fritsch",
  "homepage": "https://pure.itu.dk/portal/da/persons/jonas-fritsch",
  "status": "success",
  "content": "Jonas Fritsch - IT-Universitetet i København Jonas Fritsch Lektor, Human-Computer Interaction and DesignMedia, Art and Design (MAD)Center for Climate IT Akademisk Ansvarlig, Air Lab https://orcid.org/0000-0001-9065-2843 E-mailfrititudk 20032026 Publikationer pr. år Personlig profil CVJonas Fritsch, PhD, is Associate Professor at the IT University of Copenhagen. His field of research is human-centred interaction design, where he has been at the forefront of introducing affect theoretical findings from cultural and critical theory into the joint fields of Human- Computer Interaction (HCI) and design. In the last five years, this has led to a deep research engagement with affective and emotional aspects of people- and patient-centered healthcare, as well as an expanded care-driven agenda spanning environment, social and mental ecologies. Scientific contribution is interdisciplinary in nature with publications across multiple fields. Jonas has founded and is head of the Affective Interaction & Relations (AIR) Lab at the IT University of Copenhagen and is currently PI in the VELUX Core Group project TRAnsformations in CarE (TRACE) (5.69 mio DKR 2023-27) and the DFF-funded FKK project “Voice as a Matter of Design; a Framework for Novel Vocal Imaginaries (2.8 mio DKR 2022-25). EmneordArt & technologyDesign researchDigital aestheticsembodied interactionExperience designHCI: human-computer interactionInteraction designInteractive installationsUI/UXUser-centered designAffective Interaction DesignEmotional DesignAffective Healthcare DesignAffective RobotsDesign philosophyDesign TheoryDesign processesResearch through design Fingeraftryk Dyk ned i forskningsemnerne, hvor Jonas Fritsch er aktive. Disse emneetiketter kommer fra dennes persons arbejder. Sammen danner de et unikt fingerprint. 6 Lignende profiler Affective Arts and Humanities 100% Interaction Design Keyphrases 98% Interactive Arts and Humanities 73% Affective Experience Keyphrases 71% Media Façade Keyphrases 71% Design Process Keyphrases 60% Urban Arts and Humanities 53% Design Research Computer Science 53% Se fuldt fingerprint Samarbejde og topforskningsområder i de sidste fem år Seneste eksterne samarbejde på lande-/områdeniveau. Dyk ned i detaljerne ved at klikke på prikkerne eller Vælg et land/område fra listen Dyk ned i detaljerne Vælg et land/område for at vise delte publikationer og projekter Luk Vælg et land/område fra listen Udforsk netværk yderligere Publikation Publikationer pr. år 2003 2008 2009 2011 2012 2013 2014 2016 2018 2021 2022 2023 2024 2024 32 Konferencebidrag i proceedings 13 Paper 12 Tidsskriftartikel 8 Bidrag til bog/antologi 9 Mere 3 Working paper 2 Antologi 2 Konferenceabstrakt til konference 1 Interaktiv produktion 1 Ph.d.-afhandling Publikationer pr. år Publikationer pr. år Cultures of the AI paralinguistic in voice cloning tools.Ada Ada, A., Jørgensen, S. H. & Fritsch, J., 3 jun. 2024, Companion Publication of the 2024 ACM Designing Interactive Systems Conference (DIS '24 Companion). s. 249-252 Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgang Paralanguage 100% Artificial Intelligence 100% Voice Cloning 100% Synthesis Tool 40% Designer 20% Exploring app-based affective interactions for people with rheumatoid arthritisKühn, L., Boer, L. & Fritsch, J., 23 jun. 2024, Proceedings of DRS2024. 27 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgang Healthcare Technology 100% App-based 100% Rheumatoid Arthritis 100% Human-Computer Interaction 50% Design Researcher 50% Materialising affective experiences: Designing for personal grief practicesRavn, N. E., Sveegaard, N. S. & Fritsch, J., 1 jul. 2024, Proceedings of the 2024 ACM Designing Interactive Systems Conference. s. 685-698 14 s.Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgang Grief 100% Affective Experience 100% Design Practice 50% Interactive Prototype 50% Design Probes 25% MoSS: Unfolding Playful Imaginaries of Synthetic Voice Design through a Modular Smart SpeakerLyngsø Knudsen, S., Jørgensen, S. H. & Fritsch, J., 3 jun. 2024, Companion Publication of the 2024 ACM Designing Interactive Systems Conference (DIS '24 Companion). s. 342-346 Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Åben adgangFil Speech Synthesis 100% Audio Signal Processing 100% Voice Design 100% Feature-rich 11% Audio Processing 11% UDREDNING: an Extended Reality Artwork for Affectively Engaging with Diagnosing ProcessesGad, C. & Fritsch, J., 2024, NordiCHI '24: Adjunct Proceedings of the 2024 Nordic Conference on Human-Computer Interaction. s. 1-9 67Publikation: Konference artikel i Proceeding eller bog/rapport kapitel › Konferencebidrag i proceedings › Forskning › peer review Authors 100% Public Service 100% Orphan Disorder 100% Extended Reality 100% Lived Experience 100% Se alle 74 publikationer Projekter Projekter pr. år 2015 2015 2018 2022 2023 2026 2029 1 Afkortet 1 Ikke startet 1 Igangværende 3 Afsluttet Projekter pr. år Affective Design for Improved Health Outcomes for Rheumatology Patients using Digital Health TechnologyFritsch, J. (PI) & Kühn, L. (CoI)Innovation Fund Denmark (IFD)11/09/2018 → 01/12/2023Projekter: Projekt › Forskning Improving Health Outcomes 100% Rheumatology 100% Affective Design 100% Digital Health Technology 100% Interaction Design 100% Immediations: Art, Media and EventFritsch, J. (PI) & Jacobsen, M. (CoI)SSHRC01/03/2018 → 28/02/2020Projekter: Projekt › Forskning TRACE : TRAnsformations in CarE - Investigating Emerging Human-Technology Interactions in Practice of CareFritsch, J. (PI), Ertner, S. M. (CoI), Grönvall, E. (CoI), Yndigegn, S. L. (CoI), Vallgårda, A. (CoI), Dzierzak, K. A. (CoI), Ravn, N. E. (CoI), Martinussen, S. A. N. (CoI), Hartmann, M. (CoI) & Karaturhan, P. (Samarbejdspartner)Velux Fonden01/10/2023 → 30/09/2027Projekter: Projekt › Forskning Human-technology Relationship 100% Health Practices 100% In Care 100% Implantable Defibrillator 60% Chronic Illness 50% Affects, Interfaces, EventsFritsch, J. (PI) & Jacobsen, M. (CoI)Danmarks Frie Forskningsfond01/09/2015 → 31/08/2021Projekter: Projekt › Forskning Bodily Sensations 100% Real-time Interface 100% Affective Level 100% Analytic Framework 100% Experience Level 100% VOCAL: Voice as a Matter of Design: a Framework for Novel Vocal ImaginariesFritsch, J. (PI), Jørgensen, S. H. (CoI), Hyldahl Fogh, A. (CoI), Lyngsø Knudsen, S. (CoI) & Glanois, C. (CoI)Danmarks Frie Forskningsfond01/08/2022 → 31/08/2025Projekter: Projekt › Forskning Imaginaries 100% Vocal 100% Framework 100% Complex Variable 100% User Interfaces 100% Se alle 6 projekter Presse/medier Dansk festival sætter fokus på, hvordan musik og lyd kan fremme sundhedFritsch, J.23/10/20241 MediebidragPresse/medie Lokalt galleri sendt til akut udredningFritsch, J.30/03/20241 MediebidragPresse/medie UDREDNING - en audiovisuel event af Mogens Jacobsen og Jonas FritschFritsch, J. & Gad, C.26/03/20241 MediebidragPresse/medie Velux Fonden støtter syv humanvidenskabelige forskningsprojekterFritsch, J.08/09/20231 MediebidragPresse/medie Forskere undersøger digitalisering af omsorgspraksisserFritsch, J., Vallgårda, A., Grönvall, E. & Yndigegn, S. L.28/06/20231 MediebidragPresse/medie Se alle 11 presse/medier Aktiviteter Aktiviteter pr. år 2015 2024 2024 2 Organisation og deltagelse i konference 2 Organisation og deltagelse i workshop, seminar og kursus 2 Medlemskab af bedømmelsesudvalg 1 Foredrag og mundtlige bidrag Aktiviteter pr. år ACM Designing Interactive Systems 2019Fritsch, J. (Other (please specify))25 jun. 2019Aktivitet: Deltagelse i eller arrangement af en begivenhed - typer › Organisation og deltagelse i konference Affects, Interfaces, EventsFritsch, J. (Conference Chair) & Thomsen, B. M. S. (Conference Chair)29 aug. 2018 → 30 aug. 2018Aktivitet: Deltagelse i eller arrangement af en begivenhed - typer › Organisation og deltagelse i konference Designing for Living with Technology - Design til at Leve med TeknologiFritsch, J. (Foredragsholder)25 sep. 2015Aktivitet: Tale eller præsentation - typer › Foredrag og mundtlige bidrag Folkemødet 2024Fischer, L. H. (Taler), Hockenhull, M. (Arrangør), Fritsch, J. (Panel Chair), Padalak, M. A. (Deltager) & Dalsgaard, S. (Deltager)14 jun. 2024Aktivitet: Deltagelse i eller arrangement af en begivenhed - typer › Organisation og deltagelse i workshop, seminar og kursus Fil Hiring committee for recruitment of assistant/associate professor in Creative Computing (Begivenhed)Fritsch, J. (Forperson), Yndigegn, S. L. (Medlem) & Grönvall, E. (Medlem)feb. 2024 → jun. 2024Aktivitet: Medlemsskab - typer › Medlemskab af bedømmelsesudvalg Se alle 7 aktiviteter",
  "content_length": 8945,
  "method": "requests",
  "crawl_time": "2025-12-01 13:33:32"
}