{
  "name": "Jonathan L. Zittrain",
  "homepage": "http://hls.harvard.edu/faculty/directory/10992/Zittrain",
  "status": "success",
  "content": "Jonathan L. Zittrain - Harvard Law School | Harvard Law School Skip to content All faculty Jonathan Zittrain is the George Bemis Professor of International Law at Harvard Law School. He is also a Professor of Public Policy, Harvard John F. Kennedy School of Government, a professor of computer science at the Harvard School of Engineering and Applied Sciences, director of the Harvard Law School Library, and co-founder and director of Harvard’s Berkman Klein Center for Internet & Society. His research interests include the ethics and governance of artificial intelligence; battles for control of digital property; the regulation of cryptography; new privacy frameworks for loyalty to users of online services; the roles of intermediaries within Internet architecture; and the useful and unobtrusive deployment of technology in education. Zittrain established the Assembly Program, a three-track fellowship program that convenes cohorts of experts, professionals, and students to develop solutions to complex technology policy issues, including those in cybersecurity, AI, and online disinformation. He also championed the development of the Caselaw Access Project, which has expanded free public access to U.S. case law. Zittrain is a member of the American Academy of Arts and Sciences and the Board of Directors of the Electronic Frontier Foundation. He has served on the Board of Advisors for Scientific American, as a Trustee of the Internet Society, and as a Forum Fellow of the World Economic Forum, which named him a Young Global Leader. He was the Distinguished Scholar-in-Residence at the Federal Communications Commission, where he chaired the Open Internet Advisory Committee. His book, The Future of the Internet – And How to Stop It, predicted the end of general purpose client computing and the corresponding rise of new gatekeepers. It is available from Yale University Press and Penguin UK, and under a Creative Commons license. That and other works may be found at jz.org. Clinic Work See www.jz.org Presentations: Love the Processor, Hate the Process Building the Research University of the 21st Century A New Platform for the Digital Economy WEF 2016 Academic Appointment and Employment History Professor of Public Policy, Harvard John F. Kennedy School of Government (2008 - Present)Cambridge, Massachusetts, United States Professor of Computer Science, Harvard School of Engineering and Applied Sciences (2010 - Present)Cambridge, Massachusetts, United States Board Memberships Board of Directors, Electronic Frontier Foundation (2011 - Present)United States Board of Trustees, The Internet Society \"ISOC\" (2009 - 2012)United States Representative Publications Favorite Jonathan L. Zittrain, David O'Brien, Matt Olsen, Bruce Schneier & the Berklett Working Group, Don’t Panic: Making Progress on the “Going Dark” Debate (Berkman Ctr. Research Publ'n No. 2016-1, Feb. 1, 2016). Favorite Jonathan L. Zittrain, Engineering an Election, 127 Harv. L. Rev. F. 335 (2014). Favorite Jonathan L. Zittrain, The Future of the Internet -- And How to Stop It (Yale Univ. Press & Penguin UK 2008). View all Representative Publications by Jonathan L. Zittrain Recent Publications Rishi Bommasani, Scott R. Singer, Ruth E. Appel et al., The California Report on Frontier AI Policy (2025). Matteo Cargnelutti, Catherine Brobston, John Hess et al., Institutional Books 1.0: A 242B token dataset from Harvard Library’s collections, refined for accuracy and usability (2025). View all publications by Jonathan L. Zittrain Contact Lewis 319 617-495-4643 Assistant Deema Qashat a2jz@law.harvard.edu dqashat@law.harvard.edu Links Faculty Assistant Email Future of the Internet Building the Research University of the 21st Century Program of Study Law, Science and Technology Clinic Berkman Klein Center for Internet and Society Courses Debates On Frontier Artificial Intelligence Governance: The AI Triad, Spring 2026 Governing Digital Technologies, Fall 2025 Legal Architecture for AI National Security Contingencies, Fall 2025 View course catalog Areas of Interest Access to Knowledge Cyber Law and Policy and the Internet Cyberlaw Electronic Commerce Internet Governance Intellectual Property National Security Law Privacy Law Technology Law and Policy Tort Law and Theory Torts Disclosures Faculty Disclosures re: Related Outside Interests and Activities",
  "content_length": 4359,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:05"
}