{
  "name": "Jong Taek Lee",
  "homepage": "https://sites.google.com/view/k-vislab",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationVision & Intelligent Systems LabKNU CSE VISLabWelcome to the Vision & Intelligent Systems Laboratory at the School of Computer Science and Engineering, College of IT, Kyungpook National University.We are actively engaged in research on computer vision, machine learning, and their real-world applications — including vision-based surveillance/patrol robots, smart cities, and AI-assisted rehabilitation.Highly motivated candidates with a strong interest and background in our research areas are welcome to inquire.News2025. 8. Our lab has been selected for a three-year Glocal R&D project (KRW 540 million in total), funded by the Ministry of Education and the NRF, starting in this September. The project, titled “Next-generation Patrol Robot Utilizing 3D Spatial Recognition and Lightweight Robot-arm-based Active Viewpoint Control for Overcoming Indoor/Outdoor Blind Spots,” will be conducted in collaboration with Prof. Jungwook Suh (AROME Lab, Department of Robot and Smart System Engineering, KNU).2025. 8. Sanghyeon has been selected for the 2025 Doctoral Research Fellowship Program, funded by the Ministry of Education and NRF, and will receive KRW 50 million in research funding over two years starting in September 2025. Congrats, Sanghyeon! [news]2025. 8. Janghoon, Minse, Juyeong, Gyuri, and Subin (VISLAB) won the IEEE AVSS '25 NAVI Challenge and received an RTX-5070 Ti as a prize. Congrats, everyone! [news]2025. 8. Sangyeop's paper, \"High-Speed and Precise Virtual Try-On with Two-Stage Semantic Segmentation and Latent Consistency Model for Optimized Diffusion Processes\", has been accepted to the ETRI Journal. Congrats, Sangyeop! [SCI(E)]2025. 6. Sanghyeon's paper, \"Occlusion-aware heatmap generation for enhancing 3D human pose estimation in multi-person environments\", has been accepted to the Visual Computer. Congrats, Sanghyeon! [SCI(E), IF: 3.0, JCR Q2]2025. 5. Wan-Gi has successfully defended his master's thesis! Congrats, Wan-Gi!2025. 5. Sanghyeon's, Ahmed's, and Jinwoo's paper, \"Discriminative Skeleton-Based Action Recognition via Co-Learning with Motion Diffusion Model\", has been accepted to IEEE AVSS '25 and will be presented this August in Tainan, Taiwan. Congrats, Sanghyeon, Ahmed, and Jinwoo! [AVSS: BKCS IF1 Conference]2025. 5. Wan-Gi's and Sanghyeon's paper, \"Finding Optimal Viewpoints for Monocular 3D Human Pose Estimation in Dynamic 3D Gaussian Splatting Space\", has been accepted to IEEE AVSS '25 and will be presented this August in Tainan, Taiwan. Congrats, Wan-Gi and Sanghyeon! [AVSS: BKCS IF1 Conference]2025. 5. Ahmed's and Sarah's paper, \"Deep Learning for Video Fluoroscopic Swallowing Study Analysis: A Survey on Classification, Detection, and Segmentation Techniques\",  has been published in IEEE Access. [SCI(E), IF: 3.3, JCR Q2]2025. 4. Our lab has launched a new collaborative project with ETRI Intelligent Robotics Research Section through the KNU-ETRI Future Digital Convergence Systems Uni-Core Program. The project aims to develop commercialization technologies for patrol robots with following capabilities.More NewsGoogle SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 3228,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:08"
}