{
  "name": "Jong Hwan Ko",
  "homepage": "http://iris.skku.edu",
  "status": "success",
  "content": "SKKU IRIS Lab Search IRIS Lab Intelligent & Resource‑efficient Image processing & Systems design Recent News 2025.11 1편의 논문이 WACV 2026 학회에 accept 되었습니다. (A paper was accepted at the WACV 2026 conference.) 2025.09 고종환 교수님이 우수 프로그램위원상을 수상하였습니다! (Professor Jonghwan Ko won the “Outstanding TPC Member Award”!) 1편의 논문이 ICCE-ASIA 2025 학회에 accept 되었습니다. (A paper was accepted at the ICCE-ASIA 2025 conference.) 1편의 논문이 VCIP 2025 학회에 accept 되었습니다. (A paper was accepted at the VCIP 2025 conference.) 3편의 논문이 NeurIPS 2025 학회에 accept 되었습니다. (Three papers were accepted at the NeurIPS 2025 conference.) 김효찬 연구원이 전자전기컴퓨터공학과 박사과정을, 김지석 연구원이 인공지능학과 석사과정을 졸업했습니다. 축하합니다! (Hyochan Kim graduated from the doctrol program in the Departement of Electrical and Computer Engineering , Jiseok Kim graduated from the master’s program in the Department of Artificial Intelligence. Congratulations!) 2편의 논문이 ASP-DAC 2026 학회에 accept 되었습니다. (Two papers were accepted at the ASP-DAC 2026 conference.) 2025.08 1편의 논문이 APCCAS 2025 학회에 accept 되었습니다. (A paper was accepted at the APCCAS 2025 conference.) 1편의 논문이 ISOCC 2025 학회에 accept 되었습니다. (A paper was accepted at the ISOCC 2025 conference.) 1편의 논문이 BIOCAS 2025 학회에 accept 되었습니다. (A paper was accepted at the BIOCAS 2025 conference.) 2025.07 1편의 논문이 ICCAD 2025 학회에 accept 되었습니다. (A paper was accepted at the ICCAD 2025 conference.) 2025.06 1편의 논문이 AVSS 2025 학회에 accept 되었습니다. (A paper was accepted at the AVSS 2025 conference.) 1편의 논문이 ISLPED 2025 학회에 accept 되었습니다. (A paper was accepted at the ISLPED 2025 conference.) 1편의 논문이 ICCV 2025 학회에 accept 되었습니다. (A paper was accepted at the ICCV 2025 conference.) 2025.05 1편의 논문이 ICML 2025 학회에 accept 되었습니다. (A paper was accepted at the ICML 2025 conference.) 1편의 논문이 Materials Horizons 2025 저널에 accept 되었습니다. (A paper was accepted at the Materials Horizons 2025 journal.) 2025.04 1편의 논문이 JSA 2025 저널에 accept 되었습니다. (A paper was accepted at the JSA 2025 journal.) 2025.03 김진희, 안재준 연구원이 석사과정으로, 송승현 연구원이 석박통합과정으로 IRIS Lab에 새로 조인했습니다. 축하합니다! (Jinhee Kim, Jaejun An have joined the IRIS Lab as master’s students, and Seunghyeon Song has joined as combined master’s and doctoral student. Congratulations!) 2025.02 김용수 연구원이 SSIT 박사과정을, 김지윤 연구원이 인공지능학과 석사과정을 졸업했습니다. 축하합니다! (Yongsoo Kim graduated from the doctoral program at SSIT, Jiyun Kim graduated from the master’s program in the Department of Artificial Intelligence. Congratulations!) 1편의 논문이 CVPR 2025 학회에 accept 되었습니다. (A paper was accepted at the CVPR 2025 conference.) 2025.01 1편의 논문이 ISCAS 2025 학회에 accept 되었습니다. (A paper was accepted at the ISCAS 2025 conference.) 2024.12 1편의 논문이 JSA 2025 저널에 accept 되었습니다. (A paper was accepted at the JSA 2025 journal.) 2024.11 1편의 논문이 IEEE VCIP 2024 학회에 accept 되었습니다. (A paper was accepted at the IEEE VCIP 2024 conference.) 3편의 논문이 DATE 2025 학회에 accept 되었습니다. (Three papers were accepted at the DATE 2025 conference.) 고종환 교수님이 K-CHIPS 산업기술기획평가원장상을 수상하였습니다! (Professor Jonghwan Ko won the “K-CHIPS Institute for Industrial Technology Planning and Evaluation Director Award”!) 이존이 연구원이 K-CHIPS 사업 우수연구원으로 선정되었습니다! (Johnny Rhe has been selected as an excellent researcher for the “K-CHIPS project”!) 2024.10 이주찬 연구원이 산합혁력 부문에서 한국에너지기술평가원 원장상을 수상하였습니다! (Joo Chan Lee won “the Director’s Award in the Industry-Academic Cooperation Category at the Korea Institute of Energy Technology Evaluation and Planning (KETEP)”!) 이존이 연구원이 우수연구 부문에서 한국에너지기술평가원 원장상을 수상하였습니다! (Johnny Rhe won “the Director’s Award in the Outstanding Research Category atthe Korea Institute of Energy Technology Evaluation and Planning (KETEP)”!) 2024.09 박주홍 연구원이 제 31회 한국반도체학술대회에서 분과별 우수논문상을 수상하였습니다! (Juhong Park won “the Best Paper Award in each division at the 31st Korean Semiconductor Conference”!) 강도영, 김동찬 연구원이 석사과정으로 IRIS Lab에 새로 조인했습니다. 축하합니다! (Do Yeong Kang and Dong Chan Kim newly joined IRIS Lab as master’s students. Congratulations!) 1편의 논문이 IEEE IoT-J 저널에 accept 되었습니다. (One paper was accepted into the IEEE IoT-J journal.) 2024.08 이존이 연구원이 삼성전자 & 성균관대학교 주관 2024 산학협력 우수논문상 우수상을 수상하였습니다! (Johnny Rhe won “the Samsung Electronics 2024 Industry-University Cooperation Outstanding Paper Award”!) 고종환 교수님이 삼성전자 & 성균관대학교 주관 2024 산학협력 우수특허상 최우수상을 수상하였습니다! (Professor Jong Hwan Ko won “the Samsung Electronics 2024 Industry-University Cooperation Best Patent Award”!) 2024.07 이존이, 소재현, 황찬욱, 박주홍, 박운기 연구원이 삼성전자 S.LSI 사업부에서 주최한 Exynos AI Challenger 에서 대상을 수상하였습니다! (Johnny Rhe, Jaehyeon So, Chanwook Hwang, Juhong Park, and Un Ki Park won “the Grand Prize at the Exynos AI Challenger hosted by Samsung Electronics’ S.LSI Division”!) 2편의 논문이 ECCV 2024 학회에 accept 되었습니다. (Two papers were accepted at the ECCV 2024 conference.) 황찬욱 석박통합과정 연구원이 BRAINSys Lab. (PI: Arindam Basu, City University of Hong Kong) 파견 연구원으로 Global Value Innovation Creator 3 사업에 선발되었습니다! (Chanwook Hwang, a researcher in the integrated master’s and doctoral program, working at BRAINSys Lab (PI: Arindam Basu, City University of Hong Kong), has been selected for “the Global Value Innovation Creator 3 project” as a dispatched researcher!) 2024.06 1편의 논문이 Small 저널에 accept 되었습니다. (One paper was accepted in a Small journal.) IRIS 연구실이 과학기술정보통신부 유튜브 ‘요즘이랩’ 콘텐츠에 출연했습니다. [대한민국 온디바이스 AI의 미래 책임진다! 성균관대학교 IRIS 연구실] (IRIS Lab appeared in the Ministry of Science and ICT’s YouTube series ‘Nowadays E-Lab’ content. (https://youtu.be/-7Mc6fKFByg?si=_n-zEjlgXw0TdxhT)) 정성문, 이존이, 연상흠, 소재현, 황찬욱, 허혁 연구원이 DAC 2024에서 주최한 System Design Contest - GPU Track 에서 3rd Place로 수상하였습니다! (Seongmoon Jeong, Johnny Rhe, Sangheum Yeon, Jaehyeon So, Chanwook Hwang, and Hyeok Heo won “3rd place in the System Design Contest - GPU Track hosted by DAC 2024”!) 2024.05 1편의 논문이 Advanced Materials 2024 저널에 accept 되었습니다. (One paper was accepted in the Advanced Materials 2024 journal.) 2024.04 김진주 석사과정 연구원이 Carnegie Mellon Univerity와 IITP에서 지원하는 2024 CMU AI 집중 교육 프로그램 파견 교육생으로 선발되었습니다! (Jinju Kim, a master’s degree researcher, was selected as a dispatched trainee for the 2024 CMU AI intensive training program supported by Carnegie Mellon University and IITP!) 2024.03 2편의 논문이 CVPR 2024 학회에 highlight 논문으로 accept 되었습니다. (Two papers were accepted as highlight papers at the CVPR 2024 conference.) 김진주 연구원이 석사과정으로, 오영환, 박찬웅 연구원이 석박통합과정으로 IRIS Lab에 새로 조인했습니다. 축하합니다! (Jinju Kim has joined the IRIS Lab as a master’s student, and Yeong Hwan Oh and Chan Woong Park have joined as combined master’s and doctoral students. Congratulations!) 2024.02 서우람 연구원이 SSIT 석사과정을, 최한결 연구원이 인공지능학과 석사과정을, 허동혁 연구원이 AI시스템공학과 석사과정을, 정문찬 연구원이 인공지능학과 박사과정을 졸업했습니다. 축하합니다! (Wooram Seo graduated from the master’s program at SSIT, Hangyul Choi graduated from the master’s program in the Department of Artificial Intelligence, Donghyeok Heo graduated from the master’s program in the Department of AI Systems Engineering, and Cheng Wencan graduated from the doctoral program in the Department of Artificial Intelligence. Congratulations!) 1편의 논문이 TCAS-I 2024 저널에 accept 되었습니다. (One paper was accepted into the TCAS-I 2024 journal.) 1편의 논문이 DAC 2024 학회에 accept 되었습니다. (One paper was accepted into the TCAS-I 2024 journal.) 2024.01 이존이 석박통합과정 연구원이 Asia and South Pacific Design Automation Conference (ASP-DAC)에서 주최한 Student Research Forum에서 Most Popular Poster Award를 수상하였습니다! (Johnny Rhe, a combined master’s and doctoral program researcher, won “the Most Popular Poster Award at the Student Research Forum hosted by the Asia and South Pacific Design Automation Conference (ASP-DAC)”!) 김용수, 소재현, 정문찬, 김시연(졸업), 황찬욱 연구원이 KCS 2024(한국반도체학술대회)에서 주최한 CDC(Chip Design Contest)에서 우수설계상을 수상하였습니다! (Yong Soo Kim, Jaehyeon So, Cheng Wencan, Si Yeon Kim, and Chanwook Hwang won “the Excellence in Design Award at the CDC (Chip Design Contest) hosted by KCS 2024 (Korea Semiconductor Conference)”!) 1편의 논문이 ICLR 2024 학회에 spotlight 논문으로 accept 되었습니다. (One paper was accepted as a spotlight paper at the ICLR 2024 conference.) 1편의 논문이 FGCS 2024 저널에 accept 되었습니다. (One paper was accepted into the FGCS 2024 journal.) 2023.12 1편의 논문이 ACS Nano 2023 저널에 accept 되었습니다. (One paper was accepted in the ACS Nano 2023 journal.) 2023.10 1편의 논문이 NeurIPS 2023 학회에 accept 되었습니다. (One paper was accepted at the NeurIPS 2023 conference.) 2023.09 김지석 연구원이 석사과정으로, 연상흠 연구원이 석박통합과정으로, 방현수 연구원이 박사과정으로 IRIS Lab에 새로 조인했습니다. 축하합니다! (Ji Seok Kim joined the IRIS Lab as a master’s student, Sangheum Yeon as a combined master’s and doctoral student, and Hyeonsu Bang as a doctoral student. Congratulations!) 2023.08 전강은 박사후 연구원이 삼성전자 DS부문 산학협력 교류회에서 우수논문상 장려상을 수상하였습니다! (Kang Eun Jeon received “the Best Paper Award at the Samsung Electronics DS Division Industry-Academia Cooperation Exchange”!) 방현수 연구원이 인공지능학과 석사과정을 졸업했습니다. 축하합니다! (Hyeonsu Bang graduated from the master’s program in Artificial Intelligence. Congratulations!) 2023.07 박주홍, 이존이 연구원이 KAIA 2023 최우수논문상을 수상하였습니다! (Juhong Park and Johnny Rhe won “the KAIA 2023 Best Paper Award”!) 1편의 논문이 ICCD 2023 학회에 accept 되었습니다. (One paper was accepted at the ICCD 2023 conference.) 1편의 논문이 MM 2023 학회에 accept 되었습니다. (One paper was accepted at the MM 2023 conference.) 2편의 논문이 ICCV 2023 학회에 accept 되었습니다. (Two papers were accepted at the ICCV 2023 conference.) 1편의 논문의 ICCAD 2023 학회에 accept 되었습니다. (One paper was accepted at the ICCAD 2023 conference.) Cite × Copy Download",
  "content_length": 9235,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:08"
}