{
  "name": "Jongeun Choi",
  "homepage": "https://mlcs.yonsei.ac.kr",
  "status": "success",
  "content": "Welcome to MLCS. Machine Learning and Control Systems Laboratory SE(3)-equivariant Robot Learning and Control: A Tutorial Survey, International Journal of Control, Automation and Systems 2025 Recent progress in deep learning and Transformers has enabled major advances in robotics through imitation learning, reinforcement learning, and LLM-based multimodal perception. Yet standard neural networks often fail to exploit the symmetries and invariances inherent in robotic environments, requiring large datasets or heavy augmentation. Equivariant neural networks address these limitations by embedding symmetry directly into their architectures, yielding greater efficiency and generalization. This tutorial survey reviews core ideas and recent developments in equivariant deep learning and control for robotics, with emphasis on SE(3)-equivariant models that capture 3D rotational and translational structure in manipulation and control. We introduce essential group theory and Lie group concepts, outline the principles of group-equivariant network design, and examine applications in imitation learning, reinforcement learning, and geometric control. We conclude with open challenges and future directions for building robust, sample-efficient, and multimodal real-world robotic systems using equivariant methods. Data-Driven Driver Training via Counterfactual and Language-Based Guidance in Racing Scenarios, IEEE Access 2025 This work presents a fully data-driven coaching framework to help novice racing drivers improve performance safely and effectively. Traditional coaching and existing automated tools often lack personalization and clear guidance, so we cluster sequential driving behavior to generate pseudo skill labels and train a classification model to assess corner-specific performance. To provide actionable feedback, we introduce a counterfactual explanation method based on negative SHAP values that identifies which feature adjustments would raise performance to expert levels. A customized LLM translates this feedback into intuitive natural language. In simulated racing experiments, our approach accurately predicts skill levels, clusters driving strategies, and significantly improves cornering and lap times. Drivers also retain these gains even after feedback is removed, demonstrating strong potential for scalable and interpretable driver training. Single-step prediction of inferior alveolar nerve injury after mandibular third-molar extraction using contrastive learning and Bayesian auto-tuned deep learning model, Dentomaxillofacial Radiology 2025 The study developed a deep learning framework to predict inferior alveolar nerve (IAN) injury using CBCT and panoramic radiographs. Five architectures were trained on 902 panoramic and 1,500 CBCT images, and both contrastive learning and Bayesian optimization markedly improved model performance, raising the best F1-score to 0.923. The optimized AI system outperformed oral and maxillofacial surgeons on CBCT cross-sectional images but performed slightly worse on panoramic radiographs. Overall, the combined approach effectively enhances IAN injury prediction, with contrastive learning addressing data imbalance and Bayesian optimization improving accuracy, while expert interpretation remains valuable for panoramic imaging. Explainable Deep Learning Approaches for Risk Screening of Periodontitis, Journal of Dental Research, 2025 Several studies have linked periodontitis to systemic diseases, yet a reliable clinical tool for early screening remains unavailable. This study leverages explainable artificial intelligence (XAI) to facilitate early detection by analyzing clinical features and providing individualized risk assessments. Using 30,465 participant records from NHANES, deep learning and machine learning models were trained on 9,632 all-age and 5,601 over-50 datasets, achieving AUCs of 0.858 and 0.865, respectively, for screening and diagnosis. LIME-based explainability identified key contributing factors, with age, sex, diabetes, smoking, and tissue transglutaminase emerging as the most significant, while arthritis, sleep disorders, hypertension, cholesterol, and obesity also played a role. The findings demonstrate the potential of XAI-driven risk assessment to enhance early detection and preventive strategies for periodontitis in clinical settings. Learning Expert-Level Racing Strategies Via Scheduled Cost Functions in Model Predictive Control, IEEE Transactions on Intelligent Vehicles, 2024 This paper introduces a novel framework that enhances the imitation of expert strategies by incorporating a scheduled cost function into the MPC. We present an inverse model predictive control (iMPC) framework, equipped with a custom MPC formulation that adeptly integrates scheduled cost functions. By employing Gaussian process (GP) regression, our framework effectively maps the connection between trajectories and their respective scheduling costs, enabling dynamic adaptation of cost functions within MPC planning. Furthermore, we present a probabilistic modeling method, combining Bayesian optimization (BO) with GP. This method is designed to create datasets that closely mimic expert-level driving behaviors, enriching the data available for training and validating our iMPC approach. We evaluate our framework by emphasizing the goodness of fit and interpretability of the reconstructed cost functions and the resulting trajectories. We validate our framework using human-in-the-loop expert data and demonstrate the superiority of our methodology by comparing it with a tracking MPC. Multi-class segmentation of temporomandibular joint using ensemble deep learning, Scientific Reports volume 14, 2024 We developed deep learning models tailored to the automatic segmentation of temporomandibular joint components, including the temporal bone, disc, and condyle. These models underwent rigorous training and validation utilizing a dataset of 3693 magnetic resonance images from 542 patients. Upon evaluation, our ensemble model, which combines five individual models, yielded average Dice similarity coefficients of 0.867, 0.733, 0.904, and 0.952 for the temporal bone, disc, condyle, and background class during internal testing. In the external validation, the average Dice similarity coefficients values for the temporal bone, disc, condyle, and background were 0.720, 0.604, 0.800, and 0.869, respectively. When applied in a clinical setting, these artificial intelligence-augmented tools enhanced the diagnostic accuracy of physicians, especially when discerning between temporomandibular joint anterior disc displacement and osteoarthritis. Human Motion Prediction: Assessing Direct and Geometry-Aware Approaches in 3D Space, in IEEE Access 2024 This survey provides an exhaustive review of human motion prediction algorithms and categorizes them according to their core architectures, including Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs), Graph Convolutional Networks (GCNs), Generative Adversarial Networks (GANs), Variational Autoencoders (VAEs), Transformers, and Equivariant Neural Networks (ENNs). Our key contribution is a systematic presentation of the latest prediction methodologies, classified into direct and geometry-aware modeling. We begin with the problem formulation of human motion prediction, explore assorted techniques, and discuss data representation, accompanied by a list of accessible datasets. We also identify and analyze the ongoing challenges and limitations of the current algorithms, offering insights into potential future developments in this domain. An Online Guide System for Improving Driving Skills on the Race Track: Visual Feedback Approach, 26th International Conference on Human-Computer Interaction, HCII 2024. Racing instruction often involves instructors riding along in the vehicle, providing coaching on aspects such as acceleration, braking points, and handling techniques, primarily through verbal instruction. In this paper, we propose an online racing guide system designed to partially emulate the role of a human instructor. The proposed system comprises a guide algorithm and a driver feedback interface. By employing model predictive control techniques, the guide algorithm generates optimal torque and steering guidance based on the vehicle state and pre-collected track data. The computed optimal guidance is conveyed to the driver through visual feedback. This paper covers the overall system setup, algorithm, experimental results, and future plans. Inferring Human Control Intent Using Inverse LQR with Output Penalty Versus Gain Penalty: Better Fit But Similar Intent To identify the underlying mechanisms of human motor control, parametric models are utilized. One approach of employing these models is inferring the control intent (estimating motor control strategy). In this study, we derive an ILQR optimization with output penalty; minimizing the error between the model output and the measured output. We conducted the test on 30 healthy subjects who sat on a robotic seat capable of rotation. The task utilized a physical human-robot interaction with a perturbation torque as input and lower and upper body angles as output. Our method significantly improved the goodness of fit compared to the gain-penalty ILQR. Moreover, the dominant inferred intent was not statistically different between the two methods. To our knowledge, this work is the first that infers motor control intent for a sample of healthy subjects. This is a step closer to investigating control intent differences between healthy subjects and subjects with altered motor control, e.g., low back pain. Automatic concrete slump prediction of concrete batching plant by deep learning, Developments in the Built Environment, Volume 18, April 2024 We propose an automatic slump prediction method based on the VGG16 neural network by analyzing the video from the final discharge hopper of the batching plant. Additionally,",
  "content_length": 49070,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:10"
}