{
  "name": "Joon-Seok Kim 0006",
  "homepage": "https://www.joonseok.org/p/about.html",
  "status": "success",
  "content": "GeoSpatial Science: About Pages Home About Research Publications Teaching Contact About I am an Assistant Professor of Computer Science and a Director of AI and Simulation Lab at Emory University. Before joining Emory, I worked as an R&D Scientist in the Geospatial Science and Human Security Division at Oak Ridge National Laboratory (ORNL), and as a Postdoctoral Researcher at Pacific Northwest National Laboratory (PNNL), George Mason University, and Pusan National University. I also gained six months of professional experience in the Geospatial Information Section at the United Nations Global Service Centre (UNGSC) in Brindisi, Italy, serving as a geospatial expert specializing in Open Source Geospatial Software. Since then, I have contributed to the UN Open GIS Initiative as a member. In 2013, I participated in the MediaQ project—designed and maintained by the Integrated Media Systems Center (IMSC) at the University of Southern California (USC)—as an external collaborator. I earned my Bachelor of Engineering, Master of Engineering, and Ph.D. in Computer Engineering from Pusan National University, South Korea. My doctoral dissertation was titled \"Preserving Location Anonymity in Indoor Spaces,\" and was conducted under the supervision of Prof. Ki-Joune Li. My primary research areas include spatial and spatiotemporal databases, data science, AI/ML, computational geometry, agent-based modeling, urban simulation, spatial analysis, location privacy, GIS, data modeling, and data mining. The results of my research have been published in various papers and reports. I actively contribute to professional services in the geoinformation and simulation communities. Currently, I serve as the Workshop Chair of SIGSPATIAL 2025, General Chair of GeoSim 2025 and GeoHealth 2025, Program Chair of GeoAnomalies 2025, and Program Committee Member of SIGSPATIAL 2025, CIKM 2025. I serve as a Guest Editor for the special issue \"Geosimulation\" in the ACM Transactions on Spatial Algorithms and Systems and a Review Editor on the Editorial Board of Smart Technologies and Cities, a specialty section of Frontiers in Sustainable Cities. Previously, I served as a Guest Editor for the special issue \"Geo-Enriched Data Modeling & Mining\" in the ISPRS International Journal of Geo-Information. I was the General Chair of GeoSim from 2021 to 2024, Chair of the AIS (AI and Simulation) track at the Spring Simulation Conference 2020, and Chair of the AIS (AI and Simulation) track at the Annual Modeling and Simulation Conference from 2021 to 2022. I also served as Program Co-Chair of GeoSim from 2018 to 2020, and as a Program Committee Member for GeoRich 2020, ACM SIGSPATIAL (2019, 2020,2021, 2022, 2023, & 2024), SpatialEpi (2020, 2021, 2022, 2023, & 2024), WinterSim 2019 (Track: Big Data in Simulation), 2020, 2021 & 2022 (Track: Data Science for Simulation), 2023 (Track: Data Science for Simulation) & (Track: Complex and Resilient Systems), and SSTD 2023. I have participated in various GIS-related projects, including National Spatial Data Infrastructure (NSDI) initiatives, fulfilling multiple roles. As a software developer, I led a project to develop a moving object management system for road networks, which included a moving object generator, simulator, and visualization tool. I played a key role in developing 3DF-GML, a national standard for 3D feature modeling and data specification based on the Geographical Markup Language (GML), serving as project manager. Over more than five years, I was deeply involved in an R&D project aimed at developing an indoor data management system for indoor spatial awareness and indoor data modeling. Notably, I developed an efficient alternative 3D geometry model called Prism. I also contribute to open-source projects, particularly developing modules for GeoTools: 3D geometry and complex feature. Throughout these projects, I have designed system architectures and database schemas, proposed efficient data models and algorithms, obtained three patents, and implemented core modules and various applications. My work includes developing a geo-social simulation framework (funded by DARPA), ensemble approaches for combining COVID-19 simulation predictions with a visualization dashboard (funded by NSF), a co-simulation framework for network attack generation and monitoring, and a realistic large-scale simulation (IARPA). I have worked as an expert on international GIS standards published by the Open Geospatial Consortium (OGC) and ISO/TC211. I also participated in the OGC Working Group for IndoorGML, an international standard for indoor navigation. My video lectures on ISO 19107 – Spatial Schema and GML are available in Korean. I possess strong programming skills. I am an expert in C, C++, and Objective-C, and highly proficient in C#, Java, and Python. I have taught several programming courses, including Introduction to GIS Programming and Algorithms, Introduction to Open Source Software Development, Java Programming, and Object-Oriented Programming. My programming experience spans GIS-related domains such as databases, spatial DBMS (PostGIS, Oracle SDO), web-based applications, 2D/3D graphics, and mobile development. I am also experienced in using and integrating geo-information tools and libraries such as QGIS, ArcGIS, Google Earth, GeoServer, GeoNode, GeoSHAPE, GeoTools, CGAL, and LEDA. I have developed simulation models using frameworks and toolkits including MASON, GeoMASON, NetLogo, OpenSim, Mesa, NS3, HELICS, GridLAB-D, and SUMO. My academic CV (last updated October, 2025). Also, you can find me at Google Scholar, Research Gate, LinkedIn, DBLP Email ThisBlogThis!Share to XShare to FacebookShare to Pinterest Home Subscribe to: Comments (Atom)",
  "content_length": 5737,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:17"
}