{
  "name": "Joost Vennekens",
  "homepage": "https://people.cs.kuleuven.be/~joost.vennekens",
  "status": "success",
  "content": "Welcome to the personal webpage of Joost Vennekens. Associate professor at KU Leuven About Joost Vennekens I am an associate professor at KU Leuven Campus De Nayer in Sint-Katelijne-Waver. I belong to the Faculty of Engineering Technology and the Department of Computer Science. My research is concerned with AI technology and its industrial applications. I belong to the research group EAVISE, which focuses on AI, computer vision and embedded systems, and to the research group DTAI, which focuses on declarative languages and AI. I am a member of the board of the Benelux Association for Artificial Intelligence and of Leuven.AI board. Research My main research interests are: Applications of AI (in the section on industrial collaboration some example projects are mentioned) Knowledge representation and reasoning Probabilistic models and causality You can find a list of my publications and current research project on my KU Leuven Who's Who page. Alternatively, you can have a look at my google scholar profile. If you may be interested in collaborating on one of my research topics, don't hesitate to send me an email. Collaboration with industrial partners Much of my research is done together with industrial partners. If you have a challenging problem, we can help you to discover which AI technology might provide the best solution. We offer practical expertise in a broad range of state-of-the-art AI technology, (including Machine Learning, Data Mining, Deep Learning and Knowledge Representation & Reasoning). In addition, we have a lot of experience in collaborating with industry and can help you to figure out which government subsidies would allow us to work together at minimal financial cost to you. If you have an interesting use case for AI technology, don't hesitate to contact me. Some examples of projects with industrial partners: The Technology Transfer project Decision Analytics examines how to build models of decision knowledge and use these to automate, support and analyse decisions. We apply our results to a number of real-life use cases of a number of different companies. The Technology Transfer project Intelligent Analysis of Time Series studies machine learning methods for analysing time series data, with a focus on anomaly detection. We apply these methods to data sets from several participating companies. The Technology Transfer project Start to Deep Learn helps companies to get started with deep learning technology. We offer advice and training, as well as developing a number prototypes. In addition to a collaboration with our researchers, you may be also be interested in having a master student do his master's thesis in your company. Feel free to send me email for more information about this. Finally, I also regularly give talks about various aspects of AI at different kinds of events. As a flexible speaker who can address specialists as well as a general audience, I am always happy to discuss possibilities.",
  "content_length": 2968,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:21"
}