{
  "name": "Joost Broekens",
  "homepage": "https://www.universiteitleiden.nl/en/staffmembers/joost-broekens#tab-2",
  "status": "success",
  "content": "Joost Broekens - Leiden University Skip to main content Joost Broekens Associate professor artificial intelligence Name Dr.ir. D.J. Broekens Telephone 071 5277139 E-mail d.j.broekens@liacs.leidenuniv.nl Joost Broekens studies Artificial Intelligence, in particular Affective Computing and the interaction between humans and socially interactive agents. He is the President Elect of the Association for the Advancement of Affective Computing (AAAC), which is the main international organisation in his research field. He is an associate professor and head of the Affective Computing and Human Robot Interaction group at the Leiden Institute of Advanced Computer Science (LIACS) of Leiden University. Besides this, Joost is a member of of the interdisciplinary research programme Society, Artificial Intelligence and Life Sciences (SAILS). Finally, he is also co-founder and CTO of Interactive Robotics, enabling students from any age to learn with and from social robots. More information about Joost Broekens PhD Candidates Murad Bozik PhD student Bernhard Hilpert PhD candidate Danica Mast PhD candidate / guest News 26 November 2025 Two new programme directors to start in the new year 27 June 2023 Conference on opportunities and dangers of AI: ‘Europe needs a daring vision’ 20 December 2021 Leiden2022: a science festival bursting with activities 07 November 2019 CRITTERS Exposition: a photo impression Former PhD Candidates Thomas Moerland Joost Broekens studies Artificial Intelligence, in particular Affective Computing and the interaction between humans and socially interactive agents. He is the President Elect of the Association for the Advancement of Affective Computing (AAAC), which is the main international organisation in his research field. He is an associate professor and head of the Affective Computing and Human Robot Interaction group at the Leiden Institute of Advanced Computer Science (LIACS) of Leiden University. Besides this, he is a member of the interdisciplinary research programme Society, Artificial Intelligence and Life Sciences (SAILS). Finally, he is also co-founder and CTO of Interactive Robotics, enabling students from any age to learn with and from social robots. His research interests include computational modelling of emotions in reinforcement learning, computational models of cognitive appraisal, emotion psychology, emotions in computer games, explainability of AI and transparency, human perception and effects of emotions expressed by virtual agents and robots, emotional and affective self-report, human-robot and human-agent interaction, and educational humanoid robots. His current research focuses on human-robot interaction, and Reinforcement Learning as a formal model for emotional appraisal. Associate professor Faculty of Science Leiden Inst of Advanced Computer Science Work address Gorlaeus Building Einsteinweg 55 2333 CC Leiden Contact 071 5277139 d.j.broekens@liacs.leidenuniv.nl Publications No relevant ancillary activities Share on Facebook Share by Bluesky Share on LinkedIn Share by WhatsApp Share by Mastodon Organisation Science Leiden Institute of Advanced Computer Science (LIACS) Human AI Machine Learning Podcast: Computers don't byte Robots & Emotions: Are we moving from AI to EI? Associate Professor Joost Broekens tells all about the fascinating world of affective computing. Visit our website! This website uses cookies. More information. Accept cookies Reject cookies",
  "content_length": 3452,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:20"
}