{
  "name": "Joost Batenburg",
  "homepage": "https://www.cwi.nl/people/1742",
  "status": "success",
  "content": "Joost Batenburg Skip to main content Joost Batenburg Full Name Prof.dr. K.J. Batenburg Email K.J.Batenburg@cwi.nl Phone +31 20 592 4037 Room L020 Department(s) Computational Imaging Function(s) Scientific Staff Member, Professor - Universiteit Leiden Biography Joost Batenburg published more than 80 journal articles and more than 60 conference papers in the field of tomographic image processing and reconstruction. From 2013 till 2017 he chaired the EU COST Action EXTREMA on advanced X-ray tomography. He pioneered the field of discrete tomography, developing the first large-scale reconstruction methods. His current research focuses on creating a real-time tomography pipeline, funded by an NWO Vici grant. He is responsible for the FleX-Ray lab, where a custom-designed CT system is linked to advanced data processing and reconstruction algorithms. Publications All publications Kiss, M., Biguri, A., Shumaylov, Z., Sherry, F., Batenburg, J., Schönlieb, C.-B., & Lucka, F. (2025). Benchmarking learned algorithms for computed tomography image reconstruction tasks. Applied Mathematics for Modern Challenges. doi:10.3934/ammc.2025001 Andriiashen, V., van Liere, R., van Leeuwen, T., & Batenburg, J. (2024). Quantifying the effect of X-ray scattering for data generation in real-time defect detection. Journal of X-ray Science and Technology, 32(4), 1099–1119. doi:10.3233/XST-230389 Kadu, A., Lucka, F., & Batenburg, J. (2024). Single-shot tomography of discrete dynamic objects. IEEE Transactions on Computational Imaging, 10, 941–952. doi:10.1109/TCI.2024.3414320 Andriiashen, V., van Liere, R., van Leeuwen, T., & Batenburg, J. (2024). X-ray image generation as a method of performance prediction for real-time inspection: A case study. Journal of Nondestructive Evaluation, 43, 79:1–79:13. doi:10.1007/s10921-024-01091-8 Bossema, F., Palenstijn, W. J., Heginbotham, A., Corona, M., van Leeuwen, T., van Liere, R., … Batenburg, J. (2024). Enabling 3D CT-scanning of cultural heritage objects using only in-house 2D X-ray equipment in museums. Nature Communications, 15(1), 3939:1–3939:10. doi:10.1038/s41467-024-48102-w Schut, D., Wood, R., Trull, A., Schouten, R. (Rob), van Liere, R., van Leeuwen, T., & Batenburg, J. (2024). Joint 2D to 3D image registration workflow for comparing multiple slice photographs and CT scans of apple fruit with internal disorders. Postharvest Biology and Technology, 211, 112814:1–112814:10. doi:10.1016/j.postharvbio.2024.112814 Kadu, A., Lucka, F., & Batenburg, J. (2024). Slice-by-Slice X-ray Tomography dataset of Dog Toy. doi:10.5281/zenodo.10808364 Schoonhoven, R., Skorikov, A., Palenstijn, W. J., Pelt, D., Hendriksen, A., & Batenburg, J. (2024). How auto-differentiation can improve CT workflows: Classical algorithms in a modern framework. Optics Express, 32(6), 9019–9041. doi:10.1364/OE.502920 Pramanik, D., Vaskimo, L., Batenburg, J., Kostenko, A., Droppert, K., Smets, E., & Gravendeel, B. (2024). Orchid fruit and root movement analyzed using 2D photographs and a bioinformatics pipeline for processing sequential 3D scans. Applications in Plant Sciences, 12(1), e11567:1–e11567:17. doi:10.1002/aps3.11567 Graas, A., Wagner, E., van Leeuwen, T., van Ommen, R., Batenburg, J., Lucka, F., & Portela, L. (2024). X-ray tomography for fully-3D time-resolved reconstruction of bubbling fluidized beds. Powder Technology, 434, 119269:1–119269:14. doi:10.1016/j.powtec.2023.119269 Awards Dutch Award for ICT research 2018 (2017) C.J. Kok Prize - January (2007) Philips Mathematics Prize - March (2006) Professional activities Professor: Leiden University Chair: International Association for Pattern Recognition - [IAPR] - Technical Committee on Discrete Geometry Chair: EU COST Action EXTREMA Editor: Associate Editor of Image Processing Online (IPOL) Editor: Associate Editor of Journal of Mathematical Imaging and Vision (Springer) Editor: Associate Editor of IEEE Transactions on Computational Imaging Member: Scientific Advisory Council, Netherlands Institute for Conservation + Art + Science (NICAS) Member: Scientific Advisory Council, Hemlholtz Imaging Platform Grants Vici Innovational Research Grant NWO - Real-Time 3D Tomography (2016) Vidi Innovational Research Grant NWO (2010) FWO Postdoctoral Fellowship (2007) FWO Visiting Postdoctoral Fellowship (2006) Current projects with external funding the Center for Optimal, Real-Time Machine Studies of the Explosive Universe (CORTEX) Universal Three-dimensiOnal Passport for process Individualization in Agriculture (UTOPIA) Cookies We use cookies. You can read more about this in our cookie statement. Reject Accept",
  "content_length": 4625,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:20"
}