{
  "name": "Jooyong Lee",
  "homepage": "http://www.jooyongyi.com",
  "status": "success",
  "content": "Jooyong Yi Jooyong Yi Associate Professor LOFT (Lab of Software) Department of Computer Science and Engineering UNIST Location: Building 106, Room 401-6 E-mail: jooyong at unist.ac.kr Jooyong Yi Associate Professor LOFT (Lab of Software) Department of Computer Science and Engineering UNIST Location: Building 106, Room 401-6 E-mail: jooyong at unist.ac.kr [Research Interests] [News] [Publications] [Services] [Courses] [Current Students] [Alumni] [Research Projects] Research Thrusts I am the head of LOFT (Lab of Software) at UNIST. It is often said that software is everywhere -- it is in your phone, on airplanes, in banks, and within government systems. An alarming trend is the emergence of modern, powerful AI systems that are beginning to take over the task of writing software. This is concerning not just because software developers may lose their jobs; it is also because unless we are careful, we may lose control over the software AI writes. To prevent this, we are developing autonomous techniques that continuously monitor and address issues within software as they arise. This requires us to develop techniques that can automatically detect bugs in software [ICSE'25, ASEJ'12, IST'10, ASE'06], fix them automatically [TSE'25, ASE'24, ISSTA'24, TOSEM'23, ASE'23, ISSTA'23, TOSEM'22, IST'22, EMSE'18, FSE'17, ICSE'16, ICSE'15], and verify the correctness of the fixed software [TOSEM'22, TOSEM'15, ISSTA'13, AOSD'13, ASEJ'12, IST'10, ASE'06]. While the fundamental concepts behind these techniques predate the AI era, the advent of AI has made them even more important. At LOFT, we are at the forefront of advancing these techniques to ensure that AI-written software serves humanity, rather than controlling it. Open Positions We have multiple openings for Master's and PhD students. We also welcome undergraduate students who are interested in research. If you are interested, please send me your CV. See here for more details on joining the lab. News November 2025: I received the Distinguished Reviewer Award from ASE 2025 for my contributions as a program committee member. Thank you to the ASE PC members and chairs! July 2025: Our paper Proactive Debugging of Memory Leakage Bugs in Single Page Web Applications has been published in TSE (IEEE Transactions on Software Engineering). This is joint work with Dongsun Kim. February 2025: I gave a talk on Introducing Lightgrey-box Fuzzing in the IFIP WG 2.4 Meeting 70. January 2025: Our paper Lightweight Concolic Testing via Path-Condition Synthesis for Deep Learning Libraries has been accepted to ICSE 2025. With this paper, we have shown that fuzzing efficiency can be significantly improved by exploiting path conditions that are synthesized without using heavyweight symbolic execution. This is joint work with Mijung Kim and Yuseok Jeon. January 2025: I gave a talk on Security Patch Verification in the Shonan Meeting on Trusted Automatic Programming. October 2024: I gave a talk on Automated Program Repair from Fuzzing Perspective in the Dagstuhl Seminar on Automated Programming and Program Repair. August 2024: Our paper Enhancing the Efficiency of Automated Program Repair via Greybox Analysis has been accepted to ASE 2024. With this paper, we have shown that by using a greybox approach, APR efficeincy can be significantly improved. Congratulations to YoungJae Kim and Seungheon Han! July 2024: Our paper Preserving Reactiveness: Understanding and Improving the Debugging Practice of Blocking-call Bugs has been accepted to ISSTA 2024. This is joint work with Dongsun Kim. April 2024: Our research proposal on Binary Micro-Security Patch Technology Applicable With Limited Reverse Engineering Capability Under SW Supply Chain Environments has been accepted for funding by MSIT. September 2023: Our paper LeakPair: Proactive Repairing of Memory Leaks in Single Page Web Applications received the ACM Distinguished Paper Award at ASE 2023. September 2023: Our paper Poracle: Testing Patches Under Preservation Conditions to Combat the Overfitting Problem of Program Repair has been published in TOSEM (ACM Transactions on Software Engineering and Methodology). July 2023: Our demo paper BUGSC++: A Highly Usable Real World Defect Benchmark for C/C++ has been accepted to ASE 2023 Demo. This is joint work with Gabin An, Shin Yoo, Minhyuk Kwon, and Kyunghwa Choi. Our benchmark is available here. May 2023: Our paper Automated Program Repair from Fuzzing Perspective has been accepted to ISSTA 2023. Congratulations to YoungJae Kim and Seungheon Han! April 2023: Our research proposal on Large-Language-Model-Based Low-Code Platform Development has been accepted for funding by MSIT. Feb 2023: Our research proposal on Patch Validation Technique for Automated Program Repair has been accepted for funding by MSIT. Publications [DBLP] [Google Scholar] \"Those who can imagine anything, can create the impossible.\" — Alan Turing Selected Publications [ICSE'25] Lightweight Concolic Testing via Path-Condition Synthesis for Deep Learning Libraries [slides] The first lightgrey-box fuzzing technique where path conditions are inferred based on execution results of previous runs [TSE'25] Proactive Debugging of Memory Leakage Bugs in Single Page Web Applications A journal extension of [ASE'23]; our template-based repair technique outperforms GPT-4. [ASE'24] Enhancing the Efficiency of Automated Program Repair via Greybox Analysis [slides] Greybox patch space exploration; an extension of blackbox patch space exploration presented in [ISSTA'23] [ISSTA'24] Preserving Reactiveness: Understanding and Improving the Debugging Practice of Blocking-call Bugs [slides] [TOSEM'23] Poracle: Testing Patches Under Preservation Conditions to Combat the Overfitting Problem of Program Repair [slides] [ASE'23] LeakPair: Proactive Repairing of Memory Leaks in Single Page Web Applications ACM Distinguished Paper The first automated program repair technique for memory leaks in single page web applications [ASE'23 Demo] BUGSC++: A Highly Usable Real World Defect Benchmark for C/C++ [slides] [ISSTA'23] Automated Program Repair from Fuzzing Perspective [slides] Efficient exploration of the patch space inspired by feedback-driven fuzzing [TOSEM'22] Verifix: Verified Repair of Programming Assignments [IST'22] Speeding up Constraint-Based Program Repair Using a Search-Based Technique Improving the time efficiency of Angelix [ICSE'16] by replacing its symbolic-execution-based patch specification inference with a method based on MCMC (Markov Chain Monte Carlo) sampling [EMSE'18] A Correlation Study Between Automated Program Repair and Test-Suite Metrics [FSE'17] A Feasibility Study of Using Automated Program Repair for Introductory Programming Assignments [ICSE'16] Angelix: Scalable Multiline Program Patch Synthesis via Symbolic Analysis An automated program repair approach that first infers a patch specification via symbolic execution and then synthesizes a patch that satisfies the specification using program synthesis [ICSE'15] DirectFix: Looking for Simple Program Repairs An automated program repair approach that converts the program repair problem into a MaxSMT problem to synthesize a minimal repair [TOSEM'15] Software Change Contracts [ISSTA'13] Expressing and Checking Intended Changes via Software Change Contracts [AOSD'13] Past Expression: Encapsulating Pre-states at Post-conditions by Means of AOP [ASEJ'12] Efficient and Formal Generalized Symbolic Execution [IST'10] Filtering False Alarms of Buffer Overflow Analysis Using SMT Solvers [ASE'06] Bogor/Kiasan: A k-bounded Symbolic Execution for Checking Strong Heap Properties of Open Systems Services \"Only a life lived for others is a life worthwhile.\" — Albert Einstein PC member ISSTA 2026, FSE 2026, ASE 2025, SAS 2025, FSE 2025, ISSTA 2025, ICSE 2025, APSEC 2024 (ERA), ICSE 2024 (SRC), FSE 2024, APSEC 2023, FSE 2023 (Tutorials), APR 2023, FSE 2022, ICSE 2022 (SRC track), ICSE 2021, ICSE 2020 (NIER), ICPC 2020, ISSTA 2019, FSE 2018 OC member ICST 2026 (Doctoral Symposium co-chair), ASE 2025 (JF co-chair), APSEC 2023 (ERA co-chair), KCSE 2022 (program chair), NII Shonan meeting on JML (co-organizer) Editors Editor in Chief of Communications of the Software Engineering Society of Korea (2024 - present) Editor of Communications of the Software Engineering Society of Korea, Vol. 4, No. 1 (2024. 9) Journal Review TOSEM, TSE, JSS, T-IFS Courses If you have proficiency in Korean, I highly recommend you watch these videos [v1, v2, v3]. In essence, I suggest you train your neural learning model (a.k.a, your brain) as much as you can in the classroom, using the natural loss function (a.k.a, trial and error). UNI111 Introduction to Computer Science and Engineering (2024 Fall) CSE271 Principles of Programming Languages (2019 Spring, 2020 Spring, 2024 Fall) CSE241 Object-Oriented Programming (2019 Fall) CSE332 Theory of Computation (2021 Fall) CSE364 Software Engineering (2020 Fall, 2022 Spring) CSE411 Introduction to Compilers (2021 Fall, 2023 Spring, 2024 Spring) CSE482 Program Analysis and Synthesis (2019 Fall) CSE552 Program Analysis (2021 Spring) CSE524 Advanced Software Engineering (2020 Fall, 2022 Fall) CSE613 Program Transformation (2023 Fall) Current Students 🇰🇿 ♂ Satbek Abdyldayev (PhD): Program Transformation via Bimodal Analysis 🇰🇷 ♂ YoungJae Kim (PhD): Efficient Online Program Repair Algorithms 🇰🇷 ♂ Seungheon Han (PhD): Patch Validation via Program Analysis 🇻🇳 ♂ Nguyễn Gia Phong (PhD): Toward More Trustworthy System Software via Program Repair and Transformation 🇰🇷 ♀ Eui Bin Bae (PhD): Ensuring Trust in Document-Code Alignment 🇰🇷 ♂ Jun Yeong Noh (MS/PhD Combined): On-Demand Runtime Program Repair 🇰🇷 ♂ Dohyun Ryu (Research Associate) 🇰🇷 ♂ Yeseung Lee (Undergraduate Intern) 🇰🇷 ♂ SeongYoon Jeong (Undergraduate Intern) Alumni 🇨🇳 ♀ Liqi Tang (Visiting Graduate Student from National University of Singapore) 🇫🇷 ♂ Félix Yvonnet (Visiting Graduate Student from ENS, France) 🇻🇳 ♂ Nguyễn Gia Phong (Master 2024): P",
  "content_length": 11349,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:25"
}