{
  "name": "Jordan Kodner",
  "homepage": "https://jkodner05.github.io",
  "status": "success",
  "content": "Jordan Kodner on the Web JORDAN KODNER COMPUTATIONAL LINGUIST at STONY BROOK UNIVERSITY email: jordan.kodner at-sign stonybrook edu office: Dept. of Linguistics, Social & Behavioral Sciences Building (SBS), Floor 2 Fall 2025 Information About Me Journal Articles Proceedings Other Manuscripts Presentations I am an assistant professor in the Stony Brook University Department of Linguistics, affiliated with the Institute for Advanced Computational Science, Department of Computer Science, Institute for AI-Driven Discovery and Innovation, and Natural Language Processing (NLP) group. My primary research revolves around computational approaches to child language acquisition and their broader implications. In particular, Algorithmic models of grammar acquisition, especially morphology How those processes drive language variation and change What insights they provide for low-resource NLP What they can tell us about the the intersection of NLP and cognitive science I am writing a book titled Child Language Acquisition in the Past: A Mechanistic View of Language Change for Edinburgh University Press. It investigates the role that child language acquisition plays in language change. The broad goal is to build a general understanding of language change grounded in an understanding of its mechanisms. Enabled by algorithmic modeling and corpus methods, I draw insights from traditional historical linguistics, the cognitive science of language acquistion, and findings in variationist sociolinguistics. My other academic interests, a few of which have intersected my research so far, include (alphabetically): Chinese language varieties, computing history, evolutionary theory, formal language theory, general NLP, human geography, Indo-European historical linguistics, Latin language, paleontology and cladistics, programming languages and software engineering, Roman history and culture, Semitic languages, Shona language, Singlish and Singaporean English, and writing systems. I received my PhD in 2020 (my dissertation) from the University of Pennsylvania Department of Linguistics, where I worked with Charles Yang and Mitch Marcus. I received a master's degree from the University of Pennsylania Department of Computer and Information Science in 2018. From 2013 through 2015, I was an Associate Scientist in the Speech, Language, and Multimedia group at Raytheon BBN Technologies where I worked on defense and medical-related projects. I interned with Amazon Alexa AI-Natural Language Understanding in summer 2020. Sarah Payne, and Jordan Kodner. (2025). Some Innate Characteristics of Neural Network Models of Morphological Inflection. Linguistics Vanguard. (manuscript) Jordan Kodner, Sarah Payne, Jeff Heinz. (2023). Why Linguistics Will Thrive in the 21st Century: A Reply to Piantadosi (2023). Fall 2025 INFORMATION Current Courses LIN 330: Language Acquisition Monday/Wednesday 3:30-4:50pm. The official description:Introduction to the field of language acquisition. Topics include cognitive processes, role of innate ability and environment, developmental stages, individual variation, universal tendencies, interaction of language and cognition, bilingualism, similarities and differences between first- and second-language acquisition, and language disorders.. SBCs: ESI, SBS+, STEM+ LIN 535: Historical Linguistics Tuesday/Thursday 3:30-4:50pm. A description:A study of linguistic change. Some general topics to be discussed are the genetic classification of languages; language families, language, and prehistory; reconstruction; types of sound change; types of semantic change; borrowing. Special LIN 330 Office Hour: Monday 4:50-5:50pm General Office Hours: Tuesday 11:00am-2:00pm JOURNAL ARTICLES AND BOOK CHAPTERS Sarah Payne, and Jordan Kodner. (2025). Some Innate Characteristics of Neural Network Models of Morphological Inflection. Linguistics Vanguard. (manuscript) Jordan Kodner, Sarah Payne, Salam Khalifa, and Zoey Liu. (2025). Evaluating Learning Trajectories of Neural Morphology Acquisition Models. Linguistics Vanguard. (manuscript) Jordan Kodner. (2025). “Generative Perspectives of Language Change and Acquisition. In Diachrony and Language Evolution in International Encyclopedia of Language and Linguistics, 3rd Edition. (manuscript) Héctor J. Vázquez Martínez, Annika Heuser, Charles Yang, Jordan Kodner. (to appear). Evaluating the Existence Proof: LLMs as Cognitive Models of Language Acquisition. In In Artificial Knowledge of Language. Jordan Kodner. (2023). Laissez-Faire Analogical Change. Journal of Historical Syntax. 7(6-19). Proceedings of the 22nd Diachronic Generative Syntax (DiGS) Conference. Jordan Kodner. (2022). Language Acquisition Guiding Theory and Diachrony: A Case Study from Latin Morphology. Natural Language and Linguistic Theory, 41:733–792. Jordan Kodner, Spencer Caplan, and Charles Yang. (2022). Another model not for the learning of language. Proceedings of the National Academy of Science, 119(29):e2204664119. Jordan Kodner. (2022). Computational Approaches to Morphology Acquisition. In Oxford Research Encyclopedia in Linguistics. Oxford University Press. {Spencer Caplan, Jordan Kodner}, and Charles Yang. (2020). Miller's Monkey Updated: Communicative Efficiency and the Statistics of Words in Natural Language. Cognition, 205:104466. (manuscript | source code | demo) Jordan Kodner. (2020). Modeling Language Change in the St. Louis Corridor. Language Variation and Change. 32(1). (manuscript | supplementary material [incorrect on LVC website] | source code) Kathryn Schuler, Jordan Kodner, and Spencer Caplan. (2020). Abstractions are good for brains and machines: A commentary on Ambridge (2020). First Language, 40(5-6):631–635. Jordan Kodner. (2019). Estimating child linguistic experience from historical corpora. Glossa: A Journal of General Linguistics, 4(1):122. CONFERENCE AND WORKSHOP PROCEEDINGS Note: Proceedings published in the ACL conference and workshop anthologies (ACL, ACL Findings, CMCL, ComputEL, EMNLP, GEM2, GenBench, Insights, LChange, LREC, SCiL, SIGMORPHON, VarDial, WANLP) are refereed and archival. CogSci proceedings are refereed but non-archival. 2025 Sarah Payne and Jordan Kodner. (2025). Lemmas Matter, But Not Like That: Predictors of Lemma-Based Generalization in Morphological Inflection. In Findings of the Association for Computational Linguistics: ACL 2025, pages 25270-25286. Zhengxiang Jack Wang, Jordan Kodner, and Owen Rambow. (2025). Evaluating LLMs with Multiple Problems at Once. In Proceedings of the Fourth Workshop on Generation, Evaluation and Metrics (GEM2), pages 178-199. Zhengxiang Jack Wang, Veronica Makarova, Zhi Li, Jordan Kodner, and Owen Rambow. (2025). LLMs can Perform Multi-Dimensional Analytic Writing Assessments: A Case Study of L2 Graduate-Level Academic English Writing. In Proceedings of the 63rd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 8637-8663. Zhengxiang Jack Wang, Jordan Kodner, and Owen Rambow. (2025). Exploring Limitations of LLMs' Text Understanding Capabilities with Multi-Problem Evaluation. In The 2025 Workshop of Insights from Negative Results in NLP (Insights), pages 121-140. Salam Khalifa, Abed Qaddoumi, Jordan Kodner, and Owen Rambow. (2025). Learning Cross-Dialectal Morphophonology with Syllable Structure Constraints. In The Twelfth Workshop on NLP for Similar Languages, Varieties and Dialects (VarDial), pages 157–16. 2023 Jordan Kodner, Salam Khalifa, Sarah Payne. (2023). Exploring Linguistic Probes for Morphological Generalization. In Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 8933–8941. Héctor J. Vázquez Martínez, Annika Heuser, Charles Yang, Jordan Kodner. (2023). Evaluating Neural Language Models as Cognitive Models of Language Acquisition. In The first workshop on (benchmarking) generalisation in NLP (GenBench), pages 48-64. Jordan Kodner, Sarah Payne, Salam Khalifa, Zoey Liu. (2023). Morphological Inflection: A Reality Check. In Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (ACL), pages 6082-6101. Salam Khalifa, Sarah Payne, Jordan Kodner, Ellen Broselow, Owen Rambow. (2023). A Cautious Generalization Goes a Long Way: Learning Morphophonological Rules. In Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics (ACL), pages 1793–1805. Jordan Kodner, Salam Khalifa, Sarah Payne, Zoey Liu. (2023). Re-Evaluating Neural Models of Morphological Inflection. In Proceedings of the 45th Annual Meeting of the Cognitive Science Society (CogSci), 45:3259– 3267. 2022 Salam Khalifa, Jordan Kodner, Owen Rambow. (2022). Learning Arabic Morphophonology. In Proceedings of the Seventh Arabic Natural Language Processing Workshop (WANLP), pages 295-301. Jordan Kodner, Salam Khalifa, et xxviii al. (2022). SIGMORPHON-UniMorph 2022 Shared Task 0: Generalization and Typologically Diverse Morphological Inflection. In Proceedings of the 19th SIGMORPHON Workshop on Computational Research in Phonetics, Phonology, and Morphology, pages 176-203. Jordan Kodner and Salam Khalifa. (2022). SIGMORPHON-UniMorph 2022 Shared Task 0: Modeling Inflection in Language Acquisition. In Proceedings of the 19th SIGMORPHON Workshop on Computational Research in Phonetics, Phonology, and Morphology, pages 157-175. Jordan Kodner. (2022). Modeling the Relationship between Input Distributions and Learning Trajectories with the Tolerance Principle. In Proceedings of the Workshop on Cognitive Modeling and Computational Linguistics (CMCL), pages 61-67. Aniket Kali & Jordan Kodner. (2022). Language Acquisition, Neutral Change, and Diachronic Trends in Noun classifiers. In Proceedings of the 3rd Workshop on Computational Approaches to Historical Language Change (LChange), pages 11-22. 2021 Caleb Belth, Sarah Payne, Deniz Beser, Jordan Kodner, & Charles Yang. (2021). The Greedy and Recursive Search for Morphological Productivity. In Proceed",
  "content_length": 22005,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:20"
}