{
  "name": "Jorge Fandinno",
  "homepage": "https://www.unomaha.edu/college-of-information-science-and-technology/about/faculty-staff/jorge-fandinno.php",
  "status": "success",
  "content": "Jorge Fandinno | College of Information Science & Technology | University of Nebraska Omaha Jorge Fandinno Jorge Fandinno, Ph.D. Assistant Professor Computer Science email: jfandinno@unomaha.edu office: PKI 281C office phone: 402.55.44952 Google Scholar: https://scholar.google.com/citations?user=XhtqQoYAAAAJ ORCID: 0000-0002-3917-8717 note: This profile is pulling in data from Digital Measures. Postings on personal websites or social media do not indicate that the individual is speaking on behalf of UNO. General Information General Information Biography Dr. Jorge Fandinno is an Assistant Professor of Computer Science at the University of Nebraska at Omaha since 2020. Previously, he was an Alexander von Humboldt Fellow at the University of Potsdam (Germany) and a Postdoctoral Fellow at the Toulouse Institute of Computer Science Research (France). His main research interests are in Artificial Intelligence, in particular Knowledge Representation and Reasoning, on both theoretical and practical aspects. He received his PhD in 2015 from the University of Corunna (Spain) and is an author of more than 60 publications in international journals and refereed conference proceedings, including top journals (Artificial Intelligence, Journal of Artificial Intelligence Research, and Theory and Practice of Logic Programming) and conferences (AAAI, IJCAI, ECAI, KR, ICLP, LPNMR, JELIA) in AI. Three of these papers won the best technical paper award at the 13th, 14th and 15th International Conference of Logic Programming and Nonmonotonic Reasoning (LPNMR 2015, 2017 and 2019). Supervised students won the best student paper award on the 16th European Conference on Logics in Artificial Intelligence (JELIA) and the 36th International Conference on Logic Programming (ICLP). He is the recipient of a NSF CAREER award in 2024. Scholarship/Research/Creative Activity Scholarship/Research/Creative Activity Selected Publications Aguado, Felicidad, Cabalar, Pedro, Fandinno, Jorge, Pearce, David, Perez, Gilberto, Vidal, Concepcion. 2019. Forgetting auxiliary atoms in forks, Artificial Intelligence, 275, 575--601.Fandinno, Jorge, Hansen, Zach , Lierler, Yuliya. 2022. Axiomatization of Aggregates in Answer Set Programming, Thirty-Sixth AAAI Conference on Artificial Intelligence.Cabalar, Pedro, Fandinno, Jorge, Farinas del Cerro, Luis. 2020. Autoepistemic answer set programming, Artificial Intelligence, 289, 103382.Fandinno, Jorge, Faber, Wolfgang, Gelfond, Michael. 2022. Thirty years of Epistemic Specifications, Theory and Practice of Logic Programming.Fandinno, Jorge, Schulz, Claudia. 2019. Answering the \"why\" in answer set programming - A survey of explanation approaches, Theory and Practice of Logic Programming, 19, 2, 114--203. Externally Funded Research CAREER: Answer Set Programming for Quantitative Information, National Science Foundation, Federal - present Additional Information Bio Dr. Jorge Fandinno is an Assistant Professor of Computer Science at the University of Nebraska at Omaha since 2020. Previously, he was an Alexander von Humboldt Fellow at the University of Potsdam (Germany) and Postdoctoral Fellow at the Toulouse Institute of Computer Science Research (France). His main research interests are in Artificial Intelligence, in particular Knowledge Representation and Reasoning, on both theoretical and practical aspects. He received his Ph.D. in 2015 from the University of Corunna (Spain) and is an author of over 30 publications in international journals and refereed conference proceedings, including top journals (Artificial Intelligence and Theory and Practice of Logic Programming) and conferences (IJCAI, KR, ICLP, LPNMR, JELIA) in AI. Three of these papers won the best technical paper award at the 13th, 14th, and 15th International Conference of Logic Programming and Nonmonotonic Reasoning (LPNMR 2015, 2017, and 2019). Additional Information Additional Information Bio Dr. Jorge Fandinno is an Assistant Professor of Computer Science at the University of Nebraska at Omaha since 2020. Previously, he was an Alexander von Humboldt Fellow at the University of Potsdam (Germany) and Postdoctoral Fellow at the Toulouse Institute of Computer Science Research (France). His main research interests are in Artificial Intelligence, in particular Knowledge Representation and Reasoning, on both theoretical and practical aspects. He received his Ph.D. in 2015 from the University of Corunna (Spain) and is an author of over 30 publications in international journals and refereed conference proceedings, including top journals (Artificial Intelligence and Theory and Practice of Logic Programming) and conferences (IJCAI, KR, ICLP, LPNMR, JELIA) in AI. Three of these papers won the best technical paper award at the 13th, 14th, and 15th International Conference of Logic Programming and Nonmonotonic Reasoning (LPNMR 2015, 2017, and 2019).",
  "content_length": 4884,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:29"
}