{
  "name": "Jorge Arturo Cobb",
  "homepage": "http://www.utdallas.edu/~jcobb",
  "status": "success",
  "content": "homepage Jorge Arturo Cobb Associate Professor Associate Head for Graduate Education B.S. 1987 (UT-El Paso), M.A. 1989 and Ph.D. 1996 (UT-Austin) First appointment at UTD: Fall 1998 Contact Information The University of Texas at Dallas Department of Computer Science (Mail Station EC 31) 800 West Campbell RoadRichardson, TX 75080-3021 email: cobb@utdallas.edu phone: 972 883 2479 fax: 972 883 2349 office: ECSS 4.208 Office Hours (Fall '25), Mondays and Wednesdays 2:30-4:00 pm Resume Research Focus: Computer Networking Quality of Service in Computer Networks Most networks in use today are based on the datagram paradigm, also known as \"best effort service\". In a datagram system, the network makes no guarantees with respect to the delivery of each message. The network forwards each message from one computer to the other, but in the process the message may be dropped due to congestion or it may be delayed excessively. Currently, networks are moving toward the virtual circuit paradigm. In this paradigm, a source-destination pair may allocate resources from at each in the network path between them. With this reservation of resources, each computer in the network can schedule the forwarding of messages such that each virtual-circuit is guaranteed an average forwarding rate, a maximum packet delay, and no message loss due to congestion. Protocols that provide such forwarding rate and delay guarantees are called rate-reservation protocols. We have developed a nice and simple theory, called Flow Theory, for the analysis of message delay and buffer requirements in rate-reservation protocols and other real-time protocols. Our main research interests include further development of Flow Theory and developing new rate-reservation protocols. We are in the process of developing rate-reservation protocols that are more flexible, efficient, and fair. Our interests also include the adaptation of rate-reservation protocols for the support of particular traffic characteristics of multimedia applications such as voice and video. Mobile Computing In mobile computing, a computer is free to move from one point in the network to another. An example of this is a laptop computer that communicates with the network via a wireless interface, such as radio or infrared waves. Networking issues in mobile computing include network addressing, location management, frequency allocation, data compression, hand-off management, and security. We have developed an acknowledgment strategy for the efficient transfer of data over transport sessions that involve noisy wireless networks of mobile computers. With a small additional support from the router of the wireless network, the transport source is able to distinguish between losses due to congestion and losses due to corruption. With this distinction, the source can reduce its throughput (i.e., window size) when congestion occurs, and quickly retransmit when corruption occurs. Without this distinction, throughput over a path with a large bandwidth-delay product terminating in a noisy wireless network is reduced significantly.",
  "content_length": 3087,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:29"
}