{
  "name": "Jorge Graña Gil",
  "homepage": "https://pdi.udc.es/en/File/Pdi/WY69E",
  "status": "success",
  "content": "Jorge María Graña Gil File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Language in the Information Society Research lines No data available from Curriculum Management System at UDC. (SUXI). Contacto UDC directory Orcid id0000-0001-9952-1778 Scopus8717410400 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Automata and Formal Languages Degree in Artificial Intelligence Compulsory 0 30 Programming Language Design Degree in Computer Engineering Optional 0 42 Programming Paradigms Degree in Computer Engineering Compulsory 0 120 Theoretical Computer Science Degree in Computer Engineering Optional 0 70 Subject and involved studies Type Distance hours Total hours Automata and Formal Languages Degree in Artificial Intelligence Compulsory 0 30 Programming Language Design Degree in Computer Engineering Optional 0 56 Programming Paradigms Degree in Computer Engineering Compulsory 0 120 Theoretical Computer Science Degree in Computer Engineering Optional 0 70 Subject and involved studies Type Distance hours Total hours Programming Language Design Degree in Computer Engineering Optional 0 42 Programming Paradigms Degree in Computer Engineering Compulsory 0 120 Theoretical Computer Science Degree in Computer Engineering Optional 0 28 Subject and involved studies Type Distance hours Total hours Programming Language Design Degree in Computer Engineering Optional 0 56 Programming Paradigms Degree in Computer Engineering Compulsory 0 150 Theoretical Computer Science Degree in Computer Engineering Optional 0 81.5 Subject and involved studies Type Distance hours Total hours Programming Language Design Degree in Computer Engineering Optional 0 25.5 Programming Paradigms Degree in Computer Engineering Compulsory 0 150 Theoretical Computer Science Degree in Computer Engineering Optional 0 70 Subject and involved studies Type Distance hours Total hours Programming Language Design Degree in Computer Engineering Optional 0 44 Programming Paradigms Degree in Computer Engineering Compulsory 0 140 Theoretical Computer Science Degree in Computer Engineering Optional 0 70 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Tuesday 09:30 a 10:30 Despacho 4.14 (previa cita) 1st quarter Thursday 09:30 a 10:30 Despacho 4.14 (previa cita) 1st quarter Friday 10:30 a 12:30 Despacho 4.14 (previa cita) EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2015/2016 Web tool to help guide future students of the Galician University System Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Papers in research journals Complete books Book chapters PhD theses directed Conference papers 2024 2021 2020 2018 2015 ... 2009 2008 2007 2005 2004 2002 2001 1997 1996 1994 Funding entity Consellería de Educación, Ciencia, Universidades e Formación Profesional Main researches Margarita Alonso Ramos Type Proyecto Programas Autonomicos Dates From 01/01/2024 to 20/11/2027 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Carlos Gómez Rodríguez (IP1) / Jesús Vilares Ferro (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2027 Funding entity Ministerio de Ciencia e Innovación Main researches Carlos Gómez Rodríguez/ Jesús Vilares Ferro Type Proyecto Programas Nacionales Dates From 01/09/2021 to 31/08/2024 Funding entity Consellería de Educación e Ordenación Universitaria Main researches Alonso Ramos, Margarita Type Proyecto Programas Autonomicos Dates From 01/01/2020 to 31/12/2023 Funding entity Secretaría de Estado de Investigación, Desarrollo e Innovación (Ministerio de Economía, Industria y Competitividad-MEIC) Main researches Miguel Ángel Alonso Pardo y Carlos Gómez Rodríguez Type Proyecto Programas Nacionales Dates From 01/01/2018 to 31/12/2021 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches Carlos Gómez Rodríguez y Miguel Ángel Alonso Pardo Type Proyecto Programas Nacionales Dates From 01/01/2015 to 31/12/2018 Type Proyecto Otros Programas Dates From 01/01/2009 to 16/12/2009 Funding entity Dirección Xeral de Investigación, Desenvolvemento e Innovación Type Proyecto Otros Programas Dates From 01/01/2008 to 07/11/2008 Funding entity SECRETARÍA XERAL DE POLÍTICA LINGÜÍSTICA Type Contrato Dates From 09/08/2007 to 05/11/2009 Funding entity Plan Nacional I+D, Ministerio de Educación y Ciencia Main researches Miguel Ángel Alonso Pardo Type Proyecto Otros Programas Dates From 01/10/2007 to 31/12/2010 Funding entity Xunta de Galicia Main researches Margarita Alonso Ramos Type Proyecto Otros Programas Dates From 01/01/2007 to 26/12/2007 Funding entity TELÉMACO, INFORMACIÓN, DOCUMENTACIÓN Y SISTEMAS, S.L. Type Contrato Dates From 14/09/2005 to 14/09/2006 Funding entity Xunta de Galicia Main researches Miguel A. Alonso Pardo Type Proyecto Otros Programas Dates From 13/07/2005 to 12/07/2008 Funding entity Consellería de Educación e Ordenación Universitaria Type Contrato Dates From 01/07/2004 to 05/11/2006 Funding entity Plan Nacional de I+D Main researches Miguel Ángel Alonso Pardo Type Proyecto Otros Programas Dates From 13/12/2004 to 13/12/2007 Type Proyecto Otros Programas Dates From 06/05/2002 to 06/05/2004 Funding entity Fundación Empresa-Universidad Gallega (FEUGA) Type Contrato Dates From 01/10/2001 to 28/02/2002 Funding entity Comisión Interministerial de Ciencia y Tecnología (CICYT) Type Proyecto Otros Programas Dates From 18/01/2001 to 18/01/2004 Funding entity Secretaria Xeral de Investigación e Desenvolvemento Tecnolóxico Type Proyecto Otros Programas Dates From 20/07/2001 to 20/07/2003 Type Proyecto Otros Programas Dates From 26/06/2001 to 26/06/2003 Funding entity Dirección Xeral de Universidades Type Proyecto Otros Programas Dates From 10/07/1997 to 10/07/2000 Funding entity Consellería de Educación e Ordenación Universitaria Type Contrato Dates From 01/01/1996 to 31/12/1997 Funding entity Dirección Xeral de Universidades Type Proyecto Otros Programas Dates From 24/10/1996 to 24/10/1999 Type Proyecto Otros Programas Dates From 07/04/1994 to 07/04/1996 2022 2007 2005 2004 2003 ... 2002 2001 2000 1998 1997 Authors Manuel Vilares Ferro, Víctor M. Darriba Bilbao, Francisco J. Ribadas Pena, Jorge Graña Gil Journal Mathematics Vol. 10 Num. 19 DOI https://doi.org/10.3390/math10193526 Authors Juan Otero Pombo, Jorge Graña Gil, Manuel Vilares Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 4739 (pages 290 to 296) Authors Manuel Vilares, Juan Otero Pombo, Jorge Graña Gil Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 3317 (pages 269 to 280) Authors Manuel Vilares, Juan Otero Pombo, Jorge Graña Gil Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 3406 (pages 120 to 131) Authors Manuel Vilares, Juan Otero Pombo, Jorge Graña Gil Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 3643 (pages 131 to 139) Authors Manuel Vilares, Juan Otero, Jorge Graña Gil Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 3246 (pages 271 to 272) Authors Santiago Fernández Lanza, Jorge Graña Gil, Alejandro Sobrino Cerdeiriña Journal MATHWARE AND SOFT COMPUTING Vol. 10 Num. 2 (pages 57 to 70) Authors Jorge Graña Gil, Gloria Andrade Sánchez, Jesús Vilares Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 2608 (pages 128 to 137) Authors Miguel Ángel Alonso Pardo, Jorge Graña Gil, Jesús Vilares, Francisco Mario Barcala, Manuel Vilares Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 2527 Num. - (pages 635 to 644) Authors Jorge Graña Gil, Fco. Mario Barcala, Miguel Ángel Alonso Pardo Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 2494 Num. - (pages 135 to 148) Authors Jorge Graña Gil, Miguel Ángel Alonso Pardo, Manuel Vilares Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 2448 Num. - (pages 3 to 10) Authors Jorge Graña Gil, Fco.Mario Barcala Rodríguez, Manuel Vilares Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 2276 Num. - (pages 240 to 249) Authors Jorge Graña Gil Journal Procesamiento del Lenguaje Natural (número 69) Vol. 28 Num. - (pages 117 to 118) Authors Jorge Graña Gil, Fco.Mario Barcala Rodríguez, Oscar Sacristán Agulló Journal LECTURE NOTES IN COMPUTER SCIENCE Vol. 2004 Num. - (pages 401 to 410) Authors Jorge Graña Gil, Fco.Mario Barcala Rodríguez Journal Procesamiento del Lenguaje Natural (número 69) Vol. 27 Num. - (pages 173 to 180) Authors Jorge Graña Gil, Fco.Mario Barcala Rodríguez, Oscar Sacristán Agulló Journal Procesamiento del Lenguaje Natural (número 69) Vol. 26 Num. - (pages 125 to 132) Authors Freire-González, M., J Pinto-Tasende, Jorge Graña Gil, A. Atanes Sandoval, F Galdo Fernández Journal REVISTA CLINICA ESPANOLA Vol. 200 Num. 1 (pages 96 to 100) Authors Jorge Graña Gil, J. Sánchez Meidoso, Freire-González, M., A. Atanes Sandoval, F Galdo Fernández Journal SEMINARIOS DE LA FUNDACIÓN DE REUMATOLOGÍA Vol. 1 Num. 2 (pages 83 to 102) Authors Freire-González, M., J Pinto-Tasende, Jorge Graña Gil, A. Atanes Sandoval, Fausto Galdo Fernández Journal REVISTA CLINICA ESPANOLA Vol. 200 Num. 7 (pages 393 to 394) Authors Javier Andrade Garda, Teresa Romero Quintáns, Jorge Graña Gil Journal NOVÁTICA Num. 133 (pages 16 to 21) Authors Miguel Ángel Alonso Pardo, Jorge Graña Gil, Manuel Vilares Journal Procesamiento del Lenguaje Natural (número 69) Vol. 25 Num. - (pages 7 to 14) Authors Jorge Graña Gil, Pilar Alvariño Alvariño Journal JOURNAL OF NATURAL LANGUAGE ENGINEERING Vol. 3 Num. 4 (pages 303 to 304) 1998 Authors Manuel Vilares, Jorge Graña Gil, Alberto Valderruten Vidal Publishing Universidade da Coruña, Coruña, A (España) ISBN 84-89694-11-7 2006 Authors Alejandro Sobrino Cerdeiriña. Santiago Fernández Lanza. Jorge Graña Gil Book Soft Computing in Web Info",
  "content_length": 14164,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:34"
}