{
  "name": "Jorge Duitama",
  "homepage": "https://profesores.virtual.uniandes.edu.co/jaduitama/es/inicio",
  "status": "success",
  "content": "Jorge Alexander Duitama Castellanos Jorge Alexander Duitama Castellanos Profesor Asistente Grupo:: Research Group: TICSw-Tecnologías de Información y Construcción de Software Contacto: Oficina: Office: ML 622 Correo: Email: Extensión: Extension: 1686 Formación Investigación Publicaciones Cursos Dictados Proyectos Ingeniería de sistemas y computación, Universidad de los Andes, Colombia Magíster en ingeniería de sistemas y computación. Universidad de los Andes, Colombia Ph.D. en ciencias de computación e ingeniería, University of Connecticut, Estados Unidos Intereses y líneas de Investigación: Bioinformática Grupo:: Research Group: TICSw-Tecnologías de Información y Construcción de Software Filtrar Tipo de publicación: Todos los tipos Software Patente y Solicitud de Patente Otro Propuesta a Colciencias (o entidades afines) Evento Propuesta internacional de investigación Artículo Libro Capítulo de libro Capítulo en Memoria Caso de Estudio Otra Producción Bibliográfica Columna de Opinión Tesis A partir de: 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 Filtrar Limpiar Algoritmo de encadenamiento de coincidencias basado en entropías para el mapeo de lecturas largas Tesis 2025 .(2025). Algoritmo de encadenamiento de coincidencias basado en entropías para el mapeo de lecturas largas.Trabajo Dirigido por: Duitama J - 2025 Análisis transcriptómico de Scedosporium apiospermum y ensamblaje preliminar de Scenedesmus dimorphus como herramientas microbianas para biodegradación de fenol Tesis 2025 .(2025). Análisis transcriptómico de Scedosporium apiospermum y ensamblaje preliminar de Scenedesmus dimorphus como herramientas microbianas para biodegradación de fenol.Trabajo Dirigido por: Duitama J - 2025 Conservando el gigante del Caribe: Ensamblaje denovo del Genoma del Mero Guasa (Epinephelus itajara) y su estructura poblacional, en el PNN Corales del Rosario y de San Bernardo Tesis 2025 .(2025). Conservando el gigante del Caribe: Ensamblaje denovo del Genoma del Mero Guasa (Epinephelus itajara) y su estructura poblacional, en el PNN Corales del Rosario y de San Bernardo.Trabajo Dirigido por: Duitama J, Caballero S - 2025 Desarrollo de una herramienta computacional para la identificación de retrotransposones LTR Tesis 2025 .(2025). Desarrollo de una herramienta computacional para la identificación de retrotransposones LTR.Trabajo Dirigido por: Duitama J - 2025 Evidence of long-distance clonal spreading and low genomic diversity of Kikuyu grass from highland livestock farms after a century of intentional introduction in Colombia Artículo 2025 Cerón-souza I, Castillo-sierra J, Reyes-herrera P, Berdugo-cely J, Parra-salazar A, Lozano-arce D, Duitama J, Avellaneda Y, Jesús J. (2025) Evidence of long-distance clonal spreading and low genomic diversity of Kikuyu grass from highland livestock farms after a century of intentional introduction in Colombia. Crop Science (ISSN 0011-183X) 65 (3), pp. e70086-e70086. - 2025 Genetic diversity and comparative genomics across Leishmania (Viannia) species Artículo 2025 Gonzalez-Garcia L, Maria Paula Rodriguez, Parra-muñoz M, Clavijo A, Levy L, Ovalle-bracho C, Colorado C, Camargo C, Quiceno E, Moncada M, Muskus C, Urrea D, Baez-aguirre F, Restrepo S, Echeverry M, Duitama J. (2025) Genetic diversity and comparative genomics across Leishmania (Viannia) species. Communications Biology (ISSN 2399-3642) 8 (1), pp. 925-925. - 2025 Genomic characterization of Leishmania (V.) braziliensis associated with antimony therapeutic failure and variable in vitro tolerance to amphotericin B Artículo 2025 Gonzalez-garcia L, Rodríguez-guzmán A, Vargas-león C, Aponte S, Bonilla-valbuena L, Manuel J, Clavijo-vanegas A, Duarte-olaya G, Aguilar-buitrago C, Urrea D, Duitama J, Echeverry M. (2025) Genomic characterization of Leishmania (V.) braziliensis associated with antimony therapeutic failure and variable in vitro tolerance to amphotericin B. SCIENTIFIC REPORTS (ISSN 2045-2322) 15 (1), pp. 12973-12973. - 2025 Multispecies Coffea genus genomic-scale metabolic reconstruction: insights into caffeine metabolism Tesis 2025 .(2025). Multispecies Coffea genus genomic-scale metabolic reconstruction: insights into caffeine metabolism.Trabajo Dirigido por: Duitama J - 2025 Retraining and evaluation of machine learning and deep learning models for seizure classification from EEG data Artículo 2025 Carvajal-dossman J, Guio L, García-orjuela D, Guzmán-porras J, Garces K, Naranjo A, Maradei-anaya S, Duitama J. (2025) Retraining and evaluation of machine learning and deep learning models for seizure classification from EEG data. SCIENTIFIC REPORTS (ISSN 2045-2322) 15 (1), pp. 15345-15345. - 2025 Systematic Identification of Native Bacillus spp. as a Sustainable Approach to Mitigate Cadmium in Cocoa Artículo 2025 Gonzalez A, Fernández M, Meza J, Buitrago M, María José Chica, Duitama J. (2025) Systematic Identification of Native Bacillus spp. as a Sustainable Approach to Mitigate Cadmium in Cocoa. Food Frontiers (ISSN 2643-8429) 6 (1), pp. 2077-2080. - 2025 Visualización de redes metabólicas Tesis 2025 .(2025). Visualización de redes metabólicas.Trabajo Dirigido por: Duitama J - 2025 A graph clustering algorithm for detection and genotyping of structural variants from long reads Artículo 2024 Gaitan N, Duitama J. (2024) A graph clustering algorithm for detection and genotyping of structural variants from long reads. GigaScience (ISSN 2047-217X) 13 (1), pp. 1-1. - 2024 A phased genome assembly of a Colombian Trypanosoma cruzi TcI strain and the evolution of gene families Artículo 2024 Hoyos M, Duitama J. (2024) A phased genome assembly of a Colombian Trypanosoma cruzi TcI strain and the evolution of gene families. SCIENTIFIC REPORTS (ISSN 2045-2322) 14 (1), pp. 2054-2054. - 2024 Development of bioinformatic tools to analyze eukaryotic genomes and pangenomes Tesis 2024 .(2024). Development of bioinformatic tools to analyze eukaryotic genomes and pangenomes.Trabajo Dirigido por: Duitama J - 2024 Discovery of common cis-regulatory modules (CRMs) for stress response in rice Tesis 2024 .(2024). Discovery of common cis-regulatory modules (CRMs) for stress response in rice.Trabajo Dirigido por: Duitama J - 2024 FlavorMiner: a machine learning platform for extracting molecular flavor profiles from structural data Artículo 2024 Herrera-rocha F, Fernandez-niño M, Duitama J, Cala M, Chica M, Wessjohann L, Davari M, Gonzalez A. (2024) FlavorMiner: a machine learning platform for extracting molecular flavor profiles from structural data. Journal of Cheminformatics (ISSN 1758-2946) 16 (1), pp. 140-140. - 2024 Genetic diversity of Anadara tuberculosa in two localities of the Colombian Pacific Coast Artículo 2024 Fuentes L, Guevara-Suarez M, Zambrano M, Jimenez P, Duitama J, Restrepo S. (2024) Genetic diversity of Anadara tuberculosa in two localities of the Colombian Pacific Coast. SCIENTIFIC REPORTS (ISSN 2045-2322) 14 (1), pp. 28467-28467. - 2024 Integration of a web-based Magnetic Resonance Imaging visualization tool Tesis 2024 .(2024). Integration of a web-based Magnetic Resonance Imaging visualization tool.Trabajo Dirigido por: Duitama J, Garces K - 2024 Machine learning classification for epilepsy lesions localization based on MRIs Tesis 2024 .(2024). Machine learning classification for epilepsy lesions localization based on MRIs.Trabajo Dirigido por: Garces K, Duitama J - 2024 2016 2016-20 ALGORIT.BIOLOGIA COMPUTACIONAL ALGORITMICA Y PROGR. OBJ. I 2017 2017-10 ESTADISTICA BIOLOGIA COMPUTAC. ALGORITMICA Y PROGR. OBJ. I FUNDAM.PROG. CIENCIAS BIOLOGIC 2017-19 DISEÑO Y ANALISIS DE ALGORI. 2017-20 ALGORIT.BIOLOGIA COMPUTACIONAL DISEÑO Y ANALISIS DE ALGORI. 2018 2018-10 MATEMÁTICA ESTRUCTURAL Y LÓGIC DISEÑO Y ANALISIS DE ALGORI. FUNDAM.PROG. CIENCIAS BIOLOGIC 2018-20 DISEÑO Y ANALISIS DE ALGORI. ANALISIS DATOS GENOMICA POBLAC ALGORIT.BIOLOGIA COMPUTACIONAL 2019 2019-10 FUNDAM.PROG. CIENCIAS BIOLOGIC ALGORITMICA Y PROGR. OBJ. I DISEÑO Y ANALISIS DE ALGORI. 2019-20 DISEÑO Y ANALISIS DE ALGORI. ALGORIT.BIOLOGIA COMPUTACIONAL ALGORITMICA Y PROGR. OBJ. I 2020 2020-10 FUNDAM.PROG. CIENCIAS BIOLOGIC INTRODUCCIÓN A LA PROGRAMACIÓN DISEÑO Y ANÁLISIS DE ALGORI. 2020-20 POYECTO DE PROFUNDIZACIÓN INTRODUCCIÓN A LA PROGRAMACIÓN DISEÑO Y ANÁLISIS DE ALGORI. ALGORIT.BIOLOGIA COMPUTACIONAL 2021 2021-10 DISEÑO Y ANÁLISIS DE ALGORI. ESTADISTICA BIOLOGIA COMPUTAC. POYECTO DE PROFUNDIZACIÓN 2021-20 POYECTO DE PROFUNDIZACIÓN DISEÑO Y ANÁLISIS DE ALGORI. ALGORIT.BIOLOGIA COMPUTACIONAL 2022 2022-10 ESTADISTICA BIOLOGIA COMPUTAC. ANÁLISIS DE ALGORITMOS DISEÑO Y ANÁLISIS DE ALGORI. POYECTO DE PROFUNDIZACIÓN PROYECTO DE GRADO 2022-20 ALGORIT.BIOLOGIA COMPUTACIONAL DISEÑO Y ANÁLISIS DE ALGORI. MATEMÁTICA ESTRUCTURAL Y LÓGIC PROYECTO DE GRADO 2023 2023-10 DISEÑO Y ANÁLISIS DE ALGORI. PROYECTO DE GRADO ESTADISTICA BIOLOGIA COMPUTAC. 2023-20 ALGORIT.BIOLOGIA COMPUTACIONAL PROYECTO DE GRADO ANÁLISIS DE ALGORITMOS DISEÑO Y ANÁLISIS DE ALGORI. POYECTO DE PROFUNDIZACIÓN 2024 2024-10 DISEÑO Y ANÁLISIS DE ALGORI. POYECTO DE PROFUNDIZACIÓN PROYECTO DE GRADO ESTADISTICA BIOLOGIA COMPUTAC. 2024-20 PROYECTO DE GRADO DISEÑO Y ANÁLISIS DE ALGORI. ALGORIT.BIOLOGIA COMPUTACIONAL POYECTO DE PROFUNDIZACIÓN 2025 2025-10 PROYECTO DE GRADO ANÁLISIS DE ALGORITMOS POYECTO DE PROFUNDIZACIÓN ESTADISTICA BIOLOGIA COMPUTAC. DISEÑO Y ANÁLISIS DE ALGORI. 2025-20 PROYECTO DE GRADO ALGORIT.BIOLOGIA COMPUTACIONAL POYECTO DE PROFUNDIZACIÓN DISEÑO Y ANÁLISIS DE ALGORI.",
  "content_length": 9688,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:35"
}