{
  "name": "Jorge Villalobos",
  "homepage": "https://profesores.virtual.uniandes.edu.co/jvillalo/es/inicio",
  "status": "success",
  "content": "Jorge Villalobos Salcedo Jorge Villalobos Salcedo Profesor Titular Grupo:: Research Group: TICSw-Tecnologías de Información y Construcción de Software Contacto: Oficina: Office: ML 774 Correo: Email: Extensión: Extension: 3052 Formación Experiencia Académica Investigación Publicaciones Cursos Dictados Hoja de Vida Postdoctorado Laboratorio LSR - Grenoble (Francia) Ph.D. en Informática, Universidad Joseph Fourier de Grenoble, Francia D.E.A. en Informática, Institut National Polytechnique de Grenoble, Francia Ingeniero de Sistemas y Computación, Universidad de los Andes, Colombia Universidad de los Andes (Bogotá, Colombia) | Departamento de Ingeniería de Sistemas y Computación | Profesor titular Coordinador de la Maestría en Arquitecturas de Tecnologías de Información (2018-actual) Coordinador de la Maestría en Tecnologías de Información para el Negocio (2015-2018) Director del Departamento de Ingeniería de Sistemas y Computación (2009-2013) Director del Departamento de Ingeniería de Sistemas y Computación (1996-1999) Coordinador de la Especialización en Construcción de Software (2000, 2009-2018) Coordinador de Pregrado (1987-1989) Profesor del Programa de Ingeniería de Sistemas y Computación Profesor de la Maestría en Ingeniería de Sistemas y Computación Profesor de la Maestría en Arquitecturas de TI Profesor de la Maestría en Tecnologías de Información para el Negocio Profesor del Programa de Doctorado Profesor de la Especialización en Construcción de Software – ECOS Profesor de la Especialización en Software para Redes – ESORED Profesor de la Especialización en Automatización Industrial Profesor del Programa en Gerencia Estratégica en Informática – GEI Profesor de la Especializacion en Sistemas de Información en la Organización – ESIO Profesor del Programa de Educación Continuada y Corporativa Universidad Joseph Fourier de Grenoble (Francia) | Laboratorio LSR –Logiciels, Systemes et Reseaux | Ingeniero de investigación Universidad Politécnica de Cataluña (Barcelona, España) | Instituto de Cibernética | Grupo de Investigación en Robótica | Investigador visitante Intereses y líneas de Investigación: Arquitectura de Negocio de TI Análisis y diseño de Software Arquitectura Empresarial Arquitectura de Procesos de Negocio Arquitecturas orientadas a servicios Arquitectura de software Grupo:: Research Group: TICSw-Tecnologías de Información y Construcción de Software Filtrar Tipo de publicación: Todos los tipos Software Patente y Solicitud de Patente Otro Propuesta a Colciencias (o entidades afines) Evento Propuesta internacional de investigación Artículo Libro Capítulo de libro Capítulo en Memoria Caso de Estudio Otra Producción Bibliográfica Columna de Opinión Tesis A partir de: 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 Filtrar Limpiar Arquitectura de negocio del ecosistema de pagos digitales Tesis 2025 .(2025). Arquitectura de negocio del ecosistema de pagos digitales.Trabajo Dirigido por: Villalobos J, Romero M.C. - 2025 Extensión y optimización de la plataforma Archiness: desarrollo de módulos gráficos y mejora funcional para la enseñanza académica Tesis 2025 .(2025). Extensión y optimización de la plataforma Archiness: desarrollo de módulos gráficos y mejora funcional para la enseñanza académica.Trabajo Dirigido por: Villalobos J - 2025 Archiness: una herramienta de apoyo para arquitectos de negocio Tesis 2024 .(2024). Archiness: una herramienta de apoyo para arquitectos de negocio.Trabajo Dirigido por: Villalobos J - 2024 Driving Innovation in Industry 4.0 Through Business Model Simulation Artículo 2024 Velandia P, Herrera A, Bonilla M, Sanchez M, Villalobos J. (2024) Driving Innovation in Industry 4.0 Through Business Model Simulation. Lecture Notes in Business Information Processing (ISSN 1865-1348) 498 (N/A), pp. 1-16. - 2024 Facilitating Business Model Transformation: Theory, Operators, and Patterns Artículo 2024 Velandia P, Herrera A, Sanchez M, Villalobos J. (2024) Facilitating Business Model Transformation: Theory, Operators, and Patterns. Journal of Open Innovation: Technology, Market, and Complexity (ISSN 21998531) N/A (N/A), pp. 1-23. - 2024 ArchiReport: Una herramienta para el manejo de los artefactos de una arquitectura de negocio Tesis 2023 .(2023). ArchiReport: Una herramienta para el manejo de los artefactos de una arquitectura de negocio.Trabajo Dirigido por: Villalobos J - 2023 Archiness: Un editor de modelos de negocio Tesis 2023 .(2023). Archiness: Un editor de modelos de negocio.Trabajo Dirigido por: Villalobos J - 2023 Extensión del caso Mr. George para la clase de Arquitectura Empresarial Tesis 2023 .(2023). Extensión del caso Mr. George para la clase de Arquitectura Empresarial.Trabajo Dirigido por: Villalobos J - 2023 Herramienta de aprendizaje para la asignatura de Arquitectura Empresarial (ISIS4203) Tesis 2023 .(2023). Herramienta de aprendizaje para la asignatura de Arquitectura Empresarial (ISIS4203).Trabajo Dirigido por: Romero M.C., Villalobos J - 2023 Aspectos dinámicos en patrones de modelos de negocio Tesis 2022 .(2022). Aspectos dinámicos en patrones de modelos de negocio.Trabajo Dirigido por: Villalobos J - 2022 Catálogo de estrategias empresariales Tesis 2022 .(2022). Catálogo de estrategias empresariales.Trabajo Dirigido por: Villalobos J - 2022 Deliverable Automation Tool (DAT) Tesis 2022 .(2022). Deliverable Automation Tool (DAT).Trabajo Dirigido por: Villalobos J - 2022 Simulando modelos de negocio Tesis 2022 .(2022). Simulando modelos de negocio.Trabajo Dirigido por: Villalobos J - 2022 Understanding supply chain resilience through conceptual modelling techniques Artículo 2022 Herrera A, Velandia P, Sanchez M, Villalobos J. (2022) Understanding supply chain resilience through conceptual modelling techniques. Journal of Modelling in Management (ISSN 1746-5664) 18 (6), pp. 1858-1878. - 2022 Alineación del customer journey map con el modelo de negocio Tesis 2021 .(2021). Alineación del customer journey map con el modelo de negocio.Trabajo Dirigido por: Villalobos J - 2021 Analyzing Imperfection in Enterprise Models Artículo 2021 Florez H, Sanchez M, Villalobos J. (2021) Analyzing Imperfection in Enterprise Models. Engineering Letters (ISSN 1816-093X) 29 (1), pp. 261-277. - 2021 Enterprise Modeling: A Multi-Perspective Tool-Supported Approach Artículo 2021 Lara P, Sanchez M, Villalobos J. (2021) Enterprise Modeling: A Multi-Perspective Tool-Supported Approach. Communications in Computer and Information Science (ISSN 1865-0929) 1455 (1), pp. 1-15. - 2021 Evolution of the Business Model: Arriving at Open Business Model Dynamics Artículo 2021 Romero M.C., Lara P, Villalobos J. (2021) Evolution of the Business Model: Arriving at Open Business Model Dynamics. Journal of Open Innovation: Technology, Market, and Complexity (ISSN 21998531) 7 (1), pp. 1-32. - 2021 Herramientas de meta modelado en arquitectura empresarial : notación gráfica y métodos de análisis Tesis 2021 .(2021). Herramientas de meta modelado en arquitectura empresarial : notación gráfica y métodos de análisis.Trabajo Dirigido por: Villalobos J, Lara P - 2021 Herramientas para apoyar arquitectos de negocio Tesis 2021 .(2021). Herramientas para apoyar arquitectos de negocio.Trabajo Dirigido por: Villalobos J - 2021 2015 2015-10 ARQUITECTURA DE NEGOCIO & TI ARQUITECTURA EMPRESARIAL PROYECTO 1 ARQUITECT.EMPRESAR.Y DE INTEGR PROYECTO 3 2015-20 PROYECTO FINAL ARQUITECTURA DE NEGOCIO & TI ANALISIS Y DISEÑO SOFTWARE PROYECTO 3 ARQUITECTURA EMPRESARIAL 2016 2016-10 ANALISIS Y DISEÑO SOFTWARE PROYECTO 1 ARQUITECTURA DE NEGOCIO & TI PROYECTO FINAL ARQUITECTURA EMPRESARIAL 2016-20 PROYECTO 3 ARQUITECTURA EMPRESARIAL ANALISIS Y DISEÑO SOFTWARE PROYECTO FINAL ARQUITECTURA DE NEGOCIO & TI ARQUITECT.EMPRESAR.Y DE INTEGR 2017 2017-10 ARQUITECTURA EMPRESARIAL PROYECTO DE EMPRENDIMIENTO PROYECTO FINAL ANALISIS Y DISEÑO SOFTWARE ARQUITECTURA DE NEGOCIO Y TI 2017-20 PROYECTO DE EMPRENDIMIENTO PROYECTO FINAL ARQUITECTURA DE NEGOCIO Y TI ARQUITECTURA EMPRESARIAL 2018 2018-10 PROYECTO DE EMPRENDIMIENTO ARQUITECTURA DE NEGOCIO Y TI ARQUITECTURA EMPRESARIAL NUEVAS TIC NEGOCIOS DIGITALES PROYECTO FINAL 2018-20 ARQUITECTURA EMPRESARIAL PROYECTO FINAL ARQUITECTURA DE NEGOCIO Y TI 2019 2019-10 ARQUITECTURA EMPRESARIAL ARQUITECTURA DE NEGOCIO Y TI PROYECTO FINAL 2019-20 ARQUITECTURA DE NEGOCIO Y TI ARQUITECTURA EMPRESARIAL 2020 2020-10 ARQUITECTURA EMPRESARIAL ARQUITECTURA DE NEGOCIO Y TI 2020-20 FRAMEWORKS Y LENGUAJES ARQUITECTURA DE NEGOCIO Y TI ARQUITECTURA EMPRESARIAL 2021 2021-10 ARQUITECTURA EMPRESARIAL ARQUITECTURA DE NEGOCIO Y TI FRAMEWORKS Y LENGUAJES 2021-20 ARQUITECTURA DE NEGOCIO Y TI ARQUITECTURA EMPRESARIAL 2022 2022-10 ARQUITECTURA EMPRESARIAL PROYECTO DE GRADO ARQUITECTURA DE NEGOCIO Y TI 2022-20 PROYECTO DE GRADO ARQUITECTURA EMPRESARIAL ARQUITECTURA DE NEGOCIO Y TI 2023 2023-10 ARQUITECTURA DE NEGOCIO Y TI ARQUITECTURA EMPRESARIAL PROYECTO DE GRADO 2023-20 ARQUITECTURA NEGOCIO Y TI (BC) ARQUITECTURA EMPRESARIAL ARQUITECTURA DE NEGOCIO Y TI 2024 2024-10 ARQUITECTURA DE NEGOCIO Y TI ARQUITECTURA EMPRESARIAL PROYECTO DE GRADO 2024-20 ARQUITECTURA EMPRESARIAL ARQUITECTURA DE NEGOCIO Y TI PROYECTO DE GRADO 2025 2025-10 ARQUITECTURA EMPRESARIAL ARQUITECTURA DE NEGOCIO Y TI PROYECTO DE GRADO 2025-12 ARQUITECTURA DE NEGOCIO 2025-20 PROYECTO DE GRADO ARQUITECTURA DE NEGOCIO Y TI ARQUITECTURA EMPRESARIAL Education Degree Discipline Institution Year Ph.D Informatics Université Joseph Fourier de Grenoble 2003 M.Sc Informatics Institut National Polytechnique de Grenoble 1986 B.Sc Systems and Computing Engineering Universidad de los Andes 1983 Academic experience Institution Rank Tittle (chair, coordinator, etc.) When (ex. 1995-1997) Full time or part-time Universidad de los Andes — Department Head 2009 ",
  "content_length": 12679,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:40"
}