{
  "name": "Joseph Seering",
  "homepage": "https://joseph.seering.org",
  "status": "success",
  "content": "Joseph Seering's Webpage Home Publications Contact Assistant Professor (조교수) KAIST School of Computing CV Joseph Seering Joseph Seering is an assistant professor in the School of Computing at KAIST, where he leads the Collaborative Social Technologies Lab. His work focuses on understanding the social and organizational dynamics of conflict and coordination on online social platforms in order to drive the development of new forms of social tools. He has received awards for his papers at the ACM CHI, CSCW, and CHI PLAY conferences, and was named one of the CCC/CRA Computing Innovation Fellows of 2021. He is also an affiliated fellow at the Yale University Social Media Governance Initiative and a member of the Trust and Safety Professionals Association. Joseph received his Ph.D. from the Human-Computer Interaction Institute at Carnegie Mellon University and was a postdoctoral researcher in the Computer Science Department at Stanford University and a fellow at the Stanford Human-Centered AI Institute. He has received awards for his papers at the ACM CHI, CSCW, and CHI PLAY conferences, and was named one of the CCC/CRA Computing Innovation Fellows of 2021. Announcements Instructions for applying - International MS, MS/PhD, and PhD applicants I am frequently contacted by students outside Korea inquiring about whether I will be accepting MS, MS/PhD, or PhD students for an upcoming cycle. It is difficult to respond to all of these inquiries due to the volume I receive. In order to ensure your email receives consideration, please make sure to include the following: A resume or CV showing your relevant background, including university, major, GPA, employment experience (if any), and research experience (if any). A summary of your interests and the direction you hope to pursue in graduate school. An explanation of how your interests align with the work that my lab does. The best way to do this is probably to look at one or two papers published from my lab in the past year and write a few sentences about how you would build on or improve a core concept from one of those papers. An email subject line formatted as \"[Prospective Student] Name - Desired Degree - Semester\" (e.g., \"[Prospective Student] Firstname Lastname - MS program - Fall 2030\") Please note that I prioritize applicants who demonstrate that they have read some of my recent work. Due to time constraints, I may not respond to inquiries that do not follow the above format. Call for Applications – Undergraduate Research Assistants, Winter 2026 The Collaborative Social Technologies Lab is recruiting undergraduate interns for Winter 2026. Projects seeking interns are listed in this document. Research assistant positions are full-time positions, and the positions are paid accordingly. Interns are expected to work in-person at KAIST for the full internship. Remote internships are not currently possible. Compensation for this position is 800,000 KRW per month for a total of two months. Please note that all lab business is currently handled in English, so applicants should be prepared to communicate in English for all research-related activities. The deadline for applications is 11:59PM KST on November 3rd, 2025 (Monday). In order to apply, please fill out this form in English. Application review will begin immediately once the deadline has passed, and candidates who will be interviewed will be contacted within the following week.",
  "content_length": 3434,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:11"
}