{
  "name": "Joseph K. Liu",
  "homepage": "https://research.monash.edu/en/persons/joseph-liu",
  "status": "success",
  "content": "Joseph Liu - Monash University Joseph Liu public CV View Scopus Profile Joseph Liu Professor Professor, Department of Software Systems & CybersecurityImpact Labs https://orcid.org/0000-0001-6656-6240 EmailJoseph.Liumonashedu 20012026 Research activity per year Personal profile BiographyJoseph (Kai Sui) Liu is a Full Professor in the Faculty of Information Technology, Monash University. He got his PhD from the Chinese University of Hong Kong at 2004. His research areas include cyber security, blockchain and applied cryptography. He has received more than 10000 citations and with more than 200 publications in top venues such as CRYPTO, ACM CCS, NDSS, INFOCOM. He is currently the lead of the Monash Cybersecurity Discipline Group. He has established the Monash Blockchain Technology Centre at 2019 and serve as the founding director. His remarkable research in linkable ring signature forms the theory basis of Monero (XMR), one of the largest cryptocurrencies in the world with current market capitalization more than US$2 billion. He also served as the Course Director of the re-branded Master of Cybersecurity, from 2020 to 2022. He has been given the prestigious ICT Researcher of the Year 2018 Award by the Australian Computer Society (ACS),  the largest professional body in Australia representing the ICT sector, for his contribution to the blockchain and cyber security community. He is currently the Co-Chair of the IEEE Blockchain Australia / New Zealand chapter. He has won the IEEE Technical Achievement Award in 2021 given by the Technology and Engineering Management Society for his achievement in the blockchain domain. He is leading the Algorand Centre of Excellence on Sustainability Informatics for the Pacific , sharing US$50M with the other 9 winners in the world. Related Links: For more details, please visit Joseph's personal website: http://users.monash.edu.au/~kailiu/Google scholar page: https://scholar.google.com/citations?hl=en&user=GGe9ON8AAAAJResearch interestsMy research mainly focuses on cyber security and applying various cryptographic technologies into real world systems. They include, but are not limited to: Cloud Security: cloud data protection, privacy in cloud, cloud access controlElectronic Healthcare System Security: security and privacyBlockchain: security, privacy-preserving featuresLightweight Security: cryptographic algorithms for lightweight device (e.g. sensors, RFID etc.)Applied Cryptography: public key cryptography, identity-based cryptography, digital signature, attribute-based system, anonymous signature (e.g. group signature, ring signature) etc.Monash teaching commitmentDr Joseph Liu has experience as the Lecturer for the following units in the Faculty of IT: FIT2034 Computer programming 2FIT5043 Distributed and big data processingFIT5148 Distributed and big data processingCommunity serviceInternational Standardization Project Editor: International Standardization ISO/IEC JTC 1/SC 27 18033-5 Information technology -- Security techniques -- Encryption algorithms -- Part 5: Identity-based ciphersProgram Chair: ProvSec 2014, Pairing 2015, Cryptographic Track of EIDWT 2013, ProvSec 2007 (the founder of ProvSec), Applied Cryptography and Information Security (ACIS) 2006, ACISP 2016Program Committee: CANS 2010, IWSEC 2010, IEEE TrustCom 2011, IWSEC 2011, ICICS 2012, ProvSec 2012, Inscrypt 2012, IEEE CloudCom 2012, IEEE TrustCom 2012, IEEE INCoS 2013, ProvSec 2013, IEEE TrustCom 2013, ISPEC 2014, NSS 2014, TrustCom 2015, SSR 2015, SocialSec 2015, ProvSec 2015, LSNS 2015, ISPEC 2015, ICPADS 2015, CPSS 2015Editor: Guest Co-editors of Special Issue on 'Security and Privacy in Mobile Clouds' of Pervasive and Mobile Computing (PMC); Guest Co-editors of Special Issue on 'Provably Secure Cryptographic Solutions for Wireless Networks' of Security and Communication Networks (SCN); Guest Co-editors of Special Issue on 'Next-Generation Trustworthy Applications of Distributed Sensor Networks' of International Journal of Distributed Sensor Networks. Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationInformation Engineering, Doctor of Philosophy, Chinese University of Hong KongAward Date: 30 Jul 2004Information Engineering, Master of Philosophy, Chinese University of Hong KongAward Date: 31 Aug 2001Information Engineering, Bachelor of Engineering, Chinese University of Hong KongAward Date: 31 Aug 1999 Research area keywordscyber securityprivacy enhanced technologyapplied cryptography Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2016 2018 2024 2027 3 Not started 6 Active 15 Finished Projects per year Signature: Efficient Weighted Threshold SignatureCui, S. (Primary Chief Investigator (PCI)), Liu, J. (Chief Investigator (CI)) & Yuen, J. (Chief Investigator (CI))22/09/25 → 21/09/26Project: Research Ethical framework: Developing an Ethical Framework for using Blockchain-based Digital Credential Systems: Tackling the issue of Fake DegreesWhitty, M. (Primary Chief Investigator (PCI)), Cui, H. (Chief Investigator (CI)), Srivastava, A. (Chief Investigator (CI)), Liu, J. (Chief Investigator (CI)), Kumar Sinha, M. (Partner Investigator (PI)) & Young, G. (Chief Investigator (CI))Department of Foreign Affairs and Trade (DFAT) (Australia)1/11/24 → 31/10/26Project: Research More Efficient: More Efficient and Scalable Post-Quantum Multi-SignaturesEsgin, M. (Primary Chief Investigator (PCI)), Steinfeld, R. (Chief Investigator (CI)), Yuen, J. (Chief Investigator (CI)) & Liu, J. (Chief Investigator (CI))1/08/24 → 31/12/25Project: Research Æinstein: Adversarial AI amongst Materials Discovery DomainsPhan, R. (Primary Chief Investigator (PCI)), Pal, A. (Chief Investigator (CI)), Rajanala, S. (Chief Investigator (CI)), Ting, C.-M. (Chief Investigator (CI)), Krishnasamy, G. (Chief Investigator (CI)), Noman, F. (Chief Investigator (CI)), Shu Min, L. (Chief Investigator (CI)), Liu, J. (Chief Investigator (CI)), Rudolph, C. (Chief Investigator (CI)), Steinfeld, R. (Chief Investigator (CI)), Siang Piao, C. (Chief Investigator (CI)), Tumian, A. (Partner Investigator (PI)) & Nik Hashim, N. N. W. (Partner Investigator (PI))1/06/24 → 31/05/26Project: Research Scalable & Accountable Privacy-Preserving Blockchain with Enhanced SecurityLiu, J. (Primary Chief Investigator (PCI)), Steinfeld, R. (Chief Investigator (CI)) & Yu, J. (Chief Investigator (CI))25/05/23 → 24/05/26Project: Research View all 24 projects Research output Research output per year 2001 2015 2016 2017 2018 2019 2021 2022 2025 151 Conference Paper 88 Article 5 Editorial 4 Chapter (Book) 7 More 4 Foreword / Postscript 2 Comment / Debate 1 Review Article Research output per year Research output per year Performance analysis of a blockchain-based messaging system implementation for air cargo supply chainsLau, C. W., Liu, J., Ma, X. & Talluri, S., 2025, In: International Journal of Production Research. 63, 14, p. 5428-5451 24 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 3 Citations (Scopus) Searchable Encryption for Conjunctive Queries with Extended Forward and Backward PrivacyZuo, C., Lai, S., Sun, S., Yuan, X., Liu, J. K., Shao, J., Wang, H., Zhu, L. & Cui, S., 2025, Proceedings on Privacy Enhancing Technologies Symposium 2025. Jansen, R. & Shafiq, Z. (eds.). 1 ed. Rochester NY USA: Privacy Enhancing Technologies, Vol. 2025. 16 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile Blockchain-based messaging and information sharing systems for air cargo supply chainsLau, C. W., Liu, J. & Ma, X., 4 Jun 2024, In: IEEE Transactions on Engineering Management. 71, p. 9019-9034 16 p.Research output: Contribution to journal › Article › Research › peer-review Detect Llama - Finding Vulnerabilities in Smart Contracts Using Large Language ModelsInce, P., Luo, X., Yu, J., Liu, J. K. & Du, X., 2024, Information Security and Privacy - 29th Australasian Conference, ACISP 2024 Sydney, NSW, Australia, July 15–17, 2024 Proceedings, Part III. Zhu, T. & Li, Y. (eds.). Singapore Singapore: Springer, p. 424-443 20 p. (Lecture Notes in Computer Science; vol. 14897).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research 12 Citations (Scopus) DualRing-PRF: Post-quantum (Linkable) Ring Signatures from Legendre and Power Residue PRFsZhang, X., Steinfeld, R., Liu, J. K., Esgin, M. F., Liu, D. & Ruj, S., 2024, Information Security and Privacy - 29th Australasian Conference, ACISP 2024 Sydney, NSW, Australia, July 15–17, 2024 Proceedings, Part II. Zhu, T. & Li, Y. (eds.). Singapore Singapore: Springer, p. 124-143 20 p. (Lecture Notes in Computer Science; vol. 14896).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review 3 Citations (Scopus) View all 255 research outputs Prizes Best paper awardFu, S. (Recipient), Yu, J. (Recipient), Baiao Dowsley, R. (Recipient) & Liu, J. (Recipient), 2021Prize: Prize (including medals and awards) Best paper awardLi, Z. (Recipient), Liu, J. (Recipient), Yu, J. (Recipient) & Gasevic, D. (Recipient), Sept 2022Prize: Prize (including medals and awards) Best paper awardLi, Z. (Recipient), Liu, J. (Recipient), Yu, J. (Recipient), Gasevic, D. (Recipient) & Yang, W. (Recipient), Dec 2022Prize: Prize (including medals and awards) Activities Activities per year 2016 2016 2021 2021 1 External resear",
  "content_length": 10558,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:05"
}