{
  "name": "Joseph J. Lim",
  "homepage": "https://www.clvrai.com",
  "status": "success",
  "content": "CLVR Welcome to the CLVR lab! We are the Cognitive Learning for Vision and Robotics (CLVR, pronounced as clever) lab at Korea Advanced Institute of Science and Technology (KAIST), in Seoul, led by Joseph J. Lim (임재환). Our goal is to develop intelligent systems that make sequential decisions, in the world, through perception, action, and reasoning. The research topics include reinforcement learning, robot learning, world model with representation learning, visual perception, and symbolic manipulation. Recent News (more) [Award] SAVO won the Outstanding Paper Award on Empirical Reinforcement Learning Research at RLC! (2025) [Paper] One paper is accepted to CoRL! (2025) [Paper] One paper is accepted to RLC! (2025) [Paper] Two papers are accepted to ICLR! (2025) [Paper] Journal extension of FurnitureBench is published in IJRR! (2025) [Conf] Joseph will be organizing CoRL 2025 as a program chair! [PhD Defense] Ayush Jain successfully defended his PhD thesis! (2024) [Paper] One paper is accepted to CoRL! (2024) [Paper] One paper is accepted to RSS! (2024) [Award] Open X-Embodiment won the Best Conference Paper Award at ICRA! (2024) [Paper] Two papers are accepted to ICRA! (2024) Research Topics (more) Cognitive Model (e.g., Domain/Action Generalization) Robot Learning (e.g., Complex Long-Horizon Manipulation) Reinforcement Learning (e.g., Skill-based Reinforcement Learning) Logical Reasoning (e.g., Physics Understanding) Symbolic Manipulation (e.g., Neural Program Synthesis) Computer Vision (e.g., Learning from Videos) News 2025 [Award] SAVO won the Outstanding Paper Award on Empirical Reinforcement Learning Research at RLC! [Paper] One paper is accepted to CoRL! [Paper] One paper is accepted to RLC! [Paper] Two papers are accepted to ICLR! [Paper] Journal extension of FurnitureBench is published in IJRR! 2024 [Conf] Joseph will be organizing Conference on Robot Learning (CoRL) 2025 as a program chair. [Talk] Richard Zhang (Adobe Research) gave a talk as part of the CLVR Speaker Series (11/25). [PhD Defense] Ayush Jain successfully defended his PhD thesis! [Paper] Journal extension of FurnitureBench is accepted to IJRR! [Paper] One paper is accepted to CoRL! [Paper] One paper is accepted to RSS! [Award] Open X-Embodiment: Robotic Learning Datasets and RT-X Models won the Best Conference Paper Award at ICRA! [Talk] Xiaolong Wang (UC San Diego) gave a talk as part of the CLVR Speaker Series (05/02). [Talk] Karl Pertsch (UC Berkeley & Stanford) gave a talk as part of the CLVR Speaker Series (04/12). [Talk] Edward Hu (UPenn) gave a talk as part of the CLVR Speaker Series (03/24). [Paper] Two papers are accepted to ICRA! 2023 [Workshop] The CLVR 2023 workshop has been successfully held! [Award] FurnitureBench won the Best System Paper Award at RSS! [Paper] Two papers are accepted to RSS! [PhD Defense] Karl Pertsch successfully defended his PhD thesis! 2022 [Talk] Joseph J. Lim gives a talk at CoRL! [Paper] Two papers are accepted to CoRL! [Paper] Three papers are accepted to ICLR! [PhD Defense] Youngwoon Lee successfully defended his PhD thesis! [PhD Defense] Shao-Hua Sun successfully defended his PhD thesis! 2021 [Paper] Two papers are accepted to NeurIPS! [Paper] Three papers are accepted to CoRL! [Paper] Our paper on policy transfer across visual and dynamics gaps is accepted to RSS! [Paper] One paper is accepted to ICML! [Paper] Our IKEA Furniture Assembly Environment is accepted to ICRA! 2020 [Award] SPiRL is selected as a Plenary Talk and won the Best Paper Presentation Award at CoRL! [Paper] Two papers are accepted to CoRL! [Paper] Paper on generalization to new actions is accepted to ICML! [Paper] Two papers are accepted to ICLR! [Release] We released IKEA Furniture Assembly Environment for a complex robot manipulation benchmark. 2019 [Paper] Our paper on imitation learning from observation is accepted to CoRL! [Paper] Our paper on multimodal meta-learning is accepted to NeurIPS! [Talk] Deepak Pathak (UC Berkeley) gave a talk as part of the CLVR Speaker Series. [Paper] Paper on complex skill composition accepted to ICLR 2019! [Talk] Kuan Fang (Stanford) gave a talk as part of the CLVR Speaker Series. [Talk] Tianmin Shu (UCLA) gave a talk as part of the CLVR Speaker Series. [Talk] Yuke Zhu (Stanford) gave a talk as part of the CLVR Speaker Series. [Talk] Andrew Owens (UC Berkeley) gave a talk as part of the CLVR Speaker Series. 2018 [Paper] Paper on novel-view synthesis accepted to ECCV! [Paper] Paper on neural program synthesis accepted to ICML! [Talk] Jiajun Wu (MIT) gave a talk as part of the CLVR Speaker Series. [Paper] Paper on object affordance reasoning accepted to CVPR! [Talk] Carl Vondrick (Google) gave a talk as part of the CLVR Speaker Series. [Paper] Paper on agents that disentangle environment and task accepted to ICLR! [Talk] Jimmy Ba (UToronto) gave a talk as part of the CLVR Speaker Series. [Talk] Phillip Isola (OpenAI) gave a talk as part of the CLVR Speaker Series. 2017 [Paper] Paper on multi-modal imitation learning accepted to NIPS!",
  "content_length": 5048,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:05"
}