{
  "name": "Joseph Jaeger",
  "homepage": "https://faculty.cc.gatech.edu/~josephjaeger",
  "status": "success",
  "content": "Joseph Jaeger Joseph Jaeger Assistant Professor School of Cybersecurity and Privacy Georgia Institute of Technology josephjaeger@gatech.edu He/him Research: I work on cryptography, which lies at the intersection of computer security and theoretical computer science. Commonly my research aims to apply the proof-based techniques of theory to better understand or improve the security of real-world protocols. This includes extrapolating formal models to capture novel threats, developing new tools to give precise security analyses within these models, and designing new protocols. Short bio: Before coming to Georgia Tech, I was a postdoctoral scholar with Stefano Tessaro at the University of Washington. I obtained my PhD in Computer Science at the University of California, San Diego under the guidance of Mihir Bellare. I earned a bachelor's in Computer Science and Mathematics at Rutgers University where David Cash introduced me to the fascinating worlds of cryptography and academic research. Students: I have the pleasure of working with these great PhD students. Kaishuo Cheng Akshaya Kumar Deep Inder Mohan Roy Stracovsky Other Links: Google Scholar DBLP ORCID Publications Nonadaptive One-Way to Hiding Implies Adaptive Quantum Reprogramming Joseph Jaeger Asiacrypt 2025 [eprint] [arXiv] Adaptive Security for Constrained PRFs Kaishuo Cheng, Joseph Jaeger Crypto 2025 [eprint] [doi] Analyzing Group Chat Encryption in MLS, Session, Signal, and Matrix Joseph Jaeger, Akshaya Kumar Eurocrypt 2025 [eprint] [doi] Dictators? Friends? Forgers. Breaking and Fixing Unforgeability Definitions for Anamorphic Signature Schemes Roy Stracovsky, Joseph Jaeger Asiacrypt 2024 [eprint] [doi] Generic and Algebraic Computation Models: When AGM Proofs Transfer to the GGM Joseph Jaeger, Deep Inder Mohan Crypto 2024 [eprint] [doi] Symmetric Signcryption and E2EE Group Messaging in Keybase Joseph Jaeger, Akshaya Kumar, Igors Stepanovs Eurocrypt 2024 [eprint] [doi] Let Attackers Program Ideal Models: Modularity and Composability for Adaptive Compromise Joseph Jaeger Eurocrypt 2023 [eprint] [doi] Memory-Tight Multi-Challenge Security of Public-Key Encryption Joseph Jaeger, Akshaya Kumar Asiacrypt 2022 [eprint] [doi] Hiding in Plain Sight: Memory-tight Proofs via Randomness Programming Ashrujit Ghoshal, Riddhi Ghosal, Joseph Jaeger, Stefano Tessaro Eurocrypt 2022 [eprint] [doi] Quantum Key-length Extension Joseph Jaeger, Fang Song, Stefano Tessaro TCC 2021 [eprint] [arXiv] [doi] Expected-Time Cryptography: Generic Techniques and Applications to Concrete Soundness Joseph Jaeger, Stefano Tessaro TCC 2020 [eprint] [doi] Handling Adaptive Compromise for Practical Encryption Schemes Joseph Jaeger, Nirvan Tyagi Crypto 2020 Best Paper by Early Career Researchers [eprint] [doi] The Memory-Tightness of Authenticated Encryption Ashrujit Ghoshal, Joseph Jaeger, Stefano Tessaro Crypto 2020 [eprint] [doi] Pact: Privacy Sensitive Protocols and Mechanisms for Mobile Contact Tracing Justin Chan, Landon Cox, Dean Foster, Shyam Gollakota, Eric Horvitz, Joseph Jaeger, Sham Kakade, Tadayoshi Kohno, John Langford, Jonathan Larson, Puneet Sharma, Sudheesh Singanamalla, Jacob Sunshine, Stefano Tessaro IEEE Data Engineering Bulletin June 2020 [arXiv] [bulletin] Tight Time-Memory Trade-offs for Symmetric Encryption Joseph Jaeger, Stefano Tessaro Eurocrypt 2019 [eprint] [doi] Optimal Channel Security Against Fine-Grained State Compromise: The Safety of Messaging Joseph Jaeger, Igors Stepanovs Crypto 2018 [eprint] [doi] Better Than Advertised: Improved Security Guarantees for MD-Based Hash Functions Mihir Bellare, Joseph Jaeger, Julia Len CCS 2017 [eprint] [doi] Ratcheted Encryption and Key Exchange: The Security of Messaging Mihir Bellare, Asha Camper Singh, Joseph Jaeger, Maya Nyayapati, Igors Stepanovs Crypto 2017 [eprint] [doi] Honey Encryption Beyond Message Recovery Security Joseph Jaeger, Thomas Ristenpart, Qiang Tang Eurocrypt 2016 [eprint] [doi] Mass-surveillance without the State: Strongly Undetectable Algorithm-Substitution Attacks Mihir Bellare, Joseph Jaeger, Daniel Kane CCS 2015 [eprint] [doi] Dynamic Searchable Encryption in Very-Large Databases: Data Structures and Implementation David Cash, Joseph Jaeger, Stanislaw Jarecki, Charanjit Jutla, Hugo Krawczyk, Marcel-Cătălin Roşu, Michael Steiner NDSS 2014 [eprint] [doi] Interests I like to juggle.",
  "content_length": 4376,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:06"
}