{
  "name": "Joseph O'Hagan",
  "homepage": "https://www.gla.ac.uk/schools/computing/staff/josephohagan",
  "status": "success",
  "content": "University of Glasgow - Schools - School of Computing Science - Our staff - Joseph O'Hagan Skip to main content The University of Glasgow uses cookies for analytics. Find out more about our Privacy policy. privacy settings accept We use cookies Necessary cookies Necessary cookies enable core functionality. The website cannot function properly without these cookies, and can only be disabled by changing your browser preferences. Analytics cookies Analytical cookies help us improve our website. We use Google Analytics. All data is anonymised. Switch analytics ON OFF Clarity Clarity helps us to understand our users’ behaviour by visually representing their clicks, taps and scrolling. All data is anonymised. Switch clarity ON OFF Privacy policy close Study Research Explore Connect School of Computing Science Our staffJoseph O'HaganMr Ethan KellyZhen Tian Mr Joseph O'Hagan Research Associate (School of Computing Science) email: Joseph.OHagan@glasgow.ac.uk Import to contacts Biography I'm a junior research assistant in Extended Reality (XR) and Human Computer Interaction (HCI) in the School of Computing Science. I did my PhD in Human-Computer Interaction at the University of Glasgow, under the supervision of Dr Julie R Williamson and Dr Mohamed Khamis. Research interests Research groupsGlasgow Interactive Systems Publications List by: Type | Date Jump to: 2025 | 2024 | 2023 | 2022 | 2021 | 2020Number of items: 18.2025 Pohlmann, Katharina M.T., Wilson, Graham, Bajorunaite, Laura ORCID: https://orcid.org/0000-0002-8572-2955, McGill, Mark and O'Hagan, Joseph (2025) \"Everyone Knows You’re Watching P*rn\": Reflecting on First-hand User Accounts on the Use and Public Perception of In-Transit Passenger XR. In: 24th IEEE International Symposium on Mixed and Augmented Reality (ISMAR 2025), Daejeon, South Korea, 8-12 Oct 2025, (Accepted for Publication) Wilson, Graham, Russell, Harvey, O'Hagan, Joseph and McGill, Mark (2025) Big Frog Vibes: Jumping Superhuman Distances Forward, Vertically and Sideways in VR Using Comfortably High Translational Gain. In: IEEE ISMAR 2025, Daejeon, South Korea, 08-12 Oct 2025, (Accepted for Publication) Al-Taie, Ammar ORCID: https://orcid.org/0000-0002-5156-6245, Matviienko, Andrii, O'Hagan, Joseph, Pollick, Frank ORCID: https://orcid.org/0000-0002-7212-4622 and Brewster, Stephen Anthony ORCID: https://orcid.org/0000-0001-9720-3899 (2025) Around the World in 60 Cyclists: Evaluating Autonomous Vehicle-Cyclist Interfaces Across Cultures. In: ACM CHI conference on Human Factors in Computing Systems (CHI 2025), Yokohama, Japan, 26 Apr - 01 May 2025, p. 217. ISBN 9798400713941 (doi: 10.1145/3706598.3713407) Drago, Diego ORCID: https://orcid.org/0009-0005-3917-9719, O'Hagan, Joseph, Kawsar, Fahim and Brewster, Stephen ORCID: https://orcid.org/0000-0001-9720-3899 (2025) Exploring Avatar Seat Allocation Strategies in Social AR. In: ACM CHI conference on Human Factors in Computing Systems (CHI 2025), Yokohama, Japan, 26 Apr - 01 May 2025, ISBN 9798400713958 (doi: 10.1145/3706599.3719867) O'Hagan, Joseph, Medeiros, Daniel, Wilson, Graham, McDermid, Robert and McGill, Mark (2025) Improving Ergonomic Viewing of Spatial XR Workspaces Through 2D Rotational Assistance. In: 2025 Conference on Human Factors in Computing Systems, Yokohama, Japan, 26 Apr - 01 May 2025, ISBN 9798400713958 (doi: 10.1145/3706599.3719920) Cho, Hyunsung, Edgar, Drew, Lindlbauer, David and O'Hagan, Joseph (2025) Evaluating Dynamic Delivery of Audio+Visual Message Notifications in XR. In: IEEE VR 2025, Saint-Malo, France, 8-12 March 2025, pp. 277-287. ISBN 9798331536459 (doi: 10.1109/VR59515.2025.00052) Weerasinghe, Maheshya, Macdonald, Shaun ORCID: https://orcid.org/0000-0001-6519-318X, Fiani, Cristina, O'Hagan, Joseph, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, McGill, Mark and Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 (2025) Beyond mute and block: adoption and effectiveness of safety tools in social VR, from ubiquitous harassment to social sculpting. IEEE Transactions on Visualization and Computer Graphics, 31(5), pp. 3275-3284. (doi: 10.1109/TVCG.2025.3549860) (PMID:40067706) 2024 O'Hagan, Joseph, Gugenheimer, Jan, Mathis, Florian, Bonner, Jolie, Jones, Richard and McGill, Mark (2024) A viewpoint on the societal impact of everyday augmented reality, and the need for perceptual human rights. IEEE Security and Privacy, 22(1), pp. 64-68. (doi: 10.1109/MSEC.2023.3333988) 2023 O'Hagan, Joseph, Gugenheimer, Jan, Bonner, Jolie, Mathis, Florian and McGill, Mark (2023) Augmenting People, Places & Media: The Societal Harms Posed by Everyday Augmented Reality, and the Case for Perceptual Human Rights. In: 22nd International Conference on Mobile and Ubiquitous Multimedia (MUM 2023), Vienna, Austria, 3-6 December 2023, pp. 219-229. ISBN 9798400709210 (doi: 10.1145/3626705.3627782) O'Hagan, Joseph, Mathis, Florian and McGill, Mark (2023) User Reviews as a Reporting Mechanism for Emergent Issues Within Social VR Communities. In: 22nd International Conference on Mobile and Ubiquitous Multimedia (MUM 2023), Vienna, Austria, 3-6 December 2023, pp. 230-237. ISBN 9798400709210 (doi: 10.1145/3626705.3627780) Bonner, Jolie, Mathis, Florian, O'Hagan, Joseph and McGill, Mark (2023) When Filters Escape the Smartphone: Exploring Acceptance and Concerns Regarding Augmented Expression of Social Identity for Everyday AR. In: 29th ACM Symposium on Virtual Reality Software and Technology (VRST 2023), Christchurch, New Zealand, 9-11 October 2023, p. 14. ISBN 9798400703287 (doi: 10.1145/3611659.3615707) O'Hagan, Joseph, Williamson, Julie R. ORCID: https://orcid.org/0000-0002-1816-1393, Mathis, Florian, Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 and McGill, Mark (2023) Re-Evaluating VR User Awareness Needs During Bystander Interactions. In: 2023 CHI Conference on Human Factors in Computing Systems (CHI '23), Hamburg, Germany, 23-28 Apr 2023, p. 876. ISBN 9781450394215 (doi: 10.1145/3544548.3581018) 2022 O'Hagan, Joseph, Saeghe, Pejman, Gugenheimer, Jan, Medeiros, Daniel ORCID: https://orcid.org/0000-0002-1904-6637, Marky, Karola, Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 and McGill, Mark (2022) Privacy-enhancing technology and everyday augmented reality: understanding bystanders' varying needs for awareness and consent. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 6(4), 177. (doi: 10.1145/3569501) Mathis, Florian, O'Hagan, Joseph, Vaniea, Kami and Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 (2022) Stay Home! Conducting Remote Usability Evaluations of Novel Real-World Authentication Systems Using Virtual Reality. In: 2022 International Conference on Advanced Visual Interfaces (AVI 2022), Rome, Italy, 06-10 Jun 2022, p. 14. ISBN 9781450397193 (doi: 10.1145/3531073.3531087) Williamson, Julie R. ORCID: https://orcid.org/0000-0002-1816-1393, O'Hagan, Joseph, Guerra-Gomez, John Alexis, Williamson, John H. ORCID: https://orcid.org/0000-0001-8085-7853, Cesar, Pablo and Shamma, David A. (2022) Digital Proxemics: Designing Social and Collaborative Interaction in Virtual Environments. In: CHI '22: CHI Conference on Human Factors in Computing Systems, New Orleans, LA, USA, 29 Apr - 05 May 2022, p. 423. ISBN 9781450391573 (doi: 10.1145/3491102.3517594) 2021 O'Hagan, Joseph, Williamson, Julie R. ORCID: https://orcid.org/0000-0002-1816-1393, McGill, Mark and Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 (2021) Safety, Power Imbalances, Ethics and Proxy Sex: Surveying In-The-Wild Interactions Between VR Users and Bystanders. In: 2021 IEEE International Symposium on Mixed and Augmented Reality (ISMAR), Bari, Italy, 04-08 Oct 2021, ISBN 9781728197777 (doi: 10.1109/ISMAR52148.2021.00036) Bonner, Jolie, O'Hagan, Joseph, Mathis, Florian, Ferguson, Jamie and Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 (2021) Using Personal Data to Support Authentication: User Attitudes and Suitability. In: 20th International Conference on Mobile and Ubiquitous Multimedia (MUM 2021), Leuven, Belgium, 5-8 Dec 2021, pp. 35-42. ISBN 9781450386432 (doi: 10.1145/3490632.3490644) 2020 O'Hagan, Joseph, Williamson, Julie R. ORCID: https://orcid.org/0000-0002-1816-1393 and Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 (2020) Bystander Interruption of VR Users. In: 9th ACM International Symposium on Pervasive Displays, New York, NY, USA, 4-5 Jun 2020, pp. 19-27. ISBN 9781450379861 (doi: 10.1145/3393712.3395339) This list was generated on Sun Nov 30 20:20:44 2025 GMT. Jump to: Articles | Conference ProceedingsNumber of items: 18.Articles Weerasinghe, Maheshya, Macdonald, Shaun ORCID: https://orcid.org/0000-0001-6519-318X, Fiani, Cristina, O'Hagan, Joseph, Chollet, Mathieu ORCID: https://orcid.org/0000-0001-9858-6844, McGill, Mark and Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 (2025) Beyond mute and block: adoption and effectiveness of safety tools in social VR, from ubiquitous harassment to social sculpting. IEEE Transactions on Visualization and Computer Graphics, 31(5), pp. 3275-3284. (doi: 10.1109/TVCG.2025.3549860) (PMID:40067706) O'Hagan, Joseph, Gugenheimer, Jan, Mathis, Florian, Bonner, Jolie, Jones, Richard and McGill, Mark (2024) A viewpoint on the societal impact of everyday augmented reality, and the need for perceptual human rights. IEEE Security and Privacy, 22(1), pp. 64-68. (doi: 10.1109/MSEC.2023.3333988) O'Hagan, Joseph, Saeghe, Pejman, Gugenheimer, Jan, Medeiros, Daniel ORCID: https://orcid.org/0000-0002-1904-6637, Marky, Karola, Khamis, Mohamed ORCID: https://orcid.org/0000-0001-7051-5200 and McGill, Mark (2022) Privacy-enhancing technology and everyday augmented reality: understanding bystanders' varying needs for awareness and consent. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, 6(4), 177. (doi: 10.1145/3569501) Conference Proceedings Pohlmann, Katharina M.T., Wi",
  "content_length": 16540,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:09"
}