{
  "name": "Joseph Kee-Yin Ng",
  "homepage": "http://www.comp.hkbu.edu.hk/~jng",
  "status": "success",
  "content": "Ir. Prof. Joseph Kee Yin NG 's Home Page Ir. Prof. NG Kee Yin Joseph (Professor Emeritus) B.Sc.(86), M.Sc.(88), Ph.D.(93), Department of Computer Science University of Illinois at Urbana-Champaign, USA Positions Held at HKBU: Professor Emeritus - 2024-present Adjunct Professor, Department of Computer Science, Hong Kong Baptist University - 2023-2026 Full Professor, Department of Computer Science, Hong Kong Baptist University - 2005-2023 Director, Research Centre for Ubiquitous Computing (RCUC) - 2006-2023 Programme Director, B.Sc.(Hons) in Business Computing and Data Analytics - 2018-2022 Programme Coordinator / Director, B.Sc.(Hons) in Computer Science - 2007-2015 / 2015-2017 Contact: Official Email:jng@comp.hkbu.edu.hk or jng@associate.hkbu.edu.hk Personal Email:joseph.osk@gmail.com Official Webpage:http://www.comp.hkbu.edu.hk/~jng Personal Webpage:http://josephng.hk Facebook:http://www.facebook.com/joseph.ng Mailing Address: Ir. Prof. Joseph Kee-Yin Ng Room DLB626, David Lam Building Department of Computer Science Hong Kong Baptist University Kowloon Tong, Hong Kong Previous Teaching Courses: COMP 1007 - Introduction to Python and its Applications COMP 1110 - Computer Literacy COMP 1180 - Structured Programming COMP 2320 - Operating Systems COMP 2321 - Operating Systems and Networking I COMP 2330 - Data Communications and Networking COMP 2650 - Network Administration and Programming COMP 3050 - Distributed Computing Systems COMP 3320 - Distributed Systems COMP 3430 - Information Technology Professional Practices COMP 3630 - The Internet COMP 3670 - Mobile Computing COMP 3830 - Health Information Technology COMP 7090 - Ubiquitous Computing COMP 7530 - IT Forum COMP 7830 - Health Informatics COMP 4898 - Final Year Project (1st Semester) COMP 4899 - Final Year Project (2nd Semester) Research Interests Real-Time & Embedded Systems, Cyber Physical Systems, Internet of Things, Internet of Medical Things, Wireless Communications, Multimedia Communications, Ubiquitous / Pervasive Computing, Location-aware Computing, Mobile and Ubiquitous Healthcare, Health Informatics, Parallel and Distributed Computing. Professional Experience Chief Technology Officer, Hong Kong Applied Science and Technology Research Institute (ASTRI) - 2023 Adjunct professor, Hong Kong Baptist University, Computer Science Dept., 10/23  9/26 Visiting Scholar, University of California at Berkeley, EECS Dept., 1/18 – 7/18 & 1/14 – 7/14. Professor, Hong Kong Baptist University, Computer Science Dept., 9/05 – 9/23. Associate professor, Hong Kong Baptist University, Computer Science Dept., 3/99 – 9/05. Assistant professor, Hong Kong Baptist University, Computer Science Dept., 9/95 – 3/99. University lecturer, Hong Kong Baptist University, Computing Studies Dept., 11/94 – 9/95. University lecturer, Hong Kong Baptist College, Computing Studies Dept., 1/93 – 11/94. Teaching assistant, University of Illinois, Dept of C.S., 8/91 – 12/92. Teaching assistant, University of Illinois, Dept of E.E., 1/90 – 5/90. Research assistant, University of Illinois, U.S. Army CERL, 6/88 – 5/91. Research assistant, University of Illinois, Dept of C.S., 6/86 – 5/88. Research programmer, University of Illinois, 8/85 – 5/86. Education University of Illinois at Urbana-Champaign, College of Eng., Ph.D. degree in Computer Science, May 1993. University of Illinois at Urbana-Champaign, College of Eng., M.Sc. degree in Computer Science, January 1988. University of Illinois at Urbana-Champaign, College of Liberal Arts and Science, B.Sc. degree in Mathematics and Computer Science, May 1986. Awards Joseph K. Ng (Member of the Board of Directors, Hong Kong Internet Registration Corporation Limited), Directors of the Year 2012 (Category: Boards), organized by The Hong Kong Institute of Directors (HKIoD). Benson Hin Ning Mak and Joseph K. Ng (Supervisor), “iCare - A HealthCare Application”, Bronze Award from the HKEIA Innovation and Technology Project Competition Award (2012), organized by the Hong Kong Electronic Industries Association. Certificate of Appreciation, Hong Kong R&D Centre for Logistics and Supply Chain Management Enabling Technologies (LSCM), in recognition of the participation & valuable contribution to the Expert Review Panel from 1 December 2008 - 30 November 2010 Joseph K. Ng, “The Innovative Wi-Fi Services & Applications Award - Ubiquitous City – Hong Kong”, this award is sponsored by OGCIO & HKWDC, May 2009 – Price awarded for development $60,000. Certificate of Appreciation,  Hong Kong R&D Centre for Logistics and Supply Chain Management Enabling Technologies (LSCM), in recognition of the participation & valuable contribution to the Expert Review Panel from 1 December 2006 - 30 November 2008 Certificate of Appreciation, IEEE Computer Society, in appreciation for the contribution made to the 2008 Chapters Activities Board. Certificate of Appreciation for the 2007 Chapter Activity Board as CAB Region 10 Chapter Coordinator, IEEE Computer Society, 4 November 2007. Certificate of Appreciation for the 2006 Chapter Activity Board as Chair for the Asia/Pacific Distinguished Visitor Programme, IEEE Computer Society, December 2006 Wilson Man Chung Yeung and Joseph K. Ng (Supervisor), \"Providing Location-Based Services at HKBU Library\", Distinction Awards of Amyway Intervarsity Internet Technologies Exposition and Conference 2005 (IiTEC 2005), organized by Internet Professionals Association. Wilson Man Chung Yeung and Joseph K. Ng (Supervisor), \"Location-Based Services at HKBU Library\", Certificate of Merit (Post-Secondary Category) of The 7th IT Excellence Awards, organized by Hong Kong Computer Society. Certificate of Appreciation for Services and Contribution as Education Activities Coordinator (2004), IEEE Hong Kong Section. The IEEE Meritorious Service Award 2004, IEEE Computer Society Excellent Paper Award from the 17th International Conference on Advanced Information Networking and Applications (AINA 2003), March 2003. President's Award for Outstanding Performance in Service (2001-2002), Hong Kong Baptist University Certificate of Appreciation for Leadership and Service (2000-2001), IEEE Region 10 Professional Membership 2018-present    Fellow, Hong Kong Institution of Engineers (HKIE) 2017-present    Fellow, Hong Kong Computer Society (HKCS) 2017-2023       Member of the task force on Disaster Resilient Smart World (DiRSW) of IEEE Computational Intelligence Society, Smart World Technical Committee (CIS SWTC) 2016-2023       HKBU Student Branch Advisor, IEEE Hong Kong Section. 2012-2014       Vice-Chair of the Internet Society (ISOC) – Hong Kong Chapter 2006-present    Life-Time and Full Member of Hong Kong Computer Society (HKCS) 2005-present    Founding Members of the Internet Society (ISOC)-Hong Kong Chapter 2005-2012       Treasurer of the Internet Society (ISOC)-Hong Kong Chapter 2003-2009 Region 10 Coordinator for the Chapter Activities Board of the IEEE Computer Society 2003-2009 Coordinator of the IEEE Computer Society Distinguished Visitors Program Asia/Pacific 2002-present Past Chairman of the IEEE, Hong Kong Section, Computer Chapter. 2000-present Senior Member of the Institute of Electrical and Electronic Engineers (IEEE) 2000-2005 Executive Council Member of the IEEE, Hong Kong Section. 2000-2001 Chairman of the IEEE, Hong Kong Section, Computer Chapter. 1998-1999 Vice-Chairman of the IEEE, Hong Kong Section, Computer Chapter. 1997-present Member of the IEEE Communication Society. 1997-present Member of ACM. 1997-1999 Member of EUROMICRO. 1997-2000 Member of the Hong Kong Institution of Science. 1997-2000 Member of the Information Technology Joint Council (ITJC) 1995-1998 General Secretary of the IEEE, Hong Kong Section, Computer Chapter 1993-present Executive Council Member of the IEEE, Hong Kong Section, Computer Chapter 1991-present Member of the Institute of Electrical and Electronic Engineers (IEEE) 1991-present Member of the IEEE Computer Society Professional Services & Activities 2024            Panel Member, Programme Area Accreditation for Information and Communication Technology for Saint Francis University. An accreditation through HKCAAVQ (August 2024). 2022            Committee Advisor, The HK Taxi Industry Innovation Committee. 2021            Panel Member, Programme Area Accreditation for Information and Communication Technology for Caritas Institute of Higher Education. An accreditation through HKCAAVQ (15-17 December 2021). 2021            Professional Mentor and Member of the Organizing Committee, The IEEE Hong Kong STEM Student Conference, IEEE HK Section (11 December 2021) 2021            Member of the Task Group, The Review of Information Technology Strategy for the Social Welfare Sector in Hong Kong, Social Welfare Department, Hong Kong SAR Government. 2020-2021    Member of the Technical Advisory Committee, The eBRAM International Online Dispute Resolution Centre (eBRAM Centre), Department of Justice, Hong Kong SAR Government. 2020-2023    Board of Director, Technical Committee Member, and Chairman of the Artificial Intelligence and Big Data Panel, Hong Kong Applied Science and Technology Research Institute Company Limited (ASTRI), Information and Communication Technology R&D Centre. 2020-2021    Member of the International Expert Panel and its Sub-Committee on Technology and Privacy Protection, Electronic Road Pricing Pilot Scheme in Central of Hong Kong, Transport Department, Hong Kong SAR Government. 2019-2021    Member of the Quality Assurance Advisory Board, OpenCertHub Limited 2019-2020    Member of the Technical Advisory Ad Hoc Committee, Multi-functional Smart Lampposts Scheme, OGCIO, Hong Kong SAR Government. 2019-2024    Member of the Project Steering Committee (SC), Logistics and Supply Chain MultiTech R&D Centre Limited (LSCM) 2018-2021    Panel Member, Technology Review Panel, Hong Kong Applied Science and Technology Research Institute Company Limited (ASTRI), Information and Communication Technology R&D Centre 2017-20",
  "content_length": 102159,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:06"
}