{
  "name": "Joseph P. Near",
  "homepage": "https://www.uvm.edu/~jnear",
  "status": "success",
  "content": "Joseph P. Near Joe Near He/him Associate Professor University of Vermont Office: E458 Innovation Hall E-mail: jnear at uvm dot edu [ CV ] [ Books | Teaching | Students | Service | Publications ] Member, UVM PLAID lab Member, UVM Center for Computer Security and Privacy Research Interests My research interests include data privacy (especially differential privacy), security (especially secure/verified computation), fairness, programming languages, and machine learning. Books Programming Differential Privacy A book about differential privacy, for programmers. By Joseph P. Near and Chiké Abuah Differential Privacy for Databases By Joseph P. Near and Xi He Teaching CS 3110/5110: Data Privacy (Fall 2025, Fall 2024, Fall 2023) CS 3020: Compiler Construction (Spring 2025, Spring 2024) CS 3990/5990: Secure Distributed Computation (Fall 2023) Graduate Students (advised or co-advised) Craig Agricola (PhD) Mako Bates (PhD) Prianka Bhattacharjee (PhD) Onyinye Dibia (PhD) Syed Jafri (PhD) Krystal Maughan (PhD) Ivoline Ngong (PhD) Ratang Sedimo (PhD) Service Organization TPDP: Theory and Practice of Differential Privacy (2024, 2025) miniKanren: The miniKanren and Relational Programming Workshop (2024) FCS: Foundations of Computer Security Workshop (2022, 2021) Program Committees 2025: CCS, USENIX Security, PETS 2024: CCS, AISTATS, PETS 2023: CCS, VLDB, TPDP 2022: CCS, AISTATS, VLDB, TPDP 2021: TPDP 2020: TPDP, FCS Pre-prints \"We Need a Standard\": Toward an Expert-Informed Privacy Label for Differential Privacy Onyinye Dibia, Mengyi Lu, Prianka Bhattacharjee, Joseph P. Near, Yuanyuan Feng MultiChor: Census Polymorphic Choreographic Programming with Multiply Located Values Mako Bates, Syed Jafri, Joseph P. Near We Know I Know You Know; Choreographic Programming With Multicast and Multiply Located Values Mako Bates, Joseph P. Near DT-SIM: Property-Based Testing for MPC Security Mako Bates, Joseph P. Near Improving Utility for Privacy-Preserving Analysis of Correlated Columns using Pufferfish Privacy Krystal Maughan, Joseph P. Near Prediction Sensitivity: Continual Audit of Counterfactual Fairness in Deployed Classifiers Krystal Maughan, Ivoline C. Ngong, Joseph P. Near Secret Sharing Sharing For Highly Scalable Secure Aggregation Timothy Stevens, Joseph P. Near, Christian Skalka Recent Publications SoK: Usability Studies in Differential Privacy Onyinye Dibia, Brad Stenger, Steven Baldasty, Mako Bates, Ivoline C. Ngong, Yuanyuan Feng, Joseph P. Near In PETS, 2025 (PDF) Efficient, Portable, Census-Polymorphic Choreographic Programming Mako Bates, Shun Kashiwa, Syed Jafri, Gan Shen, Lindsey Kuper, Joseph P. Near In PLDI, 2025 (PDF) SMT-Boosted Security Types for Low-Level MPC Christian Skalka, Joseph P. Near In ESOP, 2025 (PDF) Differentially Private Learning Needs Better Model Initialization and Self-Distillation Ivoline C. Ngong, Joseph P. Near, Niloofar Mireshghallah In NAACL, 2025 (PDF) Foldable, Recursive Proofs of Isogeny Computation with Reduced Time Complexity Krystal Maughan, Joseph P. Near, Christelle Vincent In IEEE QCE, 2024 (PDF) Language-Based Security for Low-Level MPC Christian Skalka, Joseph P. Near In PPDP, 2024 (PDF) Evaluating the Usability of Differential Privacy Tools with Data Practitioners Ivoline C. Ngong, Brad Stenger, Joseph P. Near, Yuanyuan Feng In SOUPS, 2024 (PDF) OLYMPIA: A Simulation Framework for Evaluating the Concrete Scalability of Secure Aggregation Protocols Ivoline C. Ngong, Nicholas Gibson, Joseph P. Near In IEEE SaTML, 2024 (PDF) Contextual Linear Types for Differential Privacy Matias Toro, David Darais, Chike Abuah, Joseph P. Near, Damian Arquez, Federico Olmedo, Eric Tanter ACM Transactions on Programming Languages and Systems, 2023 Solo: A Lightweight Static Analysis for Differential Privacy Chike Abuah, David Darais, Joseph P. Near In OOPSLA, 2022 (PDF) E458 Innovation Hall, Burlington, VT",
  "content_length": 3886,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:08"
}