{
  "name": "Joseph Jay Williams",
  "homepage": "http://www.josephjaywilliams.com",
  "status": "success",
  "content": "Intelligent Adaptive Interventions LabSearch this siteEmbedded FilesSkip to main contentSkip to navigationJoseph Jay Williams'Intelligent Adaptive Interventions Lab                                                          Summary of Research Program & Lab Accomplishments:Our goal is to transform everyday technology to be more intelligent, so it promotes belief and behaviour change that helps people achieve their goals and benefit society. For example, we've used AI to design systems that: (1) Transform text messages into mental health coaches. (2) Make online homework more personalized like a real teacher. (3) Turn emails into persuasive agents that motivate people to take actions that benefit them and society. E.g. Donate to charities and share prosocial information with others (e.g. via text, social media, email).  We develop tools and algorithms for Adaptive A/B Experimentation, which accelerates the use of experiments to make better decisions about using technology to change behaviour. High-impact applications span learning, mental & physical health, charitable giving, and decision-making: Any situation where technology can influence people to do action A vs action B. For example, we've used Adaptive Experimentation to identify 3 minute emails that boost students' performance on high-stakes tests by 4% [AC.34].We invented the AdaptEx (Adaptive Experiment) framework [AC.29] to transform technology touchpoints used by billions of people (e.g. text messages, emails, websites, apps), into agents that perpetually experiment, to discover and deploy whichever interventions best help a person in a particular context. We achieve this by reimagining randomized 'A/B' experiments as a bridge between human intelligence (e.g. crowdsourced input from users, designers, & scientists) and artificial intelligence (e.g. reinforcement learning, LLMs). The AdaptEx framework has impacted over 500 000 people, in applications from education to mental & physical health. AdaptEx won a prestigious $1M Xprize for transforming education through AI-driven experimentation, and a $3M NSF grant to enable others access to this \"Cyberinfrastructure\". To bridge research with real-world impact, my group has published >55 conference proceedings and >32 journal papers in venues that span: (1) Human-computer interaction; (2) Theoretical and applied work in social-behavioural sciences (e.g. experimental/cognitive/clinical/educational/health psychology, medical sciences, mental & physical health, education); (3) Applied GenAI (LLMs); (3) Applied Machine/Reinforcement Learning; (5) Applied Statistics. Our 10 year target is to investigate how to scale access to adaptive experimentation techniques, and generalize to many kinds of personalized interventions: Millions of people and organizations can benefit from changing their behaviour.Our lab's work is represented in over 85 papers (www.intadaptint.org/papers), 2 Best Paper Awards (1 at CHI), 4 Runner Up/Honorable Mention for Best Paper (CHI, EDM, LAS), and 1st place in a $1M Xprize competition for the future of technology for experimentation. We've received over $2M in grant funding, enabling interventions impacting over 500 000 people. Over 4 graduate students have gone into research positions (2 with faculty positions, 1 a research scientist, and 1 a prestigious independent postdoc at Stanford).BiographyJoseph Jay Williams is director of the Intelligent Adaptive Interventions Lab. He is an Assistant Professor at the University of Toronto in Computer Science, with courtesy appointments supervising PhD students in Statistical Science, Psychology, and the Vector Institute for Artificial Intelligence. He also has courtesy appointments in Economics, Industrial Engineering & the Faculty of Information. His PhD Students span HCI (Human Computer Interaction), Cognitive/Social/Clinical/Health Psychology, applied ML (reinforcement learning), applied AI (LLMs), & Statistics.Joseph was previously an Assistant Professor in Information Systems & Analytics at National University of Singapore, Research Scientist at Harvard, Postdoctoral Scholar at Stanford, and did his PhD at UC Berkeley. Contact UsUndergraduates & interested graduate students/postdocs interested in joining or collaborating, contact: iaiinterest@googlegroups.com. Joseph can be contacted at williams[at]cs[dot]toronto[dot]edu.You can follow Joseph on LinkedIn, Facebook, Instagram, TikTok or any other social media.Report abusePage detailsPage updated Report abuse",
  "content_length": 4506,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:06"
}