{
  "name": "Joseph M. Hellerstein",
  "homepage": "http://citris-uc.org/person/professor-joseph-hellerstein",
  "status": "success",
  "content": "Joseph Hellerstein - CITRIS and the Banatao Institute Joseph M. Hellerstein is a Professor of Computer Science at the University of California, Berkeley. Hellerstein’s work focuses on data-centric systems and the way they drive computing. Hellerstein is an ACM Fellow, and his research has been recognized by multiple awards including an Alfred P. Sloan Research Fellowship, two ACM-SIGMOD “Test of Time” awards, VLDB Best Paper award, IBM Research Best Paper in Computer Science, NSF CAREER, NASA New Investigator, and an Okawa Foundation Fellowship. In 2010, Fortune Magazine included him in their list of 50 smartest people in technology. MIT’s Technology Review included his work on Cloud Programming on their 2010 TR10 list of the 10 most important emerging technologies; in 1999 he was on their inaugural TR100 list of young innovators. In addition to his role in academia, Hellerstein has been a leader in the technology industry. From 2003-2005 he was Director of Intel Research, Berkeley, where he led research in networking and query processing for the Internet and for sensor networks. Hellerstein was a co-founder of Cohera Corporation (now part of Oracle), where he served as Chief Scientist from 1998-2001. Key ideas from his research have been incorporated into commercial and open-source database systems including IBM’s DB2 and Informix, Oracle’s PeopleSoft Catalog Management, and the open-source PostgreSQL system. He has also led a number of open-source systems projects at Berkeley, including TelegraphCQ, TinyDB, PIER, P2 and Bloom. Hellerstein is the founding editor-in-chief of the journal Foundations and Trends in Databases. He currently serves on the Scientific Advisory Board (Fachbeirat) of the Max Planck Institute for Computer Science, as well as the technical advisory boards of a number of software and Internet companies including EMC and SurveyMonkey. In the past he has served as a member of the advisory boards of ACM SIGMOD and Ars Digita University. Hellerstein received his Ph.D. from the University of Wisconsin, a masters degree from UC Berkeley, and a bachelor’s degree from Harvard. He spent a pre-doctoral internship at IBM Almaden Research Center, and a post-doctoral internship at the Hebrew University in Jerusalem. Hellerstein is a jazz enthusiast and part-time trumpeter. As an undergraduate he helped bring jazz onto the Internet via the Usenet group rec.music.bluenote. During his Ph.D. studies at Wisconsin he minored in music under the direction of Richard Davis and Joan Wildman. He has performed as a sideman with notable musicians including Carla Bley, Jane Ira Bloom, Lester Bowie, Benny Carter, Rosemary Clooney, Buck Clayton, Harry Connick, Jr., Harry “Sweets” Edison, Joe Henderson, Vijay Iyer, Illinois Jacquet, Geoff Keezer, Joshua Redman, Anton Schwartz, and Steve Swallow. Title Professor Website http://db.cs.berkeley.edu/jmh/ E: hellerstein@cs.berkeley.edu T: (510) 643-4011 Address University of California, Berkeley 685 Soda Hall #1776 Berkeley, Ca 94720 - 1776 CA People Research Thrusts Campuses UC Berkeley",
  "content_length": 3078,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:10"
}