{
  "name": "Josef van Genabith",
  "homepage": "https://www.dfki.de/web/ueber-uns/mitarbeiter/person/jova02",
  "status": "success",
  "content": "Prof. Dr. Josef van Genabith Skip to main content Skip to main navigation Prof. Dr. Josef van Genabith Organisationseinheit Sprachtechnologie und Multilingualität Kontakt +49 681 85775 5287 (Saarbrücken) Josef.van_Genabith@dfki.de Adresse (Saarbrücken) Gebäude D3 1Stuhlsatzenhausweg 366123 SaarbrückenCross-Lingual Fact Verification: Analyzing LLMs Performance Patterns Across LanguagesHanna Shcharbakova; Tatiana Anikina; Natalia Skachkova; Josef van GenabithIn: Recent Advanced in Natural Language Processing. International Conference on Recent Advances in Natural Language Processing (RANLP-2025), September 8-10, Varna, Bulgaria, Association for Computational Linguistics, 9/2025.AIDEN: Automatic Speaker Notes Creation and Navigation for Enhancing Online Learning Experience.Stalin Varanasi; Muhammad Umer Tariq Butt; Günter Neumann; Josef van GenabithIn: Recent Advanced in Natural Language Processing. International Conference on Recent Advances in Natural Language Processing (RANLP-2025), September 8-10, Varna, Bulgaria, Association for Computational Linguistics, 9/2025.Seeing, Signing, and Saying: A Vision-Language Model-Assisted Pipeline for Sign Language Data Acquisition and Curation from Social Media.Shakib Yazdani; Yasser Hamidullah; Cristina España-Bonet; Josef van GenabithIn: Recent Advanced in Natural Language Processing. International Conference on Recent Advances in Natural Language Processing (RANLP-2025), September 8-10, Varna, Bulgaria, Association for Computational Linguistics, 9/2025. Profil Persönliche Angaben CV Ämter Projekte Prof. Dr. Josef van Genabith ist wissenschaftlicher Direktor für Sprachtechnologie und Multilingualität (MLT) am Deutschen Forschungszentrum für Künstliche Intelligenz (DFKI) und ordentlicher Professor und Lehrstuhlinhaber für Translationsorientierte Sprachtechnologie an der Universität des Saarlandes. ForschungsinteressenSprach- und multilinguale Technologienmaschinelle ÜbersetzungSprachverstehen und Sprachgenerierung2014 - jetzt: Wissenschaftlicher Direktor Multilinguale Technologien, Deutsches Forschungszentrum für Künstliche Intelligenz (DFKI)2014 - jetzt: Lehrstuhl für Übersetzungsorientierte Sprachtechnologien, Universität des Saarlandes, Deutschland2013-2014: Stellvertretender Direktor des Centre for Next Generation Localisation (CNGL), Irland2007-2013: Gründungsdirektor des Centre for Next Generation Localisation (CNGL), Irland2001-2008: Direktor des National Centre for Language Technology (NCLT), Irland2016-2018 External Examiner BA Computer Science and Language (CSL), School of Computer Science & Statistics (SCSS) des Trinity College Dublin2014 Joint General Chair COLING 2014 Dublin2012 Advisory Board Member Centre for Talent Youth Ireland (CTYI)2010  External Evaluator of the Department of Computational Linguistics, University of Zurich, Switzerland2010-now Advisory Board Member LINDAT-CLARIN, Charles University of Prague, Czech Academy of Sciences, Ministry of Education, Youth and Sports, Czech Republic2010 Hosting the 4th Machine Translation Marathon, EuroMatrixPlus and CNGL/NCLT at Dublin City University2009 Advisory Board Member, Hindi-Urdu Treebank Project, National Science Foundation (NSF), USA2009 Elected member of International Lexical Functional Grammar Association (ILFGA) Executive Committee2007 Elected to Advisory Board of the European Association of Computational Linguistics, (EACL)2007 ACL European Sponsorship Chairs (jointly with Philipp Koehn, Univ. of Edinburgh)2007 ACL 2007, Prague, Area Chair for Syntax, Parsing and Formalisms1997-2001 Chair of Programme Board B.Sc. in Applied Computational Linguistics (ACL), School of Computing, DCUTRAILS Vertrauenswürdige und integrative MaschinenDie Verarbeitung natürlicher Sprache (Natural Language Processing, NLP) hat bei einigen menschlichen Aufgaben beeindruckende Leistungen erbracht. Um eine solche Leistung zu erreichen, müssen aktuelle…EUC PT EU Council Presidency TranslatorSprache ist ein wesentlicher Teil unseres Lebens - wir benutzen sie, um Informationen auszutauschen, unsere Gefühle zu beschreiben, mit anderen zu diskutieren oder Wissen an die nächsten Generationen…DEEPLEE Tiefes Lernen für End-to-End-Anwendungen in der SprachtechnologieDie Forschungsarbeiten in DEEPLEE, die im Forschungsberich Sprachtechnologie in Saabrücken und Berlin durchgeführt werden, bauen auf der Expertise des DFKI in den Bereichen \"Tiefes Lernen\" (DL) und…QT21 QT21: Quality Translation 21Ein barrierefreier europäischer digitaler Binnenmarkt ist ein ausgesprochenes Ziel der EU für 2020. Die META-NET-Weißbücher über Sprachen zeigen, dass derzeit nur drei der 27 EU-Sprachen moderate bis… × DFKI durchsuchen nach: Folgen Sie uns auf: FacebookFolgen Sie uns auf: InstagramFolgen Sie uns auf: YoutubeFolgen Sie uns auf: LinkedInImpressumDatenschutz",
  "content_length": 4814,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:54"
}