{
  "name": "Joseph Teran",
  "homepage": "https://math.ucdavis.edu/~jteran",
  "status": "success",
  "content": "Joseph M. Teran Joseph M. Teran Professor jteran@math.ucdavis.edu Mathematics Department UC Davis CV Research My research interests are generally related to the visual aspects of computational solid and fluid mechanics (see example movies below). Publications Y. Jin, Y. Han, Z. Geng, J. Teran, R. Fedkiw, Analytically Integrable Zero-Restlength Springs for Capturing Dynamic Modes Unrepresented by Quasistatic Neural Networks, Proceedings ACM SIGGRAPH 2022, pp. 9--37, 2022. J. Chen, V. Kala, A. Marquez-Razon, E. Gueidon, D. Hyde, J. Teran, A Momentum-Conserving Implicit Material Point Method for Surface Tension with Contact Angles and Spatial Gradients, ACM Transactions on Graphics (SIGGRAPH 2021), 40(4), pp. 1--16, 2021. D. Hyde, S. Gagniere, A. Marquez-Razon, J. Teran, An Implicit Updated Lagrangian Formulation for Liquids with Large Surface Energy, ACM Transactions on Graphics (SIGGRAPH Asia 2020), 39(6), pp.1--13, 2020. S. Gagniere, D. Hyde, A. Marquez-Razon, C. Jiang, Z. Ge, X. Han, Q. Guo, J. Teran, A Hybrid Lagrangian/Eulerian Collocated Velocity Advection and Projection Method for Fluid Simulation, Computer Graphics Forum, 39(8), pp. 1--14, 2020. M. Ding, X. Han, S. Wang, T. Gast, J. Teran, A Thermomechanical Material Point Method for Baking and Cooking , ACM Transactions on Graphics (SIGGRAPH Asia 2019), 38(6), 192, 2019. [PDF] J. Gaume, A. van Herwijnen, T. Gast, J. Teran, C. Jiang, Investigating the Release and Flow of Snow Avalanches at the Slope-Scale Using a Unified Model Based on the Material Point Method ,Cold Regions Science and Technology, 168, pp. 102847, 2019. [PDF] S. Wang, M. Ding, T. Gast, L. Zhu, S. Gagniere, C. Jiang, J. Teran, Simulation and Visualization of Ductile Fracture with the Material Point Method , Proc ACM on Computer Graphics and Interactive Techniques, 2(2) , pp. 18, 2019. [PDF] X. Han, T. Gast, Q. Guo, S. Wang, C. Jiang, J. Teran, A Hybrid Material Point Method for Frictional Contact with Diverse Materials , Proc ACM on Computer Graphics and Interactive Techniques, 2(2) , pp. 17, 2019. [PDF] J. Gaume, T. Gast, J. Teran, A. van Herwijnen, C. Jiang, Dynamic Anticrack Propagation in Snow , Nature Communications, 9, pp. 3047, 2018. [PDF] Q. Guo, X. Han, C. Fu, T. Gast, R. Tamstorf, J. Teran, A Material Point Method for Thin Shells with Frictional Contact, ACM Transactions on Graphics (SIGGRAPH 2018), 37(4), pp. 147:1-147:15, 2018. [PDF] M. Royston, A. Pradhana, B. Lee, Y. Chow, W. Yin, J. Teran, S. Osher, Parallel Redistancing using the Hopf-Lax Formula, Journal of Computational Physics, 365(1), pp. 7-17, 2018. [PDF] C. Fu, Q. Guo, T. Gast, C. Jiang, J. Teran, A Polynomial Particle-In-Cell Method, ACM Transactions on Graphics (SIGGRAPH Asia 2017), 36(6), pp. 222:1-222:12, 2017. [PDF] D. Clyde, J. Teran, R. Tamstorf, Modeling and Data-Driven Parameter Estimation for Woven Fabrics, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA), pp. 1-11, 2017. [PDF] C. Jiang, T. Gast, J. Teran, Anisotropic Elastoplasticity for Cloth, Knit and Hair Frictional Contact, ACM Transactions on Graphics (SIGGRAPH 2017), 36(4), pp. 152:1-152:14, 2017. [PDF] A. Pradhana, T. Gast, G. Klar, C. Fu, J. Teran, C. Jiang, K. Museth, Multi-species Simulation of Porous Sand and Water Mixtures, ACM Transactions on Graphics (SIGGRAPH 2017), 36(4), pp. 105:1-105:12, 2017. [PDF] C. Jiang, C. Schroeder, J. Teran, An Angular Momentum Conserving Affine-Particle-In-Cell Method, Journal of Computational Physics, 338(1), pp. 137-164, 2017. [PDF] G. Klar, T. Gast, A. Pradhana, C. Fu, C. Schroeder, C. Jiang, J. Teran, Drucker-Prager Elastoplasticity for Sand Animation, ACM Transactions on Graphics (SIGGRAPH 2016), 35(4), pp. 103:1-103:12, 2016. [PDF] T. Gast, C. Schroeder, A. Stomakhin, C. Jiang, J. Teran Optimization Integrator for Large Time Steps, IEEE Transactions on Visualization and Computer Graphics, 21(10) pp. 1103-1115, 2015. [PDF] D. Ram, T. Gast, C. Jiang, C. Schroeder, A. Stomakhin, J. Teran, P. Kavehpour A Material Point Method for Viscoelastic Fluids, Foams and Sponges, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA), pp. 157-163, 2015. [PDF] C. Jiang, C. Schroeder, A. Selle, J. Teran, A. Stomakhin An Affine Particle-In-Cell Method, ACM Transactions on Graphics (SIGGRAPH 2015), 34(4), pp. 51:1-51:10, 2015. [PDF] Y. Wang, C. Jiang, C. Schroeder, J. Teran, An Adaptive Virtual Node Algorithm with Robust Mesh Cutting, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA), pp. 77-85, 2014. [PDF] A. Stomakhin, C. Schroeder, C. Jiang, L. Chai, J. Teran, A. Selle, Augmented MPM for phase-change and varied materials, ACM Transactions on Graphics (SIGGRAPH 2014), 33(4), pp. 138:1-138:11, 2014. [PDF] C. Schroeder, A. Stomakhin, R. Howes, J. Teran, A Second Order Virtual Node Algorithm for Navier-Stokes Flow Problems with Interfacial Forces and Discontinuous Material Properties, Journal of Computational Physics, 265, pp. 221-245, 2014. [PDF] R. Howes, C. Schroeder, J. Teran, A Virtual Node Algorithm for Hodge Decompositions of Inviscid Flow Problems with Irregular Domains, Methods and Applications of Analysis, 20(4), pp. 439-455, 2013. [PDF] J. Hegemann, C. Jiang, C. Schroeder, J. Teran, A Level Set Method for Ductile Fracture, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA), pp. 193-201, 2013. [PDF] A. Stomakhin, C. Schroeder, L. Chai, J. Teran, A. Selle, A Material Point Method for Snow Simulation, ACM Transactions on Graphics (SIGGRAPH 2013), 32(4), pp. 102:1-102:10, 2013. [PDF] D. Assencio, J. Teran, A Second Order Virtual Node Algorithm for Stokes Flow Problems with Interfacial Forces, Discontinuous Material Parameters and Irregular Domains, Journal of Computational Physics, 250(1), pp. 77-105, 2013. [PDF] J. Hegemann, A. Cantarero, C. Richardson, J. Teran, An Explicit Update Scheme for Inverse Parameter and Interface Estimation of Piecewise Constant Discontinuous Coefficients in Linear Elliptic PDEs, SIAM Journal of Scientific Computing, 35(2), pp. A1098-A1119, 2013. [PDF] A. Stomakhin, R. Howes, C. Schroeder, J. Teran, Energetically Consistent Invertible Elasticity, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA), pp. 25-32, 2012. [PDF] Y. Zhu, Y. Wang, J. Hellrung, A. Cantarero, E. Sifakis, J. Teran, A Second-Order Virtual Node Algorithm for Nearly Incompressible Linear Elasticity in Irregular Domains, Journal of Computational Physics, 231(21), pp. 7092-7117, 2012. [PDF] J. Hellrung, L. Wang, E. Sifakis, J. Teran, A Second-Order Virtual Node Method for Elliptic Problems with Interfaces and Irregular Domains in Three Dimensions, Journal of Computational Physics, 231(4), pp. 2015-2048, 2012. [PDF] A. McAdams, Y. Zhu, A. Selle, R. Tamstorf, M. Embrey, J. Teran, E. Sifakis, Efficient Elasticity for Character Skinning with Contact and Collisions, ACM Transactions on Graphics (SIGGRAPH 2011), 30(4), pp.1-12, 2011. [PDF] C. Richardson, J. Hegemann, E. Sifakis, J. Hellrung, J. Teran, An XFEM Method for Modeling Geometrically Elaborate Crack Propagation in Brittle Materials, International Journal for Numerical Methods in Engineering, 88(10), pp. 1042-1065, 2011. [PDF] A. McAdams, J. Teran, S. Osher, Crashing Waves, Awesome Explosions, Turbulent Smoke, and Beyond: Applied Mathematics and Scientific Computing in the Visual Effects Industry, Notices of the AMS, 57(5), pp.614-623, 2010. [PDF] A. McAdams, E. Sifakis, J. Teran, A Parallel Multigrid Poisson Solver for Fluids Simulation on Large Grids, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA) edited by M. Otaduy and Z. Popovic, pp.1-10, 2010. [PDF] J. Teran, L. Fauci, M. Shelley, Viscoelastic Fluid Response Can Increase the Speed and Efficiency of a Free Swimmer, Physical Review Letters, 104(3), 038101, 2010. [PDF] J. Bedrossian, J. Von Brecht, S. Zhu, E. Sifakis, J. Teran, A Second Order Virtual Node Method for Poisson Interface Problems on Irregular Domains, Journal of Computational Physics, 229, pp. 6405-6426, 2010. [PDF] Y. Zhu, E., Sifakis, J. Teran, A. Brandt, An Efficient Parallelizable Multigrid Framework for the Simulation of Elastic Solids, ACM Transactions on Graphics (with presentation at SIGGRAPH 2010), 29(2), pp. 1-18, 2010. [PDF] J. Hellrung, A. Selle, A. Shek, E. Sifakis, J. Teran, Geometric Fracture Modeling in BOLT, ACM SIGGRAPH 2009, Sketches and Applications. [PDF] A. McAdams, K. Ward, E. Sifakis, A. Selle, J. Teran, Detail Preserving Continuum Hair Simulation, ACM Transactions on Graphics (SIGGRAPH 2009), 28(3), pp.385-392, 2009. [PDF] J. Teran, C. Peskin, Tether Force Constraints in Stokes Flow with the Immersed Boundary Method on a Periodic Domain, SIAM Journal of Scientific Computing, 31(5), pp. 3404-3416, 2009. [PDF] E. Sifakis, J. Hellrung, J. Teran, A. Oliker, C. Cutting. Local Flaps: A Real-Time Finite Element Based Solution to the Plastic Surgery Defect Puzzle, Studies in Health and Technology Informatics, 142, pp. 313-138, 2009. [PDF] J. Teran, L. Fauci, M. Shelley, Peristaltic Pumping and Irreversibility of a Stokesian Viscoelastic Fluid, Physics of Fluids 20, 073101, 2008. [PDF] E. Sifakis, S. Marino, J. Teran, Globally Coupled Impulse-Based Collision Handling for Cloth Simulation, ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA) edited by M. Gross and D. James, pp. 147-152, 2008. [PDF] Z. Bao, J.-M. Hong, J. Teran, R. Fedkiw, Fracturing Rigid Materials, IEEE Transactions on Visualization and Computer Graphics, 13, pp. 370-378, 2007. [PDF] R. Weinstein, J. Teran, R., Fedkiw, Dynamic Simulation of Articulated Rigid Bodies with Contact and Collision, IEEE Transactions on Visualization and Computer Graphics, 12, pp. 365-374, 2006. [PDF] G. Irving, J. Teran, R. Fedkiw, Tetrahedral and Hexahedral Invertible Finite Elements, Graphical Models 68, pp. 66-89, 2006. [PDF] R. Weinstein, J. Teran, R. Fedkiw, Pre-stabilization for Rigid Body Articulation with Contact and Collision, ACM SIGGRAPH 2005, Sketches and Applications. [PDF] R. Bridson, J. Teran",
  "content_length": 13309,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:12"
}