{
  "name": "Josef Sivic",
  "homepage": "http://www.di.ens.fr/~josef",
  "status": "success",
  "content": "Josef Sivic Senior researcher (Directeur de Recherche) INRIA - Willow Project Département d'Informatique de l'Ecole Normale Supérieure Centre de Recherche INRIA de Paris Office: Building C, 4th floor, office 416 (Directions) E-mail: Josef dot Sivic at ens dot fr , Tel: +33.(0)1 8049 4422 Senior researcher and principal investigator Intelligent Machine Perception project Czech Institute of Informatics, Robotics, and Cybernetics Czech Technical University in Prague Office: Building B, 6th floor, office B-639 ( Directions ) I am currently on leave (“détachement”) to the Czech Technical University in Prague but keep close ties to the Willow team where I remain a close external collaborator.  For latest updates please visit my webpage in Prague. I am senior researcher (roughly equivalent to associate professor with tenure) at INRIA working in the Willow project at the Department of Computer Science at Ecole Normale Supérieure . I also lead the Intelligent Machine Perception project at the Institute of Informatics, Robotics and Cybernetics at the Czech Technical University in Prague. I completed my PhD at the University of Oxford working with Professor Andrew Zisserman and received my habilitation degree at Ecole Normale Supérieure in Paris. Before coming to France I spent six months as a post-doc in the Computer Science and Artificial Intelligence Lab (CSAIL) at MIT working with Prof. William Freeman. My research is in computer vision - a branch of computer science and engineering that aims to extract information from images. I am particularly interested in developing learnable image representations for automatic visual recognition and scene understanding. I lead the ERC project LEAP . News Hiring Postdocs/Phds in Deep Learning, Vision and Robotics at the Intelligent Machine Perception group in Prague. Email me for more details. Antoine Miech (co-advised with I. Laptev) has won the Google Fellowship . An interview with Antoine is here . Two papers on visual localization have been accepted for spotlight presentation at CVPR 2018. Pre-prints are available online here and here . Antoine Miech (co-advised with I. Laptev) has won the Google Cloud & YouTube-8M Video Understanding Challenge . The workshop paper describing the winning entry is now online . Bravo Antoine! Our work on weakly-supervised learning of visual relations has been accepted for oral presentation at ICCV 2017. The pre-print is online . Our work on learning geometric matching has been accepted for spotlight presentation at CVPR 2017. The pre-print is online . Our work on weakly supervised place recognition has been accepted for oral presentation at CVPR 2016. The pre-print is online . Our work on learning from instruction videos has been accepted for oral presentation at CVPR 2016. The pre-print is online . Our work on weakly supervised learning with convolutional neural networks has been accepted to CVPR 2015. The pre-print is online . Our work on place recognition across large changes in illumination has been accepted to CVPR 2015. The pre-print is online . Our work on aligning paintings to 3D models has been published in ACM Transactions on Graphics. The pre-print is available online . Our work on transferring mid-level image representations using convolutional neural networks has been accepted for oral presentation at CVPR 2014. The paper is available online . Our work on 2D-3D alignment for 3D object category recognition has been accepted for oral presentation at CVPR 2014 (The paper is available online ) . I have been awarded an ERC Starting Grant 2013 . IJCV special issues on Visual Media Geo-Localization and Video Recognition that I have co-edited have been published. Publications List of publications (sorted by year) My publications on Google Scholar Teaching ENS/INRIA Visual Recognition and Machine Learning Summer School, Paris, 22-26 July 2013 INRIA Visual Rec ogni tion and Machine Learning Summer School, Grenoble, 9-13 July 2012 ENS/INRIA Visual Recognition and Machine Learning Summer School, Paris, 25-29 July 2011 Computer Vision and Machine Learning Winter School, ENS Lyon, 24-28 January 2011 INRIA Visual Recognition and Machine Learning Summer School, Grenoble, 26-30 July 2010 Ecole Normale Supérieure de Paris / Ecole Normale Supérieure de Cachan Object Recognition and Computer Vision, Fall 2016 Object Recognition and Computer Vision, Fall 2015 Object Recognition and Computer Vision, Fall 2014 Object Recognition and Computer Vision, Fall 2013 Object Recognition and Computer Vision, Fall 201 2 Object Recognition and Computer Vision, Fall 2011 Object Recognition and Computer Vision, Fall 2010 Object Recognition and Computer Vision, Fall 2009 Object Recognition and Computer Vision, Fall 2008 (co-lecturing with J. Ponce, C. Schmid and I. Laptev) Students and Collaborators Post-docs: Mircea Cimpoi Jiri Sedlar Pierre-Yves Masse Phd students: Zongmian Li (co-advised with I. Laptev and N. Mansard) Dmitry Zhukov (co-advised with I. Laptev) Ignacio Rocco (co-advised with R. Arandjelovic) Antoine Miech (co-advised with I. Laptev) Julia Peyre (co-advised with I. Laptev and C. Schmid) Theophile Dalens (co-advised with M. Aubry) Jean-Baptiste Alayrac (co-advised with S. Lacoste-Julien and I. Laptev) Graduated: Dr. Maxime Oquab (Phd 2018, now researcher at Facebook AI Research ), co-advised with I. Laptev and L. Bottou Phd thesis: Convolutional neural networks: towards less supervision for visual recognition Dr. Petr Gronat (Phd 2017, now researcher at Avast Software), co-advised with T. Pajdla Phd thesis: Place Recognition by Per-Location Classifiers Dr. Piotr Bojanowski (Phd 2016, now researcher at Facebook AI Research ), co-advised with I. Laptev, J. Ponce and C. Schmid Phd thesis: Learning to annotate dynamic video scenes Dr. Guillaume Seguin (Phd 2016, now co-founder of regaind.io ), co-advised with I. Laptev Phd thesis: Person analysis in stereoscopic movies Dr. Mathieu Aubry (Phd 2015, now research faculty at ENPC ), co-advised with D. Cremers Phd thesis: Representing 3D models for alignment and recognition Dr. Vincent Delaitre (Phd 2015, now co-founder of deepomatic.com ), co-advised with I. Laptev Phd thesis: Modeling and Recognizing Interactions between People, Objects and Scenes Dr. Oliver Whyte (Phd 2012, now at Microsoft), co-advised with A. Zisserman and J. Ponce Phd thesis: Removing Camera Shake Blur and Unwanted Occluders from Photographs M.Sc. students: Zongmian Li, 2017 (co-advised with I. Laptev and N. Mansard) Dmitry Zhukov, 2017 (co-advised with I. Laptev and J.-P. Alayrac) Ignacio Rocco, 2016 (co-advised with R. Arandjelovic) Antoine Miech, 2016 (co-advised with I. Laptev and P. Bojanowski) Julia Peyre, 2015 (co-advised with I. Laptev and C. Schmid) Theophile Dalens, 2014 (co-advised with M. Aubry) Maxime Oquab, 2013 (co-advised with L. Bottou and I. Laptev) Tuang-Hung Vu, 2013 (co-advised with I. Laptev and A. Oliva) Piotr Bojanowski, 2012 (co-advised with I. Laptev and C. Schmid) Michael Mathieu, 2011 (co-advised with I. Laptev) Guillaume Seguin, 2011 (co-advised with I. Laptev) Ugo Jardonnet, 2010 (co-advised with T. Cour and I. Laptev) Jose Lezama, 2010 (co-advised with I. Laptev) Vincent Delaitre, 2010 (co-advised with I. Laptev) Warith Harchaoui, 2009 (co-advised with I. Laptev) Mathieu Prevot, 2008 (co-advised with B. Russell) Oliver Whyte, 2008 (co-advised with A. Zisserman) Jan Knopp, visiting student, 2008 (co-advised with T. Pajdla) Former collaborators: Relja Arandjelovic (post-doctoral fellow, 2014-2016, now at Google DeepMind ) Andrei Bursuc (post-doctoral fellow, 2015-2016, now at Safran Tech ) Visesh Chari (post-doctoral fellow, 2012-2014, now at Amazon Lab126 ) Karteek Alahari (post-doctoral fellow, 2010-2013, now researcher at Inria Grenoble ) Nicolas Maisonneuve (Research Engineer, 2013, founder of Cityscoring ) Mikel Rodriguez (post-doctoral fellow, 2010-2011 , now at MITRE ) Neva Cherniavsky (post-doctoral fellow, 2009-2010, now at B road Institute ) Bryan Russell (post-doctoral fellow, 2008-2010, no w at Adobe Research ) Professional activities Senior Fellow, Canadian Institute of Advanced Research (CIFAR), Learning in Machines & Brains program Program co-chair of ICCV 2015 Advisory board member, Computer Vision Foundation Area Chair: CVPR 2011, ICCV 2011, ECCV 2012, CVPR 2013, ICCV 2013, ICCV 2017, CVPR 2018, ECCV 2018 Journal editorial board: IJCV , IEEE TPAMI Co-organizer: INRIA/ENS summer schools of Visual Recognition and Machine Learning , 2010-2013 Co-organizer: Workshop on Action Recognition and Pose Estimation in Still Images (ECCV’12) Co-editor of IJCV special issues on “ Visual Media Geo-Localization ” and “ Video Representations for Visual Recognition ” Demos Object Retrieval in Videos Person Retrieval in Videos Web-scale particular object and building search Efficient Deblurring for Shaken and Partially Saturated Images Software Probabilistic latent semantic analysis - used in ( Sivic et al., ICCV’05 ). Extended version was included in this short course . Using multiple segmentations to discover objects and their extent in image collections Non-uniform deblurring for shaken images Efficient Deblurring for Shaken and Partially Saturated Images Automatic Alignment of Paintings and Photographs Depicting a 3D Scene Automatic mining of visual architectural elements Visual place recognition with repetitive structures Finding actors and actions in movies Painting recognition from wearable cameras Weakly Supervised Action Labeling in Videos Under Ordering Constraints Painting-to-3D Model Alignment Via Discriminative Visual Elements Seeing 3D chairs: exemplar part-based 2D-3D alignment using a large dataset of CAD models Learning and Transferring Mid-Level Image Representations using Convolutional Neural Networks Weakly supervised object recognition with convolutional neural networks NetVLAD: CNN architecture for weakly supervised place recognition Unsupervised learning from narra",
  "content_length": 17984,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:55"
}