{
  "name": "Joseph B. Evans",
  "homepage": "https://www.ittc.ku.edu/~evans",
  "status": "success",
  "content": "Home Page for Joseph B. Evans Joseph B. Evans Distinguished Professor Emeritus Electrical Engineering & Computer Science The University of Kansas Eaton Hall, 1520 West 15th Street Lawrence KS 66045-7621 Information & Telecommunication Technology Center The University of Kansas Nichols Hall, 2335 Irving Hill Road Lawrence, KS 66045-7559 Email: evans @ ittc.ku.edu Note - Dr. Evans has retired from KU and now serves in the Department of Defense Dr. Evans has retired from KU. He is now the Technical Director for 5G, reporting to the Under Secretary of Defense for Research and Engineering. General Information Schedule Research Interests National Research Policy The Computing Community Consortium DARPA Research The Strategic Technology Office Secure Handhelds on Assured Resilient networks at the tactical Edge (SHARE) Geospatial Cloud Analytics (GCA) Wide Area, Local Area, and Wireless Networks The SensorNet Initiative Global Environment for Network Innovations (GENI) CogNet - An Experimental Protocol Stack for Cognitive Radio Networks and Its Integration with the Future Internet Innovative Active Networking Services Rapidly Deployable Radio Networks Performance Tuning Study and Tools for Computer Systems Connected to the DREN MAGIC Gigabit Testbed ACTS ATM Internetwork Wirelesss ATM Adaptive Voice/Data Networks Adaptive Voice/Data Networks Networked Data Management and Control Systems DARPA Tactical Ground Reporting System (TIGR) Ambient Computational Environments ENABLE Delivery of K-12 Educational Resources via the Internet - UNITE High Performance Adaptive Processing Systems Adaptive Computing Systems FPGA Computing Systems National Science Foundation Programs Networking Technology and Systems (NeTS) Programmable Wireless Networking Teaching and KU Service Information EECS 888 - Internet Routing Architectures EECS 745 - Implementation of Networks EECS 546 - Integrated Circuit Design EECS 541/542 - Computer Systems Design I/II KU Task Force on Research Computing (KU Only) Commercial Interests Ascend Intelligence NetGames USA Ambient Computing Biographical Information and Resume Short Biography Publications and Citations Resume: PDF PGP Key Other Interests Aviation Sailing Skiing First version: 19 January 1993 Last updated: 28 December 2019",
  "content_length": 2275,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:56"
}