{
  "name": "Joseph J. Boutros",
  "homepage": "http://www.josephboutros.org",
  "status": "success",
  "content": "JOSEPH JEAN BOUTROS Â [ HomeÂ  |Â  Publications Â |Â  Biography and CV Â | Â The Channel Coding Page ] JOSEPH JEAN BOUTROS Error-Correcting Codes, Sphere Packing and Lattices, and Communication Theory Â Â Â Â Â Â âThe intelligence and precision of Science serve the beauty of Art.â â Joseph J. Boutros I am Professor of Electrical and Computer Engineering at Texas A&M University at Qatar. Previously, I was Associate Professor at Ecole Nationale Superieure des Telecommunications, ENST, Paris, France, a.k.a. Telecom Paris. My main area of expertise is Coding Theory. Here, Coding refers to error-correcting codes, not to the area of programming and developing software. Coding Theory is strongly linked to Information Theory and Digital Communications. For my background in this area, I got my first training as an intern at Philips Research Lab (Laboratoire d'Electronique Philips) in Paris in 1991. I defended my Ph.D. in 1996 on lattices for fading channels, an unusual Ph.D. work which is half way between Mathematics and Electrical Engineering. Later, I was interested in turbo codes, these are parallel Markovian machines good for almost all channels, including the multiple-antenna channel and the multiple-access channel. Also, I designed in 2004-2006 a special turbo code that reaches the highest possible minimum distance (logarithmic in the code length). In the last decade, my research was dedicated to codes on graphs, e.g. root-LDPC codes published in 2010 and to new families of lattices efficiently-decodabe in high dimensions and capable of attaining Shannon capacity at asymptotic dimensions, e.g. LDA and GLD lattices in 2012-2019. Modern coding deals with codes on graphs and their iterative decoding. The word \"codes\" stands for both error-correcting codes and lattices. Usual error-correcting codes are vector spaces over finite fields. Lattices are free modules over rings in Euclidean spaces. I am also interested in applications of error-correcting codes and lattices in the field of post-quantum cryptography and machine learning (a.k.a. Artificial Intelligence by the public). Contact Information Prof. Joseph J. Boutros Texas A&M University at Qatar c/o Qatar Foundation Education City, Texas Engineering Building 23874 Doha, Qatar Office phone +974-4423-0152 (Admin. Assistant) Fax +974-4423-0064 Email: mylastname -at- tamu -dot- edu Last update on Spring 2020",
  "content_length": 2398,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:05"
}