{
  "name": "Josep Ramon Morros",
  "homepage": "https://imatge.upc.edu/web/people/josep-ramon-morros",
  "status": "success",
  "content": "Josep Ramon Morros | Image Processing Group Skip to main content Image Processing Group Signal Theory and Communications Department Universitat Politècnica de Catalunya. BARCELONATECH People Publications Projects Demos Teaching Contact Search form Search User login Log in using UPC credentials Log in using UPC credentials Log in using UPC credentials Username * Password * Log in using UPC credentials Cancel CAS login Josep Ramon Morros Position e-mail Associate Professor ramon.morros@upc.edu Office Phone CN: D5-008 / EET: TR2-102 +34 937398979 Journals Books Conferences Theses Other Projects Research Demos Teaching Biography I received a degree in Physics from the Universitat de Barcelona (UB), Barcelona, Spain, in 1989, and a Ph.D. from the Universitat Politècnica de Catalunya (UPC) in 2004. From 1989 to 1994 I worked at several technological companies. From October 1994 to February 1997 I was teaching telecommunications at the UPC as an assistant professor. In 2003, I joined the UPC, where I am currently Associate Professor since 2012, and member of the Intelligent Data Science and Artificial Intelligence Research Center (IDEAI). I am lecturing in the areas of signal processing, computer vision and artificial intelligence in two degrees and in three official master's programs. I have advised more than 70 final degree projects, 25 final master projects and one PhD thesis. From 2013 to 2015 I was responsible for the degree of Audiovisual Systems at the Escola d'Enginyeria de Terrassa (EET, now ESEIAAT). Also, I am an elected member of the worker's council of academic personnel at the UPC. My research started in the field of video coding but in the last years I have been researching in image, video and 3D analysis, mainly with deep learning methods. My current research interests include multiview and 3D representations, object detection and tracking, activity recognition, incremental learning and efficient application of machine learning. I have applied this research in the fields of agri-food, smart mobility, computational biology, sports analytics and others. I’m currently advising two PhD students in the field of 3D image restoration and multidimensional signal processing. Since 1994 I have been involved in various European Projects (MAVT, MoMuSys, SIMILAR, CHIL, FascinatE, Eurofusion, AI4EU, ...) as a researcher from the Image and Video Processing Group at the UPC. I have acted as PI of the Spanish project PID2020-117142GB-I00 DeeLight. I have been PI at the UPC of at UPC in one Spanish project CENIT Vision-A3 (CDTI), in the EIT Urban Mobility project RideSafeUM, the European projects DISCO and SMARTIN, and in several contracts with companies like Abertis, Hewlett.-Packard, Visual Engineering, and Narada Robotics. In my research, I collaborate habitually with public organizations such as the Barcelona City Council or Transports Metropolitans de Barcelona and research institutes like CEAB-CSIC or CERTH. I am acting regularly as technical committee member in numerous conferences, with a \"Best reviewer Award\" at EUSIPCO 2015, and I have chaired one session at DSP 2013. Also, I am peer-reviewing for various indexed journals. Furthermore, I have participated in evaluation benchmarks and challenges, and I was Leader of the “2D Face tracking task” in the CLEAR2007 evaluations. I have collaborated in dissemination activities like interviews in newspapers, the ciutadan.ia course and the AI video capsules, both oriented at general, non-scientific audiences. Identifiers: orcid.org/0000-0002-1395-487X,     Researcher ID: F-8227-2013,     Scopus Author ID: 35587745500 Social media: Journal Articles top 2026 A. Seguí, Ugalde, A., Fichtner, A., Ventpsa, S., and Morros, J. R., “DASPack: Controlled Data Compression for Distributed Acoustic Sensing”, Geophysical Journal International, vol. 244, no. 1, 2026.DOI Google Scholar BibTex (4.32 MB) 2025 A. Manjabacas, Chic, O., García-Ladona, E., Tuset, V. M., Morros, J. R., Sayrol, E., Martí-Puig, P., Forest, J., Vasconcelos, J., and Lombarte, A., “Twenty years of AFORO: New developments and connections enhancing otolith research”, Fisheries Research, vol. 281, 2025.DOI Google Scholar BibTex 2024 J. Gené-Mola, Ferrer-Ferrer, M., Hemming, J., Dalfsen, P., Hoog, D., Sanz-Cortiella, R., Rosell-Polo, J. R., Morros, J. R., Vilaplana, V., Ruiz-Hidalgo, J., and Gregorio, E., “AmodalAppleSize_RGB-D dataset: RGB-D images of apple trees annotated with modal and amodal segmentation masks for fruit detection, visibility and size estimation”, Data in Brief, vol. 52, 2024.DOI Google Scholar BibTex 2023 J. Gené-Mola, Ferrer-Ferrer, M., Gregorio, E., Blok, P. M., Hemming, J., Morros, J. R., Rosell-Polo, J. R., Vilaplana, V., and Ruiz-Hidalgo, J., “Looking behind occlusions: A study on amodal segmentation for robust on-tree apple fruit size estimation”, Computers and Electronics in Agriculture, vol. 209, 2023.DOI Google Scholar BibTex (9.02 MB) M. Ferrer-Ferrer, Ruiz-Hidalgo, J., Gregorio, E., Vilaplana, V., Morros, J. R., and Gené-Mola, J., “Simultaneous Fruit Detection and Size Estimation Using Multitask Deep Neural Networks  ”, Biosystems Engineering, vol. 233, pp. 63-75, 2023.DOI Google Scholar BibTex (10.36 MB) see all Book Chapters and Bookstop 2007 M. Aguilar, Alcober, J., Altes, J., Aragones, X., Artigas, D., Bardes, D., Barlabe, A., Bragos, R., Calderer, J., Cardama, A., Casademont, J., Casals, L., Comerón, A., Cotrina, J., Cruz, L., Dios, F., Duxans, H., Esparza, O., Esquerra, I., Garcia, D., Garcias, P., Gomez, C., Gorricho, J., Guinjoan, F., Hesselbach, X., Liria, A., López, J., Madrenas, J., Madueño, M., Mestre, F., Monte, E., Morros, J. R., Muñoz, J., Pallarés, E., Pons, J., Recolons, J., Rincon, D., Riu, P., Pradell, L., Pascual-Iserte, A., Prat, L., Rey, F., and Villares, J., Diccionari de Telecomunicacions. 2007.Google Scholar BibTex 2006 J. Luque, Morros, J. R., Garde, A., Anguita, J., Farrús, M., Macho, D., Marqués, F., Martínez, C., Vilaplana, V., and Hernando, J., “Audio, Video and Multimodal Person Identification in a Smart Room”, in Lecture notes in computer science - Multimodal Technologies for Perception of Humans, vol. 4122, 2006, pp. 258–269.DOI Google Scholar BibTex (321.95 KB) Conference Papers top 2024 D. Reixach and Morros, J. R., “Fast unsupervised tensor restoration via low-rank deconvolution”, in IEEE International Conference on Image Processing (ICIP), Abu Dhabi, 2024.DOI Google Scholar BibTex A. Seguí, Ugalde, A., Ventosa, S., and Morros, J. R., “Lossless and Lossy Compression for Distributed Acoustic Sensing Using Inter-channel Predictions”, in SSA Photonic Seismology 2024, Vancouver, 2024.Google Scholar BibTex 2023 J. Gené-Mola, Felip-Pomés, M., Net-Barnés, F., Morros, J. R., Miranda, J. C., J. Satorra, A., L. Jones, A., J. Sanahuja, L., Ruiz-Hidalgo, J., and Gregorio, E., “Video-Based Fruit Detection and Tracking for Apple Counting and Mapping”, in IEEE International Workshop on Metrology for Agriculture and Forestry (MetroAgriFor), 2023.DOI Google Scholar BibTex (680.49 KB) J. R. Morros, Broquetas, A., Mateo, A., Puig, J., and Davins, M., “Real-time lane classification and accident detection for safer micromobility”, in 11th Internationa Congress on Transportation Research, Heraklion, Crete, 2023.Google Scholar BibTex (2.28 MB) 2020 A. Puig-Sitjes, Jakubowski, M., Fellinger, J., Drewelow, P., Gao, Y., Niemann, H., Sunn-Pedersen, T., König, R., Naujoks, D., Winter, A., Laqua, H., Dumke, S., Moncada, V., Belafdil, C., Mitteau, R., Aumeunier, M. - H., Pisano, F., Aymerich, E., Cannas, B., Kocsis, G., Szepesi, T., Cseh, G., Szabolics, T., Casas, J., Morros, J. R., Salembier, P., Clemente, R., Cobos, M., Caminal, I., A. Corral, P., A. Punzano, M., and S. Lopera, Q., “Strategy for the real-time detection of thermal events on the plasma facing components of Wendelstein 7-X”, in 31st Symposium on Fusion Technology (SOFT2020), Dubrovnik, Croatia, 2020.Google Scholar BibTex see all Theses top 2017 M. Maceira, “Multi-view depth coding based on a region representation combining color and depth information”, Universitat Politècnica de Catalunya (UPC), 2017.Google Scholar BibTex (15.24 MB) 2004 J. R. Morros, “Optimization of Segmentation Based Video Sequence Coding Techniques: Application to Content Based Functionalities”, Universitat Politècnica de Catalunya (UPC), 2004.Google Scholar BibTex Other top 2014 R. Llorca Queralt, “Automatic Human Detection and Tracking for Robust Video Sequence Annotation”. 2014.Google Scholar BibTex Ms Thesis 1996 P. Salembier, Marqués, F., Corset, I., Bouchard, L., Jeannin, S., Pardàs, M., Morros, J. R., Meyer, F., and Marcotegui, B., “Segmented Picture Coding Method and System and Corresponding Decoding Method and System”, U.S. Patent 964009161-1996.Google Scholar BibTex (2.27 MB) Patent Projects top Collaborative heterogeneous 3D scene representations for Urban Mobility National Sep 2025 Aug 2028 DeeLight: Efficient Deep Learning for Video Sequences and Point Clouds National Sep 2021 Aug 2025 Generación automática de estadísticas y vídeos para la mejora deportiva de equipos semiprofesionales mediante IA Other Jan 2023 Jun 2024 Advanced active safety solutions for micro-mobility vehicles European Jan 2022 Dec 2023 Image processing for Plasma Facing Components protection European Jan 2019 Dec 2022 see all Research Areas top Deep learning Internal Jun 2014 Dec 2020 Multiview Coding Internal Jul 2010 Jul 2018 Demos and Resources top AI4EU Grape Dataset Dataset Nov 2021 Additional results for \"Action Tube Extraction based 3D-CNN for RGB-D Action Recognition\" Results May 2018 Spatio-Temporal Road Detection from Aerial Imagery using CNNs - Dataset Dataset Dec 2016 PROMEDS Additional results Results Jul 2012 Panoramic TV Control Demo Jun 2012 see all Teaching top Acronym Title Level College PAE Advanced Project in Science and Telecommunication Technologies (CDIO) 3rd year Telecom BCN - ETSETB ASPTA Advanced Signal Processing: Tools and Applicati",
  "content_length": 10417,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:54"
}