{
  "name": "Josef Kittler",
  "homepage": "https://www.surrey.ac.uk/people/josef-kittler",
  "status": "success",
  "content": "Prof Josef Kittler | University of Surrey This website uses cookiesSome of these cookies are necessary and are used to help make our site work. With your consent, we will also use cookies to improve your experience, analyse site usage and assist in our marketing efforts. By clicking 'Accept all', you consent to our use of cookies.You can learn more about these cookies and manage your preferences at any time on our cookies page .Necessary Necessary These cookies enable essential website functions and ensure the site operates properly. They do not store personally identifiable information. While you can disable them in your browser settings, some features may not function correctly.Analytics Analytics These cookies help us understand how visitors interact with our website by collecting anonymous usage data. We use this information to improve website performance and enhance your experience.Personalisation Personalisation These cookies allow us to customise the content you see based on your activity, such as the courses you view, applications you make, or your location. This helps us provide a more relevant and tailored experience when using our site.Marketing Marketing These cookies deliver personalised ads based on your browsing activity and help us measure the effectiveness of our advertising campaigns. Accept all Manage preferences Save preferences Reject all Professor Josef Kittler Distinguished Professor +44 (0)1483 689294 j.kittler@surrey.ac.uk25 BA 00Academic and research departments Centre for Vision, Speech and Signal Processing (CVSSP), School of Computer Science and Electronic Engineering. AboutBiographyI have been a Research Assistant in the Engineering Department of Cambridge University (1973--75), SERC Research Fellow at the University of Southampton (1975-77), Royal Society European Research Fellow, Ecole Nationale Superieure des Telecommuninations, Paris (1977--78), IBM Research Fellow, Balliol College, Oxford (1978--80), Principal Research Associate, SERC Rutherford Appleton Laboratory (1980--84) and Principal Scientific Officer, SERC Rutherford Appleton Laboratory (1985).I also worked as the SERC Coordinator for Pattern Analysis (1982), and was Rutherford Research Fellow in Oxford University, Dept. Engineering Science (1985).I joined the Department of Electrical Engineering of Surrey University in 1986 as a Reader in Information Technology, and became Professor of Machine Intelligence in 1991 and gained the title Distinguished Professor in 2004. Expand biography Affiliations and memberships IEEE Transactions Served as a member of the Editorial Board of IEEE Transactions on Pattern Analysis and Machine Intelligence during 1982-85. Currently serving on the Editorial Boards of Pattern Recognition Letters, Pattern Recognition and Artificial Intelligence, Pattern Analysis and Applications. International Association for Pattern Recognition (IAPR) Served on the Governing Board of the International Association for Pattern Recognition (IAPR) as one of the two British representatives during the period 1982-2005. President of the IAPR during 1994-1996. Currently a member of the KS Fu Prize Committee of IAPR.News 06 APR 2022Surrey research enables AI tools for policing and security 24 NOV 2020Five reasons to study for a masters in AI at Surrey ResearchResearch interestsI have worked on various theoretical aspects of pattern recognition, image analysis and computer vision, and on many applications including:System identificationAutomatic inspectionECG diagnosisMammographic image interpretationRemote sensingRoboticsSpeech recognitionCharacter recognition and document processingImage codingBiometricsImage and video database retrievalSurveillance.Contributions to statistical pattern recognition include k-nearest neighbour methods of pattern classification, feature selection, contextual classification, probabilistic relaxation and most recently to multiple expert fusion. In computer vision my major contributions include robust statistical methods for shape analysis and detection, motion estimation and segmentation, and image segmentation by thresholding and edge detection.I have co-authored a book with the title `Pattern Recognition: a statistical approach' published by Prentice-Hall and published more than 500 papers. Expand research interests Indicators of esteemReceived Best Paper awards from the Pattern Recognition Society, the British Machine Vision Association and IEE.Received ``Honorary Medal'' from the Electrotechnical Faculty of the Czech Technical University in Prague in September 1995 for contributions to the field of pattern recognition and computer vision.Elected Fellow of the International Association for Pattern Recognition in 1998.Elected Fellow of Institution of Electrical Engineers in 1999.Received Honorary Doctorate from the Lappeenranta University of Technology, Finland, for contributions to Pattern Recognition and Computer Vision in 1999.Elected Fellow of the Royal Academy of Engineering, 2000.Received Institution of Electrical Engineers Achievements Medal 2002 for outstanding contributions to Visual Information Engineering.Elected BMVA Distinguished Fellow 2002.Received, from the Czech Academy of Sciences, the 2003 Bernard Bolzano Honorary Medal for Merit in the Mathematical Sciences.Awarded the title Distinguished Professor of the University of Surrey in 2004.Appointed as Series Editor for Springer Lecture Notes in Computer Science 2004.Awarded the KS Fu Prize 2006, by the International Association for Pattern Recognition, for outstanding contributions to Pattern Recognition (the prize awarded biennially).Received Honorary Doctorate from the Czech Technical University in Prague in 2007, on the occasion of the 300th anniversary of its foundation.Awarded the IET Faraday Medal 2008. Expand indicator of esteem PublicationsFatemeh Nazarieh, Josef Kittler, Muhammad Awais Rana, Diptesh Kanojia, Zhenhua Feng (2024)StableTalk: Advancing Audio-to-Talking Face Generation with Stable Diffusion and Vision Transformer, In: Apostolos Antonacopoulos, Subhasis Chaudhuri, Rama Chellappa, Cheng-Lin Liu, Saumik Bhattacharya, Umapada Pal (eds.), Pattern Recognitionpp. 271-286 Springer Nature SwitzerlandDOI: 10.1007/978-3-031-78172-8_18Audio-to-talking face generation stands at the forefront of advancements in generative AI. It bridges the gap between audio and visual representations by generating synchronized and realistic talking faces. Despite recent progress, the lack of realism in animated faces, asynchronous audio-lip movements, and computational burden remain key barriers to practical applications. To address these challenges, we introduce a novel approach, StableTalk, leveraging the emerging capabilities of Stable diffusion models and vision Transformers for Talking face generation. We also integrate the Re-attention mechanism and adversarial loss to improve the consistency of facial animations and synchronization with a given audio input. More importantly, the computational efficiency of our method has been notably enhanced by optimizing operations within the latent space and dynamically adjusting the focus on different parts of the visual content based on the provided conditions. Our experimental results demonstrate the superiority of StableTalk over the existing approaches in image quality, audio-lip synchronization, and computational efficiency.Ali Akbari, Muhammad Awais, Manijeh Bashar, Josef Kittler (2021)A Theoretical Insight Into the Effect of Loss Function for Deep Semantic-Preserving Learning, In: IEEE transaction on neural networks and learning systems34(1)pp. 119-133 IEEEDOI: 10.1109/TNNLS.2021.3090358Good generalization performance is the fundamental goal of any machine learning algorithm. Using the uniform stability concept, this article theoretically proves that the choice of loss function impacts the generalization performance of a trained deep neural network (DNN). The adopted stability-based framework provides an effective tool for comparing the generalization error bound with respect to the utilized loss function. The main result of our analysis is that using an effective loss function makes stochastic gradient descent more stable which consequently leads to the tighter generalization error bound, and so better generalization performance. To validate our analysis, we study learning problems in which the classes are semantically correlated. To capture this semantic similarity of neighboring classes, we adopt the well-known semantics-preserving learning framework, namely label distribution learning (LDL). We propose two novel loss functions for the LDL framework and theoretically show that they provide stronger stability than the other widely used loss functions adopted for training DNNs. The experimental results on three applications with semantically correlated classes, including facial age estimation, head pose estimation, and image esthetic assessment, validate the theoretical insights gained by our analysis and demonstrate the usefulness of the proposed loss functions in practical applications.Sergio Sanchez Santiesteban, Sara Atito, Muhammad Awais, Yi-Zhe Song, Josef Kittler (2024)Improved Image Captioning Via Knowledge Graph-Augmented Models, In: ICASSP 2024 - 2024 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP 2024)pp. 4290-4294 Institute of Electrical and Electronics Engineers (IEEE)DOI: 10.1109/ICASSP48485.2024.10447637Multimodal foundation models, pre-trained on large-scale data, effectively capture vast amounts of factual and commonsense knowledge. However, these models store all their knowledge within their parameters, requiring increasingly larger models and training data to capture more knowledge. To address this limitation and achieve a more scalable and modular integration of knowledge, we propose a novel knowledge graph-augmented multimodal model. This approach enables a base multimodal model to access pertinent information from an ex",
  "content_length": 427701,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:55"
}