{
  "name": "Joseph N. Wilson",
  "homepage": "http://www.cise.ufl.edu/~jnw/test",
  "status": "success",
  "content": "J.N. Wilson: Who is He, Really? - J.N. Wilson: Who is He, Really? Joseph N. Wilson CISE Comp. Sci. Guy. I'm an Emeritus Professor associated with the University of Florida's Computer & Information Science & Engineering Department. I taught classes at UF from the fall semester of 1984 through the spring semester of 2025. I received my Ph.D. in Computer Science from the University of Virginia Department of Computer Science in 1985. I was Associate Chair of the UF CISE Department from late 1994 through August of 2001 and Graduate Program Director from 2022 until 2025. I was the faculty advisor for the University of Florida Student Information Security Team. My interests have been quite varied. Most of my research has been associated with the detection and remediation of land mines and other unexploded buried hazards. I am currently exploring how to help small utility providers improve their resilience to cyber attacks and natural disasters. University of Florida Century Tower , photographer uncredited source Teaching Over the years I've taught a number of classes. I thought they were all interesting and I hope some of my students thought so too. You can see a comprehensive list of courses I've taught since 1994. Publications Recent publications: A.S. Yadav, J.N. Wilson, \"R+R Security Vulnerability Dataset Quality is Critical,\" 2024 Annual Computer Security Applications Conference (ACSAC), 1047-1061. A.S. Yadav, J.N. Wilson, \"BOSS: A Dataset to Train ML-based Systems fo Repair Programs with Out-of-bounds Write Flaws,\" Proceedings of the 5th ACM/IEEE International Workshop on Automated Program Repair, 2024. J.N. Wilson, F. Toska, M. Levental, P.J. Dobbins, \"A deep neural network model for hazard classification,\" Artificial Intelligence and Machine Learning in Defense Applications, Proceedings of SPIE. Vol. 11169, 2019. D.B. Gonsalves, J.N. Wilson, \"Path reconstruction from nontraditional sensor information using subgraph isomorphism algorithms,\" Detection and Sensing of Mines, Explosive Objects, and Obscured Targets XXIV, Proceedings of SPIE Vol. 11012, 2019. J.M. Malof, D. Reichman, A. karem, H. Frigui, KC Ho, J.N. Wilson, W-H Lee, W.J. Cummings, L.M. Collins, \"A large-scale multi-institutional evaluation of advanced discrimination algorithms for buried threat detection in ground penetrating radar,\" IEEE Transactions on Geoscience and Remote Sensing, 57(9), ppg 6928-2945, 2019. J. Abdullah, W. Garcia, C. Peeters, P. Traynor, K.R.B. Butler, J.N. Wilson, \"Practical hidden voice attacks against speech and speaker recognition systems,\" Network and Distributed Systems Security (NDSS) Symposium 2019, San Diego, CA, 2019. A more comprehensive list of publications is available from Google Scholar along with all those metrics and such. Research Recent Funded Research Projects: Algorithm and Decision Support for Multisensor Handheld Explosive Hazard Detec- tion Systems, U.S. Army Night Vision Electronics Sensors Directorate, $1,057,332.00, PI: J.N. Wilson, CoPI: P.D. Gader, CoPI: A. Banerjee Active Topic-Learning-Based Legal EDiscovery, UF International Center for Auto- mated Information Research, $62,500, Co-PI: Daisy Wang, Co-PI: J.N. Wilson A more comprehensive list of funded research projects is available.",
  "content_length": 3255,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:09"
}