{
  "name": "Joseph Hallett",
  "homepage": "https://research-information.bris.ac.uk/en/persons/joseph-hallett",
  "status": "success",
  "content": "Joseph Hallett - University of Bristol View Scopus Profile Dr Joseph Hallett MEng, PhD Lecturer, School of Computer Science https://orcid.org/0000-0002-6146-9852 Emailjoseph.hallettbristol.acuk BS8 1UB Personal profile Research Groups and ThemesCyber Security Fingerprint Dive into the research topics where Joseph Hallett is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Decision-Making Computer Science 100% Security Expert Computer Science 73% Cybersecurity Computer Science 66% Case Study Computer Science 66% Decision Making Social Sciences 66% Password Computer Science 41% Knowledge Base Computer Science 33% Correspondence Bias Computer Science 33% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 13 Conference Contribution (Conference Proceeding) 5 Article (Academic Journal) 1 Commissioned report 1 Conference Abstract 3 More 1 Conference Paper 1 Article (Specialist Publication) 1 Other contribution Research output per year Research output per year Playing in the Sandbox: A Study on the Usability of SeccompAlhindi, M. & Hallett, J., 10 Aug 2025, SOUPS '25: Proceedings of the Twentieth USENIX Conference on Usable Privacy and Security. Association for Computing Machinery (ACM), 16 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Why is Johnny Getting Groomed in Roblox?Chan, A., Hallett, J. & Edwards, M., 14 May 2025, In: IEEE Security and Privacy. 23, 3, p. 20-30 11 p.Research output: Contribution to journal › Article (Academic Journal) › peer-review Open AccessFile Educational Game 100% 115 Downloads (Pure) RTFM: How hard are IoT platform providers making it for their developersBaldrian, A. & Hallett, J., 22 Nov 2024, CPSIoTSec '24: Proceedings of the Sixth Workshop on CPS&IoT Security and Privacy. Association for Computing Machinery (ACM), p. 14-26 13 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Contribution (Conference Proceeding) Open Access Internet-Of-Things 100% Security Feature 75% Password 25% Security Standard 25% View all 23 research outputs Projects 6 Finished Projects per year Using DSbD in practice: is it a piece of CHERI-cake?Hallett, J. (Principal Investigator)1/09/22 → 1/01/23Project: Research Using DSbD in practice: is it a piece of CHERI-cake?Hallett, J. (Principal Investigator)1/09/22 → 30/09/24Project: Research Using DSbD in practice: is it a piece of CHERI-cake?Hallett, J. (Principal Investigator)1/09/22 → 1/01/23Project: Research, Parent View all 6 projects",
  "content_length": 2958,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:04"
}