{
  "name": "Jose Dolz",
  "homepage": "https://www.etsmtl.ca/Professeurs/jdolz",
  "status": "success",
  "content": "Dolz, José - ÉTS Montréal Accueil Étudier à l'ÉTS Corps professoral Dolz, José José Dolz Professeur Département Département de génie logiciel et TI Formation B.Sc., M.Sc. (Université polytechnique de Valence), Ph.D. (Université de Lille 2) Bureau A-3417 Courriel Jose.Dolz@etsmtl.ca Unités de recherche Visiter le site web de : LIVIA – Laboratoire d'imagerie, de vision et d'intelligence artificielle Visiter le site web de : itechsanté – Institut de recherche et d'innovation en technologies pour la santé Axe de recherche Technologies de la santé Expertises Segmentation d’images Analyse d’images médicales Apprentissage machine Apprentissage profond Apprentissage faiblement supervisé Vision par ordinateur Cours MTI865 Apprentissage profond pour la vision par ordinateur 3 crédits Automne 2025 Encadrements Thèse de doctorat (recherche appliquée) En codirection avec : Christian DesrosiersPrivacy Preservation in Medical Image Analysis, par Ngoc Bach KimAutomne 2023En codirection avec : Hervé LombaertLearning with Uncertainty in Medical Image Segmentation, par Sukesh Adiga VasudevaÉté 2024En codirection avec : Jose DolzAdvancing Brain MRI Assessment Using Generative Models, par Farzad BeizaeeAutomne 2025En codirection avec : Jose DolzGeneralized Few-Shot Learning, par Seyed Mohammadsina HajimiriHiver 2026En codirection avec : Jose DolzConstraint-Based Calibration for Reliable Deep Learning Models, par Balamurali MurugesanHiver 2026En codirection avec : Jose DolzNovel Continual Test-Time Adaptation Methods for Deep Models, par Shambhavi MishraHiver 2026En codirection avec : Jose DolzLearning Methods for Efficient and Robust Adaptation in Dynamic Environments, par Ichrak ShiliHiver 2026 Mémoire à 30 crédits En codirection avec : Jose DolzSegmentation d’images médicales semi-supervisée par curriculum via l’inférence des boîtes englobantes, par Bruce Cyusa MukamaAutomne 2021En codirection avec : Jose DolzOn Domain-Incremental Learning Methods and its Applications to Forgery Detection, par Julien NicolasÉté 2023En codirection avec : Christian DesrosiersDeep Learning Methods for Open-Vocabulary Segmentation, par Kunal MahathaAutomne 2025 Projet d'application à 15 crédits Développement de modèles multimodaux fondamentaux pour l'imagerie médicale, par Paul MerceurAutomne 2025Augmenter l’adaptabilité inter-domaines des modèles de segmentation d’images à l’aide de pseudo-labels optimisés par des seuils de binarisation individuels, par Jauffray BrunetonÉté 2020Combinaison du \"prompt-driven learning\" et du \"few-shot parameter-efficient fine-tuning\" dans le cadre des modèles de fondation pour la segmentation médicale, par Arthur LeclercqAutomne 2023Développement d’un assistant conversationnel multi-tâches pour faciliter la création de design et la collaboration, par Baptiste VieraÉté 2024 Projet d'intervention en entreprise à 15 crédits En codirection avec : Jose DolzImplémentation d'un système de diagnostic intelligent à partir de mesures du mouvement des yeux, par Tiphaine DiotÉté 2020En codirection avec : Jose DolzPassage à l’échelle de modèles d’apprentissage incrémental basés sur la mémoire humaine, par Julie GalliereÉté 2021En codirection avec : Jose DolzDéveloppement d’un moteur de recherche et d’un système de recommandation pour une plateforme e-commerce avec des techniques d’apprentissage machine, par Elias ThouantÉté 2022Analyse et reconstruction de l'état de la mer par apprentissage automatisé : application aux voiliers de compétition, par Ronan GabrielHiver 2024Logiciel de détection par intelligence artificielle dans le cadre de recherche de victimes en montagne, par Timothée MathieuHiver 2024En codirection avec : Jose DolzAugmentation de données pour réseaux de neurones dans le domaine du contrôle non destructif sur des images acquises par ultrason, par Léa BilletÉté 2024 Stage industriel et rapport technique, 3 cr. Augmentations de données acquises par ultra-sons dans le cadre d'entraînements de modèle de segmentation en contrôle non destructif, par Léa BilletÉté 2024 Publications Article publié dans une revue, révisé par les pairs 49 Farzad Beizaee, Gregory A. Lodygensky, Chris L. Adamson, Deanne K. Thompson, Jeanie L. Y. Cheong, Alicia J. Spittle, Peter J. Anderson, Christian Desrosiers, Jose Dolz. 2025 « Harmonizing flows: Leveraging normalizing flows for unsupervised and source-free MRI harmonization ». Medical Image Analysis vol. 101Franco Matzkin, Agostina Larrazabal, Diego H. Milone, José Dolz, Enzo Ferrante. 2025 « Towards reliable WMH segmentation under domain shift: An application study using maximum entropy regularization to improve uncertainty estimation ». Computers in Biology and Medicine vol. 196 , nº Part ABalamurali Murugesan, Sukesh Adiga Vasudeva, Bingyuan Liu, Herve Lombaert, Ismail Ben Ayed, Jose Dolz. 2025 « Neighbor-aware calibration of segmentation networks with penalty-based constraints ». Medical Image Analysis vol. 101Julio Silva-Rodríguez, Hadi Chakor, Riadh Kobbi, Jose Dolz, Ismail Ben Ayed. 2025 « A Foundation Language-Image Model of the Retina (FLAIR): Encoding expert knowledge in text supervision ». Medical Image Analysis vol. 99Julio Silva-Rodríguez, Hadi Chakor, Riadh Kobbi, Balamurali Murugesan, Waziha Kabir, Jihed Chelbi, Marc-André Racine, Jose Dolz, Ismail Ben Ayed. 2025 « Parameter-efficient fine-tuning of ophthalmology foundation models for robust hypertensive retinopathy detection and triage ». Investigative Ophthalmology & Visual Science vol. 66 , nº 8Julio Silva-Rodríguez, Jose Dolz, Ismail Ben Ayed. 2025 « Towards foundation models and few-shot parameter-efficient fine-tuning for volumetric organ segmentation ». Medical Image Analysis vol. 103Sukesh Adiga V, Jose Dolz, Herve Lombaert. 2024 « Anatomically-aware uncertainty for semi-supervised image segmentation ». Medical Image Analysis vol. 91H. Chakor Dj, W. Kabir, R. Kobbi, J. Chelbi, M. A. Racine, J. St-Jacques, D. Schwirtz, L. Madteossian, J. Dolz, I. Ben Ayed. 2024 « An AI-assisted system for classification and triage of diabetic retinopathy (DR) by using real-world fundus images ». Diabetes Research and Clinical Practice vol. 209 , nº Suppl. 1H. Chakor Dj, W. Kabir, R. Kobbi, J. Chelbi, M. A. Racine, J. St-Jacques, D. Schwirtz, L. Madteossian, J. Dolz, I. Ben Ayed. 2024 « Hybrid classification of hypertensive retinopathy (HR) in general population based on artificial intelligence ». Diabetes Research and Clinical Practice vol. 209 , nº Suppl. 1Hadi Chakor, Waziha Kabir, Riadh Kobbi, Jihed Chelbi, Marc-André Racine, Julio Silva-Rodríguez, Balamurali Murugesan, Jose Dolz, Ismail Ben Ayed. 2024 « AI-assisted automated screening of retinal anomalies in OCT Images: A deep learning approach ». Investigative Ophthalmology & Visual Science vol. 65 , nº 7Kazim Z. Gumus, Julien Nicolas, Dheeraj R. Gopireddy, Jose Dolz, Seyed Behzad Jazayeri, Mark Bandyk. 2024 « Deep learning algorithms for bladder cancer segmentation on multi-parametric MRI ». Cancers vol. 16 , nº 13W. Kabir, H. Chakor, R. Kobbi, J. Chelbi, M. A. Racine, J. St-Jacques, D. Schwirtz, L. Madteossian, I. Ben Ayed, J. Dolz. 2024 « An AI-assisted system for screening of diabetic macular edema (DME) by using real-world fundus images ». Diabetes Research and Clinical Practice vol. 209 , nº Suppl. 1W. Kabir, R. Kobbi, J. Chelbi, M. A. Racine, H. Chakor Dj, I. B. Ayed, J. Dolz, J. St-Jacques, L. Madteossian, D. Schwirtz. 2024 « An AI-assisted system for early screening of age-related macular degeneration (ARMD) from real-world fundus images ». Diabetes Research and Clinical Practice vol. 209 , nº Suppl. 1Bingyuan Liu, Jose Dolz, Adrian Galdran, Riadh Kobbi, Ismail Ben Ayed. 2024 « Do we really need dice? The hidden region-size biases of segmentation losses ». Medical Image Analysis vol. 91Shambhavi Mishra, Balamurali Murugesan, Ismail Ben Ayed, Marco Pedersoli, Jose Dolz. 2024 « Do not trust what you trust: Miscalibration in semi-supervised learning ». Transactions on Machine Learning Research vol. 2024Balamurali Murugesan, Julio Silva-Rodriguez, Hadi Chakor, Riadh Kobbi, Waziha Kabir, Jihed Chelbi, Marc-Andre Racine, Jose Dolz, Ismail Ben Ayed. 2024 « Domain generalization for diabetic retinopathy grading through vision-language foundation models ». Investigative Ophthalmology & Visual Science vol. 65 , nº 7Julio Silva-Rodriguez, Hadi Chakor, Riadh Kobbi, Balamurali Murugesan, Waziha Kabir, Jihed Chelbi, Marc-Andre Racine, Jose Dolz, Ismail Ben Ayed. 2024 « All that glitters is not gold: are current retina foundation models able to efficiently detect hypertensive retinopathy? ». Investigative Ophthalmology & Visual Science vol. 65 , nº 7Farzad Beizaee, Michele Bona, Christian Desrosiers, Jose Dolz, Gregory Lodygensky. 2023 « Determining regional brain growth in premature and mature infants in relation to age at MRI using deep neural networks ». Scientific Reports vol. 13 , nº 1Bingyuan Liu, Christian Desrosiers, Ismail Ben Ayed, Jose Dolz. 2023 « Segmentation with mixed supervision: Confidence maximization helps knowledge distillation ». Medical Image Analysis vol. 83Balamurali Murugesan, Bingyuan Liu, Adrian Galdran, Ismail Ben Ayed, Jose Dolz. 2023 « Calibrating segmentation networks with margin-based label smoothing ». Medical Image Analysis vol. 87Sukesh Adiga V, Jose Dolz, Herve Lombaert. 2022 « Attention-based dynamic subspace learners for medical image analysis ». IEEE Journal of Biomedical and Health Informatics vol. 26 , nº 9. p. 4599-4610Mathilde Bateson, Hoel Kervadec, Jose Dolz, Hervé Lombaert, Ismail Ben Ayed. 2022 « Source-free domain adaptation for image segmentation ». Medical Image Analysis vol. 82Soufiane Belharbi, Jérôme Rony, Jose Dolz, Ismail Ben Ayed, Luke McCaffrey, Eric Granger. 2022 « Deep interpretable classification and weakly-supervised segmentation of histology images via max-min uncertainty ». IEEE Transactions on Medical Imaging vol. 41 , nº 3. p. 702-714A. Galdran, H. Chakor, W. Kabir, R. Kobbi, B. Liu, J. Dolz, I. Ben Ayed. 2022 « An auto",
  "content_length": 35915,
  "method": "requests",
  "crawl_time": "2025-12-01 13:34:39"
}