{
  "name": "Joshua Bakita",
  "homepage": "https://mbzuai.ac.ae/study/faculty/joshua-bakita",
  "status": "success",
  "content": "Joshua Bakita - MBZUAI MBZUAI About About Leadership and Governance Alumni Mission Faculty Directory Fast Facts Office of the President Office of the Provost Study Study Graduate Admission Process Undergraduate Admission Process Faculty Directory Aspire Ph.D. Fellowship Program Master in Applied Artificial Intelligence (MAAI) Master’s Programs Ph.D. Programs Undergraduate Program Undergraduate Research Internship Program University Catalogue Research Research Computer Vision Research Machine Learning Research Natural Language Processing Projects Research Centers Innovate Innovate Consulting Incubation and Entrepreneurship Center Institute of Digital Public Health Institute of Foundation Models Office of Public Affairs and Alumni Relations Partnerships and Collaborations Training Programs Student Resources Undergraduate Academic Calendar Graduate Academic Calendar Campus Facilities Career Services and Internships Publications Repository Educational Affairs Library Portal Office of the Registrar Campus Map News & Events Commencement Events Media Center The Node | Stories of MBZUAI MBZUAI Nexus | The Global AI Research & Knowledge Network Apply now Home / Faculty directory / Joshua Bakita Joshua Bakita Assistant Professor of Computer Science Research Interests Professor Bakita's research interests include GPU Scheduling, Real-Time Systems and Operating Systems. Professor Bakita’s research has had a significant impact on the real-time systems community. His GPU management libraries and tools have been downloaded over 15,000 times, with adoption by institutions such as Carnegie Mellon University, Tsinghua University, Virginia Tech, National University of Singapore, TU Munich, and Alibaba, among many others. Email Share Prior to joining MBZUAI, Professor Bakita received his Ph.D. in Computer Science from the University of North Carolina at Chapel Hill, where his research focused on enabling efficient and time-predictable real-time systems on GPUs through advanced scheduling and partitioning techniques. He has published in all three of the top real-time systems venues—RTSS, ECRTS, and RTAS—and received the Outstanding Paper Award at RTAS for his work on GPU partitioning. His approach emphasizes practical, systems-level solutions, informed by experience working on GPU performance optimization at Waymo, GM Research, and Microsoft. Ph.D. in Computer Science from the University of North Carolina at Chapel Hill Master of Science in Computer Science from the University of North Carolina at Chapel Hill Bachelor of Science in Computer Science from the University of North Carolina at Chapel Hill Outstanding Paper Award, Real-Time and Embedded Technology and Applications Symposium (RTAS), 2023; Teaching Assistant of the Year, University of North Carolina at Chapel Hill, 2019 His current work continues to focus on improving the predictability and efficiency of GPU-based systems, with new efforts extending into consumer, cloud, and formally verified embedded systems. Selected publications: J. Bakita and J. H. Anderson, \"The Advantage of the GPU as a Real-Time AI Accelerator,\" Real-Time Systems (Journal), 2025. J. Bakita and J.H Anderson, \"Hardware Compute Partitioning on NVIDIA GPUs,\" Proceedings of the 29th IEEE Real-Time and Embedded Technology and Applications Symposium (RTAS), pp. 54-66, May 2023. Winner, outstanding paper award. J. Bakita, J. H. Anderson, \"Enabling GPU Memory Oversubscription via Transparent Paging to an NVMe SSD,\" Proceedings of the 43rd Real-Time Systems Symposium (RTSS), pp. 370-382, Dec 2022. LinkedIn ORCID Profile Contact faculty affairs Interested in working with our renowned faculty? Fill out the below form and we will get back to you. Please enable JavaScript in your browser to complete this form.Name *Organization *Phone number *Email *Message *Checkboxes *I consent to receive communication from MBZUAISubmitSubmit x We use cookies We use necessary and analytics cookies to operate our website, analyze traffic, and improve your experience. By continuing to use this website, you agree to our use of cookies. Learn more Got it",
  "content_length": 4109,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:24"
}