{
  "name": "Joshua A. Kroll",
  "homepage": "https://www.jkroll.com",
  "status": "success",
  "content": "Joshua A. Kroll | jkroll.com Joshua A. Kroll Computer Scientist, Hacker, Recovering Physicist Home Research Publications Teaching CV Contact Welcome! I'm a computer scientist and researcher interested in the governance of automated decision-making systems, especially those built with machine learning. I'm a Postdoctoral Research Scholar at UC Berkeley's School of Information, working with Deirdre Mulligan. I received a PhD in Computer Science in the Security Group at Princeton University, which is an important part of Computer Science history. My dissertation on Accountable Algorithms was advised by Edward W. Felten and supported by the Center for Information Technology Policy where I studied many topics in security, privacy, and how technology informs policy decisions. For a time, I was also advised by Andrew Appel and worked on memory safety and software security. The following facts about me may or may not interest you: I received the National Science Foundation Graduate Research Fellowship in 2011. For many years, I traveled to Boston each fall to perform Improbable feats of engineering. I got married to my secret high-school crush in 2012. Deeper in the past, I attended a small college near Boston, MA where I spent a lot of time playing with technology and making it accessible to the masses. Prior to that, I grew up in Monterey, CA where I can recommend a good dentist. It was there that I got my start as a Computer Scientist, and experienced the inner workings of government. I do occasional consulting work on policy and practical issues in algorithmic accountability. If you'd like to know more, please contact me. I don't always blog, but when I do, you can find my ramblings linked from the publications page. You might also find me making birdcalls online from time to time. You can also find a more formal bio and headshot here. Bio & Headshot Joshua A. Kroll is a computer scientist studying the relationship between governance, public policy, and computer systems. Currently, Joshua is a Postdoctoral Research Scholar at the School of Information at the University of California at Berkeley. His research focuses on how technology fits within a human-driven, normative context and how it satisfies goals driven by ideals such as fairness, accountability, transparency, and ethics. He is most interested in the governance of automated decision-making systems, especially those using machine learning. His paper \"Accountable Algorithms\" in the University of Pennsylvania Law Review received the Future of Privacy Forum's Privacy Papers for Policymakers Award in 2017. Joshua's previous work spans accountable algorithms, cryptography, software security, formal methods, Bitcoin, and the technical aspects of cybersecurity policy. He also spent two years working on cryptography and internet security at the web performance and security company Cloudflare. Joshua holds a PhD in computer science from Princeton University, where he received the National Science Foundation Graduate Research Fellowship in 2011. Headshots: small, large Research I'm interested in a broad swath of topics in and outside of security (computer and otherwise), privacy (online and otherwise), and related questions in public policy. I'm also strongly interested in cryptography. My dissertation research was on Accountable Algorithms, and tools for bridging technical assurances with human oversight. For more information, you should contact me. Publications Peer-reviewed Publications Jacobs, A. Z., J. A. Kroll, and A. Smart. “Unsafe at Any AUC: Unlearned Lessons from Sociotechnical Disasters for Responsible AI”. (In Submission) Jatho, E. W., L. O. Mailloux, E. D. Williams, P. McClure, and J. A. Kroll. “Concrete Safety for ML Problems: Systems Safety for ML Development and Assessment”. (In Submission) Rismani, S., Shelby, R., Smart, A., Jatho, E., Kroll, J., Moon, A. and Rostamzadeh, N., 2023, April. “From plane crashes to algorithmic harm: applicability of safety engineering frameworks for responsible ML”. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems. [PDF] Jatho, E. W., L. O. Mailloux, S. Rismani, E. D. Williams, and J. A. Kroll. “System Safety Engineering for Social and Ethical ML Risks: A Case Study”. NeurIPS Workshop on Machine Learning Safety, December 2022. (Best System Safety Paper) [PDF] Kroll, J. A., “ACM TechBrief: Facial Recognition”, ACM TechBriefs, Issue 2, Feb. 2022. [PDF] Carter, T., J. A. Kroll, and J. B. Michael. “Lessons Learned Applying the NIST Privacy Framework”. IEEE IT Professional. Vol. 23, Iss. 4 (2021). [Available Online via Government Purpose Rights] Kroll, J. A., J. B. Michael, and D. B. Thaw. “Enhancing Cybersecurity via Artificial Intelligence: Risks, Rewards, and Frameworks”. IEEE Computer, Volume 54, Issue 6. June, 2021. [Online] Kroll, J. A., “Outlining Traceability: A Principle for Operationalizing Accountability in Computing Systems”, Conference on Fairness, Accountability, and Transparency, March 2021. [PDF] Mulligan, D., J. A. Kroll, N. Kohli, and R. Wong, “This Thing Called Fairness: Disciplinary Confusion Realizing a Value in Technology”, Computer Supported Cooperative Work (CSCW’19), November 2019. [PDF] Luckie, M., R. Beverly, R. Koga, K. Keys, J. A. Kroll, and k. claffy, “Network Hygiene, Incentives, and Regulation: Deployment of Source Address Validation in the Internet”, ACM Conference on Computer and Communications Security (CCS’19), November 2019. [PDF] Kroll, J. A., N. Kohli, and P. Laskowski, “Privacy in Polystores: A Data Management Research Agenda”, VLDB Workshop on Polystore Systems (POLY’19), August 2019. [PDF] Bruening, P. and J. A. Kroll, “Considering Transparency: AI, Data Science and the GDPR.” Computers, Privacy, and Data Protection, January 2019. Kroll, J. A. “The Fallacy of Inscrutability.” Philosophical Transactions of the Royal Society A Vol. 376 No. 2133, 2018. [Online] Kroll, J. A. “Data Science Data Governance.” IEEE Security & Privacy, Volume 16, Issue 6. November 2018. [PDF] Desai, D. and J. A. Kroll. \"Trust But Verify: A Guide to Algorithms and the Law\", Harvard Journal of Law and Technology. Vol 31, Issue 1. 2018. [PDF] Kroll, J. A., Huey, J., Baroas, S., Felten, E. W., Reidenberg, J. R., Robinson, D. G., and Yu, H. \"Accountable Algorithms\" University of Pennsylvania Law Review, Vol. 165, Issue 3. 2017. [SSRN] [PDF]2016 Future of Privacy Forum Privacy Papers for Policymakers Award Bonneau, J., Miller, A., Clark, J., Narayanan, A., Kroll, J., and Felten, E., \"SoK: Bitcoin and second-generation cryptocurrencies\", 36th IEEE Symposium on Security and Privacy, San Jose, CA, May 18-20 [PDF] Kroll, J., Felten, E., and Haldermann, J. A., \"Efficiently Auditing Multi-Level Elections\", 6th International Conference on Electronic Voting (EVOTE 2014), Lochau, Austria, October 28-31, 2014 [PDF] Edmundsen, A., Simpson, A.K., Kroll, J., and Felten, E., \"Security Audit of Safeplug 'Tor in a Box'\", 4th USENIX Workshop on Free and Open Communication on the Internet (FOCI 2014), San Diego, CA, August 18, 2014.[PDF] Clark, J., Bonneau, J., Felten, E., Kroll, J., Miller, A., and Narayanan, A., \"On Decentralizing Prediction Markets and Order Books\", Thirteenth Workshop on the Economics of Information Security (WEIS 2014), State College, PA, June 23-24 2014. [PDF] Kroll, J., Stewart, J., and Appel, A. \"Portable Software Fault Isolation\". Computer Security Foundations, 2014 (CSF 2014), Vienna, Austria, July 19-22 2014. [PDF] Kroll, J., Felten, E., and Boneh, D. \"Secure Protocols for Accountable Warrant Execution\". Preprint. [PDF] Goldfeder, S., Bonneau, J., Felten, E., Narayanan, A., \"Securing Bitcoin Wallets with Threshhold Signatures\". Preprint. [PDF] Bonneau, J., Narayanan, A., Miller, A., Clark, J., and Kroll, J. \"Mixcoin: Anonymity for Bitcoin with accountable mixes,\" Financial Cryptography, 2014 (FC 2014), Bridgetown, Barbados, March 3-7 2014. [PDF (full version)] Kroll, J., Davey, I., and Felten, E., \"The Economics of Bitcoin Mining, or Bitcoin in the Presence of Adversaries\", The Twelfth Workshop on the Economics of Information Security (WEIS 2013), Washington, DC, June 10-11 2013. [PDF] Kroll, J. and D. Dean, “BakerSFIeld: Bringing Software Fault Isolation to the x64,” SRI Computer Science Laboratory Technical Report, 2009. [PDF] Martell, C. and J. Kroll, “Corpus-Based Gesture Analysis: An extension of the FORM dataset for the automatic detection of phases in a gesture”, Int. J. Semantic Computing, 1(4): 521-536 (2007). [PDF] [Journal Page] Martell, C. and J. Kroll, “Using FORM to Predict Phase Labels”, Proceedings of the Language Resources and Evaluation Conference, Workshop on Multimodal Corpora, Genoa, Italy, 27 May 2006. [PDF] Dissertation Kroll, J. Accountable Algorithms (Doctoral Dissertation). Princeton University. 2015. [Library, PDF] Public Policy Publications and Regulatory Filings Barocas, S., Felten, E., Huey, J., Kroll, J., and Narayanan, A. \"Big Data and Consumer Privacy in the Internet Economy\". Comment to the NTIA Big Data Request for Comments, 79 Fed. Reg. 32714. August 5, 2014. [PDF] Other Publications Technical Reports Kroll, J. A. and V. Berzins, “Understanding, Assessing, and Mitigating Safety Risks in Artificial Intelligence Systems”. Naval Postgraduate School Technical Report, NPS-CS-22-003. December, 2022. [Report Page] Popular Articles Jatho, E and J. A. Kroll, “Artificial Intelligence: Too Fragile to Fight”, Proceedings of the US Naval Institute, Feb. 2022. First Prize, USNI Information Warfare Essay Contest. [Available Online by Government Purpose Rights] Felten, E., and Kroll, J. \"Heartbleed Shows Government Must Lead on Internet Security\". Scientific American, 16 April 2014. [article] Kroll, J. \"The Cyber Conundrum\". The American Prospect. 1 June 2015. [article] Kroll, J. \"The Cyber Conundrum: A Security Update\". The American Prospect Online. 3 June 2015. [article] ",
  "content_length": 15412,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:22"
}