{
  "name": "Joshua Ellul",
  "homepage": "http://staff.um.edu.mt/joshua.ellul",
  "status": "success",
  "content": "Prof. Joshua Ellul MOV.W R12,R5 CALL #malloc MOV.W R6,R15 AND.W #0xFF,R15 AND.W #0xFF00,R6 SWPB R6 ADD.W R15,R6 MOV.W R7,R14 AND.W #0xFF00,R14 SWPB R14 AND.W #0xFF,R7 RLA.W R7 MOV.W R12,R11 MOV.W R12,R9 ADD.W R5,R11 SUB.W #8,R11 POP R5 MOV.W SP,0x0006(R11) MOV.W R11,R13 Prof. Joshua Ellul Associate Professor with the Department of Computer Science and the Centre for Distributed Ledger Technologies University of Malta joshua(DOT)ellul(AT)um(DOT)edu(DOT)mt     Bio Affiliation Funding Qualifications Supervision Professional Activities Publications Talks Lecturing My research interests are focused around the following domains: * Blockchain, DLT, Smart Contracts, and Cryptocurrencies * Technology and AI Regulation * Applications of AI * Internet of Things I am interested in both technical as well as multidisciplinary aspects. Current specific technical research avenues in the above domains I am interested in include: * Unconventional virtual machine design * Unconventional architectural design * Easier programming abstractions and tools (programming paradigms, languages, verification) * Compliance tool generation using Generative AI, identifying trading patterns, illicit account detection Current multidisciplinary research avenues in the above domains I am interested in include: * Regulatory technology and the regulation of technology - especially emerging technology (AI, digital identity, Blockchain, NFTs, Metaverse etc) * Smart contracts vs Legal contracts and working towards Legal Smart Contracts Blockchain is a multi-disciplinary area that will affect many different domains, we have therefore set up a multi-disciplinary Masters in the Centre for Distributed Ledger Technologies. If you are interested in any of the above or related areas please get in touch! Associate Professor within the Department of Computer Science and the Centre for Distributed Ledger Technologies, University of Malta Previous Affiliations: Chairman of the Malta Digital Innovation Authority Post-doctoral Researcher in the Department of Computing and The Hamlyn Centre, Imperial College London Post-doctoral Researcher in the BlueZ Computing team at IBM Research Zurich Principal Investigator - VinoVeritas: An authority-to-consumer Wine Audit Solution Budget: EUR 478,411 Co-investigator - WIDE: Web3 Identity Integration for DAOs and Education Budget: EUR 117,000 Co-investigator - Systematising Smart Contracts within Classical Contract Law Theory Budget: EUR 60,000 Principal Investigator - SmartMaritime Budget: EUR 20,000 Blockchain and DLT Scholarship Scheme Budget: EUR 300,000 Co-investigator - NATIFLife Budget: 225,225 Ph.D. University of Southampton (in the School of Electronics and Computer Science) M.Sc. Pervasive Computing, University of Kent (in the School of Computing) B.Sc. I.T. (Hons.) University of Malta (in the Faculty of ICT) PhD Students Ben Biedermann Digital Identity and Small States Co-Supervised with: Dr Alexander Apostolides Crypto / CBDCs / SSI Daniel Busuttil Blockchain and Aviation Co-Supervised with: Dr Robert Camilleri Blockchain / Aviation Previous PhD Students Adrian Mizzi Macro-programming Techniques for the Internet of Things and Blockchain Co-Supervisor: Prof Gordon Pace Blockchain / IoT / Compilers / Languages / DSLs / Low-Level Programming Masters Supervision Cyrus Malik Detecting Likely-Reputable Blockchain Projects Co-Supervisor: Dr Josef Bajada Blockchain / AI Martin Camilleri Investigating different levels of de/centralisation for blockchain transaction compliance Co-Supervisor: Prof. Gordon Pace Compliance / Blockchain / Smart Contracts Muona Benown Analysis of Funding for Maltese Technology Policy and Implementation Main Supervisor: Dr Annette Fath Lihic Policy / Technology Damian Cassar The Legal Ramifications of Blockchain-Based Smart Contracts: A Comparative Analysis of B2C2 Ltd v. Quoine Pte Ltd Blockchain Law / Smart Contracts / Legal Contracts Nichola Portelli Blockchain Accounting and Auditing in iGaming Blockchain / Accounting / Auditing Yanika Muscat Blockchain and Value Added Tax Blockchain / Tax Alex Zammit ZKPs and Smart contracts Co-Supervisor: Prof. Gordon Pace ZKP / Blockchain / Smart Contracts Ryan Falzon Unified Programming Models for Blockchain Decentralised Applications Co-Supervisor: Prof. Gordon Pace Blockchain / Smart Contracts / Programming Languages Karl Bezzina Blockchain Performance Metrics Co-Supervisor: Dr Conrad Attard Blockchain / Performance Dylan Vassallo Federated Learning and Blockchain Co-Supervisor: Dr Vince Vella Blockchain / AI Dan Chirtoaca Non-Fungible Tokens, Design and Reusability Framework Co-Supervisor: Prof. George Azzopardi Blockchain / DLT / Smart Contract Steven Farrugia Ethereum Transaction Pattern Matching and Modelling Co-Supervisor: Prof. George Azzopardi Ethereum / Smart Contracts Patrick Massa Blockchain Technology in light of the General Data Protection Regulation Main Supervisor: Dr Mireille Caruana Blockchain / Law / GDPR Fthi Abadi (University of Groningen Student) Access Control Mechanisms for Blockchain and the Internet of Things Co-Supervisor: Prof George Azzopardi (University of Groningen) Blockchain / Smart Contracts / IoT Brian Zammit Memory Protection For Resource Constrained Devices Co-Supervisor: Prof Gordon Pace Compilers / Operating Systems / Low-Level Programming Noella Galea Brain Computer Intefaces for the Internet of Things Co-Supervisor: Dr Owen Falzon BCI / IoT Rebecca Kai Cassar (now Software Engineer at CS Technologies International) Peer-to-peer Web Caching Co-Supervisor: Dr Kevin Vella Distributed Systems / JavaScript Yonas Leguesse (now Expert in Network & Information Security at European Union Agency for Network and Information Security (ENISA)) Anti-Evasion Code Patching for Android Malware Sandboxes Main Supervisor: Dr Mark J Vella Security / Android / Operating Systems / Virtual Machines / Bytecode Undergrad Supervision Cyrus Malik Likely-Legal Cryptocurrency Transaction Detection Co-Supervisor: Dr Josef Bajada Cryptocurrency / Analytics Ivan Abramov Macroprogramming for Python-based Decentralised Applications Blockchain / dApps Michaela Galea Philosophical Aspects of Blockchain Main Supervisor: Dr Jean-Paul De Lucca Blockchain / Philosophy Michele Pagano Facilitating Illict Product Detection using Blockchain Blockchain / Supply Chain Francesca Duca Cryptocurrency Price Prediction Co-Supervisor: Dr Vincent Vella Cryptocurrency / Price Prediction Anthony Zammit Towards Seamless Multi-sig Wallet Management Cryptocurrency / Blockchain / Multi-sig Joseph Cefai Towards Seamless IoT and Blockchain Development IoT / Blockchain / Smart Contracts Stefano Schembri Cross-platform Smart Contract Development Blockchain / Smart Contracts Jacques Vella Critien Cryptocurrency Twitter Sentiment Analysis Co-Supervisor: Prof Albert Gatt Cryptocurrency / Sentiment Analysis Chris Frendo IoT and Robotics Dynamic Task Scheduling Co-Supervisor: Prof Saviour Zammit IoT / Robotics / Scheduling Sergiu Nimat Smart Contract Entity Framework Abstraction Layer Smart Contracts / Language Design Quentin Falzon IoT Co-Supervisor: Prof Carl J Debono IoT Matthew Vella On- and Off-Chain Codesign of Smart Contract dApp Systems Co-Supervisor: Prof Gordon Pace Blockchain / Smart Contracts Gabriel Camilleri Static Analysis of Smart Contracts using KeY Main Supervisor: Prof Gordon Pace Blockchain / Smart Contracts / Static Analysis Matthew Barthet Simulating Blockchain Systems Blockchain / Python / Simulation Brandon Abela Investigating Optimising Compilation using AI Main Supervisor: Dr Sandro Spina Compilers / AI Ella Lautier JavaScript Operating System Simulation of Memory Management Techniques Co-Supervisor: Dr Kevin Vella Operating Systems / HTML5 / JavaScript / Web Timothy Muscat An Android Dalvik Bytecode Interpreter for 16-bit Architectures Virtual Machines / Dalvik / Interpreters Michael Calleja JavaScript Operating System Simulation of Processes for Instructional Use Co-Supervisor: Dr Kevin Vella Operating Systems / HTML5 / JavaScript / Web Giancarlo Laferla (now Application Developer at RS2 Software) Extending Android's Binder as a basis for application monitoring Main Supervisor: Dr Mark J Vella Security / Android / Operating Systems / Virtual Machines / Bytecode Rebecca Kai Cassar (now Software Engineer at CS Technologies International) Abstracting Eventually Consistent Databases for Offline Web Application Usage Co-Supervisor: Dr Joseph Vella NoSQL Databases / JavaScript / HTML5 / PouchDB / CouchDB Leon Degiorgio (now Software Engineer at CCBill) Towards Offline Usage of JavaScript Web Applications Co-Supervisor: Dr Kevin Vella Web Programming / JavaScript / HTML5 Giulio Camilleri An LLVM Bitcode Interpreter for 16-bit MSP430 Microcontrollers Operating Systems / Virtual Machines / Compilers / Low-Level Programming / LLVM / MSP430 Isaac Chircop (now Software Developer at RS2 Software) Enabling .NET Web Applications for Offline Usage Web Programming / .NET Gabriella Azzopardi (now Project Associate at CERN and PhD student in the Department of Communications and Computer Engineering) Techniques for Facilitating Offline Cloud-Based Application Usage NoSQL Databases / Web Programming / PHP Aaron Axisa (now Software Architect at LottoStarlet) A Java Remote Code Update Mechanism Java / Bytecode / Software Management / Patching Associate Editor - IET Blockchain Journal Technical Program Committee - IEEE TrustCom-2025 (24th IEEE International Conference on Trust, Security and Privacy in Computing and Communications) Community Reviewer - Frontiers in Communications and Networks Book Proposal Reviewer - Manning Publications Programme Committee - 9th International Workshop on Cryptocurrencies and Blockchain Technology (CBT 2025) Reviewer - Financial Innovation Technical Propgram Committee - International Congress on Blockchain and Applications (BLOCKCHAIN'25) Reviewer - Computer Law & Security Review Reviewer - SN Computer Science Technical Program Committee - 6t",
  "content_length": 56132,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:25"
}