{
  "name": "Joshua Garcia",
  "homepage": "https://jgarcia.ics.uci.edu",
  "status": "success",
  "content": "Joshua Garcia @ UCI ​ Joshua Garcia Informatics Department 2442 Interdisciplinary Science and Engineering Building University of California, Irvine Irvine, CA 92697 Phone: 949-824-7003 Joshua Garcia is an Associate Professor in the Informatics Department of the Donald Bren School of Information and Computer Sciences (ICS) at the University of California, Irvine (UCI). His research interests are in software engineering. The key underlying theme of his research has been automated software analysis using three key methods: static program analysis, dynamic program analysis, and artificial intelligence (including machine learning). He also uses methods from empirical software engineering (e.g., mining software repositories) and qualitative methods (e.g., human studies and open coding) to inform the automated solutions he creates. He utilizes the above methods primarily for studying the following problem domains: (1) software testing and analysis of autonomous driving systems that operate autonomous vehicles (a.k.a. self-driving cars); (2) software vulnerability management (SVM), which is the collection of approaches, processes, and activities undertaken by software developers and security professionals to ensure the security and privacy of software systems and prevent or protect against associated attacks; and (3) the decay of software architectures. His research tools and datasets have been used by dozens of researchers, agencies, and companies around the world—including universities in Argentina, Australia, Brazil, Canada, China, Europe, and the United States, and by companies and government agencies such as Boeing, Bosch, Google, IBM, Microsoft, Northrop Grumman, the FBI, the Department of Homeland Security, and NASA. Recent PostsRecruiting PhD Students for 2025-2026 Admissions CycleOctober 10, 2025Promoted to Associate Professor With TenureJuly 9, 2025Paper accepted to ICSE 2026June 20, 2025A second paper accepted to USENIX Security 2025June 13, 2025Paper Accepted to USENIX Security 2025January 24, 2025Paper Accepted to FSE 2025January 14, 2025Awarded NSF CAREERJanuary 8, 2025Paper accepted to IEEE Symposium on Security and Privacy (Oakland 2025)September 9, 2024Our team is a winner in DARPA’s Building an Adaptive and Competitive Workforce Track.July 25, 2024Paper accepted to TSEMay 12, 2024Paper accepted to FSE 2024April 15, 2024Paper accepted to CHI 2024March 12, 2024Paper accepted to TSEAugust 15, 2023Paper accepted to ASAP 2023June 5, 2023Paper accepted to ICSE 2023February 15, 2023Paper Accepted to TOSEMSeptember 15, 2022Paper accepted to NDSS 2022December 30, 2021Paper Accepted to TSEFebruary 1, 2021Paper Accepted to ICSA 2021January 22, 2021Paper Accepted to ICSE 2021December 16, 2020Paper Accepted to ICSE 2020December 12, 2019Paper Accepted to ICSE 2019December 12, 2018NSF CRI grant for Constructing a Community-Wide Software Architecture InfrastructureAugust 8, 2018CV, Projects, Publications, and Service Pages UpdatedJuly 27, 2018Paper accepted to ASE 2018 on Self-Protection of Android Systems from Inter-Component Communication AttacksJuly 4, 2018Assistant Professor at UCI’s Department of InformaticsJuly 2, 2018Two papers accepted to ICSE 2018December 13, 2017Paper accepted to TOSEMNovember 1, 2017Paper presented at ESEC/FSE 2017September 8, 2017",
  "content_length": 3313,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:27"
}