{
  "name": "Joshua J. Daymude",
  "homepage": "https://search.asu.edu/profile/1903590",
  "status": "success",
  "content": "Joshua Daymude | ASU Search Joshua Daymude Assistant Professor, School of Computing and Augmented Intelligence Other ASU affiliations Biodesign Center for Biocomputing, Security and Society [email protected] 727 E Tyler St. Tempe, AZ 85281 Mail code: 7801 Campus: Tempe ‌ Long Bio Joshua J. Daymude is an assistant professor in the School of Computing and Augmented Intelligence with a joint appointment in the Biodesign Center for Biocomputing, Security, and Society. He researches algorithmic theory for the efficient coordination and characterization of collective emergent behavior in biological, social, and engineered complex systems. This interdisciplinary research leverages several areas of computer science — including distributed computing, stochastic processes, swarm intelligence, and bio-inspired algorithms — to contribute to theoretical immunology, microbiomic ecology, active matter physics, dynamic networks, and programmable matter systems. Daymude completed his doctorate in 2021 at the School of Computing, Informatics, and Decision Systems Engineering (CIDSE) at Arizona State University. Prior to his professorship, he was a Mistletoe Research Fellow at the Momental Foundation, a three-time ARCS Foundation Johnston Endowment Scholar, and a CIDSE Dean's Fellow. A full list of his research, publications, teaching, and awards can be found on his website. Education PhD. Computer Science, Arizona State University, 2021 B.S. Computer Science, Arizona State University, 2016 B.S. Mathematics, Arizona State University, 2016 Research Website URL http://jdaymude.github.io Google Scholar URL https://scholar.google.com/citations?hl=en&user=CQNOJjgAAAAJ Research Interests Programmable matter, active matter, self-organization, distributed algorithms, randomized algorithms, bio-inspired algorithms, swarm intelligence, stochastic processes, markov chain analysis. Research Group The Biodesign Center for Biocomputing, Security, and Society Previously: Self-Organizing Particle Systems Lab Publications See my website or CV for a complete list of publications. Teaching Website URL https://jdaymude.github.io/course/ Courses 2026 Spring Course Number Course Title CSE 450 Design&Analysis of Algorithms 2025 Fall Course Number Course Title CSE 599 Thesis CSE 792 Research CSE 790 Reading and Conference CSE 580 Practicum CSE 792 Research CSE 355 Intro Theoretical Computer Sci CSE 355 Intro Theoretical Computer Sci CSE 355 Intro Theoretical Computer Sci CSE 355 Intro Theoretical Computer Sci CSE 355 Intro Theoretical Computer Sci 2025 Summer Course Number Course Title CSE 792 Research 2025 Spring Course Number Course Title CSE 792 Research CSE 599 Thesis 2024 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 599 Thesis CSE 792 Research CSE 499 Individualized Instruction CSE 590 Reading and Conference CSE 580 Practicum CSE 492 Honors Directed Study CSE 355 Intro Theoretical Computer Sci CSE 355 Intro Theoretical Computer Sci CSE 355 Intro Theoretical Computer Sci CSE 355 Intro Theoretical Computer Sci CSE 355 Intro Theoretical Computer Sci CSE 355 Intro Theoretical Computer Sci CSE 355 Intro Theoretical Computer Sci 2024 Summer Course Number Course Title CSE 584 Internship 2024 Spring Course Number Course Title CSE 493 Honors Thesis CSE 599 Thesis CSE 792 Research CSE 799 Dissertation CSE 590 Reading and Conference CSE 499 Individualized Instruction CSE 599 Thesis CSE 799 Dissertation CSE 355 Intro Theoretical Computer Sci 2023 Fall Course Number Course Title CSE 492 Honors Directed Study CSE 599 Thesis CSE 792 Research CSE 499 Individualized Instruction CSE 590 Reading and Conference CSE 580 Practicum 2023 Summer Course Number Course Title CSE 584 Internship 2023 Spring Course Number Course Title CSE 599 Thesis CSE 792 Research CSE 799 Dissertation CSE 590 Reading and Conference CSE 599 Thesis CSE 799 Dissertation CSE 450 Design&Analysis of Algorithms 2022 Fall Course Number Course Title ASU 101-CSE The ASU Experience CSE 550 Combinatorial Algorithms/Intrt 2020 Fall Course Number Course Title CSE 550 Combinatorial Algorithms/Intrt",
  "content_length": 4097,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:25"
}