{
  "name": "Josh Reiss",
  "homepage": "http://www.eecs.qmul.ac.uk/~josh",
  "status": "success",
  "content": "Prof. Josh Reiss, Queen Mary, University of London Home News/Events Undergraduate Postgraduate PhD Research Staff Contact People > Dr Josh Reiss Contact Research Publications Teaching Prof Joshua D Reiss Contact Details Title:Professor in Audio Engineering Youtube channel: IntelligentSoundEng Blog: Intelligent sound engineering Twitter: @IntelSoundEng Email: joshua.reiss@qmul.ac.uk Research Group: Centre for Digital Music Head of Audio Engineering in the Centre for Digital Music President-Elect and Fellow of the Audio Engineering Society Visiting Professor at Birmingham City University Best paper / demo awards MATLAB Plugin Competition Gold Award Winner, 2020 Best paper award, SMC, 2017. Best JAES paper 2016 Best student paper AES 141, 2016 Best peer-reviewed paper, 134th AES Convention MIREX 1st place award, 2007 IEEE Transactions on Circuits and Systems I, best paper award nominee, 2005 Member of Technical Advisory Board to Tandem Launch Technologies Co-founder of Queen Mary spin-outs and high-tech start-ups LandR (formerly MixGenius), 2012. Tonz, 2020 (academic cofounder). Nemisindo, 2021. Royal Academy of Engineering Enterprise Fellowship 2012-13 Chair of the Audio Engineering Society (AES) Publications Policy Committee Twice recipient of the AES Board of Governors Award, 2009 and 2010 Biography Josh Reiss is a Professor with the Centre for Digital Music at Queen Mary University of London. He has published more than 200 scientific papers, and co-authored the book Intelligent Music Production, and textbook Audio Effects: Theory, Implementation and Application. He is the President-Elect and a Fellow of the Audio Engineering Society (AES). He co-founded the highly successful spin-out company, LandR, and recently formed the start-ups, Tonz and Nemisindo. His primary focus of research is on the use of state-of-the-art signal processing techniques for sound design and audio production. He maintains a popular blog, YouTube channel and twitter feed for scientific education and dissemination of research activities.",
  "content_length": 2045,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:24"
}