{
  "name": "Joshua A. Levine",
  "homepage": "https://jalevine.bitbucket.io",
  "status": "success",
  "content": "Joshua A. Levine I’m an associate professor in the Department of Computer Science at University of Arizona. I work with an awesome research group: Tanner Finken (PhD CS), Emiliano Islas (PhD CS), Md Afridi Hasan (MS CS), Jake Balla (MS CS), and Jackson Randolph (BS CS). I also co-mentor a fantastic postdoc, Zhimin Li, located at Vanderbilt University. Alumni of my group. I was a member of UA’s HDC Lab. Before joining UA, I used to profess at Clemson University. I am a postdoctoral alumnus of University of Utah’s Scientific Computing and Imaging Institute having worked with Valerio Pascucci and Ross T. Whitaker. I did my PhD at the Ohio State University with Tamal K. Dey and my undergraduate and MS at Case Western Reserve University with Michael S. Branicky. My short bio, google scholar, dblp, and cv. I research visualization and (less so these days) geometric modeling. Along the way, I use topological analysis, high-performance computing, and computer graphics. I write code for my research, including contributions to TTK, Cleaver, DelPSC, and DelIso. My recent work has been funded by:     NSF, as part of the New Frontiers of Sound (NewFoS) Science and Technology Center (DMR-2242925).     NSF, on our collaborative award Collaborative Research: CQIS: A Sound Leap (SouL) (CMMI-2204400).     DOE, on our collaborative project Neural Field Processing for Visual Analysis (DE-SC-0023319). Previous (now completed) funded projects:     NSF, on our collaborative award Neural Volume Visualization (IIS-2006710).     DOE, on my Early Career Research Program award Analyzing Multifaceted Scientific Data with Topological Analytics (DE-SC-0019039).     NSF, on our collaborative award Collaborative Research: Transforming Serendipity Elements from Theory to Practice (Former UA PI, Andrew Gillette) (DMS-1913094).     NSF, on our collaborative award Coupled Simulation and Mesh Generation using Computational Topology (IIS-1654221, previously IIS-1314757). News Nov 2, 2025 Best Paper award at 2025 IEEE Uncertainty Vis! May 7, 2025 Received the 2024-2025 Faculty Teaching Award! Apr 23, 2024 Received the 2023-2024 Faculty Service Award! Publications Nov 2, 2025 Seeing the Many: Exploring Parameter Distributions Conditioned on Features in Surrogates Nov 2, 2025 Topology Aware Neural Interpolation of Scalar Fields Jan 1, 2025 Localized Evaluation for Constructing Discrete Vector Fields Teaching Fall 2025 - CSC 444 - Data Visualization Spring 2025 - CSC 544 - Advanced Data Visualization Fall 2024 - CSC 444 - Data Visualization Spring 2024 - CSC 444 - Data Visualization ...More News ...More Publications ...More Teaching",
  "content_length": 2657,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:22"
}