{
  "name": "Joshua San Miguel",
  "homepage": "http://jsm.ece.wisc.edu",
  "status": "success",
  "content": "Prof. Joshua San Miguel - STACS Lab - University of Wisconsin-Madison Systems and Technologies Across the Computing Stack Eliminating inefficiencies in the modern computing stack and developing new paradigms (in circuits, architectures, systems, compilers, programming languages) for emerging applications. Prof. Joshua San Miguel Josh is an Associate Professor in the Department of Electrical and Computer Engineering at the University of Wisconsin-Madison, with an affiliate appointment in the Department of Computer Sciences. His research spans broadly across topics in computer architecture and systems. His specific interests lie in new paradigms such as approximate, stochastic and intermittent computing for energy-harvesting IoT devices as well as traditional architectures, ranging from microarchitectural topics (e.g., branch prediction, value prediction) to cache hierarchies and networks-on-chip for many-core processors. Prior to joining the University of Wisconsin-Madison, he received his PhD from the Edward S. Rogers Sr. Department of Electrical and Computer Engineering at the University of Toronto in 2017, under the supervision of Professor Natalie Enright Jerger. He is a recipient of the NSF CAREER Award in 2021. His research has garnered several honors, including the ISCA Best Paper Award in 2022 (and nomination in 2025) and two IEEE Micro Top Picks for his contributions to branch prediction and unary computing (and two honorable mentions for work on approximate computing and AI accelerators). In 2012, he received a BASc in Engineering Science with Honours (major in Electrical and Computer Engineering) at the University of Toronto. CV LinkedIn Google Scholar DBLP UW Comp Arch 2025/03: ISCA paper accepted 2025/02: Carat selected as an IEEE Micro Top Pick Honorable Mention 2025/01: NICE paper accepted 2024/05: Euro-Par paper accepted 2024/01: ACM TACO paper accepted 2023/11: ASPLOS 2024 paper accepted (check out our lightning talk) 2023/10: MICRO SRC 2023 posters accepted, congrats Shubha and Zhewen (gold medal)! 2022/09: DISCC 2022 paper accepted 2022/08: ACM TACO paper accepted 2022/03: ISCA 2022 papers accepted 2022/02: ACM TECS paper accepted 2022/01: YArch 2022 paper accepted, congrats Zhewen! 2021/10: HPCA 2022 papers accepted 2021/09: ASP-DAC 2022 paper accepted 2021/06: SC 2021 and ICPP-EMS 2021 papers accepted 2021/05: ISLPED 2021 paper accepted 2021/03: Co-organizing the 3rd Undergrad Architecture Mentoring (uArch) Workshop at ISCA 2021 2021/01: uGEMM selected as an IEEE Micro Top Pick 2020/12: IEEE D&T paper accepted 2020/11: HPCA 2021 paper accepted 2020/10: IEEE TCAD paper accepted 2020/09: ASP-DAC 2021 papers accepted 2020/09: MICRO SRC 2020 posters accepted, congrats Abhishek and Abhijith (bronze medal)! 2020/07: ACM TACO and NOCS 2020 papers accepted 2020/06: IEEE CAL paper accepted 2020/03: ISCA 2020 paper accepted (released our simulator for unary computing: UnarySim) 2020/02: DAC 2020 paper accepted 2020/02: Co-organizing the 2nd Undergrad Architecture Mentoring (uArch) Workshop at MICRO 2020 2019/11: HPCA 2020 paper accepted 2019/09: ASP-DAC 2020 paper accepted 2019/07: MICRO 2019 paper accepted (check out our lightning talk) 2019/05: ISLPED 2019 paper accepted 2019/04: Di and team selected as winners of Foxconn Smart Cities - Smart Futures Competition, congrats! 2019/04: ASPLOS SRC 2019 posters accepted, congrats Di, Giri and Mitali (bronze medal)! 2019/03: Di and team selected as finalists for Qualcomm Innovation Fellowship, congrats! 2019/01: DAC 2019 paper accepted 2019/01: Check out our chapter on Approximate Cache Architectures 2018/11: HPCA 2019 paper accepted (check out our lightning talk) 2018/07: MICRO 2018 paper accepted (check out our lightning talk) Research Stochastic Computingfor Ultra Low Power Building general-purpose unary computers using ultra-low-power stochastic circuits.More details here. UnconventionalProcessor Architectures Exploring and quantifying the marriage of eccentric new paradigms: stochastic, quantum, neuromorphic computing. Intermittent ComputingOn The Edge Designing energy-efficient intermittent hardware-software systems for the Internet of Everything. Cross-StackApproximate Computing Building low-power computer systems via intelligent hardware approximations and user-centric software interfaces. Safe and SecureData Communication Designing efficient interconnects for many-core processors that are free of deadlocks and information leakage. RevitalizedMicroarchitecture Bringing new life to old school microarchitectural techniques such as branch prediction and value prediction. Publications The XOR Cache: A Catalyst for Compression Zhewen Pan and Joshua San Miguel ACM/IEEE International Symposium on Computer Architecture (ISCA), June 2025 // Best Paper Award Honorable Mention [Paper] The Spatial Effect of the Pinna for Neuromorphic Speech Denoising Ranganath Selagamsetty, Joshua San Miguel and Mikko Lipasti IEEE Neuro-Inspired Computational Elements Conference (NICE), March 2025 [Paper] TaroRTL: Accelerating RTL Simulation using Coroutine-based Heterogeneous Task Graph Scheduling Dian-Lun Lin, Umit Ogras, Joshua San Miguel and Tsung-Wei Huang International European Conference on Parallel and Distributed Computing (Euro-Par), August 2024 [Paper] Camouflage: Utility-Aware Obfuscation for Accurate Simulation of Sensitive Program Traces Asmita Pal, Keerthana Desai, Rahul Chatterjee and Joshua San Miguel ACM Transactions on Architecture and Code Optimization (TACO), May 2024 [Paper] Carat: Unlocking Value-Level Parallelism for Multiplier-Free GEMMs Zhewen Pan, Joshua San Miguel and Di Wu ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), April 2024 // IEEE Micro Top Picks 2025 Honorable Mention // Distinguished Artifact Award [Paper] [Lightning] CAP'NN: A Class-Aware Framework for Personalized Neural Network Inference Maedeh Hemmat, Joshua San Miguel and Azadeh Davoodi ACM Transactions on Embedded Computing Systems (TECS), December 2022 [Paper] As-Is Approximate Computing Mitali Soni, Asmita Pal and Joshua San Miguel ACM Transactions on Architecture and Code Optimization (TACO), November 2022 [Paper] Characterizing Memory Side Channels in FHE Applications Asmita Pal, Karthik Swaminathan, Subhankar Pal and Joshua San Miguel Workshop on Data Integrity and Secure Cloud Computing (DISCC), October 2022 [Paper] NvMR: Non-Volatile Memory Renaming for Intermittent Computing Abhishek Bhattacharyya, Abhijith Somashekhar and Joshua San Miguel ACM/IEEE International Symposium on Computer Architecture (ISCA), June 2022 // Best Paper Award [Paper] uBrain: A Unary Brain Computer Interface Di Wu, Jingjie Li, Zhewen Pan, Younghyun Kim and Joshua San Miguel ACM/IEEE International Symposium on Computer Architecture (ISCA), June 2022 [Paper] uSystolic: Byte-Crawling Unary Systolic Array Di Wu and Joshua San Miguel IEEE International Symposium on High-Performance Computer Architecture (HPCA), April 2022 [Paper] Stay in Your Lane: A NoC with Low-Overhead Multi-Packet Bypassing Hossein Farrokhbakht, Paul Gratz, Tushar Krishna, Joshua San Miguel and Natalie Enright Jerger IEEE International Symposium on High-Performance Computer Architecture (HPCA), April 2022 [Paper] Streaming Accuracy: Characterizing Early Termination in Stochastic Computing Hsuan Hsiao, Joshua San Miguel and Jason Anderson Asia and South Pacific Design Automation Conference (ASP-DAC), January 2022 [Paper] In-Stream Correlation-Based Division and Bit-Inserting Square Root in Stochastic Computing Di Wu, Ruokai Yin and Joshua San Miguel IEEE Design and Test (D&T), December 2021 [Paper] SEEC: Stochastic Escape Express Channel Mayank Parasar, Natalie Enright Jerger, Paul Gratz, Joshua San Miguel and Tushar Krishna International Conference for High Performance Computing, Networking, Storage, and Analysis (SC), November 2021 // Best Paper Award Nominee [Paper] When Dataflows Converge: Reconfigurable and Approximate Computing for Emerging Neural Networks Di Wu and Joshua San Miguel IEEE International Conference on Computer Design (ICCD), Invited, October 2021 [Paper] AirNN: A Featherweight Framework for Dynamic Input-Dependent Approximation of CNNs Maedeh Hemmat, Joshua San Miguel and Azadeh Davoodi IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD), October 2021 [Paper] Ghostwriter: A Cache Coherence Protocol for Error-Tolerant Applications Henry Kao, Joshua San Miguel and Natalie Enright Jerger Workshop on Embedded Multicore Systems (ICPP-EMS), August 2021 [Paper] UNO: Virtualizing and Unifying Nonlinear Operations for Emerging Neural Networks Di Wu, Jingjie Li, Setareh Behroozi, Younghyun Kim and Joshua San Miguel ACM/IEEE International Symposium on Low Power Electronics and Design (ISLPED), July 2021 [Paper] uGEMM: Unary Computing for GEMM Applications Di Wu, Jingjie Li, Ruokai Yin, Hsuan Hsiao, Younghyun Kim and Joshua San Miguel IEEE Micro, May-June 2021 [Paper] [UnarySim] Pitstop: Enabling a Virtual Network Free Network-On-Chip Hossein Farrokhbakht, Henry Kao, Kamran Hasan, Paul Gratz, Tushar Krishna, Joshua San Miguel and Natalie Enright Jerger IEEE International Symposium on High-Performance Computer Architecture (HPCA), February-March 2021 [Paper] Normalized Stability: A Cross-Level Design Metric for Early Termination in Stochastic Computing Di Wu, Ruokai Yin and Joshua San Miguel Asia and South Pacific Design Automation Conference (ASP-DAC), January 2021 [Paper] Zero Correlation Error: A Metric for Finite-Length Bitstream Independence in Stochastic Computing Hsuan Hsiao, Joshua San Miguel, Yuko Hara-Azumi and Jason Anderson Asia and South Pacific Design Automation Conference (ASP-DAC), January 2021 [Paper] SHASTA: Synergic HW-SW Architecture for Spatio-Temporal Approximation Gokul Subramanian Ravi, Joshua San Miguel and Mikko Lipasti ACM Transactions on Architecture and Code Optimization (TACO), September 2020 [Paper] ",
  "content_length": 18602,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:28"
}