{
  "name": "Josiah D. Hester",
  "homepage": "http://josiahhester.com/cv",
  "status": "success",
  "content": "Josiah Hester | Associate Professor | Georgia Tech College of Computing Josiah Hester Associate Professor of Interactive Computing and Computer Science Director, Center for Advancing Responsible Computing College of Computing, Georgia Institute of Technology Director, Ka Moamoa â Ubiquitous and Mobile Computing Lab BIO: Im an Associate Professor in the College of Computing at Georgia Tech. My work focuses on reimagining computing for sustainability, with applications in healthcare, conservation interactivity and education. [My CV] [Google Scholar] [Videos] I direct Ka Moamoa at Georgia Tech, a multidisciplinary research lab working to reduce the carbon costs of computing, and design computing such that it is more sustainable, durable, and useful to all. We are motivated by global scale applications ranging from health wearables/implants to conservation, interaction, and education. We explore and develop new hardware designs, systems, interaction techniques, tools, curriculum, and programming abstractions so that anyone can learn about, design, debug, and deploy more sustainable computing systems that work despite frequent power failures, constrained resources, and unpredictable conditions. I work towards a sustainable future for computing informed by my Native Hawaiian (KÄnaka Maoli) heritage. I apply my work in the field of intermittent computing to large-scale sensing for sustainability and conservation, health wearables, and interactive devices. My work is supported by multiple grants from the NSF, NIH, ARPA-H, DARPA, DoD, 3M, VMware, and the Sloan Foundation. I won a Presidential Early Career Award for Scientists and Engineers (PECASE) in 2025, was named a Sloan Fellow in Computer Science, won my NSF CAREER and a VMware Early Career Faculty Award in 2022. I was named to Popular Scienceâs Brilliant 10, the AISES Most Promising Scientist, and won a 3M Non-Tenured Faculty Award in 2021. Press highlights: Popular Science, Scientific American, The Mirror, Washington Post, TechCrunch, Gizmodo, Bulletin of the Atomic Scientists, Independent, The Wall Street Journal, CNET, Communications of the ACM, BBC, Guinness Book of World Records, Seeker, ACM Tech News. Ongoing Research Projects Large-scale Sustainable Sensing: soil powered compute, sustainable cyber-infrastructure and data sovereignty. NSF CAREER: Adaptive Intermittent Computing: modular hardware, runtimes, tools. [Learn More] Mobile Health: smart face masks, wearable cameras, eating monitoring, and smoking detection Implantable Pharmacy: ovarian cancer treatment with implanted living cells, and sleep therapy. Carbon-aware IoT: carbon nutrition labels and design tools for Internet-of-Things and Edge devices. Sustainable Robotics: Energy harvesting flapping UAVs, soft recyclable actuators. Low/No Power Interactive Systems: interaction powered devices, a battery-free Game Boy, and Python or Block based programming for energy harvesting devices. I am always looking for motivated students and skilled postdoctoral scholars to join my lab. News (04/2025) Build4Ê»Äina Hackathon with Purple MaiÊ»a Foundation! and Nation of Hawaii! (01/2025) Honored to be selected for a Presidential Early Career Award for Scientists and Engineers (PECASE), the highest honor bestowed by the U.S. government on outstanding scientists and engineers early in their careers. (11/2024) TerraCell won first-place in the 2024 Prototypes for Humanity competition in the Energy category! (10/2024) Leading the bioelectronics effort for a $35 million ARPA-H effort fighting diabetes. (10/2024) We presented Kaona, a Hawaiian Futurism tabletop RPG game at CHI Play! (07/2024) A successful season complete of manoomin sensor check-ins with Wisconsin tribes. (06/2024) My former postdoc Nivedita Arora wins the ACM Doctoral Dissertation Award! (05/2024) Our work on manoomin conservation and tribal sovereignty discussed in the NYTimes and Mongabay! (05/2024) Our JMIR article on equity and wearables featured in Crain's Business, and on CBS News! (04/2024) Speaker for NSF CISE CAREER Workshop. See my slide deck, overleaf template, and my proposal! (03/2024) We led a Communications of the ACM review paper on intermittent computing! (01/2024) Dirt powered computing paper published in IMWUT and in the press. (12/2023) We had the honor of hosting Georgia Techâs President Angel Cabrera in our lab! (10/2023) New Large NSF Grant ($2 million) on carbon nutrition labels for IoT devices with Cornell and Harvard. (09/2023) Our lab is part of a $45 million ARPA-H effort to cut cancer deaths in half! Led by Rice University, with MD Anderson Cancer Center, CMU, Northwestern, and others on the project. (09/2023) John presented our award winning paper on Interaction Harvesting at ACM UbiComp! (07/2023) Tingyu presented on materials and computer systems challenges for transient devices at HotCarbon. (06/2023) Panelist for a plenary panel on equitable evaluation at ACM RESPECT. (06/2023) Rishabh presented our work on Batteryless flying things at DroNet. (05/2023) Keynote for the staff of the National Academies of Sciences, Engineering, and Medicine DEI Speaker Series. (05/2023) Stefany presented our EquityWare work, on inclusive design of wearables at ACM CHI. (03/2023) Protean named a SIGMOBILE Research Highlight, printed in GetMobile Magazine. (11/2022) We won the Best Position Paper Award at ENSsys for envisioning approaches to circularity in computing! (11/2022) Protean is presented at ACM SenSys 2022, the first major result from my NSF CAREER award! (10/2022) I was awarded a VMware Early Career Faculty Award! (09/2022) I gave a Keynote Address at the annual Tapia Celebration of Diversity in Computing Conference! (09/2022) After five formative years at Northwestern, I have joined Georgia Tech as an Associate Professor! (08/2022) NSF has funded our $5 million Coastlines and People regional Hub on sustainability! Focusing on Manoomin (wild rice) as a lynchpin of the ecosystem and indigenous led conservation! (05/2022) I wrote about inclusive, sustainable computing for United Nations DESA in the monthly SDG blog. (04/2022) ACM Tech News covers our work on enabling students to program batteryless devices with MakeCode. (02/2022) I was named a Sloan Fellow in Computer Science! (02/2022) I won my NSF CAREER Award on Intermittent Computing. (02/2022) National Science Foundation News covers our FaceBit project!. (01/2022) Quoted in the Washington Post about FaceBit and the future of excercise. (01/2022) Live interview with Sylvia Perez on Good Day Chicago (FOX32) about FaceBit! (01/2022) FaceBit, our smart face mask platform is covered by Scientific American, TechCrunch, and Gizmodo! (11/2021) Featured in the Bulletin of the Atomic Scientists for sustainable computing! (10/2021) Named one of two Outstanding Young Alumni by Clemson University's School of Engineering! (09/2021) Named to the Brilliant 10 by Popular Science for powering electronics without batteries! (09/2021) Battery-free Game Boy wins a Distinguished Paper Award at IMWUT/UbiComp 2021! (08/2021) I am the 2021 Most Promising Engineer or Scientist awarded by AISES! (08/2021) NSF CISE funds our CNS Small proposal on timekeeping for intermittent computing. (07/2021) NSF CISE funds our CNS Medium proposal on battery-free body networks with UMass collaborators. (07/2021) Communications of the ACM covers our work on \"A Battery-Free Internet of Things\" in the July Issue. (06/2021) Expert panelist for the UN Department of Economic and Social Affairs global policy dialogues. (06/2021) Honored to win the Allen Taflove Best Teacher Award this year in ECE. (06/2021) Named to the Breed Chair of Design and one of eleven Segal Faculty Fellows in the McCormick School. (05/2021) We kick off our DARPA project building a Living Implantable Pharmacy with wearable controller. (04/2021) Northwestern Magazine's spring issue featured my op-ed, \"The World Needs Native Scientists Now\". (03/2021) I won the 3M Non-Tenured Faculty Award! Supporting outstanding early career faculty in STEM. (02/2021) We begin our NSF funded CIVIC project collaborating with Ojibwe nations to strengthen resilience. (02/2021) Our work on automated N95 decontamination is featured on ACM Tech News. (12/2020) Intermittent computing featured on Seeker's Focal Point Series , highlighting the Battery-free Game Boy! (10/2020) The Wall Street Journal covered perpetual computing and highlighted the Battery-free Game Boy! (09/2020) Interviewed on BBC's Newsday on the Game Boy! (segment starts at 18:40) (09/2020) Major press coverage for Battery-free Game Boy on CNET, BBC's Newsday Radio, The Verge, and others! (09/2020) Battery-free Game Boy won the Best Presentation Award â Audience Choice at ACM UbiComp 2020! (09/2020) NSF CISE funds our CPS Medium proposal on building smart green infrastructure! Batteries not included. (08/2020) Battery-free Game Boy accepted to IMWUT/ACM UbiComp 2020, you can learn more here! (05/2020) Wrote a viewpoint article for Communications of the ACM on IoT security and privacy. (05/2020) NSF CISE funds our RAPID proposal developing smart, batteryless masks for COVID-19 (04/2020) Paper on eating detection accepted to IMWUT/ACM UbiComp 2020. (11/2019) Two full papers on intermittent computing accepted to ACM ASPLOS 2020! (09/2019) Wrote a feature for ACM XRDS Magazine on battery-free mobile computing, preprint here. (09/2019) Serving on HotMobile and IoTDI program committees this year. Submit your best work! (08/2019) Paper on the experience of the Amulet health wearables project accepted to ACM MobiCom 2019. (08/2019) Paper on privacy vs. utility for activity oriented cameras accepted to IMWUT/ACM UbiComp 2019. (06/2019) Delivered a keynote lecture titled Why Wear a battery? at WearSys, colocated with MobiSys in Seoul. (06/2019) NSF CISE funds our proposal exploring how privacy concerns effect eating behavior modeling! (05/2019) NSF ECCS funds our proposal on conformable and durable synthet",
  "content_length": 15315,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:27"
}