{
  "name": "José Valdeni de Lima",
  "homepage": "https://www.inf.ufrgs.br/site/docente/jose-valdeni-de-lima",
  "status": "success",
  "content": "José Valdeni de Lima - Instituto de Informática - UFRGS Contato Links úteisCiência da ComputaçãoEngenharia de ComputaçãoContatoLocalizaçãoWebmail Voltar para lista de docentes José Valdeni de Lima Professor Titular Página Pessoal → CV LATTES → E-mail: *protected email* Telefone: +55 51 3308-6795 Prédio: 43424 Sala: 221 Qualificações Doutorado em Informática (Institut National Polytechnique de Grenoble (INPG), Grenoble, França,1990) 1976- Graduação em Administração de Empresas 7º Semestre 1976- Graduação em Engenharia Civil 1º Semestre 1979-1982 Mestrado em Computação 1986-1990 Doutorado em INFORMATIQUE DE L´UNIVERSITÉ DE GRENOBLE I 1997-1998 Pós-doutorado em Institut National Polytechique de Grenoble Áreas de Interesse Aprendizado ubíquo Manutenção do Sistema UNIX Controle Acadêmico Desenvolvimento do Sistema de Obras da Gus-Livonius S/A Desenvolvimento do Sistema de Faturamento da Exp. Mercúrio Minibiografia Prof. Valdeni é natural da cidade de Fortaleza, Ceará e graduou-se em Processamento de Dados pela Universidade Federal do Ceará, em 1978. Em 1980, mudou-se para Porto Alegre, para ingressar no mestrado em nosso PPGC, curso que concluiu em 1982. Realizou o doutorado em Informática na Université Joseph Fourier - Grenoble I, título que obteve em 1990. Seu estágio de pós-doutorado foi também em Grenoble, no Institut National Polytechnique de Grenoble (INPG), no período 1997-1998. Ingressou na UFRGS como professor colaborador (que seria quase-equivalente ao professor substituto de hoje), em 11 de abril de 1978. Em 1981, Valdeni passou a professor efetivo e foi promovido a professor Titular em 2014. Ao longo de sua carreira, dedicou-se à área de Sistemas Hipermídia, em geral, e a temas específicos como Aprendizagem Ubíqua, Hiperdocumentos como Objetos de Aprendizagem, Sistemas de Recomendação, Awareness, Workflow e Sistemas Cooperativos (CSCW). Formou 50 mestres (48 deles pelo PPGC e 2 pelo Programa de Pós-Graduação em Comunicação e Informação - FABICO/UFRGS) e 33 doutores, sendo 28 pelo Programa de Pós-Graduação em Informática na Educação e 5 pelo PPGC. Sua produção bibliográfica é extensa, incluindo artigos em periódicos e em eventos, capítulos de livros e livros organizados, demonstrando sua contribuição às áreas de atuação. Em sua vida acadêmica, Valdeni também desempenhou muitas atividades administrativas. Dentre elas, foi Coordenador da Comissão de Pesquisa do INF, membro da Comissão de Pós-Graduação do PPGC e Chefe do Departamento de Informática Aplicada. Foi coordenador do Programa de Pós-Graduação em Informática na Educação e, também, Diretor do Centro Interdisciplinar de Novas Tecnologias em Educação - CINTED/UFRGS. Sua aposentadoria foi publicada no D.O.U. de 11 de abril de 2019.",
  "content_length": 2738,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:05"
}