{
  "name": "José Fernando Alves da Silva",
  "homepage": "https://fenix.tecnico.ulisboa.pt/downloadFile/1126518382134006/fernandos.html",
  "status": "success",
  "content": "Fernando Silva Welcome to the web page of J. Fernando A. Silva Contents: A. Identification B. Education C. Professional activities D. Research E. Teaching F. Publications G. Other activities A. Identification José Fernando Alves da Silva,  Dr.-Eng. Habil. Born in Monção (Viana do Castelo), Portugal in 1956. Full Professor of the Department of Electrical and Computer Engineering (DEEC) of Instituto Superior Técnico ( IST ), University of Lisbon (UL); Researcher at INESC-ID; Member of Ordem dos Engenheiros Portugal. IEEE Senior Member since 2000. ADDRESS: J. Fernando Alves da Silva DEEC, A. C. Energia, Pav. Electricidade Piso 2, 2.29 INSTITUTO SUPERIOR TECNICO, Universidade de Lisboa Av. Rovisco Pais 1, 1049-001 Lisboa PORTUGAL Tel (+351) 21 8417436 Fax (+351) 21 8417190 email: fernando.alves@tecnico.ulisboa.pt https://fenix.tecnico.ulisboa.pt/homepage/ist11962 B. Education Back B. Education Year Academic Degree Institution 2002 Habilitation (Agregação) in Electrical and Computer Engineering in 2002 (Lecture Theme: Multilevel conversion in power electronics) IST/UTL 1990 Doctor Degree in Electrical and Computer Engineering (Power Electronics and Control) (Thesis: Predictive control of thyristor rectifiers with elimination of commutation failures) IST/UTL 1980 Dipl. Ing. in Electrical Engineering (Telecommunications and Electronics) IST/UTL C. Professional Activities Back C. Professional Activities Period Activity Institution 2013/ Full Professor Scientific Area of ENERGY (ACEnergia)/ DEEC / IST 2006/2013 Associate Professor with Habilitation (Agregação) Scientific Area of ENERGY (ACEnergia)/ DEEC / IST 2002/005 Associate Professor with Habilitation (Agregação) Secção Máquinas Eléctricas e Electrónica de Potência (SMEEP) / DEEC / IST 1998/2003 Coordinator Professor (Invited) Secção de Electrónica Industrial, Departamento de Engenharia Electrotécnica e Automação (DEEA), Instituto Superior de Engenharia de Lisboa (ISEL), Instituto Politécnico de Lisboa (IPL) 1996/2002 Associate Professor SMEEP / DEEC / IST 1996/2002 Coordinator Professor (Invited) Departamento de Engenharia Electrotécnica, Escola Superior de Tecnologia (EST), Instituto Politécnico de Setúbal (IPS) 1990/1996 Assistant Professor SMEEP / DEEC / IST 1984/1990 Assistant Lecturer SMEEP / DEEC / IST 1980/1984 Teaching Assistant Secção Electrónica / DEEC / IST C. Research Back D. Research D.1. Research interests Main research interests include: power semiconductor devices; converter modeling and simulation; new converter topologies for clean power; control of power converters and drives (predictive control, sliding mode control, fuzzy control) Power quality and power flow applications of power converters (multilevel converters, matrix converters, unity power factor rectifiers, FACTS, UPFC, STATCOM, DVR, energy storage) Pulsed Power D.2. Scientific Area Electrical and Computer Engineering; Electrical Energy Systems; Industrial Electronics; Power Electronics Power  Electronics and Power Quality Power Electronics and Power Flow Pulsed Power D.3. Research experience Period Activity Institution 2013/ Power Electronics and Power Quality group coordinator INESC-ID 2007/2012 Power Electronics and Power Quality group coordinator CIEEE 2003/2006 Research Coordinator LabEIE / CAUTL 2002/2003 Director of the research Lab of Industrial Electronics and Electromechanics (LabEIE) of CAUTL LabEIE / CAUTL 1996/2002 Research Coordinator CAUTL 1993/1995 Co-director of the Research Council CAUTL 1993/1995 Principal researcher of projects in the field of Industrial Electronics, MSc and Ph.D thesis supervisor CAUTL 1990/1993 Researcher CAUTL 1985/1990 Research Assistant of CAUTL CAUTL 1980/1985 Research Assistant of Center of Applied Electronics of UTL (CEAUTL) CEAUTL D.4. Thesis Supervisor D.4.1. PhD Thesis D. 4.1.1. UTL/ IST   PhD Thesis supervised (or co-supervised): Year Title Researcher Professional Activity Institutions 2014 · Multilevel Conversion in Generation and Grid Connection Miguel Cabral Ferreira Chaves MSc, Joined Professor of DEEA, ISEL CIEEE/ISEL 2012 · Restauradores Dinâmicos de Tensão com Conversores Matriciais e Volantes de Inércia Paulo Gambôa MSc, Joined Professor of DEEA, ISEL CIEEE/ISEL 2010 · Conversão Matricial Trifásica no Condicionamento do Trânsito de Energia Eléctrica Joaquim Monteiro MSc, Joined Professor of DEEA, ISEL CIEEE 2008 ·   Conversão Electrónica Multinível: Optimização para Aplicações em Qualidade da Energia Eléctrica, João Dionísio Barros Aux Prof. Universidade da Madeira CIEEE 2006 ·    Conversores Comutados de Potência para Amplificação Digital de Alta Resolução Victor Manuel Esteves Antunes MSc, Joined Professor of DEE, EST, IPS LabEIE / CAUTL / EST 2004 ·    Fontes de Alta Tensão Pulsada para Implantação Iónica de Imersão em Plasma - Utilização de Semicondutores de Baixa Tensão Luís Manuel do Santos Redondo MSc, Joined Professor of DEEA, ISEL ITN / ISEL 2003 ·    Conversores Matriciais Trifásicos: Generalização do Comando Vectorial Directo ( Sónia Maria Nunes Ferreira Pinto MSc, Assistant Lecturer of  DEEC, IST LabEIE / CAUTL 2000 · Rectificadores do Tipo Redutor-Elevador de Alto Rendimento e Factor de Potência Quase Unitário (High Efficiency Topologies and Advanced Controllers for Buck-boost Unity Power Factor Rectifiers) Vitor Manuel de Carvalho Fernão Pires MSc, Joined Professor of DEE, EST, IPS CAUTL 2000 ·    Accionamentos Electromecânicos Inteligentes - Metodologia de Controlo para Posicionadores Angulares (Intelligent Controllers for Angular Position Control with Induction Motors) José Carlos Lourenço Quadrado MSc, Joined Professor of DEEA, ISEL CAUTL 2000 · Motor Trifásico de Indução - Posicionamento Angular do Rotor por Inversão Diametral (Angular Position Control of Induction Motors Using Sliding-Mode Diametrical Inversion of Stator Voltages) (in co-operation with Prof. Manuel da Silva Garrido) Manuel Gaspar de Oliveira Guerreiro MSc, Joined Professor of DEE, EST, IPS CAUTL D. 4.1.2. UTL/ IST   PhD Thesis under supervision (or co-supervision): Year to be concluded Title Researcher Profissional Activity Institutions D.4.2. MSc Thesis D. 4.2.1. UTL/ IST   MSc Thesis supervised (or co-supervised): For the complete list see https://fenix.tecnico.ulisboa.pt/curriculum/final-work/document-confirmation Year Title Researcher Profissional Activity Institutions 2002 Conversores Multinível: Comando e Controlo por Computador João Dionísio Barros Eng., Teaching Assistant of Universidade da Madeira CAUTL 2000 Conversor de Potência com Tremor Nulo e Alto Rendimento, Acácio João Galhardo Baptista Eng., Teaching Assistant of  DEEA, ISEL CAUTL 1998 Contactores Electromecânicos com Ampla Gama de Tensões de Comando Paulo Jorge da Costa Santos Eng., Teaching Assistant of DEE, EST, IPS CAUTL 1995 Rectificadores Dodecafásicos: Modelos Comando e Controlo Sónia Maria Nunes Ferreira Pinto Eng., Teaching Assistant of DEEC, IST CAUTL 1995 Rectificador Dodecafásico Paralelo Associado a Nova Topologia de Filtragem Psofométrica Vitor Manuel de Carvalho Fernão Pires Eng., Teaching Assistant of DEE, EST, IPS CAUTL 1993 Posicionadores Electromecânicos: Introdução à Síntese de Controladores Inteligentes José Carlos Lourenço Quadrado Eng., Teaching Assistant of  DEEA, ISEL CAUTL 1993 Controlo Automático de Voo: Controladores e Algoritmos de Implantação em Microprocessador Digital de Sinal Eduardo Agostinho de Paiva Brito Coelho Major Electrotechnical Eng. and Professor of Academia da Força Aérea Portuguesa (FAP) CAUTL D. 4.2.2. UTL/ IST   MSc Thesis under supervision (co-supervision): Year to be concluded Title Researcher Profissional Activity Institutions 2007 Estudo de uma plataforma electromecânica de Gough-Stewart Rita Marcos F. Murta Pereira Eng., Teaching Assistant of  DEEA, ISEL LabEIE / CAUTL / ISEL 2007 Análise de Sistemas Dinâmicos não Lineares através do Método da Função Descritiva Pedro Miguel Silva Costa Braga de Oliveira Eng. IST/ISEP 2007 Compensador Multinível de Potência Reactiva (STACOM) Luís Rocha Encarnação Eng., Teaching Assistant of  DEEA, ISEL LabEIE / CAUTL / ISEL 2007 Conversores de Comando para Accionamentos Electromecânicos Lineares Ricardo Jorge Ferreira Luís Eng., Teaching Assistant of  DEEA, ISEL LabEIE / CAUTL / ISEL 2007 Conversores Multinível para UPFC Ivo Manuel Valadas Marques Martins Eng., Teaching Assistant of Universidade do Algarve LabEIE / CAUTL 2007 Geradores de Impulsos Bipolares de Alta Tensão Hiren Canacsinh Eng., Teaching Assistant of  DEEA, ISEL LabEIE / CAUTL D.4.3. Recent Final Year Projects TFC.12. Alimentações Eléctricas não Interruptíveis, (1999/2000). TFC.13. Conversores Multinível Trifásicos Reversíveis,   (1999/2000). TFC.14. Conversor de Potência com Baixa Tensão de Entrada e Alta Tensão de Saída para Amplificadores Digitais de Áudio,   (2000/2001). TFC.15. Conversores Matriciais: Estudo do Processo de Comutação dos Interruptores, (2000/2001). TFC.16. Estudo de Controladores para Amplificadores Comutados de Áudio,   (2000/2001). TFC.17. Alimentações não Interruptíveis com Conversores Multinível Trifásicos Reversíveis,   (2000/2001). TFC.18. Modelação, Simulação e Controlo de um Conversor Bidireccional, para Aplicação em Alimentações não Interruptíveis (UPS) do tipo Interactivo,   (2000/2001). TFC.19. Estudo de Moduladores para Amplificadores Comutados de Áudio,   (2000/2001). TFC.20. Amplificador Áudio Comutado de Alto Rendimento,   (2000/2001). TFC.21. Comando Electrónico de Disjuntores,   (2001/2002). TFC.22. Amplificador Comutado de Áudio de Baixa Tensão de Alimentação,   (2001/2002). TFC.23. Alimentações Eléctricas não Interruptíveis (ANI_UPS) com Conversor Multinível no Ondulador de Saída,   (2001/2002). TFC.24. Sistema Amplificador Comutado para Áudio Digital,   (2001/2002). TFC.25. Processamento de Energia Eléctrica Comutado e não Poluente com Conversores Multinível,   (2001/2002). TFC.26. Processamento de Electricamente não Poluente de Energia: Conversor Matricial Trifásico,   (2001/2002). TFC.27",
  "content_length": 18140,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:39"
}