{
  "name": "José R. A. Torreão",
  "homepage": "http://www2.ic.uff.br/~jrat",
  "status": "success",
  "content": "Prof. José Ricardo Torreão Professor José R. A. Torreão Education: B.Sc. Physics, 1980, Federal University of Pernambuco (UFPE), Brazil M.Sc. Physics, 1983, Federal University of Pernambuco (UFPE), Brazil Dissertation Subject: Nuclear Physics Ph.D. Physics, 1989, Brown University, USA Thesis Subject: Artificial Vision Research Interests: Artificial and Natural Vision Recent Projects: · 3D shape estimation · Computational modeling of cortical neurons · Motion synthesis Some recent publications: · \"Generalized Signal-Tuned Approach for Signal Representation and Analysis\" José R.A. Torreão International Journal of Modern Physics C, 1750001, 2016 · \"Holonomy, Quantum Mechanics, and the Signal-Tuned Approach to the Striate Cortex\" José R.A. Torreão International Journal of Modern Physics C 27(8), 1650089, 2016 · \"Equation of Motion and General Solution for the One-Dimensional Complex Cell Response in the Signal-Tuned Approach\" José R.A. Torreão Biological Cybernetics 109, pp. 435-452, 2015 · \"Signal-Tuned Gabor Functions as Models for Stimulus-Dependent Cortical Receptive Fields\" José R.A. Torreão, Silvia M.C. Victer, Marcos S. Amaral Neural Computation 26(5), pp. 920-952, 2014 · \"A Signal-Tuned Gabor Transform with Application to EEG Analysis\" José R.A. Torreão, Silvia M.C. Victer, João L. Fernandes International Journal of Modern Physics C, 24(4), 1350017, 2013 · \"Motion Blur and Deblur through Green’s functions\" Perfilino E. Ferreira Júnior and José R.A. Torreão In: ‘Computer Graphics’, Nobuhiko Mukai (Editor) In-Tech, Croatia, pp.179-194, 2012 · \"Towards a Biologically Plausible Stereo Approach\" José R.A. Torreão and Silvia M.C. Victer In: ‘Advances in Stereo Vision’, José R.A. Torreão (Editor) In-Tech, Croatia, pp.57-70, 2011 · \"Linear-nonlinear neuronal model for shape from shading\" José R.A. Torreão and João L. Fernandes Pattern Recognition Letters 32, pp. 1223-1239, 2011 · \"Shape from shading through photometric motion\" João L. Fernandes and José R.A. Torreão Pattern Analysis and Applications 13, pp. 35-58, 2010 · \"A comparative analysis of  Green’s function of 1D matching equations for motion synthesis\" Perfilino E. Ferreira Júnior, José R.A. Torreão and Paulo.C.P. Carvalho Pattern Recognition Letters 30, pp. 1321-1334, 2009 · \"Motion synthesis through 1D affine matching\" Perfilino E. Ferreira Júnior, José R.A. Torreão, Paulo.C.P. Carvalho and Marcelo B. Vieira Pattern Analysis and Applications 11, pp. 45-58, 2008 · \"A novel approach to photometric motion\" José R.A. Torreão, João L. Fernandes and Helena C.G. Leitão Image and Vision Computing 27, pp. 126-135, 2007 · \"Disparity estimation through Green’s functions of matching equations\" José R.A. Torreão Biological Cybernetics 97, pp. 307-316, 2007 · \"Green’s functions of matching equations: a unifying approach for low-level vision problems\" José R.A. Torreão, João L. Fernandes, Marcos S. Amaral and Leonardo Beltrão In: ‘Vision Systems’, Goro Obinata and Ashishi Dutta (Eds.) ARS Publishing, Viena, pp. 357-372, 2007 Links: · Linear-nonlinear neuronal model for shape from shading Code · Introdução aos Métodos Numéricos Notas 1 1 Notas 1 2-35 Notas 2 1-7 Notas 2 8-27 Notas 2 28-32 Notas 3 1-23 Notas 3 24-34 Notas 3 35-46 Notas 4 Notas 5 1-12 Notas 5 13-22 Notas 6 Notas 7 Resultados Verificação Escrita Resultados Segunda Verificação Escrita Resultados Parciais Resultados Segunda Chamada Resultados Parciais Resultados Implementação Resultados Parciais Resultados Verificação Suplementar Resultados Finais · Tratamento de Incertezas Notas 1 Notas 2 Notas 3 Notas 3B Notas 3C Notas 3D Notas 4 Notas 5 Notas 5B (Opcional) Notas 6 Notas 6B (Opcional) Notas 6C (Opcional) Notas 7 Notas 8 Notas 9 · Visão Computacional Notas 1 Notas 2 Notas 3 Notas 3B Notas 3B2 Notas 3C Notas 3C2 Notas 3D Notas 3E Notas 3F Notas 4 Notas 4B Notas 4C Notas 5 Notas 6 Notas 6B Notas 6C Notas 6D Notas 6E Notas 7 Notas 8 Notas 8B · Computação em Finanças Notas 0 Notas 1 Notas 2 Notas 3 Notas 4 Notas 5 Notas 6 Notas 7 Notas 8 Notas 8B Notas 9 Notas 10 Notas 11 Notas 12 Notas 12B Notas 13 Notas 14 Notas 15 Notas 16 Pós-Graduação em Computação (IC) Universidade Federal Fluminense (UFF)",
  "content_length": 4172,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:01"
}