{
  "name": "José Nelson Amaral",
  "homepage": "https://webdocs.cs.ualberta.ca/~amaral",
  "status": "success",
  "content": "Jose Nelson Amaral homepage Department of Computing Science University of Alberta Athabasca Hall (ATH) 352 Edmonton, Alberta, Canada, T6G 2E8 Fax: (780) 492-1071 Email: amaral AT cs DOT ualberta DOT ca Alberta Tools, Compilers, and Talks Vulkan Vision (V-Vision), a framework for shader instrumentation in Vulkan applications that extends Vulkan validation layer instrumentation capabilities to enable meaningful performance and behaviour-centric instrumentation. KernelFaRer, a robust pattern matcher for LLVM IR. Keynote Talk at LCPC 2020: Until Compilers Get Better at Code Generation: Leverage Human Expertise The Alberta Worloads for the SPEC CPU 2017 Benchmark Suite both additional workloads for the benchmarks included in the suite and, for some benchmarks, programs that can be used to generate additional workloads. These workloads are intended for the evaluation of learning techniques in compilers, computer architecture, program analysis, and operating systems. A Graphics Library for RISC-V (GLIR) to emulate graphics in the RARS Simulator for RISC-V. Converted to RISC-V by Taylor Zowtuk, a former CMPUT 229 students. A Graphics Library for MIPS (GLIM) programming using terminals in SPIM. Created by Austin Crapo, a former CMPUT 229 students. Talk How did this get published? Pitfalls in experimental evaluation of computing systems (.pptx) (.pdf) at the Languages, Compilers, Tools and Theory for Embedded Systems June 12, 2012, Beijing. unPython: unwrapping python to C. unPython is a Python-to-C open source compiler that is currently mainly developed by my M.Sc. student Rahul Garg. Awards and Recognitions My M.Sc. student Nathan Henderson received a Best M.Sc. Thesis Award from was selected as the runner up for the Department of Computing Science at the University of Alberta in February 2024. IEEE Computer Society Distinguished Visitor (2024-2026) Our paper \"Stub Folding: Retaining Type Specialization to Increase the Efficiency of Highly Polymorphic Inline Caches\" received the Best Paper Award at the 33rd Annual International Conference on Computer Science and Software Engineering in 2023. Our paper To Pack or Not to Pack: A Generalized Packing Analysis and Transformation received a Distinguished Paper Award at the IEEE/ACM International Symposium on Code Generation and Optimization (CGO) in 2023. 2022 Standard Performance Corporation Evaluation (SPEC) Presidential Award University of Alberta 2020 COVID-19 Remote Teaching Award --- Poster for Festival of Teaching and Learning. My M.Sc. student David Pankratz received a bronze medal in the Huawei Central Software Institute (CSI) Innovation Project Contest in 2020. Jack Marques Franco, a visiting student from Universidad Autonoma de Occident in Cali, Colombia, received the Outstanding International Intern - Canadian Bureau for International Education (CBIE) award at the Festival of Undergraduate Research & Creative Activities (FURCA). University of Alberta Award for Outstanding Mentorship in Undergraduate Research & Creative Activities, March 2020. My M.Sc. student Artem Chikin was selected the Student of the Year by the IBM Centre for Advanced Studies in November 2018, Markham, ON, Canada. My M.Sc. student Taylor Lloyd was selected as the runner up for the Department of Computing Science Masters Thesis Award in October 2018. Our collaborative research project was the runner-up for the Project of the Year awarded by the IBM Centre for Advanced Studies in November 2018, Markham, ON, Canada. My M.Sc. student Artem Chikin received the Department of Computing Science M. Sc. Early Achievement Award in October 2017. SPEC 2017 Award -- SPEC CPU 2017 Benchmark Release 2017 Interdepartmental Science Students' Society Award for Excellence in Teaching University of Alberta Faculty of Science Excellence in Teaching Award, May 2015. Designated a Distinguished Engineer by the Association for Computing Machinery (ACM) in 2014. My student Matthew Gaudet was the Runner-up for the 2014 Departmental M.Sc. Outstanding Thesis Award. I was a Distinguished Association for Computing Machinery (ACM) Speaker (2012-2014). Ph.D. student Alejandro Ramirez-Sanabria received a prestigious IBM Ph.D. Fellowship in 2014 and 2015. I received a 2014 Interdepartmental Science Students' Society Award for Excellence in Teaching M.Sc. student Matthew Gaudet has been selected to receive the University of Alberta Alumni Award of Excellence. Elected to the Standard Performance Evaluation Corporation (SPEC) Board of Directors - January 2014. I received the 2012 IBM Center for Advanced Studies (CAS) Resarch Faculty Fellow of the Year award. Previous awards and recognitions Students (Graduate) and Post Docs Quinn Pham (M.Sc. - IBM CAS) Danila Seliayeu (M.Sc. - IBM CAS) Mariana Dehghan (M.Sc. - UAHJIC) SarahThomson (M.Sc.) Madison Bradley (M.Sc.) Ayrton Chilibeck (M.Sc.) Dhanrajbir Singh Hira (M.Sc.) Justin Meimar (M.Sc.) Patrick Zijlstra (M.Sc.) Students (Undergraduate) Arsh Ahsan (B.Sc.) Summer 2025 Austin Lu (B.Sc.) Summer 2025 Calin Yakimchuk (B.Sc.) Summer 2025 Ishan Bagai (B.Sc.) Summer 2025 Kevin Huai (B.Sc.) Summer 2025 Max Leontiev (B.Sc.) Summer 2025 Saumya Patel (B.Sc.) Summer 2025 Teaching CMPUT 229 Computer Organization and Architecture I CMPUT 329 Computer Organization and Architecture II CMPUT 429 Computer Systems and Architecture CMPUT 603 Teaching and Research Methods CMPUT 680 Compiler Design and Optimization CMPUT 605-JiT Advanced Topics in Compilers: Dynamic Re-Compilation Publications Compiler Design and Implementation Multi-Threaded Architectures and Programming Models High-Performance Computing Parallel Architectures for Symbolic Processing Combinatorial Optimization Problems Theory and Applications of Artificial Neural Networks Engineering and Computing Science Education Design for Testability Cache-Conscious Algorithms Internet Protocol Routing Caches Alumni (Graduate) Caio Salvador Rohwedder (Ph.D. - UAHJIC) Thesis: Region-Based Data Layout Transformations: Compiler Techniques and Applications Employment: AMD, Edmonton, AB, Canada Reza Ghanbari (M.Sc. - UAHJIC) Thesis: Utilizing Idle Processor Resources in LLVM Vectorization via Scalar Interpolation Employment: Huawei Canada, Markham, ON, Canada Deric Cheung (M.Sc. - UAHJIC) Thesis: Applications and Limitations of Vulkan-Layer-based Instrumentation Employment: Microsoft, Vancouver, BC, Canada Nathan Henderson (M.Sc.) Thesis: On Policy Decisions of Polymorphic Inline Caches in Dynamically-Typed Language Implementations Employment: AMD, Edmonton, AB, Canada Tyler Gobran (M.Sc. - IBM CAS) Thesis: DASS: Dynamic Adaptive Sub-Target Specialization Employment: Persimmons, Inc., Edmonton, AB, Canada João Paulo Labegalini de Carvalho (Post-Doc Fellow) Employment: AMD, Edmonton, AB, Canada Rouzbeh Paktinatkeleshteri (M.Sc. - UAHJIC) Thesis: Efficient Auto-Vectorization for Control-Flow Dependent Loops through Data Permutation Employment: Huawei, Markham, ON Ivan Korostelev (M.Sc., IBM CAS) Thesis: Efficient Memory Hierarchy Utilization for Matrix Multiplication and Convolution on CPUs Employment: Synopsis, Calgary, AB Wyatt Praharenka (M.Sc. - UAHJIC) Thesis: Optimization of Vector Instructions in Divergent Control Flow on Long-Vector Architectures using Active-Lane Consolidation Employment: AMD, Edmonton, AB Braedy Kuzma (M.Sc., IBM CAS) Thesis: Compiler-Only Code Generation for Performant and Modular Matrix-Multiplication Micro Kernels Using Matrix Engines Employment: Archiact David Pankratz (M.Sc. - UAHJIC) Thesis: Data-Driven Analysis and Design of Vulkan Ray-Tracing Applications using Automatic Instrumentation Employment: Stability AI, Edmonton, AB Erick Ochoa (M.Sc. - IBM CAS) Thesis: Guiding Inlining Decisions Using Post-Inlining Transformations Co-Supervisor: Karim Ali Employment: Xanadu, Toronto, ON Marcus Karpoff (M.Sc. - MITACS) Thesis: Portable Software Update: A Framework for Dynamic Software Updates in C-Language Programs Employment: Amazon, Vancouver Artem Chikin (M.Sc. - IBM CAS) Thesis: Compiler-Driven Performance on Heterogeneous Computing Platforms Employment: Apple Corporation, Cupertino Taylor Lloyd (M.Sc. - IBM CAS) Thesis: Program Analysis and Compiler Transformations for Computational Accelerators Employment: Anthropic, Seattle Juan Salamanca Guillen (Ph.D. - Unicamp - FAPESP) Cosupervisor: Guido Araujo Thesis: Thread-Level Speculation on Hardware Transactional Memory Architectures Martin Ichilevici de Oliveira (M.Sc. - Unicamp - FAPESP) Cosupervisor: Guido Araujo Thesis: PTB: An Integrated Page, Thread and Bandwidth Allocation Approach for NUMA Architectures Employment: Eideticom, Calgary Marcio Machado Pereira (Ph.D. - Unicamp - SWB) Thesis: Scheduling and Serialization Techniques for Transactional Memories Employment: Post-Doctoral at Unicamp and Celera Technologies Cosupervisor: Guido Araujo Jeeva Paudel (Ph.D. - AIF) Thesis: Optimizing Task Distribution and Shared-Variable Accesses in an Asynchronous-Partitioned-Global-Address-Space Programming Model Employment: Qualcomm (Santa Clara) GPU Compiler Team You Li (M.Sc. - IBM CAS Alberta AIF) Thesis: Trading Consistency for Synchronization Cost Reduction in Real-time On-Line Analytical Processing (OLAP) Systems Matthew Gaudet (M.Sc. - IBM CAS NSERC) Thesis: Serialization Management Driven Performance in Best-Effort Hardware Transactional Memory Systems Employment: Mozilla Iain Ireland (M.Sc. - AIF) Thesis: SafeType: Detecting Type Violations for Type-Based Alias Analysis of C Employment: Mozilla Michail Alvanos (Ph.D. - Barcelona Supercomputing Center) Thesis: Optimization techniques for fine-grained communication in PGAS environments Cosupervisor: Xavier Martorell , Montse Farreras Employment: XM Financial Services Arnamoy Bhattacharyya (M.Sc.) Thesis: Do Inputs Matter Using Data-Dependence Profiling to Evaluate Thread Level Speculation in the BlueGeneQ Employment:(Deceased) Paul Berube (Ph.D. - NSERC) Thesis: Methodologies for May-Input Feedback-Directed Optimization Emp",
  "content_length": 16118,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:56"
}