{
  "name": "José Manuel García Carrasco",
  "homepage": "http://webs.um.es/jmgarcia/miwiki/doku.php",
  "status": "success",
  "content": "inicio [JOSE MANUEL GARCIA CARRASCO] Main Menu Main Menu Bio Teaching Research Publications Conference Talks Alumni Professional Activities Contact Information Menu Principal Biografía Enseñanza Investigación Publicaciones Charlas impartidas Doctorandos Act. Profesionales Articulos y entrevistas Información de Contacto Biography Jose M. Garcia received an MS degree in Electrical Engineering and a Ph.D. degree in Computer Engineering, both from the Technical University of Valencia. He is a professor of Computer Architecture at the Department of Computer Engineering at the University of Murcia (Spain), and also the Head of the Research Group on Parallel Computer Architecture. Prof. García served as the Dean of the School of Computer Science from 2006 to 2013 and as Vice-Dean from 1995 until 1997. He also served as Director of the Computer Engineering Department from 1998 to 2004 at the same university. He has developed several courses on Computer Structure, Computer Architecture, Parallel Computer Architecture, Peripheral Devices, and Multicomputer Design. He was involved in the “EA-Grid: Euro-Asia United Establishment of Double Degree Master Programme in Grid Computing,” which was an Education and Research Network in Grid Computing between the EU and Asia funded by the European Commission with Cranfield University (UK) as the coordinator, University of Murcia (Spain) and University of Technologie Compiegne (France) from Europe, and 8 Chinese universities. He specializes in Computer Architecture, Parallel Processing, and Interconnection Networks. His current research interests lie in designing power-efficient heterogeneous systems and developing data-intensive applications for those systems (especially bioinspired evolutionary algorithms and bioinformatics apps for new drug discovery). He has supervised nineteen doctoral Theses and has published more than 140 refereed papers in different journals and conferences in these fields. Prof. García co-organized the workshop on Exploiting Silicon Photonics for energy-efficient heterogeneous parallel architectures (2014 and 2015) at the HiPEAC Conference. He has often acted as an Expert Evaluator for some Spanish National and Regional Research Agencies. Prof. García is a member of HiPEAC, the European Network of Excellence on High Performance and Embedded Architecture and Compilation. He is also a member of several international associations such as the IEEE and ACM. Finally, Prof. García has been very active in topics related to youth education, and he has published several papers on educational issues. He was a member of the Staff of the CM La Alameda (a student residence of the University of Valencia) and of the Nerpio Young Association, and also of the Azarbe Familiar Association. Currently, he is a member of the Board of Directors of the Club Universitario Pinatar, a student association of the University of Murcia which promotes the cultural, personal and professional formation of the students. inicio.txt Última modificación: 2024/11/21 10:16por jmgarcia@um.es",
  "content_length": 3059,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:51"
}