{
  "name": "José Santos-Victor",
  "homepage": "http://users.isr.ist.utl.pt/~jasv",
  "status": "success",
  "content": "José Santos-Victor José Santos-Victor Full Professor, ECE Dept. of Electrical & Computer Engineering Instituto Superior Técnico,Universidade de Lisboa Institute of Systems and Robotics LARSyS - Laboratory of Robotics and Engineering Systems, Coordinator IST Distinguished Professor, IEEE Fellow - Institute of Electrical and Electronics Engineers, ELLIS Fellow - European Laboratory for Learning and Intelligent Systems, Correspondent Member Academy of Sciences of Lisbon. Research My research interests are in the areas of computer and robot vision, to address two questions:  (i) how to develop artificial (robotic) systems that use vision and other sensing modalities to \"understand\" the world around them and (ii) to investigate, model and understand how vision is used in biological systems like insects or humans. One research are is vision based-navigation, motion perception and control, including how to use visual information in closed loop for mapping and control of land, air and underwater vehicles. It often requires the design of task-specific camera geometries, like omnidirectional and space variant cameras. This research draws inspiration from biology where evolution has lead to specialized and sophisticated solutions (both eye design and processing) adapted to the behaviour of the various species (e.g. compound eyes, foveal cameras). Another main area of research is cognitive humanoid systems. Together with neuroscientists and developmental psychologists, we aim to understand human cognition, sensorimotor coordination and learning, as well as to design robotic systems with learning and adaptation capabilities. Flagship projects have addressed the models of mirror neurons to enhance the ability of human action recognition, imitation and programming by demonstration. We have proposed models of object affordances that improves a robots ability to manipulate objects, ground language and choose tools that are adequate to a given function. Contact me if you are interested in working in some of these topics (scholarships available). Publications & Projects [GoogleScholar] [Research Gate] [ORCID] [DBLP] My publications and projects are also available from the Vislab's Web Page. Check my page at ISR Misc IEEE Fellow for \"Contributions to biologically-inspired cognitive vision and humanoid robotic systems\". Correspondent Member, Academy of Sciences of Lisbon Coordinator international PhD Program RBCog - Robotics, Brain and Cognition, funded by FCT. Coordinator of the RBCog-Lab research infrastructure that is part of the Portuguese Roadmap for Research Infrastructures. President of ISR-Lisboa (2015-2022). Chair, Department of Electrical and Computer Engineering, IST (2021-24). Coordinator of the Associated Laboratory LARSyS. Member of the Supervisory Board of EIT Innoenergy (2011-2023). Teaching PhD: [Computer Vision/ spring semester] Students Ph.D.: Inês Rito Lima, Anastasia Mikhailova, Laura Santos, Paul Schydlo, João Damião Almeida. Former Students Ph.D.: Laura Santos (2025, Joint Degree IST & PoliMI, co-supervised w/ Alessandra Pedrocchi, Politecnico di Milano) Anastasiia Mikhailova (2025, IST, co-supervised w/ Moreno I. Coco, University of Rome La Sapienza) Nuno Duarte (2023, IST & EPFL, co-supervised Aude Billard, EPFL) Gonçalo Victorino (2022, IST & ISA, co-supervised Carlos Lopes and Carlos Braga, ISA) Atabak Dehban (2021, IST, co-supervised w/ Adam Kampff, Sainsbury Wellcome Center) Pedro Vicente (2021, IST, co-supervised w/ Alexandre Bernardino) Clebeson Canuto (2020, co-supervised w/ Raquel Vassallo, UFES) Sofija Spasojevic (2018, co-tutelle IST and University of Belgrade), Athira Nambiar, (2017,co-supervised w/ A. Bernardino and J.Nascimento, IST), Martim Brandão, (2017, co-supervised w/ Atsuo Takanishi, Waseda U., Japan), Ravin de Souza, (2016, IST & EPFL, co-supervised w/ Aude Billard, EPFL), Luka Lukic (2015, IST & EPFL,co-supervised  w/ Aude Billard, EPFL), Bruno Damas (2014), Sebastien Gay, (2013, IST & EPFL,co-supervised w/ Auke Ijspeert, EPFL), Jonas Hornstein, (2013), Jonas Ruesch, (2013, co-supervised w/ A. Bernardino, IST), Ricardo Beira, (2013, IST & EPFL,co-supervised w/ Hannes Bleuler, EPFL) Plinio Moreno (2008), Manuel Lopes (2006), Raquel Vassallo (2004, Universidade Federal Espírito Santo, Brasil), Alexandre Bernardino (2004), Nuno Gracias (2003), José Gaspar (2003), Etienne Grossmann (2002), Niall Winters (2001), César Silva (2001). M.Sc.: Alexandre Bernardino, César Silva, Vitor Costa, Nuno Gracias, Raquel Vassallo, Sjoerd van der Zwaan, Ricardo Marranita, Alpesh Ranchordas. Job offers We regularly hire researchers and PhD students interested and experienced in different topics of computer vision and robotics. Email me if you're interested to learn about work and research opportunities. Education Ph.D., Electrical and Computer Engineering, IST, 1995. M.Sc., Electrical and Computer Engineering, IST, 1991. Licenciatura, Electrical and Computer Engineering, IST, 1988. Contact Prof. José Santos-Victor, ISR - Torre Norte, Instituto Superior Técnico, Av. Rovisco Pais, 1049-001 Lisboa, PORTUGAL. Tel.: +351 21.8418.294 Fax.: +351 21.8418.291",
  "content_length": 5151,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:05"
}