{
  "name": "José A. B. Fortes",
  "homepage": "https://www.acis.ufl.edu/people/fortes",
  "status": "success",
  "content": "José A.B. Fortes, PhD – ACIS José A.B. Fortes is the AT&T Eminent Scholar and Professor of Electrical and Computer Engineering at the University of Florida where he founded and is the Director of the Advanced Computing and Information Systems Laboratory. Among other current projects, he is leading the development of the cyberinfrastructure of the NSF-funded iDigBio project, is the principal investigator and Steering Committee Chair of the CENTRA collaborative (initially funded by NSF). He received the B.S. degree in Electrical Engineering (Licenciatura em Engenharia Electrotécnica) from the Universidade de Angola in 1978, the M.S. degree in Electrical Engineering from the Colorado State University, Fort Collins in 1981 and the Ph.D. degree in Electrical Engineering from the University of Southern California, Los Angeles in 1984. From 1984 until 2001 he was on the faculty of the School of Electrical Engineering of Purdue University at West Lafayette, Indiana. In 2001 he joined both the Department of Electrical and Computer Engineering and the Department of Computer and Information Science and Engineering of the University of Florida as Professor and BellSouth Eminent Scholar. From July 1989 through July 1990 he served at the National Science Foundation as director of the Microelectronics Systems Architecture program. From June 1993 till January 1994 he was a Visiting Professor at the Computer Architecture Department of the Universitat Politecnica de Catalunya in Barcelona, Spain. His research interests are in the areas of distributed computing, autonomic computing, computer architecture, parallel processing and fault-tolerant computing. He has authored or coauthored over 250 technical papers and has lead the development and deployment of Cloud and Grid-computing software used in several cyberinfrastructures for e-Science and digital government. His research has been funded by the National Science Foundation, Office of Naval Research, AT&T Foundation, IBM, General Electric, Intel, Northrop-Grumman, Army Research Office, NASA, and the Semiconductor Research Corporation. José Fortes is a Fellow of the Institute of Electrical and Electronics Engineers (IEEE) professional society and a Fellow of the American Association for the Advancement of Science (AAAS). He was named the University of Florida 2019-2020 Teacher/Scholar of the Year (the University of Florida’s most prestigious and oldest faculty award) and a member of the UF Academy of Distinguished Teaching Scholars. He received the 2021 South Eastern Conference (SEC) Faculty Achievement Award for UF and the 2021 ECE Excellence Award for Faculty Research at UF: He was a Distinguished Visitor of the IEEE Computer Society from 1991 till 1995. José Fortes has served as a member of the Editorial Boards of the IEEE Transactions on Services Computing, IEEE Transactions on Cloud Computing, IEEE Transactions on Parallel and Distributed Systems, the ACM Journal on Emerging Technologies in Computing Systems, International Journal on Parallel Programming, Cluster Computing: The Journal of Networks, Software Tools and Applications, the Journal of VLSI Signal Processing, and the Journal of Parallel and Distributed Computing. Professor and AT&T Eminent Scholar Office: 339 Larsen Hall Tel: (352) 392-9265 Fax: (352) 392-5040 E-mail: fortes@ufl.edu Google Calendar Google Scholar ORCID",
  "content_length": 3376,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:31"
}