{
  "name": "José Santos 0003",
  "homepage": "https://www.dc.fi.udc.es/ai/~santos",
  "status": "success",
  "content": "José Santos Reyes Webpage José Santos Reyes Full Professor of Computer Science and Artificial Intelligence Versión en español Computer Science Department University of A Coruña Campus de Elviña 15071 A Coruña Telephone: +34 981 167000 (Ext 1257,  Ext 1276) Fax: +34 981 167160 Email: Research Research Lines Bioinformatics Neural Computation Evolutionary Computing Autonomous Robotics Publications Articles Books Conferences Teaching Research · Bioinformatics. Main works: Protein secondary and tertiary structure prediction and modeling of protein folding. Prediction results of SARS-CoV-2 proteins. Study of the genetic code optimality. Cancer growth modeling. · Neural Computing. Main works: · DTB (Discrete Time Backpropagation) algorithm in neural networks with variable synaptic connection temporal delays. Applications in chaotic time series prediction and dynamic reconstruction, QRS complex detection in ECG, .... · Gaussian Synapse Networks for pattern recognition. · Hybrid connectionism symbolic systems. · Neural models of Central Pattern Generators (CPG). · Evolutionary Computing. Main works: · Evolution of recurrent neural architectures. · Evolution of cognitive models for autonomous robots. · New models of evolution (macroevolution). · Parallelization and distribution of evaluation in evolutionary algorithms. · Combination of learning and evolution. Baldwin Effect study. · Use in artificial life models. · Autonomous robotics. Main works: · Incorporation of neural controllers with temporal information treatment. · Methodological and practical development of generation and interconnection of behavior controllers. · Models of control cognitive mechanisms. · Visual processing systems for autonomous robots. · Evolutionary robotics. · Reinforcement learning. · Neural control of biped structures with adaptive CTRNNs and with Synaptic-delay based NNs (more examples with hexapod structures). Publications PhD students in these research topics are welcome. Contact me for discussing opportunities. Books Vida Artificial. Realizaciones Computacionales. (Artificial Life, in Spanish) Current Topics in Artificial Intelligence. 11th Conference of the Spanish Association for Artificial Intelligence, CAEPIA 2005,  Revised Selected Papers, Marín, R.; Onaindía, E.; Bugarín, A.; Santos, J. (Eds.), Lecture Notes in Artificial Intelligence, Vol. 4177, 2006. Part of our work can be followed in Biologically Inspired Robot Behavior Engineering. Our book, in Spanish, Evolución Artificial y Robótica Autónoma, details the evolutionary robotics discipline. Conferences Some participations in the scientific committee: conferences Last events with participation in the organization: Special session Bio-inspired computing approaches at International Work conference on the Interplay between Natural and Artificial Computation, IWINAC 2024, Olhao - Algarve (Portugal), June 2024. Special session Bio-inspired computing approaches at International Work conference on the Interplay between Natural and Artificial Computation, IWINAC 2022, Tenerife (Spain), June 2022. Special session Bio-inspired computing approaches at International Work conference on the Interplay between Natural and Artificial Computation, IWINAC 2019, Almería (Spain), June 2019. 11th International Conference on Computer Science and Information Technology, ICCSIT 2018, Paris (France), December 2018. Workshop Evolutionary computation in computational biology at Genetic and Evolutionary Computation Conference, GECCO 2017, Berlin (Germany), July 2017. Special session  Bio-inspired computing applications at International Work conference on the Interplay between Natural and Artificial Computation, IWINAC 2017, A Coruña (Spain), June 2017. International Work conference on the Interplay between Natural and Artificial Computation, IWINAC 2017, in A Coruña (Spain), Junio 2017. 10th International Conference on Computer Science and Information Technology, ICCSIT 2017, Florence (Italy), October 2017. Workshop Evolutionary computation in computational structural biology at Genetic and Evolutionary Computation Conference, GECCO 2016, Denver - Colorado (USA), July 2016. Workshop Evolutionary computation in computational structural biology at Genetic and Evolutionary Computation Conference, GECCO 2015, Madrid (Spain), July 2015. Workshop Natural computing for protein structure prediction at 13th International Conference on Parallel Problem Solving from Nature, PPSN 2014, Ljubljana (Slovenia), September 2014. Special Session Evolution for agent control at the IEEE Congress on Evolutionary Computation, IEEE CEC 2013, Cancún (México), June 2013. 11th Conference of the Spanish Association for Artificial Intelligence, CAEPIA 2005, Santiago de Compostela (Spain), November 2005. Special Session Higher Order Neural Networks organized in the International Work Conference on Artificial and Natural Neural Networks Special Session Artificial Neural Networks and Robotics, in the European Symposium on Artificial Neural Networks ESANN 2000. Teaching https://pdi.udc.es/en/File/Pdi/QJ8AF",
  "content_length": 5073,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:02"
}