{
  "name": "José F. Martínez",
  "homepage": "http://www.csl.cornell.edu/~martinez",
  "status": "success",
  "content": "José F. Martínez This page has moved. skip to content Computer Systems Laboratory Home Publications Research Teaching Paella TeX: Jos{\\'e} Mart{\\'\\i}nez HTML: Jos&#233; Mart&#237;nez OS X: Opt+e then vowel for é, í Elsewhere: José Martínez (c&p) José F. Martínez Professor, ECEGraduate Field Member, CS and SysEngFellow, Atkinson Center for a Sustainable Future 336 Rhodes Hall Ithaca, NY 14853 USA +1 (607) 255-1874 Meeting with meOpen office hours Wednesday 2-4pmOr, for an appointment, click here. Students interested in working with me, click here. Bio I am Professor of Electrical and Computer Engineering, faculty member of the graduate fields of Computer Science and Systems Engineering, and faculty fellow of the Atkinson Center for a Sustainable Future at Cornell. I am part of Cornell's Computer Systems Laboratory. I am also the Hardware Theme lead for the Center for Research in Intelligent Storage and Processing in Memory (CRISP). I have been very fortunate to work with some extraordinary people, and as a result my research has received a number of awards over the years; among them: two IEEE Micro Top Picks papers (2003 and 2007); a HPCA Best Paper award (2005), as well as MICRO and HPCA Best Paper nominations (2006 and 2015); a NSF CAREER Award (2006); two IBM Faculty Awards (2006 and 2009; and a Distinguished Educator Award (2011) by the University of Illinois' Computer Science Department (my graduate alma mater). On the teaching side, I have been recognized with two Kenneth A. Goldman '71 Excellence in Teaching Awards (2005 and 2014); a Ruth and Joel Spira Award for Excellence in Teaching (2015); twice as the Most Influential College Educator of a Merrill Presidential Scholar (2007 and 2016); and as the 2011 Tau Beta Pi Professor of the Year in the College of Engineering. I served as Editor in Chief of IEEE Computer Architecture Letters from 2013 through 2016, and in 2017 as Chair of the IEEE Computer Societyâs Transactions Operating Committee, in charge of overseeing all of the Societyâs journal publications. I currently serve on the Advisory board of the Industry-Academia Partnership for architecture, networking, and storage needs of future data centers and cloud computing. I graduated in Computer Science & Engineering (\"Licenciado en Informática de Sistemas\") in 1996 from the Universidad Politécnica de Valencia, and earned MS (1999) and Ph.D. (2002) degrees in Computer Science from the University of Illinois at Urbana-Champaign. I received two national awards for academic excellence from Spain's Ministry of Education, and came to the United States on a four-year graduate fellowship from the Bank of Spain, for which I am forever grateful. While a graduate student at UIUC, I was inducted into the Honor Society of Phi Kappa Phi. Publications You can find a list of selected publications here. Program Committee Service HPCA '16 (Program Chair), ISCA '15, HPCA '15, Top Picks '15, HPCA '14, HPCA '13, ISCA '12, ISCA '11, ISCA '10, Top Picks '10, SC '10, MICRO '09 (Program Co-chair), ISCA '09, IISWC '09, HiPEAC '09 IISWC '08, DATE '08, MICRO '07, PACT '07, HiPC '07, SC '07, IPDPS '07, ISCA '06, DATE '06, MICRO '05, PACT '04, HPCA '04, ICPP '03. Research Group I lead the M3 Architecture Research Group, which is part of the Computer Systems Laboratory, and it comprises both graduate and undergraduate researchers. Academic Genealogy José Martínez, Ph.D. 2002, UIUC Josep Torrellas, Ph.D. 1992, Stanford John Hennessy, Ph.D. 1977, SUNY Stony Brook Dick Kieburtz, Ph.D. 1961, U. Washington Akira Ishimaru, Ph.D. 1958, U. Washington Gedaliah Held, Ph.D. 1954, U.C. Berkeley Samuel Silver, Ph.D. 1940, MIT John Slater, Ph.D. 1923, Harvard Percy Bridgman, Ph.D. 1908, Harvard Wallace Sabine, A.M. 1888, Harvard John Trowbridge, S.D. 1873, Harvard Joseph Lovering, A.B. 1833, Harvard Benjamin Peirce, A.B. 1829, Harvard Nathaniel Bowditch, M.A. 1802 (Honorary), Harvard",
  "content_length": 3923,
  "method": "requests",
  "crawl_time": "2025-12-01 13:35:38"
}