{
  "name": "Jovita Lukasik",
  "homepage": "https://www.vsa.informatik.uni-siegen.de/en/lukasik-jovita-0",
  "status": "success",
  "content": "Prof. Dr. Jovita Lukasik | VSA Universität Siegen Skip to main content Für eine korrekte Darstellung dieser Seite benötigen Sie einen XHTML-standardkonformen Browser, der die Darstellung von CSS-Dateien zulässt. Home People Publications Student Projects Teaching Webmail UNISONO mehr... Fakultät I Fakultät II Fakultät III Fakultät IV Kontakt Wegweiser Suche Erweiterte Suche Personensuche Name Vorname Veranstaltungssuche Nummer Titel Lehrender Katalog der UB Siegen Institute for Vision and Graphics Computergraphics Media Systems Realtime Learning Systems You are hereHome » Lukasik, Jovita Prof. Dr. Jovita Lukasik Address: Universität Siegen Lehrstuhl für Computer Vision Hölderlinstraße 3 57068 Siegen I work as a PostDoc in the DFG research unit Learning to Sense. My work on Neural Architecture Search during my PhD was  funded by the BMBF (Federal Ministry of Education and Research) in the project DeToL – Deep Topology Learning at the University of Mannheim.  I was also affiliated with MPII. I was part of the organization team of the second NAS workshop @ ICLR 2021. I am co-organizing a series of virtual seminars on AutoML. I defended my PhD Thesis on \"Topology Learning for Prediction, Generation, and Robustness in Neural Architecture Search\" on July 13, 2023 at the University of Mannheim! Publications Improving Native CNN Robustness with Filter Frequency Regularization Jovita Lukasik*, Paul Gavrikov*, Janis Keuper, Margret Keuper Transactions on Machine Learning Research (TMLR), 2023 [pdf] An Evaluation of Zero-Cost Proxies - from Neural Architecture Performance to Model Robustness Jovita Lukasik, Michael Moeller, Margret Keuper German Conference on Pattern Recognition (GCPR), 2023 [arXiv] Differentiable Architecture Search: a One-Shot Method? Jovita Lukasik*, Jonas Geiping*, Michael Moeller, Margret Keuper AutoML Conference Workshops (AutoML), 2023 Neural Architecture Design and Robustness: A Dataset Steffen Jung*, Jovita Lukasik*, Margret Keuper International Conference on Learning Representations (ICLR), 2023 [website] Learning Where to Look - Generative NAS is Surprisingly Efficient Jovita Lukasik* , Steffen Jung*, Margret Keuper European Conference on Computer Vision (ECCV), 2022 [arXiv] Surrogate NAS Benchmarks: Going Beyond the Limited Search Spaces of Tabular NAS Benchmarks Arber Zela*, Julien  Siems*, Lucas Zimmer*, Jovita Lukasik, Margret Keuper, Frank Hutter International Conference on Learning Representations (ICLR), 2022 [arXiv] Smooth Variational Graph Embeddings for Efficient Neural Architecture Search Jovita Lukasik, David Friede, Aber Zela, Frank Hutter, Margret Keuper International Joint Conference on Neural Networks (IJCNN), 2021 [arXiv] Neural Architecture Performance Prediction Using Graph Neural Networks Jovita Lukasik, David Friede, Heiner Stuckenschmidt, Margret Keuper German Conference on Pattern Recognition (GCPR), 2020 [arXiv] © Universität Siegen",
  "content_length": 2924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:05"
}