{
  "name": "Joyce Yue Chai",
  "homepage": "https://web.eecs.umich.edu/~chaijy",
  "status": "success",
  "content": "Joyce Y. Chai Joyce Y. Chai Professor Computer Science and Engineering 3632 Beyster University of Michigan Ann Arbor, MI 48105 Office phone: 1-734-764-3308 Email: chaijy AT umich.edu Situated Language and Embodied Dialogue (SLED) Research Group If you receive an email that claims to be from me (not originated from the umich.edu domain) and requests for information for a job application, that's a fraud! I will never post a job announcement and request for your personal information through email, phone or text. Please check the following link for more information:https://safecomputing.umich.edu/phishing-alerts/fraudulent-job-offers-impersonating-u-m-faculty-2022-04-19-000000. My research interests are in the area of natural language processing, situated dialogue agents, multimodal large language models, and embodied AI. I'm fascinated by how experience with the physical world and how social interaction shape language learning and language use; and is excited about developing human language technology that is sensorimotor-grounded, pragmatically-rich, and cognitively-motivated. My recent work has focused on grounded language processing to facilitate situated communication with robots and embodied AI agents. I'm a member of Michigan AI Lab and direct the Situated Langauge and Embodied Dialogue (SLED) research group . I am affiliated with Michigan Robotics Institute. I also served as Associate Director of Michigan Institute for Data and AI in Society (MIDAS)(2023-2025). Research Please visit our lab SLED website for research projects and publications. Teaching EECS 595: Natural Language Processing The field of Natural Language Processing (NLP) is primarily concerned with computer algorithms and systems to process human languages, for example, automatically interpret, generate, and learn natural language. The advances in deep learning have also paved the way to create large-scale language models and tackle many NLP problems in the real world. This course provides an introduction to the state of the art in NLP including large language models, syntax, semantics, discourse, and pragmatics. EECS 692: Advanced Artificial Intelligence Explore advanced topics in Artificial Intelligence, especially in the intersection of language, vision, machine learning, planning, decision making, and cognitive modeling towards embodied AI agents that can communicate, learn, reason, and act. Emphasize research methods and practice, through explicit instruction, analysis of current literature, replication of published findings. Coursework includes extensive reading, research and writing assignments, presentations, and a term project. Brief Bio Joyce Chai is a Professor in the Department of Electrical Engineering and Computer Science at the University of Michigan. She holds a Ph.D. in Computer Science from Duke University. Her research interests span from natural language processing and embodied AI to human-AI collaboration. Her current work explores the intersection between language, perception, and action to enable situated communication with embodied agents. She served on the executive board of NAACL and as Program Co-Chair for multiple conferences, most recently ACL 2020. She is a recipient of the NSF Career Award and multiple paper awards with her students (e.g., Best Long Paper Award at ACL 2010, Outstanding Paper Awards at EMNLP 2021 and ACL 2023). She is a Fellow of ACL.",
  "content_length": 3410,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:09"
}