{
  "name": "Joyce C. Ho",
  "homepage": "https://joyceho.github.io",
  "status": "success",
  "content": "Joyce C Ho 400 Dowman Dr Atlanta, GA 30322 (404)-727-5605 I am an associate professor in the Computer Science Department at Emory University. I have a PhD in Electrical and Computer Engineering from the University of Texas at Austin, and an MA and BS in Electrical Engineering and Computer Science from MIT. I previously co-founded a successful healthcare analytics company (Accordion Health) and worked at Lawrence Livermore National Laboratory. My research focuses on the development of novel data mining and machine learning algorithms to address problems in healthcare. Recent projects include identifying patient subgroups or phenotypes, integration of new streams of data, fusing different modalities of data (e.g., structured medical codes and unstructured text), and dealing with conflicting expert annotations. I am always looking for students (undergraduate, masters, and PhD). Please see my group page for more info about contacting me. news May 12, 2025 Congratulations to Alex Belov, Dani Roytburg, and Yella Diekmann for graduating with highest honors. Aug 01, 2024 Thrilled to be named to the inaugural FDA Digital Health Adivsory Committee. Aug 01, 2024 Excited to be the Director of Graduate Studies for the Emory Computer Science Master of Science Program. Dec 04, 2023 Honored to receive the 2023 ICDM Young Female Scholar in Data Science Award. Sep 28, 2023 Congratulations to Eric Lee for successfully defending his PhD dissertation! selected publications A comprehensive and improved definition for hospital-acquired pressure injury classification based on electronic health records: Comparative Study Mani Sotoodeh, Wenhui Zhang, Roy L Simpson, Vicki Stover Hertzberg, Joyce C Ho, and others JMIR Medical Informatics, 2023 HTML PDF SR-CoMbEr: Heterogeneous network embedding using community multi-view enhanced graph convolutional network for automating systematic reviews Eric W Lee and Joyce C Ho In European Conference on Information Retrieval, 2023 HTML PDF Best Paper Counterfactual and factual reasoning over hypergraphs for interpretable clinical predictions on EHR Ran Xu, Yue Yu, Chao Zhang, Mohammed K Ali, Joyce C Ho, and Carl Yang In Proceedings of the 2nd Machine Learning for Health symposium, 2022 HTML PDF GDA-AM: On the effectiveness of solving mini-max optimization via Anderson mixing Huan He, Shifan Zhao, Yuanzhe Xi, Joyce Ho, and Yousef Saad In International Conference on Learning Representations, 2022 HTML PDF GDA-AM: On the effectiveness of solving mini-max optimization via Anderson mixing Huan He, Shifan Zhao, Yuanzhe Xi, Joyce Ho, and Yousef Saad In International Conference on Learning Representations, 2022 HTML PDF Contact me via email.",
  "content_length": 2692,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:06"
}