{
  "name": "Joydeep Biswas",
  "homepage": "https://joydeepb.com",
  "status": "success",
  "content": "About Me About Me Associate Professor Computer Science Department, UT Austin Director of the Autonomous Mobile Robotics Laboratory Affilated with Texas Robotics, UT Machine Learning Laboratory, and UT Good Systems. Visiting Professor Isaac Robotics, NVIDIA joydeepb@cs.utexas.edu Interests Robot Perception, Motion Planning, Control Systems, AI, Deployed Robot Systems My ultimate goal is to have self-sufficient autonomous mobile robots working in human environments, performing tasks accurately and robustly. In support of this goal, I am interested in research in perception, planning, and control applied to autonomous mobile robots. My research in perception involves developing models and representations for a dynamic world, and algorithms to build and perform inference based on such models. My interests in planning include motion planning, multi-robot coordination, and task-based planning in domains including service mobile robots, and robot soccer. Prospective Students I am always eager to work with self-motivated students from all levels (PhD, MS, and undergraduate) with overlapping interests, especially if interested in working on actual robots deployed in the real world. For more details, please see the prospective students page. What Have The Robots Been Up To Recently? [Use playlist controls to navigate between video clips] News New NSF Research Traineeship Award -- Convergent, Responsible, and Ethical Artificial Intelligence Training Experience for Roboticists Aug 29, 2021 Awarded the NSF CAREER Award! Apr 13, 2021 New NSF Award, Introspective Perception and Planning for Long-Term Autonomy Jun 30, 2020 New NSF Award, Interactive Synthesis and Repair For Robot Programs May 31, 2020 Student poster award at Northrop Grumman University Symposium 2019! Oct 25, 2019 Moving to UT Austin Jul 16, 2019 IJCAI 2019 Early Career Spotlight Jul 16, 2019 Ocelot-IDE now live! Apr 25, 2019 Awarded a J.P. Morgan 2019 Faculty Research Award! Jan 31, 2019 Awarded an Amazon Research Award! Jan 15, 2019 Awarded a grant by Northrop Grumman Mission Systems Sep 11, 2018",
  "content_length": 2085,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:09"
}