{
  "name": "Joyram Chakraborty",
  "homepage": "https://www.towson.edu/fcsm/departments/computerinfosci/facultystaff/jchakraborty.html",
  "status": "success",
  "content": "Joyram Chakraborty | Towson University Skip to Main Content Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Give to TU Calendars & Events Directories SearchSearch Towson University Visit TU Apply Now Request Information Facts & Figures Mission & Strategic Plan Rankings & Achievements Administration Commitment to Diversity & Inclusion Accessibility Sustainability Consumer Information & Accreditation Visit TU Apply Now Request Information Undergraduate Studies Graduate Studies Accelerated Programs Research International Initiatives Colleges & Departments Off-Campus Locations Extended & Professional Education Summer Session Academic Services & Resources Commencement Visit TU Apply Now Request Information Undergraduate Admissions Graduate Admissions Tuition & Expenses Financial Aid Counselor & Advisor Resources Visit Campus Apply Now Request Information Visit TU Apply Now Request Information Student Involvement Housing & Dining Student Services & Resources Health & Well-being Safety & Security New Student & Family Programs Visit TU Apply Now Request Information Anchor Mission BTU-Partnerships for Greater Baltimore Business & Public Engagement Community Programs & Resources Arts & Culture Campus Landmarks & Features Planning Events & Conferences at TU Towson University SearchSearch Menu SearchSearch Go Back About TU Academics Admissions & Aid Student Life Campus & Community Information For Students Current myTU for Students Blackboard Email Towson Online Services OneCard/TU ID Card Library Academic Calendar University Store Athletics Future Majors Graduate Programs Application Request Information Take a Campus Tour Housing & Dining Tuition Financial Aid Parents Family Network Family Weekend Request Information Undergraduate Admissions Visit TU Tuition Financial Aid Emergency Text Alerts Alumni Tiger Connect Alumni Events Alumni Benefits University Store TU Magazine Request a Transcript Office of Alumni Relations Faculty & Staff myTU for Faculty & Staff Email Blackboard Timesheets TechHelp Library Academic Calendar TU Webcam Business BTU-Partnerships at Work for Greater Baltimore StarTUp Center for GIS Regional Economic Studies Institute Dr. Nancy Grasmick Leadership Institute Sponsorship & Advertising Opportunities Hiring TU Students Visit TUApply NowRequest Information Give to TU Calendars & Events Directories Joyram Chakraborty Professor & Program Director, B.S. Information Technology Contact Info Phone: 410-704-2109 Office: YR-469 Email: jchakraborty@towson.edu Education MBA, Marketing (2001) Louisiana Tech University \t\t\t\t\t\t\t\t\tMS Information Systems (2005) University of Maryland Baltimore County \t\t\t\t\t\t\t\t\tPh.D. Information Systems (2009) University of Maryland Baltimore County Areas of Expertise Human-Computer Interaction, Game Design, m-Health, Security Research: My research interest lie in the area of human-computer interaction. Specifically, I am interested in user centered design solutions in the areas of internationalization of user interfaces, gaming interface design, m-health, security and digital preservation. Much of research involves experimenting with human subjects to understand user preferences in the interaction with various types of interfaces. I use several data collection methods such as eye tracking, virtual reality, and survey data to better understand the end user. The findings from these studies typically allow for the development of more user friendly and inclusive software. I collaborate closely with researchers from several fields and institutions, namely IBM Research and the Johns Hopkins School of Public Health to develop a better understanding of user requirements that can be useful in the design and development of tools for a global audience. Selected Publications and Presentations: Stewart, O. T., Lubensky D. and J. Chakraborty, “Systems and Methods for Automatically Determining Culture-Based Behavior in Customer Service Interactions,” patent number 8,346,556 and 8,478,594 assigned to T.J. Watson, IBM Research. 2013. Alnahari MM, Chakraborty J, Mohamed M, Ali-Gombe A. Arabic web accessibility analysis: findings from a usability study of Arabian web developers. Human-Intelligent Systems Integration. 2022 Dec;4(3-4):81-96. Badejo JA, Chakraborty J. The effects of technology on incarcerated student motivation and engagement in classroom-based learning. Human-Intelligent Systems Integration. 2022 Aug 19:1-0. Oladapo H, Chakraborty J. Blood Pressure Concerns: Findings from a Usability Study of Culturally Infused mHealth Design. In Universal Access in Human-Computer Interaction. Novel Design Approaches and Technologies: 16th International Conference, UAHCI 2022, Held as Part of the 24th HCI International Conference, HCII 2022, Virtual Event, June 26–July 1, 2022, Proceedings, Part I 2022 Jun 16 (pp. 296-305). Cham: Springer International Publishing. Kamegne Y, Owusu E, Chakraborty J. Bridging the Gap Between Usability and Security: Cultural Adaptation of a Graphical User Authentication. In Universal Access in Human-Computer Interaction. Novel Design Approaches and Technologies: 16th International Conference, UAHCI 2022, Held as Part of the 24th HCI International Conference, HCII 2022, Virtual Event, June 26–July 1, 2022, Proceedings, Part I 2022 Jun 16 (pp. 260-269). Cham: Springer International Publishing. Yin Y, Alqahtani Y, Feng JH, Chakraborty J, McGuire MP. Deep Learning Methods for the Prediction of Information Display Type Using Eye Tracking Sequences. In2021 20th IEEE International Conference on Machine Learning and Applications (ICMLA) 2021 Dec 13 (pp. 601-605). IEEE. Mohamed M, Porterfield T, Chakraborty J. Cross-cultural effects on graphical password memorability and design. Journal of Systems and Information Technology. 2021 Apr 6;23(1):82-108. Hunt S, Chakraborty J. Dose verification errors in hospitals: literature review of the eMAR-based systems used by nurses. Journal of Nursing Care Quality. 2021 Apr 6;36(2):182-7. Yin Y, Alqahtani Y, Feng JH, Chakraborty J, McGuire MP. Classification of eye tracking data in visual information processing tasks using convolutional neural networks and feature engineering. SN Computer Science. 2021 Apr;2:1-26. Oladapo H, Chakraborty J. Cross-cultural differences of designing mobile health applications for Africans. InHCI International 2021-Late Breaking Papers: Design and User Experience: 23rd HCI International Conference, HCII 2021, Virtual Event, July 24–29, 2021, Proceedings 23 2021 (pp. 554-563). Springer International Publishing. Nicholson S, Chakraborty J, Ali-Gombe A, Hammell II RJ. Data Sharing and Exposure: Findings from Descriptive and Network Analysis of Instant Games on Facebook. In Proceedings of the Conference on Information Systems Applied Research ISSN 2021 (Vol. 2167, p. 1508). Oladapo H, Owusu E, Chakraborty J. Effects of culturally tailored user interface design. In Advances in Usability, User Experience, Wearable and Assistive Technology: Proceedings of the AHFE 2021 Virtual Conferences on Usability and User Experience, Human Factors and Wearable Technologies, Human Factors in Virtual Environments and Game Design, and Human Factors and Assistive Technology, July 25-29, 2021, USA 2021 (pp. 845-853). Springer International Publishing. Alnahari MM, Chakraborty J, Mohamed M. Web accessibility research and practice: the need for Arabic web accessibility improvement. International Journal of Art, Culture, Design, and Technology (IJACDT). 2021 Jan 1;10(1):36-49. Mohamed M, Chakraborty J, Pillutla S. Effects of culture on graphical password image selection and design. Journal of Systems and Information Technology. 2020 Apr 14;22(1):73-95. Owusu, E., & Chakraborty, J. (2019, February). Usability impact of user perceptions in mHealth—the case of ghanaian migrants. In International Conference on Intelligent Human Systems Integration (pp. 557-562). Springer, Cham. Alqahtani, Y., Chakraborty, J., McGuire, M., & Feng, J. H. (2019, July). Understanding Visual Information Processing for American vs. Saudi Arabian Users. In International Conference on Applied Human Factors and Ergonomics (pp. 229-238). Springer, Cham. Hunt, S., & Chakraborty, J. (2019, July). Electronic Health Records in Hospitals: Preventing Dosing Errors in the Medication Administration Context. In International Conference on Applied Human Factors and Ergonomics (pp. 65-76). Springer, Cham. Alqahtani, Y., McGuire, M., Chakraborty, J., & Feng, J. H. (2019, July). Understanding How ADHD Affects Visual Information Processing. In International Conference on Human-Computer Interaction (pp. 23-31). Springer, Cham. Alnahari, M., & Chakraborty, J. (2019, July). Preliminary Findings from a Study of an Arabic Accessibility Tool Checker. In International Conference on Human-Computer Interaction (pp. 201-210). Springer, Cham. Owusu, E., & Chakraborty, J. (2019, July). User Requirements Gathering in mHealth: Perspective from Ghanaian End Users. In International Conference on Human-Computer Interaction (pp. 386-396). Springer, Cham. Shipley, N., & Chakraborty, J. (2019). Big Data and mHealth: Increasing the Usability of Healthcare Through the Customization of Pinterest – Li",
  "content_length": 11770,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:10"
}