{
  "name": "Jozef Hooman",
  "homepage": "http://www.cs.ru.nl/~hooman",
  "status": "success",
  "content": "Jozef Hooman Jozef Hooman (prof.dr. J.J.M. Hooman) Address RU Nijmegen (emeritus): Institute for Computing and Information Sciences Department of Software Science Faculty of Science Radboud University Nijmegen Mailbox number 47 P.O. Box 9010 NL-6500 GL Nijmegen The Netherlands LinkedIn Address TNO-ESI (retired): TNO-ESI Visiting address: High Tech Campus 25 5656 AE Eindhoven Mail address: P.O. Box 6235 5600 HE Eindhoven The Netherlands Research interests: The ComMA approach for modeling and analysis of interface specifications, supported by tooling of the open source project CommaSuite of the Eclipse foundation. Co-simulation of discrete-time and continuous-time models using CoHLA. Domain Specific Languages. Model-based development of embedded systems. Formal specification and compositional verification of distributed real-time and fault-tolerant systems. Combinations of industrial modeling languages with formal methods. Publications: A number of publications is available on-line; the full list is available in pdf format. Selected completed research projects: NWO-TTW project Robust Motion Control - part of Perspectief Programme Robust design of Cyber-Physical Systems (CPS) [Final report CPS] Allegio: Composable Embedded Systems for Healthcare, COMMIT project Artemis Innovation Pilot Project Crystal (CRitical sYSTem engineering AcceLeration) on interoperable tools and techniques for the development of safety-critical embedded systems Care4Me: Cooperative Advanced REsearch for Medical Efficiency, ITEA project Trader: Reliability by Design, with NXP Semiconductors as carrying industrial partner Boderc: Beyond the Ordinary: Design of Embedded Real-time Control, with Oc Technologies as carrying industrial partner Ideals: Evolvability, with ASML as carrying industrial partner Omega: Correct Development of Real-Time Embedded Systems, EU-IST project",
  "content_length": 1873,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:10"
}