{
  "name": "João Ribeiro 0002",
  "homepage": "https://sites.google.com/site/joaorib94",
  "status": "success",
  "content": "João RibeiroSearch this siteEmbedded FilesSkip to main contentSkip to navigationOlá! I'm João, an assistant professor in the Department of Mathematics at IST - Universidade de Lisboa and a researcher at Instituto de Telecomunicações. Previously, I was an assistant professor in the CS Department of Universidade Nova de Lisboa. Before that, I was a post doctoral fellow in the CS Department of Carnegie Mellon University, hosted jointly by Vipul Goyal and Venkatesan Guruswami.I have also spent some time at CQT (hosted by Divesh Aggarwal), UIUC (hosted by Olgica Milenkovic), UMich (hosted by Mahdi Cheraghchi), and the Simons Institute for the Theory of Computing (as a long-term visitor in the \"Error-Correcting Codes: Theory and Practice\" program).I received my PhD from the Department of Computing of Imperial College London, where I was advised by Mahdi Cheraghchi. Before that, I received an MSc in Computer Science from ETH Zurich and a BSc in Applied Mathematics and Computation from IST - Universidade de Lisboa.Research interests: I am interested in coding theory, cryptography, information theory, and pseudorandomness.I am looking to recruit multiple PhD students and postdocs under my ERC Starting Grant project on coding against synchronization errors. For more information, see this page.If you are an MSc student at IST, you are welcome to reach out to me about MSc thesis projects. I have paid research scholarships available for MSc students interested in undertaking research projects on coding theory and information theory.If you are a BSc student (at IST or elsewhere), you are also welcome to contact me about BSc final projects and independent research projects.Conference program committees: TCC 2025, CRYPTO 2025, RANDOM 2024, ITC 2024, TCC 2023, ITC 2023.Email: jribeiro@tecnico.ulisboa.ptCVORCID: 0000-0002-9870-0501DBLPGoogle ScholarMathematics GenealogyMathSciNetGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 1942,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:29"
}