{
  "name": "João F. Ferreira 0001",
  "homepage": "https://joaoff.com",
  "status": "success",
  "content": "João F. FerreiraSearchAwarded an Amazon Research Award on Automated Reasoning!I’ve received an Amazon Research Award on Automated Reasoning for my proposal ‘Polyglot Automated Program Repair for Infrastructure as Code’.See more detailsACM SIGSOFT Distinguished Paper award🏆 Our ICSE 2025 paper Rango: Adaptive Retrieval-Augmented Proving for Automated Software Verification has won an ACM SIGSOFT Distinguished Paper award! 🏆See Featured PublicationsInfraFix: Technology-Agnostic Repair of Infrastructure as CodeSee our new ISSTA 2025 tool demonstration paper on automated repair of Infrastructure as Code!See Featured PublicationsDo Experts Agree About Smelly Infrastructure?Check out our new study published at IEEE Transactions on Software Engineering (2025)See Featured PublicationsNew papers on SmartBugs 2.0Two new papers on SmartBugs 2.0 published at ASE 2023 and EMSE 2024.See Featured PublicationsResearch OpportunitiesI am always looking for new talented research students and post-doc researchers. Join me in beautiful Lisbon!Learn MorePrevious NextJoão F. FerreiraComputer ScientistSoftware Reliability LabFEUP, University of PortoINESC-ID, LisboaAboutJoão F. Ferreira is an associate professor at the Faculty of Engineering, University of Porto, and a researcher at INESC-ID. He co-leads the Software Reliability Lab. He coordinates the Automated Reasoning and Software Reliability area at INESC-ID. His work spans from empirical software engineering methods that can inform practitioners and direct future research, to formal methods that can verify the absence of certain types of bugs. For more details, see selected publications.Latest News[25 Jul 2025]: ICSE 2020 paper is the most cited according to 2025 Scholar Metrics[3 Jun 2025]: Awarded an Amazon Research Award on Automated Reasoning![3 Apr 2025]: ACM SIGSOFT Distinguished Paper Award at ICSE 2025[1 Mar 2025]: InfraGov: New Funded Project on Reliable and Secure IT InfrastructureFeatured PublicationsView all the publicationsRobert Thompson, Nuno Saavedra, Pedro Carrott, Kevin Fisher, Alex Sanchez-Stern, Yuriy Brun, João F. Ferreira, Sorin Lerner, Emily First (2025). Rango: Adaptive Retrieval-Augmented Proving for Automated Software Verification. In ICSE 2025. CORE A* conference.🏆 ACM SIGSOFT Distinguished Paper award.PDF Code DatasetNuno Saavedra, João F. Ferreira, Alexandra Mendes (2025). InfraFix: Technology-Agnostic Repair of Infrastructure as Code. In ISSTA 2025, Tool Demonstrations Track. CORE A conference.PDF Code Project VideoSogol Masoumzadeh, Nuno Saavedra, Rungroj Maipradit, Lili Wei, João F. Ferreira, Dániel Varró, Shane McIntosh (2025). Do Experts Agree About Smelly Infrastructure?. In TSE 2025. Q1 journal.PDF ProjectDavid Ferreira, Alexandra Mendes, João F. Ferreira, Carolina Carreira (2025). Contract Usage and Evolution in Android Mobile Applications. In ECOOP 2025. CORE A conference.PDF CodePedro Carrott, Nuno Saavedra, Robert Thompson, Sorin Lerner, João F. Ferreira, Emily First (2024). CoqPyt: Proof Navigation in Python in the Era of LLMs. In FSE 2024, Demonstrations Track. CORE A* conference.PDF Code VideoMonika di Angelo, Thomas Durieux, João F. Ferreira, Gernot Salzer (2024). Evolution of automated weakness detection in Ethereum bytecode: a comprehensive study. In EMSE, 29(2), pp. 1-44. Q1 Journal.PDF Code Project DOINuno Saavedra, João Gonçalves, Miguel Henriques, João F. Ferreira, Alexandra Mendes (2023). Polyglot Code Smell Detection for Infrastructure as Code with GLITCH. In ASE 2023, Tool Demo Track. CORE A* conference.PDF Code ProjectMonika di Angelo, Thomas Durieux, João F. Ferreira, Gernot Salzer (2023). SmartBugs 2.0: An Execution Framework for Weakness Detection in Ethereum Smart Contracts. In ASE 2023, Tool Demo Track. CORE A* conference.PDF Code ProjectHenrique Botelho Guerra, João F. Ferreira, João Costa Seco (2023). Hoogle⋆: Constants and λ-abstractions in Petri-net-based Synthesis using Symbolic Execution. In ECOOP 2023. CORE A conference.🏆 Awarded: Artifact Evaluation Award (Available and Reusable).PDF Code Source DocumentNuno Saavedra, João F. Ferreira (2022). GLITCH: Automated Polyglot Security Smell Detection in Infrastructure as Code. In ASE 2022. CORE A* conference.🏆 Awarded: Artifact Evaluation Award (Reusable).PDF Dataset ProjectJoão F. Ferreira, Pedro Cruz, Thomas Durieux, Rui Abreu (2020). SmartBugs: A Framework to Analyze Solidity Smart Contracts. In ASE 2020, Tool Demo Track. CORE A* conference.PDF Code Dataset ProjectThomas Durieux, João F. Ferreira, Rui Abreu, Pedro Cruz (2020). Empirical Review of Automated Analysis Tools on 47,587 Ethereum Smart Contracts. In ICSE 2020. CORE A* conference.🏆 Awarded: Artifact Evaluation Award (Available, Reusable). Most cited paper from ICSE 2020 (Google Scholar Metrics).PDF Code Dataset ProjectJulie Porteous, João F. Ferreira, Alan Lindsay, Marc Cavazza (2020). Extending Narrative Planning Domains with Linguistic Resources. In AAMAS 2020. CORE A* conference.🏆 Invited to journal publication by Autonomous Agents and Multi-Agent Systems (JAAMAS) (see JAAMAS 2021 extended paper).PDF ProjectThomas Hayton, Julie Porteous, João F. Ferreira, Alan Lindsay (2020). Narrative Planning Model Acquisition from Text Summaries and Descriptions. In AAAI 2020. CORE A* conference.PDF ProjectTony Hoare, Alexandra Mendes, João F. Ferreira (2019). Logic, Algebra, and Geometry at the Foundation of Computer Science. In FMTea 2019.PDF ProjectFeatured PostsView all the postsICSE 2020 paper is the most cited according to 2025 Scholar MetricsI’m happy to share that, according to the 2025 Scholar Metrics:Our paper “Empirical Review of Automated Analysis Tools on 47,587 Ethereum Smart Contracts” (T. Durieux, J.F. Ferreira, R. Abreu, P. Cruz – ICSE 2020) is the most cited paper from ICSE!And our paper “SmartBugs: A Framework to Analyze Solidity Smart Contracts” (J.F. Ferreira, P. Cruz, T. Durieux, R. Abreu – ASE 2020) is the fourth most cited paper from ASE!João F. FerreiraJul 25, 2025 2 min read NewsAwarded an Amazon Research Award on Automated Reasoning!I’m excited to share that I’ve received an Amazon Research Award on Automated Reasoning! The award will support my research on automated program repair for Infrastructure as Code.João F. FerreiraJun 3, 2025 1 min read News, AwardsACM SIGSOFT Distinguished Paper Award at ICSE 2025Our paper “Rango: Adaptive Retrieval-Augmented Proving for Automated Software Verification” has received an ACM SIGSOFT Distinguished Paper Award at ICSE 2025.João F. FerreiraApr 3, 2025 2 min read News, AwardsInfraGov: New Funded Project on Reliable and Secure IT InfrastructureI am very pleased to announce that we secured funding for the InfraGov project, a new research project funded to address critical challenges in the reliability and security of Infrastructure as Code (IaC) used in Public Administration.João F. FerreiraMar 1, 2025 1 min read News, FundingSmartBugs: An Execution Framework for Automated Analysis of Smart ContractsSmartBugs is a new execution framework that simplifies the execution of automated analysis tools on datasets of Solidity smart contracts. SmartBugs currently supports 10 tools. It has a simple plugin system to easily add new analysis tools, based on Docker images. It supports parallel execution of the tools to speed up the execution time. It also normalizes the output that tools produce to facilitate experiments. SmartBugs was developed in the context of an empirical review of automated analysis tools on 47,587 Ethereum smart contracts.João F. FerreiraMar 5, 2020 4 min readRecent PublicationsView all the publicationsQuickly discover relevant content by filtering publications.Robert Thompson, Nuno Saavedra, Pedro Carrott, Kevin Fisher, Alex Sanchez-Stern, Yuriy Brun, João F. Ferreira, Sorin Lerner, Emily First (2025). Rango: Adaptive Retrieval-Augmented Proving for Automated Software Verification. In ICSE 2025. CORE A* conference.🏆 ACM SIGSOFT Distinguished Paper award.PDF Code DatasetNuno Saavedra, João F. Ferreira, Alexandra Mendes (2025). InfraFix: Technology-Agnostic Repair of Infrastructure as Code. In ISSTA 2025, Tool Demonstrations Track. CORE A conference.PDF Code Project VideoSogol Masoumzadeh, Nuno Saavedra, Rungroj Maipradit, Lili Wei, João F. Ferreira, Dániel Varró, Shane McIntosh (2025). Do Experts Agree About Smelly Infrastructure?. In TSE 2025. Q1 journal.PDF ProjectDavid Ferreira, Alexandra Mendes, João F. Ferreira, Carolina Carreira (2025). Contract Usage and Evolution in Android Mobile Applications. In ECOOP 2025. CORE A conference.PDF CodePedro Carrott, Nuno Saavedra, Robert Thompson, Sorin Lerner, João F. Ferreira, Emily First (2024). CoqPyt: Proof Navigation in Python in the Era of LLMs. In FSE 2024, Demonstrations Track. CORE A* conference.PDF Code VideoSee all publications Selected ProjectsView all the projectsReliable DevOpsMethods and tools for reliable infrastructure as code.SmartbugsExecutional framework for running analysis tools on smart contracts.Password SecurityTools and methods to improve password security.Interactive NarrativesTools and methods for computer-generated narratives.FM EducationTools, methods, and resources that support teaching formal methods.Recent PostsView all the postsICSE 2020 paper is the most cited according to 2025 Scholar MetricsI’m happy to share that, according to the 2025 Scholar Metrics:Our paper “Empirical Review of Automated Analysis Tools on 47,587 Ethereum Smart Contracts” (T. Durieux, J.F. Ferreira, R. Abreu, P. Cruz – ICSE 2020) is the most cited paper from ICSE!And our paper “SmartBugs: A Framework to Analyze Solidity Smart Contracts” (J.F. Ferreira, P. Cruz, T. Durieux, R. Abreu – ASE 2020) is the fourth most cited paper from ASE!João F. FerreiraJul 25, 2025 2 min read NewsAwarded an Amazon Research Award on Automated Reasoning!I’m excited to share that I’ve received an Amazon Research Award on Automated Reasoning! The award will support my research on automated program repair for Infrastructur",
  "content_length": 11464,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:16"
}