{
  "name": "João Lourenço",
  "homepage": "https://docentes.fct.unl.pt/joao-lourenco",
  "status": "success",
  "content": "João Lourenço João LourençoChanging the world, one student at a time… Computer Science Department, NOVA School of Science and Technology, NOVA University Lisbon, Quinta da Torre, P-2829-516 CAPARICA, Portugal — joao.lourenco [AT] fct [DOT] unl [DOT] pt (email) Bio Announcements Publications Projects Advisees Software Photos Feeds Links Short Bio João Lourenço is an Associate Professor at the Computer Science Department of the NOVA School of Science and Technology of NOVA University Lisbon (NOVA FCT) and Co-Director of the Institute for the Development of New Technologies (UNINOVA). He received his Ph.D. from NOVA University Lisbon in 2004 with a thesis on debugging of distributed programs.  He is a founding member of the NOVA Laboratory for Computer Science and Informatics (NOVA LINCS) and his primary research interests include in-memory data management for parallel and large-scale computing systems, testing and debugging of concurrent programs, and edge/fog computing. He is a member of the advisory board and steering committees of several International Conferences and Research Networks. He is co-author of more than 50 articles/papers and received a Distinguished Paper Award in Euro-Par 2012 and the Best Paper Award in HVC 2012. He was a visiting researcher at IBM Research Laboratory at Haifa, IL, in 2011; at the University of S. Paulo (at S. Carlos), BR, in 2014; and at the University of Brno, CZ, in 2015. He is a regular contributerr to the LaTeX community and the author of the popular NOVAthesis LaTeX thesis template. More about me at: DBLP Research Page Google Scholar Researcher page ACM DIgital Library Research Page NOVA LINCS Research Center web site ORCID Research Page NOVAthesis LaTeX template Did you get here looking for the NOVAthesis LaTeX template? Just download it from the github repository or use the template in Overleaf. You may also visit my blog (at https://novathesis.blogspot.pt) on Technical and Scientific Communication, including tips and tricks for LaTeX and the NOVAthesis template. Other LaTeX contrributions Package name Description Repo CTAN novathesis A LaTeX template for academic monographs (e.g., dissertations and thesis). This template serves both beginners and proficient LaTeX users. √ Overleaf coloredtheorem A colourful boxed theorem environment. √ √ stocksize LateX package that allows changing the paper (stock) size in thhe middle of the document. √ √ biblatex-cse A BibLaTeX style that implements the bibliography style of theCouncil of Science Editors (CSE) for BibLaTeX. √ √ novafctletterhead Letterhead paper for the NOVA School of Science and Technology (FCT-NOVA) √ uninovaletterhead Letterhead paper for the Instiute for the Development of New Technologies (UNINOVA). √ Enter your keywords: Featured Posts LaTeX thesis template “NOVAthesis” Latest Announcements NOVAthesis LaTeX template for FCT-NOVA NOVAthesis Word template for FCT-NOVA NOVAthesis blog SAC — MUSEPAT 2015 UNL Thesis Template (release 2.4.5) Participation in INForum 2015 more © FCT/UNL - 2025Login Powered by OpenScholar",
  "content_length": 3068,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:18"
}