{
  "name": "João Leitão 0001",
  "homepage": "http://asc.di.fct.unl.pt/~jleitao",
  "status": "success",
  "content": "João Leitão's Homepage | Home | Curriculum | Research | Teaching | Publications | Students | João Leitão's Homepage : Home João Carlos Antunes Leitão NOVA Laboratory for Computer Science and Informatics Faculdade de Ciências e Tecnologia Universidade Nova de Lisboa Costa da Caparica, Portugal Tel. Internal line: 10765 Telephone - Department General Phone: (+351) 212 948 536 Telephone - Institution General Phone: (+351) 212 948 500 Twitter: @jcaleitao Google Scholar Profile You can find me in Mastodon. I operate my own instance feel free to register there. Welcome to my home page. I am an Associate Professor in the Informatics Department at Faculdade de Ciências e Tecnologia of the Universidade Nova de Lisboa, and an Integrated Member of the NOVA Laboratory for Computer Science and Informatics (NOVA LINCS). I conduct my research in the context of the Computer Systems Group. My research focus on the scalability and dependability of large-scale distributed systems, with focus on cloud computing environments, particularly in geo-distributed settings, and peer-to-peer systems. This research is alligned with the strategic plan of NOVA LINCS to develop novel solutions for supporting future large-scale distributed systems. I am involved as work package leader in the European research project TaRDIS. I was also part of the European Research Projects Syncfree and was local co-coordinator and work package leader in project LightKone. I have a Ph.D. from the Instituto Superior Técnico (IST) where I was lucky enough to be advised by Prof. Luis Rodrigues. My Ph.D. research was focused on devising and exploiting different techniques to manage the topology of unstructured overlay networks in P2P setting. In more detail, the goal was to imbue some form of relaxed topology properties to random overlays, as to improve the performance of P2P services and applications executed on top of them. Feel free to check my Ph.D. thesis for further detail in my publications page. Feel free to check out my publications section to see what I have been meddling with and also my research section to learn more of my interests. I am also planning to add some new, and not so work related, sections to this page so do not forget to come back later and see it. News and Events: The babel programming framework is evolving to have new features geared towards self-configuration, self-management, and security. You can check (some of) our efforts in the evolution of Babel in the public repositories of work package 6 of the european project TaRDIS in here. Soon we will have news with Babel moving to Android devices. Random Quote: \"Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the universe trying to build bigger and better idiots. So far, the universe is winning.\", Robert Cringley © 2007 Todos os direitos reservados. All rights reserved. Webdesign by Gonçalo João.HTML, CSS, SSI Technologies used. Color Scheme Sus Scrofa.",
  "content_length": 2996,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:19"
}