{
  "name": "João Madeiras Pereira",
  "homepage": "http://lisboa.academia.edu/Jo%C3%A3oMadeirasPereira",
  "status": "success",
  "content": "João Madeiras Pereira - Universidade de Lisboa Skip to main content Academia.edu no longer supports Internet Explorer.To browse Academia.edu and the wider internet faster and more securely, please take a few seconds to upgrade your browser. Log InSign UpLog InSign Upmore AboutPressPapersTermsPrivacyCopyright We're Hiring! Help Centerless João Madeiras PereiraUniversidade de Lisboa, Department of Electrical and Computer Engineering (DEEC), Department MemberaddFollowdoneFollowingFollowers23Following4Co-author1Public ViewsRelated Authors Krzysztof PiechLazarski University Alexandra TragakiHarokopio University Mika OKUSHIMA なおみ 加納 Jun HonnaRitsumeikan University Subhan YazidUIN Sunan Kalijaga Yogyakarta Daria Keiss-DolańskaZespół Szkół Ogólnokształcących Nr 6 Torben Toldam-AndersenUniversity of Copenhagen Naonori Tsuda Nick RastinInterests UploadsPapers by João Madeiras PereiraDispositivo de Interacção para Ecrã de Grandes DimensõesDownload Challenges of Introducting Serious Games and Virtual Worlds in Educational CurriculumAlthough the impact that Virtual Worlds and Serious Games can have on learning efficacy and effic... more Although the impact that Virtual Worlds and Serious Games can have on learning efficacy and efficiency has been recognized, there is still many open questions related to this issue. Specifically there aren't guidelines or standards to help practitioners introduce this kind of technologies in a learning environment. In this chapter, the authors describe two experiments involving virtual worlds and serious games in a learning environment. These experiments allowed the authors to understand the real potential of this kind of technology, but also some of the difficulties one can come across. The authors hope that the experiments described in this chapter can serve as a basis for similar experiments done by other practitioners. Finally, some of the pitfalls that should be avoided are described as a set of lessons learnt at the end of the chapter.Download A framework for heterogeneous concurrency control policies in distributed applicationsProceedings of the 8th International Workshop on Software Specification and DesignPage 1. A Framework for Heterogeneous Concurrency Control Policies in Distributed Applications An... more Page 1. A Framework for Heterogeneous Concurrency Control Policies in Distributed Applications Ant&amp;i0 Rito Silva, Jo50 Pereira and Jod Alves Marques INESWIST Technical University of Lisbon Lisboa, Portugal email: Rito ... Critical TransportGamification: Concepts, Methodologies, Tools, and Applications An efficient matching solution for 3D modelling of laser scanned and photogrammetric data for digital documentation: the Mosteiro da Batalha case studyJournal of Real-Time Image Processing, 2012ABSTRACT Advances in both terrestrial laser scanning hardware and photogrammetric systems combine... more ABSTRACT Advances in both terrestrial laser scanning hardware and photogrammetric systems combined are creating increasingly precise and rich 3D coloured data. In this article we show how computer graphics and visualization techniques have played an important role in real-time visualization, data management, modelling, and data fusion in an increasing number of applications such as surveying engineering, structure analysis, architecture, archaeology and cultural heritage. Specifically, we describe the typical modelling steps involved in the creation of a range of digital documents provided by the 3D digitization company Artescan to customers. We present how these modelling steps were applied in the context of creating digital documents used in the preservation of Mosteiro da Batalha. VIDA: Visualizador Interactivo de Dados (biomecânicos) Aumentados Computer Vision and Computer Graphics. Theory and ApplicationsCommunications in computer and information science, 2009This book constitutes the refereed proceedings of the International Conference on Computer Vision... more This book constitutes the refereed proceedings of the International Conference on Computer Vision and Computer Graphics Theory and Applications, Visigrapp 2007, held in Barcelona, Spain, in March 2007. The 18 revised full papers presented were carefully reviewed and selected from a total of 382 submissions. The papers are organized in topical sections on geometry and modeling; animation and simulation; interactive environments; image formation and processing; image analysis; image understandungas well as motion, tracking and stereo vision. Human-Robot Collaboration (HRC) with Vision Inspection for PCB Assembly Computer Vision and Computer Graphics - Theory and Applications: International Conference, VISIGRAPP 2008, Funchal-Madeira, Portugal, January 22-25, 2008. ... in Computer and Information Science)This book constitutes the refereed proceedings of the International Conference on Computer Vision... more This book constitutes the refereed proceedings of the International Conference on Computer Vision and Computer Graphics Theory and Applications, Visigrapp 2007, held in Barcelona, Spain, in March 2007. The 18 revised full papers presented were carefully reviewed and selected from a total of 382 submissions. The papers are organized in topical sections on geometry and modeling; animation and simulation; interactive environments; image formation and processing; image analysis; image understandungas well as motion, tracking and stereo vision. Multiview layered depth imageInternational Conference in Central Europe on Computer Graphics and Visualization, 2017Layered Depth Images (LDI) compactly represent multiview images and videos and have widespread us... more Layered Depth Images (LDI) compactly represent multiview images and videos and have widespread usage in image-based rendering applications. In its typical use case scenario of representing a scanned environment, it has proven to be a less costly alternative than separate viewpoint encoding. However, higher quality laser scanner hardware and different user interaction paradigms have emerged, creating scenarios where traditional LDIs have considerably lower efficacy. Wide-baseline setups create surfaces aligned to the viewing rays producing a greater amount of sparsely populated layers. Free viewpoint visualization suffers from the variant quantization of depths on the LDI algorithm, reducing resolution of the dataset in uneven directions. This paper presents an alternative representation to the LDI, in which each layer of data is positioned in different viewpoints that coincide with the original scanning viewpoints. A redundancy removal algorithm based on world-space distances as opposed to to image-space is discussed, ensuring points are evenly distributed and are not viewpoint dependent. We compared our proposed representation with traditional LDIs and viewpoint dependent encoding. Results showed the multiview LDI (MVLDI) creates a smaller number of layers and removes higher amounts of redundancy than traditional LDIs, ensuring no relevant portion of data is discarded in wider baseline setups.Download Computer Vision and Computer Graphics. Theory and Applications: International Conference VISIGRAPP 2007, Barcelona, Spain, March 8-11, 2007, Revised Selected ... in Computer and Information Science)Springer eBooks, Dec 18, 2008... Organization IX Nadia Magnenat-Thalmann, Switzerland Marcus Magnor, Germany Stephen Mann, Can... more ... Organization IX Nadia Magnenat-Thalmann, Switzerland Marcus Magnor, Germany Stephen Mann, Canada Michael Manzke, Ireland Michael McCool ... Fisher, UK Jan Flusser, Czech Republic Alejandro Frangi, Spain Donald Fraser, Australia Sidharta Gautama, Belgium Daniel ... A Real-Time Terrain Ray-Tracing EngineRay Tracing is a rendering algorithm, capable of generating highly realistic images, typically em... more Ray Tracing is a rendering algorithm, capable of generating highly realistic images, typically employed in non-interactive applications that disregard real time performance and focus exclusively on image quality. As technological advances progressively improve GPU performance, many Ray Tracing algorithms have been proposed to render virtual scenes in real time with better quality than rasterization, which is more widely used in real time applications. Moreover, several works have demonstrated that ray casting is, by definition, a high performance alternative to rasterization when it comes to terrain rendering. Based on an analysis of several terrain ray tracing algorithms, a real time terrain ray tracing engine was implemented leveraging those algorithms. The implemented engine does not require conversion from heightmaps to polygonal meshes, employs a level-of-detail scheme based on the three-dimensional distance from the viewer and is also capable of secondary ray tracing for shadows, which has not been applied in previous works.Download An haptic-based immersive environment for shape analysis and modellingJournal of Real-time Image Processing, Nov 12, 2009Currently, the design of aesthetic products is a process that requires a set of activities where ... more Currently, the design of aesthetic products is a process that requires a set of activities where digital models and physical mockups play a key role. Typically, these are modified (and built) several times before reaching the desired design, increasing the development time and, consequently, the final product cost. In this paper, we present an innovative design environment for CAD (Computer-aided design) surface analysis. Our system relies on a direct visuo-haptic display system, which enables users to visualize models using a stereoscopic view, and allows the evaluation of sectional curves using touch. Profile curves are rendered using an haptic device that deforms a plastic strip, thanks to a set of actuators, to reproduce the curvature of the shape co-located with the virtual model. By touching the strip users are able to evaluate shape characteristics, such as curvature or",
  "content_length": 18768,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:20"
}