{
  "name": "Ju Ren 0001",
  "homepage": "https://juren1987.github.io",
  "status": "success",
  "content": "Welcome to Ju Ren's Homepage Ju Ren,  Ph.D. Depart. of Computer Science and Techology Tsinghua University Address: FIT 3529, Shuangqing Road, Tsinghua University, Beijing, 100084 China Email: renju AT tsinghua.edu.cn NEWS Nov. 2025 - 3 paper were conditionally accepted by ACM MobiCom 2026 and one paper was accpeted by ACM KDD 2026. Congratulations to Yongjian, Shuning, Yizhe and Chenxi! Aug. 2025 - One paper was accepted by EuroSys 2026 and one paper was accpeted by EMNLP 2025. Congratulations to Zixu and Ziqing! July 2025 - Our paper, \"Cross-Modal Federated Learning Among Unimodal Devices\", was accepted by ACM IMWUT/Ubicomp. Congratulations to Yongheng！ July 2025 - Our paper, \"Bridging Storage and Execution: A Semantic Virtual Bus for On-Demand Application Streaming\", was accepted by USENIX NSDI 2026. Congratulations to Jun！ June 2025 - 2 papers were accepted by ACM MobiCom 2025. Congratulations to Jinrui and Hao！ May 2025 - 2 papers were accepted by IEEE/ACM IWQoS 2025. Congratulations to Guanbo and Ziyan！ Apr. 2025 - 2 papers were accepted by USENIX ATC 2025 and ACM ASPLOS 2025, respectively. Congratulations to Tuowei！ Apr. 2025 - 3 papers were accepted by ACM MobiSys 2025. Congratulations to Yongheng, Yizhe and Lili！ Feb. 2025 - Our paper, \"AugFL: Augmenting Federated Learning with Pretrained Models\", was accepted by ACM/IEEE Transactions on Networking. Congratulations to Sheng！ BRIEF BIOGRAPHY I am currently an associate professor with the Department of Computer Science and Technology, Tsinghua University, Beijing, China. Prior to joining Tsinghua, I was a professor with the School of Computer Science and Engineering, Central South University, Changsha, China. My research interests include Internet-of-Things, edge computing, distributed & embedded AI, and operating system. I am a senior member of the IEEE and a member of the ACM. I was recognized as a highly cited researcher by Clarivate in 2020-2022. I am looking for self-motivated Ph.D. students who are intrested in my research areas. Please feel free to contact me, if you want to join my group. SELECTED PUBLICATIONS [FULL LIST] Book/Book Chapter Yaoxue Zhang, Ju Ren, Jun Lu, \"计算机操作系统教程（第5版）\" (Tutorial of Computer Operating System, 5th Edition), 清华大学出版社 (Tsinghua University Press), 2022. (in Chinese, ISBN: 9787302602941). Yaoxue Zhang, Ju Ren, Jun Lu, \"计算机操作系统教程习题解答与实验指导（第5版）\" (Key to Exercises and Experiment Instructions for the Tutorial of Computer Operating System, 5th Edition), 清华大学出版社 (Tsinghua University Press), 2022. (in Chinese, ISBN: 9787302608967). Ju Ren, Yaoxue Zhang, \"openEuler操作系统（第2版）\" (openEuler Operating System 2nd Edition), 清华大学出版社 (Tsinghua University Press), 2022. (in Chinese, ISBN: 9787302602941). Ju Ren, Yaoxue Zhang, Xuhong Peng, \"openEuler操作系统\" (openEuler Operating System), 清华大学出版社 (Tsinghua University Press), 2020. (in Chinese, ISBN: 9787302563280). Ju Ren, Ning Zhang and Xuemin (Sherman) Shen, \"Energy-Efficient Spectrum Management for Cognitive Radio Sensor Networks\", Springer Verlag, 2017. (ISBN-10: 3319603175, ISBN-13: 978-3319603179). Ju Ren, \"Cognitive Radio Sensor Networks\", Book Chapter of Encyclopaedia of Wireless Networks, Springer Verlag, 2018. Journal & Conference Papers [ACM MobiCom'26] Y. Zhao, Y. Fu, Z. Feng, H. Pan, Y. Deng, Y. Zhang and J. Ren. “MANA: Towards Efficient Mobile Ad Detection via Multimodal Agentic UI Navigation,” ACM MobiCom, Conditionally accepted, 2026. [ACM MobiCom'26] S. Wang, Y. Fu, H. Pan, X. Li, L. Zhong, Y. Xie, K. Sun, G. Xue, Y. Zhang and J. Ren. “Attacking mmWave Imaging Using Metasurfaces Based on Intensity and Time-of-Flight Manipulation,” ACM MobiCom, Conditionally accepted, 2026. [ACM MobiCom'26] Y. Fu, K. Sun, X. Zhang, R. Wang, X. Li, H. Pan, Y. Zhang and J. Ren. “Unlocking Practical Cardiac Monitoring Capabilities on True Wireless Stereo Earbuds,” ACM MobiCom, Conditionally accepted, 2026. [ACM KDD'26] C. Du, Y. Deng, Y. Zhang and J. Ren. “Revisiting Redundancy in Diffusion Transformers: A Temporal-Spatial Joint Caching Strategy for Efficient Sampling,” ACM KDD, Jeju, South Korea, Aug. 9-13, 2026. [ACM/IEEE ToN] N. Qiao, S. Yue, J. Ren and Y. Zhang. “FOVA: Offline Federated Reinforcement Learning with Mixed-Quality Data,” ACM/IEEE Transactions on Networking, accepted to appear, 2025. [EuroSys'26] Z. Hao, J. Wei, T. Wang, M. Huang, H. Jiang, S. Jiang, T. Cao and J. Ren. “Scaling LLM Test-time Compute with Mobile NPU on Smartphones,” EuroSys, Edinburgh, UK, April 27-30, 2026. [USENIX NSDI'26] J. Lu, J. Li, Y. Zhang and J. Ren. “Bridging Storage and Execution: A Semantic Virtual Bus for On-Demand Application Streaming,” USENIX NSDI, RENTON, WA, USA, May 4-6, 2026. [EMNLP'25] Z. Qiao, Y. Deng, J. Zeng, D. Wang, L. Wei, G. Wang, F. Meng, J. Zhou, J. Ren and Y. Zhang. “ConCISE: Confidence-guided Compression in Step-by-step Efficient Reasoning,” EMNLP, Suzhou, China, Nov. 5-9, 2025. [ACM IMWUT/Ubicomp] Y. Deng, N. He, X. Li, F. Wu, Y. Zhang and J. Ren. “Cross-Modal Federated Learning Among Unimodal Devices,” ACM IMWUT/Ubicomp, vol. 9, no. 3, article no. 78, 2025. [ACM MobiCom'25] J. Zhang, P. Li, F. Li, D. Zhang, W. Gao, S. Yue, Y. Zhang and J. Ren. “FocusX: All-in-Focus Image Synthesis for Dynamic Scenes on Mobile Devices,” ACM MobiCom, Hong Kong, China, Nov. 4-8, 2025. [ACM MobiCom'25] Y. Wang, H. Pan, Y. Fu, Q. Hu, L. Qiu, Y. Chen, G. Xue and J. Ren. “WDNN: Weighted Diffractive Neural Network for Physical-layer RF Signal Processing,” ACM MobiCom, Hong Kong, China, Nov. 4-8, 2025. [IEEE/ACM IWQoS'25] G. Wang, Y. Deng, L. Li, Y. Wu, J. Lv, X. Li, T. Wang, Y. Zhang and J. Ren. “FedAF: Alignment-Augmented Fusion for Federated Multimodal Learning with Small Labels,\" IEEE/ACM IWQoS, Gold Coast, Australia, July 2-4, 2025. [IEEE/ACM IWQoS'25] Z. Fu, Y. Deng, L. Li, Y. Wu, Z. Wang, S. Yao, Y. Zhang and J. Ren. “Malva: A Jitter-aware Online Pruning Framework for DNN Inference Tasks,\" IEEE/ACM IWQoS, Gold Coast, Australia, July 2-4, 2025. [ACM ASPLOS'25] T. Wang, R. Fan, M. Huang, Z. Hao, K. Li, T. Cao, Y. Lu, Y. Zhang and J. Ren. “Neuralink: Fast on-Device LLM Inference with Neuron Co-Activation Linking,\" ASPLOS, Rotterdam, The Netherlands, Mar. 30 - Apr. 3, 2025. [USENIX ATC'25] T. Wang, X. Chen, K. Li, T. Cao, J. Ren and Y. Zhang. “Jenga: Enhancing Long-Context Fine-tuning of LLMs with Contextual Token Sparsity,\" USENIX ATC, BOSTON, MA, US, July 7-9, 2025. [ACM MobiSys'25] Y. Deng, Z. Qiao, Y. Zhang, Z. Ma, Y. Liu and J. Ren. “CoT-LM: A Data-Free Collaborative Fine-Tuning Framework for Large and Small Language Models,\" ACM MobiSys, Anaheim, California, US, June 23-27, 2025. [ACM MobiSys'25] Y. Zhao, L. Chen, X. Li, Y. Dong, J. Ren and Y. Zhang. “MetaGen: LLM-Driven Generative Framework for Intelligent Metasurface Element,” ACM MobiSys, Anaheim, California, US, June 23-27, 2025. [ACM MobiSys'25] L. Chen, Y. Zhao, S. Wang, L. Zhong, Y. Fu, S. Yue, J. Ren and Y. Zhang. “Towards Distance-Adaptive Wireless Charging,” ACM MobiSys, Anaheim, California, US, June 23-27, 2025. [ACM/IEEE ToN] S. Yue, Z. Qin, Y. Deng, J. Ren, Y. Zhang and J. Zhang. “AugFL: Augmenting Federated Learning with Pretrained Models,” ACM/IEEE Transactions on Networking, accepted to appear, 2025. [AAAI'25] W. Xue, C. Qian, J. Wu, Y. Zhou, W. Liu, J. Ren, S. Fan and Y. Zhang. “ShotVL: Human-centric Highlight Frame Retrieval via Language Queries,” AAAI, PHILADELPHIA, PENNSYLVANIA, USA, Feb. 25-Mar. 4, 2025. [ACM MobiCom'25] H. Pan, Y. Wang, J. Liu, R. Ma, L. Qiu, Y. Chen, G. Xue and J. Ren. “CGMM: Non-Invasive Continuous Glucose Monitoring in Wearables Using Metasurfaces,” ACM MobiCom, Hong Kong, China, Nov. 4-8, 2025. [IEEE TMC] H. Pan, Y. Fu, Q. Ye, Y-C Chen and J. Ren. “MagicWrite: One-Dimensional Acoustic Tracking-Based Air Writing System,” IEEE Transactions on Mobile Computing, accepted to appear, 2024. [ACM/IEEE ToN] S. Yue, X. Hua, Y. Deng, L. Chen, J. Ren and Y. Zhang. “Momentum-Based Contextual Federated Reinforcement Learning,” ACM/IEEE Transactions on Networking, accepted to appear, 2024. [ACM SenSys'24] Y. Lu, H. Pan, D. Ding, Y. Fu, L. Zhang, F. Tan, R. Wang, Y. Chen, G. Xue and J. Ren. “M3Cam: Extreme Super-resolution via Multi-Modal Optical Flow for Mobile Cameras,” ACM SenSys, Hangzhou, China, Nov. 4-7, 2024. [CJE] S. Yue, Y. Deng, G. Wang, J. Ren and Y. Zhang. “Federated Offline Reinforcement Learning with Proximal Policy Evaluation,” Chinese Journal of Electronics, vol. 33, no. 6, pp. 1-13, 2024. [ACM CCS'24] C. Jiang, J. Yang, X. Li, Q. Li, X. Zhang and J. Ren. “RISiren: Wireless Sensing System Attacks via Metasurface,” ACM CCS, Salt Lake City, USA, Oct. 14-18, 2024. [IEEE TMC] Y. Fu, S. Wang, L. Zhong, L. Chen, J. Ren and Y. Zhang. “UltraSR: Silent Speech Reconstruction via Acoustic Sensing,” IEEE Transactions on Mobile Computing, vol. 23, no. 12, pp. 12848 - 12865, 2024. [SC'24] T. Wang, K. Li, Z. Hao, D. Bai, J. Ren, Y. Zhang, T. Cao and M. Yang. “Long Exposure: Accelerating Parameter-Efficient Fine-Tuning for LLMs under Shadowy Sparsity,” SC, Atlanta, GA, USA, Nov. 17-22, 2024. [ACM MobiCom'24] Y. Wang, H. Pan, L. Qiu, L. Zhong, J. Liu, R. Ma, G. Xue and J. Ren. “GPMS: Enabling Indoor GNSS Positioning using Passive Metasurfaces,” ACM MobiCom, Washington, D.C., USA, Sept. 30 - Oct. 4, 2024. [ICML'24] S. Yue, X. Hua, J. Ren, S. Lin, J. Zhang and Y. Zhang. “OLLIE: Imitation Learning from Offline Pretraining to Online Finetuning,” ICML, Vienna, Austria, July 21-27, 2024. [ICML'24] S. Yue, J. Liu, X. Hua, J. Ren and Y. Zhang. “How to Leverage Diverse Demonstrations in Offline Imitation Learning,” ICML, Vienna, Austria, July 21-27, 2024. [IEEE ICDCS'24] M. Sun, J. Ren and Y. Zhang. “EdgeVPR: Transformer-based Real-Time Video Person Re-Identification at the Edge,” IEEE ICDCS, Jersey City, New Jersey, USA, July 23-26, 2024. [ACM IMWUT/Ubicomp] Y. Fu, Y. Zhang, H. Pan, Y. Lu, X. Li, L. Chen, J. Ren, X. Li, X. Zhang and Y. Zhang. “Pushing the Limits of Acoustic Spatial Perception via Incident Angle Encoding,” ACM IMWU",
  "content_length": 36997,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:33"
}