{
  "name": "Ju Sun",
  "homepage": "https://sunju.org",
  "status": "success",
  "content": "Ju Sun Curriculum Vitae McKnight Land-Grant Professor, Computer Science & Engineering Leader, Group of Learning, Optimization, Vision, Healthcare, and X (GLOVEX) Core executive member, UMN Data Science Initiative (DSI) Leader of Computer Vision, Program for Clinical AI, Center for Learning Health System Sciences (CLHSS) Full Member, Innovative Methods & Data Science, Center for Learning Health System Sciences (CLHSS) Affiliated Faculty of Electrical and Computer Engineering; UMN CSE Data Science Initiative (CSE-DSI); AI Institute for Climate-Land Interactions, Mitigation, Adaptation, Tradeoffs and Economy (AI-CLIMATE); UMN Data Science Program; Institute for Health Informatics (IHI); Institute for Engineering in Medicine (IME); Masonic Cancer Center (MCC) University of Minnesota, Twin Cities CEO, Deeployable AI R&D Director of Artificial Intelligence, PureBioX Research Interests: Foundations of machine learning, computer vision, numerical optimization, and their application to science, engineering, and medicine. See our group research Group website: https://glovex.umn.edu/ Contact Email: jusun@umn.edu \\ \\ sunjunus@gmail.com Office: 6-213, Keller Hall Phone: 612-301-2729 Webpage: http://sunju.org LinkedIn: https://www.linkedin.com/in/ju-sun-ai Office Hour: Thur 4–6pm (Spring 2025) Seminars of interest Co-organizing UMN Machine Learning Seminar Series UMN Data Science Seminars MnRI Seminar Minnesota Natural Language Processing Seminar What’s new Upcoming Service & Event: Serving as local chair for IEEE International Conference on Healthcare Informatics 2026 (UMN, Jun 01–04, 2026) Talk: IEEE International Workshop on Computational Advances in Multi-Sensor Adaptive Processing (CAMSAP 2025) (Dominican Republic, Dec 14–17, 2025) Talk: UMN Industrial and Systems Engineering Graduate Seminar (UMN, Dec 10, 2025) Past Paper release: Proud to release our paper Saving Foundation Flow-Matching Priors for Inverse Problems, a substantial expanded and revamped version of the short paper FMPlug: Plug-In Foundation Flow-Matching Priors for Inverse Problems, on arXiv! In this paper, we reveal the striking performance deficiency of foundation flow-matching priors (e.g., Stable Diffusion V3) for solving inverse problems, and make the first step in closing the performance gap between foundation and domain-specific flow-matching priors for solving a wide range of inverse problems. (Nov 20, 2025) Service: To be an Area Chair for International Conference on Machine Learning (ICML) 2026 (Nov 20, 2025) Graduation: The fourth PhD student of the group, Taihui Li (CS&E) has successfully defended his thesis titled Advancing Untrained Deep Neural Networks. Heartfelt congratulations to Dr. Li and sincere thanks—he helped GLOVEX grow from day one! Taihui has joined Meta as a research scientist! (Nov 06, 2025) Event: Annual Midwest Optimization Meeting (University of North Dakota, Grand Forks, ND, Oct 31–Nov 01, 2025) Talk: ECE Communications and Signal Processing Seminar at University of Michigan [Slides] (Ann Arbor, MI, Oct 16, 2025) Service: To be an Action Editor of Transactions on Machine Learning Research (Oct 11, 2025) Grant approval: Led by Prof. Rui Zhang, we are funded by FDA to develop a scalable, generalizable, and explainable AI-powered informatics framework, CardioOnco-AI, on the curation and modeling of real-world data for individualized prediction of cardiotoxicity among breast cancer survivors. (Grant title: CardioOnco-AI: AI-empowered cardiotoxicity risk prediction among breast cancer survivors using multi-site real-world data) (Sep 19, 2025) Event: GenAI4Science: Integrating Scientific Knowledge into Generative AI (UMN, Aug 13–14, 2025) Paper release: Proud to release our paper FMPlug: Plug-In Foundation Flow-Matching Priors for Inverse Problems on arXiv! In this paper, we identify major gaps in the current ideas for solving inverse problems with pretrained foundation flow-matching priors and find they might not even catch up with untrained priors—which is a shame! We propose new methods to substantially boost the performance and bridge the gaps. (Aug 03, 2025) Paper release: Proud to release our paper Exact Reformulation and Optimization for Direct Metric Optimization in Binary Imbalanced Classification on arXiv! This paper paves a radically new way of dealing with indicator functions that often appear in machine learning problems with nonconventional metric objectives and/or constraints. (Jul 21, 2025) Graduation: The third Phd student of the group, Le Peng (CS&E) has successfully defended his thesis titled Towards Robust and Reliable Artificial Intelligence in Healthcare. Heartfelt congratulations to Dr. Peng! Le has joined Meta as a research scientist! (Jun 18, 2025) Event: AI Spring Summit on Healthcare, Governence & Ethics (UMN, Jun 10–12, 2025) Grant approval: With Prof. Zhaosong Lu, Prof. Chris Bartel, we are funded by the NSF ACED (Accelerating Computing-Enabled Scientific Discovery) Program to boost the efficiency of data-driven material discovery by, for the first time, incorporating physics-informed constraints during training and developing rigorous numerical methods to solve the resulting constrained deep learning problems. (Jun 06, 2025) Graduation: The second Phd student of the group, Hengyue Liang (ECE) has successfully defended his thesis titled Robustness and Safety of Deep Learning Models. Heartfelt congratulations to Dr. Hengyue Liang! Hengyue has joined Amazon as an applied scientist! (May 06, 2025) Paper release: Proud to release our paper Temporal-Consistent Video Restoration with Pre-trained Diffusion Models on arXiv! This paper builds on our previous DMPlug idea for solving inverse problems using pretrained image diffusion models, and integrates substantial innovation, customization, and optimization to excel in solving video restoration problems. (Mar 19, 2025) Event: DARPA Proposers’ Day on Securing Artificial Intelligence for Battlefield Effective Robustness (Arlington, VA, Mar 12, 2025) Talk: SIAM Conference on Computational Science and Engineering (CSE25) [Slides] (Fort Worth, Texas, Mar 3–7, 2025) Honors: Thrilled to be awarded the McKnight Land-Grant Professorship (2025–2027) by the University of Minnesota, the highest honor for assistant professors. (Mar 05, 2025) Paper release: Proud to release our paper A Baseline Method for Removing Invisible Image Watermarks using Deep Image Prior on arXiv! Our method operates on a very different principle compared to state-of-the-art watermark evasion methods, and hence largely complements the existing evasion methods. (Feb 20, 2025) Grant approval: With Prof. Zhaosong Lu, Prof. Chris Bartel, and Prof. Qizhi He, we are funded by the UMN DSI Faculty Fellowship program to further develop our toolkit of constrained deep learning for materials discovery and engineering designs. (Dec 17, 2024) Event: DARPA I2O Proposers’ Day (Arlington, VA, Nov 07, 2024) Event: ARPA-H PRECISE AI Proposers’ Day (Madison, Wisconsin, Oct 17, 2024) Talk: International Symposium on Mathematical Programming (ISMP24) (Montréal, Canada, Jul 21–26, 2024) Talk: SIAM Conference on Imaging Science (IS24) [Slides] (Atlanta, May 28–31, 2024) Service: Minisymposium on Deep Learning for Imaging Science at SIAM Conference on Imaging Science (IS24) (Atlanta, May 28–31, 2024) Event & Service: UMN DSI 2024 Spring Research Workshop on Generative AI (May 22–24, 2024) Paper release: Thrilled to release our paper DMPlug: A Plug-in Method for Solving Inverse Problems with Diffusion Models on arXiv! Our simply beautiful idea represents a significant departure from the past methods that use pretrained diffusion models to solve inverse problems, and addresses their major drawbacks: struggle to find solutions that are photorealistic, consistent with the measurement, and robust to unknown noise. I call this “diffusion models for inverse problems done right!” (May 27, 2024) Event & Service: With Prof. Mingyi Hong, we’re leading the organization of the Midwest Machine Learning Symposium 2024 at UMN. (May 20–21, 2024) Paper release: Proud to release our paper Selective Classification Under Distribution Shifts on arXiv. This is the first work in machine learning that considers selective classification under distribution shifts, especially covariate shifts and label shifts (i.e., mostly handled by out-of-distribution detection), representing an important step toward deployable selective prediction methods for real-world high-stakes applications, where the data can come from the wild! (May 08, 2024) Talk: AI for Science Seminar, AWS [Slides] (Remote, Apr 30, 2024) Event: 2024 Peter O. Stahl Advanced Design Forum at Medtronic, Minneapolis (Apr 19, 2024) Talk: 2024 INFORMS Optimization Society (IOS) Conference [Slides] (Houston, Mar 22–24, 2024) Event: DARPA Discover DSO Day (San Francisco, Feb 21–22, 2024) Talk: at Machine Learning for Scientific Imaging Conference of Electronic Imaging 2024 [Slides] (Burlingame, California, Jan 21–25, 2024) Grant approval: with Prof. Zhaosong Lu, we are funded by the UMN DSI Seed Grant, Medium to develop stochastic numerical optimization methods for constrained deep learning problems. (Dec, 2023) Conference: Conference on Neural Information Processing Systems 2023 (New Orleans, Dec 11–16, 2023) Workshop: The Convergence of Smart Sensing Systems, Applications, Analytic and Decision Making (DC, Dec 07–08, 2023) Talk: The British Machine Vision Conference (BMVC) 2023 (Aberdeen, UK, Nov 20–24, 2023) Talk: PSU-Purdue-UMD Joint Seminar on Mathematical Data Science [Slides] (Nov 06, 2023) Talk: at the Robotics Colloquium of the Minnesota Robotics Institute. [Slides] (Oct 20, 2023) Graduation: The first PhD graduate of the group, Zhong Zhuang (ECE, co-advised with Prof. Vladimir Cherkassky) has successfully defended his thesis titled Advancing Deep Learning for Scientific Inverse Problems. Heartfelt congratulations to Dr. Zhong Zhuang! Zhong is continuing his research into AI for Scie",
  "content_length": 22615,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:35"
}