{
  "name": "Ju Wang 0003",
  "homepage": "https://faculty.nwu.edu.cn/ju/en/index.htm",
  "status": "success",
  "content": "è¥¿åå¤§å­¦ä¸»é¡µå¹³å°ç®¡çç³»ç» Ju Wang--Home--Home Personal Homepage Qr code ä¸­æ Ju Wang Professor Supervisor of Doctorate Candidates Supervisor of Master's Candidates E-Mail:12e561528864ea862723191f6b096b75423550752cb7a2699186b9a8af53b4c04d26440f59eb282275752d801d672eafcbe17274eb7eb30a33d68422acc6fb4ee5078f09f555e5f48725b6386f183818dfeb95bd55f4761112fb52851743adfb62c14c255c157d8a4904c295edfa4e761ca52789b760bb48a81bff48df611d81 Date of Employment:2023-01-01 School/Department:Northwest University Administrative Position:Professor Education Level:With Certificate of Graduation for Doctorate Study Gender:Male Contact Information:wangju@nwu.edu.cn Degree:Doctoral Degree in Engineering Status:Employed Alma Mater:è¥¿åå¤§å­¦ Academic Honor: Honors and Titles: MOBILE Version Click:Times The Last Update Time: .. Home Teaching Enrollment Information Student Information Profile Short Bio: I'm a Professor at the Northwest University, Xiâan, China. Before joining the university, I was a senior researcher at Samsung AI Center (SAIC)-Montreal, Canada, from 2020 to 2023, working with Prof. Xue (Steve) Liu. I also did a two-year postdoc at University of Waterloo, from 2018 to 2020, under the supervision of Prof. Srinivasan Keshav and Prof. Omid Abari. I received my Ph.D. in Computer Science from Northwest University, Xiâan, China in 2017, under the supervision of Prof. Dingyi Fang and Prof. Xiaojiang Chen. Research Interests: Artificial Intelligence, Wireless Communication System/Network, Internet of Things (IoT). By borrowing techniques from diverse areas, including computer networks, machine learning, and signal processing, I like to explore and develop new software-hardware systems that enable the next generation of wireless communication, human-computer interaction (HCI), and ubiquitous sensing. Selected Publications: Full list at Google Scholar ( * means Ju is the corresponding author) Ju Wang, Liqiong Chang, Shourya Aggarwal, Omid Abari, and Srinivasan Keshav. âSustainable and Low-Cost Greenhouse Soil Moisture Monitoring Using Battery-Free RFID Sensorsâ, ACM Transaction on Sensor Network (TOSN), 2025. Wenli Jiao,  Ju Wang*, Xinzhuo Gao, Long Du, Yanlin Li, Lili Zhao, Dingyi Fang, and Xiaojiang Chen. âZEROECG: Zero-Sensation ECG Monitoring By Exploring RFID MOSFETâ, ACM MobiCom, 2024. Liqiong Chang, Xiaofeng Yang, Ruyue Liu, Guodong Xie, Fuwei Wang, and Ju Wang*. âFSS-Tag: High Accuracy Material Identification System Based On Frequency Selective Surface Tagâ, ACM UbiComp/IMWUT, 2024. Wenli Jiao, Ju Wang*, Yelu He, Xiangdong Xi, and Fuwei Wang. âSoilTAG: Fine-Grained Soil Moisture Sensing Through Chipless Tagsâ, IEEE Transaction on Mobile Computing (TMC), 2023. Wenli Jiao, Yanlin Li, Xiangdong Xi,  Ju Wang*, Dingyi Fang, and Xiaojiang Chen. âBioScatter: Low Power Sweat Sensing with Backscatterâ, ACM MobiSys, 2023. Wenli Jiao, Ju Wang*,  Yelu He, Xd Xi, Fuwei Wang, Dingyi Fang, and Xiaojiang Chen. âEliminating Design Effort: A Reconfigurable Sensing Framework For Chipless, Backscatter Tagsâ, IEEE/ACM Transaction on Networking (TON), 2023 Ju Wang, Xi Chen, Xue Liu, and Gregory Dudek. âEliminating Space Scanning: Fast mmWave Beam Alignment with UWB Radiosâ, ACM Transaction on Sensor Network (TOSN), 2023. Ju Wang, Liqiong Chang, Omid Abari, and Srinivasan Keshav, âSoil moisture sensing with commodity RFID systemsâ, ACM MobiSys, 2020. Ju Wang, Jianyan Li, Mohammad Mazaheri, Keiko Katsuragawa, Daniel Vogel, Omid Abari, âSensing Finger Input Using An RFID Transmission Lineâ, ACM SenSys, 2020. Keiko Katsuragawa, Ju Wang, Ziyang Shan, Ningshan Ouyang, Omid Abari, Daniel Vogel, âTip-Tap: Battery-Free Discrete 2D Fingertip Inputâ, ACM UIST, 2019. Ju Wang, Liqiong Chang, Omid Abari, Srinivasan Keshav, âAre RFID Sensing Systems Ready for the Real Worldâ, ACM MobiSys, 2019. Ju Wang, Omid Abari, Srinivasan Keshav. âChallenge: RFID Hacking for Fun and Profitâ, ACM MobiCom, 2018. Ju Wang, Jie Xiong, Xiaojiang Chen, Hongbo Jiang, Rajesh Krishna Balan, and Dingyi Fang. âTagScan: Simultaneous target imaging and material identification with commodity RFID devicesâ, ACM MobiCom, 2017. Ju Wang, Hongbo Jiang, Jie Xiong, Kyle Jamieson, Xiaojiang Chen, Dingyi Fang, Binbin Xie.âLiFS: Low Human-Effort, Device-Free Localization with Fine-Grained Subcarrier Informationâ, ACM MobiCom, 2016. Ju Wang, Jie Xiong, Hongbo Jiang, Xiaojiang Chen, Dingyi Fang. âD-Watch: Embracing âbadâMultipaths for Device-Free Localization with COTS RFID Devicesâ, ACM CoNext, 2016. Ju Wang, Dingyi Fang, Xiaojiang Chen, Zhe Yang, Tianzhang Xing, and Lin Cai. âLCS: Compressive Sensing based Device-Free Localization for Multiple Targets in Sensor Networksâ, IEEE INFOCOM, 2013. Educational Experience 2012.9 -- 2017.1 Northwest University Computer Science and Technology With Certificate of Graduation for Doctorate Study Doctoral Degree in Education 2011.9 -- 2012.7 Northwesst University Computer Science and Technology With Certificate of Graduation for Study as Master's Candidates Master's degree 2007.9 -- 2011.7 Northwest University Electronic Science and Techonology With Certificate of Graduation for Undergraduate Study Bachelor's Degree Work Experience 2018.1 -- 2020.2 University of Waterloo Postdoc 2020.3 -- 2023.1 Samsung AI Center (SAIC)-Montreal Senior Researcher Social Affiliations Research Focus Internet of Things, RF Sensing, Wireless Communication System/Network Artificial Intelligence, Machine Learning, Brain-Inspired Computing Â©2020 Northwest University All Rights Reserved. Xi' an 710069,P.R.China",
  "content_length": 5626,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:33"
}