{
  "name": "Juan C. Caicedo",
  "homepage": "https://datascience.wisc.edu/staff/caicedo-juan",
  "status": "success",
  "content": "Caicedo, Juan – Data Science @ UW – UW–Madison Skip to main content University of Wisconsin–Madison Menu open menu close Juan Caicedo Credentials: Assistant Professor, Department of Biostatistics and Medical Informatics; Investigator, Morgridge Institute for Researc Position title: Department of Biostatistics and Medical Informatics; Morgridge Institute for Research Email: juan.caicedo@wisc.edu Juan uses computer vision and machine learning to study biological images generated under microscopes. Traditionally, these images were used for qualitative analysis of cellular structures. Juan aims to quantify cellular imaging data, using computation to surpass the limitations of human vision. His goal is to understand the principles of cellular organization. This work is technically challenging. Juan likens working with cellular images to discovering a new planet in a new galaxy. Training computer vision models to analyze these images can be tricky, as different microscopes use unique color schemes and capture images in different dimensions. Juan aims to create a model for “universal morphology” that can recognize cellular patterns and structures under any microscopy condition. This work holds potential to foster new approaches in medicine. Juan earned his Ph.D. at the National University of Colombia and was a fellow at the Broad Institute before coming to UW–Madison. He was drawn to the thriving microscopy, biological sciences, and data science communities here, as well as the resources available through the Center for High Throughput Computing. He values the collaborative spirit of our campus: “People here are genuinely interested in coming together to do something bigger.” “The thing that motivates me is the community, or the people. I’m enthusiastic about the potential our joint efforts can make and the impact we can create together. Every time we engage in multidisciplinary research, many opportunities appear.”",
  "content_length": 1942,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:40"
}