{
  "name": "Juan Ye",
  "homepage": "https://sites.google.com/site/juanyeresearch",
  "status": "success",
  "content": "Juan Ye's ResearchSearch this siteEmbedded FilesSkip to main contentSkip to navigationJuan YeDr Juan Ye (Erica) Address: Room JC1.12                                                             Jack Cole Building,                School of Computer Science,                University of St Andrews,                St Andrews, Fife, UK                KY16 9SXTel:          (+44)01334463258Email:     juan.ye AT st-andrews DOT ac DOT uk,    ye.yejuan1204 AT gmail DOT comLatest newsOur paper on \"Opportunistic Dynamic Architecture for Class-incremental Learning\" is accepted by IEEE Access. March 2025.Our paper on \"Continual Learning in Sensor-based Human Activity Recognition with Dynamic Mixture of Experts\" is accepted by Pervasive and Mobile Computing. March 2025. Our paper on \"Towards Automated Animal Density Estimation with Acoustic Spatial Capture-Recapture\" is accepted by Biometrics. July 2024.Our paper on \"Hadamard Domain Training with Integers for Class Incremental Quantized Learning\" is presented at the 3rd conference on lifelong learning agents, 2024.Our paper on \"SelfVis: Self-Supervised Learning for Human Activity Recognition based on Area Charts\" is accepted by IEEE Transactions on Emerging Topics in Computing. April 2024. Our paper on \"An End-to-End Review of Gaze Estimation and its Interactive Applications on Handheld Mobile Devices\" is accepted by ACM Computing Survey. 22 June 2023.Our paper on \"Online Continual Learning for Human Activity Recognition\" is accepted by Pervasive and Mobile Computing, 16 June 2023. Yuheng's paper on \"Automated call detection for acoustic surveys with structured calls of varying length\" is accepted by Methods in Ecology and Evolution, 30 Mar 2022. Our paper on \"Enabling Continuous Object Recognition in Mobile Augmented Reality\" is accepted by IUI, 24 Jan 2022.Postdoc position in Continual Learning is available in my group and the application deadline is 15 Feb 2022. PhD scholarship is available in St Andrews and the application deadline is 1 Feb 2022. Our paper \"ContrasGAN: Unsupervised Domain Adaptation in Human ActivityRecognition via Adversarial and Contrastive Learning\" is accepted by Pervasive and Mobile Computing, Oct 2021.Our paper \"Investigating Multisensory Integration in Emotion Recognition through Bio-inspired Computational Models\" is accepted by IEEE Transactions of Affective Computing, August 2021. Our paper \"Collaborative Activity Recognition with Heterogeneous Activity Sets and Privacy Preferences\" is accepted by Journal of Ambient Intelligence and Smart Environments, 25 July 2021. Our paper \"Continual Learning in Sensor-based Human Activity Recognition: an Empirical Benchmark Analysis\" is accepted by Information Sciences, 11 Apr 2021.Honoured to join the International teaching board of the PhD program on “Industrial Innovation Engineering” of the University of Modena and Reggio Emilia, 31 Mar 2021.The workshop MobiHAR 2021, co-existing with MDM 2021, is open for submission and the deadline is 3 Apr 2021. The special issue \"Sensor-Based Human Activity Recognition in Real-World Scenarios\" on Applied Sciences is now open for submission and the deadline is 30 Nov 2021. Our paper Unsupervised Domain Adaptation in Activity Recognition: a GAN-based Approach is available on IEEE Access. Feb 2021.The special issue \"Sensor Technology for Smart Homes\" on Sensors comes to a closure. Please check the editorial.  Dec 2020.Our paper on \"Continual Activity Recognition with Generative Adversarial Networks\" has been accepted by ACM Transactions on Internet of Things\", 29 Nov 2020. Our paper on \"Generalisation and Robustness Investigation For Facial and Speech Emotion Recognition Using Bio-Inspired Spiking Neural Networks\" has been accepted by Soft Computing (impact factor = 3.05), 29 Nov 2020. Gave a talk on \"Unsupervised domain adaptation for human activity recognition\" at Centre for Mobile, Wearable Systems and Augmented Intelligence at Cambridge, 23 Nov 2020. [link]Served as a general chair on MobiHealth 2020, 19 Nov 2020.Our paper on \"Bayesian Inference Federated Learning for HeartRate Prediction\" has been accepted by MobiHealth' 2020. Oct 2020.Served as PC member on AAAI' 2021. Sep 2020.PhD scholarship available at St Andrews (application deadline 30 June 2020), great opportunity to work in both St Andrews and Victoria, Canada! Our paper \"Continual Learning in Human Activity Recognition: An empirical Analysis of Regularization\".  accepted by ICML Continual Learning Workshop 2020. July 2020.My paper \"Shared learning activity labels across heterogeneous datasets\", accepted by IOS Journal of Ambient Intelligence and Smart Environments on 30 Mar 2020.Our paper \"Evolving Models for Incrementally Learning Emerging Activities\", accepted by IOS Journal of Ambient Intelligence and Smart Environments on 30 Mar 2020.Ai's paper \"Visualization as Intermediate Representations (VLAIR) for Human Activity Recognition\", accepted by PervasiveHealth. Mar 2020.Andrea's paper \"Unsupervised Domain Adaptation for Activity Recognition Across Heterogeneous Datasets\", accepted by Pervasive and Mobile Computing. Feb 2020. Esma's paper on \"Synch-Graph: Multisensory Emotion Recognition Through Neural Synchrony via Graph Convolutional Networks\" is accepted by AAAI 2020. More news...Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 5336,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:49"
}