{
  "name": "Juan M. Banda",
  "homepage": "http://www.jmbanda.com",
  "status": "success",
  "content": "Juan M. Banda personal website Home About In the News Publications Presentations Contact Home About In the News Publications Presentations Contact Juan M. Banda I'm a About Me Main information about me I'm Juan M. Banda and I am a Hello, my name is Juan M. Banda and I am currently an assistant professor of computer science at Georgia State University. In my research lab, Panacea Lab, we aim to build machine learning, computer vision, and NLP methods that help to generate insights from multi-modal large-scale data sources. With applications to precision medicine, medical informatics, astroinformatics and other domains, our work addresses domain-specific problems with data science methods and practices. As an engineer at heart and practice for the last 20 years, I have used Python, Bash, ontologies, and NLP tools to build pipelines to annotate over 68 million clinical notes. I have built custom ETLs to map over 8 million patient electronic health records, from 4 institutions, to common data models (OMOP) for large scale analytics and machine learning purposes. I have designed pipelines, databases, and processes to build research infrastructure for my current and previous labs. I have used R, SQL, Matlab, Perl, Java, Javascript, and other languages to acquire, clean and operationalize data from multiple sources. I have mined over 9 billion Tweets for NLP tasks to gain insights from them. In my earlier days, I built content-based image retrieval systems for NASAâs SDO mission, with capacity to process and index over 40,000 images daily, and provide computer vision-aided similarity search for images. I started my engineering days designing and developing point-of-sale systems written in Visual Basic. Apart from my technical skills, I have strong communication and writing skills (over 70 refereed publications) and management skills (I have managed over 40 employees and 23 students). With the desire of improving patient outcomes, medical care and building things that change peopleâs lives, I am committed to releasing all my work via open-source licenses following the FAIR data sharing principles. I am an active collaborator of the Observational Health Data Sciences and Informatics and my work has been funded by the Department of Veteran Affairs, National Institute on Aging as well as NASA, NSF, and NIH. Panacea Lab Website Contact Me Twitter Linkedin Google Scholar Github 500px ResearchGate Technical Skills Some of the skills here are grouped by areas for brevity. As a generalist, I have experience with many programming languages and tools, from things like COBOL to Business Objects. Databases (MySQL, SQLServer, PostgreSQL, Oracle, MongoDB) - 17 years of experience95% Data Science (NLP pipelines, Visualization, Reporting) - 16 years of experience92% Data Engineering (Custom ETLs, Data Pipelines, Bash, Pandas, SQL) - 14 years of experience80% Machine Learning (Tensorflow, Scikit-learn, Theano, caret, WEKA) - 12 years of experience80% Scientific Programming Languages (R, Matlab, Maple) - 12 years of experience75% General Programming Langauges (Python, Java, Visual Basic) - 12 years of experience75% Cloud Environments (AWS, Azure, BigQuery) - 8 years of experience65% 0 Lines of Code 0 Hackathons Participated In 0+ Peer-reviewed Publications In the News My work has been mentioned in the following outlets Press: PsyPost - 2021 - “Negative perceptions of COVID-19 decreased intensively on Twitter after the vaccination campaign started” Press: Frontiers Science Blog - 2021 - “Deep dive into global twitter posts reveals possible drop in negativity towards covid-19 pandemic” Press: News Kerala - 2021 - “Global tweets reveal decline in negativity towards Covid pandemic” Press: Georgia State University Podcast - 2021 - “What A Year of Tweets Can Tell Us About The Pandemic” Press: Georgia State Research Magazine - 2020 - “Using Social Media to Map Disease” Press: Georgia State News Hub - 2020 - “Researchers Use Social Media Data to Learn More About COVID-19 “Long-Haulers”  Picked up also by Atlanta Journal Constitution Press: Georgia State News Hub - 2020 - “Georgia State Researchers Use Social Media Chatter to Show the Spread of COVID-19”  Picked up also by CB46 Atlanta, WSBTV, 11alive News Press: Georgia State News Hub - 2019 - “Early-Season Hurricanes Result In Greater Transmission Of Mosquito-Borne Infectious Disease, Study Shows” Press: Stanford Medicine News - 2019 - “AI identifies risk of cholesterol-raising genetic disease” Press: Stanford Scope Blog - 2019 - “Flagging a cholesterol-raising disease using AI” Press: NSF Research - 2019 - “Early-season hurricanes result in greater transmission of mosquito-borne infectious disease” Press: Yahoo Finance - 2018 - “Why AI is the next frontier of medicine” Press: Quartz - 2016 - “A new study of 250 million patients shows medicine is still full of guesswork” Press Stanford Scope Blog - 2016 - “Gigantic datasets reveal unexpected insights into global medical treatments” Press: FiveThirtyEighty.com, 2016 – “An Algorithm Could Know You Have A Genetic Disease Before You Do”.. Press: TechCrunch, 2015 – “Hack Helps Patients Prevent Adverse Drug Reactions”. Publications List of peer-reviewed publications: 2021 A Large-Scale COVID-19 Twitter Chatter Dataset for Open Scientific Research - An International Collaboration, JM Banda, R Tekumalla, G Wang, J Yu, T Liu, Y Ding, E Artemova, E Tutubalina, G Chowell, Epidemiologia, 2021, 2, pp. 315-324 A Biomedically oriented automatically annotated Twitter COVID-19 Dataset, LRA Hernandez, TJ Callahan, & JM Banda Genomics & Informatics 2021;19(3):e21 Negative Perception of the COVID-19 Pandemic Is Dropping: Evidence From Twitter Posts, AN Vargas, A Maier, MBR Vallim, JM Banda, VM Preciado, Front. Psychol. 12 (2021) 4067 Pulse of the Pandemic: Iterative Topic Filtering for Clinical Information Extraction from Social Media, J Wu, V Sivaraman, D Kumar, JM Banda, D Sontag J. Biomed. Inform. (2021) 103844 Transmission dynamics and forecasts of the COVID-19 pandemic in Mexico, March-December 2020, A Tariq, JM Banda, P Skums, S Dahal, C Castillo-Garsow, B Espinoza, et al., PLoS ONE, 16(7): e0254826, 2021 Changes in Public Response Associated With Various COVID-19 Restrictions in Ontario, Canada: Observational Infoveillance Study Using Social Media Time Series Data, A Chum, A Nielsen, Z Bellows, E Farrell, P Durette, JM Banda, G Cupchik, J Med Internet Res, 2021;23(8):e28716. Characterizing all-cause excess mortality patterns during COVID-19 pandemic in Mexico, S Dahal, JM Banda, AI Bento, et al. BMC Infect Dis. 21, 432 (2021) ACE: the Advanced Cohort Engine for searching longitudinal patient records, A Callahan, V Polony, JD Posada, JM Banda, S Gombar, NH Shah, Journal of the American Medical Informatics Association, Volume 28, Issue 7, July 2021, Pages 1468-1479. A Minimal Information Model for Potential Drug-Drug Interactions, H Hochheiser, X Jing, EA Garcia, S Ayvaz, R Sahay, M Dumontier, JM Banda, O Beya, M Brochhausen, E Draper, S Habiel, O Hassanzadeh, M Herrero-Zazo, B Hocum, J Horn, B LeBaron, DC Malone, O Nytro, T Reese, K Romagnoli, J Schneider, LY, Zhang, and RD Boyce Front. Pharmacol. 08 March 2021. Normalizing Clinical Document Titles to LOINC Document Ontology: an Initial Study, X Zuo, J Li, B Zhao, Y Zhou, X Dong, J Duke, K Natarajan, G Hripcsak, NH Shah, JM Banda, R Reeves, T Miller, H Xu, AMIA Annu Symp Proc. 2021, Jan 25;2021:1441-1450. An ensemble approach for classification and extraction of drug mentions in Tweets, LAR Hernandez, RC Srinivasa, JM Banda, Proceedings of the BioCreative VII Challenge Evaluation Workshop pp. 221-226. 2021 An Enhanced Approach to Identify and Extract Medication Mentions in Tweets via Weak Supervision, R Tekumalla and JM Banda Proceedings of the BioCreative VII Challenge Evaluation Workshop pp. 201-206. 2021 A Pharmacovigilance Application of Social Media Mining: An Ensemble Approach for Automated Classification and Extraction of Drug Mentions in Tweets LAR Hernandez, RC Srinivasa, JM Banda, NeurIPS 2021 Workshop LatinX in AI,   2021. Overview of the sixth social media mining for health applications (#SMM4H) shared tasks at NAACL 2021, A Magge, A Klein, A Miranda-Escalada, M Ali Al-Garadi, I. Alimova, Z Miftahutdinov, E Farre, S Lima Lopez, I Flores, K O'Connor, D Weissenbacher, E Tutubalina, A Sarker, JM Banda, M Krallinger, G Gonzalez-Hernandez Proceedings of the Sixth Social Media Mining for Health (#SMM4H) Workshop and Shared Task Association for Computational Linguistics, Stroudsburg, PA, USA, 2021. Characterization of Anonymous Physician Perspectives on COVID-19 Using Social Media Data, KJ Sullivan, M Burden, A Keniston, JM Banda, LE Hunter,Biocomputing 2021, pp. 95-106 (2021) 2020 Risk of depression, suicide and psychosis with hydroxychloroquine treatment for rheumatoid arthritis: a multinational network cohort study,JCE Lane, J Weaver, K Kostka, T Duarte-Salles, MTF Abrahao, H Alghoul, O Alser, ..., JM Banda, et al. Rheumatology,   December 2020. Characterizing drug mentions in COVID-19 Twitter Chatter, R Tekumalla and JM Banda Proceedings of the 1st Workshop on NLP for COVID-19 (Part 2) at EMNLP 2020 Deep phenotyping of 34,128 adult patients hospitalised with COVID-19 in an international network study, E Burn, SC You, AG Sena, K Kostka, H Abedtash, MTF Abrahao, A Alberga, H Alghoul, O Alser, TM Alshammari, M Aragon, C Areia, JM Banda, et al. Nature Communications 11, 5009,  2020. Risk of hydroxychloroquine alone and in combination with azithromycin in the treatment of rheumatoid arthritis: a multinational, retrospective study,JCE Lane, J Weaver, K Kostka, T Duarte-Salles, MTF Abrahao, H Alghoul, O Alser, ..., JM Banda, et al.The Lancet Rheumatology,   August 2020. Clinical decision support tool for phototherapy initiation in preterm infants, Y Arain, JM Banda, J Faulkenberry, VK Bhutani, J Palma Journal of Perinatology,  2020. Mining Archive.org Twitter Stream Grab for Pharmacovigilance Resear",
  "content_length": 23280,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:42"
}