{
  "name": "Juan Cui",
  "homepage": "http://cse.unl.edu/~jcui",
  "status": "success",
  "content": "My Homepage Juan Cui Assistant Professor, Department of Computer Science and Engineering Courtesy Assistant Professor, School of Biological Science Univeristy of Nebraska-Lincoln Courtesy Assistant Professor, Department of Biochemistry and Molecular Biology, University of Nebraska Medical Center 122B, Avery Hall, 1144 T Street Lincoln, NE, 65888-0115 Phone: 402-472-5023 Email: jcui@cse.unl.edu Visit Cui' Group (Most Updated) >>> Research Interests: Computational and systems biology, bioinformatics, cancer informatics, data mining and machine learning [top] Education and Training: â¢Â  Assistant research scientist/group leader in cancer bioinformatics (2011~2013), Department of Biochemistry and Molecular Biology, University of Georgia â¢Â  Postdoc. /group leader in cancer bioinformatics (2008~2011), Department of Biochemistry and Molecular Biology, University of Georgia â¢Â  Ph.D in Bioinformatics (2008), Department of Computational Science and Department of Pharmacy, National University of Singapore â¢Â  B.E. in Information engineering (2002), School of Electronic Engineering, Northwestern Polytechnic University, China [top] Journal Publications: (Check the most recent update >>>) Chiang K, Shu J, Zempleni J, Cui J. Dietary MicroRNA Database (DMD): An archive database and analytic tool for microRNAs in human foods. PLoS ONE. 2015 Accepted. Zempleni J, Baier SR, Howard KM, Cui J. Gene regulation by dietary microRNAs. Invited paper, Can J Physiol Pharmacol, April 2015, 10.1139/cjpp-2014-0392. Juan Cui, Yanbin Yin, Qin Ma, Guoqing Wang, Victor Olman, Yu Zhang, Wen-Chi Chou, Celine S. Hong, Chi Zhang, Sha Cao, Xizheng Mao, Ying Li, Steve Qin, Shaying Zhao, Jing Jiang, Phil Hastings, Fan Li, Ying Xu. Comprehensive Characterization of Genomic Alterations in Human Gastric Cancer International Journal of Cancer 2014 Nov 24. doi: 10.1002/ijc.29352. Beach S, Brody G, Lei GH, Kim S, Cui J, Philibert R. Is serotonin transporter genotype associated with epigenetic susceptibility or vulnerability? Examination of the impact of socioeconomic status risk on African American youth Development and Psychopathology 2014, 26:289â304 Qin Ma, Jaxk H. Reeves, David A. Liberles, Lili Yu, Zheng Chang, Jing Zhao, Juan Cui, Ying Xu, Liang Liu. A phylogenetic model for understanding the effect of gene duplication on cancer progression Nucleic Acids Research 2014, doi: 10.1093/nar/gkt1320 Sun H, Wang HP, Tang KL, Qin G, Cui J, Cao ZW, Liu Qi. iPEAP: integrating multiple omics and genetic data for pathway enrichment analysis, BioinformaticsÂ  2013 Oct 30. doi: 10.1093 [Epub ahead of print] Jiaxin Wang, Yanchun Liang, Yan Wang, Juan Cui, Ming Liu, Wei Du, Ying Xu, Computational Prediction of Human Salivary Proteins from Blood Circulation and Application to Diagnostic Biomarker Identification, submitted to PLoS ONE, 2013 Nov 12;8(11): e80211 Dong XY, Wang GQ, Zhang GQ, Ni ZH, Suo J, Cui J, Cui A, Xu Y, Li F (2013) The endothelial lipase protein is promising urinary biomarker for diagnosis of gastric cancer. Diagnostic Pathology 8 (1), 45, 2013. Xu K, Mao XZ, Mehta M, Cui J, Zhang C, Mao FL, Xu Y (2013) Elucidation of How Cancer Cells Avoid Acidosis through Comparative Transcriptomic Data Analysis, PLoS ONE, e71177, 2013. Cui J, Mao X, Olman V, Hastings PJ, Xu Y (2012) Hypoxia and miscoupling between reduced energy efficiency and signaling to cell proliferation drive cancer to grow increasingly faster. Journal of Molecular Cell Biology 4: 174-176. Cui J, Liang YC, Xu Y (2012) Systems biology in the frontier of cancer research: a report on the Second International Workshop of Cancer Systems Biology. Chin J Cancer. Aug 28. doi: 10.5732/cjc.012.10205. Su Y, Ni Z, Wang G, Cui J, Wei C, et al. (2012) Aberrant expression of microRNAs in gastric cancer and biological significance of miR-574-3p. International Immunopharmacology 13: 468-475. Liu Q, Zhou H, Cui J, Cao Z, Xu Y (2012) Reconsideration of in-silico siRNA design based on feature selection: a cross-platform data integration perspective. PLoS ONE 7: e37879. Xu K, Mao X, Mehta M, Cui J, Zhang C, et al. (2012) A comparative study of gene-expression data of basal cell carcinoma and melanoma reveals new insights about the two cancers. PLoS ONE 7: e30750. Cui J, Eldredge JB, Xu Y, Puett D (2011) MicroRNA expression and regulation in human ovarian carcinoma cells by luteinizing hormone. PLoS ONE 6.: e21730 Cui J, Miner BM, Eldredge JB, Warrenfeltz SW, Dam P, et al. (2011) Regulation of gene expression in ovarian cancer cells by luteinizing hormone receptor expression and activation. BMC Cancer 11: 280. Cui J, Chen Y, Chou WC, Sun L, Chen L, et al. (2011) An integrated transcriptomic and computational analysis for biomarker identification in gastric cancer. Nucleic Acids Research 39: 1197-1207. Cui J, Li F, Wang G, Fang X, Puett JD, et al. (2011) Gene-expression signatures can distinguish gastric cancer grades and stages. PLoS ONE 6: e17819. Gao J*, Cui J*, Wang Y, Dong ZN, Tian YP, et al. (2011) Identification of potential predictors for subtype IgA nephropathy through analyses of blood biochemical indicators. Clinica Chimica Acta 412: 441-445. Hong CS, Cui J, Ni Z, Su Y, Puett D, et al. (2011) A computational method for prediction of excretory proteins and application to identification of gastric cancer markers in urine. PLoS ONE 6: e16875. Xu K*, Cui J*, Olman V, Yang Q, Puett D, et al. (2010) A comparative analysis of gene-expression data of multiple cancer types. PLoS ONE 5: e13696. Zhang X, Cui J, Nilsson D, Gunasekera K, Chanfon A, et al. (2010) The Trypanosoma brucei MitoCarta and its regulation and splicing pattern during development. Nucleic Acids Research 38: 7378-7387. Liu Q, Cui J, Yang Q, Xu Y (2010) In-silico prediction of blood-secretory human proteins using a ranking algorithm. BMC Bioinformatics 11: 250. Lu Y, Gao Y, Cao Z, Cui J, Dong Z, et al. (2010) A study of health effects of long-distance ocean voyages on seamen using a data classification approach. BMC Med Inform Decis Mak 10: 13. Diao H, Xiao S, Cui J, Chun J, Xu Y, et al. (2010) Progesterone receptor-mediated up-regulation of transthyretin in preimplantation mouse uterus. Fertility and Sterility 93: 2750-2753. Jia J, Cui J, Liu X, Han J, Yang S, et al. (2009) Genome-scale search of tumor-specific antigens by collective analysis of mutations, expressions and T-cell recognition. Mol Immunol 46: 1824-1829. Cui J, Liu Q, Puett D, Xu Y (2008) Computational prediction of human proteins that can be secreted into the bloodstream. Bioinformatics 24: 2370-2375. Cui J, Han LY, Lin H, Tang ZQ, Ji Z, et al. (2007) Advances in exploration of machine learning methods for predicting functional class and interaction profiles of proteins and peptides irrespective of sequence homology. Current Bioinformatics 2: 95-112. Tang ZQ, Han LY, Lin HH, Cui J, Jia J, et al. (2007) Derivation of stable microarray cancer-differentiating signatures using consensus scoring of multiple random sampling and gene-ranking consistency evaluation. Cancer Res 67: 9996-10003. Cui J, Han LY, Lin HH, Zhang HL, Tang ZQ, et al. (2007) Prediction of MHC-binding peptides of flexible lengths from sequence-derived structural and physicochemical properties. Mol Immunol 44: 866-877. Cui J, Han LY, Li H, Ung CY, Tang ZQ, et al. (2007) Computer prediction of allergen proteins from sequence-derived protein structural and physicochemical properties. Mol Immunol 44: 514-520. Xie B, Zheng CJ, Han LY, Ong S, Cui J, et al. (2007) PharmGED: pharmacogenetic effect database. Clin Pharmacol Ther 81: 29. Zheng CJ, Han LY, Xie B, Liew CY, Ong S, et al. (2007) PharmGED: Pharmacogenetic Effect Database. Nucleic Acids Research 35: D794-799. Cui J, Han LY, Lin HH, Tang ZQ, Jiang L, et al. (2006) MHC-BPS: MHC-binder prediction server for identifying peptides of flexible lengths from sequence-derived physicochemical properties. Immunogenetics 58: 607-613. Han L, Cui J, Lin H, Ji Z, Cao Z, et al. (2006) Recent progresses in the application of machine learning approach for predicting protein functional class independent of sequence similarity. Proteomics 6: 4023-4037. Zheng CJ, Han LY, Chen X, Cao ZW, Cui J, et al. (2006) Information of ADME-associated proteins and potential application for pharmacogenetic prediction of drug responses. Current Pharmacogenomics 4: 87-103. Cui J, Han LY, Cai CZ, Zheng CJ, Ji ZL, et al. (2005) Prediction of functional class of novel bacterial proteins without the use of sequence similarity by a statistical learning method. J Mol Microbiol Biotechnol 9: 86-100. Han LY, Zheng CJ, Lin HH, Cui J, Li H, et al. (2005) Prediction of functional class of novel plant proteins by a statistical learning method. New Phytol 168: 109-121. Han LY, Cai CZ, Ji ZL, Cao ZW, Cui J, et al. (2004) Predicting functional family of novel enzymes irrespective of sequence similarity: a statistical learning approach. Nucleic Acids Research 32: 6437-6444. Books:Â Xu Y, Cui J and J. Dave Puett, (Introduction to Cancer Bioinformatics) , Springer, New York. Invited Chapters:Â Cui J Cui J. âGenomic Data Analysis for Personalized Healthcareâ. In Healthcare Data Analytics. Edited by Chandan K. Reddy, Charu C. Aggarwal. CRC Press (Data Mining and Knowledge Discovery Series), 2015. Cui J, Xu Y, Puett D. 2013. Microarray-Based Transcriptome Profiling of Ovarian Cancer Cells. In Ovarian cancer - Methods and Protocols. Springer, New York. doi:10.1007/978-1-62703-547-7 Cui J, Xu Y, Puett D. 2012. Transcriptomic Analysis of Human Ovarian Cancer Cells: Changes Mediated by Luteinizing Hormone Receptor Activation. In Ovarian Cancer. InTech, Rijeka. doi:10.5772/28204 Conference Publications:Â Shu J, Chiang K, Cui J. Computational characterization of microRNA-mediated association between obesity and cancer. In: Proceedings of the 106th Annual Meeting of the American Association for Cancer Research(AACR); 2015 Apr 18-22; Philadelphia, PA.2015 Zempleni J, Baier SR, Cui J, Wolf T. Bovine microRNAs are bioa",
  "content_length": 20023,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:39"
}