{
  "name": "Juan A. Sánchez-Laguna",
  "homepage": "https://ants.inf.um.es/staff/jlaguna",
  "status": "success",
  "content": "Juan A. Sánchez's web page Juan A. Sánchez Laguna Associate Professor jlaguna@um.es (+34) 868 888 505 Office 1.24 Juan Antonio Sánchez Laguna I am an Associate Professor in the Department of Communications and Information Engineering (DIIC) at the Computer Science Faculty, of the University of Murcia, Spain. I received a B.Sc. (1997), M.Sc. (1999) and Ph.D. (2006) degree in Computer Science from the University of Murcia. Research Since 2017 I work with Juan A. Botía applying artificial intelligence, machine learning and data mining techniques to help MDs intepretate the aetiology of neurological diseases such as Alzheimer or Parkinson. However, my PhD Thesis and most of my postdoctoral research activity has been focused on new routing protocols for Wireless Sensor Networks, Geographic Routing and Vehicular Networks. In these fields, I am the co-author of several book chapters and articles published in international top level journals and conference proceedings: schoolar account. Additionally, I have worked in several national and international R&D projects in the fields of Wireless and Mobile Networks, Multimedia Applications and Next Generation Networks: BRAIN, MIND, EURO6IX and 6POWER. Teaching I have been teaching at the University of Murcia since 2003. I have taught Concurrent Programming, Object Oriented Programming, and Introduction to Programming (CS1 and CS2) for students of Computer Science and Mathematics degrees. I have published several documents and video tutorials as well as some interactive tools designed to help students learn programming, and some others to help teachers do their work: Introduction to Programming CS2 Object Oriented Programming Proyecto Descubre JMP: Java Message Passing for concurrency Bookle: online booking service to arrange head-to-head sessions Academic positions From 2008 to 2012 I was Vice Dean of Quality Assurance at the Computer Science Faculty. And from 2012 to 2017 I was Vice Dean of Studies. I have also been the programme coordinator of the degree in Computer Science and the coordinator of the M.Sc. and Ph.D. “New Technologies in Computer Science” programme at the University of Murcia. Professional experience Before deciding that I wanted to be a teacher at the University, I worked for some private companies aquiring experience in several fields: designing, developing and deploying corporative database applications, smartcards, back-end and front-end web applications, embedded applications, etc. I was also one of the main developers of the Isabel Project at Agora Systems S.A. where I worked in audio and video capture, compression and transmission over the network, as well as quality of service and session management protocols. Lastly, after leaving Agora Systems S.A., I became Quality Consultant for SQA Murcia S.L were I was in charge of organizing and improving several corporative processes. Finally, I became a research fellow at the University of Murcia where I was able to work in several R&D projects.",
  "content_length": 3003,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:37"
}