{
  "name": "Juan Raposo",
  "homepage": "https://pdi.udc.es/es/File/Pdi/S429E",
  "status": "success",
  "content": "Ficha de Juan Raposo Santiago Departamento Ciencias de la Computación y Tecnologías de la Información Área Ingeniería telemática Investigación Grupo de investigación Telemática Líneas de investigación Sistemas de virtualización de datos, integración de datos distribuidos, automatización web, optimización de secuencias de navegación web Palabras clave Sistemas de virtualización de datos, integración de datos distribuidos, automatización web, optimización de secuencias de navegación web Contacto Directorio de la UDC Orcid id0000-0003-4913-618X ResearcherIDI-2500-2015 Scopus8236673700 Docencia impartida En este apartado se muestra la docencia impartida en grados, másteres y resto de estudios oficiales en los últimos 6 años. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 150 Prácticas en Empresa Grado en Ingeniería Informática Optativo 0 10 Programación Avanzada Grado en Ingeniería Informática Optativo 0 21 Trabajo Fin de Grado. Mención en Computación Grado en Ingeniería Informática Obligatorio 0 2 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 16 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 16 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 120 Programación Avanzada Grado en Ingeniería Informática Optativo 0 21 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 14,5 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 16 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 90 Programación Avanzada Grado en Ingeniería Informática Optativo 0 17 Redes Grado en Ingeniería Informática Obligatorio 0 15 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 20 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 8 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 80 Programación Avanzada Grado en Ingeniería Informática Optativo 0 21 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 32 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 8 Trabajo Fin de Máster Máster Universitario en Ingeniería Informática Obligatorio 0 15 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 75 Programación Avanzada Grado en Ingeniería Informática Optativo 0 30 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 24 Trabajo Fin de Grado. Mención en Tecnologías de la Información Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 4 Trabajo Fin de Máster Máster Universitario en Ingeniería Informática Obligatorio 0 10 Asignatura y estudios en la que se imparte Carácter Horas a distancia Horas totales Internet y Sistemas Distribuidos Grado en Ingeniería Informática Obligatorio 0 105 Prácticas en Empresa Grado en Ingeniería Informática Optativo 0 0 Prácticas en Empresa Grado en Ingeniería Informática Optativo 0 5 Programación Avanzada Grado en Ingeniería Informática Optativo 0 18 Trabajo Fin de Grado. Mención en Ingeniería del Software Grado en Ingeniería Informática Grado en Ingeniería Informática. Curso Puente Obligatorio 0 16 Tutorías 2025/2026 Tutorías definidas por el/la docente para el curso académico 2025/2026. Facultad de Informática Cuatrimestre Día Lugar Primer cuatrimestre lunes 10:30 a 12:30 Despacho 3.11 del edificio Área Científica / Teams Primer cuatrimestre miércoles 10:30 a 12:30 Despacho 3.11 del edificio Área Científica / Teams Primer cuatrimestre jueves 16:30 a 18:30 Teams Trabajos de fin de grado y máster Dirigidos o codirigidos por el/la docente desde el año 2013. 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 2019/2020 2018/2019 2017/2018 2016/2017 2015/2016 2014/2015 Aplicación para la gestión de rutas de recogida de residuos Componente de monitorización para el Denodo Embedded MPP integrado en la herramienta de monitorización de la Denodo Platform Desarrollo del Módulo Dock Management para Easylog WMS: Optimización de Gestión Logística en Muelles de Almacenes Modernización de los sistemas de información de los Servicios Sociales: Desarrollo de Nuevas funcionalidades y mejoras en el módulo de Centros del Sistema Operativo Integral de Infancia y Familia Aplicación para ayudar en la gestión y monitorización de vendimias. Aplicación para Visualizar los Resultados de Ejecución de un Framework de Pruebas Automatizadas basado en TestNG Aplicación web de compraventa de artículos de segunda mano y reacondicionados Configurador Visual de Espacios para Sistemas de Producción Automática. Diseño e Implementación de una Plataforma Web para la Gestión de Agendas y Control de Ingresos Aplicación móvil para la gestión de listas da compra entre varios usuarios Diseño e Implementación de una Aplicación Web para Formar Grupos de Estudio y Compartir Recursos Homogeneización y documentación en el framework de Enxenio Optimización de las comunicaciones con UAVs en una API de gestión de vuelos de rescate Plataforma software para la gestión de llaves de Comunidades de Propietarios Análisis, Diseño e Implementación de un Catálogo de Datos para una Plataforma de Virtualización de Datos Aplicación web para la gestión de ventas de una empresa de palets Aplicación web para sugerir y compartir recetas de cocina basadas en ingredientes concretos Automatización del soporte a pacientes SERGAS en situaciones de alta demanda telefónica Desarrollo de una aplicación web para gestionar una comunidad de juegos en línea Diseño e implementación de una aplicación web para la gestión de grupos Aplicación multiplataforma para la gestión de partituras y de proyectos musicales Aplicación Web SPA para Visualizar los Resultados de Ejecución de un Framework de Pruebas Automatizadas Desarrollo de un módulo para la gestión de visitas en residencias de mayores Desarrollo de una aplicación para gestionar plazas de aparcamiento para personas de movilidad reducida Desarrollo de una aplicación web para la automatización de los procesos de venta y postventa de productos de luz y sonido profesionales Diseño e implementación de una aplicación web para la gestión y actividad de una tienda de ocio Optimización en la ejecución del procesamiento de datos en una plataforma IoT Plataforma para la gestión automatizada de pedidos ecommerce en el sector textil Aplicación Web para administrar y configurar una herramienta de programación de tareas Aplicación web SPA para la gestión de un gabinete de nutrición Diseño e implementación de una aplicación para el transporte ferroviario de viajeros Diseño e implementación de una aplicación web para mejorar los resultados académicos de los alumnos de una escuela Software para la gestión centralizada de EDAR en zonas rurales Aplicación web de carácter social para gestionar películas vistas con un sistema de recomendaciones Diseño e implementación de City Trash, una aplicación web para la gestión de residuos Aplicación para la planificación y gestión de viajes turísticos Aplicación web de análisis deportivo Desarrollo de una aplicación Web de anuncios de productos. Diseño e implementación de una Aplicación Web híbrida como Portal de Paciente dentro de un sistema de asistencia médica domiciliaria Aplicación para la Gestión de Entrenamientos de Fútbol Diseño e implementación de una aplicación web para gestionar torneos de pádel Diseño e implementación de una aplicación web para la gestión de un club hípico Análisis y mejora de herramientas Open Source para la implementación de un sistema XDS en un entorno profesional Diseño e Implementación de una Aplicación Web para la Gestión Agendas e Control de Gastos e Ingresos Diseño e implementación de una aplicación web para la gestión de proyectos de homologación de reformas en vehículos para una empresa real Portal de servicios para clientes de una empresa de sistemas de seguridad. Puede consultar los méritos de investigación seleccionando un tipo de mérito y el año. Proyectos, contratos y convenios de I+D+I Patentes, registros y modelos de utilidad Artículos en revistas de investigación Libros completos Capítulos de libros Tésis doctorales dirigidas Comunicaciones en congresos 2025 2024 2023 2022 2021 ... 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 1999 Entidad financiadora Denodo S.L. Investigadores principales Juan Raposo Santiago Tipo Contrato Fechas Desde 16/04/2025 a 15/04/2026 Entidad financiadora Consellería de Educación, Ciencia, Universidades e Formación Profesional Investigadores principales Fidel Cacheda Seijo Tipo Proyecto Programas Autonomicos Fechas Desde 01/01/2024 a 20/11/2026 Entidad financiadora Denodo S.L. Investigadores principales José Losada Pérez Tipo Contrato Fechas Desde 15/03/2024",
  "content_length": 30480,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:52"
}