{
  "name": "Juan J. Romero Cardalda",
  "homepage": "https://pdi.udc.es/en/File/Pdi/9D9AF",
  "status": "success",
  "content": "Juan Jesús Romero Cardalda File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Creative Technologies and Artificial Intelligence Research lines No data available from Curriculum Management System at UDC. (SUXI). Contacto UDC directory Orcid id0000-0001-5566-5382 Scopus57194377387 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Audio Degree in Audiovisual Communication Degree in Audiovisual Communication Compulsory 0 222 Object-Oriented Programming Degree in Digital Creation, Animation and Video Games Compulsory 0 0 Subject and involved studies Type Distance hours Total hours Audio Degree in Audiovisual Communication Compulsory 0 120 Object-Oriented Programming Degree in Digital Creation, Animation and Video Games Compulsory 0 75 Sound Degree in Digital Creation, Animation and Video Games Compulsory 0 20 Subject and involved studies Type Distance hours Total hours Advanced Video Game Programming Master´s Degree in Designs, Development and Marketing of Videogames Optional 0 18 Audio Degree in Audiovisual Communication Compulsory 0 120 Final Year Dissertation Degree in Audiovisual Communication Compulsory 0 10 Subject and involved studies Type Distance hours Total hours Audio Degree in Audiovisual Communication Compulsory 0 110 Master's Dissertation Master in Cibersecurity Compulsory 0 5 Object-Oriented Programming Degree in Digital Creation, Animation and Video Games Compulsory 0 65 Programming Basics Degree in Digital Creation, Animation and Video Games Core 0 47 Subject and involved studies Type Distance hours Total hours Computer Security and Legislation Degree in Computer Engineering Compulsory 0 95 Object-Oriented Programming Degree in Digital Creation, Animation and Video Games Compulsory 0 10 Programming Basics Degree in Digital Creation, Animation and Video Games Core 0 41 Sound Degree in Digital Creation, Animation and Video Games Compulsory 0 61 Subject and involved studies Type Distance hours Total hours Audio Degree in Audiovisual Communication Compulsory 0 50 Computer Security and Legislation Degree in Computer Engineering Compulsory 0 95 Development of Web and Video Content Degree in Audiovisual Communication Compulsory 0 0 Object-Oriented Programming Degree in Digital Creation, Animation and Video Games Compulsory 0 75 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Communication Studies Quarter Day Site 1st quarter Monday 10:00 a 14:00 Despacho. reservar hora por email 1st quarter Tuesday 10:00 a 14:00 Despacho. reservar hora por email 2nd quarter Wednesday 10:00 a 14:00 Despacho. reservar hora por email EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2021/2022 2020/2021 2017/2018 Based on imaginary events Based on imaginary facts Web Scraping system for real estate portals Mimomú Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Complete books Book chapters PhD theses directed Conference papers 2022 2021 2019 2016 2014 ... 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 1998 Funding entity Consellería de Educación Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2025 Funding entity Ministerio de Ciencia e Innovación Type Proyecto Programas Nacionales Dates From 01/09/2021 to 31/08/2024 Funding entity Axencia Galega de Innovación Main researches Juan Jesús Romero Cardalda Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 31/12/2020 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 01/01/2019 to 20/11/2021 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Manuel F. González Penedo Type Proyecto Programas Autonomicos Dates From 01/01/2016 to 30/11/2019 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 17/10/2014 to 17/10/2017 Funding entity Ministerio de Economía y Competitividad (MINECO) Main researches Alejandro Pazos Sierra Type Proyecto Programas Nacionales Dates From 01/01/2013 to 31/12/2015 Funding entity Xunta de Galicia Main researches Ricardo Cao Abad Type Proyecto Programas Autonomicos Dates From 01/01/2012 to 31/12/2013 Funding entity Consellería de Cultura, Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 19/08/2011 to 18/08/2014 Funding entity Fundaçao para a Ciência e a Tecnologia, Ministério da Educaçao e Ciência Main researches Penousal Machado Type Proyecto Internacional Dates From 01/04/2011 to 31/03/2014 Funding entity CONSELLERÍA DE ECONOMÍA E INDUSTRIA Main researches Juan Romero Cardalda Type Proyecto Programas Autonomicos Dates From 14/12/2010 to 14/12/2013 Funding entity Ministerio de Economía y Competitividad Main researches Juan Romero Type Proyecto Programas Nacionales Dates From 01/01/2009 to 31/12/2011 Funding entity Instituto de Salud Carlos III (ISCIII) Main researches Alejandro Pazos Sierra Type Proyecto Otros Programas Dates From 01/01/2008 to 31/12/2012 Type Proyecto Otros Programas Dates From 31/08/2007 to 15/11/2010 Funding entity Consellería de Educación e Ordenación Universitaria Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 10/08/2007 to 10/08/2010 Funding entity Xunta de Galicia Main researches Alejandro Pazos Sierra Type Proyecto Otros Programas Dates From 14/12/2006 to 13/12/2008 Funding entity Consellería de Innovación, Industria e Comercio Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 05/08/2005 to 04/08/2008 Funding entity Dirección Xeral de Investigación e Desenvolvemento Type Proyecto Otros Programas Dates From 13/08/2004 to 12/08/2007 Funding entity Dirección Xeral de Investigación e Desenvolvemento Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 04/06/2004 to 03/06/2007 Funding entity Dirección Xeral de Investigación e Desenvolvemento Main researches Alejandro Pazos Sierra Type Proyecto Otros Programas Dates From 04/06/2004 to 03/06/2007 Funding entity MICROSOFT IBÉRICA, S.R.L. Type Contrato Dates From 30/10/2003 to 30/10/2004 Funding entity Comisión Interministerial de Ciencia y Tecnología (CICYT) Main researches Alejandro Pazos Sierra Type Proyecto Programas Nacionales Dates From 01/12/2003 to 30/11/2006 Funding entity UDC Main researches Juan Jesús Romero Cardalda Type Proyecto Otros Programas Dates From 01/01/2003 to 31/12/2003 Funding entity Universidade da Coruña (UDC) Main researches Juan Jesús Romero Cardalda Type Proyecto Otros Programas Dates From 17/07/2002 to 17/07/2003 Funding entity FUNDACIÓN UDC Main researches Alejandro Pazos Sierra Type Contrato Dates From 01/03/2001 to 01/08/2001 Type Proyecto Otros Programas Dates From 23/05/2001 to 23/05/2002 Type Proyecto Otros Programas Dates From 01/12/2001 to 30/11/2005 Funding entity Comisión Interministerial de Ciencia y Tecnología (CICYT) Main researches Alejandro Pazos Sierra Type Proyecto Otros Programas Dates From 01/10/1998 to 30/09/2000 2011 Type Software Registrado Entity Universidade da Coruña (UDC) Authors Adrian Carballal Mato, Juan Jesus Romero Cardalda, José Carlos Dafonte Vázquez, Antonino Santos Del Riego Application date 13/12/2011 Type Software Registrado Entity Universidade da Coruña (UDC) Authors Adrian Carballal Mato, Juan Jesus Romero Cardalda, José Carlos Dafonte Vázquez, Antonino Santos Del Riego Application date 13/12/2011 2021 2020 2019 2016 2015 ... 2013 2012 2011 2010 2009 2007 2005 2004 2003 2000 Authors Adrian Carballal Mato, Francisco Cedron, Iria Santos, Antonino Santos Del Riego, Juan Jesús Romero Cardalda Journal NEURAL COMPUTING & APPLICATIONS (pages 1 to 13) DOI https://doi.org/10.1007/s00521-020-05550-x Authors Luz Castro Pena, Adrian Carballal Mato, Nereida Rodriguez-Fernandez, Iria Santos, Juan Jesús Romero Cardalda Journal Automation in Construction Vol. 124 DOI https://doi.org/10.1016/j.autcon.2021.103550 Authors Adrian Carballal Mato, Carlos Fernández Lozano, Nereida Rodriguez-Fernandez, Iria Santos, Juan Jesús Romero Cardalda Journal Entropy Vol. 22 Num. 4 (pages 1 to 114) DOI https://doi.org/10.3390/e22040488 Authors Juan Jesús Romero Cardalda, Antonino Santos Del Riego, Adrian Carballal Mato, Nereida Rodriguez-Fernandez, Iria Santos, Álvaro Torrente-Patiño, Corunet, Fernando Penousal Machado Journal Entropy Vol. 22 Num. 12 (pages 1362 to 1362) DOI https://doi.org/10.3390/e22121362 Authors Juan Jesús Romero Cardalda, Fernando Jorge Penousal Machado Journal NEURAL COMPUTING & APPLICATIONS Authors Adrian Carballal Mato, Carlos Fernández Lozano, Jonathan Heras, Juan Jesús Romero Cardalda Journal NEURAL COMPUTING & APPLICATIONS (pages 1 to 12) Authors Juan Jesús Romero Cardalda, Jon McCormack, Colin G. Johnson, Iria Santos Journal COMPLEXITY Authors Juan Jesús Romero Cardalda, Colin G. Johnson, Jon McCormack Journal COMPLEXITY Authors Carlos Fernández Lozano, Adrian Carballal Mato, Penousal Machado, Antonino Santos Del Riego, Juan Jesús Romero Cardalda Journal PEERJ (pages 1 to 28) DOI https://doi.org/10.7717/peerj.7075 Authors Penousal Machado, Juan Jesús Romero Cardalda, Adrian Carballal Mato Journal International Journal of Arts and Technology Vol. 9 Num. 1 (pages 1 to 3) Authors Adrian Carballal Mato, Antonino Santos Del Riego, Juan Jesús Romero Cardalda, Penousal Machado, Joao Correia, Luz Castro Pena Journal NEURAL COMPUTING & ",
  "content_length": 26799,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:43"
}