{
  "name": "Juan Pablo Bello",
  "homepage": "https://engineering.nyu.edu/faculty/juan-pablo-bello",
  "status": "success",
  "content": "Juan Pablo Bello | NYU Tandon School of Engineering Skip to Main Content Search NYU Tandon Fulltext search Looking for News or Events? Juan Pablo Bello Professor Computer Science and Engineering Electrical and Computer Engineering Center for Urban Science + Progress Connect Email jb2843 [at] nyu.edu Phone 212.998.5736 Website https://wp.nyu.edu/jpbello/ Juan Pablo Bello is a Professor of Music Technology and Computer Science & Engineering at New York University. In 1998 he received a BEng in Electronics from the Universidad Simón Bolívar in Caracas, Venezuela, and in 2003 he earned a doctorate in Electronic Engineering at Queen Mary, University of London. Juan’s expertise is in digital signal processing, machine listening and music information retrieval, topics that he teaches and in which he has published more than 100 papers and articles in books, journals and conference proceedings. He is the director of the Music and Audio Research Lab (MARL), where he leads research on sound and music informatics. His work has been supported by public and private institutions in Venezuela, the UK, and the US, including Frontier and CAREER awards from the National Science Foundation and a Fulbright scholar grant for multidisciplinary studies in France. Research Interests Sound/music computing and technologies signal processing machine learning urban science Education Queen Mary University of London, London, UK 2003 PhD, Electronic Engineering Universidad Simon Bolivar, Caracas, Venezuela 1998 Bachelor of Engineering, Electronic Engineering Research News View More NYU researchers lead team that developed bird migration tracking with call detection technology A research team primarily based at New York University (NYU) has achieved a breakthrough in ornithology and artificial intelligence by developing an end-to-end system to detect and identify the subtle nocturnal calls of migrating birds. This advancement enhances bird migration tracking, potentially equipping conservationists with new data to bolster avian protection efforts. In a recent paper published in IEEE Transactions on Audio, Speech and Language Processing, the researchers — from NYU, Cornell Lab of Ornithology and École Centrale de Nantes in France — present their BirdVoxDetect system, detailing the core machine learning algorithms that drive this innovative bird call detection technology. The paper caps off the team’s eight-year study of the topic. \"We're now able to extract incredibly subtle patterns from these audio recordings that the human ear might miss,\" said Juan Pablo Bello, the team lead. Bello is an NYU professor with appointments in both the Tandon School of Engineering (Computer Science and Engineering and Electrical and Computer Engineering Departments) and the Steinhardt School of Culture, Education and Human Development (Department of Music and Performing Arts Professions). He is the director of NYU’s Music and Audio Research Lab and a member of NYU Tandon’s Center for Urban Science and Progress. The system can detect bird calls, identify species and discard corrupted audio with greater accuracy than prior work, potentially allowing for more precise tracking of migration patterns. This is like having a little army of expert birders with superhuman hearing and endless patience listening to the night sky\" — Juan Pablo Bello These advancements build upon earlier work published in the Journal of Applied Ecology, where the research team first demonstrated BirdVoxDetect's capabilities to predict the onset and species composition of large migratory flights. That study analyzed a full migration season's worth of audio data from microphones in upstate New York — over 4,800 hours of recordings. The system uses advanced machine learning techniques to analyze terabytes of audio data collected by networks of microphones, automatically picking out the brief \"chirps\" that many birds use to communicate during nocturnal migration. Traditional methods of studying migration, like radar and volunteer birdwatcher observations, have limitations. Radar can detect the flight’s biomass but can't identify species, while volunteer data is mostly limited to daytime sightings and indicative of occupancy rather than flight. Acoustic monitoring fills crucial gaps, allowing researchers to detect which species are migrating on a given night and more accurately characterize the timing of migrations. The research shows that data from a few microphones can accurately represent migration patterns hundreds of miles away. The researchers have made their system freely available as open-source software, allowing other scientists to apply it to their own data. This could enable continental-scale acoustic monitoring networks to track bird migration in unprecedented detail. \"We're entering a new era where we can monitor migration across vast areas in real-time,\" Bello said. \"That's game-changing for studying and protecting valuable, and potentially endangered, wildlife.\" Such data could prove crucial for conservation efforts. Many migratory bird populations are in steep decline due to habitat loss, climate change and other factors. Better understanding of migration timing and routes could help inform protection strategies. The authors suggest that acoustic monitoring should become an integral part of efforts to study and conserve migratory birds. The technology is particularly promising for remote or inaccessible areas where traditional observation is difficult. \"Acoustic sensors are relatively inexpensive and can operate autonomously for long periods,\" said Bello. \"This opens up exciting possibilities for monitoring migration in places we've never been able to study before.\" Bello, together with the Cornell Lab of Ornithology’s Andrew Farnsworth and Steve Kelling, started the BirdVox project in 2016. The multidisciplinary team also includes the study’s lead author Vincent Lostanlen of École Centrale de Nantes (formerly of NYU), Aurora Cramer, also NYU; Justin Salamon now at Adobe, as well as Benjamin M. Van Doren and Adriaan Dokter of the Cornell Lab of Ornithology. The work was primarily funded by the National Science Foundation (NSF), under grant numbers 1633259, 1633206 and ICER 1927743, with additional funding provided by Cornell University, the Leon Levy and Lyda Hill Foundations, Google, and WeAMEC project PETREL. V. Lostanlen et al., \"BirdVoxDetect: Large-Scale Detection and Classification of Flight Calls for Bird Migration Monitoring,\" in IEEE/ACM Transactions on Audio, Speech, and Language Processing, doi: 10.1109/TASLP.2024.3444486. Read the Paper September 4, 2024 Research Centers, Labs, and Groups Center for Urban Science + Progress (CUSP) The Center for Urban Science and Progress (CUSP) is an interdisciplinary research ... Email jb2843 [at] nyu.edu Phone 212.998.5736 Website https://wp.nyu.edu/jpbello/ Latest Stories All News News A seminal study on data augmentation wins Test-of-Time honors from the International Society for Music Information Retrieval Tandon in the Media AI is changing how we study bird migration From MIT Technology Review News Juan Pablo Bello is elected as an IEEE fellow Tandon in the Media New York City fines drivers for noisy vehicles thanks to sound meters From Fortune News NYU Tandon professors team up to explore complex urban systems Tandon in the Media Sounds of New York City From ACM Interactions Load More",
  "content_length": 7408,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:44"
}