{
  "name": "Juan-Zi Li",
  "homepage": "http://keg.cs.tsinghua.edu.cn/persons/ljz",
  "status": "success",
  "content": "Juanzi Li (Li, Juanzi) 's HomepageProfessorThe principal of Knowledge Engineering GroupResearch Interests: Knowledge Engineering and Semantic Web, Text and Social Network MiningPhD Dissertation: (1996.9-2000.1) Chinese Word Sense Disambiguation, Supervisor: Prof. Huang ChangningPostdoctoral Thesis: (2000.1-2001.12) Chinese Structural Language Understanding Model, Coordinator: Prof. Wang ZuoyingPhone: (010)62781461 Fax: (010)62789831Email: lijuanzi@tsinghua.edu.cnAddress: Department of Computer Science and Technology, Tsinghua University, Beijing, 100084, ChinaTeaching1. Data Mining (for Undergraduate Students)2. Knowledge Engineering (for Graduate Students)Books1. Jie Tang and Juanzi Li. Semantic Mining of Social Networks. Morgan & Claypool Publishers, 20152. Marie-Francine Moens, Juanzi Li, Tat-Seng Chua: Mining User Generated Content, Taylor & Francis Group, 20143. 张磊 江勇 李涓子: 万维网科学的研究框架 清华大学出版社 2009年译自 Tim Berners-Lee，Wendy Hall，James A. Hendler: A Framework for Web Science4. 黄昌宁 李涓子： 语料库语言学 商务印书馆 2002年PUBLICATIONS2024Jifan Yu, Xiaozhi Wang, Shangqing Tu, Shulin Cao, Daniel Zhang-Li, Xin Lv, Hao Peng, Zijun Yao, Xiaohan Zhang, Hanming Li, Chunyang Li, Zheyuan Zhang, Yushi Bai, Yantao Liu, Amy Xin, Kaifeng Yun, Linlu GONG, Nianyi Lin, Jianhui Chen, Zhili Wu, Yunjia Qi, Weikai Li, Yong Guan, Kaisheng Zeng, Ji Qi, Hailong Jin, Jinxin Liu, Yu Gu, Yuan Yao, Ning Ding, Lei Hou, Zhiyuan Liu, Xu Bin, Jie Tang, Juanzi Li. KoLA: Carefully Benchmarking World Knowledge of Large Language Models. （ICLR 2024）Kai Sun, Jifan Yu, Juanzi Li, Lei Hou. Exploring Sequence-to-sequence Taxonomy Expansion via Language Model Probing. Expert Systems with Applications (ESWA).Linmei Hu, Zeyi Liu, Ziwang Zhao, Lei Hou, Liqiang Nie, Juanzi Li. A Survey of Knowledge Enhanced Pre-Trained Language Models. (TKDE)Yantao Liu, Zijun Yao, Xin Lv, Yuchen Fan, Shulin Cao, Jifan Yu, Lei Hou* and Juanzi Li. Untangle the KNOT: Interweaving Conflicting Knowledge and Reasoning Skills in Large Language Models. (LREC-COLING 2024)Jifan Yu, Xiaohan Zhang, Yifan Xu, Xuanyu Lei, Zijun Yao, Jing Zhang, Lei Hou and Juanzi Li. A Cause-Effect Look at Alleviating Hallucination of Knowledge-grounded Dialogue Generation. (LREC-COLING 2024)Yuchen Fan, Yantao Liu, Zijun Yao, Jifan Yu, Lei Hou and Juanzi Li. Evaluating Generative Language Models in Information Extraction as Subjective Question Correction. (LREC-COLING 2024)Yong Guan, Xiaozhi Wang, Lei Hou*, Juanzi Li, Jeff Pan, Jiaoyan Chen and Freddy Lecue. TacoERE: Cluster-aware Compression for Event Relation Extraction. (LREC-COLING 2024)Yong Guan, Dingxiao Liu, Jinchen Ma, Hao Peng, Xiaozhi Wang, Lei Hou* and Ru Li. Event GDR: Event-Centric Generative Document Retrieval. (WWW 2024)Yujia Qin, Xiaozhi Wang, Yusheng Su, Yankai Lin, Ning Ding, Jing Yi, Weize Chen, Zhiyuan Liu, Juanzi Li, Lei Hou, Peng Li, Maosong Sun, Jie Zhou. Exploring Universal Intrinsic Task Subspace for Few-Shot Learning via Prompt Tuning. (TASLP)Yakun Li, Lei Hou, Juanzi Li. Towards Knowledge-aware and Deep Reinforced Cross-Domain Recommendation over Collaborative Knowledge Graph. (TKDE)Kaisheng Zeng, Hailong Jin, Xin Lv, Fangwei Zhu, Lei Hou*, Yi Zhang, Fan Pang, Yu Qi, Dingxiao Liu, Juanzi Li, Ling Feng. XLORE 3: A Large-scale Multilingual Knowledge Graph from Heterogeneous Wiki Knowledge Resources. (TOIS)Shangqing Tu, Yuanchun Wang, Jifan Yu, Yuyang Xie, Yaran Shi, Xiaozhi Wang, Jing Zhang, Lei Hou*, Juanzi Li. R-Eval: A Unified Toolkit for Evaluating Domain Knowledge of Retrieval Augmented Large Language Models. (KDD 2024)Shangqing Tu, Yuliang Sun, Yushi Bai, Jifan Yu, Lei Hou*, Juanzi Li. WaterBench: Towards Holistic Evaluation of Watermarks for Large Language Models. (ACL 2024)Yushi Bai, Xin Lv, Jiajie Zhang, Hongchang Lyu, Jiankai Tang, Zhidian Huang, Zhengxiao Du, Xiao Liu, Aohan Zeng, Lei Hou, Yuxiao Dong, Jie Tang, Juanzi Li. LongBench: A Bilingual, Multitask Benchmark for Long Context Understanding. (ACL 2024)Xiaozhi Wang, Hao Peng, Yong Guan, Kaisheng Zeng, Jianhui Chen, Lei Hou, Xu Han, Yankai Lin, Zhiyuan Liu, Ruobing Xie, Jie Zhou, Juanzi Li. MAVEN-ARG: Completing the Puzzle of All-in-One Event Understanding Dataset with Event Argument Annotation. (ACL 2024)Xiaokang Zhang, Zijun Yao, Jing Zhang, Kaifeng Yun, Jifan Yu, Juanzi Li, Jie Tang. Transferable and Efficient Non-Factual Content Detection via Probe Training with Offline Consistency Checking. (ACL 2024)YJinxin Liu, Shulin Cao, Jiaxin Shi, Tingjian Zhang, Lunyiu Nie, Linmei Hu, Lei Hou*, Juanzi Li. How Proficient Are Large Language Models in Formal Languages? An In-Depth Insight for Knowledge Base Question Answering. (Findings of ACL 2024)Mengna Zhu, Kaisheng Zeng, JibingWu, Lihua Liu, Hongbin Huang, Lei Hou, Juanzi Li. LC4EE: LLMs as Good Corrector for Event Extraction. (Findings of ACL 2024)Yubin Chen, Jing Wan, Yexing Du, Jifan Yu, Lei Hou, Juanzi Li. Entity Set Expansion Based on Category Prompts in MOOCs. (KSEM 2024)Zhicheng Lee, Zhidian Huang, Zijun Yao, Jinxin Liu, Amy Xin, Lei Hou* and Juanzi Li. DiaKoP: Dialogue-based Knowledge-oriented Programming for Neural-symbolic Knowledge Base Question Answering. (CIKM 2024)Jiajie Zhang, Shulin Cao, Linmei Hu, Ling Feng, Lei Hou*, Juanzi Li. KB-Plugin: A Plug-and-play Framework for Large Language Models to Induce Programs over Low-resourced Knowledge Bases. (EMNLP 2024)Yunjia Qi, Hao Peng, Xiaozhi Wang, Bin Xu, Lei Hou, Juanzi Li. ADELIE: Aligning Large Language Models on Information Extraction. (EMNLP 2024)Kai Sun, Yushi Bai, Ji Qi, Lei Hou*, Juanzi Li. MM-MATH: Advancing Multimodal Math Evaluation with Process Evaluation and Fine-grained Classification. (Findings of EMNLP 2024)Yushi Bai, Xin Lv, Jiajie Zhang, Yuze He, Ji Qi, Lei Hou, Jie Tang, Yuxiao Dong, Juanzi Li. LongAlign: A Recipe for Long Context Alignment of Large Language Models. (Findings of EMNLP 2024)Minghui Liu, MeiHan Tong, Yangda Peng, Lei Hou, Juanzi Li, Bin Xu. DocEE-zh: A Fine-grained Benchmark for Chinese Document-level Event Extraction. (Findings of EMNLP 2024)Chunyang Li, Hao Peng, Xiaozhi Wang, Yunjia Qi, Lei Hou, Bin Xu, Juanzi Li. MAVEN-FACT: A Large-scale Event Factuality Detection Dataset. (Findings of EMNLP 2024)2023Jifan Yu, Mengying Lu, Qingyang Zhong, Zijun Yao, Shangqing Tu, Zhengshan Liao, Xiaoya Li, Manli Li, Lei Hou, Hai-Tao Zheng, Juanzi Li, and Jie Tang. MoocRadar: A Fine-grained and Multi-aspect Knowledge Repository for Improving Cognitive Student Modeling in MOOCs. (SIGIR 2023)Yushi Bai, Xin Lv, Juanzi Li, and Lei Hou. Answering complex logical queries on knowledge graphs via query computation tree optimization. (ICML 2023)Jiajie Zhang, Shulin Cao, Tingjia Zhang, Xin Lv, Jiaxin Shi, Qi Tian, Juanzi Li, and Lei Hou. Reasoning over Hierarchical Question Decomposition Tree for Explainable Question Answering. （ACL 2023）Mengying Lu, Yuquan Wang, Jifan Yu, Yexing Du, Lei Hou, and Juanzi Li. Distantly Supervised Course Concept Extraction in MOOCs with Academic Discipline. （ACL 2023）Peng Hao, Wang Xiaozhi, Yao Feng, Zeng Kaisheng, Hou Lei, Li Juanzi, Liu Zhiyuan, and Shen Weixing. The Devil is in the Details: On the Pitfalls of Event Extraction Evaluation. （ACL 2023 Findings）Yong Guan, Jiaoyan Chen, Freddy Lecue, Jeff Pan, Juanzi Li, and Ru Li. Trigger-Argument based Explanation for Event Detection. （ACL 2023 Findings）Fangwei Zhu, Jifan Yu, Hailong Jin, Juanzi Li, Lei Hou, and Zhifang Sui. Learn to Not Link: Exploring NIL Prediction in Entity Linking. （ACL 2023 Findings）Zijun Yao, Yantao Liu, Xin Lv, Shulin Cao, Jifan Yu, Lei Hou, and Juanzi Li. KoRC: Knowledge oriented Reading Comprehension Benchmark for Deep Text Understanding. （ACL 2023 Findings）Zijun Yao, Yuanyong Chen, Xin Lv, Shulin Cao, Amy Xin, Jifan Yu, Hailong Jin, Jianjun Xu, Peng Zhang, Lei Hou, and Juanzi Li. VisKoP: Visual Knowledge oriented Programming for Interactive Knowledge Base Question Answering. （ACL 2023 Demo Track: Best Paper Award）Lingxi Zhang, Jing Zhang, Yanling Wang, Shulin Cao, Xinmei Huang, Cuiping Li, Hong Chen, and Juanzi Li. FC-KBQA: A Fine-to-Coarse Composition Framework for Knowledge Base Question Answering. （ACL 2023）Yushi Bai, Jiahao Ying, Yixin Cao, Xin Lv, Yuze He, Xiaozhi Wang, Jifan Yu, Kaisheng Zeng, Yijia Xiao, Haozhe Lyu, Jiayin Zhang, Juanzi Li, Lei Hou. Benchmarking Foundation Models with Language-Model-as-an-Examiner. （NeurIPS 2023）Jing Zhang, Xiaokang Zhang, Daniel Zhang-Li, Jifan Yu, Zijun Yao, Zeyao Ma, Yiqi Xu, Haohua Wang, Xiaohan Zhang, Nianyi Lin, Sunrui Lu, Juanzi Li, and Jie Tang. GLM-Dialog: Noise-tolerant Pre-training for Knowledge-grounded Dialogue Generation. （KDD 2023）Lunyiu Nie, Jiuding Sun, Yanlin Wang, Lun Du, Shi Han, Dongmei Zhang, Lei Hou, Juanzi Li, and Jidong Zhai. Unveiling the Black Box of PLMs with Semantic Anchors: Towards Interpretable Neural Semantic Parsing. （AAAI 2023）Ning Ding, Yujia Qin, Guang Yang, Fuchao Wei, Zonghan Yang, Yusheng Su, Shengding Hu, Yulin Chen, Chi-Min Chan, Weize Chen, Jing Yi, Weilin Zhao, Xiaozhi Wang, Zhiyuan Liu, Hai-Tao Zheng, Jianfei Chen, Yang Liu, Jie Tang, Juanzi Li, and Maosong Sun. Parameter-efficient fine-tuning of large-scale pre-trained language models. （Nature Machine Intelligence  2023）Shangqing Tu, Zheyuan Zhang, Jifan Yu, Chunyang Li, Siyu Zhang, Zijun Yao, Lei Hou, and Juanzi Li. LittleMu: Deploying an Online Virtual Teaching Assistant via Heterogeneous Sources Integration and Chain of Teach Prompts. (CIKM 2023)Ji Qi, Jifan Yu, Teng Tu, Kunyu Gao, Yifan Xu, Xinyu Guan, Xiaozhi Wang, Bin Xu, Lei Hou, Juanzi Li, and Jie Tang. GOAL: A Challenging Knowledge-grounded Video Captioning Benchmark for Real-time Soccer Commentary Generation. (CIKM 2023)Yakun Li, Lei Hou, and Juanzi Li. Preference-aware Graph Attention Networks for Cross-Domain Recommendations with Collaborative Knowledge Graph. （TOIS 2023）Yakun Li, Lei Hou, Dongmei Li, and Juanzi Li. HKGCL: Hierarchical graph contrastive learning for multi-domain recommendation over knowledge graph. （ESWA 2023）Hongyin Zhu, Hao Peng, Zhiheng L",
  "content_length": 48127,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:49"
}