{
  "name": "Juan Ramón Rabuñal",
  "homepage": "https://pdi.udc.es/en/File/Pdi/9299E",
  "status": "success",
  "content": "Juan Ramón Rabuñal Dopico File. Department Computer Science and Information Technologies Knowledgment area Computational Science and Artificial Intelligence Research Research group Redes de Neuronas Artificiales y Sistemas Adaptativos - Imagen Médica y Diagnóstico Radiológico Research lines Computación Evolutiva e Inteligencia Artificial en Ingeniería Civil. Aplicación de técnicas de Inteligencia Artificial (Redes de Neuronas Artificiales, Computación Evolutiva y Visión Artificial) en diferentes áreas de la Ingeniería Civil Keywords Inteligencia Artificial. Redes de Neuronas Artificiales. Computación Evolutiva. Algoritmos Genéticos. Programación Genética. Visión Artificial. Ingeniería Civil. Construcción. Hidráulica. Hidrología. Ingeniería Sanitaria. Puertos y Costas. Teaching merits evaluation 4 five years period(s) Research merits evaluation 5 six years period(s) Contacto UDC directory Orcid id0000-0002-1253-4419 ResearcherIDC-2588-2016 Scopus6603042738 Subjects taught This section shows the teaching given in degrees, masters and other officers studies in last 6 years. 2025/2026 2024/2025 2023/2024 2022/2023 2021/2022 2020/2021 Subject and involved studies Type Distance hours Total hours Application Techniques in Biotechnology Master's in Advanced Biotechnology Compulsory 0 8 Evolutionary Computation Master's Degree in Artificial Intelligence Optional 0 5.25 Final Year Dissertation Degree in Data Science and Engineering Compulsory 0 8 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 30 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 9 Machine Learning I Degree in Data Science and Engineering Compulsory 0 10 Nanotechnology in Instrumentation and Robotics Degree in Nanoscience and Nanotechnology Optional 0 8 Programming I Degree in Computer Engineering Programa de Simultaneidad del Grado en Ingeniería Informática y Grado en Ciencia e Ingeniería de Datos Core 0 15 Programming I Degree in Artificial Intelligence Core 0 30 Subject and involved studies Type Distance hours Total hours Application Techniques in Biotechnology Master's in Advanced Biotechnology Compulsory 0 8 Evolutionary Computation Master's Degree in Artificial Intelligence Optional 0 5.2 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 30 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 7 Machine Learning I Degree in Data Science and Engineering Compulsory 0 13 Nanotechnology in Instrumentation and Robotics Degree in Nanoscience and Nanotechnology Optional 0 8 Programming I Degree in Computer Engineering Core 0 15 Programming I Degree in Artificial Intelligence Core 0 30 Subject and involved studies Type Distance hours Total hours Application Techniques in Biotechnology Master's in Advanced Biotechnology Compulsory 0 8 Evolutionary Computation Master's Degree in Artificial Intelligence Optional 0 5.25 Experimental Hydraulics I Master's in Water Engineering Optional 0 15 Final Year Dissertation. Mention in Software Engineering Degree in Computer Engineering Compulsory 0 4 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 18 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 7 Machine Learning I Degree in Data Science and Engineering Compulsory 0 10 Nanotechnology in Instrumentation and Robotics Degree in Nanoscience and Nanotechnology Optional 0 8 Programming I Degree in Computer Engineering Core 0 15 Programming I Degree in Artificial Intelligence Core 0 30 Subject and involved studies Type Distance hours Total hours Application Techniques in Biotechnology Master's in Advanced Biotechnology Compulsory 0 8 Evolutionary Computation Master's Degree in Artificial Intelligence Optional 0 5 Experimental Hydraulics I Master's in Water Engineering Optional 0 15 Final Year Dissertation. Mention in Computer Science Degree in Computer Engineering Compulsory 0 4 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 18 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 7 Machine Learning I Degree in Data Science and Engineering Compulsory 0 10 Programming I Degree in Computer Engineering Core 0 15 Programming I Degree in Artificial Intelligence Core 0 30 Ubiquitous Security Master in Cibersecurity Optional 0 2 Subject and involved studies Type Distance hours Total hours Application Techniques in Biotechnology Master's in Advanced Biotechnology Compulsory 0 8 Experimental Hydraulics I Master's in Water Engineering Optional 0 15 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 8 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 12 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Master's in Computer Engineering Compulsory 0 7 Machine Learning I Degree in Data Science and Engineering Compulsory 0 10 Programming I Degree in Computer Engineering Core 0 15 Ubiquitous Security Master in Cibersecurity Optional 0 2 Subject and involved studies Type Distance hours Total hours Application Techniques in Biotechnology Master's in Advanced Biotechnology Compulsory 0 8 Experimental Hydraulics I Master's in Water Engineering Optional 0 30 Final Year Dissertation. Mention in Information Technology Degree in Computer Engineering Compulsory 0 4 Fundamentals of Programming I Degree in Data Science and Engineering Core 0 12 Intelligent Systems Degree in Computer Engineering Master's in Computer Engineering Compulsory 0 6 Machine Learning I Degree in Data Science and Engineering Compulsory 0 10 Programming I Degree in Computer Engineering Core 0 15 Ubiquitous Security Master in Cibersecurity Optional 0 2 Tutoring 2025/2026 Defined tutoring by teacher for 2025/2026 academic course. Faculty of Computer Science Quarter Day Site 1st quarter Wednesday 16:30 a 21:00 3.03 2nd quarter Wednesday 16:00 a 21:00 3.03 EOG works and final master thesis directed Directed or codirected by current teacher since 2013 year. 2023/2024 2022/2023 2020/2021 2019/2020 2018/2019 2016/2017 2014/2015 2013/2014 Predicting inflow and outflow in hydraulic dams using different artificial intelligence algorithms Aplication of artificial vision in the streaming and recordings made by Drones Integrated management tool for a water supply system using artificial intelligence techniques (case study using the water supply system of A Coruña) Cryptographic system for ubiquitous security ArduIMU: Low power IMU based on Arduino Fish detection software in real time Computer System for Object Detection in Point Clouds using artificial vision techniques Computer System for Object Detection in Point Clouds using artificial vision techniques Design and implementation of an HPC solution for Stereo Matching Energy management of water consumption in a residential area and intelligent monitoring of the energy conservation Backups and firmware updates application for ADSL IP based telecommunication services Document management web application Google Scholar at its peak. Are there disciplines still out of reach? Coverage study of architecture. Methodology design of company archives: integral management and value enhancement Select merit type and year to query research merits. Projects, contracts and I+D+I agreements Patents, records and utility models Papers in research journals Complete books Book chapters PhD theses directed Conference papers 2025 2024 2023 2022 2021 ... 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 2000 1999 1998 Funding entity M3M Global, S.L. Main researches Julián Alfonso Dorado De La Calle Type Contrato Dates From 02/04/2025 to 31/07/2025 Funding entity Ministerio de Ciencia, Innovación y Universidades Main researches Enrique Peña González (IP1) / Juan Ramón Rabuñal Dopico (IP2) Type Proyecto Programas Nacionales Dates From 01/09/2024 to 31/08/2027 Funding entity Consellería de Cultura, Educación, Formación Profesional e Universidades - Xunta de Galicia Type Proyecto Programas Autonomicos Dates From 30/04/2024 to 31/12/2027 Funding entity APLICACIONES Y RESOLUCIONES AVANZADAS EN ELECTRÓNICA S.L Main researches Marcos Gestal y Julián Alfonso Dorado De La Calle Type Contrato Dates From 01/12/2023 to 30/09/2024 Funding entity APLICACIONES Y RESOLUCIONES AVANZADAS EN ELECTRÓNICA S.L Main researches Marcos Gestal y Julián Alfonso Dorado De La Calle Type Contrato Dates From 21/12/2023 to 30/09/2024 Funding entity M3M Global S.L. Main researches Julián Dorado de la Calle Type Contrato Dates From 10/01/2022 to 31/07/2022 Funding entity Consellería de Educación Main researches Alejandro Pazos Sierra Type Proyecto Programas Autonomicos Dates From 01/01/2022 to 20/11/2025 Funding entity AMSLAB+TORUS+SKS Main researches Alejandro Pazos / Marcos Gestal / Juan Ramón Rabuñal Type Contrato Dates From 15/12/2022 to 15/02/2023 Funding entity CONSELLERÍA DO MAR - XUNTA DE GALICIA Main researches Javier Cremades Ugarte / Juan Rabuñal Dopico Type Proyecto UE Dates From 01/01/2022 to 31/12/2025 Funding entity Ministerio de Ciencia e Innovación Main researches Peña González, Enrique- Rabuñal Dopico, Juan Ramón Type Proyecto Programas Nacionales Dates From 01/09/2021 to 31/08/2024 Funding entity PROGRAMA HORIZONTE 2020 de la Unión Europea (convocatoria H2020-MSCA-NIGHT-2020bis) Main researches Mª Cristina Naya Riveiro Type Proyecto UE Dates From 01/05/2021 to 30/11/2021 Funding entity Consellería de Medio Ambiente, Territorio e Vivenda (Xunta de Galicia), UDC, USC, UVigo e FUAC Main researches Juan Ramón Rabuñal Dopico Type Contrato Dates From 14/12/2021 to 31/12/2022 Funding entity ASIMOV EFFICIENCY, S.L Main researches Marcos Gestal & Julián Dorado Type Contrato Dates From 16/11/2020 to 31/12/2021 Funding entity Axencia Galega de Innovación Main researches Modesto Pillado Type Pr",
  "content_length": 88170,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:52"
}