{
  "name": "Judith Sheard",
  "homepage": "https://research.monash.edu/en/persons/judithe-sheard",
  "status": "success",
  "content": "Judithe Sheard - Monash University Judithe Sheard public CV View Scopus Profile Judithe Sheard Professor Professor, Department of Human Centred Computing https://orcid.org/0000-0002-4179-8149 EmailJudy.Sheardmonashedu 1997 …2025 Research activity per year Personal profile BiographyProfessor Judithe (Judy) Sheard has an academic career spanning more than 35 years.  She is a former Head of the Caulfield School of Information Technology. A passionate educator, Judy researches in computing education particularly the areas of educational technology, student learning behaviour, and assessment.  She has published extensively, receiving a number of awards, including recently a ‘Best in 25 Years’ award at the Innovation and Technology in Computer Science Education conference. An active member of the international computing education research community, Judy has served as Vice Chair and Secretary of the ACM Special Interest Group on Computer Science Education (SIGCSE) and is a former chair of the Australasian Chapter of ACM SIGCSE. Judy has chaired a number of conferences and is currently chair of the 2021 ACM SIGCSE Technical Symposium on Computer Science Education. In 2017 Judy was named an ACM Distinguished Member for educational contributions to computing. Judy established the Monash Museum of Computing History at Monash University in 2001 and has directed activities for the Museum since this time. The Museum presents a chronology of computing from the early 1950’s to the present. Monash teaching commitmentAssociate Professor Judy Sheard has experience as the Chief Examiner for the following units in the Faculty of IT: FIT3063/FIT4063 Human-computer interaction FIT5151 Object-oriented business application development FIT5152 User interface design and usability FIT9017 Foundations of programming FIT9131/FIT5131 Programming foundations Research area keywordsAcademic IntegrityLearning AnalyticsEducational TechnologyHistory of ComputingTeaching and Learning of Computer ProgrammingComputing EducationComputing Education Research Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2009 2009 2011 2012 2014 2018 2021 2022 2026 1 Active 10 Finished Projects per year Data analytics-based tools and methods to enhance self-regulated learningGasevic, D. (Primary Chief Investigator (PCI)), Dawson, S. (Chief Investigator (CI)), Sheard, J. (Chief Investigator (CI)), Mirriahi, N. (Chief Investigator (CI)), Martinez-Maldonado, R. (Chief Investigator (CI)), Khosravi, H. (Chief Investigator (CI)), Chen, G. (Chief Investigator (CI)) & Winne, P. H. (Partner Investigator (PI))1/08/22 → 31/03/26Project: Research Technical and Educational Guidelines for Personalising Assessments through Assessment-as-Learning in CybersecuritySakzad, A. (Primary Chief Investigator (PCI)), Sheard, J. (Chief Investigator (CI)), Billing, W. (Chief Investigator (CI)), Paul, D. J. (Chief Investigator (CI)), Brankovic, L. (Chief Investigator (CI)), Li, N. (Chief Investigator (CI)), Simon (Chief Investigator (CI)) & Skerritt, M. (Chief Investigator (CI))1/05/22 → 30/06/23Project: Research Academic Integrity Policies, Procedures, and Good Practices for Online Assessment in Computing Education’ projectJha, M. (Primary Chief Investigator (PCI)), Leemans, S. (Chief Investigator (CI)), Berretta, R. (Chief Investigator (CI)), Bilgin, A. (Chief Investigator (CI)), Myers, T. (Chief Investigator (CI)), Sheard, J. (Chief Investigator (CI)) & Simon, S. (Chief Investigator (CI))1/02/21 → 31/12/21Project: Research ALTA SES: Addressing Student Engagement Issues for Female and International Female Students in Computing Studies Courses.Sheard, J. (Primary Chief Investigator (PCI)), Gonsalvez, C. (Chief Investigator (CI)), Butler, M. (Chief Investigator (CI)) & Simon, .. (Chief Investigator (CI))10/10/18 → 31/01/20Project: Research WIL for ICT: Education for employability: WIL approaches to preparing ICT students for the workforceGonsalvez, C. (Primary Chief Investigator (PCI)), Morgan, M. (Chief Investigator (CI)), Sheard, J. (Chief Investigator (CI)) & Grundy, J. (Chief Investigator (CI))10/10/18 → 30/06/19Project: Research View all 11 projects Research output Research output per year 1997 2001 2003 2005 2008 2010 2012 2013 2014 2015 2016 2018 2025 128 Conference Paper 32 Article 9 Chapter (Book) 7 Foreword / Postscript 10 More 3 Commissioned Report 3 Editorial 2 Other 1 Abstract 1 Short Review Research output per year Research output per year Models of Mastery Learning for Computing EducationSzabo, C., Parker, M. C., Friend, M., Jeuring, J., Kohn, T., Malmi, L. & Sheard, J., 2025, Proceedings of the 56th ACM Technical Symposium on Computer Science Education. Jiao, S. & O’Connor, T. (eds.). New York NY USA: Association for Computing Machinery (ACM), p. 1092-1098 7 p. (SIGCSE TS 2025 - Proceedings of the 56th ACM Technical Symposium on Computer Science Education; vol. 1).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 2 Citations (Scopus) ALAN: Assessment-as-Learning Authentic Tasks for NetworkingMinagar, S., Sakzad, A., Tack, G., Rudolph, C. & Sheard, J., 2024, Proceedings of the 55th ACM Technical Symposium on Computer Science Education. Battestilli, L., A. Rebelsky, S. & Shoop, L. (eds.). New York NY USA: Association for Computing Machinery (ACM), Vol. 1. p. 853-859 7 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 1 Citation (Scopus) Diverging assessments: What, why, and experiencesSakzad, A., Paul, D., Sheard, J., Brankovic, L., Skerritt, M. P., Li, N., Minagar, S., Simon & Billingsley, W., 2024, Proceedings of the 55th ACM Technical Symposium on Computer Science Education. Battestilli, L., A. Rebelsky, S. & Shoop, L. (eds.). New York NY USA: Association for Computing Machinery (ACM), Vol. 1. p. 1161-1167 7 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open Access 2 Citations (Scopus) Instructor perceptions of AI code generation tools - a multi-institutional interview studySheard, J., Denny, P., Hellas, A., Leinonen, J., Malmi, L. & Simon, 2024, Proceedings of the 55th ACM Technical Symposium on Computer Science Education. Battestilli, L., A. Rebelsky, S. & Shoop, L. (eds.). New York NY USA: Association for Computing Machinery (ACM), Vol. 1. p. 1223-1229 7 p.Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 31 Citations (Scopus) Computing education research in AustralasiaSimon, Sheard, J., Luxton-Reilly, A. & Szabo, C., 2023, Past, Present and Future of Computing Education Research: A Global Perspective. Apiola, M., López-Pernas, S. & Saqr, M. (eds.). Cham Switzerland: Springer, p. 373-394 22 p.Research output: Chapter in Book/Report/Conference proceeding › Chapter (Book) › Research 1 Citation (Scopus) View all 186 research outputs Activities Activities per year 2010 2010 2011 2016 2017 6 Membership of an advisory panel/policy group/ board 3 Professional association or peak discipline body 2 External research and teaching 1 External research organisation, centre or institute 2 More 1 Grant review responsibilities 1 Submissions to industry or govt committees, commissions and inquiries Activities per year ACM - Association for Computing Machinery (External organisation)Sheard, J. (Member)1 Nov 2017Activity: Industry, Government and Philanthropy Engagement and Partnerships › Membership of an advisory panel/policy group/ board Australian Computer Society Incorporated (External organisation)Sheard, J. (Member)1 Jan 2016Activity: Industry, Government and Philanthropy Engagement and Partnerships › Membership of an advisory panel/policy group/ board Head of School Caulfield - Faculty of Information Technology, Monash UniversitySheard, J. (Chair/ Co-Chair)1 Jan 2016Activity: External Academic Engagement › Professional association or peak discipline body Chair - Graduate Programs Committee - Faculty of Information Technology, Monash UniversitySheard, J. (Chair/ Co-Chair)1 Jan 2016 → …Activity: External Academic Engagement › Professional association or peak discipline body Monash University (External organisation)Sheard, J. (Member)1 Jan 2016Activity: Industry, Government and Philanthropy Engagement and Partnerships › Membership of an advisory panel/policy group/ board View all 14 activities",
  "content_length": 8788,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:53"
}