{
  "name": "Judith Simon",
  "homepage": "https://www.inf.uni-hamburg.de/en/inst/ab/eit/team/simon.html",
  "status": "success",
  "content": "Prof. Dr. Judith Simon : Ethics in IT : University of Hamburg Zur MetanavigationZur HauptnavigationZur SucheZum InhaltZur SubnavigationZum SeitenfußPhoto: UHH/DenstorfEthics in ITProf. Dr. Judith SimonPhoto: Christian Thiel/Deutscher EthikratProfessor for Ethics in Information TechnologyAddressUniversity of HamburgVogt-Kölln-Straße 3022527 HamburgOfficeRoom: G-120ContactTel: +49 40 428 83-2020Email: judith.simon\"AT\"uni-hamburg.deFor interview and talk requests please contact our EIT Office(eit-office.inf\"AT\"uni-hamburg.de).Judith Simon is Full Professor for Ethics in Information Technologies at the Universität Hamburg. She is interested in ethical, epistemological and political questions arising in the context of digital technologies, in particular in regards to artificial intelligence. Judith Simon is Vice-Chair of the German Ethics Council, where she also was the spokesperson for the  opinion on \"Humans and Machines – Challenges of Artificial Intelligence\". She has been serving on various other committees of scientific policy advice such as the Data Ethics Commission of the German Federal Government (2018-2019). She is the editor of the Routledge Handbook of Trust and Philosophy (2020) and serves on the editorial and advisory boards of the journals “Philosophy and Technology”, \"Big Data & Society\" and \"Digital Society”. Find here Judith Simon's short biography in German language, and below an extended English version.Research Area Computer Ethics & Philosophy of Computing Critical Big Data Studies Philosophy of Technology & Philosophy of Science Socio-Technical Epistemology Science and Technology Studies & Technology Assessment Values in Design & Responsible Research and Innovation CVSince February 2017 Judith Simon holds the chair for Ethics in Information Technologies at the University of Hamburg. Furthermore, since 2018 she is member of the German Ethics Council, the the Commission on Data Ethics of the Federal Government of Germany, and the Joint Committee of Leopoldina and Deutsche Forschungsgemeinschaft (DFG) on the Handling of Security-Relevant Research. Before joining the University of Hamburg, Judith Simon was associate professor for philosophy of science and technology at the IT University Copenhagen as well as principal investigator of the project “Epistemic Trust in Socio-Technical Epistemic Systems” (FWF-P23770) at the University of Vienna. She holds a MA in psychology from the Free University Berlin and a PhD in philosophy from the University of Vienna. After completing her Master in 2002 she has worked as a freelance worker in usability testing of software applications. From 2003 to 2005 she has been research assistant in the research group on “Bioethics and Science Communication” (cooperation of RC Juelich & MDC Berlin). From 2005 to 2009 she has been research assistant in the research group “Philosophy of Science: Cultures and Technologies of Knowledge” at the University of Vienna. From 2009 to 2011 she has been post-doctoral fellow at the Institute Jean Nicod (Ecole Normale Supérieure) in Paris, analyzing changes in research and scientific publishing due to Web2.0 technologies (EU FET-Open project LiquidPublications). From 2011 till 2014 she was employed as senior researcher at the Karlsruhe Institute of Technology, Institute for Technology Assessment and Systems Analysis focusing on technology assessment of ICT. She was a visiting scholar at Stanford University and has been a guest researcher at the Department of Information Engineering and Computer Science at University of Trento as well as the Artificial Intelligence Research Institute (CSIC-IIIA) in Barcelona. In 2013 Judith Simon received the Herbert A. Simon Award of the International Association of Computing and Philosophy (IACAP) for outstanding research in philosophy & computing.TeachingSoSe 2264-207 Vorlesung Philosophie, Gesellschaft und IT, Di, 5. Apr. 2022 - Di, 5. Jul. 202264-208 Seminar Philosophie - Gesellschaft und IT, Di, 5. Apr. 2022 - Di, 5. Jul. 2022 64-690 Ringvorlesung Taming the Machines – Data Practices and Design Culture, Mi, 6. Apr. 2022 - Mi, 15. Jun. 2022 64-639 Seminar zur Ringvorlesung Taming the Machines, Di, 5. Apr. 2022 - Mi, 15. Jun. 2022 24-900.20 Ringvorlesung Datenwelten II: Reflexion der Datenwelten [digital] , Mo, 4. Apr. 2022 - Mo, 11. Jul. 2022 WS 21/2264-030 Vorlesung Informatik im Kontext, Mo, 11. Okt. 2021 - Mo, 27. Jan. 202164-456 Vorlesung Informatik: Zwischen Wissenschaft und Technikgestaltung, Di, 19. Okt. 2021 - Die, 25. Jan. 202264-457 Seminar Informatik: Zwischen Wissenschaft und Technikgestaltung, Di, 19. Okt. 2021 - Die, 25. Jan. 202264-639 Seminar zur Ringvorlesung Taming the Machines, Mi, 13. Okt. 2021 - Mi, 19. Jan. 202264-690 Ringvorlesung Taming the Machines, Mi, 13. Okt. 2021 - Mi, 19. Jan. 2022 SoSe 2164-207 Vorlesung Philosophie, Gesellschaft und IT, Di, 6. Apr. 2021 - Di, 6. Jul. 2021 64-208 Seminar Philosophie - Gesellschaft und IT, Di, 6. Apr. 2021 - Di, 6. Jul. 2021   64-690 Ringvorlesung Taming the Machines: Ethics, Law & IT – From Theory to Practice, Mi, 7. Apr. 2021 - Mi, 7. Jul. 2021  64-639 Seminar zur Ringvorlesung Taming the Machines, Mi, 7. Apr. 2021 - Mi, 7. Jul. 2021   WS  20/2164-030  Vorlesung Informatik im Kontext, Mo, 2. Nov. 2020 - Do, 18. Feb. 202164-456  Vorlesung Informatik: Zwischen Wissenschaft und Technikgestaltung,  Di, 3. Nov. 2020 - Die, 16. Feb. 202164-457  Seminar Informatik: Zwischen Wissenschaft und Technikgestaltung,  Di, 3. Nov. 2020 - Die, 16. Feb. 202164-639  Seminar zur Ringvorlesung Taming the Machines,  Do, 5. Nov. 2020 - Do, 18. Feb. 202164-690  Ringvorlesung Taming the Machines,  Do, 5. Nov. 2020 - Do, 18. Feb. 2021 SoSe 20 64-207 Vorlesung Philosophie, Gesellschaft und IT, Di, 21. Apr. 2020 - Di, 14. Jul. 2020 64-208 Seminar Philosophie - Gesellschaft und IT, Di, 21. Apr. 2020 - Di, 14. Jul. 2020 22-40.120  Interdisciplinary Seminar in Politics and Philosophy: Ethics, Politics and Epistemology of Big Data, Mi, 15. Apr. 2020 - Mi, 1. Jul. 2020 cancelled due to Coronavirus pandemic: 64-690 Ringvorlesung Taming the Machines - The Governance and Regulatory Challenges 64-639 Seminar zur Ringvorlesung Taming the Machines WS 19/20 64-030  Vorlesung Informatik im Kontext, Mo, 14. Okt. 2019 - Do, 30. Jan. 2020 64-456  Vorlesung Informatik: Zwischen Wissenschaft und Technikgestaltung,  Mo, 14. Okt. 2019 - Mo, 27. Jan. 2020 64-457  Seminar Informatik: Zwischen Wissenschaft und Technikgestaltung,  Mo, 14. Okt. 2019 - Mo, 27. Jan. 2020 64-639  Seminar zur Ringvorlesung Taming the Machines,  Di, 15. Okt. 2019 - Di, 21. Jan. 2020 64-643  Advanced Topics in Ethics and IT,  Mo, 14. Okt. 2019 - Mo, 27. Jan. 2020 64-653  Glauben, Wetten, Vorhersagen: Zur Philosophie und Geschichte der Wahrscheinlichkeitstheorie,  Di, 15. Okt. 2019 - Di, 28. Jan. 2020 64-690  Ringvorlesung Taming the Machines,  Do, 17. Okt. 2019 - Do, 16. Jan. 2020 SoSe 19 64-639 Seminar zur Ringvorlesung Ethics in IT, Mi, 3. Apr. 2019 - Mi, 3. Jul. 2019 64-640 Vorlesung Philosophie, Gesellschaft und IT, Mo, 8. Apr. 2019 - Mo, 8. Jul. 2019 64-641 Seminar Philosophie - Gesellschaft und IT, Mo, 8. Apr. 2019 - Mo, 8. Jul. 2019 64-648 Seminar Big Data: Erkenntnistheorie, Ethik und Politik, Di, 2. Apr. 2019 - Di, 9. Jul. 2019 64-690 Ringvorlesung Taming the Machines - Securing Knowledge WS 18/19 55-01.191.500 Forschungskolloquium: Normative Theory Group (P), Do, 1. Nov. 2018 - Di, 29. Jan. 2019 64-031 Vorlesung IKON: Informatiksysteme in Organisationen, Mo, 3. Dez. 2018 - Do, 31. Jan. 2019 64-456 Vorlesung Informatik: Zwischen Wissenschaft und Technikgestaltung, Mo, 15. Okt. 2018 - Mo, 28. Jan. 2019 64-457 Informatik: Zwischen Wissenschaft und Technikgestaltung-Seminar, Mo, 15. Okt. 2018 - Mo, 28. Jan. 2019 64-639 Seminar zur Ringvorlesung Taming the Machines, Di, 30. Okt. 2018 - Di, 29. Jan. 2019 64-690 Ringvorlesung Taming the Machines , Mi, 14. Nov. 2018 - Mi, 23. Jan. 2019 SoSe 18 10-05-504 Forschungskolloquium Normative Theory, Do, 5. Apr. 2018 - Do, 12. Jul. 2018 64-482 Oberseminar Philosophie, Gesellschaft und IT, Do, 5. Apr. 2018 - Do, 12. Jul. 2018 64-640 Vorlesung Philosophie, Gesellschaft und IT, Fr, 6. Apr. 2018 - Fr, 13. Jul. 2018 WS 17/18 10-05-504/55-01.181.62 Forschungskolloquium Normative Theory, Di, 24. Okt. 2017 - Di, 6. Feb. 2018 22-40.110 Interdisciplinary Seminar: Ethics, Politics and Epistemology of Big Data, Di, 17. Okt. 2017 - Di, 23. Jan. 2018 64-031 Vorlesung IKON: Informatiksysteme in Organisationen, Do, 19. Okt. 2017 - Do, 1. Feb. 2018 64-489 Oberseminar Ethik in der Informationstechnologie Selected PublicationsJacobs, M. & Simon, J. (2022). Reexamining computer ethics in light of AI systems and AI regulation. AI and Ethics. https://doi.org/10.1007/s43681-022-00229-6 Kraft, A., Zorn, H.-P., Fecht, P., Simon, J., Biemann, Ch. & Usbeck, R. (2022). Measuring Gender Bias in German Language Generation. In: Demmler, D., Krupka, D. & Federrath, H. (eds.), INFORMATIK 2022.Gesellschaft für Informatik, Bonn. (pp. 1257-1274). DOI: 10.18420/inf2022_108 Jacobs, M. & Simon, J. (2022). Assigning Obligations in AI Regulation: A Discussion of Two Frameworks Proposed By the European Commission. Digital Society, 1(1). https://doi.org/10.1007/s44206-022-00009-z Asghari, H.; Birner, N.; Burchardt, A.; Dicks, D.; Faßbender, J.; Feldhus, N.; Hewett, F.; Hofmann, V.; Kettemann, Matthias C.; Schulz, W.; Simon, Judith; Stolberg-Larsen, J.; and Züger, T. (2021). What to explain when explaining is difficult? An interdisciplinary primer on XAI and meaningful information in automated decision-making. Alexander von Humboldt Institute for Internet and Society. https://doi.org/10.5281/zenodo.6375784. Jacobs, M., Kurtz, C., Simon, J. and Böhmann, T. (2021). Value Sensitive Design and power in socio-technical ecosystems. Internet Policy Review, 10(3). https://doi.org/10.14763/2021.3.1580 Simon, J. and Rieder, G. (2021). Trusting the Corona-Warn-App? Contemplations on trust and trustworthiness at the i",
  "content_length": 17447,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:54"
}