{
  "name": "Juergen Beyerer",
  "homepage": "https://ies.iar.kit.edu/1473_1497.php",
  "status": "success",
  "content": "KIT - IES - Mitarbeiter Lehrstuhl für Interaktive Echtzeitsysteme StartseiteMitarbeiter Willkommen am Institut für Anthropomatik – Lehrstuhl für Interaktive EchtzeitsystemeUnser ProfilMitarbeiterForschungVeröffentlichungenStudium und LehreStudentenarbeitStellenangeboteKontakt / AnfahrtMitarbeiter Prof. Dr.-Ing. Jürgen Beyerer Sprechstunden: nach Vereinbarung; bitte Sekretariat des Lehrstuhls kontaktierenTel.: +49 721 608-45911Fax: +49 721 608-45926juergen beyerer ∂does-not-exist.iosb fraunhofer de Karlsruher Institut für Technologie – KIT Institut für Anthropomatik und Robotik (IAR) Lehrstuhl für Interaktive Echtzeitsysteme (IES) Prof. Dr.- Ing. Jürgen Beyerer Vincenz-Prießnitz-Straße 3 76131 Karlsruhe LebenslaufProf. Dr.-Ing. Jürgen Beyerer ist Inhaber des 2004 eingerichteten Lehrstuhls für Interaktive Echtzeitsysteme an der Fakultät für Informatik. Gleichzeitig ist er Leiter des Fraunhofer-Instituts für Optronik, Systemtechnik und Bildauswertung (IOSB)  in Karlsruhe (bis 2009: Fraunhofer IITB). Prof. Beyerer studierte von 1984 bis 1989 Elektrotechnik an der Universität Karlsruhe und promovierte 1994 am Institut für Mess- und Regelungstechnik (MRT)  bei Prof. Franz Mesch mit einer Arbeit zur Texturanalyse, die 1995 mit dem Messtechnikpreis des AHMT (Arbeitskreis der Hochschullehrer für Messtechnik e.V.)  ausgezeichnet wurde. Anschließend baute er eine Forschungsgruppe zum Thema Automatische Sichtprüfung und Bildverarbeitung am gleichen Institut auf. 1999 habilitierte er sich für das Fach Messtechnik mit einer Arbeit zum Thema der Nutzung von Vorwissen in der Messtechnik. Von 1999 bis 2004 leitete er das Mannheimer Mittelstands-Unternehmen Hottinger Systems GmbH (heute: inspectomation GmbH ) und war stellvertretender Geschäftsführer des Schwesterunternehmens Hottinger Maschinenbau GmbH. Lehrstuhl und Fraunhofer IOSB arbeiten inhaltlich eng zusammen. Damit lassen sich Synergieeffekte, die in der eher grundlagenorientierten Herangehensweise am Lehrstuhl und der anwendungsorientierten Ausrichtung des IOSB liegen, optimal erschließen. Daneben fördert eine enge Kooperation die Gewinnung erstklassiger Nachwuchswissenschaftler für das Fraunhofer IOSB. Vorlesungen Automatische Sichtprüfung und Bildverarbeitung Mustererkennung Veröffentlichungen 2025 Physically-Based Simulation of Automotive LiDARDudzik, L.; Roschani, M.; Sielemann, A.; Trampert, K.; Ziehn, J.; Beyerer, J.; Neumann, C.2025. 2025 IEEE International Automated Vehicle Validation Conference (IAVVC), Baden-Baden, Germany, 30 September 2025 - 02 October 2025, 1–8, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/IAVVC61942.2025.11219516 Causal Temporal Neural Networks Using the Conditional Average Treatment EffectYoussef, S.; Pfrommer, J.; Beyerer, J.2025. 2025 IEEE Conference on Artificial Intelligence (CAI), 49 – 54, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/CAI64502.2025.00015 UPPET: Unified Pedestrian Pose Estimation in Thermal ImagingCormier, M.; Specker, A.; Beyerer, J.2025. 2025 IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops (CVPRW), Nashville, TN, USA, 11-12 June 2025, 4551–4560, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/CVPRW67362.2025.00440 Traversing the subspace of adversarial patchesBayer, J.; Becker, S.; Münch, D.; Arens, M.; Beyerer, J.2025. Machine Vision and Applications, 36 (3), 70. doi:10.1007/s00138-025-01689-6 Simultaneous measurement of surface geometry and film thickness distribution by retroreflex ellipsometryChen, C.-W.; Hartrumpf, M.; Längle, T.; Beyerer, J.2025. Measurement: Sensors, 38, 101663. doi:10.1016/j.measen.2024.101663 Data-Driven Decision-Making: Leveraging Digital Twins for Reprocessing in the Circular FactoryAfifi, N.; Mas, V.; Hemmerich, J.; Leitenberger, F.; Hoffmann, L.; Darijani, A.; Grauberger, P.; Heizmann, M.; Beyerer, J.; Matthiesen, S.2025. Zeitschrift für wirtschaftlichen Fabrikbetrieb, 120 (s1), 170–176. doi:10.1515/zwf-2024-0160 Towards Graph-based Self-learning of Industrial Process Behaviour for Anomaly DetectionMeshram, A.; Karch, M.; Haas, C.; Beyerer, J.2025. Procedia Computer Science, 270, 3913–3923. doi:10.1016/j.procs.2025.09.516 HybridFormer: Bridging Local and Global Spatio-Temporal Dynamics for Efficient Skeleton-Based Action RecognitionZhong, Z.; Li, T.; Martin, M.; Cormier, M.; Wu, C.; Diederichs, F.; Beyerer, J.2025. Computer Vision – ECCV 2024 Workshops – Milan, Italy, September 29–October 4, 2024, Proceedings, Part XIII. Ed.: A. Del Bue, 19 – 35, Springer Nature Switzerland. doi:10.1007/978-3-031-91575-8_2 Leveraging Thermal Imaging for Robust Human Pose Estimation in Low-Light VisionCormier, M.; Yi, C. N. Z.; Specker, A.; Blaß, B.; Heizmann, M.; Beyerer, J.2025. Computer Vision – ACCV 2024 Workshops – 17th Asian Conference on Computer Vision, Hanoi, Vietnam, December 8–12, 2024, Revised Selected Papers, Part I. Ed.: M. Cho, 69–86, Springer Nature Singapore. doi:10.1007/978-981-96-2641-0_5 Supervised Domain Adaptation with Disjoint Label Spaces for Fine-Grained ClassificationKrohmer, E.; Wolf, S.; Beyerer, J.2025. Computer Vision – ACCV 2024 Workshops – 17th Asian Conference on Computer Vision, Hanoi, Vietnam, December 8–12, 2024, Revised Selected Papers, Part I. Ed.: M. Cho, 52 – 68, Springer Nature Singapore. doi:10.1007/978-981-96-2641-0_4 Stochastic Optimal Control of an Optical Sorter With Material RecirculationWalker, M.; Reith-Braun, M.; Bauer, A.; Pfaff, F.; Maier, G.; Gruna, R.; Längle, T.; Beyerer, J.; Kruggel-Emden, H.; Hanebeck, U. D.2025. IEEE Transactions on Control Systems Technology, 33 (1), 354–368. doi:10.1109/TCST.2024.3477294 2024 Zum Gedenken an Prof. em. Dr.-Ing. Franz MeschBretthauer, G.; Beyerer, J.; Stiller, C.2024. at - Automatisierungstechnik, 72 (12), 1209–1211. doi:10.1515/auto-2024-0159 Rethinking Attention Module Design for Point Cloud AnalysisWu, C.; Wang, K.; Zhong, Z.; Fu, H.; Zheng, J.; Zhang, J.; Pfrommer, J.; Beyerer, J.2024. Pattern Recognition – 27th International Conference, ICPR 2024, Kolkata, India, December 1–5, 2024, Proceedings, Part XXVI. Ed.: A. Antonacopoulos, 249–267, Springer Nature Switzerland. doi:10.1007/978-3-031-78395-1_17 Path Planning for the Autonomous Inspection of Voxelized StructuresHagmanns, R.; Ruf, B.; Bockmühl, R.; Weißer, M.; Beyerer, J.2024. IEEE International Symposium on Safety Security Rescue Robotics (SSRR 2024), 267–272, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/SSRR62954.2024.10770050 Towards Weakly-Supervised Domain Adaptation for Lane DetectionZhou, J.; Zhang, C.; Beyerer, J.2024. 2024 IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops (CVPRW), 3553 – 3563, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/CVPRW63382.2024.00359 The role of an ontology-based knowledge backbone in a circular factoryHofmann, C.; Staab, S.; Selzer, M.; Neumann, G.; Furmans, K.; Heizmann, M.; Beyerer, J.; Lanza, G.; Pfrommer, J.; Düser, T.; Klein, J.-F.2024. at - Automatisierungstechnik, 72 (9), 875–883. doi:10.1515/auto-2024-0006 Managing uncertainty in product and process design for the circular factoryHeizmann, M.; Beyerer, J.; Dietrich, S.; Hoffmann, L.; Kaiser, J.-P.; Lanza, G.; Roitberg, A.; Stiefelhagen, R.; Stricker, N.; Wexel, H.; Zanger, F.2024. at - Automatisierungstechnik, 72 (9), 829–843. doi:10.1515/auto-2024-0009 Synset Signset Germany: a Synthetic Dataset for German Traffic Sign RecognitionSielemann, A.; Loercher, L.; Schumacher, M.-L.; Wolf, S.; Roschani, M.; Ziehn, J.; Beyerer, J.2024. 2024 IEEE 27th International Conference on Intelligent Transportation Systems (ITSC), Edmonton, AB, Canada, 24-27 September 2024, 2378 – 2385, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/ITSC58415.2024.10920175 Poison-Aware Open-Set Fungi Classification: Reducing the Risk of Poisonous ConfusionWolf, S.; Thelen, P.; Beyerer, J.2024. CLEF 2024 - CLEF 2024 Working Notes : Working Notes of the Conference and Labs of the Evaluation Forum (CLEF 2024) Grenoble, France, 9-12 September, 2024. Ed. : G. Faggioli, N. Ferro, P. Galuščáková, A. García Seco de Herrera, 2260 – 2266, CEUR-WS Synset Boulevard: A Synthetic Image Dataset for VMMR *Sielemann, A.; Wolf, S.; Roschani, M.; Ziehn, J.; Beyerer, J.2024. 2024 IEEE International Conference on Robotics and Automation (ICRA), Yokohama, 13th-17th May 2024, 9146 – 9153, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/ICRA57147.2024.10610650 DDS Security+: Enhancing the Data Distribution Service With TPM-based Remote AttestationWagner, P. G.; Birnstill, P.; Beyerer, J.2024. Proceedings of the 19th International Conference on Availability, Reliability and Security, Art.-Nr.: 159, Association for Computing Machinery (ACM). doi:10.1145/3664476.3670442 Utilizing multispectral imaging for improved weed and crop detectionFischer, B.; Gauweiler, P.; Gruna, R.; Beyerer, J.2024. R. N. Youngworth, B. N. Sitarski & H. Münz (Hrsg.), Optical Instrument Science, Technology, and Applications III, 6, SPIE. doi:10.1117/12.3023597 Scalable Radar-based Roadside Perception: Self-localization and Occupancy Heat Map for Traffic AnalysisHan, L.; Xu, Q.; Kefferpütz, K.; Lu, Y.; Elger, G.; Beyerer, J.2024. 2024 IEEE Intelligent Vehicles Symposium (IV), Jeju Island, Korea, Republic of, 02-05 June 2024, 1651 – 1657, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/IV55156.2024.10588397 Few-Shot Semantic Segmentation for Complex Driving ScenesZhou, J.; Chen, R.-B.; Beyerer, J.2024. 2024 IEEE Intelligent Vehicles Symposium (IV), Jeju Island, Korea, Republic of, 02-05 June 2024, 695–702, Institute of Electrical and Electronics Engineers (IEEE). doi:10.1109/IV55156.2024.10588850 SynthAct: Towards Generalizable Human Action Recognition based on Synthetic DataSchneider, D.; Keller, M.; Zhong, Z.; Peng, K.; Roitberg, A.; Beyerer, J.; Stiefelhagen, R.2024. 2024 IEEE International Conference on Robotics a",
  "content_length": 160078,
  "method": "requests",
  "crawl_time": "2025-12-01 13:36:58"
}