{
  "name": "Juho Kannala",
  "homepage": "https://users.aalto.fi/~kannalj1",
  "status": "success",
  "content": "Homepage of Juho Kannala Dr. Juho Kannala Associate Professor of Computer Vision Aalto University, Finland Office: Computer Science building, room A124 Tel: +358 50 353 7744 Email: firstname dot lastname at aalto dot fi Google Scholar DBLP arXiv About me I am a tenured Associate Professor of Computer Vision in the Department of Computer Science at Aalto University and an Adjunct Professor at the University of Oulu. I am also a co-founder of Spectacular AI, which is a university spin-off company providing solutions based on computer vision, spatial AI and sensor fusion. Research My research is in the field of computer vision. Below you can find a list of my publications and links to research projects with which I have been involved. Many of my publications are also listed on my Google Scholar page and in DBLP. Often the preprint versions of our most recent papers are available in arXiv. Publications and project pages with links to software and data Students Currently, I am supervising the following doctoral students at Aalto University: Xiaotian Li, Shuzhe Wang, Rongtian Ye, Yi Zhao (with J. Pajarinen). In addition, I am currently co-advising Luca Ferranti at the University of Vaasa (with J. Boutellier) and Soumya Tripathy at Tampere University (with E. Rahtu). Previously, I have been the supervisor of the following completed doctoral theses at Aalto University: Yuxin Hou (2022), with A. Solin Rinu Boney (2022), with A. Ilin Santiago Cortes (2021), with A. Solin Ari Heljakka (2021), with A. Solin Vikas Verma (2020) Zakaria Laskar (2020) Iaroslav Melekhov (2020), with E. Rahtu Luiza Sayfullina (2019), with J. Karhunen In addition, I have been a co-advisor of the following doctoral theses at the University of Oulu: Janne Mustaniemi (2020), with J. Heikkilä, now at the University of Oulu Saad Ullah Akram (2017), with J. Heikkilä and L. Eklund, now at MVision AI Ltd Markus Ylimäki (2017), with J. Heikkilä, now at Cubicasa Ltd Juha Ylioinas (2016), with M. Pietikäinen and A. Hadid, now at Immersal Ltd Daniel Herrera Castro (2015), with J. Heikkilä, moved to Nvidia and then to Facebook Teaching I am currently responsible of the following courses at Aalto University: Computer Vision (CS-E4850) I am also happy to discuss possible topics for bachelor, master and doctoral theses in computer vision and machine learning. Please come to talk with me anytime I am in my office. firstname dot lastname at aalto.fi",
  "content_length": 2439,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:01"
}