{
  "name": "Juho Leinonen 0001",
  "homepage": "https://juholeinonen.com",
  "status": "success",
  "content": "Juho Leinonen Hello! I’m a tenure-track assistant professor and an academy research fellow at the Department of Computer Science at Aalto University. Previously, I was a postdoc at The University of Auckland, Aalto University, and the University of Helsinki, where I also completed my PhD in 2019. I also hold the title of docent from the University of Helsinki. The key question that my research seeks to answer is how to best support and engage diverse learner populations with educational technology and artificial intelligence. My research tackles this challenge in three intertwined ways: 1) by developing deeper insights into students’ learning through fine-grained learning analytics; 2) by utilizing educational technology, artificial intelligence, and large language models to support both students and teachers; and 3) by leveraging learnersourcing to create ample learning opportunities tailored to distinct student needs. If you’re interested in chatting more about these topics, feel free to get in touch! Selected publications Evaluating LLM-generated Worked Examples in an Introductory Programming Course Breanna Jury, Angela Lorusso, Juho Leinonen, Paul Denny, and Andrew Luxton-Reilly In Proceedings of the 26th Australasian Computing Education Conference 2024 Best paper award PDF Computing Education in the Era of Generative AI Paul Denny, James Prather, Brett A Becker, James Finnie-Ansley, Arto Hellas, Juho Leinonen, Andrew Luxton-Reilly, Brent N Reeves, Eddie Antonio Santos, and Sami Sarsa Communications of the ACM 2024 PDF The Robots Are Here: Navigating the Generative AI Revolution in Computing Education James Prather, Paul Denny, Juho Leinonen, Brett A Becker, Ibrahim Albluwi, Michelle Craig, Hieke Keuning, Natalie Kiesler, Tobias Kohn, Andrew Luxton-Reilly, Stephen MacNeil, Andrew Petersen, Raymond Pettit, Brent N Reeves, and Jaromir Savelka 2023 PDF",
  "content_length": 1885,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:01"
}