{
  "name": "Juho Kanniainen",
  "homepage": "https://www.tuni.fi/en/juho-kanniainen",
  "status": "success",
  "content": "Juho Kanniainen | Tampere universitiesJuho KanniainenProfessor, Computing SciencesFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universityjuho.kanniainen [at] tuni.fi (juho[dot]kanniainen[at]tuni[dot]fi)phone number+358407074532phone numberComputing SciencesHervanta CampusWebsiteshttps://scholar.google.fi/citations?user=xsOyQN4AAAAJ&hl=fi&oi=ao About meDr Juho Kanniainen is a Professor in Computing Sciences at Tampere University (TAU), Finland. He leads the research group focused on Financial Computing and Data Analytics. With a wealth of international leadership experience, Dr. Kanniainen has served as the director and coordinator of two large EU projects: HPCFinance and BigDataFinance. In his capacity as the head of multi-member international consortia, he has successfully secured a total of 7.5 million euros in EU funding for these pioneering initiatives. Additionally, Dr. Kanniainen has directed the international MSc program in Computing Sciences at TAU.Juho's research agenda centers on machine learning, statistical computing and mathematical modeling for time-series analysis and graphs, with a emphasis on limit order book markets and information cascades. This interest spans financial market research and other contexts as well. His papers have been published in top-tier journals, including IEEE Transactions on Neural Networks and Learning Systems (IF 14.255), Pattern Recognition (IF 8.518), and the Review of Finance (IF 5.059). He has organized several conferences and served as a co-editor for the book entitled High-Performance Computing in Finance: Problems, Methods, and Solutions, Chapman and Hall/CRC Financial Mathematics Series. He has supervised and co-supervised 10 PhD students.Google scholar: https://scholar.google.fi/citations?user=xsOyQN4AAAAJ&hl=fi&oi=ao Latest publicationsForecasting Mortality Associated Emergency Department Crowding with LightGBM and Time Series DataNevanlinna, J., Eidstø, A., Ylä-Mattila, J., Koivistoinen, T., Oksala, N., Kanniainen, J., Palomäki, A. & Roine, A., 15 Jan 2025, In: Journal of Medical Systems. 49, 1, 1 p., 9.Research output: Contribution to journal › Article › Scientific › peer-reviewOptimizing the Logistical Routing of Agricultural Side-Streams to a Biogas Plant for a Circular Bioeconomy ImplementationEloranta, K., Koskela, O., Tampio, E., Kanniainen, J. & Saari, U., Jun 2025, In: Bioresource Technology Reports. 30, 102097.Research output: Contribution to journal › Article › Scientific › peer-reviewForecasting emergency department occupancy with advanced machine learning models and multivariable inputTuominen, J., Pulkkinen, E., Peltonen, J., Kanniainen, J., Oksala, N., Palomäki, A. & Roine, A., 2024, In: INTERNATIONAL JOURNAL OF FORECASTING. 40, 4, p. 1410-1420 11 p.Research output: Contribution to journal › Article › Scientific › peer-reviewNetwork analysis of aggregated money flows in stock marketsKaraila, J., Baltakys, K., Hansen, H., Goel, A. & Kanniainen, J., 2024, In: Quantitative Finance. 24, 10, p. 1423-1443Research output: Contribution to journal › Article › Scientific › peer-reviewValuation of option price in commodity markets described by a Markov-switching model: A case study of WTI crude oil marketMehrdoust, F., Noorani, I. & Kanniainen, J., Jan 2024, In: Mathematics and Computers in Simulation. 215, p. 228-269 42 p.Research output: Contribution to journal › Article › Scientific › peer-reviewAugmented bilinear network for incremental multi-stock time-series classificationShabani, M., Tran, D. T., Kanniainen, J. & Iosifidis, A., Sept 2023, In: Pattern Recognition. 141, 109604.Research output: Contribution to journal › Article › Scientific › peer-reviewCredit Card Fraud Detection with Subspace Learning-based One-Class ClassificationZaffar, Z., Sohrab, F., Kanniainen, J. & Gabbouj, M., 2023, 2023 IEEE Symposium Series on Computational Intelligence (SSCI). IEEE, p. 407-412 6 p. (IEEE Symposium on Computational Intelligence in Multi-Criteria Decision Making).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewCryptocurrency Portfolio Optimization by Neural Networks: 2023 IEEE Symposium Series on Computational Intelligence (SSCI)Nguyen, Q. M., Tran, D. T., Kanniainen, J., Iosifidis, A. & Gabbouj, M., 2023, 2023 IEEE Symposium Series on Computational Intelligence (SSCI). IEEE, p. 25-32 8 p. (IEEE Symposium on Computational Intelligence in Multi-Criteria Decision Making).Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-reviewEarly Warning Software for Emergency Department CrowdingTuominen, J., Koivistoinen, T., Kanniainen, J., Oksala, N., Palomäki, A. & Roine, A., May 2023, In: Journal of Medical Systems. 47, 10 p., 66.Research output: Contribution to journal › Article › Scientific › peer-reviewEmpirical deep hedgingMikkilä, O. & Kanniainen, J., 2023, In: Quantitative Finance. 23, 1, p. 111-122Research output: Contribution to journal › Article › Scientific › peer-reviewAll publications",
  "content_length": 5096,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:05"
}