{
  "name": "Jukka Matthias Krisp",
  "homepage": "https://www.uni-augsburg.de/en/fakultaet/fai/geo/prof/geoagi/geoagi-team/j-krisp",
  "status": "success",
  "content": "Prof. Dr. Jukka M. Krisp Applied Geoinformatics University Faculties Faculty of Applied Computer Science Institute of Geography Chairs and Professors Applied Geoinformatics Team Prof. Dr. Jukka M. Krisp Prof. Dr. Jukka Krisp Prof. Applied Geoinformatics Phone: +49 821 598 - 2756 Email: jukka.krisp@geo.uni-augsburggeo.uni-augsburg.de () Room: 2037 (B) Open hours: by appointment Address: Alter Postweg 118, 86159 Augsburg Contact (.vcf) Research Research Interests: Location Based Services (LBS) Geographic Visualization / Visual Analytics Spatial Modeling Geographic Information Systems (GIS) applications GIS in ecological network planning Courses / Teaching Course Home institute Lecturer Semester Type Language Please find the current list of courses in the digicampus system. Publications Publications, KRISP J.M. (info google or below) Publications Google scholar https://scholar.google.com/citations?hl=en&user=KnEUPRcAAAAJ&view_op=list_works&sortby=pubdate 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2006 | 2005 | 2004 | 2003 | 2002 2024 Huang, Haosheng, Cheng, Yi, Dong, Weihua, Gartner, Georg, Krisp, Jukka M., Meng, Liqiu (2024): Context modeling and processing in Location Based Services: research challenges and opportunities. Journal of Location Based Services, 18(4), 381-407. https://doi.org/10.1080/17489725.2024.2306349BibTeX | RIS | DOI Vester, D., Krisp, Jukka M. (2024): Estimating night populations on a high spatial resolution using mobile network data [Poster]. Mobile Tartu 2024, International Conference on Mobility, 11-14 June 2024, Tartu, Estonia. BibTeX | RIS Löw, P. S., Krisp, Jukka M. (2024): Improving bicycle routing by modifying a road network. GISRUK 2024 - 32nd Annual GIS Research UK Conference, University of Leeds, Leeds, UK, 9th–12th April 2024. zenodo.org. https://doi.org/10.5281/zenodo.10927580PDF | BibTeX | RIS | DOI Löw, Pablo S., Krisp, Jukka M. (2024): Smoothing the ride: a surface roughness-centric approach to bicycle routing. AGILE: GIScience Series, 5, 39. https://doi.org/10.5194/agile-giss-5-39-2024PDF | BibTeX | RIS | DOI Zhvania, Lika, Krisp, Jukka M. (2024): Spatial analysis of social networks in urban environments: integrating big data and cartographic techniques for understanding mobility patterns. Abstracts of the ICA, 7, 193. https://doi.org/10.5194/ica-abs-7-193-2024PDF | BibTeX | RIS | DOI 2023 Krisp, Jukka M., Meng, L., Kumke, H., Huang, H. (2023): Advances in location based services. Journal of Location Based Services, 17(4), 299-306. https://doi.org/10.1080/17489725.2023.2265867BibTeX | RIS | DOI Yao, X. Angela, Crooks, Andrew, Jiang, Bin, Krisp, Jukka, Liu, Xintao, Huang, Haosheng (2023): An overview of urban analytical approaches to combating the Covid-19 pandemic [Editorial]. Environment and Planning B: Urban Analytics and City Science, 50(5), 1133-1143. https://doi.org/10.1177/23998083231174748BibTeX | RIS | DOI Hoermann, S. M., Brand, K., Krisp, Jukka M. (2023): Copernicus satellite data for monitoring private and communal forest health. GI_Salzburg, 4.-6. July 2023, Salzburg, Österreich. BibTeX | RIS Huang, Haosheng, Cheng, Yi, Dong, Weihua, Gartner, Georg, Krisp, Jukka M., Meng, Liqiu (2023): Data modeling and processing in location based services: a collaborative research agenda [Abstract]. Abstracts of the ICA, 6, 95. https://doi.org/10.5194/ica-abs-6-95-2023PDF | BibTeX | RIS | DOI Keler, Andreas, Krisp, Jukka M. (2023): Geodata generation and enrichment via ChatGPT for Location Based Services (LBS). Haosheng Huang, Nico Van de Weghe, Georg Gartner (Eds.): Proceedings of the 18th International Conference on Location Based Services, LBS 2023, Ghent, Belgium, 20-22 November 2023 (pp. 136-141). Ghent: Ghent University. https://doi.org/10.34726/5743PDF | BibTeX | RIS | DOI Klasen, V., Bugucka, E., Meng, L., Krisp, Jukka M. (2023): How we see time: the evolution and current state of visualizations of temporal data. International Journal of Cartography (TICA), 9(2), 392-409. https://doi.org/10.1080/23729333.2022.2156316PDF | BibTeX | RIS | DOI Krisp, Jukka M. (2023): Location-based Services (LBS). In Klaus Brand, Thomas H. Kolbe (Eds.): Leitfaden Mobile GIS – von der GNSS-basierten Datenerfassung bis zu Mobile Mapping, Version 5.0 (pp. 14-15). München: Runder Tisch GIS e. V. c/o Technische Universität München. BibTeX | RIS | URL Zhou, Xiang, Afifah, Zulfa Nur'aini, Keler, Andreas, Timpf, Sabine, Krisp, Jukka M. (2023): Narrative indoor navigation – an approach using annotated 360-degree camera documentation. Haosheng Huang, Nico Van de Weghe, Georg Gartner (Eds.): Proceedings of the 18th International Conference on Location Based Services, LBS 2023, Ghent, Belgium, 20-22 November 2023 (pp. 31-35). Ghent: Ghent University. https://doi.org/10.34726/5728PDF | BibTeX | RIS | DOI 2022 Hechemer, T., Keler, Andreas, Krisp, Jukka M. (2022): An analysis of potential spaces for implementing geofences in a dynamic bike-sharing system. Jukka M. Krisp, L. Meng, H. Kumke, H. Huang (Eds.): Proceedings: 17th International Conference on Location Based Services (LBS2022), Munich/Augsburg, Germany, September 12-14, 2022 (pp. 113-115). Munich: Technical University Munich. BibTeX | RIS | URL Kalinic, Maja, Krisp, Jukka M. (2022): Fuzzy inference system for floating car data (FCD) to categorize traffic congestions. Mobile Tartu 2022: International Conference on Mobility, 28-30 June 2022, Tartu, Estonia. BibTeX | RIS Schwarz, Lucas, Keler, Andreas, Krisp, Jukka M. (2022): Improving urban bicycle infrastructure - an exploratory study based on the effects from the COVID-19 Lockdown. Journal of Urban Mobility, 2, 100013. https://doi.org/10.1016/j.urbmob.2022.100013PDF | BibTeX | RIS | DOI (2022): Proceedings 17th International Conference on Location Based Services (LBS2022), Munich / Augsburg, Germany, September 12th-14th. Jukka M. Krisp, Liqiu Meng, Holger Kumke, Haosheng Huang (Eds.): BibTeX | RIS | URL (2022): Proceedings: 17th International Conference on Location Based Services (LBS2022), Munich/Augsburg, Germany, September 12-14, 2022. Jukka M. Krisp, Liqiu Meng, Holger Kumke, H. Huang (Eds.): Munich: Technical University Munich. BibTeX | RIS | URL Vogt, Matthias, Krisp, Jukka M. (2022): Räumliche Lärmanalyse anhand von erweiterten Floating-Car-Daten (xFCD). KN - Journal of Cartography and Geographic Information, 72(1), 73-83. https://doi.org/10.1007/s42489-021-00095-yPDF | BibTeX | RIS | DOI 2021 Huang, Haosheng, Yao, Xiaobai Angela, Krisp, Jukka M., Jiang, Bin (2021): Analytics of location-based big data for smart cities: opportunities, challenges, and future directions. Computers, Environment and Urban Systems, 90, 101712. https://doi.org/10.1016/j.compenvurbsys.2021.101712BibTeX | RIS | DOI Kalinic, Maja, Krisp, Jukka M. (2021): Determining traffic congestion utilizing a fuzzy logic model and Floating Car Data (FCD). Proceedings of the ICA, 4, 55. https://doi.org/10.5194/ica-proc-4-55-2021PDF | BibTeX | RIS | DOI Subal, Julia, Paal, Piret, Krisp, Jukka M. (2021): Quantifying spatial accessibility of general practitioners by applying a modified huff three-step floating catchment area (MH3SFCA) method. International Journal of Health Geographics, 20(1), 9. https://doi.org/10.1186/s12942-021-00263-3PDF | BibTeX | RIS | DOI Keler, Andreas, Krisp, Jukka M. (2021): Quantifying the complexity of road intersections using open data of traffic accidents – insights from a case study in Munich. Abstracts of the ICA, 3, 143. https://doi.org/10.5194/ica-abs-3-143-2021PDF | BibTeX | RIS | DOI Krisp, Jukka M., Kalinic, Maja, Röger, Christian, Keler, Andreas (2021): Sensor based extended floating bicycle data (xFBD) analysis. Abstracts of the ICA, 3, 164. https://doi.org/10.5194/ica-abs-3-164-2021PDF | BibTeX | RIS | DOI Zwick, Simon, Keler, Andreas, Krisp, Jukka M. (2021): Three-dimensional visualisation of traffic volume changes in the metropolitan area of Minneapolis-Saint Paul in 1996 and 2016. KN - Journal of Cartography and Geographic Information, 71(2), A-10-A-17. https://doi.org/10.5281/zenodo.4991926BibTeX | RIS | DOI | URL 2020 Krisp, Jukka M., Kalinic, Maja, Röger, Christian (2020): Extended floating bike data (xFBD) analysis - have a pleasant ride. Mobile Tartu 2020, International Conference on Mobility, 30th June 2020, online conference, Tartu, Estonia. BibTeX | RIS Keler, Andreas, Krisp, Jukka M., Ding, Linfang (2020): Extracting commuter-specific destination hotspots from trip destination data – comparing the boro taxi service with Citi Bike in NYC. Geo-spatial Information Science, 23(2), 141-152. https://doi.org/10.1080/10095020.2019.1621008BibTeX | RIS | DOI Röger, Christian, Kalinic, Maja, Krisp, Jukka M. (2020): Extracting densely covered areas within floating car datasets using inductive loop detector data. KN - Journal of Cartography and Geographic Information, 71, 97-103. https://doi.org/10.1007/s42489-020-00063-yPDF | BibTeX | RIS | DOI Krisp, Jukka M. (2020): Location-based Services (LBS). In K. Brand, T. H. Kolbe (Eds.): Leitfaden Mobile GIS: von der GNSS-basierten Datenerfassung bis zu Mobile Mapping, Version 4.0 (Oktober 2020) (pp. 15-16). München: Runder Tisch GIS e. V. c/o Technische Universität München. BibTeX | RIS | URL 2019 Krisp, Jukka M., Keler, Andreas (2019): Classifying complex road features in the context of car driver education. Abstracts of the ICA, 1, 190. https://doi.org/10.5194/ica-abs-1-190-2019PDF | BibTeX | RIS | DOI Kalinic, Maja, Krisp, Jukka M. (2019): Floating car data and fuzzy logic for classifying congestion indexes in the city of Shanghai. Proceedings of the ICA, 2, 57. https://doi.org/10.5194/ica-proc-2-57-2019PDF | BibTeX | RIS | DOI Kalinic, Maja, Krisp, Jukka M. (2019): Fuzzy inference approach in traffic congestion detection. Annals of GIS, 25(4), 329-336. https://doi.org/10.1080/19475683.2019.1675760PDF | BibTeX | RIS | DOI Keler, Andreas, Bug, Lukas A., Krisp, Ju",
  "content_length": 43161,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:04"
}