{
  "name": "Jukka K. Nurminen",
  "homepage": "https://researchportal.helsinki.fi/en/persons/jukka-k-nurminen",
  "status": "success",
  "content": "Jukka K Nurminen - University of Helsinki Jukka K Nurminen Professor of Computer Science Professor, Department of Computer ScienceSupervisor for doctoral programme, Doctoral Programme in Computer Science﻿﻿﻿EUROFusion Advanced Computing Hub FinlandEmpirical Software Engineering research group https://orcid.org/0000-0001-5083-1927 Phone+358294151155, +358504836442Emailjukka.k.nurminenhelsinkifi PL 68 (Pietari Kalmin katu 5)00014Finland 1988 …2025 Research activity per year Personal profile Description of research and teachingLinkedIn: https://fi.linkedin.com/in/jukka-k-nurminen-6b0b6a1 Publications in Google Scholar https://scholar.google.fi/citations?user=cmftgn4AAAAJ Interests I am widely interested in the performance of efficient software systems and their construction. My most influential past work has been on energy-efficient software as well as on mobile peer-to-peer and cloud solutions. Currently, my main interests are on tools and techniques for developing data-intensive software systems. This includes testing of AI systems, technical solutions for ethical decision making as well as software development for new computational platforms like for quantum computers and for highly distributed edge computing. CV Education Title of Docent, Software Technology, Helsinki University of Technology, 2007 Doctor of Science (Technology), Systems and Operations Research and Mathematics, Department of Engineering Physics and Mathematics, Helsinki University of Technology, 2003. Thesis title: Modelling and implementation issues in circuit and network planning tools Licentiate of Technology, Systems and operations research, Helsinki University of Technology, 1989. Thesis title: Coupling symbolic and numeric computing in knowledge-based system: An application to electronics design Diploma Engineer (Master of Science in Engineering) with honors, Systems and operations research, Helsinki University of Technology, 1986Thesis title: Design and implementation of a mixed-integer programming system Matriculation exam from Helsingin Suomalainen Yhteiskoulu, 1981 Knowledge of Languages: Finnish (native), English (fluent), Swedish (proficient), German (proficient), French (intermediate), Russian (beginner), Italian (beginner), Spanish (beginner) Professional experience Professor of Computer Science, University of Helsinki (04/2019 - present) Software systems for data-intensive computing in natural sciences Research Professor, VTT (02/2019-04/2019) Software engineering Principal Scientist, VTT (01/2016-02/2019) Applied research on edge computing, prescriptive analytics, and optimization. Adjunct Professor of Computer Science, Aalto University (01/2016-02/2021)(part-time) Research and teaching on mobile and distributed computing. Project Leader & Adjunct Scientist, Helsinki Institute of Physics (HIP) (01/2015-12/2017) (part-time) Cooperating with CERN on the energy-efficiency of data analysis and scientific computing. Professor of Practise of Computer Science, Aalto University (01/2011-12/2015) Research and teaching of mobile cloud computing, energy-efficiency, and big data. Recruiting, acquiring funding, and managing a research team. Leading EU, EIT, and TEKES funded international research projects and CERN cooperation. Organizer of hackathons, summer schools, and workshops. Coauthor of over 100 scientific publications. H-index 33. Acquired over 1 MEUR research funding. Principal Researcher and other applied research positions, Nokia Research Center (1986-2010) Working on knowledge technology, intelligent planning tools, mobile cloud services, mobile peer-to-peer, and energy-efficiency of mobile applications.  Outcomes: multiple commercial used tools, internal ventures, open-source software (e.g. mobile BitTorrent with over 100.000 downloads), patent applications, scientific publications. Research funding 2019-2021 EU Ecsel: AhTools as VTT PI: 815.000 EUR, as country coordinator Finland: 2.100.000 EUR 2015-17 HIP:  Green Big Data ~600.000 EUR, PI 2013-16 EU FP7: Cities as drivers of social change (CIVIS) 2013-2016 279.300 EUR, Aalto PI 2013-15 TEKES Finnish-China cooperation call: Everyday sensing (ESENS) 75.000 EUR, Aalto PI 2013 IoT SHOK: Integration with social web 50.000 EUR, Aalto PI 2013 EIT: Cloud computing summer school 20.000 EUR, Aalto PI 2012 Nokia: Adaptive video streaming energy optimization research 37.931,00 EUR, Aalto PI 2012 EIT: Cloud computing summer school 30.000 EUR, Aalto PI Leadership and Teaching experience Supervisor of 6 completed PhD thesis, 48 MSc thesis, 21 BSc thesis, and a number of seminar works Opponent or preliminary examiner of 8 PhD and 1 Licentiate thesis Responsible teacher of multiple courses including Mobile cloud computing, Network application frameworks, AI and system analysis Explorations with new forms of teaching: Green campus hackathon, Data science hackathon, EIT Idea Challenge preparation course Grade “excellent” in the assessment of teaching skills and merits at the University of Helsinki 2018 for tenure-track position evaluation Overall grade “excellent” for teaching competence for Adjunct professorship nomination 2015 by Aalto University SCITEC Patents and publications Over 100 publications in scientific journals and conferences with around 3900 citations. Google h-index 35. 36 patent applications on the area of data analytics, mobile applications and solutions (position 23rd on the list of Top Inventors in Nokia from years 2000 to 2009). Service to the research community Guest editor of Machine Vision and Applications Journal: Special issue on “Intelligent Urban Computing with Big Data,” with Liu, W., Cui, P., Nurminen, J.K., and Wang, J., September 2017 TPC Co-chair of the Workshop on Hot Topics in Network and Service Management: 5G and Sliced Networks, Distributed Things and Blockchains (HotNSM 2019), Washington, D.C., USA, April, 2019 TPC Co-chair of the 4th International Conference on Cloud Computing and Intelligence Systems (CCIS 2016), Beijing, China, 2016 TPC Co-chair of the “Video delivery over mobile networks: solutions and performance evaluation” workshop as part of WiOpt 2013, 2014 conference Project reviewer for EU FP7 program. Expert evaluator of grant proposals for French, Dutch, Hungarian, Saudi-Arabian and Canadian research funding organizations.Reviewer for over twenty journals and TPC member of tens of conferences. External positionsPrincipal Scientist, Research Professor, VTT Jan 2016 → Apr 2019Professor of Practice, Aalto UniversityJan 2011 → Dec 2015Principal researcher, Project manager, Research engineer, Nokia Research Center1986 → 2010Adjunct Professor , Aalto University Fields of Science113 Computer and information sciences Research output Research output per year 1988 2008 2011 2012 2013 2014 2015 2019 2022 2023 2025 2025 126 Conference contribution 47 Article 32 Patent 7 Chapter 18 More 3 Abstract 3 Poster 3 Review Article 2 Commissioned report 2 Conference article 1 Paper 1 Editorial 1 Software 1 Preprint 1 Working paper Research output per year Research output per year A Design Framework for Cloud-HPC Integration in MLOpsSiilasjoki, N., Raatikainen, M. & Nurminen, J. K., 2025, SAC '25: Proceedings of the 40th ACM/SIGAPP Symposium on Applied Computing. Association for Computing Machinery, p. 217-224 8 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Open AccessFile A Review of Machine Learning Approaches for Real-Time Alerting in Service Level Objective MonitoringSarni, T. A. & Nurminen, J. K., 25 Aug 2025, 2025 IEEE International Conference on Software Services Engineering (SSE). IEEEResearch output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Comparative Analysis of Three IoT Data Storage System Architectures on AWS CloudRohal, D., Lwakatare, L. E., Wu, Y., Haataja, J., Nurminen, J. K. & Kangasluoma, J., 2025, Proceedings - 2025 IEEE 22nd International Conference on Software Architecture, ICSA-C 2025. Institute of Electrical and Electronics Engineers Inc., p. 51-59 9 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Confidence-based Estimators for Predictive Performance in Model MonitoringKivimäki, J. I., Nurminen, J. K., Białek, J. & Kuberski, W., 20 Jan 2025, In: Journal of Artificial Intelligence Research. 82, p. 209-240 32 p.Research output: Contribution to journal › Article › Scientific › peer-review Open AccessFile Cost of Artificial Intelligence: A Survey in Finnish Software CompaniesKlemetti, A., Sorvisto, A., Raatikainen, M. & Nurminen, J. K., 2025, Product-Focused Software Process Improvement (PROFES): Lecture Notes in Computer Science . Vol. 16361. Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review View all 230 research outputs Projects Projects per year 2020 2020 2021 2023 2024 2025 2027 1 Not started 4 Active 5 Finished Projects per year Ohjelmistotyön tulevaisuudetNurminen, J. K. (Project manager) & Raatikainen, M. (Participant)Innovaatiorahoituskeskus Business Finland01/06/2025 → 31/05/2027Project: Business Finland Engineering Large Foundational Models for Enterprise IntegrationNurminen, J. K. (Project manager), Baig, A. (Participant), Hussain, Z. (Participant), Huuskonen, E. I. (Participant), Kivimäki, J. I. (Participant), Kuokkanen, A. (Participant), Lindfors, T. A. (Participant), Lwakatare, L. E. M. (Participant), Malik, A. (Participant), Muiruri, D. (Participant), Mylläri, J. (Participant), Raatikainen, M. (Participant), Saavalainen, J. I. (Participant), Shaikh, H. (Participant) & Valjakka, J. H. (Participant)Business Finland Oy01/01/2025 → 31/12/2027Project: Business Finland EM4QS: Enhanced Middleware for Quantum SoftwareMeijer, A. (Project manager), Nurminen, J. K. (Principal Investigator), Becker, L. V. A. (Participant), Salmenperä, I. E. (Participant), Perkkola, F. E. (Participant)",
  "content_length": 12017,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:04"
}