{
  "name": "Jukka Suomela",
  "homepage": "https://jukkasuomela.fi",
  "status": "success",
  "content": "Jukka Suomela Jukka Suomela Associate Professor · Department of Computer Science · Aalto University email: jukka.suomela@aalto.fi phone: +358 456 555 555 office: B316, Computer Science building Twitter · Facebook · Instagram · LinkedIn · Mastodon · Mastodontti · Bluesky · Threads · YouTube · GitHub · Bitbucket · Google Scholar · DBLP · ORCID · arXiv.org I am the professor in charge of the Finnish Computer Science major (Tietotekniikka) and minor in our Bachelor’s program. Research Research interests: theoretical foundations of distributed and parallel computing, algorithms, computational complexity, and computability. More information: publications · talks · other works · CV Research group: Distributed Algorithms · HALT Helsinki Algorithms & Theory News Internships If you are interested in international summer internships, please apply through the Aalto Science Institute international summer research programme. Talks Awards FOCS 2019 best paper award: “Lower bounds for maximal matchings and maximal independent sets” DISC 2017 best paper award: “Improved distributed degree splitting and edge coloring” Teaching Computer Science Bachelor major (in Finnish) Computer Science Bachelor minor (in Finnish and English) CS-E4510 Distributed Algorithms CS-E4595 Competitive Programming CS-E4580 Programming Parallel Computers CS-A0100 Tietokone työvälineenä Conferences Keynote speaker in OPODIS 2020, SIROCCO 2026, SWAT 2020 Invited speaker in SIROCCO 2023, SOFSEM 2026 Track chair in SSS 2021 In the programme committees of ALGOWIN 2023, DISC 2022, DISC 2024, DISC 2026, ESA 2022, ESA 2023, FOCS 2025, ICALP 2025, ICALP 2026, ICDCS 2025, IWOCA 2021, IWOCA 2024, OPODIS 2021, OPODIS 2023, PODC 2022, PODC 2023, SIROCCO 2025, SIROCCO 2026, SODA 2023, SOSA 2026, SPAA 2020, STACS 2025, WOLA 2022 In the steering committees of ADGA, RW-DIST, SWAT This page was last updated in March 2025",
  "content_length": 1928,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:03"
}