{
  "name": "Juliana Freire",
  "homepage": "http://engineering.nyu.edu/user/4254",
  "status": "success",
  "content": "Juliana Freire | NYU Tandon School of Engineering Skip to Main Content Search NYU Tandon Fulltext search Looking for News or Events? Juliana Freire , Ph.D. Institute Professor and Professor of Computer Science Professor of Data Science Co-Director of the VIDA Center Computer Science and Engineering Visualization Imaging and Data Analysis Center (VIDA) Connect Email juliana.freire [at] nyu.edu CV/resume vitae-short.pdf Phone 646.997.4128 Website NYU VIDA github Office Visualization, Imaging and Data Analysis Center Juliana Freire is an Institute Professor at the Tandon School of Engineering and Professor of Computer Science and Engineering and Data Science at New York University. She served as the elected chair of the ACM SIGMOD and as a council member of the Computing Community Consortium (CCC), and was the NYU lead investigator for the Moore-Sloan Data Science Environment, a grant awarded jointly to UW, NYU, and UC Berkeley. She develops methods and systems that enable a wide range of users to obtain trustworthy insights from data. This spans topics in large-scale data analysis and integration, visualization, machine learning, provenance management, and web information discovery, as well as different application areas, including urban analytics, predictive modeling, and computational reproducibility. She is an active member of the database and Web research communities, with over 250 technical papers (including 12 award-winning papers), several open-source systems, and 12 U.S. patents. According to Google Scholar, her h-index is 65 and her work has received over 18,000 citations. She is an ACM Fellow, a AAAS Fellow, and the recipient of an NSF CAREER, two IBM Faculty awards, and a Google Faculty Research award. She was awarded the ACM SIGMOD Contributions Award in 2020. Her research has been funded by the National Science Foundation, DARPA, Department of Energy, National Institutes of Health, Sloan Foundation, Gordon and Betty Moore Foundation, W. M. Keck Foundation, Google, Amazon, AT&T Research, Microsoft Research, Yahoo! and IBM. She has received M.Sc. and Ph.D. degrees in computer science from the State University of New York at Stony Brook, and a B.S. degree in computer science from the Federal University of Ceara (Brazil). Research Interests Big Data Data Science Data analysis and visualization Machine learning/AI Provenance management Large-scale information integration Data management Web information discovery Computational reproducibility Urban analytics Education Ph.D., Computer Science, State University of New York at Stony Brook, 1997 M.S., Computer Science, State University of New York at Stony Brook, 1992 B.S., Computer Science, Universidade Federal do Ceara, Brazil, 1991 Experience Institute Professor, Tandon School of Engineering, 2022- Professor, Department of Computer Science and Engineering, New York University, 2011- Associate Professor, School of Computing and SCI Institute, University of Utah, 2008-2011 Assistant Professor, School of Computing, University of Utah, 2005-2008 Affiliations Affiliated Faculty, Courant Institute for Mathematical Science Faculty, NYU Center of Data Science Awards ACM SIGMOD Contributions Award, 2020. ACM Fellow, 2014. Google Faculty Research Award. Google, 2013. IBM Faculty Award. IBM, 2008 and 2014. CAREER award. National Science Foundation, 2008. ACM SIGMOD Contributions Award, 2020. ACM Fellow, 2014. IBM Faculty Award, 2014. Google Faculty Research Award, 2013. NSF CAREER award. National Science Foundation, 2008. IBM Faculty Award, 2008. Research Centers, Labs, and Groups Visualization Imaging and Data Analysis Center (VIDA) We work in the areas of Visualization, Imaging and Data Analysis. Center for Advanced Technology in Telecommunications (CATT) Creating economic impact through research, technology transfer, and faculty entrepreneurship. Email juliana.freire [at] nyu.edu CV/resume vitae-short.pdf Phone 646.997.4128 Website NYU VIDA github Office Visualization, Imaging and Data Analysis Center Latest Stories All News Press Release Urban computing to get a boost with new open-source platform funded by the National Science Foundation News Accomplishments and achievements from the Visualization Imaging and Data Analysis (VIDA) Center News The future of engineering Tandon in the Media Deploying data science and AI to fight wildlife trafficking From IEEE Spectrum News 2022 Tandon Faculty Awards Tandon in the Media Meltwater announces the launch of new Scientific Advisory Board From Globe Newswire Load More",
  "content_length": 4539,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:30"
}