{
  "name": "Julia Olkhovskaya",
  "homepage": "https://sites.google.com/view/julia-olkhovskaya/home",
  "status": "success",
  "content": "HomeSearch this siteEmbedded FilesSkip to main contentSkip to navigationJulia OlkhovskayaWelcome to my homepage! I am an Assistant Professor in the Department of Intelligent Systems, Delft University of Technology. Previously, I did a postdoc at the Mathematics Department at VU Amsterdam.  I obtained my PhD at Universitat Pompeu Fabra, where I was advised by Gergely Neu and Gábor Lugosi. I am working on designing and analyzing algorithms for sequential decision-making problems, with my primary focus on bandit problems and theoretical reinforcement learning. Here you can find my CV, Google Scholar.E-mail: julia.olkhovskaya@gmail.com .A PhD student position is open! More details here.Publications:Nicolò Cesa-Bianchi, Khaled Eldowa, Emmanuel Esposito, Julia Olkhovskaya: \"Improved Regret Bounds for Bandits with Expert Advice \",  under review. Gergely Neu,  Julia Olkhovskaya, Sattar Vakili: \"Adversarial Contextual Bandits Go Kernelized\", ALT 2024.Sattar Vakili, Julia Olkhovskaya: \"Kernelized Reinforcement Learning with Order Optimal Regret Bounds\", NeurIPS 2023.Julia Olkhovskaya, Jack Mayo, Tim van Erven, Gergely Neu, Chen-Yu Wei: \"First- and Second-Order Bounds for Adversarial Linear Contextual Bandits\", NeurIPS 2023.Gabor Lugosi, Gergely Neu and Julia Olkhovskaya: \"Learning to maximize global influence from local observations\", under review.  Gergely Neu, Julia Olkhovskaya, Matteo Papini, Ludovic Schwartz: \"Lifting the Information Ratio: An Information-Theoretic Analysis of Thompson Sampling for Contextual Bandits\", NeurIPS 2022.Gergely Neu and Julia Olkhovskaya: “Online learning in MDPs with linear function approximation and bandit feedback”, NeurIPS 2021.Gergely Neu and Julia Olkhovskaya: “Efficient and Robust Algorithms for Adversarial Linear Contextual Bandits”, COLT 2020. Gabor Lugosi, Gergely Neu and Julia Olkhovskaya: “Online influence maximization with local observations”,  ALT 2019Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 1993,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:07"
}