{
  "name": "Julius Köpke",
  "homepage": "https://www.aau.at/en/isys/ics/team/koepke-julius",
  "status": "success",
  "content": "Dipl.-Ing. Dr. Julius Köpke – Team ICS, Department of Informatics Systems Student CockpitePaymentAppointment & course managementCampus SystemResearch Information SystemCampus searchStaff PortalOrganisation handbookOperational messages, internal & personal messages LinksWebmail Library Vacancies University bulletin Bulletin Board Staff Search Campus Map IT Services (ZID) eLearning Service USI OEH Klagenfurt Information forPupils Alumni & Career Prospective Students Continuing Education Researchers Students Staff Teaching Staff Partners & Sponsors International INFORMATION AND COMMUNICATION SYSTEMS AAU1/...Department of Informatics Systems2/Research Group Information and Communication Systems3/Team ICS4/Dipl.-Ing. Dr. Julius KöpkeDipl.-Ing. Dr. Julius Köpke Assoc.-Prof. Dipl.-Ing. Dr. Julius KöpkeAssociate Professor+43 463 2700 3531Julius [dot] Koepke [at] aau [dot] atS.2.73Campus-Portal profile | Courses | Research Research Interests: (inter-organizational) Business Processes with a focus on Smart Contracts and Blockchain Technology. Application of Semantic Technologies for (data) Interoperability Artifact-Centric Business Processes, Business Processes and Data Management Regarding the application of semantic technologies my major contributions are an expressive, declarative and still light-weight annotation method for XML-Schema and corresponding matching algorithms for generating document transformations. In the field of business processes my major contributions are methods for the alignment of local processes according to a global process, a theory of equivalence transformations for the implementation of inter-organizational data-flow and methods to generate high quality translations of activity-centric processes to artifact centric processes incorporating domain knowledge. Recent Publications: J. Köpke, G. Meroni, M. Salnitri. Designing Secure Business Processes for Blockchains with SecBPMN2BC. Future Generation Computer Systems  (in Press). J. Köpke A. Brdanin. On Storing Data Objects of Business Processes on Blockchain Channels. PoEM’2022 Workshops and Models at Work Papers, November 23-25, 2022 (to appear), London, UK K. Lila, M. Franceschetti, J. Köpke. Interactive Design of Time-Aware Business Processes. Post-Proc. of EDOC 22 Demos (to appear). 2022. J. Köpke, M. Nečemer. (2022). Measuring the Effects of Confidants on Privacy in Smart Contracts. In:  Business Process Management: Blockchain, Robotic Process Automation, and Central and Eastern Europe Forum. BPM 2022. Lecture Notes in Business Information Processing, vol 459. Springer, Cham. Amaro G, Moutinho F, Campos-Rebelo R, Köpke J, Maló P. JSON Schemas with Semantic Annotations Supporting Data Translation. Applied Sciences. 2021; 11(24):11978. https://doi.org/10.3390/app112411978 Hans-Georg Fill, Julius Köpke: 1st International Workshop on Conceptual Modeling for Distributed Ledger Technologies (preface). Modellierung (Companion) 2020: 40-41 Julius Köpke: Towards Modeling Privity and Enforceability Requirements for BPM based Smart Contracts (invited paper). Modellierung (Companion) 2020: 53-55 Judith Michael, Dominik Bork, Hans-Georg Fill, Peter Fettke, Dimitris Karagiannis, Julius Köpke, Agnes Koschmider, Heinrich C. Mayr, Jana-Rebecca Rehse, Ulrich Reimer, Michael Striewe, Marina Tropmann-Frick, Meike Ullrich: Companion Proceedings of Modellierung 2020 Short, Workshop and Tools & Demo Papers co-located with Modellierung 2020, Vienna, Austria, February 19-21, 2020. CEUR Workshop Proceedings 2542, CEUR-WS.org 2020 Julius Köpke, Marco Franceschetti, Johann Eder: Balancing Privity and Enforceability of BPM-Based Smart Contracts on Blockchains. BPM (Blockchain and CEE Forum) 2019: 87-102 Publications: Motoshi Saeki, Leah Wong, João Araujo, Miguel Goulão, Clara Ayora, Anna Bernasconi, Matteo Buffa, Silvana Castano, Stefano Montanelli, Peter Fettke, Hans-Georg Fill, Alberto García S., Beatriz Marín, José F. Reyes Román, Cristine Griffo, Jin-Taek Jung, Julius Köpke, Edelweis Rohrer: Advances in Conceptual Modeling. Springer, Cham, 14932, 2024, Hans-Georg Fill, Peter Fettke, Julius Köpke: Preface of 2nd Workshop on Modeling in the Ageof Large Language Models (LLM4Modeling). Springer, Cham, 14932, 2024, S. 321 - 324.Julius Köpke, Aya Mohamed Abdelaziz Safan: Introducing the BPMN-Chatbot for Efficient LLM-Based Process Modeling. Proceedings of the Best BPM Dissertation Award, Doctoral Consortium, and Demonstrations & Resources Forum co-located with 22nd International Conference on Business Process Management (BPM 2024), CEUR-Workshop Proceedings, 3758, 2024, S. 1 - 5.Julius Köpke, Aya Mohamed Abdelaziz Safan: Efficient LLM-Based Conversational Process Modeling. 3rd Workshop on Natural Language Processing for Business Process Management (NLP4BPM @ BPM24) , 2024, S. 1 - 12.Robin Bergenthum, Julius Köpke: Message from the Modellierung'24 Tools & Demos Chairs.. Modellierung 2024 - Workshopband, Gesellschaft für Informatik e.V. (GI), Bonn, 2024, Peter Fettke, Hans-Georg Fill, Julius Köpke: Preface for Workshop Modeling in the Age of Large Language Models (LLM4Modeling).. Modellierung 2024 - Workshopband, Gesellschaft für Informatik e.V. (GI), Bonn, 2024, Julius Köpke, Sebastian Trattnig: Transformation rules for the decentralization of a blockchain-extended global process model . 2023, S. 1 - 26.Julius Köpke, Orlenys López-Pintado, Ralf Plattfaut, Jana-Rebecca Rehse, Katarzyna Gdowska, Fernanda Gonzalez-Lopez, Jorge Munoz-Gama, Koen Smit, Jan Martijn E. M. van der Werf: Business Process Management: Blockchain, Robotic Process Automation and Educators Forum. Springer Nature, 491, Berlin und London, 2023, Julius Köpke, Orlenys López-Pintado: Blockchain Forum Preface. Business Process Management: Blockchain, Robotic Process Automation and Educators Forum, Springer, 491, Berlin, 2023, S. 2 - 3.Giovanni Meroni, Marco Comuzzi, Julius Köpke: Editorial: Blockchain for trusted information systems. Frontiers in Blockchain - Research Topic: Blockchain for Trusted Information Systems, Frontiers Media S.A., 6, Lausanne Switzerland, 2023, S. 1 - 4.Hans-Georg Fill, Peter Fettke, Julius Köpke: Editorial: Conceptual Modeling and Large Language Models: Impressions From First Experiments With ChatGPT . Enterprise Modelling and Information Systems Architectures (EMISAJ), 18, 2023, S. 1 - 15.Keti Lila, Marco Franceschetti, Julius Köpke: Interactive Design of Time-Aware Business Processes. Enterprise Design, Operations, and Computing. EDOC 2022 Workshops, Springer, 466, Berlin, 2023, Julius Köpke, Adnan Brdanin: On Storing Data Objects of Business Processes on Blockchain Channels. Proceedings of the PoEM 2022 Workshops and Models at Work co-located with Practice of Enterprise Modelling 2022, London, United Kingdom, November 23-25, 2022, CEUR Workshop Proceedings (CEUR-WS.org), 3298, Aachen, 2022, Julius Köpke, Giovanni Meroni, Mattia Salnitri: Designing secure business processes for blockchains with SecBPMN2BC. Future Generation Computer Systems, Elsevier, 141, 2022, S. 382 - 398.Julius Köpke, Giovanni Meroni, Mattia Salnitri: SecBPMN2BC: Specifications and Rules. [online], 2022, S. 1 - 44.Julius Köpke, Nečemer Michael: Measuring the Effects of Confidants on Privacy in Smart Contracts. Business Process Management: Blockchain, Robotic Process Automation, and Central and Eastern Europe Forum. BPM 2022., Springer, Cham, 459, 2022, S. 84 - 99.Gonçalo Amaro, Filipe Moutinho, Rogério Campos-Rebelo, Julius Köpke, Pedro Maló: JSON Schemas with Semantic Annotations Supporting Data Translation . Applied Sciences, MDPI Publishing, 11, Basel, 2021, S. 1 - 23.Judith Michael, Dominik Bork, Hans-Georg Fill, Peter Fettke, Dimitris Karagiannis, Julius Köpke, Agnes Koschmider, Heinrich C. Mayr, Jana-Rebecca Rehse, Ulrich Reimer, Michael Striewe, Marina Tropmann-Frick, Meike Ullrich: Companion Proceedings of Modellierung 2020 Short, Workshop and Tools & Demo Papers co-located with Modellierung 2020, Vienna, Austria, February 19-21, 2020.. 2020, Hans-Georg Fill, Julius Köpke: 1st International Workshop on Conceptual Modeling for Distributed Ledger Technologies (preface). Modellierung 2020 Short, Workshop and Tools / Demo Papers, CEUR-Workshop Proceedings, 2542, 2020, S. 40 - 41.Julius Köpke: Towards Modeling Privity and Enforceability Requirements for BPM based Smart Contracts. Modellierung 2020 Short, Workshop and Tools & Demo Papers, CEUR-WS.org, Vol. 2542, Vol-2542, 2020, S. 53 - 55.Julius Köpke, Marco Franceschetti, Johann Eder: Optimizing data-flow implementations for inter-organizational processes. Distributed and Parallel Databases, Springer Verlag GmbH, 37, Berlin, Heidelberg, New York, 2019, S. 651 - 695.Julius Köpke, Marco Franceschetti, Johann Eder: Balancing Privity and Enforceability of BPM-Based Smart Contracts on Blockchains. Business Process Management: Blockchain and Central and Eastern Europe Forum. BPM 2019, Springer Verlag GmbH, 361, Berlin, Heidelberg, New York, 2019, S. 87 - 102.Julius Köpke: Annotation paths for matching XML-Schemas. Data and Knowledge Engineering, Elsevier B.V., 122, Amsterdam, 2019, S. 25 - 54.Johann Eder, Marco Franceschetti, Julius Köpke: Controllability of business processes with temporal variables. Proceedings of the 34th ACM/SIGAPP Symposium on Applied Computing, ACM - New York, New York, NY, 2019, S. 40 - 47.Julius Köpke, Marco Franceschetti, Johann Eder: Optimizing data-flow implementations for inter-organizational processes. Distributed and Parallel Databases, Springer Verlag GmbH, Berlin, Heidelberg, New York, 2018, S. 1 - 45.Julius Köpke, Johann Eder, Jianwen Su: GSM+T: A Timed Artifact-Centric Process Model. 25th International Symposium on Temporal Representation and Reasoning (TIME 2018), Schloss Dagstuhl - Leibniz-Zentrum für Informatik, 120, Dagstuhl, 2018, S. 1 - 15.Filipe Moutinho, Luis Paiva, Julius Köpke, Pedro Maló: Extended Semantic Annotations for Generating Translators in the Arrowhead Framework. IEEE Transactions on Industrial Informatics ",
  "content_length": 21716,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:51"
}