{
  "name": "Julie A. Kientz",
  "homepage": "http://faculty.washington.edu/jkientz",
  "status": "success",
  "content": "Julie Kientz – Professor, University of Washington Skip to content Julie A. Kientz (pronounced like “Keentz”) is a Professor and Chair of the department of Human Centered Design & Engineering at the University of Washington. She directs the Computing for Healthy Living and Learning Lab, is active in the Design, Use, Build (dub) alliance, and has adjunct appointments in The Information School and Computer Science & Engineering. Dr. Kientz’s primary research areas are in the fields of Human-Computer Interaction, Health Informatics, Ubiquitous Computing, and Interaction Design & Children. Her research focuses on understanding and reducing the user burdens of interactive technologies for health, education, and families through the design of future applications. Her primary research methods involve human-centered design, technology development, and a mix of qualitative and quantitative methods. She has designed, developed, and evaluated mobile, sensor, and social applications for numerous areas in the health, education, and family domains. The populations she has designed with in her research include individuals and families managing sleep health, parents of young children monitoring developmental progress, families managing screen time and remote learning, adolescents managing stress, and inclusive education teachers and therapists working with neurodiverse children. Dr. Kientz received her Ph.D. in Computer Science from the Georgia Institute of Technology in 2008. She was awarded a National Science Foundation CAREER Award, named an MIT Technology Review Innovator Under 35 award, named an ACM Distinguished Member, inducted to the CHI Academy, and is the only faculty member in the UW College of Engineering to receive both the Faculty Research Innovator and Teaching Innovator awards. Her research has been featured in a number of media outlets, including the NY Times, Parent magazine, the Atlantic, Geekwire, Time magazine, ABC News, and USA Today. Updates Due to the uncertainty of the research funding landscape, I will not be taking on any new Ph.D. students for the Fall 2026 admissions cycle. I also have no available postdoc funding at this time. I will not be responding to emails inquiring about Ph.D. admissions or postdoc opportunities. Please advocate for science funding! I was honored to be inducted to the CHI Academy in 2024! For the next 5 years, I’ll be serving as co-PI and UW lead on the NSF and IES $20 million AI Institute for Exceptional Education, hosted at the University of Buffalo, where we will be transforming education for children with speech and language processing challenges I am excited to be the UW lead on the Jacob’s Foundation-funded Connecting the EdTech Research EcoSystem (CERES) Center, hosted by UC Irvine. I’m currently serving as Department Chair of UW’s Human Centered Design & Engineering and look forward to leading the department for a five year term (2020-2025). In HCDE, we thrive at the critical junction of research, education, and community to cultivate equity, access, and opportunity. With these values in mind, I’d like to acknowledge that we educate future human-centered designers and researchers on the unceded lands of the Duwamish and Coast Salish people, who are still here, honoring their ancestral heritage. Contact Email: jkientz@uw.edu Office: Sieg Hall, Room 428 Campus Box: 352315 Office Phone: 206-221-0614 Web: http://juliekientz.com Twitter: @juliekientz Pronouns: she/her Administrative Assistant: Stacia Green, greens6@uw.edu",
  "content_length": 3525,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:40"
}