{
  "name": "Julia Stoyanovich",
  "homepage": "http://stoyanovich.org",
  "status": "success",
  "content": "Julia Stoyanovich - Home Toggle navigation Julia Stoyanovich Home Projects Students Publications Teaching Funding & Awards Service CV Bio I’m an Associate Professor in the Department of Computer Science and Engineering at the Tandon School of Engineering, and the Center for Data Science, New York University. I also direct the NYU Tandon Center for Responsible AI, NYU R/AI, and am a member of Visualization and Data Analytics Research Center, VIDA. My research focuses on responsible data management and analysis: on operationalizing fairness, diversity, transparency, and data protection in all stages of the data acquisition and processing lifecycle. I established the Data, Responsibly consortium, and served on the New York City Automated Decision Systems Task Force, by mayoral appointment. In addition to data ethics, I work on management and analysis of preference data, and on querying large evolving graphs. I received my M.S. and Ph.D. degrees in Computer Science from Columbia University, and a B.S. in Computer Science and in Mathematics and Statistics from the University of Massachusetts at Amherst. Research My research is in the area of data and knowledge management. Data, Responsibly: ethical data management and analysis DB4Pref: management and analysis of preference data Portal: management and analysis of evolving graphs Having graduated from college, I spent 5 years in the start-up industry, as a software developer, data architect and database administrator. This experience has motivated me to work with real datasets whenever possible, and to deliver results of my research to the communities of target users, as part of open-source systems or as stand-alone prototypes. Contact Email: stoyanovich@nyu.edu Offices: Room 703, Center for Data Science, 60 5th Ave, New York, NY, 10011. Map Room 1101, 370 Jay Street, Brooklyn, NY, 11201. Map News July 2, 2021Temoral Regular Path Queries, with Marcelo Arenas and Pedro Bahamondes, is now available on arXiv July 1, 2021Impact Remediation - Optimal Interventions to Reduce Inequality, with Lucius Bynym and Josh Loftus, is now available on arXiv June 15, 2021Fairness as Equality of Opportunity - Normative Guidance from Political Philosophy, with Falaah Arif Khan and Eleni Manis, is now availalbe on arXiv May 12, 2021Fairness in Ranking - A Survey, with Meike Zehlike and Ke Yang, is now availalbe on arXiv ... see all News © 2018 Julia Stoyanovich. Site made with Jekyll and theme AllanLab.",
  "content_length": 2469,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:08"
}