{
  "name": "Julian Padget",
  "homepage": "http://www.bath.ac.uk/comp-sci/contacts/academics/julian_padget",
  "status": "success",
  "content": "Julian Padget - the University of Bath's research portal View Scopus Profile Julian Padget Dr Reader, Department of Computer ScienceEPSRC Centre for Doctoral Training in Statistical Applied Mathematics (SAMBa)Water Innovation and Research Centre (WIRC) UKRI CDT in Accountable, Responsible and Transparent AICentre for Therapeutic InnovationArtificial Intelligence and Machine LearningIAAPSInnovation BridgeInstitute for Digital Security and Behaviour (IDSB) https://orcid.org/0000-0003-1314-2094 Phone+44 (0) 1225 386971EmailJ.A.Padgetbath.acuk 1 WEST 4.65 Accepting Doctoral Students Personal profile Research interestsmultiagent systems; agent architecture; agent-based simulation; norm represesntation and reasoning; distributed ledgers; fusing symbolic and statistical AI; policy modelling; security and privacy; models of narrative; Teaching interestscompilers; intelligent agents; software engineering;Other responsibilitiesoutreach and widening participation; exchanges;Willing to supervise doctoral studentssee areas listed in research interests above. Fingerprint Dive into the research topics where Julian Padget is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Multi Agent Systems Computer Science 100% Answer Set Programming Computer Science 73% Web Service Computer Science 72% Case Study Computer Science 68% Normative Framework Computer Science 50% Artificial Intelligence Computer Science 43% Computational Modeling Computer Science 35% Use Case Computer Science 35% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects 1 Curtailed 1 Active 16 Finished Projects per year AI Powered Agile Energy Network Operation and Investment FS submission requirementsTaylor, P. (PI), Li, F. (CoI), Padget, J. (CoI) & Şimşek, Ö. (CoI)Engineering and Physical Sciences Research Council1/10/25 → 31/03/26Project: Research council EPSRC - IAA - CEN Working Group meeting in Vienna August 2025Padget, J. (PI)Engineering and Physical Sciences Research Council22/07/25 → 30/08/25Project: Research council A model and architecture for multi-context, value-aware agentsDe Vos, M. (PI) & Padget, J. (PI)1/06/23 → 1/03/24Project: Other Explicit Representation 100% Decision-Making 100% Decision-Making Process 100% Innovate UK with BBFCPadget, J. (PI), Kyprianou, A. (CoI) & Namboodiri, V. (CoI)Innovate UK, Innovate UK Business Connect1/07/22 → 31/12/23Project: Central government, health and local authorities Statutory Requirement 100% Data Classification 100% Video-on-Demand 100% Online Media 100% Amazon Web Services 100% NERC growing roots with Easton Data GardenMcCullen, N. (PI) & Padget, J. (PI)Natural Environment Research Council5/11/21 → 25/03/22Project: Research council View all 18 projects Research output 170 Chapter in a published conference proceeding 57 Article 7 Book 6 Paper 20 More 4 Book chapter 3 Other report 3 Editorial 2 Other 2 Poster 2 Conference article 2 Working paper 1 Commissioned report 1 Abstract Research output per year Research output per year Do we need a data sharing infrastructure for the energy sector?Li, F., Turvey, N., Dale, L., Scott, J., Padget, J., Flower, I., Fitzpatrick, J. R., Ostler, N., Oldaker, R. & Yeo, S., 31 Jan 2025, In: IET Smart Grid. 8, 1, e12196.Research output: Contribution to journal › Article › peer-review Open Access Clean Energy 100% United Kingdom 100% Renewable Energy 100% Data Sharing 100% Minimum Viable Product 66% Open data for modelling the impacts of electric vehicles on UK distribution networks: Opportunities for a digital spineFlower, I., Li, F. & Padget, J., 31 Dec 2024, In: IET Smart Grid. 7, 6, p. 983-999 17 p.Research output: Contribution to journal › Article › peer-review Open Access Electric Vehicle 100% Distribution Network 100% Open Data 100% United Kingdom 100% Renewable Energy 100% Spatial Functional Mapping of Hypoxia Inducible Factor Heterodimerisation and Immune checkpoint regulators in clear cell Renal Cell CarcinomaSafrygina, E., Applebee, C., McIntyre, A., Padget, J. & Larijani, B., 9 Feb 2024, In: BJC Reports. 11 p., 10.Research output: Contribution to journal › Article › peer-review Open Access Transcription Factors 100% Energy Transfer 100% Protein Expression 100% Fluorescence Resonance Energy Transfer 100% Immune Checkpoints 100% Addressing the Value Alignment Problem through Online InstitutionsNoriega, P., Verhagen, H., Padget, J. & d'Inverno, M., 20 Dec 2023, Coordination, Organizations, Institutions, Norms, and Ethics for Governance of Multi-Agent Systems 16 - 27th International Workshop, COINE 2023, Revised Selected Papers: 27th International Workshop, COINE 2023, London, U. K., May 29, 2023. Revisied Selected Papers. Fornara, N., Cheriyan, J. & Mertzani, A. (eds.). Cham, Switzerland: Springer, p. 77-94 18 p. (Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics); vol. 14002 LNAI).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Open Access Multiagents 100% Artificial Intelligence 100% multi-agent 100% 3 Citations (SciVal) Agent-directed runtime norm synthesisMorris-Martin, A., De Vos, M., Padget, J. & Ray, O., 2 Jun 2023, Proceedings of the 22nd International Conference on Autonomous Agents and Multiagent Systems. International Foundation for Autonomous Agents and Multiagent Systems (IFAAMAS), Vol. 2023. p. 2271-2279 9 p. (Proceedings of the International Joint Conference on Autonomous Agents and Multiagent Systems, AAMAS).Research output: Chapter or section in a book/report/conference proceeding › Chapter in a published conference proceeding Open Access Case Study 100% Machine Learning 100% Specification Language 100% Special Purpose 100% Technical System 100% 2 Citations (SciVal) View all 260 research outputs Datasets Dataset for 'How smart do smart meters need to be?'Mogles, N. (Creator), Walker, I. (Creator), Ramallo-González, A. (Creator), Lee, J. (Creator), Natarajan, S. (Creator), Padget, J. (Creator), Gabe-Thomas, E. (Creator), Hyniewska, S. (Creator), Lovett, T. (Creator), Ren, G. (Creator), O'Neill, E. (Creator), Hourizi, R. (Creator) & Coley, D. (Creator), University of Bath, 1 Oct 2016DOI: 10.15125/BATH-00256Dataset ENLITEN - A dataset and its associated analysis code for the paper entitled \"Designing sensor sets for capturing energy events in buildings\"Lee, J. (Creator), Gabe-Thomas, E. (Creator), Lovett, T. (Creator), Padget, J. (Creator), Natarajan, S. (Creator) & Coley, D. (Creator), University of Bath, 1 Oct 2016DOI: 10.15125/BATH-00241Dataset Dataset for \"Touché: Data-Driven Interactive Sword Fighting in Virtual Reality\"Dehesa, J. (Creator), Vidler, A. (Supervisor), Lutteroth, C. (Supervisor) & Padget, J. (Supervisor), University of Bath, 6 Jan 2020DOI: 10.15125/BATH-00754Dataset Dataset for \"A Novel Neural Network Architecture with Applications to 3D Animation and Interaction in Virtual Reality\"De La Dehesa Cueto-Felgueroso, J. (Creator), Padget, J. (Supervisor), Lutteroth, C. (Supervisor) & Vidler, A. (Supervisor), University of Bath, 20 Nov 2020DOI: 10.15125/BATH-00752Dataset Activities 1 Giving evidence or preparing policy briefs 1 External examination Activities per year Evidence to Parliamentary CommitteePadget, J. (No value)26 Mar 2025Activity: Knowledge Exchange (Industry, Government, NGOs) › Giving evidence or preparing policy briefs external examiner PhDPadget, J. (Examiner)2024Activity: External examination and supervision › External examination",
  "content_length": 7924,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:24"
}