{
  "name": "Julie Greensmith",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/julie.greensmith",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Julie GreensmithLecturer, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom B34 Computer ScienceJubilee CampusWollaton RoadNottinghamNG8 1BBUKwork0115 84 67663julie.greensmith@nottingham.ac.ukhttp://www.cs.nott.ac.uk/~jqg Recent Publications GU, F., GREENSMITH, J. and AICKELIN, U., 2012. Theoretical formulation and analysis of the deterministic dendritic cell algorithm Biosystems. 111(2), 127-135FENG GU, JAN FEYEREISL, ROBERT OATES, JENNA REPS, JULIE GREENSMITH and UWE AICKELIN, 2011. Quiet in Class: Classification, Noise and the Dendritic Cell Algorithm. In: G. NICOSIA ET AL, ed., Proceedings of the 10th International Conference on Artificial Immune Systems LNCS 6825. Springer-Verlag. 173-186GREENSMITH, J., AICKELIN, U. and TEDESCO, G., 2010. Information fusion for anomaly detection with the dendritic cell algorithm Information Fusion. 11(1), 21-34JULIE GREENSMITH, UWE AICKELIN and YOUSOF AL-HAMMADI, 2010. Performance Evaluation of DCA and SRC on a Single Bot Detection Journal of Information Assurance and Security. 5(1), 265-275 View all publications GU, F., GREENSMITH, J. and AICKELIN, U., 2012. Theoretical formulation and analysis of the deterministic dendritic cell algorithm Biosystems. 111(2), 127-135FENG GU, JAN FEYEREISL, ROBERT OATES, JENNA REPS, JULIE GREENSMITH and UWE AICKELIN, 2011. Quiet in Class: Classification, Noise and the Dendritic Cell Algorithm. In: G. NICOSIA ET AL, ed., Proceedings of the 10th International Conference on Artificial Immune Systems LNCS 6825. Springer-Verlag. 173-186GREENSMITH, J., AICKELIN, U. and TEDESCO, G., 2010. Information fusion for anomaly detection with the dendritic cell algorithm Information Fusion. 11(1), 21-34JULIE GREENSMITH, UWE AICKELIN and YOUSOF AL-HAMMADI, 2010. Performance Evaluation of DCA and SRC on a Single Bot Detection Journal of Information Assurance and Security. 5(1), 265-275GREENSMITH, J., AICKELIN, U. and FEYEREISL, J., 2008. The DCA: SOMe comparison: a comparative study between two biologically-inspired algorithms Evolutionary Intelligence. 1(2), 85-112GREENSMITH, J. and AICKELIN, U., 2008. The deterministic dendritic cell algorithm. In: BENTLEY, P., LEE, D. and JUNG, S., eds., Artificial immune systems: 7th international conference, ICARIS 2008, Phuket, Thailand, August 10-13, 2008 : proceedings Springer. 291-302KIM, J., BENTLEY, P. J., AICKELIN, U., GREENSMITH, J., TEDESCO, G. and TWYCROSS, J., 2007. Immune system approaches to intrusion detection – a review NATURAL COMPUTING. VOL 6(NUMBER 4), 413-466OATES, R., GREENSMITH, J., AICKELIN, U., GARIBALDI, J. and KENDALL, G., 2007. The Application of a Dendritic Cell Algorithm to a Robotic Classifier LECTURE NOTES IN COMPUTER SCIENCE. NUMB 4628, 204-215GREENSMITH, J., 2007. The Dendritic Cell Algorithm At: PhD Thesis, University of Nottingham, 2007GREENSMITH, J., AICKELIN, U and , 2007. DCA for SYN scan detection In: Genetic and Evolutionary Computation Conference (GECCO) 2007. 49-56AICKELIN, U. and GREENSMITH, J., 2007. Sensing danger: Innate immunology for intrusion detection INFORMATION SECURITY TECHNICAL REPORT. VOL 12(NUMBER 4), 218-227GREENSMITH, J. and AICKELIN, U., 2006. Dendritic Cells for Real-Time Anomaly Detection In: Proceedings of the Workshop on Artificial Immune Systems and Immune System Modelling. 7-8GREENSMITH, J., AICKELIN, U. and TWYCROSS, J., 2006. Articulation and Clarification of the Dendritic Cell Algorithm LECTURE NOTES IN COMPUTER SCIENCE. NUMB 4163, 404-417GREENSMITH, J., TWYCROSS, J, AICKELIN, U and , 2006. Dendritic Cells for Anomaly Detection In: IEEE Congress on Evolutionary Computation. JULIE GREENSMITH, UWE AICKELIN, STEVE CAYZER, 2005. Introducing Dendritic Cells as a Novel Immune-Inspired Algorithm for Anomaly Detection In: Proceedings ICARIS-2005, 4th International Conference on Artificial Immune Systems, LNCS 3627. 153-167JUNGWON KIM, JULIE GREENSMITH, JAMIE TWYCROSS, UWE AICKELIN, 2005. Malicious Code Execution Detection and Response Immune System inspired by the Danger Theory In: Adaptive and Resilient Computing Security Workshop (ARCS-05). BENTLEY, P. J., GREENSMITH, J. and UJJIN, S., 2005. Two Ways to Grow Tissue for Artificial Immune Systems LECTURE NOTES IN COMPUTER SCIENCE. NUMB 3627, 139-152UWE AICKELIN, JULIE GREENSMITH, JAMIE TWYCROSS, 2004. Immune System Approaches to Intrusion Detection - A Review In: Proceedings of the Third International Conference 3rd International Conference on Artificial Immune Systems (ICARIS 2004). 316-329JULIE GREENSMITH, UWE AICKELIN, JAMIE TWYCROSS, 2004. Detecting Danger: Applying a Novel Immunological Concept to Intrusion Detection Systems In: 6th International Conference in Adaptive Computing in Design and Manufacture. Browser does not support script. Browser does not support script. School of Computer Science University of NottinghamJubilee CampusWollaton Road Nottingham, NG8 1BB For all enquires please visit: www.nottingham.ac.uk/enquire Legal information Copyright Terms and conditions Privacy Posting rules Accessibility Freedom of information Charity gateway Cookie policy Cookie Settings Get social Connect with the University of Nottingham through social media and our blogs. Campus maps | More contact information | Jobs",
  "content_length": 5671,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:39"
}