{
  "name": "Julian Fischer",
  "homepage": "https://ist.ac.at/research/research-groups/fischer-group",
  "status": "success",
  "content": "ISTA | Fischer Group HomeResearchFischer Group EDUCATION Graduate School Postdocs Internship and Scholarship Program VISTA Science Experiences Fischer Group Theory of Partial Differential Equations, Applied and Numerical Analysis Diverse phenomena such as the motion of fluids or elastic objects, the evolution of interfaces, or the physics of quantum-mechanical particles are described accurately by partial differential equations. The Fischer group works on the mathematical analysis of partial differential equations that arise in the sciences, connecting also to areas like numerical analysis or probability.Partial differential equations are a fundamental tool for the description of many phenomena in the sciences, ranging from the physics of continua like fluids or elastic solids over quantum mechanics to population biology. Julian Fischer and his group work on the mathematical aspects of partial differential equations. One of the group’s main themes is the mathematical justification of model simplifications: For example, an elastic material with a highly heterogeneous small-scale structure may in many cases be approximated as a homogeneous material. Likewise, a fluid with low compressibility may in many cases be approximated as ideally incompressible. To justify such approximations, the group derives rigorous estimates for the approximation error. The techniques they employ connect the analysis of PDEs with adjacent mathematical areas like numerical analysis and probability. Group Leader Julian Fischer Professor +43 2243 9000 2048 Julian.Fischer@ist.ac.at Administrative Support Birgit Oosthuizen-Noczil Assistant to Professors +43 2243 9000 2150 Birgit.Oosthuizen-Noczil@ist.ac.at Team Martin Gbur PhD Student Martin.Gbur@ist.ac.at Jonas Ingmanns PhD Student Jonas.Ingmanns@ist.ac.at Erika Kokavcová Postdoc erika.kokavcova@ist.ac.at Lauro Silini Postdoc Lauro.Silini@ist.ac.at Christian Wagner Postdoc Christian.Wagner@ist.ac.at Current Projects Effective behavior of random materials | Evolution of interfaces in fluid mechanics and solids | Fluctuating hydrodynamics and SPDEs | Entropy-dissipative PDEs Publications Hurm C, Moser M. 2025. Nonlocal‐to‐local convergence for a Cahn–Hilliard tumor growth model. GAMM-Mitteilungen. 48(2), e70003. View Hensel S, Laux T. 2025. A new varifold solution concept for mean curvature flow: Convergence of  the Allen-Cahn equation and weak-strong uniqueness. Journal of Differential Geometry. 130, 209–268. View Cornalba F, Fischer JL. 2025. Multilevel Monte Carlo methods for the Dean–Kawasaki equation from fluctuating hydrodynamics. SIAM Journal on Numerical Analysis. 63(1), 262–287. View Agresti A, Hieber M, Hussein A, Saal M. 2025. The stochastic primitive equations with nonisothermal turbulent pressure. Annals of Applied Probability. 35(1), 635–700. View Clozeau N, Mattesini F. 2024. Annealed quantitative estimates for the quadratic 2D-discrete random matching problem. Probability Theory and Related Fields. 190, 485–541. View View All Publications ReX-Link: Julian Fischer Career Since 2022 Professor, Institute of Science and Technology Austria (ISTA)2017 – 2022 Assistant Professor, Institute of Science and Technology Austria (ISTA)2014 – 2016 Postdoc, Max Planck Institute for Mathematics in the Sciences, Leipzig, Germany2013 – 2014 Postdoc, University of Zurich, Switzerland2013 PhD, University of Erlangen-Nürnberg, Germany Selected Distinctions 2020 ERC Starting Grant2020 ÖMG-Förderungspreis, Early-/Mid-Career-Award of the Austrian Mathematical Society2015 Dr. Körper Prize, PhD Award of the GAMM Additional Information Open Julian Fischer’s websiteGo to Mathphys Analysis Seminar websiteMathematics at ISTA Back to Top We use cookies on our website. By clicking “Technically Necessary Cookies” no other cookies than cookies that are technically necessary to enable various functionalities of the website (e.g. provide access to the website, display of cookie banner) are enabled. However, you may go to \"Cookie Settings\" to provide a controlled consent.Read more...Cookie SettingsAccept AllTechnically Necessary CookiesManage cookies Close Privacy Overview This website uses cookies. Below you can provide individual consent regarding the use of cookies. Cookies under the category \"necessary\" are always enabled since they are technically necessary to access the website. You can find more information on the use of cookies in the data protection statement of ISTA Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website. CookieDurationDescriptioncookielawinfo-checkbox-analytics1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-necessary1 yearThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".CookieLawInfoConsent1 yearThis cookie only appears if you makes changes to the categories (e.g disable the category “Analytics”).pll_language1 yearThe ISTA website is a multilingual website, WordPress requires a default language to be selected and set by a cookie in order to display the website, which is recorded by the pll_language cookie by Polylang. Furthermore this cookie is also used to remember the language selected by the user when returning to the website.viewed_cookie_policy1 yearThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. CookieDurationDescription_pk_id*13 monthsMatomo tracking cookie stores a unique user id._pk_ses*13 monthsMatomo tracking cookie stores a unique session id. SAVE & ACCEPT Powered by",
  "content_length": 6086,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:15"
}