{
  "name": "Julián Garcia",
  "homepage": "https://research.monash.edu/en/persons/julian-garcia-gallego",
  "status": "success",
  "content": "Julian Garcia Gallego - Monash University Julian Garcia Gallego public CV View Scopus Profile Julian Garcia Gallego Assoc Professor Associate Professor, Department of Data Science & AI https://orcid.org/0000-0001-9639-489X EmailJulian.Garciamonashedu 20032025 Research activity per year Personal profile BiographyDr Julian Garcia is a Senior Lecturer at the Faculty of Information Technology, Monash University. He is interested in understanding how agents can learn to cooperate in natural and artificlal settings. Related Links: Julian Garcia Julian GarciaMonash teaching commitmentDr Julian Garcia has experience as the Chief Examiner for the following units in the Faculty of IT: FIT1008/FIT2085 Introduction to computer scienceFIT1016/FIT2044 Advanced project level 1FIT1029 Algorithmic problem solvingFIT2082 Research project 2FIT4012 Advanced topics in computational science Julian has experience as the Lecturer for the following units in the Faculty of IT: FIT1008/FIT2085 Introduction to computer scienceFIT1016/FIT2044 Advanced project level 1FIT1029 Algorithmic problem solvingFIT2082 Research project 2FIT4012 Advanced topics in computational science Expertise related to UN Sustainable Development Goals In 2015, UN member states agreed to 17 global Sustainable Development Goals (SDGs) to end poverty, protect the planet and ensure prosperity for all. This person’s work contributes towards the following SDG(s): Education/Academic qualificationEconomics / Game Theory, Doctor of Philosophy, Vrije Universiteit Amsterdam (VU University)Award Date: 29 Jun 2011Computer Science and Computer Engineering, Ingeniero de Sistemas y Computación, Universidad Nacional de Colombia (National University of Colombia)Award Date: 2 Apr 2004 Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Projects Projects per year 2015 2015 2018 2020 2025 4 Finished Projects per year A game theoretic approach to evolving and analysing mechanism design in WESAleti, A. (Primary Chief Investigator (PCI)), Garcia Gallego, J. (Chief Investigator (CI)) & Chun Yong, C. (Chief Investigator (CI))Facebook, Inc. (United States of America)1/10/20 → 30/09/21Project: Research Modelling collective behaviour to protect social insect ecosystem servicesMeyer, B. (Primary Chief Investigator (PCI)), Burd, M. (Chief Investigator (CI)), Garcia Gallego, J. (Chief Investigator (CI)), Traulsen, A. (Partner Investigator (PI)) & Offenberg, J. (Partner Investigator (PI))9/02/18 → 31/08/22Project: Research Efficient computation of evolutionary dynamics in finite populationsGarcia Gallego, J. (Primary Chief Investigator (PCI)) & Traulsen, A. (Chief Investigator (CI))Group of Eight Limited1/01/15 → 31/12/16Project: Research Governing the knowledge commonsHandfield, T. (Primary Chief Investigator (PCI)), Levy, N. (Chief Investigator (CI)), Garcia Gallego, J. (Chief Investigator (CI)) & Simpson, R. M. (Partner Investigator (PI))1/07/19 → 30/06/25Project: Research Research output Research output per year 2003 2012 2019 2021 2025 2025 23 Article 14 Conference Paper 1 Chapter (Book) 1 Paper 2 More 1 Comment / Debate 1 Letter Research output per year Research output per year Age polyethism can emerge from social learning: A game-theoretic investigationKhajehnejad, M., García, J. & Meyer, B., 25 Aug 2025, In: PLoS Computational Biology. 21, 8, 22 p., e1013415.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Learning to cooperate against ensembles of diverse opponentsPerera, I., de Nijs, F. & García, J., 7 Jan 2025, In: Neural Computing and Applications. 15 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile Picking strategies in games of cooperationGarcía, J. & Traulsen, A., 24 Jun 2025, Proceedings of the National Academy of Sciences of the United States of America 2025. Madhushani Sehwag, U., B. Plotkin, J., Traulsen, A. & Tuyls, K. (eds.). 25 ed. Washington DC USA: National Academy of Sciences, Vol. 122. 10 p. e2319925121. (Proceedings of the National Academy of Sciences of the United States of America).Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Open AccessFile 1 Citation (Scopus) Repeated games with partner choiceGraser, C., Fujiwara-Greve, T., García, J. & Van Veelen, M., 4 Feb 2025, In: PLoS Computational Biology. 21, 2, 19 p., e1012810.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 1 Citation (Scopus) Academic Journals, Incentives, and the Quality of Peer Review: A ModelZollman, K. J. S., García, J. & Handfield, T., 1 Jan 2024, In: Philosophy of Science. 91, 1, p. 186-203 18 p.Research output: Contribution to journal › Article › Research › peer-review Open AccessFile 2 Citations (Scopus) View all 41 research outputs",
  "content_length": 5136,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:48"
}