{
  "name": "Julia Woodward",
  "homepage": "https://juliawoodward.wordpress.com",
  "status": "success",
  "content": "Julia Woodward – Professional Achievements and Information Skip to content I am excited to announce that I have joined University of South Florida as an Assistant Professor in the Department of Computer Science and Engineering! I earned a Ph.D. in Human-Centered Computing from the University of Florida, and I was a National Science Foundation Graduate Research Fellow. I previously received a B.S. in Digital Arts and Science in 2017 from the University of Florida. I am the creator and director of The Engaging Computing Design (EnCoDe) Research Lab. My research lies in the field of human-computer interaction (HCI), which focuses on comprehending how people use and conceptualize technology in order to design more effective experiences. My main research interests include designing visual information in augmented reality (AR) headsets for both adults and children, and understanding how children think about and use technology. My goal is to design technology that better supports human endeavors, especially for underrepresented populations such as children. Research Areas: human-computer interaction, natural user interfaces, augmented reality, child-computer interaction Click here to view my CV:  Julia-Woodward-CV (Updated: 01/2025) Recent Tweets (Check out @JuliaWoodward94 for more): Excited to be at #IDC2024! Presenting our EnCoDe Lab work on “Are you smart?”: Children’s Understanding of “Smart” Technologies @IDC_ACM pic.twitter.com/He6K80oscd— Julia Woodward, Ph.D. (@JuliaWoodward94) June 18, 2024 Honored to have received a Certificate of Excellence from the USF Office of High Impact Practices and Undergraduate Research for the work I do in mentoring and supporting undergraduate students in research! @USFResearch @EngineeringUSF pic.twitter.com/rwohP9YfIC— Julia Woodward, Ph.D. (@JuliaWoodward94) May 3, 2024 Excited to be speaking about my research next Friday at the USF CNS Colloquium! Come check it out (PCD1134 1:15 pm)! @EngineeringUSF @cseUSF @USFResearch pic.twitter.com/z5OtbQafmg— Julia Woodward, Ph.D. (@JuliaWoodward94) September 15, 2023 Was fortunate to be a part of @XRAssociation and @CooneyCenter’s forum on exploring XR in education, and the report is now available about all of the discussions! Check it out! https://t.co/NASFLtGX8o— Julia Woodward, Ph.D. (@JuliaWoodward94) June 20, 2023 Subscribe Subscribed Julia Woodward Sign me up Already have a WordPress.com account? Log in now. Julia Woodward Subscribe Subscribed Sign up Log in Report this content View site in Reader Manage subscriptions Collapse this bar",
  "content_length": 2561,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:07"
}