{
  "name": "Julia Hirschberg",
  "homepage": "http://www.cs.columbia.edu/~julia",
  "status": "success",
  "content": "Julia Hirschberg Welcome Julia Hirschberg is Percy K. and Vida L. W. Hudson Professor of Computer Science and was Chair of the Computer Science Department at Columbia University from 2012-2018. She received her PhD in Computer Science from the University of Pennsylvania.  She worked at Bell Laboratories and AT&T Laboratories -- Research from 1985-2003 as a Member of Technical Staff and a Department Head, creating the Human-Computer Interface Research Department.   She served as editor-in-chief of Computational Linguistics from 1993-2003 and co-editor-in-chief of Speech Communication from 2003-2006 and is now on the Editorial Board. She was on the Executive Board of the Association for Computational Linguistics (ACL) from 1993-2003, on the Permanent Council of International Conference on Spoken Language Processing (ICSLP) since 1996, and on the board of the International Speech Communication Association (ISCA) from 1999-2007 (as President 2005-2007, Advisory Council 2007--), on the Executive Board of the Computing Research Association from 2013-2014, on the AAAI Council from 2012-2015, and the Executive Board of the North American Chapter of the ACL, 2012-2015, and on the IEEE Speech and Language Processing Technical Committee from 2011-2018. She co-chaired the CRA's Committee on Women (CRA-WP)  from 2016--2019 and served as board member 2009-2022. She has been active in working for diversity at AT&T and at Columbia. She has been a AAAI fellow since 1994, an ISCA Fellow since 2008, a (founding) ACL Fellow since 2011, an ACM Fellow since 2015, an IEEE Fellow since 2017, a member of the National Academy of Engineering since 2017, a member of the American Academy of Arts and Sciences since 2018, and the National Academy of Artificial Intelligence (NAAI) Academy of Sciences in 2025 from which she received the Artificial Intelligence Exploration Award. She was elected to the American Philosophical Society in 2014 and as an Honorary Member of the Association for Laboratory Phonology in the same year. She has received honorary doctorates from the Royal Institute of Technology (KTH) Stockholm in 2007 and from Tilburg University in the Netherlands in 2018, a Columbia Engineering School Alumni Association (CESAA) Distinguished Faculty Teaching Award in 2009 and the Janette and Armen Avanessians Diversity Award in 2018. She received the IEEE James L. Flanagan Speech and Audio Processing Award in 2011, the ISCA Medal for Scientific Achievement in 2011, and received the ISCA Special Service medal in 2020. She was selected as the Fillmore Professor at the LSA Summer Institute in 2017. She was an Amazon Scholar (2020-2025), Julia Hirschberg Percy K. and Vida L. W. Hudson Professor of Computer Science Office Hours: By appointment. julia at cs dot columbia dot edu Lab: Columbia Speech Lab Columbia University Department of Computer Science 500 West 120th St, Rm 450 Mail Code:0401 New York, NY 10027-7003 phone: (212) 853-8464 fax: (212) 853-8440 Download CV Fall 2025: Advanced Spoken Language Processing",
  "content_length": 3038,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:08"
}