{
  "name": "Julia Chuzhoy",
  "homepage": "http://ttic.uchicago.edu/~cjulia",
  "status": "success",
  "content": "Julia Chuzhoy Julia Chuzhoy Manuel Blum Professor Toyota Technological Institute at Chicago Professor (part time) Department of Computer Science, University of Chicago Address: 6045 S. Kenwood Ave., Chicago IL 60637 Email: cjulia@ttic.edu Toyota Technological Institute at Chicago is a research and educational institution, located on the University of Chicago campus. We have a Ph. D. program, and we are looking for prospective theory students. We also have a summer internship program, and we are interested in strong theory students, especially in the areas of algorithms and complexity. Please apply here if you are interested. Brief Bio  -  Research Interests  - CV Publications Talk Slides, Videos and Presentations Teaching  -  Ph.D. Students  - Past Summer Interns Other Professional Activities Brief Bio I am a Manuel Blum Professor at the Toyota Technological Institute at Chicago. I also hold a part-time Professor appointment at the Department of Computer Science at the University of Chicago. I have completed my Ph.D. at the Computer Science Department at the Technion, with Seffi Naor as my advisor. I have spent three years as a postdoc: at MIT (with Piotr Indyk and Madhu Sudan as my hosts), at the University of Pennsylvania, (host: Sanjeev Khanna) and at the Institute for Advanced Study in Princeton (Avi Wigderson's group). I have spent a great year in 2018-2019 as a Weston visiting professor in the Department of Computer Science and Applied Mathematics at the Weizmann Institute of Science. My CV is here. Research interests My broad research interest is in theoretical computer science, with the main focus on graph-related optimization problems. More specifically, I am interested in approximation algorithms, dynamic algorithms, fast algorithms for central graph-related problems, and (algorithmic) graph theory. I am also interested in studying lower bounds, such as, for example, hardness of approximation proofs. My research is or was supported by NSF Career award, Alfred P. Sloan research fellowship, NSF grants CCF-1318242, CCF-1616584, CCF-2006464 and CCF-2402283, and NSF HDR TRIPODS award 2216899. Teaching Fall 2023: TTIC 31080 and CMSC 37503: Approximation Algorithms Winter 2023: TTIC 31010 and CMSC 37000: Algorithms Fall 2021: TTIC 31080 and CMSC 37503: Approximation Algorithms Winter 2021: TTIC 31010 and CMSC 37000: Algorithms Fall 2019: TTIC 31080 and CMSC 37503: Approximation Algorithms Winter 2018: TTIC 31080 and CMSC 37503: Approximation Algorithms Winter 2017: TTIC 31010 and CMSC 37000: Algorithms Spring 2016: TTIC 31080 and CMSC 37503: Approximation Algorithms Winter 2015: TTIC 31010 and CMSC 37000: Algorithms Spring 2014: TTIC 31080 and CMSC 37503: Approximation Algorithms Winter 2013: TTIC 31010 and CMSC 37000: Algorithms Spring 2012: TTIC 31080 and CMSC 37503: Approximation Algorithms Winter 2011: TTIC 31010 and CMSC 37000: Algorithms Winter 2010: CMSC 37100: Approximation Algorithms Winter 2009: CMSC 37100: Approximation Algorithms Students Ron Mosenzon (TTIC) Rachit Nimavat (TTIC). Expected graduation: Summer 2023 Zihan Tan (University of Chicago; co-supervised with Laci Babai). Graduated Spring 2022. David H. K. Kim (University of Chicago; co-supervised with Laci Babai). Graduated spring 2018. Parinya Chalermsook (University of Chicago; co-supervised with Janos Simon). Graduated summer 2012. Now: Faculty at the Department of Computer Science, Aalto University, Finland. Past Summer Interns Gary Hoppenworth (University of Michigan; co-mentored with Ohad Trabelsi) - 2024. Rhea Jain (UIUC; co-mentored with Ohad Trabelsi) - 2023. Mina Dalirrooyfard (MIT; co-mentored with Yury Makarychev) - 2019. Jason Li (CMU; co-mentored with Yury Makarychev) - 2019. Zihan Tan (U. of Chicago) - 2017. Ali Vakilian (MIT) - 2017. Aravind Gollakota (Cornell; co-mentored with Madhur Tulsiani) - 2017. Sepideh Mahabadi (MIT; co-mentored with Yury Makarychev) - 2016. Vivek Madan (UIUC) - 2016 Josh Kaplan (U. of Chicago) - 2015 David H.K. Kim (U. of Chicago) - 2014, 2015 Euiwoong Lee (CMU; co-mentored with Yury Makarychev) - 2014 David Witmer (CMU; co-mentored with Yury Makarychev) - 2014 Rajesh Chitnis (U. Maryland) - 2013 Siyu Yang (Princeton) - 2013 Alina Ene (UIUC) - 2011, 2012 Shi Li (Princeton) - 2011 Aravindan Vijayaraghavan (CMU) - 2010 (co-mentored with Yury Makarychev) Yuan Zhou (CMU) - 2010 (co-mentored with Yury Makarychev) Mohammad Hossein Bateni (Princeton) - 2009 Deeparnab Chakrabarty (Georgia Tech) - 2008 Other Professional Activities Program committees: APPROX 2005, APPROX 2007, FOCS 2007, APPROX 2008, FOCS 2010, APPROX 2011, ITCS 2013, STOC 2013, FOCS 2014, Highlights of Algorithms 2016, STOC 2020 (PC chair). Editor of the SICOMP Special Issue for FOCS 2014. Editorial boards (past and present): Algorithmica, SICOMP. Member of the SODA and ITCS steering committees. Member of the SIGACT Research Highlights Committee.",
  "content_length": 4909,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:07"
}