{
  "name": "Julien Lange",
  "homepage": "https://pure.royalholloway.ac.uk/portal/en/persons/julien-lange(55a85423-9481-4565-9339-224891092d5e).html",
  "status": "success",
  "content": "Julien Lange - Royal Holloway Research Portal Julien Lange Dr Centre for Programming Languages and SystemsSenior Lecturer in Computer Science, Department of Computer Science https://orcid.org/0000-0001-9697-1378 Phone+44 1784 443694EmailJulien.Langerhul.acuk TW20 0EX Personal profile Research interestsMy research interests are centred on developing mathematically rigorous theories and tools to support software practitioners in specifying, designing, maintaining and implementing concurrent and distributed programs. I currently work on the following topics: Relationships between session types and automata theories: session types are a type discipline for concurrent programs (typing the behaviour of a program instead of its data). Session types theories relate to many other theories (e.g., model checking, communicating automata, etc). Static verification of message-passing programs. I am working on techniques to statically detect deadlocks and other issues in Go programs. Some of my papers have been nicely summarised by other people: see this post and this other post on the Morning Paper blog, as well as this blog post. Verification of GPU programs. With Tiago Cogumbreiro, we're working on behavioural-types-based techniques to verify different properties of GPU kernels (e.g., absence of data-races). I am the coordinator of the The Proofs and Programs Club @ RHUL. Recent publications Sound and partially-complete static analysis of data-races in GPU programs by Dennis Liew, Tiago Cogumbreiro, Julien Lange (OOPSLA'24)Automated Verification of Parametric Channel-Based Process Communication by Georgian-Vlad Saioc, Julien Lange, Anders Møller (OOPSLA'24)Fair Asynchronous Session Subtyping by Mario Bravetti, Julien Lange, and Gianluigi Zavattaro (Logical Methods in Computer Science)Automated verification of concurrent Go programs via bounded model checking by Nicolas Dilley and Julien Lange (Automated Software Engineering | Issue 2/2023)A model of actors and grey failures by Laura Bocchi, Julien Lange, Simon Thompson, and A. Laura Voinea (Logical Methods in Computer Science, November 22, 2023, Volume 19, Issue 4)Memory access protocols: certified data-race freedom for GPU kernels by Tiago Cogumbreiro, Julien Lange, Dennis Liew, and Hannah Zicarelli (Formal Methods in System Design, 2023). Educational backgroundBefore joining the Department of Computer Science at Royal Holloway, I was a lecturer at The University of Kent. Before that I was a Research Associate at Imperial College London, in Nobuko Yoshida's team in the project From Data Types to Session Types -- A Basis for Concurrency and Distribution. I obtained my PhD from the University of Leicester under the supervision of Emilio Tuosto, while working as a Graduate Teaching Assistant. Before moving to Leicester, I worked for a year in The Netherlands at the European Space Agency in the On-board Software Systems section, as part of the YGT programme. I am originally from Belgium, where I graduated (BSc and MSc) from the University of Namur -- Maitrise en Science Informatique, avec Grande Distinction. Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output 12 Conference contribution 10 Article 10 Conference article 1 Chapter Research output per year Research output per year Automated Verification of Parametric Channel-Based Process CommunicationSaioc, G.-V., Lange, J. & Møller, A., 8 Oct 2024, In: Proceedings of the ACM on Programming Languages. 8, OOPSLA2, p. 2070-2096 27 p., 344.Research output: Contribution to journal › Article › peer-review Open AccessFile 16 Downloads (Pure) Fair Asynchronous Session SubtypingBravetti, M., Lange, J. & Zavattaro, G., 7 Oct 2024, In: Logical Methods in Computer Science. 20, 4, p. 5:1-5:47 47 p., 5.Research output: Contribution to journal › Article › peer-review Open AccessFile 27 Downloads (Pure) Sound and partially-complete static analysis of data-races in GPU programsLiew, D., Cogumbreiro, T. & Lange, J., 8 Oct 2024, In: Proceedings of the ACM on Programming Languages. 8, OOPSLA2, p. 2434-2461 28 p., 357.Research output: Contribution to journal › Article › peer-review Open AccessFile 13 Downloads (Pure) A model of actors and grey failuresBocchi, L., Lange, J., Thompson, S. & Voinea, A. L., 22 Nov 2023, In: Logical Methods in Computer Science. 19, 4Research output: Contribution to journal › Article › peer-review Open Access Automated Verification of Concurrent Go Programs via Bounded Model CheckingDilley, N. & Lange, J., 26 Aug 2023, In: Automated Software Engineering. 30, 29.Research output: Contribution to journal › Article › peer-review Open AccessFile 36 Downloads (Pure) View all 33 research outputs",
  "content_length": 4993,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:44"
}