{
  "name": "Julie Rico Williamson",
  "homepage": "http://juliericowilliamson.com",
  "status": "success",
  "content": "Future Immersive Interaction Group | Julie R. Williamson, Lecturer in HCI Skip to primary contentSkip to secondary content The future of XR is social. There are no words for how happy I am to announce I’ve been awarded an ERC Consolidator Grant called FUSION with €1.98 million in funding to pursue my vision for the future of social XR.  FUSION proposes new techniques to fuse social signals between individuals and across realities, hypothesizing that interaction stability in XR is a signal we can measure and manipulate.  If we can make social interaction in XR feel good, it will forever change the way we connect, collaborate, and share our lives with each other. Behind every success is a long line of failures, of ideas lovingly crafted and thrown away, and many stressful days.  Every academic will tell you to keep applying and be resilient, but that is easier said than done and comes at great personal cost. In the ACM Code of Ethics and Professional Conduct, the statement that always speaks to me is “respect the work required to produce new ideas.”  When it’s crunch time with deadlines, when we’re doing peer review, and when we’re forced to work in a resource constrained environment, it can be a challenging practice to respect the work it takes to produce new ideas.  Be kind to your colleagues, be kind to anonymous peers whose work you review, and be kind to yourself. I want to celebrate today by also sharing and celebrating the failures. I’ve submitted seven rejected fellowship applications since beginning my academic career in 2014, and more rejected standard grant applications than I can count on two hands. I see a significant progression in the quality of my ideas and work over these years, but I also see the care and love that went into the early ideas, the sadness of throwing them away, and the struggle of going back to the drawing board and trying something new. As part of my dedication to open science, I am sharing here all the past fellowship proposals that led to this success, so the invisible work of failure is visible with this happy announcement. ERC Consolidator Grant 2023 – Accepted after Interview The ideas behind FUSION have been the focus of my work since my first projects using social signal processing to model behaviour around public displays in 2014. This transformed after a serendipitous connection through volunteering, where my experience in social signal processing could be applied to modelling behaviour in virtual environments. I made significant revisions to my proposal after interviewing for ERC in 2022. I learned how much more concrete and detailed the work plan needed to be, which must be balanced against clear research questions. Conceptual integrity, leading to an ambitious and single outcome, was the biggest challenge in writing this successful proposal. EPSRC Open Fellowship 2023 with Plus Component – Rejected after Interview SocialXR was another revision of the rejected 2022 ERC submission, and I was excited to add the Plus Component, which focused on open science and inclusive publication policy. The Plus Component should be an opportunity for more diverse contributions to science to be recognised, but I was frustrated with the panel feedback that my Plus Component should have only focused on my specific discipline, and should not have aspired to go beyond computing. I was very discouraged by the process around the Plus Component, and I do not think I would apply for this again or recommend others to either. ERC Consolidator Grant 2022 – Rejected after Interview FUSION was the first interview I was granted for a fellowship application. Although I was unsuccessful, I learned so much through the process and had a really good experience. In preparing for the interview, it became clear my work plan was too high level. I had a clear vision of “what” I wanted to do, but not “how.” I knew I could revise this work and make it better. I knew I was finally on the right track and really had an idea worth picking myself back up for. EPSRC Fellowship 2021 – Rejected without Interview FIX was a clear progression from the first immersive technologies proposals, but I can see that some of the ideas are still somewhat unformed and in places half-baked. I still believe in these key concepts, particularly around mediated perception and the ethics of immersion, but these ideas were not so well developed yet. ERC Starting Grant 2019 – Rejected without Interview V-Real tried to further refine the first immersive ideas, but in hindsight it’s clear there’s no core concept tying it all together yet. I threw together input techniques, my favourite concept around manipulated perception, and my track record on social acceptance into one proposal. There’s low conceptual integrity, but it was a step in the right direction. EPSRC Fellowship 2018 – Rejected without Interview SituatedVR was the beginning of my shift towards immersive technologies. The work was not well received, and I was still very new to the field. Since finishing my PhD, I had changed topics frequently, and struggled to find a good fit and establish myself in any one area. Until I found immersive technologies, which give me such intrinsic joy I’ve never looked back. ERC Starting Grant 2016 – Rejected without Interview EMIT was my first ERC Grant application, and I was still working in public displays and public interaction. This was not well received, but writing was a good exercise. EPSRC Fellowship – Rejected without Interview DIPS was my first fellowship application, and my first big application after being successful in the EPSRC First Grant Scheme. The First Grant Scheme at that time was capped at £120,000, so it was a small project. Even though I was technically “on the ladder” at this point, it would be many years until I was able to translate my First Grant Scheme success into a successful full-size grant application. Fellowship Applications History by Julie Williamson is licensed under CC BY-NC-ND 4.0 If we do not solve the challenge of maintaining stability in interpersonal relationships in XR, we will not realise the potential of social XR in the future. This talk, given at TU Delft during Prof Pablo Cesar’s Inaugural Lecture celebration, discusses my previous work and current open challenges in creating stable interpersonal realities. We have a busy CHI planned with a full papers, poster paper, and alt.chi paper published from the group this year. I’ve also been busy as Papers Chair for 2022, and looking forward to continuing this job in 2023. We evaluated a consensus seeking task in a virtual environment accessed via an HMD or a desktop PC. With colleagues from University of Glasgow, CWI, Toyota Research, and Northeastern University, we published our latest work on digital proxemics, available Open Access in the ACM DL. Code and Data are also available on GitHub. Digital Proxemics: Designing Social and Collaborative Interaction in Virtual EnvironmentsJulie R. Williamson School of Computing Science, University of Glasgow, United Kingdom ,Joseph O’Hagan School of Computing Science, University of Glasgow, United Kingdom ,John Alexis Guerra-Gomez Computer Science, Northeastern University, United States ,John H Williamson School of Computing Science, University of Glasgow, United Kingdom ,Pablo Cesar Centrum Wiskunde & Informatica (CWI), Netherlands ,David A. Shamma Toyota Research Institute, United StatesApril 2022pp 1-12 https://doi.org/10.1145/3491102.3517594 Behaviour in virtual environments might be informed by our experiences in physical environments, but virtual environments are not constrained by the same physical, perceptual, or social cues. Instead of replicating the properties of physical spaces, .. Laura will be presenting her poster on “reality anchors,” research looking at what anchors users need from reality to contextualise virtuality. “Reality Anchors”: Bringing Cues from Reality into VR on Public Transport to Alleviate Safety and Comfort ConcernsLaura Bajorunaite School of Computing Science, University of Glasgow, United KingdomStephen Brewster School of Computing Science, University of Glasgow, United Kingdom Julie R. Williamson School of Computing Science, University of Glasgow, United KingdomApril 2022pp 1-6 https://doi.org/10.1145/3491101.3519696Virtual Reality (VR) headsets have the unique capability to create private virtual content anywhere around the user, going beyond the capacities of traditional devices, but are not widely used while travelling, due to safety and comfort concerns. … Ross will be presenting his speculative project on the future of always on XR in the alt.chi track, in collaboration with the Neil McDonnell in the School of Philosophy. When Virtuality Surpasses Reality: Possible Futures of Ubiquitous XRRoss Johnstone University of Glasgow, United Kingdom ,Neil McDonnell School of Humanities, University of Glasgow, United Kingdom ,Julie R. Williamson School of Computing Science, University of Glasgow, United KingdomApril 2022pp 1-8 https://doi.org/10.1145/3491101.3516396 Is our future heading towards enhancing the human experience with computer-mediated reality? Immersive technology is unique, existing between the world and our senses, letting users traverse wholly virtual environments (i.e. distant places or fantasy … I was excited to give this talk for Professor Tony Tang at University of Toronto. In this lecture, I discuss my vision for the future of always-on immersive devices and the projects I’ve been working on for VR for social and public settings. I recently gave a talk about socialising in virtual environments for the Waterkant Festival in Kiel. I gave the talk from Mozilla Hubs, a first for me to talk about VR from VR. Although we hit a wee technical hiccup (20:18), I really enjoyed the experience and would do this again in a heartbeat. I’ve spent a lot a time lately thinking about how to improve my abilities as a meeting chair and facilitator of boardroom-style discussions. I h",
  "content_length": 19749,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:41"
}