{
  "name": "Julia Rubin-Mosin",
  "homepage": "https://www.ece.ubc.ca/faculty/julia-rubin",
  "status": "success",
  "content": "Julia Rubin - Department of Electrical and Computer Engineering Search Faculty of Applied ScienceDepartment of Electrical and Computer Engineering Home Undergraduate Admissions Programs Awards and Funding Undergraduate Teaching Assistantships Undergraduate Student Advising Peer Advisors Undergraduate Course List Capstone Opportunities Vancouver Summer Program Graduate Programs Awards and Funding Graduate Teaching Assistantships TA Access to Canvas Graduate Student Advising Graduate Course List Policies and Procedures Research Biomedical Technologies Communication Systems Computer and Software Systems Emerging Micro/Nano Technologies Energy Systems Optimization, Learning, Control People Faculty Directory Staff Directory Student Life Societies and Clubs Student Design Teams Health & Wellness Mentorship Academic Resources for Students News & Events ECE Calendar ECE News Archive Graduate Student Newsletter Archive Past Events ECE Graduate and Postdoctoral Studies Student Perspective Stories Engage with ECE Industry Partnerships Alumni Communicate with ECE EDII Suggestion Box About Head’s Message Careers Faculty Positions Staff Positions Safety in ECE Room Bookings Contact Us ECE Logos, Backgrounds, and Templates Powerpoint Templates ECE Zoom Backgrounds » Home » Julia Rubin Julia Rubin Associate Professor; Canada Research Chair in Trustworthy Software BSc and MSc (Technion), PhD (Toronto) Office: KAIS 4053Phone: (604) 827-3963Email: mjulia@ece.ubc.ca Website Publications UBC Researcher Profile Julia Rubin is an Associate Professor at the Department of Electrical and Computer Engineering at the University of British Columbia, Canada. She received her PhD in Computer Science from the University of Toronto, Canada and worked as a postdoctoral researcher at MIT, USA. She also spent almost 10 years in industry, working for IBM Research, where she was a research staff member and a research group manager. Julia’s research interests are in software engineering, program analysis, software security, and reliability of software and AI systems. Her work in these areas won five Distinguished/Best Paper Awards at major conferences such as ICST’21, ISSTA’18 and ASE’15, and was runner-up for Facebook’s Internet Defense Prize at the USENIX Security Symposium’14. Julia serves on program committees of several flagship conferences in software engineering, such as ICSE, FSE, and ASE. She co-chaired the program committees of SPLC’14, ECMFA’14, FASE’17, CASCON’20, and will co-chair the program committee of ASE in 2022. She also served as an Associate Editor for the Elsevier Journal of Systems and Software in 2018-2019, was part of the IEEE TCSE Executive Committee, and chaired several award selection committees, such as IEEE TCSE New Directions Award Committee in 2020. Research Interests software engineering; program analysis; software quality, security, and robustness; adversarial robustness, explainability, and interpretability of ML-based systems; mobile and cloud software Research Area Computer and Software Systems Research Groups Reliable, Secure, and Sustainable Software Lab (ReSeSS) Teaching CPEN 321 – Software Engineering CPEN 524 – Principles of Mobile Application Development and Analysis EECE 571J – Principles of Mobile Application Development and Analysis EECE 571J – Electrical Engineering Seminar and Special Problems – TRWTHY MCHN LRNG << Back to Faculty Department of Electrical and Computer Engineering 5500-2332 Main Mall Vancouver, BC Canada V6T 1Z4 Tel 604 822 0895 Fax 604 822 5949 Email help@ece.ubc.ca Find us on We acknowledge that the UBC Point Grey campus is situated on the traditional, ancestral, and unceded territory of the xʷməθkʷəy̓əm (Musqueam).",
  "content_length": 3710,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:10"
}