{
  "name": "Juliane Krämer",
  "homepage": "https://www.uni-regensburg.de/informatics-data-science/qpc/team/prof-dr-juliane-kraemer/index.html",
  "status": "success",
  "content": "Homepage of the Faculty of Informatics and Data Science - Universität Regensburg Skip to main content About the FIDS The FIDS (Faculty of Informatics and Data Science) combines research and teaching in the fields of computer scientists, data science, and artificial intelligence at the University of Regensburg. Latest news 2025 FIDS Award for Exceptional Engagement Given News | 19.11.2025 Informatics and Data Science| Awards| Findings Paper at EMNLP 2025 News | 10.11.2025 Informatics and Data Science| Research| Publication| Regensburg Capture The Flag Competition News | 24.10.2025 Informatics and Data Science| Event| all news The FIDS Profile, structure, bodies & Co. Study at the FIDS Study programs, study organization & Co. Research at the FIDS Research focuses, achievements & Co. Are you looking for a study program in the field of IT? Then you've come to the right place! From big data and artificial intelligence to human-computer interaction - our wide range of computer science-related degree programs covers all key future topics in the field of computer science. This sounds interesting? Take a closer look at all our degree programs! Information event (external link, opens in a new window) for incoming Master's students in “Computer Science”, “Data Science” & “Human-Centred AI” Sep 22, 2025, 15:00–17:00 CEST, Zoom (external link, opens in a new window) Faculty calendar Events & dates Vacancies Current job postings Contact us Secretary's office, house and postal address Information event (external link, opens in a new window) for incoming Master's students in “Computer Science”, “Data Science” & “Human-Centred AI” Sep 22, 2025, 15:00–17:00 CEST, Zoom (external link, opens in a new window) Faculty calendar Events & dates Vacancies Current job postings Contact us Secretary's office, house and postal address To top Cookie NoticeIn order for our website to function technically, we set required cookies. In addition, optional cookies enable the best possible use of the site. By checking the checkboxes you give your consent. You can revoke this at any time. More info about this in our privacy policy.MandatoryAccept mandatory cookiesExternal content: Accept external content / cookiesConfirm selectionAccept all",
  "content_length": 2241,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:31"
}