{
  "name": "Jun-ichi Imura",
  "homepage": "http://www.cyb.mei.titech.ac.jp/index.html.en",
  "status": "success",
  "content": "Imura Laboratory - Institute of Science Tokyo Site map | Japanese Top Page Members Research Papers Class Access News 10 Oct. 2025 Update Members page. 8 Apr. 2025 Update Members page. 8 Apr. 2025 Update Papers page. 2 Oct. 2024 Update Members page. 1 May. 2024 Update Members page. 2 Oct. 2023 Update Members page. 1 Sep. 2023 Dr. Zhenhui Xu has joined as Research Staff. 1 Aug. 2023 Specially Appointed Associate Professor Jonatan Pena Ramirez has moved to CICESE as an Associate Professor (Link) 8 May. 2023 Update Members page. 1 Dec. 2022 Dr. ASM Bakibillah has joined as Research Staff. 1 Dec. 2022 Specially Appointed Assistant Professor Shen has moved to Division of Electrical, Electronic and Infocommunications Engineering, Graduate School of Engineering, Osaka University as an Assistant Professor in the Takai Lab (Link) 1 Aug. 2022 Dr. Jonatan Pena Ramirez has joined as Specially Appointed Associate Professor. 20 Jun. 2022 Update Application. 02 May. 2022 Update Papers page. 01 Apr. 2022 Update Members page. 01 Jan. 2022 Dr. Sasahara has joined as Assistant Professor. 01 Oct. 2021 Dr. Shen has joined as Specially Appointed Assistant Professor. 25 Jul. 2021 Update Application. 10 Jun. 2021 Update Papers page. 19 May. 2021 Update Application. 23 Apr. 2021 Publish Application in Information. 22 Apr. 2021 Update Members page. 30 Oct. 2020 Update Members page. 21 Jun. 2020 Update Members page. 01 Apr. 2020 Assistant Professor Ishizaki left Imura Lab and started Ishizaki Laboratory as an associate professor of Department of Systems and Control Engineering School of Engineering Tokyo Institute of Technology (Link) 06 Jan. 2020 Update Members page. 30 Sep. 2019 Update Research page and Papers page. 12 May. 2019 Update Members page. 29 May. 2018 Update Members page. 27 Feb. 2017 Update Thesis page in this year. 30 Jan. 2017 Update Papers page. 08 Apr. 2016 Update Members page. 29 Apr. 2015 Update Papers page. 17 Apr. 2015 Dr. Masakazu Koike has moved to Graduate School of Engineering, Department of Marine Electoronics and Mechanical Engineering, Tokyo University of Marine Science and Technology. (Link) 14 Apr. 2015 Update Members page. 21 Oct. 2014 Update Papers page. 02 Jun. 2014 Update Members page. 26 Dec. 2013 Dr. Masayasu Suzuki has moved to Graduate School of Engineering, Department of Electrical and Electronic Engineering, Utsunomiya University. (Link) 28 Sep. 2013 Update Research page. 28 Sep. 2013 Update Papers page. 08 Apr. 2013 Update Members page. 01 Apr. 2013 Update Papers page. 01 Apr. 2013 Update Members page. 05 Feb. 2013 Update Papers page. 12 Dec. 2012 Update Members page. 29 Sep. 2012 Update Members page. 10 Apr. 2012 Update Members page. 27 Feb. 2012 Update Papers page. 01 Oct. 2011 Update Members page. 30 Sep. 2011 Dr. Kenji Kashima (previous assistant professor) has moved to Graduate School of Engineering Science, Osaka University. (Link) 12 Apr. 2011 Update Members page. 07 Apr. 2011 Update Papers page. 01 Apr. 2011 Update Papers page. 12 Jan. 2011 Update Papers page. 19 Oct. 2010 Update Papers page. 12 Oct. 2010 Update Members page. 12 Oct. 2010 D3 Ince won 2010 Best Paper Award and Best Student Award of International Society of Applied Intelligence. 08 Oct. 2010 Update Members page and Papers page. 12 Apr. 2010 Update Members page. 05 Feb. 2010 Update Members page. 03 Nov. 2009 Redesin of some pages. 13 Oct. 2009 Update Members page. 01 Jun. 2009 New picture in Members 17 Apr. 2009 Redesign of all pages. 13 Apr. 2009 Added 3 new students (Members page.). Address Imura Lab. Department of Systems and Control Engineering School of Engineering Institute of Science Tokyo 2-12-1-W8-1 Oh-Okayama, Meguro-ku Tokyo 152-8552, Japan How to Access Information [Application] １． Job Posting for Aihara Moonshot(Feb. 2022) ２． Please download the file to submit the application form (if indicated)：Applicant data Imura Lab. has cooperative relations with Nakadai Lab. whose major is Robotics. Imura Lab. and Hara-Tsumura Lab. promote studies on Glocal Control to develop control theory for Large-Scale Complex Systems. Imura Lab. is working on \"Aihara Innovative Mathematical Modelling Project\" in Funding Program for World-Leading Innovative R&D on Science and Technology (FIRST). Imura Lab. is working on Strategic Basic Research Programs (CREST) \"Creation of Fundamental Theory and Technology to Establish a Cooperative Distributed Energy Management System and Integration of Technologies Across Broad Disciplines Toward Social Application\" Links College Institute of Science Tokyo Dept. of Systems anf Control Engineering Laboratory Hayakawa Lab. Nakadai Lab. Copyright © Imura Lab. All Rights Reserved. Original design by © WebDaisuki.com.",
  "content_length": 4711,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:01"
}