{
  "name": "Jun-Dong Li",
  "homepage": "https://jundongli.github.io",
  "status": "success",
  "content": "Jundong Li Jundong Li Home Publications Tutorials Teaching Services Students Awards Jundong Li Associate Professor Department of Electrical and Computer Engineering Department of Computer Science University of Virginia Office: E-226 Thornton Hall Mail: 351 McCormick Road, P.O. Box 400743 Charlottesville, VA 22904-4743 Email: jundong at virginia dot edu Biography Jundong Li is an Associate Professor at the University of Virginia with appointments in the Department of Electrical and Computer Engineering and the Department of Computer Science. Since the summer of 2022, he has also been a part-time LinkedIn Research Scholar. Prior to joining UVA, he received his Ph.D. degree in Computer Science at Arizona State University in 2019 under the supervision of Dr. Huan Liu, M.Sc. degree in Computer Science at University of Alberta in 2014, and B.Eng. degree in Software Engineering at Zhejiang University in 2012. His research interests span data mining, machine learning, and artificial intelligence, with a particular emphasis on graph machine learning, trustworthy and safe machine learning, and large language models. He has published more than 200 papers in high-impact venues, and his work has received around 20,000 citations. He has been recognized with several notable honors, including four early career awards—ICDM Tao Li Award (2025), SIGKDD Rising Star Award (2024), PAKDD Early Career Research Award (2023), and the NSF CAREER Award (2022). He has also received two best paper awards, namely the PAKDD Best Paper Award (2024) and the SIGKDD Best Research Paper Award (2022), as well as multiple industry faculty research awards. His group's research is generously supported by UVA, NSF (CAREER, III, SaTC, SAI, S&CC), DOE, ONR, Commonwealth Cyber Initiative, Jefferson Lab, JP Morgan, Cisco, Netflix, and Snap. Research Interests Graph Machine Learning: Graph Neural Networks; Data-Efficient Learning; Fedearated Learning; Graph Foundation Models Trustworthy Machine Learning: Causality; Fairness; Interpretation; Robustness Safe Machine Learning: Anomaly/OOD Detection; Machine Unlearning; Attacks and Defenses Large Language Models: Reasoning; RAG/Graph-RAG; In-context Learning; Multi-agent Communications AI/ML+X: Healthcare; Biology; E-commerce; Infrastructure Systems",
  "content_length": 2289,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:58"
}