{
  "name": "Jun Zhu 0001",
  "homepage": "http://ml.cs.tsinghua.edu.cn/~jun/index.shtml",
  "status": "success",
  "content": "Jun Zhu's Homepage Jun Zhu Prof. @ THU Home Research Publications Teaching Software People Professional Bio Contact About me IEEE Fellow, AAAI Fellow Bosch AI Professor, Computer Science Department, Tsinghua University Co-Director, TSAIL Group Director, Tsinghua-Bosch Joint Center for Machine Learning Group My research focuses on developing statistical machine learning methods to understand complex scientific and engineering data. My current interests are in probabilistic machine learning, adversarial robustness, Bayesian methods, deep learning and reinforcement learning. Before joining Tsinghua in 2011, I was a post-doc researcher and project scientist at the Machine Learning Department in Carnegie Mellon University. From 2015 to 2018, I was an adjunct faculty at the Machine Learning Department in Carnegie Mellon University. News My book Probabilistic Machine Learning (in Chinese) was published in July, 2023, based on my machine learning courses at Tsinghua. We developed Vidu the first Sora-like video generator, launched at April 27th, 2024 (2 months after Sora), based on our own architecture U-ViT, the first diffusion transformer architecture with strong scalability. We open-sourced Tianshou, a highly modularized deep reinforcement learning (RL) library based on pure PyTorch. Check out our JMLR paper for details. Our paper Analytic-DPM: an Analytic Estimate of the Optimal Reverse Variance in Diffusion Probabilistic Models received the Outstanding Paper Award at ICLR 2022. Our paper Counter-Strike Deathmatch with Large-Scale Behavioural Cloning received the Best Paper Award at IEEE CoG 2022. We open-sourced ZhuSuan, a GPU library for Bayesian Deep Learning (a conjoin of Bayesian methods and deep learning) buit on TensorFlow. Check out the white paper and some news reports (in Chinese) for more details. We open-sourced TianShou, an elegant, flexible, and superfast PyTorch deep Reinforcement Learning (RL) library. Check out the JMLR paper for more details. We open-sourced Ares (Adversarial Robustness Evaluation for Safety), a Python library for adversarial machine learning research focusing on benchmarking adversarial robustness on image classification correctly and comprehensively, together with the CVPR Oral paper. We open-sourced DPM-Solver, a fast dedicated high-order solver for diffusion probabilistic models (DPMs) with the convergence order guarantee. DPM-Solver is suitable for both discrete-time and continuous-time diffusion models without any further training. Looking for highly motivated post-docs to work on large-scale machine learning and/or its applications in image, text, and network analysis. Various types of fellowship are avaiable for outstanding applicants, such as Tsinghua Fellowship [doc, link] , Innovation Fellow, and Exchange Program. I am an Associate Editor-in-Chief and Associate Editor (AE) for IEEE Trans. on PAMI and an Associate Editor for Artificial Intelligence. I am a Workshop co-Chair for ICML 2021 I am an Area Chair for ICML 2021, IJCAI 2021. ICLR 2021, NeurIPS 2020, I regularly served as Area Chair or Senior PCs for ICML, NeurIPS, AAAI, IJCAI, ICLR, UAI and AISTATS \t(See Professional for details) I was a Local Chair for ICML 2014. I was selected as one of \"pioneers\" by MIT TR35 China, 2017. I recieved the support from the National Youth Top-notch Talent Support Program, 2015. I recieved the \"CVIC SE Talents\" Award, 2015. I recieved the Best Collaboration Award by Tsinghua-MSRA Joint Research Lab, 2014. I was selected as one of \"AI's 10 to Watch\" by IEEE Intelligent Systems, 2013. I recieved the \"Excellent Young Scholar\" Award by NSF of China (NSFC), 2013. I recieved the \"CCF Young Scientist\" Award by China Computer Federation (CCF), 2013. Larry Carin and I organized Duke-Tsinghua Machine Learning Summer School on \"Deep Learning for Big Data\", Kunshan, August 1-10, 2016. I gave a tutorial on \"Big Learning with Bayesian Methods\" at the CCF Advanced Disciplines Lectures (ADL 52) \\& NLPCC 2014 Tutorials, Dec, 2014. (Check out the review article for more details) I co-organized the Divergence Methods for Probabilistic Inference Workshop with Oluwasanmi Koyejo, Mark Reid, and Eric Xing at ICML 2014. I co-organized the Topological Methods for Machine Learning Workshop with Lek-Heng Lim, Yuan Yao and Jerry Zhu at ICML 2014. I co-hosted the dragon star machine learning lectures given by Kai Yu and Tong Zhang, from August 6th to August 10th, 2012. Last updated on Dec. 10th, 2019. Count: .",
  "content_length": 4492,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:58"
}