{
  "name": "Jun Yan 0007",
  "homepage": "https://sites.google.com/view/jyan/home",
  "status": "success",
  "content": "Jun Yan's homepageSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcome!Jun Yan, Ph.D., P.Eng.Associate Professor and Research Chair in Artificial Intelligence in Cyber Security and ResilienceAssociate Director & Co-Op Director, Concordia Institute for Information Systems Engineering (CIISE)Concordia University, Montréal, Québec, CanadaEmail: jun.yan(at)concordia.caFaculty Profile, Google Scholar, DBLP, ORCID, LinkedInIJCNN 2023 (Australia)Concordia Shuffle (2023)Mitacs-7dish project kick-offSSCI 2025 (Norway)INSE 6640 (2024)Bienvenue/Welcome! I am an Associate Professor and Associate Director at the Concordia Institute for Information Systems Engineering (CIISE) at Concordia University, Montréal. I also hold the Concordia University Research Chair in Artificial Intelligence in Cyber Security and Resilience (Tier 2). My research focuses on computational intelligence, security, and resilience, with applications in cyber-physical infrastructures, including smart grids, smart transportation, and smart cities. I received my Ph.D. from the University of Rhode Island, USA, under the supervision of Prof. Haibo He (F-IEEE). I joined Concordia University in 2018 as an Assistant Professor and received the early tenure promotion to Associate Professor in 2022.  In 2025, I was on sabbatical and a visiting researcher at Delft University of Technology (TU Delft), Netherlands. I served as the Graduate Program Director (Thesis) of CIISE in 2023-24 and also held the Concordia-MCN Co-chaire de recherche sur la cybersécurité et la résilience des réseaux de l’administration publique (Research Co-Chair in Cybersecurity and Resilience in Public Administration Networks) in 2023-25. I have published over 120 peer-reviewed research articles with my students and collaborators. I was also the recipient of best paper awards at IEEE ICC and IEEE WCCI, the Excellence in Doctoral Research Award (Class of 2018) from URI, Best Reviewers award from IEEE TSG, and Best Readings of IEEE ComSoc, among others. According to Google Scholar metrics, some papers are among the most-cited publications since 2017 in the corresponding IEEE Transactions, including one ranked at #13 of 11,200 on IEEE Transactions on Industrial Electronics (TIE), one at #10 of 3,500+ on the IEEE/ASME Transactions on Mechatronics (TMECH), and one at #21 of 3,700+ on the IEEE Transactions on Information Forensics & Security (TIFS). One survey is the most-cited paper of IET Cyber-Physical Systems: Theories & Applications since the journal's inauguration in 2016. Our research has also been featured extensively, including in the IEEE Transactions on Information Forensics and Security, the IEEE Smart Grid Newsletter, and the IEEE Signal Processing Society eNewsletter, among others. I am the founding co-director of the Digital Twins Hub at Concordia and the NSF EuReCa Global Center, in collaboration with Santa Clara University (USA). I am also a founding member of the Security Research Centre (SRC) and the Applied Artificial Intelligence Institute (AI2) at Concordia University. I also founded and chaired the IEEE PES AMPS-BDA Task Force on Big Data Analytics for Security and Resilience of Power Systems. Recent News2025Yefei has successfully defended her PhD thesis, \"Toward Practical Machine Learning Solutions for IoT Malware Analysis.\" Congratulations, Dr. Zhang! Chengming's paper \" Self-Refined Generative Foundation Models for Wireless Traffic Prediction\" has been accepted by IEEE Transactions on Vehicular Technology. Bravo!Juanwei's paper \"An SDN-based Framework for Cyber-physically Coordinated Voltage Support of Virtual Power Plants Against DoS Attacks\" has been accepted by IEEE Transactions on Smart Grid. Bravo!We organized the first Workshop on Agentic Energy Systems in Smart Grids: Theories, Technologies, and Applications at the 2025 IEEE SmartGridComm in Toronto, Canada. Thanks to all the submitters, presenters, and conference organizers who made this happen!Yuefan, Qiushi, and Shreya joined our research group as new graduate students. Welcome!Shreya successfully defended her Master's thesis, \"SWin: A Sliding Window Summarization Approach for Coherent LLM-Driven Dialogue Systems.\" Congratulations! Shreya will join us as a Volt-Age Doctoral Fellow in Fall 2025. Pasha successfully defended his Master's thesis, \"Class Imbalance and Time-to-Detection in the Performance Analysis of Machine Learning-Based Intrusion Detection Systems.\" Congratulations! Nanda successfully defended his Master's thesis, \"PANER: A Paraphrase-Augmented Framework for Low-Resource Named Entity Recognition.\" Congratulations! Our group has two papers accepted by the 2025 IEEE International Conference on Communications, Control & Computing Technologies for Smart Grids (SmartGridComm)  in Toronto. See you there in September!Yefei's survey \"A Data-Driven Study of IoT Malware Classification Models: Insights Into Temporal, Architectural, and Spatial Inconsistency Challenges\" has been accepted by the IEEE Internet of Things Journal. Bravo!Hanzheng's paper \"RefPentester: A Knowledge-Informed Self-Reflective Penetration Testing Framework based on Large Language Models\" has been accepted by the 2026 International Conference on Privacy, Security & Trust (PST). Well done!Hamed successfully defended his PhD thesis, \"An Effective Large Language Model-based Pipeline to Preprocess Narrative Electronic Medical Records Data for Hospital Adverse Events Detection.\" Congratulations, Dr. Jafarpour! Our group has two papers accepted by the 2025 International Joint Conference on Neural Networks (IJCNN) in Rome, Italy. See you in June!Our group has two papers accepted by the 2025 CSCE Construction Specialty Conference / ASCE Construction Research Congress (CRC).  Our team will present the work in Montreal. See you in July!Sareh successfully defended her Master's thesis, \"Event Graph Optimization for Request for Information (RFI) with Hierarchical Reinforcement Learning and Human Feedback.\" Congratulations! Dr. Yan delivered an invited seminar \"Empowering Secure, Trustworthy, and Resilient Electrification with Agentic Machine Intelligence\" at the Université catholique de Louvain and the Université de Namur in Belgium.Dr. Yan was awarded a new Volt-Age Impact Grant (co-PI) titled \"Securing Smart Environment.\" We will recruit two Volt-Age Doctoral Fellows over the next 4 years to work on this exciting use-inspired research project. Stay tuned!Dr. Yan was awarded a new NSERC Discovery Grant (PI) titled \"Secure, Trustworthy, and Resilient Artificial Intelligence for Next-Generation Energy Management Systems.\" We will recruit at least four PhD/Master's students over the next 5 years to work on this exciting cutting-edge research project. Stay tuned!Hang successfully defended his PhD thesis, \"Advancing Cybersecurity in Power Grids with High Penetration of Wind Energy: From Modeling to Mitigation of Cyberattacks against Wind Farms.\" Congratulations, Dr. Du! Our position paper \"Emergent Machina Sapiens Urge Rethinking Multi-Agent Paradigms\" is now on ArXiv (accepted by IJCNN 2025). Feel free to check it out and provide your comments!Dr. Yan started a sabbatical as a visiting researcher at the Delft University of Technology (TU Delft) in the Netherlands.Juanwei's survey \"Cybersecurity of Distributed Energy Resource Systems in the Smart Grid: A Survey\" has been accepted by Applied Energy. Bravo! More NewsResearch HighlightsOur research lies at the intersection of applied computational intelligence, cyber-physical security, and smart resilient infrastructures. With my students and collaborators, we have published over 120 peer-reviewed publications in the following areas. A complete list of my research publications can be found here.Applied Computational IntelligenceAutonomous & agentic AI system engineeringTrustworthy and actionable intelligenceAdversarial and resilient machine learning Cyber-Physical SecurityAdvanced OT analytics for cyber-physical systemsFederated digital twinning & co-simulationAutomated situational awareness & threat analysisSmart Resilient InfrastructureMulti-agentic intelligent system interactionMulti-modal information and decision fusionAttack-resilient and self-healing systemsRecognition & AwardsMost cited paper of IET Cyber-Physical Systems: Theory & Applications: \"Cyber-Physical Attacks and Defenses in the Smart Grid: A Survey.\"Best Paper, IEEE International Conference on Communications (ICC), 2014  [Link]Best Student Paper, IEEE World Congress on Computational Intelligence (WCCI), 2016. [Link]Best Readings on \"Communications & Information Systems Security - Cyber Attacks\" of IEEE Communication Society (ComSoc), 2013. [Link] Front-cover paper on IEEE Transactions on Information Forensics and Security (TIFS), vol. 8, no. 4, April 2013. [Link]Excellence in Doctoral Research Award, University of Rhode Island, 2018 (sole recipient). [Link]Best Reviewers, IEEE Transactions on Smart Grid, 2016. [Link]More ...FundingSince established in 2018, our research group has received over CA$5 million in research funding from various programs, including: NCC Training Grant (2026-2030)NSERC Discovery Grant (2018-30)Volt-Age Impact Grant (2025-29)Mitacs-Ericsson Accelerate (2019-27)NSERC Alliance/Mitacs Accelerate Joint Grant (2023-26)Concordia University Research Chair (2023-28)Concordia-MCN co-chaire de recherche sur la cybersécurité et la résilience des réseaux de l’administration publique (2023-25)CFI Innovation Fund (2021-25)FRQSC-NSFC Joint Research Grant on Smart City and Big Data (2020-23) FRQNT Établissement de Nouveaux Chercheurs Universitaires (2018-20) Mitacs Globalink Research Internship Program (2019, 22, 23) Nvidia GPU Grant (2018-19) TeachingI offer two elective courses for graduate students on topics of smart grids and industrial control system security and machine learning in information system security. I also teach some undergraduate courses, mostly during the summer.INSE 6640 - Smart Grids a",
  "content_length": 11336,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:57"
}