{
  "name": "Jun Wang 0002",
  "homepage": "https://www.cs.cityu.edu.hk/~jwang358",
  "status": "success",
  "content": "Welcome to Jun Wang's Home Page Jun Wang Chair Professor of Computational Intelligence Room B6413, Academic Building 1 Department of Computer Science College of Science and Engineering City University of Hong Kong Kowloon Tong, Kowloon, Hong Kong Tel:  (852) 34429701  Fax: (852) 34420503 jwang.cs@cityu.edu.hk EXPERIENCE Chair Professor, City University of Hong Kong, Hong Kong, 2016 to present. Professor, The Chinese University of Hong Kong, Hong Kong, 2002 to 2015. Associate Professor, The Chinese University of Hong Kong, Hong Kong, 1995 to 2001. Associate Professor,  University of North Dakota, Grand Forks, North Dakota, USA, 1993-1997. Assistant Professor, University of North Dakota, Grand Forks, North Dakota, 1990-1993. CAD Programmer (part-time), Zagar, Inc., Cleveland, Ohio, 1989-1990. Teaching/Research Assistant (part-time), Case Western Reserve University, Cleveland, Ohio, 1986-1989. Instructor, Dalian Institute of Technology (renamed to Dalian University of Technology in 1988), Dalian, Liaoning, China, 1985-1986. EDUCATION Ph.D. in Systems Engineering, 1991, Case Western Reserve University M.S. in Systems Engineering,  1985, Dalian Institute of Technology (renamed to Dalian University of Technology in 1988) B.S. in Electrical Engineering,  1982, Dalian Institute of Technology (renamed to Dalian University of Technology in 1988) DISTINCTIONS IEEE Fellow, since 2007. IAPR Fellow, since 2012. Neural Networks Pioneer Award, IEEE Computational Intelligence Society, 2014. Changjiang Chair Professorship (Shanghai Jiao Tong University), Sponsored by the Ministry of Education of China and Li Ka Shing Foundation of Hong Kong, 2008-2011. Research Excellence Award, The Chinese University of Hong Kong, 2008-2009. Natural Science Award (first class), Shanghai Municipal Government, 2009. IEEE Distinguished Lecturer, IEEE Computational Intelligence Society, 2010-2012, 2013-2015. IEEE Transactions on Neural Networks Outstanding Paper Award, IEEE Computational Intelligence Society, 2011. Outstanding Achievement Award, Asia Pacific Neural Network Assembly, 2011. Natural Science Award (first class), Ministry of Education of China, 2011. RESEARCH INTERESTS Neural computation Computational intelligence Optimization methods Intelligent control Intelligent robotics Intelligent manufacturing Intelligent data processing MAJOR GRANTS General Research Fund: Intelligent motion control and planning of autonomous underwater vehicles, Hong Kong Research Grants Council, 2014-2017. General Research Fund: Neurodynamic approaches to constrained optimization with generalized-convex and multiple-objective functions, Hong Kong Research Grants Council, 2013-2016. General Research Fund: Analysis and design of memristive neurodynamic systems, Hong Kong Research Grants Council, 2011-2013. General Research Fund: Analysis and design of model predictive control based on recurrent neural networks, Hong Kong Research Grants Council, 2009-2012. General Research Fund: Analysis and design of associative memories based on recurrent neural networks, Hong Kong Research Grants Council, 2008-2010. Earmarked Grant: Sequential blind source extraction from instantaneous and convolutive mixtures for ill-conditioned mixing channels, Hong Kong Research Grants Council, 2004-2006. Earmarked Grant: Analysis and design of recurrent neural networks for dynamic optimization subject to nonlinear constraints and their engineering applications, Hong Kong Research Grants Council, 2003-2006. Earmarked Grant: Recurrent neural networks for real-time grasping force optimization of dexterous manipulations using multi-fingered robotic hands, Hong Kong Research Grants Council, 2000-2003. Earmarked Grant: Multilayer recurrent neural networks for real-time optimization and their applications to optimal control of kinematically redundant manipulators,1998-2001. Earmarked Grant: Multilayer recurrent neural networks for synthesizing and optimizing robust linear and nonlinear control systems, Hong Kong Research Council, 1997-2000. Earmarked Grant: Recurrent neural network for solving combinatorial optimization with time-varying parameters and their applications for en-route vehicle guidance in intelligent transportation systems, Hong Kong Research Grants Council, 1996-1999. SELECTED PUBLICATIONS (with H-index being 49 in ResearcherID or 63 in Google Scholar) 1.       Z Peng, D. Wang and J. Wang, Cooperative dynamic positioning of multiple marine offshore vessels: a modular design, IEEE/ASME Transactions on Mechatronics, vol. 21, in press, 2016. 2.       Y. Shen and J. Wang, Robustness of global exponential stability of nonlinear systems with random disturbances and time delays, IEEE Transactions on Systems, Man and Cybernetics: Systems, vol. 45, in press, 2016. 3.       Q. Liu and J. Wang, L1-minimization algorithms for sparse signal reconstruction based on a projection neural network, IEEE Transactions on Neural Networks and Learning Systems, vol. 27, in press, 2016. 4.       P. Liu, Z. Zeng, and J. Wang, Multistability of recurrent neural networks with non-monotonic activation functions and mixed time delays, IEEE Transactions on Systems, Man and Cybernetics: Systems, vol. 45, in press, 2016. 5.       Y. Xia and J. Wang, A bi-projection neural network for solving constrained quadratic optimization problems, IEEE Transactions on Neural Networks and Learning Systems, vol. 27, no. 2, pp. 214 - 224, 2016. 6.       Q. Liu and J. Wang, A second-order multi-agent network for bound-constrained distributed optimization, IEEE Transactions on Automatic Control, vol. 60, no. 12, pp. 3310-3315, 2015. 7.       B. Tang and J. Wang, and Y Zhang, A delay-distribution approach to stabilization of networked control systems, IEEE Transactions on Control of Network Systems, vol. 2, no. 4, pp. 382 - 392, 2015. 8.       S. Zhang, Y. Xia, and J. Wang, A complex-valued projection neural network for constrained optimization of real functions in complex variables, IEEE Transactions on Neural Networks and Learning Systems, vol. 26, no. 12, pp. 3227 - 3238, 2015. 9.       X. Le and J. Wang, Neurodynamics-based robust pole assignment for high-order descriptor systems, IEEE Transactions on Neural Networks and Learning Systems, vol. 26, no. 11, pp. 2962-2971, 2015. 10.    Q. Liu and J. Wang, A projection neural network for constrained quadratic minimax optimization, IEEE Transactions on Neural Networks and Learning Systems, vol. 26, no. 11, pp. 2891-2900, 2015. 11.    S. Yang, Z. Guo, and J. Wang, Robust synchronization of multiple memristive neural networks with uncertain parameters via nonlinear coupling, IEEE Transactions on Systems, Man and Cybernetics: Systems, vol. 45, no. 7, pp. 1077-1086, 2015. 12.    Y. Xia and J. Wang, Low-dimensional neural network-based Kalman filter for speech enhancement, Neural Networks, vol. 67, pp. 131-139, 2015. 13.    J. Hu and J. Wang, Global exponential periodicity and stability of discrete-time complex-valued recurrent neural networks with time-delays, Neural Networks, vol. 66, pp. 119-130, 2015. 14.    Z. Guo, S. Yang, and J. Wang, Global exponential synchronization of multiple memristive neural networks with time delay via nonlinear coupling, IEEE Transactions on Neural Networks and Learning Systems, vol. 26, no. 6, pp. 1300 - 1311, 2015. 15.    Z. Yan and J. Wang, Nonlinear model predictive control based on collective neurodynamic optimization, IEEE Transactions on Neural Networks and Learning Systems, vol. 26, no. 4, pp. 840-850, 2015. 16.    S. Qin, J. Wang, and X. Xue, Convergence and attractivity of memristor-based cellular neural networks with time delays, Neural Networks, vol. 63, pp. 223-233, 2015. 17.    J. Lian and J. Wang, Passivity of switched recurrent neural networks with time-varying delays, IEEE Transactions on Neural Networks and Learning Systems, vol. 26, no. 2, pp. 257-266, 2015. 18.    Z. Guo, J. Wang, and Z. Yan, Global exponential synchronization of two memristor-based recurrent neural networks with time delays via static or dynamic coupling, IEEE Transactions on Systems, Man and Cybernetics: Systems, vol. 45, no. 2, pp. 235-249, 2015. 19.    G. Li, Z. Yan, and J. Wang, A one-layer recurrent neural network for constrained nonconvex optimization, Neural Networks, vol. 61, pp. 10-21, 2015. 20.    Z. Guo, J. Wang, and Z. Yan, Passivity and passification of memristor-based recurrent neural networks with time-varying delays, IEEE Transactions on Neural Networks and Learning Systems, vol. 25, no. 11, pp. 2099 - 2109, 2014. 21.    J. Fan, J. Wang, and M. Han, Cooperative coevolution for large-scale optimization based on kernel fuzzy clustering and variable trust region methods, IEEE Transactions on Fuzzy Systems, vol. 22, no. 4, pp. 829-839, 2014. 22.    Q. Liu, T. Huang, and J. Wang, One-layer continuous-time and discrete-time projection neural networks for solving variational inequalities and related optimization problems, IEEE Transactions on Neural Networks and Learning Systems, vol. 25, no. 7, pp. 1308-1318, 2014. 23.    Z. Yan, J. Wang, and G. Li, A collective neurodynamic optimization approach to bound-constrained nonconvex optimization, Neural Networks, vol. 55, pp. 20-29, 2014. 24.    Z. Guo, J. Wang, and Z. Yan, A systematic method for analyzing robust stability of interval neural networks with time-delays based on stability criteria, Neural Networks, vol. 54, pp. 112-122, 2014. 25.    Z. Guo, J. Wang, and Z. Yan, Attractivity analysis of memristor-based cellular neural networks with time-varying delays, IEEE Transactions on Neural Networks and Learning Systems, vol. 25, no. 4, pp. 704-717, 2014. 26.    Z. Yan and J. Wang, Robust model predictive control of nonlinear systems with unmodeled dynamics and bounded uncertainties based on neural networks, IEEE Transactions on Neural Networks and Learning Systems, vol. 25, no. 3, pp. 457-469, 2014. 27.    G. Li, Z. Yan, and J. Wang, A one-layer recurrent neural network for constrained nonsmooth invex optim",
  "content_length": 38461,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:55"
}