{
  "name": "Jun Liu 0036",
  "homepage": "https://www.lancaster.ac.uk/scc/about-us/people/jun-liu2",
  "status": "success",
  "content": "Jun Liu - Lancaster University Our use of cookies We use necessary cookies to make our site work. We'd also like to set optional cookies to help us measure web traffic and report on campaigns. We won't set optional cookies unless you enable them. Accept optional cookies Reject optional cookies Cookie settings Professor Jun Liu FHEA Professor in Digital Health Profile Jun Liu is Professor and Chair in Digital Health at the School of Computing and Communications, Lancaster University. He earned his PhD from Nanyang Technological University in 2019, subsequently serving as faculty at Singapore University of Technology and Design from 2019 to 2024. Prior to his academic career, he worked at Tencent from 2014 to 2015. Professor Liu has received numerous prestigious recognitions, including Best Paper Awards from PREMIA (2016, 2019), the Best Doctoral Thesis Award from EEE at NTU (2020), and the IEEE VSPC Rising Star Honorable Mention Award (2024). He serves as Senior Area Editor for IEEE Transactions on Image Processing and Associate Editor for several leading journals, including IEEE Transactions on Circuits and Systems for Video Technology, IEEE Transactions on Neural Networks and Learning Systems, IEEE Transactions on Industrial Informatics, ACM Computing Surveys, and Pattern Recognition. He is General Chair of BMVC 2026 and Program Chair of BMVC 2025, and has served as Area Chair for premier conferences including CVPR, ECCV, ICML, NeurIPS, ICLR, IJCAI, AAAI, WACV, and ACM Multimedia. His research focuses on AI, computer vision, machine learning, and digital health applications. Google Scholar Page: https://scholar.google.com/citations?user=Q5Ild8UAAAAJGroup Webpage: https://wp.lancs.ac.uk/vl/ Publications Projects Activities PhD Students Research Groups Unrestricted Gift 01/01/2025 → 31/12/2028 Research DSI: Unrestricted Gift 01/01/1900 → … Research IEEE Transactions on Circuits and Systems for Video Technology (Journal) Editorial activity IEEE Transactions on Neural Networks and Learning Systems (Journal) Editorial activity ACM Computing Surveys (Journal) Editorial activity IEEE Transactions on Industrial Informatics (Journal) Editorial activity Pattern Recognition (Journal) Editorial activity IEEE Transactions on Biometrics, Behavior, and Identity Science (Journal) Editorial activity IEEE Transactions on Image Processing (Journal) Editorial activity Xiaofei Hui PhD student, Associate Lecturer Digital Health Group enable JavaScript to view email address Zhuoling Li PhD student, Associate Lecturer Digital Health Group enable JavaScript to view email address Haoxuan Qu PhD student Digital Health Group enable JavaScript to view email address Qiuchi Xiang PhD student Digital Health Group enable JavaScript to view email address Yu Xue PhD student Digital Health Group enable JavaScript to view email address Artificial Intelligence Digital Health Group Lancaster Intelligent, Robotic and Autonomous Systems Centre Back to listing Contact Details Department: Computing and Communications enable JavaScript to view email address Back to listing",
  "content_length": 3086,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:55"
}