{
  "name": "Jun Zhao 0001",
  "homepage": "http://nlpr-web.ia.ac.cn/cip/english/~junzhao/index.html",
  "status": "success",
  "content": "Jun Zhao 赵军 Toggle navigation Jun's Homepage Home Publications Group Members Grants and Awards Academic Services & InvitedTalks Courses Demos 中文版 Professor Natural Lauguage Processing & Knowledge Engineering(NLPKE), Institute of Automation, Chinese Academy of Sciences, University of Chinese Academy of Sciences, School of Artificial Intelligence Office: Room 703, Intelligence Building, Institute of Automation, Chinese Academy of Sciences, Zhongguancun East Road 95#, Beijing, China, 100190 Email: jzhao(at)nlpr(dot)ia(dot)ac(dot)cn Bio I received my Ph.D. from Tsinghua University in 1998 and worked as a postdoctoral researcher at the Hong Kong University of Science and Technology from 1998 to 2002. Since 2002, I have been working at the Institute of Automation, Chinese Academy of Sciences (CAS) for over 20 years. Currently, I am a full professor and doctoral supervisor. I have been honored to receive the Special Government Allowance from the State Council of China. My research focuses on natural language processing and knowledge engineering. I have led several national key research projects, including those under the National Key Research and Development Program of China and key projects supported by the National Natural Science Foundation of China. I have published over 100 papers in top-tier journals and conferences, which have garnered more than 27,000 citations on Google Scholar, with my most cited paper exceeding 3,300 citations. My work has won several awards, including Best Paper Award at COLING 2014 and Best Poster Award at ISWC 2023. The project I led on open-domain textual knowledge acquisition and knowledge graph construction was awarded the First Prize of the Beijing Science and Technology Progress Award in 2019. As a professor at the School of Artificial Intelligence, University of the Chinese Academy of Sciences (UCAS), I have taught the course on Knowledge Engineering for several years, which was honored as an Outstanding Graduate Course in 2021. In 2020, I was awarded the Zhuli Yuehua Outstanding Teacher Award of CAS. Research Interest Natural language processing Large Language Models Knowledge Engineering News We have Three papers accepted by ICLR 2025. We have Four papers accepted by COLING 2025. We have Four papers accepted by AAAI 2025.",
  "content_length": 2293,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:58"
}