{
  "name": "Jun Li 0001",
  "homepage": "http://ix.cs.uoregon.edu/~lijun",
  "status": "success",
  "content": "Jun Li - University of Oregon Dr. Jun Li is a Professor in the Department of Computer Science at the University of Oregon. He directs the Network & Security Research Laboratory and is the founding director of the Center for Cyber Security and Privacy at the University of Oregon. Prof. Li's research has been funded by the National Science Foundation, including the prestigious NSF CAREER award, DHS, Intel, Narus, Ripple, UC3M, the State of Oregon, and the University of Oregon. He has received the ACM Recognition of Service Award, University of Oregon Faculty Excellence Award , Ripple Faculty Fellowship, best paper awards, among others. Prof. Li received his Ph.D. degree in Computer Science from the University of California, Los Angeles as the Outstanding Doctor of Philosophy. Previously, he received his M.E. degree in computer science from the Chinese Academy of Sciences (with a Presidential Scholarship) and his B.S. degree in computer science from Peking University. Prof. Li conducts research in computer networking, distributed systems, and cyber security. He studies not only basic networking functions (e.g., routing and naming), a variety of networking paradigms (e.g., software-defined networking, Internet of Things, data center networking, peer-to-peer networking), and networking applications (e.g., online social networking), but also their problems in and usage for cyber security and privacy. He studies both direct countermeasures against security attacks (including Internet worms, phishing, botnets, and social bot attacks) and fundamental security issues and solutions at the network architecture and protocol level (in particular, DDoS defense, Internet routing security, and DNS security). He also studies cryptocurrency, blockchain, applied cryptography, and cyber crime. He is a senior member of ACM and a senior member of IEEE. He has served on and chaired international technical program committees and editorial boards of leading journals. E-mail: Mailing Address: Dept. of Computer Science, 1202 University of Oregon, Eugene, OR 97403-1202, USA Sponsors:",
  "content_length": 2091,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:54"
}