{
  "name": "Jun Wei 0006",
  "homepage": "https://weijun-arc.github.io",
  "status": "success",
  "content": "Jun Wei's Homepage Jun Wei (魏军)'s Homepage I am currently an Assistant Professor affiliated with the Visual Computing Research Center (VCC) at the College of Computer Science & Software Engineering (CSSE), Shenzhen University (SZU). Before coming to SZU, I obtained my PhD's degree under the supervision of Prof. Zhen Li in 2024 from the School of Science and Engineering (SSE) at The Chinese University of Hong Kong, Shenzhen (CUHKSZ). Prior to that, I received my Master's degree under the supervision of Prof. Shuhui Wang in 2020 from the Institute of Computing Technology (ICT), Chinese Academy of Sciences (CAS), and Bachelor's degree from the School of Electronic Information and Communications (SEIC), Huazhong University of Science and Technology (HUST) in 2017. My research interests are mainly in computer vision and computer graphics, with a recent focus on Urban Scene Reconstruction. Email:weijun@szu.edu.cn 欢迎对人工智能、3D重建、计算机视觉等方向感兴趣，自驱力强的同学与我联系。目前正在招收一定数量的研究生（含推免生），需要联系的同学请发送简历到我邮箱！ Publications WeakPCSOD: Overcoming the Bias of Box Annotations for Weakly Supervised Point Cloud Salient Object Detection Jun Wei, S.Kevin Zhou, Shuguang Cui, Zhen Li Proceedings of the AAAI Conference on Artificial Intelligence (AAAI), 2024. Weakpolyp: You only look bounding box for polyp segmentation Jun Wei, Yiwen Hu, Shuguang Cui, S.Kevin Zhou, Zhen Li International Conference on Medical Image Computing and Computer-Assisted Intervention (MICCAI), 2023. Weakly supervised object localization through inter-class feature similarity and intra-class appearance consistency Jun Wei, Sheng Wang, S.Kevin Zhou, Shuguang Cui, Zhen Li European Conference on Computer Vision (ECCV), 2022. BoxPolyp: boost generalized polyp segmentation using extra coarse bounding box annotations Jun Wei, Yiwen Hu, Guanbin Li, Shuguang Cui, S.Kevin Zhou, Zhen Li International Conference on Medical Image Computing and Computer-Assisted Intervention (MICCAI), 2022. Shallow feature matters for weakly supervised object localization Jun Wei, Qin Wang, Zhen Li, Sheng Wang, S.Kevin Zhou, Shuguang Cui Proceedings of the IEEE/CVF conference on computer vision and pattern recognition (CVPR), 2021. Shallow attention network for polyp segmentation Jun Wei, Yiwen Hu, Ruimao Zhang, Zhen Li, S.Kevin Zhou, Shuguang Cui International Conference on Medical Image Computing and Computer-Assisted Intervention (MICCAI), 2021. F³Net: fusion, feedback and focus for salient object detection Jun Wei, Shuhui Wang, Qingming Huang Proceedings of the AAAI conference on artificial intelligence (AAAI), 2020. Label decoupling framework for salient object detection Jun Wei, Shuhui Wang, Zhe Wu, Chi Su, Qingming Huang, Qi Tian Proceedings of the IEEE/CVF conference on computer vision and pattern recognition (CVPR), 2020. Honors & Awards 2020 President's Scholarship, by CUHK-Shenzhen (校长奖学金) 2020 Outstanding Graduate of Beijing, by Beijing Municipal Education Commission (北京市优秀毕业生) 2019 Director's Excellence Award, by Institute of Computing Technology, CAS (所长优秀奖) 2015 National Scholarship, by Ministry of Education (国家奖学金) © Jun Wei, VCC, Shenzhen University.",
  "content_length": 3128,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:56"
}