{
  "name": "Jun Wang 0001",
  "homepage": "http://www.cass.eecs.ucf.edu/?page_id=1249",
  "status": "success",
  "content": "About Dr. Jun Wang, IEEE Fellow – Computer Systems Architecture and Data Science Laboratory Skip to the content Computer Systems Architecture and Data Science Laboratory Toggle mobile menu Toggle search field Search for: Home Founder About Dr. Jun Wang, IEEE Fellow Professional Service Jun Wang’s achievements Members Alumni Photo Gallery Teaching EEL6760 EEL6762 EEL6938 EEL4768 Publication Grants Facilities Contact Home Founder About Dr. Jun Wang, IEEE Fellow Professional Service Jun Wang’s achievements Members Alumni Photo Gallery Teaching EEL6760 EEL6762 EEL6938 EEL4768 Publication Grants Facilities Contact About Dr. Jun Wang, IEEE Fellow Professor Jun Wang Dr. Jun Wang joined the Department of Electrical Engineering and Computer Science at the University of Central Florida in 2006. Prior to that, he was a faculty in the Computer Science and Engineering Department of the University of Nebraska, Lincoln. He is the recipient of the National Science Foundation Early Career Award 2009 and the Department of Energy Early Career Principal Investigator Award 2005. Recently, he has won the 2015 UCF Reach For the Stars award, the 2013 Dean’s Research Professorship Award, the Charles N. MillicanFaculty Fellow 2010-2012, and the University of Central Florida Research Incentive Award 2010, 2017, and 2022. His research has been sponsored mainly by the National Science Foundation and the Department of Energy. His work aims to generate impacts in the high-performance I/O systems community. He has authored over 150 publications in premier journals such as IEEE Transactions on Computers, and IEEE Transactions on Parallel and Distributed Systems, and leading HPC and systems conferences such as  ISCA, AAAI, ICLR, ICCAD, VLDB, DAC, ICDCS, IPDPS, HPDC, EuroSys, ICS, Middleware, FAST. He has graduated 14 Ph.D. students who upon their graduations were employed by major US IT corporations (e.g., Apple, Google, Microsoft, EMC, etc). He has served as an Associate Editor for the IEEE Transactions on Parallel and Distributed Systems, and IEEE Transactions on Cloud Computing. He has conducted extensive research in the areas of Computer Systems and High-Performance Computing. His specific research interests include the following: Big Data and Big Compute Systems Data-intensive High-Performance Computing Massive Storage and I/O Deep Neural Network and Transformers Architecture Security US News and World Report announced UCF Computer Engineering graduate program 2019-2020 ranking at 52. There are multiple graduate research assistant positions available in CASS laboratory. Please contact Prof. Wang at Jun.Wang@UCF.edu. EECS – Electrical & Computer Engineering Phone:      407-8230449 Email:       JUN.WANG at UCF dot EDU Location:  Harris Engineering Center (bldg. 116) 320 News RA positions are available! If you are interested in our research program, please contact us! © 2025 Computer Systems Architecture and Data Science Laboratory Theme by Anders Noren — Up ↑",
  "content_length": 2982,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:58"
}