{
  "name": "Jun Huang 0001",
  "homepage": "https://www.cs.cityu.edu.hk/~jhuan9",
  "status": "success",
  "content": "Jun Huang@CityU I am an Assistant Professor in Computer Science at City University of Hong Kong. Prior to joining CityU, I was a Research Scientist at MIT and an Assistant Professor at Peking University. I received my PhD in Computer Science and Engineering at Michigan State University. My research interests span across Wireless Networking, Mobile and Wearable Computing, and Artificial Intelligence of Things (AIoT). I am looking for PhD students and Research Assistants. Please contact me by email. Selected Papers Towards Intelligent LiDar with Adaptive Focus Xuan Huang, Chen Bian, Jun Huang, Guoliang Xing ACM MOBICOM, 2025 Neuralite: Enabling Wireless High-Resolution Brain-Computer Interfaces Hongyao Liu, Junyi Wang, Liuqun Zhai, Yuguang Fang, Jun Huang ACM MOBICOM, 2024 Enabling Ubiquitous Wi-Fi Sensing with Beamforming Reports Chenhao Wu, Xuan Huang, Jun Huang, Guoliang Xing ACM SIGCOMM, 2023 RF-SIFTER: Sifting Signals at Layer-0.5 to Mitigate Wideband Cross-Technology Interference for IoT Xiong Wang, Jun Huang, Bizhao Shi, Zhe Ou, Guojie Luo, Linghe Kong, Daqing Zhang, Chenren Xu ACM MOBICOM, 2023 When LoRa Meets EMR: Electromagnetic Covert Channels Can Be Super Resilient Cheng Shen, Tian Liu, Jun Huang, Rui Tan IEEE S&P (Oakland), 2021 EarFisher: Detecting Wireless Eavesdroppers by Stimulating and Sensing Memory EMR Cheng Shen, Jun Huang USENIX NSDI, 2021 Understanding Power Consumption of NB-IoT in the Wild: Tools and Large-Scale Measurement Deliang Yang, Xianghui Zhang, Xuan Huang, Liqian Shen, Jun Huang, Xiangmao Chang, Guoliang Xing ACM MOBICOM, 2020 Detecting Wireless Spy Cameras via Stimulating and Probing Tian Liu, Ziyu Liu, Jun Huang, Rui Tan, Zhen Tan ACM MOBISYS, 2018 Practical Bluetooth Traffic Sniffing: System and Privacy Implications Wahhab Albazrqaoe, Jun Huang, Guoliang Xing ACM MOBISYS, 2016 [Full list] Students Cheng Shen, PhD 2018~, PKU President Scholarship 2021. Tian Liu, MS 2021, joined Alibaba Zhen Tan, MS 2021, joined Tencent Jia Shen, BS 2020, now MS@PKU Zhiyuan Xie, BS 2019, now PhD@CUHK Ziyu Liu, BS 2018, now at Facebook",
  "content_length": 2086,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:53"
}