{
  "name": "Jun Han 0001",
  "homepage": "https://www.junhan.org",
  "status": "success",
  "content": "Jun Han, Ph.D.Search this siteEmbedded FilesSkip to main contentSkip to navigationJun Han (한 준)Associate ProfessorCyber-Physical Systems and Security (CyPhy) LabSchool of ComputingKAISTOffice: N1 #901Phone: (+82)42-350-3516E-mail: jun.han@kaist.ac.kr     junhan@cyphy.kaist.ac.krAbout meI am an Associate Professor in the School of Computing at KAIST. I lead the Cyber-Physical Systems and Security (CyPhy) Lab. Prior to joining KAIST, I had an appointment at the Department of Computer Science, School of Computing at the National University of Singapore, and the School of Electrical and Electronic Engineering at Yonsei University. My research interests are in the intersection of sensing systems and security, and focus on utilizing contextual information for security applications in the Internet-of-Things (IoT) and Cyber-Physical Systems (CPS). I obtained my Ph.D. in Electrical and Computer Engineering at Carnegie Mellon University. I received M.S. and B.S. degrees from the ECE Department at CMU in 2007 and 2006, respectively.To prospective students:I am hiring new graduate students (M.S./Ph.D. students), undergraduate interns, and post-doctoral researchers. I am looking for motivated and passionate students to work on exciting research projects! Please contact me if you are interested.세계를 선도하는 최고 수준 연구에 참여하고 싶으신 분들은 (학부/석사/박사/포닥) 연락 바랍니다.Current and Past AffiliationsResearch InterestsWe propose Sensing-Augmented Physical AI, a novel computing paradigm that is at the intersection of sensing/mobile systems, security, and artificial intelligence. This paradigm focuses on leveraging physical context and multimodal sensor data to enhance security and intelligence in emerging systems such as smart devices, drones, vehicles, smart homes, and factories. Specifically, our research explores areas including, but not limited to: (1) Physical AI-based Sensing Augmentation, (2) Physical Hacking, and (3) Physics-guided Secure Authentication. Some of the keywords describing our research include:Emerging Systems (Vehicles, Drones, Wireless, and Embedded Systems) Sensing and Mobile Systems Internet-of-Things (IoT) and IoT Security Cyber-Physical Systems (CPS) and CPS Security Click to see more infoSelected PublicationsWe publish Top Conference papers in:#Security: S&P (Oakland), USENIX Security, CCS, NDSS#Mobile / #Ubiquitous Computing: MobiSys, MobiCom, UbiComp/IMWUT#Sensing Systems: SenSys, IPSN#HCI: UIST#Computing Systems: USENIX ATC >> Complete publication list available here.  >> Google Scholar Profile: https://bit.ly/JunHan_Google_Scholar[#Security] [NDSS'26] Peering Inside the Black-Box: Long-Range and Scalable Model Architecture Snooping via GPU Electromagnetic Side-Channel (To appear)Rui Xiao, Sibo Feng, Soundarya Ramesh, Jun Han, and Jinsong HanNetwork and Distributed System Security Symposium[#HCI] [UIST'25] UniKey: Enabling Surface-Based Typing with Commodity Smartwatches via Cross-Modal LearningSean Rui Xiang Tan, Mun Choon Chan, and Jun HanACM Symposium on User Interface Software and TechnologyAcceptance Rate: 22.2% (210 of 947)[ paper | slides | teaser ][#Mobile] [MobiSys'25] CAMPrints: Leveraging the \"Fingerprints\" of Digital Cameras to Combat Image TheftBangjie Sun, Mun Choon Chan, and Jun HanACM International Conference on Mobile Systems, Applications, and ServicesAcceptance Rate: 18.0% (42 of 233)[ paper | slides | video ]* 🏆 BEST POSTER AWARD (*Poster accompanied full paper)[#Security] [NDSS'25] Lend Me Your Beam: Privacy Implications of Beamforming Feedback Packets in WiFiRui Xiao, Xiankai Chen, Yinghui He, Jun Han, and Jinsong HanNetwork and Distributed System Security SymposiumAcceptance Rate: 16.1% (211 of 1311)[ paper | slides | video ][GetMobile'24] A Smartphone to the Rescue: Detecting Counterfeit Powdered Food Products (Invited Article)Jonghyuk Yun, Kyoosik Lee, Kichang Lee, Bangjie Sun, Jaeho Jeon, JeongGil Ko, Inseok Hwang, and Jun HanACM GetMobile: Mobile Computing and Communications[ paper ][#Sensing] [SenSys'24] Don’t Crosstalk to Me: Origami Structure-Augmented Sensing for Scalable Surface Pressure MonitoringShubham Rohal, Dong Yoon Lee, Carlos Ruiz, Joshua Zhang, Jonathon Fagert, Jun Han, and Shijia PanACM Conference on Embedded Networked Sensor SystemsAcceptance Rate: 18.5% (58 of 313)[ paper ][#Security] [USENIX Security'24] Can I Hear Your Face? Pervasive Attack on Voice Authentication Systems with a Single Face ImageNan Jiang, Bangjie Sun, Terence Sim, and Jun HanUSENIX Security SymposiumAcceptance Rate: 18.3% (417 of 2276)[ paper | slides | video ][#Mobile] [MobiSys'24] PowDew: Detecting Counterfeit Powdered Food Products using a Commodity Smartphone  Jonghyuk Yun, Kyoosik Lee, Kichang Lee, Bangjie Sun, Jaeho Jeon, JeongGil Ko, Inseok Hwang, and Jun HanACM International Conference on Mobile Systems, Applications, and ServicesAcceptance Rate: 16.3% (43 of 263)[ paper | slides | project website ]* 🏆 BEST PAPER AWARDFeatured on several Korean major news/media including: YTN (video), Yonhap, Chosun, DongA, SE Daily, KAIST News, and more. [HotMobile'24] ImpacTile: Tile-level Localization for the Visually Impaired using Structural UniquenessCherry Kim, Seongjin Wang, Dongjun Kim, Shijia Pan, and Jun Han ACM International Workshop on Mobile Computing Systems and Applications[ paper | slides ][#Sensing] [SenSys'23] Testing Masks and Air Filters With Your SmartphonesBangjie Sun, Kanav Sabharwal, Gyuyeon Kim, Mun Choon Chan, and Jun HanACM Conference on Embedded Networked Sensor SystemsAcceptance Rate: 18.9% (34 of 179)[ paper | slides ][#Mobile] [MobiCom'23] MagTracer: Detecting GPU Cryptojacking Attacks via Magnetic Leakage Signals Rui Xiao, Tianyu Li, Soundarya Ramesh, Jun Han*, and Jinsong Han* (*co-corresponding)ACM International Conference On Mobile Computing And NetworkingAcceptance Rate: 24.4% (92 of 377)[ paper ][#Ubiquitous] [UbiComp'23/IMWUT] Don't Weight to Board: Augmenting Vision-based Passenger Weight Prediction via Viscoelastic Mat Jong Taek Lee, Yu Kai Lim, Shijia Pan, and Jun HanACM International Joint Conference on Pervasive and Ubiquitous Computing[ paper ][HotMobile'23] RampScope: Ramp-level Localization of Shared Mobility Devices using Sidewalk RampsJonghyuk Yun, Gyuyeon Kim, Soundarya Ramesh, and Jun HanACM International Workshop on Mobile Computing Systems and Applications[ paper | slides ]* 🏆 BEST POSTER AWARD (*Poster accompanied full paper)[HotMobile'23] ThermWare: Towards Side-channel Defense for Tiny IoT DevicesNakul Garg, Irtaza Shahid, Erin Avllazagaj, Jennie Hill, Jun Han, and Nirupam RoyACM International Workshop on Mobile Computing Systems and Applications[ paper ][#Security] [CCS'22] TickTock: Detecting Microphone Status in Laptops Leveraging Electromagnetic Leakage of Clock Signals Soundarya Ramesh,  Ghozali Suhariyanto Hadi, Sihun Yang, Mun Choon Chan, and Jun Han ACM Conference on Computer and Communications SecurityAcceptance Rate: 22.4% (218 of 972)[ paper | slides ][#Mobile] [MobiSys'22] Detecting Counterfeit Liquid Food Products in a Sealed Bottle Using a Smartphone Camera Bangjie Sun, Sean Rui Xiang Tan, Zhiwei Ren, Mun Choon Chan, Jun HanACM International Conference on Mobile Systems, Applications, and ServicesAcceptance Rate: 21.6% (38 of 176)[ paper | slides | video | teaser | project website ]* 🏆 BEST POSTER AWARD (*Poster accompanied full paper)Featured on several Korean major news/media including: YTN (video), Chosun, Boan News, DongA, and more. [#Ubiquitous] [UbiComp'22/IMWUT] On Privacy Risks of Watching YouTube over Cellular Networks with Carrier Aggregation Nitya Lakshmanan, Abdelhak Bentley, Byoungjun Choi, Roger Zimmermann, Jun Han, and Min Suk KangACM International Joint Conference on Pervasive and Ubiquitous Computing[ paper | slides ][HotMobile'22] EarWalk: Towards Walking Posture Identification using EarablesNan Jiang, Terence Sim, and Jun HanACM International Workshop on Mobile Computing Systems and Applications [ paper | slides | video ][#Sensing] [SenSys'21] LAPD: Hidden Spy Camera Detection using Smartphone Time-of-Flight SensorsSriram Sami, Sean Rui Xiang Tan, Bangjie Sun, and Jun HanACM Conference on Embedded Networked Sensor SystemsAcceptance Rate: 18.0% (29 of 139)[ paper* | slides | video | demo vid | teaser | project website ]*Most downloaded paper across all years of ACM SenSys publications until present [ link ]*Top 3rd most downloaded paper across all years of ACM Sigmobile publications until present [ link ] Featured on several news/media including: Forbes, The Register, Y Combinator's Hacker News, and Techlog360.[#Security] [USENIX Security'21] Acoustics to the Rescue: Physical Key Inference Attack RevisitedSoundarya Ramesh, Rui Xiao, Anindya Maiti, Jong Taek Lee, Ananda Kumar, Harini Ramprasad, Murtuza Jadliwala, and Jun HanUSENIX Security SymposiumAcceptance Rate: 18.7% (246 of 1316)[ paper | slides | video ][#Security] [USENIX Security'21] A Stealthy Location Identification Attack Exploiting Carrier Aggregation in Cellular NetworksNitya Lakshmanan, Nishant Budhdev, Min Suk Kang, Mun Choon Chan, and Jun HanUSENIX Security SymposiumAcceptance Rate: 18.7% (246 of 1316)[ paper | slides | video ]*GSMA MOBILE SECURITY HALL OF FAME[#Mobile] [MobiSys'21] FastZIP: Faster and More Secure Zero-Interaction PairingMikhail Fomichev, Julia Hesse*, Lars Almon, Timm Lippert, Jun Han*, and Matthias Hollick* (*co-corresponding)ACM International Conference on Mobile Systems, Applications, and ServicesAcceptance Rate: 21.7% (36 of 166)[ paper | teaser | video ][#Sensing] [SenSys'20] Spying with Your Robot Vacuum Cleaner: Eavesdropping via Lidar SensorsSriram Sami, Yimin Dai, Sean Tan Rui Xiang, Nirupam Roy, and Jun HanACM Conference on Embedded Networked Sensor SystemsAcceptance Rate: 20.2% (43 of 213)[ paper | slides | teaser | video ]Featured on several news/media including: Forbes, ZDNet, Hacker.io, ThreatPost, Slashdot, Boan News (Korean), CNA (Singapore's mainstream news), and NUS News.* 🏆 BEST POSTER RUNNER-UP AWARD (*Poster accompanied ful",
  "content_length": 14368,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:53"
}