{
  "name": "Jun Gao 0004",
  "homepage": "https://www.cs.toronto.edu/~jungao",
  "status": "success",
  "content": "Jun Gao Jun Gao I am currently a senior research scientist at NVIDIA. I will join the University of Michigan in the EECS department as an assistant professor in Fall 2025. I received my Ph.D. from the University of Toronto, advised by Prof. Sanja Fidler. My research stays at the intersection of computer vision, computer graphics and generative models. I am interested in developing gnerative world simulators that are controllable, consistent, interpretable and scalable for realistic interactions with humans and autonomous agents. Prospective students: I am actively looking for motivated and talented students! If you are interested in joining my group, please read this. Email  / CV  / Google Scholar / Twitter  / Github  /  Pro Bono News Pro Bono: I decide to commit 1-2 hours per week to host pro bono office hours and provide guidance and mentorship for students, especially people from underrepresented groups. Please check here for more details. June 2025: Two papers are accepted to ICCV 2025. Mar. 2025: Three papers are accepted to CVPR 2025. Two Orals and one Highlight. Mar. 2025: I will serve as an Area Chair for NeurIPS 2025. Jul. 2024: One paper is accepted to SIGGRAPH Asia 2024. Jul. 2024: One paper is accepted to ECCV 2024. May 2024: I will serve as an Area Chair for 3DV 2025. May 2024: I will serve as an Area Chair for NeurIPS 2024. Mar. 2024: I will serve on the program committee for SIGGRAPH Asia 2024. Jan. 2024: One paper is accepted to ICLR 2024. Dec. 2023: Our paper received the Best Paper Award at SIGRAPH Aisa 2023. Publications (show selected / show by date) Professional Service Program Committee: SIGGRAPH Asia 2024. Area Chair: NeurIPS 2023-2025. 3DV 2025. Conference Reviewer: CVPR, ICCV, ECCV, NeurIPS, ICML, ICLR, SIGGRAPH, SIGGRAPH Asia. Employment Research scientist at NVIDIA Dec. 2019 - Present Research intern at NVIDIA Oct. 2018 - Dec. 2019 Research intern at Microsoft Research, Asia Sep. 2017 - Jun. 2018 Mentored Students/Interns Xuanchi Ren (PhD, CS UofT) Working on 3D scene generation. Tianchang Shen (PhD, CS UofT) Working on differentiable isosurfacing methods. Weiwei Sun (PhD, CS UBC) Working on 3D generative models. Zian Wang (PhD, CS UofT) Working on lighting decomposition with differentiable renderers. Jinchen Xuan (Undergrad, CS PKU) Working on geometric image representation. Gary Leung (MSc, CS UofT) Working on Transformer for images. Yuxuan Zhang (Undergrad, CS UWaterloo) Working on single image 3D reconstruction. Yinan Zhang (Undergrad, CS UWaterloo) Working on single image 3D reconstruction. Pro Bono Office Hours As a fifth-year PhD student, I always see the information asymmetry between junior students and senior students on problems related to research topics/directions, future career, failure and excitement in research. This problem is more severe for people from underrepresented group. Following Krishna, Wei-Chiu and Shangzhe, I decide to commit 1-2 hours per week (mostly on Sunday) to host pro bono office hours and provide guidance, suggestions or mentorship, please fill this form if you are interested. I borrowed the template from ✩, ✩,✩,✩.",
  "content_length": 3133,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:51"
}