{
  "name": "Jun Rekimoto",
  "homepage": "http://www.iii.u-tokyo.ac.jp/faculty/rekimoto_junichi",
  "status": "success",
  "content": "暦本 純一 - 東京大学大学院 情報学環・学際情報学府 ホームHome 教員Faculty 暦本 純一REKIMOTO,Junichi 教員 Faculty Filter by Course すべてAll 社会情報学コースSocio-info comm 文化・人間情報学コースCultural Human 先端表現情報学コースEmerging Design 総合分析情報学コースApplied Cs アジア情報社会コースITASIA 生物統計情報学コースBIOSTAT 情報学環教育部Undergrad 教授 暦本 純一 Professor REKIMOTO,Junichi LAB WEBSITE Rekimoto Lab https://lab.rekimoto.org 総合分析情報学コース 研究テーマ 実世界指向インタフェース 区分： 学環所属（基幹・流動教員） Applied computer science course Research Theme Position: III Faculty (Core & Mobile) 略歴 博士（理学）（東京工業大学） 1961年 東京都生まれ 1986年 東京工業大学大学院 理工学研究科 情報科学科 修士過程修了 1986年 日本電気株式会社に勤務（～1992年） 1992年 カナダ・アルバータ大学 コンピュータグラフィックス研究所 研究員（～1993年） 1994年 株式会社ソニーコンピュータサイエンス研究所に勤務 1996年 東京工業大学大学院 理工学研究科より、博士（理学）取得 1999年 株式会社ソニーコンピュータサイエンス研究所 インタラクションラボラトリー室長 2007年 東京大学大学院 情報学環 教授（兼 ソニーコンピュータサイエンス研究所） 2010年 多摩美術大学 客員教授（～2011年） 主要業績 詳細な業績は>暦本純一研究室（Publications）をご覧ください。 関連リンク https://www.sonycsl.co.jp/person/rekimoto.j.html Related Links https://www.sonycsl.co.jp/person/rekimoto.j.html ヒューマンコンピュータインタラクション、すなわち「人間とコンピュータ（あるいはコンピュータに象徴される人工物や人工環境）のより快適な関係」 を研究しています。狭い意味での「ユーザインタフェース」だけではなく、センシングやライフログなど空間的・時間的な広がりを持ったものも研究領域として います。とくに以下のテーマに興味をもって研究を進めています。 実世界指向インタフェース 現実世界で生活する人間に対する自然なインタラクション手段を提供します。たとえば図１はSmartSkinと呼ぶテーブル内に組み込まれた電界セ ンサーによって人間の微妙な手の動きを認識している例です。このようなセンシング技術とインタラクションの融合により、生活環境の多様な場面がデジタル世 界と自然に融合していきます。人間が本来もつ（指先の感覚のような）洗練されたインタラクション能力を引き出すためのセンシングや、建築空間などと一体化 したインタラクションなどを構築しています。 センソノミーSensonomy 単一のセンサーから得られる情報の価値は限られていますが、それを地球的規模で収斂させていくと新たな意味が生まれます。これをソーシャルタギング やフォークソノミーになぞらえて「センソノミー（Sensonomy）」と呼んでいます。たとえば各モバイル機器がセンスするWiFi電波状況を収集する と、WiFiから位置情報を求めるためのインフラが構築可能になります（図２）。このようにしてリアルワールドとネットワーク世界を大規模に融合させる アーキテクチャーやアプリケーションに興味を持っています。 ライフロングコンピューティング 人間と行動を共にしてすべてを記録するライフログや、その解析・応用などがテーマです。ライフタグ（LifeTag）と呼ぶ超小型位置記録デバイス を試作し、長期間にわたる精密な位置行動履歴の取得を可能にしました（図３）。これにより、行動パターンを手がかりにする、ある種の「記憶検索エンジン」 が構築可能となり、「記憶能力のテクノロジーによるサポート」につながるものだと考えています。また、人間の記憶がネットワーク化して他者とつながってい くなど、従来の「記憶」の概念を超えた展開を想定しています。 研究を進めるにあたって 以上のようなテーマは、多岐にわたる基盤技術の上に成り立っています。主にコンピュータサイエンス・ネットワーク・センシング・データマイニングな どの知見を使いますが、何より大事なのは「未来をイメージする力」でしょう。こんなことが可能になったら世界はどう変化するのだろうか。どんな便利な世の 中ができるのか。自分は何が欲しいのだろうか。を大胆にイメージし、それをテクノロジーで具現化していく。必要な知識や技術は目的ドリブンで、どんどん学 んでいくという態度が重要なのではないかと思います。 大学院志望のみなさんへ 暦本研は2007年に発足した新しい研究室ですが、多様なバックグラウンドを持つ学生達と「未来を自ら創り体験する」をモットーに研究を進めています。国内外の研究機関・デザイン拠点などとのコラボレーションも推進しています。一緒に未来を創りましょう。",
  "content_length": 2283,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:57"
}