{
  "name": "Jun Kong",
  "homepage": "http://www.cs.ndsu.nodak.edu/~jkong",
  "status": "success",
  "content": "Jun Kong's home page Jun Kong Professor Phone: (701)-231-8179 Fax:    (701)-231-8255 Email: jun.kong AT ndsu.edu Education Ph.D. Computer Science, The University of Texas at Dallas, 2005. M.S. Computer Science, Shanghai Jiao Tong University, 2001. B.S. Computer Science, Huazhong University of Science and Technology, 1998. Research Interests · Human Computer Interaction · Pervasive Computing ·       Software Engineering Publications: Journals Yiming Liu, Seyed A. Moghaddas, Shuomang Shi, Ying Huang, Jun Kong, Yi Bao, Review on applications of computer vision techniques for pipeline inspection, Measurement, 2025. Z. H. Yang and J. Kong, Cue-based Two Factor Authentication, Computers & Security, Vol. 146, 2024. M. O. Miah and J. Kong, Augmented Reality and Cross-Device Interaction for Seamless Integration of Physical and Digital Scientific Papers, International Journal of Human-Computer Interaction, https://doi.org/10.1080/10447318.2024.2388372, 2024. T. X. Shi, R. A. McCann, Y. Huang, W. Wang, and J. Kong, Malware Detection for Internet of Things Using One-Class Classification, Sensors, 24(13): 4122, 2024. W. U. Hasan, K. T. Zaman, S. Alian, T. Y. Liang, V. Pandey, J. Kong, C. Tao, and J. Li, Bridging Culture and Care: A Mobile App for Diabetes Self-Care Honoring Native American Cultural Practices, Advances in Science, Technology and Engineering Systems Journal, 9(1), pp. 104-113, 2024. S. Q. Liu, H. K. Zhang, Z. H. Yang, J. Kong, L. M. Zhang, and C. H. Gao, UXBIV: An Evaluation Framework for Business Intelligence Visualization, IEEE Access, Vol. 11, pp. 92391-92415, 2023. Z. Huang, Y. N. Li, and J. Kong, Investigating the Pointing Techniques in the Tabletop-Centric Cross-Device Interaction: A Comparative Study, Multimedia Tools and Applications, 2022. J. C. Yang, J. Kong, C. Y. Zhao, A Smartphone-based Pointing Technique in Cross-Device Interaction, Sensors, Feb. 2021. Z. Y. Meng, J. Kong, and J. Li, Utilizing Binary Code to Improve Usability of Pressure-based Authentication, Computer & Security, Jan. 2021. C. Y. Zhao, C. Chen, K. Zhang, and J. Kong, ViBERT: Visual Behavior Regression Testing, Journal of Visual Language and Computing (KSI Publisher), Volume 2020, Number 2, 2020. S. Q. Liu, T. Y. Liang, S. Shao and J. Kong, Evaluating Localized MOOCs: The Role of Culture on Interface Design and User Experience, IEEE Access, Volume 8, pp.107927-107940, 2020. Z. Huang and J. Kong, A Toolkit for Prototyping Tabletop-Centric Cross-Device, Interactional Journal on Human Computer Interaction, Volume 36(6), pp.536-552, 2020. Y. F. Liu, K. Zhang, J. Kong, Y. Zou, and X. Q. Zeng, Spatial Specification and Reasoning Using Grammars: From Theory to Application, Spatial Cognition and Computation, Vol. 18(4), pp. 315-340, 2018. D. Wang, C. Y. Zhao, and J. Kong, The Fusion of Ultrasonic and Spatially Aware System in Mobile-Interaction Device, Symmetry, Vol. 9(8), 2017. Z. Huang, J. Limke, and J. Kong, Investigating One-Handed and Two-Handed Inter-Device Interaction, Journal of Visual Languages and Computing, Vol. 42, pp. 1-12, 2017. S. Ludwig, and J. Kong, Investigation of Different Classifiers and Channel Configurations of a Mobile P300-based Brain-Computer Interface, Medical & Biological Engineering & Computing, Vol. 55(12), pp.2143-2154, 2017. Jie Li, Zhao Xiao, and Jun Kong, A Viewpoint Based Approach to the Visual Exploration of Trajectory, Journal of Visual Languages and Computing, Vol. 41, pp.41-53, 2017. Q. Obeidat, T. Campbell, and J. Kong, Spelling with a Small Mobile Brain-Computer Interface in a Moving Wheelchair, IEEE Transactions on Neural Systems & Rehabilitation Engineering, Vol. 25(11), pp. 2169-2179 2017. V. Chintapalli, W.Y. Tao, Z. P. Meng, K. Zhang, J. Kong, and Y. Ge, A Comparative Study of Spreadsheet Applications on Mobile Devices, Mobile Information Systems, Volume 2016, Article ID 9816152, 2016. A. Roudaki, J. Kong, and S. Reetz, SmartCamera: A Low Cost and Intelligent Camera Management System, Multimedia Tools and Applications, Volume 75, Issue 13, pp. 78317854, 2016. N. Yu, and J. Kong, User Experience with Web Browsing on Small Screens: Experimental Investigations of Mobile-Page Interface Design and Homepage Design for News Websites, Information Sciences, Vol.330, pp. 427-443, 2016. A. Roudaki, J. Kong, and K. Zhang, Specification and Discovery of Web Patterns: A Graph Grammar Approach, Information Sciences, Vol.328, pp. 528-545, 2016. Q. Obeidat, T. Campbell, and J. Kong, Introducing the Edges Paradigm: a P300 Brain-Computer Interface for spelling written words, IEEE Transactions on Human-Machine Systems, Vol.45(6), pp. 727-738, 2015. A. Roudaki, J. Kong, N. Yu, A Classification of Web Browsing on Mobile Devices, Journal of Visual Languages and Computing, 26, pp. 8298, 2015. A. Roudaki, J. Kong, G. Walia, and Z. Huang, A Framework for Bimanual Inter-Device Interactions, Journal of Visual Languages and Computing, 25(6), pp. 727-737, 2014 (An extension of the DMS conference publication). A. Roudaki, J. Kong, G. Walia, A. Roudaki, PhoneLens: A Low-cost Spatially-aware Mobile Interaction Device, IEEE Transactions on Human-Machine Systems, 44(3), pp. 301-314, 2014. K. Chinthakayala, C. Zhao, J. Kong and K. Zhang, A Comparative Study of Three Social Networking Websites, WWW Journal, 17(6), pp.1233-1259, 2014. A. Sehgal. C. Zhao, and J. Kong, Automatic Evaluation of mobile Web pages, International Journal of Handheld Computing Research, 4(3), 2013. J. Kong, O. Barkol, R. Bergman, A. Pnueli, S. Schein, C. Y. Zhao, and K. Zhang, Web Interface Interpretation Using Graph Grammars, IEEE Transactions on SMC  Part C, 42(4), pp. 590-602, 2012. H. Ahmadi and J. Kong, User-Centric Adaptation of Web Information for Small Screens, Journal of Visual Languages and Computing, Vol.23(1), pp. 13-28, 2012. Y. Potla, R. Annadi, J. Kong, G. Walia, and K. Nygard, Adapting Web Page Tables on Mobile Devices, International Journal of Handheld Computing Research, 3(1), pp. 1-22, 2012,. J. Kong, W. Y. Zhang, N. Yu and X. J. Xia, Design of Human-Centric Adaptive Multimodal Interfaces, International Journal of Human Computer Studies, Vol.69(12), pp. 854-869, 2011. W. Zhang and J. Kong, Multi-Constrained QoS Routing for Distraction-free Service in Pervasive Environment, Journal of Next Generation Information Technology, Vol.1(2), pp. 35-44, 2010. C. Y. Zhao, J. Kong, and K. Zhang, Program Behavior Discovery and Verification: A Graph Grammar Approach, IEEE Transactions on Software Engineering, Vol.36(3),  pp. 431-448, 2010. J. Kong, D. Xu, and X. Zeng, UML-based Modeling and Analysis of Security Threats, International Journal of Software Engineering and Knowledge Engineering, Vol.20(6), pp. 875-897, 2010. W. Zhang, J. Kong, K. Nygard, and M. Li, Adaptive Design of Pervasive Computing System Under QOS Constraints, International Journal of Computers and Applications, Vol. 32(4), pp. 482-492, 2010. J. Kong, K. Zhang, J. Dong, and D. Xu, Specifying Behavioral Semantics of UML Diagrams Through Graph Transformations, Journal of Systems and Software, Vol.82(2), pp. 292-306, 2009. J. Kong and C. Y. Zhao, Visual Language Techniques for Software Development, Journal of Software, Vol.19(8), pp. 1902-1919, 2008. C. Y. Zhao, J. Kong, J. Dong, and K. Zhang, Pattern Based Design Evolution Using Graph Transformation,  Journal of Visual Languages and Computing, Vol.18(4), pp. 378-398, 2007. J. Kong, K. Zhang, and X. Q. Zeng, Spatial Graph Grammars for Graphical User Interfaces, ToCHI - ACM Transactions on Computer-Human Interaction, Vol.13(2), pp. 268-307, 2006. G. L. Song, J. Kong, and K. Zhang, AutoGen: Easing Model Management through Two Levels of Abstraction, Journal of Visual Languages and Computing, Vol.17(6), pp. 508-527, 2006. K. Zhang, J. Kong, M.K. Qiu, and G.L. Song, Multimedia Layout Adaptation Through Grammatical Specifications, ACM/Springer Multimedia Systems, Vol.10(3), pp. 245-260, 2005. Book Chapters K. Zhang, J. Kong, and J. Cao, Visual Software Engineering, In B. Wah (Ed.) Encyclopedia of Computer Science and Engineering, Wiley & Sons, 2004. Refereed Conference Publications B. Maharjan, J. Li, J. Kong, and C. Tao, Alexa, What Should I Eat? - A Personalized Virtual Nutrition Coach for Native American Diabetes Patients Using Amazon's Smart Speaker Technology, IEEE HealthCom, 2019. X. Q Zeng, Y. F. Liu, Z. Shi, Y. F. Wang, Y. Zou, J. Kong and Kang Zhan, An Edge-based Graph Grammar Formalism and its Support System, Proc. 24th International DMS Conference on Visualization and Visual Languages, 2018. J. Li and J. Kong, Cell phone-based diabetes self-management and social networking system for American Indians, 2016 IEEE 18th International Conference on e-Health Networking, Applications and Services (Healthcom), 2016. Z. Huang, J. Limke, J. Kong, A Comparative Study on Inter-Device Interaction: One-Handed Interaction VS Two-Handed Interaction, Proc. VINCI 2016, 2016. K. Liao, J. Kong, K. Zhang and B. D. Vries, Design and validation of dynamic hierarchies and adaptive layouts using spatial graph grammars, Proc. 2015 GeoComputation Conference, 2015. J. Li, Z. Xiao, and J. Kong, Exploring 3D trajectory visualization in a virtual environment, Proc. 2015 GeoComputation Conference, 2015. A. Roudaki, J. Kong, G. Walia, A Framework for Bimanual Inter-Device Interactions, Proc. DMS, 2014. Q. Obeidat, T. Campbell and J. Kong, The Zigzag Paradigm: A new P300-based Brain Computer Interface, ACM International Conference on Multimodal Interaction, 2013. A. Roudaki and J. Kong, Graph Grammar Based Web Data Extraction, International Conference on Software Engineering and Knowledge Engineering, 2011. K. E. Nygard, L. Bender, G. Walia, J. Kong, K. Gagneja, and M. LeNoue, Collaboration Using Social Networks for Team Projects, International Conference on Frontiers in Education: Computer Science and Computer Engineering, 2011. K. Zhang and J. Kong, E",
  "content_length": 18509,
  "method": "requests",
  "crawl_time": "2025-12-01 13:37:55"
}