{
  "name": "Jun Zheng 0003",
  "homepage": "https://nmt.edu",
  "status": "success",
  "content": "Science | Engineering | Research Institution: New Mexico Tech Skip to main content One of the Nation's Top STEM Schools Fall 2026 Application Now Available Get a head start on your Tech experience! New Mexico Tech is Test Optional with a 3.0 GPA or higher for admissions consideration. Apply Here!Office of Admission Prospective Students Our Academic Programs Your path to financial and career success Great National Rankings Undergraduate Research Opportunities Undergraduate Admission Graduate Admission Start Your Journey NMT News Night at the Nuclear Museum Celebrates NMT’s Connections with Sandia Labs and Manhattan ProjectNov. 25, 2025 Quilt show display at Macey Center mimics children’s game Telephone TagNov. 12, 2025 Scottish Music coming to Macey CenterNov. 11, 2025 Local actors go ‘absurd’ in next performanceNov. 11, 2025 November SkiesOct. 28, 2025 see all news NMT by the Numbers #1 NMT Ranked #1 Public University in New Mexico - Niche.com and College Simply #1 NMT Ranked #1 Best Value College - Niche.com #1 CoSMiC Collegiate Space Mining Competition NMT Academics Biology Biology Business and Technology Management Business and Technology Management Chemistry Chemistry Chemical Engineering Chemical Engineering Civil Engineering Civil Engineering Communication, Liberal Arts, Social Science Communication, Liberal Arts, Social Science Computer Science & Engineering Computer Science & Engineering Earth & Environmental Science Earth & Environmental Science Electrical Engineering Electrical Engineering Environmental Engineering Environmental Engineering Information Technology Information Technology Materials and Metallurgical Engineering Materials and Metallurgical Engineering Mathematics Mathematics Mechanical Engineering Mechanical Engineering Mineral Engineering Mineral Engineering Petroleum and Natural Gas Engineering Petroleum and Natural Gas Engineering Physics Physics Psychology and Education Psychology and Education Technical Communication Technical Communication Transdisciplinary Programs Transdisciplinary Programs Find Your Academic Program Apply to NMT Paying for School @NewMexicoTech NMT Research Divisions Bureau of Geology and Mineral Resources Bureau of Geology and Mineral Resources Energetic Materials Research and Testing Center Energetic Materials Research and Testing Center Etscorn Campus Observatory Etscorn Campus Observatory Langmuir Laboratory Langmuir Laboratory Petroleum Recovery Research Center Petroleum Recovery Research Center Mount Erebus Volcano Observatory Mount Erebus Volcano Observatory GO-TECH GO-TECH Institute for Complex Additive Systems Analysis Institute for Complex Additive Systems Analysis MicroElectronics Testing and Technology Obsolescence Program MicroElectronics Testing and Technology Obsolescence Program New Mexico Bureau of Mine Safety New Mexico Bureau of Mine Safety National Cave and Karst Research Institute National Cave and Karst Research Institute National Radio Astronomy Observatory National Radio Astronomy Observatory IRIS PASSCAL IRIS PASSCAL Playas Research and Training Center Playas Research and Training Center Explore Research Life at Tech Student Life CLUBS, ORGANIZATIONS & RECREATION Join our students, who are making the most of their time spent outside the classroom. CAMPUS RECREATION Upcoming Events CLUBS, ORGANIZATIONS & RECREATION Nov 14 Breabach 7:30 pm - 9:30 pm Dec 1 Calc 2 SI Session (Dr. Wolford's section) 7:00 am - 8:00 am Full calendar back to top ©",
  "content_length": 3475,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:01"
}