{
  "name": "Junaed Sattar",
  "homepage": "http://www-users.cs.umn.edu/~junaed",
  "status": "success",
  "content": "Junaed Sattar | Junaed Sattar Skip to main content Junaed Sattar Junaed is on a sabbatical for the 2024-2025 academic year, and thus will not be taking on new students in Fall 2024 or Spring 2025.  Also, interested students are urged to look at the page here before getting in touch.Welcome to Junaed Sattar's home at the University of Minnesota! I am an Associate Professor of Robotics and HRI at the Department of Computer Science and Engineering, and the founding director of the Minnesota Interactive Robotics and Vision Laboratory.I am also a member of the Minnesota Robotics Institute, and an MNDrive RSAM (Minnesota Discovery, Research, and Innovation Economy-- Robotics, Sensors and Advanced Manufacturing initiative) faculty. My primary research focus is on making robots work safely and intuitively with people, so humans and robots can coexist and collaborate. This means looking into improving a robot's perception about the environment, and people-- their intentions, and/or actions, engaging in dialog. Perceiving the world robustly, particularly under changing and degraded conditions, is an open challenge, and thus my research interest extends into multi-modal sensory perception. My past research has been heavily influenced by making robots work with humans in unstructured environments, particularly underwater, and current and work involve field robots in the air, water, and outdoor, all-terrain platforms.If you are a prospective graduate student interested in robotics/HRI/field robotics /vision (any or all of these), please read this first. Click on these links to find a list of IRVLab publications and an updated resume.For specific information about my research and teaching, please browse through the links or visit the IRVLab website. IRVLab Website Home Bio Students Students For prospective students Teaching",
  "content_length": 1841,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:13"
}