{
  "name": "Junchi Yan",
  "homepage": "http://thinklab.sjtu.edu.cn",
  "status": "success",
  "content": "ï»¿ SJTU-ReThinkLab ä¸æµ·äº¤éå¤§å­¦äº¤æ³å®éªå®¤ Looking for full-time assistant researcher, post-doc, phd candidates, initiative (high GPA/proved research capability -- but NOT must) undergraduates, who are interested in machine learning and applications like (but NOT limited to) autonomous driving, quantum AI, crypto, combinatorial solvers, EDA, dexterous hand, and AI4Science. Please send me resume via yanjunchi AT sjtu.edu.cn. Update: we are also working on something -1->0, 0->1: new (e.g. quantum/pde-inspired) LLM architecture, new scaling law, formal methods for inference and scale up. Try to talk to me! Also feel free to contact me if you feel qualified to serve as a reviewer for TPAMI, PR, etc. Welcome to visit our x.com page SJTU-ReThinkLab ä¸æµ·äº¤éå¤§å­¦Rethinkå®éªå®¤ Junchi Yan Professor (tenured), Fellow of IAPR/IET/AAIA/NAAI Faculty of SJTU AI School & CS School (affiliated) Founding Program Director of Zhiyuan AI Elite Class Founding Assistant Director of SJTU MoE Lab of AI Founding Assistant Director of SJTU AI School Former Principal Researcher with IBM Research Former Affiliated Researcher with AWS AI Lab Visiting Professor of NII Japan, MBZUAI Board Member of ICML (first in mainland) Founding Vice Secretary of AI4Science Union Founding Board Member of SH Quantum AI Union Area Chair for ICLR/ICML/NeurIPS/CVPR/KDD etc. Associate Editor for TPAMI/TMLR/TOPML/PRJ Reviewer for Nature Comm./PNAS Nexus etc. Minhang Campus Former Administrative Building Xuhui Campus AI School Building School of Artificial IntelligenceSchool of Computer Science (affiliated)Zhiyuan College (affiliated)Shanghai Jiao Tong University Homepage visit history since May 2, 2018: Recent news â 2025/12 I give a keynote talk at CCF-CHEC2025 2025/11 I serve as Action Editor for TMLR 2025/11 Three papers (oral 1st authored by undergrad.) were accepted by AAAI 2026 2025/11 Congrats. Yehui to join Shanghai AI Lab as Research Scientist 2025/10 Congrats. Qibing/Tianyi to join SJTU AI/INS as AP/Research AP 2025/09 Our paper was awarded as IROS Best Paper Finalist 2025 2025/09 Fourteen papersï¼10 main+4 benchmark) are accepted by NeurIPS 2025 2025/08 Congrats. Ge Yan, Xinyu, Xingbo to join NTU, UNC, MBZUAI as Postdoc 2025/08 I was awarded IEEE-CIS Outstanding Early Career Award (only 1 globle) 2025/08 I will serve as Area Chair for CVPR, ICLR, AAMAS, PAKDD 2026 2025/08 Our paper was awarded as ACL Outstanding Paper 2025 2025/07 I was elected as ICML Board Member (1st from mainland, 3yr term) 2025/07 One paper (corr.) on active learning was accepted by IEEE TPAMI 2025/07 I was elected as the Corresponding Member NAAI 2025/07 Congrats. Shaofeng to join USTC AI as Assistant Professor 2025/06 One paper (corr.) on graph transformer was accepted by JMLR 2025/06 One paper (corr.) on visual outpainting was accepted by IEEE TPAMI 2025/06 Five papersï¼2 corr.) were accepted by ICCV 2025 2025/06 I will serve as Associate Editor for Engineering 2025/06 I will serve as Area Chair for AAAI 2026 2025/06 I will serve General PC for AIGC 2025 2025/06 Congrats. Renqiu to join SJTU AI as Assistant Professor 2025/05 Congrats. Hao & Liangliang & Xiaosong join Fudan as Assistant Professor 2025/05 Two papersï¼both corr., one for new arch.) were accepted by SIGKDD 2025 2025/05 Nine papersï¼7 corr.) were accepted by ICML 2025 2025/04 I was invited to be AAIA Fellow 2025/03 I was listed as Elsevier Highly Cited Chinese Researchers 2025 2025/02 Five papersï¼3 corr.) were accepted by CVPR 2025 2025/02 One paper (corr.) on object detection was accepted by IEEE TPAMI 2025/02 Congrats. Xue Yang to join SJTU Auto Dept. as an Assistant Professor 2025/02 Congrats. Master Student Jiaman to join Princeton as a PhD Student 2025/01 I will serve as Area Chair for SIGKDD/NeurIPS 2025 2025/01 Twenty one papersï¼18 corr.) were accepted by ICLR 2025 2024/12 Alumni Runzhong received CCF PhD Thesis Nomination Award 2024 2024/12 Student Xiaosong was awarded SJTU Scholar Star äº¤å¤§å­¦æ¯ä¹æ 2024 2024/11 I was elected as IEEE-CS AI's 10 to Watch 2024 (only one in mainland) 2024/11 I will serve as Area Chair for ICML and IJCAI 2025 2024/11 I serve on the Commitee Board for IET Fellow Assessment 2024/10 One paper (corr.) on concept bottleneck was accepted by IEEE TPAMI 2024/10 Student Xiaosong (è´¾è§æ¾) was awarded CCF-CV Fellowship æ°éå¥ 2024 2024/09 Sixteen papersï¼14 corr. & 3 benchmark) were accepted by NeurIPS 2024 2024/09 One paper GPT for Dunhuang literature was accepted by EMNLP 2024 2024/09 I was elected as IAPR Fellow 2024/08 One paper (corr.) on dynamic graph learning was accepted by IEEE TPAMI 2024/08 I will serve as Area Chair for ICLR 2025 2024/07 Outstanding/1st/2nd/3rd prizes CCF-Quantum Computing Contest 2024 2024/07 Two papersï¼one corr. for think2drive) were accepted by ECCV 2024 2024/06 I will serve as Area Chair for SIGKDD 2025 2024/06 Two papers (corr.) on quantum and EDA were accepted by ICCAD 2024 2024/06 A paper (corr.) on ML4CO was accepted by ä¸­å½ç§å­¦: ä¿¡æ¯ç§å­¦(ä¸­æç) 2024/06 No.1 (won 10/40 regular tracks) in EPFL Benchmark (IWLS) 2024 2024/06 Check out our closed-loop AD benchmark bench2drive! 2024/05 Our paper is awarded Best Paper Candidate for CVPR 2024 2024/05 Two ACL papers and two SIGKDD papers (3 corr.) were accepted 2024 2024/05 I will serve as an Associate Editor for IEEE TPAMI 2024/05 I will serve as Area Chair for NeurIPS 2024 and AAAI 2025 2024/05 Ten papersï¼9 corr.) were accepted by ICML 2024 2024/04 I was listed as ä¸­å½2023å¹´æºè½è®¡ç®åæ°äººç© by MIT Tech Review China 2024/04 Congrats Qitian to be a Broad Institute Post-doc hosted by MIT/Harvard 2024/04 I was awarded the 1st prize of Natural Science Award of Shaanxi Province 2024/03 I was listed as Elsevier Highly Cited Chinese Researchers 2024 2024/03 Student Xue Yang was awarded by SJTU PhD Thesis Award 2023 2024/03 Survey on autonomous driving was accepted by ä¸­å½ç§å­¦:ä¿¡æ¯ç§å­¦(ä¸­æç) 2024/02 Check out (in public literature) the first model-based RL4AD think2drive! 2024/02 Six papersï¼including 1 quantum & 1 Jittor) were accepted by CVPR 2024 2024/01 The Pygmtools toolkit (correspodence) was accepted by JMLR 2024/01 Two papers (both correspondences) were accepted by WWW 2024 2024/01 I was listed as CCF Distinguished Speaker 2023 2024/01 Thirteen papersï¼10 corr.) were accepted by ICLR 2024 2024/01 I will serve as Area Chair for SIGKDD 2024 2024/01 Deep Learning was rated as Shanghai 1st-class Undergraduate Course 2023/12 Survey (corr.) on visual prompt learning was accepted by è®¡ç®æºå­¦æ¥ 2023/12 Student Xue Yang was awarded by CCF PhD Thesis Award 2023 2023/12 Four papers (2 correspondences) were accepted by AAAI 2024 2023/12 Student Qitian Wu was awarded by SJTU Scholar Star äº¤å¤§å­¦æ¯ä¹æ 2023 2023/12 I (as advisor) was awarded Yau-award Golden Medal (ä¸ææ¡ä¸­å­¦ç§å­¦éå¥) 2023/12 I will serve as Area Chair for ICML & Senior PC for IJCAI 2024 2023/11 Paper on drug design was accepted by Nature Communications 2023 2023/10 The Deep Learning course was listed as Shanghai Major Course Program 2023/09 TS transformer survey rated No 1 influential IJCAI23 by PaperDigest 2023/09 Seven papers (6 corr. on regular track) were accepted by NeurIPS 2023 2023/09 I will serve as Area Chair for ICLR 2024 2023/09 Won quantum computing track for Challenge Cup æææ¯ç¹ç­å¥ 2023 2023/09 Won (supervisor) NSFC Undergraduate Fund æ¬ç§çèªç¶åºé for AI4PDE 2023/09 Won Champion in quantum chemistry for Mindspore-QC 2023 2023/08 Congrats. Runzhong Wang becomes an MIT Post-doc in AI4Science 2023/08 Won 1st (x2), 2nd, 3rd prizes for CCF-Quantum Computing Contest 2023 2023/07 Two papers (both corr.) were accepted by ICCAD 2023 (IWLS EPFL contest) 2023/07 Two papers (both corr.) on auto-driving and NAS were accepted by TPAMI 2023/07 Two papers (both corr.) were accepted by ICCV 2023 and two by ACM MM 2023/06 I was promoted to Full Professor (CSE Department) 2023/06 No.1 (won 12/40 regular tracks) in EPFL Benchmark (IWLS) 2023 2023/05 I serve as Area Chair (above SPC) for AAAI 2024 and ACM MM 2024 2023/05 Seven papers (all corr. & 1 on quantum ML) accepted by SIGKDD 2023 2023/04 Seven papers (all corr. & 4 on quantum ML) were accepted by ICML 2023 2023/04 Three papers (2 corr.) were accepted by IJCAI 2023 2023/04 I was elected to Vice Chair of Senior AC Committee VALSE 2023/03 Founding SAE for ACM Trans. on Probabilistic Machine Learning (TOPML) 2023/03 One paper (corr.) on joint clustering and matching was accepted by TPAMI 2023/03 One paper on MARL was accepted by JMLR 2023 2023/02 Four papers (2 correspondence) were accepted by CVPR 2023 2023/02 I will serve as an Area Chair for NeurIPS 2023 2023/02 Paper (corr.) on rotation detecton accepted by ä¸­å½ç§å­¦: ä¿¡æ¯ç§å­¦(ä¸­æç) 2023/02 Paper (corr.) on medicine recommendation was accepted by WWW 2023 2023/01 Thirteen papers (12 corr., 2 oral/spotlight) were accepted by ICLR 2023 2022/12 I organized and host the AI4Science Forum hold in PRCV 2022 (CCF-C) 2022/12 Student Xue Yang (æ¨å­¦) was awarded CCF-CV Fellowship æ°éå¥ 2022 2022/12 I will serve as an Area Chair/SPC for ICML & IJCAI 2023 2022/11 Two papers on TPP were accepted by LoG & AAAI 2023 2022/11 Awarded the Tencent Rhino Bird Brozen Medal (è ¾è®¯ççé¸ä¸­å­¦çç«èµé¶ç) 2022/09-11 I was elected as Senior CAAI Member & Distinguished CCF Member 2022/11 Two surveys on ML4MIP/ML4SAT (corr. author) were accepted by NC/MIR 2022/09 Eleven papers (all corr., 4 spotlight) were accepted by NeurIPS 2022 2022/10 Contributed to scientific questions on intelligent computing in Science 2022 2022/09 One paper (corr.) on autonomous driving were accepted by CoRL 2022 2022/08 One paper (corr.) on GNN was accepted by IEEE TNNLS 2022/08 One paper on MARL was accepted by AAMAS Journal 2022/08 One paper (corr.) on rotation detection was accepted by IEEE TPAMI 2022/07 Seven papers (3 corr.) were accepted by ECCV 2022 2022",
  "content_length": 16116,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:02"
}