{
  "name": "Junchen Jiang",
  "homepage": "https://people.cs.uchicago.edu/~junchenj",
  "status": "success",
  "content": "Junchen Jiang Junchen Jiang Welcome! I'm an Associate Professor at the Dept. of Computer Science at the University of Chicago, which I joined in July 2018. I'm currently on entrepreneurship leave. I received my B.A. in computer science from Tsinghua University (Yao Class). I received my PhD in computer science from Carnegie Mellon University in 2017 where I received the CMU SCS Doctoral Dissertation Award. I was advised by Vyas Sekar and Hui Zhang. Research interests: networked systems and machine learning systems. [Curriculum Vitae] If you are UChicago student (undergrad or grad) and interested in internship opportunities in my group, feel free to drop me an email with your CV. Recent Project LMCache: Long-Context LLM Serving by Sharing Knowledge (KV Cache) LMCache Project is open-source. Check it out! Technical reports: CacheGen(SIGCOMM'24) and CacheBlend(EuroSys'25 Best Paper). Articles: UChicago News. Talk: Talk at ML/AI Infra Meetup Professional Activities AI+Systems Seminar at UChicago Program Committee: SIGCOMM (2023, 2020, 2019), NSDI (2026, 2025, 2024, 2023, 2022, 2021), OSDI (2024), EuroSys (2024), HotNets (2022, 2021), CoNEXT (2024, 2023, 2021, 2020, 2019, 2018), ATC (2020, 2018), HotCloud (2018), APNet (2021, 2019, 2018), MMSys (2019, 2018) Organizing Committee: MobiCom 2021 HotEdgeVideo Workshop, SIGCOMM 2019 NetAI Workshop, Area Chair (Networking) JSys Awards Google ML and Systems Junior Faculty Award, 2025 ACM EuroSys, Best Paper, 2025 NSF CAREER, 2022 ACM/IEEE Symposium on Edge Computing (SEC), Best Paper Runner-up, 2021 ACM/IEEE Symposium on Edge Computing (SEC), Best Paper, 2020 Google Faculty Research Award, 2019 CMU SCS Doctoral Dissertation Award, 2017 Nominated for ACM Doctoral Dissertation Award by CMU Team PhD Students Xu Zhang (Harper Dissertation Fellowship) on Internet QoE --> Conviva Inc. --> Meta Kuntai Du (Siebel Scholar) on video analytics Zhengxu Xia Yihua Cheng Yuhan Liu (with Shan Lu) Siddhant Ray (with Nick Feamster) Jiayi Yao (with Shan Lu) Hussain Ahmad Mohammad (with Nick Feamster) PhD Thesis Enabling Data-Driven Optimization of Quality of Experience in Internet Applications, Carnegie Mellon University, July 2017 Winner of the CMU SCS Doctoral Dissertation Award and Nomination for ACM Dissertation Award. Recent Publications Yuhan Liu, Yuyang Huang, Jiayi Yao, Zhuohan Gu, Kuntai Du, Hanchen Li, Yihua Cheng, Junchen Jiang, Shan Lu, Madan Musuvathi, Esha Choukse. DroidSpeak: KV Cache Sharing for Cross-LLM Communication and Multi-LLM Serving NSDI 2026 Kuntai Du, Bowen Wang, Chen Zhang, Yiming Cheng, Qing Lan, Hejian Sang, Yihua Cheng, Jiayi Yao, Xiaoxuan Liu, Yifan Qiao, Ion Stoica, Junchen Jiang. LMPrefill: An Inference Engine for Prefill-only Workloads in Large Language Model Applications SOSP 2025 Siddhant Ray, Rui Pan, Zhuohan Gu, Kuntai Du, Shaoting Feng, Ganesh Ananthanarayanan, Ravi Netravali, Junchen Jiang. METIS: Fast Quality-Aware RAG Systems with Configuration Adaptation SOSP 2025 Jiayi Yao, Hanchen Li, Yuhan Liu, Siddhant Ray, Yihua Cheng, Qizheng Zhang, Kuntai Du, Shan Lu, Junchen Jiang. CacheBlend: Fast Large Language Model Serving with Cached Knowledge Fusion EuroSys 2025 (code) Best Paper Kuntai Du, Yihua Cheng, Peder Olsen, Shadi Noghabi, Junchen Jiang. Earth+: on-board satellite imagery compression leveraging historical earth observations ASPLOS 2025 Zhiyi Yao, Pengbo Hu, Congcong Miao, Xuya Jia, Zuning Liang, Yuedong Xu, Chunzhi He, Hao Lu, Mingzhuo Chen, Xiang Li, Zekun He, Yachen Wang, Xianneng Zou, Junchen Jiang Holmes: Localizing Irregularities in LLM Training with Mega-scale GPU Clusters NSDI 2025 Yihua Cheng, Kuntai Du, Junchen Jiang. Do Large Language Models Need a Content Delivery Network? SOSP 2024 Workshop on Hot Topics in System Infrastructure Yuhan Liu, Hanchen Li, Kuntai Du, Jiayi Yao, Yihua Cheng, Yuyang Huang, Shan Lu, Michael Maire, Henry Hoffmann, Ari Holtzman, Ganesh Ananthanarayanan, Junchen Jiang. CacheGen: KV Cache Compression and Streaming for Fast Large Language Model Serving SIGCOMM 2024 [Code] Duo Wu, Xianda Wang, Yaqi Qiao, Zhi Wang, Junchen Jiang, Shuguang Cui, Fangxin Wang. NetLLM: Adapting Large Language Models for Networking SIGCOMM 2024 Yuhan Liu, Chengcheng Wan, Kuntai Du, Henry Hoffmann, Junchen Jiang, Shan Lu, Michael Maire. Automatic and Efficient Customization of Neural Networks for ML Applications OSDI 2024 Yihua Cheng, Ziyi Zhang, Hanchen Li, Anton Arapin, Yue Zhang, Qizheng Zhang, Yuhan Liu, Xu Zhang, Francis Y. Yan, Amrita Mazumdar, Nick Feamster, Junchen Jiang. GRACE: Loss-Resilient Real-Time Video through Neural Codecs NSDI 2024 (Project Website, Code) Hao Wang, Hao Tian, Jinrong Chen, Xinchen Wan, Jiacheng Xia, Gaoxiong Zeng, Wei Bai, Junchen Jiang, Yong Wang, Kai Chen. Towards Domain-Specific Network Transport for Distributed DNN Training NSDI 2024 Farzad Tashtarian, Abdelhak Bentaleb, Hadi Amirpour, Sergey Gorinsky, Junchen Jiang, Hermann Hellwagner, Christian Timmerer. ARTEMIS: Adaptive Bitrate Ladder Optimization for Live Video Streaming NSDI 2024 Hanchen Li, Yuhan Liu, Yihua Cheng, Siddhant Ray, Kuntai Du, Junchen Jiang. Eloquent: A More Robust Transmission Scheme for LLM Token Streaming SIGCOMM 2024 Workshop on Networks for AI Computing (NAIC) Xu Zhang, Hanchen Li, Paul Schmitt, Marshini Chetty, Nick Feamster, Junchen Jiang. VidPlat: A Tool for Fast Crowdsourcing of Quality-of-Experience Measurements Preprint (code) Kuntai Du, Yuhan Liu, Qizheng Zhang, Haodong Wwang, Yuyang Huang, Ganesh Ananthanarayanan, Junchen Jiang. OneAdapt: Fast Adaptation for Deep Learning Applications via Backpropagation SoCC 2023 Yihua Cheng, Hui Zhang, Junchen Jiang. Online Profiling and Adaptation of Quality Sensitivity for Internet Video SoCC 2023 Taveesh Sharma, Tarun Mangla, Arpit Gupta, Junchen Jiang, Nick Feamster. Estimating WebRTC Video QoE Metrics Without Using Application Headers IMC 2023 Chengcheng Wan, Yuhan Liu, Kuntai Du, Henry Hoffmann, Junchen Jiang, Michael Maire, Shan Lu. Run-Time Prevention of Software Integration Failures of Machine Learning APIs OOPSLA 2023 Mehrdad Khani, Ganesh Ananthanarayanan, Kevin Hsieh, Junchen Jiang, Ravi Netravali, Yuanchao Shu, Mohammad Alizadeh, Victor Bahl. RECL: Responsive Resource-Efficient Continuous Learning for Video Analytics NSDI 2023 Henry Milner, Yihua Cheng, Jibin Zhan, Hui Zhang, Vyas Sekar, Junchen Jiang, Ion Stoica. Raising the Level of Abstraction for Time-State Analytics With the Timeline Framework CIDR 2023 Yihua Cheng, Xu Zhang, Junchen Jiang. Enabling Perception-Driven Optimizationin Networking Workshop on Measurements for Self-Driving Networks (SIGMETRICS 2023) Haodong Wang, Kuntai Du, Junchen Jiang. Minimizing packet retransmission for real-time video analytics SoCC 2022 Zhengxu Xia*, Yajie Zhou*, Francis Y. Yan, Junchen Jiang. Automatic Curriculum Generation for Learning Adaptation in Networking SIGCOMM 2022 Kuntai Du, Qizheng Zhang, Anton Arapin, Haodong Wang, Zhengxu Xia, Junchen Jiang. AccMPEG: Optimizing Video Encoding for Accurate Video Analytics MLSys 2022 Romil Bhardwaj, Zhengxu Xia, Ganesh Ananthanarayanan, Junchen Jiang, Nikolaos Karianakis, Yuanchao Shu, Kevin Hsieh, Victor Bahl, Ion Stoica. Ekya: Continuous Learning of Video Analytics Models on Edge Compute Servers NSDI 2022 Frank Cangialosi, Neil Agarwal, Venkat Arun, Junchen Jiang, Srinivas Narayana, Anand Sarwate, Ravi Netravali . Privid: Practical, Privacy-Preserving Video Analytics Queries NSDI 2022 Qizheng Zhang, Kuntai Du, Neil Agarwal, Ravi Netravali, Junchen Jiang . Understanding the Potential of Server-Driven Edge Video Analytics HotMobile 2022 Yiding Wang, Weiyan Wang, Duowen Liu, Xin Jin, Junchen Jiang, Kai Chen. Enabling Edge-Cloud Video Analytics for Robotic Applications IEEE Transactions on Cloud Computing, 2022 Mathias Lecuyer, Sang Hoon Kim, Mihir Nanavati, Junchen Jiang, Siddhartha Sen, Aleksandrs Slivkins, Amit Sharma. Sayer: Using Implicit Feedback to Optimize System Policies SoCC 2021 Xu Zhang, Yiyang Ou, Siddhartha Sen, Junchen Jiang. SENSEI: Aligning Video Streaming Quality with Dynamic User Sensitivity NSDI 2021 Zhujun Xiao, Zhengxu Xia, Ben Y. Zhao, Heather Zheng, Junchen Jiang. Towards Performance Clarity of Edge Video Analytics [Benchmark website] ACM/IEEE SEC 2021 Best Paper Runner-Up Yinda Zhang, Zaoxing Liu, Ruixin Wang, Tong Yang, Jizhou Li, Ruijie Miao, Peng Liu, Ruwen Zhang, Junchen Jiang. High-Performance Sketch-based Measurement over Arbitrary Partial Key Query SIGCOMM 2021 Peiqing Chen, Yuhan Wu, Tong Yang, Junchen Jiang, Zaoxing Liu. Precise Error Estimation for Sketch-based Flow Measurement IMC 2021 Yiding Wang, Weiyan Wang, Duowen Liu, Xin Jin, Junchen Jiang, Kai Chen. Enabling Edge-Cloud Video Analytics for Robotic Applications INFOCOM 2021 Yuchao Zhang, Xiaohui Nie, Junchen Jiang, Wendong Wang, Ke Xu, Youjian Zhao, Martin J Reed, Kai Chen, Haiyang Wang, Guang Yao. Bds+: An inter-datacenter data replication system with dynamic bandwidth separation IEEE/ACM Transactions on Networking, 2021 Junchen Jiang, Siddhartha Sen A New Abstraction for Internet QoE Optimization arXiv:2008.04128, 2020 Kuntai Du*, Ahsan Pervaiz*, Xin Yuan, Aakanksha Chowdhery, Qizheng Zhang, Henry Hoffmann, Junchen Jiang. Server-Driven Video Streaming for Deep Learning Inference [talk][code] SIGCOMM 2020 Samvit Jain, Xun Zhang, Yuhao Zhou, Ganesh Ananthanarayanan, Junchen Jiang, Yuanchao Shu, Victor Bahl, Joseph Gonzalez. Spatula: Efficient cross-camera video analytics on large camera networks ACM/IEEE SEC 2020 Best Paper Xu Zhang, Siddhartha Sen, Daniar kurniawan, Haryadi Gunawi, Junchen Jiang. E2E: Embracing User Heterogeneity to Improve Quality of Experience on the Web [website] SIGCOMM 2019 Yu Guan, Chengyuan Zheng, Xinggong Zhang, Junchen Jiang. Pano: Optimizing 360 Video Streaming with a Better Understanding of Quality Perception SIGCOMM 2019 Yuchen Jin, Sundararajan R, Ganesh Ananthanarayanan, Junchen Jiang, Venkata Padmanabhan, Manuel Schroder, Matt Calder, Arvind Krishnamurthy. Zooming ",
  "content_length": 14674,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:02"
}