{
  "name": "Junda Lu 0001",
  "homepage": "https://researchers.westernsydney.edu.au/en/persons/junda-lu",
  "status": "success",
  "content": "Junda Lu - Western Sydney University Contact expert View Scopus Profile Doctor Junda Lu Associate Lecturer - Computing, School of Computer, Data & Mathematical Sciences https://orcid.org/0009-0004-5450-0809 EmailJunda.Luwesternsydney.eduau Accepting HDR Candidates h-index 189 Citations 5 h-index Calculated based on number of publications stored in Pure and citations from Scopus 20212025 Research activity per year Personal profile BiographyDr Junda Lu is an Associate Lecturer with the School of Computer, Data and Mathematical Sciences, Western Sydney University (WSU), and a member of WSU Artificial Intelligence Research Group (AIRG). He joined WSU in 2025.He has previously worked at Amazon, CSIRO, Victoria University (Sydney), and Macquarie University. His research expertise includes Generative AI, Adversarial Machine Learning, and Security. He received his PhD degree in 2022 from the School of Computer Science and Engineering, University of New South Wales (UNSW), Australia. He obtained two Master's Degrees from University College Dublin (UCD), Ireland and Beijing University of Technology (BJUT), China. Dr Lu brings a wealth of experience in research, teaching, and industry. As a researcher, he received the Best Paper Award from ACM ICMR.As a lecturer, he received the Teaching Excellence Award from Victoria University Sydney.As a student, he received First Class Honour, Excellent Postgraduate Student Award, and First Prize in the Computer Games Tournament. He is currently working on Generative AI, especially in the Image Inpainting direction by using diffusion models. He is looking for HDR students who are interested in Generative AI, Adversarial Machine Learning, or Computer Vision. Dr Junda Lu is excited to deliver his knowledge within research and industry to his students. If you are interested, please feel free to contact him via [email protected]. Related links Google Scholar QualificationsDoctor of Philosophy, University of New South Wales Research keywordsGenerative AIAdversarial Machine LearningImage RetrievalSecurity Fingerprint Dive into the research topics where Junda Lu is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 3 Similar Profiles Adversarial Machine Learning Computer Science 100% Image Retrieval Computer Science 70% Hashing Computer Science 47% Image Retrieval System Computer Science 32% Adversarial Robustness Computer Science 28% Prediction Accuracy Computer Science 23% Overcorrection Engineering 23% State-of-the-Art Method Engineering 23% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research outputs Research outputs per year 2021 2021 2022 2023 2025 2025 4 Conference Paper 2 Article 1 Chapter Research outputs per year Research outputs per year On adversarial training with incorrect labelsZhao, B. Z. H., Lu, J., Zhou, X., Vatsalan, D., Ikram, M. & Kaafar, M. A., 2025, Web Information Systems Engineering, WISE 2024: 25th International Conference, Doha, Qatar, December 2-5, 2024, Proceedings, Part IV. Barhamgi, M., Wang, H. & Wang, X. (eds.). Singapore: Springer, p. 116-132 17 p. (Lecture Notes in Computer Science; vol. 15439).Research output: Chapter in Book / Conference Paper › Chapter › peer-review Adversarial Machine Learning 100% Learning System 100% Machine Learning 100% Training Process 40% Adversarial Example 40% Boosting accuracy and robustness of student models via adaptive adversarial distillationHuang, B., Chen, M., Wang, Y., Lu, J., Cheng, M. & Wang, W., 2023, Proceedings of the 2023 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), Vancouver, Canada, 18 - 22 June 2023. U.S.: IEEE, p. 24668-24677 10 p.Research output: Chapter in Book / Conference Paper › Conference Paper › peer-review Adversarial Machine Learning 100% Prediction Accuracy 100% Adversarial Robustness 100% State-of-the-Art Method 100% Max 100% 50 Citations (Scopus) Distance maximization and defences on deep hashing based image retrievalLu, J., Miao, Y., Chen, M., Huang, B., Li, B., Wang, W., Vatsalan, D. & Kaafar, M. A., 2023, Proceedings of the IEEE International Conference on Knowledge Graph (ICKG), 1-2 December 2023, Shanghai, China. Sheng, V. S., Hicks, C., Ling, C., Raghavan, V. & Wu, X. (eds.). U.S.: IEEE, p. 176-183 8 p.Research output: Chapter in Book / Conference Paper › Conference Paper › peer-review Adversarial Machine Learning 100% Hashing 100% Image Retrieval 100% Information Retrieval 20% Heuristic Method 20% A Single-to-Multi Network for Latency-Free Non-Intrusive Load MonitoringLiu, Y., Qiu, J., Lu, J., Wang, W. & Ma, J., 2022, In: IEEE Transactions on Network Science and Engineering. 9, 2, p. 755-768 14 p.Research output: Contribution to journal › Article › peer-review Open Access Smart Grid Feature 100% Residential User 40% 17 Citations (Scopus) Unsupervised Domain Adaptation for Nonintrusive Load Monitoring Via Adversarial and Joint Adaptation NetworkLiu, Y., Zhong, L., Qiu, J., Lu, J. & Wang, W., 1 Jan 2022, In: IEEE Transactions on Industrial Informatics. 18, 1, p. 266-277 12 p.Research output: Contribution to journal › Article › peer-review Limited Labeled Data 100% Washing Machine 100% Home Energy Management 100% 75 Citations (Scopus) View all 7 research outputs Projects Projects per year 2025 2025 2025 1 Active Projects per year An AI-Powered System for Sales Call Performance EvaluationZhang, Y. (PI), Lu, Z. (Investigator), Asuncion, V. (Investigator) & Lu, J. (Investigator)DGLOSS Co., Ltd.3/02/25 → 31/12/25Project: Research Artificial Intelligence 100% Performance Evaluation 100% Prizes Best Paper Award - ACM ICMR 2021Lu, J. (Recipient), 2021Prize: Other distinction Multimedia Retrieval 100% Teaching Excellence Award - Victoria University SydneyLu, J. (Recipient), 2024Prize: Other distinction Your message has successfully been sent. Your message was not sent due to an error. x Contact Doctor Junda Lu Subject:* Message:* Your name:* Your email:* Send me a copy of this message *required field See privacy policy in the footer of the page Cancel Send",
  "content_length": 6397,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:03"
}