{
  "name": "Jungrae Kim",
  "homepage": "https://scalable-arch.github.io",
  "status": "success",
  "content": "Scalable Architecture Lab. Menu GitHub Welcome to Scalable Architecture Lab (SAL) at SKKU. SAL is recruiting passionate undergraduate, masters, and Ph.D students. If you’re interesting in researching cutting-edge computer architecture and want to change the world, please send your CV to dale40@gmail.com The lab will support a full tuition and stipends, with chances of attending top-tier international conferences. RowArmor: Efficient and Comprehensive Protection Against DRAM Disturbance Attacks Scaling Out Chip Interconnect Networks with Implicit Sequence Numbers PoP-ECC: Robust and Flexible Error Correction against Multi-Bit Upsets in DNN Accelerators PIMPAL: Accelerating LLM Inference on Edge Devices via In-DRAM Arithmetic Lookup CacheCraft: Enhancing GPU Performance under Memory Protection through Reconstructed Caching Native DRAM Cache: Re-architecting DRAM as a Large-Scale Cache for Data Centers (IEEE Micro Top Picks 2025 Honorable Mention) Agile-DRAM: Agile Trade-Offs in Memory Capacity, Latency, and Energy for Data Centers SELCC: Enhancing MLC Reliability and Endurance with Single Cell Error Correction Codes (Best Paper Award) Unity ECC: Unified Memory Protection Against Bit and Chip Errors (Best Student Paper Finalist) UVMMU: Hardware-Offloaded Page Migration for Heterogeneous Computing 2016-2020: PI worked at Microsoft Azure, Redmond, WA, USA DUO: Exposing On-chip Redundancy to Rank-level ECC for High Reliability ERUCA: Efficient DRAM Resource Utilization and Resource Conflict Avoidance for Memory System Parallelism Bit-Plane Compression: Transforming Data for Better Compression in Many-core Architectures All-Inclusive ECC: Thorough End-to-End Protection for Reliable Computer Memory CLEAN-ECC: High Reliability ECC for Adaptive Granularity Memory System Frugal ECC: Efficient and Versatile Memory Error Protection through Fine-grained Compression Bamboo ECC: Strong, Safe, and Flexible Codes for Reliable Computer Memory(Best Paper Finalist) Minbok Wi’s paper, “RowArmor: Efficient and Comprehensive Protection Against DRAM Disturbance Attacks”, has been accepted at ASPLOS’26. Congratulations! Hyunseo Lim’s paper, “System-Level ECC Architecture for HBM3 Supporting TSV and Link Error Correction”, has been accepted at ICOS’26. Congratulations! Prof. Jungrae Kim started serving as an associate editor of IEEE Computer Architecture Letters. Saeid Gorgin’s paper, “Efficient Modular Addition for FPGA-Based Cryptographic Operations”, has been accepted to the IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems (TCAD). Congratulations! Gyuri Kim’s paper, “Partial-Chip Extensions of Single-Chip Erasure Decoding for Flexible Use of Redundancy”, has been accepted to the International Conference on ICT Convergence (ICTC). Congratulations! PI gave a talk on “Reliability Challenges of CXL” at OCP Korea Tech Day. Sanghyun’s paper, “Compression to Colocate: Enabling Tag and Data Colocation via Data Compression in DRAM Cache”, and Hyunseo’s paper, “Hidden Refresh: Reducing DRAM Refresh Overhead for Improved Performance”, have been accepted to the ISOCC 2025 conference. Congratulations! Giyong’s paper, “Scaling Out Chip Interconnect Networks with Implicit Sequence Numbers”, has been accepted to the SC 2025 conference. Congratulations! PI gave a talk on “DRAM Errors in Datacenters” at POSTECH. Boyeol’s paper, “SPRINT: Selective Partial Region-based Invalidation for Neutralizing Thrashing in GPU Unified Memory”, and Yonghyun’s paper, “Characterization of the Impact of Migration Granularity on GPU Unified Memory I/O”, have been accepted to the ITC-CSCC 2025 conference. Congratulations! Yesin’s paper, titled “RowHammer 공격과 방어: 기술적 진화와 도전 과제,” was published as an invited paper in the Communications of the Korean Institute of Information Scientists and Engineers (정보과학회지). Taewon’s paper, “PoP-ECC: Robust and Flexible Error Correction against Multi-Bit Upsets in DNN Accelerators”, and Yoonho’s paper, “PIMPAL: Accelerating LLM Inference on Edge Devices via In-DRAM Arithmetic Lookup”, have been accepted to the Design Actomation Conference (DAC). Congratulations! Saeid Gorgin’s paper, “Generic Modulo-(2^n±δ) Addition Algorithm via Two-Valued Digit Encoding”, has been accepted at the IEEE International Symposium on Computer Arithmetic (ARITH). Congratulations! PI gave a talk on “Exploring Unconventional Solutions for GPU Memory Efficiency” at KIISE Computer System Society Winter Conference. Yesin Ryu’s paper, “Native DRAM Cache: Re-architecting DRAM as a Large-Scale Cache for Data Centers”, has been accepted at the IEEE Micro Top Picks as Honorable Mention. Each year, IEEE Micro selects the top 24 papers from research published in the leading computer architecture conferences (ISCA, MICRO, HPCA, and ASPLOS). Congratulations on this remarkable achievement! Saeid Gorgin’s paper, “Auto Digit Selection for Most Significant Digit First Multiplication”, has been accepted at IEEE Embedded System Letters. Congratulations! Sanghyun Park’s paper, “C4ECC: Data Compression for Bandwidth Efficiency Under ECC Protection in GPUs”, and Jaeho Shin’s paper, “ROSE: Reliability-Optimized OD-ECC and S-ECC Enhancements for HBM3”, have been accepted at ICEIC’25. Congratulations! PI gave a talk on “Exploring Unconventional Solutions for GPU Memory Efficiency” at NVIDIA research at Austin. Nivedita’s paper, “Crumbled Cookies: Exploring E-commerce Websites’ Cookie Policies with Data Protection Regulations”, has been accepted at ACM Transactions on the Web. Congratulations! PI gave a talk on “Memory Challenges in Data Centers” at Samsung Advanced Institute of Technology (SAIT). Giyong Jung’s paper, “Dual-Axis ECC: Vertical and Horizontal Error Correction for Storage and Link Errors”, has been accepted at the ICCD 2024 conference. Congratulations! Soyoung Park’s paper, “CacheCraft: Enhancing GPU Performance under Memory Protection through Reconstructed Caching”, has been accepted at the MICRO 2024 conference. Congratulations! PI gave a talk on “Memory Challenges in Data Centers” at memory division, Samsung Electronics. Yoojin Kim’s paper, “LEAP: LLW RowHammer Mitigation System”, Yoonyul Yoo’s paper, “INC: In channel Crossing ECC for LPDDR Compression Attached Memory Module”, and Soyoung Park’s paper, “Evaluating the Impact of In-band ECC on GPU Performance”, have been accepted at the ISOCC 2024 conference. Congratulations! Yesin Ryu’s paper, “Native DRAM Cache: Re-architecting DRAM as a Large-Scale Cache for Data Centers”, has been accepted at the ISCA 2024 conference. Congratulations! Yujin Lim’s paper, “SELCC: Enhancing MLC Reliability and Endurance with Single Cell Error Correction Codes”, won the Best Paper Award (BPA) at the DATE 2024 conference. Giyong Jung’s work, “Dual-Axis ECC: Vertical and Horizontal Error Correction”, has been accepted as a Work-In-Progress poster to Design Automation Conference (DAC24). Congratulation! Dongwhee Kim received the Second Prize at the 2023-2 CICE Superior Research Award. Congratulation! Scalable Architecture Lab started a research intern program with Ten, a ML infrastructure MLOps company. Hyochan Kim’s paper, “A DNN Partitioning Framework with Controlled Lossy Mechanisms for Edge-Cloud Collaborative Intelligence”, has been accepted to Future Generation Computer Systems (FGCS, IF=7.5, JCR rank 91.4 pth). Congratulation! Scalable Architecture Lab started a new research project with Samsung Advanced Institude of Technology (종합기술원) on Memory Reliability on Supercmoputers. Yujin Lim’s paper, “ SELCC: Enhancing MLC Reliability and Endurance with Single Cell Error Correction Codes”, has been accepted to the Design, Automation and Test in Europe conference (DATE24). This paper is also nominated for the Best Paper Award. Congratulation! Dongwhee Kim has received a invitation to present his paper in the form of a poster at the Samsung AI Forum 2023 (SAIF). The paper, “Unity ECC: Unified Memory Protection Against Bit and Chip Errors”, will be showcased during the poster presentation session. Congratulation! Hojung Namkoong’s paper, “CPR: Correlation-based Page Remapping”, Yujin Lim’s paper, “SCC: Efficient Error Correction Codes for MLC PCM”, and Wonyeong Jung’s paper, “Synergistic Integration: An Optimal Combination of On-Die and Rank-Level ECC for Enhanced Reliability”, have been accepted to The 20th International SoC Conference (ISOCC 2023). Congratulation! Jaeyoon Lee’s paper, “Agile-DRAM: Agile Trade-Offs in Memory Capacity, Latency, and Energy for Data Centers”, has been accepted to the International Symposium on High-Performance Computer Architecture (HPCA). Congratulation! Dongwhee Kim’s SW-copyright, “ECC-ExerSim”, has been registered to Korea Copyright Commission (No. C-2023-043210). Congratulation! Jaeyoon Lee’s poster, “ROC-DRAM: Low Latency and Low Power DRAM using Rows with Opposite Charging”, has been accepted to Design Automation Conference (DAC23). Congratulation! Kiheon Kwon’s paper, “EPA ECC : Error-Pattern-Aligned ECC for HBM2E”, has been accepted to International Technical Conference on Circuits/Systems, Computers, and Communications (ITC-CSCC23). Congratulation! Dongwhee Kim’s paper, “Unity ECC: Unified Memory Protection Against Bit and Chip Errors”, has been accepted to the International Conference on High Performance Computing, Networking, Storage and Analysis (SC23). This paper is also nominated for the Best Student Paper Award. Congratulation! Dongwhee Kim’s paper, “DNN Retraining Method Reducing Accuracy Degradation in Packet-Lossy Environments”, has been accepted to Journal of KIISE. Congratulation! Congratulations! The first graduation ceremony of SAL students was held. Seven students of our lab take master’s degree. We wish for their hopeful future. Jihun Park’s paper, “UVMMU: Hardware-Offloaded Page Migration for Heterogeneous Computing”, has been accepted to Design, Automation and Test in Europe Conference (DATE23) Congratulation! Daero Kim’s paper, “Adaptive Granularity On-die",
  "content_length": 13962,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:08"
}