{
  "name": "Jungwoo Lee 0001",
  "homepage": "https://cml.snu.ac.kr/?page_id=5948",
  "status": "success",
  "content": "professor – Cognitive Machine Learning Lab. Professor Jungwoo Lee Professor, Ph.D Department of Electrical and Computer Engineering Seoul National University TEL +82-2-880-1754 Rm. 301-703 E-mail junglee at snu.ac.kr Homepage http://cml.snu.ac.kr Education · Ph.D in electrical engineering from Princeton University, 1994 · M.S.E in electrical engineering from Princeton University, 1990 · B.S. in electronics engineering from Seoul National University, 1988 Professional Activities · Lead General Chair, IEEE International Symposium on Information Theory(ISIT) 2028, Seoul, Korea · Editor, Entropy, 2023- · Chair, ShaRing (Shannon meets Turing) Colloquium, 2021- · Director, Institute of New Media & Communications (INMC), SNU, 2021-2022 · Session chairs: ISIT 2022, AAAI 2020 · Chair of Trustworthy AI, International Association for Artificial Intelligence and Ethics, 2023 – · TPC member, IEEE Globecom 2018: mobile and wireless networks · Editor for IEEE wireless communications letters (WCL), since 2017 · Chief Editor for KICS Journal, since 2015 · Executive Editor for Elsevier-KICS ICT Express, since 2015 · Associate Editor for KICS and IEEE-cosponsored Journal of Communications and Networks (JCN),2012-2016 · Associate Editor for IEEE Transactions on Vehicular Technology, 2008-2011 · Track Chair, SPC, IEEE ICC 2016-2017 · Organization Committee, ITW 2015 · Technical Program Committee, IEEE VTC 2015 Spring · Technical Program Committee, IEEE ICC 2015 · Technical Program Committee, Vehicular Technology Conference 2012-2015 · Technical Program Committee, Center of Excellence in Wireless and Information Technology (CEWIT) Conference 2010 (sponsored by IEEE) · Organization Committee (in charge of publications), International Symposium on Information Theory (ISIT), 2009 · Technical Program Committee, International Symposium on Personal, Indoor and Mobile Radio Communications (PIMRC), 2008 · Track chair, International Conference on Communications, Circuits and Systems (ICCCAS), 2007 · Technical Program Committee, International Symposium on Information Theory and its Applications (ISITA), 2005 · Technical Program Committee, International Conference on Communications (ICC), 2005 · TPC: APCC 2014-2015, ICTC 2015, ICUFN 2015, ComManTel 2015 · Session chairs: VTC 2003 Fall, CISS 2004, ICC 2005, PIMRC 2010, VTC 2014 Spring, ICC 2015 · Director, Korea Information and Communications Society (KICS), 2013-2015 Awards · Member, National Academy of Engineering of Korea (NAEK), 2023 – · IEEE Fred W. Ellersick Paper Award, June, 2020. · Qualcomm Dr. Irwin Jacobs Award, Oct. 2014. · Achievement award, Bell-Labs, Lucent Tech., 2000. · Team award, SRI (Stanford Research Institute, Sarnoff), 1996. · Gold medal, Korea University Math Competition, Korean Mathematical Society, 1985. Experiences · Visiting faculty, Center for Data Science, NYU, New York, USA, 2023 · Visiting faculty, Cedric Laboratory, CNAM, Paris, France, 2023 · Visiting professor, ECE, Stony Brook Univ., Stony Brook, NY, Mar 2009 – Feb 2010 · Professor, Department of Electrical and Computer Engineering, Seoul National University, 2002- · Member of Technical Staff, Wireless Advanced Technology Lab., Bell Labs, Lucent Technologies, 1999-2002 · $18 million NIST Advanced Technology Program (HDTV) Project Leader, 1996-1999 · Member of Technical Staff, Information Technology Lab., SRI (Stanford Research Institute, Sarnoff), 1994-1999 · Summer Intern, Imaging Department, Siemen Corporate Research, 1992-1992 Start typing and press Enter to search",
  "content_length": 3534,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:10"
}