{
  "name": "Jungong Han",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/jungong-han",
  "status": "success",
  "content": "Professor Jungong Han | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Jungong Han School of Computer Science Chair in Computer Vision Head of the Computer Vision research group Open staff member portrait in a modal window jungong.han@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Jungong Han School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:https://orcid.org/0000-0003-4361-956X Google Scholar Profile Professor Jungong Han is Chair Professor in Computer Vision at the Department of Computer Science, the University of Sheffield, UK. He also holds an Honorary Professorship at the University of Warwick, UK. Previously, he was Chair Professor and Director of Research of the Computer Science department with Aberystwyth University, UK; Data Science Associate Professor with the University of Warwick; and Senior Lecturer in Computer Science with Lancaster University, UK.Prof. Han has authored 2 edited volumes, and over 200 papers, including 90 in prestigious IEEE/ACM Transactions, and 60+ in CORE A* conferences. He has been an Associate Editor-in-Chief of Elsevier Neurocomputing, an Associate Editor of the IEEE Trans. on Neural Networks and Learning Systems, IEEE Trans. on Circuits and Systems for Video Technology, Elsevier Pattern Recognition, and several others. He is a Fellow of IAPR and a Fellow of AAIA. Research interests Prof. Han's research interests are in computer vision, visual analytics, machine learning, artificial intelligence and data science. Publications There has been a problem showing this information. Please try again later. Research group Visual Computing research group Grants BeefTwin: AI Powered Digital Twin for Sustainable Beef Farming, RCUK, 02/2025 - 01/2027, £231,926, as Co-PI",
  "content_length": 1904,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:11"
}