{
  "name": "Junhua Zhao 0001",
  "homepage": "https://www.zhaojunhua.org",
  "status": "success",
  "content": "Lab of Energy Internet Title Associate Professor Director, Energy Markets and Energy Finance Lab, Shenzhen Finance Institute Education Background PhD (The University of Queensland, Australia) B.E. (Xi’an Jiaotong University, China) Research Fields Power System Analysis and Calculation,  Smart Grid,   Energy Economics,   Low Carbon Transition,  Artificial Intelligence. Graduated Students Ph.D Gaoqi Liang: Research Assistant Professor, The Chinese University of Hong Kong, Shenzhen Ph.D Jiajia Yang: Researcher, The University of New South Wales, Australia Ph.D Huan Zhao: Postdoc, Nanyang Technological University, Singapore Ph.D Guolong Liu: Postdoc, The Chinese University of Hong Kong, Shenzhen Ph.D Wenxuan Liu: Postdoc, Nanyang Technological University, Singapore Mphil Caomingzhe Si: Ph.D Student, Tsinghua University Mphil Xinlei Wang: Ph.D Student, The University of Sydney Mphil Gang Fan: Harvest Fund Mphil Yige Nie: Shopee Biography Professor Junhua Zhao is an Associate Professor in CUHK(SZ), the Director of Energy Markets and Finance Lab, Shenzhen Finance Institute, and a Scientist at Shenzhen Institute of Artificial Intelligence and Robotics for Society (AIRS). He joined CUHKSZ in 2015. Before joining CUHKSZ, he was a Senior Lecturer and also acted as the Principal Research Scientist of Centre for Intelligent Electricity Networks, the University of Newcastle, Australia. He has 11 years of experience in the power industry in Australia. His research area includes smart grid, electricity market, energy economics, data mining and artificial intelligence. He published more than 200 research papers, including more than 100 papers in SCI, and 50 papers in IEEE Transactions. His published papers have been cited more than 9600 times, with an H-index of 49 (based on Google Scholar statistics). In 2020, Professor Zhao was awarded the second prize of Zhejiang Province Natural Science Award and the second prize of Shenzhen Finance Association. In 2017, Professor Zhao was rewarded 'Young Scientist of the Future' by ADC Forum because of his outstanding contribution to the Australian energy system research. In 2017, he was awarded the \"Top 100 Most Influential Chinese Sci-tech Journal Papers in China\" by the Ministry of Science and Technology, China. In 2016, he was awarded the 'Best Reviewer' from the top journal IEEE Transactions on Smart Grid. He received the IEEE PES General Meeting best paper award in 2014, Science and Technology Progress Award (2nd prize) from Hunan Provincial government, China in 2013, and four times of 'F5000' Top Articles Award from Ministry of Science and Technology, China. He has rich practical experience in the power and energy industry, and his research results have had a significant impact on the industry. He deeply participated in the rule design and market construction of China's first electricity spot market. The three software products he was involved have been applied in leading energy companies such as New York Con Edison, Hong Kong Electric Company, Guangdong Energy Group Corporation Ltd, China Datang Corporation Ltd, and China National Offshore Oil Corporation. He has led or participated in more than 30 important research and industrial projects, which include the 'Smart Grid, Smart City' trial program funded by Australian government, two flagship cluster programs funded by Commonwealth Science and Industrial Research Organization (CSIRO), and one Electric Power Research Institute (EPRI) project. Professor Zhao is the external experts of 'Australian National Outlook', the co-chair of the IEEE Special Interest Group (SiG) on Active Distribution Grids and Microgrids as well as the Secretary of the Asia Pacific Working Group of the IEEE PES SBLC (Smart Building, Load and Customer). And he is a member of a Global Smart Grid Federation (GSGF) working group. Besides, he is a member of the 'Interfaces of Grid Users/ Focus on EV and Local Storage' working group, Smart Grid Australia (SGA) working group, 'Cyber Physical Security of the Smart Grid' group and 'Critical Infrastructure Program for Modelling and Analysis'(CIPMA) expert group. He is the vice-chair of the Shenzhen AI industry society's expert committee. He is the editorial board members of IEEE Transactions on Network Science and Engineering, Energy Conversion and Economics, IET ENERGY CONVERSION AND ECONOMICS, JOURNAL OF MODERN POWER SYSTEM AND CLEAN ENERGY, ELECTRIC POWER COMPONENTS AND SYSTEMS and POWER SYSTEM PROTECTION AND CONTROL. And he is the expert reviewer of Australian Research Council (ARC), National Natural Science Foundation of China Reviewer and Hong Kong Research Grants Committee (RGC). Also, he is the reviewer of IEEE Transactions on Power Systems, IEEE Transactions on Smart Grid, IEEE Transactions on Neural Networks and Learning Systems, Applied Energy, IET Generation, Transmission & Distribution. In addition, Professor Zhao also won the second prize of Zhejiang Province Natural Science Award in 2020. He is also an energy industry expert specially appointed by China Merchants Bank. Admission Professor Zhao Junhua, Professor Dong Zhaoyang of Nanyang Technological University, Singapore, and Professor Zhang Yingjun of the Chinese University of Hong Kong jointly supervise PhD students. Outstanding PhD students can choose to go to Nanyang Technological University or the Chinese University of Hong Kong as an exchange student and carry out collaborative research.",
  "content_length": 5451,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:11"
}