{
  "name": "Junming Shao",
  "homepage": "https://dm.uestc.edu.cn",
  "status": "success",
  "content": "Data Mining Lab Research Focus Fundamental Data Mining Synchronization-based Clustering, Subspace Clustering, Co-clustering, Multi-view learning, transfer learning, low-rank representation, etc. >> detail<< Streaming Data Mining Concept Drift Detection, Outlier Detection, Data Stream Clustering, Classification, Safe Semi-supervised Learning. >> detail<< Recommder System Showcase your team, products, clients, about info, testimonials, latest posts from the blog, contact form, additional calls to action. Everything translation ready. >> detail<< Interdisplinary Research Brain Network Mining, Enviornmental Data Mining, DTI/fMRI Data Analysis. >> detail<< Recent Publication The state-of-art data stream classification algorithm (IEEE TKDE 2018) Robust Prototype-based Learning on Data StreamsABSTRACT: In this paper, we propose a prototype-based classification model for evolving data streams, called SyncStream, which allows dynamically modeling time-changing concepts, making predictions in a local fashion. Instead of learning a single model on a fixed or adaptive sliding window of historical data or ensemble learning a set of weighted base classifiers, SyncStream captures evolving concepts by dynamically maintaining a set of prototypes in a proposed P-Tree, which are obtained based on the error-driven representativeness learning and synchronization-inspired constrained clustering. To identify abrupt concept drifts in data streams, PCA and statistical analysis based heuristic approaches have been introduced. To further learn the associations among distributed data streams, the extended P-Tree structure and KNN-style strategy are introduced. OUR TEAM JUNMING SHAO Professor Research interests: Data Mining, Machine Learning, Brain Network Mining Qinli Yang Associate Professor Research Fields: Data Mining, Hydrology and Water Resources Zhongjing Yu Ph.D Student Research Fields: Network Dynamics, Link Prediction Wei Han Ph.D Student Research Fields: Data Representation, transfer learning, multi-view learning",
  "content_length": 2030,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:17"
}