{
  "name": "Junqing Zhang",
  "homepage": "https://liverpool.ac.uk/electrical-engineering-and-electronics/staff/junqing-zhang",
  "status": "success",
  "content": "Dr Junqing Zhang | Our people | University of Liverpool Skip to main content Close Search Find courses, people, research, information and more. Please ignore What types of page to search? All Courses Academic staff News Events Search Popular pages: Undergraduate Postgraduate PhD Accommodation Research International students Alternatively use our A-Z index. About Junqing Zhang is a Senior Lecturer (Associate Professor) in the School of Computer Science and Informatics at the University of Liverpool, UK. His research interests span wireless security, physical-layer security, key generation, radio-frequency fingerprint identification, and wireless sensing. He has authored or co-authored more than 100 peer-reviewed publications, including over 60 journal articles. His work focuses on developing innovative and practical physical layer security solutions for next-generation wireless systems, aiming for ultra-low energy consumption alongside strong security guarantees. He also explores novel wireless sensing applications using Wi-Fi and mmWave radars. His research leverages a wide range of Internet of Things technologies, including IEEE 802.11a/g/n/ac/ax, LoRa/LoRaWAN, Bluetooth, and IEEE 802.15.4/ZigBee, with particular emphasis on the physical and MAC layers. Dr. Zhang was a co-recipient of the Best Workshop Paper Award at IEEE WCNC 2025. He serves as a Senior Area Editor for IEEE Transactions on Information Forensics and Security and an Associate Editor for IEEE Transactions on Mobile Computing. He has also taken on key leadership roles, including TPC Symposium Co-Chair of ICNC 2025, ICNC 2026, and ICC 2023. In addition, he has served as TPC Co-Chair for several specialized workshops, such as the IEEE INFOCOM 2023–2025 DeepWireless Workshops, the IEEE GLOBECOM/ICC 2024–2025 Wireless Security Workshops, and the IEEE WCNC/PIMRC 2025 Physical Layer Security Workshop.",
  "content_length": 1892,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:20"
}