{
  "name": "Junsong Yuan 0001",
  "homepage": "https://cse.buffalo.edu/~jsyuan",
  "status": "success",
  "content": "Welcome to Junsong Yuan Home Bio & CV Publications Team Services Teaching Junsong Yuan 袁浚菘 Professor Director of Visual Computing Lab Director of Graduate Admissions Computer Science and Engineering Department University at Buffalo, State University of New York Contact: jsyuan at buffalo (remember to add dot edu) Recent News May 2025: Sudhir Yarram successfully defended PhD thesis SEMANTIC SPATIO-TEMPORAL REPRESENTATIONS FOR AUTONOMOUS SYSTEMS: BRINGING PERCEPTION, FORECASTING AND GENERATIONS CLOSESR. All the best in Adobe! April 2025: Nan Xi successfully defended PhD thesis EMPOWERING VIDEO UNDERSTANDING AND REASONING WITH VISION-LANGUAGE LEARNING. All the best in Amazon! April 2025: Yuanhao Zhai successfully defended PhD thesis VIDEO GENERATION AND UNDERSTANDING WITH MULTIMODAL LEARNING. All the best in Meta! April 2025: Tianyu Luan successfully defended PhD thesis 3D SHAPE FIDELITY MEASUREMENT, RECOVERY, AND CREATION. All the best in Accenture! March 2025: Tianyu's work on High-Fidelity 3D Hand Shape Reconstruction is accepted by T-PAMI Feb. 2025: One paper of hierarchical 3D scene parsing is accepted in IJCV Jan. 2025: I will serve as Senior Area Chair for ACM MM 2025, Area Chair for CVPR 2025 and ICCV 2025 Jan. 2025: I will serve as Editor-in-Chief of Journal of Visual Communication and Image Representation (JVCI) Dec. 2024: Motion Consistency Model for accelerating video diffusion is present at NeurIPS 2024 Nov. 2024: I will serve as Associate Editor of Computer Vision and Image Understanding (CVIU) Oct. 2024: Six papers are presented at ECCV 2024 Sept. 2024: I give a Distinguished Lecture at McMaster ECE Department Aug. 2024: Welcome to submit papers to JVCI special issue on Generative Media Processing, Computing, and Evaluation July 2024: Welcome to Submit Brave New Idea papers to ACM Multimedia Asia 2024 at New Zealand June 2024: Nan Xi's work on video reasoning received SONY Research Award, Congratulations! May 2024: I will serve as Area Chair for NeurIPS 24 April 2024: I will serve as Senior Area Chair for ACM MM 24 March 2024: I will serve as Area Chair for ECCV 24 and ACCV 24 Feb. 2024: Two papers are accepted by CVPR 2024 Jan. 2024: Sudhir Kumar received CSE Outstanding Graduate TA award, congratulations! Dec. 2023: Welcome to submit papers to IEEE Conf. on Multimedia Expo (ICME) 2024 at Niagara Falls, Canada Nov. 2023: Six full papers are presented at ACM Multimedia 23 Oct. 2023: One paper of domain adapted medical image segmentation is presented at MICCAI 23 Sept. 2023: Five papers will be presented at ICCV 23, including one oral Aug. 2023: I will serve as Area Chair for CVPR 24 July 2023: Liangchen Song successfully defended PhD thesis, congratulations Dr. Song! June 2023: Lin Huang successfully defended PhD thesis, congratulations Dr. Huang! May 2023: I will serve as Associate Editor for IEEE Trans. on Pattern Analysis and Machine Intelligence (T-PAMI) April 2023: Jialian Wu successfully defended PhD thesis, congratulations Dr. Wu! March 2023: Three papers are accepted by CVPR 23 Feb. 2023: One paper is presented at AAAI 23 Jan. 2023: Liangchen's NeRFPlayer is accepted by IEEE Trans. on Visualization and Computer Graphics (TVCG) Dec. 2022: Jialian Wu received CSE Best Graduate Research Award, congratulations! Nov. 2022: Congratulations to Yang Xiao and team for receiving the best performance at 6th HANDS workshop challenge at ECCV'22 [PDF] Oct. 2022: ECCV'22 tutorial on AcTion Localization And Segmentation in Untrimmed Videos (ATLAS) Sept. 2022: CSE Faculty Openings Aug. 2022: I will serve as Director of Graduate Admissions of CSE July 2022: Three papers are accepted by ECCV'22, including one oral paper June 2022: I received SUNY Chancellor's Award for Excellence in Scholarship and Creative Activities May 2022: Sheng Liu successfully defended his PhD thesis, congratulations Dr. Liu! March 2022: Three papers are accepted by CVPR'22 Feb. 2022: I will serve as Area Chair for ECCV'22 Jan. 2022: I will serve as General Co-Chair for ICME'24 at Niagara Falls Dec. 2021: Liangchen Song received CSE Best Graduate Research Award, congratulations! Dec. 2021: I will serve as Faculty Senator of UB Nov. 2021: One visual search paper is accepted by AAAI'22 Aug. 2021: Four papers are accepted at ICCV'21 including one oral July 2021: Two full papers are accepted at ACM MM'21 June 2021: Two papers are presented at CVPR'21; see our video demo here May 2021: One paper is presented at ICLR'21 April 2021: I will serve as Area Chair for CVPR'22 and ICCV'21 Feb. 2021: Three papers are presented at AAAI 2021 Jan. 2021: I was elected IEEE Fellow for contributions to human behavior understanding and video analytics Dec. 2020: I received senior researcher of the year from CSE Nov. 2020: Jialian Wu received Best CSE First Year Achiever Award, congratulations! Oct 2020: Five papers are presented at ACM MM 2020 Aug. 2020: Seven papers are presented at ECCV 2020 June 2020: Three papers are presented at CVPR 2020 Jan. 2020: One paper is presented at AAAI 2020 Oct 2019: Six papers are presented at ICCV 2019 March 2019: Three papers are accepted by CVPR'19, including two orals Sept. 2018: I was elected as Fellow of International Association of Pattern Recognition (IAPR) July 2018: I served as program co-chair for ICME’18 July 2018: Five papers are accepted by ECCV'18, including one oral June 2018: Six papers are presented at CVPR'18, including two spotlight papers June 2018: Our work on 3D hand pose estimation is presented at CVPR'18 as a spotlight paper, see the project page and code here Books",
  "content_length": 5590,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:16"
}