{
  "name": "Junting Chen",
  "homepage": "http://chenjunting.org",
  "status": "success",
  "content": "WISELab WISELabs Home Research Publications People Opening Manual Survival guide Course advice Fund Ack Resource Computing Storage WI WISELab Laboratory for Wireless Communication and Intelligent Signal ProcEssing Junting Chen Ph.D (HKUST), B.Sc (NJU) Assistant Professor School of Science and Engineering Future Network of Intelligence Institute The Chinese University of Hong Kong, Shenzhen Shenzhen, Guangdong 518172, China E-mail: juntingc@cuhk.edu.cn Tel: +86 (755) 235 19652 My web at CUHK-Shenzhen “I know of no better life purpose than to perish in attempting the great and the impossible…”  —  Nietzsche, 1873. Opening for PhD students / postdocs / visiting positions (2024): I am actively looking for PhD students with full scholarship to be admitted in the Computer and Information Engineering (CIE) program at CUHK-SZ. The program duration is typically 4-5 years. I also have several funded positions for postdocs, visiting students, and research assistants. See details here … About me Junting is an Assistant Professor, Presidential Young Fellow, with the School of Science and Engineering in The Chinese University of Hong Kong, Shenzhen (CUHK-SZ). Prior to joining CUHK-SZ in 2019, he was a postdoctoral research associate in Prof. Urbashi Mitra's group in University of Southern California, Los Angeles, USA, from November 2016 to 2019, and a postdoctoral research fellow in Prof. David Gesbert's group in EURECOM, France, from 2015 to 2016. Junting received the B.Sc degree in Electronic Science and Engineering from Nanjing University (NJU), Nanjing, China, and the Ph.D. degree in Electronic and Computer Engineering from the Hong Kong University of Science and Technology (HKUST) , Hong Kong. He was advised by Prof. Vincent Lau. From February to December 2014, he visited the Laboratory for Information & Decision Systems (LIDS), Massachusetts Institute of Technology (MIT), USA, and was advised by Prof. Moe Z. Win. Research highlight The WISELab work on a broad range of theoretical problems in signal, optimization, and machine learning for wireless communications and localization. The focus is on two main research pillars: (i) radio map learning and tomography, and (ii) dynamic 3D communications, with target industrial applications in 6G and beyond. Recent progress Aug 2022: We have 2 papers been accepted for presentation at IEEE Globecom. Aug 2022: Our paper “Online 3D Placement for UAV-aided Free-Space Optical Communication Under Shadowing” received WOCC2022 Charles Kao Best Paper Award. This is a joint work with Yinjung Wang, a Year-3 undergraduate student from CUHK-Shenzhen. Jan 2022: We have one paper been accepted by IEEE ICASSP 2022. In this work, we aim at reconstructing a propagation field based on RSS measurements from sparse locations. Conventional approaches use interpolation, statistical methods such as Kriging, or other data-driven methods such as kernel regression. By constrast, we adopt recent advance in sparse matrix completion and integrate with local polynomial regression, and show that such an integrated technique achieves substantial performance gain over the conventional ones. RSS-based field reconstruction finds important applications in location when the target is not cooperating, for instance, searching illegal radio stations. [See more …] Jan 2022: We have one paper been accepted for presentation at IEEE ICC, 2022. In this work, we aim at constructing a radio map based on spatially sparse measurements using radio frequency (RF) signals in an outdoor environment. Since RF signals interact with the nearby objects and get attenuated according to the geometry of the area, one can compute the tomography image of the surrounding from the set of RF measurements. In fact, our prior work finds that estimating a radio map via jointly constructing a virtual obstacle map indeed enhance the reconstruction performance of radio maps. This paper advances such an idea using deep learning approaches and demonstrated more efficient and accurate radio map reconstruction. [See more …] Dec 2021: We have 2 papers been accepted for presentation at IEEE WCNC. [See more …] Contact 2001 Longxiang Ave, CUHK-SZ, RA 215 Longgang District, Shenzhen Guangdong 518172, China E-mail: juntingc@cuhk.edu.cn Tel: +86 (755) 2351 9652 Page generated 2023-12-03 16:50:28 CST, by jemdoc.",
  "content_length": 4340,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:15"
}