{
  "name": "Junwon Choi",
  "homepage": "https://spa.snu.ac.kr/faculty",
  "status": "success",
  "content": "FacultySearch this siteEmbedded FilesSkip to main contentSkip to navigationArtificial Intelligence & Autonomous Driving (ADR) LaboratoryFacultyDr. Jun Won ChoiAssociate Professor Seoul National University Department of Electrical and Computer EngineeringInterdisciplinary Program In Artificial IntelligenceCollege of Liberal StudiesContactEmail: junwchoi@snu.ac.krOffice: 서울시 관악구 서울대학교 220동 318호Phone: 02-880-9527BiographyJunWon Choi received his B.S. and M.S. degrees from Seoul National University, Seoul, Korea, and his Ph.D. degree from the University of Illinois at Urbana-Champaign, Champaign, IL, USA. From 2010 to 2013, he worked for Qualcomm in San Diego, CA, USA. From 2013 to 2024, he was a Faculty Member in the Department of Electrical Engineering at Hanyang University, Seoul, Korea. Since 2024, he has been a faculty member in the Department of Electrical and Computer Engineering and the Interdisciplinary Program in Artificial Intelligence at Seoul National University, Seoul, Korea. He leads the Signal Processing and Artificial Intelligence (SPA) Lab at Seoul National University. His research interests include signal processing, machine learning, robot perception, autonomous driving, and intelligent vehicles. He is a recipient of the Qualcomm Distinguished Faculty Award and served as the Workshop Chair of the Intelligence Vehicle Symposium (IV) 2024. He is currently an Associate Editor for IEEE Transactions on Intelligent Transportation Systems, IEEE Transactions on Vehicular Technology, and the International Journal of Automotive Technology.EducationPh. D. University of Illinois at Urbana-Champaign, Electrical and Computer Engineering (Advisor: Andrew C. Singer)M. S. Seoul National University, Electrical and Computer Engineering, (Advisor: Nam Ik Cho)B. S. Seoul National University, School of Electrical EngineeringExperience Associate Professor, Seoul National University (2024-)Assistant, Associate, Full Professor, Hanyang University (2013-2024) Visiting Scientist, Qualcomm, San Diego (2022-2023)Senior Engineer, Qualcomm, San Diego (2010-2013) Activity Associate Editor of IEEE Trans. Vehicular Technology (2019-present)Associate Editor of IEEE Trans. Intelligent Transportation Systems (2019-present)Workshop Chair of Intelligent Vehicle Symposium (IV) 2024  자동차공학회 사업이사 자동차공학회 전기전자시스템부문, 융합SW & AI부문 부문이사 통신학회 융합무인이동체분과 집행이사 현대자동차 자율주행 기술 자문위원 (2018)Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2440,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:15"
}