{
  "name": "Junyi Jessy Li",
  "homepage": "https://jessyli.com",
  "status": "success",
  "content": "Jessy Li I am an Associate Professor in the Linguistics Department, and (by courtesy) the Computer Science Department, at The University of Texas at Austin where I work on computational linguistics and natural language processing. I belong to the Computational Linguistics Group at UT Linguistics and the UT NLP Group. I obtained my Ph.D. from the Department of Computer and Information Science at the University of Pennsylvania in 2017, advised by Ani Nenkova. Usually, I go by Jessy. I am the AI Lead of the Explorable Universe Research Group in the NSF-Simons AI Institute for Cosmic Origins (CosmicAI). I am also an affiliated faculty member of the Oden Institute for Computational Engineering and Sciences. Some of the topics that I am currently researching include: Discourse Processing: How do humans and machines make sense of long texts? We investigate discourse-level devices at play, e.g., discourse structure, questions under discussion, and coherence. Selected recent work: QUDSim, COLM’25; QSalience, EMNLP’24 Outstanding Paper; QUDeval, EMNLP’23; QUD parsing, ACL Findings’23 Natural Language Generation: How can we harness, improve, and evaluate text generation? We study both creative generation and its evaluation, as well as document-grounded tasks in high-stake domains (like medicine) to make information more accessible. Selected recent work: EvalAgent, COLM’25; InfoLossQA, ACL’24; FactPICO, ACL’24; ElabQUD, EMNLP’23 Pragmatics and Alignment: We seek to understand pragmatics (how people use language to express their intentions) and emotions, in pursuit of better AI-human alignment. Selected recent work: Strategic Discourse; SPRI, ICML’25; referring expressions and in/out group, EMNLP Findings’24; cognitive reappraisals, COLM’24 Language and Code: We develop methods to understand, improve, and evaluate AI for software evolution, documentation, and coding in scientific research (with the CosmicAI institute). Selected recent work: AstroVisBench, NeurIPS’25; exLong, ICSE’25; multilingual code evolution, FSE’23; TECO, ICSE’23 Note to prospective PhD students: I’m always looking for motivated students to join my group! If you’re looking to apply, you can apply to either the Linguistics PhD program (with computational linguistics as the subfield) and/or the Computer Science PhD program, depending on where your interests lie. Note that the application deadlines of the programs are different. Activities and Service Program Chair, EMNLP 2026. NAACL Secretary, 2024-present Senior Area Chair at ACL 2025, NAACL 2025, IJCNLP-AACL 2025; Area Chair at COLM 2025, EACL 2026. Best Paper Committee member at IJCNLP-AACL 2025 Action Editor of TACL and CL (Senior) Action Editor for ACL Rolling Review Co-organizer of the Workshop on Computational Approaches to Discourse, Context and Document-Level Inferences (CODI) SIGDIAL Board Member, 2023-2025. October 2025, COLM 2025 July 2025, keynote at The 19th Linguistic Annotation Workshop @ ACL. July 2025, keynote at the Society for Computation in Linguistics (SCiL). June 2025, University of Gothenburg. April 2025, talk at the CosmicAI seminar series. April 2025, CS Colloquium, University of Massachusetts, Lowell. April 2025, talk at Northeastern University. March 2025, talk at the Language Technology Lab, Cambridge University. March 2025, talk at the Computer Science Seminar Series, the University of Birmingham. January 2025, panel at the LSA. …for a complete list of prior events, check out my CV",
  "content_length": 3480,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:16"
}