{
  "name": "Junyi Zhu 0001",
  "homepage": "https://www.junyizhu.com",
  "status": "success",
  "content": "Home | Junyi Zhu top of pageJunyi Zhu  (朱均逸) Assistant Professor Electrical Engineering & Computer Science Department University of Michigan - Ann ArborI am an Assistant Professor at University of Michigan, Electrical Engineering and Computer Science (EECS) Department, leading the Sensing, Intelligence and eXperience (SIX) Lab. We work at the intersection of Human Computer Interaction, fabrication and novel sensing technologies. I completed my Ph.D. degree in Computer Science at MIT EECS Department & CSAIL, advised by Prof. Stefanie Mueller at the HCIE Group. I design and fabricate personalized health and medical sensing devices that can be used for both dynamic in-field environment for remote monitoring and diagnosis session, as well as in-clinic monitoring along with other medical procedures, to provide more temporal and spatial information for doctors and physicians. I am a 2017 Seneff-Zue Fellow, a 2021 Thomas G. Stockham, Jr (1955) and Bernard (Ben) Gold Fellow and a 2023 Seibel Scholar. ​ Prior to MIT, I completed my Bachelor's Degree at University of Washington, where I worked as a Research Assistant at UW Ubicomp Lab, a part-time Software Engineer at Senosis Health, and a Teaching Assistant. ​ I am recruiting undergraduate and graduate researchers (PhD & Postdoc). If you're interested, feel free to check out our lab website and shoot me an email!Research VisionI envision that in the future, every individual will have a personalized health monitoring system that adapts to individual variance, for both macro & micro circulation systems, which consists of health monitoring device(s) with custom sensing functions based on the patient’s health conditions, with unique device form factors based on the patient's body shape and usage context, as well as patient specific models for analyzing the collected data, just how doctors customize treatment and recovery plans for every patient in-clinic. With my background in health sensing, fabrication and human-computer interaction, I am uniquely positioned to design and fabricate personal health and medical devices, build signal processing models for individual patients and their specific conditions, and deploy my devices in studies with doctors and patients.Research PublicationsHongrui Wu*, Feier Long*, Hongyu Mao, JaeYoung Moon, Junyi Zhu†, Yiyue Luo†.   (†co-last authors) BandEI: A Flexible Electrical Impedance Sensing Bandage for Deep Muscles and Tendons In Proceedings of ACM UIST 2025 Marwa AlAlawi, Regina Zheng, SooYeon Ahn, Katherine Arianna Yan, Ticha Sethapakdi, Junyi Zhu*, Stefanie Mueller*. (*co-last authors) Meta-antenna: Mechanically Frequency Reconfigurable Metamaterial Antennas In Proceedings of ACM UIST 2025 Junyi Zhu, Tianyu Xu, Jiayu Wang, Emily Guan, JaeYoung Moon, Stiven Morvan, D Shin, Andrea Colaço, Stefanie Mueller, Karan Ahuja, Yiyue Luo, Ishan Chatterjee. EI-Lite: Electrical Impedance Sensing for Micro-gesture Recognition and Pinch Force Estimation In Proceedings of ACM UIST 2025 Devin Murphy, Junyi Zhu, Paul Pu Liang, Wojciech Matusik, and Yiyue Luo. WiReSens Toolkit: An Open-source Platform towards Accessible Wireless Tactile Sensing In arXiv preprint arXiv:2412.00247 (2024)Yunyi Zhu, Cedric Honnet, Yixiao Kang, Junyi Zhu, Angelina J Zheng, Kyle Heinz, Grace Tang, Luca Musk, Michael Wessely and Stefanie Mueller. PortaChrome: A Portable Contact Light Source for Integrated Re-Programmable Multi-Color Textures In Proceedings of ACM UIST 2024Junyi Zhu*, Young Joong Lee*, Yiyue Luo*, Tianyu Xu, Chao Liu, Daniela Rus, Stefanie Mueller and Wojciech Matusik. Liquids Identification and Manipulation via Digitally Fabricated Impedance Sensors In IEEE ICRA 2024Alexander Kyu*, Hongyu Mao*, Junyi Zhu, Mayank Goel and Karan Ahuja. EITPose: Wearable and Practical Electrical Impedance Tomography for Continuous Hand Pose Estimation In Proceedings of ACM CHI 2024Yiyue Luo, Junyi Zhu, Kui Wu, Cedric Honnet, Stefanie Mueller and Wojciech Matusik. MagKnitic: Machine-knitted Passive and Interactive Haptic Textiles with Integrated Binary Sensing In Proceedings of ACM UIST 2023Donghyeon Ko, Yoonji Kim, Junyi Zhu, Michael Wessely and Stefanie Mueller. FlexBoard: A Flexible Breadboard for Interaction Prototyping on Curved and Deformable Surfaces In Proceedings of ACM CHI 2023DOI PDF Video Project Page Marwa AlAlawi, Noah Pacik-Nelson, Junyi Zhu, Ben Greenspan, Andrew Doan, Brandon M Wong, Benjamin Owen-Block, Shanti Mickens, Wilhelm Schoeman, Michael Wessely, Andreea Danielescu and Stefanie Mueller. MechSense: A Design and Fabrication Pipeline for Integrating Rotary Encoders into 3D Printed Mechanisms In Proceedings of ACM CHI 2023. DOI PDF Video Project Page Junyi Zhu, Yuxuan Lei, Aashini Shah, Gila R. Schein, Hamid Ghaednia, Joseph H. Schwab, Casper Harteveld and Stefanie Mueller MuscleRehab: Improving Unsupervised Physical Rehabilitation by Monitoring and Visualizing Muscle Engagement In Proceedings of ACM UIST 2022. DOI PDF Video Project Page Yoonji Kim, Junyi Zhu, Mihir Trivedi, Dishita G. Turakhia, Ngai Hang Wu, Donghyeon Ko, Michael Wessely, Stefanie Mueller. SensorViz: Visualizing Sensor Data Across Different Stages of Prototyping Interactive Objects In Proceedings of ACM DIS 2022. DOI PDF Video Project Page Junyi Zhu, Jackson C. Snowden, Joshua Verdejo, Emily Chen, Paul Zhang, Hamid Ghaednia, Joseph H. Schwab, Stefanie Mueller. EIT-kit: An Electrical Impedance Tomography Toolkit for Health and Motion Sensing In Proceedings of ACM UIST 2021. DOI PDF Video Talk Project Page Junyi Zhu, Yunyi Zhu, Jiaming Cui, Leon Cheng, Jackson C Snowden, Mark Chounlakone, Michael Wessely, Stefanie Mueller. MorphSensor: A 3D Electronic Design Tool for Reforming Sensor Modules In Proceedings of ACM UIST 2020. DOI PDF Video Talk Project Page Junyi Zhu, Lotta-Gili Blumberg, Yunyi Zhu, Martin Nisser, Ethan Levi Carlson, Xin Wen, Kevin Shum, Jessica Ayeley Quaye, Stefanie Mueller. CurveBoards: Integrating Breadboards into Physical Objects to Prototype Function in the Context of Form. In Proceedings of ACM CHI 2020. DOI PDF Video Project Page Martin Nisser, Junyi Zhu, Tianye Chen, Katarina Bulovic, Parinya Punpongsanon, Stefanie Mueller. Sequential Support: 3D Printing Dissolvable Support Material for Time-Dependent Mechanisms. In Proceedings of ACM TEI 2019. DOI PDF Video Project Page Edward Wang, Junyi Zhu, Mohit Jain, Tien-Jui Lee, Elliot Saba, Lama Nachman, Shwetak N. Patel. Seismo: Blood Pressure Monitoring using Built-in Smartphone Accelerometer and Camera. In Proceedings of ACM CHI 2018.  [BEST PAPER NOMINEE]DOI PDF Video Edward Wang, William Li, Junyi Zhu, Rajneil Rana, Shwetak N. Patel. Noninvasive hemoglobin measurement using unmodified smartphone camera and white flash. In Proceedings of 39th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC 2017).  DOI PDF Edward Wang, Junyi Zhu, William Li, Rajneil Rana, Shwetak N. Patel. HemaApp IR: noninvasive hemoglobin measurement using unmodified smartphone cameras and built-in LEDs In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17).DOI PDF Extended Abstracts, Short Paper & DemoYunyi Zhu, Cedric Honnet, Yixiao Kang, Junyi Zhu, Angelina J. Zheng, Kyle Heinz, Grace Tang, Luca Musk, Michael Wessely, Stefanie Mueller. Demonstration of ChromoCloth: Re-Programmable Multi-Color Textures through Flexible and Portable Light Source In Adjunct Publication of the 36th Annual ACM Symposium on User Interface Software and Technology (UIST ’23). ACM.Donghyeon Ko, Yoonji Kim, Junyi Zhu, Michael Wessely, Stefanie Mueller. Demonstration of FlexBoard: A Flexible Breadboard for Interaction Prototyping on Curved and Deformable Surfaces In Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems (CHI EA'23). ACMXinyi Yang, Katarina Bulovic,Susanna Chen, Junyi Zhu, Stefanie Mueller Azimuth Calculation and Telecommunication between VR Headset and Smartphones for Nearby Interaction In Proceedings of the 17th International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’23 WIP). ACM.Junyi Zhu Design and Fabricate Personal Health Sensing Devices In Adjunct Publication of the 35th Annual ACM Symposium on User Interface Software and Technology (UIST '22). ACM.Junyi Zhu, Yuxuan Lei, Aashini Shah, Gila Schein, Hamid Ghaednia, Joseph Schwab, Casper Harteveld, Stefanie Mueller. Monitoring Muscle Engagement via Electrical Impedance Tomography for Unsupervised Physical Rehabilitation In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology (UIST '22). ACM.Junyi Zhu, Liang He, Jun Nishida, Hamid Ghaednia, Hsin-Liu (Cindy) Kao, Jon E. Froehlich, Edward Wang, Stefanie Mueller SIG: Towards More Personal Health Sensing In CHI Conference on Human Factors in Computing Systems Extended Abstracts (CHI ’22 Extended Abstracts). ACM.Cedric Honnet, Yunyi Zhu, Junyi Zhu, Michael Wessely and Stefanie Mueller. WearaFab: Digital Fabrication for Wearables Toolkits In CHI Conference on Human Factors in Computing Systems Extended Abstracts (CHI ’22 Extended Abstracts). ACM.Junyi Zhu, Jackson Snowden, Joshua Verdejo, Emily Chen, Paul Zhang, Hamid Ghaednia, Joseph Schwab, Stefanie Mueller. EIT-kit Demo: An Electrical Impedance Tomography Toolkit for Health and Motion Sensing In Adjunct Publication of the 34th Annual ACM Symposium on User Interface Software and Technology (UIST ’21). ACM.Junyi Zhu, Yunyi Zhu, Jiaming Cui, Leon Cheng, Jackson Snowden, Mark Chounlakone, Michael Wessely Stefanie Mueller. Demonstration of MorphSensor: A 3D Electronic Design Tool for Reforming Sensor Modules In Adjunct Publication of the 33rd An- nual ACM Symposium on User Interface Software and Technology (UIST ’20). ACM.Junyi Zhu, Lotta-Gili Blumberg, Yunyi Zhu, Martin Nisser, Ethan Levi Carlson, Xin Wen, Kevin Shum, Jessica Ayeley Quaye, Stefanie Muell",
  "content_length": 10250,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:16"
}