{
  "name": "Junzhou Huang",
  "homepage": "http://ranger.uta.edu/~huang",
  "status": "success",
  "content": "Junzhou Huang Home Research Publication Download Teaching Links Junzhou Huang, FAIMBE Jenkins Garrett Professor The University of Texas at Arlington Department of Computer Science and Engineering 500 UTA Boulevard, Arlington, TX 76019-0015 Email: jzhuang@uta.edu Phone: (817) 272-9596 Office: ERB 650 [Curriculum Vitae] [Google Scholar] [GitHub] Postdoc and Graduate Assistantships Available! Dr. Junzhou Huang is the Jenkins Garrett Professor in the Computer Science and Engineering department at the University of Texas at Arlington. His major research interests include machine learning, computer vision, medical image analysis and bioinformatics. His research has been recognized by several awards including the NSF CAREER Award, Google TensorFlow Model Garden Award, Microsoft Accelerate Foundation Models Research Award, four Best Paper Awards (MICCAI'10, FIMH'11, STMI'12 and MICCAI'15) as well as two Best Paper Nominations (MICCAI'11 and MICCAI'14). His research projects are supported by both federal/state agencies (NSF, NIH, CPRIT) and industry (Google, Amazon, Microsoft, IBM, Samsung, XtaiPi, Nokia and Johnson & Johnson). He enjoys to develop efficient algorithms with nice theoretical guarantees to solve practical problems involved large scale data. News: 09/2025: One paper accepted by NeurIPS 2025! 08/2025: Invited to serve as an area chair for CVPR 2025! 06/2025: Two papers accepted by ICCV 2025! 06/2025: Two papers accepted by MICCAI 2025! 06/2025: Invited to serve as an area chair for AAAI 2026! 03/2025: One paper accepted by Nature Cancer! 03/2025: Received a NIH R01 grant $3,136,243 to study how to identify antigen-antibody interactions! 02/2025: Elected to serve as a member of the MICCAI Board of Directors! 02/2025: One paper accepted by ICLR 2025! 02/2025: Invited to serve as an area chair for MICCAI 2025! 02/2025: Invited to serve as an area chair for NeurIPS 2025! 01/2025: Invited to serve as an area chair for ICML 2025! More Archived ... Supervised Ph.D Students: Yeqing Li (2012-2016, Next Stop: Google) Zheng Xu (2014-2018, Next Stop: Google) Jiawen Yao (2014-2019, Next Stop: PAII) Ruoyu Li (2014-2020, Next Stop: Facebook) Sheng Wang (2015-2020, Next Stop: Google) Xinliang Zhu (2015-2020, Next Stop: Amazon) Mohammad Minhazul Haq (2016-2023, Next Stop: Caris Life Sciences) Chaochao Yan (2017-2022, Next Stop: Google) Ashwin Raju (2017-2022, Next Stop: Covera Health) Jinyu Yang (2018-2022, Next Stop: Amazon) Yuzhi Guo (2018-2022, Next Stop: PostDoc) Hehuan Ma (2018-2023, Next Stop: PostDoc) Weizhi An (Starting in Fall 2019) Saiyang Na (Starting in Fall 2021) Wenliang Zhong (Starting in Fall 2021) Feng Jiang (Starting in Fall 2022) Yuwei Miao (Starting in Fall 2022) Qifeng Zhou (Starting in Fall 2022) Supervised Master Students: Chen Chen (2012-2015, Next Stop: UIUC PhD) Dheeraj Ganti (2014-2016, Next Stop: Oracle) Viswanathan Rajalingam (2015-2017, Next Stop: Samsung Lab) Vivek Balaji (2015-2017, Next Stop: BMW) Shirong Xue (2015-2017, Next Stop: Walmart Lab) Ashwin Raju (2015-2017, Next Stop: UTA PhD) Arjun Punabhai Vekariya (2015-2017, Next Stop: Raizlabs) Xiaoyu Zhang (2016-2018, Next Stop: UTA PhD) Zhifei Deng (2016-2019, Next Stop: Facebook) Siyu Xiu (2018-2020, Next Stop: FutureDial) Zeheng Li (2018-2021, Next Stop: CoCoPIE) Information for Future Students: I am looking for Postdoc, Ph.D. students, motivated for doing research in the areas of machine learning, data mining and imaging informatics. If you are interested, please contact me. If you are UTA master students and are looking for master thesis topics, or UTA undergraduates and are looking for internships, please feel free to contact me. UT Arlington has top research ranking based on the past ten-year publications at: Artificial Intelligence (ranks #59 in USA) Computer Vision (ranks #70 in USA) Machine Learning & Data Mining (ranks #65 in USA)",
  "content_length": 3882,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:20"
}