{
  "name": "Jurgen J. Vinju",
  "homepage": "http://homepages.cwi.nl/~jurgenv",
  "status": "success",
  "content": "Jurgen J. Vinju Homepage of Jurgen J. Vinju What is code and what is coding? Understanding what programmers do is important, because what software does is influencing our daily lives in increasing scope and intensity. In fact, it is today quite hard to make list of things we do and experience which are not influenced by some sort of software. Since programmers write all this software, they are accountable and we all must engage in conversation with them. Understanding what “code” is and what “coding” entails, paves the way for a good conversation. Read about it here. About Publications Blog Software Talks/Media Supervision Contact I am a researcher in the general fields of Software Engineering and Computer Science, with a particular interest in Programming Languages, Model Driven Engineering, Domain Specific Languages, Software Analysis and Software Maintenance & Evolution. My interest is especially what all these topics have to do with each other: How can we learn to understand software engineering practise? Based on this understanding, how can we design new tools for software engineers? The impact of software in society is very large; we must understand it better to be able to provide better guarantees. Guarantees about privacy and security but also about software budgets, software functionality, and software sustainability. I was on sick leave a lot between February 2018 and February 2021, in case you have identifiedy a gap in my activities. And from March 2024 up to now I am again sick at home. Hope to be back to you all soon! Typical tasks and roles: senior researcher in the SWAT - Software Analysis & Transformation group (former group leader) at CWI, and part-time full professor at Eindhoven University of Technology since September 1st, 2014. co-founder of a CWI spin-off company named SWAT.engineering in 2017. leader and contributor (as a programmer) to several open-source software projects, with a current focus on the Rascal metaprogramming language. member of the board of the IPA school member of the steering committee of the SLE conference co-founder and treasurer of VERSEN and the SEN symposium Position statements about research and engineering can be found in the blog part of this homepage. Download my CV as pdf 2024 OIL: an industrial case study in language engineering with Spoofax, Olav Bunte, Jasper Denkers, Louis C. M. van Gool, Jurgen J. Vinju, Eelco Visser †, Tim A. C. Willemse, Andy Zaidman. In Springer Journal of Software and Systems Modeling (SOSYM), 2024 Domain-specific languages (DSLs) promise to improve the software engineering process, e.g., by reducing software development and maintenance effort and by improving communication, and are therefore seeing increased use in industry. To support the creation and deployment of DSLs, language workbenches have been developed. However, little is published about the actual added value of a language workbench in an industrial setting, compared to not using a language workbench. In this paper, we evaluate the productivity of using the Spoofax language workbench by comparing two implementations of an industrial DSL, one in Spoofax and one in Python, that already existed before the evaluation. The subject is the Open Interaction Language (OIL): a complex DSL for implementing control software with requirements imposed by its industrial context at Canon Production Printing. Our findings indicate that it is more productive to implement OIL using Spoofax compared to using Python, especially if editor services are desired. Although Spoofax was sufficient to implement OIL, we find that Spoofax should especially improve on practical aspects to increase its adoptability in industry. @article{bunte_oil_2024, author = {Bunte, Olav and Denkers, Jasper and van Gool, Louis C. M. and Vinju, Jurgen J. and Visser, Eelco and Willemse, Tim A. C. and Zaidman, Andy}, doi = {10.1007/s10270-024-01185-x}, issn = {1619-1374}, journal = {Software and Systems Modeling}, month = jun, title = { {OIL}: an industrial case study in language engineering with {Spoofax} }, year = {2024} 2023 Taming complexity of industrial printing systems using a constraint-based DSL: An industrial experience report, Jasper Denkers, Marvin Brunner, Louis van Gool, Jurgen J. Vinju, Andy Zaidman, Eelco Visser †. In Journal of Software: Practise & Experience (2023), Wiley. Flexible printing systems are highly complex systems that consist of printers, that print individual sheets of paper, and finishing equipment, that processes sheets after printing, for example, assembling a book. Integrating finishing equipment with printers involves the development of control software that configures the devices, taking hardware constraints into account. This control software is highly complex to realize due to (1) the intertwined nature of printing and finishing, (2) the large variety of print products and production options for a given product, and (3) the large range of finishers produced by different vendors. We have developed a domain-specific language called CSX that offers an interface to constraint solving specific to the printing domain. We use it to model printing and finishing devices and to automatically derive constraint solver-based environments for automatic configuration. We evaluate CSX on its coverage of the printing domain in an industrial context, and we report on lessons learned on using a constraint-based DSL in an industrial context. @article{denkers2024, author = {Denkers, Jasper and Brunner, Marvin and van Gool, Louis and Vinju, Jurgen J. and Zaidman, Andy and Visser, Eelco}, doi = {https://doi.org/10.1002/spe.3239}, journal = {Software: Practice and Experience}, number = {10}, pages = {2026-2064}, title = {Taming complexity of industrial printing systems using a constraint-based DSL: An industrial experience report}, volume = {53}, year = {2023} Comparing Bottom-up with Top-down Parsing Architectures for the Syntax Definition Formalism from a Disambiguation standpoint Jurgen J. Vinju. OASIcs, Volume 109, EVCS: Eelco Visser's Commemorative Symposium. Context-free general parsing and disambiguation algorithms are threaded throughout the research and engineering career of Eelco Visser. Both our Ph.D. theses featured the study of \"disambiguation.\" Disambiguation is the declarative definition of choices among different parse trees, derived using the same context-free grammar, for the same input sentence. This essay highlights the differences between syntactic disambiguation for context-free general parsing in a top-down architecture and a bottom-up architecture. The differences between top-down and bottom-up are mainly observed as practical aspects of the software architecture and software implementation. Eventually, the concept of data-dependent context-free grammar brings all engineering perspectives of disambiguation back into a conceptual (declarative) framework independent of the parsing architecture. The novelty in this essay is the juxtaposition of three general parsing architectures from a disambiguation point of view: SGLR, SGLL, and DDGLL. It also motivates design decisions in the parsing architectures for SDF{1,2} and Rascal with previously unpublished detail. The essay falls short of a literature review and a tool evaluation since it does not investigate the disambiguation methods of the many other parser generator tools that exist. The fact that only the implementation algorithms are different between the compared parsing architectures, while the syntax definition formalisms have practically the same formal semantics for historical reasons, nicely \"isolates the variable\" of interest. We hope this essay lives up to the enormous enthusiasm, curiosity, and drive for perfection in syntax definition and parsing that Eelco always radiated. We dearly miss him. @InProceedings{vinju:OASIcs.EVCS.2023.31, author =\t{Vinju, Jurgen J.}, title =\t, booktitle =\t{Eelco Visser Commemorative Symposium (EVCS 2023)}, pages =\t{31:1--31:16}, series =\t{Open Access Series in Informatics (OASIcs)}, year =\t{2023}, volume =\t{109}, editor =\t{L\\\"{a}mmel, Ralf and Mosses, Peter D. and Steimann, Friedrich}, publisher =\t{Schloss Dagstuhl -- Leibniz-Zentrum f{\\\"u}r Informatik}, doi =\t\t{10.4230/OASIcs.EVCS.2023.31}, } 2022 Large-scale semi-automated migration of legacy C/C++ test code Mathijs T. W. Schuts, Rodin T. A. Aarssen, Paul M. Tielemans, and Jurgen J. Vinju. Software: Practise & Experience. This is an industrial experience report on a large semi-automated migration of legacy test code in C and C++. The particular migration was enabled by automating most of the maintenance steps. Without automation this particular large-scale migration would not have been conducted, due to the risks involved in manual maintenance (risk of introducing errors and risk of unexpected rework and loss of productivity). We describe and evaluate the method of automation we used on this real-world case. The benefits were that by automating analysis, we could make sure that we understand all the relevant details for the envisioned maintenance, without having to manually read and check our theories. Furthermore, by automating transformations we could reiterate and improve over complex and large scale source code updates, until they were \"just right\". The drawbacks were that, first, we have had to learn new metaprogramming skills. Second, our automation scripts are not readily reusable for other contexts; they were necessarily developed for this ad-hoc maintenance task. Our analysis shows that automated software maintenance as compared to the (hypothetical) manual alternative method seems to be better both in terms of avoiding mistakes and avoiding rework because of such mistakes. It seems that necessary and beneficial source code maintenance need not to be avoided, if software engineers are enabled to create bespoke (and ad-hoc) analysis and transformation tools to support it. @article{spe.3082, author = {Schuts, Mathijs T. W.",
  "content_length": 152350,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:22"
}