{
  "name": "Juseop Lee",
  "homepage": "https://sites.google.com/site/juseoplee",
  "status": "success",
  "content": "Juseop LeeSearch this siteEmbedded FilesSkip to main contentSkip to navigationHomeShort BioJuseop Lee received the B.Eng. and M.Eng. degrees in radio science and engineering from Korea University, Seoul, South Korea  and the Ph.D. degree in electrical engineering from the University of Michigan, Ann Arbor, MI, USA.He joined the Electronics and Telecommunications Research Institute (ETRI), Daejeon, South Korea, in 2001, where he was involved in the design of passive microwave equipment for Ku- and Ka-band communications satellites. In 2005, he joined the University of Michigan, where he was a Research Assistant and a Graduate Student Instructor at the Radiation Laboratory, and was involved in research activities focused on millimeter-wave radars and synthesis techniques for mulitple-passband microwave filters. In 2009, he joined Purdue University, West Lafayette, IN, USA, as a Post-Doctoral Research Associate, where he was involved in the design of adaptable RF systems. In 2012, he joined Korea University, where he is currently a Professor. From 2019 to 2020, he was a Visiting Professor at the University of Virginia, Charlottesville, VA, USA.  He was an Associate Editor for the IEEE TRANSACTIONS ON MICROWAVE THEORY AND TECHNIQUES from 2017 to 2019. His current research interests include RF and microwave circuits, satellite transponders, and wireless power transfer systems.Prof. Lee was the recipient of the Graduate Fellowship from the Korea Science and Engineering Foundation (KOSEF) and the Rackham Predoctoral Fellowship from the Rackham Graduate School, the University of Michigan. He was a recipient of the IEEE Microwave Theory and Techniques Society (IEEE MTT-S) Graduate Fellowship.  Contact InformationJuseop Lee Professor Department of Computer and Communications EngineeringCollege of Information and CommunicationsKorea University145 Anam-ro, Seongbuk-gu, Seoul, Republic of Korea, 136-701. Phone : +82-2-3290-4848E-mail : juseoplee at korea dot ac dot kr Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 2063,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:20"
}