{
  "name": "Jussi Kangasharju",
  "homepage": "https://researchportal.helsinki.fi/en/persons/jussi-kangasharju",
  "status": "success",
  "content": "Jussi Kangasharju - University of Helsinki © © 2024 Susan Heikkinen Jussi Kangasharju Helsinki Institute for Information TechnologyProfessor, Department of Computer ScienceSupervisor for doctoral programme, Doctoral Programme in Computer Science﻿﻿﻿Collaborative Networking research group / Jussi Kangasharju https://orcid.org/0000-0001-6119-1638 Phone+358504151708, +358294151379Emailjussi.kangasharjuhelsinkifi FinlandPL 68 (Pietari Kalmin katu 5)00014Finland 20052025 Research activity per year Personal profile Curriculum vitaeJussi Kangasharju received his MSc from Helsinki University of Technology in 1998. He received his Diplome d'Etudes Approfondies (DEA) from the Ecole Superieure des Sciences Informatiques (ESSI) in Sophia Antipolis in 1998. In 2002 he received his PhD from University of Nice Sophia Antipolis/Institut Eurecom. In 2002 he joined Darmstadt University of Technology (TUD), first as post-doctoral researcher, and from 2004 onwards as assistant professor. In 2007 he successfully passed his 3-year evaluation for a contract extension at TUD. Since June 2007 Jussi is a professor at the department of computer science at University of Helsinki. Between 2009 and 2012 he was also the director of the Future Internet research program at Helsinki Institute for Information Technology (HIIT). Jussi's research interests are edge computing, information-centric networking, content distribution, green networking, and future Internet development. He is a member of IEEE and ACM. Fields of Science113 Computer and information sciencesnetworkinginformation-centric networksedge computingdistributed systemsmobile networkscontent distributioncloud computingopportunistic networks Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2005 2006 2007 2008 2011 2012 2013 2016 2017 2018 2025 109 Conference contribution 25 Article 3 Anthology or special issue 3 Conference article 3 More 2 Poster 1 Chapter Research output per year Research output per year Milking the Cache Cow With Fairness in MindWang, L., Tyson, G., Kangasharju, J. & Crowcroft, J., Oct 2017, In: IEEE/ACM Transactions on Networking. 25, 5, p. 2686-2700Research output: Contribution to journal › Article › Scientific › peer-review Hybrid renewable energy routing for ISP networksMineraud, J., Wang, L., Balasubramaniam, S. & Kangasharju, J., 2016, IEEE INFOCOM 2016: The 35th Annual IEEE International Conference on Computer Communications. New York, NY: IEEE, 9 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Measuring Large-Scale Distributed Systems: Case of BitTorrent Mainline DHTWang, L. & Kangasharju, J., Sept 2013, Peer-to-Peer Computing (P2P). IEEE, 10 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Floating Content: Information Sharing in Urban AreasOtt, J., Hyytiä, E., Lassila, P., Vaegs, T. & Kangasharju, J., 2011, 2011 IEEE International Conference on Pervasive Computing and Communications (PerCom). p. 136-146 11 p.Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review BubbleStorm: Resilient, Probabilistic, and Exhaustive Peer-to-Peer Search Terpstra , W., Kangasharju, J., Leng, C. & Buchmann , A., 2007, In: Computer Communications Review. 37, 4, p. 49-60 12 p.Research output: Contribution to journal › Conference article › Scientific › peer-review View all 143 research outputs Projects Projects per year 2023 2025 2040 1 Finished 4 Active Projects per year XRISE: Advancing Extended Reality with Scalability and Immersive ExperienceKangasharju, J. (Project manager) & Ojanen, M. (Participant)Suomen Akatemia Projektilaskutus01/09/2025 → 31/08/2029Project: Research Council of Finland: Academy Project ELLIS-instituutti, lahjoitus SarlinKangasharju, J. (Project manager)Sarlin Peter01/01/2025 → 31/12/2032Project: Other funder Yliopiston profilointi 8 - DIVSOL - HumtAiravaara, M. (Project manager), Eronen, J. T. (Project manager), Hietakangas, V. (Project manager), Huiskonen, J. (Project manager), Kaartinen, T. (Project manager), Kangasharju, J. (Project manager), Kouvonen, P. J. (Project manager), Martikainen, P. (Project manager), Mäkelä, J. (Project manager), Niemi, M. (Project manager), Ojanen, T. (Project manager), Pönkä, V. (Project manager), Ripatti, S. (Project manager), Räsänen, A. (Project manager), Simojoki, H. (Project manager), Sinnemäki, K. (Project manager), Suomalainen Wartiovaara, A. (Project manager), Toivonen, R. (Project manager), Toom, A. (Project manager), Björkroth, J. (Participant), Bärlund, J. C. (Participant), Enkavi, G. (Participant), Floréen, P. (Participant), Fogelholm, M. (Participant), Grönlund, H. (Participant), Heinonen, M. (Participant), Holmström, A.-R. (Participant), Hämäläinen, K. K. (Participant), Jahnukainen, M. (Participant), Jeltsch, M. (Participant), Juhola, S. (Participant), Keskinen, S. (Participant), Khan, S. H. (Participant), Klami, A. (Participant), Korhonen, K. (Participant), Kuosmanen, S. (Participant), Laaksonen, T. (Participant), Leino, T. (Participant), Lindh, I. (Participant), Luukkonen, J. (Participant), McWilliams, T. (Participant), Norio, J. (Participant), Nur, N. H. M. (Participant), Näre, L. (Participant), Paavilainen, V. (Participant), Pajari, A.-M. (Participant), Pessi, A. B. (Participant), Pitkänen, E. (Participant), Rantamäki, T. (Participant), Repo, H. D. (Participant), Rubinacci, S. (Participant), STRATOULIAS, V. (Participant), Sandell, M. (Participant), Strachan, C. (Participant), Uimari, P. (Participant), Vattulainen, I. T. (Participant), Wohlström, T. (Participant), Wrede, S. (Participant) & Öörni, K. (Participant)Academy of Finland, Suomen Akatemia Projektilaskutus, Suomen Akatemia Talous/Paula Pesola01/01/2025 → 31/12/2030Project: Research Council of Finland: Strengthening university research profiles (PROFI) HY375 - Professur i datavetenskapKangasharju, J. (Project manager) & Mannila, L. C. Y. (Participant)Kulturfonden f. Sverige och Finland01/01/2024 → 31/12/2040Project: Foundations (Private Foundations, Non-Profit Foundations, Charitable Trusts) Lahjakirja Kone Oy 28.2.2023Kangasharju, J. (Project manager)Kone Oyj01/03/2023 → 31/12/2023Project: Corporate funding Datasets Effects of Cooperation Policy and Network Topology on Performance of In-Network CachingWang, L. (Creator), Bayhan, S. (Creator) & Kangasharju, J. (Creator), IEEE Communications Letters, 2014DOI: 10.1109/LCOMM.2014.013114.132647Dataset Prizes Best Paper AwardKangasharju, J. (Recipient), 1 Oct 2015Prize: Prizes and awards Winner of 9th Helsinki Science Slam CompetitionKangasharju, J. (Recipient), 28 May 2016Prize: Prizes and awards Best paper awardKangasharju, J. (Recipient), 14 Mar 2004Prize: Prizes and awards Activities Activities per year 2007 2010 2011 2012 2013 2014 2015 2017 72 Peer review of manuscripts 18 Academic visit to other institution 12 Supervisor or co-supervisor of doctoral thesis 11 Organisation and participation in conferences, workshops, courses, seminars 27 More 5 Opponent of doctoral dissertation 5 Pre-examiner of doctoral thesis 4 Member of doctoral thesis committee / follow-up group 4 Academic visit at UH 3 Other tasks of an expert in private sector 1 Editor of research journal 1 Director of doctoral programme 1 Assessment of candidates for academic posts 1 Membership or other role in national/international committee, council, board 1 Membership or other role in review committee 1 Oral presentation Activities per year Seoul National UniversityKangasharju, J. (Visiting researcher)1 Sept 2012 → 31 Jan 2013Activity: Visiting an external institution types › Academic visit to other institution International Computer Science InstituteKangasharju, J. (Visiting researcher)1 Mar 2013 → 31 Jul 2013Activity: Visiting an external institution types › Academic visit to other institution ICUFN (Journal)Kangasharju, J. (Programme Committee Member)2017Activity: Publication peer-review and editorial work types › Peer review of manuscripts ICOIN (Journal)Kangasharju, J. (Programme Committee Member)2017Activity: Publication peer-review and editorial work types › Peer review of manuscripts IEEE ICC (Journal)Kangasharju, J. (Programme Committee Member)2017Activity: Publication peer-review and editorial work types › Peer review of manuscripts View all 140 activities Press/Media Helsinki - auf dem Weg zur intelligenten StadtKangasharju, J.02/01/20171 Media contributionPress/Media: Press / Media Interview for Yle Puoli SeitsemänKangasharju, J.09/11/20161 Media contributionPress/Media: Press / Media Interview for German and Austrian journalists visiting FinlandKangasharju, J.01/01/20161 Media contributionPress/Media: Press / Media Academy of Finland Video BlogKangasharju, J.01/01/20151 Media contributionPress/Media: Press / Media Interview for TietoviikkoKangasharju, J.01/01/20151 Media contributionPress/Media: Press / Media View all 13 press/media",
  "content_length": 9339,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:22"
}