{
  "name": "Justine Cassell",
  "homepage": "https://www.hcii.cmu.edu/people/justine-cassell",
  "status": "success",
  "content": "Justine Cassell | Human-Computer Interaction Institute Skip to main content Search Expand Menu Close Menu Justine Cassell Professor Affiliated Faculty Email justine@cs.cmu.edu Phone 412-204-6268 Campus Address GHC 5107 Links Website Google Scholar Research Areas Learning Sciences and Educational Technologies Social Computing Justine Cassell’s research interests originated in the study of human-human conversation and storytelling. Progressively she became interested in allowing computational systems to participate in these activities. This new technological focus led her to deconstruct the linguistic elements of conversation and storytelling in such a way as to embody machines with conversational, social and narrative intelligence so that they could interact with humans in human-like ways. Increasingly, however, her research has come to address the impact and benefits of technologies such as these on learning and communication. In particular, Cassell is credited with developing the Embodied Conversational Agent (ECA), a virtual human capable of interacting with humans using both language and nonverbal behavior. More recently Cassell has investigated the role that the ECA can play in children’s lives, as a Story Listening System (SLS): peer support for learning language and literacy skills. And Cassell has also employed linguistic and psychological analyses to look at the effects of online conversation among a particularly diverse group of young people on their self-esteem, self-efficacy, and sense of community. Once machines have human-like capabilities, can they be used to evoke the best communicative skills that humans are capable of, the richest learning? This is the goal of Cassell’s research: to develop technologies that evoke from humans the most human and humane of our capabilities, and to study their effects on our evolving world. Cassell is the director emerita of the HCII. Currently, in addition to her role as a professor, Cassell is also associate dean of the School of Computer Science for technology strategy and impact at CMU, co-director of the university's Simon Initiative, and co-director of the university's Yahoo-InMind collaboration. Related Projects Project Scaffolding Science Achievement in a Culturally Diverse Classroom In this project, we aim to address the systematically-reduced standardized test scores of African American students compared to their Euro-American peers In this project, we aim to address the systematically-reduced standardized test scores of African American students compared to their Euro-American peers by using virtual peer technology to understand ... View Details Project Connection Machines Our Connection Machines project investigates nonverbal and verbal behaviors of two partners in a conversation setting in the context of rapport. We have c Our Connection Machines project investigates nonverbal and verbal behaviors of two partners in a conversation setting in the context of rapport. We have collected data on teenagers conducting a peer t ... View Details Back to Top",
  "content_length": 3063,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:30"
}