{
  "name": "Justin Zhijun Zhan",
  "homepage": "https://researchdirectory.uc.edu/p/zhanjt",
  "status": "success",
  "content": "Expert Profile: Justin Zhan | Research Directory Justin Zhan Professor Fred A. & Juliet Esselborn Geier Chair Professor and Department Head Rhodes Hall 895 CEAS - Computer Science - 0030 EmailDownload V-Card Justin Zhan is the Head of Department of Computer Science, College of Engineering and Applied Science, University of Cincinnati. His research interests include data science, artificial intelligence, blockchain technologies, biomedical informatics, information assurance, and social computing. He was a steering chair of the IEEE International Conference on Social Computing (SocialCom), IEEE International Conference on Privacy, Security, Risk and Trust (PASSAT), and IEEE International Conference on BioMedical Computing (BioMedCom). He has been an editor-in-chief of the International Journal of Privacy, Security and Integrity, and International Journal of Social Computing and Cyber-Physical Systems. He has served as a conference general chair, a program chair, a publicity chair, a workshop chair, and a program committee member for 150 international conferences; he has also served as an editor-in-chief, editor, associate editor, guest editor, editorial advisory board member, and editorial board member for 30 journals. He has published 250 articles in peer-reviewed journals and conferences and delivered more than 30 keynote speeches and invited talks. He has been involved in more than 60 projects as a principal investigator (PI) or a Co-PI, which were funded by the National Science Foundation, Department of Defense, National Institute of Health, etc. Grant: #N00014-23-1-2396 Investigators:Breiter, Hans; Kim, Byoung Woo; Zhan, Justin Zhijun 05-01-2023 -04-30-2027 Office of Naval Research Automated Mental Health (AMH) to Predict Inward and Outward Destructive Behaviors along with Mental Health Role:Collaborator 223000.00 Awarded Level:Federal Grant: #Purch Serv Agreement Investigators:Zhan, Justin Zhijun 09-01-2023 -08-31-2024 Cincinnati Children's Hospital Medical Center Data Analysis Role:PI 86531.00 Hold Level:Non Profit Grant: #DUE-2322109 Investigators:Gaskins, Whitney; Imbrie, Peter; Lim, Youn Seon; Zhan, Justin Zhijun 10-01-2023 -09-30-2029 National Science Foundation S-STEM TYPE 2: Southwest Ohio Scholars: (Re)defining Academic Belonging for Computer Science Students and Families Role:PI 2462801.00 Awarded Level:Federal Grant: #ITE-2333726 Investigators:Yeghiazarian, Lilit; Zhan, Justin Zhijun 10-01-2023 -09-30-2026 National Science Foundation Proto-OKN Theme 1: The Water-Energy Nexus Open Knowledge Network (WEN-OKN) Role:Collaborator 1472016.00 Awarded Level:Federal Grant: #ITE-2346609 Investigators:Lim, Youn Seon; Zhan, Justin 06-01-2024 -05-31-2027 National Science Foundation Beginning: Establishing an Experiential Learning Pathway in Artificial Intelligence Role:PI 1000000.00 Hold Level:Federal Grant: #OA0000531-02 Investigators:Zhan, Justin 08-15-2024 -08-14-2028 Cincinnati Children's Hospital Medical Center Developing A Biomedical Knowledge Graph Role:PI 53480.00 Hold Level:Non Profit Grant: #RCA110802 Investigators:Zhan, Justin 08-01-2025 -07-31-2026 Cincinnati Children's Hospital Medical Center Developing A Data Analytics Framework Role:PI 59808.00 Hold Level:Non ProfitPeer Reviewed Publications Baker W, Colditz JB, Dobbs PD, Mai H, Visweswaran S, Zhan J, Primack BA. (2022. ) Classification of Twitter Vaping Discourse Using BERTTweet: Comparative Deep Learning Study.Journal of Medical Internet Research Medical Informatics, , 21;10(7):e33678 , More Information Schwob, M., Zhan, J., and Dempsey A., (2021. ) Modeling Cell Communication with Time-Dependent Signaling Hypergraphs.IEEE/ACM Transactions on Computational Biology and Bioinformatics, , May-Jun 2021;18(3):1151-1163 , More Information Bakare, A., Meshrkey, F., Lowe, B., Molder, C., Rao, R., Zhan, J. and Iyer, S., (2021. ) MitoCellPhe reveals mitochondrial morphologies in single fibroblasts and clustered stem cells.American Journal of Physiology Cell Physiology, , 321: C735–C748 , More Information Chiu, C. and Zhan, J. (2019. ) An Evolutionary Approach to Compact DAG Neural Network Optimization .IEEE Access, , 7 , Chopade, P. and Zhan, J (2017. ) Towards A Framework for Community Detection in Large Networks using Game-Theoretic Modeling .IEEE Transactions on Big Data, , 3 (3 ) ,",
  "content_length": 4323,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:30"
}