{
  "name": "Justin Domke",
  "homepage": "https://people.cs.umass.edu/~domke",
  "status": "success",
  "content": "Justin Domke Associate Professor College of Computing and Information Sciences University of Massachusetts, Amherst email: (my last name)@cs.umass.edu phone: +1 585 545 3241 office: CICS 208 Interests Machine Learning, Probabilistic Models, Optimization, Inference Slides Monte Carlo Variational Inference Diffusion-based variational inference Convergence Guarantees for Variational Inference Selected Recent Publications Hamiltonian Monte Carlo Inference of Marginalized Linear Mixed-Effects Models, NeurIPS 2024 (with J. Lai and D. Sheldon) Disentangling impact of capacity, objective, batchsize, estimators, and step-size on flow VI, ICML 2024 (with A. Agrawal) Understanding and mitigating difficulties in posterior predictive evaluation, ICML 2024 (with A. Agrawal) Sample Average Approximation for Black-box VI, UAI 2024 (with J. Burroni and D. Sheldon) Simulation-based stacking, AISTATS 2024 (with Y. Yao and B. Régaldo-Saint Blancard) Joint control variate for faster black-box variational inference, AISTATS 2024 (with X. Wang and T. Geffner) Provable convergence guarantees for black-box variational inference, NeurIPS 2023 (with G. Garrigos and R. Gower) Discriminative calibration: Check Bayesian computation from simulations and flexible classifier, NeurIPS 2023 (with Y. Yao) U-Statistics for Importance-Weighted Variational Inference, TMLR 2023 (with J. Burroni, K. Takatsu, D. Sheldon) Langevin Diffusion Variational Inference, AISTATS 2022 (with T. Geffner) Variational Inference with Locally Enhanced Bounds for Hierarchical Models, ICML 2022 (with T. Geffner) Variational Marginal Particle Filters, AISTATS 2022 (with J. Lai and D. Sheldon) Amortized Variational Inference for Simple Hierarchical Models, NeurIPS 2021 (with A. Agrawal) MCMC Variational Inference via Uncorrected Hamiltonian Annealing, NeurIPS 2021 (with T. Geffner) On the Difficulty of Unbiased Alpha Divergence Minimization, ICML 2021 (with T. Geffner) [talk] [poster] [slides] Advances in Black-Box VI: Normalizing Flows, Importance Weighting, and Optimization, NeurIPS 2020 (with A. Agrawal and D. Sheldon) [code] Approximation Based Variance Reduction for Reparameterization Gradients, NeurIPS 2020 (with T. Geffner) Provable Smoothness Guarantees for Black-Box Variational Inference, ICML 2020 [talk] [slides] A Rule for Gradient Estimator Selection, with an Application to Variational Inference, AISTATS 2020 (with T. Geffner) [talk] Divide and Couple: Using Monte Carlo Variational Objectives for Posterior Approximation, NeurIPS 2019 (with D. Sheldon) [slides] [poster] [talk] Provable Gradient Variance Guarantees for Black-Box Variational Inference, NeurIPS 2019 [poster] Thompson Sampling and Approximate Inference, NeurIPS 2019 (with M. Phan and Y. Abbasi-Yadkori) Using Large Ensembles of Control Variates for Variational Inference, NeurIPS 2018 (with T. Geffner) Importance Weighting and Variational Inference, NeurIPS 2018 (with D. Sheldon) [poster] Weblog justindomke.wordpress.com Software Pangolin (Python Bayesian inference interface) Graphical Models Toolbox (Matlab toolbox) MARBL (Command line C++ tool, also usable on clusters.) Prospective Student information Possible independent study research topics (accessible from inside UMass only) Teaching (at UMass) Fall 2022 Machine Learning, COMPSCI 589 Spring 2022 Making Predictions, COMPSCI 590L Fall 2021 Machine Learning, COMPSCI 589 Spring 2021 Machine Learning, COMPSCI 589 Spring 2021 Graphical Models, COMPSCI 688 Spring 2020 Machine Learning, COMPSCI 589 Spring 2020 Graphical Models, COMPSCI 688 Spring 2019 Machine Learning, COMPSCI 589 Spring 2019 Graphical Models, COMPSCI 688 Fall 2017 Machine Learning, COMPSCI 589 Spring 2017 Graphical Models, COMPSCI 688 Fall 2016 Machine Learning, COMPSCI 589 (at ANU) Semester 2 2014 Advanced Topics in Statistical Machine Learning (Structured Probabilistic Models) Semester 2 2013 Advanced Topics in Statistical Machine Learning (Convex Optimization) (at RIT) Spring 2011-2012 Statistical Machine Learning Winter 2011-2012 Discovery Spring 2010-2011 Statistical Machine Learning Winter 2010-2011 Discovery Winter 2010-2011 Artificial Intelligence Spring 2009-2010 Statistical Machine Learning",
  "content_length": 4204,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:25"
}