{
  "name": "Justin Zobel",
  "homepage": "http://people.eng.unimelb.edu.au/jzobel",
  "status": "success",
  "content": "Justin Zobel Justin Zobel Justin Zobel Redmond Barry Distinguished Professor, School of Computing and Information Systems, the University of Melbourne Pro Vice-Chancellor, Graduate & International Research. Mail: Chancellery Research & Enterprise Level 6, Raymond Priestley Building University of Melbourne, Parkville 3010, Australia Email: jzobel@unimelb.edu.au Executive assistant: Sharon Renaut, +61 3 8344 8479, s.renaut@unimelb.edu.au Texts ... How To Write Your First Thesis (Gruba and Zobel, 2017, also available as How To Write A Better Minor Thesis, 2014). Intended for students who are undertaking their first research project (in any discipline), for example as a one- or two-semester subject in a coursework program. How To Write A Better Thesis (Evans, Gruba, and Zobel, third edition, 2011), published in Australia by MUP and internationally by Springer. Intended for students undertaking a PhD in any discipline. Writing for Computer Science (Zobel, third edition, 2015). Intended for students or researchers who need to communicate about their work in the mathematical sciences, in particular computer science. Research interests ... Search engines and information retrieval; I was elected to the SIGIR Academy in the class of 2022. Algorithms and data structures Research methods A list of my publications can be found on Google Scholar. Another area of interest is how to get the greatest impact out of our research, in particular, how to be sure that our results are correct and how to accurately predict the behaviour of an algorithm in a practical setting. What basis should we have for choosing amongst methods? What is the computing equivalent to the 'properties of materials' that are necessary in engineering? I'm also interested in computing history, in particular CSIRAC. (And there's also my calculators.) Always open to suggestions! And ... new research students welcome. Here are some vaguely useful sites. This website was created by Justin Zobel. All views expressed herein are personal and do not necessarily reflect those of the School or the University.",
  "content_length": 2088,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:31"
}