{
  "name": "Justus Thies",
  "homepage": "https://justusthies.github.io",
  "status": "success",
  "content": "3D Graphics \\& Vision - TU Darmstadt Hi! The '3D Graphics & Vision' group at TU Darmstadt works at the intersection of computer graphics, computer vision and machine learning. Specifically, we are interested in marker-less motion capturing of facial performances, human bodies as well as general non-rigid objects. Besides capturing and reconstructing reality, we work on AI-based synthesis techniques that allow for photorealistic image and video synthesis. Reasonable Artificial Intelligence The “Reasonable Artificial Intelligence” project receives funding as a Cluster of Excellence. 2025, May 23   — German Pattern Recognition Award 2024 I have been awarded with the DAGM German Pattern Recognition Award 2024. 2024, Oct 01   — ERC Starting Grant 2024 I have been awarded with an ERC Starting Grant 2024. We will work on learning digital humans in motion. 2024, Sep 30   — EG Young Researcher Award 2024 I have been awarded with the Eurographics Young Researcher Award 2024. 2024, May 01   — 3D Graphics and Vision at the Technical University of Darmstadt I am happy to announce that I am joining the Technical University Darmstadt as a full professor for 3D Graphics and Vision in September 2023. My group will work at the intersection of computer graphics, computer vision and machine learning. 2023, Aug 14   — EG Junior Fellow I have been officially elected to the circle of EG Junior Fellows. 2021, May 14   — Neural Capture and Synthesis at the Max Planck Institute for Intelligent Systems I am happy to announce that I am joining the Max Planck Institute for Intelligent Systems as a research group leader. My Max Planck Research Group 'Neural Capture and Synthesis' will work at the intersection of computer graphics, computer vision and machine learning. 2021, Jan 31   — Cabinet Meeting: Synthetic Media - Danger or Opportunity? In this session we showed several demonstrations of our current projects, to inform the Cabinet of Germany about the risks and the opportunities of synthetic media. 2019, Nov 18   —",
  "content_length": 2025,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:31"
}