{
  "name": "Justine Sherry",
  "homepage": "http://www.justinesherry.com",
  "status": "success",
  "content": "Justine Sherry's Homepage Justine Sherry A. Nico Habermann Associate Professor of Computer Science [CSD] [Cylab] [SNAP] Carnegie Mellon University I am a computer scientist interested in everything networked: from protocols and applications to the hardware that carries our data across the Internet. My goal is to make networks faster, more reliable, more secure, and more equitable. Contact sherry@cs.cmu.edu Office: GHC 9227 Admin: Emily Spencer emilyspe@cs.cmu.edu I am a research scholar at Amazon. justines@amazon.com Recent Teaching 15-441/641: Computer Networks and the Internet 15-921: Readings on Research 15-744: Graduate Computer Networks Common Requests Prospective Undergradute Interns: I accept students through the ISR REUSE Program. Read more about how to apply here. Prospective PhD Students: My home at CMU is the Computer Science Department. Please apply to CSD to work with me. Peer Review: I only review for conferences which (a) have an enforced anti-harrasment policy, (b) use double-anonymous review, and (c) offer open-access proceedings. Research Lab/Team Hugo Sadok Miguel Ferreira Francisco Pereira Isabel Suizo Yiran Lei Emily Spencer Alumni Ranysha Ware PhD 2024, SIGCOMM Dissertation Award Assistant Professor, Swarthmore College Nirav Atre PhD 2024 Assistant Professor, Stanford University Adithya Abraham Philip PhD 2024 Transport and Protocols Engineer, Apple Research Highlights [SIGCOMM 2020] Delayed Hits [HotOS 2021] KOPI [IMC 2019] BBR (Un)Fairness [OSDI 2020] Pigasus Biography Justine Sherry is the A. Nico Habermann Associate Professor of Computer Science at Carnegie Mellon University. Her interests are in software and hardware networked systems at all layers. Much of her research focuses on middleboxes and network functions, specialized devices that secure Internet connections and make data load more efficiently. Together with her colleagues, she developed APLOMB, the first system to apply cloud computing principles to network functions; BlindBox, the first middlebox to scan the contents of encrypted traffic without decrypting it; and Pigasus, the first open-source intrusion detection system to operate over 100Gbps of data with a single server. Dr. Sherry has received numerous awards including an Alfred P. Sloan Research Fellowship, the VMWare Systems Award, an IETF Applied Networking Research Prize, and the SIGCOMM Doctoral Dissertation Award. She is a member of the ACM CoNEXT Steering Committee and an Amazon Scholar. Finally, she is always on the lookout for a great cappuccino. Fun I am a below average Learned League player. My spouse, Ruben Martins is also a computer science professor at CMU. We planned our wedding using a MaxSAT constraint solver.",
  "content_length": 2716,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:31"
}