{
  "name": "Justin W. L. Wan",
  "homepage": "https://cs.uwaterloo.ca/~jwlwan",
  "status": "success",
  "content": "Justin's Homepage Justin W.L. Wan Canada Research Chair in Scientific Computing Professor, BSc (Hong Kong, 92), MA (UCLA, 95), PhD (UCLA, 98). Justin Wan is a faculty member of the Scientific Computing group at the David R. Cheriton School of Computer Science, University of Waterloo. He received his PhD degree from the Applied Math Program in the Department of Mathematics, UCLA. After graduation, he started as his career at at Stanford University as a Forsythe Fellow (acting assistant professor) before he joined the University of Waterloo. In 2010-2015, Justin was the Director for the Centre of Computational Mathematics for Industry and Commerce (CCMIC). He was appointed as the Associate Director for the Cheriton School of Computer Science in 2015-2018 and then the Director of Graduate Studies in 2019-2021. He is currently a Co-Director for the Computing and Financial Management Program since 2019. Justin has also been active in service for his research community. He was elected and served as the Secretary for the Canadian Applied and Industrial Mathematics Society (CAIMS) from 2015-2020. He has been organizers of local workshops as well as international conferences such as the CAIMS Annual Meeting in 2021. He has also served as editors for journals and members of a number of program committees. Research Interests Justin Wan's research is in the general area of scientific computing. Combining ideas and theories from mathematical modelling and numerical computation, advanced, robust and efficient numerical techniques are developed to solve complex application problems arising in science, engineering, finance and economics. Applications of his research include medical image processing (image restoration, segmentation, registration), machine learning and neural network model for financial applications (option pricing, jump processes), and computer graphics simulation of physical phenomenon. Some of his recent projects include image enhancements of CT scans, computation of American options with many assets and hedging parameters, and fast fluid simulation with deformable solid objects. Recent Projects Publications Research Team PhD students Hossein Aboutalebi (co-supervised with Prof. Alex Wong) Andrew Na Connor Tannahill Chris West (co-supervised with Prof. Anita Layton) Master's student Ying Kit (Marco) Hui Shujie Liu Lufan Wang Undergraduate students Isaiah Witzke Maxine Zhang My research team embraces the values of equity, anti-racism, and inclusion. Students who have been historically disadvantaged and marginalized, including those who identify as Indigenous peoples (e.g., First Nations, Métis, Inuit/Inuk), Black, racialized, people with disabilities, women and/or 2SLGBTQ+, are encouraged to join the team. Contact Information Justin W. L. Wan Office: DC 3625 Tel: (519) 888 4567 x34468 David R. Cheriton School of Computer Science 200 University Avenue West University of Waterloo Waterloo, Ontario N2L 3G1 Canada Email: <justin.wan@uwaterloo.ca>",
  "content_length": 2997,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:28"
}