{
  "name": "Justin R. Brooks",
  "homepage": "https://www.csee.umbc.edu/people/faculty/justin-brooks",
  "status": "success",
  "content": "Justin Brooks – Department of Computer Science and Electrical Engineering – UMBC Skip to main content Department of Computer Science and Electrical Engineering Menu Apply Search Search Context This Site All of UMBC Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn Position Associate Professor of Computer Science and Electrical Engineering Office 358 Information Technology and Engineering (ITE) Building Contact Information University of Maryland, Baltimore County 1000 Hilltop Circle Baltimore, MD 21250 E-mail: jbrook1@umbc.edu Education M.D. Washington University in St. Louis, 2012 Ph.D. Neuroscience, Washington University in St. Louis, 2012 B.S. Biological Sciences, UMBC, 2004 Research Areas Computational psychophysiology, algorithm development, wearable devices, and Human-System Interaction. Biography Dr. Brooks is a physician-scientist with an interest in using mobile/wearable technologies to understand, predict, and influence human behavior and health.  Prior to joining UMBC as an Associate Professor of Computer Science and Electrical Engineering, Dr. Brooks has worked in private industry and US Government laboratories in which he conducted and led multiple research programs.  Over his research career Dr. Brooks has published or co-authored several peer-reviewed manuscripts in the areas of social/team interaction dynamics, psychophysiology, computational neuroscience, behavioral neuroscience, and dynamical systems. In addition to his research credentials Dr. Brooks is a licensed physician in Virginia, Maryland, and D.C. Location CSEE Main Office: ITE 325 1000 Hilltop Circle Baltimore, MD 21250 Contact Phone: 410-455-3500Contact Us Department of Computer Science and Electrical Engineering on FacebookDepartment of Computer Science and Electrical Engineering on TwitterDepartment of Computer Science and Electrical Engineering on YouTubeDepartment of Computer Science and Electrical Engineering on LinkedIn © UMBC: A University System of Maryland Member Institution Accreditation Equal Opportunity Privacy Policy Title IX Web Accessibility Consumer Information Subscribe to UMBC Weekly Top Stories First Name Last Name Email I am interested in: I am interested in: Undergraduate I am interested in: Graduate I am interested in: Professional Masters",
  "content_length": 2616,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:26"
}