{
  "name": "Juw Won Park",
  "homepage": "http://louisville.edu/research/kbrin/news/juw-won-park",
  "status": "success",
  "content": "Juw Won Park, PhD — KY INBRE KY INBRE Navigation Home Expand News SubmenuNewsJuw Won Park, PhD NewsNews Dropdown ToggleJuw Won Park, PhD Home / News / Juw Won Park, PhD Juw Won Park, PhD Education: B.S. in computer science, Korea University, 1995 M.S. in computer science, University of Iowa, 1999 Ph.D. in computer science, University of Iowa, 2009 Postdoctoral fellow, Department of Internal Medicine, University of Iowa, 2009-2012 Postdoctoral fellow, Department of Microbiology, Immunology, & Molecular Genetics, UCLA, 2013-2015 Welcome KBRIN is pleased to welcome Juw Won Park, PhD to the KBRIN Bioinformatics Core. Dr. Park is a newly appointed Assistant Professor, with his primary appointment in the Department of Computer Engineering and Computer Science. His recruitment is supported by the KBRIN Bioinformatics Core in which he is actively engaged in providing service and collaboration. Dr. Park comes to us from the UCLA Department of Microbiology, Immunology, & Molecular Genetics, where he was a postdoctoral scholar in the XingLaboratory of RNA Genomics and Bioinformatics.. Research InterestsDr. Park’s research focuses on the analysis of alternative mRNA splicing and its regulation in eukaryotic cells using high-throughput RNA sequencing (RNA-seq) and related genomic technologies, including their biological applications. He also develops novel computational and statistical methods for analysis of massive genome and transcriptome data. Recent Research: Dr.Park’s most recent research is being published by eLife and is titled “The splicing regulators Esrp1 and Esrp2 direct an epithelial splicing program essential for mammalian development..” He is most interested in the epithelial specific gene proteins Esrp1 and Esrp2, with which he became acquainted with while working with University of Pennsylvania researchers who discovered them. This recent work studies regulators and their requirement for establishing a proper skin barrier. Dr. Park will continue his research in cell-type specific or tissue specific splicing study. In early 2015, Dr. Park published a paper in Molecular Cancer Research, titled “Transcriptome-wide Landscape of Pre-mRNA Alternative Splicing Associated with Metastatic Colonization” which has received much interest in the research community. This work examines changes in genes and exons after a prostate cancer cell moves through the EMT process [epithelial stage to mesenchymal stage] to determine the set of genes and exons associated with cancer metastasis. Software Development:Dr. Park is coauthor of the rMATS software for alternative splicing analysis. Awards:NIH Institutional T32 Training Grant in Molecular & Cellular Biology of the Lung in 2009 through 2012. Just asking: How did you become interested in genomic technologies? My background is in the visualization of scientific data, particularly the analysis of multidimensional data in likelihood space. While working on data visualization, I became increasingly interested in the data itself. For this reason I began working on data clustering to find the causal region in the chromosome associated with particular traits or diseases. I received my PhD and I was wondering after I send [the bio lab] the chromosomal locations, what happens next? What is the downstream analysis we can perform?’ This application interest is why I started looking for the bioinformatics lab that utilizes the output that I generated during my PhD training. I saw that [using] RNA sequencing we can examine what is happening at the RNA level. I liked that capability and started working on it. So I went from computer graphics to visualization and multidimensional data visualization, and then to clustering. Now I am working on bioinformatics using next-generation sequencing. I am working on the computer [analysis], but I am also working on the biological problem. Therefore, my collaborators are MDs or biologists, which is really fun. I respect them a lot, because the ways they approach or find problems is amazing! I am really happy to be working with them. KY INBRE Administrative Core Offices and the Bioinformatics Suite 522 E. Gray Street Louisville, KY 40292 (Overnight zip code: 40202) Office Hours M-F 8 am to 5 pm Email kyinbre@gmail.com Social Media Facebook Instagram LinkedIn Twitter YouTube #proud2bKYINBRE Acknowledgement Material on this site is supported by a grant from the National Institutes of Health National Institute of General Medical Sciences (5P20GM103436-22). Any opinions, findings, conclusions or recommendations expressed in this material are those of the KY INBRE Program and do not necessarily reflect the views of the NIH.",
  "content_length": 4663,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:35"
}