{
  "name": "Juyang Weng",
  "homepage": "http://www.cse.msu.edu/~weng",
  "status": "success",
  "content": "Weng, Juyang Juyang Weng SAIL developmental robot Dav on Aug. 24, 2003 Juyang (John) Weng is a former faculty member of the Department of Computer Science and Engineering at Michigan State University, a member of the MSU Cognitive Science Program and a member of the MSU Neuroscience Program . His research interests lie in the intersection of the general fields of computer science and engineering, brain science, and cognitive science. He and his coworkers study mental architectures; computational models of autonomous development for vision, audition, touch, behaviors and motivational systems in biological and engineered systems; and techniques that enable and facilitate autonomous development of mental skills. Engineering applications include pattern recognition, computer vision, speech recognition, language processing, robotics, sequential decision-making, and human-computer interactions. He is a co-founder of the Embodied Intelligence Laboratory and was a member of the PRIP Laboratory. Prof. Weng no longer officially serve as MSU advisors, but those who are interested in participation of other project opportunites can send emails to him. From the Popular Press (Technology Review) Teachable Robots (Detroit Free Press) Possibilities Limitless for MSU's Thinking Robots (Lansing State Journal) Dav, A Robotic Soldier, or Just Maybe a Maid.  Another related article with a picture. (Exploratorium Magazine)  Bringing up Baby (ACM TechNews, US) New Kind of Intelligent Robot Can Learn by Experience (KRN, US) Like a Child, \"Smart\" Robot Learns Gradually appeared in about 30 US newspapers including Detroit Free Press, Philadelphia Inquirer, and San Jose Mercury News. (Boiler Magazine, Italy) La mente del robot (The Mind of Robot) (TP, Singapore) Bring on the Intelligent Robot (Telepolis, Germany) Lernen wie die Kinder (Learn like a Child) (UPI, USA) Robot Learns Like a Child (BBC, UK) Time for Real Intelligence? Events IEEE CDS Newsletters, vol. 18, no. 1, Feb. 2024 IEEE CDS Newsletters, vol. 17, no. 1, Oct. 2023 RAAI 2022 Keynote: The First Conscious Learning Algorithm Avoids \"Deep Learning\" Misconduct, Singapore, Dec. 10, 2022 ICDL 2022 Tutorial: Conscious Learning by Developmental Networks: Vision, Audition, Natural Languages, Planning and Thinking, 2:00 pm - 6:00 pm, London Time, September 19, 2022 The first Conscious Learning Algorithm: A Developmental Network Model of Conscious Learning in Biological Brains, \tResearch Square, pp. 1- 33, June 7, 2022. Upcoming Book: Councious Learning: Preface, Chinese Preface, June 7, 2022. BMI Machine Conscious Learning Project, Dec. 15, 2021. A Report to CACM on Data Deletions by Krizhevsky, Sutskever and Hinton, Dec. 14, 2021. Data Deletions in AI papers in Science since 2015 and the Appropriate Protocol, Dec. 13, 2021. Data Deletions in AI Papers in Nature since 2015 and the Appropriate Protocol, June 28, 2021. Report to Nature about Research Misconducts via Post-Selections Using Test Sets, June 4, 2021. Why Is Eugenics Fraudulent?, YouTube video, June 16, 2020. PPT file Did Turing Awards Go to Fraud?, YouTube video, June 2, 2020. PPT file Did Turing Awards Go to Plagiarism?, YouTube video, May 25, 2020. PPT file Emergent Turing Machines and Operating Systems for Brain-Like Auto-Programming for General Purposes, in Proc. AAAI Fall Symposium Series: Gathering for Artificial Intelligence and Natural Systems, Oct. 18 - 20, 2018. A Model for Auto-Programming for General Purposes Life is Science (26): NSF Should Grasp This Great Opportunity, Sept. 21, 2018 MSU's $500M Coverup, May 20, 2018 NSF Severely Lacks Due Process, April 20, 2018 Decades of Shortsightedness in the U.S. Department of Defense through DARPA, March 26, 2018 AIML Contest 2017 and BMI Summer School 2017, May 16, May 29 - Aug. 11, 2017 Life Is Science (13): Many Deep Convolutional Networks Have Academic Dishonesty? Life is Science (10): Li Fei-Fei, Plagiarism, and Myopia in AI Brain-Mind Talk 1: How Brains Work. Youtube site. Youku site. Open Letter to Apple CEO Tim Cook about the U.S. Government Demand. Open Letter to DARPA: Is Neural Engineering System Design (NESD) Program Short-Sighted and Fundamentally Flawed at the Current State of Human Knowledge? GENISAMA LLC was established Nov. 2015.  It is an artificial intelligence company inspired by brains. Artifical Intelligence Machine Learning (AIML) Contest and BMI Summer School 2016.  AIML Contest is a new kind of contest, aiming at full automation of machine learning inspired by brains. Tutorial: Introduction to Brains as Emergent Turing Machines, 9:00am - noon, August 13, 2015 with ICDL-EpiRob 2015, Brown University, Providence, RI, USA. Tutorial: Introduction to How Brains Deal with Big Data, 8:00am - 10:00am August 8, 2015 with INNS Conference on Big Data 2015, San Francisco, California, USA. BMI Summer School 2015, June 1 - August 7, and the International Conference on Brain-Mind 2015 jointly with IJCNN 2015. AMD Newsletter Vol. 11, No. 2, Fall 2014. BMI Summer School 2014, June 16 - July 4, and the International Conference on Brain-Mind 2014, July 12-13, Beijing, China. Brain-Mind-Magazine Vol. 3, No.1, 2014. AMD Newsletter Vol. 11, No. 1, Spring 2014. Brain-Mind-Magazine Vol. 2, No. 2, 2013. Brain-Mind Workshop 2013 AMD Newsletter Vol. 10, No. 2, Fall 2013. ICDL-EpiRob 2013 Tutorial: Introduction to Computational Brain-Mind, Osaka, Japan, August 18, 2013. Obama's BRAIN Initiative, Opportunities, and Resistence from the Status Quo, IJCNN 2013 Special Session on Mind, Brain, and Cognitive Algorithms, Dallas TX, August 7, 2013. Obama's BRAIN Initiative and Multidisciplineary Education, IJCNN 2013 Panel on Teaching Cognitive Science and Computational Intelligence, Dallas TX, August 6, 2013. Emotion in Brain-Inspired Developmental Networks, IJCNN 2013 Panel on Higher Emotionon, Dallas TX, August 5, 2013. IJCNN 2013 Tutorial: Natural and Artificial Intelligence: Introduction to Computational Brain-Mind, Dallas TX, August 4, 2013. BMI Summer School 2013, June 17 - Aug. 2, and the International Conference on Brain-Mind 2013, July 27-28, East Lansing, MI. Brain-Mind-Magazine Vol. 2, No. 1, 2013. AMD Newsletter Vol. 10, No. 1, Spring 2013. Brain-Mind Workshop 2012 New book: Natural and Artificial Intelligence: Introduction to Computational Brain-Mind, published by BMI Press, Nov. 2012. Brain-Mind-Magazine Vol. 1, No. 2, 2012. WCCI wide tutorial 2012: Computational Brain-Mind: From Biology, Neuroscience, Psychology, Computer Science, Electrical Engineering, and Mathematics. AMD Newsletter Vol. 9, No.2, Fall 2012. The Brain-Mind-Magazine is a new kind of magazine which publishes public oriented articles on inner working of single brains and ways multiple brains work together. Created June 2012. AMD Newsletter Vol. 9, No.1, April 2012. AMD Newsletter Vol. 8, No. 2, October 2011. Tutorial: Understanding the (5+1)-Chunk Brain-Mind Model Requires 6-Discipline Knowledge, presented at the Brain-Mind Workshop, Dec. 19-20, 2011. Brain-Mind Workshop 2011 Brain-Mind Institute is a new kind of institute, located at MSU with international participation. Its website was operational, Sept. 15, 2011. The slides of my talk that discussed political, research, the peer-review problems in US and China: \"Science Should Expend Its Horizon: Suggestions to the US and Chinese Governments\", NSF Workshop on US-China Collaborations, Arlington, Virginia, May 23-24, 2011. AMD Newsletter Vol. 8, No. 1, April 2011. IJCNN 2011 Panel: Brain-Mind Architectures: Module-Free, General Purpose and Immediate Learning IJCNN 2011 Special Session: Brain-Mind Architectures and Learning Mechanisms AMD Newsletter Vol. 7, No.2, Oct. 2011. Dialog initiation: \"Are Natural Languages Symbolic in the Brain?\" Decade of the Mind VI. Speakers IJCNN 2010 Panel: \"Between Bottom-up and Top-down What is `the Much in Between'?\" with email discussion. Special session: \"Mental Architecture and Representation\", IJCNN 2010 AMD Newsletter Vol. 7, No.1, April 2011. Developmental Stereo to appear in TAMD Tutorial: \"General-Purpose Vision Architecture, Invairance, Attention, and Reasoning\", CVPR 2010, Tutorial slides. AMD Newsletter Vol 6, No. 2, October 2009. AMD Principles: Have We Passed “Black Art”? The creation of the IEEE Transactions on Autonsomous Mental Development and its inaugural issue, May 2009 AMD Newsletter Vol 6, No. 1, April 2009. LCA to appear in TAMD IEEE 8th International Conference on Development and Learning (ICDL'08), Shanghai, China, June 4-7, 2009 AMD Newsletter Vol 5, No. 2, October 2008. \"“Killer” Applications for Developmental Robotics and Humans: Muddy Tasks\" AMD Newsletter Vol 5, No. 1, April 2008. \"How the Mind Works and How the Brain Develops\" INNS Symposia: New directions in Neural Networks (INNS-NNN) - Modeling the Brain and Nervous Systems , Auckland, NZ, November 24-25, 2008. The 7th International Conference on Development and Learning (ICDL'08), Montery, California, August 9-12, 2008 AMD Newsletter Vol 4, No. 2, October 2007. Reply to Dialog: “Should Robots Develop as Human Infants Do?” AMD Newsletter Vol 4, No. 1, April 2007. Glossary: Genomic equivalence The 6th International Conference on Development and Learning (ICDL'07), London, UK, July 11-13, 2007 AMD Newsletter Vol 3, No. 2, November 2006. What Does the Biological Brain Tell Us About Development? Special Issue on Autonomous Mental Development in the International Journal of Humanoid Robotics IEEE Computational Intelligence Magazine feature article, \"From Neural Networks to the Brain: Autonomous Mental Development,\" August 2006 Tutorial: Biologically Motivated Mental Architectures, WCCI 2006, Vancouver, BC Canada, July 16, 2006 The Special Session on Autonomous Mental Development of WCCI 2006, Vancouver, BC Canada, July 16-21, 2006 The 5th International Conference on Development and Learning (ICDL'06), Bloomington, IN, USA, May 31 - June 3, 2006 AMD Newsletter Vol 3, No. 1, April, 2006. Weng's term as the 1st AMD TC Chair ended. Brian Scaz ",
  "content_length": 13866,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:35"
}