{
  "name": "Jyh-haw Yeh",
  "homepage": "https://www.boisestate.edu/coen-cs/people/faculty/jyh-haw-yeh",
  "status": "success",
  "content": "Jyh-haw Yeh, Ph.D. - Computer Science Skip to main content Computer Science People Faculty Jyh-haw Yeh, Ph.D. Jyh-haw Yeh, Ph.D. Jyh-haw Yeh, Ph.D. Professor Visit Jyh-haw’s web site CCP 247 Call: (208) 426-5766 jhyeh@boisestate.edu Visit Jyh-haw’s web site About Jyh-haw Yeh Bio Publications Research Areas of Interest Bio Program Co-director of MS Cybersecurity Ph.D. from Computer and Information Science and Engineering at University of Florida. Publications My graduate student * My undergraduate student ^ High school student # Md Mashrur Arifin* and Jyh-haw Yeh (CA). “cTIMS: Correlated Textual and Image based Metrics Suites for Assessing GAN-Synthesized Android Malware Images,” 29th IEEE Pacific Rim International Symposium on Dependable Computing (PRDC 2024), November 2024. Md. Mashrur Arifin*, Troy Tolman^, and Jyh-haw Yeh (CA). “Unveiling the Efficacy of BERT’s Attention in Memory Obfuscated Malware Detection,” 19th International Conference on Information Security Practice and Experience (ISPEC 2024), October 2024. Md Mashrur Arifin*, M Shoaib Ahmed, TK Ghosh, J Zhuang, J-H Yeh. “A Survey on the Application of Generative Adversarial Networks in Cybersecurity: Prospective, Direction and Open Research Scopes,” arXiv e-prints, arXiv: 2407.08839, 2024. Yeh-Cheng Chen, Hung-Min Sun, Ruey Shun Chen, Jyh-haw Yeh, Xiaopeng Fan, I-Hsin Chou, “Intelligent Radioactive Waste Process Cloud-Base System for Nuclear Power Plant Decommissioning,” Journal of Ambient Intelligence & Humanized Computing (AIHC), Springer-Nature, 15: 1801-1811, 2024. Available online DOI: https://doi.org/10.1007/s12652-018-0913-1, June 2018. Jyh-haw Yeh (CA), Md Mashrur Arifin*, Ning Shen*, Ujwal Karki*, Yi Xie* and Archana Nanjundarao*. “Integrity Coded Databases – Protecting Data Integrity for Outsourced Databases,” Computers and Security (Elsevier), Vol. 136, 2024. Available Online October 2023, https://doi.org/10.1016/j.cose.2023.103569 Jyh-haw Yeh, Srisarguru Sridhar* and K. Dakota White^. “Developing Accessible Email Encryption Using a Certificateless One-Way Key Agreement Scheme,” 2023 4th Information Communication Technologies Conference, May 2023. Gang Ke, Ruey-Shun Chen, Shanshan Ji and Jyh-haw Yeh. “Network traffic prediction based on least squares support vector machine with simple estimation of Gaussian kernel width,” International Journal of Information and Computer Security, Vol. 18, No. 1-2, pp. 1-11, May 2022. https://doi.org/10.1504/IJICS.2022.122910 Ning Shen*, Jyh-haw Yeh, Hung-Min Sun, and Chien-Ming Chen. “A Practical and Secure Stateless Order Preserving Encryption for Outsourced Databases,” 26th IEEE Pacific Rim International Symposium on Dependable Computing (PRDC 2021), December 2021 Gang Ke, Ruey-Shun Chen, and Jyh-haw Yeh. “Network security situation prediction method based on support vector machine optimized by artificial bee colony algorithms,” Journal of Computers, Vol. 32, No. 1, pp. 144-153, 2021. DOI:10.3966/199115992021023201012. Thanh Hung Duong, Yunpeng Zhang, Jyh-haw Yeh, and Fengxiang Qiao. “A Multilayer Perceptrons Approach Focusing on the Class Imbalance for Injury Severity Analysis of Vehicle Crashes,” Submitted to IEEE Intelligent Transportation Systems Transactions, March 2021. Thanh Hung Duong, Fengxiang Qiao, Jyh-haw Yeh, and Yunpeng Zhang. “Prediction of Fatality Crashes with Multilayer Perceptrons on Crash Records Information System Dataset,” 20th IEEE International Conference on Cognitive Informatics & Cognitive Computing (IEEE ICCI*CC’20), September 2020. Xu-Shi Mei, Huan-Tong Chen, Hang-Yu Fan, Zhe-Ming Lu and Jyh-haw Yeh, “A Robust Digital Image Watermarking Scheme for Content Protection,” Journal of Network Intelligence, Vol. 5, No. 2, pp. 54-61, May 2020. Eric Ke Wang, Fan Wang, Saru Kumari, Jyh-Haw Yeh and Chien-Ming Chen, “Intelligent Monitor for Typhoon in IoT System of Smart City,” Journal of Supercomputing, Springer, 2020. DOI https://doi.org/10.1007/s11227-020-03381-0 Zhuoyu Tie, Eric Ke Wang, Jyh-Haw Yeh, and Chien-Ming Chen. “Forward Privacy Analysis of a Dynamic Searchable Encryption Scheme,” International Conference on Genetic and Evolutionary Computing (ICGEC 2019). In: Pan JS., Lin JW., Liang Y., Chu SC. (eds) Advances in Intelligent Systems and Computing, vol 1107, pp. 474-480, 2020. Springer, Singapore. Yuntao Duan, Jiangdai Li, Gautam Srivastava, and Jyh-haw Yeh, “Data Storage Security for Internet of Things,” Journal of Supercomputing, Springer, Vol. 76, No. 11, pp. 8529-8547, 2020. https://doi.org/10.1007/s11227-020-03148-7. Ning Shen*, Jyh-haw Yeh (corresponding author), Chien-Ming Chen, Ruey-Shun Chen and Yunpeng Zhang, “Ensuring Query Completeness in Outsourced Database using Order-Preserving Encryption,” The 17th IEEE Symposium on Parallel and Distributed Processing with Applications (ISPA 2019), December 2019. Ning Shen*, Holly Roisum^, Lois Urizar^, Jyh-Haw Yeh (corresponding author), Kedric Salisbury# and Megan Magette#, “Completeness Integrity Protection for Outsourced Databases Using Semantic Fake Data,” IEEE 2019 4th International Conference on Communication and Information Systems (ICCIS 2019), December 2019. Alark Joshi, Amit Jain, Jyh-haw Yeh, Ernie Covelli, Tim Andersen, “A Sustainable Model for High-School Teacher Preparation in Computer Science,” 2019 IEEE Frontiers in Education Conference (FIE2019), October 2019. Zhuoyu Tie, Eric Ke Wang, Jyh-haw Yeh, Tsu-Yang Wu and Chien-Ming Chen, “On the Security of a Dynamic Multi-Keyword Ranked Search Scheme,” 2019 International Conference on Intelligent Computing and Its Emerging Applications (ICEA2019), August 2019. Xiao-Cong Liang, Tsu-Yang Wu, Yu-Qi Lee, Chien-Ming Chen and Jyh-haw Yeh, “Cryptanalysis of a Pairing-Based Anonymous Key Agreement Scheme for Smart Grid,” In: Pan JS., Li J., Tsai PW., Jain L. (eds) Advances in Intelligent Information Hiding and Multimedia Signal Processing. Smart Innovation, Systems and Technologies (2020), Springer, vol 156, pp. 125-131. (The Best Paper Award in the 15th International Conference on Intelligent Information Hiding and Multimedia Signal Processing, Singapore, July 2019) Shanshan Ji, Ruey-Shun Chen, Gang Ke and Jyh-haw Yeh, “Network security situation prediction method based on ABC optimization SVM algorithm,” A workshop paper on Technologies for Next-Generation Network Environments Workshop, 2019 International Conference on Innovative Computing and Management Science, July 2019. Ruey-Shun Chen, Yeh-Cheng Chen, Jyh-haw Yeh, Yu-Xi Hu, Naixue Xiong, C-P Lee, “Using Intelligent Algorithms to Construct a Wafer Foundry System in Manufacturing Industry,” Proceedings of the 2019 3rd International Conference on Information System and Data Mining (ICISDM 2019), April 2019. Yang, D., Xu, D., Yeh, J., & Fan, Y, “Undergraduate Research Experience in Cybersecurity for Underrepresented Students and Students with Limited Research Opportunities,” Journal of STEM Education, Vol. 19, No. 5, pp. 42-53, January-March 2019. Jyh-haw Yeh, Srisarguru Sridhar*, Gaby Dagher, Hung-Min Sun, Ning Shen*, Kathleen White^, “A certificateless one-way group key agreement protocol for end-to-end email encryption,” The 23rd IEEE Pacific Rim International Symposium on Dependable Computing (PRDC 2018), December 2018. Yeh-Cheng Chen, Hung-Min Sun, Ruey-Shun Chen, Jyh-haw Yeh, Xiaopeng Fan, I-Hsin Chou, “Intelligent Radioactive Waste Process Cloud-Base System for Nuclear Power Plant Decommissioning,” Journal of Ambient Intelligence & Humanized Computing (AIHC), Springer-Verlag, June 2018. DOI: https://doi.org/10.1007/s12652-018-0913-1 Hung-Min Sun, Shouan-Tung Chen, Jyh-Haw Yeh, and Chia-Yun Cheng, “A Shoulder Surfing Resistant Graphical Authentication System,” IEEE Transactions on Dependable and Secure Computing, Vol. 15, No. 2, pp. 180-193, 2018. Carlos Luevanos^, John Elizarraras#, Khai Hirschi#, and Jyh-haw Yeh (corresponding author), “Analysis on the Security and Use of Password Managers,” 18th International Conference on Parallel and Distributed Computing, Applications and Technologies (PDCAT’17), Taipei, Taiwan, December 2017. Yeh-Cheng Chen, C.N. Chu, H.M Sun, Jyh-haw Yeh, Ruey-Shun Chen, “Development of an Intelligent Equipment Lock Management System with RFID Technology,” 18th International Conference on Parallel and Distributed Computing, Applications and Technologies (PDCAT’17), Taipei, Taiwan, December 2017. Jake Douglas^, Monica Robison^, Jyh-haw Yeh (corresponding author), “Query over encrypted database in clouds – the encryption strategy,” 21st International Computer Science & Engineering Conference (ICSEC 2017), Bangkok, Thailand, November 2017. Jyh-haw Yeh, “A secure homomorphic encryption algorithm over integers for data privacy protection in clouds,” International Conference on Smart Computing and Communication (SmartCom 2016), Springer LNCS 10135, pp. 111-121, Shenzhen, China, December 2016. Jyh-haw Yeh, “A probabilistic homomorphic encryption algorithm over integers – protecting data privacy in clouds,” The 12th IEEE International Conference on Advanced and Trusted Computing (ATC 2015), short paper, Beijing, China, August 2015. Jyh-haw Yeh, Fiona Zeng and Thoms Long, “P2P email encryption by an identity-based one-way group key agreement protocol,” The 20th IEEE International Conference on Parallel and Distributed Systems (ICPADS 2014), Hsinchu, Taiwan, December 2014. Jyh-haw Yeh, “The Insecurity of Two Proxy Signcryption Schemes – Proxy Credential Forgery Attack and How to Prevent it,” Journal of Supercomputing, Springer, Vol. 70, No. 3, pp. 1110-1119, 2014. Jyh-haw Yeh, “An Efficient Time-Bound Hierarchical Key Management Based on Tamper-Resistant Devices,” 2013 IEEE International Conference on Computer Science and Automation Engineering (CSAE 2013), Guangzhou, China, November, 2013. Jyh-haw Yeh, “Security Vulnerability in Identity-Based Public Key Cryptosystems from Pairings,” 2013 2nd International Conference on Information and Knowledge Management (ICIKM 2013), Chengdu, China, July, 2013",
  "content_length": 23804,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:32"
}