{
  "name": "Jyotirmoy V. Deshmukh",
  "homepage": "https://viterbi.usc.edu/directory/faculty/Deshmukh/Jyotirmoy",
  "status": "success",
  "content": "USC - Viterbi School of Engineering - Viterbi Faculty Directory Students Alumni Parents Corporate Giving Faculty About Academics Admission Research Innovation Viterbi Faculty Directory Jyo Deshmukh Associate Professor of Computer Science and of Electrical and Computer EngineeringEducation Doctoral Degree, Computer Engineering, University of Texas - Austin Biography Jyotirmoy V. Deshmukh joined the Department of Computer Science as a new faculty in August 2017. He transitioned to his role as an educator after five years of work as a Principal Research Engineer at Toyota Motors North America R&D. At Toyota, he helped bridge the gap between academic research and industrial practice through requirement engineering and testing methods. Before joining Toyota, he was the 2010 Computing Innovation Post-Doctoral Fellow at the University of Pennsylvania under the mentorship of Rajeev Alur. He got his Ph.D. in computer engineering from the University of Texas at Austin in 2010, where he was advised by E. Allen Emerson. His current research interests include the application of formal methods to reason about cyber-physical systems, verification and testing of embedded control systems, real-time temporal logics, and analysing time-series data. He is particularly interested in studying cyber-physical systems that use machine learning based components, such as autonomous driving vehicles. Appointments Thomas Lord Department of Computer ScienceMing Hsieh Department of Electrical and Computer Engineering Office SAL 340Henry Salvatori Computer Science Center941 Bloom Walk, Los Angeles, CA 90089USC Mail Code: 0781 Contact Informationjyotirmoy.deshmukh@usc.edu LinksPersonal WebsitePublications Return to Faculty Directory Information for: Students Alumni Giving Faculty University of Southern California | USC Viterbi School of Engineering | Privacy Notice | Smoke-Free Policy",
  "content_length": 1884,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:34"
}