{
  "name": "Jérôme Feret",
  "homepage": "http://www.di.ens.fr/~feret",
  "status": "success",
  "content": "J. Feret home contact venue research fields forthcoming events curriculum vitæ short CV long CV cv court cv long social networks Linkedin ResearchGate publications by topic Static analysis of mobile systems Static analysis of biological systems Static analysis of critical embedded software online bibliographies DBLP Google Scholar HAL - INRIA PubMed social networks Linkedin ResearchGate online talks teaching MPRI 2.6 master website course notes my materials MPRI 2.19 master website course notes former lectures projects ANR DCore SecurEval project (PEPR Sécurité des systèmes) former projects seminar General Seminoar of the DIENS hobbies web series theatre Jérôme FERET Senior researcher at Inria Adjunct professor at PSL University Head of the Antique Inria Project team Head of study of the Computer Science Department of École normale supérieure Member of the PhD Committee (CSD) at Inria Paris Happy Dad. Équipe Antique DI - École Normale Supérieure 45, rue d'Ulm 75 230 Paris Cedex 05 --- France E-mail: jerome.feret@info.ens.psl.eu Research fields I am interested in static analysis by the means of Abstract Interpretation: static analysis of mobile systems (PhD) static analysis of critical embedded systems (ASTREE analyzer) static analysis of biological networks (HDR, Kappa language) Studying at ENS Besides the CPGE track (for students following the Grande Ecole Preparation program), the ENS recruits the best students from French and foreign universities (with a Bachelor 2 (L2) or Bachelor 3 (L3) level). The Computer Science Department provides merit-based scolarships. More information on the admission to the CS department of ENS: The website for university students track (in French): https://diplome.di.ens.fr/admission-cne_fr.html. The website for the international selection: https://www.ens.psl.eu/en/academics/admissions/international-selection. The general website on the admission to the CS departement of ENS: https://diplome.di.ens.fr/admission_en.html. Would you have any question? You can also contact me by email. Upcoming events: 20th IFM - International Conference on integrated Formal Methods November 17-21, 2025, Paris, France (Program committee) 40th ACM SIGSIM PADS - Principles of Advanced Discrete Simulation June 24-26, 2026, Vienna, Austria (Program committee) Research projects: SECUREVAL project of the Systems Security PEPR. Current students: Current PhD students: Jérôme Boillot Rebecca Ghidini Patrícia Tenera Roxo ( cosupervision with Claudine Chaouiya) Alumni: Former PhD students Mehdi Bouaziz (PhD student, Software Engineer, Skiplabs) Matthieu Bouguéon (PhD student at IRSET and Irisa-Dyliss, defended in Dec 2023, Post-doc at UCL, London) Ferdinanda Camporesi (PhD student, defended Jan 2017, Post-Doc Inria 2018) Marc Chevalier (PhD student, defended Nov 2020, Software Engineer, Lakera) Aurélie Kong Win Chang (PhD student, cosupervision with Gregor Goessler, defended in May 2025) Albin Salazar (PhD student, defended Nov 2023, Post-Doc at MCSS Konstanz university) Former postdocs and research engineers Wassim Abou Jaoudé (Post-doc 2014, Scientific Director of Gencovery) Norman Ferns (Post-doc 2012-2014, teacher at Marianopolis college (Montreal, Canada)) Luca Grieco (Post-doc sept-dec 2012, Reaseach associate, University College London) Jonathan Hayman (Post-doc 2012, Technical lead at Redgate Software) Yves-Stan Le Cornec (Research engineer 2017-2020, Software Ingeneer, Tweag) Sébastien Légaré (Post doc 2020-2021, Systems Biologist, DeepLife); Kim Quyên Lý (Research engineer 2015-2017, Research Engineer, Marigold) Antoine Pouille (Research engineer 2023-2025) Alessandro Romanel (Post-doc 2011, Assistant professor, Trento university) Jérôme Feret, Last modified: 01 Oct 2025, 16:01:33 CEST",
  "content_length": 3765,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:41"
}