{
  "name": "Jörg-Rüdiger Sack",
  "homepage": "http://www.scs.carleton.ca/~sack",
  "status": "success",
  "content": "Prof. Jörg-Rüdiger Sack - Carleton University Current Roles President, CS-Can | Info-Can (since January 2025) Executive Editor & Co-Editor-in-Chief, Computational Geometry: Theory and Applications Biography Dr. Jörg-Rüdiger Sack was born in Duisburg, Germany. He holds a M.C.S. (\"Diplom\") from the University of Bonn and a Ph.D. from McGill University in Montréal. Research Interests Algorithms and Data Structures Computational Geometry Geographic Information Systems (GIS) Artificial Intelligence Academic and Editorial Roles Founding Editor-in-Chief: Computational Geometry: Theory and Applications, Journal of Spatial Information Science (JOSIS) Editor: Computer Animation and Virtual Worlds Executive Editor & Co-Editor-in-Chief (current): Computational Geometry: Theory and Applications Scopus Content Selection Advisory Board (Elsevier) – Subject Chair for Computer Science (Chair of the Board) Major Awards and Appointments NSERC Industrial Research Chair in Applied Parallel Computing (1996; renewed in 2001 with SUN Microsystems) SUN-HPCVL Chair for High-Performance Computing Carleton University Research Award (multiple times) Principal Investigator in NSERC- and SUN-supported project on intelligent systems for GIS Founding Member and Carleton’s leading scientist in the High Performance Computing Virtual Laboratory (HPCVL) National & International Leadership Chair, Scientific Advisory Board – Zuse Institute, Berlin (current) Panelist and Reviewer, DFG Excellence Initiative & Strategy (Germany) Member, Joint Commission, DFG Excellence Initiative & Strategy (Germany) College of Reviewers, Canada Research Chairs Programme Member, National Resources Allocation Committee – Compute Canada Chair, CS-NSERC Liaison Committee Founding Leader, CS-Can | Info-Can Member, C3.ca Board of Directors Advisor to Ambassador, German Embassy in Ottawa – fostering Canada-Germany scientific collaboration Liaison, Nelligan O'Brien Payne’s Consulting Group on Intellectual Property Committee and Workshop Participation NSERC: Committee on Research Partnerships, Committee on Grants and Scholarships, Group Chair for Mathematics, Statistics, Computing & Information Sciences Advisory and related roles DFG (German Research Council) Excellence Initiative G8 Research Councils Initiative on Multilateral Research Funding CFI Cyber-infrastructure Workshop Tri-Council+ Big Data & Digital Scholarship Consultation NCE – Theme and Project Leader in Geoide Contact Office: Herzberg Laboratories, Carleton University Email: sack@scs.carleton.ca Web: https://people.scs.carleton.ca/~sack/",
  "content_length": 2581,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:54"
}