{
  "name": "Jörg Ott",
  "homepage": "https://www.netlab.tkk.fi/~jo",
  "status": "success",
  "content": "Jörg Ott Homepage School of Electrical Engineering Department of Communications and Networking Research Group for Protocols, Services, and Software Current Notes Research Group Research Interests Theses Projects Student Projects Teaching Publications Contact Jörg Ott Jörg Ott is Professor for Networking Technology with a focus on Protocols, Services, and Software in the Department of Communications and Networking in the School of Electrical Engineering at Aalto University. From 1997 through early 2005, he was Assistant Professor in the Computer Networks group at the Universität Bremen and member of the Center for Computing Technologies (TZI). From 1992 through 1997 he worked as a research staff member with teaching responsibilities at TU Berlin. He received his Doctor in Engineering (Dr.-Ing.) in 1997 from Technische Universität Berlin. His research interests are in network architectures, protocol design, and networked systems, from modeling to implementation. His current research focus areas include communication in challenged networks, particularly delay-tolerant/mobile opportunistic networking; adaptive real-time communication, information-centric networking, and network measurements. He is co-chair of the DTN Research Group in the IRTF. In the IETF, was co-chair of the MMUSIC working group from 1997 through 2009 and co-chaired the SIP working group from its foundation in 1999 to October 2002. Jörg co-founded Tellique Kommunikationstechnik GmbH (1998), which provided solutions for IP multicast-based content distribution and performance enhancements for satellite and other challenged networks; Lysatiq GmbH (2007), which provided solutions for disconnection tolerance and performance optimizations for challenged networks and mobile Internet access; Spacetime Networks Oy (2013), which provides software solutions for enabling networking (not just) in challenging industrial environments; and NeMu (\"Networked Multimedia\") Dialogue Systems Oy (also: callstats.io), which provides QoS and QoE monitoring and analysis for (interactive) (WebRTC-based) multimedia services. Current Notes My new home page at TUM is here. Switching jobs: I will leave my Full Professor position at Aalto University effective 1 August 2015 to take up the BMW-endowed Chair on Connected Mobility at Technische Universität München. I will remain affiliated with Aalto University as an Adjunct Professor. Next days in the office: 27, 28, 29 July, 28 August 2015. PhD Defense: Varun Singh defended his PhD thesis on 2 June 2015, with Prof. Michael Welzl (University of Oslo) as opponent. Workshop on Do-It-Yourself Networking: an Interdisciplinary Approach: at ACM MobiSys 2015. Our liberouter web site is now ready. Master Theses: Note that I do no longer offer new MSc thesis and special assignment topics. My previous home (1997-2005) was at University of Bremen TZI. Research Interests Delay-/Disruption-tolerant Networking. Diverging from today's usual approaches towards supporting mobile users by providing ubiquitous and seamless connectivity across several networks, the goal of this research area is to accept the non-permanent nature of connectivity experienced and achievable today. My primary interest is to investigate architectures, protocols, and applications to maximize the gain a user a draw even from rare and short-lived connectivity as one aspect and to minimize the impact of connectivity interruption when commuting or traveling. One early example is the introduction of Drive-thru Internet — an application scenario where we provide WLAN-based short range connectivity islands to users traveling at potentially high speeds on the road. Mobile opportunistic networking and computing. Leveraging the capabilities of mobile devices for autonomous communication systems that may benefit from infrastructure (or cloud) assistance but do not rely on them. My interests range from (DTN-style) ad-hoc messaging (see above) to content sharing and programming paradigms to application ecosystems for such autonomous networks. One main theme is probabilistic content sharing using Floating Content and geo-based sharing applications on top. In this context, we have designed the ONE simulator and are investigating mobility models for humans especially in urban areas. Network architecture. I am interested in alternative approaches to network architectures. We are investigating elements of delay-tolerant networking as one building block. We are also looking information-centric networking as clean slate designs but also as incrementally deployable solutions based upon CDNs and HTTP. Specific interests include the equivalent of transport protocols and adaptive media streaming in such architectures. Robust & Adaptive Multimedia Communication. Design and implementation of control and transport protocols for (multiparty) (multimedia) communication, both streaming and multimedia conferencing (including IP telephony). This includes system architectures for multimedia communication systems (endpoints and infrastructure components); real-time transport protocols (RTP/RTCP, HTTP streaming); and scalable content delivery mechanisms. Internet measurements. Understanding the content characteristics and user behavior as input to network and protocol design and evaluation, and network characteristics for assessing system and protocol performance. We are investigating the characteristics of web pages, the operation of adaptive media streaming, the performance of different (wired and wireless) access technologies, and communication opportunities via WLAN hot-spots. I spend quite some time in Internet-related standardization, as a contributor but also as one way of keeping track of real-world problems and industry directions. I have been participating in the IETF since 1993 focusing on the areas outlined above, particularly control and transport protocols for multimedia conferencing. I was co-chair of the MMUSIC WG from 1997 through 2009 and of the SIP WG from 1999 through 2002. I am now co-chairing the Delay-tolerant Networking Research Group (DTNRG). I am presently particularly interested in real-time transport (AVT WG, RMCAT WG, and related ones), web-based multimedia conferencing (RTCweb WG), information-centric networking (ICNRG), and recently in performance metrics for the Internet. In a former life, from 1994 through 2000, I have been active in the Telecommunication Sector of the International Telecommunication Union (ITU-T, formerly known as CCITT). Particular interests included the infrastructure for data conferencing (T.120) which was developed by Study Groups 8 and later 16 and the design of the H.323 series of Recommendations for IP-based multimedia conferencing (in local area networks) and IP telephony which I accompanied from the the very beginning in early 1995, first in SG15 and later in SG16. Research Projects RIFE Feb 2015 – Jan 2018 RIFE: architectuRe for an Internet For Everybody. A project funded by the EC Horizon 2020 program to provide affordable and sustainable access to the Internet by realizing an architecture for an Internet for everybody that enables access to information and services at economically sustainable price points unmatched by today's technologies while also catering to challenges, such as intermittent connectivity, posed by the varying environmental challenges that are imposed on those who want to connect. RIFE will devise a unifying network architecture, incorporating elements of delay-tolerant and information-centric networking, develop dissemination strategies to enable Internet access in diverse settings, and implement application-specific functions as necessary to support today's and future services. SSICLOPS Feb 2015 – Jan 2018 SSICLOPS: Scalable and Secure Architecture for Cloud Operations. A project funded under the EC Horizon 2020 program to create and operate high-performance private cloud infrastructure that allows flexible scaling through federation with other private clouds without compromising their service level and security requirements. SSICLOPS federation will support the efficient integration of clouds, no matter if they are geographically co-located or distributed, belong to the same or different administrative entities or jurisdictions. We will devise efficient and secure transport protocols for both intra- and inter-cloud/data center communication and develop mechanisms for flexible job scheduling and migration supported by cloud performance monitoring and tuning functions. We will explore four use cases from in-memory data bases high-performance computing (high-energy physics) to cloud bursting to network function virtualization. CloSe Jul 2014 – June 2016 CloSe: Cloud Security Services. A joint academic and industry project funded by the Academy of Finland and Tekes on provide secure access to cloud-based services and information as well as secure storage and service provisioning inside the cloud. Our focus is on privacy-preserving data access, secure data storage and deduplication, and scalable network infrastructure support. METRICS Sep 2013 – Aug 2017 METRICS: Measurement for Europe: Training and Research for Internet Communications Science. An EC FP7 Marie Curie Initial Training Networking for 13 PhD students and one post-doctoral researcher on network measurements in the fixed and mobile Internet and within data centers. Research is complemented by summer schools on scientific writing and presentations, tools and methodology, and entrepreneurship. Aalto Comnet work will focus on 1) (mobile) network measurements and QoE prediction and 2) data analysis, trace-based modeling, and simulations of human behavior. PRECIOUS Nov 2013 – Oct 2016 PRECIOUS: Preventive Care Infrastructure based on Ubiquitous Sensing: A cross-disciplinany project on behavioral monitoring through sensors and networked services and offering feedback to users on how healthy their lifestyle is. The speicfic target is food intake monitoring and fostering beh",
  "content_length": 26392,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:54"
}