{
  "name": "Jörg Henkel",
  "homepage": "http://ces.itec.kit.edu/21_henkel.php",
  "status": "success",
  "content": "KIT - CES People Chair for Embedded Systems StartpagePeople StartseiteEvents/NewsPublicationsPeopleResearchTeachingMaster/Bachelor ThesesCES free SoftwareJob OpeningsContactInternalsPeople Prof. Dr.-Ing. Jörg Henkel Head of Instituteroom: B2-318.1phone: +49 721-608-46050fax: +49 721 608-43962henkel ∂does-not-exist.kit edu Haid-und-Neu-Str. 7 Bldg. 07.21 76131 Karlsruhe http://ces.itec.kit.edu/~henkel http://spp1500.itec.kit.edu Short Bio/CV Awards PhDs Keynotes Patents Books Resources Short Bio Prof. Jörg Henkel is with Karlsruhe Institute of Technology (KIT), Germany, where he is directing the Chair for Embedded Systems CES. Before, he was a Senior Research Staff Member at NEC Laboratories in Princeton, NJ. He received his PhD from Braunschweig University with \"Summa cum Laude\". Prof. Henkel has/is organizing various embedded systems and low power ACM/IEEE conferences/symposia as General Chair and Program Chair and was a Guest Editor on these topics in various Journals like the IEEE Computer Magazine. He was Program Chair of CODES'01, RSP'02, ISLPED’06, SIPS'08, CASES'09, Estimedia'11, VLSI Design'12, ICCAD’12, PATMOS’13, NOCS’14 and served as General Chair for CODES'02, ISLPED’09, Estimedia’12, ICCAD’13 and ESWeek'16. He is/has been a steering committee member of major conferences in the embedded systems field like at ICCAD, ESWeek, ISLPED, Codes+ISSS, CASES and is/has been an editorial board member of various journals like the IEEE TVLSI, IEEE TCAD, IEEE TMSCS, ACM TCPS, JOLPE etc. In recent years, Prof. Henkel has given more than ten keynotes at various international conferences primarily with focus on embedded systems dependability. He has given full/half-day tutorials at leading conferences like DAC, ICCAD, DATE etc. Prof. Henkel received the 2008 DATE Best Paper Award, the 2009 IEEE/ACM William J. Mc Calla ICCAD Best Paper Award, the Codes+ISSS 2015, 2014, and 2011 Best Paper Awards, and the MaXentric Technologies AHS 2011 Best Paper Award as well as the DATE 2013 Best IP Award and the DAC 2014 Designer Track Best Poster Award. He is the Chairman of the IEEE Computer Society, Germany Section, and was the Editor-in-Chief of the ACM Transactions on Embedded Computing Systems (ACM TECS) for two consecutive terms. He is an initiator and the coordinator of the German Research Foundation's (DFG) program on 'Dependable Embedded Systems' (SPP 1500). He is the site coordinator (Karlsruhe site) of the Three-University Collaborative Research Center on \"Invasive Computing\" (DFG TR89). He is the Editor-in-Chief of the IEEE Design&Test Magazine. He holds ten US patents and is a Fellow of the IEEE. Curriculum Vitae including publication list (pdf, word) Awards Research Awards Embedded Systems Week, IEEE International Conference on Hardware-Software Co-design and System Synthesis (CODES+ISSS'15) Best Paper Award for \"R2Cache: Reliability-Aware Reconfigurable Last-Level Cache Architecture for Multi-Cores\", 2015. Embedded Systems Week, IEEE International Conference on Hardware-Software Co-design and System Synthesis (CODES+ISSS'14) Best Paper Award for \"TSP: Thermal Safe Power - Efficient power budgeting for Many-Core Systems in Dark Silicon\", 2014. DAC 2014 Designer Track Best Poster Award for poster \"Application-Specific Hierarchical Power Management for Multicast High Efficiency Video Coding\", 2014. Embedded Systems Week, IEEE International Conference on Hardware-Software Co-design and System Synthesis (CODES+ISSS'11) Best Paper Award for \"Reliable Software for Unreliable Hardware: Embedded Code Generation aiming at Reliability\", 2011. MaXentric Technologies AHS Best Paper Award for \"Concepts, Architectures, and Run-time Systems for Efficient and Adaptive Reconfigurable Processors\", 2011. William J. McCalla Best Paper Award ICCAD 2009 (IEEE/ACM Int'l Conference on Computer Aided Design) for \"TAPE: Thermal-Aware Agent-Based Power Economy for Multi/Many-Core Architectures\", 2009. Best Paper Award DATE 2008 Conference for \"Run-time System for an Extensible Embedded Processor with Dynamic Instruction Set\" (announced in April 2009). Various HiPEAC (European Network of Excellence on High Performance and Embedded Architecture and Compilation) Paper Awards between 2008-2015. Research Nominations \"Towards Aging-Induced Approximations\" in: ACM/EDAC/IEEE 54rd Design Automation Conference (DAC'17), Best Paper Nomination. \"Improving Mobile Gaming Performance through Cooperative CPU-GPU Thermal Management\" in: ACM/EDAC/IEEE 53rd Design Automation Conference (DAC'16), Best Paper Nomination. \"COREFAB: Concurrent Reconfigurable Fabric Utilization in Heterogeneous Multi-Core Systems\" in: International Conference on Compilers, Architecture and Synthesis for Embedded Systems (CASES'14), Best Paper Nomination. \"Reducing Inter-Core Cache Contention with an Adaptive Bank Mapping Policy in DRAM Cache\" in IEEE International Conference on Hardware/Software Codesign and System Synthesis (CODES+ISSS'13), Best Paper Nomination. \"Selective Instruction Set Muting for Energy-Aware Adaptive Processors\" in IEEE/ACM International Conference on Computer-Aided Design (ICCAD´10), Best Paper Nomination. Student Awards (Received by Master and PhD Students under my supervision) ACM SIGBED Paul Caspi Memorial Dissertation Award for the Ph.D. Thesis by Dr.Santiago Pagani entitled \"Power, Energy, and Thermal Management for Clustered Manycores\", 2017 (read more). European Design and Automation Association (EDAA) Outstanding Dissertations Award for the Ph.D. Thesis by Dr. Lars Bauer entitled \"RISPP: A Run-time Adaptive Reconfigurable Embedded Processor\", 2011 (read more). Hermann Billing Price for the Master Thesis of Florian Kriebel entitled \"Analysis and Design of Hybrid Hardware/Software Reliability Techniques for Embedded Processors\", 2011. FZI (Research Center Computer Science) Best Dissertation Award for the Ph.D. Thesis by Dr. Lars Bauer entitled \"RISPP: A Run-time Adaptive Reconfigurable Embedded Processor\", 2011 (read more). FZI (Research Center Computer Science) Best Master Thesis Award for the Master Thesis by Bastian Molkenthin entitled \"Development of a Power-Aware Rate Controller for H.264 Video Encoder\", 2008. Personal Awards ACM Fellow (2023) ACM Distinguished Service Award from SIGDA (Special Interest Group on Design Automation), June 2018 IEEE Fellow (effective Jan. 1 2015) for contributions to hardware/software codesign of embedded computing systems IEEE Outstanding Service Award from CEDA (Council on Electronic Design Automation) for service to the EDA community as ICCAD'13 General Chair, 2015 \"Summa cum Laude\" for PhD Thesis, 1996 PhDs Mohammed Bakr Sikal, \"Cache Contention-Aware System-Level Resource Optimization on Clustered Multicores using Machine Learning\", PhD Thesis, (250725), KIT, Karlsruhe, 2025, PDF Kilian Pfeiffer, \"Federated Machine Learning with Resource-Constrained Devices\", PhD Thesis, (280425), KIT, Karlsruhe, 2025, PDF Jeferson González Gómez, \"Efficient Cross-layer Security against Advanced Threats in Emerging Computing Systems\", PhD Thesis, (191224), KIT, Karlsruhe, 2024, PDF Hassan Nassar, \"Towards Secure Computation on Accelerated Cloud Systems\", PhD Thesis, (021224), KIT, Karlsruhe, 2024, PDF Martin Rapp, \"Machine Learning for Resource-Constrained Computing Systems\", PhD Thesis, (310522/00), KIT, Karlsruhe, 2022, PDF Tanfer Alan, \"Cross-Layer Automated Hardware Design for Accuracy-Configurable Approximate Computing\", PhD Thesis, (220721/01),  KIT, Karlsruhe, 2021, PDF. Jorge Castro-Godinez, \"Automated Design of Approximate Accelerators\", PhD Thesis, (201119), KIT, Karlsruhe, 2020, PDF. Marvin Damschen, \"Worst-Case Execution Time Guarantees for Runtime-Reconfigurable Architectures\", PhD Thesis, (181219), KIT, Karlsruhe, 2018, PDF. Heba Khdr, \"Resource Management for Multicores to Optimize Performance under Temperature and Aging Constraints\", PhD Thesis, (180704/01), KIT, Karlsruhe, 2018, PDF. Anuj Pathania, \"Scalable Task Schedulers for Many-Core Architectures\", PhD, Thesis, (180516/01), KIT, Karlsruhe, 2018, PDF. Farzad Samie, \"Resource Management for Edge Computing in Internet of Things (IoT)\", PhD Thesis, (180126/01), KIT, Karlsruhe, 2018, PDF. Hongyan Zhang, \"Cross-Layer Dependability for Runtime Reconfigurable Architectures\", PhD Thesis, (170511/01), KIT, Karlsruhe, 2017, PDF. Santiago Pagani, \"Power, Energy, and Thermal Management for Clustered Manycores\", PhD Thesis, (161124/00), KIT, Karlsruhe, 2016, PDF. Artjom Grudnitsky, \"A Reconfigurable Processor for Heterogeneous Multi-Core Architectures\", PhD Thesis, (151221/01), KIT, Karlsruhe, 2015, PDF. Muhammad Usman Karim Khan, \"Towards Computational Efficiency of Next Generation Multimedia Systems\", PhD Thesis, (151221/01), KIT, Karlsruhe, 2015, PDF. Semeen Rehman, \"Reliable Software for Unreliable Hardware – A Cross-Layer Approach\", PhD Thesis, (150715/01), KIT, Karlsruhe, 2015, PDF. Hussam Amrouch, “Techniques for Aging, Soft Errors and Temperature to Increase the Reliability of Embedded On-Chip Systems”, PhD Thesis, (150603/00), KIT, Karlsruhe, 2015, PDF. Sebastian Kobbe, “Scalable and Distributed Resource Management for Many-Core Systems”, PhD Thesis, (150511/10), KIT, Karlsruhe, 2015, PDF. Fazal Hameed, “DRAM aware Last-Level-Cache policies for Multi-core Systems”, PhD Thesis, (150206/01), KIT, Karlsruhe, 2015, PDF. Thomas Ebi, “Thermal Management for Dependable On-Chip Systems”, PhD Thesis, (140708/01), KIT, Karlsruhe, 2014, PDF. Janmartin Jahn, “Resource Allocation for Software Pipelines in Many-core Systems”, PhD Thesis, (140213/01), KIT, Karlsruhe, 2014, PDF. Muhammad Shafique, “Architectures for adaptive low-power embedded multimedia systems”, PhD Thesis, (110131/01), KIT, Karlsruhe, 2011, PDF. Dominic Hillenbrand, “A Flexible Design Space Exploration Platform for Wireless Sensor Networks”, PhD Thesis, (100119/10), KIT, Karlsruhe, 2010, PDF. Lars Bauer, “RISPP: A Run-time Adaptive Reconfigurable Embedded Processor”, PhD Thesis, (091215/00), KIT, Karlsruhe, ",
  "content_length": 14637,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:46"
}