{
  "name": "Jörg P. Müller",
  "homepage": "https://meclab.in.tu-clausthal.de/members/member.php?member=joerg.mueller",
  "status": "success",
  "content": "Mobility and Enterprise Computing Zum Inhalt springen Research Research Get to know our current and completed research projects and the awards our group has won throughout the years Publications Publications The publications of our group About us About us Get to know us and how to get in contact with us The main focus of our research is on decentralized information technologies, in particular, multi-agent  systems, methods, architecture, models, tools for decentralized and adaptive management, engineering, and coordination in information systems. We are interested in the development, validation, and application of decentralized, self-organizing techniques in various networked domains, such as Smart Transport and Traffic and Human-AI Collaboration.The systems we are investigating are composed of autonomous agents that are required to cooperate or coordinate their activities, because they co-exist in a shared environment, depend on shared resources, or pursue common goals.Core technology competences at MEC are multiagent systems and intelligent agents, P2P computing, protocols, architectures, and middleware for decentralized information management and coordination mostly focusing on sustainable mobility and distributed AI applications. For more details including current and past projects, we refer to our research page and our publications.Our teaching activities cover introductory and advanced courses on (distributed) business information systems and technologies, and on multiagent systems. Please consult our teaching page for details - and do not hesitate to contact us if you are interested in joining us as a research student or in writing a thesis in our research area! 23.11.2023 Congratulations: Zukunftslabor Mobilität Researchers Published in IEEE Journal We congratulate Julian Teusch, Fatema T. Johora, and Jörg P. Müller, along with their co-authors from Zukunftslabor Mobilität, on the acceptance of their paper, \"A Systematic Literature Review on Machine Learning in Shared Mobility,\" in the IEEE Open Journal of Intelligent Transportation Systems. 08.11.2023 EWGT 2023 Best Paper Award Winners Congratulations to Sören Schleibaum, Julian Teusch, Jörg P. Müller, and Rüdiger Ehlers for their remarkable achievement! They have been honored with the Best Paper Award at the 25th Annual Meeting of the Euro Working Group Transportation (EWGT 2023). This prestigious recognition underscores their outstanding contributions to the field of transportation research. 30.06.2022 Dr. Fatema T. Johora publishes her monograph in Springer-Verlag! We congratulate our team member Dr. Fatema T. Johora on the publication of her monograph ‘Modeling Interactions among Pedestrians and Cars in Shared Spaces’ in Springer-Verlag. 01.11.2021 MEC Team member Dr. Jelena Fiosina acquired a three-year project funding from DFG! MEC Team member Dr. Jelena Fiosina successfully acquired a three-year project funding from DFG on Machine Learning for Explainable Roundtrip Polymer Reaction Engineering. 30.09.2021 Fatema Tuj Johora obtains her Ph.D.! We congratulate Fatema Tuj Johora for obtaining her Ph.D. with the Dissertation Modeling Interactions among Pedestrians and Cars in Shared Spaces. 15.09.2021 Sinziana-Maria Sebe obtains her Ph.D.! We congratulate Sinziana-Maria Sebe for obtaining her Ph.D. with the Dissertation Distributed, Decentralised and Compensational Mechanisms for Platoon Formation. Hinweis zu Cookies Unsere Webseite verwendet Cookies. Diese haben zwei Funktionen: Zum einen sind sie erforderlich für die grundlegende Funktionalität unserer Website. Zum anderen können wir mit Hilfe der Cookies unsere Inhalte für Sie immer weiter verbessern. Hierzu werden u. a. pseudonymisierte Daten von Website-Besuchern gesammelt und ausgewertet. Mit dem Klick auf Einstellungen können Sie zudem die einzelnen Cookies auswählen, welche Sie akzeptieren wollen. Das Einverständnis in die Verwendung der Cookies können Sie jederzeit, auch teilweise, widerrufen. Weitere Informationen zu Cookies auf dieser Website finden Sie in unserer Datenschutzerklärung und zu uns im Impressum. Einstellungen Erforderlich Zustimmen Diese Cookies werden für eine reibungslose Funktion unserer Website benötigt. Name Zweck Ablauf Typ Anbieter CookieConsent Speichert Ihre Einwilligung zur Verwendung von Cookies. 1 Jahr HTML Website Schrift-Skalierung Zustimmen Name Zweck Ablauf Typ Anbieter FontScaler Aktiviert einige Schaltflächen am oberen Rand der Seite, um die Schriftgröße der Website zu skalieren 1 Monate HTML TU Clausthal Readspeaker Zustimmen Name Zweck Ablauf Typ Anbieter ReadSpeaker Aktiviert die Funktion \"Readspeaker\", die Teile einer Seite oder die ganze Seite vorliest, ohne dass eine zusätzliche Software installiert werden muss 1 Monate HTML TU Clausthal Druck-Schaltfläche Zustimmen Name Zweck Ablauf Typ Anbieter PrintButton Aktiviert eine Schaltfläche zum Ausdrucken der aktuellen Seite per Klick 1 Monate HTML TU Clausthal Marketing Zustimmen Name Zweck Ablauf Typ Anbieter _pk_id Wird verwendet, um ein paar Details über den Benutzer wie die eindeutige Besucher-ID zu speichern. 13 Monate HTML Matomo _pk_ref Wird benutzt, um die Informationen der Herkunftswebsite des Benutzers zu speichern. 6 Monate HTML Matomo _pk_ses Kurzzeitiges Cookie, um vorübergehende Daten des Besuchs zu speichern. 30 Minuten HTML Matomo _pk_cvar Kurzzeitiges Cookie, um vorübergehende Daten des Besuchs zu speichern. 30 Minuten HTML Matomo _pk_hsr Kurzzeitiges Cookie, um vorübergehende Daten des Besuchs zu speichern. 30 Minuten HTML Matomo Alle Cookies ablehnen Speichern Alle Cookies akzeptieren",
  "content_length": 5613,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:51"
}