{
  "name": "Jörn Diedrichsen",
  "homepage": "http://www.diedrichsenlab.org",
  "status": "success",
  "content": "Diedrichsenlab Diedrichsenlab The Lab People Publications Research Tools Blog Lab Wiki In the Diedrichsen lab, we study the human motor system and the human cerebellum. How does the brain produce coordinated movements? How are new movement skills learned? What is the function of the human cerebellum and how does it contribute to motor control and cognition? Experimentally, we focus on behavioral and functional magnetic resonance imaging studies in humans. We are part of Western's Sensorymotor superlab (a collaboration with the Pruszynski, and Gribble labs) and also employ electrophysiological and neurostimulation approaches to investigate the brain. An important part of the lab is the development of novel statistical and machine learning methods for the analysis of brain imaging and electrophysiological data. We develop tools for cerebellar imaging data and for multivariate analysis. We are part of the Computational Brain Science Group. Activities and links The Raynor Cerebellar Growth Chart Project is starting with kick-off meeting on April 22nd Educational Workshop on cerebellar Imaging (OHBM 2020) Sensorimotor Superlab Reading Lists PhD / MSc positions We are now accepting applications for MSc / PhD students for Fall 2026. Applications to the Diedrichsenlab must be submitted electronically as a single PDF file entited LastName_FirstName.pdf directly to diedrichsenlab@gmail.com. The pdf must include: a CV (including publications and conference presentations) a statement of research interest outlining current experience and plans for future research, not exceeding 2 pages. Please see recent publications, ongoing research projects, and tool developement for ongoing research in the lab names and contact information for three academic referees. Please state clearly your targeted graduate program. We especially encourage students interested in the Collaborative Specialization in Machine Learning for Health and Biomedical Sciences to apply. The review of applications will begin December 10th and continue until positions are filled. Note that the successful candidates will have to apply separately to the Neuroscience, Computer Science, or Statistics graduate programs. Please check the targeted program for application deadlines, especially for international students. Funding Work in the laboratory is supported by CIHR, NSERC, BrainsCAN, Western University, and the Raynor Cerebellar Project. News: Follow us on Social Media: Bluesky: @diedrichsenjorn.bsky.social Linkedin: Twitter/X: Follow @diedrichsenlab",
  "content_length": 2542,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:55"
}