{
  "name": "Jörg Hähner",
  "homepage": "https://www.uni-augsburg.de/de/fakultaet/fai/informatik/prof/oc/team/haehner",
  "status": "success",
  "content": "Prof. Dr. Jörg Hähner Lehrstuhl für Organic Computing Universität Fakultäten Fakultät für Angewandte Informatik Institut für Informatik Lehrstühle und Professuren der Informatik Organic Computing Team Prof. Dr. Jörg Hähner Prof. Dr. Jörg Hähner Lehrstuhlinhaber Lehrstuhl für Organic Computing Telefon: +49 821 598 69250 E-Mail: joerg.haehner@uni-auni-a.de () Raum: 2048 (F) Sprechzeiten: nach Vereinbarung Kontakt (.vcf) Lebenslauf seit 01/2012 Inhaber des Lehrstuhls Organic Computing, Universität Augsburg 2006-2011 Juniorprofessor für Organic Computing, Leibniz-Universität Hannover 2001-2006 Wissenschaftlicher Mitarbeiter, Institut für Parallele und Verteilte Systeme, Universität Stuttgart 1996-2001 Informatikstudium an der TU Darmstadt Forschungsschwerpunkte Lehrveranstaltungen Kurs Heimateinrichtung Dozent Semester Typ Sprache Publikationen 2025 | 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2006 | 2005 | 2004 | 2003 | 2002 2025 Neele Kemper, Michael Heider, Dirk Pietruschka and Jörg Hähner. 2025. A comparative study of multi-objective and neuroevolutionary-based reinforcement learning algorithms for optimizing electric vehicle charging and load management. Applied Energy 391, 125890. DOI: 10.1016/j.apenergy.2025.125890PDF | BibTeX | RIS | DOI Helena Stegherr, Michael Heider, Jonathan Wurth and Jörg Hähner. 2025. A comparison of dimensionality reduction techniques for visualising search behaviour. In Gabriela Ochoa, Bogdan Filipič (Eds.). GECCO '25 Companion: proceedings of the Genetic and Evolutionary Computation Conference Companion, 14-18 July 2025, Malaga, Spain. Association for Computing Machinery (ACM), New York, NY, 171-174 DOI: 10.1145/3712255.3726648BibTeX | RIS | DOI Helena Stegherr, Michael Heider and Jörg Hähner. 2025. A comparison of clustering approaches for metaheuristic behaviour data. In Thomas Bäck, Niki van Stein, Christian Wagner, Jonathan M. Garibaldi, Francesco Marcelloni, H. K. Lam, Marie Cottrell, Faiyaz Doctor, Joaquim Filipe, Kevin Warwick, Janusz Kacprzyk (Eds.). Computational Intelligence: 14th and 15th International Joint Conference on Computational Intelligence (IJCCI 2022 and IJCCI 2023) revised selected papers. Springer, Cham, 305-322 DOI: 10.1007/978-3-031-85252-7_17BibTeX | RIS | DOI Lukas Meitz, Julia Senge, Tim Wagenhals, Thorsten Schöler, Jörg Hähner, Janick Edinger and Christian Krupitzer. 2025. A literature review framework and open research challenges for predictive maintenance in industry 4.0. Computers & Industrial Engineering 206, 111193. DOI: 10.1016/j.cie.2025.111193PDF | BibTeX | RIS | DOI Henning Cui, Andreas Margraf and Jörg Hähner. 2025. Analysing the influence of reorder strategies for Cartesian Genetic Programming. SN Computer Science 6, 754. DOI: 10.1007/s42979-025-04296-4PDF | BibTeX | RIS | DOI Julian Trautwein, Michael Heider, Henning Cui and Jörg Hähner. 2025. Ant-based metaheuristics struggle to solve the Cartesian Genetic Programming learning task. In Bing Xue, Luca Manzoni, Illya Bakurov (Eds.). Genetic Programming: 28th European Conference, EuroGP 2025, held as part of EvoStar 2025, Trieste, Italy, April 23–25, 2025, proceedings. Springer, Cham, 139-155 DOI: 10.1007/978-3-031-89991-1_9PDF | BibTeX | RIS | DOI Henning Cui and Jörg Hähner. 2025. CRust_GP: a framework for the modular construction and evaluation of Cartesian Genetic Programming in Rust. In Gabriela Ochoa, Bogdan Filipič (Eds.). GECCO '25 Companion: Proceedings of the Genetic and Evolutionary Computation Conference Companion, Malaga, Spain, July 14-18, 2025. Association for Computing Machinery (ACM), New York, NY, 119-122 DOI: 10.1145/3712255.3726534PDF | BibTeX | RIS | DOI Neele Kemper, Michael Heider, Dirk Pietruschka and Jörg Hähner. 2025. Forecasting of residential unit's heat demands: a comparison of machine learning techniques in a real-world case study. Energy Systems 16, 281-315. DOI: 10.1007/s12667-023-00579-yPDF | BibTeX | RIS | DOI Mrunmai Phatak, Julian Lorenz, Nico Hörmann, Jörg Hähner and Rainer Lienhart. in press. HOIverse: a synthetic scene graph dataset with human object interactions. In 2025 IEEE International Conference on Multimedia Information Processing and Retrieval (MIPR). IEEE, Piscataway, NJBibTeX | RIS | URL Victor Gerling, Henning Cui, Jörg Hähner and Michael Seufert. 2025. Resource allocation is all you need: the routing and scheduling problem in 6TiSCH networks. In Maria Luisa Merani, Hikmet Sari (Eds.). 2025 IEEE Wireless Communications and Networking Conference (WCNC), March 24–27, 2025, Milan, Italy. IEEE, Piscataway, NJ, 1-6 DOI: 10.1109/WCNC61545.2025.10978203PDF | BibTeX | RIS | DOI 2024 David Pätzel, Richard Nordsieck and Jörg Hähner. 2024. A closer look at length-niching selection and spatial crossover in variable-length evolutionary rule set learning. In Xiaodong Li, Julia Handl (Eds.). GECCO '24 Companion: proceedings of the Genetic and Evolutionary Computation Conference Companion, Melbourne, VIC, Australia, July 14-18, 2024. ACM, New York, NY, 1779-1787 DOI: 10.1145/3638530.3664178PDF | BibTeX | RIS | DOI Lukas Meitz, Michael Heider, Thorsten Schöler and Jörg Hähner. 2024. A taxonomy for complexity estimation of machine data in machine health applications. In Giuseppina Gini, Radu-Emil Precup, Dimitar Filev (Eds.). Proceedings of the 21st International Conference on Informatics in Control, Automation and Robotics (ICINCO 2024), November 18-20, 2024, Porto, Portugal, volume 1. SciTePress, Setúbal, 341-350 DOI: 10.5220/0012994900003822PDF | BibTeX | RIS | DOI Henning Cui and Jörg Hähner. 2024. Cartesian Genetic Programming is robust against redundant attributes in datasets. In Francesco Marcelloni, Kurosh Madani, Niki van Stein, Joaquim Filipe (Eds.). Proceedings of the 16th International Joint Conference on Computational Intelligence - ECTA, November 20-22, 2024, in Porto, Portugal. SciTePress, Setúbal, 108-119 DOI: 10.5220/0012974600003837PDF | BibTeX | RIS | DOI Michael Heider, Maximilian Krischan, Roman Sraj and Jörg Hähner. 2024. Exploring self-adaptive genetic algorithms to combine compact sets of rules. In Akira Hirose, Hisao Ishibuchi (Eds.). 2024 IEEE Congress on Evolutionary Computation (CEC), 30 June - 5 July 2024, Yokohama, Japan. IEEE, Piscataway, NJ, 1-8 DOI: 10.1109/CEC60901.2024.10612101PDF | BibTeX | RIS | DOI Jonathan Wurth, Helena Stegherr, Michael Heider and Jörg Hähner. 2024. GRAHF: a hyper-heuristic framework for evolving heterogeneous island model topologies. In Xiaodong Li, Julia Handl (Eds.). GECCO '24: proceedings of the Genetic and Evolutionary Computation Conference, Melbourne, VIC, Australia, July 14-18, 2024. ACM, New York, NY, 1054-1063 DOI: 10.1145/3638529.3654136PDF | BibTeX | RIS | DOI David Pätzel, Richard Nordsieck and Jörg Hähner. 2024. Length-niching selection and spatial crossover in variable-length evolutionary rule set learning. In Xiaodong Li, Julia Handl (Eds.). GECCO '24 Companion: proceedings of the Genetic and Evolutionary Computation Conference Companion, Melbourne, VIC, Australia, July 14-18, 2024. ACM, New York, NY, 303-306 DOI: 10.1145/3638530.3654308BibTeX | RIS | DOI David Pätzel, Richard Nordsieck and Jörg Hähner. 2024. Measuring similarities in model structure of metaheuristic rule set learners. In Stephen Smith, João Correia, Christian Cintrano (Eds.). Applications of Evolutionary Computation: 27th European Conference, EvoApplications 2024, held as part of EvoStar 2024, Aberystwyth, UK, April 3–5, 2024, proceedings, Part II. Springer Nature, Cham, 256-272 DOI: 10.1007/978-3-031-56855-8_16BibTeX | RIS | DOI Henning Cui, Michael Heider and Jörg Hähner. 2024. Positional bias does not influence Cartesian Genetic Programming with crossover. In Michael Affenzeller, Stephan M. Winkler, Anna V. Kononova, Heike Trautmann, Tea Tušar, Penousal Machado, Thomas Bäck (Eds.). Parallel Problem Solving from Nature – PPSN XVIII: 18th International Conference, PPSN 2024, Hagenberg, Austria, September 14–18, 2024, proceedings, part I. Springer, Cham, 151-167 DOI: 10.1007/978-3-031-70055-2_10PDF | BibTeX | RIS | DOI Daniel Gerber, Lukas Meitz, Lukas Rosenbauer and Jörg Hähner. 2024. Unsupervised anomaly detection in continuous integration pipelines. In Hermann Kaindl, Mike Mannion, Leszek Maciaszek (Eds.). Proceedings of the 19th International Conference on Evaluation of Novel Approaches to Software Engineering - ENASE, April 28-29, 2024, in Angers, France. SciTePress, Setúbal, 336-343 DOI: 10.5220/0012618500003687PDF | BibTeX | RIS | DOI 2023 Henning Cui, Markus Görlich-Bucher, Lukas Rosenbauer, Jörg Hähner and Daniel Gerber. 2023. A concept for optimizing motor control parameters using Bayesian optimization. In Giuseppina Gini, Henk Nijmeijer, Dimitar Filev (Eds.). Proceedings of the 20th International Conference on Informatics in Control, Automation and Robotics - ICINCO, November 13-15, 2023, in Rome, Italy, Volume 1. SciTePress, Setúbal, 107-114 DOI: 10.5220/0012093700003543PDF | BibTeX | RIS | DOI Markus Görlich-Bucher, Michael Heider, Tobias Ciemala and Jörg Hähner. 2023. A decision-theoretic approach for prioritizing maintenance activities in organic computing systems. In Georgios Goumas, Sven Tomforde, Jürgen Brehm, Stefan Wildermann, Thilo Pionteck (Eds.). Architecture of Computing Systems: 36th International Conference, ARCS 2023, Athens, Greece, June 13–15, 2023, proceedings. Springer, Cham, 37-47 DOI: 10.1007/978-3-031-42785-5_3PDF | BibTeX | RIS | DOI Helena Stegherr, Leopold Luley, Jonathan Wurth, Michael Heider and Jörg Hähner. 2023. A framework for modular construction and evaluation of metaheuristics. Reports / Technische Berichte der Fakultät für Angewandte Informatik der Universität Augsburg 2023-01. Institut für Informatik, Universität Augsburg, Augsburg.PDF | BibTeX | RIS Lukas Rosenbauer, Anthony Stein and Jörg Hähner. 2023. A germinal center artificial immune system for black box test selection. SN Computer Scien",
  "content_length": 94217,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:50"
}