{
  "name": "Jörg Hoffmann 0001",
  "homepage": "http://fai.cs.uni-saarland.de/hoffmann",
  "status": "success",
  "content": "Joerg Hoffmann Foundations of Artificial Intelligence (FAI) Group Prof. Dr. Jörg Hoffmann Saarland University, Foundations of Artificial Intelligence Group DFKI Affiliate Professor Saarland Informatics Campus Building E1 1 66123 Saarbrücken, Germany (last name) (at) cs (dot) uni-saarland (dot) de +49 (0) 681 302 71471 +49 (0) 681 302 57554 Room 3.18 Google Scholar profile: https://scholar.google.com/citations?user=NR6qg_UAAAAJ&hl=en DBLP: http://dblp.uni-trier.de/pers/hd/h/Hoffmann_0001:J=ouml=rg Own publications page: http://fai.cs.uni-saarland.de/hoffmann/publications.html AI professor ranking: https://airankings.professor-x.de/ (rank 1 in Core AI venues among German professors) Research Interests. I'm working on a range of topics relating to AI action-decision problems, with connections to related areas such as SAT/CP, verification, and natural language generation. Currently, my primary interest is in methods to gain trust in learned action-decision components (action policies). My research group is exploring methods to explain, verify, test, and visualize the behavior of such policies. Short CV. I completed my PhD at the University of Freiburg in 2002, with a thesis that won the EurAI Dissertation award 2002. After postdoctoral positions at Max Planck Institute for Computer Science, Cornell University, the University of Innsbruck, and at SAP Research, I joined INRIA as a Directeur de Recherche in 2009. I became a Professor at Saarland University in 2012, where I'm heading the Foundations of Artificial Intelligence Group. I'm an elected Fellow of AAAI and EurAI. Awards. Best Paper Award, 26th International Conference on Information Visualisation (IV'22). Oustanding Paper Award, Honorable Mention at 36th AAAI Conference on Artificial Intelligence (AAAI'22). Best Student Paper Award at 14th International Symposium on Combinatorial Search 2021 (SOCS'21). Fellow of EurAI, 2021. Fellow of AAAI, 2021. Best Senior Program Committee (SPC) Member Award at ICAPS'19. Distinguished Senior Program Committee (SPC) Member Award at IJCAI'19. Busy Beaver Award for the Programmierung 2 lecture, as the best summer 18 basic course. Awarded each teaching term by the Saarland University CS students. Best Paper Award at the 25th International Symposium on Model Checking of Software (SPIN'18). Runner-Up in the sequential agile track and in the sequential bounded-cost track. Both with SaarPlan, at the 2018 International Planning Competition. Outstanding Senior Program Committee (SPC) Member Award at AAAI'18. ICAPS 2017 Influential Paper Award, Honorable Mention (with Ronen Brafman). Runner-Up (best basic, non-portfolio, system) at the 1st Unsolvability International Planning Competition (UIPC’16). ICAPS 2016 Outstanding Student Paper Award (with Jeanette Daum, Alvaro Torralba, Patrik Haslum, and Ingo Weber). Runner-Up in the sequential satisficing track (best-performing basic, i.e., non-portfolio, solver); Innovative Planner Award. Both with Michael Katz, at the 2014 International Planning Competition. Busy Beaver Award for the Automatic Planning lecture, as the best winter 13-14 core/advanced course. Awarded each teaching term by the Saarland University CS students. SOCS 2013 Best PC Member Award. ICAPS 2013 Influential Paper Award (with Julie Porteous and Laura Sebastia). ICAPS 2012 Best Paper Award (with Emil Keyder and Patrik Haslum). Co-winner of the optimal track at the 7th International Planning Competition (IPC'11), with Fast Downward Stone-Soup (1st prize) and Merge-and-Shrink (2nd prize). Nominated for ICAPS 2011 Best Paper Award. Chaire d'Excellence project grant by the French Agence Nationale de Recherche (ANR), selected as one of 15 accepted proposals in a nationwide call across all scientific disciplines. ICAPS 2008 Influential Paper Award, Honorable Mention (with Jana Koehler, Bernhard Nebel, and Yannis Dimopoulos). ICAPS 2007 Best Research Paper Award (with Malte Helmert and Patrik Haslum). Nominated for IJCAI 2007 Best Paper Award (with Carla Gomes, Ashish Sabharwal, and Bart Selman). Co-winner of the optimal track at the 5th International Planning Competition (IPC'06), with SATPLAN. Nominated for ICAPS 2006 Best Paper Award (with Ashish Sabharwal and Carmel Domshlak). IJCAII-JAIR Best Paper Prize 2005 (with Bernhard Nebel). AAAI 2005 Outstanding PC Member Award. ICAPS 2004 Best Paper Award (with Ronen Brafman). Wolfgang-Gentner Nachwuchsfoerderpreis 2003. EurAI Dissertation Award 2002. Award for the best European Dissertation in the field of AI. Awarded annually by EurAI, the European Association for Artificial Intelligence. Winner of the fully-automated track at the 2nd International Planning Competition (IPC'00), with FF. Winner of the ADL track at the 1st International Planning Competition (IPC'98), with IPP. Teaching. Please see the FAI Teaching page. Systems. A central activity in my research area is the development of systems, whose empirical performance serves to evaluate the underlying ideas. Here 's a list of systems I've been involved in: IPP. This is a planning tool I implemented as a student. It is based on the Graphplan algorithm and nowadays largely outdated. FF. This planning tool was started in my PhD thesis, and gained fame by outclassing the competition in the 2000 International Planning Competition (IPC), setting a completely new standard in planner performance. The tool is still widely used today; variants of its key techniques are used in almost every state of the art planner. FF has been extended to several expressive variants of planning, implemented in the tools Metric-FF (numeric state variables), Conformant-FF (uncertain initial states), Contingent-FF (partial observability), and Probabilistic-FF (like Conformant-FF but with probabilistic initial states and action effects). SATPLAN. This planner, originally proposed by Henry Kautz and Bart Selman, compiles planning into a series of SAT problems. It has long dominated the track for optimal planning tools at the IPC. My contribution amounted to implementation works on encoding planning into SAT. UPPAAL. This is a very widely used tool for model checking networks of timed automata. With co-workers at the Ujniversity of Freiburg, I adapted planning heuristic functions to this context, and showed that they can be useful to more effectively find bugs (paths to undesired states) in the state spaces of such networks. TorchLight is a recent tool I have developed, which allows to analyze search space topology without actually running any search. The tool applies to planners based on the \"ignoring delete lists\" relaxation. adl2strips translates input from the ADL planning language, which allows arbitrary first-order formulas in operator preconditions and the goal, to the simpler STRIPS language which restricts these to conjunctions of atoms. The tool also features two methods for compiling away conditional effects. It has been used in the 2004 IPC, and in some later editions of the IPC as well. Fast Downward. This planning tool was started in the PhD thesis of Malte Helmert, and has in the meantime evolved into the main platform for implementing and evaluating planning algorithms. Fast Downward implements a great variety of search techniques based on heuristic search (including those of FF). The FAI group are regular contributors, devising for example some of the techniques -- merge-and-shrink abstractions, a method to compute lower bound heuristic functions to be used for optimal planning -- that were awarded in the 2011 IPC versions of Fast Downward. For more detailed information and source code downloads, please see the FAI group's Software page. Scientific Organization. Head of the Informatics Department, and Vice-Dean of the Faculty for Mathematics and Informatics, at Saarland University (April 2020 -- March 2022). Dean of Studies of the Faculty for Mathematics and Informatics, at Saarland University (April 2016 -- March 2018). Conference Co-Chair of the 30th International Conference on Automated Planning and Scheduling (ICAPS'20). Member of the Executive Council of the International Conference on Automated Planning and Scheduling (ICAPS), 2010 -- 2016. Program Co-Chair of the 26th National Conference of the American Association for Artificial Intelligence (AAAI'12). Conference Co-Chair of the 20th International Conference on Automated Planning and Scheduling (ICAPS'10). Journal Track Co-Chair of the 25th International Conference on Automated Planning and Scheduling (ICAPS'15). Co-Chair of the ICAPS International Summer School on Planning and Scheduling 2018. Member of the Advisory Committee of the 27th International Joint Conference on Artificial Intelligence (IJCAI'18). Sponsorship Co-Chair of ICAPS'14, ICAPS'15, and ICAPS'16. Demonstrations Chair of ESWC'08. Doctoral Consortium Co-Chair of ICAPS'07. Tutorial Chair of KI'07. Technical Coordinator of EU-funded STREP SWING: Semantic Web Service Interoperability for Geospatial Decision Making. Co-Chair of the International Planning Competition 2004. Co-Chair of the 4th workshop on Reliable Planning and Learning (RIPL'25), at ICAPS'25. Steering Committee of the 6th workshop on Explainable Logic-Based Knowledge Representation (XLoKR 2025), at KR'25. Co-Chair of the 5th workshop on Explainable Logic-Based Knowledge Representation (XLoKR 2024), at KR'24. Co-Chair of the 3rd workshop on Reliable Data-Driven Planning and Scheduling (RDDPS'24), at ICAPS'24. Co-Chair of the 4th workshop on Explainable Logic-Based Knowledge Representation (XLoKR 2023), at KR'23. Co-Chair of the 2nd workshop on Reliable Data-Driven Planning and Scheduling (RDDPS'23), at ICAPS'23. Co-Chair of the 6th workshop on Human-Aware and Explainable Planning (HAXP'23), at ICAPS'23. Co-Chair of the 1st workshop on Reliable Data-Driven Planning and Scheduling (RDDPS'22), at ICAPS'22. Co-Chair of the 3rd workshop on Explainable Logic-Based Knowledge Representation (XLoKR 2022), at KR'22. Co-Chair of the 4th Workshop on Explainable Pla",
  "content_length": 16266,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:45"
}