{
  "name": "Jörg H. Siekmann",
  "homepage": "http://siekmann.dfki.de/en/home-2",
  "status": "success",
  "content": "Jörg Siekmann – Professor für Informatik und Künstliche Intelligenz Jörg Siekmann started out as a craftsman for carpentry and later graduated at the Fachhochschule Rosenheim for wood engineering. In 1969 he decided to change his life and became a student at the well known adult education institution Braunschweig Kolleg, where he obtained his A-level and then studied mathematics and physics at the University of Göttingen. Afterwards he graduated with an M.Sc. in Computer Science at the University of Essex, England, where in 1976 he also obtained his Ph.D. in AI, supervised by Patrick Hayes. He then worked as a research assistant at the Universität Karlsruhe and in 1983 he was appointed to the first chair for AI in Germany at the Technische University Kaiserslautern. In Kaiserslautern he founded in 1989 with colleagues the German Research Centre for Artificial Intelligence (DFKI) and became one of its directors. In 1991 he moved to Saarbrücken and was appointed as a full professor at the department of computer science of the Saarland University and as a director at the DFKI. His research groups worked on automated reasoning for mathematics, knowledge representation, e-Learning for mathematics, formal methods and multiagent systems. Jörg Siekmann was influential in establishing AI in Germany: he is one of the founding fathers of the first Sonderforschungsbereich 314 on AI (Collaborative Research Centre of the DFG) and he is the founder and first chairman of the Division of AI within the Gesellschaft für Informatik (GI) and chairman of the Sonderforschungsbereich 378 for Ressource-bounded cognitive Processes in Saarbrücken. He was chairman of the European Network of Excellence COLOG Net and he is the founding editor of the Springer Lecture Notes in AI (LNAI) and other scientific journals and book series in logic and AI. In 1983 he organized the first international conference on AI (IJCAI) in Karlsruhe, which – inspite of its heated controversy – mutated not witout irony into the largest international conference of its time within Germany. He is also one of the initiators of the German conference on AI (former GWAI). He is a fellow of the GI as well as the EurAI. He was appointed to several international advisory boards of research institutions as well as government committees, including chairman of the Portuguese advisory board of CENTRIA, the advisory board of the Icelandic AI Institue I3M, reviewer and member of the advisory board of the Carnegie Mellon University (USA), the Advisory Committee of the Australian National University (Canberra), and the Institute for Language, Logic and Computation in Amsterdam. He was an advisor and reviewer for research in Ireland, the OECD, the Fifth Generation Computing Initiative in Japan and further European institutions, in particular the former GDR, Bulgaria and China. He is an adjunct professor at Fudan University (Shanghai, China) and founder and co-president of the International Federation on Computational Logic (IFCoLog). Important for the establishment of AI in Germany was the early large scale (> one billion dollars by the year 2000) public-private industrial investment into this new technology. Jörg Siekmann was an advisor to many public institutions and the National Research Ministry as well as to industrial companies like SIEMENS, Daimler Benz, IBM Germany and others. The scientific work of Jörg Siekmann is represented under the pulldown menu RESEARCH and PUBLICATIONS, political and academic activities under ABOUT on this website. Jörg Siekmann was married more than once and has a daughter, Helen Siekmann. He was married to and collaborated scientifically with Erica Melis for over twenty years, until she passed away peacefully but far too early in 2011 from cancer. He is a senior professor and currently the “Coordinator for Digital Education of the UdS” at the University of the Saarland. His main research interests include artificial intelligence, automated reasoning, unification theory, e-Learning for mathematics and last but not least “Buddhism and AI”. For buddhist and other personal reasons he abstained from all honors and distinctions (within this life cycle,😉) that may have been bestowed on him. DFKI Universität des Saarlandes IFCoLog Hilbert Bernays Project Kinder-Uni Sonderforschungsbereich 378 Fachbereich Informatik 50 Years AI Erica Melis Artikel “MenschMaschineMensch” 60. Geburtstag 80. Geburtstag Deutsches Museum Geschichte der KI in Deutschland KI: Atomkrieg aus Versehen Buddhismus Jörg Siekmann Prof. Dr. (Ph. D.) grad. Ing. Co-Founder of DFKI now: senior professor Article: MenschMaschineMensch Book: Cookie-Zustimmung verwalten Um dir ein optimales Erlebnis zu bieten, verwenden wir Technologien wie Cookies, um Geräteinformationen zu speichern und/oder darauf zuzugreifen. Wenn du diesen Technologien zustimmst, können wir Daten wie das Surfverhalten oder eindeutige IDs auf dieser Website verarbeiten. Wenn du deine Zustimmung nicht erteilst oder zurückziehst, können bestimmte Merkmale und Funktionen beeinträchtigt werden. Funktional Funktional Always active Die technische Speicherung oder der Zugang ist unbedingt erforderlich für den rechtmäßigen Zweck, die Nutzung eines bestimmten Dienstes zu ermöglichen, der vom Teilnehmer oder Nutzer ausdrücklich gewünscht wird, oder für den alleinigen Zweck, die Übertragung einer Nachricht über ein elektronisches Kommunikationsnetz durchzuführen. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistiken Statistiken The technical storage or access that is used exclusively for statistical purposes. Die technische Speicherung oder der Zugriff, der ausschließlich zu anonymen statistischen Zwecken verwendet wird. Ohne eine Vorladung, die freiwillige Zustimmung deines Internetdienstanbieters oder zusätzliche Aufzeichnungen von Dritten können die zu diesem Zweck gespeicherten oder abgerufenen Informationen allein in der Regel nicht dazu verwendet werden, dich zu identifizieren. Marketing Marketing Die technische Speicherung oder der Zugriff ist erforderlich, um Nutzerprofile zu erstellen, um Werbung zu versenden oder um den Nutzer auf einer Website oder über mehrere Websites hinweg zu ähnlichen Marketingzwecken zu verfolgen. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Akzeptieren Ablehnen Einstellungen ansehen Einstellungen speichern Einstellungen ansehen {title} {title} {title} Zustimmung verwalten Copyright 2016 by Jörg Siekmann | Design by Martina Tran",
  "content_length": 6634,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:49"
}