{
  "name": "Jörn Müller-Quade",
  "homepage": "http://crypto.iti.kit.edu/index.php?id=iks-mueller-quade",
  "status": "success",
  "content": "KIT - KASTEL: Arbeitsgruppe Kryptographie und Sicherheit - Arbeitsgruppe Kryptographie und Sicherheit KASTEL: Arbeitsgruppe Kryptographie und Sicherheit Arbeitsgruppe Kryptographie und Sicherheit Lehre Eine Übersicht unserer Lehrveranstaltungen Abschlussarbeiten Eine Übersicht über aktuell angebotene Abschlussarbeiten Forschung Eine Übersicht über Themen, die am Institut bearbeitet werden. Mitarbeiter Mitarbeiter am Institut Willkommen bei der Arbeitsgruppe Kryptographie und Sicherheit des Instituts für Informationssicherheit und Verlässlichkeit Die Arbeitsgruppe Kryptographie und Sicherheit des Instituts für Informationssicherheit und Verlässlichkeit wird geleitet von Jörn Müller-Quade und ging durch mehrere Umstrukturierungen aus dem Institut für Kryptographie und Sicherheit (IKS) und dem Institut für theoretische Informatik (ITI) hervor. Forschungsgegenstand sind Themen aus den Gebieten Kryptographie und IT-Sicherheit. Der Arbeitsgruppe ist das Europäische Institut für Systemsicherheit (EISS) angegliedert, das die praktische Umsetzung von Kryptographie in Kooperationen mit dem Forschungszentrum Informatik (FZI) und Industriepartnern bündelt. KASTEL/KIT Programme als mechanische Kunstwerke – „Code Beautiful Like a Clock im ZKM“ Zur Auftaktveranstaltung im Rahmen der Veranstaltungsreihe „Kunst, Sommer, Technik“ des KIT war am Freitag, 11. Juli 2025 das Exponat „Code Beautiful Like a Clock“ im ZKM zu sehen. Entwickelt wurde es von Prof. Jörn Müller-Quade (Sprecher KASTEL Security Research Labs) und Dr. Jeremias Mechler (KASTEL Wissenschaftler). „Code Beautiful Like a Clock“ visualisiert auf sehr beindruckende Weise, dass Computerprogramme der Schönheit mechanischer Uhren gleichkommen. Mechanische Uhren faszinieren durch ihre sichtbare Präzision – Zahnräder greifen ineinander, alles folgt einem klaren Ablauf. Auch Computerprogramme funktionieren nach festen Regeln. Doch ihre „Mechanik“ bleibt verborgen: Sie läuft tief im Inneren des Prozessors in unvorstellbarer Geschwindigkeit ab. Das Exponat macht diese unsichtbare Welt sichtbar. Über einen Drehregler lässt sich die Verarbeitungsgeschwindigkeit von langsam zu blitzschnell verändern, so dass die Berechnungen für das menschliche Auge nachvollziehbar werden. Rechts entsteht ein ästhetisches Muster, das den digitalen Prozess visualisiert, während in der Mitte wird der entsprechende Teil des Programms hervorgehoben wird. Links sehen die Betrachter die Ausführung innerhalb des Prozessors. Dr. Jeremias Mechler veranschaulichte am Freitagabend den faszinierten Besuchern im ZKM, wieviel Kunst in einem anscheinend abstrakten Code steckt – eben „Code Beautiful Like a Clock“. KASTEL auf der Lindauer Nobelpreisträgertagung Am 30.06. lud das Land Baden-Württemberg zum Abschluss der 72. Nobelpreisträgertagung in Lindau die Preisträger*innen zusammen mit Forschenden zur traditionellen Schifffahrt auf dem Bodensee ein. Das Abschlussplenum fand anschließend auf der Insel Mainau statt. Die Tagung hat sich zum Ziel gesetzt, den interdisziplinären Dialog Forschender zu fördern. Jörn Müller-Quade und Jeremias Mechler von den KASTEL Security Research Labs am Karlsruher Institut für Technologie stellten den Geladenen ein kryptographisches Verfahren vor, das privatsphäreschonende Berechnungen auf privaten Daten ermöglicht. Neu an dem Verfahren ist die Verwendung von vertrauenswürdiger Hardware, ohne dabei der Hardware voll vertrauen zu müssen. Das neue Protokoll hat Anwendungen in der Medizin und stellt eine erste Kooperation mit dem vor Kurzem gegründeten KIT-Zentrum HealthTech dar. Laut Jörn Müller-Quade und Jeremias Mechler fand auf der Schifffahrt ein reger Austausch mit den Teilnehmenden statt. Auf besonderes Interesse stieß die neu entwickelte Software bei Wissenschaftsministerin Petra Olschowski. Interdisziplinäre Kommission für Pandemieforschung Mit den Auswirkungen des Coronavirus beschäftigen sich weltweit Experten unterschiedlichster Disziplinen; neben Aktivitäten von Virologen und Medizinern im Rahmen von klinischen und anwendungsorientierten Studien, die zur Findung eines Gegenmittels sowie zur Steigerung des Verständnis über das Virus dienen, wirft die Pandemie auch Fragen für Experten anderer Felder auf, wodurch auch Soziologen, Psychologen, Juristen, Wirtschaftswissenschaftler und IT-Sicherheitsexperten gefragt sind. Um hier die Forschung in Deutschland zu koordinieren und Grundlagenforschung speziell für Themen zu stärken, die in Pandemien wichtig sind, wurde ein interdisziplinäre Kommission von DFG-Präsidentin Prof. Dr. Katja Becker ins Leben gerufen. Unter den 18 Mitgliedern der Kommission, die aus unterschiedlichsten Disziplinen, wie Medizin, Geografie, Virologie, Soziologie, Wirtschaft und Jura stammen, vertritt Institutsleiter Prof. Jörn Müller-Quade für die nächsten zwei Jahre die Seite der IT-Sicherheit. Im Rahmen der Kommission gehört es zu seinen Aufgaben, den Überblick über die Grundlagenforschung in dem Gebiet zu überblicken und darauf nötige Forschungsfragen abzuleiten, die hinsichtlich Pandemien (interdisziplinär) erforscht werden sollten. Effiziente, privatsphäreschonende Mautsysteme Elektronische Mautsysteme werden inzwischen überall auf der Welt benutzt. Sie werden nicht nur verwendet, um die Verkehrsinfrastruktur zu finanzieren, sondern auch für komplexere Ziele, beispielsweise Staumanagement und Reduktion der Luftverschmutzung. Dies wird durch ein adaptives Preisschema realisiert, welches den Nutzer dazu motivieren soll, weniger ausgelastete Strecken zu bevorzugen. Konventionelle elektronische Mautsysteme identifizieren den Nutzer bei jedem Bezahlvorgang und können dadurch die Bewegungen jedes Autofahrers nachverfolgen – was natürlich die Privatsphäre des Nutzers verletzt. In einem kürzlich auf dem „Privacy Enhancing Technologies Symposium (PETS)“ vorgestellten Beitrag beschreiben Valerie Fetzer, Matthias Nagel und Rebecca Schwerdt (alle KIT) zusammen mit Andy Rupp (Universite de Luxembourg) und Max Hoffmann (Ruhr-Universität Bochum), wie dies auch ohne Eingriffe in die Privatsphäre funktionieren kann. Der Artikel „P4TC — Provably-Secure yet Practical Privacy-Preserving Toll Collection“ beschreibt ein neuartiges elektronisches Mautverfahren, welches die Privatsphäre des Nutzers respektiert und dabei effizient und beweisbar sicher ist. Wie privat ist der Private Modus? Im Internet ist es allgemeine Praxis, dass Internetseiten versuchen, wiederkehrende Nutzer als solche zu identifizieren, um ihnen auf ihre Interessen zugeschnittene Werbung zuzuteilen. Als Abhilfe dagegen bieten moderne Webbrowser wie Firefox und Chrome den sog. „privaten Modus“ (oder „Inkognito-Modus“) an. Dieser soll durch den Verzicht auf Cookies, Browserverlauf und weitere identifizierende Merkmale das Tracking einzelner Nutzer über mehrere Sitzungen hinweg erschweren. Während Chrome im Inkognito-Modus zwar Cookies, Webseitendaten und Browserverlauf nicht nutzerseitig speichert, um das Tracking bei besuchten Webseiten zu erschweren, liefert der Browser dennoch viele Daten an Google, den Hersteller des Browsers, sowie den besuchten Webseiten aus. Die Frage, ob dies rechtens ist, oder als bewusste Irreführung und Betrug gehandhabt wird, wird momentan in den USA vor Gericht geklärt. Um genau dieses Thema geht es in einem Artikel der Süddeutschen . Darin wurden Institutsleiter Prof. Jörn Müller-Quade und Prof. Thorsten Strufe von der Arbeitsgruppe Praktische IT-Sicherheit befragt. In dem Artikel plädieren beide für mehr Transparenz bei der Datensammlung und durchleuchten die Möglichkeit, dass es sich um ein allgemeines Missverständnis handelt: während Google die Ansicht vertritt, dass der private Modus Modus lediglich einen Verzicht auf Speicherung von Daten auf dem Nutzergerät beinhaltet, verstehen viele Nutzer den Modus als Freifahrtsschein für anonymes Surfen. Da aus technischen Gründen jedoch auch im Inkognito-Modus Daten wie die IP-Adresse sowie Browser-spezifische Einstellungen zur korrekten Webseitendarstellung benötigt werden, empfiehlt Prof. Strufe Nutzern, die wirklich anonym surfen wollen, den Tor-Browser . Mehr Informationen Offener Brief zu Problemen zentralisierter Contact-Tracing-Apps In der aktuellen SARS-CoV-2 Pandemie könnten Smartphone-Apps zum sog. „Contact Tracing“ den Menschen mehr Freiheiten erlauben, indem anstelle der bisherigen mühsamen Nachverfolgung von Infektionsketten, Menschen automatisch gewarnt werden, die in näherem Kontakt mit einer an Corona infizierten Person waren. Die Apps messen etwa durch Bluetooth- oder GPS-Module über das Smartphone, ob sich zwei Personen zu Nahe gekommen sind. Es existieren verschiedene Vorschläge, die behaupten privatsphäreschonend zu sein, ohne dass es hierfür bisher eine genaue Definition gab. Prof. Thorsten Strufe hat nun mit seiner Gruppe zum ersten Mal formal definiert, was Privatsphäre im Rahmen von Contact Tracing Apps bedeutet  und unterschiedliche vorgeschlagene Ansätzen diesbezüglich verglichen. Zur Zeit werden grob zwei Ansätze unterschieden: ein zentraler Ansatz, bei dem in einem zentralen Datenspeicher alle Informationen pseudonymisiert hinterlegt werden und ein die Privatsphäre vor den zentralen Autoritäten stärker schützender dezentraler Ansatz. Ein zentrales Datenlager birgt ein großes Missbrauchspotential, da man trotz der Pseudonymisierung Soziale Graphen ableiten kann oder Rückschlüsse auf den Tagesablauf von Privatpersonen ziehen kann. Dies ist kaum vereinbar mit der Informationellen Selbstbestimmung der Nutzer und schon die Gefahr eines Missbrauchs könnte die soziale Akzeptanz – und damit die Verwendung – einer solchen App stark mindern. Diese Probleme wurden in einem offenen Brief zusammen gefasst, den auch vom Institutsleiter Prof. Jörn Müller-Quade und sowie von Prof. Thorsten Strufe, Institutsleiter der Arbeitsgruppe Praktische IT-Sicherheit (PS), unterschrieben haben. Der Brief wurde am 20. April veröffentlicht und wurde von insgesamt 300 namenhaften Wissenschaftlern, die auf dem Gebiet der Sicherh",
  "content_length": 12264,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:56"
}