{
  "name": "Jörn Ostermann",
  "homepage": "http://www.tnt.uni-hannover.de/~osterman",
  "status": "success",
  "content": "Institut für Informationsverarbeitung (TNT) - Homepage of Jörn Ostermann Prof. Dr.-Ing. Jörn OstermannLeibniz Universität HannoverInstitut für Informationsverarbeitung Appelstr. 9A 30167 Hannover Germany phone: +49 511 762-5316fax: +49 511 762-5333office location: room 1319 Jörn Ostermann studied Electrical Engineering and Communications Engineering at the University of Hannover and Imperial College London, respectively. He received Dipl.-Ing. and Dr.-Ing. from the University of Hannover in 1988 and 1994, respectively. From 1988 till 1994, he worked as a Research Assistant at the Institut für Theoretische Nachrichtentechnik conducting research in low bit-rate and object-based analysis-synthesis video coding. In 1994 and 1995 he worked in the Visual Communications Research Department at AT&T Bell Labs on video coding. He was a member of Image Processing and Technology Research within AT&T Labs - Research from 1996 to 2003. Since 2003 he is Full Professor and Head of the Institut für Informationsverarbeitung at Leibniz Universität Hannover, Germany. From 2007 until 2011, he served as head of the Laboratory for Information Technology. From 1993 to 1994, he chaired the European COST 211 sim group coordinating research in low bitrate video coding. Within MPEG-4, he organized the evaluation of video tools to start defining the standard. He chaired the Adhoc Group on Coding of Arbitrarily-shaped Objects in MPEG-4 Video. From 2008 until the reorganization of SC29 in July 2020, he was the Chair of the Requirements Group of MPEG (ISO/IEC JTC1 SC29 WG11). In July 2020 he was appointed Convenor of MPEG Technical Coordination (ISO/IEC JTC1 SC29 AG2). From 2011 to 2013, he served as Dean of the Faculty of Electrical Engineering and Computer Science at LUH. Since 2020 he is member of the Senat of Leibniz Universität Hannover. Jörn was a scholar of the German National Foundation. In 1998, he received the AT&T Standards Recognition Award and the ISO award. He is a Fellow of the IEEE (class of 2005) and member of the IEEE Technical Committee on Multimedia Signal Processing and past chair of the IEEE CAS Visual Signal Processing and Communications (VSPC) Technical Committee. Joern served as a Distinguished Lecturer of the IEEE CAS Society (2002/2003). In 2021, he was awarded the ISO Excellence Award. He published more than 200 research papers and book chapters. He is coauthor of a graduate level text book on video communications. He is named as inventor on more than 30 patents. His current research interests are video coding and streaming, computer vision, machine learning, speech analysis, and computer-human interfaces. Projects Structure and Motion Estimation SAR WIPKA-QS GeoAIDA Transform and subband coding Gentelligent Components in their Lifecycle Video streaming Talking Heads Region of Interest (ROI)-based Coding Helpful Use of Surveillance Cameras Motion Compensation for Video Surveillance Region Detector Evaluation Damage Detection Superpixels TNT Aerial Video Testset (TAVT) Next Generation Video Coding ManiCode Source Localization Statistical Face Models AutoPIN Signal Coding for Cochlear Implants HDR Imaging Analysis of Children's Speech Predictive Maintenance Conditional Coding for Learned Compression GreenAutoML4FAS Cochlear Implants Organ Modeling for CT Data Error Concealment Analysis and Synthesis of Human Faces Genomic Data Science Recent Publications Martin Benjak, Yi-Hsin Chen, Wen-Hsiao Peng, Jörn OstermannScalable COOL-CHIC: Dual-Resolution Images from a Single Bitstream Picture Coding Symposium (PCS), Aachen, Germany, December 2025(pdfGitHub) BibTeX Martin Benjak, Yi-Hsin Chen, Wen-Hsiao Peng, Jörn OstermannProgressive COOL-CHIC: Efficient Decoding for Dual-Resolution Images IEEE Visual Communications and Image Processing (VCIP), Klagenfurt, Austria, December 2025(pdfGitHub) BibTeX Kuan-Wei Ho, Yi-Hsin Chen, Martin Benjak, Jörn Ostermann, Wen-Hsiao PengA Cross-Framework Study of Temporal Information Buffering Strategies for Learned Video Compression Picture Coding Symposium (PCS), Aachen, Germany, December 2025 BibTeX Selected PublicationsShow all publicationsConference Contributions Nikolce Stefanoski, Jörn OstermannSpatially and Temporally Scalable Compression of Animated 3D Meshes with MPEG-4/FAMC ICIP '08 - IEEE International Conference on Image Processing, San Diego, USA, October 2008(pdf) BibTeXJournals Matthias Reso, Jörn Jachalsky, Bodo Rosenhahn, Jörn OstermannOcclusion-Aware Method for Temporally Consistent Superpixels IEEE Transactions on Pattern Analysis and Machine Intelligence, IEEE, Vol. 41, No. 6, pp. 1441-1454, June 2019(pdfIEEEexplore) BibTeX Nikolce Stefanoski, Jörn OstermannSPC: Fast and Efficient Scalable Predictive Coding of Animated Meshes Computer Graphics Forum, The Eurographics Association and Blackwell Publishing, Vol. 29, No. 1, pp. 101-116, 2010(tnt-www) BibTeX Yuri Vatis, Jörn OstermannAdaptive Interpolation Filter for H.264/AVC IEEE Transactions on Circuits and Systems for Video Technology, Vol. 19, No. 2, pp. 179 - 192, February 2009 BibTeXBook Chapters Jörn Ostermann, Masayuki TanimotoMPEG Video Compression Future The MPEG Representation of Digital Media, Springer, pp. 69-80, 2012, edited by Leonardo Chiariglione(pdfDOI) BibTeX Last changed: 2025-12-01",
  "content_length": 5285,
  "method": "requests",
  "crawl_time": "2025-12-01 13:38:55"
}