{
  "name": "Jürgen Ziegler 0001",
  "homepage": "https://interactivesystems.info/team/juergen-ziegler",
  "status": "success",
  "content": "Prof. Dr.-Ing. Jürgen Ziegler | Interactive Systems Team Research Publications Teaching Services Contact Prof. Dr.-Ing. Jürgen Ziegler Jürgen Ziegler is a senior full professor in the Faculty of Computer Science at the University of Duisburg-Essen where he is conducting research in the field of Intelligent Interactive Systems. His main research interests lie in the areas of human-computer interaction, human-AI cooperation, recommender systems, social media, and information visualization. Jürgen Ziegler holds a doctoral degree from the University of Stuttgart the subject of formal user interface design methodology. Prior to joining the University of Duisburg-Essen, he was head of the Competence Center for Software Technology and Interactive Systems at the Fraunhofer Institute for Industrial Engineering (IAO) in Stuttgart. In addition to numerous scientific functions at leading international venues, he was founding editor and editor-in-chief of i-com - Journal of Interactive Media (De Gruyter) from 2001 until 2021. He is the founding chair and current vice-chair of the German Special Interest Group on User-Centred Artificial Intelligence. Journal of Interactive Media For a description of the scope of the journal and submission see i-com. Contact Mail juergen [dot] ziegler [at] uni-due [dot] de Phone +49 (203) 379-2270 Fax +49 (203) 379-3557 Office LE 411 LSF view Selected publications De-centering the (Traditional) User: Multistakeholder Evaluation of Recommender Systems Burke, R., Adomavicius, G., Bogers, T., Di Noia, T., Kowald, D., Neidhardt, J., Özgöbek, Ö., Pera, M. S., Tintarev, N., & Ziegler, J. (2025). International Journal of Human Computer Studies, 203. De-centering the (Traditional) User: Multistakeholder Evaluation of Recommender Systems Burke, R., Adomavicius, G., Bogers, T., Di Noia, T., Kowald, D., Neidhardt, J., Özgöbek, Ö., Pera, M. S., Tintarev, N., & Ziegler, J. (2025). International Journal of Human Computer Studies, 203. 7th Workshop on Explainable User Models and Personalised Systems (ExUM 2025) Musto, C., Polignano, M., Rapp, A., Semeraro, G., & Ziegler, J. (2025). In Association for Computing Machinery (Ed.), UMAP Adjunct ’25: Adjunct Proceedings of the 33rd ACM Conference on User Modeling, Adaptation and Personalization (pp. 174–176). Association for Computing Machinery, Inc. Challenges in Integrating Conversational AI and GUI-Based Applications Ziegler, J. (2025). In L. Zaina, J. Creissac Campos, & D. Spano (Eds.), Engineering Interactive Computer Systems: EICS 2024 International Workshops; Revised Selected Papers (Vol. 15518, pp. 159–170). Springer Science and Business Media Deutschland GmbH. Knowledge Graph-Based Integration of Conversational Advisors and Faceted Filtering Kleemann, T., Loepp, B., & Ziegler, J. (2025). Interacting with Computers, 37(3), 158–188. De-centering the (Traditional) User: Multistakeholder Evaluation of Recommender Systems Burke, R., Adomavicius, G., Bogers, T., Di Noia, T., Kowald, D., Neidhardt, J., Özgöbek, Ö., Soledad Pera, M., Tintarev, N., & Ziegler, J. (2025). Meta-Intents: Interaction Preferences in Conversational Recommender Systems Ma, Y. (2025). [PhD thesis]. An integrated approach for transparent, multi-level decision support in interactive recommender systems Kleemann, T. (2024). [PhD thesis]. Investigating meta-intents: user interaction preferences in conversational recommender systems Ma, Y., & Ziegler, J. (2024). User Modeling and User-Adapted Interaction, in press. Preface to the special issue on news personalization and analytics Kille, B., Lommatzsch, A., Ziegler, J., & Özgöbek, Ö. (2024). User Modeling and User-Adapted Interaction, in press. Knowledge Graph-Based Integration of Conversational Advisors and Faceted Filtering Kleemann, T., Loepp, B., & Ziegler, J. (2024). Interacting with Computers, in press. From explanations to human-AI co-evolution: Charting trajectories towards future user-centric AI Ziegler, J., & Donkers, T. (2024). i-Com: Journal of Interactive Media, 23(2), 263–272. Assessing the Utility of an Interaction Qualities Framework in Systematizing the Evaluation of User Control Smits, A., Detweiler, C., Bartels, E., Pott, K., van der Stappen, E., van Rossen, S., Cardona, K., Shayan, S., Ziegler, J., & van Turhout, K. (2024). In A. Bramwell-Dicks, A. Evans, M. Winckler, H. Petrie, & J. Abdelnour-Nocera (Eds.), Design for Equality and Justice: INTERACT 2023 IFIP TC 13 Workshops, York, UK, August 28 – September 1, 2023, Revised Selected Papers, Part II (pp. 185–195). Springer. Exploring Categorizations of Algorithmic Affordances in Graphical User Interfaces of Recommender Systems Bartels, E., Smits, A., Detweiler, C., van der Stappen, E., van Rossen, S., Shayan, S., Pott, K., Cardona, K., Ziegler, J., & van Turnhout, K. (2024). In A. Bramwell-Dicks, A. Evans, M. Winckler, H. Petrie, & J. Abdelnour-Nocera (Eds.), Design for Equality and Justice: Revised Selected Papers, Part II (Vol. 14536, pp. 173–184). Springer. Design Ideas for Recommender Systems in Flexible Education: How Algorithmic Affordances May Address Ethical Concerns van Rossen, S., Bartels, E., Cardona, K., Detweiler, C., Pott, K., Shayan, S., Smits, A., Ziegler, J., & van der Stappen, E. (2024). In A. Bramwell-Dicks, A. Evans, M. Winckler, H. Petrie, & J. Abdelnour-Nocera (Eds.), Design for Equality and Justice: Revised Selected Papers, Part II (Vol. 14536, pp. 205–213). Springer. All 308 publication Main research topics Recommender Systems Modelling and Understanding User Behavior Social Media Engineering Additional information Supervised PhD Theses Contact Privacy policy Atom iCal Twitter Share",
  "content_length": 5648,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:03"
}