{
  "name": "Jürgen Steimle",
  "homepage": "https://hci.cs.uni-saarland.de/people/juergen-steimle",
  "status": "success",
  "content": "Prof. Dr. Jürgen Steimle - Human Computer Interaction Lab, Saarland University People Research Teaching Theses Publications Jobs Contact PEOPLE / Prof. Dr. Jürgen Steimle Phone: +49 (0)681 302 71080 (Adm. assistant Kathrin Keim), direct extension -71081 Email: last name (at) cs.uni-saarland.de Fax: +49 (0)681 302 70155 Office Hours: By Appointment PEOPLE / Prof. Dr. Jürgen Steimle Lab Director Jürgen Steimle is a full professor (W3) at the Department of Computer Science at Saarland University and Saarland Informatics Campus. He directs the Human-Computer Interaction and Interactive Technologies Lab. From 2022-2024, he was the Dean of the Faculty of Mathematics and Computer Science. Previously, he held positions as Independent Research Group Leader (W2) at Saarland University (2013-2016) and Senior Researcher at the Max Planck Institute for Informatics (2013-2018). From 2012 to 2014, he was a Visiting Assistant Professor at Massachusetts Institute of Technology (MIT). He holds a PhD in Computer Science from Darmstadt University of Technology. His research investigates embedded and embodied user interfaces that seamlessly merge with the physical world and the human body, to enable more effective, expressive, and engaging interactions with computers and interactive devices. His current focus areas include on-body interaction and wearable computing, touch and haptic interfaces, human-robot interaction, flexible sensors and displays, digital fabrication and new materials for interaction. His work was recognized with an ERC Starting Grant, best paper awards at the premier conferences in human-computer interaction ACM CHI and UIST, and the Best Computer Science Dissertation Award 2009 by the German, Austrian and Swiss Computer Societies. He is serving as co-chair and member of program committees for major international conferences, including positions as program chair at UIST 2023 and TEI 2017, general chair at ACM ISS 2017, and workshops track chair for CHI 2014 and CHI 2015. CONTACT Email: last name (at) cs.uni-saarland.de Phone: +49 (0)681 302 71080 (Administrative assistant Anne Bardesono-Köpsel), direct extension -71081 Fax: +49 (0)681 302 70155 Office: Building E1.7, Room 2.23 Office Hours: By appointment SELECTED RESEARCH Imaginary JointMove with Style!GestureCoachTexergyBiomaterials for Prototyping in HCILiving LayersExoKit3HANDSEmbrogami: Shape-Changing Textiles with Machine EmbroideryCapacitive Touch Sensing on General 3D SurfacesElectrotactile Compliance IllusionFlextilesWRLKitDouble-Sided Tactile InteractionsBiohybrid DevicesDesign and Fabrication of Body-based InterfacesI Need a Third ArmRoboSketchInteractive BioplasticsNext Steps in Epidermal ComputingPrint-A-SketchComputational Design of Physiological SensorsWeirding HapticsbARefootSoft Inkjet CircuitsCapricateTacttooSkinMarksSkin—The Next User InterfaceiSkinFoldioMore Than TouchPrintScreenFlexpadPen-and-Paper User InterfacesAlgorithmic Mechanism Design Full list of research projects – Full list of publications – Google Scholar profile – DBLP profile CURRENT AND PAST PHD STUDENTS Ulrike Kulzer (MSc from U Saarland) David Wagmann (MSc from U Saarland) Yu Jiang (BSc from CMU) Marie Josefine Philippine Mühlhaus (MSc from U Saarland) Arata Jingu (MSc from U Tokyo) Madalina Nicolae (MSc from ESILV Paris) Artin Saberpour (MSc from U Saarland) Dr. Narjes Pourjafarian (PhD 2023) – Postdoctoral Associate at Cornell University Dr. Adwait Sharma (PhD 2022) – Lecturer (assistant professor) at University of Bath Prof. Dr. Aditya Shekhar Nittala (PhD 2022) – Assistant Professor at University of Calgary Dr. Daniel Gröger (PhD 2019) – UX Engineer Prof. Dr. Martin Weigel (PhD 2017) – Professor at Technische Hochschule Mittelhessen Prof. Dr. Myroslav Bachynskyi (PhD 2016, co-supervised with Antti Oulasvirta) – Associate Professor at University of Bergen Prof. Dr. Simon Olberding (PhD 2015) – Professor at Hochschule Flensburg Dr. Roman Lissermann (PhD 2014, primary supervisor: Max Mühlhäuser) Dr. Mohammadreza Khalilbeigi (PhD 2014, primary supervisor: Max Mühlhäuser) Prof. Dr. Jochen Huber (PhD 2012, primary supervisor: Max Mühlhäuser) – Professor at Furtwangen University CURRENT AND PAST POST-DOCS Dr. Ashwhin Ram (PhD from NUS) Dr. Martin Schmitz (PhD from TU Darmstadt) Alice Haynes (PhD from U Bristol) Ata Otaran (PhD from Queen Mary University London) Dr. Marc Teyssier (PhD from Télécom Paris and HCI La Sorbonne) – Research Group Leader at De Vinci Innovation Center Dr. Marion Koelle (PhD from U Oldenburg) – Research Group Leader at OFFIS Institute of Information Technology Dr. Paul Strohmeier (PhD from U Copenhagen) – Research Group Leader at Max Planck Institute for Informatics Dr. Bruno Fruchard (PhD From Télécom Paris and HCI La Sorbonne) – Researcher at INRIA Arshad Khan (PhD From HKUST) – Researcher at HBKU Qatar Dr. Joan Sol Roo (PhD from INRIA-POTIOC Bordeaux) – Software Engineer Dr. Anusha Withana (PhD From Keio University) – Lecturer at University of Sydney SELECTED AWARDS AND RECOGNITIONS ERC Starting Grant 2016 Holder of the Francqui Chair 2016 at Hasselt University, Belgium (invited guest professor) Best Paper Awards at ACM UIST 2022, ACM UIST 2019 (2x), ACM ISS 2018, ACM CHI 2015, ACM UIST 2015, ACM UIST 2014, IEEE ICALT 2008, DeLFI 2007 Honorable Mention Awards at UIST 2025 (2x), SIGGRAPH 2024, CHI 2023, CHI 2020, CHI 2019 (2x), CHI 2016, CHI 2015, CHI 2013 CHI 2023 People’s Choice Best Demo Award, UIST 2022 Best Demo Award Google Faculty Research Award 2015 Germany Land of Ideas – Landmark 2015 [Deutschland Land der Ideen – Ausgewählter Ort 2015] Best Computer Science Dissertation Award 2009 by the German Informatics Society (GI), the Swiss Informatics Society (SI), the Austrian Computer Society (OCG) and the German Chapter of the ACM (the most prestigious award for dissertations in computer science in the German-speaking countries) Full scholarship of the German National Merit Foundation (Studienstiftung des Deutschen Volkes) 2002-2006 TEACHING Core Lecture Human-Computer Interaction (9CP), in winter semesters Lecture Interactive Systems (6CP), in summer semesters Lecture Programming for Engineers (8CP), summer semester 2018 Advanced Lecture Physical Computing (6CP), in winter semester 2016/17 Lecture User Interface Design (9CP), in summer semester 2016 Seminars (7CP) on various topics, including AR/VR, Interactive Skin, Interactive Digital Fabrication, Physical Computing, Developing Embedded Interactive Systems, Embodied Interaction CHAIRING AND ORGANIZATION ACM UIST 2023 Program Chair ACM TEI 2017 Program Chair ACM ISS 2017 General Chair ACM CHI 2024 Interactivity Jury ACM UIST 2020 Doctoral Consortium Chair ACM UIST 2018 Awards Chair ACM CHI 2015 Workshops Track Chair ACM ITS 2014 Doctoral Consortium Chair ACM CHI 2014 Workshops Track Chair ACM MobileHCI 2014 Workshops Track Chair ACM ITS 2012 Demos Chair Guest Editor of ACM Transactions on Computer-Human Interaction (ToCHI) 2021 special issue “Digital Touch: Reshaping interpersonal communicative capacity and social touch practices” (with Sara Price, Carey Jewitt, Nadia Bianchi-Berthouze) Guest Editor of the Informatik Spektrum special issue “Interaction Beyond the Desktop” (with Eva Hornecker and Albrecht Schmidt) Organizer of 6th Summer School on Computational Interaction 2022 (with Anna Maria Feit) Organizer of Dagstuhl Seminar “On-Body Interaction” 2018 (with Kasper Hornbaek, David Kirsh, Joe Paradiso) Organizer of European Tangible Interaction Studio (ETIS) 2017 Summer School (with Dimitra Anastasiou, Valerie Maquil) Organizer of ACM UbiComp 2016 Workshop “UnderWare: Aesthetic, Expressive, and Functional On-Skin Technologies” (with Joe Paradiso, Chris Schmandt, Katia Vega, Cindy Hsin-Liu Kao, Rebecca Kleinberger, Xin Liu, Jie Qi, Asta Roseway, Ali K. Yetisen, Martin Weigel) Organizer of ACM CHI 2013 Workshop “Displays Take New Shape: An Agenda for Future Interactive Surfaces” (with Hrvoje Benko, Alvaro Cassinelli, Hiroshi Ishii, Daniel Leithinger, Pattie Maes, Ivan Poupyrev) Organizer of ACM CHI 2013 Special Interest Group “Visions and Visioning in CHI” (with Aaron Quigley, Alan Dix, Wendy Mackay, Hiroshi Ishii) Organizer of Dagstuhl Seminar “Interaction Beyond the Desktop” 2012 (with Alan Dix, James D. Hollan, Albrecht Schmidt) Organizer of ACM ITS 2012 Tutorial and Workshop “Beyond Flat Displays: Towards Shaped and Deformable Interactive Surfaces” (with Daniel Leithinger, Pol Pla, Pattie Maes) Organizer of Mensch&Computer 2010 Workshop “Be-greifbare Interaktionen” [Tangible Interactions] Organizer of Conference on Interdisciplinary Approaches to Technology-enhanced Learning (IATEL) 2009 (with Max Mühlhäuser, Werner Sesink, Andreas Kaminski) PROGRAM COMMITTEES AND SCIENTIFIC BOARDS Editorial Board of ACM Transactions on Computer-Human Interaction (TOCHI), since 2024 Member of Scientific Advisory Board of Leibniz Institute for New Materials (INM), since 2019 ACM UIST User Interface Software and Technology Symposium (UIST) 2025 ACM CHI Conference on Human Factors in Computing (CHI) 2022 ACM CHI Conference on Human Factors in Computing (CHI) 2021 Augmented Humans (AHs) Conference 2020 ACM CHI Conference on Human Factors in Computing (CHI) 2019 Mensch & Computer 2018 Conference ACM UIST User Interface Software and Technology Symposium (UIST) 2017 Conference on Augmented Human (AH) 2016 Mensch & Computer 2016 Conference Intl. Symposium on Pervasive Displays (PerDis) 2016 ACM CHI Conference on Human Factors in Computing (CHI) 2015 ACM UIST User Interface Software and Technology Symposium (UIST) 2015 IEEE Intl. Conference on RFID 2015 Intl. Symposium on Pervasive Displays (PerDis) 2015 Conference on Augmented Human (AH) 2015 Mensch & Computer 2015 Conference ACM CHI Conference on Human Factors in Computing (CHI) 2014 ACM Interactive Tabletops and Surfaces Conference (ITS) 2014 Intl. Symposium on Pervasive Displays (PerDis) 2014 Mensch & Computer 2014 Conference ACM Intl. Conference on Multimedia (M",
  "content_length": 10592,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:10"
}