{
  "name": "Jürgen Dingel",
  "homepage": "http://www.cs.queensu.ca/~dingel",
  "status": "success",
  "content": "Juergen Dingel's Home Page Juergen Dingel Professor School of Computing, Queen's University 723 Goodwin Hall Kingston, Ontario, K7L 2N8, Canada Office: (613) 533-3071 FAX: (613) 533-6513 E-mail: my last name at cs dot queensu dot ca Brief Bio Juergen joined the Computing faculty in the winter of 2000. He received an M.Sc. in Computer Science from Berlin University of Technology in 1992, an M.Sc. in Pure and Applied Logic in 1994 and a Ph.D. in Computer Science in 1999 from Carnegie Mellon University. Juergen was PC Co-chair of the ACM/IEEE 17th International Conference on Model Driven Engineering Languages and Systems (MODELS'14) and of the IFIP International Conference on Formal Techniques for Distributed Systems (FMOODS-FORTE'11). He is on the editorial boards of three journals: the Journal on Software and Systems Modeling (SoSyM), the Journal on Software Tools for Technology Transfer (STTT), and the Journal of Object Technology (JOT). He is a member of the MODELS Steering Committee and served as its chair from 2016 to 2018. His research has been supported by various sources including IBM, GM, Ericsson, the Natural Science and Engineering Council of Canada (NSERC), the Ontario Centres of Excellence (OCE), the Ontario Ministry of Research, Innovation, and Science, the Deutsche Forschungsgemeinschaft (DFG), and the German Academic Exchange Service. At Queen's, he has served as the Chair of Undergraduate Studies (66 months between 2014 - 2021) in the School of Computing where he also leads the Modeling and Analysis in Software Engineering Group (MASE). Research Research interests: Software modeling, model-driven engineering, analysis of software artifacts, formal specification and verification, formal methods, testing, software quality assurance, software engineering. Projects: Please see the pages of our Modeling and Analysis in Software Engineeing (MASE) group. Selected publications: Can be found here. Publication profiles: On Google Scholar and on DBLP. Supervision Current visitors, postdocs and students: Mufasir Muthaher Mohammed (PhD, co-supervised), Hesham Elabd (PhD), Madonna Fanoos (PhD), Nathanael Yao (MSc), Andrew Boulos (MSc), Haiyu Li (MSc). Former visitors, postdocs and graduated students: Liam Walsh (MSc), Karim Jahed (PhD), Majid Babaei (PhD), Reza Ahmadi (PhD), Mojtaba Bagherzadeh (PhD), Rohan Patel (MSc), Michal Pasternak (MSc), Sudharshan Gopikrishnan (MSc), Kanchan Nair (MSc), Dr. Nicolas Hili (PDF), Harshith Vasanth Gayathri (MSc), Francis Atampore (PhD, jointly with Dr Karen Rudie), Tuhin Kanti Das (PhD), Dr. Amal Khalil (PDF), Dr. Raquel Oliveira (Visitor), Nondini Das (MSc), Suchita Ganesan (MSc), Laith (Leo) Juwaidah (MSc), Boris Madzar (MSc), Md Tawhid Bin Waez (PhD, jointly with Dr Karen Rudie), Dr. Jalil Boudjadar (PDF), Gehan M.K. Selim (PhD and PDF, jointly with Dr Jim Cordy), Dr. Ernesto Posse (PDF), Karolina Zurowska (PhD and PDF), Keith Yip (MSc), Eyrak Paen (MSc), Eric Rapos (MSc), Miloud Eloumri (MSc), Rezoanoor (Ruben) Rahman (MSc), Ahmad Saifan (PhD), Yann Moffett (MSc, jointly with Dr Alain Beaulieu), Anthony Auer (MSc, jointly with Dr Karen Rudie), Dr. Zinovy Diskin (PDF), Hongzhi Liang (PhD), Michelle Crane (PhD), Chris Dragert (MSc, jointly with Dr Karen Rudie), Jeremy Bradbury (PhD, jointly with Dr Jim Cordy), Barry (Tao) Long (MSc, jointly with Dr Nick Graham), Alanna Zito (MSc), Ruhai Cai (MSc), Dan Yau (MSc, jointly with Dr Jim Cordy), Jesse McGeachie (MSc), Hongzhi Liang (MSc), Natalie Bowles (MSc), Michelle Crane (MSc), Songhui Zhu (MSc), Jeremy Bradbury (MSc). Undergraduate projects (CISC499): Please go here for this year's project suggestions. MSc thesis topics: There's lots of interesting work to be done and I typically have a wide range of project ideas for people to work on. Projects are likely to be related to our current research work. Please talk to me about the details. Teaching Courses in Fall/Winter 2024/25: * Formal Methods in Software Engineering (CISC/CMPE 422/835). * Beyond Code: An Introduction to Model-Driven Software Development (CISC 844 (Fall 2023), old course code: CISC 836). * Advanced Undergraduate Project (CISC 499). Office hours: By appointment Past courses: A list can be found here. Service Some current internal activities * Member of Undergraduate Committee * Chair of Renewal, Tenure and Promotion Committee Some current external activities * Editorial board member for SoSyM, STTT, and JoT * Steering committee member for Workshop on Model-driven Engineering, Verification, and Validation (MoDeVVa). * PC member for ACM/IEEE 27th International Conference on Model Driven Engineering Languages and Systems (MODELS'24). Sept 22-27, 2024. * Co-organizer for Workshop on Modeling in Automotive Software Engineering at MODELS'24 (MASE'24), Sept 2024 * PC member for Workshop on Modeling Language Engineering (MLE), MODELS'24, Sept 2024 * PC member for 15th System Analysis and Modeling Conference (SAM'23) at MODELS'23. Vasteras, Sweden. Oct 2-3, 2023. * PC member for 34th International Conference on Collaborative Advances in Software and COmputiNg (CASCON'24), Nov 11-15, 2024. Past external activities: A partial list can be found here. Last modified: Thu Dec 15 16:02:37 EST 2022",
  "content_length": 5231,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:00"
}