{
  "name": "K. Anton Feenstra",
  "homepage": "http://www.few.vu.nl/~feenstra",
  "status": "success",
  "content": "Anton Feenstra Homepage Anton Feenstra Indoor My room at Bioinformatics where I am working with Prof. Jaap Heringa. Previous locations My old rooms at Bioinformatics Me & other members of my former group, the 'Design' group of Molecular Toxicology. A panoramic view of my old room at Groningen State University in the Netherlands. Where Am I? Dr. K. Anton Feenstra Associate Professor IBIVU/Bioinformatics Vrije Universiteit Amsterdam NU Building, Room 12A31 De Boelelaan 1111 1081A HV Amsterdam The Netherlands Tel: +31 20 59 87783 Mail: Feenstra@chem.vu.nl Web: www.few.vu.nl/~feenstra/ Science A list of my published scientific articles. A list of my scientific posters. My thesis (June 9 2002, 3.9Mb) Linked-in profile Things I do and did: (one could even consider this to be a resume...) Analyzing and (hopefully) predicting protein-protein interactions from sequence information, using coarse-grained and/or automated protein homology-model building at the Bioinformatics Section of the Faculty of Sciences of the Free University with Prof. Jaap Heringa. Exploring the balance between Conservation and Diversity in sequence comparison of protein families, using Sequence Harmony and a Feature Selection algorithm. Especially when functional differences are of interest, diversity may be more important than conservation. BMC Bioinf 16:325 (2015); NAR 38:W35 (2010); Bioinf 24:18 (2008) NAR 34:6540 (2006) Enabling large-scale calculation of Free Energy of Binding for Protein-Protein interactions, using coarse-grained forcefields. Bioinf (2014) 30:326.; JCC 33:1207 (2012) Modelling of signalling pathways and regulatory networks using Petri-net, a logical modeling formalism from Theoretical Computer Science. FMMB 2014; Bioinf 29:i80 (2013); LISC2013; FM'09. pp. 16-22; Bioinf 25:2049 (2009) Rationalizing and predicting stereo specificity of mutatant enzymes using (amongst others) molecular dynamics simulations, essential dynamics analysis, homology building, automated docking procedures and free energy calculations at the Free University in Amsterdam at the Pharmaochemistry group in the Chemistry Devision of the Faculty of Sciences. This also involves the Chemistry of Complex Molecules project, and the Leiden Amsterdam Centre for Drug Research. Papers published from 2004 till 2008. Hacking away at the Gromacs Molecular Dynamics program package source code. This is a highly sophisticated package featuring a high-performace single and multiple CPU simulation engine that is optimized for most of the current hardware platforms (GROMACS is a recursive acronym for \"Gromacs Runs On Most Of All Computer Systems\" :-), and various analysis tools, most of which are also fairly well optimized for performance, flexibility and user-friendliness. Contributing several sections to the Gromacs User Manual, mainly on the improved efficiency methods and the many Gromacs Analysis Tool manual pages. Supporting open source (code and standards). Read a vivid plea for both open and (human) readable file formats. Unraveling the riddles and mysteries of Protein Folding and Dynamics (which, in early 2002 has led to my PhD Thesis, 3.9Mb) at the Molecular Dynamics (MD) Group of the Biophysical Chemistry Department at the State University of Groningen (RuG) in the Netherlands. More precisely I am looking at specific features of protein hydrophobic cores which may be vital to a correct folding of the protein. Papers from 1998 till 2002. Study Molecular Sciences at Wageningen Agricultural University (WAU) in the Neterlands (I finished in august 1996): Mutating the Lipoyl-subdomain of A.vinelandii Pyruvate Dehydrogenase (at the Biochemistry Department of the WAU) Analyzing the Crystal Structure of Cowpea Chlorotic Mottle Virus Major Coat Protein (CCMV-MCP) (at the Molecular Physics Department of the WAU) Looking at protein-phosphate interactions in the N-terminal tail (25 amino-acids) of CCMV-MCP with Molecular Dynamics Simulations (at MD Group of the Biophysical Chemistry Department at the RuG in the Netherlands and the Molecular Physics Department of the WAU) (Biophys. J. 71, pp 2920-2932, 1996) Characterizing hydrophobicity of insoluble protein-aggregates during a work placement at the Agrotechnological Research Institute (ATO-DLO) Wageningen, supervised by the Biochemistry Department of the WAU. Play tennis in Lunteren (which is close to Barneveld). After having played it way back as a (pre-)teenager, I picked it up again somewhere around late 2004. I relished for some time in the aftermath of my PhD work (thesis (3.9Mb) is done, the defense was at July 5th, 2002). (But I'm over that, now. ;-) Educate people in being nice and helpful Writing scientific articles Used to ride the bike, mostly between Winsum (where I lived) and Groningen (where I worked). The route I took can be traced on a satellite image (90kb jpeg image) I have of the area. Now, I sometimes (only once up to now, due to construction works on the railroad) take the bike from Barneveld (where I live) to Amersfoort (where I continue by train to Amsterdam, where I work). Finding things on Internet. I could ofcourse include a host of links to search-engines here, but I won't because that takes the magic away. Play Dungeons & Dragons (Third Edition) with a group of friends from highschool. We started playing with this group somewhere around 1984 and we still play with the same 4 people who started except for some who dropped out and in in the meantime. Confuse my brain Hobby on my computer Some programming Making Fractals Gawking at Fractals Read: Fantasy novels J.R.R. Tolkien: The Hobbit The Lord of The Rings (and, yes I have seen the films! LOVE IT LOVE IT LOVE IT. By the way, I also once at high-school saw the cartoon-film of \"The Fellowship\", or was it \"The Hobbit\"... What should I say?) The Wheel of Time series (Robert Jordan): 1. The Eye Of The World 2. The Great Hunt 3. The Dragon Reborn 4. The Shadow Rising 5. The Fires Of Heaven 6. Lord Of Chaos 7. A Crown of Swords 8. The Path of Daggers 9. Winters Heart 10. Crossroads of Twilight 11. Knife of Dreams I wonder if this would be the last one? this is a must try for anyone who is afraid that all fantasy books after Tolkien inevitably look pale in comparison! To give you an indication: while reading \"The Eye of the World\" in the train, I failed to notice the emergency stop we made until we had been standing still with jammed brakes after well over an hour... Harry Potter (J. Rowling): 1. The Philosopher's Stone 2. The Chamber of Secrets 3. The Prisoner of Azkaban 4. The Goblet of Fire 5. The Order of the Phenix 6. The Half-Blood Prince 7. The Deathly Hallows Dune series (Frank Herbert), might also be called Science Fiction Shannarah series (Sword of ..., Elfstones of ..., etc., can't remember author) Deathgate series (Margareth Weiss & Tracy Hickmann * thanks Rabhin S. Jainandunsing) Lots of the Forgotten Realms and the Dragonlance series lots of others (you don't want me to list them all) (Hmm. Maybe this is too obvious. Everybody knows that D&D players read fantasy novels...) Science Fiction novels Arthur C. Clarke (I can't have missed many... ;-) Isaac Asimov (see note above) Stephen Baxter The Light Of Other Days (with Arthur Clarke) Space Time Origin several others Dune series (Frank Herbert), might also be called Fantasy The Hitchhikers Guide to the Galaxy -- DON't PANICK!!! -- (or should this be under Fantasy? Or should it have a nice category all of it's own, like Science Fantasy?) And, yes, I saw this film as well, and LOVED IT, leaving me in a state that I could only describe appropriately as flabberghasted... Now I'm waiting for the sequel(s?). some others, but most not nearly as good (This isn't too obvious, is it? I mean, not every fantasy freak also reads science fiction novels..., do they?) Other novels Wilbur Smith Birds of Prey Valey of Kings Blue Horizon several others Newspaper Scientific Section (NRC Handelsblad Wetenschap & Onderwijs) Scientific American Dutch Literary Novels Multatuli: Max Havelaar Harry Mulish: Siegfried De Procedure Ontdekking van de hemel (and, yes, I saw the film and LOVED IT - is this getting boring already?) Voer voor psychologen De Toekomst van Gisteren De Diamant Lots of others I can't remember the titles of not: De Aanslag Maarten 't Hart J. Bernlef Lots of others I can't remember Watch Star Trek: Original Series (nostalgia rules) The Next Generation (Where no-man, er... no-one, ah! Bugger!) Voyager - Damn! They actually made it... :-( Deep Space Nine (which unfortunately sometimes is too much soapy \"Bold and Beautiful\") Should I mention \"Enterprise\"? I've tried it a few times... O.K. That's about it, if you want or need more info, you can always contact me at feenstra@chem.vu.nl. This page was created using Emacs This page was optimized for ANY BROWSER Last modified: Tue Jan 19 12:05:28 CET 2016 feenstra@chem.vu.nl",
  "content_length": 8897,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:04"
}