{
  "name": "K. C. Sivaramakrishnan",
  "homepage": "https://kcsrk.info",
  "status": "success",
  "content": "KC Sivaramakrishnan · Building Functional Systems KC Sivaramakrishnan © 2008 - 2025. All rights reserved. KC Sivaramakrishnan Building Functional Systems I am an Assistant Professor in the Computer Science and Engineering department at Indian Institute of Technology, Madras and the Chief Technology Officer of Tarides. I am interested in building robust, secure and scalable systems using programming language technology. I led the development of Multicore OCaml, a concurrent and parallel extension of the OCaml programming language. Multicore OCaml is now merged into OCaml, and is available for general use in OCaml 5.0. Effect handlers introduced as part of the concurrency story of Multicore OCaml has had influence on the design of React Hooks and WebAssembly stack switching. I’ve co-founded several companies Tarides - France OCaml Labs Consultancy - UK (joined Tarides) Segfault Systems - India (joined Tarides) to build systems that are functional, and functional programming in OCaml turns out to be a fine choice for this. Earlier, I was a Senior Research Associate under the OCaml Labs initiative at the University of Cambridge Computer Lab, an 1851 Research Fellow and a Research Fellow at Darwin College, Cambridge. Earlier, I was a graduate student at Purdue University where I obtained an MS and a PhD degree in Computer Science under the supervision of the wonderful Prof. Suresh Jagannathan. Before that, I obtained my BEng degree in Computer Science and Engineering from Anna University, India. I write about my research in my blog (though not as often as I would like to). CV Research Statement Publications Latest News Tweets by kc_srk Activities DEI Co-Chair: ICFP 2025. SIGPLAN CARES committee member: 2025 – Streeing committee member: ICFP, Member at Large, serving 9/2023 – 9/2027 Principles and Practice of Consistency for Distributed Data (PaPoC) ML workshop, 2019 – 2022 Editor – JFP Special Issue on Effect Handlers Associate Editor: OOPSLA 2025. Organizer First OCaml Retreat at Auroville, 2024 Shonan meeting on “Programming Language support for Data-intensive Systems”, 2019 Dagstuhl meeting on “Effect Handlers go Mainstream!”, 2018 PC Chair – PROPL’25, PaPoC’22, ML’19 AEC Chair – ESOP’22 PC member 2025: FunArch’25, ICFP’25, PaPoC’25, APLAS’25 2024: OOPSLA’24, PaPoC’24, POPL’24, TFP’24, PEPM’24 2023: PLDI’23 2022: OCaml’22, ML’22, PEPM’22, PLDI’22 2021: GPCE’21, TyDe’21, PaPoC’21, PADL’21 2020: ICFP’20, PaPoC’20 2019: OCaml’19 2017: PMLDC’17, OBT’17 2016: OCaml’16 2013: Splash-MARC symposium ‘13. Expert Reviewer 2023: POPL’23, PPoPP’23 ERC member – ICFP’19 AEC member – ICFP’18, PPoPP/CGO’16, PLDI’15 Invited meetings Observer, WG 2.1, Viana do Castelo, Sep 2025 Guest, WG 2.8, Maine, 2025 Dagstuhl meeting on “Utilising and Scaling the WebAssembly Semantics”, 2025 Observer, WG 2.1, Canberra, 2024 (Declined due to personal reasons) Guest, WG 2.8, Utrecht, 2024 Dagstuhl meeting on “Foundation of WebAssembly”, 2023 Dagstuhl meeting on “Scalable handling of effects”, 2021 Dagstuhl meeting on “From Theory to Practice of Algebraic Effects and Handlers”, 2016 Contact Email : kcsrk@cse.iitm.ac.in (used for academic work), kc@tarides.com, kc@kcsrk.info IRL : SSB 413, IIT Madras Twitter : @kc_srk (aiming to use less of this in favour of ↓) Bluesky : @kcsrk.info Github : kayceesrk BitBucket : kayceesrk",
  "content_length": 3346,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:03"
}