{
  "name": "K. Hari Babu 0001",
  "homepage": "http://www.bits-pilani.ac.in/pilani/khari/profile",
  "status": "success",
  "content": "Hari Babu K - BITS Pilani Campus Header Institute Header Home Academics Integrated first degree B.E.(Manufacturing Engineering) M.Sc.(Mathematics) M.Sc.(Chemistry) M.Sc.(General Studies) M.Sc.(Biological Sciences) M.Sc.(Physics) M.Sc.(Economics) B.E.(Mechanical) B.E.(Civil) B.E.(Electronics and Instrumentation) B.E.(Electronics and Communication) B.E.(Electrical and Electronics) B.E.(Chemical) B.Pharm.(Pharmacy) B.E.(Computer Science) Higher Degree M.E.(Sanitation Science, Technology and Management) M.E. Chemical Engineering (with specialization in Petroleum Engineering) M.E.(Chemical) MBA(Master of Business Administration In Business Analytics) Master in Public Health M.Sc. General Studies – Communication and Media Studies Stream M.E. (Mechanical with specialization in Thermal Engineering) M.E.(Software Systems) M.E. M.Pharm M.Pharm.(Pharmacology) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmacy) M.E.(Design Engineering) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E.(Microelectronics) M.E.(Mechanical) M.E.(Manufacturing Systems Engineering) M.E.(Embedded Systems) M.E. Electronics & Control M.E.(Computer Science) M.E.(Communication Engineering) M.E. Civil – Water Resource Engineering M.E.(Civil with specialization in Transportation Engineering) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Biotechnology) M.E.(Environmental Engineering) Doctoral Programmes Pharmacy Physics Civil Engineering Computer Science & Information Systems Electrical & Electronics Engineering Biological Sciences Chemical Engineering Chemistry Economics & Finance Humanities & Social Sciences Mathematics Mechanical Engineering Management WILP Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Department Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Faculty Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Students Student Activities Events & Festivals BITScan BITS Embryo Picture Gallery Convocation 2025 BITS BEAT Student Achievements Student Services Academic Counseling Academic Document/Verification Requests Student Facilities Student Welfare Procedure for Issurance of Duplicate Degree Anti Ragging Scrutiny of Grades Information for Prospective Students Prevention of Sexual Harassment Centers Teaching Learning Centre Centre for Women’s Studies Centre for Entrepreneurial Leadership Centre for Desert Development Technologies Centre for Robotics and Intelligent Systems Technology Business Incubator Central Instrumentation Facility AI Centre Alumni Quick Links Academic Counselling Center Medical Center Library e-services Outreach IT Services Unit Central Workshop Campus Pilani Dubai K K Birla Goa Hyderabad BITSoM, Mumbai BITS Law School, Mumbai Links For BITS Library Admissions Faculty Practice School Placements Student Arena Career News Alumni Internationalization Events MOUs Current Students Invest in Leaders Outreach Picture Gallery Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions BITSAT IMPORTANT CONTACTS Pilani Dubai Goa Hyderabad RESEARCH & INNOVATION Overview Sponsored Research Projects Consultancy Based Projects Patents Publications R&D Centers DEPARTMENTS Pilani Dubai Goa Hyderabad Academics Integrated First Degree B.E.(Chemical) B.E.(Civil) B.E.(Computer Science) B.E.(Electrical and Electronics) B.E. (Electronics and Computer ) B.E.(Electronics and Communication) B.E.(Electronics and Instrumentation) B.E.(Manufacturing Engineering) B.E.(Mechanical) B.Pharm.(Pharmacy) M.Sc.(Biological Sciences) M.Sc. Semiconductor and Nanoscience B.E. Environmental and Sustainability Engg. M.Sc.(Chemistry) M.Sc.(Economics) M.Sc.(General Studies) M. Sc. (Mathematics) M.Sc.(Physics) B. E. (Mathematics and Computing) Higher Degree MBA (Master of Business Administration) M.E.(Electrical with specialization in Power Electronics and Drives) M.E. Civil – Water Resource Engineering MBA (Master of Business Administration) MBA (Master of Business Administration in Business Analytics) M.E.(Communication) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E. (Mechanical with specialization in Thermal Engineering) M.E. Electronics & Control M.E. M.Pharm M.E.(Biotechnology) M.E.(Chemical) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Transportation Engineering) M.E.(Computer Science) M.E.(Design Engineering) M.E.(Embedded Systems) M.E.(Manufacturing Systems Engineering) M.E.(Mechanical) M.E. Environmental engineering M.E.(Microelectronics) M.E.(Sanitation Science, Technology and Management) M.E.(Software Systems) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmacology) M.Pharm.(Pharmacy) M.Sc. General Studies – Communication and Media Studies Stream Master in Public Health MBA(Master of Business Administration In Business Analytics) Doctoral Programmes Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities & Social Sciences Management Mathematics Mechanical Engineering Pharmacy Physics General Sciences WILP Dubai Campus Integrated First Degree Higher Degree Doctoral Programmes Explore BITS About Legacy Achievements Social Responsibility Sustainability Divisions Pilani Dubai K K Birla Goa Hyderabad Mumbai Pilani K K Birla Goa Hyderabad Dubai follow us Feedback Give us your feedback If you notice any issues or missing content, please let us know. Your feedback helps us improve. Thank you. Upload Screenshot Hari Babu K Pilani Computer Science Associate Professor, Department of Computer Science & Information Systems, BITS Pilani, Pilani Campus Location management and maintenance in P2P overlay networks, Resilience in P2P networks, Security issues in P2P overlay networks Room No: 6121-M, New Academic Building, Department of Computer Science & Information Systems, Birla Institute of Technology & Science, Pilani- 333031, Rajasthan. India. khari@pilani.bits-pilani.ac.in Phone:+91-1596-255405 (Off) | 255813 (Desk) Fax:+91-1596-244183 About Prof. Haribabu Kotakula received his PhD degree in Computer Science from Birla Institute of Technology & Science, Pilani, Rajasthan, India in 2013. He is currently working as Associate Professor at BITS Pilani. His research interests include Software Defined Networking, Programmable Networks, IoT, Edge and Cloud computing. He teaches courses such as Cloud Computing, Parallel Computing, Network programming, Database Systems, Computer Programming, Objet-oriented Programming etc. He has actively participated in institutional development activities at BITS Pilani, Pilani campus by leading several projects to modernize and automate its several academic activities. He leads the Software Defined Networking (SDN) Laboratory of the Department of CSIS, BITS Pilani, Pilani Campus. Click here for personal webpage Professional Memberships Senior Member, IEEE Member, ACM Old Website Loading... Keep Exploring Admission News Alumni Academics Admission Campus University Home K K Birla Goa Pilani Hyderabad Dubai BITSoM, Mumbai BITSLAW, Mumbai Faculty Explore Home Academics Integrated first degree Higher Degree Doctoral Programmes WILP Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions Research & Innovation R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts Department Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Faculty Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities and Social Sciences Mathematics Management Mechanical Engineering Pharmacy Physics Students Student Activities Student Services Centers Teaching Learning Centre Centre for Women’s Studies Centre for Entrepreneurial Leadership Centre for Desert Development Technologies Centre for Robotics and Intelligent Systems Technology Business Incubator Central Instrumentation Facility AI Centre Alumni Quick Links Academic Counselling Center Medical Center Library e-services Outreach IT Services Unit Central Workshop Cookie Consent This website uses cookies or similar technologies, to enhance your browsing experience. Accept",
  "content_length": 9352,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:10"
}