{
  "name": "K. Harald Gjermundrød",
  "homepage": "https://www.unic.ac.cy/gjermundrod-harald",
  "status": "success",
  "content": "Professor Harald Gjermundrod - University of Nicosia Skip to content APPLY Professor Harald Gjermundrod Professor Harald Gjermundrod Professor School of Sciences and Engineering Department of Computer Science 22841729 [email protected] Central Building›2nd Floor›B224 Brief CVFull CV Research Profile https://orcid.org/0000-0003-1421-5945 Google Scholar Harald Gjermundrød is currently a Professor of Computer Science in the Department of Computer Science at the University of Nicosia, which he joined in September 2008. Prior to this, he was a post-doctorate associate (2006-2008) at the High-Performance Computing Systems Laboratory in the Computer Science Department of the University of Cyprus. Gjermundrød received his PhD, MS, and BS degrees in computer science from Washington State University in 2006, 2001, 1999 respectively and Dipl.-Ing degree from Oslo Metropolitan University in 1998. His research interests include Distributed Computing Systems, Computer Security, Cyber Security, Data Protection, and Blockchain Technology. He is a co-director of the Informatics Security Laboratory at University of Nicosia that is conducting research on active defense and data protection. Gjermundrød has worked on projects funded by the EU, the National Institute of Technology(US), and the National Science Foundation(US). During his involvement in research projects, he heavily assisted in the development of various software products, including GridStat (middleware product critical infrastructures), ICGrid (storage and sharing of medical data using Grid infrastructure), g-Eclipse (Eclipse technology project for using, developing, and managing Grid infrastructure), and ReProTool (tool for assisting Universities in program development using Learning Outcomes and ECTS). In addition, he has supervised students (at the undergraduate and graduate level) who developed prototype software like MapQFTool, NoteLocker, HoneyCY, and privacyTracker. Gjermundrød has co-authored more than 50 peer reviewed scientific publications, served on the program committee for more than 70 scientific conferences and has been a reviewer for several scientific journals. He has also given conference keynote presentations, served on conference panels, served as conference session chair, and moderated panel. He was elevated to committer status for the Eclipse open source project, and is currently listed as an Eclipse alumni. He is also a senior member of ACM and was the chair of the ACM Cyprus chapter from 2015 until 2018. UNIC NICOSIA46 Makedonitissas Avenue, CY-2417P.O. Box 24005, CY-1700Nicosia, CyprusPhone.: +357 22 841500Email: [email protected] UNIC ATHENSNo. 17, 29th StreetElliniko 167 77Athens, GreecePhone:  +30 210 6748293Email: [email protected] USEFUL LINKSAll Academic ProgrammesUNIC Brand CentreUNIC in the NewsVerify a CertificateCareers at UNIC CONNECT WITH UNICSubscribe to NewslettersCopyright © University of Nicosia. All Rights Reserved | Privacy Policy | Terms & Conditions Page load link Live chat is available. Activate it by agreeing to the use of marketing cookies here. Please refresh the page after activation. × Go to Top",
  "content_length": 3146,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:10"
}