{
  "name": "K. K. Ramakrishnan",
  "homepage": "http://www.cs.ucr.edu/~kk",
  "status": "success",
  "content": "Prof. K. K. Ramakrishnan's Research Lab. | WE ENGINEER EXCELLENCE Welcome to KK's Networked Systems Group at UC Riverside! I work on Network Architecture, Protocols and Systems. Our group's current research at UCR includes Software Based Networks, Cloud Computing, Network Resilience, Information Centric Networking for Disaster Management, and Cellular Networks for 5G and Beyond. Latest News Paper by Federico, Shixiong and Anvaya published in SOCC 2024 Paper by Federico, Shixiong and Anvaya published in SOCC 2024 Paper by Hongmiao, Shaoyu and others accepted for IEEE MILCOM 2024 Paper by Hongmiao, Shaoyu (Kevin) and others accepted for IEEE MILCOM 2024 Shixiong successfully defended his PhD Defense. Congrats Dr. Qi! Commencement 2024, PhD Hooding Ceremony: Dr. Qi, Dr. Ramakrishnan, Dr, Liri. K. K. Ramakrishnan winner of 2024 ACM SIGCOMM Award for Lifetime Contribution It is with great happiness and humility that I convey the news that the ACM Sigcomm Awards committee chose me for the annual ACM SIGCOMM Award for Lifetime Contributions. I'm very honored and grateful for being chosen this year. The announcement can be seen on the ACM Sigcomm web site. Shixiong will be joining the Department of Computer Science at the University of Kentucky in fall 2024 as an assistant professor. Congrats Shixiong! Shixiong will be joining the Department of Computer Science at the University of Kentucky in fall 2024 as an assistant professor. Congrats Shixiong! Paper by Anvaya, Federico and others accepted for IEEE LANMAN 2024 Paper by Anvaya, Federico and others accepted for IEEE LANMAN 2024 Paper by Shixiong and others accepted for IEEE Internet Computing Paper by Shixiong and others accepted for IEEE Internet Computing:\"L26GC: Evolving the Low Latency Core for Future Cellular Networks\"Abstract—With the deployment of higher-speed radio (e.g., millimeter wave) channels, emerging cellular use cases will place a heightened emphasis on performance of the cellular core (we call it ‘6GC’). Based on our earlier work on designing a low-latency, high-throughput 5G cellular core, we outline a design for L26GC, a 6G cellular core preserving the current trend to disaggregate core network functions (NFs) while ensuring low-latency communication between them. L26GC leverages shared memory processing for low-latency control plane communication, providing an equivalent service to the 3GPP Service Based Interface (SBI), and supports information exchange between NFs for each user session. L26GC offloads data plane processing to SmartNICs, exploiting scalable, flow-level packet classifiers to expedite forwarding-rule lookups when dealing with multiple user sessions. Overall, L26GC optimizes the cellular core, improving latency, scalability, and the user’s quality of experience. Paper by Shixiong and others accepted for MLSys 2024 Please visit this link for the paper. Our team led by AT&T, Verizon and others has been selected by the National Telecommunications and Information Administration (NTIA) for the $42 million grant to support the development of open and interoperable wireless networks! We are really pleased that our team led by AT&T, Verizon and others has been selected by the National Telecommunications and Information Administration (NTIA) for the $42 million grant to support the development of open and interoperable wireless networks. We are glad to be joining the Acceleration of Compatibility and Commercialization for Open RAN Deployments (ACCoRD) consortium that will conduct testing, evaluation and certification of O-RAN equipment.We are looking forward to collaborating on this exciting National Telecommunications and Information Administration (NTIA) project with Tracy Van Brakle, Ivan Seskar and the rest of the team at AT&T, Verizon, Rutgers University, NYU WIRELESS, Columbia Engineering and several partner organizations. UCR will be providing a unique test environment for ACCoRD, testing higher layer protocols and applications. This will build on our long-standing collaboration with AT&T, Rutgers WINLAB and others on the US NSF supported research on Track G: Securely Operating Through 5G Infrastructure to advance 5G communications for the U.S. government and critical infrastructure operators. Prof. K. K. has been invited to serve as IEEE MASS’24 General Co-Chair. Please consider submitting! Prof. K. K. has been invited to serve as IEEE MASS’24 General Co-Chair. Please consider submitting! Paper by Shixiong and others accepted for IEEE/ACM Transactions on Networking Paper by Shixiong and others accepted for IEEE/ACM Transactions on Networking Prof. K. K. was selected as one of the Indian Institute of Science Distinguished Alumni for the Year 2023 and the ceremony was held on Dec. 2, 2023. The link to the announcement is: \"IISc announces Distinguished Alumni Awards 2023\". There were several news articles regarding this in newspapers in India. Some of the links are: Deccan Herald: \"IISc to honour 5 distinguished alumni for 2023\" The Hindu: \"IISc announces distinguished alumni awards for 2023\" The Economic Times: \"Ex-Infoscion, ISRO Chairman among five chosen for IISc's Distinguished Alumni Awards\" Dr. Elizabeth Liri will join the Department of Computer Science at Saint Louis University as a PostDoc. Congrats Dr. Liri! Dr. Elizabeth Liri will join the Department of Computer Science at Saint Louis University as a PostDoc. Congrats Dr. Liri! Elizabeth successfully defended her PhD Defense. Congrats Dr. Liri! Elizabeth successfully defended her PhD Defense. Congrats Dr. Liri! Paper by Hongmiao and others accepted for IEEE ICNP 2023 Paper by Hongmiao and others accepted for IEEE ICNP 2023 Paper by Shixiong and others accepted for IEEE CloudNet 2023 In this work, we develop L25GC+. L25GC+ is a re-architected 5G Core (5GC) network, aimed at reducing latency and improving user experience. L25GC+ focuses on minimizing the impact of control plane operations on the data plane, while also enhancing data plane processing. It achieves this by exploiting shared memory (based on OpenNetVM), eliminating message serialization and HTTP processing overheads in 3GPP SBI, and using scalable packet classifiers for forwarding-rule lookups. L25GC+ re-designs OpenNetVM's shared-memory-based networking stack to support synchronous I/O between control plane functions, which allows it to distinguish different user sessions and maintains strict 3GPP compliance. L25GC+ also offers seamless integration with existing 5GC microservice implementations through equivalent SBI APIs, reducing code refactoring and porting efforts. Additionally, L25GC+ implements paging and an intelligent handover scheme to reduce delays and data loss. It also offers integrated failure resiliency for faster recovery from failures compared to standard 3GPP procedures. L25GC+ is built on the open-source kernel-based 5GC implementation called free5GC. By leveraging shared memory I/O, L25GC+ optimizes the 5G control plane, enhancing latency, scalability, and overall user experience. L25GC+ achieves 2X lower data plane latency for paging and handover events compared to free5GC. We demonstrate the improved performance of L25GC+ on a 5G testbed with commercial basestations and UEs. The code of L25GC+ is open-sourced at: https://github.com/nycu-ucr/L25GC-plus.git. Paper by Shixiong and others accepted for IEEE NetSoft 2023 Paper by Shixiong and others accepted for IEEE NetSoft 2023 Sourav successfully defended his PhD Defense. Congrats Dr. Panda! Sourav successfully defended his PhD Defense. Congrats Dr. Panda! Paper by Shixiong and others accepted for IEEE TNSM (2023) Paper \"MiddleNet: A Unified, High-Performance NFV and Middlebox Framework with eBPF and DPDK\" by Shixiong and others accepted for IEEE TNSM. Current research areas •    Software-based Networks: NFV, Resilient SDN,  Agile Computing •    Cloud Computing, including lightweight serverless computing •    Edge Clouds: system support for Machine Learning at the edge; support for latency-sensitive applications •    Cellular Networks, 5G & Beyond: cellular core network, traffic monitoring, securing the cellular network. •    Information Centricity in support of disaster management Let us help you with your search × Enter your Search Criteria Search Cancel",
  "content_length": 8278,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:13"
}