{
  "name": "K. Sreenivasa Rao",
  "homepage": "https://cse.iitkgp.ac.in/~ksrao",
  "status": "success",
  "content": "Prof. K. Sreenivasa Rao | Professor | CSE | IIT Kharagpur × Share it Share it box content Toggle navigation Prof. K.Sreenivasa Rao Biography Research Courses Publications Projects Students Prof. K. Sreenivasa Rao Professor, Department of Computer Science & Engineering Indian Institute of Technology, Kharagpur Biography Welcome to my website Presently I am Professor in the Department of Computer Science & Engineering, IIT Kharagpur. For the last 18 years I have been working on signal processing and machine learning aspects, targeted to mainly speech applications. In collaboration with Govt. of India (DIT, MCIT, DST) and other premium technological institutes of India, we have developed various speech systems in Indian languages. During the initial period of my career my focus was on acquisition and incorporation of prosody for developing various speech systems. Later my focus has been shifted to (i) expressive speech analysis/synthesis, (ii) development of robust speech systems, (iii) vocal folds activity analysis and syntheis in view of speech and biomedical applications, (iv) development of appropriate signal processing methods to extract the characteristic features from Hindustani music and (v) big-data analysis framework and audio and multimedia analytics. My current focus is on (i) development of robust speech interfaces in the context of Indian languages targeted to the objectives such as E-Governance, Digital India and Smart phones, (ii) Exploring signal processing and machine learning paradigms for automatic processing of Hindustani music and (iii) Exploring big-data analytics for speech, music, audio and video document representation, indexing and retrieval tasks. Courses Offered in this Semester Advanced Topics in Speech Processing (CS60116) Database Management Systems (CS30202) Contact details Department of Computer Science & Engineering (CSE) 2nd Floor, Takshashila Building IIT Kharagpur Kharagpur - 721302, India. Phone: 91-3222-282336 Fax: 91-3222-255303 Email: ksrao@iitkgp.ac.in",
  "content_length": 2026,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:14"
}