{
  "name": "K. V. Subrahmanyam 0001",
  "homepage": "http://www.cmi.ac.in/~kv",
  "status": "success",
  "content": "Home page of K. V. Subrahmanyam Hello Office Address Chennai Mathematical Insitute, SIPCOT IT PARK, Padur PO, Siruseri, Chennai 600103, INDIA Residence H-3 Block III, Shivani Apartments, 40, ECR, Thiruvanmiyur, Chennai, 600041 India. +91-(44)-7196 1028 (Off.) +91-9445390492 (Mobile), Reply to: kv@cmi.ac.in Recent Publications Somnath Dake, S Senthamarai Kannan, K V Subrahmanyam Torus Quotients of Flag Varieties - a Computational Approach Based on Lattice Basis, 2022, (submitted) Bharat Adsul, Milind Sohoni, K V SubrahmanyamGeometric Complexity Theory- Lie Algerbaic Methods for Projective Limits of Stable Points, 2022 Sandesh Kamath, Amit Deshpande, K V Subrahmanyam, Vineeth Balasubramanian Universalization of Any Adversarial Attack using Very Few Test Examples , (Accepted) CODS-COMAD, Bangalore, 2021 Sandesh Kamath, Amit Deshpande, K V Subrahmanyam, Vineeth Balasubramanian Can we have it all? On the trade-off between spatial and adversarial robustness of neural networks , (Accepted), NeurIPS 2021 Sandesh Kamath, Amit Deshpande, K V Subrahmanyam Invariance versus Robustness of Neural Networks, arxiv.org/abs/2002.11318, 2020 Sarjick Bakshi, Senthamarai Kannan, K V Subrahmanyam Torus quotients of Richardson varieties in the Grassmannian,; Communications in Algebra, 2019; Sarjick Bakshi, Senthamarai Kannan, K V Subrahmanyam Smooth torus quotients of Schubert varieties in the Grassmannian (preprint under review) Muthuvel Murugan, K V Subrahmanyam SO(2) equivariance in neural networks using Fourier nonlinearity, 30th British Machine Vision Conference, 2019, Cardiff; Sandesh Kamath, Amit Deshpande, K V Subrahmanyam On adversarial robustness of small versus large batch training,ICML 2019 Workshop \" On Understanding and Improving Generalization in Deep Learning\", Long Beach, California, 2019; Sandesh Kamath, Amit Deshpande, K V Subrahmanyam Better generalization with adaptive adversarial training,ICML 2019 Workshop \" On Understanding and Improving Generalization in Deep Learning\",Long Beach, California, 2019; Link to Publications Google Scholar Geometric Complexity Theory Slides of an overview talk given in Sept 2007; Seminar series on recent progress in GCT, April 2020 - Teaching 2020 Jan-Apr ;",
  "content_length": 2225,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:17"
}