{
  "name": "Ka-Chun Wong",
  "homepage": "http://www.cs.utoronto.ca/~wkc",
  "status": "success",
  "content": "Ka-Chun Wong (University of Toronto) Top menu: Active tab | Second | Third | Fourth Ka-Chun Wong Stanford's top 2% most highly cited scientists (2025 Aug, Version 8) Stanford's top 2% most highly cited scientists (2024 Sep, Version 7) Stanford's top 2% most highly cited scientists (2023 Oct, Version 6) Stanford's top 2% most highly cited scientists (2022 Nov, Version 5) Sample navigation menu: Biography | Philosophy | ResearchGate | Biography PhD Student / PostDoc Recruitment (*self-financing MPhil/PhD is particularly welcomed and prioritized) @ City University of Hong Kong (We are recruiting NOW !!!) (PhD admission deadline: Early December every year) Please put down \"Ka-Chun Wong\" as your potential supervisor in your applications; otherwise, your applications may not reach us. More than 2000 USD can be provided to each fully funded PhD student in Hong Kong every month. Very Top PhD or even PostDoc applicants are encouraged to apply for the Hong Kong PhD Fellowship Scheme which will give at least 3500 USD per month for at least 3 years. Biography Ka-Chun was born and raised in Hong Kong where he was lucky enough to be immersed in a multi-cultural environment. He received his B.Eng. in Computer Engineering from United College, The Chinese University of Hong Kong in 2008. He has also obtained his M.Phil. degree in the Department of Computer Science and Engineering at the same university in 2010. From 2011 to 2014, he has spent 3.5 years to finish his PhD degree in the Department of Computer Science at the University of Toronto. With exposures to different aspects (academic, industrial, spiritual ,and social), he hopes to strike a balance and contribute to the society. News: Right after his PhD study, Ka-Chun has started his research lab (web page) in the Department of Computer Science, City University of Hong Kong (4th in QS World University Ranking aged under 50 and 5th in Times University Ranking aged under 50) in 2019/2020. Interested applicants can contact him via email. Especially, PhD applicants are highly encouraged to apply for the Hong Kong PhD Fellowship Scheme (USD$ 3600 per month (tax free)). The scheme is real merit-based and does not have any preference toward nationality, which reflects the open humanity and freedom of Hong Kong. Here are some facts about Hong Kong: Average IQ: 108, according to Richard Lynn and Tatu Vanhanen . Human Deveopment Index (HDI) is 0.933 according to the United Nations in 2017. Students are consistently ranked among the top 3 with Finland and Shanghai according to the Programme for International Student Assessment (PISA) in 2012. The official language of teaching in universities is English, while Cantonese and British English are commonly used outside schools. It is pretty sure that students will find their studies challenging and enjoyable there. Drone Video About Hong Kong: Research Interests Computational Intelligence Data Science Artificial Intelligence Natural Computing Computational Science High-Impact Interdisciplinary Research Edited Books [Book 4] Ka-Chun, Wong. Epistasis: Methods and Protocols. [Content: 23 Peer-Reviewed Book Chapters with 46 authors from Australia, Brazil, Canada, China, Denmark, Germany, Hong Kong SAR, India, Netherlands, Singapore, Spain, USA] Methods in Molecular Biology series (Springer, New York). 2020 [Book 3] Xiangtao Li, Ka-Chun Wong: Natural Computing for Unsupervised Learning., Book Series under Unsupervised and Semi-Supervised Learning, Springer (New York) 2019 [Book 2] Ka-Chun Wong: Big Data Analytics in Genomics. Springer (New York) 2017 (Content: 13 Peer-Reviewed Book Chapters with 46 Authors from Argentina, Brazil, China, France, Germany, Hong Kong, India, Japan, Spain, USA) [Book 1] Ka-Chun Wong: Computational Biology and Bioinformatics: Gene Regulation. CRC Press (Taylor & Francis Group) 2016 (Content: 17 Peer-Reviewed Book Chapters with 52 Authors from Australia, Belgium, Brazil, Egypt, Germany, Hong Kong, India, Japan, USA) Teaching Course Leaderships In Hong Kong, CS8695 : Research in Computer Science (Seasonal) CS4465 : Computational Biology and Bioinformatics (Spring 2015-now) CS4480 : Data-Intensive Computing (Fall 2018-now) CS5488 : Big Data Algorithms and Techniques (Fall 2018-now) GE1319 : Interdisciplinary Research for Smart Professionals (Seasonal) GE2324 : The Art and Science of Data (Fall 2015-2017) Teaching Assistantships In Toronto, CSC108 : Introduction to Computer Programming (Fall 2011) CSC209 : Software Tools and Systems Programming (Summer 2013) CSC263 : Data Structures and Analysis (Spring 2012) CSC309 : Programming on the Web (Spring 2014, Summer 2014) CSC343 : Introduction to Databases (Fall 2012, Spring 2013, Fall 2013) CSC401/2511 : Natural Language Computing (Spring 2013) In Hong Kong, CSC3420 : Computer System Architectures (Spring 2009, Spring 2010) Awards / Achievements 2025 Stanford's top 2% most highly cited scientists 2025 Aug 2025 CityU Long Service Award 2025 Springer Nature Editorial Contribution Award 2025 Hong Kong Convention Ambassador 2025 Elected Governor (APNNS) 2024 Stanford's top 2% most highly cited scientists 2024 Sep 2023 ISCMI 2023 Excellent Presentation Award 2023 Stanford's top 2% most highly cited scientists 2023 Oct 2023 Elected Governor (APNNS) 2023 ITF FBL Fund, Hong Kong (First CityU Faculty Ever in History to be Awarded) 2022 Stanford's top 2% most highly cited scientists 2022 Nov 2021 CMES Reviewer Award 2020 (2 Awards in 2020) 2020 Health and Medical Research Fund, Hong Kong (First CS Faculty Ever in History to be Awarded) 2019 Outstanding Supervisor Award, City University of Hong Kong (24 awards in 2019) 2019 ACM Distinguished Speaker Program (2019-2022) 2018 General Research Fund, Research Grant Council (Hong Kong, 57 out of 175 CS professors) 2017 General Research Fund, Research Grant Council (Hong Kong, 56 out of 188 CS professors) 2016 Early Career Scheme, Research Grant Council (Hong Kong, largest ECS grant in CS area) 2015 Assistant Professorship without any Posdoc Placement, City University of Hong Kong 2013 Acres - Joseph Yonan Memorial Fellowship, Computer Science, University of Toronto 2012 Kwok Sau Po Scholarship, School of Graduate Studies, University of Toronto 2012 Acres - Joseph Yonan Memorial Fellowship, Computer Science, University of Toronto 2011-2014 International Research and Teaching Assistantship, University of Toronto 2010 Provost Award. Office of the Provost, KAUST 2007 Dean List, Engineeirng, The Chinese University of Hong Kong 2007 Chiu Fuk San Prize, United College, The Chinese University of Hong Kong 2005 Multiple Scholarships for HK A-level, Concordia Lutheran School 2004 Championship, Computer Game Concept Competition, Sha Tin IVE 2003 Multiple Scholarships for HKCEE, Concordia Lutheran School Recent Open Software Contributions MotifHyades FullSignalRanker SignalSpider SNPdryad kmerHMM LatticeModel Journal Associate Editorship (Sorted by Date) npj Artificial Intelligence (2025-now) IEEE Journal of Biomedical and Health Informatics (2025-now) IEEE Transactions on Computational Biology and Bioinformatics (2025-now) Computational and Structural Biotechnology Journal (2023-now) Heliyon [Cell Press] (2023-now) Frontiers in Genetics (2021-now) Computer Modeling in Engineering and Sciences (2019-now) BioData Mining (2016-now) Journal Editorial Board Memberships (Sorted by Date) International Journal of Data Science and Analytics (2021-now) Journal of Biomedical Informatics (2021-now) PeerJ Computer Science (2020-now) Applied Soft Computing (2016-now) Conference Chairships (Sorted by Date) CVCI 2025 (Program Co-Chair) DSIT 2025 (Program Co-Chair) ISCMI 2025 (Publication Co-Chair) ISMSI 2025 (Publicity Co-Chair) ICONIP 2025 (Area Chair) WI-IAT 2024 (Publicity Co-Chair) CVCI 2024 (Program Co-Chair) DSIT 2024 (Publication Co-Chair) ISCMI 2024 (Publicity Co-Chair) ISMSI 2024 (Organizing Co-Chair) ICCBB 2024 (Program Co-Chair) BDSIC 2024 (Program Co-Chair) DMCIT 2024 (Conference Co-Chair) DSIT 2023 (Publication Co-Chair) ISCMI 2023 (Publicity Co-Chair) ISMSI 2023 (Organizing Co-Chair) DSIT 2022 (Publication Co-Chair) ISCMI 2022 (Publicity Co-Chair) ISMSI 2022 (Organizing Co-Chair) ICONIP 2021 (Session Chair) WSPML 2021 (Conference Co-Chair) IEEE ICCCS 2021 (Session Chair) DSIT 2021 (Publication Co-Chair) ISMSI 2021 (Organizing Co-Chair) ISCMI 2021 (Publicity Co-Chair) ICCR 2020 (Session Chair) DSIT 2020 (Publication Co-Chair) ICONIP 2020 (Publicity Co-Chair) ICONIP 2020 (Session Chair) ISCMI 2020 (Program Co-Chair) ISMSI 2020 (Program Co-Chair) DSIT 2019 (Publication Co-Chair) ISCMI 2019 (Program Co-Chair) ISMSI 2019 (Publicity Co-Chair) ISNN 2019 (Registration Co-Chair) DSIT 2018 (Publication Co-Chair) ICIST 2018 (Registration Co-Chair) ICONIP 2018 (Registration Co-Chair) ISCBI 2018 (Program Co-Chair) ISCMI 2018 (Publication Co-Chair) ISMSI 2018 (Program Co-Chair) ISNN 2018 (Registration Co-Chair) ICIST 2017 (Registration Co-Chair) ISCBI 2017 (Program Co-Chair) ISCMI 2017 (Program Co-Chair) ISMSI 2017 (Organizing Chair) ISNN 2017 (Registration Co-Chair) ICICIP 2016 (Regisration Co-Chair) ISCBI 2016 (Publication Co-Chair) ISCMI 2016 (Program Co-Chair) ISCBI 2015 (Publication Co-Chair) IEEE SMC 2015 (Session Chair) Conference Invited Talks (Sorted by Date) CECNet2025 (Keynote Speech) TISS 2025 (Invited Speech) IEEE CIS Winter School on Computational Intelligence and Generative AI 2025 (Keynote Speech) DSIT 2023 (Keynote Speech) ISMSI 2023 (Keynote Speech) ICBRA 2022 (Invited Speech) HKU 2022 (Invited Seminar) APSCIT 2021 (Keynote Speech) Lingnan University 2021 (Invited Seminar) APNNS/IEEE-CIS Education Forum Series: DLAI5 Summer School 2021 (Invited Speech) ICBBB 2021 (Invited Speech) IEEE BigData 2020 (Tutorial 1) HSE Summer School on Machine Learning in Bioinformatics 2020 (Invited Lecture) BDE 2020 (Invited Speech) DSIT 2019 (Plenary Speech) IC-LYCS 2019 (Keynote Speech) ISACIT 2018 (Keynote Speech) IWSG 2018 (Invited Speech) HKU & ND Workshop 201",
  "content_length": 14349,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:18"
}