{
  "name": "Kahyun Choi",
  "homepage": "http://kahyunchoi.com",
  "status": "success",
  "content": "Kahyun Choi's Home – Kahyun Choi's Research Skip to content No results Is It Singing, Narrating, or Something In Between? Comparative Analysis of Poetry Reading Audio In this project, we developed a few signal processing algorithms to analyze the acoustic characteristics of poetry reading in comparison to singing voice and narration. We found that poetry recitation contains some unique acoustic patterns that are different from singing and narration. More information Computational Analysis of Poetry Unbiased AI for Poetry Analysis: Toward Equitable and Diverse Digital Libraries In this Early Career Research Development project funded by IMLS, I develop an open-source AI framework for digital libraries to explore, curate, and analyze large collections of digitized poetry texts, which includes a development of an unbiased AI model that understands poetry More information What Is This Song Really About? Computational Lyricology Song lyrics and poetry contain multiple layers of meaning, often misleading machines that attempt to understand it. We developed a community-driven data enrichment framework, which actively harmonizes human readers’ understanding of those hard-to-understand text documents into the supervised machine learning framework. Yes, we are still better than them. More information Iâm looking for PhD students! If youâre interested in my research areas, please apply to our PhD program and mention my name in your application. About Me Kahyun Choi is an Assistant Professor in the School of Information Sciences at the University of Illinois at Urbana-Champaign. She earned her Ph.D. from the School of Information Sciences at the University of Illinois at Urbana-Champaign. Before pursuing her Ph.D., she worked as a software engineer at Naver, an Internet portal in Korea. Kahyun Choiâs research interests involve the application of computational methods and machine learning algorithms to various modalities, including audio and text. Her expertise is at the intersection of technology and the humanities, focusing on ethical AI workflows for Libraries, Archives, and Museums (LAMs), music information retrieval, public library-based AI education programs, and computational poetic text analysis. As a researcher and educator, she has been recognized with several prestigious awards and fellowships, including the 2023 IU Trustees Teaching Award, the 2022 Institute of Museum and Library Services (IMLS) Early Career Research Development Project Grant, the 2021 IMLS National Leadership Grant, and the 2021 Luddy Faculty Fellowship. Contact 501 E. Daniel St. MC-493Champaign, IL61820-6211kahyun AT illinois DOT edu",
  "content_length": 2654,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:19"
}