{
  "name": "Kai H. Chang",
  "homepage": "http://www.eng.auburn.edu/~kchang",
  "status": "success",
  "content": "Kai-Hsiung Chang Kai H. Chang, Ph.D. Professor Department of Computer Science and Software Engineering 3101 Shelby Center for Engineering Technology Auburn University Auburn, AL 36849-5347 Phone: (334) 844-6310 Email: changka@auburn.edu Fax: (334) 844-6329 EDUCATION Diploma Electrical Engineering, Taipei Institute of Technology, 1977 M.S. Electrical and Computer Engineering, Univ. of Cincinnati, 1982 Ph.D. Electrical and Computer Engineering, Univ. of Cincinnati, 1986 EXPERIENCE 1977 - 1979 Second Lieutenant, Chinese Army, Taiwan 1979 - 1981 Microcomputer Applications Design Engineer, Pan-Asia Elec. Co., Taipei, Taiwan 1981 - 1982 Electronics Advisor, Dept. of Anesthesia, Medical Center of the Univ. of Cincinnati 1983 - 1986 Research Assistant and Computer System Manager, Artificial Intelligence and Computer Vision Laboratory, University of Cincinnati 1986 - 1991 Assistant Professor, Department of Computer Science and Engineering, Auburn University 1995 Summer, Faculty Research Fellow, Marshall Space Flight Center, NASA, Huntsville, AL 1991 - 1998 Associate Professor, Department of Computer Science and Engineering, Auburn University 1998 - present Professor, Department of Computer Science and Software Engineering, Auburn University 2004 ¡V 2009 Alumni Professor, Department of Computer Science and Software Engineering, Auburn University 2006 ¡V 2016 Chair, Department of Computer Science and Software Engineering, Auburn University SPECIALTY AREAS Software testing, Software comprehension and visualization tools, Software complexity metric, Information assurance education, Computer supported cooperative work, Artificial Intelligence. CURRENT RESEARCH Testing object-oriented software using usage profiles and formal specifications Software comprehension through complexity profile Information Assurance Education ¡V sponsored by NSF and DoD NSF Research Experience for Undergraduates (REU) - Pervasive and Mobile Computing o Summer research opportunities (2006 2007, and 2008) MORE INFORMATION Publications Graduate Students Professional Services Honors Complete Resume Go back to Computer Science and Software Engineering Department",
  "content_length": 2157,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:23"
}