{
  "name": "Kai Zheng 0001",
  "homepage": "http://zheng-kai.com",
  "status": "success",
  "content": "Kai Zheng's Homepage Kevin Kai Zheng (郑 凯) Professor School of Computer Science and Engineering University of Electronic Science and Technology of China (UESTC) My Google Scholar Page | My DBLP Page | My UESTC Homepage Email: zhengkai@uestc.edu.cn Address: Qingshuihe Campus:No.2006, Xiyuan Ave, West Hi-Tech Zone, 611731 | Chengdu, Sichuan, P.R.China 办公地址：成都市高新西区西源大道2006号，电子科技大学（清水河校区），主楼B1-406 Short Biography | 中文简介 Dr. Kai Zheng is a professor with University of Electronic Science and Technology of China (UESTC). He received Ph.D. (in 2012), Master (in 2009) and Bachelor (in 2006) degrees of Computer Science from The University of Queensland (UQ) (advised by Prof Xiaofang Zhou), Fudan University (advised by Prof Aoying Zhou) and Tongji University, respectively. Before joining UESTC, he has worked as Research Fellow (2012 - 2013) and ARC DECRA (Australian Research Council Discovery Early Career Research Award) Fellow (2014 - 2016) with the Data and Knowledge Engineering Group of UQ. His research interests include spatio-temporal databases, trajectory computing, spatial crowdsourcing, recommendation systems, as well as many other data-driven applications. He received a few best paper awards on international conferences including ICDE 2019 and 2015, APWeb-Waim 2017, WISE 2017. He served the General co-Chair of DASFAA 2017, Program co-Chair of APWeb 2016, and Program Committee for over 20 top-tier conferences including SIGMOD, PVLDB, ICDE, KDD, IJCAI, AAAI, WWW, etc. He is the associate editor of IEEE TKDE, WWW Journal, Distributed and Parallel Databases (DPD) and Data & Knowledge Engineering (DKE). He has published over 300 peer-reviewed papers in top-tier conferences and journals in the area of Big Data Management, receiving over 16000 citations with H-inex of 66 (according to Google Scholar). He is a senior member of IEEE and outsanding member of CCF, member of database committee and ubiquitous computing committee of China Computer Federation (CCF), and a member of intelligent service committee of Chinese Association for Artificial Intelligence (CAAI). 郑凯，电子科技大学计算机科学与工程学院教授，博士生导师。中国计算机学会大数据专委会、数据库专委会和普适计算专委会委员，中国人工智能学会智能服务专委会委员，IEEE高级会员，CCF杰出会员。博士毕业于澳大利亚昆士兰大学。主要研究领域为时空数据管理、轨迹计算、自动驾驶算法、智能数据库（AI4DB）、空间众包、推荐系统等。在数据库、数据挖掘等领域的重要会议和期刊发表论文300余篇，授权发明专利30余项，谷歌学术引用16000余次, H指数66。曾获澳大利亚优秀青年基金（DECRA Fellowship），两次获数据库国际顶级会议ICDE最佳论文奖（2015和2019年），多次获DASFAA、APWeb-WAIM、WISE等数据库重要会议最佳论文和最佳学生论文奖。担任数据库国际会议的程序主席(APWeb 2016，MDM 2021等)和大会主席(DASFAA 2017)，担任大数据领域顶级期刊 IEEE TKDE，WWW Journal 等的编委，以及数十个国际顶级会议的领域主席（Area Chair）和资深程序委员（SPC）。主持国家自然科学基金等项目二十余项。 What's New 10/09/2023 -- Call for papers: World Wide Web Special Issue on Advancing Recommendation Systems with Foundation Model 16/10/2022 -- Our paper \"Task Assignment with Spatio-temporal Recommendation in Spatial Crowdsourcing\" won best paper award of APWeb-WAIM 2022. 21/09/2022 -- Call for papers: Applied Science Special Issue on Spatial crowdsourcing 20/09/2022 -- Call for papers: the 9th International Workshop on Big Data Management and Service (BDMS), conjunct with DASFAA 2023 (CFP) 29/10/2021 -- Best Paper Award Nomination at ICDM 2021, being invited to be published in KAIS special issue of best papers. 10/10/2021 -- Call for papers: the 8th International Workshop on Big Data Management and Service (BDMS), conjunct with DASFAA 2022 (CFP)(Program) 1/12/2020 -- IEEE MDM 2021 Call for paper 8/10/2020 -- ACM TIST Call for paper: Special Issue on Intelligent Trajectory Data Analytics 30/7/2020 -- We are hiring Postdoc Research Fellows in areas of database and data mining. More details... 13/6/2019 -- DAPD Call for paper: Special Issue on Spatio-temporal Data Driven Urban Computing 1/4/2019 -- Our paper \"Social Influence-based Group Representation Learning for Group Recommendation\" won the best paper award of ICDE 2019. 14/2/2019 -- WWWJ Call for paper: Special Issue on Graph Data Management in Online Social Networks (CFP) 1/12/2018 -- Call for papers: Workshop on Big Data Management and Service (BDMS), conjunct with DASFAA 2019, Thailand (CFP) Selected Journal Papers (* Corresponding author) [TKDE] Rongwei Xu, Guanfeng Liu, Yan Wang, Xuyun Zhang, Kai Zheng, Xiaofang Zhou: Intent-Based Trust Evaluation. IEEE Transactions on Knowledge and Data Engineering (Accepted in Oct 2025) [TKDE] Hao Miao, Yan Zhao, Chenjuan Guo, Bin Yang, Kai Zheng, Christian S. Jensen: Spatio-Temporal Prediction on Streaming Data: A Unified Federated Continuous Learning Framework. IEEE Transactions on Knowledge and Data Engineering 37(4): 2126-2140 (2025) [TKDE] Yunyao Cheng, Chenjuan Guo, Kaixuan Chen, Kai Zhao, Bin Yang, Jiandong Xie, Christian S. Jensen, Feiteng Huang, Kai Zheng: Gaussian Process Latent Variable Modeling for Few-Shot Time Series Forecasting. IEEE Transactions on Knowledge and Data Engineering 37(8): 4604-4619 (2025) [TKDE] Yan Zhao, Xuanlei Chen, Guanyu Ye, Fangda Guo, Xiaofang Zhou, Kai Zheng*: Task Allocation in Spatial Crowdsourcing: An Efficient Geographic Partition Framework. IEEE Transactions on Knowledge and Data Engineering (Accepted in Mar 2024) [TKDE] Shuncheng Liu, Xu Chen, Yan Zhao, Han Su, Xiaofang Zhou, Kai Zheng*: Comfort-Aware Lane Change Planning With Exit Strategy for Autonomous Vehicle. IEEE Transactions on Knowledge and Data Engineering 36(7): 2927-2941 (2024) [TKDE] Ruiqi Zheng, Liang Qu, Tong Chen, Kai Zheng, Yuhui Shi, and Hongzhi Yin: Personalized Elastic Embedding Learning for On-Device Recommendation. IEEE Transactions on Knowledge and Data Engineering 36(7): 3363-3375 (2024) [TKDE] Yuchen Fang, Yanjun Qin, Haiyong Luo, Fang Zhao, and Kai Zheng*: STWave+: A Multi-Scale Efficient Spectral Graph Attention Network with Long-Term Trends for Disentangled Traffic Flow Forecasting. IEEE Transactions on Knowledge and Data Engineering 36(6): 2671-2685 (2024) [TKDE] Weizhu Qian, Yan Zhao, Dalin Zhang, Bowei Chen, Kai Zheng, Xiaofang Zhou: Towards A Unified Understanding of Uncertainty Quantification in Traffic Flow Forecasting. IEEE Transactions on Knowledge and Data Engineering 36(5): 2239-2256 (2024) [TKDE] Hao Miao, Xiaolong Zhong, Jiaxin Liu, Yan Zhao, Xiangyu Zhao, Weizhu Qian, Kai Zheng, Christian S. Jensen: Task Assignment with Efficient Federated Preference Learning in Spatial Crowdsourcing. IEEE Transactions on Knowledge and Data Engineering 36(4): 1800-1814 (2024) [TKDE] Kai Huang, Yue Cui, Qingqing Ye, Yan Zhao, Xi Zhao, Yao Tian, Kai Zheng, Haibo Hu, Xiaofang Zhou: TED+: Towards Discovering Top-k Edge-Diversified Patterns in a Graph Database. IEEE Transactions on Knowledge and Data Engineering 36(5): 2224-2238 (2024) [VLDBJ] Yan Zhao, Kai Zheng*, Ziwei Wang, Liwei Deng, Bin Yang, Torben Bach Pedersen, Christian S. Jensen, Xiaofang Zhou: Coalition-based Task Assignment with Priority-aware Fairness in Spatial Crowdsourcing. VLDB Journal, 33(1): 163-184 (2024) [TOIS] Yan Zhao, Liwei Deng, Kai Zheng*: AdaTaskRec: An Adaptive Task Recommendation Framework in Spatial Crowdsourcing. ACM Transactions on Information Systems, 41(4): 95:1-95:32 (2023) [TKDE] Yan Zhao, Jiaxin Liu, Yunchuan Li, Dalin Zhang, Christian S. Jensen, Kai Zheng*: Preference-aware Group Task Assignment in Spatial Crowdsourcing: Effectiveness and Efficiency. IEEE Transactions on Knowledge and Data Engineering, 35(10): 10722-10734 (2023) [TKDE] Minrui Xu, Jiajie Xu, Rui Zhou, Jianxin Li, Kai Zheng, Pengpeng Zhao, Chengfei Liu: Empowering A* Algorithm With Neuralized Variational Heuristics for Fastest Route Recommendation. IEEE Transactions on Knowledge and Data Engineering, 35(10): 10011-10023 (2023) [TKDE] Yan Zhao, Tinghao Lai, Ziwei Wang, Kaixuan Chen, Huan Li, and Kai Zheng*: Worker-Churn-based Task Assignment with Context-LSTM in Spatial Crowdsourcing. IEEE Transactions on Knowledge and Data Engineering, 35(9): 9783-9796 (2023) [TKDE] Yan Zhao, Kai Zheng*, Yunchuan Li, Bin Yang, Torben Bach Pedersen, Rui Mao, Christian S. Jensen, Xiaofang Zhou: Profit Optimization in Spatial Crowdsourcing: Effectiveness and Efficiency. IEEE Transactions on Knowledge and Data Engineering, 35(8): 8386-8401 (2023) [TKDE] Defu Lian, Zhihao Zhu, Kai Zheng, Yong Ge, Xing Xie, and Enhong Chen: Network Representation Lightening from Hashing to Quantization. IEEE Transactions on Knowledge and Data Engineering, 35(5): 5119-5131 (2023) [TKDE] Mubashir Imran, Hongzhi Yin, Tong Chen, Zi Huang, Kai Zheng: DeHIN: A Decentralized Framework for Embedding Large-scale Heterogeneous Information Networks. IEEE Transactions on Knowledge and Data Engineering, 35(4): 3645-3657 (2023) [TKDE] Pengfei Ding, Guanfeng Liu, Yan Wang, Kai Zheng and Xiaofang Zhou: A-MCTS: Adaptive Monte Carlo Tree Search for Temporal Path Discovery. IEEE Transactions on Knowledge and Data Engineering, 35(3): 2243-2257 (2023) [TKDE] Bolong Zheng, Qi Hu, Lingfeng Ming, Jilin Hu, Lu Chen, Kai Zheng*, Christian S. Jensen: SOUP: Spatial-Temporal Demand Forecasting and Competitive Supply. IEEE Transactions on Knowledge and Data Engineering, 35(2): 2034-2047 (2023) [TOIS] Yue Cui, Hao Sun, Yan Zhao, Hongzhi Yin, Kai Zheng*: Sequential-knowledge-aware Next POI Recommendation: A Meta-learning Approach. ACM Transactions on Information Systems, 40(2): 23:1-23:22 (2022) [TKDE] Peng Han, Shuo Shang, Aixin Sun, Peilin Zhao, Kai Zheng, Xiangliang Zhang: Point-of-Interest Recommendation With Global and Local Context. IEEE Transactions on Knowledge and Data Engineering, 34(11): 5484-5495 (2022) [TKDE] Defu Lian, Jin Chen, Kai Zheng*, Enhong Chen, Xiaofang Zhou: Ranking-based Implicit Regularization for One-Class Collaborative Filtering. IEEE Transactions on Knowledge and Data Engineering, 34(12): 5951-5963 (2022) [TOIS] Lei Guo, Hongzhi Yin, Tong Chen, Xiangliang Zhang, Kai Zheng: Hierarchical Hyperedge Embedding-based Representation Learning for Group Recommendation. ACM Transactions on Information Systems, 40(1): 3:1-3:27 (2022) [TKDE] Pengpeng Zhao, Chengfeng Xu, Yanchi Liu, Victor Sheng, Kai Zheng, Hui Xiong, Xiaofang Zhou: Photo2Trip: Exploiting Visual Contents in Geo-tagg",
  "content_length": 44476,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:27"
}