{
  "name": "Kai Liu 0018",
  "homepage": "https://sites.google.com/view/kailiu/home",
  "status": "success",
  "content": "KAI LIU's WebsiteSearch this siteEmbedded FilesSkip to main contentSkip to navigationI am NOT actively looking for PhD. students, however, I am always willing to consider exceptional candidates solid in mathematics. You are encouraged to send me your CV and transcripts to: kail@clemson.edu CVKai LiuKai Liu is an Assistant Professor in Computer Science Division, Clemson University. He received his Ph.D. in Computer Science from Colorado School of Mines working with Dr. Hua Wang. His main research interest lies in Machine Learning, Optimization, Computational Linear Algebra and Deep Learning Efficiency. He aims to develop Robust, Efficient and Scalable data-driven machine/deep learning algorithms with theoretical guarantee. Selected PublicationsHossein Esfahani, Kai Liu, Javad Velni. Distributed Model Predictive Control Design for Multi-agent Systems via Bayesian Optimization. IEEE Transactions on Control of Network Systems, TCNS 2025 (under review)Yifan Kang, Kai Liu. On Optimizing Large Scale Multi-Class Logistic Regression. Optimization for Machine Learning, OPT 2025Yifan Kang, Kai Liu. New Optimization Methods for Very Large Scale SVMs. Optimization for Machine Learning, OPT 2025Yarui Cao, Kai Liu. Exact Sparse Orthogonal Dictionary Learning. The IEEE International Conference on Data Mining, ICDM 2025Yifan Kang, Kai Liu. Acceleration in Low-Rank Tensor Completion. SIAM International Conference on Data Mining, SDM 2025Yarui Cao, Kai Liu. Adaptive Weighted Multiview Kernel Matrix Factorization and Its Application in Alzheimer's Disease Prediction. Analytics 2024Yifan Kang, Kai Liu. Nesterov Meets Robust Multitask Learning Twice. Optimization for Machine Learning, OPT 2023Mengyuan Zhang, Kai Liu. On Regularized Sparse Logistic Regression. The IEEE International Conference on Data Mining, ICDM 2023Mengyuan Zhang, Kai Liu. Multi-Task Learning with Prior Information. SIAM International Conference on Data Mining, SDM 2023 Mengyuan Zhang, Kai Liu. Rethinking Symmetric Matrix Factorization: A More General and Better Clustering Perspective. The IEEE International Conference on Data Mining, ICDM 2022Mengyuan Zhang, Kai Liu. Enriched Robust Multi-view Kernel Subspace Clustering. Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, CVPR 2022Xiao Li, Zhihui Zhu, Qiuwei Li, Kai Liu. A Provable Splitting Approach for Symmetric Nonnegative Matrix Factorization. Transactions on Knowledge and Data Engineering, TKDE 2021Kai Liu, Xiangyu Li, Zhihui Zhu, Lodewijk Brand, Hua Wang. Factor-Bounded Nonnegative Matrix Factorization. ACM Transactions on Knowledge Discovery from Data, TKDD 2021Xinyi Wang, Tianxiang Hu, Xingzhang Ren, Jinan Sun, Kai Liu and Minghui Zhang. TransVAE: A Novel Variational Sequence-to-Sequence Framework for Semi-supervised Learning and Diversity Improvement. The International Joint Conference on Neural Networks, IJCNN 2021 Bo Li, Zhonghao Sheng, Wei Ye, Jinglei Zhang, Kai Liu, Shikun Zhang. Sliding Hierarchical Recurrent Neural Networks for Sequence Classification, IJCNN 2020Zhiyuan Liu, Huazheng Wang, Fan Shen, Kai Liu, Lijun Chen. Incentivized Exploration for Multi-Armed Bandits under Reward Drift. 34th AAAI Conference on Artificial Intelligence, AAAI 2020 Kai Liu, Lou Brand, Hua Wang, Philip Nie. Learning Robust Distance Metric with Side Information via Ratio Minimization of Orthogonally Constrained L21-Norm Distances. International Joint Conference on Artificial Intelligence, IJCAI 2019 Haoxuan Yang*, Kai Liu*, Hua Wang, Philip Nie. Learning Strictly Orthogonal p-Order Nonnegative Laplacian Embedding via Smoothed Iterative Reweighted Method. International Joint Conference on Artificial Intelligence, IJCAI 2019Kai Liu*, Qiuwei Li*, Hua Wang, Gongguo Tang. Spherical Principal Component Analysis. SIAM International Conference on Data Mining, SDM 2019 Lodewijk Brand, Xue Yang, Kai Liu, Saad Elbeleidy, Hua Wang, Hao Zhang. Learning Robust Multi-Label Sample Specific Distances for Identifying HIV-1 Drug Resistance. 23rd Annual International Conference on Research in Computational Molecular Biology, RECOMB 2019 Kai Liu, Hua Wang, Fei Han, Hao Zhang. Visual Place Recognition via Robust L2-Norm Distance Based Holism and Landmark Integration. 33rd AAAI Conference on Artificial Intelligence, AAAI 2019 Zhihui Zhu, Xiao Li, Kai Liu, Qiuwei Li. Dropping Symmetry for Fast Symmetric Nonnegative Matrix Factorization.  32nd annual conference on Neural Information Processing Systems, NIPS 2018 Kai Liu, Hua Wang. High-Order Co-Clustering via Strictly Orthogonal and Symmetric L1-norm Nonnegative Matrix Tri-Factorization.  27th International Joint Conference on Artificial Intelligence, IJCAI 2018Kai Liu, Hua Wang, Feiping Nie, Hao Zhang. Learning Multi-Instance Enriched Image Representations via Non-Greedy Ratio Maximization of the L1-norm Distances. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2018 Kai Liu, Hua Wang, Shannon Risacher, Andrew Saykin, Li Shen. Multiple Incomplete Views Clustering via Non-Negative Matrix Factorization with its Application in Alzheimer's Disease Analysis. 2018 IEEE 15th International Symposium on Biomedical Imaging, ISBI 2018Kai Liu, Hua Wang. Robust Multi-Relational Clustering via L1-norm Symmetric Non-negative Matrix Factorization. 53rd Annual Meeting of the Association for Computational Linguistics, ACL 2015TeachingCPSC 8810   Optimization for Machine Learning, Clemson UniversityCPSC 8420   Advanced Machine Learning, Clemson UniversityCPSC 8810   Build A Large Language Model from Scratch, Clemson UniversityCPSC 6430   Machine Learning, Clemson UniversityConference Program Committee Members/ReviewersInternational Conference on Machine Learning (ICML)Conference on Neural Information Processing Systems (NeurIPS)International Conference on Learning Representations (ICLR)International Conference on Artificial Intelligence and Statistics (AISTATS)ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD)Booklist for Machine Learning Convex Optimization (Boyd, Stephen P., and Lieven Vandenberghe)Introduction to Nonlinear Optimization (Beck, Amir)First Order Methods in Optimization (Beck, Amir)Numerical Optimization (Nocedal, Jorge, and Stephen J. Wright)Matrix Analysis and Applications (Xianda Zhang) [Chinese: 矩阵分析与应用 (张贤达)]Matrix Analysis (Horn, Roger A., and Charles R. Johnson)High Dimensional Probability (Vershynin, Roman)High Dimensional Statistics (Wainwright, Martin)Statistical Learning with Sparsity (Trevor Hastie, Robert Tibshirani, and Martin Wainwright)The Elements of Statistical Learning (Hastie T, Tibshirani R, Friedman JH)Foundations of Machine Learning (Mohri, M., Rostamizadeh, A. and Talwalkar, A.)An introduction to Statistical Learning (Witten D, James G, Hastie T, Tibshirani R)MiscKai has a keen interest in traditional Chinese culture including calligraphy, painting, history, poems, etc. He likes hiking and playing Chinese Chess during his leisure time, but his favorite is reading, especially some biographies such as: Lust for Life, The Gay Genius, etc.He loves badminton and tried half and full Marathon in 2017, 2018 respectively. Besides, he has been a Madridista for 20+ years.ContactEmail: liukaizhijia@gmail.com, kail@clemson.eduOffice: 227 McAdams Hall  |  Clemson, SC  29634-0901Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 7371,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:22"
}