{
  "name": "Kai Shu",
  "homepage": "https://www.cs.emory.edu/~kshu5",
  "status": "success",
  "content": "Kai Shu Kai Shu Home Awards Projects Publications Teaching People Datasets & Tools Services Assistant Professor Department of Computer Science Emory University Office: MSC N424 Mail: 400 Dowman Drive, Atlanta, GA 30322 E-mail: kai.shu at emory.edu X: @KaiShu0327 Google Scholar News and Highlights [11/2025] Three AAAI and one IEEE BigData papers are accepted. [10/2025] One paper is accepted in AACL 2025. [9/2025] World's Top 2% Scientists 2025, released by Stanford University. [8/2025] AI 2000 Most Influential Scholar Award Honorable Mention in Data Mining, Aminer 2025. [8/2025] Two papers are accepted in EMNLP 2025. [8/2025] Received a Cisco Faculty Research Award. [8/2025] One paper is accepted in CIKM 2025. [6/2025] My view on Protecting LLMs from Jailbreaks at Comminucations of ACM. [6/2025] One paper is accepted in AMIA 2025. [4/2025] Received the Emory URC Research Award. [3/2025] Received the NSF NAIRR Pilot Award. [2/2025] Invited to participate the NSF Workshop on the Science of Safe AI. [1/2025] One paper is accepted in NAACL 2025. [1/2025] One paper is accepted in ICLR 2025. [1/2025] Invited panelist at CMU AI and Disinformation Summit. [1/2025] Two papers are accepted in TheWebConf 2025. [11/2024] Two papers are accepted in COLING 2025. [11/2024] Invited to talk at Stanford University. [9/2024] One paper is accepted in NeurIPS 2024. [9/2024] Two papers are accepted in SIGKDD Explorations and EMNLP 2024. [7/2024] Two papers are accepted in DSAA 2024. [7/2024] One paper is accepted in CIKM 2024. [6/2024] Received a NSF grant on open-source anomaly detection, joint with UIC, USC, and Lehigh. [4/2024] Received the NSF CAREER Award on fairness AI in the real world! [IIT News] [2/2024] Invited to participate the Cisco Research LLM Factuality Hallucination Summit. [1/2024] Received the IIT College of Computing Dean's Excellence in Research Award. [1/2024] One paper is accepted in ICLR 2024. More - Not That New News Kai Shu is an Assistant Professor in the Department of Computer Science at Emory University. His research lies in machine learning, data mining, social computing with applications such as healthcare, security and education. Prior to joining Emory in 2024, he was the Gladwin Development Chair Assistant Professor in Computer Science at Illinois Institute of Technology. He obtained his PhD in Computer Science at Arizona State University, under the supervision of Professor Huan Liu. He is the recipient of 2025 Emory URC Research Award, 2024 NSF CAREER Award, 2024 IIT College of Computing Dean's Excellence in Research Award, 2023 Microsoft Accelerate Foundation Models Research Award, 2023 DARPA AI Forward Scholarship Award, 2023 AAAI New Faculty Highlights, multiple Cisco Faculty Research Awards, the finalist of a 2022 Meta Research Award, and 2020 ASU Dean's Dissertation Award. He interned at Microsoft Research AI, Yahoo Research and HP Labs. His research is generously supported by federal agencies such as NSF, DARPA, IARPA, DHS, and DOE, as well as industrial collaborators such as Cisco, Google, and Microsoft. I am ACTIVELY looking for Postdocs and multiple self-motivated PhD students to conduct research in the area of data mining, machine learning, social computing, and natural language processing. Interested students please feel free to drop me an email with your CV and transcript (I can not reply to every individual email). Research Interests AI for Social Good: dis-/misinformation, privacy, security, healthcare. Trustworthy AI: interpretability, robustness, fairness. Learning with Imperfect Data: self-/weakly-supervised learning, meta learning, data augmentation. Applied Machine Learning: text/graph mining, multimodal learning, adversarial learning. Large Foundation Models: factuality, reliability, safety. Table of Contents Order Hard-cover or PDF Tools and Datasets Table of Contents An Introductory Chapter [A Chinese Introduction Blog][Vito] Selected Publications [Full List] Can Knowledge Editing Really Correct Hallucinations? [PDF] Baixiang Huang, Canyu Chen, Xiongxiao Xu, Ali Payani, and Kai Shu Proceedings of the 13th International Conference on Learning Representations (ICLR 2025). Can Large Language Models Identify Authorship. [PDF] Baixiang Huang, Canyu Chen and Kai Shu Findings of The 2024 Conference on Empirical Methods in Natural Language Processing (EMNLP 2024-Findings). Backdoor Activation Attack: Attack Large Language Models using Activation Steering for Safety-Alignment. [PDF] Haoran Wang, Kai Shu Proceedings of the 33rd ACM International Conference on Information and Knowledge Management (CIKM 2024). Can LLM-Generated Misinformation Be Detected? [PDF] Canyu Chen, Kai Shu Proceedings of the 12th International Conference on Learning Representations (ICLR 2024). Explainable Claim Verification via Knowledge-Grounded Reasoning with Large Language Models. [PDF] Haoran Wang, Kai Shu Findings of The 2023 Conference on Empirical Methods in Natural Language Processing (EMNLP 2023-Findings). Attacking Fake News Detectors via Manipulating News Social Engagement. [PDF][A Blog on Montreal AI] Haoran Wang, Yingtong Dou, Canyu Chen, Lichao Sun, Philip S. Yu and Kai Shu. Proceedings of The 2023 ACM Web Conference (WWW 2023). PromptDA: Label-guided Data Augmentation for Prompt-based Few Shot Learners. [PDF] Canyu Chen, Kai Shu. Proceedings of The 17th Conference of the European Chapter of the Association for Computational Linguistics (EACL 2023). A Model-Agnostic Approach to Differentially Private Topic Mining. [PDF] Han Wang*, Jayashree Sharma*, Shuya Feng, Kai Shu, and Yuan Hong. Proceedings of 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2022) WALNUT: A Benchmark on Semi-weakly Supervised Learning for Natural Language Understanding. [PDF][Code] Guoqing Zheng, Giannis Karamanolakis, Kai Shu, Ahmed Hassan Awadallah. Proceedings of 2022 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL 2022) \"This is Fake! Shared it by Mistake\": Assessing the Intent of Fake News Spreaders. [PDF] Xinyi Zhou, Kai Shu, Vir V. Phoha, Huan Liu and Reza Zafarani. Proceedings of The 2022 ACM Web Conference (WWW 2022) Domain Adaptive Fake News Detection via Reinforcement Learning. [PDF] Ahmadreza Mosallanezhad, Mansooreh Karami, Kai Shu, Michelle Mancenido and Huan Liu. Proceedings of The 2022 ACM Web Conference (WWW 2022) Causal Understanding of Fake News Dissemination on Social Media. [PDF] Lu Cheng, Ruocheng Guo, Kai Shu, and Huan Liu. Proceedings of 27th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2021) User Preference-aware Fake News Detection. [PDF][Code][PyG Example][DGL Example][Data][A video demo by DeepFindr] Yingtong Dou, Kai Shu, Congying Xia, Philip S. Yu, and Lichao Sun. Proceedings of 44th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR 2021) (Short paper) Fact-enhanced Synthetic News Generation. [PDF][Poster] Kai Shu*, Yichuan Li*, Kaize Ding, and Huan Liu. Proceedings of The Thirty-Fifth AAAI Conference on Artificial Intelligence (AAAI 2021) dEFEND: Explainable Fake News Detection. [PDF][Code] Kai Shu, Limeng Cui, Suhang Wang, Dongwon Lee, and Huan Liu. Proceedings of 25th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2019) Media coverage: [Techxplore Today] Fake News Detection on Social Media: A Data Mining Perspective. [PDF][Data] Kai Shu, Amy Sliva, Suhang Wang, Jiliang Tang, and Huan Liu. SIGKDD Explorations, 2017.",
  "content_length": 7532,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:27"
}