{
  "name": "Kai Zhou 0001",
  "homepage": "https://web.comp.polyu.edu.hk/kaizhou",
  "status": "success",
  "content": "Kai Zhou's Webpage Kai Zhou Assistant Professor Department of Computing The Hong Kong Polytechnic University Office: PQ836 Phone: (+852) 2766 7244 Email: kaizhou@polyu.edu.hk Navigation: [Home] [Publications] Join Our Group: We are always looking for self-motivated Ph.D. students/Research Assistants/Post-docs to join our group. I'm also happy to work with masters or undergraduate students at PolyU. If you are interested, please send me an email. Research My research centers around AI Security. My interest is to build secure and robust systems via developing smart, effective, and scalable methods with sound theoretical guarantees. Some specific topics include: Adversarial Graph Learning: we study how to attack (e.g., AAMAS'19, CCS'21, ICDE'22, TIFS'24), defend (e.g., ICDM'19,UAI'20, TKDE'23, TIFS'23, TIFS'25), and provide formal robustness guarantees (e.g., IEEE S&P'24, ICML'24, CCS'24, IJCAI'25) for various graph learning models, such as Graph Neural Networks, Federated Graph Learning, and Graph Foundation Models. AI Agent Security: we study the emerging security vulnerabilities and provide defense solutions for LLM-empowered AI Agent/Multi-Agent Systems. We are actively looking for students to work on this direction. AI for Security: we study how to develop more robust AI tools to address security issues in various domains. Examples include: graph-based anomaly detection (ICDE'24), malware detection (CCS'21), and malicious smart contract detection in blockchain (arXiv'25). Secure Computation: compute over protected data to complete specific tasks in an efficient and privacy-preserving way. I used to work and am interested in this direction, but not actively working on it now. We name our group as STiL -- Secure and Trustworthy Intelligence Laboratory. Some keywords summarizing our research: AI Security, Adversarial Machine Learning, Adversarial Robustness, Certified Robustness, Provable Defense, Data Security and Privacy, Anomaly Detection Short Bio I was an undergraduate student at Shanghai Jiao Tong University from 2009 to 2013. After that I obtained a PhD degree from Michigan State University in Dec. 2017, under the supervision of Prof. Jian Ren. I then worked as a Postdoc at Vanderbilt University (May. 2018 - Aug. 2018) and then moved to Washington University in St. Louis (Aug. 2018 - Mar. 2020), both under the supervision of Prof. Yevgeniy Vorobeychik. Starting from July 2020, I have been working as an Assistant Professor in the Department of Computing at The Hong Kong Polytechnic University. Teaching COMP4334 Principles and Practice of Internet Security COMP2421 Computer Organization Professional Activities Associate Editor, IET Communications, 2020 - Present TPC Co-chair, Symposium of Information and Communications Security, ICNC, 2025, 2026 Grant Reviewer, National Science Foundation of China, General Program, 2025 - Present TPC Member, ACM CCS 2026, AAAI (2020 - 2025), IJCAI (2020 - 2024), AAMAS (2020 - 2026), etc.",
  "content_length": 2978,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:27"
}