{
  "name": "Kai Sun 0001",
  "homepage": "http://web.eecs.utk.edu/~kaisun",
  "status": "success",
  "content": "﻿ Kai Sun - Home Kai Sun 孙凯 Professor, IEEE Fellow Department of EECS University of Tennessee Tel: 865-974-3982 Email: kaisun(at)utk.edu Address: 523 Min H. Kao Building, 1520 Middle Drive, Knoxville, TN 37996-2250 Home Bio Research Teaching Team Publications Resources Curriculum Vitae, GoogleScholar, ResearchGate Prof. Sun received his B.S. in Automation (1999) and Ph.D. in Control Science & Engineering (2004) both from Tsinghua University, Beijing. Before joining UTK, he was a Project Manager with the Electric Power Research Institute (EPRI) in Palo Alto, CA for R&D programs in Grid Operations and Planning from 2007 to 2012. He conducted postdoctoral studies at Arizona State University in 2006-2007 and the University of Western Ontario in 2005. He was a visiting scholar at Harvard University in 2019-2020. Prof. Sun is a recipient of 2016 NSF CAREER award, a faculty Member of NSF/DOE engineering research center CURENT, and an IEEE Fellow. Prof. Sun's research interests include stability, dynamics and control of power grids and other complex systems. Latest News 7/2025: Prof. Sun delivered an invited talk titled \"Nonlinear Modal Decoupling for Networked Oscillator Systems\" at the SIAM Conference on Applied Algebraic Geometry (AG25), held in Madison, WI. 6/2025: Our paper \"Reduced-Order Phase-Amplitude Characterization of Nonlinear Subsynchronous Oscillations Involving Inverter-Based Resources\" (Kaiyang Huang, Dan Wilson, Tianwei Xia, Kai Sun) will be presented as a Best Papers Award paper at the IEEE PES General Meeting in Austin, TX. 5/2025: Zhenping has successfully defended her Ph.D. dissertation titled \"Modeling, Simulation, and Mitigation of Cascading Failures in Power Systems.\" Congratuations to Dr. Guo! Recent Journal Publications Efficient High-Order Participation Factor Computation via Batch-Structured Tensor Contraction (IEEE TPWRS '25). Descriptor: Power Systems Cascading Failure Analysis Synthetic Dataset (PowerCascade) (IEEE DATA '25). On the Uniqueness of Participation Factors in Nonlinear Dynamical Systems (JCTA '25). A Heterogeneous Multiscale Method for Efficient Simulation of Power Systems with Inverter-Based Resources (IEEE TPWRS '25). An Improved Holomorphic Embedding Method for Power Flows with Phase-Shifting Transformers (CSEE JPES '25). Efficient Simulation of Cascading Outages Using an Energy Function-Embedded Quasi-Steady-State Model (IEEE TPWRS '25). Estimation of Participation Factors for Power System Oscillation from Measurements (IEEE TIA '25). Updated in Jan 2024",
  "content_length": 2543,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:27"
}