{
  "name": "Kai Oliver Arras",
  "homepage": "https://www.ki.uni-stuttgart.de/institute/team/Arras",
  "status": "success",
  "content": "Prof. Dr. Kai Arras | Institute for Artificial Intelligence | University of Stuttgart jump to content jump to footer back close navigation For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Kai Arras Prof. Dr. ProfessorInstitute for Artificial IntelligenceSocially Intelligent Robotics Lab Contact +49 711 685 88135 Email Website Universitätsstraße 32 70569 Stuttgart Germany Room: 2.307 Publications Google Scholar Profile Vita Academia 1997 Graduation in EE from ETH Zurich 2003 PhD in Robot Navigation from EPFL (Prof. R. Siegwart) 2004 Postdoc at CAS, KTH Stockholm (Prof. H. Christensen) 2006 Postdoc at IAS lab, University of Freiburg (Prof. W. Burgard) 2007 DFG junior research group leader grant, SFB/TR8, University of Freiburg 2010 Junior professor, University of Freiburg 2023 Full professor and Cyber Valley Endowed Chair for Autonomous Systems, University of Stuttgart Industry 2003 Founder and head of own robotics start-up Nurobot, Zurich 2007 Senior Research Scientist at Evolution Robotics, Pasadena, CA (now iRobot) 2015 Head of robotics research at Bosch as VP Chief Expert, Bosch Research, Renningen 2017 Listed as one of Germany's \"100 Innovators,\" Handelsblatt Magazine Some Highlights AE and PC member of virtually all relevant robotics conferences and journals (2003-2018) Coordinator, EU Project SPENCER (2013), Link Awards: Best paper (AMS 1996), Best student paper nominee (RSS 2013), Best SSRR paper nominee (IROS 2018), EURON George Giralt PhD award finalist (2004), ABB PhD award nominee (2003) Human-Robot Interaction Steering Committee (2013-2016) Co-founder of SpotMe SA (exit 2023) Expert on AI-based robotics task force for the German Chancellor's Council for the Future (2022) The results of my work are running on 5000+ robot systems in real-world applications on a daily basis: AGV localization system (BlueBotics ANT), AGV SLAM system (Rexroth ROKIT), full navigation stack (Bosch Engineering for Hako) To the top of the page",
  "content_length": 2059,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:25"
}