{
  "name": "Kai Lawonn",
  "homepage": "http://vis.uni-jena.de",
  "status": "success",
  "content": "Visualization and Explorative Data Analysis Group | University of Jena The visualization group aims to visualize data for improved exploration and analysis. We work in close collaboration with experts in various fields to develop visualization techniques that support their research. For this, we employ advanced 3D rendering on modern graphics hardware to gain insight into the data. Furthermore, we play an active role in computer science studies and offer the opportunity to write interesting Bachelor or Master theses. News 02/10/2025 — The paper “Uniform parametric mapping of saccular intracranial aneurysms for statistical analysis of morphological variation” by Pepe Eulzer and Kai Lawonn was awarded the Best Paper Award at the VCBM conference. 03/06/2025 — Pepe Eulzer has been honored as one of the recipients of the prestigious EuroVis PhD Award 2025 for his outstanding dissertation in visualization research—a testament to his exceptional contributions to the field. 21/05/2025 — Kai Lawonn gave a talk in the Research Seminars in General Psychology and Cognitive Neuroscience titled “Seeing is Believing: The Role of Human Perception in Visualization”. 02/04/2025 — Kai Lawonn gave a keynote talk at the Paul-Ehrlich-Institut entitled: From Pixels to Insight: Bridging Visualization and Perception for Interdisciplinary Research. 30/01/2025 — Pepe Eulzer has been awarded the VRVis GmbH Visual Computing Award 2025. This award recognizes his contribution to visual computing research, particularly in the context of the United Nations’ Sustainable Development Goals. 28/11/2024 — Kai Lawonn was invited to give a talk on “Interactive Visualization of Complex Data” at the Data Assessment Solutions GmbH. 04/08/2024 — Pepe Eulzer successfully defended his PhD thesis, entitled: Data and Simulation-based Exploration, Analysis, and Treatment of Stenoses for Prevention of lschemic Strokes. Congratulations! Committee: Kai Lawonn, Friedrich Schiller University Jena, Germany Bernhard Preim, Otto-von-Guericke University, Germany Eduard Gröller, Technical University of Vienna, Austria 27/10/2023 — Anny-Marleen Hißbach was awarded an Exam Award this year, an award given to the top graduating students of the previous academic year. 23/10/2023 — Felix Fleisch et al. were awarded the “Best Activity Overview Visualization” Award of this year’s SciVis Contest 2023. 08/09/2023 — Pepe Eulzer won the first place of this year’s Karl-Heinz Höhne Award. 20/06/2023 — With the submission “A Dataset of Reconstructed Carotid Bifurcation Lumen and Plaque Models with Centerline Tree” we are one of the winners of the FAIRest Dataset Competition 2023. 10/05/2023 — Our paper “A Fully Integrated Pipeline for Visual Carotid Morphology Analysis” received an honorable mention award at EuroVis. 27/03/2023 — Pepe Eulzer’s work “Visualizing Carotid Stenoses for Stroke Treatment and Prevention” will be one of the winners of the Dirk Bartz Prize. 19/10/2022 — Our paper “GRay: Ray Casting for Visualization and Interactive Data Exploration of Gaussian Mixture Models” received an honorable mention award at IEEE VIS. 05/07/2022 — Kai Lawonn was invited to talk at the Max Planck Institute for Biogeochemistry. 24/06/2022 — Kai Lawonn gave a festive talk at the PhD Graduation Ceremony on Schillertag. 30/05/2022 — The image of Simon Lieb was exhibited at the Profillinie „LIFE“  exhibition at Goethe Galerie Jena. 18/05/2022 — At the Data Science Day in Jena (DSDJ) Kai Lawonn gave a keynote talk about „Visualization in the Wild“. 06/04/2022 — Kai Lawonn gave a keynote talk about “Visualization for Culture, Art and Medicine” at the Levia conference in Leipzig. 22/12/2021 — Maha Al-Ghalibi successfully defended her Phd thesis entitled „Emotion and Sentiment Detection in Unstructured Social Data“. 10/12/2021 — Sherin Sugathan et al. won the MMIV-PRESIMAL Image Contest 2021 with their contribution entitled “The Brain-scape of Multiple Sclerosis”. 18/11/2021 — Kai Lawonn has been included in the prestigious “Young Elite – Top 40 under 40” ranking by the business magazine “Capital”. 11/07/2021 — We are pleased to announce that Monique Meuschke has been awarded the Reichart Prize 2020. The Reichart Prize is awarded annually to excellent young researchers with an interdisciplinary focus. This year, Monique Meuschke was able to prevail against 20 other applicants with her research focus on cerebral aneurysms. 11/03/2021 — Kai Lawonn was awarded the highly prestigious Heinz Maier-Leibnitz Prize 2021 from the German Research Council (Deutsche Forschungsgemeinschaft). The laudation was given by Prof. Dr. Thomas Ertl. 05/12/2020 — Monique Meuschke succeeded in acquiring third-party funding for young female scientists as part of the FSU’s IMPULSE-project. 23/10/2020 — Our new research project “Forschungstransfer in der wissenschaftlichen Telemedizin” was approved by the Carl Zeiss Foundation. 01/08/2020 — We are happy that Jan Hombeck joined our research group. 25/05/2020 — At this year’s EuroVis conference, the group received two highly prestigious awards. Monique Meuschke was awarded the EuroVis PhD Award for her excellent dissertation. Kai Lawonn received this year’s Young Researcher Award. 30/03/2020 — Monique Meuschke received the Bildverarbeitung-für-die-Medizin (BVM) Award for her dissertation. Congratulations! 01/01/2020 — We are happy that Dr. Monique Meuschke joined our research group. 01/10/2019 — Kai Lawonn becomes a junior professor for the Visualization and Explorative Data Analysis Group at the Friedrich-Schiller-University Jena. 08/05/2019 — We received the 2nd place of the Dirk Bartz prize for visual computing in medicine: Model-based Visualization for Medical Education and Training. Noeska Smit, Kai Lawonn, Annelot Kraima, Marco DeRuiter, Stefan Bruckner, Elmar Eisemann, and Anna Vilanova. 24/01/2019 — Tobias Günther and I won the Computer Graphics Forum Cover Image Contest. 21/09/2018 — Nils Lichtenberg and I received an honorable mention award for the paper “Parameterization and Feature Extraction for the Visualization of Tree-like Structures” at the VCBM conference. 21/09/2018 — Together with Monique Meuschke and Bernhard Preim we received the best poster award of the VCBM. 02/11/2017 — Successfully defended my Habilitation thesis, entitled: Visual Enhancement of Focus Structures in Selected Applications. Committee: Bernhard Preim, Otto-von-Guericke University, Germany Eduard Gröller, Technical University of Vienna, Austria Anders Ynnerman, Linköping University, Sweden 14/03/2017 — Together with Monique Meuschke, Wito Engelke, Oliver Beuing, and Bernhard Preim we received the 3rd price of the BVM best paper award. 08/09/2016 — I contributed to two winning submissions at the MedViz image contest 2016. The first image was PelVIS by Noeska Smit, Kai Lawonn, Annelot Kraima, Marco de Ruiter, Hessam Sokooti, Stefan Bruckner, Elmar Eisemann, Anna Vilanova, and the second image was Turbulent flow in an aorta by Niels de Hoon, Kai Lawonn, Andrei Jalba, Elmar Eisemann, Anna Vilanova. Both images were rewarded with 1.000 NOK. 09/05/2016 — I was awarded with the Eurographics Phd Award at this year’s Eurographics main conference. A description with images can be found on the medvis.org site. 01/11/2015 — Kai Lawonn become one of the chairs of the EuroRV3, i.e., the EuroVis Workshop on Reproducibility, Verification, and Validation in Visualization. This year, the workshop is subtitled “From Medical Visualization Concepts to Certified Applications”. 01/10/2015 — Kai Lawonn becomes a junior professor for the medical visualization group of the Institute for Computational Visualistics at the University of Koblenz · Landau. 12/08/2015 — Kai Lawonn become a new contributor for the medvis.org site. 11/05/2015 — Kai Lawonn was nominated for the GI award for the best Phd thesis in computer science 2014. 14/04/2015 — Kai Lawonn gave a presentation about three.js at the TU Delft. 01/03/2015 — Kai Lawonn joined the graphics and visualization group headed by Prof. Elmar Eisemann for a few months, where he was supervised by Dr. Anna Vilanova. 20/11/2014 — Dissertation award: My Phd thesis was awarded as the best thesis of the university. 06/11/2014 — Invited talk: Kai Lawonn gave an invited talk at MPI in Saarbrücken about illustrative visualization. 01/10/2014 — Best Phd Thesis Award: My Phd thesis was selected as the best Phd thesis of the faculty in the academic year (01.10.2013 – 30.09.2014). 15/09/2014 — Successfully defended my PhD thesis, entitled: Illustrative Visualization of Medical Data Sets. Committee: Bernhard Preim, Otto-von-Guericke University, Germany Stefan Bruckner, University of Bergen, Norway Lars Linsen, Jacobs University, Germany",
  "content_length": 8733,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:24"
}