{
  "name": "Kaidi Xu",
  "homepage": "https://kaidixu.com",
  "status": "success",
  "content": "Kaidi Xu's homepage Skip to content Associate Professor Department of Data Science City University of Hong Kong Email: kaidixu at cityu.edu.hk Google GitHub I’m seeking highly motivated students with a strong background in machine learning and deep learning, offering full financial support. Interested candidates are strongly encouraged to contact me via email, together with a resume including a publication list and transcripts. Two postdocs and five PhD positions are available in 2026 Fall. Kaidi Xu is an Associate Professor in the Department of Data Science at City University of Hong Kong. He received his Ph.D. from Northeastern University and M.S. from the University of Florida in 2021 and 2017, respectively. He then served as an Assistant Professor in the Department of Computer Science at Drexel University from 2021 to 2025. His primary research interest is Trustworthy AI, including formal verification, practical adversarial attacks, and uncertainty quantification. Prof. Xu has published extensively in top-tier venues across machine learning, computer vision, and natural language processing, and has served as a program committee member and area chair for leading conferences. He is a four-time champion of the International Verification of Neural Networks Competition (VNN-COMP 2021, 2022, 2023, 2024), recipient of Drexel’s Faculty Research Excellence Award, and winner of the Best Paper Award at the NeurIPS 2024 GenAI4Health workshop.  He is among the Stanford World’s Top 2% Scientists in 2025. As Principal Investigator, Prof. Xu has led multiple research projects funded by the U.S. NSF and national laboratories. His work bridges rigorous theoretical guarantees with practical AI robustness solutions, advancing the safety and reliability of AI systems in real-world applications. Google Scholar, GitHub Recent News 11/2025: Two papers were accepted to AAAI 2026 (1 oral, 1 poster)! 10/2025: I am serving as an Area Chair for ARR OCT 2026! 08/2025: I am serving as an Area Chair for ICLR 2026! 08/2025: Four papers were accepted (1x ACMMM, 1x ICCV, 2x EMNLP). 05/2025: Three papers were accepted (1x ICML, 2x ACL)! 03/2025: I am serving as an Area Chair for NeurIPS 2025! 02/2025: Two papers were accepted (1x IEEE S&P 2025, 1x CVPR)! 01/2025: Received two Drexel internal grants (2x Carleone Faculty Award)! 01/2025: Two papers were accepted (1x NAACL, 1x NAACL Findings)! 11/2024: We are organizing GenAI4Health@AAAI 2025 workshop in Philadelphia in March 2025 and are looking forward to seeing you! 09/2024: Four papers were accepted (1x NDSS, 1x EMNLP and 2x NeurIPS)! 07/2024: Three papers were accepted (1x ECCV, 1x ACM MM and 1x RSS)! 05/2024: Glad to receive the Faculty Research Excellence Award from CCI@Drexel. Congrats to my PhD student Jinhao, who received the Student Research Excellence Award! 05/2024: Two papers were accepted by ICML 2024 and one paper was accepted by ACL 2024! 03/2024: Received an NSF grant: “Decision-Embedded Deep Learning for Transit Systems”. Thank you, NSF! 03/2024: Two papers were accepted by CVPR 2024, and one paper was accepted by NAACL 2024! 01/2024: One paper was accepted by ICLR 2024, see you in Vienna! 12/2023: One paper was accepted by AAAI 2024! 12/2023: Our team, alpha-beta-crown, won the International Verification of Neural Networks Competition (VNN-COMP 2021 – 2023) three years in a row! 09/2023: Received an NSF grant: “Deep Learning Gibbs Free Energy Functions to Guide Solid-state Material Synthesis”. Thank you, NSF! 09/2023: Received an NSF grant: “Towards Verified Robustness and Safety in Power System-Informed Neural Networks”. Thank you, NSF! 09/2023: Two papers were accepted by BMVC 2023! 07/2023: One paper was accepted by ICCV 2023, see you in Paris! 05/2023: Two papers were accepted by IJCAI 2023 and ICML 203 respectively! 09/2022: Congratulations again! Our team alpha-beta-crown won the International Verification of Neural Networks Competition (VNN-COMP 2022) with the highest total score! 09/2022: Two papers were accepted by NeurIPS 2022! 05/2022: One paper was accepted by ICML 2022! 04/2022: I’m a co-organizer of ICML 2022 Workshop on Formal Verification of Machine Learning. Submit your paper by May 27, 2022 (see our Call for Papers!). 02/2022: I am one of the main speakers for AAAI 2022 Tutorial Formal Verification of Deep Neural Networks: Theory and Practice [tutorial webpage] 10/2021: I was invited by Qi Alfred Chen to talk about my recent research works on Formal Neural Network Verification at UC Irvine. 09/2021: Two papers were accepted by NeurIPS 2021! 09/2021: Congratulations! Our team Alpha-beta-crown won the International Verification of Neural Networks Competition (VNN-COMP 2021) with the highest total score. (official website, certificate, source code and competition report) 03/2021: I was invited by Visual Informatics Group @ University of Texas at Austin to talk about my recent research works. 03/2021: I co-organized ATVA 2021 Workshop on Security and Reliability of Machine Learning (SRML). 01/2021: Two papers were accepted by ICLR 2021. I am honored to serve as Senior Program Committee in IJCAI 2021! I will serve as committee member of AAAI 2021, ICLR 2021, CVPR 2021, ICML 2021 and WACV 2021. 09/2020: One paper was accepted by NeurIPS 2020. Our work “Adversarial T-shirt” was reported by WIRED, Boston Globe, Communications of the ACM and Jiqizhixin. 07/2020: One paper was accepted by ECCV 2020 (Spotlight). 06/2020: One paper was accepted by ICML 2020. 05/2020: I will work as a research intern at Tencent Media Lab in Summer 2020. 02/2020: One paper was accepted by CVPR 2020. 01/2020: I will work as a research intern at MIT-IBM Watson AI Lab in Spring 2020. More news… Kaidi Xu's homepage Sign up Log in Copy shortlink Report this content Manage subscriptions Loading Comments... Write a Comment... Email (Required) Name (Required) Website",
  "content_length": 5892,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:29"
}