{
  "name": "Kaifeng Huang 0001",
  "homepage": "https://kaifeng-h.github.io",
  "status": "success",
  "content": "Kaifeng Huang - Home Kaifeng Huang - 黄凯锋 Research Interests Software&AI Supply Chain. Software and AI systems are inherently complex. Achieving a clear assessment of security, maintenance, and legal risks in the software and AI supply chain , along with developing effective mitigation strategies , remains a significant challenge. Our mission is to simplify this process by providing comprehensive evaluations and actionable solutions that enhance security and compliance throughout the lifecycle of software and AI systems. Software Security. The software system is vulnerable to security issues. We are interested in but not limited to topics such as software vulnerability detection/assessment/mitigation , malicious software/AIWare/LLMWare detection , and privacy protection . Our goal is to identify potential security risks and prevent the leakage of sensitive privacy information (e.g., LLM privacy). Software Evolution. The software evolves constantly, leading to issues like version fragmentation , API incompatibility , API deprecation , and merge conflict . Our goal is to assess the challenges this evolution presents to downstream software and provide automated techniques to alleviate these issues. See my work Highlights VMUD: Detecting Recurring Vulnerabilities with Multiple Fixing Functions via Function Selection and Semantic Equivalent Statement Matching. Kaifeng Huang , Chenhao Lu, Yiheng Cao, Bihuan Chen, Xin Peng. In Proceedings of the 31th ACM Conference on Computer and Communications Security, Salt Lake City, United States, accepted, 2024. Vision: Identifying Affected Library Versions for Open Source Software Vulnerabilities. Susheng Wu, Ruisi Wang, Kaifeng Huang , Yiheng Cao, Wenyan Song, Zhuotong Zhou, Yiheng Huang, Bihuan Chen, Xin Peng. In Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering, Sacramento, California, United States, pp. 1447-1459, 2024. Identifying Affected Libraries and Their Ecosystems for Open Source Software Vulnerabilities. Susheng Wu, Wenyan Song, Kaifeng Huang , Bihuan Chen, Xin Pen. In Proceedings of the 46th IEEE/ACM International Conference on Software Engineering (ICSE), Lisbon, Portugal, pp. 162: 1-12, 2024. [2025.11] Our paper titled \"Uncovering Pretraining Code in LLMs: A Syntax-Aware Attribution Approach\" is accepted by AAAI 2026 . [2025.11] I was honored to be selected as a Distinguished Reviewer for the 40th IEEE/ACM International Conference on Automated Software Engineering (ASE 2025)! [2025.06] I was invited to serve as a reviewer for the Chinese Journal of Computers. [2025.06] I was invited to serve on the Program Committee of the Research Track at FSE 2026 . [2025.06] I was invited to give a talk at the 1st International Workshop on Large Language Model Supply Chain Analysis (LLMSC 2025) ! [2025.06] I was invited to serve on the Program Committee of the SEIP Track on the APSEC 2025 . Welcome to submit your papers! [2025.06] Our paper titled \"MalGuard: Towards Real-Time, Accurate, and Actionable Detection of Malicious Packages in PyPI Ecosystem\" is accepted by USENIX Security 2025 . [2025.02] I was invited to serve on the Program Committee of the Research Track at ASE 2025 . Welcome to submit your papers! [2025.02] I was invited to serve on the Program Committee at the 1st International Workshop on Large Language Model Supply Chain Analysis (LLMSC 2025) . Welcome to submit your papers! [2025.01] Our paper titled \"LLMs Meet Library Evolution: Evaluating Deprecated API Usage in LLM-based Code Completion\" is accepted by ICSE 2025 . [2025.01] I was invited to serve as a reviewer for the Transactions on Information Forensics & Security . [2024.10] Our paper titled \"Killing Two Birds with One Stone: Malicious Package Detection in NPM and PyPI using a Single Model of Malicious Behavior Sequence\" is accepted by ACM Transactions on Software Engineering and Methodology . [2024.08] Our paper titled \"VMUD: Detecting Recurring Vulnerabilities with Multiple Fixing Functions via Function Selection and Semantic Equivalent Statement Matching\" is accepted by CCS 2024 . [2024.08] Our paper titled \"Vision: Identifying Affected Library Versions for Open Source Software Vulnerabilities\" is accepted by ASE 2024 . [2024.08] Our paper titled \"1+1>2: Integrating Deep Code Behaviors with Metadata Features for Malicious PyPI Package Detection\" is accepted by ASE 2024 . [2024.07] Our paper titled \"Your \"Notice\" is Missing: Detecting and Fixing Violations of Modification Terms in Open Source Licenses during Forking\" is accepted by ISSTA 2024 . [2024.05] Our paper titled \"Detecting Incompatible Third-Party Library APIs in Python Based on Static Analysis\" is accepted by JOS . [2024.03] I was invited to serve on the Program Committee of the Research Track at AIWare 2024 Challenge Track . [2024.03] I was invited to serve on the Program Committee of the Research Track at ISSRE 2024 . [2024.02] I have joined Tongji University as an Assitant Professor! More [2023.12] Our paper titled \"Enhancing Field Tracking and Interprocedural Analysis to Find More Null Pointer Exceptions\" is accepted by SANER 2024 . [2023.12] Our paper titled \"Identifying Affected Libraries and Their Ecosystems for Open Source Software Vulnerabilities\" is accepted by ICSE 2024 . [2023.12] I was invited to serve on the Program Committee of the Research Track at ASE 2024 . [2023.07] One paper titled \"Demystifying Dependency Bugs in Deep Learning Stack\" is accepted by ESEC/FSE 2023 . [2023.06] I was invited to serve on the Program Committee of the Artifact Evaluation Track at ESEC/FSE 2023 . [2023.06] One paper titled \"Characterizing the Complexity and Its Impact on Testing in ML-Enabled Systems - A Case Study on Rasa\" is accepted by ICSME 2023 . [2022.09] I was invited to serve on the Program Committee of the Artifact Evaluation Track at ICSE 2023 . [2022.08] I was invited to serve on the Program Committee of Tool Demo Track at SANER 2023 . [2022.06] One paper titled \"Tracking Patches for Open Source Software Vulnerabilities\" is accepted by ESEC/FSE 2022 . [2022.04] I was awarded the Outstanding Graduate of Fudan University. [2022.02] One paper titled \"Characterizing Usages, Updates and Risks of Third-Party Libraries in Java Projects\" is accepted by EMSE 2022 . [2022.01] I joined Fudan University as a Postdoctoral Research Fellow. [2021.12] I was honored to receive Fudan Super-PostDoctoral Fellowship. [2021.12] I got my PhD from Fudan University. Thesis entitled \"Third-Party Library Harmonization and Update Recommendation Based on API Analysis\". [2021.12] I was honored to give talks at \" 2021 CCF Chinasoft Open Source Symposium\" and \"2021 CCF Chinasoft Doctoral Symposium\" [2021.07] One paper titled \"RepFinder: Finding Replacements for Missing APIs in Library Update\" is accepted by ASE 2021 . [AAAI'26] Uncovering Pretraining Code in LLMs: A Syntax-Aware Attribution Approach. [arXiv] Yuanheng Li, Zhuoyang Chen, Xiaoyun Liu, Yuhao Wang, Mingwei Liu, Yang Shi, Kaifeng Huang, Shengjie Zhao. In Proceedings of the 40th Annual AAAI Conference on Artificial Intelligence , Singapore, accepted, 2025. [USENIX Security'25] MalGuard: Towards Real-Time, Accurate, and Actionable Detection of Malicious Packages in PyPI Ecosystem. [PDF] Xingan Gao, Xiaobing Sun, Sicong Cao, Kaifeng Huang, Di Wu, Xiaolei Liu, Xingwei Lin, Yang Xiang. In Proceedings of the 34th USENIX Security Symposium, SEATTLE, WA, United States, pp. 4741-4758, 2025. [ICSE'25] LLMs Meet Library Evolution: Evaluating Deprecated API Usage in LLM-based Code Completion. [PDF] Chong Wang, Kaifeng Huang, Jian Zhang, Yibo Feng, Lyuye Zhang, Yang Liu, Peng Xin. In Proceedings of the 47th IEEE/ACM International Conference on Software Engineering, Ottawa, Ontario, Canada, pp. 885-897, 2025. [TOSEM'25] Killing Two Birds with One Stone: Malicious Package Detection in NPM and PyPI using a Single Model of Malicious Behavior Sequence. [PDF] Junan Zhang, Kaifeng Huang, Yiheng Huang, Bihuan Chen, Ruisi Wang, Chong Wang, Xin Peng. ACM Transactions on Software Engineering and Methodology, accepted, 2025. [CCS'24] VMUD: Detecting Recurring Vulnerabilities with Multiple Fixing Functions via Function Selection and Semantic Equivalent Statement Matching. [PDF] Kaifeng Huang, Chenhao Lu, Yiheng Cao, Bihuan Chen, Xin Peng. In Proceedings of the 31th ACM Conference on Computer and Communications Security, Salt Lake City, United States, pp. 3958-3972, 2024. [ASE'24] Vision: Identifying Affected Library Versions for Open Source Software Vulnerabilities. [PDF] Susheng Wu, Ruisi Wang, Kaifeng Huang, Yiheng Cao, Wenyan Song, Zhuotong Zhou, Yiheng Huang, Bihuan Chen, Xin Peng. In Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering, Sacramento, California, United States, pp. 1447-1459, 2024. [ASE'24] 1+1>2: Integrating Deep Code Behaviors with Metadata Features for Malicious PyPI Package Detection. [PDF] Xiaobing Sun, Xingan Gao, Sicong Cao, Lili Bo, Xiaoxue Wu, Kaifeng Huang. In Proceedings of the 39th IEEE/ACM International Conference on Automated Software Engineering, Sacramento, California, United States, pp. 1159-1170, 2024. [ISSTA'24] Your \"Notice\" is Missing: Detecting and Fixing Violations of Modification Terms in Open Source Licenses during Forking. [PDF] Kaifeng Huang, Yingfeng Xia, Bihuan Chen, Siyang He, Huazheng Zeng, Zhuotong Zhou, Jin Guo, Xin Peng. In Proceedings of the 33rd ACM SIGSOFT International Symposium on Software Testing and Analysis, Vienna, Austria, pp. 1022-1034, 2024. [JOS] 基于静态分析的Python第三方库API兼容性问题检测方法 (Detecting Incompatible Third-Party Library APIs in Python Based on Static Analysis). [PDF] 沈阚, 黄凯锋, 陈碧欢, 彭鑫. 软件学报（Journal of Software）, 36(4), pp. 1435-1460, 2024. [SANER'24] Enhancing Field Tracking and Interprocedural Analysis to Find More Null Pointer Exceptions. [PDF] Dongfang Xie, Bihuan Chen, Kaifeng Huang, Yu Wang, Linghao Pan, Zhicheng Chen, Xin Peng. In Proceedings of the 31st IEEE International Conferen",
  "content_length": 15631,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:29"
}