{
  "name": "Kaihua Qin",
  "homepage": "https://qin.ac",
  "status": "success",
  "content": "Kaihua Qin | Assistant Professor in Computer Science | PhD Positions Available | Blockchain Security Research Kaihua Qin Assistant Professor Department of Computer Science University of Warwick kaihua[at]qin[dot]ac About Me I am an Assistant Professor in the Department of Computer Science at the University of Warwick. Before joining Warwick, I conducted research at Yale University with Prof. Fan Zhang and Prof. Zhong Shao. I earned my PhD at Imperial College London under the supervision of Prof. Arthur Gervais. Prior to that, I received my MSc from Imperial College London and my BE from Southeast University. I co-founded Decentralized Intelligence (D23E), where we advance decentralization and intelligence. Research Decentralized Systems Securing blockchains and other decentralized systems, with focuses on information security, distributed computing, and applied cryptography. Cryptoeconomics Bringing together game theory, mechanism design, and causal inference to align incentives and ensure resilient decentralized finance. AI for Security Applying AI to enhance cybersecurity, including automating threat detection and vulnerability management. Security of AI Safeguarding machine learning models against adversarial attacks, privacy breaches, and other threats. PhD Positions Available - Currently Recruiting! I'm actively recruiting PhD students for my research group. If you're interested in pursuing a PhD in my research areas, please feel free to reach out with your CV at Kaihua[dot]Qin[at]warwick.ac.uk. Funding: Various funding opportunities are available. Please speak to me directly to discuss the options. Note that I may not respond to every inquiry. Bibliometrics can be found on Google Scholar. 2025 ▼ SIGMETRICS 25 Blockchain Amplification AttackTaro Tsuchiya, Liyi Zhou, Kaihua Qin, Arthur Gervais, Nicolas ChristinarXiv ISSTA 25 Enhancing Smart Contract Security Analysis with Execution Property GraphsKaihua Qin, Zhe Ye, Zhun Wang, Weilin Li, Liyi Zhou, Chao Zhang, Dawn Song, Arthur GervaisarXiv S&P 25 Security Perceptions of Users in Stablecoins: Advantages and Risks within the Cryptocurrency EcosystemMaggie Yongqi Guan, Yaman Yu, Tanusree Sharma, Molly Zhuangtong Huang, Kaihua Qin, Yang Wang, Kanye Ye WangePrint 2024 ▼ WWW 24 Blockchain censorshipAnton Wahrstätter, Jens Ernstberger, Aviv Yaish, Liyi Zhou, Kaihua Qin, Taro Tsuchiya, Sebastian Steinhorst, Davor Svetinovic, Nicolas Christin, Mikolaj Barczentewicz, othersarXiv AFT 24 DeFiAligner: Leveraging Symbolic Analysis and Large Language Models for Inconsistency Detection in Decentralized FinanceRundong Gan, Liyi Zhou, Le Wang, Kaihua Qin, Xiaodong Lin Security 24 Speculative Denial-of-Service Attacks In EthereumAviv Yaish, Kaihua Qin, Liyi Zhou, Aviv Zohar, Arthur GervaisePrint ICBC 24 What Drives the (In) stability of a Stablecoin?Yujin Potter, Kornrapat Pongmala, Kaihua Qin, Ariah Klages-Mundt, Philipp Jovanovic, Christine Parlour, Arthur Gervais, Dawn SongarXiv 2023 ▼ FC 23 Mitigating decentralized finance liquidations with reversible call optionsKaihua Qin, Jens Ernstberger, Liyi Zhou, Philipp Jovanovic, Arthur GervaisarXiv WWW 23 On how zero-knowledge proof blockchain mixers improve, and worsen user privacyZhipeng Wang, Stefanos Chaliasos, Kaihua Qin, Liyi Zhou, Lifeng Gao, Pascal Berrang, Benjamin Livshits, Arthur GervaisarXiv S&P 23 Sok: Decentralized finance (defi) attacksLiyi Zhou, Xihan Xiong, Jens Ernstberger, Stefanos Chaliasos, Zhipeng Wang, Ye Wang, Kaihua Qin, Roger Wattenhofer, Dawn Song, Arthur GervaisarXiv Security 23 The blockchain imitation gameKaihua Qin, Stefanos Chaliasos, Liyi Zhou, Benjamin Livshits, Dawn Song, Arthur GervaisarXiv | Blog 2022 ▼ S&P 22 Quantifying blockchain extractable value: How dark is the forest?Kaihua Qin, Liyi Zhou, Arthur GervaisarXiv FC 22 Speculative multipliers on defi: Quantifying on-chain leverage risksZhipeng Wang, Kaihua Qin, Duc Vu Minh, Arthur Gervais 2021 ▼ IMC 21 An empirical study of defi liquidations: Incentives, risks, and instabilitiesKaihua Qin, Liyi Zhou, Pablo Gamito, Philipp Jovanovic, Arthur GervaisarXiv FC 21 Attacking the defi ecosystem with flash loans for fun and profitKaihua Qin, Liyi Zhou, Benjamin Livshits, Arthur GervaisarXiv | Blog S&P 21 High-frequency trading on decentralized on-chain exchangesLiyi Zhou, Kaihua Qin, Christof Ferreira Torres, Duc V Le, Arthur GervaisarXiv S&P 21 On the just-in-time discovery of profit-generating transactions in defi protocolsLiyi Zhou, Kaihua Qin, Antoine Cully, Benjamin Livshits, Arthur GervaisarXiv 100% Loading PDF...",
  "content_length": 4568,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:30"
}