{
  "name": "Kaili Zhao",
  "homepage": "https://zkl20061823.github.io",
  "status": "success",
  "content": "Kaili Zhao Kaili ZhaoAssociate Professor at Beijing University of Posts and Telecommunications Follow Bay Area Email LinkedIn Github Google ScholarI am an experienced researcher specializing in computer vision and machine learning with 10+ years of dedicated work. My research focuses on multimodal representation learning, human perception (face & body), and AI-powered maintenance for automated condition monitoring. I have a publication record in top venues (such as CVPR/ICCV/ECCV), and am passionate in translating research into real-world applications. I have successfully led cross-functional teams from designing, implemention to delivering solutions for renowned institutions such as Tencent, Docomo, and Anding Hospital in Beijing. Currently, I am an associate professor at Beijing University of Posts and Telecommunications. I spent one year at the Robotics Institute of CMU with Fernando De la Torre and Jeff F. Cohn, and another year at the Department of Electrical and Computer Engineering of OSU with Aleix M. Martinez. News[2022-12] Congrats to Lanfei Wang on the acceptance of two papers on Neural Architecture Search (with Huawei)![2022-08] I am honored to be selected as a Doctoral Advisor (outstanding Associate Professors recognized for examining grant proposals and PhD theses).[2022-06] Congrats to Shi Pu for presenting zero-shot video classification at CVPR 2022! This work has been adopted in Tencent's Short Video Recommendation System.[2021-10] Congrats to Mingfei Cheng on the Curvilinear Structure Segmentation work presented at ICCV 2021![2021-09] Our grant on \"Cross-domain Facial Action Unit Detection\" is accepted by NSFC of China with a funding rate of 17%.[2020-10] Congrats to Xiaolin Song for presenting Occludded Pedestrian Detection work at ECCV 2020.[2019-12] I was promoted to Associate Professor at the School of Artifical Intelligence and the School of Information and Communication Engineering.Publications Video Attribute Prototype Network: A New Perspective for Zero-Shot Video Classification Bo Wang, Kaili Zhao, Hongyang Zhao, Shi Pu, Bo Xiao, Jun Guo ICCV'W 2023 AB-Net: Enhancing Anchor-Free Human Detection through Cascade Design and Bi-Center Strategy Hongyang Zhao, Kaili Zhao Under review Alignment-Uniformity Representation Learning for Zero-shot Video Classification Kaili Zhao*, Shi Pu*, Mao Zheng (*equal contribution) CVPR 2022 Paper Slides Code M2NAS: Joint Neural Architecture Optimization System with Network Transmission Lanfei Wang, Lingxi Xie, Kaifeng Bi, Kaili Zhao, Jun Guo, Qi Tian IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems 2022 Paper Regularized Differentiable Architecture Search Lanfei Wang, Lingxi Xie, Kaili Zhao, Jun Guo, Qi Tian IEEE Embedded Systems Letters 2022 Paper Joint Topology-preserving and Feature-refinement Network for Curvilinear Structure Segmentation Kaili Zhao*, Mingfei Cheng*, Xuhong Guo, Yajing Xu, Jun Guo (*equal contribution) ICCV 2021 Paper Slides Code Progressive Refinement Network for Occludded Pedestrian Detection Kaili Zhao*, Xiaolin Song*, Wen-Sheng Chu, Honggang Zhang, Jun Guo (*equal contribution) ECCV 2020 Paper Slides Code Video Robust visual tracking by embedding combination and weighted-gradient optimization Jin Feng, Peng Xu, Shi Pu, Kaili Zhao, Honggang Zhang Pattern Recognition 2020 Paper Enhanced Initialization with Multi-Stage Learning for Robust Visual Tracking Jin Feng, Shi Pu, Kaili Zhao, Honggang Zhang, Tianming Du IEEE Visual Communications and Image Processing 2019 (oral) Paper Learning Facial Action Units from Web Images with Scalable Weakly Supervised Clustering Kaili Zhao, Wen-Sheng Chu, Aleix M. Martinez CVPR 2018 Paper Poster Code Deep Region and Multi-label Learning for Facial Action Unit Detection Kaili Zhao, Wen-Sheng Chu, Honggang Zhang CVPR 2016 Paper Poster Code Joint Patch and Multi-label Learning for Facial Action Unit and Holistic Expression Recognition Kaili Zhao, Wen-Sheng Chu, Fernando De la Torre, Jeffery F. Cohn, Honggang Zhang IEEE Transactions on Image Processing 2016 Paper Code Joint Patch and Multi-label Learning for Facial Action Unit Detection Kaili Zhao, Wen-Sheng Chu, Fernando De la Torre, Jeffery F. Cohn, Honggang Zhang CVPR 2015 Paper Poster CodeIndustrial GrantsPI, “Metallic Corrosion Detection,” with DOCOMO Beijing Communications Laboratories Co., Ltd., 11/2021–nowPI, “Cross-domain Facial Action Unit Detection,” with National Natural Science Foundation of China, 01/2021–12/2024PI, “Human Attention and Counting for Indoor Watching,” with DOCOMO Beijing Communications Laboratories Co., Ltd., 10/2019–06/2020PI, “Crowd Counting on Street-view Images,” with DOCOMO Beijing Communications Laboratories Co., Ltd., 03/2019–08/2019PI, “Drone-based Image Processing for Crack Inspection,” with DOCOMO Beijing Communications Laboratories Co., Ltd., 06/2018–08/2019PI, “Weakly-supervised Spectral Clustering and Its Application to Recognize Facial Expressions in 1 Million Facial Images,” with National Natural Science Foundation of China, 09/2017–12/2020PI, “Multi-label Learning for Facial Action Unit Detection,” with Fundamental Research Funds for the Central Universities, 07/2017–10/2018Co-PI, “Depression Detection based on Automatic Facial Action Unit Analysis,” with Institute of Mental Health, Beijing Anding Hospital (top psychiatry and mental health hospital in China), 11/2017–11/2021StudentsPhD StudentsXiaolin Song (2023), now in AlibabaLanfei Wang (2022), now in HuaweiJin Feng (2021), now in JDShi Pu (2020), now in TencentMS StudentsYuqi Liao (2025)Yishan Chen (2025)Wenqi Xu (2024)Hongyang Zhao (2023), now in BaiduBo Wang (2023), now in ByteDanceMingfei Cheng (2022), now PhD at Singapore Management UniverisityTeachingIntroduction to Artificial Intelligence (2021): 110 undergrad students.Intelligent Image Analysis (2020, 2021): 270 graduate students.Digital Image Processing (2017, 2018): 190 undergrad students.",
  "content_length": 5943,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:30"
}