{
  "name": "Kailun Yang 0001",
  "homepage": "https://yangkailun.com",
  "status": "success",
  "content": "Kailun Yang 杨恺伦 Personal Web Page Contact Address: Office 206, Building B3, Fenghuangshan Road 66, Yuelu District, Changsha 410012, Hunan, China. Click to copy Email: kailun.yang@hnu.edu.cn Visitor Traffic Welcome I am a Professor at School of Artificial Intelligence and Robotics and National Engineering Research Center of Robot Visual Perception and Control Technology, Hunan University (HNU). I was a PostDoctoral Researcher at Computer Vision for Human-Computer Interaction (CV:HCI) Lab, Karlsruhe Institute of Technology (KIT), where I worked with Prof. Rainer Stiefelhagen. I obtained my PhD degree in Information Sensing and Instrumentation from Zhejiang University (ZJU). My PhD research was jointly advised by Prof. Kaiwei Wang and Prof. Jian Bai at State Key Laboratory of Modern Optical Instrumentation, ZJU, as well as Prof. Luis Miguel Bergasa at Robotics and eSafety (RobeSafe) Research Group, University of Alcalá (UAH). Before my PhD, I obtained my dual B.S. degrees in Measurement Technology and Instrumentation from Beijing Institute of Technology (BIT) and Economics from Peking University (PKU). At Computer Vision for Panoramic Understanding Lab (CV:PU), we research computer vision and computational imaging methods for panoramic and holistic perception to enable omnidirectional, multi-dimensional, omni-modal, and cross-embodiment scene understanding in order to support open- and real-world applications spanning across autonomous driving, assistive navigation, and quadruped robot systems. If you have an interest in {Computer Vision, Scene Understanding, Embodied AI, Autonomous Driving}, please send an e-mail to kailun.yang@hnu.edu.cn. Publications Preprints 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 Preprints 折叠 Y. Gao, L. Sun, S. Gao, Q. Jiang, K. Yang, W. Hu, X. Qian, W. Li, L. Van Gool, K. Wang. Neuro-inspired automated lens design. [PDF] [DATA] K. Luo, H. Shi, K. Peng, F. Teng, S. Wu, K. Wang, K. Yang. OmniTrack++: Omnidirectional Multi-Object Tracking by Learning Large-FoV Trajectory Feedback. [PDF] [DATA+CODE] K. Peng, D. Wen, J. Fu, J. Wu, K. Yang, J. Zheng, R. Liu, Y. Chen, Y. Fu, D.P. Paudel, L. Van Gool, R. Stiefelhagen. RefAtomNet++: Advancing Referring Atomic Video Action Recognition using Semantic Retrieval based Multi-Trajectory Mamba. [PDF] [DATA+CODE] S. Li, F. Teng, Y. Cao, K. Yang, Z. Li, Y. Wang. NRSeg: Noise-Resilient Learning for BEV Semantic Segmentation via Driving World Models. [PDF] [CODE] C. Liao, X. Zheng, Y. Lyu, H. Xue, Y. Cao, J. Wang, K. Yang, X. Hu. MemorySAM: Memorize Modalities and Semantics with Segment Anything Model 2 for Multi-modal Semantic Segmentation. [PDF] [CODE] Z. Yi, H. Shi, Q. Jiang, Y. Gao, Z. Wang, Y. Zhang, K. Yang, K. Wang. Benchmarking the Robustness of Optical Flow Estimation to Corruptions. [PDF] [DATA+CODE] S. Li, Y. Cao, H. Shi, Y. Zang, X. He, K. Yang, Z. Li. HierDAMap: Towards Universal Domain Adaptive BEV Mapping via Hierarchical Perspective Priors. [PDF] [CODE] Y. Zhang, K. Yang, Z. Wang, K. Wang. P2U-SLAM: A Monocular Wide-FoV SLAM System Based on Point Uncertainty and Pose Uncertainty. [PDF] [CODE] M. Duan, Y. Zhang, Y. Cao, F. Teng, K. Luo, J. Zhang, K. Yang, Z. Li. Panoramic Out-of-Distribution Segmentation for Autonomous Driving. [PDF] [DATA+CODE] J. Sun, W. Sun, G. Zhang, K. Yang, S. Li, X. Meng, N. Deng, C. Tan. CT-UIO: Continuous-Time UWB-Inertial-Odometer Localization Using Non-Uniform B-spline with Fewer Anchors. [PDF] [DATA+CODE] R. Wu, J. Song, F. Teng, X. Ren, Y. Gao, K. Yang. Visually Grounded Narratives: Reducing Cognitive Burden in Researcher-Participant Interaction. [PDF] H. Qin, X. Lu, Z. Wei, Y. Cao, K. Yang, N. Chen. Language-Driven Dual Style Mixing for Single-Domain Generalized Object Detection. [PDF] [CODE] F. Teng, B. Deng, B. Zheng, K. Luo, K. Peng, J. Zhang, K. Yang. Unifying Light Field Perception with Field of Parallax. [PDF] [CODE] S. Li, K. Yang, H. Shi, S. Wang, Y. Yao, Z. Li. GenMapping: Unleashing the Potential of Inverse Perspective Mapping for Robust Online HD Map Construction. [PDF] [CODE] Z. Yu, X. Qian, S. Gao, Q. Jiang, Y. Gao, K. Yang, K. Wang. Seeing Clearly and Deeply: An RGBD Imaging Approach with a Bio-inspired Monocentric Design. [PDF] [CODE] Y. Zhang, M. Duan, K. Peng, Y. Wang, R. Liu, F. Teng, K. Luo, Z. Li, K. Yang. Out-of-Distribution Semantic Occupancy Prediction. [PDF] [DATA+CODE] H. Lin, W. Chen, X. Chen, F. Yang, Q. Diao, W. Xie, S. Wu, K. Yang, M. Li, Y. Wang. UniFucGrasp: Human-Hand-Inspired Unified Functional Grasp Annotation Strategy and Dataset for Diverse Dexterous Hands. [PDF] [DATA+CODE] J. Jiao, X. Cheng, K. Yang, X. Zhang, L. Jiao. DeProPose: Deficiency-Proof 3D Human Pose Estimation via Adaptive Multi-View Fusion. [PDF] [DATA+CODE] X. Hong, S. Li, K. Zeng, H. Shi, B. Peng, K. Yang, Z. Li. TS-CGNet: Temporal-Spatial Fusion Meets Centerline-Guided Diffusion for BEV Mapping. [PDF] [CODE] Q. Jiang, Y. Gao, S. Gao, Z. Yi, X. Qian, H. Shi, K. Yang, L. Sun, K. Wang. OmniLens: Towards Universal Lens Aberration Correction via LensLib-to-Specific Domain Adaptation. [PDF] [DATA+CODE] S. Fu, J. Zhang, K. Yang. Transforming Noise Distributions with Histogram Matching: Towards a Single Denoiser for All. [PDF] X. Zheng, C. Liao, Z. Weng, K. Lei, Z. Dongfang, H. He, Y. Lyu, L. Jiang, L. Qi, L. Chen, D.P. Paudel, K. Yang, L. Zhang, L. Van Gool, X. Hu. PANORAMA: The Rise of Omnidirectional Vision in the Embodied AI Era. [PDF] L. Zhang, T.-L. Wu, A. Sidarta, X. Yan, P. Jatesiktat, K. Yang, W. T. Ang. Detecting Heel Strike and toe off Events Using Kinematic Methods and LSTM Models. [PDF] X. He, J. Yuan K. Yang, Z. Zeng, Z. Li. S3-MonoDETR: Supervised Shape&Scale-perceptive Deformable Transformer for Monocular 3D Object Detection. [PDF] [CODE] H. Shi, Z. Wang, S. Guo, M. Duan, S. Wang, T. Chen, K. Yang, L. Wang, K. Wang. OneOcc: Semantic Occupancy Prediction for Legged Robots with a Single Panoramic Camera [PDF] [DATA+CODE] X. Qian, Q. Jiang, L. Sun, Z. Yu, K. Yang, P. Wu, J. Zhou, Y. Gao, Y. Ma, M.-H. Yang, K. Wang. Learning Latent Transmission and Glare Maps for Lens Veiling Glare Removal [PDF] [DATA+CODE] Z. Dongfang, X. Zheng, Z. Weng, Y. Lyu, D.P. Paudel, L. Van Gool, K. Yang, X. Hu. Are Multimodal Large Language Models Ready for Omnidirectional Spatial Reasoning? [PDF] [DATA] F. Teng, K. Luo, S. Wu, S. Li, P. Guo, J. Wei, K. Peng, J. Zhang, K. Yang. Hallucinating 360°: Panoramic Street-View Generation via Local Scenes Diffusion and Probabilistic Prompting. [PDF] [CODE] B. Deng, L. Huang, K. Luo, F. Teng, K. Yang. DepTR-MOT: Unveiling the Potential of Depth-Informed Trajectory Refinement for Multi-Object Tracking. [PDF] [CODE] W. Li, K. Peng, D. Wen, R. Liu, M. Duan, K. Luo, K. Yang. Segment-to-Act: Label-Noise-Robust Action-Prompted Video Segmentation Towards Embodied Intelligence. [PDF] [CODE] K. Peng, D. Wen, D. Schneider, J. Zhang, K. Yang, M.S. Sarfraz, R. Stiefelhagen, A. Roitberg. Exploring Few-Shot Adaptation for Activity Recognition on Diverse Domains. [PDF] [DATA+CODE] L. Kong, J. Lin, S. Li, K. Luo, Z. Li, K. Yang. CoBEVMoE: Heterogeneity-aware Feature Fusion with Dynamic Mixture-of-Experts for Collaborative Perception. [PDF] [CODE] D. Wen, K. Peng, J. Zheng, Y. Chen, Y. Shi, J. Wei, R. Liu, K. Yang, R. Stiefelhagen. MICA: Multi-Agent Industrial Coordination Assistant. [PDF] [CODE] S. Guo, H. Shi, S. Wang, X. Yin, K. Yang, K. Wang. Event-aided Semantic Scene Completion. [PDF] [DATA+CODE] X. Yin, H. Shi, K. Yang, J. Zhai, S. Guo, L. Wang K. Wang. Event-guided 3D Gaussian Splatting for Dynamic Human and Scene Reconstruction. [PDF] K. Peng, D. Wen, K. Yang, J. Fu, Y. Chen, R. Liu, J. Wu, J. Zheng, M.S. Sarfraz, L. Van Gool, D.P. Paudel, R. Stiefelhagen. EReLiFM: Evidential Reliability-Aware Residual Flow Meta-Learning for Open-Set Domain Generalization under Noisy Labels. [PDF] [CODE] D. Wen, K. Peng, K. Yang, Y. Chen, R. Liu, J. Zheng, D.P. Paudel, L. Van Gool, A. Roitberg, R. Stiefelhagen. RoHOI: Robustness Benchmark for Human-Object Interaction Detection. [PDF] [DATA+CODE] X. Zheng, H. Xue, J. Chen, Y. Yan, L. Jiang, Y. Lyu, K. Yang, L. Zhang, X. Hu. Learning Robust Anymodal Segmentor with Unimodal and Cross-modal Distillation. [PDF] [CODE] D. Wen, L. Qi, K. Peng, K. Yang, F. Teng, A. Luo, J. Fu, Y. Chen, R. Liu, Y. Shi, M.S. Sarfraz, R. Stiefelhagen. Go Beyond Earth: Understanding Human Actions and Scenes in Microgravity Environments. [PDF] [DATA+CODE] Q. Jiang, X. Qian, Y. Gao, L. Sun, K. Yang, Z. Yi, W. Li, Z. Yi, M.-H. Yang, L. Van Gool, K. Wang. OmniLens++: Blind Lens Aberration Correction via Large LensLib Pre-Training and Latent PSF Representation [PDF] [DATA+CODE] R. Liu, J. Zhang, A. Schön, K. Müller, J. Zheng, K. Yang, K. Gerling, R. Stiefelhagen. ObjectFinder: Open-Vocabulary Assistive System for Interactive Object Search by Blind People. [PDF] 2025 折叠 K. Peng, D. Wen, M.S. Sarfraz, Y. Chen, J. Zheng, D. Schneider, K. Yang, J. Wu, A. Roitberg, R. Stiefelhagen. Mitigating Label Noise using Prompt-Based Hyperbolic Meta-Learning in Open-Set Domain Generalization. International Journal of Computer Vision, 2025. [PDF] [CODE] F. Yang, W. Chen, K. Yang, H. Lin, D. Luo, C. Tang, Z. Li, Y. Wang. Learning Granularity-Aware Affordances from Human-Object Interaction for Tool-Based Functional Grasping in Dexterous Robotics. IEEE Transactions on Neural Networks and Learning Systems, 2025. [PDF] [DATA+CODE] H. Shi, S. Wang, J. Zhang, X. Yin, G. Wang, J. Zhu, K. Yang, K. Wang. Offboard Occupancy Refinement with Hybrid Propagation for Autonomous Driving. IEEE Transactions on Intelligent Transportation Systems, 2025. [PDF] [CODE] H. Li, Q. Hu, B. Zhou, Y. Yao, J. Lin, K. Yang, P. Chen. CFMW: Cross-modality Fusion Mamba for Robust Object Detection under Adverse Weather. IEEE Transactions on Circuits and Systems for Video Technology, 2025. [PDF] [DATA+CODE] X. Qian, Q. Jiang, Y. Gao, S. Gao, Z. Yi, L. Sun, K. Wei, H. Li, K. Yang, K. Wang, J. Bai. Towards Single-Lens Controllable Depth-o",
  "content_length": 53976,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:31"
}