{
  "name": "Kaiqi Huang",
  "homepage": "http://people.ucas.ac.cn/~huangkaiqi?language=en",
  "status": "success",
  "content": "黄凯奇-中国科学院大学-UCAS [中文] [English] Honors & Distinctions Publications Research Interests Research Grants Students Research Areas Academy Activities General Dr. Huang received his BSc and MSc from Nanjing University of Science Technology, China and obtained his PhD degree from Southeast University. He has worked in National Lab. of Pattern Recognition (NLPR), Institute of Automation, Chinese Academy of Science (CASIA), China since 2004, and he has been an  full professor in NLPR from 2011. He is IEEE Senior member and deputy general secretary of IEEE Beijing Section (2006-2008). Dr. Huang has initiated, set direction and managed successfully many leading-edge research projects, including National Science Foundation of China, National High Technology Research and Development Program(\"863\"Program) of China, and many International collaborative projects. He serves as over forty technique program committee members of international conference. Since 2007, Dr. Huang has been a regular independent expert evaluator and reviewer for National Science Foundation of China (NSFC)) on research grant application and project progress appraisal; he is an executive team member of IEEE SMC Cognitive Computing Committee as well as Associate Editor of IEEE Trans on Systems, Man, and Cybernetics: Systems (TSMC), Pattern Recognition(PR), International Journal of image and graphics (IJIG) and many Guest Editors of journals such as TSMC, Signal Processing, PRL and so on. He has obtained many awards such as CCF&IEEE CS Young Conputer Scientist Award(2016), The Ten Outstanding Young  Scientist of Chinese Academy of Science (2017), The ImageNet Chanllege First Prize in image object localization  task (additional data) (2014), the PASCAL VOC First Prize in Object Detection Task (2010,2011)，Second Prize of National Science and Technology Progress Award in 2010. His current research interests include visual surveillance、image understanding, pattern recognition and biological based vision and son on. He has published over 200 papers in the important international journals and conference such as IEEE TIPAMI, T-IP, T-SMC-B, TCSVT, Pattern Recognition (PR), Computer Vision and Image Understanding (CVIU), ICCV, ECCV, CVPR, ICIP, ICPR. Experience Work Experience Visiting Professor  2015-2016,          Oxford University, Department of Science and EngineeringProfessor Oct. 2011-Present         National Lab. of Pattern Recognition (NLPR), Institute of Automation, Chinese Academy of Science (CASIA),China Asso.Prof. Dec. 2005-Oct. 2011      NLPR,CASIA,China Postdoc. Mar.2004-Dec.2005          NLPR,CASIA,China Teaching Experience Video Processing and Analysis 2016Video Processing and Analysis 2017Video Processing and Analysis 2018Video Processing and Analysis 2019Video Processing and Analysis 2020Video Processing and Analysis 2021 Honors & Distinctions Awards 1. Beijing Science & Technology Star Award,2008 2. The 12th China Patent Award (Outstanding Patent – Visual Surveillance), 2010. 3. Winner in Object Detection, PASCAL VOC 2010. 4. National Science and Technology Progress Award (Image Understanding for Visual Surveillance), 2011. 5. Best Student Paper Award (with X. Zhao et al), Asian Conference on Pattern Recognition, 2011. 6. Winner in Object Detection, PASCAL VOC 2011. 7. The Elsevier Best Paper Award (with X. Chen et al), Chinese Conference on Pattern Recognition, 2012. 8. the Excellent Young Scholars Award of National Science Foundation of China (NSFC)，2013 9. The first outstanding members of Youth Innovation Promotion Association, CAS,2013 10.Winner in Object Classification task in ImageNet-ILSVRC (additional data),201411.The National Youth Talent Support Program，201512.CCF&IEEE CS Young Conputer Scientist Award, 201613.The Ten Outstanding Young  Scientist Award of Chinese Academy of Science, 201714. Excellent Doctoral Dissertation Award nomination， China Society of Image and Graphics，201815. Second Prize of China Society of Image and Graphics，2021 Publications Papers Some Journal papers [1]K.Huang,J Xin,J.Zhang,et al.,\" Intelligent Techonogies of Human-Computer Gaming\", SCIENTIA SINICA Information, 2020,Vol.4,No.50,Pp:540-550[2]K.Huang,XT. Chen,Y.Kang,T.Tan,\" Intelligent Visual surveillance:A review\" Chnese Journal of Computers, 2014,Vol.37,No.49, 2015[3] K. Huang, C. Wang, D. Tao,\"High-Order Topology Modeling of Visual Words for Image Classification\". IEEE Trans. Image Processing (TIP) 24(11): 3598-3608, 2015 [4]Kaiqi Huang,Weiqiang.Ren,Tieniu.Tan,\"A Review on Image Object Detection and Classification,\" Chnese Journal of Computers, 37(6),1-18,.2014 [5]K.Huang,T.Tan,\"Review on Computational Model for Vision\",Pattern Recognition and Artificial Intelligence, 26(10), pp,951-958,2013[6] K. Huang, Y.Zhang, T.Tan, \"A Discriminative Model of Motion and Cross Ratio for View-invariant Action Recognition\", IEEE Transactions on Image Processing (TIP), 21(5):2187-2197, 2012 [7] K. Huang, D.Tao, X.Li, T.Tan,\"Biologically Inspired Features for Scene Classification in Video Surveillance\", IEEE Transactions on Systems, Man and Cybernetics, Part: B. (T-SMC-B), 41(1), pp: 307-313, Feb. 2011. [8] K. Huang, D.Tao, X.Li, T.Tan. &ldquo;View Independent Human Behavior Analysis&rdquo;, IEEE Transactions on Systems, Man and Cybernetics, Part: B. (T-SMC-B), vol. 39, no. 4, pp: 1028-1035, August 2009. [9] K. Huang, S. Wang, T. Tan, S.J.Maybank,\"Human Behavior Analysis Based on a New Motion Descriptor\", IEEE Transactions on Circuits and Systems for Video Technology (T-CSVT).vol.19, no.2, pp:1830-1840, 2009 [10] K. Huang, L.Wang, T.Tan, S.J.Maybank,\"A Real-time Detecting Tracking Distant Objects System for Night Surveillance\", Pattern Recognition (PR), Volume 41, Issue 1, pp: 432-444, 2008   (video挑战的夜间视频) [11] K. Huang, T. Tan, \"Vs-Star: a Visual Interpretation System for Visual Surveillance\", Pattern Recognition Letters (PRL), V. 31, Issue 14(15), Pp: 2265-2285, 2010  [12] K. Huang, Q.Wang, Z.Wu.\"Natural Color Image Enhancement Evaluation Algorithm based on Human Visual System\", Computer Vision and Image Understanding (CVIU), 103, pp: 52-63, 2006. [13] K. Huang, Q.Wang, Z.Wu,\"Color Image Denoising with Wavelet Thresholding based on Human Visual System Model\", Signal Processing: Image Communication(SP:IC), Vol. 20 ( 2). pp: 115-127, 2005. [14] K. Huang, Q.Wang, Z.Wu,\"Image Enhancement based on the Statistics of Visual Representation\", Image and Vision Computing (IVC), V23, pp:51-57,2005.   [15] L Huang, X Zhao, K Huang, ”GOT-10k: A Large High-Diversity Benchmark for Generic Object Tracking in the Wild”, IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 43(5), 1562-1577, 2021[16] Li Y, J Zhang, K Huang,“Mixed Supervised Object Detection with Robust Objectness Transfer”, IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI), 41(3), 639-653, 2019                                             [17] W. Ren, K. Huang, D. Tao, T. Tan\"Weakly Supervised Large Scale Object Localization with Multiple Instance Learning and Bag Splitting.\" IEEE Trans. Pattern Anal. Mach. Intell (TPAMI). 38(2): 405-416, 2016[18] C.Wang, K.Huang,\" How to use Bag-of -Word model better for Image Classfication\", Image and Vision Computing (IVC), V.38. Pages,65-74,2015 [19] Y. Cheng, X. Zhao, K.Huang, T. Tan, \"Semi-supervised learning and feature evaluation for RGBD object recognition\",Computer Vision and Image Understanding(CVIU), Volume 139, October, Pages 149-160,2015 [20] C. Wang, K. Huang, W. Ren, J. Zhang, S. Maybank, &ldquo\"Large-Scale Weakly Supervised Object Localization via Latent Category Learning.&ldquo\" IEEE Trans. Image Processing(TIP) 24(4): 1371-1385, 2015 [21] Z. Zhang, T. Tan, K. Huang, \"An Extended Grammar System for Learning and Recognizing Complex Visual Events\", IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI), V.33 (2),Pp: 240-255,2011. [22] Z. Liu, K. Huang, T.Tan, \"Cast Shadow Removal Using MRF Based on Hierarchical Information\", IEEE Transactions on Circuits and Systems for Video Technology (T-CSVT), 22(1),pp,56-66,2012Some Conference papers [1] Kangwei Liu, Junge Zhang, Peipei Yang, Kaiqi Huang,\"GRSA: Generalized Range Swap Algorithm for the Efficient Optimization of MRFs\", The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2015, pp. 1761-1769[2] Yanhua Cheng, Rui Cai, Zhiwei Li, Xin Zhao, Kaiqi Huang, Yong Rui,\"Query Adaptive Similarity Measure for RGB-D Object Recognition\",The IEEEE International Conference on Computer Vision(ICCV), 2015.[3] Lianrui Fu, Junge Zhang, Kaiqi Huang,\"Beyond Tree Structure Models： A New Occlusion Aware Graphical Model for Human Pose Estimation\",The IEEEE International Conference on Computer Vision(ICCV), 2015.[4]Kangwei Liu, Junge Zhang, Kaiqi Huang and Tieniu Tan, “Deformable Object Matching via Deformation Decomposition based 2D Label MRF”, In IEEE Conference on Computer Vision and Pattern Recognition (CVPR) 2014.  [5]Chong Wang, Weiqiang Ren, Kaiqi Huang, Tieniu Tan, \"Weakly Supervised Object Localization with Latent Category Learning,\",ECCV 2014. [6] C. Wang, J. Zhang, P. Yang, and K. Huang, “Robust Object Recognition via Visual Pathway Feedback,” ICPR, 2014（Oral）[7] Weihua Chen,Lijun Cao,Xiaotang Cheng, Kaiqi Huang,\" A novel solution for multi-camera object tracking\", ICIP2014, (muit-camera tracking database: http://mct.idealtest.org/.)[8] Xiaotang Chen, Kaiqi Huang, Tieniu Tan,\" Learning the Three Factors of A Non-Overlapping Multi-Camera Network Topology\",Chinese Conference on Pattern Recognition(CCPR),2012, (Elsevier Best Paper Awards)[9]Y.Huang, Kaiqi Huang, T.Tan, “Salient Coding for Image Classification”, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2011， [10] J.Zhang, Kaiqi Huang, T.Tan, “Boosted Local Structured HOG-LBP for Object Localization”, IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2011， [11] Y.Huang, Kaiqi Huang, T.Tan,“ Exploring Relations of Visual Codes for Image Classification“, IEEE Conference on Compute",
  "content_length": 16335,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:31"
}