{
  "name": "Kaisheng Ma",
  "homepage": "https://iiis.tsinghua.edu.cn/en/People/Faculty/MaKaisheng.htm",
  "status": "success",
  "content": "ï»¿ Ma Kaisheng-Institute for Interdisciplinary Information Sciences (IIIS) Home IIIS Headlines Institute Seminars About IIIS Introduction Message From Dean Current Leadership History News Latest News Media Coverage People Faculty Research Honorary Professors Adjunct Instructors Postdocs Administrative Staff Lab Assistants Yao Class About Yao Class Admission Graduate Graduate Programs Graduate Admission CQI Introduction Faculty Research Overview CQI News Research Organization Research Groups Latest Research Research Report Campus Campus Events Student Life Join Us Faculty Recruitment Postdoctoral Recruitment Staff Recruitment Alumni IIIS Alumni Community Giving People Faculty Research Honorary Professors Adjunct Instructors Postdocs Administrative Staff Lab Assistants Kaisheng Ma AI+Chiplet, AI algorithm development, Self-driving, Implanted Systems, Neural Dusts Kaisheng Ma is a tenured associate professor of computer science in Institute for Interdisciplinary Information Sciences (IIIS), Tsinghua University. He leads the Algorithms, Architecture and Chipset Lab (ARChip). His research interests lie in the interdisciplinary fields of human-machine interface (HMI), brain-spired AI algorithm design, computer vision for self-driving, compact model design, computer architecture and microelectronics. He believes in vertical integration for systems, with a special emphasis on implanted medical and neural devices, and chip level system solutions for self-driving systems. He publishes papers on conferences including NeurIPS, ICCV, AAAI, CVPR, ISCA, ASPLOS, MICRO, HPCA, DAC etc. He received his Ph.D. in Computer Science and Engineering at the Pennsylvania State University, following Professor Vijaykrishnan Nanrayanan @ Penn State, Yuan Xie @ UCSB (Now at Alibaba DAMO Computing Lab), Jack Sampson @ Penn State. His previous research on Nonvolatile Processor and Energy Harvesting won 2018 EDAA Best Dissertation Award (Penn State News). Talks Title: Knowledge Self-distillation and Scalable Neural Networks: Towards Accurate, Efficient and Robust Neural Networks Title: Sparse-aware DNN Architecture Design: Insights from Resource Utilization and Memory Bandwidth News [Springer Book Chapter] Kaisheng Ma, Shuangchen Li, Vijaykrishnan Narayanan, and Yuan Xie. \"Nonvolatile Processor Architecture Exploration for Energy-Harvesting Application Scenarios\". In Embedded, Cyber-Physical, and IoT Systems, pp. 175-202. Springer, Cham, 2020. is awarded as top one percent high-impact publications in Springer Nature Research Highlights from China Collection Award 2020. (\"Top one percent highly cited papers in their academic fields as of July/August 2020, according to Essential Science Indicators, and highly downloaded, cited and mentioned book chapters, according to SN Insights\".) Related information Email RM 1-208, FIT Building, Tsinghua University, Haidian District, Beijing, 100084, P. R. China +86-010-62781693      FAX: +86-010-62781693-2000     EMAIL: iiis@mail.tsinghua.edu.cnCopyright@IIIS, Tsinghua University, All Rights Reserved. TOP",
  "content_length": 3063,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:31"
}