{
  "name": "Kaishun Wu",
  "homepage": "http://www.kaishunwu.com/index.html",
  "status": "success",
  "content": "Home Page of Kaishun Wu ä¼æ¥·èææä¸ªäººç½ç« Kaishun Wu(ä¼æ¥·è) IEEE/IET/AAIA Fellow, DSA Thrust and IoT Thrust, Information Hub,Hong Kong University of Science and Technology (Guangzhou) Shenzhen University (No-Pay Leave Now) Address: Phone: Contact Me: The best way to contact me is through email or through my assistant below. If you dont get my reply in 48 hours, please feel free to send it again.è¯·ç¨çµé®ä¸æèç»ï¼å¦ææ²¡å¨48å°æ¶å åå¤ï¼è¯·éæ°åéãä½ ä¹å¯èç»æçå©çã HKUST(GZ): å¼ é¢è¾ Claire Yanlei ZHANG: claireylz@hkust-gz.edu.cn Email: wuks@hkust-gz.edu.cn Biography Professor WU Kaishun is the Associate Vice President for Research of the Hong Kong University of Science and Technology (Guangzhou) (HKUST(GZ)), providing an overall leadership for the research development and management on campus, fostering the research culture within the community and enhancing communication with funding agencies. He is also a full professor of the DSA & IoT Thrust Area under the Information Hub. Prof. Wu received his PhD degree in computer science and engineering at the Hong Kong University of Science and Technology. Before joining HKUST(GZ) as a full professor at DSA Thrust and IoT Thrust, he was a distinguished Professor and Director of Guangdong Provincial Wireless Big Data and Future Network Engineering Center at Shenzhen University. Prof. Wu is an active researcher with more than 200 papers published on major international academic journals and conferences, as well as more than 100 invention patents, including 9 from the USA. He is also the owner of Special Allowance Expert of the State Council, winner of the National May 1st Labor Medal and the National Ten Thousand Talent Project, Young and Middle-aged Expert with Outstanding National Contributions, IET Fellow, National Youth Special Expert and Ministry of Education New Century Excellent Talent. His groundbreaking work has inspired many researchers in recent years, as a result he was in the list of The World’s Top 2% Scientists, 2020 - 2023 (published by Stanford University) and Highly Cited Chinese Researchers, 2020 - 2023 (published by Elsevier). Prof. Wu is the leader of Guangdong Natural Science Foundation Research Team: Wireless Big Data and Future Network (2017) and Guangdong Normal University Innovative Research Team: New Generation Intelligent Internet of Things (2019). Prof. Wu has received numerous awards in China, including the 2012 Hong Kong Young Scientist Award, the 2014 Guangdong Province Science and Technology Award (1st class), the 2014 Hong Kong ICT Awards: Best Innovation, the 2015 Ding-Ying Science and Technology Award, the 2017 Guangdong Province Science and Technology Award (1st class), the 2017 Shenzhen Young Scientist Award, the 2017 China Institute of Communications Young Scientist Award, the 2018 Chinese Ministry of Education Natural Science Award (2nd Class), the 2019 Guangdong Excellent Inventor Prize, the 2019 Fok Ying Tung Education Foundation Excellent Young Teacher Award, the 2021 Guangdong Excellent Patent Prize, and the 2022 China Excellent Patent Prize. His work is reported by influential media such as CCTV and Xinhua News Agency for special interviews. Internationally, Prof. Wu has also received many best paper awards including International Conference on Sensing, Communication and Networking (IEEE SECON 2018), IEEE International Conference on Mobile Ad-Hoc and Smart Systems (MASS 2014). He also received the 2014 IEEE ComSoc Asia-Pacific Outstanding Young Researcher Award. [2023 Fall] Multiple Ph.D., RA and Postdoc positions available! Please feel free to send your resume to wuks@hkust-gz.edu.cn. Perspective students are also highly encouraged to apply to my visiting student positions first. Research Interests Internet of Things, Wireless Networks, Wireless Communication, Mobile and Ubiquitous Computing, Pervasive Computing, Big Data, Smart e-Health, Industrial Networks. My recent research focuses on four main areas: Intelligent Sensing and Applications: device-free sensing of humans, acoustic sensing, vibration sensing AI for Wireless: bringing AI to wireless networking, mobile cloud computing and edge computing, Federated Learning and Wireless Networks, AI for Wireless Resource Management and Optimization IoT + AI Systems and Applications: building Internet of Things (IoT) systems with the AI technology to deepen and broaden the ways that we sense the physical world and enable innovative human-computer interactions Data Science from Mobile and Ubiquitous Computing Perspectives with Applications to Smart Cities Media News (SELETCTED) “Vibrations From a Smartphone Can Help Spot Unsafe Drinking Water”, By Communication of the ACM and New Scientist, April 14, 2021. Create a new era of interconnected intelligence with hard technology (ä¼æ¥·èï¼ç¨ç¡¬ç§ææé ä¸ç©äºèæºè½æ°æ¶ä»£ - æ°åç¤¾), By Xinhua News Agency, Feb. 17, 2021. Connecting all things to create a smart lifeï¼è¿½æ¢¦èµ¤å­å¿ä¼æ¥·èï¼è®©ä¸ç©äºèæé æºæ §çæ´»-ä¸­å¤®çµè§å°ï¼ï¼By CCTV, Feb. 15, 2021. Squeeze the era of \"Internet of Everything\" (“85å”ææä¼æ¥·èï¼æ¢è·“ä¸ç©äºè”æ¶ä»£)ï¼By South (åæ¹æå¿)ï¼April.23, 2021. Msc Student Yongzhi Huang was interviewed by Shenzhen Satellite TV in March 2021, and his research and development result \"Blind Sensory Alternative Glasses\" has been transformed through scientific and technological achievements, realizing the rooting of scientific and technological achievements. Honors and Awards Community Recognition IEEE Fellow, for contributions to wireless sensing and ubiquitous computing, 2023 The World’s Top 2% Scientists, 2020-2022 (published by Stanford University) National May 1 Labor Medal, 2021 (å ¨å½äºä¸å³å¨å¥ç« ) State Council Special Allowance Expert for Great Achievements of Nature Science Development in China, 2020.  (ä¸­åäººæ°å ±åå½å½å¡é¢é¢åæ¿åºç¹æ®æ´¥è´´) Shenzhen National Leading Talents, 2020. Highly Cited Chinese Researchers, 2020 & 2021 (published by Elsevier) Fok Ying Tung Education Foundation Excellent Young Teacher Award, 2019. (æè²é¨éè±ä¸æè²åºéä¼ç¬¬åä¸å±é«ç­é¢æ ¡éå¹´æå¸å¥) Guangdong Excellent Inventor Prize, 2019. National Hundred-Thousand-Ten Thousand Talents Program/National Young and Middle-Aged Experts with Outstanding Contributions, 2019. (å½å®¶ç¾åä¸äººæå·¥ç¨/å½å®¶æçªåºè´¡ç®ä¸­éå¹´ä¸å®¶) Fellow, The Institution of Engineering and Technology (IET), for contributions to wireless communication and mobile networks, 2018. Shenzhen Young Scientist Award, 2017. China Institute of Communications Young Scientist Award, 2017. The Ding-Ying Science and Technology Award, 2015. Guangdong Leading Talents in Science and Technology Innovation, 2015. Guangdong Pearl River Scholar Professor of Higher Education, 2015. IEEE ComSoc Asia-Pacific Outstanding Young Researcher Award, 2014. New Century Excellent Talents in University, Ministry of Education, 2013. Hong Kong Young Scientist Award, 2012. Guangdong Natural Science Funds for Distinguished Young Scholar, 2012. Award for Scientific Research Projects Guangdong Excellent Patent Prize, Patent Name: A mobile networking method and system for minimizing interference, 1st inventor, 2021. Second Class Award, 2019 Guangdong Province Science and Technology Progress Award, Project Title: Research and application of key technologies of building fire safety detection based on big data Second Class Award, Ministry of Education of China Academic Research Outstanding Award in Nature Science, 2018. Project Title: Research on Transceiver-free Wireless Sensing Technologies First Class Award, Guangdong Province Science and Technology Award, 2017.  Project Title: Large Scale Wireless Sensing and Heterogeneous Interconnection for Smart City Second Class Award, Guangdong Province Science and Technology Award, 2016. Project Title: The Key Techniques of Dense Wireless Network based on Intelligent Collaboration First Class Award, Guangdong Province Science and Technology Award, 2014. Project Title: Wireless Network Performance Enhancement by using Physical Layer Techniques Hong Kong ICT Awards 2014: Best Innovation for project “WiFall: Device-free Fall Detection System”. Best Papers/Poster Awards Best Poster Award, In Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT/UbiComp), 2021 Best Paper Award: IEEE International Conference on Parallel and Distributed Systems (IEEE ICPADS’2020) Best Paper Award: IEEE International Conference on Parallel and Distributed Systems (IEEE ICPADS’2019) Best Paper Award: International Conference on Sensing, Communication and Networking (IEEE SECON’2018, 1/211 submissions) Best Paper Award: IEEE International Conference on Mobile Ad-Hoc and Smart Systems (MASS 2014) Best Paper Award: IEEE International Conference on Parallel and Distributed Systems. (IEEE ICPADS’2012, 1/294 submissions) Best Paper Award: IEEE Global Communications Conference. (IEEE Globecom’2012, 15/2560 submissions) Professional Activities Journal Editorship Associate Editor: ACM Transactions on Sensor Networks (2022 –) Associate Editor: IEEE Transactions on Mobile Computing (2019 –) Associate Editor: Sensors (2021- ) Associate Editor: IET COMMUNICATION (2017 –) Associate Editor: Frontiers of Computer Science (2016 – 2019) Associate Editor: KSII Transactions on Internet and Information Systems (TIIS) (2016 – 2019) Guest Editor: IEEE Network (2017) Editor: Open Transactions on Wireless Sensor Network (2014- ) Conference Organization General Chair: EAI International Conference on Edge Computing and IoT (EAI ICECI 2021) Program Co-Chair: EAI International Conference on Heterogeneous Networking for Quality, Reliability, Security and Robustness (EAI Qshine 2020) Program Chair: CCF 15th National Pervasive Computing Conference (PCC 2019) Program Co-Chair: IEEE International Conference on Parallel and Distr",
  "content_length": 62854,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:32"
}