{
  "name": "Kaisa Väänänen-Vainio-Mattila",
  "homepage": "https://research.tuni.fi/kaisa-vaananen",
  "status": "success",
  "content": "Kaisa Väänänen | Tampere Universities Kaisa Väänänen I am a full-time professor of Human-Technology Interaction in Tampere University (TAU). I lead the research group of Human-Centered Technology (IHTE, https://research.tuni.fi/ihte/), an interdisciplinary group working on user experience and interaction design research. We have research projects on a broad spectrum of topics, including user experience of novel applications for societal purposes, in specific for environmental and social sustainability. We work closely with industrial partners and cooperate with researchers from other interdisciplinary research groups. I work actively in the international research forum, especially in the ACM Mobile HCI and CHI communities. My research group is associated with Tauchi research centre for Human-Computer Interaction: https://research.tuni.fi/tauchi/ Contact details: Professor Kaisa Väänänen Human-Centered Technology (IHTE), unit of Computing Sciences, faculty of Information technology and communication sciences (ITC) Tampere University Address: Korkeakoulunkatu 6, P.O. Box 589, 33101 Tampere, Finland Office in Tietotalo building, room TE109 Tel: +358 40 849 0731 Email: kaisa.vaananen (at) tuni.fi LinkedIn: https://www.linkedin.com/in/kaisav/ Professional brief My research interests cover, but are not limited to: Human-Centered Artificial Intelligence (HCAI), especially user experience of AI systems and methods for AI application design Design research on HCI for societal purposes, both for social and environmental sustainability, for example in the urban contexts Embodied AI and its applications, for example Social Robots in youth participation and tangible AI interactions smart urban environments I am passionate about gaining in-depth understanding of people’s needs and opportunities for technology and digital solutions to drive sustainability of the world, both from the environmental and social perspectives. Most of my research is qualitative in nature, with the emphasis on very early phases of forming deep understanding of people for technology design. I also strive to help create methods and tools that can be taken into use in the “real world”, including companies. I love multidisciplinary explorations, where after initial confusion, new ways of thinking and doing can be found and brought to life. In 2022, I was selected as an ACM Distinguished Member for my long-standing contribution to the field of computing. Research visits: In autumn 2024, I was visiting the Media Informatics group at Ludwig-Maximilians-Universität (LMU) Munich, for two months, hosted by prof. Albrecht Schmidt. In September-December of 2023, I was visiting Queensland University of Technology, Digital Media Research Centre, for three monts (host: prof. Marcus Foth). In the autumn of 2022, I was visiting TU Eindhoven, Industrial Design department, research division of Future Everyday for ten weeks (host: prof. Panos Markopoulos). In 2011, I was working part-time with Mobile Life Centre @ Stockholm University (host: prof. Kia Höök), enabled by Nokia Foundation’s Visiting professor grant. I have also worked with Nokia Inc. in 1995-2004 and as a part-time visiting professor at Nokia Research Center on design and evaluation of user experience in 2008-2010. Sample of service activities in the international research community: I will be the general co-chair of Pervasive Displays 2026 conference, taking place in Munich in March 2026. I was the general co-chair of the ACM conference of Intelligent User Interfaces in 2026. I was the general co-chair of the flagship conference of ACM  SIGCHI CHI 2023 conference, which took place in Hamburg and online in April 2023. I am a voting member of ACM’s SIGCHI’s CHI steering committee. I was a co-organiser of the Dagstuhl perspectives workshop on A Human-Computer Interaction Perspective to Drive Change towards Sustainable Future, which took place in February 2023. In 2016-2019 I was the steering committee chair for the ACM MobileHCI conference series. I am serving in the editorial boards of Interacting with Computers journal (IwC), Behaviour & Information Technology (BIT), and Personal and Ubiquitous Computing (PAUC). I am a guest editor on Special Issue on Designing with AI for Wellbeing in Behaviour & Information Technology journal. I served full six years (2013-2018) in Academy of Finland as a member of the Research Council for Natural Sciences and Engineering. Some more distant history: Before my full-time professorship in Tampere University (previously Tampere University of Technology, TUT), I worked in various internal consultancy and research management positions in Nokia, Inc. in 1995-2004 (see my CV). I also held a part-time professorship in TUT during years 2000-2004. Before that, in years 1991-1995 I worked as a researcher in Computer Graphics Center in Darmstadt, Germany. I obtained my Dr. Tech. (Dr.-Ing.) degree in Technical University of Darmstad in 1995. Before that, I enjoyed my studies of software engineering in Technical University of Helsinki (1983-1991), artificial intelligence in University of Minnesota (1988-89) and Human-Computer Interaction in University of London (1989-1990). SHORT BIO (for talks etc.) Kaisa Väänänen is a full professor of human-technology interaction in Tampere University, Computing Sciences, since 2005. In 1995-2004, she worked at Nokia Inc, in leading positions of user needs research and strategic consumer insights. Kaisa’s research interests cover user experience and participatory technology design, with emphasis on digital services advancing sustainability, and smart cities, and human-centered AI. Kaisa is an author of over 200 peer-reviewed academic publications. She has lead several study programmes and supervised 25 doctoral students to graduation. In 2013-2018, Kaisa served full six years as a member of Academy of Finland’s research council for Natural Sciences and Engineering. She frequently organises conferences related to user experience and human-computer interaction, such as the flagship conference of Human-Computer Interaction, ACM CHI’23, and Intelligent User Interfaces 2025. In 2022, Kaisa was inducted as an ACM Distinguished Member for her long-standing contribution to the field of computing. PERSONAL BRIEF I live in a small town near Tampere, Finland. I have two wonderful adult children, Samuel and Helena. During my free time, I do sports (biking, gym, running), travel, and meet up with friends. I am always open to new experiences and challenges!",
  "content_length": 6529,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:34"
}