{
  "name": "Kaitai Liang",
  "homepage": "https://www.tudelft.nl/ewi/over-de-faculteit/afdelingen/intelligent-systems/cybersecurity/computational-privacy/people/kaitai-liang",
  "status": "success",
  "content": "Kaitai Liang Zoeken Sluit zoek Kaitai Liang Dr. Liang is a tenured faculty member in the Cybersecurity group, where he also leads the CRYPTAI Lab. He obtained PhD from CityU Hong Kong. Prior to joining Delft, Dr. Liang held several academic positions, including as an information security research intern at A*STAR, a postdoctoral researcher at Aalto University, and an academic visitor at universities, e.g., UCL and Northwest University. He was a permanent assistant professor in secure systems at the University of Surrey. Since joining Delft in 2020, Dr. Liang has gained significant recognition within the cybersecurity and ICT communities. He has secured European funding for several high-impact projects related to cybersecurity and AI, serving as PI and accumulating over 2 million euros in funding. His research has led to real-world impact through collaborations, with use cases, e.g., smart satellite (ASSURED, Greece), smart transportation (IRIS, Spain), and cross-border biometric data exchange (TENSOR, Portugal). Dr. Liang’s research, which applies information security tools to tackle cybersecurity challenges, has earned over 5,800 citations (world top 2% citation scientist). His work has been featured in top-tier conferences, e.g., USENIX Security, NDSS, CVPR, SIGMETRICS, ESORICS, Asiacrypt, and many others, as well as in leading international journals, e.g., IEEE Internet of Things Journal, IEEE Transactions on Cloud Computing, IEEE Transactions on Information Forensics and Security, IEEE Transactions on Dependable and Secure Computing, IEEE Transactions on Industrial Informatics. He's also delivered information security keynotes to international conferences and received awards, e.g., distinguished reviewer, best research paper. A sought-after expert, Dr. Liang has been invited to serve on PC member, as General Chair, and as a Steering Committee member for renowned security and privacy conferences, e.g., USENIX Security, ACM CCS, IEEE Euro S&P, ESORICS, IEEE CSF, PoPETs, as well as keynotes for information security topics. He also serves as an Associate Editor for prominent journals, e.g., The Computer Journal, IEEE Open Journal of the Communication Society, IEEE Systems Journal, Journal of Information Security and Applications, IEEE Transactions on artificial intelligence. Dr. Liang has contributed to ISO standards, as a member of the BSI (when he was in UK) and as part of the NEN committee 381027 \"Cybersecurity & Privacy\" in the Netherlands. He has also been invited to serve on funding review committees and panels for NWO (Dutch research council) and other external funding bodies. As one of the founding members, he contributed to the development and settlement of APNet (a national network supporting assistant professors across the Netherlands). He actively fosters connections between academia, industry, and scientific development in local cities, such as The Hague and Rotterdam, and has been recognized as a Rotterdam Knowledge Ambassador for his contributions. Dr. Liang is a Fellow of The Higher Education Academy, UK, and holds UTQ, the Netherlands. Since 2016, he has been involved in designing, teaching, and evaluating MSc, Bachelor's courses, as well as supervising MSc, PhD theses in countries e.g., Finland, UK, the Netherlands. For a personal websites please visit: https://ktliang20.github.io/ Please also visit the CRYPTAI Lab: https://sites.google.com/view/kaitailiang/home/cryptai-lab Publications Deel deze pagina: Facebook Linkedin Twitter Email WhatsApp Deel deze pagina Kaitai Liang Kaitai.Liang@tudelft.nl Van Mourik Broekmanweg 5 2628 XE Delft The Netherlands",
  "content_length": 3635,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:32"
}