{
  "name": "Kalina Bontcheva",
  "homepage": "https://www.sheffield.ac.uk/dcs/people/academic/kalina-bontcheva",
  "status": "success",
  "content": "Professor Kalina Bontcheva | Computer Science | The University of Sheffield Skip to main content Search sheffield.ac.uk Close menu × School of Computer Science School of Computer Science Menu Professor Kalina Bontcheva School of Computer Science Professor of Text Analysis Member of the Natural Language Processing (NLP) research group k.bontcheva@sheffield.ac.uk Regent Court (DCS) Full contact details Professor Kalina Bontcheva School of Computer Science Regent Court (DCS) 211 Portobello Sheffield S1 4DP Orcid ID:0000-0001-6152-9600 Google Scholar Personal website Profile Kalina Bontcheva is a Professor in Natural Language Processing (NLP) in the School of Computer Science at the University of Sheffield, co-affiliated with Sheffield’s Center for Freedom of the Media. Her research lies at the intersection of Natural Language Processing (NLP), computational social media analysis, and web science, with applications to digital humanities, social science, digital journalism, business intelligence, and data science.Between 2014 and 2016 Kalina conceived and led the PHEME international project, which was amongst the first EU projects to study computational methods for the detection and tracking of disinformation in social media. She is currently the scientific director of the veraAI project, and previously the WeVerify, SoBigData++ and SoBigData international projects. Since 2015 Kalina has also been working on real-time social media analysis around United Kingdom general elections and the Brexit referendum, and on monitoring and analysis of online abuse towards UK politicians. She co-authored the ITU/UNESCO study \"Balancing Act: Countering Digital Disinformation While Respecting Freedom of Expression\", two UNESCO policy briefs on Combating the COVID-19 Disinfodemic, and the UNESCO study \"The Chilling: Global trends in online violence against women journalists\".Kalina’s research on online disinformation and abuse of target public figures (especially MPs and female journalists) has been covered by many UK media organisations (incl. the BBC, ITV, the Guardian and Buzzfeed UK) with reach exceeding 17.7 million. This includes real-time analysis of political engagement on social media for the 2015 UK general elections and the UK EU membership referendum;  analysing Twitter abuse towards politicians in the 2017 UK general election campaign; commentary on the role of Russian bots and sock-puppet accounts in the UK EU membership referendum campaign;  and online abuse towards UK MPs (2019 election), which was featured on the news and in this accompanying BBC article.Since 2006 Kalina has been awarded 17 grants as a PI (seven of these as a sole investigator), with a total award value for her team exceeding £8.8 million, from diverse funding sources: EU funding (Frameworks 6 and 7, Horizon 2020, and Horizon Europe), UK EPSRC and ESRC funding councils, a Google Faculty Award, a Google Digital News Grant, a UK Department of Health and Social Care grant, and two active grants from the UK Foreign, Commonwealth & Development Office (FCDO). Research interests Social media, misinformation, and abuse analysis – AI-generated misinformation detection; machine learning methods for misinformation and disinformation detection, online abuse analysis, and hate speech detection; large-scale, real-time analysis of social media content; longitudinal research on online abuse. Publications Books Aref S, Bontcheva K, Braghieri M, Giannotti F, Pedreschi D, Dignum F & Grisolia F (2020) Preface. Vrandečić D, Bontcheva K, Suárez-Figueroa MC, Presutti V, Celino I, Sabou M, Kaffee LA & Simperl E (2018) Preface. Vrandečić D, Bontcheva K, Suárez-Figueroa MC, Presutti V, Celino I, Sabou M, Kaffee LA & Simperl E (2018) Preface. Maynard D, Bontcheva K & Augenstein I (2017) Natural Language Processing for the Semantic Web. Springer International Publishing. Maynard D, Bontcheva K & Augenstein I (2016) Natural Language Processing for the Semantic Web. Morgan & Claypool Publishers. Cunningham H, Maynard D, Bontcheva K, Tablan V, Aswani N, Roberts I, Gorrell G, Funk A, Roberts A & Damljanovic D (2011) Text Processing with Gate (Version 6). GATE. Journal articles Leite JA, Razuvayevskaya O, Bontcheva K & Scarton C (2025) Weakly supervised veracity classification with LLM-predicted credibility signals. EPJ Data Science, 14. View this article in WRRO Mu Y, Niu P, Bontcheva K & Aletras N (2024) Predicting and analyzing the popularity of false rumors in Weibo. Expert Systems with Applications, 243. View this article in WRRO Leite JA, Razuvayevskaya O, Bontcheva K & Scarton C (2024) EUvsDisinfo: a dataset for multilingual detection of pro-Kremlin disinformation in news articles. CIKM '24: Proceedings of the 33rd ACM International Conference on Information and Knowledge Management, 5380-5384. View this article in WRRO Razuvayevskaya O, Wu B, Leite JA, Heppell F, Srba I, Scarton C, Bontcheva K & Song X (2024) Comparison between parameter-efficient techniques and full fine-tuning: a case study on multilingual news article classification. PLoS ONE, 19(5). View this article in WRRO Mu Y, Jin M, Bontcheva K & Song X (2024) Examining temporalities on stance detection towards COVID-19 vaccination. 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation, LREC-COLING 2024 - Main Conference Proceedings, 6732-6738. View this article in WRRO Mu Y, Wu BP, Thorne W, Robinson A, Aletras N, Scarton C, Bontcheva K & Song X (2024) Navigating prompt complexity for zero-shot classification: a study of large language models in computational social science. Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024), 12074-12086. View this article in WRRO Mu Y, Song X, Bontcheva K & Aletras N (2024) Examining the limitations of computational rumor detection models trained on static datasets. 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation, LREC-COLING 2024 - Main Conference Proceedings, 6739-6751. View this article in WRRO Mu Y, Dong C, Bontcheva K & Song X (2024) Large language models offer an alternative to the traditional approach of topic modelling. Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024), 10160-10171. View this article in WRRO Bakir ME, Farrell T & Bontcheva K (2024) Abuse in the time of COVID-19: the effects of Brexit, gender and partisanship. Online Information Review, 48(5), 1045-1062. View this article in WRRO Singh I, Scarton C & Bontcheva K (2023) UTDRM: unsupervised method for training debunked-narrative retrieval models. EPJ Data Science, 12(1). View this article in WRRO Wu B, Li Y, Mu Y, Scarton C, Bontcheva K & Song X (2023) Don’t waste a single annotation: improving single-label classifiers through soft labels. Findings of the Association for Computational Linguistics: EMNLP 2023, 5347-5355. View this article in WRRO Li Y, Scarton C, Song X & Bontcheva K (2023) Classifying COVID-19 vaccine narratives. Proceedings of the 14th International Conference on Recent Advances in Natural Language Processing, 648-657. View this article in WRRO Tait J, Gaizauskas R & Bontcheva K (2023) Obituary: Yorick Wilks. Computational Linguistics, 49(3), 767-772. View this article in WRRO Mu Y, Jin M, Grimshaw C, Scarton C, Bontcheva K & Song X (2023) VaxxHesitancy: A dataset for studying hesitancy towards COVID-19 vaccination on Twitter. Proceedings of the International AAAI Conference on Web and Social Media, 17(1), 1052-1062. View this article in WRRO Singh I, Scarton C & Bontcheva K (2021) Multistage BiCross encoder for multilingual access to COVID-19 health information. PLoS ONE, 16(9). View this article in WRRO Dumitrache A, Inel O, Timmermans B, Ortiz C, Sips R-J, Aroyo L & Welty C (2021) Empirical methodology for crowdsourcing ground truth. Semantic Web, 12(3), 403-421. Song X, Petrak J, Jiang Y, Singh I, Maynard D & Bontcheva K (2021) Classification aware neural topic model for COVID-19 disinformation categorisation. PLoS ONE, 16(2). Kolliakou A, Bakolis I, Chandran D, Derczynski L, Werbeloff N, Osborn DPJ, Bontcheva K & Stewart R (2020) Mental health-related conversations on social media and crisis episodes : a time-series regression analysis. Scientific Reports, 10(1). Leite JA, Silva DF, Bontcheva K & Scarton C (2020) Toxic language detection in social media for Brazilian Portuguese : new dataset and multilingual analysis. Proceedings of the 1st Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics and the 10th International Joint Conference on Natural Language Processing, 914-924. View this article in WRRO Scarton C, Silva DF & Bontcheva K (2020) Measuring what counts : the case of rumour stance classification. Proceedings of the 1st Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics and the 10th International Joint Conference on Natural Language Processing, 925-932. View this article in WRRO Farrell T, Gorrell G & Bontcheva K (2020) Vindication, virtue, and vitriol: A study of online engagement and abuse toward British MPs during the COVID-19 pandemic. Journal of Computational Social Science, 3, 401-443. Gorrell G, Bakir ME, Roberts I, Greenwood MA & Bontcheva K (2020) Which politicians receive abuse? Four factors illuminated in the UK general election 2019. EPJ Data Science, 9. View this article in WRRO Rehm G, Galanis D, Labropoulou P, Piperidis S, Welß M, Usbeck R, Köhler J, Deligiannis M, Gkirtzou K, Fischer J , Chiarcos C et al (2020) Towards an interoperable ecosystem of AI and LT platforms : a roadmap for the implementation of different levels of interoperability. Proceedings of the 1st International Workshop on Language Technology Platforms, 96-107. View this article in WRRO Rehm G, Bontcheva K, Choukri K, Hajič J, Piperidis S & Vasiļjevs A",
  "content_length": 73357,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:39"
}