{
  "name": "Kam-Pui Chow",
  "homepage": "https://i.cs.hku.hk/~chow",
  "status": "success",
  "content": "Dr. K.P. Chow K.P. Chow M.A., Ph.D.(UC Santa Barbara) ASSOCIATE PROFESSOR ASSOCIATE DIRECTOR, CENTER FOR INFORMATION SECURITY AND CRYPTOGRPHY Dr. Chow began his academic career in this department upon completion of his doctoral degree in the United States. His first contribution was on establishing HARNET, the first academic and research network for tertiary institutions in Hong Kong (with Raymond Lo and Dr. Ng). His earlier research works were in expert systems development and Chinese computing. In those years, Dr. Chow has used expert systems techniques successfully in implementing a staff roster rostering system for a local airline (with Dr. Lucas Hui), a refuse collection vehicle scheduling system for Regional Services Department (with D. Hung and C.T. Hung), and an air conditioning plant diagnostic system. In the years 1994-1997, Dr. Chow, together with Dr. D. Cheung, Prof. Chin, Dr. T.W. Lam, Dr. W.W. Tsang and a team of software engineers developed the search engine for Hong Kong Telecom's 108 Telephone Directory Enquiry System using state of the art technology in main memory database and distributed computing. Since 1997, Dr. Chow is the Associate Director of Center for Information Security and Cryptography, Department of Computer Science and Information Systems, the University of Hong Kong, and is the Project Manager of the Strong Cryptographic Infrastructure for Electronic Commerce project. In the recent years, Dr. Chow' research interests have migrated to digital forensics and computer security, and is the leader of the Computer Forensics Research Group (CFRG). Dr. Chow was the chief designer of the bilingual computer forensic tool Digital Evidence Search Kit (DESK).  Starting from 2005, Dr. Chow has been working on the Internet piracy monitoring system Lineament I, and Internet auction site monitoring system Lineament II.  Both Lineament I and Lineament II were adopted by HKSAR Customs and Excise Department in 2007 and 2011 respectively.  Two of his research team’s papers got the best paper awards in one of the reputable digital forensics research conference in USA in years 2008 and 2011. One of his team’s research papers “The Rules of Time on NTFS File System” had been submitted to Courts of Hong Kong several times as a supporting document for the expert reports. Dr. Chow has been a member of the Program Committee of the international computer forensic workshop SADFE. He was the conference chairman of the Sixth IFIP WG 11.9 International Conference on Digital Forensics held in January in Hong Kong. From 2010, Dr. Chow is the Chairman of the Information Security and Forensics Society (ISFS), and a committee member of the IT Division, Hong Kong Institution of Engineers. Dr. Chow is the Programme Director for the MSc in Computer Science and the Associate Programme Director for the MSc in E-Commerce and Internet Computing Programme. He is the instructor for the courses “e-Crime” and “e-Discovery and Digital Forensics”. In both courses, he is responsible for the technical issues of digital investigation and computer forensics. Dr. Chow has provided consultancy and training to local organizations including Hong Kong Telecom, Hong Kong Airport Services Limited, Hewlett Packard and MPFA in the areas distributed computing, Internet technology and software quality assurance. In the past few years, Dr. Chow been invited to be a computer forensic expert to assist the Court and the HK law enforcement agencies, and to give advice to counsels on understanding and interpreting digital evidence for both criminal and civil proceedings in Hong Kong.  In criminal proceedings, Dr. Chow had analyzed cases that include child pornography, software copyright, email analysis and Internet fraud. For civil litigations, Dr. Chow had analyzed cases that include activities log temporal analysis and internal investigation involving insider theft. Selected Publications on Computer Forensics: Hou S., Uehara T., Yiu S.M., Hui C.K. and Chow K.P., Privacy Preserving Multiple Keyword Search for Confidential Investigation of Remote Forensics, 2011 Third International Conference on Multimedia Information Networking and Security (MINES 2011), Shanghai, China, 4-6 November, 2011. Hou S., Uehara T., Yiu S.M., Hui C.K. and Chow K.P., Privacy Preserving Confidential Forensic Investigation for Shared or Remote Servers, 2011 Seventh International Conference on Intelligent Information Hiding and Multimedia Signal Processing, Dalian, China, 14-16 October 2011. China. Frank Y.W. Law, P. Chan, S.M. Yiu, K.P. Chow, Michael Y.K. Kwan, Hayson Tse, Pierre K.Y. Lai, Protecting Digital Data Privacy in Computer Forensic Examination, in Proceedings of the sixth International Workshop on Systematic Approaches to Digital Forensic Engineering (SADFE 2011), Oakland, California, USA, 2011. (Best Paper Award) J. Fang, Z. Jiang, S.M. Yiu, K.P. Chow, L. Hui, L. Chen and X. Niu, A Dual Cube Hashing Scheme for Solving LPP Integrity Problem, in Proceedings of the sixth International Workshop on Systematic Approaches to Digital Forensic Engineering (SADFE 2011), Oakland, California, USA, 2011. M. Kwan, R.E. Overill, K.P. Chow, H. Tse, F. Law & P. Lai, Sensitivity Analysis of Digital Forensic Reasoning in Bayesian Network Models, Proc.7th Annual IFIP WG 11.9 International Conference on Digital Forensics, Orlano, Florida, USA, 2011, Advances in Digital Forensics VII, (to appear). F. Law, K.P. Chow, P. Lai, H. Tse and K. Tse, Digital Child Pornography, in Technology for Facilitating Humanity and Combating Social Deviations: Interdisciplinary Perpectives by M.V. Martin, M. A. Garcia-Ruiz and A. Edwards (Eds), IGI Global, 2010. 钟琳，黎家盈，邹锦沛，许榕生，基于多视图分析的复杂网络犯罪现场重构,《电信科学》第11A期（计算机取证技术专辑）, 2010. R.E. Overill, J.A.M. Silomon, Y.K. Kwan, K.P. Chow, Y.W. Law, P. Lai, Sensitivity Analysis of a Bayesian Network for Reasoning about Digital Forensic Evidence, Proc.4th International Workshop on Forensics for Future Generation Communication environments (F2GC-10), Cebu, Philippines, 11-13 August 2010. R.E. Overill, J.A.M. Silomon, K.P. Chow, A Complexity Based Model for Quantifying Forensic Evidential Probabilities, third International Workshop on Digital Forensics (WSDF 2010), Feb 15 – 18, 2010, Krakow, Poland. M. Kwan, R.E. Overill, K.P. Chow, J.A.M. Silomon,H. Tse, F. Law & P. Lai, Evaluation of Evidence in Internet Auction Fraud Investigations, Proc.6th Annual IFIP WG 11.9 International Conference on Digital Forensics, Hong Kong, 3-6 January 2010, Advances in Digital Forensics VI, Ch.7, pp.95-106, Springer (2010). F. Law, P.F. Chan, S.M. Yiu, B. Tang, P. Lai, K.P. Chow, R. Ieong, M. Kwan, W.K. Hon & L. Hui, Identifying Static and Dynamic Volatile Memory Data from Multiple Dumps for Live Forensics, Sixth IFIP WG 11.9 International Conference on Digital Forensics, Hong Kong, January 3-6, 2010. R. Ieong, P. Lai, K.P. Chow, M. Kwan & F. Law, Is it an Initial Seeder? Derived Rules that Indicate a Seeder is within the Slow-Rising Period, Sixth IFIP WG 11.9 International Conference on Digital Forensics, Hong Kong, January 3-6, 2010. F.F.K. Li, H. Chan, K.P. Chow and P Lai, Analysis of Green Dam Youth-Escort from a Forensics Prospective, Sixth Annual IFIP WG 11.9 International Conference on Digital Forensics, Hong Kong, January 3-6, 2010. F. Xu, K.P. Chow, J. He and W. Xu, Privacy Reference Monitor – A Computer Model for Law Compliant Privacy Protection, 2009 IEEE International Conference on Parallel and Distributed Systems, Shenzhen, China, 2009. K. Tse,  K.P. Chow,  F. Law,  R. Ieong,  M. Kwan,  H. Tse & P. Lai, Analyzing Digital Camera Storage Media, The 2009 International Workshop on Forensics for Future Generation Communication environments (F2GC-09), Dec 10 - 12, 2009, in Jeju Island, Korea. F. Law, P. Lai, K.P. Chow, R. Ieong & M. Kwan, Memory Acquisition: A 2-Take Approach, The 2009 International Workshop on Forensics for Future Generation Communication environments (F2GC-09), Dec 10 - 12, 2009, in Jeju Island, Korea. Frank Y.W. Law, K.P. Chow, Pierre K.Y. Lai & Hayson K.S. Tse, A Host-based Approach to BotNet Investigation, 1st International Conference on Digital Forensics and Cyber Crime, Albany, NY, Sept 30 – Oct 2, 2009. R. Ieong, P. Lai, K.P. Chow, M. Kwan, F. Law, H. Tse & K. Tse, Forensic Investigation of Peer-to-Peer Networks, Handbook of Research on Computational Forensics, Digital Crime and Investigation: Methods and Solution, IGI Global, United Kingdom M. Kwan, K.P. Chow, F. Lai, F. Law and K. Tse, A Digital Forensics View of the Yahoo! Case, Fifth Annual IFIP WG 11.9 International Conference on Digital Forensics, Orlando, Florida, USA, January 25-28, 2009. pp. 241 – 254. R.E. Overill, M. Kwan, K.P. Chow, P. Lai and F. Law, A Cost-Effective Digial Forensic Investigation Model,, Fifth Annual IFIP WG 11.9 International Conference on Digital Forensics, Orlando, Florida, USA, January 25-28, 2009. pp. 231 – 240. R. Ieong, P. Lai, K.P. Chow, F. Law, M. Kwan and K. Tse, A Heuristic Approach for Investigating the P2P Foxy Network,, Fifth Annual IFIP WG 11.9 International Conference on Digital Forensics, Orlando, Florida, USA, January 25-28, 2009. K. P. Chow, R. Ieong, M. Kwan, P. Lai, F. Law, H. Tse, K. Tse, Security Analysis of Foxy Peer-to-Peer File Sharing Tool, HKU Technical Report TR-2008-09, 2009. Frank Y.W. Law, Pierre K.Y. Lai, Zoe L. Jiang, Ricci S.C. Ieong, Michael Y.K. Kwan, K.P. Chow, Lucas C.K. Hui, S.M. Yiu, C.F. Chong, Protecting Digital Legal Professional Privilege (LPP) Data, in Proceedings of the third International Workshop on Systematic Approaches to Digital Forensic Engineering (SADFE 2008), Oakland, California, USA, May 18-22, 2008. Best Paper Award. Michael Y.K. Kwan, K.P. Chow, Frank Y.W. Law, Pierre K.Y. Lai, Reasoning About Evidence using Bayesian Networks, Fourth Annual IFIP WG 11.9 International Conference on Digital Forensics, Kyoto, Japan, January 27 - 30, 2008. Frank Y.W. Law, K.P. Chow, Michael Y.K. Kwan and Pierre K.Y. Lai, Consistency Issue on ",
  "content_length": 19156,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:39"
}