{
  "name": "Kamer Kaya",
  "homepage": "http://people.sabanciuniv.edu/kaya",
  "status": "success",
  "content": "Kamer Kaya Sabancı Universitesi, Muh. ve Doga Bilimleri Fakultesi, Univ. Cad., Orta Mah., 34956, Istanbul, Turkey Short Bio: I am an Associate Professor at the Faculty of Engineering and Natural Sciences at Sabancı University. I got my PhD from Department of Computer Science and Engineering from İhsan Doğramacı Bilkent University in 2009 on Threshold Cryptography. After graduation, I have worked at CERFACS, France, as a post-graduate researcher in the Parallel Algorithms Project. I then joined the HPC Lab at the Ohio State University in September 2011 as a postdoctoral researcher, and in December 2013, I became a Research Assistant Professor in the Dept. of Biomedical Informatics. Since 2014, I have been working at Sabancı University and since 2018, I am the founder and manager of Dakik Software Technologies which is a software company focusing R&D projects. I am also a member of the Center of Excellence in Data Analytics and COMPUTE at Sabanci University. Here is my CV. Research: My research interests include Parallel Algorithms, Machine Learning on Sparse Data, Graph Algorithms, High-Performance Computing, and Cryptography. I am actively working on sparse computations on matrices, graphs, and tensors. As a team, we focus on implementing efficient algorithms on sparse data structures for cutting-edge HPC hardware such as GPUs and IPUs, especially for ML applications. As a team, we are always looking for students talented in algorithms, data structures, and C/C++ programming. I am also involved in various R&D projects through Dakik Software Technologies. Currently, we are working on; blockchain interoperability, ML models for predictive and prescriptive maintenance and anomaly detection on streaming data, creating and exploiting digital twins for automation industry, and NLP tools for DB querying. If you are interested in doing research on any of these problems, we can talk. news Dec 1, 2021 The National HPC Competence Center of Turkey organised a four-day Graph School on 17-20 November 2021. The school covered a wide range of topics including Graph Algorithms, Graph Neural Networks, Spectral Graph Theory, Graph Databases, Network Science and Graph Embedding. The event was a huge success: a large number of academics, graduate students and industry representatives attended. You can find the news article here and the Graph School website including all the materials and videos here . Jul 25, 2021 Our first SME Summer School will be on August 23-24, 2021, in Turkish, online (via Zoom) and free. In the first day, Ahmet Demirelli from Sabanci University will cover Big Data processing with Hadoop and Spark. In the second, I will cover Geometric Deep Learning with PyTorch geometric. The event is open to everyone; so if you are a researcher, a university student, or coming from the industry you are more than welcome. The details for the registration link will be provided from here soon. Jul 20, 2021 As a part of the National Competence Center on HPC, we have organized the first Computhon. The participants implemented their solutions with OpenMP, CUDA, and MPI on TRUBA clusters to solve a graph problem. If you want to try yourself and learn how to use a powerful cluster, you can see the tutorial slides and problem definition from here. Jul 15, 2021 The Mathematics for Machine Learning Summer School is planned to be organized on September 20-26, 2021 at Nesin Matematik Köyü, Şirince. The school will be in Turkish. You can see the details from here. Jun 26, 2021 With VERIM and Science Academy, we have organized the Machine Learning Summer School with the theme Learning in Networks & Beyond Performance. In the last day, we had four, excellent HPC-related talks; Parallelization of Deep and Graph Neural Networks, by Aydın Buluç (slides, video). Software for HPC and Artificial Intelligence, by Didem Unat (slides, video). Developing and Optimizing Deep Learning Systems by Alptekin Temizel (slides, video). Supercomputers and Artificial Intelligence, by Onur Temizsoylu (slides, video).",
  "content_length": 4052,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:52"
}