{
  "name": "Kamil Saraç",
  "homepage": "http://www.utdallas.edu/~ksarac",
  "status": "success",
  "content": "Kamil Sarac Kamil Sarac Professor and Associate Head Department of Computer Science The University of Texas at Dallas Richardson, TX 75080 Office: ECS South 4.207 Phone: (972) 883 2337 E-mail: ksarac .(at). utdallas.edu Bio: I received my B.S. degree in Computer Engineering from the Middle East Technical University, Ankara, Turkey in 1994, and M.S. and Ph.D. degrees in Computer Science from the University of California Santa Barbara in 1997 and 2002, respectively. I joined the Computer Science Department at UT Dallas in September 2002 as an assistant professor and currently serves as a professor in the same department. I also serve as an associate department head for academic affairs and as the director of cybersecurity education programs in our department. Please see my CV for more details here. Research Interests: My research interests include computer networks and protocols. More specifically, I have worked on network monitoring and Internet measurements; security of software-defined networks; and future Internet architecture design. In the past, I also worked on sampling of large scale complex networks; energy efficient broadcast in ad hoc networks; overlay networks and their use in network security; and group communication and IP multicast. My current research efforts include use of ML based models in understanding and inferring topological structure of the Internet and BGP protocol; developing ML based intrusion detection systems for software-defined networks. I am also highly interested in the area of next generation Internet architecture design. My recent work has been on Internet topology measurements area. Together with my PhD students, I worked on several practical problems in building representative Internet topology maps that are used to model and study the topological characteristics of the Internet. My earlier work included using overlay networks to provide Denial-of-Service (DoS) resistant end-to-end communication service in the Internet; developing polynomial time algorithms for several energy efficient communication problems in ad-hoc wireless networks; and developing multicast debugging tools to facilitate multicast management and support multicast deployment efforts in the Internet. Some of our work was adapted and standardized by the IETF for implementation and deployment in the Internet (e.g., IETF RFC 6450). So far, I graduated 6 PhD students four of whom now serve as tenured or tenure-track faculty member in academia. Teaching Interests: I teach both undergraduate and graduate level courses on computer networks and network security. During the last several years, I taught Computer Networks Lab (undergrad), Advanced Computer Networks, and Network Security courses several times. In early 2010s, I have written a computer networks laboratory book that I use for my Computer Network Lab course. This book includes eight lab exercises on GNS3 based virtual environment. The labs use Linux based virtual end systems and Cisco, Juniper, VyOS, or Quagga based virtual routers to build various network topologies to experiment with traditional networking protocols such as RIP, OSPF, BGP, and others. Students can deploy the virtual environment on their PCs/Laptops without incurring any additional equipment cost for the institution or for themselves. Currently, I serve as the director of cyber security education programs at the CS department. I am also managing NSF sponsored Cybercorps: Scholarship for Service (SFS) Program for the department (awarded in 2010, 2014, and 2019). In this role, I am advising over a dozen scholarship students and mentoring them toward their successful degree completion and job search activities with Federal Government agencies. Teaching: CS 4390: Computer Networks [Link] CS 4396: Computer Networks Lab [Link] CS 5390: Computer Networks [Link] CS 6349: Network Security [Link] CS 6390: Advanced Computer Networks [Link] Current PhD Students: Souvik Das Former Students: Aparna Ganesan, Ph.D. in January 2025 - (first appointment: software engineer at Cisco Systems) Emrah Cem, Ph.D. in December 2016 - (first appointment: software engineer at imo.im) Mehmet E. Tozal, Ph.D. in June 2012 - (first appointment: asst. prof. in School of Computing and Informatics, Univ. Louisiana Lafayette) Jinu Kurian, Ph.D. in December 2009 - (first appointment: senior engineer in xG Technology Inc.) Mehmet Baysan, Ph.D. in August 2008 - (first appointment: postdoc. researcher in Management Dept at Univ. Toronto) (co-advised with Dr. Chandrasekaran) Mehmet H. Gunes, Ph.D. in July 2008 - (best dissertation award in CS dept.) (first appointment: asst. prof. in CS at Univ. Nevada at Reno) Chao Gong, Ph.D. in August 2007 - (first appointment: asst. prof. in CS at Univ. Mary Hardin-Baylor) Suhel Patel, M.S. in August, 2010 Hemanth Srinivasan, M.S. in July 2008 Avinash Chiganmi, M.S. in July 2006 Sevcan Bilir, M.S. in December 2004 Pavan Namburi, M.S. in November 2004 Journal Publications: Adversarial Evasion Attack Detection using Ensemble Classifiers in P4 Data Plane, A. Ganesan, K. Sarac, Journal of Network and Systems Management (Springer), 33:85, July 2025. Vulnerability Challenges of Software Defined Networking, ZJ Haas, TL Culver, K. Sarac, IEEE Communications Magazine 59 (7), 88-93, 2021. Estimation of Structural Properties of Online Social Networks at the Extreme, E. Cem and K. Sarac, Computer Networks, Vol.108, pp. 323-344, 2016. Graph Based Induction of Unresponsive Routers in Internet Topologies, H. Kardes, M.H. Gunes, and K. Sarac, Computer Networks, 81:178-200, 2015. SKAIT: A Parameterized Key Assignment Scheme for Confidential Communication in Resource Constrained Ad Hoc Wireless Networks, R.L. Novales, N. Mittal, K. Sarac, Ad Hoc Networks 20:163-181, 2014. Adaptive Information Coding for Secure and Reliable Wireless Telesurgery Communications, M.E. Tozal, Y. Wang, E. Al-Shaer, K. Sarac, B. Thuraisingham, B-T. Chu, Journal of Mobile Networks and Applications, Vol.18, Issue 5, pp 697-711, October 2013. Polynomial Time Solution to Minimum Forwarding Set Problem in Wireless Networks under Disk Coverage Model, M. Baysan, K. Sarac, and R. Chandrasekaran, Ad Hoc Networks, Vol.10, No. 7, pp. 1253-1266, September 2012. PalmTree: An IP Alias Resolution Algorithm with Linear Probing Complexity, M.E. Tozal and K. Sarac, Computer Communications, Vol. 34, No. 5, pp. 658-669, April 2011. A Survey on the Design, Applications and Enhancements of Application Layer Overlay Network, J. Kurian and K. Sarac, ACM Computing Surveys, Vol.43, No.1, pp.5.1-5.34, November 2010. Resolving IP Aliases in Building Traceroute-Based Internet Maps, M. Gunes and K. Sarac, IEEE/ACM Transactions on Networking, Vol. 17, No. 6, pp.1738-1751, December 2009. A Polynomial Time Solution to Minimum Forwarding Set Problem in Wireless Networks under Unit Disk Coverage Model, M. Baysan, K. Sarac, R. Chandrasekaran, and S. Bereg, IEEE Transactions on Parallel and Distributed Systems, Vol. 20, No. 7, pp. 913-924, July 2009. Defending Network-Based Services Against Denial of Service Attacks, J. Kurian and K. Sarac, International Journal on Network Security, Vol. 9, No. 2, pp. 186-200, September 2009. Toward a Practical Packet Marking Approach for IP Traceback, C. Gong and K. Sarac, International Journal of Network Security, Vol. 8, No. 3, pp. 271-281, March 2009. A More Practical Approach for Single-Packet IP Traceback using Packet Logging and Marking, C. Gong and K. Sarac, IEEE Transactions on Parallel and Distributed Systems, Vol.19, No.10, pp.1310-1324, October 2008. Variable Power Broadcast using Local Information in Ad Hoc Networks, with Avinash Chiganmi, Mehmet Baysan, and Ravi Prakash, Ad Hoc Networks, Vol.6, No.5, pp. 675-695, July 2008. A Measurement Study on Overhead Distribution of Value-Added Internet Services, with Mehmet H. Gunes, Sevcan Bilir and Turgay Korkmaz, Computer Networks, Vol.51, No.14, pp.4153-4173, October 2007. Single Packet IP Traceback in AS-Level Partial Deployment Scenario, with Turgay Korkmaz, Chao Gong, and Sandra G. Dykes, International Journal on Security and Networks, Vol.2, No.1/2, pp. 95-108, 2007. Load-Balanced Agent Activation for Value-Added Network Services, with Chao Gong, Ovidiu Daescu, Balaji Raghavachari, and Raja Jothi, Computer Communications, Vol.29, No.11, pp.1905-1916, July 2006. Practical Utilities for Monitoring Multicast Service Availability, with Pavan Namburi and Kevin C. Almeroth, Computer Communications, Vol.29, No.10,pp.1675-1686, June 2006. Monitoring IP Multicast in the Internet: Recent Advances and Existing Challenges, with Kevin Almeroth, IEEE Communications Magazine, Vol.43, Issue.10, pp.85-91, October 2005. Application Layer Reachability Monitoring for IP Multicast, with Kevin C. Almeroth, Computer Networks, Vol.48, No.2, pp.195-213, June 2005. A Distributed Approach for Monitoring Multicast Service Availability, with K. Almeroth, Journal of Network and Systems Management, Vol.12, No.3, pp.327-348, September 2004. Tracetree: A Scalable Mechanism to Discover Multicast Tree Topologies in the Internet, with K. Almeroth, IEEE/ACM Transactions on Networking, Vol.12, No.5, pp.795-808, October 2004. Supporting Multicast Deployment Efforts: A Survey of Tools for Multicast Monitoring, with K. Almeroth, Journal of High Speed Networks, Vol.9, No.3-4, pp.191-211, 2000. DFT Techniques for Size Estimation of Database Join Operations, with O. Egecioglu and A. El-Abbadi, International Journal of Foundation of Computer Science, Vol.10, No.1, pp.81-102, 1999. Conference Publications: In-network Reinforcement Learning for Attack Mitigation using Programmable Data Plane in SDN, A Ganesan, K Sarac, IEEE ICCCN, Big Island, HI, USA, July 2024. A Scheme to Introduce New Reachability Domain on the Internet, S Das, K Sarac, IEEE IPCCC, Nov 2023. Attack Detection and Mitigation using Intelligent Data Planes in SDNs, A Ganesan, K Sarac, IEEE Globecom, Dec 2022. Practical Labs for Teaching SDN Security, S Da",
  "content_length": 21654,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:52"
}