{
  "name": "Kamlesh Tiwari",
  "homepage": "http://www.bits-pilani.ac.in/pilani/kamleshtiwari/profile",
  "status": "success",
  "content": "Birla Institute of Technology And Science, Pilani (BITS Pilani) Campus Pilani Dubai K K Birla Goa Hyderabad BITSoM, Mumbai BITSLAW, Mumbai Links For BITS Library Admissions Faculty Practice School Placements Student Arena Career News Alumni Internationalization Events MOUs Current Students Invest in Leaders Outreach Picture Gallery Admission Integrated first degree Higher degree Doctorol programmes International Admissions Online Admissions BITSAT IMPORTANT CONTACTS Pilani Dubai Goa Hyderabad RESEARCH & INNOVATION R&I Home Grants Publications Patents Facilities CoE IIC IPEC TTO TBI Startups Outreach Contacts DEPARTMENTS Pilani Dubai Goa Hyderabad Academics Integrated First Degree B.E.(Chemical) B.E.(Civil) B.E.(Computer Science) B.E.(Electrical and Electronics) B.E. (Electronics and Computer ) B.E.(Electronics and Communication) B.E.(Electronics and Instrumentation) B.E.(Manufacturing Engineering) B.E.(Mechanical) B.Pharm.(Pharmacy) M.Sc.(Biological Sciences) M.Sc. Semiconductor and Nanoscience B.E. Environmental and Sustainability Engg. M.Sc.(Chemistry) M.Sc.(Economics) M.Sc.(General Studies) M. Sc. (Mathematics) M.Sc.(Physics) B. E. (Mathematics and Computing) Higher Degree MBA (Master of Business Administration) M.E.(Electrical with specialization in Power Electronics and Drives) M.E. Civil – Water Resource Engineering MBA (Master of Business Administration) MBA (Master of Business Administration in Business Analytics) M.E.(Communication) M. E. Computer Science with Specialization in Information Security with B.Sc. input M.E. (Mechanical with specialization in Thermal Engineering) M.E. Electronics & Control M.E. M.Pharm M.E.(Biotechnology) M.E.(Chemical) M.E.(Civil with specialization in Infrastructure Engineering and Management) M.E.(Civil with specialization in Structural Engineering) M.E.(Civil with specialization in Transportation Engineering) M.E.(Computer Science) M.E.(Design Engineering) M.E.(Embedded Systems) M.E.(Manufacturing Systems Engineering) M.E.(Mechanical) M.E. Environmental engineering M.E.(Microelectronics) M.E.(Sanitation Science, Technology and Management) M.E.(Software Systems) M.Pharm.(Pharmaceutical Chemistry) M.Pharm.(Pharmaceutics) M.Pharm.(Pharmacology) M.Pharm.(Pharmacy) M.Sc. General Studies – Communication and Media Studies Stream Master in Public Health MBA(Master of Business Administration In Business Analytics) Doctoral Programmes Biological Sciences Chemical Engineering Chemistry Civil Engineering Computer Science & Information Systems Economics & Finance Electrical & Electronics Engineering Humanities & Social Sciences Management Mathematics Mechanical Engineering Pharmacy Physics General Sciences WILP Work Integrated Learning Programmes Dubai Campus Integrated First Degree Higher Degree Doctoral Programmes Explore BITS About Legacy Achievements Social Responsibility Sustainability Divisions Pilani Dubai K K Birla Goa Hyderabad Mumbai Pilani K K Birla Goa Hyderabad Dubai follow us Feedback Give us your feedback If you notice any issues or missing content, please let us know. Your feedback helps us improve. Thank you. Upload Screenshot Where innovation and leadership go hand-in-hand. Serving the nation and world for the 21st Century. Instilling a culture of excellence in every individual. Experience-based learning prepares you for day one and beyond. Values that drive change in the world. Years of Excellence. A place of learning called home. Department of Humanities and Social Sciences, BITS Pilani, Pilani Campus inviting Application for Visiting Faculty Position – On Campus 1 August, 2025 | Pilani Convocation 2025, BITS Pilani 28 May, 2025 | Pilani 76th Republic Day Celebrations at BITS Pilani, Pilani Campus 27 January, 2025 | Pilani Admission in Two-Year On-Campus MBA in Business Analytics Programme of BITS Pilani, Pilani Campus for Academic Year 2025-26 is open now. 2 January, 2025 | Pilani Join BITS Pilani as a Professor of Practice 27 August, 2024 | Join BITS Pilani as a Professor of Practice BITS Pilani Hyderabad: Revolutionising Education For Industry And Entrepreneurs 19 July, 2024 | BITS Pilani Hyderabad: Revolutionising Education For Industry And Entrepreneurs Springer Nature and BITS Pilani  signed a Memorandum of Understanding 16 July, 2024 | Springer Nature and BITS Pilani  signed a Memorandum of Understanding BITS-RMIT Higher Education Academy Students Discover RMIT and Melbourne 10 June, 2024 | BITS-RMIT Higher Education Academy Students Discover RMIT and Melbourne Convocation 2025 Pilani Campus: July 13, 2025 Goa Campus: July 27, 2025 Hyderabad Campus: August 3, 2025 WILP Convocation: August 17, 2025 Dubai Campus: September 2025 (firm date to be shared soon) Pilani Campus: July 13, 2025 Goa Campus: July 27, 2025 Hyderabad Campus: August 3, 2025 WILP Convocation: August 17, 2025 Dubai Campus: September 2025 (firm date to be shared soon) What are you here for? I want to Know Courses Offered Register for BITSAT Know About Faculty See Campuses Know Admission Deadlines Find the right programme Select Campus Pilani Dubai K K Birla Goa Hyderabad BITS School of Management, Mumbai BITS Law School, Mumbai BITS Design School, Mumbai Select Academics Integrated First Degree Higher Degree Doctoral Programmes WILP Select Programme Research Sponsored Projects Research Based Consultancy Research Publications BITSAT APPLY NOW ALUMNI 186033 Alumni across the globe 6400+ Founders across the globe 7400+ CEO's across the globe Student Welfare Student Welfare Division is dedicated to the welfare of the students. We encourage a student's overall development, whether academics or beyond academics, within the framework of the campus rules. practiceschool Practice School Program provides students an opportunity to Practice what they have learnt, in global organizations under the supervision of a mentor. Events 10th International Conference on Product Lifecycle Modeling, Simulation and Synthesis (PLMSS) 1450 PRE PLACEMENT OFFER 170 PATENT GRANTD & FILED 146 H-INDEX 218200 CUMULATIVE CITATIONS 390 EXTERNAL FUNDING 7000 FOUNDERS COFOUNDERS announcements Convocation 2025, BITS Pilani BITSAT Admissions and Aspirants Alert Join BITS Pilani as a Professor of Practice Call for Creating Future-Ready Digital Platforms for Education The joys and sorrows of any life in science “Proton acceleration by circularly polarized travelling arrows PLACEMENTS Pilani dubai goa hyderabad mumbai wilp leaders @ BITS Dr. Kumar Mangalam Birla Chancellor Prof. V. Ramgopal Rao Vice-Chancellor Col Soumyabrata Chakraborty (Retd) Registrar, Non-member Secretary Prof. Sudhirkumar Barai Director, BITS, Pilani - Pilani Campus Prof. Souri Banerjee Director, BITS Pilani, Dubai Campus Prof. Suman Kundu Director, BITS, Pilani - K.K. Birla Goa Campus Prof. Soumyo Mukherji Director, BITS Pilani, Hyderabad Campus Prof. G Sundar Director - Off-Campus Programmes and Industry Engagement Life @ BITS International Collab BITS Pilani has collaborations with several reputed overseas universities and industries. work@BITS Latest Updates Convocation 2025, BITS Pilani read more Loading... Keep Exploring Faculty Events News Academics Admission Campus University Home K K Birla Goa Pilani Hyderabad Dubai BITSoM, Mumbai BITSLAW, Mumbai Faculty Explore Campus Pilani Dubai K K Birla Goa Hyderabad BITSoM, Mumbai BITSLAW, Mumbai Academics Integrated First Degree Higher Degree Doctoral Programmes WILP Dubai Campus Admission Integrated first degree Higher degree Doctorol programmes International Admissions BITS Pilani Digital BITSAT Research & Innovation Overview Sponsored Research Projects Consultancy Based Projects Patents Publications R&D Centers Departments Pilani Dubai Goa Hyderabad Important Contacts Pilani Dubai Goa Hyderabad Divisions Pilani K K Birla Goa Hyderabad Dubai Explore BITS About Legacy Achievements Social Responsibility Sustainability Links For BITS Library Admissions Faculty Practice School Placements Student Arena Career News Alumni Internationalization Events MOUs Current Students Invest in Leaders Outreach Picture Gallery Cookie Consent This website uses cookies or similar technologies, to enhance your browsing experience. Accept",
  "content_length": 8172,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:52"
}