{
  "name": "Kan Ren",
  "homepage": "http://www.saying.ren",
  "status": "success",
  "content": "Kan Ren (任侃) Kan's page home Publications topical chronological Researches projects talks datasets Teaching courses Kan Ren (任侃) Kan Ren, Assistant Professor Visual and Data Intelligence (VDI) Center School of Information Science and Technology ShanghaiTech University Office: Building 1C 303.A, 393 Huaxia Middle Road, Pudong New Area, Shanghai, China renkan(-AT-)shanghaitech.edu.cn rk.ren(-AT-)outlook.com Google Scholar, GitHub Kan Ren is an Assistant Professor at VDI Center within the School of Information Science and Technology at ShanghaiTech University. Previously, he held a position as a Senior Researcher at Microsoft Research Asia. His research primarily focuses on machine learning, data mining and reinforcement learning, with diverse applications in data science fields such as spatiotemporal data, language, and vision. Kan is committed to addressing practical issues in data science and innovating machine learning methods, including but not limited to data mining, foundational model innovation, automated machine learning, and interpretable machine learning. He has published over 40 research papers in internationally renowned conferences and journals, including NeurIPS, ICLR, and KDD. Two of his works about large language models (LLM) on data science have been awarded as Best Paper and Outstanding Paper in top-tier conferences. Kan has written a book on recommender systems and he has also played a pivotal role in leading or contributing to several significant open-source projects, including Sequence Machine Learning, Automated Machine Learning, Automated Reinforcement Learning, AI for Healthcare, and AI for Finance. As a mentor, Kan has nurtured and guided over ten internship students, many of whom have successfully gained admission to renowned institutions such as MIT, CMU, University of California San Diego, and University of Maryland. Additionally, many students under his guidance have received many special offers from top-tier technology companies including Huawei, Alibaba, Tencent, ByteDance, Meituan, and Xiaohongshu. Prospective students: I'm now looking for prospective PhD/Master students and student interns to work together on the below research directions. Please drop me an email with your resume and transcript if you are interested. (i) Large language/multimodal model, LLM-based AI agents; (ii) Explainable and responsible AI; (iii) Large foundation model for data science. 招生公告：课题组正在招收保研、统考研究生、实习生（大语言模型与语言智能体方向、数据挖掘与机器学习方向），请有意向的同学通过邮件发送简历与成绩单，并简要介绍成绩与科研、竞赛经历。 2027年入学学术型博/硕士研究生 Openings for Postdoctoral and Research Assistant positions are available. Book “Recommender System: Frontiers and Practices”: link (Chinese), link (English), introduction. Please check our latest research about machine intelligence on sequence data paradigm. Recent News 2025.9 - Our Time Series Foundation Model Kairos has been released. Please check Kairos_50/23/10m in GIFT-Eval Leaderboard. 2025.9 - One paper has been accepted in NeurIPS 2025. 2025.5 - Our work about Optimal In-Context Learning in LLMs has been accepted in ACL 2025. 2025.5 - Our work about Multimodal Time-series Modeling has been accepted in ICML 2025. 2025.2 - Our work about Explainable and Responsible AI has been accepted in CVPR 2025. 2025.1 - Our work about Explainable AI has been accepted in ICLR 2025. 2024.9 - Four papers have been accepted in NeurIPS 2024. 2024.7 - Our work VisEval has been awarded as Best Paper of IEEE VIS 2024 (CCF-A)! 2024.7 - Our work VisEval about LLM for Data Visualization has been accepted in VIS 2024. 2024.7 - Our work about Time-series Model Pretraining has been accepted in CIKM 2024. 2024.5 - Our work about LLM for Data Science has been accepted in the main conference of ACL 2024. 2024.3 - Our paper about large-language model for machine learning has been awarded as Outstanding Paper in EACL 2024! 2024.1 - Our preliminary exploration about LLM for machine learning has been accepted in EACL 2024. 2024.1 - One paper about interpretable time series modeling has been accepted in ICLR 2024. 2023.12 - I will join ShanghaiTech University as an Assistant Professor in late 2023. 2023.9 - Two papers about irregular time-series modeling and EEG model pretraining have been accepted in NeurIPS 2023. 2023.8 - Our work about AIGC through brain-computer interface (BCI) has been online. Please checkout the paper and English or Chinese articles. 2023.7 - Checkout the latest Chinese article about our research of RL for Finance and Qlib toolkit! (WeChat, MSRA News) 2023.5 - Our work about AI for healthcare on neonatal seizure detection has been accepted in SMC 2023. 2023.5 - Our work about reinforcement learning for finance has been accepted in KDD 2023. 2023.4 - Our work MLCopilot about LLMs for automated machine learning has been online. 2023.4 - One paper about brain-inspired neural network has been accepted in ICML 2023. 2023.3 - The website of our SeqML research (machine intelligence on sequence data) has been online. 2023.1 - One paper about enseble learning for pretrained models has been accepted in ICLR 2023. Research Foundation model: large language model and LLM-based agents. Data mining: spatiotemporal data mining and machine learning applications. Learning algorithm: automated machine learning, xAI, and reinforcement learning. Selected Publications Large Foundation Models, AI Agents and Responsible AI Learning to Select In-Context Demonstration Preferred by Large Language Model, Z. Zhang, S. Lan, L. Song, J. Bian, Y. Li, and K. Ren (corresponding). The 63rd Annual Meeting of the Association for Computational Linguistics (ACL 2025 Findings). Dissecting and Mitigating Diffusion Bias via Mechanistic Interpretability, Y. Shi, C. Li, Y. Wang, Y. Zhao, A. Pang, S. Yang, J. Yu, and K. Ren (corresponding). 2025 Conference on Computer Vision and Pattern Recognition (CVPR 2025). Discovering Influential Neuron Path in Vision Transformers, Y. Wang, Y. Liu, Y. Shi, C. Li, A. Pang, S. Yang, J. Yu, and K. Ren (corresponding). The Thirteenth International Conference on Learning Representations (ICLR 2025). (Best Paper Award) VisEval: A Benchmark for Data Visualization in the Era of Large Language Models, N. Chen, Y. Zhang, J. Xu, K. Ren (corresponding), Y. Yang. IEEE Visualization Conference (VIS 2024). (Outstanding Paper Award) MLCopilot: Unleashing the Power of Large Language Models in Solving Machine Learning Tasks, L. Zhang, Y. Zhang, K. Ren (corresponding), D. Li, Y. Yang The 18th Conference of the European Chapter of the Association for Computational Linguistics (EACL 2024). TaskBench: Benchmarking Large Language Models for Task Automation, Y. Shen, K. Song, X. Tan, W. Zhang, K. Ren, et al. The 38th Conference on Neural Information Processing Systems (NeurIPS 2024). Benchmarking Data Science Agents, Y. Zhang, Q. Jiang, X. Han, N. Chen, Y. Yang, K. Ren (corresponding). The 62nd Annual Meeting of the Association for Computational Linguistics. Learning Multi-Agent Intention-Aware Communication for Optimal Multi-Order Execution in Finance, Y. Fang, Z. Tang, K. Ren (corresponding), W. Liu, et al. Proceedings of the 29th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, ACM, 2023. Bootstrapped Transformer for Offline Reinforcement Learning, K. Wang, H. Zhao, X. Luo, K. Ren (corresponding), et al. The 36th Conference on Neural Information Processing Systems (NeurIPS 2022). Reinforcement Learning with Automated Auxiliary Loss Search, T. He, Y. Zhang, K. Ren (corresponding), et al. The 36th Conference on Neural Information Processing Systems (NeurIPS 2022). Towards Applicable Reinforcement Learning: Improving the Generalization and Sample Efficiency with Policy Ensemble, Z. Yang, K. Ren (corresponding), et al. The 31st International Joint Conference on Artificial Intelligence (IJCAI-22). Universal Trading for Order Execution with Oracle Policy Distillation, Y. Fang, K. Ren (corresponding), et al. Proceedings of the Thirty-Fifth AAAI Conference on Artificial Intelligence (AAAI-21). Machine Learning and Data Mining VerbalTS: Generating Time Series from Texts, S. Gu, C. Li, B. Jing, K. Ren (corresponding). The 42nd International Conference on Machine Learning (ICML 2025). Towards Editing Time Series, B. Jing, S. Gu, T. Chen, Z. Yang, D. Li, J. He, K. Ren (corresponding). The 38th Conference on Neural Information Processing Systems (NeurIPS 2024). EEG2Video: Towards Decoding Dynamic Visual Perception from EEG Signals, X. Liu, Y. Liu, Y. Wang, K. Ren (corresponding), W. Zheng, et al. The 38th Conference on Neural Information Processing Systems (NeurIPS 2024). Automated Contrastive Learning Strategy Search for Time Series, B. Jing, Y. Wang, G. Sui, J. Hong, J. He, Y. Yang, D. Li, K. Ren (corresponding). The 33rd ACM International Conference on Information and Knowledge Management (CIKM 2024). CNN Kernels Can Be the Best Shapelets, Z. Qu, Y. Wang, X. Luo, W. He, K. Ren, D. Li The Twelfth International Conference on Learning Representations (ICLR 2024). ContiFormer: Continuous-Time Transformer for Irregular Time Series Modeling, Y. Chen, K. Ren (corresponding), Y. Wang, Y. Fang, W. Sun, D. Li. The 37th Conference on Neural Information Processing Systems (NeurIPS 2023). Learning Topology-Agnostic EEG Representations with Geometry-Aware Modeling, K. Yi, Y. Wang, K. Ren (corresponding), D. Li. The 37th Conference on Neural Information Processing Systems (NeurIPS 2023). CircuitNet: A Generic Neural Network to Realize Universal Circuit Motif Modeling, Y. Wang, X. Jiang, K. Ren, et al. Fortieth International Conference on Machine Learning (ICML-23). SIMPLE: Specialized Model-Sample Matching for Domain Generalization, Z. Li, K. Ren (corresponding), et al. Eleventh International Conference on Learning Representations (ICLR 2023). Towards Inference Efficient Deep Ensemble Learning, Z. Li, K. Ren (corresponding), et al. Proceedings of the Thirty-Seventh AAAI Conference on Artificial Intelligence (AAAI-23). Protecting the Future: Neonatal S",
  "content_length": 12693,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:50"
}