{
  "name": "Kanad Ghose",
  "homepage": "http://www.cs.binghamton.edu/~ghose",
  "status": "success",
  "content": "Kanad Ghose - Home Page Kanad Ghose Professor, Department of Computer Science, SUNY Binghamton Site Director, Center for Energy-Smart Electronic Systems (ES2), an NSF IUCRC Research Interests Power-aware microarchitectures and systems Computer systems High-performance computing Cyber-physical systems Some Current Projects Data center scale power management Cybersecurity at the systems and microarchitectural level Flexible electronics sensor for human performance monitoring Autonomous indoor UAV Energy-efficient processor design More Details & Past Projects > Current and Former Ph.D. Students > Recent Representative Publications Adriano Garcia, Edward Mattison, and Kanad Ghose High-Speed Vision-Based Autonomous Indoor Navigation of a Quadcopter in Proc. of the Int'l. Conf. on Unmanned Aircraft Systems (ICUAS), 2015, pp. 338-347 Erdem Aktas, Furat Afram, and Kanad Ghose Continuous, Low Overhead, Run-Time Validation of Program Executions in Proc. of the Int'l. Symp. on Microarchitecture (MICRO), 2014, pp. 229-241 Furat Afram, Hui Zeng, and Kanad Ghose A Group-Commit Mechanism for ROB-Based Processors Implementing the X86 ISA in Proc. of the Int'l. Conf. on High-Performance Computer Architecture (HPCA), 2013, pp. 47-58 James Rosswog and Kanad Ghose Detecting and Tracking Coordinated Groups in Dense, Systematically Moving, Crowds in Proc. of the SIAM Int'l. Conf. on Data Mining (SDM), 2012, pp. 338-347 Avadh Patel, Furat Afram, Shunfei Chen, and Kanad Ghose MARSS: A Full System Simulator for Multicore x86 CPUs in Proc. of the Design Automation Conference (DAC) 2011, pp. 1050-1055 View All Publications on Google Scholar > Education Ph.D. in Computer Science Iowa State University, 1988 M.S. in Computer Science Iowa State University, 1986 M.Tech. in Electronics Engineering University of Calcutta, 1980 B.Tech. in Electronics Engineering University of Calcutta, 1977 Awards & Honors SUNY Chancellor's Award for Excellence in Scholarship and Creative Activities; Most Prolific Inventor IBM Faculty Award Boeing Research Fellowship (Iowa State University) Phi Kappa Phi Honor Society inductee (M.S., Ph.D.) University Gold Medal (B.Tech.) National Science Talent Search Award, India National Scholarship, India",
  "content_length": 2230,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:51"
}