{
  "name": "Kang G. Shin",
  "homepage": "http://web.eecs.umich.edu/~kgshin",
  "status": "success",
  "content": "Kang Shin's Home Page RTCL Homepage Courses Students & Collaborators RTCL Alumni Tree Publications Event photos KANG G. SHIN (신강근) I am the Kevin and Nancy O'Connor Professor of Computer Science, and the Founding Director of the Real-Time Computing Laboratory (RTCL) in the Department of Electrical Engineering and Computer Science at The University of Michigan. It has been my immense joy and privilege to work with a great many students (especially 93 PhD students so far), postdocs, visitors and faculty colleagues over the last 4+ decades. I am currently exploring various exciting research issues in the areas of mobile networks, systems and applications, security and privacy, as well as cyber-physical systems, especially semi-autonomous (human-in-the-loop) systems. My group has also been using and/or developing machine learning, digital signal processing and control algorithms to address the various research issues associated with these systems. These research issues are often motivated by, and hence their results are applicable to,  real-life systems such as autonomous cars & robots, smart phones and homes, smart connected communities, and human health & wellness. I have led several major research projects, including: Mobile wireless networking and computing, including cognitive-radio or software-defined wireless networks, 5G wireless LANs, mobile sensing and apps. Computation and network security and privacy, including location privacy protection, self-securing mobile handsets, botnets, malware classification, and application protection in untrusted environments. Cyber-physical systems by integrating real-time embedded applications and system SW with real-life physical systems like large-scale energy storage systems, ground and space/air vehicles; low-power embedded real-time OS, scheduling theory, middleware, and networks. Resilient and efficient cloud computing service and operation via virtualization-based server consolidation, replication and resource management. Click here for details of these projects and recent publications. Short biosketch: click here REAL-TIME COMPUTING LABORATORY Department of Electrical Engineering and  Computer Science The University of Michigan 2260 Hayward St. Ann Arbor, MI 48109-2121 PHONES: +1 734-763-0391 (voice) +1 734-763-8094 (fax) E-MAIL: kgshin@umich.edu",
  "content_length": 2333,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:53"
}