{
  "name": "Kang Liu 0001",
  "homepage": "http://www.nlpr.ia.ac.cn/cip/~liukang/index.html",
  "status": "success",
  "content": "Kang Liu 刘康 Toggle navigation Kang's Homepage Home Publications Invited Talks Grants and Awards Academic Services Demos Datasets Professor Research Group of Speech and Language Technology, National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences Office: Room 708, Intelligence Building, Institute of Automation, Chinese Academy of Sciences, Zhongguancun East Road 95#, Beijing, China, 100190 Email: kliu(at)nlpr(dot)ia(dot)ac(dot)cn He is currently a Professor in National Laboratory of Pattern Recognition (NLPR), Institute of Automation, Chinese Academy of Sciences. He obtained Ph.D. in Computer Science from NLPR in 2010. His advisor is Prof. Jun Zhao. In 2005, He obtained M.S. in Pattern Recognition from Institute of Intelligent Information Processing, Xidian University under the supervision of Prof. Licheng Jiao. Prior to that, He obtained B.E. from the School of Electronic Engineering, Xidian University. He has been a visiting scholar in Baidu NLP group from 9/2010 to 12/2010 (working with Prof. Haifeng Wang). His research interests include Information Extraction, Question Answering, Knowledge Graph, Natural Language Processing and Nerual Symbolic Learning. He has published more than 80 papers at top-tier conferences and journals including TKDE, ACL, IJCAI, EMNLP, WWW, CIKM, COLING etc. He was the recipient of COLING 2014 Best Paper Award, Google Focused Research Award in 2015 and 2016, \"CCF-Tencent\" Research Excellent Award in 2014, “Hanwang Youth Innovation Excellence Award” in 2014 by Chinese Information Processing Society, the first price of “QianWeiChang Chinese Information Processing Scientific and Technological Progress Award” by Chinese Information Processing Society in 2018 and the first price of \"Beijing Scientific and Technological Progress Awards\" in 2019. I am currently a Youth Scientist of Beijing Academy of Artificial Intelligence, and a Professor of University of Chinese Academy of Sciences. He served as the Chair of Youth Working Committee (2018-2020) in Chinese Information Processing Society, General Secretary of Special Group of Language and Knowledge Computing (2017-present) in Chinese Information Processing Society, and Associate Editor of Pattern Recognition. He also has served for many AI conferences, such as General Chairs (CCKS-2022), PC Chairs (CCKS-2020, CCL-2021), and SAC/SPC/AC (ACL(2017, 2019), EMNLP(2021, 2022), AAAI(2022), COLING(2022), ISWC(2020), EACL(2020), AACL(2020), CIKM(2020, 2021), NLPCC(2022)) News I serve as an Area Chair of ACL-2023. I have two papers accepted by AAAI-2023. I have two papers accepted by EMNLP-2022. I have six papers accepted by COLING-2022. I serve as a General Co-chair of CCKS 2022. I serve as a Senior Area Chair of EMNLP-2022. I serve as a Senior Area Chair of COLING-2022.",
  "content_length": 2822,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:52"
}