{
  "name": "Kangsoo Kim",
  "homepage": "https://www.hxi-lab.ca",
  "status": "success",
  "content": "HXI LabSearch this siteEmbedded FilesSkip to main contentSkip to navigationHuman-X Interaction LabWelcome to Human-X Interaction Lab!Human society is encountering a new wave of advancements related to smart connected technologies with the convergence of different traditionally separate fields, which can be characterized by a fusion of technologies that merge and tightly integrate the physical, digital, and biological spheres. In this new paradigm of convergence, all the physical and digital things will become more and more intelligent and pervasively connected to each other, and the boundary between them will blur and become seamless. Here, human interaction is extended to various types of device form factors and interface metaphors beyond traditional human-computer or human-human interactions, and requires more innovative and intuitive ways to enhance our experience and abilities.The HXI Lab aims to create, enhance, and transform our reality experience by employing cutting-edge eXtended Reality (XR—embracing Virtual/Augmented/Mixed Reality), together with advanced Artificial Intelligence (AI) and ubiquitous computing empowered by the Internet of Things/Everything (IoT/IoE) systems. While we pursue better user experience and understanding human factors, e.g., perception/cognition and behaviour, we examine the effects of such technology-enhanced human interactions in different application areas.KeywordsPervasive XR (AR/VR/MR) and MetaversePerception and Cognition in XRSocial Interaction in XR: Avatars and AgentsPhysical-Virtual Interaction in XRAugmented HumanLatest News[2025-10-19] Chae Heon's paper has been accepted in IJHCI.[2025-10-12] Omar, Hyeongil, and Kangsoo received an Honorable Mention Award (Top 3%) at IEEE ISMAR 2025.[2025-10-12] Hyeongil, Muskan, Ahmad, Jessica, Omar, and Mehak presented their research at IEEE ISMAR 2025.[2025-10-08] Mehdi and Arjun presented our SHAPE and Nursing Education projects during the 1st XRAI-SCA Workshop at IEEE ISMAR 2025.[2025-10-03] Kangsoo co-organized and Hyeongil participated in the KOFST BrainLink X-Lab Day in Incheon.[2025-09-27] Kangsoo delivered a keynote talk at APMAR 2025.For more details, News & Events...Join UsThe HXI Lab is looking for highly motivated and hardworking students in all levels (BSc, MSc and PhD students).***IMPORTANT: Before submitting your application or contacting our lab, please take a moment to carefully check and learn about what we are doing through this webpage, in particular the research, projects, and publications pages. Desired candidates are expected to have strong communication and programming skills, such as how to use various computer vision and graphics libraries (fundamental understanding of linear algebra and 3D graphics), development experiences of VR/AR applications with difference tools/devices (e.g., Unity, HMDs, mobile devices). General understanding of user study (human subject research) is required or at least of your interest to learn.​​How to apply: Please contact Dr. Kangsoo Kim by sending an email to kangsoo.kim[at]ucalgary.ca with \"HXI Prospective Student (BSc/MSc/PhD): Your Name\" in the subject line. You must include the following documents in the email:Cover letter - describe what kind of research you are interested in and how you would fit in the position in our lab.Resume/CVTranscriptsResearch proposal (1 page)English language proficiency score (if you are international)For more detailed information about the UofC / Schulich School of Engineering admission requirements and deadlines, please check this.Undergraduate Research StudentsSummer undergraduate research interns are welcome through PURE or NSERC USRA, and non-paid voluntary research experience opportunities are always available for self-motivated students together with our team members. You may consider taking independent research credit courses (ENEL 591 and 599 - Individual Engineering Design Project I and II).Postdoctoral FellowsThere are several great internal/external funding opportunities for prospective postdoc fellows, e.g., UofC Eyes High Postdoctoral Match-Funding Program and Mitacs Elevate. Please contact Dr. Kangsoo Kim (kangsoo.kim[at]ucalgary.ca) with \"HXI Prospective Postdoc: Your Name\" in the subject line, including your cover letter, CV, detailed research proposal, contact info of at least two references.Google SitesReport abusePage detailsPage updated Google SitesReport abuse",
  "content_length": 4433,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:54"
}