{
  "name": "KangKang Yin",
  "homepage": "https://www.cs.sfu.ca/~kkyin",
  "status": "success",
  "content": "KangKang Yin KangKang Yin Associate Professor, School of Computing Science, Simon Fraser University, 8888 University Drive, Burnaby, BC, CANADA, V5A 1S6 Office: TASC1 8015 Phone: 778-782-4190 Email: please read this Introduction | Short Bio | Research Opportunities | Teaching | Activities | Publications | Patents I am an Associate Professor in the School of Computing Science at the Simon Fraser University (SFU). I am interested in Computer Animation and Simulation, especially responsive character animation and real-time humanoid motion control. Other areas I work on include digital humans, AI content generation, geometry processing and deformation, and motion-based and sketch-based interfaces. Short Bio KangKang Yin is currently an Associate Professor in the School of Computing Science at the Simon Fraser University. From 2010 to 2016 she was a faculty member in the Department of Computer Science at the National University of Singapore. She worked as an Associate Researcher at Microsoft Research Asia from 2008 to 2010, after she obtained her PhD degree from the University of British Columbia in 2007. Her research interests include Computer Animation and Geometry Processing, Computer Vision, Machine Learning, Human Computer Interaction, and Humanoid Robotics. She regularly serves on the program committees of all major computer graphics conferences including SIGGRAPH, SIGGRAPH Asia, Eurographics, SCA(ACM SIGGRAPH/Eurographics Symposium on Computer Animation), among others. She was a program co-chair for Pacific Graphics 2013, SCA2017, and Graphics Interface 2023. She has won three SCA best-paper awards (2011, 2013 and 2015). She is a senior member of ACM and IEEE. Research Opportunities The Visual Computing Group at SFU school of computing science ranks 11th worldwide in 2022 by http://csrankings.org/#/index?vision&graph&world. Currently I have openings for PhD students. Students with background in computer science and engineering, math, physics, mechanical engineering, or electrical engineering are preferred. If you are a highly motivated undergraduate or Master's student strong in math and programming, and interested in Computer Animation, please send your resume directly to me. We collaborate with researchers and industries worldwide. I also strongly recommend you to read the following two posts about the life of a PhD student: A Survival Guide to a PhD; Students' rights and responsibilities (Chinese version) I also have a Postdoc position available on character animation and digital human related research topics. If intereseted, please send your CV directly to me. We are located at SFU Burnaby campus, which is about 40-minute drive from SFU Vancouver downtown campus, and 30-minute drive from SFU surrey campus. Vancouver is also known as Hollywood North, and named second best North American city for filmmaker in year 2017. Teaching Fall 2025: CMPT 766 - Computer Animation Spring 2025: CMPT 466 - Computer Animation Fall 2024: CMPT 766 - Computer Animation Summer 2023: CMPT 361 - Introduction to Computer Graphics Spring 2023: CMPT 466/766 - Computer Animation Summer 2022: CMPT 361 - Introduction to Visual Computing Spring 2022: CMPT 466/766 - Computer Animation Fall 2019: CMPT 466 - Animation / CMPT985 - Computer Animation Summer 2019: CMPT361 - Introduction to Computer Graphics Spring 2019: CMPT361 - Introduction to Computer Graphics Fall 2018: CMPT 466 - Animation / CMPT888 - Computer Animation Spring 2018: CMPT 466 D100 - Animation CMPT 888 G300 - Special Topics in Computer Graphics, HCI, Vision and Visualization (3) - Computer Animation Professional Activities Program Chairs Graphics Interface 2023:  Why you need to come to Victoria? SCA 2017 Pacific Graphics 2013 Conference Chairs Shape Modeling International 2019 Associate Editors Computer Graphics Forum: 2016-2019 Computers & Graphics: 2013-2016 Program Committees ACM SIGGRAPH ASIA 2009, 2010, 2012, 2013, 2015 ACM SIGGRAPH 2011, 2016, 2018 ACM SIGGRAPH ASIA 2014 Courses Eurographics 2012 SCA 2011, 2012, 2015, 2020 MIG 2010, 2011, 2012 CASA 2011, 2012 Graphics Interface 2018, 2022 Other Committees ACM SIGGRAPH Nominations Committee 2017, 2018 SCA Steering Committee 2017 onwards Paper Reviewing (selected) ACM SIGGRAPH (ACM Special Interest Group on GRAPHics and Interactive Techniques) ACM SIGGRAPH ASIA Eurographics (European Association for Computer Graphics) SCA (ACM SIGGRAPH / Eurographics Symposium on Computer Animation) Pacific Graphics (Pacific Conference on Computer Graphics and Applications) CASA (Computer Animation and Social Agents) MIG (Motion in Games) TOG (ACM Transactions on Graphics) TVCG (IEEE Transactions on Visualization and Computer Graphics) CGF (Computer Graphics Forum) Computers & Graphics CAVW (Computer Animation and Virtual Worlds) T-RO (IEEE Transactions on Robotics) Publications Motion Capture Data: SFU Motion Capture Database Book Chapters Simulation for Control, KangKang Yin, Libin Liu, Michiel van de Panne. In \"Humanoid Robotics: a Reference\" edited by Ambarish Goswami and Prahlad Vadakkepat. Springer 2018. Biped Controller for Character Animation, KangKang Yin, Stelian Coros, Michiel van de Panne. In \"Handbook of Human Motion\" edited by Bertram Müller and Sebastian I. Wolf. Springer 2017. Representative Image Paper PARC: Physics-based Augmentation with Reinforcement Learning for Character Controllers, Michael Xu, Yi Shi, KangKang Yin, and Xue Bin Peng. conditionally accepted to SIGGRAPH 2025. [paper 13MB][demo] AAMDM: Accelerated Auto-regressive Motion Diffusion Model, Tianyu Li, Zhuhan Qiao, Guanqiao Ren, KangKang Yin, and Sehoon Ha. CVPR 2024. [paper 3MB][demo] Robust Visual Teach and Repeat for UGVs Using 3D Semantic Maps, M.Mahdavian, KangKang Yin, and Mo Chen. IEEE Robotics and Automation Letters, Volume 7, Issue 4, October 2022, pp. 8590-8597. [pdf 7MB][demo] Learning to Use Chopsticks in Diverse Gripping Styles, Zeshi Yang, KangKang Yin, and Libin Liu. ACM Transactions on Graphics, Volume 41, Issue 4, Article 95 (Proc. ACM SIGGRAPH 2022), 17 pages. [pdf 43MB][demo 237MB] Discovering Diverse Athletic Jumping Strategies, Zhiqi Yin, Zeshi Yang, Michiel van de Panne, KangKang Yin. ACM Transactions on Graphics, Volume 40, Issue 4, Article 19 (Proc. ACM SIGGRAPH 2021), 17 pages. [pdf 10MB][main video (high jumps) 42MB][supplementary video (obstacle and long jumps) 22MB] Featured on Two Minute Papers as Simulating The Olympics...On Mars! Learning and Exploring Motor Skills with Spacetime Bounds, Li-Ke Ma, Zeshi Yang, Xin Tong, Baining Guo, KangKang Yin. Computer Graphics Forum, Volume 40, Issue 2 (Proc. Eurographics 2021). [pdf 17MB][demo 119MB] Featured on Two Minute Papers as AI Learned To Perform A Cartwheel…With Style! Linear Time Stable PD Controllers for Physics-based Character Animation, Zhiqi Yin and KangKang Yin. Computer Graphics Forum, Volume 39, Issue 8 (Proc. ACM SIGGRAPH/Eurographics Symposium on Computer Animation 2020). [pdf 0.5MB][demo 140MB][code on GitHub][talk on YouTube][3-minutes talk on YouTube] Hierarchical Action Classification with Network Pruning, Mahdi Davoodikakhki and KangKang Yin. 15th International Symposium on Visual Computing (ISVC 2020). [pdf 0.5MB][talk 147MB] Towards Robust Direction Invariance in Character Animation, Li-Ke Ma, Zeshi Yang, Baining Guo, KangKang Yin. Computer Graphics Forum, Volume 38, Issue 7 (Proc. Pacific Graphics 2019). [pdf 8MB][demo 92MB] Laplace-Beltrami Operator on Point Clouds Based on Anisotropic Voronoi Diagram, Hongxing Qin, Yi Chen, Yunhai Wang, Xiaoyang Hong, KangKang Yin, Hui Huang. Computer Graphics Forum, Volume 37, Issue 6, September 2018, pp. 106-117. [pdf 6MB] Emotion Control of Unstructured Dance Movements, Andreas Aristidou, Qiong Zeng, Efstathios Stavrakis, KangKang Yin, Daniel Cohen-Or, Yiorgos Chrysanthou, Baoquan Chen. ACM SIGGRAPH/Eurographics Symposium on Computer Animation 2017, Article 9. [pdf 24MB][ demo 46MB][supplemental materials 110MB] DeepLoco: Dynamic Locomotion Skills Using Hierarchical Deep Reinforcement Learning, Xue Bin Peng, Glen Berseth, KangKang Yin, Michiel van de Panne. ACM Transactions on Graphics, 36, 4, Article 41 (Proc. ACM SIGGRAPH 2017), 16 pages. [pdf 8MB][ highlights 104MB, main video 92MB, supplemental video 145MB] Crowd-driven Mid-scale Layout Design, Tian Feng, Lap-Fai Yu, Sai-Kit Yeung, KangKang Yin, Kun Zhou. ACM Transactions on Graphics, 35, 4, Article 132 (Proc. ACM SIGGRAPH 2016), 14 pages. [pdf 52MB][supplemental material 10MB][demo 33MB] Guided Learning of Control Graphs for Physics-based Characters, Libin Liu, Michiel van de Panne, KangKang Yin. ACM Transactions on Graphics, 35, 3, Article 29 (presented at SIGGRAPH 2016), 14 pages. [pdf][demo 120MB] Learning Reduced-Order Feedback Policies for Motion Skills, Kai Ding, Libin Liu, Michiel van de Panne, KangKang Yin. ACM SIGGRAPH/Eurographics Symposium on Computer Animation 2015, pp. 83-92. [pdf][demo 18MB] SCA2015 Best Paper Award Deformation Capture and Modeling of Soft Objects, Bin Wang, Longhua Wu, KangKang Yin, Uri Ascher, Libin Liu, Hui Huang. ACM Transactions on Graphics, 34, 4, Article 94 (Proc. ACM SIGGRAPH 2015), 12 pages. [pdf 70MB][pdf 14MB][demo 70MB] Improving Sampling-based Motion Control, Libin Liu, KangKang Yin, Baining Guo. Computer Graphics Forum (Proc. Eurographics 2015), Volume 34, Issue 2, pp. 415-423. [pdf][demo 60MB] Control of Rotational Dynamics for Ground and Aerial Behavior. Victor Zordan, David Brown, Adriano Macchietto, KangKang Yin. IEEE Transactions on Visualization and Computer Graphics (TVCG), Volume 20, Issue 10, October 2014, pp. 1356-1366. [pdf][demo] Direction-Changing Fall Control of Humanoid Robots: Theory and Experiments, Ambarish Goswami, Seung-kook Yun, Umashankar Nagarajan, Sung-Hee Lee, KangKang Yin, and Shivaram Kalyanakrishnan. Autonomous Robots, Volume 36, Issue 3, March 2014, pp. 199-223. [pdf] Simulation and Control of Skeleton-driven Soft Body Characters, Libin Liu, KangKang Yin, Bin Wang, Baining Guo. ACM Transac",
  "content_length": 16391,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:53"
}