{
  "name": "Kang Wook Lee 0001",
  "homepage": "https://kangwooklee.com",
  "status": "success",
  "content": "Home | Lee Lab @ UW Madison Link Search Menu Expand Document Lee Lab @ UW Madison Lee Lab @ UW MadisonResearch focus: LLMs (theoretical/empirical analysis to understand how/why they work and improve them)New PreprintsArxiv’25 / In-Context Learning with Hypothesis-Class GuidanceArxiv’25 / LLM-Lasso: A Robust Framework for Domain-Informed Feature Selection and RegularizationSelected WorkICML’25 workshop / Infected Smallville: How Disease Threat Shapes Sociality in LLM Agents / SummaryICML’25 (oral) / VersaPRM: Multi-Domain Process Reward Model via Synthetic Reasoning Data / Summary / Github / HuggingFaceICML’25 (spotlight) / Everything Everywhere All at Once: LLMs can In-Context Learn Multiple Tasks in SuperpositionICML’25 / Self-Improving Transformers Overcome Easy-to-Hard and Length Generalization ChallengesICLR’25 / Looped Transformers for Length Generalization / Summary / GithubICML’24 / Dual operating modes of ICL / Summary / GithubICLR’24 / Expressive power of LoRA / Summary / GithubICLR’24 / Teaching arithmetic to small TFs / Summary / GithubNeurIPS’22 / LIFT (Finetuning LLMs on non-textual data) / Summary / GithubSelected Talks(Mar. 2025) Helmholtz/ELLIS Workshop on Foundation Models in Science, Berlin, Germany Title: Bridging Large Language Models and Classical Machine Learning: From LIFT to LLM-Lasso for Predictive Modeling(Mar. 2025) EnCORE Workshop on Theoretical Perspective on LLMs, San Diego, CA Title: Beyond Decoder-Only Next Token Prediction (video)(Feb. 2025) ECE Grad Seminar at the University of Pittsburgh, Feb. 2025. Title: Beyond Decoder-Only Next Token Prediction(Nov. 2024) Seminars on AI Core and Applications, Seoul National University(Oct. 2024) Mathematical Principles in Foundation Models, 2024 SIAM Conference on Mathematics of Data Science Title: Dual Operating Modes of ICL(Apr. 2024) The Johns Hopkins University CIS/MINDS seminar Title: Theoretical Exploration of Foundation Model Adaptation Methods(Mar. 2024) The 58th Annual Conference on Information Sciences and Systems @ Princeton University Title: A Probabilistic Framework for Understanding In-Context Task Learning and Retrieval(Feb. 2024) 2024 Information Theory and Applications Workshop Title: The Expressive Power of Low-Rank Adaptation (LoRA)(Feb. 2024) Foundations of Data Science - Virtual Talk Series @ UCSD/NSF TRIPODS Institute on Emerging CORE Methods in Data Science (EnCORE) Title: Theoretical Exploration of Foundation Model Adaptation Methods (video)(Dec. 2023) CSP Seminar @ University of Michigan Title: Towards a Theoretical Understanding of Parameter-Efficient Fine-Tuning (and Beyond) (video)(Nov. 2023) Efficient ML workshop @ Google Research New York Title: The Expressive Power of Low-Rank Adaptation (LoRA)",
  "content_length": 2744,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:52"
}