{
  "name": "Kannappan Palaniappan",
  "homepage": "https://engineering.missouri.edu/faculty/kannappan-palaniappan",
  "status": "success",
  "content": "Kannappan Palaniappan Skip to navigation Skip to content Curators' Distinguished Professor, Professor email pal@missouri.edu phone 573-884-9266 place 205 Naka Hall Electrical Engineering and Computer Science Biography Kannappan Palaniappan is a Curators’ Distinguished Professor in electrical engineering and computer science. He has received several notable awards, including the National Academies Jefferson Science Fellowship (first in Missouri), the NASA Public Service Medal for pioneering contributions to (Big Data) scientific visualization of petabyte-sized archives, the Air Force Summer Faculty Fellowship, the Boeing Welliver Summer Faculty Fellowship, and MU’s William T. Kemper Fellowship for Teaching Excellence. At NASA’s Goddard Space Flight Center, he co-founded the Visualization and Analysis Lab that has produced a number of spectacular Digital Earth visualizations used by search engines (BlueMarble), museums, magazines and broadcast television. He is co-inventor of the Interactive Image SpreadSheet for handling large multispectral imagery, and he developed the first massively parallel semi-fluid cloud motion analysis algorithm using geostationary satellite imagery. In 2014, his team won first place at the IEEE Computer Vision and Pattern Recognition (CVPR) Change Detection Workshop video analytics challenge. In 2015, the team was a finalist in the CVPR Video Object Tracking Challenge, and in 2016, the team won the best paper award at the CVPR Automatic Traffic Surveillance Workshop and also was selected as a finalist for a best student paper award at the IEEE Engineering in Medicine and Biology Society conference (EMBC 2016). He has several U.S. patents, including one for moving object detection using the flux tensor split Gaussian model and the other for fast bundle adjustment to accurately estimate the pose of airborne camera sensor systems. Research projects have been funded by the National Institutes of Health, the Air Force Research Laboratory, the Army Research Laboratory, NASA, the National Science Foundation and others. His current, multidisciplinary interests in computer vision, high performance computing, data science and biomedical image analysis range across orders of scale from sub-cellular microscopy at the molecular level to aerial and satellite remote sensing imaging at the macro level. Education PhD from the University of Illinois MS from the University of Waterloo BS from the University of Waterloo Website: Computational Imaging and VisAnalysis Lab Google Scholar Technical Focus Biomedical image and video analysis Computer vision and remote sensing Deep learning and data visualization News Stories Affiliated News",
  "content_length": 2687,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:55"
}