{
  "name": "Kaoru Sezaki",
  "homepage": "https://www.k.u-tokyo.ac.jp/pros-e/person/kaoru_sezaki/kaoru_sezaki.htm",
  "status": "success",
  "content": "瀬崎　薫｜教授｜環境学研究系｜東京大学大学院新領域創成科学研究科 アクセス English お問合せ 寄付をお考えの⽅へ 入学を希望する方へ 在学生の方へ 修了生の方へ 企業の方へ 海外の方へ 研究科について 教育 研究 産学連携・社会連携 入試情報 国際交流 一覧へ戻る 瀬崎　薫 (せざき　かおる／教授／環境学研究系) 社会文化環境学専攻／空間環境情報学協力講座／空間情報工学研究部門 略歴 1984年3月東京大学工学部電気工学科卒業1989年3月東京大学大学院工学系研究科電気工学博士課程修了（工学博士）1989年4月東京大学生産技術研究所講師1992年7月東京大学生産技術研究所助教授1994年～2000年学術情報センター超高速画像情報処理研究部門客員助教授（併任）1996年カリフォルニア大学サンディエゴ校客員研究員2001年4月東京大学空間情報科学研究センター空間情報システム研究部門助教授2011年4月東京大学空間情報科学研究センター空間情報工学研究部門教授2013年4月～東京大学生産技術研究所 ソシオグローバル情報工学研究センター教授（兼任） 教育活動 大学院：ネットワークアーキテクチャ, アーバンコンピューティング論 研究活動 当研究室においては、ネットワークの超高速化と利用に関する技術と、その上で展開されるネットワーク応用のための諸技術の研究開発を行ってきた。　初期にはWDMネットワーク指向の光スイッチなどのノードシステムの構成法の研究を行い、任意のスイッチ段数でありながらロバスト性を確保出来る手法、波長変換素子と波長フィルタのみによる光スイッチの提案を行った。また、ネットワーク制御技術においては、光ファイバネットワークの最適化手法、WDMネットワークの波長割り当てアルゴリズムの高速化などの研究を行った。またアプリケーション技術の研究にも積極的に取り組んで来た。その一環として、五感のうち従来伝送が困難と考えられてきた触覚に着目し、触覚メディアのメディア同期、遅延制御、帯域圧縮等の諸技術を開拓し、遠隔手術等の革新的なネットワークアプリケーション開拓のための技術的な基盤を築いた。　次に、位置情報こそが今後のネットワーク技術における核となる技術であるという確信を持ち、様々な関連研究を行った。まず位置情報をネットワークの「制御」そのものに用いることを試み、アドホックネットワークにおける位置情報ルーティングの方式を開発した。一方、従来測位衛星に頼ることが多く、精度の面でもカバーするエリアの面でも不十分であった測位基盤をよりシームレスにすることの重要性を認識し、電子タグを用いた新たな測位基盤の確立のための研究を行った。 更に、21世紀に入るとネットワークを用いたセンシングに着目し、センサノードの低消費電力化のためのタイムスロット適応的予約やノードにモビリティがありネットワークトポロジーが随時変動するとネットワーク上で通信・センシングを可能とするために、すれ違い通信を利用して情報を必要な領域にマルチキャストする手法や、移動可能なロボットを用いて広大な地域を短時間でセンシングする手法の開発を行った。 また、最近では携帯端末の高度化・低廉化に伴いこれらをセンサとするユーザ参加型センシングの技術の開発を行うと共に、その応用であるeHealth、サイバーフィジカルシステムへの応用研究に注力している他、街並みのデジタルアーカイブ化などにも取り組んでいる。これらの研究成果は都市の所様相を把握・制御することに直結する技術である。 文献 1.Shunsuke Aoki and Kaoru Sezaki, ''Negative Surveys with Randomized Response Techniques for Privacy-aware Participatory Sensing'', IEICE Transactions on Communications, Vol. E97-B, No. 04, 2014.2. S. Han, S. Han、K. Sezaki: \" Development of an Optimal Vehicle-to-Grid Aggregator for Frequency Regulation \", IEEE Transaction on Smart Grid, Vol. 1, no. 1, pp. 65-72 (2010).3. H. Chen, Q. Shi, R. Tan、 H. V. Poor and K. Sezaki: “Mobile element assisted cooperative localization for wireless sensor networks with obstacles”, IEEE Transaction on Wireless Communications, Vol. 9, no. 3, pp. 956-965 (2010). 4. 引地謙治、 森野祐直、 福田一郎、 松本壮樹、 瀬崎　薫、 安田靖彦:” 触覚を含む仮想空間共有システムの提案と評価”, 電子情報通信学会論文誌, J86-B-1, 2, pp. 268-278, (2003). 5. 長田武士, 瀬崎薫, 安田靖彦: ” 波長分割多重光スイッチングネットワークの構成法”、 電子情報通信学会論文誌, J80-B-1, 3, pp. 130-137, (1997). その他 IEEE COMSOC eHealth committee steering memberJournal on Semantic Computing editor画像電子学会（編集委員)GIS学会（代議員) 将来計画 本研究室の基盤は情報通信技術であるが、センサやSNS等様々なデータを分析することは都市の現在の様相を把握するだけでなく、精緻な将来予測都市計画などdecision makingに有効である。このような視点から異分野融合研究の展開を行う。 教員からのメッセージ 大学院時代は、出来る限り研究の「深さ」を追求したオリジナルティのある研究を行うことを心がけてください。研究成果そのものを後で直接生かすことが出来なくても、深さを追求した経験が必ず役立つときがあります。同時に、研究者としての「視野を広げる」ことも追求して下さい。この２つの能力を身に着けることが、技術や研究の動向が劇的に変化しつつある状況においても、独創性の高い研究を継続し続けることの出来る「研究者としての基礎体力」を養うことに他ならなります。 ホームページのURL https://www.mcl.iis.u-tokyo.ac.jp/ 教員検索トップへ戻る",
  "content_length": 2812,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:55"
}