{
  "name": "Kapil Ahuja",
  "homepage": "http://www.iiti.ac.in/~kahuja",
  "status": "success",
  "content": "ï»¿ MODSS Lab Home Background Recognition Research International Service Group Mathematics of Data Science and Simulation Lab Professor In-Charge: Kapil Ahuja, Ph.D. Professor Computer Science & Engineering Khandwa Road, Simrol IIT Indore, MP 453552, INDIA Tel: +91-731-660-3158 Email: kahuja at iiti dot ac dot in Research Interests and IDs: Machine Learning, Network Science, Computational Optimization, and Numerical Linear Algebra. Google Scholar ORCID Codes at GitHub Lectures at YouTube Math Genealogy Recent News: • Joint paper of Mr. Amit Raj and Prof. Ahuja on AI for optimizing drone path accepted in Robotics and Autonomous Systems (Elsevier Journal), Jan 2025. • Mr. Priyanshu Singh submitted his M.S. (Research) Thesis, Jan 2025. • Prof. Ahuja appointed Associate Editor for Applied Intelligence Journal (Springer Nature), October 2024. • Mr. Amit Raj successfully defended his M.S. (Research) Thesis, October 2024. • Prof. Ahuja wins The National Teacher Award conferred by The President of India, September 2024. • Prof. Ahuja wins Best Teacher Award at IIT Indore for 5th time, August 2024. • Mr. Mithun Singh defended his M.S. (Research) Thesis, July 2024. • Prof. Ahuja invited for a research talk at Oakridge National Lab, June 2024. Brief Bio After completing a double Masterâs plus a Ph.D. from Virginia Tech (USA), I did a postdoc from the Max Planck Institute in Magdeburg (Germany). Subsequently, I worked as an Assistant Professor and an Associate Professor in Computer Science and Engineering (CSE) at IIT Indore, where I am currently holding a Full Professor position. Recently, I have also been a Visiting Professor at UT Austin (USA), IMT Atlantique (France), Sandia National Labs (USA), TU Dresden (Germany), and TU Braunschweig (Germany). I head the Mathematics of Data Science and Simulation (MODSS) research lab at IIT Indore, with research interests in Machine Learning, Economics of Networks, Numerical Linear Algebra, and Optimization. My current emphasis is on machine learning algorithms for plant and cancer studies; game theoretic approaches to poverty reduction; data-driven linear solvers & model reducing algorithms for climate modelling on exascale machines; and IoT & drone trajectory optimizations. My research output includes external funding worth 4.85 Crores INR (580,000 USD) and forty-one publications. While achieving this, I have graduated 5 Ph.D. students, 4 M.S. (Research) students, and 75 B.Tech. students. On the teaching end, I have taught fourteen distinct courses and have received the Best Teacher Award 5-times at IIT Indore also I have won National Teacher Award conferred by The President of India. As a service to the academic community, I am on the editorial board of two reputed journals, have organized fifteen conferences/ workshops/ schools/ symposia, and have reviewed papers from thirty-five sources (journals / conferences/ institutes/ funders). I have substantially contributed to the growth of the institutions that I have been associated with by holding multiple administrative positions. Besides heading Computer Science and Engineering at IIT Indore in the past, my biggest administrative contribution most recently has been in increasing IIT Indoreâs international footprint as the founding Dean of International Affairs. Copyright Â© 2025 Kapil Ahuja Site Last Updated: January 2025",
  "content_length": 3367,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:00"
}