{
  "name": "Karan Singh",
  "homepage": "http://www.dgp.toronto.edu/~karan",
  "status": "success",
  "content": "Karan Sher Singh, University of Toronto Research Publications Art+Animation Teaching Students Industry Rambles Karan Singh Professor email:karan[at]dgp.toronto.edu voice: (416) 978-7201 fax: (416) 978-4765 office: Room BA5258, Bahen Center lab: Dynamic Graphics Project postal mailing address: Karan Singh, Computer Science, Univ. of Toronto, 40 St. George Street, Toronto, Ontario, Canada M5S 2E4. ...my research combining graphics, HCI and AI, seeks mathematical formulations of artistic and perceptual insight, to build tools for creative minds. my interests span art and visual perception, geometric and anatomic modeling, facial and character animation, sketch-based techniques and interfaces for mobile/XR. Research Themes Sketch and Sculpt Interfaces Often called natural approaches to interactive design, inherent limitations in human motor control, artistic skill,  perceptual bias, and  ambiguities of inference,  make it challenging to design sketch/sculpt interfaces. Over the past decade our research has produced a number of notable systems ilovesketch, meshmixer, crossshade, true2form, neobarok, flatfab, and cassie. Interactive Character Animation (INCA) Character setup leaves an animator unencumbered, like a puppeteer, to focus on the formidable task of bringing a character to life. I designed and developed character and facial animation tools for Maya 1.0, and animated films of long time collaborator Chris Landreth. I focus is on the most expressive parts of our anatomy: face and hands. Our start-up JALI Research has been used to drive the facial animation in Cyberpunk 2077 and other AAA games. At Weta Digital, we developed a new digital representation for the face based on its musculoskeletal anatomy, for the VFX Oscar winning film Avatar: the way of water. Mathematical Surface Representations for Conceptual Design From 2003-2012 (the duration of the MITACS NCE), I led a project on the mathematics of shape representation that produced over 100 publications, numerous best paper and technology transfer awards. Artistic Projection and Rendering My interest in this area is to use non-photo realism as a tool for self-expression, as a visual manifestation of Nin's observation \"we dont see things as they are, we see them as we are\". Transcendent Reality In 1994 I was fortunate to work on the first virtual space tele-conferencing system (left) at ATR during my PhD in 1994. My interests in AR/VR today go beyond an augmented world, to one where reality is subtracted, transformed, or more generally transcended. The open source browser JanusXR is a step in that direction. Copyright © 2006 Karan Singh, All Rights Reserved. visitors.",
  "content_length": 2671,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:58"
}