{
  "name": "Karen Yeung",
  "homepage": "https://www.birmingham.ac.uk/staff/profiles/law/yeung-karen.aspx",
  "status": "success",
  "content": "Professor Karen Yeung - Birmingham Law School - University of Birmingham Professor Karen Yeung Birmingham Law SchoolInterdisciplinary Professorial Fellow in Law, Ethics and Informatics Contact details Telephone+44 (0) 121 414 6298Emailk.yeung@bham.ac.uk View my research portal AddressBirmingham Law SchoolUniversity of Birmingham Edgbaston Birmingham B15 2TT UK Karen Yeung joined Birmingham Law School and the University of Birmingham’s School of Computer Science as Interdisciplinary Professorial Fellow in Law, Ethics and Informatics in January 2018. Her research has been at the forefront of understanding the challenges associated with the regulation and governance of emerging technologies.  Over the course of more than 25 years, she has developed unique expertise in the regulation and governance of, and through, new and emerging technologies.  Her ongoing work focuses on the legal, ethical, social and democratic implications of a suite of technologies associated with automation and the ‘computational turn’, including big data analytics, artificial intelligence (including various forms of machine learning), distributed ledger technologies (including blockchain) and robotics. For more information, see https://karenyeung.me/ Staff detailsMedia informationPolicy information Doctor of Philosophy in Law (D Phil), Oxford University Bachelor of Civil Law (BCL), Oxford University Bachelor of Laws (LLB (Hons)), The University of Melbourne, Australia. Bachelor of Commerce (BComm), The University of Melbourne, Australia Admitted to practice as a Barrister & Solicitor of the Supreme Court of Victoria, Australia. Karen came to the United Kingdom from Australia in 1993 as a Rhodes Scholar to read for the Bachelor of Civil Law at Oxford University, after completing a combined Law/Commerce degree at the University of Melbourne. She spent ten years as a University Lecturer at Oxford University and as a Fellow of St Anne’s College, where she wrote her D Phil, before taking up a Chair in Law at King’s College London in September 2006 to help establish the Centre for Technology, Law & Society (‘TELOS’), occupying the role of Director since 2012 until the end of 2017. Karen welcomes proposals interested in critically examining the legal, democratic and ethical dimensions of a suite of technologies associated with networked computational systems, including big data analytics, artificial intelligence (including various forms of machine learning), distributed ledgers (including blockchain) and robotics. Professor Yeung is open to considering PhD students with an outstanding academic record and strong research proposals. She reviews requests to consider PhD supervision on a quarterly basis. Please contact Marianne Meyer via email on PA-IPFLawandEthics@contacts.bham.ac.uk for information concerning forthcoming deadlines for requests and supporting documentation. Find out more - our PhD Law  page has information about doctoral research at the University of Birmingham. Karen’s research expertise lies in the regulation and governance of, and through, new and emerging technologies.  Her work has been at the forefront of nurturing ‘law, regulation and technology’ as a sub-field of legal and interdisciplinary scholarship. Karen’s recent and ongoing work focuses on the legal, ethical, social and democratic implications of a suite of technologies associated with automation and the ‘computational turn’, including big data analytics, artificial intelligence (including various forms of machine learning), distributed ledger technologies (including blockchain) and robotics. The overarching aim of her research is to enrich our understanding of the capacity and potential of these technologies to inform decision-making and to influence and co-ordinate individual and collective behaviour across a wide range of policy domains through the broad lenses of ‘Algorithmic Regulation’ and ‘Algorithmic Accountability’. She is currently undertaking series of inquiries which, taken together, seek to explore their implications for normative values associated with liberal constitutional democracies, including: democracy and democratic governance, including the need for public participation in their design, construction and implementation, and the value weightings and trade-offs that are hard-wired into system development and operation;constitutional values, including transparency, accountability, due process, proportionality and the rule of law;individual rights, freedom, autonomy and human dignity;equality, community, social solidarity and distributive justice; andthe allocation of decision-making authority, responsibility and liability between humans and machines. In pursuing these aims, Karen draws upon a broad range of disciplinary perspectives from the humanities, social sciences (and increasingly, the computer sciences), including law, applied ethics (professional ethics, bioethics, information ethics, machine ethics and robot ethics), political theory, political science, regulatory governance studies, the philosophy of technology, the sociology of science (including STS and innovation studies) and criminology. Her most recent work has involved collaborations with AI researchers and data and computer scientists and she has recently been awarded a Wellcome Trust Seed Award in the Social Sciences to lead an interdisciplinary project which seeks to map the legal, ethical, technical and governance challenges associated with regulating healthcare through blockchain. Highlight publications Yeung, K & Lodge, M (eds) 2019, Algorithmic Regulation. Oxford University Press. Yeung, K 2019, 'Regulation by blockchain: the emerging battle for supremacy between the code of law and code as law', Modern Law Review, vol. 82, no. 2, pp. 207-239. https://doi.org/10.1111/1468-2230.12399 Yeung, K 2018, 'Algorithmic regulation: a critical interrogation', Regulation & Governance, vol. 12, no. 4, pp. 505-523. https://doi.org/10.1111/rego.12158 Yeung, K 2016, 'Hypernudge: Big Data as a mode of regulation by design', Information, Communication and Society, vol. 20, no. 1, pp. 118-136. https://doi.org/10.1080/1369118X.2016.1186713 Yeung, K, Howes, A & Pogrebna, G 2020, AI Governance by Human Rights Centred-Design, Deliberation and Oversight: An End to Ethics Washing. in The Oxford Handbook of Ethics of AI. Oxford University Press. Recent publications Book Yeung, K & Ranchordás, S 2024, An Introduction to Law and Regulation: Text and Materials. Law in Context, 2nd Edition edn, Cambridge University Press, Cambridge. https://doi.org/10.1017/9781009379007 Article Yeung, K 2025, 'Defending the Rule of Law from Threats Posed by AI Enabled Surveillance Systems in the Hands of Law Enforcement Authorities', The European Review of Digital Administration & Law (ERDAL), vol. 6, no. 1, pp. 183-193. https://doi.org/10.53136/979122182111619 Yeung, K & Li, W 2025, 'From ‘wild west’ to ‘responsible’ AI testing ‘in-the-wild’: Lessons from Live Facial Recognition Testing by Law Enforcement Authorities in Europe', Data & Policy, vol. 7, e59. https://doi.org/10.1017/dap.2025.10019 Wenzelburger, G, Yeung, K & Hartmann, K 2025, 'Smart Justice? Making sense of the rise of algorithm-based pre-trial risk assessment in criminal justice through ‘legal models’', Digital Society, vol. 4, no. 2, 48. https://doi.org/10.1007/s44206-025-00194-7 Yeung, K 2024, 'Beyond ‘AI boosterism’', IPPR Progressive Review, vol. 31, no. 2, pp. 114 - 120. https://doi.org/10.1111/newe.12400 Yeung, K & Harkens, A 2023, 'How do \"technical\" design choices made when building algorithmic decision-making tools for criminal justice authorities create constitutional dangers? (Part I)', Public Law, vol. 2023, no. Apr, pp. 265-286. <https://uk.westlaw.com/Document/I6423CB50BE7211ED9B49D222A61966AB/View/FullText.html> Yeung, K & Harkens, A 2023, 'How do ‘technical’ design-choices made when building algorithmic decision-making tools for criminal justice authorities create constitutional dangers? Part II', Public Law, no. Jul, pp. 448-472. <https://uk.westlaw.com/Document/I3AF53F4004CA11EEAEE6B640426E812F/View/FullText.html> Yeung, K 2023, 'The New Public Analytics as an Emerging Paradigm in Public Sector Administration', Tilburg Law Review, vol. 27, no. 2, pp. 1–32. https://doi.org/10.5334/tilr.303 Ulbricht, L & Yeung, K 2021, 'Algorithmic regulation: a maturing concept for investigating regulation of and through algorithms', Regulation & Governance. https://doi.org/10.1111/rego.12437 Yeung, K & Lee A, B 2021, 'Demystifying the modernized European data protection regime: cross-disciplinary insights from legal and regulatory governance scholarship', Regulation & Governance. https://doi.org/10.1111/rego.12401 Chapter Smuha, N & Yeung, K 2025, The European Union's AI Act: Beyond Motherhood and Apple Pie? in NA Smuha (ed.), The Cambridge Handbook of the Law, Ethics, Policy and Artificial Intelligence. Cambridge University Press, pp. 228-258. https://doi.org/10.1017/9781009367783.015 Yeung, K 2023, Lost in translation: the troubling logics underpinning the embrace of governmental machine-learning based prediction tools for ‘citizen scoring’ . in D Van Den Meerssche, G Sullivan & F Johns (eds), Global Governance by Data : Infrastructures of Algorithmic Rule. Cambridge University Press. Other Yeung, K 2022, 'Constitutional principles in a networked digital society', The Impact of Digitization on Constitutional Law, Copenhagen, Denmark, 31/01/22 - 1/02/22. https://doi.org/10.2139/ssrn.4049141 Other contribution Damen, W, Harkens, A, Li, W, Ahmed-Rengers, E & Yeung, K 2021, Data protection in post-Brexit Britain: a response to the government of the United Kingdom’s public consultation on reforms to the data protection regime (“Data: A new direction”). SocArXiv. https://doi.org/10.31235/osf.io/uszqp Smuha, N, Ahmed-Rengers, E, Harkens, A, Li, W, Maclaren, J, Piselli, R & Yeung, K 2021, How the EU can achieve legally trustworthy AI: a response to the European C",
  "content_length": 10784,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:06"
}