{
  "name": "Karen L. Karavanic",
  "homepage": "http://web.cecs.pdx.edu/~karavan",
  "status": "success",
  "content": "Karen L. Karavanic, Ph.D. Professor Computer Science Department Portland State University Maseeh College of Engineering and Computer Science How to Reach Me Research Teaching Recent Professional Service What Fuels Me? An ACM video on why Federal funding for research is so critical to our nation Computational Science for wildfire prediction Eighteen Zeros , A short film describing the push towards Exascale Computing Mission Accomplished! Summit supercomputer simulations identifying approaches for SARS-CoV-2 coronavirus drug design I hold a B.A. in Computer Science from New York University, and an M.S. and Ph.D. in Computer Science from the University of Wisconsin - Madison. At Wisconsin I worked with the Paradyn Performance Tools Group under the direction of Prof. Barton Miller; I was the recipient of a Wisconsin Foundation Fellowship and a NASA GSRP Fellowship. My research is in diagnosing and characterizing the runtime performance of large-scale systems and applications. This includes power, cooling, and security as well as more traditional aspects such as execution time. My particular focus is on a holistic view that includes performance factors external to the application under study, such as resource contention, power constraints, OS interference, and the overhead of security mechanisms. We are currently developing performance diagnosis techniques for a common type of HPC applications called Holistic HPC Workflows. These are applications comprising multiple separable codes, possibly run on different platforms, that have not been developed within a workflow management environment. We are also currently focused on continuous security monitoring for large-scale commercial server environments such as clouds. I have collaborated with scientists at Lawrence Livermore National Laboratory, Pacific Northwest National Laboratory, San Diego Supercomputer Center, and New Mexico Consortium. I have taught graduate and undergraduate courses in operating systems; Introduction to Security; Introduction to Performance Measurement, Modeling and Analysis; and Accelerated (GPU) Computing. I have been mostly off campus for 3 years serving the nation as a Program Director in the CISE/CNS Division of the National Science Foundation. I am teaching CS 533 Concepts of Operating Systems in Winter 2026. \"A ship in port is safe, but that is not what ships are for. Sail out to sea and do new things.\" -- Admiral Grace Hopper, Computer Pioneer",
  "content_length": 2458,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:01"
}