{
  "name": "Karen Renaud",
  "homepage": "https://karenrenaud.com",
  "status": "success",
  "content": "Dr Karen Renaud - Human-Centred Security Skip to content Watch Video Short Video on Paper he mentioned Link to paper I was honoured to present one of the Karen Spärck Jones lectures organised by the BCS on the 30th March 2022 Top 2% of influential researchers in the world Project launched: Revealing Young Learners’ Mental Models of Online Sludge Revealing Young Learners’ Mental Models of Online Sludge – SpriteHub CFP: Understanding People: Extensions of Human Computer Interaction (Cambridge University Press) Participated in ACSAC Panel with Merrill Warkentin Slides 21 February 2023: Interviewed for Cyber Ways Podcast by Craig van Slyke and Tom Stafford Participated in The Marconi Society Panel VISTA Poster Grants 2023: Co-I: 92K SELF-PROTECT (REPHRAIN) with Paul van Schaik (Teeside University) and Alastair Irons (Abertay). External advisor: Craig van Slyke 2022: Co-I: 92K Well-Consent (REPHRAIN) with Paul van Schaik (Teeside University) 2022: Co-I: £3.4 million REPHRAIN Project: Adaptive PETs to Protect & emPower People during Life Transitions led by Prof Nishanth Sastry of University of Surrey. 2022: P-I: 30K NCSC Grant: Investigating Safety and Security Practices of those with Low Literacy 2021: P-I: 30K SPRITE Funded Grant: Revealing Young Learners’ Mental Models of Online Sludge 2020: P-I: 50K Scottish Government Grant: MUSTER: Moving bUsinesSes Towards cybEr Resilience 2020: P-I: 30K Cyber Nexus Grant: Teaching young children password best practice principles SICSA Cyber Security Theme Leader Full Member of the Chartered Institute of Information Security Member of CYAN (Cybersecurity Advisors Network) My ACM Profile My research focuses on human-centred security, a branch of Human Computer Interaction (HCI). I am interested in the interplay between users and security in the context of societal and industrial use. I want to work towards creating a natural easy yet secure interaction between humans and devices. My work has a strong development, experimental and deployment focus, testing solutions in practical situations. I have come up with a number of novel solutions to improve usability in a wide range of situations. I have also done fundamental work in understanding people’s mental models of security in a variety of applications and contexts. My vision: Human-as-Solution, rather than Human-as-Problem. Written by Ganna Pogrebna Strathclyde University, Glasgow, ScotlandVisiting Professor, Rhodes University Professor Extraordinaire, University of South Africa Honorary Research Affiliate, University of GlasgowFulbright Cyber Security Scholar 2016/17. Senior Analyst, Global Foundation for Cyber Studies and Research Associate Editor:Transactions on Forensics and SecurityIJHCSNetwork Security ColumnInformation Technology and PeopleJournal of Intellectual Capital Organizational Cyber Security Royal Academy of Engineering Industrial Secondment AwardeeAssociation of Commonwealth Universities PhD Scholarship AwardeeCouncil for Scientific and Industrial Research (RSA) Undergraduate Scholarship Awardee Research Areas Human-Centred SecurityResponsibilization of Cyber SecurityBehavioural Security & NudgingEthical Aspects of Cyber SecuritySecurity-Related Mental Models Teaching Children Cyber Security PrinciplesMobile Phone Usage by the ElderlyKnowledge VisualizationVisual AuthenticationSecurity AwarenessGovernance Here are some photos of my fantastic research collaborators Melanie VolkamerKarlsruhe UniversityMerrill WarkentinMississippi State UniversityJudy Van BiljonUNISAMarc DupuisWashington University . Verena ZimmermanETH ZurichStephen FlowerdayTulsaMilena DobrevaStrathclydeSuzy PriorAbertay Karl van der Schyff Rosalind SearleUNISA Paul van SchaikTeeside University Craig Van SlykeLouisiana Tech University Luca ViganoUCL Ivano BongiovanniQueensland University of Technology Craig Orgeron Partha Das Chowdhury Industrial Experience Iron and Steel Corporation of South Africa – Development of a Truck Allocation System for the Sishen Iron Ore Mine Iron and Steel Corporation of South Africa – Access Control System for Durnacol Coal Mine System Support: Kentron FulbrightFulbright Scholars 2016/17 © Leo Johnson Contact Me Department of Computer and Information SciencesStrathclyde UniversityGlasgowG1 1XQUNITED KINGDOM cyber4humans@gmail.com Scroll Up Top",
  "content_length": 4317,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:11"
}