{
  "name": "Karen A. Panetta",
  "homepage": "https://engineering.tufts.edu/cs/people/faculty/karen-panetta",
  "status": "success",
  "content": "Karen Panetta | Department of Computer Science Personal website Google Scholar Publons Scopus Karen Panetta Professor, Electrical and Computer Engineering Professor, Academic Services Professor, Computer Science Dean of Graduate Education, Tufts University School of Engineering Professor, Mechanical Engineering Distinguished Professor, Tufts University School of Engineering (617) 627-5976 karen.panetta@tufts.edu 171 College Avenue Personal website Google Scholar Publons Scopus Research/Areas of Interest Signal processing; image processing; simulation modeling Education Ph.D., Northeastern University, Boston, United StatesM.S., Northeastern University, Boston, United StatesB.S., Boston University, Boston, United States Biography Karen Panetta received a B.S. in Computer Engineering from Boston University, and a M.S. and Ph.D. in Electrical Engineering from Northeastern University. As the first female electrical engineer to be given tenure in the Electrical and Computer Engineering department, Panetta continues to promote the interests of women in her field. From 2007 to 2009, she was the worldwide director for IEEE Women in Engineering, the largest international professional organization dedicated to promoting women engineers and scientists, and she served as editor-in-chief of the IEEE Women in Engineering magazine. She is the faculty adviser to the Tufts student chapters of both the Society of Women Engineers and the IEEE, and is founder of the nationally acclaimed Nerd Girls program, which promotes engineering disciplines to young students. She is a fellow of the National Academy of Inventors, the European Academy of Sciences and the Arts, the Asia-Pacific Artificial Intelligence Association, the American Institute of Aeronautics and Astronautics, and the Institute of Electrical and Electronics Engineers (IEEE) and was awarded the 2013 IEEE Award for Distinguished Ethical Practices for exemplary contributions and leadership in developing ethics and social responsibility in students. She has received several NASA and National Science Foundation research grants, including the NSF CAREER Award. In 2011, President Barack Obama awarded Panetta the Presidential Award for Science and Engineering Education and Mentoring. In 2023, she was inducted as a member of the National Academy of Engineering.Karen Panetta's research focuses on developing efficient algorithms for simulation, modeling, and signal and image processing for security and biomedical applications.",
  "content_length": 2499,
  "method": "requests",
  "crawl_time": "2025-12-01 13:39:59"
}