{
  "name": "Karim Pichara",
  "homepage": "https://www.ing.uc.cl/academicos-e-investigadores/karim-elias-pichara-baksai",
  "status": "success",
  "content": "Karim Elías Pichara Baksai | Ingeniería UC Inicio Nuestra Escuela Sobre Ingeniería UC Internacionalización Retribuye Proyecto Ingeniería 2030 Código de Honor Consejo Asesor Autoridades y equipos Programas de Estudio Admisión Pregrado Postgrado Educación Profesional Acreditaciones Académicos e Investigación Académicos Ingeniería UC Publicaciones Investigación en pregrado Proyectos de investigación Concursos postdoctorales Libro de Investigación Divulgación Científica y Tecnológica Innovación y Emprendimiento Ecosistema de emprendimiento Formación académica Programas extracurriculares Emprendimiento Social Apoyo al emprendimiento Alumnos emprendedores Vida Universitaria Deporte Cultura Centro de Alumnos de Ingeniería Proyectos de Alumnos Mujeres Ingeniería UC Cuerpo de Tutores Pastoral Vinculación con el Medio Transferencia Alumni Ingeniería UC Preingeniería Atracción y desarrollo de talento Plataforma de Colocaciones Responsabilidad Social Oficina de Vinculación con la Industria Contacto Departamentos y áreas académicas SIDING English Home » Académicos e Investigadores » Karim Elías Pichara Baksai Académicos Ingeniería UC Karim Pichara Profesor Asociado Especialidad: Machine Learning, Data Mining, Astro Statistics, Astro Informatics, Data Science Departamento de Ciencia de la Computación kpichara@uc.cl +562 2354 7697 Líneas de Investigación Publicaciones Educación Noticias Relacionadas Líneas de Investigación Machine Learning, Data Mining, Astro Statistics, Astro Informatics, Data Science Publicaciones Astudillo J., Protopapas P., Pichara K., Becker I. (2023) A Reinforcement Learning-Based Follow-up Framework ASTRONOMICAL JOURNAL 165 3 San-Martin-Jimenez A., Pichara K., Barrientos L., Rojas F., Moya-Sierralta C. (2023) Depthwise convolutional neural network for multiband automatic quasars classification in ATLAS MONTHLY NOTICES OF THE ROYAL ASTRONOMICAL SOCIETY 524 4 5080-5095 Salinas H., Pichara K., Brahm R., Perez-Galarce F., Mery D. (2023) Distinguishing a planetary transit from false positives: a Transformer-based classification for planetary transit signals MONTHLY NOTICES OF THE ROYAL ASTRONOMICAL SOCIETY 522 3 3201-3216 Pérez F., Pichara K., Huijse P., Catelan M., Mery D. (2021) Informative Bayesian model selection for RR Lyrae star classifiers Monthly Notices of the Royal Astronomical Society 503 1 484497 Rojas F., Maurin L., Dünner R., Pichara K. (2020) Classifying CMB time-ordered data through deep neural networks Monthly Notices of the Royal Astronomical Society 494 3 37413749 Becker I., Pichara K., Catelan M., Protopapas P., Aguirre C., Nikzat F. (2020) Scalable End-to-End Recurrent Neural Network for Variable Star Classification Monthly Notices of the Royal Astronomical Society 493 2 2981-2995 Zorich L., Pichara K., Protopapas P. (2020) Streaming classification of variable stars Monthly Notices of the Royal Astronomical Society 492 2 2897-2909 Ferreira Lopez C.E.,  Cross N.J.G.,  Catelan M.,  Minniti D.,  Hempel M.,  Lucas P.W.,  Angeloni R.,  Jablonsky F.,  Braga V.F., Leão I.C.,   (2020) The VISTA Variables in the Vía Láctea infrared variability catalogue (VIVA-I) Monthly Notices of the Royal Astronomical Society 496 2 1730-1756 Saldias-Fuentes, B., Protopapas, P., & Pichara, K. (2019, May). A Full Probabilistic Model for Yes/No Type Crowdsourcing in Multi-Class Classification. Proceedings of the 2019 SIAM International Conference on Data Mining (SDM) (pp. 756-764). SIAM. (2019) A Full Probabilistic Model for Yes/No Type Crowdsourcing in Multi-Class Classification Proceedings of the 2019 SIAM International Conference on Data Mining (SDM) 756-764 Pieringer C., Pichara K., Catelán M., Protopapas P. (2019) An Algorithm for the Visualization of Relevant Patterns in Astronomical Light Curves Monthly Notices of the Royal Astronomical Society 484 3 30713077 Astudillo J., Protopapas P., Pichara K., Hujise P. (2019) An Information Theory Approach on Deciding Spectroscopic Follow Ups Astronomical Journal 159 1 1-14 Aguirre C., Pichara K. and Becker I. (2019) Deep multi-survey classification of variable stars Monthly Notices of the Royal Astronomical Society 482 4 50785092 Sandoval A., González C., Alarcón R., Pichara K. and Montenegro M. (2018) Centralized student performance prediction in large courses based on low-cost variables in an institutional context Internet and Higher Education 37 76-89 Castro N., Protopapas P. and Pichara K. (2018) Uncertain Classification of Variable Stars: Handling Observational GAPS and Noise Astronomical Journal 155 1 15pp Peralta M., Alarcón R., Pichara K., Mery T., Bozo J. and Cano F. (2018) Understanding Learning Resources Metadata for Primary and Secondary Education IEEE Transactions on Learning Technologies 11 4 456-467 Valenzuela L. and Pichara K. (2018) Unsupervised Classification of Variable Stars Monthly Notices of the Royal Astronomical Society 474 3 32593272 Benavente P., Protopapas P. and Pichara K. (2017) Automatic Survey-invariant Classification of Variable Stars Astrophysical Journal 845 2 84-92 Mackenzie C., Pichara K. and Protopapas P. (2016) CLUSTERING-BASED FEATURE LEARNING ON VARIABLE STARS Astrophysical Journal 820 2 15pp Pichara K., Protopapas P. and León D. (2016) META-CLASSIFICATION FOR VARIABLE STARS Astrophysical Journal 819 1 11pp Carrasco D., Barrientos L.F., Pichara K., Anguita T., Murphy D.N.A., Gilbank D.G., Gladders M.D., Yee H.K.C., Hsieh B.C. and López S. (2015) Photometric classification of quasars from RCS-2 using Random Forest Astronomy & Astrophysics 584 A44 17pp @proceeding{doi:10.1117/12.2055579, author = {Gregorio, RodrigoSolar, MauricioMardones, DiegoPichara, KarimParada, VictorContreras, Ricardo}, title = {Automatic detectionautomatic classification of structures in astronomical images}, journal = {Proc. SPIE}, volume = {9152}, number = {}, pages = {91522R-91522R-7}, abstract = {The study of the astronomical structures is important to the astronomical community because it can help to identify objects, which can be classified based on their internal structure or their relation to other objects. For this reason, it is developed an automated tool to analyze astronomical images into its components. Firstly, a 2D images is decomposed into different spatial scales based on wavelet transform. Then, it is implemented a detection algorithms to each spatial scale, such as Clumpfind, Gaussclump, or Dendrogram techniques. The goal is to build a new algorithmtool that is available to the community and satisfies the requirements of the next Chilean Virtual Observatory (ChiVO).}, year = {2014}, doi = {10.1117/12.2055579}, URL = { http://dx.doi.org/10.1117/12.2055579}, eprint = {}} (2014) Automatic detection and automatic classification of structures in astronomical images Proceedings SPIE 9152 @proceeding{doi:10.1117/12.2056766, author = {Solar, MauricioFari√±a, WalterMardones, DiegoAntognini, JonathanPichara, KarimNagar, NeilParada, VictorIbsen, JorgeNyman, LarsMarroquin, Jos√©}, title = {Chilean virtual observatoryintegration with ALMA}, journal = {Proc. SPIE}, volume = {9150}, number = {}, pages = {91501O-91501O-10}, abstract = {The Virtual Observatories strive to interoperate, exchange datashare services as if it was only one big VO. In this work, the state of the art of VOs will be presentedsummarized in a schematic diagram with the frequency range of the observed data that every VO publishes. Chile, currently a member of the IVOA, collaborates with the Atacama Large Millimeter/submillimeter Array (ALMA), to study and propose ways to adequate the data generated by ALMA to thedifferent data model proposed by the IVOA.}, year = {2014}, doi = {10.1117/12.2056766}, URL = { http://dx.doi.org/10.1117/12.2056766}, eprint = {}} (2014) Chilean virtual observatory and integration with ALMA Proceedings SPIE 9150 Pichara K. and Soto A. (2014) Local feature selection using gaussian process regression Intelligent Data Analysis Num I., Pichara K., Protopapas P. and Kim D-W. (2014) SUPERVISED DETECTION OF ANOMALOUS LIGHTCURVES IN MASSIVE ASTRONOMICAL CATALOGS Astrophysical Journal 793 1 16pp Angeloni R., Contreras Ramos R., Catelan M., DéKány I., Gran F., Alonso-García J., Hempel M., Navarrete C., Andrews H., Aparicio A., Beamín J.C., Berger C., Borissova J., Contreras Peña C., Cunial A., de Grijs R., Espinoza N., Eyheramendy S., Ferreira Lop (2014) The VVV Templates Project Towards an automated classification of VVV light-curves. I. Building a database of stellar variability in the near-infrared Astronomy & Astrophysics 567 100 11pp Pichara K. and Protopapas P. (2013) Automatic classification of variable stars in catalogs with missing data Astrophysical Journal 777 2 Pichara K., Protopapas P., Kim D.W., Marquette J.B. and Tisserand P. (2012) An improved quasar detection method in EROS-2 and MACHO LMC data sets. http://dx.doi.org/10.1111/j.1365-2966.2012.22061.x Monthly Notices of the Royal Astronomical Society 427 2 12841297 @INPROCEEDINGS{2011rrls.conf..145C, author = {{Catelan}, M.{Minniti}, D.{Lucas}, P.~W.{Alonso-Garc{'{i}}a}, J.{Angeloni}, R.{Beam{'{i}}n}, J.~C.{Bonatto}, C.{Borissova}, J.{Contreras}, C.{Cross}, N.{D{'e}k{'a}any}, I.{Emerson}, J.~P.{Eyheramendy}, S.{Geisler}, D.{Gonz{'a}lez-Solares}, E.{Helminiak}, K.~G.{Hempel}, M.{Irwin}, M.~J.{Ivanov}, V.~D.{Jord{'a}n}, A.{Kerins}, E.{Kurtev}, R.{Mauro}, F.{Moni Bidin}, C.{Navarrete}, C.{P{'e}rez}, P.{Pichara}, K.{Read}, M.{Rejkuba}, M.{Saito}, R.~K.{Sale}, S.~E.{Toledo}, I.}, title = \"{The Vista Variables in the V{'{i}}a L{'a}ctea (VVV) ESO Public Survey: Current StatusFirst Results}\", booktitle = {RR Lyrae Stars, Metal-Poor Stars, and the Galaxy}, year = 2011, archivePrefix = \"arXiv\", eprint = {1105.1119}, primaryClass = \"astro-ph.GA\", editor = {{McWilliam}, A.}, month = aug, pages = {145}, adsurl = {http://adsabs.harvard.edu/abs/2011rrls.conf..145C}, adsnote = {Provided by the SAO/NASA Astrophysics Data System}} (2012) The Vista Variables in the Via Lactea (VVV) ESO Public Survey: Current ",
  "content_length": 11129,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:13"
}