{
  "name": "Karianne J. Bergen",
  "homepage": "https://www.kariannebergen.com",
  "status": "success",
  "content": "Karianne BergenSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcome to Karianne's Website!I am an Assistant Professor of Data Science and Earth, Environmental & Planetary Sciences and Assistant Professor of Computer Science at Brown University.  My research interest is in scientific machine learning  (SciML).  My past work has focused on machine learning for  pattern recognition and discovery in large, noisy sensor data sets, with applications in earthquake seismology and biodefense. My research group's recent and upcoming work focuses on (1) machine learning-based surrogate models (emulators) and data enhancement (downscaling), with applications in Earth and Climate science, (2) explainable AI (XAI) for scientific data, and (3) scientific foundation models.I did my postdoctoral training at Harvard University as a Data Science Initiative Postdoctoral Fellow in Computer Science.  I earned my Ph.D  (and M.S.) in Computational and Mathematical Engineering at Stanford University, and my B.Sc. in Applied Mathematics from Brown University.  I have also worked as a data scientist at MIT-Lincoln Laboratory.I am also passionate about data science education and workforce development in data science, including supporting women interested in exploring data science careers. I have taught a number of courses and workshops that aim to make data science accessible to students and professionals from a range of disciplinary backgrounds.   Thanks for visiting!                Karianne      Check out the new SciML Group website    Information for Prospective Students NewsOctober 2025:  SciML group Ph.D. student Peter Van Katwyk's research paper, Hybrid Flow: Quantification of Aleatoric and Epistemic Uncertainty in a Single Hybrid Model, has been published in Transactions on Machine Learning Research (TMLR). February 2025:  Ph.D. student Maria Luisa Rocha's research paper Enhancing Sea Ice Concentration Resolution in a Northern Sea Route Strait Using a Generative Adversarial Network has been published in JGR Machine Learning and Computation. June 2024:  SciML group Ph.D. student Anushka Narayanan's review paper Prototype-Based Methods in Explainable AI and Emerging Opportunities in the Geosciences was accepted  for an oral presentation (8 out of 225 submissions) at the AI for Science Workshop at ICML in Vienna. June 2024:  SciML group postdoc Hilarie Sit's paper Improving the Explainability of Softmax Classifiers Using a Prototype-Based Joint Embedding Method was accepted for an oral presentation at the Workshop on Explainable Artificial Intelligence at IJCAI. April 2024:  SciML group Ph.D. student Peter Van Katwyk is selected to present his talk, Understanding and Improving Projections of Sea Level with AI, at Research Matters.  Watch the recording of his talk here. December 2023: SciML Ph.D. students Peter Van Katwyk and Maria Luisa Rocha present their lastest research at the AGU 2023 Fall Meeting.December 2023:  The SciML Group's most recent paper, A Variational LSTM Emulator of Sea Level Contribution from the Antarctic Ice Sheet, has been published in the Journal of Advances in Modeling Earth Systems (JAMES). Upcoming EventsSIAM Conference on Mathematical and Computational Issues in the Geosciences @ LSU (October 2025)MIT FutureTech Conference: How Fast Will AI Automation Happen? (October 2025)Recent EventsSept 2024:  Plenary talk, Statewide California Earthquake Center (SCEC) Annual MeetingJune 2025:  Gordon Research Conference on Machine Learning for Actionable Climate ScienceJan 2025:  USGS Northern California Earthquake Hazards WorkshopOct 2024:  WiDS Providence, hosted by Brown DSISept 2024:  Exploring System Dynamics in the Natural World with AI, University of OsloJuly 2024:  AI for Science: Scaling in AI for Scientific Discovery Workshop at ICMLApril 2024:  Google Modeling TalksNovember 2023:  Artificial Intelligence and Machine Learning in Geophysics - Are We Beyond the Black Box?  National Academies Committee on Solid Earth Geophysics Fall 2023 MeetingJuly 2023:  Computational Science Session, Computability in Europe (CiE), Batumi, Georgia [virtual]April 2023:  Women in Data Science Conference (WiDS@AUB), American University of Beirut, Lebanon  [virtual]Feb 2023:  Brown DSI hosts Women in Data Science (WiDS) Providence Datathon. Career Panel at WiDS Providence 2024, hosted by Brown Data Science Institute.WiDS Providence 2024 - organizers, speakers and attendees posing for a photo at the end of the conference.   Women in Data Science Providence 2023 Datathon, hosted by Brown Data Science Institute (February 2023).Nov 2022:  NSF AI Planning Institute for Data-Driven Discovery in Physics Seminar Series, Carnegie Mellon [virtual]Nov 2022:  Earthquake Science Center Seminar, USGS.More details on the  Presentations page Google SitesReport abuseGoogle SitesReport abuse",
  "content_length": 4866,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:05"
}