{
  "name": "Karim Ali 0001",
  "homepage": "http://karimali.ca",
  "status": "success",
  "content": "Karim Ali | NYU Abu Dhabi slides twitter gscholar dblp github award youtube pdf Few static analyses make their way to the real-world due to the unrealistic assumptions that they make. I am interested in developing and evaluating various program analysis techniques that can be used in practice by exploring three aspects: scalability, precision, and usability. My interests span programming languages, software systems, and software engineering. Below is a list of my current and inactive projects. Current Projects SWAN (2017–) Can I detect security vulnerabilities in my Swift app? In this work, we have been developing SWAN, a program analysis framework for Swift programs based on SPDS . The framework enables various deep static analyses, from finding API misuses using typestate analysis to detecting security vulnerabilities using taint analysis. Papers Energy Consumption Estimation of API-usage in Mobile Apps via Static Analysis (2023) Designing UIs for Static Analysis Tools: Evaluating Tool Design Guidelines with SWAN (2021) Energy Efficient Guidelines for iOS Core Location Framework (2021) SWAN: A Static Analysis Framework for Swift (2020) Just-in-Time Compilers (2016–) Can we help JIT compilers make better decisions when applying a code transformation? In this work, we have been developing several algorithms that enable a JIT compiler to reason not only about the cost of applying a code tranformation (e.g., method inlining), but also about the potential future benefits (e.g., further optimizations) of applying such a code transformation. Papers Hotfixing Misuses of Crypto APIs in Java Programs (2021) U Can't Inline This! (2021) Inactive Projects Usability of Static Analysis Tools (2014–2021) How can we build better experiences for users of static analysis tools? In this work, we have been exploring novel techniques to facilitate the development of program analyses that are more responsive, more precise, well-integrated in the developer's workflow, and customized to the developer's needs. Papers Finding an Optimal Set of Static Analyzers To Detect Software Vulnerabilities (2023) A Human-in-the-loop Approach to Generate Annotation Usage Rules: A Case Study with MicroProfile (2022) Why Do Software Developers Use Static Analysis Tools? A User-Centered Study of Developer Needs and Motivations (2020) Debugging Static Analysis (2018) VISUFLOW: a debugging environment for static analyses (2018) Just-in-Time Static Analysis (2017) Cheetah: Just-in-Time Taint Analysis for Android Apps (2017) Detecting Misuses of Crypto APIs (2015–2020) Can program analysis help developers use crypto APIs more securely? In this work, we have been working on an end-to-end solution to detect misuses of crypto APIs that provides a DSL to define the correct uses of an API, a compiler that generates static analysis checks based on those rules, and IDE extensions that help developers detect misuses in their code based on our infrastructure. Most recently, our work with CogniCrypt helped Symantec fix a bug in one of its products that could lead to privilege escalation. Papers Securing Your Crypto-API Usage Through Tool Support - A Usability Study (2023) Hotfixing Misuses of Crypto APIs in Java Programs (2021) CogniCryptGEN - Generating Code for the Secure Usage of Crypto APIs (2020) CrySL: An Extensible Approach to Validating the Correct Usage of Cryptographic APIs (2019) CrySL: An Extensible Approach to Validating the Correct Usage of Cryptographic APIs (2018) CogniCrypt: Supporting Developers in Using Cryptography (2017) Towards Secure Integration of Cryptographic Software (2015) Scalable and Precise Pointer Analysis (2014–2020) Can pointer analysis be both scalable and precise? In this work, we explore how to leverage the advantages of distributive frameworks such as IFDS, IDE, and WPDS to perform scalable and precise non-distributive analyses such as pointer analysis. We have been building various on-demand pointer analyses that also encode rich alias information for the queried variables. Papers Context-, Flow-, and Field-Sensitive Data-Flow Analysis using Synchronized Pushdown Systems (2019) IDEal: Efficient and Precise Alias-Aware Dataflow Analysis (2017) Boomerang: Demand-Driven Flow- and Context-Sensitive Pointer Analysis for Java (2016) Partial-Program Analysis for Java (2010–2020) Can we perform whole-program analysis of a given Java application without analyzing the whole program? Through light-weight static analyses of the structure of a given application, we have shown that the answer to this question is 'yes'. Moreover, we developed Averroes, a placeholder library generator that enables the use of that suite in any Java whole-program analysis framework. Using Averroes reduces the amount of code that needs to be analyzed by up to 600x, improving the performance of call graph analysis as it becomes up to 7x faster, and uses up to 6x less memory. Averroes is currently used by the major Java static analysis frameworks, Soot, WALA, and DOOP. Papers The Separate Compilation Assumption (2014) Averroes: Whole-Program Analysis Without The Whole Program (2013) Application-Only Call Graph Construction (2012) ScalaCG (2013–2015) Is analyzing the Scala source code any different than analyzing the JVM bytecodes that the Scala compiler generates? In this work, we developed ScalaCG, a collection of low-cost call graph analyses that target the Scala source code and support various Scala features such as traits, abstract type members, closures, and path-dependent types. Using ScalaCG produces call graphs that are up to 19x more precise than using a bytecode-based approach in terms of call edges and reachable nodes. ScalaCG was awarded a Distinguished Artifact Award at the European Conference on Object-Oriented Programming (ECOOP) in 2014. Scalacg has been extended by the original Scala research group at EPFL to improve call graph precision and decrease analysis time for non-trivial Scala programs. These extensions are integrated in the upcoming Scala Dotty compiler. Papers Type-Based Call Graph Construction Algorithms for Scala (2015) Constructing Call Graphs of Scala Programs (2014) Algorizmi (2008–2009) Can we have reproducible evaluations for intrusion detection systems? In this work, we developed an open-source configurable virtual testbed (based on the Eucalyptus cloud platform) for evaluating Intrusion Detection Systems. Papers Algorizmi: A Configurable Virtual Testbed to Generate Datasets for Offline Evaluation of Intrusion Detection Systems (2010) Applying Kernel Methods to Anomaly-Based Intrusion Detection Systems (2009) P2P-AIS: A P2P Artificial Immune Systems Architecture for Detecting DDoS Flooding Attacks (2009) Beep (2006–2007) Is Jabber suitable enough for devices with limited resources? In this work, we developed a wireless telecommunication framework based on the Jabber protocol, targeting JME (known before as J2ME) enabled devices.",
  "content_length": 6942,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:06"
}