{
  "name": "Karim Djemame",
  "homepage": "https://eps.leeds.ac.uk/computing/staff/187/professor-karim-djemame",
  "status": "success",
  "content": "Professor Karim Djemame | School of Computer Science | University of Leeds Skip to main content University links Search Destination Faculty of Engineering and Physical Sciences site All leeds.ac.uk sites School of Computer Science Search Faculty of Engineering and Physical Sciences School of Computer Science People Profile Professor Karim Djemame Position: Professor Areas of expertise: Distributed systems; cloud computing; energy efficiency; heterogeneous parallel architectures; performance evaluation Email: K.Djemame@leeds.ac.uk Phone: +44(0)113 343 6590 Location: 3.25d Bragg Building Website: My Personal Site | LinkedIn | Googlescholar | Researchgate | ORCID Profile My research in distributed systems develops fundamental principles and practical methods for problems that are computationally challenging and/or require unusual kinds of computing resources. In particular, it focuses on Edge/Cloud/HPC-based services to enable organisations to efficiently manage their high-end computing resources with QoS support. It is by definition multidisciplinary, applied and brings collaboration with specialists from both industry and academia. It involves the development of standards-based infrastructure components for job and resource management (including resource brokering, Service Level Agreements, middleware); energy efficiency (modelling and optimisation); heterogeneous computing. I have chaired a number of international workshops at Leeds (UKPEW and VeCOS), and hosted conferences/workshops elsewhere (ISIIC, Scalcom, Service Level Agreements, Tools for an Energy Efficient Cloud, GECON). I am the co-founder of the Heterogeneous Hardware & Software Alliance (HH&S), an initiative undertaken by the TANGO (Transparent heterogeneous hardware Architecture deployment for eNergy Gain in Operation) project. The alliance aims to join efforts of organisations interested in the development of future technologies and tools to advance and take full advantage of computing and applications using heterogeneous hardware. Responsibilities Director of Research and Innovation Co-Director of LIDA Data Science Infrastructures Programme Research interests Distributed systems; Cloud computing; Energy efficiency; Heterogeneous parallel architectures; Performance evaluation, Parallel and Distributed Simulation. I am a member of the Distributed Systems and Services theme. Current/Past Projects: The Communications Hub for Empowering Distributed Cloud Computing Applications and Research (CHEDDAR). EPSRC EDS Recommissioning, NERC EDGNESS: Energy Efficiency, Edge and Serverless Computing (NGI Pointer 2 / EU) System Architectures for Future Supercomputing, Fujitsu TANGO: Transparent heterogeneous hardware Architecture deployment for eNergy Gain in Operation (EU). (GitHub) Software Defined Networks – Newton Mobility Grant (Royal Society) ASCETiC: Adapting Service lifeCycle towards EfficienT Clouds (EU). (GitHub) EKT-SLA: Enterprise Knowledge Transfer – Service Level Agreements (EPSRC) STRAPP: Trusted Digital Spaces through Timely Reliable and Personalised Provenance (TSB/Innovate UK) OPTIMIS: Optimized Infrastructure Services (EU) ISQoS: Intelligent Scheduling for Quality of Service (EPSRC) GridPPT: Grid Performance Prediction Tool (EPSRC) AssessGrid - Advanced Risk Assessment and Management for Trustable Grids (EU) BROADEN: Business Resource Optimisation for Aftermarket & Design on Engineering Networks (DTI/Innovate UK) DAME: Distributed Aircraft Maintenance Environment (EPSRC) AQMCC: Active Queue Management in Computer Networks (Nuffield Foundation) AMOS: Analysis and Modelling of Optical Systems (EPSRC) TCP over ATM Networks. (EPSRC) My research contributes to leveraging the transformative, innovative and collaborative potential of open source according to the EU open source software strategy. A catalogue of open source software for heterogeneous computing (including programming models, middleware components, monitoring, accelerator sharing, device emulation, energy modelling, code profiling) is available on the Heterogeneity Alliance Web site. PhD Students (2024) Reem Alqahtani – Hybrid access control model based on blockchain and machine learning for edge-IoT environment Zhengchang Hua – Decentralising Digital Twins / Edge Computing Shyi Chen – Resource Management in Edge Computing Latifah Alsalem – Application of Federated Machine Learning to support Quality of Service in Edge Computing Abdulaziz Alhindi – Serverless Computing and Energy Efficiency Editorship I am associate editor of the IEEE Transactions on Cloud Computing Journal. <h4>Research projects</h4> <p>Some research projects I'm currently working on, or have worked on, will be listed below. Our list of all <a href=\"https://eps.leeds.ac.uk/dir/research-projects\">research projects</a> allows you to view and search the full list of projects in the faculty.</p> EDGENESS: Energy Efficiency, Edge and Serverless Computing Qualifications PhD MSc Dipl. Eng. Professional memberships IEEE BCS Student education In session 2024-2025 I am module leader for COMP3211 Distributed Systems and COMP5123M Cloud Computing Systems. Research groups and institutes Distributed Systems and Services Current postgraduate researchers Reem Alqahtani Jose Mejia-Arredondo Jiayu Zhao Chuhao Qin Latifah Alsalem Maha Alruwaili Sajan Maharjan Zhuolun Li Linshun Liu Longkun Li <h4>Postgraduate research opportunities</h4> <p>We welcome enquiries from motivated and qualified applicants from all around the world who are interested in PhD study. Our <a href=\"https://phd.leeds.ac.uk\">research opportunities</a> allow you to search for projects and scholarships.</p> Research outputs Loading... My five most recent selected research outputs My other selected research outputs Journal articles Conference papers Presentation (conference/workshop etc) Books Chapters Conference abstracts Preprints Reports Internet publications Performances Compositions Exhibitions Posters Artefacts Designs Patents Scholarly editions Software / code Thesis / dissertations Others Datasets Media Working papers Back to top",
  "content_length": 6090,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:06"
}