{
  "name": "Karin Becker",
  "homepage": "http://inf.ufrgs.br/~kbecker",
  "status": "success",
  "content": "Karin Becker - Instituto de Informática Sobre / Mini-Bio Professora Associada, é orientadora credenciada nos níveis de mestrado e doutorado no Programa de Pós-Graduação em Ciência da Computação (conceito CAPES 7). Atua principalmente nas área de Banco de Dados, Mineração de Dados, e Processamento de Linguagem Natural. Possui cerca de 160 publicações (artigos, capítulos e livros) e 6 prêmios de melhor artigo. Coordenou mais de uma dúzia de projetos com financiamento externo e participou em muitos outros. Atua principalmente em temas relacionados à mineração de dados em diferentes fontes de dados, com aplicações em análise de sentimentos e computação social. Também atua em gêmeos digitais, onde aborda principalmente a gestão de dados e uso de LLMs para explicabilidade e apoio ao processo decisório. O processamento de linguagem natural tornou-se parte integrante dessas pesquisas aplicadas. Participou em eventos nacionais e latino-americanos como keynote speaker e ministrou tutoriais/minicursos em. Presidiu comitês dos diversos eventos do SBBD e ERBD, integrou a Comissão Especial de Banco de Dados da SBC, e é Organizing Chair do BRACIS/SBBD 2027. Participou de comitês de programa de conferências internacionais, e é revisora de duas dezenas de periódicos de prestígio internacional. Já foi membro do comitê MEC da FAPERGS por dois mandatos (1997-2000). Na UFRGS, é membro do Conselho de Ensino, Pesquisa e Extensão desde 2020, já atuou na Câmara de Pesquisa por dois mandatos (2020-2022 como vice-presidente, 2022-2024 como membro), e desde 2024 atua na Câmara de Pós-Graduação. Possui graduação pela UFRGS (1984), mestrado em Ciências da Computação pela UFRGS (1989) e doutorado na University of Namur - Bélgica (1993). Entre Agosto/2014 e Julho/2015 realizou estágio pós-doutoral sênior na University of Southern California (USC) em Los Angeles com bolsa financiada pela agência CAPES. Desde 2023 é bolsista de produtividade científica CNPq. É membro da Sociedade Brasileira de Computação (SBC) e da IEEE. ====== Associate Professor at the Institute of Informatics at UFRGS, she is an accredited advisor at the master's and doctoral levels in the Postgraduate Program in Computer Science (CAPES concept 7). She works in research and teaching with solid experience in both academia and industry, mainly in the areas of Databases, Data Mining, and Natural Language Processing. Coordinating more than a dozen externally funded projects, she works extensively on topics related to data mining in various data sources, including social networks, software artifacts, and song lyrics, with applications in sentiment analysis and social computing. She also works with digital twins, participating in three projects where she primarily addresses data management and the use of LLMs for explainability and decision-making support. Natural language processing has become an integral part of this applied research. She has approximately 160 publications (articles, chapters, and books) and has received six Best Paper awards. She has been a keynote speaker and has given tutorials/mini-courses at national and Latin American events. She has extensive experience in the scientific community, having chaired committees for various SBBD and ERBD events, served as a member of the SBC Special Database Committee, and will be the Organizing Chair of BRACIS/SBBD in 2027. She has participated in program committees for international conferences and is a reviewer for two dozen internationally prestigious journals. She was a member of the MEC committee of FAPERGS for two terms (1997-2000). At UFRGS, she has been a member of the Teaching, Research, and Extension Council since 2020, has served on the Research Chamber for two terms (2020-2022 as vice president and 2022-2024 as a member), and has been serving on the Postgraduate Chamber since 2024. E-mail Karin.Becker at inf.ufrgs.brkbeckerbr at gmail.com Curso de Graduação INF01145 Fundamentos de Banco de Dados Curso de Graduação INF01215 Métodos Ágeis Curso de Pós-Graduação CMP259 Descoberta de Conhecimento em Grandes Volumes de Dados Mineração de Dados e Descoberta de Conhecimento Processamento de Linguagem Natural",
  "content_length": 4175,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:15"
}