{
  "name": "Kari Systä",
  "homepage": "https://www.tuni.fi/en/kari-systa",
  "status": "success",
  "content": "Kari Systä | Tampere universitiesKari SystäProfessor, Software EngineeringFaculty of Information Technology and Communication Sciences | Computing SciencesTampere Universitykari.systa [at] tuni.fi (kari[dot]systa[at]tuni[dot]fi)Hervanta CampusOrcidhttps://orcid.org/0000-0001-7371-0773About meSoftware, software engineeting and computer science enthusiastic since 1980. I'm nterested both in research and practise. ResponsibilitiesMy own teaching for 2022-2024 includes Course COMP.SE.140 Continuous Development and Deployment - DevOps Several Master Theses A also look after The study modules of Software Engineering and Web&Cloud Software Engineering Fields of expertiseMy main expertise areas are Theory and practice of software engineering. Web, edge and cloud software. Phases of my career 1980-1985: Master studies and part-time teaching in Tampere University of technology 1985-1995: Various research projects, teaching tasks and PhD studies in Tampere University of technology 1995-2011: Several research and management roles in Nokia corporation 2012- : Professor of software engineering in Tampere University Top achievementsCurrent projects LiquidAI (2023-2025) A BF funded project to develop Liquid Software for highly connected IoT-Edge-Cloud continuum. Compared to past efforts on Liquid Software, we in LiquidAI we consider Machine Learning components, too. This is a collaborative effort with University of Jyväskylä. 6GSoft (2023-2026) A BF-funded project to address the following challenges: \"Developing and managing 5G and especially 6G software will demand totally new software development methods, tools, processes, and architectures. We need novel industry-scale software engineering to support the integrated development of heterogeneous systems that include software platforms, cloud, big data, AI, edge, IoT, and quantum computing. The number of connected devices will explode, and they all have software. They range from micro-level devices with very limited processing capability to larger connected devices with strong processing power and large applications in the cloud. Different parts of the distributed systems are owned and managed by various stakeholders. Current architectures, orchestration, and scalability methods and tools are not capable of supporting such complex, heterogeneous, and highly distributed 6G software systems. In addition, the application of current technologies will create a very high energy overhead, due to the lack of optimization for such a large number of connected devices.\" This is a collaboration project with University of Oulu, LUT University and University of Jyväskylä. Microblock (2021-2023) An EU-funded multi-disciplinary project to investigate use blockchain-based micro-credentials for study credits. For further informations see: https://www.tuni.fi/en/research/microblock-advancing-exchange-micro-credentials-ebsi-0 DELI (2023-2025) A cross-disciplinary infrastructure (FIRI - Academy of Finland) project to build platforms and tools for energy researchj. Recently ended projects VISDOM is an international Eureka/ITEA3 project that develops new types of visualisations for software development. We concentrate visualisations that are based on data from several tools and our special focus is in DevOps-type projects. For further information, see the project-wide web-page: iteavisdom.org . CityIoT vendor independent IoT platform for smart cities: For more information see https://pervasive.cs.tut.fi/?p=2820 and https://www.cityiot.fi/english/ ProcemPlus whose main objective of ProCemPlus project is to study the formation of individual energy communities into broader business-oriented energy ecosystems through several research themes and concrete pilot-cases related to the development of energy communities, and to analyze the role of microgrids and energy communities in the future energy ecosystem. The role of our team is related to design of the required information system and related software/platform economy. For more information see information about the earlier Procem-project and web-page of this new ProcemPlus project . Research topicsMy current research topics & interests are Data driven software engineering: how the data collected from software and its decision process can be used for more efficient development and better decision making. Web as an application platform. Software architectures for open IoT systems. Advanced software solutions for modern energy systems. Programmable world and edge computing. Research unitTASE - https://research.tuni.fi/tase/Selected publicationsSee, google scholar and similar places for the academic publications. Together with my colleagues from the other universities in Finland we wrote a report (with recommendations) about software in Finland. See: https://www.alliedict.fi/wp-content/uploads/2023/04/AIF-2023_Ohjelmistot-Suomessa-korkeakoulukorjaus-1.pdf (in Finnish)",
  "content_length": 4913,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:08"
}