{
  "name": "Karl Meinke",
  "homepage": "http://www.csc.kth.se/~karlm",
  "status": "success",
  "content": "Karl Meinke Karl Meinke karlm -- at -- csc.kth.se Phone: +46-8-790 63 37 (Office) Phone: +46-(0)76 223 86 79 (Mobile) Fax: +46-8-790 09 30 Address: Nada, KTH, S-100 44 Stockholm, Sweden Room: 1517, Osquars Backe 2, 5th Floor. I am a full Professor in computer science in the Theoretical Computer Science Department (TCS) at the School of Computer Science and Communication (CSC). I am currently deputy head of the TCS Department. What's new ... I have moved room! Please note my new office address 1517, floor 5, E-building. Recent activities and publications, in historical order ... Software Reliability Group Research : Papers and Presentations Below are some recent papers from our research group on software reliability on subjects including: learning-based software testing model-based fault prediction automata learning model-mining model-checking and constraint solving Recent Presentations Here are the slides from my ISoLA 2016 lectures on : Learning-based Testing for Reactive, Procedural and Hybrid Systems Lecture 1: LBT for Reactive Systems Lecture 2: LBT for Procedural and Hybrid Systems Here are the slides from my HSST 2015 Summer School Lecture Series on : Learning-based Testing for Procedural and Reactive Systems Lecture 1: Overview of Learning-based Testing Lecture 2: LBT for Reactive Systems: Basic Theory Lecture 3: LBT for Reactive Systems: Praxis Lecture 4: LBT for Procedural Systems Here is an overview of our research on learning-based testing. Papers H. Khosrowjerdi, K. Meinke and A. Rasmusson: Automated Behavioral Requirements Testing of Automotive ECU Applications, submitted for journal publication, 2016. K. Meinke and P. Nycander: Learning-based Testing of Distributed Microservice Architectures: Correctness and Fault Injection, to appear in: Proc 6th Workship on Automating Test Case Design, Selection and Evaluation, ATSE 2015, York, 2015. P. Wong, R. Bubel, F. De Boer, M. Gomez-Zamalloa, S. De Gouw, R. Hähnle, K. Meinke and M. Sindhu: Testing Abstract Behavioural Specifications, to appear in: Int. Journal on Software Tools for Technology Transfer, Springer Verlag, 2014. M. de Oliveira Oliveira, Combinatorial Slice Theory PhD Thesis, School of Computer Science and Communication, KTH Royal Institute of Technology, Stockholm, Sweden, 2013, ISBN 978-91-7501-933-8. This thesis contains a new efficient approach to automating equational logic. L. Feng, S. Lundmark, K. Meinke, F. Niu, M.A. Sindhu, P.Y.H. Wong: Case Studies in Learning-based Testing, pp. 164-179 in Proc. 25th IFIP Int. Conf. on Testing Software and Systems (ICTSS 2013), LNCS 8254, Springer Verlag, 2013. K. Meinke and F. Niu: An Incremental Learning Algorithm for Hybrid Automata, submitted for publication, 2013. R. Ansin and D. Lundberg: Automated Inference of Excitable Cell Models as Hybrid Automata, Batchelors Thesis, School of Computer Science and Communication, KTH Stockholm, 2013. M. Sindhu, Algorithms and Tools for Learning-based Testing of Reactive Systems PhD Thesis, School of Computer Science and Communication, KTH Royal Institute of Technology, Stockholm, Sweden, 2013, ISBN 978-91-7501-674-0. K. Meinke and M. Sindhu: LBTest: A Learning-based testing Tool for Reactive Systems, to appear in Proc. Sixth Int. IEEE Conf. on Software Testing, Verification and Validation (ISCT-2013), 2013. K. Meinke and N. Walkinshaw: Model-based Testing and Model Inference, pp 440-443 in: B. Steffen and T. Margharia (eds) Proc. 2012 Int. ISoLA workshop on Machine Learning for Software Construction, LNCS 7609, Springer Verlag, 2012. K. Meinke and M. Sindhu: An n log n algorithm for Deterministic Kripke Structure Minimization, submitted for journal publication, 2012. K. Meinke and F. Niu: An Incremental Learning Algorithm for Extended Mealy Automata, pp 488-504 in B. Steffen and T. Margharia (eds) Proc. 2012 Int. ISoLA workshop on Machine Learning for Software Construction, LNCS 7609, Springer Verlag, 2012. Shaolin Hu, Xiaofeng Wang, Karl Meinke and Huajiang Ouyang: Outlier-Tolerant Fitting and Online Diagnosis of Outliers in Dynamic Process Sampling Data Series, pp 195-203 in: Hepu Deng, Duoqian Miao, Jingsheng Lei, Fu Lee Wang (Eds.): Artificial Intelligence and Computational Intelligence - Third International Conference, AICI 2011, Proceedings, Part III, LNCS 7004, Springer Verlag, 2011, ISBN 978-3-642-23895-6 K. Meinke, F. Niu and M. Sindhu: Learning-Based Software Testing: a Tutorial, invited paper, pp 200-219 in: R. Haehnle et al. (eds) Proc. ISoLA 2011, Int. Symp. on Leveraging Applications of Formal Methods, Verification, Validation, CCIS 336, Springer Verlag, 2012. F. Niu: Learning-based Software Testing using Symbolic Constraint Solving Methods, Licentiate Thesis, School of Computer Science and Communication, Royal Institute of Technology, Stockholm, Sweden, 2011, ISBN 978-91-7501-117-2. K. Meinke and M. Sindhu: Correctness and Performance of an Incremental Learning Algorithm for Finite Automata, accepted for poster presentation at Third Asian Conference on Machine Learning (ACML 2011), 13-15 November 2011, Taiwan. K. Meinke and F. Niu, Learning-Based Testing for Reactive Systems using Term Rewriting Technology, pp 97-114 in B. Wolff and F Zaidi (eds) Proc. 23rd IFIP Int. Conf. on Testing Software and Systems (ICTSS 2011), LNCS 7019, Springer Verlag, 2011. M. Sindhu, Incremental Learning and Testing of Reactive Systems Licentiate Thesis, School of Computer Science and Communication, Royal Institute of Technology, Stockholm, Sweden, 2011, ISBN 978-91-7501-062-5. K. Meinke and M. Sindhu, Incremental Learning-Based testing for Reactive Systems, pp 134-151 in: Proc. Int. Conf. on Tests and Proofs TAP 2011, LNCS 6706, Springer Verlag, 2011. K. Meinke and F. Niu, A Learning-Based Approach to Unit Testing of Numerical Software, pp 221-235 in A. Petrenko et al. (eds) Proc. 22nd IFIP Int. Conf. on Testing Software and Systems (ICTSS 2010), LNCS 6435, Springer Verlag, 2010. K. Meinke, CGE: a Sequential Learning Algorithm for Mealy Automata, pp 148-162 in J.M. Sempere and P. Garcia (eds), Proc. 10th Int. Colloquium on Grammatical Inference, (ICGI 2010), LNCS 6339, Springer Verlag, 2010. Here is a paper on Iterative estimators of parameters in linear models with partially variant coefficients. using Gauss-Markov assumptions. This paper appeared as: S. Hu, K. Meinke, R Chen, O. Huajiang, Iterative estimators of parameters in linear models with partially variant coefficients, International Journal of Applied Mathematics and Computer Science, Vol 17, No 2, 179-187, 2007. Here is a paper on online diagnosis of faults in SISO processes. This paper appeared as: S. Hu, K. Meinke, L. Huang and O. Huajiang, Fault-tolerant Fitting and Online Diagnosis of faults in SISO Processes, in: Proc. 6th IFAC Symp. on Fault detection, Supervision and Safety of Technical Processes, 2006. Here is my original paper on learning-based testing. This paper appeared as: K. Meinke, Automated Black-Box Testing of Functional Correctness using Function Approximation, pp 143-153 in: G. Rothermel (ed) Proc. ACM SIGSOFT Int. Symp. on Software Testing and Analysis, ISSTA 2004, Software Engineering Notes 29 (4), ACM Press, 2004. Here is a paper that gives a rigorous foundation for probabilistic correctness based on black-box testing. This has appeared as: K. Meinke, A Stochastic Theory of Black-Box Software Testing, pp.578-595 in K. Futatsugi et al. (eds) Goguen Festschrift, LNCS 4060, Springer Verlag, 2006. Conferences and Events ... Here are some conferences and events I'm a PC member for: The Eleventh International Conference on Tests and Proofs, TAP 2017 July 17 - 21, 2017, Marburg, Germany. 7th International Symposium On Leveraging Applications of Formal Methods, Verification and Validation, ISoLA 2016 10-14 October 2016, Corfu, Greece. The Thirteenth International Conference on Grammatical Inference ICGI 2016 October 2016, Delft, Netherlands. The Tenth International Conference on Tests and Proofs, TAP 2016 July 5- July 7, 2016, Vienna, Austria. The Fifth Halmstad Summer School on Testing June 8 - June 11, 2015, Halmstad University, Sweden. The Sixth Workshop on Automating Test case design, Selection and Evaluation, ATSE 2015 September 7 - September 8, 2015, York, UK. The Ninth International Conference on Tests and Proofs, TAP 2015 July 20- July 24, 2015, L'Aquila, Italy. 26th IFIP Conference on Testing Software and Systems, ICTSS 2014 September 23-25, 2014, Madrid, Spain. The Eighth International Conference on Tests and Proofs, TAP 2014 July 24- July 25, 2014, York, UK. 25th IFIP Conference on Testing Software and Systems, ICTSS 2013 November 13-15, 2013, Istanbul, Turkey. The Seventh International Conference on Tests and Proofs, TAP 2013 June 18-June 19, 2013, Budapest, Hungary. 24th IFIP Conference on Testing Software and Systems, ICTSS 2012 November, 2012, Aalborg, Denmark. 5th International Symposium On Leveraging Applications of Formal Methods, Verification and Validation, ISoLA 2012 15-18 October 2012 - Amirandes, Heraclion, Crete . The Sixth International Conference on Tests and Proofs, TAP 2012 May 31-June 01, 2012, Prague, Czech Republic. The Fifth International Conference on Tests and Proofs, TAP 2011 June 30-July 01, Zurich, Switzerland. The Sixth International Conference on Software Engineering Advances, ICSEA-11 October 23 - 28, 2011 Barcelona, Spain. International Conference on Software and Data Technologies, ICSOFT 2010 22-24 July, 2010 in Athens, Greece. The Fourth International Conference on Tests and Proofs, TAP 2010 Malaga, Spain. The Fifth International Conference on Software Engineering Advances, ICSEA-10 August 22 - 27, 2010 Nice, France. International Conference on Software and Data Technologies, ICSOFT 2009 26-29 July, 2009 in Sofia, Bulgaria. The Third International Conference on Tests and Proofs, TAP 2009 2-3 July 2009, Zurich, Switzerland. The Fourth International Conference on Software Engineering Advances, ICSEA-09 September 20 - 25, 2009 in Porto, Portugal. Th",
  "content_length": 12868,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:32"
}