{
  "name": "Karla Badillo-Urquiola",
  "homepage": "https://cse.nd.edu/faculty/karla-badillo-urquiola",
  "status": "success",
  "content": "Karla Badillo-Urquiola - Computer Science and Engineering Clare Boothe Luce Assistant Professor, Computer Science and Engineering Contact Email kbadill3@nd.edu Phone 574-631-3053 Office 326G Cushing Hall of Engineering Areas of Interest Professor Badillo-Urquiola conducts human-computer interaction research to design technology-driven solutions that empower people and protect the well-being of youth and marginalized communities. Her current work uses human-centered and participatory design methods to study adolescent online safety for teens in foster care situations. As a Latina woman in STEM, professor Badillo-Urquiola is also determined to advance the principles of diversity, inclusion, and equity in computing. She is an active member of the SIGCHI Latin American HCI Community (LAIHC) and an advocate for minority HCI faculty and students. She is a fellow of Notre Dame’s Lucy Family Institute for Data and Society, where she conducts research and collaborates with the community to build better futures for youth. Her areas of interest include: Human-computer Interaction Social Computing Online Safety, Usable Privacy and Security Digital Youth, Child Welfare Latino Populations, Marginalized Populations Websites Google Scholar Karla Badillo-Urquiola EPOCH Research Lab Education Ph.D., Modeling and Simulation, University of Central Florida, 2022 M.Sc., Modeling and Simulation, University of Central Florida, 2015 B.Sc., Psychology, University of Central Florida, 2014 News Crossing borders with NDG grants: How a professor is ensuring ethics stay in the conversation about technology Notre Dame researchers partner with Mexico hospital to develop childhood cancer care monitoring tool Overburdened caseworkers put foster youths’ online safety on the back burner Interdisciplinary team of faculty to create new curriculum for responsible computing Karla Badillo-Urquiola named Clare Boothe Luce Assistant Professor College of Engineering welcomes 9 new hires Departments Aerospace and Mechanical Engineering Chemical and Biomolecular Engineering Civil and Environmental Engineering and Earth Sciences Computer Science and Engineering Electrical Engineering Faculty/Staff Resources",
  "content_length": 2198,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:25"
}