{
  "name": "Karsten Huffstadt",
  "homepage": "https://fiw.thws.de/fakultaet/personen/dozentinnen-und-dozenten/person/prof-dr-karsten-huffstadt",
  "status": "success",
  "content": "Dozentinnen und Dozenten :: Technische Hochschule Würzburg-Schweinfurt Zum Inhalt wechseln Zum Hauptmenü wechseln Zum Navigationspfad wechseln Zur Suche wechseln Zur Sprachauswahl wechseln Zur Servicenavigation wechseln Dozentinnen und Dozenten Prof. Dr. Karsten Huffstadt Fakultät Informatik und Wirtschaftsinformatik Telefon +49 931 3511-8875 E-Mail karsten.huffstadt[at]thws.de Besucheranschrift Sanderheinrichsleitenweg 20 97074 Würzburg Raum I.3.27 Sprechstunden nach Vereinbarung Aufgabenbereich(e) Studiengangsleiter Master Digital Business SystemsVertiefungsrichtung Mobile and Ubiquitous Solutions Aktuelles Ankündigungen für das laufende Semester In diesem Semester biete ich alle Veranstaltungen hybrid an. Somit haben Sie die Möglichkeit, sowohl im Hörsaal als auch remote teilzunehmen. Bitte wenden Sie sich per Mail an mich, um die entsprechenden Zugangsinformationen zu den Werkzeugen zu erhalten. Lehrgebiete Derzeitige Lehrgebiete und Schwerpunkte Vertiefung Mobile and Ubiquitous Solutions (im Bachelor) - Mobile Systeme und deren Konzeption, Entwicklung und Design - von der Idee bis zur Umsetzung (nicht nur) mobiler Lösungen!Mobile Systeme (Studiengang EC) - alles um die mobile Welt...Forschungsmethoden (im Master) - wie gelangen wir zu Erkenntnis (und noch einige spannende Themen mehr...).Wissenschaftsseminar (im Master) - Umsetzung der Wissenschaftstheorien mit abschließendem wissenschaftlichen Paper.Ethical Leadership (im Master) - hier mit besonderem Blick auf die Führungsstrategien in Unternehmen.Angewandtes Forschungsprojekt (im Master) - hier führen wir angewandte Forschung \"real\" durch! Publikationen Nachfolgend ein Veröffentlichungsauszug... Glückert, I.K., Huffstadt, K., Müller, N. (2025). Buy Now Pay Later: Between Flexibility and Financial Control – An Analysis of Psychological and Social Factors. In: Stephanidis, C., Antona, M., Ntoa, S., Salvendy, G. (eds) HCI International 2025 Posters. HCII 2025. Communications in Computer and Information Science, vol 2528. Springer, Cham. doi.org/10.1007/978-3-031-94168-9_30Arda, H., Huffstadt, K. (2024). Exploring the Impact of Virtual Presence in Digital Meetings: A Comparative Study. In: Zaphiris, P., Ioannou, A. (eds) Learning and Collaboration Technologies. HCII 2024. Lecture Notes in Computer Science, Vol 14724. Springer, Cham.doi.org/10.1007/978-3-031-61691-4_2Zebec, R., Huffstadt, K. (2024)Impact of Dark Mode on the User Experience of Productivity-Oriented Applications. In: International Journal of Engineering and Technology, Vol. 16, No. 2, 2024, 61-66.Laskowitz, L., Huffstadt, K. (2023)Between Reality and Fiction: Self-Representation as an Avatar and Its Effects on Self-Presence. In: Proceedings of the 2023 International Joint Conference on Robotics and Artificial Intelligence, 193-203.Goll, F., Huffstadt, K. (2023)Social Media Usage Behavior - Does a break for impulse control between the stimulus to open a social media app and the actual response to open the app reduce the total time spent using a social media app? In: Proceedings of the 2023 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining, 749-756.Tamin Rahi, P., Huffstadt, K., & Al, S. (2022) Comparison of the Memorability of Text and Visual (Background) Sounds During their Fade-In in Short Scenes With Subtitles. In: Mathematical Statistician and Engineering Applications, 71(3s), 914-925.Metzger, L., Kutzner, A., & Huffstadt, K. (2022) Not Necessarily Relaxed: How Work Interruptions Affect Users’ Perception of Stress in Remote Work Situations. In: International Conference on AI-assisted Solutions for COVID-19 and Biomedical Applications in Smart Cities (pp. 3-15). Cham: Springer Nature Switzerland.Neeser, B. and Huffstadt, K. (2021) The Role of Software in Computer Science Majors’ Career Choice. In: The 9th European Conference on Education (pp. 1-14). Nagoya, Japan; The International Academic Forum (IAFOR).Winterstein, K., Keller, L., Huffstadt, K. & Müller, N.H. (2021) Acceptance of Social and Telepresence Robot Assistance in German Households. In: Zaphiris P., Ioannou A. (eds) Learning and Collaboration Technologies: Games and Virtual Environments for Learning. HCII 2021. Lecture Notes in Computer Science, vol 12785. Springer, Cham.Gawron O., Keller L., Huffstadt, K. & Müller, N.H. (2021) Effect of Height in Telepresence Robots on the Users’ Spatial Awareness. In: Zaphiris P., Ioannou A. (eds) Learning and Collaboration Technologies: Games and Virtual Environments for Learning. HCII 2021. Lecture Notes in Computer Science, Vol 12785. Springer, Cham.Stollberger, A., Fertig, T., Schütz, A., Huffstadt, K., Müller, N. H. (2020)Analysis of the Operating Costs of a Decentralized App in the Ethereum Blockchain. In: Proceedings of the International Conference on Applied Informatics, ICDD.Keller L., Pfeffel K., Huffstadt K., Müller N. H. (2020)Telepresence Robots and Their Impact on Human-Human Interaction. In: Zaphiris P., Ioannou A. (eds) Learning and Collaboration Technologies. Human and Technology Ecosystems. HCII 2020. Lecture Notes in Computer Science, vol 12206. Springer, Cham. Münch, M., Huffstadt, K., Schleif, FM. (2019)Towards a device-free passive presence detection system with Bluetooth Low Energy Beacons. In: European Symposium on Artificial Neural Networks, Computational Intelligence and Machine Learning.Huffstadt, K., Fetzer, T., Petry, Ch., Deinzer, F. (2015) Increasing the Stimulus-Response Correspondence by using Stereoscopic Vision. In: Proceedings of the 11th IEEE International Conference on Automatic Face and Gesture Recognition Conference and Workshops.Huffstadt, K., John, I. Oelfke, B. (2013) Entwicklung mobiler und ubiquitärer Unternehmensanwendungen - Trendstudie als Längsschnittbetrachtung zur Entwicklung von mobilen und ubiquitären Unternehmensanwendungen in Deutschland, Würzburg.Wolf, F., Huffstadt, K. (2013)Mobile Enterprise Application Development - a Cross-Platform Framework. In: FHWS Science Journal, Heft 1.Berger, J., Huffstadt, K. (2010)Mobile Instandhaltung und der wahre Nutzen. In: Instandhaltung 2010 – Effizienz im Anlagenmanagement.Huffstadt, K. (2009)Mobile Maintenance Management - mobile Datenerfassung am Ort des Geschehens, In: Arbeitsbericht 11. Industriearbeitskreis Kooperation im Anlagenbau, Frauenhofer-Institut für Fabrikbetrieb und -automatisierung IFF.Huffstadt, K. (2007)Sicherheitsstrategien- Anlagensicherheit durch den Einsatz mobiler Anwendungen und RFID-Technik am Beispiel der Unfallverhütungsvorschrift. In: S+I, Heft 1, 2008.Huffstadt, K. (2007)Analyse und Darstellung des Return und Invest (ROI) bei der Einführung einer mobilen Supply Chain Management-Lösung. In: Bandow (Hrsg.): Mehr Gewinn durch Instandhaltung.Huffstadt, K. (2006)Mobility as a Multidimensional Integrator. In: International Paper World Journal. Huffstadt, K. (2005)Personal und Arbeit im Customer Relationship Management-Geschäftsmodell. In: Zeitschrift für Personalforschung, Heft 4.Huffstadt, K., Janowski, J. (2003)Kundenorientierung als zentrale Führungsverhaltens-dimension. In: Zeitschrift für Organisation, Heft 6. Vita Übersicht der bisherigen \"Lebens-Stationen\" Studium der Wirtschaftinformatik an der Universität Mannheim von 1996 bis 2001 mit dem Schwerpunkt Informationssysteme.Im Anschluss daran direkt die Promotion am Lehrstuhl Personal der Universität Mannheim mit dem Schwerpunkt Auswirkungen von Informationssystemen auf die Personal- und Führungsarbeit von 2001 bis 2004.Bereits vor und während des Studiums Tätigkeiten als Anwendungsentwickler bei IAS GmbH, von 2004 bis 2010 tätig als Consultant bei der Gesellschaft für Anwendungsberatung mbHSeit 2010 Professor für Wirtschaftinformatik an der FHWS.",
  "content_length": 7713,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:27"
}