{
  "name": "Kartik Nagar",
  "homepage": "https://kartiknagar.github.io",
  "status": "success",
  "content": "Kartik Nagar Search Kartik Nagar Assistant Professor IIT Madras Biography I am an Assistant Professor in the Department of CSE, IIT Madras. Previously, I was a postdoc in Purdue University working with Prof. Suresh Jagannathan. Before that, I did my PhD from IISc under the guidance of Prof. YN Srikant. I am interested in developing Verification and Analysis techniques to improve the reliability, security and efficiency of Computer Systems. In this context, I am especially interested in solving theoretical and practical verification problems arising in Concurrent and Distributed Systems, Computer Architecture, Operating Systems and Real-time Systems. Recently, I have worked on developing automated verification techniques for programs running under a weakly consistent memory model in the context of Distributed Replicated systems and Distributed Databases. Previously, I have also worked on developing static timing analysis techniques, focusing on the impact of the Hardware cache hierarchy on the Worst Case Execution Time of programs. Interests Automated Formal Verification Program Analysis Programming Languages Education PhD, 2016 Indian Institute of Science M.Eng., 2012 Indian Institute of Science News Gave a tutorial on Replicated Data Types at ATVA 2025. Here are the slides of the talk. Paper titled ‘Automatically Verifying Replication-aware Linearizability’ accepted at OOPSLA 25. Paper titled ‘A Mechanically Verified Garbage Collector for OCaml’ accepted at the Journal of Automated Reasoning. Paper titled ‘Automated Robustness Verification of Concurrent Data Structure Libraries against Relaxed Memory Models’ accepted at OOPSLA 24. Students PhD Vimala S (co-guided with KC Sivaramakrishnan) Prime Minister’s Research Fellow Sheera Shamsu (co-guided with KC Sivaramakrishnan) Divya Rathore Prime Minister’s Research Fellow Nitish Yadav MS Divyanshu Upadhyay Jay Rathi Alumni Publications Sheera Shamsu, Dipesh Kafle, Dhruv Maroo, Kartik Nagar, Karthikeyan Bhargavan, KC Sivaramakrishnan . A Mechanically Verified Garbage Collector for OCaml. JAR, 2025. PDF Vimala Soundarapandian, Kartik Nagar, Aseem Rastogi, KC Sivaramakrishnan . Automatically Verifying Replication-aware Linearizability. OOPSLA, 2025. PDF DOI arxiv Kartik Nagar, Anmol Sahoo, Romit Roy Chowdury, Suresh Jagannathan . Automated Robustness Verification of Concurrent Data Structure Libraries against Relaxed Memory Models. OOPSLA, 2024. PDF DOI Shreesha Bhat, Kartik Nagar . Automating Cutoff-based Verification of Distributed Protocols. FMCAD, 2023. PDF Vimala Soundarapandian, Adharsh Kamath, Kartik Nagar, KC Sivaramakrishnan . Certified Mergeable Replicated Data Types. PLDI, 2022. PDF arxiv See all publications Projects Automated Reasoning for Replicated Systems For global-scale applications such as Amazon, Twitter, Facebook, etc. with users distributed across the world, in order to provide a … Timing Analysis for Real-time Systems In Real-time systems, e.g. automobiles, aircrafts, space shuttles, robots, etc. programs are executed in response to external stimuli … Service Program Committee 2026: PLDI, CC 2025: OOPSLA, ATVA, APLAS 2024: VSTTE, PaPoC, ISEC Organizing Committee RHPL 2023-25 Contact nagark@cse.iitm.ac.in +91 (044) 22574387 SSB 401, Department of CSE, IIT Madras, Chennai, 600036, India Cite × Copy Download",
  "content_length": 3331,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:33"
}