{
  "name": "Karthikeyan Sankaralingam",
  "homepage": "http://pages.cs.wisc.edu/~karu",
  "status": "success",
  "content": "Karu's Homepage : Homepage browse Karu's Homepage » Homepage Print Homepage, Bio CV Contact Info Publications Research Summary Projects Research group Teaching Personal Pronunciation guide Academic Genealogy Karu Sankaralingamaka Karthikeyan SankaralingamMark D. Hill and David A. Wood ProfessorComputer SciencesAffiliate Faculty: Electrical and Computer EngineeringAffiliate Faculty: Robert M. La Follette School of Public Affairskaru@cs.wisc.edu, Phone: (608) 890-0121Office hours: by appointment. Research (CV) I lead the Vertical Research Group. I also founded a chip startup SimpleMachines. Interests: Computer Architecture, Microarchitecture, VLSI, computing devices. If you are a graduate or undergraduate student interested in pursuing research with me, read this. Select Publications and opinions Defying Moore: Envisioning the Economics of a Semiconductor Revolution Through 12nm Specialization, Communications of the ACM BRYT: Data Rich Analytics Based Computer Architecture for A New Paradigm of Chip Design, arxiv The Reviewer is Dead, Long Live the Review: Re-engineering Peer Review for the Age of AI (SIGARCH blog), Hacks to be a great reviewer (SIGARCH blog), Confuseds, Strategists, and Snoozers: A Whimsical Odyssey through the Maze of Scholarly Reviews, CACM Opinion, November 2024. pdf IM-Unpack: Training and Inference with Arbitrarily Low Precision Integers, ICML 2024 A Journey of a 1,000 Kernels Begins with a Single Step: A Retrospective of Deep Learning on GPUs, ASPLOS 2024, pdf LookupFFN: Making Transformers Compute-lite for CPU inference, ICML 2023 The Mozart Reuse Exposed Dataflow Processor for AI and Beyond, ISCA 2022, pdf Mozart: Designing for Software Maturity and the Next Paradigm for Chip Architectures, HOTCHIPS 2021 Heterogeneous Von Neumann/Dataflow Microprocessors, CACM Research Highlights 2019 Stream-Dataflow Acceleration, ISCA 2017, pdf Kickstarting Semiconductor Innovation with Open Source Hardware. IEEE Computer June 2017, arXiv pre-print Pushing the Limits of Accelerator Efficiency While Retaining General-Purpose Programmability, HPCA 2016, pdf, IEEE Micro Top Picks Analyzing Behavior Specialized Acceleration, ASPLOS 2016, pdf Cross-Architecture Performance Prediction (XAPP) Using CPU Code to Predict GPU Performance, MICRO 2015, pdf, IEEE Micro Top Picks Honorable Mention MIAOW: An Open source GPGPU, HOTCHIPS 2015, homepage, IEEE Spectrum, the register, EE Times article, Enterprisetech Enabling GPGPU Low-level Hardware Explorations with MIAOW - An Open Source RTL Implementation of a GPGPU, ACM TACO paper Efficient Execution of Memory Access Phases Using Dataflow Specialization, ISCA 2015, pdf, IEEE Micro Top Picks Exploring the Potential of Heterogeneous Von Neumann/Dataflow Execution Models, ISCA 2015, pdf, , IEEE Micro Top Picks, CACM Research Highlights Architecture Simulators Considered Harmful, IEEE Micro, WDDD '14 version pdf Virtually-Aged Sampling DMR: Unifying Circuit Failure Prediction and Circuit Failure Detection, MICRO 2013, pdf A General Constraint-centric Scheduling Framework for Spatial Architectures, PLDI 2013, Distinguished Paper Award, pdf Power Struggles: Revisiting the RISC vs. CISC Debate on Contemporary ARM and x86 Architectures, HPCA 2013. pdf, extended tech-report, web-page, ACM TOCS ISA Wars journal version iGPU: Exception Support and Speculative Execution on GPUs, ISCA 2012, pdf Idempotent Processor Architecture, MICRO 2011, pdf Dark Silicon and the End of Multicore Scaling, ISCA 2011, pdf; IEEE Micro Top Picks 2012,Invited ACM TOCS, Communications of ACM Research Highlights 2013 Sampling + DMR: Practical and Low-overhead Permanent Fault Detection, ISCA 2011, pdf Dynamically Specialized Datapaths for Energy Efficient Computing, HPCA 2011, pdf Relax: An Architectural Framework for Software Recovery of Hardware Faults, ISCA 2010, pdf Research Summary I am interested in microarchitecture, architecture, and software issues for future computation systems and lead the Vertical research group. Technology constraints of unreliable hardware, process variations, and energy efficiency are going to define computation substrates of the future. My research goal is to understand the constraints of the underlying technology and applications and use these to derive architecture and microarchitecture solutions. Vertical Research Group Page. Students Shayne Wadle Ian McDougall Noah Scott Alumni Michael Davies, PhD, First employment: NVIDIA Vijay Thiruvengadem, PhD, First employment: SimpleMachines Inc. Vinay Gangadhar, PhD, First employment: SimpleMachines Inc. Shunmiao Xu, MS, First employment: SimpleMachines Inc. Alexander Curtis, MS, First employment: Amazon Tony Nowatzki, PhD, First employment: UCLA Newsha Ardalani, PhD, First employment: Baidu Chen-han Ho, PhD, First employment: Qualcomm Sung Jin Kim, PhD, First employment: Oracle Marc de Kruijf, PhD, First employment: Google Emily Blem, PhD, First employment: Google Venkatraman Govindaraju, PhD, First employment: Oracle Raghu Balasubramanian, MS, First employment: Google Jai Menon, MS Shuou Nomura (previously visiting research scholar, now at Toshiba) Amit Kumar, MS, First employment: Intel Jesse Benson, MS, First employment: Microsoft Matt Sinclair, PhD Student UIUC Chris Frericks, MS, First employment: Samsung Eric Harris, MS, First employment: Samsung Ryan Cofell, MS Zachary Marzec, MS, First employment: Qualcomm Preeti Agarwal, MS, First employment: Intel Michael Sartin-Tarm, BS, First employment: startup Garret Staus, BS, First employment: Intel Samuel Wasmundt, BS, PhD Student UCSD Teaching (Teaching evaluations) Spring 2021: CS552 - Introduction to Computer Architecture Fall 2020: CS552 - Introduction to Computer Architecture Spring 2017: CS552 - Introduction to Computer Architecture Fall 2016: CS752 - Advanced Computer Architecture Spring 2016: CS552 - Introduction to Computer Architecture Fall 2015: CS252 - Introduction to Computer Engineering Spring 2014: CS252 - Introduction to Computer Engineering Spring 2013: CS552 - Introduction to Computer Architecture Fall 2012: CS752 - Advanced Computer Architecture Spring 2012: CS252 - Introduction to Computer Engineering Fall 2011: CS758 - Building Microprocessors Spring 2011: CS552 - Introduction to Computer Architecture Fall 2010: CS752 - Advanced Computer Architecture I Fall 2009: CS755 - VLSI Design Spring 2009: CS552 - Introduction to Computer Architecture Fall 2008: CS755 - VLSI Design Spring 2008: CS552 - Introduction to Computer Architecture. Fall 2007: CS752 - Advanced Computer Architecture I. Spring 2007: CS752 - Advanced Computer Architecture I. Education B.Tech - Indian Institute of Technology, Madras, 1999 MS - The University of Texas at Austin, August 2006 PhD - The University of Texas at Austin, December 2006 Bio: Karu Sankaralingam is a Professor at UW-Madison, an Entrepreneur and Inventor and leads the Vertical Research Group. His work has been featured in industry forums of Mentor and Synopsys, and has been covered by the New York Times, Wired, and IEEE Spectrum. He has published over 100 research papers, has graduated 9 PhD students, is an inventor on 21 patents, and 9 award papers. He is a Fellow of IEEE. He is a recipient of the Vilas Faculty Early Career Investigator Award in 2018, Wisconsin Innovation Award in 2016, IEEE TCCA Young Computer Architecture Award in 2012, the Emil H Steiger Distinguished Teaching award in 2014, the Letters and Science Philip R. Certain - Gary Sandefur Distinguished Faculty Award in 2013, and the NSF CAREER award in 2009. He founded SimpleMachines in 2017 which developed chip designs applying dataflow computing to push the limits of AI generality in hardware. In his career, he has led three chip projects: Mozart (16nm, HBM2 based design), MIAOW open source GPU on FPGA, and the TRIPS chip as a student during his PhD. In his research he has pioneered the principles of dataflow computing, focusing on the role of architecture, microarchitecture and the compiler. His research breakthroughs include constraint-theory based compilation for spatial architectures, specialized datapaths that can be dynamically configured, hybrid dataflow von-Neumann execution, modularizing specialization principles to allow programmability while retaining specialization benefits, new dataflow execution models that combine streaming and dataflow, and sampling theory applied to reliable computing. Page last modified on September 08, 2025",
  "content_length": 8454,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:38"
}