{
  "name": "Karthekeyan Chandrasekaran",
  "homepage": "http://karthik.ise.illinois.edu",
  "status": "success",
  "content": "Karthekeyan Chandrasekaran Contact: 301, Transportation Building 104 S. Mathews Ave, Urbana, IL 61801 Phone: 217-300-1160 Email: Click Here PhD Applicants: I highly encourage motivated and hardworking students interested in combinatorial optimization/approximation algorithms/graph theory to apply to UIUC. See links below for more information: - ISE PhD - CS PhD Grad-level courses at UIUC: See here for a list of graduate-level courses that might be of interest to students at UIUC. Karthekeyan Chandrasekaran Associate Professor, Department of Industrial and Enterprise Systems Engineering Affiliate, Department of Computer Science University of Illinois, Urbana-Champaign Research Interests Combinatorial Optimization, Algorithms, Math Programming, Probabilistic Methods Bio B. Tech., Computer Science, IIT Madras Ph.D., Algorithms, Combinatorics and Optimization (ACO), Georgia Tech Postdoc (Simons), Theory of Computation, Harvard Recent sabbatical: Fall 2022: ELTE, Budapest Spring 2023: ICERM Teaching Graduate-level IE 511: Integer Programming - Spring 2015, Spring 2017, Spring 2019, Spring 2021, Spring 2025, Spring 2026 IE 519/CS 586: Combinatorial Optimization - Fall 2015, Spring 2018, Spring 2020, Spring 2024 Undergraduate-level IE 310: Deterministic Models in Optimization - Spring 2016, Fall 2016, Fall 2017, Fall 2018, Fall 2019, Fall 2020, Spring 2022, Fall 2023, Fall 2024 IE 311: Operations Research Lab - Spring 2016, Fall 2016, Fall 2017, Fall 2018 Students PhD Advisees Weihao Zhu Shubhang Kulkarni: May 2025 (Amazon) Thesis: Algorithmic Aspects of Connectivity and Density in Graphs and Hypergraphs Calvin Beideman: Aug 2023 (Instructional Assistant Professor at Texas A&M) Thesis: Cuts and Partitions: Solving, Counting, and Enumerating Weihang Wang: May 2023 (Cadence) Thesis: Algorithms for new objectives in graph partitioning and generalizations Chao Xu: May 2018 (Assistant Professor at UESTC) Thesis: Cuts and Connectivity in Graphs and Hypergraphs (co-advised with Chandra Chekuri) Masters Advisees Sahand Mozaffari, Aug 2021 (Joined Microsoft) Ali Bibak, Aug 2020 (Joined FlexTrade) Victor Sui (BS-MCS), May 2020 (Joined Jump Trading LLC) Undergrad Advisees Richard Bi, May 2025 (Joined as PhD student at CMU) Soham Joshi, May 2025 (Joined Quadeye) Aditya Pillai, May 2020 (Joined as PhD student at Georgia Tech) Jingwen Jiang, May 2016 (Joined as PhD student at University of Chicago) Publications Hedgegraph Polymatroids (with Chandra Chekuri, Weihang Wang, Weihao Zhu) (in submission) [arXiv]| [Abstract] Graphs and hypergraphs combine expressive modeling power with algorithmic efficiency for a wide range of applications. Hedgegraphs generalize hypergraphs further by grouping hyperedges under a color/hedge. This allows hedgegraphs to model dependencies between hyperedges and leads to several applications. However, it poses algorithmic challenges. In particular, the cut function is not submodular, which has been a barrier to algorithms for connectivity. In this work, we introduce two alternative partition-based measures of connectivity in hedgegraphs and study their structural and algorithmic aspects. Instead of the cut function, we investigate a polymatroid associated with hedgegraphs. The polymatroidal lens leads to new tractability results as well as insightful generalizations of classical results on graphs and hypergraphs. {s,t}-Separating Principal Partition Sequence of Submodular Functions (with Kristóf Bérczi, Tamás Király, Daniel P. Szabo) (in submission) [arXiv]| [Abstract] Narayanan and Fujishige showed the existence of the principal partition sequence of a submodular function, a structure with numerous applications in areas such as clustering, fast algorithms, and approximation algorithms. In this work, motivated by two applications, we develop a theory of {s,t}-separating principal partition sequence of a submodular function. We define this sequence, show its existence, and design a polynomial-time algorithm to construct it. We show two applications: (1) approximation algorithm for the {s,t}-separating submodular k-partitioning problem for monotone and posimodular functions and (2) polynomial-time algorithm for the problem of finding an orientation of a hypergraph that simultaneously has strong connectivity at least k and (s,t)-connectivity at least l. Approximating Submodular Matroid-Constrained Partitioning (with Kristóf Bérczi, Tamás Király, Daniel P. Szabo) (in submission) [arXiv]| [Abstract] The submodular partitioning problem asks to minimize, over all partitions P of a ground set V, the sum of a given submodular function f over the parts of P. The problem has seen considerable work in approximability, as it encompasses multiterminal cuts on graphs, k-cuts on hypergraphs, and elementary linear algebra problems such as matrix multiway partitioning. This research has been divided between the fixed terminal setting, where we are given a set of terminals that must be separated by P, and the global setting, where the only constraint is the size of the partition. We investigate a generalization that unifies these two settings: minimum submodular matroid-constrained partition. In this problem, we are additionally given a matroid over the ground set and seek to find a partition P in which there exists some basis that is separated by P. We explore the approximability of this problem and its variants, reaching the state of the art for the special case of symmetric submodular functions, and provide results for monotone and general submodular functions as well. Hypergraph Splitting-Off via Element-Connectivity Preserving Reductions (with Chandra Chekuri, Shubhang Kulkarni) (in submission) [arXiv]| [Abstract] Bérczi, Chandrasekaran, Király, and Kulkarni (ICALP 2024) recently described a splitting-off procedure in hypergraphs that preserves local-connectivity and outlined some applications. In this note, we give an alternative proof via element-connectivity preserving reduction operations in graphs. Minimum Cost Nowhere-Zero Flows and Cut-Balanced Orientations (with Siyue Liu, R. Ravi) International Colloquium on Automata, Languages and Programming (ICALP), 2025. [arXiv]| [Abstract] Flows and colorings are disparate concepts in graph algorithms---the former is tractable while the latter is intractable. Tutte introduced the concept of nowhere-zero flows to unify these two concepts. Jaeger showed that nowhere-zero flows are equivalent to cut-balanced orientations. Motivated by connections between nowhere-zero flows, cut-balanced orientations, Nash-Williams' well-balanced orientations, and postman problems, we study optimization versions of nowhere-zero flows and cut-balanced orientations. Given a bidirected graph with asymmetric costs on two orientations of each edge, we study the min cost nowhere-zero k-flow problem and min cost k-cut-balanced orientation problem. We show that both problems are NP-hard to approximate within any finite factor. Given the strong inapproximability result, we design bicriteria approximations for both problems: we obtain a (6,6)-approximation to the min cost nowhere-zero k-flow and a (k,6)-approximation to the min cost k-cut-balanced orientation. For the case of symmetric costs (where the costs of both orientations are the same for every edge), we show that the nowhere-zero k-flow problem remains NP-hard and admits a 3-approximation. Online Disjoint Spanning Trees and Polymatroid Bases (with Chandra Chekuri, Weihao Zhu) International Colloquium on Automata, Languages and Programming (ICALP), 2025. [arXiv]| [Abstract] Finding the maximum number of disjoint spanning trees in a given graph is a well-studied problem with several applications and connections. The Tutte-Nash-Williams theorem provides a min-max relation for this problem which also extends to disjoint bases in a matroid and leads to efficient algorithms. Several other packing problems such as element disjoint Steiner trees, disjoint set covers, and disjoint dominating sets are NP-Hard but admit an O(logn)-approximation. Calinescu, Chekuri, and Vondrak viewed all these packing problems as packing bases of a polymatroid and provided a unified perspective. Motivated by applications in wireless networks, recent works have studied the problem of packing set covers in the online model. The online model poses new challenges for packing problems. In particular, it is not clear how to pack a maximum number of disjoint spanning trees in a graph when edges arrive online. Motivated by these applications and theoretical considerations, we formulate an online model for packing bases of a polymatroid, and describe a randomized algorithm with a polylogarithmic competitive ratio. Our algorithm is based on interesting connections to the notion of quotients of a polymatroid that has recently seen applications in polymatroid sparsification. We generalize the previously known result for the online disjoint set cover problem and also address several other packing problems in a unified fashion. For the special case of packing disjoint spanning trees in a graph (or a hypergraph) whose edges arrive online, we provide an alternative to our general algorithm that is simpler and faster while achieving the same poly-logarithmic competitive ratio. Scarf's Algorithm on Arborescence Hypergraphs (with Yuri Faenza, Chengyue He, Jay Sethuraman) International Colloquium on Automata, Languages and Programming (ICALP), 2025. [arXiv]| [Abstract] Scarf s algorithm---a pivoting procedure that finds a dominating extreme point in a down-monotone polytope---can be used to show the existence of a fractional stable matching in hypergraphs. The problem of finding a fractional stable matching in a hypergraph, however, is PPAD-complete. In this work, we study the behavior of Scarf's algorithm on arborescence hypergraphs, the family of hypergraphs in which hyperedges correspond to the paths of an arborescence. For arborescence hypergraphs, we prove that Scarf's algorithm can be",
  "content_length": 80438,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:32"
}