{
  "name": "Karthik Desingh",
  "homepage": "https://karthikdesingh.com",
  "status": "success",
  "content": "Karthik Desingh Karthik Desingh contact publications bio Brief Bio: I am an Assistant Professor in the Department of Computer Science and Engineering at the University of Minnesota. I direct the Robotics: Perception and Manipulation (RPM) Lab. Previously, I was a postdoctoral scholar in Paul G. Allen School of Computer Science & Engineering at the University of Washington, where I worked with Prof. Dieter Fox in the Robotics and State Estimation Lab. My research focuses on addressing problems in robot sensing, perception, grasping, manipulation, and navigation. Specifically, I am developing algorithms that can enable a robot to perceive and interact with objects in our environments. My research interests lie primarily in understanding how to impart the intelligence to robots both toward general intelligence and robust intelligence. Broadly I get excited about solving problems in robotics, computer vision and machine learning. I received my Ph.D. in Computer Science and Engineering from the University of Michigan, Ann Arbor. During my Ph.D. I was working in The Laboratory for PROGRESS headed by Prof. Chad Jenkins. Prior to my Ph.D. I completed my Masters in Computer Science from the International Institute of Information Technology, Hyderabad, India, and Brown University. During my time at IIIT-Hyderabad, I was working in the Robotics Research Center headed by Dr K Madhava Krishna and was co-advised by Dr C V Jawahar from Center of Visual Information Technology (CVIT). CV (updated Aug 2025'): Publications & Preprints (Google Scholar): Refer to the RPM Lab webpage for publications after Karthik joined University of Minnesota. Anthony Opipari, Jana Pavlasek, Chao Chen, Shoutian Wang, Karthik Desingh, Odest Chadwicke Jenkins \"DNBP: Differentiable Nonparametric Belief Propagation,\" Published: ACM / IMS Journal of Data Science. 2024. [Bibtex] [Arxiv] [Project page] Aaron Walsman, Muru Zhang, Klemen Kotar, Karthik Desingh, Ali Farhadi, Dieter Fox \"Break and Make: Interactive Structural Understanding Using LEGO Bricks,\" Published: ECCV 2022 [Bibtex] [Arxiv] [Sim-data] [Training-eval code] Wentao Yuan, Chris Paxton, Karthik Desingh, Dieter Fox \"SORNet: Spatial Object-Centric Representations for Sequential Manipulation,\" Published: CoRL 2021 (Oral Presentation, Acceptance 6.5%, Best systems paper finalist). [Bibtex] [Arxiv] [Project page] [Extended project page] [Open Review] Junha Roh, Karthik Desingh, Ali Farhadi, Dieter Fox \"LanguageRefer: Spatial-Language Model for 3D Visual Grounding,\" Published: CoRL 2021 (Acceptance 38.25%). [Bibtex] [Arxiv] [Project page] [Open Review] Anthony Opipari, Chao Chen, Shoutian Wang, Jana Pavlasek, Karthik Desingh, Odest Chadwicke Jenkins \"Differentiable Nonparametric Belief Propagation,\" Preprint: ArXiv 2021. [Bibtex] [Arxiv] [Project page] Jana Pavlasek, Stanley Lewis, Karthik Desingh, Odest Chadwicke Jenkins, \"Parts-Based Articulated Object Localization in Clutter Using Belief Propagation,\" Published: IROS 2020 (Acceptance 47.0%). [Bibtex] [Arxiv] [Video] [Project page] Thomas Cohn, Odest Chadwicke Jenkins, Karthik Desingh, Zhen Zeng, \"TSBP: Tangent Space Belief Propagation for Manifold Learning,\" Published: IEEE Robotics and Automation Letters (RA-L) 2020 [Bibtex] [Paper] [Video] Karthik Desingh, Shiyang Lu, Anthony Opipari, Odest Chadwicke Jenkins, \"Efficient Nonparametric Belief Propagation for Pose Estimation and Manipulation of Articulated Objects,\" Published: Science Robotics Journal May 2019 [Bibtex] [Article] [Media coverage] [FB livecast] Karthik Desingh, Shiyang Lu, Anthony Opipari, Odest Chadwicke Jenkins, \"Factored Pose Estimation of Articulated Objects using Efficient Nonparametric Belief Propagation,\" Published: ICRA 2019 (Acceptance 44.0%). [Bibtex] [Paper] [Arxiv] [Video] Karthik Desingh, Anthony Opipari, Odest Chadwicke Jenkins, \"Pull Message Passing for Nonparametric Belief Propagation,\" Published: ArXiv 2018. [Bibtex] [Arxiv] Zhen Zeng, Yunwen Zhou, Odest Chadwicke Jenkins, Karthik Desingh, \"Semantic Mapping with Simultaneous Object Detection and Localization,\" Published: IROS 2018 (Acceptance 46.7%). [Bibtex] [Arxiv] [Paper] [Video] Sai R. Gouravajhala, Jinyeong Yim, Karthik Desingh, Yanda Huang, Odest Chadwicke Jenkins, Walter S. Lasecki, \"EURECA: Enhanced Understanding of Real Environments via Crowd Assistance,\" Published: In Proceedings of the AAAI Conference on Human Computation (HCOMP 2018). [Bibtex] [Paper] Mehran Maghoumi, Joseph LaViola, Karthik Desingh, Odest Chadwicke Jenkins, \"GemSketch: Interactive Image-Guided Geometry Extraction from Point Clouds,\" Published: ICRA 2018 (Acceptance 40.6%). [Bibtex] [Paper] [Video] [Poster] Nediyana Daskalova, Karthik Desingh, Alexandra Papoutsaki, Diane Schulze, Heather Sha, Jeff Huang, \"Lessons Learned from Two Cohorts of Personal Informatics Self-Experiments,\" Published: UbiComp 2017. [Bibtex] [Paper] Zhiqiang Sui, Lingzhu Xiang, Odest Chadwicke Jenkins, Karthik Desingh, \"Goal-directed Robot Manipulation through Axiomatic Scene Estimation,\" Published: IJRR 2017. [Bibtex] [Paper] [Video] Karthik Desingh, Odest Chadwicke Jenkins, Lionel Reveret, Zhiqiang Sui, \"Physically Plausible Scene Estimation for Manipulation in Clutter,\" Published: Humanoids 2016. [Bibtex] [Paper] [Video] Zhiqiang Sui, Odest Chadwicke Jenkins, Karthik Desingh, \"Axiomatic Particle Filtering for Goal-Directed Robotic Manipulation,\" Published: IROS 2015 (Acceptance 46%). [Bibtex] [Paper] [Video] Karthik Desingh, K Madhava Krishna, Deepu Rajan, C V Jawahar, \"Depth really Matters: Improving Visual Salient Region Detection with Depth,\" Published: BMVC 2013 (Acceptance 30%). [Bibtex] [Paper] Karthik Desingh, Akhil Nagariya, K Madhava Krishna, \"Viewpoint based Mobile Robotic Exploration aiding Object Search in Indoor Environment,\" Published: ICVGIP 2012 (Acceptance 30.5%). [Bibtex] [Paper] [Video] Workshops Wentao Yuan, Chris Paxton, Karthik Desingh, Dieter Fox, \"SORNet: Spatial Object-Centric Representations for Sequential Manipulation,\" ICRA 2022 Workshop on Scaling Robot Learning. [Abstract] [Poster] [Webpage] [Finalist Best Workshop Paper Award] Anthony Opipari, Jana Pavlasek, Chao Chen, Shoutian Wang, Karthik Desingh, Odest Chadwicke Jenkins,, \"Differentiable Nonparametric Belief Propagation,\" ICRA 2022 Workshop on Robotic Perception and Mapping: Emerging Techniques. [Abstract] [Poster] [Slides] [Webpage] [Oral Presentation (2/46)] Wentao Yuan, Chris Paxton, Karthik Desingh, Dieter Fox, \"SORNet: Spatial Object-Centric Representations for Sequential Manipulation,\" RSS 2021 Workshop on Declarative and Neurosymbolic Representations in Robot Learning and Control. [Abstract] [Poster] Aaron Walsman, Muru Zhang, Adam Fishman, Karthik Desingh, Dieter Fox, Ali Farhadi, \"LegoTron: An Environment for Interactive Structural Understanding,\" CVPR 2021 Embodied AI Workshop [Abstract] [Poster] Karthik Desingh, Jana Pavlasek, Cigdem Kokenoz, Odest Chadwicke Jenkins, \"Tracking Large Scale Articulated Models with Belief Propagation for Task Informed Grasping and Manipulation,\" RSS 2019 Workshop: Task-Informed Grasping (TIG-II): From Perception to Physical Interaction. [Extended Abstract] [Poster] [Best Workshop Paper Award] Jana Pavlasek , Karthik Desingh, Odest Chadwicke Jenkins, \"Scene Understanding using Part-Based Object Affordances,\" RSS 2019 Workshop: Women in Robotics. [Abstract] [Poster] Sina Masnadi, Joseph J. LaViola Jr., Jana Pavlasek, Xiaofan Zhu, Karthik Desingh, Odest Chadwicke Jenkins, \"Sketching Affordances for Human-in-the-loop Robotic Manipulation Tasks,\" ICRA 2019 Workshop: 2nd Robot Teammates Operating in Dynamic, Unstructured Environments (RT-DUNE). [Paper] Karthik Desingh, Anthony Opipari, Odest Chadwicke Jenkins, \"Analysis of Goal-directed Manipulation in Clutter using Scene Graph Belief Propagation,\" ICRA 2018 Workshop: Multimodal Robot Perception - Perception, Inference and Learning for Joint Semantic, Geometric and Physical Understanding. [Paper] Karthik Desingh, Mehran Maghoumi, Odest Chadwicke Jenkins, Joseph J. LaViola and Lionel Reveret, \"Object Manipulation in Cluttered Scenes Informed by Physics and Sketching,\" RSS 2016 Workshop: Geometry and Beyond - Representations, Physics and Scene Understanding for Robotics. [Paper] Zhiqiang Sui, Odest Chadwicke Jenkins, Karthik Desingh, \"Axiomatic Scene Estimation for Robotic Manipulation,\" ICRA 2015 Workshop: Robotic Hands, Grasping and Manipulation. Contact Karthik Desingh Department of Computer Science and Engineering University of Minnesota, Minneapolis, MN 55455, USA Mail: kdesingh(At)umn(dot)edu",
  "content_length": 8580,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:31"
}