{
  "name": "Karthik C. S. 0001",
  "homepage": "https://cskarthikcs.github.io",
  "status": "success",
  "content": "Karthik C. S. Home Publications Students Teaching NYC Food Visiting Bangalore Karthik C. S. Biography Karthik C. S. is an Assistant Professor in the Department of Computer Science at Rutgers University supported by a NSF CAREER Award, Simons Foundation Junior Faculty Fellowship, and a grant from the National Science Foundation. He received his Ph.D. in 2019 from Weizmann Institute of Science where he was advised by Irit Dinur and his M.S. in 2014 from École Normale Supérieure de Lyon. He has held postdoctoral appointments at Tel Aviv University (hosted by Amir Shpilka) and New York University (hosted by Subhash Khot). He is broadly interested in complexity theory and discrete geometry with an emphasis on hardness of approximation, fine-grained complexity, and parameterized complexity. Community Service Program Committee: ESA'26, CCC'26, SODA'26, STOC'24, ICDM'24, SODA'24, FSTTCS'23,       UAI'23, ICALP'23, WAOA'22, UAI'22 (Top Reviewer!), ITCS'22, UAI'21, IPEC'21 Co-organizer of DIMACS Special Focus on Fine-Grained Complexity (2024 - 2027) Generously supported by a grant from the National Science Foundation. DIMACS Tutorial on Fine-grained Complexity . DIMACS Workshop on Hardness of Approximation in P . Co-organizer of EnCORE Workshop: Old Questions and New Directions in Theory of Clustering (March 2024) Co-organizer of Dagstuhl Seminar: Parameterized Approximation: Algorithms and Hardness (July 2023) Co-organizer of Rutgers/DIMACS Theory of Computing Seminar (2022 - 2024) A Survey on Approximation in Parameterized Complexity: Hardness and Algorithms Joint work with Andreas Emil Feldmann, Euiwoong Lee, and Pasin Manurangsi. Algorithms, 13(6), 146, 2020. Towards a Unified Framework for Hardness of Approximation in P Talk given in Frontiers of Parameterized Complexity Series Hardness of Approximation meets Parameterized Complexity Lectures given in Parameterized Complexity 301: A Workshop on Parameterized Complexity Lecture 1 Lecture 2 Lecture 3 Hardness of Approximation for Metric Clustering Talk given in The Recent Past and Near Future of Clustering online workshop as part of STOC'21 Hardness of Approximation for Metric Clustering Lectures given in Recent Trends in Algorithms 2022 forum Lecture 1 Lecture 2 Email karthik0112358 \"at\" gmail \"dot\" com karthik \"dot\" cs \"at\" rutgers \"dot\" edu Curriculum Vitae For all Technical/Official purposes, here is an abridged version of my Curriculum Vitae (CV).",
  "content_length": 2438,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:30"
}