{
  "name": "Kartik Gopalan",
  "homepage": "http://www.cs.binghamton.edu/~kartik",
  "status": "success",
  "content": "Page Redirection If you are not redirected automatically, follow this link Kartik Gopalan Professor, Computer Science Binghamton University Biosketch, Google Scholar. OSNET Group CS550 Contact Information Prospective Students: Please feel free to email me with your resume, GPA, and GRE/SAT scores. Undergraduate students can be considered for NSF Research Experience for Undergraduates (REU) program. Current Projects: Multi-Hypervisor Virtual Machines VEE 2016 paper on Ephemeral Virtualization SOCC 2016 Poster Virtual Machine Migration: Agile Live Migration Scatter-Gather Live Migration Gang Migration Virtualization, Privacy, and Security Other Recent Projects Post-Copy VM Migration XenLoop XCo MemX MiNT-2 Selected Recent Publications: (Click here for a complete list) (Google Scholar) Enabling Efficient Hypervisor-as-a-Service Clouds with Ephemeral Virtualization, VEE 2016. Agile Live Migration of Virtual Machines, IPDPS 2016. Scatter-Gather Live Migration of Virtual Machines, In IEEE Transactions on Cloud Computing, September 2015. Privacy-preserving Virtual Machines , ACSAC 2015. Gang Migration of Virtual Machines using Cluster-wide Deduplication, CCGrid 2013. SPARC: A Security and Privacy Aware Virtual Machine Checkpointing Mechanism, ACM CCS Workshop on Privacy in the Electronic Society (WPES) 2011, full paper. Live Gang Migration of Virtual Machines, HPDC 2011. MemX: Virtualization of Cluster-wide Memory, ICPP 2010. XCo: Explicit Coordination to Prevent Network Fabric Congestion in Cloud Computing Cluster Platforms, HPDC 2010. Post-Copy Live Migration of Virtual Machines, SIGOPS Operating Systems Review, 2009. Post-Copy Based Live Virtual Machine Migration Using Adaptive Pre-Paging And Dynamic Self-Ballooning, , VEE 2009. XenLoop : A Transparent High Performance Inter-VM Network Loopback, HPDC 2008. Recent professional service: TPC of ICDCS 2017 TPC of IPDPS 2017 TPC of IEEE Cluster 2017",
  "content_length": 1923,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:34"
}