{
  "name": "Karuna Pande Joshi",
  "homepage": "https://karuna.informationsystems.umbc.edu",
  "status": "success",
  "content": "Karuna Pande Joshi Contact Publications Projects Home LabKnowledge, Analytics, Cognitive and Cloud Lab Affiliations Ebiquity Research UMBC Center for Cybersecurity Center of Excellence in Cyber Systems and Information Assurance, IIT Delhi, India Dr. Karuna Pande Joshi Professor, Information Systems Department, UMBC, Baltimore UMBC Director, Center for Accelerated Realtime Analytics (CARTA) Dr. Karuna Pande Joshi's primary research area is AI/Data Science, Legal Text Analytics, Cloud Computing and Healthcare IT. She is currently developing projects related to Oblivious Cloud and Automating Cloud Legal Documents. She has developed a framework to automate the acquisition and consumption of cloud-based services. She has also worked in collaboration with NIST to develop standards for Cloud Usability. Her research interests also include Big Data analytics, Databases, Web Technologies and Data mining. Dr. Joshi has been awarded research grants by NSF, ONR, DoD, Cisco and GE Research. She was also awarded the NSF I-Corps award and TEDCO MII grant to explore commercial opportunities for her research and has created a start-up on Data Science and Cloud technologies. She received her MS and PhD in Computer Science from UMBC, where she was twice awarded the prestigious IBM PhD Fellowship. She did her Bachelor of Engineering (Computers) from University of Mumbai. Dr. Joshi also has extensive experience of working in the industry primarily as an IT manager. She worked as a Senior Information Management Officer / Project Manager at the International Monetary Fund for nearly a decade. She has also worked for MORENet , Missouri and Silverline Industries Ltd. in India. Her managerial experience includes IT portfolio management, program/project management and change management. She has managed projects across various domains including Databases, Web Content Management, Document Management, Web/Database Integration, Helpdesk Applications, IT Knowledge/Information Management, Facilities Applications and Network/Telecom Applications. Her extensive industrial and research experience provides her a deep understanding of the practical issues faced by organizations that are transitioning or plan to move their IT systems to the Cloud. [CSEE Department] [Information Systems Department]",
  "content_length": 2298,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:35"
}