{
  "name": "Kasper Støy",
  "homepage": "https://pure.itu.dk/portal/en/persons/kasper-stoey(2a9c0934-98ca-4101-b829-b88d77f6487e).html",
  "status": "success",
  "content": "Kasper Støy - IT-University of Copenhagen Kasper Støy Computer Systems Engineering, Ph.D. Professor, Data, Systems, and RoboticsMachine LearningHead of Research Group, Robotics, Evolution, and Art LabThe Maritime Hub https://orcid.org/0000-0003-0179-2487 Emailkstyitudk 20012025 Research activity per year Personal profile CurriculumKasper Stoy is a robotics and embodied artificial intelligence researcher holding a professor position at the Software and Systems Section of the IT University of Copenhagen. He is interested in the construction and design of complete robot systems, but being a computer scientist he has made most of his personal contributions in distributed control of multi-robot systems and modular robotics. He has published more than sixty papers in international conference proceedings or journals and is the author of the book titled \"Self-Reconfigurable Robot: An Introduction\" published by MIT Press. He also co-founded Universal Robots, a company focuses on user-friendly robot arms for industry. He is an active player in the international robot research community and reviews for all major journals and conferences in robotics. He has stayed for extended periods at University of Southern California, Harvard University, University of Tarapacá (Chile), and Seam Reap (Cambodia). He holds a M.Sc. degree in computer science and physics from the University of Aarhus, Denmark (1999) and a Ph.D. degree in computer system engineering from the University of Southern Denmark (2003) where he also worked as assistant professor (2003-2006) and associate professor (2006-2013). He is married and has two kids. KeywordsEmbodied artificial intelligenceRoboticsModular roboticsBio-Inspired roboticsArtificial life Fingerprint Dive into the research topics where Kasper Støy is active. These topic labels come from the works of this person. Together they form a unique fingerprint. 6 Similar Profiles Robot Computer Science 100% EvoBot Keyphrases 21% Open Source Computer Science 20% Affective Robotics Keyphrases 19% Microbial Fuel Cell Keyphrases 15% Liquid Handling Robot Keyphrases 12% Modular Robots Keyphrases 11% Robotic Platform Keyphrases 11% View full fingerprint Collaborations and top research areas from the last five years Recent external collaboration on country/territory level. Dive into details by clicking on the dots or Select a country/territory from the list Dive into details Select a country/territory to view shared publications and projects Close Select a country/territory from the list Explore network further Research output Research output per year 2001 2002 2008 2009 2010 2011 2012 2015 2016 2017 2021 2024 2025 21 Article in proceedings 19 Other contribution 17 Journal article 16 Paper 28 More 10 Book chapter 9 Conference abstract for conference 4 Conference article 2 Book 2 Patent 1 Editorial Research output per year Research output per year Swarm-inspired controllers: a comparative study of decentralized behaviors for distributed manipulation surfacesBessone, N., Stoy, K. & Zahadat, P., 7 Oct 2025, In: Swarm Intelligence. 14987, p. 273-293 21 p.Research output: Journal Article or Conference Article in Journal › Journal article › Research › peer-review Open Access Synthetic emotions and Gamification: Exploring Engagement Strategies for Small Social Robots in different age-groupsFrederiksen, M. R. & Støy, K., 6 Jan 2025.Research output: Contribution to conference - NOT published in proceeding or journal › Paper › Research Synthetic Emotions 100% Emotional Engagement 100% Preference Assessment 100% Emotional Expressiveness 100% Sustained Performance 50% Decentralized Control of Distributed Manipulators: An Information Diffusion Approach.Bessone, N., Zahadat, P. & Støy, K., 2024, AAMAS. p. 2156-2158 3 p.Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Information Diffusion 100% Manipulator 100% Decentralized Control 100% Diffusion Approach 100% Self-organization 33% Neural Cellular Automaton for Decentralized Inference in Distributed Manipulation Systems.Bessone, N., Zahadat, P. & Støy, K., 19 Nov 2024, PAAMS. Springer Nature Switzerland, p. 61-72 12 p. (Lecture Notes in Computer Science, Vol. 15157).Research output: Conference Article in Proceeding or Book/Report chapter › Article in proceedings › Research › peer-review Manipulation System 100% Decentralized Inference 100% Cellular Automata 100% Actuator 100% Sensing Agent 50% Swarm-Inspired Controller: An Inference-Free Approach to Distributed ManipulationBessone, N., Stoy, K. & Zahadat, P., 15 Sept 2024, Swarm Intelligence. ANTS 2024. Springer Nature Switzerland, Vol. 14987. p. 168-180 12 p. (Lecture Notes in Computer Science, Vol. 14987).Research output: Conference Article in Proceeding or Book/Report chapter › Book chapter › Research › peer-review Open AccessFile Organization Capability 100% Independently Controllable 100% Planar Manipulator 100% Contact Point 100% Decentralized Controller 100% View all 101 research outputs Projects Projects per year 2014 2014 2015 2020 2021 2022 2024 2025 2026 3 Active 6 Finished Projects per year Pushing the limit of robotics cognitionStøy, K. (PI) & Zahadat, P. (CoI)Danish Agency for Higher Education and Science24/08/2021 → 21/10/2021Project: Research Robotic Cognition 100% MUHMI-MOZART: Multimodal Human-Machine Interfaces for Morphing Computerized Mats with Embodied Sensing and Artificial IntelligenceStøy, K. (PI), Faina, A. (CoI), Garcia, R. M. (Collaborator), Zahadat, P. (CoI), Bessone, N. H. (Collaborator), Dacre, B. (Collaborator) & Ingle, P. S. (Collaborator)European Commission01/03/2024 → 30/09/2026Project: Research Human-robot Interaction 100% Human Robot Interaction 100% Wolfgang Amadeus Mozart 50% Distributed Manipulation 50% Multimodal Interfaces 50% EVOBLISS: Technological Evolution of Synergy Between Physicochemical and Living SystemsStøy, K. (PI), Faina, A. (CoI), Nejatimoharrami, F. (CoI), Lambertsen, J. (CoI) & Schmidt, M. (CoI)European Commission01/02/2014 → 31/01/2018Project: Research Robot 100% Technological Evolution 66% Living Technology 66% Living Systems 66% Microbial Fuel Cell 66% Modular RobotsStøy, K. (PI), Ibsen, P. (Admin) & Jensen, J. K. (CoI)01/05/2025 → 31/08/2025Project: Innovation DEEP: Deep neural network based physical response prediction using correlated patterns in dynamic sensor input for adaptive robotsFrederiksen, M. R. (PI) & Støy, K. (CoI)Independent Research Fund Denmark01/04/2022 → 01/04/2024Project: Research Tactile Communication 100% Audio-tactile 100% Detection Efficiency 100% Physical Response 100% Audiovisual Communication 100% View all 9 projects Press/Media Fremtiden stadig uvis for konkursramt robotvirksomhedStøy, K. & Faina, A.05/03/20251 Media contributionPress/Media: Press / Media Robotvirksomhed går konkurs: Har tabt mere end 100 millionerStøy, K. & Faina, A.28/02/20251 Media contributionPress/Media: Press / Media SDU-robot slanger sig frem ved hjælp af origamiStøy, K.25/02/20241 Media contributionPress/Media: Press / Media Robot slanger sig fremad ved hjælp af origamiStøy, K.24/02/20241 Media contributionPress/Media: Press / Media KUNSTIG INTELLIGENS FLYTTER IND HOS NOVO NORDISK - algoritme tjekker 600 glas diabetesmedicin i minuttetStøy, K.16/04/20231 Media contributionPress/Media: Press / Media View all 101 press/media Datasets Self-Organized Construction with Continuous Building Material: Higher Flexibility based on Braided StructuresHeinrich, M. K. (Creator), Wahby, M. (Creator), Divband Soorati, M. (Creator), Hofstadler, D. N. (Creator), Zahadat, P. (Creator), Ayres, P. (Creator), Støy, K. (Creator) & Hamann, H. (Creator), ZENODO, 24 Jul 2016DOI: 10.5281/zenodo.58524, https://zenodo.org/record/58524Dataset Prizes Winner of the 2017 Virtual Creatures Competition at GECCO 2017Veenstra, F. (Recipient), Faina, A. (Recipient), Støy, K. (Recipient) & Risi, S. (Recipient), 19 Jul 2017Prize: Prizes, scholarships, distinctions Winner of Virtual Creature Competition at GECCO 2017Veenstra, F. (Recipient), Faina, A. (Recipient), Støy, K. (Recipient) & Risi, S. (Recipient), 15 Jul 2017Prize: Prizes, scholarships, distinctions GECCO 100% Modular Robots 100% Activities Activities per year 2023 2023 2024 2024 3 Membership in review committee Activities per year Assessment committee for recruitment of full professorship in Statistics and Machine Learning (Event)Støy, K. (Chair), Hutton, J. (Member) & Hansen, N. R. (Member)1 Nov 2023 → 1 Feb 2024Activity: Membership types › Membership in review committee Assessment committee for recruitment of professor in Statistics and Machine Learning (Event)Støy, K. (Chair), Hutton, J. (Member) & Hansen, N. R. (Member)22 Aug 2023 → 31 Dec 2023Activity: Membership types › Membership in review committee Hiring committee for recruitment of assistant professor in therapeutic and affective robotics (Event)Sestoft, P. (Chair), Støy, K. (Member) & Kulyk, O. (Member)12 Mar 2024 → 1 May 2024Activity: Membership types › Membership in review committee",
  "content_length": 9058,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:40"
}