{
  "name": "Kasper Bonne Rasmussen",
  "homepage": "http://www.cs.ox.ac.uk/people/kasper.rasmussen",
  "status": "success",
  "content": "Kasper Rasmussen | Department of Computer Science Skip to main content University of Oxford Department of Computer Science HomeAbout UsPeopleFacultyKasper RasmussenKasper Rasmussen Professor Kasper Rasmussen Professor of Computer Science (Information Security)Governing Body Fellow, Kellogg CollegeE: firstname.lastname@cs.ox.ac.ukT: +44 (0)1865 610769K: PGP Key Department of Computer Science, Robert Hooke Building, Room 115Directions Postal AddressThemes:SecurityCompleted Projects:AA-SAFEInterests Kasper Rasmussen is a full Professor in the Computer Science Department. He joined University of Oxford in 2013 and in 2015 was awarded a University Research Fellowship from the Royal Society in London. Kasper Rasmussen completed his masters degree in Computer Science (Information technology and Mathematics) from the Technical University of Denmark (DTU) in December 2005. His masters thesis was on optimization of path protection in circuit switched networks. Kasper did his Ph.D. with prof. Srdjan Capkun at the Department of Computer Science at ETH Zurich. During his Ph.D. he worked mainly on security issues relating to secure time synchronization and secure localization with a particular focus on distance bounding. After completing his Ph.D., Kasper worked as a post-doc at University of California, Irvine, with Prof. Gene Tsudik. A list of current research interests can be found bellow. Security of Wireless Networks Protocol design Applied Cryptography Security of embedded systems Cyber-physical systems Selected PublicationsView AllManage publications Ripple: Software−Only Detection of Signal Injection Attacks in Drone Temperature Sensors Milad Rezaee‚ Sebastian Köhler and Kasper Rasmussen In 18th ACM Conference on Security and Privacy in Wireless and Mobile Networks (WiSec). June, 2025. Details about Ripple: Software−Only Detection of Signal Injection Attacks in Drone Temperature Sensors | BibTeX data for Ripple: Software−Only Detection of Signal Injection Attacks in Drone Temperature Sensors | Download (pdf) of Ripple: Software−Only Detection of Signal Injection Attacks in Drone Temperature Sensors Iris: Dynamic Privacy Preserving Search in Authenticated Chord Peer−to−Peer Networks Angeliki Aktypi and Kasper Rasmussen In Proceedings of the 32nd Annual Network and Distributed System Security Symposium (NDSS '25). February, 2025. Details about Iris: Dynamic Privacy Preserving Search in Authenticated Chord Peer−to−Peer Networks | BibTeX data for Iris: Dynamic Privacy Preserving Search in Authenticated Chord Peer−to−Peer Networks | Download (pdf) of Iris: Dynamic Privacy Preserving Search in Authenticated Chord Peer−to−Peer Networks | DOI (10.14722/ndss.2025.240392) Basilisk: Remote Code Execution by Laser Excitation of P−N Junctions Without Insider Assistance Joe Loughry and Kasper Rasmussen In In 18th USENIX WOOT Conference on Offensive Technologies (WOOT). August, 2024. Details about Basilisk: Remote Code Execution by Laser Excitation of P−N Junctions Without Insider Assistance | BibTeX data for Basilisk: Remote Code Execution by Laser Excitation of P−N Junctions Without Insider Assistance | Download (pdf) of Basilisk: Remote Code Execution by Laser Excitation of P−N Junctions Without Insider Assistance ActivitiesSoftware EngineeringSoftware and Systems SecuritySecuritySystems SecurityCyber Security Oxford Current Students Behrad AhmadpourBryan KumaraMilad  Rezaee Barzani Past Students Angeliki AktypiThomas BurtonMunir GedenIlias GiechaskielLukáš HalgašHayyu ImandaChristy Kin-CleavesMarc RoeschlinMatthew RogersBeatrix SirurWil  TengYouqian Zhang Past Researcher Simon EberzAbout UsPeopleFacultyResearchStudentsProfessional ServicesVisiting ProfessorsEmeritus FacultyAssociate MembersVacanciesWomen in the departmentEquality, diversity and inclusionSupport UsOur HistoryContact Us Back to Top",
  "content_length": 3850,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:37"
}