{
  "name": "Kassem Fawaz",
  "homepage": "https://kassemfawaz.com",
  "status": "success",
  "content": "Kassem Fawaz Kassem M. Fawaz Associate Professor Associate Chair for Research Electrical and Computer Engineering Computer Sciences (Affiliate) University of Wisconsin - Madison Office 3539 Engineering Hall 1415 Engineering Dr. Madison, WI 53706 Phone (608) 890-0529 Kassem M. Fawaz Associate Professor Associate Chair for Research Electrical and Computer Engineering Computer Sciences (Affiliate) University of Wisconsin - Madison I am an associate professor in the ECE Department at the University of Wisconsin - Madison, where I am also affiliated with the Computer Sciences Department. I serve as ECE's inaugural associate chair for research. I received my Ph.D. from the CSE department at the University of Michigan. I currently lead my own research group: WI-PI. My research interests primarily include the security and privacy for users interacting with their devices, with emphasis on voice interfaces, privacy policies, malware detection, data privacy, and wireless security and privacy. My overall research objective is to bring effective, practical, and usable security and privacy protection to the masses especially in the emerging computing paradigm of the Internet of Things. In the past, I made research contributions to software systems as well as wireless communications and networks. Email Me Download CV WI-PI Current Projects User-centered Privacy We develop more intuitive and user-friendly methods to provide users with privacy awareness and controls. Throughout this research, we have developed systems to analyze and present privacy policies [USENIX Sec. 2018], online privacy settings [USENIX Sec. 2021], and cookie notices [Arxiv 2022]. We have also investigated privacy controls for always-listening voice assistants [USENIX SOUPS 2021], social robots [ACM/IEEE HRI 2021], and video conferencing apps [PETS 2022]. Security and Privacy of Machine Learning Systems We analyze the security and privacy properties of systems that leverage machine learning to serve end users. Throughout this research, we have investigated Face recognition [PETS 2021, Arxiv 2022], image classification [ICML 2022], keyword spotting [USENIX Sec. 2022], speaker identification [Arxiv 2022], and skill squatting [IMWUT 2022]. Data and Sensor Privacy We design privacy preserving mechanisms to protect end users from pervasive data collection. These mechanisms are theoretically founded, practical to deploy, and usable. Throughout this research, we have developed mechanisms that target eye tracking [USENIX Sec. 2021], speech recognition [USENIX Sec. 2020], and acoustic sensing [PETS 2019]. User Authentication We design user authentication mechanisms that leverage commodity devices and sensors to provide strong security properties. Throughout this research, we have developed mechanisms for challenge-response biometric authentication [ACM CCS 2019], pedestrian-vehicle authentication [CPSIoTSec 2021], and device-to-device pairing [IMWUT 2022]. Students Graduate Students Ashish Hooda Asmit Nayak Ben Jacobsen Guruprasad Ramesh Jackson West Rishabh Khandelwal Shirley Zhang Yash Wani Yucheng Yang Postdoctoral Fellow Harrison Rosenberg Awards 2022 - Emil Steiger Teaching Award 2021 - Facebook Towards Trustworthy Products in AR, VR, and Smart Devices Award 2021 - Benjamin Smith Reynolds Award for Excellence in Teaching 2020 - Google Android Security and PrIvacy REsearch (ASPIRE) Award. 2020 - ECE Grainger Faculty Scholarship Award. 2020 - NSF CAREER Award 2019 - The Caspar Bowden Award for Outstanding Research in Privacy Enhancing Technologies",
  "content_length": 3561,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:39"
}