{
  "name": "Kasthuri Jayarajah",
  "homepage": "https://kjayarajah.github.io",
  "status": "success",
  "content": "Kasthuri Jayarajah Kasthuri Jayarajah Assistant Professor New Jersey Institute of Technology Office: GITC 4204 Research AreasMobile and Ubiquitous ComputingArtificial Intelligence of ThingsHuman-Autonomy Teaming CV Research Statement NEWS 08/2025Paper on gaze-based memorability prediction accepted at ICDM'25. Congrats, Indrajeet! 07/2025Invited to serve on the IEEE PerCom'26 TPC 06/2025Happy to receive seed funding with Shelly Levy-Tzedek (BGU) for work on reinforcement learning for social robots. 03/2025I'll be serving as Associate Editor for IROS'25. 01/2025Two papers accepted at the Human-Centered Computational Sensing workshop co-located with PerCom'25. Congratulations, Mayooran and Indrajeet! 10/2024Two papers accepted on using EEG for practical applications circumventing challenges around noise and low spatial resolution at CODS-COMAD'24 and EAI Mobiquitous'24. Congratulations, Indrajeet and co-authors at UMBC and ARL DEVCOM! 09/2024I'll be serving on the TPC of IEEE PerCom'25 and ACMHotMobile'25, and co-chairing the EWSN Journal Track. Pls consider submitting! 08/2024Happy to organize the Phd Forum and the EDGE-Well workshop@Percom'25 with Shahriar, Sougata, Sourav, and Dheryta! 06/2024Paper titled \"GestRight: Understanding the Feasibility of Gesture-driven Tele-Operation in Human-Robot Teams\" accepted at IEEE/RSJ IROS'24. Congratulations, Kevin! 04/2024Happy to receive seed funding with Shelly Levy-Tzedek at BGU for our collaborative project on \"Improving the Effectiveness of Socially Assistive Robots through Wearable Sensing\". Thank you, Institute for Future Technologies! 03/2024I'll be serving as Associate Editor for IROS'24. 03/2024Paper titled \"ARSFineTune: On-The-Fly Tuning of Vision Models for Unmanned Ground Vehicles\" accepted at IEEE DCOSS-IOT'24. Congratulations, Masud, Zahid, and co-authors at UMBC and ARL! 02/2024Demo titled \"Attention and Mobility-Aware On-Device Perception for Mobile Augmented Reality\" accepted at ACM HotMobile'24. Congratulations, Mayooran! 11/2023I'll be serving on the TPC of MobiSys'24, EWSN'24 and IWQoS'24. Please consider submitting! 09/2023I've joined NJIT as an assistant professor in the dept. of CS. 06/2023Happy to mentor the second cohort of Maryland Robotics Center-ARL Summer interns along with Sean Gart (ARL)! 02/2023Our work on gesture-controlling robots was featured in Baltimore CBS News/WJZ Tv! 12/2022Our paper \"AirDrop: Towards Collaborative, Multi-Resolution Air–Ground Teaming for Terrain-Aware Navigation\" was accepted at ACM HotMobile'23! 08/2022Our vision for highly interactive, attention-sharing human-drone teams will be presented at SmartWear co-located with ACM MobiCom'22! 05/2022Happy to mentor the MRC-ARL Summer Student Team Research on \"Air-deploying Legged Robots\" along with Sean Gart (ARL), at UMBC this summer! 12/2021Our work on retrofitting vision DNNs to enable lightweight collaborative intelligence has been accepted to IEEE INFOCOM'22! 11/2021I've joined UMBC as a research faculty. 10/2021I'll be serving on the MobiSys'22 Program Committee. Please consider submitting your work (Deadline 20th Dec)! 02/2021I'll be speaking at the Voices of Data Science conference organized by UMass, Amherst. Join us here! 01/2021I'll be serving as a Student Volunteer Co-Chair for UbiComp'21 and Web Co-Chair for MobiSys'21! 12/2020Our paper titled \"The Role of Group Cohesiveness in Targeted Mobile Promotions\" has been accepted to the Journal of Business Research (Special Issue on Mobile Applications)! 10/2020I've been selected to participate in the EECS Rising Stars Early Career Workshop, hosted by UCBerkely, this year! 07/2020I'm teaching COR1305 Spreadsheet Modeling and Analytics (formerly, Computer as an Analysis Tool) this Fall! 01/2020I'll be on leave till 06/20 (baby on the way!). 12/2019Our paper titled \"\"Five Challenges in Cloud-Enabled Intelligence and Control\" was accepted to the ACM Trans. on Internet Technology. 09/2019I was named a Finalist for the Gaetano Borrielo Outstanding Student Award at UbiComp'19. 06/2019Our paper titled \"Inferring Accurate Bus Trajectories from Noisy Estimated Arrival Time Records\" was accepted to IEEE ITSC 2019. 05/2019Our paper titled \"Resilient Collaborative Intelligence for Adversarial IoT Environments\" was accepted to FUSION 2019. 02/2019Our paper titled \"BuSCOPE : Fusing Individual & Aggregated Mobility Behaviorfor \"Live\" Smart City Services\" was accepted to MobiSys 2019. 10/2018Our paper titled \"Predicting Episodes of Non-Conformant Mobility in Indoor Environments\" was accepted to IMWUT, Vol.2, Issue 4, 2018. 08/2018Our paper titled \"Exploiting the Interdependency of Land Use and Mobility for Urban Planning\" was accepted to the 7th International Workshop on Pervasive Urban Applications (PURBA), co-located with UbiComp'18. 08/2018Our paper titled \"The Role of Urban Mobility on Retail Business Survival\" was accepted to IMWUT, Vol.2, Issue 3, 2018. 07/2018I've been awarded the SMU Multidisciplinary Doctoral Fellowship for the academic year 2018-2019. 10/2017We are one of the top 5 teams in the DataSpark Open Task Mobility Challenge Finals of the CIKM AnalytiCup !. 08/2017Invited to talk at the Computer Laboratory of the University of Cambridge on the topic of \"Understanding Urban Events with CrowdSourced Data\". 07/2017Won the Google Women Techmakers Scholarship. 07/2017Attending the Urban Analytics Data Dive at the Alan Turing Institute in London. 07/2017Our working paper titled \"Role of Group Cohesiveness in Consumers' Responses to Mobile Promotions\" was accepted to the Association of Consumer Research Conference, 2017. 05/2017Our proposal on leveraging multi-modal sensors for city-scale event detection is through to the Semi Finals at the CIKM AnalytiCup 2017 - Mobility Challenge! 05/2017I've been invited to the TPC of the ACM S3 Workshop. Consider submitting! 05/2017I'm spending this Summer at the Computer Laboratory in University of Cambridge. 08/2016I'm spending this Fall at CMU's Human-Computer Interaction Institute. 05/2016Our paper titled \"Can Instagram Posts Help Characterize Urban Micro-Events?\" was accepted to FUSION 2016. 05/2016Our paper titled \"Fusing WiFi and Video Sensing for Accurate Group Detection in Indoor Spaces\" was accepted to the 3rd Intl' Workshop on Physical Analytics (co-located with MobiSys 2016). 03/2016Our paper titled \"LiveLabs: Building In-Situ Mobile Sensing & Behavioural Experimentation TestBeds\" was accepted to MobiSys 2016. 03/2016We are organizing the first ever Women's Workshop at MobiSys'16! EXPAND ALL SECTIONS COLLAPSE ALL SECTIONS Introduction I'm recruiting PhD students to work with me, drop me a note if you're interested in mobile computing, IoT and autonomous systems! I'm an Assistant Professor in the Department of Computer Science at New Jersey Institute of Technology. My core research interests lie in the areas of mobile and ubiquitous sensing, deep learning for IoT and the edge, mobility-driven urban analytics and predictive cyber-physical systems. In my most recent work, I’m exploring the concept of \"Collaborative AI-based sense-making\" for resource-limited edge devices (e.g., infrastructural cameras, autonomous systems, wearable computers, etc.) where groups of sensors, due to their proximity and shared perspectives of the sensed environment, can cooperate for performance benefits. Previously, I explored the use of localization technology in improving the operations of built environments, both at the indoor-scale and city scale. I have worked on a variety of predictive urban applications (e.g., predicting non-conformant behavior, mobility-on-demand simulations/public transportation, consumer marketing and retail survivability), building on both social and behavioral insights derived from individual and group mobility. Publications Selected Publications All Publications» IEEE/RSJ IROS'24 K. Rippy, A. Gangopadhyay and K. Jayarajah, \"GestRight: Understanding the Feasibility of Gesture-driven Tele-Operation in Human-Robot Teams\", To Appear in the 2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (Oral) DCOSS-IoT'24 Ahmed, M., Hasan, Z., Faridee, A. Z. M., Anwar, M. S., Jayarajah, K., Purushotham, S., ... & Roy, N. , \"ARSFineTune: On-the-Fly Tuning of Vision Models for Unmanned Ground Vehicles\", Proc. of 20th International Conference on Distributed Computing in Smart Systems and the Internet of Things. Book Chapter Gokarn, I., Jayarajah, K., Misra, A. (2023). Lightweight Collaborative Perception at the Edge. In: Srivatsa, M., Abdelzaher, T., He, T. (eds) Artificial Intelligence for Edge Computing. Springer, Cham. PDF IEEE MASS'23 M. S. Anwar, E. Dey, M. Devnath, I. Ghosh, N. Khan, J. Freeman, T. Gregory, N. Suri, K. Jayarajah, S. Ramamurthy, N. Roy, \"HeteroEdge: Addressing Asymmetry in Heterogeneous Collaborative Autonomous Systems\", To Appear in the 20th IEEE International Conference on Mobile Ad-Hoc and Smart Systems. PDF ACM HotMobile'23 Kasthuri Jayarajah, Sean Gart, Aryya Gangopadhyay, \"AirDrop: Towards Collaborative, Multi-Resolution Air-Ground Teaming for Terrain-Aware Navigation\", Proceedings of the 24th International Workshop on Mobile Computing Systems and Applications. PDF MobiCom Workshops'22 Kasthuri Jayarajah, Aryya Gangopadhyay, Nicholas Waytowich, \"TagTeam: Towards Wearable-Assisted, Implicit Guidance for Human–Drone Teams\", SmartWear Workshop co-located with ACM MobiCom'22. Preprint IEEE INFOCOM'22 Kasthuri Jayarajah, Dhanuja Wanniarachchige, Tarek Abdelzaher, Archan Misra, \"ComAI: Enabling Lightweight Collaborative Intelligence by Retrofitting Vision DNNs\", IEEE INFOCOM 2022. JBR'21 Reetika Gupta, Sourjo Mukherjee, Kasthuri Jayarajah, \"The Role of Group Cohesiveness in Targeted Mobile Promotions\",Journal of Business Research, Volume 127, April 2021, Pages 216-227. PDF ACM TOIT'20 Tarek Abdelzaher, Yifan Hao, Kasthuri Jayarajah, Archan Misra, Per Skarin, Shuochao Yao, Dulanga Weerakoon, Karl-Erik Årzen, \"Five Challenges in Cloud-Enabled ",
  "content_length": 14812,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:38"
}