{
  "name": "Kasturi R. Varadarajan",
  "homepage": "http://homepage.cs.uiowa.edu/~kvaradar",
  "status": "success",
  "content": "Kasturi R. Varadarajan Professor Department of Computer Science 101D, Maclean Hall The University of Iowa Iowa City, IA 52242-1419, USA Phone: (319) 335-0732 FAX: (319) 335-3624 Research Interests In principle, all of theoretical computer science. In practice, a subset that includes primarily parts of computational geometry, but also optimization problems on graphs and the like and polynomial time computability of equilibria in games and some economic models. A selection of some papers that I have placed online should give a better idea. For a more complete list, check out DBLP's list of my publications. Former Students Benton McCune, Erik Krohn, Matt Gibson, Gaurav Kanade, Xin Xiao, Santanu Bhowmick, Sayan Bandyapadhyay, Tanmay Inamdar Current Students No PhD students at the moment Prospective Students If you are a CS student here at the UI who is considering working with me, you should read this. Teaching In Fall 2020, I am teaching undergraduate algorithms (CS:3330). The material is all within ICON, I am not able to maintain a public webpage. Courses I have taught since Spring 2005: Design and Implementation of Algorithms: Spring 2020, Spring 2019 Theory of Computation: Fall 2018 , Fall 2019 Design and Analysis of Algorithms: Spring 2018 , Spring 2017 , Spring 2014, Spring 2013 , Spring 2012 , Fall 2008 , Fall 2006 , Spring 2006 . Limits of Computation: Fall 2015 , Spring 2015, Spring 2005 Computational Geometry: Spring 2020, Spring 2013, Spring 2007 Algorithmic Excursions: Spring 2016 Computing Equilibria in Markets and Games: Fall 2005 Algorithms: Fall 2017, Fall 2014 , Spring 2012 , Spring 2011 , Fall 2010 , Fall 2008, Fall 2007 Data Structures: Fall 2013, Fall 2012, Fall 2011, Spring 2010 , Fall 2009 , Spring 2009 Office Hours (Fall 2020) 2:30--4:00 Mon, 1:00--2:30 Tue. Email me for Zoom Info. Kasturi Varadarajan ( firstname-lastname AT uiowa DOT edu )",
  "content_length": 1891,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:41"
}