{
  "name": "Katarzyna E. Paluch 0001",
  "homepage": "http://www.ii.uni.wroc.pl/~abraka",
  "status": "success",
  "content": "Katarzyna Paluch- homepage Katarzyna Paluch About me PhD in 2005. Habilitation in 2017. Currently associate professor at the Institute of Computer Science, University of Wroclaw. Papers Rectangle Tiling Co-author: Krzysztof Lorys. APPROX 2000, 206-213 New approximation algorithm for RTILE problem. . Co-author: Krzysztof Lorys Theor. Comput. Sci. 2-3(303): 517-537 (2003) Rank-maximal matchings. Co-authors: Robert W. Irving, Telikepalli Kavitha, Kurt Mehlhorn, Dimitrios Michail SODA 2004: 68-75 Strongly Stable Matchings in Time O(nm) and Extension to the Hospitals-Residents Problem. Co-authors: Telikepalli Kavitha, Kurt Mehlhorn, Dimitrios Michail. STACS 2004: 222-233 A Faster Algorithm for Minimum Cycle Basis of Graphs. Co-authors: Telikepalli Kavitha, Kurt Mehlhorn, Dimitrios Michail. ICALP 2004: 846-857 A 17/8-Approximation Algorithm for Rectangle Tiling. ICALP 2004: 1054-1065 A New Approximation Algorithm for Multidimensional Rectangle Tiling. ISAAC 2006: 712-721 Rank-maximal matchings. Co-authors: Robert W. Irving, Telikepalli Kavitha, Kurt Mehlhorn, Dimitrios Michail ACM Transactions on Algorithms 2(4): 602-610 (2006) Strongly stable matchings in time O(nm) and extension to the hospitals-residents problem. Co-authors: Telikepalli Kavitha, Kurt Mehlhorn, Dimitrios Michail. ACM Transactions on Algorithms 3(2): (2007) An O(m^{2}n) Algorithm for Minimum Cycle Basis of Graphs. Co-authors: Telikepalli Kavitha, Kurt Mehlhorn, Dimitrios Michail. Algorithmica 52(3): 333-349 (2008) A 7/9 - Approximation Algorithm for the Maximum Traveling Salesman Problem. Co-authors: Marcin Mucha, Aleksander Madry CoRR abs/0812.5101: (2008), APPROX-RANDOM 2009: 298-311 Faster and simpler approximation of stable matchings. CoRR abs/0911.5660, WAOA 2011, Algorithms Popular and clan-popular b-matchings. ISAAC 2012, Theoretical Computer Science Capacitated Rank-maximal Matchings. CIAC 2013 A combinatorial algorithm for two matchings: fair and maximum rank-maximal. Manuscript. Simpler Approximation of the Maximum Asymmetric Traveling Salesman Problem. Co-authors: Khaled Elbassioni, Anke van Zuylen. STACS 2012 Better Approximation Algorithms for Maximum Asymmetric Traveling Salesman and Shortest Superstring. arXiv:1401.3670 [arXiv] Maximum ATSP with Weights Zero and One via Half-Edges. arXiv:1408.1431 [arXiv] WAOA 2015, journal version: [TOCS] Balanced matchings, unbalanced ones and related problems. CTW 2015 Characterisation of Strongly Stable Matchings. Co-authors: Adam Kunysz, Pratik Ghosal arXiv:1506.00677 [arXiv] SODA 2016 A 4/5-Approximation Algorithm for the Maximum Traveling Salesman Problem. Co-authors: Szymon Dudycz, Jan Marcinkowski, Bartosz Rybicki arXiv: [arXiv] IPCO 2017 The Dynamics of Rank-Maximal and Popular Matchings. Co-authors: Pratik Ghosal, Adam Kunysz arXiv: [arXiv] Optimal General Matchings. Co-author: Szymon Dudycz arXiv: [arXiv] WG 2018 Manipulation Strategies for the Rank-Maximal Matching Problem. Co-author: Pratik Ghosal COCOON 2018 New approximation algorithms for (1,2)-TSP. Co-authors: Anna Adamaszek and Matthias Mnich ICALP 2018 Rectangle tiling binary arrays. Co-authors: Pratik Ghosal and Syed Mohammas Meesum arXiv: [arXiv] A simple combinatorial algorithm for restricted 2-matchings in subcubic graphs - via half-edges. Co-author: Mateusz Wasylkiewicz [IPL], arXiv New approximation algorithms for maximum asymmetric traveling salesman and shortest superstring. [arXiv] - this is a simpler but weaker version of [17], a fully detailed [17] would be significantly longer than this weaker version. Restricted t-matchings via half-edges. Co-author: Mateusz Wasylkiewicz [ESA-2021] Clique-free t-matchings in degree-bounded graphs. Co-author: Mateusz Wasylkiewicz Submitted. PhD thesis [ps] Research interests approximation algorithms graphs combinatorial optimisation Scientific involvements ESA 2008 STACS 2013 MFCS 2016 EuroCG 2020 MATCH-UP 2022 Current NCN research grant \"Combinatorial optimization through the lens of the traveling salesman route and matchings\" Previous NCN research grant \"Efficient approximation algorithms for finding optimal traveling salesman tours and related problems\" Current PhD students: Szymon Dudycz and Mateusz Wasylkiewicz Past PhD students: Pratik Ghosal (PhD 2020), Adam Kunysz (PhD 2021) MC member of COST Action IC1205 on Computational Social Choice Teaching (in Polish) Office hours Po uzgodnieniu przez e-mail. Addresses and telephones Institute of Computer Science University of Wroclaw ul. Joliot-Curie 15, room 304 50383 Wroc³aw phone: (+48)71-37-57-821 email: abraka at cs dot uni dot wroc dot pl",
  "content_length": 4603,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:43"
}