{
  "name": "Katayoun Farrahi",
  "homepage": "https://www.ecs.soton.ac.uk/people/kf2u17",
  "status": "success",
  "content": "Doctor Kate Farrahi | University of Southampton Skip to main content Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Subjects PhDs and research degrees Create your own research project Find a PhD project Funding your research degree How to apply for a PhD or research degree How to make a PhD enquiry Support while studying your PhD or research degree Exchanges and studying abroad Undergraduate study Undergraduate degree courses Foundation year programmes Undergraduate tuition fees Customise your degree Funding undergraduate studies How to apply Application advice and resources - Tuition fees, funding and scholarships - - Short courses - - Lunchtime evening and weekend courses - - Clearing - - Summer schools - - Get a prospectus Student life Accommodation Choose your halls of residence Your accommodation options Apply for accommodation Our accommodation guarantee Fees and contracts Our cities Southampton Winchester Malaysia Sports and gyms Sports facilities Sports clubs Watersports centres Our campuses Avenue Campus Boldrewood Innovation Campus City Centre Campus Highfield Campus University Hospital Southampton Waterfront Campus Winchester Campus Join our student community What's on Clubs and societies Sports teams SUSU places Representing you SUSU support and advice Support and money Living costs Academic and mental health support Inclusion and respectful behaviour policy Support for disabled students Part-time work Health services Research Our impact Research projects Research areas Research facilities Collaborate with us Institutes, centres and groups Support for researchers Faculties, schools and departments Interdisciplinary research Find people and expertise - Research jobs Business Develop your organisation Access start-up support Invest in our start-ups Become a research partner License our technology Knowledge Transfer Partnerships Hire our facilities Academic consultants Specialist consultancies Research studentships Develop your workforce Continuing professional development Set up a staff secondment Host a placement student Collaborate on a short term student project Advertise graduate jobs and internships Become a supplier - - Find people and expertise Global International students Visiting delegations University of Southampton Delhi International Office Visiting fellowships University of Southampton Malaysia - Partnerships and initiatives Online master's degrees View all staff Dr Kate Farrahi Associate Professor Research interests the intersection of machine learning and digital health developing machine learning methods for human sensing using vision- and wearable-based techno… More research Accepting applications from PhD students. Connect with Kate Email: K.Farrahi@soton.ac.uk Tel: +44 23 8059 2722 ORCID On this page Research Publications Biography Research Publications Biography Research Research groups Member of: Vision, Learning and Control Institute for Life Sciences Centre for Health Technologies Centre for Machine Intelligence Research interests the intersection of machine learning and digital health developing machine learning methods for human sensing using vision- and wearable-based technologies Publications Multimodal large language models in human-centered health: practical insights Ting Dang, Hong Jia, Katayoun Farrahi & Gabriela Marcu, 2025, IEEE Pervasive Computing, 23(4), 87-93 DOI: 10.1109/MPRV.2024.3499513 Type: article Machine learning to predict prostate artery embolization outcomes G. Vigneswaran, N. Doshi, D. Maclean, T. Bryant, M. Harris, N. Hacking, K. Farrahi, M. Niranjan & S. Modi, 2024, Cardiovascular and Interventional Radiology, 47(9), 1248-1254 DOI: 10.1007/s00270-024-03776-z Type: article DrugPose: benchmarking 3D generative methods for early stage drug discovery Zygimantas Jocys, Joanna Grundy & Katayoun Farrahi, 2024, Digital Discovery, 3(7), 1308-1318 DOI: 10.1039/d4dd00076e Type: article EpiCURB: learning to derive epidemic control policies Andrei C. Rusu, Katayoun Farrahi & Mahesan Niranjan, 2024, IEEE Pervasive Computing, 3(1), 57-62 DOI: 10.1109/MPRV.2023.3329546 Type: journalSpecialIssue OptiBreathe: an earable-based PPG system for continuous respiration rate, breathing phase, and tidal volume monitoring Julia Romero, Andrea Ferlini, Dimitris Spathis, Ting Dang, Katayoun Farrahi, Fahim Kawsar & Alessandro Montanari, 2024 DOI: 10.1145/3638550.3641136 Type: bookChapter Beyond the surface of digital contact tracing: delving into the interconnected world of technology, individuals, and society Jiejun Hu-Bolz, Katayoun Farrahi & Manuel Cebrian, 2024, IEEE Transactions on Systems, Man, and Cybernetics: Systems, 54(10), 6332-6344 DOI: 10.1109/TSMC.2024.3428393 Type: article Representation transfer and data cleaning in multi-views for text simplification Wei He, Katayoun Farrahi, Bin Chen, Bohua Peng & Aline Villavicencio, 2023, Pattern Recognition Letters, 177, 40-46 DOI: 10.1016/j.patrec.2023.11.011 Type: article Author Correction Marcin Waniek, Petter Holme, Katayoun Farrahi, Rémi Emonet, Manuel Cebrian & Talal Rahwan, 2023, Scientific Reports, 13(1) DOI: 10.1038/s41598-023-28809-4 Type: letterEditorial Cascade learning localises discriminant features in visual scene classification Junwen Wang & Katayoun Farrahi, 2023 DOI: 10.48550/arXiv.2311.12704 Type: other Flattening the curve through reinforcement learning driven test and trace policies Andrei Rusu, Kate Farrahi & Mahesan Niranjan, 2023 DOI: 10.1007/978-3-031-34586-9_14 Type: conference Biography I am an assistant professor in the ECS department at the University of Southampton working in the vision, learning and control VLC Group. Prior to joining Southampton, I was a research assistant at Idiap Research Institute.  I obtained my PhD in Computer Science from Swiss Federal Institute of Technology in Lausanne (EPFL). Prizes Best Paper Award (2022) Best Paper Award (2022) Study View all courses Taught postgraduate study Postgraduate taught degree courses Online master's degrees Postgraduate taught tuition fees Funding your postgraduate taught studies Pre-masters for international students How to apply for a postgraduate taught degree Postgraduate offer holders - prepare for your studies Pre-sessional English courses Pre-sessional English courses Course modules Assessment Subjects Acoustical engineering Aeronautical and astronautical engineering Ageing and gerontology Archaeology Art, design and fashion Audiology Biological sciences Biomedical and medical engineering Business, accounting, finance and marketing Chemistry Civil engineering Computer science and software engineering Economics Education Electrical and electronic engineering English Film studies French Geography and environmental science History Languages and linguistics Law Maritime engineering Mathematical sciences Mechanical engineering Medicine Music Nursing, midwifery and healthcare Ocean and Earth science Philosophy Photonics and optoelectronics Physics and astronomy Politics and international relations Psychology Social statistics and demography Sociology, social policy and criminology PhDs and research degrees Create your own research project Find a PhD project A missing link between continental shelves and the deep sea: Have we underestimated the importance of land-detached canyons? A study of rolling contact fatigue in electric vehicles (EVs) Acoustic monitoring of forest exploitation to establish community perspectives of sustainable hunting Acoustic sensing and characterisation of soil organic matter Advancing intersectional geographies of diaspora-led development in times of multiple crises Aero engine fan wake turbulence – Simulation and wind tunnel experiments Against Climate Change (DACC): improving the estimates of forest fire smoke emissions All-in-one Mars in-situ resource utilisation (ISRU) system and life-supporting using non-thermal plasma An electromagnetic study of the continent-ocean transition southwest of the UK An investigation of the relationship between health, home and law in the context of poor and precarious housing, and complex and advanced illness Antibiotic resistance genes in chalk streams Being autistic in care: Understanding differences in care experiences including breakdowns in placements for autistic and non-autistic children Biogeochemical cycling in the critical coastal zone: Developing novel methods to make reliable measurements of geochemical fluxes in permeable sediments Bloom and bust: seasonal cycles of phytoplankton and carbon flux British Black Lives Matter: The emergence of a modern civil rights movement Building physics for low carbon comfort using artificial intelligence Business studies and management: accounting Business studies and management: banking and finance Business studies and management: decision analytics and risk Business studies and management: digital and data driven marketing Business studies and management: human resources (HR) management and organisational behaviour Business studies and management: strategy, innovation and entrepreneurship Carbon storage in reactive rock systems: determining the coupling of geo-chemo-mechanical processes in reactive transport Cascading hazards from the largest volcanic eruption in over a century: What happened when Hunga Tonga-Hunga Ha’apai erupted in January 2022? Characterisation of cast austenitic stainless steels using ultrasonic backscatter and artificial intelligence Climate Change effects on the developmental physiology of the small-spotted catshark Climate at the time of the Human settlement of the Eastern Pacific Collaborative privacy in data marketplaces Compatibility of climate and biodiversity targets under future land use change Cost of",
  "content_length": 27297,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:45"
}