{
  "name": "Katerina Stanková",
  "homepage": "http://www.stankova.net",
  "status": "success",
  "content": "­­ Kateřina Staňková's page - Katka Staňková's page - K. Staňková's page - Katka's page - Kateřina's page - Katka Stankova's page - Katerina Stankova's page - About game theory - Stackelberg games Kateřina Staňková Associate Professor in Dynamic Game Theory Main Resume Evolutionary Game Theory lab Education Funding Ideas for student projects (thesis research and/or internship) Office phone: tba E-mail: click here Visiting address: Room A3.230 Faculty of Technology, Policy and Management Delft University of Technology Jaffalaan 5 2628 BX DelftThe Netherlands Postal address: P.O. Box 5015 2600 GA Delft The Netherlands Main research interests: Game theory to improve healthcare Mathematical oncology; design of evolutionary therapies for metastatic cancers Stackelberg evolutionary games; stability properties of such games Spatial and nonspatial evolutionary game theory, especially focusing on the impact of the evolutionary (=strategy) and ecological (=population) speed on the outcomes of the games Dynamic game theory in modeling and control of complex systems (recently mostly \"games against nature\" or \"games for nature\") For publications, see my Google Scholar page. Bits and pieces: In July 2022, the Dutch Research Council awarded me with the VIDI grant! My project \"ANTICANCER: GAme Theory Empowered by Data ScieNce and Control Theory to Improve Treatment of Metastatic CANCER\" will develop new game theory to improve treatment of metastatic non-small cell lung cancer. (October 2022) Within my VIDI grant, I am currently recruting 2 PhD candidates (one in game theory combined with optimal control theory to develop new models and analyze their properties, one in data-driven predictive modelling where we will test predictive capabilities of these models against those of machine learning and data-driven simulations). (October 2022) Recruitment of one more PhD candidate in (technical) medicine and/or biomedical engineering background (funded partially by the VIDI grant and partially by my Delft Technology Fellowship startup) will start soon. Intended started day of the project is January 2023, hopefully all 3 PhD candidates will start not too much later after that. In October 2022, Neeraj Sinha joined the lab as a postdoctoral researcher. He will work on data-driven modelling to detect inflammatory risk factors to prevent colitis-associated cancer in patients and suggest the best therapeutic interventions for patients with these risks. This is within our collaboration with at University Medical Center Utrecht. Neeraj will work together with external PhD candidate Weronika Jong from the lab and will strenghten our Health@TPM initiatives. Considering the team of scientists working on evolutionary game theory and applications is growing, I am creating a lab page: . Please be patient with me there, I guess the appearance of this website and frequency of its update demonstrate my HTML skills. I lead the Innovative Training Network \"EVOGAMESPLUS: Evolutionary games and population dynamics: from theory to applications\". It has been the only ITN grant in mathematics awarded in 2020. A bit more on this here . I also lead NWO KLEIN2 project \"Understanding metastatic cancer through game theory and dynamical systems theory\". A bit more on this here . In December 2020, I received the NWO Stairway to Impact Award for my work on game theory in designing better cancer treatment. For Bachelor and Master thesis projects see this page. This site needs to be updated, hopefully that will happen soon. Some (rather randomly picked) recent papers: \"Fisheries management as a Stackelberg Evolutionary Game: Finding an evolutionarily enlightened strategy\" - together with M. Salvioli, J. Dubbeldam, and J.S. Brown, PLOS One, January 2021. \"Optimizing Cancer Treatment Using Game Theory\" - together with J.S. Brown, W. S. Dalton and Robert A. Gatenby, JAMA Oncology, 2019 \"Optimal Control to Reach Eco-Evolutionary Stability in Metastatic Castrate-Resistant Prostate Cancer\" - together with J. J. Cunningham, Y. Viossat, J.S. Brown, F. Thuijsman, R. Peeters, and R.A. Gatenby, accepted by PLOS One in November 2020. \"Coordination games in cancer\" - together with P. Bayer, R. A. Gatenby, P. H. McDonald, D. R. Duckett, and J. S. Brown, forthcoming in PLOS One, 2021",
  "content_length": 4291,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:46"
}