{
  "name": "Katerina J. Argyraki",
  "homepage": "https://people.epfl.ch/katerina.argyraki",
  "status": "success",
  "content": "EPFL - Katerina Argyraki Données administratives Katerina Argyraki katerina.argyraki@epfl.ch +41 21 693 81 32 http://nal.epfl.ch vCard Professeure associée, Laboratoire d'architecture des réseaux EPFL IC IINFCOM NALBC 126 (Bâtiment BC)Station 141015 Lausanne +41 21 693 81 32 Office: BC 126 EPFL › IC › IINFCOM › NAL Site web: https://nal.epfl.ch/ Professeure associée, SSC - Enseignement +41 21 693 81 32 EPFL › IC › IC-SSC › SSC-ENS Site web: https://ssc.epfl.ch Professeure associée, SIN - Enseignement +41 21 693 81 32 EPFL › IC › IC-SIN › SIN-ENS Site web: https://sin.epfl.ch Vice-doyenne à l'enseignement, Décanat d'IC +41 21 693 81 32 EPFL › IC › IC-DEC › IC-DO Site web: https://ic.epfl.ch/page8797.html Membre de la CDS, Conférence des directions de sections +41 21 693 81 32 EPFL › VPA › VPA-AVP-E › AVP-E › AVP-E-CDS Site web: https://epflch.sharepoint.com/sites/CDS Membre, Direction de la faculté IC +41 21 693 81 32 EPFL › IC › IC-DEC › IC-DIR Site web: https://ic.epfl.ch/page10299.html Expertise Réseaux informatique Prix et distinctions Enseignement et PhD Prix et distinctions Given once a year to an IC teacher by student vote. 2025 For \"Edge Caching as Differentiation\" with Muhammad Abdullah and Pavlos Nikolopoulos. 2025 Given once a year to an IC teacher by student vote. 2022 Recognizes \"the best recent results in applied networking, interesting new research ideas of potential relevance to the Internet standards community, and upcoming people that are likely to have an impact on Internet standards and technology.\" 2020 By the N2Women society. 2020 By the School of Computer and Communication Sciences for consistent excellence in teaching. 2018 Given by ACM Eurosys once a year to a \"junior European researcher who has demonstrated exceptional creativity and innovation in systems research.\" 2016 By the department, for excellence in teaching. 2018 Recognizes junior European researchers who have demonstrated exceptional creativity and innovation in systems research. 2016 For the 2014 By the Swiss National Science Foundation. 2014 For the 2009 By the student association, for excellence in teaching. 2019 By the department, for excellence in teaching. 2014 Enseignement et PhD Current Phd Muhammad Abdullah, Mahdi Hosseini, Catalina Paz Alvarez Inostroza, Eric Jollès Past Phd As Director Mihai Dobrescu, Iris Safaka, Ovidiu Sebastian Mara, George Ioannidis, Pavlos Nikolopoulos, Jonas Fietz, Arseniy Zaostrovnykh, Georgia Fragkouli, Zeinab Shmeis Past Phd As Codirector Denisa Gabriela Ghita, Sam David Whitlock, Mia Primorac, Rishabh Iyer Courses Computer systems CS-202 Ce cours enseigne les systèmes d'exploitation et les réseaux de manière intégrée, en mettant l'accent sur les concepts fondamentaux et les techniques qui rendent leur interaction possible/pratique. Les leçons théoriques principales seront complétées par des leçons et travaux pratiques en langage C. Principles of computer systems CS-522 LA VERSION ANGLAISE FAIT FOI Ce cours avancé se concentre sur les principes fondamentaux qui soutiennent les systèmes informatiques et de communication en utilisant les idées, techniques et algorithmes des différents domaines d'informatique système (OS, DB, Network, ...) Back to top",
  "content_length": 3227,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:47"
}