{
  "name": "Kate Mintram",
  "homepage": "https://www.brunel.ac.uk/people/kate-mintram",
  "status": "success",
  "content": "Dr Kate Mintram | Introduction | Brunel University London Skip to Content Home People Dr Kate Mintram Dr Kate MintramAssociate Lecturer (Education) Wilfred Brown 313 Email: kate.mintram@brunel.ac.uk Tel: +44 (0)1895 267538 Computer Science College of Engineering, Design and Physical Sciences Summary Dr Katie Mintram is an Associate Lecturer in the Department of Computer Science at Brunel University London and is a member of the Modelling and Simulation group. With a background in Environmental Biology, Katie's research is centred around simulating the emergent behaviours of complex systems. She has developed simulation models to aid policy and industrial decision making in the fields of ecotoxicology, epidemiology, public health, supply chain resilience, microbiology, climate change biology and fisheries science. Katie completed her BSc at the University of Plymouth in 2014 with an industrial placement year at AstraZeneca, where she developed in vitro alternatives to animal testing. She completed a BBSRC iCASE (Syngenta) funded PhD in agent-based simulation at the University of Exeter in 2019 within the College of Life and Environmental Sciences. Her PhD and subsequent postdoctoral research centred around the development and application of agent-based models for realistic predictions of chemical exposure effects on fish populations. Katie joined Brunel in 2021 as a Research Fellow working in the STAMINA project, a Horizon2020 funded project which developed a toolset for pandemic crisis prediction and management across Europe. Prior to joining Brunel, Katie also spent a year as an animal welfare consultant in the NGO sector, and is a Fellow of the Higher Education Academy. Qualifications University of Exeter (2019) - PhD: 'Development and application of modelling approaches for realistic assessments on population impacts of endocrine disruption in fish’. Plymouth University - BSc Environmental Biology (1st Class Hons) with Certificate of Industrial Placement. Responsibility Computer Science Web Coordinator Newest selected publications Mintram, KS., Brown, AR., Maynard, SK., Thorbek, P. and Tyler, CR. (2024) 'Predicting population-level impacts of projected climate heating on a temperate freshwater fish'. Journal of Fish Biology, 105 (6). pp. 1715 - 1723. ISSN: 0022-1112 Open Access Link Journal article Ghorbani, M., Suleimenova, D., Jahani, A., Saha, A., Xue, Y., Mintram, K., Anagnostou, A., Tas, A., Low, W., Taylor, SJE. and Groen, D. et al. (2024) 'Flee 3: Flexible agent-based simulation for forced migration'. Journal of Computational Science, 81. pp. 1 - 14. ISSN: 1877-7503 Open Access Link Journal article Hazlerigg, CRE., Mintram, KS., Tyler, CR., Weltje, L. and Thorbek, P. (2023) 'Harnessing Modeling for Assessing the Population Relevance of Exposure to Endocrine‐Active Chemicals'. Environmental Toxicology and Chemistry, 42 (7). pp. 1624 - 1640. ISSN: 0730-7268 Open Access Link Journal article Mintram, K., Anagnostou, A., Anokye, N., Okine, E., Groen, D., Saha, A., Abubakar, N., Islam, T., Daroge, H., Ghorbani, M., Xue, Y. and Taylor, SJE. et al. (2022) 'CALMS: Modelling the long-term health and economic impact of Covid-19 using agent-based simulation'. PLOS ONE, 17 (8). pp. 1 - 19. ISSN: 1932-6203 Open Access Link Journal article Bakalos, N., Kaselimi, M., Doulamis, N., Doulamis, A., Kalogeras, D., Bimpas, M., Davradou, A., Vlachostergiou, A., Fotopoulos, A., Plakia, M., Karalis, A., Tsekeridou, S., Anagnostopoulos, T., Despotopoulou, AM., Bonavita, I., Petersen, K., Pelepes, L., Voumvourakis, L., Anagnostou, A., Groen, D., Mintram, K., Saha, A., Taylor, SJE., Ham, CVD., Kaleta, P., Ignjatović, D. and Rossi, L. et al. (2022) 'STAMINA: Bioinformatics Platform for Monitoring and Mitigating Pandemic Outbreaks'. Technologies, 10 (3). pp. 1 - 18.Open Access Link Journal article More publications(10)",
  "content_length": 3870,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:45"
}