{
  "name": "Kate Smith 0003",
  "homepage": "https://knsmith.github.io",
  "status": "success",
  "content": "Kate Smith Portfolio Kate Smith Evanston, Illinois, USA · kns{at}northwestern.edu I'm an Assistant Professor of Computer Science at Northwestern University. My group's website can be found here. Within the scope of quantum computing, my research interests include system architecture, optimized compilation, context-aware error mitigation, distributed systems, high-dimensional / qudit processing, device characterization, and circuit simulation. Education Southern Methodist University Doctor of Philosophy in Electrical Engineering December 2019 Master of Science in Electrical Engineering May 2015 Bachelor of Science in Electrical Engineering May 2014 Bachelor of Science in Mathematics May 2014 Professional Experience Quantum Software Manager, Compiler Team: Infleqtion Managed the software engineering team responsible for maintaining Superstaq, a physics-aware quantum compiler. Directed R&D efforts for Superstaq, including techniques implementing dynamical decoupling and low-level operator optimization, that substantially improved quantum program success. Pioneered novel quantum circuit simulation techniques that led to more efficient evaluation on classical hardware. September 2022 - December 2023 CQE/IBM Postdoctoral Scholar: University of Chicago Conducted research within the Enabling Practical-scale Quantum Computation (EPiQC) group of the Chicago Quantum Exchange (CQE). Within the focus of quantum computing, work focused on technology-aware programming, computer architecture, distributed computing, high-dimensional processing, and security. January 2020 - September 2022 Research Assistant: SMU Quantum Informatics Research Group Developed quantum logic synthesis and compilation algorithms with an emphasis on technology-dependent mapping and optimization. Researched multiple-valued logic and photonic quantum information processing techniques. June 2017 - December 2019 Research Assistant: Darwin Deason Institute for Cyber Security Studied various topics relating to cybersecurity. Led projects with machine learning and neural networks as well as algorithm development in MATLAB, Python, and C++. December 2014 - December 2019 Visiting Scholar: EPFL Integrated Systems Laboratory Hosted by the Integrated Systems Laboratory at École Polytechnique Fédérale de Lausanne in Lausanne, Switzerland with the support of a Swiss National Science Foundation scientific exchange grant. Researched methods for technology-dependent optimization in quantum compilation. January 2019 - March 2019 Quality Engineer Intern: Texas Instruments Collaborated with product, application, and test engineers to process customer specifications and returns. Became familiar with a wide range of audio and imaging technologies and products to support device customers. May 2014 - August 2014 Design Verification Engineer Intern: Texas Instruments Contributed to projects that ensured quality silicon fabrication and reduced wafer scrap. Developed golden MEBES files for a technology platform with an analog PDK development team. May 2012 - August 2013 Teaching Experience University of Chicago Department of Computer Science Co-Instructor Led curriculum development and in-class instruction for inaugural course, Introduction to Quantum Computing for Everyone. Adapted course material for delivery as a Massive Online Open Course (MOOC) on edX.org January 2021 - March 2021 OSP Summer Program Teaching Assistant Organized lecture material and assignments for the University of Chicago Office of Special Programs (OSP) course Demystifying Quantum Computing. TA responsibilities included tutoring students and providing administrative and technical support during lecture. June 2020 - August 2020 Digital Design Adjunct Lecturer Taught courses CS 3381: Digital Logic Design and ECE 2381: Digital Computer Logic to undergraduate students. These courses detail the history of logic and its applications to digital switching circuitry with an emphasis on hardware description languages. Responsiblilities of an adjunct lecturer included organizing lecture material, labs, assignments, and exams. January 2017 - December 2019 Solid State Devices Teaching Assistant Directed lab and graded assignments for undergraduate and graduate students enrolled in ECE 3311: Solid State Devices. Responsibilities of a TA included teaching diffusion, lithography, chemical etch, and metallization techniques in class 10,000 and class 1,000 clean rooms. August 2013 - December 2014 Altshuler Learning Enhancement Center Tutor Tutored undergraduate students in calculus, physics, programming, and introductory engineering courses. Coached students in time management as well as in methods to improve study and test skills. August 2011 - May 2014 Publications & Presentations K. Dubey and K. N. Smith, Access Improvements to Densely Packed Quantum Memory, IEEE International Conference on Quantum Computing and Engineering (QCE), August 31–September 5, 2025. (poster presentation and paper) E. Giusto, S. Nunez-Corrales, K. N. Smith, P. Cao, E. Younis, P. Rech, F. Vella, B. Baheri, A. Cilardo, B. Montrucchio, W. Jiang, S. Xu, S. Dasgupta, R. K. Iyer, T. S. Humble, Dependable Classical-Quantum Computing Systems Engineering, Frontiers in Computer Science, July 2025. H. Kim, M. J. Jeng, and K. N. Smith, Toward Human-Quantum Computer Interaction: Interface Techniques for Usable Quantum Computing, ACM CHI Conference on Human Factors in Computing Systems, April 26-May 1, 2025. N. LaRacuente, K. N. Smith, P. Imany, K. L. Silverman, and F. T. Chong, Modeling Short-Range Microwave Networks to Scale Superconducting Quantum Computation, Quantum 9, 1581, January 2025. J. Gao, J. Liu, A. Gonzales, Z. H. Saleem, N. Hardavellas, and K. N. Smith, Pauli Check Sandwiching for Quantum Characterization and Error Mitigation during Runtime, IEEE International Conference on Quantum Computing and Engineering (QCE), September 15-20, 2024. (poster presentation and paper) Q. Langfitt, J. Liu, B. Huang, A. Gonzales, K. N. Smith, N. Hardavellas, and Z. H. Saleem, Pauli Check Extrapolation for Quantum Error Mitigation, IEEE International Conference on Quantum Computing and Engineering (QCE), September 15-20, 2024. (poster presentation and paper) H. Kim and K. N. Smith, Interaction Techniques for User-friendly Interfaces for Gate-based Quantum Computing, IEEE International Conference on Quantum Computing and Engineering (QCE), September 15-20, 2024. (poster presentation and paper) S. F. Lin, J. Viszlai, K. N. Smith, G. S. Ravi, C. Yuan, F. T. Chong, and B. J. Brown, Codesign of Quantum Error-correcting Codes and Modular Chiplets in the Presence of Defects, ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), April 27-May 1, 2024. S. Dangwal, G. S. Ravi, P. Das, K. N. Smith, J. M. Baker, and F. T. Chong, VarSaw: Application-tailored Measurement Error Mitigation for Variational Quantum Algorithms, ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), April 27-May 1, 2024. E. P. Cisneros, V. T. Omole, P. Gokhale, A. Hashim, K. N. Smith, M. Perlin, and R. Rines Average circuit eigenvalue sampling on NISQ devices, American Physical Society (APS) March Meeting, March 4, 2024. (reviewed abstract) F. Qi, K. N. Smith, T. LeCompte, N. Tzeng, X. Yuan, F. T. Chong, and L. Peng, Quantum Vulnerability Analysis to Guide Robust Quantum Computing System Design, IEEE Transactions on Quantum Engineering, December 2023. C. Campbell, F. T. Chong, P. Frederick, P. Goiporia, P. Gokhale, B. Hall, S. Issa, S. Lee, A. Litteken, V. Omole, D. Owusu-Antwi, M. A. Perlin, R. Rines, K. N. Smith, N. Goss, A. Hashim, R. Naik, E. Younis, D. Lobser, C. G. Yale, B. Huang, and J. Liu, Superstaq: Deep Optimization of Quantum Programs, IEEE International Conference on Quantum Computing and Engineering (QCE), September 17-22, 2023. K. N. Smith*, M. A. Perlin*, P. Gokhale, P. Frederick, D. Owusu-Antwi, R. Rines, V. Omole, and F. T. Chong, Clifford-based Circuit Cutting for Quantum Simulation, ACM/IEEE International Symposium on Computer Architecture (ISCA), June 17-21, 2023. (*co-first authors) K. Brown, F. T. Chong, K. N. Smith, T. M. Conte, A. Adams, A. Dalvi, C. Kang, and J. Viszlai, 5 Year Update to the Next Steps in Quantum Computing Report, CCC 5 Year Update to the Next Steps in Quantum Computing Workshop, May 18-19, 2023. K. N. Smith, J. Viszlai, L. M. Seifert, J. M. Baker, J. Szefer, and F. T. Chong, Fast Fingerprinting of Cloud-based NISQ Quantum Computers, IEEE International Symposium on Hardware Oriented Security and Trust (HOST), May 1-4, 2023. G. S. Ravi, K. N. Smith, J. M. Baker, T. Kannan, N. Earnest, A. Javadi-Abhari, H. Hoffmann, and F. T. Chong, Navigating the Dynamic Noise Landscape of Variational Quantum Algorithms with QISMET, ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), March 25-29, 2023. G. S. Ravi, P. Gokhale, Y. Ding, W. M. Kirby, K. N. Smith, J. M. Baker, P. J. Love, H. Hoffmann, K. R. Brown, and F. T. Chong, CAFQA: A Classical Simulation Bootstrap for Variational Quantum Algorithms, ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), March 25-29, 2023. P. Gokhale, F. Chong, A. Litteken, D. Owusu-Antwi, M. Perlin, K. N. Smith, P. Goiporia, R. Rines, S. Issa, and V. Omole, Compilation of Quantum Applications to Hardware Primitives, American Physical Society (APS) March Meeting, March 7, 2023. (reviewed abstract) G. S. Ravi, J. M. Baker, K. N. Smith, N. Earnest, A. Javadi-Abhari and F. T. Chong, Quancorde: Boosting Fidelity with Quantum Canary Ordered Diverse Ensembles, IEEE International Conference on Rebooting Computing (ICRC), December 8-9, 2022. K. N. Smith, G. S. Ravi, J. M. Baker, and F. T. Chong, Scaling Superconducting Quantum Computers with Chiplet Architectures, 55th IEEE/ACM International Symposium on Microarchitectu",
  "content_length": 20205,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:44"
}