{
  "name": "Kate Hone",
  "homepage": "https://www.brunel.ac.uk/people/kate-hone",
  "status": "success",
  "content": "Professor Kate Hone | Introduction | Brunel University London Skip to Content Home People Professor Kate Hone Professor Kate HoneHead of Department - Computer Science Wilfred Brown 103 Email: kate.hone@brunel.ac.uk Tel: +44 (0)1895 266009 Computer Science College of Engineering, Design and Physical Sciences Summary Professor Kate Hone is Head of Department in the Department of Computer Science at Brunel University London, UK. She received the B.A. degree in Experimental Psychology in 1990 from the University of Oxford, UK, and the M.Sc. degree in Work Design and Ergonomics in 1992, and the Ph.D. degree in Human Computer Interaction in 1996, both from the University of Birmingham, UK. From 1995 to 2000 she held teaching and research appointments at the University of Nottingham, UK, first in Psychology and subsequently as lecturer in Computer Science. She joined Brunel as a lecturer in 2000 and from 2009-2018 held the post of Director the Graduate School. She has published widely, including articles in the International Journal of Human Computer Studies, Interacting with Computers, Behaviour and Information Technology, Applied Ergonomics and Ergonomics. Qualifications BA Experimental Psychology, MSc Work Design & Ergonomics, PhD Human Computer Interaction, PGCert HE Newest selected publications Li, M., Wang, Z., Li, K., Liao, X., Hone, K. and Liu, X. (2021) 'Task Allocation on Layered Multiagent Systems: When Evolutionary Many-Objective Optimization Meets Deep Q-Learning'. IEEE Transactions on Evolutionary Computation, 25 (5). pp. 842 - 855. ISSN: 1089-778X Open Access Link Journal article Zeng, N., Wang, Z., Liu, W., Zhang, H., Hone, K. and Liu, X. (2020) 'A Dynamic Neighborhood-Based Switching Particle Swarm Optimization Algorithm'. IEEE Transactions on Cybernetics, 52 (9). pp. 9290 - 9301. ISSN: 2168-2267 Open Access Link Journal article Liu, W., Wang, Z., Yuan, Y., Zeng, N., Hone, K. and Liu, X. (2019) 'A Novel Sigmoid-Function-Based Adaptive Weighted Particle Swarm Optimizer'. IEEE Transactions on Cybernetics, 51 (2). pp. 1085 - 1093. ISSN: 2168-2267 Open Access Link Journal article Gibbs, J., Sutcliffe, LJ., Gkatzidou, V., Hone, K., Ashcroft, RE., Harding-Esch, EM., Lowndes, CM., Sadiq, ST., Sonnenberg, P. and Estcourt, CS. et al. (2016) 'The eClinical Care Pathway Framework: a novel structure for creation of online complex clinical care pathways and its application in the management of sexually transmitted infections'. BMC Medical Informatics and Decision Making, 16 (1). pp. 98. ISSN: 1472-6947 Open Access Link Journal article Hone, KS. and El Said, GR. (2016) 'Exploring the factors affecting MOOC retention: a survey study'. Computers & Education, 98. pp. 157 - 168. ISSN: 0360-1315 Open Access Link Journal article More publications(34)",
  "content_length": 2790,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:43"
}