{
  "name": "Katharina Kinder",
  "homepage": "https://katharinakinderkurlanda.net",
  "status": "success",
  "content": "Katharina Kinder-Kurlanda – Cultural Anthropologist & Professorin für Humanwissenschaft des Digitalen 5. November 20255. November 2025 Looking back over the spring and summer, discussions around AI Ethics were particularly prominent and engaging. I had the pleasure of contributing to the University of Vienna’s Anthropocene Lecture Series with a talk titled AI, Ethics & the Anthropocene. In addition, I joined a panel at kärnten.museum in Klagenfurt on Künstliche Intelligenz & Atomkraft: Ein ethisches Dilemma im Anthropozän. And at Techforum Millstatt 2025 (Video of the event) my research group presented our AI Game as part of the interactive exhibition, and I took part in a panel on Digital Transformation, sharing reflections on AI & Society: Humans, Machines, and Ethical Dilemmas. It was a great opportunity to connect across the university-industry divide and I learned about AI-infrastructure-building in Austria. 10. Februar 202510. Februar 2025 Currently very much looking forward to the STS Hub 2025 in Berlin, 11-14 March 2025. Matthias Wieser and myself are chairing a panel on „Drone Interactions & Autonomy: Diffraction of the Drone Gaze“ (Panel no.38). 17. September 2024 Die 9. Arbeitstagung der Kommission Digitale Anthropologie der Deutschen Gesellschaft für Empirische Kulturwissenschaft findet vom 16. bis 18. September 2024 an der Universität Vechta statt: https://www.uni-vechta.de/kulturwissenschaften/tagung Meine Keynote zum Thema „New Data Politics: Ethnographische Forschung mit/zu digitalen Methoden“ wird in den Proceedings veröffentlicht werden. 11. September 2024 Thank you again, Carsten Ochs, Nils Zurawski and Doris Allhutter for visiting us at D!ARC in Klagenfurt to provide insights on Democracy & AI, Digitization in Policing, and Automated Welfare Futures! https://www.aau.at/en/digital-age-research-center/interdisciplinary-formats/darc-lectures 24. Februar 2021 Nächste Woche findet die Jahrestagung des Forschungsschwerpunkts digitale_kultur der FernUniversität in Hagen und der Emmy Noether-Forschungsgruppe (DFG): „Das Phänomen der Interaktion in der Mensch-Maschine-Interaktion (MMI)“ statt, mit einem spannenden Programm zum Thema „Mensch-Maschine-Interaktionen in digitalen_kulturen„. 23. Februar 202124. Februar 2021 I have just started my new job as a Professor for Humanwissenschaft des Digitalen at the Digital Age Research Center (D!ARC) at Klagenfurt University. Suche nach: Suche nach: Aktuelle Beiträge From Vienna to Millstatt: Conversations on AI and Ethics Panel on ‚Diffraction of the Drone Gaze‘ at the STS Hub 2025 Digitale Methoden und Daten in Ethnografie und qualitativer Forschung D!ARC Lectures in the 2024 summer term Von Menschen und Maschinen Neueste KommentareArchiv November 2025 Februar 2025 September 2024 Februar 2021 Kategorien Allgemein Abonnieren Abonniert Katharina Kinder-Kurlanda Anmelden Du hast bereits ein WordPress.com-Konto? Melde dich jetzt an. Katharina Kinder-Kurlanda Abonnieren Abonniert Registrieren Anmelden Melde diesen Inhalt Website im Reader anzeigen Abonnements verwalten Diese Leiste einklappen",
  "content_length": 3097,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:46"
}