{
  "name": "Katharina Anna Zweig",
  "homepage": "http://aalab.cs.uni-kl.de/en/gruppe/zweig",
  "status": "success",
  "content": "Algorithm Accountability Lab: Prof. Dr. Katharina Anna Zweig DEEN Suche extern bei StartPage NewsDept. of CSUniversityStudiesDept. of CSUniversityResearchDept. of CSUniversityUniversityApplicantsDept. of CSUniversity RPTU / Department of Computer Science / AALab / Group / Prof. Dr. Katharina A. Zweig InformationTitleProf. Dr.Last NameZweigFirst Name(s)KatharinaResearchgate linkGoogle Scholar linkORC ID linkMailTU Kaiserslautern Postfach 3049 67663 KaiserslauternRoom48-670 Research interests 2003 I started my doctoral thesis in the field of analysis of complex networks. Complex networks are a common way to model and analyze complex systems. Therefore, their results are often used to draw conclusions about complex systems - these results can also have political consequences. An eye-opening article was published by Professor Carter Butts in 2009 under the title \"Revisiting the Foundations of Social Network Analysis\". At that time, I had already designed several algorithms and conducted various interdisciplinary network analyses. I was particularly interested in the question why there are so often many measures for the same kind of question, e.g. about 60 measures to sort the nodes of a network according to their importance. In an article by Steve Borgatti, he explains that we shouldn't actually be investigating the structure of the (static) network, but the processes that run on it: On a (real) social network information can be transmitted, people infect each other with the latest flu or they support each other. Each of these flow processes requires different centrality measures. Borgatti thus linked the type of network flow (a social process) with the mathematical measure with which it can be investigated. Without knowledge of the social process, however, an interpretation of any centrality measure is not possible. I began to examine this problem in its generality: \"When is which measure, which approach of network analysis appropriate to draw a conclusion about the real world? I have published my results in my book Network Analysis Literacy. Since then, we have extended the approach to data science in general and are working on various questions in the area of algorithm accountability. To reflect this in the naming of the group, in 2017 I renamed my group to the \"Algorithm Accountability Lab\". We are working on questions about measuring the quality and fairness of algorithmic decision systems (ADM systems), black box methods for monitoring ADM systems, theoretical questions about the robustness of machine learning methods, and we are also thinking about the best way to regulate ADM systems. As a member of the Enquete Commission of Artificial Intelligence (2018-2020), a member of the ITA advisory board of the BMBF (since 2014), of the Plattform Lernende Systeme (AG3, UG Ethics and Law), I also carry our research into society. I was also in charge of the course of studies in socioinformatics, which was accredited in 2013. In 2017 I was awarded the Ars legendi Faculty Prize in Engineering and Computer Science for the design of this unique course of studies in Germany. Scientific career Since Oct. 2018 Member of the Coordination Committee of the Consumer Research Network of the Federal Ministry of Justice and Consumer Protection (BMJV) Since Sep. 2018 Member of the Enquete Commission of Artificial Intelligence for the consultation of the Bundestag Since Apr. 2018 Member of Plattform Lernende Systems of the BMBF Work Group 3, \"Ethics und Law\" Since Nov. 2014 Member of the ITA advisory board of the Federal Ministry of Education and Research (BMBF) Since Apr. 2012 W2-Professor at the TU Kaiserslautern Sep. 2009 - Apr. 2012 Junior Research Group Leader at the University of Heidelberg, IWR Apr. 2008 - Aug. 2009 Postdoc at ELTE University, Budapest, Hungary (postdoctoral fellowship of the National Academy of Sciences Leopoldina) Jul. 2007 - Mrz. 2008 Postdoc in the work group \"Parallel Computing\" with Prof. Michael Kaufmann, University of Tübingen Jan. 2003 - Jul. 2007 PhD student in the work group \"Parallel Computing\" with Prof. Michael Kaufmann, University of Tübingen Okt. 1998 - Sep. 2006 Diploma in Bioinformatics, University of Tübingen Apr. 1996 - Jul. 2001 Diploma in Biochemistry, University of Tübingen Award 2019 Awarded the Communicator-award 2019 2018 Awarded for co-founding Algorithm Watch with the Theodor-Heuss Medal 2017 Awarded the Ars legendi-Faculty Prize in Engineering and Computer Science 2016 Awarded the Outreach Award for outstanding work with the public by the SPP 1736 - Algorithms for Big Data 2014 Digitaler Kopf 2014 (within the framework of the Year of Science \"The Digital Society\") 2013 - 2018 Gesellschaft für Informatik e.V. (GI) Junior Fellow Best Paper Awards Mareike Bockholt and Katharina A. Zweig. Process-driven betweenness centrality measures. In 4th European Network Intelligence Conference. Lecture Notes on Social Networks, Springer, 2017. Ausgezeichnet von der ENIC Brugger, C.; Grigorovici, V.; Jung, M.; Weis, C.; Schryver, C. D.; Zweig, K. A. & Wehn, N. : A Custom Computing System for Finding Similarities in Complex Networks. Proceedings of the IEEE Computer Society Annual Symposium on VLSI, 2015. Ausgezeichnet von der SPP 1736 - Algorithms for Big Data und der IEEE Computer Society Annual Symposium on VLSI K.A. Lehmann, Michael Kaufmann: \"Evolutionary Algorithms for the Self-Organized Evolution of Networks\", Proceedings of the Genetic and Evolutionary Computation Conference (GECCO'05), 2005. Ausgezeichnet von der GECCO Go to Current Projects Go to Publications Go to Talks and Workshops Superordinated page: Group members [more ...] Feedback for this Page Email to the person in charge of this page (sproten@informatik.uni-kl.de) [more ...] News [more ...]Quick LinksDepartment of Computer ScienceCourses of StudiesLecturesProfessorsDean's OfficeSCIStudents CouncilAlumniColloquia  RPTU Kaiserslautern-LandauStudentServiceCentreFacultiesInternational StudentsUniversity LibraryCafeteria MenuCourse Catalogue LehrgebieteAlgorithmic / Deduction Visual/ Scientific Comp. Embedded Systems / Robotic Intelligent Systems Information Systems Software-Engineering Distributed/Networked Systems Fachbereich InformatikNewsStudiesResearchApplicantsOrganisation Schnellzugriff Fachbereich InformatikCourses of StudiesLecturesProfessorsDean's OfficeSCIStudents CouncilAlumniColloquia Schnellzugriff RPTUStudentServiceCentreFacultiesInternational StudentsUniversity LibraryCafeteria MenuCourse Catalogue Sprachen DE | ENServiceKontakt ^ NACH OBEN RPTUAktuellesStudiumForschungUniversitätSchüler/innen ImpressumDatenschutzerklärung",
  "content_length": 6642,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:51"
}