{
  "name": "Katherine Louise Bouman",
  "homepage": "http://users.cms.caltech.edu/~klbouman",
  "status": "success",
  "content": "Katie Bouman aka Katherine L. Bouman Katie Bouman California Institute of Technology 330 South Chester Avenue, Room 346 Pasadena, CA 91125 klboumano@ocaltech.edu Home Group Webpage Resume/CV About Me I am a Professor of Computing and Mathematical Sciences (CMS) and by courtesy in Electrical Engineering and Astronomy at Caltech in Pasadena, California. My research focuses on computational imaging: designing systems that tightly integrate algorithm and sensor design, making it possible to observe phenomena previously difficult or impossible to measure with traditional approaches. My group at Caltech combines ideas from signal processing, computer vision, machine learning, and physics to find and exploit hidden signals for both scientific discovery and technological innovation. Prior to starting at Caltech, I was a postdoctoral fellow with the Event Horizon Telescope, which published the first picture of a black hole in April of 2019. I received my Ph.D. in Electrical Engineering and Computer Science at the Massachusetts Institute of Technology (MIT) in 2017. I previously received a B.S.E. in Electrical Engineering from the University of Michigan, Ann Arbor, MI in 2011 and an S.M. degree in Electrical Engineering and Computer Science from MIT in 2013. I am honored to be a recipient of a Presidential Early Career Award for Scientists and Engineers (PECASE), Sloan Fellowship, NSF CAREER Award, the Electronic Imaging Scientist of the Year Award, the Royal Photographic Society Progress Medal, an Okawa Research Grant, Outstanding Recent Alumni Award for University of Michigan, a Caltech faculty teaching award, a finalist for the AAAS Early Career Award for Public Engagement with Science, and a co-recipient of the Breakthrough Prize. Visit our group website for more information about research, admissions, my team, & latest news!",
  "content_length": 1853,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:54"
}