{
  "name": "Kathy McKeown",
  "homepage": "http://www.cs.columbia.edu/~kathy",
  "status": "success",
  "content": "Kathy's Web Page Kathleen McKeown Henry and Gertrude Rothschild Professor of Computer Science Founding Director of Columbia's Data Science Institute Office Location: Room 722, Schapiro CESPR Email: kathy@cs.columbia.edu Current Work My interests lie in the area of natural language processing, summarization, natural language generation and analysis of social media. We are currently working in three main areas. The first involves text summarization. We are working on neural methods for extractive and abstractive summarization over a variety of genres, including informal narratives of personal experience. We have worked on generating updates on disasters over live, streaming information. Our goal is to generate an update of what has happened each hour in the course of a disaster. In the second area, we are working on generating messages about electricity usage and using reinforcement learning over usage logs to determine what kinds of messages can change behavior. Finally, we are also working on the analysis of social media. We are working on analysis of the social media posts of gang-involved youth to detect messages about aggression and loss. We have also developed systems to identify influence in social media and to identify an author's personal traits. We are now working on identifying sentiment in social media posts made in low resource languages (e.g., Uyghur).. Biographical Information Kathleen R. McKeown is the Henry and Gertrude Rothschild Professor of Computer Science at Columbia University and is also the Founding Director of the Data Science Institute at Columbia. She served as the Director from July 2012 - June 2017. She served as Department Chair from 1998-2003 and as Vice Dean for Research for the School of Engineering and Applied Science for two years. McKeown received a Ph.D. in Computer Science from the University of Pennsylvania in 1982 and has been at Columbia since then. Her research interests include text summarization, natural language generation, multi-media explanation, question-answering and multi-lingual applications. In 1985 she received a National Science Foundation Presidential Young Investigator Award, in 1991 she received a National Science Foundation Faculty Award for Women, in 1994 she was selected as a AAAI Fellow, in 2003 she was elected as an ACM Fellow, and in 2012 she was selected as one of the Founding Fellows of the Association for Computational Linguistics. In 2010, she received the Anita Borg Women of Vision Award in Innovation for her work on text summarization. McKeown is also quite active nationally. She has served as President, Vice President, and Secretary-Treasurer of the Association of Computational Linguistics. She has also served as a board member of the Computing Research Association and as secretary of the board. My Publications Access to my Publications DETAiLS: A project for predicting scientific impact DETAiLS Home Page Columbia's Data Science Institute Link to Website Recent Publications of the NLP Group Papers Published By Members of the NLP Group Classes CS4705 - Introduction to Natural Language Processing Fall 2021 Coms 6998 Section 011 -Language Generation and Summarization Fall 2023 (This semester!) The Natural Language Processing Group NLP Research at Columbia University Full CV PDF Sailing Videos Coming through the Cape Cod Canal in heavy wind and waves Datasets Twitter posted from NYC parks labeled with sentiment",
  "content_length": 3437,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:59"
}