{
  "name": "Kathryn T. Stolee",
  "homepage": "https://kstolee.github.io",
  "status": "success",
  "content": "Kathryn (Katie) T. Stolee, PhD - Kathryn (Katie) T. Stolee, PhD Katie Stolee, PhD she/her Associate Professor and Researcher in Software Engineering and Education Follow 3228H EB 2 NC State University Email Google Scholar ORCID Github I am an Associate Professor in the Department of Computer Science at North Carolina State University. After graduating from the Jeffrey S. Raikes School of Computer Science and Management, I built a career in software engineering and software engineering education research and received my Ph.D. in Computer Science from the University of Nebraska-Lincoln under the supervision of Sebastian Elbaum. My research makes innovative contributions to our knowledge of software engineering from a technical perspective (e.g., program analysis), human perspective (e.g., human aspects of software engineering, software product management), and educational perspective (e.g., comparative comprehension of algorithms). As examples, I have explored how refactoring a regular expression can improve comprehension (pdf), how a constraint solver can identify code for a human to reuse (pdf), and how cross-language code-to-code search may help developers learn a new language (pdf). These efforts combine analysis (refactoring, semantic code search, code-to-code search) with human factors (comprehension, reuse, learning). The innovative and influential nature of this research has been recognized by the computer science community at large, as I have been awarded over $2,000,000 in federal grants including an NSF CAREER award. In addition to my scholarly contributions, I am active in the software engineering research community’s top conferences as an author, reviewer, and organizer. I am intentional about mentoring the next generation. Let’s chat! Would you like to set a meeting? My calendar is available for booking appointments!",
  "content_length": 1860,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:57"
}