{
  "name": "Katherine J. Kuchenbecker [IS]",
  "homepage": "https://hi.is.mpg.de",
  "status": "success",
  "content": "Haptic Intelligence – Max Planck Institute for Intelligent Systems Institute Homepage Institute Homepage Sign In We study touch-based interaction, invent new haptic interfaces, and play with robots. Have you noticed that computers can show beautiful images and play clear sounds, but they don't let you physically touch digital items? Similarly, most robots are surprisingly unskilled at physically interacting with the real world and with people. Led by Katherine J. Kuchenbecker, the MPI-IS Haptic Intelligence department aims to elevate and formalize our understanding of touch cues while simultaneously discovering new opportunities for their use in interactions between humans, computers, and machines. We leverage scientific knowledge about the sense of touch to create haptic interfaces that enable a user to interact with virtual objects and distant environments as though they were real and within reach.  One key insight in this endeavor has been that tactile cues, such as high-frequency tool vibrations and the making and breaking of contact, convey rich mechanical information that is necessary to make the interaction feel real.  This research led us to realize that autonomous robots can also benefit from attending to the dynamic tactile cues that occur as they manipulate objects in their environment and engage in social physical interaction with humans. Director Katherine J. Kuchenbecker Director Admin Team Sarah Dressler Administrative Staff Lindsay Nadenau Administrative Staff Haptic Intelligence Highlights Conference Paper Haptic Intelligence Perceiving Systems 2025-10-01 Contact-Aware Refinement of Human Pose Pseudo-Ground Truth via Bioimpedance Sensing Article Haptic Intelligence Robotics 2025-10-01 Open-Source Hardware and Software Platform for Vibrotactile Motion Guidance News Haptic Intelligence Organizational Leadership and Diversity 2025-09-30 Carl Schneider Foundation supports innovative technology at the Max Planck Institute for Intelligent Systems in Stuttgart Conference Paper Haptic Intelligence Autonomous Learning Empirical Inference 2025-09-01 Adding Internal Audio Sensing to Internal Vision Enables Human-Like In-Hand Fabric Recognition with Soft Robotic Fingertips Conference Paper Haptic Intelligence Robotics Embodied Vision 2025-09-01 ISyHand: A Dexterous Multi-finger Robot Hand with an Articulated Palm IS Colloquium Haptic Intelligence 2025-08-11 Machine-Mediated Teamwork PhD Thesis Defense Haptic Intelligence 2025-06-30 Towards Robust and Flexible Robot State and Motion Estimation through Optimization and Learning IS Colloquium Haptic Intelligence 2025-06-10 Socially Aware Computing for Augmenting Virtual Social Interactions IS Colloquium Haptic Intelligence 2025-05-12 Human-Computer Integration IS Colloquium Haptic Intelligence 2025-05-05 Active Perception, Manipulation, and Personalized Navigation for Advanced Service Robots Article Haptic Intelligence 2025-05-01 Comparing Puncture-Detection Approaches for Manual Needle Insertions Through the Parietal Pleura News Haptic Intelligence 2025-04-16 Max Planck Partner Group established to strengthen ties between MPI-IS and the University of Tennessee Knoxville IS Colloquium Haptic Intelligence 2025-03-26 Dexterity and Haptics at the Manipulation and Touch Lab News Haptic Intelligence 2025-03-18 RIG hosts first German Robotics Conference Article Haptic Intelligence Perceiving Systems 2025-02-01 Wrist-to-Wrist Bioimpedance Can Reliably Detect Discrete Self-Touch Press Release Haptic Intelligence Robotic Materials 2025-01-07 Electrohydraulic Wearable Devices Create Unprecedented Haptic Sensations PhD Thesis Defense Haptic Intelligence 2024-12-17 Precision Haptics in Gait Retraining for Knee Osteoarthritis PhD Thesis Defense Haptic Intelligence 2024-10-23 Data-Driven Needle Puncture Detection for Urgent Medical Care Delivery in Space Article Haptic Intelligence Robotics 2024-10-01 Building Instructions You Can Feel: Edge-Changing Haptic Devices for Digitally Guided Construction PhD Thesis Defense Haptic Intelligence 2024-08-05 Engineering and Evaluating Naturalistic Vibrotactile Feedback for Telerobotic Assembly Article Haptic Intelligence 2024-08-01 Fingertip Dynamic Response Simulated Across Excitation Points and Frequencies Miscellaneous Haptic Intelligence Robotics 2024-08-01 Modeling Shank Tissue Properties and Quantifying Body Composition with a Wearable Actuator-Accelerometer Set Ph.D. Thesis Haptic Intelligence 2024-08-01 Engineering and Evaluating Naturalistic Vibrotactile Feedback for Telerobotic Assembly Conference Paper Haptic Intelligence 2024-07-01 Reflectance Outperforms Force and Position in Model-Free Needle Puncture Detection Bachelor Thesis Haptic Intelligence 2024-06-01 Kalman Filter Approach to Sensor Fusion of Ultra-Wideband Positioning and IMU Readings for Enhanced Indoor Tracking of Collaborating Humans Miscellaneous Haptic Intelligence Robotics 2024-05-01 GaitGuide: A Wearable Device for Vibrotactile Motion Guidance Article Haptic Intelligence 2024-05-01 Closing the Loop in Minimally Supervised Human-Robot Interaction: Formative and Summative Feedback Article Haptic Intelligence 2024-05-01 AiroTouch: Enhancing Telerobotic Assembly through Naturalistic Haptic Feedback of Tool Vibrations This website uses cookies to ensure you get the best experience. Learn more. Accept More information Download QR Code",
  "content_length": 5385,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:55"
}