{
  "name": "Katharina Breininger",
  "homepage": "https://www.caidas.uni-wuerzburg.de/research-groups/pattern-recognition",
  "status": "success",
  "content": "Pattern Recognition - Center for Artificial Intelligence and Data Science Intern Animation stoppen Center for Artificial Intelligence and Data Science generated with DALL·E The Pattern Recognition group, led by Katharina Breininger, works on the understanding and development of robust and generalizable machine learning approaches in different interdisciplinary domains, with a focus on medicine and medical imaging. We are interested in general aspects of machine learning, including representation learning, generalization under domain shifts, and labeling strategies including human factors and human-AI collaboration. We further develop open-source tools and datasets, including tools for semi-automatic and collaborative annotation. Additionally, we apply our insights in the context of (bio)medical research, for instance, in intraoperative and multimodal imaging as well as machine learning for microscopy and pathology. Prof. Dr. Katharina Breininger Professorship for Pattern Recognition John-Skilton-Str. 4a 97074 Würzburg Gebäude: John-Skilton-Str. 4a Raum: 04.B.03 Telefon: +49 931 31-81914 E-Mail: katharina.breininger@uni-wuerzburg.de Googe Scholar Profile Kontakt Center for Artificial Intelligence and Data Science (CAIDAS) Campus Hubland Nord Emil-Fischer-Straße 50 97074 Würzburg E-Mail Suche Ansprechperson Hubland Nord, Gebäude 50 HomeThe UniversityStudying at JMUResearchTeachingInstitutionsInternationalThe UniversityNewsEventsDates and DeadlinesDegree Programmes and SubjectsVacanciesStaff MembersGlossary of Administrative TermsServicesUniversity LibraryIT ServicesUniversity SportAcademic Advisory ServiceExamination OfficeStudent AffairsStudent RepresentationCareer CentreYour JMUWueStudyWueCampusClass ScheduleOnline-EnrolmentLibrary CatalogueContactPhone and Address DirectoryHow to Find UsPressAcademic Advisory ServiceTechnical Maintenance ServiceNeed help quickly? Seitenoptionen Sitemap Bildnachweise Nach oben Letzte Änderung: 14.01.2025 Seite: 262859/931 Bildnachweise ImpressumDatenschutzBarrierefreiheit",
  "content_length": 2040,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:47"
}