{
  "name": "Kathleen Creel",
  "homepage": "https://cssh.northeastern.edu/faculty/kathleen-katie-creel",
  "status": "success",
  "content": "Kathleen (Katie) Creel - College of Social Sciences and Humanities Skip to content Close CSSH Recognizes National Native American Heritage Month: Honoring the Histories, Cultures, and Contributions of Indigenous Peoples Apply People Philosophy and Religion Kathleen Creel Assistant Professor of Philosophy and Computer Science Katie Creel is an assistant professor of philosophy and computer science at Northeastern University, holding joint appointments in the College of Social Sciences and Humanities and Khoury College of Computer Sciences. Her research explores the moral, political, and epistemic implications of machine learning as it is used in automated decision-making and in science. Before joining Northeastern, Creel was the Embedded EthiCS fellow in the Center for Ethics in Society and the Institute for Human-Centered Artificial Intelligence at Stanford University. In this role, she worked with the Stanford Computer Science department to embed ethics in the core curriculum. Creel worked as a software engineer at MIT Lincoln Laboratory and subsequently pursued her doctorate in history and philosophy of science from the University of Pittsburgh. She holds a master’s in philosophy from Simon Fraser University, and a bachelor’s in computer science and philosophy from Williams College. View CV Related Schools & Departments Philosophy and Religion Education PhD, 2020, History and Philosophy of Science, University of Pittsburgh Contact k.creel@northeastern.edu Related Topics Science, Technology, and Society Kathleen ’s Colleagues John Basl Associate Professor of Philosophy Elizabeth Bucar Professor of Religion; Dean's Leadership Fellow Patricia Illingworth Professor of Philosophy and Business; Lecturer, Law and Public Policy M. Whitney Kelting Associate Professor of Religious Studies Jung Lee Associate Professor of Religious Studies; Undergraduate Program Director (Religious Studies) In Memoriam Stephen Nathanson Professor Emeritus Serena Parekh Associate Dean of Faculty Affairs; Distinguished Professor of Philosophy Ronald Sandler Professor of Philosophy; Director, Ethics Institute Rory Smead Professor of Philosophy; Ronald L. and Linda A. Rossetti Professor for the Humanities; Chair, Department of Philosophy and Religion Michael Lipton Professor Emeritus Joseph Wellbank Professor Emeritus Sheila Winborne Teaching Professor of Religion Candice Delmas Associate Professor of Philosophy and Political Science Branden Fitelson Distinguished Professor of Philosophy Benjamin Yelle Teaching Professor of Philosophy and Religion",
  "content_length": 2562,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:54"
}