{
  "name": "Katharina Kohls",
  "homepage": "https://kkohls.info",
  "status": "success",
  "content": "Katharina Kohls Katharina Kohls Head of System Security ChairRuhr University Bochum About Me I'm professor at the Ruhr University Bochum (Germany) and head of the chair for system security. The research focus of my group is on the security and privacy of mobile network infrastructures. Before returning to RUB, I was an assistant professor in the Digital Security Group of the Radboud University in Nijmegen (NL). Prior to this, I was a postdoctoral researcher at the Systems Security Chair of the Ruhr University Bochum within the excellence cluster for Cyber Security in the Age of Large-Scale Adversaries CASA. My research focuses on the security and privacy of mobile networks. This involves the security analysis of existing specifications, implementations, or configurations of mobile network components in 4G, 5G, and beyond. We further analyze the privacy implications of existing flaws for the different actors in a mobile network. This involves the investigation of information leakage in the communication, activity information of users, and other meta data that contains sensitive information. Vacancy Work Environment You will be appointed at the chair for System Security at the Faculty of Computer Science. We are part of the Horst Görtz Institute and the Excellence Cluster CASA (Cyber Security in the Age of Large-Scale Adversaries). At this location in Bochum, we pursue the clear goal of ensuring that the digital world is sustainably more secure. Together, our researchers develop effective solutions against powerful cyber attackers. In doing so, demonstrating international excellence, interdisciplinary research, and innovative approaches. To further strengthen our group, we are looking for a PhD candidate in the area of computer security. The position focuses on mobile network security and privacy. Research Focus The research focus can be tuned to your interests. You will be expected to investigate different classes of attacks on mobile networks or communication networks in general. This requires the design and implementation of simulation models, setting up 4G and 5G lab networks, and large-scale measurements on real-world infrastructures. In a following step, you will process and analyze the collected data in order to draw conclusions. To investigate possible new attack vectors and defenses against existing attacks, you transfer and apply common methods from other research areas in order to find creative new solutions. Requirements Master's degree in computer science or a relevant discipline Excellenct programming skills Good command of spoken and written English Good communication skills and the ability to communicate with peers and stakeholders Next Steps Please check if you meet the above requirements and are motivated to begin the journey! For an application, please send the following documents via email: CV including names and contact information of two references Motivation Letter Copy of Master's degree transcript Copy of Master's thesis The position is open and can be filled immediately. If you have any questions, feel free to contact me.",
  "content_length": 3101,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:48"
}