{
  "name": "Katharina Kann",
  "homepage": "https://kelina.github.io",
  "status": "success",
  "content": "Katharina Kann Katharina Kann Assistant Professor Of Computer Science · University of Colorado Boulder · CV · katharina.kann@colorado.edu Website last updated on 01/28/2023. Universal Natural Language Processing: How can we build natural language processing systems that work for all of the world’s languages? While an enormous amount of time, effort, and resources has been invested into developing technology for English, other languages are often overlooked. I am convinced that, in order to make NLP technologies accessible and useful for a wider and more diverse variety of users, more emphasis should be put on developing models for languages besides English, including low-resource languages. Thus, an important goal of my research is to develop computational approaches which perform well across a large variety of languages which might differ from English in their typology as well as the amount of available resources. Deep Learning · Multilingual NLP · Computational Morphology · NLP for Educational Applications · Language Grounding · NLP for Medical Applications · Low-resource Machine Translation Publications 2023 Abteen Ebrahimi, Arya D. McCarthy, Arturo Oncevay, John E. Ortega, Luis Chiruzzo, Rolando Coto-Solano, Gustavo A. Giménez-Lugo, and Katharina Kann. Meeting the Needs of Low-Resource Languages: Exploring Automatic Alignments via Pretrained Models. In Proceedings of the Conference of the European Chapter of the Association for Computational Linguistics, Dubrovnik, May 2023 (to appear). 2022 Katharina Kann, Abteen Ebrahimi, Manuel Mager, Arturo Oncevay, John E. Ortega, Annette Rios, Angela Fan, Ximena Gutierrez-Vasques, Luis Chiruzzo, Gustavo A. Giménez-Lugo, Ricardo Ramos, Ivan Vladimir Meza Ruiz, Elisabeth Mager, Vishrav Chaudhary, Graham Neubig, Alexis Palmer, Rolando Coto-Solano, and Ngoc Thang Vu. AmericasNLI: Machine translation and natural language inference systems for Indigenous languages of the Americas. In Frontiers in Artificial Intelligence, 2022. Katharina Kann, Shiran Dudy, and Arya D. McCarthy. A Major Obstacle for NLP Research: Let’s Talk about Time Allocation! In Proceedings of the Conference on Empirical Methods in Natural Language Processing, Abu Dhabi, November 2022. Adam Wiemerslage, Shiran Dudy, and Katharina Kann. A Comprehensive Comparison of Neural Networks as Cognitive Models of Inflection. In Proceedings of the Conference on Empirical Methods in Natural Language Processing, Abu Dhabi, November 2022. Rajat Bhatnagar, Ananya Ganesh, and Katharina Kann. CHIA: CHoosing Instances to Annotate for Machine Translation. In Findings of the 2022 Conference on Empirical Methods in Natural Language Processing, November 2022. Trevor A. Hall, Maria Valentini, Eliana Colunga, and Katharina Kann. Generate Me a Bedtime Story: Leveraging Natural Language Processing for Early Vocabulary Enhancement. In Proceedings of the Workshop on NLP for Positive Impact, Abu Dhabi, November 2022. Katharina Kann, Abteen Ebrahimi, Kristine Stenzel, and Alexis Palmer. Machine Translation Between High-resource Languages in a Language Documentation Setting. In Proceedings of the First Workshop on Applying NLP to Field Linguistics, Gyeongju, October 2022. Ananya Ganesh, Hugh Scribner, Jasdeep Singh, Katherine Goodman, Jean Hertzberg, and Katharina Kann. Response Construct Tagging: NLP-Aided Assessment for Engineering Education. In Proceedings of the 17th Workshop on Innovative Use of NLP for Building Educational Applications, Seattle, July 2022. Katharina Kann, Abteen Ebrahimi, Joewie J. Koh, Shiran Dudy, and Alessandro Roncone. Open-domain Dialogue Generation: What We Can Do, Cannot Do, And Should Do Next. In Proceedings of the 4th Workshop on NLP for Conversational AI, Dublin, May 2022. Abteen Ebrahimi, Manuel Mager, Arturo Oncevay, Vishrav Chaudhary, Luis Chiruzzo, Angela Fan, John Ortega, Ricardo Ramos, Annette Rios, Ivan Vladimir Meza Ruiz, Gustavo A. Giménez-Lugo, Elisabeth Mager, Graham Neubig, Alexis Palmer, Rolando Coto-Solano, Thang Vu, and Katharina Kann. AmericasNLI: Evaluating Zero-shot Natural Language Understanding of Pretrained Multilingual Models in Truly Low-resource Languages. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics, Dublin, May 2022. Yoshinari Fujinuma, Jordan Lee Boyd-Graber, and Katharina Kann. How Does Multilingual Pretraining Affect Cross-Lingual Transferability? In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics, Dublin, May 2022. Adam Wiemerslage, Miikka Silfverberg, Changbing Yang, Arya D. McCarthy, Garrett Nicolai, Eliana Colunga, and Katharina Kann. Morphological Processing of Low-Resource Languages: Where We Are and What's Next. In Findings of the 60th Annual Meeting of the Association for Computational Linguistics, May 2022. Manuel Mager, Arturo Oncevay, Elisabeth Mager, Katharina Kann, and Thang Vu. BPE vs. Morphological Segmentation: A Case Study on Machine Translation of Four Polysynthetic Languages. In Findings of the 60th Annual Meeting of the Association for Computational Linguistics, May 2022. 2021 Cory Paik, Stephane Aroca-Ouellette, Alessandro Roncone, and Katharina Kann. The World of an Octopus: How Reporting Bias Influences a Language Model's Perception of Color. In Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing, Punta Cana, November 2021. Atul Kr Ojha, Chao-Hong Liu, Katharina Kann, John Ortega, Sheetal Shatam, Theodorus Fransen. Findings of the LoResMT 2021 Shared Task on COVID and Sign Language for Low-resource Languages. In Proceedings of the 4th Workshop on Technologies for MT of Low Resource Languages, online, August 2021. Adam Wiemerslage, Arya McCarthy, Alexander Erdmann, Garrett Nicolai, Manex Agirrezabal, Miikka Silfverberg, Mans Hulden, and Katharina Kann. Findings of the SIGMORPHON 2021 Shared Task on Unsupervised Morphological Paradigm Clustering. In Proceedings of the Shared Task of the 18th SIGMORPHON Workshop on Computational Research in Phonetics, Phonology, and Morphology, online, August 2021. Andrew Gerlach, Adam Wiemerslage and Katharina Kann. Paradigm Clustering with Weighted Edit Distance. In Proceedings of the Shared Task of the 18th SIGMORPHON Workshop on Computational Research in Phonetics, Phonology, and Morphology, online, August 2021. Abteen Ebrahimi and Katharina Kann. How to Adapt Your Pretrained Multilingual Model to 1600 Languages. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics, online, August 2021. Rajat Bhatnagar, Ananya Ganesh, and Katharina Kann. Don’t Rule Out Monolingual Speakers: A Method For Crowdsourcing Machine Translation Data. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics, online, August 2021. Stephane Aroca-Ouellette, Cory Paik, Alessandro Roncone, and Katharina Kann. PROST: Physical Reasoning of Objects through Space and Time. In Findings of the 59th Annual Meeting of the Association for Computational Linguistics, August 2021. Ananya Ganesh, Martha Palmer, and Katharina Kann. What Would a Teacher Do? Predicting Future Talk Moves. In Findings of the 59th Annual Meeting of the Association for Computational Linguistics, August 2021. Manuel Mager, Arturo Oncevay, Abteen Ebrahimi, John Ortega, Annette Rios, Angela Fan, Ximena Gutierrez-Vasques, Luis Chiruzzo, Gustavo Giménez-Lugo, Ricardo Ramos, Ivan Vladimir Meza Ruiz, Rolando Coto-Solano, Alexis Palmer, Elisabeth Mager-Hois, Vishrav Chaudhary, Graham Neubig, Ngoc Thang Vu, and Katharina Kann. Findings of the AmericasNLP 2021 Shared Task on Open Machine Translation for Indigenous Languages of the Americas. In Proceedings of the First Workshop on Natural Language Processing for Indigenous Languages of the Americas, online, June 2021. Katharina Kann and Mauro M. Monsalve-Mercado. Coloring the Black Box: What Synesthesia Tells Us about Character Embeddings. In Proceedings of the 16th Conference of the European Chapter of the Association for Computational Linguistics, online, April 2021. Beilei Xiang, Changbing Yang, Yu Li, Alex Warstadt and Katharina Kann. CLiMP: A Benchmark for Chinese Language Model Evaluation. In Proceedings of the 16th Conference of the European Chapter of the Association for Computational Linguistics, online, April 2021. 2020 Nikhil Prabhu and Katharina Kann. Making a Point: Pointer-Generator Transformers for Disjoint Vocabularies. In Proceedings of the 1st Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics and the 9th International Joint Conference on Natural Language Processing Student Research Workshop, online, December 2020. Best Paper Award. Jason Phang*, Iacer Calixto*, Phu Mon Htut, Yada Pruksachatkun, Haokun Liu, Clara Vania, Katharina Kann and Samuel R. Bowman. English Intermediate-Task Training Improves Zero-Shot Cross-Lingual Transfer Too. In Proceedings of the 1st Conference of the Asia-Pacific Chapter of the Association for Computational Linguistics and the 9th International Joint Conference on Natural Language Processing, online, December 2020. Rajat Agarwal and Katharina Kann. Acrostic Poem Generation. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing, online, November 2020. Manuel Mager, Özlem Çetinoğlu and Katharina Kann. Tackling the Low-resource Challenge for Canonical Segmentation. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing, online, November 2020. Sarah Moeller, Ling Liu, Changbing Yang, Katharina Kann and Mans Hulden. IGT2P: From Interlinear Glossed Texts to Paradigms. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing, online, November 2020. Katharina Kann*, Arya D. McCarthy*, Garrett Nicolai and Mans Hulden. The SIGMORPHON 2020 Shared Task on Unsupervised Morphological Paradigm Completion. In Proceedings of the 17th SIGMORPHON Workshop on Computational Research in Pho",
  "content_length": 20245,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:46"
}