{
  "name": "Kathleen Steinhöfel",
  "homepage": "https://www.kcl.ac.uk/people/kathleen-steinhofel",
  "status": "success",
  "content": "Kathleen Steinhöfel | King's College London Skip to main contentDr Kathleen Steinhöfel Reader in Computer ScienceResearch interestsComputer scienceContact details+44 020 7848 1590kathleen.steinhofel@kcl.ac.ukBiographyResearch Interests Local search algorithms for combinatorial optimisation. Energy landscape analysis. Applied algorithmics. Structure prediction in molecular biology. Evolutionary computation. More Information Research Profile Research Funding Personal Website PublicationsResearchResearchSustainability HubThe Sustainability Hub consolidates the research related to sustainabilityHealth HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Finance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Algorithms and Data AnalysisThe group develops algorithmic solutions and concrete implementations for various applications.RNA BiologyRNA is at the forefront of biomedical research for its central role in how information is transferred from DNA to protein. This Research Interest Group is open to all interested parties from across the University. NewsNews20 July 2018Informatics researchers awarded $75,000 PLuS Alliance Accelerator Award to study avian fluA team involving Dr Kathleen Steinhofel, Reader in the Department of Informatics, has been awarded a $75,000 PLuS Alliance Accelerator Award to study how...HealthTechnology & SciencePublicationsResearchNewsResearchSustainability HubThe Sustainability Hub consolidates the research related to sustainabilityHealth HubThe Health Hub centres on computational characterisation of medically relevant study cases and data. Finance HubThe Finance Hub conducts fundamental and applied research at the intersection of finance and computation, a sector which is colloquially known as FinTech.Algorithms and Data AnalysisThe group develops algorithmic solutions and concrete implementations for various applications.RNA BiologyRNA is at the forefront of biomedical research for its central role in how information is transferred from DNA to protein. This Research Interest Group is open to all interested parties from across the University. News20 July 2018Informatics researchers awarded $75,000 PLuS Alliance Accelerator Award to study avian fluA team involving Dr Kathleen Steinhofel, Reader in the Department of Informatics, has been awarded a $75,000 PLuS Alliance Accelerator Award to study how...HealthTechnology & ScienceBased inDepartment of InformaticsFaculty of Natural, Mathematical & Engineering Sciences",
  "content_length": 2638,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:57"
}