{
  "name": "Katharina Reinecke",
  "homepage": "https://www.cs.washington.edu/people/faculty/reinecke",
  "status": "success",
  "content": "Katharina Reinecke, Professor - Paul G. Allen School of Computer Science & Engineering Skip to content Enter search text Current site All the UW Search scope Current site All the UW Katharina Reinecke Professor Associate Director for Research and Communication Paul G. Allen Professor in Computer Science & Engineering Adjunct, Department of Human-Centered Design & Engineering Focus Area: Artificial Intelligence, Human-Centered Computing Expertise: Ethics & Fairness; Human-Centered AI; Human-Computer Interaction Email: reinecke@cs.washington.edu Office: CSE 594 Faculty Webpage Wildlab DUB Group (Design. Use. Build.) Biography: Katharina Reinecke is a Professor and Associate Director of Research and Communication in the Paul G. Allen School of Computer Science & Engineering at the University of Washington where she directs the Wildlab. She’s also affiliated with the Department of Human-Centered Design and Engineering and part of the DUB group at UW. Reinecke is broadly interested in Human-Computer Interaction, but specifically in developing digital technology that is equally usable and useful for everyone. Her lab both explores how technology can be biased against people around the globe who are unlike the small groups of people that created it, and develops new technology that overcomes these biases. This work has shown that commonly used technology, from online communities to scheduling software and MOOCs can be less usable, understandable, trustworthy, visually appealing, and engaging for people from non-Western countries and for people who deviate in their values, language, age, education level, or abilities from the average developer in Western technology hubs. Reinecke and her colleagues often use their virtual lab, the LabintheWild, to study these issues at large scale, and then build systems that help designers, developers, and researchers to better support the needs and perspectives of diverse people. Reinecke was paper co-chair for UIST 2019 and CSCW 2022. She’s a co-founder of Augury Design Inc., a startup that predicts the success of website designs based on LabintheWild data. Her work has been funded by the National Science Foundation, Microsoft, Google, Adobe, and Facebook (Meta). She has been honored to receive an NSF CAREER award, a Swiss Computer Science Challenge Award, Best Paper and Honorable Mention awards at CHI, CSCW, ASSETS, and other conferences, the Mercator Prize, and the Madrona Prize by the Madrona Venture Group. As a little kid, she won a huge gingerbread house for the best bakery painting in her neighborhood. Reinecke received her Ph.D. in Computer Science from the University of Zurich where she was advised by Avi Bernstein, and did a postdoc with Krzysztof Gajos at Harvard University. Prior to joining the University of Washington, she was an Assistant Professor in the School of Information at the University of Michigan. She grew up in Germany, but has lived in 10 cities in 5 countries on 4 different continents. Hence her interest in culture!",
  "content_length": 3024,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:48"
}