{
  "name": "Katherine A. Daniell",
  "homepage": "https://cybernetics.anu.edu.au/people/katherine-daniell",
  "status": "success",
  "content": "Katherine Daniell | ANU School of Cybernetics College Sharepoint ANU College of Systems & Society Search this site Search this site (powered by Google) Powered by Google Close search Bridge-Builder. Water enthusiast. Time warp expert.# Katherine is the Interim Director of the School of Cybernetics. Trained in engineering, arts and public policy, her work focusses on collaborative and inclusive approaches to policy, action and education for sustainable development. Katherine delights in the clash and novel synthesis of disciplinary cultures and uses cybernetics to convene challenging and productive conversations. As a transdisciplinary academic, she has worked in Australia and globally on areas including international science and technology cooperation, water governance, risk, leadership, AI systems, politics and cultures of innovation, and climate change adaptation. She has produced over 100 academic publications including 4 books and a diverse range of book chapters, papers, reports, and edited collections, and has graduated over a dozen PhD students. Katherine was the Inaugural Convenor of the Master of Applied Cybernetics program from 2019-22. Katherine is also currently a John Monash Scholar, Director of the Peter Cullen Water and Environment Trust, Member of the Independent Hydroclimate Expert Science Panel for the Murray-Darling Basin Authority, Member of the National Committee on Water Engineering, Editor of the Australasian Journal of Water Resources, member of the Rivers Committee of the Initiatives of the Future of Great Rivers, President of the French-Australian Association for Research and Innovation (AFRAN) Inc., and a Chevalier (Knight) in the French Ordre National du Mérite. She holds several affiliations with other parts of the university in true bridge-building style, including as a member of the leadership team of the Institute for Water Futures and as a Professor in the Fenner School of Environment and Society. One does not simply do all of the above without engaging in the dark art of warping time (it’s the only logical explanation…). Areas of Expertise: Cybernetics, Artificial Intelligence (AI), Water Management, Education, Environment, Europe, France, Pacific, Society & Culture, Technology, Sustainability. You are on Aboriginal land. The Australian National University acknowledges, celebrates, and pays our respects to the Ngunnawal and Ngambri people of the Canberra region and to all First Nations Australians on whose traditional lands we meet and work as the oldest continuing culture and knowledges in human history. I acknowledge bars search times",
  "content_length": 2621,
  "method": "requests",
  "crawl_time": "2025-12-01 13:40:51"
}