{
  "name": "Katja Daniela Mombaur",
  "homepage": "https://uwaterloo.ca/robohub/profile/kmombaur",
  "status": "success",
  "content": "Katja Mombaur | RoboHub | University of Waterloo Skip to main content Katja Mombaur Adjunct Professor and former Canada Excellence Research Chair in Human-Centred Robotics and Machine Intelligence Email: Katja.mombaur@uwaterloo.ca Phone: 519-888-4567 x40362 Biography Professor Katja Mombaur is the former Canada Excellence Research Chair in Human-Centred Robotics and Machine Intelligence. She is an expert on human-robot interaction, wearable and humanoid robots, and human motion analysis. In the RoboHub, Professor Mombaur conducts research on developing robots with “motion intelligence,” a particular kind of AI that incorporates an understanding of human movement and anticipation of human actions. She also works with wearable and humanoid robots to determine how increasingly intelligent machines can operate safely and efficiently in a complex human world, and how they should behave in that world. She uses mathematical modelling to teach robots how to move and to design the best possible assisstive devices, such as exoskeletons and prosthetic limbs, for the elderly and disabled. Research Interests human-robot interaction wearable robots rehabilitation robots intelligent assistive devices humanoid robots human movement analysis optimal control model-based control multibody systems modeling Education 2001, Doctorate Applied Mathematics (Dr. rer. nat.), Heidelberg University, Germany 1995, Diploma (equivalent to Master's degree) Aerospace Engineering), University of Stuttgart, Germany Awards 2019 Canada Excellence Research Chair in Human-Centred Robotics and Machine Intelligence Teaching* ME 780 - Special Topics in Mechatronics Taught in 2022 * Only courses taught in the past 5 years are displayed. In The News TALOS’s smaller \"sibling\" makes its robotic debut at Waterloo Graduate studies I am currently seeking to accept graduate students. Please submit your graduate studies application and include my name as a potential advisor.",
  "content_length": 1957,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:02"
}