{
  "name": "Katta Spiel",
  "homepage": "http://katta.mere.st",
  "status": "success",
  "content": "Katta Spiel – Critical Access in Embodied Computing Skip to content My name is Katta Spiel. Eine Vorstellung auf Deutsch finden Sie hier. I research marginalised perspectives on technology. My work informs  design and engineering in critical ways to support the development of technologies that account for the diverse realities they operate in.  My research is situated at the intersection of Computer Science, Design and Cultural Studies.  Drawing on methods from (Critical) Participatory Design and Action Research, I collaborate with disabled, neurodivergent and/or nonbinary peers in conducting explorations of novel potentials for designs, methodological contributions to Human-Computer Interaction and innovative technological artefacts. Currently, I am an Assistant Professor for “Critical Access in Embodied Computing” at the HCI Group of TU Wien (Vienna University of Technology), where I also lead a small team as part of the ERC Starting Grant ACCESSTECH (Experiencing Access with Interactive Computing).  Previously, I worked on at an FWF Hertha Firnberg position related to “Exceptional Norms: Marginalised Bodies in Interaction Design”.  Before that, I researched the attitudes, desires and interests of neurodivergent youth concerning play with digital games in collaboration with Kathrin Gerling and Fares Kayali and was part of the FWF-funded projects  Social Play Technologies and OutsideTheBox, both at TU Wien. There, I investigated the experiences of autistic children in technological contexts, moving away from empathy and developed a concept for Participatory Evaluation. Both my bachelor degrees in Media Culture (B.A.) and Media Systems (B.Sc.) as well as my Master’s degree in Computer Science and Media (M.Sc.), I have acquired at Bauhaus Universität Weimar. From 2025 through to 2029, I am serving as a member on the Austrian Monitoring Committee on the Implementation of the UN Convention on the Rights of People with Disabilities. In 2024, I have been elected as a member of the Young Academy of the Austrian Academy of Sciences.  In 2022, I received the Förderungspreis Mathematik, Informatik, Naturwissenschaft, Technik of the city of Vienna and in 2020, I was awarded the SIGCHI Outstanding Dissertation Award. Outside (and sometimes inside) of my research, I also like to craft, predominantly with textiles.  I have also been a member of the City Council of Weimar (2009-2014). My pronouns are they/them.  You may address me as Mx., Dr. or Ass(t). Prof. This website uses cookies to improve your experience. I'll assume you're ok with this, but you can opt-out if you wish.AcceptReject Read MorePrivacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
  "content_length": 3854,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:06"
}