{
  "name": "Kaveh Fathian",
  "homepage": "https://sites.google.com/view/kavehfathian",
  "status": "success",
  "content": "Kaveh FathianSearch this siteEmbedded FilesSkip to main contentSkip to navigationWelcome!ARIA lab: https://www.ariarobotics.com/Visit our lab website to see members, papers, code, and videos.ARIA lab has openings for fully-funded PhD positions! Please apply here. CVPapersCodeVideosAbout me:I am an Assistant Professor of Computer Science at the Colorado School of Mines, and director of the Autonomy, Robotics, & Intelligent Algorithms (ARIA) Lab. Before joining Mines, I was a research scientist at MIT. I received my PhD in Electrical Engineering, MS in Mathematics, and MS in Electrical Engineering from UT Dallas. I got my BS in Electrical Engineering from IKIU, Iran.  My CV is available here. Research overview:Our research at ARIA lab focuses on robotics and computer vision topics such as robust perception, visual navigation, simultaneous localization and mapping (SLAM), multi-robot SLAM, and multi-agent systems. The mission of our lab is to pioneer algorithmic technologies for robust robotic perception and autonomy, such as certifiable perception algorithms, relaxation/estimation techniques for computationally challenging robotic problems, and algorithms that are extremely robust to errors/outliers in the data (e.g., 99% outliers). ARIA lab integrates these technologies into real-world robots, and expands further to multi-robot settings to create a resilient internet of robot teams that communicate and compute on the cloud.   News:I served as an Associate Editor for IROS 2024I served as a reviewer of RSS 2024I served as an Associate Editor for ICRA 2024 I organized the IROS 2023 workshop on robotic perception and mapping in Detroit on Oct 5I organized the ICRA 2022 workshop on robotic perception and mapping, which had the highest number of registrants across all ICRA workshops. Invited talks are available at https://youtu.be/lu2e-ENmgqc (May 22)I organized the ICRA 2020 workshop on emerging data association techniques. Talks are available at https://youtu.be/-lEVvtsfz0I (May 20)Calendar: Contact info:Emails:  fathian@ariarobotics.com   (preferred)kaveh.fathian@mines.edu  Office:  Brown Hall, 280-NColorado School of MinesGoogle SitesReport abuseGoogle SitesReport abuse",
  "content_length": 2205,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:07"
}