{
  "name": "Kavita Bala",
  "homepage": "http://www.cs.cornell.edu/~kb",
  "status": "success",
  "content": "Kavita Bala Kavita Bala Provost Professor of Computer Science Cornell University Address: kavitabala@cornell.edu, provost@cornell.edu phone: (607) 255 9924 300 Day Hall, Cornell University, Ithaca NY 14853 Publications Mandala Project Bio Students PhD Lekha Revankar (PhD) Rajeev Datta (PhD) Utkarsh Mall(2023) Hubert Lin (2022) Fujun Luan (2021) Paul Upchurch (2018) Scott Wehrwein (2018) Pramook Khungurn (2017) Sean Bell (2016) Kevin Matzen (2016) Kyle Wilson (2016) Ivaylo Boyadzhiev (2015) Shuang Zhao (2014) Daniel Cabrini Hauagge (2014) Miloŝ Haŝan (2009) Adam Arbree (2009) Ganesh Ramanarayanan (2008) MS Hadi AlZayer Balazs Kovacs Dan Schroeder Timothy Condon Edgar Velazquez-Armendariz Funding National Science Foundation Google, Microsoft Research Interests: My research interests span computer vision, computer graphics, and human perception, including: Recognition: material recognition, visual search and detection Modeling: material and shape acquisition; fabric modeling; material representation and editing Rendering: realistic, physically-based rendering; scalable rendering Perception: translucency perception; material and lighting perception Education Doctor of Philosophy (PhD), EECS, Massachusetts Institute of Technology Master of Science (SM), EECS, Massachusetts Institute of Technology Bachelor of Technology (BTech), Computer Science & Engineering, Indian Institute of Technology, Bombay Awards and Recognition Fellow, American Academy of Arts & Sciences, 2025 SIGGRAPH 2025 Test-of-time Award, Learning Visual Similarity for Product Design With Convolutional Neural Networks (podcast) IIT Bombay Distinguished Alumnus Award, 2021 ACM SIGGRAPH Computer Graphics Achievement Award, 2020 [citation] ACM SIGGRAPH Academy, 2020 ACM Fellow, 2019 Fiona Ip Li '78 and Donald Li '75 Excellence in Teaching Award, College of Engineering, 2015 Best Paper Award, Computational Aesthetics, 2014 CACM Research Highlight, 2014 CACM Research Highlight, 2009 James and Mary Tien Excellence in Teaching Award, College of Engineering, 2009 James and Mary Tien Excellence in Teaching Award, College of Engineering, 2006 Affinito-Stewart Award, PCCW, 2005 MIT EECS Masters Award, 1995 Recent Publications Towards LLM Agents for Earth ObservationTerrabytes, ICML Workshop, '25 DiSciPLE: Learning Interpretable Programs for Scientific Visual Discovery CVPR '25 Scale-Aware Recognition in Satellite Images under Resource Constraints ICLR '25 AllClear: A Comprehensive Dataset and Benchmark for Cloud Removal in Satellite Imagery NeurIPS '25 (Track on Datasets and Benchmarks) Complete List of Publications... Broad Audience Talks CVPR (Computer Vision and Pattern Recognition) Keynote (2022) Stanford Human AI Spring Conference Keynote (2022) Eurographics Keynote (2020) Cornell Silicon Valley: Bridging the Virtual and the Real Cornell Summer Series: Virtual Realism and Computer Graphics Interviewing Charlie Van Loan Press Ann S. Bowers College of Computing and Information Science: Gift naming the Bowers College, Cornell Silicon Valley General interviews and coverage: ACM Member, LDV, Wired, CNN Tech, Observer, Austrian Radio Interview, Daily Caller, Small Biz Trends Deep Photo Style Transfer and Harmonization: 9to5Mac, The Verge, Gizmodo, Engadget, DPReview, Petapixel, 2-minute videos on photo style transfer, 2-minute videos on harmonization, Slash Gear, Apple Insider, The Next Web, BGR, New Atlas, Tech Spot, Uber Gizmo, Cornell Chronicle, .... Search on \"deep photo style transfer\" and \"deep harmonization\" for a full list of press coverage. Visual Search and GrokStyle: Forbes (2020), T_HQ (2020), TechCrunch (2018), TechCrunch (2017), Science Mag, AI Business, Digial Trends, Cornell Sun, IKEA Press release, ... StreetStyle and Fashion: Chronicle, Primed (KUOW), MIT Technology Review, Digital Trends, physorg, Chronicle, Press Release Point, Newswise, ... Rendering: Economist Mandala: NY Times Professional Activities Board of Trustees, Toyota Technological Institute, Chicago Emeritus board member, ColorStack (2023--2025) Advisor, Women In Graphics Research (WiGraph) Member, SIGGRAPH Academy Selection Committee, 2020--2023 Member, SIGGRAPH Outstanding Doctoral Dissertation Award Committee, 2020--2023 Member, SIGGRAPH Papers Advisory Group, 2018--2023 Chair, Computer Science Department, Cornell University, 2018--2020 Faculty Fellow, Atkinson Center for a Sustainable Future, 2016-- Founder and Chief Scientist, GrokStyle (acquired by Facebook), 2015--2018 Editor-in-Chief, Transactions on Graphics. 2015--2018 Papers Chair: ICCP 2021 (co-chairs: Yoav Schechner, Ori Katz): TPAMI Guest Editorial ICVGIP 2012 (co-chairs: Sharat Chandran, Bill Triggs) SIGGRAPH Asia 2011 Pacific Graphics 2010 (co-chairs: Pierre Alliez, Kun Zhou) Eurographics Symposium on Rendering 2005 (co-chairs: Phil Dutre) 10th IVMSP Workshop: Perception and Visual Signal Analysis (area chair) Senior Associate Editor: Transactions on Graphics, 2013--2014 Associate Editor: Computer Graphics Forum, 2012--2015 Transactions on Graphics, 2012-2013 Transactions on Visualization and Computer Graphics (TVCG), 2008-2012 Papers Program Committees: 2022: Area Chair CVPR 2021: Area Chair ICCV 2020: Area Chair CVPR 2018: Area Chair CVPR, SIGGRAPH 2017: SIGGRAPH, ICCP 2016: SIGGRAPH Asia 2015: SIGGRAPH 2014: SIGGRAPH Asia, Eurographics, Eurographics Symposium on Rendering 2013: Eurographics Symposium on Rendering, Pacific Graphics 2012: SIGGRAPH, Eurographics Symposium on Rendering, High Performance Graphics 2011: SIGGRAPH 2010: SIGGRAPH Asia, Applied Perception on Graphics and Visualization (APGV), Interactive 3D Graphics (I3D) 2009: SIGGRAPH 09, Interactive 3D Graphics (I3D), High Performance Graphics, Eurographics Symposium on Rendering (EGSR), Pacific Graphics (PG) 2008: SIGGRAPH Asia, Eurographics, Interactive 3D Graphics (I3D), Eurographics Symposium on Rendering (EGSR), Pacific Graphics (PG), Interactive Ray Tracing (IRT), Symposium on Point-Based Graphics (PBG) 2007: SIGGRAPH, Symposium on Point-based Graphics (PBG), Pacific Graphics (PG), Interactive 3D Graphics (I3D) 2006: SIGGRAPH, Symposium on Point-based Graphics (PBG), Eurographics Symposium on Rendering (EGSR),Symposium on Interactive Ray Tracing (IRT) 2005: Symposium on Point-based Graphics (PBG), Graphics Interface (GI) 2004: SIGGRAPH, Eurographics Symposium on Rendering (EGSR), Pacific Graphics (PG) 04, Symposium on Point-based Graphics (PBG) 2003: SIGGRAPH, Eurographics Symposium on Rendering (EGSR) 2002: Eurographics Rendering Workshop (EGWR) Papers Advisory Board: SIGGRAPH 2023, SIGGRAPH Asia 2015, SIGGRAPH Asia 2014, SIGGRAPH Asia 2013, SIGGRAPH 2012, SIGGRAPH Asia 2012, SIGGRAPH 2011, SIGGRAPH Asia 2010 Steering Committee: Eurographics Symposium on Rendering Posters Program Committee, SIGGRAPH 04 Courses CS6644, Modeling the World (Fall 14) CS4670/5670, Cornell's Introduction to Computer Vision (Spring 15, Spring 16) CS5625, Cornell's Advanced Interactive Graphics (Spring 13, Spring 12) CS4620/4621/5620/5621, Cornell's Introduction to Graphics and Practicum (Fall 15, Fall 12, Fall 11) CS5620, Cornell's advanced interactive graphics course (Fall 09) CS6620, Cornell's graduate advanced rendering graphics course (Spring 09) CS 3410, Cornell's Computer System Organization and Programming Course (Spring 14, Fall 08) CS 7690, Cornell's Graphics Seminar (Fall 15, Spring 15, Spring 13, Spring 12, Spring 09) CS 316, Cornell's Systems Programming (Fall 07) CS467/468, Cornell's Graphics II and Graphics Practicum (Spring 07, Spring 06, Spring 04) CS665, Cornell's graduate advanced interactive graphics course (Spring 08, Fall 06, Fall 04, Fall 03) ENGRG 150, Freshman advising (Fall 06) CS 718, Computer Graphics Seminar (Spring 07, Fall 04, Fall 03, Spring 03) Reusing Shading for Interactive Global Illumination (Game Developers Conference 04) Advanced Global Illumination (SIGGRAPH 02, SIGGRAPH 01) CS517, Cornell's graduate advanced graphics course (Fall 02, Fall 01) CS417 and CS 418, Cornell's introductory graphics course and practicum (Spring 02, Spring 01, Spring 00) Books Phil Dutre, Kavita Bala, Philippe Bekaert. Advanced Global Illumination A K Peters, 2nd Edition August 2006, Natick, MA Bibtex Editors: Kavita Bala and Phil Dutre. Rendering Techniques 2005 Springer Verlag June 2005, Konstanz, Germany Phil Dutre, Philippe Bekaert, and Kavita Bala. Advanced Global Illumination A K Peters, 1st Edition July 2003, Natick, MA Bibtex Patents Inventors: Kavita Bala, Fujun Luan, Shuang Zhao. Image rendering utlizing procedural yarn models Patent No. 10,410,380 Sep 10, 2019 Inventors: Ivaylo Boyadzhiev, Kavita Bala, Sylvain Paris. Systems and Methods for Computational Lighting Patent No. 9,483,815 B2 Nov 1 2016 Complete Publication List Chia Hsiang Kao, Wenting Zhao, Shreelekha Revnkar, Samuel Speas, Snehal Bhagat, Rajeev Datta, Cheng Perng Phoo, Utkarsh Mall, Carl Vondrick, Kavita Bala, Bharath Hariharan. Towards LLM Agents for Earth Observation Terrabytes, ICML Workshop '25 Paper, project page Utkarsh Mall, Cheng Perng Phoo, Mia Chiquier, Bharath Hariharan, Kavita Bala, Carl Vondrick. DiSciPLE: Learning Interpretable Programs for Scientific Visual Discovery CVPR '25 Paper, project page Shreelekha Revankar, Cheng Perng Phoo, Utkarsh Mall, Bharath Hariharan, Kavita Bala. Scale-Aware Recognition in Satellite Images under Resource Constraints ICLR '25 Paper, project page Hangyu Zhou, Chia-Hsiang Kao, Cheng Perng Phoo, Utkarsh Mall, Bharath Hariharan, Kavita Bala. AllClear: A Comprehensive Dataset and Benchmark for Cloud Removal in Satellite Imagery NeurIPS '25 (Track on Datasets and Benchmarks) Paper, project page Utkarsh Mall, Cheng Perng Phoo, Meilin Kelsey Liu, Carl Vondrick, Bharath Hariharan, Kavita Bala. Remote Sensing Vision-Language Foundation Models without Annotations via Ground Remote Alignment ICLR '24 Paper, project page Utkarsh Mall, Bharath Hariharan, Kavita Bala. Change-Aware Sampling and Contrastive Learning for Satellite Images CVPR '23 Paper",
  "content_length": 41416,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:11"
}