{
  "name": "Kay Robbins",
  "homepage": "http://www.cs.utsa.edu/~krobbins",
  "status": "success",
  "content": "﻿ Kay Robbins home page Kay Robbins Professor Emeritus Department of Computer Science University of Texas at San Antonio 210-458-5543 Laboratory page:http://visual.cs.utsa.edu Email: kay.robbins@utsa.edu Areas: Visual analysis, machine learning, data management Research: My research focuses on visualization, analysis and management of multimedia data sets, particularly those generated from EEG and physiological data. I am the UTSA lead on a large collaborative consortium research project sponsored by the US ARMY: CANCTA Neuroergonomics --- a project to instrument the brain and body at work using sophisticated real time data collection including high-resolution wireless EEG, eye tracking, and motion capture. The UTSA team, which works closely with researchers at the Army Research Laboratory, DCS Corporation, and five other academic partners, is developing analysis, visualization, and data handling tools for analyzing this data, which includes EEG, eye tracking, and other measures. I have had a long-term collaboration with members of the Swartz Center for Computational Neuroscience (SCCN) of University of California San Diego (UCSD) to develop standards and vocabularies for annotating brain imaging data. This collaboration includes Scott Makeig, Arno Delorme, Nima Bigdely-Shamlo, Tim Mullen, and Christian Kothe (the latter two now of Intheon). The group has been working on standardized methods for preprocessing data and tagging events. Efforts from the Robbins lab related to this collaboration have produced a number of open source analysis tools including the PREP Pipeline, a standardized preprocessing pipeline for EEG data, the HED (hierarchical event descriptors) tagging system for identifying experimental events, along with the CTAGGER tool set for managing tags, and BLINKER, a tool for automatically detecting and annotating blinks in EEG data. HED has been adopted as the event annotation system for BIDS (Brain Imaging Data Structure), which has become the de facto brain imaging data standard for the community. Her group contributed the validation code for HED in BIDS, and she is leading the revision of HED as part of its central role in the UCSD development of NEMAR, a computational portal that interfaces with OpenNeuro.org. Teaching: My teaching focus was developing curriculum and supporting infrastructure that is relevant, effective, and sustainable. Starting in 2008, and with the support of colleagues and NSF, I created materials and techniques for CS 1173 Data Analysis and Visualization. This course, which is currently required of biology majors, has recently become part of the mathematics section of the core curriculum. The course teaches students computing in the context of learning practical data analysis skills. The website for this course is: http://www.cs.utsa.edu/~cs1173 I was also actively involved in curriculum and program development in bioinformatics and was the UTSA PI on the NIH/NCI supported UTSA/UTHSCSA Cancer Bioinformatics Initiative. This effort brought together cancer researchers and quantitative scientists to further engage students in data-driven research in cancer and other diseases. Over the years I have taught courses in all areas of computer science at all levels. I enjoyed learning new things, organizing the ideas in a comprehensible way, and learning from my students as they learned. Although I am no longer teaching, I still enjoy learning new things and continue to do online courses and tutorials to get ideas in new areas. Some recent publications K. Robbins, J. Touryan, T. Mullen, C. Kothe, N. Bigdely-Shamlo (2020). How sensitive are EEG results to preprocessing methods: A benchmarking study. bioRxiv 2020.01.20.913327; doi: https://doi.org/10.1101/2020.01.20.913327. N. Bigdely-Shamlo, J. Touryan, A. Ojeda, C. Kothe, T. Mullen, and K. Robbins, (2019). Automated EEG mega-analysis I: Spectral and amplitude characteristics across studies, Neuroimage. 2019 Nov 23:116361. doi: 10.1016/j.neuroimage.2019.116361, PMID: 31770636. N. Bigdely-Shamlo, J. Touryan, A. Ojeda, C. Kothe, T. Mullen, and K. Robbins. (2019). Automated EEG mega-analysis II: Cognitive aspects of event related features, Neuroimage. 2019 Sep 4:116054. doi: 10.1016/j.neuroimage.2019.116054, PMID: 31491523. K. Su, W. D. Hairston, and K. Robbins (2018). EEG-Annotate: Automated identification and labeling of events in continuous signals with applications to EEG, J. Neuroscience Methods, 293(1), 359-374, PMID: 29061343, DOI: 10.1016/j.jneumeth.2017.10.011 (electronic version 2017). K. Kleifges, N. Bigdely-Shamlo, S. Kerick, and K. Robbins (2017). BLINKER: Automated extraction of ocular indices from EEG enabling large-scale analysis. Frontiers in Neuroscience: Neurotechnology. 03 February 2017 | https://doi.org/10.3389/fnins.2017.00012. K. Ball, W. D. Hairston, P. Franaszczuk, and K. Robbins (2016 eversion). BLASST: Band limited atomic sampling with spectral tuning with applications to utility line noise filtering. IEEE Transactions on Biomedical Eng. DOI: 10.1109/TBME.2016.2632119. N. Bigdely-Shamlo, J. Cockfield, S. Makeig, T. Rognon, C. LaValle, M. Miyakoshi, and K. Robbins (2016). Hierarchical Event Descriptors (HED): Semi-structured tagging for real-world events in large-scale EEG, Frontiers in Neuroinformatics doi: 10.3389/fninf.2016.00042. N. Bigdely-Shamlo, S. Makeig, and K. Robbins (2016). Preparing laboratory and real-world EEG data for large-scale analysis: A containerized approach, Frontiers in Neuroinformatics 1 08 March 2016 | http://dx.doi.org/10.3389/fninf.2016.00007. PMID: 27014048, PMCID: PMC4782059. K. Ball, N. Bigdely-Shamlo, T. Mullen, and K. Robbins (2016). PWC-ICA: A method for stationary ordered blind source separation with application to EEG. Computational Intelligence in Neuroscience. 2 June 2016 | doi: 10.1155/2016/9754813, PMID: 27340397. PMCID: PMC4909972. K-M. Su, W. Hairston, and K. Robbins (2016). Adaptive thresholding and reweighting to improve domain transfer learning for unbalanced data with applications to EEG, ICMLA 2016 (Dec. 18-20, Anaheim, CA). N. Bigdely-Shamlo, T. Mullen, C. Kothe, K.-M. Su, and K. Robbins (2015). The PREP pipeline: standardized preprocessing for large-scale EEG analysis, Frontiers in Neuroinformatics 18 June 2015 | http://dx.doi.org/10.3389/fninf.2015.00016. J. Meng, L. M. Merino, K. Robbins, Y. Huang (2014). Classification of imperfectly time-locked image RSVP events with EEG device, Neuroinformatics, 12(2):261-275. PMID: 24037139. V. Lawhern, S. Kerick, K. Robbins (2013). Detection of alpha spindling and frequency shifts using discounted AR models, BMC Neuroscience, 14:101 doi:10.1186/1471-2202-14-101, PMC3848457. V. Lawhern, W. D. Hairston, and K. Robbins (2013). DETECT: a MATLAB toolbox for event detection and identification in time series, with applications to artifact detection in EEG signals. PLoS ONE, 8(4):e62944.",
  "content_length": 6900,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:11"
}