{
  "name": "Kay Chen Tan",
  "homepage": "https://www.polyu.edu.hk/dsai/people/academic-staff/tankaychen",
  "status": "success",
  "content": "Prof. TAN Kay Chen | Department of Data Science and Artificial Intelligence Skip to main content People Open / close back People Academic Staff Professor of Practice Affiliate Faculty Member Supporting Staff Study Open / close back Study Undergraduate Programmes Open / close menu Prospective Students Current Students Minor Programme Taught Postgraduate Programme Open / close menu Master of Science in Artificial Intelligence and Big Data Computing Master of Science in Data Science and Analytics Research Postgraduate Programme Open / close menu PhD and MPhil in Data Science and Artificial Intelligence Dual PhD Degree Programme Hong Kong PhD Fellowship Scheme Fast-track Programme - DSA Subjects on Offer Programme Requirement Documents Experience and Opportunities Open / close back Experience and Opportunities Academic Advising Career Development Student Counselling Student Exchange Student Handbook Work-Integrated Education (WIE) Research Open / close back Research Research Directions Research Centers Research Postgraduate Study Research Projects News and Events Open / close back News and Events News Events About DSAI Open / close back About DSAI Message from Department Vision and Mission Contact Us Staff Quick Access Start main content Home People Academic Staff Prof. TAN Kay Chen Academic Staff PolyU Scholars Hub Prof. TAN Kay Chen Head and Chair Professor of Computational Intelligence BEng, PhD (Glasgow); FIEEE Location PQ838 Phone +852 2766 7271 mail kaychen.tan@polyu.edu.hk PolyU Scholars Hub ORCID ID SCOPUS ID Biography Professor Kay Chen Tan is the Founding Head and Chair Professor of Computational Intelligence of the Department of Data Science and Artificial Intelligence at The Hong Kong Polytechnic University. He is internationally recognised for his pioneering work in Computational Intelligence and Evolutionary Computation. Professor Tan’s contributions to adaptive evolutionary search, noise handling, and decision-making under uncertainty have become foundational references in the field. His research on evolutionary operational research has bridged optimisation theory with real-world decision-making systems, while his studies in neuromorphic computing have helped lay the groundwork for low-power, intelligent autonomous systems, contributing to the long-term pursuit of Artificial General Intelligence. Professor Tan’s scholarly influence is reflected in his prolific academic output and the global recognition it has garnered. He has co-authored eight books and published over 300 peer-reviewed journal articles, many of which appear in the prestigious IEEE Transactions series. His works have been collectively cited over 36,000 times, with an h-index of 94. His contributions to the scientific community have garnered him numerous accolades, including being named a Fellow of the Institute of Electrical and Electronics Engineers (IEEE) and a Senior Research Fellow of the Hong Kong Research Grants Council (RGC). Additionally, he has consistently ranked among the World’s Top 2% Most-Cited Scientists by Stanford University and has been recognised as a Highly Cited Researcher by Clarivate in 2024 and 2025. His research has also attracted substantial funding, having received over HK$20 million in major research grants over the past five years. These include the Collaborative Research Fund from the RGC and the Joint Fund Scheme from the National Natural Science Foundation of China. As a distinguished international leader in Computational Intelligence, Professor Tan has held numerous key editorial and leadership roles, including Chair of the IEEE Computational Intelligence Society (CIS) Fellow Evaluating Committee (2027) and CIS Vice-President for Publications (2021–2024). He served as Editor-in-Chief of the IEEE Transactions on Evolutionary Computation (2015–2020) and the IEEE Computational Intelligence Magazine (2010–2013), and currently acts as Chief Co-Editor of the Springer Book Series on Machine Learning: Foundations, Methodologies, and Applications. His contributions have been recognised with many prestigious accolades, including the IEEE CIS Evolutionary Computation Pioneer Award (2026), IEEE Congress on Evolutionary Computation Best Paper Award (2025), IEEE Conference on Artificial Intelligence Best Paper Award (2024), IEEE Computational Intelligence Magazine Outstanding Paper Award (2024, 2019), IEEE Andrew P. Sage Best Transactions Paper Award (2020), IEEE Transactions on Neural Networks and Learning Systems Outstanding Paper Award (2016), and the IEEE CIS Outstanding Early Career Award (2012). Beyond research excellence, Professor Tan has delivered over 80 plenary and keynote lectures and co-organised more than 60 international conferences, including in the roles as General Co-Chair for the 2019 IEEE Congress on Evolutionary Computation and the 2016 IEEE World Congress on Computational Intelligence, underscoring his global impact and leadership. Professional Qualifications Fellow of The Institute of Electrical and Electronics Engineers, INC Teaching Area Artificial Intelligence Evolutionary Computation Machine Learning Research Interests Artificial Intelligence Evolutionary Computation Machine Learning We use Cookies to give you a better experience on our website. By continuing to browse the site without changing your privacy settings, you are consenting to our use of Cookies. For more information, please see our Privacy Policy Statement. Accept Your browser is not the latest version. If you continue to browse our website, Some pages may not function properly. You are recommended to upgrade to a newer version or switch to a different browser. A list of the web browsers that we support can be found here What are you looking for? Site Search Search Internal Document Search",
  "content_length": 5782,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:08"
}