{
  "name": "Kayvon Fatahalian",
  "homepage": "http://graphics.stanford.edu/~kayvonf",
  "status": "success",
  "content": "Kayvon Fatahalian - Stanford University KAYVON FATAHALIAN Associate Professor of Computer Science Stanford University CoDa Building, Room E358 Our group creates computing systems that enable advanced computer graphics and AI applications. Recent research efforts include: High-performance simulation of virtual environments for \"AI training\". Future virtual environments will be used for generating experience for training AI agents as much or more than generating frames for video games. These agents need to learn from massive amounts of experience. So we ask the question, how do we redesign a game engine to efficiently simulate thousands of virtual environments at a throughput of millions of frames per second? The Madrona Engine and BPS3D are experiments in this direction. We also pursue humanlike video game bots. New applications based on analyzing big video data. What new applications are possible given access to large amounts of video? We've analyzed over a decade of Cable TV news video (250,000+ hours) to understand trends in the news, and turned broadcast professional tennis video into interactive, controllable characters that look and behave like star tennis players. (Have you seen Federer play himself at Wimbledon?) Along the way we've built systems to process and query video databases at scale, improved optimizing compilers for image processing, developed new techniques for efficient DNN inference on video, and improved machine analysis of sports video. Human-in-the-loop, interactive AI. What can a domain expert can do with an interactive supercomputer? We're interested in developing machine learning systems that put expert humans in the loop, whether that be for creative content creation workflows based on generative AI (like this or this) or for rapidly training and validating new models (here and here). Also, sometimes we path trace terabyte-scale scenes using thousands of AWS lambdas. I'm always looking for students that wish to work on topics like these, or bring their own ideas. TIPS, TALKS, AND POSTS Here are a few tips on how to give clear research talks (or class project talks). What Makes a Graphics Systems Paper Beautiful: This is an article on systems thinking principles that may be helpful to authors or reviewers of graphics systems papers. Experiences Building Online Events in Ohyay: I ran A LOT of virtual events during the pandemic (virtual parties, virtual classes, conferences, etc). We've built up a lot of know-how about technical and non-technical ways to make virtual events better. This talk to the Stanford HCI group brain dumps some of my observations about video-based communication and events. I've written two posts documenting how I created my own virtual classroom toolkit which provides virtual venues for lectures, office hours, small group work, and student socials. Back to Virtual Teaching, but Not Back to Zoom (Jan 2021) Virtual Teaching Doesn’t Mean Giving Up on the Live Lecture (Jan 2020) On Stanford's The Future of Everything podcast I gave takes on virtual work, virtual teaching, and why the pandemic should really light a fire under the graphics community. Like many groups, we are interested in pushing the capabilities of machine learning. I'm particularly interested in interactive, expert-in-the-loop systems that allow human intuition to interoperate with machine learning. Here's me talking about \"Keeping the Domain Expert in the Loop: Ideas to Models in Hours, Not Weeks\" in Stanford's MLSys seminar (Fall 2020) and at CMU's AI Seminar (March 2021). At the Arch 2030 workshop I talked about how visual computing applications will drive architectual innovation in the year 2030. The talk is on Youtube. An updated version of the slides is here. I created this talk, Do Grades Matter, to challenge students to think bigger than just striving to get good grades in a bunch of hard classes. Want to get outside but still sleep in your own bed at night? Try my favorite local Bay Area hikes. TEACHING CS149: Parallel Computing (Winter 2019, Fall 2019, 2020, 2021, 2022, 2023, 2024) CS248: Interactive Computer Graphics (2018, 2019, 2020, 2021, 2022) CS248A: Computer Graphics: Rendering, Geometry, and Image Manipulation (2023, 2024, 2025) CS348K: Visual Computing Systems (Winter 2018, Fall 2018, 2020, 2021, 2022, 2023, 2024, 2025) CS348B: Image Synthesis Techniques (Spring 2022) Before moving to Stanford, I taught the following courses at CMU. 15-418/15-618: Parallel Computer Architecture and Programming(2012, 2013, 2014, 2015, 2016, 2017, and at Tsinghua in Summer 2017) 15-769: Visual Computing Systems (2013, 2014, 2016) 15-462/662: Computer Graphics (2015) 15-869: Graphics and Imaging Architectures (2011) STUDENTS PURVI GOEL (Ph.D, co-advised with C. Karen Liu, [Thesis]) TEJAN KARMALI (Ph.D) ZANDER MAJERCIK (Ph.D) VISHNU SARUKKAI (Ph.D) WILLIAM WANG (Ph.D) Graduated Ph.D. Students: BRENNAN SHACKLETT (Stanford Ph.D, 2025, [Thesis]) DAN FU (Stanford Ph.D, 2024, co-advised with Chris Ré) DAVID DURST (Ph.D, co-advised with Pat Hanrahan) (Stanford Ph.D. 2024, [Thesis]) JAMES HONG (Stanford Ph.D, 2024, [Thesis]) HAOTIAN ZHANG (Stanford Ph.D, 2023, [Thesis]) RAVI MULLAPUDI (CMU Ph.D. 2021, co-advised with Deva Ramanan, [Thesis]) EVAN SHIMIZU (CMU Ph.D. 2020, [Thesis]) YONG HE (CMU Ph.D. 2018, [Thesis]) Graduated BS/MS Students: CHENXI LIU (CSD M.S., matriculated to Ph.D. at UBC) KRISHNA KUMAR SINGH (CMU M.S., matriculated to Ph.D. at UC Davis) WILL CRICHTON (CMU B.S., matriculated to Stanford Ph.D., now faculty at Brown) KARIMA MA (CMU M.S., matriculated to Ph.D. at MIT) PUBLICATIONS Also see Google Scholar. Self-Generated In-Context Examples Improve LLM Agents for Sequential Decision-Making Tasks Vishnu Sarukkai, Zhiqiang Xie, Kayvon Fatahalian NeurIPS 2025 Here is a useful slide deck about the project. Generating Detailed Character Motion from Blocking Poses Purvi Goel, Guy Tevet, C. Karen Liu, Kayvon Fatahalian SIGGRAPH Asia 2025 Learning to Ball: Composing Policies for Long-Horizon Basketball Moves P. Xu Z. Wu, R. Wang, V. Sarukkai, K. Fatahalian, I. Karamouzas, V. Zordan, C. Karen Liu SIGGRAPH Asia 2025 AI Metropolis: Scaling Large Language Model-based Multi-Agent Simulation with Out-of-Order Execution Zhiqiang Xie, Hao Kang, Ying Sheng, Tushar Krishna, Kayvon Fatahalian, Christos Kozyrakis MLSys 2025 Generative Motion Infilling From Imprecisely Timed Keyframes Purvi Goel, Hoatian Zhang, C. Karen Liu, Kayvon Fatahalian Eurographics 2025 Automated Rewards via LLM-Generated Progress Functions Vishnu Sarukkai, Brennan Shacklett, Zander Majercik, Kush Bhatia, Christopher Ré, Kayvon Fatahalian arXiv:2410.09187, Oct 2024 High-Throughput Batch Rendering for Embodied AI Luc Guy Rosenzweig, Brennan Shacklett, Warren Xia, Kayvon Fatahalian SIGGRAPH Asia 2024 Block and Detail: Scaffolding Sketch-to-Image Generation Vishnu Sarukkai, Lu Yuan, Mia Tang, Maneesh Agrawala, Kayvon Fatahalian UIST 2024 Learning to Move Like Professional Counter-Strike Players David Durst, Feng Xi, Vishnu Sarukkai, Brennan Shacklett, Iuri Frosio, Chen Tessler, Joohwan Kim, Carly Taylor, Gilbert Bernstein, Sanjiban Choudhury, Pat Hanrahan, Kayvon Fatahalian Symposium on Computer Animation (SCA) 2024 Iterative Motion Editing with Natural Language Purvi Goel, Kuan-Chieh Wang, C. Karen Liu, Kayvon Fatahalian SIGGRAPH 2024 Learning Subject-Aware Cropping by Outpainting Professional Photos James Hong, Lu Yuan, Michaël Gharbi, Matthew Fisher, Kayvon Fatahalian AAAI 2024 Collage Diffusion Vishnu Sarukkai, Linden Li, Arden Ma, Christopher Ré, Kayvon Fatahalian WACV 2024, (Vishnu's blog) An Extensible, Data-Oriented Architecture for High-Performance, Many-World Simulation Brennan Shacklett, Luc Guy Rosenzweig, Zhiqiang Xie, Bidipta Sarkar, Andrew Szot, Erik Wijmans, Vladlen Koltun, Dhruv Batra, Kayvon Fatahalian Transactions on Graphics 2023 Learning Physically Simulated Tennis Skills from Broadcast Videos Hoatian Zhang, Yu Yuan, Viktor Makoviychuk, Yunrong Guo, Sanja Fidler, Xue Ben Peng, Kayvon Fatahalian Transactions on Graphics 2023 Spotting Temporally Precise, Fine-Grained Events in Video James Hong, Haotian Zhang, Michaël Gharbi, Matthew Fisher, Kayvon Fatahalian ECCV 2022 R2E2: Path Tracing of Terabyte-Scale Scenes using Thousands of Cloud CPUs Sadjad Fouladi, Brennan Shacklett, Fait Poms, Arjun Arora, Alex Ozdemir, Deepti Raghavan, Pat Hanrahan, Kayvon Fatahalian, Keith Winstein Transactions on Graphics 2022 Low-shot Validation: Active Importance Sampling for Estimating Classifier Performance on Rare Categories Fait Poms*, Vishnu Sarukkai*, Ravi Teja Mullapudi, Nimit S. Sohoni, William R. Mark, Deva Ramanan, Kayvon Fatahalian ICCV 2021 Learning Rare Category Classifiers on a Tight Labeling Budget Ravi Teja Mullapudi, Fait Poms, William R. Mark, Deva Ramanan, Kayvon Fatahalian ICCV 2021 Video Pose Distillation for Few-Shot, Fine-Grained Sports Action Recognition James Hong, Matthew Fisher, Michaël Gharbi, Kayvon Fatahalian ICCV 2021 Analysis of Faces in a Decade of US Cable TV News James Hong, Will Crichton, Haotian Zhang, Daniel Y. Fu, Jacob Ritchie, Jeremy Barenholtz, Ben Hannel, Xinwei Yao, Michaela Murray, Geraldine Moriba, Maneesh Agrawala, Kayvon Fatahalian KDD 2021 [Visit the Stanford Cable TV Analyzer website for more info.] Large Batch Simulation for Deep Reinforcement Learning Brennan Shacklett, Erik Wijmans, Aleksei Petrenko, Manolis Savva, Dhruv Batra, Vladlen Koltun, Kayvon Fatahalian ICLR 2021 Vid2Player: Controllable Video Sprites that Behave and Appear like Professional Tennis Players Haotian Zhang, Cristobal Sciutto, Maneesh Agrawala, Kayvon Fatahalian Transactions on Graphics 2021 Iterative Text-based Editing of Talking-heads Using Neural Retargeting Xinwei Yao, Ohad Fried, Kayvon Fatahalian, Maneesh Agrawala Transactions on Graphics 2021 Background Splitting: Finding Rare Classes in a Sea of Background Ravi Teja Mullapudi*, Fait Poms*, William R. Mark, Deva Ramanan, Kayvon Fatahalian CVPR 2021 Analyzing Who and ",
  "content_length": 21922,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:12"
}