{
  "name": "Kazuya Kodama",
  "homepage": "https://www.nii.ac.jp/en/faculty/digital_content/kodama_kazuya",
  "status": "success",
  "content": "KODAMA Kazuya - Digital Content and Media Sciences Research Division - Faculty - Research - å½ç«æ å ±å­¦ç ç©¶æ / National Institute of Informatics ACCESS CONTACT æ¥æ¬èª About NII Introduction Greeting from the Director-General Mission & Strategies Overview of NII History Administrative Council Organization Charts Intellectual Properties Staff / Budget Outline and Catalogue of National Institute of Informatics PR Video International Exchange International Exchange based on MOU Conclusion of International Exchange Agreements or MOUs NII International advanced lectures series on ICT NII Shonan Meeting Global Liaison Office (GLO) - DAAD Alumni NII Library NII Library Usage Guide(For General Public) NII Library Accessing databases via GakuNin International Seminar House for Advanced Studies Advanced ICT Center Publications NII Today PR Video Recruitment Access National Institute of Informatics (National Center of Sciences) Kashiwa Annex International Seminar House Contact News Event Link Sitemap Research Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division Information Systems Architecture Science Research Division Digital Content and Media Sciences Research Division Information and Society Research Division Directory of Faculty and Staff index Professor Emeritus Major Project Involvement Kakenhi Human Resource Development Top SE Experts in Information Science Quantum Technology Education:A New Approach Collaborative Research Promotion Collaboration with Industry, Government, and Academia Research Results Progress in Informatics NII Technical Reports Service Network SINET6 Research Data Cloud GakuNin RDM JAIRO Cloud CiNii Research CiNii Books IRDB Authentication Infrastructure GakuNin eduroam JP UPKI Notice of Authentication Service Maintenance Cloud GakuNin Cloud GakuNin Cloud Adoption Support Service GakuNin Cloud Gateway Service GakuNin Cloud On-Demand Configuration Service SINETStream Information Security NII Security Operation Collaboration Services (NII-SOCS) Princess Rinrin's information security column Scholarly Communication NACSIS-CAT/ILL E-resources Data Sharing Services KAKEN NII-REO Collaboration Collaboration with University Libraries Japan Alliance of University Library Consortia for E-Resources Future Scholarly Information Systems Committee Japan Consortium for Open Access Repository SPARC Japan Research Data Ecosystem Development Project to Promote the Use of AI HPCI mdx Academic Information Infrastructure Open Forum Human Resource Development GakuNin LMS Education and Training Services NII JMOOC | gacco Experts in Information Science Computer Science Park Graduate Program Research Research Faculty Digital Content and Media Sciences Research Division KODAMA Kazuya Digital Content and Media Sciences Research Division KODAMA Kazuya Digital Content and Media Sciences Research Division, Associate Professor Research Fields: Structured multi-dimensional image representation and distributed systems for visual communication with real-time quality control Degrees: Ph.D. (Engineering) Detail: http://researchmap.jp/kodamakazuya/ Introduction Flexible free-viewpoint/focus image reconstruction After capturing images, people sometimes wish they would change the setting of the camera, for example, viewpoint, focus, and so on. Our research enables us to realize such flexible free-viewpoint/focus image reconstruction by capturing and processing the detailed information of rays from objects with multiple cameras or special cameras. The difficulty of 3-D modeling from captured images Computer graphics technologies widely spread these days. For example, soccer and baseball video games are quite realistic. They easily produce realistic images with given 3-D modeling. However, it is very hard to extract and model 3-D objects themselves automatically from captured images. Even a large number of captured images with high-resolution and various viewpoints are not enough to model simple objects like a pair of glasses. 3-D modeling of real scenes, that are very complicated, is almost impossible. For not only computers but also human beings, it is not so easy to determine whether some regions of a certain image stick out or sink in 3-D. Incorrect determination directly causes the awful failure of 3-D modeling. There are more practical approaches without 3-D modeling for free-viewpoint/focus image reconstruction. Such application does not need explicit 3-D modeling, although the robot control applications do in order to recognize what exists and where it exists. Image Reconstruction without 3-D modeling Our proposed method does not explicitly extract and model specific objects from captured images. It reconstruct desired different viewpoint/focus images directly from original captured images. Classical signal processing such as Fourier Transform is very effective for the image reconstruction without 3-D modeling. By just applying multi-dimensional Fast Fourier Transform to captured images, that include the detailed information of rays from objects, by multiple cameras or special cameras, we can easily reconstruct different viewpoint/focus images. Fourier Transform is not an old-fashioned technique, but still the most effective and flexible one, that can be applied to extensive fields. Our presentation draws the attention of those interested in mathematical approaches at international conferences. We find this research profound and challenging. PDF Download Interviewed and summarized by Atsushi Saito View research contents with researchmap ãã¤ã¼ã Research Divisions Research Centers Research and Development Center for Academic Networks Research Center for Knowledge Media and Content Science Research Center for Community Knowledge Center for Cloud Research and Development Center for Dataset Sharing and Collaborative Research Center for Strategic Cyber Resilience Research and Development Research Center for Open Science and Data Platform Center for Research Data Ecosystem Development Center for Trust & Digital Identity Research and Development Global Research Center for Quantum Information Science Global Research Center for Big Data Mathematics Research Center for Mathematical Trust in Software and Systems Research Center for Medical Bigdata Global Research Center for Synthetic Media Research and Development Center for Large Language Models Center for Advanced Mobile Driven Research Faculty Director-General Executives(related to research) Principles of Informatics Research Division FUJII Kaito HIRAHARA Shuichi KAWARABAYASHI Ken-ichi KOBAYASHI Taisuke KUROIWA Ryo MATSUMOTO Keiji SATO Ryoma SHIGAKI Shunsuke SOEDA Akihito SUGIYAMA Mahito TAKEDA Hideaki TATSUTA Makoto UNO Takeaki WATANABE Kazuki WELLNITZ Philip YOSHIDA Yuichi Information Systems Architecture Science Research Division AIDA Kento AOKI Shunsuke FUJIWARA Ikki FUKUDA Kensuke GOSHIMA Masahiro HASUO Ichiro ISHIKAWA Fuyuki JI Yusheng KANEKO Megumi KATO Hiroyuki KITAGAWA Naoya KOIBUCHI Michihiro KURIMOTO Takashi SAKANE Eisaku SATO Hiroyuki SEKIYAMA Taro SHIMIZU Sayako TAKAKURA Hiroki TAKEFUSA Atsuko Digital Content and Media Sciences Research Division AIZAWA Akiko ANDRES Frederic ASANO Yuta HUANG Lang IKEHATA Satoshi KANAZAWA Teruhito KATAYAMA Norio KITAMOTO Asanobu KODAMA Kazuya KOMIYAMA Yusuke KOYAMA Shoichi KURITA Shuhei MO Hiroshi PRENDINGER Helmut SATO Imari SATOH Shin'ichi SUGAWARA Saku SUGIMOTO Akihiro TAKASU Atsuhiro YAMAGISHI Junichi YAMAJI Kazutsuna Information and Society Research Division ARAI Noriko BONO Mayumi ECHIZEN Isao FUNAMORI Miho FURUKAWA Masako GOTODA Hironobu KANDO Noriko KATAOKA Hiroshi KATO Makoto MIZUNO Takayuki NISHIZAWA Masaki OKADA Hitoshi SANO takiko SATOH Ichiro SUN Yuan UEKI Kouichirou Directory of Faculty and Staff index Research staff Other research staff Professor Emeritus Major Project Involvement Kakenhi Human Resource Development Top SE Experts in Information Science Quantum Technology Education Collaborative Research Promotion Collaboration with Industry, Government, and Academia Research Results Progress in Informatics NII Technical Reports SPECIAL Overview of NII 2025 Summary of NII 2024 NII Today No.104(EN) NII Today No.103(EN) Overview of NII 2024 Guidance of Informatics Program, SOKENDAI 24-25 NII Today No.102(EN) SINETStream Use Case: Mobile Animal Laboratory [Bio-Innovation Research Center, Tokushima Univ.] The National Institute of Information Basic Principles of Respect for LGBTQ DAAD News Event Site Policy Link Recruit ã National Institute of Informatics 2-1-2 Hitotsubashi, Chiyoda-ku, Tokyo 101-8430 Copyright© National Institute of Informatics ROIS NIPR ISM NIG",
  "content_length": 9521,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:14"
}