{
  "name": "Ke Shang",
  "homepage": "http://cse.sustech.edu.cn/faculty/~shangk",
  "status": "success",
  "content": "Home Ke Shang (å°å¯) I am a Research Associate Professor in Prof. Hisao Ishibuchi's group at the Department of Computer Science and Engineering, Southern University of Science and Technology (SUSTech). My research field is Multi-objective Optimization and Learning.Email: kshang at foxmail dot com or shangk at sustech dot edu dot cnOffice: 650b, South Tower, CoE Building, SUSTech, Shenzhen, China IJCNN 2024, FUZZ-IEEE 2024 and CEC 2024 will be held under WCCI 2024 in Yokohama, Japan (June 30 - July 5).The paper submission deadline is January 15, 2024.For more information, see the webpage https://wcci2024.org/ News 2023-9-15 Our four papers have been accepted by IEEE SSCI 2023. Experiences 2005 - 2009, Xi’an Jiaotong University, Bachelor Degree2009 - 2016, Xi’an Jiaotong University, PhD Degree2012 - 2014, The University of Tokushima, Japan, Visiting Scholar2016.10 - 2016.12, The Hong Kong Polytechnic University, Research Assistant2017 - 2019, Southern University of Science and Technology, Postdoc Researcher2019 - 2022, Southern University of Science and Technology, Research Assistant Professor2023 - now, Southern University of Science and Technology, Research Associate Professor Publications Full List Journal papers 17. Shang K., Shu T., Ishibuchi H., Nan Y., and Pang L. M. âBenchmarking Large-Scale Subset Selection in Evolutionary Multi-Objective Optimization.â Information Sciences (2022).16. Shu T., Shang K., Ishibuchi H., and Nan Y. âEffects of Archive Size on Computation Time and Solution Quality for Multi-Objective Optimization.â IEEE Transactions on Evolutionary Computation (2022).15. Nan Y, Shang K., Ishibuchi H., and He L. âAn Improved Local Search Method for Large-Scale Hypervolume Subset Selection.â IEEE Transactions on Evolutionary Computation (2022).14. Shang K., Shu T., and Ishibuchi H. âLearning to Approximate: Auto Direction Vector Set Generation for Hypervolume Contribution Approximation.â IEEE Transactions on Evolutionary Computation (2022).13. He L., Shang K., Nan Y., Ishibuchi H., and Srinivasan D. âRelation Between Objective Space Normalization and Weight Vector Scaling in Decomposition-Based Multi-Objective Evolutionary Algorithms.â IEEE Transactions on Evolutionary Computation (2022).12. Pang L. M., Ishibuchi H., and Shang K. \"Use of Two Penalty Values in Multi-objective Evolutionary Algorithm based on Decomposition.\" IEEE Transactions on Cybernetics (2022).11. Shang K.#, Chen W.#, Liao W., and Ishibuchi H. âHV-Net: Hypervolume Approximation based on DeepSets.â IEEE Transactions on Evolutionary Computation (2022). (#Equal Contribution)10. Pang L. M., Ishibuchi H., and Shang K. \"Counterintuitive Experimental Results in Evolutionary Large-Scale Multi-Objective Optimization.\" IEEE Transactions on Evolutionary Computation (2022).9. Ishibuchi H., Pang L. M., and Shang K. \"Difficulties in Fair Performance Comparison of Multi-Objective Evolutionary Algorithms.\" IEEE Computational Intelligence Magazine (2021).8. Shang K., Ishibuchi H., Chen W., Nan Y., and Liao W. âHypervolume-Optimal Î¼-Distributions on Line/Plane-based Pareto Fronts in Three Dimensionsâ. IEEE Transactions on Evolutionary Computation (2021).7. Chen W., Ishibuchi H., and Shang K. âFast Greedy Subset Selection from Large Candidate Solution Sets in Evolutionary Multi-objective Optimizationâ. IEEE Transactions on Evolutionary Computation (2021).6. Shang K., Ishibuchi H., He L., and Pang L. M. âA Survey on the Hypervolume Indicator in Evolutionary Multi-objective Optimization.â IEEE Transactions on Evolutionary Computation (2020). ESI Highly Cited Paper5. Shang K., and Ishibuchi H. \"A New Hypervolume-based Evolutionary Algorithm for Many-objective Optimization.\" IEEE Transactions on Evolutionary Computation (2020).4. Shang K., Ishibuchi H., and Ni X. \"R2-based Hypervolume Contribution Approximation.\" IEEE Transactions on Evolutionary Computation (2020).3. He L., Shang K., and Ishibuchi H. \"Simultaneous Use of Two Normalization Methods in Decomposition-based Multi-objective Evolutionary Algorithms.\" Applied Soft Computing (2020).2. Nan Y., Shang K., Ishibuchi H. âReverse Strategy for Non-dominated Archiving.â IEEE Access (2020).1. Shang K., Feng Z., Ke L., and Chan F. T. \"Comprehensive Pareto Efficiency in robust counterpart optimization.\" Computers & Chemical Engineering (2016). Conference papers 19. An G., Wu Z., Shen Z., Shang K., Ishibuchi H. âEvolutionary Multi-Objective Deep Reinforcement Learning for Autonomous UAV Navigation in Large-Scale Complex Environments.â Proceedings of the Genetic and Evolutionary Computation Conference. (GECCO2023).18. Ishibuchi H., Pang L. M., Shang K. âEffects of Dominance Modification on Hypervolume-based and IGD-based Performance Evaluation Results of NSGA-II.â Proceedings of the Genetic and Evolutionary Computation Conference. (GECCO2023).17. Shu T., Nan Y., Shang K., Ishibuchi H. âTwo-Phase Procedure for Efficiently Removing Dominated Solutions From Large Solution Sets.â Proceedings of the Genetic and Evolutionary Computation Conference. (GECCO2023).16. Zhu H., Shang K., Ishibuchi H. âSTHV-Net: Hypervolume Approximation based on Set Transformer.â Proceedings of the Genetic and Evolutionary Computation Conference. (GECCO2023).15. Shu T., Shang K., Nan Y., and Ishibuchi H. âDirection Vector Selection for R2-based Hypervolume Contribution Approximation.â Parallel Problem Solving from Nature (PPSN2022).14. Shang K., Liao W., and Ishibuchi H. âHVC-Net: Deep Learning based Hypervolume Contribution Approximation.â Parallel Problem Solving from Nature (PPSN2022).13. Shang K., Ishibuchi H., Pang L. M., and Nan Y. âReference Point Specification for Greedy Hypervolume Subset Selection.â IEEE International Conference on Systems, Man, and Cybernetics (SMC2021).12. Pang L. M.#, Shang K.#, Chen L., Ishibuchi H., and Chen W. âProposal of a New Test Problem for Large-Scale Many-Objective Optimizationâ. IEEE International Conference on Systems, Man, and Cybernetics (SMC2021). (#Equal Contribution)11. Nan Y., Shang K., Ishibuchi H., and He L. âImproving Hypervolume-based Greedy Sequential Insertion Subset Selection in Evolutionary Multi-objective Optimizationâ. IEEE International Conference on Systems, Man, and Cybernetics (SMC2021).10. Nan Y., Shang K., Ishibuchi H., and He L. âA Two Stage Hypervolume Contribution Approximation Method Based on R2 Indicatorâ. IEEE Congress on Evolutionary Computation (CEC2021).9. Shang K., Ishibuchi H., and Chen W. âGreedy Approximated Hypervolume Subset Selection for Many-objective Optimizationâ. Proceedings of the Genetic and Evolutionary Computation Conference. (GECCO2021). Best Paper Award8. Shang K., Ishibuchi H., and Nan Y. âDistance-based Subset Selection Revisitedâ. Proceedings of the Genetic and Evolutionary Computation Conference. (GECCO2021).7. Shang K., Ishibuchi H., Chen L., Chen W., and Pang L. M. âImproving the Efficiency of R2HCA-EMOAâ. 11th International Conference on Evolutionary Multi-Criterion Optimization (EMO2021).6. Shang K., Ishibuchi H., Nan Y., and Chen W. âTransformation-based Hypervolume Indicator: A Framework for Designing Hypervolume Variantsâ. IEEE Symposium Series on Computational Intelligence (SSCI2020).5. Shang K., Ishibuchi H., Chen W., and Adam L. \"Hypervolume optimal mu-distributions on line-based Pareto fronts in three dimensions.\" Parallel Problem Solving from Nature. (PPSN2020).4. Chen W., Ishibuchi H., and Shang K. âProposal of a realistic many-objective test suite.â Parallel Problem Sovling from Nature. (PPSN2020). Best Paper Nomination3. Nan Y.#, Shang K.#, and Ishibuchi H. \"What is a Good Direction Vector Set for the R2-based Hypervolume Contribution Approximation.\" Proceedings of the Genetic and Evolutionary Computation Conference. (GECCO2020). ï¼#Equal Contributionï¼2. Ishibuchi H., Peng Y., and Shang K. \"A Scalable Multimodal Multiobjective Test Problem.\" IEEE Congress on Evolutionary Computation (CEC2019). First Runner-up Conference Paper Award1. Shang K., Ishibuchi H., Zhang M. L., and Liu Y. \"A new R2 indicator for better hypervolume approximation.\" Proceedings of the Genetic and Evolutionary Computation Conference. (GECCO2018). Best Paper Award Patents å°å¯, ç³æ¸ä¹ ç. é£è¡å³ç­çææ¹æ³åè£ ç½®ãè®¡ç®æºè®¾å¤ãå­å¨ä»è´¨. åæ. å®å®¡. ä¸­å½. 202210084970.9. 2022/1/25. åæ¹ç§æå¤§å­¦. Invited Talks 1. æ¼åå¤ç®æ ä¼åçåå±ç°ç¶åææ°ç ç©¶è¿å±, ä¸­å½è®¡ç®æºå­¦ä¼éå¹´è®¡ç®æºç§æè®ºåå °å·åè®ºå, 2020å¹´7æ4æ¥. [link]2. Hypervolume Approximation for Many-objective Optimization, IEEE CIS Seminar, 2022-8-24. [link]3. é¢åé«ç»´å¤ç®æ ä¼åçè¶ ä½ç§¯ææ è¿ä¼¼, å¤§æ°æ®ä¸å§ä¼å­¦æ¯æ´»å¨-NICE Seminar, 2023-2-19. [link] Tutorials and Workshops 1. Difficulties in Fair Performance Comparison of Multiobjective Evolutionary Algorithms, GECCO 2022 Tutorial. [link]2. How to Compare Evolutionary Multi-Objective Optimization Algorithms: Parameter Specifications, Indicators and Test Problems. WCCI 2022 Tutorial. [link]3. Subset Selection in Evolutionary Multi-objective Optimization. WCCI 2022 Workshop. [link]4. How to Compare Evolutionary Multi-Objective Optimization Algorithms: Parameter Specifications, Indicators and Test Problems. IEEE CEC 2023 Tutorial.5. Quality indicators for multi-objective optimization: performance assessment and algorithm design. IEEE CEC 2023 Tutorial.6. Hypervolume Approximation for Many-objective Optimization and Learning. ECAI 2023 Tutorial.7. Hypervolume Approximation for Many-objective Optimization and Learning. ICONIP 2023 Tutorial. Honors and Awards 1. 2022 IEEE Senior Member2. 2021 GECCO Best Paper Award (Shang K., Ishibuchi H., Chen W.)3. 2021 Overseas High-Caliber Personnel in Shenzhen4. 2020 IEEE CIS Travel Grant5. 2020 PPSN Best Paper Nomination (Chen W., Ishibuchi H., Shang K.)6. 2019 CEC First Runner-up Conference Paper Award (Ishibuch",
  "content_length": 10237,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:16"
}