{
  "name": "Ke Yi 0001",
  "homepage": "https://www.cse.ust.hk/~yike",
  "status": "success",
  "content": "Ke Yi's Home Page Ke Yi      Ò×çæ Professor, Department of Computer Science and Engineering Director, MSc Program in Big Data Technology Hong Kong University of Science and Technology Clear Water Bay, Hong Kong, China Office: CYT 3002 [CV] [Publications] Research Interests Database theory and systems; query processing; data security and privacy; parallel and distributed algorithms; sampling; data summarization; data streams; data structures; external memory algorithms; computational geometry. Exploiting the rich interdependence between theory and practice is the main theme of my research. I always strive to design algorithms with nice theoretical guarantees that also work well in practice. I like simple algorithms with nontrivial and elegant analyses. I like theories that bring insights to how things should be done in practice (this includes lower bounds!). Despite of the theoretical focus, our group has developed the following system prototypes based on the theory: Quorion: Query optimization by rewriting, based on the Yannakakis+ algorithm. DPSQL: A differentially private SQL engine. SparkSQL+: Next-generation query planning over Spark using generalized hypertree decompositions (GHD), worst-case optimal join (WCOJ) algorithms, and conjunctive queries with comparisons (CQC). SecYan: Two-party secure query processing based on the secure Yannakakis algorithm. CROWN and Cquirrel: Continuous query processing / change propogation in Flink. XDB: Online aggregation for PostgreSQL based on the wander join algorithm. My research has been supported by Hong Kong RGC, Alibaba, ByteDance, Huawei, Microsoft, and Google. Students Current students: Bingnan Chen (PhD, since Fall 2021) Zijun Chen (PhD, since Fall 2022) Binyang Dai (PhD, since Fall 2022) Jianzhe Yu (PhD, since Fall 2023) Tian Shu (PhD, since Fall 2024) Qi Dong (MPhil, since Fall 2024) Zifei Liu (MPhil, since Spring 2025) Xiaoyu Han (PhD, since Fall 2025) Former students: Yuting Liang (PhD 2025; now Postdoctal Fellow at University of Toronto) Dajun Sun (PhD 2025; now Researcher at Huawei Hong Kong Research Center) Juanru Fang (PhD 2025; now Assistant Lecturer at University of Hong Kong) Qiyao Luo (PhD 2024; now Researcher at Ant Group) Wei Dong (PhD 2023; SIGMOD Jim Gray Doctoral Dissertation Award Runner-up; now Assistant Professor at Nanyang Technological University) Qichen Wang (PhD 2022; now Assistant Professor at Nanyang Technological University) Yuan Qiu (PhD 2022; now Professor at Southeast University) Yilei Wang (PhD 2022; now Research Scientist at Alibaba Cloud) Ziyue Huang (PhD 2022; now at Tencent) Xiao Hu (PhD 2019; now Assistant Professor at University of Waterloo) Yu Chen (PhD 2019; now at Alibaba Cloud) Bin Wu (PhD 2017; now Senior Technology Research Expert at Alibaba Cloud) Di Chen (PhD 2017; co-advised with Mordecai Golin; now at Virtu Financial, Singapore) Han Xu (PhD 2016; co-advised with Yunhao Liu; now at Huawei) Ge Luo (PhD 2016; now Chief Scientist at DataYes) Lu Wang (PhD 2015; now at Google Switzerland) Xiaoyu Ji (PhD 2015; co-advised with Yunhao Liu; now Professor at Zhejiang University) Longfei Shangguan (PhD 2015; co-advised with Yunhao Liu; now Assistant Professor at University of Pittsburgh) Zengfeng Huang (PhD 2013; now Professor at Fudan University) Zhewei Wei (PhD 2012; now Professor at Renmin University) Qin Zhang (PhD 2011; co-advised with Mordecai Golin; now Professor at Indiana University Bloomington) Haoqian Zhang (MPhil 2019; now PhD student at EPFL) Junhong Cao (MPhil 2019; now at Lyft) Serafeim Papadias (MPhil 2018; now PhD student at TU Berlin) Dexter Lee (MPhil 2018) Wai Ming Tai (MPhil 2015; now at Huawei Singapore) Hao Liu (MPhil 2014; now Assistant Professor at HKUST-GZ) Ching-Hin Lau (MPhil 2009) Wenqi Zhu (MPhil 2008) Konstantinos Tsakalidis (Postdoc 2012 ~ 2013; now Lecturer at University of Liverpool) Xiao Wang (Final-year thesis 2013; now Associate Professor at Northwestern University) Zhepeng Yan (Final-year thesis 2010; now at Google US) Awards ACM SIGMOD Best Paper Award, 2016, 2022. ACM SIGMOD Best Paper Honorable Mention, 2022, 2024. ACM SIGMOD Research Highlight Award, 2017, 2023x2, 2025. ACM PODS Test-of-Time Award, 2022. ACM Distinguished Member, 2021. ACM SIGMOD Best Demonstration Award, 2015. 6 invited articles in ACM TODS. 2 invited articles in JACM. 1 invited article in CACM - Research Highlights. Outstanding Research Collaboration Award, Alibaba Innovative Research Program (AIR), 2024. HKUST School of Engineering Young Investigator Research Award, 2012. Google Faculty Research Award, 2010. Best Teaching Award, MSc Program in Big Data Technology, 2017, 2020. Outstanding Ph.D. Dissertation Award, Department of Computer Science, Duke University, August, 2006. Top-grade Scholarship, Tsinghua University, 2001. Silver Medal, International Olympiad in Informatics (IOI), 1997. Teaching COMP 2711: Discrete Mathematical Tools for Computer Science (17S, 19S, 20S, 21S, 22S, 22F, 23S, 25S) COMP 3711: Design and Analysis of Algorithms (08F, 09S, 09F, 11F, 12F, 14F, 15S, 15F, 16S, 24S) COMP 3721: Theory of Computation (11S, 12S, 13S) COMP 5711: Advanced Algorithms (14F, 15F, 16F, 17F, 18F, 19F, 20F, 21F, 23F) COMP 5713: Computational Geometry (10S) MSBD 6000P: Big Data Algorithms (25S) MSBD 5003: Big Data Computing (17S, 17F, 18S, 18F, 19S, 19F, 20F, 21F, 23S, 24S) COMP 6311D: Hot Topics on Big Data: Algorithms, Analytics and Applications (13F) COMP 670S: Data Stream Algorithms (10F) COMP 670R: Hashing (09F) COMP 670Q: I/O-Efficient Algorithms and Data Structures (08S) Contact Email: user name in the url@ust.hk Phone: +852-2358 8770 Fax: +852-2358 1477",
  "content_length": 5655,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:17"
}