{
  "name": "Ke Zhou 0003",
  "homepage": "https://www.nottingham.ac.uk/computerscience/people/ke.zhou",
  "status": "success",
  "content": "People look-up - The University of Nottingham UK China Malaysia Main Menu Study About Research Business News Visit A–Z Search You are here: University of NottinghamComputer SciencePeople School of Computer Science HomeAbout the SchoolStudy with usResearchInternshipsWork with usEquality Diversity and Inclusion People Honorary appointments EventsNewsContact us Print Email this Page Student Intranet Ke ZhouAssistant Professor in Data Science, Faculty of Science Download to vCardBack to the Staff Directory Personal DetailsPublications Contact workRoom B50 Computer Science BuildingJubilee CampusWollaton RoadNottinghamNG8 1BBUKworkn/aKe.Zhou@nottingham.ac.ukhttps://sites.google.com/site/keadamzhou/ BiographyKe (Adam) Zhou is an assistant professor in School of Computer Science, University of Nottingham, and an academic consultant for Yahoo! Research. His research interests and expertise lie in web search and analytics, user engagement modeling, evaluation metrics, text mining and human computer interaction. He has published in reputable conferences and journals (SIGIR, WWW, CIKM, TOIS, PLOS ONE), and served as PC member or reviewer for SIGIR, CIKM, WSDM, ECIR, AIRS, TOIS, IP&M and TKDE. He has also won the best paper award in ECIR'15 and CHIIR'16, and best paper honorable mention in SIGIR'15. He served as a co-organizer for NTCIR-11/12 IMine task, TREC FedWeb 2014 task, Heterogeneous Information Access (HIA) workshop at WSDM'15 & SIGIR'16, and Poster & Demo Chair at AIRS'16. Prior to joining Nottingham, he was a research scientist working in user engagement/ad quality science team in Yahoo Research. Before joining Yahoo, he was previously a research associate in Language Technology Group in University of Edinburgh, working on text mining and information retrieval from 2013. Prior to this, he has conducted his PhD research on aggregated search at the Information Retrieval Group in University of Glasgow. If you can not access the website, check the slightly outdated website/version here: http://www.cs.nott.ac.uk/~pszkz/Expertise SummaryI'm always interested in recruiting passionate PhD candidates who want to explore Information Retrieval, Text/Data Mining and Machine Learning. There are fully funded PhD studentship, CSC (China Scholarships Council) funding and others. Interested candidates should send a CV, a research proposal and academic transcripts to Dr. Ke Zhou (ke DOT zhou AT nottingham DOT ac DOT uk). Please use your name and \"IR PhD Position\" as your email subject (e.g. \"Steve Johns: IR PhD Position\").Recent Publications CHEN, YE, ZHOU, KE, LIU, YIQUN, ZHANG, MIN and MA, SHAOPING, 2017. Meta-evaluation of Online and Offline Web Search Evaluation Metrics In: Proceedings of the 40th International ACM SIGIR Conference on Research and Development in Information Retrieval. 15-24LIU, YULI, LIU, YIQUN, ZHOU, KE, ZHANG, MIN and MA, SHAOPING, 2017. Detecting Collusive Spamming Activities in Community Question Answering In: Proceedings of the 26th International Conference on World Wide Web. 1073-1082LUO, CHENG, LIU, YIQUN, SAKAI, TETSUYA, ZHOU, KE, ZHANG, FAN, LI, XUE and MA, SHAOPING, 2017. Does Document Relevance Affect the Searcher's Perception of Time? In: Proceedings of the Tenth ACM International Conference on Web Search and Data Mining. 141-150ZHOU, KE, REDI, MIRIAM, HAINES, ANDREW and LALMAS, MOUNIA, 2016. Predicting Pre-click Quality for Native Advertisements In: Proceedings of the 25th International Conference on World Wide Web. 299-310 View all publications CHEN, YE, ZHOU, KE, LIU, YIQUN, ZHANG, MIN and MA, SHAOPING, 2017. Meta-evaluation of Online and Offline Web Search Evaluation Metrics In: Proceedings of the 40th International ACM SIGIR Conference on Research and Development in Information Retrieval. 15-24LIU, YULI, LIU, YIQUN, ZHOU, KE, ZHANG, MIN and MA, SHAOPING, 2017. Detecting Collusive Spamming Activities in Community Question Answering In: Proceedings of the 26th International Conference on World Wide Web. 1073-1082LUO, CHENG, LIU, YIQUN, SAKAI, TETSUYA, ZHOU, KE, ZHANG, FAN, LI, XUE and MA, SHAOPING, 2017. Does Document Relevance Affect the Searcher's Perception of Time? In: Proceedings of the Tenth ACM International Conference on Web Search and Data Mining. 141-150ZHOU, KE, REDI, MIRIAM, HAINES, ANDREW and LALMAS, MOUNIA, 2016. Predicting Pre-click Quality for Native Advertisements In: Proceedings of the 25th International Conference on World Wide Web. 299-310LIU, YIQUN, LIU, ZEYANG, ZHOU, KE, WANG, MENG, LUAN, HUANBO, WANG, CHAO, ZHANG, MIN and MA, SHAOPING, 2016. Predicting Search User Examination with Visual Saliency In: Proceedings of the 39th International ACM SIGIR Conference on Research and Development in Information Retrieval. 619-628LIU, YULI, LIU, YIQUN, ZHOU, KE, ZHANG, MIN, MA, SHAOPING, YIN, YUE and LUO, HENGLIANG, 2016. Detecting Promotion Campaigns in Query Auto Completion In: Proceedings of the 25th ACM International on Conference on Information and Knowledge Management. 125-134MAO, JIAXIN, LIU, YIQUN, ZHOU, KE, NIE, JIAN-YUN, SONG, JINGTAO, ZHANG, MIN, MA, SHAOPING, SUN, JIASHEN and LUO, HENGLIANG, 2016. When Does Relevance Mean Usefulness and User Satisfaction in Web Search? In: Proceedings of the 39th International ACM SIGIR Conference on Research and Development in Information Retrieval. 463-472ZHOU, KE, LIU, YIQUN, LUO, ROGER JIE and JOSE, JOEMON, 2016. HIA'16: The 2Nd International Workshop on Heterogeneous Information Access at SIGIR 2016 In: Proceedings of the 39th International ACM SIGIR Conference on Research and Development in Information Retrieval. 1241-1241BOTA, HORATIU, ZHOU, KE and JOSE, JOEMON M., 2016. Playing Your Cards Right: The Effect of Entity Cards on Search Behaviour and Workload In: Proceedings of the 2016 ACM on Conference on Human Information Interaction and Retrieval. 131-140WANG, CHAO, LIU, YIQUN, WANG, MENG, ZHOU, KE, NIE, JIAN-YUN and MA, SHAOPING, 2015. Incorporating Non-sequential Behavior into Click Models In: Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval. 283-292CHUKLIN, ALEKSANDR, SCHUTH, ANNE, ZHOU, KE and RIJKE, MAARTEN DE, 2015. A Comparative Analysis of Interleaving Methods for Aggregated Search ACM Trans. Inf. Syst.. 33(2), 5:1-5:38CHEN, YE, LIU, YIQUN, ZHOU, KE, WANG, MENG, ZHANG, MIN and MA, SHAOPING, 2015. Does Vertical Bring More Satisfaction?: Predicting Search Satisfaction in a Heterogeneous Environment In: Proceedings of the 24th ACM International on Conference on Information and Knowledge Management. 1581-1590LIU, ZEYANG, LIU, YIQUN, ZHOU, KE, ZHANG, MIN and MA, SHAOPING, 2015. Influence of Vertical Result in Web Search Examination In: Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval. 193-202ZHOU, KE, GROVER, CLAIRE, KLEIN, MARTIN and TOBIN, RICHARD, 2015. No More 404s: Predicting Referenced Link Rot in Scholarly Articles for Pro-Active Archiving In: Proceedings of the 15th ACM/IEEE-CS Joint Conference on Digital Libraries. 233-236DEMEESTER, THOMAS, TRIESCHNIGG, DOLF, NGUYEN, DONG, HIEMSTRA, DJOERD and ZHOU, KE, 2015. FedWeb Greatest Hits: Presenting the New Test Collection for Federated Web Search In: Proceedings of the 24th International Conference on World Wide Web. 27-28ZHOU, KE, LUO, ROGER JIE, HIEMSTRA, DJOERD and JOSE, JOEMON M., 2015. HIA'15: Heterogeneous Information Access Workshop at WSDM 2015 In: Proceedings of the Eighth ACM International Conference on Web Search and Data Mining. 423-424BOTA, HORATIU, ZHOU, KE, JOSE, JOEMON M. and LALMAS, MOUNIA, 2014. Composite Retrieval of Heterogeneous Web Search In: Proceedings of the 23rd International Conference on World Wide Web. 119-130KLEIN, MARTIN AND VAN DE SOMPEL, HERBERT AND SANDERSON, ROBERT AND SHANKAR, HARIHAR AND BALAKIREVA, LYUDMILA AND ZHOU, KE AND TOBIN, RICHARD, 2014. Scholarly Context Not Found: One in Five Articles Suffers from Reference Rot PLOS ONE. 9(12), 1-39LIU, YIQUN, WANG, CHAO, ZHOU, KE, NIE, JIANYUN, ZHANG, MIN and MA, SHAOPING, 2014. From Skimming to Reading: A Two-stage Examination Model for Web Search In: Proceedings of the 23rd ACM International Conference on Conference on Information and Knowledge Management. 849-858ZHOU, KE, DEMEESTER, THOMAS, NGUYEN, DONG, HIEMSTRA, DJOERD and TRIESCHNIGG, DOLF, 2014. Aligning Vertical Collection Relevance with User Intent In: Proceedings of the 23rd ACM International Conference on Conference on Information and Knowledge Management. 1915-1918ZHOU, KE, LALMAS, MOUNIA, SAKAI, TETSUYA, CUMMINS, RONAN and JOSE, JOEMON M., 2013. On the Reliability and Intuitiveness of Aggregated Search Metrics In: Proceedings of the 22Nd ACM International Conference on Information & Knowledge Management. 689-698WHITING, STEWART, ZHOU, KE, JOSE, JOEMON and LALMAS, MOUNIA, 2013. Temporal Variance of Intents in Multi-faceted Event-driven Information Needs In: Proceedings of the 36th International ACM SIGIR Conference on Research and Development in Information Retrieval. 989-992ZHOU, KE, CUMMINS, RONAN, LALMAS, MOUNIA and JOSE, JOEMON M., 2013. Which Vertical Search Engines Are Relevant? In: Proceedings of the 22Nd International Conference on World Wide Web. 1557-1568ZHOU, KE, WHITING, STEWART, JOSE, JOEMON M. and LALMAS, MOUNIA, 2013. The Impact of Temporal Intent Variability on Diversity Evaluation In: Proceedings of the 35th European Conference on Advances in Information Retrieval. 820-823WHITING, STEWART, ZHOU, KE, JOSE, JOEMON, ALONSO, OMAR and LEELANUPAB, TEERAPONG, 2012. CrowdTiles: Presenting Crowd-based Information for Event-driven Information Needs In: Proceedings of the 21st ACM International Conference on Information and Knowledge Management. 2698-2700ZHOU, KE, CUMMINS, RONAN, LALMAS, MOUNIA and JOSE, JOEMON M., 2012. Evaluating Reward and Risk for Vertical Selection In: Proceedings of the 21st ACM International Conference on Information and Knowledge Management. 2631-2634ZHOU, KE, CUMMINS, RONAN, LAL",
  "content_length": 11158,
  "method": "requests",
  "crawl_time": "2025-12-01 13:41:18"
}